[{"url": "http://2012books.lardbucket.org/books/beginning-chemistry/s07-02-molecules-and-chemical-nomencl.html", "passage_text": "A molecule, however, is composed of more than one atom. Some elements exist naturally as molecules. For example, hydrogen and oxygen exist as two-atom molecules. Other elements also exist naturally as diatomic moleculesA molecule with only two atoms. (see Table 3.3 Elements That Exist as Diatomic Molecules). As with any molecule, these elements are labeled with a molecular formulaA formal listing of what and how many atoms are in a molecule. "}, {"url": "https://en.wikipedia.org/wiki/Diatomic_molecule", "passage_text": "Diatomic molecules are molecules composed of only two atoms, of either the same or different chemical elements. The prefix di-is of Greek origin, meaning two. If a diatomic molecule consists of two atoms of the same element, such as hydrogen (H 2) or oxygen (O 2), then it is said to be homonuclear. Otherwise, if a diatomic molecule consists of two different atoms, such as carbon monoxide (CO) or nitric oxide (NO), the molecule is said to be heteronuclear"}, {"url": "http://study.com/academy/lesson/diatomic-molecule-definition-example.html", "passage_text": "The subscript 2 of oxygen and nitrogen indicates the number of oxygen atoms and nitrogen atoms. So the oxygen molecules present in the atmosphere have two oxygen atoms and the nitrogen molecules have two nitrogen atoms. There are also other diatomic molecules that we encounter every day. Diatomic molecules are either homonuclear or heteronuclear. Homonuclear diatomic molecules are composed of two atoms of the same element, like in the case of oxygen and nitrogen shown in the illustration here."}, {"url": "https://en.wikipedia.org/wiki/Diatomic_molecule", "passage_text": "The only chemical elements that form stable homonuclear diatomic molecules at standard temperature and pressure (STP) (or typical laboratory conditions of 1 bar and 25 °C) are the gases hydrogen (H 2), nitrogen (N 2), oxygen (O 2), fluorine (F 2), and chlorine (Cl 2). If a diatomic molecule consists of two atoms of the same element, such as hydrogen (H 2) or oxygen (O 2), then it is said to be homonuclear."}, {"url": "http://study.com/academy/lesson/diatomic-molecule-definition-example.html", "passage_text": "There are seven elements that occur naturally as homonuclear diatomic molecules. All of these molecules are in the gaseous state. Five of these elements-hydrogen, nitrogen, oxygen, fluorine, and chlorine-occur as diatomic elements at room temperature, which is 25 degrees Celsius. Diatomic molecules are either homonuclear or heteronuclear. Homonuclear diatomic molecules are composed of two atoms of the same element, like in the case of oxygen and nitrogen shown in the illustration here."}, {"url": "http://www.angelo.edu/faculty/kboudrea/periodic/physical_diatomics.htm", "passage_text": "polyatomic element. A number of elements are found in their elemental form as diatomic molecules. In these molecules, two atoms are joined by one or more covalent bonds, forming a molecule with the general formula X 2. Lr. Key: diatomic element polyatomic element A number of elements are found in their elemental form as diatomic molecules. In these molecules, two atoms are joined by one or more covalent bonds, forming a molecule with the general formula X2."}, {"url": "http://study.com/academy/lesson/diatomic-molecule-definition-example.html", "passage_text": "It is made of one hydrogen atom and one chlorine atom. Diatomic molecules are either homonuclear or heteronuclear. Homonuclear diatomic molecules are composed of two atoms of the same element, like in the case of oxygen and nitrogen shown in the illustration here. Heteronuclear diatomic molecules are composed of two atoms of different elements, like in the case of hydrochloric acid and carbon monoxide"}, {"url": "http://chemistry.about.com/od/elementfacts/f/What-Are-The-Seven-Diatomic-Elements.htm", "passage_text": "There are seven elements that form diatomic molecules. This is a list of the seven diatomic elements, which are all gases. (Note that only five of these elements form diatomic molecule at room temperature.). Answer: The seven diatomic elements are: "}, {"url": "http://www.edurite.com/kbase/examples-of-diatomic-molecules", "passage_text": "Diatomic molecules are molecules composed only of two atom s, of either the same or different chemical element s. The prefix di-means two in Greek. Common diatomic molecules are hydrogen (H 2), nitrogen (N 2), oxygen (O 2), and carbon monoxide (CO). The bond in a homonuclear diatomic molecule is non-polar and covalent. In most diatomic molecules, the elements are nonidentical. Prominent examples include carbon monoxide, nitric oxide, and hydrogen chloride, but other important examples include MgO and NaCl."}, {"url": "http://www.answers.com/Q/What_are_the_seven_diatomic_molecules", "passage_text": "diatomic molecules are made up of two atoms. These two atoms can either be the same of different chemical elements. Depending on what elements are in place well that depends o … n what kind of bonding. For example in class i learned that a homo-nuclear diatomic molecule is non-polar and covalent. Examples of monoatomoc molecules are atoms of He, Ne, Ar, Kr, Xe. The diatomic molecule is a molecule that is composed of TWO atoms (either the same or different) and is able to exist nonbonded to other neighboring species."}]