[{"url": "http://www.answers.com/Q/What_is_a_cultural_artifact", "passage_text": "An artifact is a object or tool, or the remains of one, used by past cultures. Artifacts have been found from civilizations such as the Egyptians, Mayans, Aztecs, and Anasaz … i. Things that have been made by humans. The word is often used in connection with ancient objects. An artifact is a man made object, or an unneeded or unintended byproduct of some activity or process. 7 people found this useful. Edit. Share to: 1  6 Things to Know About the Kona Coffee Cultural Festival Maybe you have daydreamed about visiting a beach resort in Hawaii."}, {"url": "http://occonline.occ.cccd.edu/online/gmonahan/PS%20Assignments%201&2.pdf", "passage_text": "CULTURAL ARTIFACT SPEECH – 3-4 minutes Choice 1 for Speech 1 Public Speaking The cultural artifact speech is a product of our increasingly diverse culture. It is a speech that allows us to come to know more about the many cultures represented in our country as well as our classrooms. "}, {"url": "https://en.wikipedia.org/wiki/Cultural_artifact", "passage_text": "Cultural artifacts can include objects recovered from archaeological sites, or archaeological artifacts, but can also include objects of modern or near-modern society, or social artifacts. Cultural artifacts, whether ancient or current, have a significance because they offer an insight into: technological processes, economic development and social structure, among other attributes."}, {"url": "http://www.enotes.com/homework-help/explain-what-meant-by-cultural-artifact-can-you-443298", "passage_text": "dislike 1 like. Cultural artifacts are any things (such as objects, writings, artwork) which give information about the people and the culture by whom the artifact was used. "}, {"url": "http://www.igi-global.com/dictionary/cultural-artifact/6362", "passage_text": "What is Cultural Artifact. 1. Mediational object used by a member of a community to interact with other members. Examples of cultural artifact s are pencils, books, iPods, computer operating systems, and so forth."}, {"url": "http://www.answers.com/Q/What_is_a_cultural_artifact", "passage_text": "A Vietnamese cultural artifact refers to a behavioral pattern that  has it origins in Vietnam's ancient roots. It also refers to the  physical objects that are associated wi … th that particular cultural  behavior. 1 person found this useful. An artifact is a man made object, or an unneeded or unintended byproduct of some activity or process. 7 people found this useful. Edit. Share to: 1  6 Things to Know About the Kona Coffee Cultural Festival Maybe you have daydreamed about visiting a beach resort in Hawaii."}, {"url": "http://www.learner.org/workshops/hslit/session6/teaching/index.html", "passage_text": "Cultural Artifacts. Description A cultural artifact is an object that derives from and illuminates the history of a particular community. Artifacts can be, and often are, personal items, so students can begin searching for them in their homes. "}, {"url": "http://www.studymode.com/essays/Organizational-Artifacts-82610.html", "passage_text": "Text Preview. Organizational Artifacts. The culture of an organization is really its personality or, as some would say, how things are done around here. Culture is comprised of the assumptions, values, norms and tangible signs, better known as artifacts, of an organizations member and their behaviors."}, {"url": "https://en.wikipedia.org/wiki/Cultural_artifact", "passage_text": "Cultural artifact or artefact is a term used in the social sciences, particularly anthropology, ethnology, and sociology for anything created by humans which gives information about the culture of its creator and users. Artifact is the spelling in American English; artefact is usually preferred elsewhere. Cultural artifact is a more generic term and should be considered with two words of similar, but narrower, nuance: social artifact and archaeological artifact. Cultural artifacts, whether ancient or current, have a significance because they offer an insight into: technological processes, economic development and social structure, among other attributes."}]