[{"url": "https://msdn.microsoft.com/en-us/library/22kk2b44(v=vs.90).aspx", "passage_text": "In this example the Obsolete attribute is applied to class A and to method B.OldMethod. Because the second argument of the attribute constructor applied to B.OldMethod is set to true, this method will cause a compiler error, whereas using class A will just produce a warning."}, {"url": "https://msdn.microsoft.com/en-us/library/22kk2b44(v=vs.90).aspx", "passage_text": "Copy. Two warnings for class A are generated: one for the declaration of the class reference, and one for the class constructor. The Obsolete attribute can be used without arguments, but including an explanation of why the item is obsolete and what to use instead is recommended."}, {"url": "http://www.open-std.org/jtc1/sc22/wg21/docs/papers/2013/n3760.html", "passage_text": "This definition is not seen to match with what the proposed deprecated attribute is supposed to mean. As a counter-objection it has been noted that the definition above is actually void of any meaning, because it may be applied to any normative statement in the standard."}, {"url": "http://webdesign.about.com/od/htmltags/a/bltags_deprctag.htm", "passage_text": "1 The type attribute of list tags defines what type of list should be used. 2  This attribute has been deprecated in favor of the list-style-type property. 3  value. 4  The value attribute of list tags sets the value of the list item."}, {"url": "http://www.codehelp.co.uk/html/deprecated.html", "passage_text": ") are declared as deprecated in HTML4 by the. - the consortium that sets the HTML standards. Browsers should continue to support deprecated tags and attributes, but eventually these tags are likely to become obsolete and so future support cannot be guaranteed."}, {"url": "http://www.open-std.org/jtc1/sc22/wg21/docs/papers/2013/n3760.html", "passage_text": "Deprecated attribute [dcl.attr.deprecated]. The. deprecated can be used to mark names and entities whose use is still allowed, but is discouraged for some reason. [ Note: in particular, deprecated is appropriate for names and entities that are deemed obsolescent or unsafe."}, {"url": "https://css-tricks.com/list-of-depreciated-elements-still-in-widespread-use/", "passage_text": "Deprecated. A deprecated element or attribute is one that has been outdated by newer constructs. Deprecated elements are defined in the reference manual in appropriate locations, but are clearly marked as deprecated."}]