[{"url": "https://en.wikipedia.org/wiki/Erotomania", "passage_text": "Erotomania is a type of delusion in which the affected person believes that another person, usually a stranger, high-status or famous person, is in love with them. The illness often occurs during psychosis, especially in patients with schizophrenia, delusional disorder or bipolar mania. "}, {"url": "http://medicaljournals.se/acta/content/?doi=10.2340/00015555-0992&html=1", "passage_text": "*E-mail: zalewska@csk.umed.lodz.pl. Somatic-type delusional disorder is characterized by the development of either a single delusion or a set of related delusions that are not bizarre and cannot be classified as organic, schizophrenic or affective. In delusional disorder, delusions are usually persistent; their nature may be very variable, but not bizarre, which means that they originate from normal everyday situations (2). Patients with somatic-type delusional disorder are typically well-groomed and do not present noticeable evidence of any impairment."}, {"url": "http://www.minddisorders.com/Br-Del/Delusions.html", "passage_text": "1 Somatic delusion: A delusion whose content pertains to bodily functioning, bodily sensations, or physical appearance. 2  Usually the false belief is that the body is somehow diseased, abnormal, or changed. 3  An example of a somatic delusion would be a person who believes that his or her body is infested with parasites. 1 Beliefs that would be considered normal for an individual's religious or cultural background are not delusions. 2  Somatic delusion: A delusion whose content pertains to bodily functioning, bodily sensations, or physical appearance. 3"}, {"url": "http://mentalhealthdaily.com/2015/04/29/types-of-delusions-extensive-list-of-themes/", "passage_text": "1 An example of a non-bizarre delusion would be that an individual believes they are being secretly video-taped and phone-tapped by the F.B.I. as part of an investigation. 2  Mood-congruent delusions: These are considered delusions that directly stem from a person’s mood (e.g. depression or mania). Delusions are considered inaccurate beliefs held by an individual, (typically with a mental illness), regardless of logical evidence disproving the belief. A delusion differs from a belief that is held based on insufficient information or perceptual feedback."}, {"url": "http://psychcentral.com/disorders/delusional-disorder-symptoms/", "passage_text": "By Psych Central Staff ~ 2 min read. Delusional disorder is characterized by the presence of either bizarre or non-bizarre delusions which have persisted for at least one month. Non-bizarre delusions typically are beliefs of something occurring in a person’s life which is not out of the realm of possibility. For example, the person may believe their significant other is cheating on them, that someone close to them is about to die, a friend is really a government agent, etc."}, {"url": "http://www.minddisorders.com/Br-Del/Delusions.html", "passage_text": "1 A person with this type of delusion may have the false belief that the world is ending. 2  Delusional jealousy (or delusion of infidelity): A person with this delusion falsely believes that his or her spouse or lover is having an affair. 1 Beliefs that would be considered normal for an individual's religious or cultural background are not delusions. 2  Somatic delusion: A delusion whose content pertains to bodily functioning, bodily sensations, or physical appearance. 3  Usually the false belief is that the body is somehow diseased, abnormal, or changed."}, {"url": "http://www.minddisorders.com/Br-Del/Delusions.html", "passage_text": "A delusion is a belief that is clearly false and that indicates an abnormality in the affected person's content of thought. The false belief is not accounted for by the person's cultural or religious background or his or her level of intelligence. 1 Beliefs that would be considered normal for an individual's religious or cultural background are not delusions. 2  Somatic delusion: A delusion whose content pertains to bodily functioning, bodily sensations, or physical appearance. 3  Usually the false belief is that the body is somehow diseased, abnormal, or changed."}, {"url": "http://medical-dictionary.thefreedictionary.com/somatic+delusion", "passage_text": "delusion of reference a delusional conviction that ordinary events, objects, or behaviors of others have particular and unusual meanings specifically for oneself. somatic delusion a delusion that there is some alteration in a bodily organ or its function. It is one of the subtypes of delusional disorder. systematized d's a group of delusions organized around a common theme; typical of delusional disorders or paranoid schizophrenia. delusion of grandeur (grandiose delusion) delusional conviction of one's own importance, power, or knowledge, or that one is, or has a special relationship with, a deity or a famous pers"}, {"url": "http://mentalhealthdaily.com/2015/04/29/types-of-delusions-extensive-list-of-themes/", "passage_text": "1 Non-bizarre delusions: These are considered delusions that theoretically are possible, but still unlikely based on circumstances. 2  An example of a non-bizarre delusion would be that an individual believes they are being secretly video-taped and phone-tapped by the F.B.I. as part of an investigation. Delusions are considered inaccurate beliefs held by an individual, (typically with a mental illness), regardless of logical evidence disproving the belief. A delusion differs from a belief that is held based on insufficient information or perceptual feedback."}, {"url": "http://www.minddisorders.com/Br-Del/Delusions.html", "passage_text": "1 These may be combined with other delusions, such as grandiose delusions (the belief that the affected person was chosen by God, for example), delusions of control, or delusions of guilt. 2  Beliefs that would be considered normal for an individual's religious or cultural background are not delusions. 1 Beliefs that would be considered normal for an individual's religious or cultural background are not delusions. 2  Somatic delusion: A delusion whose content pertains to bodily functioning, bodily sensations, or physical appearance. 3  Usually the false belief is that the body is somehow diseased, abnormal, or changed."}]