[{"url": "https://en.wikipedia.org/wiki/Fuel_injector", "passage_text": "Fuel injection is a system for introducing fuel into internal combustion engines, and into automotive engines, in particular. On diesel engines, fuel injection is a necessity, whilst on petrol engines fuel injection is an alternative to the carburetor. In piston aircraft engines, continuous-flow fuel injection is the most common type. In contrast to automotive fuel injection systems, aircraft continuous flow fuel injection is all mechanical, requiring no electricity to operate. Two common types exist: the Bendix RSA system, and the TCM system."}, {"url": "http://howthingsfly.si.edu/propulsion/vertical-flight", "passage_text": "However, relying on the brute force of thrust to counteract weight requires far more fuel and energy than using the force of lift. Even so, an aircraft that can take off and land vertically can hover, fly slowly, and land in tight spaces—things conventional aircraft cannot do. Vertical Take-Off and Landing. Vertical takeoff and landing (VTOL) aircraft include fixed-wing aircraft that can hover, take off and land vertically, as well as helicopters and other aircraft with powered rotors, such as tiltrotors."}, {"url": "http://howthingsfly.si.edu/propulsion/vertical-flight", "passage_text": "Others, such as some helicopters, can only operate by VTOL, due to the aircraft lacking landing gear that can handle horizontal motion. To take off or land vertically, the powerful exhaust streams from a jet engine can be directed downward as well as backward, and their direction can be changed in mid-flight. Vertical Take-Off and Landing. Vertical takeoff and landing (VTOL) aircraft include fixed-wing aircraft that can hover, take off and land vertically, as well as helicopters and other aircraft with powered rotors, such as tiltrotors."}, {"url": "http://www.free-online-private-pilot-ground-school.com/aircraft-powerplant.html", "passage_text": "The aircraft powerplant. The airplane engine and propeller, often referred to as the aircraft powerplant, work in combination to produce thrust. The powerplant propels the airplane and drives the various systems that support the operation of an airplane. The fuel must be available to the engine under all conditions of engine power, altitude, attitude, and during all approved flight maneuvers. Two common classifications apply to fuel systems in small airplanes-gravity-feed and fuel-pump systems."}, {"url": "http://www.free-online-private-pilot-ground-school.com/aircraft-powerplant.html", "passage_text": "The starter engages the aircraft flywheel, rotating the engine at a speed that allows the engine to start and maintain operation. Electrical power for starting is usually supplied by an on-board battery, but can also be supplied by external power through an external power receptacle. The fuel must be available to the engine under all conditions of engine power, altitude, attitude, and during all approved flight maneuvers. Two common classifications apply to fuel systems in small airplanes-gravity-feed and fuel-pump systems."}, {"url": "https://en.wikipedia.org/wiki/Radio-controlled_model", "passage_text": "A radio-controlled model (or RC model) is a model that is steerable with the use of radio control. All types of vehicles imaginable have had RC systems installed in them, including cars, boats, planes, and even helicopters and scale railway locomotives. Radio-controlled boats are model boats controlled remotely with radio control equipment. The main types of RC boat are: scale models (12 inches (30 cm) – 144 (365 cm) in size), the sailing boat and the power boat. The latter is the more popular amongst toy grade models."}, {"url": "http://howthingsfly.si.edu/propulsion/vertical-flight", "passage_text": "The powerful exhaust streams from the jet engine of the Harrier fighter can be directed downward as well as backward, and their direction can be changed in mid-flight. This allows the Harrier to take off vertically, fly forward, stop in mid-air, back up, and land vertically. Vertical Take-Off and Landing. Vertical takeoff and landing (VTOL) aircraft include fixed-wing aircraft that can hover, take off and land vertically, as well as helicopters and other aircraft with powered rotors, such as tiltrotors."}, {"url": "http://www.stevewebb.co.uk/index.php?info=adv_glowengines", "passage_text": "This can lead to more confusion for the beginner! Most models you can buy will always recommend engine range for the size that should be used. The local model shop is always on hand to make sure you buy the correct engine and so if in doubt always ask. Glow engines run on a special type fuel."}, {"url": "http://guardianlv.com/2014/03/boeing-777-could-have-been-reprogrammed-from-the-ground/", "passage_text": "If this Boeing 777 could have been reprogrammed from the ground, any other “fly-by-wire” aircraft could also be reprogrammed and flown from wherever the remote hijackers happened to be. If that proves true, then there are more important things to worry about than the whereabouts of Flight 370. By Alan M. Milner. "}, {"url": "http://www.aircraftmaint.com/uploads/Oil_Change.pdf", "passage_text": "25free of sludge, dirt, varnish and other con-taminantsChanging oil is a frequent and easy task. Oil change intervals are usually every 50 hours for engines with an oil filter, and every 25 hours for those with only an oil screen. It can be ex-pensive to have this done at a shop. The prior owner of my airplane spent over $300 every 25 hours for an oil change, which represents $12 per hour of flight. Safety wire the filter to the engine. If your engine does not have an oil filter, then you need to inspect the screen. Prepare an oil drip catcher using an old oil bottle and place below the screen area – along with plenty of rags. Remove the safety wire on the oil screen and remove"}]