[{"url": "http://www.costowl.com/home-improvement/siding-brick-cost.html", "passage_text": "1 For a home with 1,500 exterior square feet, that s a total cost of approximately $9,000 to $22,500. 2  Brick veneer siding costs $5 to $10 per square foot (total brick veneer siding cost for 1,500 square feet: roughly $7,500 to $15,000). 1 Durability: It s not uncommon for brick siding to last 100 years or more and in many cases; brick endures for the life of the building. 2  As far as maintaining brick, very little upkeep is required for the first 25 years beyond exterior washing."}, {"url": "http://homewyse.com/costs/cost_of_brick_siding.html", "passage_text": "1 Brick Siding cost estimates may require an onsite inspection. 2  Usually these estimates will be free. 3  You should expect any estimate to be presented with an in-depth sales pitch/presentation. 4  Low to High labor cost range differences are in part due to variations in work load, job location and seasonal wage rates. 1 For accurate cost estimates, collect detailed bids from several qualified professionals. 2  The homewyse Brick Siding cost estimates do not include costs for removal and disposal of existing siding and trim, structural modifications or repairs, and any work on soffit or fascia."}, {"url": "http://www.costowl.com/home-improvement/siding-brick-cost.html", "passage_text": "The actual cost of brick siding may vary depending on your location, the complexity of the installation, and other factors. 1  Real brick siding costs $6 to $15 per square foot installed. 2  For a home with 1,500 exterior square feet, that s a total cost of approximately $9,000 to $22,500. 1 Durability: It s not uncommon for brick siding to last 100 years or more and in many cases; brick endures for the life of the building. 2  As far as maintaining brick, very little upkeep is required for the first 25 years beyond exterior washing."}, {"url": "http://homewyse.com/costs/cost_of_brick_siding.html", "passage_text": "Brick Siding-Pricing and Installation Cost Notes. Homewyse cost estimates are approximate ranges for basic work in typical conditions. The estimates should only be used for preliminary planning. Homewyse estimates are NOT substitutes for quotes from qualified vendors. 1 For accurate cost estimates, collect detailed bids from several qualified professionals. 2  The homewyse Brick Siding cost estimates do not include costs for removal and disposal of existing siding and trim, structural modifications or repairs, and any work on soffit or fascia."}, {"url": "http://www.insistonbrick.com/assets_html/learn-more/info/download_How-Much-Does-Brick-Cost.php", "passage_text": "How Much Does Brick Cost? The day you buy your brick home, the total cost should be in this range: 6 to 7% more than vinyl; 3 to 4% more than fiber cement; or 10 to 19% less than stone--for a home in the $250,000, 2,500 square foot range. Consider these points: 1. The extra upfront cost for brick translates into only a small increase in your monthly mortgage payments, likely no more than $50 per month for a $250,000 house. 2. Every year, compare d to vinyl and fiber cement siding, you will save up to 5% on homeowners insurance. 3."}, {"url": "http://www.remodelingexpense.com/costs/cost-of-brick-siding/", "passage_text": "If you’re looking for 2015 breakdown for Cost of Brick Siding materials and what installation cost might be, you’ve come to the right place. As an experienced licensed home improvement contractor, I know first hand what it should cost for various levels — from Basic, Better, and of course the best. This Brick Siding cost estimator will provide you with up to date pricing for your area. Simply enter your zip code and the square footage, next click update and you will see a breakdown on what it should cost to have Brick Siding installed onto your home. $7.20. 1  Cost can add up quickly, especially if you’re a novice and have never attempted a Brick Siding installation before. 2  Be sure to have a copy of the Brick Siding Manufacturer’s recommended installation requirements before starting, to make sure your project doesn’t end up costing you more money in the long-run."}, {"url": "http://www.costowl.com/home-improvement/siding-brick-cost.html", "passage_text": "1 Repairing brick siding might cost $15 to $25 per square foot. 2  Removing and disposing of existing siding, if not included in the initial estimate, might cost an additional $1 to $3 per square foot. 1 Durability: It s not uncommon for brick siding to last 100 years or more and in many cases; brick endures for the life of the building. 2  As far as maintaining brick, very little upkeep is required for the first 25 years beyond exterior washing."}, {"url": "http://homewyse.com/services/cost_to_install_brick_veneer_siding.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Brick Veneer Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Brick Veneer Siding ranges between $7.26 - $12.66 per square foot* . To estimate costs for your project: 1"}, {"url": "http://homewyse.com/costs/cost_of_brick_siding.html", "passage_text": "1 Brick Siding installation costs vary considerably by location. 2  For an accurate estimate in your area, enter your zip code in the calculator above. 3  Reduce total project cost by having multiple vendors bid on the same, detailed work specification of your Brick Siding project. 1 For accurate cost estimates, collect detailed bids from several qualified professionals. 2  The homewyse Brick Siding cost estimates do not include costs for removal and disposal of existing siding and trim, structural modifications or repairs, and any work on soffit or fascia."}, {"url": "http://www.costowl.com/home-improvement/siding-brick-cost.html", "passage_text": "Brick siding, with its unique combination of beauty, strength, and durability, is in a class of its own. The only downside to brick siding is price, which, due to the high level of skill required for proper installation, is considerably higher than other materials. 1 Durability: It s not uncommon for brick siding to last 100 years or more and in many cases; brick endures for the life of the building. 2  As far as maintaining brick, very little upkeep is required for the first 25 years beyond exterior washing."}]