[{"url": "https://en.wikipedia.org/wiki/Beveridge_Report", "passage_text": "William Beveridge. The 1942 report on Social Insurance and Allied Services, known commonly as the Beveridge Report, was an influential document in the founding of the welfare state in the United Kingdom, published in December 1942."}, {"url": "http://www.bbc.co.uk/history/ww2peopleswar/timeline/factfiles/nonflash/a1143578.shtml", "passage_text": "The Beveridge Report was presented by its author, Sir William Beveridge, to the British parliament in November 1942. It provided a summary of principles necessary to banish poverty and 'want' from Britain-Beveridge's mantra throughout the report was 'Abolition of want'. The paper proposed a system of social security which would be operated by the state, to be implemented at war's end."}, {"url": "https://en.wikiquote.org/wiki/William_Beveridge", "passage_text": "William Beveridge. From Wikiquote. The object of government in peace and in war is not the glory of rulers or of races, but the happiness of the common man. William Henry Beveridge, 1st Baron Beveridge of Tuggal (5 March 1879 – 16 March 1963) was a British economist and social reformer. "}, {"url": "https://en.wikipedia.org/wiki/William_Beveridge", "passage_text": "From Wikipedia, the free encyclopedia. For other people named William Beveridge, see William Beveridge (disambiguation) . William Henry Beveridge, 1st Baron Beveridge KCB (5 March 1879 – 16 March 1963) was a British economist, noted progressive and social reformer. Lord Beveridge married Jessy Janet, daughter of William Philip and widow of David Mair, in 1942. He died at his home on 16 March 1963, aged 84, and was buried in Thockrington churchyard, on the Northumbrian moors."}, {"url": "http://spartacus-educational.com/TUbeveridge.htm", "passage_text": "William Beveridge. William Beveridge, the eldest son of a judge in the Indian civil service, was born in Bengal, India, on 5th March 1879. After studying at Charterhouse and Balliol College, Oxford, he became a lawyer. Beveridge became interested in the social services and wrote about the subject for the Morning Post. In December 1942, Sir William Beveridge was the master of University College, Oxford. After a successful career in the civil service, he had been made director of the London School of Economics, remaining there from 1919 to 1937, when he moved to Oxford."}, {"url": "http://www.bbc.co.uk/history/historic_figures/beveridge_william.shtml", "passage_text": "William Beveridge was born on 5 March 1879 in Bengal, India, where his father was a judge in the Indian Civil Service. In 1945, the Labour Party defeated Winston Churchill's Conservative Party in the general election. The new prime minister, Clement Attlee, announced he would introduce the welfare state outlined in the 1942 Beveridge Report."}, {"url": "http://www.bbc.co.uk/history/historic_figures/beveridge_william.shtml", "passage_text": "William Beveridge, responsible for the 'Beveridge Report' which has since formed the basis for much social legislation c.1943 © Beveridge was a British economist and social reformer, closely associated with the development of the welfare state. In 1945, the Labour Party defeated Winston Churchill's Conservative Party in the general election. The new prime minister, Clement Attlee, announced he would introduce the welfare state outlined in the 1942 Beveridge Report."}, {"url": "http://www.beveridgefoundation.org/sir-william-beveridge/", "passage_text": "Whether you can answer that question may well depend on which generation you belong to or if you are or have been a student of British social policy. And yet there is not one person living in Britain today who will not have been touched by the work and vision of this one man. Sir William Beveridge. William Henry Beveridge was born in Bengal (Bangladesh) in 1879. His father was a judge in the Indian Civil Service. William was himself a lawyer having been educated at Charterhouse and Balliol College, Oxford. "}]