[{"url": "http://www.skyenimals.com/browse_habitat.cgi?habitat=freshwater", "passage_text": "© dan talson-Fotolia.com. Freshwater Freshwater habitats are found on all the continents of the earth except Antarctica. Freshwater habitats include lakes, rivers, marshes, wetlands and swamps. The cycle of evaporation of ocean water, rain and snow provide these habitats a constant source of fresh water."}, {"url": "http://www.funsci.com/fun3_en/guide/guide1/micro1_en.htm", "passage_text": "An atlas with more than 1700 drawings that are very useful for identifying protists. This is a valuable collection of drawings and information on freshwater unicellular organisms. The first part is a guide to the collection, the culture and the observation of protists."}, {"url": "http://www.ucmp.berkeley.edu/exhibits/biomes/freshwater.php", "passage_text": "Freshwater is defined as having a low salt concentration  usually less than 1%. Plants and animals in freshwater regions are adjusted to the low salt content and would not be able to survive in areas of high salt concentration (i.e., ocean). There are different types of freshwater regions: 1  Ponds and lakes."}, {"url": "http://tpwd.texas.gov/education/resources/texas-junior-naturalists/bugs-bugs-bugs/common-freshwater-organisms", "passage_text": "Common Freshwater Organisms. Mosquito fish. Fish Up to 2 1/2. They live in ditches, ponds, and lakes eating mosquito larvae and other insects. Mosquito fish give birth to live young. Tadpole. Amphibian. 1/8 to 3. Tadpoles are young frogs and toads. They eat algae and decaying aquatic plants."}, {"url": "http://www.funsci.com/fun3_en/guide/guide1/micro1_en.htm", "passage_text": "This article is the first in a series devoted to observations using a microscope and deals with the microscopic forms of life that inhabit mainly freshwater ecosystems. The aquatic environments host a rich variety of organisms and are a wonder to behold through a microscope."}, {"url": "http://www.skyenimals.com/browse_habitat.cgi?habitat=freshwater", "passage_text": "There are a wide variety of freshwater habitats. The animal species that live in these habitats vary dramatically from one area to another. Animals of all types, including large numbers of reptiles, fish and birds live in"}, {"url": "http://kids.nceas.ucsb.edu/biomes/freshwater.html", "passage_text": "PLANTS: Plants and algae are important to freshwater biomes because they provide oxygen through photosynthesis, and food for animals in this biome. Yum, delicious algae. In fact, that slimy scum you see on the surface of a pond or lake is lunch for many of your favorite aquatic animals, like turtles."}]