[{"url": "http://www.answers.com/Q/What_type_of_energy_is_stored_in_chemical_bonds", "passage_text": "Energy stored in chemical bonds of molecules is referred to as  chemical energy. 6 people found this useful. Edit. Share to: 1  The Periodic Table of Elements Life is sustained by a number of chemical elements. 2  They are responsible for the birth of planets and the evolution of cells to complex organisms. greater than the energy stored in the bonds of the products   Why?   Because when a chemical bond is formed, the resulting compound has less potential energy than th …."}, {"url": "http://www.answers.com/Q/What_kind_of_energy_is_stored_in_a_chemical_bond", "passage_text": "greater than the energy stored in the bonds of the products   Why?   Because when a chemical bond is formed, the resulting compound has less potential energy than th …. What is the energy stored in the chemical bonds between atoms? I think you're looking for 'chemical energy,' as opposed to electrical energy, or mechanical energy, or kinetic energy, etc."}, {"url": "http://www.brighthubeducation.com/science-homework-help/118803-what-is-chemical-potential-energy/", "passage_text": "Bonding with Chemical Potential Energy. Chemical potential energy is that which is stored within the bonds of atoms and molecules of a substance. The bonds have stored chemical potential energy which is released when they are broken and the substance undergoes a chemical reaction. "}, {"url": "https://en.wikipedia.org/wiki/Chemical_bond", "passage_text": "A chemical bond is an attraction between atoms that allows the formation of chemical substances that contain two or more atoms. The bond is caused by the electrostatic force of attraction between opposite charges, either between electrons and nuclei, or as the result of a dipole attraction. A strong chemical bond is formed from the transfer or sharing of electrons between atomic centers and relies on the electrostatic attraction between the protons in nuclei and the electrons in the orbitals. The types of strong bond differ due to the difference in electronegativity of the constituent elements."}, {"url": "http://www.eschooltoday.com/energy/kinds-of-energy/what-is-chemical-energy.html", "passage_text": "Chemical energy. Chemical Energy is energy stored in the bonds of chemical compounds (atoms and molecules). It is released in a chemical reaction, often producing heat as a by product (exothermic reaction) . The dry wood is a store of chemical energy. As it burns in the fireplace, chemical energy is released and converted to thermal energy (heat) and light energy. Notice that the wood now turns into ashes (a new substance). Food is also a good example of stored chemical energy. This energy is released during digestion. Molecules in our food are broken down into smaller pieces. As the bonds between these atoms loosen or break, a chemical reaction will occur, and new compounds are created"}, {"url": "http://www.eschooltoday.com/energy/kinds-of-energy/what-is-chemical-energy.html", "passage_text": "RECOMMENDED LESSONS: Chemical energy. Chemical Energy is energy stored in the bonds of chemical compounds (atoms and molecules). It is released in a chemical reaction, often producing heat as a by product (exothermic reaction) . Batteries, biomass, petroleum, natural gas, and coal are examples of stored chemical energy. The dry wood is a store of chemical energy. As it burns in the fireplace, chemical energy is released and converted to thermal energy (heat) and light energy. Notice that the wood now turns into ashes (a new substance). Food is also a good example of stored chemical energy. This energy is released during digestion. Molecules in our food are broken down into smaller pieces. As the bonds between these atoms loosen or break, a chemical reaction will occur, and new compounds are created"}, {"url": "https://en.wikiversity.org/wiki/Energy_Storage_in_Biological_Systems", "passage_text": "All molecules have energy stored in the chemical bonds that link their atoms. However, relatively few molecules found inside living organisms function as significant energy storage molecules. From Wikiversity. Living organisms use two major types of energy storage. Energy-rich molecules such as glycogen and triglycerides store energy in the form of covalent chemical bonds. Cells synthesize such molecules and store them for later release of the energy."}]