[{"url": "http://www.merriam-webster.com/dictionary/bloodstream", "passage_text": "bloodstream. noun blood·stream \\-ˌstrēm\\. Tweet. : the flow of blood that moves through the heart and body. Full Definition of BLOODSTREAM. 1. : the flowing blood in a circulatory system. 2. See bloodstream defined for English-language learners"}, {"url": "http://www.audioenglish.org/dictionary/bloodstream.htm", "passage_text": "The blood flowing through the circulatory system. Classified under: Nouns denoting body parts. Hypernyms (bloodstream is a kind of...): blood (the fluid (red in vertebrates) that is pumped by the heart). Holonyms (bloodstream is a part of...): cardiovascular system; circulatory system (the organs and tissues involved in circulating blood and lymph through the body). "}, {"url": "http://medical-dictionary.thefreedictionary.com/blood+stream", "passage_text": "blood·stream. Flowing blood as it is encountered in the circulatory system, as distinguished from blood that has been removed from the circulatory system or sequestered in a part; thus, something added to the bloodstream may be expected to become distributed to all parts of the body through which blood is flowing. A. there are several treatments and medications against systemic fungal infections, yeasts included. but in order to get treated you have to go through a proper diagnosis and a Dr. should check what kind of fungus you are having and prescribe the medication that fits it."}, {"url": "http://dictionary.cambridge.org/dictionary/english/bloodstream", "passage_text": "bloodstream noun [S]. › the ​flow of ​blood around the ​body: The ​drug ​works more ​quickly if it is ​injected ​directly into the bloodstream. (Definition of bloodstream from the Cambridge Advanced Learner’s Dictionary & Thesaurus © Cambridge University Press). See all translations. › the ​flow of ​blood through the ​body: Most ​medicines ​reach the ​body through the bloodstream. (Definition of bloodstream from the Cambridge Academic Content Dictionary"}, {"url": "http://dictionary.cambridge.org/dictionary/english/bloodstream", "passage_text": "bloodstream noun [U]. › the ​flow of ​blood through the ​body: Most ​medicines ​reach the ​body through the bloodstream. (Definition of bloodstream from the Cambridge Academic Content Dictionary © Cambridge University Press)."}, {"url": "https://en.wikipedia.org/wiki/Blood_alcohol_content", "passage_text": "Blood Alcohol Content is the legal name for BAC but Blood Alcohol Concentration is sometimes used for simpler description. Blood alcohol content is usually expressed as a percentage of ethanol in the blood in units of mass of alcohol per volume of blood or mass of alcohol per mass of blood, depending on the country. "}, {"url": "http://popcrush.com/ed-sheeran-bloodstream-listen/", "passage_text": "Share on Facebook Share on Twitter. Ed Sheeran ’s sensuous new song ‘Bloodstream’ is a thought-provoking track on sin and addiction. The English singer never fails to impress when it comes to writing songs with melodies and lyrics that make you think and feel long after the track has finished playing. ‘Bloodstream’ is undoubtedly one of those instances. "}, {"url": "http://medical-dictionary.thefreedictionary.com/blood+stream", "passage_text": "blood·stream. The flowing blood as it is encountered in the circulatory system, as distinguished from blood that has been removed from the circulatory system or sequestered in a part; thus, something added to the bloodstream may be expected to become distributed to all parts of the body through which blood is flowing. A. there are several treatments and medications against systemic fungal infections, yeasts included. but in order to get treated you have to go through a proper diagnosis and a Dr. should check what kind of fungus you are having and prescribe the medication that fits it."}, {"url": "http://medical-dictionary.thefreedictionary.com/blood+stream", "passage_text": "bloodstream. the blood flowing through the circulatory system in the living body. Also written blood stream. A. there are several treatments and medications against systemic fungal infections, yeasts included. but in order to get treated you have to go through a proper diagnosis and a Dr. should check what kind of fungus you are having and prescribe the medication that fits it."}]