[{"url": "http://www.nolo.com/legal-encyclopedia/how-much-will-i-get-ssi-disability-benefits.html", "passage_text": "Your SSI payment will be reduced by the amount of any income that you have, except for certain amounts that Social Security may disregard. In particular, Social Security disregards the first $20 of any monthly income, and the first $65 of any earned income (wages from work or self-employment income). The ordinary SSI payment in 2015, without any reductions for income or additions for a state supplement, is $733 for an individual and $1,100 for a couple. From year to year, those amounts, called the “federal base rate,” increase to account for increased costs of living."}, {"url": "http://www.ssa.gov/OACT/COLA/SSI.html", "passage_text": "SSI Annual Report. SSI payment standards, 1975 & later. Maximum Federal Supplemental Security Income (SSI) payment amounts increase with the cost-of-living increases that apply to Social Security benefits. The latest such increase, 1.7 percent, becomes effective January 2015. SSI amounts for 2015. "}, {"url": "http://www.disabilitysecrets.com/page4-44.html", "passage_text": "Everyone on SSI disability (Supplemental Security Income) is eligible for the same base amount, $733. But your actual monthly SSI payment will depend on whether you have any countable income, whether you are married, and what state you live in. But not all income is subtracted from your SSI payment. Each month, the SSA does not count: 1  the first $20 of any kind of income you receive. 2  the first $65 of money you earn from work, plus half of the remainder. 3  food stamps."}, {"url": "http://www.alllaw.com/articles/nolo/disability/collecting-payments.html", "passage_text": "SSI. The SSI program currently pays a maximum benefit of $733 a month if you are single or $1,100 a month for a couple. This is the total amount you are eligible to receive, but it will be reduced by certain other benefits or income you may receive. Social Security applies a formula to your average lifetime earnings to calculate the amount of your monthly check. The average SSD payment is currently $1,165. The highest dollar amount you can receive from SSD monthly in 2015 is $2,663."}, {"url": "http://www.alllaw.com/articles/nolo/disability/collecting-payments.html", "passage_text": "How much your monthly disability check will be depends on whether you'll receive Social Security Disability (SSD) or Supplemental Security Income (SSI). SSD is for workers who are insured under the Social Security retirement system. Social Security applies a formula to your average lifetime earnings to calculate the amount of your monthly check. The average SSD payment is currently $1,165. The highest dollar amount you can receive from SSD monthly in 2015 is $2,663."}, {"url": "http://www.nolo.com/legal-encyclopedia/how-much-will-i-get-ssi-disability-benefits.html", "passage_text": "To determine the amount of Sanjay’s SSI payment, subtract $307.50 from the federal base rate of $721, and Sanjay will receive $413.50. This example assumes that Sanjay is not eligible for a state supplement. If he were eligible for a state supplement, then his SSI payment would be higher by the amount of the supplement. The ordinary SSI payment in 2015, without any reductions for income or additions for a state supplement, is $733 for an individual and $1,100 for a couple. From year to year, those amounts, called the “federal base rate,” increase to account for increased costs of living."}, {"url": "http://www.downsizinggovernment.org/ssa/supplemental-security-income", "passage_text": "Total federal spending on SSI will be about $57 billion in 2013, which includes $3.7 billion for the program's administrative costs. An additional $3.3 billion will go toward state supplementary benefits in the 14 states and District of Columbia, where such benefits are administered by the SSA. As the number of beneficiaries has increased, so has spending on the program. Supplemental Security Income spending has risen from $33 billion in 2000 to an estimated $57 billion in 2013, which is a 70 percent increase. In real (after-inflation) dollars, the increase since 2000 has been 29 percent"}, {"url": "http://info.legalzoom.com/ssi-inheritance-23351.html", "passage_text": "If you rely on Supplemental Security Income, or SSI, to pay your bills, you may be very concerned about the possibility of losing those benefits when you receive an inheritance, which may make you ineligible for SSI. Losing SSI eligibility may also make you ineligible for crucial Medicaid benefits. For example, if you receive benefits as an individual and already have $500 in resources, an inheritance of $1,500 or more would disqualify you for SSI since you would have reached the $2,000 limit for income or resources."}]