[{"url": "http://www.culinaryschools.org/career-info/salaries/", "passage_text": "Common salaries for head chefs are between $50,000 and $100,000, with the highest salaries awarded by the largest and most reputable properties. Entrepreneurialism is a worthy pursuit for chef school graduates, and can lead to unlimited income potential."}, {"url": "http://www.jobmonkey.com/chefjobs/chef-pay/", "passage_text": "The sous chef can earn between $60,000 and $80,000 annually, while the chef de partie can earn from $35,000 to $70,000 per year. The demi chef in a restaurant or hotel resort can earn chef wages in the region of $30,000 to $45,000. A commis chef makes a yearly chef salary of about $20,000 to $30,000. The chef salary for a pastry chef is around $4500 per month. Assistant cooks can earn various chef wages as do the food preparers for a hotel or restaurant. As an assistant cook you are looking in the region of $20,000 per year and food preparers can earn from $8,000 to $16,000 annually."}, {"url": "https://www.restaurants.com/blog/how-much-do-celebrity-chefs-earn/", "passage_text": "Other top earners including Wolfgang Puck at $20 million, Rachael Ray at $25 million, Paula Deen at $17 million, and Todd English at $11 million. Considering the average salary for a chef/owner of a restaurant is now less than $85,000 a year, all of these celebrity chefs’ salaries are nothing to sneeze at."}, {"url": "http://www.huffingtonpost.com/the-daily-meal/highest-paying-restaurant-jobs_b_882115.html", "passage_text": "A kitchen's highest in command is also its highest paid. Based on a 2009 salary survey, StarChefs.com lists an executive chef's annual income as $79,402. That number rises to $85,685 for executive chefs who are also restaurant owners, and even higher for executive chefs working at a private facility."}, {"url": "http://work.chron.com/much-culinary-chef-paid-5415.html", "passage_text": "Salary Breakdown. One of the major differences in what chefs get paid is their job description. According to All Culinary Schools, an executive chef in charge of a kitchen earned a median salary of $67,995 as of June 2012, while a sous chef who reports to the executive chef earned a median salary of $42,501."}]