[{"url": "http://www.dogbreedinfo.com/pekingese.htm", "passage_text": "The Pekingese received its name from the ancient city of Peking, which is now called Beijing. They were considered sacred dogs regarded as a legendary Foo Dog that drove away spirits. They could only be owned by Chinese royalty and were regarded as semi-divine and if you stole one of these dogs you were put to death. "}, {"url": "https://en.wikipedia.org/wiki/Pekingese", "passage_text": "Keeping the Pekingese coat healthy and presentable requires daily brushing, and a trip to the groomer every 8–12 weeks. One important thing for new owners to remember is that dogs intended as a house pet may be kept in a puppy cut which is much more low maintenance than a show cut. Mrs Flander's Mai Mai weighed only a little over 4 pounds and many other breeders had bred true miniatures of a similar size. He noted that miniatures may appear in a litter bred from full-sized Pekingese and were exhibited in classes for dogs less than 7 pounds at the major dog shows in Britain."}, {"url": "https://puppyfind.com/pekingese.php", "passage_text": "Pekingese. The Pekingese (also known as the Lion Dog, Foo Dog, Fu Dog, Peking Palasthund, and of course 宮廷獅子狗) is an ancient breed from China of unknown ancestry, though by Buddhist legend it was created from the mating of a lion with a butterfly, monkey, or marmoset. Other famous Pekingese include romance novelist Barbara Cartland s white dog Peke and Sun Yat Sen, pet of Henry Harper from Harper Brothers Publishing, who, along with his owner, survived the Titanic disaster! The Pekingese has a shoulder height of 15-23 cm (6-9 in) and weighs 3-6 kg (7-14 lbs)."}, {"url": "http://www.dogster.com/dog-breeds/Pekingese", "passage_text": "Pekes have the most wonderful personalities. I love this breed because the dogs have smushie faces, flat heads and the most wonderful personality of any other dog. They are sometimes a one-person dog and will comfort that person when they are not well or down. My Peke licks tears off my face when I cry. The Look of a Pekingese. Pekingese are compact dogs with long, flowing hair—truly “lion-like” in the way they look and how they carry themselves. Their wide flat heads have dark, slightly prominent (but not bulging) eyes, flat faces, dark wrinkled muzzles and hanging, heart-shaped ears."}, {"url": "https://en.wikipedia.org/wiki/Pekingese", "passage_text": "The breed originated in China in antiquity. Recent DNA analysis confirms that the Pekingese breed is one of the oldest breeds of dog, one of the least genetically diverged from the wolf. For centuries, they could only be owned by members of the Chinese Imperial Palace. Mrs Flander's Mai Mai weighed only a little over 4 pounds and many other breeders had bred true miniatures of a similar size. He noted that miniatures may appear in a litter bred from full-sized Pekingese and were exhibited in classes for dogs less than 7 pounds at the major dog shows in Britain."}, {"url": "http://dogtime.com/dog-breeds/pekingese#!", "passage_text": "The Pekingese is heavy for his size with a stocky, muscular body. He is 6 to 9 inches tall at the shoulder and weighs 7 to 14 pounds. In imperial China, Pekingese that weighed less than six pounds were called sleeve dogs and rode in the sleeve cuffs of the robes worn by members of the imperial court. Pekingese make good apartment dogs, and of course they'll be equally happy in a mansion. They love to run and romp but need a fenced area because they will explore and may wander off. Pekingese appreciate going for walks and will be excellent company jaunting through the neighborhood with you."}, {"url": "http://www.akc.org/dog-breeds/pekingese/", "passage_text": "The Pekingese is a well-balanced, compact dog of Chinese origin with a heavy front and lighter hindquarters. Its temperament is one of directness, independence and individuality. Its image is lionlike, implying courage, dignity, boldness and self-esteem rather than daintiness or delicacy. Not Very Active; Pekes do well with just a couple of walks a day and some indoor playtime. Health For 140 years Pekingese have been one of healthiest of all breeds, as they still are today."}, {"url": "https://en.wikipedia.org/wiki/Pekingese", "passage_text": "The Pekingese (also known as the Lion Dog, Peking Lion Dog, Pelchie Dog, or Peke) is an ancient breed of toy dog, originating in China. Mrs Flander's Mai Mai weighed only a little over 4 pounds and many other breeders had bred true miniatures of a similar size. He noted that miniatures may appear in a litter bred from full-sized Pekingese and were exhibited in classes for dogs less than 7 pounds at the major dog shows in Britain."}, {"url": "http://dogtime.com/dog-breeds/pekingese#!", "passage_text": "Pekingese were dogs bred for centuries to be the cherished companions of the imperial family of China. Today they are still cherished family companions and show dogs who greet everyone they meet with dignity and grace. Pekingese make good apartment dogs, and of course they'll be equally happy in a mansion. They love to run and romp but need a fenced area because they will explore and may wander off. Pekingese appreciate going for walks and will be excellent company jaunting through the neighborhood with you."}, {"url": "http://asianhistory.about.com/od/china/p/History-of-the-Pekingese-Dog.htm", "passage_text": "Photo of a Pekingese dog or peke, descended from China's imperial lion-dogs. pekie on Flickr.com. The Pekingese dog, often affectionately called the Peke by western pet-owners, has a long and illustrious history in China. Nobody knows quite when the Chinese first began to breed the Pekingese, but they have been associated with the emperors of China since at least the 700s CE."}]