[{"url": "http://pdbio325.byu.edu/SlideDatabase/Epitheliumslides/TerminalBronchioleepi.aspx", "passage_text": "A: Hyaline Cartilage on the periphery is part of the cartilagenous plates that do not enter into the lung. B: Bronchioles carry air from the bronchi to the terminal bronchioles and are line by ciliated pseudostratified columnar epithelium C: Terminal bronchioles are lined by ciliated simple columnar epithelium. B: Terminal Bronchioles open up into alveoli allowing the air to pass directly into the alveolar spaces and diffuse across the simple squamous epitheliums of the alveoli and capillaries C: Alveolus is lined by a thin layer of simple squamous to facilitate diffusion of O2 and CO2. A: Ciliated so"}, {"url": "http://www.histology.leeds.ac.uk/respiratory/conducting.php", "passage_text": "The epithelium is either columnar or cuboidal. The final branches of the bronchioles are called terminal bronchioles. These have a layer smooth muscle surrounding their lumens. Stimulation of the vagus nerve (parasympathetic) causes the smooth muscle to contract, and reduce the diameter of the terminal bronchioles. The trachea branches to give rise to two primary (main) bronchii. These then branch successively to give rise in turn to secondary and tertiary bronchii. These then branch to give rise to several orders of progressively smaller airways called bronchioles, the smallest of which"}, {"url": "https://en.wikipedia.org/wiki/Bronchiole", "passage_text": "They are branches of the bronchi, and are part of the conducting zone of the respiratory system. The bronchioles divide further into smaller terminal bronchioles which are still in the conducting zone and these then divide into the smaller respiratory bronchioles which mark the beginning of the respiratory region. The diameter of the bronchioles is often said to be less than 1 mm, though this value can actually range from 5 mm to 0.3 mm. As stated, these bronchioles do not have hyaline cartilage to maintain their patency. Instead, they rely on elastic fibers attached to the surrounding lung tissue for support."}, {"url": "http://www.lab.anhb.uwa.edu.au/mb140/CorePages/Respiratory/respir.htm", "passage_text": "Bronchioles are the terminal segments of the conductive portion. At the transition from bronchi to bronchioles the epithelium changes to a ciliated columnar epithelium, but most of the cell types found in the epithelium of other parts of the conductive portion are still present. "}, {"url": "https://en.wikipedia.org/wiki/Bronchiole", "passage_text": "A pulmonary lobule is the portion of the lung ventilated by one bronchiole. Bronchioles are approximately 1mm or less in diameter and their walls consist of ciliated cuboidal epithelium and a layer of smooth muscle. Bronchioles divide into even smaller bronchioles, called terminal, which are 0.5mm or less in diameter. The diameter of the bronchioles is often said to be less than 1 mm, though this value can actually range from 5 mm to 0.3 mm. As stated, these bronchioles do not have hyaline cartilage to maintain their patency. Instead, they rely on elastic fibers attached to the surrounding lung tissue for support."}, {"url": "https://en.wikipedia.org/wiki/Bronchiole", "passage_text": "The bronchioles or bronchioli are the passageways by which air passes through the nose or mouth to the alveoli (air sacs) of the lungs, in which branches no longer contain cartilage or glands in their submucosa. The diameter of the bronchioles is often said to be less than 1 mm, though this value can actually range from 5 mm to 0.3 mm. As stated, these bronchioles do not have hyaline cartilage to maintain their patency. Instead, they rely on elastic fibers attached to the surrounding lung tissue for support."}, {"url": "http://medcell.med.yale.edu/histology/respiratory_system_lab.php", "passage_text": "1 Describe the changes in the type of epithelium throughout the respiratory system. 2  Explain how the structure of different segments of the respiratory airways reflect the functional roles that these airways play in air movement and gas exchange. Respiratory bronchioles also have cuboidal epithelia, but contain some alveoli. Alveolar Sac and Alveolus: An alveolar sac contains many alveoli. Type I and Type II Pneumocyte: Type I pneumocytes are squamous cells that support gas exchange; type II pneumocytes are cuboidal and create pulmonary surfactant."}, {"url": "http://www.siumed.edu/~dking2/crr/rsguide.htm", "passage_text": "In particular, one should be familiar with the four basic tissue types, most especially epithelium and connective tissue and with the basic tools of histology. Overview of Respiratory Tract Histology. The lung is one of several organs that packs a large epithelial surface area into a compact volume. The squamous epithelial cells of the alveolar walls are sometimes called Type I pneumocytes. As noted above, these squamous Type I cells facilitate gas exchange. Scattered among the squamous cells are occasional larger cuboidal cells, sometimes called greater alveolar cells and sometimes called Type I"}, {"url": "http://www.answers.com/Q/What_is_the_type_of_epithelium_in_bronchi_and_bronchioles", "passage_text": "The epithelium of the terminal bronchioles is composed of three types of cells-ciliated cells, nonciliated cells and a few basal cells. The epithelium of the respiratory bronchioles has three cell populations. The first near the terminal bronchioles consists of the nonciliated columnar, ciliated columnar and basal cells. The second consists of nonciliated cuboidal cells. The third is most similar to the alveolar epithelial lining. These are nonciliated cells, cuboidal type II cells, and squamous type I"}, {"url": "https://en.wikipedia.org/wiki/Bronchiole", "passage_text": "Bronchospasm, a potentially life-threatening situation, occurs when the smooth muscular tissue of the bronchioles constricts, severely narrowing their diameter. The most common cause of this is asthma. Bronchospasm is commonly treated by oxygen therapy and bronchodilators. The diameter of the bronchioles is often said to be less than 1 mm, though this value can actually range from 5 mm to 0.3 mm. As stated, these bronchioles do not have hyaline cartilage to maintain their patency. Instead, they rely on elastic fibers attached to the surrounding lung tissue for support."}]