[{"url": "http://bestaccountingdegrees.net/faq/what-is-the-difference-between-an-accountant-and-a-controller/", "passage_text": "Best Accounting Degrees. If you are pursuing a bachelor’s degree with a major in accounting or finance, it is important to learn the difference between an accountant and a controller. Controllers are in charge of money and accountants, and accountants are responsible for keeping tabs on where the money is going. As the Chief Accounting Officer of an organization, the controller, often called a comptroller, is also responsible for complying with tax laws and government reporting requirements."}, {"url": "http://bestaccountingdegrees.net/faq/what-is-the-difference-between-an-accountant-and-a-controller/", "passage_text": "The major difference between the requirements for a controller and an accountant is that the controller is a manager, and their focus in school will be in both finance and business administration. If you start in the field of accounting as an accountant, your experience may replace the need for an MBA. Controllers are in charge of money and accountants, and accountants are responsible for keeping tabs on where the money is going. As the Chief Accounting Officer of an organization, the controller, often called a comptroller, is also responsible for complying with tax laws and government reporting requirements."}, {"url": "http://www.indeed.com/q-assistant-controller-jobs.html", "passage_text": "A Bachelor’s Degree in Accounting or Finance and a minimum of 5-7years experience in an Accounting Manager or Assistant Controller position within a... 4 days ago-save job-email-more... 1  View all Reinsel Kuntz Lesher jobs in Wyomissing, PA-Wyomissing jobs. Assistant Controller. Reporting directly to the Controller, the Assistant Controller would be responsible for assisting the Controller with all the financial management processes and... 31 minute"}, {"url": "http://work.chron.com/difference-between-finance-manager-controller-5705.html", "passage_text": "The controller would also be responsible for preparing special reports for regulators, governmental agencies and banks. Generally, the controller oversees a company's accounting function and conducts internal audits. In most cases, the controller's reports are prepared for the company's executive management team. Another finance manager could negotiate financial terms of a new contract with her counterpart at another company. Finance managers can be involved in planning the issuance of securities or mergers and acquisitions."}, {"url": "http://bestaccountingdegrees.net/faq/what-is-the-difference-between-an-accountant-and-a-controller/", "passage_text": "The easiest way to distinguish between an accountant and a controller is to understand what each does in the accounting department. Basically speaking, an accountant is in charge of preparing financial reports and analyzing how the company is performing financially. Controllers are in charge of money and accountants, and accountants are responsible for keeping tabs on where the money is going. As the Chief Accounting Officer of an organization, the controller, often called a comptroller, is also responsible for complying with tax laws and government reporting requirements."}, {"url": "http://www.payscale.com/research/US/Job=Assistant_Controller/Salary", "passage_text": "Pay by Experience Level for Assistant Controller. Median of all compensation (including tips, bonus, and overtime) by years of experience. Although individuals who have less than five years' experience earn $56K on average, people with five to 10 years benefit from a notably larger average of $69K. Assistant Controller Salary. (United States). Assistant Controllers in the United States are often veterans in their line of work, with close to one-half bringing more than 10 years of experience to the table. Salaries slide in at $67K annually on average but can range from $44K to $105K per year."}, {"url": "http://www.payscale.com/research/US/Job=Accounting_Manager/Salary", "passage_text": "Accounting Manager Salary. (United States). An Accounting Manager earns an average salary of $63,244 per year. A skill in Financial Analysis is associated with high pay for this job. For the first five to ten years in this position, pay increases steeply, but any additional experience does not have a big effect on pay. Read More... In most businesses, an accounting manager develops and implements systems for gathering, analyzing, verifying, and reporting certain types of financial information. Typically, an accounting manager is a part of a larger group (or managerial staff) that includes other mid-level business managers."}, {"url": "http://www.payscale.com/research/US/Job=Assistant_Controller/Salary", "passage_text": "This position can be found in many different companies with a finance department, and it is expected that one is familiar with the work that company does. For this reason, industry-specific experience often is required for this job. Most assistant controller positions require a degree in finance or accounting. This position is not entry level, and experience is generally required in a role that focuses on accounting and has some supervisory elements. Assistant Controller Salary. (United States). Assistant Controllers in the United States are often veterans in their line of work, with close to one-half bringing more than 10 years of experience to the table. Salaries slide in at $67K annually on average but can range from $44K to $105K per year."}]