[{"url": "http://theunconventionalfarmer.com/natural-techniques/bokashi/", "passage_text": "It’s important to note – Bokashi composting doesn’t break things down the way traditional aerobic composting does. You won’t get a pile of dirt from your kitchen scraps, fish, bones or whatever you’re composting this way. "}, {"url": "http://www.weimarbiotech.com/web/bokashi.php?select=4", "passage_text": "Sprinkling a layer of Bokashi Powder on a layer of food waste in a tightly closed bin, the EM (Efficient Microbes) in the Bokashi Powder starts to pickle the food waste. During the pickling process Bokashi Tea is produced and the solids eventually will change into nutrient rich soil conditioner. Bokashi. Bokashi Composting is an easy, convenient & clean way of turning your kitchen food waste into nutrient rich soil conditioner in your kitchen without the bad smell."}, {"url": "https://www.planetnatural.com/composter-connection/indoor-composting/bokashi-composting/", "passage_text": "In Bokashi composting, kitchen scraps of all kinds — including meat and dairy products banned from aerobic systems — are mixed with some of the inoculated bran, pressed into the Bokashi bucket, covered with another handful of bran, and tightly covered. "}, {"url": "http://www.bokashicompostinghq.com/what-is-bokashi-composting/", "passage_text": "Bokashi ss composting is a method of quickly breaking down organic waste. Unlike conventional composting, a Bokashi system makes use of Effective Microorganisms (EM) that are added to the organic waste stored in a Bokashi bin. The Bokashi composting process is more of a fermentation process than a conventional composting process. Air is not required for the organic matter to ferment."}, {"url": "http://www.the-compost-gardener.com/bokashicomposting.html", "passage_text": "I've been using bokashi composting on and off for the past three years. What I like about it is that it really handles all the kitchen waste in our house. It's especially handy in the winter when the trek to the compost bin is less appealing. "}, {"url": "http://gardensfromgarbage.org/home/faq_about_bokashi_composting", "passage_text": "With bucket composting you can compost ALL food waste-meat, oils, dairy. In bokashi bin composting, you take your food waste directly to your compost bin, without going through the process of fermentation first. Add it to your bin, add bokashi, and be sure to cover it. It is a little slower process, and you won't want to compost meat, fish, dairy, or heavy oils. "}, {"url": "http://www.compostguy.com/bokashi-resource-page/", "passage_text": "Bokashi is a Japanese term meaning ‘fermented organic matter’. It is often referred to as a type of ‘composting’ but it is actually a anaerobic fermentation process, resulting in a much different end product than that produced via composting. "}, {"url": "http://www.bokashicompostinghq.com/", "passage_text": "Welcome to Bokashi Composting HQ. Bokashi Composting Headquarters is a hub for all of your Bokashi needs. Whether you’ve only just heard of it or you’ve been using the process for a while, you’ll find what you’re looking for here. This method of composting is not a new idea, but it is becoming more and more popular. "}, {"url": "http://www.bokashicompostinghq.com/what-is-bokashi-composting/", "passage_text": "Using a Bokashi composter it is possible to compost foods scraps which can’t be added to traditional compost system. Meat, fish, cheese and cooked food waste are all welcome in a Bokashi composter. This is a great way of putting those extra nutrients to good use in the garden, rather than sending them to landfill. Unlike conventional composting, a Bokashi system makes use of Effective Microorganisms (EM) that are added to the organic waste stored in a Bokashi bin. The Bokashi composting process is more of a fermentation process than a conventional composting process. Air is not required for the organic matter to ferment."}, {"url": "http://www.microbialearth.com/bokashi-1/", "passage_text": "Bokashi Composting is a unique indoor product used to recycle food scraps into an organic soil conditioner and create your own homemade plant food. Bokashi means fermented organic matter. Bokashi composting uses anaerobic (without oxygen) fermentation to break down food scraps very quickly while avoiding rotting odors. Bokashi Composting can use all of your food scraps, including meat scraps, small bones, cheese, milk, fats, oils and greases, as well as vegetables and fruit. It is an excellent solution for juicing leftovers."}]