[{"url": "http://www.dog-health-guide.org/symptomsofcaninecoronavirusinfection.html", "passage_text": "Symptoms of canine coronavirus infection range from no symptoms to the severe. They usually start to appear 2 to 5 days after exposure. The virus lives in the intestinal lining of your pet. Other symptoms of canine coronavirus infection include loss of appetite, depression, nausea, and vomiting."}, {"url": "http://www.webmd.com/lung/coronavirus", "passage_text": "Common Symptoms of Coronavirus. The symptoms of most coronaviruses are similar to any other upper-respiratory infection, including runny nose, coughing, sore throat, and sometimes a fever. In most cases, you won't know whether you have a coronavirus or a different cold-causing virus, such as rhinovirus. A coronavirus is a kind of common virus that causes an infection in your nose, sinuses, or upper throat. Most coronaviruses are not dangerous. Some types of them are serious, though."}, {"url": "http://www.medicinenet.com/mers_middle_east_respiratory_syndrome/article.htm", "passage_text": "1 MERS-CoV is a type of coronavirus, similar to the one that caused SARS (severe acute respiratory syndrome) or the common cold. 2  MERS-CoV has not been previously identified in humans. 3  Like the SARS virus, MERS-CoV is most similar to coronaviruses found in bats. 1 The infection appears to be the result of spread of the virus from camels to humans, resulting in limited person-to-person spread but not sustained transmission in humans. 2 "}, {"url": "http://www.medicinenet.com/mers_middle_east_respiratory_syndrome/article.htm", "passage_text": "Symptoms of MERS Virus Infection. A new aggressive pathogen has recently been identified; it's a coronavirus that causes symptoms of fever, cough, and shortness of breath that may become severe or deadly. The disease is termed MERS (Middle East Respiratory Syndrome or MERS-CoV). 1 The infection appears to be the result of spread of the virus from camels to humans, resulting in limited person-to-person spread but not sustained transmission in humans. 2  MERS-CoV is a type of coronavirus, similar to the one that caused SARS (severe acute respiratory syndrome) or the common cold."}, {"url": "http://www.who.int/csr/disease/coronavirus_infections/faq/en/", "passage_text": "Middle East respiratory syndrome (MERS) is a viral respiratory disease caused by a coronavirus (MERS‐CoV) that was first identified in Saudi Arabia in 2012. Coronaviruses are a large family of viruses that can cause diseases ranging from the common cold to Severe Acute Respiratory Syndrome (SARS). "}, {"url": "http://www.ehow.com/about_5557115_corona-virus-symptoms.html", "passage_text": "Signs of Danger. Symptoms of coronavirus infection in dogs, cats and humans include vomiting, diarrhea, lethargy, coughing and sneezing. Cats and humans usually run a fever with a coronavirus where dogs usually do not. Your pet may have coronavirus without you knowing, as symptoms can be absent or cause isolated bouts of sickness. However, once your pet shows symptoms, the virus can turn serious or deadly quickly; consult your veterinarian instead of attempting to treat the disease yourself."}, {"url": "http://www.vetinfo.com/feline-coronavirus-symptoms.html", "passage_text": "Symptoms of the coronavirus are generally very mild, and may include a runny nose and watery eyes. If your cat is one of the rare felines who does develop the feline infectious peritonitis condition, the following signs and symptoms may occur: 1  Sneezing. 2  Watery eyes. 3  Runny nose. 4  Nasal discharge. 5  Diarrhea. 6  Loss of energy. "}, {"url": "http://www.cdc.gov/coronavirus/mers/faq.html", "passage_text": "A: MERS-CoV is the acronym for Middle East Respiratory Syndrome Coronavirus, the virus that causes MERS. When referring to the virus and not the illness, CDC uses this acronym. When referring to the illness, CDC uses MERS. The virus was first reported in 2012 in Saudi Arabia. A: No. MERS-CoV is not the same coronavirus that caused severe acute respiratory syndrome (SARS) in 2003. However, like the SARS virus, MERS-CoV is most similar to coronaviruses found in bats. CDC is still learning about MERS."}, {"url": "http://www.cdc.gov/coronavirus/about/index.html", "passage_text": "A: Common human coronaviruses usually cause mild to moderate upper-respiratory tract illnesses of short duration. Symptoms may include runny nose, cough, sore throat, and fever. These viruses can sometimes cause lower-respiratory tract illnesses, such as pneumonia. "}]