[{"url": "http://traveltips.usatoday.com/six-flags-theme-park-background-information-59341.html", "passage_text": "Texas-based amusement park corporation Six Flags was founded in 1961. Since successfully opening its flagship park, Six Flags Over Texas in Arlington, the company has expanded to 14 locations in three countries -- the United States, Mexico and Canada -- as of June 2011."}, {"url": "http://traveltips.usatoday.com/six-flags-theme-park-background-information-59341.html", "passage_text": "The U.S.A.'s Six Flags locations can be found in Arlington, Texas; Austell, Georgia; Eureka, Missouri; Jackson, New Jersey; Valencia, California; Gurnee, Illinois; San Antonio, Texas; Largo, Maryland; Queensbury, New York; and Marietta, Georgia."}, {"url": "http://www.csus.edu/indiv/s/shawg/articles/facilities/six_flags_timeline.html", "passage_text": "1960 - All things a-go, construction for Six Flags Over Texas begins at the Dallas suburb of Arlington, which is located mid-way between Dallas and Fort Worth. Like Disneyland (and unlike some of the other failed parks during the 1957-1960 years), Six Flags Over Texas is located in a growing suburban area near freeways."}, {"url": "https://www.sixflags.com/", "passage_text": "For more than 50 years, Six Flags has entertained millions of families with world-class coasters, themed rides, thrilling water parks and unique attractions including up-close animal encounters, Fright Fest® and Holiday in the Park®."}, {"url": "http://investors.sixflags.com/", "passage_text": "CT. Six Flags Entertainment Corporation is the world’s largest regional theme park company with $1.2 billion in revenue and 18 parks across North America. The company operates 16 parks in the United States, one in Mexico City and one in Montreal, Canada."}, {"url": "http://rollercoaster.wikia.com/wiki/Six_Flags", "passage_text": "1,441 pages on this wiki. Six Flags Entertainment Corp. is the world's largest amusement park corporation, based on quantity of properties, and the 4th most popular, in terms of attendance. The company was founded in 1960, and currently maintains 13 theme parks located throughout North America, and 1 in Canada."}, {"url": "http://www.csus.edu/indiv/s/shawg/articles/facilities/six_flags_timeline.html", "passage_text": "1961 - Six Flags Over Texas opens to the public at a cost of just over $3 million dollars. Compared to Disneyland's $17.5 million, Pacific Ocean Park's $16 million or Freedomland's $33 million, this amount is hardly Texas-sized."}, {"url": "https://www.sixflags.com/", "passage_text": "Official home page of Six Flags, the world’s largest regional theme park company with 18 parks across North America. The company operates 16 parks in the United States, one in Mexico City and one in Montreal, Canada."}, {"url": "http://investors.sixflags.com/", "passage_text": "Six Flags Entertainment Corporation is the world’s largest regional theme park company with $1.2 billion in revenue and 18 parks across North America."}]