[{"url": "http://finance.zacks.com/irs-income-tax-underpayment-penalty-2354.html", "passage_text": "If you fail to pay your taxes on time, the IRS will assess a penalty of 0.5 percent of the overdue amount for each month or part of a month that the amount remains unpaid. The maximum penalty is 25 percent of the overdue amount."}, {"url": "https://ttlc.intuit.com/questions/2547642-what-s-the-irs-penalty-for-filing-late", "passage_text": "The IRS treats each late filer individually and calculates penalties and interest on a case-by-case basis. Once they've received or accepted your return, they'll figure your penalties (plus possible interest) and then send you a separate bill. For this reason, TurboTax cannot calculate late-filing penalties or interest. However, you can get a rough idea below (courtesy of IRS Tax Topic 653)."}, {"url": "https://ttlc.intuit.com/questions/2547642-what-s-the-irs-penalty-for-filing-late", "passage_text": "1 The late filing penalty is 5% of the additional taxes owed amount for every month (or fraction thereof) your return is late, up to a maximum of 25%. 2  If you file more than 60 days after the due date, the minimum penalty is $135 or 100% of your unpaid tax, whichever is smaller."}, {"url": "http://taxes.about.com/od/backtaxes/qt/irs_tax_penalty.htm", "passage_text": "Interest rates are set by the IRS every three months. Currently, the IRS interest rate for underpayments of tax is 3% per year. The interest is calculated for each day your balance due is not paid in full. Interest is assessed on the unpaid amount of tax plus any late filing or late payment penalties. (Internal Revenue Code section 6601 .). IRS interest rates are variable and are set quarterly."}, {"url": "http://www.homeworksolutions.com/knowledge-center/how-does-the-irs-calculate-penalties-and-interest/", "passage_text": "The total late–filing penalty is usually 5% of the tax owed for each month, or part of a month, that your return is late up to five months (25%). If your return is over 60 days late, the minimum penalty for late filing is the smaller of $100 or 100 percent of the tax owed."}, {"url": "http://finance.zacks.com/irs-income-tax-underpayment-penalty-2354.html", "passage_text": "Failure to File Penalty. If you don't file a tax return at all — and thereby underpay your taxes by 100 percent — the IRS will assess a failure to file penalty of 5 percent of the overdue amount for every month or part of a month in which the tax is not paid, up to a maximum of 25 percent."}]