[{"url": "http://www.iup.edu/page.aspx?id=30647", "passage_text": "One branch of anthropology—social or cultural anthropology—applies this comparative perspective to the study of human culture: the norms, values, and standards transmitted from one generation to the next and by which people act. The word itself tells the basic story—from the Greek anthropos (human being) and logia (science), it is nothing less than the scientific study of humankind, from its beginnings, millions of years ago, to the present day."}, {"url": "http://oregonstate.edu/instruct/anth370/gloss.html", "passage_text": "age category-a culturally defined category based on age used to define the life cycle, such as infant, youth, teenager, young adult, adult, elderly. fact-a description of a bit or piece of some domain of inquiry. family-families are universal in cultures, but their definition and dynamics are changing. A very inclusive definition is two or more people who define themselves as a family."}, {"url": "http://oregonstate.edu/instruct/anth370/gloss.html", "passage_text": "A process of external culture change. adaptation-patterns of behavior which enable a culture to cope with its surroundings. adjudication-mediation with the ultimate decision being made by an unbiased third party. affinal-members of one's kindred who are related through a marital linkage. fact-a description of a bit or piece of some domain of inquiry. family-families are universal in cultures, but their definition and dynamics are changing. A very inclusive definition is two or more people who define themselves as a family."}, {"url": "http://what-when-how.com/social-and-cultural-anthropology/comparative-method-anthropology/", "passage_text": "Comparative method (Anthropology). ‘There is only one method in social anthropology, the comparative method – and that is impossible.’ So, it is often reported, said E.E. Evans-Pritchard – though the aphorism appears nowhere in his published writings. In his book The Methodology of Anthropological Comparison, Gopala Sarana (1975) distinguishes three kinds of comparative method: global-sample comparison, controlled comparison, and illustrative comparison. Global-sample comparison, or global comparison, was the kind of comparison to which Galton took exception."}, {"url": "http://www.anthrobase.com/Dic/eng/def/comparative.htm", "passage_text": "Dictionary Home AnthroBase Home Bookmark, cite or print this page. Anthropology is a comparative science in the sense that the fieldworker always comes to the field from another planet, and necessarily compares his own home world with the world of the field. "}, {"url": "https://en.wikipedia.org/wiki/Anthropology", "passage_text": "Cultural anthropology is the comparative study of the manifold ways in which people make sense of the world around them, while social anthropology is the study of the relationships among persons and groups. Political economy in anthropology is the application of the theories and methods of Historical Materialism to the traditional concerns of anthropology, including, but not limited to, non-capitalist societies."}, {"url": "https://en.wikipedia.org/wiki/Anthropology", "passage_text": "Archaeology, which studies past human cultures through investigation of physical evidence, is thought of as a branch of anthropology in the United States, although in Europe, it is viewed as a discipline in its own right, or related to other disciplines. Political economy in anthropology is the application of the theories and methods of Historical Materialism to the traditional concerns of anthropology, including, but not limited to, non-capitalist societies."}, {"url": "https://en.wikipedia.org/wiki/Cultural_anthropology", "passage_text": "Cultural anthropology is a branch of anthropology focused on the study of cultural variation among humans and is in contrast to social anthropology which perceives cultural variation as a subset of the anthropological constant. "}, {"url": "https://en.wikipedia.org/wiki/Anthropology", "passage_text": "Biological Anthropology and Physical Anthropology are synonymous terms to describe anthropological research focused on the study of humans and non-human primates in their biological, evolutionary, and demographic dimensions. Political economy in anthropology is the application of the theories and methods of Historical Materialism to the traditional concerns of anthropology, including, but not limited to, non-capitalist societies."}, {"url": "http://oregonstate.edu/instruct/anth370/gloss.html", "passage_text": "nodes-the individuals in a person's social network. non-academic anthropology-careers where anthropology is used to solve problems and improve the human condition. noseibal-a lost ball hit outside the field of play, a hit for six runs. fact-a description of a bit or piece of some domain of inquiry. family-families are universal in cultures, but their definition and dynamics are changing. A very inclusive definition is two or more people who define themselves as a family."}]