[{"url": "https://en.wikipedia.org/wiki/Pulse_oximetry", "passage_text": "Pulse oximetry is a non-invasive method for monitoring a person's O 2 saturation. In its most common (transmissive) application mode, a sensor device is placed on a thin part of the patient's body, usually a fingertip or earlobe, or in the case of an infant, across a foot. A pulse oximeter is a medical device that indirectly monitors the oxygen saturation of a patient's blood (as opposed to measuring oxygen saturation directly through a blood sample) and changes in blood volume in the skin, producing a photoplethysmogram."}, {"url": "http://www.pulseoximetersplus.com/categories/Pulse-Oximeter-News/What-Does-a-Pulse-Oximeter-Reading-Mean/", "passage_text": "If a person has a case of hypoxia, he or she is advised to get a pulse oximeter at home to be able to monitor the oxygen in his or her blood regularly. Mild hypoxia is when there is a 90% to 95% reading being given by the device. Moderate hypoxia is at 90% to 90% reading. There is this model of pulse oximeter known as finger pulse oximeter. This model is able to measure the saturation of hemoglobin together with the oxygen. In a normal situation, each gram of hemoglobin holds 1.34 milliliters of oxygen. The percentage is based on this normal reading."}, {"url": "https://en.wikipedia.org/wiki/Pulse_oximetry", "passage_text": "Reflectance pulse oximetry may be used as an alternative to transmissive pulse oximetery described above. This method does not require a thin section of the person's body and is therefore well suited to more universal application such as the feet, forehead and chest, but it also has some limitations. A pulse oximeter is a medical device that indirectly monitors the oxygen saturation of a patient's blood (as opposed to measuring oxygen saturation directly through a blood sample) and changes in blood volume in the skin, producing a photoplethysmogram."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/test_procedures/pulmonary/oximetry_92,p07754/", "passage_text": "Pulse oximetry is a procedure used to measure the oxygen level (or oxygen saturation) in the blood. It is considered to be a noninvasive, painless, general indicator of oxygen delivery to the peripheral tissues (such as the finger, earlobe, or nose). "}, {"url": "http://www.pulseoximetersplus.com/categories/Pulse-Oximeter-News/What-Does-a-Pulse-Oximeter-Reading-Mean/", "passage_text": "What Does a Pulse Oximeter Reading Mean. Pulse oximeter is a medical device you can use if you want to know the level of saturation of oxygen in your blood. The readings produce by this device are accompanied by the respiratory rate as well as by the percentage of oxygen a person is able to breathe in. There is this model of pulse oximeter known as finger pulse oximeter. This model is able to measure the saturation of hemoglobin together with the oxygen. In a normal situation, each gram of hemoglobin holds 1.34 milliliters of oxygen. The percentage is based on this normal reading."}, {"url": "https://answers.yahoo.com/question/index?qid=20090515085907AAE1qc5", "passage_text": "Rating Newest Oldest. Best Answer: An oximeter reading refers to pulse oximetry. This is the amount of oxygen being carried in your blood around your body (expressed as a percentage).Normal is considered above 95%. A pulse oximeter reading of 87 is low. 73 is dangerous. A pulse of 47 is ok when asleep ut 27 is too low for anyone. "}, {"url": "http://www.mhoxygen.com/index.php/faq/326-does-your-pulse-oximeter-mean-what-it-says", "passage_text": "A pulse oximeter can show you why. Finger pulse oximeters are mainly useful to reassure you that your oxygenation is OK (90+%), or that you should don oxygen or troubleshoot the situation (85% or below). The fact that their readings are often inaccurate and misleading does not mean that they are useless! "}, {"url": "http://medical-dictionary.thefreedictionary.com/pulse+oximeter", "passage_text": "finger oximeter a pulse oximeter whose sensor is attached to a finger, so that the oxygenation of blood flowing through the finger can be determined. See illustration. Finger oximeter. Pulse oximetry transducer properly placed on a finger. Fold the Oxisensor over the end of the digit. "}, {"url": "https://pulseoximetersplus.wordpress.com/2014/09/04/pulse-oximeter-readings-what-do-they-mean/", "passage_text": "Pulse Oximeters are devices that are typically slipped onto the finger to read a persons heart rate and measure oxygen blood levels. They may also be slipped onto the toes, nose or earlobes. A pulse oximeter works by shining an infrared light through your body tissue onto a photo sensor. A Pulse Oximeter will also display a heart rate reading. Healthy heart rate readings depend on your age. For elderly persons over the age of 70, a heart rate in the region of 90 beats per minute is considered a normal level. A healthy pulse rate for adults aged 18-70 falls anywhere between 60 and 80 beats per minute."}, {"url": "http://www.pulseoximetersplus.com/categories/Pulse-Oximeter-News/What-Does-a-Pulse-Oximeter-Reading-Mean/", "passage_text": "If you have history of cardiac and respiratory disease, you would definitely need a pulse oximeter in your home in order for you to be able to monitor your body on a regular basis. The blood circulating the human body is able to carry two forms of oxygen. There is this model of pulse oximeter known as finger pulse oximeter. This model is able to measure the saturation of hemoglobin together with the oxygen. In a normal situation, each gram of hemoglobin holds 1.34 milliliters of oxygen. The percentage is based on this normal reading."}]