[{"url": "http://edis.ifas.ufl.edu/hs1208", "passage_text": "Each of the listed ligands, when combined with a micronutrient, can form a chelated fertilizer. Chelated micronutrients are protected from oxidation, precipitation, and immobilization in certain conditions because the organic molecule (the ligand) can combine and form a ring encircling the micronutrient."}, {"url": "http://edis.ifas.ufl.edu/pdffiles/HS/HS120800.pdf", "passage_text": "Chela-tion keeps a micronutrient from undesirable reactions in solution and soil. The chelated fertilizer improves the bioavailability of micronutrients such as Fe, Cu, Mn, and Zn, and in turn contributes to the productivity and profitability of commercial crop production."}, {"url": "http://www.smart-fertilizer.com/articles/chelate-fertilizers", "passage_text": "Chelated compounds are more stable than non-chelated compounds. Therefore, metallic chelates are widely used in agriculture as micronutrient fertilizers to supply plants with Iron, Manganese, Zinc and Copper. The most common chelates used in agriculture are EDTA, DTPA and EDDHA."}, {"url": "http://edis.ifas.ufl.edu/hs1208", "passage_text": "Figure 2. Schematic diagram of chelated fertilizers facilitating nutrient uptake for foliar application. Without chelation (aqua), micronutrients stay on the leaf surface. With chelation (aqua surrounded by blue), micronutrients first move into the mesophyll and then release micronutrients."}, {"url": "http://www.micronutrients-fertilizers.com/index.html", "passage_text": "We are offering chelated micronutrients and micronutrient fertilizers such as EDTA calcium, EDTA iron, EDTA magnesium, EDTA cobalt, EDTA manganese, EDTA zinc, copper DTPA, fe DTPA, zinc DTPA and ferric ammonium EDTA. Also manufacture and export acid chelate range and a wide variety of phosphates."}, {"url": "http://edis.ifas.ufl.edu/hs1208", "passage_text": "Chelation keeps a micronutrient from undesirable reactions in solution and soil. The chelated fertilizer improves the bioavailability of micronutrients such as Fe, Cu, Mn, and Zn, and in turn contributes to the productivity and profitability of commercial crop production."}, {"url": "http://edis.ifas.ufl.edu/hs1208", "passage_text": "Each of the ligands (Table 1) can form a chelated fertilizer with one or more micronutrients. The effectiveness and efficiency of a particular chelated fertilizer depends on the pH of the plant growth medium."}, {"url": "http://www.vcngroup.org/chelated-micronutrients-fertilizers.html", "passage_text": "Iron is often abundant in soil but hard to absorb by the plants. We provide chelated form of iron that enables plants to take in the nutrient with ease. The micronutrient enriched composition promotes health of crops. We pack the compound in a laminated packet so that the product retains its goodness."}]