[{"url": "http://www.pcmag.com/article2/0,2817,2407896,00.asp", "passage_text": "If you're shopping for a mobile phone, you're in for a lot of acronyms. Here's what you need to know about two basic, yet important, terms. Two basic technologies in mobile phones, CDMA and GSM represent a gap you can't cross. They're the reason you can't use many AT&T phones on Verizon's network and vice versa. That's not the case with CDMA. In the U.S., CDMA carriers use network-based white lists to verify their subscribers. That means you can only switch phones with your carrier's permission, and a carrier doesn't have to accept any particular phone onto its network. It could, but typically, U.S. carriers choose not to."}, {"url": "http://www.wisegeek.com/what-is-a-gsm-phone.htm", "passage_text": "One of the benefits of a GSM phone is the ease with which users can change carriers or handsets. This is because of the phone's Subscriber Identification Module (SIM) card, which is a removable smart card that carries the user's contacts, calendar information, and personal identification information. A SIM card, which is used in GSM phones. Having a GSM phone is a good idea for people who travel outside the U.S. often. A GSM phone may be beneficial for someone who needs to transfer a lot of data-heavy"}, {"url": "http://www.tomsguide.com/forum/id-972702/unlocked-gsm-phone.html", "passage_text": "Unlocked GSM phone means that it wouldn't be locked into a specific carrier network. On the upside it means freedom to choose your own GSM carrier that suits your needs (and wallet) best. On the down side several carrier-specific features may not be available. "}, {"url": "https://en.wikipedia.org/wiki/GSM", "passage_text": "GSM (Global System for Mobile Communications, originally Groupe Special Spécial), mobile is a standard developed by The European Telecommunications Standards (INSTITUTE) etsi to describe the protocols for-second (GENERATION) 2g digital cellular networks used by mobile, phones first deployed In finland In july. 1991 GSM is a cellular network, which means that cell phones connect to it by searching for cells in the immediate vicinity. There are five different cell sizes in a GSM network— macro, micro, pico, femto, and umbrella cells."}, {"url": "http://www.ebay.com/gds/Whats-the-Difference-Between-GSM-and-CDMA-Cell-Phones-/10000000178258796/g.html", "passage_text": "GSM, or Global System for Mobile, is the primary type of technology used for cell phones in the rest of the world. Within the United States, a much small number of network service providers are on the GSM standard, among them T-Mobile and AT and T. Buying CDMA or GSM Cell Phones on eBay. The easiest way of finding a GSM-or CDMA-compliant phone is to simply search by this categorization. Have in mind the type of phone you are interested in purchasing-for example, a Samsung Galaxy-and include the search term GSM or CDMA in the eBay search box as you begin."}, {"url": "http://www.wisegeek.org/what-is-an-unlocked-gsm-phone.htm", "passage_text": "An unlocked GSM phone. A SIM card for an unlocked GSM phone. New SIM cards can be placed into an unlocked GSM phone. An unlocked GSM phone can be used with any other carrier who also uses a GSM network. The ability to unlock a cell phone depends on the type of phone and the technology associated with it. View slideshow of images above. Watch the Did-You-Know slideshow"}, {"url": "http://www.wisegeek.com/what-is-a-gsm-phone.htm", "passage_text": "10 most extreme places on Earth. A GSM phone is a type of mobile phone that uses the Global System for Mobile Communications to send and receive phone calls. This is one of the two main standards for mobile communication in the world, with the other being Code Division Multiple Access (CDMA). A SIM card, which is used in GSM phones. Having a GSM phone is a good idea for people who travel outside the U.S. often. A GSM phone may be beneficial for someone who needs to transfer a lot of data-heavy information."}, {"url": "http://www.wisegeek.com/what-is-gsm.htm", "passage_text": "GSM, or Global System for Mobile Communications, is a cellular phone protocol that is standard in most parts of the world. Technology experts created the protocol in the 1980s and '90s to standardize cellular phone service between countries in Europe. "}]