[{"url": "http://www.nhs.uk/Conditions/Malnutrition/Pages/Causes.aspx", "passage_text": "Causes of malnutrition. Malnutrition is caused by a lack of nutrients in your diet. This is either due to an inadequate diet or problems absorbing nutrients from food. Medical conditions that can lead to malnutrition include: 1  a condition that causes a lack of appetite, such as cancer, liver disease, persistent pain or nausea. 2  a mental health condition, such as depression or schizophrenia, which may affect your ability to look after yourself"}, {"url": "http://msue.anr.msu.edu/news/alcohol_can_lead_to_malnutrition", "passage_text": "Alcohol abuse creates an internal environment that predisposes individuals to malnutrition. Alcohol must be processed by the digestive system, which creates competition for limited nutritional resources that would normally nourish the body. 1 Because alcohol is a diuretic that increases the output of urine, it can cause the loss of such water-soluble minerals such as zinc, magnesium and potassium. 2  Zinc status appears to be particularly affected by alcohol and zinc deficiency interferes with the ability to taste and smell, further limiting dietary intake."}, {"url": "http://msue.anr.msu.edu/news/alcohol_can_lead_to_malnutrition", "passage_text": "1 The liver is responsible for metabolizing or breaking down alcohol. 2  Because alcohol is a toxin, even small amounts of alcohol cause fatty liver; long-term alcohol use can cause hepatitis and cirrhosis. 3  When the liver must process alcohol, the ability for the body to maintain stable blood sugar levels is affected. 1 Because alcohol is a diuretic that increases the output of urine, it can cause the loss of such water-soluble minerals such as zinc, magnesium and potassium. 2  Zinc status appears to be particularly affected by alcohol and zinc deficiency interferes with the ability to taste and smell, further limiting dietary intake."}, {"url": "https://en.wikipedia.org/wiki/Malnutrition", "passage_text": "Malnutrition or malnourishment is a condition that results from eating a diet in which nutrients are either not enough or are too much such that the diet causes health problems. It may involve calories, protein, carbohydrates, vitamins or minerals. Malnutrition is caused by eating a diet in which nutrients are not enough or are too much such that it causes health problems. It is a category of diseases that includes undernutrition and overnutrition."}, {"url": "http://www.livestrong.com/article/278093-the-effects-of-malnutrition-alcoholism/", "passage_text": "The Effects of Malnutrition & Alcoholism. Alcoholism contributes to malnutrition by displacing nourishing food and altering metabolism. Alcoholism contributes to malnutrition by decreasing appetite and vital nutrients; drinking often serves as a substitute for meals, according to MayoClinic.com."}, {"url": "http://msue.anr.msu.edu/news/alcohol_can_lead_to_malnutrition", "passage_text": "Excessive alcohol consumption can satisfy caloric requirements, but easily leads to malnutrition and anemia. Although alcohol in small doses is an appetite stimulant, larger amounts suppress hunger, which doubly deprives the body of nutrients. 1 Because alcohol is a diuretic that increases the output of urine, it can cause the loss of such water-soluble minerals such as zinc, magnesium and potassium. 2  Zinc status appears to be particularly affected by alcohol and zinc deficiency interferes with the ability to taste and smell, further limiting dietary intake."}, {"url": "http://www.nhs.uk/Conditions/Malnutrition/Pages/Causes.aspx", "passage_text": "Medical conditions. Medical conditions that can lead to malnutrition include: 1  a condition that causes a lack of appetite, such as cancer, liver disease, persistent pain or nausea. 2  a mental health condition, such as depression or schizophrenia, which may affect your ability to look after yourself"}, {"url": "http://www.livestrong.com/article/278093-the-effects-of-malnutrition-alcoholism/", "passage_text": "Direct toxic effects of alcoholism contribute to malnutrition. Alcohol causes stomach cells to secrete too much gastric acid and histamine. Histamine produces inflammation and too much gastric acid irritates the stomach and esophagus linings and makes them vulnerable to the formation of ulcers. Alcoholism contributes to malnutrition by decreasing appetite and vital nutrients; drinking often serves as a substitute for meals, according to MayoClinic.com."}]