[{"url": "http://www.backyardchickens.com/t/5793/can-i-get-a-disease-from-chickens", "passage_text": "so annoying and gross! Yes, small flocks of chickens can carry diseases that we, as human, can get. But it really isn't a serious risk-you are at far, far greater risk from being attacked by your neighbor's dog or getting hurt on the drive to the grocery store."}, {"url": "http://sciencenordic.com/chickens-cause-serious-infections-humans", "passage_text": "Chickens can infect humans with bacteria that cause urinary tract infections and in some cases heart valve infections. There is a growing concern in the international science community for potentially resistant bacteria that are transmitted from animals to humans."}, {"url": "http://www.backyardchickens.com/t/5793/can-i-get-a-disease-from-chickens", "passage_text": "The disease Histoplamosis is common and can be caught from many places. A healthy immune system and a clean coop is your best defense. See http://www.dhpe.org/infect/histo.html for further details. The show house is doing chicken owners the same diservice that the media did on Avian Flu."}, {"url": "http://www.ehow.com/about_5036304_diseases-caused-chickens.html", "passage_text": "Chickens can pass disease to humans. In particular, the transmission of avian flu and bacteria are of great concern. Live chickens can pass avian flu to humans and bacterial infections can be transmitted through contact with the birds."}, {"url": "http://www.answers.com/Q/What_diseases_can_humans_catch_from_chickens", "passage_text": "Retired in 2005, breeding Araucana chickens. Zoonoses refer to infectious animal diseases that are communicable to humans. The infectious agents can be protozoal, fungal, bacterial, chlamydial or viral. It is important to note, that such diseases are uncommon enough that they should not discourage bird-keeping. Chlamydiosis, salmonellosis, arizonosis, and colibacillosis are the most common of these infections."}, {"url": "http://www.offthegridnews.com/how-to-2/common-chicken-diseases-and-their-cures/", "passage_text": "Chickens are especially vulnerable to disease where their “wilder” counterparts (ducks and geese) have better resistance. Knowing what to look for and how to treat common chicken diseases can help you catch problems early and hopefully prevent them from taking out your entire flock."}, {"url": "http://www.answers.com/Q/Will_turkeys_catch_diseases_from_chickens", "passage_text": "Answer by Chickenfarmer7. Confidence votes 66. Yes, turkeys can and will often catch diseases from chickens. This is why it is advised to keep turkeys and chickens separate, this way the turkeys cannot catch the disease from the chickens."}]