[{"url": "http://www.learningtogive.org/resources/national-association-advancement-colored-people-naacp", "passage_text": "(National Associate for the Advancement of Colored People). Historic Roots. The roots of the NAACP were founded on the premise that all people are created equal. As simple a foundation as this sounds, the effort to fully realize this basic truth was and continues to be one the hardest fought battles in history. With the blessing of the NAACP and other civil rights groups, the sit-in movement helped to mobilize the nonviolent demonstration efforts of tens of thousands of students, protesting segregation throughout America."}, {"url": "http://www.u-s-history.com/pages/h1595.html", "passage_text": "NAACP. The National Association for the Advancement of Colored People (NAACP) was founded in 1909 in New York City by a group of bi-racial activists. Originally called the National Negro Committee, it is the nation's oldest civil rights organization. "}, {"url": "http://afroamhistory.about.com/od/timelines/a/Timeline-Of-The-Naacp-1909-To-1965.htm", "passage_text": "The National Association for the Advancement of Colored People (NAACP) is the oldest and most recognized civil rights organization in the United States. "}, {"url": "http://www.learningtogive.org/resources/national-association-advancement-colored-people-naacp", "passage_text": "Today some of the most important contributions the NAACP makes are offered through a variety of programs that help empower African Americans to promote positive change. The organization facilitates change through its activities in research, development, and program implementation. With the blessing of the NAACP and other civil rights groups, the sit-in movement helped to mobilize the nonviolent demonstration efforts of tens of thousands of students, protesting segregation throughout America."}, {"url": "http://www.historylearningsite.co.uk/the-civil-rights-movement-in-america-1945-to-1968/naacp/", "passage_text": "The NAACP have played a very important part in the civil rights movement. The initials stand for the National Association for the Advancement of Coloured People. Brief early history 1909 to 1945. The NAACP was founded in 1909 by a group of multi-racial activists. It was originally called the National Negro Committee. "}, {"url": "http://www.history.com/topics/naacp", "passage_text": "Introduction. Founded in 1909, the National Association for the Advancement of Colored People (NAACP) was one of the earliest and most influential civil rights organization in the United States. During its early years, the NAACP focused on legal strategies designed to confront the critical civil rights issues of the day. Founded in 1909, the National Association for the Advancement of Colored People (NAACP) today has approximately 425,000 members. In 1916, a new field secretary, James Weldon Johnson, began expanding the organization’s membership in the South."}, {"url": "http://www.answers.com/Q/Why_was_the_NAACP_important", "passage_text": "9 people found this useful. 1  Protecting the Civil Rights of African Americans: NAACP Timeline The National Association for the Advancement of Colored People (NAACP) is an organization that promotes civil rights for African Americans in the United States. The NAACP was formed in February 12, 1909 and according to their own website, this was partly due to the practice of lynching and the race riot in Springfield that occurred in … 1908."}, {"url": "http://www.answers.com/Q/Why_was_the_NAACP_important", "passage_text": "The NAACP is the National Association for the Advancement of Colored People. The NAACP was started 12 February 1909 as an organization to promote the rights of minorities. The NAACP was formed in February 12, 1909 and according to their own website, this was partly due to the practice of lynching and the race riot in Springfield that occurred in … 1908."}, {"url": "http://www.history.com/topics/naacp", "passage_text": "The National Association for the Advancement of Colored People (NAACP) was founded in 1909-1910 in New York City by a group of white and black intellectuals. Founded in 1909, the National Association for the Advancement of Colored People (NAACP) today has approximately 425,000 members. In 1916, a new field secretary, James Weldon Johnson, began expanding the organization’s membership in the South."}]