[{"url": "http://www.thevoodoolounge.com.au/lapdancers/", "passage_text": "PROHIBITIONS. The following rules apply, with respect to lap-dance etiquette and legal prohibitions: 1  You must ascertain the terms and conditions of the lap-dance (cost and duration) prior to entering the lap-dance booth. 2  Dancers are not prostitutes and it is an offense to solicit them for those purposes. A Lap-dance is, essentially, a private striptease performance between you and the dancer of your choice. It is the cumulation of the Tipping Game and an adventure into the world of “the secret women’s business”."}, {"url": "http://onlinepolelessons.com/forum/viewtopic.php?id=245", "passage_text": "The key to lap dance etiquette is to make it pleasant for you and your audience. Make sure you smell good and banish any bad breath you suspect you might have. However, you also don't want to overdo it. Drenching yourself in perfume or body spray is worse than not wearing any at all. Practicing proper lap dance etiquette will ensure you give the best performance possible, and prevent an embarrassing lap dance mishap. Keep it Fresh. This is a very important, do-not-ever-break rule of lap dance etiquette. Don't try to give a lap dance to someone smelling like a dead homeless crack whore. Before you give a lap dance, shower and prep as if you were heading out on a date"}, {"url": "http://www.askmen.com/dating/curtsmith_200/230b_dating_advice.html", "passage_text": "Lap dance etiquette isn't quite what they teach at British finishing schools, however, it'll serve guys like us for future reference when it comes to enjoying strip joints and all they have to offer. However, finding one is no excuse to go crazy. Maintain proper lap dance etiquette and be respectful — this means absolutely no pawing at her. It works better for you too, believe it or not. Half the fun of a lap dance is the restraint and frustration, which goes straight out the window the second you have half her boob in your hand"}, {"url": "http://www.mademan.com/mm/how-should-i-tip-lap-dance.html", "passage_text": "1 To pay for your lap dances, and to tip the dancers, you will need plenty of cash. 2  Your tip determines your treatment. 3  At most clubs, private lap dances run between twenty and thirty dollars, usually on a per-song basis. 4  Each club has different rules, not just for lap dances. So, if you're asking yourself, how should I tip for a lap dance? here are a few things to keep in mind for all strip club visits: 1  Bring cash. 2  Your tip determines your treatment. 3  When you are done, offer your tip and make it clear it is a tip and not payment for another dance.  4 How should I tip for a lap dance, in terms of cost?."}, {"url": "http://www.mademan.com/mm/how-should-i-tip-lap-dance.html", "passage_text": "1 How should I tip for a lap dance, in terms of cost?. 2  It is recommended to tip the girl about half the value of the dance, especially if you want another dance with her. So, if you're asking yourself, how should I tip for a lap dance? here are a few things to keep in mind for all strip club visits: 1  Bring cash. 2  Your tip determines your treatment. 3  When you are done, offer your tip and make it clear it is a tip and not payment for another dance.  4"}, {"url": "http://www.askmen.com/dating/curtsmith_200/230_dating_advice.html", "passage_text": "Know the house rules. The simplest way to maintain proper lap dance etiquette form is to follow the house rules as if they were the Ten Commandments. If you don't, your face, wallet and raging libido won't be welcome there again. This is another glaring, do-not-ever-break rule of lap dance etiquette. Page 1 of 2. However, you can't just walk into a strip joint and act the way your caveman brain is telling you. No jumping on the nearest piece of flesh — there are rules to follow. While lap dance etiquette is inevitably stacked (pun not intended) in favor of the girls, these rules also benefit you. Be respectful and you'll be allowed back into this little slice of paradis"}, {"url": "http://onlinepolelessons.com/forum/viewtopic.php?id=245", "passage_text": "Lap Dance Rules and Etiquette. Lap dances are a great way to get a little closer to your favorite person (boyfriend, husband, drunk girlfriend, etc.), when you are ready to get intimate on that level. Practicing proper lap dance etiquette will ensure you give the best performance possible, and prevent an embarrassing lap dance mishap. Keep it Fresh. This is a very important, do-not-ever-break rule of lap dance etiquette. Don't try to give a lap dance to someone smelling like a dead homeless crack whore. Before you give a lap dance, shower and prep as if you were heading out on a date"}]