[{"url": "https://en.wikipedia.org/wiki/Diode", "passage_text": "In electronics, a diode is a two-terminal electronic component that conducts primarily in one direction (asymmetric conductance); it has low (ideally zero) resistance to the flow of current in one direction, and high (ideally infinite) resistance in the other. 1 For a bias less than the PIV, the reverse current is very small. 2  For a normal P–N rectifier diode, the reverse current through the device in the micro-ampere (µA) range. 3  However, this is temperature dependent, and at sufficiently high temperatures, a substantial amount of reverse current can be observed (mA or more)."}, {"url": "https://en.wikipedia.org/wiki/Diode", "passage_text": "A semiconductor diode, the most common type today, is a crystalline piece of semiconductor material with a p–n junction connected to two electrical terminals. A vacuum tube diode has two electrodes, a plate (anode) and a heated cathode. Semiconductor diodes were the first semiconductor electronic devices. 1 For a bias less than the PIV, the reverse current is very small. 2  For a normal P–N rectifier diode, the reverse current through the device in the micro-ampere (µA) range. 3  However, this is temperature dependent, and at sufficiently high temperatures, a substantial amount of reverse current can be observed (mA or more)."}, {"url": "https://en.wikipedia.org/wiki/Diode", "passage_text": "The most common function of a diode is to allow an electric current to pass in one direction (called the diode's forward direction), while blocking current in the opposite direction (the reverse direction). Thus, the diode can be viewed as an electronic version of a check valve. 1 For a bias less than the PIV, the reverse current is very small. 2  For a normal P–N rectifier diode, the reverse current through the device in the micro-ampere (µA) range. 3  However, this is temperature dependent, and at sufficiently high temperatures, a substantial amount of reverse current can be observed (mA or more)."}, {"url": "https://learn.sparkfun.com/tutorials/diodes", "passage_text": "Current passing through a diode can only go in one direction, called the forward direction. Current trying to flow the reverse direction is blocked. They’re like the one-way valve of electronics. If the voltage across a diode is negative, no current can flow * , and the ideal diode looks like an open circuit. On the left, diode D1 is forward biased and allowing current to flow through the circuit. In essence it looks like a short circuit. On the right, diode D2 is reverse biased. Current cannot flow through the circuit, and it essentially"}, {"url": "http://www.yourdictionary.com/diode", "passage_text": "LINK / CITE ADD TO WORD LIST. noun. The definition of a diode is an electronic device with two transmitting terminals that allows electric current to flow in one direction while blocking current in the opposite direction. An example of a diode is a light-emitting diode, an LED. diode. noun. 1  An electronic device that restricts current flow chiefly to one direction. 2  An electron tube with a cathode and anode. 3  A two-terminal semiconductor device used chiefly as a rectifier."}, {"url": "http://www.wisegeek.org/what-is-a-diode.htm", "passage_text": "In simple language, a diode is like one-way valve which allows electric current to flow in one direction but generally does not allow it to flow in the opposite direction. The direction of the electric current in the diode may be reversed. However, even if it is, the flow will still be one directional. A diode contains two electrodes that act in much the same manner as semiconductors. The positive or p-type is usually the anode and the negative or n-type is the cathode. In other words, the cathode is negatively charged as compared to the anode."}, {"url": "http://www.engineersgarage.com/tutorials/diodes", "passage_text": "A Diode is the simplest two-terminal unilateral semiconductor device. It allows current to flow only in one direction and blocks the current that flows in the opposite direction. The two terminals of the diode are called as anode and cathode. The symbol of diode is as shown in the figure below. The characteristics of a diode closely match to that of a switch."}, {"url": "http://whatis.techtarget.com/definition/diode", "passage_text": "Part of the Electronics glossary: A diode is a specialized electronic component with two electrodes called the anode and the cathode. Most diodes are made with semiconductor materials such as silicon, germanium, or selenium."}]