[{"url": "http://www.cdc.gov/parasites/lice/head/gen_info/faqs_malathion.html", "passage_text": "1 After treatment, use a fine-toothed nit comb to check the hair for live lice every 2–3 days for 2–3 weeks until sure that all lice are gone. 2  If live lice are found 7 to 9 days after treatment, retreat with a second application of the same medication. My child is under 6 years old and has been diagnosed with head lice. Before treating young children, ask the child's physician for treatment recommendations. The safety and effectiveness of malathion lotion (Ovide*) has not been established by well controlled trials in children less than 6 years old."}, {"url": "http://www.headlice.org/downloads/faqprint.pdf", "passage_text": "Head lice are human parasites and require human blood to survive. Vacuuming is the safest and best way to remove lice or fallen hairs with attached nits from upholstered furniture, rugs, stuffed animals or car seats – wherever someone with head lice may have rested their head. Head lice can be spread whenever there is direct contact of the head or hair with an infested individual. Lice can also be spread through the sharing of personal articles like hats, towels, brushes, helmets, hair ties, etc. There is also a possibility of spreading head lice via a pillow, headrest or similar items."}, {"url": "http://www.headlice.org/downloads/faqprint.pdf", "passage_text": "Head lice can survive on a human host for approximately 30 days. They generally cannot survive longer than 24 hours off the host. A female louse lays 3-5 eggs a day. The eggs hatch in 7-10 days and it takes another 7-10 day for the louse to mature and lay their own eggs. Do pets get head lice? Head lice cannot be “caught” from pets and cannot survive on pets. Head lice can be spread whenever there is direct contact of the head or hair with an infested individual. Lice can also be spread through the sharing of personal articles like hats, towels, brushes, helmets, hair ties, etc. There is also a possibility of spreading head lice via a pillow, headrest or similar items."}, {"url": "http://www.headlice.org/downloads/faqprint.pdf", "passage_text": "You can also put bed linens, stuffed animals and other items in a dryer for 30 minutes. Save your physical and emotional energies for screening and thorough lice and nit removal. Head lice can be spread whenever there is direct contact of the head or hair with an infested individual. Lice can also be spread through the sharing of personal articles like hats, towels, brushes, helmets, hair ties, etc. There is also a possibility of spreading head lice via a pillow, headrest or similar items."}, {"url": "http://www.liceinfo.net/2014/08/lice-bagging-stuffed-animals/", "passage_text": "You do not need to bag stuffed animals when your kids have lice. Stuffed animals do not have lice on them. Lice are not going to travel to stuffed animals because there is no food there. Instead spend your time combing your child’s hair with a nit comb for head lice removal treatment that is really effective. Call us if you need advice. 617-816-9487."}, {"url": "https://answers.yahoo.com/question/index?qid=20070912122708AA1ItwB", "passage_text": "When you have lice and you put stuffed animals in a bag to kill the lice how long do you leave them in there? like how long do you leave them in the bag. I heard that you should keep them in bags for 2 weeks, because if there are freshly laid eggs on the stuffed animals, they can take a while to hatch. Iridescence · 8 years ago. Thumbs up. 0"}, {"url": "https://answers.yahoo.com/question/index?qid=20070912122708AA1ItwB", "passage_text": "Report Abuse. I heard that you should keep them in bags for 2 weeks, because if there are freshly laid eggs on the stuffed animals, they can take a while to hatch. Iridescence · 8 years ago. Thumbs up. 0"}, {"url": "http://www.cdc.gov/parasites/lice/head/gen_info/faqs_malathion.html", "passage_text": "1 After 8–12 hours, thoroughly shampoo the hair; rinse and use a fine-toothed nit comb, usually included in the package, to remove dead lice and nits from the hair. 2  After treatment, use a fine-toothed nit comb to check the hair for live lice every 2–3 days for 2–3 weeks until sure that all lice are gone. My child is under 6 years old and has been diagnosed with head lice. Before treating young children, ask the child's physician for treatment recommendations. The safety and effectiveness of malathion lotion (Ovide*) has not been established by well controlled trials in children less than 6 years old."}, {"url": "https://answers.yahoo.com/question/index?qid=20061110201323AAdActn", "passage_text": "Rid also has a lice spray. Spray Rid on the stuff animal and place in a trash bag for 10 days .If any lice are on there that should kill them. "}]