[{"url": "http://www.howmuchisit.org/couch-reupholstery-cost/", "passage_text": "1 According to ReedUpholstery.com, the cost of reupholstery of a couch varies greatly based on the size and design, but on the average, cost ranges from $600 for an open-arm couch of about 70″ to 85″ in size and can go up to $990 for a closed-arm couch of the same size."}, {"url": "http://homeguides.sfgate.com/average-cost-reupholster-couch-86214.html", "passage_text": "Labor averages between $700 and $1,200, for a total cost of $1,200 for a small two-cushion sofa, up to $3,000 or more for a large sofa. The cost can rise if you decide to replace the stuffing in cushions, especially if you choose a pricey option like down feathers."}, {"url": "http://ehowmuchdoesitcost.org/cost-to-reupholster-a-sofa/", "passage_text": "Considering the extra costs of reupholstering a sofa, then you may find paying around 700 US dollars for an average size sofa and for a large sofa you may pay up to 1,200 US dollars. For this reason, it is important to ensure that your chosen upholsterer has some years of experience and skills."}, {"url": "http://homeguides.sfgate.com/much-would-cost-reupholster-couch-81963.html", "passage_text": "Fabric costs play a significant role in the overall cost of your reupholstery project. A typical couch takes approximately 12 to 18 yards of 54-inch to 60-inch wide decorator fabric."}, {"url": "http://homeguides.sfgate.com/average-cost-reupholster-couch-86214.html", "passage_text": "Total Cost. The total cost of reupholstering a couch includes fabric, supplies and labor. It varies depending on the size and style of the couch as well as the price of the fabric, which can range from about $11 to $40 per yard."}, {"url": "http://ehowmuchdoesitcost.org/cost-to-reupholster-a-sofa/", "passage_text": "It is important to note some additional costs of reupholstering a sofa. If your sofa needs additional foam in the cushions or pillows, then this may cost you extra dollars. The cushions may need to be filled with foam instead of using fiberfill."}, {"url": "http://ehowmuchdoesitcost.org/cost-to-reupholster-a-sofa/", "passage_text": "The overall costs of reupholstering a sofa generally depends with the cost of fabric used, the size of the sofa and the upholsterer you have choose. Depending with the size of your sofa, the costs of reupholstering may range between 400 to 1,200 US dollars. This only depends with the upholsterer you have chosen. To reduce the cost of reupholstering your sofa, it is advisable to first visit the upholstery fabric stores."}, {"url": "http://ehowmuchdoesitcost.org/cost-to-reupholster-a-sofa/", "passage_text": "For a sofa which has wobbling frame and torn fabric which need replacement, then a 6 to 7 foot sofa may cost you 500 to 800 US dollars to reupholster with fabrics. This is suitable as compared to spending 1,200 US dollars to purchase a new one."}]