[{"url": "http://www.ehow.com/facts_7622079_typical-cost-moving-mobile-home.html", "passage_text": "Mobile home moving costs include preparing the home for the move, transporting the home, and setting it up at the new site. Depending on location and effort involved, these costs can range from $6,000 up to more than $20,000 for a double-wide home."}, {"url": "http://home.costhelper.com/mobile-home-transport.html", "passage_text": "1 For example, Riley's Transport in California will move a small single-wide mobile home within the state up to 60 miles starting about $1,000, depending on size and location. 2  DIYers who choose to disconnect or reconnect the unit will need skirting tools, a plumber's wrench ($15-$20) and plumbing knowledge."}, {"url": "http://www.mobilehomesell.com/what-is-the-cost-of-moving-a-manufactured-home/", "passage_text": "Monetary Costs. The money you spend on moving your mobile homes depends on the distance of the move. Short distant moves can cost between $1,000–$5,000, while longer trips can cost as much as $15,000 or more. You can determine your cost using this good rule-of-thumb: Estimate about $5–$10 per mile for your move."}, {"url": "http://homeguides.sfgate.com/average-cost-deliver-set-up-mobile-home-96554.html", "passage_text": "A mobile home's moving cost depends on transport distance as well as the home's width. The HowMuchIsIt.org website says it commonly costs between $2,000 and $5,000 to move a mobile home less than 100 miles. The Manufactured Selling Solutions website, though, says it may cost as little as $1,000 to move a mobile home. If you're moving a mobile home more than 100 miles, expect to pay $6 to $15 per mile or up to $15,000 in transport costs alone."}, {"url": "http://www.howmuchisit.org/cost-to-move-a-mobile-home/", "passage_text": "1 On average, a short mobile home move that is less than 100 miles will typically cost anywhere from $2,000 to $5,000. 2  This would be the range for a single-wide trailer. 3  For double wide or triple wide trailers, the prices can significantly rise. 4  For jobs over 100 miles, plan on spending around $6 to $15 per mile."}, {"url": "http://www.movers.com/moving-guides/cost-of-moving-mobile-home.html", "passage_text": "This portion of the move can cost anywhere from $1,500 to $4,500 on average, depending on which services you obtain. In total, moving your mobile home will cost you anywhere in the range of $6,000 to $20,000, based on the size of the home you're moving and how many miles you need to move it."}, {"url": "http://home.costhelper.com/mobile-home-transport.html", "passage_text": "1 Full-service mobile home moves of about 60 miles that include disconnect, reconnect and transport will cost about $3,000-$5,000 for a single-wide unit, $4,000-$10,000 for a double-wide and $10,000-$14,000 or more for a triple-wide, depending on size and location."}]