[{"url": "http://www.parenting.com/pregnancy/stages-of-pregnancy", "passage_text": "Stages of Pregnancy. Each of the stages of pregnancy is wondrous, fraught with joy and challenges. From the first trimester, through the second trimester, to the third trimester, we can help you navigate your journey to baby."}, {"url": "http://www.womenshealth.gov/pregnancy/you-are-pregnant/stages-of-pregnancy.html", "passage_text": "During the first trimester your body undergoes many changes. Hormonal changes affect almost every organ system in your body. These changes can trigger symptoms even in the very first weeks of pregnancy."}, {"url": "http://www.pregnancy-period.com/stages-of-pregnancy.html", "passage_text": "Know Your Stages Of Pregnancy Better. Congratulations; you are pregnant! You need to be well-informed regarding the stages of pregnancy. However, with it starts your journey towards creating a new life. So, let's take a look at how a new life develops inside you."}, {"url": "http://www.livescience.com/44899-stages-of-pregnancy.html", "passage_text": "A normal pregnancy usually lasts about 40 weeks, counting from the first day of a woman's last menstrual period, which is typically about two weeks before conception occurs. The stages of pregnancy are typically described in three-month periods known as trimesters. Each trimester lasts between 12 and 13 weeks. During each trimester, distinct changes take place in a pregnant woman's body as well as in the development of the fetus, and they will be described in greater detail below."}, {"url": "http://www.medicinenet.com/pregnancy/article.htm", "passage_text": "Introduction. Pregnancy lasts about 40 weeks, counting from the first day of your last normal period. The weeks are grouped into three trimesters (TREYE-mess-turs). Find out what's happening with you and your baby in these three stages."}, {"url": "http://www.stages-of-pregnancy.com/index.html", "passage_text": "Stages of pregnancy. The stages of pregnancy are divided into three trimesters. Within these three trimesters, you will experience hormonal changes, changes to the physical body as the fetus grows inside you and emotional changes within your relationship your partner."}, {"url": "http://www.onlymyhealth.com/what-stages-pregnancy-1306129657", "passage_text": "Like onlymyhealth on Facebook! Pregnancy is divided into 3 stages, which are commonly referred to as ‘trimesters of pregnancy’. Each stage of pregnancy brings new changes in a woman and the growing baby. First Trimester of Pregnancy First stage or trimester of pregnancy starts from 1st until 14th week."}]