[{"url": "https://en.wikipedia.org/wiki/ATP_synthase", "passage_text": "ATP synthase (EC 3.6.3.14) is an important enzyme that provides energy for the cell to use through the synthesis of adenosine triphosphate (ATP). ATP is the most commonly used energy currency of cells from most organisms. It is formed from adenosine diphosphate (ADP) and inorganic phosphate (P i), and needs energy. The overall reaction sequence is: ADP + P i → ATP, where ADP and P i are joined together by ATP synthase. The same process takes place in the mitochondria, where ATP synthase is located in the inner mitochondrial membrane (so that F 1 -part sticks into mitochondrial matrix, where ATP synthesis takes place)."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Biology/atpsyn.html", "passage_text": "ATP synthase is a complex which makes use of the proton potential created by the action of the electron transport chain in mitochondria. It transports a proton down the gradient and uses the energy to complete the phosphorylation of ADP to ATP. So part of its action is like a molecular motor. In the electron transport chain of photosynthesis, the ATP synthase complex accomplishes the phosphorylation of ADP to ATP, providing part of the energy for subsequent biosynthesis through the Calvin cycle."}, {"url": "https://en.wikipedia.org/wiki/Photosynthesis", "passage_text": "Photosynthesis is a process used by plants and other organisms to convert light energy, normally from the Sun, into chemical energy that can be later released to fuel the organisms' activities. This chemical energy is stored in carbohydrate molecules, such as sugars, which are synthesized from carbon dioxide and water – hence the name photosynthesis, from the Greek φῶς, phōs, light, and σύνθεσις, synthesis, putting together."}, {"url": "https://en.wikipedia.org/wiki/ATP_synthase", "passage_text": "In plants, ATP synthase is also present in chloroplasts (CF 1 F O-ATP synthase). The enzyme is integrated into thylakoid membrane; the CF 1 -part sticks into stroma, where dark reactions of photosynthesis (also called the light-independent reactions or the Calvin cycle) and ATP synthesis take place. The same process takes place in the mitochondria, where ATP synthase is located in the inner mitochondrial membrane (so that F 1 -part sticks into mitochondrial matrix, where ATP synthesis takes place)."}, {"url": "http://www.ehow.com/about_6364225_function-atp-photosynthesis-respiration.html", "passage_text": "In photosynthesis, ATP is synthesized from the thylakoid membrane (sites of the photochemical reactions of photosynthesis) of chloroplast cells of plants. The photon particles from the sunlight excite the chloroplast thylakoid membrane, which in turn converts this excitation into ATP’s chemical energy. "}, {"url": "http://highered.mheducation.com/sites/9834092339/student_view0/chapter39/photosynthetic_electron_transport_and_atp_synthesis.html", "passage_text": "Photosynthesis takes energy from photons and uses it to build complex molecules. However both systems use an electron transport chain and associated proton pump and ATP synthase as a key part of the process. In photosynthesis electrons enter the transport chain after receiving light energy – in respiration the electrons are provided by organic food molecules. "}, {"url": "http://www.answers.com/Q/How_is_ATP_synthesized_during_photosynthesis", "passage_text": "Making the world better, one answer at a time. In plants, ATP is synthesized in thylakoid membrane of the chloroplast during the light-dependent reactions of photosynthesis in a process called photophosphorylation. Here, light energy is used to pump protons across the chloroplast membrane. "}]