[{"url": "http://elections.virginia.gov/candidatepac-info/presidential-primary-filing/index.html", "passage_text": "Deadline for presidential primary petitions and the combined Consent/Declaration of Candidacy to be filed with the State Board of Elections. The petitions must be delivered in sealed containers to which is attached a sworn statement and, if applicable, a list of delegates and alternate delegates."}, {"url": "http://www.thegreenpapers.com/P16/VA-D", "passage_text": "Voters will publicly declare their Party preference and that preference will be publicly recorded. Tuesday 1 March 2016: 95 of 110 delegates to the Democratic National Convention are pledged to presidential contenders based on the results of the voting in today's Virginia Presidential Primary."}, {"url": "http://www.270towin.com/states/Virginia", "passage_text": "2010 Census Reapportionment: Virginia will remain at 13 electoral votes through the 2020 presidential election. Virginia, one of the original 13 colonies and birthplace of four of the first five U.S. presidents, joined the Union in June 1788."}, {"url": "https://www.washingtonpost.com/local/virginia-politics/va-gop-will-choose-presidential-nominee-by-primary/2015/06/27/15268ddc-1a04-11e5-93b7-5eddc056ad8a_story.html", "passage_text": "By Jenna Portnoy June 27 Follow @jennaportnoy. STAUNTON, Va. — Virginia’s Republican presidential nominating contest next year will be a primary open to all voters instead of a party-run convention, GOP leaders decided Saturday by a slim margin. The decision delivered a blow to a coalition of tea party-influenced activists called the Conservative Fellowship."}, {"url": "http://www.richmond.com/news/virginia/government-politics/article_a88c6f31-1d96-55f4-95ab-7fd90850bb00.html", "passage_text": "Va. GOP chooses primary for 2016 presidential choice; convention for governor in 2017 BY MARKUS SCHMIDT Richmond Times-Dispatch Richmond Times-Dispatch. STAUNTON-The Republican Party of Virginia will choose a presidential candidate in a statewide primary open to all voters on March 1, 2016, also known as Super Tuesday."}, {"url": "http://www.2016primary.com/virginia.html", "passage_text": "Candidates should contact the Virginia State Board of Elections, Washington Building, First Floor, 1100 Bank Street, Richmond, Virginia 23219 (Telephone: 804 864 8901: Toll Free: 800 552 9745; Facsimile: 804 371 0194; email: info@sbe.state.va.us) to obtain detailed information on procedures adopted by the board."}]