[{"url": "http://www.webmd.boots.com/women/thyroid-problems-causes-diagnosis-treatment", "passage_text": "Problems with the thyroid include overactive thyroid, or hyperthyroidism, and underactive thyroid or hypothyroidism. The thyroid gland in the neck makes hormones to help regulate the body's metabolism and a person's growth. All types of hyperthyroidism are due to overproduction of thyroid hormones, but the condition can develop in several ways: Graves' disease. This is an auto-immune condition and is the commonest cause of an overactive thyroid gland."}, {"url": "http://www.webmd.com/women/overactive-thyroid-hyperthyroidism", "passage_text": "Graves' disease. The most common cause of hyperthyroidism is an autoimmune condition called Graves' disease. The body's immune system creates an antibody that causes the gland to make an excessive amount of thyroid hormone. Graves' disease runs in families, and usually affects younger women. Thyroiditis. "}, {"url": "http://www.webmd.boots.com/women/guide/thyroid-symptoms", "passage_text": "The thyroid is like a speed control or accelerator for the body. An overactive thyroid can leave a person feeling 'revved up', even when they should be getting ready to sleep at bedtime. An underactive thyroid slows a person down, and may cause symptoms of depression, fatigue, and weight gain. In both cases, the root cause may be your thyroid."}, {"url": "http://www.medicalnewstoday.com/articles/9153.php", "passage_text": "Hyperthyroidism, also known as overactive thyroid, is a medical condition caused by an abnormally high level of thyroid hormone in the bloodstream. The thyroid gland produces an excessive amount of thyroid hormones. The thyroid gland is located in the neck. Graves' disease is an autoimmune condition in which the body's immune system mistakenly targets the thyroid gland and causes it to produce too much thyroid hormone. It is unclear what triggers this condition. There is a genetic basis for Graves' disease, meaning that it can run in families."}, {"url": "http://www.medicinenet.com/hyperthyroidism/article.htm", "passage_text": "Hyperthyroidism is a condition in which an overactive thyroid gland is producing an excessive amount of thyroid hormones that circulate in the blood. (Hyper means over in Greek). Thyrotoxicosis is a toxic condition that is caused by an excess of thyroid hormones from any cause. "}, {"url": "http://www.nhs.uk/Conditions/Thyroid-over-active/Pages/Causes.aspx", "passage_text": "Causes of overactive thyroid. Overactive thyroid (hyperthyroidism) occurs when your thyroid gland produces too much of the thyroid hormones thyroxine or triiodothyronine. Overproduction of thyroid hormones can be caused by a number of conditions, which are outlined below. Graves' disease. Graves' disease is the most common cause of overactive thyroid. It can run in families and can occur at any age, although it is most common in women aged 20-40 years old. You are more likely to develop Graves' disease if you smoke. Graves' disease is an autoimmune condition"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001396/", "passage_text": "About Hyperthyroidism. The thyroid gland is a part of the body's endocrine (hormone) system — which is made up of the glands that help regulate many of the body's different functions. An overactive thyroid produces too much of the thyroid hormone thyroxine, which causes some of these functions to speed up. Hyperthyroidism is the medical term for an overactive thyroid gland. Too little thyroxine reverses the process and slows down the body's functions. This can be caused by an underactive thyroid, a condition also referred to as hypothyroidism."}, {"url": "http://www.mayoclinic.org/diseases-conditions/hyperthyroidism/basics/causes/CON-20020986", "passage_text": "Thyroid gland. A number of conditions, including Graves' disease, toxic adenoma, Plummer's disease (toxic multinodular goiter) and thyroiditis, can cause hyperthyroidism. Your thyroid is a butterfly-shaped gland situated at the base of your neck, just below your Adam's apple. "}]