[{"url": "https://www.etsy.com/forums_thread.php?thread_id=6739378", "passage_text": "Etsy has never explained this, and the founders refused to do so when asked on various occasions. My assumption is 'a four letter pronounceable domain name that was available in 2005'. It's common these days for websites to choose names that start out as meaningless. in the nightline interview, rob was asked that question and told the interviewer that the name etsy started out as his online shop he was going to start to sell his handmade furniture. now, he never said what it meant, so add this answer to all of the others."}, {"url": "https://en.wikipedia.org/wiki/Etsy", "passage_text": "In 2010, Etsy saw merchant revenues (Gross Merchandise Sales or GMS) increase from $180 million to $314 million, which fell short of the $400 million prediction. On March 3, 2015, Etsy announced that it had filed for a $100 million USD IPO. Creating a shop on Etsy is free, however each listing that is posted in the shop costs $0.20. Each listing will remain on the shop's page for 4 months, or until someone buys the product. The sale prices of products are determined by the shop owner, but Etsy claims 3.5% of the sale price of each listing."}, {"url": "http://www.abbreviations.com/etsy", "passage_text": "Etsy. Etsy is an e-commerce website focused on handmade or vintage items, as well as art and craft supplies. These items cover a wide range, including art, photography, clothing, jewelry, food, bath and beauty products, quilts, knick-knacks, and toys. Many sellers also sell craft supplies such as beads, wire and jewelry-making tools. All vintage items must be at least 20 years old. The site follows in the tradition of open craft fairs, giving sellers personal storefronts where they list their goods for a fee of US$0.20 per item."}, {"url": "https://en.wikipedia.org/wiki/Etsy", "passage_text": "Its 'Marketplace' revenue includes a fee of 3.5% of sale value, which an Etsy seller pays for each completed transaction, and a listing fee of 20 Cents per item. Creating a shop on Etsy is free, however each listing that is posted in the shop costs $0.20. Each listing will remain on the shop's page for 4 months, or until someone buys the product. The sale prices of products are determined by the shop owner, but Etsy claims 3.5% of the sale price of each listing."}, {"url": "https://www.etsy.com/forums_thread.php?thread_id=5155056", "passage_text": "1 Thread is in the wrong section of the forums. 2  Post discusses private matters (transaction details, feedback, copying, etc). 3  Post is abusive or insulting to another member. 4  Post discusses a specific item, shop or member in a negative way. 5  Post is from an alternate or sock puppet account. 1 Post is abusive or insulting to another member. 2  Post discusses a specific item, shop or member in a negative way. 3  Post is from an alternate or sock puppet account. 4  Post is an unsolicited promotion, advertisement, or spam."}, {"url": "https://www.etsy.com/forums_thread.php?thread_id=5155056", "passage_text": "Report a post. Thank you for taking time to help Etsy! Please note that you will not receive a personal response about this report. We will review this post privately... 1 Post is abusive or insulting to another member. 2  Post discusses a specific item, shop or member in a negative way. 3  Post is from an alternate or sock puppet account. 4  Post is an unsolicited promotion, advertisement, or spam."}, {"url": "https://en.wikipedia.org/wiki/Etsy", "passage_text": "As of December 31, 2014, Etsy had 54 million users registered as members, and the online marketplace for handmade and vintage goods connected 1.4 million active sellers with 19.8 million active buyers. At the end of 2014, Etsy had 685 employees, and had 29 million items listed on its website. Creating a shop on Etsy is free, however each listing that is posted in the shop costs $0.20. Each listing will remain on the shop's page for 4 months, or until someone buys the product. The sale prices of products are determined by the shop owner, but Etsy claims 3.5% of the sale price of each listing."}, {"url": "http://www.definitions.net/definition/etsy", "passage_text": "Etsy. Etsy is a website that focuses on handmade and vintage items, as well as art and craft supplies. The items include art, photography, clothing, jewelry, edibles, quilts, and toys. Etsy is modeled after open craft fairs that give sellers personal storefronts where they can list their goods. Etsy. Etsy is an e-commerce website focused on handmade or vintage items, as well as art and craft supplies. These items cover a wide range, including art, photography, clothing, jewelry, food, bath and beauty products, quilts, knick-knacks, and toys."}]