[{"url": "http://www.ausetute.com.au/intermof.html", "passage_text": "Dipole-dipole Interactions. 1  are stronger intermolecular forces than Dispersion forces. 2  occur between molecules that have permanent net dipoles (polar molecules), for example, dipole-dipole interactions occur between SCl 2 molecules, PCl 3 molecules and CH 3 Cl molecules."}, {"url": "http://butane.chem.uiuc.edu/pshapley/GenChem1/L20/1.html", "passage_text": "In the liquid phases, all molecules interact with one another. The stronger the interaction between a molecule and a pure liquid, the greater will be the solubility of the molecule in the liquid. All molecules interact with each other through London dispersion forces, or induced dipole interactions. In the figure below, a 2-atom molecule collides with a 3-atom molecule."}, {"url": "http://chemed.chem.purdue.edu/genchem/topicreview/bp/intermol/intermol.html", "passage_text": "HCl molecules, for example, have a dipole moment because the hydrogen atom has a slight positive charge and the chlorine atom has a slight negative charge. Because of the force of attraction between oppositely charged particles, there is a small dipole-dipole force of attraction between adjacent HCl molecules."}, {"url": "http://www.ausetute.com.au/intermof.html", "passage_text": "1 Dispersion forces are the only type of intermolecular force operating between non-polar molecules, for example, dispersion forces operate between hydrogen (H 2) molecules, chlorine (Cl 2) molecules, carbon dioxide (CO 2) molecules, dinitrogen tetroxide (N 2 O 4) molecules and methane (CH 4) molecules."}, {"url": "http://chemguide.co.uk/atoms/bonding/vdw.html", "passage_text": "The majority of the syllabuses talk as if dipole-dipole interactions were quite distinct from van der Waals forces. Such a syllabus will talk about van der Waals forces (meaning dispersion forces) and, separately, dipole-dipole interactions. All intermolecular attractions are known collectively as"}, {"url": "http://chemguide.co.uk/atoms/bonding/vdw.html", "passage_text": "This page explains the origin of the two weaker forms of intermolecular attractions-van der Waals dispersion forces and dipole-dipole attractions. If you are also interested in hydrogen bonding there is a link at the bottom of the page."}, {"url": "http://chemed.chem.purdue.edu/genchem/topicreview/bp/intermol/intermol.html", "passage_text": "These forces can be divided into three categories: (1) dipole-dipole, (2) dipole-induced dipole, and (3) induced dipole-induced dipole. Dipole-Dipole Forces. Many molecules contain bonds that fall between the extremes of ionic and covalent bonds."}, {"url": "http://butane.chem.uiuc.edu/pshapley/GenChem1/L20/1.html", "passage_text": "When a molecule with a permanent dipole, such as HCN, collides with a molecule without a molecular dipole, the collision itself causes a dipole to appear by changes in electron density within the molecule. The nitrogen atom in HCN is electron rich and the molecular dipole points in the direction of this atom."}, {"url": "http://study.com/academy/lesson/hydrogen-bonding-dipole-dipole-ion-dipole-forces-strong-intermolecular-forces.html", "passage_text": "A hydrogen bond is a dipole-dipole force and is an attraction between a slightly positive hydrogen on one molecule and a slightly negative atom on another molecule. Hydrogen bonds are important in the properties of water and in certain biological molecules, such as proteins."}]