[{"url": "http://homeguides.sfgate.com/long-let-thinset-mortar-dry-before-grouting-82123.html", "passage_text": "24 to 48 Hours. You should wait at least 24 hours before grouting the tiles. You may notice that the edges of the thinset or the thinset showing through the grout lines looks dry. Don't be fooled by this. The thinset under the tiles isn't receiving as much air as the edges and is therefor not fully cured."}, {"url": "http://www.contractortalk.com/f73/how-long-wait-walk-tile-120912/", "passage_text": "Doing a tile floor with 18 x18 in. tiles using the Lash system. I am using 1/2 in. notched trowel. My question is how long do you guys wait to walk on tile using the thicker 1/2 in bed?"}, {"url": "http://www.ehow.com/decision_7220918_long-tile-can-walk-it_.html", "passage_text": "Bottom Line. The time required to wait before walking on a newly tiled floor varies depending on the adhesive and grout brands chosen, and if a sealant is used. Generally at least three days from the time the tile is laid should be allowed before using the floor."}, {"url": "http://www.ehow.com/info_8627364_long-mortar-set-before-grouting.html", "passage_text": "In general, mortar must set at least 24 to 48 hours before grouting. Apply mortar when the ambient air temperature is between 50 and 100 degrees Fahrenheit. Ideally, temperatures should not exceed this range for at least 72 hours after application."}, {"url": "http://www.city-data.com/forum/house/1744815-how-long-before-i-walk-my.html", "passage_text": "I've done a lot of tiling over the years. The first thing you need to know is that the guy at Home Depot has probably never done one single bit of tile work. That said, if you want to do it right, don't walk on the floor for 12 hours. Wait for another 24-48 hours before you seal the grout. There is a BIG difference between grout being dry to the touch, and being cured."}, {"url": "http://heritagehardwoodflooring.net/faq_refinishing.html", "passage_text": "A: Typically 24 hours after the last coat is applied your floors should be dry enough to walk on and place furniture on. Even though the floors are dry the finish will still be soft therefore you must wait 10 to 14 days before you place any area rugs down. This will ensure your floor cures properly."}]