[{"url": "http://www.totaljobs.com/salary-checker/average-managing-director-salary", "passage_text": "Salary results for Managing Director. Here you can see the average salary for the job you entered, based on our most recent job adverts. Our salary calculator also lets you view the highest and lowest salaries recently offered for that job, and how your current salary compares. Clicking on 'Top salaries' will provide you with a breakdown of salaries based on industry and location."}, {"url": "http://www1.salary.com/Data-Management-Director-Salary.html", "passage_text": "For example the median expected annual pay for a typical Data Management Director in the United States is $137,017, so 50% of the people who perform the job of Data Management Director in the United States are expected to make less than $137,017. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at companies of all sizes and industries to present this range of annual salaries for people with the job title Data Management Director in the United States."}, {"url": "http://www.indeed.com/salary/q-Managing-Director-Non-Profit-Organization-l-Plantation,-FL.html", "passage_text": "$73,000. Average Managing Director Non Profit Organization salaries for job postings in Plantation, FL are 4% lower than average Managing Director Non Profit Organization salaries for job postings nationwide."}, {"url": "http://www.indeed.com/salary/Managing-Director.html", "passage_text": "Average Managing Director salaries for job postings nationwide are 29% higher than average salaries for all job postings nationwide. "}, {"url": "http://www.mysalary.co.uk/average-salary/Managing_Director_1745", "passage_text": "Managing Director Salary Comparison. The average salary in 2009 was £74,500, based on 317 respondents (a difference of -13% from the 2008 figure. The average salary in 2010 was £87,372, based on 355 respondents (a difference of 17% from the 2009 figure. The average salary in 2012 was £78,050, based on 175 respondents (a difference of 3% from the 2011 figure. The median salary for a Managing Director based on all salary survey responses is: £71,000. Back to list of jobs beginning with M. Back to Salary Survey Home. About the Salary Survey Data in this survey is based on over 368,000 individual salary records"}, {"url": "http://www.mysalary.co.uk/average-salary/Managing_Director_1745", "passage_text": "The average salary figure above for a Managing Director is considered highly likely to be representative of the UK market average due to the high number of respondents who had this exact job title. View Jobs By Other Letter: The average salary in 2012 was £78,050, based on 175 respondents (a difference of 3% from the 2011 figure. The median salary for a Managing Director based on all salary survey responses is: £71,000. Back to list of jobs beginning with M. Back to Salary Survey Home. About the Salary Survey Data in this survey is based on over 368,000 individual salary records."}, {"url": "http://www1.salary.com/Project-Management-Director-salary.html", "passage_text": "For example the median expected annual pay for a typical Project Management Director in the United States is $136,299, so 50% of the people who perform the job of Project Management Director in the United States are expected to make less than $136,299. Source: HR Reported data as of October 2015. 1  Salary. This chart describes the expected percentage of people who perform the job of Project Management Director in the United States that make less than that annual salary."}]