[{"url": "http://www.ancestry.com/name-origin?surname=bagshaw", "passage_text": "You can find out when most of the Bagshaw families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival and destination."}, {"url": "http://www.ancestry.com/name-origin?surname=bagshaw", "passage_text": "The information for this chart came from the U.S. Immigration Collection at Ancestry. You can find out where the majority of the Bagshaw families were living before they immigrated to the U.S and learn where to focus your search for foreign records."}, {"url": "http://www.ancestry.ca/name-origin?surname=bagshaw", "passage_text": "English: habitational name from a place so named in Derbyshire. The first element of the place name is either the Old English personal name Bacga or an unattested Old English word, bagga, for a ‘bag-shaped’ animal (probably the badger); the second is Old English sceaga ‘copse’."}, {"url": "http://www.ancestry.com/name-origin?surname=bagshaw", "passage_text": "Bagshaw Name Meaning. English: habitational name from a place so named in Derbyshire. The first element of the place name is either the Old English personal name Bacga or an unattested Old English word, bagga, for a ‘bag-shaped’ animal (probably the badger); the second is Old English sceaga ‘copse’."}, {"url": "http://www.ancestry.ca/name-origin?surname=bagshaw", "passage_text": "You can find out where the majority of the Bagshaw families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination."}, {"url": "http://genealogy.familyeducation.com/surname-origin/bagshaw", "passage_text": "Save Name. Last name origin & meaning: English: habitational name from a place so named in Derbyshire. The first element of the place name is either the Old English personal name Bacga or an unattested Old English word, bagga, for a ‘bag-shaped’ animal (probably the badger); the second is Old English sceaga ‘copse’."}, {"url": "http://www.surnamedb.com/Surname/Bagshaw", "passage_text": "This unusual and interesting surname is of Anglo-Saxon origin, and is a habitational name, from a place in Derbyshire. The placename is derived from the Olde English pre 7th Century personal name Bacga, of uncertain etymology, and the Olde English sceaga, wood, copse; hence, Bacga's wood or Bacga's copse."}]