[{"url": "http://www.homeimprovementpages.com.au/article/what_does_concrete_resurfacing_cost", "passage_text": "Concrete surfaces last a long time, but the time comes when they need replacing or revitalizing. Fortunately, you probably don't need to replace a dingy looking concrete driveway or patio. A more cost-effective way to give a concrete surface a new lease on life is with concrete resurfacing. Concrete resurfacing is the process of applying a thin coat of concrete over an existing concrete surface. Since every job is different, the only way to find out how much concrete resurfacing will cost you is to get quotes from concrete resurfacers in your area and compare them. Before you do, though, have a look at our paving design ideas photo pages."}, {"url": "http://www.networx.com/article/cost-of-driveway-resurfacing", "passage_text": "Asphalt resurfacing also works over concrete slab driveways, provided the concrete is structurally sound and hasn't shifted. The cost of driveway resurfacing ranges widely and may start as low as $1 per square foot and go up to over $3 per square foot."}, {"url": "http://home.costhelper.com/concrete-resurfacing.html", "passage_text": "1 ThisOldHouse.com estimates it took two people five hours and six bags ($150-$180) of material to resurface a 9'x27' driveway and a 3'x18' walkway (about 300 square feet). 2  Renting a pressure washer to clean the existing concrete before resurfacing can add $40-$75 to the total DIY costs. 1 Resurfacing an average 500-square-foot concrete driveway typically costs $2,000-$5,000. 2  For do-it-yourselfers, resurfacing products in buckets or bags can be purchased at home improvement or hardware stories. 3  Total DIY costs can be $2-$5 or more a square foot, depending on the materials used"}, {"url": "http://www.homeimprovementpages.com.au/article/what_does_concrete_resurfacing_cost", "passage_text": "Using colouring agents, texturing techniques and a range of standard and custom stencil designs, concrete resurfacers can be better described as concrete artists than simply concreters. Concrete resurfacing generally costs about $50 per square metre plus the cost of the concrete, but can cost up to $100m2 or more. Extra costs may include surface preparation, including cleaning and crack repair and other necessary work outside the scope of the resurfacing itself. Since every job is different, the only way to find out how much concrete resurfacing will cost you is to get quotes from concrete resurfacers in your area and compare them. Before you do, though, have a look at our paving design ideas photo pages."}, {"url": "http://home.costhelper.com/concrete-resurfacing.html", "passage_text": "1 Expect to pay a resurfacing contractor $3-$10 a square foot depending on the condition of the existing concrete, the resurfacing system used and local rates. 2  Small residential projects tend to cost more per square foot and may be subject to a minimum charge of $500-$1,000 or more. 1 Resurfacing an average 500-square-foot concrete driveway typically costs $2,000-$5,000. 2  For do-it-yourselfers, resurfacing products in buckets or bags can be purchased at home improvement or hardware stories. 3  Total DIY costs can be $2-$5 or more a square foot, depending on the materials used"}, {"url": "http://www.askthebuilder.com/concrete-resurfacing/", "passage_text": "Concrete Resurfacing. Concrete resurfacing is a very popular project for homeowners, because it allows one to get a brand-new surface for a fraction of the cost of what new concrete would cost. The concept is not new, and it is gaining in popularity for commercial work and public highways. If the concrete resurfacing layer is thicker than 1 inch, you may also need some small rounded pea gravel for the mix."}, {"url": "http://home.costhelper.com/concrete-resurfacing.html", "passage_text": "1 Small residential projects tend to cost more per square foot and may be subject to a minimum charge of $500-$1,000 or more. 2  Resurfacing an average 500-square-foot concrete driveway typically costs $2,000-$5,000. 1 Resurfacing an average 500-square-foot concrete driveway typically costs $2,000-$5,000. 2  For do-it-yourselfers, resurfacing products in buckets or bags can be purchased at home improvement or hardware stories. 3  Total DIY costs can be $2-$5 or more a square foot, depending on the materials used"}, {"url": "http://www.concretenetwork.com/concrete/interiorfloors/cost.html", "passage_text": "1 Extensive surface preparation, such as grinding, crack repair, and spall repair, can add as much as $2 per square foot to the overall cost of the floor. 2  If a full resurfacing is needed, expect to tack on another $2 to $3 per square foot (for a $4 to $5 per square foot increase). 1 Typically installers put down a series of products including waterproofing, metal lathe, a concrete overlay and then the final finishing and sealing coats. 2  These applications can add another $2 to $3 per square foot to the"}, {"url": "http://www.concretenetwork.com/concrete/interiorfloors/cost.html", "passage_text": "Video on the cost of concrete floors. Depending on the level of complexity, concrete floors can cost as little as $2 to $6 a square foot or be as expensive as $15 to $30 a square foot. 1 Typically installers put down a series of products including waterproofing, metal lathe, a concrete overlay and then the final finishing and sealing coats. 2  These applications can add another $2 to $3 per square foot to the cost of the floor."}]