[{"url": "http://www.sheknows.com/baby-names/name/aric", "passage_text": "The name Aric is an American baby name. In American the meaning of the name Aric is: Noble commander. German Meaning: The name Aric is a German baby name. In German the meaning of the name Aric is: Noble leader. English Meaning: The name Aric is an English baby name. In English the meaning of the name Aric is: Sacred ruler. Norse Meaning: The name Aric is a Norse baby name. In Norse the meaning of the name Aric is: Rule with mercy. See also Eric. "}, {"url": "http://www.babynamespedia.com/meaning/Aric", "passage_text": "[ 2 syll. a-ric, ar-ic ] The baby boy name Aric is pronounced AA R-ih-K †. Aric's language of origin is Old Norse and Germanic. It is predominantly used in the English, Scandinavian, and German languages. In addition, Aric is an English variant transcription of Eric (English, French, and Scandinavian). Aric is also a German variant transcription of Richard (Czech, Dutch, English, French, and German)."}, {"url": "http://www.thenamemeaning.com/aric/", "passage_text": "The meaning of Aric has more than one different etymologies. It has same or different meanings in other countries and languages. The different meanings of the name Aric are: 1  Norse meaning: Eternal ruler; rule with mercy. (If you know more meanings of the name and you would like to contribute click here to submit another name meaning). The different meanings of the name Aric are: The meaning of the name “Aric” is different in several languages, countries and cultures and has more than one possibly same or different meanings available. .adslot_1 { width: 336px; height: 280px; } @media (max-width:350px) { .adslot_1 { width: 300px; height: 250px; } }"}, {"url": "https://en.wikipedia.org/wiki/Eric", "passage_text": "The given name Eric, Erik, or Erick is derived from the Old Norse name Eirikr (eiríkr Or erikr Eríkr In eastern scandinavia due). To monophthongization the, first-element ei is derived either from The-Older * proto(norse) aina z meaning one or alone Or-From * proto(norse) aiwa z meaning ever. or eternal The name is thus usually taken to mean one ruler,  autocrat , eternal ruler or ever powerful, warrior, and government. The most common spelling in Scandinavia is Erik. In Norway, another form of the name (which has kept the Old Norse diphthong) Eirik is also commonly used."}, {"url": "http://www.babynamespedia.com/meaning/Aric", "passage_text": "Aric has 19 variant transcriptions. Variation transcriptions of Aric include Aaric, Aarick, Aarik, Arec, Areck, Arek, Arich, Arick, Arict, Ariek, Arik, Arric, Arrick, Arrict, Arrik, Aryk, Ric, Rick, and Ricky. Aric is a rare baby boy name. At the peak of its usage in 1977, 0.015% of baby boys were given the name Aric. It had a ranking of #502 then. The baby name has fallen from favor since then, and is of only very modest use now. It is predominantly used in the English, Scandinavian, and German languages. In addition, Aric is an English variant transcription of Eric (English, French, and Scandinavian). Aric is also a German variant transcription of Richard (Czech, Dutch, English, French, and German)."}, {"url": "http://www.thinkbabynames.com/meaning/1/Aric", "passage_text": "Aric is an uncommon given name for men. Aric is an equivalently rare surname too for both adults and children. (2000 U.S. Census). Displayed below is the birth name popularity of Aric for boys. Aric entered the list in 1970-1979 and reached its top position of #634 in the U.S. then, but is not ranked currently. Aric /ar-ic/ [2 sylls.] as a boys' name is pronounced AIR-ik. It is of Old Norse origin, and the meaning of Aric is complete ruler. Variant of Eric. Also an element of many other names, like Alaric and Frederick. Aric actually contains the elements of Richard in reverse"}, {"url": "http://www.meaning-of-names.com/english-names/aric.asp", "passage_text": "Meaning of Aric. English name. In English, the name Aric means-Sacred ruler.. Other origins for the name Aric include-English, Greek, German.The name Aric is most often used as a boy name or male name. English Name Meaning-Sacred ruler"}, {"url": "http://www.babynamewizard.com/baby-name/boy/aric", "passage_text": "Origin of the name Eric: Derived from the Old Norse Eirikr, eirìkr a compounding of the elements (ei, ever) always and (rikr): ríkr, “ruler hence.” Eternal: Ruler, Var, Aric, Erick. Erik Irricc From a World Of baby Names By. teresa norman Derived from the Old Norse Eirikr, eirìkr a compounding of the elements (ei, ever) always and (rikr): ríkr, “ruler hence.” Eternal: Ruler, Var, Aric, Erick. Erik Irricc From a World Of baby Names By. Teresa norman buy. the book"}]