[{"url": "http://www.dachshund-owner-guide.com/piebald-dachshund.html", "passage_text": "patterns. Piebald dachshund. The piebald dachshund is one of several patterns that appear in the breed such as dapple, double dapple, sable and brindle there are also a variety of other coat colors. The piebald pattern is very eye catching and has become very popular with dachshund enthusiasts today. "}, {"url": "http://www.dappledoxie.com/varieties-of-dachshunds/", "passage_text": "Dapple is a color pattern in dachshunds, not a breed. It can be described as an intertwined mixture of the colors in a dachshund. The dapple pattern does not have to be all over the body for a dachshund to be considered dapple; some dogs only have small sections of dappling on their coat. "}, {"url": "http://www.dappledachshundpuppies.com/dappletalk.html", "passage_text": "Blue & tan dapple smooth coatPhoto courtesy ofL&R's Dachshunds. Not all dapples are born with blue eyes, but all blue eyed dachshunds are dapples and may also have piebald and the brindle pattern.It is only a myth that dachshunds with blue eyes are deaf or blind. They are a perfectly normal dog, with light colored eyes. What is a Dapple?Dapple is a pattern seen in Dachshunds. It is commonly referred to as Merle in other breeds of dogs (Collie, Sheltie, Great Dane, Australian Shepherd). It is important to understand that dapple is NOT a color, it is a pattern."}, {"url": "http://www.dachshund.org/article_double_dapple.html", "passage_text": "Dapple is a pattern seen in Dachshunds. It is commonly referred to as Merle in other breeds of dogs (Collie, Sheltie, Great Dane, Australian Shepherd). It is important to understand that dapple is NOT a color, it is a pattern. Dappling can be compared to painting a room in your house. Say you paint the room green. A piebald does not have dapple. A piebald does not have blue eyes, or partial blue eyes. A Piebald is normally marked symmetrically...meaning that if one ear is black, the other ear is black. If one paw is white, the other paw is white."}, {"url": "http://www.weatherlysdachshunds.com/genes.html", "passage_text": "Piebald is a safe means of creating white dachshund color, not lethal like dapple gene. Dapple piebald's often have one or two blue eyes-a solid piebald or brindle piebald will never have blue eyes only brown eyes. It is impossible to have blue eyes on a dachshund without the dapple pattern. Unlike the dapple the piebald will never have blue eyes unless that dog or puppy is a piebald dapple. White spotting is Irish white spotting in a dachshund. This would include any amount of white on a dachshund they should have four white legs, a white tipped tail, and a white chest."}, {"url": "http://www.jennyspups.net/Pages/CCP.aspx", "passage_text": "This is a black and tan double-dapple smooth. Double-dapple is not an acceptable pattern in the dachshund standard. Anyone adopting one of these special dachshunds from a shelter or rescue should be prepared for the dog to possibly have health concerns beyond even what is visible. This is a red double-dapple smooth. When two dapple Dachshunds are bred, it is possible for a puppy to inherit the dapple gene from both parents, resulting in a double-dapple. Double-dapples will usually have large areas of white in addition to the patches of dilution."}, {"url": "http://pets.thenest.com/piebald-dachshund-4002.html", "passage_text": "Breeding. A piebald dachshund puppy is born when two wieners with the recessive piebald gene breed together. Dachshund coat colors and patterns are determined by so-called dominant and recessive genes in the dog's parents. Notably, this does not mean that the parents both have to be piebald dachshunds. Health of Piebald Dachshunds. Generally, the health of piebald dachshunds is similar to that of other sausage dogs. The dachshund's long back predisposes the breed to neck and spine issues -- keep your dog at a healthy weight to avoid placing undue strain on the back."}, {"url": "http://www.dachshund.org/breed_colors_patterns.html", "passage_text": "The patterns found in dachshunds are dapple, double dapple, brindle, sable, and piebald. Any pattern can be superimposed over any self, or solid, color; for instance, black and tan dapple, red brindle, chocolate and tan piebald. The color is named first, followed by the pattern, if any. "}, {"url": "http://www.dachshund-owner-guide.com/dapple-dachshund.html", "passage_text": "They are one of several patterns that appear in this breed such as piebald, double dapple, brindle... there are also a variety of coat colors, that's the great thing about the dachshund there is such a choose. What is a Dapple Dachshund. Not the easiest pattern to describe, but I will give it a go. "}]