[{"url": "http://www.answers.com/Q/What_continent_is_the_arabian_peninsula_in", "passage_text": "Saudi Arabia is the largest country in the Arabian Peninsula. The  other countries include Jordan, Iraq, Kuwait, Bahrain, Qatar, the  United Arab Emirates, Oman, and Yemen. "}, {"url": "https://en.wikipedia.org/wiki/Arabian_Peninsula", "passage_text": "The Arabian Peninsula plays a critical geopolitical role in the Middle East and Arab world due to its vast reserves of oil and natural gas. Before the modern era, she is divided into four distinct regions: Hejaz, Najd, Southern Arabia and Eastern Arabia. Hejaz and Najd make-up most of modern-day Saudi Arabia. The peninsula formed as a result of the rifting of the Red Sea between 56 and 23 million years ago, and is bordered by the Red Sea to the west, the Persian Gulf to the northeast, the Levant to the north and the Indian Ocean to the southeast."}, {"url": "http://encyclopedia2.thefreedictionary.com/Arabian+subcontinent", "passage_text": "Arabia, the largest peninsula of Asia, in the southeastern part of the continent. It is washed on the west by the Red Sea, on the south by the Gulf of Aden and the Arabian Sea, and on the east by the Gulf of Oman and the Persian Gulf. The northern boundary of the Arabian Peninsula is usually drawn approximately along the 30°N parallel."}, {"url": "http://encyclopedia2.thefreedictionary.com/Arabian+Peninsula", "passage_text": "Arabia, the largest peninsula of Asia, in the southeastern part of the continent. It is washed on the west by the Red Sea, on the south by the Gulf of Aden and the Arabian Sea, and on the east by the Gulf of Oman and the Persian Gulf. The northern boundary of the Arabian Peninsula is usually drawn approximately along the 30°N parallel."}, {"url": "http://www.islamproject.org/muhammad/muhammad_04_GeographyArabianPeninsula.htm", "passage_text": "The Arabian Peninsula is a large land bridge suspended between Africa and Asia. It is among the largest peninsulas on earth, and is surrounded by water on all. sides. To the north lies the Mediterranean Sea and to the west lies the Red Sea. To the east is the Persian (or Arabian) Gulf, and to the south is the Arabian Sea, which is also part of the Indian Ocean. About three-quarters of the Arabian Peninsula is covered by deserts"}, {"url": "https://en.wikipedia.org/wiki/Arabian_Peninsula", "passage_text": "Arabian Peninsula, simplified Arabia (Arabic: الجزيرة العربية ‎ al-jazīra al-ʿarabiyya, « Island of Arabs ») is a peninsula of Western Asia situated north-east of Africa on the Arabian plate. From a geological perspective, she is considered a subcontinent of Asia. The peninsula formed as a result of the rifting of the Red Sea between 56 and 23 million years ago, and is bordered by the Red Sea to the west, the Persian Gulf to the northeast, the Levant to the north and the Indian Ocean to the southeast."}, {"url": "https://en.wikipedia.org/wiki/Arabian_Peninsula", "passage_text": "The Arabian Peninsula consists of the countries Yemen, Oman, Qatar, Bahrain, Kuwait, Saudi Arabia and the United Arab Emirates as well as parts of southern Iraq and Jordan. The peninsula formed as a result of the rifting of the Red Sea between 56 and 23 million years ago, and is bordered by the Red Sea to the west, the Persian Gulf to the northeast, the Levant to the north and the Indian Ocean to the southeast."}, {"url": "http://www.weknowtheanswer.com/q/what-continent-is-the-arabian-peninsula-on", "passage_text": "Positive: 93 %. Arabian Peninsula. Arabia, the largest peninsula of Asia, in the southeastern part of the continent. It is washed on the west by the Red Sea, on the south ... Read more. Positive: 92 %. The Antarctic Peninsula and Cape Horn create a funneling ... It's usually called part of Asia, although some people argue that it could as easily be considered part of Africa, since the Arabian peninsula is between Asia and Africa and has at least as much in common with Africa as it has with Asia. Positive: 35 %. Answer #5 | 19/07 2015 13:15. Asia."}, {"url": "http://www.answers.com/Q/What_continent_is_the_Arabian_Peninsula_located_in", "passage_text": "Share to: The Arabian Peninsula is located in Southwest Asia on which the present day nations of Saudi Arabia, Yemen, Oman, the United Arab Emirates, Qatar, Bahrain, and Kuwait are loca … ted. It is East of Africa, and West of Iraq. Answer based on History of Our World Textbook by Prentice Hall. 4 people found this useful."}]