[{"url": "http://www.econlib.org/library/Enc/Capitalism.html", "passage_text": "Even nineteenth-century economists—in England, America, and Western Europe—who were supposedly capitalism’s defenders did not defend capitalism effectively because they did not understand it. They came to believe that the most defensible economic system was one of “perfect” or “pure” competition."}, {"url": "http://www.worldsocialism.org/english/what-capitalism", "passage_text": "Capitalism is the social system which now exists in all countries of the world. Under this system, the means for producing and distributing goods (the land, factories, technology, transport system etc) are owned by a small minority of people."}, {"url": "https://www.probe.org/capitalism-and-socialism/", "passage_text": "Socialism is an economic system in which there is public or state ownership of the means of production and the primary focus is on providing an equality of outcomes."}, {"url": "http://www.econlib.org/library/Enc/Capitalism.html", "passage_text": "Return to top. “ Capitalism,” a term of disparagement coined by socialists in the mid-nineteenth century, is a misnomer for “economic individualism,” which Adam Smith earlier called “the obvious and simple system of natural liberty” (Wealth of Nations)."}, {"url": "http://www.worldsocialism.org/english/what-capitalism", "passage_text": "It is widely assumed that capitalism means a free market economy. But it is possible to have capitalism without a free market. The systems that existed in the U.S.S.R and exist in China and Cuba demonstrate this. These class-divided societies are widely called 'socialist'."}, {"url": "http://www.encyclopedia.com/topic/capitalism.aspx", "passage_text": "capitalism Economic system in which property and the means of production are privately owned. Capitalism is based on profit motive, free enterprise, efficiency through competition and a notion of freedom of choice."}, {"url": "http://www.econlib.org/library/Enc/Socialism.html", "passage_text": "Socialism—defined as a centrally planned economy in which the government controls all means of production—was the tragic failure of the twentieth century. Born of a commitment to remedy the economic and moral defects of capitalism, it has far surpassed capitalism in both economic malfunction and moral cruelty."}, {"url": "http://www.worldsocialism.org/english/what-capitalism", "passage_text": "Class division. Capitalism is the social system which now exists in all countries of the world. Under this system, the means for producing and distributing goods (the land, factories, technology, transport system etc) are owned by a small minority of people. We refer to this group of people as the capitalist class."}, {"url": "http://www.encyclopedia.com/topic/capitalism.aspx", "passage_text": "CAPITALISM is an economic system dedicated to production for profit and to the accumulation of value by private business firms. In the fully developed form of industrial capitalism, firms advance money to hire wage laborers and to buy means of production such as machinery and raw materials."}]