[{"url": "http://christmas-specials.wikia.com/wiki/Jacob_Marley", "passage_text": "Jacob Marley's ghost visits Scrooge in Charles Dickens' A Christmas Carol. Jacob Marley (died 24 December, 1836) is a fictional character who appears in the Charles Dickens novel A Christmas Carol. In life, Marley was the business partner of Ebenezer Scrooge. Analysis. The life and afterlife of Jacob Marley is not detailed in A Christmas Carol. The reader has no idea exactly how Marley escaped with an arrangement for Scrooge's redemption. Even he himself appears uncertain as to how he is visible to Scrooge on this night, when he has followed him, invisible, on many and many a day"}, {"url": "https://en.wikipedia.org/wiki/Jacob_Marley", "passage_text": "In A Christmas Carol, Marley is the first character mentioned in the first line of the story. Jacob Marley is said to have died seven years earlier on Christmas Eve (as the setting is Christmas Eve 1843, this would have made the date of his passing December 24, 1836). It would be his ghost who would be Scrooge's first visitor (before the three other spirits to come). 1 In 1992, the song Jacob Marley's Chain is the 8th cut on Aimee Mann 's Whatever album, her first solo release after the dissolution of 'til Tuesday. 2  In the 1994 special A Flintstones Christmas Carol, the character is called 'Jacob Marble y' and is played by Mr. Slate (John Stephenson"}, {"url": "http://disney.wikia.com/wiki/Jacob_Marley", "passage_text": "Jacob Marley is the long deceased business partner of Ebenezer Scrooge. He is a character from Charles Dickens ' story A Christmas Carol and its many adaptations. "}, {"url": "http://www.imdb.com/character/ch0000492/bio", "passage_text": "Visit our Character Biography Help to learn more. Jacob Marley was born in 1785. He was a banker, and an usurious moneylender. He worked at a counting house, with his business partner, Ebenezer Scrooge. Marley was disgusted by the poor, and praised workhouses"}, {"url": "http://villains.wikia.com/wiki/Jacob_Marley", "passage_text": "Jacob Marley. 36,075 pages on this wiki. Jacob Marley is an important character in A Christmas Carol and acts as a harbinger to Scrooge and a striking warning of the inevitable price that a life of evil can have on a man's very soul."}, {"url": "https://en.wikipedia.org/wiki/A_Christmas_Carol_%281984_film%29", "passage_text": "The film opens with a funeral procession, presumably that of Jacob Marley, as his death is mentioned by the narrator (Roger Rees). The scene then changes to seven years later, on Christmas Eve in 1843 within the business establishment of Scrooge and Marley. A Christmas Carol is a 1984 television film adaptation of Charles Dickens ' famous 1843 holiday novella of the same name. The film is directed by Clive Donner who had been an editor of the 1951 film Scrooge and stars George C. Scott as Ebenezer Scrooge."}, {"url": "http://www.enotes.com/homework-help/who-marley-46163", "passage_text": "Posted on. (Answer #1). Jacob Marley was Scrooge's business partner and probably his only friend in his later years. Marley's spirit is the first to visit Scrooge to warn him that he will be visited by three more spirits that night. Scrooge notices that Marley is bound by a chain and asks the spirit about it. Posted on. (Answer #3). Jacob Marley is Scrooge's old business partner who died. In the story, Marley returns from the dead to warn Scrooge of the visits of the three ghosts that he will encounter."}, {"url": "https://en.wikipedia.org/wiki/Jacob_Marley", "passage_text": "Jacob Marley is a fictional character who appears in Charles Dickens ' 1843 novella A Christmas Carol. 1 In 1992, the song Jacob Marley's Chain is the 8th cut on Aimee Mann 's Whatever album, her first solo release after the dissolution of 'til Tuesday. 2  In the 1994 special A Flintstones Christmas Carol, the character is called 'Jacob Marble y' and is played by Mr. Slate (John Stephenson)"}]