[{"url": "http://montcourt.org/jurorinfo.php?page=know&topic=4", "passage_text": "If you are selected as a juror, you will only be asked to serve for one trial regardless of its length. The average jury trial is approximately two (2) to three (3) consecutive days. On the other hand, a complex trial that involves many witnesses may last for several weeks. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090710151046AAdtHys", "passage_text": "Most people who report for jury service are finished in one day, but we cannot predict in advance how long the trials will be for any particular day, so you should be prepared for anything. In addition, the judge may vary daily working hours to accommodate witnesses who have special travel or schedule problems. I've been selected to be a jury for a trial (lucky me) and i want to know how long it usually last for."}, {"url": "https://www.gov.uk/jury-service/overview", "passage_text": "How long jury service lasts. Jury service usually lasts up to 10 working days but can be longer. You may be on a jury for more than one trial during your service. "}, {"url": "https://answers.yahoo.com/question/index?qid=20081124095507AAqaTyf", "passage_text": "Just because you are summoned to jury duty does not mean that you will actually be chosen to serve on a jury. If you are not chosen then chances are your service will only last that one day. If you are chosen to be on a jury then your service will last until the trial is over. it depends. your service will last as long as the case last. this can be anywhere from 2days to a year or two. Or if you know the person or have any sort of relation to the person on trial you will be excempt from your trial duty. beauteimparfait · 7 years ago. Thumbs up. 2. Thumbs down. 0. 1 comment. Loading ..."}, {"url": "http://www.mass.gov/courts/jury-info/trial-and-grand-jurors/trial-jurors/", "passage_text": "1 This means that as a trial juror, you will serve for either one day or for the duration of one trial (if you are impaneled on a case). 2  Most, but not all, of those who report for jury duty serve for only one day. 3  Almost all jurors complete their service within three days. 1 The Commonwealth of Massachusetts operates under the One Day or One Trial system. 2  This means that as a trial juror, you will serve for either one day or for the duration of one trial (if you are impaneled on a case). 3  Most, but not all, of those who report for jury duty serve for only one day."}, {"url": "http://gunsandbutter.blogspot.com/2012/01/criminal-law-how-long-does-criminal.html", "passage_text": "The preliminary hearing phase of the trial usually takes place 5-6 days after an arraignment. In the case of a misdemeanor charge, the next phase of the trial is the motions and hearings phase. This usually takes about 3 months to occur but can last as long as 2 years. During this phase evidence issues are settled and investigations are conducted to determine the allowance or suppression of witnesses. However, most criminal trials do not take nearly as long as the popular media trials would seem to make you think. Usually the entire process from arrest to sentencing takes less than a couple of years to complete. The first part of any trial process is the arrest phase."}, {"url": "http://www.insd.uscourts.gov/jury/faq?page=1", "passage_text": "Generally, trials last between three and five days. Please check the back of your Summons for any exceptions. Also, the judge will inform you the morning of jury selection as to how long the trial will last. Please inform the judge of any serious hardships at this time. The number of jurors that are selected depends on the type of case. For a civil trial, six to eight jurors may be selected. For a criminal trial, twelve to fourteen may be selected. The court always calls more jurors than needed for the jury selection process."}, {"url": "https://answers.yahoo.com/question/index?qid=20090710151046AAdtHys", "passage_text": "Best Answer: Any citizen selected for a jury serves for the duration of one trial, however long that trial may last. The average length of trial in Montgomery County is two to three days. I've been selected to be a jury for a trial (lucky me) and i want to know how long it usually last for."}, {"url": "https://www.saccourt.ca.gov/jury/general.aspx", "passage_text": "You may want to bring something to occupy your time. If you are selected to serve on a trial as a sworn juror, the term of service will be the length of that trial. Trials vary in length, but generally last one to two weeks. If you are not selected to serve on a trial by the end of your first day at the courthouse, and the judge has not ordered you to return for another day of jury selection, you have completed your jury service. "}]