[{"url": "http://www.sunsigns.org/turtle-animal-totem-symbolism-meanings/", "passage_text": "Turtle Animal Totem Symbolism. There is a story that appears, in many cultures, of the world being carried on the back of four great elephants, who in turn stand upon the back of a giant sea-turtle. The Iroquois believe that we live on the back of a great turtle that cast off it’s shell. The turtle animal totem helps you move slowly throughout this world, observing it as it goes by, allowing slow steady work to drive your purposes forward. Even the act of putting her eggs in the sand speaks of this wisdom."}, {"url": "http://www.universeofsymbolism.com/turtle-symbolism.html", "passage_text": "Symbolic Meaning of Turtle ... Sea Turtle is a very ancient soul living in the seas, land turtles make their home the deserts and the forests. Turtle spirit animal gracefully teaches us the art of adapting to new surroundings and environments. Turtle Meaning and the Symbols of Longevity. A magnificent gift from Turtle meaning is longevity. Turtles live a very long and fruitful life, and teaches great spiritual significance of taking the very best care of self and having a long life filled with splendid journeys having learned many valuable life lessons."}, {"url": "http://www.universeofsymbolism.com/turtle-symbolism.html", "passage_text": "Turtle spirit animal carries the energies of: self pace, patience, protection. Turtle brings the animal magic of: serendipity, intuition. Messages of Turtle Symbolism and Meaning... The brilliant message from this little Turtle Totem is not to push yourself so fast that you make errors and miss opportunities. Turtle Meaning and the Symbols of Longevity. A magnificent gift from Turtle meaning is longevity. Turtles live a very long and fruitful life, and teaches great spiritual significance of taking the very best care of self and having a long life filled with splendid journeys having learned many valuable life lessons."}, {"url": "http://www.whats-your-sign.com/animal-symbolism-turtle.html", "passage_text": "Symbolic Turtle Meanings. Those with the turtle as their animal totem can relate to the sure and steady message this creature brings to our lives. It is also a powerful totem for protection as withdrawing into it's shell is an amazing self-defense mechanism. The turtle has few predators, which gives it an innocent energy. This also increases its lifespan, and so holds the symbolic meaning for longevity in many cultures."}, {"url": "http://www.sunsigns.org/tortoise-animal-totem-symbolism-meanings/", "passage_text": "Tortoise Animal Totem Symbolism. The tortoise animal totem lives its life in a slow and steady manner. Because of the simple ways that the tortoise or turtle totem acts, it has inspired stories and symbolism in many cultures all around the world. Because of all of these things, the tortoise spiritual totem is sometimes a symbol for the magical and mystical, but mostly for it’s wisdom. Around the world, in different cultures and during different years, the tortoise symbolism has been pretty much the same."}, {"url": "http://www.warpaths2peacepipes.com/native-american-symbols/turtle-symbol.htm", "passage_text": "For additional information please refer to the Meanings of Animal Symbols. The Turtle Symbol-Meaning The turtle is a sacred figure in Native American symbolism as it represents Mother Earth. The meaning of the Turtle symbol signifies good health and long life. The turtle has great longevity living up to 150 years. Native American Symbols, like the Turtle symbol, can vary in meaning from one tribe to another and across the culture groups of North America. Discover facts and information about the meanings of secret and mysterious symbols used by Native American Indians in our List of Symbols including the Turtle symbol."}, {"url": "http://www.universeofsymbolism.com/turtle-symbolism.html", "passage_text": "Turtle Symbolism & Meaning symbol of trusting your inner vision. Turtle Symbolism... by Presley Love The mystical messages and symbols of the ancient and legendary Turtle totem animal... gifts of finding inner wisdom, the magic of intuition, symbolic meaning of vast journeys and the gift of long life. Turtle Meaning and the Symbols of Longevity. A magnificent gift from Turtle meaning is longevity. Turtles live a very long and fruitful life, and teaches great spiritual significance of taking the very best care of self and having a long life filled with splendid journeys having learned many valuable life lessons."}]