[{"url": "http://www.acronymfinder.com/Sexuality-Information-and-Education-Council-of-the-United-States-(SIECUS).html", "passage_text": "1 Chicago style: Acronym Finder. 2  S.v.  3 SIECUS.. 4  Retrieved October 12 2015 from http://www.acronymfinder.com/Sexuality-Information-and-Education-Council-of-the-United-States-(SIECUS).html. 1 S.v.  2 SIECUS.. 3  Retrieved October 12 2015 from http://www.acronymfinder.com/Sexuality-Information-and-Education-Council-of-the-United-States-(SIECUS).html. 4  APA style: SIECUS. (n.d.)"}, {"url": "http://www.communityactionkit.org/index.cfm?fuseaction=Page.viewPage&PageID=925", "passage_text": "For more information, go to www.siecus.org, www.nomoremoney.org, www.ncsse.org, or email us at our Contact Us page. If you are facing a Community Controversy …. SIECUS provides strategies, tools, resources, and support to help those facing a community controversy regarding sexuality education and sexual health programs. SIECUS works to create a world that ensures social justice and sexual rights."}, {"url": "http://www.siecus.org/index.cfm?fuseaction=Page.ViewPage&PageID=529", "passage_text": "In 1964, a physician, a lawyer, a sociologist, a family life educator, a clergyman, and a public health educator came together to form a new organization dedicated to assuring that all people had access to information about sexuality. Individuals with questions about STDs can contact the American Social Health Association’s STI Resource Center Hotline at 800/227-8922 or the Centers for Disease Control and Prevention’s Hotline at 800/CDC-INFO."}, {"url": "http://www.charitynavigator.org/index.cfm?bay=search.summary&orgid=7687", "passage_text": "SIECUS, the Sexuality Information and Education Council of the United States, was founded in 1964 to provide education and information about sexuality and sexual and reproductive health. SIECUS affirms that sexuality is a fundamental part of being human, one that is worthy of dignity and respect. We advocate for the right of all people to accurate information, comprehensive education about sexuality, and sexual health services."}, {"url": "http://www.communityactionkit.org/index.cfm?fuseaction=Page.viewPage&PageID=925", "passage_text": "S IECUS—the Sexuality Information and Education Council of the United States was founded in 1964 to provide education and information about sexuality and sexual and reproductive health. SIECUS affirms that sexuality is a fundamental part of being human, one that is worthy of dignity and respect. SIECUS works to create a world that ensures social justice and sexual rights."}, {"url": "http://www.siecus.org/index.cfm?fuseaction=Page.ViewPage&PageID=529", "passage_text": "SIECUS helps thousands of journalists working on stories related to sexuality each year. We provide background information, statistics, and analysis of current trends. SIECUS’ senior staff members frequently serve as experts in the media and are available for interviews. Individuals with questions about STDs can contact the American Social Health Association’s STI Resource Center Hotline at 800/227-8922 or the Centers for Disease Control and Prevention’s Hotline at 800/CDC-INFO."}, {"url": "http://www.communityactionkit.org/index.cfm?fuseaction=Page.viewPage&PageID=925", "passage_text": "SIECUS offers a variety of resources for individuals and organizations who believe that young people deserve comprehensive, medically accurate information about sexuality and sexual and reproductive health issues. SIECUS works to create a world that ensures social justice and sexual rights."}, {"url": "http://www.acronymfinder.com/Sexuality-Information-and-Education-Council-of-the-United-States-(SIECUS).html", "passage_text": "1 MLA style: SIECUS.. 2  Acronym Finder. 2015. 3  AcronymFinder.com 12 Oct. 2015 http://www.acronymfinder.com/Sexuality-Information-and-Education-Council-of-the-United-States-(SIECUS).html. 4  Chicago style: Acronym Finder. 1 S.v.  2 SIECUS.. 3  Retrieved October 12 2015 from http://www.acronymfinder.com/Sexuality-Information-and-Education-Council-of-the-United-States-(SIECUS).html. 4  APA style: SIECUS. (n.d.)"}, {"url": "http://www.acronymfinder.com/Sexuality-Information-and-Education-Council-of-the-United-States-(SIECUS).html", "passage_text": "SIECUS stands for Sexuality Information and Education Council of the United States. Suggest new definition. This definition appears very frequently and is found in the following Acronym Finder categories: 1  Organizations, NGOs, schools, universities, etc. 1 S.v.  2 SIECUS.. 3  Retrieved October 12 2015 from http://www.acronymfinder.com/Sexuality-Information-and-Education-Council-of-the-United-States-(SIECUS).html. 4  APA style: SIECUS. (n.d.) Acronym Finder."}, {"url": "http://www.thebody.com/content/art2406.html", "passage_text": "About the SHOP Talk Bulletin. SIECUS is a 35-year-old nonprofit organization, dedicated to affirming that sexuality is a natural and healthy part of life. SIECUS develops, collects, and disseminates information, promotes comprehensive education, and advocates the right of individuals to make responsible sexual choices. SIECUS has initiated a special AIDS education project. SIECUS publishes the Guidelines for Comprehensive Sexuality Education: K-12th Grade. SIECUS is working internationally to adapt the guidelines for use in other countries."}]