[{"url": "http://www.answers.com/Q/In_what_units_is_weight_measured", "passage_text": "In the SI System, to measure mass we use an unit called the 'kilogram' whereas, to measure weight we use an unit called the 'newton'. A newton = 0.102 kilogram force, which is the same force as 0.224 pound force. Weight is expressed in units of force. Some popular units of force are the. pound, ounce, poundal, newton, dyne, ton, stone, etc. Any of these can be. used to describe a weight. Weight is not measured in units of mass, such as the gram or kilogram."}, {"url": "http://units.wikia.com/wiki/Weight", "passage_text": "The kilogram-force is a non-SI unit of force, defined as the force exerted by a one kilogram mass in standard Earth gravity (equal to 9.80665 newtons exactly). The dyne is the cgs unit of force and is not a part of SI, while weights measured in the cgs unit of mass, the gram, remain a part of SI. In commercial and everyday use, the term weight is usually used to mean mass, and the verb to weigh means to determine the mass of or to have a mass of. Used in this sense, the proper SI unit is the kilogram (kg)."}, {"url": "https://answers.yahoo.com/question/index?qid=1006042704198", "passage_text": "On Earth one kilogram weighs 9.8 Newtons. In the English system, weight is measured in pounds. The English unit of mass is a slug, but most people who have not studied physics have never heard of a slug. On Earth one slug weight 32 pounds. campbelp2002 · 10 years ago. Weight *is* a unit of force. hoarp001: Weight is a unit of force, all the units you put there are units of mass, not weight. zeno : From other experiments, we know that g, or acceleration by free fall is actually an acceleration of 9.8N at sea level G is acceleration due to gravity."}, {"url": "http://units.wikia.com/wiki/Mass", "passage_text": "In the SI system of units, mass is measured in kilograms (kg). Many other units of mass are also employed, such as: grams (g), metric tons, pounds, ounces, long and short tons, quintals, slugs, atomic mass units, Planck masses, solar masses, and eV / c 2. "}, {"url": "https://answers.yahoo.com/question/index?qid=1006042704198", "passage_text": "Newtons is the standard SI unit of measure though. Edit: when i say acceleration, i mean acceleration due to gravity. Weight *is* a unit of force. hoarp001: Weight is a unit of force, all the units you put there are units of mass, not weight. zeno : From other experiments, we know that g, or acceleration by free fall is actually an acceleration of 9.8N at sea level G is acceleration due to gravity."}, {"url": "http://www.answers.com/Q/What_is_weight_measured_in", "passage_text": "Weight is measured with different types of balances; in the SI  system the unit is kilogram (also used multiples).      Answer     Unfortunately, the origi … nal answer is incorrect.     'Weight' is a force due to gravity and, therefore, is  measured in newtons in SI. Weight is measured using a spring  balance, calibrated in newtons. Because weight is affected by  gravity, an object of given mass will have a different weight,  according to where it is measured.     'Mass', on the other hand, is measured in kilograms in SI."}, {"url": "http://www.answers.com/Q/In_what_units_is_weight_measured", "passage_text": "Since weight is force and force = mass*acceleration, the unit for weight is a unit of mass times a unit for acceleration. The SI unit for weight is in kg*m/s2, or Newtons (N) So your weight in Newtons would be your mass in kilograms multiplied by the acceleration due to gravity of the planet you are on. If you are on Earth, you would multiply your mass in kilograms by approximately 9.81, to get your weight in Newtons. Weight is expressed in units of force. Some popular units of force are the. pound, ounce, poundal, newton, dyne, ton, stone, etc. Any of these can be. used to describe a weight. Weight is not measured in units of mass, such as the gram or kilogram."}, {"url": "http://www.enotes.com/homework-help/what-unit-mass-54161", "passage_text": "(Answer #3). Mass is the amount of stuff in an object. That is, the amount of atoms and molecules present. Mass in science, is measured in the metric system using units such as kilogram (about 2.2 pounds)nwhich are a thousand grams, grams, centigrams (hundredths of grams), and milligrams (thousandths of grams). Mass is different from weight, Weight is a force. "}, {"url": "https://en.wikipedia.org/wiki/Weight", "passage_text": "The slug is defined as the amount of mass that accelerates at 1 ft/s 2 when one pound-force is exerted on it, and is equivalent to about 32.2 pounds (mass). The kilogram-force is a non-SI unit of force, defined as the force exerted by a one kilogram mass in standard Earth gravity (equal to 9.80665 newtons exactly). The dyne is the cgs unit of force and is not a part of SI, while weights measured in the cgs unit of mass, the gram, remain a part of SI. "}]