[{"url": "http://esl.fis.edu/teachers/support/mistakes.htm", "passage_text": "Mechanical mistakes are those of orthography (spelling and capitalization) and punctuation. Everyone who writes in English makes such mistakes, whether native speaker or ESL student. In many cases mechanical errors are the consequence of quick writing where the focus is on the content rather than the form. Usage mistakes A usage mistake is a word or a string of words in a sentence that is grammatically possible*, but not usual in standard English. Hence native speakers rarely make usage mistakes, but ESL students very often do."}, {"url": "http://www.businessdictionary.com/definition/experimental-error.html", "passage_text": "Types of experimental error include human error, or mistakes in data entry; systematic error, or mistakes in the design of the experiment itself; or random error, caused by environmental conditions or other unpredictable factors. "}, {"url": "https://answers.yahoo.com/question/index?qid=20110503153930AAvQmpC", "passage_text": "What I... show more for my class we're supposed to correct all of our mechanical errors in our paper. Previously, I've defined a mechanical error to be an error with the spelling of a word or the grammar within the sentence. However, I'm confused."}, {"url": "http://esl.fis.edu/teachers/support/mistakes.htm", "passage_text": "Mistakes are an inevitable part of this process and neither the teacher nor the student should become fixated on them. It is useful for both, however, to have an understanding of the variety of typical errors in written English, since these are the most amenable to correction. Written errors can be categorized as errors of mechanics, grammar and usage. Usage mistakes A usage mistake is a word or a string of words in a sentence that is grammatically possible*, but not usual in standard English. Hence native speakers rarely make usage mistakes, but ESL students very often do."}, {"url": "http://linguistics.byu.edu/faculty/henrichsenl/connecting/html/mechanics.html", "passage_text": "Mechanical and Grammatical Factors. Non-native speakers are bound to make mechanical and grammatical errors when writing in English. For some of your students, their sentence and word-level errors will be so great as to impede comprehension. Use this knowledge when discussing mechanical errors with your students. Non-native English speaking students are often self-conscious about grammatical errors, and may request correction from you regarding them."}, {"url": "https://en.wikipedia.org/wiki/Sensor", "passage_text": "In the broadest definition, a sensor is an object whose purpose is to detect events or changes in its environment, and then provide a corresponding output. A sensor is a type of transducer; sensors may provide various types of output, but typically use electrical or optical signals. For example, a thermocouple generates a known voltage (the output) in response to its temperature (the environment)."}, {"url": "http://www.yourdictionary.com/mechanical", "passage_text": "adjective. The definition of mechanical is something that relates to the skill or use of machinery or tools. An example of mechanical is a mechanical skill, when someone is able to fix machines. 1  using or having to do with machinery. 2  having skill in the use of machinery or tools. 1 Of or relating to machines or tools: mechanical skill. 2  Operated or produced by a mechanism or machine: a mechanical toy dog. 3  Of, relating to, or governed by mechanics. 4  Performed or performing in an impersonal or machinelike manner; automatic: a droning, mechanical delivery of the speech."}]