[{"url": "https://en.wikipedia.org/wiki/Cherokee_Nation", "passage_text": "Headquartered in Tahlequah, Oklahoma, the Cherokee Nation has a tribal jurisdictional area spanning 14 counties in the northeastern corner of Oklahoma. These are Adair, Cherokee, Craig, Delaware, Mayes, McIntosh, Muskogee, Nowata, Ottawa, Rogers, Sequoyah, Tulsa, Wagoner, and Washington Counties."}, {"url": "https://en.wikipedia.org/wiki/Cherokee_Nation", "passage_text": "The Cherokee Nation (Cherokee: ᏣᎳᎩᎯ ᎠᏰᎵ, Tsalagihi Ayeli) is the largest of three Cherokee federally recognized tribes in the United States."}, {"url": "http://www.cherokee.org/AboutTheNation.aspx", "passage_text": "About The Nation. The Cherokee Nation is the federally-recognized government of the Cherokee people and has inherent sovereign status recognized by treaty and law. The seat of tribal government is the W.W. Keeler Complex near Tahlequah, Okla., the capital of the Cherokee Nation."}, {"url": "http://www.cherokee.org/AboutTheNation.aspx", "passage_text": "We are the largest tribal nation in the United States. MISSION: The Cherokee Nation is committed to protecting our inherent sovereignty, preserving and promoting Cherokee culture, language and values, and improving the quality of life for the next seven generations of Cherokee citizens."}, {"url": "http://www.indians.org/articles/cherokee-indians.html", "passage_text": "The Cherokee Indians were one of the largest of five Native American tribes who settled in the American Southeast portion of the country. The tribe came from Iroquoian descent. They had originally been from the Great Lakes region of the country, but eventually settled closer to the east coast."}, {"url": "http://www.bigorrin.org/cherokee_kids.htm", "passage_text": "How is the Cherokee Indian nation organized? There are three federally recognized Cherokee tribes: the Cherokee Nation of Oklahoma, the United Keetoowah Band in Oklahoma, and the Eastern Band of Cherokee Indians in North Carolina."}, {"url": "https://en.wikipedia.org/wiki/Cherokee", "passage_text": "Of the three federally recognized Cherokee tribes, the Cherokee Nation and the United Keetoowah Band of Cherokee Indians (UKB) have headquarters in Tahlequah, Oklahoma. The UKB are mostly descendants of Old Settlers, Cherokee who migrated to Arkansas and Oklahoma about 1817."}, {"url": "http://www.cherokee.org/", "passage_text": "The Cherokee Nation is now issuing photo tribal citizenship cards. Cherokee citizens can visit the tribe’s registration department to get a valid photo ID, similar in appearance to a driver’s license."}]