[{"url": "http://healthyeating.sfgate.com/calories-benefits-raw-sugar-11544.html", "passage_text": "For example, a teaspoon of turbinado sugar weighs 4.6 grams and contains 18 calories, a teaspoon of granulated white sugar weighs 4.2 grams and contains 16 calories and a teaspoon of dark muscavado weighs 5 grams and contains 20 calories."}, {"url": "http://smartypantsvitamins.com/organic-cane-sugar-vs-other-sweeteners-how-they-measure-up-part-1/", "passage_text": "Organic cane sugar is not like brown sugar, which is white sugar with molasses thrown back in. The light color of organic cane sugar is comparable to turbinado or “raw” sugar, a sign that it is less processed compared to other wholesome sweeteners such as muscovado and molasses."}, {"url": "http://www.diabetesselfmanagement.com/blog/sugar-is-sugar-by-any-other-name-or-is-it-part-1/", "passage_text": "1 One teaspoon of sugar contains 15 calories and 4 grams of carbohydrate. 2  One tablespoon of sugar contains 16 grams of carbohydrate, the same amount of carb that’s in a slice of bread."}, {"url": "http://blog.fooducate.com/2012/09/16/honey-or-sugar-which-is-healthier/", "passage_text": "Honey is composed mostly of the monosaccharide molecules glucose and fructose, just like table sugar. It has a higher moisture content than table sugar, about 17% water. There are also small amounts of pollen, wax, and minerals to be found in honey. One teaspoon of honey has 22 calories vs only 16 calories for sugar."}, {"url": "http://www.diabetesselfmanagement.com/blog/sugar-is-sugar-by-any-other-name-or-is-it-part-1/", "passage_text": "You state, “One teaspoon of sugar contains 15 calories and 4 grams of carbohydrate. One tablespoon of sugar contains 16 grams of carbohydrate, the same amount of carb that’s in a slice of bread.” A tablespoon equals 3 teaspoons."}, {"url": "http://www.livestrong.com/article/121081-calories-brown-sugar-white-sugar/", "passage_text": "One Teaspoon Of White Sugar. The granule size of white sugar is very consistent in size. Using a standard measuring teaspoon, one teaspoon will contain about 4 grams of sugar and about 16 calories."}, {"url": "http://healthyeating.sfgate.com/sugar-vs-sugar-raw-9250.html", "passage_text": "Sugar vs. Sugar In The Raw. Granulated sugar is 100 percent sucrose with all of the molasses removed. Sugar In The Raw, which is a brand name for turbinado sugar, is refined sucrose that still has some of its natural molasses. It can also be made by mixing white sugar with specially prepared molasses. To create brown sugar, sucrose is boiled with molasses."}]