[{"url": "http://www.wikihow.com/Help-a-Cat-Give-Birth", "passage_text": "Whether you are breeding purebred cats for a living or you are responsible for a cat that has become pregnant in your care, it is important to know what to do when the cat goes into labor and begins to give birth to her kittens."}, {"url": "http://canigivemycat.com/how-can-i-tell-when-my-cat-will-give-birth", "passage_text": "Having a pregnant cat can be an exciting if not interesting time, and knowing when your cat will give birth is pretty important. Cats are generally pregnant for 9 weeks, condensing things down considerably from a human pregnancy."}, {"url": "http://www.myhealthycat.com/cats-giving-birth-to-kittens.html", "passage_text": "This stage is the big time! Now your pregnant cat will start to have major contractions. She will be breathing deeply and you will see visible movement and shuddering of her belly. In the beginning, the contractions for cats giving birth to kittens may be once every 30 minutes and possibly longer. They gradually become more frequent and occur every 30 seconds until right before the birth of the first kitten."}, {"url": "http://www.catforum.com/forum/39-breeding/130806-my-cats-labor-but-not-giving-birth.html", "passage_text": "Re: My cat's in labor, but not giving birth... One of my cats gave birth 5 years ago(she got preggers at 4 months old...at the time I'd been told cats couldn't be spayed til 6 months. :\\) and she tried to give birth in my lap. She just hopped into my lap, started purring, and then started having contractions."}, {"url": "http://www.catsofaustralia.com/cat-giving-birth-labor.htm", "passage_text": "Usually about two days before giving birth your cat's mammary glands will increase in size and she will begin. producing milk. Stage 1 - The onset of labour is often around 12 hours before the appearance of the first kitten.."}, {"url": "http://www.myhealthycat.com/cats-giving-birth-to-kittens.html", "passage_text": "Cats giving birth to kittens are wonderful to watch and be a part of. Your feline's natural instincts will handle most of the details. However, your female cat (or queen) may be a little nervous if this is her first time delivering kittens."}, {"url": "http://www.cat-world.com.au/parturition-birth-in-cats", "passage_text": "Around two days before the queen gives birth, she will start producing milk. She may start nesting. Normal temperature in a cat is 100 - 102.5°F (37.7 - 39.1°C). A day or two before birth, her temperature drops to 99°F (37.2 °C). Change in behaviour."}, {"url": "http://www.youtube.com/watch?v=8JgqLELdUkY", "passage_text": "This is my cat Toula. She started telling me she was ready to give birth to her beautiful kittens and was telling me to follow her as she didnt want to be on her own. she went on to have 4 beautiful kittens in my bottom drawer! :D Over one million views 13/01/2013 :D."}]