[{"url": "https://en.wikipedia.org/wiki/Gotham_City", "passage_text": "Gotham had long been a well-known nickname for New York City even prior to Batman's 1939 introduction, which explains why Gotham Jewelers and many other businesses in New York City have the word Gotham in them. Gotham City's skyline, as it appears in the Batman (1989) movie. 1  Batman (1989), the look of Gotham was designed by production designer Anton Furst, who won an Oscar for his work on the film. 2  Tim Burton's sequel, Batman Returns (1992), filmed city scenes entirely on soundstages."}, {"url": "http://www.onlocationvacations.com/2014/03/14/gotham-filming-locations-updates/", "passage_text": ". 5. Today, filming began on the highly anticipated new FOX series Gotham in New York and we have a few more details about the shoot. Today, GOT production signs (which we believe are for Gotham) were spotted in Glen Cove, NY. "}, {"url": "http://www.thelocationguide.com/blog/2014/02/ng-television-gotham-city-on-screen-location-filming-options-for-james-gordon-tv-drama/", "passage_text": "New Fox TV drama Gotham will explore the early career of James Gordon, the detective who eventually helps Batman with his fight against Gotham City’s super-villains. Filming locations for the series will need to offer tax incentives and film-friendly production infrastructure. "}, {"url": "http://batman.wikia.com/wiki/Gotham_City_(Nolan_Films)", "passage_text": "― James Gordon. Gotham City is a large metropolitan city in the United States. It serves as the home of billionaire playboy Bruce Wayne, who uses his alter-ego of Batman to protect the city against organized crime. Gotham is the darkest of America's cities, and only rumors of a Batman give it hope"}, {"url": "http://batmanfanon.wikia.com/wiki/Gotham_(film)", "passage_text": "1,159 pages on this wiki. Gotham is a 2014 film based off of the Batman series of comic books. It features Orlando Bloom as Bruce Wayne/The Bat, with Pierce Brosnan as Alfed Pennyworth, and Ewan McGregor as Commander Gordon. It was directed by Ron Howard."}, {"url": "http://batman.wikia.com/wiki/Gotham_City_(Nolan_Films)", "passage_text": "Behind the Scenes. 1  Gotham City is filmed in Chicago in Batman Begins and The Dark Knight. 2  In The Dark Knight Rises, Gotham City scenes are shot in Pittsburgh, Los Angeles, and New York City. 3  Christopher Nolan and Nathan Crowley drew elements for Gotham from Hong Kong, Chicago, New York City, and Tokyo. Gotham City is a large metropolitan city in the United States. It serves as the home of billionaire playboy Bruce Wayne, who uses his alter-ego of Batman to protect the city against organized crime. Gotham is the darkest of America's cities, and only rumors of a Batman give it hope"}, {"url": "https://en.wikipedia.org/wiki/Gotham_(film)", "passage_text": "Gotham, also known as The Dead Can't Lie, is a 1988 American thriller film written and directed by Lloyd Fonvielle and starring Tommy Lee Jones and Virginia Madsen. "}, {"url": "http://www.fool.com/investing/general/2014/03/19/foxs-gotham-starts-filming-3-reasons-the-bat-babie.aspx", "passage_text": "The Motley Fool has a disclosure policy. Fox 's (NASDAQ:FOX) Gotham, the eagerly anticipated TV series featuring the early days of Detective James Gordon in a pre-Batman Gotham City, has just started filming, and is expected to premiere this fall. "}, {"url": "https://en.wikipedia.org/wiki/Gotham_City", "passage_text": "Locations used as inspiration or filming locations for the urban portion of Gotham City in the live-action Batman films have included New York City, Los Angeles, Chicago, Pittsburgh, London, Tokyo, and Hong Kong. Gotham City's skyline, as it appears in the Batman (1989) movie. 1  Batman (1989), the look of Gotham was designed by production designer Anton Furst, who won an Oscar for his work on the film. 2  Tim Burton's sequel, Batman Returns (1992), filmed city scenes entirely on soundstages."}]