[{"url": "http://www.mbgnet.net/sets/rforest/where.htm", "passage_text": "Tropical rainforests are located near the equator. Fifty seven percent of all tropical rainforests are found in Latin America. One third of the world's tropical rainforests are in Brazil. Other tropical rainforests are located in Southeast Asia and the Pacific Islands (25% of the world's tropical rainforests) and West Africa (18%). Temperate rainforests are found along some coasts in temperate zones. The largest temperate rainforests are found on the Pacific coast of North America. "}, {"url": "http://www.cotf.edu/ete/modules/msese/earthsysflr/rforest.html", "passage_text": "Tropical Rainforest The tropical rainforest is a hot, moist biome found near Earth's equator. The world's largest tropical rainforests are in South America, Africa, and Southeast Asia. Tropical rainforests receive from 60 to 160 inches of precipitation that is fairly evenly distributed throughout the year."}, {"url": "http://ths.sps.lane.edu/biomes/rain3/rain3.html", "passage_text": "Animals of the Tropical Rainforest. Tropical Rainforest Vegetation. Location and Climate of the Tropical Rainforest. Tropical rainforests cover about 6% of the Earth's total land surface. They are mainly located around the belt at the equator. The climate of the rainforest is warm most of the year and has a lot of rain through most of the year. "}, {"url": "http://tropicalrainforestbiome.webnode.com/location-and-climate/", "passage_text": "Tropical rain forests are located closer to the equator then temperate rainforests (Rainforest Biome, par. 5). The Amazon hosts the world’s largest tropical rainforest. Twenty percent of plants and birds on Earth, and ten percent of mammal species can be discovered in the Amazon. "}, {"url": "https://en.wikipedia.org/wiki/Tropical_rainforest", "passage_text": "Most tropical rainforests are located around and near the equator, therefore having what is called an equatorial climate characterized by three major climatic parameters: temperature, rainfall, and dry season intensity. A tropical rainforest is a biome type that occurs roughly within the latitudes 28 degrees north or south of the equator (in the equatorial zone between the Tropic of Cancer and Tropic of Capricorn)."}, {"url": "http://www.bioexpedition.com/tropical-rainforest-biome/", "passage_text": "The location of the tropical rainforest is around the equator. They are primarily found within the Tropic of Capricorn and the Tropic of Cancer. You will find tropical rainforest biomes in Australia, the Southeast of Asia, the Southern portion if India, and South America. Tropical rainforest biomes are found in the lower latitudes. The temperature is generally around 80 degrees. There is very high humidity too – from 77% to 88%. There isn’t a big change in seasons like there are with many other biomes."}, {"url": "http://www.blueplanetbiomes.org/rainforest.htm", "passage_text": "F.A.O. Plants Animals Climate Southeast Asian Rainforests The tropical rain forest is a forest of tall trees in a region of year-round warmth. An average of 50 to 260 inches (125 to 660 cm.) of rain falls yearly. Rain forests belong to the tropical wet climate group. Climate. Southeast Asian Rainforests."}, {"url": "http://kids.nceas.ucsb.edu/biomes/rainforest.html", "passage_text": "Tropical rainforests can be found around the world: In Central and South America; in Western Africa, eastern Madagascar, and the Zaire basin; and in Indo-Malaysia along the west coast of India, Assam, Southeast Asia, New Guinea, and Queensland, Australia. Temperate rainforests are also wet, but not as rainy as tropical rainforests. It rains about from 60 - 200 inches (150 - 500 cm) each year, while the other moisture comes from the coastal fog that lingers on the trees. The fog provides about 7 - 12 inches (18 - 30°C) of rain each year."}, {"url": "http://kids.nceas.ucsb.edu/biomes/rainforest.html", "passage_text": "LOCATION: There are two types of rainforest biomes: temperate and tropical rainforests. Temperate rainforests are found along coasts in temperate regions. The largest temperate rainforests are on the Pacific coast in North America, stretching from Alaska to Oregon. Other temperate rainforests are found along the coast of Chile, the United Kingdom, Norway, Japan, New Zealand, and S. Australia. Temperate rainforests are also wet, but not as rainy as tropical rainforests. It rains about from 60 - 200 inches (150 - 500 cm) each year, while the other moisture comes from the coastal fog that lingers on the trees. The fog provides about 7 - 12 inches (18 - 30°C) of rain each year."}, {"url": "http://kids.mongabay.com/elementary/002.html", "passage_text": "Rainforests are found in the tropics, the region between the Tropic of Cancer and the Tropic of Capricorn, just above and below the Equator. In this tropic zone the sun is very strong and shines about the same amount of time every day all year long, keeping the climate warm and relatively stable. "}]