[{"url": "http://www.youtube.com/watch?v=7_zKkBKu1fs", "passage_text": "Cats purr for all kinds of reasons, including communication and healing themselves. Cristen explains how purring works and which cats can't do it. Whether the topic is popcorn or particle physics, you can count on the HowStuffWorks team to explore-and explain-the everyday science in the world around us on BrainStuff. "}, {"url": "http://animals.howstuffworks.com/pets/question394.htm", "passage_text": "Cats show happiness by purring. They may also purr when startled or upset. It turns out that cats have special wiring! The wiring travels from the brain to the muscles in the voice box, and this wiring is able to vibrate the muscles so that they act as a valve for air flowing past the voice box. And so it is with cats purring. We cannot purr, so we are interested in how cats can do it. It turns out that domestic cats, some wild cats like pumas and mountain lions (in general, any big cat that cannot roar) and even raccoons are all able to purr."}, {"url": "http://www.catster.com/lifestyle/cat-behavior-sounds-cats-make-what-they-mean-talking", "passage_text": "The purr. Cats purr when they’re content, but they also purr as a way to comfort themselves when they’re sick or injured. The auditory frequency of the purr, around 25 cycles per second, is thought to have healing properties, and it almost certainly acts as an internal massage. 2. Cats purr when they’re content, but they also purr as a way to comfort themselves when they’re sick or injured. The auditory frequency of the purr, around 25 cycles per second, is thought to have healing properties, and it almost certainly acts as an internal massage."}, {"url": "http://www.cat-health-guide.org/what-makes-cats-purr.html", "passage_text": "Probable reasons a cat purr's is to communicate with kittens, signal that a cat is content, a language between cats when another friendly cat approaches, and when danger exists. The sound itself is made when the vocal cords come together and then separate.. What makes cats purr is a bit of a mystery. While we think of cats purring when they are happy and relaxed, cats also purr when under stress, frightened, sick, or in pain. Female cats often purr when in labor. Cats have been known to purr while dying. It is believed that they may do so in an attempt to calm themselves."}, {"url": "http://www.loc.gov/rr/scitech/mysteries/catspurr.html", "passage_text": "What makes the purr distinctive from other cat vocalizations is that it is produced during the entire respiratory cycle (inhaling and exhaling). Other vocalizations such as the “meow” are limited to the expiration of the breath. Moreover, there is an absence of purring in a cat with laryngeal paralysis. The laryngeal muscles are responsible for the opening and closing of the glottis (space between the vocal chords), which results in a separation of the vocal chords, and thus the purr sound."}, {"url": "http://www.cat-health-guide.org/what-makes-cats-purr.html", "passage_text": "How Cats Purr. The purr a cat makes is part of the inhaling and exhaling of natural breathing (Meow sounds happen only during the exhale). It is caused by the opening and closing of the space between your cat's vocal cords (called the glottis). The laryngeal muscles cause the opening and closing action. While we think of cats purring when they are happy and relaxed, cats also purr when under stress, frightened, sick, or in pain. Female cats often purr when in labor. Cats have been known to purr while dying. It is believed that they may do so in an attempt to calm themselves."}, {"url": "https://en.wikipedia.org/wiki/Purr", "passage_text": "The mechanism by which cats purr is speculative. There is a unique “neural oscillator in the cat’s brain of uncertain significance. Cats often purr when distressed or in pain, such as in labour. This purring may trigger a cat's brain to release a hormone which helps it in relaxing and acts as a painkiller. Purring may also be a healing mechanism to offset long periods of rest and sleep that would otherwise contribute to a loss of bone density."}]