[{"url": "http://www.lungworm.co.uk/learn-about-lungworm/", "passage_text": "Other ways lungworm spreads. Infected dogs spread the parasite into the environment as the lungworm larvae is expelled in their poo, slugs and snails that come into contact with the poo will become infected, increasing the chances of other dogs becoming infected. The lungworm (Angiostrongylus vasorum) is not known to infect humans. However, dogs and cats can carry roundworms, which can cause diseases in people, so make sure you keep your pet’s parasite protection programme up-to-date. You can find out more about Roundworm at the It’s a jungle website."}, {"url": "https://www.vets-now.com/pet-owners/dog-care-advice/general/lungworm-in-dogs/", "passage_text": "Lungworm is a type of parasitic worm, called Angiostrongylus Vasorum, that can affect dogs. As an adult worm it lives in the heart and blood vessels that supply the lungs in dogs and foxes. The symptoms you may see in your dog are due to where the worm chooses to live its adult life. As a juvenile worm they complete their life cycles in slugs and snails. Lungworm is what we call an ‘emerging’ disease. This means that it is gradually becoming more common"}, {"url": "http://www.merckvetmanual.com/pethealth/dog_disorders_and_diseases/lung_and_airway_disorders_of_dogs/lungworm_infection_in_dogs.html", "passage_text": "Lungworm infection in dogs can be difficult to treat, but there is evidence that appropriate antiparasitic drugs are effective, particularly when combined with surgical removal of the nodules in the trachea. It may be necessary to continue antiparasitic treatment for up to 2 months. Diagnosis of lungworm infection is based on signs, known transmission patterns, and presence of larvae in feces. Examination of the airways with an endoscope (bronchoscopy) and x-rays can be helpful tools."}, {"url": "http://www.petplace.com/article/dogs/diseases-conditions-of-dogs/lungs-airways-chest/lungworms-in-dogs", "passage_text": "Overview of Canine Lungworms. Lungworms are a type of parasite that can infect the respiratory tract in dogs. There are several different parasites that have been identified including: Paragonimus kellicotti, Capillaria aerophilia, Filaroides and Osleri spp. "}, {"url": "http://www.merckvetmanual.com/pethealth/dog_disorders_and_diseases/lung_and_airway_disorders_of_dogs/lungworm_infection_in_dogs.html", "passage_text": "Infection is infrequent in dogs. Signs of lungworm infection range from moderate, dry coughing with slightly increased respiratory rates to severe, persistent coughing and respiratory distress or even failure. Infections with no visible signs can also occur. Diagnosis of lungworm infection is based on signs, known transmission patterns, and presence of larvae in feces. Examination of the airways with an endoscope (bronchoscopy) and x-rays can be helpful tools."}, {"url": "http://www.merckvetmanual.com/pethealth/dog_disorders_and_diseases/lung_and_airway_disorders_of_dogs/lungworm_infection_in_dogs.html", "passage_text": "Lungworm infections in dogs are usually caused by the parasitic nematode Oslerus osleri. They have been found in the United States, South Africa, New Zealand, India, Great Britain, France, and Australia. Diagnosis of lungworm infection is based on signs, known transmission patterns, and presence of larvae in feces. Examination of the airways with an endoscope (bronchoscopy) and x-rays can be helpful tools."}, {"url": "http://www.vetinfo.com/lungworm-in-dogs.html", "passage_text": "The lungworm infection in dogs affects the respiratory system and may be fatal. The infection is parasitic and may be caused by a number of worms such as Paragonimus kellicotti, Capillaria aerophilis, Osleri osleri or the Filaroides. The infection can be contracted from hosts that carry the parasites. "}, {"url": "http://www.thekennelclub.org.uk/health/pet-health-information/lungworm/", "passage_text": "Dogs of all ages and breeds are susceptible to lungworm, with playful, younger dogs (less than two years old), unsurprisingly, more prone to picking up the parasite. Dogs known to purposely eat slugs and snails are obviously considered higher risk. Unlike many diseases, however, lungworm is not actually passed directly from dog to dog. The worm needs slug and snail hosts in order to grow and develop, and it's from eating these that infection may occur, then by the dog passing larvae in its waste."}, {"url": "http://www.lungworm.co.uk/learn-about-lungworm/", "passage_text": "Slugs and snails carry the lungworm larvae, and dogs can become infected when they accidentally (or purposefully) eat these common garden pests whilst rummaging through undergrowth, eating grass, drinking from puddles or outdoor water bowls, or pick them up from their toys. The lungworm (Angiostrongylus vasorum) is not known to infect humans. However, dogs and cats can carry roundworms, which can cause diseases in people, so make sure you keep your pet’s parasite protection programme up-to-date. You can find out more about Roundworm at the It’s a jungle website."}]