[{"url": "https://www.titlemax.com/faqs/", "passage_text": "You can get a copy of your car or motorcycle title from your local DMV. To get detailed instructions on the process and to make sure you have everything you need to get a copy of your car or motorcycle title, click here !"}, {"url": "http://www.wikihow.com/Get-a-Replacement-Title-for-Your-Car", "passage_text": "1. Obtain the application needed to replace the car title. In most states, you can print a copy of the application directly from the website for your state's DMV; however, an application can also be obtained directly from any full service DMV office."}, {"url": "http://www.ehow.com/how_4728260_replacement-copy-car-title.html", "passage_text": "If you've misplaced or damaged your original car title, you can request a replacement title. The process for replacing a title is basically the same in every state. You'll need to complete a replacement title application and submit it to the appropriate state or local office."}, {"url": "http://www.realsimple.com/home-organizing/organizing/record-keeping/replace-store-important-documents/how-to-get-a-copy-your-car-title", "passage_text": "Why you need it: To sell your car. Where to get a new one: Your state’s Department of Motor Vehicles. (Go to dmv.org to find your state's website to download the form or bureau locations and hours.)."}, {"url": "http://www.realsimple.com/home-organizing/organizing/record-keeping/replace-store-important-documents/how-to-get-a-copy-your-car-title", "passage_text": "What you need to get it: A completed DMV application form and the application fee, which varies by state (Utah charges $6; Oregon, $55). You’ll also need to show ID and proof that you own the car, such as your vehicle registration or your license-plate number and VIN (vehicle identification number)."}, {"url": "http://auto.howstuffworks.com/buying-selling/how-to-get-copy-of-car-title.htm", "passage_text": "Without the car title, you can't sell your car and transfer ownership. You receive title of a car after you register it with the Department of Motor Vehicles (DMV). Contact your local Department of Motor Vehicles to find out what the requirements for getting a copy of a car title are in your state. Although the requirements vary from state to state, we'll take you through the general procedure. You can apply for a copy of your car title by mail, online, or in person. Here's how to apply by mail: 1  Complete an Application for Duplicate Title, which is available online at your state's Department of Motor Vehicles' Web site or from your local Department of Motor Vehicles office. 2  Photocopy your proof of identity."}]