[{"url": "http://www.innerbody.com/image_digeov/card10-new2.html", "passage_text": "Weighing in at around 3 pounds, the liver is the body’s second largest organ; only the skin is larger and heavier. The liver performs many essential functions related to digestion, metabolism, immunity, and the storage of nutrients within the body. These functions make the liver a vital organ without which the tissues of the body would quickly die from lack of energy and nutrients."}, {"url": "https://en.wikipedia.org/wiki/Human_body", "passage_text": "The study of the human body involves anatomy and physiology. The human body can show anatomical non-pathological anomalies known as variations which need to be able to be recognised. Physiology focuses on the systems and their organs of the human body and their functions. The human body includes the entire structure of a human being and comprises a head, neck, trunk (which includes the thorax and abdomen), arms and hands, legs and feet. Every part of the body is composed of various types of cells, the fundamental unit of life."}, {"url": "http://www.livescience.com/37009-human-body.html", "passage_text": "Vital organs. Humans have five vital organs that are essential for survival. These are the brain, heart, kidneys, liver, and lungs. The human brain is the body's control center, receiving and sending signals to other organs through the nervous system and through secreted hormones. These hormones, in turn, travel to different tissues and regulate various bodily functions, such as metabolism, growth and sexual function. The immune system is the body's defense against bacteria, viruses and other pathogens that may be harmful."}, {"url": "http://www.the-human-body.net/systems.html", "passage_text": "The organ systems of the body include the musculoskeletal system, circulatory system, digestive system, endocrine system, integumentary system, urinary system, lymphatic system, immune system, respiratory system, nervous system and reproductive system. Organs: In biology and anatomy, an organ is a tissue that performs a specific function or group of functions within an organism.. more ». Systems: The organ systems of the body include the musculoskeletal system, nervous system, digestive system... more »."}, {"url": "http://www.bbc.co.uk/science/humanbody/body/factfiles/liver/liver.shtml", "passage_text": "Function: To get rid of toxins, to regulate your blood sugar levels and to produce bile. Largest internal organ. Your liver is your largest internal organ. A big blood vessel, called the portal vein, carries nutrient-rich blood from your small intestine directly to your liver. Chemical processing factory. Hepatic cells make up about 60 percent of your liver tissue."}, {"url": "http://www.innerbody.com/image_digeov/card10-new2.html", "passage_text": "The liver functions as an organ of the immune system through the function of the Kupffer cells that line the sinusoids. Kupffer cells are a type of fixed macrophage that form part of the mononuclear phagocyte system along with macrophages in the spleen and lymph nodes. The liver performs many essential functions related to digestion, metabolism, immunity, and the storage of nutrients within the body. These functions make the liver a vital organ without which the tissues of the body would quickly die from lack of energy and nutrients."}, {"url": "http://sinoemedicalassociation.org/AP2/Liver%20Function%20Essay.pdf", "passage_text": "Diseases of the Liver Because the liver performs a wide variety of function, it also acts as a filtration system for toxic materials which can damage the body. Certain toxins are excessively negative to the liver, as a result causing liver damage or diseases, Such as, Hemochromatosis. The liver is one of the most important organ in the body, because it places many roles in the metabolic and regulation of the body. It is an accessory organs associate with the small intestine in the function of digestion. The liver is located on the right side of the abdominal cavity beneath the diaphragm."}, {"url": "https://en.wikipedia.org/wiki/Liver", "passage_text": "The liver is a gland and plays a major role in metabolism with numerous functions in the human body, including regulation of glycogen storage, decomposition of red blood cells, plasma protein synthesis, hormone production, and detoxification. The liver is a reddish brown wedge-shaped organ with four lobes of unequal size and shape. A human liver normally weighs 1.44–1.66 kg (3.2–3.7 lb). It is both the largest internal organ and the largest gland in the human body. Located in the right upper quadrant of the abdominal cavity, it rests just below the diaphragm, to the right of the stomach and overlying the gallbladder"}]