[{"url": "https://www.howtobecomeapediatrician.com/", "passage_text": "The first step in understanding how to become a pediatrician is accepting that this career choice will involve many years of schooling. The first level of schooling for a pediatrician, after graduation of high school, includes pursuing a four-year degree, also known as a bachelor s degree, at an accredited university. During these four years, there will be key classes that a person needs to take in preparation for medical school, including many higher-level science courses, as well as biochemistry classes required for all pre-med students."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_earn_a_degree_in_Pediatrics", "passage_text": "The Juris Doctor (J.D.) degree takes 3 years on a full-time program. Some schools offer part-time programs which take 4 years. It is typically 80 to 90 credits, which, if you … do the math, comes to 15 credits per semester for 90 credits, which is a pretty full load. My law school required 86 credits. Well an associates degree is a two year degree while a bachelors is four. Not all major will transfer from an associates to a bachelors. For example you can get an assoc … iates in nursing and go on later to get your bachelors and it only be about two more years."}, {"url": "http://www.howlongdoes.com/life/how-long-does-it-take-to-become-a-pediatrician/", "passage_text": "If you want to know how long does it take to become a pediatrician, just sum up all the years you are in school. This is simply 4 years undergraduate plus 4 years in medical school plus 3 years in residency and specialization, which equals 11 long years of hard but rewarding work. 1  Email. It is very basic that before you can go to medical school, you have to pass through two stages of schooling. You have to finish high school then get accepted to a university to obtain your bachelors degree."}, {"url": "http://learn.org/articles/What_Type_of_Degree_Does_a_Pediatrician_Need.html", "passage_text": "Earn a Medical Degree. After earning an undergraduate degree, you'll need to attend medical school, which generally takes four years to complete. You can enroll in a program that confers a Doctor of Medicine (M.D.) or Doctor of Osteopathic Medicine (D.O.). If you want to become a pediatrician, you will need to complete several years of both undergraduate and graduate schooling and then complete a residency in pediatrics. After earning an undergraduate degree, you'll need to attend medical school, which generally takes four years to complete."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_get_your_degree_for_a_pediatrician", "passage_text": "Generally it takes full time graduate students 2-3 years to earn a master's degree and 4-5 years to earn a PhD. This is assuming they go for the same subject that they hold an … undergrad degree in. If the subject is different, it may take longer because there may be extra prequisite requirements. Usually, the person needs a Bachelo … r's degree in something. Then it is 4 years of medical school after you are accepted. After medical school there is around 1 year of internship and 2 years of residency. Sometimes it changes."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_get_your_degree_for_a_pediatrician", "passage_text": "After graduating from high school, a student that wants to become a Pediatrician must finish: • four years of college • four years of medical school • one ye … ar of a Pediatrics internship • two years of a Pediatrics residency So that adds up to about 11 years of school and training to become a Pediatrician. Usually, the person needs a Bachelo … r's degree in something. Then it is 4 years of medical school after you are accepted. After medical school there is around 1 year of internship and 2 years of residency. Sometimes it changes."}, {"url": "http://www.wikiprofessional.org/Pediatrician", "passage_text": "It takes 4 years of undergraduate education, 4 years of medical school, and 3 years of pediatric residency to become a general pediatrician, totaling at least 11 years. Further, most fellowship subspecialties last 3 years, increasing the time spent in training to about 14 years overall. "}, {"url": "http://www.degreequery.com/what-college-degree-is-needed-to-be-a-pediatrician/", "passage_text": "After graduating, students will need to apply to medical school. This graduate program can take between four to five years for a pediatrician depending on the schedule of classes. The final year or two of school is spent as an intern. After graduating from medical scchool, aspiring pediatricians will spend about three years as a resident at a teaching hospital or large clinic. "}, {"url": "http://www.yourpediatrician.com/BecomingAPed.htm", "passage_text": "Education General-As a Pediatrician, you will ALWAYS be learning! After high school, you need 4 years of undergraduate courses at a college or university (which will get you a BS, BA, or other Bachelor's degree). After completing college, you will need to attend 4 years of Medical School (which will get you an MD or DO degree). After this, you are a general doctor. Most of the time, these new doctors go on to learn a specialty in medicine, such as pediatrics. This is the ultimate goal of a pediatrician's training. Bottom line: 4 years college + 4 years medical school + 3 years of residency = 11 years (after high school). Return to Top High School-this is where it really begins."}]