[{"url": "https://www.reddit.com/r/orlando/comments/1ph4hh/how_long_did_it_take_you_to_get_your_red_light/", "passage_text": "I takes at most two weeks. If you want to fight it just don't pay it and in about a month or so after you will get an actually ticket in the mail. Return that selecting that you want to contest it and they will send you a court date like 2 months down the road. When they mail you a ticket, it will be closer to $400 and come with points on your license. Under new Florida laws, you will also be responsible for extra court costs if you lose the case (around $250 extra). Also, if you're going to claim that you weren't behind the wheel, you have to swear to that in court."}, {"url": "http://einhorninsurance.com/california-insurance/traffic-ticket-california/", "passage_text": "At this point, I received ZERO mail about this violation and still didn’t know the fine amount. I asked this person if I was supposed to get some information about the ticket in the mail…she sort of shrugged with a non-answer. Finally, she told me it was $290 for the ticket + the DMV fee for traffic school. I thought about going to see the judge and asking the judge to lower my fine because of my stellar driving record. I haven’t had a ticket in over 12 years. Going into the courtroom is a roll of the dice."}, {"url": "https://www.reddit.com/r/orlando/comments/1ph4hh/how_long_did_it_take_you_to_get_your_red_light/", "passage_text": "The red light citation is $158 with no points. When they mail you a ticket, it will be closer to $400 and come with points on your license. Under new Florida laws, you will also be responsible for extra court costs if you lose the case (around $250 extra). Also, if you're going to claim that you weren't behind the wheel, you have to swear to that in court."}, {"url": "http://einhorninsurance.com/california-insurance/traffic-ticket-california/", "passage_text": "As long as you haven’t been to traffic school in the last 18 months and your moving violation is not a Major Violation (DUI, DWI, suspended license, etc.), you are eligible for traffic school. I was eligible for traffic school and would do everything in my power to avoid a point on my driving record. Finally, she told me it was $290 for the ticket + the DMV fee for traffic school. I thought about going to see the judge and asking the judge to lower my fine because of my stellar driving record. I haven’t had a ticket in over 12 years. Going into the courtroom is a roll of the dice."}, {"url": "http://www.sanmateocourt.org/court_divisions/traffic/options.php", "passage_text": "1 You can request traffic school by mail, online through this website, or at the traffic clerk's office. 2  The court branch pertaining to your case is at the bottom of the citation/ticket and on your Notice of Bail. Please WAIT until you receive a Notice of Bail (Courtesy Notice) from the Court. If you do not receive your notice a week prior to your court date (noted on the bottom of your citation/ticket), please call the Traffic Division and ask them to check in the system to see if your citation/ticket has been received."}, {"url": "http://www.nh.gov/safety/divisions/dmv/financial-responsibility/ticket-payment.htm", "passage_text": "Methods to respond to a traffic complaint/citation within thirty (30) days from the date of issuance: 1  Online * Plea of Nolo Contendre or Guilty only. 2  Telephone at (800) 272-0036. 3  MasterCard and VISA credit card payments only. * 4 Plea of Nolo Contendre or Guilty only. 5  Via the mail or in person. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090404213332AAXUrY2", "passage_text": "Update 2: if you go to the court date you cant go to traffic school, and it will be on your record, since this is my first ticket. Thats what the cop said at least, and all my friends who have gotten tickets have gotten theirs within the first week, only reason why I'm asking. Next. I got basically one of the stupidest tickets ever for going 6 miles over the speed limit (while someone next to me was probably going about 90)...the cop said it would come in the mail in 1-2 weeks. Well its been almost 5 weeks and STILL hasn't come, I've set money aside to pay the ticket (which is..."}, {"url": "http://www.sdcourt.ca.gov/pls/portal/url/page/sdcourt/TRAFFIC3", "passage_text": "1 If you are cited for a traffic violation or minor offense, the court may mail you a Courtesy Notice at the address listed on the ticket. 2  You may receive the Courtesy Notice about two weeks before your promise to appear date (appearance date), which is shown below your signature on the ticket. "}, {"url": "http://einhorninsurance.com/california-insurance/traffic-ticket-california/", "passage_text": "I now have 2 months to take traffic school and mail the certificate to the DMV to erase my point. Oh, and by the way, you have to pay a separate fee to the traffic school. I was glad my Traffic Court experience was over. Now, the traffic school class was hanging over my head. Finally, she told me it was $290 for the ticket + the DMV fee for traffic school. I thought about going to see the judge and asking the judge to lower my fine because of my stellar driving record. I haven’t had a ticket in over 12 years. Going into the courtroom is a roll of the dice."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_get_a_traffic_ticket_in_the_mail_in_California", "passage_text": "Making the world better, one answer at a time. Sometimes a traffic ticket will be mailed to a person instead of written by an officer. Depending on the county it can take a week or two for a person to get a traffic ticket in the mail. In Queensland Australia it ranges anywhere from 1 to 2 weeks depending on when you get the ticket. I think i got done for speeding last night, ho … pping to not get any extra mail over the next week or two lol :P well don't speed that's my advice."}]