[{"url": "http://www.hireteen.com/retail-stores/cvs/", "passage_text": "Jobs for 18 and 19 years old teenagers at CVS, the largest retail pharmacy chains, with over 7,000 stores across 41 states. About CVS. CVS/pharmacy offers a number of non-management career opportunities at more than 7,000 CVS/pharmacy locations around the U.S. Positions range from part-to full-time."}, {"url": "http://jobapplicationcenter.com/retail-industry-job-applications/drug-store-job-applications/cvs-application/", "passage_text": "Minimum Age for Employment at CVS. Interested applicants who wish to submit a CVS application for employment are required to be at least 16 years of age or above. Interested applicants who are below the age of 16 are discouraged from submitting a CVS application for employment."}, {"url": "http://www.startwire.com/job-applications/retail/cvs", "passage_text": "Age requirements. You must be at least 16 years old to work in a CVS store. However, some positions have different age requirements (you need to be 18 to work in the pharmacy, for example). Jobs available at CVS. In their stores, CVS is always hiring cashiers, photo technicians, pharmacy technicians, pharmacists, supervisors, and managers. Use StartWire to find the available jobs in your area. Search jobs."}, {"url": "https://answers.yahoo.com/question/index?qid=20080813110837AAx65qf", "passage_text": "Walgreens hires at 16 so I think CVS would as well. You just can't work in photo, you have to be 18, or the liquor store, you have to be 21. You can still sell cigarettes even though you aren't 18. Source(s): Worked at Walgreens 7 1/2 years. "}, {"url": "http://www.howoldtowork.net/cvs/", "passage_text": "Pharmacy candidates may spend as much as two or three months going through formal review. The minimum hiring age for pharmacy positions sits at 18, with additional education, work, and personality qualifications necessary for employment. Usually at 16 Years Old. The typical response for applicants inquiring about the minimum age of CVS hires for entry-level staff falls at 16. The drug store chain generally imposes no formal qualifications for entry-level positions like cashier, sales associate, or beauty care associate"}, {"url": "http://www.ejobapplications.com/cvs-application/", "passage_text": "Minimum Employment Age. In order to work for CVS you must be 16 years of age or older. Some positions require the applicant to be 18 years of age or older. Anyone submitting a form under the age of 16 will be rejected without further review. Each position must have a separate form filled out for it and some positions may require the applicant to submit their resume, in addition to a cover letter"}, {"url": "https://answers.yahoo.com/question/index?qid=20090406195508AAgtGyk", "passage_text": "Answers. Relevance. Rating Newest Oldest. Best Answer: 16 is the age in most places to be allowed to work, however in many stores especially in CT you must be 18 in order to work there because the stores sometimes sell cigarettes and alcohol related items, which you must be 18 in order to handle. Source(s): Former CVS employee. CK · 7 years ago. Thumbs up"}, {"url": "http://www.howoldtowork.net/cvs/", "passage_text": "The list of positions CVS does hire for at age 16 include cashier, sales associate, and beauty care associate. Cashier jobs involve performing front-end duties, like greeting customers, processing transactions, cleaning work stations, and restocking point-of-sale shelves. Usually at 16 Years Old. The typical response for applicants inquiring about the minimum age of CVS hires for entry-level staff falls at 16. The drug store chain generally imposes no formal qualifications for entry-level positions like cashier, sales associate, or beauty care associate"}, {"url": "http://www.answers.com/Q/At_what_age_does_CVS_hire", "passage_text": "Making the world better, one answer at a time. Most companies, including CVS hire people at the age of 16. You will be able to get a part time job and work while you are still in school. "}]