[{"url": "http://bishoptonrugby.com/", "passage_text": "Bishopton Rugby club was formed in 1994 and is based in the centre of the village of Bishopton in Renfrewshire, Scotland."}, {"url": "http://search.savills.com/list/property-for-sale/scotland/renfrewshire/bishopton/pa7", "passage_text": "31 properties for sale within 16.1 km of Bishopton. Craigallian Estate By Milngavie, Glasgow, G62 8EN Offers Over £2,950,000 (£2,950,000) A country estate with Victorian mansion 6 reception rooms Conservatory 340 Acres 21745 Sq.Feet (2020.18 Sq.Metres). 1  A country estate with Victorian mansion."}, {"url": "http://www.topix.com/uk/bishopton", "passage_text": "Bishopton, Scotland Photos. 39 articles 1. Iraq 37 min ago | CBS U.S. soldier killed during rescue mission in Iraq 95 articles 2. Hillary Clinton 43 min ago | USA Today Hillary Clinton's hands do the talking at Benghazi hearing 133 articles 3."}, {"url": "http://ingliston.com/", "passage_text": "Welcome to Ingliston Country Club five star luxury in stunning surroundings. five star luxury in stunning surroundings. Nestled within the rolling hills of the glorious Renfrewshire countryside, Ingliston Country Club is a unique, family-run country club with something for the whole family to enjoy."}, {"url": "http://wikimapia.org/2362731/Bishopton", "passage_text": "The Brisbane family once lived in Bishopton House, and moved to Largs, in Ayrshire, in the 1700's. Their son, Thomas Makdougall Brisbane was born in 1773, and after a successful career, became Governor of the colony of New South Wales in Australia."}, {"url": "http://www.topix.com/uk/bishopton", "passage_text": "Local news for Bishopton, Scotland continually updated from thousands of sources on the web."}, {"url": "http://www.maplandia.com/united-kingdom/scotland/scotland/renfrewshire/bishopton/", "passage_text": "detailed map of Bishopton and near places. Welcome to the Bishopton google satellite map! This place is situated in Renfrewshire, Scotland, Scotland, United Kingdom, its geographical coordinates are 55° 54' 0 North, 4° 30' 0 West and its original name (with diacritics) is Bishopton. See Bishopton photos and images from satellite below, explore the aerial photographs of Bishopton in United Kingdom."}]