[{"url": "http://www.angiologist.com/arterial-disease/iliac-artery-aneurysm/", "passage_text": "Iliac artery aneurysms are more common in conjunction with an aortic aneurysm. As many as 50% of abdominal aortic aneurysms are associated with an iliac artery aneurysm. An isolated iliac artery aneurysm is usually asymptomatic. That is why isolated aneurysms are often discovered incidentally."}, {"url": "http://www.wisegeekhealth.com/what-is-an-iliac-aneurysm.htm", "passage_text": "High blood pressure may cause aneurysms. Surgery may be required to treat an iliac aneurysm. A CT scan may be performed to diagnose an iliac aneurysm. The greatest danger of an undetected iliac aneurysm is that it will burst. A diagram of the aorta, including the iliac arteries."}, {"url": "http://pubs.rsna.org/doi/full/10.1148/rg.25si055517", "passage_text": "Proximal and distal embolization of an aneurysm of the left internal iliac artery in an 80-year-old man. (a) Preembolization angiogram shows an aneurysm of the left internal iliac artery and dilatation of the left common iliac artery."}, {"url": "http://radiopaedia.org/articles/iliac-artery-aneurysm-1", "passage_text": "Classification of isolated iliac arterial aneurysms 1. Isolated iliac artery aneurysms (IIAs) are classified according to their anatomy. The proximal non-aneurysmal artery is defined as the proximal neck or landing zone and distal non-aneurysmal artery is defined as the distal landing zone."}, {"url": "http://www.wisegeekhealth.com/what-is-an-iliac-aneurysm.htm", "passage_text": "An aneurysm is a bulge in a blood vessel that is caused by an underlying weakness or disease of the vessel. The three iliac arteries are located in the area of the abdomen and pelvis."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC101075/", "passage_text": "Abstract. Isolated iliac artery aneurysms are rare lesions that are difficult to detect and treat. Prompt diagnosis and timely intervention are essential, because the incidence of rupture is as high as 50%."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC101075/", "passage_text": "Rupture of iliac artery aneurysms is reported to carry a 50% to 70% mortality rate, and because the incidence of rupture is as high as 50%, it is imperative that diagnosis be early and intervention prompt."}, {"url": "http://www.uptodate.com/contents/iliac-artery-aneurysm", "passage_text": "INTRODUCTION. Aneurysmal degeneration of the iliac arteries (common, internal, external iliac) can occur in isolation, or in association with other large vessel aneurysms (eg, abdominal aorta, femoral artery). Iliac artery aneurysms (IAAs) are often diagnosed as a result of screening or other imaging studies."}]