[{"url": "http://www.imdb.com/name/nm0141745/bio", "passage_text": "Mini Bio (1). June Carter Cash was born on June 23, 1929 in Maces Springs, Scott County, Virginia, USA as Valerie June Carter. She was married to Johnny Cash, Edwin Lee (Rip) Nix and Carl Smith. She died on May 15, 2003 in Nashville, Tennessee, USA. John Carter Cash, born in 1970, was the product from her marriage to singer Johnny Cash. Elvis Presley introduced June to the music of Johnny Cash in the mid-50s and she began working with Johnny after a chance meeting at the Grand Ol' Opry a few years later."}, {"url": "http://www.last.fm/music/June+Carter+Cash", "passage_text": "read more. June Carter Cash (June 23, 1929 – May 15, 2003), born Valerie June Carter, was a singer, songwriter, actress, a member of the first family of country music, the Carter Family, and the second wife of singer Johnny Cash. She played the guitar, banjo, and autoharp. "}, {"url": "http://www.notablebiographies.com/supp/Supplement-Ca-Fi/Cash-June-Carter.html", "passage_text": "A Member of the Legendary Carter Family. Born Valerie June Carter on June 23, 1929, in Maces Spring, Virginia, she was raised in the Clinch Mountain area by her father Ezra Carter and mother, the former Maybelle Addington. June Carter Cash Biography. Born into country music royalty, American singer and songwriter June Carter Cash (1929–2003) enjoyed several claims to fame. The niece of A. P. Carter, she was the daughter of Mother Maybelle, both founders of the seminal folk and country group the"}, {"url": "https://simple.wikipedia.org/wiki/June_Carter_Cash", "passage_text": "June Carter Cash was born Valerie June Carter in Maces Spring, Virginia, to Maybelle Carter and Ezra Carter. She was born into country music and performed with the Carter Family from the age of ten, beginning in 1939. Valerie June Carter Cash (June 23, 1929 - May 15, 2003) was an American singer, actress, and dancer. She was the second wife of singer Johnny Cash. She and Johnny had many hit records in their careers."}, {"url": "https://en.wikipedia.org/wiki/June_Carter_Cash", "passage_text": "June Carter Cash was born Valerie June Carter in Maces Spring, Virginia, to Maybelle Carter and Ezra Carter. She was born into country music and performed with the Carter Family from the age of ten, beginning in 1939. Valerie June Carter Cash (June 23, 1929 – May 15, 2003) was an American singer, dancer, songwriter, actress, comedian, and author who was a member of the Carter Family and the second wife of singer Johnny Cash."}, {"url": "https://itunes.apple.com/us/artist/june-carter-cash/id1210344", "passage_text": "Biography. Songwriter, singer, actress, comedienne, and matriarch of country music June Carter Cash was born Valerie June Carter in Maces Springs, VA, on June 23, 1929. Open iTunes to buy and download music"}, {"url": "http://www.cmt.com/artists/june-carter-cash/biography/", "passage_text": "Country. Songwriter, singer, actress, comedienne, and matriarch of country music June Carter Cash was born Valerie June Carter in Maces Springs, VA, on June 23, 1929. "}, {"url": "http://www.cmt.com/artists/june-carter-cash/", "passage_text": "Songwriter, singer, actress, comedienne, and matriarch of country music June Carter Cash was born Valerie June Carter in Maces Springs, VA, on June 23, 1929. "}, {"url": "http://www.biography.com/people/june-carter-cash-16257320", "passage_text": "Musical Background. Singer-songwriter June Carter Cash was born Valerie June Carter on June 23, 1929, in Maces Springs, Virginia. The daughter of Ezra Carter and Mother Maybelle Carter, June was a born into the first family of country music"}]