[{"url": "http://www.angloitalianfollowus.com/what-is-couchsurfing", "passage_text": "You’re right, it is. Couchsurfing is about couches, but it can be and is so much more. For instance, say you’re staying in a hostel. You spend your day walking around your chosen destination on your own, or your partner, or a new friend from the hostel, whatever."}, {"url": "http://indietravelpodcast.com/travel/how-to-couchsurfing/", "passage_text": "Apart from your fine self, your profile is the most important part of your couchsurfing life. In addition to the normal essentials, like name and location, there’s several fields in the couchsurfing profile that allow you to showcase a bit about who you are. How to couchsurf. For travellers, couchsurfing is as simple as creating a profile on Couchsurfing.org and then looking for a suitable person to stay with or meet. However, your chances of finding a good host are improved by creating a good profile. People wanting to host travellers also need to fill out a profile."}, {"url": "https://support.couchsurfing.org/hc/en-us/articles/200639120-Is-Couchsurfing-safe-", "passage_text": "The vast majority of Couchsurfing experiences are not only safe, but outright life changing. Taking responsibility for your personal safety when traveling is important. And it's just as important when you're using Couchsurfing. We take your safety seriously. So should you. Members are asked to fill out a detailed profile page in order to display who they are, how they think and what their life is like."}, {"url": "http://www.couchsurfing.com/about/about-us/", "passage_text": "Learn about a new culture first-hand or practice a language. Make the world a little smaller; a little friendlier. Read About Our Values. Couchsurfing is a global community of 10 million people in more than 200,000 cities who share their life, their world, their journey. Couchsurfing connects travelers with a global network of people willing to share in profound and meaningful ways, making travel a truly social experience. "}, {"url": "http://goasia.about.com/od/wheretostay/qt/What-is-Couch-Surfing.htm", "passage_text": "While the term couch surfing loosely refers simply to staying with hosts while you travel, most people associate the concept with couchsurfing.com -- a social site to help budget travelers meet hosts in different countries. The idea behind couch surfing is to leverage the hospitality of friendly people around the world who open their homes to travelers -- an act of kindness that dates back millenia. Couch surfing is a remarkable way to travel for cheap, and travelers of all budgets take advantage."}, {"url": "https://en.wikipedia.org/wiki/CouchSurfing", "passage_text": "Couchsurfing International Inc. is a hospitality exchange and social networking website. The website provides a platform for members to surf on couches by staying as a guest at a host's home, host travelers, or join an event. Couchsurfing International Inc refers to two separate legal entities. The first was founded in 2003 as a non-profit organization, and was liquidated in 2011. In August 2011, Couchsurfing announced its change of status to a for-profit corporation"}, {"url": "http://goasia.about.com/od/wheretostay/qt/What-is-Couch-Surfing.htm", "passage_text": "A social and travel phenomenon, people have been asking what is couch surfing? for nearly a decade. The idea behind couch surfing is to leverage the hospitality of friendly people around the world who open their homes to travelers -- an act of kindness that dates back millenia. Couch surfing is a remarkable way to travel for cheap, and travelers of all budgets take advantage."}, {"url": "https://en.wikipedia.org/wiki/CouchSurfing", "passage_text": "Couchsurfing International, Inc is a privately owned for-profit corporation, incorporated in 2011 in the State of Delaware by Casey Fenton and Dan Hoffer. In contrast to some published statements, Couchsurfing is not a Benefit Corporation. In August 2011, Couchsurfing announced its change of status to a for-profit corporation. Couchsurfing International Inc refers to two separate legal entities. The first was founded in 2003 as a non-profit organization, and was liquidated in 2011."}, {"url": "http://www.solitarywanderer.com/2011/06/couchsurfing-project/", "passage_text": "Join Couchsurfing, and you get to stay anywhere in the world for free! Of course, it’s not just the free accommodation which makes it attractive; it’s also the opportunity to interact with locals in their own milieu. Again, what makes CS all the more memorable is not just the free accommodation (although it is a HUGE savings for a budget traveler like me), but more importantly, the opportunity to chat and interact with the locals in the area."}]