[{"url": "http://www.ancient-symbols.com/native_american_symbols.html", "passage_text": "The man in the maze symbol is also utilized by Hopi silversmiths as a way to showcase their high quality & technique. Arrow-Here are the different meanings that the arrow symbol can have in native american art. Arrowhead-Alertness. Arrow Pointing Right-Protection."}, {"url": "http://www.sunsigns.org/hopi-symbols/", "passage_text": "Hopi Spiral Symbol. The Hopi spiral meaning also fits in with the theme of journeying along the right path through life. This Hopi symbolic meaning represents the lengthy treks and journeys that a tribe has made – thus, it is not completely unique to the Hopi people."}, {"url": "http://www.houseofdubhros.com/library/symbols/symbol.php?id=30", "passage_text": "The Spiral Hand is a symbol that appears on pictographs and cave paintings throughout the southwest. Because of the hand design it is sometimes confused with the Hamsa, however the spiral has never appeared in this manner on any of the traditional Hamsa charms from the Middle East."}, {"url": "http://www.spiritualmindpower.com/files/Gary_Swastika_Srilalitha.org.htm", "passage_text": "s Nazi regime, this Anasazi (or ancient Hopi) symbol once conveyed a sacred rather than a malevolent meaning. Specifically, it represented the center of ancestral Hopi land. Author Frank Waters explains the swastika in terms of the tribe s prehistoric migrations."}, {"url": "http://www.ancestral.com/cultures/north_america/hopi.html", "passage_text": "The Hopi live near the Navajo, but are a totally unrelated people. The name Hopi comes from Hopituh Shi-nu-mu meaning The Peaceful People or Peaceful Little Ones&quot. They have lived in the southwest for thousands of years."}, {"url": "http://www.ancient-symbols.com/native_american_symbols.html", "passage_text": "- This is an important symbol of the Hopi people and many other Native American tribes. The Maze represents the maze of life, that is, the obstacles and challenges that one has to overcome to evolve spiritually and become one with the divine power."}, {"url": "http://beyondthemystery.forumotion.com/t535-hopi-symbols", "passage_text": "Art is a way of life for the Hopi; it expresses their visions, beliefs and dreams to themselves and others. As artisans, they incorporated their Hopi symbols into an array of dazzlingly beautiful baskets, weavings, and pottery. Hopi are also the crafters of kachina dolls and costumes."}, {"url": "http://beyondthemystery.forumotion.com/t535-hopi-symbols", "passage_text": "Hopi symbols are central to their diverse culture. Hopitu-shinumu (Hopi) means Peaceful People; this serves as a background to understanding their use of symbols. The Hopi are expert craftspeople, and possess uncommon agricultural skills."}, {"url": "http://www.sunsigns.org/hopi-symbols/", "passage_text": "Introduction To Hopi Symbols. The Hopi, meaning “peaceful people”, is a desert tribe from the lands forming the central point of Utah, Arizona, New Mexico, and Colorado."}, {"url": "http://www.sunsigns.org/hopi-symbols/", "passage_text": "These Hopi symbols of values are often depicted through Hopi artistry, which is a very sacred aspect of their culture for them. Hopi express their history, beliefs, dreams and visions through their works of art, baskets, weavings, and pottery."}]