[{"url": "http://www.umich.edu/~eng217/student_projects/nkazmers/prohibition1.html", "passage_text": "A few years after the U.S. began its involvement in World War I, the Amendment passed. In the Senate the Amendment passed after only 13 hours of debate, and in the House it passed after only one day (Allsop, 28). A cartoon criticizing Chicago politicians for their corruption (Kerr). A stamp commemorating the Prohibition Era (Citation). The rise was likely caused by the proliferation of illegal (bootlegged) alcohol. Bootlegging, interestingly, began before Prohibition, and actually continued after it, as a means of bypassing high taxes on alcohol."}, {"url": "http://www.umich.edu/~eng217/student_projects/nkazmers/prohibition1.html", "passage_text": "The illegalization of alcohol (consumption and manufacture) was passed into law at a national level in 1919 and enacted in 1920. Often historians regard Prohibition as the culmination, perhaps the over-extension, of the efforts at social change which thrived during the era. The rise was likely caused by the proliferation of illegal (bootlegged) alcohol. Bootlegging, interestingly, began before Prohibition, and actually continued after it, as a means of bypassing high taxes on alcohol."}, {"url": "http://www.pbs.org/kenburns/prohibition/unintended-consequences/", "passage_text": "With Prohibition in effect, that revenue was immediately lost. At the national level, Prohibition cost the federal government a total of $11 billion in lost tax revenue, while costing over $300 million to enforce. The greatest unintended consequence of Prohibition however, was the plainest to see. For over a decade, the law that was meant to foster temperance instead fostered intemperance and excess. The solution the United States had devised to address the problem of alcohol abuse had instead made the problem even worse."}, {"url": "http://www.pbs.org/kenburns/prohibition/unintended-consequences/", "passage_text": "When Maine passed a strict prohibition law in 1851, the result was not temperance, but resentment among the city's working class and Irish immigrant population. A deadly riot in Portland in 1855 lead to the law's repeal. The greatest unintended consequence of Prohibition however, was the plainest to see. For over a decade, the law that was meant to foster temperance instead fostered intemperance and excess. The solution the United States had devised to address the problem of alcohol abuse had instead made the problem even worse."}, {"url": "http://www.history.com/this-day-in-history/prohibition-ends", "passage_text": "In 1933, the 21st Amendment to the Constitution was passed and ratified, ending national Prohibition. After the repeal of the 18th Amendment, some states continued Prohibition by maintaining statewide temperance laws. "}, {"url": "http://www.pbs.org/kenburns/prohibition/unintended-consequences/", "passage_text": "When the Prohibition era in the United States began on January 19, 1920, a few sage observers predicted it would not go well. Certainly, previous attempts to outlaw the use of alcohol in American history had fared poorly. The greatest unintended consequence of Prohibition however, was the plainest to see. For over a decade, the law that was meant to foster temperance instead fostered intemperance and excess. The solution the United States had devised to address the problem of alcohol abuse had instead made the problem even worse."}, {"url": "http://www.historyrocket.com/American-History/timeline/1900-1949/prohibition/Economic-Impact-Of-Prohibition.html", "passage_text": "The economic impact of prohibition was immense as the US government was unable to collect taxes from an industry that generated billions of dollars in revenue. The main of prohibition was to prevent people from drinking and thereby bringing down the rates of crime, death, and poverty in the country. However, when the 18th amendment was implemented, instead of having a positive effect on the society and country, the opposite occurred."}, {"url": "https://en.wikipedia.org/wiki/Prohibition_in_Canada", "passage_text": "Alberta and Ontario passed prohibition laws in 1916. Quebec implemented prohibition in 1919 but it was quickly repealed after intense public pressure. In the 1903 provincial election in Manitoba, four candidates ran as prohibitionists; none were successful, although one came within twenty votes of winning. "}, {"url": "http://www.pbs.org/kenburns/prohibition/unintended-consequences/", "passage_text": "One of the most profound effects of Prohibition was on government tax revenues. Before Prohibition, many states relied heavily on excise taxes in liquor sales to fund their budgets. In New York, almost 75% of the state's revenue was derived from liquor taxes. The greatest unintended consequence of Prohibition however, was the plainest to see. For over a decade, the law that was meant to foster temperance instead fostered intemperance and excess. The solution the United States had devised to address the problem of alcohol abuse had instead made the problem even worse."}]