[{"url": "http://www.bioexpedition.com/how-long-do-sharks-live/", "passage_text": "Sandbar sharks or Brown sharks are thought to live between 20 and 30 years. Investigation made by Joung (2004) found to be about 20 years of age. While, Sminkey (1996) mention that sandbar sharks can live to be more than 30 years old. The typical life expectancy in the wild for Hammerhead Sharks is from 20 to 30 years approximately. Whale sharks (Rhincodon typus) are also believed to live above 100 years, suggesting that the time to reach maturity is longer and young will take longer to born, making this type of shark more vulnerable."}, {"url": "http://www.sharks-world.com/how_long_do_sharks_live/", "passage_text": "The typical lifespan in the wild for Hammerhead Sharks is from 20 to 30 years approximately. Sandbar sharks or Brown sharks are considered to live between 20 and 30 years. Research made by Joung (2004) identified to be about 20 years of age."}, {"url": "https://en.wikipedia.org/wiki/Whale_shark", "passage_text": "The whale shark (Rhincodon typus) is a slow-moving filter feeding shark and the largest known extant fish species. The largest confirmed individual had a length of 12.65 m (41.50 ft) and a weight of approximately 21.5 metric tons (47,000 lb), and unconfirmed reports of considerably larger whale sharks exist. Claims of individuals over 14 m (46 ft) long and weighing at least 30 metric tons (66,000 lb) are not uncommon."}, {"url": "http://www.bioexpedition.com/how-long-do-sharks-live/", "passage_text": "The life-span of tiger sharks in the wild is considered to be 27 years in average, even though some may live up to 50 years of age. As with other species, tiger sharks in captivity do not live as extensive as in wildlife reaching only 17 to 20 years. Some experts presume that the lifespan of the Great White Sharks is approximately 30 years (Levine, 1988) but other research indicates that they can reach up to 40 years. The typical life expectancy in the wild for Hammerhead Sharks is from 20 to 30 years approximately. Whale sharks (Rhincodon typus) are also believed to live above 100 years, suggesting that the time to reach maturity is longer and young will take longer to born, making this type of shark more vulnerable."}, {"url": "http://www.sharks-world.com/how_long_do_sharks_live/", "passage_text": "Some scientists believe that the life expectancy of the Great White Sharks is around 30 years (Levine, 1988) but other research indicates that they can reach up to 40 years. The lifespan of Tiger Sharks in the wild is believed to be 27 years in average, although some may live up to 50 years of age. Like with other species, tiger sharks in captivity do not live as lengthy as in wildlife reaching only 17 to 20 years. Sandbar sharks or Brown sharks are considered to live between 20 and 30 years. Research made by Joung (2004) identified to be about 2"}, {"url": "http://animals.nationalgeographic.com/animals/fish/whale-shark/", "passage_text": "Did you know? The largest whale shark ever measured was 40 feet (12.2 meters) long; however, the species is thought to grow even bigger. Size relative to a bus: As the largest fish in the sea, reaching lengths of 40 feet (12 meters) or more, whale sharks have an enormous menu from which to choose. "}, {"url": "http://www.sharks-world.com/how_many_feet_long_is_a_shark/", "passage_text": "Answer: Shark size varies according to the species. The largest shark is the whale shark which is up to 41 feet long. The great white shark is up to 20 feet long. Bull sharks can reach up to 11 feet. Tiger sharks can measure between 10 to 14 feet"}, {"url": "http://www.answers.com/Q/How_long_do_Sharks_grow", "passage_text": "Depending on the species, sharks can have different sizes. The  largest is the whale shark that can reach up to 41 feet in length.  The great white shark can be about 20 fee … t long. Smaller sharks are  the bull and tiger sharks that can have an average length of 11  feet. 1  6 Amazing Fish Facts Fish are amazing creatures."}, {"url": "http://www.sharks-world.com/how_long_do_sharks_live/", "passage_text": "Shark lifespan vary by kind. Although the majority of types live 20 to 30 years in the wild, there are some kinds that live much longer than others. For example, the spiny dogfish has one of the longest lifespan at more than 100 years, while the blue shark in the wild has an average lifespan of 15-16 years. Sandbar sharks or Brown sharks are considered to live between 20 and 30 years. Research made by Joung (2004) identified to be about 20 years of age."}]