[{"url": "https://en.wikipedia.org/wiki/Government", "passage_text": "In the Commonwealth of Nations, the word government is also used more narrowly to refer to the collective group of people that exercises executive authority in a state. This usage is analogous to what is called an  administration  in American English. A system of government where an executive branch is led by a president who serves as both head of state and head of government. In such a system, this branch exists separately from the legislature, to which it is not responsible and which it cannot, in normal circumstances, dismiss."}, {"url": "https://www.whitehouse.gov/1600/state-and-local-government", "passage_text": "State & Local Government. Powers not granted to the federal government are reserved for states and the people, which are divided between state and local governments. Most Americans have more daily contact with their state and local governments than with the federal government. Under the Tenth Amendment to the U.S. Constitution, all powers not granted to the federal government are reserved for the states and the people. All state governments are modeled after the federal government and consist of three branches: executive, legislative, and judicial."}, {"url": "https://en.wikipedia.org/wiki/Government", "passage_text": "Variant of monarchy; a system of government in which two individuals, the diarchs, are the heads of state. In most diarchies, the diarchs hold their position for life and pass the responsibilities and power of the position to their children or family when they die. Diarchy is one of the oldest forms of government. A system of government where an executive branch is led by a president who serves as both head of state and head of government. In such a system, this branch exists separately from the legislature, to which it is not responsible and which it cannot, in normal circumstances, dismiss."}, {"url": "https://en.wikipedia.org/wiki/Government", "passage_text": "Government is the means by which state policy is enforced, as well as the mechanism for determining the policy of the state. A form of government, or form of state governance, refers to the set of political systems and institutions that make up the organisation of a specific government. A system of government where an executive branch is led by a president who serves as both head of state and head of government. In such a system, this branch exists separately from the legislature, to which it is not responsible and which it cannot, in normal circumstances, dismiss."}, {"url": "http://www.thefreedictionary.com/System+of+government", "passage_text": "constitutionalism-a constitutional system of government (usually with a written constitution). republic, democracy, commonwealth-a political system in which the supreme power lies in a body of citizens who can elect people to represent them. diarchy, dyarchy-a form of government having two joint rulers. technocracy-a form of government in which scientists and technical experts are in control; technocracy was described as that society in which those who govern justify themselves by appeal to technical experts who justify themselves by appeal to scientific forms of knowledge."}, {"url": "https://en.wikipedia.org/wiki/Government", "passage_text": "The term federalism is also used to describe a system of government in which sovereignty is constitutionally divided between a central governing authority and constituent political units (such as states or provinces). A system of government where an executive branch is led by a president who serves as both head of state and head of government. In such a system, this branch exists separately from the legislature, to which it is not responsible and which it cannot, in normal circumstances, dismiss."}, {"url": "http://www.sparknotes.com/us-government-and-politics/political-science/nations-and-states/section4.rhtml", "passage_text": "A system of government distributes power among different parts and levels of the state. Political scientists study the uses of power, including how power is distributed within a state. The amount of power held by the central government determines the system of government a state has. There are three main systems of government used today: unitary systems, federal systems, and confederate systems. System."}, {"url": "http://www.macmillandictionary.com/thesaurus-category/british/systems-of-government-and-types-of-government", "passage_text": "The Macmillan Dictionary blog explores English as it is spoken around the world today. Free thesaurus definition of systems of government and types of government from the Macmillan English Dictionary-a free English dictionary online with thesaurus and with pronunciation from Macmillan Publishers Limited. "}]