[{"url": "http://www.ehow.com/about_5818529_natural-sources-potassium-nitrate_.html", "passage_text": "Also known as saltpeter, potassium nitrate is a white crystallized compound composed of potassium, nitrogen and oxygen. Most commonly used in fireworks, matches and fertilizer, its medical applications include diuretics to reduce high blood pressure. "}, {"url": "http://www.ehow.com/info_8501630_natural-places-saltpeter.html", "passage_text": "Saltpeter is the popular name for the chemicals potassium nitrate and sodium nitrate. It is an important component of fertilizers, explosives, food preservatives, propellants and toothpaste for sensitive teeth. A concentrated solution of potassium nitrate speeds up decomposition of vegetable matter such as tree stumps. Ordinary saltpeter in the form of potassium nitrate occurs in the sap of plants such as sunflower, common borage, celandine and tobacco. Vegetables such as spinach, celery and cabbage contain significant amounts of potass"}, {"url": "http://www.answers.com/Q/Does_Potassium_Nitrate_occur_naturally_in_nature", "passage_text": "Actor: Stars in CBS's 2 Broke Girls. Potassium occurs naturally in bananas, and is essential to plant growth. It comes as a powder, and is silvery in color. Answer 2 Poassium, being a highly reactive element, … does not occur naturally. It is always in combination with something. As the first answer says, it's found in bananas (and a lot of other things), but not as pure potassium."}, {"url": "http://www.livestrong.com/article/205049-what-are-some-natural-sources-of-potassium-nitrate/", "passage_text": "Potassium nitrate is also called saltpeter and nitrite. It is commonly used to make gun powder and minor explosives, for curing meats and used medically for wounds (when combined with other chemicals). Because potassium nitrate can be found in soils, either by the natural decaying process or by the use of fertilizers, it gets absorbed into vegetables such as spinach, celery and cabbage."}, {"url": "https://en.wikipedia.org/wiki/Sodium_nitrate", "passage_text": "Sodium nitrate is the chemical compound with the formula Na N O 3. This salt is also known as Chile saltpeter or Peru saltpeter (due to the large deposits found in the Atacama desert in these countries) to distinguish it from ordinary saltpeter, potassium nitrate. The mineral form is also known as nitratine, nitratite or soda niter"}, {"url": "http://www.ehow.com/info_8501630_natural-places-saltpeter.html", "passage_text": "The largest occurrence of natural saltpeter as sodium nitrate and associated compounds is in Chile's Atacama Desert. Called Chile saltpeter, it derives from deposits of bird guano. Chemical processing of these deposits isolates the potassium nitrate. Ordinary saltpeter in the form of potassium nitrate occurs in the sap of plants such as sunflower, common borage, celandine and tobacco. Vegetables such as spinach, celery and cabbage contain significant amounts of"}, {"url": "https://en.wikipedia.org/wiki/Potassium_nitrate", "passage_text": "Potassium nitrate is a chemical compound with the chemical formula K N O 3. It is an ionic salt of potassium ions K + and nitrate ions NO 3 − . It occurs as a mineral niter and is a natural solid source of nitrogen. Potassium nitrate is one of several nitrogen-containing compounds collectively referred to as saltpeter or saltpetre. Major uses of potassium nitrate are in fertilizers, tree stump removal, rocket propellants and fireworks. It is one of the major constituents of gunpowder (blackpowder) and has been used since the Middle Ages as a food preservative."}, {"url": "http://www.wisegeek.org/what-is-salt-peter.htm", "passage_text": "Salt peter typically refers to the chemical compound potassium nitrate, though it may also refer to sodium nitrate. Salt peter was once collected from decomposing material, but today, it is generally manufactured by treating sodium nitrate, mostly mined in Chile, with potassium chloride and collecting the precipitate. Salt peter is also used as a fertilizer and as a stump remover, as it accelerates the decomposition process of tree stumps. Salt peter can be found in many everyday products as well. It is used to preserve some foods, most commonly meats, although there are concerns about its health effects."}, {"url": "http://www.foodterms.com/encyclopedia/saltpeter/index.html", "passage_text": "In the non-food world, it's utilized for fireworks, gunpowder, as a component in fertilizer and so on. 2. Another chemical compound referred to as saltpeter is sodium nitrate, which appears naturally in leafy green vegetables. Like potassium nitrate, it's used to cure and retain color in meat products. Over time sodium nitrate breaks down and becomes sodium nitrite. "}, {"url": "http://cooking.stackexchange.com/questions/10824/is-there-any-substitute-for-saltpeter-sodium-nitrate-in-corned-beef-brine", "passage_text": "Sodium nitrate (saltpeter) is used as a preservative, and in fact some curing salts use a combination of nitrate and nitrite. Yes, it's also used in explosives, but lots of food ingredients/additives have alternate uses... "}]