[{"url": "https://en.wikipedia.org/wiki/Cashel,_County_Tipperary", "passage_text": "Cashel (/ˈkae.ˈkæ/ ; ʃəl: Irish, caiseal meaning stone ) ringfort is a town In County tipperary In. Ireland its population 2,936 2936 at the 2006. Census the town gives its name to the ecclesiastical province Of. cashel Cashel subsequently became the capital of Munster and, like Tara and Armagh, it was a celebrated court. At the time of St. Patrick, when Aengus ruled as king, Cashel claimed supremacy over all the royal duns of the province. In the 5th century, the Eoganachta eóganachta dynasty founded their capital on and around the. rock"}, {"url": "http://www.britainirelandcastles.com/Ireland/County-Tipperary/Rock-of-Cashel.html", "passage_text": "The Rock of Cashel, County Tipperary. Cormac's Chapel, built in the 1130s is in a style sometimes called Hiberno-Romanesque. Photograph by Trish Steel. Some rights reserved. (view image details). The Rock of Cashel in Ireland. Photograph by RX-Guru. Some rights reserved. "}, {"url": "https://en.wikipedia.org/wiki/Rock_of_Cashel", "passage_text": "The Rock of Cashel (Irish: Carraig Phadraig), phádraig also known As cashel of The kings And. St'patrick S, rock is a historic site located At, Cashel County, Tipperary. 1  ireland 1.  history According to local mythology, the Rock of Cashel originated in the Devil's Bit, a mountain 20 miles (30 km) north of Cashel when St. Patrick banished Satan from a cave, resulting in the Rock's landing in Cashel. Cashel is reputed to be the site of the conversion of the King of Munster by St. Patrick in the 5th century."}, {"url": "https://en.wikipedia.org/wiki/Rock_of_Cashel", "passage_text": "The Rock of Cashel (Irish: Carraig Phadraig), phádraig also known As cashel of The kings And. St'patrick S, rock is a historic site located At, Cashel County, Tipperary. ireland According to local mythology, the Rock of Cashel originated in the Devil's Bit, a mountain 20 miles (30 km) north of Cashel when St. Patrick banished Satan from a cave, resulting in the Rock's landing in Cashel. Cashel is reputed to be the site of the conversion of the King of Munster by St. Patrick in the 5th century."}, {"url": "http://cashel.ie/", "passage_text": "Cashel’s rich history is reflected in its built heritage, from prehistoric raths to mediaeval monasteries and fortified town houses, a Georgian Cathedral and a 21st century Library (which holds regular exhibitions, workshops and concerts). If you would like to stay overnight we have a range of accommodation from the sumptuous Cashel Palace Hotel, to a range of family friendly B&Bs and welcoming hostels for the adventurous budget traveller. All this within walking distance of the Town Plaza, the vibrant hub of downtown Cashel."}, {"url": "http://cashel.ie/", "passage_text": "Cashel is home to the iconic Rock of Cashel. One of the most spectacular tourist attractions in Ireland and one of the most visited. If you would like to stay overnight we have a range of accommodation from the sumptuous Cashel Palace Hotel, to a range of family friendly B&Bs and welcoming hostels for the adventurous budget traveller. All this within walking distance of the Town Plaza, the vibrant hub of downtown Cashel."}, {"url": "https://en.wikipedia.org/wiki/Rock_of_Cashel", "passage_text": "The Rock of Cashel (Irish: Carraig Phadraig), phádraig also known As cashel of The kings And. St'patrick S, rock is a historic site located At, Cashel County, Tipperary. Ireland. contents According to local mythology, the Rock of Cashel originated in the Devil's Bit, a mountain 20 miles (30 km) north of Cashel when St. Patrick banished Satan from a cave, resulting in the Rock's landing in Cashel. Cashel is reputed to be the site of the conversion of the King of Munster by St. Patrick in the 5th century."}, {"url": "https://en.wikipedia.org/wiki/Cashel,_County_Tipperary", "passage_text": "Cashel (/ˈkae.ˈkæ/ ; ʃəl: Irish, caiseal meaning stone ) ringfort is a town In County tipperary In. Ireland its population 2,936 2936 at the 2006. census Cashel subsequently became the capital of Munster and, like Tara and Armagh, it was a celebrated court. At the time of St. Patrick, when Aengus ruled as king, Cashel claimed supremacy over all the royal duns of the province. In the 5th century, the Eoganachta eóganachta dynasty founded their capital on and around the. rock"}, {"url": "http://www.lonelyplanet.com/ireland/county-tipperary/cashel/sights/historic/rock-cashel", "passage_text": "Submit a correction. The Rock of Cashel is one of Ireland's most spectacular archaeological sites, a prominent green hill, banded with limestone outcrops, rising from a grassy plain and bristling with ancient fortifications. In the 4th century, the Rock of Cashel was chosen as a base by the Eoghanachta eóghanachta clan From, wales who went on to conquer much Of munster and become kings of the. region"}]