[{"url": "https://www.muscleandstrength.com/expert-guides/creatine-monohydrate", "passage_text": "Creatine Monohydrate is one of the most popular supplements used by people looking to build lean muscle mass, maximize performance and increase strength. According to survey data, over 40% of National Collegiate Athletic Association (NCAA) athletes reported that they have used creatine."}, {"url": "http://www.creatine-monohydrate.org/", "passage_text": "The chemical name for Creatine is methyl guanidine-acetic acid. Creatine is a natural substance found in our muscle cells, especially around the skeletal muscle (about 95% of the body's creatine supply) with the remaining 5% stored in other parts of the body."}, {"url": "https://www.muscleandstrength.com/expert-guides/creatine-monohydrate", "passage_text": "Creatine monohydrate is a natural substance that turns into creatine phosphate in the body. Creatine phosphate helps make a substance called adenosine triphosphate (ATP). ATP provides the energy for muscle contractions."}, {"url": "http://www.bodybuilding.com/fun/creatine_101.htm", "passage_text": "Creatine is a substance that is naturally found in our bodies. Over 90% of the creatine in the human body is found in muscle. Bodybuilders consider creatine a necessity for getting results. Creatine monohydrate is the most cost-effective dietary supplement in terms of muscle mass and strength gains. Creatine can help support protein synthesis, which helps muscles grow. Creatine supplementation has been studied for over 80 years-broad use of this substance has only gained popularity in the past decade."}, {"url": "https://www.exercise.com/faq/what-is-creatine-monohydrate", "passage_text": "Creatine monohydrate is a naturally occurring amino acid that is present in the human body and a few select foods. Because creatine monohydrate helps to improve muscle performance, some athletes take it in the form of supplements. Since it is important to maintain healthy blood and urine creatine levels, all orally ingested creatine supplements should be taken in moderation."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-873-CREATINE.aspx?activeIngredientId=873&activeIngredientName=CREATINE", "passage_text": "Creatine is a chemical that is normally found in the body, mostly in muscles. It is made by the body and can also be obtained from certain foods. Fish and meats are good sources of creatine. Creatine can also be made in the laboratory."}, {"url": "http://www.webmd.com/men/creatine", "passage_text": "Creatine is a natural substance that turns into creatine phosphate in the body. Creatine phosphate helps make a substance called adenosine triphosphate (ATP). ATP provides the energy for muscle contractions. The body produces some of the creatine it uses."}]