[{"url": "http://link.springer.com/article/10.1007/BF00542196", "passage_text": "Plasma protein binding of furosemide in the elderly. 1  G. M. PacificiAffiliated withDepartment of General Pathology, Medical School, University of Pisa. , 2  A. VianiAffiliated withDepartment of General Pathology, Medical School, University of Pisa. , 3  H. -U. A significant correlation was found between the unbound fraction of furosemide and the plasma concentration of albumin. The average number of binding sites was 3.8 (elderly) and 2.7 (young) 10 −6 mol/g albumin. The average association constant (K) was 4.3 (elderly) and 4.2 (young) 10 5 M −1."}, {"url": "http://link.springer.com/article/10.1007/BF00542196", "passage_text": "The protein binding of furosemide was investigated in plasma from 22 old and 11 young subjects by equilibrium dialysis. The unbound fraction of furosemide was 3.16% in plasma from the elderly and 1.71% in plasma from the young. A significant correlation was found between the unbound fraction of furosemide and the plasma concentration of albumin. The average number of binding sites was 3.8 (elderly) and 2.7 (young) 10 −6 mol/g albumin. The average association constant (K) was 4.3 (elderly) and 4.2 (young) 10 5 M −1."}, {"url": "http://dmd.aspetjournals.org/content/27/1/81.full", "passage_text": "Compared with control rabbits, hypoalbuminemia increased the fraction of unbound furosemide in plasma (p 4). As a consequence, in hypoalbuminemic rabbits, furosemide response, as assessed by the sodium excretion rate and the urinary volume, was decreased by 21%. In addition, 4 ml of blood was withdrawn from each rabbit at 3 min to assess furosemide protein binding and warfarin concentration. Urine was collected for 60 min. Plasma and urine were stored at −20°C in tubes protected from light until furosemide was assayed."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/7161408", "passage_text": "We evaluated the protein binding and comparative bilirubin displacing properties of bumetanide and furosemide in pooled adult and cord serum by ultrafiltration (UF), difference spectra (DS), and Sephadex Gel-25 (SG-25) filtration. "}, {"url": "http://www.medscape.com/viewarticle/771976_4", "passage_text": "Bioavailability is not affected by CHF or renal dysfunction. On a milligram-to-milligram basis, the natriuretic and chloruretic effects of torsemide are approximately eight-times that of furosemide. Torsemide is 97–99% protein bound whereas furosemide is 95% protein bound. A loop diuretic with greater than 95% protein binding limits its glomerular filtra"}, {"url": "http://dmd.aspetjournals.org/content/27/1/81.full", "passage_text": "Abstract. To investigate the influence of furosemide plasma protein binding on its kinetics and dynamics, the kinetics of furosemide was studied in the presence of a protein binding displacer, warfarin, and in hypoalbuminemic rabbits. In addition, 4 ml of blood was withdrawn from each rabbit at 3 min to assess furosemide protein binding and warfarin concentration. Urine was collected for 60 min. Plasma and urine were stored at −20°C in tubes protected from light until furosemide was assayed."}, {"url": "http://www.merckvetmanual.com/mvm/pharmacology/systemic_pharmacotherapeutics_of_the_urinary_system/diuretics.html", "passage_text": "The effect peaks 30 min after IV administration and 1–2 hr after PO administration. The duration of diuretic action is 2 and 6 hr after IV and PO administration, respectively. Furosemide is highly protein bound (91%–97%), almost totally to albumin. It is cleared through the kidneys by renal tubular secretion. Bioavailability of oral furosemide is low (only 50% is absorbed). Furosemide is usually dosed to effect. For acute, short-term therapy, single IV, IM, or SC doses of 4–6 mg/kg are given. "}, {"url": "http://dmd.aspetjournals.org/content/27/1/81.full", "passage_text": "Pretreatment of rabbits with warfarin produces a marked decrease in the diuretic response of furosemide, decrease that is prevented by the administration of furosemide mixed with albumin, i.e., by correcting the warfarin-induced reduction in furosemide binding to plasma proteins. In addition, 4 ml of blood was withdrawn from each rabbit at 3 min to assess furosemide protein binding and warfarin concentration. Urine was collected for 60 min. Plasma and urine were stored at −20°C in tubes protected from light until furosemide was assayed."}, {"url": "http://www.rxlist.com/lasix-drug/clinical-pharmacology.htm", "passage_text": "Furosemide is extensively bound to plasma proteins, mainly to albumin. Plasma concentrations ranging from 1 to 400 μg/mL are 91 to 99% bound in healthy individuals. The unbound fraction averages 2.3 to 4.1% at therapeutic concentrations. The onset of diuresis following oral administration is within 1 hour. The amount of fluid (water) retained by the body is controlled primarily by the kidneys. This occurs due to the kidney's ability to control the retention and elimination of sodium and chlorid... Read the Diuretics article 1  ». « Previous. 2  1."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/9884313", "passage_text": "Role of plasma protein binding on renal metabolism and dynamics of furosemide in the rabbit. Pichette V, Geadah D, du Souich P. Service de nephrologie, Néphrologie Hopital-Maisonneuve rosemont And departement Département, De pharmacologie Faculte, Faculté de Medecine, Médecine, Universite. [PubMed-de montreal MONTRéAL]. quebec québec canada pubmed indexed for medline "}]