[{"url": "http://www.webmd.com/skin-problems-and-treatments/ss/slideshow-nails-and-health", "passage_text": "Though nail changes accompany many conditions, these changes are rarely the first sign. And many nail abnormalities are harmless -- not everyone with white nails has hepatitis. If you're concerned about the appearance of your nails, see a dermatologist. A touch of white here, a rosy tinge there, or some rippling or bumps may be a sign of disease in the body. Problems in the liver, lungs, and heart can show up in your nails. Keep reading to learn what secrets your nails might reveal."}, {"url": "http://www.skinsight.com/adult/onychoschizia.htm", "passage_text": "Signs and Symptoms. 1  Nail splitting affects the fingernails and the toenails. 2  The condition may appear as a single horizontal split between layers of the nail plate at the growing end or as multiple splits and loosening of the growing edge of the nail plate. 1"}, {"url": "http://umm.edu/health/medical/ency/articles/nail-abnormalities", "passage_text": "1 Liver disease can damage nails. 2  Thyroid diseases such as. 3  or may cause brittle nails or splitting of the nail bed from the nail plate (onycholysis). 4  hyperthyroidism. 5  hypothyroidism. 6  Severe illness or surgery may cause horizontal depressions in the nails (Beau's lines). 1 Thyroid diseases such as. 2  or may cause brittle nails or splitting of the nail bed from the nail plate (onycholysis). 3  hyperthyroidism. 4  hypothyroidism. 5"}, {"url": "http://www.medicinenet.com/nail_health_pictures_slideshow/article.htm", "passage_text": "In this condition, the nails are really normal in color but the nail bed, the tissue that lies beneath the nail, is blue. This is commonly called nail bed cyanosis and is a sign of poorly oxygenated blood or more accurately unoxygenated hemoglobin, the oxygen carrying protein in red blood cells. Pale Nails. White nails with a rim of darker color at the tip of the nail is called Terry's nail and often a sign of a severe liver disease called cirrhosis."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/adult-health/expert-answers/split-fingernails/faq-20058182", "passage_text": "Treating your nails gently can help prevent split fingernails. Consider these simple tips: 1  Keep your fingernails dry. 2  Repeated or prolonged contact with water can contribute to split fingernails. 3  Wear cotton-lined rubber gloves when washing dishes, cleaning or using harsh chemicals. 4  Practice good nail hygiene. 1 Keep your fingernails neatly trimmed, and round the tips in a gentle curve. 2  When you use hand lotion, rub the lotion into your fingernails and cuticles, too. 3  Don't bite your fingernails or pick at your cuticles. 4  Avoid harsh nail care products. 5  Limit your use of nail polish remover."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/ss/slideshow-nails-and-health", "passage_text": "Cracked or Split Nails. Dry, brittle nails that frequently crack or split have been linked to thyroid disease. Cracking or splitting combined with a yellowish hue is more likely due to a fungal infection. A touch of white here, a rosy tinge there, or some rippling or bumps may be a sign of disease in the body. Problems in the liver, lungs, and heart can show up in your nails. Keep reading to learn what secrets your nails might reveal."}, {"url": "http://www.webmd.boots.com/healthy-skin/guide/healthy-fingernails-clues-about-health", "passage_text": "An iron deficiency can also cause the nail bed to be thin and concave and have raised ridges, spoon-shaped nails or koilonychia. Heart disease can turn the nail beds red. Obsessive-compulsive disorder can show up in the nails through persistent nail-biting or picking. Even common disorders like thyroid disease can cause abnormalities in the nail beds, producing dry, brittle nails that crack and split easily. "}, {"url": "http://www.webmd.com/skin-problems-and-treatments/ss/slideshow-nails-and-health", "passage_text": "One of the most common causes of yellow nails is a fungal infection. As the infection worsens, the nail bed may retract, and nails may thicken and crumble. In rare cases, yellow nails can indicate a more serious condition such as severe thyroid disease, lung disease, diabetes or psoriasis. A touch of white here, a rosy tinge there, or some rippling or bumps may be a sign of disease in the body. Problems in the liver, lungs, and heart can show up in your nails. Keep reading to learn what secrets your nails might reveal."}, {"url": "http://www.aocd.org/?page=BrittleSplittingNail", "passage_text": "Onychoschizia or splitting of the fingernails is a common problem seen by dermatologists. The term onychoschizia includes splitting, brittle, soft or thin nails. Onychoschizia is more common in women. Only very rarely are internal disease or vitamin deficiencies the reason (iron deficiency is the most common). "}]