[{"url": "http://radiology-information.blogspot.com/2013/02/the-contracted-or-small-gallbladder.html", "passage_text": "Pathological causes of a small gallbladder Most pathologically contracted gallbladders contain stones. When the gallbladder cannot be identified, try scanning transversely through the gallbladder fossa, just caudal to the porta hepatis. \\\\ Radiology 49 \\\\ No comments. Do not confuse the appearances of a previous cholecystectomy, when bowel in the gallbladder fossa casts a shadow, with a contracted, stone-filled. gallbladder. A less common cause of a small gallbladder is the microgallbladder associated with cystic fibrosis (Fig. bellow)."}, {"url": "http://answers.webmd.com/answers/648766/what-is-a-contracted-gallbladder", "passage_text": "The purpose of the gallbladder is to store and concentrate bile. After a meal the muscular gallbladder contracts, and the stored bile is secreted into the intestine where it helps digest food, particularly fats. The term contracted gallbladder can refer to two different situations."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=79446", "passage_text": "In either case, the gallbladder empties, becomes smaller, and is said to be contracted. This is the normal situation. The second situation is when the gallbladder is diseased, specifically when there has been inflammation, for example, due to gallstones, that has resulted in scarring of the gallbladder. Scarring causes the gallbladder to become smaller, for example, contracted, and the gallbladder no longer functions normally. The contraction in the latter situation is clearly different from the contraction in the first. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/8698069", "passage_text": "Contracted gallbladder: a cause of false-positive hepatobiliary scan in patients with cystic fibrosis. Giuliano V, Dadparvar S, Savit R, Holsclaw D. Gallbladder nonvisualization on hepatobiliary scintigraphy in cystic fibrosis is generally secondary to cystic duct obstruction from inspissated bile, mucus, or gallstones. A contracted gallbladder therefore is a potential cause of a false-positive hepatobiliary scan which can be treated with conservative management."}, {"url": "http://answers.webmd.com/answers/648766/what-is-a-contracted-gallbladder", "passage_text": "The first occurs following a meal or after events that cause the muscle of the gallbladder to contract, for example, ingestion of fat or injection intravenously of the hormone that is responsible for causing the gallbladder to contract. The gallbladder empties, becomes smaller, and is said to be contracted. This is the normal situation. The second situation is when the gallbladder is diseased, specifically when there has been inflammation, for example, due to gallstones, that has resulted in scarring of the gallbladder. After a meal the muscular gallbladder contracts, and the stored bile is secreted into the intestine where it helps digest food, particularly fats. The term contracted gallbladder can refer to two different situations."}, {"url": "http://www.tandurust.com/alternativetherapies/contracted-gallbladder-causes-treatment.html", "passage_text": "1 The second situation is more of a concern as the gallbladder gets contracted when it is diseased, especially when it is inflamed. 2  Gallstones present in gallbladder can cause scars in its inner lining. 3  Scarring causes gallbladder to contract and spasm. 4  Often there may be sludge instead of gallstones. 1 Sometimes gallbladder is inflamed due to infection. 2  The condition is called cholecystitis. 3  The most common cause for cholecystitis is gallstones or excess accumulation of sludge. 4  Rarely, but may also result from a growth in gallbladder."}, {"url": "http://www.home-remedies-for-you.com/askquestion/8269/question-on-gall-bladder-contraction-what-causes-t.html", "passage_text": "A gallbladder contraction occurs when the gallbladder releases bile juice into the intestine. This gall bladder contraction is usually normal and occurs when fatty foods are eaten. However, it is important to remember that a gallbladder contraction can also occur when there are gallstones present in the gallbladder. Such a gallbladder contraction might give rise to pain as well. Gallstones are small hard deposits that form in the gallbladder and can cause many problems. Gallstones are usually formed from cholesterol but pigment stones are common as well. A blockage in the passage between the gall bladder and the small intestine can cause bile buildup in the gall bladder and this is not a good sign. Since food does not get digested properly as a result of an affected gall bladder, experiencing symptoms of indigestion are inevitable."}, {"url": "http://www.tandurust.com/alternativetherapies/contracted-gallbladder-causes-treatment.html", "passage_text": "This type of contraction is not normal and can be a cause for pain in abdomen. Gallstones are tiny to large stones formed of cholesterol or pigments. They are one of the gallbladder related problems which can give rise to pain especially when they get stuck in the bile duct. Contracted gallbladder is detected on sonography. Physiological contraction is not a cause of worry; however other causes may require treatment and dietary changes to relieve the spasm. 1 Sometimes gallbladder is inflamed due to infection. 2  The condition is called cholecystitis. 3  The most common cause for cholecystitis is gallstones or excess accumulation of sludge. 4  Rarely, but may also result from a growth in gallbladder."}, {"url": "http://emedicine.medscape.com/article/366246-overview", "passage_text": "Inadequate visualization of the gallbladder may occur in obese or contracted patients or in patients with abdominal wounds. Only 74-79% of gallstones are identified in patients with computed tomography (CT) scanning. CT is not a screening tool for uncomplicated cholelithiasis. "}]