[{"url": "http://www.thefreedictionary.com/subservient", "passage_text": "sub•ser•vi•ent. 1. serving or acting in a subordinate capacity; subordinate. 2. servile; excessively submissive; obsequious. 3. useful in promoting a purpose or end. subservient-, s. of subserviēns, present participle of subservīre to subserve; see-ent ]. sub•ser′vi•ence, sub•ser′vi•en•cy, n. sub•ser′vi•ent•ly, adv."}, {"url": "http://legal-dictionary.thefreedictionary.com/Subservient+tenement", "passage_text": "easement. n. the right to use the real property of another for a specific purpose. The easement is itself a real property interest, but legal title to the underlying land is retained by the original owner for all other purposes."}, {"url": "http://www.ldoceonline.com/dictionary/subservient", "passage_text": "—subservience noun [uncountable]. Definition from the Longman Dictionary of Contemporary English. Advanced Learner's Dictionary. Dictionary results for subservient. "}, {"url": "http://www.thefreedictionary.com/submissive", "passage_text": "If soldiers are punished before they have grown attached to you, they will not prove submissive; and, unless submissive, then will be practically useless. The Art of War by Sun, Tzu View in context. The archdeacon had in Quasimodo the most submissive slave, the most docile lackey, the most vigilant of dogs. "}, {"url": "http://www.merriam-webster.com/dictionary/subservient", "passage_text": "Examples of SUBSERVIENT. 1  She refused to take a subservient role in their marriage. 2  Henson and Stowe did become close friends, and Stowe herself drew direct parallels between Uncle Tom and Josiah Henson. 1"}, {"url": "https://answers.yahoo.com/question/index?qid=20071025195103AA1eFFo", "passage_text": "What's the difference between  submissive and subservient? I enjor going to that shop because the staff are so _____. "}, {"url": "http://dictionary.cambridge.org/dictionary/english/subservient", "passage_text": "subservient adjective. › ​willing to do what other ​people ​want, or ​considering ​your ​wishes as less ​important than those of other ​people: In the past, women were ​viewed as subservient to men. subservience noun [U] us /səbˈsɜr·vi·əns/ › disapproving ​Your subservience to ​your ​boss disgusts me. subservient adjective. › ​willing to do what other ​people ​want, or ​considering ​your ​wishes as less ​important than those of other ​people: Women were ​expected to ​adopt a subservient ​role/​position. His other ​interests were subservient to his ​compelling ​passion for ​art. subservience noun [U] uk us /-əns/."}, {"url": "http://www.yourdictionary.com/subservient", "passage_text": "LINK / CITE ADD TO WORD LIST. adjective. The definition of subservient is someone who is useful, submissive and functions in a subordinate capacity. An example of someone who would be described as subservient is a meek person who defers to what others want and always obeys any command."}, {"url": "http://www.wordreference.com/definition/subservient", "passage_text": "Online Language Dictionaries. English definition English thesaurus English-Spanish English-French English-Italian Spanish-English French-English Italian-English Espanol-Español Francais-Français Francais-Français Espanol-Español Espanol: español Portugues: português Portugues: português espanol... español espanol español definicion definición espanol español sinonimos sinónimos catala català definicio definició more sub•ser•vi•ent /səbˈsɝviənt/USA pronunciation adj. sub•ser•vi•ence, n. [uncountable]See-serv-1. 1  too eager to give in to the wishes or power of another; servile:He is very subservient to his boss. 2  secondary; subordinate:A good leader's policies must be subservient to the needs of the people."}]