[{"url": "https://en.wikipedia.org/wiki/Market_externality", "passage_text": "A negative externality (also called external cost or external diseconomy) is an economic activity that imposes a negative effect on an unrelated third party. It can arise either during the production or the consumption of a good or service. Barry Commoner commented on the costs of externalities: For example, manufacturing activities that cause air pollution impose health and clean-up costs on the whole society, whereas the neighbors of an individual who chooses to fire-proof his home may benefit from a reduced risk of a fire spreading to their own houses."}, {"url": "http://economicsonline.co.uk/Market_failures/Externalities.html", "passage_text": "A negative externality is a cost that is suffered by a third party as a result of an economic transaction. In a transaction, the producer and consumer are the first and second parties, and third parties include any individual, organisation, property owner, or resource that is indirectly affected."}, {"url": "https://en.wikipedia.org/wiki/Market_externality", "passage_text": "Air pollution from motor vehicles is an example of a negative externality. The costs of the air pollution for the rest of society is not compensated for by either the producers or users of motorized transport. For example, manufacturing activities that cause air pollution impose health and clean-up costs on the whole society, whereas the neighbors of an individual who chooses to fire-proof his home may benefit from a reduced risk of a fire spreading to their own houses."}, {"url": "http://www.imf.org/external/pubs/ft/fandd/basics/external.htm", "passage_text": "Negative and positive externalities. In the case of pollution—the traditional example of a negative externality —a polluter makes decisions based only on the direct cost of and profit opportunity from production and does not consider the indirect costs to those harmed by the pollution. There are differences between private returns or costs and the costs or returns to society as a whole. Smoking is bad for you (photo: Radius Images/Corbis). Consumption, production, and investment decisions of individuals, households, and firms often affect people not directly involved in the transactions."}, {"url": "http://www.economicshelp.org/blog/9448/economics/externalities-free-market/", "passage_text": "I’m sure most economists would accept the existence of externalities, both negative and positive. If there are negative and positive externalities, there is a clear argument that this will lead to market failure. For example: 1  Positive externalities and market failure. 2  Negative externalities and market failure. I would argue that health care is a clear case of a service which has a strong positive externality. If you look at standards of public health in the Ninenteenth Century, death rates were much higher. It is in everyone’s interest to provide a minimum level of public health because everyone benefits."}, {"url": "http://users.hunterlink.net.au/~ddhrg/econ/ext1.html", "passage_text": "The most obvious example of a negative externality in production is the pollution caused by many industries. Positive externalities occur when a benefit accrues to someone outside of the production or consumption of a good. 4. Externalities may take two forms. Firstly there are negative externalities. A negative externality occurs where consumption or production of a good generates a cost borne by someone outside of the production or consumption of that good."}, {"url": "http://advocateliberty.com/problem-externalities-in-free-market/", "passage_text": "The Problem of Externalities in the Free Market. by Dave Gernhard. An externality exists whenever the action of an individual brings added costs or benefits to another individual. Phrased differently, externalities exist when the participants of an action don’t reap all the costs or all the benefits of that action."}, {"url": "http://www.economicshelp.org/blog/9448/economics/externalities-free-market/", "passage_text": "If you leave it to the free market, there will always be a huge inequality in provision and quality of the product. Victorian society, shows that the free market will provide some health care and some education, but, this was a very limited. I would argue that health care is a clear case of a service which has a strong positive externality. If you look at standards of public health in the Ninenteenth Century, death rates were much higher. It is in everyone’s interest to provide a minimum level of public health because everyone benefits."}, {"url": "http://www.studydroid.com/printerFriendlyViewPack.php?packId=536098", "passage_text": "Public goods are those for which there is: nonrivalry and nonexcludability. In a market economy with well defined property rights, the potential threat of a lawsuit or a liability judgment against a firm will give firms an incentive to: decrease negative externalities from production. suppose that Mick and Cher are the only two members of a society and are willing to pay $10 and $8, respectively, for the 3rd unit of a public good. Also, assume that the marginal cost of the 3rd unit is $17."}]