[{"url": "http://www.slaughterandmay.com/media/1515647/an-overview-of-the-uk-competition-rules.pdf", "passage_text": "SLAUGHTER AND MAY 07 An Overview of the UK Competition Rules guidance or a decision on compatibility with the Chapter I prohibition.To mirror changes introduced at EU level under the Modernisation Regulation, the Government abolished the system of notification in the UK in its entirety with effect from 1 May 2004. SLAUGHTER AND MAY 11 An Overview of the UK Competition Rules the relevant market, including factors such as market shares, the position of competitors, barriers to entry and the bargaining strength of customers. As a rule of thumb, dominance will not generally be considered to exist below a market share of 40%."}, {"url": "http://www.fieldfisher.com/pdf/EU-competition-law-articles-101-102.pdf", "passage_text": "EU Competition Law Article 101 and Article 102 2 EU Competition Law: Article 101 and Article 102 The European Community was established in 1957 by the Treaty of Rome and initially comprised six Member States. Competition law provisions in the UK The UK, in common with all Member States, has its own competition provisions modelled on Article 101 and Article 102. These are set out in the Competition Act 1998."}, {"url": "https://en.wikipedia.org/wiki/Competition_law", "passage_text": "Competition law is a law that promotes or seeks to maintain market competition by regulating anti-competitive conduct by companies. Competition law is implemented through public and private enforcement. Competition law is known as antitrust law in the United States and European Union, and as anti-monopoly law in China and Russia. In previous years it has been known as trade practices law in the United Kingdom and Australia. The history of competition law reaches back to the Roman Empire"}, {"url": "http://www.slaughterandmay.com/media/1515647/an-overview-of-the-uk-competition-rules.pdf", "passage_text": "They apply to mergers which do not fall within the exclusive competence of the European Commission (the Commission) under the EU Merger Regulation (see the separate Slaughter and May publication The EU Merger Regulation). SLAUGHTER AND MAY 03 An Overview of the UK Competition Rules Section Heading: 2. SLAUGHTER AND MAY 11 An Overview of the UK Competition Rules the relevant market, including factors such as market shares, the position of competitors, barriers to entry and the bargaining strength of customers. As a rule of thumb, dominance will not generally be considered to exist below a market share of 40%."}, {"url": "http://www.out-law.com/page-5811", "passage_text": "Where the effect of anti-competitive behaviour extends beyond the UK to other EU Member States, it is prohibited by Articles 101 and 102 of the Treaty on the Functioning of the European Union (TFEU). UK and EU competition law prohibit two main types of anti-competitive activity: 1  anti-competitive agreements (under the Chapter I / Article 101 prohibitions); 2  andabuse of a dominant market position (under the Chapter II / Article 102 prohibitions). Competition law-the basics. This guide is based on UK law. It was last updated in April 2014. Failure to comply with UK or EU competition law can have very serious consequences."}, {"url": "https://en.wikipedia.org/wiki/United_States_antitrust_law", "passage_text": "Every violation of the antitrust laws is a blow to the free-enterprise system envisaged by Congress. This system depends on strong competition for its health and vigor, and strong competition depends, in turn, on compliance with antitrust legislation. United States antitrust law is a collection of federal and state government laws, which regulates the conduct and organization of business corporations, generally to promote fair competition for the benefit of consumers."}, {"url": "http://www.out-law.com/page-5811", "passage_text": "Both UK and EU competition law prohibit agreements, arrangements and concerted business practices which appreciably prevent, restrict or distort competition (or where this is the intended result) and which affect or may affect trade within the UK or the EU respectively. Consequences of breach. Competition law-the basics. This guide is based on UK law. It was last updated in April 2014. Failure to comply with UK or EU competition law can have very serious consequences."}]