[{"url": "http://bastille-day.com/biography/LouisXVI-Biography", "passage_text": "Louis XVI Portrait by Duplessis (1775). Louis XVI was born as Louis-August, Duc de Berry: son of Louis, Dauphin of France and Princess Marie-Josephe of Saxony. He was the grandson of King Louis XV. His father died of lung tuberculosis at age 36 before having a chance to become the next King of France. Louis XVI Early life. Louis XVI was born as Louis-August, Duc de Berry: son of Louis, Dauphin of France and Princess Marie-Josephe of Saxony."}, {"url": "https://simple.wikipedia.org/wiki/Louis_XVI_of_France", "passage_text": "Louis XVI was born to Louis Ferdinand, Dauphin of France and grandson of Louis XV and his wife, Marie Josephe of Saxony, in 1754. His father died early in Louis's life and Louis XVI became the dauphin. His parents liked his older brother more than Louis and were upset when Louis's brother died at ten. Louis's parents turned against him and he became a shy boy. When Louis was 15, he married Marie Antoinette. Louis XVI (August 23, 1754 - January 21, 1793) was King of France and Navarre from 1774 to 1791 and as King of the French from 1791 to 1792. Suspended and arrested during the Insurrection of 10 August 1792, he was tried by the National Convention, found guilty of treason, and executed by guillotine on 21 January 1793"}, {"url": "http://www.biography.com/people/louis-xvi-9386943", "passage_text": "Louis XVI became the heir to the throne and the last Bourbon king of France upon his father's death in 1765. In 1770, he married Austrian archduchess Marie-Antoinette, the daughter of Maria Theresa and Holy Roman Emperor Francis I. Louis was soon found guilty by the National Assembly and condemned to death. On January 21, 1793, Louis XVI was guillotined in the Palace de la Revolution. His wife, Marie Antoinette, met the same fate nine months later, on October 16, 1793."}, {"url": "http://www.biography.com/people/louis-xvi-9386943", "passage_text": "Louis XVI was born on August 23, 1754, in the Palace of Versailles. Named Louis Auguste de France, he was given the title Du de Berry signifying his junior status in the French Court. He was the third son of Louis, Dauphin of France and grandson of Louis XV of France. Louis was soon found guilty by the National Assembly and condemned to death. On January 21, 1793, Louis XVI was guillotined in the Palace de la Revolution. His wife, Marie Antoinette, met the same fate nine months later, on October 16, 1793."}, {"url": "http://www.bbc.co.uk/history/historic_figures/louis_xvi.shtml", "passage_text": "He was guillotined in 1793. Louis was born at Versailles on 23 August 1754. In 1770, he married Marie Antoinette, daughter of the emperor and empress of Austria, a match intended to consolidate an alliance between France and Austria. In 1774, Louis succeeded his grandfather Louis XV as king of France. "}, {"url": "http://www.nndb.com/people/974/000097683/", "passage_text": "Executive summary: Dauphin, Titular King of France. Louis XVII, titular king of France, second son of Louis XVI and Marie Antoinette, was born at Versailles on the 27th of March 1785, was christened the same day Louis Charles, and given the title of duke of Normandy. Louis Charles became dauphin on the death of his elder brother on the 4th of June 1789. "}, {"url": "http://www.notablebiographies.com/Lo-Ma/Marie-Antoinette.html", "passage_text": "Marie Antoinette was born on November 2, 1755, in Vienna (now in Austria), the capital of the Holy Roman Empire. She was the eleventh daughter of the Holy Roman emperor Francis I (1708–1765) and the empress Maria Theresa (1717–1780). In 1770 she married Louis XVI (1754–1793). "}, {"url": "https://en.wikipedia.org/wiki/Louis_XVI_of_France", "passage_text": "Louis XVI (. [lwi sɛːz] ; 23 August 1754 – 21 January 1793), also known as Louis Capet, was King of France from 1774 until his deposition in 1792, although his formal title after 1791 was King of the French. He was guillotined on January 21 1793. His father, Louis, Dauphin of France, was the son and heir apparent of Louis XV of France, but his father died in 1765, and Louis succeeded his grandfather as king in 1774. "}]