[{"url": "https://www.asme.org/career-education/articles/early-career-engineers/engineering-salaries-on-the-rise", "passage_text": "The median income of full-time salaried respondents increased regularly from $55,000 for those with less than one year of experience to $127,800 for those with 25 years of experience or more. Engineers' salaries are higher now than previously reported in 2011."}, {"url": "http://work.chron.com/electrical-engineering-top-salary-per-month-6408.html", "passage_text": "Top Salary. The top 10 percent of electrical engineers earn a monthly salary of $10,972 or more, according to the U.S. Bureau of Labor Statistics. This is equivalent to an annual full-time salary of $131,660, or an hourly wage of $63.30. Salaries in the range of $11,000 per month or more usually go to engineers with at least 10 years experience, according to ElectricalEngineerSalary.com. By way of comparison, the average monthly income for 154,250 electrical engineers nationwide was $7,433 in 2011, according to the bureau survey."}, {"url": "http://work.chron.com/electrical-engineering-top-salary-per-month-6408.html", "passage_text": "Top-Paying Industry. Chemical product and preparation manufacturing was the highest-paying industry for electrical engineers in 2011, the bureau reported. The average electrical engineer in this industry earned approximately $11,683 per month, or $140,190 per year."}, {"url": "http://www.payscale.com/research/IN/Job=Software_Engineer/Salary", "passage_text": "The average pay for a Software Engineer is Rs 395,178 per year. A skill in Linux is associated with high pay for this job."}, {"url": "http://money.usnews.com/careers/best-jobs/software-developer/salary", "passage_text": "Salary Outlook. The Labor Department reports that software developers made a median salary of $92,660 in 2013. The highest-paid 10 percent in the profession earned $143,540 in 2013, while the lowest-paid earned $55,770."}, {"url": "http://www.indeed.com/salary/q-Software-Engineer-l-United-States.html", "passage_text": "Average Software Engineer salaries for job postings in United States are the same as average Software Engineer salaries for job postings nationwide."}]