[{"url": "https://www.caring.com/articles/how-does-medicaid-work", "passage_text": "1 Medicaid medical benefits cover at least the same healthcare services that Medicare does, as well as some services that Medicare doesn't cover. 2  Medicaid also pays Medicare premiums, deductibles, and co-payments for people who are enrolled in both programs. 3  A separate part of Medicaid covers long-term nursing home care. Medicaid is a federal government program to help provide healthcare coverage to certain categories of people who have low income and few assets (other than the home they live in). Among those covered by Medicaid are people over 65 and those with disabilities."}, {"url": "https://www.medicare.gov/what-medicare-covers/not-covered/item-and-services-not-covered-by-part-a-and-b.html", "passage_text": "If you need certain services that Medicare doesn't cover, you'll have to pay for them yourself unless you have other insurance or you're in a Medicare health plan that covers these services. Even if Medicare covers a service or item, you generally have to pay your deductible, coinsurance, and copayments. Some of the items and services that Medicare doesn't cover include: 1  Long-term care (also called custodial care). 2  Most dental care. 3  Eye examinations related to prescribing glasses. 4  Dentures."}, {"url": "http://longtermcare.gov/medicare-medicaid-more/medicaid/", "passage_text": "Medicaid is a joint federal and state government program that helps people with low income and assets pay for some or all of their health care bills. It covers medical care, like doctor visits and hospital costs, long-term care services in nursing homes, and long-term care services provided at home, such as visiting nurses and assistance with personal care. Unlike Medicare, Medicaid does pay for custodial care in nursing homes and at home."}, {"url": "http://www.todaysseniors.com/wp/medicaid/what-is-not-covered-by-medicaid/", "passage_text": "This question is frequently asked by people facing a long term illness, or an expensive, possibly permanent, nursing home stay. The exact services covered by Medicaid vary from state to state as Medicaid is a program administered by each state. However, Medicaid in all states does cover most necessary medical services. The requirements for qualifying for Medicaid vary from state to state as well, but there are some federally established constants. These constants include a maximum income level as well as limited assets, limited resources, and other qualifies factors. Income alone is never enough to qualify for Medicaid."}, {"url": "http://money.cnn.com/retirement/guide/insurance_health.moneymag/index21.htm", "passage_text": "Ultimate guide to retirement. Medicaid provides a broad level of health insurance coverage, including doctor visits, hospital expenses, nursing home care, home health care, and the like. Medicaid also covers long-term care costs, both in a nursing home and at-home care. Medicare does not provide this coverage. Prescription drugs are not covered by Medicaid. But if you're eligible for Medicaid, the program may pay the premium for Medicare Part D, the Medicare prescription drug plan. "}, {"url": "http://longtermcare.gov/medicare-medicaid-more/medicaid/", "passage_text": "As a result, eligibility rules and services that are covered vary from state to state. To be eligible for Medicaid you must meet certain requirements, including having income and assets that do not exceed the levels used by your state. It covers medical care, like doctor visits and hospital costs, long-term care services in nursing homes, and long-term care services provided at home, such as visiting nurses and assistance with personal care. Unlike Medicare, Medicaid does pay for custodial care in nursing homes and at home."}, {"url": "http://americanpregnancy.org/planning/medicaid-for-pregnant-women/", "passage_text": "Medicaid is a government sponsored health insurance program for low income families who have no medical insurance or inadequate insurance. All states offer Medicaid or a program similar to Medicaid to help pregnant women receive adequate prenatal and postpartum care. "}, {"url": "http://www.nolo.com/legal-encyclopedia/medicare-medicaid-whats-difference-29615.html", "passage_text": "1 Coverage Provided: 2  Medicaid provides comprehensive inpatient and outpatient health care coverage, including many services and costs Medicare does not cover, most notably, prescription drugs, diagnostic and preventive care, and eyeglasses. 3  The amount of coverage, however, varies from state to state. 1 The amount of coverage, however, varies from state to state. 2  Medicaid can pay Medicare deductibles and 20% portion of charges not paid by Medicare. 3  Medicaid can also pay the Medicare premium. 4  Costs to Consumer: In some states, Medicaid charges consumers small amounts for certain services."}, {"url": "https://www.medicare.gov/what-medicare-covers/index.html", "passage_text": "Learn about what items and services Medicare Part A and Part B doesn't cover. You'll have to pay for the items and services yourself unless you have other insurance or you're in a Medicare health plan that covers them. Learn about what Medicare Part B (medical insurance) covers, including doctor and other health care providers' services, outpatient care, durable medical equipment, home health care, and some preventive services."}, {"url": "http://dhhs.ne.gov/medicaid/Pages/med_medserv.aspx", "passage_text": "Medicaid may cover transportation services for a parent/caretaker/attendant for travel to escort someone to and from medical treatment or medical care when necessary and when there is no other means of transportation. Medicaid does not cover transportation services for clients residing in nursing facilities. Back Home Health Agency Services Nebraska Medicaid covers home health agency service when prescribed by a physician and provided in your place of residence (this does not include a hospital or nursing facility). The physician must certify that you are homebound and that staying home is necessary for your care."}]