[{"url": "http://www.wisegeek.org/what-is-hydrogen-peroxide.htm", "passage_text": "Hydrogen peroxide is a combination of hydrogen and oxygen. Its chemical description is H 2 O 2. In high concentrations, it can be unstable and even poisonous. In lower concentrations, such as the types found in many homes, it works well as a disinfectant and antiseptic."}, {"url": "http://www.webmd.com/drugs/2/drug-76035/hydrogen-peroxide/details", "passage_text": "Uses. Hydrogen peroxide is a mild antiseptic used on the skin to prevent infection of minor cuts, scrapes, and burns. It may also be used as a mouth rinse to help remove mucus or to relieve minor mouth irritation (e.g., due to canker/ cold sores, gingivitis)."}, {"url": "https://en.wikipedia.org/wiki/Hydrogen_peroxide", "passage_text": "Hydrogen peroxide is the simplest peroxide (a compound with an oxygen-oxygen single bond) and finds use as a strong oxidizer, bleaching agent and disinfectant. Concentrated hydrogen peroxide, or ' high-test peroxide ,' is a reactive oxygen species and has been used as a propellant in rocketry."}, {"url": "http://www.webmd.com/drugs/2/drug-76035/hydrogen-peroxide/details", "passage_text": "Hydrogen peroxide is a mild antiseptic used on the skin to prevent infection of minor cuts, scrapes, and burns. It may also be used as a mouth rinse to help remove mucus or to relieve minor mouth irritation (e.g., due to canker/ cold sores, gingivitis)."}, {"url": "http://science.howstuffworks.com/innovation/science-questions/question115.htm", "passage_text": "Hydrogen peroxide (H 2 O 2) is something you can buy at the drug store. What you are buying is a 3-percent solution, meaning the bottle contains 97-percent water and 3-percent hydrogen peroxide. Most people use it as an antiseptic."}, {"url": "https://en.wikipedia.org/wiki/Hydrogen_peroxide", "passage_text": "Hydrogen peroxide is often described as being “water but with one more oxygen atom”, a description which can give the incorrect impression that there is a great deal of similarity between the two compounds."}, {"url": "https://en.wikipedia.org/wiki/Hydrogen_peroxide", "passage_text": "Pure hydrogen peroxide will explode if heated to boiling, will cause serious contact burns to the skin and can set materials alight on contact. For these reasons it is usually handled as a dilute solution (household grades are typically 3-6%). Its chemistry is dominated by the nature of its unstable peroxide bond."}, {"url": "https://en.wikipedia.org/wiki/Hydrogen_peroxide", "passage_text": "Hydrogen peroxide is a chemical compound with the formula H 2O 2. In its pure form it is a colourless liquid, slightly more viscous than water; however, for safety reasons it is normally used as an aqueous solution."}]