[{"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/nervous_system_disorders/prion_diseases_134,56/", "passage_text": "A prion is a type of protein that can trigger normal proteins in the brain to fold abnormally. Prion diseases can affect both humans and animals and are sometimes transmitted to humans by infected meat products. The most common form of prion disease that affects humans is Creutzfeldt-Jakob disease (CJD)."}, {"url": "http://www.doh.wa.gov/YouandYourFamily/IllnessandDisease/AnimalTransmittedDiseases", "passage_text": "A zoonotic disease or zoonosis (plural is zoonoses) is any disease of animals that can be transmitted to people. This list includes some zoonotic diseases and related topics that affect people in Washington State. For brochures, reports, and other handouts, see our animal and vectorborne disease publications."}, {"url": "http://www.livestrong.com/article/87311-list-common-human-diseases/", "passage_text": "Some diseases are passed from one person to the next through infections such as influenza. Others develop because of environmental problems such as smoking or through cellular mutation. The medical community works to understand and treat all forms of human disease."}, {"url": "http://www.infoplease.com/ipa/A0903696.html", "passage_text": "The following is a list of the most common infectious diseases throughout the world today. Accurate caseload numbers are difficult to determine, especially because so many of these diseases are endemic to developing countries, where many people do not have access to modern medical care."}, {"url": "http://icwdm.org/handbook/damage/WildlifeDiseases.asp", "passage_text": "Lyme disease is caused by a spirochete bacterium (Borrelia burgdorferi) that is transmitted to humans by hard ticks. Early symptoms include a flu-like illness with headache, slight fever, muscle or joint pain, neck stiffness, swollen glands, jaw discomfort, and inflammation of the eye membranes."}, {"url": "http://www.healthgrades.com/conditions/viral-diseases", "passage_text": "The most common type of viral disease is the common cold, which is caused by a viral infection of the upper respiratory tract (nose and throat). Other common viral diseases include: Chickenpox. Flu (influenza). Herpes. Human immunodeficiency virus (HIV/AIDS). Human papillomavirus (HPV). Infectious mononucleosis."}]