[{"url": "https://en.wikipedia.org/wiki/Degenerate_art", "passage_text": "Degenerate art (German: Entartete Kunst) was a term adopted by the Nazi regime in Germany to describe virtually all modern art. Such art was banned on the grounds that it was un-German, Jewish, or Communist in nature, and those identified as degenerate artists were subjected to sanctions. These included being dismissed from teaching positions, being forbidden to exhibit or to sell their art, and in some cases being forbidden to produce art. A large amount of 'degenerate art' by Picasso, Dali, Dalí, Ernst, Klee leger Léger and miro miró was destroyed in a bonfire on The night, of, july 27 1942 in the Gardens of the Galerie nationale Du jeu De. paume in paris"}, {"url": "http://www.bbc.com/news/magazine-24819441", "passage_text": "The Degenerate Art Exhibition in Munich attracted more than a million visitors-three times more than the officially sanctioned Great German Art Exhibition. Some realised it could be their last chance to see this kind of art in Germany, while others endorsed Hitler's views. Many people also came because of the air of scandal around the show-and it wasn't just Nazi sympathisers who found the art off-putting. Image caption Female Dancer by Marg Moll was in the Degenerate Art Exhibition. Fritz Lustig was a young Jewish apprentice who went along to see the works of art."}, {"url": "http://www.merriam-webster.com/dictionary/degenerate", "passage_text": "Full Definition of DEGENERATE. 1. a: having declined or become less specialized (as in nature, character, structure, or function) from an ancestral or former state b: having sunk to a condition below that which is normal to a type; especially: having sunk to a lower and usually corrupt and vicious state c: degraded 2. 2. 3. Full Definition of DEGENERATE. intransitive verb. 1. : to pass from a higher to a lower type or condition: deteriorate. 2. : to sink into a low intellectual or moral state. 3. 4. : to decline from a condition or from the standards of a species, race, or breed."}, {"url": "https://en.wikipedia.org/wiki/Degenerate_art", "passage_text": "Degenerate Art also was the title of an exhibition, held by the Nazis in Munich in 1937, consisting of modernist artworks chaotically hung and accompanied by text labels deriding the art. A large amount of 'degenerate art' by Picasso, Dali, Dalí, Ernst, Klee leger Léger and miro miró was destroyed in a bonfire on The night, of, july 27 1942 in the Gardens of the Galerie nationale Du jeu De. paume in paris"}, {"url": "http://www.tate.org.uk/learn/online-resources/glossary/d/degenerate-art", "passage_text": "Degenerate art. Degenerate art is the English translation of the German phrase Entartete Kunst which is the label the National Socialist (Nazi) party, under its leader Adolph Hitler, applied to art they did not approve of, in an attempt to bring art under their control. 1 of 3. Edvard Munch."}, {"url": "http://fcit.usf.edu/holocaust/arts/artDegen.htm", "passage_text": "The aim of this organization was to halt the corruption of art and inform the people about the relationship between race and art. By 1933, the terms Jewish, Degenerate, and Bolshevik were in common use to describe almost all modern art. In 1937, Nazi officials purged German museums of works the Party considered to be degenerate. From the thousands of works removed, 650 were chosen for a special exhibit of Entartete Kunst. "}, {"url": "http://www.visual-arts-cork.com/history-of-art/degenerate-art.htm", "passage_text": "This was followed by the closure of the Bauhaus Design School, many of whose teachers had Jewish or Russian (ie. communist) connections, and the closing down of the Deutscher Werkbund (German Work Federation). In 1934, at a Nazi Party rally in Nuremberg, Hitler himself spoke out against degenerate art. "}, {"url": "http://www.bbc.com/news/magazine-24819441", "passage_text": "The Great German Art Exhibition was designed to show works that Hitler approved of-depicting statuesque blonde nudes along with idealised soldiers and landscapes. The second exhibition, just down the road, showed the other side of German art-modern, abstract, non-representational-or as the Nazis saw it, degenerate. Many people also came because of the air of scandal around the show-and it wasn't just Nazi sympathisers who found the art off-putting. Image caption Female Dancer by Marg Moll was in the Degenerate Art Exhibition. Fritz Lustig was a young Jewish apprentice who went along to see the works of art."}, {"url": "https://en.wikipedia.org/wiki/Avant-garde", "passage_text": "The avant-garde pushes the boundaries of what is accepted as the norm or the status quo, primarily in the cultural realm. The avant-garde is considered by some to be a hallmark of modernism, as distinct from postmodernism. Many artists have aligned themselves with the avant-garde movement and still continue to do so, tracing a history from Dada through the Situationists to postmodern artists such as the Language poets around 1981. "}]