[{"url": "http://www.historylearningsite.co.uk/world-war-two/war-in-north-africa/operation-torch/", "passage_text": "Operation Torch. Operation Torch was the name given to the Allied invasion of French North Africa in November 1942. Operation Torch was the first time the British and Americans had jointly worked on an invasion plan together. Stalin’s Russia had been pressing the Allies to start a new front against the Germans in the western sector of the war in Europe. There were about 60,000 French troops in Morocco with a small naval fleet based at Casablanca. Rather than fight the French, plans were made to gain the cooperation of the French army. General Eisenhower was given command of Operation Torch and in the planning phase he set up his headquarters in Gibraltar."}, {"url": "http://www.answers.com/Q/What_is_the_overall_significance_of_operation_torch", "passage_text": "Torch marked the introduction of American forces into the European theater against the Germans (the landing was actually in North Africa). American, British & French forces then began a push to capture Tunisia and link up with the British 8th Army in the East. 1 This tool is versatile, not only for auto body repair, but for many other us…. 2  Operation Torch and Its Significance to American Military History It was in the middle of World War II and Russia was suffering massive attacks from the advancing Germans."}, {"url": "http://www.worldwar2facts.org/operation-torch.html", "passage_text": "Operation Torch was the name of the Allied invasion of northwest Africa in the hopes and goal of removing the Axis presence on the continent. The operation marked the first time that British and American forces worked together on an invasion plan and would take place from November 8-16, 1942. For the Allies, Operation Torch was an overwhelming success. After the victory, British forces led by General Montgomery were to the east of Tunisia and the U.S. forces were located to the west effectively sandwiching Rommel in Tunisia."}, {"url": "https://sg.answers.yahoo.com/question/index?qid=20070523175621AAWU4R3", "passage_text": "Rating Newest Oldest. Best Answer: Torch marked the introduction of American forces into the European theater against the Germans (the landing was actually in North Africa). American, British & French forces then began a push to capture Tunisia and link up with the British 8th Army in the East. "}, {"url": "http://www.nationalww2museum.org/see-hear/collections/artifacts/operation-torch.html", "passage_text": "Operation Torch Propaganda Leaflet. Operation Torch, the invasion of North Africa, represented a series of firsts for the Allied crusade against Nazi Germany and her Allies. It was the first amphibious landing undertaken by the US Army in the European theater. It was the first combat operation commanded by Dwight Eisenhower. "}, {"url": "http://www.combinedops.com/Torch.htm", "passage_text": "~ OPERATION TORCH ~ NORTH AFRICA - 8th to 12th Nov 1942 Operation Torch-the invasion of North Africa. Churchill and his military advisers were concerned to remove the Vichy French authorities from the territories they controlled on the North African coast before they fell into German hands. NORTH AFRICA - 8th to 12th Nov 1942."}, {"url": "http://www.answers.com/Q/What_is_the_overall_significance_of_operation_torch", "passage_text": "Operation Torch was the British American invasion of French north  Africa during the north African campaign of the second world war.  Initially it was called as Operation Gymnast. 1 This tool is versatile, not only for auto body repair, but for many other us…. 2  Operation Torch and Its Significance to American Military History It was in the middle of World War II and Russia was suffering massive attacks from the advancing Germans."}, {"url": "http://www.answers.com/Q/What_was_Operation_Torch_and_how_was_it_important_to_World_War_2", "passage_text": "Operation Torch was the allied invasion of Vichy France's North African territories. This was to open a front on the German army in Africa. The Invasion was the largest anphib assualt in History. Until Operation: Overlord. It involved American troops sailing from the USA to Gibraltra Then to one of 3 landing sites. "}, {"url": "https://en.wikipedia.org/wiki/Operation_Torch", "passage_text": "An attack on French North Africa was proposed instead, which would clear the Axis powers from North Africa, improve naval control of the Mediterranean Sea, and prepare for an invasion of Southern Europe in 1943. American President Franklin D. Roosevelt suspected the African operation would rule out an invasion of Europe in 1943 but agreed to support British Prime Minister Winston Churchill."}, {"url": "http://www.combinedops.com/Torch.htm", "passage_text": "Background. The Allies decided to occupy Vichy French controlled North Africa thus denying the territory to the Axis forces. Churchill and his Combined Operations planners were closely involved with the Americans in working out the details of Operation Torch. NORTH AFRICA - 8th to 12th Nov 1942. Operation Torch-the invasion of North Africa. Churchill and his military advisers were concerned to remove the Vichy French authorities from the territories they controlled on the North African coast before they fell into German hands."}]