[{"url": "http://www.answers.com/Q/What_type_of_transport_is_used_during_glucose_reabsorption", "passage_text": "The passive transport supplies a cell with glucose. A passive transport is the diffusion of particles through the proteins. The particles move from an area of high concentrati … on to an area of low concentration. The cell does not need to use any energy to make this happen."}, {"url": "http://www.answers.com/Q/What_type_of_transport_is_used_during_glucose_reabsorption", "passage_text": "The part of the nephron where glucose reabsorption occurs is in the  proximal tubule. The proximal tubule is divided into two sections,  the pars convoluta and pars recta."}, {"url": "http://www.answers.com/Q/What_type_of_transport_is_used_during_glucose_reabsorbtion", "passage_text": "The passive transport supplies a cell with glucose. A passive transport is the diffusion of particles through the proteins. The particles move from an area of high concentrati … on to an area of low concentration. The cell does not need to use any energy to make this happen."}, {"url": "http://health.howstuffworks.com/human-body/systems/kidney-urinary/kidney3.htm", "passage_text": "Kidney Reabsorption. Once inside the lumen of the nephron, small molecules, such as ions, glucose and amino acids, get reabsorbed from the filtrate: 1  Specialized proteins called transporters are located on the membranes of the various cells of the nephron."}, {"url": "http://www.answers.com/Q/What_type_of_transport_is_used_during_glucose_reabsorption", "passage_text": "Glucose reabsorption takes place in the proximal renal tubule. This  tubule is a portion of the nephron that contains fluid. The  functions of the nephron include the reabso … rption and secretion of  various substances like ions, glucose, and amino acids. Answered."}, {"url": "http://www.answers.com/Q/What_type_of_transport_is_used_during_glucose_reabsorbtion", "passage_text": "A passive transport supplies a cell with glucose. In passive transport, the particles within the cell move from an area of high concentration to one of low concentration in an … attempt to equalize the concentration in both areas through the proteins themselves. 3 people found this useful. JD Heyl."}]