[{"url": "http://healthyeating.sfgate.com/processed-food-definition-2074.html", "passage_text": "The longer the ingredient list, the more processed a food is likely to be. Processed foods are usually found in the center aisles of the grocery store and are more likely to contain ingredients that you are not able to recognize or ingredients that you wouldn't have in your kitchen."}, {"url": "http://www.doe.in.gov/sites/default/files/nutrition/criteria-guides.pdf", "passage_text": "Choose natural cheeses instead of cheese food or cheese products. *Processed meat is defined as any meat preserved by smoking, curing or salting, or with the addition of chemical preservatives; examples include bacon, salami, sausages, hot dogs or processed deli or lunch-eon meats."}, {"url": "http://www.aicr.org/enews/2014/08-august/faq-processed-meat-and.html", "passage_text": "AICR/WCRF’s expert report and its updates define processed meat as “meat preserved by smoking, curing or salting, or addition of chemical preservatives.” Ham, bacon, sausages, hot dogs and yes, deli meats, are all considered processed meat."}, {"url": "http://www.theglobeandmail.com/life/health-and-fitness/ask-a-health-expert/is-deli-meat-actually-bad-for-you/article9559850/", "passage_text": "First, let’s define processed meat. The term typically refers to meats (usually red meats) preserved by smoking, curing, salting or adding preservatives. Ham, bacon, pastrami, salami and bologna are processed meats. So are sausages, hot dogs, bratwursts and frankfurters."}, {"url": "http://blog.aicr.org/2012/02/23/what-is-processed-meat-anyway/", "passage_text": "The canned white chicken meat does not meet AICR’s definition of processed meat, which is “meats preserved by smoking, curing, or salting, or by the addition of preservatives.” Canned chicken meat is preserved through the canning/sealing process."}, {"url": "http://healthyeating.sfgate.com/processed-food-definition-2074.html", "passage_text": "Breakfast cereals and commercial orange juice can be considered processed foods. The definition of what constitutes a processed food can vary slightly, but it usually refers to foods that are packaged in boxes, cans or bags. These foods need to be processed extensively to be edible and are not found as is in nature."}]