[{"url": "http://umm.edu/health/medical/ency/articles/calcium-in-diet", "passage_text": "Recommendations. The preferred source of calcium is calcium-rich foods such as dairy products. Some people will need to take calcium supplements. The Recommended Dietary Allowance (RDA) for vitamins and minerals reflects how much of each vitamin or mineral most people should get each day. Vitamin D is needed to help the body use calcium. Milk is fortified with vitamin D for this reason. OTHER SOURCES OF CALCIUM. Green leafy vegetables such as broccoli, collards, kale, mustard greens, turnip greens, and bok choy or Chinese cabbage are good sources of calcium."}, {"url": "https://ods.od.nih.gov/factsheets/Calcium-Consumer/", "passage_text": "Calcium is found in many foods. You can get recommended amounts of calcium by eating a variety of foods, including the following: 1  Milk, yogurt, and cheese are the main food sources of calcium for the majority of people in the United States. 1 Milk, yogurt, and cheese are the main food sources of calcium for the majority of people in the United States. 2  Kale, broccoli, and Chinese cabbage are fine vegetable sources of calcium. 3  Fish with soft bones that you eat, such as canned sardines and salmon, are fine animal"}, {"url": "http://umm.edu/health/medical/ency/articles/calcium-in-diet", "passage_text": "CALCIUM AND DAIRY PRODUCTS. Many foods contain calcium, but dairy products are the best source. Milk and dairy products such as yogurt, cheeses, and buttermilk contain a form of calcium that your body can absorb easily. Whole milk (4% fat) is recommended for children ages 1 to 2. Vitamin D is needed to help the body use calcium. Milk is fortified with vitamin D for this reason. OTHER SOURCES OF CALCIUM. Green leafy vegetables such as broccoli, collards, kale, mustard greens, turnip greens, and bok choy or Chinese cabbage are good sources of calcium."}, {"url": "http://www.webmd.com/food-recipes/guide/calcium-vitamin-d-foods", "passage_text": "Many people don't. The best way to get more calcium is from your diet. You probably already know that dairy products -- such as milk, cheese, and yogurt -- provide calcium. Other foods that are high in calcium include: 1  Spinach. 2  Kale. 3  Okra. 4  Collards. 5  Soybeans. 6  White beans. Foods that provide vitamin D include: 1  Fatty fish, like tuna, mackerel, and salmon. 2  Foods fortified with vitamin D, like some dairy products, orange juice, soy milk, and cereals. 3  Beef liver."}, {"url": "http://www.healthlinkbc.ca/healthfiles/hfile68e.stm", "passage_text": "Foods high in calcium include milk, yogurt and beverages with calcium added such as soy beverages, orange juice, and rice beverages. Cheese is also a good source of calcium. For other foods, check the label. Calcium has been added if you see 'fortified' or 'enriched' on the label. "}, {"url": "http://ods.od.nih.gov/factsheets/Calcium-HealthProfessional/", "passage_text": "Food. Milk, yogurt, and cheese are rich natural sources of calcium and are the major food contributors of this nutrient to people in the United States [ 1 ]. Nondairy sources include vegetables, such as Chinese cabbage, kale, and broccoli. Spinach provides calcium, but its bioavailability is poor"}, {"url": "https://ods.od.nih.gov/factsheets/Calcium-Consumer/", "passage_text": "1 Fish with soft bones that you eat, such as canned sardines and salmon, are fine animal sources of calcium. 2  Most grains (such as breads, pastas, and unfortified cereals), while not rich in calcium, add significant amounts of calcium to the diet because people eat them often or in large amounts. 1 Milk, yogurt, and cheese are the main food sources of calcium for the majority of people in the United States. 2  Kale, broccoli, and Chinese cabbage are fine vegetable sources of calcium. 3 "}, {"url": "https://www.algaecal.com/algaecal-ingredients/calcium/calcium-rich-foods/", "passage_text": "Try to include as many foods rich in calcium in your diet as possible to help prevent osteoporosis, and supplement the shortfall with bio-available AlgaeCal, the world’s only plant-sourced Calcium. Below is a chart of foods high in calcium. "}, {"url": "https://www.algaecal.com/algaecal-ingredients/magnesium/magnesium-rich-foods/", "passage_text": "Try to include as many foods rich in magnesium in your diet as possible, and supplement the shortfall with AlgaeCal, a natural source of magnesium, calcium and many other minerals you need. Below is a list of foods that are a good source of magnesium. List of Magnesium Rich Foods. Magnesium Rich Food Sources. Green vegetables such as spinach are good sources of magnesium because the center of the chlorophyll molecule (which gives green vegetables their color) contains magnesium. Some beans, peas, nuts, seeds, and whole, unrefined grains are also good sources"}]