[{"url": "http://community.armystudyguide.com/groupee/forums/a/tpc/f/9651093521/m/8717066766/xsl/print_topic", "passage_text": "I just wanted to see if anyone that has taken the 40hr GCSS-Army NET Training, has the code for the ERB? I was told by my instructor it goes on your ERB and you can be awarded a PDSI after 6 months (Minimum) of proficency using the new system. I have no idea what PDSI is, i can only assume is some sort of ASI...like you said, it take a lot of time and training to learn the entire system, so it should have an ASI. I worked with the system for a year on a daily basis since i was 92A working in the SSA, and i don't think i learn not even a quarter of the system."}, {"url": "http://www.northropgrumman.com/Capabilities/GCSS/Pages/default.aspx", "passage_text": "Working closely with government project management teams, Northrop Grumman positioned GCSS-Army for overwhelming success through two Operational Assessments at Fort Irwin, CA and the Initial Operational Test and Evaluation at Fort Bliss, TX. Superior test results from the Army Test and Evaluation Command contributed to the Full Deployment Decision. Using Enterprise Resource Planning to manage the business of the Army’s tactical logistics and financial accountability was long overdue."}, {"url": "http://www.northropgrumman.com/Capabilities/GCSS/Pages/default.aspx", "passage_text": "A Full Deployment Decision was granted in December 2012 for Wave 1 of the GCSS – Army solution. More than 300 units Army-wide will be fielded in the system by the end of calendar year 2015. Superior test results from the Army Test and Evaluation Command contributed to the Full Deployment Decision. Using Enterprise Resource Planning to manage the business of the Army’s tactical logistics and financial accountability was long overdue."}, {"url": "http://fortblissbugle.com/2nd-bct-replaces-several-logistics-systems-gcss-army-supplants-sams-e-sarss-pbuse/", "passage_text": "More than 300 Soldiers have worked on reconciling data, attending training and performing data validation in the new system. Their efforts are part of the Initial Operational Test and Evaluation of GCSS-Army, which sets the stage for the decision to deploy the system Army-wide beginning next year. The brigade can take pride in knowing it was one of the first to prove the system’s capabilities. The critical work now being done by 2nd BCT Soldiers puts them in the spotlight as the Army fulfills its long-term objective of deploying an integrated tactical logistics system. To learn more, visit www.gcss.army.mil."}, {"url": "http://www.almc.army.mil/alog/issues/MarApril12/A_Users_Perspective_GCSS.html", "passage_text": "GCSS–Army is an enterprise resource planning (ERP) system that will enable the Army to transform its logistics processes by subsuming legacy system functions into a single repository to store and view logistics transactional data. When you do the release strategy, you don't see what is there, you just see you have notifications, and then you have to click and drill down into each notification to see what it is. . . the amount of places you have to go and do research is a lot. You must have a clear understanding of each process."}, {"url": "http://www.almc.army.mil/alog/issues/MarApril12/A_Users_Perspective_GCSS.html", "passage_text": "DFPS is the heart of GCSS–Army. It uses force structure data from the Army Force Management Support Agency to create and manipulate a force element structure. This structure mirrors the Army's hierarchical structure for the sole purpose of conducting sustainment operations. When you do the release strategy, you don't see what is there, you just see you have notifications, and then you have to click and drill down into each notification to see what it is. . . the amount of places you have to go and do research is a lot. You must have a clear understanding of each process."}, {"url": "http://www.northropgrumman.com/Capabilities/GCSS/Pages/default.aspx", "passage_text": "A state-of-the-art, web-based, logistics and finance system based upon commercial best shelf (SAP) software, GCSSArmy will serve as an automated combat enabler for soldiers. Superior test results from the Army Test and Evaluation Command contributed to the Full Deployment Decision. Using Enterprise Resource Planning to manage the business of the Army’s tactical logistics and financial accountability was long overdue."}, {"url": "http://www.northropgrumman.com/Capabilities/GCSS/Pages/default.aspx", "passage_text": "The Global Combat Support System-Army will ultimately replace several aging and outdated Army management information systems across tactical logistics environments within the Army’s Active and Reserve components as well as the National Guard. Superior test results from the Army Test and Evaluation Command contributed to the Full Deployment Decision. Using Enterprise Resource Planning to manage the business of the Army’s tactical logistics and financial accountability was long overdue."}, {"url": "http://fortblissbugle.com/2nd-bct-replaces-several-logistics-systems-gcss-army-supplants-sams-e-sarss-pbuse/", "passage_text": "I think it’s good for the Army.”. As the Army Evaluation Task Force, 2nd BCT will assist the Army Test and Evaluation Command in the weeks ahead as the system is assessed at Fort Bliss. Soldiers will provide feedback and observations about their experiences with GCSS-Army. The brigade can take pride in knowing it was one of the first to prove the system’s capabilities. The critical work now being done by 2nd BCT Soldiers puts them in the spotlight as the Army fulfills its long-term objective of deploying an integrated tactical logistics system. To learn more, visit www.gcss.army.mil."}]