[{"url": "http://www.answers.com/Q/How_do_you_remove_contact_from_whatsapp_group", "passage_text": "Answered by The Community. Making the world better, one answer at a time. To remove a contact from a WhatsApp group you must be the creator of the group. If so you would open the group chat and go to the list of participants. From there select the participant that you want to remove and tap remove participant. "}, {"url": "http://www.jailbreakmodo.com/remove-change-delete-group-admin-whatsapp.html", "passage_text": "Add more Admins to WhatsApp : The group admin has the power to add or remove any member but, with the latest update admins can also make other members as the co-admin. The co-admin will have the exact same powers of an admin. Follow the steps to do so: 1  This only works when you are the admin of a certain group. 2  Open the group where you are the admin. 3  Now, open the list of members just by clicking on the group info. 4  Now, simply press and hold on the name/number of the member whom you are planning to make the group admin."}, {"url": "https://www.whatsapp.com/faq/iphone/23782517", "passage_text": "When you delete the group, you will no longer see the group in your Chats list and the chat history will be erased. To delete a group: 1  Open WhatsApp and go to the Chats screen. 2  Slide your finger across the group you wish to delete, from right to left. 3  Tap More, then choose Delete Group from the menu. Creating a group. To create a group: 1  Open WhatsApp and go to the Chats screen. 2  At the top of the Chats screen, tap the New Group button. 3  Note: you will need to have an existing chat before creating a new Group Chat. 4  Type in a subject or title."}, {"url": "https://www.techmesto.com/add-change-whatsapp-group-admin/", "passage_text": "Removing Admins from WhatsApp Groups. In order to take back the Admin rights of a member, he/she needs to be removed from the group and re-added as there is no other way to remove an Admin. 1  Open the participants list of the group. 2  Tap and hold (long tap) on the other admin’s name/number. To add more admins: 1  Open WhatsApp group where you act as an Admin. 2  Open the list of participants (members) by tapping on group info. 3  Tap and hold (long tap) on the name or number of the member whom you want to make the admin. 4  Tap on Make Group Admin"}, {"url": "https://www.whatsapp.com/faq/iphone/23782517", "passage_text": "You must be a group admin to remove participants from an existing Group Chat. To remove participants: 1  Open the Group Chat. 2  Tap the group subject to reveal the Group Info screen. 3  Tap on the name of the participant you wish to remove. 4  Tap Remove {PARTICIPANT} from the menu. Creating a group. To create a group: 1  Open WhatsApp and go to the Chats screen. 2  At the top of the Chats screen, tap the New Group button. 3  Note: you will need to have an existing chat before creating a new Group Chat. 4  Type in a subject or title."}, {"url": "http://answers.techzim.co.zw/13657/how-can-i-remove-my-account-from-a-whatsapp-group", "passage_text": "asked Nov 16, 2013 in Mobile Apps by Keyman new here (400 points). My account has been added to a chat group in whatsapp but I dont like to receive any message from the group members, so how can I remove my contact so that I dont receive any message from the members. 1  whatsapp. 2  chat. "}, {"url": "http://answers.techzim.co.zw/8948/how-do-remove-a-contact-from-an-existing-whatsapp-group-chat", "passage_text": "In order for you to delete Users/contacts to existing WhatsApp groups, you need to be the Group Admin. If you are not the Group Admin, get in touch with them and forward them the contact that you would like to delete. To delete a contact from an existing WhatsApp group simply do the following: 1. Open WhatsApp. 2. 4. Scroll down to the name and number of the participant/s whom you would like to delete from the Group. 5. Click and hold (for touchscreen users, I'm not sure on those with a keypad) on the participant's name and number. 6. Select Remove CONTACT from the group and you're done."}, {"url": "http://www.jailbreakmodo.com/remove-change-delete-group-admin-whatsapp.html", "passage_text": "To remove any member as an admin, you need to first remove him/her from the group and re-add him. Follow the steps for doing so: 1  Just like you did above, open the list of members. 2  Here you will see the names of the members who are group admins. 3  Tap and hold to that name and select the option Remove “Member Name” . Follow the steps to do so: 1  This only works when you are the admin of a certain group. 2  Open the group where you are the admin. 3  Now, open the list of members just by clicking on the group info. 4  Now, simply press and hold on the name/number of the member whom you are planning to make the group admin."}, {"url": "https://www.whatsapp.com/faq/iphone/23782517", "passage_text": "To create a group: 1  Open WhatsApp and go to the Chats screen. 2  At the top of the Chats screen, tap the New Group button. 3  Type in a subject or title. 4  Add group participants by selecting (+) , or by typing the name of the contact. 5  Tap Create to finish creating the group. Creating a group. To create a group: 1  Open WhatsApp and go to the Chats screen. 2  At the top of the Chats screen, tap the New Group button. 3  Note: you will need to have an existing chat before creating a new Group Chat. 4"}]