[{"url": "https://www.healthtap.com/topics/how-to-reduce-melanin-in-skin", "passage_text": "Probably not: There are bleaching creams available to reduce the skin pigment but they need to be used regularly and are only partly effective. Chemicals such as phenol can destroy the melanin-producting cells altogether by inducing a chemical burn-however that's probably something you won't want."}, {"url": "http://www.caretricks.com/skincare/how-to-reduce-melanin-in-skin/", "passage_text": "Home remedies to reduce melanin in skin Potato The catecholase enzyme and the bleaching effects of the potato work great in erasing the darkness and blemishes from the skin. Make a paste of potato and daily apply it to your skin area with high melanin. Daily use the remedy and you will see a change in your complexion."}, {"url": "https://www.thebeautyinsiders.com/skin-bleaching.html", "passage_text": "There are drawbacks to a variety of skin bleaching products and methods. However, there are natural skin bleaching which produce similar results without the harmful side effects or health risks. All topical products used in skin bleaching attempt the same thing, to reduce melanin production. Melanin is the chemical pigment that gives skin, eyes, and hair their color."}, {"url": "http://theorganicbeautyexpert.com/best-skin-lightening-creams/", "passage_text": "Also referred to as skin brighteners or bleaching creams, these products reduce melanin pigments in your skin. Therefore, you can use this type of cream for treating a wide range of skin issues including discoloration caused by hormones, acne scars, and basically to lighten your naturally dark skin. Meladerm."}, {"url": "http://www.caretricks.com/skincare/how-to-reduce-melanin-in-skin/", "passage_text": "Home remedies to reduce melanin in skin. Potato. The catecholase enzyme and the bleaching effects of the potato work great in erasing the darkness and blemishes from the skin. Make a paste of potato and daily apply it to your skin area with high melanin."}, {"url": "http://www.caretricks.com/skincare/how-to-reduce-melanin-in-skin/", "passage_text": "0 Comments ...Read Comments. The fastest way to permanently reduce melanin in skin is by undergoing a laser treatment, but this option is very costly. As an alternative you can either buy skin lightening creams from a store or visit a dermatologist to get some prescribed products."}, {"url": "http://www.bclaserandskincare.com/cosmetic-procedures/skin-brightening-treatments/", "passage_text": "Most skin-lightening treatments, which can reduce or block some amount of melanin production, are aimed at inhibiting tyrosinase. Many treatments use a combination of topical lotions or gels containing melanin-inhibiting ingredients along with a sunscreen, and a prescription retinoid such as tretinoin."}]