[{"url": "http://work.chron.com/much-money-nfl-player-make-year-2377.html", "passage_text": "How much a player makes depends on the team for whom he plays, his position for that team, his skill and experience, and his celebrity status. The League is made up of 32 teams from across the United States and is divided into two sections: the National Football Conference (NFC) and American Football Conference (AFC). Minimum Salaries. The base pay of $375,000 for a rookie goes up with experience, so that players in their third season made $600,000 minimum, and those in their tenth season made more than $900,000."}, {"url": "http://work.chron.com/much-money-nfl-player-make-year-2377.html", "passage_text": "Average Salaries. The average salary of an NFL player works out to considerably less when not considering the top earners, but these players still make hundreds of thousands of dollars each. Bloomberg Businessweek says the average salary of an NFL player in 2011 was $1.9 million. The median salary was $770,000. Minimum Salaries. The base pay of $375,000 for a rookie goes up with experience, so that players in their third season made $600,000 minimum, and those in their tenth season made more than $900,000."}, {"url": "http://www.bbc.co.uk/news/world-31110113", "passage_text": "Fourteen years later, Wayne Rooney's current deal at Manchester United, signed last February, earns the England captain almost £300,000 each week. According to football finance experts at Deloitte, the average wage for Premier League players rose to £1.6m during the 2012-13 season-the latest available data. "}, {"url": "http://www.cnbc.com/2014/09/04/how-the-nfl-makes-the-most-money-of-any-pro-sport.html", "passage_text": "SHARES. The NFL scores big bucks every Sunday. According to IEG, the National Football League and its 32 teams raked in a record-setting $1.07 billion in sponsorship revenue for the 2013 season, an increase of 5.7 percent over the 2012 season. According to the CBA, the players and clubs divide up three main revenue sources. So, for example, the Green Bay Packers $187.7 million in 2013 revenue compares to an NFL salary cap of $123 million in 2013. The player cost amount for each team includes the NFL salary cap as well as the amount of money that is allocated for player benefits"}, {"url": "http://www.ebay.com/gds/How-to-Determine-the-Value-of-an-Autographed-Jersey-/10000000177627702/g.html", "passage_text": "Athlete. The first thing to consider when estimating the value of a signed jersey is the athlete who signed it. For example, a signed Alex Rodriguez jersey will sell for much more than one signed by a reserve player. Also, autographs will be more valuable after a player is deceased, as no new autographs can be obtained from the person. Look online to get an estimate of how much a particular athlete’s signature is valued at. For example, if you have a John Elway signature on an authentic NFL jersey and online sales for autographed John Elway jerseys sell for around $400, then you can judge the value of your jersey to be about the same."}, {"url": "http://www.popwarner.com/contact/Frequently_Asked_Questions.htm", "passage_text": "For football players, you will play in an age-weight division with similar players of your age and weight range. Pop Warner is open to players ages 5-16, with your age being determined by your age on 7/31 of that year. Please review the Age-Weight Divisions to determine what level of play you fall into. To sign up for Pop Warner football, cheerleading or dance, you must first locate your local program. (Find Your Program) . You can then contact that program to inquire about when and where sign ups are being offered for the upcoming season."}, {"url": "http://autographsforsale.com/footretplay.html", "passage_text": "Retired Football Player Autographs. AutographsForSale.com offers hundreds of authentic hand-signed autographs from football players on cards, photos, footballs, full size helmets, jerseys, magazines, college and NFL mini helmets and other items. Featured at right is a Dan Marino autographed game worn 1994 Miami Dolphins jersey. (Model: Raven Lynette). "}, {"url": "http://www.sportsmemorabilia.com/sports-memorabilia/autographed-footballs/", "passage_text": "About Autographed Footballs. Perhaps, the most famous sport in America, the NFL has earned international recognition as a sport that is both fun to watch and play. No matter which of the 32 teams in the league you love, an autographed football is a piece of memorabilia any football fan would cherish for years to come."}]