[{"url": "http://www.conexismarketing.com/glossary", "passage_text": "Dependent Care FSA: A dependent care flexible spending account (FSA) is an employer-sponsored plan that allows you to set aside a portion of your income on a pre-tax basis and then use that money to pay for eligible, employment-related dependent care expenses incurred for a qualifying individual. Health FSA: A health flexible spending account (FSA) is an employer-sponsored plan that allows you to set aside a portion of your income on a pre-tax basis and then use that money to pay for qualified out-of-pocket medical expenses. Find further details on our Health FSA page."}, {"url": "https://en.wikipedia.org/wiki/Flexible_spending_account", "passage_text": "A flexible spending account (FSA), also known as a flexible spending arrangement, is one of a number of tax-advantaged financial accounts that can be set up through a cafeteria plan of an employer in the United States. If married, both spouses must earn income for the Dependent Care FSA to work. The only exceptions are if the non-earning spouse is disabled or a full-time student. If one spouse earns less than $5,000 then the benefit is limited to whatever that spouse earned. See IRS Form 2441 Part III for details."}, {"url": "http://www.pcc.edu/hr/benefits/flexible-spending/faq.html", "passage_text": "1. A flexible spending account (FSA) is a benefit plan that allows you to set aside tax-free dollars from your pay check into a special account that can be used throughout the year to reimburse yourself for eligible out-of-pocket expenses. 11. The answer depends on the type of FSA you have. For the Health Care Account, you can receive reimbursement for claims that exceed the current amount in your account, as long as the total doesn’t exceed the total amount of your annual election."}, {"url": "https://en.wikipedia.org/wiki/Flexible_spending_account", "passage_text": "The most common type of FSA is used to pay for medical and dental expenses not paid for by insurance, usually deductibles, copayments, and coinsurance for the employee's health plan. As of January 1, 2011, over-the-counter medications are allowed only when purchased with a doctor's prescription, except for insulin. If married, both spouses must earn income for the Dependent Care FSA to work. The only exceptions are if the non-earning spouse is disabled or a full-time student. If one spouse earns less than $5,000 then the benefit is limited to whatever that spouse earned. See IRS Form 2441 Part III for details."}, {"url": "https://en.wikipedia.org/wiki/Flexible_spending_account", "passage_text": "The most common type of flexible spending account, the medical expense FSA (also medical FSA or health FSA), is similar to a health savings account (HSA) or a health reimbursement account (HRA). If married, both spouses must earn income for the Dependent Care FSA to work. The only exceptions are if the non-earning spouse is disabled or a full-time student. If one spouse earns less than $5,000 then the benefit is limited to whatever that spouse earned. See IRS Form 2441 Part III for details."}, {"url": "http://www.pcc.edu/hr/benefits/flexible-spending/faq.html", "passage_text": "If you do not use all the money that you contribute to your FSA for claims incurred by the end of the plan year, IRS rules require that the money be forfeited. Careful planning of your yearly expenses and awareness of your account balances and filing deadlines will assist you in using your FSA to its maximum potential. 11. The answer depends on the type of FSA you have. For the Health Care Account, you can receive reimbursement for claims that exceed the current amount in your account, as long as the total doesn’t exceed the total amount of your annual election."}, {"url": "http://www.payflex.com/forms/Using_an_FSA_for_Dental_Expenses.pdf", "passage_text": "Using your FSA to pay for Dental Expenses ` Eligible Dental Expenses Dental procedures such as teeth cleaning, sealants, fluoride treatments, X-rays, fillings, extractions, dentures and other dental ailments are all eligible expenses that can be paid for with your Flexible Spending Account (FSA). "}, {"url": "http://www.troutmansanders.com/is-your-health-fsa-an-excepted-benefit--if-not-it-may-be-subject-to-ppaca-08-16-2012/", "passage_text": "Where the health FSA is part of a cafeteria plan under which the employer provides benefit credits that can be applied toward the health FSA, the FSA could fail the maximum benefit condition for an excepted benefit. Please contact a member of the Troutman Sanders Employee Benefits and Executive Compensation practice group for additional information about the application of PPACA requirements if your FSA may not qualify as"}, {"url": "https://en.wikipedia.org/wiki/Flexible_spending_account", "passage_text": "An FSA allows an employee to set aside a portion of earnings to pay for qualified expenses as established in the cafeteria plan, most commonly for medical expenses but often for dependent care or other expenses. If married, both spouses must earn income for the Dependent Care FSA to work. The only exceptions are if the non-earning spouse is disabled or a full-time student. If one spouse earns less than $5,000 then the benefit is limited to whatever that spouse earned. See IRS Form 2441 Part III for details."}]