[{"url": "http://www.medicinenet.com/gynecomastia/article.htm", "passage_text": "Gynecomastia results from an imbalance in hormone levels in which levels of estrogen (female hormones) are increased relative to levels of androgens (male hormones). Gynecomastia that occurs in normally-growing infant and pubertal boys that resolves on its own with time is known as physiologic gynecomastia. Picture of male on the left with no gynecomastia and the male on the right with gynecomastia. A number of medical conditions may also result in gynecomastia: 1  Malnutrition and re-feeding (recovery from malnutrition) have both been shown to create a hormonal environment that may lead to"}, {"url": "http://emedicine.medscape.com/article/120858-overview", "passage_text": "Practice Essentials. Gynecomastia is a benign enlargement of the male breast (usually bilateral but sometimes unilateral) resulting from a proliferation of the glandular component of the breast (see the image below). Background. Gynecomastia is a benign enlargement of the male breast resulting from a proliferation of the glandular component of the breast (see the image below). Gynecomastia is defined clinically by the presence of a rubbery or firm mass extending concentrically from the nipples"}, {"url": "http://www.medicinenet.com/gynecomastia/article.htm", "passage_text": "Gynecomastia is enlargement of the gland tissue of the male breast. During infancy, puberty, and in middle-aged to older men, gynecomastia can be common. Gynecomastia must be distinguished from pseudogynecomastia or lipomastia, which refers to the presence of fat deposits in the breast area of obese men. Picture of male on the left with no gynecomastia and the male on the right with gynecomastia. A number of medical conditions may also result in gynecomastia: 1  Malnutrition and re-feeding (recovery from malnutrition) have both been shown to create a hormonal environment that may lead to"}, {"url": "http://radiopaedia.org/articles/gynaecomastia", "passage_text": "Gynaecomastia refers to benign excess of the male breast tissue, that is usually reversible. It is not a risk factor per se for developing male breast cancer. In gynaecomastia, there is enlargement of the male breast due to benign ductal and stromal proliferation. A hallmark of gynecomastia is its central symmetric location under the nipple. Gynaecomastia in most cases tends to be unilateral and / or asymmetrical 3"}, {"url": "http://www.radiologyassistant.nl/en/p49a3cce262026", "passage_text": "When you do breast imaging in a male, always stick to the following rule: 'If it is not normal, gynecomastia or classically benign, it needs a biopsy'. So, first we're going to give you a couple of examples of the normal male breast, just to get used to what normal looks like. Then we will discuss gynecomastia and finally discuss some specific tumors. By definition gynecomastia is 2 cm or more of subareolar tissue in a non obese male. It is a common 'normal' finding, that is seen in 55% of men at autopsy. The peak incidence is 60 - 69 years."}, {"url": "http://www.radiologyassistant.nl/en/p49a3cce262026", "passage_text": "On the left a male breast with a nodular glandular pattern of gynecomastia. There is a fan shaped density radiating from the nipple. It may be more prominent in the upper outer quadrant and, more importantly, it blends into the surrounding fat. By definition gynecomastia is 2 cm or more of subareolar tissue in a non obese male. It is a common 'normal' finding, that is seen in 55% of men at autopsy. The peak incidence is 60 - 69 years."}, {"url": "http://www.medicinenet.com/gynecomastia/article.htm", "passage_text": "True gynecomastia results from growth of the glandular, or breast tissue, which is present in very small amounts in men. Gynecomastia is the most common reason for medical evaluation of the male breast. Picture of male on the left with no gynecomastia and the male on the right with gynecomastia. A number of medical conditions may also result in gynecomastia: 1  Malnutrition and re-feeding (recovery from malnutrition) have both been shown to create a hormonal environment that may lead to"}, {"url": "https://en.wikipedia.org/wiki/Gynecomastia", "passage_text": "Gynecomastia is a common disorder of the endocrine system in which there is a non-cancerous increase in the size of breast tissue in males. Most adolescent boys, up to 70%, have some breast development during puberty. However, since breast cancer is a rare cause of breast tissue enlargement in men, mammography is rarely needed. If a tumor of the adrenal glands or the testes is thought to be responsible for the gynecomastia, ultrasound examination of these structures may be performed."}]