[{"url": "http://www.imore.com/how-to-restart-reset-iphone-ipad", "passage_text": "How to reset your iPhone or iPad. 1  Press and hold down the On/Off button on the right side (iPhone 6 or later) or top (all other iPhones, iPods, and iPads). 2  Press and hold down the Home button on the front of your iPhone, iPod touch, or iPad while still holding down the On/Off button. How to power off or restart your iPhone or iPad. 1  Press and hold down the On/Off button on the right side (iPhone 6 or later) or top (all other iPhones, iPods, and iPads) for 3 seconds. 2  Swipe the slide to power off confirmation slider to the right."}, {"url": "http://www.isunshare.com/iphone-ipad/three-ways-to-hard-reset-iphone.html", "passage_text": "When iPhone buttons are available, this way is one of the easiest methods to restore iPhone to factory settings without passcode. Step 1: Press and hold the Home button (at the bottom of iPhone) and the Sleep/Wake button (on top of the iPhone) simultaneously. Step 2: Hold both buttons until the iPhone shuts off and begins to restart. Let it go when you see the Apple logo appear on screen. You’ve just performed a hard reset. "}, {"url": "http://www.dummies.com/how-to/content/how-to-restart-or-reset-your-iphone.html", "passage_text": "If your iPhone refuses even to restart, you can reset it. Resetting your iPhone is like forcing your computer to restart after a crash. To reset your iPhone: Press and hold the Sleep/Wake button while pressing and holding the Home button on the front. When you see the Apple logo, release both buttons. Your data shouldn't be affected by a reset, so don't be shy about giving this technique a try"}, {"url": "http://www.hard-reset.com/apple-iphone-5s-hard-reset.html", "passage_text": "Do this only if you’re unable to restart your iPhone. Reset iPhone. Hold down the Sleep/Wake button and the Home button at the same time for at least ten seconds, until the Apple logo appears. You can reset the word dictionary, network settings, home screen layout, and location warnings. To turn iPhone back on, hold down the Sleep/Wake button until the Apple logo appears. Force an app to quit. From the Home screen, double-click the Home button and swipe upwards on the app screen. If you can’t turn off iPhone or if the problem continues, you may need to r"}, {"url": "https://support.apple.com/en-us/HT201559", "passage_text": "How to force restart. You should force restart your iPhone, iPad, or iPod touch as a last resort, and only if it's not responding. To force restart your device, press and hold both the Sleep/Wake and Home buttons for at least ten seconds, until you see the Apple logo."}, {"url": "http://www.hard-reset.com/apple-iphone-5-hard-reset.html", "passage_text": "Force quit an application: Press and hold the On/Off Sleep/Wake button on top of iPhone for a few seconds until a red slider appears, then press and hold the Home button until the application quits. On iPhone 3GS or later, you can also remove an. application from the recents list to force it to quit. iPhone 5 ios6. Restart iPhone 5: Press and hold the On/Off Sleep/Wake button until the red slider appears. Slide your finger across the slider to turn off iPhone. To turn iPhone back on, press and hold the On/Off Sleep/Wake button until the Apple logo appears."}, {"url": "https://support.apple.com/en-us/HT201559", "passage_text": "1 Press and hold the Sleep/Wake button until the red slider appears. 2  Drag the slider to turn your device completely off. 3  After the device turns off, press and hold the Sleep/Wake button again until you see the Apple logo. You should force restart your iPhone, iPad, or iPod touch as a last resort, and only if it's not responding. To force restart your device, press and hold both the Sleep/Wake and Home buttons for at least ten seconds,"}, {"url": "https://support.apple.com/en-us/HT201559", "passage_text": "How to restart. 1  Press and hold the Sleep/Wake button until the red slider appears. 2  Drag the slider to turn your device completely off. 3  After the device turns off, press and hold the Sleep/Wake button again until you see the Apple logo. You should force restart your iPhone, iPad, or iPod touch as a last resort, and only if it's not responding. To force restart your device, press and hold both the Sleep/Wake and Home buttons for at least ten seconds,"}, {"url": "http://www.brighthub.com/mobile/iphone/articles/70767.aspx", "passage_text": "Soft Reset iPhone. This section is a tutorial that will show you how to soft reset iPhone. 1) Locate the Sleep/Wake button on the top of the phone. 2) Press and hold the Sleep/Wake button for approximately 5 seconds until a slider with a red button appears at the top of the screen. It will say slide to power off. 3) Slide the button to the right to power the phone down. 4) Wait for a few seconds until the screen goes completely dark. 1) Locate the Sleep/Wake button on the top of the phone and the Home button on the front of the phone. See pictures below to locate buttons. 2) Press and hold the Sleep/Wake button and the Home button simultaneously for about 10-15 seconds."}]