[{"url": "http://dmna.ny.gov/foodservice/docs/toolbox/minimum_internal.pdf", "passage_text": "©2006. 1. Now We’re Cooking 1. Beef steak: cook to an internal temperature of145˚F (63˚C) for fifteen seconds.2. Duck: cook to an internal temperature of 165˚F(74˚C) for fifteen seconds.3. Hamburger patties: cook to an internal temperatureof 155˚F (68˚C) for fifteen seconds.4. Injected roast: cook to an internal temperatureof 155˚F (68˚C) for fifteen seconds.8. Stuffing: cook to an internal temperature of165˚F (74˚C) for fifteen seconds.9. Turkey chili: cook to an internal temperature of 165˚F (74˚C) for fifteen seconds. 2. Easy as 1-2-3 1. Cover food to prevent drying.2."}, {"url": "http://blogs.usda.gov/2011/05/25/cooking-meat-check-the-new-recommended-temperatures/", "passage_text": "1 Ground Meats: This change does not apply to ground meats, including beef, veal, lamb, and pork, which should be cooked to 160 ºF and do not require a rest time. 2  Poultry: The safe cooking temperature for all poultry products, including ground chicken and turkey, stays the same at 165 ºF. On May 24, USDA made some important changes in their recommended cooking temperatures for meats. Here’s what you need to know: 1  Cooking Whole Cuts of Pork: USDA has lowered the recommended safe cooking temperature for whole cuts of pork from 160 ºF to 145 ºF with the addition of a three-minute"}, {"url": "http://www.nytimes.com/2011/05/25/dining/porks-safe-cooking-temperature-is-lowered.html", "passage_text": "The same temperature guidelines already apply to whole cuts of beef, lamb and veal. Other recommendations are unchanged. Ground pork, beef, lamb and veal should be cooked to 160 degrees, the agency said, and poultry should be cooked to 165 degrees. "}, {"url": "http://blogs.usda.gov/2011/05/25/cooking-meat-check-the-new-recommended-temperatures/", "passage_text": "Cook pork, roasts, and chops to 145 ºF as measured with a food thermometer, then allow the meat to rest for three minutes before carving or consuming. Cross posted from the FoodSafety.gov blog: On May 24, USDA made some important changes in their recommended cooking temperatures for meats. Here’s what you need to know: 1  Cooking Whole Cuts of Pork: USDA has lowered the recommended safe cooking temperature for whole cuts of pork from 160 ºF to 145 ºF with the addition of a three-minute rest time."}, {"url": "http://culinaryarts.about.com/od/beefporkothermeats/a/roastmeat.htm", "passage_text": "1 An electronic meat thermometer can be programmed to beep when the meat hits the target temperature. 2  Beef and lamb are medium rare when the internal temperature of the roast has reached 135°F; medium is 140°-145°F. Pork should be cooked to 145°F. 3  Veal is usually served medium (145°-150°F) or medium-well (155°F). 1 Place the meat in the oven and cook for 20 to 30 minutes at the high temperature. 2  Then lower the temperature to between 275°F and 325°F and roast until done (see doneness guidelines below)."}, {"url": "http://www.beefandlamb.com.au/How_to/Cooking_beef_and_lamb/Preparation_tips/How_to_use_a_meat_thermometer", "passage_text": "That is the beauty of the meat thermometer as it is an accurate way of measuring that internal temperature of the meat during cooking. How to tell when your beef, lamb, veal or goat is done. When your meat is done (be it a steak or a roast), the internal temperature of the meat will be: 1  Rare 60ºC. 2  Medium rare 60-65ºC. 3  Medium 65-70ºC. 4  Medium well done 70ºC. 5  Well done 75ºC."}, {"url": "http://www.fsis.usda.gov/shared/PDF/How_Temperatures_Affect_Food.pdf", "passage_text": "• Cook all raw beef, pork, lamb and veal steaks, chops, and roasts to a minimum internal temperature of 145 °F as measured with a food thermometer before removing meat from the heat source. For safety and quality, allow meat to rest for at least three minutes before carving or consuming. Cooking Raw meat and poultry should always be cooked to a safe minimum internal temperature. When roasting meat and poultry, use an oven temperature no lower than 325 °F. Use a food thermometer to assure that meat and poultry have reached"}, {"url": "http://culinaryarts.about.com/od/beefporkothermeats/a/roastmeat.htm", "passage_text": "1 Beef and lamb are medium rare when the internal temperature of the roast has reached 135°F; medium is 140°-145°F. Pork should be cooked to 145°F. 2  Veal is usually served medium (145°-150°F) or medium-well (155°F). 1 Place the meat in the oven and cook for 20 to 30 minutes at the high temperature. 2  Then lower the temperature to between 275°F and 325°F and roast until done (see doneness guidelines below)."}, {"url": "http://startcooking.com/safe-cooking-temperatures-lamb", "passage_text": "“For safety, the USDA recommends cooking lamb patties and ground lamb mixtures such as meat loaf to a safe minimum internal temperature of 160 °F as measured on a food thermometer. However, whole muscle meats such as roasts, steaks, and chops may be cooked to 145 °F (medium rare), 160 °F (medium), or 170 °F (well done). For approximate cooking times for use in meal planning, see the following chart compiled from various resources. Times are based on lamb at refrigerator temperature (40 °F)."}, {"url": "http://whatscookingamerica.net/Information/MeatTemperatureChart.htm", "passage_text": "Internal Description. Beef-Lamb-Veal Roasts-Steaks-Chops. For roasts of lamb, beef, or veal: place the thermometer midway inside the roast away from bone. Residual Heat or Carry-Over Cooking: Remember, the steak will continue to cook as it sets. The temperature will rise 5 degrees F. to 10 degrees F. internal temperature. Cooking thermometers take the guesswork out of cooking, as they measure the internal temperatures of your cooked meat, poultry, seafood, baked goods, and/or casseroles, to assure that a safe temperature has been reached, harmful bacteria have been destroyed, and your food is cooked perfectly."}]