[{"url": "https://en.wikipedia.org/wiki/Jurassic", "passage_text": "The Jurassic (/dʒuːˈraesɪk/ ; dʒuːˈræsɪk From Jura) mountains is a geologic period and system that extends from.201± 3.0 6 (ma million years) ago to± 145 4; ma from the end of The triassic to the beginning of The. cretaceous The Jurassic constitutes the middle period of the Mesozoic Era, also known as the Age of Reptiles. The start of the period is marked by the major Triassic–Jurassic extinction event. Two other extinction events occurred during the period: the Late Pliensbachian/Early Toarcian event in the Early Jurassic, and the Late Tithonian event at the end; however, neither event ranks among the Big Five mass extinctions."}, {"url": "http://www.bbc.co.uk/nature/history_of_the_earth/Jurassic", "passage_text": "Jurassic period. The Jurassic began after the mass extinction event that ended the Triassic. Life, however, was quick to recover from this blow and the Jurassic eventually became host to the most diverse range of organisms that Earth had yet seen. Amongst them were the first birds and some of the dinosaurs."}, {"url": "http://personal.denison.edu/~hauk/bio380-2001/jurassic.html", "passage_text": "Events marking the beginning and end of the Jurassic period. 1  The Jurassic period was from about 208 million years ago until 145 million years ago. 2  These 63 million years were also known as the age of the dinosaurs. 3  At the end of the period there was one of mass extinctions associated with the dinosaurs (Condie, 344). 1 This dinosaur extinction was paralleled by a shift in dominate vegetation from the conifers and cycads of the Jurassic period to shorter, primitive flowering trees (346). 2  It was this change in vegetation that may have led to the extinction of some of the species of"}, {"url": "https://en.wikipedia.org/wiki/Jurassic", "passage_text": "The Jurassic (/dʒuːˈraesɪk/ ; dʒuːˈræsɪk From Jura) mountains is a geologic period and system that extends from.201± 3.0 6 (ma million years) ago to± 145 4; ma from the end of The triassic to the beginning of The. Cretaceous The jurassic constitutes the middle period of The Mesozoic, era also known as The age Of. reptiles The Jurassic constitutes the middle period of the Mesozoic Era, also known as the Age of Reptiles. The start of the period is marked by the major Triassic–Jurassic extinction event. Two other extinction events occurred during the period: the Late Pliensbachian/Early Toarcian event in the Early Jurassic, and the Late Tithonian event at the end; however, neither event ranks among the Big Five mass extinctions."}, {"url": "http://www.geologypage.com/2014/04/jurassic-period.html", "passage_text": "A+ A-. Print Email. The Jurassic is a geologic period and system that extends from 201.3± 0.6 Ma (million years ago) to 145± 4 Ma; from the end of the Triassic to the beginning of the Cretaceous. The Jurassic constitutes the middle period of the Mesozoic Era, also known as the Age of Reptiles. Two other extinction events occurred during the period: the Late Piensbachian/Early Toarcian event in the Early Jurassic, and the Late Tithonian event at the end; however, neither event ranks among the 'Big Five' mass extinctions."}, {"url": "http://scienceviews.com/dinosaurs/jurassic.html", "passage_text": "The Jurassic Period began as a large extinction took place at the end of the Triassic period, approximately 208-200 ma, and later extended to 144 million years ago, roughly 64 ma to 56 ma total. At the beginning, the continent, Pangaea, began to separate significantly for the first time. This Dactylioceras sp. fossil dates to the Early Jurassic period, 180-176 million years ago. This Camarasaurus skull from Dinosaur National Monument dates to the Jurassic Period, about 150 million years ago."}, {"url": "http://www.livescience.com/29231-cretaceous-period.html", "passage_text": "View full size image. The Cretaceous Period was the last and longest segment of the Mesozoic Era. It lasted approximately 79 million years, from the minor extinction event that closed the Jurassic Period about 145.5 million years ago to the Cretaceous-Paleogene (K-Pg) extinction event dated at 65.5 million years ago. In the early Cretaceous, the continents were in very different positions than they are today. "}, {"url": "http://www.geologypage.com/2014/04/jurassic-period.html", "passage_text": "The start of the period is marked by the major Triassic–Jurassic extinction event. Two other extinction events occurred during the period: the Late Piensbachian/Early Toarcian event in the Early Jurassic, and the Late Tithonian event at the end; however, neither event ranks among the 'Big Five' mass extinctions."}]