[{"url": "http://www.answers.com/Q/How_many_minutes_per_pound_do_you_cook_beef", "passage_text": "If it's roast beef and you want it medium rare in the middle and cooked on the ends then put the oven up to 400 degrees for 20 - 30 minutes and then put it down to 330 - 350 (basting every 15 minutes in it's own juices. It would 15 - 20 minutes per pound. Frozen beef roasts cook faster so cook 12 - 15 minutes per pound. You can use a thermometer to test it or, cut into the middle of the roast a little to see if it's the way you want it."}, {"url": "http://www.ehow.com/how_4789201_long-cook-roast-beef.html", "passage_text": "3) Sprinkle salt, pepper and onion powder on all sides of the beef. 4) Place the beef in a roasting pan, and put it in the oven, uncovered. Timing is Everything. 1) Cook the roast for 15 minutes at 500 degrees F. 2) After 15 minutes, turn the temperature down to 375 degrees F. 3) Continue cooking for 16 minutes per pound (ex: If your roast is 3 pounds, that would be 48 minutes). 4) Remove from oven, and place pan on a cooling rack. 5) Let rest for 15 minutes. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071225072815AAIj7PZ", "passage_text": "You can put the roast in a plastic bag or container and marinate it in the wine & spices for however long you have before you have to put it in the oven, this will also add flavor and tenderize the meat further. For rare, cook roast 15 minutes per pound, so an 8 pound roast would cook for two (2) hours at 350 degrees. For medium, cook roast for 20 minutes per pound at the same temperature, 350 degrees which would be two (2) hours and forty (40) minutes. You can uncover it to brown it for the last 15 minutes, but you don't have to do this. "}, {"url": "http://www.simplyrecipes.com/recipes/prime_rib/", "passage_text": "5 After browning the roast at a 500°F temperature in the oven for 15 minutes, reduce the oven temperature to 325°F. To figure out the total cooking time, allow about 13-15 minutes per pound for rare and 15-17 minutes per pound for medium rare. Check the temperature of the roast using a meat thermometer 30 to 45 minutes before you expect the roast to be done. For example, with a 10 pound roast, you would expect 2 1/2 hours of total cooking time (15 minutes at 500° and 2 1/4 hours at 325°). In this case, check after 1 hour 45 minutes of total cooking time, or 1 hour 30 minutes after you lowered the oven temp to 325°"}, {"url": "http://www.recipetips.com/kitchen-tips/t--1542/roast-beef-cook-time.asp", "passage_text": "The oven temperature used to cook a beef roast is usually set somewhere between 300 degrees and 450 degrees Fahrenheit. The recommended cooking temperature for your roast is usually determined by the type of beef cut that you plan to roast. "}, {"url": "http://ochef.com/343.htm", "passage_text": "Cooking at a constant oven temperature of 300°F (160°C), a 5- to 8-lb standing rib roast will take 17-19 minutes per pound for rare, 20-22 for medium rare, 23-25 minutes for medium, and 27-30 minutes for well done. How long and at what temperature should I cook a beef roast in the oven? Roasting is a great cooking method for a large, tender cut of beef  such as a rib or sirloin roast. Sirloin-tip, rump, rolled-rump, eye-of-round or top-round roasts will also benefit from this cooking method if they are graded prime or choice."}, {"url": "http://www.lyndasrecipebox.com/2012/01/how-to-cook-tender-and-delicious-beef.html", "passage_text": "You could need more or less, depending on the size of your pan and how full it is. Toss the bay leaf in the liquid and cover pot with lid. Place dutch oven in a preheated 300 degree oven and cook for about 60 minutes per pound of beef. My 2 1/2 pound roast took about 2 3/4 hours to become tender and delicious."}, {"url": "http://extension.usu.edu/htm/faq/faq_q=3634", "passage_text": "A. To answer your question, beef roasts can be done in a moderately slow oven (325 degrees) and need to be cooked 22-30 minutes per pound, depending on doneness. So for example, a 10 pound beef roast to be done should be cooked approximately 4 hours 10 minutes (at 25 minutes per pound). "}, {"url": "http://communitytable.parade.com/172491/benrayl/perfect-roast-beef-is-easy/", "passage_text": "Drizzle with olive oil and place the roast on top. Place the roast in the oven and bake for about 15 minutes, then reduce the heat to 375 F (190 C). Roast for about 13-15 minutes per pound for rare, 17-19 minutes for medium, and 22-25 for cooked through. Check the meat with a thermometer to make sure it is the temperature you want it--145°F for medium rare, 160°F for medium. (Baste the roast a couple times while cooking, and keep an eye on the vegetables. "}]