[{"url": "https://en.wikipedia.org/wiki/Polaris_Industries", "passage_text": "Polaris Industries is an American manufacturer of snowmobiles, ATV, and neighborhood electric vehicles. Polaris is based in the Minneapolis exurb of Medina, Minnesota, USA. The company also manufactures motorcycles through its Victory Motorcycles subsidiary and through the Indian Motorcycle subsidiary which it purchased in April 2011. Polaris no longer produces watercraft."}, {"url": "http://earthsky.org/brightest-stars/polaris-the-present-day-north-star", "passage_text": "About-face of Polaris steers you due south. Polaris is not the brightest star in the nighttime sky, as is commonly believed. It’s only about 50th brightest. But you can find it easily, and, once you do, you’ll see it shining in the northern sky every night, from N. Hemisphere locations. For example, a famous star called Thuban, in the constellation Draco the Dragon, was the North Star when the Egyptians built the pyramids. But our present Polaris is a good North Star because it’s the sky’s 50th brightest star. So it’s noticeable in the sky."}, {"url": "https://en.wikipedia.org/wiki/Polaris", "passage_text": "Polaris (α Ursae Minoris, α UMi, commonly the North Star or Pole Star) is the brightest star in the constellation Ursa Minor, and the 50th brightest star in the night sky. It is very close to the north celestial pole, making it the current northern pole star. In English, it was known as pole star or north star; in Spenser, also steadfast star. An older English name, attested since the 14th century, is lodestar guiding star, cognate with the Old Norse leiðarstjarna, Middle High German leitsterne. Use of the name Polaris in English dates to the 17th century. It is an ellipsis for the Latin stella polaris pole star. Another Latin name is stella maris sea-star, which, from an early time, was also used as a title of the Blessed Virgin Mary, popularized in the hymn Ave Maris Stella (8th century)"}, {"url": "http://www.thefreedictionary.com/Polaris", "passage_text": "Noun. 1. Polaris-the brightest star in Ursa Minor; at the end of the handle of the Little Dipper; the northern axis of the earth points toward it. North Star, polar star, pole star, polestar. Little Bear, Ursa Minor-a constellation outside the zodiac that rotates around the North Star. "}, {"url": "https://simple.wikipedia.org/wiki/Polaris_(star)", "passage_text": "Polaris, or Alpha Ursae Minoris, is the Pole Star or North Star. It is the brightest star in the constellation Ursa Minor. It is almost straight above Earth 's north pole. Because of this, when it is seen from Earth, it looks like it always stays in the same place in the sky. Even though Polaris is the North Star today, this has not always been the case. The place in the sky that the Earth's north pole points at changes slowly over time. This movement is called stellar precession. In 3000 BC, a faint star called Thuban in the constellation of Draco was the"}, {"url": "http://earthsky.org/brightest-stars/polaris-the-present-day-north-star", "passage_text": "And Polaris will continue its reign as the North Star for many centuries to come. It will align most closely with the north celestial pole – the point in the sky directly above Earth’s north rotational axis – on March 24, 2100. For example, a famous star called Thuban, in the constellation Draco the Dragon, was the North Star when the Egyptians built the pyramids. But our present Polaris is a good North Star because it’s the sky’s 50th brightest star. So it’s noticeable in the sky."}, {"url": "http://www.answers.com/Q/What_is_POLARIS", "passage_text": "Polaris is also known as the North Star or the pole Star. It is a bright star, positioned almost directly above the nortern end of the earth's axis of rotation. It is the … end of the Little Dippers Handle. 2 people found this useful. Polaris is the north star, being possitioned directly above the north pole it doesn't move from it's spot in the nigth sky, this can be used to both tell direction and time at … nigth without a compass or a watch. 4 people found this useful."}, {"url": "http://earthsky.org/brightest-stars/polaris-the-present-day-north-star", "passage_text": "Polaris hasn’t always been the North Star and won’t remain the North Star forever. For example, a famous star called Thuban, in the constellation Draco the Dragon, was the North Star when the Egyptians built the pyramids. But our present Polaris is a good North Star because it’s the sky’s 50th brightest star. So it’s noticeable in the sky. It served well as the North Star, for example, when the Europeans first sailed across the Atlantic over five centuries ago"}]