[{"url": "http://www.discovertasmania.com.au/what-to-do/heritage-and-history/convict-history", "passage_text": "There are reminders of Australia's convict past no matter where you go, making Tasmania the perfect place to learn about Australia's early history and get to experience it first-hand. In fact, five of Australia's eleven UNESCO World Heritage-listed convict sites can be found in Tasmania. The Port Arthur Historic Site is Australia's most famous penal settlement, built on picturesque Mason Cove and surrounded by dense forest while the nearby Coal Mines Historic Site was Tasmania's first mine, operated by over 500 convicts."}, {"url": "https://en.wikipedia.org/wiki/Richmond_Bridge_%28Tasmania%29", "passage_text": "From Wikipedia, the free encyclopedia. The Richmond Bridge is a heritage listed arch bridge located on the B31 (Convict Trail) in Richmond, 25 kilometres (15.5 mi) north of Hobart in Tasmania, Australia. It is the oldest bridge still in use in Australia. In 1832, an employee of the Richmond Gaol was murdered at Richmond bridge. George Grover was employed as a gaoler whose duties including flogging the prisoners. He was unpopular due to his ferocity and was pushed off the edge of Richmond Bridge after drunkenly falling asleep. No one was convicted of his murder."}, {"url": "http://www.answers.com/Q/What_material_was_used_in_the_construction_of_The_Richmond_Bridge", "passage_text": "My vocations included, tree trimmer, steeple-jack and tuck-pointer, tool and die maker, and lastly an electrician from which I retired. The Richmond Bridge London, England. The design is a stone arch bridge constructed of Portland stone, construction started 1774 and completed 1777. The Richmond Bridge Richmond, Tasmania. The original name was Bigge's Bridge and was constructed of sandstone, construction started in 1823 and completed in 1825. "}, {"url": "https://en.wikipedia.org/wiki/Richmond_Bridge_%28Tasmania%29", "passage_text": "The foundation stone for the Richmond Bridge was laid on 11 December 1823 and construction continued using convict labour until completion in 1825. The bridge was originally named Bigge's Bridge after Royal Commissioner, John Thomas Bigge, who recognised the need for the bridge in 1820. In 1832, an employee of the Richmond Gaol was murdered at Richmond bridge. George Grover was employed as a gaoler whose duties including flogging the prisoners. He was unpopular due to his ferocity and was pushed off the edge of Richmond Bridge after drunkenly falling asleep. No one was convicted of his murder."}, {"url": "http://www.discovertasmania.com.au/what-to-do/heritage-and-history/convict-history", "passage_text": "Other convict highlights around the state include Sarah Island in Macquarie Harbour, the convict built bridge in Richmond and the recently constructed memorial convict trail in Campbell Town. The Port Arthur Historic Site is Australia's most famous penal settlement, built on picturesque Mason Cove and surrounded by dense forest while the nearby Coal Mines Historic Site was Tasmania's first mine, operated by over 500 convicts."}, {"url": "http://www.richmondvillage.com.au/history.html", "passage_text": "Richmond Bridge (1823). Originally named Bigge's Bridge, Richmond Bridge is Australia's oldest bridge still in use. It was built by convicts from sandstone quarried at Butchers Hill and hauled by hand carts to the bridge site. Richmond continued to grow, largely because of its importance as a convict station and a military post. In the 1830s, Richmond's position on the route to the East Coast and the Tasman Peninsula made it a natural overnight stopping place. By the 1830s, several roads led into and out of the town."}, {"url": "http://www.discovertasmania.com.au/what-to-do/heritage-and-history/convict-history", "passage_text": "As well as these, there are lots more convict sites across the state, including roads, bridges and buildings – in fact, a visit to just about any early town will reveal the hard labour and skilled craftsmanship of Tasmania's convicts. The Port Arthur Historic Site is Australia's most famous penal settlement, built on picturesque Mason Cove and surrounded by dense forest while the nearby Coal Mines Historic Site was Tasmania's first mine, operated by over 500 convicts."}, {"url": "http://www.ci.richmond.ca.us/index.aspx?NID=112", "passage_text": "The City of Richmond is located 16 miles northeast of San Francisco, directly across San Francisco Bay. Richmond is on a peninsula separating San Francisco Bay (on the south) and San Pablo Bay (to the north), and the city has 32 total miles of shoreline. Location in Contra Costa County. Richmond is located on the western shore of Contra Costa County, and is the largest city in the West County region consisting of five cities: Richmond, El Cerrito, San Pablo, Hercules, and Pinole. Transportation Transportation Center."}, {"url": "https://en.wikipedia.org/wiki/Richmond%E2%80%93San_Rafael_Bridge", "passage_text": "The Richmond–San Rafael Bridge (also named the John F. McCarthy Memorial Bridge) is the northernmost of the east–west crossings of the San Francisco Bay in California, USA, connecting Richmond on the east to San Rafael on the west end. It opened in 1956, replacing ferry service by the Richmond–San Rafael Ferry Company. Many commuters from San Francisco drove across the Golden Gate Bridge into Marin and then across the Richmond–San Rafael Bridge to go to Oakland (and vice versa). After the Bay Bridge was reopened, the third lane was again an emergency lane. In 1977, Marin County was suffering one of its worst droughts in history."}, {"url": "http://www.discovertasmania.com.au/what-to-do/heritage-and-history/convict-history", "passage_text": "In Hobart, the Cascades Female Factory tells the stories of the thousands of female convicts transport to Tasmania and on Maria Island off Tasmania's east coast, Darlington Probation Station consists of buildings dating back as far as the 1820s set in a beautiful natural environment. The Port Arthur Historic Site is Australia's most famous penal settlement, built on picturesque Mason Cove and surrounded by dense forest while the nearby Coal Mines Historic Site was Tasmania's first mine, operated by over 500 convicts."}]