[{"url": "http://personalfinance.costhelper.com/funeral-memorial-service.html", "passage_text": "1 A traditional Jewish funeral is simple, and not ostentatious. 2  Costs can range from $500 to $10,000, but average $4,000 to $6,000 for all expenses. 3  For details, see How Much Do Jewish Funerals Cost. 1 Charges to have a funeral home or mortuary coordinate a simple graveside funeral ceremony with only a few mourners start between $150 and $450 for a few chairs and casket-lowering equipment. 2  A larger ceremony can cost $500-$850 or more depending on location and number of staff people needed on site."}, {"url": "http://www.whattoexpect.com/forums/grief-loss/topic/funeral-costs.html", "passage_text": "Our son's funeral cost about $850. We paid only cost on the casket/vault and paperwork costs. That also included $350 for tent rental. (August in Texas is hot! 90 by 10am.) Both friends charged us only cost, they never charge full price for babies. "}, {"url": "http://personalfinance.costhelper.com/gravesite.html", "passage_text": "1 In addition to the cost of the burial plot, it can run $250-$600 for a simple flat granite grave marker or $1,000-$3,000 and up for an upright monument. 2  See How Much Do Headstones Cost. 3  Many private cemeteries require a grave liner or burial vault to protect the casket underground, with costs starting at $400-$5,000. 1 Infant or baby burial plots are less expensive than those for adults, and rural cemeteries often cost less than urban ones. 2  Prices can increase to $1,000-$2,000 and more in areas where land is at a premium."}, {"url": "http://www.answers.com/Q/What_is_the_cost_of_a_baby's_funeral", "passage_text": "The cost of a funeral will depend on what type of service you want, i.e. cremation or standard casket funeral. Cremation of course is less expensive due to not have to pay the … price of a Casket which can run upward of $5000 or more. Total cost of Standard Casket Fueneral $8000 or more. 1 person found this useful. The cost can vary, depending on how elaborate you want the coffin, flowers, etc., to be. But the average cost is around $5,000 - $7,000, meaning some can cost less, and others … cost more.   A lot also depends on what part of the country you live in and how elaborate you want to go."}, {"url": "http://www.giveforward.com/cause/money-for-funeral-costs", "passage_text": "And it’s not always easy to ask for help with funeral expenses, especially since many people are in the dark as to how much funerals can actually cost. According to eFuneral.com, in 2012 the average cost for a burial service was $8,565 and $3,725 for cremation. "}, {"url": "http://personalfinance.costhelper.com/funeral-memorial-service.html", "passage_text": "1 Most churches do not charge for the funeral service of an active member of their congregation, but it can be customary to give a donation of $50-$200 or more to the church. 2  Non-members may be charged rental fees of $200-$500 or more, depending on the number and type of facilities, and the length of time they are needed. 1 Charges to have a funeral home or mortuary coordinate a simple graveside funeral ceremony with only a few mourners start between $150 and $450 for a few chairs and casket-lowering equipment. 2  A larger ceremony can cost $500-$850 or more depending on location and number of staff people needed on site."}, {"url": "http://personalfinance.costhelper.com/funeral-memorial-service.html", "passage_text": "1 See How Much Does a Funeral Cost. 2  A traditional Jewish funeral is simple, and not ostentatious. 3  Costs can range from $500 to $10,000, but average $4,000 to $6,000 for all expenses. 4  For details, see How Much Do Jewish Funerals Cost. 1 Charges to have a funeral home or mortuary coordinate a simple graveside funeral ceremony with only a few mourners start between $150 and $450 for a few chairs and casket-lowering equipment. 2  A larger ceremony can cost $500-$850 or more depending on location and number of staff people needed on site."}, {"url": "http://www.mydollarplan.com/average-funeral-cost/", "passage_text": "Headstones often start around $500 and run upwards of $4000. The materials used for construction contribute to a wide price range. An average granite headstone in 2009 cost about $1500. If your loved one did not already have a cemetery plot, you will need to purchase one. Prices of cemetery plots depend on location. They start as low as a few hundred dollars and can be upward of a few thousand. Casket Cost. Another major funeral cost is the casket. There are many choices of caskets available from cardboard to stainless steel. According to the Casket & Funeral Supply Association of America, metal caskets were the predominant choice with 65 percent of all caskets sold in 2007."}]