[{"url": "http://www.neon-lighting.com/articles/kelvin_colors.htm", "passage_text": "Color Temperature is a term used to describe the color of a given light. It is based on the color given off by a glowing hot piece of platinum. For instance, heat the metal to red hot and its temperature describes the red color."}, {"url": "http://www.lightbulbsdirect.com/CTGY/ColorTemp.html", "passage_text": "Color Temperature Chart. Color temperature is a description of the warmth or coolness of a light source. When a piece of metal is heated, the color of light it emits will change. This color begins as red in appearance and graduates to orange, yellow, white, and then blue-white to deeper colors of blue."}, {"url": "https://en.wikipedia.org/wiki/Color_temperature", "passage_text": "The color temperature of a light source is the temperature of an ideal black-body radiator that radiates light of comparable hue to that of the light source."}, {"url": "http://www.betterphoto.com/article.asp?ID=24", "passage_text": "Color and temperature don't seem to have a direct relationship with each other, but light sources are often defined in terms of their color temperature and we speak of using the correct film with a particular type of light or setting the white point."}, {"url": "http://www.webopedia.com/TERM/C/color_temperature.html", "passage_text": "Color temperature refers to a characterization of the spectral properties of a light source and is commonly used during the production phase in the film and photography industries. Low color temperature is the warmer, more yellow to red light while high color temperature is the colder, more blue light. Daylight, for example, has a lower color temperature near dawn and a higher one during the day. The standard unit of measurement for color temperature is Kelvin (K)."}, {"url": "http://micro.magnet.fsu.edu/primer/lightandcolor/colortemperatureintro.html", "passage_text": "Color Temperature. The color temperature model is based on the relationship between the temperature of a theoretical standardized material, known as a black body radiator, and the energy distribution of its emitted light as the radiator is brought from absolute zero to increasingly higher temperatures."}]