[{"url": "http://homeguides.sfgate.com/long-blackeyed-pea-germinate-74124.html", "passage_text": "The best temperature for germination is from 60 to 75 degrees Fahrenheit, but black-eyed peas will germinate from 40 to 80 F. As with bush beans, germination in ideal temperatures will take eight to 10 days, but it can take two weeks or more if soil temperatures are below 60 F."}, {"url": "http://www.wikihow.com/Germinate-Peas", "passage_text": "How to Germinate Peas. Peas supply a wide variety of nutrients to your diet. Depending on the type--from sugar snap peas to dry peas to green garden peas-they provide high amounts of fiber, iron, protein, Vitamin C, lysine, tryptophan and carbohydrates. Peas are a cool-season crop, so indoor planting and germination should take place several weeks before the last frost in your area."}, {"url": "http://www.ehow.com/info-tip_8406893_long-do-peas-germinate.html", "passage_text": "Germination. Pea seeds germinate in one to two weeks under ideal conditions. It may take up to a month for the seedlings to emerge if spring temperatures are low. Small pea sprouts resemble blades of grass when emerging from the soil and then develop two leaves before undergoing a growth spurt."}, {"url": "http://homeguides.sfgate.com/normal-time-frame-peas-sprout-after-planting-69347.html", "passage_text": "Temperature. Peas will sprout in 21 to 30 days if the soil temperature is 38 degrees Fahrenheit and the germination rate, or number of seeds that do sprout, will be low. At temperatures of 65 to 70 F the seeds will sprout within 7 to 14 days and the germination percentage will be in the high 90s for fresh seed."}, {"url": "http://www.ehow.com/info-tip_8406893_long-do-peas-germinate.html", "passage_text": "A soil temperature below 40 F delays the germination of the pea seeds. Soil temperature in the range of 40 to 75 F is ideal for germination."}, {"url": "http://www.wikihow.com/Germinate-Peas", "passage_text": "1 Peas prefer soil that is fertile, well drained and high in organic matter. 2  Peas usually take 50-to-70 days from germination to harvest. 3  Plant 2-to-3 oz. ( 4 56-to-85 g) of seed for each 100 feet (30 m) of row."}, {"url": "http://homeguides.sfgate.com/normal-time-frame-peas-sprout-after-planting-69347.html", "passage_text": "Peas are a cool weather crop, but the seeds take a long time to germinate in cold soil. The length of time it takes for a pea seed to germinate depends on temperature, moisture and age of the seed."}]