[{"url": "http://www.healthline.com/health/vertical-sleeve-gastrectomy", "passage_text": "Vertical sleeve gastrectomy is a form of weight-loss surgery that involves altering the size of your stomach so you will feel fuller and eat less food. This surgery will require dramatic changes to your daily eating habits and is only recommended for patients who meet certain weight and health criteria. Your surgeon will perform the vertical sleeve gastrectomy while you are under general anesthesia. This means you will be asleep and free of pain during the surgery. Most of the time, the surgery is done in a way that is minimally invasive."}, {"url": "http://gastricsleevenow.com/qualify-for-gastric-sleeve-surgery", "passage_text": "There are also some people who have the BMI of 40 or higher, or 100 lbs more than the ideal weight, but they can still qualify for gastric sleeve surgery as long as the surgeon deems they are not at a high risk, and that the patient is committed to a lifestyle change. Nonetheless, there are a few criteria that patients must meed in order to qualify for gastric sleeve surgery. Click here to read more about the Gastric Sleeve. If you do qualify for gastric sleeve surgery, you can significantly reduce your weight, and eliminate up to 80% of that excess fat within 2 years."}, {"url": "http://www.medpagetoday.com/endocrinology/obesity/38112", "passage_text": "Sleeve gastrectomy is an effective form of bariatric surgery and should no longer be considered investigational, according to updated guidelines cosponsored by the American Association of Clinical Endocrinologists, The Obesity Society, and the American Society for Metabolic & Bariatric Surgery. Sleeve gastrectomy is an effective form of bariatric surgery and should no longer be considered investigational, according to updated guidelines."}, {"url": "http://alighterme.com/surgery_vg.html", "passage_text": "Advantages of the Vertical Sleeve Gastrectomy. Vertical Sleeve Gastrectomy Surgery Guide to: How it Works, Expectations, Diet, Cost and Requirements. Gastric sleeve surgery, or vertical sleeve gastrectomy, is a weight loss surgery that removes about 80 to 85 percent of the stomach. This type of bariatric surgery can also be referred to as sleeve gastrectomy, vertical sleeve gastrectomy (VSG), tube gastrectomy and laparoscopic sleeve gastrectomy. Patients are usually released from the hospital after 24 hours and can return to normal activities in 1 to 2 weeks. Patients can expect to lose 60%-70% of excess weight loss at about 2 years. You will follow a liquid diet immediately after surgery."}, {"url": "http://gastricsleevenow.com/qualify-for-gastric-sleeve-surgery", "passage_text": "Here is a general guideline of who can qualify for gastric sleeve surgery: 1  Individuals that are morbidly obese, obese or extremely overweight. 2  Your BMI (Body Mass Index) must be 35 or higher. 3  You must be 100 lbs heavier than your ideal body weight. Nonetheless, there are a few criteria that patients must meed in order to qualify for gastric sleeve surgery. Click here to read more about the Gastric Sleeve. If you do qualify for gastric sleeve surgery, you can significantly reduce your weight, and eliminate up to 80% of that excess fat within 2 years."}, {"url": "http://www.medpagetoday.com/endocrinology/obesity/38112", "passage_text": "The new guidelines suggest that patients with a BMI of 30 to just under 35 who have type 2 diabetes may be offered bariatric surgery, Youdim said, with the caveat that the evidence is limited. Sleeve gastrectomy is an effective form of bariatric surgery and should no longer be considered investigational, according to updated guidelines."}, {"url": "http://www.cnn.com/2011/HEALTH/expert.q.a/07/29/weight.surgery.sleeve.jampolis/index.html", "passage_text": "The sleeve gastrectomy is a surgery in which 85% of your stomach is removed so you are left with just a tube for a stomach. Gastric bypass surgery also cuts the stomach, but it creates a new smaller pouch, about the size of an egg, which is attached to the second part of the small intestine. With the sleeve procedure, results show 50-60% excess body weight loss at one year vs. 65-70% with gastric bypass and 45-50% with gastric band. Excess body weight loss, or EBWL, refers to the percent excess weight a person begins with. If you are 100 pounds overweight and you lost 50 pounds that would be a 50% EBWL"}, {"url": "http://gastricsleevenow.com/gastric-sleeve-candidates", "passage_text": "Gastric Sleeve Candidates. The gastric sleeve procedure is a solution for individuals that suffer from obesity, and gastric sleeve candidates should be patients who are aged between 18 to 60 years old, and have a BMI (Body Mass Index) between 35 and 40. "}, {"url": "http://www.cnn.com/2011/HEALTH/expert.q.a/07/29/weight.surgery.sleeve.jampolis/index.html", "passage_text": "Weight-loss surgery in general leads to a 70-80% resolution of diabetes and 50% resolution of high blood pressure, with better results for both conditions with gastric bypass (because the sleeve is a newer procedure less data are available). With the sleeve procedure, results show 50-60% excess body weight loss at one year vs. 65-70% with gastric bypass and 45-50% with gastric band. Excess body weight loss, or EBWL, refers to the percent excess weight a person begins with. If you are 100 pounds overweight and you lost 50 pounds that would be a 50% EBWL"}]