[{"url": "http://www.mysterious-planet.com/marfa-lights/", "passage_text": "The Marfa Lights, also called the Marfa Ghost Lights or Marfa Mystery Lights, are unexplained spheres of light that can be seen hovering in the distant prairie, near the west Texas town of Marfa. The mysterious lights falls under the category of phenomenon sometimes referred to as ‘ghost lights’ . These spheres of light are usually seen just east of Marfa, looking south from Highway 90, in an area called the Mitchell Flat."}, {"url": "https://en.wikipedia.org/wiki/Marfa_lights", "passage_text": "1 U.S. Highway 67 is visible from the Marfa lights viewing location. 2  The frequency of lights southwest of the view park correlates with the frequency of vehicle traffic on U.S. 67. 3  The motion of the observed lights was in a straight line, corresponding to U.S. 67. They came to the conclusion that all of the lights observed over a four-night period southwest of the view park could be reliably attributed to automobile headlights traveling along U.S. 67 between Marfa and Presidio, Texas. A 1965 investigation of The Spooklight in southwestern Missouri reached a similar conclusion."}, {"url": "http://www.mysterious-planet.com/marfa-lights/", "passage_text": "Marfa Lights. The Marfa Lights, also called the Marfa Ghost Lights or Marfa Mystery Lights, are unexplained spheres of light that can be seen hovering in the distant prairie, near the west Texas town of Marfa. The mysterious lights falls under the category of phenomenon sometimes referred to as ‘ghost lights’ . These spheres of light are usually seen just east of Marfa, looking south from Highway 90, in an area called the Mitchell Flat. The Marfa Lights viewing platform, about 9 miles east of Marfa on Highway 90"}, {"url": "http://www.livescience.com/37579-what-are-marfa-lights-texas.html", "passage_text": "Bunnell believes the Marfa Lights are the result of the igneous rock under Mitchell Flat that creates a piezoelectric charge (i.e., electricity produced under pressure by solid matter such as minerals, crystals or ceramics). A group of physics students from the University of Texas at Dallas concluded that headlights from vehicles on nearby U.S. Highway 67 could explain at least some of the reported sightings of the Marfa Lights. Another possible explanation is the refraction of light caused by layers of air at different temperatures."}, {"url": "https://en.wikipedia.org/wiki/Marfa_lights", "passage_text": "Their report made the following conclusions: 1  U.S. Highway 67 is visible from the Marfa lights viewing location. 2  The frequency of lights southwest of the view park correlates with the frequency of vehicle traffic on U.S. 67. 3  The motion of the observed lights was in a straight line, corresponding to U.S. 67. They came to the conclusion that all of the lights observed over a four-night period southwest of the view park could be reliably attributed to automobile headlights traveling along U.S. 67 between Marfa and Presidio, Texas. A 1965 investigation of The Spooklight in southwestern Missouri reached a similar conclusion."}, {"url": "https://en.wikipedia.org/wiki/Marfa_lights", "passage_text": "The Marfa lights, also known as the Marfa ghost lights, have been observed near U.S. Route 67 on Mitchell Flat east of Marfa, Texas, in the United States. They have gained some fame as onlookers have ascribed them to paranormal phenomena such as ghosts, UFOs, or will-o'-the-wisp, etc. They came to the conclusion that all of the lights observed over a four-night period southwest of the view park could be reliably attributed to automobile headlights traveling along U.S. 67 between Marfa and Presidio, Texas. A 1965 investigation of The Spooklight in southwestern Missouri reached a similar conclusion."}, {"url": "http://www.mnn.com/lifestyle/arts-culture/blogs/the-mystery-of-the-marfa-lights", "passage_text": "4. An example of the mysterious Marfa Lights outside Marfa, Texas. (Photo: Rockhop458 /YouTube). Drive down an obscure portion of U.S. Route 90 in Texas, about 9 miles east of the city of Marfa, and you'll come to what's likely the only roadside viewing platform dedicated solely to witnessing a mysterious phenomenon. Regardless of their source, the Marfa Lights remain an intriguing mystery that offer a bit of magic in an otherwise barren Texas desert landscape."}, {"url": "http://www.livescience.com/37579-what-are-marfa-lights-texas.html", "passage_text": "The Marfa Lights, mysterious glowing orbs that appear in the desert outside the West Texas town of Marfa, have mystified people for generations. According to eyewitnesses, the Marfa Lights appear to be roughly the size of basketballs and are varyingly described as white, blue, yellow, red or other colors. A group of physics students from the University of Texas at Dallas concluded that headlights from vehicles on nearby U.S. Highway 67 could explain at least some of the reported sightings of the Marfa Lights. Another possible explanation is the refraction of light caused by layers of air at different temperatures."}, {"url": "https://en.wikipedia.org/wiki/Marfa_lights", "passage_text": "1 The motion of the observed lights was in a straight line, corresponding to U.S. 67. 2  When the group parked a vehicle on U.S. 67 and flashed its headlights, this was visible at the view park and appeared to be a Marfa light. 3  A car passing the parked vehicle appeared as one Marfa light passing another at the view park. They came to the conclusion that all of the lights observed over a four-night period southwest of the view park could be reliably attributed to automobile headlights traveling along U.S. 67 between Marfa and Presidio, Texas. A 1965 investigation of The Spooklight in southwestern Missouri reached a similar conclusion."}, {"url": "http://www.frontier.wnyric.org/cms/lib/NY19000265/Centricity/Domain/218/Marfa%20Lights.pdf", "passage_text": "Then answer the questions that follow. The Mysterious Ma fia Lights by Rachel Bernstein 1 Near the little town of Marfa in western Texas is one of the most incredibte sights in the United States: the Marfa lights. "}]