[{"url": "http://www.minerals.net/mineral/malachite.aspx", "passage_text": "The Mineral malachite. Malachite is a very popular mineral with its intense green color and beautiful banded masses. The banded specimens are formed by massive, botryoidal, reniform, and especially stalactitic Malachite that are dense intergrowths of tiny, fibrous needles. Azure-malachite is also used as gemstone and has the same gem applications as banded Malachite. Malachite is very popular among mineral collectors, especially interestingly shaped and banded specimens. It is also used as an ore of copper and crushed to make a green pigment."}, {"url": "http://geology.com/minerals/malachite.shtml", "passage_text": "Malachite has been used as a gemstone and sculptural material for thousands of years and is still popular today. Today it is most often cut into cabochons or beads for jewelry use. Malachite has a green color that does not fade over time or when exposed to light. Those properties, along with its ability to be easily ground to a powder, made malachite a preferred pigment and coloring agent for thousands of years. It is also a soft mineral with a Mohs hardness of 3.5 to 4.0. Painting with Malachite: Pietro Perugino (c. 1448-1523) used malachite pigment when painting the green garment colors in his Nativity (c. 1503)."}, {"url": "https://en.wikipedia.org/wiki/Malachite", "passage_text": "Archeological evidence indicates that the mineral has been mined and smelted to obtain copper at Timna Valley in Israel for over 3,000 years. Since then, malachite has been used as both an ornamental stone and as a gemstone. Malachite is more common than azurite and is typically associated with copper deposits around limestones, the source of the carbonate. Large quantities of malachite have been mined in the Urals, Russia."}, {"url": "http://dave.ucsc.edu/myrtreia/specimens.html", "passage_text": "3. Azurite. The mineral azurite (. Malachite. The mineral malachite is a semi-precious stone and a common ore of copper. Its name is derived from the greek term malache, 'mallow', which refers to its leaf green color. Like azurite, malachite has been used for centuries as a pigment in dyes and as a semi-precious stone. Azurite and Malachite. Azurite. The mineral azurite (. Malachite. The mineral malachite is a semi-precious stone and a common ore of copper. Its name is derived from the greek term malache, 'mallow', which refers to its leaf green color."}, {"url": "https://en.wikipedia.org/wiki/Mineral", "passage_text": "A mineral is a naturally occurring substance, representable by a chemical formula, that is usually solid and inorganic, and has a crystal structure. It is different from a rock, which can be an aggregate of minerals or non-minerals and does not have a specific chemical composition. "}, {"url": "http://stoneplus.cst.cmich.edu/malachite.htm", "passage_text": "1 Azurmalachite-name given to mixtures of malachite and azurite, sometimes incorrectly termed intergrowths, that typically are banded concentrically. 2  Much of this material that has been used as gemrock rough has come from copper deposits in Arizona. The following are examples of names used for these gemrocks. 1 "}, {"url": "http://www.mindat.org/min-2550.html", "passage_text": "Malachite is a green, very common secondary copper mineral with a widely variable habit. Typically it is found as crystalline aggregates or crusts, often banded in appearence, like agates. It is also often found as botryoidal clusters of radiating crystals, and as mammillary aggregates as well. "}, {"url": "https://en.wikipedia.org/wiki/Malachite", "passage_text": "Malachite often results from weathering of copper ores and is often found together with azurite (Cu 3 (CO 3) 2 (OH) 2), goethite, and calcite. Except for its vibrant green color, the properties of malachite are similar to those of azurite and aggregates of the two minerals occur frequently. Malachite is more common than azurite and is typically associated with copper deposits around limestones, the source of the carbonate. Large quantities of malachite have been mined in the Urals, Russia."}]