[{"url": "http://www.hc-sc.gc.ca/hl-vs/iyh-vsv/food-aliment/bottled-embouteillee-eng.php", "passage_text": "When buying bottled water. 1  Examine the inside and outside of the bottle before you buy it. 2  Avoid bottles that have a broken seal, and report any tampering to the store manager and health officials. 3  Also, make sure the water is clear and has no material floating in it. 4  Check the label for the best-before date. 1"}, {"url": "http://www.funtrivia.com/askft/Question42387.html", "passage_text": "1 vote Vote for this answer. If stored properly, water in 3 and 5-gallon containers has a shelf life of two years. Smaller containers, 1 gallon and 2.5 gallon bottles, are made with a thinner grade of plastic than larger bottles and have an optimal shelf life of about 6 months (but remain potable for two years). They have a shorter shelf life because they are more permeable to outside odours. The key is how water is stored"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20060918053951AAzzIRI", "passage_text": "Submit. · just now. Report Abuse. The best before date is based on a number of factors. The two most important are the rate at which the plastic container the water in leeches chemicals into the water, and the mineral content of the water and what effects light and heat may have on the water. Usually the best-before date is still at least one year after the water has been bottled. "}, {"url": "http://www.livescience.com/32636-why-do-bottles-of-water-have-expiration-dates-.html", "passage_text": "Besides that, the expiration date on bottled water has certain benefits for the manufacturer. Although water, in and of itself, does not go bad, the plastic bottle it is contained in does expire, and will eventually start leaching chemicals into the water. "}, {"url": "http://www.answers.com/Q/Why_does_bottled_water_have_a_best_before_date", "passage_text": "It doesn't explicitly state the date printed is an expiry or best before, however one can assume it is for there would be no other imminent reason to print a date so visibly for the consumer to see. There could not be any reason why bottled spring water, bottled at the source, would expire. If water had any sort of expiry date we'd all be in big trouble. By law nothing can be added to spring water so we can deduce that any additives such as preservatives can be ruled out in causing an expiry problem. Since bottled water is a consumable the company must put a expiration date on it.  …  Also some water becomes impure due to plastic melting or substances released into the water by the plastic."}, {"url": "http://www.answers.com/Q/Why_does_bottled_water_have_a_best_before_date", "passage_text": "The only difference in drinking water directly from the spring, or in your home, is not the water, it's the packaging: PETE plastic bottle. It MAY have something to do with the catalyst antimony trioxide in production if PETE, polyethylene terephthalate, the plastic widely used in manufacturing drinking bottles. Since bottled water is a consumable the company must put a expiration date on it.  …  Also some water becomes impure due to plastic melting or substances released into the water by the plastic."}, {"url": "http://www.chowhound.com/food-news/53959/does-bottled-water-ever-go-bad/", "passage_text": "So why does bottled water have an expiration date? Blame New Jersey. A 1987 law in that state required all foods (legally, water is a food) sold in New Jersey to display an expiration date of two years or less from their date of manufacture. "}, {"url": "http://www.funtrivia.com/askft/Question42387.html", "passage_text": "Why does bottled water have a best before date on it? Why does bottled water have a best before date on it? Smaller containers, 1 gallon and 2.5 gallon bottles, are made with a thinner grade of plastic than larger bottles and have an optimal shelf life of about 6 months (but remain potable for two years). They have a shorter shelf life because they are more permeable to outside odours."}, {"url": "https://answers.yahoo.com/question/index?qid=20071220021206AAGQcKZ", "passage_text": "Answers. Relevance. Rating Newest Oldest. Best Answer: The reason that bottled was has a 'best by' or 'use by date' on it is that under the Food Safety Act it is a legal requirement that ANY food (drink) product, must contain a date as to which it is still deemed as safe to consume. "}, {"url": "https://answers.yahoo.com/question/index?qid=1006051808815", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: It could be because the plastic of water cooler bottles is better and therefore the water lasts longer. The plastic which the one gallon milk bottle type bottles are made of is softer and will even allow the water to evaporate through the bottle after a time. The best kind of bottle for water storage is either glass or poly-carbonate. If you look on the bottom of the bottle a poly-carbonate has a #7 recycle sign. As a rule, the higher number is the best. But, as with most things, the fresher water is-the better. Another reason could be because it's too hard to put a best before date on bottles which are constantly re-used. "}]