[{"url": "http://www.merriam-webster.com/dictionary/integration", "passage_text": "Definition of INTEGRATION. 1. : the act or process or an instance of integrating: as a: incorporation as equals into society or an organization of individuals of different groups (as races) b: coordination of mental processes into a normal effective personality or with the environment. 2. Medical Definition of INTEGRATION. : the combining and coordinating of separate parts or elements into a unified whole: as b: the process by which the different parts of an organism are made a functional and structural whole especially through the activity of the nervous system and of hormones."}, {"url": "http://www.thefreedictionary.com/integration", "passage_text": "In calculus, the inverse of differentiation. Integrating a given function results in a function whose derivative is the given function. Integration is used to compute such things as the areas and volumes of irregular shapes and solids. Compare differentiation. Noun. 1. integration-the action of incorporating a racial or religious group into a community. desegregation, integrating. group action-action taken by a group of people."}, {"url": "https://en.wikipedia.org/wiki/Political_integration_of_India", "passage_text": "In addition, there were several colonial enclaves controlled by France and Portugal. The political integration of these territories into India was a declared objective of the Indian National Congress, which the Government of India pursued over the next decade. At the time of Indian independence in 1947, India was divided into two sets of territories, the first being the territories under the control of the British Empire, and the second being the territories over which the Crown had suzerainty, but which were under the control of their hereditary rulers."}, {"url": "https://en.wikipedia.org/wiki/European_integration", "passage_text": "European integration is the process of industrial, political, legal, economic, social and cultural integration of states wholly or partially in Europe. European integration has primarily come about through the European Union and its policies. At the end of World War II, the continental political climate favoured unity in democratic European countries, seen by many as an escape from the extreme forms of nationalism which had devastated the continent."}, {"url": "http://www.academia.edu/1558681/Theoretical_Considerations_of_Political_Integration_and_the_Indian_Experience", "passage_text": "All the above definitions are attempts to define “what is which holds a society and a political system together” (Weiner, 1965: 54). In simple words, political integration is the integration into the government, the political parties and the pressure group life of a country (Goldman, 1964: 28). James S. Coleman and Carl G. Rosberg, jr., define political integration as “the progressive bridging of elite-mass gap on the vertical plane in the course of developing a participant community” (Coleman and Rosberg, jr. 1964: 9)."}, {"url": "http://sites.tufts.edu/enricospolaore/files/2012/08/Euro-June-2013.pdf", "passage_text": "After experiencing political oppression and war in the first half of the twentieth century, Europe undertook to build a new order for peace, freedom, and prosperity. Despite its predominantly economic content, the European Union is an eminently political construct. This article discusses facts and theories about European integration from a political-economy perspective, building on ideas and results from the economic literature on the formation of states and political union (for overviews, see Spolaore 2006, 2012)."}, {"url": "http://www.thefreedictionary.com/integration", "passage_text": "4. Math. the operation of finding the integral of a function or equation. 5. behavior that is in harmony with the environment. 6. Psychol. the organization of the constituent elements of the personality into a coordinated, harmonious whole. Noun. 1. integration-the action of incorporating a racial or religious group into a community. desegregation, integrating. group action-action taken by a group of people."}, {"url": "https://en.wikipedia.org/wiki/Political_integration_of_India", "passage_text": "Full political integration, in contrast, would require a process whereby the political actors in the various states were persuaded to shift their loyalties, expectations, and political activities towards a new center, namely, the Republic of India. This was not an easy task. At the time of Indian independence in 1947, India was divided into two sets of territories, the first being the territories under the control of the British Empire, and the second being the territories over which the Crown had suzerainty, but which were under the control of their hereditary rulers."}, {"url": "https://en.wikipedia.org/wiki/European_integration", "passage_text": "European integration at the level of the Council of Europe functions through the accession of member states to its conventions as well as through political coordination at the level of ministerial conferences and inter-parliamentary sessions. At the end of World War II, the continental political climate favoured unity in democratic European countries, seen by many as an escape from the extreme forms of nationalism which had devastated the continent."}]