[{"url": "https://www.facebook.com/NKUHalls", "passage_text": "Be sure to stop by Feast for Finals tonight in Norse Commons to be served pancakes, bacon, and eggs by NKU's President Mearns. Also stop by Commonwealth Hall on Sunday at 8pm for another round of Breakfast for Dinner with your KY/CW RA staff! Commonwealth Hall will be hosting an Open Mic Night on April 18 at 7pm, be sure to sign up via owensh1@nku.edu and stop by to check out the talented students who will be performing! (Plus there will be free food & beverages!)."}, {"url": "https://en.wikipedia.org/wiki/Northern_Kentucky_University", "passage_text": "Northern Kentucky University's Grant County Center, located in Williamstown, Kentucky, is a partnership between the Grant County Foundation for Higher Education and Northern Kentucky University. The Northern Kentucky campus plaza in 2010. Northern Kentucky University's main campus in Highland Heights, Kentucky is situated on 400 acres (1.6 km 2) of rolling countryside along U.S. Route 27, just off of Interstate 275 and Interstate 471, seven miles (11 km) southeast of Cincinnati, Ohio."}, {"url": "http://www.thenortherner.com/news/2012/09/13/campus-vs-off-campus-housing/", "passage_text": "“I just feel like I have a lot more personal space with an apartment,” Perkins said. “I get to have my own room. I’ve lived on NKU’s campus before, first in Norse Hall then in Woodcrest, and that’s the main thing I didn’t like — having to share a room with someone else.”. Blair Godshall, a senior who lives in Hampton Farms apartments, said she enjoys the peaceful and somewhat secluded environment that her complex offers. Drinking is strictly prohibited on NKU’s campus for all students, as outlined in the University’s Housing and Dining Agreement. With the exception of this regulation, Morsch said he does not think that housing policies are too restrictive toward the residents."}, {"url": "https://en.wikipedia.org/wiki/Northern_Kentucky_University", "passage_text": "This is actually the rear entrance and view. The front faces the campus plaza and features a sloping glass facade. Northern Kentucky University is a public, co-educational university in northern Kentucky located in Highland Heights, seven miles (11 km) southeast of Cincinnati, Ohio. The Northern Kentucky campus plaza in 2010. Northern Kentucky University's main campus in Highland Heights, Kentucky is situated on 400 acres (1.6 km 2) of rolling countryside along U.S. Route 27, just off of Interstate 275 and Interstate 471, seven miles (11 km) southeast of Cincinnati, Ohio."}, {"url": "http://www.campbellcountyky.org/index.php/home/living-here-86/nku", "passage_text": "Northern Kentucky University. Nestled in central Campbell County is Northern Kentucky University, the Commonwealth's fastest developing institution for higher learning. At more than 15,000 students and 2,400 faculty and staff, NKU has distinguished itself as a regional academic and community leader. NKU is only the seventh institution in the world to have such equipment, and the others are six major planetariums (including those in Tokyo, Los Angeles and London). Salmon P. Chase College of Law is the largest law school in Kentucky, with an enrollment of more than 500."}, {"url": "https://en.wikipedia.org/wiki/Northern_Kentucky_Norse", "passage_text": "The Northern Kentucky Norse are the athletic teams of Northern Kentucky University, located in Highland Heights, Kentucky, United States. The Norse softball began in 1985 and is currently coached by Kathy Stewart, the fourth coach in program history. NKU made their first ever NCAA Women's College World Series Tournament in 2002 before falling in the opening game."}, {"url": "https://en.wikipedia.org/wiki/Northern_Kentucky_Norse", "passage_text": "From Wikipedia, the free encyclopedia. The Northern Kentucky Norse are the athletic teams of Northern Kentucky University, located in Highland Heights, Kentucky, United States. NKU is a NCAA Division I school competing in the Horizon League, which it joined on July 1, 2015 after leaving the Atlantic Sun Conference. The university's teams for both men and women are nicknamed Norse.. The Norse softball began in 1985 and is currently coached by Kathy Stewart, the fourth coach in program history. NKU made their first ever NCAA Women's College World Series Tournament in 2002 before falling in the opening game."}, {"url": "https://en.wikipedia.org/wiki/Northern_Kentucky_University", "passage_text": "The university's teams for both men and women are nicknamed Norse. Their mascot is named Victor E. Viking. Northern Kentucky University joined the Horizon League on July 1, 2015 after leaving the Atlantic Sun Conference. NKU is in the process of becoming a full Division I member. The Northern Kentucky campus plaza in 2010. Northern Kentucky University's main campus in Highland Heights, Kentucky is situated on 400 acres (1.6 km 2) of rolling countryside along U.S. Route 27, just off of Interstate 275 and Interstate 471, seven miles (11 km) southeast of Cincinnati, Ohio."}, {"url": "http://www.gcccu.org/events/docs/DrivingDirectionsNKUCampusMapStudentUnion.pdf", "passage_text": "Follow Kenton Drive around the perimeter of campus until you see the Kenton Drive Garage. NKU Conference Services recommends parking in the Kenton Drive Parking Garage. The Kenton Drive Parking Garage is located on Kenton Drive by the softball field (this garage provides the easiest access to the University Center). "}]