[{"url": "http://ojhsrides.weebly.com/top-thrill-dragster.html", "passage_text": "Top Thrill Dragster. Towering above many other roller coasters is the Top Thrill Dragster. The ride is an unbelievable 420 feet tall, and was the tallest roller coaster and fastest roller coaster on earth when it opened in 2003. Top Thrill reaches the speed of 120 mph in just four seconds! Top Thrill is made up of one hill. Passengers can choose to sit facing forward or backwards on the ride."}, {"url": "https://en.wikipedia.org/wiki/Top_Thrill_Dragster", "passage_text": "When built in 2003, it was the first full circuit roller coaster to exceed 400 feet (120 m) in height, and was the tallest roller coaster in the world, before being surpassed by Kingda Ka at Six Flags Great Adventure in May 2005. Top Thrill Dragster, along with Kingda Ka, are the only strata coasters in existence."}, {"url": "http://rcdb.com/1896.htm", "passage_text": "Trains: 6 trains with 5 cars per train. Riders are arranged 2 across in 2 rows for a total of 20 riders per train. Facts: The trains on the Top Thrill Dragster changed a few times during the first season. Presumably to create a lighter train, the Top Thrill Dragster had four car trains when it opened."}, {"url": "http://www.letu.edu/people/stevearmstrong/NCTM/Publications/All%20the%20Facts%20About%20Top%20Thrill%20Dragster,%20Thrill,%20Rides,%20Ceda.htm", "passage_text": "The train will then zoom straight up the 420-foot-tall hill on track that will rotate 90 degrees, crest the coaster's apex and then free fall back to Earth, reaching a speed of 120 mph for the second time."}, {"url": "http://www.ultimaterollercoaster.com/coasters/top-thrill-dragster", "passage_text": "Cedar Point amazed scream machine buffs the world over with the debut of Top Thrill Dragster in 2003, and at the time the tallest and fastest roller coaster on Earth. This 420-foot tall, 120-mph steel roller coaster is Cedar Point's 16th scream machine."}, {"url": "http://www.coasterforce.com/world-park-guides/us-park-guides/midwest/cedar-point/cedar-point-major-coasters/top-thrill-dragster", "passage_text": "Top Thrill Dragster opened in 2003 as the tallest and fastest roller coaster in the world. Despite no longer being the tallest or fastest coaster in the world, Dragster still thrills riders by offering an incredible launch, huge tophat, and blazing speeds-all with lapbars."}]