[{"url": "http://www.deathpenalty.org/article.php?id=42", "passage_text": "It costs approximately $90,000 more a year to house an inmate on death row, than in the general prison population or $57.5 million annually. The Attorney General devotes about 15% of his budget, or $11 million annually to death penalty cases."}, {"url": "http://www.deathpenaltyinfo.org/costs-death-penalty", "passage_text": "A Seattle University study examining the costs of the death penalty in Washington found that each death penalty case cost an average of $1 million more than a similar case where the death penalty was not sought ($3.07 million, versus $2.01 million)."}, {"url": "http://www.deathpenaltyinfo.org/costs-death-penalty", "passage_text": "Texas death penalty cases cost more than non-capital cases. Each death penalty case in Texas costs taxpayers about $2.3 million. That is about three times the cost of imprisoning someone in a single cell at the highest security level for 40 years. (Executions Cost Texas Millions, Dallas Morning News, March 8, 1992)."}, {"url": "http://www.mountain-news.com/news/crime_log/article_4f1e45f8-5630-11e0-93da-001cc4c002e0.html", "passage_text": "However, at an annual cost of $137,102, a prisoner who sits on death row for 20 years could cost taxpayers a total of $2,742,040 in that time. Adding to the total cost of LWOP is that the California's prison population is aging."}, {"url": "http://usatoday30.usatoday.com/news/nation/2009-03-07-exepensive-to-execute_N.htm", "passage_text": "In California, home to the nation's biggest death row population at 667, it costs an extra $90,000 per inmate to imprison someone sentenced to death — an additional expense that totals more than $63.3 million annually, according to a 2008 study by the state's Commission on the Fair Administration of Justice."}, {"url": "http://www.nytimes.com/2008/02/29/us/29prison.html", "passage_text": "It cost an average of $23,876 dollars to imprison someone in 2005, the most recent year for which data were available. But state spending varies widely, from $45,000 a year in Rhode Island to $13,000 in Louisiana."}, {"url": "http://www.hg.org/article.asp?id=31614", "passage_text": "As a result, some estimate that it costs U.S. taxpayers between $50 and $90 million dollars more per year (depending on the jurisdiction) to prosecute death penalty cases than life sentences."}, {"url": "http://www.nbcnews.com/id/29552692/ns/us_news-crime_and_courts/t/execute-or-not-question-cost/", "passage_text": "In California, home to the nation's biggest death row population at 667, it costs an extra $90,000 per inmate to imprison someone sentenced to death — an additional expense that totals more than $63.3 million annually, according to a 2008 study by the state's Commission on the Fair Administration of Justice."}, {"url": "http://www.criminaljusticedegreehub.com/how-much-does-it-cost-to-incarcerate-a-convict/", "passage_text": "The average annual cost to incarcerate one inmate is $31,307, but this can vary widely from state to state. In New York for instance, it costs between $50,000 and $60,000. A shocking total of $63.4 billion in U.S. taxpayer dollars goes to the imprisonment of its criminals, but why is the price so high?"}]