[{"url": "https://en.wikipedia.org/wiki/Diabetes_mellitus_type_1", "passage_text": "Diabetes mellitus type 1 (also known as type 1 diabetes, or T1D; formerly insulin-dependent diabetes or juvenile diabetes) is a form of diabetes mellitus that results from the autoimmune destruction of the insulin-producing beta cells in the pancreas. Type 2 diabetes is characterized by insulin resistance, while type 1 diabetes is characterized by insulin deficiency, generally without insulin resistance. Another hallmark of type 1 diabetes is islet autoreactivity, which is generally measured by the presence of autoantibodies directed towards the beta cells."}, {"url": "http://mentalhealth.com/mag1/p51-bpcf.html", "passage_text": "Introduction. Bipolar disorder is a chronic disorder that affects approximately one per cent of the world's population, afflicting both males and females. The onset of bipolar disorder usually occurs between 20 to 30 years of age, with a second peak in the mid-40s for women. There is a personality difference between patients with bipolar disorder and those with unipolar depression. Studies have shown that patients with unipolar depression tend to have depressive personalities, even after 15 years' follow up (when patients were no longer sick)."}, {"url": "https://en.wikipedia.org/wiki/Substance-related_disorder", "passage_text": "Over 50% of individuals with substance-related disorders will often have a dual diagnosis, where they are diagnosed with the substance abuse, as well as a psychiatric diagnosis, the most common being major depression, personality disorder, anxiety disorders, and dysthymia. "}, {"url": "https://en.wikipedia.org/wiki/Diabetes_mellitus_type_1", "passage_text": "People with type 1 diabetes always need to use insulin, but treatment can lead to low BG (hypoglycemia), i.e. BG less than 70 mg/dl (3.9 mmol/l). Hypoglycemia is a very common occurrence in people with diabetes, usually the result of a mismatch in the balance among insulin, food and physical activity. Type 2 diabetes is characterized by insulin resistance, while type 1 diabetes is characterized by insulin deficiency, generally without insulin resistance. Another hallmark of type 1 diabetes is islet autoreactivity, which is generally measured by the presence of autoantibodies directed towards the beta cells."}, {"url": "http://www.healthline.com/diabetesmine/brittle-diabetes-outdated-term-or-condition-needing-more-recognition", "passage_text": "Brittle diabetes is not an uncommon complication of type 1 diabetes but rather a distinct and separate FORM of type 1. Brittle diabetics can do everything right (optimized diet, exercise, carb counting and insulin regimen) and yet experience rapid unpredictable highs and lows in their BG levels. "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-313-BIOTIN.aspx?activeIngredientId=313&activeIngredientName=BIOTIN", "passage_text": "Biotin is used for preventing and treating biotin deficiency associated with pregnancy, long-term tube feeding, malnutrition, and rapid weight loss. It is also used orally for hair loss, brittle nails, skin rash in infants (seborrheic dermatitis), diabetes, and mild depression. Likely Effective for: 1  Treating and preventing biotin deficiency. 2  Symptoms of deficiency include thinning of the hair (often with loss of hair color), and red scaly rash around the eyes, nose, and mouth. 3  Other symptoms include depression, listlessness, hallucinations, and tingling in the arms and legs."}, {"url": "http://medical-dictionary.thefreedictionary.com/Anxiety", "passage_text": "Anxiety is a multisystem response to a perceived threat or danger. It reflects a combination of biochemical changes in the body, the patient's personal history and memory, and the social situation. As far as we know, anxiety is a uniquely human experience. Homeopathic practitioners select a remedy based on other associated symptoms and the patient's general constitution. Chinese medicine regards anxiety as a blockage of qi, or vital force, inside the patient's body that is most likely to affect the lung and large intestine meridian flow."}, {"url": "http://www.healthyplace.com/other-info/psychiatric-disorder-definitions/narcissistic-personality-disorder/", "passage_text": "Narcissistic Personality Disorder usually begins by early adulthood and is marked by disregard for the feelings of others, grandiosity (an exaggerated belief in their own value or importance), obsessive self-interest, and the pursuit of primarily selfish goals. People with Narcissistic Personality Disorder demonstrate an apparently paradoxical combination of self-centeredness and worthlessness. Their sense of self-importance is generally extravagant, and they demand attention and admiration. Concern or empathy for others is typically absent."}, {"url": "http://www.healthline.com/health/what-brittle-diabetes", "passage_text": "Overview. “Brittle” describes a severe form of diabetes. It’s characterized by an up and down of blood sugar levels. These swings in glucose can affect quality of life and even lead to hospitalization. Advances in diabetes management have made this condition rare, but brittle diabetes is still a concern among diabetics. It’s also a sign that your blood sugar is poorly managed. The best way to prevent brittle diabetes is to follow a health plan set forth by your doctor."}]