[{"url": "http://www.beer-faq.com/beer-ingredients/", "passage_text": "Water. As is the case with the human body, the most abundant ingredient in beer is water. Over 95% of your brew is made up of water. With such a large amount of your final product coming from a single ingredient, you can imagine how important it is to use good water. Even though it is geared towards brewing, it is still a good description of the main ingredients of beer. In its most simple form, beer is made of four basic ingredients: Water, yeast, Malt and hops."}, {"url": "https://en.wikipedia.org/wiki/Tap_dance", "passage_text": "This style of tap led to what is today known as Broadway style, which is popular in American culture. It often involves high heeled tap shoes and show music, and is usually the type of tap first taught to beginners. What is now called jazz dance evolved out of tap dance, so both dances have many moves in common. But jazz evolved separately from tap dance to become a new form in its own right. Well-known dancers during the 1960s and 1970s included Arthur Duncan and Tommy Tune."}, {"url": "https://en.wikipedia.org/wiki/Alcoholic_beverage", "passage_text": "An alcoholic beverage is a drink which contains a substantial amount of the psychoactive drug ethanol (informally called alcohol). Drinking alcohol plays an important social role in many cultures. Alcohol has potential for abuse and physical dependence. "}, {"url": "https://en.wikipedia.org/wiki/Tap_dance", "passage_text": "Jimmy Slyde tap dancing. Tap dance is a form of dance characterized by using the sounds of tap shoes striking the floor as a form of percussion. Two major variations on tap dance exist: rhythm (jazz) tap and Broadway tap. Broadway tap focuses on dance; it is widely performed in musical theater. What is now called jazz dance evolved out of tap dance, so both dances have many moves in common. But jazz evolved separately from tap dance to become a new form in its own right. Well-known dancers during the 1960s and 1970s included Arthur Duncan and Tommy Tune."}, {"url": "http://www.answers.com/Q/What_is_tap_water_made_of", "passage_text": "Tap water is made of oxegon and hydrogen but the people clean out the saltand other nonneeded particles of stuff. 1 Basic Tap Steps Tap dancing is a style of dance that gained popularity during the 1900s when jazz music began to rise in popularity."}, {"url": "http://www.wisegeek.org/what-is-tap-water.htm", "passage_text": "Post 2. I don't usually drink bottled water or tap water, because the water that we drink from tap water or bottled water is very acidic which is bad for our health. The water I drink is from a machine that takes the acid out of the water and turns it very alkaline, which is good for our health. He prefers buying distilled water in big containers and drinking that instead of tap water. To me, distilled water has a strange taste that almost reminds me of vinegar with a hint of sweetness. I feel that water should be totally flavorless, and since my tap water is, I prefer to drink it."}, {"url": "http://www.wikihow.com/Learn-to-Tap-Dance", "passage_text": "1 As you dance, move your hands and arms about to balance your body weight and balance. 2  Remember, tap dancing is an art form – it's about expressing yourself – and using your arms and hands expressively while you tap dance enhances the experience. 1 Brush – Gently brush the ball of your foot against the floor. 2  Be sure your foot is very relaxed, the movement comes from the thigh. 3  Can be done to the front and the back. 4  Step – Put your foot down and shift your weight to that foot, lifting up the other foot if you want."}, {"url": "http://www.wikihow.com/Learn-to-Tap-Dance", "passage_text": "1 Flap – Made up of two movements, a brush and a step done with the same foot. 2  Make sure you can hear two sounds. 3  Commonly called a “fal-lap” to match the two sounds it makes. 4  Shuffle – Made up of two brushes, a front and a back in quick succession. 5  Be sure that your foot is totally relaxed. 1 Brush – Gently brush the ball of your foot against the floor. 2  Be sure your foot is very relaxed, the movement comes from the thigh. 3  Can be done to the front and the back. 4  Step – Put your foot down and shift your weight to that foot, lifting up the other foot if you want."}, {"url": "http://www.wisegeek.org/what-is-tap-water.htm", "passage_text": "Tap water is drinking water that comes from an indoor tap or spigot. It is part of a larger indoor plumbing system that requires a complex supportive infrastructure, including a stable water source, piping, and water filtration to keep the water safe. He prefers buying distilled water in big containers and drinking that instead of tap water. To me, distilled water has a strange taste that almost reminds me of vinegar with a hint of sweetness. I feel that water should be totally flavorless, and since my tap water is, I prefer to drink it."}]