[{"url": "http://www.greenmedinfo.com/toxic-ingredient/titanium-dioxide", "passage_text": "Nanoparticle titanium dioxide is a clearly toxic mineral which can be found as an additive and excipient in various foods, cosmetics, vitamins and drugs. Over 4 million tons of this pigmentary substance is consumed annually worldwide, making its way into such FDA-approved applications as skim milk."}, {"url": "http://phys.org/news/2015-03-dunkin-donuts-ditches-titanium-dioxide.html", "passage_text": "Titanium dioxide (which isn't the same thing as the metal titanium) is an inert, insoluble material that's used as a whitener in everything from paper and paint to plastics. It's the active ingredient in many mineral-based sunscreens."}, {"url": "http://www.ewg.org/skindeep/ingredient/706561/TITANIUM_DIOXIDE/", "passage_text": "Other HIGH concerns: Occupational hazards; Other MODERATE concerns: Organ system toxicity (non-reproductive). About TITANIUM DIOXIDE: Titanium dioxide is an inorganic compound used in a range of body care products such as sunscreens and makeup. It appears to have low skin penetration but inhalation is a concern."}, {"url": "http://www.greenmedinfo.com/toxic-ingredient/titanium-dioxide", "passage_text": "Titanium Dioxide. Nanoparticle titanium dioxide is a clearly toxic mineral which can be found as an additive and excipient in various foods, cosmetics, vitamins and drugs. Over 4 million tons of this pigmentary substance is consumed annually worldwide, making its way into such FDA-approved applications as skim milk."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3720578/", "passage_text": "Due to their chemical stability and nonallergic, nonirritant, and ultraviolet protective properties, titanium dioxide (TiO 2) nanoparticles (NPs) have been widely used in industries such as electronics, optics, and material sciences, as well as architecture, medicine, and pharmacology."}, {"url": "http://www.globalhealingcenter.com/natural-health/health-risks-of-titanium/", "passage_text": "Exposure to titanium often happens by way of titanium compounds that are added to cosmetics, sunscreens, paints, and food. Titanium dioxide nano particles is usually the compound in question and safety concerns have been expressed."}, {"url": "http://www.ccohs.ca/headlines/text186.html", "passage_text": "Titanium dioxide has recently been classified by the International Agency for Research on Cancer (IARC) as an IARC Group 2B carcinogen ''possibly carcinogen to humans''. Titanium dioxide accounts for 70% of the total production volume of pigments worldwide."}, {"url": "http://www.organicmakeup.ca/CA/titaniumdioxide.asp", "passage_text": "References: Titanium dioxide is the subject of new controversy, yet it is a substance as old as the earth itself. It is one of the top fifty chemicals produced worldwide. It is a white, opaque and naturally-occurring mineral found in two main forms: rutile and anatase."}]