[{"url": "http://views.washingtonpost.com/post-user-polls/2010/10/should-there-be-term-limits-for-members-of-congress.html", "passage_text": "This is not healthy for a democracy. There should be a term limit of 10 years for Congress and 12 for Senators or when someone reaches the age of seventy, they should be dropped from being a candidate again. Unfortunately the real old people are wasting everybody’s time and resources just to keep them alive in Congress."}, {"url": "http://ourgeneration.org/term-limits/", "passage_text": "1 Term Limits will encourage regular citizens to run for office. 2  Presently, there is a 94% re-election rate in the House and 83% in the Senate. 3  Because of name recognition, and usually the advantage of money, it can be easy to stay in office."}, {"url": "http://www.heritage.org/research/reports/1994/08/bg994nbsp-term-limitsnbsp-the-only-way", "passage_text": "Additionally, the ballot box makes statutory term limits unnecessary. In effect, there are term limits in place every two years -- candidates have to go before constituents and get reelected, says Jeff Biggs, press secretary for House Speaker Tom Foley."}, {"url": "http://www.heritage.org/research/reports/1994/08/bg994nbsp-term-limitsnbsp-the-only-way", "passage_text": "Voters have approved term limits for Congressmen in each of the fifteen states where referenda have been held, with votes averaging over 66 percent in support, and another four to ten states will permit their citizens to vote on congressional term limits this November."}, {"url": "http://firstread.nbcnews.com/_news/2010/09/16/5122855-should-members-of-congress-have-term-limits?lite", "passage_text": "They advocate for term limits that would cap the number of years lawmakers can serve on Capitol Hill. The average length of service for senators this Congress is 12.8 years, just over two terms. It’s a full term longer for the senators who are leaving the chamber at the end of this year."}, {"url": "http://www.heritage.org/research/reports/1994/08/bg994nbsp-term-limitsnbsp-the-only-way", "passage_text": "Although numerous state legislatures have dealt with term limits, to date only Utah's has successfully passed a bill (in March 1994), and a state referendum drive is currently under way there to correct what some activists see as weaknesses in the measure."}, {"url": "http://www.debate.org/opinions/should-congress-have-term-limits", "passage_text": "Support of Imposing Term Limits. Currently members of Congress are allowed unlimited terms. Such is a hindrance to democracy and should be resolved. I speak in favor of this amendment to limit MCs (Members of Congress) terms for several reasons."}]