[{"url": "http://www.answers.com/Q/What_determines_whether_a_protein_is_exported_from_a_cell_or_used_inside_a_cell", "passage_text": "The instructions for protein production are found in the DNA (in the nucleus). This is transcribed (copied) to mRNA, which transports the instructions out of the nucleus to th … e ribosomes. Translation occurs at the ribosomes. Endoplasmic Reticulum (ER) prepares proteins for cell exports. 4 people found this useful. Edit. Share to: 1  The Five Major Parts of the Brain At its most basic, the brain controls the body. 2  Electrical impulses are sent along the nervous system to and from the brain that regulate all movement."}, {"url": "http://www.biologyreference.com/Po-Re/Protein-Synthesis.html", "passage_text": "Such protein aggregates can be fatal for the cell. It is the job of a class of proteins called chaperones to bind to the growing protein chains as they are synthesized by ribosomes and prevent aggregates from forming or the proteins from folding incorrectly before they have been fully synthesized. To make a particular protein, a messenger ribonucleic acid (mRNA) copy is made from the gene (in the process called transcription), and the mRNA is transported to the ribosome. Protein synthesis, also called translation, begins when the two ribosomal subunits link onto the mRNA."}, {"url": "http://publications.nigms.nih.gov/insidethecell/chapter2.html", "passage_text": "Once in the cell's cytoplasm, each mRNA molecule serves as a template to make a single type of protein. A single mRNA message can be used over and over again to create thousands of identical proteins. This process, called translation, is carried out by ribosomes, which move along the mRNA and follow its instructions. Inside the cell nucleus, where your DNA is safely packaged in chromosomes, are miniature protein machines called RNA polymerases. Composed of a dozen different small proteins, these molecular machines first pull apart the two strands of stringy DNA, then transcribe the DNA into a closely related molecule called RNA."}, {"url": "http://publications.nigms.nih.gov/insidethecell/chapter1.html", "passage_text": "Cell Membrane: Specialist in Containing and Communicating. The membrane that surrounds a cell is made up of proteins and lipids. Depending on the membrane’s location and role in the body, lipids can make up anywhere from 20 to 80 percent of the membrane, with the remainder being proteins. You're standing on a somewhat spherical structure about 50 feet in diameter. It's the nucleus —basically the cell's brain. The nucleus is the most prominent organelle and can occupy up to 10 percent of the space inside a cell. It contains the equivalent of the cell's gray matter—its genetic material, or DNA."}, {"url": "http://biochemistry.ucsf.edu/programs/ptf/Prologue%20Links/Diff%20&%20Trans%20Membranes.pdf", "passage_text": "An example of a carrier protein that carries out passive transport is the glucose transporter, which is located in the plasma membrane of all mammalian cell types. On liver cells the carrier can be open toward the outside of a cell or toward the inside (Fig. 14). "}, {"url": "http://www.answers.com/Q/What_determines_whether_a_protein_is_exported_from_a_cell_or_used_inside_a_cell", "passage_text": "Split and merge into it. Answered by The Community. Making the world better, one answer at a time. Proteins synthesized on ribosomes attached to the. endoplasmic reticulum are exported from the cell, whereas proteins synthesized on ribosomes that. are free in the cytosol are used inside the cell. Endoplasmic Reticulum (ER) prepares proteins for cell exports. 4 people found this useful. Edit. Share to: 1  The Five Major Parts of the Brain At its most basic, the brain controls the body. 2  Electrical impulses are sent along the nervous system to and from the brain that regulate all movement."}, {"url": "http://biologymad.com/cells/cellmembrane.htm", "passage_text": "The membranes that surround the nucleus and other organelles are almost identical to the cell membrane. Membranes are composed of phospholipids, proteins and carbohydrates arranged in a fluid mosaic structure, as shown in this diagram. Endocytosis and Exocytosis. The Structure of the Cell Membrane The cell membrane (or plasma membrane) surrounds all living cells, and is the cell's most important organelle. It controls how substances can move in and out of the cell and is responsible for many other properties of the cell as well."}, {"url": "https://answers.yahoo.com/question/index?qid=20070225210321AAd4dDe", "passage_text": "· just now. Report Abuse. If the protein is made on the endoplasmic reticulum it is to be used in the cell or in the membrane. If however it is made in the golgi complex, it will be used inside a lysosome or transported out of the cell. Lawrence T · 9 years ago. Thumbs up. 0. Thumbs down. 0. Comment. Add a comment"}]