[{"url": "http://surgery.uchicago.edu/specialties/pediatric/csp/mals/", "passage_text": "The Team. The median arcuate ligament syndrome (MALS) multidisciplinary team is led by pediatric surgeon Dr. Grace Mak and vascular surgeon Dr. Christopher Skelly. This team consists of our MALS coordinator Christopher Speaker, APN; a psychiatrist, interventional radiologist and pain specialists. The Program. "}, {"url": "http://www.hindawi.com/journals/crivam/2012/129870/", "passage_text": "1. Median arcuate ligament syndrome (MALS) or celiac axis compression syndrome (CACS) is an uncommon condition caused by the external compression of the celiac trunk by the median arcuate ligament (Figure 1). This symptom involves abdominal pain, nausea, vomiting, and weight loss. 3. Discussion. The MALS or CACS is a rare cause of postprandial pain and weight loss. This syndrome was first described by Harjola [ 3 ] in 1963. The incidence of MALS has been found in 10–24% [ 1 ]."}, {"url": "https://en.wikipedia.org/wiki/Median_arcuate_ligament_syndrome", "passage_text": "Left The median arcuate ligament is normally several millimeters to centimeters superior to the origin of the celiac artery. Right In MALS, the ligament is anterior, rather than superior, to the celiac artery, resulting in compression of the vessel and a characteristic hook-shaped contour. Celiac artery compression was first observed by Benjamin Lipshutz in 1917. MALS was first described by Pekka-Tapani Harjola in 1963 and subsequently by J. David Dunbar and Samuel Marable in 1965. It has also been called Harjola-Marable syndrome and Marable syndrome."}, {"url": "https://en.wikipedia.org/wiki/Median_arcuate_ligament_syndrome", "passage_text": "Decompression of the celiac artery is the general approach to treatment of MALS. The mainstay of treatment involves an open surgical approach to divide, or separate, the median arcuate ligament to relieve the compression of the celiac artery. Celiac artery compression was first observed by Benjamin Lipshutz in 1917. MALS was first described by Pekka-Tapani Harjola in 1963 and subsequently by J. David Dunbar and Samuel Marable in 1965. It has also been called Harjola-Marable syndrome and Marable syndrome."}, {"url": "http://www.medscape.com/medline/abstract/9068484", "passage_text": "Division of Gastroenterology, University of Virginia, Charlottesville, USA. The median arcuate ligament syndrome (MALS) is characterized by abdominal pain, nausea, and vomiting attributed to compression of the celiac axis by a fibrous band (the median arcuate ligament) connecting the diaphragmatic crura. "}, {"url": "http://www.ucmals.com/mals.html", "passage_text": "1 This condition occurs when the median arcuate ligament becomes too tight and compresses the celiac artery. 2  This compression restricts blood flow to the digestive system. 3  MALS is seen in both males and females at various ages. "}, {"url": "http://www.hindawi.com/journals/crivam/2012/129870/", "passage_text": "Introduction. Median arcuate ligament syndrome (MALS) or celiac axis compression syndrome (CACS) is an uncommon condition caused by the external compression of the celiac trunk by the median arcuate ligament (Figure 1). This symptom involves abdominal pain, nausea, vomiting, and weight loss. 3. Discussion. The MALS or CACS is a rare cause of postprandial pain and weight loss. This syndrome was first described by Harjola [ 3 ] in 1963. The incidence of MALS has been found in 10–24% [ 1 ]."}, {"url": "https://en.wikipedia.org/wiki/Median_arcuate_ligament_syndrome", "passage_text": "It is estimated that in 10-24% of normal, asymptomatic individuals the median arcuate ligament crosses in front of (anterior to) the celiac artery, causing some degree of compression. Approximately 1% of these individuals exhibit severe compression associated with symptoms of MALS. The syndrome most commonly affects individuals between 20 and 40 years old, and is more common in women, particularly thin women. Celiac artery compression was first observed by Benjamin Lipshutz in 1917. MALS was first described by Pekka-Tapani Harjola in 1963 and subsequently by J. David Dunbar and Samuel Marable in 1965. It has also been called Harjola-Marable syndrome and Marable syndrome."}, {"url": "http://www.mayoclinic.org/diseases-conditions/grand-mal-seizure/basics/causes/CON-20021356", "passage_text": "Causes. Grand mal seizures occur when the electrical activity over the whole surface of the brain becomes abnormally synchronized. The brain's nerve cells normally communicate with each other by sending electrical and chemical signals across the synapses that connect the cells. In people who have seizures, the brain's usual electrical activity is altered."}]