[{"url": "http://www.investopedia.com/articles/optioninvestor/06/calculaterisk.asp", "passage_text": "In order to level the playing field, therefore, you must equalize the risk and determine how to have a risk-equivalent option position in relation to the stock position. Positioning your Stock. Let's start with your stock position: buying 1,000 shares of a $41.75 stock for a total investment of $41,750. However, if used properly, options can have less risk than an equivalent position in a stock. Read on to learn how to calculate the potential risk of stock and options positions and discover how options-and the power of leverage-can work in your favor."}, {"url": "http://smallbusiness.chron.com/benefits-employee-stock-options-company-2842.html", "passage_text": "Along with two basic types of option plans (incentive stock options and nonqualified option plans), there is flexibility in constructing plan contents. Although available primarily to company senior executives, stock option plans now often exist for many other employee groups. The employee is under no obligation to purchase all or part of the number of shares noted in the option. The choice is theirs alone and they can normally purchase stock at any point during the time period between the offer and last exercise date."}, {"url": "http://www.investopedia.com/articles/optioninvestor/06/calculaterisk.asp", "passage_text": "In the example above, the option trade has much more risk compared to the stock trade. With the stock trade, your entire investment can be lost, but only with an improbable movement in the stock. In order to lose your entire investment, the $50 stock would have to trade down to $0. However, if used properly, options can have less risk than an equivalent position in a stock. Read on to learn how to calculate the potential risk of stock and options positions and discover how options-and the power of leverage-can work in your favor."}, {"url": "http://www.investopedia.com/articles/optioninvestor/06/calculaterisk.asp", "passage_text": "For example, if the option strike price is $40 (an in-the-money option), the stock will only need to trade below $40 by expiration for your entire investment to be lost. That represents only a 20% downward move. Clearly, there is a large risk disparity between owning the same dollar amount of stocks to options. However, if used properly, options can have less risk than an equivalent position in a stock. Read on to learn how to calculate the potential risk of stock and options positions and discover how options-and the power of leverage-can work in your favor."}, {"url": "http://smallbusiness.chron.com/benefits-employee-stock-options-company-2842.html", "passage_text": "As the cost of all employee benefits continues to increase, companies expand their search for programs that offer high value for moderate cost. Stock option plans often prove to be a strong benefit for employees and cost-effective for companies. While stock options are seldom substitutes for compensation increases, as part of a solid benefit program, they help make employment packages more attractive. The employee is under no obligation to purchase all or part of the number of shares noted in the option. The choice is theirs alone and they can normally purchase stock at any point during the time period between the offer and last exercise date."}, {"url": "https://en.wikipedia.org/wiki/Employee_stock_option", "passage_text": "Employee stock options are similar to exchange traded call options issued by a company with respect to its own stock. At any time before exercise, employee stock options can be said to have two components: time value and intrinsic value. The employee may also hedge the employee stock options prior to exercise with exchange traded calls and puts and avoid forfeiture of a major part of the options value back to the company thereby reducing risks and delaying taxes."}, {"url": "http://www.nasdaq.com/investing/options-guide/options-vs-equities.aspx", "passage_text": "Leverage Example: For an investor to purchase 100 shares of a stock trading at $50 per share would cost $5,000. On the other hand, owning a $5 Call option with a strike price of $50 would give the investor the right to buy 100 shares of the same stock at any time during the life of the option and would cost only $500. Stock options contracts are for 100 shares of the underlying stock-an exception would be when there are adjustments for stock splits or mergers. Options are traded on securities marketplaces among institutional investors, individual investors, and professional traders and trades can be for one contract or for many."}, {"url": "https://en.wikipedia.org/wiki/Employee_stock_option", "passage_text": "Employee Stock Options are non standard contracts with the employer whereby the employer has the liability of delivering a certain number of shares of the employer stock, when and if the employee stock options are exercised by the employee. The employee may also hedge the employee stock options prior to exercise with exchange traded calls and puts and avoid forfeiture of a major part of the options value back to the company thereby reducing risks and delaying taxes."}, {"url": "http://yourbusiness.azcentral.com/companies-offer-stock-options-14693.html", "passage_text": "Employees generally can't purchase all of their stock options at one time. Options usually become available to employees in increments on a vested basis over a period of four years, according to a 2012 Fox Business article, which serves as an incentive for workers to stay with an employer. Employees holding stock options in successful companies can earn generous profits. This was the case for the original employees of social media giant Facebook, who earned millions of dollars by eventually selling their stock options, according to a 2012 Fox Business article."}, {"url": "http://yourbusiness.azcentral.com/companies-offer-stock-options-14693.html", "passage_text": "Company Stock Options. Employers can offer company stock options to employees, including those in managerial and rank-and-file positions. Stock options, which represent equity ownership in a business, enable employees to purchase stocks at a predetermined price over a preset number of years. When a company's shares aren't publicly traded, an independent appraiser may be hired to assign a value to the shares. Employees holding stock options in successful companies can earn generous profits. This was the case for the original employees of social media giant Facebook, who earned millions of dollars by eventually selling their stock options, according to a 2012 Fox Business article."}]