[{"url": "http://www.americanmedtech.org/GetCertified/RPTEligibility.aspx", "passage_text": "Route 2: Work Experience. Applicant shall have completed at least 1,040 hours of acceptable work experience as a phlebotomy technician within the past three years; this to include venipunctures, skin punctures, specimen processing, communication skills, and clerical duties. Proof of high school graduation (or equivalent) is required. "}, {"url": "http://education.costhelper.com/phlebotomist.html", "passage_text": "1 Students may want or need to purchase phlebotomy training kits. 2  These kits typically cost from $100-$500. 3  A practice injection arm is available at 3B Scientific for $489. 4  Purchasing practice veins costs about $136. 1 The American Society for Phlebotomy Technicians offers a training course for $800, but participants must also purchase membership to the association for $35 and a textbook for $40. 2  Some technical colleges offer phlebotomy coursework as part of a larger medical assisting program"}, {"url": "https://www.bloodtaker.com/long-take-become-phlebotomist/", "passage_text": "Phlebotomists are faced with a lot of responsibilities as soon as they start. This is the reason why it is impossible to become a phlebotomist without the necessary training which prepares students to deal with all sorts of situations, whether easy or extremely difficult. Phlebotomy school will take from twelve weeks to a year. The number of hours spent in phlebotomy school varies depending entirely on the length of the course or degree selected by the student."}, {"url": "https://answers.yahoo.com/question/index?qid=20130423202544AAng8VJ", "passage_text": "This Site Might Help You. RE: I wanna be a phlebotomist how long does it take? I live in florida, but i live 20 mins from alabama and the college there is offering phlebotomy classes,and im really interested. I was actually just looking at the phlebotomist course not that long ago and it doesn't take that long at all to complete. Pretty much it's two semesters long. Each semester is roughly 3 months each. Sep-Dec and Jan-May. In reality, phlebotomists make a lower income roughly $30,000 a year"}, {"url": "https://answers.yahoo.com/question/index?qid=20130423202544AAng8VJ", "passage_text": "Report Abuse. I was actually just looking at the phlebotomist course not that long ago and it doesn't take that long at all to complete. Pretty much it's two semesters long. Each semester is roughly 3 months each. Sep-Dec and Jan-May. In reality, phlebotomists make a lower income roughly $30,000 a year"}, {"url": "http://www.phlebotomyguide.org/cost-phlebotomy-training/", "passage_text": "The fee for phlebotomy training varies based on the cost. After you complete the course, (which can last four to eight months), you should be certified enough to take the main state test. The fee for this test is generally $50, though it can vary in different states. To be considered for tuition in your current state, you have to have been in your area of residence for 2 years or more. Otherwise, you have to pay your tuition out of your current state. At most community colleges, phlebotomy training can range from $600 to $2,500. Some classes can cost even more. How much a college charges depends on what the school offers and what they charge in general for tuition"}, {"url": "http://education.costhelper.com/phlebotomist.html", "passage_text": "1 Phlebotomy technician training at a technical school or facility costs $700-$1,400. 2  Medtech, which has 10 locations in the Midwest and Southeast, charges $825 for phlebotomy training courses which includes books and lab fees. 1 The American Society for Phlebotomy Technicians offers a training course for $800, but participants must also purchase membership to the association for $35 and a textbook for $40. 2  Some technical colleges offer phlebotomy coursework as part of a larger medical assisting program"}]