[{"url": "http://www.thefreedictionary.com/pledge", "passage_text": "pledge. n. 1. A solemn binding promise to do, give, or refrain from doing something: signed a pledge never to reveal the secret; a pledge of money to a charity. 2. a. Something given or held as security to guarantee payment of a debt or fulfillment of an obligation."}, {"url": "http://legal-dictionary.thefreedictionary.com/Pledge", "passage_text": "Pledge. A Bailment or delivery of Personal Property to a creditor as security for a debt or for the performance of an act. Sometimes called bailment, pledges are a form of security to assure that a person will repay a debt or perform an act under contract. But if the sale does not meet the amount of the debt, legal action may be necessary. A contract of pledge specifies what is owed, the property that shall be used as a pledge, and conditions for satisfying the debt or obligation. In a simple example, John asks to borrow $500 from Mary. Mary decides first that John will have to pledge his stereo as security that he will repay the debt by a specific time"}, {"url": "https://en.wikipedia.org/wiki/Pledge_%28law%29", "passage_text": "As the pledge is for the benefit of both parties, the pledgee is bound to exercise only ordinary care over the pledge. The pledgee has the right of selling the pledge if the pledgor make default in payment at the stipulated time. No right is acquired by the wrongful sale of a pledge except in the case of property passing by delivery, such as money or negotiable securities. In the case of a wrongful sale by a pledgee, the pledgor cannot recover the value of the pledge without a tender of the amount due."}, {"url": "http://www.thefreedictionary.com/pledge", "passage_text": "pledge. 1. a solemn promise or agreement to do or refrain from doing something: a pledge of aid. 2. something delivered as security for the payment of a debt or fulfillment of a promise. 3. the state of being given or held as security. 4. Law. a. the act of delivering goods, property, etc., to another for security. A solemn binding promise to do, give, or refrain from doing something: signed a pledge never to reveal the secret; a pledge of money to a charity. 2. a. Something given or held as security to guarantee payment of a debt or fulfillment of an obligation."}, {"url": "http://legal-dictionary.thefreedictionary.com/Pledge", "passage_text": "pledge. v. to deposit personal property as security for a personal loan of money. If the loan is not repaid when due, the personal property pledged shall be forfeit to the lender. The property is known as collateral. But if the sale does not meet the amount of the debt, legal action may be necessary. A contract of pledge specifies what is owed, the property that shall be used as a pledge, and conditions for satisfying the debt or obligation. In a simple example, John asks to borrow $500 from Mary. Mary decides first that John will have to pledge his stereo as security that he will repay the debt by a specific time"}, {"url": "https://www.tsl.texas.gov/ref/abouttx/flagpledge.html", "passage_text": "Pledge of allegiance to the state flag. The pledge of allegiance to the Texas state flag is. Honor the Texas flag; I pledge allegiance to thee, Texas, one state under God, one and indivisible.. The pledge was again amended by House Bill 1034 during the 80th Legislature with the addition of one state under God.. The revised wording became effective on June 15, 2007. The text of the current law, Chapter 3100, Sections 3100.101 - 3100.104 of the Texas Government Code, is available to be viewed online."}, {"url": "https://en.wikipedia.org/wiki/Pledge_%28law%29", "passage_text": "The term is also used to denote the property which constitutes the security. A pledge is type of security interest. Pledge is the pignus of Roman law, from which most of the modern European-based law on the subject is derived, but is generally a feature of even the most basic legal systems. No right is acquired by the wrongful sale of a pledge except in the case of property passing by delivery, such as money or negotiable securities. In the case of a wrongful sale by a pledgee, the pledgor cannot recover the value of the pledge without a tender of the amount due."}, {"url": "https://en.wikipedia.org/wiki/Pledge_%28law%29", "passage_text": "It differs from hypothecation and from the more usual mortgage in that the pledge is in the possession of the pledgee. It is similar, however, in that all three can apply to personal and real property. A pledge of personal property is known as a pawn and that of real property is called an antichresis. In earlier medieval law, especially in Germanic law, two types of pledge existed, being either possessory (cf. No right is acquired by the wrongful sale of a pledge except in the case of property passing by delivery, such as money or negotiable securities. In the case of a wrongful sale by a pledgee, the pledgor cannot recover the value of the pledge without a tender of the amount due."}, {"url": "http://www.merriam-webster.com/dictionary/pledge", "passage_text": "Full Definition of PLEDGE. 1. a: a bailment of a chattel as security for a debt or other obligation without involving transfer of title b: the chattel so delivered c: the contract incidental to such a bailment. 2. Definition of PLEDGE for Kids. 1. : a promise or agreement that must be kept. 2. : something handed over to another to ensure that the giver will keep his or her promise or agreement. 3. : a promise to give money."}]