[{"url": "https://en.wikipedia.org/wiki/Deferral", "passage_text": "A Deferral, in accrual accounting, is any account where the asset or liability is not realized until a future date (accounting period), e.g. annuities, charges, taxes, income, etc. The deferred item may be carried, dependent on type of deferral, as either an asset or liability. See also accrual. Deferred revenue (or deferred income) is a liability, such as cash received from a counterpart for goods or services that are to be delivered in a later accounting period. When such income item is earned, the related revenue item is recognized, and the deferred revenue is reduced."}, {"url": "http://smallbusiness.chron.com/kind-account-deferred-revenue-64696.html", "passage_text": "However, deferred revenue is actually reported on a company's balance sheet as a liability. Deferred revenue is commonly reported on the balance sheets of service companies when clients pay for services before the service is rendered. Some examples of service companies include landscapers, lawyers and contractors. Definition of Deferred Revenue. Deferred revenue represents income received but not yet earned. For example, when a landscaping company bills its customer $200 on the first of the month for services that will be performed during that month, the landscaper will report $200 in deferred revenue."}, {"url": "https://en.wikipedia.org/wiki/Deferred_income", "passage_text": "From Wikipedia, the free encyclopedia. Deferred income (also known as deferred revenue, unearned revenue, or unearned income) is, in accrual accounting, money received for goods or services which have not yet been delivered. However, the company's fiscal year ends on May 31. So, the company using accrual accounting adds only five months' worth (5/12) of the fee to its revenues in profit and loss for the fiscal year the fee was received. The rest is added to deferred income (liability) on the balance sheet for that year."}, {"url": "http://www.investopedia.com/terms/d/deferredrevenue.asp", "passage_text": "DEFINITION of 'Deferred Revenue'. Advance payments or unearned revenue, recorded on the recipient's balance sheet as a liability, until the services have been rendered or products have been delivered. Deferred revenue is a liability because it refers to revenue that has not yet been earned, but represents products or services that are owed to the customer. As the product or service is delivered over time, it is recognized as revenue on the income statement. Next Up."}, {"url": "http://yourbusiness.azcentral.com/kind-account-deferred-revenue-9816.html", "passage_text": "When a company uses the accrual basis of accounting, revenue is recognized on the company's income statement when it is earned. When the customer pays for the job or service before the work has been performed and completed, the payment is recorded on the company's balance sheet as deferred, or unearned, revenue. At the end of September, the balance in the deferred revenue account will be $5,500, the total advance payment for the contract minus the services provided in the first month that are now recognized in revenue."}, {"url": "http://smallbusiness.chron.com/kind-account-deferred-revenue-64696.html", "passage_text": "A service company will report deferred revenue on its balance sheet. Zedcor Wholly Owned/PhotoObjects.net/Getty Images. At first glance, the deferred revenue account would seem to be a revenue, or income, account that would be included on a company's income statement. Definition of Deferred Revenue. Deferred revenue represents income received but not yet earned. For example, when a landscaping company bills its customer $200 on the first of the month for services that will be performed during that month, the landscaper will report $200 in deferred revenue."}, {"url": "http://yourbusiness.azcentral.com/kind-account-deferred-revenue-9816.html", "passage_text": "Deferred revenue is a liability account found on the company's balance sheet. The balance represents advance payments received from customers for products that will be shipped or services that will be performed in the future. At the end of September, the balance in the deferred revenue account will be $5,500, the total advance payment for the contract minus the services provided in the first month that are now recognized in revenue."}, {"url": "http://smallbusiness.chron.com/kind-account-deferred-revenue-64696.html", "passage_text": "Although deferred revenue is reported as a liability and may not be thought of as a positive item on a company's balance sheet, deferred revenue can provide important information about a company. Definition of Deferred Revenue. Deferred revenue represents income received but not yet earned. For example, when a landscaping company bills its customer $200 on the first of the month for services that will be performed during that month, the landscaper will report $200 in deferred revenue."}, {"url": "http://yourbusiness.azcentral.com/kind-account-deferred-revenue-9816.html", "passage_text": "To demonstrate how deferred revenue appears on a company's balance sheet as a liability and is later recognized as revenue, assume that an information technology company enters a 12-month contract on Aug. 15 to provide network support to a corporation with 50 employees. At the end of September, the balance in the deferred revenue account will be $5,500, the total advance payment for the contract minus the services provided in the first month that are now recognized in revenue."}]