[{"url": "http://www.newzealand.com/int/visas-and-immigration/", "passage_text": "You do not need a visa or permit to visit New Zealand if you are: 1  A New Zealand/Australia citizen or Resident Permit holder. 2  An Australian citizen travelling on an Australian passport. If you come from Visa-waiver countries, you don't need a visa to enter New Zealand, but are still required to provide: 1  Travel tickets or evidence of onward travel arrangements."}, {"url": "http://www.australia.com/en/planning/visa-information.html", "passage_text": "Visa Information. Unless you are an Australian or New Zealand citizen, you will need a visa to enter Australia. New Zealand passport holders can apply for a visa upon arrival in the country. All other passport holders must apply for a visa before leaving home. You can apply for a range of visas, including tourist visas and working holiday visas, at your nearest Australian Consulate. You can also apply for certain types of visas online."}, {"url": "https://www.seasonworkers.com/workpermitsandVisas/unitedkingdom/workingholidayvisa.aspx", "passage_text": "What You Can Do. Travellers on a UK Working Holiday Visa can holiday in the UK for 24 months. The work permit on the visa allows you to work for 12 of the 24 months in any job, except if you are a professional sportsperson or intend to set up a business. To apply for a UK Working Holiday Visa, first check to see if your country of origin is a participating country in the visa programme, at the UK Visa Bureau website. It is possible that countries outside of the list on the Visa Bureau website are included in the programme."}, {"url": "http://www.wikihow.com/Apply-For-American-Tourist-Visa-B2", "passage_text": "1 If you are traveling to the U.S. for 90 days or less and are from a participating country, you may be eligible for the Visa Waiver Program. 2  Visit travel.state.gov to see if you qualify or if your country is one of the participating countries. "}, {"url": "http://travel-visa-info.com/us-visas/", "passage_text": "There are many types of visas that allow you to go to the USA for tourism, business purposes, visiting relatives or friends, studying, working and other purposes. Non-US residents need a valid visa or an entry permit to travel/transit to the US. Travellers from Visa Waiver Program (VWP) countries can apply online for an entry permit or visa waiver to travel to the United States for stays of up to 90 days, for a period of up to two years. Visitor visas are split into two categories – B-1 visas are for business travel, B-2 visas are for the purposes of tourism, social or sporting events, competitions, or medical treatment. Also, if you wish to stay in the US and travel for a period of up to six months, then a B-2 Visitor Visa may be right for you."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20090807010133AA5myeY", "passage_text": "This Site Might Help You. RE: Do you need a visa to travel form Australia to the United States of America? I&#39;m traveling over to America in September for 3 week holiday and I was wondering if I needed a visa to go there. A source would be appreciated too. Do you need a visa to travel form Australia to the United States of America? I'"}, {"url": "https://www.seasonworkers.com/workpermitsandVisas/unitedkingdom/workingholidayvisa.aspx", "passage_text": "You will need a valid passport for the period you will be holidaying in the UK. Your passport must also show you are from a country that is participating in the Working Holiday Visa Programme with the UK. You will also need to prove you do not have any dependents with you, unless they are a partner with a Working Holiday Visa valid for the same period of time. To apply for a UK Working Holiday Visa, first check to see if your country of origin is a participating country in the visa programme, at the UK Visa Bureau website. It is possible that countries outside of the list on the Visa Bureau website are included in the programme."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20071001023752AAB5bRN", "passage_text": "Report Abuse. It depends on your nationality, the passport holders of the 27 countries listed on this website do not need a visa, if you're not from one of these 27 countries, you will need a visa to enter the United States: http://travel.state.gov/visa/temp/withou... Just saw that you said you're from the UK, you DON'T need a visa. Rating Newest Oldest. Best Answer: Just to clear up any confusion, if you are from the United Kingdom then you do not need a visa for a weeks holiday in the United States providing you meet all of the requirements to travel visa-free under the visa waiver program."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20071001023752AAB5bRN", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: Just to clear up any confusion, if you are from the United Kingdom then you do not need a visa for a weeks holiday in the United States providing you meet all of the requirements to travel visa-free under the visa waiver program. The first website below details these requirements"}]