[{"url": "http://www.kidneyservicechina.com/high-creatinine-level/2641.html", "passage_text": "Serum creatinine level is one determining factor of the health of our kidneys. If you have high creatinine level, it is more likely to result from kidney problems. Ketosteril is one western medicine used commonly to reduce high creatinine levels."}, {"url": "http://www.kidneyfailureweb.com/treatment/245.html", "passage_text": "Ketosteril can also be used for renal dialysis patients to supply some amino acids that are lost during dialysis and prevent malnutrition due to protein decomposition. It can also function as phosphorus binder to lower the levels of serum phosphorus and parathyroid hormone. In a word, ketosteril has the following curative effects for renal failure patients. Reducing the accumulation of metabolic wastes and toxins such as blood urea nitrogen, serum creatinine, uric acid, etc."}, {"url": "http://www.kidneyfailureweb.com/treatment/159.html", "passage_text": "Ketosteril Treatment for Kidney Failure Patients. If you are now having kidney failure and your serum creatinine is high but you have not begun dialysis or you do not want to begin dialysis, ketosteril is a good non-dialysis treatment option for you. As has been mentioned above, ketosteril treatment needs to be combined with low-protein diets to consolidate the curative effects of ketosteril. Adult kidney failure patients should have no more than 40g protein everyday and it can be taken as long term treatment because ketosteril has very low toxicity to the kidneys."}, {"url": "http://kidney-medication.blogspot.com/2013/10/Ketosteril-600.html", "passage_text": "Buy Ketosteril 600 mg used to treat kidney medication at wholesale price USA,UK, Canada ,china, hongkong, south Africa worldwide exporter and supplier, For Bulk order Ketosteril call us +91-9873336444. Ketosteril Tablets is a common medicine for various kidney problems. It helps relieve your symptoms while takes side effects at the same time. For oral use. Swallow whole. Adults (70 kg body weight): If not otherwise prescribed take 4-8 tablets 3 times a day during meals. Ketosteril uses. Ketostril is used in Prevention and therapy of damages due to faulty or deficient protein metabolism in chronic renal insufficiency in connection with limited protein in food of 40 g per day (for adults) and less; i.e. generally in patients with a glomerular filtration rate (GFR) below 25 ml/min."}, {"url": "http://www.kidney-cares.org/creatinine/991.html", "passage_text": "Ketosteril, along with low-protein diets, has been used in clinic to help lower creatinine and treat chronic renal failure, especially those that have GFR lower than 25ml/min. With low-protein diets (less than 40g/d for adults), ketosteril can be taken for long-term use. It can make use of nitrogens of non-essential amino acids and turn into essential amino acids so as to reduce urea production and at the same time avoiding malnutrition due to lack of protein intake."}, {"url": "http://www.kidney-cares.org/creatinine/150.html", "passage_text": "What are the Effects of Ketosteril for Lowering Creatinine. Ketosteril is generally known as Compound α-Ketoacid Tablets and it is used for preventing and treating renal damages due to protein metabolism disorder in chronic kidney disease(CKD) and the effects are better with low-protein diets. The combination of ketosteril and low-protein diet can achieve the following functions: 1. Alleviate the symptoms of uremia. The symptoms and discomforts of uremia are caused by the excessive accumulation of metabolic wastes of proteins."}, {"url": "http://onlineshoppharmacy.com/index.php?route=product/product&product_id=78", "passage_text": "Buy Ketosteril Online (Methionine) Essential Amino Acid 600 mg 100 Tablets. Ketosteril is a medicine which is used to treat High Creatinine in urine or blood. The generic name of Ketosteril is methionine, is a type of Essential Amino Acids helping to lower the high creatinine level in body. Ketosteril is produced (manufactured) by Fresenius Kabi. Each pack of Ketosteril contains 100 tablets (600 mg essential amino acid for each tablet). Ketosteril generally known as Compound α-Ketoacid Tablets and it is used for preventing and treating renal damages due to protein metabolism disorder in chronic kidney disease (."}, {"url": "http://www.kidney-cares.org/creatinine/150.html", "passage_text": "Ketosteril can supply amino acid and reduce the producing of urea and help lower the level of creatinine and urea nitrogen and at the same time improve the nutritional status. The combination of ketosteril and low-protein diet can achieve the following functions: 1. Alleviate the symptoms of uremia. The symptoms and discomforts of uremia are caused by the excessive accumulation of metabolic wastes of proteins."}, {"url": "http://kidney-medication.blogspot.com/", "passage_text": "Buy Ketosteril 600 mg used to treat kidney medication at wholesale price USA,UK, Canada ,china, hongkong, south Africa worldwide exporter and supplier, For Bulk order Ketosteril call us +91-9873336444. Ketosteril Tablets is a common medicine for various kidney problems. "}, {"url": "http://www.kidneyfailureweb.com/treatment/159.html", "passage_text": "Usually ketosteril will be prescribed by the doctors if the patients progress from the third stage to the 4th stage of renal failure when their GFR is lower than 25. The main components of ketosteril are amino acids and calcium amino acid compounds. As has been mentioned above, ketosteril treatment needs to be combined with low-protein diets to consolidate the curative effects of ketosteril. Adult kidney failure patients should have no more than 40g protein everyday and it can be taken as long term treatment because ketosteril has very low toxicity to the kidneys."}]