[{"url": "http://www.amednews.com/article/20120201/profession/302019996/8/", "passage_text": "Though the average length-of-stay figure was drawn higher by the 12% of patients who remain in hospice longer than 180 days, half of patients spend 19.7 days or less in hospice. That figure also is down since 2008, when the median hospice stay was 21.3 days, said the report (link). The figures cover hospice care delivered at patients' homes and in inpatient settings. The data do not reflect the first year of experience with a Medicare regulation that took effect in January 2011."}, {"url": "http://www.nahf.org.uk/what-is-a-hospice.html", "passage_text": "That is not true. The average stay in a hospice is twelve to fourteen days, after which many patients return home feeling better. During their stay, patients will receive treatment (known as palliative care) to help relieve pain and other symptoms causing discomfort."}, {"url": "http://usatoday30.usatoday.com/news/health/2001-08-20-hospice-care.htm", "passage_text": "But the average length of stay in a hospice fell from an average of 90 days in 1990 to 48 days in 1999, according to the IOM. Half of Medicare hospice users received care for 19 days or less, the General Ac-. counting Office found in a review last year. A week or less was common."}, {"url": "http://www.cms.gov/Medicare/Medicare-Fee-for-Service-Payment/Hospice/Medicare_Hospice_Data.html", "passage_text": "Average Length of Stay. Along with the shift in the mix of hospice patients, there exists a significant increase in the average length of stay (LOS) for hospice patients. In 1998, the average LOS for hospice patients was 48 days, but by 2006 it had risen to 73 days (a 52% increase). Since 2006, the average LOS has begun to decline slightly, dropping to 71 days in 2009, which is a 48% increase from 1998. Charts 1 and 2 show that the average LOS varies by diagnosis."}, {"url": "http://hankdunn.com/hospice-care-too-long/", "passage_text": "The average length of stay in hospice care from admission until death is 17 days. That means when you add the number of total days Medicare pays for and divide by the number of patients receiving hospice care the average"}]