[{"url": "https://en.wikipedia.org/wiki/Gattaca", "passage_text": "Characters in Gattaca continually battle both with society and with themselves to find their place in the world and who they are destined to be according to their genes. In a 1997 review of the film for the journal Nature Genetics, molecular biologist Lee M. Silver stated that  Gattaca is a film that all geneticists should see if for no other reason than to understand the perception of our trade held by so many of the public-at-large."}, {"url": "https://en.wikipedia.org/wiki/Gattaca", "passage_text": "For the real-world place (a suburb of Liverpool) of the same pronunciation, see Gateacre. Gattaca is a 1997 American science fiction film written and directed by Andrew Niccol. It stars Ethan Hawke and Uma Thurman, with Jude Law, Loren Dean, Ernest Borgnine, Gore Vidal, and Alan Arkin appearing in supporting roles. In a 1997 review of the film for the journal Nature Genetics, molecular biologist Lee M. Silver stated that  Gattaca is a film that all geneticists should see if for no other reason than to understand the perception of our trade held by so many of the public-at-large."}, {"url": "http://medical-dictionary.thefreedictionary.com/genocopy", "passage_text": "A genotype at one locus that produces a phenotype that at some levels of resolution is indistinguishable from that produced by another genotype; e.g., two types of elliptocytosis that are genocopies of each other, but are distinguished by the fact that one is linked to the Rh blood group locus and the other is not. "}, {"url": "https://en.wikipedia.org/wiki/Gattaca", "passage_text": "The film's title is based on the first letters of guanine, adenine, thymine, and cytosine, the four nucleobases of DNA. It was a 1997 nominee for the Academy Award for Best Art Direction and the Golden Globe Award for Best Original Score. In a 1997 review of the film for the journal Nature Genetics, molecular biologist Lee M. Silver stated that  Gattaca is a film that all geneticists should see if for no other reason than to understand the perception of our trade held by so many of the public-at-large."}, {"url": "https://en.wikipedia.org/wiki/Gattaca", "passage_text": "The police find a fallen eyelash of Vincent's at the scene. An investigation is launched to find the murderer, Vincent being the top suspect. Through this, Vincent becomes close to a co-worker, Irene Cassini, and falls in love with her. In a 1997 review of the film for the journal Nature Genetics, molecular biologist Lee M. Silver stated that  Gattaca is a film that all geneticists should see if for no other reason than to understand the perception of our trade held by so many of the public-at-large."}, {"url": "http://www.studymode.com/essays/Gattaca-137879.html", "passage_text": "My presentation today will be regarding the pros of eugenics and its impact on society. After studying the movie GATTACA, it is clear that eugenics plays a vital role in the storyline. Although the movie was created in 1997 and was set in the ‘not too distant future’, it is evident that what was fictional is partially becoming reality. The further enhancement of eugenics is becoming rapid, and profound. Many people have a negative attitude towards eugenics after inspecting GATTACA; the cons of eugenics have been demonstrated flawlessly in the movie. But what GATTACA fails to do is cover in depth the pros of this new and advanced technology we possess."}, {"url": "http://www.depauw.edu/sfs/essays/gattaca.htm", "passage_text": "Genetic engineering represents our fondest hopes and aspirations as well as our darkest fears and misgivings. That’s why most discussions of the new technology are likely to be so heated. The technology touches the core of our self-definition. In their book The DNA Mystique, Nelkin and Lindee have found that the creators of popular culture act as another ally for genetic determinism, arguing that the rising public acceptance of this ideology has translated into a cult of the gene increasingly visible in popular-culture narratives (3)."}, {"url": "http://www.philfilms.utm.edu/1/gattaca.htm", "passage_text": "Philosophically, however, it is rather tempting to toss Gattaca out the window. The philosophical content it does offer is quite accessible, and rather than being incidental to the plot, it is actually the focus of the film. Its take on human determinism, though, can only go so far. Gattaca: This movie was eye opening in the sense that society felt like they had to label social classes based on the genetic make up of a human being. Vincent is a man who starts out with a hard life, but is given the chance to fulfill his dreams of outer space travel."}, {"url": "http://www.academia.edu/1045409/Extrapolating_Race_in_Gattaca_Genetic_Passing_Identity_the_New_Eugenics_and_the_Science_of_Race", "passage_text": "Rather than leading to the racial utopia as depicted in GATTACA, the acceptance of a genetic basis of race will only further segregate society. NOTES 1. GATTACA, directed by Andrew Niccol, 1997, Columbia Tristar Pictures. The title of the film is actually an acronym of sorts. Given the rejection of familial associations in favor of genetic associations, it is not surprising that other cultural relationships break down in GATTACA’s genetic determinist society. In essence, GATTACA sets up a dystopian world in regard to genes and a utopian world in regard to race."}, {"url": "http://www.academia.edu/1045409/Extrapolating_Race_in_Gattaca_Genetic_Passing_Identity_the_New_Eugenics_and_the_Science_of_Race", "passage_text": "Contemporary Scientific Racism and the Extrapolation of Race in GATTACA The racially harmonious society portrayed in GATTACA does not project today’s social conservativism, which extends genetic determinism to include a biological definition of race. Given the rejection of familial associations in favor of genetic associations, it is not surprising that other cultural relationships break down in GATTACA’s genetic determinist society. In essence, GATTACA sets up a dystopian world in regard to genes and a utopian world in regard to race."}]