[{"url": "http://www-personal.umich.edu/~lormand/poli/nike/nike101-8.htm", "passage_text": "Nike's operating profit Cost to retailer $0.25 $4.00 $5.00 $6.23 $35.50 Retailer's rent Personnel Other Retailer's operating profit Cost to consumer $9.00 $9.50 $7.00 $9.00 $70.00. Appendix 1. Breakdown of costs for a pair of Nike shoes from an Indonesian plant, 1995 (. ). "}, {"url": "http://www.answers.com/Q/Average_price_of_a_pair_of_shoes", "passage_text": "The average cost for a pair of these shoes is approximately $50 - $100 per pair. The average price of a pair of Chanel shoes will cost you about $500. Of course, if you catch them on sale you might be able to pay as little as $300. Chanel does have many th … at are higher priced also. Answers Publisher."}, {"url": "http://www.answers.com/Q/Average_price_of_a_pair_of_shoes", "passage_text": "Saucony is a popular brand of running shoes. The average cost for a pair of these shoes is approximately $50 - $100 per pair. Some models can be higher, with pricing depende … nt on style and model of the shoe. The average price of a pair of Chanel shoes will cost you about $500. Of course, if you catch them on sale you might be able to pay as little as $300. Chanel does have many th … at are higher priced also. Answers Publisher."}, {"url": "http://www.citizen-times.com/story/opinion/contributors/2014/07/27/real-costs-pair-sneakers/13181055/", "passage_text": "The “Powder Blue” Air Jordan 10 hit retail stores in late February; first day sales reportedly topped $35 million worldwide. Air Jordans are manufactured in China and reportedly cost Nike a bit more than $16 a pair. The Air Jordan 10s are listed on Amazon for $250 to $550 a pair, depending on the style and color. If that strikes you as a rather hellacious markup, welcome to the world of “luxury” goods, where the selling price is determined not by the cost of the goods, but by the status that buyers think they confer. "}, {"url": "http://www.nationmaster.com/country-info/stats/Cost-of-living/Clothing-and-shoe-prices/Shoes/Pair-of-Nikes", "passage_text": "DEFINITION: 1 Pair of Nike Shoes. Based on 0-50 contributions for Afghanistan, Aland Islands, Andorra and 81 more countries and 50-100 contributions for Albania, Algeria, Armenia and 19 more countries and over 100 contributions for Argentina, Australia, Austria and 82 more countries. "}, {"url": "https://www.linkedin.com/pulse/20141017084233-346919219-calculate-simple-womens-high-heels-shoe-cost-from-gary-shoe-factory", "passage_text": "Our shoe upper leather we use the cost is 4.3USD/SQF,Lining leather is 2.6USD/SQF. So our upper and lining cost is 4.3*2.2=9.46USD/pair and 2.6*2.1 =5.46USD/pair. The heel and platform cost is 1.6USD/Pair. The sole is 2.4USD/pair.Cutting mold is 1.6USD/pair.Insole is 1.5USD/pair.The packaging box is 1.6USD/Pair. Our work labour is 10USD/Pair.Profit is 2USD/pair.Shoe last cost each pair share 3USD/pair. So the total cost will be 9.46+5.46+1.6+2.4+1.6+1.5+1.6+3= 26.62USD/Pair. This is for high quality materials with high end quality. "}, {"url": "http://www.whydev.org/some-bad-news-about-toms-shoes/", "passage_text": "Assuming each pair of shoes is about a $27 value (half the cost of the average buy-one-give-one TOMS shoe), you can give each child a pair for $27,000, a fix that would likely prevent any continued hookworm incidence for the next two years until the shoes inevitably wear out (that’s a generous time frame). Assuming their margin is 75%, a pair of shoes costs them $7, and the latrine is the equivalent cost of 286 pairs of shoes which could serve 3 communities of the size in your example. I get your argument – solve the underlying problem – but they still need shoes either way."}, {"url": "http://www.bizjournals.com/portland/blog/threads_and_laces/2014/12/the-cost-breakdown-of-a-100-pair-of-sneakers.html", "passage_text": "Nike veteran Steve Bence on Tuesday broke down the costs of a $100 shoe in a workshop at… more. Portland Business Journal | Matthew Kish. He said it costs a sneaker company about $28.50 to manufacture a pair of shoes in Asia and have it shipped to the United States. That includes $25 for labor and factory costs and $1 in shipping. Sneaker companies spend $15 on various overhead costs and $2 on taxes and net a $4.50 profit (9 percent) on each pair of shoes, which are then sold to wholesalers, such as sporting goods stores, for $50."}, {"url": "http://www.whydev.org/some-bad-news-about-toms-shoes/", "passage_text": "If a pair of TOMS is $54 as your example implies, it may cost TOMS $4 or $5 per pair MAX. This would be they could donate $4 or $5k not 27. There is no way those funds would help 13 other districts. Assuming their margin is 75%, a pair of shoes costs them $7, and the latrine is the equivalent cost of 286 pairs of shoes which could serve 3 communities of the size in your example. I get your argument – solve the underlying problem – but they still need shoes either way."}]