[{"url": "http://tvtropes.org/pmwiki/pmwiki.php/Film/TheAbyss", "passage_text": "Film: The Abyss. The Abyss is a Science-Fiction film that was written and directed by James Cameron. It stars Ed Harris, Mary Elizabeth Mastrantonio, and Michael Biehn. The original musical score was composed by Alan Silvestri. With today's tech-infrastructure the movie could be made at a fraction of the cost with full CGI, but in 1989 the shots were often live footage combined with greenscreen models, matte photography, animatronics and CGI elements. A novelization of this film was written by Orson Scott Card, based on the screenplay."}, {"url": "http://www.imdb.com/title/tt0096754/", "passage_text": "The Abyss was a movie of destiny. First off, this movie either began or was the result of a lifetime obsession James Cameron has the ocean (see later Titanic and his IMAX deep sea movies). The Abyss is also full of echos of claustrophobic thriller/adventure movie Alien, in which Cameron directed the sequel. So combining one of Cameron's old movies with his new obsession, we get The Abyss, a solid sci-fi thriller starring Ed Harris and Mary Elizabeth Mastrantonio"}, {"url": "https://en.wikipedia.org/wiki/The_Abyss", "passage_text": "The Abyss is a 1989 American science fiction film written and directed by James Cameron, starring Ed Harris, Mary Elizabeth Mastrantonio, and Michael Biehn. The studio unsuccessfully lobbied hard to get Michael Biehn nominated for the Academy Award for Best Supporting Actor. Many other film organizations, such as the Academy of Science Fiction, Fantasy & Horror Films and the American Society of Cinematographers, also nominated The Abyss."}, {"url": "http://www.movie-locations.com/movies/a/abyss.html", "passage_text": "The Abyss ’s underwater scenes were filmed in an uncompleted nuclear power station. The Duke Power Company’s Cherokee Power Station never went on line and was subsequently abandoned only to be snapped up by movie entrepreneur Earl Owensby – owner of the Owensby Studios in North Carolina. He rented the facility out to The Abyss ’s production company, who built the film’s ‘Deepcore’ sets inside the two gigantic concrete tanks. When filled, they became, at 7.5 million gallons and 2.6 million gallons, two of the largest freshwater containers in the world."}, {"url": "https://en.wikipedia.org/wiki/Into_the_Abyss_%28film%29", "passage_text": "Into the Abyss (film). From Wikipedia, the free encyclopedia. Into the Abyss, subtitled A Tale of Death, a Tale of Life, is a documentary film written and directed by Werner Herzog about two men convicted of a triple homicide which occurred in Conroe, Texas. Michael Perry received a death sentence for the crime. The film was first shown on September 3, 2011, at the Telluride Film Festival, and had its official world premiere on September 8, 2011, at the 2011 Toronto International Film Festival. Herzog had long considered making a film about prison inmates. In fact, Herzog at age 17 had intended to make his first film about the maximum security Straubing prison in Bavaria. This concept was never realized, but the idea remained dormant until Into the Abyss decades later."}, {"url": "https://en.wikipedia.org/wiki/The_Abyss", "passage_text": "The sense of something being missing on Aliens was greater for me than on The Abyss, where the film just got consistently better as the cut got along. The film must function as a dramatic, organic whole. The studio unsuccessfully lobbied hard to get Michael Biehn nominated for the Academy Award for Best Supporting Actor. Many other film organizations, such as the Academy of Science Fiction, Fantasy & Horror Films and the American Society of Cinematographers, also nominated The Abyss."}, {"url": "http://www.sciway.net/movies/sc-movie-abyss.html", "passage_text": "The Abyss: Fun Facts. 1  The Abyss used the largest underwater set to date, at more than 7.5 million gallons. 2  It won an Oscar for best visual effects in 1990. 3  The containment tanks at the Cherokee Nuclear Power Plant were built in the mid-1970s by Duke Power, but never served their intended use. 1 I actually worked on The Abyss as a First Assistant Cameraman on Camera B for several weeks. 2  I also worked with Camera C, which was a Steadicam. 3  I worked on most of the scenes which were shot on the main dry set known as Deep Core. 4  I was there when the ILM crew came in to shoot the watersnake sequence."}, {"url": "https://en.wikipedia.org/wiki/Into_the_Abyss_%28film%29", "passage_text": "Into the Abyss, subtitled A Tale of Death, a Tale of Life, is a documentary film written and directed by Werner Herzog about two men convicted of a triple homicide which occurred in Conroe, Texas. Herzog had long considered making a film about prison inmates. In fact, Herzog at age 17 had intended to make his first film about the maximum security Straubing prison in Bavaria. This concept was never realized, but the idea remained dormant until Into the Abyss decades later."}, {"url": "https://en.wikiquote.org/wiki/The_Abyss", "passage_text": "A place on earth more awesome than anywhere in space. taglines. The Abyss is a 1989 film about an undersea mobile oil-rig crew who are called on to assist in the recovery of a lost nuclear submarine, but who find unexpected mysteries and perils in the mission. "}]