[{"url": "http://www.petplace.com/article/drug-library/library/over-the-counter/loperamide-imodium", "passage_text": "Overview of Loperamide (Imodium®) for Canines and Felines. 1  Loperamide, commonly known as Imodium®, is used to treat diarrhea in cats and dogs. 2  Loperamide is a synthetic piperidine derivative, a weak narcotic with antidiarrheal properties. 3  Loperamide works by slowing the movement of the intestines. 1 Loperamide, commonly known as Imodium®, is used to treat diarrhea in cats and dogs. 2  Loperamide is a synthetic piperidine derivative, a weak narcotic with antidiarrheal properties. 3  Loperamide works by slowing the movement of the intestines. 4  It may decrease intestinal secretions and may enhance mucosal absorption"}, {"url": "https://answers.yahoo.com/question/index?qid=20070416172308AAsXjZs", "passage_text": "Never give an animal human medicine without an okay from your vet. Some human medicines can be deadly in animals. If you won't take you cat to the vet, maybe you should try a different food, try something for a sensitive stomach. Also, is your cat allowed outdoors, it might be getting into garbage or worse. "}, {"url": "http://www.answers.com/Q/Can_cats_take_Imodium_aka_immodium_or_Loperamide_for_diarrhea", "passage_text": "Many things can cause diarrhea in felines, the most common being food allergies, intestinal parasites and even some antibiotics can interfere with a cat's stomach. If you are … not sure of the cause, it is advised to take your cat to the vet. Plain, easily digested foods are usually the best treatment. But you can give Pepto Bismol or Imodium AD, for diarrhea- (1/2 a 2mg tablet for a 20-30 lb. dog, 2-4x day max at 4-6 hour intervals for dogs, 1/8-1/4 if a tablet or 1ml of the liquid for a 10 lb. cat; if liquid medication, use a syringe inserted in the side of the mouth)."}, {"url": "http://www.vetstreet.com/loperamide-hydrochloride", "passage_text": "GENERAL DESCRIPTION: Loperamide is an affordable drug used in dogs and cats to stop diarrhea. It may also be used to treat acute colitis and malabsorption or maldigestion problems. Loperamide is available over-the-counter in many forms. Consult with your veterinarian to find the product that would suit your pet's needs the best. "}, {"url": "http://www.wikihow.com/Stop-Your-Cat%27s-Diarrhea", "passage_text": "1 If your cat goes outside, check that your neighbors aren't feeding your cat. 2  Eating too much or eating food they aren't used to can give cats diarrhea. 3  Check your yard and your neighbors' yards for poisonous plants that your cat may have nibbled. 4  Your vet should be able to give you a list of poisonous plants. 1 Eating too much or eating food they aren't used to can give cats diarrhea. 2  Check your yard and your neighbors' yards for poisonous plants that your cat may have nibbled. 3  Your vet should be able to give you a list of poisonous plants. 4  You may want to lay down newspaper or absorbent pads to make cleanup easier."}, {"url": "http://www.petmd.com/pet-medication/imodium", "passage_text": "General Description. Loperamide is used to treat diarrhea and acute colitis in humans, but may be prescribed to pets. It is also effective in malabsorption and maldigestion in pets that are not extracting enough nutrients from their food. It is a non-addictive weak narcotic."}, {"url": "http://www.peteducation.com/article.cfm?c=26+1303&aid=1432", "passage_text": "Loperamide is used in the treatment of diarrhea and inflammatory bowel disease in dogs. Can cause severe side effects in cats. Contact your veterinarian if the diarrhea is severe, accompanied by vomiting, the pet is also depressed, there is blood in the stool or the diarrhea worsens or persists for more than 48 hours. "}, {"url": "http://canigivemycat.com/imodium", "passage_text": "No Comment. Imodium might sound like a good idea to give your cat if they are having diarrhea. Sometimes animals experience the same sort of conditions that we face as humans. We are in fact both mammals, so it’s not so strange that we have some of the same experiences. "}]