[{"url": "http://asm-air.com/airconditioning/much-cost-run-air-conditioner/", "passage_text": "For our example today, we will use Santa Clarita, California which would have an average cost per Kilowatt-Hour of 14.37 cents. Next, multiply the Kilowatt-Hours found in step 2 by this price to find out how much it costs to run your air conditioner for one hour. Then multiply it by 24 to find out how much it costs for a day, and then by 30 to find out how much it costs to run your air conditioner for a month. 4.32 X 14.37 = 62 cents an hour, 62 X 24 = $14.89 per day, $14.89 X 30 = $446.96 per month, 0.53 X 24 = $12.72. Cost per Month to Run Your Air Conditioner: $12.72 X 30 = $381.60. Using the multiplier for a 100 degree Santa Clarita summer again, we get: $381.60 X 0.4 = $152.64. That’s a $26.00 a month difference from our basic calculation, all by using actual data."}, {"url": "http://energyusecalculator.com/electricity_centralac.htm", "passage_text": "The energy use of a central air conditioner highly depends on the climate of the region, a central air conditioner will run 3 to 7 months of the year depending on the outside temperature. An average central ac will use 3000 to 5000 watts of power every hour for around 9 hours a day during the hotter months. Click calculate to find the energy consumption of a central air conditioner using 3500 Watts for 3 hours a day @ $0.10 per a kWh. Running 3 hours a day is the same as running 9 hours a day for 4 of the warmer months. Cost Per Hour: Cost Per Day: "}, {"url": "https://answers.yahoo.com/question/index?qid=20100415151717AAY04DI", "passage_text": "Best Answer: One 5,000 btu window unit pulls 6.3 amps and 115 volts. Watts equal a x v, so it uses 724 Watts. 12 Hours x 30 days equals 360 Hours. 1 kWh = $.095. So, 360 Hours x 724 Watts = 260640 Watts Divide by 1000 = 260 killowatts Multiply by $.095 = $24.70 dollars per month About a dollar a day. "}, {"url": "http://homeguides.sfgate.com/cost-run-5000-btu-air-conditioner-60906.html", "passage_text": "1 The cost to operate the unit will vary from region to region. 2  In the San Francisco Bay Area, for example, the kilowatt-hour cost is about 63 percent greater than the national average, so it would cost about $950 annually to run a 5,000-Btu air conditioner. Tip. 1 "}, {"url": "http://homeguides.sfgate.com/cost-run-5000-btu-air-conditioner-60906.html", "passage_text": "Determine how much the air conditioner would cost to run over a 24-hour period. Use the basic formula of watts x hours of use ÷ 1,000 x cost per kilowatt-hour = cost of operation. Tip. 1  The cost to operate the unit will vary from region to region. 2  In the San Francisco Bay Area, for example, the kilowatt-hour cost is about 63 percent greater than the national average, so it would cost about $950 annually to run a 5,000-Btu air conditioner."}, {"url": "http://homeguides.sfgate.com/cost-run-5000-btu-air-conditioner-60906.html", "passage_text": "In this case, the cost per month will be approximately $45. A yearly cost can be determined by multiplying the cost per week, $11.20, by how many weeks in a year, 52. The total approximate yearly amount to run a 5,000-Btu air conditioner continuously will be about $585. Tip. 1  The cost to operate the unit will vary from region to region. 2  In the San Francisco Bay Area, for example, the kilowatt-hour cost is about 63 percent greater than the national average, so it would cost about $950 annually to run a 5,000-Btu air conditioner."}, {"url": "http://illinoisgreen.com/?p=198", "passage_text": "The formula for calculating the cost is straightforward: Kilowatt hours * cost per kWh * number of hours used. One kWh is equal to 3412 BTU. A 5100 BTU air conditioner will then use 1.49 kWh for each hour it is running. In the Chicago area we are paying $0.11 per kWh. 1.49 * 0.11 * time. The above formula gets us very close to the cost. We only need to figure out how many hours per day we will be using the AC unit."}]