[{"url": "http://www.hobart.k12.in.us/cside/American%20Revolution/revwar/stampact.htm", "passage_text": "The Path to the American Revolution ~~~~~ The Stamp Act. ~~~~~ was passed in March 1765 and became effective November 1, 1765 in the colonies ~~~~~. To pay for some of the costs of the French and Indian War, in March of 1765, Lord George Grenville asked the English Parliament to impose the Stamp Act. This was the first direct tax on the American colonies. In July, the first group of Sons of Liberty is formed in a number of colonial towns. It is an underground organization of people who oppose the Stamp Act. The members decided to use violence and intimidation to fight against the Stamp Act. The Sons of Liberty burned the stamps."}, {"url": "http://www.ushistory.org/us/9b.asp", "passage_text": "The Stamp Act of 1765 was not the first attempt to tax the American colonies. Parliament had passed the Sugar Act and Currency Act the previous year. Because tax was collected at ports though, it was easily circumvented. Indirect taxes such as these were also much less visible to the consumer. The Stamp Act Controversy. When Britain repealed the Stamp Act in 1766 — only a year after it had been issued — colonists celebrated in the streets, as this satirical cartoon from 1766 depicts. Something was dreadfully wrong in"}, {"url": "http://www.answers.com/Q/Why_did_the_colonists_oppose_the_stamp_act", "passage_text": "The colonists opposed the Quartering Act because of taxing from the  already unpopular Stamp Act and the actual requirements of this  act. This act required everyone to give … up their homes to support  military personnel with food and shelter anytime they needed. Confidence votes 16. In the year 1765 Britain enacted the Stamp Act which placed a government stamp of taxation on all paper documents, such as newspapers and playing cards. The colonists, feeling that they were being unfairly taxed, formed protest groups such as the Sons of Liberty"}, {"url": "https://en.wikipedia.org/wiki/Stamp_Act_1765", "passage_text": "The Stamp Act was passed by Parliament on March 22, 1765 with an effective date of November 1, 1765. It passed 205–49 in the House of Commons and unanimously in the House of Lords. Historians Edmund and Helen Morgan describe the specifics of the tax: Howard became the only prominent American to publicly support the Stamp Act in his pamphlet A Colonist's Defence of Taxation (1765). After the riots Howard had to leave the colony but was rewarded by the Crown with an appointment as Chief Justice of North Carolina at a salary of ₤1000."}, {"url": "http://www.samuel-adams-heritage.com/biography/pre-revolution-sugar-act.html", "passage_text": "Sugar Act, 1764 and Stamp Act, 1765. The Sugar Act and the Stamp Act imposed by the British government in 1764 and 1765 respectively, was view with a disapproval eye among people who perceived the British as overstepping their power over the colonies. "}, {"url": "http://www.infoplease.com/encyclopedia/history/stamp-act.html", "passage_text": "Stamp Act, 1765, revenue law passed by the British Parliament during the ministry of George Grenville. The first direct tax to be levied on the American colonies, it required that all newspapers, pamphlets, legal documents, commercial bills, advertisements, and other papers issued in the colonies bear a stamp. "}, {"url": "http://www.answers.com/Q/What_did_Colonists_opposed_to_the_stamp_act_because", "passage_text": "The Stamp Act of 1765 was imposed by the British Parliament on the colonies of North America to pay for the seven years war. The British Govermment thought that the Colonies w … ould benefit from the Military presence and therefore should pay for a portion of the expence. Share to: 1  American Colonies React to the Intolerable Acts By the time Parliament passed the Intolerable Acts in 1774, colonists in America were angry. 2  The Tea Act, passed on May 10, 1773, was the cause of that anger."}, {"url": "http://www.answers.com/Q/Why_did_the_colonists_oppose_the_stamp_act", "passage_text": "The Colonists opposed the Stamp Act because it taxed things that  they needed. They felt they were being taxed without the benefit of  representation in Parliament. Confidence votes 16. In the year 1765 Britain enacted the Stamp Act which placed a government stamp of taxation on all paper documents, such as newspapers and playing cards. The colonists, feeling that they were being unfairly taxed, formed protest groups such as the Sons of Liberty"}, {"url": "http://www.answers.com/Q/What_did_Colonists_opposed_to_the_stamp_act_because", "passage_text": "the colonists opposed to the stamp act because because it highered taxes on certain items and they did not want to pay more on certain items. Share to: 1  American Colonies React to the Intolerable Acts By the time Parliament passed the Intolerable Acts in 1774, colonists in America were angry. 2  The Tea Act, passed on May 10, 1773, was the cause of that anger."}]