[{"url": "http://www.patientsbeyondborders.com/medical-tourism-statistics-facts", "passage_text": "Patients Beyond Borders World Edition. With medical tourism still in its early stages, gaining reliable data is challenging. Our research and editorial team works hard to compile the most accurate, current information on international medical travel, global healthcare, and the international patient experience. "}, {"url": "http://www.medicaltourismassociation.com/en/medical-tourism-faq-s.html", "passage_text": "Medical Tourism Magazine is the only Medical Tourism/Wellness Tourism Magazine in the world that delivers a solution for the healthcare industry both online and in print. Medical Tourism Magazine educates the world about where the best centers of medical excellence are located. Medical Tourism Magazine delivers hard hitting articles written by the experts in the medical tourism industry, discussing issues such as Quality of Care, How to Choose a Hospital, Accreditation issues, How to integrate Medical Tourism into a health insurance plan, legal issues and more."}, {"url": "https://en.wikipedia.org/wiki/Medical_tourism", "passage_text": "Medical tourism may raise broader ethical issues for the countries in which it is promoted. For example, in India, some argue that a policy of 'medical tourism for the classes and health missions for the masses' will lead to a deepening of the inequities already embedded in the health care system. Circumvention tourism is travel in order to access medical services that are legal in the destination country but illegal in the home country. This can include travel for fertility treatments that aren’t yet approved in the home country, abortion, and doctor-assisted suicide."}, {"url": "https://en.wikipedia.org/wiki/Medical_tourism", "passage_text": "Medical tourism is a form of health tourism commonly referring to the travel of people to another country for the purpose of obtaining medical treatment in that country. Circumvention tourism is travel in order to access medical services that are legal in the destination country but illegal in the home country. This can include travel for fertility treatments that aren’t yet approved in the home country, abortion, and doctor-assisted suicide."}, {"url": "http://wikitravel.org/en/Medical_tourism", "passage_text": "This article is a travel topic. Medical Tourism is a growing concept worldwide where people travel to another country for medical treatment at lower cost or to enjoy a vacation along with their treatment. Possible Benefits of Medical Tourism [edit]. 1  Most obvious benefit is lower cost of treatment. 2  Most travelers incorporate a short holiday along with the treatment as these also tend to be cheaper than vacations in their home country."}, {"url": "http://www.passportmedical.com/what-is-medical-tourism/", "passage_text": "Medical tourism is the act of seeking out low-cost, first-class healthcare outside ones’ home country, often while recuperating in beautiful surroundings. "}, {"url": "http://www.discovermedicaltourism.com/what-is-medical-tourism/", "passage_text": "Medical tourism, or ‘global healthcare’ as it’s increasingly called, involves travelling to a foreign country for a medical procedure. This industry has been growing rapidly over recent years as more and more people seek faster or cheaper alternatives to the healthcare offered in their own countries. If the treatment is more severe, medical tourism hospitals such as Bumrungrad have accommodations that seem more like a 5-star hotel than a hospital ward. Popular elective medical services include knee or hip joint replacements, cardiac surgery, cosmetic surgery and dental surgery."}, {"url": "https://en.wikipedia.org/wiki/Medical_tourism", "passage_text": "Another reason for travel for medical treatment is that some treatments may not be legal in the home country, such as some fertility procedures. Some people travel to obtain medical surgeries or other treatments. Some people go abroad for dental tourism or fertility tourism. People with rare genetic disorders may travel to another country where treatment of these conditions is better understood. Circumvention tourism is travel in order to access medical services that are legal in the destination country but illegal in the home country. This can include travel for fertility treatments that aren’t yet approved in the home country, abortion, and doctor-assisted suicide."}, {"url": "http://www.news-medical.net/health/What-is-Medical-Tourism.aspx", "passage_text": "By Dr Tomislav Meštrović, MD, PhD. Medical tourism can be defined as the process of traveling outside the country of residence for the purpose of receiving medical care. Growth in the popularity of medical tourism has captured the attention of policy-makers, researchers and the media. Originally, the term referred to the travel of patients from less-developed countries to developed nations in pursuit of the treatments not available in their homeland. In addition to cost, other major factor responsible for the increase of medical tourism is access. The lack of it, either due to the unavailability of the technology or the prohibition in the home country, can subsequently lead to medical tourism."}, {"url": "http://christianpf.com/medical-tourism/", "passage_text": "In recent years another solution has appeared. Medical tourism has people living in one country and traveling to another to seek medical, dental and surgical care. With the globalization of factories, farming and finance, it is inevitable that yet another major industry like healthcare would join the ranks. There is now even a trade association – The Medical Tourism Association – with its own website. There are success stories, ads for guide books, and an upcoming industry events listing. Separate sections offer material for healthcare providers, governments, insurers, and patients."}]