[{"url": "http://www.encyclopedia.com/topic/Eubacteria.aspx", "passage_text": "There are three domains, two of which, Eubacteria and Archaea, are composed entirely of prokaryotic organisms; the third domain, Eucarya, encompasses all other (eukaryotic) life forms, including the single-cell and multicellular protists, as well as animals, green plants, and fungi."}, {"url": "http://www.encyclopedia.com/topic/Eubacteria.aspx", "passage_text": "Bacteria are microscopic organisms that comprise the domain Eubacteria. A domain is the highest grouping of organisms, superseding the level of kingdom in the classical Linnaean system of biological classification."}, {"url": "http://www.windows2universe.org/earth/Life/classification_eubacteria.html", "passage_text": "The Domain Eubacteria. Eubacteria, also know as true bacteria, are microscopic prokaryotic cells. Cyanobacteria, also called blue-green algae, are Eubacteria that have been living on our planet for over 3 billion years. Blue-green algae grow in the shallow parts of the ocean. Today it is only common in certain regions, but a few billion years ago, there was tons of it!"}, {"url": "http://www.biologyreference.com/Ep-Fl/Eubacteria.html", "passage_text": "Photo by: Sebastian Kaulitzki. Bacteria are microscopic organisms that comprise the domain Eubacteria. A domain is the highest grouping of organisms, superseding the level of kingdom in the classical Linnaean system of biological classification."}, {"url": "http://www.encyclopedia.com/topic/Eubacteria.aspx", "passage_text": "Eubacteria The domain that comprises the single kingdom Bacteria, containing the true bacteria. There are 11 main groups: purple (photosynthetic), Gram-positive, cyanobacteria, green non-sulphur, spirochaetes, flavobacteria, green sulphur, Planctomyces, Chlamydiales, Deinococci, and Thermatogales."}, {"url": "http://classic.sidwell.edu/us/science/vlb5/labs/classification_lab/bacteria/", "passage_text": "Domain Bacteria is composed of organisms that are much more common than Archaea and live almost anywhere. There are more bacteria in a person's mouth than there are people in the world. Many are decomposers, some are photosynthesizers, and a few cause disease."}]