[{"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Geophys/intrus.html", "passage_text": "Intrusive Rocks. Igneous rocks which form by the crystallization of magma at a depth within the Earth are called intrusive rocks. Intrusive rocks are characterized by large crystal sizes, i.e., their visual appearance shows individual crystals interlocked together to form the rock mas"}, {"url": "http://www.bbc.co.uk/bitesize/ks3/science/environment_earth_universe/rock_cycle/revision/4/", "passage_text": "The inside of the Earth is very hot-hot enough to melt rocks. Molten (liquid) rock forms when rocks melt. The molten rock is called magma. When the magma cools and solidifies, a type of rock called igneous rock forms. Obsidian and basalt. If the magma cools quickly, small crystals form in the rock. This can happen if the magma erupts from a volcano. Obsidian and basalt are examples of this type of rock."}, {"url": "http://www.wikihow.com/Identify-Igneous-Rocks", "passage_text": "1 Aphanitic igneous rocks have a fine-grained texture and most of their crystals are too small to see with the naked eye. 2  You will need to use a magnifying glass to observe the crystals in aphanitic rocks. 3  Igneous rocks that form too quickly for crystals to form have what is called a glassy texture. 1 An example of an intrusive rock is granite. 2  When magma is above the earth's crust, it is known as lava. 3  Extrusive rocks form through very fast cooling of lava above the Earth's surface. 4  Extrusive rocks have very small, almost microscopic crystals."}, {"url": "http://geology.about.com/cs/basics_roxmin/a/aa011804c.htm", "passage_text": "Metamorphic rocks are the third great class of rocks. These are what happens when sedimentary and igneous rocks become changed, or metamorphosed (changed in form), by conditions underground. The four main agents that metamorphose rocks are heat, pressure, fluids and strain. "}, {"url": "http://www.wikihow.com/Identify-Igneous-Rocks", "passage_text": "1 Obsidian is the only glassy igneous rock, and can be identified by its dark color. 2  This looks like dark black glass. 3  Vesicular igneous rocks, such as pumice, look bubbly and form before gases are able to escape as lava forms the rock. 4  This also formed with very rapid cooling. 1 An example of an intrusive rock is granite. 2  When magma is above the earth's crust, it is known as lava. 3  Extrusive rocks form through very fast cooling of lava above the Earth's surface. 4  Extrusive rocks have very small, almost microscopic crystals."}, {"url": "http://www.wikihow.com/Identify-Igneous-Rocks", "passage_text": "1 Igneous rocks that form too quickly for crystals to form have what is called a glassy texture. 2  Obsidian is the only glassy igneous rock, and can be identified by its dark color. 3  This looks like dark black glass. 1 An example of an intrusive rock is granite. 2  When magma is above the earth's crust, it is known as lava. 3  Extrusive rocks form through very fast cooling of lava above the Earth's surface. 4  Extrusive rocks have very small, almost microscopic crystals."}, {"url": "https://en.wikipedia.org/wiki/Igneous_rock", "passage_text": "Igneous rock is formed through the cooling and solidification of magma or lava. Igneous rock may form with or without crystallization, either below the surface as intrusive (plutonic) rocks or on the surface as extrusive (volcanic) rocks. This magma can be derived from partial melts of pre-existing rocks in either a planet's mantle or crust. Intrusive igneous rocks are formed from magma that cools and solidifies within the crust of a planet, surrounded by pre-existing rock (called country rock); the magma cools slowly and, as a result, these rocks are coarse grained. The mineral grains in such rocks can generally be identified with the naked eye."}, {"url": "http://www.wikihow.com/Identify-Igneous-Rocks", "passage_text": "1 Magma is molten rock that flows beneath the earth's surface. 2  Igneous rocks are formed by cooling magma. 3  The location of the formation of the rock, as well as how fast the magma cools will determine the type of igneous rock. 4  Intrusive rocks form from the cooling of magma deep beneath the earths surface. 1 An example of an intrusive rock is granite. 2  When magma is above the earth's crust, it is known as lava. 3  Extrusive rocks form through very fast cooling of lava above the Earth's surface. 4  Extrusive rocks have very small, almost microscopic crystals."}]