[{"url": "http://www.nidcr.nih.gov/OralHealth/OralHealthInformation/ChildrensOralHealth/ToothDecayProcess.htm", "passage_text": "Use fluoride. Fluoride is a mineral that can prevent tooth decay from progressing. It can even reverse, or stop, early tooth decay. Fluoride works to protect teeth. It. . . 1  prevents mineral loss in tooth enamel and replaces lost minerals. 2  reduces the ability of bacteria to make acid. Used with permission. Tooth decay is the result of an infection with certain types of bacteria that use sugars in food to make acids. Over time, these acids can make a cavity in the tooth."}, {"url": "http://www.livescience.com/44223-cavities-tooth-decay.html", "passage_text": "View full size image. Cavities, also referred to as tooth decay or caries, are holes in the teeth. Cavities are the second-most common health disorder in the United States, according to the National Institutes of Health (the first is the common cold) and a very common disorder worldwide. "}, {"url": "http://www.nidcr.nih.gov/OralHealth/OralHealthInformation/ChildrensOralHealth/ToothDecayProcess.htm", "passage_text": "When a tooth is exposed to acid frequently -- for example, if you eat or drink often, especially foods or drinks containing sugar and starches -- the repeated cycles of acid attacks cause the enamel to continue to lose minerals. A white spot may appear where minerals have been lost. This is a sign of early decay. Used with permission. Tooth decay is the result of an infection with certain types of bacteria that use sugars in food to make acids. Over time, these acids can make a cavity in the tooth."}, {"url": "http://www.colgate.com/en/us/oc/oral-health/conditions/cavities/article/what-are-cavities", "passage_text": "Only your dentist can tell for sure whether you have a cavity. That's because cavities develop below the tooth's surface, where you can't see them. When you eat foods that contain carbohydrates (sugars and starches), these carbohydrates are eaten by the bacteria in plaque, producing acids that eat into the tooth."}, {"url": "http://www.medicinenet.com/cavities/page2.htm", "passage_text": "Where there is plaque, there are bacteria and acid, and eventually destruction of the tooth surface. The cavity starts in the outer layer of the tooth (enamel) and as it gets deeper, penetrates into the softer inner layer of the tooth (dentin). Typically, it isn't until the decay reaches the dentin that a person will start to notice signs and symptoms of the cavity. Two main factors contribute to tooth decay -- bacteria in the mouth and a diet high in sugar and starch. There are over 500 different types of bacteria that are normally present in the mouth. These bacteria combine with food and saliva to form a sticky substance called plaque that attaches to teeth."}, {"url": "http://www.webmd.com/oral-health/guide/dental-health-cavities", "passage_text": "Cavities are what you get from tooth decay -- damage to the tooth. Tooth decay can affect both the outer coating of a tooth (called enamel) and the inner layer (called dentin). "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=43098", "passage_text": "Dental cavities (caries) are holes in the two outer layers of a tooth called the enamel and the dentin. The enamel is the outermost white hard surface and the dentin is the yellow layer just beneath enamel. Both layers serve to protect the inner living tooth tissue called the pulp, where blood vessels and nerves reside. "}, {"url": "http://www.animated-teeth.com/tooth_decay/t3_tooth_decay_remineralization.htm", "passage_text": "Cavities take a while to form. A person doesn't just have a cavity develop overnight. It typically takes months, or possibly even years, for decay to advance to a point where it requires attention. (That's why your dentist feels comfortable enough only examining you every 6 months.). When conditions at a tooth's surface are non-acidic, the process of remineralization has a chance to take place. When it does, minerals obtained from the oral environment (saliva, oral rinses, foods, beverages) are re-deposited onto the tooth."}, {"url": "http://www.colgate.com/en/us/oc/oral-health/conditions/cavities/article/all-about-cavities", "passage_text": "Once the decay breaks through the enamel to cause a cavity, the damage is permanent. A dentist must clean out the decay and fill the cavity. Left untreated, the decay will get worse. It can destroy a tooth all the way through the enamel, through the inside dentin layer and down to the pulp or nerve of the tooth. Definition. Cavities refer to tooth decay, which occurs when specific types of bacteria produce acid that destroys the tooth’s enamel and its underlying layer, the dentin. Signs & Symptoms. Cavity symptoms include: 1  Toothache. 2  Sensitivity to sweet, hot or cold foods or drinks."}]