[{"url": "http://www.ourbabynamer.com/meaning-of-Kiana.html", "passage_text": "Kiana is generally used as a girl's name. It consists of 6 letters and 3 syllables and is pronounced Ki-ah-na. In the U.S. in 2014, it ranked 909 in baby name popularity for girls with 296 occurrences. Then just follow the diagram below. Just for fun, see the name Kiana in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Kiana in Nautical Flags page."}, {"url": "http://www.ourbabynamer.com/meaning-of-Kiana.html", "passage_text": "View the Kiana Name Popularity Page to see how the popularity trend for Kiana has changed since 1880, or to compare the popularity of Kiana to other names. Then just follow the diagram below. Just for fun, see the name Kiana in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Kiana in Nautical Flags page."}, {"url": "http://www.answers.com/Q/What_does_kiana_mean", "passage_text": "Kiana is the Hawaiian form of Diana, which is probably derived from an old Indo-European root meaning heavenly, divine, related to dyeus (see ZEUS). Diana was a Roman goddess of the moon, hunting, forests, and childbirth, often identified with the Greek goddess Artemis. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Kiana", "passage_text": "Kiana /ki-ana/ [3 sylls.] as a girls' name is pronounced kee-AHN-ah. It is of American origin. Modern name. May be a favored prefix name or a variant of Kian, an Irish Gaelic name meaning ancient. Also possibly related to Anna. Kiana is especially favored in Hawaii, perhaps as a rhyming variant of the popular Keanu, a boy's name made familiar by actor Keanu Reeves. Keona is also a male name. See also Ciana and Keena. Kreatif forms: Kayna, Kiada, Kiaka. "}, {"url": "http://what-does-my-name-mean.org/name/kiana/", "passage_text": "My name is Kiana and it means grace. friendly and kind just like my best friend i love you kiana. My name is kiana and I'm half Puerto Rican and half Korean so my mom chose Ki in Korean and it means arisen and ana in Spanish which typically means princess. So my name means arisen princess which is kinda weird."}, {"url": "http://what-does-my-name-mean.org/name/kiana/", "passage_text": "Meaning: my name is kiana and the name is hawaiian. It means moon goddess but it also means beautiful and angelic flower. 30: vote up - 2: vote down. A beauty princess from gypsy it come from gypsy. 18: vote up - 2: vote down. This name means calm water in Hawaii. friendly and kind just like my best friend i love you kiana. My name is kiana and I'm half Puerto Rican and half Korean so my mom chose Ki in Korean and it means arisen and ana in Spanish which typically means princess. So my name means arisen princess which is kinda weird."}, {"url": "http://what-does-my-name-mean.org/name/kiana/", "passage_text": "Kiana. my name is kiana and the name is hawaiian. It means moon goddess but it also means beautiful and angelic flower. 30: vote up - 2: vote down. A beauty princess from gypsy it come from gypsy. friendly and kind just like my best friend i love you kiana. My name is kiana and I'm half Puerto Rican and half Korean so my mom chose Ki in Korean and it means arisen and ana in Spanish which typically means princess. So my name means arisen princess which is kinda weird."}, {"url": "http://www.babynamespedia.com/meaning/Kiana", "passage_text": "Kiana-Meaning of Kiana. Tweet. Kiana's language of origin is Indoeuropean and it is used mainly in the English language. In the late 1980s, the name was made known as a Hawaiian form of Diana, popularized by the fitness instructor Kiana Tom (1965-). The name is popular with Afro-Americans. Variant forms inherit the origin and thus the meaning of Kiana."}, {"url": "http://www.sheknows.com/baby-names/name/kiana", "passage_text": "Irish Meaning: The name Kiana is an Irish baby name. In Irish the meaning of the name Kiana is: Ancient. American Meaning: The name Kiana is an American baby name. In American the meaning of the name Kiana is: Ancient. SoulUrge Number: 11. Expression Number: 9. People with this name have a deep inner desire to inspire others in a higher cause, and to share their own strongly held views on spiritual matters."}]