[{"url": "https://en.wikipedia.org/wiki/Sarcasm", "passage_text": "Sarcasm is a sharp, bitter, or cutting expression or remark; a bitter gibe or taunt .. Sarcasm may employ ambivalence, although sarcasm is not necessarily ironic. The distinctive quality of sarcasm is present in the spoken word and manifested chiefly by vocal inflections. Sarcasm involves the expression of an insulting remark that requires the interpreter to understand the negative emotional connotation of the expresser within the context of the situation at hand. Irony, contrarily, does not include derision, unless it is sarcastic irony."}, {"url": "http://grammar.about.com/od/rs/g/sarcasmterm.htm", "passage_text": "1 Second, people may be unintentionally ironic, but sarcasm requires intention. 2  What is essential to sarcasm is that it is overt irony intentionally used by the speaker as a form of verbal aggression 3  .. (John Haiman, Talk Is Cheap: Sarcasm, Alienation, and the Evolution of Language. "}, {"url": "https://en.wikipedia.org/wiki/Sarcasm", "passage_text": "First, situations may be ironic, but only people can be sarcastic. Second, people may be unintentionally ironic, but sarcasm requires intention. What is essential to sarcasm is that it is overt irony intentionally used by the speaker as a form of verbal aggression. Sarcasm involves the expression of an insulting remark that requires the interpreter to understand the negative emotional connotation of the expresser within the context of the situation at hand. Irony, contrarily, does not include derision, unless it is sarcastic irony."}, {"url": "http://ccat.sas.upenn.edu/plc/communication/valerie.htm", "passage_text": "Some people also view sarcasm as a less aggressive form of stating what is truly on one s mind (487). Sarcasm also gives the speaker an opportunity to be dramatic and use wordplay that is more interesting than straightforward remarks. (52). People have different views of sarcasm in relation to humor. There is no written code stating whether sarcasm is a positive or negative thing. However, one can make an assumption as to how sarcasm is generally perceived by studying contexts and the general public s experiences with and beliefs on the matter."}, {"url": "http://literarydevices.net/sarcasm/", "passage_text": "Definition of Sarcasm. Sarcasm is derived from French word sarcasmor and also from a Greek word sarkazein that means “tear flesh” or “grind the teeth”. Somehow, in simple words it means to speak bitterly. Generally, the literal meaning is different than what the speaker intends to say through sarcasm. Sarcasm is a literary and rhetorical device that is meant to mock with often satirical or ironic remarks with a purpose to amuse and hurt someone or some section of society simultaneously."}, {"url": "http://examples.yourdictionary.com/examples-of-sarcasm.html", "passage_text": "comments powered by Disqus. Sarcasm is an ironic or satirical remark that seems to be praising someone or something but is really taunting or cutting. Sarcasm can be used to hurt or offend or can be used for comic affect. Sarcasm sometimes depends on the tone of voice. These examples of sarcasm are replies to people or situations and would only be sarcastic with a sarcastic tone of voice: 1  When something bad happens-That's just what I need, great!"}, {"url": "http://examples.yourdictionary.com/examples-of-sarcasm.html", "passage_text": "Sarcasm is an ironic or satirical remark that seems to be praising someone or something but is really taunting or cutting. Sarcasm sometimes depends on the tone of voice. These examples of sarcasm are replies to people or situations and would only be sarcastic with a sarcastic tone of voice: 1  When something bad happens-That's just what I need, great!"}, {"url": "https://en.wikipedia.org/wiki/Sarcasm", "passage_text": "In sarcasm, ridicule or mockery is used harshly, often crudely and contemptuously, for destructive purposes. It may be used in an indirect manner, and have the form of irony, as in What a fine musician you turned out to be!, It's like you're a whole different person now..., and Oh... Sarcasm involves the expression of an insulting remark that requires the interpreter to understand the negative emotional connotation of the expresser within the context of the situation at hand. Irony, contrarily, does not include derision, unless it is sarcastic irony."}]