[{"url": "https://answers.yahoo.com/question/index?qid=20070430165910AA8K7iX", "passage_text": "Cultivated and harvested, the papyrus plants had a multitude of uses. Their roots were a source of food, medicine, and perfume. Their stems were used to make baskets, floor mats, ropes, clothing, footwear, boats, assorted building materials, and the most important writing material in the ancient world. The use of papyrus in making writing materials dates back to Predynastic times."}, {"url": "https://en.wikipedia.org/wiki/Ebers_Papyrus", "passage_text": "The Ebers Papyrus (c. 1550 BC) from Ancient Egypt. The Ebers Papyrus, also known as Papyrus Ebers, is an Egyptian medical papyrus of herbal knowledge dating to c. 1550 BC. Among the oldest and most important medical papyri of ancient Egypt, it was purchased at Luxor (Thebes) in the winter of 1873–74 by Georg Ebers. "}, {"url": "http://www.egyptian-papyrus.co.uk/", "passage_text": "How papyrus paper is made, where papyrus comes from, what it was used for and the different types of papyrus available. Papyrus-the world's first paper! The ancient Egyptians started making paper from the papyrus plant over five thousand years ago and became one of Egypt's major exports."}, {"url": "http://egypt.mrdonn.org/papyrus.html", "passage_text": "It grew about 10 feet high. It was used to make everything! The ancient Egyptians used papyrus to make paper, baskets, sandals, mats, rope, blankets, tables, chairs, mattresses, medicine, perfume, food, and clothes. Truly, papyrus was an important gift of the Nile. They even tried to make boats out of papyrus, but that did not work very well. Papyrus absorbs water. The ancient Egyptians used papyrus to make books. But they were not books like our. Ancient Egyptian books were made from long strips of papyrus paper. The end of a strip was pasted to another strip, to form a long and thin continuous writing surface."}, {"url": "https://answers.yahoo.com/question/index?qid=20070430165910AA8K7iX", "passage_text": "The use of papyrus as a writing material was not limited solely to Egypt. Papyrus was exported throughout the entire ancient Mediterranean world. The introduction of paper in the ninth century CE signaled the beginning of the end for papyrus as the most important writing material of the ancient world. Their roots were a source of food, medicine, and perfume. Their stems were used to make baskets, floor mats, ropes, clothing, footwear, boats, assorted building materials, and the most important writing material in the ancient world. The use of papyrus in making writing materials dates back to Predynastic times."}, {"url": "https://wizzley.com/papyrus-in-ancient-egyptian-culture/", "passage_text": "Papyrus plant is a sedge which grew mainly along the Nile river and it had great importance in the ancient Egyptian culture. Egyptians used papyrus mainly for making paper and also for making boats, mattresses, mats, rope, sandals, and baskets. The papyrus rhizomes were used in food and the stems were used for fuel. Papyrus as a writing material. Papyrus was widely used as a writing material, especially in Egypt.The stems of the plant have white pith inside which was used to make paper. Papyrus had been processed to make sheets and the sheets were stuck together to make a roll. Rolls measuring even 45 yards have been found"}, {"url": "https://en.wikipedia.org/wiki/Papyrus", "passage_text": "The Ancient Egyptians used papyrus as a writing material, as well as employing it commonly in the construction of other artifacts such as reed boats, mats, rope, sandals, and baskets. A section of the Egyptian Book of the Dead written on papyrus. Papyrus was first manufactured in Egypt and Southern Sudan as far back as the fourth millennium BCE. The earliest archaeological evidence of papyrus was excavated in 2012 and 2013 at Wadi al-Jarf, an ancient Egyptian harbor located on the Red Sea coast."}, {"url": "https://en.wikipedia.org/wiki/Papyrus", "passage_text": "An official letter on a papyrus of the third century B.C. Papyrus is first known to have been used in ancient Egypt (at least as far back as the First Dynasty), as the Cyperus papyrus plant was a wetland sedge that was once abundant in the Sudd of Southern Sudan along with the Nile Delta of Egypt. A section of the Egyptian Book of the Dead written on papyrus. Papyrus was first manufactured in Egypt and Southern Sudan as far back as the fourth millennium BCE. The earliest archaeological evidence of papyrus was excavated in 2012 and 2013 at Wadi al-Jarf, an ancient Egyptian harbor located on the Red Sea coast."}]