[{"url": "http://www.nclexonline.com/faq/", "passage_text": "Once the board of nursing declares you eligible to test and your ATT is issued, you must test within the validity dates of your ATT nursing (varies from 60 days to 365 days; however, the average is 90 days). These validity dates cannot be extended for any reason. The ATT contains your authorization number, candidate identification number and an expiration date. You need the ATT to: 1  Schedule an appointment to take the NCLEX examination. 2  Be admitted to the test center on the day of the examination appointment."}, {"url": "http://www.nclexonline.com/faq/i-have-registered-for-the-nclex-when-will-i-get-my-authorization-to-test-att-letter/", "passage_text": "After you register with Pearson VUE and your board of nursing declares you eligible, you will receive your Authorization to Test (ATT). All application materials and fees must be submitted to the board of nursing before they can deem you eligible to test. You need the ATT to: 1  Schedule an appointment to take the NCLEX examination. 2  Be admitted to the test center on the day of the examination appointment. 3  Candidates will not be admitted to the examination without their ATT’s and will be required to reregister and repay to take the"}, {"url": "http://www.kevinsreview.com/applynclex/missouri.php", "passage_text": "The NCSBN is the one who creates the NCLEX content, not Pearson Vue. Pearson Vue is also responsible for sending the Authorization to Test letter. They will only send it after receiving an approval from your State Board of Nursing (which you applied to in Step 1). The registration fee will be $200. "}, {"url": "http://allnurses.com/new-jersey-nursing/att-from-pearson-579725.html", "passage_text": "I submitted my application at the end of April and I'm still waiting for the BON to finish processing it. Once the BON finished with the application, they send your ATT to Pearsonvue and Pearsonvue emails it to you within 24 hours. I've heard from the other NJ new grad nurses that two months is about the average length of time that it will take. "}, {"url": "http://www.bon.texas.gov/licensure_examination.asp", "passage_text": "1 If you have registered with Pearson/Vue, the BON will deem you eligible to take the NCLEX®. 2  Pearson/Vue will send you an email verification giving you the authorization to test (ATT) and instructions on scheduling the test. 3  Your ATT is valid for 75 days from the ATT start date to take the exam. "}, {"url": "http://www.easynclex.com/nclex_in_New_York.html", "passage_text": "2) Register to take the NCLEX test with Pearson Vue. Registration can be done by telephone, on the web, or by snail mail. 3) Pearson Vue will send you a confirmation of registration. 4) The New York Nursing Board that you applied to will send you confirmation of your eligibility to take the test (this must be done within 365 days from your original registration). 5) Pearson Vue will send you an Authorization To Test (ATT). The exam must be taken in appx. ninety days, depending on the state. "}, {"url": "http://www.nclexonline.com/faq/i-have-registered-for-the-nclex-when-will-i-get-my-authorization-to-test-att-letter/", "passage_text": "Once the board of nursing declares you eligible to test and your ATT is issued, you must test within the validity dates of your ATT nursing (varies from 60 days to 365 days; however, the average is 90 days). These validity dates cannot be extended for any reason. You need the ATT to: 1  Schedule an appointment to take the NCLEX examination. 2  Be admitted to the test center on the day of the examination appointment. 3  Candidates will not be admitted to the examination without their ATT’s and will be required to reregister and repay to take the"}, {"url": "https://www.ncsbn.org/1212.htm", "passage_text": "ATT Validity Dates. 1  Each ATT is valid for a period of time specified by the BON/RB (the average length of an ATT is 90 days). 2  Once the BON/RB has declared you eligible to test and you receive your ATT, you must test within the validity dates on the ATT. 1 Call NCLEX Candidate Services if you've lost your ATT or if you have not received your ATT two weeks after registering. 2  The ATT contains the authorization number, candidate identification number and an expiration date. 3  These validity dates cannot be extended for any reason."}, {"url": "http://www.rn.ca.gov/applicants/lic-faqs.shtml", "passage_text": "You must have your ATT to schedule an appointment to take the NCLEX-RN examination. Additionally, at the testing center, you must present acceptable identification to be admitted to the test. The name on your photo identification must match EXACTLY with your name that is on file with both the Board and with Pearson Vue. "}, {"url": "http://easynclex.com/nclex_in_Pennsylvania.html", "passage_text": "4) The Pennsylvania Nursing Board that you applied to will send you confirmation of your eligibility to take the test (this must be done within 365 days from your original registration). 5) Pearson Vue will send you an Authorization To Test (ATT). The exam must be taken in appx. ninety days, depending on the state. "}]