[{"url": "https://en.wikipedia.org/wiki/Spider_web", "passage_text": "A spider web, spiderweb, spider's web, or cobweb (from the archaic word coppe, meaning spider) is a device created by a spider out of proteinaceous spider silk extruded from its spinnerets."}, {"url": "http://www.webopedia.com/TERM/S/spider.html", "passage_text": "A program that automatically fetches Web pages. Spiders are used to feed pages to search engines. It's called a spider because it crawls over the Web. Another term for these programs is webcrawler. Because most Web pages contain links to other pages, a spider can start almost anywhere."}, {"url": "http://megaman.wikia.com/wiki/Web_Spider", "passage_text": "Web Spider, known as Web Spidus (ウェブ・スパイダス, Web Spidus) in Japan, is a Spider-based Maverick who works for Repliforce as the commander of their guerrilla unit. Before his military career with Repliforce, he was once a Maverick Hunter, belonging to the 0th Special Unit."}, {"url": "http://whatis.techtarget.com/definition/spider", "passage_text": "Part of the Internet technologies glossary: A spider is a program that visits Web sites and reads their pages and other information in order to create entries for a search engine index. The major search engines on the Web all have such a program, which is also known as a crawler or a bot.."}, {"url": "https://en.wikipedia.org/wiki/Web_crawler", "passage_text": "A Web crawler may also be called a Web spider, an ant, an automatic indexer, or (in the FOAF software context) a Web scutter. Web search engines and some other sites use Web crawling or spidering software to update their web content or indexes of others sites' web content."}, {"url": "http://whatis.techtarget.com/definition/spider", "passage_text": "The spider for the AltaVista search engine and its Web site is called Scooter. Scooter adheres to the rules of politeness for Web spiders that are specified in the Standard for Robot Exclusion (SRE). It asks each server which files should be excluded from being indexed. It does not (or can not) go through firewall."}, {"url": "http://www.youtube.com/watch?v=Ar3veHKBYvU", "passage_text": "A spider web, spiderweb, spider's web, or cobweb is a device created by a spider out of spider silk extruded from its spinnerets. Spider webs have existed for at least 100 million years, as witnessed in a rare find of Early Cretaceous amber from Sussex, southern England."}]