[{"url": "http://www.aproundtable.org/tps30info/globalwarmup.html", "passage_text": "Global Warming: T he hypothesis that Earth's atmosphere is warming because of the release of greenhouse gases, such as carbon dioxide. These gases are released into the air from burning gas, oil, coal, wood and other resources which then holds heat in an action similar to the walls of a greenhouse."}, {"url": "http://www.lenntech.com/greenhouse-effect/global-warming-history.htm", "passage_text": "Svante Arrhenius (1859-1927) was a Swedish scientist that was the first to claim in 1896 that fossil fuel combustion may eventually result in enhanced global warming. He proposed a relation between atmospheric carbon dioxide concentrations and temperature."}, {"url": "https://answers.yahoo.com/question/index?qid=20080829091236AAscYHt", "passage_text": "· just now. Report Abuse. Global warming is real, then global cooling will be, then warming, then cooling etc etc, it's just the natural way of things orchestrated by the good old Sun!. As for Co2 levels, they go up AFTER the planet has warmed and down again AFTER the planet cools."}, {"url": "http://www.lenntech.com/greenhouse-effect/global-warming-history.htm", "passage_text": "From 1998 onwards the terminology on the greenhouse effect started to change as a result of media influences. The greenhouse effect as a term was used fewer and fewer and people started to refer to the theory as either global warming or climate change. Source: Maslin, M., Global Warming, a very short introduction."}, {"url": "http://www.nasa.gov/topics/earth/features/climate_by_any_other_name.html", "passage_text": "Definitions Global warming: the increase in Earth’s average surface temperature due to rising levels of greenhouse gases. Climate change: a long-term change in the Earth’s climate, or of a region on Earth."}, {"url": "http://www.aip.org/history/climate/timeline.htm", "passage_text": "Here are gathered in chronological sequence the most important events in the history of climate change science. (For a narrative see the Introduction: summary history.) This list of milestones includes major influences external to the science itself. Following it is a list of other external influences."}]