[{"url": "http://www.concretenetwork.com/concrete/countertops/pricing_of_countertops.htm", "passage_text": "Return to Concrete Countertops. The price of the concrete countertop is composed of the countertop design/construction, shipping (if required), and installation. Standard Cost | $65-$135 per square foot. Cost for a standard 1.5 thick concrete countertop"}, {"url": "http://concrete-countertops.org/cost.html", "passage_text": "The cost of a concrete countertop is really generated by the time and level of artisan creativity that is required. Concrete countertops are typically specified by architects, designers and homeowners that want a completely one-of-a-kind product."}, {"url": "http://www.concretenetwork.com/concrete/countertops/pricing_of_countertops.htm", "passage_text": "Cost of Manufacturing Concrete Countertops: The price of the concrete countertop is composed of the countertop design/construction, shipping (if required), and installation. Standard Cost | $65-$135 per square foot Cost for a standard 1.5 thick concrete countertop per square foot. View comparison chart of concrete countertop pricing vs. other countertop materials (such as granite, tile, etc.) Installation Cost | $40-$50/hr Installation is often a separate cost. Typical cost of installation done by the concrete contractor is charged by the hour, per person."}, {"url": "http://home.costhelper.com/concrete-countertops.html", "passage_text": "1 DIY home installed concrete countertops cost $8-$15 per square foot for materials, running $240-$450 for a typical 30 square foot kitchen counter. 2  Professionally built and installed concrete countertops cost $70-$100 per square foot, or $2,100-$3,00"}, {"url": "http://home.costhelper.com/concrete-countertops.html", "passage_text": "1 Professionally built and installed concrete countertops cost $70-$100 per square foot, or $2,100-$3,000 for a typical 30 square foot kitchen counter. 2  Stain-resistant concrete countertops cost $85-$175 per square foot, or $2,550-$5,25"}]