[{"url": "http://www.ehow.com/how_5679064_someone-using-social-security-number.html", "passage_text": "Confirm the number you want to search is valid. Do this free at the Social Security Administration website, ssa.gov/employer/ssnv.htm. You will need to register by providing your name, date of birth, postal address, phone number, email address and Social Security number. "}, {"url": "http://www.hashemian.com/articles/2009/01/15/social-security-number-search-how-find-person-ssn.htm", "passage_text": "Beyond that, though, a social security number search can also tell you a person's traffic violation history, criminal history, credit history and several other important facts. As an employer, you can never be too careful. You always want to be sure that the person you are going to hire is fit for the job. The biggest reason that you may want to do a search, based on a person's SSN, is if you are an employer who is looking to hire a new employee. A social security number search can verify that the person is who they say they are, for tax id purposes."}, {"url": "http://romanyk.net/", "passage_text": "Find a person using a social security number SSN If you happen to know the person's social security number, the search is easy. You will be able to get a history showing the current as previous addresses, date of birth, phone numbers, date of issuance, SSN validity, death record status and more."}, {"url": "http://www.findfree-people-friends.com/Find-People-Free/By-SSNumber/", "passage_text": "Bear in mind that on your quest on finding finding people free by SSN you don’t step over the line; like crossing legal boundaries. With that out of the way here are some steps and tips you can use to locate someone using their social security number. Find People Free Using Social Security Number. You should realize that as much as there are a lot of sites from which you can search for someone by social security number, not all of them offer this service at no cost."}, {"url": "http://www.omnitrace.com/social-security-number-search-for-someone-for-free/", "passage_text": "If you know the first three digits of someone’s social security number and know roughly how old they are you can narrow down your search to a particular state and have a good guess of where they were born or where they likely got their first job. Having a partial SSN can also help you narrow down a search when you are trying to search for someone who may be deceased. You can search the Social Security Administration Death Index for free and if you find multiple matches you can narrow your list down by eliminating incorrect SSNs. [Please note: Having a complete Social Security Number can allow a company such as OmniTrace to search and find someone fast and very affordably"}, {"url": "https://www.usatrace.com/ssntrace/", "passage_text": "Matt M. Research Department USATrace http://www.usatrace.com Download a sample of a SSN Trace Search Report. 99 percent of the people can be quickly located with a Social Security Number Search. Nationwide search will provide the persons name, and reported addresses associated with their Social Security Number. "}, {"url": "http://searchenginez.com/socsec_usa.html", "passage_text": "Social Security Numbers. An SSN is useful if you are going to use a paid professional, but isn't much help if you are trying to track down someone for free, because public databases do not list SSNs. How to find Social Security Numbers and Dates of Birth: If the person is deceased, you might be able to locate their Social Security number and/or exact date of birth in the following places: 1  Personal papers. 2  Death certificate"}, {"url": "http://www.spiesonline.net/ssn.shtml", "passage_text": "Social Security State Codes. With the first three digits of a social security number, you can find out what state the owner of the number lived in when he applied for it. Social Security Death Index. Search this index to find out if someone is deceased. If so, you can get their social security number. Find Someone's SSN From Public Records You can find someone's social security number isn't if you know how to search public records. You can get social security numbers from various court records, particularly divorce or bankruptcy records."}, {"url": "http://www.hashemian.com/articles/2009/01/15/social-security-number-search-how-find-person-ssn.htm", "passage_text": "Every social security number is different, so, if you know a name and SSN, you can quickly access many public records about a person. The biggest reason that you may want to do a search, based on a person's SSN, is if you are an employer who is looking to hire a new employee. A social security number search can verify that the person is who they say they are, for tax id purposes. After all, identity theft is a common problem in recent years"}]