[{"url": "http://history1900s.about.com/od/coldwa1/a/berlinwall.htm", "passage_text": "The Berlin Wall was both the physical division between West Berlin and East Germany from 1961 to 1989 and the symbolic boundary between democracy and Communism during the Cold War. Dates: August 13, 1961 -- November 9, 1989. Also Known As: Berliner Mauer (in German). "}, {"url": "https://answers.yahoo.com/question/index?qid=20110202222237AAPS5Ob", "passage_text": "Report Abuse. The Berlin Wall and the Iron Curtain seemed to be a permanent fixture after 1961. However, on November 9th 1989, the impossible happened: the Berlin Wall opened. This triggered a chain reaction of events, throughout Europe and marked the beginning of the fall of the Soviet empire. Best Answer: Because communism failed as a government. The berlin wall fell around in the 1980s but people say that communism started to crumble in the late 1970s, and russia just couldn't keep up its power in other countries like it use to."}, {"url": "http://www.history.com/topics/cold-war/berlin-wall", "passage_text": "Introduction. On August 13, 1961, the Communist government of the German Democratic Republic (GDR, or East Germany) began to build a barbed wire and concrete “Antifascistischer Schutzwall,” or “antifascist bulwark,” between East and West Berlin. The Berlin Wall: The Fall of the Wall. On November 9, 1989, as the Cold War began to thaw across Eastern Europe, the spokesman for East Berlin’s Communist Party announced a change in his city’s relations with the West. Starting at midnight that day, he said, citizens of the GDR were free to cross the country’s borders."}, {"url": "http://www.theimaginativeconservative.org/2014/11/berlin-wall-fall.html", "passage_text": "The Berlin Wall and the Iron Curtain seemed to be permanent fixtures of the political landscape of Europe after 1961. But to everyone’s surprise, the Berlin Wall opened on November 9, 1989. This stunning event triggered a chain reaction throughout Eastern Europe, accelerating a process that had begun a decade earlier. With the opening of the Berlin Wall in November, people from all the East bloc countries flooded into West Germany, far exceeding the capacity of the government or the Red Cross to care for all of them. It became clear in prayer that I was to go and serve these refugees who had escaped from communism."}, {"url": "https://simple.wikipedia.org/wiki/Berlin_Wall", "passage_text": "The Berlin Wall (German: Berliner Mauer) separated the city of Berlin in Germany from 1961 to 1989. It separated the eastern half from the western half. Many people thought it was a symbol of the Cold War. The Berlin Wall was taken down on November 9, 1989. The Berlin Wall was about 168 km (104 miles) long. To stop this, on August 13, 1961, the Communist government of East Germany built a wall separating East and West Berlin. The wall was built to keep the country's people in. But the Soviets and East German government said it was to keep capitalism out."}, {"url": "http://www.bbc.co.uk/history/places/berlin_wall", "passage_text": "Constructed by the German Democratic Republic (GDR, East Germany), starting on 13 August 1961, the wall completely cut off (by land) West Berlin from surrounding East Germany and from East Berlin until it was opened in November 1989. The Berlin Wall. During the early years of the Cold War, West Berlin was a geographical loophole through which thousands of East Germans fled to the democratic West. In response, the Communist East German authorities built a wall that totally encircled West Berlin."}, {"url": "http://www.ducksters.com/history/cold_war/berlin_wall.php", "passage_text": "The Berlin Wall was built by the communist government of East Berlin 1961. The wall separated East Berlin and West Berlin. It was built in order to prevent people from fleeing East Berlin. "}, {"url": "https://en.wikipedia.org/wiki/Berlin_Wall", "passage_text": "Constructed by the German Democratic Republic (GDR, East Germany), starting on 13 August 1961, the wall completely cut off (by land) West Berlin from surrounding East Germany and from East Berlin until it was opened in November 1989. After several weeks of civil unrest, the East German government announced on 9 November 1989 that all GDR citizens could visit West Germany and West Berlin. Crowds of East Germans crossed and climbed onto the wall, joined by West Germans on the other side in a celebratory atmosphere."}]