[{"url": "https://en.wikipedia.org/wiki/Acyl_chloride", "passage_text": "In organic chemistry, an acyl chloride (or acid chloride) is an organic compound with the functional group-COCl. Their formula is usually written RCOCl, where R is a side chain. They are reactive derivatives of carboxylic acids. A specific example of an acyl chloride is acetyl chloride, CH 3 COCl. Where the acyl chloride moiety takes priority, acyl chlorides are named by taking the name of the parent carboxylic acid, and substituting-yl chloride for-ic acid."}, {"url": "http://www.chemguide.co.uk/mechanisms/addelim/whatis.html", "passage_text": "Acyl chlorides (also known as acid chlorides) are one of a number of types of compounds known as acid derivatives. This is ethanoic acid: If you remove the-OH group and replace it by a-Cl, you have produced an acyl chloride. This molecule is known as ethanoyl chloride and for the rest of this topic will be taken as typical of acyl chlorides in general. Acyl chlorides are extremely reactive."}, {"url": "http://www.chem.ucalgary.ca/courses/350/Carey5th/Ch20/ch20-1-3.html", "passage_text": "Carboxylic acid derivatives react tend to react via nucleophilic acyl substitution where the group on the acyl unit, R-C=O undergoes substitution: Study Tip: Note that unlike aldehydes and ketones, this reactivity of carboxylic acids retains the carbonyl group, C=O. . The observed reactivity order is shown below: This reactivity order is important. You should be able to understand, rationalise and use it. It is useful to view the carboxylic acid derivatives as an acyl group, R-C=O, with a different substituent attached."}, {"url": "http://health.uml.edu/horta/OrgChemChapter16.pdf", "passage_text": "Strategy • A nucleophilic acyl substitution reaction involves the substitution of a nucleophile for a leaving group in a carboxylic acid derivative. Identify the leaving group (Cl-in the case of an acid chloride) and the nucleophile (an alcohol in this case), and replace one by the other. "}, {"url": "http://chemguide.co.uk/mechanisms/elsub/fcacyl.html", "passage_text": "This page gives you the facts and a simple, uncluttered mechanism for the electrophilic substitution reaction between benzene and ethanoyl chloride in the presence of an aluminium chloride catalyst. If you want the Friedel-Crafts acylation mechanism explained to you in detail, there is a link at the bottom of the page. The facts The most reactive substance containing an acyl group is an acyl chloride (also known as an acid chloride). These have the general formula RCOCl. Benzene is treated with a mixture of ethanoyl chloride, CH3COCl, and aluminium chloride as the catalyst. A ketone called phenylethanone is formed."}, {"url": "https://en.wikipedia.org/wiki/Nucleophilic_acyl_substitution", "passage_text": "Nucleophilic acyl substitution describe a class of substitution reactions involving nucleophiles and acyl compounds. In this type of reaction, a nucleophile – such as an alcohol, amine, or enolate – displaces the leaving group of an acyl derivative – such as an acid halide, anhydride, or ester. Under basic conditions, a nucleophile (Nuc) attacks the carbonyl group of the acyl compound 1 to give tetrahedral alkoxide intermediate 2. The intermediate collapses and expels the leaving group (X) to give the substitution product 3."}, {"url": "http://chemguide.co.uk/mechanisms/elsub/fcacyl.html", "passage_text": "The most reactive substance containing an acyl group is an acyl chloride (also known as an acid chloride). These have the general formula RCOCl. Benzene is treated with a mixture of ethanoyl chloride, CH 3 COCl, and aluminium chloride as the catalyst. A ketone called phenylethanone is formed. The facts The most reactive substance containing an acyl group is an acyl chloride (also known as an acid chloride). These have the general formula RCOCl. Benzene is treated with a mixture of ethanoyl chloride, CH3COCl, and aluminium chloride as the catalyst. A ketone called phenylethanone is formed."}, {"url": "http://chemguide.co.uk/mechanisms/elsub/fcacyl.html", "passage_text": "The electrophilic substitution reaction between benzene and ethanoyl chloride What is acylation? An acyl group is an alkyl group attached to a carbon-oxygen double bond. If R represents any alkyl group, then an acyl group has the formula RCO-. The facts The most reactive substance containing an acyl group is an acyl chloride (also known as an acid chloride). These have the general formula RCOCl. Benzene is treated with a mixture of ethanoyl chloride, CH3COCl, and aluminium chloride as the catalyst. A ketone called phenylethanone is formed."}]