[{"url": "http://www.hpblondon.com/liver/", "passage_text": "Below the liver, where the hepatic artery and the portal vein come in, the bile duct comes out of the liver. Bile made in the liver flows out through this bile duct (which is a thin tube the size of a drinking straw), and goes down to the gut, where it mixes with food. The gall bladder is a small greenish pear-shaped bag that hangs off the bile duct. It stores bile and squeezes it out into the gut at mealtime"}, {"url": "http://www.innerbody.com/image_digeov/card10-new2.html", "passage_text": "Weighing in at around 3 pounds, the liver is the body’s second largest organ; only the skin is larger and heavier. The liver performs many essential functions related to digestion, metabolism, immunity, and the storage of nutrients within the body. "}, {"url": "http://www.medicinenet.com/liver_anatomy_and_function/article.htm", "passage_text": "The liver is the largest internal organ of the body and is located in the right upper quadrant of the abdomen, beneath the diaphragm and is protected by the lower right ribs. It also extends across the midline toward the left upper quadrant of the abdomen. The liver is one of the vital organs of the body, responsible for hundreds of chemical actions that the body needs to survive. It is also a gland because it secretes chemicals that are used by other parts of the body. For these reasons the liver is both an organ and a gland."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0072577/", "passage_text": "The liver is one of the largest organs in the body. It has many important metabolic functions. It converts the nutrients in our diets into substances that the body can use, stores these substances, and supplies cells with them when needed. In fat metabolism the liver cells break down fats and produce energy. They also produce about 800 to 1,000 ml of bile per day. This yellow, brownish or olive green liquid is collected in small ducts and then passed on to the main bile duct, which carries the bile to a part of the small intestine called the duodenum."}, {"url": "https://en.wikipedia.org/wiki/Liver", "passage_text": "The liver is a reddish brown wedge-shaped organ with four lobes of unequal size and shape. A human liver normally weighs 1.44–1.66 kg (3.2–3.7 lb). It is both the largest internal organ and the largest gland in the human body. Located in the right upper quadrant of the abdominal cavity, it rests just below the diaphragm, to the right of the stomach and overlying the gallbladder."}, {"url": "http://www.webmd.com/hepatitis/tc/what-the-liver-does-topic-overview", "passage_text": "1 (Bilirubin is a by-product of the breakdown of hemoglobin from red blood cells 2  .). It processes most of the nutrients absorbed by the intestines during digestion and converts those nutrients into forms that can be used by the body. 3  The liver also stores some nutrients, such as vitamin A, iron, and other minerals. A healthy liver does the following: 1  It regulates the composition of blood, including the amounts of sugar (glucose), protein, and fat that enter the bloodstream. 2  It removes bilirubin, ammonia, and other toxins from the blood. ( 3 Bilirubin is a by-product of the breakdown of hemoglobin from red blood cells .)"}, {"url": "http://www.hpblondon.com/liver/", "passage_text": "is situated. The liver is a large reddish brown solid organ that sits in the upper part of the abdomen, tucked away under the right side of the rib cage. Above it is the heart and the right lung, and it is separated from them by a thin sheet of muscle called the diaphragm. Bile made in the liver flows out through this bile duct (which is a thin tube the size of a drinking straw), and goes down to the gut, where it mixes with food. The gall bladder is a small greenish pear-shaped bag that hangs off the bile duct."}, {"url": "http://www.webmd.com/digestive-disorders/picture-of-the-liver", "passage_text": "Front View of the Liver. The liver is a large, meaty organ that sits on the right side of the belly. Weighing about 3 pounds, the liver is reddish-brown in color and feels rubbery to the touch. Normally you can't feel the liver, because it's protected by the rib cage. The liver has two large sections, called the right and the left lobes."}, {"url": "http://www.webmd.com/hepatitis/tc/what-the-liver-does-topic-overview", "passage_text": "1 It removes bilirubin, ammonia, and other toxins from the blood. ( 2 Bilirubin is a by-product of the breakdown of hemoglobin from red blood cells 3  .). It processes most of the nutrients absorbed by the intestines during digestion and converts those nutrients into forms that can be used by the body. A healthy liver does the following: 1  It regulates the composition of blood, including the amounts of sugar (glucose), protein, and fat that enter the bloodstream. 2  It removes bilirubin, ammonia, and other toxins from the blood. ( 3 Bilirubin is a by-product of the breakdown of hemoglobin from red blood cells .)"}]