[{"url": "https://www.mathsisfun.com/geometry/polyhedron.html", "passage_text": "Polyhedrons. A polyhedron is a solid with flat faces. (from Greek poly-meaning many and-edron meaning face). Each face is a polygon (a flat shape with straight sides). "}, {"url": "http://korthalsaltes.com/", "passage_text": "Paper Models of Polyhedra. Polyhedra are beautiful 3-D geometrical figures that have fascinated philosophers, mathematicians and artists for millennia. On this site are a few hundred paper models available for free. Make the models yourself. Click on a picture to go to a page with a net of the model. "}, {"url": "http://www.youtube.com/watch?v=yq7VTjoMYVk", "passage_text": "Published on Sep 12, 2013. This nugget explains what a Polyhedron is. It also explains convex, concave and regular Polyhedrons along with the Euler's formula. 1  People & Blogs. 2  Standard YouTube License."}, {"url": "https://www.mathsisfun.com/definitions/polyhedron.html", "passage_text": "Polyhedron. more ... A solid with flat faces (from Greek poly-meaning many and-edron meaning face). Example: pyramids and prisms Each flat surface (or face) is a polygon. "}, {"url": "http://www.ams.org/samplings/feature-column/fcarc-eulers-formula", "passage_text": "This theorem involves Euler's polyhedral formula (sometimes called Euler's formula). Today we would state this result as: The number of vertices V, faces F, and edges E in a convex 3-dimensional polyhedron, satisfy V + F-E = 2. "}, {"url": "http://mathforum.org/sum95/math_and/poly/polyhedra.html", "passage_text": "Regular Polyhedra. The cube and the tetrahedron are examples of Regular Polyhedra, also called Platonic Solids. A polyhedron is called regular if the faces are congruent (same size and shape) regular polygons and the same number of faces meet at each vertex. 1"}, {"url": "http://www.icoachmath.com/math_dictionary/polyhedron.html", "passage_text": "Definition of Polygon. A polyhedron is a space figure each of whose faces is a polygon. In other words, a polyhedron is a solid shape whose faces are all polygons. "}, {"url": "http://www.merriam-webster.com/dictionary/polyhedron", "passage_text": "Definition of POLYHEDRON. : a solid formed by plane faces. — poly·he·dral \\-drəl\\ adjective. See polyhedron defined for kids. ADVERTISEMENT. "}, {"url": "http://math.wikia.com/wiki/Polyhedron", "passage_text": "Traditional polyhedra. A dodecahedron. In geometry, a polyhedron is traditionally a three-dimensional shape that is made up of a finite number of polygonal faces which are parts of planes; the faces meet in pairs along edges which are straight-line segments, and the edges meet in points called vertices. "}, {"url": "http://www.thefreedictionary.com/polyhedron", "passage_text": "polyhedron. n, pl-drons or-dra (-drə). 1. (Mathematics) a solid figure consisting of four or more plane faces (all polygons), pairs of which meet along an edge, three or more edges meeting at a vertex. In a regular polyhedron all the faces are identical regular polygons making equal angles with each other. polyhedron-a solid figure bounded by plane polygons or faces. solid-a three-dimensional shape. convex polyhedron-a polyhedron any plane section of which is a convex polygon. concave polyhedron-a polyhedron some of whose plane sections are concave polygons."}]