[{"url": "http://www.goodfinancialcents.com/average-funeral-costs-expenses/", "passage_text": "Breaking Down the Costs. From death to burial, and all the steps in between, today’s average funeral can cost upwards of $10,000. There are a few areas where the expense can be cut, such as in choosing the style and extravagance of the casket. The cost of the average funeral has dramatically increased in the last 25 years. However it’s an expense that we can’t avoid. Being prepared and understanding the costs involved can help the process of planning for a funeral a little bit easier."}, {"url": "http://www.deathpenalty.org/article.php?id=42", "passage_text": "It costs approximately $90,000 more a year to house an inmate on death row, than in the general prison population or $57.5 million annually. The Attorney General devotes about 15% of his budget, or $11 million annually to death penalty cases. Executing all of the people currently on death row, or waiting for them to die there of other causes, will cost California an estimated $4 billion more than if they had been sentenced to die in prison of disease, injury, or old age; California death penalty trials have cost as much as $10.9 million."}, {"url": "http://www.dailymail.co.uk/news/article-2543006/The-rising-cost-dying-Average-funeral-costs-7-600-thousands-struggling-afford-fitting-send-off.html", "passage_text": "The average cost of a funeral in fact rose by 80 per cent between 2004 and 2013 and the costs of dying are expected to continue to increase over the next five years. The rising cost of dying: Average funeral now costs £7,600 and thousands are struggling to afford a fitting send off. 1  Study claims cost of funeral, burial and administration is up 7.1%. 2  Estimated that 100,000 people will struggle to pay for funeral this year. 3  Rose 80% between 2004 and 2013 and will continue to increase."}, {"url": "https://www.debt.org/medical/hospice-costs/", "passage_text": "In comparison, total hospice spending for Medicare in 2010 was $13 billion, with an average cost of approximately $10,700 per patient. Medicare does not limit payments for hospice care for individuals, but enforces an aggregate cap for agencies of about $24,500 per beneficiary. Medicare is required to pay for all medically necessary hospital and doctor care under Parts A and B, regardless of cost or the condition of the patient. Of the 2.5 million Americans who died in 2011, 80 percent were Medicare beneficiaries at the time of death."}, {"url": "http://www.deathpenaltyinfo.org/costs-death-penalty", "passage_text": "On direct appeal, the cost of appellate defense averages $100,000 more in death penalty cases, than in non-death penalty murder cases. Personal restraint petitions filed in death penalty cases on average cost an additional $137,000 in public defense costs. Texas death penalty cases cost more than non-capital cases. Each death penalty case in Texas costs taxpayers about $2.3 million. That is about three times the cost of imprisoning someone in a single cell at the highest security level for 40 years. (Executions Cost Texas Millions, Dallas Morning News, March 8, 1992)."}, {"url": "http://www.dailymail.co.uk/news/article-2543006/The-rising-cost-dying-Average-funeral-costs-7-600-thousands-struggling-afford-fitting-send-off.html", "passage_text": "On average, the price of a typical funeral, including non-discretionary fees and a burial or cremation, is £3,456. The average amount spent on extras such as a memorial, flowers and catering is £2,006 and discretionary estate administration costs have increased significantly to £2,160. The rising cost of dying: Average funeral now costs £7,600 and thousands are struggling to afford a fitting send off. 1  Study claims cost of funeral, burial and administration is up 7.1%. 2  Estimated that 100,000 people will struggle to pay for funeral this year. 3  Rose 80% between 2004 and 2013 and will continue to increase."}, {"url": "http://www.deathpenaltyinfo.org/costs-death-penalty", "passage_text": "A Seattle University study examining the costs of the death penalty in Washington found that each death penalty case cost an average of $1 million more than a similar case where the death penalty was not sought ($3.07 million, versus $2.01 million). Texas death penalty cases cost more than non-capital cases. Each death penalty case in Texas costs taxpayers about $2.3 million. That is about three times the cost of imprisoning someone in a single cell at the highest security level for 40 years. (Executions Cost Texas Millions, Dallas Morning News, March 8, 1992)."}, {"url": "http://www.deathpenaltyinfo.org/costs-death-penalty", "passage_text": "That translates to $37.2 million for each of the state’s five executions since the state reenacted the death penalty. The study estimates that the average cost to Maryland taxpayers for reaching a single death sentence is $3 million - $1.9 million more than the cost of a non-death penalty case. Texas death penalty cases cost more than non-capital cases. Each death penalty case in Texas costs taxpayers about $2.3 million. That is about three times the cost of imprisoning someone in a single cell at the highest security level for 40 years. (Executions Cost Texas Millions, Dallas Morning News, March 8, 1992)."}, {"url": "http://www.dailymail.co.uk/news/article-2543006/The-rising-cost-dying-Average-funeral-costs-7-600-thousands-struggling-afford-fitting-send-off.html", "passage_text": "The average cost of dying-including funeral, burial or cremation and state administration-stands at £7,622, having risen by 7.1 per cent in the past year, a study claims. The rising cost of dying: Average funeral now costs £7,600 and thousands are struggling to afford a fitting send off. 1  Study claims cost of funeral, burial and administration is up 7.1%. 2  Estimated that 100,000 people will struggle to pay for funeral this year. 3  Rose 80% between 2004 and 2013 and will continue to increase."}]