[{"url": "https://en.wikipedia.org/wiki/David_Neeleman", "passage_text": "He co-founded (with June Morris) Morris Air, a low-fare charter airline, and from 1984 to 1988, he was executive vice president of the company. In 1988 Neeleman assumed the helm of Morris Air as its president. Neeleman donated his entire salary to the JetBlue Crewmember Crisis Fund, which was established for JetBlue employees who had fallen on hard times. On May 10, 2007, David Neeleman was replaced by David Barger (born 1959) as CEO of JetBlue and on May 21, 2008 he was replaced as chairman of the board by Joel Peterson."}, {"url": "http://money.cnn.com/2007/05/10/news/companies/jetblue/", "passage_text": "By Chris Isidore, CNNMoney.com senior writer. May 10 2007: 1:28 PM EDT. NEW YORK (CNNMoney.com) -- JetBlue Airways ousted its founder from his CEO job Thursday, three months after the service problems that stranded passengers on grounded jets for hours dented the airline's reputation for customer service. Knowing that Dave Barger was ready to succeed him as CEO, the board suggested to Dave Neeleman that he could best serve the company as a strategic visionary, JetBlue spokeswoman Alison Eshelman said Thursday morning. Shares of JetBlue (Charts) jumped about 5 percent in midday trading on the news."}, {"url": "http://www.youtube.com/watch?v=YyHNG4Pxn2E", "passage_text": "http://www.MyNewEnterprise.com. David is the most successful entrepreneur in the history of commercial aviation. He is the founder and former CEO of JetBlue Airways and also founder of Azul Airways in Brazil. David co-founded Morris Air with June Morris, which they sold to Southwest Airlines for $130 million in 1993"}, {"url": "http://money.cnn.com/2009/03/19/smallbusiness/jetblue_founder_flies_again.fsb/index.htm", "passage_text": "In May 2007 he was unceremoniously ousted from the CEO role at JetBlue Airways (JBLU) - the company he founded in 2000 and grew to revenues of some $2.5 billion per year-after what he calls the Valentine's Day Massacre.. Azul leases two JetBlue planes, and even the name Azul-Portuguese for blue-is either a tribute to his old company or a swipe at it. Samba won a name-the-company contest that yielded 157,000 entries, but Neeleman selected the moniker that came in second."}, {"url": "https://en.wikipedia.org/wiki/David_Neeleman", "passage_text": "David G. Neeleman (born October 16, 1959) is a Brazilian-American entrepreneur who has founded four commercial airlines, Morris Air, Westjet, JetBlue Airways and Azul Brazilian Airlines. 1  1 Biography. Neeleman donated his entire salary to the JetBlue Crewmember Crisis Fund, which was established for JetBlue employees who had fallen on hard times. On May 10, 2007, David Neeleman was replaced by David Barger (born 1959) as CEO of JetBlue and on May 21, 2008 he was replaced as chairman of the board by Joel Peterson."}, {"url": "http://money.cnn.com/2009/03/19/smallbusiness/jetblue_founder_flies_again.fsb/index.htm", "passage_text": "(Fortune Small Business) -- David Neeleman, founder of Brazil's new Azul Airlines, is seated in the back of his armored Ford Fusion, stopped in a rush-hour traffic jam between the airport and his office in Sao Paulo. Azul leases two JetBlue planes, and even the name Azul-Portuguese for blue-is either a tribute to his old company or a swipe at it. Samba won a name-the-company contest that yielded 157,000 entries, but Neeleman selected the moniker that came in second."}, {"url": "https://www.cpp.com/Pdfs/CS_jetblue_case_study.pdf", "passage_text": "Founded in 2000, JetBlue Airways Corporation carved out a unique niche within the airline industry based on its promise to “bring humanity back to air travel.” The company sought to redefine the airline–customer relationship by offering a compelling mix of value, service, comfort, and style. "}, {"url": "https://en.wikipedia.org/wiki/David_Neeleman", "passage_text": "JetBlue was incorporated in Delaware in August 1998 and officially founded in February 1999, under the name NewAir by Neeleman. As the CEO of JetBlue Airways, his 2002 salary was $200,000 with a bonus of $90,000. Neeleman donated his entire salary to the JetBlue Crewmember Crisis Fund, which was established for JetBlue employees who had fallen on hard times. On May 10, 2007, David Neeleman was replaced by David Barger (born 1959) as CEO of JetBlue and on May 21, 2008 he was replaced as chairman of the board by Joel Peterson."}, {"url": "http://www.post-gazette.com/business/businessnews/2006/04/09/JetBlue-founder-David-Neeleman-Turning-Blue-into-green/stories/200604090263", "passage_text": "Tweet. By Dan Fitzpatrick Pittsburgh Post-Gazette. JetBlue Airways founder David Neeleman never excelled at school or sports, and he remembers painfully the self doubts that plagued him as a teenager, when he lacked the patience to read an entire book or write adequately. It really didn't feel like I was going anywhere, he said."}, {"url": "https://en.wikipedia.org/wiki/JetBlue_Airways", "passage_text": "JetBlue Airways Corporation (NASDAQ: JBLU), stylized as jetBlue, is an American low-cost airline and the 5th largest airline in the United States. As Chairman of the Board of Directors, I will focus on developing JetBlue's long-term vision and strategy and how we can continue to be a preferred product in a commodity business.. On July 24, 2007, JetBlue reported that its second-quarter revenue increased to $730 million, compared to $612 in 2006."}]