[{"url": "http://www.phuketresort.com/phuket/phuketfantasea/", "passage_text": "Phuket FantaSea was designed to present the most original and sophisticated family fun entertainment environment with a distinctly original Thai flair."}, {"url": "http://www.phukettoursdirect.com/fantasea-show.html", "passage_text": "Phuket FantaSea Show, or Fantasy of a Kingdom, is a Las Vegas style Thai cultural show infused with cutting edge technology and state-of-the-art show elements. The essence of being Thai, everything from the love for freedom and fun, courage and compassion, is being represented in each scene."}, {"url": "http://www.phuket.net/tours/recommended/phuket-fantasea-show/", "passage_text": "Inquire. Phuket Fantasea is one of Thailand’s most spectecular show. This cultural theme park is divided into three sections: shopping in the Festival village, dining in the Golden Kinnaree Buffet Restaurant and Vegas-style entertainment in the Palace of the Elephants. An unforgettable evening out for all the family!"}, {"url": "http://www.asiareservations.net/tours/tour_package_detail/Phuket_Fantasea_Show", "passage_text": "Created at a cost of over 3,500 million baht (US$ 100 million), Phuket Fantasea offer a multitude of attraction not found anywhere else in the world. -A shopping street where the accent is on fun and entertainment coupled with Thai people’s legendary hospitably."}, {"url": "http://phuketbesttours.com/package-tours/phuket-fantasea.htm", "passage_text": "Phuket Fantasea Show. Phuket Fanta Sea, inspired by Thailand's rich and exotic heritage, Phuket FantaSea not only showcases the charm and beauty of Thailand, but also enriches ancient Thai traditions with the wonder of cutting edge technology and special effects."}, {"url": "http://jamie-monk.blogspot.com/2011/02/phuket-fantasea.html", "passage_text": "Phuket Fantasea Show. I never thought we'd visit Phuket Fantasea. But now we have and, despite my continuing aversion to anything over-commercial, we will probably visit again. Phuket Fantasea is the biggest, most overtly touristy attraction in Phuket. I probably don't need to explain what it is-a huge theme park with a huge stage show, a huge buffet restaurant and plenty of shops to tempt people into spending more than just the entry fee."}]