[{"url": "http://familydoctor.org/familydoctor/en/diseases-conditions/arrhythmia/treatment/cardioverter-defibrillator-a-treatment-for-arrhythmia.html", "passage_text": "The pulse generator may be implanted either under your collarbone on the left or right side of your chest, or in your abdomen (stomach area). In any of these places, the generator may be put in a pocket the doctor makes under your skin or, sometimes, in a muscle. An ICD is implanted in your body, meaning it is put in your body surgically. It is not much bigger than a cell phone, and has two main parts: a pulse generator and one or more leads. The pulse generator constantly keeps track of your heartbeat."}, {"url": "http://www.fda.gov/MedicalDevices/ProductsandMedicalProcedures/DeviceApprovalsandClearances/Recently-ApprovedDevices/ucm326541.htm", "passage_text": "The Subcutaneous Implantable Defibrillator (S-ICD) System is a defibrillator that is implanted under the skin (subcutaneous). It provides an electric shock to the heart (defibrillation) for the treatment of an abnormally rapid heartbeat that originates from the lower chambers of the heart (ventricular tachyarrhythmias). How does it work? The S-ICD (pulse generator) is implanted under the skin on the side of the chest below the arm pit. The pulse generator is connected to the electrode which is implanted under the skin from the device pocket along the rib margin to the breastbone with the use of the insertion tool."}, {"url": "http://www.veteranshealthlibrary.org/RelatedItems/142,82025_VA", "passage_text": "Implantable Cardioverter Defibrillator (ICD). An ICD is a device that is placed permanently inside your body. An ICD monitors your heart rhythm (the speed and pattern of your heartbeat). How the ICD Is Put into the Body. The ICD is usually implanted on the left side of your chest. Implantation does not require open heart surgery (your chest will not be opened). During implantation: An incision is made in the skin below the collarbone. This creates a “pocket” to hold the ICD"}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/test_procedures/cardiovascular/implantable_cardioverter_defibrillator_icd_insertion_92,P08774/", "passage_text": "An implantable cardioverter defibrillator (ICD) is a small, electronic device that continuously monitors the electrical activity of the heart. It is about the size of a stop watch and is usually inserted under the skin in the upper chest. It consists of a pulse generator and wires, called leads. "}, {"url": "http://www.medtronic.com/patients/sudden-cardiac-arrest/device/what-is-it/index.htm", "passage_text": "A defibrillator typically is implanted in the upper chest. An implantable cardioverter defibrillator (ICD) is a tiny computer, plus a battery, contained in a small titanium metal case that is about the size of a pocket watch. It weighs approximately 3 ounces. The ICD is implanted under your skin, typically on the left or right side of your chest, just below the collarbone. The third part of your implantable device system is a programmer, an external computer located in your doctor's office or clinic that is used to program the heart device and retrieve information from your device that will assist your doctor in your treatment."}, {"url": "https://www.nhlbi.nih.gov/health/health-topics/topics/icd/", "passage_text": "An implantable cardioverter defibrillator (ICD) is a small device that's placed in the chest or abdomen. Doctors use the device to help treat irregular heartbeats called arrhythmias (ah-RITH-me-ahs). Comparison of an Implantable Cardioverter Defibrillator and a Pacemaker. The image compares an ICD with a pacemaker. Figure A shows the location and general size of an ICD in the upper chest."}, {"url": "http://www.aafp.org/afp/1998/0115/p310.html", "passage_text": "Before the ICD is implanted, your doctor will look at your size and shape, note any previous chest surgeries you may have had and the activities that you like to do. The pulse generator may be implanted either under your collarbone on the left or right side of your chest, or in your abdomen (tummy area). An implantable cardioverter-defibrillator system (often called an ICD) includes a pulse generator and one or more leads that are put into (surgically implanted in) your body. The pulse generator, which constantly watches your heart beat, is like a small computer. It runs on a battery."}]