[{"url": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/the-nutrition-of-strawberries.html", "passage_text": "This is primarily due to the fact that strawberries contain high amounts of carbohydrates, which per gram have only four calories. When compared to fat, which has nine calories per gram, or alcohol, which has seven calories per gram, it is easy to understand why strawberries are a relatively low calorie food. Fiber Content of Strawberries. One of the most important nutritional components of strawberries is their high fiber content. Strawberries not only contain high amounts of fiber in the meat of the berry, but also within the seeds of the fruit. Fiber can help in the prevention of a number of chronic health conditions, and it's important in the treatment and prevention of constipation"}, {"url": "http://healthyeating.sfgate.com/vitamins-strawberries-contain-1424.html", "passage_text": "B Vitamins. Strawberries contain five of the B-complex vitamins. Thiamin, riboflavin and niacin share similar functions. They’re all coenzymes needed to turn food into energy, ensure healthy skin, keep the nervous system working and to create red blood cells. Vitamin E and Vitamin K. Vitamin E and vitamin K are fat-soluble vitamins, which means they're stored in the body. Over-consumption of vitamin E may lead to toxicity, so you shouldn't have more than 1,000 milligrams a day."}, {"url": "http://www.californiastrawberries.com/health_and_nutrition/whats_in_a_strawberry", "passage_text": "California strawberries are packed with vital nutrients. Vitamin C is a water-soluble vitamin with potent antioxidant capabilities essential for many biological functions, most notably ensuring proper wound healing and maintaining cartilage. One serving of eight medium strawberries provides 160 percent of the recommended Daily Value. Potassium is an important nutrient to balance electrolytes, aid muscle contractions, and maintain a healthy blood pressure. Diets rich in potassium can lower blood pressure by buffering the effects of sodium on blood pressure. One serving, or eight medium strawberries, provides three grams of fiber, making this fruit a good source of dietary fiber. Antioxidants are key to warding off chronic diseases and promoting optimum health. Research shows that the antioxidants in strawberries are efficiently absorbed within one hour after being eaten."}, {"url": "http://healthyeating.sfgate.com/vitamins-strawberries-contain-1424.html", "passage_text": "One cup of whole strawberries provides about 3 percent of the recommended daily value of these three B vitamins. The same serving size also contains 5 percent of the recommended daily intake for vitamin B-6 and 9 percent of folate. Vitamin B-6 helps the body produce serotonin and steroid hormones. Vitamin E and Vitamin K. Vitamin E and vitamin K are fat-soluble vitamins, which means they're stored in the body. Over-consumption of vitamin E may lead to toxicity, so you shouldn't have more than 1,000 milligrams a day."}, {"url": "http://www.nutrition-and-you.com/strawberries.html", "passage_text": "Health benefits of strawberries. Strawberry is low in calories (32 cal/100 g) and fats but rich source of health promoting phyto-nutrients, minerals, and vitamins that are essential for optimum health. Strawberries have significantly high amounts of phenolic flavonoid phyto-chemicals called anthocyanins and ellagic acid. Strawberries contain vitamin-A, vitamin-E and health promoting flavonoid poly phenolic antioxidants such as lutein, zea-xanthin, and beta-carotene in small amounts."}, {"url": "http://www.mnn.com/food/healthy-eating/stories/8-reasons-to-appreciate-nutrition-packed-strawberries", "passage_text": "Most strawberry lovers know that a serving contains a lot of vitamin C. In fact, one cup of strawberries (about eight medium-sized berries) yields 150 percent daily value (DV) of vitamin C. Talk about nutrient density! That’s a lot of vitamin C for only 50 calories. Strawberries are also relatively high in fiber. "}, {"url": "http://www.nutrition-and-you.com/strawberries.html", "passage_text": "The fruit is rich in B-complex group of vitamins. It contains very good amounts of vitamin B-6, niacin, riboflavin, pantothenic acid and folic acid. These vitamins are acting as co-factors help the body metabolize carbohydrate, proteins and fats. Strawberries contain vitamin-A, vitamin-E and health promoting flavonoid poly phenolic antioxidants such as lutein, zea-xanthin, and beta-carotene in small amounts."}]