[{"url": "http://www.answers.com/Q/Is_a_nerve_cell_part_of_an_organ_or_tissue", "passage_text": "A nerve cell is a cell all by itself. There are two kinds of nerve cells, neurons and neuroglia. A single nerve cell can be part of a group of similar nerve cells and be considered a tissue; as in a nerve, which is composed of many nerve cells. But, if there is more than one kind of tissue that contributes to a common function, then we call that an organ."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20130917124331AAwYzGZ", "passage_text": "It depends. A nerve cell (a neuron) is a cell, not an organ. A large group of nerve cells make up the central nervous system, another group makes up the autonomic nervous system. I don't know if these qualify as an organ or not (depends on the medical definition of an organ)."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20130917124331AAwYzGZ", "passage_text": "Please disregard all the above answers. YES, a nerve is definitely an organ!! It is definitely not a cell-it is made up of many cells and cell parts. A nerve is a bundle of axons (nervous tissue), wrapped in connective tissue, which contains blood vessels serving those axons. The blood vessels are lined by epithelium, and their walls contain smooth muscle. An organ is made up of some of each of the 4 basic tissue types: So a nerve is an organ."}, {"url": "http://www.answers.com/Q/Is_a_nerve_an_organ", "passage_text": "Yes nerve is an organ of nervous system ., Each nerve is a cordlike structure that contains many axons. These axons are often referred to as 'fibres'. Within a nerve, each axon is surrounded by a layer of connective tissue called the endoneurium."}, {"url": "http://www.biologyreference.com/Oc-Ph/Organ.html", "passage_text": "An organ is a structure composed of two to four types of tissues working to perform functions that are beyond the scope of an individual tissue type. A set of related organs working cooperatively toward the performance of even more complex functions constitutes an organ system."}, {"url": "http://training.seer.cancer.gov/anatomy/muscular/structure.html", "passage_text": "Structure of Skeletal Muscle. A whole skeletal muscle is considered an organ of the muscular system. Each organ or muscle consists of skeletal muscle tissue, connective tissue, nerve tissue, and blood or vascular tissue. Skeletal muscles vary considerably in size, shape, and arrangement of fibers."}]