[{"url": "http://www.merriam-webster.com/dictionary/radio%20frequency", "passage_text": ": any of the electromagnetic wave frequencies that lie in the range extending from below 3 kilohertz to about 300 gigahertz and that include the frequencies used for communications signals (as for radio and television broadcasting and cell-phone and satellite transmissions) or radar signals."}, {"url": "http://www.merriam-webster.com/dictionary/radio%20frequency", "passage_text": "See radio frequency defined for kids. ADVERTISEMENT. noun. : any of the electromagnetic wave frequencies that lie in a range extending from below 3 kilohertz to about 300 gigahertz and that include the frequencies used in radio and television transmission."}, {"url": "https://en.wikipedia.org/wiki/Radio_frequency", "passage_text": "For other uses, see RF (disambiguation) . Radio frequency (RF): any of the electromagnetic wave frequencies that lie in the range extending from around 7003300000000000000♠3 kHz to 7011300000000000000♠300 GHz, which include those frequencies used for communications or radar signals."}, {"url": "http://www.merriam-webster.com/dictionary/radio%20frequency", "passage_text": "Medical Definition of RADIO FREQUENCY. : any of the electromagnetic wave frequencies that lie in a range extending from below 3 kilohertz to about 300 gigahertz and that include the frequencies used in radio and television transmission."}, {"url": "http://www.mouser.com/applications/rf-wireless-technology/", "passage_text": "GPS Solutions. A radio frequency (RF) signal refers to a wireless electromagnetic signal used as a form of communication, if one is discussing wireless electronics. Radio waves are a form of electromagnetic radiation with identified radio frequencies that range from 3Hz to 300 GHz."}, {"url": "https://en.wikipedia.org/wiki/Radio_frequency", "passage_text": "Although radio frequency is a rate of oscillation, the term radio frequency or its abbreviation RF are used as a synonym for radio – i.e., to describe the use of wireless communication, as opposed to communication via electric wires."}, {"url": "http://www.thefreedictionary.com/radio+frequency", "passage_text": "a. a frequency or band of frequencies that lie in the range 10 kilohertz to 300 000 megahertz and can be used for radio communications and broadcasting. Abbreviations: rf or RF See also frequency band. b. (as modifier): a radio-frequency amplifier."}, {"url": "http://hps.org/hpspublications/articles/rfradiation.html", "passage_text": "The frequency of an RF signal is usually expressed in terms of a unit called the hertz (Hz). One Hz equals one cycle per second. One megahertz (MHz) equals one million cycles per second. Different forms of electromagnetic energy are categorized by their wavelengths and frequencies."}, {"url": "http://www.merriam-webster.com/dictionary/radio%20frequency", "passage_text": "radio frequency. noun. : any of the electromagnetic wave frequencies that lie in a range extending from below 3 kilohertz to about 300 gigahertz and that include the frequencies used in radio and television transmission."}]