[{"url": "https://en.wikipedia.org/wiki/Novak", "passage_text": "Nowak is a common surname in a number of Slavic languages (one of the most popular surnames in many Slavic countries, namely Czech Republic, Croatia, Serbia, Slovakia, and Slovenia) and a masculine given name of Slavic origin. It can also be found in Romania and Moldova in the Novac form. There are two noble families of Polish origin with the surname Nowak. 1  One family appeared in Silesia in the 15th century. 2  One family appeared in Masovia around 1750."}, {"url": "https://en.wikipedia.org/wiki/Lisa_Nowak", "passage_text": "Lisa Marie Nowak (nee Née, caputo Born may, 10) 1963 is An american former naval flight officer AND nasa. Astronaut born In, Washington.D. , c she was selected BY nasa in 1996 and qualified as a mission specialist in. robotics Born in Washington, D.C. , she was selected by NASA in 1996 and qualified as a mission specialist in robotics. Nowak flew aboard Space Shuttle Discovery during the STS-121 mission in July 2006, where she was responsible for operating the robotic arms of the shuttle and the International Space Station."}, {"url": "https://en.wikipedia.org/wiki/Lisa_Nowak", "passage_text": "Her assignment to the space agency as an astronaut was terminated by NASA effective March 8, 2007. On November 10, 2009, Nowak agreed to a plea deal with prosecutors and pleaded guilty to charges of felony burglary of a car and misdemeanor battery. Born in Washington, D.C. , she was selected by NASA in 1996 and qualified as a mission specialist in robotics. Nowak flew aboard Space Shuttle Discovery during the STS-121 mission in July 2006, where she was responsible for operating the robotic arms of the shuttle and the International Space Station."}, {"url": "http://www.magiastrology.com/sexual_captivations_Nowak.htm", "passage_text": "Which means Magi Astrology fully understands Lisa Nowak s disaster in all of its dimensions. By utilizing the principles of Magi Astrology, we learn that Nowak was trapped in a SEXUAL CAPTIVATION, where Oefelein was the Trapper she was the Captive. And this is one of the main reasons for the Nowak meltdown. (This is also the case with Nowak and Oefelein.). For all these reasons, Juno Sexual Linkages is one of the two components that create a Sexual Captivation. (Illusions are necessary for Captivations.) The basis of a Sexual Captivation is great sex coupled with illusions of love-Juno creates both."}, {"url": "https://en.wikipedia.org/wiki/Lisa_Nowak", "passage_text": "Nowak gained international attention on February 5, 2007, when she was arrested in Orlando, Florida, and subsequently charged with the attempted kidnapping of U.S. Air Force Captain Colleen Shipman, who was romantically involved with astronaut William Oefelein. Born in Washington, D.C. , she was selected by NASA in 1996 and qualified as a mission specialist in robotics. Nowak flew aboard Space Shuttle Discovery during the STS-121 mission in July 2006, where she was responsible for operating the robotic arms of the shuttle and the International Space Station."}, {"url": "https://en.wikipedia.org/wiki/Novak", "passage_text": "The surname Nowak is the most common in nine voivodeships (administrative units) of Poland, and second in another. 1  Nowak is 1st in Greater Poland Voivodeship (35,011). 2  Nowak is 1st in Silesian Voivodeship (31,838). 3  Nowak is 1st in Lesser Poland Voivodeship (23,671). There are two noble families of Polish origin with the surname Nowak. 1  One family appeared in Silesia in the 15th century. 2  One family appeared in Masovia around 1750."}, {"url": "https://en.wikipedia.org/wiki/Lisa_Nowak", "passage_text": "Nowak married Richard T. Nowak, a classmate at both the U.S. Naval Academy and naval flight school, in 1988. Richard Nowak was employed by a contractor to NASA at Johnson Space Center while concurrently continuing to fly for the Navy as an officer in the Naval Air Reserve. Born in Washington, D.C. , she was selected by NASA in 1996 and qualified as a mission specialist in robotics. Nowak flew aboard Space Shuttle Discovery during the STS-121 mission in July 2006, where she was responsible for operating the robotic arms of the shuttle and the International Space Station."}, {"url": "https://www.gofundme.com/ddpwfk", "passage_text": "Subscribe to Updates Donate Tweet Share. Rachel Nowak is a junior this year at Venice High School who lost her left hand in a tragic jet ski accident on Roberts Bay in June, 2014 just 20 days before her 16th birthday. Rachel’s first thoughts when she surfaced and saw her injury was about cheerleading. How it Works Donations to ‘Certified Charity’ campaigns get delivered directly to the charity listed. 1) YOU MAKE A DONATION Payments are processed by FirstGiving. 2) CHECKS ARE ISSUED Once a month, a check will be sent to the charity."}]