[{"url": "https://en.wikipedia.org/wiki/Civil_rights_movement", "passage_text": "On March 26, 1964, as the Civil Rights Act was facing stiff opposition in Congress, Malcolm had a public meeting with Martin Luther King, Jr. at the Capitol building. Malcolm had attempted to begin a dialog with Dr. King as early as 1957, but King had rebuffed him. The House passed the legislation on April 10, and President Johnson signed it the next day. The Civil Rights Act of 1968 prohibited discrimination concerning the sale, rental, and financing of housing based on race, religion, national origin."}, {"url": "http://portal.hud.gov/hudportal/HUD?src=/program_offices/fair_housing_equal_opp/aboutfheo/history", "passage_text": "On April 11, 1968, President Lyndon Johnson signed the Civil Rights Act of 1968, which was meant as a follow-up to the Civil Rights Act of 1964. "}, {"url": "http://www.crf-usa.org/black-history-month/the-civil-rights-act-of-1964", "passage_text": "Johnson and the Civil Rights Bill. Kennedy’s assassination on November 22, 1963, changed the political dynamics of the impending civil rights legislation. Vice President Lyndon B. Johnson succeeded Kennedy and almost immediately intensified the campaign for a major civil rights bill. The civil rights movement deeply affected American society. Among its most important achievements were two major civil rights laws passed by Congress. These laws ensured constitutional rights for African Americans and other minorities."}, {"url": "https://en.wikipedia.org/wiki/Civil_Rights_Act_of_1964", "passage_text": "The Civil Rights Act of 1964 (Pub.L. 88–352, 78 Stat. 241, enacted July 2, 1964) is a landmark piece of civil rights legislation in the United States that outlawed discrimination based on race, color, religion, sex, or national origin. Despite its lack of influence during its time, the Civil Rights Act of 1964 had considerable impact on later civil rights legislation in the United States. It paved the way for future legislation that was not limited to African American civil rights."}, {"url": "http://www.history.com/topics/black-history/civil-rights-act", "passage_text": "President Lyndon B. Johnson signed the Civil Rights Act of 1964 with at least 75 pens, which he handed out to congressional supporters of the bill such as Hubert Humphrey and Everett Dirksen and to civil rights leaders such as Martin Luther King Jr. and Roy Wilkins. Introduction. The Civil Rights Act of 1964, which ended segregation in public places and banned employment discrimination on the basis of race, color, religion, sex or national origin, is considered one of the crowning legislative achievements of the civil rights movement."}, {"url": "http://www.scholastic.com/teachers/article/civil-rights-movement-overview", "passage_text": "Following Kennedy's assassination, President Lyndon Johnson maneuvered the Civil Rights Act of 1964 through Congress. Representing a major victory for African Americans, the 1964 legislation outlawed segregation in public places and prohibited racial and gender discrimination in employment practices. "}, {"url": "http://www.history.com/topics/black-history/civil-rights-movement", "passage_text": "Many leaders from within the African American community and beyond rose to prominence during the Civil Rights era, including Martin Luther King, Jr., Rosa Parks, Malcolm X, Andrew Goodman and others. They risked—and sometimes lost—their lives in the name of freedom and equality. Southern colleges and universities that once excluded blacks began to recruit them. Despite the civil rights gains of the 1960s, however, racial discrimination and repression remained a significant factor in American life."}, {"url": "http://www.history.com/topics/black-history/civil-rights-movement", "passage_text": "Post 1960′s Civil Rights Movement. Severe government repression, the assassinations of Malcolm X and Martin Luther King, and the intense infighting within the black militant community caused a decline in protest activity after the 1960s. Southern colleges and universities that once excluded blacks began to recruit them. Despite the civil rights gains of the 1960s, however, racial discrimination and repression remained a significant factor in American life."}, {"url": "http://www.crf-usa.org/black-history-month/the-civil-rights-act-of-1964", "passage_text": "It was only after years of highly publicized civil rights demonstrations, marches, and violence that American political leaders acted to enforce these rights. President Lyndon Johnson signs the historic Civil Rights Act of 1964. Behind him stands the Reverend Martin Luther King Jr. (Wikimedia Commons). President John F. Kennedy proposed the initial civil rights act. Kennedy faced great personal and political conflicts over this legislation. The civil rights movement deeply affected American society. Among its most important achievements were two major civil rights laws passed by Congress. These laws ensured constitutional rights for African Americans and other minorities."}]