[{"url": "http://biology.about.com/od/cellanatomy/ss/cell-membrane.htm", "passage_text": "1 Cholesterol is not found in the membranes of plant cells. 2  Glycolipids are located on cell membrane surfaces and have a carbohydrate sugar chain attached to them. 3  They help the cell to recognize other cells of the body. It also serves as a base of attachment for the cytoskeleton in some organisms and the cell wall in others. Thus the cell membrane also serves to help support the cell and help maintain its shape. Animal cells, plant cells, prokaryotic cells, and fungal cells have cell membranes."}, {"url": "http://biology.about.com/od/cellanatomy/ss/cell-membrane.htm", "passage_text": "1 The lipid bilayer is semi-permeable, allowing only certain molecules to diffuse across the membrane. 2  Cholesterol is another lipid component of animal cell membranes. It also serves as a base of attachment for the cytoskeleton in some organisms and the cell wall in others. Thus the cell membrane also serves to help support the cell and help maintain its shape. Animal cells, plant cells, prokaryotic cells, and fungal cells have"}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Biology/mempot.html", "passage_text": "Cell Membrane Potentials. Cell membranes in general, and membranes of nerve cells in particular, maintain a small voltage or potential across the membrane in its normal or resting state. In the rest state, the inside of the nerve cell membrane is negative with respect to the outside (typically about -70 millivolts). If the cell membranes were simply permeable to these ions, they would approach an equilibrium with equal concentrations on each side of the membrane, and hence no voltage difference. This makes it clear that the processes which produce the membrane potential are not simply diffusion and osmosis."}, {"url": "http://www.cytochemistry.net/cell-biology/membrane.htm", "passage_text": "Membrane Architecture. Membranes are vital because they separate the cell from the outside world. They also separate compartments inside the cell to protect important processes and events. Cellular membranes have diverse functions in the different regions and organelles of a cell."}, {"url": "http://www.biology-online.org/dictionary/Membrane", "passage_text": "Membrane. Definition. noun, plural: membranes. (1) (biology) A thin layer of tissue covering a surface or lining a cavity, space or organ. (2) (biology) A cell membrane. (3) (chemistry) A thin pliable sheet of material that is permeable to substances in solution. Supplement. A biological membrane functions by protecting the surface or bodily organ."}, {"url": "http://biology.about.com/od/biologydictionary/g/cell-membrane.htm", "passage_text": "Share. By Regina Bailey. Definition: The cell membrane is a thin semi-permeable membrane that surrounds the cytoplasm of a cell, enclosing its contents. Its function is to protect the integrity of the interior of the cell by allowing certain substances into the cell, while keeping other substances out. It also serves as a base of attachment for the cytoskeleton in some organisms and the cell wall in others. Thus the cell membrane also serves to help support the cell and help maintain its shape. The cell membrane is primarily composed of a mix of proteins and lipids. While lipids help to give membranes their flexibility, proteins monitor and maintain the cell's chemical climate and assist in the transfer of molecules across the membrane"}, {"url": "http://biology.about.com/od/cellanatomy/ss/cell-membrane.htm", "passage_text": "Cell Membrane Structure. The cell membrane is primarily composed of a mix of proteins and lipids. Depending on the membrane’s location and role in the body, lipids can make up anywhere from 20 to 80 percent of the membrane, with the remainder being proteins. It also serves as a base of attachment for the cytoskeleton in some organisms and the cell wall in others. Thus the cell membrane also serves to help support the cell and help maintain its shape. Animal cells, plant cells, prokaryotic cells, and fungal cells have cell membranes."}]