[{"url": "http://www.helpwithcooking.com/cooking-poultry/roast-chicken.html", "passage_text": "Therefore, a 5 lb chicken will need to be roasting in the oven for at least 1h 50 mins. A 5 lb bird will serve between 4 - 5 people. Some people prefer to set the oven temperature to 450ºF (230ºC) and roast the bird at this high temperature for the first 10 - 15 minutes or the last 10 - 15 minutes."}, {"url": "http://www.foodnetwork.com/recipes/ina-garten/perfect-roast-chicken-recipe.html", "passage_text": "Spread around the bottom of the roasting pan and place the chicken on top. Roast the chicken for 1 1/2 hours, or until the juices run clear when you cut between a leg and thigh. Remove the chicken and vegetables to a platter and cover with aluminum foil for about 20 minutes."}, {"url": "http://www.justapinch.com/recipes/main-course/chicken/how-to-roast-the-perfect-whole-chicken.html", "passage_text": "--7-7.5lbs=2 hours/45 minutes=2 hours/30 minutes. NOTE: These times are for unstuffed birds. Add 15 minutes to the total cooking time if you're roasting a stuffed chicken. And as with the chicken itself, make sure the stuffing reaches a temperature of at least 165 degrees F (74 degrees C)."}, {"url": "http://www.bbc.co.uk/food/recipes/roastchicken_90247", "passage_text": "Cover the chicken loosely with foil and roast in the oven for 30 minutes. After 30 minutes, remove the foil and roast for another 20-30 minutes and reduce the temperature to 160C-180C/320F-350F/Gas 3-4. It's fully cooked when the juices run clear when the bird is pierced in the thigh with a skewer."}, {"url": "http://www.bhg.com/recipes/how-to/handling-meat/how-long-to-cook-chicken/", "passage_text": "How Long to Cook a Whole Chicken. 1  2-1/2 to 3 pounds: Roast at 375 degrees F for 1 to 1-1/4 hours. 2  3 to 3-1/2 pounds: Roast at 375 degrees F for 1-1/4 to 1-1/2 hours. 3  3-1/2 to 4 pounds: Roast at 375 degrees F for 1-1/4 to 1-3/4 hours. 4  4-1/2 to 5 pounds: Roast at 375 degrees F for 1-1/2 to 2 hours."}, {"url": "http://www.helpwithcooking.com/cooking-poultry/roast-chicken.html", "passage_text": "Roasting a chicken does not take quite so long as roasting a turkey, however a large chicken could still take over 2 hours to roast. As a general rule, calculate a cooking time of 20 minutes per pound of meat plus an additional 10 - 20 minutes at a temperature of 375ºF (190ºC)."}]