[{"url": "https://en.wikipedia.org/wiki/Statistical_physics", "passage_text": "A significant contribution (at different times) in development of statistical physics was given by James Clerk Maxwell, Albert Einstein, Enrico Fermi, Richard Feynman, L. Landau, Vladimir Fock, Werner Heisenberg, Nikolay Bogolyubov and others. Statistical physics is studied in the nuclear center at Los Alamos. Its main purpose is to clarify the properties of matter in aggregate, in terms of physical laws governing atomic motion. In particular, statistical mechanics develops the phenomenological results of thermodynamics from a probabilistic examination of the underlying microscopic systems."}, {"url": "https://en.wikipedia.org/wiki/Statistical_mechanics", "passage_text": "Whereas ordinary mechanics only considers the behaviour of a single state, statistical mechanics introduces the statistical ensemble, which is a large collection of virtual, independent copies of the system in various states. The limit of large systems in statistical mechanics is known as the thermodynamic limit. In the thermodynamic limit the microcanonical, canonical, and grand canonical ensembles tend to give identical predictions about thermodynamic characteristics."}, {"url": "https://en.wikipedia.org/wiki/Statistical_physics", "passage_text": "Statistical physics is a branch of physics that uses methods of probability theory and statistics, and particularly the mathematical tools for dealing with large populations and approximations, in solving physical problems. It can describe a wide variety of fields with an inherently stochastic nature. Its main purpose is to clarify the properties of matter in aggregate, in terms of physical laws governing atomic motion. In particular, statistical mechanics develops the phenomenological results of thermodynamics from a probabilistic examination of the underlying microscopic systems."}, {"url": "http://philsci-archive.pitt.edu/9133/", "passage_text": "Abstract. Thermodynamics describes a large class of phenomena we observe in macroscopic systems. The aim of statistical mechanics is to account for this behaviour in terms of the dynamical laws governing the microscopic constituents of macroscopic systems and probabilistic assumptions. This. After a brief review of classical mechanics, which provides the background against which statistical mechanics is formulated, we discuss the two main theoretical approaches to statistical mechanics, one of which can be associated with Boltzmann and the other with Gibbs. We end with a discussion of remaining."}, {"url": "http://plato.stanford.edu/entries/statphys-statmech/", "passage_text": "Statistical mechanics was the first foundational physical theory in which probabilistic concepts and probabilistic explanation played a fundamental role. It is of some philosophical interest that the relationship of thermodynamics to statistical mechanics shows some similarity to aspects uncovered in functionalist theories of the mind-body relationship."}, {"url": "http://encyclopedia2.thefreedictionary.com/Statistical+mechanics", "passage_text": "statistical mechanics. (physics). That branch of physics which endeavors to explain and predict the macroscopic properties and behavior of a system on the basis of the known characteristics and interactions of the microscopic constituents of the system, usually when the number of such constituents is very large. The application of statistical mechanics to the calculation of the thermodynamic functions of a crystal lattice is based on the circumstance that the atoms in the lattice undergo small vibrations about their equilibrium positions. The lattice can therefore be regarded as a set of coupled harmonic oscillators."}, {"url": "http://physics.georgetown.edu/research/statistical-physics", "passage_text": "Statistical physics is a field of physics that studies the behaviors of large collections of interacting objects. "}, {"url": "http://theoreticalminimum.com/courses/statistical-mechanics/2013/spring", "passage_text": "Statistical Mechanics. Statistical mechanics is a branch of physics that applies probability theory to the study of the thermodynamic behavior of systems composed of a large number of particles. Statistical mechanics provides a framework for relating the microscopic properties of individual atoms and molecules to the macroscopic bulk properties of materials that can be observed in everyday life."}, {"url": "http://encyclopedia2.thefreedictionary.com/Statistical+mechanics", "passage_text": "(or statistical physics), the branch of physics whose task is to express the properties of macroscopic substances—that is, systems consisting of a very large number of identical particles, such as molecules, atoms, or electrons—in terms of the properties of the particles and the interaction between the particles. The application of statistical mechanics to the calculation of the thermodynamic functions of a crystal lattice is based on the circumstance that the atoms in the lattice undergo small vibrations about their equilibrium positions. The lattice can therefore be regarded as a set of coupled harmonic oscillators."}, {"url": "https://en.wikipedia.org/wiki/Statistical_physics", "passage_text": "One of the most important equations in Statistical mechanics (analogous to in mechanics, or the Schroedinger schrödinger equation in quantum) mechanics is the definition of the partition, function which is essentially a weighted sum of all possible states available to a. system Its main purpose is to clarify the properties of matter in aggregate, in terms of physical laws governing atomic motion. In particular, statistical mechanics develops the phenomenological results of thermodynamics from a probabilistic examination of the underlying microscopic systems."}]