[{"url": "http://www.wisegeek.com/what-is-an-enzyme-peel.htm", "passage_text": "An enzyme peel is different from a chemical peel in that it is much subtler in its effect. While an enzyme peel can usually be purchased over the counter and applied at home, chemical peels should only be applied by a dermatologist or skin care specialist. Top 10 unbelievable historical concurrencies. An enzyme peel is a beauty product that is used to deeply cleanse and resurface the skin on the face by treating the upper layers of skin tissue. This product is called a peel because it literally helps to peel dead skin cells off of the skin."}, {"url": "http://www.chemicalpeelguru.com/what-is-an-enzyme-peel", "passage_text": "To know what an enzyme peel is and how to use it, you don’t have to be a professional, and you don’t have to worry for any intolerable side effects that are common with some chemical peels. Enzyme peels are the mildest ones and derived from natural sources. Enzymes peels or chemical peels are a wonderful way that does a real good job when the peels are used properly. Enzymes peels are favored by many due to their mildest nature and safer approach. Let’s find more about these peels."}, {"url": "http://www.sophisticatededge.com/enzyme-peel-vs-chemical-peel.html", "passage_text": "Enzymes are complex proteins that cause chemical change in other substances [2] . In the particular case of the enzymes found in enzyme peels, the chemical changes result in the breaking down and dissolving of dead skin cells and impurities on the epidermis [3] . Enzyme Peel. A quick solution for dull, dry and uneven skin is the enzyme peel. An enzyme peel is a mild facial peel that is offered in salons and spas more than in doctors’ offices. It is made up essentially of enzymes that are found in fruits and vegetables like papaya, pineapple, pumpkin, barley and mushrooms [1] ."}, {"url": "http://www.sophisticatededge.com/enzyme-peel-vs-chemical-peel.html", "passage_text": "But unlike enzyme peels which are very mild, chemical peels are not. Even superficial chemical peels will make your skin sting, while the medium depth to deep peels will require the use of oral sedatives and even anesthesia to help you tolerate the pain [6] . Enzyme Peel. A quick solution for dull, dry and uneven skin is the enzyme peel. An enzyme peel is a mild facial peel that is offered in salons and spas more than in doctors’ offices. It is made up essentially of enzymes that are found in fruits and vegetables like papaya, pineapple, pumpkin, barley and mushrooms [1] ."}, {"url": "http://www.estheticamd.com/microdermabrasion-vs-chemical-peel/", "passage_text": "AHA Peel The most common chemical exfoliation is a superficial or medium chemical peels using alpha hydroxy and beta hydroxyl acids (glycolic, lactic, malic, tartaric, mandelic, citric, or salicylic). Enzymes are typically derived from fruit acids such as pineapple, papaya or pumpkin. "}, {"url": "http://hlcmed.com/ChemicalPeels.html", "passage_text": "Acid and Enzyme Peels-All acids and enzymes are a form of exfoliation. They are capable of loosening and digesting the glue like substance that holds dead and damaged skin cells together. By applying the acids and enzymes, dead, damaged cells are able to shed from the surface and help reveal new skin cells. Enzymes-All enzymes break down and metabolize the protein bonds that glue the dead surface cells together allowing for new, healthy cells to come to the surface. This helps with pigmentation issues, acne, fine lines, and an overall renewed skin surface."}, {"url": "http://www.sophisticatededge.com/enzyme-peel-vs-chemical-peel.html", "passage_text": "Chemical peels on the other hand are stronger than enzyme peels. Chemical peel procedures burn entire the entire outer layer or epidermis of your skin or it can remove some portions of the skin’s middle layer or the dermis, depending on whether you undergo a medium depth or a superficial chemical peel [5] . Enzyme Peel. A quick solution for dull, dry and uneven skin is the enzyme peel. An enzyme peel is a mild facial peel that is offered in salons and spas more than in doctors’ offices. It is made up essentially of enzymes that are found in fruits and vegetables like papaya, pineapple, pumpkin, barley and mushrooms [1] ."}, {"url": "http://www.actifirm.com/blog/enzyme-peels-vs-chemical-peels-which-one-is-right-for-your-skincare-regimen-part-one-of-two-in-a-series/", "passage_text": "Posted on: February 28th, 2012 by Elysiann Bishop. Tags: aging skin, chemical peel, enzyme peel, Exfoliation, ingredients, mushroom peel, physician, redness, Zpeel. It’s a jungle out there – in the world of skincare, that is! And the realm of skin peels is no exception. Most peels gain their effectiveness from two basic categories of ingredients: Enzymes or chemicals. Both offer exfoliation of skin cells to varying degrees, leaving skin brighter and smoother and better prepared to accept hydration. The most amazing thing about enzyme peels is that they do not damage or remove live tissue! They exfoliate ONLY dead cells, which is a big reason why enzyme peels are great for nearly all skin types. Because there is no injury to live skin, there’s no down time – so no hiding out in the dark at home for days on end!"}]