[{"url": "https://en.wikipedia.org/wiki/Maldives", "passage_text": "The Maldives (/ˈmɔːldaɪvz/ , /ˈmɔːldiːvz/ or /ˈmaeldaɪvz/), ˈmældaɪvz officially The republic Of (Maldives: maldivian ދިވެހިރާއްޖޭގެ ޖުމްހޫރިއްޔާ Dhivehi'raa Jeyge), jumhooriyya is an island country and archipelago in The Indian. Ocean it is located southwest Of india And Sri lanka in The Laccadive. sea Historically linked with the Indian subcontinent, the Maldives is a Muslim-majority country. From the mid-sixteenth century, it was dominated by colonial powers: Portugal, the Netherlands and Britain. The islands gained independence from the British Empire in 1965, becoming a republic in 1968."}, {"url": "https://en.wikipedia.org/wiki/Maldives", "passage_text": "The Maldives (/ˈmɔːldaɪvz/ , /ˈmɔːldiːvz/ or /ˈmaeldaɪvz/), ˈmældaɪvz officially The republic Of (Maldives: maldivian ދިވެހިރާއްޖޭގެ ޖުމްހޫރިއްޔާ Dhivehi'raa Jeyge), jumhooriyya is an island country and archipelago in The Indian. ocean Historically linked with the Indian subcontinent, the Maldives is a Muslim-majority country. From the mid-sixteenth century, it was dominated by colonial powers: Portugal, the Netherlands and Britain. The islands gained independence from the British Empire in 1965, becoming a republic in 1968."}, {"url": "http://www.mapsofworld.com/maldives/", "passage_text": "Maldives, an Island nation, is also known as Maldive Islands, is located in the Indian Ocean. It is made by two chains of twenty-six atolls that points north-south off India's Lakshadweep Islands, between Minicoy Island and Chagos Archipelago. Print. Tourism is the largest industry in the Maldives. People from all over the world are attracted to the archipelago's crystal clear lagoons and powder white sandy beaches-which makes for the perfect holiday getaway for romantic couples and families."}, {"url": "http://www.maldivesfinest.com/location-map", "passage_text": "Maldives Map and Location of Islands. Detailed information and maps show where is Maldives located on world map. Map of Maldives shows local islands, resorts, airports etc. Maldive is chain of 1190 islands located south-west of Sri Lanka and India in the Indian Ocean. The islands are so tiny that many world maps do not show Maldives. It is an independent country of about 350,000 in population. Maldives is a member of the United Nations (UN), South Asian Association for Regional Cooperation (SAARC), Commonwealth and many other international organisations"}, {"url": "http://www.youtube.com/watch?v=euZhFF8ovvw", "passage_text": "Maldives diving is known to be amongst the best in the world. Many divers know where is maldives how to get there. Where is the Maldives located south east of Sri Lanka in the blue waters of the indian Ocean. Everything about the maldives is beautiful, above and below sea level. With its abundant marine life and white sandy beaches, the Maldives is many people's idea of paradise on earth. Book your holiday in the Maldives with best price guarantee at http://www.MaldivesDiveTravel.com. About the Maldives: There is something magical about the islands of the Maldives and if you have been there already we are sure you'll agree."}, {"url": "https://en.wikipedia.org/wiki/Maldives", "passage_text": "The Maldives is a founding member of the South Asian Association for Regional Cooperation (SAARC) and it hosted the 17th SAARC summit in 2011. It is also a member of the Commonwealth of Nations, the Organization of Islamic Cooperation (OIC) and the Non-Aligned Movement. Historically linked with the Indian subcontinent, the Maldives is a Muslim-majority country. From the mid-sixteenth century, it was dominated by colonial powers: Portugal, the Netherlands and Britain. The islands gained independence from the British Empire in 1965, becoming a republic in 1968."}, {"url": "https://en.wikipedia.org/wiki/Maldives", "passage_text": "Maldives is the lowest country in the world, with maximum and average natural ground levels of only 2.4 metres (7 ft 10 in) and 1.5 metres (4 ft 11 in) above sea level, respectively. In areas where construction exists, however, this has been increased to several metres. Historically linked with the Indian subcontinent, the Maldives is a Muslim-majority country. From the mid-sixteenth century, it was dominated by colonial powers: Portugal, the Netherlands and Britain. The islands gained independence from the British Empire in 1965, becoming a republic in 1968."}, {"url": "http://www.mapsofworld.com/maldives/", "passage_text": "The Maldives is located in South Asia, on the Indian Ocean and situated to the south to southwest of India. It is an archipelago of 1,192 coral islands with 26 atolls over an area of 90,000 sq.km., which makes it one of the most dispersed countries in the world. Tourism is the largest industry in the Maldives. People from all over the world are attracted to the archipelago's crystal clear lagoons and powder white sandy beaches-which makes for the perfect holiday getaway for romantic couples and families."}]