[{"url": "http://www.healthcare-salaries.com/therapists/speech-therapist-salary", "passage_text": "According to the BLS, an average hourly wage and yearly salary earned by the lowest 10th percentile of speech therapists is around $21.28 per hour and $44,250 per year respectively whereas those in the 90th percentile of them received up to $51.22 per hour and more than $106,530 per annum. An average yearly salary range for a speech therapist in the US is about $66,920 while an average hourly wage can be around $32.17 per hour. In addition, a speech therapist with good work experience receives a salary range of $90,000 to $111,00"}, {"url": "http://www.healthcareworkersalary.com/physicians/speech-pathologist-salary/", "passage_text": "Speech Pathologist Salary. The median annual speech pathologist salary is $72,000. This comes out to about $34 per hour. Pathologists who are just starting out and those in the lowest 10th percentile should expect a little less, approximately $29 per hour or $60,000 a year. Yet, with more experience, a speech pathologist could enter the pay-grade of those in the top 10th percentile. These professionals make at least $85,000 annually, or $41 every hour. Even the middle 50% of speech pathologists will make a nice income: between $65,000 and $79,000 every year."}, {"url": "http://www.healthcare-salaries.com/therapists/speech-therapist-salary", "passage_text": "On an average, a speech therapist based in Australia receives an average yearly salary ranging from between AU$38,126 – AU$72,719 per year. In fact, well-experienced speech therapist receives a total annual salary ranging from around AU$43,077 – AU$75,503 per annum. The annual bonus can be around AU$ $500 per annum. An average yearly salary range for a speech therapist in the US is about $66,920 while an average hourly wage can be around $32.17 per hour. In addition, a speech therapist with good work experience receives a salary range of $90,000 to $111,0"}, {"url": "http://www.healthcare-salaries.com/therapists/speech-therapist-salary", "passage_text": "According to all salary survey, the average expected and median salary for a speech therapist in the United Kingdom is about £47,333 and £49,000 per year respectively. An average hourly wage for a speech therapist is around £23.67 per hour. An average yearly salary range for a speech therapist in the US is about $66,920 while an average hourly wage can be around $32.17 per hour. In addition, a speech therapist with good work experience receives a salary range of $90,000 to $111,000 per annum"}, {"url": "http://www.healthcare-salaries.com/physicians/speech-pathologist-salary-slp", "passage_text": "Speech pathologist salary and wage in Canada. An average yearly salary for a speech pathologist in Canada ranges from between C$ $75,000 – C$ 85,000 while an hourly wage is about C$ 28 per hour. The average expected salary for a speech pathologist based in United Kingdom is about £47,333 per annum while the median salary for a speech pathologist is about £49,000. An average hourly wage for a speech pathologist is about £23.67. A speech pathologist’s salary varies based on his or her age as the one in 20s earns up to £35,500, in 30s earns about £46,387, in 40s and in 50s earns about £54,907 per annum"}, {"url": "http://www.healthcare-salaries.com/physicians/speech-pathologist-salary-slp", "passage_text": "The speech pathologist’s salary (also known as speech-language pathologist salary or SLP salary) in the United States is about $68,350 per annum while an average hourly wage is about $32.86 per hour according to the current statistical data. The average expected salary for a speech pathologist based in United Kingdom is about £47,333 per annum while the median salary for a speech pathologist is about £49,000. An average hourly wage for a speech pathologist is about £23.67. A speech pathologist’s salary varies based on his or her age as the one in 20s earns up to £35,500, in 30s earns about £46,387, in 40s and in 50s earns about £54,907 per annum"}, {"url": "http://www.livingin-canada.com/salaries-for-audiologists-and-speech-language-pathologists.html", "passage_text": "The 2014 full-time average hourly wage rate for professional occupations in health, which includes audiologists and speech-language pathologists, is $35.35. The 2014 corresponding median weekly wage rate is $1332, giving an approximate full-time annual salary for this employment sector of $69,000. According to the latest figures, the highest hourly average (median) wages are earned in Calgary, Alberta at $49.57 per hour and the lowest average (median) wages are earned in Montreal, Quebec at $31 per hour."}, {"url": "http://www.livingin-canada.com/salaries-for-audiologists-and-speech-language-pathologists.html", "passage_text": "Job titles and exact duties vary in this occupation and examples of some job titles are: audiologist, speech therapist and speech-language pathologist. A typical full-time annual salary for this occupation is in the region of $75,000 – $85,000. According to the latest figures, the highest hourly average (median) wages are earned in Calgary, Alberta at $49.57 per hour and the lowest average (median) wages are earned in Montreal, Quebec at $31 per hour."}]