[{"url": "http://northwestprimetime.com/news/2012/jan/16/understanding-difference-between-arthritis-and-ost/", "passage_text": "With osteoarthritis, joint damage is caused by natural wear and tear over time. With rheumatoid arthritis, the body's own immune system attacks the joints, leading to swelling, pain and the eventual destruction of cartilage at the joint. Unlike wear and tear osteoarthritis, rheumatoid arthritis affects the interior lining of the joints."}, {"url": "http://www.webmd.com/rheumatoid-arthritis/tc/comparing-rheumatoid-arthritis-and-osteoarthritis-topic-overview", "passage_text": "So an accurate diagnosis is important. Osteoarthritis is the most common form of arthritis. Rheumatoid arthritis affects about one-tenth as many people as osteoarthritis. The main difference between osteoarthritis and rheumatoid arthritis is the cause behind the joint symptoms. Osteoarthritis is caused by mechanical wear and tear on joints. Rheumatoid arthritis is an autoimmune disease in which the body's own immune system attacks the body's joints. For more information, see the topics Rheumatoid Arthritis and Osteoarthritis."}, {"url": "http://www.emedicinehealth.com/comparing_rheumatoid_arthritis_and_osteoarthritis-health/article_em.htm", "passage_text": "So an accurate diagnosis is important. Osteoarthritis is the most common form of arthritis. Rheumatoid arthritis affects about one-tenth as many people as osteoarthritis. The main difference between osteoarthritis and rheumatoid arthritis is the cause behind the joint symptoms. Osteoarthritis is caused by mechanical wear and tear on joints. Rheumatoid arthritis is an autoimmune disease in which the body's own immune system attacks the body's joints. "}, {"url": "http://www.answers.com/Q/What_are_the_similarities_and_differences_between_osteoarthritis_rheumatoid_arthritis_and_gout", "passage_text": "Rheumatoid arthritis is an autoimmune disease that is different from say osteoarthritis which is a disease that is the result of wear and tear on the joint's Gout is another type of arthritis where an over abundance of uric acid in the body can cause severe pain to its victims. The first difference is that rheumatoid arthritis is an Autoimmune disease where the immune system attacks the cartilage in joints and surrounding leading to the joint eventua … lly becoming disabled, and deformed it is the inflammation doing the actual damage."}, {"url": "http://www.mayoclinic.org/diseases-conditions/arthritis/multimedia/osteoarthritis-vs-rheumatoid-arthritis/img-20008728", "passage_text": "Osteoarthritis, the most common form of arthritis, involves the wearing away of the cartilage that caps the bones in your joints. With rheumatoid arthritis, the synovial membrane that protects and lubricates joints becomes inflamed, causing pain and swelling. Joint erosion may follow. "}, {"url": "http://www.healthline.com/health/rheumatoid-arthritis/ra-vs-oa", "passage_text": "Arthritis is an umbrella term used to describe pain, stiffness and inflammation of the joints. However, there are different kinds of arthritis, including rheumatoid arthritis (RA) and osteoarthritis (OA). Although RA and OA both affect the joints, they are very different forms of the same broader condition. Rheumatoid arthritis is an autoimmune condition, while osteoarthritis is a degenerative joint disease."}, {"url": "http://www.niams.nih.gov/Health_Info/Bone/Osteoporosis/Conditions_Behaviors/osteoporosis_arthritis.asp", "passage_text": "Arthritis. Arthritis is a general term for conditions that affect the joints and surrounding tissues. Joints are places in the body where bones come together, such as the knees, wrists, fingers, toes, and hips. The two most common types of arthritis are osteoarthritis and rheumatoid arthritis. 1  Osteoarthritis (OA) is a painful, degenerative joint disease that often involves the hips, knees, neck, lower back, or small joints of the hands. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/rheumatoid-arthritis/in-depth/difference-between-rheumatoid-arthritis-and-osteoarthritis/art-20091920", "passage_text": "The most common type of arthritis, osteoarthritis involves wear-and-tear damage to the cartilage that caps the bones in your joints. Rheumatoid arthritis occurs when your immune system mistakenly attacks the lining of your joints, causing a painful swelling that can eventually result in joint deformity. While both rheumatoid arthritis and osteoarthritis can affect the small joints of the hand, there are differences. Rheumatoid arthritis tends to affect the middle joints of the fingers and the joints where the fingers attach to the hand. Osteoarthritis more commonly affects the joints at the ends of the fingers and at the base of the thumb. In rheumatoid arthritis, the same joints usually are affected on both sides of the body. This symmetry doesn't typically occur in osteoarthritis, so it's common for only one hand or knee to be painful."}, {"url": "http://www.healthline.com/health/rheumatoid-arthritis/ra-vs-oa", "passage_text": "The fluid buildup causes pain, stiffness, tenderness and inflammation—symptoms of RA. Osteoarthritis, the most common form of arthritis, is a degenerative joint disease. People with OA experience a breakdown of the cartilage that cushions the joints. However, there are different kinds of arthritis, including rheumatoid arthritis (RA) and osteoarthritis (OA). Although RA and OA both affect the joints, they are very different forms of the same broader condition. Rheumatoid arthritis is an autoimmune condition, while osteoarthritis"}]