[{"url": "http://www.cfre.org/", "passage_text": "For Donors. Certified Fund Raising Executives pledge to uphold the Donor Bill of Rights and the International Statement of Ethical Principles in Fundraising. Since 2001, CFRE International has existed as an independent nonprofit organisation. We are dedicated to setting standards in philanthropy through a valid and reliable certification process for philanthropic fundraising professionals."}, {"url": "http://www.afpnet.org/Professional/ProgramDetail.cfm?itemnumber=4056", "passage_text": "The Certified Fund Raising Executive (CFRE) credential provides you with a recognizable demonstration of your personal and professional achievement and commitment. The CFRE Program is governed by the CFRE International. The Program and the Board is administered in cooperation with leading philanthropic associations: The Certified Fund Raising Executive (CFRE) credential demonstrates an individual's mastery of the standards set for core knowledge and skills required of fundraising executives after five years of experience."}, {"url": "https://www.afpbroward.org/CFRE", "passage_text": "CFRE CFRE stands for Certified Fund Raising Executive. The CFRE certification process consists of three parts: a written application, a written examination; and agreement to uphold a code of ethics and Accountability Standards. There is a requirement to recertify every three (3) years. Top 10 Reasons to Become CFRE-Certified Certification grants you more credibility."}, {"url": "https://www.linkedin.com/pulse/cfre-question-rory-green", "passage_text": "The CFRE (Certified Fund Raising Executive) is a professional certification for fundraisers, which is quite well known in North America. To qualify to write the CFRE exam – professional fundraisers must have a minimum of five years’ experience (among other requirements). My main problem with the designation is that the CFRE isn’t an inclusive and accessible designation for a number of reasons. It largely legitimizes people who I would classify as belonging to advantaged groups, reinforcing dominant culture power dynamics that exist in our sector."}, {"url": "http://101fundraising.org/2014/08/cfre-cfre-question/", "passage_text": "The CFRE (Certified Fund Raising Executive) is a professional certification for fundraisers, which is quite well known in North America. To qualify to write the CFRE exam – professional fundraisers must have a minimum of five years’ experience (among other requirements). 2) The CFRE process and designation – this is not run by AFP. Yes, in “the olden days” it (basically) was; now AFP is one of many participating organizations that support this credential (but granted it’s one of the largest)."}, {"url": "http://www.afpnet.org/Professional/ProgramDetail.cfm?itemnumber=4056", "passage_text": "Certification process. The Certified Fund Raising Executive (CFRE) credential demonstrates an individual's mastery of the standards set for core knowledge and skills required of fundraising executives after five years of experience."}, {"url": "http://afptoronto.org/resources/cfreacfre-designation/", "passage_text": "The Certified Fund Raising Executive (CFRE) credential provides you with a recognizable demonstration of your personal and professional achievement and commitment. About the Advanced Certified Fundraising Executive (ACFRE) Program. "}, {"url": "http://www.afpgv.org/cfre", "passage_text": "The designation “Certified Fund Raising Executive” (CFRE) is a mark of distinction, providing heightened professional recognition plus greater career options and earning potential for fundraising professionals. Many AFPGV programs offer CFRE Continuing Education Credit. The CFRE Professional Certification Program offers fundraising professionals with 5 or more years of experience an opportunity to earn recognition for their experience and professionalism."}, {"url": "http://www.cityvision.edu/cfre-certified-fund-raising-executive-certificate", "passage_text": "Certified Fund Raising Executive (CFRE) certification is the primary credential for career fundraisers. City Vision University is a approved CFRE training provider. CFRE certification provides more credibility. CFRE certification can give you the edge when being considered for a promotion or other career opportunities. CFRE certification clearly identifies you as an employee who has demonstrated mastery of fundraising principles and techniques based on accepted best practices."}]