[{"url": "http://www.everydayhealth.com/drugs/prozac", "passage_text": "A: Prozac (fluoxetine) is a selective serotonin reuptake inhibitor (SSRI) approved for the treatment of major depression (including pediatric depression), obsessive-compulsive disorder (in both adult and pediatric populations), bulimia nervosa, panic disorder and premenstrual dysphoric disorder. A: Prozac (fluoxetine) is a selective serotonin reuptake inhibitor (SSRI) antidepressant used to treat major depressive disorder, eating disorders, obsessive-compulsive disorder, premenstrual dysphoric disorder, and panic disorder. Many patients have been on Prozac for many years without adverse effects."}, {"url": "http://www.everydayhealth.com/drugs/prozac", "passage_text": "A: The recommended Prozac (fluoxetine) dosage depends upon the indication for treatment. Prozac is a selective serotonin reuptake inhibitor (SSRI) antidepressant indicated for major depressive disorder, obsessive-compulsive disorder, bulimia and panic disorder, with or without agoraphobia. A: Prozac (fluoxetine) is a selective serotonin reuptake inhibitor (SSRI) antidepressant used to treat major depressive disorder, eating disorders, obsessive-compulsive disorder, premenstrual dysphoric disorder, and panic disorder. Many patients have been on Prozac for many years without adverse effects."}, {"url": "http://depression.emedtv.com/prozac/prozac-dosage.html", "passage_text": "Dosage of Prozac for Depression or Obsessive-Compulsive Disorder. The recommended starting Prozac dose for people with depression or obsessive-compulsive disorder (OCD) is 20 mg once daily. Your healthcare provider may choose to increase the amount if symptoms continue or decrease the dose if side effects occur. The maximum dose for these conditions is 80 mg per day. Amounts above 20 mg can be taken once a day or divided into two doses and taken twice a day. Prozac Weekly, the long-acting form approved for depression, can be used to replace daily doses of 20 mg."}, {"url": "http://anxiety.emedtv.com/fluoxetine/fluoxetine-dosing.html", "passage_text": "Your healthcare provider may choose to increase the fluoxetine dosage if symptoms continue or decrease the dose if side effects occur. The maximum dose of fluoxetine for these conditions is 80 mg per day. Doses above 20 mg can be taken once a day or divided into two doses and taken twice a day. Prozac Weekly, the long-acting form of fluoxetine approved for depression, can be used to replace daily doses of fluoxetine 20 mg. Because all fluoxetine stays in your system for so long, the first dose of Prozac Weekly should be taken one week after stopping fluoxetine 20 mg daily. As you might guess, Prozac Weekly is taken once per week (on the same day each week)."}, {"url": "http://www.everydayhealth.com/drugs/prozac", "passage_text": "Prozac is the brand name of fluoxetine, a prescription drug used to treat depression. This antidepressant is in a class of drugs known as selective serotonin reuptake inhibitors, or SSRIs. These medications work by increasing the amount of serotonin in the brain. A: Prozac (fluoxetine) is a selective serotonin reuptake inhibitor (SSRI) antidepressant used to treat major depressive disorder, eating disorders, obsessive-compulsive disorder, premenstrual dysphoric disorder, and panic disorder. Many patients have been on Prozac for many years without adverse effects."}, {"url": "http://depression.emedtv.com/prozac/prozac-dosage-p2.html", "passage_text": "For these uses, the starting dosage of Prozac is 20 mg daily, in combination with Zyprexa 5 mg daily. Your healthcare provider may adjust your dosage of each medication as necessary. The starting Prozac dose for children and teens is usually 10 mg or 20 mg once daily. Dosages for Children and Teens. The starting Prozac dose for children and teens is usually 10 mg or 20 mg once daily. Your child's healthcare provider will take into consideration your child's age, weight, and medical conditions when prescribing an amount for your child."}, {"url": "http://www.rxlist.com/prozac-drug/indications-dosage.htm", "passage_text": "PROZAC® is indicated for the treatment of: 1  Acute and maintenance treatment of Major Depressive Disorder [see Clinical Studies 2  ]. Acute and maintenance treatment of obsessions and compulsions in patients with Obsessive Compulsive Disorder (OCD) [see Clinical Studies ]. PROZAC monotherapy is not indicated for the treatment of treatment resistant depression (Major Depressive Disorder in patients who do not respond to 2 antidepressants of adequate dose and duration in the current episode)."}, {"url": "http://www.rxlist.com/prozac-drug/indications-dosage.htm", "passage_text": "Adult — Initiate PROZAC 20 mg/day orally in the morning. Consider a dose increase after several weeks if insufficient clinical improvement is observed. Administer doses above 20 mg/day once daily in the morning or twice daily (i.e., morning and noon).The maximum fluoxetine dose should not exceed 80 mg/day. PROZAC monotherapy is not indicated for the treatment of treatment resistant depression (Major Depressive Disorder in patients who do not respond to 2 antidepressants of adequate dose and duration in the current episode)."}, {"url": "http://depression.emedtv.com/prozac/prozac-dosage-p2.html", "passage_text": "The recommended starting dosage of Prozac for people with panic disorder is 10 mg once daily. After one week, your healthcare provider may increase the amount to 20 mg once daily. Your healthcare provider may choose to increase this if symptoms continue or decrease it if side effects occur. Dosages for Children and Teens. The starting Prozac dose for children and teens is usually 10 mg or 20 mg once daily. Your child's healthcare provider will take into consideration your child's age, weight, and medical conditions when prescribing an amount for your child."}, {"url": "http://www.everydayhealth.com/drugs/prozac", "passage_text": "A: Prozac (fluoxetine) is a selective serotonin reuptake inhibitor (SSRI) antidepressant. Prozac is FDA approved for use in major depressive disorder, bulimia nervosa, obsessive compulsive disorder, premenstrual dysphoric disorder, panic disorder and bipolar disorder. A: Prozac (fluoxetine) is a selective serotonin reuptake inhibitor (SSRI) antidepressant used to treat major depressive disorder, eating disorders, obsessive-compulsive disorder, premenstrual dysphoric disorder, and panic disorder. Many patients have been on Prozac for many years without adverse effects."}]