[{"url": "http://www.medscape.com/features/slideshow/compensation/2013/familymedicine", "passage_text": "Family physicians' compensation varies somewhat by region. Doctors in the North Central region, with the highest compensation (a mean of $186,000 in 2012), earn 15% more than their colleagues in the Northwest, with the lowest compensation (a mean of $162,000 in 2012). In 2012, 23% of family physicians worked less than 30 hours a week; 16% worked 41-45 hours, 10% worked 46-50 hours, and 11% worked 51 or more hours. Those percentages are about the same as those we reported for 2011."}, {"url": "http://www.ehow.com/info_7792442_much-do-family-physicians-make.html", "passage_text": "Several states had average pay of over $190,000 per year for family physicians. Arkansas topped the list in 2009 with annual earnings of $206,030 for 930 physicians. Wisconsin came second with $203,040 for 2,630 physicians in family practice. Both Wyoming and Utah paid average salaries of over $190,000 per year as well. Family practice physicians treat patients of all ages, often keeping patients for many years or seeing several generations of the same family. In 2007, they made up over 12 percent of physicians in active practice in the United states, second only to specialists in internal medicine."}, {"url": "http://www.healthcare-salaries.com/physicians/family-physician-salary", "passage_text": "How much does a Family physician make in Mexico. In Mexico, family physicians or general doctors take home a salary ranging from MXN139,620 to MXN623,404. This is the total salary that includes the base salary and the bonuses that ranges from MXN620 to MXN40,000. An average salary for a family physician based in Canada ranges from between 56,526 CAD – 137,027 CAD per annum while an average hourly wage ranges from between 32 CAD -78 CAD per hour."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-does-a-doctor-make/", "passage_text": "According to the Bureau of Labor Statistics, family and general practitioners earn a mean annual salary of $180,850, or a mean hourly wage of $86.95. General practitioners that find employment within medical diagnostic laboratories tend to make the most, with an annual salary of $238,270. Pediatricians, who specialize in providing treatment and care to children, earn an average salary of $167,640 each year, which equals a mean hourly wage of $80.59."}, {"url": "http://www.healthcare-salaries.com/physicians/family-physician-salary", "passage_text": "Family Physician salary in USA. The total highest salary for a family physician is about $226,950 per annum while the lowest annual salary is about $85,000. The upper 10 percent of the family physicians earn more than $166,400 per year while the lowest 10 percent of them receive about $82,630 per year. According to percentiles, the median salary for 90th percentile of family physicians has been around $224,255 yearly. An average salary for a family physician based in Canada ranges from between 56,526 CAD – 137,027 CAD per annum while an average hourly wage ranges from between 32 CAD -78 CAD per hour."}, {"url": "http://www.ehow.com/info_7792442_much-do-family-physicians-make.html", "passage_text": "General internists, the largest specialty of physicians and surgeons, earned an average of $183,990 per year in 2009, $15,440 more than the $168,550 annual income of family practitioners. Pediatricians earned $161,410 annually, or $7,140 less than family practice physicians. Family practice physicians treat patients of all ages, often keeping patients for many years or seeing several generations of the same family. In 2007, they made up over 12 percent of physicians in active practice in the United states, second only to specialists in internal medicine."}, {"url": "http://www.healthcare-salaries.com/physicians/family-physician-salary", "passage_text": "A median salary for a family physician averages to about 107,087 CAD per annum while a median wage is about 36.45 CAD per hour. A highest paid family physician receives over 137,000 CAD while the lowest paid family physician earns about 59,000 CAD per annum. An average salary for a family physician based in Canada ranges from between 56,526 CAD – 137,027 CAD per annum while an average hourly wage ranges from between 32 CAD -78 CAD per hour."}, {"url": "http://www.ehow.com/info_7792442_much-do-family-physicians-make.html", "passage_text": "Average Hourly and Annual Wage. The average hourly wage for family and general practitioners was $81.03 in 2009, according to the Bureau of Labor Statistics. This comes to $168,550 annually for 40 hours a week all year long. Some doctors work longer hours, however. Family practice physicians treat patients of all ages, often keeping patients for many years or seeing several generations of the same family. In 2007, they made up over 12 percent of physicians in active practice in the United states, second only to specialists in internal medicine."}]