[{"url": "http://medical-dictionary.thefreedictionary.com/Anaerobic+metabolism", "passage_text": "a series of enzymatically catalyzed reactions by which glucose and other sugars are broken down to yield lactic acid (anaerobic glycolysis) or pyruvic acid (aerobic glycolysis) . The breakdown releases energy in the form of adenosine triphosphate. Also called Embden-Meyerhof pathway."}, {"url": "http://walking.about.com/cs/fitnesswalking/g/anaerobicmet.htm", "passage_text": "Definition: Anaerobic metabolism is the creation of energy through the combustion of carbohydrates in the absence of oxygen. This occurs when the lungs cannot put enough oxygen into the bloodstream to keep up with the demands from the muscles energy. It generally is used only for short bursts of activity."}, {"url": "http://cmgm.stanford.edu/biochem200/am_syl.html", "passage_text": "Aerobic (oxygen-using) metabolism extracts energy from carbohydrate sources, fatty acids and amino acids. While glycolysis yields two moles of ATP from one mole of glucose, full oxidation of glucose by aerobic respiration produces ~30 moles of ATP. Aerobic metabolism occurs in three phases."}, {"url": "http://www.thefreedictionary.com/Aerobic+metabolism", "passage_text": "Noun. 1. glycolysis-a metabolic process that breaks down carbohydrates and sugars through a series of reactions to either pyruvic acid or lactic acid and releases energy for the body in the form of ATP. metabolic process, metabolism-the organic processes (in a cell or organism) that are necessary for life. Translations."}, {"url": "http://walking.about.com/cs/fitnesswalking/g/aerobicmet.htm", "passage_text": "Definition: Aerobic metabolism is the creation of energy through the combustion of carbohydrates and fats in the presence of oxygen. The only byproducts are carbon dioxide and water, which your body disposes of by breathing and sweating. Walkers want to use aerobic metabolism for walking energy because it results in less muscle soreness afterward and it makes the body dip into its stored sugar and fat to burn."}, {"url": "http://healthyliving.azcentral.com/aerobic-anaerobic-metabolism-14829.html", "passage_text": "When one glucose molecule is converted into lactic acid in anaerobic metabolism, three ATP molecules are generated. When a glucose molecule is converted into carbon dioxide and water via aerobic metabolism, it produces 39 molecules of ATP. However, glycolysis requires powerful enzymes that compensate for the lower energy efficiency of anaerobic metabolism. What limits the anaerobic process is the byproduct, or lactic acid."}]