[{"url": "http://www.food.com/recipe/sesame-shirataki-noodles-349261", "passage_text": "1 Spray with cooking spray. 2  Whisk together peanut butter, soy, red pepper flakes and sesame oil. 3  Set aside. 4  Add squash slices to skillet and saute until tender. 5  Add drained shirataki noodles, continue to saute until noodles are hot. 6  Reduce heat and pour peanut butter mixture over noodles and squash."}, {"url": "http://www.nasoya.com/recipes/shirataki-noodles", "passage_text": "Drain and rinse noodles. Cut noodles in half. In a pot, add the broth and veggies and bring to a boil. Reduce to medium and cook for 7 minutes, or until veggies are... more. Rating: 2.666665. Product: Shirataki Fettuccine. Shirataki Pasta Primavera. Drain and rinse noodles; set noodles aside."}, {"url": "http://www.food.com/recipe/sesame-shirataki-noodles-349261", "passage_text": "1 Whisk together peanut butter, soy, red pepper flakes and sesame oil. 2  Set aside. 3  Add squash slices to skillet and saute until tender. 4  Add drained shirataki noodles, continue to saute until noodles are hot. 5  Reduce heat and pour peanut butter mixture over noodles and squash. 6  Cook briefly until sauce is hot and bubbly."}, {"url": "http://www.justapinch.com/recipes/main-course/chicken/shirataki-noodles-with-chicken.html", "passage_text": "Melt butter with olive oil, in a large skillet, and heat on medium heat, then add chopped vegetables, and saute till transparent. 1. Add sliced chicken breast, and shirataki noodles, and stir to heat through about 4 to 5 minutes, add lemon pepper, garlic powder,& salt and stir to mix."}, {"url": "http://www.food.com/recipe/sesame-shirataki-noodles-349261", "passage_text": "1 Add drained shirataki noodles, continue to saute until noodles are hot. 2  Reduce heat and pour peanut butter mixture over noodles and squash. 3  Cook briefly until sauce is hot and bubbly. 4  Transfer to serving bowl and top with toasted sesame seeds and green onions."}, {"url": "http://www.nasoya.com/recipes/shirataki-noodles", "passage_text": "Drain and rinse pasta with cold water, set aside. Heat olive oil in a saute sauté plan over medium high. Heat add garlic and onions and cook until. translucent"}, {"url": "http://www.vegetariantimes.com/recipe/spicy-shirataki-noodles/", "passage_text": "1. Whisk together tamari, lime juice, brown sugar, and sriracha in bowl. Set aside. 2. Heat oil in wok over medium-high heat. Add jalapeno jalapeño and, garlic and cook 1. Minute add onion and bell, peppers and-stir fry 5. Minutes add tamari mixture and, shirataki and simmer 3 to 5, minutes then toss with. basil"}, {"url": "http://www.nasoya.com/recipes/shirataki-noodles", "passage_text": "Drain and rinse pasta with cold water, set aside. Heat olive oil in a saute sauté plan over medium high. Heat add garlic and onions and cook until. Translucent... add"}]