[{"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/F/Fungi.html", "passage_text": "1 Some fungi are both. 2  Metarhizium robertsii is a soil fungus that lives symbiotically with plants but parasitizes (and kills) soil insects. 3  Its hyphae penetrate both the roots of the plant and the corpse of the insect."}, {"url": "http://website.nbm-mnb.ca/mycologywebpages/NaturalHistoryOfFungi/Mycorrhizae.html", "passage_text": "Reproduction of the fungi forming arbuscular mycorrhizae is by thick-walled spores produced on the extra-radicular hyphae. These are thick-walled and often remain in the soil for long periods. Many are quite large and can be recovered by sieving the soil."}, {"url": "http://www.biologyreference.com/Mo-Nu/Mycorrhizae.html", "passage_text": "Photo by: Jubal Harshaw. Symbioses are intimate associations between two unrelated organisms. Mycorrhizae are very common but largely unseen symbioses between plant roots and fungi that are important in plant nutrition, community structure, and nutrient cycling."}, {"url": "http://website.nbm-mnb.ca/mycologywebpages/NaturalHistoryOfFungi/Mycorrhizae.html", "passage_text": "The fungi able to form arbuscular mycorrhizae are relatively few in number and all are members of their own phylum, the Glomeromycota. Although the root system of a plant might support several species of these fungi the diversity is never great."}, {"url": "http://microbewiki.kenyon.edu/index.php/Basidiomycota", "passage_text": "Basidiomycota is a classification that describes a wide variety of organisms. It is estimated that there are about 30,000 species, and more species are being discovered all the time. For example, the work of Geml et. al (2005) and Bergauer et al. (2005) has led to the discovery of several new species."}, {"url": "http://website.nbm-mnb.ca/mycologywebpages/NaturalHistoryOfFungi/Mycorrhizae.html", "passage_text": "Mycorrhizae (singular: mycorrhiza) are mutualisms formed between fungi and plant roots."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookDiversity_4.html", "passage_text": "Mycorrhizae are fungi (usually a zygomycete or basidiomycete) symbiotic with the roots of plants. Both relationships are mutualistic: both parties benefit. Fungi provide nutrients from the substrate, the phototroph provides food."}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/F/Fungi.html", "passage_text": "1 Some live in a mutually beneficial symbiotic relationship with another organism, often a plant. 2  The association of fungus and plant root is called a mycorrhiza. 3  Some 80% of land plants benefit from symbiotic mycorrhiza. 4  The plant benefits by more-efficient mineral (especially phosphorus) uptake."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookDiversity_4.html", "passage_text": "Some ascomycetes are (along with basiodiomycetes) the symbiotic mycorrhizae fungi that are important to plant root function. Plants with mycorrhizae grow better: the plant gets nutrients from the fungus in exchange for carbohydrates."}]