[{"url": "http://www.webmd.com/a-to-z-guides/anterior-cruciate-ligament-acl-injuries-topic-overview", "passage_text": "Topic Overview. An anterior cruciate ligament, or ACL, injury is a tear in one of the knee ligaments that joins the upper leg bone with the lower leg bone. The ACL keeps the knee stable. Injuries range from mild, such as a small tear, to severe, such as when the ligament tears completely or when the ligament and part of the bone separate from the rest of the bone. Without treatment, the injured ACL is less able to control knee movement, and the bones are more likely to rub against each other."}, {"url": "http://www.webmd.com/a-to-z-guides/anterior-cruciate-ligament-acl-surgery", "passage_text": "Surgery for anterior cruciate ligament (ACL) injuries involves reconstructing or repairing the ACL. 1  ACL reconstruction surgery uses a graft to replace the ligament. 2  Repair surgery typically is used only in the case of an avulsion fracture (a separation of the ligament and a piece of the bone from the rest of the bone). Surgery for anterior cruciate ligament (ACL) injuries involves reconstructing or repairing the ACL. 1  ACL reconstruction surgery uses a graft to replace the ligament. 2  The most common grafts are autografts using part of your own body, such as the tendon of the kneecap (patellar tendon) or one of the hamstring tendons."}, {"url": "https://msdn.microsoft.com/en-us/library/windows/desktop/aa374872(v=vs.85).aspx", "passage_text": "Access Control Lists. An access control list (ACL) is a list of access control entries (ACE). Each ACE in an ACL identifies a trustee and specifies the access rights allowed, denied, or audited for that trustee. The security descriptor for a securable object can contain two types of ACLs: a DACL and a SACL. "}, {"url": "https://en.wikipedia.org/wiki/Anterior_cruciate_ligament", "passage_text": "The anterior cruciate ligament (ACL) is one of a pair of cruciate ligaments (the other being the posterior cruciate ligament) in the human knee. They are also called cruciform ligaments as they are arranged in a crossed formation. Rehabilitation is crucial to any ACL surgery. ACL surgery typically takes 6 to 9 months for complete recovery and return to sports or such activity. Revision ACL surgery will often take 9 months to more than a year. During this time, the doctor should guide the patient through the rehabilitation process."}, {"url": "https://en.wikipedia.org/wiki/Anterior_cruciate_ligament", "passage_text": "The anterior cruciate ligament is one of the four main ligaments of the knee, and the ACL provides 85% of the restraining force to anterior tibial displacement at 30 degrees and 90 degrees of knee flexion. Rehabilitation is crucial to any ACL surgery. ACL surgery typically takes 6 to 9 months for complete recovery and return to sports or such activity. Revision ACL surgery will often take 9 months to more than a year. During this time, the doctor should guide the patient through the rehabilitation process."}, {"url": "http://www.webmd.com/a-to-z-guides/anterior-cruciate-ligament-acl-injuries-topic-overview", "passage_text": "Sometimes other knee ligaments or parts of the knee are also injured. This includes cartilage such as the menisci, or bones in the knee joint, which can be broken. Your ACL can be injured if your knee joint is bent backward, twisted, or bent side to side. The chance of injury is higher if more than one of these movements occurs at the same time. Contact (being hit by another person or object) also can cause an ACL injury. An ACL injury often occurs during sports. Injuries range from mild, such as a small tear, to severe, such as when the ligament tears completely or when the ligament and part of the bone separate from the rest of the bone. Without treatment, the injured ACL is less able to control knee movement, and the bones are more likely to rub against each other."}, {"url": "https://azure.microsoft.com/en-us/documentation/articles/virtual-networks-acl/", "passage_text": "An endpoint Access Control List (ACL) is a security enhancement available for your Azure deployment. An ACL provides the ability to selectively permit or deny traffic for a virtual machine endpoint. This packet filtering capability provides an additional layer of security. An ACL is an object that contains a list of rules. When you create an ACL and apply it to a virtual machine endpoint, packet filtering takes place on the host node of your VM. This means the traffic from remote IP addresses is filtered by the host node for matching ACL rules instead of on your VM."}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00549", "passage_text": "One of the most common knee injuries is an anterior cruciate ligament sprain or tear. Athletes who participate in high demand sports like soccer, football, and basketball are more likely to injure their anterior cruciate ligaments. Top of page. Description. About half of all injuries to the anterior cruciate ligament occur along with damage to other structures in the knee, such as articular cartilage, meniscus, or other ligaments. Injured ligaments are considered sprains and are graded on a severity scale."}, {"url": "https://en.wikipedia.org/wiki/Access_control_list", "passage_text": "An access control list (ACL), with respect to a computer file system, is a list of permissions attached to an object. An ACL specifies which users or system processes are granted access to objects, as well as what operations are allowed on given objects. Each entry in a typical ACL specifies a subject and an operation. In the 1990s the ACL and RBAC models were extensively tested and used to administrate file permissions. A filesystem ACL is a data structure (usually a table) containing entries that specify individual user or group rights to specific system objects such as programs, processes, or files."}, {"url": "http://searchsoftwarequality.techtarget.com/definition/access-control-list", "passage_text": "HP UFT (QTP). vs. Parasoft SOAtest. An access control list (ACL) is a table that tells a computer operating system which access rights each user has to a particular system object, such as a file directory or individual file. Each object has a security attribute that identifies its access control list."}]