[{"url": "http://www.hxbenefit.com/genu-varum.html", "passage_text": "Genu Varum (GVR) is a knee disorder which may lead to outward bowing of the legs while standing, giving them the appearance of a bow. Find out all about the condition, including its symptoms, treatment and life expectancy. Genu Varum is a common knee disorder causing physical deformity. Get in touch with your doctor for a diagnosis, if you experience the signs and symptoms of GVR. Parents of sufferers are highly recommended not to neglect the disorder and avail early treatment in order to avoid the occurrence of associated complications."}, {"url": "https://en.wikipedia.org/wiki/Genu_varum", "passage_text": "Bow-leg redirects here. For the robotic leg, see Bow Leg. Genu Varum (also called bow-leggedness, bandiness, bandy-leg, and tibia vara), is a physical deformity marked by (outward) bowing of the lower leg in relation to the thigh, giving the appearance of an archer's bow. Usually medial angulation of both femur and tibia is involved. Children until the age of 3 to 4 have a degree of Genu Varum. The child sits with the soles of the feet facing one another; the tibia and femur are curved outwards; and, if the limbs are extended, although the ankles are in contact, there is a distinct space between the knee-joints."}, {"url": "http://www.physiotherapy-treatment.com/genu-varum.html", "passage_text": "Genu Varum. Genu Varum is also known as Bow Leg. It is a deformity wherein there is lateral bowing of the legs at the knee. This is usually due to defective growth of the medial side of the epiphyseal plate"}, {"url": "http://orthoseek.com/articles/bowlegs-kk.html", "passage_text": "Bowleg (or genu varum) is a condition where the legs are bowed outwards in the standing position. The bowing usually occurs at or around the knee, so that on standing with the feet together, the knees are far apart. "}, {"url": "http://medical-dictionary.thefreedictionary.com/genu+varum", "passage_text": "genu varum. Etymology: L, knee, varus, bent outward. a deformity in which one or both legs are bent outward at the knee. Also called bowleg. Compare genu valgum. "}, {"url": "https://en.wikipedia.org/wiki/Genu_valgum", "passage_text": "(February 2010). Genu valgum, commonly called  knock-knee , is a condition in which the knees angle in and touch one another when the legs are straightened. Individuals with severe valgus deformities are typically unable to touch their feet together while simultaneously straightening the legs. Mild genu valgum is diagnosed when a person standing upright with the feet touching also shows the knees touching."}, {"url": "https://www.cedars-sinai.edu/Patients/Health-Conditions/Bow-legged-Genu-Varum.aspx", "passage_text": "Causes and Risk Factors. The most common cause of genu varum is rickets or any condition that prevents bones from forming properly. Skeletal problems, infection and tumors can affect the growth of the leg, which can cause one leg to be bowed. "}]