[{"url": "http://www.webmd.com/oral-health/guide/salivary-gland-problems-infections-swelling", "passage_text": "If not treated, salivary gland infections can cause severe pain, high fevers, and abscess (pus collection). Infections. Viral infections such as mumps, flu, and others can cause swelling of the salivary glands. Swelling happens in parotid glands on both sides of the face, giving the appearance of chipmunk cheeks.. Salivary gland swelling is commonly associated with mumps, happening in about 30% to 40% of mumps infections. It usually begins approximately 48 hours after the start of other symptoms such as fever and headache. The following are some of the more common salivary gland problems : Salivary stones, or sialoliths. The most common cause of swollen salivary glands, salivary stones are buildups of crystallized saliva deposits. Sometimes salivary stones can block the flow of saliva. When saliva can't exit through the ducts, it backs up into the gland, causing pain and swelling"}, {"url": "http://www.healthguideinfo.com/ear-nose-throat/p101074/", "passage_text": "Mumps is the most common reason for infection of the parotid glands. The condition is most common in children, although adults can also get this infection. Salivary duct stones can cause obstruction to the flow of the saliva. In such cases, the saliva is produced but obstruction prevents it from exiting, causing facial inflammation, pain, and infection in the parotid glands. Infection in the nearby lymph nodes (glands located in the upper neck) can spread to the salivary glands. During an infection, these lymph nodes get enlarged and may cause a red and painful swelling in the parotid glands"}, {"url": "http://www.healthline.com/health/salivary-gland-infections", "passage_text": "A salivary gland infection occurs when a bacterial or viral infection affects the salivary gland or duct. The infection can result from reduced saliva flow or the blockage or inflammation of a salivary duct. The condition is called sialadenitis. Your mouth is almost constantly flushed with saliva. This is often caused by the blockage or inflammation of the salivary gland duct. Viruses and other medical conditions can also reduce saliva production, including: 1  mumps (a contagious viral infection that is most common among children who have not been immunized). 2  HIV."}, {"url": "https://www.cedars-sinai.edu/Patients/Health-Conditions/Salivary-Gland-Disease-and-Tumors.aspx", "passage_text": "Sjoegren'sjögren s syndrome causes decreased moisture in. Glands dry, mouth tooth, decay mouth, sores enlarged salivary, glands, sialoliths and recurrent salivary gland infections are possible. Symptoms the syndrome also effects moisture in the, eyes which might cause chronic eye, infections corneal ulcers and vision. loss The three major salivary glands are the parotid gland, submandibular gland (also called the submaxillary gland), and sublingual glands. Saliva drains into the mouth through small tubes called ducts. 1  The parotid gland makes 25% of the saliva and drains into the mouth near the upper teeth."}, {"url": "http://www.healthline.com/health/salivary-gland-infections", "passage_text": "A salivary gland infection typically results from a bacterial infection. Staphylococcus aureus is the most common. Others include: Streptococcus viridans, Haemophilus influenzae, Streptococcus pyogenes, and Escherichia coli. This is often caused by the blockage or inflammation of the salivary gland duct. Viruses and other medical conditions can also reduce saliva production, including: 1  mumps (a contagious viral infection that is most common among children who have not been immunized). 2  HIV."}, {"url": "https://www.cedars-sinai.edu/Patients/Health-Conditions/Salivary-Gland-Disease-and-Tumors.aspx", "passage_text": "Dry mouth, tooth decay, mouth sores, enlarged salivary glands, sialoliths, and recurrent salivary gland infections are possible symptoms. The syndrome also effects moisture in the eyes, which might cause chronic eye infections, corneal ulcers and vision loss. The three major salivary glands are the parotid gland, submandibular gland (also called the submaxillary gland), and sublingual glands. Saliva drains into the mouth through small tubes called ducts. 1  The parotid gland makes 25% of the saliva and drains into the mouth near the upper teeth."}, {"url": "http://www.healthline.com/health/salivary-gland-infections", "passage_text": "Treatment of Salivary Gland Infection. Treatment will depend on the severity of the infection, the underlying cause, and any additional symptoms you may have, such as swelling or pain. Antibiotics may be used to treat a bacterial infection, pus, or fever. A fine needle aspiration may be used to drain an abscess. This is often caused by the blockage or inflammation of the salivary gland duct. Viruses and other medical conditions can also reduce saliva production, including: 1  mumps (a contagious viral infection that is most common among children who have not been immunized). 2  HIV."}, {"url": "http://www.nytimes.com/health/guides/disease/salivary-gland-infections/overview.html", "passage_text": "Salivary gland infections affect the glands that produce saliva (spit). The infection may be due to bacteria or viruses. There are three pairs of major salivary glands: 1  Parotid glands. 2  These are the two largest glands. "}]