[{"url": "http://www.slackpacker.com/igneous.html", "passage_text": "Igneous landforms can usually be placed in one of two camps: Intrusive and Extrusive. Intrusive forms result from magma solidifying beneath the earth's crust, then later exposed by earthquake, erosion, glacial activity, etc. This page describes igneous landforms. These are any forms volcanic in origin, or from other magma or lava flow phenomenon. If you wish to return to the main geology page, please click here."}, {"url": "http://www.geocases2.co.uk/printable/rocks.htm", "passage_text": "When magma erupts from a volcano at the earth’s surface, it is referred to as lava. Igneous rocks are divided into intrusive rocks (or plutonic rocks), which form underground when magma cools beneath the surface, and extrusive rocks (or volcanic rocks), which form at the earth’s surface from lava flows. "}, {"url": "http://www.answers.com/Q/What_are_extrusive_landforms", "passage_text": "extrusive landforms are volcanic masses that appear above the earths surface. In short they are landforms formed by volcanic activities outside the earth's crust. Eg: Lava Planes and Basalt Plateaux such as snake basin,USA and the Deccan Plateau in India. Extrusive igneous rock is one of two different types of igneous rocks. The other kind is intrusive igneous rock. Intrusive igneous rock is formed when magma in Earth's lithosp … here cools and hardens. Extrusive igneous rock is formed when lava on Earth's surfac"}, {"url": "https://en.wikibooks.org/wiki/High_School_Earth_Science/Volcanic_Landforms_and_Geothermal_Activity", "passage_text": "Describing a volcanic rock that cooled at the earth's surface. Extrusive rocks have small crystals, and may contain air bubbles. lava dome. A dome-shaped plug of viscous lava that cools near the vent of a volcano. intrusion. A rock mass formed by magma solidifying underground. "}, {"url": "http://www.coolgeography.co.uk/A-level/AQA/Year%2013/Plate%20Tectonics/Volcanoes/Extrusive%20landforms%20-%20Major.htm", "passage_text": "Major forms of extrusive activity types of volcanoes and Intrusions. Landforms and Features of volcanic activity There are many features of volcanic activity. EXTRUSIVE features are those that extrude onto the surface and are hence surface landforms. The major types are all volcanoes of various shapes and forms, but there are much smaller types too. INTRUSIVE volcanic features are intruded into the lithosphere or rock, there they cool and solidify into rocks and are later exposed at the land surface as erosion and weathering DENUDE the land downwards. Shield Volcanoes-Mauna Loa A very wide volcano, of 3 or 4 miles and heights of 1,500 to 2,000m"}, {"url": "http://w3.salemstate.edu/~lhanson/gls100/gls100_vol.htm", "passage_text": "Extrusive (volcanic) Landforms. Extrusive landforms are created by igneous activity at the surface of the earth. There is wide range of volcanic landforms that includes large depressions (calderas and Maars), conical mountains (volcanoes), and broad lava plains and plateaus. The size and shape of these landforms is controlled by a number of factors most of which are listed below."}, {"url": "http://www.acegeography.com/intrusive-volcanic-landforms.html", "passage_text": "Most of the magma is intruded into the crust where it solidifies into a range of features. These are often exposed at the surface by later erosion. Batholiths are formed deep below the surface when large masses of magma cool and solidify. As the magma cools slowly, large crystals are formed in the rock (e.g. granite). Batholiths are often dome-shaped and exposed by later erosion. This is the case on Dartmoor (left) and on the Isle of Arran. Batholiths can be several hundreds of kilometres in diameter"}, {"url": "https://prezi.com/sjxx9edtf2fz/volcanic-features-intrusive-extrusive/", "passage_text": "Intrusive Volcanic Activity Intrusive or Extrusive... - This takes place place beneath the Earth's surface. - It includes the formation of large magma chambers and magma being forced into the crust through cracks in the rock. - Magma in intrusive volcanic features cools, crystallizes and solidifies into igneous rocks below the surface. Slow cooling results in large crystals forming-typical of rocks such as granite and dolerite. Intrusive and Extrusive Volcanic Features-The high pressure inside the earth keeps rock in some parts of the mantle, semi-molten. - when this pressure is released, the rock b becomes molten."}]