[{"url": "http://work.chron.com/much-electrical-lineman-make-year-3128.html", "passage_text": "A journeyman electrical lineman's wages are determined by such factors as his geographic location, employment and union membership. Hourly wages for a journeyman outside lineman with the Northwest Line were $44.73 as of February 2012, resulting in an annual wage of $93,038 for full-time workers."}, {"url": "http://work.chron.com/much-electrical-lineman-make-year-3128.html", "passage_text": "The national median annual income for all electricians was $49,320 as of May 2011, according to the BLS. The middle 50 percent earned between $37,570 and $65,260 per year. The top 10 percent made at least $82,680 per year, while the bottom 10 percent earned annual wages of $30,390."}, {"url": "http://www1.salary.com/Lineman-salary.html", "passage_text": "For example the median expected annual pay for a typical Lineman in the United States is $71,451 so 50% of the people who perform the job of Lineman in the United States are expected to make less than $71,451."}, {"url": "http://www.indeed.com/forum/job/Journeyman-Lineman/Show-me-money/t3057", "passage_text": "union hands make the top wages. typically, a JOURNEYMAN lineman makes between $30 to $50+ depending on your local. i think long island, NY makes the highest in the country at 50 some dollars an hour."}, {"url": "http://www.simplyhired.com/salaries-k-groundman-jobs.html", "passage_text": "Average Groundman Salaries. The average salary for groundman jobs is $25,000. Average groundman salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term groundman anywhere in the job listing."}, {"url": "http://www.indeed.com/forum/job/Journeyman-Lineman/Show-me-money/t3057", "passage_text": "Its more of a This is what line work is like, and how to do it school. Lasts as up to a year for some of them. Can cost as much as $10,000. Also a commercial drivers license helps in being selected for a apprenticeship position."}, {"url": "http://www.simplyhired.com/salaries-k-groundman-jobs.html", "passage_text": "The average salary for groundman jobs is $25,000. Average groundman salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term groundman anywhere in the job listing."}, {"url": "http://work.chron.com/much-electrical-lineman-make-year-3128.html", "passage_text": "Apprentices in the Tennessee Valley Authority's Lineman Apprentice Program are paid a fixed salary based on their level of training. 2012 TVA apprentice wages ranged from $36,450 to $54,360 per year."}]