[{"url": "http://www.bcbsms.com/com/bcbsms/apps/PolicySearch/views/ViewPolicy.php?noprint=yes&path=/policy/emed/Autonomic+Nervous+System+Testing.html", "passage_text": "DESCRIPTION The autonomic nervous system (ANS) regulates physiologic processes, such as blood pressure, heart rate, body temperature, digestion, metabolism, fluid and electrolyte balance, sweating, urination, defecation, sexual response, and other processes. Testing of autonomic nervous system function; vasomotor adrenergic innervation (sympathetic adrenergic function), including beat-to-beat blood pressure and R-R interval changes during Valsalva maneuver and at least 5 minutes of passive tilt."}, {"url": "http://peripheralneuropathycenter.uchicago.edu/learnaboutpn/evaluation/autonomic/", "passage_text": "To see if a disease is affecting the autonomic nervous system, several tests are done to monitor blood pressure, blood flow, heart rate, skin temperature, and sweating. By measuring these functions, it is possible to discover whether or not the autonomic nervous system is functioning normally. Tests to measure blood pressure and heart rate include the tilt table test, a deep breathing test and the Valsalva maneuver. The tilt table test requires that the patient lie on a table that is then raised. The deep breathing test requires the patient to take deep breaths for a minute."}, {"url": "http://pcs.hmc.washington.edu/Epilepsy/anstesting.htm", "passage_text": "Clinical autonomic disease and the role of autonomic testing. The autonomic nervous system (ANS) is responsible for the homeostatic control of numerous bodily functions such as blood pressure and body temperature regulation, urinary function, pupil size, sweating, sexual function, and digestion. "}, {"url": "https://rarediseasesnetwork.org/ARDCRC/patients/learnmore/FAQ.htm", "passage_text": "The autonomic nervous system (ANS or visceral nervous system) is the part of the peripheral nervous system that acts as a control system functioning largely below the level of consciousness, and controls visceral functions. "}, {"url": "http://www.ssmhealth.com/neurosciences/autonomicfunctiontesting/", "passage_text": "Autonomic nervous system testing focuses on the nerve connections between the brain, heart and other organs. Non-invasive testing checks for imbalances that control autonomic processes that include heart rate, blood pressure, gastrointestinal function and sweating. Autonomic nervous system testing may be used to evaluate and treat: 1  Recurrent fainting and syncopy. 2  Dysautonomia"}, {"url": "https://www.anthem.com/medicalpolicies/policies/mp_pw_c160708.htm", "passage_text": "The autonomic nervous system controls many of the involuntary actions such as blood pressure, heart rate, thermoregulation, respiration, gastrointestinal emptying, bladder function and sexual function. "}, {"url": "http://www.misa.ie/clinical-services/falls-and-blackout/autonomic-function-tests", "passage_text": "Disorders of the autonomic nervous system can be identified through autonomic function testing. For these tests you wil be attached to a blood pressure machine which monitors your blood pressure continuously and an electrocardiograph which monitors your heart rhythm continuously. The Autonomic Nervous System regulates the 'automatic' functions of the body such as blood pressure, heart rate, breathing, stomach and intestinal function, and bladder function."}, {"url": "http://www.neurology.upmc.edu/neuromuscular/patient_info/testing.html", "passage_text": "For more information, please call (412) 647-5424. Cardiovascular Autonomic Testing. The autonomic nervous system also controls heart rate and blood pressure. Using breathing techniques and a tilt-table, a technician can assess autonomic function via non-invasive monitoring of blood pressure and heart rate. QSART is used to diagnose: 1  Painful small fiber neuropathy when nerve conduction test results are normal. 2  Disturbances of the autonomic nervous system, which controls the sweat glands, heart, gastrointestinal tract, other organs,"}, {"url": "http://ansdiagnostictesting.com/BillingCoding.html", "passage_text": "CPT Codes. 95921 – Parasympathetic Function Testing. Testing of autonomic nervous system function; cardiovagal innervation (parasympathetic function) including two or more of the following: heart rate response to deep breathing with recorded R-R interval, Valsalva ratio, and 30:15 ratio. 95922 – S"}]