[{"url": "http://www.keystrox.com/medical-transcription-insights/how-much-should-medical-transcription-services-cost/", "passage_text": "How much should good medical transcription services cost? We are talking about a well-referenced, grammatically correct, blank-free document. The correct answer is somewhere in the neighborhood of 12 to 15 cents for a 65-character line, without any additional charges, barring a 20-30% premium for stat jobs. "}, {"url": "http://work.chron.com/much-charge-typing-services-home-20453.html", "passage_text": "For example, you might charge a flat rate of $9 per 500-word page for transcription, regardless of editing or content. Break your flat rates by service categories, such as resumes, essays, dictations or transcription. Offer flat rate add-on features as well, such as $15 per page for fact-checking. To see if you're charging similar to the competition and to make sure you're not overpriced, call or browse the website of other home-based typing services and see what they charge for their services."}, {"url": "http://www.proz.com/forum/money_matters/272876-how_much_do_you_charge_for_transcription_services.html", "passage_text": "I have never worked with transcription as yet so I don´t know what the usual charges are. Any suggestions are very welcome! When they ask you for your hourly rate (usually it's per audio minute), then you just multiply your rate per minute by 60 for transcription services. When you are asked to not only transcribe, but to translate as well, then it's your hourly transcription rate plus your per minute translation rate times 60"}, {"url": "http://www.virtualassistantforums.com/rates-billing/how-much-charge-transcription-22704", "passage_text": "Re: How much to charge for transcription. lol if you actually read my post you'd see that's exactly what I'm saying-people need to research for themselves and not expect everything on a plate! __________________. Bridie's Typing Services Celebrating 10 years in biz. Blog Entries: 1. How much to charge for transcription. I just received a PM asking me what my rates are (sorry, that's confidential!) but it's a question I see asked time and time again, both here and elsewhere. TBH the answer is out there, you just need to spend a bit of time researching"}, {"url": "http://www.virtualassistantforums.com/rates-billing/how-much-charge-transcription-per-hour-per-project-per-page-per-line-per-word-7468", "passage_text": "For those of you who offer transcription services, I am wondering how you bill: per hour, per project, per page, per line or per word. Also how do you deterime the amount of time it takes to transcribe an audio file or tape. Is it based on number of speakers, length of recording, quality of recording, etc. Re: Per hour, per project, per page, per line or per word. I really think that a per minute rate works best. It makes it very clear right off the bat how much the person can expect to pay for the transcription work."}, {"url": "http://www.costowl.com/b2b/medical-transcription-service-cost.html", "passage_text": "Medical Transcription Service Average Costs. It is standard for medical transcription services to charge per line of text. Although the average cost is usually $0.12 to $0.14 per line, prices can actually range anywhere from $0.07 to $0.20 per line. Many providers will let you do a trial run at no charge. This is a great opportunity to compare vendors. You want a transcription service that strives to meet all of your practice’s healthcare documentation needs. It is standard for medical transcription services to charge per line of text. Although the average cost is usually $0.12 to $0.14 per line, prices can actually range anywhere from $0.07 to $0.20 per line."}, {"url": "http://work.chron.com/much-charge-typing-services-home-20453.html", "passage_text": "Specialized Pricing. Typing services typically charge per page, word or hour. If you’re charging per page or word, you will want to have a standard rate for typing without editing and a rate for typing services with editing; this is called leveling your prices. For example, you can charge $3 per page for your base rate and an additional $2 per page for editing. To see if you're charging similar to the competition and to make sure you're not overpriced, call or browse the website of other home-based typing services and see what they charge for their services."}, {"url": "http://www.proz.com/forum/money_matters/58416-how_to_charge_for_transcription_services.html", "passage_text": "When i finish the job, i send in my invoice with a copy of the time tracking record sheet. I charge for transcription per hour and for translation per word. Fanurio can be downloaded for a fee. It works very well with jobs that require proof of how much time was spent. elham James (Jim) Davis wrote: I remember doing this years ago. If it is a specific job you want to quote for, you have to define what the job entails. It sounds that there is only transcription, no time cueing or translation involved. I don't think that you can afford to spend much more that ten minutes transcribing one minute of the spoken word."}]