[{"url": "https://en.wikipedia.org/wiki/Genetics", "passage_text": "Genetics is the study of genes, heredity, and genetic variation in living organisms. It is generally considered a field of biology, but it intersects frequently with many of the life sciences and is strongly linked with the study of information systems. The father of genetics is Gregor Mendel, a late 19th-century scientist and Augustinian friar. Mendel studied 'trait inheritance', patterns in the way traits were handed down from parents to offspring. He observed that organisms (pea plants) inherit traits by way of discrete units of inheritance."}, {"url": "http://johnhansenfitness.com/2013/09/05/casey-viator-a-genetic-phenomenon/", "passage_text": "Casey Viator – A Genetic Phenomenon. Bodybuilding is a sport in which success, in large part, is dependent on the genetics that are inherited from your ancestors. "}, {"url": "https://en.wikipedia.org/wiki/Anticipation_(genetics)", "passage_text": "Anticipation is common in trinucleotide repeat disorders, such as Huntington's disease and myotonic dystrophy, where a dynamic mutation in DNA occurs. All of these diseases have neurological symptoms. In order to have a deleterious effect, the number of repeats must cross a certain threshold. For example, normal individuals have between 5 and 30 CTG repeats within the 3' UTR of DMPK, the gene that is altered in myotonic dystrophy."}, {"url": "https://en.wikipedia.org/wiki/Raynaud%27s_phenomenon", "passage_text": "In medicine, Raynaud's /reɪˈnoʊz/ Disease or Raynaud phenomenon is excessively reduced blood flow in response to cold or emotional stress, causing discolouration of the fingers, toes, and occasionally other areas. Raynaud's phenomenon is the initial symptom that presents for 70% of patients with scleroderma, a skin and joint disease. When Raynaud's phenomenon is limited to one hand or one foot, it is referred to as Unilateral Raynaud's. This is an uncommon form, and it is always secondary to local or regional vascular disease."}, {"url": "https://en.wikipedia.org/wiki/Raynaud%27s_phenomenon", "passage_text": "This may be the case in the CREST syndrome, of which Raynaud's is a part. Patients with Secondary Raynaud's can also have symptoms related to their underlying diseases. Raynaud's phenomenon is the initial symptom that presents for 70% of patients with scleroderma, a skin and joint disease. When Raynaud's phenomenon is limited to one hand or one foot, it is referred to as Unilateral Raynaud's. This is an uncommon form, and it is always secondary to local or regional vascular disease."}, {"url": "http://www.niams.nih.gov/health_info/raynauds_phenomenon/default.asp", "passage_text": "Severe cases of Raynaud’s phenomenon—usually of the secondary form—can lead to problems such as skin ulcers (sores) or gangrene (tissue death) in the fingers and toes, which can be painful and difficult to treat. Raynaud’s phenomenon is a condition that affects the blood vessels in the extremities—generally, the fingers and toes."}, {"url": "http://www.niams.nih.gov/health_info/raynauds_phenomenon/default.asp", "passage_text": "When Raynaud’s phenomenon is caused by or associated with an underlying disease, it is referred to as secondary Raynaud’s phenomenon. Secondary Raynaud’s phenomenon tends to begin later in life than the primary form. Raynaud’s phenomenon is a condition that affects the blood vessels in the extremities—generally, the fingers and toes."}, {"url": "https://en.wikipedia.org/wiki/Anticipation_(genetics)", "passage_text": "In genetics, anticipation is a phenomenon whereby as a genetic disorder is passed on to the next generation, the symptoms of the genetic disorder become apparent at an earlier age with each generation. In most cases, an increase of severity of symptoms is also noted. In order to have a deleterious effect, the number of repeats must cross a certain threshold. For example, normal individuals have between 5 and 30 CTG repeats within the 3' UTR of DMPK, the gene that is altered in myotonic dystrophy."}, {"url": "http://www.rightdiagnosis.com/medical/genetic_phenomena.htm", "passage_text": "Genetic Phenomena: Temporal, spatial, qualitative, and quantitative concepts related to GENETIC PROCESSES and GENETIC STRUCTURES. Genetic Phenomena: Related Topics. These medical condition or symptom topics may be relevant to medical information for Genetic Phenomena: 1  Genetic. 2  Genetic disease. 3  Genetic disorder. 4  Genetic syndrome."}, {"url": "http://www.niams.nih.gov/health_info/raynauds_phenomenon/default.asp", "passage_text": "It is common for patients with a connective tissue disease to have Raynaud’s phenomenon. It occurs in more than 90 percent of people with scleroderma. It is also common in people with systemic lupus erythematosus and with Sjoegren’sjögren s. syndrome Raynaud’s phenomenon is a condition that affects the blood vessels in the extremities—generally, the fingers and toes."}]