[{"url": "http://www.answers.com/Q/In_which_region_of_the_root_tip_does_mitosis_occur", "passage_text": "3) Root tips have very rapid rate of mitosis.   4) The cells are very responsive to staining techniques.   5) The chromosomes are large and fewer in number. (Only 16 in a  cell have the diploid condition. The reason for mitosis occurring most commonly in the onion root tip is because the onion root tip is a rapidly growing area of the plant. + 2 others found this useful. Jada Nneji."}, {"url": "http://vlab.amrita.edu/?sub=3&brch=188&sim=1102&cnt=1", "passage_text": "Cell division occurs rapidly in growing root tips of sprouting seeds or bulbs. The most commonly used root tips in labs to study mitosis are onion, wheat, lentil, barley and alfalfa. An onion root tip is a rapidly growing part of the onion and thus many cells will be in different stages of mitosis. The onion root tips can be prepared and squashed in a way that allows them to be flattened on a microscopic slide, so that the chromosomes of individual cells can be observed easily."}, {"url": "http://www.answers.com/Q/In_what_region_of_the_onion_root_tip_does_mitosis_occur", "passage_text": "follow this procedure..   1.Collect two onion root tips and trim so that you have about 2 mm of the very tip.     2.Soak the tips in a few drops of 1 M HCl in … a watch glass for about 10 min.     3.Transfer the tips to a few drops of acetocarmine stain for about 15 min.     4.Transfer one tip to a few drops of water on a slide. The reason for mitosis occurring most commonly in the onion root tip is because the onion root tip is a rapidly growing area of the plant. + 2 others found this useful."}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/R/Roots.html", "passage_text": "The Root Tip. 1  meristem-a region of rapid mitosis, which produces the new cells for root growth. 2  root cap-a sheath of cells that protects the meristem from abrasion and damage as the root tip grows through the soil. 1 meristem-a region of rapid mitosis, which produces the new cells for root growth. 2  root cap-a sheath of cells that protects the meristem from abrasion and damage as the root tip grows through the soil."}, {"url": "http://www.epcc.edu/Biology/Documents/Mitosis/Root_Tip_Mitosis_Lab.pdf", "passage_text": "1 Mitosis in Onion Root Tip Cells A quick overview of cell division The genetic information of plants, animals and other eukaryotic organisms resides in several (or many) individual DNA molecules, or chromosomes. 4 Procedure for determining the length of the stages of mitosis Locate the meristem region of the root tip. 1. Starting under the 10x objective, find the region of active cell division. 2."}, {"url": "http://pleasanton.k12.ca.us/avhsweb/thiel/bio/labs/mitosis.html", "passage_text": "To study the stages of mitosis, you need to look for tissues where there are many cells rapidly growing and dividing. This restricts your search to the tips of growing plants such as the onion root tip or, in the case of animals, to rapidly dividing tissue such as developing embryos. Roots consist of different regions. To estimate the relative length of time that a cell spends in the various stages of cell replication, you will examine the mereistematic region of a prepared slide of the onion root tip. The length of the cell cycle is approximately 24 hours or 1440 minutes for cells in actively dividing onion root tips."}, {"url": "http://www.answers.com/Q/In_which_region_of_the_root_tip_does_mitosis_occur", "passage_text": "The root tip is on the bottom of the Zone of elongation and the zone of elongation is where the cells are and the cells push the zone of elongation and the root tip gets the w … ater and sends the water through the xylem into the plant. So the root tip get the water. The reason for mitosis occurring most commonly in the onion root tip is because the onion root tip is a rapidly growing area of the plant. + 2 others found this useful. Jada Nneji."}, {"url": "http://pleasanton.k12.ca.us/avhsweb/thiel/bio/labs/mitosis.html", "passage_text": "In this laboratory, you will investigate the process of mitosis. You will use prepared slides of onion root tips to study plant mitosis and to calculate the relative duration of the phases of mitosis in an area of a root where rapid cell growth and division is occuring. To estimate the relative length of time that a cell spends in the various stages of cell replication, you will examine the mereistematic region of a prepared slide of the onion root tip. The length of the cell cycle is approximately 24 hours or 1440 minutes for cells in actively dividing onion root tips."}]