[{"url": "http://www.embarrassingproblems.com/problem/cold-sores/cold-sore-actions", "passage_text": "However, it is possible that cold sores heal better when they are kept moist. Of course, aciclovir cream will keep it moist as well as having a specific antiviral action. Tea tree oil, or oil from a vitamin A or vitamin C capsule, are other methods of keeping it moist and may reduce inflammation slightly. Be hygienic. Hygiene is important, because you do not want a bacterial infection to move in. 1  Try not to touch the sore with your hands. 1 If you apply any cream or oil to the sore, use a new cotton-wool bud each time. 2  To wash the area, dab it gently with a moistened tissue. 3  Do not apply any disinfectant, because this may be too harsh for the damaged skin."}, {"url": "http://findcoldsorescure.com/cold-sore-keep-moist-or-dry/", "passage_text": "ChaCha Answer: It is best to keep a cold sore dry, don't put anything on it and try. Sinusitis-Cold And Flu-All About The Common Cold And Flu. Sinus infections are a common complication after a cold, Sore Throat; Cough that may be worse at night; Keep your home humidified. Sweating helps keep skin soft and moist. Dry skin can become red and sore, and can crack and peel. and cold skin are symptoms of atherosclerosis. Use lotion to keep skin moist and soft and prevent itching."}, {"url": "http://www.embarrassingproblems.com/problem/cold-sores/cold-sore-actions", "passage_text": "1 Try not to touch the sore with your hands. 2  If you apply any cream or oil to the sore, use a new cotton-wool bud each time. 3  To wash the area, dab it gently with a moistened tissue. 4  Do not apply any disinfectant, because this may be too harsh for the damaged skin. 1 If you apply any cream or oil to the sore, use a new cotton-wool bud each time. 2  To wash the area, dab it gently with a moistened tissue. 3  Do not apply any disinfectant, because this may be too harsh for the damaged skin."}, {"url": "http://www.huffingtonpost.com/thomas-p-connelly-dds/cold-sores_b_1307654.html", "passage_text": "That settled it -- moist it was for the cold sore. I made sure to eat my sauce messily, so that covered me a little, but I'm sure Oma knew. Sorry, Oma -- your brats would have pulled you even and made for a long night for me. But the salad just didn't cut it. Specifically, today I want to talk about treating a cold sore, and whether it is better to let it dry out, or to keep it moist. This topic came up the other day when I was talking to a patient about cold sores. He told me about his two grandmothers and their conflicting views on treating everything, cold sores included."}, {"url": "http://www.topherpescure.com/keep-cold-sores-dry-or-moist/", "passage_text": "Keep Cold Sores Dry Or Moist. Tannic acid in tea will have herpes simplex virus. type 1 (HSV-1). Unfortunately the virus responsible for you. Keep Cold Sores Dry Or Moist you may have told that the viruses that are very common in our society. It is a cause for fever blisters in as. little as one day. Most fever-blister treatments which will actually have the outmost freedom of becoming healed HSV remains inside nose. "}, {"url": "http://www.topherpescure.com/cold-sores-keep-moist-or-dry/", "passage_text": "Cold Sores Keep Moist Or Dry to prevent the repeated outbreaks. Although it is a serious illness herpes in women include cayenne (capsicum) Echinacea myrrh red immune to cold sores clover and St. Astragalus or huang qi enhances the immune system. To keep it from Replicating strengthen the Environment. Genital Herpes is derived from oral herpes outbreak it is possible should be avoided at all should i keep cold sore scab dry or moist cost."}, {"url": "http://whatallergy.com/2011-02/fighting-cold-sores", "passage_text": "1 Protect your lips – Make sure you wear a good sun-screen lip balm in direct sunlight as this can trigger cold sores. 2  In winter make sure you keep lips moist, use a lip balm. 3  If lips do become chapped or sore it can be easier for the virus to take hold. My problem is I have 2 in the corner of my mouth on the letter side so when they scab over when my mouth is closed when I open my mouth all the way it rips off the scab bad streachs out the wound. Also when you have a cold sore dont drink citrus drinks. The burn your mouth."}, {"url": "http://www.huffingtonpost.com/thomas-p-connelly-dds/cold-sores_b_1307654.html", "passage_text": "It seems like once a year or so I get around to doing a blog post on cold sores, so here's one for 2012. Specifically, today I want to talk about treating a cold sore, and whether it is better to let it dry out, or to keep it moist. This topic came up the other day when I was talking to a patient about cold sores. He told me about his two grandmothers and their conflicting views on treating everything, cold sores included."}, {"url": "http://ezinearticles.com/?Cold-Sore-Home-Remedy&id=2234280", "passage_text": "One cold sore home remedy is to try and dry out the sore. Another approach is to keep the sore moist and deprive it of oxygen. And still a third is to dry out the sore and then keep it moist. There are many cold sore home remedy methods using normal household supplies that do not fall into the above three categories. DRYING OUT THE SORE. The method of drying out the sore involves applying some sort of astringent to the sit"}]