[{"url": "https://en.wikipedia.org/wiki/Gold", "passage_text": "Gold is a chemical element with symbol Au (from Latin: aurum) and atomic number 79. In its purest form, it is a bright, slightly reddish yellow, dense, soft, malleable and ductile metal. Chemically, gold is a transition metal and a group 11 element. It is one of the least reactive chemical elements, and is solid under standard conditions."}, {"url": "http://www.wisegeek.org/what-is-gold.htm", "passage_text": "Adorable animal families that will make you aww. Gold is a metallic element with the atomic number 79 and the symbol Au. While the name gold comes from an Old English word meaning yellow, the symbol comes from the Latin aurum, which means “shining dawn.”. A specialized use is in the powder called gold tin purple, gold tin precipitate, or purple of Cassius, which is used for tinting enamels and manufacturing a special type of glass called ruby glass. Ruby glass is used on the windows of office buildings as well as on mirrors that are used in space."}, {"url": "http://education.jlab.org/itselemental/ele079.html", "passage_text": "Gold is the most malleable and ductile of all known metals. A single ounce of gold can be beaten into a sheet measuring roughly 5 meters on a side. Thin sheets of gold, known as gold leaf, are primarily used in arts and crafts for gilding. Gold is a good conductor of heat and electricity and does not tarnish when it is exposed to the air, so it can be used to make electrical connectors and printed circuit boards. Gold is also a good reflector of infrared radiation and can be used to help shield spacecraft and skyscrapers from the sun's heat."}, {"url": "http://www.merriam-webster.com/dictionary/gold", "passage_text": "Full Definition of GOLD. 1. : a yellow malleable ductile metallic element that occurs chiefly free or in a few minerals and is used especially in coins, jewelry, and dentures — see element table. 2. a (1) : gold coins (2) : a gold piece b: money c: gold standard 1. 3. : a variable color averaging deep yellow. Definition of GOLD for Kids. 1. : a soft yellow metallic chemical element used especially in coins and jewelry. 2. : gold coins. 3. : a medal awarded as the first prize in a competition. 4. : a deep yellow."}, {"url": "http://www.thefreedictionary.com/gold", "passage_text": "gold. Symbol Au A soft, shiny, yellow element that is the most easily shaped metal. It occurs in veins and in alluvial deposits. Because it is very durable, resistant to corrosion, and a good conductor of heat and electricity, gold is used as a plating on electrical and mechanical components. n. 1. (Elements & Compounds). a. a dense inert bright yellow element that is the most malleable and ductile metal, occurring in rocks and alluvial deposits: used as a monetary standard and in jewellery, dentistry, and plating. The radioisotope gold-198 (radiogold), with a half-life of 2.69 days, is used in radiotherapy."}, {"url": "http://education.jlab.org/itselemental/ele079.html", "passage_text": "Pure gold is soft and is usually alloyed with other metals, such as silver, copper, platinum or palladium, to increase its strength. Gold alloys are used to make jewelry, decorative items, dental fillings and coins. The amount of gold in an alloy is measured with a unit called a karat. Gold is a good conductor of heat and electricity and does not tarnish when it is exposed to the air, so it can be used to make electrical connectors and printed circuit boards. Gold is also a good reflector of infrared radiation and can be used to help shield spacecraft and skyscrapers from the sun's heat."}, {"url": "http://www.wisegeek.org/what-is-gold.htm", "passage_text": "Ad. Although many people may know gold for its use in jewelry — which is how about 65% of it is used — it has a number of other uses. About 25% is used in industrial applications in ceramics, electrical, and electronics applications. A specialized use is in the powder called gold tin purple, gold tin precipitate, or purple of Cassius, which is used for tinting enamels and manufacturing a special type of glass called ruby glass. Ruby glass is used on the windows of office buildings as well as on mirrors that are used in space."}, {"url": "http://www.whatisgold.net/", "passage_text": "What is Gold is your key to unlocking a huge wealth creating opportunity. Gold prices have been rising steadily since 2001, when one could buy an ounce of Gold for $256, and those of us who bought Gold at that time have since enjoyed gains of over 550% in 10 years! So far, Gold is the best investment of the Century, second only to Silver which has risen a jaw dropping 775% in price. "}, {"url": "http://www.investorwords.com/6533/gold.html", "passage_text": "Definition. A precious metal commodity that serves as a store of value and a medium of exchange. Gold has been used as a currency and as a way to stabilize the value of the U.S. dollar and other modern currencies. "}]