[{"url": "http://www.statcan.gc.ca/pub/75-001-x/00703/6578-eng.html", "passage_text": "The average family income tax bill of $13,600 was more than seven times the average property tax bill. As a proportion of total income, 21.3% went for income taxes compared with 2.9% for property taxes. Quebec had the highest rate of both income taxes (24.5%) and property taxes (3.4%). Income taxes ate up 20% to 21% of family income west of the Quebec-Ontario border, and 17% to 18% in the Atlantic provinces. The assessed value was not available, but homeowners did estimate the current value of their homes. According to these estimates, average property values were highest in British Columbia ($219,000) and Ontario ($183,000), followed by Alberta ($137,000) and Quebec ($109,000)."}, {"url": "http://www.huffingtonpost.ca/2014/09/27/property-taxes-canada_n_5890090.html", "passage_text": "The average property tax bill there works out to $2,322 per year. So residents of Vancouver, where the average house price including condos is $631,000, pay on average about half as much property tax as residents of Saskatoon, where a home averages $353,000. Property Taxes In Canada. of. . . Average estimated property tax bill, based on CREA average house prices and REALpac data on residential property tax rates."}, {"url": "http://www.tax-rates.org/kentucky/property-tax", "passage_text": "0.72% of home value. Tax amount varies by county. The median property tax in Kentucky is $843.00 per year for a home worth the median value of $117,800.00. Counties in Kentucky collect an average of 0.72% of a property's assesed fair market value as property tax per year. Oldham County collects the highest property tax in Kentucky, levying an average of $2,244.00 (0.96% of median home value) yearly in property taxes, while Wolfe County has the lowest property tax in the state, collecting an average tax of $293.00 (0.54% of median home value) per year."}, {"url": "http://www.tax-rates.org/kentucky/property-tax", "passage_text": "Statistics show that about 25% of homes in America are unfairly overassessed, and pay an average of $1,346 too much in property taxes every year. We can check your property's current assessment against similar properties in Kentucky and tell you if you've been overassessed. Oldham County collects the highest property tax in Kentucky, levying an average of $2,244.00 (0.96% of median home value) yearly in property taxes, while Wolfe County has the lowest property tax in the state, collecting an average tax of $293.00 (0.54% of median home value) per year."}, {"url": "http://taxfoundation.org/blog/how-much-do-people-pay-taxes", "passage_text": "For those who make between $10,000 and $20,000 the average total tax rate is 0.4 percent. (The average tax rate for those in the lowest income tax bracket is 10.6 percent, higher than each group between $10,000 and $40,000. This is likely because the amount of refundable tax credits is much smaller for the income group that makes under $10,000.). "}, {"url": "http://ottawa.ca/en/city-hall/budget-and-taxes/your-tax-bill-and-payment-options", "passage_text": "If you have received a property tax bill that you are not responsible for paying, please return it to the City of Ottawa, Revenue Branch (PO Box 4647, Station A, Toronto, ON M5W 0E7), indicating to whom the transfer of title has been made. Payment options for your property tax bill. Learn about the different ways you can pay your property tax bill. Beginning with the 2013 final property tax bill, you can now pay property taxes online."}, {"url": "http://www.troymedia.com/2012/04/27/how-much-tax-do-canadians-really-pay/", "passage_text": "Nonetheless, our estimates suggest the average Canadian family paid about $4,748 in sales taxes last year. Property taxes are no more popular than sales taxes and add $3,520 to the average family’s tax bill. A common misconception is that only homeowners pay property taxes. For that, you must look beyond your income tax returns because income taxes form only a portion of the total tax bill imposed on us by all levels of government (federal, provincial, and local). In 2011, a Canadian family with average income of $74,233 paid $9,137 in income taxes."}, {"url": "http://www.troymedia.com/2012/04/27/how-much-tax-do-canadians-really-pay/", "passage_text": "There are a host of less visible taxes that Canadians pay but do not see. For instance, the average Canadian family paid approximately $3,133 in profit taxes in 2011. Taxes on liquor, tobacco, and amusement amounted to $1,735 for the average Canadian family, while automobile and gas taxes totalled about $775. For that, you must look beyond your income tax returns because income taxes form only a portion of the total tax bill imposed on us by all levels of government (federal, provincial, and local). In 2011, a Canadian family with average income of $74,233 paid $9,137 in income taxes."}, {"url": "http://news.nationalpost.com/news/canada/canadians-pay-42-of-income-in-tax-more-than-they-spend-on-food-shelter-clothing-combined", "passage_text": "Last year, that added up to 41.8% of income, compared to 33.5% in 1961. Given the sheer number of indirect levies – such as the taxes on sales, property, fuel, vehicles, imports, alcohol and tobacco – it’s hardly surprising people don’t realize how much they actually pay. "}, {"url": "http://www.huffingtonpost.ca/2014/09/27/property-taxes-canada_n_5890090.html", "passage_text": "The Real Property Association of Canada (REALpac) has released new numbers on property tax rates across the country, and of major cities surveyed, Vancouver came in with the lowest property tax rate. Vancouverites typically pay $3.68 per year in taxes for every $1,000 of assessed home value. Compare that to residents of Regina, who pay $13.69 for every $1,000 of home value. But the tax rate is just part of the story; ultimately what you pay depends on your home’s assessed value. Property Taxes In Canada. of. . . Average estimated property tax bill, based on CREA average house prices and REALpac data on residential property tax rates."}]