[{"url": "http://www.ebay.com/gds/What-is-Crazing-on-Pottery-or-Ceramic-/10000000177688386/g.html", "passage_text": "Crazing is when the glazed surface of a particular item, whether it be ceramic or pottery starts to obtain a network of fine cracks in the glaze. There are many factors that cause crazing, such as, how much an item is moved around or the weather conditions around that item. First of all, crazing, 99% of the time, will be proof of the age of the item. If an item that is ceramic or pottery is newer and starts to craze with in the first few years, than that item was poorly made in the first place, whether it be in the firing process of the glaze or such."}, {"url": "https://en.wikipedia.org/wiki/Crazing", "passage_text": "Crazing is the phenomenon that produces a network of fine cracks on the surface of a material, for example in a glaze layer. Crazing frequently precedes fracture in some glassy thermoplastic polymers. Crazing occurs in regions of high hydrostatic tension, or in regions of very localized yielding, which leads to the formation of interpenetrating microvoids and small fibrils. Crazing occurs in some thermoplastics such as acrylonitrile butadiene styrene (ABS plastic) when stressed. It is a typical response in rubber toughening, where crazes are initiated at the surfaces of the rubber particles added to toughen the material."}, {"url": "http://pottery.about.com/od/glazeproblems/ss/crazing.htm", "passage_text": "Crazing is the glaze defect in which a network of cracks develop in the fired glaze. These cracks are often very fine, but can also be quite severe. You may first notice crazing of a glaze when removing the pot from the kiln or crazing may develop over time. Crazing is generally undesirable; however, certain glazes, referred to as crackle glazes, are specifically composed to develop a controlled form of crazing. Crackle glazes should never be used on the interior of any pot that is able to hold liquid or foodstuffs. 1 of 3 Show All. 1."}, {"url": "http://www.americanceramics.com/html/crazing.html", "passage_text": "FIRING SUPPORT CENTERGlaze Crazing. Crazing is one of the most common problems related to glaze defects. It appears in the glazed surface of fired ware as a network of fine hairline cracks. The initial cracks are thicker, and filled in with finer cracks. Crazing is caused by the glaze being under too much tension. This tension occurs when the glaze contracts more than the clay body during cooling. Because glazes are a very thin coating, most will pull apart or craze under very little tension."}, {"url": "https://en.wikipedia.org/wiki/Crazing", "passage_text": "Crazing occurs in polymers, because the material is held together by a combination of weaker Van der Waals forces and stronger covalent bonds. Sufficient local stress overcomes the Van der Waals force, allowing a narrow gap. Crazing occurs in some thermoplastics such as acrylonitrile butadiene styrene (ABS plastic) when stressed. It is a typical response in rubber toughening, where crazes are initiated at the surfaces of the rubber particles added to toughen the material."}, {"url": "http://www.multitechproducts.com/pages/Crazing.html", "passage_text": "Crazing. Crazing is generally associated with spas, but could occur on bath products. For example, crazing occurs on bathtubs, showers, and sinks made with either FRP (polyester resin reinforced with fiberglass) or cultured marble. Go to the Surfaces tab and Plastic Surfaces category to learn more about these materials. "}, {"url": "http://www.lakesidepottery.com/HTML%20Text/Tips/Crazing.html", "passage_text": "Crazing is a network of lines or cracks in the fired glazed surface. It happens when a glaze is under tension. A craze pattern can develop immediately after removal from the kiln or years later. Generally, crazing is considered a glaze defect because the vessel can be significantly weaker than an uncrazed pot. Craze lines can also harbor bacteria or germs. Therefore, dinnerware pottery should be uncrazed ware."}, {"url": "http://www.emmgraphics.com/pottery/orttip6.html", "passage_text": "What is Crazing. Crazing is one of the most common problems related to glaze defects. It appears in the glazed surface of fired ware as a network of fine hairline cracks. The initial cracks are thicker and spiral upward. These are filled in horizontally with finer cracks. Crazing is caused by the glaze being under too much tension. This tension occur when the glaze contracts more than the body during cooling. Because glazes are a very thin coating, most will pull apart or craze under very little tension. Crazing can make foodsafe glazes unsafe and ruin the look of a piece."}, {"url": "http://www.ehow.com/info_8280573_causes-crazing-dinnerware.html", "passage_text": "Causes of Crazing. Dinnerware is glazed to provide a non-permeable surface on bowls and dishes so food particles and liquids won't be absorbed by porous clay. Some glazes are part of the color patterns, and some are clear, painted over the design to fire into a glass-like finish in the kiln. "}]