[{"url": "http://blog.systoolsgroup.com/types-of-networks.html", "passage_text": "LAN: LAN is a Local Area Network. As name suggests LANs are basically used to connect a limited geographical area: for e.g. when we want to use network at home, a school, an office, at college, etc. Computers placed in this limited area are linked together. LANs can span over a limited range i.e. of 1 km in radius. Communication is carried out from one computer to another, and there is no need of any central computer, and each computer has the same role. The smallest LAN can consist of 2 computers."}, {"url": "http://www.webopedia.com/TERM/L/local_area_network_LAN.html", "passage_text": "A local-area network (LAN) is a computer network that spans a relatively small area. Most LANs are confined to a single building or group of buildings, however, one LAN can be connected to other LANs over any distance via telephone lines and radio waves. A system of LANs connected in this way is called a wide-area network (WAN) . Most LANs connect workstations and personal computers. "}, {"url": "http://www.differencebetween.info/difference-between-lan-and-wan", "passage_text": "The basic definition of WAN includes a network that can span regions, countries, or even the world. However, in practicality, WAN can be viewed as a network that is used to transmit data over long distances between different LANs, WANs and other networking architectures. WAN. Definition. LAN is a computer network that connects computers in small areas. WAN is a network that covers a broad area using private or public network transports. Data transfer rates. LAN offers high d"}, {"url": "http://www.differencebetween.info/difference-between-lan-and-wan", "passage_text": "WANs and LANs can be secured using firewalls, anti-virus and spyware softwares. A detailed description is available below: LAN. WAN. Definition. LAN is a computer network that connects computers in small areas. WAN is a network that covers a broad area using private or public network transports. The best example of WAN would be the Internet, which can help connect anyone from any area of the world. Many businesses and government use WAN in order to conduct business from anywhere in the world. WAN. Definition. LAN is a computer network that connects computers in small areas. WAN is a network that covers a broad area using private or public network transports. Data transfer rates. LAN offers high d"}, {"url": "http://www.snmptools.net/netbasics/lanwan/", "passage_text": "Bridged LANs can span arbitrary distances when using a satellite channel for the bridge. The resulting network is still considered a LAN and not a WAN. To be considered a WAN, a network must be able to connect an arbitrary number of sites across an arbitrary distance, with an arbitrary number of computers at each site. A network is a system of hardware and software, put together for the purpose of communication and resource sharing. A network includes transmission hardware, devices to interconnect transmission media and to control transmissions, and software to decode and format data, as well as to detect and correct problems."}, {"url": "http://blog.systoolsgroup.com/types-of-networks.html", "passage_text": "WAN: WAN is a Wide Area Network, WANs are typically used to connect comparatively large geographical area such as; a state, a country, a continent, the Internet. WANs can span over a range of huge area of 100,000 kilometer radius (between the Earth and artificial satellites). Computers placed in this limited area are linked together. LANs can span over a limited range i.e. of 1 km in radius. Communication is carried out from one computer to another, and there is no need of any central computer, and each computer has the same role. The smallest LAN can consist of 2 computers."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_LAN_and_WAN", "passage_text": "The other difference between LAN and WAN, is the speed of the network. The maximum speed of a LAN can be 1000 megabits per second, while the speed of a WAN can go up to 150 megabits per second. This means the speed of a WAN, is one-tenth of the speed of a LAN. A WAN is usually slower because it has lower bandwidth. Computers in a LAN can share a printer, if they are all in the same LAN."}, {"url": "http://www.webopedia.com/TERM/W/wide_area_network_WAN.html", "passage_text": "A computer network that spans a relatively large geographical area. Typically, a WAN consists of two or more local-area networks (LANs) . Computers connected to a wide-area network are often connected through public networks, such as the telephone system. They can also be connected through leased lines or satellites."}, {"url": "https://kb.iu.edu/d/agki", "passage_text": "A LAN (local area network) is a group of computers and network devices connected together, usually within the same building. By definition, the connections must be high speed and relatively inexpensive (e.g., token ring or Ethernet). Most Indiana University Bloomington departments are on LANs. A WAN (wide area network), in comparison to a MAN, is not restricted to a geographical location, although it might be confined within the bounds of a state or country. A WAN connects several LANs, and may be limited to an enterprise (a corporation or an organization) or accessible to the public."}]