[{"url": "https://en.wikipedia.org/wiki/Modem", "passage_text": "A modem (mo dulator-dem odulator) is a device that modulates one or more carrier wave signals to encode digital information for transmission and demodulates signals to decode the transmitted information."}, {"url": "https://en.wikipedia.org/wiki/Modem", "passage_text": "A common type of modem is one that turns the digital data of a computer into modulated electrical signal for transmission over telephone lines and demodulated by another modem at the receiver side to recover the digital data."}, {"url": "http://www.webopedia.com/TERM/M/modem.html", "passage_text": "A modem is a device or program that enables a computer to transmit data over, for example, telephone or cable lines. Computer information is stored digitally, whereas information transmitted over telephone lines is transmitted in the form of analog waves. A modem converts between these two forms."}, {"url": "http://www.yourdictionary.com/modem", "passage_text": "modem-Computer Definition. 1  A device that comprises both a modulator that changes a signal in some way in the forward direction and a demodulator that changes the signal back to its original form in the backward direction, essentially reversing the modulation process."}, {"url": "http://www.yourdictionary.com/modem", "passage_text": "abbreviation. noun. Modem is defined as an abbreviation for modulator-demodulator, a device that makes it possible for computers to communicate with one another without being directly connected to each other. An example of a modem is the device used for a computer to communicate with a satellite. The definition of a modem is a tool that sends and receives a signal to create a network and Internet connections. An example of a modem is a tool that lets a computer connect to the Internet."}, {"url": "http://www.merriam-webster.com/dictionary/modem", "passage_text": ": a device that changes the form of electric signals so that information can be sent through telephone lines from one computer to another computer. : a device that converts signals produced by one type of device (as a computer) to a form compatible with another (as a telephone)."}]