[{"url": "https://labtestsonline.org/understanding/analytes/pt/tab/test", "passage_text": "The international normalized ratio (INR) is a calculation based on results of a PT and is used to monitor individuals who are being treated with the blood-thinning medication (anticoagulant) warfarin (Coumadin®). A PT and INR are ordered on a regular basis when a person is taking the anticoagulant drug warfarin to ensure that the prescription is working properly and that the PT/INR is appropriately prolonged. There is no set frequency for doing the test."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=international_normalized_ratio", "passage_text": "The international normalized ratio (INR) is a standardized number that's figured out in the lab. If you take blood thinners, also called anti-clotting drugs or anticoagulants, it's especially important to check your INR. The INR is figured out using the results of the prothrombin time (PT) test, which measures the time it takes for your blood to clot. The INR is an international standard for the PT"}, {"url": "http://emedicine.medscape.com/article/2086058-overview", "passage_text": "See the list below: The reference range for prothrombin time is 9.5-13.5 seconds. The reference range for international normalized ratio (INR) is less than 1.3. However, the normal range is highly variable and dependent on the laboratory performing the test. "}, {"url": "https://en.wikipedia.org/wiki/Prothrombin_time", "passage_text": "The normal range for a healthy person not using warfarin is 0.8–1.2, and for people on warfarin therapy an INR of 2.0–3.0 is usually targeted, although the target INR may be higher in particular situations, such as for those with a mechanical heart valve. This test is also called ProTime INR and PT/INR. They are used to determine the clotting tendency of blood, in the measure of warfarin dosage, liver damage, and vitamin K status. PT measures factors I (fibrinogen) , II (prothrombin) , V, VII, and X."}, {"url": "https://en.wikipedia.org/wiki/Prothrombin_time", "passage_text": "The prothrombin time (PT) — along with its derived measures of prothrombin ratio (PR) and international normalized ratio (INR) — are assays evaluating the extrinsic pathway of coagulation. This test is also called ProTime INR and PT/INR. They are used to determine the clotting tendency of blood, in the measure of warfarin dosage, liver damage, and vitamin K status. PT measures factors I (fibrinogen) , II (prothrombin) , V, VII, and X."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=international_normalized_ratio", "passage_text": "These include the method each lab uses to do the test. Even if your test results are different from the normal value, you may not have a problem. To learn what the results mean for you, talk with your health care provider. The INR is a ratio, so it's just a number, not a number tied to time or another value. If you take blood thinners, also called anti-clotting drugs or anticoagulants, it's especially important to check your INR. The INR is figured out using the results of the prothrombin time (PT) test, which measures the time it takes for your blood to clot."}, {"url": "http://symptomstreatment.org/pt-inr-normal-values/", "passage_text": "PT refers to prothrombin time, a type of blood test that measures a person’s blood clotting time. There are various ways to test PT and because of the differences of testing methods used by laboratories, INR or international normalized ratio is used to standardize the PT test results. "}, {"url": "http://answers.webmd.com/answers/1198198/what-is-inr", "passage_text": "By entering a PT result into a math formula, it yields the INR. The international normalized ratio means one lab’s test results can be compared to another’s with high accuracy. A normal INR is approximately 1.0. People taking the blood thinner warfarin typically have a target INR of 2.0 to 3.0. People with an INR higher than the normal range who aren’t taking warfarin may have a medical condition that needs further evaluation. A low INR is rarely significant."}, {"url": "https://en.wikipedia.org/wiki/Prothrombin_time", "passage_text": "Laboratory measurement [edit]. The reference range for prothrombin time depends on the analytical method used, but is usually around 12–13 seconds (results should always be interpreted using the reference range from the laboratory that performed the test), and the INR in absence of anticoagulation therapy is 0.8-1.2. This test is also called ProTime INR and PT/INR. They are used to determine the clotting tendency of blood, in the measure of warfarin dosage, liver damage, and vitamin K status. PT measures factors I (fibrinogen) , II (prothrombin) , V, VII, and X."}, {"url": "http://answers.webmd.com/answers/1198198/what-is-inr", "passage_text": "The INR comes from the conversion of another value, the prothrombin time (PT). Prothrombin time is the time it takes for blood to clot in a test tube. A high or low PT can suggest bleeding or clotting tendencies. Most often, the PT is checked to monitor a person’s response to blood thinners such as warfarin (Coumadin). A normal INR is approximately 1.0. People taking the blood thinner warfarin typically have a target INR of 2.0 to 3.0. People with an INR higher than the normal range who aren’t taking warfarin may have a medical condition that needs further evaluation. A low INR is rarely significant."}]