[{"url": "http://www.metmuseum.org/TOAH/hd/bauh/hd_bauh.htm", "passage_text": "The Bauhaus was founded in 1919 in the city of Weimar by German architect Walter Gropius (18831969). Its core objective was a radical concept: to reimagine the material world to reflect the unity of all the arts. Gropius stepped down as director of the Bauhaus in 1928, succeeded by the architect Hannes Meyer (18891954). Meyer maintained the emphasis on mass-producible design and eliminated parts of the curriculum he felt were overly formalist in nature."}, {"url": "http://en.wikiarquitectura.com/index.php/Bauhaus_building_in_Dessau", "passage_text": "Introduction. Bauhaus, etymologically means, Home Construction, was founded in 1919 in Weimar (Germany), by Walter Gropius, moved to Dessau in 1925 and disbanded in 1933 in Berlin. The spirit and the teachings of this institution can be said to be spread throughout the world. With the move from Weimar to Dessau, the Bauhaus had the opportunity to create a building that offered the best working conditions to develop their own design, which was carried out by Walter Gropius himself and opened on December 4, 1926, quickly becoming icon of early modern movement."}, {"url": "https://en.wikipedia.org/wiki/Bauhaus", "passage_text": "The main building of the Bauhaus-University Weimar (built 1904–1911, designed by Henry van de Velde to house the sculptors’ studio at the Grand Ducal Saxon Art School. Staatliches Bauhaus (help·info) , commonly known simply as Bauhaus, was an art school in Germany that combined crafts and the fine arts, and was famous for the approach to design that it publicised and taught. It operated from 1919 to 1933."}, {"url": "https://en.wikipedia.org/wiki/Bauhaus", "passage_text": "The school was founded by Walter Gropius in Weimar in 1919 as a merger of the Grand Ducal School of Arts and Crafts and the Weimar Academy of Fine Art. Its roots lay in the arts and crafts school founded by the Grand Duke of Saxe-Weimar-Eisenach in 1906 and directed by Belgian Art Nouveau architect Henry van de Velde. Staatliches Bauhaus (help·info) , commonly known simply as Bauhaus, was an art school in Germany that combined crafts and the fine arts, and was famous for the approach to design that it publicised and taught. It operated from 1919 to 1933."}, {"url": "http://www.abstract-art-framed.com/bauhaus.html", "passage_text": "As an architect, Gropius believed that a building should be at the centre of the teaching of all the arts, hence the name Bauhaus (House of Building) and in 1925 the Bauhaus moved from Weimar to Dessau and into a new purpose-built home which reflected the core Bauhaus values. The Bauhaus was founded in Weimar, Germany in 1919 by architect, Walter Gropius with the aim of bridging the gap between art, design and industry and unifying all three."}, {"url": "https://en.wikipedia.org/wiki/Bauhaus", "passage_text": "The Bauhaus was first founded by Walter Gropius in Weimar. In spite of its name, and the fact that its founder was an architect, the Bauhaus during the first years of its existence did not have an architecture department. Staatliches Bauhaus (help·info) , commonly known simply as Bauhaus, was an art school in Germany that combined crafts and the fine arts, and was famous for the approach to design that it publicised and taught. It operated from 1919 to 1933."}, {"url": "https://en.wikipedia.org/wiki/Bauhaus", "passage_text": "So the built output of Bauhaus architecture in these years is the output of Gropius: the Sommerfeld house in Berlin, the Otte house in Berlin, the Auerbach house in Jena, and the competition design for the Chicago Tribune Tower, which brought the school much attention. Staatliches Bauhaus (help·info) , commonly known simply as Bauhaus, was an art school in Germany that combined crafts and the fine arts, and was famous for the approach to design that it publicised and taught. It operated from 1919 to 1933."}, {"url": "http://www.theartstory.org/movement-bauhaus.htm", "passage_text": "Walter Gropius. Walter Gropius. Walter Gropius. The German architect Walter Gropius founded the Bauhaus school of art and design in Weimar Germany. Along with Ludwig Mies van der Rohe and Le Corbusier, he is regarded as one of the pioneers of modern architecture. The Bauhaus, a German word meaning house of building, was a school founded in 1919 in Weimar, Germany by architect Walter Gropius. The school emerged out of late-19th-century desires to reunite the applied arts and manufacturing, and to reform education."}]