[{"url": "http://gainfeeds.com/greyhound/greyhound-nutritional-advice/", "passage_text": "1 Storage It is recommended to store Gain Greyhound food in a cool dry place, free from rodents and birds. 2  Ideally the food should be stored in a sealed container, but if this is not possible then ensure that you fold over the bag opening after use to minimise contamination and maintain its shelf life. We constantly innovate in order to provide the most healthy, delicious nutrition for high performance greyhounds. 1  Balanced diet The first rule of feeding is to ensure that your greyhound has a nutritionally balanced diet with the correct level of protein, fat, carbohydrate,minerals,vitamins and water."}, {"url": "http://gainfeeds.com/greyhound/greyhound-nutritional-advice/", "passage_text": "1 Fresh food Make sure that the fresh food is offered to your greyhound each day. 2  Ad lib feeding If you feed your pups or saplings ad lib, then as the feeder you should be capable of providing a continuous supply of fresh food. We constantly innovate in order to provide the most healthy, delicious nutrition for high performance greyhounds. 1  Balanced diet The first rule of feeding is to ensure that your greyhound has a nutritionally balanced diet with the correct level of protein, fat, carbohydrate,minerals,vitamins and water."}, {"url": "http://www.goldengreyhounds.com/about/feeding.htm", "passage_text": "1 Pick a quiet area. 2  Feed your greyhound TWICE a day. 3  Depending on your dogs potential weight start with 2½ cups in the morning and 2½ cups in the evening. 4  Add about ¼ cup of water to the dry food. 1 If your hound does not finish the food in 15 to 20 minutes pick it up and throw it out. 2  They will learn that when food is down it is time to eat. 3  If your hound does not eat anything call me ASAP. 4  Avoid exercise 30 min before and 30 min after eating."}, {"url": "http://www.goldengreyhounds.com/about/feeding.htm", "passage_text": "Feeding and Treats. 1  Your Greyhound should be fed in the same area each day. 2  Feed your greyhound TWICE a day. 3  Make sure you use metal food and water bowls and they are raised no higher than 8 inches off the ground. 4  NO FREE FEEDING (leaving food out all day). 5  If your hound does not finish the food in 15 to 20 minutes pick it up and throw it out. 6  Avoi 1 If your hound does not finish the food in 15 to 20 minutes pick it up and throw it out. 2  They will learn that when food is down it is time to eat. 3  If your hound does not eat anything call me ASAP. 4  Avoid exercise 30 min before and 30 min after eating."}, {"url": "http://greyhoundcrossroads.com/index.php?page=weight", "passage_text": "This is a 78lb tall, narrow greyhound that is 30 at the shoulder and is at the proper weight for his build. How To Get The Weight Off. Cut back on your greyhound's food for a couple of m onths to slowly get it back to the correct weight. That is the most caring and responsible thing thing you can do once you realize your greyhound has accidentally gotten overweight. If your dog is fat you will need to feed LESS than this for awhile to get the weight off. Smaller females may need only a cup and a half of food or even less fed twice daily (3 cups total) to maintain their weight so would need to be fed even less to lose weight."}, {"url": "http://www.joeysgreyhoundfriends.org/living-with-greyhounds/", "passage_text": "We recommend that your greyhound eats twice a day. Breakfast in the morning and dinner in pm. If the dog is very skinny, still fresh from the track, very big, was or is sick, we recommend that you feed him/her two cups of kibbles twice a day or three smaller meals if you are at home during lunch. Cut them once a month if your dog is calm and does not mind – most veterinarians and vet techs will show you how to do it. If you are scared of your greyhound is too nervous, bring him or her to the vet or groomer, usually they will charge around $10.00 per dog. I use a dremel grinder."}, {"url": "http://www.joeysgreyhoundfriends.org/living-with-greyhounds/", "passage_text": "If you feed canned food, you have to put the amount of canned food in consideration. Maintenance is for a normal size greyhound: 1 ½ cups of kibbles in AM and PM, please mix this kibbles with some either good quality canned food, veggies, some lean beef or chicken, cottage cheese, etc. Cut them once a month if your dog is calm and does not mind – most veterinarians and vet techs will show you how to do it. If you are scared of your greyhound is too nervous, bring him or her to the vet or groomer, usually they will charge around $10.00 per dog. I use a dremel grinder."}, {"url": "http://gainfeeds.com/greyhound/greyhound-nutritional-advice/", "passage_text": "Gain Greyhound Food is comprised of a range of diets, some of which can be fed on their own as complete balanced diets, with others used together or in combination with meat and other ingredients. This ensures that greyhounds of all ages and activity levels receive a high quality balanced diet. We constantly innovate in order to provide the most healthy, delicious nutrition for high performance greyhounds. 1  Balanced diet The first rule of feeding is to ensure that your greyhound has a nutritionally balanced diet with the correct level of protein, fat, carbohydrate,minerals,vitamins and water."}, {"url": "http://www.recycledracers.org/FAQ/greyhound-care-manual.html", "passage_text": "To keep the nosy Greyhound from stealing items and food off of your counter tops, use a baby gate to block him from that area or remove anything and everything from your counter tops, because he will get to it. It will never become a problem if you just block his entry with a baby gate. We recommend two feedings (morning and evening). Most likely your Greyhound will be so overwhelmed with his new home, he may not be interested in eating at all the first day. Even so, put the food bowl out where you wish him to eat and leave it there for 15-30 minutes."}, {"url": "http://www.goldengreyhounds.com/about/feeding.htm", "passage_text": "1 Feed your greyhound TWICE a day. 2  Depending on your dogs potential weight start with 2½ cups in the morning and 2½ cups in the evening. 3  Add about ¼ cup of water to the dry food. 4  Feed immediately do not let the food get soft. 1 If your hound does not finish the food in 15 to 20 minutes pick it up and throw it out. 2  They will learn that when food is down it is time to eat. 3  If your hound does not eat anything call me ASAP. 4  Avoid exercise 30 min before and 30 min after eating."}]