[{"url": "http://www.testpreppractice.net/OAT/oat-test.aspx", "passage_text": "About OAT Test. A doctor’s profession is the noblest profession, and if this profession is clubbed with providing vision to a needy patient, it places the profession of a doctor closest to the Almighty. Such are the sentiments attached with the job of an optometrist. Registering for the OAT. In order to register for a testing date you need to apply to the OAT Program upon which you will receive an electronic notification of your eligibility. Registration can be done either by paper application or by electronic administration."}, {"url": "http://www.ada.org/en/oat/", "passage_text": "You must apply for your test with the OAT Program and receive your electronic notification prior to scheduling your testing appointment with Prometric. Tests are administered year-round at Prometric Test Centers in the United States, its territories including Guam, Puerto Rico, the U.S. Virgin Islands, and Canada. Please go to the PIN page for information on obtaining a PIN. Access the OAT application from the left navigation. The OAT fee is: $390.00. Testing fees are non-refundable and non-transferable."}, {"url": "http://www.testprepreview.com/oat_practice.htm", "passage_text": "The Optometry Admission Test, or OAT, is the exam that anyone who wants to study for a career as an optometrist in America must take as part of the optometry school application process. "}, {"url": "http://www.opted.org/about-optometric-education/professional-o-d-programs/frequently-asked-questions-about-the-optometry-admission-test-oat", "passage_text": "The Optometry Admission Test (OAT) is a standardized examination designed to measure general academic ability and comprehension of scientific information. The OAT is sponsored by the Association of Schools and Colleges of Optometry (ASCO) for applicants seeking admission to an optometry program. All schools and colleges of optometry in the United States, and the University of Waterloo, Canada require the OAT."}, {"url": "http://www.ada.org/en/oat/", "passage_text": "Before you can apply to take the OAT, you must obtain a Personal Identification Number (PIN). Please go to the PIN page for information on obtaining a PIN. Access the OAT application from the left navigation. The OAT fee is: $390.00. Testing fees are non-refundable and non-transferable."}, {"url": "http://www.testpreppractice.net/OAT/oat-test.aspx", "passage_text": "OAT enables you to get enrolled for the four-year degree course, after the completion of which, the student is deemed as a Doctor of Optometry. It is a computer based test that evaluates prospective candidates for their academic abilities and abilities of comprehending scientific details. Registering for the OAT. In order to register for a testing date you need to apply to the OAT Program upon which you will receive an electronic notification of your eligibility. Registration can be done either by paper application or by electronic administration."}, {"url": "http://www.opted.org/about-optometric-education/professional-o-d-programs/frequently-asked-questions-about-the-optometry-admission-test-oat", "passage_text": "The OAT exam is computerized and examinees are allowed to take the OAT an unlimited number of times, but must wait at least 90 days between testing dates. Applicants who have three or more OAT attempts must apply for permission to test again, and from that point forward may retest only once per twelve-month period. The OAT is sponsored by the Association of Schools and Colleges of Optometry (ASCO) for applicants seeking admission to an optometry program. All schools and colleges of optometry in the United States, and the University of Waterloo, Canada require the OAT."}, {"url": "http://www.ada.org/en/oat/", "passage_text": "Applicants must use a PIN for the OAT. The PIN is a unique Personal Identification Number that you will need in order to take the Optometry Admission Test. You may already have a PIN. Please go to the PIN page for information on obtaining a PIN. Access the OAT application from the left navigation. The OAT fee is: $390.00. Testing fees are non-refundable and non-transferable."}, {"url": "http://testingperformance.org/definitions/what-is-operational-acceptance-testing/", "passage_text": "Commonly referred to as OAT, Operational Acceptance Testing is testing that takes place just before implementation to production. The OAT test environment is often known as the ‘pilot’ environment. Everything required to support the application in production should be in place. "}, {"url": "https://en.wikipedia.org/wiki/Operational_Acceptance_Testing", "passage_text": "(Redirected from Operational Acceptance Testing). Operational testing a jet engine. Operational Acceptance Testing (OAT) is used to conduct operational readiness (pre-release) of a product, service or system as part of a quality management system. OAT is a common type of non-functional software testing, used mainly in software development and software maintenance projects. This type of testing focuses on the operational readiness of the system to be supported, and/or to become part of the production environment. "}]