[{"url": "http://seniortravel.about.com/od/rvtravelroadtrips/qt/lowcostrvplaces.htm", "passage_text": "Low-Cost Campgrounds. 1  Escapees RV Club costs $60 per year ($70 for Canadian members). 2  The National Park Service’s Senior Pass, which costs just $10, gives park visitors over age 62 free admission to U.S. national parks and federal recreation lands for life. 3  National park lovers who aren’t yet 62 can buy annual admissions passes for $80 per year. 4  Mi 1 Per-night fees for RV pads range between $10 and $20 per day. 2  Many military campgrounds require advance reservations. 3  Facilities vary, but you can find information on the Army’s Paths Across America website."}, {"url": "http://cars.costhelper.com/rv.html", "passage_text": "1 Renting an RV storage space can cost $20-$100 a month outdoors and $45-$450 a month indoors. 2  An RV storage space can cost $50-$1,200 or more. 1 Lightweight trailers might slightly increase the fuel costs for the tow vehicle, while Class A motorhomes average 8-10 miles per gallon, with a typical Class A fuel tank holding 100-150 gallons. 2  At $2.50-$4 a gallon, filling the tank could cost $250-$600 to travel 800-1,500 miles."}, {"url": "http://seniortravel.about.com/od/rvtravelroadtrips/qt/lowcostrvplaces.htm", "passage_text": "Low-Cost Campgrounds. 1  Escapees RV Club costs $60 per year ($70 for Canadian members). 2  Escapees members can choose from almost 1,000 RV parks that have agreed either to charge $10 per night or provide at least a 15% discount on their regular rates. 1 Per-night fees for RV pads range between $10 and $20 per day. 2  Many military campgrounds require advance reservations. 3  Facilities vary, but you can find information on the Army’s Paths Across America website."}, {"url": "http://cars.costhelper.com/rv-storage.html", "passage_text": "1 In Arizona, Southwest RV charges $50-$94 a month depending on the length of the RV (20 to 45 feet), or the equivalent of $45-$85 a month if paid on an annual basis. 2  Larger motorhomes cost more to store. RV Storage Cost. Typical costs: 1  Outdoor parking at a storage facility, an RV dealership or an RV park/campground with storage space starts at $20-$50 a month but can go as high as $60-$100 or more."}, {"url": "https://wandrlymagazine.com/cheaper-on-the-road/", "passage_text": "One month’s rent in Pecan Grove RV Park, Austin, Texas. You’re in the heart of one of the greatest cities in America, full hookups included but no free Internet. Big city living at 1/10th of the cost of renting an apartment in Austin. $800. One month at the Queen Mine RV Park in Bisbee, Arizona. A short walk from a gorgeous, vibrant small tourist town that’s truly an experience, includes Internet, television and full hookups. $300. One month’s rent for an RV park in Marathon, Texas. Includes full hookups (water, electric, sewage and even TV and Internet in this case) in a small town in the middle of a beautiful nowhere. Basically you’re living in the Old West."}, {"url": "http://cars.costhelper.com/rv.html", "passage_text": "1 As a tryout or an alternative to buying, renting an RV can cost $50-$90 a night for a simple pop-up tent camper, or $150-$350 a night plus 35 60 cents a mile for a luxurious Class A motorhome. 2  RV shows offer different makes and models in one place; admission can be free or $5-$10. 1 Lightweight trailers might slightly increase the fuel costs for the tow vehicle, while Class A motorhomes average 8-10 miles per gallon, with a typical Class A fuel tank holding 100-150 gallons. 2  At $2.50-$4 a gallon, filling the tank could cost $250-$600 to travel 800-1,500 miles."}, {"url": "http://seniortravel.about.com/od/rvtravelroadtrips/qt/lowcostrvplaces.htm", "passage_text": "1 Escapees RV Club costs $60 per year ($70 for Canadian members). 2  Escapees members can choose from almost 1,000 RV parks that have agreed either to charge $10 per night or provide at least a 15% discount on their regular rates. 3  The club’s online message boards are extremely informative. 1 Per-night fees for RV pads range between $10 and $20 per day. 2  Many military campgrounds require advance reservations. 3  Facilities vary, but you can find information on the Army’s Paths Across America website."}, {"url": "http://cars.costhelper.com/rv-storage.html", "passage_text": "1 Costs vary widely depending on type of RV, location and insurance company. 2  If the RV is stored outdoors, RV cover to protect it from dirt, debris and weather can cost $50-$1,200 or more depending on size, durability and whether it's a generic, semi-custom or custom fit. RV Storage Cost. Typical costs: 1  Outdoor parking at a storage facility, an RV dealership or an RV park/campground with storage space starts at $20-$50 a month but can go as high as $60-$100 or more."}, {"url": "http://cars.costhelper.com/rv.html", "passage_text": "1 RV insurance premiums vary significantly; get quotes before buying a specific trailer. 2  Annual state registration fees can be $10-$50 for a simple tent trailer, to $1,000-$3,500 or more for a Class A motorhome. 3  Renting an RV storage space can cost $20-$100 a month outdoors and $45-$450 a month indoors. 1 Lightweight trailers might slightly increase the fuel costs for the tow vehicle, while Class A motorhomes average 8-10 miles per gallon, with a typical Class A fuel tank holding 100-150 gallons. 2  At $2.50-$4 a gallon, filling the tank could cost $250-$600 to travel 800-1,500 miles."}]