[{"url": "http://www.charbroil.com/community/how-to-cook-a-prime-rib-roast-on-a-gas-grill/", "passage_text": "1 Place the roast and pan on the grill on the indirect side where you don't have any burners on. 2  Close the grill lid and cook until the rib roast hits 10 °F less than your desired level of doneness. 3  This should take about 3 hours for medium rare. 4  It's a good idea to turn the roast around every 45 minutes or so. 1 Close the grill lid and cook until the rib roast hits 10 °F less than your desired level of doneness. 2  This should take about 3 hours for medium rare. 3  It's a good idea to turn the roast around every 45 minutes or so. ( 4 For rare-pull at internal temperature of 115°F. 5  For medium rare – 125°F. 6  For medium – 135°F)"}, {"url": "http://www.marksdailyapple.com/grill-roasted-prime-rib/", "passage_text": "Over the hottest side of the grill, sear the roast for about 5 minutes per side, until the entire roast is nicely browned. In between turning the roast, keep the lid on the grill. When the roast is browned, move it to the cooler side of the grill and cook for another 8 to 10 minutes with the lid on. This will give the meat a gentle smoked flavor. Preheat the oven to 250 ºF (121 ºC). Put the meat on a roasting pan fat side up and ribs down"}, {"url": "http://barbecuebible.com/recipe/grilled-prime-beef-ribs-garlic-rosemary/", "passage_text": "Step 4: When ready to cook, brush and oil the grill grate. Place the roast, fat side up, on the hot grate over the drip pan and cover the grill. Step 5: Grill the roast until cooked to taste, 3 1/2 to 4 hours for a medium-rate roast of this size, figuring on 12 to 14 minutes per pound. (If using a charcoal grill, you’ll need to add 10 to 12 fresh coals to each side every hour. Besides, you can let a cooked prime-rib roast stand for up to 30 minutes before carving. Indeed, at least 10 to 15 minutes of standing time is recommended to allow the juices to flow from the center of the roast back to the exterior. 1  Yield: 12 to 16 servings. 2  Method: Indirect Grilling."}, {"url": "http://barbecuebible.com/recipe/grilled-prime-beef-ribs-garlic-rosemary/", "passage_text": "Keep in mind that the only remotely challenging aspect to cooking prime ribs is timing, and if you figure on 12 to 14 minutes per pound (for a bone-in roast), you’ll make a perfect roast every time. Besides, you can let a cooked prime-rib roast stand for up to 30 minutes before carving. Indeed, at least 10 to 15 minutes of standing time is recommended to allow the juices to flow from the center of the roast back to the exterior. 1  Yield: 12 to 16 servings. 2  Method: Indirect Grilling."}, {"url": "http://www.the-greatest-barbecue-recipes.com/beef-ribs-2.html", "passage_text": "The real secret to our traditional barbecue beef rib recipe is to maintain a low heat (225-250°F/107-121°C) for an extended cooking period. This is not fast, but the best way to get them tender! You'll need a full bucket load of this virtue when cooking ribs on a charcoal grill. Figure about 1.5 hours/pound. Cook 'Em... 1  Place the ribs on the grill, opposite side of the fire, bone side down, to begin cooking. 2  Avoid the ribs touching. 3  When cooking beef ribs on a charcoal grill, never let the meat overlap the fire. 4  You cannot undo crispy or burnt barbecue beef ribs!"}, {"url": "http://www.bbq-my-way.com/how-to-cook-prime-rib.html", "passage_text": "1 Temperature of Meat: Let the rib roast come to room temperature prior to cooking. 2  This can take an hour or two depending on the size of the roast. 3  This will cause the roast to cook evenly. 4  Preperation of Grill: Use indirect heat, and place roast in a disposable pan for cooking. "}, {"url": "http://www.the-greatest-barbecue-recipes.com/beef-ribs-2.html", "passage_text": "1 Place the ribs on the grill, opposite side of the fire, bone side down, to begin cooking. 2  Avoid the ribs touching. 3  When cooking beef ribs on a charcoal grill, never let the meat overlap the fire. 4  You cannot undo crispy or burnt barbecue beef ribs! Cook 'Em... 1 "}, {"url": "http://www.lobels.com/recipe/grilled-standing-rib-roast.htm", "passage_text": "4. Transfer the roast, bone side down, to the cooler part of the grill. Cover and grill for 1 hour and 20 minutes to 1 hour and 30 minutes for rare, or longer for more well done meat. After 1 hour, insert an instant-read thermometer in the thickest part of the meat (not too close to the bone). "}, {"url": "http://bbq.about.com/od/beefrecipes/r/bl11222b.htm", "passage_text": "Combine black pepper, dried rosemary, salt and paprika and rub over the surface of the meat. When the grill is ready, place the roast on the well oiled grate directly over the dripping pan. Cook for about 12 to 14 minutes per pound. An 18 pound roast will take about 3 1/2 to 4 hours. It is very important to use an accurate meat thermometer to check for doneness. You do not want to over cook this roast. When the meat reaches an internal temperature of 115 to 125 degrees remove it from the grill."}]