[{"url": "http://www.indeed.com/forum/job/medical-technologist/MLT-starting-salary/t97001", "passage_text": "You have new CLS grads making up to $36 an hour up in northern CA. You have new grads in southern CA making past $30 an hour. This is up about $2 to $3 from almost a year and a half ago and it's still increasing. This was also after the MLT started in CA which was a year ago."}, {"url": "http://www.skill.org.uk/youth/page.aspx?c=309&p=430", "passage_text": "The new law is called the Education and Skills Act 2008. It says that by 2013, all young people in England have to stay on in education or training at least part-time until they are 17 years old. By 2015, all young people will have to stay on in education or training at least part-time, until they are 18"}, {"url": "https://www.gov.uk/know-when-you-can-leave-school", "passage_text": "You can leave school on the last Friday in June if you’ll be 16 by the end of the summer holidays. You must then do one of the following until you’re 18: 1  stay in full-time education, eg at a college. 2  start an apprenticeship or traineeship."}, {"url": "http://www.innerbody.com/careers-in-health/how-to-become-a-medical-laboratory-technician.html", "passage_text": "According to the Bureau of Labor Statistics, medical laboratory technicians’ salaries ranged from approximately $25,210 to $58,910 in May 2013, with a median annual wage of about $37,970."}, {"url": "http://www.flc.losrios.edu/academics/medical-laboratory-technician/mlt-frequently-asked-questions", "passage_text": "MLT didactic courses are typically offered three to four days per week between the hours of 9:00am and 4:00pm; however, there may be some exceptions. The practicum portion of the program requires each student to devote 40 hours per week, offsite, at a clinical affiliate."}, {"url": "http://medlabscience.uc.edu/admissions/admission-requirements/", "passage_text": "The phone number is: 800-937-3985 ext. 3895. As long as the result of this evaluation shows that you have what is equivalent to at least an associate’s degree in medical laboratory technology here in the U.S., you will be eligible to apply to our program. If you have any further questions, feel free to contact me at 800-556-4280."}, {"url": "http://www.nhs.uk/Livewell/Yourchildatschool/Pages/Illness.aspx", "passage_text": "Tell the school. It’s important to inform the school if your child is going to be absent. On the first day of your child's illness, telephone the school to tell them that your child will be staying at home. The school may ask about the nature of the illness and how long you expect the absence to last."}, {"url": "http://www.flc.losrios.edu/academics/medical-laboratory-technician/mlt-frequently-asked-questions", "passage_text": "As part of the application process each student will need to meet with a counselor to have their transcripts evaluated. To make an appointment with an FLC counselor please call 916-608-6510 (FLC) or 530-642-5645 (EDC). When making an appointment, be sure to specify that you are interested in applying to the MLT Program."}]