[{"url": "http://www.bodybuilding.com/fun/wotw15.htm", "passage_text": "Circuit training is the ideal way to go if you want to loose fat while maintaining or even increasing you muscle size and strength. Circuit training usually involves machines, but can be carried out with dumbbells, barbells, balls or body weight exercises. 1 So, lets say you used to do 2 hours per week cardio (4x30 mins), by doing circuit training not only do you save that 2 hours but also another 72 mins per week (4 x 18 mins). 2  That's well over an extra 3 hours per week to paint, write, watch TV, re-acquaint yourself with your significant other, whatever you want."}, {"url": "http://www.bodybuilding.com/fun/wotw15.htm", "passage_text": "1 Circuit training will not increase muscle mass and may even break down muscle proteins if you do train for more than an hour. 2  If you do the cardio after circuit training, you will be burning muscle instead of fat. 3  That's why the week schedule was designed, to allow your body to adapt to burning fat instead of muscle. 1 So, lets say you used to do 2 hours per week cardio (4x30 mins), by doing circuit training not only do you save that 2 hours but also another 72 mins per week (4 x 18 mins). 2  That's well over an extra 3 hours per week to paint, write, watch TV, re-acquaint yourself with your significant other, whatever you want."}, {"url": "http://www.livestrong.com/article/382451-how-often-should-i-strength-train-to-lose-weight/", "passage_text": "Doing that will help prevent injuries. To lose weight, do at least two sessions a week and after three months of consistent training, consider doing three to four times a week. Split your workouts into upper and lower body exercises so you give each time for recovery. All resistance training increase the amount of lean muscle tissue you have, so you are burning more calories to speed weight loss. It's possible to lose weight by resistance training only, but you would need to circuit train to get your heart rate up."}, {"url": "http://www.bodybuilding.com/fun/wotw15.htm", "passage_text": "1 Circuit training is time consuming because it's an extra workout schedule with added cardio. 2  Solution: Use less cardio minutes and higher intensity. 3  Do 1 min of moderate intensity, 20 sec as fast as you can, 1 min moderate intensity, and then 1 min high intensity. 1 So, lets say you used to do 2 hours per week cardio (4x30 mins), by doing circuit training not only do you save that 2 hours but also another 72 mins per week (4 x 18 mins). 2  That's well over an extra 3 hours per week to paint, write, watch TV, re-acquaint yourself with your significant other, whatever you want."}, {"url": "http://www.weight-lifting-complete.com/cardio-for-muscle-building/", "passage_text": "I want you to start and finish every muscle building cycle with 2 to 3 cardiovascular sessions per week for 30 minutes each session of medium intensity cardio. If you are past the beginner stage and have been doing medium intensity cardio for a few months, you can experiment with HIIT for 20 minute sessions. In conclusion…. The muscle building cardio strategy is to keep cardio to a minimum. The number of cardio sessions per week is 2 to 3 for a duration of 30 minutes each session. Extremely skinny people who have trouble gaining weight can do 2, 30 minute sessions per week."}, {"url": "http://stronglifts.com/5x5/", "passage_text": "Stronglifts 5×5 uses five free weight compound exercises: the Squat, Bench Press, Deadlift, Overhead Press and Barbell Row. You do three of these exercises each workout, three times a week, for about 45 minutes per workout. You Squat every workout, three times a week. 5×5 stands for five sets of five reps. These are the sets and reps you do on every exercise except Deadlifts. Deadlift is only one set of five reps (1×5) because doing more would beat you up. Plus, Squatting three times a week will get you stronger at Deadlifts since it works similar muscles. Beyond that, you can add half an hour of cardio after StrongLifts 5×5 to burn extra calories and speed up weight loss. But prioritize lifting weights – you need to build muscle. Oh, and don’t do cardio on your off days, your body needs recovery."}, {"url": "http://www.building-muscle101.com/circuit-training-program-to-burn-fat-and-build-muscle.html", "passage_text": "cardio. Remember, if your doing 1 circuit, you can perform 5 minutes of intense cardio now, however, if you are doing more than one circuit, you may want to wait until all your weight training is complete and do the 5 minutes of intense cardio. The way circuit training is set up, it allows you to continuously exercise from one exercise to the next, while incorporating weight resistance into your program. Let's find out a little bit more and how you can use a circuit training program to burn fat and build muscle (and use the circuit routine below)."}, {"url": "http://www.muscleforlife.com/maintain-muscle-and-strength/", "passage_text": "1 You have to hit the weights 3-5 times per week, every week, for at least 1-2 years. 2  You often have to also find time for a couple hours of cardio per week. 3  You have to watch what you eat, regulating intake to meet your goals of gaining or losing weight. Read on to find out! We all know how much persistence and consistency it takes to get a great physique. 1 "}, {"url": "http://stronglifts.com/5x5/", "passage_text": "Stronglifts 5×5 is the simplest, most effective workout to get stronger, build muscle and burn fat. Thousands of people have used the StrongLifts 5×5 workout to change their bodies and lives. The program is easy to follow and only takes three workouts a week of about 45 minutes. Beyond that, you can add half an hour of cardio after StrongLifts 5×5 to burn extra calories and speed up weight loss. But prioritize lifting weights – you need to build muscle. Oh, and don’t do cardio on your off days, your body needs recovery."}]