[{"url": "http://www.answers.com/Q/What_bacteria_are_normally_found_in_the_intestinal_tract_of_humans", "passage_text": "There is more than one kind of bacteria which may inhabit the human intestines. There are bacteria (such as lactobacillus acidophilus) that are beneficial to human health, a … nd help us to digest our food. Other types (such as cholera) cause illness. 1 person found this useful."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=90&ContentID=P02019", "passage_text": "Escherichia coli O157:H7 is just one of the hundreds of strains of the bacterium Escherichia coli (E. coli) . Most strains of E. coli are harmless and live in the intestines of healthy humans and animals. E. coli, however, produces a powerful toxin that can cause a severe infection."}, {"url": "http://www.answers.com/Q/What_is_found_primarily_in_the_intestines_of_humans", "passage_text": "The human intestines are filled with what is known as gut flora. Gut flora is microbia found in the digestive tract that consists of Bacteroides, Clostridium, Fusobacterium, Eubacterium, Ruminococcus, Peptococcus, Peptostreptococcus, and Bifidobacterium."}, {"url": "http://iai.asm.org/content/76/8/3360.full", "passage_text": "The main types of bacteria in the colon are obligate anaerobes, and the most abundant bacteria are members of the genus Bacteroides, anaerobic gram-positive cocci, such as Peptostreptococcus sp., Eubacterium sp., Lactobacillus sp., and Clostridium sp."}, {"url": "http://www.chw.org/medical-care/gastroenterology-and-hepatology-program/conditions/viruses-bacteria-and-parasites-in-the-digestive-tract/", "passage_text": "Escherichia coli O157:H7 (or simply E. coli) is just one of the hundreds of strains of the bacterium Escherichia coli. Most strains of E. coli are harmless and live in the intestines of healthy humans and animals. E. coli, however, produces a powerful toxin that can cause a severe infection."}, {"url": "http://www.cdc.gov/ecoli/general/index.html/", "passage_text": "Escherichia coli (E. coli) bacteria normally live in the intestines of people and animals. Most E. coli are harmless and actually are an important part of a healthy human intestinal tract. However, some E. coli are pathogenic, meaning they can cause illness, either diarrhea or illness outside of the"}, {"url": "http://www.beachapedia.org/Bacteria", "passage_text": "Fecal Coliforms are a specific kind of coliform bacteria that are found primarily in the intestinal tracts of mammals and birds. These bacteria are released into the environment through human and animal feces. The presence of fecal pollution may come from storm water runoff, pets and wildlife, and human sewage."}]