[{"url": "http://www.healthcommunities.com/foot-anatomy/foot-anatomy-overview.shtml", "passage_text": "1 26 bones (One-quarter of the bones in the human body are in the feet.); 2  33 joints; 3  more than 100 muscles, tendons and ligaments (Tendons are fibrous tissues that connect muscles to bones and ligaments are fibrous tissues that connect bones to other bones.); and. 4  a network of blood vessels, nerves, skin, and soft tissue."}, {"url": "http://www.healthcommunities.com/foot-anatomy/foot-anatomy-overview.shtml", "passage_text": "The ankle serves as foundation, shock absorber and propulsion engine. The foot can sustain enormous pressure (several tons over the course of a one-mile run) and provides flexibility and resiliency. The foot and ankle contain: 1  26 bones (One-quarter of the bones in the human body are in the feet.);"}, {"url": "http://www.uwmedicine.org/health-library/Pages/foot-fractures.aspx", "passage_text": "Calcaneus fracture The calcaneus, or heel bone, is the foot’s largest bone. Because it absorbs so much force with each step, people might assume it’s one of the densest bones in your body. Not so. It’s hard on the outside but softer and spongy on the inside, similar to a hard-boiled egg."}, {"url": "http://www.healthpages.org/anatomy-function/anatomy-foot-ankle/", "passage_text": "Ankle. Lateral side of the ankle Joint capsule. The bones of the foot and ankle begin with the ankle joint itself. The ankle joint, talocrural joint, is formed where the distal end of the leg meets the foot. The ankle joint is formed where the talus (the uppermost bone in the foot) and the tibia (shin) meet."}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00524", "passage_text": "Tarsal bone fractures account for about 2% of all adult fractures. Of these, 60% are calcaneus fractures. The heel bone is often injured in a high-energy collision where other parts of the skeleton are also injured. In up to 10% of cases, the patient can also sustain a fracture of the spine, hip, or the other calcaneus. Injuries to the calcaneus often damage the subtalar joint and cause the joint to become stiff."}, {"url": "http://www.healthcommunities.com/foot-anatomy/foot-anatomy-overview.shtml", "passage_text": "The hindfoot is composed of three joints and links the midfoot to the ankle (talus). The top of the talus is connected to the two long bones of the lower leg (tibia and fibula), forming a hinge that allows the foot to move up and down. The heel bone (calcaneus) is the largest bone in the foot."}]