[{"url": "http://www.naturalmedicinalherbs.net/herbs/m/matteuccia-pensylvanica=ostrich-fern.php", "passage_text": "In small quantities this enzyme will do no harm to people eating an adequate diet that is rich in vitamin B, though large quantities can cause severe health problems. The enzyme is destroyed by heat or thorough drying, so cooking the plant will remove the thiaminase. Young fronds-raw or cooked. Used before they fully unroll, they are thick and succulent. Sometimes sold in speciality markets according to one report, whilst another says that they are a famine food that is only used when all else fails. Rootstock-peeled and roasted. Low open ground, alluvial thickets and rich woods. Spores-surface sow as soon as they are ripe in mid-winter and keep the soil moist. It is best to keep the pot in a sealed plastic bag to hold in the moisture. Pot up small clumps of the young plants as soon as they are large enough to handle and grow on in light shade until large enough to plant out"}, {"url": "http://www.izelplants.com/matteuccia-struthiopteris-ostrich-fern.html", "passage_text": "Additional Tags: bog plant, clumping, colonizing, edible, fall interest, naturalizing, ornamental foliage, pond margin plant, shade garden plant, stream margin plant, woodland garden plant. Description. One of the largest fern species, the ostrich fern can easily reach a height of 5 feet or more. Large fiddleheads emerge in spring as the fern emerges from dormancy. These will develop in to large, slightly scaly, sterile fronds that will persist through early fall. Matteuccia struthiopteris, with its exotic, palm-like appearance, is a wonderful addition to any moist woodland area or shade garden. It tolerates most soil types, but it will do best in slightly acidic, moist to wet soil that is rich in organic matter."}, {"url": "http://classygroundcovers.com/product/79196/Matteuccia-struthiopteris-br-10-Bare-Root-plants", "passage_text": "Ostrich Fern {10 Bare Root plants }. Matteuccia struthiopteris, commonly called Fiddlehead or Ostrich Fern, offers an erect, feathery plume of vibrant, lush green, divided, lanceolate fronds that arch gracefully outward into a symmetric clump. Edible tightly wound immature fronds (called fiddleheads) appear in spring, offering a delightful addition to your cooking repertoire as well as visual texture and interest to the garden. Fertile fronds are produced after the vegetative fronds and persist throughout the following winter; the spores shed in mid-winter."}, {"url": "http://ontarioferns.com/main/species.php?id=4027", "passage_text": "Other scientific names: Matteuccia pensylvanica, Pteretis nodulosa, Pteretis pensylvanica, Struthiopteris pensylvanica French names: Matteuccie foug re- -L'Autriche Family: Wood Fern Family (Dryopteridaceae) Distinctive features: All fronds grow from a single black knob. Fronds: Twice divided Height: 90-120 cm (35-47 in) Habitat: Forests, Wet Areas; Forests in rich damp soil. Uses: Edible-this is the preferred species to eat. However, it should only be eaten in moderation as all ferns contain varying amounts of carcinogenic compounds. Native/Non-native: Native Status: Very common."}, {"url": "http://www.pfaf.org/user/Plant.aspx?LatinName=Matteuccia+struthiopteris", "passage_text": "Form: Irregular or sprawling. Physical Characteristics. Matteuccia struthiopteris is a FERN growing to 1 m (3ft 3in) by 0.5 m (1ft 8in) at a medium rate. It is hardy to zone (UK) 2. USDA hardiness zone: 2-7Suitable for: light (sandy), medium (loamy) and heavy (clay) soils and can grow in heavy clay soil."}, {"url": "http://plants.alaska.gov/pdf/Fiddleheads.pdf", "passage_text": "Ostrich Fern and Northwestern Lady Fern fiddleheads for eating. Keywords. Ostrich Fern, Northwestern Lady Fern, Matteuccia struthiopteris, Athyrium filix-femina, Alaska fiddlehead ferns, Alaska Plant Materials Center, Alaska Department of Natural Resources, ferns poisonous, ferns to avoid. Descriptions: (1) Ostrich Fern: Growing in a circular clump, the large green erect sterile fronds can reach 5+ feet in length before dying back in the autumn. Shaped like an ostrich’s plumes, they are widest above the middle and taper abruptly to the tip, while tapering gradually toward the base."}, {"url": "http://ontarioferns.com/main/species.php?id=4027", "passage_text": "Virginia Chain Fern (Woodwardia virginica) - uncommon; fronds grow singly. Fronds: Twice divided Height: 90-120 cm (35-47 in) Habitat: Forests, Wet Areas; Forests in rich damp soil. Uses: Edible-this is the preferred species to eat. However, it should only be eaten in moderation as all ferns contain varying amounts of carcinogenic compounds. Native/Non-native: Native Status: Very common."}, {"url": "https://www.minnesotawildflowers.info/fern/ostrich-fern", "passage_text": "Ostrich Fern has been used in landscaping but can be a bit aggressive and form large colonies. The fiddleheads are edible, quite tasty sauteed sautéed in a little (butter what'isn!). T there are 2 varieties Of. m, struthiopteris with. var struthiopteris native To eurasia and. var pensylvanica In North. america "}, {"url": "http://ontarioferns.com/main/species.php?id=4027", "passage_text": "Range map for Ostrich Fern (Matteuccia struthiopteris). PLEASE NOTE: A coloured Province or State means this species occurs somewhere in that Province/State. The entire Province/State is coloured, regardless of where in that Province/State it occurs. Fronds: Twice divided Height: 90-120 cm (35-47 in) Habitat: Forests, Wet Areas; Forests in rich damp soil. Uses: Edible-this is the preferred species to eat. However, it should only be eaten in moderation as all ferns contain varying amounts of carcinogenic compounds. Native/Non-native: Native Status: Very common."}]