[{"url": "https://en.wikipedia.org/wiki/Humanistic_psychology", "passage_text": "Its principal professional organizations in the U.S. are the Association for Humanistic Psychology and the Society for Humanistic Psychology (Division 32 of the American Psychological Association). In Britain there is the UK Association for Humanistic Psychology Practitioners. One of humanistic psychology's early sources was the work of Carl Rogers, who was strongly influenced by Otto Rank, who broke with Freud in the mid-1920s."}, {"url": "https://en.wikipedia.org/wiki/Humanistic_psychology", "passage_text": "In the 20th century humanistic psychology was referred to as the third force in psychology, distinct from earlier, even less humanistic approaches of psychoanalysis and behaviorism. One of humanistic psychology's early sources was the work of Carl Rogers, who was strongly influenced by Otto Rank, who broke with Freud in the mid-1920s."}, {"url": "http://www.merriam-webster.com/dictionary/humanism", "passage_text": "Full Definition of HUMANISM. 1. a: devotion to the humanities: literary culture b: the revival of classical letters, individualistic and critical spirit, and emphasis on secular concerns characteristic of the Renaissance. 2. : humanitarianism. 3. 3. : a doctrine, attitude, or way of life centered on human interests or values; especially: a philosophy that usually rejects supernaturalism and stresses an individual's dignity and worth and capacity for self-realization through reason."}, {"url": "http://www.answers.com/Q/What_is_humanistic_tradition", "passage_text": "Making the world better, one answer at a time. an emphasis on conscious awareness of needs, choice, and personal responsibility is one of the humanistic tradition approach to motivation. Humanistic psychologists emphasize the role of choice in human life, and the influence of responsibility on creating a meaningful and satisfying life. The meaning of any person's life, according to the humanistic approach, is found in the choices that people make and the responsibility they take for those choices. The humanistic tradition also emphasizes the human need for growth and realizing one's full potential. In the humanistic tradition it is assumed that, if left to their own devices, humans will grow and develop in positive and satisfying directions"}, {"url": "http://highered.mheducation.com/sites/0073523976/student_view0/index.html", "passage_text": "To access Connect Image Bank, enter your OLC log-in (your e-mail address and OLC password) on this site: http://connect.mcgraw-hill.com/imagebanksearch/login.ibs. You can also access Connect Image Bank through Connect Humanities for The Humanistic Tradition. Connect Humanities gives instructors the ability to assign activities to students and to assess how well they critically think about art with all the resources in one centralized location."}, {"url": "https://en.wikipedia.org/wiki/Humanism", "passage_text": "The meaning of the term humanism has fluctuated, according to the successive intellectual movements which have identified with it. Generally, however, humanism refers to a perspective that affirms some notion of human freedom and progress. Others, like the German philosopher Heidegger considered themselves humanists on the model of the ancient Greeks, but thought humanism applied only to the German race and specifically to the Nazis and thus, in Davies' words, were anti-humanist humanists."}, {"url": "http://americanhumanist.org/Humanism/What_is_Humanism", "passage_text": "Western Cultural Humanism is a good name for the rational and empirical tradition that originated largely in ancient Greece and Rome, evolved throughout European history, and now constitutes a basic part of the Western approach to science, political theory, ethics, and law. Secular and Religious Humanists both share the same worldview and the same basic principles. This is made evident by the fact that both Secular and Religious Humanists were among the signers of Humanist Manifesto I in 1933, Humanist Manifesto II in 1973, and Humanist Manifesto III in 2003."}, {"url": "https://en.wikipedia.org/wiki/Humanistic_psychology", "passage_text": "Humanistic psychology is a psychological perspective which rose to prominence in the mid-20th century in response to the limitations of Sigmund Freud 's psychoanalytic theory and B. F. Skinner 's behaviorism. One of humanistic psychology's early sources was the work of Carl Rogers, who was strongly influenced by Otto Rank, who broke with Freud in the mid-1920s."}, {"url": "https://en.wikipedia.org/wiki/Humanism", "passage_text": "Humanistic psychology is a psychological perspective which rose to prominence in the mid-20th century in response to Sigmund Freud 's psychoanalytic theory and B.F. Skinner 's Behaviorism. The approach emphasizes an individual's inherent drive towards self-actualization and creativity. Others, like the German philosopher Heidegger considered themselves humanists on the model of the ancient Greeks, but thought humanism applied only to the German race and specifically to the Nazis and thus, in Davies' words, were anti-humanist humanists."}, {"url": "https://en.wikipedia.org/wiki/Humanism", "passage_text": "Psychologists Carl Rogers and Abraham Maslow introduced a positive, humanistic psychology in response to what they viewed as the overly pessimistic view of psychoanalysis in the early 1960s. Other sources include the philosophies of existentialism and phenomenology. Others, like the German philosopher Heidegger considered themselves humanists on the model of the ancient Greeks, but thought humanism applied only to the German race and specifically to the Nazis and thus, in Davies' words, were anti-humanist humanists."}]