[{"url": "http://web.clark.edu/ggrey/chemstruct/organic/optical_isomers.htm", "passage_text": "OPTICAL ISOMERS. Optical isomerism in organic chemistry is more important than just more structures. Living systems are all chemical systems and many of the most important molecules such systems depend on have optical isomers. "}, {"url": "http://www.chem.purdue.edu/gchelp/cchem/opti.html", "passage_text": "Molecules or ions that exist as optical isomers are called chiral. Not all coordination compounds have optical isomers. = C = H = F = Cl = Br The Two Enantiomers of CHBrClFNote that the molecule on the right is the reflection of the molecule on the left (through the mirror plane indicated by the black vertical line). These two structures are non-superimposable and are, therefore, different compounds. "}, {"url": "http://www.wiredchemist.com/chemistry/instructional/an-introduction-to-chemistry/structure/geometric-and-optical-isomers", "passage_text": "On the molecular scale, most optical isomers are organic compounds, and they have non superimposable mirror images when there are four different groups on a carbon (the carbon is said to be chiral, from the Greek meaning handed). Amino acids are good examples of molecules that have nonsuperimposable mirror images. "}, {"url": "http://www.chem.purdue.edu/gchelp/cchem/opti.html", "passage_text": "Optical isomers are two compounds which contain the same number and kinds of atoms, and bonds (i.e., the connectivity between atoms is the same), and different spatial arrangements of the atoms, but which have non-superimposable mirror images. Each non-superimposable mirror image structure is called an enantiomer. Note that the molecule on the right is the reflection of the molecule on the left (through the mirror plane indicated by the black vertical line). These two structures are non-superimposable and are, therefore, different compounds."}, {"url": "http://encyclopedia2.thefreedictionary.com/isomerism", "passage_text": "whereas fumaric acid does not yield an anhydride. Optical isomerism is characteristic of organic molecules that do not have a plane of symmetry (a plane dividing the molecule into two mirror images) and are not coincident with its mirror image (that is, with a molecule corresponding to the mirror image). "}, {"url": "http://www.compoundchem.com/2014/05/22/typesofisomerism/", "passage_text": "There are other ways in which optical isomerism can be exhibited, but this is the simplest. The Importance of Isomerism. As previously mentioned, isomers of the same molecule have the potential to have different physical or chemical properties. These differences can have some important implications. Functional Isomers. Also referred to as functional group isomers, these are isomers where the molecular formula remains the same, but the type of functional group in the atom is changed. This is possible by rearranging the atoms within the molecule so that they’re bonded together in different ways."}, {"url": "https://en.wikipedia.org/wiki/Optical_isomer", "passage_text": "Conversely, an achiral object, such as an atom, is symmetric; its mirror image is not truly opposite, but rather is indistinguishable from the original. In chemistry, chirality usually refers to molecules. Two mirror images of a chiral molecule are called enantiomers or optical isomers. Pairs of enantiomers are often designated as  right-  and left-handed. A molecule is achiral (not chiral) when an improper rotation, that is a combination of a rotation and a reflection in a plane, perpendicular to the axis of rotation, results in the same molecule. For tetrahedral molecules, the molecule is chiral if all four substituents are different."}, {"url": "http://www.creative-chemistry.org.uk/molecules/optical.htm", "passage_text": "Optical isomerism is an example of stereo-isomerism. It occurs when substances have the same molecular and structural formulae, but one cannot be superimposed on the other. Put simply, they are mirror images of each other (see the diagram on the right). Optical isomers can occur when there is an asymmetric carbon atom. An asymmetric carbon atom is one which is bonded to four different groups. The groups can be something hideously complex, or something comfortably simple like a hydrogen or chlorine atom."}, {"url": "http://chemguide.co.uk/basicorg/isomerism/optical.html", "passage_text": "STEREOISOMERISM-OPTICAL ISOMERISM. Optical isomerism is a form of stereoisomerism. This page explains what stereoisomers are and how you recognise the possibility of optical isomers in a molecule. A solution of one enantiomer rotates the plane of polarisation in a clockwise direction. This enantiomer is known as the (+) form. For example, one of the optical isomers (enantiomers) of the amino acid alanine is known as (+)alanine. A solution of the other enantiomer rotates the plane of polarisation in an anti-clockwise direction. This enantiomer is known as the (-) form"}]