[{"url": "http://www.academicinvest.com/science-careers/biology-careers/how-to-become-a-microbiologist", "passage_text": "If you want to become a microbiologist that works in an entry-level research job such as laboratory assistant, you typically need a bachelor’s degree in biology or a related program. If you want to work as a senior-level researcher, you will need to have a graduate degree in microbiology. Microbiologist Salary United States: According to the United States Bureau of Labor Statistics, workers in the Microbiologists occupational group earn a median salary of $65,920 per year. The lowest 10 percent earned less than $39,180 and the top 10 percent earned more than $115,7"}, {"url": "http://www.academicinvest.com/science-careers/biology-careers/how-to-become-a-microbiologist", "passage_text": "If you want to become a microbiologist, you first need to determine if this career path is a good fit for you. Microbiologist Salary United States: According to the United States Bureau of Labor Statistics, workers in the Microbiologists occupational group earn a median salary of $65,920 per year. The lowest 10 percent earned less than $39,180 and the top 10 percent earned more than $115,7"}, {"url": "http://www.bls.gov/ooh/life-physical-and-social-science/microbiologists.htm", "passage_text": "Microbiologists study the growth and characteristics of microscopic organisms such as viruses. A bachelor’s degree in microbiology or a closely related field is needed for entry-level microbiologist jobs. A Ph.D. is typically needed to carry out independent research and to work in colleges and universities. Microbiologists typically need a Ph.D. to carry out independent research and work in colleges and universities. Graduate students studying microbiology commonly specialize in a subfield such as bacteriology or immunology."}, {"url": "http://learn.org/articles/Microbiology_How_to_Become_a_Microbiologist_in_5_Steps.html", "passage_text": "If you become a microbiologist, you may isolate organism cultures and classify the types of organisms found in soil, water and living hosts. You might also observe how organisms interact with each other and with living plant and animal tissue, as well as analyze the relationship between organisms and disease. Step 1: Earn a High School Diploma. If want to study microbiology, concentrate your high school course selections in the natural sciences, such as biology, chemistry and physics. Courses in English and mathematics are helpful as well."}, {"url": "http://study.com/articles/Become_a_Microbiology_Scientist_Step-by-Step_Career_Guide.html", "passage_text": "Step 1: Earn a Bachelor's Degree. Aspiring microbiology scientists are required to earn at least a bachelor's degree in microbiology or a closely related field. Microbiologists need a solid foundation of the sciences. Microbiology majors take courses such as microbial physiology, virology, chemistry, biochemistry, and physics. "}, {"url": "http://www.ehow.com/how_2104009_become-microbiologist.html", "passage_text": "Wavebreakmedia Ltd/Wavebreak Media/Getty Images. Microbiologists work to understand and find ways to use microorganisms, such as viruses, algae, bacteria and parasites, that can't be seen with the naked eye. They may specialize in one type of microorganism, such as bacteria or viruses, or in a particular setting, like clinical centers or industry. Although candidates can start working with a minimum of a bachelor's degree, microbiologists typically need extensive experience in laboratory settings."}, {"url": "http://www.mypursuit.com/careers-19-1022.00/Microbiologist.html", "passage_text": "It is never too early to start the process of building a microbiologist career. An interest in things around you would have shown in childhood and later, in high school, taking the right subjects such as biology, physics, chemistry and math is the direction to go. A bachelor's degree in microbiology or alternatively, biology is the next step in college. Programs would include computer science, statistics and laboratory work. A bachelor's degree would be a portal to finding work as a research or laboratory assistant."}, {"url": "http://learn.org/articles/Microbiology_How_to_Become_a_Microbiologist_in_5_Steps.html", "passage_text": "How to Become a Microbiologist in 5 Steps. Explore the career requirements for microbiologists. Get the facts about education and licensure requirements, salary, and potential job growth to determine if this is the right career for you. Schools offering Biology degrees can also be found in these popular choices. Step 1: Earn a High School Diploma. If want to study microbiology, concentrate your high school course selections in the natural sciences, such as biology, chemistry and physics. Courses in English and mathematics are helpful as well."}, {"url": "http://www.bls.gov/ooh/life-physical-and-social-science/microbiologists.htm", "passage_text": "How to Become a Microbiologist. A bachelor’s degree in microbiology or a closely related field is needed for entry-level microbiologist jobs. A Ph.D. is typically needed to carry out independent research and to work in colleges and universities. Microbiologists typically need a Ph.D. to carry out independent research and work in colleges and universities. Graduate students studying microbiology commonly specialize in a subfield such as bacteriology or immunology."}]