[{"url": "http://www.answers.com/Q/What_can_be_done_to_stop_environmental_problems_caused_by_fossil_fuels", "passage_text": "For the problems already happening due to fossil fuels little can be done. Carbon capture technologies are very limited in there scale of application. Even large scale techniques such as algae farms will put a very small dint in the effects."}, {"url": "http://education.seattlepi.com/list-ways-reduce-use-fossil-fuels-3725.html", "passage_text": "Nearly 85 percent of the U.S. energy supply comes from fossil fuels such as coal, natural gas and oil. Fossil fuels take millions of years to form and are thus considered to be nonrenewable."}, {"url": "http://www.answers.com/Q/How_do_you_stop_fossil_fuel_pollution", "passage_text": "Burning fossil fuels relea … ses a greenhouse gas, carbon dioxide, that is causing global warming. To stop burning fossil fuels we have to change to renewable energy (solar, wind, water, hydro, tidal and wave, geothermal, ocean thermal, biomass, biofuel and hydrogen). + 10 others found this useful."}, {"url": "http://www.educationscotland.gov.uk/weatherandclimatechange/energy/fossilfuels.asp", "passage_text": "Over millions of years these remains become the carbon-rich coal, oil and gas we can use as fuel. When fossil fuels are burned they release carbon dioxide into the atmosphere which contributes to global warming. Using fossil fuels to generate energy also releases pollutants into the atmosphere-such as sulphur dioxide."}, {"url": "http://www.answers.com/Q/What_can_be_done_to_stop_environmental_problems_caused_by_fossil_fuels", "passage_text": "Burning fossil fuels relea … ses a greenhouse gas, carbon dioxide, that is causing global warming. To stop burning fossil fuels we have to change to renewable energy (solar, wind, water, hydro, tidal and wave, geothermal, ocean thermal, biomass, biofuel and hydrogen). 11 people found this useful."}, {"url": "http://www.wikihow.com/Conserve-Fossil-Fuels", "passage_text": "Fossil fuels are materials that are non-renewable such as oil, gas and coal. Aside from causing local air pollution from polluting particulates, the burning of fossil fuels releases carbon dioxide into the atmosphere, which is a greenhouse gas that contributes to climate change."}, {"url": "http://www.ecy.wa.gov/climatechange/whatucando.htm", "passage_text": "What you can do tips from the EPA. Public Transportation... Renewable Energy... We burn fossil fuels such as gasoline, oil, coal, and natural gas to run our vehicle engines and to heat and light our homes. Burning fossil fuels increases the amount of carbon dioxide (CO 2) in the atmosphere."}]