[{"url": "http://www.enotes.com/homework-help/what-does-vacuol-do-289222", "passage_text": "(Answer #1). A vacuole is a cell organelle; is it basically a membranous bag filled with fluids. Vacuoles store water and certain materials that are water-soluble. They are present in all plant and fungi cells. They are also found in some species of bacteria and in some animal cells. In plants and fungi, vacuoles store water and some pigments, and they also provide turgor pressure to support the cells from within."}, {"url": "http://www.brighthub.com/science/genetics/articles/27422.aspx", "passage_text": "Animal cell vacuoles are much smaller than their plant cell counterparts and in animal cells their roles are more subservient. They assist in expelling proteins and lipids from the cell. The process is known as exocytosis and the role of the vacuole here is to store the molecules and facilitate their transport. Most of a cell's volume depends on what's inside a vacuole. If there isn't much water about the vacuoles shrink and the plant droops and whithers. When there is abundance of water the vacuoles are topped up once again and the plant regains its normal structure."}, {"url": "http://kids.britannica.com/comptons/article-234337/cell", "passage_text": "Plant cells have a large central vacuole that stores water and other materials. Vacuoles are storage organelles that usually carry food molecules or wastes in solution. Plant cells have a large central vacuole that stores water and other materials. The central vacuole helps the cell maintain its volume and structure. The central vacuole in some cells plays a role in building stalks and stems. If a cambium cell is to become bark or wood, its membrane."}, {"url": "http://www.answers.com/Q/What_does_a_vacuole_do_in_an_animal_cell", "passage_text": "Vacuoles in animal cells store food, water, waste, and minerals like plant cells. The only difference is that plant cells have larger vacuoles than animal cells. the vacuole cell is in plants (edit) The vacuole is not a cell, but it is found within both the plant and animal cells. The vacuole is an organelle that can be found in both … plant cells and animal cells, and have different functions for each. Answered. In Zoology or Animal Biology."}, {"url": "http://www.answers.com/Q/What_does_a_vacuole_do_in_an_animal_cell", "passage_text": "Plant cells have one large vacuole, which plays an important role in the rigidity and turgor pressure of the cell. Animal cells do not need the same kind of function from th … eir vacuoles, so the size and number of vacuoles in different cells will differ (depending on the type of cell). the vacuole cell is in plants (edit) The vacuole is not a cell, but it is found within both the plant and animal cells. The vacuole is an organelle that can be found in both … plant cells and animal cells, and have different functions for each. Answered. In Zoology or Animal Biology."}, {"url": "http://bscb.org/learning-resources/softcell-e-learning/vacuole-plants/", "passage_text": "Quick look: A vacuole is a membrane-enclosed fluid filled sac found in the cells of plants including fungi. Vacuoles can be large organelles occupying between 30% and 90% of a cell by volume. Vacuoles appear to have three main functions, they: Vacuoles and lysosomes have similar functions. Vacuoles in plant cells are in some respects the equivalent of lysosomes in animal cells. The environment inside a vacuole is slightly acid (pH about 5.0) whilst for the rest of the cytosol it is slightly alkaline (about pH 7.2)."}, {"url": "http://micro.magnet.fsu.edu/cells/plants/vacuole.html", "passage_text": "Many plant cells have a large, single central vacuole that typically takes up most of the room in the cell (80 percent or more). Vacuoles in animal cells, however, tend to be much smaller, and are more commonly used to temporarily store materials or to transport substances. "}, {"url": "http://biology.about.com/od/plantbiology/ss/vacuole.htm", "passage_text": "A vacuole is a cell organelle found in a number of different cell types. Vacuoles are fluid-filled, enclosed structures that are separated from the cytoplasm by a single membrane. They are found mostly in plant cells and fungi. However, some protist, animal cells, and bacteria also contain vacuoles."}, {"url": "http://www.answers.com/Q/What_do_vacuoles_do_in_plant_cells", "passage_text": "A vacuole is a membrane-bound sac that plays roles in intracellular digestion and the release of cellular waste products. In animal cells, vacuoles are generally small. Vacu … oles tend to be large in plant cells and play a role in turgor pressure. When a plant is well-watered, water collects in cell vacuoles producing rigidity in the plant. Without sufficient water, pressure in the vacuole is reduced and the plant wilts. The Vacuole of a plant cell storage water for the cell the use when the cell needs it It helps digest all of the waste that the plant eats. expel waste products, just like … the vacuole in other cells    It stores water and wastes."}]