[{"url": "http://www.webmd.com/digestive-disorders/gallstones", "passage_text": "Gallstones are pieces of solid material that form in the gallbladder. These stones develop because cholesterol and pigments in bile sometimes form hard particles. The two main types of gallstones are: 1  Cholesterol stones: Usually yellow-green in color, approximately 80% of gallstones are cholesterol stones."}, {"url": "http://www.webmd.com/digestive-disorders/gallstones", "passage_text": "Gallstones can form when there is an imbalance in the substances that make up bile. For instance, cholesterol stones may develop as a result of too much cholesterol in the bile. Another cause may be the inability of the gallbladder to empty properly."}, {"url": "http://www.niddk.nih.gov/health-information/health-topics/digestive-diseases/gallstones/Pages/facts.aspx", "passage_text": "The gallbladder can develop a single large gallstone, hundreds of tiny stones, or both small and large stones. Gallstones can cause sudden pain in the upper right abdomen. This pain, called a gallbladder attack or biliary colic, occurs when gallstones block the ducts of the biliary tract."}, {"url": "http://www.medicalnewstoday.com/articles/153981.php", "passage_text": "Gallstones are stones or lumps that develop in the gallbladder or bile duct when substances in there harden. Some of the chemicals which exist in the gallbladder, such as cholesterol, calcium bilirubinate, and calcium carbonate, solidify into either one large stone or several small ones."}, {"url": "http://www.medicinenet.com/gallstones/page2.htm", "passage_text": "Gallstones (often misspelled as gall stones, or gall stone) are stones that form in the gall (bile) within the gallbladder. (The gallbladder is a pear-shaped organ just below the liver that stores bile secreted by the liver.)."}, {"url": "https://en.wikipedia.org/wiki/Gallstone", "passage_text": "Lithiasis (stone formation) in the gallbladder is called cholelithiasis. Gallstones are formed in the gallbladder but may pass distally into other parts of the biliary tract such as the cystic duct, common bile duct, pancreatic duct or the ampulla of Vater."}, {"url": "http://www.mayoclinic.org/diseases-conditions/gallstones/basics/definition/CON-20020461", "passage_text": "Gallstones are hardened deposits of digestive fluid that can form in your gallbladder. Your gallbladder is a small, pear-shaped organ on the right side of your abdomen, just beneath your liver. The gallbladder holds a digestive fluid called bile that's released into your small intestine."}, {"url": "http://www.healthline.com/health/gallstones", "passage_text": "Many people can develop gallstones and never know it. Gallstones are hard deposits in your gallbladder, a small organ that stores bile, a digestive fluid made in the liver. Gallstones may consist of cholesterol, salt, or bilirubin, which are discarded red blood cells."}, {"url": "http://www.niddk.nih.gov/health-information/health-topics/digestive-diseases/gallstones/Pages/facts.aspx", "passage_text": "Gallstones are hard particles that develop in the gallbladder. The gallbladder is a small, pear-shaped organ located in the upper right abdomen—the area between the chest and hips—below the liver. Gallstones can range in size from a grain of sand to a golf ball."}]