[{"url": "http://www.google.com/patents/WO2012028196A1?cl=en", "passage_text": "The term unconventional infectious agent according to the invention refers to distinctive, transmissible infectious agents that do not fit the classic definition of viruses or bacteria or funghi. One such unconventional infectious agent is the non-viral proteinaceous, infectious particle, or prion. The products which are obtainable by reacting an alkyl propylenediamine corresponding to formula (I) with glutamic acid or glutamic acid derivatives corresponding to formula (II) are known as glucoprotamin®."}, {"url": "http://www.floridahealth.gov/diseases-and-conditions/disease-reporting-and-management/disease-reporting-and-surveillance/_documents/gsi-cjd.pdf", "passage_text": "BSE. Recent cases of variant CJD in the United Kingdom show that transmission of this. disease can occur through blood transfusion. However, other human prion diseases are not. known to be transmitted by transfusions. Prion diseases of humans are not transmitted. through casual or intimate person-to-person contact. The incubation period for the few prion diseases with known sources (i.e., variant CJD, iatrogenically-acquired prion disease) is variable and extremely long, on the order of years. to decades."}, {"url": "https://en.wikipedia.org/wiki/Prion", "passage_text": "While the infectious agent was named a prion, the specific protein that the prion was composed of is also known as the Pr ion P rotein (PrP), though this protein may occur both in infectious and non-infectious forms. Prusiner won the Nobel Prize in Physiology or Medicine in 1997 for his research into prions. If a prion enters a healthy organism, it induces existing, properly folded proteins to convert into the misfolded prion form. In this way, the prion acts as a template to guide the misfolding of more proteins into"}, {"url": "https://en.wikipedia.org/wiki/Prion", "passage_text": "Prions are not considered living organisms because they are misfolded protein molecules which may propagate by transmitting a misfolded protein state. If a prion enters a healthy organism, it induces existing, properly folded proteins to convert into the misfolded prion form. In this way, the prion acts as a template to guide the misfolding of more proteins into prion form."}, {"url": "http://medical-dictionary.thefreedictionary.com/prion", "passage_text": "prion. any of several pathogenic, transmissible forms of the core of prion protein that cause a group of degenerative diseases of the nervous system known as prion diseases. Prions have a structure different from that of normal prion protein, lack detectable nucleic acid, and do not elicit an immune response. prion disease any of a group of fatal degenerative diseases of the nervous system caused by abnormalities in the metabolism of prion protein. /pri·on/ (pri´on) any of several transmissible forms of the core of prion protein that cause a group of neurodegenerative diseases. Prions differ in structure from normal prion protein, lack detectable nucleic acid, and do not elicit an immune response."}, {"url": "http://medical-dictionary.thefreedictionary.com/prion", "passage_text": "In 1982 he and his colleagues isolated a protein that was capable of transmitting infection but, unlike all other known pathogens, contained neither DNA nor RNA. Prusiner's term for this protein, prion, was derived from the phrase proteinaceous infectious particle. /pri·on/ (pri´on) any of several transmissible forms of the core of prion protein that cause a group of neurodegenerative diseases. Prions differ in structure from normal prion protein, lack detectable nucleic acid, and do not elicit an immune response."}, {"url": "https://en.wikipedia.org/wiki/Prion", "passage_text": "The word prion, coined in 1982 by Stanley B. Prusiner, is short for “proteinaceous infectious particle” derived from the words protein and infection, in reference to a prion's ability to self-propagate and transmit its conformation to other prions. If a prion enters a healthy organism, it induces existing, properly folded proteins to convert into the misfolded prion form. In this way, the prion acts as a template to guide the misfolding of more proteins into"}, {"url": "https://en.wikipedia.org/wiki/Prion", "passage_text": "These refolded prions can then go on to convert more proteins themselves, leading to a chain reaction resulting in large amounts of the prion form. All known prions induce the formation of an amyloid fold, in which the protein polymerises into an aggregate consisting of tightly packed beta sheets. If a prion enters a healthy organism, it induces existing, properly folded proteins to convert into the misfolded prion form. In this way, the prion acts as a template to guide the misfolding of more proteins into"}, {"url": "http://creation.com/prions-and-evolution", "passage_text": "The word ‘prion’ is a combination of ‘ pr otein’ and ‘infect ion ’. A prion is essentially an abnormally folded protein. The many sophisticated molecular machines in our bodies are proteins—for example, insulin, RNA polymerase, hemoglobin, and more, maybe 100,000 or more different ones. But in all known viruses, this program is in the form of RNA or DNA, part of the normal ‘language of life’. Prions have neither machinery to replicate themselves, nor code to hijack the machinery of the cell."}]