[{"url": "http://smallbusiness.chron.com/calculate-cost-debt-40519.html", "passage_text": "Step 6. Multiply the annual dollar cost of your debt by the number of years of your debt agreement. If your annual dollar cost is $4,000 and you have a loan agreement in place for 10 years, the total cost of your debt will be $4,000 times 10 years, or $40,000. "}, {"url": "http://answers.microsoft.com/en-us/office/forum/office_2003-excel/i-need-to-find-and-calculate-wacc-using-data-from/5c44c4b0-884f-4bd8-8514-e08fb12cccec", "passage_text": "AM. AM. The cost of common equity is 15%, the before tax cost of debt is 12% and no preferred stock. On the balance sheet long term debt is $2,304, Equity is 3,456 and total assets is $5,760. What is the WACC formula for this and how do I calculate WACC. "}, {"url": "http://www.youtube.com/watch?v=3GANmCpuNTg", "passage_text": "• A calculation of a firm's cost of capital in which each category of capital is proportionately weighted. All capital sources-common stock, preferred stock, bonds and any other long-term debt-are included in a WACC calculation. • WACC is calculated by multiplying the cost of each capital component by its proportional weight and then summing. T = corporate tax rate. For example, if the market value of a company's equity is Rs.6000 Crore and. it has Rs. 4000 crores of debt on its balance sheet, then 60% of its capital is equity. and 40% is debt. If the company's cost of equity is 10% and its cost of debt is."}, {"url": "http://bizfinance.about.com/od/cost-of-capital/qt/calculate-the-cost-debt-capital.htm", "passage_text": "The cost of debt is usually based on the cost of the company's bonds. Bonds are a company's long-term debt and are little more than the company's long-term loans. The cost of newly issued bonds is the best rate to use if possible when calculating the cost of debt. "}, {"url": "http://www.investopedia.com/terms/c/costofdebt.asp", "passage_text": "DEFINITION of 'Cost Of Debt'. The effective rate that a company pays on its current debt. This can be measured in either before-or after-tax returns; however, because interest expense is deductible, the after-tax cost is seen most often. This is one part of the company's capital structure, which also includes the cost of equity. To get the after-tax rate, you simply multiply the before-tax rate by one minus the marginal tax rate (before-tax rate x (1-marginal tax)). If a company's only debt were a single bond in which it paid 5%, the before-tax cost of debt would simply be 5%. If, however, the company's marginal tax rate were 40%, the company's after-tax cost of debt would be only 3% (5% x (1-40%))"}, {"url": "http://www.investopedia.com/ask/answers/063014/what-formula-calculating-weighted-average-cost-capital-wacc.asp", "passage_text": "Weighted average cost of capital (WACC) is the average after-tax cost of a company’s various capital sources, including common stock, preferred stock, bonds and any other long-term debt. A company has two primary sources of financing-debt and equity-and, in simple terms, WACC is the average cost of raising that money. "}, {"url": "http://wps.aw.com/wps/media/objects/222/227412/ebook/ch10/chapter10.pdf", "passage_text": "In the final range, the increase in the long-term debt cost to 8.4% isintroduced.The weighted average costs of capital (WACC) for the three ranges are sum-marized in the table shown at the bottom of Figure 10.1. Calculate the cost of each source of financing, as specified:(1) Long-term debt, first $450,000.(2) Long-term debt, greater than $450,000.(3) Preferred stock, all amounts.(4) Common stock equity, first $1,500,000.(5) Common stock equity, greater than $1,500,000."}, {"url": "http://www.exinfm.com/board/weighted_average_cost_of_capital.htm", "passage_text": "Current Capital Structure consists three components: Long-term Debt (10 year A Bonds) with a book value of $ 400,000 and a cost of capital of 6.0%. Common Stock with a book value of $ 200,000 and a cost of capital of 18.0%. Retained Earnings with a book value of $ 50,000 and a cost of capital of 16.0%. "}]