[{"url": "http://www.cprcertificationtrainingonline.com/does-cpr-stand-for/", "passage_text": "The answer to “what does CPR stand for?” is that it’s a lifesaving technique that combines manually pumping the victim’s heart along with breath resuscitation. Without CPR, victims that suffer from cardiac arrest outside of a hospital have little hope. When CPR is properly performed it stimulates up to 40% of normal circulation, which may be the window of hope that saves the victim’s life as you wait for an medical emergency response team."}, {"url": "https://en.wikipedia.org/wiki/Cardiopulmonary_resuscitation", "passage_text": "Cardiopulmonary resuscitation, commonly known as CPR, is an emergency procedure performed in an effort to manually preserve intact brain function until further measures are taken to restore spontaneous blood circulation and breathing in a person who is in cardiac arrest. According to the International Liaison Committee on Resuscitation guidelines, CPR involves chest compressions at least 5 cm (2 in) deep and at a rate of at least 100 per minute in an effort to create artificial circulation by manually pumping blood through the heart and thus the body."}, {"url": "http://www.cprcertificationtrainingonline.com/does-cpr-stand-for/", "passage_text": "CPR stands for cardiopulmonary resuscitation. It is a lifesaving technique that greatly increases the survival rate of cardiac arrest victims. It is a rescue and lifesaving technique that each individual should know. Without CPR, victims that suffer from cardiac arrest outside of a hospital have little hope. When CPR is properly performed it stimulates up to 40% of normal circulation, which may be the window of hope that saves the victim’s life as you wait for an medical emergency response team."}, {"url": "http://www.ehow.com/about_4571090_what-does-cpr-stand.html", "passage_text": "Significance. CPR is an important way to keep a victim's organs alive immediately after a heart attack or another event, such as drowning, that can cause a person to stop breathing. During such an event, a victim's blood will stop circulating, and oxygen will not get to organs, particularly the brain. CPR is an emergency procedure in which a medical professional or Good Samaritan gets the heart and lungs of a victim working again by compressing the chest by hand and forcing air into the lungs. Other People Are Reading."}, {"url": "http://www.ivyroses.com/Sports/Injuries/What-does-CPR-stand-for.php", "passage_text": "CPR stands for cardiopulmonary resuscitation. That is, C ardio. - which refers to the heart. whose main function is to pump blood around the body. P ulmonary. - which refers to the lungs. The CPR techniques demonstrated in the following First Aid videos have been made available on the internet via YouTube. They demonstrate methods of how to do CPR on human adults. Different advice and training videos are available for children, babies and pets (dogs and cats)."}, {"url": "http://blog.procpr.org/cpr-what-does-it-stand-for", "passage_text": "CPR: Many of us know that it stands for cardiopulmonary resuscitation; a procedure that increases the survival rate of victims of cardiac arrest substantially. Without CPR, many would only be able to stand helplessly by while a loved one or stranger dies, but with CPR, there is hope for the person recovering and living. Stepping in and skillfully administering the lifesaving method that is CPR is one of the greatest things you can do for someone."}, {"url": "http://www.cprcertificationtrainingonline.com/does-cpr-stand-for/", "passage_text": "Resuscitation. The final R, in CPR, stands for resuscitation, which means restoring life of someone who appears to be dead. When your heart stops, your lungs stop receiving the oxygen they require. Without CPR, victims that suffer from cardiac arrest outside of a hospital have little hope. When CPR is properly performed it stimulates up to 40% of normal circulation, which may be the window of hope that saves the victim’s life as you wait for an medical emergency response team."}, {"url": "https://www.firstaidae.com.au/what-does-cpr-stand-for/", "passage_text": "We’ve all heard about it but what does CPR actually stand for? CPR stands for C ardio P ulmonary R esuscitation and is one of the fundamental techniques used in first aid to resuscitate. It is also one of the most important techniques to get right which is why we put so much importance into our CPR Training courses and CPR refresher courses. "}, {"url": "http://www.ehow.com/about_4571090_what-does-cpr-stand.html", "passage_text": "Shares & Saves. Save. CPR is an acronym that stands for cardiopulmonary resuscitation. CPR is an emergency procedure in which a medical professional or Good Samaritan gets the heart and lungs of a victim working again by compressing the chest by hand and forcing air into the lungs. Other People Are Reading."}]