[{"url": "http://www.projectswole.com/flexibility/what-is-ballistic-stretching/", "passage_text": "Before we really get into ballistic stretching, you should take a minute to learn more about the basics of flexibility training. Ballistic stretching is probably the most dangerous form of flexibility training you can use, but when done properly can significantly increase your range of motion (ROM). This is a very advanced form of flexibility training that is not considered very useful due to the potential for injury. "}, {"url": "http://www.tryingfitness.com/ballistic-stretching-dangerous-or-not/", "passage_text": "I personally don’t like ballistic stretching. I don’t feel that it is effective as a static or dynamic stretch. I also agree that ballistic stretching is more likely to cause injury. Anyone preforming a ballistic stretch should be very aware of their body capable of doing and not doing. I was curious to find out more about ballistic stretching and how it is different from dynamic and static stretching. What I've learned is that ballistic stretching involves bouncing and quick jerking motions. You are essentially stretching your muscles beyond their normal range of motion. For example, if you were to bend and touch your toes, you would also add some bounc"}, {"url": "https://en.wikipedia.org/wiki/Ballistic_stretching", "passage_text": "Ballistic stretching is a form of passive stretching or dynamic stretching in a bouncing motion. According to the American Academy of Orthopedic Surgeons; Do not bounce your stretches. "}, {"url": "http://www.bath.ac.uk/~masrjb/Stretch/stretching_4.html", "passage_text": "Ballistic stretching uses the momentum of a moving body or a limb in an attempt to force it beyond its normal range of motion. This is stretching, or warming up, by bouncing into (or out of) a stretched position, using the stretched muscles as a spring which pulls you out of the stretched position. A full session of isometric stretching makes a lot of demands on the muscles being stretched and should not be performed more than once per day for a given group of muscles (ideally, no more than once every 36 hours)."}, {"url": "http://www.tryingfitness.com/ballistic-stretching-dangerous-or-not/", "passage_text": "0 0 0 0 0 0. I was curious to find out more about ballistic stretching and how it is different from dynamic and static stretching. What I've learned is that ballistic stretching involves bouncing and quick jerking motions. You are essentially stretching your muscles beyond their normal range of motion. For example, if you were to bend and touch your toes, you would also add some bouncing"}, {"url": "http://www.weegy.com/?ConversationId=OZ1TF90E", "passage_text": "User: Ballistic stretching is dangerous and should NOT be performed. true or falseWeegy: False. Ballistic stretching should only be used by athletes who know their own limitations and with supervision by their trainer. jeifunk|Points 13282|User: A lack of flexibility is a risk factor for athletic injuries. true or falseWeegy: TRUE. A lack of flexibility is a risk factor for athletic injuries"}, {"url": "http://pne.browardschools.com/teachers/pne_wendy_wood/Downloads/Fit10%20Flexibility.pdf", "passage_text": "Vocabulary-Define the following Static Stretching-Dynamic Stretching-Study\u2029Questions True\u2029­\u2029False\u2029­ Circle “T” for true statements and “F” for false. T F 1. Individuals\u2029with\u2029good\u2029flexibility\u2029are\u2029less\u2029likely\u2029to\u2029be\u2029injured.\u2029T F 2. When\u2029doing\u2029flexibility\u2029exercises,\u2029you\u2029should\u2029bounce\u2029as\u2029hard\u2029as\u2029you\u2029can.\u2029T F 3. ... Dynamic stretching involves moving joints through their full range of motion, but is done in a continuous, slow and controlled manner. This method of stretching should not be confused with ballistic or bouncing types of stretching, where motion is done very rapidly."}, {"url": "http://www.healthline.com/health/ballistic-stretching-it-safe", "passage_text": "This intense stretching method uses bouncing movements to push your body beyond its normal range of motion. Whereas static stretches are performed slowly and gradually, the ballistic method stretches muscles much farther and faster. You can do many of the same stretches as ballistic or static stretches. For example, the ballistic method of touching your toes would be to bounce and jerk towards your feet. People often confuse ballistic stretching with dynamic stretching. While both techniques involve movement during the stretch, they are different. While this type of stretching may be beneficial for athletes, it carries a risk of injury. Ballistic stretching is generally not recommended for everyday people who want to stay in shape or improve flexibility."}, {"url": "http://www.philly.com/philly/blogs/sportsdoc/Static-vs-dynamic-stretching.html", "passage_text": "Foam rolling: It can save you from pain. Dynamic stretching on the other hand is active stretching, stretching during controlled movements. It is not bouncing or ballistic stretching. Do not take a previously static stretch and turn it into a dynamic stretch by bouncing. Dynamic stretches are different and require movement but controlled movement. Performing dynamic stretching properly can have a significant benefit to your athletic performance."}]