[{"url": "http://www.pcmag.com/article2/0,2817,2407494,00.asp", "passage_text": "All you're deleting is the data from iCloud's backup. At the bottom of the screen, you'll see how much space you have available. Apple gives you 5GB of iCloud storage free. Of course, if you want to back up more, you can pay Apple for extra storage space, starting at $20 a year for an additional 10GB. 9."}, {"url": "https://discussions.apple.com/thread/4466326?start=0&tstart=0", "passage_text": "icloud does indeed backup your apps. Level 9 (62,675 points). Your iCloud backup does not include your apps, it includes your app data. It only notes the apps that were on your device at the time it was backed up so it can restore them to your device by redownloading them from the app store if they are still availalbe. Level 10 (92,020 points). The time it takes to back up for the first time depends on the how much is being backed up (you can find this from your back up settings) and how fast your connection is."}, {"url": "https://discussions.apple.com/thread/4466326?start=0&tstart=0", "passage_text": "iPad 2, iOS 6. Level 10 (92,020 points). The time it takes to back up for the first time depends on the how much is being backed up (you can find this from your back up settings) and how fast your connection is. Most people's upload speeds are around 1 Mbps and so 1 GB may take around 2 hrs 15 mins to upload. Level 1 (10 points)"}, {"url": "https://support.apple.com/en-us/HT203516", "passage_text": "An alert says I need a Wi-Fi connection to make a backup. You can set your iOS device to back up automatically each day with iCloud. iCloud makes these daily automatic backups only if: 1  Your device is connected to a power source. 2  Your device is connected to a Wi-Fi network. 3  Your device's screen is locked. If you need more iCloud storage to back up, a message will say that you can't back up because there's not enough iCloud storage available. Here are some tips if you're low on iCloud storage: 1  Upgrade your iCloud storage plan. 2  Make a smaller backup. 3  You can back up fewer apps or delete unwanted photos and videos"}, {"url": "https://support.apple.com/en-us/HT203977", "passage_text": "Back up automatically in iCloud. After you've turned on iCloud Backup, iCloud can automatically back up your device each day. iCloud makes these daily automatic backups only if: 1  Your device is connected to a power source. 2  Your device is connected to a Wi-Fi network. 3  Your device's screen is locked. 4  You have enough available space in iCloud for the backup. "}, {"url": "https://support.apple.com/en-us/HT203516", "passage_text": "You can set your iOS device to back up automatically each day with iCloud. iCloud makes these daily automatic backups only if: 1  Your device is connected to a power source. 2  Your device is connected to a Wi-Fi network. If you need more iCloud storage to back up, a message will say that you can't back up because there's not enough iCloud storage available. Here are some tips if you're low on iCloud storage: 1  Upgrade your iCloud storage plan. 2  Make a smaller backup. 3  You can back up fewer apps or delete unwanted photos and videos"}, {"url": "https://answers.yahoo.com/question/index?qid=20121025103354AAXYnMO", "passage_text": "Best Answer: iCloud backups are typically not very painful because they happen on the fly, as you bring data on your iDevice, so you end up only uploading reasonable amount of data in reasonable increments. However if you have a fairly full device, say 8GB of stuff, then the first backup will be very long. "}, {"url": "http://www.imore.com/how-restore-icloud-backup-iphone-and-ipad", "passage_text": "How to restore from your iCloud backup on a new iPhone or iPad. 1  After your iPhone or iPad powers on, you'll see a welcome screen, Slide your finger across the bottom where it says slide to set up. 2  Now choose your language from the choices presented to you. 3  Select the country or region you are in. "}, {"url": "http://forums.imore.com/iphone-5s/263177-icloud-restore-time.html", "passage_text": "Let me back up and review: 1. You got an iPhone 5S, plugged it in to iTunes and restored from a backup that was made on your iPhone 4S or you opted to restore from iCloud. If via iCloud, it can be a while depending on the amount of data it is restoring, but not 3 days. iTunes is quicker, and I can up and running in a matter of minutes. Originally Posted by Burnhamm I restored my iphone 5s from an icloud back up on Sunday to get all my stuff off of my 4s. Okay My question is how long should it take? That depends on how much data you have. There is no definitive restore time."}]