[{"url": "http://www.medicalnewstoday.com/articles/161547.php", "passage_text": "1 The cell walls of bacteria are mainly made up of polysaccharides (types of carbohydrate). 2  Cellulose (a type of carbohydrate) makes up most of plant cell walls. 3  Carbohydrates are linked to many proteins and lipids (fats), where they are vitally involved in cell interactions. Saccharides, or carbohydrates, are sugars or starches. Saccharides consist of two basic compounds: aldehydes (composed of double-bonded carbon and oxygen atoms, plus a hydrogen atom), and keytones (composed of double-bonded carbon and oxygen atoms, plus two additional carbon atoms)."}, {"url": "https://dlc.dcccd.edu/biology1-3/carbohydrates", "passage_text": "Monosaccharides consist of a carbon chain of three or more carbon atoms containing a hydroxyl group attached to every carbon except one. The lone carbon atom is double-bonded to an oxygen atom, and this carbonyl group may be in any position along the carbon chain. Plants synthesize two types of polysaccharides, starch and cellulose. The glycosidic bonds between glucose units in plant starch are similar to those in animal glycogen. Accordingly, starch molecules are structurally similar, forming compact coils, and play a similar role in energy storage for plants."}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/C/Carbohydrates.html", "passage_text": "Carbohydrates. Carbohydrates have the general molecular formula CH 2 O, and thus were once thought to represent hydrated carbon. However, the arrangement of atoms in carbohydrates has little to do with water molecules. Starch and cellulose are two common carbohydrates. Both are macromolecules with molecular weights in the hundreds of thousands. Both are polymers (hence  polysaccharides ); that is, each is built from repeating units, monomers, much as a chain is built from its links. "}, {"url": "http://www.scientificpsychic.com/fitness/carbohydrates.html", "passage_text": "Carbohydrates-Chemical Structure. Carbohydrates consist of the elements carbon (C), hydrogen (H) and oxygen (O) with a ratio of hydrogen twice that of carbon and oxygen. Carbohydrates include sugars, starches, cellulose and many other compounds found in living organisms. In their basic form, carbohydrates are simple sugars or monosaccharides. These simple sugars can combine with each other to form more complex carbohydrates. The combination of two simple sugars is a disaccharide."}, {"url": "http://www.apelslice.com/books/9780618843175NIMAS/HTMLOUT/HTML/c_id4605038.html", "passage_text": "Carbohydrates are used for structure and energy storage. Carbohydrates, such as cellulose, are made of sugars. Carbohydrates (KAHR-boh-HY-DRAYTS) provide the cell with energy. Simple carbohydrates are sugars made from atoms of carbon, oxygen, and hydrogen. Inside cells, sugar molecules are broken down. This process provides usable energy for the cell. Simple sugar molecules can also be linked into long chains to form more complex carbohydrates, such as starch, cellulose, and glycogen."}, {"url": "http://healthyeating.sfgate.com/description-difference-between-carbohydrates-proteins-lipids-nucleic-acids-7424.html", "passage_text": "Carbohydrates. Carbohydrates consist of single-sugar units called monosaccharides, double-monosaccharide units known as disaccharides and multiple-monosaccharide molecules that make up starches. The predominant purpose of the carbohydrates you eat is to provide fuel to your cells. "}, {"url": "http://www.rsc.org/Education/Teachers/Resources/cfb/carbohydrates.htm", "passage_text": "Carbohydrates Carbohydrates (also called saccharides) are molecular compounds made from just three elements: carbon, hydrogen and oxygen. Monosaccharides (e.g. glucose) and disaccharides (e.g. sucrose) are relatively small molecules. They are often called sugars. Other carbohydrate molecules are very large (polysaccharides such as starch and cellulose). Carbohydrates are: 1  a source of energy for the body e.g. glucose and a store of energy, e.g. starch in plants. 2  building blocks for polysaccharides (giant carbohydrates), e.g. cellulose in plants and glycogen in the human body."}, {"url": "http://www.answers.com/Q/What_do_carbohydrates_consist_of", "passage_text": "Carbohydrates are organic compounds, and chemically they consist of carbon, hydrogen and oxygen. Carbohydrates are your body's primary source for energy. Carbohydrates includ … e sugars, starches, and cellulose. Your body must break down carbohydrates in order to turn them into glucose. Starch (in rice, sago, wheat, other grains) is a polysaccharide. When we eat carbohydrates (mainly starch in grains, bread etc.), it is broken down into single molecules of glucose or other monosaccharide. Ultimately as a fuel it reaches into blood as glucose."}]