[{"url": "http://www.ehow.com/about_5221152_chondroitin_.html", "passage_text": "Definition. Chondroitin naturally occurs in the human body. It is a major component of cartilage, which helps to cushion the joints. Chondroitin helps produce new cartilage and stop enzymes from breaking cartilage down. Currently, the only way to add chondroitin to your system is through supplements."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/natural/744.html", "passage_text": "Chondroitin sulfate is a chemical that is normally found in cartilage around joints in the body. Chondroitin sulfate is manufactured from animal sources, such as cow cartilage."}, {"url": "http://www.arthritis.org/living-with-arthritis/treatments/natural/supplements-herbs/glucosamine-chondroitin-osteoarthritis.php", "passage_text": "Chondroitin is a major component of cartilage that helps it retain water. It is made by the body naturally. For production of supplements, it can be manufactured from the cartilage of animals, like cows, pigs or sharks, or it can be made in the laboratory. The supplement is sold as chondroitin sulfate."}, {"url": "https://nccih.nih.gov/research/results/gait/qa.htm", "passage_text": "Glucosamine and chondroitin sulfate are natural substances found in and around the cells of cartilage. Glucosamine is an amino sugar that the body produces and distributes in cartilage and other connective tissue, and chondroitin sulfate is a complex carbohydrate that helps cartilage retain water."}, {"url": "http://umm.edu/health/medical/altmed/supplement/chondroitin", "passage_text": "Chondroitin is a molecule that occurs naturally in the body. It is a major component of cartilage, the tough, connective tissue that cushions the joints. Commercial chondroitin comes from natural sources, such as shark and bovine cartilage, or synthetic production."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-744-CHONDROITIN%20SULFATE.aspx?activeIngredientId=744&activeIngredientName=CHONDROITIN%20SULFATE", "passage_text": "Chondroitin sulfate is a chemical that is normally found in cartilage around joints in the body. Chondroitin sulfate is manufactured from animal sources, such as cow cartilage. Chondroitin sulfate is used for osteoarthritis. It is often used in combination with other products, including manganese ascorbate, glucosamine sulfate, glucosamine hydrochloride, or N-acetyl glucosamine."}, {"url": "http://www.webmd.com/arthritis/tc/glucosamine-and-chondroitin-topic-overview", "passage_text": "Glucosamine and chondroitin are part of normal cartilage. Cartilage acts as a cushion between the bones in a joint. Glucosamine, also called chitosamine, is a natural substance that is found in the covering of shellfish."}]