[{"url": "http://www.bodybuilding.com/fun/issa23.htm", "passage_text": "Many ketogenic diet and MCT oil spokespeople say that MCT's energy sustaining powers can be explained as follows: when MCT oil is metabolized in the body, it behaves more like a carbohydrate than a fat. Remember that the fuel of preference for the body is carbohydrate."}, {"url": "http://www.bodybuilding.com/store/mct.html", "passage_text": "Medium chain triglycerides, MCTs, are fatty acids that are more easily digested by the body than other fat. MCTs are naturally found in coconut oil, palm kernel oil, and butter. MCTs are shorter chain triglycerides and contain only 8.3 calories instead of 9 calories per gram."}, {"url": "http://www.bodybuilding.com/fun/issa23.htm", "passage_text": "MCT simply stands for medium chain triglycerides, as opposed to long chain triglycerides (LCT), which are found in most foods. MCT is comprised of primarily caprylic and capric fatty acids, and is a light-yellow, odorless, translucent liquid at room temperature. MCT oil occurs naturally in coconut oil and other foods."}, {"url": "http://www.allstarhealth.com/lj_c/mct_oil.htm", "passage_text": "Medium Chain Triglycerides (or MCT's) are a type of fat that is more easily digested and more rapidly metabolized for energy than other types of fats. MCT's are naturally-occurring in coconut and palm kernel oils."}, {"url": "http://healthimpactnews.com/2014/mct-oil-vs-coconut-oil-the-truth-exposed/", "passage_text": "Where the logic fails in comparing MCT oil to coconut oil, is in the assumption that all four MCTs are present in MCT oil, and only the longer chain fatty acids from coconut oil are removed. This assumption is false. MCT oils generally contain only the capra fatty acids."}, {"url": "http://www.puritan.com/sports-and-diet-043/mct-oil-024195", "passage_text": "From the Manufacturer's Label: Medium Chain Triglycerides (MCT's) are fats that are naturally found in coconut and palm kernel oil. MCT's are more easily and rapidly digested than other types of fats, as they require lower amounts of enzymes and bile acids for intestinal absorption. Manufactured by NOW® Foods."}, {"url": "http://www.swansonvitamins.com/now-foods-mct-oil-32-fl-oz-liquid", "passage_text": "Medium Chain Triglycerides (MCTs) are fats that are naturally found in coconut and palm kernel oil. MCTs are more easily and rapidly digested than other types of fats, as they require lower amounts of enzymes and bile acids for intestinal absorption."}, {"url": "https://www.nestlehealthscience.us/brands/mct-oil/mct-oil", "passage_text": "MCT OIL, medium chain triglycerides, is a fat source for those who are unable to digest or absorb conventional fats. MCTs do not require digestive enzymes or bile acids for digestion and absorption."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-915-MEDIUM%20CHAIN%20TRIGLYCERIDES%20(MCTs).aspx?activeIngredientId=915&activeIngredientName=MEDIUM%20CHAIN%20TRIGLYCERIDES%20(MCTs)", "passage_text": "Medium chain triglycerides (MCTs) are partially man-made fats. The name refers to the way the carbon atoms are arranged in their chemical structure. MCTs are generally made by processing coconut and palm kernel oils in the laboratory. Usual dietary fats, by comparison, are long-chain triglycerides. People use MCTs as medicine."}]