[{"url": "http://www.webmd.com/digestive-disorders/picture-of-the-stomach", "passage_text": "Picture of the Stomach. © 2009 WebMD, LLC. All rights reserved. The stomach is a muscular organ located on the left side of the upper abdomen. The stomach receives food from the esophagus. As food reaches the end of the esophagus, it enters the stomach through a muscular valve called the lower esophageal sphincter. The stomach secretes acid and enzymes that digest foo"}, {"url": "http://healthzene.com/liver-location/", "passage_text": "The liver is normally found in the upper right portion of a person’s abdominal cavity, situated underneath the diaphragm and right of the kidney, on topmost portion of the stomach. It is known to have two sources of blood supply, one for oxygenated blood and the other one, nutrient rich blood. "}, {"url": "http://mamashealth.com/organs/stomach.asp", "passage_text": "The stomach is an organ of digestion. It has a saclike shape and is located between the esophagus and the intestines. Almost every animal has a stomach. The human stomach is a muscular, elastic, pear-shaped bag, lying crosswise in the abdominal cavity beneath the diaphragm. It changes size and shape according to is position of the body and the amount of food inside. The stomach is about 12 inches (30.5 cm) long and is 6 inches. (15.2 cm) wide at its widest point."}, {"url": "http://www.medicinenet.com/image-collection/stomach_picture/picture.htm", "passage_text": "Get the Latest health and medical information delivered direct to your inbox! The stomach is a muscular sac located on the left side of the upper abdomen. The stomach receives food from the esophagus. As food reaches the end of the esophagus, it enters the stomach through a muscular valve called the lower esophageal sphincter. The stomach secretes acid and enzymes that digest food. "}, {"url": "http://healthfixit.com/location-and-pictures-of-different-organs-in-the-abdomen/", "passage_text": "It lies between the esophagus and the duodenum on the upper-left portion of the abdominal cavity. Stomach is divisible into cardiac portion which in turn is divided into fundus and body whereas the pyloric division of the stomach is further sub-divided into pyloric antrum and pyloric canal. "}, {"url": "http://www.myhealthyfeeling.com/where-is-the-liver-located-in-the-human-body/", "passage_text": "The liver is located on the upper side of your right abdomen below your diaphragm and enclosed by your rib cage. At the back of your liver is where the gallbladder is located and closer to the spleen, stomach, intestines and kidneys. You can actually feel your liver by laying your fingers under your right rib cage. "}, {"url": "http://www.md-health.com/Upper-Left-Abdominal-Pain.html", "passage_text": "Pain in the upper left side of your abdomen, often referred to as upper left quadrant pain, is usually indicative of something wrong with the organs and/or tissue structures located on that area of the torso. "}, {"url": "http://www.healthline.com/human-body-maps/stomach", "passage_text": "The stomach is located in the upper-left area of the abdomen below the liver and next to the spleen. It’s main function is store and breakdown foods and liquids that we consume before those contents travel to other organs to be further digested. When the stomach is empty, the inside has small folds called rugae. Stomach. The stomach is a muscular, J-shaped organ in the abdomen. Part of the digestive system, the stomach stores and digests food through gastric juices and a specialized churning action created by folds on its inside."}]