[{"url": "http://learn.org/articles/What_is_a_Library_Associate.html", "passage_text": "Library associates provide circulation, research and administrative assistance to librarians. Find out more about library associate's education, careers and salary. Schools offering Archival Studies degrees can also be found in these popular choices."}, {"url": "http://learn.org/articles/What_is_a_Library_Associate.html", "passage_text": "As a library associate, technician or assistant, you're responsible for providing administrative and research assistance to librarians. You could work in a large, public library or a specialized resource center, such as a medical, law or research library."}, {"url": "http://www.bls.gov/ooh/education-training-and-library/library-technicians-and-assistants.htm", "passage_text": "Library technicians and assistants in smaller libraries have a broader range of duties. In larger libraries, they tend to specialize in a particular area, such as user services or technical services. Technicians and assistants in user services assist library patrons with locating resources and information."}, {"url": "http://www.ala.org/educationcareers/careers/librarycareerssite/whatyouneedassistant", "passage_text": "Below is a sample of what is often required for library assistant and technician job positions. More discussion about degree requirements is available in the next section."}, {"url": "http://www.wisegeek.com/what-does-a-library-assistant-do.htm", "passage_text": "A library assistant helps the librarian with all the daily tasks in the library. This could include working at the circulation desk and assisting the public. Other tasks may include repairing, replacing, and restocking books."}, {"url": "http://learn.org/articles/What_is_a_Library_Associate.html", "passage_text": "If you want to pursue a specialized career, you could work solely as a library media or circulation assistant. Some of your specific job duties might include acquiring books and other materials from other libraries, checking out books to patrons, cataloging materials and organizing bookshelves."}, {"url": "http://work.chron.com/difference-between-librarian-library-associate-4886.html", "passage_text": "Library associates do not usually decide how a library will spend its money, although they may help prepare budgetary information and reports. Part of a librarian's managerial responsibilities includes allocating a library's funds to specific programs, material acquisitions, technology upgrades, and staffing costs."}, {"url": "http://www.bls.gov/ooh/education-training-and-library/library-technicians-and-assistants.htm", "passage_text": "Public library technicians and assistants work in their community libraries to serve all members of the public. They help patrons find books to read for pleasure; assist patrons with their research for schoolwork, business, or personal interest; and teach patrons how to access the library’s resources."}]