[{"url": "http://www.answers.com/Q/What_is_Siporex_light_weight_materials", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answered by The Community. Making the world better, one answer at a time. Siporex is a lightweight, autoclaved, aerated concrete which is a completely cured, inert and stable form of calcium silicate hydrate. If light is made of photons and photons have mass then you would assume that light has weight in a gravitational field. In fact light running into an object imparts momentum t … o it."}, {"url": "https://en.wikipedia.org/wiki/Siporex", "passage_text": "AAC was perfected in the mid-1920s by the Swedish architect and inventor Dr. Johan Axel Eriksson, working with Professor Henrik Kreueger kreüger at The Royal institute Of. Technology it went into production In sweden in 1929 in a factory In haellabrottet hällabrottet and quickly became. very popular When AAC is mixed and cast in forms, several chemical reactions take place that give AAC its light weight (20% of the weight of concrete) and thermal properties. Aluminum powder reacts with calcium hydroxide and water to form hydrogen."}, {"url": "http://shirkegroup.com/ProductsServicesSiporex.htm", "passage_text": "Oven dry density of Siporex is 400 to 650 kg/cum, i.e. Just 1/4th the weight of dense concrete and 1/3rd the weight of conventional clay bricks. Due to light weight, the dead load on foundation as well as on supporting structure reduces, thereby saving in concrete and steel. Being a factory made, quality of Siporex products is assured. Siporex products have BIS norms and markings. Siporex slabs are conforming to IS 6073 and Siporex blocks are conforming to IS 2185 (Part 3)."}, {"url": "http://encyclopedia2.thefreedictionary.com/siporex", "passage_text": "(materials). A building material composed of sand, lime or cement, and aluminum powder which are mixed and cast into molds to be made into roof slabs, door lintels, and wall blocks which give excellent heat and sound insulation. 1  Facebook."}, {"url": "http://dir.indiamart.com/impcat/siporex-slab.html", "passage_text": "Siporex Autoclaved Aerated Concrete (AAC) blocks also known as Autoclaved Cellular Concrete(ACC) or Autoclaved Lightweight Concrete (ALC). It is a lightweight, precast building material that simultaneously provides structure, insulation, and fire and mold resistance.AAC Blocks (Autoclaved Aerated Concrete -... Siporex is lightweight autoclaved aerated concrete which is completely cured, inert and stable form of calcium silicate hydrate. It is available as blocks and pre-cast reinforced units, i.e. floors, roofs, walls and lintels."}, {"url": "http://dir.indiamart.com/impcat/siporex-slab.html", "passage_text": "Siporex Roof & Floor Slabs. We are a reliable trader and supplier of roof & floor slabs, which are procured from the reliable vendors. These roof and floor slabs are made in varying lengths, ranging from 0. 96 meter to 6 meters. Clients can avail these slabs in increments of 0. Siporex is lightweight autoclaved aerated concrete which is completely cured, inert and stable form of calcium silicate hydrate. It is available as blocks and pre-cast reinforced units, i.e. floors, roofs, walls and lintels."}, {"url": "http://shirkegroup.com/ProductsServicesSiporex.htm", "passage_text": "Thickness varies from minimum 125 mm to 200 mm depending upon the Superimposed load on the slab and span. SIPOREX REINFORCED WALL PANELS: Available in the sizes from 1M long to 3M long in the increment of 0.50M. Thickness varies from minimum 75 mm to 150 mm depending on span & loading. The reinforcement in all reinforced products has special anticorrosive treatment to ensure durable end product. Being a factory made, quality of Siporex products is assured. Siporex products have BIS norms and markings. Siporex slabs are conforming to IS 6073 and Siporex blocks are conforming to IS 2185 (Part 3)."}, {"url": "http://encyclopedia2.thefreedictionary.com/siporex", "passage_text": "siporex. (materials). A building material composed of sand, lime or cement, and aluminum powder which are mixed and cast into molds to be made into roof slabs, door lintels, and wall blocks which give excellent heat and sound insulation. 1  Facebook. 2  Twitter"}, {"url": "http://dir.indiamart.com/impcat/siporex-slab.html", "passage_text": "Our clients can avail from us an extensive range of Siporex Roof Slabs. Procured from reliable vendors, these have smooth surface, durable finish standards and high quality. These slabs can withstand the standard fire for 150 minutes under uniform load of 320kg/m2as per IS:3809, BS:476 Part20 and ISO 834. Siporex is lightweight autoclaved aerated concrete which is completely cured, inert and stable form of calcium silicate hydrate. It is available as blocks and pre-cast reinforced units, i.e. floors, roofs, walls and lintels."}]