[{"url": "http://www.enotes.com/homework-help/what-good-definition-tropic-hormone-175877", "passage_text": "Posted on. (Answer #1). A tropic hormone is a hormone that stimulates an endocrine gland to grow and secrete it's hormones.(One hormone causes another hormone to do something) In humans, tropic hormones are secreted by the adenohypophysis(anterior pituitary gland)."}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=41535", "passage_text": "tropic hormones. Definitions: 1. those hormones of the anterior lobe of the pituitary that affect the growth, nutrition, or function of other endocrine glands (TRH, ACTH). The definition information for tropic hormones is provided by Stedman's. You can search our medical dictionary here."}, {"url": "http://study.com/academy/lesson/hormones-of-the-anterior-pituitary-gland-names-functions.html", "passage_text": "FSH and the next tropic hormone, luteinizing hormone (LH) , work synergistically in reproduction because LH triggers ovulation in females and stimulates testosterone production in males."}, {"url": "http://www.answers.com/Q/What_are_the_4_tropic_hormones", "passage_text": "signals to the brain stimulate release of an anterior pituitary  tropic hormone. The tropic hormone then acts on its target  endocrine tissue, stimulating secretion of a hormone that exerts  systemic metabolic or developmental effects."}, {"url": "http://study.com/academy/lesson/hormones-of-the-anterior-pituitary-gland-names-functions.html", "passage_text": "Tropic Hormones (FSH & LH). We've learned about growth hormone and prolactin, but there are four remaining hormones to discuss. Even though these hormones originate in the anterior pituitary gland, which is an endocrine gland itself, the targets of these four hormones are other endocrine glands. When we look at hormones that have other endocrine glands as their target we call them tropic hormones. The four tropic hormones of the anterior pituitary gland are: follicle-stimulating hormone (FSH), luteinizing hormone (LH), adrenocorticotropic hormone (ACTH), and thyroid-stimulating hormone (TSH)."}, {"url": "http://study.com/academy/lesson/hormones-of-the-anterior-pituitary-gland-names-functions.html", "passage_text": "Another tropic hormone from the anterior pituitary gland is adrenocorticotropic hormone (ACTH) . This hormone has a long name, but its name actually makes its function easier to remember when you break it down. The prefix 'adreno' refers to the adrenal gland."}]