[{"url": "http://www.ehow.com/how_2046094_have-career-banking.html", "passage_text": "You can begin a career in banking without experience or a degree and choose from a variety of specialties after you pay your dues in an entry-level position. Here's how to start in this exciting field. 1  Why to Choose a Banking Career. 2  Pros & Cons of a Banking Career. 1 Banks often hold job fairs, especially in larger towns and cities. 2  Tellers are always in demand and are often hired on the spot or very quickly. 3  Tellers can easily work part-time, but advancement is difficult for part-timers. 4  Many banks offer college tuition reimbursement."}, {"url": "http://www.careerguidance.com/how-to-start-a-career-in-banking.html", "passage_text": "1 To be able to start a career in banking candidates should understand that this career will involve lot of hard work, attention to detail, ability to achieve the goals, maintenance of security, and ability to learn on a continuous basis. 1 Candidates who are pursuing a career in banking should be perfectionists at work. 2  They cannot let any amount of money being misused or fall under discrepancy. 3  They have to do all electronic transactions and paperwork perfectly."}, {"url": "http://www.ehow.com/how_2046094_have-career-banking.html", "passage_text": "A career in banking may include a variety of jobs and areas of specialization, such as investment consultant, financial analyst or portfolio... 1 Banks often hold job fairs, especially in larger towns and cities. 2  Tellers are always in demand and are often hired on the spot or very quickly. 3  Tellers can easily work part-time, but advancement is difficult for part-timers. 4  Many banks offer college tuition reimbursement."}, {"url": "http://www.careerguidance.com/how-to-start-a-career-in-banking.html", "passage_text": "Points to be kept in mind while pursuing a career in banking: 1  To be able to start a career in banking candidates should understand that this career will involve lot of hard work, attention to detail, ability to achieve the goals, maintenance of security, and ability to learn on a continuous basis. 1 Candidates who are pursuing a career in banking should be perfectionists at work. 2  They cannot let any amount of money being misused or fall under discrepancy. 3  They have to do all electronic transactions and paperwork perfectly."}, {"url": "http://www.careerguidance.com/how-to-start-a-career-in-banking.html", "passage_text": "How to start a career in banking. Any interested candidate would be able to start a career in banking by getting the right educational background. A career in banking typically involves a candidate to pursue courses like accounting in their Bachelor’s degree and Banking and Finance in their post-graduation. 1 Candidates who are pursuing a career in banking should be perfectionists at work. 2  They cannot let any amount of money being misused or fall under discrepancy. 3  They have to do all electronic transactions and paperwork perfectly."}, {"url": "https://answers.yahoo.com/question/index?qid=20101011212018AAvcYn4", "passage_text": "Answers. Best Answer: In investment banking, it is like any career, you start as an apprentice and then apply for jobs and work your way in. In China, there is not that much investment banking going on compared to the west. Best way is to get in touch directly with investment bankers, and ask. I am also interested in doing an internship in china in the same field. What are good... show more I am senior in college with a double major in Finance and International Business. I am weighting my options and I want to work in the investment banking field."}, {"url": "https://answers.yahoo.com/question/index?qid=20101011212018AAvcYn4", "passage_text": "Best Answer: In investment banking, it is like any career, you start as an apprentice and then apply for jobs and work your way in. In China, there is not that much investment banking going on compared to the west. I am also interested in doing an internship in china in the same field. What are good... show more I am senior in college with a double major in Finance and International Business. I am weighting my options and I want to work in the investment banking field."}, {"url": "http://www.wikihow.com/Get-a-Bank-Job", "passage_text": "1. Investigate the bank you're applying to. Whenever you apply to a job, you should do some research into the position and the company. Learn the bank's mission statement and strategies. Mention these things in your cover letter and use them to show why you would be a good fit for the position. 2. Send in your resume and cover letter. Whether you've spoken to a bank manger and he's referring you for the job, or you're answering an ad from the internet, you'll need to send in your resume and cover letter for the job. Read Write a Cover Letter for instructions on putting together a great"}, {"url": "http://www.ehow.com/how_7557080_learn-investment-banking.html", "passage_text": "Work for an investment bank. There's no education about investment banking that compares to working for one. If you are unable to find a full-time position with a bank, apply for a seasonal internship. This will allow you to learn about investment banking firsthand without committing to a career in the field. The best way to start learning about investment banking is to read up on it. There are a number of books on investment banking that outline the basics of the business. Also, a number of trade groups, such as the American Bankers Association, offer informational literature about investment banking. Follow the news"}]