[{"url": "http://www.hospicenet.org/html/what_you_need.html", "passage_text": "So I could sum up the needs of one person diagnosed as close to death, me, as being: 1  The need to settle up with the people that I felt close to, so as to die in peace, with them and with myself. 2  The need to have someone to stand in for me, to do what I could not do when I became helpless or consigned to the grave. 1 The need for places and organizations that I could turn to for practical information. 2  The need for someone to guide me, or go with me, round this new and unfamiliar domain of the terminal state-not necessarily the same someone for every sector of it."}, {"url": "https://www.caring.com/questions/what-to-say-to-someone-who-wants-to-die", "passage_text": "I love myself enough to nurture me at the end of my life. When people who wish to die say it-just hear them out and say nothing if you've got nothing good to say. Spare them the lecture or how much better off they are than starving children in Africa. Sometimes you just need to hear them and give them your permission. That is what they are instinctively seeking. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090526192126AAI9Anl", "passage_text": "When we say goodbye to someone I always feel the need to say make it last, this is the last goodbye you ll give but I feel like people would think that I would kill them or just think I m going insane. ok here's the deal, 2 days before someone dies, (I know them personally or I know a close family member.) I get this really weird feeling, sounds around me are amplified and I feel like I'm getting dizzy. The only problem is I don't know who is going to die. Anybody else out there ever feel this way."}, {"url": "http://www.aplaceformom.com/blog/2014-14-4-what-to-say-to-the-dying/", "passage_text": "“The person who is dying usually knows that he or she is dying, and the secret for us is not to be afraid of that or to run away from it.”. “Don’t desert the one who is dying. Let that person take the lead,” advises Marty Tousley, a Grief Counselor and Moderator for Grief Healing Discussion Groups. You can selectively reflect back their own words… less is more.”Four Things to Say to Someone Who Is DyingWhen you do have a conversation with your loved one, remember to keep the focus on their feelings and needs during that time."}, {"url": "https://answers.yahoo.com/question/index?qid=20080517004407AA3Xl7z", "passage_text": "You don't have to say a lot. they know they are going to die but nobody can say when it will happen exactly. So before you go. just sit for 5 minutes and see if this person wants to talk and if that is so.. just hold his or her and listen... that will make them feel you have compassion... and just treat them as usual.. If they have, then simply saying so long, or goodbye would be appropriate. It is a hard thing to go and say goodbye to someone...especially someone you care about."}, {"url": "http://www.hospicenet.org/html/what_you_need.html", "passage_text": "When you get ill and are told you are going to die soon, needs come crowding in on you, jostling for scarce time and (often) scarce energies. So they in turn create their own need, a need for people and places to help you answer your needs. 1 The need for places and organizations that I could turn to for practical information. 2  The need for someone to guide me, or go with me, round this new and unfamiliar domain of the terminal state-not necessarily the same someone for every sector of it."}, {"url": "http://www.hospicenet.org/html/what_you_need.html", "passage_text": "1 The need to settle up with the people that I felt close to, so as to die in peace, with them and with myself. 2  The need to have someone to stand in for me, to do what I could not do when I became helpless or consigned to the grave. 3  The need for places and organizations that I could turn to for practical information. 1 The need for places and organizations that I could turn to for practical information. 2  The need for someone to guide me, or go with me, round this new and unfamiliar domain of the terminal state-not necessarily the same someone for every sector of it."}, {"url": "http://www.huffingtonpost.com/christy-heitgerewing/the-8-best-things-you-can_b_5896854.html", "passage_text": "When someone close to you dies, you initially receive a good deal of advice and support. Some of it is helpful. Some, not so much. I recently posted an article titled The 8 Worst Things You Can Say to Someone Who is Grieving.. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080517004407AA3Xl7z", "passage_text": "They know they are going to die. How you talk to them really depends on have they come to grips with the reality they are facing. If they have, then simply saying so long, or goodbye would be appropriate. It is a hard thing to go and say goodbye to someone...especially someone you care about."}, {"url": "http://www.aplaceformom.com/blog/2014-14-4-what-to-say-to-the-dying/", "passage_text": "Sometimes, even with the best of intentions, we may not know what to do or say to be the greatest comfort to the person who is dying. We may not even know how to mentally prepare for conversations with a dying family member. You can selectively reflect back their own words… less is more.”Four Things to Say to Someone Who Is DyingWhen you do have a conversation with your loved one, remember to keep the focus on their feelings and needs during that time."}]