[{"url": "http://www.imdb.com/title/tt3019170/reviews", "passage_text": "Mountain Monsters... The swearing in this show is constant from beginning to end, so not suitable for children to watch. The gun safety in this show is non-existent, with the shear number of gun safety infractions per episode making this show an excellent candidate for a drinking game. I debated giving this show a 1 out of 10 because it truly thinks the audience is mentally challenged. I also debated giving it a 10 out of 10 because it is absolutely hilarious, I haven't laughed so hard in a long time. I ended up averaging the two, and gave it a 5. The show is obviously fake."}, {"url": "http://www.aimsa.org/", "passage_text": "﻿﻿A.I.M.S. APPALACHIAN INVESTIGATORS OF MYSTERIOUS SIGHTINGS. Most people have heard of the Mothman who was sighted in West Virginia on numerous occasions. Of course there are the Braxton County Monster, Blue Devil, Sheepsquatch, The Grafton Monster, Thunderbirds, and the list goes on and on. What most people don't realize is that there are more sightings of mysterious creatures in the Appalachian Region than any where else in the world"}, {"url": "http://www.huffingtonpost.com/2014/04/04/mountain-monsters-hillbilly-hunters_n_5092394.html", "passage_text": "These and other chilling creatures reported by people in and around the Appalachian area of the U.S. are the subjects of the Destination America reality series, Mountain Monsters.. The illustration of this first quarry, Mothman, is a legendary creature reported in West Virginia. The six-man A.I.M.S. crew may look like expert moonshiners, but these guys seriously research and hunt odd creatures on their TV series, Mountain Monsters, which kicks off its second season tonight on Destination America."}, {"url": "http://www.imdb.com/title/tt3019170/", "passage_text": "Mountain Monsters is a show with professional hillbilly hunters that search for mysterious creatures that people have claimed to have seen in West Virginia. Ken Charles, Royal Malloy, Colt Straub, Duke Straub, Russell Geyser. "}, {"url": "http://www.web.poptower.com/mountain-monsters.htm", "passage_text": "Mountain Monsters (TV show) scene 'Mountain Monsters' Season 3 Tracks Bigfoot — Premiering Saturday, March 7, the new season of the Destination America series travels to remote corners of the Appalachian wilderness to try to trap local Bigfoots across the region to prove they are fact, not folklore. Read more... Mountain Monsters  Season 3 is a reality series that airs on Destination America. Wolfman, Devil Dog, Grassman, Wampus Beast, Mothman, Lizard Demon — for generations, these mysterious Appalachian monsters have spawned countless sightings in the 1500-mile long mountain chain"}, {"url": "http://www.web.poptower.com/mountain-monsters.htm", "passage_text": "Mountain Monsters (TV show) cast Destination America Renews 'Mountain Monsters' for Season 3 — The network has ordered 16 new episodes for the new season to begin production later this year and debut next spring. Mountain Monsters  Season 3 is a reality series that airs on Destination America. Wolfman, Devil Dog, Grassman, Wampus Beast, Mothman, Lizard Demon — for generations, these mysterious Appalachian monsters have spawned countless sightings in the 1500-mile long mountain chain"}, {"url": "http://www.huffingtonpost.com/2014/04/04/mountain-monsters-hillbilly-hunters_n_5092394.html", "passage_text": "I think it's an incisor [front] tooth from a Bigfoot.. Watch the 'Mountain Monsters' team at work tracking down unusual creatures. Mountain Monsters begins its second season tonight on Destination America at 10p.m. Check your local listings. The six-man A.I.M.S. crew may look like expert moonshiners, but these guys seriously research and hunt odd creatures on their TV series, Mountain Monsters, which kicks off its second season tonight on Destination America."}, {"url": "http://www.yidio.com/show/mountain-monsters", "passage_text": "Watch Mountain Monsters. Mountain Monsters is a 60 minutes an episode reality tv show produced by American Chainsaws Entertainment Company. The show stars a six man crew of hardcore hunters and trappers who grew up in the mountains of West Virginia"}]