[{"url": "http://www.carpetprofessor.com/carpet_cost.htm", "passage_text": "1. The Carpet & Pad prices below do not reflect how much it will cost to install your carpet. Carpet installation costs vary depending on what part of the country you live in; how difficult your project is; and what Carpet Style and Carpet Quality you select. The Best & Worst Places to Buy New Carpet. 2"}, {"url": "http://homeguides.sfgate.com/average-cost-carpet-laying-77332.html", "passage_text": "Labor. Labor costs are one of the most flexible aspects of carpet installation and vary depending on which installer you talk to. As of this writing, expect to pay between $9 to $12 per square yard of carpet installation for a competitive, average installer. Luxury carpets can cost three times that. Material Costs. As of 2013, carpet costs range depending on the quality you desire, with a low-end carpet ranging from $2 to $3 on average per square foot. Carpet is actually sold by the yard, but most shops advertise in square feet to avoid customer confusion"}, {"url": "http://www.improvenet.com/r/costs-and-prices/nylon-carpeting", "passage_text": "Some manufacturers create temporary carpets designed for five years of use. Those carpets can cost $15 to $30 per square yard. Nylon carpets designed for 10 years of use range in price from $20 to $35 per square yard. Carpet manufacturers also release carpets designed for 15 to 20 years of use, and those carpets can cost $25 to $45 per square yard. "}, {"url": "http://home.costhelper.com/carpeting.html", "passage_text": "1 Prices range from $2 a square foot for the most inexpensive carpeting, including some self-adhesive carpet tiles, to as much as $100 a square yard for high-end or custom project. 2  Decent carpeting and padding can usually be installed for $19-$38 a square yard, or $300-$600 for a 12x12-foot room. 1 Decent carpeting and padding can usually be installed for $19-$38 a square yard, or $300-$600 for a 12x12-foot room. 2  If it's not included, add, $2.50-$6 a square yard for padding. 3  Be skeptical of prices that include free padding, because good padding increases the life span of your carpet; ask about upgrades."}, {"url": "http://www.carpetcaptain.com/prices/", "passage_text": "Step 2: Determining the cost of the carpet. Carpet prices range anywhere from $0.50 to over $10 per square foot. Most homes will want a carpet that is between $2-$4 per square foot, but this is by no means a rule. The carpet specifications you need for your life style and the kind of deal you strike will have a big impact on the carpet price. Carpet pad cost: $0.30 to $0.60 sq/ft. Carpet installation cost: $0.50 sq/ft. For budgeting purposes, adding $1.00 sq/ft. for padding and installation to the carpet cost gives a good estimate. Captain’s parting words: There’s no exact answer for how much carpet costs."}, {"url": "http://home.costhelper.com/carpeting.html", "passage_text": "Related articles: Hardwood Floors, Vinyl Flooring, Home Addition. 1  Prices range from $2 a square foot for the most inexpensive carpeting, including some self-adhesive carpet tiles, to as much as $100 a square yard for high-end or custom project. 1 Decent carpeting and padding can usually be installed for $19-$38 a square yard, or $300-$600 for a 12x12-foot room. 2  If it's not included, add, $2.50-$6 a square yard for padding. 3  Be skeptical of prices that include free padding, because good padding increases the life span of your carpet; ask about upgrades."}, {"url": "http://www.abccarpets.com/carpet_cost.htm", "passage_text": "Typical Carpet Cost: Ranges from $15 to $22 per yard Carpet Face Weight: 30 to 40 ounce Carpet Fiber: Nylon, Sorona PTT, Smartstrand Common Styles: Plush, textured plush, sculptured, Berber, Cut Pile, Saxony Typical Lifespan: 6 to 12 years Padding Cost: Ranges from $3.00 - $4.50 per square yard. A typical 2 Bedroom home requires about 100 yards of Carpet. Here's what it will likely cost you for the Carpet, Padding and Installation depending on your Traffic Level and How Long you want your Carpet to Last. Estimated Cost for 100 yards of Nylon Carpet / Pad, Installed."}, {"url": "http://www.fixr.com/costs/carpet-installation", "passage_text": "1 Selecting the carpet-carpeting can cost as little as $2 per square foot, or as high as $100 per square yard, but the average carpet and pad will cost between $30 and $40 per square yard-for a total of around $995 for the carpeting alone. "}]