[{"url": "http://pain.emedtv.com/meloxicam/meloxicam.html", "passage_text": "Meloxicam (Mobic ®) is a prescription medicine used to treat pain, inflammation, swelling, and/or stiffness. It is part of a class of drugs called nonsteroidal anti-inflammatory drugs, or NSAIDs for short."}, {"url": "http://www.medicinenet.com/meloxicam/article.htm", "passage_text": "DRUG CLASS AND MECHANISM: Meloxicam is in a class of drugs called nonsteroidal anti-inflammatory drugs (NSAIDs) that are used to treat pain and/or inflammation. Other members of this class include ibuprofen (Motrin), indomethacin (Indocin), nabumetone (Relafen) and several others."}, {"url": "http://www.medicinenet.com/meloxicam/article.htm", "passage_text": "PRESCRIBED FOR: Meloxicam is used to treat tenderness, swelling, and pain caused by the inflammation of osteoarthritis, rheumatoid arthritis, and juvenile rheumatoid arthritis in patients 2 years of age or older. SIDE EFFECTS: Common side effects with NSAIDs are related to the gastrointestinal tract (GI) and include:"}, {"url": "http://www.webmd.com/drugs/2/drug-911/meloxicam-oral/details", "passage_text": "Uses. Meloxicam is used to treat arthritis. It reduces pain, swelling, and stiffness of the joints. Meloxicam is known as a nonsteroidal anti-inflammatory drug (NSAID). If you are treating a chronic condition such as arthritis, ask your doctor about non-drug treatments and/or using other medications to treat your pain."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0011069/?report=details", "passage_text": "Uses. Meloxicam is a nonsteroidal anti-inflammatory drug (NSAID) used to relieve the symptoms of arthritis (juvenile rheumatoid arthritis, osteoarthritis, and rheumatoid arthritis), such as inflammation, swelling, stiffness, and joint pain."}, {"url": "http://www.wisegeekhealth.com/how-effective-is-meloxicam-for-pain.htm", "passage_text": "Meloxicam is a painkiller that belongs to the class of medications known as non-steroidal anti-inflammatory drugs (NSAIDs). This medication works to reduce pain by inhibiting the formation of certain proteins that lead to inflammation and pain. It also works to reduce fevers through the same mechanism."}, {"url": "http://www.meloxicamsideeffects.org/", "passage_text": "Meloxicam Side Effects. The popular pain killer, Meloxicam, is only available to the public by prescription. It is not available as an over-the counter product. Meloxicam is used for people who experience menstrual cramps, rheumatoid arthritis, and other conditions such as urinary stones and osteoarthritis. It is most effective by preventing the human body’s creation of a chemical substance that creates pain and discomfort, high temperature, as well as inflammation."}]