[{"url": "http://weather.about.com/od/s/g/surface_runoff.htm", "passage_text": "By Rachelle Oblack. Definition: Surface water runoff is a step in the water cycle on Earth. When precipitation occurs, water only has a few locations where it can go. Water can infiltrate into the ground, evaporate, or become runoff. Runoff is the short way of saying surface water runoff. "}, {"url": "http://disc.gsfc.nasa.gov/hydrology/data-holdings/parameters/subsurface_runoff.shtml", "passage_text": "Definition. Subsurface runoff is the water that infiltrates in the vadose zone (unsaturated zone), from rain, snowmelt, or other sources, and moves laterally towards the streams. Vadose zone extends from the top of the ground surface to the water table. It is one of the major components in the water cycle. "}, {"url": "http://www.physicalgeography.net/fundamentals/8n.html", "passage_text": "Surface Runoff If the amount of water falling on the ground is greater than the infiltration rate of the surface, runoff or overland flow will occur. Runoff specifically refers to the water leaving an area of drainage and flowing across the land surface to points of lower elevation. "}, {"url": "https://en.wikipedia.org/wiki/Surface_runoff", "passage_text": "It is the primary agent in soil erosion by water. Runoff that occurs on the ground surface before reaching a channel is also called a nonpoint source. If a nonpoint source contains man-made contaminants, or natural forms of pollution (such as rotting leaves) the runoff is called nonpoint source pollution. Surface runoff can be generated either by rainfall,snowfall or by the melting of snow, or glaciers. Snow and glacier melt occur only in areas cold enough for these to form permanently."}, {"url": "https://en.wikipedia.org/wiki/Surface_runoff", "passage_text": "In addition to causing water erosion and pollution, surface runoff in urban areas is a primary cause of urban flooding which can result in property damage, damp and mold in basements, and street flooding. Surface runoff can be generated either by rainfall,snowfall or by the melting of snow, or glaciers. Snow and glacier melt occur only in areas cold enough for these to form permanently."}, {"url": "http://www.eschooltoday.com/water-cycle/what-is-runoff-in-water-cycle.html", "passage_text": "RECOMMENDED LESSONS: Runoff Runoff is precipitation that did not get (infiltrated) absorbed into the soil, or did not evaporate, and therefore made its way from the ground surface into places that water collect. Runoff causes erosion, and also carry chemicals and substances on the ground surface along to the rivers where the water ends up. It can cause water pollution too. Only about 35% of precipitation ends up in the sea or ocean. The other 65% is absorbed into the soil. Some of it too is evaporated. "}, {"url": "http://water.usgs.gov/edu/watercyclerunoff.html", "passage_text": "Surface runoff is precipitation runoff over the landscape. In our section about water storage in the oceans we describe how the oceans act as a large storehouse of water that evaporates to become atmospheric moisture. The oceans are kept full by precipitation and also by runoff and discharge from rivers and the ground. Surface runoff is affected by both meteorological factors and the physical geology and topography of the land. Only about a third of the precipitation that falls over land runs off into streams and rivers and is returned to the oceans."}, {"url": "https://en.wikipedia.org/wiki/Surface_runoff", "passage_text": "Surface runoff (also known as overland flow) is the flow of water that occurs when excess stormwater, meltwater, or other sources flows over the earth's surface. Surface runoff can be generated either by rainfall,snowfall or by the melting of snow, or glaciers. Snow and glacier melt occur only in areas cold enough for these to form permanently."}, {"url": "https://en.wikipedia.org/wiki/Urban_runoff", "passage_text": "Urban runoff flowing into a storm drain. Urban runoff is surface runoff of rainwater created by urbanization. This runoff is a major source of urban flooding and water pollution in urban communities worldwide. "}]