[{"url": "http://zenhabits.net/31-ways-to-motivate-yourself-to-exercise/", "passage_text": "1 And I let that motivate me the next time: “You know how good you’re going to feel, Leo!”. 2  Time for you. 3  While many people make time to take care of others (kids, spouse, other family, co-workers, boss), they don’t often make time to take care of themselves. Most recently, the things that have helped include finding a workout partner (one of the best motivators!), logging my exercise, reading magazines, books and websites, and rewarding myself. 1  How you feel after a workout. 2  Time for you. 3  Calories burned. 4  Having fun. 5  How you’re going to look. 6  Magazines. 7  Cover models. 8  Blogs. 9  Success stories. 10  Forums. 11  Rewa"}, {"url": "http://zenhabits.net/31-ways-to-motivate-yourself-to-exercise/", "passage_text": "I ask myself this question every now and then, and I have the feeling I’m not the only one. A few weeks ago, I wrote 4 Simple Steps to Start the Exercise Habit … and the fourth and final step was to add motivation as needed until the habit sticks. This post is to help you with that fourth step. There are a million ways to motivate yourself to exercise, actually, but these are a few that have worked for me. Most recently, the things that have helped include finding a workout partner (one of the best motivators!), logging my exercise, reading magazines, books and websites, and rewarding myself. 1  How you feel after a workout. 2  Time for you. 3  Calories burned. 4  Having fun. 5  How you’re going to look. 6  Magazines. 7  Cover models. 8  Blogs. 9  Success stories. 10  Forums. 11  Rewa"}, {"url": "http://work.chron.com/motivate-employees-exercise-1860.html", "passage_text": "If your company doesn't have the ability to develop an onsite gym for your employees, you can encourage them to join exercise groups instead. For instance, you could form a walking group that employees can join for a stroll during lunch hour, or start a weekend company volleyball team that meets at a nearby park. "}, {"url": "http://www.bodybuilding.com/fun/topshal.htm", "passage_text": "Joining a gym will also help most people work out harder than if they workout at home. Just knowing that people are watching you will motivate you to lift heavier and harder. People would laugh if you spent 20 minutes in between sets watching The Simpsons. "}, {"url": "http://www.wikihow.com/Motivate-Yourself-to-Work-Out", "passage_text": "1 Put a mirror near your workout station! 2  Looking in the mirror while working out might give you a small boost to workout harder. 3  Try to work out with a partner. 4  It's easy to talk yourself out of working out if you are the only person you are going to disappoint. 1 Looking in the mirror while working out might give you a small boost to workout harder. 2  Try to work out with a partner. 3"}, {"url": "http://www.wikihow.com/Motivate-Yourself-to-Work-Out", "passage_text": "Get halfway there. If you want to go to the gym, but just don't feel like it, just drive yourself to gym. Tell yourself that if you still don't feel like working out, you'll go home. Odds are, though, once you're there, you won't feel like driving home. 1 Looking in the mirror while working out might give you a small boost to workout harder. 2  Try to work out with a partner. 3  It's easy to talk yourself out of working out if you are the only person you are going to disappoint."}, {"url": "http://www.wikihow.com/Motivate-Kids-to-Exercise", "passage_text": "Let your children see how important exercise is to you by exercising yourself. Children naturally mimic their parents if they take the time to notice. Get their attention and make them notice your effort by making it a bigger affair than it actually is. Rather than 15 minutes of one light exercise, do 5 minutes each of 3 different exercises. Start with the usual light activity for 5 minutes, then switch over to a more vigorous activity for 5 minutes and conclude the final 5 minutes with a lighter activity again."}, {"url": "http://dailyburn.com/life/fitness/workout-motivation-tips/", "passage_text": "Many casual exercisers want to sweat more often, but they struggle with finding the workout motivation to make fitness a part of their daily routine. Conventional wisdom hasn’t been particularly helpful in figuring out how to get in the groove and become that person who says, “I’ll meet you for brunch later. Feel too tired to go to the gym after work? “After you imagine the obstacle, you can figure out what you can do to overcome it and make a plan,” explains Oettingen. For example, you can switch to morning or lunchtime workouts or go straight to the gym instead of stopping at home first."}, {"url": "http://www.wikihow.com/Motivate-Yourself-to-Work-Out", "passage_text": "If you want to work out twice a week, have a goal of two times a week -- simple. Then you can reward yourself after! If you want to run 10 miles (16 km) a week, have that be your goal. Smaller goals (rather than losing 50 pounds, say) bring the light at the end of the tunnel a bit nearer, making it more achievable. 1 Looking in the mirror while working out might give you a small boost to workout harder. 2  Try to work out with a partner. 3  It's easy to talk yourself out of working out if you are the only person you are going to disappoint."}, {"url": "http://www.fitbodyhq.com/motivation/how-to-motivate-yourself-to-work-out-the-easy-way/", "passage_text": "Keep workouts flexible. If you make your workouts too rigid, it’s going to put you off doing them when your motivation wanes. So instead make them flexible – e.g. if you workout 45 minutes a day, but today you only do 20 minutes, that’s okay. The most important thing is to work out consistently and cut yourself some slack. 86 Ways To Motivate Yourself To Work Out. By FitBodyHQ-November 27, 2012 - Motivation. Motivating yourself to work out often takes more than just willpower, so we've put together the best tips to help you get motivated and stay motivated, the easy way."}]