[{"url": "https://en.wikipedia.org/wiki/Lok_Sabha", "passage_text": "In the Lok Sabha, the lower House of the Indian Parliament, both presiding officers—the Speaker and the Deputy Speaker-are elected from among its members by a simple majority of members present and voting in the House. Members are elected by adult Universal suffrage and a first-past-the-post system to represent their respective constituencies. Members hold their seats until the body is dissolved by the President on the advice of the council of ministers. The house meets in the Lok Sabha Chambers of the Sansad Bhavan in New Delhi."}, {"url": "https://en.wikipedia.org/wiki/Lok_Sabha", "passage_text": "The Lok Sabha (English: House of the People) is the lower house of India's Bicameral-Parliament, with the higher house being the Rajya Sabha. The House is an elected body consisting of 543 members known as Members of Parliament (MPs). Members are elected by adult Universal suffrage and a first-past-the-post system to represent their respective constituencies. Members hold their seats until the body is dissolved by the President on the advice of the council of ministers. The house meets in the Lok Sabha Chambers of the Sansad Bhavan in New Delhi."}, {"url": "http://www.parliamentofindia.nic.in/ls/intro/p1.htm", "passage_text": "Our Parliament comprises of the President and the two Houses Lok Sabha (House of the People) and Rajya Sabha (Council of States). The President has the power to summon and prorogue either House of Parliament or to dissolve Lok Sabha. The Constitution of India came into force on January 26, 1950. He is assisted by the Deputy Speaker who is also elected by Lok Sabha. The conduct of business in Lok Sabha is the responsibility of the Speaker. The Vice-President of India is the ex-officio Chairman of Rajya Sabha."}, {"url": "http://www.prsindia.org/parliamenttrack/about-parliament/the-indian-parliament-198/", "passage_text": "The Indian Parliament comprises two Houses – Lok Sabha (House of the People), and Rajya Sabha, (Council of the States), and the President of India. Parliament has four primary functions: to make laws, to sanction government expenditure, to oversee the work of the government, and to represent the interests of the people. Rajya Sabha: The Rajya Sabha (Council of States) is the Upper House of Parliament. The House has a maximum of 250 members, out of which 12 members are nominated by the President for their expertise in specific fields of art, literature, science, and social services."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20070423045117AANTf7v", "passage_text": "An MP is a member of the Parliament, be it Lok Sabha or Rajya Sabha. A MLA is a member of Legislative Assembly. A member of the municipal office is called MC, meaning a member of the Municipal Council. Report Abuse. member of loksabha & member of rajya sabha is called as Member of Parliament(MP) member of legislative asssembly is called s member of legislative assembly(MLA) & those who contest municipal elections they r called as muncipal corporators."}, {"url": "https://en.wikipedia.org/wiki/Indian_parliament", "passage_text": "The Indian Parliament consists of two houses called the Lok Sabha and the Rajya Sabha with the President of India acting as their head. India's government is bicameral; Rajya Sabha is the upper house and Lok Sabha is the lower house. The two houses meet in separate chambers in the Sansad Bhavan (located on the Sansad Marg or Parliament Street) in New Delhi."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20070423045117AANTf7v", "passage_text": "member of lok sabah and rajya sabha is called MP (member of parliment) and member of legislative assembly called MLA(member of legislative assembly). MP of lok saba is elected by the people and member of rajya saba is elected by parliment according to the members of each parties. Report Abuse. member of loksabha & member of rajya sabha is called as Member of Parliament(MP) member of legislative asssembly is called s member of legislative assembly(MLA) & those who contest municipal elections they r called as muncipal corporators."}, {"url": "http://www.answers.com/Q/What_is_rajya_sabha_lok_sabha_called_in_english", "passage_text": "Indian Parliament is a bicameral Parliament consisting of the President and two Houses known as the Council of States [Rajya-Sabha] and the House of the People [Lok-Sabha]. R … ajya-Sabha consists of not more than 250 members and of these 12 members are nominated by the President. Lok-Sabha is composed of representatives of the people chosen by the direct election on the basis of adult suffrage. Lok-Sabha has a maximum strength of 552; the current strength of Lok-Sabha is 545."}, {"url": "http://www.prsindia.org/parliamenttrack/about-parliament/the-indian-parliament-198/", "passage_text": "According to the Constitution of India, the union legislative body is called the Parliament. The Hindi term for Parliament is Sansad. The Parliament includes the President and the two Houses – the Council of States (Rajya Sabha) and the House of the People (Lok Sabha). This kind of system, with two Houses, is called a bicameral legislature. Rajya Sabha: The Rajya Sabha (Council of States) is the Upper House of Parliament. The House has a maximum of 250 members, out of which 12 members are nominated by the President for their expertise in specific fields of art, literature, science, and social services."}, {"url": "https://en.wikipedia.org/wiki/Indian_parliament", "passage_text": "Main article: Lok Sabha. Lok Sabha is also known as the House of the People or the lower house and has members from 543 parliamentary constituencies. All of its members are directly elected by citizens of India on the basis of universal adult franchise, except two who are appointed by the President of India. India's government is bicameral; Rajya Sabha is the upper house and Lok Sabha is the lower house. The two houses meet in separate chambers in the Sansad Bhavan (located on the Sansad Marg or Parliament Street) in New Delhi."}]