[{"url": "http://www.ncbi.nlm.nih.gov/books/NBK21603/", "passage_text": "Although DNA stores the information for protein synthesis and RNA carries out the instructions encoded in DNA, most biological activities are carried out by proteins. The accurate synthesis of proteins thus is critical to the proper functioning of cells and organisms. Ribosomal RNA (rRNA) associates with a set of proteins to form ribosomes. These complex structures, which physically move along an mRNA molecule, catalyze the assembly of amino acids into protein chains. They also bind tRNAs and various accessory molecules necessary for protein synthesis."}, {"url": "https://en.wikipedia.org/wiki/RNA", "passage_text": "Messenger RNA (mRNA) carries information about a protein sequence to the ribosomes, the protein synthesis factories in the cell. It is coded so that every three nucleotides (a codon) correspond to one amino acid. Transfer RNA (tRNA) is a small RNA chain of about 80 nucleotides that transfers a specific amino acid to a growing polypeptide chain at the ribosomal site of protein synthesis during translation."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-804-RNA%20AND%20DNA.aspx?activeIngredientId=804&activeIngredientName=RNA%20AND%20DNA", "passage_text": "RNA (ribonucleic acid) and DNA (deoxyribonucleic acid) are chemicals called nucleotides that are made by the body. They appear to be essential under conditions of rapid growth such as intestinal development, liver surgery or injury, and also during challenges to the immune system. "}, {"url": "https://answers.yahoo.com/question/index?qid=20091222055108AA1Ct3W", "passage_text": "RNA stores the codes for protein synthesis. It is copied from DNA and is very similar. There are many different kinds of RNA including messenger RNA, transfer RNA and ribosomal RNA. It has limited use in enzymes. Report Abuse. RNA mainly involves in translation of the genetic code or DNA to protein. Messenger RNA or mRNA functions as a template for protein synthesis.The codon of the mRNA, the three base sequence, code for one amino acid. Protein synthesis takes place in the ribosomes, which in part comprise of rRNA or ribosomal RNA"}, {"url": "https://answers.yahoo.com/question/index?qid=20130206142846AAFPVBm", "passage_text": "· just now. Report Abuse. Well there are different types of RNA: -messenger RNA (mRNA) carries information from the DNA to the ribosomes and is translated into proteins. - tRNA brings amino acids to the ribosomes. - ribosomal RNA links amino acids together to form the proteins Some RNAs also control gene expression, catalyze reactions etc. "}, {"url": "http://www.answers.com/Q/What_does_the_RNA_do", "passage_text": "messenger RNA (mRNA) is a copy of genomic DNA that codes for a specific protein. DNA cannot leave the nucleus and enter the cytoplasm, where ribosomes make the proteins. There … fore there need to be a way to get the code that's on the DNA to the ribosomes so that it can become protein. mRNA is the solution. All cellular organisms use messenger RNA (mRNA) to carry the genetic information that directs the synthesis of proteins. In addition, some viruses use RNA instead of DNA as their genetic material; perhaps a reflection of the suggested key role of RNA in the evolutionary history of life on Earth."}, {"url": "http://www.answers.com/Q/What_does_the_RNA_do", "passage_text": "RNA fits through the pores of the nuclear membrane, unlike the DNA, allowing it to transport all of the information to the specific parts. When RNA copies parts of DNA, it only copies parts of it, only the parts needed. For example, it would not copy information needed for fingernails if it needed one for skin. All cellular organisms use messenger RNA (mRNA) to carry the genetic information that directs the synthesis of proteins. In addition, some viruses use RNA instead of DNA as their genetic material; perhaps a reflection of the suggested key role of RNA in the evolutionary history of life on Earth."}, {"url": "https://en.wikipedia.org/wiki/RNA", "passage_text": "Messenger RNA (mRNA) is the RNA that carries information from DNA to the ribosome, the sites of protein synthesis (translation) in the cell. The coding sequence of the mRNA determines the amino acid sequence in the protein that is produced. Transfer RNA (tRNA) is a small RNA chain of about 80 nucleotides that transfers a specific amino acid to a growing polypeptide chain at the ribosomal site of protein synthesis during translation."}, {"url": "https://en.wikipedia.org/wiki/Transfer_RNA", "passage_text": "The interaction of tRNA and mRNA in protein synthesis. A transfer RNA (abbreviated tRNA and archaically referred to as sRNA, for soluble RNA) is an adaptor molecule composed of RNA, typically 76 to 90 nucleotides in length, that serves as the physical link between the mRNA and the amino acid sequence of proteins. "}]