[{"url": "https://tshaonline.org/handbook/online/articles/hlh49", "passage_text": "HOCKLEY, TX. HOCKLEY, TEXAS. Hockley is thirty-six miles northwest of Houston on State Highway 6, U.S. Highway 290, and the Southern Pacific line in northwestern Harris County. The earliest settler in the vicinity was Sam McCurley, who in 1829 lived a few miles from the site of present Hockley. The Houston and Texas Central Railway began service to the community in May 1857. A post office was established there as Houseville in 1858, but the name was changed to Hockley before the end of the year. During the late 1860s efforts to make Hockley the county seat of a new county known as Hockley failed."}, {"url": "https://en.wikipedia.org/wiki/Hockley,_Texas", "passage_text": "For the county in west Texas, see Hockley County, Texas. Hockley, Texas is an unincorporated community located in Harris County, Texas on Texas State Highway 6 and U.S. Highway 290, approximately five miles southeast of the city hall of Waller, and thirty-six miles northwest of Downtown Houston. The community serves as the main hub for railway traffic serving Houston, Austin, and many parts of central Texas. The Southern Pacific rail line is one of the community's major employers. The community is surrounded by grain farms and cattle ranches."}, {"url": "https://en.wikipedia.org/wiki/Hockley_County,_Texas", "passage_text": "Hockley County was formed in 1876 from portions of Bexar and Young Counties. It was named for George Washington Hockley, the commander of artillery in the Battle of San Jacinto and later Secretary of War of the Republic of Texas. The county was created in 1876 but not organized until 1921. It is named for George Washington Hockley, a"}, {"url": "http://www.texasonlinerecords.com/clerk/index?office_id=9", "passage_text": "The District Clerk's Office, Hockley County, Texas provides this web site as a public service. Information available on this web site is collected, maintained, and provided solely for the convenience of the public users. "}, {"url": "http://www.co.hockley.tx.us/", "passage_text": "If HOCKLEY COUNTY adopts a 2010 tax rate equal to the effective tax rate. of $0.310206 per $100 of value, taxes would increase compared to 2009 taxes by $7,140. "}, {"url": "https://en.wikipedia.org/wiki/Hockley_County,_Texas", "passage_text": "Hockley County is a county located in the U.S. state of Texas. As of the 2010 census, its population was 22,935. Its county seat is Levelland. The county was created in 1876 but not organized until 1921. It is named for George Washington Hockley, a Secretary of War of the Republic of Texas."}, {"url": "https://tshaonline.org/handbook/online/articles/hch16", "passage_text": "HOCKLEY COUNTY. HOCKLEY COUNTY. Hockley County (B-9) is in northwestern Texas, south of the Panhandle and on the Llano Estacado, bordered on the east by Lubbock County, on the south by Terry County, on the west by Cochran County, and on the north by Lamb County. John Leffler, HOCKLEY COUNTY, Handbook of Texas Online (http://www.tshaonline.org/handbook/online/articles/hch16), accessed October 04, 2015. Uploaded on June 15, 2010. Published by the Texas State Historical Association."}, {"url": "https://tshaonline.org/handbook/online/articles/hch16", "passage_text": "Communities in Hockley County include Levelland (1990 population, 13,986), the largest city and the location of South Plains College; Anton (1,212), which bills itself as the Rabbit Capital of Texas; and Sundown (1,759), Smyer, Ropesville, Arnett, Claudene, Lockettville, Pep, and Roundup. John Leffler, HOCKLEY COUNTY, Handbook of Texas Online (http://www.tshaonline.org/handbook/online/articles/hch16), accessed October 04, 2015. Uploaded on June 15, 2010. Published by the Texas State Historical Association."}, {"url": "http://www.hockleycad.org/", "passage_text": "Welcome to Hockley County Appraisal District! Within this site you will find general information about the District and the ad valorem property tax system in Texas, as well as information regarding specific properties within the district. Hockley Appraisal District is responsible for appraising all real and business personal property within Hockley County. The district appraises property according to the Texas Property Tax Code and the Uniform Standards of Professional Appraisal Practices (USPAP)."}]