[{"url": "http://faculty.ncc.edu/LinkClick.aspx?fileticket=Do55cHKUGm4%3d&tabid=1885", "passage_text": "So is tarnishing of the silverwares. There are two kinds of processes, spontaneous and non-spontaneous. A spontaneous process is the process that occurs under the given the set of conditions. Keep in mind that, it does not mean instantaneous process. A non-spontaneous process is the process that does not occur under the specified set of conditions. We encounter spontaneous processes every day, but we never realize that they are spontaneous."}, {"url": "https://en.wikipedia.org/wiki/Spontaneous_process", "passage_text": "When δS is negative and δH is negative, the relative magnitudes of δS and δH determine if the reaction is spontaneous. Low temperatures make the reaction more favorable. When δS is negative and δH is positive, a process is not spontaneous at any temperature, but the reverse process is spontaneous. A spontaneous process is the time-evolution of a system in which it releases free energy (usually as heat) and moves to a lower, more thermodynamically stable energy state. When δ S is positive and δ H is negative, a process is always spontaneous. When δ S is positive and δ H is positive, the relative magnitudes of δ S and δ H determine if the reaction is spontaneous. High temperatures make the reaction more favorable."}, {"url": "https://en.wikipedia.org/wiki/Spontaneous_process", "passage_text": "From Wikipedia, the free encyclopedia. When δS is positive and δH is negative, a process is always spontaneous When δS is positive and δH is positive, the relative magnitudes of δS and δH determine if the reaction is spontaneous. When δ S is positive and δ H is negative, a process is always spontaneous. When δ S is positive and δ H is positive, the relative magnitudes of δ S and δ H determine if the reaction is spontaneous. High temperatures make the reaction more favorable."}, {"url": "https://en.wikipedia.org/wiki/Spontaneous_emission", "passage_text": "From Wikipedia, the free encyclopedia. Spontaneous emission is the process by which a quantum system such as an atom, molecule, nanocrystal or nucleus in an excited state undergoes a transition to a state with a lower energy (e.g., the ground state) and emits quanta of energy. "}, {"url": "http://www.thebigger.com/chemistry/thermodynamics/second-law-of-thermodynamics/define-the-spontaneous-processes-with-example/", "passage_text": "Define the spontaneous processes with example. Spontaneous processes: A spontaneous process is one in which heat is transferred through a finite temperature. Spontaneous process is also known as irreversible process because these processes take place at very fast rate. All the natural processes are spontaneous processes. Examples of irreversible processes are as follow"}, {"url": "http://chemwiki.wikidot.com/spontaneous-processes", "passage_text": "Spontaneous processes are processes that occur without any outside intervention. Spontaneous processes have a definite direction. For example methane once lit burns producing CO 2(g) and H 2 O (g) without intervention, however, CO 2(g) and H 2 O (g) don't combine to make methane and oxygen without outside intervention. For example the process of water freezing is only spontaneous when the temperature is less then 0° C. When water is at a temperature above 0° C the process of freezing is no longer spontaneous. However, when the temperature = 0° C the solid and liquid phases are in equilibrium."}]