[{"url": "http://www.foxnews.com/leisure/2012/06/22/how-do-fix-dent-in-my-car/", "passage_text": "Find out the manufacturer's code for the color of your car so you get it right the first time. Leave the fixing to the professionals Haltom lists the following steps that a technician will do to fix a dent: 1  The technician will remove the paint from the dent."}, {"url": "http://www.wisebread.com/remove-car-dents-quickly-and-cheaply", "passage_text": "1. Remove a dent with dry ice. You can find dry ice in many places these days, even your local grocery store. It's cheap too, around $2 or less for a pound (you can buy it in bulk online for even cheaper). All you do is touch the dry ice to the dent for a few seconds and repeat the process until the dent is gone."}, {"url": "http://www.autos.com/auto-repair/average-cost-to-fix-a-car-dent", "passage_text": "Obtaining a car dent estimate for repair, you could safely use the 1-inch guideline of around $25 per inch, over and above the base price. The average cost of repairing a one inch sized dent is somewhere in the region of $60 to $110 depending on your location and the company that does the job."}, {"url": "http://www.foxnews.com/leisure/2012/06/22/how-do-fix-dent-in-my-car/", "passage_text": "Try to fix it yourself If the paint isn't affected by the dent, you can try the do-it-yourself route. You will need some tools, including a few different sizes of body hammers. You will also need some dollies. Check out what tools you already have at your disposal and see which DIY method works best in your situation."}, {"url": "http://www.foxnews.com/leisure/2012/06/22/how-do-fix-dent-in-my-car/", "passage_text": "If you have a little ding, you may be able to fix the problem with a hair dryer and dry ice or a can of condensed air. (You don't want to try this on a dent with any paint damage.). Heat the dented area with a hair dryer, making sure to hold it five to seven inches away from the panel. Keep the hair dryer moving, and continue for one to three minutes. The area should be warm to touch. While it is still warm, apply the cold component."}, {"url": "http://www.youtube.com/watch?v=u0IJjKh-dWE", "passage_text": "- This is a 30 minute video that demonstrates a method of how to fix dents in your car repair. It covers everything from dent repair to applying body filler (bondo) and block sanding the body filler."}, {"url": "http://diy-auto-repair.wonderhowto.com/how-to/fix-huge-dent-your-car-home-without-ruining-paint-job-0146581/", "passage_text": "1 How to Get a Dent Out of a Car Using Just a Plunger. 2  How to Remove a Vehicle Dent with a Hair Dryer & Compressed Air. 3  How to Repair a dent without paint. 4  Remove Scratches & Scuff Marks in Your Car's Paint Job with Toothpaste."}, {"url": "http://www.wikihow.com/Remove-a-Dent-in-Car-With-a-Hair-Dryer", "passage_text": "However, as an alternative you can repair and remove some kinds of dents from your car with the help of such common household items such as a hair dryer and either dry ice or a can of compressed air. Continue reading this article to learn how to remove dents from your car using these materials."}]