[{"url": "http://www.nprsr.qld.gov.au/parks/carnarvon-gorge/pdf/carnarvon-gorge-vg-bp044-lr.pdf", "passage_text": "Welcome to Carnarvon Gorge section Carnarvon National Park Carnarvon Gorge is an oasis in the semi-arid heart of Central Queensland. Here, towering white sandstone cliffs form a spectacular steep-sided gorge with narrow, vibrantly-coloured and lush side-gorges. This is the only place in Carnarvon Gorge designated for swimming. If swimming, please do not jump or dive into the pool.Class 3• 300 m one-way from the Rock Pool car park, OR• 1.8 km one-way from the national park visitor area."}, {"url": "http://www.nprsr.qld.gov.au/parks/carnarvon-gorge/pdf/carnarvon-gorge-vg-bp044-lr.pdf", "passage_text": "Relax at the visitor area With its many facilities, the Carnarvon Gorge visitor area is an ideal place to enjoy a picnic or barbecue. This is a good spot to see some of the area’s wildlife, including eastern grey kangaroos, whiptail wallabies, apostlebirds and lace monitors. This is the only place in Carnarvon Gorge designated for swimming. If swimming, please do not jump or dive into the pool.Class 3• 300 m one-way from the Rock Pool car park, OR• 1.8 km one-way from the national park visitor area."}, {"url": "http://www.discovery-campervans.com.au/catalogue/article_carnarvongorge_301.php", "passage_text": "A Carnarvon Gorge Cliff Face. Carnarvon Gorge is one of Queensland's hidden treasures, with a smorgasbord of natural attractions in every direction. Driving from Brisbane, the easiest route is via Roma and Injune which takes about nine hours. Alternatively, it is half the distance south west from Rockhampton. You need to plan for at least three days to a week to experience the best of Carnarvon Gorge. There is something about driving through the outback in a camervan hire Queensland for miles and finally reaching an oasis of such magnitude. Once you visit you will have to come back again and again."}, {"url": "http://www.kidspot.com.au/thingstodo/carnarvon-gorge-carnarvon-national-park/qld-brisbane/53904.htm", "passage_text": "Carnarvon GorgeCarnarvon National Park. Hidden in the rugged ranges of Queensland's central highlands, Carnarvon Gorge features towering sandstone cliffs, vibrantly coloured side gorges, diverse flora and fauna and Aboriginal rock art. The Aboriginal Traditional Owners of the area that falls within Carnarvon National Park welcome you and request that you treat the country through which you walk with respect and care."}, {"url": "https://en.wikipedia.org/wiki/Carnarvon_Gorge", "passage_text": "Carnarvon Gorge is located in the Southern Brigalow Belt bioregion in Central Queensland (Australia), 593 km northwest of Brisbane. Primarily created by water erosion, Carnarvon Gorge is around 30 kilometres long, located in Carnarvon National Park, and six hundred metres deep at the mouth. Two years later, Thomas Mitchell passed to the west of Carnarvon Gorge. It was Mitchell who named the Carnarvon Range after Caernarfon in Wales. The reports of pastureland and good water carried back to the colonies brought settlers to the area, and began a period of bloody conflict between settlers and Aboriginals."}, {"url": "http://takarakka.com.au/", "passage_text": "Carnarvon Gorge Caravan Park and Holiday Accommodation. Discover the beauty of Carnarvon Gorge National Park and its many hidden treasures. Choose from self contained accommodation, bring your caravan, roll out a swag or try a Taka Tent for some glamping. Takarakka Bush Resort is open all year round and has 14 years of history offering great holiday accommodation. We welcome you to browse the website for holiday inspiration and answers to your questions on accessing and exploring Carnarvon Gorge."}, {"url": "http://www.nprsr.qld.gov.au/parks/carnarvon-gorge/pdf/carnarvon-gorge-vg-bp044-lr.pdf", "passage_text": "Carnarvon Gorge section Carnarvon National Park Park guide ©State of Queensland 2012.Department of National Parks, Recreation, Sport and Racing. BP0044 May 2013Printed on eco-friendly paper to save energy and resources. This is the only place in Carnarvon Gorge designated for swimming. If swimming, please do not jump or dive into the pool.Class 3• 300 m one-way from the Rock Pool car park, OR• 1.8 km one-way from the national park visitor area."}, {"url": "http://takarakka.com.au/", "passage_text": "With the great Australian outback as our backdrop and surrounded by the majestic cliffs and expansive landscape of Carnarvon Gorge, Takarakka Bush Resort is the ultimate wilderness resort to start your adventure into one of Queensland’s iconic destinations. Takarakka Bush Resort is open all year round and has 14 years of history offering great holiday accommodation. We welcome you to browse the website for holiday inspiration and answers to your questions on accessing and exploring Carnarvon Gorge."}, {"url": "http://www.nprsr.qld.gov.au/parks/carnarvon-gorge/pdf/carnarvon-gorge-vg-bp044-lr.pdf", "passage_text": "Carnarvon Gorge, in the heart of Queensland’s central highlands, has been carved from sandstone by water and time. The basalt-capped Consuelo Tableland, at over 1000 metres above sea level, rises high above the meandering path of Carnarvon Creek. Photo: Qld Govt. This is the only place in Carnarvon Gorge designated for swimming. If swimming, please do not jump or dive into the pool.Class 3• 300 m one-way from the Rock Pool car park, OR• 1.8 km one-way from the national park visitor area."}, {"url": "http://www.capricornholidays.com.au/destinations/rolleston/attractions/carnarvon-gorge-carnarvon-national-park", "passage_text": "More Info. Hidden in the rugged ranges of Queensland's central highlands, Carnarvon Gorge features towering sandstone cliffs, vibrantly coloured side gorges, diverse flora and fauna and Aboriginal rock art. This spectacular gorge system, an oasis in the semi-arid heart of Central Queensland, is the central highlands' most popular attraction. Here, the boulder-strewn Carnarvon Creek winds through the gorge, through eucalypt and cabbage palm forests, which attract 170 bird species."}]