[{"url": "http://www.babynamespedia.com/meaning/Ananias", "passage_text": "[ 4 syll. a-na-nias, an-ani-as ] The baby boy name Ananias is pronounced aeN-ah-N AY-ahS (English) †. Ananias is of Hebrew origin and it is predominantly used in the English language. The name means 'God was gracious'. Chananya (Hebrew) is an old form of Ananias. A variation of Ananias is Annas (English). Ananias is a rare baby boy name. It is not listed in the top 1000. "}, {"url": "http://www.abarim-publications.com/Meaning/Ananias.html", "passage_text": "Ananias meaning. If Ananias is indeed the same as Hananiah, it means Yahweh Has Been Gracious (NOBSE Study Bible Name List and BDB Theological Dictionary), or Graciously Given Of The Lord (Alfred Jones' Dictionary of Old Testament Proper Names). | copyright | author | contact | Biblical names | home |"}, {"url": "http://www.biblestudytools.com/dictionary/ananias/", "passage_text": "Dictionaries-Easton's Bible Dictionary-Ananias. a common Jewish name, the same as Hananiah. 1  One of the members of the church at Jerusalem, who conspired with his wife Sapphira to deceive the brethren, and who fell down and immediately expired after he had uttered the falsehood (Acts 5:5). "}, {"url": "http://www.behindthename.com/name/ananias", "passage_text": "Meaning & History. From ‘ανανιας (Hananias) , the Greek form of HANANIAH. In Acts in the New Testament this is the name of three characters: a disciple in Damascus, the husband of Sapphira, and the high priest of the Jews who tries Paul. "}, {"url": "http://www.sheknows.com/baby-names/name/sapphira", "passage_text": "Greek Meaning: The name Sapphira is a Greek baby name. In Greek the meaning of the name Sapphira is: Jewel. Biblical Meaning: The name Sapphira is a Biblical baby name. In Biblical the meaning of the name Sapphira is: That relates or tells. Hebrew Meaning: The name Sapphira is a Hebrew baby name. In Hebrew the meaning of the name Sapphira is: Sapphire (gem); beautiful"}, {"url": "http://www.ancestry.com/name-origin?surname=anania", "passage_text": "Anania Name Meaning. Southern Italian and Greek (Ananias): from the personal name Anania, Greek Ananias, from Hebrew Hananyah, ‘answered by the Lord’. This was the name of a character mentioned in the New Testament (Acts 5), who was struck dead for lying."}, {"url": "http://www.sheknows.com/baby-names/name/ananias", "passage_text": "Biblical Meaning: The name Ananias is a Biblical baby name. In Biblical the meaning of the name Ananias is: The cloud of the Lord. SoulUrge Number: 3. Expression Number: 5. People with this name have a deep inner desire to create and express themselves, often in public speaking, acting, writing or singing."}, {"url": "http://www.thenamemeaning.com/ananias/", "passage_text": "Ananias Name Meaning. The meaning of Ananias is “From Jehovah”. Keep in mind that many names may have different meanings in other countries and languages, so be careful that the name that you choose doesn’t mean something bad or unpleasant. The name Ananias is of Hebrew origin, and is used mostly in English speaking countries but also in a few other countries and languages of the world."}, {"url": "http://www.meaning-of-names.com/israeli-names/ananias.asp", "passage_text": "Meaning of Ananias. Israeli name. In Israeli, the name Ananias means-the cloud of the lord.The name Ananias originated as an Israeli name. The name Ananias is most often used as a boy name or male name. Israeli Name Meaning-the cloud of the lord. Origin-Israel"}]