[{"url": "http://chemistry.about.com/od/elementfacts/a/vanadium.htm", "passage_text": "Uses: Vanadium is used in nuclear applications, for producing rust-resistant spring and high-speed tool steels, and as a carbide stabilizer in making steels. Approximately 80% of the vanadium that is produced is used as a steel additive or ferrovanadium. Natural vanadium is a mostly a mixture of the two isotopes, vanadium-50 (0.24%) and vanadium-51 (99.76%). Properties: Vanadium has a melting point of 1890+/-10°C, boiling point of 3380°C, specific gravity of 6.11 (18.7°C), with a valence of 2, 3, 4, or 5."}, {"url": "http://chemed.chem.purdue.edu/genchem/topicreview/bp/ch12/trans.php", "passage_text": "Oxidation States of the Transition Metals. Position of Transition Metals in the Periodic Table. The elements in the periodic table are often divided into four categories: (1) main group elements, (2) transition metals, (3) lanthanides, and (4) actinides. "}, {"url": "http://chemistry.about.com/od/elementfacts/a/vanadium.htm", "passage_text": "Isotopes: There are 20 known isotopes of vanadium ranging from V-23 to V-43. Vanadium has only one stable isotope: V-51. V-50 is nearly stable with a half-life of 1.4 x 10 17 years. Natural vanadium is a mostly a mixture of the two isotopes, vanadium-50 (0.24%) and vanadium-51 (99.76%). Properties: Vanadium has a melting point of 1890+/-10°C, boiling point of 3380°C, specific gravity of 6.11 (18.7°C), with a valence of 2, 3, 4, or 5."}, {"url": "https://www.webelements.com/vanadium/", "passage_text": "Pure vanadium is a greyish silvery metal, and is soft and ductile. It has good corrosion resistance to alkalis, sulphuric acid, hydrochloric acid, and salt waters. The metal oxidizes readily above 660°C to form V 2 O 5. Industrially, most vanadium produced is used as an additive to improve steels. 1  Name: vanadium. 2  Symbol: V. 3  Atomic number: 23. 4  Relative atomic mass (Ar) : 50.9415 (1). 5  Standard state: solid at 298 K. 6  Colour: silvery grey metallic. 7  Classification: Metallic. 8  Group in periodic table: 5"}, {"url": "http://periodic.lanl.gov/about.shtml", "passage_text": "By examining an element's position on the periodic table, one can infer the electron configuration. Elements that lie in the same column on the periodic table (called a group) have identical valance electron configurations and consequently behave in a similar fashion chemically. The periodic table is the most important chemistry reference there is. It arranges all the known elements in an informative array. Elements are arranged left to right and top to bottom in order of increasing atomic number."}, {"url": "https://en.wikipedia.org/wiki/Group_5_element", "passage_text": "From Wikipedia, the free encyclopedia. Group 5 (by IUPAC style) is a group of elements in the periodic table. Group 5 contains vanadium (V), niobium (Nb), tantalum (Ta) and dubnium (Db). This group lies in the d-block of the periodic table. The group itself has not acquired a trivial name; it belongs to the broader grouping of the transition metals. The lighter three Group 5 elements occur naturally and share similar properties; all three are hard refractory metals under standard conditions"}, {"url": "http://periodic.lanl.gov/23.shtml", "passage_text": "Vanadium is used in producing rust resistant and high speed tool steels. It is an important carbide stabilizer in making steels. About 80% of the vanadium now produced is used as ferrovanadium or as a steel additive. Vanadium foil is used as a bonding agent in cladding titanium to steel. Vanadium pentoxide is used in ceramics and as a catalyst. It is also used to produce a superconductive magnet with a field of 175,000 gaus"}, {"url": "http://www.rsc.org/periodic-table/element/23/vanadium", "passage_text": "Uses. About 80% of the vanadium produced is used as a steel additive. Vanadium-steel alloys are very tough and are used for armour plate, axles, tools, piston rods and crankshafts. Less than 1% of vanadium, and as little chromium, makes steel shock resistant and vibration resistant. It's also the catalytic power behind the production of sulphuric acid and its named after the Norse God of beauty, love and fertility. And to reveal her identify here's Chris Orvig. Chris Orvig. Vanadium, a first row transition metal in the Periodic Table, is an element of mystery."}, {"url": "http://www.livescience.com/29155-vanadium.html", "passage_text": "Vanadium was rediscovered in 1830 by Nils Gabriel Sefstrom. He named it in honor of the Scandinavian goddess Vanadis because of the element’s beautifully multicolored compounds. Properties of vanadium. Vanadium is a transition metal in Group 5 on the periodic table of the elements. In its pure form, vanadium is a bright white metal. It is soft, ductile and structurally strong. It is an important carbide stabilizer. About 80 percent of the vanadium now produced is used as ferrovanadium or as a steel additive. Vanadium foil is used as a bonding agent when cladding titanium to steel. Vanadium pentoxide is used in ceramics and as a catalyst."}]