[{"url": "http://www.yourdictionary.com/ardor", "passage_text": "noun. Ardor is defined as the feeling of being attracted to a person. An example of ardor is wanting to kiss a person with passion. The definition of ardor is a way of feeling or acting that is energetic and exciting. An example of ardor is a passionate speech."}, {"url": "http://www.learnersdictionary.com/definition/ardor", "passage_text": "[+] more examples [-] hide examples [+] Example sentences [-] Hide examples. 2. [noncount] : a strong feeling of love. young love, with all its ardor [= passion ] and intensity. "}, {"url": "http://www.oxforddictionaries.com/definition/american_english/ardor", "passage_text": "Enthusiasm or passion: they felt the stirrings of revolutionary ardor. More example sentences. Synonyms. 1  He turned to her, that same passion, desire, ardor, zeal, fire… love in his eyes. 2  Love, lust and passion, ardour, hate and jealousy combine to make Othello one of Shakespeare's greatest tragedies."}, {"url": "http://www.merriam-webster.com/dictionary/ardor", "passage_text": "Learn More About ARDOR. Thesaurus: All synonyms and antonyms for ardor. Spanish Central: Spanish translation of ardor. Nglish: Translation of ardor for Spanish speakers. Britannica English: Translation of ardor for Arabic speakers."}, {"url": "http://www.merriam-webster.com/dictionary/ardor", "passage_text": "passion applies to an emotion that is deeply stirring or ungovernable. fervor implies a warm and steady emotion. ardor suggests warm and excited feeling likely to be fitful or short-lived. enthusiasm applies to lively or eager interest in or admiration for a proposal, cause, or activity."}, {"url": "http://www.thefreedictionary.com/ardor", "passage_text": "While I was in the full flush of this ardor there came to see our school, one day, a Mexican gentleman who was studying the American system of education; a mild, fat, saffron man, whom I could almost have died to please for Cervantes' and Don Quixote's sake, because I knew he spoke their tongue."}]