[{"url": "https://www.lovethatpet.com/small-pets/snakes/", "passage_text": "All snakes should also have some under-tank heating. You need to be careful here: You don’t just stick a heating pad under the tank, turn it on, and ignore it. It needs to be small enough to provide heat to only part of the floor, under part of the hidey-home. The idea is to provide what is called a “heat gradient”. Let’s say, for example, that the ideal temperature for your snake is 30C. Another spot on the floor under the hidey-home should be a little warmer, at 31C, and still another should be 28C or 29C. Yet another section of the floor outside the hidey-hole, should be as cool as 22C-24C, and unheated."}, {"url": "http://exoticpets.about.com/od/othersnakes/p/greensnakes.htm", "passage_text": "Names: Scientific Names: the rough green snake is Opheodrys aestivus, and the smooth green snake is Opheodrys vernalis. Common Names: these snakes are sometimes called by a variety of other names, such as grass snakes, green whip snakes, garden snakes, vine snakes, and keeled green snakes. This can lead to much confusion (for example the term grass snake is also used for the European grass snake, Natrix natrix). These are small snakes so do not need a huge tank, but do need vertical space for climbing (even the more terrestrial smooth green snake). A 30 gallon is a good choice because it provides lots of space for greenery and hiding spots."}, {"url": "http://www.maine.gov/ifw/wildlife/human/lww_information/snakes.html", "passage_text": "Snakes are among the most misunderstood of all animals. As a result, many beneficial and harmless snakes have met untimely deaths at the hands of shovel-wielding humans. Of the nine species currently found in Maine (Table 1), none is capable of inflicting a venomous bite. Food and Feeding Behavior. 1  Snakes are predators and eat many animals thought to be pests, such as mice, voles, snails and slugs. 2  Other prey items include insects, birds and their eggs, fish and frogs."}, {"url": "http://www.maine.gov/ifw/wildlife/human/lww_information/snakes.html", "passage_text": "Snakes are an important part of the natural food web; they eat rodents, birds, frogs, insects, and on occasion other snakes. (In turn, a variety of other animals prey on snakes.) Besides their ecological value, snakes offer the careful wildlife viewer a chance to watch one of nature's most efficient predators. Food and Feeding Behavior. 1  Snakes are predators and eat many animals thought to be pests, such as mice, voles, snails and slugs. 2  Other prey items include insects, birds and their eggs, fish and frogs."}, {"url": "https://en.wikipedia.org/wiki/Cobra", "passage_text": "Cobra (/ˈkōbrə/ pronunciation (help·info)) is the Portuguese word for  snake . In English and in some other languages, it has been adopted as the name for any of various species of venomous snakes. Most of those species are in the family Elapidae, all of which are venomous. The name cobra is short for cobra de capelo or cobra-de-capelo, which is Portuguese for snake with hood, or hood-snake. In some modern languages, such as Afrikaans, the other part of the Portuguese name was adopted, and the predominant name for a cobra in Afrikaans is kapel."}, {"url": "http://www.livescience.com/27845-snakes.html", "passage_text": "Size. With so many different species, there are snakes of many different sizes. The world's smallest snake, according to National Geographic, is the thread snake, which grows to only about 3.9 inches (10 centimeters) long. It looks much like an earthworm. The largest snake, the reticulated python, can grow to a whopping 30 feet (9 meters). "}, {"url": "https://en.wikipedia.org/wiki/Snakes", "passage_text": "Snakes are elongated, legless, carnivorous reptiles of the suborder Serpentes that can be distinguished from legless lizards by their lack of eyelids and external ears. Like all squamates, snakes are ectothermic, amniote vertebrates covered in overlapping scales. They range in size from the tiny, 10 cm-long thread snake to the reticulated python of up to 6.95 meters (22.8 ft) in length. The fossil species Titanoboa cerrejonensis was 13 meters (43 ft) long."}, {"url": "http://www.maine.gov/ifw/wildlife/human/lww_information/snakes.html", "passage_text": "To repel snakes: Snake repellents, such as Snake-A-Way and the stronger Doctor T's Snake Away © have produced mixed results. Snakes smell things via their tongues and the Jacobson's organ, which is located in the roof of the mouth. Food and Feeding Behavior. 1  Snakes are predators and eat many animals thought to be pests, such as mice, voles, snails and slugs. 2  Other prey items include insects, birds and their eggs, fish and frogs."}]