[{"url": "https://www.healthtap.com/topics/how-long-to-heal-a-rotator-cuff-injury", "passage_text": "6-12 weeks: Typically, a rotator cuff strain resolves in 6-12 weeks. They are sometimes associated with other injuries that may take longer. Rotator cuff tears do not heal on their own. They may calm down and stop producing pain, but will not heal back to the original position."}, {"url": "https://www.hss.edu/physician-files/pearle/Rotator-Cuff-Surgery-FAQ.pdf", "passage_text": "A. The rotator cuff repair has to be protected for 4-6 weeks after surgery. As such, you will be in a sling for this time period. Passive motion with a therapist is often started within 1-2 weeks after the operation."}, {"url": "http://www.webmd.com/fitness-exercise/guide/rotator-cuff-tear?page=2", "passage_text": "What a lot of athletes really want to know is when they can get back in the game after a rotator cuff tear. But it's hard to say. Recovery time depends on how serious the tear is. It may take weeks or months. People heal at different rates. Obviously, if you need surgery, recovery will take longer."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/007207.htm", "passage_text": "Recovery can take 3 to 6 months, depending on the size of the tear and other factors. You may have to wear a sling for 4 to 6 weeks after surgery. Pain is usually managed with medicines."}, {"url": "https://www.sharecare.com/health/rotator-cuff/how-healing-rotator-cuff-surgery", "passage_text": "A Dr. Kristofer Jones, MD, Orthopedic Surgery, answered on behalf of UCLA Health. Total recovery from rotator cuff surgery can take up to about six months, but it will take about 12 months for you to feel completely happy with your outcome. While pain relief during recovery is predictable, function and range are not always as predictable."}, {"url": "http://www.webmd.com/fitness-exercise/guide/rotator-cuff-tear?page=2", "passage_text": "A small camera is inserted into the shoulder to see and repair the rotator cuff tear. If the tear is very large or involves more than one tendon, a small incision may be needed. Following arthroscopy, the arm will likely be in a sling for two to three weeks and physical therapy will be prescribed."}, {"url": "http://www.mcrh.org/Rotator-Cuff-Injuries/53434.htm", "passage_text": "Most of your pain should subside in a period over 8-12 weeks...however, the rotator cuff has a very poor blood supply and it may give you trouble for 6 months to a year."}, {"url": "http://www.ehow.com/how_5117803_heal-full-rotator-cuff-tear.html", "passage_text": "Have surgery to repair the rotator cuff tear, if your doctor determines you need it. The severity of the tear will dictate how much your doctor will be able to fix. Wear an immobilizer or a sling for a couple of weeks to keep the shoulder in one position."}]