[{"url": "http://www.south-africa-tours-and-travel.com/bantu.html", "passage_text": "Map showing the distribution of the population in South Africa by language groupThe Amazing Bantu Migration in Africa. Some 2 000 years ago, when the first waves of black settlers began arriving in southern Africa, they brought with them the advantages of an Iron Age culture, farming skills and domesticated crops. After they had settled in the eastern parts of South Africa, they eventually spread out across the highveld some 1 000 years ago, because of their need for more land on which to practise their growing cattle culture. The first African settlements in South Africa were mainly in the Transvaal and Natal areas."}, {"url": "https://en.wikipedia.org/wiki/Bantu_expansion", "passage_text": "The Bantu expansion is the name for a postulated millennia-long series of migrations of speakers of the original proto-Bantu language group. The primary evidence for this expansion has been linguistic, namely that the languages spoken in Sub-Equatorial Africa are remarkably similar to each other. The Niger–Congo family comprises a huge group of languages spread throughout Sub-Saharan Africa. The Benue–Congo branch includes the Bantu languages, which are found throughout Central, Southern, and Eastern Africa."}, {"url": "http://weber.ucsd.edu/~dkjordan/resources/clarifications/BantuExpansion.html", "passage_text": "The Word Bantu. The word Bantu (which means people in many Bantu languages) refers to a group of about 500 African languages and to their speakers, today numbering about 90 million people. The Bantu language most often taught in American Universities is Swahili, but there are many others. "}, {"url": "http://www.adrianastandard.8k.com/ClassPage/Notes/Ch6.htm", "passage_text": "Proto-Bantu was the first language spoken by a people who once lived in West Africa in what is now eastern Nigeria or Cameroon. The speakers of proto-Bantu are thought to be the ancestors of different groups of people living in east, central, and southern Africa today. Between 500 B.C. and A.D. 200, some of the villages where proto-Bantu speakers lived became crowded. Some people chose to migrate to find more farmland. For the next 2,000 years, descendants of the original proto-Bantu speakers continued migrating across east, central, and southern Africa. 1  the Congo Basin."}, {"url": "http://study.com/academy/lesson/the-bantu-people-migration-language-and-impact.html", "passage_text": "Most historians think Africa's history started with the Bantu peoples, a group of African language speakers (Bantu languages) that originally lived in the notch of western Africa. In around 1500 B.C.E., the Bantu speakers stumbled upon the domestication of yams and bananas. Just like wheat did in Mesopotamia and Egypt and rice did in India and China, having a stable supply of food made dramatic changes for the Bantu. They began domesticating goats at about the same time, as well. The way we know this is through the Bantu languages. Lesson Summary. In about 1500 B.C.E., a group of Bantu language speakers discovered that they could domesticate yams and bananas. They used their new food to increase their population and then spread their knowledge to all of Africa. This would be the first event in a chain reaction."}, {"url": "http://www.eduplace.com/kids/socsci/ca/books/bkf3/imaps/AC_06_206_bantu/AC_06_206_bantu.html", "passage_text": "The dense rain forest did not provide much room for farming. Some Bantu groups moved toward the east coast of southern Africa, where the land was more open and better-suited for growing crops. Other groups of Bantu-speakers migrated south into the dry, grassy west coast of southern Africa. "}, {"url": "https://en.wikipedia.org/wiki/Bantu_expansion", "passage_text": "From this core, expansion began about 3,000 years ago, with one stream going into East Africa, and other streams going south along the African coast of Gabon, Democratic Republic of the Congo, and Angola, or inland along the many south to north flowing rivers of the Congo River system. The Niger–Congo family comprises a huge group of languages spread throughout Sub-Saharan Africa. The Benue–Congo branch includes the Bantu languages, which are found throughout Central, Southern, and Eastern Africa."}, {"url": "https://answers.yahoo.com/question/index?qid=20071016152214AAgScQB", "passage_text": "A common characteristic of Bantu languages is that they use a stem form such as-ntu or-tu for 'person', and the plural prefix for people in many languages is ba-, together giving ba-ntu people. Bleek, and later Carl Meinhof, pursued extensive comparative studies of Bantu language grammars. Rating Newest Oldest. Best Answer: The Bantu languages (technically Narrow Bantu languages) constitute a grouping belonging to the Niger-Congo family. This grouping is deep down in the genealogical tree of the Bantoid grouping, which in turn is deep down in the Niger-Congo tree."}, {"url": "http://www.south-africa-tours-and-travel.com/bantu.html", "passage_text": "The great southward Bantu migration in Africa took place in sub-Saharan Africa (south of the Sahara Desert), over some 2,000 years. With the development of the iron blade, reaping became easier for the bantu people and agriculture took on a whole new meaning. After they had settled in the eastern parts of South Africa, they eventually spread out across the highveld some 1 000 years ago, because of their need for more land on which to practise their growing cattle culture. The first African settlements in South Africa were mainly in the Transvaal and Natal areas."}, {"url": "https://answers.yahoo.com/question/index?qid=20071016152214AAgScQB", "passage_text": "By one estimate, there are 513 languages in the Bantu grouping, 681 languages in Bantoid, and 1,514 in Niger-Congo.[1] Bantu languages are spoken basically east and south of the present day nation of Nigeria; i.e., in the regions commonly known as central Africa, east Africa, and southern Africa. Rating Newest Oldest. Best Answer: The Bantu languages (technically Narrow Bantu languages) constitute a grouping belonging to the Niger-Congo family. This grouping is deep down in the genealogical tree of the Bantoid grouping, which in turn is deep down in the Niger-Congo tree."}]