[{"url": "http://www.webmd.com/digestive-disorders/picture-of-the-liver", "passage_text": "Front View of the Liver. The liver is a large, meaty organ that sits on the right side of the belly. Weighing about 3 pounds, the liver is reddish-brown in color and feels rubbery to the touch. Normally you can't feel the liver, because it's protected by the rib cage. The liver has two large sections, called the right and the left lobes."}, {"url": "http://www.webmd.com/digestive-disorders/picture-of-the-liver", "passage_text": "© 2014 WebMD, LLC. All rights reserved. The liver is a large, meaty organ that sits on the right side of the belly. Weighing about 3 pounds, the liver is reddish-brown in color and feels rubbery to the touch. Normally you can't feel the liver, because it's protected by the rib cage. The liver has two large sections, called the right and the left lobes."}, {"url": "http://www.allhealthsite.com/liver-pain-location-causes-symptoms-and-treatment.html", "passage_text": "Liver pain is not something to be ignored. It could be a sign of a serious health condition. Therefore it is important to know where it is and what it does in the body. Your liver is located near your abdomen on the right side,actually beneath your ribs and above your diaphragm which separates the chest and the abdomen."}, {"url": "http://www.livercleansing-diet.org/where-is-your-liver/", "passage_text": "Answers to where is your liver located, what does the liver do and how to keep a healthy liver. The liver is actually one of the most powerful organs in your body (next to the brain and heart, probably), and it serves more functions than most of your organs."}, {"url": "http://www.livercleansing-diet.org/where-is-your-liver/", "passage_text": "Well, first of all the liver is a nifty little organ that you can find nestled snugly beneath your ribs on the right side of your body. It is immediately beneath your lungs and your heart, and it kind of wraps protectively around the top part of your stomach."}, {"url": "http://www.medicinenet.com/liver_anatomy_and_function/article.htm", "passage_text": "The liver is the largest internal organ of the body and is located in the right upper quadrant of the abdomen, beneath the diaphragm and is protected by the lower right ribs. It also extends across the midline toward the left upper quadrant of the abdomen."}, {"url": "http://www.innerbody.com/image_digeov/card10-new2.html", "passage_text": "Weighing in at around 3 pounds, the liver is the body’s second largest organ; only the skin is larger and heavier. The liver performs many essential functions related to digestion, metabolism, immunity, and the storage of nutrients within the body."}, {"url": "http://www.mayoclinic.org/diseases-conditions/liver-problems/multimedia/the-liver/img-20007443", "passage_text": "The liver is your largest internal organ. About the size of a football, it's located mainly in the upper right portion of your abdomen, beneath the diaphragm and above your stomach, but a small portion extends into the upper left quadrant."}]