[{"url": "http://www.fixr.com/costs/carpet-installation", "passage_text": "1 Selecting the carpet-carpeting can cost as little as $2 per square foot, or as high as $100 per square yard, but the average carpet and pad will cost between $30 and $40 per square yard-for a total of around $995 for the carpeting alone. 1 Extra charges for removing and discarding pre-existing carpeting which could see the rate increase by an additional $4 per yard; 2  Fees assigned to the installation of  Berber  rugs which can run at $3 per yard; and."}, {"url": "http://home.costhelper.com/carpeting.html", "passage_text": "Related articles: Hardwood Floors, Vinyl Flooring, Home Addition. 1  Prices range from $2 a square foot for the most inexpensive carpeting, including some self-adhesive carpet tiles, to as much as $100 a square yard for high-end or custom project. 1 Installers may also charge an extra $1-$2 a square yard to move furniture, another $1-$2/square yard for removing the existing carpeting; $1-$2/square yard for disposing of the old carpet; and $1-$2 extra for installing berber (loose loop) style products. 2  There are also extra fees for steps and oddly-shaped rooms."}, {"url": "http://www.hgtv.ca/renosdiy/article/common-renovating-costs-flooring/", "passage_text": "Cork. Carpet. 1  Typical hardwood, engineered wood and also bamboo are similarly priced around $4 to $6 a square foot, and $2 installation per square foot. 2  If your particular project requires the removal of your existing floors, then be sure to budget for an additional $1 per square foot for discard. 1 This will cost you approximately $1 to $3 per square foot in material and $1.50 in labor, assuming your subfloors are in tact. 2  An increasingly popular flooring type is cork. 3  An environmentally-friendly material, cork is a renewable resource and is dense enough to withstand heavy traffic and weight."}, {"url": "http://home.costhelper.com/carpeting.html", "passage_text": "1 Prices range from $2 a square foot for the most inexpensive carpeting, including some self-adhesive carpet tiles, to as much as $100 a square yard for high-end or custom project. 2  Decent carpeting and padding can usually be installed for $19-$38 a square yard, or $300-$600 for a 12x12-foot room. 1 Installers may also charge an extra $1-$2 a square yard to move furniture, another $1-$2/square yard for removing the existing carpeting; $1-$2/square yard for disposing of the old carpet; and $1-$2 extra for installing berber (loose loop) style products. 2  There are also extra fees for steps and oddly-shaped rooms."}, {"url": "http://www.concretenetwork.com/concrete/interiorfloors/cost.html", "passage_text": "Video on the cost of concrete floors. Depending on the level of complexity, concrete floors can cost as little as $2 to $6 a square foot or be as expensive as $15 to $30 a square foot. 1 Extensive surface preparation, such as grinding, crack repair, and spall repair, can add as much as $2 per square foot to the overall cost of the floor. 2  If a full resurfacing is needed, expect to tack on another $2 to $3 per square foot (for a $4 to $5 per square foot increase)."}, {"url": "http://www.carpetprofessor.com/carpet_cost.htm", "passage_text": "Typical Carpet Cost: Range from $15 to $22 per yard Carpet Face Weight: 30 to 40 ounce Carpet Fiber: Nylon, Sorona PTT, Smartstrand Common Styles: Plush, textured plush, sculptured, Berber, Cut Pile, Saxony Typical Lifespan: 6 to 12 years Padding Cost: Ranges from $3.00 - $5.50 per square yard. 1. The Carpet & Pad prices below do not reflect how much it will cost to install your carpet. Carpet installation costs vary depending on what part of the country you live in; how difficult your project is; and what Carpet Style and Carpet Quality you select. The Best & Worst Places to Buy New Carpet"}, {"url": "http://home.costhelper.com/carpeting.html", "passage_text": "1 Decent carpeting and padding can usually be installed for $19-$38 a square yard, or $300-$600 for a 12x12-foot room. 2  If it's not included, add, $2.50-$6 a square yard for padding. 3  Be skeptical of prices that include free padding, because good padding increases the life span of your carpet; ask about upgrades. 1 Installers may also charge an extra $1-$2 a square yard to move furniture, another $1-$2/square yard for removing the existing carpeting; $1-$2/square yard for disposing of the old carpet; and $1-$2 extra for installing berber (loose loop) style products. 2  There are also extra fees for steps and oddly-shaped rooms."}, {"url": "http://www.abccarpets.com/carpet_cost.htm", "passage_text": "A typical 2 Bedroom home requires about 100 yards of Carpet. Here's what it will likely cost you for the Carpet, Padding and Installation depending on your Traffic Level and How Long you want your Carpet to Last. Estimated Cost for 100 yards of Nylon Carpet / Pad, Installed. Installation prices vary depending on what part of the country you live in; how difficult your project is; and what style and grade of carpet you select. Carpet Cost vs. Longevity Chart The more you spend, the better grade of carpet you will get."}]