[{"url": "https://quizlet.com/21717022/microbiology-chapter-1-flash-cards/", "passage_text": "The work of Tyndall and Cohn supported the idea of spontaneous generation. was used to explain why others investigating spontaneous generation had obtained results that were opposite of those obtained by Pasteur. showed that microbes caused disease. allowed scientists to see microorganisms. Outbreaks of this illness have been observed in several other countries in Asia and the Middle East across the last 50 years, but not in the United States. This is clearly an emerging infection. It hasn't been around that long, and it has made a jump across continents into a new susceptible population."}, {"url": "https://quizlet.com/21717022/microbiology-chapter-1-flash-cards/", "passage_text": "The Golden Age of Microbiology was the time when: a. microorganisms were first used to make bread b. microorganisms were first used to make cheese c. most pathogenic bacteria were identified d. a vaccine against influenza was developed e. antibiotics became available. C. Outbreaks of this illness have been observed in several other countries in Asia and the Middle East across the last 50 years, but not in the United States. This is clearly an emerging infection. It hasn't been around that long, and it has made a jump across continents into a new susceptible population."}, {"url": "http://wanttoknowit.com/who-discovered-cells/", "passage_text": "Robert Hooke is the scientist that is usually credited with the discovery of the cell. He was the first to use the word cell, because the first cells he observed looked similar to monk’s cells. He observed cork cells and published his findings in a book called Micrographia in 1665. He discovered many different types of cells including bacteria, sperm, muscle fibers and protozoa. He was also made the first description of a red blood cell. It wasn’t until 1839 that Theodor Schwann and Matthias Jakob Schleiden co-founded the principal of cell theory."}, {"url": "https://explorable.com/discovery-of-bacteria", "passage_text": "Discovery of Bacteria and Other Achievements. Antony Leeuwenhoek was the first person to see bacteria. Through the late 1670s, he sent comprehensive data and detailed drawings of his sightings of bacteria and algae to the Royal Society in London. Colorized low-temperature electron micrograph of a cluster of E. coli bacteria, Microbe World. Van Leeuwenhoek discovered protozoa - the single-celled organisms and he called them animalcules. He also improved the microscope and laid foundation for microbiology. He is often cited as the first microbiologist to study muscle fibers, bacteria, spermatozoa and blood flow in capillaries"}, {"url": "http://www.history-of-the-microscope.org/anton-van-leeuwenhoek-microscope-history.php", "passage_text": "He was also the first to record and observe muscle fibres, bacteria, spermatozoa and blood flow in capillaries (small blood vessels). Born in Delft, the Netherlands, on October 24, 1632, Anton van Leeuwenhoek (in Dutch Antonie van Leeuwenhoek) was the son of a basket maker. A history of the compound microscope. Anton van Leeuwenhoek (1632 - 1723) was a Dutch tradesman and scientist, best known for his work on the development and improvement of the microscope and also for his subsequent contribution towards the study of microbiology."}, {"url": "https://en.wikipedia.org/wiki/Antonie_van_Leeuwenhoek", "passage_text": "Antonie Philips van Leeuwenhoek (/ˈleɪvənhʊk/ , [ɑnˈtoːni vɑn ˈleːuə(n)ˌɦuk]. ; October 24, 1632 – August 26, 1723) was a Dutch tradesman and scientist. He is commonly known as  the Father of Microbiology , and considered to be the first microbiologist. He is best known for his work on the improvement of the microscope and for his contributions towards the establishment of microbiology. Van Leeuwenhoek married Barbara de Mey in July 1654, with whom he would have one surviving daughter, Maria (four other children died in infancy). That same year he returned to Delft, where he would live and study for the rest of his life. He opened a draper's shop, which he ran throughout the 1650s."}, {"url": "https://en.wikipedia.org/wiki/Antonie_van_Leeuwenhoek", "passage_text": "Antonie van Leeuwenhoek was born in Delft, Dutch Republic, on October 24, 1632. On 4 November he was baptized as Thonis. His father, Philips Antonisz van Leeuwenhoek, was a basket maker who died when Antonie was only five years old. Van Leeuwenhoek married Barbara de Mey in July 1654, with whom he would have one surviving daughter, Maria (four other children died in infancy). That same year he returned to Delft, where he would live and study for the rest of his life. He opened a draper's shop, which he ran throughout the 1650s."}, {"url": "https://en.wikipedia.org/wiki/Antonie_van_Leeuwenhoek", "passage_text": "Most of the animalcules are now referred to as unicellular organisms though he observed multicellular organisms in pond water. He was also the first to document microscopic observations of muscle fibers, bacteria, spermatozoa, and blood flow in capillaries (small blood vessels). Van Leeuwenhoek married Barbara de Mey in July 1654, with whom he would have one surviving daughter, Maria (four other children died in infancy). That same year he returned to Delft, where he would live and study for the rest of his life. He opened a draper's shop, which he ran throughout the 1650s."}]