[{"url": "http://www.surnamedb.com/Surname/Race", "passage_text": "This unusual and interesting surname is of Old Welsh origin, and derives from the Old Welsh personal name Ris, Welsh Rhys meaning ardour. The popularity of the name is borne out by the number of surnames it has generated. "}, {"url": "http://names.mooseroots.com/", "passage_text": "The history, meaning and origin of first and last names come from the Dictionary of First Names and the Dictionary of American Family Names respectively. Last name histories from SurnameDB are also included on ~50,000 names for additional information and context. 5. Of uncertain origin, probably Germanic, from a short form of various female compound names containing the element av (of uncertain meaning). St Ava or Avia was a 9th-century abbess of Dinart in Hainault and a member of the Frankish royal family."}, {"url": "http://www.ancestry.com/name-origin?surname=lazo", "passage_text": "You can find out where the majority of the Lazo families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists. Click on a circle in the chart to view Lazo birth and death records. An unusually short lifespan might indicate that your ancestors lived in harsh conditions. A short lifespan might also indicate health problems that were once prevalent in your family. The SSDI is a searchable database of more than 70 million names."}, {"url": "http://www.surnameweb.org/Lazo/surname-origin.htm", "passage_text": "Origin of Lazo, Meaning of Lazo. Origin: The origin of 'LAZO' surname is LAZ people in Eastern Black Sea coast.Meaning of 'LAZO' term is 'FROM LAZ TRIBE'. Lazo Immigration to the US by Year You can find out when most of the Lazo families immigrated to the United States. You can focus your search to immigration records dating from that era."}, {"url": "http://www.ancestry.com/name-origin?surname=lazo", "passage_text": "You can find out when most of the Lazo families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival and destination. from the Social Security Death Index (SSDI). Click on a circle in the chart to view Lazo birth and death records. An unusually short lifespan might indicate that your ancestors lived in harsh conditions. A short lifespan might also indicate health problems that were once prevalent in your family. The SSDI is a searchable database of more than 70 million names."}, {"url": "http://www.surnameweb.org/Lazo/surname-origin.htm", "passage_text": "Top Places of Origin for Lazo You can find out where the majority of Lazo families were living before they immigrated to the U.S. You can learn where to focus your search for foreign records. Ports of Departure for Lazo You can pinpoint where the majority of Lazo families booked passage to the US. Lazo Immigration to the US by Year You can find out when most of the Lazo families immigrated to the United States. You can focus your search to immigration records dating from that era."}, {"url": "http://www.wikihow.com/Find-The-Origin-Of-Your-Last-Name", "passage_text": "Surnames, or last names, have been in existence since the 13th century. They were adopted as a means to distinguish people for tax purposes, but have become a way to identify people by their family, country of origin, and in some cases, religion. 1. Give people from a given region a last name denoting their place of origin. Place-name-based last names, as a group, are the most popular source of last names for people in the United States, comprising about 43 percent of the population."}, {"url": "http://www.wikihow.com/Find-The-Origin-Of-Your-Last-Name", "passage_text": "Finding the origin of your last name requires understanding the types of last names, the components that different countries and cultures use to create surnames, and how last names have changed over time. 1. Give people from a given region a last name denoting their place of origin. Place-name-based last names, as a group, are the most popular source of last names for people in the United States, comprising about 43 percent of the population."}]