[{"url": "http://minecraftpocketedition.wikia.com/wiki/Glowstone_Dust", "passage_text": "577 pages on this wiki. Glowstone Dust is a resource yielded by using the Nether Reactor, and is used to craft an illuminating block known as Glowstone. After Update 0.12.1, Glowstone Dust will be available from the Nether by breaking the Glowstone Clusters there"}, {"url": "http://minecraft.wikia.com/wiki/Glowstone", "passage_text": "When Glowstone is destroyed, it can drop anywhere from two to four pieces of Glowstone Dust, therefore destroying n amount of Glowstone Blocks won't necessarily mean you can make n Glowstone Blocks from the dust gathered. 1 A useful tactic for reaching clusters of Glowstone Blocks that are very high up is to redirect a Ghast's fireball at it. 2  This is only recommended if the cluster itself is over ground though, else the resulting dust could easily fall into the lava sea below."}, {"url": "http://minecraft.gamepedia.com/Glowstone", "passage_text": "Lamp A will be powered because the redstone signal travels up the glowstone block. Lamp B will be off as the signal would have to go down the glowstone, which is not possible. When placing redstone on a glowstone block, being a transparent block, signals can pass from one block to another diagonally. Redstone wire, even though it may appear to connect up the side of a glowstone block and to the wire portion on top, will not send a redstone signal down the glowstone block. Light source [edit | edit source]. Glowstone blocks emit a light level of 15, the brightest possible light level in the game. They emit the same amount of light as sea lanterns, jack o'lanterns, redstone lamps and beacons."}, {"url": "http://www.ign.com/wikis/minecraft/Glowstone", "passage_text": "1 Glowstone is also considered a Glass block and for this reason cannot be used to hold torches or other structures like Levers or Buttons. 2  When it is broken it will yield between one and four Glowstone Dust. Tips. 1  When Glowstone is placed on Fences while stacked on each other, it looks like a street lamp and will emit light more brightly than a torch does. 2  It can also be placed on a Fence on the side of a building for a similar effect. 3  Glowstone is also considered a Glass block and for this reason cannot be used to hold torches or other structures ..."}, {"url": "http://www.minecraftinfo.com/Glowstone.htm", "passage_text": "Glowstone is found on the underside of blocks in The Nether. It emits light like a Torch but unlike Torches it can be placed underwater. Glowstone drops 3 Glowstone Dust when broken. "}, {"url": "http://www.blocksandgold.com/en/minecraft-glowstone.html", "passage_text": "Glowstone is an infinite light source and has a higher light level than torches (15 as opposed to 14.) Because it is a block, players often make ceiling lights and lamp posts out of glowstone by combining it with a fence block. Glowstone blocks can also be used as lit paths, due to their interesting texture, or in docks or harbors so players in boats can see where to stop, since it can be placed in water. Also, glowstone can be used as a source of light for growing crops at night."}, {"url": "http://minecraft.wikia.com/wiki/Glowstone", "passage_text": "Glowstone Blocks (formerly known as Lightstone, Brittle Gold, Brightstone, Hell's Stone or Brimstone) are golden blocks that glow indefinitely. It can only be found naturally in The Nether, generating on the undersides of Netherrack, commonly near lava, and forms unusual coral-like stalactites. 1 A useful tactic for reaching clusters of Glowstone Blocks that are very high up is to redirect a Ghast's fireball at it. 2  This is only recommended if the cluster itself is over ground though, else the resulting dust could easily fall into the lava sea below."}, {"url": "http://tekkitclassic.wikia.com/wiki/Glowstone", "passage_text": "Glowstone is a Vanilla block, used as an alternative to torches. This block can only be found naturally in the Nether. It generates on the undersides of Netherrack, and forms unusual coral-like stalactites. Glowstone can be difficult to harvest, due to high ceilings, sheer cliffs and abundance of lava in the Nether. However, you cannot place anything on glowstone except blocks and redstone, meaning torches, doors, etc. cannot be placed on it. When placing redstone on a glowstone block it can send power down but not up the block, since there is a glitch because it is registered in the coding as glass."}, {"url": "http://feed-the-beast.wikia.com/wiki/Glowstone", "passage_text": "2,549 pages on this wiki. Glowstone is an ore found in the Nether or in Mystcraft Ages written with the Glowstone feature. It is typically found growing from the roof of the Nether in coral-like formations. Glowstone drops 1 to 4 glowstone dust when mined by hand"}]