[{"url": "http://www.pamf.org/teen/health/nutrition/carbohydrates.html", "passage_text": "Complex carbohydrates (or polysaccharides) are built from single-unit sugars joined in long chains. Two types of complex carbohydrates are particularly important for nutrition: 1  Starch: Starch is a polysaccharide that plants use to store energy. 2  Dietary Fiber: Dietary fiber is found in plants as cellulose, pectin, and lignin. Many foods contain carbohydrates: There are two types of carbohydrates, simple and complex. Most of your carbohydrates should come from complex carbohydrates. 1  One slice of bread: 15 grams. 2  1/4 bagel: 15 grams. 3  One cup raw leafy vegetables: 5 grams. 4  One medium apple or orange"}, {"url": "http://www.livestrong.com/article/133227-what-are-3-types-carbohydrates/", "passage_text": "The three carbohydrates -- sugar, starch and fiber -- are all made from molecules of sugar. However, sugar also refers to a type of carbohydrate. Sugars, or simple carbohydrates, contain just one or two molecules of sugar. However, carbs alone aren't bad. Everyone needs them because carbs are the body's primary source of energy. The three types of carbs -- sugar, starch and fiber -- all have a place in your diet."}, {"url": "http://www.buzzle.com/articles/types-of-carbohydrates.html", "passage_text": "These are carbohydrates with more than two basic types of sugar molecules, usually between three and ten basic units. Their main role in the body is to store glucose. Raffinose and stachyose are the main types of oligosaccharides which consist of repetitive chains of fructose, galactose, and glucose. Let us take a look at all the types of carbohydrates and their functions. Simple carbohydrates have a 'simple' molecular structure and are made of 1 or 2 sugar molecules. Simple carbs can be digested very quickly due to their simple structures, and tend to elevate the blood sugar quickly."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/design/foodtech/compositionpropertiesrev1.shtml", "passage_text": "Carbohydrates. Carbohydrates are needed to give the body energy. There are two types of carbohydrate-starch and sugar. 1  Starch is found in cereals, cornflour, potatoes, pasta and flour. 2  Sugar is found in fruit, vegetables, honey, milk and malt product"}, {"url": "http://www.answers.com/Q/What_are_the_two_types_of_carbohydrates", "passage_text": "The two types of carbohydrates are Simple and complex. Simple is found in fruits and Veggies. Simple is broken down in 1 step to gluctose, which only provides a quick burst of … energy. Next is complex carbohydrates. Two types of carbohydrates, in sort of a high level grouping, can be broken down into simple and complex carbohydrates. Some simple carbohydrate are table sugar and glucose, w … hile more complex carbohydrates are something starchy, like pasta and other grain foods. Complex carbohydrates like starch are simply polymers of shorter monomer units like glucose. Another type of carbohydrate is fibrous carbohydrates, such as fiber"}, {"url": "http://www.livestrong.com/article/133227-what-are-3-types-carbohydrates/", "passage_text": "Carbohydrates often get clumped together in two extreme categories: good and bad. However, carbs alone aren't bad. Everyone needs them because carbs are the body's primary source of energy. The three types of carbs -- sugar, starch and fiber -- all have a place in your diet. Even sugar is a good carb as long as the type of food from which you obtain it is healthy"}, {"url": "https://www.sharecare.com/health/carbohydrates/different-types-carbohydrates-in-diet", "passage_text": "Carbohydrates provide your body with the glucose it needs to function properly. There are two types of carbohydrates: complex and simple. Foods rich in complex carbohydrates and fiber are called good carbohydrates. Simple carbohydrates include foods with added sugars -- these are called bad carbohydrates. "}, {"url": "http://www.buzzle.com/articles/types-of-carbohydrates.html", "passage_text": "Disaccharides contain two sugar molecules. Ideally, they come under oligosaccharides (since oligosaccharides contain two to ten sugar molecules). However, due to their comparatively simple chemical structure, disaccharides are classified as a different class of carbohydrates. Let us take a look at all the types of carbohydrates and their functions. Simple carbohydrates have a 'simple' molecular structure and are made of 1 or 2 sugar molecules. Simple carbs can be digested very quickly due to their simple structures, and tend to elevate the blood sugar quickly."}]