[{"url": "http://www.answers.com/Q/Who_wrote_the_song_let_the_church_say_amen", "passage_text": "Let It Be is a song written by Paul McCartney (although credited to Lennon/McCartney), and released March 1970 as a single, and as the title track of their album Let It … Be.   The single reached #1 in the U.S., Australia, Italy, Norway and Switzerland and #2 in the UK."}, {"url": "https://en.wikipedia.org/wiki/Jester_Hairston", "passage_text": "Hairston wrote the song  Mary's Boy Child  in 1956. He also wrote the song  Amen , which he dubbed for the Sidney Poitier film Lilies of the Field (1963), and arranged traditional Negro spirituals. Most of Hairston's film work was in the field of composing, arranging, and choral conducting."}, {"url": "https://en.wikipedia.org/wiki/Amen_(The_Impressions_song)", "passage_text": "Amen  is a traditional folk gospel song that was popularized by The Impressions. It was recorded in June 1948 and released in January 1949 by the Wings Over Jordan Choir. The song was arranged by Jester Hairston, for the Sidney Poitier film Lilies of the Field (1963), which popularized the song. Curtis Mayfield said I'd gone to see 'Lilies of The Field,' and the song in it, 'Amen,' was very inspiring for me as was the movie."}, {"url": "http://www.azlyrics.com/lyrics/hozier/takemetochurch.html", "passage_text": "Amen. Amen. [Chorus 2x:]. Take me to church. I'll worship like a dog at the shrine of your lies. I'll tell you my sins and you can sharpen your knife. Offer me that deathless death. Good God, let me give you my life. Submit Corrections. Visit www.azlyrics.com for these lyrics."}, {"url": "http://sogospel.com/2014/07/29/brian-free-and-assurance-brings-the-say-amen-story-to-life/", "passage_text": "“Say Amen” was penned by Jason Cox, Kenna West and Michael Farren, and it’s the first release on the group’s latest project, “Unashamed.” The song debuted at Number 4 on the MusicToRadio Top 100 Chart in April and then moved to the Number 2 position on the MusicToRadio Top 100 real time charts for the month of May."}, {"url": "http://tasteofcountry.com/edens-edge-amen-lyrics/", "passage_text": "Arkansas trio Edens Edge took that notion and blended it with their own church-kissed hometown culture to get their clever play-on-words debut single, ‘ Amen .’ Taste of Country caught up with Hannah Blaylock of Edens Edge recently, who co-wrote the song."}, {"url": "http://www.metrolyrics.com/say-amen-lyrics-howard-hewett.html", "passage_text": "Say Amen is track #11 on the album Intimate. It was written by Hewett, Howard/seward, Monty. "}]