[{"url": "http://www.tigers-world.com/tigers-endangered/", "passage_text": "Right now every species of tiger out there is at a high risk of not being around in less than 10 years. That is a very grim outlook that each of us has the power to help change. Hopefully one day all of these species of tigers will no longer be among those animals listed as an endangered species. Tigers and Conservation Status. There are quite a few threats out there that continue to put the future for the tiger at risk. Humans continue to destroy the habitat that the tigers once called home for their own needs. It isn’t always easy for the tigers to find a new home."}, {"url": "http://www.worldwildlife.org/species/tiger", "passage_text": "Tigers have been known to reach the age of 26 years in the wild. Males of the largest subspecies, the Amur (Siberian) tiger, may weigh up to 660 pounds. For males of the smallest subspecies—the Sumatran tiger—upper range is at around 310 pounds. Within each subspecies, males are heavier than females. Tigers are mostly solitary, apart from associations between mother and offspring."}, {"url": "http://www.allaboutwildlife.com/endangered-tigers-facts", "passage_text": "The Endangered Tiger. T igers are native to much of Asia, from some of the coldest regions to the steamy rainforests of the Indonesian Islands. They are the top predator in every ecosystem they inhabit. Until the 20th Century there were nine tiger subspecies that probably numbered over 100,000 animals."}, {"url": "http://www.buzzle.com/articles/endangered-tigers.html", "passage_text": "All subspecies of the tiger are considered endangered, and hunting or poaching for them is illegal all over the world. China has banned the sale of all and any tiger related products since 1993. Since then, illegal poaching for their fur, bones, and other organs is rampant. This has also resulted in the reckless poaching of tigers, making them an endangered species today. Most of the tiger's body parts are said to be aphrodisiacs, medicines or poisons-possibly the most powerful in"}, {"url": "http://www.allaboutwildlife.com/endangered-tigers-facts", "passage_text": "The main reasons tigers are endangered—in most cases cases, critically endangered—are illegal hunting for their pelts, meat and body parts (used in folk medicines) as well as habitat loss that results from logging and other forms of forest destruction. T igers are native to much of Asia, from some of the coldest regions to the steamy rainforests of the Indonesian Islands. They are the top predator in every ecosystem they inhabit. Until the 20th Century there were nine tiger subspecies that probably numbered over 100,000 animals."}, {"url": "http://www.tigersincrisis.com/the_status.htm", "passage_text": "Poaching, habitat loss and fragmentation have reduced the global population of tigers from over 100,000 in the 1900′s, to less than 4,000 in the 1970′s. Today, four of the remaining subspecies of tigers are considered endangered by the IUCN, while two of the subspecies are considered “critically” endangered. Bengal tigers are sometimes called Indian tigers and account for over half of all tigers remaining in the wild. Poaching for tiger parts is their major threat. The Bengal tiger is classified as endangered by the IUCN. Indochinese tigers (Panthera tigris corbetti) are located in Thailand, Cambodia, China, Lao PDR, Myanmar and Vietnam"}, {"url": "http://www.tigersincrisis.com/the_status.htm", "passage_text": "The Siberian Tiger is classified as endangered by the IUCN. South China tigers (Panthera tigris amoyensis) are the smallest of all the tiger subspecies; it is also the most critically endangered. Little is known about their exact numbers in the wild, but some estimates would put the number at under 20 tigers. Bengal tigers are sometimes called Indian tigers and account for over half of all tigers remaining in the wild. Poaching for tiger parts is their major threat. The Bengal tiger is classified as endangered by the IUCN. Indochinese tigers (Panthera tigris corbetti) are located in Thailand, Cambodia, China, Lao PDR, Myanmar and Vietnam"}, {"url": "http://www.wwf.org.uk/wildlife/tigers/", "passage_text": "About tigers. The tiger is the biggest, the most iconic, and one of the most endangered of all cats. Three of the nine known tiger subspecies are extinct, and a fourth – the South China tiger – hasn’t been seen in the wild since the 1970s. Poaching and habitat destruction are persistent threats, and as few as 3,200 tigers remain in the wild today. Sadly, there are more tigers in captivity in the US than are left in the wild. The tiger is officially classed as endangered by the IUCN."}]