[{"url": "https://answers.yahoo.com/question/index?qid=20081121100638AAb5zf8", "passage_text": "Rating Newest Oldest. Best Answer: You can spay a cat at 6 weeks, in fact it is much easier on them the earlier you do it. Cats can come into heat on different schedules, many go into heat for a couple weeks every 3-6 months, but it varies greatly. My cat would come into heat every 2 weeks, for a week. It was miserable for her and I. You will know it when she is in heat because she will whine like crazy and rub her butt on everything."}, {"url": "http://icatcare.org/advice/neutering-your-cat", "passage_text": "1 Female cats will ‘call’ (come into season and be receptive to the male cat) regularly, about every three weeks during sexually active times of the year if they do not get pregnant. 2  Having entire female cats in an area will attract entire males with the attendant problems of spraying, fighting and caterwauling."}, {"url": "http://cats.about.com/od/reproduction/a/heat_cycles.htm", "passage_text": "1 The breeding season in cats lasts almost year-round. 2  Heat cycles can start as early as four or five months in a female kitten. 3  Heat cycles in cats last from several days to two weeks or more. 4  Heat cycles in cats repeat every two to three weeks until the cat is spayed or becomes pregnant."}, {"url": "https://answers.yahoo.com/question/index?qid=20081121100638AAb5zf8", "passage_text": "Best Answer: You can spay a cat at 6 weeks, in fact it is much easier on them the earlier you do it. Cats can come into heat on different schedules, many go into heat for a couple weeks every 3-6 months, but it varies greatly. My cat would come into heat every 2 weeks, for a week. It was miserable for her and I. You will know it when she is in heat because she will whine like crazy and rub her butt on everything."}, {"url": "http://www.pets4homes.co.uk/pet-advice/how-to-tell-if-your-cat-is-in-heat.html", "passage_text": "While unspayed dogs only come into season once or twice a year, female cats are fertile and come into heat much more regularly. Cats can come into heat as often as every three weeks, and can conceive at any point while they are in heat, meaning that keeping an unspayed adult cat can prove challenging."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070308075013AAW9QMj", "passage_text": "I have had 2 female cats from kittens, and from my experience, they usually come into heat anywhere from 6-8 months. Usually in late winter, early spring is the first time. From that time, they can go into heat every couple of months. My outdoor female once had 3 litters in one year."}, {"url": "http://www.catsofaustralia.com/cat-in-heat.htm", "passage_text": "Usually a cats first season is somewhere between 4 and 10 months old with average age around six months. Siamese and Burmese cats are quite precocious and will often have their first season at 4 months of age."}]