[{"url": "https://en.wikipedia.org/wiki/Instrumentation", "passage_text": "Instrumentation is the use of measuring instruments to monitor and control a process. It is the art and science of measurement and control of process variables within a production, laboratory, or manufacturing area. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070918061030AASHm5B", "passage_text": "RE: what is a &#39;loop&#39; test in instrumentation and control? After the installation of certain categories of instruments for example certain types of detectors, there is normally a test caried out to ascertain their integrity, one of these is the &#39;loop&#39; test. "}, {"url": "http://www.sensorland.com/HowPage028.html", "passage_text": "Typical wiring for current output transducer. You can think of the current loop itself as being analogous to a water system. You have a hose pipe (the wires) and a source tap (the power supply). You have a spray gun that regulates the flow (the transducer). You can have other equipment on the line, but it all has to be connected together in a ring Ioop. A big benefit of the current loop is its simple wiring just the two wires. The supply voltage and measuring current are supplied over the same two wires. Zero offset of the base current (ie. 4mA) makes cable break detection simple: if the current suddenly drops to zero, you have a cable break."}, {"url": "https://en.wikipedia.org/wiki/Current_loop", "passage_text": "In electrical signalling an analog current loop is used where a device must be monitored or controlled remotely over a pair of conductors. Basic DC circuit theory shows that the current is the same all along the line. It was common to see 4–20 mA circuits that had loop lengths in miles or circuits working over telephone cable pairs that were longer than ten thousand feet end-to-end. There are still legacy systems in place using this technology."}, {"url": "https://en.wikipedia.org/wiki/Current_loop", "passage_text": "Depending on the source of current for the loop, devices may be classified as active (supplying power) or passive (relying on loop power). For example, a chart recorder may provide loop power to a pressure transmitter. Basic DC circuit theory shows that the current is the same all along the line. It was common to see 4–20 mA circuits that had loop lengths in miles or circuits working over telephone cable pairs that were longer than ten thousand feet end-to-end. There are still legacy systems in place using this technology."}, {"url": "http://www.ni.com/white-paper/6940/en/", "passage_text": "Discovering which power supply best meets your requirements is simple. In a current loop, the power supply must emit voltage equal to or greater than all the voltage drops in the system combined. The data acquisition device for this example uses a precision shunt resistor to measure current. You need to calculate the voltage drop across the resistor. For the example current loop system, your chosen transducer measures pressure and has an operating voltage of 12 to 30 V. With the transducer selected, properly measuring the current signal is required to provide an accurate representation of the pressure applied to the transducer."}, {"url": "http://www.pacontrol.com/download/4-20mA-Current-Loop-Primer.pdf", "passage_text": "(For example, a thermocouple isa type of sensor which provides a very low-level output voltage that isproportional to its ambient temperature.) The transmitter amplifiesand conditions the sensor’s output, and then converts this voltage toa proportional 4-20mA dc-current that circulates within the closedseries-loop. For example, when a loop-poweredapplication is powered from a 24V power source, the sum of all thevoltage drops around the series loop has to also equal 24V. Everycomponent through which the 4-20mA loop current passes developsa maximum voltage drop equal to that component’s resistancemultiplied by 0.020 Amperes (20mA)."}, {"url": "https://en.wikipedia.org/wiki/Current_loop", "passage_text": "A current loop can also be used to control a valve positioner or other output actuator. An analog current loop can be converted to a voltage input with a precision resistor. Basic DC circuit theory shows that the current is the same all along the line. It was common to see 4–20 mA circuits that had loop lengths in miles or circuits working over telephone cable pairs that were longer than ten thousand feet end-to-end. There are still legacy systems in place using this technology."}, {"url": "http://www.electriciantalk.com/f2/loop-powered-34499/", "passage_text": "Loop Powered typically means that you have a singe, two-wire, in-line sensor, (transmitter, transducer), that derives it's operating power via the two wires, and modulates the loop current based on the process to be measured. Depends on your definition of branch-off. You can have a power supply that is capable of supplying multiple loops, however, EACH sensor is supplied by ONE loop. You cannot power more than one sensor off a loop.... As JRaef put it, each loop supply is limited as to what it will supply."}, {"url": "http://www.electriciantalk.com/f2/loop-powered-34499/", "passage_text": "The loop-powered sensor is in a remote location and gets its operating power from the source end over the single pair of wires. The sensor also controls the current in the single loop to give process information back to the source measuring equipment. An alternate to this device would be a 4-wire device, where constant power is applied to 2-wires to supply the sensor, and the snesor modulates a signal on a second pair of wires. Depends on your definition of branch-off. You can have a power supply that is capable of supplying multiple loops, however, EACH sensor is supplied by ONE loop. You cannot power more than one sensor off a loop.... As JRaef put it, each loop supply is limited as to what it will supply."}]