[{"url": "http://differentmedicalcareers.com/can-a-nurse-become-a-doctor/", "passage_text": "Diploma in nursing from a hospital-based school – this 2- or 3-year program is not a bachelor’s degree, and a nurse will need to have an additional 2-4 years to acquire a BS, which is prerequisite to becoming a doctor. Associate’s degree in nursing (ADN) – Many who go from CNA to RN take this route. As you can see, you can become a doctor after being a nurse and you have different routes listed in this article. Nurses share the same workplace as doctors. It is often said that nurses take medical “care” of patients, while doctors “cure” patients."}, {"url": "http://allnurses.com/general-nursing-discussion/bsn-nurse-to-236000.html", "passage_text": "Are you speaking about a Medical Doctor (MD)? Becoming a BSN prepared nurse is not a shortcut to becoming a doctor; they are two separate and distinct disciplines. Medical school requires 4 years of premed, 4 years of medical school, and, depending upon your specialty, several years of internships and residencies. Jul 14, '07 by Tweety. It takes a 4-year degree to become a doctor, and becoming a BSN is a 4-year degree, just make sure you have all the pre-med classes the med school requires because some of these might not be required to beocme a BSN RN."}, {"url": "http://www.ehow.com/how-does_4609414_nurse-become-doctor_.html", "passage_text": "Ridofranz/iStock/Getty Images. When a nurse wants to become a doctor, she has two options. She can earn a doctorate in nursing or go to medical school. If she chooses medical school, she can become a medical doctor or a doctor of osteopathy, but if she chooses a nursing doctorate, she has multiple options. In either case, she must go back to school."}, {"url": "http://woman.thenest.com/can-rn-become-doctor-9883.html", "passage_text": "Step 1. Complete your bachelor's degree, if you have not already, as you can't apply to med school until you do. As an RN, you could have earned a bachelor's degree in nursing, an associate's degree in nursing or a diploma in nursing. You can complete an RN-to-BSN program that will give you a bachelor of science in nursing. These programs offer you advanced standing because you already have some of the necessary education. As a registered nurse you already have a challenging career in the medical field. But if you're looking to take on greater responsibility for the care of your patients, you may want to consider a career as a doctor."}, {"url": "http://www.usnews.com/education/blogs/medical-school-admissions-doctor/2015/03/24/apply-to-medical-school-with-an-undergraduate-nursing-degree", "passage_text": "Training to become a doctor isn't just a small shift for a nurse – it's a significant change in a career in medicine. By Sylvia Morris, M.D. + More. ​I have been asked if someone with an undergraduate degree in nursing can apply and attend medical school. The answer is, yes.. ​Nurses can go to medical school. "}, {"url": "http://allnurses.com/general-nursing-discussion/bsn-nurse-to-236000.html", "passage_text": "The medical model is totally different from the nursing model, and becoming a nurse will not shorten your schooling for the MD. If becoming a doctor is your goal, it would actually be better if you earned an undergrad degree in biology, attended 4 years of medical school, and underwent 3 to 7 years of internship. Jul 14, '07 by Tweety. It takes a 4-year degree to become a doctor, and becoming a BSN is a 4-year degree, just make sure you have all the pre-med classes the med school requires because some of these might not be required to beocme a BSN RN."}, {"url": "http://work.chron.com/can-nurse-masters-degree-become-doctor-9850.html", "passage_text": "A nurse with a master's degree still has a long road to go to become a medical doctor. She can, however, obtain a doctorate or Ph.D. in Nursing with just a few more years' study, enabling her to call herself doctor.. Getting your Master of Science in Nursing doesn't lessen the time you would need to spend in medical school to become a medical doctor."}, {"url": "http://differentmedicalcareers.com/can-a-nurse-become-a-doctor/", "passage_text": "Yes, but an RN will need a minimum of a bachelor’s degree before a nurse can eventually become a doctor. There are following three routes to go from a registered nurse to a doctor: 1. by earning a doctorate in nursing (Ph.D.), 2. by becoming a medical doctor (MD), or. 3. by becoming a doctor of osteopathy (DO). As you can see, you can become a doctor after being a nurse and you have different routes listed in this article. Nurses share the same workplace as doctors. It is often said that nurses take medical “care” of patients, while doctors “cure” patients."}]