[{"url": "http://homeguides.sfgate.com/long-basil-grow-true-leaves-49000.html", "passage_text": "Basil seeds take between eight and 14 days to germinate and emerge from the soil. After germination, look for the first set of true leaves two to three weeks later. Remember, the true leaves don't grow until after the set of seed leaves emerges."}, {"url": "http://www.growweedeasy.com/how-long-does-it-take-to-grow-marijuana", "passage_text": "Important Milestones in the Marijuana Plant's Life. Depending on how you set up your grow, it can take anywhere from 2 months to 6 months or more to grow a marijuana plant from a seedling to the point where the plant is ready to harvest. Some methods, such as growing hydroponically indoors, give your flexibility to get a harvested plant in as little as 2-3 months."}, {"url": "http://www.connexionfrance.com/potatoes-grow-france-how-long-varieties-10748-news-article.html", "passage_text": "NOW is the time of year to consider which seed potatoes to plant and with more than 100 varieties available, it is important to know how long various types take to grow, their taste and best cooking uses for when they are ready."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_a_plant_to_grow", "passage_text": "It depends on the tomato variety and the growing conditions. Tomato plants take about six weeks to grow from seed to transplant size (6 to 8 inches tall) in the nursery. Then, … depending on the variety and weather, it can take another 60 to 90 days to produce the first ripe tomato."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_a_plant_to_grow", "passage_text": "How long does a plant take to grow? Depends on entirely on the type of plant; annuals will go from seed  to flower in anything between 8 and 12 weeks.    Pernnial plants can literally take a lifetime bef … ore they flower -  some up to 80 years from the time they germinate."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_a_plant_to_grow", "passage_text": "Cherry tomatoes typically take 30 to 45 days from flower to fruit, while large slicing tomatoes take 40 to 60 days. Tomatoes grow best at temperatures between 55 and 85 degrees Fahrenheit. For temperatures much outside this range, the plant growth will slow down and the flowers will not set any fruit."}]