[{"url": "http://www.menieresdisease-treatment.com/meniere-disease/inferior-colliculus.html", "passage_text": "The anatomic structure that includes inferior colliculi and the superior coliculi forms two parts: (1) the eminences of the corpora quadrigemina. (2) part of the tectal region of the midbrain. The inferior colliculus is located near the following structures: (1) the superior colliculus. Inferior colliculus. The Inferior colliculus is the main midbrain nucleus and important structure of the auditory passage. It is not just a point on the way up. It is a receiver of essential information from various sources, and processing this information"}, {"url": "http://www.healthline.com/human-body-maps/superior-colliculus", "passage_text": "The superior colliculus refers to the rostral (front) bump on the lateral (side) part of the midbrain. It is, in fact, a pair of two colliculi, superior and inferior, on either side of the midbrain that together constitute the tectum. The superior colliculus is a layered, multi-sensory structure. Its upper layer receives visual signals from the retina of the eye, while the lower layers process multiple signals from various other parts of the brain. This colliculus is not restricted to a visual role alone. Movement of the eyes is also connected with the cells present in the lower layers of the colliculus. In mammals and other higher animals, the brain processes sensory inputs in correlation with the superior colliculus. In lower animals it helps to perceive any sudden movement that occurs before the retina."}, {"url": "https://en.wikipedia.org/wiki/Superior_colliculus", "passage_text": "The superior colliculus, (Latin, upper hill) is a paired structure of the mammalian midbrain. In other vertebrates this is known as the optic tectum or simply tectum, and the adjective tectal may also be used. The superior colliculus forms a major component of the midbrain. The tectum is a layered structure, with a number of layers that varies by species. The superficial layers are sensory-related, and receive input from the eyes as well as other sensory systems."}, {"url": "https://en.wikipedia.org/wiki/Inferior_colliculus", "passage_text": "The inferior colliculus has three subdivisions: the central nucleus, a dorsal cortex by which it is surrounded, and an external cortex which is located laterally. The inferior colliculus lies caudal to its counterpart-the superior colliculus-above the trochlear nerve, and at the base of the projection of the medial geniculate nucleus and the lateral geniculate nucleus."}, {"url": "http://www.healthline.com/human-body-maps/inferior-colliculus", "passage_text": "Inferior colliculus. The inferior colliculus is a part of the midbrain that serves as a main auditory (sound) center for the body. It acts as the channel for almost all auditory signals in the human body. Its primary roles are signal integration, frequency recognition, and pitch discrimination. It also processes sensory signals from the superior colliculi, located above it. The inferior colliculus is made up of two lobes, which process sound signals from both ears. It is sub-divided into the external cortex, lateral cortex, and central cortex."}, {"url": "http://www.healthline.com/human-body-maps/inferior-colliculus", "passage_text": "The inferior colliculus is a part of the midbrain that serves as a main auditory (sound) center for the body. It also processes sensory signals from the superior colliculi, located above it. The inferior colliculus is made up of two lobes, which process sound signals from both ears. It is sub-divided into the external cortex, lateral cortex, and central cortex."}, {"url": "http://www.neuroanatomy.wisc.edu/Bs97/TEXT/P23/ov.htm", "passage_text": "Anatomy. Point: 23. Superior Colliculus. Function: Superior and inferior colliculi comprise the tectum or roof (dorsal to the cerebral aqueduct) of the mesencephalon or midbrain. The rostral portion of the roof consists of two bumps=superior colliculi."}, {"url": "https://en.wikipedia.org/wiki/Inferior_colliculus", "passage_text": "The inferior colliculi together with the superior colliculi form the eminences of the corpora quadrigemina, and also part of the tectal region of the midbrain. The inferior colliculus lies caudal to its counterpart-the superior colliculus-above the trochlear nerve, and at the base of the projection of the medial geniculate nucleus and the lateral geniculate nucleus."}]