[{"url": "http://homeguides.sfgate.com/clean-maintain-outdoor-fountains-37008.html", "passage_text": "1 You can use furniture polish to clean natural copper fountains. 2  Vinegar is usually effective at removing calcium and lime buildup when the fountain is cleaned regularly. 3  For severe buildup, however, a special calcium, lime and rust removal product can help restore the original beauty of the fountain. 5. Remove the pump cover and remove any large debris from the inside with your hands. Use an old toothbrush to clean and remove small deposits of algae and mineral buildup in hard-to-reach areas. Rinse thoroughly and replace the pump cover"}, {"url": "https://answers.yahoo.com/question/index?qid=20090929160206AA1993V", "passage_text": "Rating Newest Oldest. Best Answer: White vinegar is great for removing calcium deposits from water fountains as it is completely natural and will not harm your dogs or birds. It has been tried and tested and proven to work. See the step by step method below... Report Abuse. · If your fountain begins to grow algae, you may add sea salt, vinegar, hydrogen peroxide or bleach to the water to prevent algae growth. If you add bleach or hydrogen peroxide you do not want your animals to drink this water. Source(s): http://www.wetwaterfountains.com/Mainten..."}, {"url": "http://www.ehow.com/how_5853186_remove-calcium-deposits-fountain.html", "passage_text": "Instructions. Turn the water off and remove any rocks, pebbles or other decorative pieces that may be inside your fountain. Toss out any debris such as leaves, twigs and insects from within your fountain. Clean the inside of the fountain. Using a soft, non-abrasive sponge, scrub the inside of the fountain with a calcium lime remover. You can also use a mixture of vinegar and water to remove calcium deposits. Remove the pump from the fountain and disassemble it. Calcium buildup can collect inside the pump, reducing its overall performance. "}, {"url": "http://www.serenityhealth.com/tips-and-advice/fountain-cleaning.html", "passage_text": "1 Clean your fountain in the sink or for wall fountains and large fountains, take a bucket of water and a non-abrasive sponge to clean the inside of the pan. 2  We recommend using a mild soap or a product such as CLR on the inside of the pan to remove any buildup. Cleaning your pump is very important as this is what makes the fountain tick! Your pump will be the first thing to see buildup because this is what the water is flowing through and the pump is what filters the water. 1  Once your pump is removed from your fountain, place your pump in the sink to clean."}, {"url": "http://www.doityourself.com/forum/ponds-fountains-water-gardens/487037-how-can-i-clean-calcium-deposits-large-decorative-outdoor-copper-fountain.html", "passage_text": "How can I clean calcium deposits from a large decorative outdoor copper fountain. I installed a large (6 ft tall) decorative outdoor copper fountain in my patio several years ago (it is actually imbedded in the patio surface about 3 inches deep). The pan that holds the water and pump is about 7 inches deep. "}, {"url": "http://homeguides.sfgate.com/reduce-mineral-buildup-fountains-36958.html", "passage_text": "6. Scrub the mineral deposits on the fountain using a nylon bristle brush and the vinegar solution. If the buildup is very thick or difficult to remove, let the vinegar solution sit on the deposits for several minutes before scrubbing. Hard water circulating through the fountain leaves calcium and magnesium deposits. Manganese, copper, iron and brass are also occasionally deposited in a fountain, depending on the material any fixtures are made of and whether the water is acidic."}, {"url": "http://www.serenityhealth.com/tips-and-advice/fountain-cleaning.html", "passage_text": "1 Wipe and scrub until you have gotten rid of any algae and/or white scale buildup your fountain may have. 2  Once the pan is clean try, to rinse out any soap or cleaning product by just wiping with clean rags or cloths. Cleaning your pump is very important as this is what makes the fountain tick! Your pump will be the first thing to see buildup because this is what the water is flowing through and the pump is what filters the water. 1  Once your pump is removed from your fountain, place your pump in the sink to clean."}, {"url": "http://www.naturalhandyman.com/iip/infcleaning/infmineraldeposits.html", "passage_text": "Calcium and magnesium in water leave hard deposits -- called lime scales -- on fixtures and equipment. These minerals make cleaning products less effective. To clean away lime scale, you need a cleaning product with sequestrants.. Sequestrants capture and deactivate minerals in water. "}, {"url": "http://www.serenityhealth.com/tips-and-advice/fountain-cleaning.html", "passage_text": "To clean your water fountain take the following steps: 1  Turn the fountain off. 2  If there are stones in your fountain, take them out and clean them as well. 3  Once you have access to your pump and water, remove the pump from the fountain. 4  This will need to be cleaned as well (see below for cleaning pumps). Cleaning your pump is very important as this is what makes the fountain tick! Your pump will be the first thing to see buildup because this is what the water is flowing through and the pump is what filters the water. 1  Once your pump is removed from your fountain, place your pump in the sink to clean."}]