[{"url": "http://www.sciencebuddies.org/science-fair-projects/project_ideas/FoodSci_p052.shtml", "passage_text": "Fats or oils (also generally called fats) are added to foods, like crackers, cookies, and cakes, to improve the taste and feel (texture) of foods. Foods become rancid when there is a chemical change to the fats in the food. There are three types of rancidity: hydrolytic, oxidative, and ketonic. Hydrolytic rancidity (pronounced HY-droh-LIH-tik, derived from the Greek work for water, hydra) happens when there is water involved."}, {"url": "http://www.answers.com/Q/How_do_fats_become_rancid", "passage_text": "Rancid foods are those in which the fats or oils in the foods are degraded or undergoing the degradation process. The more fats or oils a food contains, the greater the risk … of it becoming rancid over time or in the presence of external factors such as heat."}, {"url": "http://www.answers.com/Q/How_do_fats_become_rancid", "passage_text": "Fats can become rancid through long term storage, exposure to oxygen, exposure to light, exposure to metal, and holding them at high temperatures.Chemically is is oxidation of fat leading to decomposition."}, {"url": "http://chipsgettingrancid.weebly.com/conclusion.html", "passage_text": "My purpose for this experiment, is I wanted to find out how food becomes rancid as potato chips become kind of soggy and not as tasty when you leave the bag opened. I always wondered why this happened so i decided to test it."}, {"url": "http://whfoods.org/genpage.php?tname=dailytip&dbid=357", "passage_text": "Many factors can affect the tendency of an oil to become rancid. The first is too much exposure to air."}, {"url": "http://www.answers.com/Q/How_does_foods_become_rancid", "passage_text": "Rancid foods are those in which the fats or oils in the foods are degraded or undergoing the degradation process. The more fats or oils a food contains, the greater the risk of it becoming rancid over time or in the presence of external factors such as heat."}, {"url": "http://www.sciencebuddies.org/science-fair-projects/project_ideas/FoodSci_p052.shtml", "passage_text": "Oils that are used for deep-frying become rancid faster because placing wet food in the heated frying oil introduces water. Oxidative rancidity occurs when the food (fat) is exposed to the oxygen in air. Oxidative rancidity happens in two steps."}]