[{"url": "http://homeguides.sfgate.com/kind-soil-good-avocado-trees-39791.html", "passage_text": "Requiring a lot of garden space for their shallow root systems, these complex evergreen trees need full sunlight to generate the large fruits. In fact, the soil itself is an important determining factor for whether the tree fruits or not. Good Drainage. Tree roots suffocated with constant moisture will exhibit their poor health with low fruit yields and possible branch die-back; avocado trees must have good soil drainage for healthy growth. Although you may be concerned about keeping your tree watered, slightly dry conditions are best for the avocado."}, {"url": "http://www.avocadotrees.com/planting_and_grow.htm", "passage_text": "Be sure to select a spot in the full sun with good internal soil drainage. . THE GILLOGLY AVOCADO PLANTING AND GROWING INSTRUCTIONS EXTRA PRECAUTIONS 1. THE WORST THING YOU CAN DO WITH AN AVOCADO IS OVERWATER IT. (IT WILL KILL IT!!!) 2. The potting mix is one of the most important factors, when growing avocados as a houseplant. It should allow drainage and be light rather than heavy. Watering from above(recommended), the water should be added until some comes out the drainage holes."}, {"url": "http://homeguides.sfgate.com/kind-soil-good-avocado-trees-39791.html", "passage_text": "Salts. Occurring naturally in soils, salts can be a problem for avocado trees if they are in high concentrations. You will notice a salt issue if you observe the tree's leaves; the tips may appear sunburned or brown. Good Drainage. Tree roots suffocated with constant moisture will exhibit their poor health with low fruit yields and possible branch die-back; avocado trees must have good soil drainage for healthy growth. Although you may be concerned about keeping your tree watered, slightly dry conditions are best for the avocado."}, {"url": "http://ucavo.ucr.edu/General/Answers.html", "passage_text": "Planting. The avocado is a shallow rooted tree (most of the feeder roots are in the top 6 of soil) which needs good aeration. They do well if mulched with a coarse yard mulch. Current recommendation is to put approx 1/3 cu yd per tree when planting. When applying the mulch, be sure to stay about 6-8 inches away from the trunk of the tree. They like the soil pH around 6 - 6.5. If you can, plant your tree in a spot protected from wind and frost. Also, avocado trees typically do not do well planted in lawns so try to plant your tree in a non-lawn area."}, {"url": "http://homeguides.sfgate.com/kind-soil-good-avocado-trees-39791.html", "passage_text": "Fruit size varies depending on available soil nutrients. Enjoying the creamy flesh from a ripened avocado is a treat for the taste buds, especially if you have cultivated the fruit from your own garden. Good Drainage. Tree roots suffocated with constant moisture will exhibit their poor health with low fruit yields and possible branch die-back; avocado trees must have good soil drainage for healthy growth. Although you may be concerned about keeping your tree watered, slightly dry conditions are best for the avocado."}, {"url": "http://homeguides.sfgate.com/conditions-required-grow-avocado-tree-55767.html", "passage_text": "Soil, Water and Fertilizer. An avocado tree can grow successfully in a variety of soil types and in soil with acidic or alkaline pH levels, but the tree requires soil that has good drainage. It declines in poorly draining and saline soil. If you want to grow an avocado tree as a specimen plant without regard to fruit production, then you may plant a single avocado tree."}, {"url": "https://www.fourwindsgrowers.com/fruit-trees-vines-and-berries/avocados.html", "passage_text": "All avocado trees need to be protected from heavy frosts and strong winds. They prefer to be planted in sunny locations with well drained soil. Most avocado trees can reach a height of 25'+ feet when fully grown. Selecting the proper location to plant your avocado tree is important for successful growing. If you want to mix more than one type of avocado tree together in a back yard setting, it is possible to plant more than one tree in the same hole or plant the trees together with as little as 4 feet of space between the trunks."}, {"url": "http://www.ehow.com/facts_7695175_soil-avocado-trees.html", "passage_text": "Soil Texture. Avocado trees grow best in a loose soil made up of sandy loam or decomposed granite. Excess moisture can damage plants, and as a result the best soil for avocado trees should drain well. Leaves and wood chips placed on the top of the soil protect roots against overheating and provide nutrients to the avocado tree. An excess of salt in the soil causes avocado leaves to turn brown. Salt can be cleared from the soil by watering slowly and deeply. For potted plants, irrigate the tree until water runs out the holes on the bottom of the plant for several minutes."}, {"url": "http://www.gardenguides.com/90782-fertilizer-avocado-trees.html", "passage_text": "You may need to amend the nutrients contained in the soil before you plant an avocado tree. Test your soil to determine the pH and the calcium content. Avocados need a pH ranging from 6.2 and 6.5--if it's not right, your avocado will not do well. You can raise the pH of acidic soil by adding calcium carbonate (lime). "}, {"url": "http://aggie-horticulture.tamu.edu/archives/parsons/fruit/avocado.html", "passage_text": "Avocado 1. Q: How do you grow an avocado? A: Wash pit; stick in 3 toothpicks 2/3 way down seed from pointed top; set on rim of glass; fill with water so that the bottom 1/3 of seed is covered. When root forms and top starts to split, pot with soil and place in brightest light indoors. "}]