[{"url": "http://www.motherearthnews.com/organic-gardening/american-chestnut-tree-zmaz10fmzraw.aspx", "passage_text": "Choosing a Chestnut Species. The most common edible chestnut species are the American chestnut (Castanea dentata), Chinese chestnut (C. mollissima), Japanese chestnut (C. crenata) and European chestnut (C. sativa). Chinese chestnuts are generally hardy to Zone 5, but some are hardy to Zone 3. The nuts of different species are equally variable. American chestnuts are small, have an easily removable pellicle (the thin brown skin around the nutmeat), and are the sweetest of the edible chestnuts. European species have a variable, usually mild flavor, and Japanese chestnuts are sometimes bitter."}, {"url": "http://www.extension.umn.edu/garden/yard-garden/trees-shrubs/chestnuts-horse-chestnuts-and-ohio-buckeyes/", "passage_text": "The horse-chestnut (Aesculus hippocastanum), a European native, is occasionally seen as a planted ornamental shade tree, but Ohio buckeye (Aesculus glabra) is the most common of the three. Ohio buckeye is an American native and grows in woods as close as northern Iowa, northern Illinois, and Michigan. Occasionally people ask about the edibility of chestnuts. In almost every case the 'chestnut' turns out to be the non-edible horse-chestnut or buckeye. True American chestnut (Castanea dentata) is rare here. It has been virtually eliminated from much of its former native range due to a fungal blight"}, {"url": "http://www.cooksinfo.com/chestnuts", "passage_text": "Edible Chestnuts mostly come from the Castanea Chestnut tree. They are not related to horse Chestnuts or water Chestnuts. In English, this tree is often referred to as the Spanish Chestnut tree. The North American tree that produces edible Chestnuts is sometimes referred to as the Sweet Chestnut tree. A blight in the 1930s killed most of the native North American Chestnut trees that bore edible Chestnuts (Sweet Chestnut Trees). The blight arrived on Chestnut trees imported from Asia. Though over 3 1/2 billion trees were destroyed, the North American trees are now slowly making a comeback."}, {"url": "http://www.extension.umn.edu/garden/yard-garden/trees-shrubs/chestnuts-horse-chestnuts-and-ohio-buckeyes/", "passage_text": "Chestnuts, horse chestnuts, and Ohio buckeyes. Occasionally people ask about the edibility of chestnuts. In almost every case the 'chestnut' turns out to be the non-edible horse-chestnut or buckeye. True American chestnut (Castanea dentata) is rare here. It has been virtually eliminated from much of its former native range due to a fungal blight"}, {"url": "http://garden.org/ediblelandscaping/?page=201111-grow-chestnuts", "passage_text": "The American chestnut tree is a majestic, sprawling, large tree that was a mainstay of eastern U.S. forests before blight wiped it out. Chestnut burrs (fruits) contain the chestnut seeds or nuts that we love to eat. Chestnut blight is a fungus from Asia that spread throughout the eastern U.S. one hundred years ago, killing most wild chestnut trees in its wake. Growing nut trees is a long term proposition. They take up lots of space, but have so many uses, not the least of which is yielding edible nuts. There's no more rewarding a nut to grow than the chestnut. Many have heard the story of the American chestnut."}, {"url": "https://en.wikipedia.org/wiki/American_chestnut", "passage_text": "The American chestnut, Castanea dentata, is a large, monoecious deciduous tree of the beech family native to eastern North America. Before the species was devastated by the chestnut blight, a fungal disease, it was one of the most important forest trees throughout its range. There are now very few mature specimens of the tree within its historical range, although many small shoots of the former live trees remain. It has several related chestnut species, such as the European sweet chestnut, Chinese chestnut, and Japanese chestnut, which are distinguishable from the American species by a few morphological traits, such as leaf shape, petiole length and nut size."}, {"url": "https://www.chiefrivernursery.com/store/American-Chestnut-Seedlings-6-12.html", "passage_text": "The American Chestnut is a large, broad tree that produces an edible chestnut. Large leaves turn yellow and brown in autumn. At least two American Chestnuts planted no more than 200' apart are required for producing chestnuts. This tree was very common before blight wiped out most of them in the early 1900's. Our pure American Chestnuts come from mature parents who have survived the blight and are producing chestnut seeds. For now, the possibility of American Chestnuts getting the blight sometime in their life is a real possibility."}, {"url": "http://tree-species.blogspot.com/2009/03/edible-chestnuts-vs-horse-chestnuts.html", "passage_text": "The pod of the edible sweet chestnut has a sort of porcupine look to it with thin prickly spikes that point out in all directions and form a sort of thicket where you cannot see anything but the spikes. These are green while the chestnuts are forming and then turn brown when the chestnuts are mature. When the edible chestnut is ripe, the shell opens and the nuts drop like rain. A nut is a seed of the tree, and the goal is to make a baby tree. The nuts even in their spiny hard-as-hell to pick up before they pop roll wildly on the slightest incline."}]