[{"url": "https://en.wikipedia.org/wiki/Gustatory_system", "passage_text": "These receptors are known as taste cells, and they are contained in bundles called taste buds, which are contained in raised areas known as papillae that are found across the tongue. To date, there are five different types of taste receptors known: salt, sweet, sour, bitter, and umami. Each receptor has a different manner of sensory transduction: that is, detecting the presence of a certain compound and starting an action potential which ultimately alerts the brain."}, {"url": "http://neuroscience.uth.tmc.edu/s2/chapter09.html", "passage_text": "Taste and smell are the principal systems for distinguishing flavors. However, tactile, thermal, and nociceptive sensory input from the oral mucosa contributes to food quality. Saliva also is an important factor in maintaining acuity of taste receptor cells (Figure 9.1). Voltage-gated channel proteins for Na + , K + & Ca 2+ are present in the plasma membrane with the K + -gated channel proteins located in larger numbers on the apical membrane of the taste cells. Synaptic vesicles are present near the apex and the basal region in many"}, {"url": "http://tasteandsmell.com/nov07.htm", "passage_text": "This critical interplay between rapid cell growth and cell death in taste buds and olfactory epithelial cells is critical to maintain normal taste and smell function. SALIVA is the active source of these factors for the taste bud, while NASAL MUCUS in the active source of these factors for the olfactory epithelium. Olfactory epithelial cells are also among the fastest growing and regenerating cells in the body. Olfactory epithelial cells, unlike taste bud cells, regenerate in a variety of time frames, from every 24 hours to days and weeks."}, {"url": "https://quizlet.com/13855478/olfaction-taste-flash-cards/", "passage_text": "Differences in processes of olfactory and gustatory basal cells. 1) The time it takes a basal cell in the olfactory epithelium to develop and emerge as a mature receptor cell (25-30 days) is longer than in the gustatory epithelium 2) Unlike taste receptor cells, olfactory receptor cells are true nerve cells (neurons). They have a dendritic rod, axon and conduct APs into CNS."}, {"url": "http://tasteandsmell.com/nov07.htm", "passage_text": "Taste buds and olfactory receptor cells are the fastest growing and most rapidly regenerating cells in the body. Taste buds regenerate completely in a 24 hour period. The entire bud is replaced by new cells on a daily basis. Olfactory epithelial cells are also among the fastest growing and regenerating cells in the body. Olfactory epithelial cells, unlike taste bud cells, regenerate in a variety of time frames, from every 24 hours to days and weeks."}, {"url": "https://quizlet.com/5940830/olfaction-gustation-flash-cards/", "passage_text": "What are the receptor potentials for the taste-sweet, bitter, and umami tastes? (Recapitulation) - These do not themselves enter gustatory receptor cells. - The sour taste is due to hydrogen ions-Hydrogen ions of sour tastants probably flow into gustatory receptor cells through H+ channels, where they influence opening and closing of other types of ion channels-The result is depolarization that leads to release of neurotransmitter."}, {"url": "http://ctrgenpath.net/static/atlas/mousehistology/Windows/senses/tongue.html", "passage_text": "The taste buds of the tongue occur within papillae (foliate, fungiform, and vallate) present in the stratified squamous epithelium of the tongue. The taste buds consist of basal cells (near the basal lamina), supporting cells, and gustatory cells (sensory or neuroepithelial cells). The gustatory cells, which can be distinguished from supporting cells with a specific staining only, have microvilli at their apical ends extending in the taste pore. "}, {"url": "http://medical-dictionary.thefreedictionary.com/gustatory+cells", "passage_text": "darkly staining cells in a taste bud with long, hairlike microvilli that contain closely packed microtubules and extend into the gustatory pore; the taste cells stand in synaptic contact with sensory nerve fibers of the facial, glossopharyngeal, or vagus nerves. Synonym(s): gustatory cells. "}, {"url": "http://www.cancer.org/cancer/skincancer-basalandsquamouscell/detailedguide/skin-cancer-basal-and-squamous-cell-what-is-basal-and-squamous-cell", "passage_text": "1 Basal cells: These cells are in the lower part of the epidermis, called the basal cell layer. 2  These cells constantly divide to form new cells to replace the squamous cells that wear off the skin’s surface. 3  As these cells move up in the epidermis, they get flatter, eventually becoming squamous cells. The main types of cells in the epidermis include: 1  Squamous cells: These are flat cells in the outer part of the epidermis that are constantly shed as new ones form. 2 "}, {"url": "http://antranik.org/chemical-sense-taste-gustation/", "passage_text": "Each taste bud contains about 50-100 epithelial cells. There’s 3 major cell types, the basal epithelial cells, gustatory epithelial cells and supporting cells. The picture below starts with the whole tongue then takes a closer look at a single vallate papilla, then zooms in and looks at a single taste bud. "}]