[{"url": "http://www.enchantedlearning.com/subjects/astronomy/glossary/Eccentricity.shtml", "passage_text": "Eccentricity is a measure of how an orbit deviates from circular. A perfectly circular orbit has an eccentricity of zero; higher numbers indicate more elliptical orbits. Neptune, Venus, and Earth are the planets in our solar system with the least eccentric orbits."}, {"url": "http://www.merriam-webster.com/dictionary/eccentricity", "passage_text": "2. a: a mathematical constant that for a given conic section is the ratio of the distances from any point of the conic section to a focus and the corresponding directrix b: the eccentricity of an astronomical orbit used as a measure of its deviation from circularity. See eccentricity defined for English-language learners."}, {"url": "http://en.mimi.hu/astronomy/eccentricity.html", "passage_text": "A value that defines the shape of an ellipse or planet ary orbit. The ~ of an ellipse (planet ary orbit) is the ratio of the distance between the foci and the major axis. ~ : The measure of the degree of elongation of an ellipse. For example, a circle has an eccentric y of 0, and a parabola (an open figure) an ~ of 1."}, {"url": "http://en.mimi.hu/astronomy/eccentricity.html", "passage_text": "Orbit al Eccentricity. The orbit al eccentricity (or eccentricity) is a measure of how much an elliptical orbit is 'squashed'. It is one of the orbital elements that must be specified in order to completely define the shape and orientation of an elliptical orbit."}, {"url": "http://www.thefreedictionary.com/eccentricity", "passage_text": "2. An example or instance of eccentric behavior. 3. Physics The distance between the center of an eccentric and its axis. 4. Mathematics The ratio of the distance of any point on a conic section from a focus to its distance from the corresponding directrix. This ratio is constant for any particular conic section."}, {"url": "http://www.enchantedlearning.com/subjects/astronomy/glossary/Eccentricity.shtml", "passage_text": "Z. Eccentricity is a measure of how an orbit deviates from circular. A perfectly circular orbit has an eccentricity of zero; higher numbers indicate more elliptical orbits. Neptune, Venus, and Earth are the planets in our solar system with the least eccentric orbits."}]