[{"url": "http://www.mayoclinic.org/digestive-system/expert-answers/FAQ-20058340", "passage_text": "Digestion time varies between individuals and between men and women. After you eat, it takes about six to eight hours for food to pass through your stomach and small intestine. Food then enters your large intestine (colon) for further digestion, absorption of water and, finally, elimination of undigested food. The mean time of transit from mouth to anus for the group was 33 hours (meaning half the children had digestion times slower than this and half had digestion times greater than this)."}, {"url": "http://www.wereyouwondering.com/how-long-does-it-take-to-digest-food/", "passage_text": "At this point, the food has spent between 30 minutes and 2 hours in the stomach and between 2 and 6 hours in the small intestine and 90% of the nutrients have been extracted. Tweet. Food digestion varies depending upon the type of food. I will break down the process into its steps and provide a timeline for each step. First we see the food. This stimulates our brain to ready our stomach to receive food, by increasing gastric secretions. Then, we eat the food."}, {"url": "https://www.sharecare.com/health/digestive-health/how-long-to-digest-food", "passage_text": "Your body can digest most food in less time it takes hotshot celebrities to get engaged: about 4-12 hours. Fruits are the fastest travelers on the intestinal interstate, with meats driving like an oversized load in the right lane (they can take 2-3 days to be excreted or even longer as it rots inside your intestine). "}, {"url": "http://www.answers.com/Q/How_long_does_food_take_to_digest", "passage_text": "It actually depends on the type of food eaten. Most food you eat is completely digested, mouth to anus. in 12 to 48 hours. Some, and this is contingent upon your metabolism, c … an take as long as 72 hours. 7 people found this useful. From eating to excretion, it takes about fifty-three hours to  digest food. The first six to eight hours passing through the  stomach into the small intestine, and an averag … e of forty hours  digesting in the large intestine. 4 people found this useful. Msginascience."}, {"url": "http://www.mayoclinic.org/digestive-system/expert-answers/FAQ-20058340", "passage_text": "The average transit time through just the large intestine (colon) was 40 hours, with significant difference between men and women: 33 hours for men, 47 hours for women. Two British doctors studied digestion time in children. The mean time of transit from mouth to anus for the group was 33 hours (meaning half the children had digestion times slower than this and half had digestion times greater than this)."}, {"url": "http://www.buzzle.com/articles/how-long-does-it-take-to-digest-food.html", "passage_text": "The undigested food remains in the colon until it is expelled out. Thus, in all, digestion process is completed within 12 to 24 hours. Time Taken for Complete Digestion. On an average, it may take 24 to 72 hours for the food to digest completely. In fact, it may be several days before all the traces of food can be removed from the body. The time taken for digestion is greatly dependent upon the type of food you consume. Steak takes about 3 to 5 days for digestion. Similarly, white flour foods also take a longer time to completely get eliminated from the body"}, {"url": "http://www.mayoclinic.org/digestive-system/expert-answers/FAQ-20058340", "passage_text": "In the 1980s, Mayo Clinic researchers measured digestion time in 21 healthy people. Total transit time, from eating to elimination in stool, averaged 53 hours (although that figure is a little overstated, because the markers used by the researchers passed more slowly through the stomach than actual food). The mean time of transit from mouth to anus for the group was 33 hours (meaning half the children had digestion times slower than this and half had digestion times greater than this)."}, {"url": "http://www.delawareonline.com/story/news/health/2014/05/12/wondering-long-take-food-digest/9007573/", "passage_text": "When it comes to our digestive system, it can take hours or even longer for food to pass through. That's what it takes for the body to get the nutrients and energy it needs from what you ingest. It usually takes from 24 to 72 hours for healthy people to completely digest food and eliminate waste products. The first stop for food is the esophagus, which moves food from the back of the throat to the stomach. About six to eight hours after eating, food passes through the stomach and small intestine. The actual amount of time that this process takes depends on the food you're eating. Meat can take two days to fully digest, while vegetables and fruits take a day or less. Drinking water and high-fiber foods helps the digestive system work more efficiently."}, {"url": "http://www.thesudburystar.com/2012/05/24/how-long-does-it-take-to-digest-food-food", "passage_text": "Change text size for the story. Print. Report an error. Digestion time varies depending on the individual. For most healthy adults, it's usually between 24 and 72 hours. After you eat, it takes about six to eight hours for food to pass through your stomach and small intestine. Food then enters your large intestine (colon) for further digestion and absorption of water. Elimination of undigested food residue through the large intestine usually begins after a total of 24 hours. "}]