[{"url": "http://science.taskermilward.org.uk/mod1/KS4Chemistry/AQA/Addn%20Mod%204/Addn%204%20Docs/Electrolysis%20Revision%20questions.pdf", "passage_text": "(1) €€€€€€€€€€€ negative€€€€€€€€€€€€€ neutral€€€€€€€€€€€€€ positive (b)€€€€ Draw a ring around the name of the gas produced at the positive electrode during the electrolysis of sodium chloride solution. €€€€€€€€€ The positive electrode is connected by a patch to the skin. €€€€€€€€€ The negative electrode is connected to the hair. €€€€€€€€€ The body fluid is a solution that contains sodium chloride. The electricity causes the electrolysis of a small amount of this solution."}, {"url": "http://www.bbc.co.uk/bitesize/standard/chemistry/propertiesofsubstances/conduction/revision/5/", "passage_text": "The products of this electrolysis are: lead metal at the negative electrode. The lead will form as a liquid at the bottom of the reaction vessel. bromine (Br 2) at the positive electrode. The bromine appears as a brown gas at the positive electrode. The copper forms as a brown solid on the negative electrode. chlorine gas (Cl 2) at the positive electrode. The chlorine appears as a gas with a characteristic smell"}, {"url": "https://en.wikipedia.org/wiki/Cathode", "passage_text": "1 For example, the Daniell galvanic cell 's copper electrode is the positive terminal and the cathode. 2  In a recharging battery, or an electrolytic cell performing electrolysis, the cathode is the negative terminal, from which current exits the device and returns to the external generator. 1 For example, reversing the current direction in a Daniell galvanic cell would produce an electrolytic cell, where the copper electrode is the positive terminal and the anode. 2  In a diode, the cathode is the negative terminal at the pointed end of the arrow symbol, where current flows out of the device."}, {"url": "http://www.xtremepapers.com/revision/gcse/chemistry/electricity_in_chemistry.php", "passage_text": "So for example if the electrolyte is a concentrated solution of sodium chloride, hydrogen gas is formed at the cathode because hydrogen is less reactive than sodium. And chlorine gas is formed at the anode because the solution is concentrated. Ions present in the electrolyte are H + and OH-from water and Cu +2 and SO 4 - from copper(ii) sulfate. At the Cathode: 4OH - - 4e - → O 2 + 2H 2 O. Oxygen from OH-ions is formed. Bubbles of colorless gas are formed. To test for oxygen, approach a glowing splint, if positive it relights."}, {"url": "http://gsascience.weebly.com/uploads/2/2/5/1/22517340/c2.7_level2_qs.pdf", "passage_text": "(b) €€€€Sodium chloride solution contains two types of positive ions, sodium ions (Na +) and hydrogen ions (H +). Tick () the reason why hydrogen is produced at the negative electrode and not sodium. € (1) Reason Tick () Hydrogen is a gas. € Hydrogen is less reactive than sodium. ............................................................................................................... (1) (ii)€€€€€Name the gas formed at the negative electrode. ............................................................................................................... (1) (d) €€€€Chlorine and chlorine compounds are used to bleach wood pulp that is used to make paper. The article below is from a newspaper"}, {"url": "http://www.docbrown.info/page01/ExIndChem/electrochemistry03.htm", "passage_text": "(a) The negative cathode electrode reaction for the electrolysis of brine (sodium chloride solution). The negative () cathode attracts the Na+ (from sodium chloride) and H+ ions (from water). Only the hydrogen ions are discharged at the cathode. The more reactive a metal, the less readily its ion is reduced on the electrode surface."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20131216161049AAi0dDA", "passage_text": "Question: Tried to dissolve potassium chloride in solution to produce potassium, expected to see metal at negative electrode, but instead saw bubbles of a gas. Name the gas produced at negative electrode explain why the gas was produced at why not the potassium. Follow. 3 answers 3. Question: Tried to dissolve potassium chloride in solution to produce potassium, expected to see metal at negative electrode, but instead saw bubbles of a gas. Name the gas produced at negative electrode. explain why the gas was produced at why not the potassium. Add your answer."}, {"url": "http://www.rsc.org/learn-chemistry/resource/res00000737/identifying-the-products-of-electrolysis#!", "passage_text": "1 non-metals are formed at the positive electrode: chloride ions produce gaseous chlorine, bromide and iodide ions form bromine and iodine respectively, which dissolve to form coloured solutions; and. 2  the electrolysis of copper nitrate produces a colourless gas at the positive electrode. "}, {"url": "http://gsascience.weebly.com/uploads/2/2/5/1/22517340/c2.7_level3_qs.pdf", "passage_text": "Q2.€€€€€€€€€ The electrolysis of sodium chloride solution is an important industrial process. Three useful substances are produced: •€€€€€€€ chlorine gas is formed at the positive electrode; •€€€€€€€ hydrogen gas is formed at the negative electrode; •€€€€€€€ an alkali is left in the solution. €€€€€€€€€ At the positive electrode Cl – €€€€€€€ –€€€€€€€ e – €€€→€€€€€€€€ Cl 2 €€€€€€€€€ At the negative electrode Na€€€€€€€€€€€€€€€€€€€€€€ →€€€€€€€€€€€ Na (2) (b)€€€€ Silver halides such as silver chloride and silver bromide are used in photography. The equation shows a reaction to prepare a silver halide."}]