[{"url": "http://www.dalton.k12.oh.us/pages/uploaded_files/Sedimentary%20Rock%20Lecture.pdf", "passage_text": "Review: Where do sedimentary rocks come from? Physical weathering causes fragments called sediments Erosion move sediments Sediment in deposited in layers Older layers are on the bottom Older layers become compressed and compacted Dissolved minerals cement layers together. "}, {"url": "http://scienceline.org/2012/11/where-do-geodes-come-from/", "passage_text": "Geodes can also form in sedimentary rocks such as limestone or sandstone. The cavity in these rocks is usually formed from a solid core. A mass of minerals, or nodule, in the sediment may begin to dissolve and leave space behind. In other cases, organic matter such as coral, a fossil, or a piece of wood buried in the sediment weathers out over time. Cavities are most common in igneous rock created by cooling lava or magma. Usually this happens when a bubble of carbon dioxide and water vapor forms in flows of lava, “much like bubbles in carbonated beverages,” says George Harlow, an expert in minerals and crystals at the American Museum of Natural History."}, {"url": "http://www.answers.com/Q/Where_do_all_rocks_come_from", "passage_text": "Rocks come from a cycle we call the rock cycle, it starts off as magma, as this cools, igneous rocks are made. Weathering and erosion causes igneous rocks to turn into sedimen … ts which forms into sedimentary through compaction. "}, {"url": "http://geomaps.wr.usgs.gov/parks/rxmin/rock.html", "passage_text": "Igneous rocks (from the Greek word for fire) form from when hot, molten rock (magma) crystallizes and solidifies. The melt originates deep within the Earth near active plate boundaries or hot spots, then rises toward the surface. What a rock is made of, the shapes of the grains or crystals within the rock, and how the grains or crystals fit together all provide valuable clues to help us unlock the rock's history hidden within."}, {"url": "http://geomaps.wr.usgs.gov/parks/rxmin/rock.html", "passage_text": "Extrusive igneous rock. Extrusive, or volcanic, igneous rock is produced when magma ex its and cools outside of, or very near the Earth's surface. These are the rocks that form at erupting volcanoes and oozing fissures. What a rock is made of, the shapes of the grains or crystals within the rock, and how the grains or crystals fit together all provide valuable clues to help us unlock the rock's history hidden within."}, {"url": "http://geomaps.wr.usgs.gov/parks/rxmin/rock.html", "passage_text": "Rocks are made up mostly of crystals of different kinds of minerals, or broken pieces of crystals, or broken pieces of rocks. Some rocks are made of the shells of once-living animals, or of compressed pieces of plants. What a rock is made of, the shapes of the grains or crystals within the rock, and how the grains or crystals fit together all provide valuable clues to help us unlock the rock's history hidden within."}, {"url": "https://en.wikipedia.org/wiki/Metamorphic_rock", "passage_text": "For example, slate is a foliated metamorphic rock, originating from shale. Non-foliated rock does not have planar patterns of strain. Rocks that were subjected to uniform pressure from all sides, or those that lack minerals with distinctive growth habits, will not be foliated. Where a rock has been subject to differential stress, the type of foliation that develops depends on the metamorphic grade."}]