[{"url": "http://coursesonhorses.blogspot.com/2008/07/exactly-what-is-coggins.html", "passage_text": "Coggins is actually just the name of a test that is performed on horses. The name comes from the veterinarian who invented the test in the 1970's, Dr. Leroy Coggins. The test screens the blood of a horse to determine if the horse has the virus that causes Equine Infectious Anemia or EIA."}, {"url": "http://www.eqgroup.com/Library/coggins.htm", "passage_text": "The Coggins test checks for Equine Infectious Anemia (EIA) antibodies in the horse's blood. Blood samples must be sent to a state approved laboratory. This test is often needed to take your horse to a show and whenever you transport your horse across state lines."}, {"url": "https://answers.yahoo.com/question/index?qid=20080222214151AASAGVg", "passage_text": "Report Abuse. the Coggins test is when the vet takes blood from your horse to test for Equine Infectious Anemia, which is a contagious disease that affects the red blood cells. the results take about a week to get back."}, {"url": "http://ezinearticles.com/?What-Is-the-Coggins-Test?&id=509657", "passage_text": "To determine if a horse is negative on a Coggins' test, a blood sample from the horse is tested for the presence of EIA antibodies. Antibodies are proteins produced by the immune system that recognizes and helps fight infections and other foreign substances in the body."}, {"url": "http://www.bloomracing.com/coggins-test-what-is-a-coggins-test/", "passage_text": "A Coggins test is a blood test for Equine infectious anemia or equine infectious anaemia (EIA). This disease is also known as swamp fever. This disease is transmitted by bloodsucking insects and is caused by a retrovirus."}, {"url": "http://www.sportpolo.com/Barn/Coggins_Test.htm", "passage_text": "The Coggins Test is a blood test that checks for Equine Infectious Anemia (EIA) antibodies in a horse's blood. It is used to diagnose a contagious disease that affects horses worldwide."}, {"url": "http://ezinearticles.com/?What-Is-the-Coggins-Test?&id=509657", "passage_text": "The Coggins' test is for a serious equine virus called equine infectious anemia (EIA). There is no vaccine or cure for EIA, which is also known as swamp fever because of the warm, wet regions of the United States in which it is more common."}, {"url": "http://www.sportpolo.com/Barn/Coggins_Test.htm", "passage_text": "A Coggins Test for Equine Infectious Anemia is required for transporting a polo pony from one state to another. The Federal government requires a Coggins Test before a polo pony can be imported. A Coggins Test on a polo pony is required as proof that the horse is free of the Equine Infectious Anemia disease."}, {"url": "http://www.answers.com/Q/What_is_coggins", "passage_text": "Coggins is not actually a disease. Coggins is the name of a blood test that detects whether a horse (or other equine such as donkeys and mules) has a virus called Equine Infec … tious Anemia, (EIA). So, no, a Coggins test cannot kill a horse. However, EIA can be fatal and it is contagious."}]