[{"url": "http://work.chron.com/salaries-early-childhood-teachers-including-kindergarten-teachers-25044.html", "passage_text": "Pay for early childhood education teachers also depends in part on the location of the school. New York state reported the highest pay for preschool teachers in 2012, an average of $40,010 per year, while New Jersey paid the second-highest with an average of $36,820, according to the BLS."}, {"url": "http://www.scpr.org/blogs/education/2014/10/14/17415/preschool-teachers-among-lowest-paid-despite-degre/", "passage_text": "Although a college degree is required for many teaching in early education, it's not unusual for a teacher to get about $11.75 an hour or $24,440 for the year. That salary puts a family of three or more below the federal poverty line. The state minimum wage now stands at $9 an hour and will rise to $10 in 2016."}, {"url": "http://money.usnews.com/careers/best-jobs/preschool-teacher/salary", "passage_text": "Salary Outlook. Instructing very young children isn’t as lucrative as teaching preteens or teenagers. A preschool teacher earned a median salary of $27,570 in 2013. The profession’s top salaries were more than $49,660 a year, while the lowest salaries were $18,420 or less. Child day care services tend to employ the most preschool teachers, while elementary and secondary schools tend to pay them the best."}, {"url": "http://money.usnews.com/careers/best-jobs/preschool-teacher/salary", "passage_text": "Teaching the next generation can be rewarding in an intangible sense, but salary-wise, it’s not the most lucrative social service job. Elementary school teachers ($56,320) and middle school teachers ($56,630) both earned average salaries in 2013 that were higher than preschool teachers, who earned an average of $31,420."}, {"url": "http://work.chron.com/salaries-early-childhood-teachers-including-kindergarten-teachers-25044.html", "passage_text": "Special education teachers usually need at least a bachelor's degree. The 2012 BLS wage survey for special ed preschool teachers reported $57,770 in average annual pay, with a range from $33,010 for the lowest-paid 10 percent to $92,880 for the top 10 percent."}, {"url": "http://nieer.org/resources/policybriefs/3.pdf", "passage_text": "Helburn & Bergmann (2002). In 1998, average hourly pay for a preschool teacher with a BA or better was only 63% of the average forall women with that level of education. 11 Median national salaries for preschool teachers, kindergarten teachers, and other occupations for 2002 were obtained from Salary.com."}, {"url": "http://www.payscale.com/research/US/Job=Daycare_Teacher/Hourly_Rate", "passage_text": "The average wage for a Daycare Teacher is $9.99 per hour. Most people with this job move on to other positions after 20 years in this career. A skill in CPR is associated with high pay for this job. Pay for this job does not change much by experience, with the most experienced earning only a bit more than the least."}, {"url": "http://work.chron.com/salaries-early-childhood-teachers-including-kindergarten-teachers-25044.html", "passage_text": "New York also had the highest pay for kindergarten teachers in 2012, an annual average of $71,850, followed by Rhode Island at $71,040. The top-paying state for special education preschool teachers was Virginia, paying an average of $73,900 per year."}]