[{"url": "https://en.wikipedia.org/wiki/Cell_(biology)", "passage_text": "The cell (from Latin cella, meaning small room) is the basic structural, functional, and biological unit of all known living organisms. Cells are the smallest unit of life that can replicate independently, and are often called the building blocks of life. The study of cells is called cell biology. Cells consist of cytoplasm enclosed within a membrane, which contains many biomolecules such as proteins and nucleic acids. Organisms can be classified as unicellular (consisting of a single cell; including bacteria) or multicellular (including plants and animals). The DNA of a prokaryotic cell consists of a single chromosome that is in direct contact with the cytoplasm. The nuclear region in the cytoplasm is called the nucleoid. Most prokaryotes are the smallest of all organisms ranging from 0.5 to 2.0 µm in diameter."}, {"url": "http://www.ucmp.berkeley.edu/fungi/fungimm.html", "passage_text": "Fungi: More on Morphology. Like plants and animals, fungi are eukaryotic multicellular organisms. Unlike these other groups, however, fungi are composed of filaments called hyphae; their cells are long and thread-like and connected end-to-end, as you can see in the picture below. Rather, the filaments are long and tubular, with a cytoplasm lining and large vacuole in the center. By contrast, the ascomycetes and basidiomycetes are septate; their filaments are partitioned by cellular cross-walls called septa. The structure of these septa varies, and is taxonomically useful."}, {"url": "https://askabiologist.asu.edu/content/cell-parts", "passage_text": "1 Chromosome: a long, thread-like molecule made of the chemical called DNA (deoxyribonucleic acid) that is held together with special proteins and is visible (with strong microscopes) during cell division... 2  more. 3  Molecule: a chemical structure that has two or more atoms held together by a chemical bond. Nucleus-The nucleus is the control center of the cell. It is the largest organelle in the cell and it contains the DNA of the cell. DNA (Deoxyribonucleic Acid) contains all the information for cells to live, perform their functions and reproduce."}, {"url": "https://askabiologist.asu.edu/content/cell-parts", "passage_text": "Some vesicles deliver materials to parts of the cell and others transport materials outside the cell in a process called exocytosis. back to top. Vacuole-Plant cells have what looks like a very large empty space in the middle. This space is called the vacuole. Nucleus-The nucleus is the control center of the cell. It is the largest organelle in the cell and it contains the DNA of the cell. DNA (Deoxyribonucleic Acid) contains all the information for cells to live, perform their functions and reproduce."}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/cell", "passage_text": "Cytoskeleton. The cytoskeleton is a network of long fibers that make up the cell’s structural framework. The cytoskeleton has several critical functions, including determining cell shape, participating in cell division, and allowing cells to move. "}, {"url": "http://www.ucmp.berkeley.edu/fungi/fungimm.html", "passage_text": "Another feature of fungi is the presence of chitin in their cell walls. This is a long carbohydrate polymer that also occurs in the exoskeletons of insects, spiders, and other arthropods. The chitin adds rigidity and structural support to the thin cells of the fungus, and makes fresh mushrooms crisp. Rather, the filaments are long and tubular, with a cytoplasm lining and large vacuole in the center. By contrast, the ascomycetes and basidiomycetes are septate; their filaments are partitioned by cellular cross-walls called septa. The structure of these septa varies, and is taxonomically useful."}, {"url": "https://askabiologist.asu.edu/content/cell-division", "passage_text": "In cell division, the cell that is dividing is called the parent cell. The parent cell divides into two daughter cells. The process then repeats in what is called the cell cycle. Cells regulate their division by communicating with each other using chemical signals from special proteins called cyclins. It is also important for cells to stop dividing at the right time. If a cell can not stop dividing when it is supposed to stop, this can lead to a disease called cancer. Some cells, like skin cells, are constantly dividing. We need to continuously make new skin cells to replace the skin cells we lose."}, {"url": "https://askabiologist.asu.edu/content/cell-division", "passage_text": "1 Chromosome: a long, thread-like molecule made of the chemical called DNA (deoxyribonucleic acid) that is held together with special proteins and is visible (with strong microscopes) during cell division... 2  more. 3  DNA: deoxyribonucleic acid is the information blue-print of the cell. It is also important for cells to stop dividing at the right time. If a cell can not stop dividing when it is supposed to stop, this can lead to a disease called cancer. Some cells, like skin cells, are constantly dividing. We need to continuously make new skin cells to replace the skin cells we lose."}, {"url": "http://www.nature.com/scitable/topicpage/chromosomes-14121320", "passage_text": "Chromosomes are made up of a DNA-protein complex called chromatin that is organized into subunits called nucleosomes. The way in which eukaryotes compact and arrange their chromatin not only allows a large amount of DNA to fit in a small space, but it also helps regulate gene expression. eBooks. During interphase, the cell's DNA is not condensed and is loosely distributed. A stain for heterochromatin (which indicates the position of chromosomes) shows this broad distribution of chromatin in a mouse cell (upper left). The same stain also shows the organized, aligned structure of the chromosomes during mitosis."}, {"url": "https://askabiologist.asu.edu/content/cell-parts", "passage_text": "Channels/pores-A channel in the cell's plasma membrane. This channel is made up of certain proteins whose function is to control the movement of food and water into the cell. These channels are made up of certain proteins. Nucleus-The nucleus is the control center of the cell. It is the largest organelle in the cell and it contains the DNA of the cell. DNA (Deoxyribonucleic Acid) contains all the information for cells to live, perform their functions and reproduce."}]