[{"url": "http://www.mymosh.com/services/hand/gamekeepers-thumb/", "passage_text": "Gamekeeper's Thumb. Gamekeeper’s thumb is a repetitive stress injury of the ulnar collateral ligament—tough fibrous tissue that connects the bones at the base of the thumb. Over time, overuse leads to the loosening of the ulnar ligament. Gamekeeper’s thumb most often occurs as a result of chronic overuse in a sport such as skiing in which gripping of the pole exerts repeated stress on the thumb."}, {"url": "http://www.rushortho.com/skiers-gamekeepers-thumb.cfm", "passage_text": "Skier's thumb, also known as Gamekeeper's thumb, is an injury to the ulnar collateral ligament (UCL), which is located in the metacarpophalangeal (MCP) joint where the thumb meets the hand. The purpose of the UCL is to keep the thumb stable in order to pinch objects. Skier's thumb got its name because this injury frequently happens during skiing accidents during which a person falls and doesn't let go of the ski pole. The thumb is jerked away from the index finger, stretching or even completely tearing the ulnar collateral ligament."}, {"url": "http://www.merriam-webster.com/dictionary/gamekeeper", "passage_text": "Full Definition of GAMEKEEPER. : a person in charge of the breeding and protection of game animals or birds on a private preserve. See gamekeeper defined for English-language learners. See gamekeeper defined for kids. Definition of GAMEKEEPER for Kids. : a person in charge of the breeding and protection of game animals or birds on private land."}, {"url": "http://emedicine.medscape.com/article/97679-overview", "passage_text": "Background. Gamekeeper's thumb is an insufficiency of the ulnar collateral ligament (UCL) of the metacarpophalangeal (MCP) joint of the thumb. Campbell originally coined the term in 1955 because the condition was most commonly associated with Scottish gamekeepers (especially rabbit keepers) as a work-related injury"}, {"url": "https://en.wikipedia.org/wiki/Gamekeeper%27s_thumb", "passage_text": "Gamekeeper's thumb (also known as skier's thumb or UCL tear) is a type of injury to the ulnar collateral ligament (UCL) of the thumb. The UCL is torn at (or in some cases even avulsed from) its insertion site into the proximal phalanx of the thumb in the vast majority (approximately 90%) of cases. This condition is commonly observed among gamekeepers and Scottish fowl hunters, as well as athletes (such as volleyballers). Symptoms and signs [edit]. Symptoms of gamekeeper's thumb are instability of the MCP joint of the thumb, accompanied by pain and weakness of the pinch grasp."}, {"url": "http://emedicine.medscape.com/article/1239413-overview", "passage_text": "History of the Procedure. Gamekeeper's thumb is a clinical instability of the first metacarpophalangeal (MCP) joint caused by an insufficiency of the ulnar collateral ligament (UCL) in the MCP of the thumb. Gamekeeper's thumb is caused by a valgus force that is directed on the MCP joint of the thumb and produces a failure of the UCL. Falls on an abducted thumb and the fall of a skier against a planted ski pole are common mechanisms. (For a discussion of the anatomy of the MCP joint and the UCL, see Relevant Anatomy.)."}, {"url": "http://www.rightdiagnosis.com/g/gamekeepers_thumb/intro.htm", "passage_text": "Gamekeeper's thumb: A chronic injury to the ligament that joins the thumb to the other hand bones and stops it from pulling too far away from the hand. Soccer players and skiers are most likely to develop this the type of injury. "}]