[{"url": "https://en.wikipedia.org/wiki/Photosynthesis", "passage_text": "In most cases, oxygen is also released as a waste product. Most plants, most algae, and cyanobacteria perform photosynthesis; such organisms are called photoautotrophs. Photosynthesis maintains atmospheric oxygen levels and supplies all of the organic compounds and most of the energy necessary for life on Earth. Carbon dioxide is converted into sugars in a process called carbon fixation. Carbon fixation is an endothermic redox reaction, so photosynthesis needs to supply both a source of energy to drive this process, and the electrons needed to convert carbon dioxide into a carbohydrate."}, {"url": "http://www.diffen.com/difference/Cellular_Respiration_vs_Photosynthesis", "passage_text": "Photosynthesis is a process in photoautotrophs that converts carbon dioxide into organic compounds in the presence of sunlight. Respiration is the set of metabolic reactions that take in cells of living organisms that convert nutrients like sugar into ATP (adenosine tri phosphate) and waste products. The production of organic carbon (glucose and starch) from inorganic carbon (carbon dioxide) with the use of ATP and NADPH produced in the light dependent reaction. Fate of oxygen and carbon dioxide. Oxygen is absorbed and carbon dioxide is released. Carbon dioxide is absorbed and oxygen"}, {"url": "http://www.biology-online.org/biology-forum/about642.html", "passage_text": "I don't think so. ATP is used to start Calvin cycle, and NADPH is the product of photosynthesis, it is made when NADP+ meet H+ in the aTPsynthase. Sat Apr 16, 2005 5:31 pm. NADPH is not a product: it simply carries the energiezed electron-the are used in the Calvin cycle to form glucose. "}, {"url": "http://chemistry.about.com/od/biochemistry/fl/What-Are-the-Products-of-Photosynthesis.htm", "passage_text": "Frank Krahmer, Getty Images. Short Answer: The products of photosynthesis are sugar (glucose) and oxygen. Photosynthesis is the name given to the set of chemical reactions performed by plants to convert energy from the sun into chemical energy in the form of sugar. Specifically, plants use energy from sunlight to react carbon dioxide and water to produce sugar (glucose) and oxygen."}, {"url": "http://www.globalchange.umich.edu/globalchange1/current/lectures/kling/energyflow/PSN_primer.html", "passage_text": "Sunlight is converted to chemical energy in the form of ATP (adenosine triphosphate), which is the main energy-storing molecule in living organisms. ATP is then transported throughout the chloroplast and used to provide the chemical energy necessary to power other metabolic reactions. Photosynthesis is the process by which organisms that contain the pigment chlorophyll convert light energy into chemical energy which can be stored in the molecular bonds of organic molecules (e.g., sugars). Photosynthesis powers almost all trophic chains and food webs on the Earth."}, {"url": "http://www.globalchange.umich.edu/globalchange1/current/lectures/kling/energyflow/PSN_primer.html", "passage_text": "Photosynthesis. The net process of photosynthesis is described by the following equation: 6CO2 + 6H2O + Light Energy = C6H12O6 + 6O2. This equation simply means that carbon dioxide from the air and water combine in the presence of sunlight to form sugars; oxygen is released as a by-product of this reaction. Photosynthesis is the process by which organisms that contain the pigment chlorophyll convert light energy into chemical energy which can be stored in the molecular bonds of organic molecules (e.g., sugars). Photosynthesis powers almost all trophic chains and food webs on the Earth."}, {"url": "http://www.rsc.org/Education/Teachers/Resources/cfb/Photosynthesis.htm", "passage_text": "Photosynthesis Photosynthesis is the process by which plants, some bacteria and some protistans use the energy from sunlight to produce glucose from carbon dioxide and water. This glucose can be converted into pyruvate which releases adenosine triphosphate (ATP) by cellular respiration. Oxygen is also formed. The first steps in the Calvin cycle. The first stable product of the Calvin Cycle is phosphoglycerate (PGA), a 3-C chemical. The energy from ATP and NADPH energy carriers generated by the photosystems is used to phosphorylate the PGA."}, {"url": "http://www.answers.com/Q/What_are_the_products_of_photosynthesis", "passage_text": "50 Contributions. The general equation for photosynthesis is as follows:   6CO2 + 6H2O + (light) - C6H12O6 + 6O2    Therefore, the products of photosynthesis are a glucose sugar  mo … lecule, 6 oxygen molecules from six carbon dioxide molecules, and  6 water molecules in the presence of sunlight. 7 people found this useful. "}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookPS.html", "passage_text": "Photosynthesis is the process by which plants, some bacteria, and some protistans use the energy from sunlight to produce sugar, which cellular respiration converts into ATP, the fuel used by all living things. The raw materials of photosynthesis, water and carbon dioxide, enter the cells of the leaf, and the products of photosynthesis, sugar and oxygen, leave the leaf. Cross section of a leaf, showing the anatomical features important to the study of photosynthesis: stoma, guard cell, mesophyll cells, and vein."}, {"url": "https://en.wikipedia.org/wiki/Photosynthesis", "passage_text": "This chemical energy is stored in carbohydrate molecules, such as sugars, which are synthesized from carbon dioxide and water – hence the name photosynthesis, from the Greek φῶς, phōs, light, and σύνθεσις, synthesis, putting together. Carbon dioxide is converted into sugars in a process called carbon fixation. Carbon fixation is an endothermic redox reaction, so photosynthesis needs to supply both a source of energy to drive this process, and the electrons needed to convert carbon dioxide into a carbohydrate."}]