[{"url": "http://www.auntyflo.com/flower-dictionary/cactus", "passage_text": "Cactus plants are the perfect symbol for endurance as you can see it with the way they’re structured as well as with the way they live. So giving out cactus to the person you have strong feeling with means that what you have is a love that endures. It’s seen as a symbol of unconditional love because even in harsh conditions, it thrives. What the Cactus Means: Endurance. Looking at cactus spawns inspiration and helps you see life in a better perspective. Even there’s no drop of water in sight and amidst the excruciating heat (or freezing cold), the cactus endures."}, {"url": "http://en.vancouverflorist.com/flower-meaning/cactus.aspx", "passage_text": "People all know what a cactus is, but there is a lot more to it than just something that has prickly pieces to it. You will find that there is a lot of history that you can get out of this plant and it can be fun to understand the meaning. Cactus actually comes from a Greek word “kaktos” which of course is a plant that has spiny thistles to protect it. You will find that there are a few other names people know it by; one of the most entertaining is “Mother-in-law’s Cushion.” As a floral meaning, the cactus represents longevity and endurance; this is a plant that can handle what is thrown at it in terms of the elements."}, {"url": "http://www.auntyflo.com/flower-dictionary/cactus", "passage_text": "Color: The color of cactus flowers depends on the species of the cactus. The flower can bloom out in white or yellow but there are some that comes out in purple and reddish hues. It’s seen as a symbol of unconditional love because even in harsh conditions, it thrives. What the Cactus Means: Endurance. Looking at cactus spawns inspiration and helps you see life in a better perspective. Even there’s no drop of water in sight and amidst the excruciating heat (or freezing cold), the cactus endures."}, {"url": "http://en.vancouverflorist.com/flower-meaning/cactus.aspx", "passage_text": "The nice thing is, the cactus is really easy to grow, there is really just one key to growing the cactus plant and that is the amount of water that is given to it. You will find that there are a few other names people know it by; one of the most entertaining is “Mother-in-law’s Cushion.” As a floral meaning, the cactus represents longevity and endurance; this is a plant that can handle what is thrown at it in terms of the elements."}, {"url": "https://en.wikipedia.org/wiki/Cactus", "passage_text": "A cactus (plural: cacti, cactuses, or cactus) is a member of the plant family Cactaceae within the order Caryophyllales. The word cactus derives, through Latin, from the Ancient Greek κάκτος, kaktos, a name originally used by Theophrastus for a spiny plant whose identity is not certain. Cacti occur in a wide range of shapes and sizes. Most cacti live in habitats subject to at least some drought."}, {"url": "http://www.statesymbolsusa.org/symbol-official-item/texas/state-plant-state-food-agriculture-symbol/prickly-pear-cactus", "passage_text": "Prickly Pear Cactus. The prickly pear cactus was designated the official plant symbol of Texas in 1995. Found in the deserts of the American southwest, the fruits of most prickly pear cacti are edible, and have been a source of food to native Americans for thousands of years. "}, {"url": "http://en.vancouverflorist.com/flower-meaning/cactus.aspx", "passage_text": "You will see that the cactus plant has all kinds of different species and variations to it. The different looks of the cactus plant will all depend on the species of it and which one it is. You will find that there are a few other names people know it by; one of the most entertaining is “Mother-in-law’s Cushion.” As a floral meaning, the cactus represents longevity and endurance; this is a plant that can handle what is thrown at it in terms of the elements."}, {"url": "http://www.answers.com/Q/What_does_a_cactus_symbolize", "passage_text": "The cactus is one of the few plants found in the desert, and in order to survive it needs a massive amount of water. Since it does not rain all year round in a desert, cacti s … tore water when it does rain. So the needles on the cactus protect their water-rich flesh from other things in the desert. + 7 others found this useful. Vikas Arora."}, {"url": "http://www.answers.com/Q/What_is_the_Symbolic_meaning_of_cactus", "passage_text": "Literally it means a cactus leaf shaped like a heart. Figuratively it could mean a person whose heart is prickly or spiny, sort like hard-hearted but maybe not so extreme as h … ard-hearted. 2 people found this useful. Symbolism is a literary technique. A symbol is something that represents something else. For example, in To Kill a Mockingbird, a mockingbird symbolizes someone who does goo … d things for other people, and does no wrong, but is still persecuted."}]