[{"url": "http://hypertextbook.com/facts/2003/ChrisDAmbrose.shtml", "passage_text": "The frequency of a sound wave determines its tone and pitch. The frequency range of a young person is about 20 to 20,000 hertz. The human ear is capable of hearing many of the sounds produced in nature, but certainly not all."}, {"url": "https://en.wikipedia.org/wiki/Hearing_range", "passage_text": "The commonly stated range of human hearing is 20 Hz to 20 kHz. Under ideal laboratory conditions, humans can hear sound as low as 12 Hz. Humans are most sensitive to (i.e. able to discern at lowest intensity) frequencies between 2,000 and 5,000 Hz. Individual hearing range varies according to the general condition of a human's ears and nervous system."}, {"url": "http://www.teachmeaudio.com/mixing/techniques/audio-spectrum", "passage_text": "The audio spectrum is the audible frequency range at which humans can hear. The range spans from 20 Hz to 20,000 Hz and can be effectively broken down into seven different frequency bands, with each having a different impact on the total sound."}, {"url": "http://hypertextbook.com/facts/2003/ChrisDAmbrose.shtml", "passage_text": "A sound with a high frequency will have a high pitch, such as a dog whistle. Humans cannot hear sounds of every frequency. The range of hearing for a healthy young person is 20 to 20,000 hertz. The hearing range of humans gets worse with age. People lose the ability to hear sounds of high frequency as they get older."}, {"url": "https://en.wikipedia.org/wiki/Hearing_range", "passage_text": "The human range is commonly given as 20 to 20,000 Hz, though there is considerable variation between individuals, especially at high frequencies, and a gradual loss of sensitivity to higher frequencies with age is considered normal. Sensitivity also varies with frequency, as shown by equal-loudness contours."}, {"url": "http://donrathjr.com/audible-range-human-hearing/", "passage_text": "Frequency is measured using the Hz symbol meaning Hertz. The chart above shows a total span of frequencies from 20 Hz to 130,000 Hz. Noting that the limitation of the range of human hearing is between 20 Hz and 20,000 Hz one can easily see that frequencies exist outside of our capability to hear them."}]