[{"url": "http://www.answers.com/Q/What_type_of_government_does_India_have", "passage_text": "The Union Government of India is a federal parliamentary representative democratic republic. The Preamble of the Constitution of India describes the nation as a a sovereign, socialist, secular, democratic republic. (check related links for more info.). India has a democratic government which is ruled by Indian National Congress AKA India has a democracy as its government. :). We Can also write it as a parliamentary form of goverment for short. :). India form of government is a Federal republic Parliamentary democracy. India has a democratic government. By: Saurabh mukherjee. democratic. It is a Federal Republic"}, {"url": "http://www.indiaquickfacts.com/content/india-government-indian-democracy", "passage_text": "The (Indian) Union Government or the Central Government (as opposed to State Governments) governs the union of 28 states and 7 Union Territories (UTs). This union is the Republic of India. The seat of the government is the Indian Capital-New Delhi. Indian has a Parliamentary form of government. The constitutional head of the Indian Executive is the President. The council of the Parliament consists of the President, the Upper House-the Council of States (Rajya Sabha) and the Lower house, the House of the People (Lok Sabha)."}, {"url": "http://country-facts.findthedata.com/l/122/India", "passage_text": "India's government is a Federal Republic with 790 members in its legislature. Executive elections are every 5 years, and the last one was in 2014. The percent of seats in Indian parliament held by women is 35% lower than the global average, 17% . "}, {"url": "http://www.infoplease.com/encyclopedia/world/india-government.html", "passage_text": "Government. India is a federal state with a parliamentary form of government. It is governed under the 1949 constitution (effective since Jan., 1950). The president of India, who is head of state, is elected for a five-year term by the elected members of the federal and state parliaments; there are no term limits."}, {"url": "http://www.answers.com/Q/What_type_of_government_does_India_have", "passage_text": "The most common form of government in ancient India was monarchy.   Monarchy is a form of government in which supreme power is actually vested in an individual, who is t … he head of the state, often until death or abdication. India has a democratic government which is ruled by Indian National Congress AKA India has a democracy as its government. :). We Can also write it as a parliamentary form of goverment for short. :). India form of government is a Federal republic Parliamentary democracy. India has a democratic government. By: Saurabh mukherjee. democratic. It is a Federal Republic"}, {"url": "https://en.wikipedia.org/wiki/Government_of_India", "passage_text": "India has a federal government, with elected officials at the federal (national), state and local levels. On a national level, the head of government, the Prime Minister, is elected appointed by the president of India amongst the party which won the majority seats in Loksabha. The basic civil and criminal laws governing the citizens of India are set down in major parliamentary legislation, such as the Civil Procedure Code, the Indian Penal Code, and the Criminal Procedure Code. The union and individual state governments all each consist of executive, legislative and judicial branches."}, {"url": "https://en.wikipedia.org/wiki/Government_of_India", "passage_text": "State governments in India are the governments ruling States of India and the chief minister heads the state government. Power is divided between union government and state governments. State government's legislature is bicameral in 7 states and unicameral in the rest. The basic civil and criminal laws governing the citizens of India are set down in major parliamentary legislation, such as the Civil Procedure Code, the Indian Penal Code, and the Criminal Procedure Code. The union and individual state governments all each consist of executive, legislative and judicial branches."}, {"url": "http://kids.britannica.com/comptons/article-202423/India", "passage_text": "India is a multiparty democracy. Like the United Kingdom, it has a parliamentary system of government. Like the United States, India has a federal structure of government, in which the constitution divides power between the central government and the state governments. India's present constitution went into effect on January 26, 1950. It has been amended numerous. India..."}, {"url": "https://en.wikipedia.org/wiki/India", "passage_text": "India, officially the Republic of India (Bhārat Gaṇarājya), is a country in South Asia. It is the seventh-largest country by area, the second-most populous country with over 1.2 billion people, and the most populous democracy in the world. "}]