[{"url": "http://www.nationalgeographic.com/pyramids/north.html", "passage_text": "THIRD TIME'S THE CHARM. Soon after the bend in the Bent Pyramid began to take shape, Snefru ordered another pyramid to be built nearby, the Red, or North, Pyramid. It would be Snefru's third attempt at a classic, smooth-sided pyramid, and it was a charman elegant precursor to the Great Pyramids at Giza. "}, {"url": "http://www.egyptian-pyramids.co.uk/the-bent-pyramid.htm", "passage_text": "The Bent Pyramid was probably either the first or second of Snefru's pyramids, depending on who built the Medium Pyramid. It was almost certainly built prior to his other project at Dahshur, the Red Pyramid. Few experts believe that Sneferu was buried in the Bent Pyramid. The Bent Pyramid. Located in Dahshur (which forms the southernmost area of the Memphis Necropolis and contains a number of pyramid complexes and monuments), is the Bent Pyramid. The Bent Pyramid was probably the ancient Egyptians first attempt at a 'true' pyramid, with smooth sides."}, {"url": "http://www.crystalinks.com/bentpyr.html", "passage_text": "Located in southern Saqqara stand the pyramids of Dhashur. Among them stands the Bent Pyramid. The Bent Pyramid is about 2 km south of the Mastaba Faraoun. The builder of the Bent Pyramid is thought to have been the Pharaoh Snefru (2680-2565 BC), who was the first ruler of the 4th Dynasty. The Bent Pyramid, is one of three (or maybe even four) pyramids built by the great Pharaoh Snefru in Egypt's Old Kingdom. His sons were also pyramid builders who helped create these projects. Cheops was one of his sons. Snefru had the Bend pyramid built as a safe place to rest after he passed to the other side"}, {"url": "http://www.ancientegyptonline.co.uk/bent-pyramid-dashur.html", "passage_text": "The first pyramid to be built at Dashur was the pyramid that we now know as the Bent Pyramid of Sneferu. The lower courses of the pyramid were built at an angle of 54 to 55 degrees, but the upper courses at a lower angle of 43 degrees, giving it the unique shape which has led to its modern name. "}, {"url": "http://www.egyptian-pyramids.co.uk/the-bent-pyramid.htm", "passage_text": "The Bent Pyramid was planned to be larger than the Great Pyramid that was built later at Giza by Sneferu's son, Khufu (Cheops) but for some reason the original plans changed and the pyramids angle was changed. The Bent Pyramid. Located in Dahshur (which forms the southernmost area of the Memphis Necropolis and contains a number of pyramid complexes and monuments), is the Bent Pyramid. The Bent Pyramid was probably the ancient Egyptians first attempt at a 'true' pyramid, with smooth sides."}, {"url": "http://archaeology.about.com/od/bterms/g/bentpyramid.htm", "passage_text": "Bent Pyramid (Egypt). I love Naples. Definition: The Bent Pyramid is one of the Old Kingdom Pyramids at Giza, Egypt; built in the 4th Dynasty, 2680-2565 B.C. for the 4th dynasty pharaoh, Sneferu. The pyramid is called bent because it changes angles at about 2/3 of the way to the top. To be precise, the lower 165 feet of the pyramid's shape is angled at 54 degrees, 31 minutes, at which point it abruptly flattens out to 43 degrees, 21 minutes."}, {"url": "https://en.wikipedia.org/wiki/Bent_Pyramid", "passage_text": "From Wikipedia, the free encyclopedia. The Bent Pyramid is an ancient Egyptian pyramid located at the royal necropolis of Dahshur, approximately 40 kilometres south of Cairo, built under the Old Kingdom Pharaoh Sneferu (c. 2600 BC). A unique example of early pyramid development in Egypt, this was the second pyramid built by Sneferu. The ancient formal name of the Bent Pyramid is generally translated as (The)-Southern-Shining-Pyramid, or Sneferu-(is)-Shining-in-the-South. Comparison of approximate profiles of Bent Pyramid with some notable pyramidal or near-pyramidal buildings."}, {"url": "http://www.egyptian-pyramids.co.uk/the-bent-pyramid.htm", "passage_text": "The Bent Pyramid was built by command of the pharoah Sneferu, the first ruler of the 4th Dynasty, who ruled from 2613 - 2589 BC and probably did more than any other person to advance the science and custom of pyramid building. Sneferu was the father of Khufu, also known as Cheops, who built the Great Pyramid at Giza. The Bent Pyramid. Located in Dahshur (which forms the southernmost area of the Memphis Necropolis and contains a number of pyramid complexes and monuments), is the Bent Pyramid. The Bent Pyramid was probably the ancient Egyptians first attempt at a 'true' pyramid, with smooth sides."}, {"url": "https://en.wikipedia.org/wiki/Bent_Pyramid", "passage_text": "The Bent Pyramid rises from the desert at a 54-degree inclination, but the top section is built at the shallower angle of 43 degrees, lending the pyramid its very obvious 'bent' appearance. The ancient formal name of the Bent Pyramid is generally translated as (The)-Southern-Shining-Pyramid, or Sneferu-(is)-Shining-in-the-South. Comparison of approximate profiles of Bent Pyramid with some notable pyramidal or near-pyramidal buildings."}]