[{"url": "https://en.wikipedia.org/wiki/Graffiti", "passage_text": "The first known example of modern style graffiti survives in the ancient Greek city of Ephesus (in modern-day Turkey). Local guides say it is an advertisement for prostitution. Located near a mosaic and stone walkway, the graffiti shows a handprint that vaguely resembles a heart, along with a footprint and a number. The term graffiti referred to the inscriptions, figure drawings, and such, found on the walls of ancient sepulchres or ruins, as in the Catacombs of Rome or at Pompeii. Use of the word has evolved to include any graphics applied to surfaces in a manner that constitutes vandalism."}, {"url": "http://www.merriam-webster.com/dictionary/graffiti", "passage_text": "Usage Discussion of GRAFFITI. Graffiti, which also serves as the plural of graffito, is commonly used as a singular mass noun. This use is well established although not yet as well established as the mass-noun use of data. Use of graffiti as a singular count noun is still quite rare and is not standard"}, {"url": "http://www.yourdictionary.com/graffiti", "passage_text": "noun. Graffiti on a wall. Graffiti on a wall. The definition of graffiti is writing, drawing, or other marks on a wall where it does not belong. When someone scrawls a gang symbol on the side of a public building, this is an example of graffiti. Usage Note: The word graffiti is a plural noun in Italian. In English graffiti is far more common than the singular form graffito and is mainly used as a singular noun in much the same way data is."}, {"url": "https://en.wikipedia.org/wiki/Graffiti", "passage_text": "Graffiti (/ɡrəˈfiːti/ ; [ɡrafˈfiːti] ; plural of graffito : a graffito, but these graffiti) are writing or drawings that have been scribbled, scratched, or painted illicitly on a wall or other surface, often in a public place. The term graffiti referred to the inscriptions, figure drawings, and such, found on the walls of ancient sepulchres or ruins, as in the Catacombs of Rome or at Pompeii. Use of the word has evolved to include any graphics applied to surfaces in a manner that constitutes vandalism."}, {"url": "http://www.answers.com/Q/What_was_the_original_meaning_of_the_word_graffiti", "passage_text": "Graffiti and graffito are from the Italian word graffiato (scratched). Graffiti is applied in art history to works of art produced by scratching a design into a surf … ace. A related term is graffito, which involves scratching through one layer of pigment to reveal another beneath it. The noun 'graffiti' is an Italian word for writing on public walls,  a variation of graffio (a scratch or scribble),  originating from the Greek graphein (to scratch, draw, …  write).    The singular form is graffito. 3 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/Graffiti", "passage_text": "Both graffiti and its occasional singular form graffito are from the Italian word graffiato (scratched). Graffiti is applied in art history to works of art produced by scratching a design into a surface. The term graffiti referred to the inscriptions, figure drawings, and such, found on the walls of ancient sepulchres or ruins, as in the Catacombs of Rome or at Pompeii. Use of the word has evolved to include any graphics applied to surfaces in a manner that constitutes vandalism."}, {"url": "http://www.thefreedictionary.com/graffiti", "passage_text": "graphic, graft 1 ]. graf•fi′tist, n. usage: In formal speech and writing graffiti usually takes a plural verb. In less formal contexts it is sometimes considered a mass noun used with a singular verb. graffito is found mostly in archaeological and other technical writing. "}, {"url": "https://en.wikipedia.org/wiki/Graffiti", "passage_text": "In modern times, paint (particularly spray paint) and marker pens have become the most commonly used graffiti materials. In most countries, marking or painting property without the property owner's consent is considered defacement and vandalism, which is a punishable crime. The term graffiti referred to the inscriptions, figure drawings, and such, found on the walls of ancient sepulchres or ruins, as in the Catacombs of Rome or at Pompeii. Use of the word has evolved to include any graphics applied to surfaces in a manner that constitutes vandalism."}]