[{"url": "http://www.indeed.com/cmp/Wawa/salaries", "passage_text": "Average Wawa hourly pay ranges from approximately $8.00 per hour for Clerk to $15.00 per hour for Customer Service Manager. The average Wawa salary ranges from approximately $15,000 per year for Customer Service Representative to $90,000 per year for General Manager. Salary information comes from 520 data points collected directly from employees, users, and jobs on Indeed. "}, {"url": "http://www.answers.com/Q/How_much_does_an_employee_at_Wawa_make", "passage_text": "How much money can you make at wawa?   I know that my Floor manager makes $18 an hour and he is still and hourly pay manager and out GM makes around 200,000.00 a year. depends on how long you've worked there. I've been there 21 yrs and I make $17.00 hour. Time and a half on Sun. good benefits too. Now you're hired at $7.50-$8.00 an hour. top … rate for new hires is about $11.00 hr."}, {"url": "http://www.answers.com/Q/How_much_does_an_employee_at_Wawa_make", "passage_text": "How much does an employee at Costco make? Typically employees start out at 11.00 an hour as a low level employee. If you're assistant manager you'll start at about 12.50. in the first 400 hours theres a .25 raise and … more occur after each block of 800 hours. Everyone starts off at 11/hr and you get a .50 raise when you reach a certain goal in your hours. + 23 others found this useful. depends on how long you've worked there. I've been there 21 yrs and I make $17.00 hour. Time and a half on Sun. good benefits too. Now you're hired at $7.50-$8.00 an hour. top … rate for new hires is about $11.00 hr."}, {"url": "http://www.answers.com/Q/How_much_money_can_you_make_at_wawa", "passage_text": "Making the world better, one answer at a time. I know that my Floor manager makes $18 an hour and he is still and hourly pay manager and out GM makes around 200,000.00 a year. "}, {"url": "http://www.payscale.com/research/US/Employer=Wawa%2c_Inc./Hourly_Rate", "passage_text": "When it comes to location, the highest average paycheck ($16.23 per hour) can be spotted in Media, Pa.; Orlando, Fla. ($12.08), Bradenton, Fla. ($11.00), and Malvern, Pa. (around $9.55) are the next top-paying cities. By state, Wawa, Inc. employees make the most in Florida, earning approximately $11.25 per hour on average."}, {"url": "http://www.myjobapps.com/wawa-manager-salary/", "passage_text": "1 Salary: Assistant managers get an estimated $29,000 to $36,000 and the amount depends heavily on any work experience related to the field. 2  Bonuses: Bonuses are offered by the company for this type of position and they get $ 957 to $1,034. Fresh Food Manager. 1  Salary: Depending on the experience fresh food managers receive an annual salary of $36,000 to $40,000. 2  Bonuses: The company does not entitle this position to receive cash bonuses. 3  Profit Sharing: There is no profit sharing available for the fresh food manager."}, {"url": "https://www.wawa.com/Jobs.aspx", "passage_text": "Wawa is a recognized leader in our industry, and we are looking for the best and the brightest to be part of our team. We have over 650 locations in the Mid-Atlantic and Florida regions and we continue to grow and expand. Stay informed about the latest Wawa job postings with job alerts from our Talent Network. Learn more. Of course we think Wawa is a great place to work, and you’ll be pleased to find out the majority of our employees feel the same way. Check out Glassdoor details."}, {"url": "http://www.myjobapps.com/wawa-manager-salary/", "passage_text": "The managers should make sure that the store is clean and that all of the equipment used are in good working condition. General Manager. 1  Salary: A General Manager is entitled to receive a salary range from $51,000 to $102,000. Fresh Food Manager. 1  Salary: Depending on the experience fresh food managers receive an annual salary of $36,000 to $40,000. 2  Bonuses: The company does not entitle this position to receive cash bonuses. 3  Profit Sharing: There is no profit sharing available for the fresh food manager."}, {"url": "http://www.simplyhired.com/salaries-k-wawa-jobs.html", "passage_text": "Average Wawa Salaries. The average salary for wawa jobs is $27,000. Average wawa salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term wawa anywhere in the job listing. The wawa salary comparisons feature allows job seekers to get the information required to make important career decisions and negotiate salary ranges. For additional wawa salary information, we recommend visiting Payscale.com."}, {"url": "http://www.payscale.com/research/US/Employer=Wawa%2c_Inc./Hourly_Rate", "passage_text": "Years of Experience. Average pay is about $11.74 per hour for those with five to nine years of experience. Overall, the greater share of Wawa, Inc. folks have one to four years of experience and earn an average $9.37 per hour. (around $9.55) are the next top-paying cities. By state, Wawa, Inc. employees make the most in Florida, earning approximately $11.25 per hour on average."}]