[{"url": "http://geography.about.com/od/learnabouttheearth/a/The-Equator-Hemispheres-Tropic-Of-Cancer-And-Tropic-Of-Capricorn.htm", "passage_text": "Share. The equator is located at zero degrees latitude. The equator runs through Indonesia, Ecuador, northern Brazil, the Democratic Republic of the Congo, and Kenya, among other countries. It is 24,901.55 miles (40,075.16 kilometers) long."}, {"url": "http://www.socialstudiesforkids.com/articles/geography/equatorprimemeridian.htm", "passage_text": "Well, that depends on whether you're looking for 0 degrees latitude or 0 degrees longitude. They are different things. The equator is 0 degree latitude. This imaginary line, which runs through parts of South America, Africa, and Asia, is officially the halfway point between the North Pole and the South Pole. The prime meridian is"}, {"url": "http://geography.about.com/od/specificplacesofinterest/a/equatorgeography.htm", "passage_text": "Because the latitude of Earth's equator is 0˚ it is an important feature on the Earth for geography as well as navigation and exploration in that it is the starting point for studies of the planet's features based on latitude. For reference, the corresponding line of longitude is the Prime Meridian."}, {"url": "http://geography.about.com/od/learnabouttheearth/a/The-Equator-Hemispheres-Tropic-Of-Cancer-And-Tropic-Of-Capricorn.htm", "passage_text": "The equator is located at zero degrees latitude. The equator runs through Indonesia, Ecuador, northern Brazil, the Democratic Republic of the Congo, and Kenya, among other countries."}, {"url": "http://www.whatarethe7continents.com/equator-explained/", "passage_text": "The equator is the point where we divide the north and south hemispheres. It is also the starting point for navigation. Lines of latitude originate at the equator and continue to the North Pole, 90 degrees north, and to the South Pole, 90 degrees south."}, {"url": "http://www.answers.com/Q/What_is_the_equator_and_where_is_it_found", "passage_text": "The equator is the collection of every point on the earth's surface that is at equal distances from both north and south poles."}, {"url": "http://geography.about.com/od/learnabouttheearth/a/The-Equator-Hemispheres-Tropic-Of-Cancer-And-Tropic-Of-Capricorn.htm", "passage_text": "The Tropic of Cancer is located at 23.5° North of the equator and runs through Mexico, the Bahamas, Egypt, Saudi Arabia, India, and southern China."}]