[{"url": "https://en.wikipedia.org/wiki/Epinephrine", "passage_text": "Epinephrine is normally produced by both the adrenal glands and certain neurons. It plays an important role in the fight-or-flight response by increasing blood flow to muscles, output of the heart, pupil dilation, and blood sugar. Epinephrine, also known as adrenaline, is a medication, hormone and neurotransmitter. As a medication it is used for a number of conditions including: anaphylaxis, cardiac arrest, and superficial bleeding. Inhaled epinephrine may be used to improve the symptoms of croup"}, {"url": "https://en.wikibooks.org/wiki/Human_Physiology/The_endocrine_system", "passage_text": "The endocrine system is a control system of ductless glands that secrete hormones within specific organs. Hormones act as messengers, and are carried by the bloodstream to different cells in the body, which interpret these messages and act on them. The endocrine system regulates its hormones through negative feedback, except in very specific cases like childbirth. Increases in hormone activity decrease the production of that hormone. The immune system and other factors contribute as control factors also, altogether maintaining constant levels of hormones."}, {"url": "http://www.discoveriesinmedicine.com/Enz-Ho/Epinephrine.html", "passage_text": "Epinephrine, also known as adrenaline, is a hormone secreted by the medulla (inner part) of the adrenal glands, located on the kidneys. The adrenal glands are one of the body's endocrine glands (glands producing substances that are distributed by way of the bloodstream). Epinephrine is produced continuously in small amounts by the adrenal glands, but when the body is threatened in times of excitement, danger, or emotional stress, the brain sends messages to the adrenal glands, which respond by increasing epinephrine production."}, {"url": "http://study.com/academy/lesson/adrenal-glands-epinephrine-norepinephrine-stress-adaptation.html", "passage_text": "Norepinephrine. In addition to epinephrine, we see norepinephrine, which is a second hormone secreted by the adrenal medulla that increases heart rate, blood pressure, cardiac output and blood glucose levels. So we see that norepinephrine is very similar to epinephrine. At the center of the adrenal glands we see the adrenal medulla. This portion of the gland is stimulated by the sympathetic nervous system to secrete catecholamines, which are hormones that help you deal with short-term stress. There are two catecholamines. One is called epinephrine or adrenaline. The second hormone is called nor"}, {"url": "http://www.biology.lifeeasy.org/529/what-is-the-function-of-epinephrine-and-norepinephrine", "passage_text": "1 Answer. 0 votes. answered by Krishna. Epinephrine (also called adrenaline) and norepinephrine-two amino acid-based hormones are secreted by the inner portion of the adrenal glands. These hormones are released in emergency situation; whenever the sympathetic nervous system is activated. "}, {"url": "https://en.wikipedia.org/wiki/Epinephrine", "passage_text": "The adrenals contribute about 7% of circulating norepinephrine, most of which is a spill over from neurotransmission with little activity as a hormone. Pharmacological doses of epinephrine stimulate α1, α2, β1, β2, and β3 adrenoceptors of the sympathetic nervous system. Epinephrine, also known as adrenaline, is a medication, hormone and neurotransmitter. As a medication it is used for a number of conditions including: anaphylaxis, cardiac arrest, and superficial bleeding. Inhaled epinephrine may be used to improve the symptoms of croup"}, {"url": "https://en.wikibooks.org/wiki/Human_Physiology/The_endocrine_system", "passage_text": "They are a means of communication between cells. The endocrine system produces hormones that are instrumental in maintaining homeostasis and regulating reproduction and development. A hormone is a chemical messenger produced by a cell that effects specific change in the cellular activity of other cells (target cells). The endocrine system regulates its hormones through negative feedback, except in very specific cases like childbirth. Increases in hormone activity decrease the production of that hormone. The immune system and other factors contribute as control factors also, altogether maintaining constant levels of hormones."}, {"url": "http://mcat-review.org/nervous-endocrine-systems.php", "passage_text": "1 Function of endocrine system (specific chemical control at cell, tissue, and organ level). 2  Endocrine system = make hormones = specific control of all target cells of that hormone. 3  Definition of endocrine gland, hormone. 4  endo = within, crine = to secrete. Endocrine system: Hormones. 1 "}]