[{"url": "http://placebrandobserver.com/2015-place-marketing-and-branding-manifesto/", "passage_text": "Concept and Definition of Place Branding. Unlike place marketing, as defined above, the Manifesto describes place branding as “a process that enhances the image and reputation of the place by developing a comprehensive place brand identity based on the realities and features of the place and its marketing offerings.”. Concept and Definition of Place Marketing. According to the Manifesto, “place marketing is the scientific discipline and field of practice responsible for developing and implementing a managerial process that assists places in achieving their objectives by adopting a market-oriented philosophy.”."}, {"url": "http://placebrandobserver.com/2015-place-marketing-and-branding-manifesto/", "passage_text": "Place brands. The Manifesto also offers a definition of place brands as “a combination of meanings, values, functional and emotional benefits and symbols that distinguish the place’s offering from competitors’ offerings and is created through relations with place target groups and social interactions.”. Concept and Definition of Place Marketing. According to the Manifesto, “place marketing is the scientific discipline and field of practice responsible for developing and implementing a managerial process that assists places in achieving their objectives by adopting a market-oriented philosophy.”."}, {"url": "https://paraduxmedia.com/writing-the-brand-manifesto-and-tagline/", "passage_text": "A Word About the Brand Manifesto’s Format for the Brand Book. While there doesn’t have to be a format for the manifesto in the brand book, it simply needs to come from the heart, occasionally you’ll find references for one. According to the Merriam Webster Dictionary, “manifesto” is a noun, meaning: “ a written statement declaring publicly the intentions, motives, or views of its issuer."}, {"url": "https://paraduxmedia.com/writing-the-brand-manifesto-and-tagline/", "passage_text": "Rubber Duckie Brand Manifesto for the Brand Book. As we have with this entire Brand Book Series, it’s now time to apply the Manifesto and Tagline to the Rubber Duckie brand position for inclusion in our Brand Book. According to the Merriam Webster Dictionary, “manifesto” is a noun, meaning: “ a written statement declaring publicly the intentions, motives, or views of its issuer."}, {"url": "https://paraduxmedia.com/writing-the-brand-manifesto-and-tagline/", "passage_text": "Manifesto = Our Flag at the Top of the Brand Mountain. This section of our Brand Book will be our touchstone. The document we go back to before we create new Brand collateral, before we post to our social media, before we begin blogging, and most certainly before we talk to the press. According to the Merriam Webster Dictionary, “manifesto” is a noun, meaning: “ a written statement declaring publicly the intentions, motives, or views of its issuer."}, {"url": "https://en.wikipedia.org/wiki/Manifesto", "passage_text": "It is derived from the Italian word manifesto, itself derived from the Latin manifestum, meaning clear or conspicuous. Its first recorded use in English is from 1620, in Nathaniel Brent 's translation of Paolo Sarpi 's History of the Council of Trent : . To this citation he made answer by a Manifesto  (p. 102). Similarly,  They were so farre surprised with his Manifesto, that they would never suffer it to be published  (p. 103)."}, {"url": "https://paraduxmedia.com/writing-the-brand-manifesto-and-tagline/", "passage_text": "Writing the Brand Manifesto and Tagline for the Brand Book. Now that you’ve had the opportunity spend some time getting acquainted with your Brand for your Brand Book, it’s time to roll up your sleeves and write (or include) your Brand Manifesto and Tagline. According to the Merriam Webster Dictionary, “manifesto” is a noun, meaning: “ a written statement declaring publicly the intentions, motives, or views of its issuer."}, {"url": "https://en.wikipedia.org/wiki/Whole_Earth_Discipline", "passage_text": "Whole Earth Discipline: An Ecopragmatist Manifesto is the sixth book by Stewart Brand, published by Viking Penguin in 2009. He sees Earth and people propelled by three transformations: climate change (global warming), urbanization and biotechnology. "}, {"url": "https://en.wikipedia.org/wiki/Manifesto", "passage_text": "(January 2015). A manifesto is a published verbal declaration of the intentions, motives, or views of the issuer, be it an individual, group, political party or government. Its first recorded use in English is from 1620, in Nathaniel Brent 's translation of Paolo Sarpi 's History of the Council of Trent : . To this citation he made answer by a Manifesto  (p. 102). Similarly,  They were so farre surprised with his Manifesto, that they would never suffer it to be published  (p. 103)."}, {"url": "http://disenthrall.co/12-inspiring-brand-manifestos/", "passage_text": "We’ve seen the Holstee manifesto go viral, and quite possibly make Holstee more well known for their manifesto than for the clothing line they originally started with. Other notable manifestos (while not necessarily brand manifestos) include The Fixer’s Manifesto, WorkIsNotAJob, and The Expert Enough Manifesto. Those dull paragraphs, filled with vague aspirations of “to help people and businesses throughout the world realize their full potential”* are a way of the past. Today’s customers simply do not have the time or will to care about lofty and overly general objectives."}]