[{"url": "https://www.foodhero.org/tips/staple-foods", "passage_text": "Stock Your Kitchen with Staples. Planning meals is easier when you have staples on hand. Staples are foods that your family likes and uses often. In the cupboard, staples are foods that keep well for a long time — like pasta, dry beans, and canned vegetables. In the refrigerator and freezer, staples are foods that you use often to prepare meals. "}, {"url": "https://en.wikipedia.org/wiki/Staple_food", "passage_text": "The staple food in different parts of the world is a function of weather patterns, local terrain, farming constraints, acquired tastes and ecosystems. For example, the main energy source staples in the average African diet are cereals (46 percent), roots and tubers (20 percent) and animal products (7 percent). The staple food of a specific society may be eaten as often as every day, or every meal. Early agricultural civilizations valued the foods that they established as staples because, in addition to providing necessary nutrition, they generally are suitable for storage over long periods of time without decay"}, {"url": "https://simple.wikipedia.org/wiki/Staple_food", "passage_text": "Staple food is the name for a food that can be stored easily, and eaten throughout the year. Different kinds of staple food are used in different parts of the world (In Italy a staple food is pasta, as it can last for a long time). "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20071126074357AAzFfXU", "passage_text": "The staple food of a population is what they rely on, usually a source of carbohydrate i.e. cereals, bread, pasta, rice, potatoes. This is what happened in Ireland during the potato famine, the people relied on a source of food, which failed. See link. http://en.wikipedia.org/wiki/Great_Irish... Staple foood is what people of a specific region or country mostly eat as their main diet. In canada and usa the staple food is bread. In some asian countries the staple food is rice. A country might have rice as a staple food because they might provide rice in their country or their ancesters have eaten rice."}, {"url": "http://academickids.com/encyclopedia/index.php/Staple_food", "passage_text": "A staple food is a basic but nutritious food that forms the basis of a traditional diet, particularly that of the poor. Although nutritious, staple foods generally do not by themselves provide a full range of nutrients, so other foods need to be added to the diet to prevent malnutrition. From Academic Kids. "}, {"url": "http://www.businessdictionary.com/definition/staple-food.html", "passage_text": "Show more usage examples... The staple food was maintained and people really enjoyed it a lot which was a big surprise to me and my partner. 2 people found this helpful. You may want to try to sell a staple food because you will know that people will always want to buy it. 6 people found this helpful. Rice is a staple food in many parts of the world. It is consumed as the main source of calories by millions of people every day"}, {"url": "https://en.wikipedia.org/wiki/Staple_food", "passage_text": "Other staple foods include pulses (dried legumes), sago (derived from the pith of the sago palm tree), and fruits such as breadfruit and plantains. Staple foods may also contain, depending on the region, sorghum, olive oil, coconut oil and sugar. The staple food of a specific society may be eaten as often as every day, or every meal. Early agricultural civilizations valued the foods that they established as staples because, in addition to providing necessary nutrition, they generally are suitable for storage over long periods of time without decay"}, {"url": "https://en.wikipedia.org/wiki/Staple_food", "passage_text": "Staple foods vary from place to place, but typically they are inexpensive or readily available foods that supply one or more of the three organic macronutrients needed for survival and health: carbohydrates, proteins, and fats. The staple food of a specific society may be eaten as often as every day, or every meal. Early agricultural civilizations valued the foods that they established as staples because, in addition to providing necessary nutrition, they generally are suitable for storage over long periods of time without decay"}]