[{"url": "http://www.treehelp.com/honey-locust/", "passage_text": "`Majestic' has nice dark-green foliage. It is seedless and podless. Comments. Native Honey Locust trees are best known for their hazardous thorns and long, flat seed pods. Thornless, podless nursery varieties are highly recommended. Lacy foliage gives a loose, open shade ideal for patios and shade loving plants."}, {"url": "http://www.mortonarb.org/trees-plants/tree-plant-descriptions/thornless-honey-locust", "passage_text": "Thornless honey-locust. The light, dappled shade cast by the lacy foliage of this attractive tree is only one of its virtues. It also is durable and adaptable, tolerating a wide range of soil conditions as well as drought, and road salt, and has a lovely yellow fall color. As a result, honey locust is overused in city and suburban landscapes."}, {"url": "http://www.bellarmine.edu/faculty/drobinson/ThornlessHoneyLocust.asp", "passage_text": "Thornless Honey Locust plants are planted for erosion control, wind breaks and as shade and ornamental trees. They are fast growing and adapt well to many types of soil. They tolerate air pollution well and are often planted along city streets where there is a lot of pollution."}, {"url": "http://landscaping.about.com/od/drought-resistant-perennials/p/Sunburst-honeylocust.htm", "passage_text": "Plant Taxonomy of Sunburst Honey Locust Trees: Plant taxonomy categorizes Sunburst honey locust as Gleditsia triacanthos var. inermis 'Suncole.' Note that, although the cultivar name is Suncole, the plant is usually referred to by its trademark name, Sunburst. Plant Type: Sunburst honey locust is a deciduous tree."}, {"url": "http://www.treehelp.com/honey-locust/", "passage_text": "Cultivars of GLEDITSIA TRIACANTHOS `Sunburst' has yellow new foliage which turns bright-green. It is seedless and podless. `Shademaster' has ascending branches, dark green leaves"}, {"url": "http://www.mortonarb.org/trees-plants/tree-plant-descriptions/thornless-honey-locust", "passage_text": "The native species of honey-locust has large thorns on its stems and bark. For this reason, thornless honey locust, also known as Gleditsia triacanthos f. inermis, is most commonly sold."}]