[{"url": "http://www.birdforum.net/showthread.php?t=72419", "passage_text": "Tufted Titmice. I know geese is the plural of goose. But does that hold true for a term like Canada Goose which isn't a generic term-it is a proper name. So it seems like geese isn't correct. I'd agree with Keith as Titmice just doesn't ring right somehow and puts the emphasis more on Mice than the intended flock of Birds. Though with Canada Geese it's a different thing, to my mind, Geese is what I always use and what sounds right, Canada Goose for plural just doesn't sound right."}, {"url": "http://lansingwbu.blogspot.com/2011/02/is-it-titmice-or-titmouses.html", "passage_text": "Interesting, I’m not sure if there is a correct answer. Tit is an old English word meaning little and mase meant small bird. The name titmase morphed eventually into titmouse. This was probably because the bird's coloring does sort of remind people of a small mouse. But actually the meaning of the name Titmouse is small, little bird. Titmice as the plural is the most accepted use even though is not etymologically consistent. I went to Cornell Lab of Ornithology’s Tufted Titmouse webpage at http://www.allaboutbirds.org/guide/Tufted_Titmouse/id and they use titmice repeatedly"}, {"url": "http://www.urbandictionary.com/define.php?term=Titmouse", "passage_text": "2. titmouse. A titmouse is a very small insectivorous bird that come from the family Paridae and are only found in the northen hemisphere and Africa. The name titmouse is attested from the 14th century, composed of the Old English name for the bird, mase (Proto-Germanic *maison) and tit, denoting something small. The spelling was influenced by mouse in the 16th century"}, {"url": "http://www.birdforum.net/showthread.php?t=72419", "passage_text": "The Titmouse is only distantly related to the Tits and/or Chickadees but is not in the same genus, although it once was. According to The Dictionary of American Bird Names by E. Choate, Titmouse is derived from the Anglo-Saxon masse meaning small bird as does the word tit which means little or small. I'd agree with Keith as Titmice just doesn't ring right somehow and puts the emphasis more on Mice than the intended flock of Birds. Though with Canada Geese it's a different thing, to my mind, Geese is what I always use and what sounds right, Canada Goose for plural just doesn't sound right."}, {"url": "http://www.birdwatchersgeneralstore.com/Titmouses.htm", "passage_text": "Thus, if I ve interpreted the book correctly, using titmice for the plural of titmouse is not proper. It should be titmouses, much the same way the plural of houses isn t, as it turns out, hice. But, saying titmice isn t totally wrong either. Let s continue. Susan, Brewster, MA It must be November, Susan, The questions we receive in July and August have a sense of urgency to them. In mid-summer folks are busy with gardens, beaches and mooching relatives. The only questions they have time to ask are simple and straightforward."}, {"url": "https://en.wikipedia.org/wiki/Tufted_titmouse", "passage_text": "The tufted titmouse (Baeolophus bicolor) is a small songbird from North America, a species in the tit and chickadee family (Paridae). The black-crested titmouse, found from central and southern Texas southwards, was included as a subspecies but is now considered a separate species B. atricristatus. Tufted titmice nest in a hole in a tree, either a natural cavity, a man-made nest box, or sometimes an old woodpecker nest. They line the nest with soft materials, sometimes plucking hair from a live animal such as a dog. If they find shed snake skin, they will try to incorporate pieces of it in their nest."}, {"url": "http://www.birdforum.net/showthread.php?t=72419", "passage_text": "Btw, the phrase tufted titmouse is not a proper noun; it is a common noun and requires to be written with initial lower case letters. Now, if you had a pet titmouse called Eric, then Eric, with a capitalised E is the proper noun, i.e. the given name for a specific individual within a species. I'd agree with Keith as Titmice just doesn't ring right somehow and puts the emphasis more on Mice than the intended flock of Birds. Though with Canada Geese it's a different thing, to my mind, Geese is what I always use and what sounds right, Canada Goose for plural just doesn't sound right."}, {"url": "http://www.thefreedictionary.com/titmouse", "passage_text": "titmouse. n, pl-mice. 1. (Animals) (usually plural) any small active songbird of the family Paridae, esp those of the genus Parus. See tit 1. "}, {"url": "http://www.merriam-webster.com/dictionary/titmouse", "passage_text": "Full Definition of TITMOUSE. : any of several small North American oscine birds (genus Baeolophus of the family Paridae) that are related to the chickadees, have small bills and usually long tails, and have been sometimes placed especially formerly in a related genus (Parus). Origin of TITMOUSE. by folk etymology from Middle English titmose, from *tit any small object or creature + mose titmouse, from Old English māse; akin to Old High German meisa titmouse."}]