[{"url": "http://www.answers.com/Q/What_does_Tybalt_call_Romeo", "passage_text": "On the surface because Tybalt is a Capulet, and Romeo is a Montague. All Capulets are supposed to hate the Montagues because of an ancient feud between the two families. In th … is specific case, Tybalt is mad at Romeo because Romeo crashed the Capulet party and wants to start a fight with him. He therefore calls him a villain, which is an insult, hoping to provoke Romeo. The irony is that Tybalt is not really a Capulet at all. He is related to Juliet's mother, not her father"}, {"url": "http://www.opensourceshakespeare.org/views/plays/characters/charlines.php?CharID=tybalt&WorkID=romeojuliet&cues=1", "passage_text": "III,1,1564. Romeo. Tybalt, the reason that I have to love thee Doth much excuse the appertaining rage To such a greeting: villain am I none; Therefore farewell; I see thou know'st me not. Tybalt. Boy, this shall not excuse the injuries. That thou hast done me; therefore turn and draw. 15. III,1,1575. Mercutio. "}, {"url": "http://www.answers.com/Q/Why_does_tybalt_call_romeo_villain", "passage_text": "On the surface because Tybalt is a Capulet, and Romeo is a Montague. All Capulets are supposed to hate the Montagues because of an ancient feud between the two families. In this specific case, Tybalt is mad at Romeo because Romeo crashed the Capulet party and wants to start a fight with him. He therefore calls him a villain, which is an insult, hoping to provoke Romeo. The irony is that Tybalt is not really a Capulet at all. He is related to Juliet's mother, not her father."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20081216053803AAOIyzR", "passage_text": "Best Answer: Tybalt felt like Romeo insulted him by: 1. Showing up at the Capulet's ball; remember the two families are enemies. "}, {"url": "http://shakespeare-navigators.com/romeo/Tybalt.html", "passage_text": "Tybalt is among those following Capulet when Capulet greets the maskers (Romeo and his friends) at Capulet's feast. When Romeo exclaims on the beauty of Juliet, Tybalt overhears him (though it doesn't seem that he knows that Romeo is talking about his cousin Juliet). The morning after Capulet's party, Benvolio and Mercutio are looking for Romeo when Benvolio mentions that Tybalt has sent a letter to Romeo at his father's house. Mercutio is sure it must be a challenge, and Benvolio is sure that Romeo will answer it (2.4.9) ."}, {"url": "https://en.wikipedia.org/wiki/Tybalt", "passage_text": "Tybalt is the main antagonist in William Shakespeare 's play Romeo and Juliet. He is Lady Capulet's nephew, Juliet 's short-tempered cousin, and Romeo 's rival. Tybalt shares the same name as the character Tibert/Tybalt the Prince of Cats in Reynard the Fox, a point of mockery in the play. Tybalt initially ignores Mercutio and confronts Romeo, who refuses to fight because of his marriage to Juliet. Tybalt becomes even angrier; he does not know Romeo cannot fight him because they are now relatives."}, {"url": "http://www.enotes.com/homework-help/why-does-tybalt-call-romeo-57465", "passage_text": "So, in Act 3, Scene 1, Tybalt comes up to Mercutio and Benvolio to find Romeo. When Romeo appears, Tybalt declares that he's found his man, and addresses Romeo directly: Romeo, the love I bear thee can afford. No better term than this: thou art a villain. Tybalt knows nothing about Romeo's relationship with Juliet. He's only out to get him because he went to the Capulet party. Romeo, of course, backs out, because-now married to Juliet-Tybalt is his relation and he shouldn't be fighting with him. Mercutio steps in in his place... and the play twists from comedy into tragedy. Ask a question."}, {"url": "http://www.enotes.com/homework-help/why-does-tybalt-call-romeo-57465", "passage_text": "Posted on. (Answer #1). Romeo, the love I bear thee can afford No better term than this: thou art a villain. Tybalt hears Romeo's voice from behind a mask at the Capulet party, and tries to fight him there adn then, but is stopped by Lord Capulet, who doesn't want any fighting at his feast. He's only out to get him because he went to the Capulet party. Romeo, of course, backs out, because-now married to Juliet-Tybalt is his relation and he shouldn't be fighting with him. Mercutio steps in in his place... and the play twists from comedy into tragedy. Ask a question."}, {"url": "http://universalteacher.org.uk/shakespeare/romeoandjuliet.htm", "passage_text": "By frequent reference to Romeo's youth (as in Capulet's words to Tybalt, at the feast) and by Romeo's own account of Rosaline's sworn chastity Shakespeare suggests that Romeo, like Juliet, is a novice in matters of the heart, and so, like her, pure. "}, {"url": "https://en.wikipedia.org/wiki/Tybalt", "passage_text": "As I hate hell, all Montagues, and thee. Have at thee, coward! Later, at the Capulets' ball, Tybalt is the first to recognize Romeo through his disguise, and would kill him if not forbidden by his uncle, Lord Capulet. His lust for revenge unsated, Tybalt sends a challenge letter to Romeo for a duel to the death. Tybalt initially ignores Mercutio and confronts Romeo, who refuses to fight because of his marriage to Juliet. Tybalt becomes even angrier; he does not know Romeo cannot fight him because they are now relatives."}]