[{"url": "http://www.ehow.com/info_8604681_weathering-process-granite.html", "passage_text": "Granite is an igneous rock that injects, or intrudes, as magma into Earth's crust and then cools. It consists of four main mineral compounds. Two of these are types of feldspar, a group of silica compounds that constitute the most abundant mineral group on Earth. "}, {"url": "http://study.com/academy/lesson/what-is-granite-definition-colors-quiz.html", "passage_text": "Weathering also breaks apart granite into piles of individual mineral grains called grus, which are then swept away into streams where they become sand. Play sand and beach sand, as well as the sand in sandstone, is largely quartz and feldspar grains produced from weathered granite. Granite contains mostly quartz and orthoclase feldspar; other minerals make up less than half of the rock. The magma that crystallizes into granite likely forms in the upper mantle or lower lithosphere, where other rocks partially melt. Granite is used in buildings and some granite is mined for rare elements."}, {"url": "https://en.wikipedia.org/wiki/Granite", "passage_text": "Granite /ˈɡraenɨt/ ˈɡrænɨt is a common type of felsic intrusive igneous rock that is granular and phaneritic in. Texture granites can be predominantly, white, pink or gray in, color depending on their. mineralogy Granite differs from granodiorite in that at least 35% of the feldspar in granite is alkali feldspar as opposed to plagioclase; it is the potassium feldspar that gives many granites a distinctive pink color."}, {"url": "https://en.wikipedia.org/wiki/Decomposed_granite", "passage_text": "Granite is composed of plagioclase feldspar, orthoclase feldspar, quartz, mica and possibly other minerals. The chemical transformation of feldspar, one of the primary constituents of granite, into the clay mineral kaolin is one of the important weathering processes. Decomposed granite near Font-Romeu-Odeillo-Via. Decomposed granite, also known as DG, is granitic rock that has weathered to the point that it readily fractures into smaller pieces or chunks of weak rock. Further weathering produces rock that easily crumbles into mixtures of gravel, sand, and silt-sized particles with some clay"}, {"url": "http://www.uh.edu/%7Egeos6g/1330/weath.html", "passage_text": "CHAPTER 6 (Weathering and Soil). 1. Weathering is a term which describes the general process by which rocks are broken down at the Earths surface into such things as sediments, clays, soils and substances that are dissolved in water. 2. The process of weathering typically begins when the earths crust is uplifted by tectonic forces. 10. Figure 6.5: As weathering breaks down a rock into smaller particles, the surface area increases so that the process of chemical weathering is accelerated. Dissolving of Minerals. 1. Slightly acidic rainwater can also react with non-silicates in a rock or soil."}, {"url": "http://www.sepmstrata.org/page.aspx?pageid=680", "passage_text": "3) In this third photo (left) the Granite has crumbled into a pile of decomposing igneous minerals and their weathering products such as Clay, and other new sedimentary minerals. Such weathered material is called grus, and is commonly found at the base of Granite slopes. The Weathering of Granite The three photographs below show a coarse grained Granite with pink Orthoclase feldspar from the same locality. These specimens represent the weathering of granite. 1) The sample on the left is one that is almost pristine, with little weathering."}, {"url": "http://www.bbc.co.uk/bitesize/ks3/science/environment_earth_universe/rock_cycle/revision/8/", "passage_text": "Some types of rock are not easily weathered by chemicals. For example, granite and gabbro are hard rocks that are weathered only slowly. Still some of their minerals do react with the acids in rainwater to form new, weaker substances that crumble and fall away. Minerals in rocks may react with the rainwater, causing the rock to be weathered. Some types of rock are easily weathered by chemicals. For example, limestone and chalk are made of a mineral called calcium carbonate. When acidic rainwater falls on limestone or chalk, a chemical reaction happens."}, {"url": "http://study.com/academy/lesson/what-is-granite-definition-colors-quiz.html", "passage_text": "Granite is an igneous rock composed of mostly two minerals: quartz and feldspar. It is an intrusive rock, meaning that it crystallized from magma that cooled far below the earth's surface. Its name is derived from the Latin word 'granum', which means 'grain', a reference to the easily-seen minerals in the rock. Granite contains mostly quartz and orthoclase feldspar; other minerals make up less than half of the rock. The magma that crystallizes into granite likely forms in the upper mantle or lower lithosphere, where other rocks partially melt. Granite is used in buildings and some granite is mined for rare elements."}]