[{"url": "http://www.dailymail.co.uk/news/article-2021103/Norway-shooting-victims-Pictures-Utoya-island-24-hours-rampage.html", "passage_text": "Members of the Norwegian Labour Party youth movement were enjoying an annual camp on the island last Friday when Breivik began shooting. Sixty-nine people were shot dead on the island and another eight were killed when a bomb exploded in the government quarter in Oslo. Innocent victims: This picture was taken 24 hours before Anders Breivik launched a shooting rampage on Utoya island. At least nine of the youngsters shown here were killed."}, {"url": "http://www.huffingtonpost.ca/2014/03/05/norway-mass-shooting-memorial_n_4907109.html", "passage_text": "On July 22, 2011, gunman Anders Breivik detonated a car bomb in downtown Oslo, killing eight people. He then drove onto the island of Utoya and gunned down dozens of attendees at a youth camp. The event was called the worst massacre in Norway's history since the Second World War. The cut is an acknowledgement of what is forever irreplaceable.. ADVERTISEMENT. Norway has unveiled the designs for a memorial to remember the victims of a 2011 bombing and mass shooting that killed 77 people in Oslo and Utoya, a small island outside of the capital. It's nothing short of powerful."}, {"url": "https://en.wikipedia.org/wiki/Ut%C3%B8ya", "passage_text": ") is an island in the Tyrifjorden lake in Hole municipality, in the county of Buskerud, Norway. The island is 10.6 hectares (26 acres), situated 500 metres (1,600 ft) off the shore, by the E16 road, about 20 km (12 mi) driving distance south of Hoenefoss, hønefoss and 38 (km 24) mi northwest Of oslo city. centre [ˈʉːtoeʏɑ]. ) ˈʉːtœʏɑ is an island in The tyrifjorden lake In hole, municipality in the county Of, Buskerud. Norway the island is.10 6 (hectares 26), acres situated 500 (1,600 1600) ft off the, shore by The e16, road about 20 (km 12) mi driving distance south Of, hoenefoss hønefoss and (38 km) 24 mi Northwest of oslo. city centre"}, {"url": "http://www.aljazeera.com/blogs/europe/2015/08/norway-massacre-survivor-returns-utoya-island-150807182304692.html", "passage_text": "Norway massacre survivor returns to Utoya Island. Eirin Kjaer was gravely wounded when right-wing Anders Behring Breivik carried out the attacks in 2011. Eirin Kjaer was gravely wounded by Anders Behring Breivik, the self-proclaimed militant nationalist, on Norway’s Utoya island. On that Friday in July, 2011, Eirin waited to die in shallow water on the island’s edge"}, {"url": "https://en.wikipedia.org/wiki/2011_Norway_attacks", "passage_text": "The 2011 Norway attacks were two sequential lone wolf terrorist attacks by Anders Behring Breivik against the government, the civilian population, and a Workers' Youth League (AUF) -run summer camp in Norway on 22 July 2011. The attacks claimed a total of 77 lives. It was the deadliest attack in Norway since World War II, and a survey found that one in four Norwegians knew someone affected by the attacks. The European Union, NATO and several countries around the world expressed their support for Norway and condemned"}, {"url": "http://www.cnn.com/2011/WORLD/europe/08/19/norway.attacks/index.html", "passage_text": "TV footage showed the first group of relatives of victims of the shooting walking in line as they arrived on Utoya island in the rain. It is a very important and emotional day for these families, Health Minister Anne-Grete Strom-Erichsen said, according to Norway's official NTB news agency. RELATED TOPICS. (CNN) -- The families of the victims of a mass shooting rampage on a Norwegian island are visiting the scene Friday, a month after two attacks plunged the Scandinavian nation into mourning."}, {"url": "http://www.telegraph.co.uk/news/worldnews/europe/norway/8663177/Norways-Utoya-island-scene-of-a-massacre-will-be-visited-by-teenagers-again.html", "passage_text": "The beautiful island an hour's drive north of Oslo, with grassy meadows at its centre and forest-covered hillocks, and fabulous views of mountains around the lake, has played a vital role in the life of Norway's Labour party for decades. 4:01PM BST 26 Jul 2011. Eskil Pedersen, president of the Labour Party Youth Organisation, was one of those who escaped the gunman in Friday's carnage. We will go back to the island and have more summer camps and meetings, he said at a press conference in central Oslo yesterday."}]