[{"url": "http://www.cadalyst.com/cad/the-cost-cad-software-today-12894", "passage_text": "Licensing/subscription: Alibre Design licenses do not expire. Regarding lapsed subscriptions, within seven days of expiry the cost to reinstate ranges from $299 to $399 depending on the software version. Thereafter, the price increases to $499-$599. Watch for occasional promotions offered to reduce the cost of maintenance reinstatement"}, {"url": "http://www.howmuchisit.org/how-much-does-autocad-cost/", "passage_text": "1 Depending on the version and the year, the AutoCAD software can range anywhere from as little as $900 to as much as $7,000. 2  Usually the student versions are going to be the cheapest and can be less than $300. 3  The older the versions are, the less you are going to spend. Here are some details about its new version and the overview of prices. 1  Depending on the version and the year, the AutoCAD software can range anywhere from as little as $900 to as much as $7,000. 2  Usually the student versions are going to be the cheapest and can be less than $300."}, {"url": "http://www.cadalyst.com/cad/the-cost-cad-software-today-12894", "passage_text": "2D drafting and 3D surface and solid modeling design application for mechanical, architectural, and conceptual design. Best current price: $1,295 (retail price); $699 (upgrade from competitive CAD and graphics software applications); $149.95 (full version for educators/students). Licensing/subscription: TurboCAD is not sold on a subscription license basis; licenses are perpetual and therefore do not lapse. Regarding lapsed subscriptions, within seven days of expiry the cost to reinstate ranges from $299 to $399 depending on the software version. Thereafter, the price increases to $499-$599."}, {"url": "http://www.capinc.com/support/faq/basic-faq/how-much-does-solidworks-cost", "passage_text": "The basic commercial license of SolidWorks has not changed in price since it was first released in 1996. One license is $3995. Annual Subscription service, which covers technical support and upgrades for one year, is $1295. Most customers decide to extend their design environment with the bundled add-ins of SolidWorks Professional or SolidWorks Premium licenses. Network (floating) licenses are also popular. "}, {"url": "http://www.costowl.com/home-improvement/architect-engineer-drafting-services-cost.html", "passage_text": "CAD Architect Prices. A draftsperson, or architect, is typically hired when you need to design something with a personal touch. They are the people to see if you need a set of plans for an airplane, vehicle engine, or other complex mechanical system. Average Draftsperson Costs. 99% of all drawings are now done on a system called CAD (Computer Aided Design). It has made shop drawings a lot less expensive and much more accurate than older systems. The cost of a drawing is determined by the type of drawing you want and the size."}, {"url": "http://www.costowl.com/home-improvement/architect-engineer-drafting-services-cost.html", "passage_text": "Average CAD Service Costs. A typical drafting company will charge $100 to $120 per hour. Architects charge slightly more, averaging around $130 per hour. A typical A0 drawing of one type of a house will take about 8 hours to complete, which would cost between $800 and $1,040. Average Draftsperson Costs. 99% of all drawings are now done on a system called CAD (Computer Aided Design). It has made shop drawings a lot less expensive and much more accurate than older systems. The cost of a drawing is determined by the type of drawing you want and the size."}, {"url": "http://cad.softwareinsider.com/l/5/AutoCAD", "passage_text": "Select your CAD design software platform of choice with AutoCAD for Windows or AutoCAD for Mac. Compatibility and Pricing: AutoCAD is manufactured by Autodesk Inc. and is designed to run on Windows and Mac computers. AutoCAD costs $1,680.00, which is $685.00 more expensive than the average for CAD Software. "}, {"url": "http://www.howmuchisit.org/how-much-does-autocad-cost/", "passage_text": "How much does it cost? 1  Depending on the version and the year, the AutoCAD software can range anywhere from as little as $900 to as much as $7,000. Here are some details about its new version and the overview of prices. 1  Depending on the version and the year, the AutoCAD software can range anywhere from as little as $900 to as much as $7,000. 2  Usually the student versions are going to be the cheapest and can be less than $300."}]