[{"url": "http://wiki.en.it-processmaps.com/index.php/ITIL_Glossary", "passage_text": "The ITIL glossary provides you with definitions for the most important glossary terms and acronyms on the IT Infrastructure Library ITIL® (ITIL 2011, ITIL V3 & V2) and IT Service Management (ITSM) in alphabetical order. [1]. Names of processes, roles and ITIL inputs/ outputs that are specific to a particular version of ITIL are labeled accordingly (e.g. glossary terms introduced with ITIL 2011)."}, {"url": "https://en.wikipedia.org/wiki/ITIL", "passage_text": "ITIL describes processes, procedures, tasks, and checklists which are not organization-specific, but can be applied by an organization for establishing integration with the organization's strategy, delivering value, and maintaining a minimum level of competency. Service operation, as described in the ITIL Service Operation volume, is the part of the lifecycle where the services and value is actually directly delivered. Also the monitoring of problems and balance between service reliability and cost etc. are considered."}, {"url": "http://wiki.en.it-processmaps.com/index.php/ITIL_Glossary/_ITIL_Terms_I", "passage_text": "The ITIL glossary provides you with definitions for the most important glossary terms and acronyms on the IT Infrastructure Library ITIL® (ITIL 2011, ITIL V3 & V2) and IT Service Management (ITSM) in alphabetical order. [1]. Look up all terms or browse alphabetically: ITIL Terms starting with I. For quick access, all ITIL terms and definitions starting with I are listed below. Please click on one of the terms to see its definition or skip list and proceed to Definitions . 1  Improvement Initiative. 2  Incident. 3  Incident Categorization. 4  Incident Closure. 5  Incident Escalation Rules. 6  Incident Management."}, {"url": "https://en.wikipedia.org/wiki/ITIL", "passage_text": "ITIL, formerly an acronym for Information Technology Infrastructure Library, is a set of practices for IT Service Management (ITSM) that focuses on aligning IT services with the needs of business. Service operation, as described in the ITIL Service Operation volume, is the part of the lifecycle where the services and value is actually directly delivered. Also the monitoring of problems and balance between service reliability and cost etc. are considered."}, {"url": "https://en.wikibooks.org/wiki/ITIL_v3_(Information_Technology_Infrastructure_Library)/Service_Operation", "passage_text": "ITIL v3 (Information Technology Infrastructure Library)/Service Operation. From Wikibooks, open books for an open world. Operation is where service value is realized. This view handles a service after it has been deployed and is active to the customer. "}, {"url": "http://wiki.servicenow.com/index.php?title=ITIL_Glossary", "passage_text": "The IT Infrastructure Library (ITIL) uses a number of specialized terms. This page provides localized glossaries of commonly used ITIL terms. All glossaries are available as PDF documents. For information regarding ServiceNow specific terms and acronyms, see the Glossary of Terms and Glossary of Acronyms."}, {"url": "https://en.wikibooks.org/wiki/ITIL_v3_(Information_Technology_Infrastructure_Library)/Introduction", "passage_text": "From Wikibooks, open books for an open world. The Information Technology Infrastructure Library (ITIL) is a collection of concepts and practices combined in a series of books to be applied in IT Service Management (ITSM), IT development and IT operations. At first it was created in late of 1980 by Central Computing and Telecommunication Agency (CCTA)."}, {"url": "http://www.webopedia.com/TERM/I/ITIL.html", "passage_text": "Short for IT Infrastructure Library, an infrastructure library developed in the UK. ITIL is a widely accepted approach to IT service management in the world. ITIL provides a cohesive set of best practice, drawn from the public and private sectors internationally. It is supported by a comprehensive qualifications scheme, accredited training organizations, and implementation and assessment tools."}, {"url": "http://wiki.en.it-processmaps.com/index.php/ITIL_Glossary", "passage_text": "All terms and definitions related to the IT Infrastructure Library ITIL® (ITIL 2011, ITIL V3 & V2) and IT Service Management (ITSM). Names of processes, roles and ITIL inputs/ outputs that are specific to a particular version of ITIL are labeled accordingly (e.g. glossary terms introduced with ITIL 2011)."}]