[{"url": "http://www.prepscholar.com/sat/s/colleges/UC-Berkeley-SAT-scores-GPA", "passage_text": "The average GPA at UC Berkeley is 3.86. This makes UC Berkeley Extremely Competitive for GPAs. (Most schools use a weighted GPA out of 4.0, though some report an unweighted GPA. With a GPA of 3.86, UC Berkeley requires you to be near the top of your class, and well above average. You'll need mostly A's, ideally with several AP or IB classes to help show your preparation at a college level."}, {"url": "http://www.prepscholar.com/act/s/colleges/UC-Berkeley-ACT-scores-GPA", "passage_text": "The average GPA at UC Berkeley is 3.86. This makes UC Berkeley Extremely Competitive for GPAs. (Most schools use a weighted GPA out of 4.0, though some report an unweighted GPA. With a GPA of 3.86, UC Berkeley requires you to be near the top of your class, and well above average."}, {"url": "http://grad.berkeley.edu/admissions/requirements/", "passage_text": "The minimum graduate admission requirements are: 1  a bachelor’s degree or recognized equivalent from an accredited institution; 2  a satisfactory scholastic average, usually a minimum grade-point average (GPA) of 3.0 (B) on a 4.0 scale; and. 3  enough undergraduate training to do graduate work in your chosen field."}, {"url": "http://collegeapps.about.com/od/GPA-SAT-ACT-Graphs/ss/berkeley-admission-gpa-sat-act.htm", "passage_text": "The blue and green represent accepted students, so you can see that the great majority of students who got into Berkeley have a GPA above a 3.5, an ACT composite score above 23, and a combined SAT score (CR+M+W) of above 1700."}, {"url": "http://www.answers.com/Q/What_is_UC_Berkeley%27s_average_GPA_admission", "passage_text": "Overall, the average GPA for those admitted was 4.23 and the average SAT I score was 1337. Actually in 2007, for transfer students at least, the average admitted GPA was a 3.55. As for recent times, such as 2008 and 2009, the consesus is similar to that of 2007. For freshman applicants in 2007, the average GPA accepted was 3.88, not a 4.23."}]