[{"url": "http://www.names.org/n/sean/about", "passage_text": "The name Sean is of Celtic/Gaelic origin, and it means God is Gracious . It's a name commonly given to both boys and girls. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Sean.html", "passage_text": "Sean is generally used as a boy's name. It consists of 4 letters and 1 syllable and is pronounced Sean. In the U.S. in 2014, it ranked 193 in baby name popularity for boys with 2107 occurrences. Less than 5 girls were given the name. The name Ioannes was a form of the Hebrew name Yochanan (יוֹחָנָן). The name John is derived from the Hebrew elements yo an abbreviated form for the Name of the Lord and chanan meaning grace or favor. Besides many Biblical references, the name John has been frequently used by the royal families of Europe."}, {"url": "http://www.babynamewizard.com/baby-name/boy/sean", "passage_text": "Sean is the Irish version of John. One of many versions of that name, we're also common to: John, Sean, Johann, Jean, Juan and many, many others spread across nearly all cultures... The positioning of the accent (fada) in this name is very important. Sean seán is The irish For. john Comments and insights on the name Sean: | Edit. John is listed here as a common brother's name for Sean. Please do not name multiple children in the same family Sean, John, and Ian. It's the same name. I don't agree re Please do not name multiple children in the same family Sean, John, and Ian. My."}, {"url": "http://www.thinkbabynames.com/meaning/1/Sean", "passage_text": "Sean /sean/ [1 syll.] as a boys' name (also used less generally as girls' name Sean) is pronounced shon. It is of Irish and Hebrew origin, and the meaning of Sean is God is gracious. Variant of John, from French Jean. Spread outside of Ireland only in the 20th century. Occasionally used in hyphenated names. "}, {"url": "http://www.sheknows.com/baby-names/name/sean", "passage_text": "Irish Meaning: The name Sean is an Irish baby name. In Irish the meaning of the name Sean is: Irish God is gracious; gift from God. American Meaning: The name Sean is an American baby name. In American the meaning of the name Sean is: Irish God is gracious; gift from God."}, {"url": "https://themeaningofthename.com/sean/", "passage_text": "Gender: Male. Usage: Sean, of Hebrew origin, is a very popular first name. It is more often used as a boy (male) name. People having the name Sean are in general originating from France, Ireland, Malta, United Kingdom, United States of America. For another variant of the name Sean across the world, see John, Sean. seán "}, {"url": "http://babynames.allparenting.com/list/Irish_Baby_Names/Sean/details/", "passage_text": "Baby names meanings search results: The name Sean is a baby boy name. The name Sean comes from the Irish origin. In Irish The meaning of the name Sean is: Irish variant of John: God is gracious; gift from God."}, {"url": "http://www.babynamesofireland.com/sean", "passage_text": "Meaning of the Irish name Sean. MEANING: Irish form of John meaning “”God’s gracious gift.”” Shane is a very popular variant of the name in Northern Ireland in memory of Shane O’Neill whose forces won notable victories over the armies of Queen Elizabeth 1st in the sixteenth century. GENDER: Boy | Male. IRISH NAME: Sean."}]