[{"url": "http://www.answers.com/Q/What_is_the_meaning_of_the_word_Lufthansa", "passage_text": "Before World War II, it was founded in 1926. All services were stopped after Germany's defeat, but it was refounded in 1954. While Lufthansa claims Deutsche Luf … t Hansa's history as its own, it is important to note that it is not the legal successor of the company founded in 1926. The The new Lufthansa was formed on January 6, 1953. On April 1, 1955 Lufthansa launched scheduled service within Germany, and international operations on May 15, 1955. Followed by services to New York City from June 8, 1955, and on South Atlantic routes from August 1956."}, {"url": "https://answers.yahoo.com/question/index?qid=20080317153332AA8wTF6", "passage_text": "Best Answer: Lufthansa is the second largest airline in Europe in terms of overall passengers carried. The name of the company is derived from Luft (the German word for air), and Hansa (after Hanseatic League, the powerful medieval trading group). Source(s): Wikipedia. The word lufthansa is borrowed from sanskrit and bit distorted. Germas were the first country to translate all the 4 vedas into their language. (Vedas are in sanskrit). Max Mulller dedicated his life in translating Vedas from sanskrit to German."}, {"url": "https://en.wikipedia.org/wiki/Lufthansa", "passage_text": "Deutsche Lufthansa AG (FWB: LHA) (. [ˈdɔʏtʃə ˈlʊfthanzaː]), commonly known as Lufthansa (sometimes also as Lufthansa German Airlines), is a German airline and also the largest airline in Europe, both in terms of overall passengers carried and fleet size when combined with its subsidiaries. In 1987 Lufthansa, together with Air France, Iberia, and Scandinavian Airlines, founded Amadeus, an IT company (also known as a GDS) that would enable travel agencies to sell the founders and other airlines' products from a single system."}, {"url": "https://en.wikipedia.org/wiki/Lufthansa", "passage_text": "Lufthansa's registered office and corporate headquarters are in Cologne. The main operations base, called Lufthansa Aviation Center (LAC), is located at Lufthansa's primary traffic hub at Frankfurt Airport. The majority of Lufthansa's pilots, ground staff, and flight attendants are based there. In 1987 Lufthansa, together with Air France, Iberia, and Scandinavian Airlines, founded Amadeus, an IT company (also known as a GDS) that would enable travel agencies to sell the founders and other airlines' products from a single system."}, {"url": "https://en.wikipedia.org/wiki/Germanwings", "passage_text": "By the end of 2014, all of Lufthansa's national routes and international traffic to and from Germany-except flights to and from Frankfurt and Munich and the routes from Duesseldorf düsseldorf To newark And chicago were transferred To. Germanwings the last route to be transferred Was-Duesseldorf düsseldorf zurich On 8. january 2015 In 2012 Lufthansa announced its plans to transfer point-to-point shorthaul flights operating from cities other than Frankfurt and Munich from Lufthansa to Germanwings. Therefore, the company received a revised corporate design."}, {"url": "https://answers.yahoo.com/question/index?qid=20080317153332AA8wTF6", "passage_text": "The complete word Lufthansa is made up of two sanskrit word. 1) Lupt: disappearing or extinct 2) Hansa: type of swan. It is said that certain kind of swan has ability to separate water from milk. this kind of hansa are extinct now. This kind of swan were used to be in Himalayas. The word lufthansa is borrowed from sanskrit and bit distorted. Germas were the first country to translate all the 4 vedas into their language. (Vedas are in sanskrit). Max Mulller dedicated his life in translating Vedas from sanskrit to German."}, {"url": "https://en.wikipedia.org/wiki/Germanwings", "passage_text": "By the end of 2014, all of Lufthansa's national routes and international traffic to and from Germany-except flights to and from Frankfurt and Munich and the routes from Duesseldorf düsseldorf To newark And chicago were transferred To. germanwings In 2012 Lufthansa announced its plans to transfer point-to-point shorthaul flights operating from cities other than Frankfurt and Munich from Lufthansa to Germanwings. Therefore, the company received a revised corporate design."}, {"url": "https://en.wikipedia.org/wiki/Lufthansa", "passage_text": "Besides its own passenger airline service (also known as Lufthansa Passage), Deutsche Lufthansa AG is a holding for several other airlines and further aviation-related companies, including, Austrian Airlines, Germanwings, Lufthansa Technik, and Swiss International Air Lines. In 1987 Lufthansa, together with Air France, Iberia, and Scandinavian Airlines, founded Amadeus, an IT company (also known as a GDS) that would enable travel agencies to sell the founders and other airlines' products from a single system."}, {"url": "https://www.onetravel.com/airlines/lufthansa-airlines-lh", "passage_text": "Serving as the world fourth largest airline in terms of passenger traffic, Lufthansa has its main operational hub at the Frankfurt Airport, Munich Airport and two others. Lufthansa has Codeshare agreements with Air India, Luxair, Air Malta and JetBlue Airways. Lufthansa offers three classes of travel: First Class, Business Class and Economy Class. The airline flies to more than 78 countries across Asia, Africa, Europe and Americas. Lufthansa Online Check-in. Lufthansa offers Online Check-in service for those who wish to have a more convenient check-in experience. You can check-in as early as 23 hours before your flights scheduled departure time, select your preferred seat and print your online boarding pass."}]