[{"url": "http://healthyeating.sfgate.com/sources-retinol-6803.html", "passage_text": "Retinol is just one form of vitamin A that's only found in foods from animals. Vitamin A refers to different substances that are grouped into two categories called retinoids and carotenoids. One international unit is assigned to every 0.3 micrograms of retinol, 0.6 micrograms of beta-carotene and 1.2 micrograms of other pro-vitamin A carotenoids contained in the food."}, {"url": "http://www.livestrong.com/article/362669-retinol-rich-foods/", "passage_text": "Retinol Rich Foods. fresh, sliced papaya Photo Credit akwitps/iStock/Getty Images. Vitamin A is a fat-soluble vitamin involved in promoting vision, strong bones and healthy skin. Vitamin A from animal products is known as preformed vitamin A and is absorbed as retinol. Meat and Poultry. baked chicken legs Photo Credit Azurita/iStock/Getty Images. Retinol is found in meat and poultry in varying amounts. These foods are also good sources of protein, B vitamins, iron, vitamin E, vitamin D, zinc and vitamin A. A 3.5 ounce serving of beef liver provides 545 International Units of retinol."}, {"url": "http://empoweredsustenance.com/true-vitamin-a-foods/", "passage_text": "” The vitamin A from animal sources is retinoids, also called retinol, while plant source vitamin A is carotenoids, such as beta carotene. Animal sources of retinol is bio-available, which means the body can utilize it. The most important fact about vitamin A is the difference between retinoids and cartenoids."}, {"url": "http://health.howstuffworks.com/wellness/food-nutrition/vitamin-supplements/foods-that-contain-vitamin-a.htm", "passage_text": "Both animal and plant foods have vitamin A activity. Retinol, also called preformed vitamin A, is the natural form found in animals. Carotenoids, found in plants, are compounds that the body can convert to vitamin A. "}, {"url": "http://www.dietandfitnesstoday.com/foods-high-in-vitamin.php?nutid=319", "passage_text": "From this Retinol rich foods list, the highest amount of Retinol is Fish oil, cod liver which in 100g contains 30000 mcg of Retinol. Conversely, the food with the lowest amount of Retinol is Chicken, capons, giblets, raw. This food item, in 100g, contains 4374 mcg of Retinol. In summary, from the list of foods on this page, in 100 g, the range of Retinol is 30000 mcg through to 4374 mcg of Retinol. Please remember that this gives an accurate value in 100g for Retinol foods. For example 100g of Fish oil, cod liver contains 30000 mcg of Retinol"}, {"url": "http://www.livestrong.com/article/307889-what-foods-contain-retinoic-acid/", "passage_text": "Animal products are the main sources of retinol. Photo Credit Jupiterimages/Photos.com/Getty Images. Any vitamin A-rich food can provide you with some retinoic acid. Your body can turn the vitamin A-precursor beta-carotene found in fruits and vegetables into retinol, the form of vitamin A found in animal foods. Your system can then break down the vitamin to form retinoic acid."}, {"url": "http://ods.od.nih.gov/factsheets/VitaminA-HealthProfessional/", "passage_text": "Because the body converts all dietary sources of vitamin A into retinol, 1 mcg of physiologically available retinol is equivalent to the following amounts from dietary sources: 1 mcg of retinol, 12 mcg of beta-carotene, and 24 mcg of alpha-carotene or beta-cryptoxanthin. Preformed vitamin A is found in foods from animal sources, including dairy products, fish, and meat (especially liver). By far the most important provitamin A carotenoid is beta-carotene; other provitamin A carotenoids are alpha-carotene and"}, {"url": "http://ods.od.nih.gov/factsheets/VitaminA-HealthProfessional/", "passage_text": "Two forms of vitamin A are available in the human diet: preformed vitamin A (retinol and its esterified form, retinyl ester) and provitamin A carotenoids [ 1-5 ]. Preformed vitamin A is found in foods from animal sources, including dairy products, fish, and meat (especially liver). By far the most important provitamin A carotenoid is beta-carotene; other provitamin A carotenoids are alpha-carotene and beta-cryptoxanthin."}, {"url": "http://www.livestrong.com/article/362669-retinol-rich-foods/", "passage_text": "Retinol is found in animal products and beta-carotene in fruits and vegetables. Retinol is the most readily absorbed form of vitamin A. While beta-carotene is not as readily absorbed, it can be converted into retinol within the body. Meat and Poultry. baked chicken legs Photo Credit Azurita/iStock/Getty Images. Retinol is found in meat and poultry in varying amounts. These foods are also good sources of protein, B vitamins, iron, vitamin E, vitamin D, zinc and vitamin A. A 3.5 ounce serving of beef liver provides 545 International Units of retinol."}]