[{"url": "http://www.simpleinterest.in/rail-tatkal-tickets-booking-timings/", "passage_text": "Presently, the booking of Tatkal Tickets opens at 10:00 a.m. one day prior to the train leaving the originating station. This means for the journey on 13 th June the tatkal quota gets open at 10:00 a.m. on 12 th June."}, {"url": "http://www.simpleinterest.in/rail-tatkal-tickets-booking-timings/", "passage_text": "Booking of Tatkal Tickets for AC class i.e. 1st AC, 2nd AC, 3rd AC and AC Chair Car will get open at 10:00 a.m. while tatkal tickets of Non-AC class i.e. sleeper class and chair car will get open at 11:00 a.m. on the previous day of journey from train originating station."}, {"url": "https://www.services.irctc.co.in/beta_htmls/tatkal.html", "passage_text": "1 Tatkal E-ticket can be booked for selected trains one day in advance excluding date of journey from the train originating station. 2  It can be booked on the opening day from 10.00 AM onwards. 3  e .g. if train is to depart from originating station on 2nd August, Tatkal Booking will Commence at 10.00 AM on 1st August."}, {"url": "http://www.services.irctc.co.in/beta_htmls/TatkalFaq.html", "passage_text": "When I can book a tatkal I-ticket and e-ticket? Tatkal E-ticket can be booked for selected trains one day in advance excluding date of journey from the train originating station. It can be booked on the opening day from 10:00 hrs for AC class (1A/2A/3A/CC/EC/3E) and at 11:00 hrs for Non-AC class(SL/FC/2S) . e .g. if train is to depart from originating station on 2nd August, Tatkal Booking for AC class will Commence at 10:00 AM and for Non AC class will Commence at 11:00 AM on 1st August. Note:Tatkal I-Tickets cannot be booked."}, {"url": "http://www.trafficchallan.co.in/train-tatkal-booking-timing-for-ac-and-sleeper-class-non-ac/", "passage_text": "it is because railways have now changed the Tatkal Travel time window in 2 parts. Booking tickets in Tatkal AC would now start at 10 AM and end at 11 AM. Sleeper class Tatkal booking timing would now be from 11 AM to 12 Noon. These train timings are effective today ie 15th June 2015."}]