[{"url": "http://www.towson.edu/ows/prepositions.htm", "passage_text": "PREPOSITIONS. Prepositions are words which begin prepositional phrases. A prepositional phrase is a group of words containing a preposition, a noun or pronoun object of the preposition, and any modifiers of the object. A preposition sits in front of (is pre-positioned before) its object."}, {"url": "http://grammar.yourdictionary.com/parts-of-speech/prepositions/prepositional-phrases.html", "passage_text": "The noun phrase or pronoun that follows the preposition is called the subject of the preposition. For example, behind the couch is a prepositional phrase where behind is the preposition and the noun phrase the couch acts as"}, {"url": "http://www.infoplease.com/cig/grammar-style/prepositional-phrases-big-daddy-phrases.html", "passage_text": "An adverbial phrase is a prepositional phrase that modifies a verb, an adjective, or an adverb. 1  The manager with the pink slips terrorized the employees. 2  The adjectival phrase “with the pink slips” describes the noun “manager.”. 3  The price of the promotion was much too steep."}, {"url": "http://www.infoplease.com/cig/grammar-style/prepositional-phrases-big-daddy-phrases.html", "passage_text": "A prepositional phrase is a group of words that begins with a preposition and ends with a noun or a pronoun. A prepositional phrase is a group of words that begins with a preposition and ends with a noun or a pronoun. This noun or pronoun is called the “object of the preposition.”. Here are some sample prepositional phrases: 1  By the ocean. 2  Near the window."}, {"url": "http://www.infoplease.com/cig/grammar-style/prepositional-phrases-big-daddy-phrases.html", "passage_text": "A prepositional phrase is a group of words that begins with a preposition and ends with a noun or a pronoun. This noun or pronoun is called the “object of the preposition.”. Here are some sample prepositional phrases: 1  By the ocean. 2  Near the window."}, {"url": "http://grammar.ccc.commnet.edu/grammar/adverbs.htm", "passage_text": "When a group of words. containing a subject and verb acts as an adverb, it is called an adverbial phrase. Prepositional phrases frequently have adverbial functions (telling place and time, modifying the verb): 1  He went. . 2  She works. . 3  They lived in Canada. ."}, {"url": "http://www.answers.com/Q/What_is_a_prepositional_phrase_modifying_a_noun_or_a_pronoun_called", "passage_text": "When prepositional phrases modify verbs it is called an adverbial  phrase. It is the same whether it modifies a verb, adverb, or  adjective. 3 people found this useful. Edit. Share to: Notyouraveragedummy ..."}]