[{"url": "http://occonline.occ.cccd.edu/online/aazadgan/ebert_IMCh07.doc", "passage_text": "Chapter Overview. Operations (or production) is the process and activities for transforming resources into finished services and goods for customers. The operations function creates four kinds of utility – time utility, place utility, possess utility, and form utility – to meet customer needs."}, {"url": "http://smallbusiness.chron.com/five-differences-between-service-manufacturing-organizations-19073.html", "passage_text": "There are five main differences between service and manufacturing organizations: the tangibility of their output; production on demand or for inventory; customer-specific production; labor-intensive or automated operations; and the need for a physical production location."}, {"url": "http://www.referenceforbusiness.com/management/Ob-Or/Operations-Management.html", "passage_text": "Operations management is also an academic field of study that focuses on the effective planning, scheduling, use, and control of a manufacturing or service firm and their operations."}, {"url": "http://smallbusiness.chron.com/five-differences-between-service-manufacturing-organizations-19073.html", "passage_text": "The key difference between service firms and manufacturers is the tangibility of their output. The output of a service firm, such as consultancy, training or maintenance, for example, is intangible. Manufacturers produce physical goods that customers can see and touch."}, {"url": "http://www.differencebetween.com/difference-between-production-and-vs-operation-management/", "passage_text": "Production Management. Production management on the other hand focuses specifically on the production of goods and services and is concentrated upon churning output from input. It is a broad sum of activities that go into turning raw material into final, finished product."}, {"url": "http://www.differencebetween.com/difference-between-production-and-vs-operation-management/", "passage_text": "by olivia. Production vs Operation Management. Production management and operations management are management jargon that needs to be simplified for those who are sitting on the fence or those inside an organization unable to comprehend them clearly."}, {"url": "http://www.differencebetween.com/difference-between-production-and-vs-operation-management/", "passage_text": "One may feel that production management is a subset of operations management, but production management in itself is a broad subject that comprises production planning and control, inventory management, and operations control."}, {"url": "http://managementstudyguide.com/production-and-operations-management.htm", "passage_text": "The very essence of any business is to cater needs of customer by providing services and goods, and in process create value for customers and solve their problems. Production and operations management talks about applying business organization and management concepts in creation of goods and services."}, {"url": "https://en.wikipedia.org/wiki/Operations_management", "passage_text": "Operations management is an area of management concerned with overseeing, designing, and controlling the process of production and redesigning business operations in the production of goods or services."}]