[{"url": "https://en.wikipedia.org/wiki/Surtsey", "passage_text": "The undersea vents that produced Surtsey are part of the Vestmannaeyjar submarine volcanic system, part of the fissure of the sea floor called the Mid-Atlantic Ridge. Vestmannaeyjar also produced the famous eruption of Eldfell on the island of Heimaey in 1973. The eruption that created Surtsey also created a few other small islands along this volcanic chain, such as Jolnir jólnir and unnamed other. peaks Effusive eruptions continued until 1965, by which time the island had a surface area of 2.5 km 2 (0.97 sq mi). On 28 December 1963 submarine activity 2.5 km (1.5 mi) to the north-east of Surtsey caused the formation of a ridge 100 m (328 ft) high on the sea floor."}, {"url": "http://earthsky.org/earth/surtsey-and-the-birth-of-new-islands", "passage_text": "The birth of this new land form wasn’t the end of Surtsey’s story. In the first spring after Surtsey emerged from the sea surface, seeds and other plant parts were found washed up on the newly formed shore. In the spring of 1965, the first higher plant was discovered at the shoreline: a sea rocket (Cakile arctica). This date in science: Surtsey and the birth of new islands. Birth of Surtsey in 1963 via NOAA. On November 14 1963, crew aboard a trawler sailing near Iceland spotted a column of smoke rising from the sea surface. A new island was being born."}, {"url": "http://visitwestmanislands.com/en/page/surtsey-island-1963", "passage_text": "The eruption of the island of Surtsey most likely began several hours, even days, before anyone was aware of volcanic activity in the area. The first signs above the sea that an eruption was occurring were seen by the crew of a fishing boat, Ísleifi íSLEIFI ii From, vestmannaeyjar early on the morning Of november, 14. 1963 Only two months later, an island had been formed which reached 174 metres above sea level. During the Surtsey eruption, two other small islands were formed. Syrtingur (70 m elev. and 0. 1 5 km') and J61nir (70 m elev. and 0. 3 kM2) . These have subsequently been eroded by the sea and are no longer"}, {"url": "http://www.answers.com/Q/How_surtsey_was_formed", "passage_text": "Surtsey is an island off SW Iceland, it was formed by volcanic eruptions beginning in November of 1963 and ending in June 1967. No further eruptions are expected there.   T … he volcano is a composite form, where lava has covered the existing cinder cone and formed erosion-resistant rock. "}, {"url": "http://www.answers.com/Q/How_did_the_island_of_Surtsey_form", "passage_text": "Answered by The Community. Making the world better, one answer at a time. Surtsey is a volcanic island off the southern coast of Iceland. It was formed in a volcanic eruption which began 426 ft below sea level, and reached the surface on 14 November 1963. The eruption lasted until 5 June 1967, when the island reached its maximum size. Surtsey (part of an island group off SW Iceland) is on constructive plate boundaries, which means the two plates move away from each other and magma rises to the surface. This … is how a volcano like Surtsey is formed."}, {"url": "http://www.surtsey.is/pp_ens/gen_3.htm", "passage_text": "The Surtsey eruption is among the longest eruptions to have occurred in Iceland in historical times. The first sign of an eruption came early in the morning of November 14, 1963, at a site approximately 18 km southwest of Heimaey, the largest of the Vestmannaeyjar (Westman Islands). Another small island, Jolnir, jólnir was formed During christmas, 1965 in an eruption on the sea floor.0 9 km to the southwest Of. Surtsey this island was in many respects very similar To. Syrtlingur it was about 70 m high and reached an area of approximately.0 3. km²"}, {"url": "http://www.icelandontheweb.com/articles-on-iceland/nature/volcanoes/surtsey/", "passage_text": "Named after the Norse fire god Surtur, Surtsey (Surtur's island) is one of the world's newest islands. In November 1963, Surtsey was formed in a volcanic eruption which heaved it up out of the waters 18 km (11 mi) south-west of Heimaey; 32 km (20 mi) off the south coast of Iceland."}, {"url": "http://volcano.oregonstate.edu/vwdocs/volc_images/europe_west_asia/surtsey.html", "passage_text": "Surtsey is a volcanic island and part of the Vestmannaeyjar submarine volcanic system. Vestmannaeyjar also produced the famous eruption of Heimaey (Eldfell). Surtsey is about 1.5 km in diameter and has an area of 2.8 square km. Surtsey is 33 km south of the main island of Iceland and 20 km southwest of Heimaey. The island is named for Surtur, a giant of fire in Icelandic mythology. Surtsey is a classic example of the growth of a new volcanic island. Episodic eruptions began on November 8, 1963 and ended on June 5, 1967. The volcano grew from the sea floor, at a depth of 130 m, to sea level by November 15"}, {"url": "http://www.surtsey.is/pp_ens/gen_3.htm", "passage_text": "From December 28, 1963, to January 6, 1964, a submarine eruption was evident in a location approximately 2.5 km east-northeast of Surtsey. A ridge some 100 m high formed on the sea floor. It was given the name Surtla but never grew to become an island, as did Surtsey. On April 4, 1964, a lava eruption commenced in the western crater on Surtsey. The lava flowed mainly to the south and east and formed a broad lava shield that was, in the end, 100 m thick at the crater. Another small island, Jolnir, jólnir was formed During christmas, 1965 in an eruption on the sea floor.0 9 km to the southwest Of. Surtsey this island was in many respects very similar To. Syrtlingur it was about 70 m high and reached an area of approximately.0 3. km²"}]