[{"url": "http://www.merriam-webster.com/dictionary/persuade", "passage_text": "Full Definition of PERSUADE. transitive verb. 1. : to move by argument, entreaty, or expostulation to a belief, position, or course of action. 2. : to plead with: urge. — per·suad·er noun. See persuade defined for English-language learners. See persuade defined for kids. ADVERTISEMENT. Examples of PERSUADE. 1  He persuaded his friend to go back to school. 2  She couldn't be persuaded to go. 3  He would not let himself be persuaded into buying the more expensive stereo. 4  I am not easily persuaded."}, {"url": "https://en.wikipedia.org/wiki/Persuasive_definition", "passage_text": "From Wikipedia, the free encyclopedia. A persuasive definition is a form of definition which purports to describe the 'true' or 'commonly accepted' meaning of a term, while in reality stipulating an uncommon or altered use, usually to support an argument for some view, or to create or alter rights, duties or crimes. Examples of persuasive definitions include: 1  atheist – someone who doesn't yet realize that God exists. 2  Democrat – a leftist who desires to overtax the corporations and abolish freedom in the economic sphere. 3  Republican – an old white man who feels threatened by change.."}, {"url": "http://dictionary.cambridge.org/us/dictionary/english/persuade", "passage_text": "persuade verb [T]. › to ​cause ​people to do or ​believe something, esp. by ​explaining why they should: The ​government is ​trying to persuade ​consumers to ​save more. She ​tried to persuade them that they should ​leave. persuasive adjective us /pərˈsweɪ·sɪv, -zɪv/ › a persuasive ​argument. persuade verb [T]. B1 to make someone do or ​believe something by giving them a good ​reason to do it or by ​talking to that ​person and making them ​believe it: If she doesn't ​want to go, nothing you can say will persuade her."}, {"url": "http://www.thefreedictionary.com/persuade", "passage_text": "Synonyms: persuade, induce, prevail, convince. These verbs mean to succeed in causing a person to do or consent to something. Persuade means to win someone over, as by reasoning or force of personality: Nothing could persuade her to change her mind. To induce is to lead, as to a course of action, by means of influence or persuasion: Pray what could induce him to commit so rash an action? (Oliver Goldsmith). prevail-use persuasion successfully; He prevailed upon her to visit his parents. drag-persuade to come away from something attractive or interesting; He dragged me away from the television set. tempt-try presumptuously; St."}, {"url": "https://en.wikipedia.org/wiki/Persuasive_definition", "passage_text": "A persuasive definition of a term is favorable to one argument or unfavorable to the other argument, but is presented as if it were neutral and well-accepted, and the listener is expected to accept such a definition without question. The term persuasive definition was introduced by philosopher C.L. Examples of persuasive definitions include: 1  atheist – someone who doesn't yet realize that God exists. 2  Democrat – a leftist who desires to overtax the corporations and abolish freedom in the economic sphere. 3  Republican – an old white man who feels threatened by change.."}, {"url": "http://www.oxfordlearnersdictionaries.com/us/definition/english/persuade", "passage_text": "1 Which Word?persuade / convince The main meaning of persuade is to make someone agree to do something by giving them good reasons for doing it:I tried to persuade her to see a doctor. 2  The main meaning of convince is to make someone believe that something is true:He convinced me he was right. Add to my wordlist. 1  1 to make somebody do something by giving them good reasons for doing it persuade somebody to do something Try to persuade him to come. 2  persuade somebody Please try and persuade her."}, {"url": "http://www.yourdictionary.com/persuade", "passage_text": "verb. A business woman tries to persuade her coworkers. A business woman tries to persuade her coworkers. The definition of persuade is to convince someone to do or think something. An example of persuade is when you make a strong argument for why your idea is right and your argument convinces your boss to implement your idea"}]