[{"url": "http://vcat.com/", "passage_text": "VCAT provides broad-based advisory services to clients in the casino and hospitality industry. VCAT is intimately familiar with the casino industry and has delivered unique solutions and strategies to clients for 20 years. 1  Financing. 2  Casino and resort design, architecture and development. "}, {"url": "https://www.gotocourt.com.au/legal-news/vcat/", "passage_text": "Tags: VCAT. The purpose of the Victorian Civil and Administrative Tribunal (VCAT) is to provide a low cost, accessible, efficient tribunal with a focus on dispute resolution. VCAT deals with a variety of matters but does not assist with debt recovery, motor vehicle accident claims or fencing disputes. A member of VCAT presiding over your matter will then deliver a decision either on the spot at the hearing, or for more complex matters shortly after in writing. All appeals of a VCAT decision can be made in the Supreme Court of Victoria but only on questions of law."}, {"url": "https://en.wikipedia.org/wiki/Virtual_concatenation", "passage_text": "Virtual concatenation (VCAT) is an inverse multiplexing technique creating a large capacity payload container distributed over multiple smaller capacity TDM signals. These signals may be transported or routed independently. Virtual concatenation has been defined for SONET / SDH, OTN and PDH path signals. VCAT helps in providing services at a lower cost and more quickly than contiguous concatenation. However, it creates differential delay whereby each path that is created, represented by a VT has a different propagational delay across the network. The difference in these delays is called differential delay (D)."}, {"url": "http://www.vcat.tv/", "passage_text": "VCAT office hours: Wednesdays – Fridays 11:00 am – 5:00 pm. Vallejo Community Access Television (VCAT) provides public, educational and governmental access TV to the residents and workers in our community. "}, {"url": "http://www.vcat.tv/category/what-is-vcat/", "passage_text": "VCAT works to build community awareness by showcasing our talents, celebrating our diversity, enhancing our educational opportunities, understanding our past and exploring our future while promoting community involvement and participation. VCAT membership is open to all those who live or work in Vallejo, organizations that serve Vallejo, such as clubs, groups, non-profit organizations, businesses, government institutions, schools, colleges and universities."}, {"url": "http://lawgovpol.com/vcat/", "passage_text": "VCAT employs a number of legal and administrative staff to manage and oversee hearings. The president of VCAT (currently Justice Greg Garde) is always a judge of the Supreme Court. It has 14 vice-presidents: all are County Court judges and are in charge of a particular list. Most VCAT hearings are overseen by either ‘members’ or ‘senior members’. This makes VCAT the largest multi-purpose legal facility in Australia and one of the largest in the world. Some of the 14 lists currently in operation at VCAT are: Civil Claims List (Civil Division) . This list hears generic civil law disputes, such as negligence claims and property disputes."}, {"url": "http://lawgovpol.com/vcat/", "passage_text": "VCAT was formed to improve and streamline the delivery of civil law and dispute resolution services in Victoria. It was intended to be a ‘super tribunal’ or ‘one-stop shop’ for dealing with matters of civil and administrative law, including disputes about employment, finance, planning, tenancy and consumer complaints. This makes VCAT the largest multi-purpose legal facility in Australia and one of the largest in the world. Some of the 14 lists currently in operation at VCAT are: Civil Claims List (Civil Division) . This list hears generic civil law disputes, such as negligence claims and property disputes."}, {"url": "https://en.wikipedia.org/wiki/Victorian_Civil_and_Administrative_Tribunal", "passage_text": "From Wikipedia, the free encyclopedia. The Victorian Civil and Administrative Tribunal (VCAT) was formed by the Victorian Civil and Administrative Tribunal Act 1998 in the state of Victoria, Australia. As part of the Victorian Justice system the Tribunal sits 'below' the Magistrates Court in the court hierarchy. However the Tribunal itself is not a Court as it is a creature of statute and has no inherent jurisdiction or powers. The Tribunal began operating on 1 July 1998, amalgamating 15 smaller boards and tribunals, creating a 'one-stop-shop' for handling a broad range of disputes. When looking at the sheer number of cases, the VCAT deals with the overwhelming majority of legal proceedings in this State [1] . The President of VCAT, (currently Gregory Garde AO RFD), is a Supreme Court Judge, and County Court Judges serve as Vice President"}, {"url": "http://consumeraction.org.au/taking-your-dispute-to-vcat/", "passage_text": "As at 1 July 2015, for claims of less than $500 the VCAT filing fee is $59.80 and for claims of more than $500 but less than $10,000, the filing fee is $174.10. a fee if payment of the fee would cause the person responsible for its payment financial hardship. Common disputes involve defective goods or services or consumers being misled by a business. VCAT has very broad powers to resolve a consumer-trader dispute, including: 1  ordering the payment of a sum of money; 2  declaring a debt is or is not owing; 3  ordering a party to do or refrain from doing something.[2]."}]