[{"url": "http://blog.credit.com/2014/04/how-to-get-a-boat-loan-81753/", "passage_text": "If you’re unfamiliar with the boat market, take time to shop around a bit. Get a feel for prices in your area so that you know how much money you need to ask for. 3. Know how much you can afford. If you make $30,000 a year, you shouldn’t go buy a $100,000 boat – even if someone will loan you that much money. Because a boat is purely for pleasure, you certainly don’t want to get in over your head."}, {"url": "http://www.discoverboating.com/buying/financing/loancalculator.aspx", "passage_text": "Boating may be more affordable than you think. In some instances, you can buy a brand new boat for around $250 a month, while a new PWC may be purchased for around $125 a month. Interest on a boat loan may be deductible if the boat has a galley, berth and head."}, {"url": "http://www.eboatloans.com/faq.php", "passage_text": "If your current loan balance (or if you own the boat free & clear) plus 80% of the cost of the upgrade is $25,000 or greater, the answer is YES. However, the new loan can not exceed 80% of the current market value of your boat."}, {"url": "http://blog.credit.com/2014/04/how-to-get-a-boat-loan-81753/", "passage_text": "Rates on this type of loan will depend on your credit score, and you’ll have a down payment of 10%-25% of the boat’s purchase price. Home equity loan: If you have significant equity in your home, you can take out a home equity loan or line of credit to use for basically anything. Payments on home equity loans are usually tax-deductible, and these loans allow you to take advantage of today’s low home loan interest rates."}, {"url": "http://www.eboatloans.com/faq.php", "passage_text": "Your loan request is then immediately sent out to the network of marine lenders. The lenders will respond with a decision about your loan request. You can then review the offer, and make your decision to move forward on the loan."}, {"url": "http://www.eboatloans.com/faq.php", "passage_text": "First, find the value of the boat you are interested in purchasing. Second, calculate your monthly payments to see if they are within your budget. Third, fill out the online loan application and/or print out the form, complete it and fax it in to our office."}, {"url": "http://www.fintalk.com/boating-tips/boat-loans.html", "passage_text": "A new boat can be financed for 120 months or more which means after 10 years of wear and tear on your boat you could still be making payments. 15 year or 20 year loans are available for more expensive purchases."}]