[{"url": "http://business.financialpost.com/personal-finance/retirement/rrsp/the-difference-between-an-rrsp-contribution-and-deduction", "passage_text": "The deadline is really referring to the RRSP contribution deadline, which is the last day you can make an RRSP contribution and still be able to claim that contribution as a deduction on your 2012 income tax return. "}, {"url": "https://turbotax.intuit.ca/tax-resources/tax-tips/tax-law/how-to-calculate-rrsp-deduction-limit.jsp", "passage_text": "The RRSP deduction and contribution limit is 18 percent of your earned income to a maximum value each year. The maximum RRSP contribution limit for 2013 is $23,820. Unused contributions are carried forward each year, so if you didn't maximize your RRSPs last year, you can add the unused amount to this year's limit. "}, {"url": "http://www.cra-arc.gc.ca/tx/ndvdls/tpcs/rrsp-reer/cntrbtng/lmts-eng.html", "passage_text": "The RRSP limit for 2014 is $24,270. However, your 2014 RRSP deduction limit may be more than $24,270 if you did not use your entire RRSP deduction limit for the years 1991 to 2013. You can find your RRSP deduction limit by going to one of the following: 1  amount (A) of the RRSP Deduction Limit Statement, on your latest notice of assessment or notice of reassessment; 2  a T1028, Your RRSP Information for 2014, that we sent you after processing your 2013 income tax and benefit return;"}, {"url": "http://sunlifeglobalinvestments.com/Slgi/Helpful+information/Investor+Learning/Planning+for+your+retirement/RRSP+limits?vgnLocale=en_CA", "passage_text": "1 Your RRSP contribution limit for 2015 is 18% of earned income you reported on your tax return in the previous year, up to a maximum of $24,930. 2  For 2014, the upper limit was $24,270. 3  If you have a company pension plan, your RRSP contribution limit is reduced – see the last bullet point for details. "}, {"url": "http://www.theglobeandmail.com/globe-investor/investor-education/im-70-how-much-longer-can-i-contribute-to-my-rrsp/article8119423/", "passage_text": "Dear Sam, 1. You can contribute to your RRSP as long as you have contribution room. You must, however, have taxable income to write it off from, otherwise it doesn't make sense. The final deadline you have to contribute is December 31 the year you turn age 71. 2. You can withdraw from your RRSP at any time. "}, {"url": "http://www.cra-arc.gc.ca/tx/ndvdls/tpcs/rrsp-reer/cntrbtng/menu-eng.html", "passage_text": "Age limit for contributing to an RRSP. December 31 of the year you turn 71 years of age is the last day you can make a contribution to your RRSP. See RRSP options when you turn 71 if this situation applies to you. You can contribute to an RRSP under which your spouse or common-law partner is the annuitant until the end of the year your spouse or common-law partner turns 71."}, {"url": "http://www.cra-arc.gc.ca/tx/ndvdls/tpcs/rrsp-reer/cntrbtng/lmts-eng.html", "passage_text": "This is often called your contribution room.. Amounts that you contribute above this limit may be considered excess contributions (over-contributions) . Your RRSP deduction limit is the amount of RRSP contributions that you can deduct on your tax return for a given year. You can find your RRSP deduction limit by going to one of the following: 1  amount (A) of the RRSP Deduction Limit Statement, on your latest notice of assessment or notice of reassessment; 2  a T1028, Your RRSP Information for 2014, that we sent you after processing your 2013 income tax and benefit return;"}, {"url": "https://www.vancity.com/Investments/TypesofInvestments/RRSPs/UnderstandingRRSPs/HowRRSPsWork/", "passage_text": "Contribution maximums. You may contribute to your RRSP until December 31 of the year in which you reach age 71. The amount you can contribute is determined by the earned income you report on your tax return. Your new annual contribution room is 18% of your previous year's earned income, up to an annual limit. Annual limit:"}, {"url": "http://www.cra-arc.gc.ca/tx/ndvdls/tpcs/rrsp-reer/cntrbtng/lmts-eng.html", "passage_text": "Note. The RRSP limit for 2014 is $24,270. However, your 2014 RRSP deduction limit may be more than $24,270 if you did not use your entire RRSP deduction limit for the years 1991 to 2013. Your unused RRSP deduction room will be carried forward to 2014. You can find your RRSP deduction limit by going to one of the following: 1  amount (A) of the RRSP Deduction Limit Statement, on your latest notice of assessment or notice of reassessment; 2  a T1028, Your RRSP Information for 2014, that we sent you after processing your 2013 income tax and benefit return;"}, {"url": "http://business.financialpost.com/personal-finance/retirement/rrsp/use-your-rrsp-wisely", "passage_text": "Let’s start with the basics. Based on your tax summary, you can see how much money you can potentially contribute to your RRSP this year. CRA keeps track of contribution room and how much you contribute. On an annual basis, up to 18% of your income can be contributed up to a maximum of $23,820 for 2013. "}]