[{"url": "http://www.ehow.com/info_7945341_costs-pond-building.html", "passage_text": "Save. by the pond image by Quennie Chua from Fotolia.com. The cost of building a pond ranges from $10,000 to $20,000 per acre for small ponds. Larger ponds of 10 acres or more can cost between $1,000 to $5,000 per acre for good sites, according to Alabama A&M and Auburn Universities. Most of the expense of building a pond comes from removing all of the dirt to create the hole for your pond."}, {"url": "http://www.landscapingnetwork.com/ponds/cost.html", "passage_text": "Pond Cost. The cost to build a backyard pond can vary greatly. The size, style, materials and equipment you select will all impact the final price of your pond. You can expect to pay between $5,000 and $20,000 for a custom pond. "}, {"url": "http://www.howmuchisit.org/cost-to-build-a-pond/", "passage_text": "1 According to Aquahabitat.com, a one acre pond that is 10 feet deep will be around 16,133 cubic yards. 2  Taking the figures mentioned above, a pond such as this could cost $32,000 to $64,000 to accomplish. 3  A half of an acre could be half of the costs mentioned above. 1 The first step to building a pond is to dig out the area. 2  On average, digging up a pond is going to cost anywhere from $2 to $4 per cubic yard of material that has to be removed. 3  Although it may seem odd, smaller ponds are often going to cost more than larger ponds because they require smaller equipment"}, {"url": "http://www.howmuchisit.org/stocking-a-pond-cost/", "passage_text": "1 The cost of stocking a pond will greatly depend on the size. 2  Most companies are going to charge by the acre. 3  Stocking a one acre pond is going to be around $600 to $1,400 while a smaller 1/4 acre can cost $250 to $500. 1 Most companies are going to charge by the acre. 2  Stocking a one acre pond is going to be around $600 to $1,400 while a smaller 1/4 acre can cost $250 to $500. 3  A 1/2 acre, on the other hand, can cost $500 to $800. 4  Aside from the size, the type of fish added to the pond can bring up the price too."}, {"url": "http://www.howmuchisit.org/stocking-a-pond-cost/", "passage_text": "1 A 1/2 acre, on the other hand, can cost $500 to $800. 2  Aside from the size, the type of fish added to the pond can bring up the price too. 3  For those that only want to purchase specific fish, plan on budgeting at least $0.50 to as much as $4 per fish. 1 Most companies are going to charge by the acre. 2  Stocking a one acre pond is going to be around $600 to $1,400 while a smaller 1/4 acre can cost $250 to $500. 3  A 1/2 acre, on the other hand, can cost $500 to $800. 4"}, {"url": "http://www.aquahabitat.com/techfaqs.html", "passage_text": "To move or excavate dirt to build or dig a pond, you can expect to pay roughly $2.50 per cubic yard of material dug out of the pond. Figure $1.50 - 3.50 per yard of material depending on the difficulty of excavation and costs specific to local market conditions. A pond is very much more than a hole in the ground that collects water. After calculating a rough pond excavation budget, now double the pond construction budget due to the cost of dredging and re-digging the pond in ten to twenty years or sooner due to a poor pond design."}, {"url": "http://www.howmuchisit.org/stocking-a-pond-cost/", "passage_text": "1 Stocking a one acre pond is going to be around $600 to $1,400 while a smaller 1/4 acre can cost $250 to $500. 2  A 1/2 acre, on the other hand, can cost $500 to $800. 3  Aside from the size, the type of fish added to the pond can bring up the price too. 1 Most companies are going to charge by the acre. 2  Stocking a one acre pond is going to be around $600 to $1,400 while a smaller 1/4 acre can cost $250 to $500. 3  A 1/2 acre, on the other hand, can cost $500 to $800. 4"}, {"url": "http://www.howmuchisit.org/cost-to-build-a-pond/", "passage_text": "1 Taking the figures mentioned above, a pond such as this could cost $32,000 to $64,000 to accomplish. 2  A half of an acre could be half of the costs mentioned above. 3  Overall, in order to safely plan your budget, most will say plan on $8,000 to $15,000 per acre for the entire job. 1 The first step to building a pond is to dig out the area. 2  On average, digging up a pond is going to cost anywhere from $2 to $4 per cubic yard of material that has to be removed. 3  Although it may seem odd, smaller ponds are often going to cost more than larger ponds because they require smaller equipment"}]