[{"url": "http://www.learnhowtobecome.org/pharmacist/", "passage_text": "Pharmacist Schools. The first step in learning how to become a pharmacist is completing two years undergraduate training followed by four years in a pharmacy program. The following search tool provides a way to explore the many schools with pharmacy degree programs. The primary test is the North American Pharmacist Licensing Exam (NAPLEX), a 185-question test that measures a candidate’s knowledge of the practice of pharmacy. At its core, the purpose of the NAPLEX is to ascertain the following abilities: 1  To identify positive standards of effective and safe pharmacotherapy."}, {"url": "http://www.learnhowtobecome.org/pharmacist/", "passage_text": "Becoming a pharmacist requires years of education and training to obtain the necessary knowledge, skills and certifications. Aspiring pharmacists can spend anywhere between six years (fast-track) to thirteen years completing pre-requisites, Pharm.D coursework, clinical rotations and national exams. The primary test is the North American Pharmacist Licensing Exam (NAPLEX), a 185-question test that measures a candidate’s knowledge of the practice of pharmacy. At its core, the purpose of the NAPLEX is to ascertain the following abilities: 1  To identify positive standards of effective and safe pharmacotherapy."}, {"url": "http://www.excite.com/education/others/how-to-become-a-pharmacist", "passage_text": "A: If you want to be a pharmacist in U.S. you will need to have a doctorate of pharmacy degree. Students who have completed two years of college education and have passed the Pharmacy college admission test can begin their pharmacy program. This program in pharmacy will take 4-7 years to complete. A: If you want to become a pharmacist you need to have a doctor of Pharmacy degree. This degree will make you eligible for the North American Licensure Examination (NAPLEX). After you have earned a doctor of pharmacy degree and passed the NAPLEX you can become a pharmacist anywhere in the country."}, {"url": "http://www.access2knowledge.org/jobs-education/how-long-does-it-take-to-become-a-pharmacist/", "passage_text": "It is possible to become a pharmacist in as few as 6 years with an associate’s degree, but the more common timeline is 8 years, including 4 years as a bachelor candidate and 4 years in professional pharmacy training. Undergraduate Coursework. "}, {"url": "http://www.wikihow.com/Become-a-Pharmacist", "passage_text": "2. Get a bachelor's degree. You will need to have a Bachelor of Science (BS) degree from a four-year institution to apply to pharmacy school. It is required that you complete at least two years of pre-pharmacy coursework during this time, including anatomy, biology, calculus, chemistry, physics, and sociology. 5. Get licensed. It is required to have a license to practice pharmacy in the United States. You will need to pass the NAPLEX (North American Pharmacist Licensure Examination) to gain licensure, and take the Multistate Pharmacy Jurisprudence Exam (MPJE) for most states."}, {"url": "http://www.excite.com/education/others/how-to-become-a-pharmacist", "passage_text": "A: If you want to become a pharmacist you should have a PharmD or doctorate of Pharmacy degree. Students should earn a passing score in the Pharmacy college admission test and complete two years of their undergraduate program to enroll in a four year pharmacy program. A: If you want to become a pharmacist you need to have a doctor of Pharmacy degree. This degree will make you eligible for the North American Licensure Examination (NAPLEX). After you have earned a doctor of pharmacy degree and passed the NAPLEX you can become a pharmacist anywhere in the country."}, {"url": "http://www.wikihow.com/Become-a-Pharmacist", "passage_text": "How to Become a Pharmacist. Pharmacists dispense prescription medications and advise patients on their proper use and potential risks. The number of pharmacy jobs is expected to increase by 25% from 2010 to 2020, a faster growth rate than for most jobs. 5. Get licensed. It is required to have a license to practice pharmacy in the United States. You will need to pass the NAPLEX (North American Pharmacist Licensure Examination) to gain licensure, and take the Multistate Pharmacy Jurisprudence Exam (MPJE) for most states."}, {"url": "http://www.howtobecome.com/how-to-become-a-pharmacist", "passage_text": "Pharmacists must have a Doctor of Pharmacy (Pharm.D.) degree to practice. Many students enter Pharm.D. programs after only two or three years of undergraduate study. If you want to apply to a Pharm.D. program, look for one that is accredited by the Accreditation Council for Pharmacy Education. Focus on earning high grades in undergraduate prerequisite courses like general chemistry, organic chemistry, biochemistry, human anatomy and physiology, biology, calculus, and statistics"}, {"url": "http://www.excite.com/education/others/how-to-become-a-pharmacist", "passage_text": "A: If you want to become a pharmacist you should enroll in a PharmD or doctorate of Pharmacy degree. College students who want begin a four year pharmacy program need to complete two years of undergraduate course work and pass the Pharmacy college admission test (PCAT). A: If you want to become a pharmacist you need to have a doctor of Pharmacy degree. This degree will make you eligible for the North American Licensure Examination (NAPLEX). After you have earned a doctor of pharmacy degree and passed the NAPLEX you can become a pharmacist anywhere in the country."}]