[{"url": "http://www.gardenandflowers.com/info_12321067_larkspurs-poisonous-dogs.html", "passage_text": "Larkspur Toxins. Like other members or the Buttercup (Ranunculaceae) family, larkspurs contain toxic diterpene alkaloids. While livestock are more vulnerable to these poisons than dogs, your pet still faces some very serious consequences if he munches on the plants. The American Society for Prevention of Cruelty to Animals reports that dogs with larkspur poisoning may have all these symptoms, as well as stiffness, convulsions and digestive problems, including vomiting and constipation. Worst-case larkspur poisoning causes heart or respiratory failure."}, {"url": "http://www.petpoisonhelpline.com/poison/larkspur/", "passage_text": "Larkspur or Delphinium is a beautiful flowering plant. All plants in the Ranunculaceae family contain diterpene alkaloids. These alkaloids have a neuromuscular blocking effect by inhibiting acetylcholine (neurotransmitter in nervous systems) causing weakness, drooling, abnormal heart rhythms, constipation, abdominal pain, paralysis, tremors and seizures when ingested."}, {"url": "https://en.wikipedia.org/wiki/Delphinium", "passage_text": "All parts of these plants are considered toxic to humans, especially the younger parts, causing severe digestive discomfort if ingested, and skin irritation. Larkspur, especially tall larkspur, is a significant cause of cattle poisoning on rangelands in the western United States. Larkspur is more common in high-elevation areas, and many ranchers delay moving cattle onto such ranges until late summer when the toxicity of the plants is reduced."}, {"url": "http://www.mountlehmanllamas.com/delphinium.html", "passage_text": "Tall larkspur, (Delphinium glaucuma) a member of the buttercup family, is a tall stately perennial with stems two to six feet tall. It is common in the foothills of the Rocky Mountains and the central interior of B.C. If an animal eats as little as 0.7 percent of its weight of young plants, it will die. Low larkspur (Delphinium bicolor) is also a member of the buttercup family and has stems up to 18 inches high. All parts of the plant are poisonous."}, {"url": "https://en.wikipedia.org/wiki/Delphinium", "passage_text": "Delphinium is a genus of about 300 species of perennial flowering plants in the family Ranunculaceae, native throughout the Northern Hemisphere and also on the high mountains of tropical Africa. Larkspur, especially tall larkspur, is a significant cause of cattle poisoning on rangelands in the western United States. Larkspur is more common in high-elevation areas, and many ranchers delay moving cattle onto such ranges until late summer when the toxicity of the plants is reduced."}, {"url": "http://www.ars.usda.gov/Services/docs.htm?docid=9943", "passage_text": "Broad leaves are divided into deep lobes. In contrast, wild geranium, which is often mistaken for larkspur, has shallow leaf lobes. Tall larkspur is a perennial that is found on hillsides and in meadows. It ranges in height from 1 to 2 meters. A hollow stem distinguishes larkspur from poisonous monkshood, which has a similar blue flower but with a hood. Low larkspur has spurred blue flowers that grow on the top third of a single and unbranched stem. It is found on grassy hillsides and in sagebrush areas, where it may reach a height of 2 feet. "}, {"url": "http://beefmagazine.com/mag/beef_larkspur_alert", "passage_text": "Tall larkspur (wild delphinium) is a cattle killer. The poisonous plant claims average death losses of 4-5% annually in some allotments in Utah, Colorado, Wyoming, Idaho and Montana. In some situations, sheep can be grazed ahead of cattle since tall larkspur is not toxic to sheep. If sheep eat or trample the larkspur before cattle are put into a pasture, cattle losses may be reduced. Mineral supplementation has been tried by some ranchers to reduce consumption of larkspur."}, {"url": "http://dogcare.dailypuppy.com/larkspurs-poisonous-dogs-5995.html", "passage_text": "Larkspur Toxicity. Larkspurs tend to become less toxic as they mature, according to the ASPCA. The alkaloids in these plants cause neuromuscular blocking because they inhibit a neurotransmitter called acetylcholine. You may see drooling, vomiting or constipation after your dog has eaten larkspurs. Jupiterimages/Photos.com/Getty Images. Larkspurs (Delphinium species) have the potential to be highly toxic to dogs, although pets generally don’t eat them. These flowering plants contain diterpene alkaloids, which can cause health concerns ranging from vomiting to death."}, {"url": "https://en.wikipedia.org/wiki/Delphinium", "passage_text": "All members of the Delphinium genus are toxic to humans and livestock. The common name larkspur is shared between perennial Delphinium species and annual species of the genus Consolida. Larkspur, especially tall larkspur, is a significant cause of cattle poisoning on rangelands in the western United States. Larkspur is more common in high-elevation areas, and many ranchers delay moving cattle onto such ranges until late summer when the toxicity of the plants is reduced."}]