[{"url": "http://www.everydayhealth.com/drugs/betaine", "passage_text": "Betaine is used to reduce homocysteine levels in people with a genetic condition called homocystinuria, in which the amino acid builds up in the body. Betaine is not a cure for homocysteinuria. Betaine may also be used for purposes not listed in this medication guide. Follow all directions on your medicine label and package. Tell each of your healthcare providers about all your medical conditions, allergies, and all medicines you use."}, {"url": "https://draxe.com/what-is-betaine/", "passage_text": "Betaine is a derivative of the nutrient choline; in other words, choline is a “precursor” to betaine and must be present for betaine to be synthesized in the body. Betaine is created by choline in combination with the amino acid glycine. 7. Betaine is used to treat alcoholic liver damage that results in the accumulation of fat in the liver. Betaine has lipotropic (fat-reducing) effects, so it has been shown to produce significant improvements in healing fatty liver disease by helping the liver to process and remove fats."}, {"url": "https://draxe.com/what-is-betaine/", "passage_text": "Betaine is an amino acid that has been shown to have potential benefits for fighting heart disease, improving body composition, and helping promote muscle gain and fat loss because of its abilities to promote protein synthesis in the body. 7. Betaine is used to treat alcoholic liver damage that results in the accumulation of fat in the liver. Betaine has lipotropic (fat-reducing) effects, so it has been shown to produce significant improvements in healing fatty liver disease by helping the liver to process and remove fats."}, {"url": "http://www.everydayhealth.com/drugs/betaine", "passage_text": "Betaine is a byproduct of sugar beet processing. Betaine works by preventing the build-up of an amino acid called homocysteine. This amino acid can harm blood vessels and contribute to heart disease, stroke, or circulation problems. Betaine is not a cure for homocysteinuria. Betaine may also be used for purposes not listed in this medication guide. Follow all directions on your medicine label and package. Tell each of your healthcare providers about all your medical conditions, allergies, and all medicines you use."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1008-BETAINE%20ANHYDROUS.aspx?activeIngredientId=1008&activeIngredientName=BETAINE%20ANHYDROUS", "passage_text": "BETAINE ANHYDROUS Overview Information. Betaine anhydrous is a chemical that occurs naturally in the body, and can also be found in foods such as beets, spinach, cereals, seafood, and wine. Betaine anhydrous is also used for treating high blood homocysteine levels, liver disease, depression, osteoarthritis, congestive heart failure (CHF), and obesity; for boosting the immune system; and for improving athletic performance."}, {"url": "http://umm.edu/health/medical/altmed/supplement/betaine", "passage_text": "Overview. Betaine -- also called betaine anhydrous, or trimethylglycine (TMG) -- is a substance that's made in the body. It's involved in liver function, cellular reproduction, and helping make carnitine. It also helps the body metabolize an amino acid called homocysteine. Betaine -- also called betaine anhydrous, or trimethylglycine (TMG) -- is a substance that's made in the body. It's involved in liver function, cellular reproduction, and helping make carnit"}, {"url": "https://draxe.com/what-is-betaine/", "passage_text": "A betaine deficiency is not thought to be common in western nations, mostly because betaine is present in high amounts in wheat products, which are a staple in most people’s diets. Although it’s not directly due to low betaine intake, diets low in betaine may contribute to high homocysteine in the blood. 7. Betaine is used to treat alcoholic liver damage that results in the accumulation of fat in the liver. Betaine has lipotropic (fat-reducing) effects, so it has been shown to produce significant improvements in healing fatty liver disease by helping the liver to process and remove fats."}]