[{"url": "https://en.wikipedia.org/wiki/Blood_type", "passage_text": "Blood type (or blood group) is determined, in part, by the ABO blood group antigens present on red blood cells. A blood type (also called a blood group) is a classification of blood based on the presence or absence of inherited antigenic substances on the surface of red blood cells (RBCs). These antigens may be proteins, carbohydrates, glycoproteins, or glycolipids, depending on the blood group system. 1 Blood group A individuals have the A antigen on the surface of their RBCs, and blood serum containing IgM antibodies against the B antigen. 2  Therefore, a group A individual can receive blood only from individuals of groups A or O (with A being preferable), and can donate blood to individuals with type A or AB."}, {"url": "http://www.wisegeekhealth.com/what-are-some-rare-blood-types.htm", "passage_text": "Within the ABO/Rhesus Group systems which are used to classify most blood types, there are several rare blood types. The rarest is AB-, with less than one percent of the world's population having this blood type. B-and O-are also very rare, each accounting for less than 5% of the world's population. Blood type is determined by the presence of certain antigens in the blood. The A and B antigens are very common, making it easy to classify people by which antigen they have, while people with Type O blood have neither antigen."}, {"url": "http://www.wisegeekhealth.com/what-are-some-rare-blood-types.htm", "passage_text": "Two types of blood on a blood typing test card. People with rare blood types often bank their blood ahead of surgical procedures. Red blood cells. Type O blood does not have A or B antigens. Blood type is determined by the presence of certain antigens in the blood. The A and B antigens are very common, making it easy to classify people by which antigen they have, while people with Type O blood have neither antigen."}, {"url": "http://www.answers.com/Q/What_is_the_rarest_blood_type", "passage_text": "The rarest common blood type is AB negative. However, there have been some rare blood types discovered which fall out of the A/B Antigen, Rh +/- system normally used to distin … guish blood types. The rarest phenotypic blood type is Type AB negative found in only 0.7% of people worldwide. Genetically the rarest blood type should be Type O; however, it's the most common blood type."}, {"url": "http://www.redcrossblood.org/learn-about-blood/blood-types", "passage_text": "In general, Rh negative blood is given to Rh-negative patients, and Rh positive blood or Rh negative blood may be given to Rh positive patients. 1  The universal red cell donor has Type O negative blood type. 2  The universal plasma donor has Type AB blood type. O positive is the most common blood type. Not all ethnic groups have the same mix of these blood types. Hispanic people, for example, have a relatively high number of O’s, while Asian people have a relatively high number of B’s. The mix of the different blood types in the U.S. population is:"}, {"url": "http://www.redcrossblood.org/learn-about-blood/blood-types", "passage_text": "Blood Types and the Population. O positive is the most common blood type. Not all ethnic groups have the same mix of these blood types. Hispanic people, for example, have a relatively high number of O’s, while Asian people have a relatively high number of B’s. The mix of the different blood types in the U.S. population is:"}, {"url": "https://answers.yahoo.com/question/index?qid=20081221011524AA52TB4", "passage_text": "Best Answer: Close A+ just means Rh positive. The 4 types of blood: A, B, AB, & O. O is the MOST common and also called the universal donner. A & B are common. AB Is rare. http://www.redcross.org/donate/give/ ✰✰✰. Report Abuse. A+ just means A positive. There are 4 types of blood: A, B, AB, & O. Ab is the MOST common. A & B are common. O Is extremely rare. I would say A is pretty common, but not as common as AB."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090708061842AA0jjYZ", "passage_text": "That's the + behind the A in you blood type. There are people with a-as their RH factor. You have a very common blood type-pronounced ay positive. The rarest of blood types-sometimes called theUniversal Donor - is type O-or oh negative. Dragonki is very, very confused about RH factor, by the way... Doc Bill · 6 years ago."}, {"url": "https://en.wikipedia.org/wiki/Blood_type", "passage_text": "Some of these antigens are also present on the surface of other types of cells of various tissues. Several of these red blood cell surface antigens can stem from one allele (or an alternative version of a gene) and collectively form a blood group system. 1 Blood group A individuals have the A antigen on the surface of their RBCs, and blood serum containing IgM antibodies against the B antigen. 2  Therefore, a group A individual can receive blood only from individuals of groups A or O (with A being preferable), and can donate blood to individuals with type A or AB."}, {"url": "http://www.disabled-world.com/calculators-charts/blood-chart.php", "passage_text": "In general, Rh negative blood is given to Rh-negative patients, and Rh positive blood or Rh negative blood may be given to Rh positive patients. 1  The universal red cell donor has Type O negative blood type. 2  The universal plasma donor has Type AB positive blood type. "}]