[{"url": "http://www.chembio.uoguelph.ca/educmat/chm729/band/smet1.htm", "passage_text": "Semi-metals are materials that are simialr to metals except that they have poorer conductivity and are not malleable like metals. To explain these properties one must look at the bands of semi-metals. The band structure is shown below. "}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/pertab/metal.html", "passage_text": "Metals and Nonmetals. As shown on the periodic table of the elements below, the majority of the chemical elements in pure form are classified as metals. It seems appropriate to describe what is meant by metal in general terms. This general description is adapted from Shipman, et al"}, {"url": "http://www.ducksters.com/science/chemistry/metalloids.php", "passage_text": "The metalloids are a group of elements in the periodic table. They are located to the right of the post-transition metals and to the left of the non-metals. 1 Antimony. 2  Tellurium. 3  Unlike other families of elements such as the noble gases, alkali metals, and halogens, the metalloids form a diagonal line on the periodic table rather than a vertical line. 4  Silicon is one of the most important materials used to make electronics such as computers and mobile phones."}, {"url": "http://chemistry.about.com/od/chemistryglossary/g/Semi-Metal-Definition.htm", "passage_text": "Definition: A semi-metal is an element that contains a partially filled p orbital. The semi-metal group consists of hydrogen, carbon, nitrogen, oxygen, phosphorus, sulfur, and selenium. Also Known As: nonmetal. "}, {"url": "http://www.answers.com/Q/What_is_semi_metal", "passage_text": "Semi-metals, or metalloids, are elements that have properties of both metals and nonmetals. These are elements touching the 'staircase,' or zigzag line, that separate metals f … rom nonmetals. Being a semi-metal means that they have simalarities of metals and non-metals.   * boron  * silicon  * germanium  * arsenic  * antimony  * selenium  * tellurium …."}, {"url": "http://www.answers.com/Q/What_are_the_chemical_properties_of_semi-metals", "passage_text": "That's why they're called semi-metals. They are reactive depending on the element they are reacting with, and they are semi-conductors. "}, {"url": "http://chemistry.about.com/od/elementgroups/a/metalloids.htm", "passage_text": "The metalloids or semimetals are located along the line between the metals and nonmetals in the periodic table. The metalloids are boron, silicon, germanium, arsenic, antimony, and tellurium. Polonium is often considered a metalloid, too. Properties of the Semimetals or Metalloids. The electronegativities and ionization energies of the metalloids are between those of the metals and nonmetals, so the metalloids exhibit characteristics of both classes."}, {"url": "http://metals.about.com/od/properties/a/Metalloids.htm", "passage_text": "Metalloids, or semi-metals, are a group of elements that possess both properties of metals and non-metals. The following six elements are commonly regarded as metalloids: 1  Boron. 2  Silicon. 3  Germanium. 4  Arsenic. 5  Antimony. 6  Tellurium. "}, {"url": "http://chemistry.about.com/od/elementgroups/a/metalloids.htm", "passage_text": "By Anne Marie Helmenstine, Ph.D. Between the metals and nonmetals is a group of elements known as either the semimetals or the metalloids. Here is a look at the location of these elements and their common properties. Properties of the Semimetals or Metalloids. The electronegativities and ionization energies of the metalloids are between those of the metals and nonmetals, so the metalloids exhibit characteristics of both classes."}]