[{"url": "http://www.astro.umd.edu/resources/introastro/phases.html", "passage_text": "The phase of the Moon can tell you the time of day. For example, because a full Moon is seen when the Moon is on the opposite side of the Earth from the Sun, an observer on the Earth will see the Moon rise just as the Sun sets. In other words, the amount of the Moon that we can see changes over time in a cyclic period that repeats itself approximately once a month. (The actual period of this cycle is approximately 29.5 Earth days.) The cause of these phases is the relative positions of the Sun, Earth, and Moon."}, {"url": "http://www.answers.com/Q/The_amount_of_lighted_side_of_the_moon_you_can_see_is_the_same_during", "passage_text": "No. The amount of the Moon visible from the Earth varies, depending on the phase of the Moon. At Full Moon, you see nearly all of the Moon's illuminated side. At New Moon, y … ou see nearly none of it. At Quarter Moon, you see about half of it. The Moon orbits the Earth and also the Moon rotates on its axis. These two things take exactly the same time (due to gravitational effects). The result is that we always see t … he same sid"}, {"url": "http://www.weegy.com/?ConversationId=BAOCH45L&Link=i", "passage_text": "User: The amount of the lighted side of the moon you can see is the same during a. new moon and full moon phase. b. new moon and first quarter phase. c. first quarter and third quarter phase. d. full moon and third quarter phase. Weegy: When the Moon is on the same side of Earth as the Sun, we will see a B. new moon. The amount of the lighted side of the moon you can see is the same during a. new moon and full moon phase. b. new moon and first quarter phase. c. first quarter and third quarter phase. d. full moon."}, {"url": "http://www.weegy.com/?ConversationId=UEYL6UO9&Link=i", "passage_text": "The amount of the lighted side of the moon you can see is the same during a. new moon and full moon phase. b. new moon and first quarter phase. c. first quarter and third quarter. The amount of the lighted side of the moon you can see is the same during: first quarter and third quarter phase. Added 287 days ago|12/26/2014 11:14:34 AM. This answer has been confirmed as correct, not copied, and helpful. Confirmed by sujaysen [12/26/2014 11:55:39 AM]."}, {"url": "http://www.answers.com/Q/The_amount_of_lighted_side_of_the_moon_you_can_see_is_the_same_during", "passage_text": "Because the moon's periods of rotation on its  axis and of revolution around the Earth   are equal ... 27.32 days.    -- To an observer on Earth, the moon always p … resents the same face.    -- To an observer on the moon, the Earth is always at nearly the  same place in the sky. The Moon orbits the Earth and also the Moon rotates on its axis. These two things take exactly the same time (due to gravitational effects). The result is that we always see t … he same side of the Moon."}, {"url": "http://www.sems.und.edu/index_MoonPhases.php", "passage_text": "Since the lighted side is always only half of the Moon and since we can only see half of the lighted side, this is called the First Quarter (First Quarter the New Moon). Space view of First Quarter First Quarter as seen from Earth. During a Full Moon the Moon is on the same side of the Earth as we are. So, we can now see the entire lighted side of the Moon. Space view of Full Moon Full Moon as seen from Earth. So remember New Moon means dark Moon.. Space view of New Moon. New Moon as seen from Earth. During a First Quarter phase the Moon has moved along side the Earth and we can now see the lighted side of the Moon that is facing the Earth (remember the dark side of the Moon is too dark to see)."}, {"url": "http://www.weegy.com/?ConversationId=UEYL6UO9&Link=i", "passage_text": "User: The amount of the lighted side of the moon you can see is the same during a. new moon and full moon phase. b. new moon and first quarter phase. c. first quarter and third quarter phase. d. full moon and third quarter phase. Weegy: When the Moon is on the same side of Earth as the Sun, we will see a A. Full Moon. The amount of the lighted side of the moon you can see is the same during: first quarter and third quarter phase. Added 287 days ago|12/26/2014 11:14:34 AM. This answer has been confirmed as correct, not copied, and helpful. Confirmed by sujaysen [12/26/2014 11:55:39 AM]."}, {"url": "https://answers.yahoo.com/question/index?qid=20070329064316AAoF6oX", "passage_text": "Rating Newest Oldest. Best Answer: Has to be C. You see no light from a new moon You see 100% of the possible light from a full moon You see 50% of the light possible during the first and third quarter phases C is the only one that fits. Source(s): Bhajun Singh · 9 years ago. Thumbs up"}]