[{"url": "https://en.wikipedia.org/wiki/Biryani", "passage_text": "The spices and condiments used in biryani may include, but are not limited to, ghee (clarified butter), nutmeg, mace, pepper, cloves, cardamom, cinnamon, bay leaves, coriander, mint leaves, ginger, onions, and garlic."}, {"url": "http://www.wisegeek.com/what-is-biryani.htm", "passage_text": "Cardamom pods are often used to season biryani. Biryani is a popular Indian dish made with meat, rice, vegetables and spices. Turmeric, which is often included in biryani. Different types of rice, including basmati rice, which is typically used to make biryani. When vegetables are added to biryani, potatoes are usually included as well."}, {"url": "http://allrecipes.com/recipe/16102/chicken-biryani/", "passage_text": "Directions. 1  In a large skillet, in 2 tablespoons vegetable oil (or ghee) fry potatoes until brown, drain and reserve the potatoes. 2  Add remaining 2 tablespoons oil to the skillet and fry onion, garlic and ginger until onion is soft and golden."}, {"url": "http://allrecipes.com/recipe/16102/chicken-biryani/", "passage_text": "1 Add saffron, cardamom, cloves, cinnamon stick, ginger and rice. 2  Stir continuously until the rice is coated with the spices. 3  In a medium-size pot, heat the chicken stock and salt. 4  When the mixture is hot pour it over the rice and stir well. 5  Add the chicken mixture and the potatoes; gently mix them into the rice."}, {"url": "http://allrecipes.com/recipe/16102/chicken-biryani/", "passage_text": "1 In a large skillet, in 2 tablespoons vegetable oil (or ghee) fry potatoes until brown, drain and reserve the potatoes. 2  Add remaining 2 tablespoons oil to the skillet and fry onion, garlic and ginger until onion is soft and golden. 3  Add chili, pepper, turmeric, cumin, salt and the tomatoes."}, {"url": "http://www.indiacurry.com/faqterms/dfaqbiryanipilaf.htm", "passage_text": "Biryani in Farsi means 'fry before cooking'. To make Biryani, mutton is fried in ghee and par-cooked (Cooked half way). Separately, the Rice is fried in Ghee, and par-cooked (Cooked half way). The rice and meat were layered (cluster of rice on top of cluster of meat) in a cookware called Handi. The Handi is sealed with dough. It is Dum cooked (baked) on low heat."}]