[{"url": "http://www.huffingtonpost.com/marjorie-hansen-shaevitz/so-you-want-to-be-an-engi_b_5508385.html", "passage_text": "Thank you so much for taking the time to talk with me today. I learned so much that will be useful in deciding whether I want to become a mechanical engineer. I loved hearing about _____________ and also _____________. "}, {"url": "http://www.wisegeek.com/how-do-i-become-a-field-engineer.htm", "passage_text": "For example, to become a field engineer in the New Zealand army, a person needs to be 17 years old and have completed year 11 schooling, with an emphasis on English and mathematics courses. In Germany, a person may get a degree or can complete a rigorous apprenticeship. When a person is already a company employee, sometimes it is possible to become a field engineer by apprenticing with the senior field engineer. Usually, companies prefer to test a person's problem-solving skills before assigning a person to the field engineer job."}, {"url": "http://www.bls.gov/ooh/architecture-and-engineering/environmental-engineers.htm", "passage_text": "A bachelor’s degree is needed to become an environmental engineer. Environmental engineers must have a bachelor’s degree in environmental engineering or a related field, such as civil, chemical, or general engineering. Employers also value practical experience. Therefore, cooperative engineering programs, which provide college credit for structured job experience, are valuable as well. "}, {"url": "http://www.wisegeek.com/how-do-i-become-a-field-engineer.htm", "passage_text": "How you become a field engineer generally depends on the requirements of your prospective employer. In some countries, such as the United States and Germany, a person needs a degree or license to be an engineer, but other countries do not have the same requirements. When a person is already a company employee, sometimes it is possible to become a field engineer by apprenticing with the senior field engineer. Usually, companies prefer to test a person's problem-solving skills before assigning a person to the field engineer job."}, {"url": "http://study.com/articles/How_to_Become_a_Field_Service_Engineer.html", "passage_text": "Experience in this profession can lead to greater salary, more responsibility and possibly less travel. For example, according to Salary.com, in 2012 a field service engineer with 2-4 years of experience made about 15% more than an entry-level worker, as well as having more responsibility. As experience lengthened to 5-8 years, wages and creative latitude continued to increase. Show me 10 popular schools. Step 3: Be Comfortable Using a Mobile Office. Field service engineers may work off-site most of the time conducting routine repairs, maintaining equipment and showing customers how to use products. Frequent travel, often on very short notice, is therefore a hallmark of the profession"}, {"url": "http://www.payscale.com/research/US/Job=Field_Engineer%2c_Construction/Salary", "passage_text": "A Field Engineer, Construction earns an average salary of $60,122 per year. A skill in Engineering Design is associated with high pay for this job. Most people with this job move on to other positions after 20 years in this field. "}, {"url": "http://www.learnhowtobecome.org/computer-engineer/", "passage_text": "Learning how to become a computer engineer is the first step toward earning a more-than-comfortable salary. According to the Bureau of Labor Statistics, the median income for this profession was $108,430 in 2014, but the top-earners make more than $160,000. Salaries vary between regions and industries. Becoming a computer engineer requires an extensive college education that can take from four to seven years to complete. In the first two years of a bachelor’s degree program, students typically finish computer engineering prerequisites and general education courses."}, {"url": "http://www.wisegeek.com/how-do-i-become-a-field-engineer.htm", "passage_text": "Field engineers who work in manufacturing settings often have a background in mechanical engineering. In Germany, to become a field engineer a person may get a degree or complete an apprenticeship. Field engineers need good problem solving skills. When a person is already a company employee, sometimes it is possible to become a field engineer by apprenticing with the senior field engineer. Usually, companies prefer to test a person's problem-solving skills before assigning a person to the field engineer job."}]