[{"url": "https://discussions.apple.com/thread/5370392?start=15&tstart=0", "passage_text": "I opted to change the name of the old device to iPod, within the device, before opening iTunes on the Mac. To do so, first, put the 4s in Airplane Mode, and turn on Wi-Fi and Bluetooth. Later, when you open iTunes on your Mac you will see the button for 2 Devices, in my case 3 Devices including my iPad. 2. Change the name of the old phone in iTunes (click on the name of the old phone on the summary page). 4. On the same Message settings screen, Add another email (my daughter's in this case). I had to go in and verify it with Apple-it sends an email to facilitate this. Make sure the new email is checked."}, {"url": "http://www.zdnet.com/article/turn-your-iphone-into-an-ipod-touch/", "passage_text": "Fear not... Step 2) In the Wi-Fi settings, turn Wi-Fi back on. Don't touch the Airplane Mode button. Yes, Virginia, you can use your iPhone on the new WiFi-enabled airplane flights, without worrying about its cellular nature brining down the wrath of flight attendants and the FAA. A slick tip from bynkii.com solves the problem."}, {"url": "http://www.popsugar.com/tech/Turn-iPhone-iPod-Touch-31915752", "passage_text": "To get started using an old iPhone as an iPod Touch, insert a SIM card into the phone — be sure the card is from the same wireless carrier that the phone uses. Connect the iPhone to an Internet-enabled computer with iTunes. The program will activate the iPhone, letting you use it as an iPod Touch. If the SIM card used in the above activation is still active, you can remove it from the now iPod Touch and place it back in the device that will continue to be used as an iPhone."}, {"url": "http://www.youtube.com/watch?v=qR25dTIT1dg", "passage_text": "Download TextNow-http://bit.ly/cNR76N. In this video I will show you how to turn your iPod Touch into an iPhone with TextNow. This app will allow you to make phone calls, voicemail, call forwarding, text messages, picture messages and tons of more features. Visit the site-http://tysiphonehelp.com. Call me, text me, or send me a pic - 201-426-6177. "}, {"url": "http://www.wikihow.com/Turn-Off-Your-iPod-Classic", "passage_text": "Use the Play/Pause button. At the bottom of the wheel on your iPod, there is a Play icon. It is a triangle pointing right. 1  This button is also the Pause button. 2  You can tell because there are 2 vertical lines. 3  When the music is playing, press the Play/Pause button to start it. 2. Use the Play/Pause button. At the bottom of the wheel on your iPod, there is a Play icon. It is a triangle pointing right. 1  This button is also the Pause button. 2  You can tell because there are 2 vertical lines. 3  When the music is playing, press the Play/Pause button to start it. 4  Press it again to restart it."}, {"url": "http://www.cnet.com/how-to/turn-your-old-ipod-into-a-security-camera-for-free/", "passage_text": "Select Manything as your If and the Belkin WeMo Switch as your Then to create the following recipe: If my iPod Touch/iPad/iPhone detects motion, then turn my WeMo Switch on then off.. Colin West McDonald/CNET. 7. "}, {"url": "https://discussions.apple.com/thread/5370392?start=15&tstart=0", "passage_text": "Do a backup of the old phone with the new name, and then connect your new phone, and back it up under its current name. Level 1 (0 points). I JUST did this exact process-upgraded from an iPhone 4 to a 5s, and then turned the 4 into an iPod for my daughter. 1. Leave the old SIM in the old phone. 2. Change the name of the old phone in iTunes (click on the name of the old phone on the summary page). 4. On the same Message settings screen, Add another email (my daughter's in this case). I had to go in and verify it with Apple-it sends an email to facilitate this. Make sure the new email is checked."}, {"url": "http://www.macworld.com/article/1139659/ipod_portable_storage.html", "passage_text": "Enable your iPhone or iPod touch. Apple doesn’t allow you to enable disk use on an iPhone or iPod touch, but that doesn’t mean you can’t turn either into a portable storage device if it’s got space to spare. Here are a few iPhone apps that’ll turn your iPhone or iPod touch into a wireless (yes, wireless!) drive. If you set iTunes to automatically sync music to your iPod, you’ll need to enable disk use; connect your iPod to your Mac, open iTunes, and select your iPod in the Source pane under Devices. Click the Summary tab (or Settings tab for iPod shuffle) and then select the “Enable disk use” checkbox."}, {"url": "https://community.verizonwireless.com/thread/817195", "passage_text": "This is real simple. Plug the phone into your computer and use iTunes to reset the device. Once the device is reset just do NOT activate the phone and you have an iPod Touch. Just remember that every time you power the phone completely off it will give you the activation popup and simple hit cancel and you will have your iPOD Touch. "}, {"url": "http://www.wikihow.com/Turn-off-Your-iPod", "passage_text": "1. Try resetting it. On older iPods, press and hold the Menu and the Center button (in the middle of the wheel). This should reset your iPod. Once it is reset, you can power it down normally. 1  To reset an iPod Touch, press and hold the Power and Home buttons for about 10 seconds. 2  You will see the Apple logo and the device will reset. Toggle the Hold switch. This is located on the top of the iPod. Turning Hold on will keep your iPod from accidentally turning on if a button is pressed. Toggle the switch again to turn the iPod back on."}]