[{"url": "http://www.brighthub.com/environment/renewable-energy/articles/108446.aspx", "passage_text": "Chemical energy is a form of potential energy that can be stored in the bonds of chemical compounds. As soon as a chemical reaction takes place, the bonds among molecules break and release or absorb this energy, usually in the form of heat. If a reaction releases heat, it is exothermic."}, {"url": "http://www.answers.com/Q/What_is_the_most_common_form_of_renewable_energy", "passage_text": "Maybe solar or wind or water i dont know which is more common but i know these are quite common A2 at present hydro power is the biggest in countries that have it, otherwise w … ind power."}, {"url": "http://www.seia.org/about/solar-energy", "passage_text": "Solar energy is a flexible energy technology: solar power plants can be built as distributed generation (located at or near the point of use) or as a central-station, utility-scale solar power plant (similar to traditional power plants)."}, {"url": "http://www.answers.com/Q/What_is_the_most_common_form_of_renewable_energy", "passage_text": "Solar energy   the sun!    Wind.    Wind is the only source of electrical power, that cannot be  depleted. Solar energy would be a close second, but smog an … d other  pollution may make it an infeasible energy source."}, {"url": "http://extension.psu.edu/natural-resources/energy/solar-energy", "passage_text": "The sun is probably the most important source of renewable energy available today. Traditionally, the sun has provided energy for practically all living creatures on earth, through the process of photosynthesis, in which plants absorb solar radiation and convert it into stored energy for growth and development."}, {"url": "http://www.answers.com/Q/What_is_the_most_common_form_of_renewable_energy_used_to_generate_electricity", "passage_text": "Maybe solar or wind or water i dont know which is more common but i know these are quite common A2 at present hydro power is the biggest in countries that have it, otherwise wind power."}, {"url": "http://www.seia.org/about/solar-energy", "passage_text": "Solar power is energy from the sun that is converted into thermal or electrical energy. Solar energy is the cleanest and most abundant renewable energy source available, and the U.S. has some of the richest solar resources in the world."}, {"url": "http://www.altenergy.org/renewables/renewables.html", "passage_text": "Renewable Energy. There are many forms of renewable energy. Most of these renewable energies depend in one way or another on sunlight. Wind and hydroelectric power are the direct result of differential heating of the Earth's surface which leads to air moving about (wind) and precipitation forming as the air is lifted."}]