[{"url": "https://answers.yahoo.com/question/index?qid=20070605155308AAo7uOQ", "passage_text": "Best Answer: The grossest part about marshmallows is most are made with gelatin. And here is what gelatin is made out of: Gelatin is made from by-products of the meat and leather industry, mainly pork skins, pork and cattle bones, or split cattle hides. That is reason enough to never touch them!! Good for you! * Sugar or Corn Syrup * Egg whites * Gelatin-usually from animals bones or hides, Kosher gelatin is from fish There are Vegan marshmallows -- ones that use real marshmallow extract from the marshmallow plant or use gelatin alternatives."}, {"url": "https://en.wikipedia.org/wiki/Marshmallow", "passage_text": "A marshmallow is a sugar based confection that, in its modern form, typically consists of sugar, water and gelatin whipped to a spongy consistency, molded into small cylindrical pieces, and coated with corn starch. Some marshmallow recipes call for eggs. The use of marshmallow to make sweets dates back to ancient Egypt, where the recipe called for extracting sap from the plant and mixing it with nuts and honey. Another pre-modern recipe uses the pith of the marshmallow plant, rather than the sap."}, {"url": "http://foodreference.about.com/od/Ingredients_Basics/a/What-Are-Marshmallows.htm", "passage_text": "Modern marshmallows are a mixture of gelatin and egg whites that have been whipped into a foam and then combined with corn syrup, sugar, and sometimes vanilla or other flavorings. Marshmallows are usually coated in a mixture of corn starch and confectioners sugar to prevent their sugary surface from sticking. "}, {"url": "http://www.foodnetwork.com/recipes/alton-brown/homemade-marshmallows-recipe.html", "passage_text": "Directions. Place the gelatin into the bowl of a stand mixer along with 1/2 cup of the water. Have the whisk attachment standing by. In a small saucepan combine the remaining 1/2 cup water, granulated sugar, corn syrup and salt. Place over medium high heat, cover and allow to cook for 3 to 4 minutes. Turn the marshmallows out onto a cutting board and cut into 1-inch squares using a pizza wheel dusted with the confectioners' sugar mixture. Once cut, lightly dust all sides of each marshmallow with the remaining mixture, using additional if necessary."}, {"url": "http://www.tarses.com/blog/are-marshmallows-made-out-of-horse-hooves/", "passage_text": "No, they are not. Gelatin is a principle ingredient in marshmallows. A lot of people believe that the gelatin in marshmallows is made from from horse hooves, but that isn’t true. You can’t make marshmallows out of horse hooves; however, you can make glue out of horse hooves. Hoof glue was invented in ancient times and has been in continuous use for over 5,000 years. "}, {"url": "http://www.thekitchn.com/how-to-make-fluffy-vanilla-marshmallows-130751", "passage_text": "Marshmallows are surprisingly easy to make at home — they're made of just gelatin and a hot sugar syrup, and you can make a batch in the stand mixer in about 20 minutes. I do definitely recommend a stand mixer for this one. "}, {"url": "http://www.nytimes.com/2012/09/16/magazine/who-made-that-marshmallow.html", "passage_text": "A century ago, confectioners made marshmallows from a froth of sugar, starch and gelatin, in a laborious process that involved lots of primping. Each candy had to “sweat” for several hours to form its delicate skin, and then it was sprinkled with starch. "}, {"url": "http://www.madehow.com/Volume-3/Marshmallow.html", "passage_text": "History. Originally, however, marshmallows were made from the root sap of the marsh mallow (Althaea officinalis) plant. It is a genus of herb that is native to parts of Europe, north Africa, and Asia. Marsh mallows grow in marshes and other damp areas. The plant has a fleshy stem, leaves, and pale, five-petaled flowers"}]