[{"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Benign_Lung_Tumors", "passage_text": "1 Pulmonary nodules appear in about one of every 200 chest X-rays and most chest CT scans. 2  At least 60% of pulmonary nodules seen on chest X-rays turn out to be benign, and 99% of those on chest CT are benign. 3  Pulmonary nodules are much more commonly found than are lung cancers or benign lung tumors. 1 A way to tell the difference between a benign and malignant lung nodule is to chart the rate of growth of the nodule. 2  Benign nodules will grow very slowly, if at all, while cancerous nodules on average can double in size every four months or less."}, {"url": "http://www.webmd.com/lung/benign-lung-tumors-and-nodules", "passage_text": "The causes of benign lung tumors and nodules are poorly understood. But in general, they often result from problems like these: Inflammation from infections such as: 1  An infectious fungus (histoplasmosis, coccidioidomycosis, cryptococcosis, or aspergillosis, for example). 2  Tuberculosis (TB). 3  A lung abscess. "}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Benign_Lung_Tumors", "passage_text": "Hamartoma. There are a number of different kinds of benign lung tumors, the most common being hamartomas. They account for about 55% of all benign lung tumors, and 8% of all lung tumors. Characteristics of lung hamartomas: 1  About 80% are found in the peripheral, or outer, portion of the lung’s connective tissue. 1 A way to tell the difference between a benign and malignant lung nodule is to chart the rate of growth of the nodule. 2  Benign nodules will grow very slowly, if at all, while cancerous nodules on average can double in size every four months or less."}, {"url": "https://www.wehealny.org/services/BI_LungNoduleCenter/lung_nodules_cause.html", "passage_text": "Simply, a benign lung nodule is not cancerous. A benign nodule or mass will not spread to other areas of the body. However, the presence of benign nodules—especially if they are large—can cause health problems. Even benign lung nodules may have to be surgically treated and removed. The most common types of benign lung nodules include: Granulomas: Inflamed or infected tissue that has congealed into a globular or ball-like shape. Hamartomas: Calcifications and scarring within the lung. "}, {"url": "http://www.pssatl.com/lung-disease/lung-nodules/", "passage_text": "Lung nodules can be either benign (non-cancerous) or malignant (cancer). The most common causes of benign nodules include granulomas (clumps of inflamed tissue) and hamartomas (benign lung tumors). The most common cause of malignant lung nodules include lung cancer, or cancer from other regions of the body that has spread to the lungs (metastatic cancer)."}, {"url": "http://www.webmd.com/lung/benign-lung-tumors-and-nodules?page=2", "passage_text": "1 Hamartomas are the most common type of benign lung tumor and the third most common cause of solitary pulmonary nodules. 2  These firm marble-like tumors are made up of tissue from the lung's lining as well as tissue such as fat and cartilage. 3  They are usually located in the periphery of the lung. Birth defects such as a lung cyst or other lung malformation. These are some of the more common types of benign lung tumors: 1  Hamartomas are the most common type of benign lung tumor and the third most common cause of solitary pulmonary nodules."}, {"url": "http://www.mayoclinic.org/diseases-conditions/lung-cancer/expert-answers/lung-nodules/FAQ-20058445", "passage_text": "Yes, lung nodules can be cancerous, though most lung nodules are noncancerous (benign). Lung nodules — small masses of tissue in the lung — are quite common. They appear as round, white shadows on a chest X-ray or computerized tomography (CT) scan. Lung nodules are usually about 0.2 inch (5 millimeters) to 1.2 inches (30 millimeters) in size"}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Benign_Lung_Tumors", "passage_text": "1 Another way to tell a benign lung nodule from a malignant one is to test its calcification, or calcium content. 2  Benign nodules have higher calcium content and are normally smoother and more regularly shaped. 3  Benign nodules have a more even color pattern than malignant nodules. 1 A way to tell the difference between a benign and malignant lung nodule is to chart the rate of growth of the nodule. 2  Benign nodules will grow very slowly, if at all, while cancerous nodules on average can double in size every four months or less."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Pulmonary_Nodules", "passage_text": "Benign pulmonary nodules can have a wide variety of causes. Many are the result of inflammation in the lung as a result of an infection or disease producing inflammation in the body. The nodule may represent an active process or be the result of scar tissue formation related to prior inflammation. Benign developmental lesions may also appear as nodules."}]