[{"url": "http://bigcatrescue.org/tigers-evolved-with-snow-leopards-gene-study-reveals/", "passage_text": "Tigers are less closely related to lions, leopards and jaguars than these other big cats are to each other, according to a new comprehensive study. The genetic analysis also reveals the tiger began evolving 3.2 million years ago, and its closest living relative is the equally endangered snow leopard. The discovery comes as the BBC launches a collection of intimate videos of wild tigers and the threats they face. The ancestor of tigers and snow leopards also branched off around 3.9 million years ago. The tiger then began to evolve into a unique species toward the end of the Pliocene epoch, about 3.2 million years ago. That makes the tiger and snow leopard “sister species”, the researchers report in the journal Molecular Phylogenetics and Evolution"}, {"url": "http://news.bbc.co.uk/earth/hi/earth_news/newsid_8512000/8512455.stm", "passage_text": "Sumatran tigers caught on camera in the wild. That makes the tiger and snow leopard sister species, the researchers report in the journal Molecular Phylogenetics and Evolution. Both tigers and snow leopards are among the world's most endangered big cats. Fewer than 3500 tigers are thought to survive in the wild. The ancestor of tigers and snow leopards also branched off around 3.9 million years ago. The tiger then began to evolve into a unique species toward the end of the Pliocene epoch, about 3.2"}, {"url": "http://www.answers.com/Q/When_did_snow_leopards_evolve", "passage_text": "At lower elevations, the ancestors of leopards and tigers, and those species once they evolved, were better hunters and territory holders. It was safer for the early snow leopards to live in the mountains. No. Every leopard has a different pattern. Spotted leopards dont like black leopards. so they cant date the real term is mate. but snow leopards need to be where its cold hi … nt the word snow. and spotted leopards live in South Africa."}, {"url": "http://www.livescience.com/39695-tiger-lion-leopard-genome-sequenced.html", "passage_text": "To aid those efforts, Bhak and his colleagues sequenced the genome of a 9-year-old Amur tiger living in the Everland Zoo in South Korea. The team also acquired DNA from around the world and compared the Amur tiger genome with that of the white Bengal tiger, the African lion, the white African lion and the snow leopard. Those changes, which evolved over tens of millions of years, likely enable the majestic felines to digest and rely solely on meat, Bhak said. Big cats also have several mutations that make for powerful, fast-acting muscles — a necessity when chasing down prey."}, {"url": "https://en.wikipedia.org/wiki/Leopard", "passage_text": "The last common ancestor of the lion, tiger, leopard, jaguar, snow leopard, and clouded leopard is believed to have occurred about 6.37 million years ago. Panthera is believed to have emerged in Asia, with ancestors of the leopard and other cats subsequently migrating into Africa. A pumapard is a hybrid animal resulting from a mating between a leopard and a puma (a member of the Puma genus, not the Panthera genus). Three sets of these hybrids were bred in the late 1890s and early 1900s by Carl Hagenbeck at his animal park in Hamburg, Germany."}, {"url": "http://bigcatrescue.org/tigers-evolved-with-snow-leopards-gene-study-reveals/", "passage_text": "Tigers evolved with snow leopards, gene study reveals. By Matt Walker. Editor, Earth News. Page last updated at 14:24 GMT, Friday, 12 February 2010. Video At: http://news.bbc.co.uk/earth/hi/earth_news/newsid_8512000/8512455.stm. The tiger may be more ancient and distinct than we thought. The ancestor of tigers and snow leopards also branched off around 3.9 million years ago. The tiger then began to evolve into a unique species toward the end of the Pliocene epoch, about 3.2 million years ago. That makes the tiger and snow leopard “sister species”, the researchers report in the journal Molecular Phylogenetics and Evolution"}, {"url": "http://a-z-animals.com/animals/leopard/", "passage_text": "Leopard Classification and Evolution The Leopard is a medium-sized wildcat that is natively found in a variety of different habitats across sub-Saharan Africa and southern Asia. Some of the confusion is thought to come from the Black Panther which is a Leopard that has a completely black coat of fur, with occasional faint markings. Known as melanism, the genetic mutation that causes large amounts of a dark pigment to occur in the skin and fur is exhibited by a number of mammalian species."}, {"url": "http://www.livescience.com/39695-tiger-lion-leopard-genome-sequenced.html", "passage_text": "The biggest and perhaps most fearsome of the world's big cats, the tiger shares 95.6 percent of its DNA with humans' cute and furry companions, domestic cats. That's one of the findings from the newly sequenced genomes of tigers, snow leopards and lions. The new research showed that big cats have genetic mutations that enabled them to be carnivores. The team also identified mutations that allow snow leopards to thrive at high altitudes. Those changes, which evolved over tens of millions of years, likely enable the majestic felines to digest and rely solely on meat, Bhak said. Big cats also have several mutations that make for powerful, fast-acting muscles — a necessity when chasing down prey."}]