[{"url": "http://www.lenntech.com/periodic/symbol/symbol.htm", "passage_text": "The elements of the periodic table sorted by symbol. click on any element's name for further chemical properties, environmental data or health effects. This list contains the 118 elements of chemistry. For chemistry students and teachers: The tabular chart on the right is arranged by the symbol. The first chemical element is Actinium and the last is Zirconium. Please note that the elements do not show their natural relation towards each other as in the Periodic system."}, {"url": "http://chemistry.about.com/od/elementfacts/a/elementsymbols.htm", "passage_text": "For these elements, the symbol usually refers to an older element name that isn't used any more. Here's an alphabetical list of element symbols with the corresponding element name. Keep in mind that the names for the elements (and their symbols) may be different in languages other than English. By Anne Marie Helmenstine, Ph.D."}, {"url": "http://www.bbc.co.uk/bitesize/ks3/science/chemical_material_behaviour/atoms_elements/revision/3/", "passage_text": "Chemical symbols. Each element is given its own chemical symbol, like O for oxygen and Cl for chlorine. Chemical symbols are usually one or two letters long, but sometimes three letters are used. Every chemical symbol starts with a capital letter, with the second or third letters written in lower case. For example, Mg is the correct symbol for magnesium, but mg, mG and MG are wrong"}, {"url": "http://chemistry.wikia.com/wiki/List_of_elements_by_symbol", "passage_text": "List of elements by symbol. 189 pages on this wiki. This is a list of chemical elements by symbol, including the current symbols used to identify the chemical elements as recognized by the International Union of Pure and Applied Chemistry, as well as proposed and historical symbols. Also given is each element's atomic number, atomic mass or most stable isotope, group and period numbers on the periodic table, and origin of the symbol if not obvious from the current name of the element."}, {"url": "http://www.bbc.co.uk/bitesize/ks3/science/chemical_material_behaviour/compounds_mixtures/revision/4/", "passage_text": "Remember that we use chemical symbols to stand for the elements. For example, C stands for carbon, O stands for oxygen, S stands for sulphur and Na stands for sodium. For a molecule we use the chemical symbols of the atoms it contains to write down its formula. For example the formula for carbon monoxide is CO. It tells you that each molecule of carbon monoxide consists of one carbon atom joined to one oxygen atom."}, {"url": "http://www.answers.com/Q/What_is_chemical_symbol_of_C", "passage_text": "The symbol for the element iron is Fe. Ferrous is the latin for Iron-Fe is the abbreviated letters for this latin word. Hence the chemical symbol for iron is Fe from its lat … in origination. Fe is the abbreviation for ferrum, which is Latin for iron. The word also gives us ferrous meaning containing iron. It comes from the Latin as in ferrous etc."}, {"url": "https://en.wikipedia.org/wiki/Symbol_%28chemistry%29", "passage_text": "In chemistry, a symbol is a code for a chemical element. It is usually derived from the name of the element, often in Latin. This is an example of an atomic symbol. The text boxes explain where the numbers are derived from. For example, He is the symbol for helium (English name, not known in ancient Roman times), Pb for lead (plumbum in Latin), W for tungsten (wolfram in German, not known in Roman times). Only the first letter is capitalized."}, {"url": "https://en.wikipedia.org/wiki/Chemical_formula", "passage_text": "A chemical formula is a way of expressing information about the proportions of atoms that constitute a particular chemical compound, using a single line of chemical element symbols, numbers, and sometimes also other symbols, such as parentheses, dashes, brackets, commas and plus (+) and minus (−) signs. A chemical formula identifies each constituent element by its chemical symbol and indicates the proportionate number of atoms of each element. In empirical formulas, these proportions begin with a key element and then assign numbers of atoms of the other elements in the compound, as ratios to the key element."}]