[{"url": "http://www.oxforddictionaries.com/definition/english/cloven-hoof", "passage_text": "1 Artiodactyls are characterized by the presence of two enlarged toes forming a cloven hoof; the hoof of a goat or cow is anatomically the enlarged third and fourth toes. 1. cloven-footed. Example sentences. 1  But the ‘Devil’ revealed here is not the cloven-footed demon of medieval folklore, nor yet his murderous human servants. 2  The disease can spread at an alarming rate and affects all cloven-footed animals, including cattle, sheep, goats and deer."}, {"url": "http://www.collinsdictionary.com/dictionary/english/cloven-hoof", "passage_text": "cloven hoof or or cloven foot. 1  the divided hoof of a pig, goat, cow, deer, or related animal, which consists of the two middle digits of the foot. noun"}, {"url": "http://www.thefreedictionary.com/cloven+hooves", "passage_text": "n. 1. A divided or cleft hoof, as in deer or cattle. Also called cloven foot. 2. Evil or Satan, often depicted as a figure with cleft hooves."}, {"url": "https://en.wikipedia.org/wiki/Cloven_hoof", "passage_text": "A cloven hoof is a hoof split into two toes. This is found on members of the mammalian order Artiodactyla. Examples of mammals that possess this type of hoof are cattle, deer, goats, and sheep. In folklore and popular culture, a cloven hoof has long been associated with the Devil. The two digits of cloven hoofed animals are homologous to the third and fourth fingers of the hand. They are called claws and are named for their relative location on the foot: the outer, or lateral, claw and the inner, or medial claw."}, {"url": "http://www.thefreedictionary.com/cloven+hoof", "passage_text": "cloven hoof. n. 1. (Zoology) the divided hoof of a pig, goat, cow, deer, or related animal, which consists of the two middle digits of the foot. 2. the mark or symbol of Satan. n. Also called clo′ven foot′. n. 1. A divided or cleft hoof, as in deer or cattle. Also called cloven foot. 2. Evil or Satan, often depicted as a figure with cleft hooves."}, {"url": "http://www.oxforddictionaries.com/definition/english/cloven-hoof", "passage_text": "noun. 1 The divided hoof or foot of ruminants such as cattle, sheep, goats, and deer. Example sentences. 1  Artiodactyls are characterized by the presence of two enlarged toes forming a cloven hoof; the hoof of a goat or cow is anatomically the enlarged third and fourth toes. 1. cloven-footed. Example sentences. 1  But the ‘Devil’ revealed here is not the cloven-footed demon of medieval folklore, nor yet his murderous human servants. 2  The disease can spread at an alarming rate and affects all cloven-footed animals, including cattle, sheep, goats and deer."}, {"url": "http://www.thefreedictionary.com/cloven+hooves", "passage_text": "cloven hoof. n. 1. (Zoology) the divided hoof of a pig, goat, cow, deer, or related animal, which consists of the two middle digits of the foot. 2. the mark or symbol of Satan. n. Also called clo′ven foot′. 1. A divided or cleft hoof, as in deer or cattle. Also called cloven foot. 2. Evil or Satan, often depicted as a figure with cleft hooves."}, {"url": "http://www.merriam-webster.com/dictionary/cloven%20hoof", "passage_text": "Full Definition of CLOVEN HOOF. 1. : a foot (as of a sheep) divided into two parts at its distal extremity. 2. [from the traditional representation of Satan as cloven-hoofed] : the sign of devilish character. — clo·ven–hoofed \\ˈklō-vən-ˌhu̇ft, -ˌhueft, -ˌhüft, -ˌhu̇vd\\ ˌhuevd. ˌhüvd adjective Definition of CLOVEN HOOF for Kids. : a hoof (as of a sheep or cow) with the front part divided into two sections."}]