[{"url": "http://www.wdwradio.com/2012/02/disney-college-program-the-application-process/", "passage_text": "The application process for the Disney College Program is fairly simple! When I was preparing to apply, I went to the College Program website and looked up the requirements for the program to make sure that I was eligible. The two main requirements are: that you are at least 18 years old, and that you must be enrolled in a college or university at the time that you apply. When I got back from Florida with my family, it was July and I was getting ready to start school in August and I officially met all of the requirements for the program! Thank you so much for posting this! I recently interviewed for the disney college program and got the pending email from them. When I did I felt like this was just a polite pre-notice to my future email that would say I am not accepted but thank you for explaining it’s just basically a waiting list."}, {"url": "http://www.xmms.org/qna/How_long_does_it_take_to_hear_a_response_for_the_disney_college_program-qna1132658.html", "passage_text": "1 56% - What day of the week did you hear back from disney college program? 2  66% - How long to you know if you got the job for the disney college program? 3  83% - How long does it take to get an answer from disney college program? 4  85% - How long did it take to get a decision from the disney college program? 1 61% - How long before disney college program accepts you? 2  79% - How long does it take to recieve notice from disney college program? 3  65% - How long did it take to recieve an answer from the college disney program? 4  81% - How long does it take to get called back for"}, {"url": "https://disneyprogramsblog.com/the-waiting-game/", "passage_text": "Hi Kristin, 2-3 weeks is a general time frame. If you don’t have an update by Monday and if you do not see any type of update on your dashboard, it is OK to send an email to wdw.college.recruiting@disney.com. Include your full name, the email address used on your application, and the date of your interview. "}, {"url": "http://www.themainstreetmoms.com/2015/01/22/disney-college-program-inside-look/", "passage_text": "How did you hear about the Disney College Program (DCP)? I first heard about the DCP through social media, I follow many Disney pages on my Facebook account. One of my friends had applied and encouraged me to as well since we both share such a profound love of Disney. Not one single person hears back in the same amount of time. You could apply the first day and not hear back until the last day, or you could apply in the middle of applications and hear back that same week. It seems truly random and up to the Disney College Program folks."}, {"url": "http://www.tipsfromthedisneydiva.com/2013/06/17/getting-into-the-disney-college-program/", "passage_text": "So you want to try and join the thousands who have experienced the Disney College Program, but you aren’t sure how to do that. First off, follow this link to get email notifications on when the applications open and to get other random updates on the program. Once the applications are open the process is fairly simple. They want you to succeed as much as you do so do your best to present you. Try and be prepared so you don’t have a lot of verbal static (ei. um, ah, oh) but don’t go crazy over this either. After your interview the general rule is that you will hear back within 2-3 weeks."}, {"url": "https://answers.yahoo.com/question/index?qid=20091007065346AA5J0ha", "passage_text": "Report Abuse. The only students I know of who've actually got into this program were interviewed by Disney recruiters ON-CAMPUS. So... My best suggestion to you would be to find out where the recruiters are going to visit and for you to make a special trip to meet with a representative. Na · 6 years ago. Best Answer: I wasn't part of the program, so I don't know directly, but http://www.wdwcollegeprogram.com/sap/its... has lots of answers."}, {"url": "http://dlrcp.tumblr.com/", "passage_text": "After you do your phone interview, Disney will notify you by phone, e-mail or standard mail. Disney tells different people different time frames as to when they will hear back, but it generally is 2 – 3 weeks after the date of your phone interview. I personally found out 10 days after my phone interview, but I have heard of people not being notified at all."}, {"url": "http://www.themainstreetmoms.com/2015/01/22/disney-college-program-inside-look/", "passage_text": "Does your college have to participate or is it open to all students? The Disney College Program is open to any student attending college who is at least 18 years of age and has successfully completed one semester. Not one single person hears back in the same amount of time. You could apply the first day and not hear back until the last day, or you could apply in the middle of applications and hear back that same week. It seems truly random and up to the Disney College Program folks."}, {"url": "http://www.magicalkingdoms.com/blog/2011/07/13/applying-for-the-disney-college-program/", "passage_text": "So you’re in college or have a child who is and they (or you) have always wanted to work for Disney. The Disney College Program (DCP) makes that nice and easy. The first thing to do is to head to the College Program Website (http://www.wdwcollegeprogram.com) to see if there will be a live presentation for you. If not, no fear, you can view the online presentation. "}, {"url": "http://askacm.tumblr.com/post/9959236759/disney-college-program-tip-2-phone-interview", "passage_text": "1 You can also drop them an email after the interview is over. 2  Requesting a specific location doesn’t guarantee you’ll get it by any means, but they will make note of it and take it into account when placing you. 3  Don’t be afraid to show how enthusiastic you are about Disney and about getting into the College Program. 1 Don’t be afraid to show how enthusiastic you are about Disney and about getting into the College Program. 2  Enthusiasm is great. 3  If you’re a complete and total dork for everything Disney and you’ve been dreaming of getting this job since you were five years old, then tell them that!"}]