[{"url": "http://volcanoes.usgs.gov/observatories/cvo/Historical/volcano_names.shtml", "passage_text": "1 Mount Adams, Washington. 2  Mount Adams was named after the 2nd President of the United States, John Adams, a mistake in a scheme by Hall J. Kelly to call the Cascade Range the Presidents Range. 1 In the 1830s Hall J. Kelley proposed naming the volcanoes of the Cascades the Presidents Range, with each of the peaks bearing the name of a U.S. President."}, {"url": "https://en.wikipedia.org/wiki/North_Cascades", "passage_text": "The North Cascades are a section of the Cascade Range of western North America. They span the border between the Canadian province of British Columbia and the U.S. state of Washington and are officially named in the U.S. as the Cascade Mountains. Sometimes the term North Cascades or northern Cascades is used for the entire range north of the Columbia River. Geologically, the rocks of the North Cascades extend south beyond Stevens Pass and west into the San Juan Islands."}, {"url": "https://en.wikipedia.org/wiki/Cascade_Range", "passage_text": "The latter term is also sometimes used by Washington residents to refer to the Washington section of the Cascades in addition to North Cascades, the more usual U.S. term, as in North Cascades National Park. The highest peak in the range is Mount Rainier in Washington at 14,411 feet (4,392 m). The Cascades extend northward from Lassen Peak (also known as Mount Lassen) in northern California to the confluence of the Nicola and Thompson rivers in British Columbia. The Fraser River separates the Cascades from the Coast Mountains."}, {"url": "https://en.wikipedia.org/wiki/Cascade_Range", "passage_text": "The Cascade Range or Cascades is a major mountain range of western North America, extending from southern British Columbia through Washington and Oregon to Northern California. It includes both non-volcanic mountains, such as the North Cascades, and the notable volcanoes known as the High Cascades. The small part of the range in British Columbia is referred to as the Canadian Cascades or, locally, as the Cascade Mountains. The Cascades extend northward from Lassen Peak (also known as Mount Lassen) in northern California to the confluence of the Nicola and Thompson rivers in British Columbia. The Fraser River separates the Cascades from the Coast"}, {"url": "https://en.wikipedia.org/wiki/Cascade_Range", "passage_text": "The northern part of the range, north of Mount Rainier, is known as the North Cascades in the United States but is formally named the Cascade Mountains north of the Canada–United States border, reaching to the northern extremity of the Cascades at Lytton Mountain. The Cascades extend northward from Lassen Peak (also known as Mount Lassen) in northern California to the confluence of the Nicola and Thompson rivers in British Columbia. The Fraser River separates the Cascades from the Coast Mountains."}, {"url": "http://geomaps.wr.usgs.gov/parks/noca/nocageol1.html", "passage_text": "The North Cascade Range in Washington State is part of the American Cordillera, a mighty mountain chain stretching more than 12,000 miles from Tierra del Fuego to the Alaskan Peninsula, and second only to the Alpine-Himalayan chain in height and grandeur. Rocks of the North Cascades record at least 400 million years (see geologic time) in the history of this restless Earth-time enough to have collected a jumble of different rocks."}, {"url": "http://volcanoes.usgs.gov/observatories/cvo/Historical/volcano_names.shtml", "passage_text": "1 Mount Adams was named after the 2nd President of the United States, John Adams, a mistake in a scheme by Hall J. Kelly to call the Cascade Range the Presidents Range. 2  Mount Baker, Washington. 1 In the 1830s Hall J. Kelley proposed naming the volcanoes of the Cascades the Presidents Range, with each of the peaks bearing the name of a U.S. President."}, {"url": "http://tellurianstudies.weebly.com/geology-how-the-cascade-mountains-were-formed.html", "passage_text": "The High Cascades is of volcanic origin and has many prominent volcanoes. In the state of Oregon there is a volcanic region that is known as the Western Cascades. The Canadian region is known as the Canadian Cascades or the Cascade Mountains. Other names may be used in other regions. The Cascade Mountain range of North America is part of the Pacific Northwest section of what is often called the “Pacific Ring of Fire“ that circles around the Pacific Ocean. The range first began forming millions of years ago through movement of the earth’s plate and volcanic action with erosion also playing a part."}, {"url": "http://www.infoplease.com/encyclopedia/us/cascade-range.html", "passage_text": "Cascade Range, mountain chain, c.700 mi (1,130 km) long, extending S from British Columbia to N Calif., where it becomes the Sierra Nevada; it parallels the Coast Ranges, 100–150 mi (161–241 km) inland from the Pacific Ocean. Many of the range's highest peaks are volcanic cones, covered with snowfields and glaciers. More on Cascade Range from Infoplease: 1  Cascade Range: meaning and definitions-Cascade Range: Definition and Pronunciation. 2  Shasta: meaning and definitions-Shasta"}, {"url": "http://ncascades.org/discover/north-cascades-ecosystem/natural-history", "passage_text": "Elevations in the GNCE range from sea-level at Puget Sound to 10,778 feet at Mount Baker. It is characteristic of the North Cascades that these two vastly different places are separated by only 30 miles. The highest peaks are the only two volcanoes in the region: Mount Baker and Glacier Peak (10,541 feet). The highest non-volcanic peaks range from 8,000 to 9,500 feet"}]