[{"url": "http://www.usatoday.com/story/money/business/2014/07/21/mcdonalds-kfc-china-scandal/12929885/", "passage_text": "China supplier sold McDonald's, KFC expired meat. Another food safety scare has hit Yum Brands and McDonald's in China. The news comes one day before McDonald's reports its earnings. Fred Katayama reports. BEIJING (AP) — McDonald's and KFC in China faced a new food safety scare Monday after a Shanghai television station reported a supplier sold them expired beef and chicken. Post to Facebook."}, {"url": "http://www.newindianexpress.com/world/Fried-Rat-is-Pure-White-Chicken-Meat-KFC/2015/06/18/article2873357.ece", "passage_text": "Kentucky Fried Chicken released a statement worldwide after a customer in US claimed that he found a deep fried rat in his takeaway. This image is from the US and is unrelated to KFC in India. However, according to KFC’s statement, “A customer has made a serious claim against KFC in the US and refuses to cooperate in the investigation. The images the customer originally posted do not include this second angle because it clearly shows it’s a piece of hand-breaded white meat chicken."}, {"url": "http://www.usatoday.com/story/money/business/2014/07/21/mcdonalds-kfc-china-scandal/12929885/", "passage_text": "BEIJING (AP) — McDonald's and KFC in China faced a new food safety scare Monday after a Shanghai television station reported a supplier sold them expired beef and chicken. The companies said they immediately stopped using meat from the company, Husi Food Co., Ltd. BEIJING (AP) — McDonald's and KFC in China faced a new food safety scare Monday after a Shanghai television station reported a supplier sold them expired beef and chicken. Post to Facebook."}, {"url": "http://uncyclopedia.wikia.com/wiki/Kentucky_Fried_Chicken", "passage_text": "Kentucky Fried Chicken or KFC, it is no longer allowed under United States law to be called so. However the phrase nobody fucks chickens like Kentucky Fucks Chickens was allowed in abbreviated form. "}, {"url": "https://en.wikipedia.org/wiki/KFC", "passage_text": "KFC's original product is pressure fried chicken pieces, seasoned with Sanders' recipe of 11 herbs and spices. The constituents of the recipe represent a notable trade secret. Sanders identified the potential of the restaurant franchising concept, and the first Kentucky Fried Chicken franchise opened in Utah in 1952. KFC popularized chicken in the fast food industry, diversifying the market by challenging the established dominance of the hamburger."}, {"url": "https://en.wikipedia.org/wiki/KFC", "passage_text": "KFC (short for Kentucky Fried Chicken) is a fast food restaurant chain that specializes in fried chicken and is headquartered in Louisville, Kentucky, in the United States. Sanders identified the potential of the restaurant franchising concept, and the first Kentucky Fried Chicken franchise opened in Utah in 1952. KFC popularized chicken in the fast food industry, diversifying the market by challenging the established dominance of the hamburger."}, {"url": "http://www.usatoday.com/story/money/business/2014/07/21/mcdonalds-kfc-china-scandal/12929885/", "passage_text": "China supplier sold McDonald's, KFC expired meat. BEIJING (AP) — McDonald's and KFC in China faced a new food safety scare Monday after a Shanghai television station reported a supplier sold them expired beef and chicken. Post to Facebook."}, {"url": "https://en.wikipedia.org/wiki/Double_Down_%28sandwich%29", "passage_text": "It is also available with grilled chicken fillets instead of the Original Recipe fried fillets, and with KFC's Zinger fillets (spicy) to customers in select countries. KFC describes the Double Down as a  sandwich  although it does not have bread. "}, {"url": "http://money.cnn.com/2014/07/21/news/companies/kfc-mcdonalds-china/index.html", "passage_text": "An American-owned meat factory operating in China has been accused of selling out-of-date and tainted meat to clients including McDonald's (MCD) , Starbucks (SBUX) and Yum Brands (YUM) , which owns the KFC and Pizza Hut chains. "}, {"url": "http://www.snopes.com/food/tainted/kfc.asp", "passage_text": "Claim: The government forced KFC to stop using the word 'chicken' because they serve meat from mutant animals. "}]