[{"url": "http://www.marijuana.com/community/threads/can-i-donate-plasma.234664/", "passage_text": "Oh yeah,and if you do it for a while,be sure to swap donating arms,I used my right for the majority of my donor time and they always hit me in the same spot,so now I have a not-so-sweet track-mark on my arm and it looks terrible. My old schedule: Wake up,eat breakfast, go to plasma lab,buy a dub,toke up,take a nap. Yeah-i've donated with four total different companies and they were all the same. They ony test for drugs that can be harmful by being transfered through the plasma, and pot's just not that way. Hell,it's relatively harmless. I wish I could still donate,but I got banned after not waiting long enough after taking some lortabs for a toothache"}, {"url": "http://www.mayoclinic.org/patient-visitor-guide/minnesota/blood-donor-program/faq", "passage_text": "1 You can donate whole blood as often as every 84 days at the Mayo Clinic Blood Donor Center in Rochester. 2  Plasma donors may donate as often as every 28 days. 3  Platelets donors may donate as frequently as every eight days, and up to 24 times in a 12-month period. Donors must weigh at least 110 pounds and be at least 17 years old. In Minnesota, 16-years-olds may donate with written consent from a parent or guardian. During your donation appointment, you will complete a brief health questionnaire to make sure blood donation is safe for you and the recipient of your blo"}, {"url": "https://answers.yahoo.com/question/index?qid=20071125213217AAZ8f1G", "passage_text": "Report Abuse. i used to smoke and donate plasma regularly (not at the same time but in the week). they don't care. they only care about stuff like your heart rate and your iron content and things like that. also, if you have any sort of blood borne disease you can't donate. Best Answer: It will not show up. They wont even check for it. The worst case scenerio if they do find it they can not legally do anything to you or tell anyone else. second hand smoke is probably not enough to even show up on a drug test. quit worrying."}, {"url": "http://www.themedicalquestions.com/drug/can-you-donate-plasma-if-you-smoke-weed.html", "passage_text": "I know now that you can donate blood if you smoke, just dont go in high, but I was wondering if it was different for platelets/plasma. A: it would probably be better to call and ask at the clinic than to trust any of these yahoos. "}, {"url": "http://octapharmaplasma.com/donor/plasma-donation-faq", "passage_text": "You can donate twice a week. The U.S. Food and Drug Administration (FDA) allows 2 donations within a 7-day period, with at least 2 days between donations. So if you donate on a Monday, you can donate again Wednesday. Drink plenty of water after you donate to help your body replace fluids."}, {"url": "http://www.experienceproject.com/question-answer/Do-U-Really-Have-To-Be-Drug-Free-To-Donate-Plasma/135226", "passage_text": "Sounds like your wound up so tight you need to go smoke a J!! First of all it's not blood your donating, yes they take your blood out and remove the plasma which is fill of platelets and are vital to a variety of very sick people!!! I'm pretty sure if the pot was in anyway dangerous they would not allow donations! The only other medicine I can afford that works is Marijuana. It is legal in California for medicinal use, which is what I use it for. And I find it hard to afford that. So, yes, I would like to donate my plasma to help with the cost of my medicines which the govenment decides they don't want to cover anymore."}, {"url": "http://www.cbcc.us/donate-blood/blood-donation-faqs", "passage_text": "Aspirin is fine to take if you are donating whole blood or double red cells.To be eligible to donate platelets, you cannot take any Aspirin, Ibuprofen or drugs with aspirin-like compounds for 48 hours before your donation. Red blood cells are the oxygen carrying cells. They can take two weeks or longer to fully return to normal. You can donate platelets (apheresis donation) every two weeks – up to 24 times in 12 months. Platelet and plasma components are regenerated in the body more quickly than"}, {"url": "https://answers.yahoo.com/question/index?qid=20071125213217AAZ8f1G", "passage_text": "They don't test plasma for drugs. If you don't smoke it yourself, the amount would be so minimal it may not even show up on a drug screen. You don't have anything to worry about. Source(s): I work in a blood bank. Best Answer: It will not show up. They wont even check for it. The worst case scenerio if they do find it they can not legally do anything to you or tell anyone else. second hand smoke is probably not enough to even show up on a drug test. quit worrying."}]