[{"url": "http://medical-dictionary.thefreedictionary.com/Pain+receptors", "passage_text": "Pain is an unpleasant feeling that is conveyed to the brain by sensory neurons. The discomfort signals actual or potential injury to the body. However, pain is more than a sensation, or the physical awareness of pain; it also includes perception, the subjective interpretation of the discomfort. an unpleasant sensation caused by noxious stimulation of the sensory nerve endings. It is a subjective feeling and an individual response to the cause. Pain is a cardinal symptom of inflammation and is valuable in the diagnosis of many disorders and conditions."}, {"url": "http://www.wisegeek.org/what-are-pain-receptors.htm", "passage_text": "Top 10 amazing movie makeup transformations. A pain receptor is a type of nerve cell that is primarily responsible for receiving and then transmitting stimulation signals from various nerve endings to the brain, which will typically interpret then as pain. If a drug inhibits the release of second messengers, then the pain receptors will not be activated, the pain impulse will not reach the brain, and the person will not perceive pain from the damaged tissue. The same thing happens if the brain’s response is delayed or neutralized."}, {"url": "https://en.wikipedia.org/wiki/Nociceptor", "passage_text": "A nociceptor is a sensory neuron (nerve cell) that responds to potentially damaging stimuli by sending signals to the spinal cord and brain. This process, called nociception, usually causes the perception of pain. Nociceptors were discovered by Charles Scott Sherrington in 1906. In earlier centuries, scientists believed that animals were like mechanical devices that transformed the energy of sensory stimuli into motor responses."}, {"url": "http://www.wisegeek.org/what-are-pain-receptors.htm", "passage_text": "Pain receptors on A-delta fibers are activated in response to sharp, well-localized pain that requires an immediate reaction. This type of painful stimulus is sometimes referred to as “somatic pain,” and it usually involves damage to skin or muscle. If a drug inhibits the release of second messengers, then the pain receptors will not be activated, the pain impulse will not reach the brain, and the person will not perceive pain from the damaged tissue. The same thing happens if the brain’s response is delayed or neutralized."}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/P/Pain.html", "passage_text": "The Receptors. Few, if any, of the receptors of heat, cold, and pain are specialized transducers (in the way that, for example, the Pacinian corpuscle is). Rather they are sensory neurons whose plasma membrane contains transmembrane proteins that are ion channels that open in response to particular stimuli. "}, {"url": "http://medical-dictionary.thefreedictionary.com/pain+receptor", "passage_text": "pain receptor, any one of the many free nerve endings throughout the body that warn of potentially harmful changes in the environment, such as excessive pressure or temperature. They also appear in the stratified squamous epithelium of the cornea, in the root sheaths and the papillae of the hairs, and around the bodies of sudoriferous glands. The terminal ends of pain receptors consist of unmyelinated nerve fibers that often anastomose into small knobs between the epithelial cells."}, {"url": "http://www.ncbi.nlm.nih.gov/books/NBK10965/", "passage_text": "Moreover, nociceptors, like other somatic sensory receptors, arise from cell bodies in dorsal root ganglia (or in the trigeminal ganglion) that send one axonal process to the periphery and the other into the spinal cord or brainstem (see Figure 9.1). Nociceptors. The relatively unspecialized nerve cell endings that initiate the sensation of pain are called nociceptors (noci-is derived from the Latin for “hurt”) (see Figure 9.2)."}, {"url": "http://calder.med.miami.edu/pointis/typepain.html", "passage_text": "Somatic and visceral pain are easier to treat than neuropathic pain. Somatic Pain. Somatic pain is caused by the activation of pain receptors in either the body surface or musculoskeletal tissues. A common cause of somatic pain in SCI persons is postsurgical pain from the surgical incision. It is usually described as dull or aching. "}, {"url": "http://www.wisegeek.org/what-are-pain-receptors.htm", "passage_text": "By contrast, the C-sensory pain fibers have receptors that are activated in response to dull, aching, or poorly localized pain stimuli. These pain fibers are unmyelinated, and as a result nerve impulses are generally transmitted more slowly. If a drug inhibits the release of second messengers, then the pain receptors will not be activated, the pain impulse will not reach the brain, and the person will not perceive pain from the damaged tissue. The same thing happens if the brain’s response is delayed or neutralized."}, {"url": "http://neuroscience.uth.tmc.edu/s2/chapter06.html", "passage_text": "Nociceptors are sensory receptors that detect signals from damaged tissue or the threat of damage and indirectly also respond to chemicals released from the damaged tissue. Nociceptors are free (bare) nerve endings found in the skin (Figure 6.2), muscle, joints, bone and viscera. "}]