[{"url": "https://www.sharecare.com/health/functions-of-skin/what-do-sebaceous-glands-do", "passage_text": "Sebaceous glands produce oil called sebum that moves up hair follicles to the surface of the skin, where the oil lubricates skin and hair. The gland may keep producing oil when the opening is blocked, leading to a pimple. Watch the animation to learn more about sebaceous glands. Sebaceous glands produce an oil called sebum, which is thought to play a role in keeping your skin moist. Sebaceous glands are located next to individual hairs in sebaceous follicles. The hormones that cause body changes at puberty also cause the sebaceous glands to produce more oil"}, {"url": "http://www.merriam-webster.com/medical/sebaceous%20gland", "passage_text": "Medical Definition of SEBACEOUS GLAND. : any of the small sacculated glands lodged in the substance of the derma, usually opening into the hair follicles, and secreting an oily or greasy material composed in great part of fat which softens and lubricates the hair and skin. "}, {"url": "http://www.healthgrades.com/conditions/sebaceous-cyst", "passage_text": "A sebaceous cyst is a type of cyst that forms in the epidermis, the outermost layer of the skin. A sebaceous cyst is also sometimes called an epidermal cyst. It forms when a sebaceous gland, an oil-producing gland in the skin, becomes blocked. This creates a sac that fills with a fatty yellow substance that can resemble cottage cheese. "}, {"url": "http://www.healthline.com/health/sebaceous-cyst", "passage_text": "Causes of a Sebaceous Cyst. Sebaceous cysts form out of your sebaceous gland—which produces the oil called sebum that coats your hair and skin. Cysts can develop if the gland or its duct, the passage where oil is able to leave, become damaged or blocked. This usually occurs due to a trauma to the area"}, {"url": "http://www.petplace.com/article/dogs/diseases-conditions-of-dogs/skin/sebaceous-cysts-in-dogs", "passage_text": "A sebaceous cyst is a small sac containing an accumulation of secretions produced by the sebaceous glands that can occur in dogs. Sebaceous cysts are also known as epidermoid cysts, epidermal inclusion cysts, epidermal cysts, and wens. The sebaceous glands produce an oily substance called sebum, which lubricates the skin. The ducts of the sebaceous glands empty into hair follicles. The development of sebaceous cysts is thought to arise from an obstruction of the follicles, leading to abnormal accumulations of sebum."}, {"url": "https://en.wikipedia.org/wiki/Sebaceous_gland", "passage_text": "In humans, they are found in the greatest number on the face and scalp, and are also found on all parts of the skin except the palms of the hands and soles of the feet. The type of secretion of the sebaceous glands is referred to as holocrine. In the eyelids, meibomian glands, also called tarsal glands, are a type of sebaceous gland that secrete a special type of sebum into tears. Fordyce spots are ectopic (misplaced) sebaceous glands found usually on the lips, gums and inner cheeks. The structure consisting of hair, hair follicle, arrector pili muscles, and sebaceous gland is an epidermal invagination known as a pilosebaceous unit. Sebaceous glands are also found in hairless areas (glabrous skin) of the eyelids, nose, penis, labia minora, the inner mucosal membrane of the cheek, and nipples."}, {"url": "https://en.wikipedia.org/wiki/Sebaceous_gland", "passage_text": "The sebaceous glands are found throughout all areas of the skin except the palms of the hands and soles of the feet. There are two types of sebaceous gland, those connected to hair follicles, in pilosebaceous units, and those that exist independently. The structure consisting of hair, hair follicle, arrector pili muscles, and sebaceous gland is an epidermal invagination known as a pilosebaceous unit. Sebaceous glands are also found in hairless areas (glabrous skin) of the eyelids, nose, penis, labia minora, the inner mucosal membrane of the cheek, and nipples."}, {"url": "https://en.wikipedia.org/wiki/Sebaceous_cyst", "passage_text": "However, the above types of cyst contain keratin, not sebum, and neither originates from sebaceous glands (epidermoid cysts originate in the epidermis and pilar cysts originate from hair follicles). Therefore technically speaking they are not sebaceous cysts. "}, {"url": "http://www.primehealthchannel.com/sebaceous-glands-location-functions-and-pictures.html", "passage_text": "Sebum is created in the Sebaceous glands. Following production, this oily substance is secreted through a small duct. From the gland it moves up the hair shaft and ultimately arises to the skin surface through the hair follicle. Protecting the skin is the main function of Sebaceous Glands. Sebaceous Glands secrete an oily substance known as Sebum that lubricates the hair and skin of mammals. Large quantities of sebum protect skin and hair from water. It reduces the growth of microorganisms anywhere on the skin."}]