[{"url": "http://home.costhelper.com/swimming-pool.html", "passage_text": "1 Installing an aboveground pool can cost $1,500-$5,000; for in-ground estimated costs are $7,000-$16,000 for a vinyl-lined model, $15,000-$25,000 for a fiberglass shell and $17,000-$45,000 for concrete or gunite. 2  However, custom designs can run prices much higher."}, {"url": "http://www.riverpoolsandspas.com/blog/bid/23495/How-Much-do-Above-Ground-and-Inground-Swimming-Pools-Cost", "passage_text": "The installation costs of above ground pools usually run $1000-$3000, depending on the size and type of pool. Keep in mind that oval pools normally cost more to install than round pools, and the kits are also more expensive."}, {"url": "http://www.poolpricer.com/", "passage_text": "Here’s a list of things that determine the final cost of installing an inground pool. Size. The size of the pool is the biggest factor in determining how much it costs. For every square foot, expect to pay around $50. Depth."}, {"url": "http://www.improvenet.com/r/costs-and-prices/swimming-pool-installation-cost-prices", "passage_text": "Inground vs. Above Ground Pool Costs. The biggest determining factor in the cost of your swimming pool will be whether you choose an inground or above ground option. On average, the cost of installing a new swimming pool runs between $14,961 and $21,649. However, that is more accurate for pools installed in-ground. Choosing a pool installed at the ground level won't require excavation, which keeps costs much lower."}, {"url": "http://www.fixr.com/costs/build-swimming-pool", "passage_text": "For the purpose of this discussion, we will look at the costs associated with the installation of both kinds of modern swimming pools. According to P.K. Data the average cost of a 19' diameter above ground swimming pool is $6,243; while the average cost of a 32'x16' inground swimming pool is $21,919."}, {"url": "http://www.fixr.com/costs/build-swimming-pool", "passage_text": "1 The vinyl is the least expensive with a standard cost of roughly $18,000. 2  The fiberglass bump up the costs to $20,000 without installation. 3  There are also concrete and gunite pools that require around $20,000 to $50,000 to install."}, {"url": "http://blog.poolcenter.com/article.aspx?articleid=6527", "passage_text": "The cost to install a gas pool heater is $500-$1500 How Much does it Cost to Run a Gas Pool Heater? Like heat pumps, the cost to heat a pool with gas will vary, by pool size and temperature rise, and also by month."}]