[{"url": "http://www.tdi.texas.gov/pubs/pc/pcgenliab.html", "passage_text": "For information about our various bond resources, visit Bond Resources. Commercial General Liability (CGL) insurance protects business owners against claims of liability for bodily injury, property damage, and personal and advertising injury (slander and false advertising). "}, {"url": "https://www.kanetix.ca/commercial-general-liability-what-is-it", "passage_text": "In a nutshell, commercial general liability insurance, or CGL, is coverage that will protect your business in the event that you are sued. It is often used to cover claims against your business for injury or property damage. Without a commercial general liability insurance policy, you are leaving yourself and your company vulnerable to lawsuits that could have a devastating impact on your business. It is, unfortunately, a necessary cost of doing business because the likelihood of being sued is more common than you might think."}, {"url": "http://www.iii.org/article/commercial-general-liability-insurance", "passage_text": "A Commercial General Liability (CGL) policy protects your business from financial loss should you be liable for property damage or personal and advertising injury caused by your services, business operations or your employees. Purchasing Commercial General Liability Insurance. You can purchase commercial general liability insurance as a stand-alone policy, as part of a Business Owners Policy (BOP) or as part of a Commercial Package Policy (CPP). Consult with your insurance professional about what type of coverage you need and how much."}, {"url": "http://www.ehow.com/about_7468277_commercial-liability-insurance-cover_.html", "passage_text": "Commercial liability insurance is a business policy that protects a company from financial responsibility when claims are made against it from injured third parties. Some of these claims include negligence, slander and copyright infringements. However, commercial liability coverage is generally bundled together with other coverages, such as property insurance, to create what is called a business owners policy, or BOP."}, {"url": "http://www.techinsurance.com/general-liability-insurance/", "passage_text": "A Commercial General Liability (CGL) insurance policy is the first line of defense against many common claims. General Liability insurance covers claims of bodily injury or other physical injury or property damage. It is frequently offered in a package with Property insurance to protect your business against incidents that may occur on your premises or at other covered locations where you normally conduct business. "}, {"url": "http://www.businessinsurancenow.com/general-liability/", "passage_text": "In simple terms, a Commercial General Liability Insurance policy protects your business by providing the financial resources necessary to keep it operational when unexpected events (such as a client injury that leads to a lawsuit) throw a wrench in your plans. Read on for the specific costs your CGL policy covers. Fire, Explosion, or Lightning Damage. The property insurance portion of your general liability insurance covers damage you may cause to other people’s property as a result of fire, lightning, or explosion, whether you own your business property or rent it."}, {"url": "http://www.techinsurance.com/ask-us/what-does-general-liability-insurance-cover/", "passage_text": "It is important to note one thing that General Liability Insurance typically does NOT cover physical damage that you or one of your employees causes to a client’s computer system. To cover computer system losses, you may be required to purchase a separate insurance policy. 3. General Liability Insurance (also known as Commercial General Liability Insurance) covers the financial costs associated with bodily injury or property damage liability on your premises or at your client’s location."}, {"url": "http://www.iii.org/article/commercial-general-liability-insurance", "passage_text": "What Commercial General Liability Insurance Covers. A CGL insurance policy will usually cover the costs of your legal defense and will pay on your behalf all damages if you are found liable—up to the limits of your policy. Purchasing Commercial General Liability Insurance. You can purchase commercial general liability insurance as a stand-alone policy, as part of a Business Owners Policy (BOP) or as part of a Commercial Package Policy (CPP). Consult with your insurance professional about what type of coverage you need and how much."}, {"url": "http://www.businessinsurancenow.com/general-liability/", "passage_text": "Commercial General Liability Insurance protects small-business owners from claims of injury, property damage, and negligence related to their business activities. The indemnity provided by a liability insurance policy helps your business owner cover the costs associated with mounting a legal defense. Fire, Explosion, or Lightning Damage. The property insurance portion of your general liability insurance covers damage you may cause to other people’s property as a result of fire, lightning, or explosion, whether you own your business property or rent it."}, {"url": "https://en.wikipedia.org/wiki/Liability_insurance", "passage_text": "Liability insurance is a part of the general insurance system of risk financing to protect the purchaser (the insured) from the risks of liabilities imposed by lawsuits and similar claims. It protects the insured in the event he or she is sued for claims that come within the coverage of the insurance policy. "}]