[{"url": "http://www.picturesbymom.com/interesting/wedding-etiquette-what-is-an-average-wedding-gift.html", "passage_text": "According to the American Express survey, the average wedding gift is $144 for a family member and $97 for a close friend. More affluent wedding guests give an average wedding gift worth $251 for any wedding they attend, while co-workers come in at the low end of the scale at an average of $66. Not surprisingly, the more removed a wedding guest is from the bride and groom, the smaller their wedding gift tends to be"}, {"url": "http://www.theweddingenvelope.com/", "passage_text": "How it works is that we took into account the most important cost factors of a wedding and then factored in the average out-of-pocket costs to you, the guest, creating a unique monetary amount that you should give as your wedding gift to the newlyweds. Please remember this is but a suggested monetary gift. After sifting through countless hours of wedding data based on location in the United States & now Canada, we finally came up with a formula that calculates the approximate amount of money you should give a couple for their wedding gift."}, {"url": "http://www.huffingtonpost.com/cheryl-seidel-/post_9474_b_7455892.html", "passage_text": "I can share that the average amount spent on a wedding gift in 2014 through RegistryFinder.com was $120. If you choose to buy from the couple's wedding registry, we recommend purchasing early, so you have the best selection of gifts and price ranges. We just don't know how much we are expected to spend on a wedding gift. Unfortunately, there's no simple answer and no set amount you should spend (or amount you should give if gifting cash). The amount you spend is dependent upon your budget and relationship with the wedding couple (or their parents)."}, {"url": "https://answers.yahoo.com/question/index?qid=20080709044638AADknWz", "passage_text": "A typical wedding gift is $100 per person ($200 per couple). You'll give more if you're better off or if the bride or groom is family. This is also in addition to any shower or other gifts. Of course, not everybody gives the same amount. Weddings are huge and so are the gifts (average gift is about $250 for an average salary couple/ $500 if your really well off). Just wondering what gifts are like in other parts of the country"}, {"url": "https://answers.yahoo.com/question/index?qid=20070425231304AAxLC7P", "passage_text": "Best Answer: For my wedding 3 years ago I believe my aunts and uncles gave $300 to $500 per couple, more than the average couple who attended my wedding. Usually for someone that close it doesn't depend on how nice the wedding is or if you attend but your individual financial situation. "}, {"url": "http://www.ctvnews.ca/health/wedding-gift-etiquette-cash-is-still-king-but-how-much-1.1836362", "passage_text": "But there is no etiquette on that for giving a gift.. Andrews Sunkel said one of the most common questions she's asked is how much cash to give, and she believes it should be based on your relationship with the couple, and what you're comfortable with. But when really pressed for a dollar figure, she said between $100 and $150 per person is appropriate. Wedding planner Lynzie Kent says a general rule is to give a gift that at least covers the cost of your reception dinner. It used to be $100 a head is kind of the going rate, but these days I think it's anywhere between $150 and $250 per person, Kent told CTVNews.ca."}, {"url": "http://www.cbsnews.com/news/wedding-gift-giving-tips/", "passage_text": "Gifts-The Wedding Channel suggests that the average amount for an engagement gift is $35, while the average amount for a shower gift is $25. "}, {"url": "http://www.picturesbymom.com/interesting/wedding-etiquette-what-is-an-average-wedding-gift.html", "passage_text": "The average wedding gift for a family member is around $150 per person – so something in the order of $200 – $400 for the both of you would be reasonable – depending on the venue and style of the wedding. Jenny O June 26, 2014 at 4:46 pm Reply. I’m attending the wedding of my beloved nephew this summer. More affluent wedding guests give an average wedding gift worth $251 for any wedding they attend, while co-workers come in at the low end of the scale at an average of $66."}, {"url": "http://blog.timesunion.com/savingssource/4877/cash-as-a-wedding-gift-how-much-do-you-give/", "passage_text": "I agree that your gift should not depend on how much it cost the couple. We had about 100 guests at our wedding and I would say the average gift we received was between $100 and $150 (closer family and friends gave more). For weddings we’ve attended we give at $100 (generally if one of us was in the wedding)or more depending on how close we are to the couple. "}]