[{"url": "http://www.wikihow.com/Become-an-Aerospace-Engineer", "passage_text": "You learn advanced concepts of physics and mathematics at the university. If you have passion for spacecraft or aircraft, math and physics then a career as an Aerospace Engineer may be a fit for you. Know what Aerospace Engineering is. Before deciding on an Aerospace Engineering degree, be aware of what it entails. Read online resources, scientific journals and speak with knowledgable people to learn."}, {"url": "http://www.academicinvest.com/engineering-careers/mechanical-engineering-careers/how-to-become-an-astronautical-engineer", "passage_text": "To become an astronautical engineer, you typically need a degree in aeronautical or aerospace engineering, or a degree in mechanical engineering with a focus on aerospace engineering. Astronautical Engineer Salary Canada: According to Service Canada, the average salary level of workers in the Aerospace Engineers occupational group is $77,817 per year."}, {"url": "http://study.com/directory/category/Engineering/Aeronautical_and_Astronautical_Engineering.html", "passage_text": "Inside Aeronautical and Astronautical Engineering. Aeronautical and aerospace engineers rely on an interdisciplinary mix of mechanical, electronics and materials engineering skills. In the field, they can focus on the design of aircraft or spacecraft. Some focus on the design of missiles, probes or other unmanned devices. "}, {"url": "http://study.com/articles/Aeronautical_Engineer_Educational_Requirements.html", "passage_text": "Educational Requirements. In order to become an aeronautical engineer, prospective candidates must complete a bachelor's degree program, usually in aerospace or aeronautical engineering. A program accredited by the Accreditation Board for Engineering and Technology (ABET) may be required to later earn licensure. "}, {"url": "http://www.academicinvest.com/engineering-careers/mechanical-engineering-careers/how-to-become-an-astronautical-engineer", "passage_text": "If you want to become an astronautical engineer, you first need to determine if this career path is a good fit for you. If the following description sounds like you, then you’re probably well suited for a career as an astronautical engineer: Astronautical Engineer Salary Canada: According to Service Canada, the average salary level of workers in the Aerospace Engineers occupational group is $77,817 per year."}, {"url": "http://www.bls.gov/ooh/architecture-and-engineering/aerospace-engineers.htm", "passage_text": "Aerospace engineers typically specialize in one of two types of engineering: aeronautical or astronautical. Aeronautical engineers work with aircraft. They are involved primarily in designing aircraft and propulsion systems and in studying the aerodynamic performance of aircraft and construction materials. They must be able to ask the right question, then find an acceptable answer. Math skills. Aerospace engineers use the principles of calculus, trigonometry, and other advanced topics in math for analysis, design, and troubleshooting in their work."}, {"url": "http://www.academicinvest.com/engineering-careers/mechanical-engineering-careers/how-to-become-an-astronautical-engineer", "passage_text": "Astronautical engineers have a natural aptitude in math, science and technology. They are individuals with creativity and determination; individuals who are able to work patiently and diligently towards their goals, and they typically don’t get discouraged easily. Astronautical Engineer Salary Canada: According to Service Canada, the average salary level of workers in the Aerospace Engineers occupational group is $77,817 per year."}, {"url": "http://www.academicinvest.com/engineering-careers/mechanical-engineering-careers/how-to-become-an-astronautical-engineer", "passage_text": "Below we've outlined what you'll need to begin a career as an astronautical engineer. We've also included helpful information for this career, such as job description, job duties, salary expectations, a list of possible employers and much more! Astronautical Engineer Salary Canada: According to Service Canada, the average salary level of workers in the Aerospace Engineers occupational group is $77,817 per year."}, {"url": "http://www.bls.gov/ooh/architecture-and-engineering/aerospace-engineers.htm", "passage_text": "$34,750. The median annual wage for aerospace engineers was $103,720 in May 2012. The median wage is the wage at which half of the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $65,450, and the top 10 percent earned more than $149,120. They must be able to ask the right question, then find an acceptable answer. Math skills. Aerospace engineers use the principles of calculus, trigonometry, and other advanced topics in math for analysis, design, and troubleshooting in their work."}]