[{"url": "http://www.ranker.com/list/renaissance-art-and-artwork/reference", "passage_text": "Famous Renaissance Artwork. List of famous Renaissance artwork, listed alphabetically with photos when available. The Renaissance movement was an awakening in the world of art, producing new types of paintings and sculptures that the world had never seen before. This is a list of the most popular Renaissance art pieces, so art enthusiasts will likely recognize the names of the famous artists who created these pieces."}, {"url": "http://www.ranker.com/list/famous-renaissance-artists/reference", "passage_text": "Famous Renaissance painters and artists worked during this period of European history (around the 1400s), creating a distinct style or art that blossomed in parallel with developments occurring in philosophy, literature, music, and science. This list of famous Renaissance artists features images, bios, and information about their notable works. All the greatest artists associated with the Renaissance movement are included here, along with clickable names for more details on that particular painter or sculptor."}, {"url": "http://www.ranker.com/list/famous-renaissance-artists/reference", "passage_text": "Artists during the Renaissance created some of the most important and well-known pieces of art in all of art history. The list of Renaissance artists below includes notable artists of the Renaissance, from Leonardo da Vinci to Michelangelo. This list of famous Renaissance artists features images, bios, and information about their notable works. All the greatest artists associated with the Renaissance movement are included here, along with clickable names for more details on that particular painter or sculptor."}, {"url": "http://www.ducksters.com/history/renaissance_artists.php", "passage_text": "Perhaps the most famous are Leonardo da Vinci and Michelangelo. Other artists, however, had great influence both during Renaissance times and later, even influencing modern day artists. Botticelli (1445 - 1510). Botticelli was a ward of the Medici family of Florence during the growth of the Italian Renaissance. He painted a number of portraits for the Medici family as well as many religious paintings. He is probably most famous for his paintings on the Sistine Chapel at the Vatican in Rome."}, {"url": "http://totallyhistory.com/art-history/famous-artists/", "passage_text": "Famous Artists. Historically, artists become famous either for their unique style or the character they exude to the world of art. Beginning with the Renaissance Era, art was transformed, it elevated the value of art and produced a respect it from society that was not there in the past. Art masters became known everywhere, their work were studied during and beyond their lifetime. Following the Renaissance, innovations and varying school’s of thought took place and artists and their work distinguished themselves from every era ever since. For the best paintings of all time, view the most famous paintings."}, {"url": "http://historylists.org/art/list-of-10-remarkable-religious-renaissance-paintings.html", "passage_text": "List of 10 Remarkable Religious Renaissance Paintings. The great painters of the Renaissance period, many of whom focused on religious themes were often commissioned by well-to-do patrons including the Pope himself. Religion was infiltrated in everyday life in this era, deeply resonating with both the painters and those they worked for. Many of these religious paintings are among the greatest works of Renaissance art as a whole."}, {"url": "http://www.history.com/topics/renaissance-art", "passage_text": "Origins of Renaissance Art. The origins of Renaissance art can be traced to Italy in the late 13th and early 14th centuries. During this so-called “proto-Renaissance” period (1280-1400), Italian scholars and artists saw themselves as reawakening to the ideals and achievements of classical Roman culture."}, {"url": "https://en.wikipedia.org/wiki/Italian_Renaissance_painting", "passage_text": "Italian Renaissance painting is the painting of the period beginning in the late 13th century and flourishing from the early 15th to late 16th centuries, occurring in the Italian peninsula, which was at that time divided into many political areas. "}, {"url": "http://www.biographyonline.net/people/famous/renaissance.html", "passage_text": "The Renaissance was a cultural movement which saw a flowering of education, literature, art and sciences. The Renaissance saw an inflow of new ideas and new practises, and left a profound cultural legacy. "}]