[{"url": "https://answers.yahoo.com/question/index?qid=20080101163313AAtI1gF", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: This will cost approximately $400 per average sized room, plus about $200 per bathroom. If you need to cover up a custom paint job because it comes through, this will, of course, cost additionally. Costs change dramatically depending upon where you live, but that's the going rate where I live. Source(s):"}, {"url": "http://home.costhelper.com/painting-interior.html", "passage_text": "A rate of no less than $1.80/sf including materials is realistic, acceptable and more than fair for a qualified professional to paint rooms with 9' ceilings. Expect to pay $1 extra per square foot for 9'- 15' and $2.50 extra for 15' +. Some additional costs for extreme conditions will raise that amount. 1 Expect to pay $200-$400 to have a 12x12-foot room painted by a licensed contractor with brand-name paints; a 15x20-foot room or larger runs $300-$700 or more; and a 1,200-1,500 square foot home is $1,100-$2,000 or more."}, {"url": "http://www.homeimprovementpages.com.au/article/how_much_do_painters_cost", "passage_text": "The average cost of interior painting in Australia is about $18-$20 per square metre, including the ceiling, which is usually calculated at a higher rate per square metre. For an easy job using a single colour with minimal trim work, your quote may be as little as $14 per square metre. "}, {"url": "http://streeteasy.com/talk/discussion/31856-estimate-for-painting-1-br", "passage_text": "We are looking for approximate cost for basic painting of a one bedroom duplex -- about 850 square feet. The walls are in good shape, modest amounts of basic trim, and one color on walls. I paid $3,200 to get a 2,800 square foot 3BR in Manhattan painted. Was doing my floors also which cost me $9,500 to sand down and stain with one coat. Paid $1,200 extra for a second coat. Given a couple of bathrooms and utility rooms I guess 2,200 of wood floors."}, {"url": "http://www.homeadvisor.com/cost/painting/", "passage_text": "Mural and Trompe L'oeil Costs. Specialty painting by the hour costs between $40 to $50 on average. Paint might range between $75 to $90, costing an additional $40 to $50 per hour. The painter's skill and experience are also determining factors in the cost of specialty painting. While a freelance artist might charge $25 to $30 an hour, a very skilled professional might charge $80 or more. Some painters might also charge $60 or more for a consultation."}, {"url": "http://homewyse.com/services/cost_to_paint_bedroom.html", "passage_text": "Bedroom Painting-Average Cost Per Square Foot Floor. Expect to pay in the high end of the estimated price range for a licensed, bonded and insured contractor and for complex or rush projects. Hire carefully, only after verifying prior work quality. For a basic 120 square feet project in zip code 47474, the benchmark cost to Paint a Bedroom ranges between $2.63 - $5.60 per square foot. To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased."}, {"url": "http://www.fixr.com/costs/paint-room", "passage_text": "1 Paint-there are dozens of quality brands available, and for a room in the size described it will require two full gallons to cover the walls. 2  The better paints will cost between $30 and $50 per gallon, and will come as flat, semi-gloss, or glossy finish. "}, {"url": "http://home.costhelper.com/painting-interior.html", "passage_text": "1 Interior paint itself costs anywhere from $12-$50 or more a gallon, depending on the quality. 2  Painting a 12x12-foot room, both walls and ceiling, can require $25-$100 worth of paint, plus $10-$50 for primer, brushes, rollers, drop clothes and other supplies. 1 Expect to pay $200-$400 to have a 12x12-foot room painted by a licensed contractor with brand-name paints; a 15x20-foot room or larger runs $300-$700 or more; and a 1,200-1,500 square foot home is $1,100-$2,000 or more."}, {"url": "http://streeteasy.com/talk/discussion/26667-painting-cost", "passage_text": "I'm wondering if anyone can give me a general sense of how much it would cost to paint one floor of our apartment -- kitchen, dining area, bedroom, and living room. The total square footage is about 500-600 sf. "}]