[{"url": "http://americainclass.org/sources/makingrevolution/crisis/text4/text4.htm", "passage_text": "4. 1767-69: Crisis Deepens. 1  Colonists respond to the Townshend Acts, 1767-1770 PDF compilation. 2  Colonists respond to the Quartering Act, 1766-1767 PDF compilation. 3  John Dickinson, Letters from a Farmer in Pennsylvania, Letters 1 & 2, 1767 PDF. "}, {"url": "http://www.thefreedictionary.com/quartering", "passage_text": "He swam quartering up-stream, but still was swept downward rather faster than he had expected. Tom Sawyer by Twain, Mark View in context. She will strain much less this way than in quartering across a gale. quartering-a coat of arms that occupies one quarter of an escutcheon; combining four coats of arms on one shield usually represented intermarriages. blazon, blazonry, coat of arms, arms-the official symbols of a family, state, etc."}, {"url": "http://www.thefreedictionary.com/quartering", "passage_text": "1. quartering-a coat of arms that occupies one quarter of an escutcheon; combining four coats of arms on one shield usually represented intermarriages. blazon, blazonry, coat of arms, arms-the official symbols of a family, state, etc."}, {"url": "http://www.answers.com/Q/What_was_the_Quartering_Act", "passage_text": "It forced colonists to accept British soldiers into their homes. The Quartering Act was an act, passed by Parliament that made colonists house or qfuckuarter British soldiers. the quartering act of 1765 was important because the British parliament passed the act of which the British soldiers had the right to stay at a local home and the American col … onists were expected to give them provisions and a warm place to sleep."}, {"url": "http://totallyhistory.com/quartering-acts/", "passage_text": "Quartering Acts. The Quartering Acts refers to provisions passed by the British Parliament during the 18th century. Under these Acts, local colonial governments were forced to provide provisions and housing to British soldiers stationed in the American colonies. Quartering Act of 1774. The second Quartering Act contained similar requirements as the first, but did not require the colonies to provide British troops with provisions. This second Act passed British Parliament in 1774 and expired in 1776."}, {"url": "http://study.com/academy/lesson/the-quartering-act-of-1765-definition-summary-facts.html", "passage_text": "Lesson Summary. The Quartering Act was passed in 1765 in the wake of the British victory in the French and Indian War, which left the government with a large debt and a larger territory to defend and administer. "}, {"url": "http://www.history.com/this-day-in-history/parliament-passes-the-quartering-act", "passage_text": "Publisher. A+E Networks. On this day in 1765, Parliament passes the Quartering Act, outlining the locations and conditions in which British soldiers are to find room and board in the American colonies. The Quartering Act of 1765 required the colonies to house British soldiers in barracks provided by the colonie"}, {"url": "http://www.history.com/this-day-in-history/parliament-completes-the-coercive-acts-with-the-quartering-act", "passage_text": "A+E Networks. On this day in 1774, the British Parliament renews the Quartering Act, allowing Redcoats to stay in private American homes if necessary. The Quartering Act, in conjunction with the Massachusetts Government Act, the Administration of Justice Act and the Boston Port Act, were known as the Coercive Acts. "}, {"url": "http://www.historycentral.com/Revolt/quatering.html", "passage_text": "The Quartering Act 1765. In 1765 the British further angered the colonist by passing the Quartering Act. The act forced American colonist to house and feed British forces who were serving in North America. "}, {"url": "http://totallyhistory.com/quartering-acts/", "passage_text": "Quartering Acts. The Quartering Acts refers to provisions passed by the British Parliament during the 18th century. Under these Acts, local colonial governments were forced to provide provisions and housing to British soldiers stationed in the American colonies. The second Quartering Act contained similar requirements as the first, but did not require the colonies to provide British troops with provisions. This second Act passed British Parliament in 1774 and expired in 1776."}]