[{"url": "https://www.alzheimers.org.uk/site/scripts/documents_info.php?documentID=133", "passage_text": "Each person will experience dementia differently. On average, people with vascular dementia live for around five years after symptoms begin, less than the average for Alzheimer's disease. In many cases, the person's death will be caused by a stroke or heart attack."}, {"url": "http://www.dementiacarecentral.com/aboutdementia/facts", "passage_text": "The chance of developing dementia increases with age. However, dementia is not a natural process of aging and it does not affect everyone. For example, less than 2% of people ages 65-69 have dementia (Alzheimer's Disease International, 2008)."}, {"url": "https://www.alzheimers.org.uk/site/scripts/documents_info.php?documentID=101", "passage_text": "The life expectancy of a person with dementia is unpredictable, and the disease can progress for up to around 10 years. It is estimated that a third of people with dementia at any one time will be in the later stages of the disease."}, {"url": "http://www.alzheimer.ie/About-Dementia/Stages-progression.aspx", "passage_text": "This can mean that people are more aware of their condition and can be more prone to depression than people with Alzheimer’s disease. In general people with vascular dementia live for around five years after symptoms begin. In many cases, the person’s death will be caused by a stroke or heart attack."}, {"url": "http://www.rocketswag.com/elderly/elderly-health/elderly-disease/dementia/How-Long-Does-A-Person-Live-With-Dementia.html", "passage_text": "On the other hand, a person diagnosed with early stage dementia can live for anywhere from 4 years to 4.5 years. At the same time, it has been seen the longevity after diagnosis of dementia differs amongst men and women."}, {"url": "https://www.alzinfo.org/articles/people-with-dementia-have-shortened-life-expectancies/", "passage_text": "People with Alzheimer’s disease and other forms of dementia live, on average, about four and a half years after their condition is diagnosed. This is based mainly on people in their 80s and 90s who have recently developed Alzheimer’s."}, {"url": "http://www.webmd.com/alzheimers/news/20080110/average-dementia-survival", "passage_text": "Overall, women lived slightly longer than men after a diagnosis of dementia -- around 4.6 years vs. 4.1 years. And frailer patients died sooner than healthier ones. But being married, living at home, and even degree of mental decline were not found to have a big impact on survival."}, {"url": "http://www.webmd.com/alzheimers/news/20080110/average-dementia-survival", "passage_text": "Jan. 10, 2008 -- The average survival time for people diagnosed with dementia is about four and a half years, new research shows. Those diagnosed before age 70 typically live for a decade or longer."}, {"url": "https://www.caring.com/questions/how-long-can-you-live-with-alzheimers", "passage_text": "People who are diagnosed in their 70s tend to live longer than people who are diagnosed at age 85 or older. People in the early stage at diagnosis tend to live longer than people in the late stage at diagnosis. Women with Alzheimer's tend to live longer than men who have it."}, {"url": "http://www.todaysseniors.com/wp/senior-health/how-long-can-someone-live-with-dementia/", "passage_text": "How long a person can live after they are diagnosed with vascular dementia depends on the individual and the stage of the disease. Vascular dementia can be caused by multiple strokes which further reduce the life span of an individual."}]