[{"url": "http://www.mapsofworld.com/france/toulouse-city-map.html", "passage_text": "Toulouse is one of France's most beautiful cities. It's a city located in southwest France. The metropolitan area of Toulouse is the second largest in Southern France and one of the fastest growing in Southern Europe. It is also the fourth largest city of France. Toulouse is called the chief city of Midi-Pyrenees Region."}, {"url": "http://www.france.com/general/toulouse/", "passage_text": "Toulouse. Toulouse (Tolosa in Occitan) is a city in southwest France on the banks of the Garonne River, half-way between the Atlantic Ocean and the Mediterranean Sea."}, {"url": "https://en.wikipedia.org/wiki/Toulouse", "passage_text": "With 1,250,251 inhabitants at the January 2011 census, the Toulouse metropolitan area is the fourth-largest in France, after Paris (12.3 million), Lyon (2.2 million), and Marseille (1.7 million)."}, {"url": "http://www.destination360.com/europe/france/toulouse", "passage_text": "Toulouse France comprises the fourth largest metropolitan area in the country, behind Paris, Lyon, and Marseille. Toulouse is widely renowned for its arts and culture, business and academics, and wide variety of stunning brick architecture, from which it derives the name Ville Rose or Pink City."}, {"url": "http://www.destination360.com/europe/france/toulouse", "passage_text": "Share. Toulouse is a city located in the southwest portion of France near the borders of Italy and Spain. It is a little over 360 miles south of Paris, approximately 150 miles west of Marseille, and less than 100 miles north of the border of Spain."}, {"url": "http://french.about.com/od/travelfrance/ig/Toulouse/", "passage_text": "Toulouse, also known as la Ville rose (Pink Town), is the fourth largest city in France. Located in the southwest of France, within a few hours of the Atlantic Ocean, the Mediterreanean Sea, and the Spanish border, Toulouse is a beautiful town filled with friendly people and interesting architecture."}]