[{"url": "http://www.thefreedictionary.com/flask", "passage_text": "flask. n. 1. A small container, such as a bottle, having a narrow neck and usually a cap, especially: a. A flat, relatively thin container for liquor. b. A container or case for carrying gunpowder or shot. c. A vial or round long-necked vessel for laboratory use."}, {"url": "http://www.chegg.com/homework-help/definitions/thermal-energy-2", "passage_text": "Definition of Thermal Energy. Thermal energy is the internal energy of an object due to the kinetic energy of its atoms and/or molecules. The atoms and/or molecules of a hotter object have greater kinetic energy than those of a colder one, in the form of vibrational, rotational, or, in the case of a gas, translational motion."}, {"url": "http://www.thefreedictionary.com/flasks", "passage_text": "flask. n. 1. A small container, such as a bottle, having a narrow neck and usually a cap, especially: a. A flat, relatively thin container for liquor."}, {"url": "http://www.thefreedictionary.com/flask", "passage_text": "flask. 1. a bottle, usu. of glass, having a rounded body and a narrow neck. 2. a flat bottle for carrying in the pocket. 3. an iron container for shipping mercury, holding a standard commercial unit of 76 lb. (34 kg). 4. a container into which sand is rammed around a pattern to form a mold."}, {"url": "http://dictionary.cambridge.org/dictionary/english/thermos", "passage_text": "The answer may seem obvious, but the use of this word can lead to confusion. In the UK and Ireland the word traditionally meant the number 1,000,000,000,000 (a million millions), which is called a trillion in the United States. A billion in the United States is considerably."}, {"url": "http://www.bedbathandbeyond.com/1/3/insulated-ice-bucket", "passage_text": "Add contemporary style to your bar with the Kraftware Contempo 2-Quart Tall Ice Bucket. Insulated with a double-wall construction to keep ice colder for longer, the exterior is covered in canvas, and is topped with a Lucite lid."}]