[{"url": "http://decalcifypinealgland.com/what-is-the-pineal-gland/", "passage_text": "“The pineal gland is a midline structure shaped like a pine cone, and is often seen in plain skull X-rays, as it is often calcified; calcification has been shown in one small study to correlate with the accumulation of fluoride.” The pine cone shape of the pineal gland is a very interesting topic. ) and spiritual practices such as meditation and visualisation. The medical profession describes the pineal gland as being: “a small endocrine gland in the vertebrate brain that produces the serotonin derivative melatonin, a hormone that affects the modulation of wake/sleep patterns and seasonal functions."}, {"url": "http://plato.stanford.edu/entries/pineal-gland/", "passage_text": "The pineal gland is a tiny organ in the center of the brain that played an important role in Descartes' philosophy. He regarded it as the principal seat of the soul and the place in which all our thoughts are formed. In this entry, we discuss Descartes' views concerning the pineal gland. "}, {"url": "http://training.seer.cancer.gov/anatomy/endocrine/glands/pituitary.html", "passage_text": "Pineal Gland. The pineal gland, also called pineal body or epiphysis cerebri, is a small cone-shaped structure that extends posteriorly from the third ventricle of the brain. The pineal gland consists of portions of neurons, neuroglial cells, and specialized secretory cells called pinealocytes. Pituitary Gland. The pituitary gland or hypophysis is a small gland about 1 centimeter in diameter or the size of a pea. It is nearly surrounded by bone as it rests in the sella turcica, a depression in the sphenoid bone. The gland is connected to the hypothalamus of the brain by a slender stalk called the infundibulum."}, {"url": "http://www.mysticbanana.com/pineal-gland-our-third-eye-the-biggest-cover-up-in-human-history.html", "passage_text": "The pineal gland (also called the pineal body, epiphysis cerebri, epiphysis or the “third eye”) is a small endocrine gland in the vertebrate brain. "}, {"url": "http://www.wakingtimes.com/2013/01/22/what-is-the-pineal-gland/", "passage_text": "Waking Times. The Pineal Gland is regarded as one of the most important parts of your nervous system. It is shrouded in mystery, but as more and more people investigate it they are realising it is essentially a spiritual antenna, the mystical third eye that ancient traditions have been talking about. "}, {"url": "http://www.wisegeek.org/what-does-the-pineal-gland-do.htm", "passage_text": "The pineal gland is an endocrine gland, like the pituitary gland, thyroid gland, adrenal gland, and pancreas. Like other endocrine glands, it secretes a hormone -- in this case melatonin. Ad. In reality, the melatonin secreted by the pineal gland is responsible for various aspects of sexual development, animal hibernation, metabolism, and seasonal breeding. The gland secretes its hormone in sync with circadian rhythms, releasing more in the dark and less in the light."}, {"url": "https://en.wikipedia.org/wiki/Pineal_gland", "passage_text": "The pineal gland, also known as the pineal body, conarium or epiphysis cerebri, is a small endocrine gland in the vertebrate brain. The gland has been compared to the photoreceptive, third parietal eye present in the epithalamus of some animal species, which is also called the pineal eye. Rene René descartes believed the pineal gland to be the principal seat of the soul and viewed it as the third. eye"}, {"url": "http://www.nsasb.com/v1/article-3-heart/", "passage_text": "The pineal gland (also called the pineal body, epiphysis cerebri, epiphysis or the “third eye”) is a small endocrine gland. It produces melatonin, a hormone that affects the modulation of wake/sleep patterns and photoperiodic (seasonal) functions. "}, {"url": "https://en.wikipedia.org/wiki/Pineal_gland", "passage_text": "Nearly all vertebrate species possess a pineal gland. The most important exception is the hagfish, which is often thought of as the most primitive extant vertebrate. Even in the hagfish, however, there may be a pineal equivalent structure in the dorsal diencephalon. The gland has been compared to the photoreceptive, third parietal eye present in the epithalamus of some animal species, which is also called the pineal eye. Rene René descartes believed the pineal gland to be the principal seat of the soul and viewed it as the third. eye"}, {"url": "http://www.endocrineweb.com/endocrinology/overview-pineal-gland", "passage_text": "Pineal Gland Essentials. 1  Of the endocrine organs, the function of the pineal gland was the last discovered. 2  Located deep in the center of the brain, the pineal gland was once known as the “third eye.”. 3  The pineal gland produces melatonin, which helps maintain circadian rhythm and regulate reproductive hormones. Anatomy of the Pineal Gland. Located near the center of the brain, the pineal gland is a very small organ shaped like a pine cone (which is where it gets its name). It’s reddish-gray and about 1/3 inch long. Pineal cells and neuroglial cells (which support the pineal cells) mainly comprise the gland."}]