[{"url": "http://www.wisegeekhealth.com/what-is-muscle-contraction.htm", "passage_text": "Contractions happen when actin filaments actually slide over myosin filaments. This slide causes a change in the shape of the muscle cells producing movement, which is considered a muscle contraction. Depending on the muscle and the intended outcome of the contraction, muscles can either lengthen or shorten. Instead, a muscle contraction of smooth or cardiac muscle is initiated within the organ itself. Within the digestive system, the introduction of food is what causes the contractions to move the food through the system."}, {"url": "http://www.sportsinjuryclinic.net/anatomy/human-muscles/muscle-contractions", "passage_text": "Concentric Contractions. Concentric muscle contractions are the most common form of contraction. These occur when the muscle shortens in length in order to make the bone move. These contractions occur when the body is working against gravity. For example-a bicep curl exercise. "}, {"url": "https://en.wikipedia.org/wiki/Muscle_contraction", "passage_text": "Muscle contraction is the activation of tension-generating sites within muscle fibers. In physiology, muscle contraction does not mean muscle shortening because muscle tension can be produced without changes in muscle length such as holding a heavy book or a dumbbell at the same position. Furthermore, if the muscle length shortens, the contraction is concentric. But if the muscle length lengthens, then the contraction is eccentric. In natural movements that underlie locomotor activity, muscle contractions are multifaceted as they are able to produce changes in length and tension in a time-varying manner."}, {"url": "https://en.wikipedia.org/wiki/Muscle_contraction", "passage_text": "The termination of muscle contraction is followed by muscle relaxation, which is a return of the muscle fibers to their low tension-generating state. Muscle contractions can be described based on two variables: length and tension. A muscle contraction is described as isometric if the muscle tension changes but the muscle length remains the same. In contrast, a muscle contraction is isotonic if muscle length changes but the muscle tension remains the same. Furthermore, if the muscle length shortens, the contraction is concentric. But if the muscle length lengthens, then the contraction is eccentric. In natural movements that underlie locomotor activity, muscle contractions are multifaceted as they are able to produce changes in length and tension in a time-varying manner."}, {"url": "http://www.webmd.boots.com/pain-management/guide/muscle-spasms-and-cramps", "passage_text": "Muscle spasms and cramps. Cramps are caused by muscle spasms, involuntary contractions of one or more muscles. In addition to the foot and calf muscles, other muscles prone to spasms include the front and back of the thigh, the hands, arms, abdomen and muscles along the ribcage. "}, {"url": "http://www.answers.com/Q/What_causes_muscle_contractions", "passage_text": "Muscle contraction in initiated by an action potential sent from the brain or spinal cord to the axon terminal of a motor neuron. Confidence votes 60. Muscle contraction in initiated by an action potential sent from the brain or spinal cord to the axon terminal of a motor neuron. Calcium then goes into the axon terminal which causes the release of the neurotransmitter acetylcholine which binds to receptors on the plasmalemma."}, {"url": "http://www.wisegeekhealth.com/what-is-muscle-contraction.htm", "passage_text": "Through the process of muscle contraction, tension is developed within muscle tissue, which may or may not lead to movement of a part of the body. The term contraction often means to shorten; however, during a muscle contraction the tension may cause muscles to stay the same, get longer or become shorter. The physical process of the contraction happens quickly and in only a few steps. Instead, a muscle contraction of smooth or cardiac muscle is initiated within the organ itself. Within the digestive system, the introduction of food is what causes the contractions to move the food through the system."}, {"url": "http://health.howstuffworks.com/human-body/systems/musculoskeletal/muscle3.htm", "passage_text": "to contraction in skeletal muscle. The trigger for a muscle contraction is an electrical impulse. The electrical signal sets off a series of events that lead to crossbridge cycling between myosin and actin, which generates force. The series of events is slightly different between skeletal, smooth and cardiac muscle. "}]