[{"url": "http://www.thesaurus.com/browse/upraise", "passage_text": "verb elevate. 1  pyramid star. 2  raise star. 3  uphold star. 4  heave star. 5  ramp star. 6  poise star. 7  erect star. 8  pump star. 9  lift star. 10  hoist star. 11  tilt star. 12  heighten star. 13  levitate star. 14  boost star. 15  uplift star. 16  rear star. 17  pick up star. 18  put up star. 19  take up star. 20  uprear star. 21  fetch up star. 22  hike up star. 23  jack up star. 24  shoot up star. 25  stilt star. "}, {"url": "http://www.merriam-webster.com/dictionary/upraise", "passage_text": "Definition of UPRAISE. transitive verb. : to raise or lift up: elevate. See upraise defined for kids. ADVERTISEMENT. "}, {"url": "http://www.thefreedictionary.com/appraised", "passage_text": "Usage: Appraise is sometimes used where apprise is meant: both patients had been fully apprised (not appraised) of the situation. This may well be due to the fact that appraise is considerably more common, and that people therefore tend to associate this meaning mistakenly with a word they know better. verb. 2. (Banking & Finance) to make a valuation of, as for taxation purposes. [C15: from Old French aprisier, from prisier to prize²]. Usage: Appraise is sometimes wrongly used where apprise is meant: they had been apprised (not appraised) of my arrival."}, {"url": "http://www.thefreedictionary.com/appraised", "passage_text": "1. To estimate the price or value of: appraise a diamond; appraise real estate. 2. To make a considered judgment about; assess or size up: appraise a threat; appraised himself in the mirror. 2. (Banking & Finance) to make a valuation of, as for taxation purposes. [C15: from Old French aprisier, from prisier to prize²]. Usage: Appraise is sometimes wrongly used where apprise is meant: they had been apprised (not appraised) of my arrival."}, {"url": "https://en.wikipedia.org/wiki/Raised_fist", "passage_text": "The black fist, also known as the Black Power fist is a logo generally associated with black nationalism and sometimes socialism. Its most widely known usage is by the Black Panther Party in the 1960s. A black fist logo was also adopted by the northern soul music subculture. The white fist, also known as the Aryan fist or the White Power fist is a logo generally associated with white nationalism. A white fist holding a red rose is used by the Socialist International and some socialist or social democratic parties."}, {"url": "http://www.macmillandictionary.com/dictionary/british/upraised", "passage_text": "Thesaurus. The thesaurus of synonyms and related words is fully integrated into the dictionary. Click on the thesaurus category heading under the button in an entry to see the synonyms and related words for that meaning. 90% of the time, speakers of English use just 7,500 words in speech and writing. These words appear in red, and are graded with stars. One-star words are frequent, two-star words are more frequent, and three-star words are the most frequent. Close"}, {"url": "http://www.macmillandictionary.com/dictionary/british/upraised", "passage_text": "Blog. A must for anyone with an interest in the changing face of language. The Macmillan Dictionary blog explores English as it is spoken around the world today. Definition and synonyms of upraised from the online English dictionary from Macmillan Publishers Limited. 90% of the time, speakers of English use just 7,500 words in speech and writing. These words appear in red, and are graded with stars. One-star words are frequent, two-star words are more frequent, and three-star words are the most frequent. Close"}, {"url": "http://www.thefreedictionary.com/upraised", "passage_text": "With upraised breast, and like those who draw in their breath: thus did he stand, the sublime one, and in silence: Thus Spake Zarathustra: A Book For All And None by Nietzsche, Friedrich View in context. Come, then, Athena, with hand upraised (6) over the kiln. "}, {"url": "https://en.wikipedia.org/wiki/Raised_fist", "passage_text": "The raised fist (also known as the clenched fist) is a symbol of solidarity and support. A black fist logo was also adopted by the northern soul music subculture. The white fist, also known as the Aryan fist or the White Power fist is a logo generally associated with white nationalism. A white fist holding a red rose is used by the Socialist International and some socialist or social democratic parties."}]