[{"url": "http://searchcontentmanagement.techtarget.com/definition/taxonomy", "passage_text": "vs. Adobe Digital Enterprise Platform. Taxonomy (from Greek taxis meaning arrangement or division and nomos meaning law) is the science of classification according to a pre-determined system, with the resulting catalog used to provide a conceptual framework for discussion, analysis, or information retrieval. "}, {"url": "https://codex.wordpress.org/Taxonomies", "passage_text": "In WordPress, a taxonomy is a grouping mechanism for some posts (or links or custom post types). The names for the different groupings in a taxonomy are called terms. Using groupings of animals as an example, we might call one group birds, and another group fish. Fish and birds are terms in our taxonomy. As an example from WordPress, a category or tag (see next section) is a term. "}, {"url": "http://www.cms.gov/Medicare/Provider-Enrollment-and-Certification/MedicareProviderSupEnroll/Taxonomy.html", "passage_text": "Taxonomy. The Healthcare Provider Taxonomy Code Set is a hierarchical code set that consists of codes, descriptions, and definitions. Healthcare Provider Taxonomy Codes are designed to categorize the type, classification, and/or specialization of health care providers."}, {"url": "http://www.audioenglish.org/dictionary/taxonomist.htm", "passage_text": "The noun TAXONOMIST has 1 sense: 1. a biologist who specializes in the classification of organisms into groups on the basis of their structure and origin and behavior. Familiarity information: TAXONOMIST used as a noun is very rare. Dictionary entry details."}, {"url": "http://www.kmworld.com/Articles/Editorial/What-Is-.../What-is-a-Taxonomy-81159.aspx", "passage_text": "Tweet. A taxonomy is a knowledge organization system, a set of words that have been organized to control the use of terms used in a subject field into a vocabulary to facilitate the storing and retrieving of items from a repository. Click for larger image. On the left, you see the taxonomy view (click for larger image). We have a broader term and some narrower terms, and we have even top terms in the taxonomy view. This view is broader-narrower term driven so it is hierarchical in nature, and it is called the taxonomy view."}, {"url": "http://www.thefreedictionary.com/taxonomist", "passage_text": "tax·on·o·my. n. pl. tax·on·o·mies. 1. The classification and naming of organisms in an ordered system that is intended to indicate natural relationships, especially evolutionary relationships. 2. The science, laws, or principles of classification. 3. An ordered arrangement of groups or categories: a taxonomy of literary genres. "}, {"url": "http://www.answers.com/Q/What_is_a_taxonomist", "passage_text": "A taxonomist is a scientist who names newly discovered organisms such as a species of animal. this is part of the classification process which can be done through different kn … owledge keys, such as a tabular key, a dichotomous key, or a circular key. God is the first taxonomist mentioned in the Bible, dividing the creatures by kind on the fifth day of creation."}, {"url": "http://www.wisegeek.com/what-does-a-taxonomist-do.htm", "passage_text": "A traditional taxonomist is a professional who classifies organisms according to their physical and cellular characteristics. In order to study phylogenetics, a taxonomist uses methods from immunology, embryology and other related fields. That is, no one taxonomist will classify new species in all kingdoms of organisms. The student would, for instance, become a plant taxonomist or an animal taxonomist. Graduate studies in classification methodologies are often required for someone to become a practicing and respected taxonomist."}]