[{"url": "http://www.innerbody.com/image/nerv13.html", "passage_text": "Click to read more below. The ear is a group of sensory organs in the head that collaborate to produce the sense of hearing. Together these organs perform the amazing function of converting sound waves in air into electrical signals to transmit to the brain. "}, {"url": "https://www.nde-ed.org/EducationResources/HighSchool/Sound/humanear.htm", "passage_text": "THE HUMAN EAR. After reading this section you will be able to do the following: 1  Explain the main parts of the human ear and how they contribute to our hearing."}, {"url": "http://www.webmd.com/brain/picture-of-the-ear", "passage_text": "All rights reserved. The ear has external, middle, and inner portions. The outer ear is called the pinna and is made of ridged cartilage covered by skin. Sound funnels through the pinna into the external auditory canal, a short tube that ends at the eardrum (tympanic membrane). Sound causes the eardrum and its tiny attached bones in the middle portion of the ear to vibrate, and the vibrations are conducted to the nearby cochlea. The spiral-shaped cochlea is part of the inner ear; it transforms sound into nerve impulses that travel to the brain."}, {"url": "http://www.youtube.com/watch?v=p3Oy4lodZU4", "passage_text": "Ear Anatomy | Inside the ear | 3D Human Ear animation video | Biology | Elearnin. Ear is that part of the human body that detects sound from the environment and delivers it to the brain. With the help of a ear, humans have the ability to locate the sources of sound. Apart from just being a receiver of sound, it also plays a major role in maintaining a proper balance and position of the body. The cochlea is a shell-like structure. The Eustachian tube controls the amount of pressure in the ear. The auditory nerve carries the sound to the brain and it is the brain that interprets the sound. The ear together with the brain, controls the balance"}, {"url": "http://www.asha.org/public/hearing/How-We-Hear/", "passage_text": "How We Hear. Parts of the Ear: Outer Ear | Middle Ear | Inner Ear. Hearing is one of the five senses. It is a complex process of picking up sound and attaching meaning to it. The ability to hear is critical to understanding the world around us. The ear can be divided into three parts leading up to the brain – the outer ear, middle ear and the inner ear. 1  The outer ear consists of the ear canal and eardrum. 2  Sound travels down the ear canal, striking the eardrum and causing it to move or vibrate."}, {"url": "https://www.nde-ed.org/EducationResources/HighSchool/Sound/humanear.htm", "passage_text": "The human ear has three main sections, which consist of the outer ear, the middle ear, and the inner ear. Sound waves enter your outer ear and travel through your ear canal to the middle ear. After reading this section you will be able to do the following: 1  Explain the main parts of the human ear and how they contribute to our hearing."}, {"url": "http://www.physicsclassroom.com/class/sound/Lesson-2/The-Human-Ear", "passage_text": "The ear consists of three basic parts-the outer ear, the middle ear, and the inner ear. Each part of the ear serves a specific purpose in the task of detecting and interpreting sound. The three parts of the ear are shown below. The Outer Ear The outer ear consists of an earflap and an approximately 2-cm long ear canal. The earflap provides protection for the middle ear in order to prevent damage to the eardrum."}, {"url": "http://www.physicsclassroom.com/class/sound/Lesson-2/The-Human-Ear", "passage_text": "The Human Ear. Understanding how humans hear is a complex subject involving the fields of physiology, psychology and acoustics. In this part of Lesson 2, we will focus on the acoustics (the branch of physics pertaining to sound) of hearing. The three parts of the ear are shown below. The Outer Ear The outer ear consists of an earflap and an approximately 2-cm long ear canal. The earflap provides protection for the middle ear in order to prevent damage to the eardrum."}, {"url": "http://www.physicsclassroom.com/class/sound/Lesson-2/The-Human-Ear", "passage_text": "The outer ear serves to collect and channel sound to the middle ear. The middle ear serves to transform the energy of a sound wave into the internal vibrations of the bone structure of the middle ear and ultimately transform these vibrations into a compressional wave in the inner ear. The three parts of the ear are shown below. The Outer Ear The outer ear consists of an earflap and an approximately 2-cm long ear canal. The earflap provides protection for the middle ear in order to prevent damage to the eardrum."}, {"url": "https://en.wikipedia.org/wiki/Ear", "passage_text": "The ear is the organ that detects sound. It not only receives sound, but also aids in balance and body position. The ear is part of the auditory system. Often the entire organ is considered the ear, though it may also be considered just the visible portion. The lobule of the ear (ear lobe) is the one part of the human auricle that normally contains no cartilage. Instead, it is a wedge of adipose tissue (fat) covered by skin. There are many normal variations to the shape of the ear lobe, which may be small or large."}]