[{"url": "http://www.everydayhealth.com/drugs/hydrochlorothiazide", "passage_text": "A: Hydrochlorothiazide (HCTZ) is a thiazide diuretic (water pill) that is used to treat edema (fluid retention) from various causes such as congestive heart failure, cirrhosis of the liver, kidney disorders, or medication-induced (from estrogen or steroids). Hydrochlorothiazide may also be prescribed to treat calcium-containing kidney stones because it decreases the amount of calcium excreted by the kidneys in the urine, thus reducing the amount of calcium available to form stones."}, {"url": "http://www.webmd.com/drugs/2/drug-5310/hydrochlorothiazide-oral/details/list-conditions", "passage_text": "hydrochlorothiazide oral is used to treat the following: High Blood Pressure, Accumulation of Fluid Resulting from Chronic Heart Failure, Fluid in the Lungs due to Chronic Heart Failure, Visible Water Retention. "}, {"url": "http://www.everydayhealth.com/drugs/hydrochlorothiazide", "passage_text": "A: Hydrochlorothiazide (HCTZ) is a medication that is used to treat fluid retention and high blood pressure. It is classified as a thiazide diuretic (water pill) that helps the kidneys remove more salt and water from the bloodstream, which will decrease the blood volume and reduce blood pressure. Hydrochlorothiazide may also be prescribed to treat calcium-containing kidney stones because it decreases the amount of calcium excreted by the kidneys in the urine, thus reducing the amount of calcium available to form stones."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0010584/?report=details", "passage_text": "These problems may be less likely to occur if blood pressure is controlled. Hydrochlorothiazide is also used to treat fluid retention (edema) that is caused by congestive heart failure, severe liver disease (cirrhosis), kidney disease, or treatment with a steroid or hormone medicine. Hydrochlorothiazide is a thiazide diuretic (water pill). "}, {"url": "http://www.mayoclinic.org/drugs-supplements/hydrochlorothiazide-oral-route/description/DRG-20071841", "passage_text": "Hydrochlorothiazide is also used to treat fluid retention (edema) that is caused by congestive heart failure, severe liver disease (cirrhosis), kidney disease, or treatment with a steroid or hormone medicine. Hydrochlorothiazide is a thiazide diuretic (water pill). "}, {"url": "http://www.webmd.com/drugs/2/drug-5310/hydrochlorothiazide-oral/details", "passage_text": "Uses. This medication is used to treat high blood pressure. Lowering high blood pressure helps prevent strokes, heart attacks, and kidney problems. Hydrochlorothiazide is a water pill (diuretic) that causes you to make more urine. This helps your body get rid of extra salt and water. This medication also reduces extra fluid in the body (edema) caused by conditions such as heart failure, liver disease, or kidney diseas"}, {"url": "http://www.medicinenet.com/hydrochlorothiazide/article.htm", "passage_text": "DRUG CLASS AND MECHANISM: Hydrochlorothiazide is a diuretic (water pill) used for treating high blood pressure (hypertension) and accumulation of fluid (edema). It works by blocking salt and fluid reabsorption from the urine in the kidneys, causing increased urine output (diuresis). PRESCRIBED FOR: Hydrochlorothiazide is used to treat excessive fluid accumulation and swelling (edema) of the body caused by heart failure, cirrhosis, chronic kidney failure, corticosteroid medications, and nephrotic syndrome."}, {"url": "http://www.everydayhealth.com/drugs/hydrochlorothiazide", "passage_text": "A: HCTZ is a commonly used abbreviation for the medication, hydrochlorothiazide. Hydrochlorothiazide is a diuretic or water pill that can be used to treat hypertension (high blood pressure) and edema (fluid retention). Hydrochlorothiazide may also be prescribed to treat calcium-containing kidney stones because it decreases the amount of calcium excreted by the kidneys in the urine, thus reducing the amount of calcium available to form stones."}, {"url": "http://www.everydayhealth.com/drugs/hydrochlorothiazide", "passage_text": "A: Hydrochlorothiazide (HCTZ) is a diuretic (water pill) that is used to treat edema (fluid retention) that is caused by congestive heart failure, kidney disorders and several other reasons. HCTZ is also used to treat hypertension (high blood pressure). Hydrochlorothiazide may also be prescribed to treat calcium-containing kidney stones because it decreases the amount of calcium excreted by the kidneys in the urine, thus reducing the amount of calcium available to form stones."}]