[{"url": "https://en.wikipedia.org/wiki/Malnutrition", "passage_text": "Malnutrition increases the risk of infection and infectious disease, and moderate malnutrition weakens every part of the immune system. For example, it is a major risk factor in the onset of active tuberculosis. Protein-energy malnutrition has two severe forms: marasmus (a lack of protein and calories) and kwashiorkor (a lack of just protein). Common micronutrient deficiencies include: a lack of iron, iodine, and vitamin A. During pregnancy, due to the body's increased need, deficiencies may become more common."}, {"url": "http://emedicine.medscape.com/article/1104623-clinical", "passage_text": "Elderly patients are often at risk for protein-energy malnutrition because of inadequate nutrition, which has been determined to be a common comorbid factor for increased morbidity and mortality in elderly burn victims. Populations in both acute-care and long-term facilities are at risk for clinically significant involuntary weight loss (IWL) that can result in protein-energy malnutrition. IWL is defined as a loss of 4.5 kg or greater than 5% of the usual body weight over a period of 6-12 months."}, {"url": "https://en.wikipedia.org/wiki/Malnutrition", "passage_text": "Malnutrition or malnourishment is a condition that results from eating a diet in which nutrients are either not enough or are too much such that the diet causes health problems. It may involve calories, protein, carbohydrates, vitamins or minerals. Protein-energy malnutrition has two severe forms: marasmus (a lack of protein and calories) and kwashiorkor (a lack of just protein). Common micronutrient deficiencies include: a lack of iron, iodine, and vitamin A. During pregnancy, due to the body's increased need, deficiencies may become more common."}, {"url": "https://en.wikipedia.org/wiki/Malnutrition", "passage_text": "Malnutrition is caused by eating a diet in which nutrients are not enough or are too much such that it causes health problems. It is a category of diseases that includes undernutrition and overnutrition. Overnutrition can result in obesity and being overweight. Protein-energy malnutrition has two severe forms: marasmus (a lack of protein and calories) and kwashiorkor (a lack of just protein). Common micronutrient deficiencies include: a lack of iron, iodine, and vitamin A. During pregnancy, due to the body's increased need, deficiencies may become more common."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/9742460", "passage_text": "Risk factors for the prevalence of malnutrition among urban children in Ghana. Rikimaru T(1), Yartey JE, Taniguchi K, Kennedy DO, Nkrumah FK. Author information: (1)Institute for International Cooperation, JICA, Tokyo, Japan. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/childhood-schizophrenia/basics/risk-factors/CON-20029260", "passage_text": "Risk factors. Although the precise cause of schizophrenia isn't known, certain factors seem to increase the risk of developing or triggering schizophrenia, including: 1  Having a family history of schizophrenia. 2  Exposure to viruses, toxins or malnutrition while in the womb."}, {"url": "http://www.myvmc.com/diseases/malnutrition/", "passage_text": "Children and adolescents. In children and adolescents factors which predispose malnutrition include: 1  Low birth weight: Individuals born with a low birth weight are more likely to suffer malnutrition throughout their life and are unlikely to “catch-up” in terms of growth. Malnutrition is strongly associated with ill health, as both a cause and consequence. Individuals who are malnourished are more susceptible to disease and infection due to impaired immune function, and tend to consult health practitioners more frequently and take longer to recover from episodes of illness or injuries."}, {"url": "http://whqlibdoc.who.int/publications/2005/9241593660_eng.pdf", "passage_text": "In a study on cardiovascular risk factors in Italian adolescents attendingjunior high schools (Rabbia et al, 1994), the prevalence of obesity, based on BMI reference data from theUK, was 24% in boys and 19% in girls, and 39% of the remaining boys and 38% of the remaining girlswere in the overweight range. ii/ WHO Library Cataloguing-in-Publication DataNutrition in adolescence: issues and challenges for the health sector: issues inadolescent health and development.(WHO discussion papers on adolescence)1. Adolescent nutrition 2."}, {"url": "http://www.who.int/maternal_child_adolescent/topics/child/malnutrition/en/", "passage_text": "Malnutrition. Malnutrition is estimated to contribute to more than one third of all child deaths, although it is rarely listed as the direct cause. Lack of access to highly nutritious foods, especially in the present context of rising food prices, is a common cause of malnutrition. Poor feeding practices, such as inadequate breastfeeding, offering the wrong foods, and not ensuring that the child gets enough nutritious food, contribute to malnutrition. Infection – particularly frequent or persistent diarrhoea, pneumonia, measles and malaria – also undermines a child's nutritional status."}]