[{"url": "http://www.depression-test.net/cymbalta-dosage.html", "passage_text": "1 Chronic Musculoskeletal Pain: The same dose as recommended for Fibromyalgia starting out at 30 mg / day and increasing to 60 mg / day once in “maintenance mode”. 2  In all cases, the efficacy rate beyond a 3 month period has not been studied in formal clinical trials. The recommended Cymbalta dosage, based on the published Product Guide, are as follows: 1  Major Depressive Disorder: Starting daily dose is 40 mg and should be taken in two separate 20 mg doses."}, {"url": "http://www.rxlist.com/cymbalta-drug/indications-dosage.htm", "passage_text": "Dosage For Treatment Of Fibromyalgia. Administer CYMBALTA 60 mg once daily. Begin treatment at 30 mg once daily for 1 week, to allow patients to adjust to the medication before increasing to 60 mg once daily. Some patients may respond to the starting dose."}, {"url": "http://www.rxlist.com/cymbalta-drug/indications-dosage.htm", "passage_text": "Elderly. Initiate CYMBALTA at a dose of 30 mg once daily for 2 weeks before considering an increase to the target dose of 60 mg. Thereafter, patients may benefit from doses above 60 mg once daily. If a decision is made to increase the dose beyond 60 mg once daily, increase dose in increments of 30 mg once daily. Administer CYMBALTA 60 mg once daily. Begin treatment at 30 mg once daily for 1 week, to allow patients to adjust to the medication before increasing to 60 mg once daily. Some patients may respond to the starting dose."}, {"url": "http://www.depression-test.net/cymbalta-dosage.html", "passage_text": "The treatment for each of these will be somewhat different, hence the dose is different as well. The recommended Cymbalta dosage, based on the published Product Guide, are as follows: 1  Major Depressive Disorder: Starting daily dose is 40 mg and should be taken in two separate 20 mg doses. 2  In “maintenance mode” the recommended dose is 60 mg and can be taken all at once or as two separate 30 mg doses"}, {"url": "http://anxiety.emedtv.com/duloxetine/duloxetine-dosing.html", "passage_text": "Duloxetine Dosing for Depression. The recommended duloxetine dose for depression is duloxetine 20 mg twice daily, 30 mg twice daily, or 60 mg once daily. Doses above duloxetine 60 mg per day are not recommended. Duloxetine Dosing for Neuropathy. The recommended dose of duloxetine for peripheral diabetic neuropathy pain is duloxetine 60 mg once daily. Your healthcare provider may decide to start you at a lower duloxetine dose, especially if you have kidney problems. The recommended starting dose for fibromyalgia is 30 mg once a day. The dose of duloxetine hydrochloride (Cymbalta ®) your healthcare provider prescribes will vary depending on a number of factors, including:"}, {"url": "http://depression.emedtv.com/cymbalta/cymbalta-dosage.html", "passage_text": "Depression. The recommended dose for depression is Cymbalta 20 mg twice daily, 30 mg twice daily, or 60 mg once daily. Doses above 60 mg per day are not recommended. Neuropathic Pain. The recommended dosage of Cymbalta for peripheral diabetic neuropathy pain is 60 mg once daily. Fibromyalgia. The recommended starting dosage for fibromyalgia treatment is Cymbalta 30 mg once a day for one week, after which your healthcare provider may increase the dosing to 60 mg once daily. Musculoskeletal Pain."}, {"url": "http://www.rxlist.com/cymbalta-drug/indications-dosage.htm", "passage_text": "Administer CYMBALTA at a total dose of 40 mg/day (given as 20 mg twice daily) to 60 mg/day (given either once daily or as 30 mg twice daily). For some patients, it may be desirable to start at 30 mg once daily for 1 week, to allow patients to adjust to the medication before increasing to 60 mg once daily. Administer CYMBALTA 60 mg once daily. Begin treatment at 30 mg once daily for 1 week, to allow patients to adjust to the medication before increasing to 60 mg once daily. Some patients may respond to the starting dose."}, {"url": "http://www.webmd.com/fibromyalgia/guide/cymbalta-for-fibromyalgia-treatment", "passage_text": "Cymbalta (duloxetine) is an antidepressant used for the treatment of fibromyalgia. Fibromyalgia is a chronic disorder that causes widespread muscle pain and tenderness, trouble sleeping, and overwhelming tiredness. Cymbalta belongs to a class of medications called serotonin and norepinephrine reuptake inhibitors (SNRIs). The FDA previously approved Cymbalta for the treatment of depression, generalized anxiety disorder, and diabetic peripheral neuropathic pain"}]