[{"url": "http://forums.redflagdeals.com/montessori-deduct-tax-861198/", "passage_text": "Hi i have a 3 year old and I am thinking of putting him into the Montessori school .So couple of questions 1) if the fees is $6500 for half day program at Rotherglen(Mississauga) how much is tax deductible. 2) Can anyone guide me to a good pre school montessori or Co-Op in mississauga. My son is also in a Montessori 5 days a week in the casa program and I did receive a tax receipt from the school. My question is, do I file the receipt under child care expense or under tuition? My understanding is there is a difference in the amount of credit right? Please advise."}, {"url": "http://www.justanswer.com/tax/04vdo-montessori-school-tax-deduction.html", "passage_text": "1. The first benefit is a state tax deduction (or subtraction) which reduces your taxable income. If you have eligible child or dependent care expenses, first determine your federal tax credit by completing the calculation on either federal Form 2441 or Schedule 2 of federal Form 1040A."}, {"url": "http://finance.zacks.com/can-claim-expenses-preschool-tax-deduction-8813.html", "passage_text": "Depending on your income, you can claim a tax credit for up to 35 percent of your preschool expenses, up to $3,000 for one child or $6,000 for two or more children, applied directly, dollar-for-dollar, to your taxes owed for the year. Qualifying Person. Tax credits on preschool expenses must be for a qualifying person. This is generally your own child, natural born or adopted. Foster children, grandchildren, and other relatives also qualify, if you claim the person as an exemption on your income tax return."}, {"url": "http://www.kiplinger.com/article/taxes/T054-C001-S001-faqs-on-the-child-care-tax-credit.html", "passage_text": "Keep in mind that this is a credit, not a deduction, so it lowers your tax bill dollar for dollar. Does the cost of kindergarten count toward the credit? No. The cost of kindergarten and higher grades is considered to be an educational expense, not a child-care expense, so it doesn't qualify for the child-care credit. The cost of day care, preschool, before-and after-school care, day camp, or a nanny or other babysitter can count toward the credit."}, {"url": "http://www.kiplinger.com/article/taxes/T054-C001-S001-faqs-on-the-child-care-tax-credit.html", "passage_text": "That depends on the number of children, the cost of care, and your income. You can count up to $3,000 in child-care expenses for one child, or up to $6,000 for two or more children. The credit is a percentage of the amount spent on child care, and that percentage gradually decreases as income increases. The cost of day care, preschool, before-and after-school care, day camp, or a nanny or other babysitter can count toward the credit."}, {"url": "http://www.ehow.com/info_7820679_preschool-tuition-tax-deductible.html", "passage_text": "Shares & Saves. Save. There is no tax deduction for preschool. You can qualify for a tax credit for preschool payments if you are sending your child to preschool so you can work or look for work. You are out of luck however, if you are a stay-at-home parent that sends his child to preschool because he believes in the benefits of preschool."}, {"url": "http://www.khalsamontessorischool.com/friends-family/donation/donation-faq/", "passage_text": "Yes, any donation you make to Khalsa Family Services, Inc, Khalsa School or Khalsa Montessori School is deductible on both your federal tax return and your state tax return if you qualify to itemize your deductions. The KCO is a separate legal entity, and is not part of the charter school. Donations you make to the KCO are deductible on your tax returns as itemized deductions, but do not qualify for a state tax credit."}, {"url": "http://finance.zacks.com/can-claim-private-prek-tax-deduction-8905.html", "passage_text": "Having a child is expensive, and most of the costs are not tax deductible. Paying for pre-K can qualify for a tax break, but paying for private kindergarten or a private elementary school never does. If you qualify, you get your tax break not as a deduction, but rather as a child-care tax credit. You can only claim the credit if you need your child to be in the pre-K program so that you can work or look for work. If you're married and filing a joint return, you and your spouse must both be working or job-hunting to claim the child-care credit."}, {"url": "http://www.forbes.com/sites/kellyphillipserb/2014/07/12/12-expenses-that-arent-tax-deductions-for-most-taxpayers/", "passage_text": "1 Private school. 2  Private school expenses (including tuition) are not deductible. 3  However, expenses for a child in nursery school, preschool, or similar programs for children below the level of kindergarten are deductible for purposes of the child care tax credit if they otherwise qualify as child care. "}]