[{"url": "http://www.answers.com/Q/How_long_is_the_drive_to_Charlotte_North_Carolina_from_Savannah_Georgia", "passage_text": "The driving distance between Atlanta, GA and Charlotte, NC is approximately 245 miles. The driving time would be approximately 4 hours if you were to travel non-stop in good d … riving conditions."}, {"url": "http://www.answers.com/Q/How_long_is_the_drive_to_Charlotte_North_Carolina_from_Savannah_Georgia", "passage_text": "The driving distance between Charlotte, NC and Detroit, MI is approximately 670 miles. The driving time would be approximately 10 hours 30 minutes if you were to travel non-st … op in good driving conditions."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_drive_from_Charlotte_North_Carolina_to_Atlanta_Georgia", "passage_text": "Confidence votes 13. The driving distance between Atlanta, GA and Charlotte, NC is approximately 245 miles. The driving time would be approximately 4 hours if you were to travel non-stop in good driving conditions."}, {"url": "http://www.answers.com/Q/How_long_is_the_drive_to_Charlotte_North_Carolina_from_Savannah_Georgia", "passage_text": "The driving distance between Charlotte, NC and Orlando, FL is approximately 525 miles. The driving time would be approximately 8 hours 45 minutes if you were to travel non-sto … p in good driving conditions."}, {"url": "http://www.travelmath.com/driving-time/from/Savannah,+GA/to/Charlotte,+NC", "passage_text": "How long is the drive from Savannah, GA to Charlotte, NC? The total driving time is 4 hours, 2 minutes. Your trip begins in Savannah, Georgia. It ends in Charlotte, North Carolina. If you're planning a road trip, you might be interested in seeing the total driving distance from Savannah, GA to Charlotte, NC."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_drive_from_Charlotte_North_Carolina_to_Atlanta_Georgia", "passage_text": "The driving distance between Charlotte, NC and Detroit, MI is approximately 670 miles. The driving time would be approximately 10 hours 30 minutes if you were to travel non-st … op in good driving conditions."}, {"url": "http://www.answers.com/Q/How_long_is_the_drive_to_Charlotte_North_Carolina_from_Savannah_Georgia", "passage_text": "The driving distance between Charlotte, NC and Richmond, VA is approximately 295 miles. The driving time would be approximately 4 hours 45 minutes if you were to travel non-st … op in good driving conditions."}, {"url": "http://www.travelmath.com/driving-time/from/Charlotte,+NC/to/Savannah,+GA", "passage_text": "The total driving time is 4 hours, 3 minutes. Your trip begins in Charlotte, North Carolina. It ends in Savannah, Georgia. If you're planning a road trip, you might be interested in seeing the total driving distance from Charlotte, NC to Savannah, GA."}, {"url": "http://www.answers.com/Q/How_long_is_the_drive_to_Charlotte_North_Carolina_from_Savannah_Georgia", "passage_text": "The time it takes to drive to Charlotte, NC from Savannah, GA, is approximately 4 hours and 30 minutes."}]