[{"url": "http://www.healthcare-salaries.com/therapists/physiotherapist-salary", "passage_text": "Physiotherapist salary in USA. The average annual salary for physiotherapist in the US ranges from $55,083 to $91,242, which includes a basic salary of around $51,459 to $83,204, a bonus of up to $3,950, profit sharing of $5,357, and a commission of $5,918. New physiotherapist earns $49,290 to $70,514. The hourly wage for starting physiotherapist is $24.93 to $35.98 per hour. The more experienced ones who have been working for more than 20 years in this profession earn around $32.21 to $50.68 per hour."}, {"url": "http://money.usnews.com/careers/best-jobs/physical-therapist/salary", "passage_text": "Salary Outlook. The median annual wage for physical therapists was $81,030 in 2013, according to the BLS. The best-paid 10 percent made $113,340, while the bottom 10 percent made $56,280. The highest wages go to physical therapists working in schools, home health care or nursing care facilities. The best-paid physical therapists live in the metropolitan areas of Laredo, Texas; Las Vegas; and Brownsville, Texas"}, {"url": "http://www.healthcare-salaries.com/therapists/physiotherapist-salary", "passage_text": "Industry-wise, physiotherapists earn around $50,084 to $83,337 in hospitals, $58,684 to $99,180 in home health care, $54,159 to $80,894 in an orthopedist’s office, and $51,715 to $86,385 in nursing homes. The degree obtained by physiotherapist is another factor that affects their salary. The hourly wage for starting physiotherapist is $24.93 to $35.98 per hour. The more experienced ones who have been working for more than 20 years in this profession earn around $32.21 to $50.68 per hour."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-does-a-physical-therapist-make/", "passage_text": "How much do physical therapists make? According to May 2012 records from the Bureau of Labor Statistics, the mean annual physical therapist salary is $81,110. In other words, the 191,460 physical therapists employed nationwide received a mean hourly wage of $38.99. On the flip side, the states with the lowest annual salary for physical therapists are Hawaii at $67,000, Louisiana at $71,000, and Nebraska at $74,000. While all states compensate physical therapists quite well, physical therapists can earn a very lucrative six-figure salary within certain industries and states."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-does-a-physical-therapist-make/", "passage_text": "However, the salary of a physical therapist varies greatly depending on experience level, location, industry, and specialty. The highest paying industries for physical therapists are in home health care services at $90,440, as well as scientific consulting services at $87,170 annually. On the flip side, the states with the lowest annual salary for physical therapists are Hawaii at $67,000, Louisiana at $71,000, and Nebraska at $74,000. While all states compensate physical therapists quite well, physical therapists can earn a very lucrative six-figure salary within certain industries and states."}, {"url": "http://work.chron.com/much-money-physiotherapists-make-22141.html", "passage_text": "Half of physical therapists made between $66,950 and $92,860 per year, while the highest-paid 10 percent of physical therapists reported high annual salaries of $112,020 or more. As of 2012, physical therapists working in Nevada reported the highest average salary in the country, $110,670 per year. Those working in Alaska reported the second-highest average salary, $89,950 per year."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-does-a-physical-therapist-make/", "passage_text": "Physical therapists specialized in pediatrics can earn up to $77,737 each year, while those trained in neurology can make up to $116,350. Newly licensed physical therapists with less than one year of experience may only earn around $69,858, but those with 20 plus years of experience tend to gross up to $98,281. Furthermore, the top-paying states within the physical therapy occupation are Nevada at $110,670, Alaska at $89,950, and New Jersey at $89,830. On the flip side, the states with the lowest annual salary for physical therapists are Hawaii at $67,000, Louisiana at $71,000, and Nebraska at $74,000. While all states compensate physical therapists quite well, physical therapists can earn a very lucrative six-figure salary within certain industries and states."}]