[{"url": "http://stackoverflow.com/questions/3493405/do-i-really-need-to-encode-as-amp", "passage_text": "I'm using an ' & ' symbol with HTML5 and UTF-8 in my site's. Google shows the ampersand fine on its SERPs, as do all the browsers in their titles. http://validator.w3.org is giving me this: & did not start a character reference. "}, {"url": "http://www.techrepublic.com/article/beware-of-the-ampersand-when-using-xml/", "passage_text": "Beware of the ampersand when using XML. An XML document is a great way to represent information. But some characters, such as the ampersand, can be problematic because they have special meaning. Here is how to avoid the pitfalls presented by the ampersand and other special characters. "}, {"url": "https://en.wiktionary.org/wiki/ampersand", "passage_text": "Etymology [edit]. The Roman ampersand on the left is stylised, but the italic one on the right is clearly similar to et. A mondegreen of and per se and, meaning and (the character) '&' by itself, which is how the symbol (&) was originally referred to in English. "}, {"url": "http://www.symbols.com/symbol/417", "passage_text": "This page is about the meaning, origin and characteristic of the symbol, emblem, seal, sign, logo or flag: Ampersand. An ampersand (or epershand; &) is a logogram representing the conjunction word and. This symbol is a ligature of the letters et, Latin for and. Graphical characteristics: Asymmetric, Open shape, Monochrome, Contains both straight and curved lines, Has crossing lines."}, {"url": "http://www.thefreedictionary.com/Amperstamp", "passage_text": "Noun. 1. ampersand-a punctuation mark (&) used to represent conjunction (and). punctuation mark, punctuation-the marks used to clarify meaning by indicating separation of words into sentences and clauses and phrases. Translations. 1 Ampersand 2  (&). Ampersand 3  (&). Ampersand (punctuation). 4  Ampersand (punctuation). 5  ampersand codes. 6  ampersand codes. 7  ampersand codes. 8  ampersand codes. 9  Ampersand Info-Tech Pvt. Ltd."}, {"url": "http://www.merriam-webster.com/dictionary/ampersand", "passage_text": "Full Definition of AMPERSAND. : a character typically & standing for the word and. See ampersand defined for English-language learners. See ampersand defined for kids. ADVERTISEMENT. "}, {"url": "http://www.thefreedictionary.com/ampersand", "passage_text": "Noun. 1. ampersand-a punctuation mark (&) used to represent conjunction (and). punctuation mark, punctuation-the marks used to clarify meaning by indicating separation of words into sentences and clauses and phrases. Translations. "}, {"url": "http://www.webdesignerdepot.com/2010/01/the-history-of-the-ampersand-and-showcase/", "passage_text": "A Brief History of the Ampersand. The ampersand can be traced back to the first century AD. It was originally a ligature of the letters E and T (“et” is Latin for and). If you look at the modern ampersand, you’ll likely still be able to see the E and T separately. "}, {"url": "http://www.computerhope.com/jargon/a/ampersand.htm", "passage_text": "Ampersand. The Ampersand (&) symbol, also referred to as the  epershand  or  and  symbol, is found above the number 7 key on a US QWERTY keyboard. In literature or English text, the ampersand is used as shorthand to mean and, as in John & Rob went to the baseball game. URL example. Within a URL the ampersand is used to separate variables. For example, in the example below there are two different variables, q that equals example search and example that equals test. These variables can be read by the search.cgi script and used to perform different functions."}]