[{"url": "https://en.wikipedia.org/wiki/California", "passage_text": "The word California originally referred to the entire region composed of the Baja California Peninsula of Mexico, the current U.S. states of California, Nevada, and Utah, and parts of Arizona, New Mexico, Texas and Wyoming. The two most prominent rivers within California are the Sacramento River and the San Joaquin River, which drain the Central Valley and the west slope of the Sierra Nevada and flow to the Pacific Ocean through San Francisco Bay."}, {"url": "http://www.50states.com/facts/california.htm", "passage_text": "List of California Facts and Trivia. 1  California's Mount Whitney measures as the highest peak in the lower 48 states. 2  Its most famous climb is Mount Whitney Trail to the 14,495 feet summit. 3  Wilderness permits are required. 1 California's Mount Whitney measures as the highest peak in the lower 48 states. 2  Its most famous climb is Mount Whitney Trail to the 14,495 feet summit. 3  Wilderness permits are required. 4  In 1925 a giant sequoia located in California's Kings Canyon National Park was named the nation's national Christmas tree."}, {"url": "http://mentalfloss.com/article/58921/15-things-you-might-not-know-about-california", "passage_text": "California is the most populous state (and the third largest by area). To put California's population, approximately 38 million people, in perspective, one out of every eight Americans is from California. 9. The fortune cookie was inspired by the Japanese fortune tradition o-mikuji and invented in California. 12. California's most famous for its Gold Rush which began in 1848, but it also had a Silver Rush in the Calico Mountains from 1881 to 1896. By 1904, Calico was a ghost town."}, {"url": "http://www.answers.com/Q/What_is_California_famous_for", "passage_text": "1 5 Famous California Inventors California is the most populous state in the entire country. 2  It is home to famous landmarks like the Golden Gate Bridge, Alcatraz, and Yosemite National Park. 3  While sunny Cal…. 1 It is home to famous landmarks like the Golden Gate Bridge, Alcatraz, and Yosemite National Park. 2  While sunny Cal…. 3  5 Places to Check California Highway Closures When planning a road trip through California, it is important to check the route you will be traveling for hazards and conditions that will slow you down."}, {"url": "https://en.wikipedia.org/wiki/California", "passage_text": "California's diverse geography ranges from the Sierra Nevada in the east to the Pacific Coast in the west, from the redwood – Douglas fir forests of the northwest, to the Mojave Desert areas in the southeast. The two most prominent rivers within California are the Sacramento River and the San Joaquin River, which drain the Central Valley and the west slope of the Sierra Nevada and flow to the Pacific Ocean through San Francisco Bay."}, {"url": "http://www.eioba.com/a/hof/what-makes-california-famous", "passage_text": "California-The Golden State. It is famous for many things everyone knows but also for things that'll probably surprise you. Most of us know that California is the home of movie stars (of course Hollywood is there), but very few people know that it is one of the major cheese producing States in the USA! vote. California-The Golden State. It is famous for many things everyone knows but also for things that'll probably surprise you. Most of us know that California is the home of movi..."}, {"url": "http://www.answers.com/Q/What_is_California_famous_for", "passage_text": "Share to: 1  5 Famous California Inventors California is the most populous state in the entire country. 2  It is home to famous landmarks like the Golden Gate Bridge, Alcatraz, and Yosemite National Park. 1 It is home to famous landmarks like the Golden Gate Bridge, Alcatraz, and Yosemite National Park. 2  While sunny Cal…. 3  5 Places to Check California Highway Closures When planning a road trip through California, it is important to check the route you will be traveling for hazards and conditions that will slow you down."}, {"url": "http://www.qwhatis.com/what-is-los-angeles-known-for/", "passage_text": ". Los Angeles is the biggest city in the state of California and one of the biggest in the US and around the world. This city is known for most of the world as one of the US’ entertainment capital. Hollywood is arguably the district that defines Los Angeles as an entertainment center not only the US but for the rest of the world."}, {"url": "http://www.qwhatis.com/what-is-los-angeles-known-for/", "passage_text": "Los Angeles is the biggest city in the state of California and one of the biggest in the US and around the world. This city is known for most of the world as one of the US’ entertainment capital. Hollywood is arguably the district that defines Los Angeles as an entertainment center not only the US but for the rest of"}]