[{"url": "https://en.wikipedia.org/wiki/Ice_hockey_stick", "passage_text": "An ice hockey stick is a piece of equipment used in ice hockey to shoot, pass, and carry the puck. Ice hockey sticks are approximately 150–200 cm long, composed of a long, slender shaft with a flat extension at one end called the blade. The blade is the part of the stick used to contact the puck, and is typically 25 to 40 cm long. The oldest known hockey stick was made in 1830's. This stick was made by William Moffatt between 1835-38 from sugar maple wood. This stick was sold to the Canadian museum of history for $300,000 bought by a social worker in New Brunswick off a barber for $1000."}, {"url": "http://www.madehow.com/Volume-4/Hockey-Stick.html", "passage_text": "The origin of the game of hockey is a hazy and contentious issue. Various forms of field hockey were played in Scotland, Ireland, and France as early as the sixteenth century. A game involving sticks and balls played on ice called kolven was first recorded in Holland in the seventeenth century. "}, {"url": "http://www.usstuff.com/hokystki.htm", "passage_text": "and shafts from: Hockey Workout, San Jose, Calif. Watch out for: Easton ice hockey sticks made in Mexico; Hespeller, Bauer, Nike, Itech, Titan, VIC, Sher-Wood and CCM ice hockey sticks made in Canada; Montreal ice hockey sticks made in Finland and an ice hockey stick made and or assembled in another country. Say YES! to: Toll free 877-807-5291. hockeyinfo@mikensports.com. Watch out for: Easton ice hockey sticks made in Mexico; Hespeller, Bauer, Nike, Itech, Titan, VIC, Sher-Wood and CCM ice hockey sticks made in Canada; Montreal ice hockey sticks made in Finland and an ice hockey stick made and or assembled in another country."}, {"url": "http://nhlhockeyice.com/ice-hockey-sticks/how-hockey-sticks-are-made/", "passage_text": "Hockey sticks currently are made of different materials, each having its own characteristics. They also vary in shaft length, circumference, shape, flexibility, balance, kick point, and blade characteristics. Composite sticks can be composed of different materials like wood, fiberglass, aluminum, carbon fiber, titanium, or Kevlar. They can be made with the blade and the shaft in separate pieces or as a one piece hockey stick. You’ll commonly find composite sticks to be (or close to). 1  20% graphite with 80% firberglass; 2  50% graphite with 50% fiberglass; 3  100% graphite"}, {"url": "https://en.wikipedia.org/wiki/Hockey_stick", "passage_text": "In the event of roller hockey, one-piece sticks are usually the same as ice hockey sticks. But when graphite shafts are used with replacement blades, it's quite common for the replacement blades to be made of mainly fiberglass with a narrow wood core. More expensive ice hockey sticks (such as the Bauer Vapor APX 2, Bauer Supreme TotalOne NXG, Bauer Nexus 8000, Reebok 20k, Reebok Ribcore, Easton Stealth RS 2, Easton V9 & V9E, Warrior Covert DX1) usually are the lightest sticks on the market (390-470 grams in a senior stick)."}, {"url": "http://www.answers.com/Q/How_is_a_hockey_stick_made", "passage_text": "Ice Hockey   Composite, or 1 piece sticks are actually made of 2 pieces. The shaft is hollow, and the blade is inserted into the shaft, then a coating is applied to the s … tick, making it look like it is made in one piece.   The inside is wood and it is fibreglass reinforced. Wood is the traditional material, and a wood stick is the cheapest one. Made in two … parts, the shaft and the blade, and joined together at the point where the shaft meets the blade, with a type of joint that is quite strong. The blade's length is regulated, as is the curvature of it"}, {"url": "https://en.wikipedia.org/wiki/Hockey_stick", "passage_text": "A hockey stick is a piece of equipment used in field hockey, ice hockey, roller hockey or underwater hockey to move the ball or puck. More expensive ice hockey sticks (such as the Bauer Vapor APX 2, Bauer Supreme TotalOne NXG, Bauer Nexus 8000, Reebok 20k, Reebok Ribcore, Easton Stealth RS 2, Easton V9 & V9E, Warrior Covert DX1) usually are the lightest sticks on the market (390-470 grams in a senior stick)."}]