[{"url": "https://en.wikipedia.org/wiki/Endomembrane_system", "passage_text": "The endomembrane system is composed of the different membranes that are suspended in the cytoplasm within a eukaryotic cell. These membranes divide the cell into functional and structural compartments, or organelles. Its membrane is the site of production of all the transmembrane proteins and lipids for most of the cell's organelles, including the ER itself, the Golgi apparatus, lysosomes, endosomes, mitochondria, peroxisomes, secretory vesicles, and the plasma membrane."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20120511010001AAzUjjL", "passage_text": "Within the cell (inside a cell) that is from one part of the cell to another the answer is the Golgi Apparatus. The plasma membrane is responsible for transporting material from outside of the cell into the cell. Microtubules help to determine cell shape and in a variety of cells cause movements (flagellum, cilia etc). they are used to move organelles around the cell and for the separation of chromosomes during mitosis. None of those are very good but out of them the plasma membrane seems most appropriate. Endomembrane System Some cellular organelles work together to transport materials into, out of, and within the cell. This is the eukaryotic cell's endomembrane system, a manufacturing and material transport network that enables the cell to make, move and break down cellular product"}, {"url": "https://en.wikipedia.org/wiki/Endomembrane_system", "passage_text": "The nuclear membrane contains two lipid bilayers that encompass the contents of the nucleus. The endoplasmic reticulum (ER) is a synthesis and transport organelle that branches into the cytoplasm in plant and animal cells. Its membrane is the site of production of all the transmembrane proteins and lipids for most of the cell's organelles, including the ER itself, the Golgi apparatus, lysosomes, endosomes, mitochondria, peroxisomes, secretory vesicles, and the plasma membrane."}, {"url": "http://charlienconnor.weebly.com/organelles-of-a-cell.html", "passage_text": "Cell Membrane. Both the animal and plant cells have a cell membrane. The cell membrane is very important because it holds all of the cytoplasm and the organelles of that cell. It also determines what may enter and what may leave the cell. A chloroplasts and the Granum inside. The chloroplasts are composed of a double layer of modified membrane (protein, chlorophyll, lipid). the inner membrane invaginates to form layers called grana where chlorophyll is concentrated. This is the organelle that does photosynthesis for a plant cell."}, {"url": "http://www.answers.com/Q/What_organelle_is_the_transport_system_of_a_cell", "passage_text": "Split and merge into it. Answer by Mustardflakes. Confidence votes 15. The transport system of the cell between the nucleus and the cytoplam is the endoplasmic rectiulum which is a complex system of membranes in the cytoplasm of eukaryotic cells. "}, {"url": "https://en.wikipedia.org/wiki/Ion_channels", "passage_text": "Ion channels are present in the membranes of all cells. Ion channels are considered to be one of the two traditional classes of ionophoric proteins, with the other class known as ion transporters (including the sodium-potassium pump, sodium-calcium exchanger, and sodium-glucose transport proteins, amongst others). Ion channels are located within the plasma membrane of nearly all cells and many intracellular organelles. They are often described as narrow, water-filled tunnels that allow only ions of a certain size and/or charge to pass through. This characteristic is called selective permeability"}, {"url": "http://www.answers.com/Q/What_organelle_transports_molecules", "passage_text": "The transport system of the cell between the nucleus and the cytoplam is the endoplasmic rectiulum which is a complex system of membranes in the cytoplasm of eukaryotic cells. "}, {"url": "http://www.nature.com/scitable/topicpage/endoplasmic-reticulum-golgi-apparatus-and-lysosomes-14053361", "passage_text": "Exocystosis is the process of membrane transport that releases cellular contents outside of the cell. Here, a transport vesicle from the Golgi or elsewhere in the cell merges its membrane with the plasma membrane and releases its contents. A protein called coat protein II (COPII; green) forms vesicles that transport from the endoplasmic reticulum (ER) to the Golgi. A different protein called coat protein I (COPI; red) forms vesicles for transport in the other direction, from the Golgi to the ER."}]