[{"url": "http://www.bbc.co.uk/food/recipes/pastawithtomatoandpr_84471", "passage_text": "Place all of the ingredients, except the prawns, basil and spaghetti, into a deep saucepan over a medium heat, season with salt and freshly ground black peper and simmer for four minutes. Transfer the tomato sauce into a food processor and blend until smooth."}, {"url": "http://www.food.com/recipe/shrimp-sauce-for-pasta-2862", "passage_text": "1 Heat a large pot of water to the boil, add 1 tsp salt and pasta (cooking time about 11 minutes), then start your sauce. 2  When pasta is done, usually at the most critical point of cooking the sauce, reserve 1/4 cup of pasta water, and drain the pasta."}, {"url": "http://www.eatingwell.com/recipes/garlicky_shrimp_vegetable_pasta.html", "passage_text": "1 Bring a large pot of water to a boil. 2  Add spaghetti and cook 2 minutes less than package directions. 3  Add shrimp, asparagus, bell pepper and peas and cook until the pasta is tender and the shrimp are cooked, 2 to 4 minutes more. 4  Drain well. 5  Mash garlic and salt in a large bowl until a paste forms."}, {"url": "http://www.simplyrecipes.com/recipes/angel_hair_pasta_with_shrimp_and_lemon_cream_sauce/", "passage_text": "1 Bring a large pot of salted water to a boil. 2 In a smaller pot, heat the cream, chicken stock and lemon juice to a low simmer. Simmer gently for 5 minutes. 3 Add the angel hair pasta to the boiling water. 4 Add the shrimp to the simmering lemon cream sauce. Stir well and add a pinch of salt and black pepper."}, {"url": "http://www.foodnetwork.com/recipes/shrimp-with-garlic-cream-sauce-over-linguine-recipe.html", "passage_text": "In a saucepan bring 6 cups of water to a boil. Using a small paring knife, remove the vein along the back of each shrimp and rinse under running water. Add garlic to water and boil for two minutes. Add the shrimp to the water and cook with the garlic for 2-3 minutes. Drain the shrimp and garlic. Peel the garlic and finely chop. Heat oil in a large skillet over medium heat. Add garlic and cook for 1 minute. Pour in heavy cream and bring to a simmer. Cook until cream begins to thicken. Stir in parsley, Parmesan and shrimp. Season with salt and pepper. Pour sauce over linguine in a large bowl and toss to coat."}, {"url": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/penne-with-shrimp-and-herbed-cream-sauce-recipe.html", "passage_text": "Bring a large pot of salted water to a boil over high heat. Add the pasta and cook until tender but still firm to the bite, stirring occasionally, about 8 to 10 minutes. Drain the pasta and set aside. In a large skillet, heat the oil over medium-high heat. Add the shrimp, garlic, 1/2 teaspoon of salt, and 1/2 teaspoon of pepper. Cook, stirring frequently until the shrimp turn pink and is cooked through, about 3 minutes. Using a slotted spoon, remove the shrimp"}]