[{"url": "http://www.britannia.com/history/h7.html", "passage_text": "Some people see it as a place steeped in magic and mystery, some as a place where their imaginations of the past can be fired and others hold it to be a sacred place. But whatever viewpoint is brought to it and whatever its original purpose was, it should be treated as the ancients treated it, as a place of honor. SHOP. STONEHENGE Stonehenge is surely Britain's greatest national icon, symbolizing mystery, power and endurance. Its original purpose is unclear to us, but some have speculated that it was a temple made for the worship of ancient earth deities."}, {"url": "http://paganwiccan.about.com/od/sacredplaces/p/Stonehenge-Wiltshire-Uk.htm", "passage_text": "Stonehenge is known as a place of magic and mystery, and for centuries, people have been drawn to it. Even today, Stonehenge is the destination of choice for many Pagans during Sabbat celebrations. Certainly, it is one of the best known and most recognizable stone circles in the world. "}, {"url": "http://www.answers.com/Q/Is_Stonehenge_sacred", "passage_text": "The monument known as Stonehenge is a prehistoric circle of stones on Salisbury Plain in England. It has a history of construction that began in 3000 BC and the final modifica … tions were made around 1600 BC. Stonehenge is in the county of Wiltshire on Salisbury Plain. It's  just west of Amesbury in England and is visible  from the A303 road. The nearest city is Salisbury a few m … iles to  the south.   There are many Neolithic earthwork enclosures known as henges in  Britain."}, {"url": "http://www.beliefnet.com/wellness/2006/05/what-makes-a-power-spot-sacred.aspx", "passage_text": "A pilgrim and photographer explores the most potent, sacred places on Earth. 1 2 next. Stonehenge, Machu Picchu, the pyramids of Egypt, Jerusalem, Banaras, and Mt. Fuji. Since prehistoric times, these and other sacred places have exerted a mysterious attraction for millions of people around the world. It is a curious fact that while sacred sites represent the most visited category of places on the Earth (compared to cities where people live full time), there has been little scholarly study of the sites or the great pilgrimages to them."}, {"url": "http://witcombe.sbc.edu/sacredplaces/stonehenge.html", "passage_text": "STONEHENGE, ENGLAND. [for the following see also Stonehenge]. S tonehenge stands on the open downland of Salisbury Plain two miles (3 kilometres) west of the town of Amesbury, Wiltshire, in Southern England. It is not a single structure but consists of a series of earth, timber, and stone structures which were revised and re-modelled over a period of more than 2000 years. The earliest portion of the complex, which dates to approximately 3100-2300 BCE., comprised a circular bank-and-ditch of about 330 feet (100 metres) in diameter. Just inside the earth bank is a circle of the 56 Aubrey holes (discovered by John Aubrey in the 17th century, and now invisible on the surface)."}, {"url": "http://witcombe.sbc.edu/sacredplaces/sacredness.html", "passage_text": "An exploration of how and why places become invested with SACREDNESS and how the SACRED is embodied or made manifest through ART and ARCHITECTURE. SACREDNESS. T he SACRED is that which is the object of veneration and awe. The term comes from the Latin sacer meaning restricted or set off. A person may be designated as sacred, and so can an object or a place which is regarded as extraordinary or unique. The term sacer is closely related to numen meaning mysterious power or god. Numinous is used to describe the sacred to indicate its power."}, {"url": "https://en.wikipedia.org/wiki/Stonehenge", "passage_text": "Stonehenge is a prehistoric monument located in Wiltshire, England, about 2 miles (3 km) west of Amesbury and 8 miles (13 km) north of Salisbury. One of the most famous sites in the world, Stonehenge is the remains of a ring of standing stones set within earthworks. Another theory suggests the bluestones may have been raised at the site as early as 3000 BC. The site and its surroundings were added to the UNESCO 's list of World Heritage Sites in 1986 in a co-listing with Avebury Henge."}]