[{"url": "http://chempaths.chemeddl.org/services/chempaths/?q=book/General%20Chemistry%20Textbook/Properties%20of%20Organic%20Compounds%20and%20Other%20Covalent%20Substances/1373/s", "passage_text": "Silicon dioxide, or silica, (SiO 2) is another important example of a macromolecular solid A state of matter having a specific shape and volume and in which the particles do not readily change their relative positions. . Silica can exist in six different crystalline forms. "}, {"url": "http://answers.tutorvista.com/844085/is-silicon-dioxide-is-an-ionic-or-covalent-bond.html", "passage_text": "8495 Karma. 1. Silicon is a metal and oxygen is a non metal hence it will form both ionic and covalent bonds, pauling principle explains the ratio in detail. Was this answer helpful? "}, {"url": "http://web.calstatela.edu/dept/chem/07summer/158/25-words-silica.pdf", "passage_text": "It has been known since ancient times, is found in sand, and is a major component of glass. Silica is a chemical compound, also called silicon dioxide. It can sometimes be found as the substance, quartz which is usually used in jewelry, test tubes, and when placed under pressure, generates an electrical charge. "}, {"url": "http://gravity.wikia.com/wiki/Silicon_dioxide", "passage_text": "For other uses, see Silica (disambiguation) . The chemical compound silicon dioxide, also known as silica (from the Latin silex), is an oxide of silicon with a chemical formula of Template:SiliconTemplate:Oxygen and has been known for its hardness since antiquity. Silica is most commonly found in nature as sand or quartz, as well as in the cell walls of diatoms. In dimeric silicon dioxide there are two oxygen atoms bridging between the silicon atoms with an Si-O-Si angle of 94° and bond length of 164.6 pm and the terminal Si-O bond length is 150.2 pm. The Si-O bond length is 148.3 pm which compares with the length of 161 pm in α-quartz."}, {"url": "https://en.wikipedia.org/wiki/Silicon_dioxide", "passage_text": "Silicon dioxide, also known as silica (from the Latin silex), is a chemical compound that is an oxide of silicon with the chemical formula Si O 2. It has been known since ancient times. Silica is most commonly found in nature as quartz, as well as in various living organisms. The solubility of silicon dioxide in water strongly depends on its crystalline form and is 3–4 times higher for silica than quartz; as a function of temperature, it peaks at about 340 °C."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_pre_2011/chemicals/rocksmineralsrev3.shtml", "passage_text": "Silicon dioxide. Much of the silicon and oxygen in the Earth’s crust is present as the compound silicon dioxide also known as silica. Silicon dioxide has a giant covalent structure. Part of this structure is shown in the diagram-oxygen atoms are shown as red, silicon atoms shown as brown:"}, {"url": "http://ceramica.wikia.com/wiki/Silicon_dioxide", "passage_text": "Silica redirects here. For other uses, see Silica (disambiguation) . The chemical compound silicon dioxide, also known as silica (from the Latin silex), is an oxide of silicon with the chemical formula SiO2. It has been known for its hardness since antiquity. Silica is most commonly found in nature as sand or quartz, as well as in the cell walls of diatoms"}, {"url": "https://en.wikipedia.org/wiki/Silicon_dioxide", "passage_text": "In dimeric silicon dioxide there are two oxygen atoms bridging between the silicon atoms with an Si-O-Si angle of 94° and bond length of 164.6 pm and the terminal Si-O bond length is 150.2 pm. The Si-O bond length is 148.3 pm, which compares with the length of 161 pm in α-quartz. The solubility of silicon dioxide in water strongly depends on its crystalline form and is 3–4 times higher for silica than quartz; as a function of temperature, it peaks at about 340 °C."}]