[{"url": "http://www.savethestudent.org/student-jobs/whats-the-expected-salary-for-your-degree.html", "passage_text": "It’s easy to think of Law as a quick win for your pay packet, but the reality is starting salaries vary massively. At the most competitive firms, you could get between £22,000 and £42,000 as a Trainee Solicitor. Elsewhere, £16,000 to £30,000 is the going average. Maths (Accountancy). Salaries for Accountancy vary considerably depending on location, size of company and specialisation, with starting salaries averaging £20,000-£25,000 (some graduates have reported earning anything between £17,000 and £50,000 in their first job)."}, {"url": "https://targetjobs.co.uk/career-sectors/it-and-technology/286195-what-graduate-salary-can-i-expect-in-an-it-job", "passage_text": "Find out what starting salary you could earn on IT graduate schemes, and what typical earnings are like in the technology industry. Your graduate salary for your first IT job could be under £21,000 or over £30,000, depending on what you do and where you do it. Starting salaries for IT jobs tend to be highest at big, blue-chip employers. The following figures refer to 2015 entry, unless otherwise stated. 1  ARM graduate salary: £27,000 (2013 entry)."}, {"url": "http://graduatefog.co.uk/2013/2608/average-graduate-salary-29000-as-long-as-youre-on-a-prestigious-grad-scheme/", "passage_text": "Average graduate salary “£29,000″ (as long as you’re on a prestigious grad scheme). Published: Posted in: average graduate salary, Business, Employers and recruitment, graduate debt, Graduate Fog, Graduate unemployment, job hunting, Unpaid internships, Wages. “It’s great news for the Class of 2013. Public sector graduate recruits averaged a £22,000 starting salary and this sector saw one of the biggest expansions in recruitment, up by 18.6% in 2013. This was partly fuelled by the expansion of the Teach First scheme."}, {"url": "https://targetjobs.co.uk/career-sectors/it-and-technology/286195-what-graduate-salary-can-i-expect-in-an-it-job", "passage_text": "Average salaries for graduate IT jobs. According to Ben Broughton, director of Premier Group Recruitment, junior developers starting their first jobs after university typically earn £24,000 to £26,000 in London, and £21,000 to £23,000 in the southern England, Midlands or Manchester areas. Starting salaries for IT jobs tend to be highest at big, blue-chip employers. The following figures refer to 2015 entry, unless otherwise stated. 1  ARM graduate salary: £27,000 (2013 entry)."}, {"url": "http://www.totaljobs.com/salary-checker/average-graduate-salary-london", "passage_text": "Salary results for Graduate in London. Here you can see the average salary for the job you entered, based on our most recent job adverts. Our salary calculator also lets you view the highest and lowest salaries recently offered for that job, and how your current salary compares. Clicking on 'Top salaries' will provide you with a breakdown of salaries based on industry and locati"}, {"url": "http://www.savethestudent.org/student-jobs/whats-the-expected-salary-for-your-degree.html", "passage_text": "The average graduate starting salary is a fairly robust £25,000, though we’ve also seen folk reporting anything between £16,000 and £70,000! Who gets what depends on what subject you study, what industry you go into and even where in the country your dream job is based. Cue our guide to first-job wages. Maths (Accountancy). Salaries for Accountancy vary considerably depending on location, size of company and specialisation, with starting salaries averaging £20,000-£25,000 (some graduates have reported earning anything between £17,000 and £50,000 in their first job)."}, {"url": "https://www.naceweb.org/salary-resources/starting-salaries.aspx", "passage_text": "Starting Salaries Up 1.2 Percent for Class of 2014 Grads The average starting salary for new college graduates earning bachelor’s degrees has increased 1.2 percent over last year, according to NACE’s April 2014 Salary Survey. Class of 2014 First-Destination Survey: Salaries for Liberal Arts/Humanities Majors Liberal arts/general studies majors earned the top average starting salary among Class of 2014 liberal arts graduates at the bachelor’s degree level, according to NACE’s Spring 2015 Salary Survey report."}, {"url": "http://www.dailymail.co.uk/news/article-2905829/Aldi-s-42k-starting-salary-graduates-City-banks-offer-50k-student-job-hunters.html", "passage_text": "Aldi's £42,000 starting salary for graduates as City banks offer £50,000 to student job hunters. 1  Average starting wage for university leavers at Britain’s 100 leading employers will exceed £30,000 for the first time ever this year. 2  Aldi is offering the most generous declared wage outside of the City. Almost a third of graduate jobs at these firms now pay more than £35,000, with four well-known investment banks offering basic salaries of between £45,000 and £50,000. The figures come amid the best prospects for student job-hunters in a decade."}, {"url": "http://university.which.co.uk/advice/choosing-a-course/top-universities-for-graduate-starting-salaries", "passage_text": "Use our university finder and course finder to compare average graduate starting salaries. Remember, though, as a six month snapshot these average graduate salaries only show you the short-term picture-and will vary hugely according to the profession you choose to go into after you graduate. "}, {"url": "http://www.savethestudent.org/student-jobs/whats-the-expected-salary-for-your-degree.html", "passage_text": "A first salary in Retail Management will likely be in the range of £12,000-£22,000, but some graduate training schemes pay handsomely for impressive candidates. Budget supermaket chain Aldi is a go-to for its grad scheme, which pays £42,000 in the first year. Maths (Accountancy). Salaries for Accountancy vary considerably depending on location, size of company and specialisation, with starting salaries averaging £20,000-£25,000 (some graduates have reported earning anything between £17,000 and £50,000 in their first job)."}]