[{"url": "https://en.wikipedia.org/wiki/Horse_breeding", "passage_text": "Horse breeding is reproduction in horses, and particularly the human-directed process of selective breeding of animals, particularly purebred horses of a given breed. Planned matings can be used to produce specifically desired characteristics in domesticated horses. 1 Estrus, or Follicular, phase: 5–7 days in length, when the mare is sexually receptive to a stallion. 2  Estrogen is secreted by the follicle. 3  Ovulation occurs in the final 24–48 hours of estrus. 4  Diestrus, or Luteal, phase: 14–15 days in length, the mare is not sexually receptive to the stallion."}, {"url": "http://westphalia-ranch.com/mare_breeding_tips.htm", "passage_text": "4. 1  A typical healthy mare will first begin to cycle naturally in the spring once the daylight hours become longer. 2  She will be in a breeding heat for about 3 to 7 days. 3  It should be noted that many mares will not display signs of a visible heat until she is in the vicinity of a stallion. 1"}, {"url": "http://www.dancinghorseranch.com/breeding.html", "passage_text": "If a 2 year old is used as a breeding stallion the number of services should not exceed two per week and only 5 to 10 mares should be bred during the breeding season. The 3 year old stallion can be used four to six times per week. The mature stallion can be bred daily but he should get one day of rest every 7 to 8 days. If necessary, mature stallions can be used twice a day for 3 to 4 days each week. Early in the breeding season it is not uncommon for a mare to be in heat for 30 to 40 days without ovulating. This is generally a normal situation you may encounter. It is also not unusual for a mare to have a gestation period longer than 360 days."}, {"url": "https://answers.yahoo.com/question/index?qid=20090104172956AAzM5kU", "passage_text": "They are physically mature enough to breed as yearlings. But a breeding quality stallion has a great disposition, flawless conformation, and a show record. And for a stallion to fit that criteria, he's usually at least 3 years old. horseofcourse17 · 7 years ago. "}, {"url": "http://www.answers.com/Q/How_long_can_thoroughbred_stallions_be_used_for_breeding", "passage_text": "A thoroughbred horse can live for a very long time under the right  conditions. The average life expectancy for a thoroughbred horse is  25 to 30 years. "}, {"url": "http://www.horseforum.com/horse-breeding/how-long-after-gelding-can-horse-8452/", "passage_text": "I was really surprised they can still impregnate a mare after gelding. -------. The castration of a male horse is a simple surgical procedure with few risks. Sperm cells are produced in the testicles, matured and stored in the epididymus, and transported via the vas deferens to the ejaculatory site. My mare recently (as in yesterday) went into heat and my cousins gelding was in the pasture. He's only been gelded a few months... My mare was teasing him, and he mounted her. He was also beating the crud out of my two year old colt and was rounding the mares up and keeping my colt away from them..."}, {"url": "http://www.answers.com/Q/FAQ/10202", "passage_text": "How long do stallion horses stay in heat? A stallion never goes into heat as he is a MALE (boy) horse. Mare (girl horses come into heat on average ever 18-21 days and stay in 3-7 days with the last 24-48 hours being their actual fertile (conception period if mated. A horse's penis (from geldings and stallions) average at around 24 to 30 inches long, or 2.5 to 3.5 feet long, depending on whether it's erect or not.Depending on the breed of horse, the penis could be between 12 to about 24. Some stallions may even have a penis about 36 inches long"}, {"url": "http://horses.animal-world.com/information/horse-breeding.php", "passage_text": "Advertise With Us. Horse Mating. Horse mating begins with a mare in heat. Most mares (female horses) will come into heat every month and are usually in heat for several days. No matter how long a mare is in heat, the fertile period or ovulation will occur for 24 to 48 hours at the end of the heat cycle. To assure a mare gets pregnant, most breeders will begin breeding the mare on the second day she is in heat and every day after until she goes out of heat."}]