[{"url": "http://pewdiepie.wikia.com/wiki/CutiePie", "passage_text": "811 pages on this wiki. Marzia Bisognin, also known as CutiePie and CutiePieMarzia, is a 22 year-old Italian vlogger known for her videos on YouTube. She mainly focuses on vlogging, fashion and make-up. She also creates How-to/DIY videos in which she makes various things, such as jewelry, foods and accessories."}, {"url": "http://coed.com/2014/12/11/cutiepiemarzia-photos-pewdiepie-girlfriend-hot-pictures/", "passage_text": "Wyatt. CutiePie Marzia, PewDiePie ‘s girlfriend’s real name is Marzia Bisognin and is a hot vlogger from Italy. She lives in Italy with her boyfriend and makes YouTube videos of all sorts of stuff, mostly regarding fashions, trends and makeup."}, {"url": "http://cutiepiemarzia.wikia.com/wiki/Marzia_Bisognin", "passage_text": "Marzia Bisognin, also known as CutiePie and CutiePieMarzia, is a 22 year-old Italian vlogger known for her videos on YouTube. She mainly focuses on vlogging, fashion and make-up. She also creates How-to/DIY videos in which she makes various things, such as jewelry, foods and accessories."}, {"url": "http://cutiepiemarzia.deviantart.com/", "passage_text": "In case you don't know who CutiepieMarzia is, her real name is Marzia Bisognin (Age:19) who used to live in Italy with her family. She met Felix Kjellberg (Age:22) when a close friend introduced Marzia to Felix's Youtube channel, who is well known as Pewdiepie."}, {"url": "http://www.imdb.com/name/nm6521291/", "passage_text": "Actress. Marzia Bisognin, also known by name CutiePie or CutiePieMarzia is a 22 year old Vlogger known for her YouTube videos. Mainly staring in her own videos, Marzia also stars in various videos by her boyfriend, or Felix Arvid Ulf Kjellberg. Marzia grew up in a small city that goes by the name of Vicenza, Italy."}, {"url": "http://pewdiepie.wikia.com/wiki/CutiePie", "passage_text": "Marzia Bisognin, also known as CutiePie and CutiePieMarzia, is a 22 year-old Italian vlogger known for her videos on YouTube. She mainly focuses on vlogging, fashion and make-up. She also creates How-to/DIY videos in which she makes various things, such as jewelry, foods and accessories."}]