[{"url": "http://www.crueltyfreekitty.com/companies-that-test-on-animals/", "passage_text": "Companies That Test on Animals. The following list consists of companies that DO test on animals. Its main source is PETA, and I’ve supplemented it with my own research. I’ve organized the brands by category but you’ll notice that most of these brands are owned by a few big corporations."}, {"url": "http://www.answers.com/Q/Is_febreze_tested_on_animals", "passage_text": "I'm sorry to report that it IS, TESTED ON ANIMALS. Caring Consumer // Search for Cruelty-Free Companies and Products // Febreze (Procter & Gamble). (That is the web site at which i found thi information, and you got to the second page of this list, and you will see.)."}, {"url": "http://www.thepetitionsite.com/1/stop-febreze-from-testing-on-animals/", "passage_text": "Help save, and protect all the helpless animals that are being cruly tested on by the company Procter and Gamble, owners of Febreze and many more common house hold cleaning products. Did you know that Procter and Gamble own the products such as Cascade, Dawn, Febreze, Mr.Clean, Swiffer, and IAMS! All of these are which are cruelly tested on animals! Sometimes, to ensure that materials are safe and effective, we must conduct research that involves animals.."}, {"url": "http://www.aplnj.org/CrueltyFreeGuide.pdf", "passage_text": "Humane non-animal testing methods do exist and are currently being used by hundreds of companies! As a consumer, you need to use your buying power to pressure companies to switch to non-animal testing methods. The following companies TEST THEIR PRODUCTS ON ANIMALS."}, {"url": "http://www.snopes.com/critters/crusader/febreze.asp", "passage_text": "There have been multiple instances of dogs and birds who have died or became very ill after being exposed to Febreze, a deodorizer/air freshener. Febreze contains zinc chloride, which is very dangerous for animals. Please do not use Febreze anywhere near your pets!"}, {"url": "http://www.answers.com/Q/Is_febreze_tested_on_animals", "passage_text": "If we did rough, first tests on humans, … there would be many killed humans. It is sort of philosophical question-we can either live without medicine (no, there is no other way how to test many medicaments) or test it on humans (which society would never accept) or live with medicine and test it on animals."}]