[{"url": "http://www.radiochemistry.org/periodictable/elements/14.html", "passage_text": "Uses. Silicon is one of man's most useful elements. In the form of sand and clay it is used to make concrete and brick; it is a useful refractory material for high-temperature work, and in the form of silicates it is used in making enamels, pottery, etc. History. (L. silex, silicis, flint) Davy in 1800 thought silica to be a compound and not an element; later in 1811, Gay Lussac and Thenard probably prepared impure amorphous silicon by heating potassium with silicon tetrafluoride."}, {"url": "http://chemistry.about.com/od/elementfacts/a/silicon.htm", "passage_text": "Silicon transmits over 95% of all infrared wavelengths (1.3-6.7 mm). Uses: Silicon is one of the most widely used elements. Silicon is important to plant and animal life. Diatoms extract silica from water to build their cell walls. Silica is found in plant ashes and in the human skeleton. "}, {"url": "https://en.wikipedia.org/wiki/Silicon", "passage_text": "Silicon is a chemical element with symbol Si and atomic number 14. It is a tetravalent metalloid, more reactive than germanium, the metalloid directly below it in the table. Controversy about silicon's character dates to its discovery; it was first prepared and characterized in pure form in 1823. "}, {"url": "http://www.livescience.com/28893-silicon.html", "passage_text": "View full size image. Silicon is the element to thank for the computer you're using to read these words. A crucial component in microelectronics and computer chips, this extremely common element is also responsible for warm, white beaches — silica, an oxide of silicon, is the most common component of sand. "}, {"url": "http://www.rsc.org/periodic-table/element/14/silicon", "passage_text": "Natural abundance. Silicon makes up 27.7% of the Earth’s crust by mass and is the second most abundant element (oxygen is the first). It does not occur uncombined in nature but occurs chiefly as the oxide (silica) and as silicates. The oxide includes sand, quartz, rock crystal, amethyst, agate, flint and opal. "}, {"url": "http://periodic.lanl.gov/14.shtml", "passage_text": "History. From the Latin. word silex, silicis, flint. In 1800, Davy thought silica to be a compound and not an element; but in 1811, Gay Lussac and Thenard probably prepared impure amorphous silicon by heating potassium with silicon tetrafluoride. "}, {"url": "https://en.wikipedia.org/wiki/Silica", "passage_text": "Silicon dioxide, also known as silica (from the Latin silex), is a chemical compound that is an oxide of silicon with the chemical formula Si O 2. It has been known since ancient times. Silica is most commonly found in nature as quartz, as well as in various living organisms. "}, {"url": "http://www.whatissilica.org/", "passage_text": "Silica Natural Health Benefits. Silica is a naturally occurring element in the human body. Being one of the most appreciated weight loss tools, this mineral brings by thousands of other health benefits. It works in conjunction with other minerals and nutrients, providing improvement to the overall health. "}, {"url": "http://www.answers.com/Q/Is_silica_an_element", "passage_text": "Silica is the mineral quartz (SiO2) and silicon is the element (Si) which is a major rock forming element in Earth's crust, and is therefore found nearly everywhere. Concentra … tions of silica which are mined are usually in the form of quartz sand or sandstone deposits. 12 people found this useful. "}]