[{"url": "http://www.sciencedirect.com/science/article/pii/0926691795900659", "passage_text": "In the present study, the effect of body temperature on this acute decrease of tryptophan hydroxylase activity was examined. 2 h after a single dose of 3,4-methylenedioxymethamphetamine (20 mg/kg, s.c.), rats exhibited hyperthermia (38.7) or hypothermia (35.8) when maintained at 25 or 6, respectively. In conclusion, lowering body temperature protects against the immediate decrease in tryptophan hydroxylase activity induced by 3,4-methylenedioxymethamphetamine, suggesting that hyperthermia plays a prominent role in the acute as well as the long-term decrease in enzyme activity."}, {"url": "http://www.cigna.com/healthwellness/hw/medical-tests/body-temperature-hw198785", "passage_text": "Your normal temperature may actually be 1°F (0.6°C) or more above or below this. Also, your normal temperature changes by as much as 1°F (0.6°C) during the day, depending on how active you are and the time of day. Body temperature is very sensitive to hormone levels. So a woman's temperature may be higher or lower when she is ovulating or having her menstrual period. Body temperature is a measure of your body's ability to make and get rid of heat. If you tell your doctor about your temperature reading, be sure to say where it was taken: on the forehead or in the mouth, rectum, armpit, or ear."}, {"url": "http://www.webmd.com/first-aid/body-temperature", "passage_text": "Most people think of a normal body temperature as an oral temperature of 98.6°F (37°C) . This is an average of normal body temperatures. Your temperature may actually be 1°F (0.6°C) or more above or below 98.6°F (37°C) . Body temperature is a measure of the body's ability to generate and get rid of heat."}, {"url": "http://www.wilsonssyndrome.com/low-body-temperature/", "passage_text": "On the other hand, some elderly people have normal body temperatures. As soon as the body temperature drops, whether it’s at 9 years old, or 90 years old, then health related problems can develop because the enzymes of the body depend on their shape for their activity and their shape depend on their temperature. "}, {"url": "http://www.webmd.com/first-aid/body-temperature", "passage_text": "The body is very good at keeping its temperature within a narrow, safe range in spite of large variations in temperatures outside the body. When you are too hot, the blood vessels in your skin expand (dilate) to carry the excess heat to your skin's surface. Body temperature is a measure of the body's ability to generate and get rid of heat."}, {"url": "http://house.wikia.com/wiki/Body_temperature", "passage_text": "Thermometers are used to measure the body temperature and can be calibrated in degrees Fahrenheit (°F) or degrees Celsius (°C) depending on the global region. The normal body temperature of 98.6°F (37°C) is actually an average of temperatures. A person's normal temperature can fluctuate 1°F (0.6°C) or more or below 98.6; additionally, the body temperature fluctuates the same amount throughout the day-lower in the morning and evening while higher at mid-day. On the other end of the spectrum from a fever is hypothermia, when the body temperature falls below 97°F. Shock, prolonged exposure to cold, alcohol/drug use, and some metabolic disorders (such as diabetes mellitus) can cause hypothermia."}, {"url": "http://www.webmd.com/first-aid/body-temperature", "passage_text": "Also, your normal body temperature changes by as much as 1°F (0.6°C) throughout the day, depending on how active you are and the time of day. Body temperature is very sensitive to hormone levels and may be higher or lower when a woman is ovulating or having her menstrual period. Body temperature is a measure of the body's ability to generate and get rid of heat."}, {"url": "https://en.wikipedia.org/wiki/Human_body_temperature", "passage_text": "Normal human body temperature, also known as normothermia or euthermia, depends upon the place in the body at which the measurement is made, the time of day, as well as the activity level of the person. Nevertheless, commonly mentioned typical values are: The normal human body temperature is often stated as 36.5–37.5 °C (97.7–99.5 °F). In adults a review of the literature has found a wider range of 33.2–38.2 °C (91.8–100.8 °F) for normal temperatures, depending on the gender and location measured."}, {"url": "http://www.functionalps.com/blog/2013/01/05/body-temperature-metabolism-and-obesity/", "passage_text": "A decrease in body temperature, in fact, occurs at night in relation to the sleep cycle in human populations [58,59]. A fall in body temperature occurs during starvation, as noted above, and in hypoglycemia, an acute state of energy deprivation [60-62]. Raising core temperature by 1°C is associated with a 10% to 13% increase in metabolic rate [41]. During starvation, a fall in body temperature occurs, contributing to the decrease in metabolic rate noted in this state [24]."}, {"url": "https://en.wikipedia.org/wiki/Human_body_temperature", "passage_text": "The body temperature of a healthy person varies during the day by about 0.5 °C (0.9 °F) with lower temperatures in the morning and higher temperatures in the late afternoon and evening, as the body's needs and activities change. The normal human body temperature is often stated as 36.5–37.5 °C (97.7–99.5 °F). In adults a review of the literature has found a wider range of 33.2–38.2 °C (91.8–100.8 °F) for normal temperatures, depending on the gender and location measured."}]