[{"url": "http://humanresources.about.com/od/samplejobdescription/f/What-Does-A-Manager-Do.htm", "passage_text": "Responsibilities in the Job Description of a Manager. Traditionally, the manager's job description and responsibilities include: 1  Plan: planning the operation and function of the area over which the manager is assigned responsibility in a way that accomplishes the goals for which he or she is responsible."}, {"url": "http://www.definitions.net/definition/Manager", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: manager (Noun). A person whose job is to manage something, such as a business, a restaurant, or a sports team. manager (Noun). The head coach. manager (Noun). An administrator, for a singer or group"}, {"url": "http://management.about.com/od/policiesandprocedures/g/manager1.htm", "passage_text": "Definition: A Manager is the person responsible for planning and directing the work of a group of individuals, monitoring their work, and taking corrective action when necessary. For many people, this is their first step into a management career."}, {"url": "http://www.universalteacherpublications.com/mba/notes/ms01/c1/what-does-management-mean.htm", "passage_text": "In other words, “Management is the process of planning, organizing, leading, and controlling the efforts of organization members and of using all other organizational resources to achieve stated organizational goals” 2. Management focuses on the entire organization from both a short and a long-term perspective."}, {"url": "http://www.businessdictionary.com/definition/manager.html", "passage_text": "An individual who is in charge of a certain group of tasks, or a certain subset of a company. A manager often has a staff of people who report to him or her."}, {"url": "http://humanresources.about.com/od/samplejobdescription/f/What-Does-A-Manager-Do.htm", "passage_text": "A manager, who is generally the head of a department or functional area within an organization, has specific responsibilities depending on the needs of his or her organization. The job description of a manager varies from organization to organization. Here is more about what a manager does, the manager's job description. The manager's role and job description is at a pay grade or job classification level of the organization that integrates functions and departments for implementation success."}, {"url": "http://www.universalteacherpublications.com/mba/notes/ms01/c1/what-does-management-mean.htm", "passage_text": "What does management mean. Management is the process of designing and maintaining an environment in which individuals, working together in groups, efficiently accomplish selected goals 1."}, {"url": "http://www.definitions.net/definition/Management", "passage_text": "Wiktionary (4.50 / 2 votes) Rate this definition: management (Noun). administration; the process or practice of managing. management (Noun). The executives of an organisation, especially senior executives. management (Noun). Judicious use of means to accomplish an end."}]