[{"url": "http://www.medicalnewstoday.com/releases/5495.php", "passage_text": "The grapefruit diet is apparently not a myth. That's what a new study by the Nutrition and Metabolic Research Center at Scripps Clinic has suggested. Researchers there found that the simple act of adding grapefruit and grapefruit juice to one's diet can result in weight loss. "}, {"url": "http://www.3fatchicks.com/how-grapefruit-helps-you-lose-weight/", "passage_text": "Grapefruit enzymes reduce the amount of insulin that the body makes which helps the metabolism stay regulated. A well-regulated metabolism helps you to lose weight faster and more effectively. Scientists do acknowledge that grapefruit has properties that balance out blood sugar levels and help the metabolism. Grapefruit is a low-calorie fruit that helps fill you up and keeps insulin levels low. If you get bored with eating the grapefruit halves, try some variations: 1  Slice grapefruit into your next green salad. 2  The tart taste blends in interesting ways with sweet romaine and grated carrots."}, {"url": "http://www.webmd.com/diet/a-z/grapefruit-diet", "passage_text": "Grapefruit can be part of a healthy weight loss diet because it's nutritious, not because of any mysterious fat-burning properties. If you're a grapefruit lover, reap the benefits of this super-nutritious fruit by enjoying a serving before meals. The grapefruit diet has outlasted most fad diets. People were even trying it back in the 1930s. Its fans claim that grapefruit contains certain enzymes that, when eaten before other foods, help burn off fat. The diet, which has several variations, lasts 10-12 days and claims to help you lose as much as 10 pound"}, {"url": "http://healthyeating.sfgate.com/grapefruit-juice-burn-belly-fat-11351.html", "passage_text": "According to Koslo, backers of the grapefruit diet and using grapefruits or grapefruit juice to lose weight in general claim that the fruit has powerful metabolic properties that help to ignite fat loss. The idea that grapefruit may be a fat-burning super food stems from the 1930s, notes Jennifer Koslo, nutritionist at Precision Nutrition. The grapefruit diet made a reappearance in the mainstream in the 1970s with claims that you could lose 10 pounds in 10 days."}, {"url": "http://www.livestrong.com/article/25782-grapefruit-make-lose-weight/", "passage_text": "It began with the grapefruit diet in 1950, and stories still abound about grapefruit's potential to help you lose weight. While research to date doesn’t support any unique ability to speed up fat loss, grapefruit has loads of characteristics that support your weight-loss goals. "}, {"url": "http://www.3fatchicks.com/how-grapefruit-helps-you-lose-weight/", "passage_text": "You can use grapefruit for your dietary and weight loss needs. Grapefruit is a low-calorie fruit that helps fill you up and keeps insulin levels low. If you get bored with eating the grapefruit halves, try some variations: 1  Slice grapefruit into your next green salad. 2  The tart taste blends in interesting ways with sweet romaine and grated carrots."}, {"url": "http://www.womenfitness.net/grapefruit_weightloss.htm", "passage_text": "Prevent heart disease. Grapefruit is low in calories, low in sodium, high in potassium and high in fat burning enzymes benefiting weight loss in different ways. The low calories means you can eat grapefruit freely without consuming too many calories. A low sodium intake helps flush away excess water weight caused from high sodium foods. "}, {"url": "http://www.livestrong.com/article/371087-is-grapefruit-good-for-weight-loss/", "passage_text": "Interactions. Grapefruit products might have beneficial effects on weight loss, but they might interact adversely with certain medications. Grapefruit interferes with the enzymes that metabolize medications, which results in a buildup of medication in your body. This can lead to serious side effects. "}, {"url": "http://www.popsugar.com/fitness/Ways-Grapefruit-Can-Help-You-Lose-Weight-26331222", "passage_text": "1 Curbs cravings: There is something to be said about kick-starting your day with grapefruit. 2  Studies show that the mere smell of grapefruit can aid in weight loss. 3  Researchers speculate that sniffing grapefruit oil has an effect on liver enzymes, which can help to nix cravings and spur weight loss. 1 Research has also found that eating half a grapefruit before every meal can lead to greater weight loss in dieters. 2  While trying this at every meal may be a bit extreme, this tactic would work well for breakfast. 3  Makes a low-calorie substitution: There are several ways to enjoy grapefruit beyond"}]