[{"url": "http://www.healthcare-salaries.com/physicians/medical-doctor-salary-md", "passage_text": "Medical doctor salary and wage in USA. Based on the type of medical specialty, an average hourly wage for a medical doctor In the United States is as follows: The average hourly wage for a MD family physician ranges from between $39.73 – $81.03 per hour. The average hourly wage for a MD psychiatrist in the US is around $90 per hour. Comparing these rates to what medical doctors receive in the US, a day’s pay for a US doctor could mean a month’s wages for someone working in China. PayScale claims that the median salary for medical practitioners is CNY 260,000. Medical doctor salary recorded in the website ranged from CNY 110,000 to CNY 723,115."}, {"url": "http://www.healthcare-salaries.com/physicians/nephrologist-salary", "passage_text": "Nephrologist salary. Nephrologist’s salary in the United States is approximately about $210,927 per annum while an average expected salary for a Nephrologist is about $162,350. A nephrologist’s salary varies based on age such as the one in 20s earns up to £45,000, one in 30s earns about £58,800, in 40s earns about £69,600 and in 50s earns about £69,600. The average hourly wage for a nephrologist in UK is about £30 per hour."}, {"url": "http://www.davita.com/kidney-disease/overview/treatment-overview/what-is-a-nephrologist?/e/6884", "passage_text": "If a kidney doctor detects kidney disease, he or she will do tests to determine what stage of kidney disease the patient is in and plan the patient’s treatment. The nephrologist will usually refer the patient to a renal dietitian, renal social worker and renal nurse who will help with the patient’s care. 1 Dialysis — Dialysis is the process of cleaning the blood when the kidneys no longer function. 2  Kidney doctors learn about hemodialysis and peritoneal dialysis — the two types of dialysis — so they can match their patients with the dialysis treatment that works best for their health and lifestyle."}, {"url": "http://www.healthcare-salaries.com/physicians/nephrologist-salary", "passage_text": "Nephrologist salary in Canada. The average expected salary for nephrologists employed in medical schools in Canada received about $350,000 while those employed in hospices or private clinics earned a much higher salary. A nephrologist’s salary varies based on age such as the one in 20s earns up to £45,000, one in 30s earns about £58,800, in 40s earns about £69,600 and in 50s earns about £69,600. The average hourly wage for a nephrologist in UK is about £30 per hour."}, {"url": "http://www.healthcare-salaries.com/physicians/nephrologist-salary", "passage_text": "Average nephrologist salary and wage: An average yearly salary for a nephrologist ranges from between $129,880 – $194,820 per annum while an hourly wage ranges from between $48-$102 per hour. A nephrologist’s salary varies based on age such as the one in 20s earns up to £45,000, one in 30s earns about £58,800, in 40s earns about £69,600 and in 50s earns about £69,600. The average hourly wage for a nephrologist in UK is about £30 per hour."}, {"url": "http://www.kidney.ca/Page.aspx?pid=371", "passage_text": "Author of more than 280 peer-reviewed publications, many in the highest ranked scientific journals, and immediate Past President of the Canadian Society of Nephrology, Dr. Tonelli is also a Canada Research Chair in optimal care for people with chronic kidney disease. June 17, 2014 - The Kidney Foundation of Canada, the Pedersen Family, the Macquarie Foundation and the Alport Syndrome Fondation are pleased to announce that they have jointly awarded funding for two research projects on Alport Syndrome.Dr."}, {"url": "http://www.davita.com/kidney-disease/overview/treatment-overview/what-is-a-nephrologist?/e/6884", "passage_text": "A nephrologist is a medical doctor who specializes in kidney care and treating diseases of the kidneys. The term nephrologist comes from the Greek word “nephros”, which means kidney or renal and “ologist” refers to someone who studies. 1 Dialysis — Dialysis is the process of cleaning the blood when the kidneys no longer function. 2  Kidney doctors learn about hemodialysis and peritoneal dialysis — the two types of dialysis — so they can match their patients with the dialysis treatment that works best for their health and lifestyle."}, {"url": "http://www.healthcare-salaries.com/physicians/medical-doctor-salary-md", "passage_text": "Average Medical doctor salary in US. An average annual salary for a specialist MD in the United States is around $339,738; while an annual salary for an MD general practitioner is around $186,044 per annum. The average salaries for physicians possessing Doctor of Medicine (M.D.) degree depends on various determinants. Comparing these rates to what medical doctors receive in the US, a day’s pay for a US doctor could mean a month’s wages for someone working in China. PayScale claims that the median salary for medical practitioners is CNY 260,000. Medical doctor salary recorded in the website ranged from CNY 110,000 to CNY 723,115."}]