[{"url": "http://www.forbes.com/colleges/san-diego-state-university/", "passage_text": "Profile. Established in 1897, San Diego State University is the oldest and largest institution of higher learning in the San Diego area. San Diego State is also known as one of the most LGBT-friendly schools in the nation. "}, {"url": "https://en.wikipedia.org/wiki/San_Diego_State_University", "passage_text": "San Diego State University is a member of the Western Association of Schools and Colleges (WASC), the American Association of State Colleges and Universities (AASCU) , the National Association of State Universities and Land-Grant Colleges, and the Southwest Border Security Consortium. SDSU has a student body of more than 35,000 and an alumni base of more than 280,000. The Carnegie Foundation has designated San Diego State University a Research University with high research activity, placing it among the top 200 higher education institutions in the country conducting research."}, {"url": "http://colleges.usnews.rankingsandreviews.com/best-colleges/sdsu-1151", "passage_text": "San Diego State University has a total undergraduate enrollment of 28,362, with a gender distribution of 45.1 percent male students and 54.9 percent female students. At this school, 14 percent of the students live in college-owned, -operated, or-affiliated housing and 86 percent of students live off campus. Summary. San Diego State University is a public institution that was founded in 1897. It has a total undergraduate enrollment of 28,362, its setting is urban, and the campus size is 283 acres. It utilizes a semester-based academic calendar. San Diego State University's ranking in the 2016 edition of Best Colleges is National Universities, 149. Its in-state tuition and fees are $6,976 (2015-16); out-of-state tuition and fees are $18,136 (2015-16)"}, {"url": "http://collegeapps.about.com/od/collegeprofiles/p/SDSU-San-Diego-State.htm", "passage_text": "San Diego State University Description: Part of the California State University system, San Diego State University is the third largest university in California. The college ranks highly for study abroad, and SDSU students have a choice of 190 study abroad programs. The university has an active Greek system with over 50 fraternities and sororities."}, {"url": "https://en.wikipedia.org/wiki/San_Diego_State_University", "passage_text": "San Diego State University (SDSU, State) is a public research university in San Diego, and is the largest and oldest higher education institution in San Diego County. Founded in 1897 as San Diego Normal School, it is the third-oldest university in the 23-member California State University (CSU). SDSU has a student body of more than 35,000 and an alumni base of more than 280,000. The Carnegie Foundation has designated San Diego State University a Research University with high research activity, placing it among the top 200 higher education institutions in the country conducting research."}, {"url": "https://en.wikipedia.org/wiki/San_Diego_State_University", "passage_text": "1 The San Diego State University (SDSU) campus is known as Montezuma Mesa, as the university is situated on a mesa overlooking Mission Valley and is located at the intersection of Montezuma Road and College Avenue. SDSU has a student body of more than 35,000 and an alumni base of more than 280,000. The Carnegie Foundation has designated San Diego State University a Research University with high research activity, placing it among the top 200 higher education institutions in the country conducting research."}, {"url": "http://newscenter.sdsu.edu/ootp/history.aspx", "passage_text": "University History. San Diego State University is the oldest and largest higher education institution in San Diego. Since its founding in 1897, the university has grown to become a leading public research university. Founded March 13, 1897, San Diego State University began as the San Diego Normal School, a training facility for elementary school teachers. Seven faculty and 91 students met in temporary quarters over a downtown drugstore before moving to a newly constructed 17-acre campus on Park Boulevard."}, {"url": "https://en.wikipedia.org/wiki/San_Diego_State_University", "passage_text": "SDSU is one of the most selective campuses in The California State University system. For fall 2010, SDSU had the lowest admission rate in the CSU system at 30.0 percent. In fall 2013, SDSU had the third-lowest admission rate in the CSU (37.2 percent), behind CSU Long Beach (35.5 percent) and Cal Poly (34.5 percent). SDSU has a student body of more than 35,000 and an alumni base of more than 280,000. The Carnegie Foundation has designated San Diego State University a Research University with high research activity, placing it among the top 200 higher education institutions in the country conducting research."}]