[{"url": "http://yourbusiness.azcentral.com/disadvantages-clan-culture-business-13376.html", "passage_text": "The term clan describes a community of people who stick together. A clan culture can lead to employees becoming overly concerned with maintaining group harmony with little challenge to the status quo. This contrasts organizations where some conflict is encouraged to challenge current ways of doing things. Control Concerns. The term clan control is used to emphasize the extreme risks of a clan culture in which leadership relies on shared cultural values as a manipulative tool to influence the behaviors of employees."}, {"url": "http://smallbusiness.chron.com/disadvantages-clan-culture-business-34708.html", "passage_text": "Lack of Authority. Clan-culture leaders assume a mentoring role toward employees -- some even compare it to the role of a parent inside a family. The lines of authority are not clearly defined inside a clan-culture business, since decisions are often made independently by employees or by common agreement. Potential for Abuse. A clan culture is open, friendly and arguably more appreciative of its employees than any other. However, this comfortable culture is vulnerable to abuse if employees use its tolerance as an opportunity to relax rather than an opportunity to contribute."}, {"url": "http://www.ngenperformance.com/blog/leadership-2/types-of-work-cultures", "passage_text": "An organization’s culture is based on the way in which people in that organization think and act. Every organization has a culture and, depending on what it is, it can either work for or against the business’ goals. Your organization’s culture can be the difference between success and failure. "}, {"url": "http://yourbusiness.azcentral.com/disadvantages-clan-culture-business-13376.html", "passage_text": "Clan culture is a common label for an organization characterized by a flexible atmosphere and a family-oriented attitude. It is one of the common cultural types identified in studies of workplace culture, especially in small bsuinesses. Control Concerns. The term clan control is used to emphasize the extreme risks of a clan culture in which leadership relies on shared cultural values as a manipulative tool to influence the behaviors of employees."}, {"url": "http://www.emeraldinsight.com/doi/full/10.1108/00251749710160232", "passage_text": "Abstract: Uses a case study to illustrate DHL International’s corporate culture, which may be used as a benchmark for other companies in the service industry sector. Suggests that the business success factors of this organization lie in its adoption of the culture and structural characteristics of a clan organization. The notion of clan as applied in business strategy and general management has been very well established. A clan organization, as the term is being used here, is a business‐oriented social enclave consisting of companies and individuals who are bound by strong, non‐contractual bonds."}, {"url": "http://smallbusiness.chron.com/disadvantages-clan-culture-business-34708.html", "passage_text": "Ciaran Griffin/Lifesize/Getty Images. In their 1999 book, Diagnosing and Changing Organizational Culture, Kim Cameron and Robert Quinn listed four basic types of business cultures: the Hierarchy, the Market, the Adhocracy, and the Clan cultures -- with the clan culture being the most laid-back one on the list. Potential for Abuse. A clan culture is open, friendly and arguably more appreciative of its employees than any other. However, this comfortable culture is vulnerable to abuse if employees use its tolerance as an opportunity to relax rather than an opportunity to contribute."}, {"url": "http://whatis.techtarget.com/definition/clan-culture", "passage_text": "Clan cultures are the most collaborative and the least competitive of the four main corporate culture models. Mentoring, employer commitment and employee engagement are thought to promote empowerment and loyalty that will drive productivity and business success. "}, {"url": "http://smallbusiness.chron.com/disadvantages-clan-culture-business-34708.html", "passage_text": "Lack of Diversity. A business with a clan culture tends to be a homogeneous organization. While employees with common beliefs, goals or even demographic characteristics may make united effort easier, it also robs the organization of the benefits of diversity. Potential for Abuse. A clan culture is open, friendly and arguably more appreciative of its employees than any other. However, this comfortable culture is vulnerable to abuse if employees use its tolerance as an opportunity to relax rather than an opportunity to contribute."}]