[{"url": "http://www.edmunds.com/chevrolet/uplander/", "passage_text": "True, the Uplander succeeded in providing the expected features and creature comforts, but it lacked the refinement and ingenuity that other top minivans from Honda, Kia and Toyota provided. Not finding much success, Chevy finally discontinued its van in favor of the Traverse large crossover SUV. The Uplander came in LS and LT trim levels, both of which seated seven with a fold-flat 50/50-split third-row seat. The short wheelbase was only available on the LS, while the LT initially came in three different equipment subsets: 1LT, 2LT and 3LT. For '08, the LT was pared down to a singular version."}, {"url": "http://www.carfax.com/vehicles/Used-Chevrolet-Uplander", "passage_text": "CARFAX Vehicle History Reports are based on information supplied to CARFAX. CARFAX does not have the complete history of every vehicle. Use the CARFAX search as one important tool, along with a vehicle inspection and test drive, to make a better decision about your next used car. Use the CARFAX Vehicle History as one important tool, along with a vehicle inspection and test drive, to make a better decision about your next used car. Vehicle descriptions and details on this page may have been provided, in part or entirely, by the seller or its agent."}, {"url": "http://www.chevrolet.com/discontinued-vehicle/uplander.html", "passage_text": "Chevrolet Uplander. Uplander is a minivan that was offered by Chevrolet from 2005 through 2008. Both regular wheelbase and extended wheelbase versions were available, with seating for up to eight passengers. Modular, removable rear seats, power sliding side doors and dual air conditioning were all available."}, {"url": "http://www.edmunds.com/chevrolet/uplander/", "passage_text": "The Chevrolet Uplander was a minivan sold from the 2005-'08 model years. At the minivan's debut, it came with a 200-horsepower 3.5-liter V6 and a four-speed automatic driving the front wheels. All-wheel drive was available as an option. The Uplander came in LS and LT trim levels, both of which seated seven with a fold-flat 50/50-split third-row seat. The short wheelbase was only available on the LS, while the LT initially came in three different equipment subsets: 1LT, 2LT and 3LT. For '08, the LT was pared down to a singular version."}, {"url": "http://repairpal.com/chevrolet/uplander/car_reviews", "passage_text": "My 2007 Uplander has been a very good van up till 70,000 miles. Now all of a sudden, when braking or making sharp turns, it is making a grinding rubbing noise. The dealer checked it out and said the tires are moving on the wheels. I marked the wheels but see no movement. Our 2007 Uplander bought with 11,000 miles now has 70,000 miles and we have had the same problems as everyone before us. New brakes, rotors, tires, and still the front end shakes, steering wheel shakes, and grinding when you turn."}, {"url": "https://en.wikipedia.org/wiki/Chevrolet_Uplander", "passage_text": "The Chevrolet Uplander is a minivan manufactured and marketed by Chevrolet for model years 2005–2009, replacing the Venture. Initially marketed alongside the Venture and Astro, the Uplander and its rebadged variants, the Saturn Relay, Buick Terraza, and Pontiac Montana SV6, were manufactured at GM's Doraville Assembly. However, due to low sales, it was discontinued in 2008 and General Motors exited the minivan market. 2005: The Uplander was initially offered with 3.5 L High Value 3500 LX9 V6 generating 200 hp (149 kW) and 220 lb·ft (298 N·m). 2006: A 3.9 L LZ9 V6, with 240 hp (179 kW) and 240 lb·ft (332 Nm) torque, was added as an option. The GM logo was added to the front doors."}, {"url": "http://repairpal.com/chevrolet/uplander", "passage_text": "My 2007 Uplander has been a very good van up till 70,000 miles. Now all of a sudden, when braking or making sharp turns, it is making a grinding rubbing noise. The dealer checked it out and said the tires are moving on the wheels. I marked the wheels but see no movement. "}, {"url": "http://www.carpartswarehouse.com/carmodels/CP4/Chevrolet/Uplander.html", "passage_text": "At Car Parts Warehouse you can find quality car parts for your Chevrolet Uplander that are tested to meet the quality standards of the industry. Just by selecting the year and the model of your Chevrolet, you can find the car parts. When you are looking for quality OEM replacement part for your Chevrolet Uplander, you can get them here at affordable rates. Car Parts Warehouse is the one-stop-shop for all your car parts needs. You can find a full line of car, truck and automotive performance parts."}]