[{"url": "https://en.wikipedia.org/wiki/Rump_steak", "passage_text": "Rump steak is a term used in describing cuts of beef. It may refer to: 1  A steak from the top half of an American-cut round steak primal. 2  A British-or Australian-cut from the rump primal, largely equivalent to the American sirloin. 1 A steak from the top half of an American-cut round steak primal. 2  A British-or Australian-cut from the rump primal, largely equivalent to the American sirloin."}, {"url": "https://en.wikipedia.org/wiki/Flank_steak", "passage_text": "A relatively long and flat cut, flank steak is used in a variety of dishes including London broil and as an alternative to the traditional skirt steak in fajitas. It can be grilled, pan-fried, broiled, or braised for increased tenderness. Flank steak is best when it has a bright red color. Because it comes from a strong, well-exercised part of the cow, it is best sliced against the grain before serving, to maximise"}, {"url": "https://en.wikipedia.org/wiki/Flank_steak", "passage_text": "Grain (meat fibre) is very apparent in flank steaks, and many chefs cut across the grain to make the meat more tender. Flank steak is best when it has a bright red color. Because it comes from a strong, well-exercised part of the cow, it is best sliced against the grain before serving, to maximise tenderness."}, {"url": "https://answers.yahoo.com/question/index?qid=20070615075433AAzOMLZ", "passage_text": "Varieties Skirt steak is also known as the “butcher steak” because it’s rarely found on meat counters—the butcher takes this one home. Definition: Cut from the beef flank, the skirt steak is the diaphragm muscle (which lies between the abdomen and chest cavity). It's a long, flat piece of meat that's flavorful but rather tough. Properly cooked, skirt steak can be quite tender and delicious"}, {"url": "https://en.wikipedia.org/wiki/Flank_steak", "passage_text": "The flank steak is a beef steak cut from the abdominal muscles or buttocks of the cow. Flank steak is best when it has a bright red color. Because it comes from a strong, well-exercised part of the cow, it is best sliced against the grain before serving, to maximise tenderness."}, {"url": "http://yanksdownunder.net/topic/8582106/1/", "passage_text": "Try asking for skirt steak: Quote: Skirt steak is a boneless cut of beef from the lower part of the brisket. Cut from the beef flank, the skirt steak is the diaphragm muscle (which lies between the abdomen and chest cavity). It's a long, flat piece of meat that's flavoursome but rather tough. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070615075433AAzOMLZ", "passage_text": "I agree with the previous answer: FLANK STEAK (or fajita steak since it is most often used in fajitas due to the texture, thickness, cost effectiveness, etc). Skirt or Flank Steak is a boneless cut of beef from the lower part of the brisket. Definition: Cut from the beef flank, the skirt steak is the diaphragm muscle (which lies between the abdomen and chest cavity)."}, {"url": "http://boardreader.com/thread/Cuts_of_Meat_in_USA_to_Australia_ag27X7396.html", "passage_text": "Published (2010-04-01 18:14:00). The flank steak, also known as Arrachera or Bavette, is a beef steak cut from the abdominal muscles of the cow. A relatively long and flat cut of meat, flank steak is used in a variety of dishes including London broil and fajitas. This is a lean, flat cut that's extremely flavorful. It is significantly tougher than the other beef cuts; therefore, many recipes use moist cooking methods such as braising."}]