[{"url": "http://www.acne.org/messageboard/topic/323566-should-i-see-an-endocrinologist/", "passage_text": "My acne is not severe but it is pretty moderate and very persistent.Over these 9 years I have tried numerous topicals, 3 different birth control pills and spironolactone for almost a year and a half. Some of these kept my acne at bay, but nothing has completely cleared my skin or even almost cleared it for that matter. My OBGYN was able to order the hormone tests and when they came back abnormal she referred me to an endocrinologist. I think this is the normal route. You could see an endocrinologist but it might be a waste of both of your time if all of the results come back normal."}, {"url": "http://www.hormone.org/diseases-and-conditions/womens-health/polycystic-ovary-syndrome", "passage_text": "The cause of PCOS is not known. Some women with PCOS are less sensitive to insulin than other women, a condition known as insulin resistance. Insulin resistance can causes the ovaries to produce too many male hormones. The resulting hormonal imbalance can cause the symptoms of PCOS. Polycystic ovary syndrome causes irregular menstrual cycles, excessive body or facial hair and polycystic ovaries as its main symptoms. Polycystic means many cysts, and PCOS often causes clusters of small, pearl-sized cysts in the ovaries. The cysts are fluid-filled and contain immature eggs."}, {"url": "https://www.synthroid.com/thyroid-doctor/find-an-endocrinologist", "passage_text": "Find an endocrinologist. In addition to your primary care doctor, an endocrinologist may also help diagnose and manage your hypothyroidism. An endocrinologist is a doctor who specializes in managing diseases such as hypothyroidism. He or she may work with your primary care doctor."}, {"url": "http://hashimoto-thyroid.blogspot.com/2006/01/acne.html", "passage_text": "At 16 it's best to live with the acne vs stop meds because stopping the thyroid meds at 16 can cause long term effects in developing bodies. Since money is tight you can try a toner of 1 tablespoon vinegar mixed with 2 tablespoons water. Keep away from eyes, lips and nose. Google acne home remedies. "}, {"url": "http://www.healthboards.com/boards/acne/3079-endocrinology-acne.html", "passage_text": "Endocrinology & Acne. Has anyone thought about going to a gland and hormone specialist doctor-also known as an Endocrinologist. I hear Endocrinology can solve the problem. The doctor runs some test and picks out what is exactly going wrong in the body glands and immune system. It has nothing to do with the outer skin. It is all about the inside of your body"}, {"url": "http://www.webmd.com/skin-problems-and-treatments/acne/features/period", "passage_text": "Unfortunately, you can’t change the relationship between acne and hormones. But there are some things you can do to make those breakouts less severe. “Menstrual-related acne is not a matter of hygiene; it is an internal effect. "}, {"url": "http://hormonehelpny.com/column/acne.htm", "passage_text": "A Final Note For me as an endocrinologist, acne is one of the most satisfying conditions to treat. It often gets much better with the hormonal treatments described above, everyone can see for themselves how great the change has been and the person s life can be greatly changed for the better. Acne and Extra Hair Increases in hair growth and female acne do, unfortunately, go together because the hormonal cause of the two conditions is the same. In both cases, androgens (testosterone and related hormones) act to trigger the condition."}, {"url": "http://www.hormone.org/diseases-and-conditions/womens-health/polycystic-ovary-syndrome", "passage_text": "Polycystic ovary syndrome (PCOS) is the most common hormonal disorder among women of reproductive age. Infertility is one of the most common PCOS symptoms. Because the symptoms of PCOS are seemingly unrelated to one another, the condition is often overlooked and undiagnosed. Polycystic ovary syndrome causes irregular menstrual cycles, excessive body or facial hair and polycystic ovaries as its main symptoms. Polycystic means many cysts, and PCOS often causes clusters of small, pearl-sized cysts in the ovaries. The cysts are fluid-filled and contain immature eggs."}, {"url": "http://answers.webmd.com/answers/2018950/can-an-endocrinologist-help-with-acne", "passage_text": "A. An endocrinologist can be very helpful in evaluating acne. Skin specialists and primary care doctors often recommend that women with acne that is resistant to antibiotics see an endocrinologist. Hormonal abnormalities may cause or be a contributing factor to acne"}, {"url": "http://www.medicalnewstoday.com/articles/248679.php", "passage_text": "Endocrinology is a specialty of medicine; some would say a sub-specialty of internal medicine, which deals with the diagnosis and treatment of diseases related to hormones. Endocrinology covers such human functions as the coordination of metabolism, respiration, reproduction, sensory perception, and movement. "}]