[{"url": "http://www.nhs.uk/Conditions/Arthroscopy/Pages/Recovery.aspx", "passage_text": "Recovering from an arthroscopy. How long it takes to recover after an arthroscopy can vary, depending on the type of surgery you had, your general health and the type of work that you do. Some people feel better after a few days, while others may not be back to normal for several months. I had an arthroscopy 7 days ago for pain in my right knee due to cartilage wear on the kneecap, and a small meniscus tear. No pain after the surgery at all. I had a spinal anaesthetic and watched the whole thing on a screen. Fascinating! As soon as the anaesthetic wore off I could walk with no pain."}, {"url": "https://answers.yahoo.com/question/index?qid=20080505093826AAB2m5E", "passage_text": "Answers. Best Answer: Although arthroscopic surgery allows you to return to work much quicker, I think you better take a week off. I had it done back in January, took 2 weeks off, but probably could have went back after 1 week. show more I'm having surgery on my knee in a week and I have only requested the day of and the day after my surgery off. After do some research on the surgery I dont think that is enough time. I want to know what sort of time frame I should tell my employer. I work somewhere were I have to walk around alot."}, {"url": "http://www.symptomfind.com/procedures-tests/what-to-expect-after-arthroscopic-knee-surgery/", "passage_text": "Knee arthroscopy surgery lasts for approximately one hour after which you will be taken to the recovery room. You will be discharged from the hospital (usually within an hour or two) once you are comfortable, able to take fluids orally, can urinate and are able to walk on crutches. Swelling around the knee is commonplace after arthroscopic knee surgery. It is important to keep your knee elevated above your heart when lying down for the initial three days post-surgery. Applying ice to the knee every 2-to-3 hours for twenty minutes will also help minimize any pain or throbbing."}, {"url": "https://answers.yahoo.com/question/index?qid=20080505093826AAB2m5E", "passage_text": "How long should I be off work for knee arthroscopy? I'm having surgery on my knee in a week and I have only requested the day of and the day after my surgery off. After do some research on the surgery I dont think that is enough time. I want to know what sort of time frame I should tell my employer. show more I'm having surgery on my knee in a week and I have only requested the day of and the day after my surgery off. After do some research on the surgery I dont think that is enough time. I want to know what sort of time frame I should tell my employer. I work somewhere were I have to walk around alot."}, {"url": "http://www.nhs.uk/Conditions/repairtotendon/Pages/Recovery.aspx", "passage_text": "How quickly you can return to work after having knee surgery will depend on what your job involves. If you work in an office, you may be able to return to work after two to three weeks. If you do any form of manual labour, it could be up to three months before you can return to work, depending on your work activities. "}, {"url": "http://www.healingwell.com/community/default.aspx?f=51&m=1558842", "passage_text": "I went back to work (finally) on December 1st, 2008, about 6 weeks after surgery. I still used my crutches for support and after 2 weeks at work, was able to do without. I stayed in therapy until the end of January. I was on crutches and unable to bend my knee longer than I expected but in the end, it was worth it. Posted 8/9/2009 9:09 AM (GMT -6). I had knee arthoscopic surgery done 4 1/2 weeks ago. I had a torn meniscus and a pothole that the surgeon cleaned out. I experienced the worst day the day after as I was told, then did pretty good for the first week."}, {"url": "http://www.nhs.uk/Conditions/Arthroscopy/Pages/Recovery.aspx", "passage_text": "Lizfal said on 02 February 2015. I had an arthroscopy 7 days ago for pain in my right knee due to cartilage wear on the kneecap, and a small meniscus tear. No pain after the surgery at all. I had a spinal anaesthetic and watched the whole thing on a screen. Fascinating! As soon as the anaesthetic wore off I could walk with no pain."}, {"url": "http://bonesmart.org/knee/time-off-work-knee-replacement-surgery/", "passage_text": "Return to work should be phased, however, with three half-days in the first week, two full days in the second week, five half-days in the third week, and full-time by week four. Recovery from knee replacement surgery takes a minimum of three months, but most likely six. A full recovery can take around eight to ten months. The degree of improvement during rehabilitation often depends on the strength of your body before surgery, your body weight, and your ability to manage pain. Most doctors recommend about six weeks. Your ability to return to work depends on your job requirements. Patients with physically demanding jobs are often out of work for three to six months. Patients who hold desk jobs or administrative positions may return to work within six weeks, but this is the minimum."}, {"url": "http://my.clevelandclinic.org/services/orthopaedics-rheumatology/treatments-procedures/knee-arthroscopy", "passage_text": "The recovery period after knee arthroscopy surgery depends on the patient and his or her condition. For most cases, patients can return to office work within a week. And many return to a more active and normal lifestyle within one to two months. The ankle of the leg to be exercised should be bent at a 90-degree angle, and the knee is straightened as much as possible. Then, the entire leg and thigh are lifted off the floor to a height of approximately 1 to 1-1/2 feet and held in the air for 6 seconds."}, {"url": "http://www.emoryhealthcare.org/orthopaedics/become-patient/faq/knee-replacement.html", "passage_text": "When you can return to work after total knee replacement surgery depends on your profession. If your work is sedentary, you may return as early as 2 to 4 weeks post-operatively. If your work is more rigorous, you may require up to 3 months before you can return to full duty. In some cases, more time may be necessary. Generally, you should not use weights for the first 2 months after total knee replacement surgery. However, as everyone's strength varies, consult with your physical therapist before using weights. Use light weights to begin with (1 to 5 lbs.) and gradually progress."}]