[{"url": "http://www.coastalnavigation.com/samples/sec_1/1_pages/1_2.htm", "passage_text": "Meridians of longitude are numbered from 0° to 180° E and from 0° to 180° W of the prime meridian, the meridian passing through Greenwich, England. Degrees and Minutes The distance between degrees of longitude is about 60 nautical miles at the equator. It is less further north or south as the longitude lines converge towards the poles. Degrees of latitude are always 60 nautical miles apart. At the equator, a grid of 1° of longitude by 1° of latitude covers about 3,600 square miles"}, {"url": "http://www.answers.com/Q/How_far_is_panama_from_the_equator", "passage_text": "Confidence votes 63. The northernmost point of mainland Panama lies at approximately 9.6 degrees latitude north of the equator. The southernmost point lies at approximately 7.2 degrees north latitude. Each degree of latitude corresponds to 111 kilometers. Croatia lies on 45 parallel, which means it's exactly half way from Equator to North pole. It's 5000km away from the North pole and 5000km away from the equator. A small tow … n called Senj, Croatia cuts this line and has a monument and a roadsign to North pole and Equator. 4 people found this useful."}, {"url": "http://geography.about.com/od/learnabouttheearth/a/The-Equator-Hemispheres-Tropic-Of-Cancer-And-Tropic-Of-Capricorn.htm", "passage_text": "The equator divides the planet into the Northern and Southern Hemispheres. On the equator, the length of day and night are equal every day of the year-day is always twelve hours long and night is always twelve hours long. The Tropic of Cancer and the Tropic of Capricorn each lie at 23.5 degrees latitude. Share. The equator is located at zero degrees latitude. The equator runs through Indonesia, Ecuador, northern Brazil, the Democratic Republic of the Congo, and Kenya, among other countries. It is 24,901.55 miles (40,075.16 kilometers) long."}, {"url": "http://www.distancefromto.net/distance-from/Costa+Rica/to/equator", "passage_text": "To. Distance between Costa Rica and equator is: The air travel (bird fly) shortest distance from Costa Rica to equator is 11539.01 km= 7170.01 miles. If you travel with an airplane (which has average speed of 560 miles) between Costa Rica to equator, It takes 12.8 hours to arrive. Also check out Costa Rica, Democratic Republic of the Congo distances."}, {"url": "http://geography.about.com/od/learnabouttheearth/a/The-Equator-Hemispheres-Tropic-Of-Cancer-And-Tropic-Of-Capricorn.htm", "passage_text": "The reason for the location of the Tropic of Cancer and the Tropic of Capricorn at 23.5° north and south respectively is due to the axial tilt of the Earth. The Earth is titled 23.5 degrees from the plane of the Earth's revolution around the sun each year. Share. The equator is located at zero degrees latitude. The equator runs through Indonesia, Ecuador, northern Brazil, the Democratic Republic of the Congo, and Kenya, among other countries. It is 24,901.55 miles (40,075.16 kilometers) long."}, {"url": "http://www.answers.com/Q/How_far_is_panama_from_the_equator", "passage_text": "The equator is a line that divides the Earth in half. The south  pole is at the very bottom of the Earth. The distance between the  Equator and the South Pole is 10320.12 km … . Croatia lies on 45 parallel, which means it's exactly half way from Equator to North pole. It's 5000km away from the North pole and 5000km away from the equator. A small tow … n called Senj, Croatia cuts this line and has a monument and a roadsign to North pole and Equator. 4 people found this useful."}, {"url": "http://solarnavigator.net/equator.htm", "passage_text": "The equator divides the planet into a Northern Hemisphere and a Southern Hemisphere. The latitude of the equator is, by definition, 0. The length of Earth's equator is about 40,075.0 km, or 24,901.5 miles. The equator is one of the five main circles of latitude based on the relationship of the Earth's rotation and plane of orbit around the sun. The surface of the Earth at the equator is mainly ocean. The highest point on the Equator is 4,690 m, at 77 59′31 W on the south slopes of Volc n Cayambe (summit 5,790 m) in Ecuador. This is a short distance above the snow line, and is the only point on the Equator where snow lies on the ground."}, {"url": "http://www.answers.com/Q/Is_Panama_City_Panama_south_of_the_equator", "passage_text": "The northernmost point of mainland Panama lies at approximately 9.6 degrees latitude north of the equator. The southernmost point lies at approximately 7.2 degrees north … latitude. Each degree of latitude corresponds to 111 kilometers. So 7.2 degrees of latitude is equivalent to around 800 km away from the equator, and 9.6 degrees corresponds to around 1065 km away. 25 people found this useful."}]