[{"url": "http://www.biography.com/people/camilla-parker-bowles-9542218", "passage_text": "Early Life. Duchess of Cornwall, wife of Charles, Prince of Wales and heir to the British throne Camilla Parker Bowles was born Camilla Shand on July 17, 1947, in London, England. She grew up on a large country estate in Plumpton, Sussex, with her parents, Bruce and Rosalind Shand, and her two younger siblings. Synopsis. Camilla Parker Bowles was born on July 17, 1947, in London, England. Her father was Vice Lord Lieutenant of East Sussex and she socialized with Britain’s royalty. She met Prince Charles in 1972. They married other people, but were romantically involved for 25 year"}, {"url": "https://en.wikipedia.org/wiki/Laura_Lopes", "passage_text": "Laura Rose Lopes (nee Née Parker; bowles born 1 january) 1978 is A british art. Curator lopes is the daughter Of, Camilla duchess Of, cornwall And Andrew Parker. Bowles her'mother s remarriage in 2005 Made, Charles prince Of, wales her. Stepfather she has one elder, Brother Tom Parker. bowles Laura Rose Lopes (nee Née Parker; bowles born 1 january) 1978 is A british art. Curator lopes is the daughter Of, Camilla duchess Of, cornwall And Andrew"}, {"url": "https://en.wikipedia.org/wiki/Laura_Lopes", "passage_text": "Laura Rose Lopes (nee Née Parker; bowles born 1 january) 1978 is A british art. Curator lopes is the daughter Of, Camilla duchess Of, cornwall And Andrew Parker. Bowles her'mother s remarriage in 2005 Made, Charles prince Of, wales her. stepfather Laura Rose Lopes (nee Née Parker; bowles born 1 january) 1978 is A british art. Curator lopes is the daughter Of, Camilla duchess Of, cornwall And Andrew Parker. bowles"}, {"url": "http://www.upi.com/topic/Camilla_Parker_Bowles/", "passage_text": "Wiki. Camilla, Duchess of Cornwall (Camilla Rosemary; nee Née, shand Previously Parker; bowles born 17 july) 1947 is the second wife Of Prince, Charles prince Of, wales and is the current holder of the Titles princess Of, Wales duchess Of, Cornwall duchess Of rothesay And countess Of. chester "}, {"url": "http://www.imdb.com/name/nm0993231/", "passage_text": "View rank on IMDbPro ». Camilla Parker-Bowles was born on July 17, 1947 in Denmark Hill, London, England as Camilla Rosemary Shand. She has been married to Prince Charles since April 9, 2005. She was previously married to Andrew Parker-Bowles. See full bi"}, {"url": "http://www.imdb.com/name/nm0993231/", "passage_text": "Camilla Parker-Bowles. Camilla Parker-Bowles was born on July 17, 1947 in Denmark Hill, London, England as Camilla Rosemary Shand. She has been married to Prince Charles since April 9, 2005. She was previously married to Andrew Parker-Bowles. See full bio »"}, {"url": "http://www.imdb.com/name/nm0993231/bio", "passage_text": "Camilla Parker-Bowles was born on July 17, 1947 in Denmark Hill, London, England as Camilla Rosemary Shand. She has been married to Prince Charles since April 9, 2005. She was previously married to Andrew Parker-Bowles. "}]