[{"url": "http://healthcareers.about.com/od/alliedmedicalprofiles/p/CVTech.htm", "passage_text": "How To Become a Cardiovascular Technologist: Like many allied health careers, becoming a cardiovascular technologist requires an associate's degree and a certification. An associate's degree in cardiovascular technology from an accredited program at a community college, technical school, or vocational school is recommended. You never know what you're going to get when you go to work each day, he adds. Challenges for Cardiovascular Technologists: Many challenges one may face as a CVT are similar to challenges faced by other medical professionals."}, {"url": "http://learn.org/articles/How_Can_I_Become_an_Invasive_Cardiovascular_Technologist.html", "passage_text": "Career Information at a Glance. As an invasive cardiovascular technologist, you'd assist physicians with surgical procedures designed to diagnose or treat heart conditions. To learn more about this career field and what it takes to qualify for a position, check out the table below. "}, {"url": "http://www.mypursuit.com/careers-29-2031.00/Cardiovascular_Technician.html", "passage_text": "How to become a Cardiovascular Technician. Cardiovascular technicians and technologists can be trained in a number of different ways. Some cardiovascular technicians and technologists receive on the job training, but most receive training in a vocational school or a community college. Two to four year programs are common, with two year programs at a community or junior college being the way that most cardiovascular technicians and technologists are trained. Four year programs are becoming much more popular, however."}, {"url": "http://study.com/articles/How_to_Become_a_Registered_Cardiovascular_Technician.html", "passage_text": "Step 2: Participate in an Internship. In order to obtain experience in the field, students in a cardiovascular technology program need to complete an internship in a medical setting. This is an opportunity for students to work and learn under an experienced cardiovascular technician and begin interacting with patients. During an internship, students can apply what they've learned in the classroom to a real-world setting. "}, {"url": "http://www.medicalcareerinfo.com/cardiovascular-technologist.htm", "passage_text": "The most common pathway to becoming a cardiovascular technologist is to earn an associate s degree in the discipline. Others will earn an undergraduate degree and complete a certificate as a cardiovascular technologist. Both degrees and certificates can be completed in around two years. "}, {"url": "http://healthcareers.about.com/od/alliedmedicalprofiles/p/CVTech.htm", "passage_text": "Brief Overview: Working as a cardiovascular technologist is an exciting and rewarding career in the field of cardiology, also known as cardiovascular medicine. Cardiovascular technologists (CVT) assist cardiologists in conducting cardiac catheterizations for diagnostic and therapeutic purposes. You never know what you're going to get when you go to work each day, he adds. Challenges for Cardiovascular Technologists: Many challenges one may face as a CVT are similar to challenges faced by other medical professionals."}, {"url": "http://www.allalliedhealthschools.com/health-careers/medical-imaging/cardiovascular-technologist/", "passage_text": "The Basics. What you'll do: In your cardiovascular technologist career, you'll diagnose heart (cardiac) and blood vessel (peripheral vascular) problems at the direction of a supervising physician. Where you'll work: Hospitals, physician's offices, diagnostic laboratories. Degree you'll need: 2-year associate's degree. What you'll do: In your cardiovascular technologist career, you'll diagnose heart (cardiac) and blood vessel (peripheral vascular) problems at the direction of a supervising physician"}]