[{"url": "http://www.creditcardchaser.com/what-do-credit-card-companies-charge-retailers/", "passage_text": "Consumers should care about the fees credit card companies charge retailers because the additional cost is passed on to customers. Therefore, in essence, fees charged to retailers add up to an additional fee for consumers."}, {"url": "http://www.ehow.com/info_8420804_much-charge-per-transaction-retailers.html", "passage_text": "Transaction Fee. Merchants are also charged a transaction fee at a rate of 15 to 75 cents per transaction. A credit card processing company called LawCharge says the fee is required to obtain authorization to deposit the funds into the merchant's account."}, {"url": "http://www.frugalrules.com/how-do-credit-cards-make-money-hard/", "passage_text": "Credit card companies make a lot of money. Total revenue for the credit card industry was nearly $155 billion in 2011. That’s even with the weak economy driving credit card spending down among consumers. In 2010, credit card companies made nearly $164 billion off revenue from credit card accounts. Credit card companies made almost $23 million from fees in 2009. Since the Credit CARD act went into effect a few years ago, that figure has fallen by a stunning $500,000."}, {"url": "http://bizfinance.about.com/od/credit-card-processing/tp/credit-card-processing-fees.htm", "passage_text": "Minimum Monthly Fee. In addition to the per transaction fee charged to you by the credit card processing company, you may also be assessed a minimum monthly fee. If you do not do a certain level of credit card business per month, the company will charge a minimum fee, usually around $25-$50 per month."}, {"url": "http://www.creditcardchaser.com/what-do-credit-card-companies-charge-retailers/", "passage_text": "Credit card companies have many avenues of income to support their money-lending practices. They charge customers fees for memberships and certain transactions as well as interest on balances owed. Another source of revenue for credit card companies is the charges from retailers."}, {"url": "http://bizfinance.about.com/od/credit-card-processing/tp/credit-card-processing-fees.htm", "passage_text": "5. In addition to the per transaction fee charged to you by the credit card processing company, you may also be assessed a minimum monthly fee. If you do not do a certain level of credit card business per month, the company will charge a minimum fee, usually around $25-$50 per month."}, {"url": "http://www.ehow.com/info_8420804_much-charge-per-transaction-retailers.html", "passage_text": "There are several fees charged to merchants that accept credit cards from their clients as a form of payment that range from 1 to 3 percent of the cost of a transaction."}, {"url": "http://bizfinance.about.com/od/credit-card-processing/tp/credit-card-processing-fees.htm", "passage_text": "The transaction fee is the minimum fee that credit card processing companies charge per credit card transaction. It depends on the method of payment and is usually a number of cents, which varies based on the amount of credit card business you generate. It is a set fee."}]