[{"url": "https://en.wikipedia.org/wiki/Osteomalacia", "passage_text": "Osteomalacia in children is known as rickets, and because of this, use of the term osteomalacia is often restricted to the milder, adult form of the disease. Signs and symptoms can include diffuse body pains, muscle weakness, and fragility of the bones. The most common cause of osteomalacia is a deficiency of vitamin D, which is normally derived from sunlight exposure and, to a lesser extent, from the diet."}, {"url": "http://www.musclesandjoints.com/Bone-tissue-diseases/soft-bones-osteomalacia-rickets/", "passage_text": "This is a natural mechanism, but if the level of calcium in the bones are constantly depleted the bones may end up being soft and fragile. Vitamin D is absorbed from the gut from the diet, but the body is also capable of producing its own vitamin D in the skin when it is exposed to sunlight. Osteomalacia can thus occur in the absence of intake of vitamin D e.g. in diseases of malabsorption, where the uptake from the intestine is impaired or in lack of sunlight, for example as seen in some Muslim women, who are completely covered."}, {"url": "http://www.musclesandjoints.com/Bone-tissue-diseases/soft-bones-osteomalacia-rickets/", "passage_text": "Bone tissue diseases. Osteomalacia is a state of depletion of calcium from the body's bones due to lack of vitamin D. Vitamin D enables the body to absorb calcium and phosphate from the gut while limiting the elimination of calcium in the urine and thus maintain an adequate calcium level in the body. Osteomalacia can thus occur in the absence of intake of vitamin D e.g. in diseases of malabsorption, where the uptake from the intestine is impaired or in lack of sunlight, for example as seen in some Muslim women, who are completely covered."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/15106892", "passage_text": "In this review, the common mechanisms involved in developing rickets or osteomalacia are identified and therapeutic measures are reported. Rare causes of osteomalacia due to congenital errors in metabolism or genetic defects are also discussed. 1. Interne Abteilung, Geriatriezentrum Baumgarten, Wien, Osterreich. peter.bernecker@wienkav.at. Although rickets and osteomalacia posed a serious health problem in industrialised countries a hundred years ago, these diseases are now rarely found, and when, usually in certain risk groups. In underdeveloped countries, rickets is still a major public health problem due to inadequate calcium intake by children"}, {"url": "https://en.wikipedia.org/wiki/Osteomalacia", "passage_text": "Osteomalacia is a generalized bone condition in which there is inadequate mineralization of the bone. Many of the effects of the disease overlap with the more common osteoporosis, but the two diseases are significantly different. Signs and symptoms can include diffuse body pains, muscle weakness, and fragility of the bones. The most common cause of osteomalacia is a deficiency of vitamin D, which is normally derived from sunlight exposure and, to a lesser extent, from the diet."}, {"url": "http://emedicine.medscape.com/article/392997-overview", "passage_text": "Overview. Osteomalacia is characterized by incomplete mineralization of normal osteoid tissue following closure of the growth plates. Osteomalacia may be part of the spectrum of osseous abnormalities that can be observed in patients with chronic renal insufficiency. This condition is referred to as renal osteodystrophy. Dysfunction in any one of these metabolic steps may result in rickets and osteomalacia in the growing child, as well as osteomalacia and secondary hyperparathyroidism in the adult. The histopathology of osteosclerosis in renal osteodystrophy is complex and incompletely understood."}, {"url": "http://www.musclesandjoints.com/Bone-tissue-diseases/soft-bones-osteomalacia-rickets/", "passage_text": "Definition and cause. Osteomalacia is a state of depletion of calcium from the body's bones due to lack of vitamin D. Vitamin D enables the body to absorb calcium and phosphate from the gut while limiting the elimination of calcium in the urine and thus maintain an adequate calcium level in the body. Osteomalacia can thus occur in the absence of intake of vitamin D e.g. in diseases of malabsorption, where the uptake from the intestine is impaired or in lack of sunlight, for example as seen in some Muslim women, who are completely covered."}, {"url": "https://en.wikipedia.org/wiki/Osteomalacia", "passage_text": "There are two main causes of osteomalacia: (1) insufficient calcium absorption from the intestine because of lack of dietary calcium or a deficiency of, or resistance to, the action of vitamin D; and (2) phosphate deficiency caused by increased renal losses. Signs and symptoms can include diffuse body pains, muscle weakness, and fragility of the bones. The most common cause of osteomalacia is a deficiency of vitamin D, which is normally derived from sunlight exposure and, to a lesser extent, from the diet."}]