[{"url": "http://money.usnews.com/careers/best-jobs/software-developer", "passage_text": "Salary. The Labor Department reports that software developers made a median salary of $92,660 in 2013. The highest-paid 10 percent in the profession earned $143,540 in 2013, while the lowest-paid earned $55,770. The Bureau of Labor Statistics projects a whopping 22.8 percent employment growth for software developers between 2012 and 2022, which is much faster than average for all occupations. In that period, an estimated 139,900 jobs will open up."}, {"url": "http://work.chron.com/much-computer-engineer-paid-per-hour-21954.html", "passage_text": "As of 2012, the BLS reports that systems software engineers earned an average hourly wage of $49.30 and an average annual salary of $102,550. Half of all systems software engineers working in the United States earned between $37.95 and $59.40 per hour, with the highest-paid 10 percent earning $71.56 or more per hour. Hardware engineers employed by software publishers earned more than those in any other industry, an average of $55.73 per hour. Average hourly pay by state ranged from a low of $36 in Oklahoma to a high of $55.95 in Michigan."}, {"url": "https://answers.yahoo.com/question/index?qid=20090520195631AAqH2Tq", "passage_text": "The median salary for someone with a two-year or four-year degree and no professional experience is $55,000 per year, going up to $80,000 for someone with 10 years of experience or more. "}, {"url": "http://jobsearch.about.com/od/jobs/qt/software-developer.htm", "passage_text": "Software Developer Salaries. According to the Bureau of Labor Statistics, Software developer with a focus on systems software earned an average of $99,000 in 2012. The bottom 10% of these developers earned an average of $62,800, while the top 10% earned in excess of $148,850. "}, {"url": "http://money.usnews.com/careers/best-jobs/software-developer/salary", "passage_text": "Salary Outlook. The Labor Department reports that software developers made a median salary of $92,660 in 2013. The highest-paid 10 percent in the profession earned $143,540 in 2013, while the lowest-paid earned $55,770. A software developer’s average salary, $96,260, is higher than most other occupations on our technology jobs list. For instance, a software developer made thousands more than computer systems analysts, who made an average salary of $85,320 in 2013, and computer programmers, who made about $80,93"}, {"url": "http://money.usnews.com/careers/best-jobs/software-developer/salary", "passage_text": "Best Paying Cities for Software Developers. The highest paid in the software developer profession work in the metropolitan areas of San Jose, California, Sioux City, Iowa, and Panama City, Florida. The San Francisco area also pays well, as does the city of Baltimore. A software developer’s average salary, $96,260, is higher than most other occupations on our technology jobs list. For instance, a software developer made thousands more than computer systems analysts, who made an average salary of $85,320 in 2013, and computer programmers, who made about $80,930"}, {"url": "http://work.chron.com/much-computer-engineer-paid-per-hour-21954.html", "passage_text": "Software Applications Developers. Applications developers are software engineers who design games and other programs. According to the BLS, they tended to earn slightly less than hardware and systems software engineers: an average of $44.85 an hour and $93,280 a year as of 2012. Hardware engineers employed by software publishers earned more than those in any other industry, an average of $55.73 per hour. Average hourly pay by state ranged from a low of $36 in Oklahoma to a high of $55.95 in Michigan."}, {"url": "http://www.itworld.com/article/2705996/it-management/the--200-000-software-developer--we-can-build-him--we-have-the-technology.html", "passage_text": "But how common is it for developers (that is, people actually writing code for a living) to make twice that much annually? It turns out that, while making $200,000 a year as a developer is unusual, it’s not unheard of. The BLS shows the 90th percentile of salary for software developers to be $138,880. According to Salary.com, which is based on employer reported data, the 90th percentile of base salary for software engineers with 8-10 years of experience is $139,473 ($146,893 when bonues are factored in). "}, {"url": "http://www.payscale.com/research/ZA/Job=Software_Engineer_%2f_Developer_%2f_Programmer/Salary", "passage_text": "The average salary for a Software Engineer / Developer / Programmer is R233,835 per year. People in this job generally don't have more than 10 years' experience. A skill in Linux is associated with high pay for this job. Experience strongly influences income for this job. "}]