[{"url": "http://www.medicinenet.com/heart_attack/article.htm", "passage_text": "A heart attack (also known as a myocardial infarction or MI) is the damage and death of heart muscle from the sudden blockage of a coronary artery by a blood clot. Coronary arteries are blood vessels that supply the heart muscle with blood and oxygen. Blockage of a coronary artery deprives the heart muscle of blood and oxygen, causing injury to the heart muscle. Injury to the heart muscle causes chest pain and chest pressure sensation."}, {"url": "https://en.wikipedia.org/wiki/Myocardial_infarction", "passage_text": "Myocardial infarction (MI) or acute myocardial infarction (AMI), commonly known as a heart attack, occurs when blood flow stops to a part of the heart causing damage to the heart muscle. The most common symptom is chest pain or discomfort which may travel into the shoulder, arm, back, neck, or jaw. "}, {"url": "http://medical-dictionary.thefreedictionary.com/cardiac+infarction", "passage_text": "Synonym(s): cardiac infarction, heart attack. MI is the most common cause of death in the U.S. Each year about 800,000 people sustain first heart attacks, with a mortality rate of 30%, and 450,000 people sustain recurrent heart attacks, with a mortality rate of 50%. 2. formation of an infarct. cardiac infarction myocardial infarction. cerebral infarction an ischemic condition of the brain, causing a persistent focal neurologic deficit in the area affected. myocardial infarction see myocardial infarction. The loss of living heart muscle as a result of coronary artery occlusion. MI or its related syndromes (acute coronary syndrome or unstable angina) usually occurs when an atheromatous plaque in a coronary artery ruptures, and the resulting clot obstructs the injured blood vessel"}, {"url": "http://www.hopkinsmedicine.org/heart_vascular_institute/conditions_treatments/conditions/myocardial_infarction.html", "passage_text": "A myocardial infarction (MI), commonly known as a heart attack, occurs when a portion of the heart is deprived of oxygen due to blockage of a coronary artery. Coronary arteries supply the heart muscle (myocardium) with oxygenated blood. Without oxygen, muscle cells served by the blocked artery begin to die (infarct). "}, {"url": "http://medical-dictionary.thefreedictionary.com/myocardial+infarction", "passage_text": "myocardial. pertaining to the muscular tissue of the heart (the myocardium). myocardial infarction (MI) death of the cells of an area of the heart muscle (myocardium) as a result of oxygen deprivation, which in turn is caused by obstruction of the blood supply; commonly referred to as a “heart attack.”. Synonym(s): cardiac infarction, heart attack. MI is the most common cause of death in the U.S. Each year about 800,000 people sustain first heart attacks, with a mortality rate of 30%, and 450,000 people sustain recurrent heart attacks, with a mortality rate of 50%."}, {"url": "http://emedicine.medscape.com/article/155919-overview", "passage_text": "Myocardial infarction (MI) (ie, heart attack) is the irreversible necrosis of heart muscle secondary to prolonged ischemia. Approximately 1.5 million cases of MI occur annually in the United States. See the images below. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=26016", "passage_text": "Myocardial infarction: A heart attack. Abbreviated MI. The term myocardial infarction focuses on the myocardium (the heart muscle) and the changes that occur in it due to the sudden deprivation of circulating blood. The main change is necrosis (death) of myocardial tissue. The word infarction comes from the Latin infarcire meaning to plug up or cram."}, {"url": "http://library.med.utah.edu/WebPath/TUTORIAL/MYOCARD/MYOCARD.html", "passage_text": "Ischemic heart disease is caused by an imbalance between the myocardial blood flow and the metabolic demand of the myocardium. Reduction in coronary blood flow is related to progressive atherosclerosis with increasing occlusion of coronary arteries. "}, {"url": "http://beltina.org/health-dictionary/myocardial-infarction-definition-treatment-ecg.html", "passage_text": "Death of HEART tissue. The most common cause of myocardial infarction is occlusion of the CORONARY ARTERIES such as occurs as a consequence of CORONARY ARTERY DISEASE (CAD) or less frequently of coronary ARTERY spasm. Myocardial infarction is the clinical term doctors use for HEART ATTACK"}]