[{"url": "http://www.businessinsider.com/what-happens-if-you-dont-get-enough-sleep-2014-2", "passage_text": "In our 24/7 culture, sleep loss is a major problem. Back in 1942, we averaged almost 8 hours of sleep a night — now that's down to 6.8. (Seven to 9 hours per night are what's generally recommended.)."}, {"url": "http://www.naturalsleep.org/what-happens-if-you-dont-get-enough-sleep/", "passage_text": "Your body cannot withstand lack of sleep as it is one of the basic amenities. They are a few things of what happens if you don’t get enough sleep. Eight hours is the recommended standard, but for persons who find that they cannot dedicate that much time for sleep, have a weekend break."}, {"url": "http://www.apa.org/topics/sleep/why.aspx", "passage_text": "Everyone’s individual sleep needs vary. In general, most healthy adults are built for 16 hours of wakefulness and need an average of eight hours of sleep a night. However, some individuals are able to function without sleepiness or drowsiness after as little as six hours of sleep. Others can't perform at their peak unless they've slept ten hours."}, {"url": "http://www.healthline.com/health/healthy-sleep/what-happens-to-your-body-when-you-lose-sleep", "passage_text": "1. Losing sleep can impair your body’s ability to fight off illness. This makes it easier to get sick. Researchers even uncovered that there’s a reciprocal relationship between sleep and your immune system. You may lose additional sleep while your body fights off a bug if you get sick and haven’t had enough shut-eye."}, {"url": "http://www.apa.org/topics/sleep/why.aspx", "passage_text": "Sleep is essential for a person’s health and wellbeing, according to the National Sleep Foundation (NSF). Yet millions of people do not get enough sleep and many suffer from lack of sleep. For example, surveys conducted by the NSF (1999-2004) reveal that at least 40 million Americans suffer from over 70 different sleep disorders and 60 percent of adults report having sleep problems a few nights a week or more."}, {"url": "http://www.businessinsider.com/what-happens-if-you-dont-get-enough-sleep-2014-2", "passage_text": "Almost 40% of Americans get less than 7 hours of sleep a night, a recent Gallup poll found, and an estimated 70 million Americans have a sleep disorder. Everyone knows that it's important to get enough sleep — but you may not realize just how many things can go wrong when you don't."}, {"url": "http://www.businessinsider.com/what-happens-if-you-dont-get-enough-sleep-2014-2", "passage_text": "Your reaction time is severely impeded when you don't get enough sleep. When researchers gave West Point cadets two tests that require quick decision-making, some were allowed to sleep between the tests, while others were not."}]