[{"url": "http://www.houzz.com/photos/nightstands-and-bedside-tables", "passage_text": "Nightstands are by nature fairly small, though the height can vary substantially. A too short or too tall nightstand is both uncomfortable to use and awkward looking when placed next to a taller (or shorter) bed. Look for a bedside table that’s within a few inches of the top of your mattress. "}, {"url": "http://williammillerdesign.blogspot.com/2008/10/how-tall-should-bedside-lamp-be.html", "passage_text": "Another really important factor I tink is the height of the bedside table, (nightstand). I like the principle level, (if you have more than one), to be at exactly the same height as the matress of the bed. I think a lot of people make it too low, or worse, too high. Shorter nightstands, such as a low profile modern style that is only 18” TO 20” off the floor, call for a taller lamp to equal the visual proportion if the headboard is higher than 36” above the nightstand top. Ultimately, this will depend on the height of the headboard, and or architecture of the bed wall itself."}, {"url": "http://www.city-data.com/forum/home-interior-design-decorating/1111825-height-nightstand-relation-bed.html", "passage_text": "One thing that is important, regardless of how high your nightstand is, is that the bedside lamp be the right height. When you are sitting up in bed, the bottom of your lampshade should be about shoulder height, so it casts the light in the right spot when you are reading. I think bedside lamps tend to be much too low. "}, {"url": "http://www.houzz.com/discussions/24876/how-tall-should-a-nightstand-be-in-relat", "passage_text": "As a rule of thumb, most nightstands are around 24-28 high. The average bed is around the same height. If you have a higher bed that needs a stepping stool, or a lower, minimalist type bed, you should adjust the night table height accordingly. The purpose of the night stand is to be able to access if from the bed, so if it is too tall, or too short-you most likely won't want to use it."}, {"url": "http://homeguides.sfgate.com/recommended-height-bedroom-lamp-83615.html", "passage_text": "Nightstand or Table Relation. The height of the ideal bedside lamp for your room depends upon the nightstand or table upon which the lamp sits. If the nightstand is tall, such as 25 to 30 inches, the lamp should be in the 30-inch range in order to look proportional against a headboard or the room in general. "}, {"url": "http://williammillerdesign.blogspot.com/2008/10/how-tall-should-bedside-lamp-be.html", "passage_text": "Lamps on bedside tables for example can have a scale and size that is proportionate to the height of the ceiling and the headboard or treatment on the bed wall. If your nightstand is 24” to 30” tall, Lamps should be at least 27” – 32” tall. Shorter nightstands, such as a low profile modern style that is only 18” TO 20” off the floor, call for a taller lamp to equal the visual proportion if the headboard is higher than 36” above the nightstand top. Ultimately, this will depend on the height of the headboard, and or architecture of the bed wall itself."}, {"url": "http://www.apartmenttherapy.com/perfect-bedside-height-how-to-102401", "passage_text": "Nightstands at the Perfect Bedside Height. For the past ten years, we've had very low bedside tables. Whether it's a low cut side table or a vintage trunk, I've tended to go low slung. This past weekend, however, we rearranged and moved our IKEA Anes dressers next to our bed to shake things up a bit. I would start with 27 for the side table or nightstand (near table height) and then adjust your bed lower from there. Ours is about 4-5 from mattress to side table, which is perfect for us right now."}, {"url": "http://ths.gardenweb.com/discussions/2448244/height-of-nightstand-in-relation-to-mattress", "passage_text": "Sonicmom, you should do some mock-ups of different height nightstands with cardboard boxes or stacks of books or something. I think you can have a taller nightstand and still get the look at the clock without lifting your head effect. Just put the clock at the very edge of a taller nightstand and see if it works. "}, {"url": "http://www.overstock.com/guides/nightstand-buying-guide", "passage_text": "Match your nightstand height to your mattress' height. A low-profile platform bed needs a low nightstand whereas a tall sleigh bed would do better with tall nightstand. In any case, your nightstand height should ideally fall within a few inches of the level you sleep at. 1  Surface Area. "}, {"url": "http://www.tidbitsandtwine.com/my-secret-cheat-sheet-of-measurements/", "passage_text": "1 If you have space for a bench, box, chest or trunk at the end of a bed, it should be slightly lower than the height of the bed and no more than 15”-21” deep. 2  For most beds, 24”-27” is the ideal height for a nightstand. 3  For a King-size bed, nightstands should be at least 36” wide. "}]