[{"url": "http://webhelp.esri.com/arcgisdesktop/9.2/index.cfm?TopicName=Hillshade", "passage_text": "Raster cells in shadow are assigned a value of zero. To create a raster of the shadow areas only, use the Con, Reclassify, or Extract By Attribute tool to separate the value zero from the other hillshade values. Hillshade must have the Model shadows check box checked. Computes hillshade values for a raster surface by considering the illumination angle and shadows. Learn more about how Hillshade works. Illustration. Usage tips. Command line and Scripting. The Hillshade tool creates a shaded relief raster from a raster."}, {"url": "http://resources.arcgis.com/en/help/main/10.1/009t/009t0000004z000000.htm", "passage_text": "Hillshade function. A hillshade is a grayscale 3D model of the surface, with the sun's relative position taken into account for shading the image. This function uses the latitude and azimuth properties to specify the sun's position. The inputs for this function are the following: 1  Input DEM. 2  Azimuth. 3  Altitude. 4  Scaling. 5  Z Factor"}, {"url": "http://help.arcgis.com/en/arcgisdesktop/10.0/help/009z/009z000000v0000000.htm", "passage_text": "Raster cells in shadow are assigned a value of zero. To create a raster of the shadow areas only, use the Con, Reclassify, or Extract by Attributes tool to separate the value zero from the other hillshade values. Hillshade must have had the Model shadows option enabled."}, {"url": "http://ua.dnr.wi.gov/maps/gis/documents/hillshade_image.pdf", "passage_text": "Hillshade Image of Wisconsin. a factor of 8 to enhance the vertical dimension of the landscape. The image is intended for use with ArcView, ArcInfo, or other GIS software. The data is not intended for for use in analysis. "}, {"url": "http://edndoc.esri.com/arcobjects/9.2/NET/shared/geoprocessing/spatial_analyst_tools/how_hillshade_works.htm", "passage_text": "The Hillshade function obtains the hypothetical illumination of a surface by determining illumination values for each cell in a raster. It does this by setting a position for a hypothetical light source and calculating the illumination values of each cell in relation to neighboring cells. The Hillshade algorithm. To calculate the shade value, first the altitude and azimuth of the illumination source is needed. These values will be processed along with calculations for slope and aspect to determine the final hillshade value for each cell in the output raster."}, {"url": "http://www.landtrustgis.org/technology/advanced/shaded%20relief/", "passage_text": "Shaded relief effect is derived from a digital elevation model (DEM), which is a raster dataset of elevation values. DEMs and hillshades are separate datasets-a DEM contains actual elevation values while a hillshade, though also a raster, contains brightness values. However, there are a number of key points that are relevant to all hillshade creation. Data sources: For the U.S., DEMs are commonly obtained from USGS and are available in a range of resolutions from 10-meter (high resolution) to 90-meter (lower resolution) cell sizes."}, {"url": "http://www.landtrustgis.org/technology/advanced/shaded%20relief/", "passage_text": "There are two variables that are used to define the light's position-altitude and azimuth. Altitude ranges from 0 to 90 (degrees) and relates the angle the light source is from the horizon. 0 means the light source is on the horizon, 90 means the light source is directly overhead. However, there are a number of key points that are relevant to all hillshade creation. Data sources: For the U.S., DEMs are commonly obtained from USGS and are available in a range of resolutions from 10-meter (high resolution) to 90-meter (lower resolution) cell sizes."}]