[{"url": "http://medical-dictionary.thefreedictionary.com/lobotomized", "passage_text": "a form of psychosurgery consisting of cutting of nerve fibers connecting a lobe of the brain with the thalamus. In most cases the affected parts are the prefrontal or frontal lobes, the areas of the brain involved with emotion; thus the operation is referred to as prefrontal or frontal lobotomy."}, {"url": "http://medical-dictionary.thefreedictionary.com/lobotomy", "passage_text": "lobotomy. a form of psychosurgery consisting of cutting of nerve fibers connecting a lobe of the brain with the thalamus. In most cases the affected parts are the prefrontal or frontal lobes, the areas of the brain involved with emotion; thus the operation is referred to as prefrontal or frontal lobotomy."}, {"url": "http://www.audioenglish.org/dictionary/lobotomy.htm", "passage_text": "The noun LOBOTOMY has 1 sense: 1. surgical interruption of nerve tracts to and from the frontal lobe of the brain; often results in marked cognitive and personality changes. Familiarity information: LOBOTOMY used as a noun is very rare. Dictionary entry details. • LOBOTOMY (noun)."}, {"url": "http://medical-dictionary.thefreedictionary.com/lobotomy", "passage_text": "cutting of nerve fibers connecting a lobe of the brain with the thalamus. In most cases the affected parts are the prefrontal or frontal lobes; thus the operation is referred to as prefrontal, or frontal, lobotomy. Performed in humans as a form of psychosurgery."}, {"url": "http://www.thefreedictionary.com/lobotomy", "passage_text": "2. (Surgery) Also called: prefrontal leucotomy a surgical interruption of one or more nerve tracts in the frontal lobe of the brain: used in the treatment of intractable mental disorders. [C20: from lobe + -tomy]. (ləˈbɒt ə mi, loʊ-). n., pl."}, {"url": "http://www.audioenglish.org/dictionary/lobotomy.htm", "passage_text": "Synonyms: frontal lobotomy; leucotomy; leukotomy; lobotomy; prefrontal leucotomy; prefrontal leukotomy; prefrontal lobotomy. Hypernyms (lobotomy is a kind of...): psychosurgery (brain surgery on human patients intended to relieve severe and otherwise intractable mental or behavioral problems)."}]