[{"url": "http://budgeting.thenest.com/rewrite-mortgage-21048.html", "passage_text": "How to Rewrite a Mortgage. This can be the final step in revising your mortgage. Rewriting a home mortgage is a cooperative process between you and the lender. It's changing the terms and conditions, from the interest rate to the amount and length of the loan. You can't rewrite the mortgage on your own, nor can the lender. Explain to your loan representative why you want to rewrite the mortgage and exactly what revisions you need. You'll have to make your case clearly unless your current mortgage has a provision for rewriting."}, {"url": "http://www.answers.com/Q/What_is_an_auto_loan_rewrite", "passage_text": "Answer   It is easier to get an auto loan than a home loan. No matter which kind of loan your trying to get you should also compare several loan option to make sure … you get the best home or auto loan available to you no matter what current financial circumstance you may have. "}, {"url": "http://ficoforums.myfico.com/t5/Auto-Loans/Auto-Loan-Rewrite-Ford-Credit/td-p/640655", "passage_text": "Good Morning, I am applying for a mortgage and in order to qualify I have to lower my DTI. My only debt is a car payment that is $488 a month. There is only 15 months left, but right now I do not have the money to pay it off since most of my reserves are going towards a down payment. "}, {"url": "https://en.wikipedia.org/wiki/Mortgage_servicer", "passage_text": "A mortgage servicer may be a borrower's lender, but often the beneficial rights to the payment of principal and interest on mortgages are sold to investors such as Fannie Mae, Freddie Mac, Ginnie Mae, FHA, and private investors in mortgage securitization transactions. From Wikipedia, the free encyclopedia. A mortgage servicer is a company to which some borrowers pay their mortgage loan payments and which performs other services in connection with mortgages and mortgage-backed securities."}, {"url": "http://www.bsdcorp.org/resource/the-difference-between-refinancing-and-loan-modification/", "passage_text": "Refinancing vs. Loan Modification. Homeowners who are struggling to make mortgage payments in these tough times are looking for the best solution and often they are faced with the choice of refinancing or loan modification. Loan Modification. Loan modification is also rewriting the terms of the mortgage with a new one, but loan modifications are specifically designed to help the struggling homeowner. Here are the key points to remember: Restart Your Mortgage: Loan Modification is a remedy used to bring homeowners current on their mortgage."}, {"url": "http://www.merriam-webster.com/dictionary/rewrite", "passage_text": "Full Definition of REWRITE. transitive verb. 1. : to write in reply. 2. : to make a revision of (as a story) : cause to be revised: as a: to put (contributed material) into form for publication b: to alter (previously published material) for use in another publication. intransitive verb. "}, {"url": "http://www.nolo.com/legal-encyclopedia/whats-the-difference-between-loan-modification-forbearance-agreement-repayment-plan.html", "passage_text": "With a loan modification, the lender may agree to do one of more of the following to reduce your monthly payment: 1  reduce the interest rate. 2  convert from a variable interest rate to a fixed interest rate, or. 3  extend of the length of the term of the loan. Generally, to be eligible for a loan modification, you must: 1  show that you cannot make your current mortgage payment due to a financial hardship. 2  complete a trial period to demonstrate you can afford the new monthly amount, and."}, {"url": "http://www.thefreedictionary.com/rewrite", "passage_text": "2. rewrite-rewrite so as to make fit to suit a new or different purpose; re-write a play for use in schools. authorship, penning, writing, composition-the act of creating written works; writing was a form of therapy for him; it was a matter of disputed authorship. "}]