[{"url": "http://www.cheftalk.com/t/55701/leftover-canned-refried-beans-how-long-in-fridge", "passage_text": "Here's my standard procedure: I open a can of beans and use half immediately. The other half I store in a sealed plastic container in the fridge and use within 24 hours. My question is can I keep the stored half longer than 24 hours, and if so how long? I don't know what 2-3 days means. If I open the can on Monday, is Tuesday considered 1 day old or 2 days old? If someone could give me the expiration time in hours as opposed to days, it would make a lot more sense to me. Thank"}, {"url": "http://www.wholefoodsmarket.com/recipes/food-guides/beans", "passage_text": "Uncooked: Avoid the refrigerator! Instead, keep dried beans, peas and lentils in airtight containers and store them in a dry, cool, dark place. If you do it right, beans will last up to a year, lentils, up to 6 months. Cooked: Refrigerate cooked beans in a covered container for up to 5 days. (If it's really warm in your kitchen, soak the beans in the refrigerator instead to avoid fermentation.). Quick soak: Put beans into a large pot and cover with 2 to 3 inches of cool, clean water. Bring to a boil then boil briskly for 2 to 3 minutes. Cover and set aside off of the heat for 1 hour; drain well."}, {"url": "http://www.answers.com/Q/How_long_do_refried_beans_last_in_refrigerator", "passage_text": "How long do beans last in the refrigerator?   Vegkitchen.com reports that red beans will last in the refrigerator for up to a week, and in the freezer for up to 6 months. This food will keep for about 4 days in the refrigerator. Place the food in an air tight container for the best results. This food can easily be transferred to the freezer for … longer storage time."}, {"url": "http://www.answers.com/Q/How_long_do_refried_beans_last_in_refrigerator", "passage_text": "If garbanzo beans are cooked, they will stay fresh in the  refrigerator for 3 days. If they are dry, they can be stored in the  pantry for a year. This food will keep for about 4 days in the refrigerator. Place the food in an air tight container for the best results. This food can easily be transferred to the freezer for … longer storage time."}, {"url": "http://www.answers.com/Q/How_long_do_refried_beans_stay_fresh_in_the_fridge", "passage_text": "Beans do not keep well. If kept in an airtight container, they will stay fresh for about 3 days. They will keep for 2 weeks if frozen. This food will last for a few days. 2 days in the refrigerator is as long as you want to store this food here. Place the food in an air tight container or freezer bags. Then y … ou can transfer it to the freezer if more storage time is needed"}, {"url": "http://www.qacollections.com/How-long-do-refried-beans-stay-good", "passage_text": "Refried beans stay good for two or three days if kept in a refrigerator. Once you have opened a can of refried beans, refrigerate the leftovers in a non-metal container. They will stay good for two... Read More ». Refried beans, a common part of Mexican cuisine, will keep in the refrigerator for two or three days before spoiling. Canned refried beans that have been opened should be used within two days of be... Read More ». http://www.answerbag.com/q_view/1987762"}, {"url": "http://food-answers.co.uk/questions/how-long-will-refried-beans-keep-in-the-refrigerator-812808.html", "passage_text": "Refried beans stay good for two or three days if kept in a refrigerator. Once you have opened a can of refried beans, refrigerate the leftovers in a non-metal container. They will stay good for two... Compston Eric answered on 4/19/2014. Refried beans, a common part of Mexican cuisine, will keep in the refrigerator for two or three days before spoiling. Canned refried beans that have been opened should be used within two days of being refrigerated. Refried beans that you have cooked yourself will stay fresh in the refrigerator for three days"}]