[{"url": "http://psychologydictionary.org/reaction-formation/", "passage_text": "The psychoanalytical theory that as a defense mechanism, an individual will respond to unacceptable or threatening unconscious impulses by exhibiting (in their conscious actions) the opposite. For example, a subject vulnerable to abhorrent sexual desire may preach against such practices in the community. "}, {"url": "https://en.wikipedia.org/wiki/Psychology", "passage_text": "Humanistic psychology developed in the 1950s as a movement within academic psychology, in reaction to both behaviorism and psychoanalysis. The humanistic approach sought to glimpse the whole person, not just fragmented parts of the personality or isolated cognitions. Comparative psychology refers to the scientific study of the behavior and mental processes of non-human animals, especially as these relate to the phylogenetic history, adaptive significance, and development of behavior. Research in this area explores the behavior of many species, from insects to primates."}, {"url": "http://www.simplypsychology.org/classical-conditioning.html", "passage_text": "Behaviorism as a movement in psychology appeared in 1913 when John Broadus Watson published the classic article Psychology as the behaviorist views it. John Watson proposed that the process of classical conditioning (based on Pavlov’s observations) was able to explain all aspects of human psychology. "}, {"url": "https://www.psychologytoday.com/basics/stress", "passage_text": "Stress. Stress is simply a reaction to a stimulus that disturbs our physical or mental equilibrium. In other words, it's an omnipresent part of life. A stressful event can trigger the “fight-or-flight” response, causing hormones such as adrenaline and cortisol to surge through the body. "}, {"url": "http://psychology.wikia.com/wiki/Reaction_time", "passage_text": "Cognitive Psychology: Attention · Decision making · Learning · Judgement · Memory · Motivation · Perception · Reasoning · Thinking-Cognitive processes Cognition-Outline Index. With regards to reflexes, reaction time is the time from the onset of a stimulus until the emmission of an organism response. "}, {"url": "http://psychology.wikia.com/wiki/Reaction_formation", "passage_text": "Psychoanalysts. Psychoanalytic training. In Sigmund Freud 's psychoanalytic theory, reaction formation is a defense mechanism in which anxiety-producing or unacceptable emotions are replaced by their direct opposites. This mechanism is often characteristic of obsessional neuroses. "}, {"url": "http://www.simplypsychology.org/social-psychology.html", "passage_text": "by Saul McLeod published 2007. Social psychology is about understanding individual behavior in a social context. Baron, Byrne & Suls (1989) define. as ....“ the scientific field that seeks to understand the nature and causes of individual behavior in social situations ”. (p. 6). It therefore looks at human behavior as influenced by other people and the social context in which this occurs."}, {"url": "https://en.wikipedia.org/wiki/Mental_chronometry", "passage_text": "Mental chronometry is one of the core paradigms of experimental and cognitive psychology, and has found application in various disciplines including cognitive psychophysiology, cognitive neuroscience, and behavioral neuroscience to elucidate mechanisms underlying cognitive processing. Mental chronometry is studied using the measurements of reaction time (RT). Reaction time is the elapsed time between the presentation of a sensory stimulus and the subsequent behavioral response. In psychometric psychology it is considered to be an index of speed of processing. That is, it indicates how fast the thinker can execute the mental operations needed by the task at hand. In turn, speed of processing is considered an index of processing efficiency"}, {"url": "https://en.wikipedia.org/wiki/Psychology", "passage_text": "Psychology is the study of mind and behavior. It is an academic discipline and an applied science which seeks to understand individuals and groups by establishing general principles and researching specific cases. Comparative psychology refers to the scientific study of the behavior and mental processes of non-human animals, especially as these relate to the phylogenetic history, adaptive significance, and development of behavior. Research in this area explores the behavior of many species, from insects to primates."}]