[{"url": "http://globiosanswers2everything.blogspot.com/2008/12/how-much-bamboo-do-pandas-eat-each-day.html", "passage_text": "How much bamboo do pandas eat a day?GLOBIO Traveling Teacher says:Hi Marisca,Bamboo is the giant panda's favorite food. Adult giant pandas will spend 10 to 16 hours a day finding and eating bamboo. They eat different parts of the plant depending on the time of year. In the summer and autumn, pandas munch mostly on leaves. Winter means a diet of tough stems."}, {"url": "http://www.answers.com/Q/How_much_food_does_a_red_panda_eat_each_day", "passage_text": "How much food does a giant panda eat every day? The average giant panda eats as much as 9 to 14 kg (20 to 30 pounds) of bamboo shoots a day. They do this to keep their digestive tract full because it consumes food that are … low on nutrition. 14 people found this useful. Adult giant pandas eat up to 500 bamboo stems a day, which is the equivalent of 9 to 14 kilograms (20 to 30 pounds). The reason for this is the relatively low nutrition of the … shoots, compared to the indigestible fiber"}, {"url": "http://wwf.panda.org/what_we_do/endangered_species/giant_panda/panda/what_do_pandas_they_eat/", "passage_text": "The simple answers is: bamboo. A panda's daily diet consists almost entirely of the leaves, stems and shoots of various bamboo species. Bamboo contains very little nutritional value so pandas must eat 12-38kg every day to meet their energy needs. But they do branch out, with about 1% of their diet comprising other plants and even meat. While they are almost entirely vegetarian, pandas will sometimes hunt for pikas and other small rodents. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071114171114AAlnFyp", "passage_text": "A wild panda spends about 12 to 16 hours a day feeding and may eat up to 40 lb of bamboo daily, sometimes even more. A captive panda's daily bamboo consumption is somewhat less and is determined by its keepers. http://www.geocities.com/panda_patch/faq... How much bamboo does a panda eat? Because giant pandas are unable to efficiently digest bamboo and thus absorb only a small percentage of the nutrients in it, they must consume vast amounts of it in order to ensure that they get enough nutrients."}, {"url": "http://www.kgbanswers.com/how-much-do-pandas-eat-in-one-day/4612062", "passage_text": "How much do pandas eat in one day. Pandas eat as much as 19 kilos of bamboo and for as much as 14 hours a day, which comes out to more than 10,000 pounds per year! WOW!! report this answer. Updated on Wednesday, February 01 2012 at 09:25PM EST. Source: www.answerbag.com/..."}, {"url": "http://animals.mom.me/many-pounds-bamboo-can-giant-panda-eat-day-3171.html", "passage_text": "Pounds of Bamboo. The diet of giant pandas is all about bamboo, bamboo and more bamboo. These solitary mammals generally eat somewhere between 20 and 40 pounds of it each day, according to the Smithsonian National Zoological Park. Bamboo isn't very high in nutrients, and because of that, giant pandas have to eat it in very copious amounts. They're only able to receive roughly 17 percent of the nourishment from the stalks and foliage of bamboo. For a giant panda, a minimum of half the day revolves around bamboo consumption and searching. "}, {"url": "http://www.answers.com/Q/How_much_bamboo_does_a_giant_panda_eat_in_one_day", "passage_text": "The average giant panda eats as much as 9 to 14 kg (20 to 30 pounds) of bamboo shoots a day. They do this to keep their digestive tract full because it consumes food that are … low on nutrition. 14 people found this useful. Answer by Yazzywoman1. Confidence votes 465. Adult giant pandas eat up to 500 bamboo stems a day, which is the equivalent of 9 to 14 kilograms (20 to 30 pounds). The reason for this is the relatively low nutrition of the shoots, compared to the indigestible fiber."}]