[{"url": "http://study.com/academy/lesson/what-is-epithelial-tissue-function-types-structure.html", "passage_text": "Pseudostratified columnar epithelium is a type of tissue that has a single layer of cells arranged in a fashion that appears to be stratified, whereas transitional epithelial tissue is an elastic-like epithelial tissue that swells, contracts, and changes shape as necessary. "}, {"url": "http://www.courseweb.uottawa.ca/medicine-histology/English/SS_BasicTissues/Epithelia.htm", "passage_text": "For example, the epidermis is called a stratified squamous epithelium even though the cells in the basal layers are cuboidal, because the outermost layer of cells is squamous. Images of different types of epithelia are shown below. The inside of the body cavity is also lined by an epithelium, as is the outer surface of many internal organs. The inner surfaces of all the tubes and ducts of the body are also lined by epithelia, whether they open to the outside (eg. digestive system, reproductive system) or are enclosed (eg. cardiovascular system)."}, {"url": "https://en.wikipedia.org/wiki/Olfactory_epithelium", "passage_text": "The olfactory epithelium is a specialized epithelial tissue inside the nasal cavity that is involved in smell. In humans, it measures about 3 square centimeters (on each side) and lies on the roof of the nasal cavity about 7 cm above and behind the nostrils. "}, {"url": "http://medcell.med.yale.edu/histology/epithelia_lab.php", "passage_text": "At the basal surface of epithelial cells are located: 1  The basement membrane, a thin non-cellular layer, intervenes between the epithelium and the connective tissue. 2  Hemidesmosomes are a variant of the intercellular desmosomes and anchor the cell to the basement membrane. 1 Shape of Cells. 2  In squamous epithelia, the outermost layer is flattened. 3  A cuboidal epithelium is characterized by cells that are as tall as they are wide. 4  When these cells are taller than they are wide, they make up a columnar epithelium."}, {"url": "http://www.siumed.edu/~dking2/intro/epith.htm", "passage_text": "1 Stratified signifies two or more layers of epithelial cells. 2  By convention, a stratified epithelium is described according to the shape of cells on its free surface. 3  Regardless of whether the surface cells are squamous, cuboidal, or columnar, the underlying cells are usually cuboidal. 1 Simple signifies a single layer of epithelial cells.  2 Stratified signifies two or more layers of epithelial cells. 3"}, {"url": "http://medical-dictionary.thefreedictionary.com/epithelium", "passage_text": "The layer of cells forming the epidermis of the skin and the surface layer of mucous and serous membranes. The cells rest on a basement membrane and lie in close approximation with little intercellular material between them. They are devoid of blood vessels. Epithelium in which the bases of cells rest on the basement membrane but the distal ends of some do not reach the surface. Their nuclei lie at different levels, giving the appearance of stratification."}, {"url": "https://en.wikipedia.org/wiki/Epithelium", "passage_text": "There are three principal shapes of epithelial cells: squamous, columnar, and cuboidal. These can be arranged in a single layer of cells as simple epithelium, either squamous, columnar or cuboidal, or in layers of two or more cells deep as stratified (layered), either squamous, columnar or cuboidal. All glands are made up of epithelial cells. Epithelium lines both the outside (skin) and the inside cavities and lumina of bodies. The outermost layer of human skin is composed of dead stratified squamous, keratinized"}, {"url": "https://en.wikipedia.org/wiki/Epithelium", "passage_text": "The lining of the esophagus is an example of a non-keratinized or moist stratified epithelium. Transitional. Transitional epithelia are found in tissues that stretch and it can appear to be stratified cuboidal when the tissue is not stretched or stratified squamous when the organ is distended and the tissue stretches. Epithelium lines both the outside (skin) and the inside cavities and lumina of bodies. The outermost layer of human skin is composed of dead stratified squamous, keratinized epithelial cells."}, {"url": "https://en.wikipedia.org/wiki/Epithelium", "passage_text": "Simple epithelium is one cell thick; that is, every cell is in direct contact with the underlying basement membrane. In general, it is found where absorption and filtration occur. The thinness of the epithelial barrier facilitates these processes. Epithelium lines both the outside (skin) and the inside cavities and lumina of bodies. The outermost layer of human skin is composed of dead stratified squamous, keratinized epithelial cells."}, {"url": "https://askabiologist.asu.edu/epithelial-cells", "passage_text": "Squamous epithelial cells are flat and are usually found lining surfaces that require a smooth flow of fluid such as your blood vessels, or lining areas that require a very thin surface for molecules to pass through, such as the air sacs in your lungs. Once again, it is epithelial cells that make and secrete the enzymes in your stomach. Epithelial cells also secrete hormones into your blood vessels, mucous in your nose and the breast milk which mothers feed their young."}]