[{"url": "http://americanhistory.about.com/od/johntyler/p/ptyler.htm", "passage_text": "Becoming President: John Tyler was the Vice President under William Henry Harrison in the election of 1840. He was chosen to balance the ticket since he was from the South. He took over upon Harrison's quick demise after only one month in office."}, {"url": "http://history1800s.about.com/od/19th-Century-Presidents/ss/John-Tyler-Facts-and-Bio.htm", "passage_text": "Accomplishments: John Tyler, who had been elected as the vice president to William Henry Harrison in the election of 1840, became president when Harrison died a month after his inauguration. As Harrison was the first president to die in office, his death raised a number of questions. "}, {"url": "http://us-presidents.insidegov.com/l/29/John-Tyler", "passage_text": "6 user reviews. John Tyler, a member of the Whig Party, took office as the 10th President of the United States on April 4, 1841 at age 51. Tyler served in office for 3 years 46 weeks and did not seek reelection after his first term. "}, {"url": "https://en.wikipedia.org/wiki/John_Tyler", "passage_text": "John Tyler (March 29, 1790 – January 18, 1862) was the tenth President of the United States (1841–1845). He was elected vice president on the 1840 Whig ticket with William Henry Harrison, and became president after his running mate 's death in April 1841. Tyler served as a Virginia state legislator, governor, U.S. representative, and U.S. senator before his election as vice president in the presidential election of 1840. He was put on the ticket to attract states' rights Southerners to what was then a Whig coalition to defeat Van Buren's re-election bid."}, {"url": "http://www.usa4kids.com/presidents/John_Tylor.html", "passage_text": "John Tyler would be 218 years old this year. BIOGRAPHY. John Tyler was the first Vice President who was elevated to the President’s office because of the death of his predecessor. For this reason, he was also called “His Accidency” by his critics. Tyler was born and brought up in Virginia"}, {"url": "http://millercenter.org/president/biography/tyler-impact-and-legacy", "passage_text": "William Henry Harrison's death demonstrated for the first time the importance of nominating a vice president who actually was qualified for the presidency. Once in office, many Americans felt that John Tyler lacked the temperament and political skills to be chief executive. "}, {"url": "http://www.biography.com/people/john-tyler-9512796", "passage_text": "Synopsis. John Tyler was born on March 29, 1790, in Charles City County, Virginia. Like his father, Tyler served as governor of Virginia. Representing the Whig Party, he was the first vice president to become president due the death of his predecessor (President William Henry Harrison). Tyler was sworn in as the 10th president of the United States in 1841. He died after suffering a stroke on January 18, 1862, in Richmond, Virginia. "}, {"url": "https://www.whitehouse.gov/1600/presidents/johntyler", "passage_text": "John Tyler. John Tyler became the tenth President of the United States (1841-1845) when President William Henry Harrison died in April 1841. He was the first Vice President to succeed to the Presidency after the death of his predecessor. Dubbed His Accidency by his detractors, John Tyler was the first Vice President to be elevated to the office of President by the death of his predecessor. Born in Virginia in 1790, he was raised believing that the Constitution must be strictly construed. He never wavered from this conviction."}]