[{"url": "http://www.allaboutvision.com/conditions/red-eyes.htm", "passage_text": "Red eye is caused by swollen or dilated blood vessels on the sclera, the white outer surface of the eye. Red eyes can be accompanied by eye pain, itching, eye discharge, swollen eyes or visual disturbances such as blurry vision. In other cases, a red eye may cause no irritation at all. "}, {"url": "http://symptomchecker.webmd.com/multiple-symptoms?symptoms=painful-red-lump-on-eyelid|puffy-eyelids|sore-or-burning-eyes|swelling&symptomids=173|346|218|5&locations=3|3|3|3", "passage_text": "Painful red lump on eyelid, Puffy eyelids, Sore or burning eyes and Swelling. WebMD Symptom Checker helps you find the most common medical conditions indicated by the symptoms painful red lump on eyelid, puffy eyelids, sore or burning eyes and swelling including Sty (hordeolum), Hay fever, and Allergic reaction. "}, {"url": "http://www.livestrong.com/article/243675-what-are-the-causes-of-a-sore-swollen-eyelid/", "passage_text": "Sore swollen eyelids are always worrisome. Photo Credit girl with swollen eye / crying / allergy image by Katrina Miller from Fotolia.com. In a Medscape Journal article, Dr. Jane Fansler states that a sore, swollen eyelid is one of the most common presenting complaints at a primary care doctor's office. Two types of herpes virus infections cause sore swollen eyelids: herpes simplex, and herpes zoster. H simplex is the same virus that causes cold sores. If present on the eyelid, it will develop a cluster of small blisters on top of a red rash spot."}, {"url": "http://www.eyehealthweb.com/swollen-eyelid/", "passage_text": "Like adults, children can be affected by swelling in their eyelids. Common causes include trauma and allergies, but children can also develop a swollen eyelid from eye conditions such as blepharitis and pink eye (conjunctivitis). Children also experience symptoms like redness, burning sensations, watery eyes, and pain. "}, {"url": "http://www.webmd.boots.com/eye-health/guide/swollen-eyes", "passage_text": "Swelling of the eye refers to the presence of excess fluid or oedema in the connective tissues around the eye, especially the eyelids. Eyelid problems are not usually serious, but if you have concerns, seek medical advice. A swollen eye can result from trauma, infections or other injuries to the eye area. Swollen eye treatment. Depending on the cause of the swelling, over the counter or prescription eye drops, steroid or antibiotic eye drops, or creams or ointments may help reduce the swelling around the eye, depending on the cause."}, {"url": "http://www.healthgrades.com/symptoms/sore-eyes", "passage_text": "Sore eyes without eye pain is a common complaint that usually resolves on its own with rest. Sore eyes accompanied by eye pain and other symptoms, including fever, discharge, redness, sudden vision changes, or eyelids that are red and swollen, should be evaluated by your health care provider. In most cases, sore eyes are not serious. Seek immediate medical care (call 911) if you have sore eyes together with eye pain, fever, discharge, redness, sudden vision changes, or eyelids that are red and swollen. Seek prompt medical care if your symptoms of sore eyes are persistent or cause you concern."}, {"url": "http://www.medicinenet.com/swollen_eyes/symptoms.htm", "passage_text": "Swelling of the eye, also referred to as periorbital puffiness, refers to the presence of excess fluid (edema) in the connective tissues around the eye, most commonly the eyelids. A swollen eye can result from trauma, infections, or other injuries to the eye area. Prolonged crying is a common cause of swollen eyes. Virtually any cause of inflammation to the eye area may manifest as eyelid swelling, although allergic reactions are likely the most common cause. With allergic reactions, the eyes may also be red and itchy as well as swollen."}, {"url": "http://www.allaboutvision.com/conditions/swollen-eyelids.htm", "passage_text": "Conjunctivitis. Also called  pink eye , conjunctivitis is inflammation of the clear lining of the surface of the eye, called the conjunctiva. Allergic, bacterial and viral types of pink eye can all result in swollen eyelids, among other symptoms such as watery, red and itchy eyes. Styes. Swollen eyes usually are accompanied by one or more of the following: 1  Eye irritation, such as an itchy or scratchy sensation. 2  Excess tear production, resulting in watering eyes. 3  Obstructed vision (depending on the extent of the swelling). 4  Redness of the eyelid"}, {"url": "http://www.eyeinstitute.co.nz/the-eye/eye-problems-and-symptoms/sore-eyes.htm", "passage_text": "Constantly sore and dry eyes may even water more, as the eyes respond to the dryness and irritation with excess tears. See the information on dry eyes and watery eyes for more details. Itchy, red, sore eyes Allergies and eye infections can both cause your eyes to feel sore, red and itchy. Often, itchy or irritated eyes can become sore after excessive rubbing. The eye infection conjunctivitis is a particularly common cause of sore, red eyes. Contact lens irritation can also cause sore, red eyes. "}]