[{"url": "http://www.prokerala.com/health/diseases/diabetes-induced-diseases.php", "passage_text": "Health. A condition in which the sugar (glucose) levels in the blood increase abnormally is known as Diabetes mellitus, simply referred to as diabetes. Pancreas in the human body produces a hormone called insulin which helps convert the sugar into energy. In diabetes the body either fails to produce insulin or is unable to respond to it. This increases the quantity of sugar in the blood. Most diabetic patients are prone to heart diseases and stroke. Excess of sugar in the blood affects various body parts including the blood vessels such as the arteries, capillaries and veins. Heart diseases result in the narrowing of the blood vessels that supply blood to the heart, brain or hands and legs."}, {"url": "https://www.health.ny.gov/diseases/conditions/diabetes/problems_caused_by_diabetes.htm", "passage_text": "1 Eye Complications – People with diabetes have a higher risk of blindness and other vision problems. 2  Kidney Disease – Diabetes can damage the kidneys and may lead to kidney failure. 3  Nerve Damage (neuropathy) – Diabetes can cause damage to the nerves that run through the body. 1 Foot Problems – Nerve damage, infections of the feet, and problems with blood flow to the feet can be caused by diabetes. 2  Skin Complications – Diabetes can cause skin problems, such as infections, sores, and itching. 3  Skin problems are sometimes a first sign that someone has diabetes."}, {"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/basics/causes/CON-20033091", "passage_text": "In prediabetes — which can lead to type 2 diabetes — and in type 2 diabetes, your cells become resistant to the action of insulin, and your pancreas is unable to make enough insulin to overcome this resistance. Instead of moving into your cells where it's needed for energy, sugar builds up in your bloodstream. The exact cause of type 1 diabetes is unknown. What is known is that your immune system — which normally fights harmful bacteria or viruses — attacks and destroys your insulin-producing cells in the pancreas. This leaves you with little or no insulin."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/obe/risks", "passage_text": "Type 2 Diabetes. Diabetes is a disease in which the body's blood glucose, or blood sugar, level is too high. Normally, the body breaks down food into glucose and then carries it to cells throughout the body. The cells use a hormone called insulin to turn the glucose into energy. Over time, however, the body can't make enough insulin to control its blood sugar level. Diabetes is a leading cause of early death, CHD, stroke, kidney disease, and blindness. Most people who have type 2 diabetes are overweight."}, {"url": "http://www.prokerala.com/health/diseases/diabetes-induced-diseases.php", "passage_text": "Eye disease caused by diabetes. With increased blood sugar level gradually the eyes get damaged. The most common eye disease caused due to diabetes is ' diabetic retinopathy '. Retinopathy is considered an eye disease that causes decreased vision which gradually turns blurry and finally leads to blindness. Most diabetic patients are prone to heart diseases and stroke. Excess of sugar in the blood affects various body parts including the blood vessels such as the arteries, capillaries and veins. Heart diseases result in the narrowing of the blood vessels that supply blood to the heart, brain or hands and legs."}, {"url": "https://en.wikipedia.org/wiki/Diabetes_mellitus", "passage_text": "1 Type 2 DM begins with insulin resistance, a condition in which cells fail to respond to insulin properly. 2  As the disease progresses a lack of insulin may also develop. 3  This form was previously referred to as non insulin-dependent diabetes mellitus (NIDDM) or adult-onset diabetes. 1 This form was previously referred to as insulin-dependent diabetes mellitus (IDDM) or juvenile diabetes. 2  The cause is unknown. 3  Type 2 DM begins with insulin resistance, a condition in which cells fail to respond to insulin properly. 4"}, {"url": "https://www.health.ny.gov/diseases/conditions/diabetes/problems_caused_by_diabetes.htm", "passage_text": "1 Kidney Disease – Diabetes can damage the kidneys and may lead to kidney failure. 2  Nerve Damage (neuropathy) – Diabetes can cause damage to the nerves that run through the body. 3  Foot Problems – Nerve damage, infections of the feet, and problems with blood flow to the feet can be caused by diabetes. 1 Foot Problems – Nerve damage, infections of the feet, and problems with blood flow to the feet can be caused by diabetes. 2  Skin Complications – Diabetes can cause skin problems, such as infections, sores, and itching. 3  Skin problems are sometimes a first sign that someone has diabetes."}, {"url": "https://www.health.ny.gov/diseases/conditions/diabetes/problems_caused_by_diabetes.htm", "passage_text": "Complications of diabetes include: 1  Heart Disease – People with diabetes have a higher risk for heart attack and stroke. 2  Eye Complications – People with diabetes have a higher risk of blindness and other vision problems. 3  Kidney Disease – Diabetes can damage the kidneys and may lead to kidney failure. 1 Foot Problems – Nerve damage, infections of the feet, and problems with blood flow to the feet can be caused by diabetes. 2  Skin Complications – Diabetes can cause skin problems, such as infections, sores, and itching. 3  Skin problems are sometimes a first sign that someone has diabetes."}, {"url": "https://en.wikipedia.org/wiki/Diabetes_mellitus", "passage_text": "Any disease that causes extensive damage to the pancreas may lead to diabetes (for example, chronic pancreatitis and cystic fibrosis). Diseases associated with excessive secretion of insulin-antagonistic hormones can cause diabetes (which is typically resolved once the hormone excess is removed). 1 This form was previously referred to as insulin-dependent diabetes mellitus (IDDM) or juvenile diabetes. 2  The cause is unknown. 3  Type 2 DM begins with insulin resistance, a condition in which cells fail to respond to insulin properly. 4  As the disease progresses a lack of insulin may also develop."}, {"url": "https://en.wikipedia.org/wiki/Diabetes_mellitus", "passage_text": "Diabetes mellitus (DM), commonly referred to as diabetes, is a group of metabolic diseases in which there are high blood sugar levels over a prolonged period. Symptoms of high blood sugar include frequent urination, increased thirst, and increased hunger. If left untreated, diabetes can cause many complications. 1 This form was previously referred to as insulin-dependent diabetes mellitus (IDDM) or juvenile diabetes. 2  The cause is unknown. 3  Type 2 DM begins with insulin resistance, a condition in which cells fail to respond to insulin properly. 4  As the disease progresses a lack of insulin may also develop."}]