[{"url": "http://www.thefreedictionary.com/deuterium", "passage_text": "deu·te·ri·um. An isotope of hydrogen whose nucleus has one proton and one neutron and whose atomic mass is 2. Deuterium is used widely as a tracer for analyzing chemical reactions, and it combines with oxygen to form heavy water. Also called heavy hydrogen. See more at hydrogen. See Note at heavy water. "}, {"url": "http://chemistry.about.com/od/hydrogen/a/Deuterium-Facts.htm", "passage_text": "Hydrogen is unique in that it has three isotopes which are named. Deuterium is one of the isotopes of hydrogen. It has one proton and one neutron. The most common isotope of hydrogen is protium, which has one proton and no neutrons. Because deuterium contains a neutron, it is more massive or heavier than protium, so it is sometimes called heavy hydrogen. By Anne Marie Helmenstine, Ph.D. 1 Deuterium is a stable isotope of hydrogen. 2  The natural abundance of deuterium in the ocean is approximately 156.25 ppm, which is one atom in 6,400 of hydrogen. 3  The name for deuterium comes from the Greek word deuteros, which means second."}, {"url": "http://medical-dictionary.thefreedictionary.com/deuterium", "passage_text": "deuterium. the mass 2 isotope of hydrogen; it is available as a gas or heavy water and has been used as a tracer or indicator in metabolic studies. Deuterium oxide, or heavy water, is formed from an isotope of hydrogen, which has twice the weight of ordinary hydrogen (hence the name). the mass 2 isotope of hydrogen, symbol 2 H or D; it is available as a gas or heavy water and is used as a tracer or indicator in studying metabolism."}, {"url": "http://physics.tutorvista.com/modern-physics/deuterium.html", "passage_text": "Deuterium is a isotope of hydrogen which varies from hydrogen by one neutron normally hydrogen has only one proton, where as deuterium has one proton and one neutron. It has wide applications in fission reactors. The chemical symbol of deuterium is 2H and is denoted by  D . These are hydrogen with zero neutrons, deuterium contains one neutron, and tritium contains two neutrons. Here we are discussing about the isotope of hydrogen that is deuterium which is known as heavy hydrogen. How this isotope is useful, what is its mass and other properties, let’s discuss about that."}, {"url": "http://www.merriam-webster.com/dictionary/deuterium", "passage_text": "Medical Definition of DEUTERIUM. : an isotope of hydrogen that has one proton and one neutron in its nucleus and that has twice the mass of ordinary hydrogen—called also heavy hydrogen. : an isotope of hydrogen that has one proton and one neutron in its nucleus and that has twice the mass of ordinary hydrogen —symbol D —called also heavy hydrogen. See deuterium defined for kids. ADVERTISEMENT."}, {"url": "https://en.wikipedia.org/wiki/Heavy_water", "passage_text": "Heavy water (deuterium oxide (2H 2O) or D 2O) is a form of water that contains a larger than normal amount of the hydrogen isotope deuterium (2H or D, also known as heavy hydrogen), rather than the common hydrogen-1 isotope (1H or H, also called protium) that makes up most of the hydrogen in regular water. "}, {"url": "http://www.merriam-webster.com/dictionary/deuterium", "passage_text": "Definition of DEUTERIUM. : an isotope of hydrogen that has one proton and one neutron in its nucleus and that has twice the mass of ordinary hydrogen —symbol D —called also heavy hydrogen. See deuterium defined for kids. ADVERTISEMENT."}, {"url": "https://en.wikipedia.org/wiki/Deuterium", "passage_text": "Deuterium (symbol D or 2H, also known as heavy hydrogen) is one of two stable isotopes of hydrogen. The nucleus of deuterium, called a deuteron, contains one proton and one neutron, whereas the far more common hydrogen isotope, protium, has no neutron in the nucleus. Deuterium has a natural abundance in Earth's oceans of about one atom in 7003642000000000000♠6420 of hydrogen. This is a nucleus with one proton and one neutron, i.e. a deuterium nucleus. The triplet is. and thus consists of three types of nuclei, which are supposed to be symmetric: a deuterium nucleus (actually a highly excited state of it), a nucleus with two protons, and a nucleus with two neutrons."}, {"url": "http://gravity.wikia.com/wiki/Deuterium", "passage_text": "The nucleus of deuterium, called a deuteron, contains one proton and one neutron, whereas the far more common hydrogen nucleus contains no neutrons. The isotope name is formed from the Greek deuteros meaning second, to denote the two particles composing the nucleus. "}, {"url": "http://www.dancingwithwater.com/deuterium-depleted-water-what-is-it/", "passage_text": "Deuterium is an isotope of hydrogen that contains a proton and a neutron in the nucleus of the atom. The extra neutron doubles the mass of the hydrogen atom. It is well-known that due to its mass difference, deuterium (D) behaves differently from hydrogen in chemical reactions (called the isotope effect). "}]