[{"url": "http://www.wikihow.com/Use-a-Heating-Pad-During-Pregnancy", "passage_text": "Use the heating pad while awake. Make sure you only use the heating pad while you are awake. If you use it while sleeping, this can cause serious problems. You could accidentally leave it on and burn your skin or heat your body temperature too high. 1  Make sure you turn it off before you get into bed and don't use it in bed at all. 7. Wrap the heating pad in a towel or blanket. To subdue the effects of a heating pad, you can cover it with another piece of cloth, such as a towel or blanket. Wrapping a heating pad in another layer of clothing, such as a sweatshirt that no longer fits, makes it safer to use a heating pad on your muscles."}, {"url": "http://www.fda.gov/MedicalDevices/Safety/AlertsandNotices/PatientAlerts/ucm069997.htm", "passage_text": "1 Place heating pad on top of, and not underneath of, the body part in need of heat. ( 2 The temperature of a heating pad increases if heat is trapped.). 3  Unplug heating pad when not in use. 4  Read and follow all manufacturers’ instructions on heating pad or on outside package prior to use. 1 Sit on or against a heating pad. 2  Crush or fold a heating pad during use or during storage. 3  Unplug heating pad by pulling its connecting cord. 4  Use pins or other metallic fasteners to hold heating pad in place."}, {"url": "http://forums.psychcentral.com/chronic-pain-support/88002-dangers-heating-pads.html", "passage_text": "I know common sense tells you not to use a heating pad to the point that your back burns. I have burned my back to the point that I've burned myself under the skin. Please be careful with those heat pads!!! My back will never go back to regular skin again. I use a special heating pad that has a built in safety feature that turns the pad off in time before it can burn you. My favorite place to sit while using it on my back is in my recliner. I lean against it but it always turns off before it gets too hot although it does get nice and warm"}, {"url": "http://forums.psychcentral.com/chronic-pain-support/88002-dangers-heating-pads.html", "passage_text": "Re: Dangers of Heating Pads!!! I use a special heating pad that has a built in safety feature that turns the pad off in time before it can burn you. My favorite place to sit while using it on my back is in my recliner. I lean against it but it always turns off before it gets too hot although it does get nice and warm."}, {"url": "http://www.peoplespharmacy.com/2014/03/03/doctor-warns-dont-take-heating-pad-to-bed/", "passage_text": "As an safer alternative to an electric heating pad, I use a microwavable one. If you make certain that the temperature is safe before applying it to your skin, it can only cool off from that point on, but will produce a nice amount of heat, usually for less than 30 minutes. Dori March 4, 2014 at 11:12 am Reply. "}, {"url": "http://boards.straightdope.com/sdmb/showthread.php?t=449831", "passage_text": "A cat (or dog, or person) shouldn't lie down on a heating pad, as it can cause skin burns, because there's no guarantee he'll leave the several wrapped towels in place, and also because it can cause the heating pad to overheat. In my experience heating pads have disclaimers on the tags saying do not lie on this. "}, {"url": "http://www.fda.gov/MedicalDevices/Safety/AlertsandNotices/PatientAlerts/ucm069997.htm", "passage_text": "1 Keep removable cover on pad during use. 2  Place heating pad on top of, and not underneath of, the body part in need of heat. ( 3 The temperature of a heating pad increases if heat is trapped.). 4  Unplug heating pad when not in use. 1 Sit on or against a heating pad. 2  Crush or fold a heating pad during use or during storage. 3  Unplug heating pad by pulling its connecting cord. 4  Use pins or other metallic fasteners to hold heating pad in place."}, {"url": "http://www.wikihow.com/Use-a-Heating-Pad-During-Pregnancy", "passage_text": "Use the lower temperature settings. With excessive use or on high settings, heating pads can cause skin burns or increase your body temperature too much. Do not sleep while using a heating pad, and keep the pad on the lowest setting that gives you relief. 7. Wrap the heating pad in a towel or blanket. To subdue the effects of a heating pad, you can cover it with another piece of cloth, such as a towel or blanket. Wrapping a heating pad in another layer of clothing, such as a sweatshirt that no longer fits, makes it safer to use a heating pad on your muscles."}]