[{"url": "https://en.wikipedia.org/wiki/Psychological_repression", "passage_text": "From Wikipedia, the free encyclopedia. Psychological repression, or simply repression, is the psychological attempt made by an individual to repel one's own desires and impulses toward pleasurable instincts by excluding the desire from one's consciousness and holding or subduing it in the unconscious. Repression plays a major role in many mental illnesses, and in the psyche of the average person. Repression (German: Verdraengung), 'verdrängung a key concept of, psychoanalysis is a defense, mechanism but it-pre exists the, ego.e., 'G Primal'."}, {"url": "http://www.simplypsychology.org/Sigmund-Freud.html", "passage_text": "Sigmund Freud emphasized the importance of the unconscious mind, and a primary assumption of Freudian theory is that the unconscious mind governs behavior to a greater degree than people suspect. Indeed, the goal of psychoanalysis is to make the unconscious conscious. "}, {"url": "http://www.simplypsychology.org/defense-mechanisms.html", "passage_text": "There is a perpetual battle between the wish (repressed into the id) and the defense mechanisms. We use defense mechanisms to protect ourselves from feelings of anxiety or guilt, which arise because we feel threatened, or because our id or superego becomes too demanding. With the ego, our unconscious will use one or more to protect us when we come up against a stressful situation in life. Ego-defense mechanisms are natural and normal. When they get out of proportion, neuroses develop, such as anxiety states, phobias, obsessions, or hysteria."}, {"url": "http://www.cla.purdue.edu/english/theory/psychoanalysis/freud3.html", "passage_text": "Freud terms this object-libido.. The libido can also get caught up in the ego, which leads to narcissism. A normal part of psychosexual development (see Module 1) is the overcoming of early childhood narcissism (the belief, for example, that everything revolves around one's own desires). The job of dream interpretation is to translate the manifest dream back into its constituent, if buried, dream-thoughts. The interpretation of symptomsfollows a similar path; the goal is to determine the repressed sexual desires or traumatic events that are causing the abnormal behavior to occur."}, {"url": "http://www.simplypsychology.org/defense-mechanisms.html", "passage_text": "Repression is an unconscious mechanism employed by the ego to keep disturbing or threatening thoughts from becoming conscious. Thoughts that are often repressed are those that would result in feelings of guilt from the superego. With the ego, our unconscious will use one or more to protect us when we come up against a stressful situation in life. Ego-defense mechanisms are natural and normal. When they get out of proportion, neuroses develop, such as anxiety states, phobias, obsessions, or hysteria."}, {"url": "http://skepdic.com/repressedmemory.html", "passage_text": "In Freud's theory of repression the mind automatically banishes traumatic events from memory to prevent overwhelming anxiety. Freud further theorized that repressed memories cause neurosis, which could be cured if the memories were made conscious. It is common to consciously repress unpleasant experiences. Many psychologists believe that unconscious repression of traumatic experiences such as sexual abuse or rape is a defense mechanism which backfires. The unpleasant experience is forgotten but not forgiven."}, {"url": "http://www2.ucsc.edu/dreams/Library/lecture_notes_freud.html", "passage_text": "In his final formulation, they are a disguised attempt at wish fulfillment. Freud's general theory begins with the concept of repression, a cognitive process through which we deny wishes, fears, and thoughts that are threatening to us(make us anxious). Repression creates an unconscious, an aspect of us that is outside of our waking awareness. "}, {"url": "http://www.cla.purdue.edu/english/theory/psychoanalysis/freud3.html", "passage_text": "(See the next module on neuroses.)In other words, for Freud repression is a normal part of human development; indeed, the analysis of dreams, literature, jokes, and Freudian slips illustrates the ways that our secret desires continue to find outlet in perfectly well-adjusted individuals. The job of dream interpretation is to translate the manifest dream back into its constituent, if buried, dream-thoughts. The interpretation of symptomsfollows a similar path; the goal is to determine the repressed sexual desires or traumatic events that are causing the abnormal behavior to occur."}, {"url": "http://www.guidetopsychology.com/repressn.htm", "passage_text": "Freud: The Beginning. Sigmund Freud more-or-less started the whole issue about repressed memories when his clinical case studies in the late nineteenth century inspired him to develop his psychological theories about the nature of unconscious mental processes. Note that this repression process is a completely automatic psychological defense against emotional trauma and does not involve conscious intent. In contrast, deliberately pushing something out of awareness because you want to avoid any responsibility for it is called suppression."}, {"url": "http://www.cla.purdue.edu/english/theory/psychoanalysis/freud3.html", "passage_text": "Freud calls this translation of latent dream-thoughts into the manifest dream the dream work.. The two main ways that repression re-works the primitive impulses of the latent dream-thoughts is by way of condensation (1) or displacement (2). The job of dream interpretation is to translate the manifest dream back into its constituent, if buried, dream-thoughts. The interpretation of symptomsfollows a similar path; the goal is to determine the repressed sexual desires or traumatic events that are causing the abnormal behavior to occur."}]