[{"url": "http://www.wizardrealm.com/norse/index.html", "passage_text": "What is Norse Religion? Norse Religion, or Heathenry, is the modern-day practice of the ancient tribal belief systems of the Northern European peoples; the Teutons (continental Germanic tribes) and the Norse (Scandinavian and Gothic tribes). Asatru, descended from the ancient Northern European religion. Members of Folkish Asatru claim that bloodline is the strongest determinant of whether or not a person may practice the Norse Heathen faith."}, {"url": "http://www.thortrains.com/UncleThors/What%20is%20Heathenism.pdf", "passage_text": "Ethnicity The Heathen religions are the ancient beliefs of the various Germanic people. These are the ancestors of the Scandinavian, German, Austrian, Dutch and English people. In fact, all of the old lore is translated from the ancient languages. Most of it comes from Nordic, German and Anglo-Saxon sources. Heathen ethics place heavy emphasis on common sense. Wisdom is expressed in terms of results. Self-control, the willingness to tend one's needs, and a feeling of concern for the well-being of one's fellows is central to Heathenism. Perhaps the best word for it is caring."}, {"url": "http://crusaderkings-two.wikia.com/wiki/Norse_Paganism", "passage_text": "Norse Paganism refers to the religious traditions of the Norsemen prior to the Christianization of Scandinavia, specifically during the Viking Age. Norse religion is a subset of Germanic paganism, which was practiced in the lands inhabited by the Germanic tribes across most of Northern and Central Europe. "}, {"url": "http://www.wizardrealm.com/norse/index.html", "passage_text": "There are several different modern practices of Heathenry. The main religious tradition is known as Asatru, meaning loyalty or troth to the Gods.. The main focus of Asatru has been to recapture and reconstruct the ancient tribal religion of the Norse through the recordings of the lore and the sagas. Asatru, descended from the ancient Northern European religion. Members of Folkish Asatru claim that bloodline is the strongest determinant of whether or not a person may practice the Norse Heathen faith."}, {"url": "https://en.wikipedia.org/wiki/Neopaganism_in_Scandinavia", "passage_text": "The term Vanatru vanatrú is coined Ásatrú, asatru ásatrú implying a focus On (the Wanes; or vanir a second tribe of Gods in) germanic paganism rather Than. The anses it can be considered a Branch Within. Norse heathenry vanatruars are predominantly devoted To the wane gods or are bound To a wane as their. patron deity Old Norse Forn Siðr or modern Scandinavian Forn Sed, meaning Old Custom , is used as a term for the restoration of pre-Christian Norse paganism and culture, mostly by groups in Scandinavia. Old Norse forn old is cognate to Sanskrit purana, English (be)fore and far."}, {"url": "https://en.wikipedia.org/wiki/Germanic_Neopaganism", "passage_text": "Heathenry's deities are adopted from the pre-Christian belief systems found in the various societies of Germanic Europe; they include divinities like Tyr, Odin, Thor, Frigg and Freyja from Scandinavian sources, Wōden, Thunor and Ēostre from Anglo-Saxon sources, and figures such as Nehalennia from continental sources. Another name for the faith is the Icelandic term Ásatrú, ásatrú which is more commonly rendered As asatru In North; america this term translates as allegiance to The – aesir the latter being a-sub set of deities In norse – mythology with practitioners being known As. asatruer"}, {"url": "http://crusaderkings-two.wikia.com/wiki/Paganism", "passage_text": "Norse heathenry is the last surviving branch of the ancient Germanic belief system. A pantheon of gods under the wise warrior god Odin [strike]rules all the branches of the worldtree, Yggdrasil. The other two main gods are Thor, friend to mankind, and Frey, god of fertility[/strike]. Defining features in-game: Baltic paganism is polytheistic, with a pantheon of gods led by Dievs, god of the sky. Other main gods include Perkunas, god of thunder and lightning, very similar to the Germanic god Thor and the Slavic Perun. Other important deities include Saule, goddess of the sun and fertility, Daugava and Meness."}, {"url": "http://www.thortrains.com/UncleThors/What%20is%20Heathenism.pdf", "passage_text": "It saw the resurgence of the pre-Christian religions of Europe and the Middle East. Modern Paganism includes the revived Mystery Schools of the Hellenic world, the Celtic religions of ancient Europe, Ireland and Scotland, and the European religion known as Wicca. Heathen ethics place heavy emphasis on common sense. Wisdom is expressed in terms of results. Self-control, the willingness to tend one's needs, and a feeling of concern for the well-being of one's fellows is central to Heathenism. Perhaps the best word for it is caring."}, {"url": "http://www.ucs.mun.ca/~jporter/Heathenism%20Lecture%20Notes.pdf", "passage_text": "Introduction to Heathenism (Germanic Neo-Paganism)The Neo-pagan movement includes many different groups. Witchcraft, or Wicca, asmentioned earlier, is probably the most common and the most eclectic of these groups, drawingas it does upon most of the world's indigenous religions. "}, {"url": "http://www.thortrains.com/UncleThors/What%20is%20Heathenism.pdf", "passage_text": "Though Heathenism is indeed a Pagan religion, it is distinct as a unique entity under the larger Pagan umbrella. There have been several names coined for various Heathen groups: Hedenskap, Asatru, Odinism, Thorism, Theod, Troth, Der Urglaawe, etc. Most of these terms relate to specific branches of Heathenism. Heathen ethics place heavy emphasis on common sense. Wisdom is expressed in terms of results. Self-control, the willingness to tend one's needs, and a feeling of concern for the well-being of one's fellows is central to Heathenism. Perhaps the best word for it is caring."}]