[{"url": "http://www.dogbreedinfo.com/articles/caninebloat.htm", "passage_text": "1 You should wait one hour before feeding after exercise and one hour after eating before you let your dog run around. 2  Dry food given that is high in grain, which causes fermentation during digestion which causes gas. 3  Dry food should have meat, meat meal and bone meal listed within the first few ingredients, not grain. 1 Large meals eaten at one time. 2  They recommend serving your dog two smaller meals a day, rather than just one big one. 3  Rigorous exercise done either right before a meal or right after one. 4 "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20110511050217AAUwvta", "passage_text": "For the deep chested breeds that can be prone to Bloat, 2 hours before or two hours after, but I prefer after. I do not consider going for a walk heavy exercise. A dog has to walk no matter where it's going. (My breed is a Dobe, and I've had many of all different ages. This usually doesn't affect young puppies. · just now. Report Abuse. both humans and dogs should eat after exercise and not before ... i feed my dog after exercise always and she is a jack russell terrier, 12 years old ..."}, {"url": "https://answers.yahoo.com/question/index?qid=20070711055454AAOR87V", "passage_text": "If you do feed her first, you should wait an hour after she eats her normal meal before doing any strenuous excercise with her. As for the weight loss question, you should do both excercise her more, and buy the dog food. P.S. Chocolate labs are the prettiest color of the labs in my opinion. "}, {"url": "http://dogcare.dailypuppy.com/better-feed-dog-before-after-exercise-7322.html", "passage_text": "Feeding your pet after exercise is preferable to doing so beforehand, according to Penny Taylor, author of Running Dogs Maintenance, but you don't want to feed him immediately after he's exercised. Avoid feeding your pet while he's warm and panting from his workout. If you refrain from feeding your pooch for a minimum of 1 hour after exercise, you can stop him from experiencing potential issues with digestion. After feeding, you should wait no less than four hours before starting exercise. "}, {"url": "http://www.petmd.com/dog/wellness/evr_dg_post-workout_cooldown_for_your_dog", "passage_text": "Forgo the Food till Later. You should not exercise your dog right after a meal, as this can lead to digestive upset or bloat. Keep in mind that your dog will no doubt be very hungry after a long workout. Body Check. If you have the fortune of having a place to exercise in the great outdoors, away from the urban sprawl, you will need to be especially vigilant about checking your dog for ticks and other small hazards after every outing."}, {"url": "http://forum.greytalk.com/index.php/topic/229766-walking-eating-and-bloat/", "passage_text": "You can take your dog for a potty walk or gentle stroll before/after eating. A power walk counts as strenuous exercise. You can take your dog for strenuous exercise 2 hours after eating. My rule for feeding after exercise is to wait until the dog is recovered -- no longer panting, etc. Really strenuous exercise like a hard run, the 2-hour rule is a good one."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20110511050217AAUwvta", "passage_text": "I also would wait at least 20 minutes after rigorous exercise to feed my dog as if the dog is panting really hard you don't want them to get sick from eating to soon. Wolf Howl · 4 years ago. · just now. Report Abuse. both humans and dogs should eat after exercise and not before ... i feed my dog after exercise always and she is a jack russell terrier, 12 years old ..."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20130523013119AAcPOhi", "passage_text": "Best Answer: My dog trainer advised me to wait after 30 minutes to feed your dog, You have to wait 30 mins before feeding your dog if hes been out for a walk You also have to wait 30 mins after feeding your dog before taking it out for a walk. Source(s): My Dog Trainer :). Anonymous · 2 years ago. Thumbs up. The biggest risk for things like bloat is feeding before exercise, I always wait a minimum of 1 hour after feeding before exercise. After exercise, I will feed him anything from 10 - 30 mins (depending on how vigorous the exercise was!) and never had an issue :). Sarah · 2 years ago."}]