[{"url": "http://www.moosemanorfarms.com/about-muscovy-ducks.html", "passage_text": "Muscovy will lay up to 180 eggs a year and hatch about four sets of ducklings if they get lots of high protein feed. Muscovy ducks are great mothers and do a good job raising their young. Muscovy take longer to hatch than other poultry... an egg takes 33 to 35 days to hatch. A chicken, for example, hatches in 21 days. Muscovy meat is one of the healthiest meats on the market today, being 98% or greater fat free. Since Muscovy are genetically disimilar to other domestic waterfowl, many folks believe that they're more of a goose than a duck. For instance, they eat grass, as do geese, have a similarly long egg incubation period of 35 days (compared with 28 days for ducks), and they don't quack."}, {"url": "http://modernfarmer.com/2015/06/everything-you-need-to-know-about-duck-eggs/", "passage_text": "Are They Expensive? Duck eggs are quite a bit more than chicken eggs, but still not prohibitively expensive. Whereas the average price for a dozen chicken eggs is somewhere just north of $2 in the U.S., duck eggs will usually run you anywhere from $6 to $12 a dozen. Are they attractive? Duck eggs are typically larger than chicken eggs; they vary a bit in size but are usually around 50 percent larger than your standard jumbo chicken egg. They can come in all sorts of colors, varying mostly by breed."}, {"url": "https://en.wikipedia.org/wiki/American_Pekin_duck", "passage_text": "Pekin duck in Park Anava, Israel. Pekin duck embryos take around 28 days to develop in the egg at 99.5° F (37.5° C) and 50-75% humidity. A heartbeat can usually be seen by the third day of incubation when candling the egg. The eggs must be regularly turned during incubation"}, {"url": "http://paleoleap.com/eat-duck-eggs/", "passage_text": "Because they’re larger than chicken eggs, duck eggs are likely to be more expensive per egg. But you’ll probably also need fewer duck eggs to make a meal, because they’re fattier and more filling. All in all, it usually works out to roughly the same price per egg-based meal, or even a little bit less. The best place to get duck eggs is from a farmers’ market. A lot of smaller poultry farms like ducks for various reasons (they’re hardier than chickens, they eat unwelcome insects and help with pest control, and their manure is more useful for the rest of the farm)."}, {"url": "http://www.duckhealth.com/hatcduck.html", "passage_text": "Pekin duck eggs are kept in a setter for 25 days and then transferred on the 25th day to a hatcher where they remain until they hatch on the 28th day. Eggs are automatically turned while in the setter (usually hourly). It is not necessary to turn eggs in the hatcher. "}, {"url": "http://www.howmuchisit.org/how-much-do-duck-eggs-cost/", "passage_text": "1 Fresh duck eggs keep for approximately 2 weeks if kept cool and around 6 weeks once refrigerated. 2  When ordering duck eggs for hatching, make sure to ask if the supplier provides a care guide along with the shipment. 3  This guide will take individuals through the essentials of caring for ducks. "}, {"url": "http://www.wikihow.com/Hatch-a-Mallard-Duck-Egg", "passage_text": "How to Hatch a Mallard Duck Egg. Mallard ducks are amazing animals. And sometimes you want to help them hatch. It's important to not remove wild ducks eggs from any nest without the proper cause; however, if the mother is confirmed missing for over a period of 48 hours, you may be able to help. Ad. 1 Call your local office, and ask them if you can raise these wild ducks from eggs, in an incubator you bought, and release them in exactly 60-90 days, which is their fledging time (how long it takes to fly) to a nearby lake in your town. 2  Notify them that the mother duck has been missing for 48 hours."}, {"url": "http://www.countryfarm-lifestyles.com/raising-ducks.html", "passage_text": "If you do keep ducks for meat, make sure that you like duck! Even 1 duck can hatch 25 - 30 ducklings in a season, as they hatch ducklings twice a year. If it is your aim to raise ducks for meat then you will be provided with tasty duck meat from spring until late fall. "}]