[{"url": "http://www.mamapedia.com/article/filling-with-no-laughing-gas", "passage_text": "My grandchildren see a pediatric dentist who does use laughing gas. I would see if I could find one in your area. It really makes a difference in terms of comfort. My grandchildren actually ask when they're going to see the dentist again. My dentist doesn't do laughing gas, and both of my boys have had fillings. There were never any tears. In fact my older son didn't even have freezing for one of his fillings because it wasn't very deep. I never had laughing gas (as a child or an adult) either and I never cried during a filling"}, {"url": "http://www.mouthhealthy.org/en/az-topics/n/nitrous-oxide/", "passage_text": "Nitrous oxide is a safe and effective sedative agent that is mixed with oxygen and inhaled through a small mask that fits over your nose to help you relax. Nitrous oxide, sometimes called “laughing gas,” is one option your dentist may offer to help make you more comfortable during certain procedures. It is not intended to put you to sleep. You will be able to hear and respond to any requests or directions the dentist may have"}, {"url": "http://southsounddentalcare.com/sedation-dentistry/", "passage_text": "Nitrous oxide, often referred to as “laughing gas, “ is often used as a conscious sedative during a dental visit. The gas is administered with a mixture of oxygen and has a calming effect that helps phobic or anxious patients relax during their treatment. Sedation is often used for fillings, crowns, bridges, root canals, extractions, cosmetic procedures, and periodontal treatments. The American Dental Association endorses the use of sedation and it’s a very effective way to make patients comfortable during their"}, {"url": "http://southsounddentalcare.com/sedation-dentistry/", "passage_text": "Sedation Dentistry. Sedation is commonly used for extensive dental procedures for patients with dental phobia or for patients who find it difficult to sit still. There are different types of sedation including nitrous oxide (laughing gas), IV sedation, oral sedatives, and general anesthetic. Sedation is often used for fillings, crowns, bridges, root canals, extractions, cosmetic procedures, and periodontal treatments. The American Dental Association endorses the use of sedation and it’s a very effective way to make patients comfortable during their dental visit."}, {"url": "http://www.1800dentist.com/laughing-gas/", "passage_text": "Nitrous oxide laughing gas is a smart and widely used option for many smaller procedures such as the placement of a dental crown or the removal of wisdom teeth. In fact, the sedative effects of laughing gas wear off so quickly after discontinuation that you can drive home directly following its use. And, unlike most other forms of sedation dentistry, you can eat within 12 hours of the procedure."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20131124155907AAM4BBU", "passage_text": "I used to have panic attacks at the dentist so went for laughing gas . You will be laid down and a nose piece put over your nose then you will be told to breathe normally then after a while you will feel drowsy / drunk. "}, {"url": "http://www.webmd.com/oral-health/controlling-dental-pain", "passage_text": "1 Nitrous oxide (also called laughing gas). 2  This gas, which is inhaled by the patient through a rubber face mask, helps people feel relaxed and is one of the most common forms of sedation used in the dental office. 3  Effects wear off quickly after the gas is turned off. 1 The patient is able to drive and resume normal activities immediately following the dental visit. 2  Nitrous oxide (also called laughing gas). 3"}, {"url": "https://en.wikipedia.org/wiki/Nitrous_oxide", "passage_text": "Nitrous oxide, commonly known as laughing gas, nitrous, nitro, or NOS is a chemical compound with the formula N 2O. It is an oxide of nitrogen. At room temperature, it is a colourless, non-flammable gas, with a slightly sweet odour and taste. It is used in surgery and dentistry for its anaesthetic and analgesic effects. "}, {"url": "http://www.mamapedia.com/article/filling-with-no-laughing-gas", "passage_text": "I have never had laughing gas and had a few cavities filled as a child, I have ever had issues with going to the dentist. My daughter had 3 small cavities when she was 4 or 5 (none since, thankfully, and she is 8 now). Our dentist did not use gas, just novocaine. My dentist doesn't do laughing gas, and both of my boys have had fillings. There were never any tears. In fact my older son didn't even have freezing for one of his fillings because it wasn't very deep. I never had laughing gas (as a child or an adult) either and I never cried during a filling"}]