[{"url": "https://www.sharecare.com/health/endocrine-system/what-is-function-cortisol-hormone", "passage_text": "Cortisol is a steriod hormone produced by the adrenal gland. The hormone is released in response to stress and low levels of blood sugar and its primary function is to increase blood sugar levels, suppress the immune system and aid in metabolism."}, {"url": "https://www.sharecare.com/health/endocrine-system/what-is-function-cortisol-hormone", "passage_text": "The amount of cortisol produced by the adrenals is precisely balanced. Like many other hormones, cortisol is regulated by the brain's hypothalamus and the pituitary gland. First, the hypothalamus releases a trigger hormone called corticotropin-releasing hormone (CRH) that signals"}, {"url": "https://www.psychologytoday.com/basics/stress", "passage_text": "Stress. Stress is simply a reaction to a stimulus that disturbs our physical or mental equilibrium. In other words, it's an omnipresent part of life. A stressful event can trigger the “fight-or-flight” response, causing hormones such as adrenaline and cortisol to surge through the body. A little bit of stress, known as “acute stress,” can be exciting—it keeps us active and alert."}, {"url": "http://www.thefreedictionary.com/Corticosteroids", "passage_text": "1. Cortisone and other hormones produced in the cortex of each adrenal gland. Corticosteroids help to control the balance of salts and sugars in the body. 2. Natural or synthetic hormones that assist metabolism, act in relation to stress, or maintain the salt-andwater balance"}, {"url": "http://www.simplypsychology.org/stress-biology.html", "passage_text": "The hypothalamus in the brain is in charge of the stress response. When a stress response is triggered, it sends signals to two other structures: the pituitary gland, and the adrenal medulla. These short term responses are produced by The Fight or Flight Response via the Sympathomedullary Pathway (SAM)."}, {"url": "http://psychology.wikia.com/wiki/Cortisol_and_stress", "passage_text": "Cortisol is a corticosteroid hormone produced by the zona fasciculata of the adrenal cortex (in the adrenal gland). It is a vital hormone that is often referred to as the stress hormone as it is involved in the response to physical and psychological stress."}, {"url": "https://www.sharecare.com/health/endocrine-system/what-is-function-cortisol-hormone", "passage_text": "Cortisol is produced by the adrenal glands in response to signals from the pituitary gland and hypothalamus of the brain. The secretion of cortisol increases in response to psychological or physical stress of any kind."}]