[{"url": "http://www.health.state.mn.us/divs/eh/food/fs/tempreq.html", "passage_text": "1 Food made in a food processing plant, opened in the food establishment, and reheated for hot holding must reach a temperature of 140°F. 2  Reheat foods rapidly, within two hours. Microwave cooking and reheating. If cooking or reheating foods in a microwave, heat all parts of the food to 165°F. Cover and rotate or stir the food during the process. Afterwards, allow the covered food to stand for two minutes before serving."}, {"url": "http://www.answers.com/Q/At_which_temperature_should_you_reheat_food", "passage_text": "Food should be reheated until it is piping hot and simmering. It should be re heated to this temperature as it kills any breeding bacteria so your food will not give you food … poisoning .If storing meat then reheating make sure it is stored in a cool place until you wish to use it. 2 people found this useful. Answered. The 400 - 500 F range for 3-10 minutes works for most food. Frie … d foods should be near the upper end; moist foods and things that can brown (like pizza or macaroni and cheese) toward the lower end of the range."}, {"url": "http://www.foodstandards.gov.au/consumer/safety/faqsafety/documents/Cool%20_and_reheat_food.pdf", "passage_text": "Reheat food rapidly. The recommended maximum time to reheat food is 2 hours. The Food Safety Standards require you to reheat potentially hazardous food that you are going to hold hot e.g. in a bain-marie, rapidly to 60ºC or hotter and display or store it at that temperature or hotter. "}, {"url": "http://www.cfs.gov.hk/english/programme/programme_haccp/programme_haccp_tips05.html", "passage_text": "Cooking and reheating are the most effective ways to eliminate bacterial hazards in food. Most foodborne bacteria and viruses can be killed when food is cooked or reheated long enough at sufficient high temperature. The core temperature of food should reach at least 75℃. 1 The thermometer should be properly cleaned and disinfected both before and after use. 2  If it is not available, the food should be reheated until boiling before consumption. 3  For hot-holding, the thoroughly cooked or reheated food should be kept at above 60 °C to avoid bacterial growth."}, {"url": "http://www.answers.com/Q/What_temperature_should_previously_reheated_foods_and_leftover_foods_be_reheated_to", "passage_text": "It depends on what the ingredients are. Chicken should be  reheated to 180 degrees. Turkey should b … e heated to a temperature  of 185 to 190 degrees. Beef that has been precooked can be eaten  cold if it was refrigerated after cooking as is with chicken and  turkey. Pork should be heated to 180 degrees. The 400 - 500 F range for 3-10 minutes works for most food. Frie … d foods should be near the upper end; moist foods and things that can brown (like pizza or macaroni and cheese) toward the lower end of the range."}, {"url": "http://www.health.ny.gov/environmental/indoors/food_safety/coolheat.htm", "passage_text": "Bacteria that cause food poisoning grow at temperatures between 45 degrees Fahrenheit and 120 degrees Fahrenheit. The cooling requirement limits the length of time that potentially hazardous food is in the temperature range at which harmful bacteria can grow. Foods particularly important to meet the cooling requirement include soups, sauces, gravies, stews, rice, chili, whole turkeys, turkey breasts and whole roast beef. "}, {"url": "http://www.answers.com/Q/At_which_temperature_should_you_reheat_food", "passage_text": "It depends on what the ingredients are. Chicken should be  reheated to 180 degrees. Turkey should b … e heated to a temperature  of 185 to 190 degrees. Beef that has been precooked can be eaten  cold if it was refrigerated after cooking as is with chicken and  turkey. The 400 - 500 F range for 3-10 minutes works for most food. Frie … d foods should be near the upper end; moist foods and things that can brown (like pizza or macaroni and cheese) toward the lower end of the range."}, {"url": "http://www.health.state.mn.us/divs/eh/food/fs/tempreq.html", "passage_text": "1 Food made in-house and reheated for hot holding must reach an internal temperature of at least 165°F for 15 seconds. 2  Food made in a food processing plant, opened in the food establishment, and reheated for hot holding must reach a temperature of 140°F. 3  Reheat foods rapidly, within two hours. Microwave cooking and reheating. If cooking or reheating foods in a microwave, heat all parts of the food to 165°F. Cover and rotate or stir the food during the process. Afterwards, allow the covered food to stand for two minutes before serving."}]