[{"url": "http://www.familyhandyman.com/drywall/cutting-drywall/how-to-cut-drywall-for-an-opening/view-all", "passage_text": "Then cut the hole with a drywall saw (Photo 3). It's best to slightly angle the saw so the opening in the back is larger than in the front. That way the box will slip into the opening easier. If you cut along the outside of the lines, the box should fit. But don't assume the holes will slip perfectly over the boxes. This article will show you how to cut clean, accurate holes in drywall for electrical boxes and lights. And without making a mess. Follow this advice to cut perfect sized openings—not too big, not too small and without broken corners. But if you do happen to make a mistake, we'll show you how to fix it."}, {"url": "http://howtospecialist.com/structure/cutting-holes-in-drywall/", "passage_text": "First you need to measure the distance from the edges where you will hang the drywall board to the center of the hole. Next, use a T-square and mark the center of the hole on the drywall sheet. Cutting circular holes in drywall. Step 2: Connect the hole saw drill bit to a drill machinery with torque control. Next, place the tip of the frill exactly over the center of the hole and press the start button. As you can see in the image, the holes should be drilled in the interior of the rectangle, as close as possible to the cut lines. How to cut a square hole in drywall. Step 3: Use a jigsaw or a drywall saw to cut the patch in drywall, positioning the blade in the starting holes."}, {"url": "http://www.todayshomeowner.com/video/how-to-cut-a-hole-in-existing-drywall/", "passage_text": "Tweet. Reciprocating saws work great for cutting holes in existing drywall, but the long blade can also cut through any wires, pipes, and framing. To keep this from happening, cut the blade to length with tin snips so it barely protrudes through the wallboard. Watch this video to find out more. Please Leave a Commen"}, {"url": "http://www.ronhazelton.com/tips/how_to_cut_an_inspection_hole_in_a_wall", "passage_text": "To close up the hole, first apply joint compound to the sides of the opening and the edges of the piece you cut out. When the patch is pressed into place, excess joint compound will squeeze out on the back side of the wall. "}, {"url": "http://howtospecialist.com/structure/cutting-holes-in-drywall/", "passage_text": "Cutting holes in drywall. Guidance square. Step 1: Measure the location of the fixture and trace its contour on the drywall sheet. Therefore use a tape measure to determine the distance from the left edge where you will install the panel, to the left and right side of the fixture. As you can see in the image, the holes should be drilled in the interior of the rectangle, as close as possible to the cut lines. How to cut a square hole in drywall. Step 3: Use a jigsaw or a drywall saw to cut the patch in drywall, positioning the blade in the starting holes."}, {"url": "http://www.hgtv.com/design/decorating/design-101/how-to-repair-a-drywall-ceiling", "passage_text": "Use a utility knife to cut out a piece of drywall to fit the area you're replacing. 7. Replace any insulation you removed earlier, and fit the replacement piece into the hole in the ceiling. Secure the drywall to the ceiling joists using drywall screws. Apply a thin layer of joint compound over the joints and drywall screws, and apply a piece of drywall tape to the wet joint compound. Apply an additional layer of joint compound over the drywall tape and smooth it out with a drywall knife. 9. Sand the area smooth and apply additional coats as necessary."}, {"url": "http://howtospecialist.com/structure/cutting-holes-in-drywall/", "passage_text": "Smart tip: You can also cut holes directly into an existing drywall, but you have to pay attention to several aspects. Before making the cuts, you should make sure that there no pipes or wires inside the drywall. Smart tip: Don’t press too much the hole saw in the drywall sheet, as it might get stuck in the gypsum. As you can see in the image, the holes should be drilled in the interior of the rectangle, as close as possible to the cut lines. How to cut a square hole in drywall. Step 3: Use a jigsaw or a drywall saw to cut the patch in drywall, positioning the blade in the starting holes."}, {"url": "http://www.diynetwork.com/how-to/rooms-and-spaces/walls-and-ceilings/tips-and-tricks-for-accurately-cutting-drywall", "passage_text": "When you need to cut inside corners, cut one side with a drywall saw. Then score the other side of the drywall with a utility knife and snap it back as you would any other cut. Bend the back panel away from the score line to break it along the score. It is usually easier to snap the panel away from you. "}, {"url": "http://homeguides.sfgate.com/fill-hole-drywall-ceiling-82088.html", "passage_text": "1. Cut a rectangular patch from apiece of drywall that is large enough to cover the hole. Place it over the hole and trace its outline on the ceiling with a pencil. Cut out the outline with a drywall saw. 4. Place the drywall patch in the hole and screw it to the wood. Cover the edges of the patch with drywall mud, using a 4-inch knife, and lay paper drywall tape on the mud. Scrape the tape flat with the knife, then lay a second coat of mud and scrape that flat"}]