[{"url": "http://www.ehow.com/list_5877767_foods-trigger-vertigo.html", "passage_text": "Fatty Foods. Fried foods, (especially deep-fried foods), ice cream, cheese, shortening, milk, mayonnaise, eggs, butter, and meats should be avoided for a healthy diet to begin with, but especially if you suffer from vertigo, as they are high in fat. Fatty foods can trigger vertigo by temporarily raising your blood pressure. Vertigo symptoms include dizziness, a sensation of spinning, the perception that objects around you are spinning or moving, a feeling of being pulled to the floor or the other side of the room, a general imbalance, feeling lightheaded, nausea, ringing in the ears, hearing loss, and ear pressure."}, {"url": "http://www.healthguideinfo.com/digestive-conditions/p83794/", "passage_text": "Foremost among the foods that prevent vertigo are magnesium rich foods such as nuts, seeds, beans, leafy green vegetables, and milk of magnesia. Conversely, excessive consumption of foods such as yoghurt, rich in calcium contribute to depletion in the body’s magnesium levels and trigger vertigo. Salt. Salty foods such as pretzels, chips, salted nuts, deli meats, canned foods and soups, soy sauce, pastas, sauces, condiments, baking soda, baking powder, pizza, seasonings, pickles, frozen meals, cheese, and salad dressings, all have the potential to trigger vertigo. Sodium creates imbalance in body fluids."}, {"url": "http://www.wikihow.com/Stop-Getting-Vertigo", "passage_text": "Vertigo is the sensation that the world is spinning or moving even though you are stationary. The dizziness associated with vertigo leads to nausea, balance problems, comprehension issues, and other complications. Too much caffeine and salt can aggravate the symptoms of vertigo. Limit your alcohol consumption and avoid smoking. Drink lots of water and be sure to include food rich in vitamins and minerals in your diet."}, {"url": "http://www.livestrong.com/article/445902-foods-avoid-vertigo/", "passage_text": "The vestibular system in your brain your allows you to stand upright, move freely and maintain balance. Vertigo disrupts these functions, causing the sensation that you or your surroundings are spinning. Potential causes include migraines, injuries, inner-ear conditions and seizures. Because nuts and seeds provide heart-healthy fats, incorporate low-tyramine healthy fat sources, such as canola oil, olive oil, fresh salmon and avocados, into your diet instead. If you're not prone to migraines, avoid salted nuts, seeds and nut butters for improved fluid balance."}, {"url": "http://www.livestrong.com/article/445902-foods-avoid-vertigo/", "passage_text": "If you are prone to vertigo associated with migraines, avoid pepperoni, salami, liverwurst, smoked sausage and aged cheeses, such as Swiss, provolone, mozzarella, brie, cheddar, blue and Roquefort cheese. Migraine-friendly alternatives include fresh fish and meats, cottage, ricotta and American cheese. Because nuts and seeds provide heart-healthy fats, incorporate low-tyramine healthy fat sources, such as canola oil, olive oil, fresh salmon and avocados, into your diet instead. If you're not prone to migraines, avoid salted nuts, seeds and nut butters for improved fluid balance."}, {"url": "http://www.34-menopause-symptoms.com/dizziness/articles/can-certain-foods-prevent-dizziness.htm", "passage_text": "Staying hydrated is crucial in preventing dizziness. Many fresh fruits are not only full of water, but also vital nutrients. Bananas, grapes, peaches and apricots are high in potassium count and this makes them very suitable foods to eat as you look to avoid dizziness."}, {"url": "http://www.livestrong.com/article/174157-foods-eat-fight-dizziness/", "passage_text": "Causes may include brain disorders, fluid in the inner ear, motion sickness, diabetes medications, tumors, allergies and infections. According to the University of Maryland Medical Center (UMMC), certain foods may help prevent or reduce dizziness commonly associated with low blood sugar (hypoglycemia). Protein also helps stabilize blood sugar levels and may prevent or reduce dizziness caused by skipping meals, under-eating and hypoglycemia associated with diabetes. According to the UMMC, increased dietary protein, as part of an overall balanced, nutrient-rich diet, can reduce symptoms of hypoglycemia."}, {"url": "http://www.34-menopause-symptoms.com/dizziness/articles/can-certain-foods-prevent-dizziness.htm", "passage_text": "Fortunately, there are multiple ways to help manage dizziness; the most important is a balanced diet as certain foods can help restore hormone levels and prevent dizziness and other menopause symptoms. Key nutrients that can help dizziness include vitamin B, niacin, potassium, and iron. Many fresh fruits are not only full of water, but also vital nutrients. Bananas, grapes, peaches and apricots are high in potassium count and this makes them very suitable foods to eat as you look to avoid dizziness."}, {"url": "http://www.webmd.com/brain/tc/dizziness-lightheadedness-and-vertigo-prevention", "passage_text": "You may be able to prevent lightheadedness caused by orthostatic hypotension by taking your time. 1  Get up slowly from your bed or chair. 2  Sit on the edge of the bed for a few minutes before standing. 3  Sit up or stand up slowly to avoid sudden changes in blood flow to your head that can make you feel lightheaded. "}]