[{"url": "http://www.infoplease.com/encyclopedia/science/food-poisoning-bacterial-food-poisoning.html", "passage_text": "Bacterial Food Poisoning. In general, the bacteria that cause food poisoning do not affect the appearance, aroma, or flavor of food. The most common bacterial causes of food poisoning are Salmonella (see salmonellosis), staphylococcus, Escherichia coli, Listeria monocytogenes, Shigella, and Campylobacter jejuni. The symptoms may be caused by toxins produced by the bacteria. The most serious type of food poisoning caused by bacterial toxins is botulism, which results from toxins made by the bacterium Clostridium botulinum. New strains of bacteria of the genus Shigella have been associated with food poisoning from ground meat. Symptoms include watery diarrhea, abdominal cramps, and bloody mucus in the stools. Campylobacter enteritis is caused by either of two species of the Campylobacter bacterium."}, {"url": "https://en.wikipedia.org/wiki/Bacterial_food_poisoning", "passage_text": "Foodborne illness (also foodborne disease and colloquially referred to as food poisoning) is any illness resulting from the food spoilage of contaminated food, pathogenic bacteria, viruses, or parasites that contaminate food, as well as chemical or natural toxins such as poisonous mushrooms. "}, {"url": "http://www.nhs.uk/Conditions/Food-poisoning/Pages/Introduction.aspx", "passage_text": "It's not usually serious and most people get better within a few days without treatment. In most cases of food poisoning, the food is contaminated by bacteria, such as salmonella or Escherichia coli (E. coli), or a virus, such as the norovirus. "}, {"url": "https://simple.wikipedia.org/wiki/Food_poisoning", "passage_text": "Campylobacter, a bacteria that is a major cause of food poisoning. Symptoms start many hours to many days after eating. Depending on what the cause of the poisoning was, they can include one or more of the following: nausea, abdominal pain, vomiting, diarrhoea, gastroenteritis, fever, pain in the head or fatigue. "}, {"url": "http://www.accepta.com/environmental-water-wastewater-knowledge/pathogen-control-knowledge/297-food-poisoning-bacteria-salmonella-listeria-e-coli-0157-campylobacter", "passage_text": "When someone swallows bacteria that cause food poisoning, there is a delay (incubation period) before symptoms begin. This is because most bacteria that cause food poisoning need time to multiply in the intestine. The length of the incubation period depends on the type of bacteria and how many are swallowed. It could be hours or days. Salmonella is the second most common cause of food poisoning after campylobacter. It has been found in unpasteurised milk, eggs and raw egg products, meat and poultry. It can survive if food is not cooked properly. Salmonella can grow in food."}, {"url": "http://biology.about.com/od/bacteriology/a/aa072706a.htm", "passage_text": "Foodborne illness is caused by eating or drinking food that contains disease causing agents. The most common causes of foodborne diseases are bacteria, viruses, and parasites. Foods containing toxic chemicals can cause foodborne diseases as well. Typically, our immune system fights off germs to prevent illness. "}, {"url": "http://www.webmd.com/food-recipes/food-poisoning/food-poisoning", "passage_text": "Campylobacter is a bacterium that causes acute diarrhea. Transmission usually occurs through ingestion of contaminated food, water, or unpasteurized milk, or through contact with infected infants, pets, or wild animals. Symptoms of campylobacter include: 1  Diarrhea (sometimes bloody). 2  Nausea and vomiting. Depending on the type of infection, people can even die as a result of food poisoning. More than 250 different diseases can cause food poisoning. Some of the most common diseases are infections caused by bacteria, such as Campylobacter, Salmonella, Shigella, E. coli O157:H7, Listeria, botulism, and norovirus."}, {"url": "http://www.webmd.com/food-recipes/food-poisoning/food-poisoning", "passage_text": "Food poisoning is a common, yet distressing and sometimes life-threatening problem for millions of people in the U.S. and throughout the world. People infected with food-borne organisms may be symptom-free or may have symptoms ranging from mild intestinal discomfort to severe dehydration and bloody diarrhea. Depending on the type of infection, people can even die as a result of food poisoning. More than 250 different diseases can cause food poisoning. Some of the most common diseases are infections caused by bacteria, such as Campylobacter, Salmonella, Shigella, E. coli O157:H7, Listeria, botulism, and norovirus."}, {"url": "http://www.medic8.com/healthguide/food-poisoning/bacterial-food-poisoning.html", "passage_text": "This is one of the biggest – if not the biggest cause of food poisoning. It is used as an umbrella term to include a wide range of infections caused by various bacteria. These include salmonella, campylobacter and E coli. You can have two situations here: 1  Food is contaminated by bacteria which release toxins and cause food poisoning after consumption. 2  Toxins are produced by bacteria inside food whilst it is growing."}]