[{"url": "http://www.homedepot.com/p/Red-Devil-8-oz-Pre-Mixed-Vinyl-Spackling-0532HD/202261762", "passage_text": "Internet # 202261762. This 8 oz. Pre-Mixed Vinyl Spackling compound is specially formulated for an easy application. It dries fast and holds securely to withstand sanding and painting. It cleans up easily with water"}, {"url": "http://www.ehow.com/how_8624562_use-vinyl-spackling.html", "passage_text": "Spackling is useful in filling in holes and cracks in surfaces before repainting your home. Vinyl spackling contains elastic polymers that slightly flex with temperature changes. This type of spackling does not dry out and crack or crumble after several years as the original spackling does. Dip the tip of a putty knife into the spackling and place the knife just above the repair area. Wipe the putty knife down into the crack or hole while applying pressure to force the compound into the damaged area."}, {"url": "https://en.wikipedia.org/wiki/Spackling_paste", "passage_text": "Spackling paste is a putty used to fill holes, small cracks, and other minor surface defects in wood, drywall, and plaster. In the UK the generic name for this product is 'wall filler' with 'Polyfilla' being a popular brand name (the use of the prefix 'poly-' is intended to imply that it can be used on many different types of surface). It differs from spackle in being cellulose based."}, {"url": "http://www.wisegeek.org/what-is-spackling-compound.htm", "passage_text": "Spackling compound may be used to repair nail holes in walls. Spackling compound should be sanded after it dries. A man applies a coat of spackling compound to a wall. Spackling compound is often used to fill cracks or holes in drywall and plaster. Vinyl spackle is often used to cover imperfections in vinyl wall coverings. This step usually allows a homeowner to apply a second sheet of wallpaper or other wall covering directly on top of the original layer without having the time and cost associated with removal of the original."}, {"url": "http://www.wisegeek.org/what-is-spackling-compound.htm", "passage_text": "Adorable animal families that will make you aww. Spackling compound is a material that typically is used for filling in cracks and imperfections on surfaces prior to painting or wallpapering. Gypsum plaster that is made of hydrated calcium sulfate and glue are its main components. Vinyl spackle is often used to cover imperfections in vinyl wall coverings. This step usually allows a homeowner to apply a second sheet of wallpaper or other wall covering directly on top of the original layer without having the time and cost associated with removal of the original."}, {"url": "http://homeguides.sfgate.com/difference-between-drywall-mud-interior-spackling-paste-91786.html", "passage_text": "Types of Spackling Paste. The most lightweight spackling compound, which is made from vinyl, has virtually no mass and dries almost instantaneously. It's the easiest product to use when filling holes in drywall left by nails and pins, but it doesn't have enough bulk for holes larger than about 1/4 inch in diameter. "}, {"url": "http://www2.ljworld.com/news/2013/jul/29/fix-it-chick-pick-out-right-spackle-job/", "passage_text": "Skip sanding by smoothing the finish with a putty knife dipped in water. Lightweight spackling dries hard, but will crumble if bumped, so it is best used for small repairs. Step 3: Use vinyl spackling for holes and cracks that are up to 3/4 inch deep. Layer the spackling into the area 1/4 inch deep at a time and allow it to dry between layers. Vinyl spackling will typically dry within one to five hours, depending on temperature, humidity and material depth. Vinyl spackling may shrink or crack slightly when applied in layers deeper than 1/4 inch. Step 4: If time is of the essence, take the guess work out of drying time by using a product such as DAP brand DryDex. This vinyl spackling goes on pink and turns white once it is dry."}, {"url": "https://en.wikipedia.org/wiki/Spackling_paste", "passage_text": "Trademark [edit]. Spackle is a registered trademark of the Muralo Company, located in Bayonne, New Jersey. Muralo's product is dry powder, to be mixed with water by the user to form putty or paste. It was brought to market in 1927, then patented and trademarked in 1928. In the UK the generic name for this product is 'wall filler' with 'Polyfilla' being a popular brand name (the use of the prefix 'poly-' is intended to imply that it can be used on many different types of surface). It differs from spackle in being cellulose based."}]