[{"url": "http://www.unitis.org/en/hazardous-and-cmr-substances,209.html", "passage_text": "are concerned by both CLP Regulation and Cosmetics Regulation. Hazardous/CMR substances and CLP: CLP Regulation No 1272/2008 is the European Regulation on Classification, Labelling and Packaging of chemical substances and mixtures. CLP Regulation No 1272/2008 is the European Regulation on C lassification, L abelling and P "}, {"url": "https://en.wikipedia.org/wiki/CLP_Regulation", "passage_text": "CLP Regulation. From Wikipedia, the free encyclopedia. The CLP Regulation (for  C lassification, L abelling and P ackaging) is a European Union regulation which aligns the European Union system of classification, labelling and packaging chemical substances and mixtures to the Globally Harmonised System (GHS)."}, {"url": "http://www.hsa.ie/eng/Publications_and_Forms/Publications/Chemical_and_Hazardous_Substances/CLP_Poster_1_A1_size_.pdf", "passage_text": "The CLP Regulation (EC) No 1272/2008 on classification, labelling and packaging (CLP) of substances and mixtures entered into force on the 20th January 2009 and is direct acting in all European Member States."}, {"url": "http://echa.europa.eu/regulations/clp/", "passage_text": "The CLP Regulation ensures that the hazards presented by chemicals are clearly communicated to workers and consumers in the European Union through classification and labelling of chemicals. 1  Understanding CLP. 2  Legislation."}, {"url": "http://www.cleapss.org.uk/attachments/article/0/GL%20101%20GHS%20CLP%20labelling.pdf?Secondary/Science/Guidance%20Leaflets/", "passage_text": "The aims are to make it safer to recognise and trade in hazardous chemicals worldwide. CLP: Classification, Labelling & Packaging of Substances & Mixtures The GHS system has been implemented in the European Union under the new CLP Regulation."}, {"url": "http://www.hse.gov.uk/chemical-classification/legal/clp-regulation.htm", "passage_text": "European Regulation (EC) No 1272/2008 on classification, labelling and packaging of substances and mixtures came into force on 20 January 2009 in all EU Member States, including the UK. It is known by its abbreviated form, ‘the CLP Regulation’ or just plain ‘CLP’."}, {"url": "http://echa.europa.eu/documents/10162/13562/clp_introductory_en.pdf", "passage_text": "Introductory Guidance on the CLP Regulation Version 2.1 - August 2015 35 The classifications of all substances notified under CLP or registered under REACH are included in a classification and labelling inventory established at the Agency (CLP Article 42)."}, {"url": "http://www.hsa.ie/eng/Archived_Material/FAQs/Chemical/CLP_Regulation.html", "passage_text": "The ‘CLP’ Regulation (EC) No 1272/2008 on the classification, labelling and packaging of substances and mixtures, or simply ‘CLP’, introduces the United Nations globally harmonised system (UN GHS) for classification and labelling of chemicals into Europe."}]