[{"url": "http://people.howstuffworks.com/culture-traditions/national-traditions/greek-tradition1.htm", "passage_text": "Traditional Greek Food. A hot, dry climate sets the tone for the Greek menu, which relies heavily on fresh food. Fishermen pluck an array of seafood from the Mediterranean. Farmers cultivate lemons, eggplant, artichokes and other fresh fruits and vegetables. "}, {"url": "http://www.markdymiotis.com/food-diet/traditional-greekmediterranean-diet/", "passage_text": "The Greek traditional diet is based largely on fresh, unprocessed seasonal product. It is low in saturated fat and high in dietary fibre, starch, antioxidant vitamins (from cereals, fruit and vegetables) and polyphenols (from wine and olive oil). Salads have played a very important role in the traditional everyday diet but they are undervalued, misrepresented and not fully appreciated in food literature. Although salads are associated with fresh vegetables, the use of cooked vegetables and legumes is not unusual."}, {"url": "https://en.wikipedia.org/wiki/List_of_Greek_dishes", "passage_text": "Greek salad consists of tomatoes, sliced cucumbers, onion, feta cheese, and olives (usually Kalamata olives), typically seasoned with salt and oregano, and dressed with olive oil. Sliced capsicum, usually green, is often added also. "}, {"url": "http://greekfood.about.com/od/discovergreekfood/tp/25-Classic-Greek-Favorites.htm", "passage_text": "Photo © Lynn Livanos Athan. The ultimate in Greek comfort food, this soup is hearty and delicious and a staple of any Greek household. A traditional chicken soup finished with a creamy egg-lemon flavor, it is sure to become a family favorite. More ». "}, {"url": "http://greekfood.about.com/od/discovergreekfood/u/classic_traditional.htm", "passage_text": "Classic & Traditional Greek Recipes. From simple grilled foods and vegetable dishes to rich layered casseroles and delicate pastries, Greek food is a wonderful mix of dishes that appeal to all tastes. The Meze (Appetizers & Starters). More than appetizers (orektika in Greek), although the dishes are often the same, the meze is an accompaniment to beverages-usually alcoholic-and mezethes (plural) are often combined to make an entire meal."}, {"url": "https://en.wikipedia.org/wiki/Greek_cuisine", "passage_text": "1 Fasolada, a white-bean soup defined in many cookery books as the traditional Greek dish, sometimes even called the national food of the Greeks. 2  It is made of beans, tomatoes, carrot and a generous amount of celery usually served with a variety of salty side dishes(like olives or anchovies). Greece has a culinary tradition of some 4,000 years. Ancient Greek cuisine was characterized by its frugality and was founded on the Mediterranean triad: wheat, olive oil, and wine, with meat being rarely eaten and fish being more common."}, {"url": "http://www.mygreekdish.com/", "passage_text": "Little bites of heaven! This traditional Greek dolmades recipe (stuffed vine/ grape leaves) is the ultimate Greek vegetarian appetizer! Made from tender vine leaves wrapped into little rolls and stuffed with rice and fresh herbs, they are surprisingly simple to make. "}, {"url": "https://en.wikipedia.org/wiki/Greek_cuisine", "passage_text": "Greek cuisine has a long tradition and its flavors change with the season and its geography. Greek cookery, historically a forerunner of Western cuisine, spread its culinary influence-via ancient Rome-throughout Europe and beyond. Greece has a culinary tradition of some 4,000 years. Ancient Greek cuisine was characterized by its frugality and was founded on the Mediterranean triad: wheat, olive oil, and wine, with meat being rarely eaten and fish being more common."}, {"url": "https://en.wikipedia.org/wiki/Greek_cuisine", "passage_text": "Greek cuisine is a Mediterranean cuisine. Contemporary Greek cookery makes wide use of olive oil, lemon juice, vegetables, and herbs, grains and bread, wine, fish, and various meats, including lamb, poultry, rabbit and pork. The most commonly seen grain is wheat, however barley is also used. Greece has a culinary tradition of some 4,000 years. Ancient Greek cuisine was characterized by its frugality and was founded on the Mediterranean triad: wheat, olive oil, and wine, with meat being rarely eaten and fish being more common."}]