[{"url": "http://www.insidejobs.com/articles/how-much-does-a-chef-make", "passage_text": "The lowest-paid 10 percent of Chefs in the U.S. earned less than $22,120, while the highest-paid 10 percent earned more than $66,680. Given those statistics, you have a 50 percent chance of making between $30,000 and $52,000 annually as a Chef."}, {"url": "http://www.washingtonpost.com/wp-dyn/content/article/2006/04/18/AR2006041800376.html", "passage_text": "The average salary for an executive chef here is $71,666, according to a recent salary survey by StarChefs.com. The national average is $75,596, according to estimates by the online industry magazine. Locally, the range for line cooks is somewhere between $12 to $15 an hour, chefs and restaurateurs say."}, {"url": "http://work.chron.com/much-culinary-chef-paid-5415.html", "passage_text": "Salary Breakdown. One of the major differences in what chefs get paid is their job description. According to All Culinary Schools, an executive chef in charge of a kitchen earned a median salary of $67,995 as of June 2012, while a sous chef who reports to the executive chef earned a median salary of $42,501."}, {"url": "http://www.ehow.com/info_12009404_sous-chef-paid.html", "passage_text": "The median salary for sous chefs in the United States is $40,630 yearly, which is $19.53 per hour for those who are paid hourly. The 10th percentile of sous chefs earns approximately $23,260 annually or $11.18 hourly."}, {"url": "http://www.washingtonpost.com/wp-dyn/content/article/2006/04/18/AR2006041800376.html", "passage_text": "Average salaries there -- $85,000 a year for a chef and $14 an hour for line cooks, the people who make the food that gets sent out to diners -- are the highest in the country, according to a recent salary survey by StarChefs.com."}, {"url": "http://work.chron.com/much-chef-earn-us-8251.html", "passage_text": "Salaries. The top tier of chefs made more than $74,060, or $35.61 hourly, while the lowest earners received under $24,770, or $11.91. Chef duties depend on their titles. Executive chefs are the final authority in their kitchens. They plan menus, hire and train kitchen staff, and supervise the activities of subordinate chefs."}, {"url": "http://work.chron.com/much-culinary-chef-paid-5415.html", "passage_text": "Lower-Paying Jobs. Sometimes trained culinary chefs, particularly at the start of their careers, may work in lower-ranked kitchen jobs. These include cooking assistant, which paid a median salary of $25,076, according to All Culinary Schools, or even line cook, which paid a median rate of $21,874."}]