[{"url": "https://en.wikipedia.org/wiki/History_of_the_National_Hockey_League", "passage_text": "After unsuccessfully attempting to resolve disputes with Eddie Livingstone, owner of the Toronto Blueshirts, executives of the three other NHA franchises suspended the NHA, and formed the National Hockey League (NHL), replacing the Livingstone team with a temporary team in Toronto, the Arenas. In Canada, there was widespread outrage over the denial of an expansion team to Vancouver in 1967; three years later, the NHL awarded a franchise to Vancouver, which formerly played in the Western Hockey League, for the 1970–71 season, along with the Buffalo Sabres."}, {"url": "http://www.answers.com/Q/What_year_did_the_NHL_begin", "passage_text": "Not sure who posted 1909, but they are wrong. The NHL was founded in December 1917. First game played on Dec. 19 of that year. Lord Stanley's cup had been around for almost 25 years, and was a challenge cup before becoming the Championship trophy for the NHL. The champions of the NHL and a similar league, the PCL, would play for the cup, until 1923 when the PCL folded and the NHL took sole possession of the cup."}, {"url": "http://www.nhl.com/history/112617nhl.html", "passage_text": "NHL.com is the official Web site of the National Hockey League. NHL and the word mark and image of the Stanley Cup are registered trademarks and the NHL Shield and NHL Conference logos are trademarks of the National Hockey League. "}, {"url": "https://en.wikipedia.org/wiki/NHL", "passage_text": "The National Hockey League was established in 1917 as the successor to the National Hockey Association (NHA). Founded by Ambrose O'Brien in 1909, the NHA began play one year later with seven teams in Ontario and Quebec, and was one of the first major leagues in professional ice hockey. The league was reduced to six teams for the 1942–43 NHL season: the Boston Bruins, Chicago Black Hawks, Detroit Red Wings, Montreal Canadiens, New York Rangers and Toronto Maple Leafs. These six teams remained constant for 25 years, a period known as the Original Six."}, {"url": "http://www.hockey-fans.com/central/blackhawks/", "passage_text": "Chicago Blackhawks. The Chicago Blackhawks are one of the original six NHL teams and were formed in September of 1926. A coffee millionaire by the name of Major Frederic McLaughlin invested $200,000 to purchase the Portland Rosebuds of the Western Hockey League"}, {"url": "https://en.wikipedia.org/wiki/NHL", "passage_text": "The National Hockey League (NHL; French: Ligue nationale de hockey—LNH) is a professional ice hockey league composed of 30 member clubs: 23 in the United States and 7 in Canada. The league was reduced to six teams for the 1942–43 NHL season: the Boston Bruins, Chicago Black Hawks, Detroit Red Wings, Montreal Canadiens, New York Rangers and Toronto Maple Leafs. These six teams remained constant for 25 years, a period known as the Original Six."}, {"url": "http://www.angelfire.com/ca/CANpride/report02.html", "passage_text": "For the rest of the year, the NHL struggled with just three teams -- the Canadiens, Senators, and Arenas. Another league, the Amateur Hockey Association of Canada (AHAC), had been formed in 1886. A team from this organization was awarded the first Stanley Cup championship in 1893. "}, {"url": "http://www.thepeoplehistory.com/icehockeyhistory.html", "passage_text": "Though world hockey had been around for the vast majority of the 20th century, its quality was not very high. The International Ice Hockey Federation (IIHF) had been formed in 1908, made up of Belgium, Bohemia (Czechoslovakia), England, France and Switzerland, with Germany joining a year later. Canada and the U.S., the true centers of the hockey world, did not join until 1920, the year of the Olympics."}, {"url": "https://en.wikipedia.org/wiki/NHL", "passage_text": "The National Hockey League fought the WHA for players, losing 67 to the new league in its first season of 1972–73, including Bobby Hull, who signed a ten-year, $2.5 million contract with the Winnipeg Jets, the largest in hockey history at the time. The league was reduced to six teams for the 1942–43 NHL season: the Boston Bruins, Chicago Black Hawks, Detroit Red Wings, Montreal Canadiens, New York Rangers and Toronto Maple Leafs. These six teams remained constant for 25 years, a period known as the Original Six."}]