[{"url": "http://www.apta.org/AboutPTAs/", "passage_text": "Physical therapist assistants (PTAs) provide physical therapy services under the direction and supervision of a licensed physical therapist. PTAs help people of all ages who have medical problems, or other health-related conditions that limit their ability to move and perform functional activities in their daily lives. "}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/physiotherapyassistant.aspx", "passage_text": "As a physiotherapy assistant, you would help qualified physiotherapists work with patients to restore or improve movement. Patients could range from very young children to older people, and could be inpatients from any department of a hospital or outpatients. Experience as a physiotherapy assistant is likely to help you if you want to qualify as a physiotherapist. In some areas, NHS Trusts and universities run linked schemes where you can continue working as an assistant while studying part-time for a degree and registration"}, {"url": "http://www.wisegeek.com/what-does-a-physiotherapy-assistant-do.htm", "passage_text": "A health professional trained to assist a physical therapist is called a physiotherapy assistant. A physiotherapy assistant is trained in all aspects of physical therapy. The main job of these health practitioners is to treat an individual's physical limitations according to the treatment regiment set up by a physical therapist."}, {"url": "http://www.apta.org/PTACareers/RoleofaPTA/", "passage_text": "Physical therapist assistants (PTAs) work as part of a team to provide physical therapy services under the direction and supervision of the physical therapist. The terms physical therapy and physiotherapy, and the terms physical therapist and physiotherapist, are synonymous. The terms physical therapist assistant and physical therapy aide or technician are not"}, {"url": "http://www.bls.gov/ooh/Healthcare/Physical-therapist-assistants-and-aides.htm", "passage_text": "Physical therapist aides work under the direct supervision of a physical therapist or physical therapist assistant. They usually are responsible for keeping the treatment area clean and organized, and preparing for each patient's therapy. They also help patients who need assistance moving to or from a treatment area. What Physical Therapist Assistants and Aides Do. Physical therapist assistants (sometimes called PTAs) and physical therapist aides work under the direction and supervision of physical therapists. They help patients who are recovering from injuries and illnesses regain movement and manage pain. Physical therapist assistants are involved in the direct care of patients. Physical therapist aides often do tasks that are indirectly related to patient care, such as cleaning and setting up the treatment area, moving patients, and performing clerical duties"}, {"url": "https://bigfuture.collegeboard.org/careers/health-care-support-physical-therapist-assistants#!", "passage_text": "This career is growing because more people will need physical therapy as the U.S. population ages. And health insurance companies are covering these services more often, so more patients are using them. Also, PT assistants are doing more of the work that physical therapists used to do. That’s because this is a good way to keep the cost of treatment down -- after all, PT assistants earn less than physical therapists. "}, {"url": "http://money.usnews.com/careers/best-jobs/physical-therapist-assistant/salary", "passage_text": "Best Paying Cities for Physical Therapist Assistants. The highest paid in the physical therapist assistant profession work in the metropolitan areas of College Station, Texas, El Paso, Texas, and Brownsville, Texas. The Modesto, California area also pays well, as does the city of Lakeland, Florida. "}, {"url": "http://blog.sunbeltstaffing.com/therapy/what-does-a-physical-therapist-assistant-do/", "passage_text": "First, physical therapy assistants do work directly under the supervision of a physical therapist. They are not the ones evaluating injuries or designing treatment. "}, {"url": "http://www.wisegeek.com/what-does-a-physiotherapy-assistant-do.htm", "passage_text": "In most instances, a license to practice is necessary. Under the direct or indirect supervision of a physical therapist, a physiotherapy assistant's job is to provide physical therapy to patients or clients in a variety of settings. Physical therapy is the administration of various treatment protocols to increase and maximize a person's overall function and mobility. A physiotherapy assistant is trained in all aspects of physical therapy. The main job of these health practitioners is to treat an individual's physical limitations according to the treatment regiment set up by a physical therapist."}]