[{"url": "http://kids.britannica.com/elementary/article-353708/Reptile", "passage_text": "A reptile is an air-breathing animal that has scales instead of hair or feathers. Reptiles have lived on Earth for more than 280 million years. Scientists consider them to be the ancestors of birds and mammals. Over the years many kinds of reptiles have become extinct, or died out. The dinosaurs are well-known reptiles that became extinct about 65 million years ago."}, {"url": "http://www.merriam-webster.com/dictionary/amphibian", "passage_text": "1. : an amphibious organism; especially: any of a class (Amphibia) of cold-blooded vertebrates (as frogs, toads, or salamanders) intermediate in many characters between fishes and reptiles and having gilled aquatic larvae and air-breathing adults. 2. Definition of AMPHIBIAN for Kids. 1. : any of a group of cold-blooded vertebrate animals (as frogs and toads) that have gills and live in water as larvae but breathe air as adults. 2. : an airplane designed to take off from and land on either land or water"}, {"url": "http://www.merriam-webster.com/dictionary/reptile", "passage_text": "1 reptile. noun rep·tile \\ˈrep-ˌtī(-ə)l, -təl\\. Tweet. : an animal (such as a snake, lizard, turtle, or alligator) that has cold blood, that lays eggs, and that has a body covered with scales or hard parts. : a person who cannot be trusted or who is not likable"}, {"url": "http://www.learnersdictionary.com/definition/reptile", "passage_text": "Learner's definition of REPTILE. [count]. 1. : an animal (such as a snake, lizard, turtle, or alligator) that has cold blood, that lays eggs, and that has a body covered with scales or hard parts. 2. informal: a person who cannot be trusted or who is not likable. He called the governor's top aide a reptile."}, {"url": "http://www.merriam-webster.com/dictionary/reptile", "passage_text": "Definition of REPTILE for Kids. : a cold-blooded animal (as a snake, lizard, turtle, or alligator) that breathes air and usually has the skin covered with scales or bony plates. Tweet. : an animal (such as a snake, lizard, turtle, or alligator) that has cold blood, that lays eggs, and that has a body covered with scales or hard parts."}, {"url": "http://www.sciencekids.co.nz/sciencefacts/animals/reptile.html", "passage_text": "Check out our awesome range of animal facts for kids and learn some fun trivia about our friends in the animal kingdom. Fun Reptile Facts for Kids. Check out our range of fun reptile facts for kids. Learn what reptiles are, how they defend themselves, examples of reptiles and much more. Read on and enjoy a variety of interesting information about reptiles. Nearly all reptiles lay shelled eggs. Reptiles breathe air. "}, {"url": "http://www.merriam-webster.com/dictionary/amphibian", "passage_text": ": an amphibious organism; especially: any of a class (Amphibia) of cold-blooded vertebrates (as frogs, toads, or salamanders) intermediate in many characters between fishes and reptiles and having gilled aquatic larvae and air-breathing adults. Definition of AMPHIBIAN for Kids. 1. : any of a group of cold-blooded vertebrate animals (as frogs and toads) that have gills and live in water as larvae but breathe air as adults. 2. : an airplane designed to take off from and land on either land or water"}, {"url": "http://www.thefreedictionary.com/amphibian", "passage_text": "Amphibians include frogs, toads, and salamanders. Word History Amphibians are not quite fish and not quite reptiles. Like fish, they spend part of their lives living in water and breathing with gills; like reptiles, they usually spend another part of their lives breathing air with lungs and able to live on land. "}, {"url": "http://www.kidzone.ws/animals/reptiles1.htm", "passage_text": "Being cold-blooded means that their bodies react to the temperature of their surroundings. When they get too warm, they can go into the water or shade to cool off. A lizard catches some sun to warm up. Photo Source: Corel Web Gallery. When they get too cold they can hang out in the sun to warm themselves up. "}]