[{"url": "http://work.chron.com/wage-firstyear-apprentice-lineman-5288.html", "passage_text": "Apprentices in the Northwest Line's Outside Electrical Lineman Apprenticeship receive an increase from 60 percent to 63 percent of a journey worker's wages after completing 1,000 hours of training. Those enrolled in the Northeastern Joint Apprenticeship program get a five percent pay raise after 1,000 hours. Wages for lineman apprentices at the TVA increase from $36,450 to $38,370 after completing their first step of training. A first-year apprentice lineman's wages varies based on the program where he is enrolled. Starting wages for apprentices in the Tennessee Valley Authority's Lineman Apprentice Program are $36,450 per year."}, {"url": "http://work.chron.com/much-electrical-lineman-make-year-3128.html", "passage_text": "A journeyman electrical lineman's wages are determined by such factors as his geographic location, employment and union membership. Hourly wages for a journeyman outside lineman with the Northwest Line were $44.73 as of February 2012, resulting in an annual wage of $93,038 for full-time workers. The national median annual income for all electricians was $49,320 as of May 2011, according to the BLS. The middle 50 percent earned between $37,570 and $65,260 per year. The top 10 percent made at least $82,680 per year, while the bottom 10 percent earned annual wages of $30,390."}, {"url": "http://www.salarylist.com/company/Aep-Salary.htm", "passage_text": "Aep Salary. Aep average salary is $-, median salary is $- with a salary range from $- to $-. Aep salaries are collected from government agencies and companies. Each salary is associated with a real job position. Aep salary statistics is not exclusive and is for reference only. They are presented as is and updated regularly. "}, {"url": "http://www1.salary.com/Lineman-salary.html", "passage_text": "For example the median expected annual pay for a typical Lineman in the United States is $71,451 so 50% of the people who perform the job of Lineman in the United States are expected to make less than $71,451. Source: HR Reported data as of October 2015. Median $71,451. "}, {"url": "http://work.chron.com/much-electrical-lineman-make-year-3128.html", "passage_text": "Apprentices in the Tennessee Valley Authority's Lineman Apprentice Program are paid a fixed salary based on their level of training. 2012 TVA apprentice wages ranged from $36,450 to $54,360 per year. The national median annual income for all electricians was $49,320 as of May 2011, according to the BLS. The middle 50 percent earned between $37,570 and $65,260 per year. The top 10 percent made at least $82,680 per year, while the bottom 10 percent earned annual wages of $30,390."}, {"url": "https://www.aepnationalaccounts.com/account/bills/pay/", "passage_text": "Once you have used this service, you can check your AEP account balances and initiate payments 24 hours a day, seven days a week. However, using this payment option one month does not obligate you to pay this way every month. You'll need your account number. Login to get it. AEP will be notified immediately. More details. The service fee will be charged by the service provider, BillMatrix. While you will be paying your account with AEP, the full amount of the fee is passed to BillMatrix as the provider of this service. You will receive a confirmation code as proof of payment. AEP will be immediately notified of your payment through an electronic memo posting to your electric accoun"}, {"url": "http://www.indeed.com/forum/job/journeyman-lineman/Aep-lineman-pay/t338374", "passage_text": "Dustin in Victoria, Texas said: Tim,A AEP class A lineman can gross about 70 to 85 thousand a year.However this amount can increase depending on the area work load and overtime load.Some areas will have lots more overtime then others.I know of guys that have made over 100 thousand here in texas.Hope this helps you. "}, {"url": "http://www.indeed.com/salary/Journeyman-Lineman.html", "passage_text": "Average Journeyman Lineman salaries for job postings nationwide are 24% higher than average salaries for all job postings nationwide. "}, {"url": "http://www.salarylist.com/company/American-Electric-Power-Salary.htm", "passage_text": "American Electric Power Salary. American Electric Power average salary is $67,385, median salary is $70,000 with a salary range from $35,000 to $109,000. American Electric Power salaries are collected from government agencies and companies. Each salary is associated with a real job position. American Electric Power salary statistics is not exclusive and is for reference only. They are presented as is and updated regularly."}]