[{"url": "http://fearfulmacbeth.weebly.com/macbeths-fear.html", "passage_text": "This quote is when Macbeth is talking to Lady Macbeth about how Macbeth is scared of Fleance. Shakespeare uses metaphor to express Macbeth's fear as Shakespeare uses snake to symbolize Fleance meaning that Macbeth have angered the snake not killed it therefor believing that it will cause harm to him."}, {"url": "http://www.enotes.com/homework-help/what-does-lady-macbeth-fear-will-an-obstacle-267172", "passage_text": "So it is that Lady Macbeth wants her husband to come back swiftly so that she can pour my spirits into his ear and chastise and encourage him to do what she feels needs to be done to help the prophecy come about. Ashley Kannan | Middle School Teacher | (Level 3) Distinguished Educator. Posted on. (Answer #2)."}, {"url": "http://www.enotes.com/homework-help/what-does-lady-macbeth-fear-will-an-obstacle-267172", "passage_text": "Fundamentally, Lady Macbeth fears Macbeth's sense of honor in preventing him from killing Duncan. She discloses her desire for power and in doing so, the reader/ audience understands how Macbeth is not comfortable in doing what is being asked of him."}, {"url": "http://www.enotes.com/homework-help/what-does-lady-macbeth-fear-will-an-obstacle-267172", "passage_text": "If we look at Act I scene 5 carefully, we can see Lady Macbeth's response to hearing about the prophecy of the witches and her concerns about what might prevent Macbeth from gaining the crown that the witches have promised him. The answer to your question can be found in the soliloquy that Lady Macbeth gives:"}, {"url": "http://fearfulmacbeth.weebly.com/macbeths-fear.html", "passage_text": "Our fear is in Banquo. stick deep. Macbeth and Lady Macbeth is talking with each other as Macbeth ordered killers to assassin Banquo and his son. However, by looking at this quote, Macbeth mentions that he is sacred and in fact he's fear in Banquo stick deep into his heart."}, {"url": "http://www.shakespeare-navigators.com/macbeth/Fear.html", "passage_text": "Even when it looks like Fortune is smiling on the enemy, brave Macbeth--well he deserves that name-- / Disdaining Fortune (1.2.16-17) plunges fearlessly into battle and wins the victory. [Scene Summary] Just after Macbeth hears the witches' prophecies, Ross and Angus tell him that he has been named Thane of Cawdor. Upon hearing this, Macbeth goes into a trance-like state as he tries to sort things out."}, {"url": "http://www.enotes.com/homework-help/why-does-macbeth-fear-banquo-72369", "passage_text": "'Tis much he dares; Macbeth's fear of Banquo is that, through him, the second part of the witches' initial prophecy will come true. According to the weird sisters, Macbeth would rule Scotland, but it would be Banquo's heirs--not Macbeth's--who would eventually inherit the throne."}]