[{"url": "http://www.mesotheliomasymptoms.com/mesothelioma-symptoms", "passage_text": "Mesothelioma Symptoms. Patients with mesothelioma generally do not demonstrate symptoms of this disease until 20 to 50 years after their initial exposure to asbestos. Fibers that embed in the tissue surrounding the body’s internal organs, the mesothelium, usually must be present for many decades before cancer develops. "}, {"url": "http://www.emedicinehealth.com/mesothelioma/article_em.htm", "passage_text": "Mesothelioma Overview. Mesothelial cells are a layer of specialized cells that line the body cavities, including the pleura (lining of the lung), peritoneum (lining of the abdominal cavity), and pericardium (lining of the heart). The tissue formed by these cells is called mesothelium. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/mesothelioma/basics/symptoms/CON-20026157", "passage_text": "Peritoneal mesothelioma, which occurs in tissue in the abdomen, causes signs and symptoms that may include: 1  Abdominal pain. 2  Abdominal swelling. 3  Lumps of tissue in the abdomen. 4  Unexplained weight loss. Signs and symptoms of mesothelioma vary depending on where the cancer occurs. Pleural mesothelioma, which affects the tissue that surrounds the lungs, causes signs and symptoms that may include: 1  Chest pain under the rib cage. 2  Painful coughing. 3  Shortness of breath. 4  Unusual lumps of tissue under the skin on your chest."}, {"url": "http://www.medicinenet.com/mesothelioma/article.htm", "passage_text": "What is mesothelioma? Mesothelioma is a rare form of cancer (malignancy) that most frequently arises from the cells lining the sacs of the chest (the pleura) or the abdomen (the peritoneum). Pleural mesothelioma is the most common form, often presenting with symptoms in the chest area. Mesothelioma facts. 1  Mesothelioma is a cancer that arises from the cells lining the chest or abdominal cavities. 2  Mesothelioma typically results from exposure to asbestos. 3  When mesothelioma affects the chest, the doctor may look inside the chest cavity with a special instrument called a thoracoscope."}, {"url": "http://mesothelioma-net.com/info/symptoms/", "passage_text": "Mesothelioma Symptoms. The onset of mesothelioma symptoms is usually very slow. Symptoms for Pleural Mesothelioma (involving the lung / chest area) are: 1  Chest pain and pain in the lower back. 2  Difficulty breathing. 3  Coughing. 4  Weight loss. 5  Fever. 6  Muscle weakness and sensory loss. 7  Swelling of the face and arms. "}, {"url": "https://en.wikipedia.org/wiki/Asbestosis", "passage_text": "Signs and symptoms [edit]. The signs and symptoms of asbestosis typically manifest after a significant amount of time has passed following asbestos exposure, often several decades under current conditions in the US. "}, {"url": "https://www.pleuralmesothelioma.com/cancer/symptoms.php", "passage_text": "Symptoms of Mesothelioma. Presenting symptoms of pleural mesothelioma can be as nondescript as a chest pain, slight fatigue, or a shortness of breath during physical activity. "}, {"url": "http://www.cancercenter.com/mesothelioma/symptoms/", "passage_text": "Mesothelioma symptoms. Pleural mesothelioma symptoms. The symptoms associated with pleural mesothelioma may be similar to other conditions affecting the lungs or chest. Pleural effusion, a complication of the disease, is the buildup of fluid in the chest. It may cause difficulty breathing. "}]