[{"url": "http://www.answers.com/Q/How_do_you_find_out_if_you_owe_the_IRS_money", "passage_text": "Usually if you owe back taxes, IRS will send you a letter to notify you that you owe IRS money. However, if you are not sure, try to call IRS at 1-800-829-1040. Also you can g … o and visit an IRS local office (if they get one in your city.) For more information, check the related links below. They owe income tax on that, too. And the IRS does not know that you have dependents or have deductions or whatever unless you file a tax return. They need that statement, sworn under penalty of perjury, of your income, deductions, exemptions, credits, and so on to properly calculate whether you owe taxes."}, {"url": "http://smallbusiness.chron.com/check-balance-owed-irs-previous-years-10011.html", "passage_text": "If you owe additional taxes, you will get a report from the auditor telling you the amount you owe. You can then set up an installment payment arrangement with the IRS. After you start paying the amounts off, you can contact the IRS to see how much more you still owe on your back taxes. Step 1. Find the tax year that you owe back taxes on and have your Social Security number available. If you filed a tax return for your business as a corporation, partnership or S corporation, then you will need your EIN --your Employer Identification Number. Step 2. Call the Internal Revenue Service at 1-800-829-4933. "}, {"url": "http://blog.taxact.com/owe-money-to-the-irs-steps-to-pay-off-your-tax-bill/", "passage_text": "File Form 9465, Installment Agreement Request, to set up installment payments with the IRS. The IRS must allow you to make payments on your overdue taxes if you owe $25,000 or less, you can show that you cannot pay the amount you owe now, you can pay off the tax in three years or less. "}, {"url": "https://www.bestcashcow.com/articles/how-to-find-out-how-much-you-owe-the-irs-in-back-taxes-7908", "passage_text": "Understand the different ways you can find out how much you owe the IRS if you are unsure. Many people who haven't paid attention to IRS CP Letters, or have moved, may be unsure. The first step to find the right tax resolution is to know how much you owe before you can begin to resolve major tax problems. Finding out how much you owe can be done in a few ways: 1) You can show up at your local IRS office or you can give the IRS a call. You can use IRS.gov to find out where your closest IRS office is or just call the national 1-800 number which is 1-800-829-1040."}, {"url": "https://www.backtaxeshelp.com/faq/find-how-much-irs-taxes-owed.html", "passage_text": "If you fail to file or pay your taxes on time or in full, the IRS will send you notices known as “CP Letters.” The IRS will typically contact you 60 days after the April 15th (April 18th in 2011) tax filing deadline, or send letters to your last-known address. 1 Download and print Form 4506-T, or call the IRS and ask them to send it to you. 2  Fill out your basic contact information at the top. 3  Indicate individual income tax (1040), partnership (1065), or business (940) on Line 6. 4  Check C for requesting a Record of Account; Check B if you want an Account Transcript."}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/IRS-Tax-Return/How-to-Find-Out-How-Much-You-Owe-in-IRS-Back-Taxes/INF15112.html", "passage_text": "Updated for Tax Year 2014. OVERVIEW. You can calculate what you owe in back taxes fairly accurately without even contacting the IRS. Finding out how much you owe the IRS in back taxes will depend on whether the tax relates to returns you’ve already filed or ones you still need to file. Step 2: File your past-due tax returns. If your back taxes relate to returns you have yet to file, then you can calculate the amount of tax you owe for each year by preparing the actual return. However, when you do, you must use all tax forms for the year you are filing."}, {"url": "http://www.thetaxsolvers.com/i-dont-know-how-much-i-owe-the-irs/", "passage_text": "If you are unsure of how much money you owe the IRS, an IRS investigation can be performed by us to determine the amount. To begin the investigation process, you will need to schedule a Case Assessment Session with a professional tax attorney. "}, {"url": "https://www.taxdefensenetwork.com/tax-help/how-much-do-i-owe-the-irs/", "passage_text": "or, “how to find out how much I owe the IRS”. If you file and pay your taxes on time each year, you may never consider how to find out how much you owe the IRS. The reality, though, is that you can have a tax debt and not know until it’s too late. "}, {"url": "https://www.irs.gov/uac/ten-tips-for-taxpayers-who-owe-money-to-the-irs", "passage_text": "Ten Tips for Taxpayers Who Owe Money to the IRS. IRS Summertime Tax Tip 2011-14, August 5, 2011. While the majority of Americans get a tax refund from the Internal Revenue Service each year, there are many taxpayers who owe and some who can’t pay the tax all at once. The IRS has a number of ways for people to pay their tax bill. Here are ten tips for taxpayers who owe money to the IRS. 1  Tax bill payments If you get a bill this summer for late taxes, you are expected to promptly pay the tax owed including any penalties and interest."}, {"url": "https://www.backtaxeshelp.com/faq/find-how-much-irs-taxes-owed.html", "passage_text": "In order to find out how much you owe in taxes it is required that all tax returns are filed. If you have a standard job where you receive a W2, it is required that you have this document to complete your tax returns. Back Taxes Frequently Asked Questions. 1 Download and print Form 4506-T, or call the IRS and ask them to send it to you. 2  Fill out your basic contact information at the top. 3  Indicate individual income tax (1040), partnership (1065), or business (940) on Line 6. 4  Check C for requesting a Record of Account; Check B if you want an Account Transcript."}]