[{"url": "https://uk.answers.yahoo.com/question/index?qid=20071210024916AAOPyjG", "passage_text": "Report Abuse. Veins carry blood towards the heart...Arteries carry blood away from the heart and Capillaries are the smallest form of Arteries. Basically if you poke your finger, you are bleeding from a Capillary...if you stab yourself high in the front of the thigh, you are probably bleeding from the Femoral Artery. "}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_arteries_capillaries_and_veins", "passage_text": "Only veins have valves. Arteries have a smaller lume. An artery carries blood away from the heart, while veins transport blood to the heart. The difference is that an artery brings blood to the body and a vein takes blood to the lungs. Arteries and Veins are part of the circulatory system, where arteries carry the blood from the heart to the organs, and the veins carry it from the organs to the heart again. When the arteries deposit the oxygen and other nutrients through the capillaries, the blood then moves to the veins, which will carry the blood back to the heart. The veins are made from all the capillary branches moving back to gether."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_artries_veins_and_capillaries", "passage_text": "Arteries carry oxygenated blood away from the heart, to the cells that need them. Veins carry blood containing carbon dioxide back to the heart after the oxygen has been given to the cells. Capillaries are the thinnest arteries and veins. They are only one cell wide. As the blood cell passes through the very thin capillary, the cells on either side are given oxygen and carbon dioxide is taken from them. Therefore, the capillaries connect the arteries and veins. Capillaries are smaller extensions of arteries and veins, supplying blood tho the bodies extremities. When the arteries deposit the oxygen and other nutrients through the capillaries, the blood then moves to the veins, which will carry the blood back to the heart."}, {"url": "http://brainz.org/what-difference-between-arteries-veins-blood-vessels-and-capillaries/", "passage_text": "There are three major types of blood vessels, and these are the arteries, veins and capillaries. Arteries, except for the pulmonary artery, carry oxygenated blood away from the heart to the different parts of the body. The smallest arteries are called arterioles while the smallest veins are called the venules. The capillaries are connected to the arterioles and venules. It is important for the capillaries to be thin and small to be able to transfer of nutrients and other matters."}, {"url": "http://www.differencebetween.net/science/health/difference-between-veins-and-arteries/", "passage_text": "Veins and arteries are both types of blood vessels but arteries carry blood away from the heart to the rest of the body while veins carry blood to the heart from the rest of the body. All arteries except the pulmonary and umbilical arteries carry oxygenated blood while all veins carry deoxygenated blood. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071104125618AAPwdZa", "passage_text": "In the systemic circulation, arteries bring oxygenated blood to the tissues. As blood circulates through the body, oxygen diffuses from the blood into cells surrounding the capillaries, and carbon dioxide diffuses into the blood from the capillary cells. Veins bring deoxygenated blood back to the heart. Capillaries are where veins become arteries (or vice versa). They have very thin walls (only once cell thick), so oxygen can diffuse into the surrounding tissue and waste products (like carbon dioxide) can diffuse in and be removed from the body. Source(s): Wikipedia."}, {"url": "http://brainz.org/what-difference-between-arteries-veins-blood-vessels-and-capillaries/", "passage_text": "The difference between the blood vessels, arteries, veins and capillaries is in their shapes, sizes and function in the circulatory system. Blood vessels as defined by the dictionary as tubular structures carrying blood to tissues and organs of the body. The smallest arteries are called arterioles while the smallest veins are called the venules. The capillaries are connected to the arterioles and venules. It is important for the capillaries to be thin and small to be able to transfer of nutrients and other matters."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_arteries_capillaries_and_veins", "passage_text": "Veins are blood vessels carrying blood towards the heart, whereas arteries bring blood away from heart. Mostly, arteries contain oxygenated blood, and veins contain carbon d … ioxide-rich and oxygen-poor blood; however, there is one exception. When the arteries deposit the oxygen and other nutrients through the capillaries, the blood then moves to the veins, which will carry the blood back to the heart. The veins are made from all the capillary branches moving back to gether."}, {"url": "http://www.diffen.com/difference/Arteries_vs_Veins", "passage_text": "There are two types of blood vessels in the circulatory system of the body: arteries that carry oxygenated blood from the heart to various parts of the body and veins that carry blood towards the heart for purification. Types of arteries and veins. There are two types of arteries in the body: Pulmonary and systemic. The pulmonary artery carries deoxygenated blood from the heart, to the lungs, for purification while the systemic arteries form a network of arteries that carry oxygenated blood from the heart to other parts of the body."}, {"url": "http://www.brighthubeducation.com/science-homework-help/123202-about-the-circulatory-system-arteries-veins-and-capillaries/", "passage_text": "The Circulatory System. Veins, arteries and capillaries are the three types of blood vessels in the circulatory system. The blood vessels carry blood, which contains antibodies, nutrients, oxygen, electrolytes and hormones, throughout the body to be used by the organs. Blood contains oxygen and nutrients the body needs to survive. The arteries, veins and capillaries are types of blood vessels that transport the vital blood throughout the body. Learn the differences between the types of blood vessels."}]