[{"url": "http://www.definitions.net/definition/stateless%20nation", "passage_text": "Stateless nation. The term stateless nation is used of ethnic groups which are not the majority population in any nation state and for whom it is implied that they should have such a state. As such, the term expresses irredentism."}, {"url": "http://rangergeo.weebly.com/uploads/3/0/6/3/30634791/unit_4_ch_8a_notes.pdf", "passage_text": "NATION, STATE, NATION-STATE, STATELESS NATION  NATION –a group of people with a common culture living in a territory and having a strong sense of unity.  STATE –An independent unit that occupies a specific territory and has full control of its internal and external affairs."}, {"url": "http://markslists.net/geography/statelessnations/index.html", "passage_text": "Stateless Nations. This countdown list, of nations and peoples fighting for independence or just for their very existence, is selected on the basis of variety and interest. So while some may be pressing cases and deserving of the world's attention, others are untroubling or else irretrievable lost causes."}, {"url": "http://www.abbreviations.com/stateless%20nation", "passage_text": "Stateless nation. The term stateless nation is used of ethnic groups which are not the majority population in any nation state and for whom it is implied that they should have such a state. As such, the term expresses irredentism."}, {"url": "https://en.wikipedia.org/wiki/Stateless_nation", "passage_text": "A stateless nation is an ethnic group, religious group, linguistic group or other cohesive group which is not the majority population in any nation state. The term implies that the group should have such a state, and thus expresses irredentism."}, {"url": "http://www.definitions.net/definition/stateless%20nation", "passage_text": "The term stateless nation is used of ethnic groups which are not the majority population in any nation state and for whom it is implied that they should have such a state. As such, the term expresses irredentism."}]