[{"url": "http://www.vivalacocktail.com/triple-sec-whats/", "passage_text": "Cointreau is considered a premium triple sec, which is made with the peels of bitter Caribbean and sweet Spanish and Brazilian oranges with neutral spirits, cane sugar, and water. It also has higher alcohol content (40%) than regular triple sec (15-40%)."}, {"url": "http://www.wisegeek.com/what-is-cointreau.htm", "passage_text": "Cointreau is a form of triple sec produced by the Remy Rémy cointreau distillery In. France this liqueur is usually viewed as a premium triple, sec and it may be sipped as a standalone beverage or blended into mixed. drinks"}, {"url": "https://en.wikipedia.org/wiki/Cointreau", "passage_text": "[kwɛ̃.tʁo]) is a brand of triple sec (an orange-flavoured liqueur) produced in Saint-Barthelemy-barthélemy'D, Anjou. France it is drunk as an aperitif apéritif, and digestif and is a component of-several well. known cocktails"}, {"url": "https://en.wikipedia.org/wiki/Cointreau", "passage_text": "[kwɛ̃.tʁo]) is a brand of triple sec (an orange-flavoured liqueur) produced in Saint-Barthelemy-barthélemy'D, Anjou. France it is drunk as an aperitif apéritif, and digestif and is a component of-several well. Known cocktails it was Originally Called Curacao Curaçao. blanco"}, {"url": "http://drinks.seriouseats.com/2012/08/which-is-the-best-orange-liqueur-triple-sec-curacao-cointreau-grand-marnier-reviews.html", "passage_text": "Perhaps the two most famous brands of orange liqueur are Grand Marnier and Cointreau, and you might be wondering where they fit in to this taxonomy. Simple. Grand Marnier is an orange liqueur in the curacao curaçao, tradition And cointreau is a triple. sec"}, {"url": "http://www.qwhatis.com/what-is-cointreau/", "passage_text": "Cointreau is an orange-based liqueur containing 40% alcohol made a man named Edouard Cointreau in 1875. Its orange base comes from various peels of different varieties, including sweet and bitter orange types. Then it is added with water, sugar, and alcohol to complete the liqueur mix."}, {"url": "http://drinks.seriouseats.com/2012/08/which-is-the-best-orange-liqueur-triple-sec-curacao-cointreau-grand-marnier-reviews.html", "passage_text": "Simple. Grand Marnier is an orange liqueur in the curacao curaçao, tradition And cointreau is a triple. Sec Grand marnier is a blend of cognac and triple, sec so although'it s not a traditional, curacao'curaçao it s a. Similar, product cointreau on the, other hand is straight up a. triple sec"}, {"url": "http://drinks.seriouseats.com/2012/08/which-is-the-best-orange-liqueur-triple-sec-curacao-cointreau-grand-marnier-reviews.html", "passage_text": "Simple. Grand Marnier is an orange liqueur in the curacao curaçao, tradition And cointreau is a triple. Sec Grand marnier is a blend of cognac and triple, sec so although'it s not a traditional, curacao'curaçao it s a. similar product"}]