[{"url": "http://www.answers.com/Q/What_is_the_only_legal_direct_tax_which_was_passed_by_an_amendment_to_the_Constitution", "passage_text": "I believe the 16th Amendment details the Income Tax, though there is controversy as to whether or not it was passed legally. The 18th Amendment to the Constitution which prohibited the sale of alcohol was passed in 1919 when there were only 48 States in the Union What was the minimum number of States that were needed to?"}, {"url": "http://www.investopedia.com/terms/s/sixteenth-amendment.asp", "passage_text": "DEFINITION of 'Sixteenth Amendment'. The amendment within the Constitution that gives Congress the power to collect taxes on income without apportioning it among the states. The Sixteenth Amendment was passed in 1909 and ratified in 1913."}, {"url": "http://www.answers.com/Q/What_is_the_only_legal_direct_tax_which_was_passed_by_the_Sixteenth_Amendment_to_the_Constitution", "passage_text": "I believe the 16th Amendment details the Income Tax, though there  is controversy as to whether or not it was passed legally. "}, {"url": "http://constitution.laws.com/16th-amendment", "passage_text": "The 16th Amendment substantiates that the classification of a tax as ‘direct’ or ‘indirect’ is irrelevant; this amendment states that a Federal income tax can be collected without regard to an individual state’s respective population or gross amount of income. 16th Amendment Facts. "}, {"url": "http://www.answers.com/Q/What_is_the_only_legal_direct_tax_which_was_passed_by_an_amendment_to_the_Constitution", "passage_text": "There are two ways to propose an amendment to the constitution. get 2/3 of both houses in congress to agreethrough a constitutional convention called by 2/3 of state legislatu … res if amendment is approved by either of the two above groups, then it has to be ratified. The 18th Amendment to the Constitution which prohibited the sale of alcohol was passed in 1919 when there were only 48 States in the Union What was the minimum number of States that were needed to?"}, {"url": "https://en.wikipedia.org/wiki/Sixteenth_Amendment_to_the_United_States_Constitution", "passage_text": "The Sixteenth Amendment to the Constitution, ratified in 1913, was written to allow Congress to tax income without the hobbling apportionment requirement. [ . . . ]. Pollock was itself overturned by the Sixteenth Amendment as to apportionment of income.... This amendment exempted income taxes from the constitutional requirements regarding direct taxes, after income taxes on rents, dividends, and interest were ruled to be direct taxes in the court case of Pollock v. Farmers' Loan & Trust Co. (1895). The amendment was adopted on February 3, 1913."}, {"url": "http://www.usa-the-republic.com/revenue/true_history/Chap5.html", "passage_text": "The 16th Amendment did not change this! As we learned, the income tax is an excise tax on corporate profit, and always has been, therefore it does not need to be apportioned. Before the 16th Amendment, an individual's income was NOT taxable, either with apportionment or without. So the 16th Amendment did not confer any new power to Congress, but simply reestablished and clarified the fact that income taxes belong in the category of indirect taxes. The income tax was not a new tax, but was a power possessed by Congress from the beginning. It just had to be levied as an indirect excise tax. It is the without apportionment wording of the 16th Amendment that keeps the income tax in the class of indirect taxes. It is also these words that create the confusion"}, {"url": "http://www.answers.com/Q/What_is_the_only_legal_direct_tax_which_was_passed_by_an_amendment_to_the_Constitution", "passage_text": "What is the only limitation in the constitution as to what can be the basis of an amendment?   It shall not effect the 1st and 4th clause in Article I section 9 of the constitution, and that no state, without its consent, shall be deprived of its equal suffrage … in the senate. The 18th Amendment to the Constitution which prohibited the sale of alcohol was passed in 1919 when there were only 48 States in the Union What was the minimum number of States that were needed to?"}, {"url": "https://en.wikipedia.org/wiki/Sixteenth_Amendment_to_the_United_States_Constitution", "passage_text": "[I]t is immaterial, with respect to Federal income taxes, whether the tax is a direct or an indirect tax. Mr. Wikoff [the taxpayer] relied on the Supreme Court's decision in Pollock v. Farmers' Loan & Trust Co. [ . . . ] but the effect of that decision has been nullified by the enactment of the 16th Amendment. This amendment exempted income taxes from the constitutional requirements regarding direct taxes, after income taxes on rents, dividends, and interest were ruled to be direct taxes in the court case of Pollock v. Farmers' Loan & Trust Co. (1895). The amendment was adopted on February 3, 1913."}]