[{"url": "http://people.sc.fsu.edu/~jburkardt/fun/wordplay/rhyme_slang.html", "passage_text": "Cockney Rhyming Slang. A peculiar kind of slang, known as Cockney rhyming slang, evolved in England. Its distinguishing mark is the use of paired words, or compound phrases, in which the last word rhymes with the word that is actually meant."}, {"url": "http://www.businessballs.com/cockney.htm", "passage_text": "It's a very full dictionary of Cockney rhyming slang, written with humour and lots of useful side information about the roots of these wonderful cockney rhyming words and meanings. Cockney rhyming slang is a significant and colourful presence in the English native language."}, {"url": "http://www.urbandictionary.com/define.php?term=Cockney%20Rhyming%20Slang", "passage_text": "cockney rhyming slang. Cockney rhyming slang is a form of English slang which originated in the East End of London. Many of its expressions have passed into common language, and the creation of new ones is no longer restricted to Cockneys."}, {"url": "http://www.ruf.rice.edu/~kemmer/Words04/usage/slang_cockney.html", "passage_text": "Cockney rhyming slang is a form of English slang which originated in the East End of London. Many of its expressions have passed into common language, and the creation of new ones is no longer restricted to Cockneys."}, {"url": "http://londontopia.net/londonism/fun-london/language-top-100-cockney-rhyming-slang-words-and-phrases/", "passage_text": "Language: Top 100 Cockney Rhyming Slang Words and Phrases. By jonathan 95 Comments. Hot on the heels of our success with our Top 100 Best British Slang Phrases, we thought we’d explore the beauty of Cockney Rhyming Slang next. Rhyming slang is believed to have originated in the mid-19th century in the East End of London, with sources suggesting some time in the 1840s."}, {"url": "http://public.oed.com/aspects-of-english/english-in-use/cockney/", "passage_text": "Home Aspects of English English in use Cockney. Cockney’s not a language it is only a slang And was originated inna England The first place it was used was over East London… Smiley Culture, ‘Cockney Translation’ (1984)."}, {"url": "http://www.businessballs.com/cockney.htm", "passage_text": "Commonly only the first word of the rhyming slang is used, for example, 'butchers' means 'look', whereby the original meaning can be difficult to guess, and in many cases these single slang words are now widely used by people who are unaware of the cockney-rhyming origins."}]