[{"url": "http://www.trowel.com/flamason/what.htm", "passage_text": "A Mason (or Freemason) is a member of a fraternity known as Masonry (or Freemasonry). A fraternity is a group of men (just as a sorority is a group of women) who join together because: 1  There are things they want to do in the world. 2  There are things they want to do inside their own minds.."}, {"url": "http://www.comasonic.org/what-is-masonry/", "passage_text": "Masonry is a fraternal organization; Masonry is an organization that works toward personal and social improvement; Masonry is an organization that works to aid many charities; and Masonry is an organization that takes its “lessons” from practical science and geometry as well as “allegorical stories and dramas”."}, {"url": "https://en.wikipedia.org/wiki/Freemasonry", "passage_text": "Freemasonry is a fraternal organisation that traces its origins to the local fraternities of stonemasons, which from the end of the fourteenth century regulated the qualifications of stonemasons and their interaction with authorities and clients. Masons are members of the organization."}, {"url": "http://www.freemason.com/how-to-join/what-is-freemasonry", "passage_text": "Freemasonry is the oldest, largest and most widely recognized fraternal organization in the world. Founded in London, England in 1717, its current worldwide membership totals 3.6 million members, 1.6 million of which are in North America."}, {"url": "http://www.grandlodgemi.org/about/basics-of-masonry/", "passage_text": "What is a Mason. A Mason is a member of the oldest and largest goodwill fraternity in the world, known as Masonry or Freemasonry. Masonry teaches that each man has a duty to make life better, not just for himself, but for everyone."}, {"url": "https://en.wikipedia.org/wiki/Masonry", "passage_text": "The common materials of masonry construction are brick, building stone such as marble, granite, travertine, and limestone, cast stone, concrete block, glass block, and cob. Masonry is generally a highly durable form of construction. However, the materials used, the quality of the mortar and workmanship, and the pattern in which the units are assembled can significantly affect the durability of the overall masonry"}, {"url": "https://en.wikipedia.org/wiki/Masonry", "passage_text": "Masonry is commonly used for the walls of buildings, retaining walls and buildings. Brick and concrete block are the most common types of masonry in use in industrialized nations and may be either weight-bearing or a veneer."}]