[{"url": "http://www.nyu.edu/pages/mathmol/textbook/measureenergy.html", "passage_text": "Temperature is the measure of heat energy or motion of particles. Absolute zero is the temperature at which all motion of particles stops. Absolute zero is the lowest possible temperature. Absolute zero is -273 degrees on the Celsius scale. The Kelvin temperature scale is based on absolute zero. Measurement of Energy. Heat is the result of the movement of matter. Temperature is the measure of this movement of matter. You can tell the difference between temperature in the winter and summer. Winter is cold and summer is hot. You test the temperature of hot soup by blowing on it and then taking quick tastes"}, {"url": "http://www.eia.gov/emeu/efficiency/definition.htm", "passage_text": "Most of what is defined as energy efficiency is actually energy intensity. Energy intensity is the ratio of energy consumption to some measure of demand for energy services what we call a demand indicator. However, at best, energy-intensity measures are a rough surrogate for energy efficiency. "}, {"url": "http://www.home-energy-metering.com/home-energy-monitor.html", "passage_text": "Home energy monitors can be subdivided into three categories, namely single-point measurement, multi-point measurement and circuit level measurement. Our Smart Meters page organizes the product specification tables in this manner for a better apples-to-apples comparison between home energy monitors. "}, {"url": "https://en.wikipedia.org/wiki/Energy", "passage_text": "For instance, in SI units, energy is measured in joules, and one joule is defined mechanically, being the energy transferred to an object by the mechanical work of moving it a distance of 1 metre against a force of 1 newton. The SI unit of energy rate (energy per unit time) is the watt, which is a joule per second. Thus, one joule is one watt-second, and 3600 joules equal one watt-hour. The CGS energy unit is the erg and the imperial and US customary unit is the foot pound."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/electric/elepe.html", "passage_text": "Electric Potential Energy. Potential energy can be defined as the capacity for doing work which arises from position or configuration. In the electrical case, a charge will exert a force on any other charge and potential energy arises from any collection of charges. The choice of potential equal to zero at infinity is an arbitrary one, but is logical in this case because the electric field and force approach zero there. The electric potential energy for a charge q at r is then. where k is Coulomb's constant."}, {"url": "http://www.eia.gov/emeu/efficiency/measure_discussion.htm", "passage_text": "Energy intensity is defined as the ratio of energy consumption to some measure of demand for energy services. The choice of a measure of demand for energy services (a demand indicator) in efficiency analysis is critical. "}, {"url": "https://en.wikipedia.org/wiki/Zero-point_energy", "passage_text": "Vacuum energy is the zero-point energy of all the fields in space, which in the Standard Model includes the electromagnetic field, other gauge fields, fermionic fields, and the Higgs field. It is the energy of the vacuum, which in quantum field theory is defined not as empty space but as the ground state of the fields. In cosmology, the vacuum energy is one possible explanation for the cosmological constant. A related term is zero-point field, which is the lowest energy state of a particular field. Scientists are not in agreement about how much energy is contained in the vacuum and for what purpose if any it could be used."}, {"url": "http://www.gromacs.org/Documentation/How-tos/Single-Point_Energy", "passage_text": "Table of contents. Computing the energy of a single configuration is an operation that is sometimes useful. The best way to do this with GROMACS is with the mdrun-rerun mechanism, which applies the model physics in the .tpr to the configuration in the trajectory or coordinate file supplied to mdrun. "}, {"url": "https://en.wikipedia.org/wiki/Zero-point_energy", "passage_text": "Zero-point energy, also called quantum vacuum zero-point energy, is the lowest possible energy that a quantum mechanical physical system may have; it is the energy of its ground state. In cosmology, the vacuum energy is one possible explanation for the cosmological constant. A related term is zero-point field, which is the lowest energy state of a particular field. Scientists are not in agreement about how much energy is contained in the vacuum and for what purpose if any it could be used."}]