[{"url": "https://en.wikipedia.org/wiki/Irish_people", "passage_text": "There have been many notable Irish people throughout history. The 6th-century Irish monk and missionary Columbanus is regarded as one of the fathers of Europe, followed by Kilian of Wuerzburg würzburg And vergilius Of. salzburg The population of Ireland is about 6.3 million, but it is estimated that 50 to 80 million people around the world have Irish forebears. Historically, emigration from Ireland has been the result of conflict, famine and economic issues."}, {"url": "http://www.diffen.com/difference/Ethnicity_vs_Race", "passage_text": "The traditional definition of race and ethnicity is related to biological and sociological factors respectively. Race refers to a person's physical characteristics, such as bone structure and skin, hair, or eye color. Another difference between race and ethnicity is related to the ability to self-identify. A person does not choose her race; it is assigned by society based upon her physical features. However, ethnicity is self-identified."}, {"url": "https://en.wikipedia.org/wiki/Irish_people", "passage_text": "The Irish people (Irish: Muintir na hÉireann héireann Or hÉireannaigh) heireannaigh héireannaigh are a nation and ethnic group who originate from the Island of ireland and its. Associated islands ireland has been inhabited 9,000 about 9000 years according to (archaeological Studies See). prehistoric ireland The population of Ireland is about 6.3 million, but it is estimated that 50 to 80 million people around the world have Irish forebears. Historically, emigration from Ireland has been the result of conflict, famine and economic issues."}, {"url": "https://en.wikipedia.org/wiki/Irish_nationality_law", "passage_text": "Irish passports are issued to Irish citizens by the Department of Foreign Affairs in Dublin. Irish nationality law is contained in the provisions of the Irish Nationality and Citizenship Acts 1956 to 2004 and in the relevant provisions of the Irish Constitution. A person may be an Irish citizen through birth, descent, marriage to an Irish citizen or through naturalisation. The law grants citizenship to individuals born in Northern Ireland under the same conditions as those born in the Republic of Ireland."}, {"url": "http://www.irishcentral.com/roots/history/who-were-the-black-irish-92376439-237784721.html", "passage_text": "Another theory of the origin of the term Black Irish is that these people were descendants of Spanish traders who settled in Ireland and even descendants of the few Spanish sailors who were washed up on the west coast of Ireland after the disaster of the Spanish Armada of 1588. The term Black Irish has been in circulation among Irish emigrants and their descendants for centuries. Yet, as a subject of historical discussion, it is almost never referred to in Ireland."}, {"url": "http://www.ireland-information.com/articles/blackirish.htm", "passage_text": "'Black Irish' is often a description of people of Irish origin who had dark features, black hair, dark complexion and eyes. A quick review of Irish history reveals that the island was subject to a number of influxes of foreign people. The Celts arrived on the island about the year 500 B.C. It is also possible that within the various Irish cultures that became established in America that there was a pecking order, a class system that saw some of their countrymen labelled as 'black'. The term 'Black Irish' has also been applied to the descendants of Irish emigrants who settled in the West Indies."}, {"url": "http://www.ireland-information.com/articles/blackirish.htm", "passage_text": "Another theory of the origin of the term 'Black Irish' is that these people were descendants of Spanish traders who settled in Ireland and even descendants of the few Spanish sailors who were washed up on the west coast of Ireland after the disaster that was the 'Spanish Armada' of 1588. It is also possible that within the various Irish cultures that became established in America that there was a pecking order, a class system that saw some of their countrymen labelled as 'black'. The term 'Black Irish' has also been applied to the descendants of Irish emigrants who settled in the West Indies."}, {"url": "https://en.wikipedia.org/wiki/Irish_people", "passage_text": "The Irish were among the first people in Europe to use surnames as we know them today. It is very common for people of Gaelic origin to have the English versions of their surnames beginning with O' or  Mc  (less frequently Mac and occasionally shortened to just Ma at the beginning of the name). The population of Ireland is about 6.3 million, but it is estimated that 50 to 80 million people around the world have Irish forebears. Historically, emigration from Ireland has been the result of conflict, famine and economic issues."}, {"url": "http://theblackirish.blogspot.com/", "passage_text": "The term Black Irish does not refer to people of Irish heritage or descent with black hair. It refers to a class of Irish people, generally the Catholic underclass of Ireland. Black is often used as an unfavorable term in this and similar contexts: e.g., Black '47, the Black Rose. The term Black Irish was used to distinguish from the noble. Irish, i.e. the families of the Protestant Norman English settlers. It has vague ethnic overtones, in the same broad sense that the English called not only the Africans black, but also the Maori, the Australian Aborigines, etc."}, {"url": "http://www.answers.com/Q/What_is_the_origin_of_the_term_%27Luck_of_the_Irish%27", "passage_text": "1 It is an ironic phrase. 2  The Irish have been, and are a spectacularly unlucky race. 3  The luck of the Irish is BAD luck, as any reading of Irish history will document. 1 Some trace the origin of the phrase to the US where, during the exploration for gold in the West, there were a high number of Irish people who got lucky, and found their pot o' gold in the gold fields of California, or were equally prosperous in silver mining. 2  Luck of the Irish does owe its origin to the U.S.A.."}]