[{"url": "http://www.solarchoice.net.au/blog/category/installation-advice/solar-system-prices-2/", "passage_text": "The average solar PV system price nationally continues to sit at about $1.85 per watt for the third month in a row, with prices for specific system sizes also remaining largely unchanged between the months of May, June and July. Average solar PV system prices for July 2015 All prices in the table below include […]. Average residential solar PV system prices remain largely unchanged between May and June 2015, hovering around $1.86/W nationally. What appears as price rises in Melbourne were actually due mainly to a smaller installer sample than the previous month."}, {"url": "http://www.gosolarcalifornia.ca.gov/solar_basics/pricing_financing.php", "passage_text": "Pricing PV Systems and Financing Ideas. The cost of a PV system depends on the system size, equipment options (panels and inverters), permitting costs, and labor costs. Prices vary depending on other factors as well, such as whether your home is new, where the system is installed on your premise, the PV manufacturer, and other factors. For example, using the Clean Power Estimator, a south-facing three-kilowatt system installed at a 30-degree angle on a single-family home with a utility bill of $180 per month in San Francisco would cost a customer an estimated $19,282 with a payback period of 12 years."}, {"url": "http://www.gosolarcalifornia.ca.gov/solar_basics/pricing_financing.php", "passage_text": "That translates to about $34,800 for a four-kilowatt system, the average size of a residential installation. To see real average cost data for solar projects installed near you, visit the Find a Contractor page on California Solar Statistics. For example, using the Clean Power Estimator, a south-facing three-kilowatt system installed at a 30-degree angle on a single-family home with a utility bill of $180 per month in San Francisco would cost a customer an estimated $19,282 with a payback period of 12 years."}, {"url": "http://www.greentechmedia.com/articles/read/solar-pv-system-prices-continue-to-fall-during-a-record-breaking-2014", "passage_text": "However, by the end of 2014, residential rooftop PV system installed prices averaged $3.48 per watt, down from $3.83 cents per watt in the first three months of 2014. This represents the largest absolute decline across any of the market segments. Driven by significant reductions in balance-of-system costs, the cost for a medium-scale commercial system averaged $2.25 per watt by the end of 2014. This is down from $2.53 per watt in the first quarter of 2014."}, {"url": "http://www.greentechmedia.com/articles/read/solar-pv-system-prices-continue-to-fall-during-a-record-breaking-2014", "passage_text": "Because of the enormous scale of its projects, the segment sees system prices that are nearly $2 per watt cheaper than the residential segment. Turnkey installation prices for fixed-tilt PV systems fell from an average of $1.77 per watt in the first quarter of 2014 to $1.55 per watt in the fourth quarter. The report notes significant variance in system pricing in the utility-scale segment, ranging from as high as $2.10 per watt or as low as $1.40 per watt. Driven by significant reductions in balance-of-system costs, the cost for a medium-scale commercial system averaged $2.25 per watt by the end of 2014. This is down from $2.53 per watt in the first quarter of 2014."}, {"url": "http://www.nrel.gov/docs/fy13osti/56776.pdf", "passage_text": "Figure 1. Reported, bottom-up, and analyst-projected average U.S. PV system price over time Note: The reported system price for the residential market is representative of the median price reported for systems less than or equal to 10 kW in size; the median size of these systems is 5.0 kW. Installed prices of U.S. residential and commercial PV systems declined 5%–7% per year, on average, during 1998–2011, and preliminary data suggest that even steeper price reductions, as witnessed during 2009–2011, will continue in 2012."}, {"url": "http://www.gosolarcalifornia.ca.gov/solar_basics/pricing_financing.php", "passage_text": "For example, the total average cost of an installed residential PV system under the California Solar Initiative is $8.70 per Watt (including installation, as of January 2011). For example, using the Clean Power Estimator, a south-facing three-kilowatt system installed at a 30-degree angle on a single-family home with a utility bill of $180 per month in San Francisco would cost a customer an estimated $19,282 with a payback period of 12 years."}, {"url": "http://cleantechnica.com/2015/09/11/average-global-pv-system-costs-drop-40-thanks-balance-systems-innovation/", "passage_text": "According to the report’s findings, blended average module pricing dropped 79% between 2007 and 2014, whereas balance of system costs averaged anywhere between 39% and 64% drops, depending on market sector and region. September 11th, 2015 by Joshua S Hill. A new report from GTM Research has concluded that the average global PV system installed costs will drop a phenomenal 40% by 2020 thanks to balance of systems innovations."}, {"url": "http://dovetailsolar.com/Solar-Electric/Pricing-for-Solar-Electric-Systems.aspx", "passage_text": "Generally, Solar PV systems that generate electricity from sunlight cost between $2.50 to $7 per installed watt. Typically, the larger the system, the lower price per watt. Large commercial systems are typically well below $4 per watt. Residential systems, because of their smaller size are usually somewhat higher. For example, in Ohio a 5 kW residential system with an average monthly production of about 530 kWh would cost approximately $19,000 or about $3.77 per watt. Larger systems have a significantly lower cost per watt."}, {"url": "http://www.nrel.gov/docs/fy13osti/56776.pdf", "passage_text": "Figure 2 also presents an index of global module prices over time, illustrating the close—but imperfect—historical linkages between installed system prices and PV module prices. Over the period shown, average annual module prices fell by $3.62/W in real 2011 dollars, from $4.90/W in 1998 to $1.28/W in 2011. Installed prices of U.S. residential and commercial PV systems declined 5%–7% per year, on average, during 1998–2011, and preliminary data suggest that even steeper price reductions, as witnessed during 2009–2011, will continue in 2012."}]