[{"url": "https://en.wikipedia.org/wiki/Cliefden_Caves", "passage_text": "The Cliefden Caves Geoheritage Site is multifaceted, containing internationally significant Ordovician fossil localities, limestone caves of national significance, a warm spring and tufa dams of state significance and the historically significant site where limestone was first discovered in inland Australia. The outcrop of Cliefden Caves Limestone at the junction of Limestone Creek and the Belubula River was first discovered during the explorations of surveyor George Evans on 24 May 1815, only 2 years after the crossing of the Blue Mountains."}, {"url": "http://www.funtours.com.au/jindabyne/yarrangobillycaves.shtml", "passage_text": "Yarrangobilly Caves NSW. Situated 6.5 kms off the Snowy Mountains Highway, approximately 80 klms from Tumut, Yarrangobilly Caves is a hidden delight for those wishing to go off the beaten track and view some of the most spectacular limestone caverns in Australia. Yarrangobilly Caves are situated between Tumut and Adaminaby, 6.5kms off the Snowy Mountains Highway in the Snowy Mountains of NSW. Plan a day at the Yarrangobilly Caves and join in the guided tours, take a swim in the Thermal Pool or stroll along the river and perhaps see a platypus and other Australian wildlife."}, {"url": "http://www.nationalparks.nsw.gov.au/things-to-do/Show-caves/Yarrangobilly-Caves", "passage_text": "Step into the depths of Yarrangobilly Caves and you’ll discover stalagmites, stalactites and delicate decorations like shawls and cave corals. Explore five caves created from a belt of limestone laid down about 440 million years ago in Koscuiszko National Park. The largest cave, called South Glory, with its lofty chambers, presents a unique opportunity to explore on a self-guided tour. 1 If you want to inspect a particular cave, please phone Yarrangobilly Caves on (02) 6454 9597 to confirm the tour times for that day. 2  Customised tours can be arranged for groups from as small as ten, right through to school excursion of over 100 students."}, {"url": "http://www.nationalparks.nsw.gov.au/things-to-do/Show-caves/Yarrangobilly-Caves", "passage_text": "Get directions. Yarrangobilly Caves in Kosciuszko National Park is one of the most beautiful limestone karst systems in Australia and can be explored by the whole family. 1 If you want to inspect a particular cave, please phone Yarrangobilly Caves on (02) 6454 9597 to confirm the tour times for that day. 2  Customised tours can be arranged for groups from as small as ten, right through to school excursion of over 100 students."}, {"url": "http://www.kids-fun-science.com/limestone-caverns.html", "passage_text": "Limestone caverns form when slightly acid groundwater seeping through limestone rocks dissolves a hole in the rocks. Over time the hole increases in size forming caves that are sometimes miles long. Water dripping into the cave evaporates and calcite dissolved in the water precipitates out to form travertine. Stalactites are icicle-like formations that hang from the ceiling in limestone caves. Stalagmite formation. Below the growing stalactite is a stalagmite."}, {"url": "http://www.smh.com.au/news/new-south-wales/yarrangobilly-caves/2005/02/17/1108500200171.html", "passage_text": "Located 77 km from Tumut, 109 km from Cooma and 975 m above sea level, the caves were formed in a belt of limestone that is 440 million years old. There are an estimated 60 caves in the area, of which four-South Glory Cave, North Glory Cave, Jersey and Jillabenan-are open to the public. 1. South Glory Cave. There is a pleasant walk (it was built by one man, Anthony Bradley, in 1907) to the Glory Hole, a huge cave with a gaping arch facing the Yarrangobilly river. The tour of the cave is self-guided, allowing the visitor to mooch through the caverns reading the plaques and inspecting the formations."}, {"url": "http://www.funtours.com.au/jindabyne/yarrangobillycaves.shtml", "passage_text": "Yarrangobilly Caves Tumut. Yarrangobilly Caves is a series of spectacular limestone caverns located within the Kosciuszko National Park. Yarrangobilly Caves are situated between Tumut and Adaminaby, 6.5kms off the Snowy Mountains Highway in the Snowy Mountains of NSW. Plan a day at the Yarrangobilly Caves and join in the guided tours, take a swim in the Thermal Pool or stroll along the river and perhaps see a platypus and other Australian wildlife."}]