[{"url": "http://neuroscience.uth.tmc.edu/s4/chapter07.html", "passage_text": "The analysis of the anatomical and physical bases of learning and memory is one of the great successes of modern neuroscience. Thirty years ago little was known about how memory works, but now we know a great deal. This Chapter will discuss four issues that are central to learning and memory. The declarative memory system is the system of memory that is perhaps the most familiar. It is the memory system that has a conscious component and it includes the memories of facts and events. A fact like 'Paris is the capital of France', or an event like a prior vacation to Paris."}, {"url": "http://www.memorydr.com/memory.htm", "passage_text": "In this model, the structural components of memory consist of what is called a “sensory store” (where data picked up by your senses is temporarily stored), short-term memory, and long-term memory. Information is first acquired through the senses, where it then enters the short-term memory store. Working memory (which could also be called “memory for now”) contains all that we are conscious of and working on right now. Information is held long enough to make a decision and then either is lost or sent on to storage for later use. If it’s transferred to form a memory for later use, it becomes long-term memory."}, {"url": "http://neuroscience.uth.tmc.edu/s4/chapter07.html", "passage_text": "We have discussed a mechanism for a short-term memory. It is short-term because the memory is transient and that is so because the underlying biochemical changes are transient. The duration of the memory is dependent on how long the various substrate proteins (e.g., membrane channels) are phosphorylated. The declarative memory system is the system of memory that is perhaps the most familiar. It is the memory system that has a conscious component and it includes the memories of facts and events. A fact like 'Paris is the capital of France', or an event like a prior vacation to Paris."}, {"url": "http://www.webmd.com/healthy-aging/rm-quiz-memory", "passage_text": "Details stored in your mind's data banks can be sorted by length: short-term; long-term (or remote); and recent (or working). A short-term memory must have some kind of impact for you to store it. The more ties there are between that memory and your bank of long-term memories, the easier it'll be for you to recall it. 1  Previous. 2  Continue. You might recall one or two events before you were 4, but not much before you were 3. Children begin to identify objects around them (semantic memories) by 10 to 12 months. They remember things that happened earlier in time (episodic memories) by 20 to 24 months."}, {"url": "https://en.wikipedia.org/wiki/Memory", "passage_text": "In contrast, procedural memory (or implicit memory) is not based on the conscious recall of information, but on implicit learning. It can best be summarized as remember how to do something. Procedural memory is primarily employed in learning motor skills and should be considered a subset of implicit memory. "}, {"url": "http://www.simplypsychology.org/long-term-memory.html", "passage_text": "1 Procedural memory is a part of the long-term memory is responsible for knowing how to do things, i.e. memory of motor skills. 2  It does not involve conscious (i.e. it’s unconscious-automatic) thought and is not declarative. 1 For example, procedural memory would involve knowledge of how to ride a bicycle. 2  Semantic memory is a part of the long-term memory responsible for storing information about the world. 3  This includes knowledge about the meaning of words, as well as general knowledge."}, {"url": "http://www.simplypsychology.org/long-term-memory.html", "passage_text": "One of the earliest and most influential distinctions of long term memory was proposed by Tulving (1972). He proposed a distinction between episodic, semantic and procedural memory. 1  Procedural memory is a part of the long-term memory is responsible for knowing how to do things, i.e. memory of motor skills. 2  It does not involve conscious (i.e. it’s unconscious-automatic) thought and is not declarative. 1 For example, procedural memory would involve knowledge of how to ride a bicycle. 2  Semantic memory is a part of the long-term memory responsible for storing information about the world. 3  This includes knowledge about the meaning of words, as well as general knowledge."}, {"url": "http://webspace.ship.edu/cgboer/memory.html", "passage_text": "It is really more an aspect of perception. The next kind of memory is called working memory (or short-term memory). It is the aspect of memory that you are aware of, or can bring back very quickly and easily. It is where you do your thinking and imagining. A decent analogy is to the working memory (RAM) of a computer. The aspect of working memory that has been most studied is nowadays called the phonological loop."}, {"url": "http://www.memorydr.com/memory.htm", "passage_text": "The term “working memory” is often used in place of the term short-term memory because information is typically held at this level to fulfill a work function and then either forgotten or further consolidated into long-term memory. Working memory (which could also be called “memory for now”) contains all that we are conscious of and working on right now. Information is held long enough to make a decision and then either is lost or sent on to storage for later use. If it’s transferred to form a memory for later use, it becomes long-term memory."}]