[{"url": "http://www.thefreedictionary.com/ethnic", "passage_text": "Being a member of a particular ethnic group, especially belonging to a national group by heritage or culture but residing outside its national boundaries: ethnic Hungarians living in northern Serbia. c. Of, relating to, or distinctive of members of such a group: ethnic restaurants; ethnic art. 2. The word ethnic in this context, however, means gentile, coming as it does from the Greek adjective ethnikos, meaning national, foreign, gentile.. The adjective is derived from the noun ethnos, people, nation, foreign people, that in the plural phrase ta ethnē meant foreign nations.."}, {"url": "https://en.wikipedia.org/wiki/Ethnic_group", "passage_text": "An ethnic group or ethnicity is a socially defined category of people who identify with each other based on common ancestral, social, cultural or national experience. ... the named ethnic identities we accept, often unthinkingly, as basic givens in the literature are often arbitrarily, or even worse inaccurately, imposed. Ethnicity and People redirect here. For other uses, see Ethnicity (disambiguation) and People (disambiguation) ."}, {"url": "http://www.definitions.net/definition/ethnic%20group", "passage_text": "Ethnicity or ethnic group is a socially defined category based on common culture or nationality. Ethnicity can, but does not have to, include common ancestry, cuisine, dressing style, heritage, history, language or dialect, physical appearance, religion, symbols, traditions, or other cultural factors. "}, {"url": "http://www.definitions.net/definition/Ethnic", "passage_text": "Princeton's WordNet (5.00 / 1 vote) Rate this definition: ethnic (adj). a person who is a member of an ethnic group. cultural, ethnic, ethnical (adj). denoting or deriving from or distinctive of the ways of living built up by a group of people. Wiktionary (0.00 / 0 votes) Rate this definition: ethnic (Noun). An ethnic person, notably said when a foreigner or member of an immigrant community. ethnic (Noun). An ethnic minority. ethnic (Noun). A heathen, a pagan. ethnic (Adjective)."}, {"url": "http://www.answers.com/Q/What_does_the_word_ethnic_mean", "passage_text": "The word ethnic in this context, however, means gentile, coming as it does from the Greek adjective ethnikos, meaning national, foreign, gentile.. Max Weber once famously remarked that the whole conception of ethnic groups is so complex and so vague that it might be good to abandon it altogether.. The word ethnic can also denote origin by birth or family relationship rather than nationality (ethnic Turks). Word History: When it is said in a Middle English text written before 1400 that a part of a temple fell down and mad a gret distruccione of ethnykis, one wonders why ethnics were singled out for death."}, {"url": "https://en.wikipedia.org/wiki/Ethnic_group", "passage_text": "Ethnicity is an important means by which people may identify with a larger group. Many social scientists, such as anthropologists Fredrik Barth and Eric Wolf, do not consider ethnic identity to be universal. ... the named ethnic identities we accept, often unthinkingly, as basic givens in the literature are often arbitrarily, or even worse inaccurately, imposed. Ethnicity and People redirect here. For other uses, see Ethnicity (disambiguation) and People (disambiguation) ."}, {"url": "https://en.wikipedia.org/wiki/Ethnic_origin", "passage_text": "(January 2013). The concept of ethnic origin is an attempt to classify people, not according to their current nationality, but according to commonalities in their social background. "}, {"url": "http://www.thefreedictionary.com/ethnic", "passage_text": "2. being a member of an ethnic group, esp. a group that is a minority within a larger society: ethnic Chinese in San Francisco. 3. belonging to or deriving from the cultural traditions of a people or country: ethnic dances. 4. Obs. pagan; heathen. 5. a member of an ethnic group. [1325–75; ethnik ethnicus ethnikos. ethnikós The word ethnic in this context, however, means gentile, coming as it does from the Greek adjective ethnikos, meaning national, foreign, gentile.. The adjective is derived from the noun ethnos, people, nation, foreign people, that in the plural phrase ta ethnē meant foreign nations.."}, {"url": "http://www.answers.com/Q/What_does_the_word_ethnic_mean", "passage_text": "Confidence votes 11. Ethnic is a noun or adjective describing a social group that recognizes its members have a common national or cultural tradition. Ethnic cloths or other items are items with the distinct (usually decorative or styalistic) characteristics of those used by a particular ethnic group. The word ethnic can also denote origin by birth or family relationship rather than nationality (ethnic Turks). Word History: When it is said in a Middle English text written before 1400 that a part of a temple fell down and mad a gret distruccione of ethnykis, one wonders why ethnics were singled out for death."}, {"url": "http://www.answers.com/Q/What_does_ethnicity_mean", "passage_text": "Making the world better, one answer at a time. Ethnicity means an identification with a certain race or background. Ethnic groups are defined by country, region, and heritage. Ethnicity means in relation to things that are ethnic such as cultural ideas and traits. The origin of race is a term that is related to different animals, such as the Human race, or a race of dogs, or cats. It is specifically related to the fundamental difference … s between different species."}]