[{"url": "http://www.chinamaps.org/china/provincemaps/zhejiang.html", "passage_text": "Zhejiang Province, abbreviated as Zhe or Dian in Chinese, is located in the coastal area of southeast China. It covers an area of over 100,000 square kilometers, and has a population of 46.02 million. The capital city of Zhejiang Province is Hangzhou."}, {"url": "http://www.chinatravel.com/zhejiang/", "passage_text": "The capital of Zhejiang Province is the city of Hangzhou, site of the 2010 Asian Games and home to the historically famous West Lake, and also a city through which flows the Crooked River, now renamed the Qiantang River. Zhejiang Province has a relatively long Chinese history, as will be seen presently."}, {"url": "http://www.mapsofworld.com/china/provinces/zhejiang/yiwu-zhejiang.html", "passage_text": "Yiwu City. Yiwu is a city of China situated 100 km south to the city of Hangzhou which is the capital of Zhejiang Province. It is a hilly urban area. This city was established in the dynasty of Quin in 222 BC. Soon it became an economically strong city. In 1995, Yiwu ranked 47 th among the 100 economically strong Chinese cities."}, {"url": "http://www.goodcantrading.com/Yiwu-City/", "passage_text": "Yiwu was called Wushang in history, it's belong to Jinhua, Zhejiang province, 58.15km from north to south, 44.41kg from east to west, occupy 1105 sqaure meters, have population 753312, include minority nationality 99146, Yiwu is one of the four centre city of Zhejiang province."}, {"url": "http://www.mapsofworld.com/china/provinces/zhejiang/", "passage_text": "it course through Hangzhou, which is the capital city of Zhejiang. To the north of Zhejiang lies the Shanghai and Jiangsu, on the northwest lies the Anhui, fujian lies to the south of Zhejiang anf j iangx i lies to the west of Zhejiang. East china sea borders the eastern par"}, {"url": "http://www.maps-of-china.net/c_hangzhou_map.html", "passage_text": "Hangzhou, the capital city of East China's Zhejiang Province, and one of the seven capitals (the others being Van, Luoyang, Kaifeng, Anyang, Beijing, and Nanjing) in ancient China, is endowed with irritable charm and vigour as an ideal destination for tourists from home and overseas."}, {"url": "http://www.mapsofworld.com/china/provinces/zhejiang/yiwu-zhejiang.html", "passage_text": "Yiwu is a city of China situated 100 km south to the city of Hangzhou which is the capital of Zhejiang Province. It is a hilly urban area. This city was established in the dynasty of Quin in 222 BC. Soon it became an economically strong city. In 1995, Yiwu ranked 47 th among the 100 economically strong Chinese cities."}]