[{"url": "http://medical-dictionary.thefreedictionary.com/granuloma", "passage_text": "a form characterized by numerous dilated blood vessels. tuberculous granuloma. the lesion of tuberculosis and the prototype of granulomatous inflammation. It is composed of histiocytes and epithelioid cells surrounded by giant cells of the Langhans type, lymphocytes and fibroblasts. pyogenic granuloma a benign, solitary nodule resembling granulation tissue, found anywhere on the body, commonly intraorally, usually at the site of trauma as a response of the tissues to a nonspecific infection."}, {"url": "http://www.mayoclinic.org/granuloma/expert-answers/FAQ-20057838", "passage_text": "A granuloma is a small area of inflammation in tissue. Granulomas are most often the result of an infection and most frequently occur in the lungs, but can occur in other parts of the body as well. Granulomas are often found incidentally on a chest X-ray done for some other reason."}, {"url": "http://www.mrcophth.com/pathology/granuloma.html", "passage_text": "Note the presence of giant cells. The granulomatous lesions in this disorder are typically non-caseating. This is in constrast to TB granuloma which causes casating granuloma (slides with TB granuloma is uncommon in MRCOphth). A TB granuloma showing central necrosis (caseating granuloma) and the presence of giant cells. In addition, the macrophages may fuse together to form multinucleate giant cells (different types of inciting materials may produce different giant cells). Granulomatous lesion typically occurs when the usual acute inflammatory reaction involving neutrophils could not remove the inciting agent."}, {"url": "http://medical-dictionary.thefreedictionary.com/granuloma", "passage_text": "A granuloma developing at the tip of a tooth root, usually the result of pulpitis. It consists of a proliferating mass of chronic inflammatory tissue and possibly epithelial nests or colonies of bacteria. pyogenic granuloma a benign, solitary nodule resembling granulation tissue, found anywhere on the body, commonly intraorally, usually at the site of trauma as a response of the tissues to a nonspecific infection."}, {"url": "https://en.wikipedia.org/wiki/Granuloma", "passage_text": "Granuloma (plural granulomas or granulomata) is an inflammation found in many diseases. It is a collection of immune cells known as histiocytes. In pathology, a granuloma is an organized collection of macrophages. In medical practice, doctors occasionally use the term granuloma loosely to mean a small nodule. Since a small nodule can represent anything from a harmless nevus to a malignant tumor, this usage of the term is not very specific"}, {"url": "http://ghr.nlm.nih.gov/condition/chronic-granulomatous-disease", "passage_text": "Chronic granulomatous disease is a disorder that causes the immune system to malfunction, resulting in a form of immunodeficiency. Immunodeficiencies are conditions in which the immune system is not able to protect the body effectively from foreign invaders such as bacteria and fungi. Individuals with chronic granulomatous disease have recurrent bacterial and fungal infections."}, {"url": "http://mrdoctor.org/granulomatous-inflammation-symptoms-causes-treatment/", "passage_text": "Quite the opposite of TB granuloma is sarcoidosis with granulomatous lesions that are classically non-caseating. The recognition of the presence of necrosis in granulomatous inflammation is significant since when a granuloma contains necrosis, this means the cause of the inflammation is an infectious agent. On the whole, the type of granuloma that develops from the above problems is a calcified granuloma. This type involves calcium deposition and commonly takes a longer time to surface. One of the important things that must be established early on is whether these granulomas involve necrosis or not."}, {"url": "https://en.wikipedia.org/wiki/Granuloma", "passage_text": "Pulmonary hyalinizing granuloma is a lesion characterized by keloid-like fibrosis in the lung, and is not granulomatous. Similarly, radiologists often use the term granuloma when they see a calcified nodule on X-ray or CT scan of the chest. In pathology, a granuloma is an organized collection of macrophages. In medical practice, doctors occasionally use the term granuloma loosely to mean a small nodule. Since a small nodule can represent anything from a harmless nevus to a malignant tumor, this usage of the term is not very specific"}, {"url": "http://medical-dictionary.thefreedictionary.com/granuloma", "passage_text": "giant cell reparative granuloma, central a lesion of the jaws composed of a spindle cell stroma punctuated by multinucleate giant cells, considered by most to be a central lesion of the bone of the jaws, presenting an inflammatory reaction to injury or hemorrhage. pyogenic granuloma a benign, solitary nodule resembling granulation tissue, found anywhere on the body, commonly intraorally, usually at the site of trauma as a response of the tissues to a nonspecific infection."}]