[{"url": "http://beyondpenguins.ehe.osu.edu/issue/icebergs-and-glaciers/glaciers-earths-rivers-of-ice", "passage_text": "Simply stated, a glacier is a large, slow-moving mass of ice. While there are many types of glaciers, they can be divided into two categories: alpine and continental. Alpine glaciers are found in a mountainous region and flow down valleys."}, {"url": "http://geography.about.com/od/geographyintern/a/glaciers.htm", "passage_text": "Types of Glaciers. Alpine Glacier-Most glaciers that form in a mountain are known as alpine glaciers. There are several subtypes of alpine glaciers: 1  Cirque: a cirque is a bowl shaped hollow at the head of a valley. 2  Within a cirque lies a snowfield, the place where snow accumulates to form a cirque glacier."}, {"url": "http://www.nature.org/ourinitiatives/regions/northamerica/unitedstates/indiana/journeywithnature/how-glaciers-shaped-indiana.xml", "passage_text": "1 When two alpine glaciers merge together at the base of a mountain it is called a piedmont glacier. 2  If the piedmont flows into the sea, it is called a tidewater glacier. 3  Valley glaciers are formed in mountain valleys. 4  Cirque glaciers are confined to the valley."}, {"url": "http://beyondpenguins.ehe.osu.edu/issue/icebergs-and-glaciers/glaciers-earths-rivers-of-ice", "passage_text": "The Greenland and Antarctic ice sheets are examples of continental glaciers. Smaller masses of ice, called ice caps, are also considered continental glaciers. Alpine glaciers are further classified by their shape as well as the surface they flow onto."}, {"url": "https://nsidc.org/cryosphere/glaciers/questions/formed.html", "passage_text": "Glaciers begin to form when snow remains in the same area year-round, where enough snow accumulates to transform into ice. Each year, new layers of snow bury and compress the previous layers. This compression forces the snow to re-crystallize, forming grains similar in size and shape to grains of sugar."}, {"url": "http://www.onegeology.org/eXtra/kids/earthProcesses/glaciers.html", "passage_text": "Glacial movement. There are different types of glaciers: Alpine glaciers, which begin high up in the mountains in bowl-shaped hollows called cirques. Continental glaciers, which are continuous masses of ice that are much larger than alpine glaciers."}]