[{"url": "http://www.mayoclinic.org/diseases-conditions/acne/basics/causes/con-20020580", "passage_text": "These areas of skin have the most oil (sebaceous) glands. Acne occurs when hair follicles become plugged with oil and dead skin cells. Hair follicles are connected to oil glands. These glands secrete an oily substance (sebum) to lubricate your hair and skin."}, {"url": "https://www.sharecare.com/health/acne-skin-pimples/what-is-acne", "passage_text": "Acne is an inflammatory disease of the sebaceous glands (oil producing) and hair follicles of the skin that is marked by the eruption of pimples or pustules, especially on the face. Acne is considered a normal response to abnormal levels of the male hormone testosterone."}, {"url": "https://www.sharecare.com/health/acne-skin-pimples/what-is-acne", "passage_text": "These hormones increase the production of skin oils (sebum) and the glands that make them, causing the acne to flare. High sugar and carbs in the diet can stimulate increased levels of these hormones and increase acne formation. In addition, scratching or irritating a pimple causes it to get inflamed."}, {"url": "http://www.answers.com/Q/Which_inflammatory_skin_disorder_is_caused_by_excess_sebum_production", "passage_text": "Sebum is an oily substance that is naturally secreted from the  sebacious glands in your hair and skin that keeps your skin and  hair moisturized. Edit."}, {"url": "http://www.innerbody.com/diseases-conditions/acne", "passage_text": "Acne begins when hair follicles become clogged with excess sebum, dead skin cells and/or bacteria. Bumps develop on the skin surface as these waste products build up in the clogged follicle. In some cases, the blemish becomes infected, causing redness and tenderness."}, {"url": "https://quizlet.com/4064891/disorders-and-diseases-of-the-skin-flash-cards/", "passage_text": "an open comedo or blackhead; a mass of hardened sebum and skin cells in a hair follicle. When the follicle is filled with an excess of oil, a blackhead forms. It is dark because it is exposed to oxygen and oxidizes. Closed comedones do not a have a follicular opening and are called milia or whiteheads."}, {"url": "https://www.sharecare.com/health/acne-skin-pimples/what-is-acne", "passage_text": "Acne is an inflammatory condition of the skin partially caused by increased sebum production and an abnormality of the bacteria found normally on the skin. The result can be red and enlarged areas on the skin, whiteheads or blackheads."}]