[{"url": "https://simple.wikipedia.org/wiki/William_Shakespeare", "passage_text": "William Shakespeare (26 April 1564 (baptised) – 23 April 1616) was an English author who wrote 37 plays and also 2 very long poems in his lifetime. He lived in Stratford-upon-Avon, in Warwickshire, England. His plays are still performed today. He is often quoted in modern writing. "}, {"url": "http://blogs.transparent.com/english/who-is-shakespeare/", "passage_text": "William Shakespeare was born in England in 1564 and died in 1616. He was an English poet and playwright**, who is considered by many to be the greatest writer in the English language. His written works include 38 plays, 154 sonnets, and a number of poems. Shakespeare wrote most of his plays and poems between 1589 and 1613. His early plays were often comedies and historical in nature."}, {"url": "https://en.wikipedia.org/wiki/William_Shakespeare", "passage_text": "William Shakespeare (/ˈʃeɪkspɪər/ ; 26 April 1564 (baptised) – 23 April 1616) was an English poet, playwright, and actor, widely regarded as the greatest writer in the English language and the world's pre-eminent dramatist. His plays have been translated into every major living language and are performed more often than those of any other playwright. Shakespeare was born and brought up in Stratford-upon-Avon, Warwickshire. At the age of 18, he married Anne Hathaway, with whom he had three children: Susanna, and twins Hamnet and Judith."}, {"url": "http://tardis.wikia.com/wiki/William_Shakespeare", "passage_text": "48,769 articles in progress. William Shakespeare was known as the greatest poet and playwright in the history of England and one of the greatest in human history. The Doctor considered him the most human human that ever lived. He also had numerous encounters with the Doctor and was attracted to Martha Jones and possibly the Tenth Doctor himself. "}, {"url": "http://www.gradesaver.com/author/shakespeare/", "passage_text": "William Shakespeare is arguably the most famous writer of the English language, known for both his plays and sonnets. Though much about his life remains open to debate due to incomplete evidence, the following biography consolidates the most widely-accepted facts of Shakespeare's life and career. Town records indicate that William Shakespeare was John and Mary's third child. His birth is unregistered, but legend pins the date as April 23, 1564, possibly because it is known that he died on the same date 52 years later. In any event, William's baptism was registered with the town of Stratford on April 26, 1564."}, {"url": "http://williamshakespeare.cfsites.org/", "passage_text": "William Shakespeare is one of, if not the most well known theater writers. He wrote many poems, sonnets, and plays. Some of his more famous plays are Romeo and Juliet, Julius Caesar, and Hamlet. Shakespeare started out writing plays for the Lord Chamberlain Company in 1594. He is known to have played in some of their plays and there is even a legend that he played as the ghost in Hamlet. Shakespeare was probably one of the original members of the Company. Shakespeare spent most of his life working there."}, {"url": "http://www.biography.com/people/william-shakespeare-9480323", "passage_text": "Synopsis. William Shakespeare was baptized on April 26, 1564, in Stratford-upon-Avon, England. From roughly 1594 onward he was an important member of the Lord Chamberlain’s Men company of theatrical players. Written records give little indication of the way in which Shakespeare’s professional life molded his artistry. William Shakespeare married Anne Hathaway on November 28, 1582, in Worcester, in Canterbury Province. Hathaway was from Shottery, a small village a mile west of Stratford. William was 18 and Anne was 26, and, as it turns out, pregnant. Their first child, a daughter they named Susanna, was born on May 26, 1583."}]