[{"url": "https://en.wikipedia.org/wiki/List_of_Australian_place_names_of_Aboriginal_origin", "passage_text": "The name derives from the Bandjalang word meaning camping place.. Place names in Australia have names originating in the Australian Aboriginal languages for three main reasons: 1  Historically, white explorers and surveyors may have asked local Aboriginal people the name of a place, and named it accordingly. 2  Where they did not ask, they may have heard the place was so-named."}, {"url": "http://gettingdownunder.com/origin-and-history-of-the-name-australia/", "passage_text": "0. The name Australia is derived from the Latin australis, meaning southern. Legends of an “unknown southern land” (terra australis incognita) date back to the Roman times and were commonplace in medival geography, but they were not based on any actual knowledge of the continent. "}, {"url": "http://www.babynology.com/australian-boynames-a0.html", "passage_text": "List of Australian baby names, Australian baby boy names (male), girl names (female) & Australian names meanings has been compiled from various resources. Please use this list of Australian baby names only for reference/idea to name your kid/child. "}, {"url": "https://en.wikipedia.org/wiki/Australia", "passage_text": "Australia (/ɒˈstreɪliə/ , /ə-/ , colloquially /-jə/), officially the Commonwealth of Australia, is an Oceanian country comprising the mainland of the Australian continent, the island of Tasmania, and numerous smaller islands. Australia is a member of the United Nations, G20, Commonwealth of Nations, ANZUS, Organisation for Economic Co-operation and Development (OECD), World Trade Organization, Asia-Pacific Economic Cooperation, and the Pacific Islands Forum."}, {"url": "http://www.sheppardsoftware.com/Oceaniaweb/factfile/Unique-facts-Oceania2.htm", "passage_text": "usa | world | animals | vocabulary | health | science | math | history. Origin of the name Australia. The name Australia derives from Latin australis meaning southern, and dates back to 2nd century legends of an unknown southern land (that is terra australis incognita). The explorer Matthew Flinders named the land Terra Australis, which was later abbreviated to the current form. "}, {"url": "https://en.wikipedia.org/wiki/Australia", "passage_text": "Australia is a developed country and one of the wealthiest in the world, with the world's 12th-largest economy. In 2014 Australia had the world's fifth-highest per capita income. Australia's military expenditure is the world's 13th-largest. Australia is a member of the United Nations, G20, Commonwealth of Nations, ANZUS, Organisation for Economic Co-operation and Development (OECD), World Trade Organization, Asia-Pacific Economic Cooperation, and the Pacific Islands Forum."}, {"url": "http://www.thinkbabynames.com/meaning/0/Australia", "passage_text": "Australia /aus-tra-lia/ [4 sylls.] as a girls' name is of Latin origin, and the meaning of Australia is southern place. Kreatif forms: Anstralia, Arstralia, Australea. Australia is a rare first name for females and also a unique surname for all people. (2000 U.S. Census). Displayed below is the birth name popularity of Australia for girls. Australia has yet to be recorded in the Top 1000 thus far"}, {"url": "http://www.babynology.com/australian_babynames.html", "passage_text": "Australian Baby Names. Australian baby names have a powerful influence of native groups, languages, and strong cultural blend. Their name trend resembles British and American names with distinctive flavor. Babynology list contains most famous, uncommon, unique, unusual, cute, girl and boy baby names. The site offers more than a thousand varieties of Australian names of babies with their meaning, origin and gender. Check out the Babynology list for Australian baby names alphabetically to find that perfect baby name. List of Australian baby names, Australian baby boy names (male), girl names (female) & Australian names meanings has been compiled from various resources. Please use this list of Australian baby names only for reference/idea to name your kid/child"}]