[{"url": "http://www.expeditions.udel.edu/extreme08/geology/largestocean.html", "passage_text": "The Pacific Ocean is the largest of the world’s five oceans, followed by the Atlantic Ocean, Indian Ocean, Southern Ocean, and Arctic Ocean. It covers an area of about 155 million square kilometers (about 60 million square miles). "}, {"url": "http://www.top1us.com/largest-sea.html", "passage_text": "Bering Sea is in second place as the largest sea. Bering Sea is part of the Pacific Ocean. Bering Sea consists of a deep water basin, which then rises through a narrow slope into the shallower water on the continent. You can find the Tasman Sea in the eighth place as the largest sea. Tasman Sea is the size of the largest ocean in between Australia and New Zealand, has a distance of 2000 kilometers (1250 miles). Located in the southwest Pacific Ocean. Sea was discovered by Dutch inventor, Abel Janszoon Tasman, the first European record for visiting New Zealand and Tasmania. 7"}, {"url": "http://www.top1us.com/largest-sea.html", "passage_text": "Philippine Sea. Philippine Sea is the largest sea in the world. Philippine Sea is a marginal sea east and north of the Philippines occupying an estimated surface area of 2 million km ² (5 million km ²) in the western North Pacific Ocean. Philippine Sea is the world’s largest ocean. This is largest sea. You can find the Tasman Sea in the eighth place as the largest sea. Tasman Sea is the size of the largest ocean in between Australia and New Zealand, has a distance of 2000 kilometers (1250 miles). Located in the southwest Pacific Ocean. Sea was discovered by Dutch inventor, Abel Janszoon Tasman, the first European record for visiting New Zealand and Tasmania. 7"}, {"url": "http://www.diffen.com/difference/Ocean_vs_Sea", "passage_text": "edit Area. Oceans cover 71% of the Earth's surface, and contain 97 percent of the planet's water. The Pacific Ocean is the largest ocean covering an area of 64,186,000 square miles and the Mediterranean Sea is the largest sea with an area of 1,144,800 square miles. In fact even the world’s smallest ocean Arctic Ocean (5,427,000 square miles) is larger than the Mediterranean. "}, {"url": "http://geography.about.com/od/locateplacesworldwide/tp/fiveoceans.htm", "passage_text": "1. Pacific Ocean. The Pacific Ocean is by far the world's largest ocean at 60,060,700 square miles (155,557,000 sq km). According to the CIA World Factbook, it covers 28% of the Earth and is equal in size to nearly all of the land area on the Earth. The Indian Ocean is the world's third-largest ocean and it has an area of 26,469,900 square miles (68,566,000 sq km). It is located between Africa, the Southern Ocean, Asia and Australia. The Indian Ocean has an average depth of 13,002 feet (3,963 m) and the Java Trench is its deepest point at -23,812 feet (-7,258 m)."}, {"url": "http://www.factofun.com/top-10-largest-seas-in-the-world/", "passage_text": "The Bering Sea. A marginal sea of the Pacific Ocean, the Bering Sea is separated by the Alaska Peninsula from the Gulf of Alaska. Covering an area of 2,291,900 sq. km, it was named after Vitus Bering who explored it in 1728 as the navigator sailed to the Arctic Ocean from the Pacific Ocean. "}, {"url": "https://en.wikipedia.org/wiki/Pacific_Ocean", "passage_text": "The Pacific Ocean. The Pacific Ocean is the largest of the Earth 's oceanic divisions. It extends from the Arctic Ocean in the north to the Southern Ocean (or, depending on definition, to Antarctica) in the south and is bounded by Asia and Australia in the west and the Americas in the east. At 165.25 million square kilometers (63.8 million square miles) in area, this largest division of the World Ocean —and, in turn, the hydrosphere —covers about 46% of the Earth's water surface and about one-third of its total surface area, making it larger than all of the Earth's land area combined."}, {"url": "https://en.wikipedia.org/wiki/Pacific_Ocean", "passage_text": "Along the Pacific Ocean's irregular western margins lie many seas, the largest of which are the Celebes Sea, Coral Sea, East China Sea, Philippine Sea, Sea of Japan, South China Sea, Sulu Sea, Tasman Sea, and Yellow Sea. At 165.25 million square kilometers (63.8 million square miles) in area, this largest division of the World Ocean —and, in turn, the hydrosphere —covers about 46% of the Earth's water surface and about one-third of its total surface area, making it larger than all of the Earth's land area combined."}, {"url": "http://www.livescience.com/32621-what-is-the-biggest-ocean.html", "passage_text": "The Pacific Ocean is the largest body of water on Earth, covering approximately 155 million square kilometers (59 million square miles), according to the National Oceanic and Atmospheric Administration (NOAA). Located between the Southern Ocean, Asia, Australia and the Americas, the Pacific Ocean occupies about one-third of the Earth's surface. Containing almost twice as much as the world's second largest body of water, the Atlantic Ocean, the Pacific Ocean holds more than half of the Earth's open water supply."}]