[{"url": "https://uk.answers.yahoo.com/question/index?qid=20061219123246AAkquJd", "passage_text": "RE: What does &#39;homologation&#39; mean in the context of car history? I&#39;ve recently come across this word in a number of Classic Car articles, but the context in which the word appears gives very few clues as to it&#39;s meaning. I've recently come across this word in a number of Classic Car articles, but the context in which the word appears gives very few clues as to it's meaning."}, {"url": "https://en.wikipedia.org/wiki/Homologation", "passage_text": "Homologation (Greek homologeo, ὁμολογέω, to agree) is the granting of approval by an official authority. This may be a court of law, a government department, or an academic or professional body, any of which would normally work from a set of strict rules or standards to determine whether such approval should be given."}, {"url": "http://ateupwithmotor.com/terms-technology-definitions/homologation/", "passage_text": "This process is called homologation, derived from the Greek word homologeo, meaning “to agree.”. Homologation is a prerequisite for qualification, not a substitute for it. A car might be properly homologated and still be disqualified for having non-homologated components or modifications forbidden by the rules. Homologation seems to be the best way to ensure racing efforts follow through on their promise that racing developments can help make better street cars. In the best cases, tweaks are made to the design of the base car to help the race version: things like engine configurations or chassis design."}, {"url": "http://articles.economictimes.indiatimes.com/2003-12-08/news/27544490_1_homologation-car-imports-model", "passage_text": "Homologation is the process of certifying that a particular car is roadworthy and matches certain specified criteria laid out by the government for all vehicles made or imported into that country. Homologation in India is expensive and time consuming because the authorised body often has to begin by buying the equipment required to test technology-rich cars. Also, the rush for certification means that the authorities sometimes don't have the capacity to handle the volumes."}, {"url": "https://en.wikipedia.org/wiki/Homologation_(motorsport)", "passage_text": "In motorsports, homologation is the approval process through which a vehicle, a race track, or a standardised part is required to go for certification to race in a given league or series. Some sports cars are released to the public for the express purpose of meeting the homologation guidelines of a particular series or several series. In such cases, numbers manufactured are often just enough to meet the minimum requirement for homologation by the racing series for which the vehicle was designed."}, {"url": "http://searchcio.techtarget.com/definition/homologation", "passage_text": "Oracle BPM. Homologation (from the verb homologate, meaning to approve or confirm officially) is the process of certifying or approving a product to indicate that it meets regulatory standards and specifications, such as safety and technical requirements. In English-speaking jurisdictions, homologation is often referred to as type approval or certificate of conformity, because homologating a product entails certifying that it meets the requirements specific to its type."}, {"url": "http://www.definitions.net/definition/homologation", "passage_text": "Homologation is a technical term, derived from the Greek homologeo for to agree, which is generally used in English to signify the granting of approval by an official authority. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061219123246AAkquJd", "passage_text": "Report Abuse. All volume production road vehicles go through a process of homologation which is a series of tests, calculations, measurements, etc. to ensure that they meet the legal requirements for that type of vehicle in the country in which they are to be sold. I've recently come across this word in a number of Classic Car articles, but the context in which the word appears gives very few clues as to it's meaning."}]