[{"url": "http://motherhood.modernmom.com/difference-between-gladiola-iris-9777.html", "passage_text": "Flowers. The flowers of both the iris and the gladiolus are perhaps the most the most obvious factor of identification. Iris flowers have standards or upper petals, falls that are lower petals or sepals, crests or tiny petal-like structures in the center, and sometimes beards or furry section on the falls."}, {"url": "http://www.extension.umn.edu/garden/yard%2Dgarden/flowers/growing-gladiolus/", "passage_text": "(A one-inch corm would be planted four inches deep, a 1 1/4-inch corm, five inches deep, and so on.) Space the corms six to eight inches apart. Label your corms and put in stakes or other support structures when you plant them. Gladiolus flower spikes blow over easily in the wind. If you stake them first thing, you can avoid the likelihood of damaging their roots with the stakes."}, {"url": "http://www.pacificbulbsociety.org/pbswiki/index.php/Gladiolus", "passage_text": "Gladiolus plants are subjected to Thrips, especially the ones that grow and bloom in warm weather. The standard reference book for the South African Gladiolus species is probably Goldblatt & Manning's hefty Gladiolus in Southern Africa. Another useful reference is Gladiolus in Tropical Africa."}, {"url": "http://gardenhobbies.com/bulbs/gladiolus.html", "passage_text": "Here's another interesting fact: technically, gladiolus are not bulbs. They are corms. These corms are related to bulbs, but not quite the same. Most of us refer to them as bulbs, and that's okay."}, {"url": "http://www.almanac.com/plant/gladiolus", "passage_text": "1 Plant gladiolus bulbs in the spring once danger of frost has passed and the soil has warmed. 2  Ready your garden by using a garden fork or tiller and loosen the soil to about 12 to 15 inches deep."}, {"url": "http://gardenhobbies.com/bulbs/gladiolus.html", "passage_text": "How to Grow Gladiolus. Gladiolus are also commonly called: Gladiola, Glads, and Sword Lilly. Call them what you will. Gardeners and homeowners just love to grow Gladiolus. They are an easy to grow plant. Their tall, bright spikes makes a bold statement in the flower garden, and in indoor arrangements, too."}, {"url": "http://www.pacificbulbsociety.org/pbswiki/index.php/Gladiolus", "passage_text": "Gladiolus. Gladiolus is the largest genus in the Iridaceae family with 255 species. It has been studied by taxonomists and now includes Acidanthera, Homoglossum, Anomalesia, and Oenostachys along with species once included in Antholyza. The geographic range includes Africa, Madagascar, Europe, and the Middle East. Gladiolus has been a treasured flower in many areas of the world. Many of the fancy hybrids that are popular garden plants had their origins in some of the South African species."}]