[{"url": "http://www.realsimple.com/food-recipes/shopping-storing/food/how-long-can-you-refrigerate-freeze-food", "passage_text": "If you’re saving food in plastic bags, be sure to follow the U.S. Department of Agriculture and Food and Drug Administration guidelines for safe storage. Frozen foods can be stored indefinitely, but the flavor can change when food is stored past the time limits below. Refrigerator: 3 to 5 days. Freezer: 6 to 12 months. "}, {"url": "http://www.rd.com/health/healthy-eating/how-long-can-you-store-meat-in-the-fridge-or-freezer/", "passage_text": "Red meat and pork can remain in the refrigerator up to 5 days and can be frozen for 4-12 months. Leftover cooked meat will last 3-4 days in the refrigerator and 2-6 months in the freezer. Ground meats (beef, veal, pork, or poultry) can be refrigerated for 1-2 days and frozen for 3-4 months. Lunchmeats and hot dogs will last two weeks in the refrigerator unopened and should be eaten within 3-5 days of opening (hot dogs can go a couple of days longer). In the freezer they’ll last 1-2 months. Bacon is safe to eat for up to a week in the fridge—but raw sausage should be eaten within two days. Both can be frozen for a month, and some sausage will freeze for twice as long."}, {"url": "http://cooking.stackexchange.com/questions/12440/food-safety-concerns-regarding-cooked-steak-stored-in-the-fridge", "passage_text": "I generally only cook steak medium-rare, and I am able to leave the leftovers in the refrigerator for up to 6 days or so (most recommendations say 3-5 days) and have never had any issues as long as it's wrapped properly. What is important however, is to store the steak in the refrigerator right after you've cooked it and cut it so that it doesn't sit out at room temperature for too long. share | improve this answer. answered Feb 21 '11 at 19:11. John Rasch."}, {"url": "http://www.stilltasty.com/fooditems/index/16502", "passage_text": "1 Unopened meat may be kept in its original store packaging when refrigerating — do not open package until ready to use. 2  If freezing, place in freezer before the number of days shown for refrigerator storage has elapsed. 1 If freezing for longer than 2 months, overwrap original store packaging with airtight heavy-duty aluminum foil, plastic wrap, or freezer paper or place the package inside a heavy-duty freezer bag in order to prevent freezer burn."}, {"url": "http://www.answers.com/Q/How_long_will_raw_steak_stay_fresh_in_the_refrigerator", "passage_text": "Meats are kept better in the freezer. Meats can be kept in the refrigerator for 3 to 4 days if raw and 1 to 2 days longer if cooked. Always place cooked meats in an airt … ight container. 4 people found this useful. Kodiakcathy. It depends on where you purchase your steak since some distributors add preservatives to their meat and some don't. The rule is 40deg. Fahrenheit to 140deg. Fahrenheit. If your refrigerator is close to 40deg. Fahrenheit you will only want to keep your steak in the fridge for 12 hours max."}, {"url": "http://cooking.stackexchange.com/questions/1511/how-long-is-it-safe-to-marinate-meat", "passage_text": "Five days in the refrigerator is definitely stretching it for chicken-usually no more than a few days is recommended, and that's assuming it was fresh when you bought it (not a day before the sell-by date). Even if it's safe, it's not going to be very good. "}, {"url": "http://stilltasty.com/questions/index/184/page:2", "passage_text": "Answer: If you thawed the steaks in the refrigerator, you’ve got some time. Steak that’s been defrosted in the fridge can be safely kept for an additional 3 to 5 days in the refrigerator before cooking, says the U.S. Department of Agriculture. You also can safely refreeze the steak within that same timeframe. On the other hand, if you thawed the steak in the microwave or in cold water, the USDA advises that you cook it immediately. That’s because with either method, the steak could have at least temporarily warmed up to a temperature higher than 40°F."}, {"url": "http://www.thekitchn.com/how-long-is-it-safe-to-keep-raw-meat-in-the-refrigerator-223122", "passage_text": "Pin it. While the refrigerator is a modern-day miracle that lets us store perishable food safely for longer periods of time than room temperature allows, there is a limit to how long raw proteins can be refrigerated before they should be cooked. Here's a guide to help you know how long you can keep cuts of meat around! Kitchen Fact: Raw ground meats and poultry should be cooked in 2 days, and roasts, steaks, and chops should be cooked in five days. For raw poultry, ground meats, and other chopped-up cuts of meat, cook them within two days."}, {"url": "http://www.rd.com/health/healthy-eating/how-long-can-you-store-meat-in-the-fridge-or-freezer/", "passage_text": "Raw poultry lasts just a day or two in the fridge (at a temperature of 40 degrees Fahrenheit or colder), but up to a year in the freezer. Cooked poultry can be refrigerated a few days longer and should be frozen no longer than 2-6 months. In the freezer they’ll last 1-2 months. Bacon is safe to eat for up to a week in the fridge—but raw sausage should be eaten within two days. Both can be frozen for a month, and some sausage will freeze for twice as long."}]