[{"url": "http://www.answers.com/Q/How_much_does_a_college_professor_make", "passage_text": "Confidence votes 31. According to a recent poll of Professor salaries across the US, they ranged from roughly $61,000 to over $108,000, with a very few (the top 5%) making over $500,000 per year for very specific fields of study and interest. The pay for college professors varies widely depending on their specialty and the quality and prestige of the school. Highly paid are professors in fields like medicine and s … cience at schools with international reputations. Their salaries may be in the $150,000 to $200,000 range."}, {"url": "http://www.insidejobs.com/articles/how-much-does-a-college-professor-make", "passage_text": "The lowest-paid 10 percent of all University Professors earn less than $28,870, while the highest-paid 10 percent are paid more than $121,850 per year. The middle 50 percent of all University Professors earn between $41,600 and $83,960, so chances are good that you’ll earn more than the average annual salary."}, {"url": "http://work.chron.com/much-professors-earn-8913.html", "passage_text": "The highest-paid professors by subject as of May 2011, were law teachers, who earned an average $108,760 per year, according to the Bureau of Labor Statistics. The agency did not calculate hourly wages because professors did not work a standard 40-hour week throughout the year. Other subjects that paid the highest mean salaries were health specialties at $99,210 annually, engineering at $97,260 per year, and economics at $94,450 yearly. Degrees. The highest type of degree awarded to students affected the salaries of postsecondary teachers, according to the American Association of University Professors. The highest wages were in doctoral institutions, which paid a mean $127,296 per year for full professors, and $92,468 annually for all teachers. Masters facilities were next with an annual average of $91,998 for professors, and an average $71,121 yearly for all teachers"}, {"url": "http://www.ehow.com/info_8322039_much-university-make-per-year.html", "passage_text": "The average salary of doctoral professors in the United States was $138,472 per year as of 2014, according the AAUP survey. Those in public universities earned the least, with an average salary of $126,981. As of 2012, there were 1,267,700 post-secondary teachers in the United States, according to the Bureau of Labor Statistics. These teachers made a median wage of $68,970 annually in that same year. But not all of these teachers are university professors."}, {"url": "http://work.chron.com/much-professors-earn-8913.html", "passage_text": "Wages for professor varied by rank. The lowest-paid had no rank and earned a mean $65,574 per year for the 2010-11 school year, according to the American Association of University Professors. Lecturers earned an average annual $53,556 and instructors received an average $47,143 yearly. Degrees. The highest type of degree awarded to students affected the salaries of postsecondary teachers, according to the American Association of University Professors. The highest wages were in doctoral institutions, which paid a mean $127,296 per year for full professors, and $92,468 annually for all teachers. Masters facilities were next with an annual average of $91,998 for professors, and an average $71,121 yearly for all teachers"}, {"url": "http://www.ehow.com/info_8322039_much-university-make-per-year.html", "passage_text": "Other Positions. Before reaching the rank of professor you may have to settle for a lower wage. According to the AAUP, the average associate professor earned $81,980 per year in 2014. Assistant professors earned even less at $69,848 annually. Instructors made $49,963 per year and lecturers made $55,890. As of 2012, there were 1,267,700 post-secondary teachers in the United States, according to the Bureau of Labor Statistics. These teachers made a median wage of $68,970 annually in that same year. But not all of these teachers are university professors."}, {"url": "http://www.macleans.ca/education/uniandcollege/this-is-how-much-your-professors-make/", "passage_text": "Statistics Canada has released their annual professor salary report. Across 29 universities, average salaries for full-time teaching staff grew 2.5 per cent, from $113,148 in 2010 to $116,024 in 2011. Prices also rose 2.7 per cent for the 12 months ending in July, so it’s not much of a gain. But women did make gains. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080330205813AAJ5ZSI", "passage_text": "By rank, the average was $98,974 for professors, $69,911 for associate professors, $58,662 for assistant professors, $42,609 for instructors, and $48,289 for lecturers. Faculty in 4-year institutions earn higher salaries, on average, than do those in 2-year schools. "}]