[{"url": "http://www.drthomasjohn.com/site/cornea-surgery.htm", "passage_text": "The recovery period for corneal transplants is rather long. The stitches will remain in the eye for twelve months or longer after the surgery. Eye drops will have to be used to assure proper healing and low doses of steroid eye drops are often prescribed on a permanent basis to help prevent graft rejection."}, {"url": "http://www.webmd.com/eye-health/cornea-transplant-surgery", "passage_text": "During a cornea transplant, an eye surgeon removes a portion of your cornea and replaces it with a new section of cornea from a donor. The procedure is also called a corneal transplant or a keratoplasty. About 40,000 cornea transplants are performed in the U.S. every year. You may need a cornea transplant if your cornea no longer lets light enter your eye properly because of scarring or disease."}, {"url": "http://www.webmd.com/eye-health/cornea-transplant-surgery", "passage_text": "In this article. During a cornea transplant, an eye surgeon removes a portion of your cornea and replaces it with a new section of cornea from a donor. The procedure is also called a corneal transplant or a keratoplasty. About 40,000 cornea transplants are performed in the U.S. every year. You may need a cornea transplant if your cornea no longer lets light enter your eye properly because of scarring or disease."}, {"url": "http://www.healthguideinfo.com/eye-health/p102619/", "passage_text": "Another advantage of a partial corneal transplant over similar procedures is the recovery time. Generally, it takes less time to recover from a partial corneal transplant. The main reason for the reduced recovery time is that the procedure doesn't require sutures."}, {"url": "http://www.healthguideinfo.com/eye-health/p102619/", "passage_text": "A partial corneal transplant usually takes 60-90 minutes to complete. During the procedure, the damaged part of the cornea is removed. The donor tissue is inserted into the eye through a small incision and held against the cornea with an air bubble."}, {"url": "http://www.nhs.uk/Conditions/corneatransplant/Pages/Aftersurgery.aspx", "passage_text": "Your vision. The time it takes for your vision to return after a cornea transplant can range from as little as a few weeks up to a year or more. This largely depends on the specific procedure used. In some cases, your vision may fluctuate between being better or worse before it settles down."}]