[{"url": "https://en.wikipedia.org/wiki/Adrian", "passage_text": "Adrian is a form of the Latin given name Adrianus or Hadrianus. Its ultimate origin is most likely via the former river Adria from the Venetic word adur for 'water'. The Adria was until the 8th century BC the main channel of the Po River into the Adriatic Sea but ceased to exist before the 1st century BC. Several saints and six popes have borne this name, including the only English pope, Adrian IV, and the only Dutch pope, Adrian VI. As an English name, it has been in use since the Middle Ages though it was not popular until modern times."}, {"url": "http://www.surnamedb.com/Surname/Adrian", "passage_text": "This interesting surname is of early medieval English origin, and derives from the Latin male given name (H)adrianus, originally an ethnic name for someone from the seaport of Adria-which gave its name to the Adriatic Sea-who settled in Rome and became known as the man from Adria (in Latin, Adrianus). "}, {"url": "http://www.meaning-of-names.com/english-names/adrian.asp", "passage_text": "English name. In English, the name Adrian means-From the Latin Hadrianus meaning of Adria or of the Adriatic sea region. Pope Adrian IV was a 12 century British Pope who became popular in the 1980s when Sue Townsend published The Secret Diary of Adrian Mole.. English Name Meaning"}, {"url": "http://www.behindthename.com/name/adrian", "passage_text": "Meaning & History. Form of Hadrianus (see HADRIAN). Several saints and six popes have borne this name, including the only English pope, Adrian IV, and the only Dutch pope, Adrian VI. As an English name, it has been in use since the Middle Ages, though it was not popular until modern times. "}, {"url": "http://www.meaning-of-names.com/english-names/adrian.asp", "passage_text": "Other origins for the name Adrian include-English, Latin-American, German.The name Adrian is most often used as a boy name or male name. English Name Meaning-From the Latin Hadrianus meaning of Adria or of the Adriatic sea region. Pope Adrian IV was a 12 century British Pope who became popular in the 1980s when Sue Townsend published The Secret Diary of Adrian Mole. Origin-English. Alternate Origins-Latin-American German"}, {"url": "http://www.babynamespedia.com/meaning/Adrian/m", "passage_text": "Adrian is used chiefly in the English, German, Polish, Romanian, and Russian languages, and it is derived from Latin origins. The name is of the meaning man from Hadria; dark one. The name is derived from Hadrian, itself from Hadrianus (Latin) meaning 'man from Hadria'. Hadria is a town in northern Italy named after the Adriatic Sea. The sea was probably named for the dark-colored sand on its beaches, from the Latin 'ater'. Today the city Atri is in the Italian province of Teramo. "}, {"url": "http://www.sheknows.com/baby-names/name/adrian", "passage_text": "The name Adrian is a Latin baby name. In Latin the meaning of the name Adrian is: Black; dark; of the Adriatic. American Meaning: The name Adrian is an American baby name. In American the meaning of the name Adrian is: Black; dark; of the Adriatic. English Meaning: The name Adrian is an English baby name. In English the meaning of the name Adrian is: From the Latin Hadrianus meaning of Adria or of the Adriatic sea region. Pope Adrian IV was a 12 century British Pope who became popular in the 1980s when Sue Townsend published 'The Secret Diary of Adrian Mole'"}, {"url": "http://www.thinkbabynames.com/meaning/1/Adrian", "passage_text": "Adrian. Adrian /adri-an/ [3 sylls.] as a boys' name (also used less commonly as girls' name Adrian) is pronounced AY-dree-an. It is of Latin origin, and the meaning of Adrian is from Hadria. Place name: Hadria was a town in northern Italy, which gave its name to the Adriatic Sea. The name was borne by the Roman emperor Publius Aelius Hadrianus (second century AD). Hadrian's Wall was built across northern England during his reign. "}, {"url": "http://www.babynamewizard.com/baby-name/boy/adrian", "passage_text": "Origin of the name Adrian: Derived from the Latin Adriānus (man from the city of Adria) and Hadriānus (man from the city of Hadria). From A World of Baby Names by Teresa Norman. "}, {"url": "http://www.sheknows.com/baby-names/name/adriana", "passage_text": "The name Adriana is an American baby name. In American the meaning of the name Adriana is: Dark. Latin Meaning: The name Adriana is a Latin baby name. In Latin the meaning of the name Adriana is: from the Latin Hadrianus meaning of Adria, or of the Adriatic. Also means dark. Shakespearean Meaning: The name Adriana is a Shakespearean baby name. In Shakespearean the meaning of the name Adriana is: The Comedy of Errors' Wife to Antipholus of Ephesus"}]