[{"url": "http://www.thefreedictionary.com/precursor", "passage_text": "3. a chemical that is transformed into another compound, as in the course of a chemical reaction, and therefore precedes that compound in the synthetic pathway: Cholesterol is a precursor of testosterone. 4. a cell or tissue that gives rise to a variant, specialized, or more mature form. pre•cur′so•ry, adj. precursor. n. 1. a person or thing that precedes and shows or announces someone or something to come; harbinger. 2. a predecessor or forerunner. 3. (Chemistry) a chemical substance that gives rise to another more important substance."}, {"url": "http://www.merriam-webster.com/dictionary/precursor", "passage_text": "Full Definition of PRECURSOR. 1. a: one that precedes and indicates the approach of another b: predecessor. 2. : a substance, cell, or cellular component from which another substance, cell, or cellular component is formed. — pre·cur·so·ry \\-ˈkərs-rē, -ˈkər-sə-\\ adjective. See precursor defined for English-language learners. See precursor defined for kids. ADVERTISEMENT."}, {"url": "http://www.yourdictionary.com/precursor", "passage_text": "noun. Precursor is defined as something that led to the creation of something similar but new. An example of precursor is how radio came before but helped create television. The definition of a precursor is something or someone that came before. An example of a precursor is the dark clouds before a storm."}, {"url": "https://en.wikipedia.org/wiki/Precursor_(chemistry)", "passage_text": "From Wikipedia, the free encyclopedia. In chemistry, a precursor is a compound that participates in the chemical reaction that produces another compound. In biochemistry, the term precursor is used more specifically to refer to a chemical compound preceding another in a metabolic pathway"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=14105", "passage_text": "Precursor: Forerunner. That which precedes or is derived from an available source. The term precursor is applied to an inactive substance converted to an active one (such as an enzyme, vitamin, or hormone). The term precursor applies to any chemical that is transformed into another. From the Latin praecursor, composed of prae- (or pre-), before + curro to run = to run before. "}, {"url": "http://www.thefreedictionary.com/precursor", "passage_text": "2. One that precedes another; a forerunner or predecessor: The new principal's precursor was an eminent educator. 3. A biochemical substance, such as an intermediate compound in a chain of enzymatic reactions, from which a more stable or definitive product is formed: a precursor of insulin. precursor. n. 1. a person or thing that precedes and shows or announces someone or something to come; harbinger. 2. a predecessor or forerunner. 3. (Chemistry) a chemical substance that gives rise to another more important substance."}, {"url": "http://www.yourdictionary.com/precursor", "passage_text": "1 One that precedes another; a forerunner or predecessor: The new principal's precursor was an eminent educator. 2  A biochemical substance, such as an intermediate compound in a chain of enzymatic reactions, from which a more stable or definitive product is formed: a precursor of insulin. An example of precursor is how radio came before but helped create television. The definition of a precursor is something or someone that came before. An example of a precursor is the dark clouds before a storm."}, {"url": "http://www.thefreedictionary.com/precursor", "passage_text": "Noun. 1. precursor-a substance from which another substance is formed (especially by a metabolic reaction). biochemistry-the organic chemistry of compounds and processes occurring in organisms; the effort to understand biology within the context of chemistry. precursor. n. 1. a person or thing that precedes and shows or announces someone or something to come; harbinger. 2. a predecessor or forerunner. 3. (Chemistry) a chemical substance that gives rise to another more important substance."}, {"url": "http://www.audioenglish.org/dictionary/precursor.htm", "passage_text": "The noun PRECURSOR has 3 senses: 1. a substance from which another substance is formed (especially by a metabolic reaction). 2. a person who goes before or announces the coming of another. 3. an indication of the approach of something or someone. Familiarity information: PRECURSOR used as a noun is uncommon. "}]