[{"url": "http://www.thenamemeaning.com/lucius/", "passage_text": "The meaning of Lucius has more than one different etymologies. It has same or different meanings in other countries and languages. The different meanings of the name Lucius are: 1  From Shakespeare's work 'Julius Caesar', 'Timon of Athens' and 'Titus Andronicus'. 2  American meaning: Bringer of light. 3  Latin meaning: Bringer of light. 4  Spanish meaning: Bringer of light"}, {"url": "http://www.babynamespedia.com/meaning/Lucius", "passage_text": "From Latin roots, its meaning is bright, born at daybreak-in this context, Lucius can be used in the English and German languages. A biblical name, it is derived from the element 'lux' meaning light. Lucius (Latin) is an original form of Lucius. In the medieval period, the name was sometimes bestowed upon babies born at daybreak. It was popular as a Roman given name, and one of its Late Latin derivatives was Lucianus. The name Lucy (English) is the female form of Lucius. The name Lucius is widely used; it has 23 variants that are used in English and other languages. Variants used in English include Loukas, Lucais, Lucanus, Luce, Lucian, Lucianus, Lucias, Lucious, Lucis, and Lukas. The pet form Lucky is another English variant."}, {"url": "http://www.babynamewizard.com/baby-name/boy/lucius", "passage_text": "Origin of the name Lucius: A borrowing from the Latin, Lucius is derived from the root lux (light) or from the Ecclesiastic Greek Loukas, a contraction of Loukanos (man from Lucania). Lucania was the name of a district in southern Italy. The name has been used in Ireland to Anglicize the name. From A World of Baby Names by Teresa Norman."}, {"url": "http://www.sheknows.com/baby-names/name/lucius", "passage_text": "The name Lucius is an English baby name. In English the meaning of the name Lucius is: Form of Luke: light; illumination. Latin Meaning: The name Lucius is a Latin baby name. In Latin the meaning of the name Lucius is: Light. Form of Luke. This name was popular in ancient Rome, and has been borne by three popes. Shakespearean Meaning: The name Lucius is a Shakespearean baby name. In Shakespearean the meaning of the name Lucius is: Cymbeline' Caius Lucius, General of the Roman Forces. 'The Tragedy of Julius Caesar' A servant to Brutus."}, {"url": "http://www.thenamemeaning.com/lucius/", "passage_text": "Search comprehensively and find the name meaning of Lucius and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Lucius and check the initials of the name with your last name to discover how it looks and sounds. The different meanings of the name Lucius are: 1  From Shakespeare's work 'Julius Caesar', 'Timon of Athens' and 'Titus Andronicus'. 2  American meaning: Bringer of light. 3  Lati"}, {"url": "http://www.behindthename.com/name/lucius", "passage_text": "Roman praenomen, or given name, which was derived from Latin lux light. Two Etruscan kings of early Rome had this name as well as several prominent later Romans, including Lucius Annaeus Seneca (known simply as Seneca), a statesman, philosopher, orator and tragedian. "}, {"url": "http://www.thinkbabynames.com/meaning/1/Lucius", "passage_text": "Lucius /lu-cius/ [2 sylls.] as a boys' name. Lucius' root is Greek, and the name Lucius means from Lucanus. Lucius is a version of Luke (Greek). Lucious is a conventional last name. See also Lucian. "}, {"url": "https://en.wikipedia.org/wiki/Lucius", "passage_text": "Lucius derives from latin word Lux (gen. lucis), meaning  light PIE *leuk- brightness, Latin verb lucere to shine), and is a cognate of name Lucas. Another etymology proposed is a derivation from Etruscan Lauchum (or Lauchme) meaning  king , which however was transferred into Latin as Lucumo. Lucius is an English masculine given name and a rare German and Dutch surname. Lucius has been translated into Italian, Spanish and Portuguese, as Lucio"}, {"url": "http://babynamescountry.com/meanings/Lucius.html", "passage_text": "Meaning: The Latin name Lucius means-light; bringer of light. "}]