[{"url": "http://byebyedoctor.com/bumps-on-tongue/", "passage_text": "Causes of Bumps on Tongue. Most of the tiny red bumps that are on the tongue are referred to as papillae and they cover the total surface of the tongue. Most of them have taste buds which are the receptor organs for detecting tastes and then send the information over to the brain. If the bumps are on only one side of the tongue, the bumps can be cancerous and need to be checked out. Another sign of cancer can be sores or lumps that are red or white, or hard lumps, especially if they are painless."}, {"url": "http://www.medrition.com/2015/03/bumps-on-back-of-tongue.html", "passage_text": "You may notice some awkward bumps on the back of your tongue when you are sick. Sick meaning to have the flu, seasonal cold, or sore throat. Any illness that might affect the respiratory system or throat infections. These bumps can appear from the reason you got dehydrated, due to cold and fever. "}, {"url": "http://www.wikihow.com/Get-Rid-of-Bumps-on-Your-Tongue", "passage_text": "If you have yellow or red bumps on your tongue, you are likely suffering from a common condition called transient lingual papillitis, which is sometimes also referred to as “lie bumps.” Transcient lingual papillitis can present with mild tenderness to severe pain. "}, {"url": "http://www.md-health.com/Bumps-On-Back-Of-Tongue.html", "passage_text": "Bumps on the back of the tongue are usually natural. Because so many people are concerned about conditions like cancer that lead to bumps or lumps around the body, any condition that causes these types of symptoms can raise concern. In fact, there are a variety of reasons why bumps might appear on the body. 2. If you bite or burn your tongue it can cause bumps to appear, but this is more likely to occur at the front of the tongue rather than the back. Sometimes brushing too hard with your toothbrush can cause the tongue to become irritated and bumps to appear."}, {"url": "http://answers.webmd.com/answers/1177939/what-causes-a-sore-tongue-and", "passage_text": "A. There are many things that can make your tongue sore or cause painful tongue bumps to form, including: 1  Trauma. 2  Accidentally biting your tongue or scalding it on something straight out of the oven can result in a sore tongue until the damage heals. "}, {"url": "http://diseasespictures.com/bumps-on-tongue/", "passage_text": "Bumps are small pimple like structure found on the tongue either on the top or on the backside of the tongue. It would cause pain and irritation. Bumps are formed due to the infection caused by the fungus and it may affect your taste buds. In medical terms, bumps are called lingual papillitis. Leukoplakia is the term given to thickened bumps formed on the tongue. It can occur on the gums and bottom of the oral cavity and also on the inner portion of the cheeks"}, {"url": "http://www.speedyremedies.com/red-bumps-on-tongue-causing-pain.html", "passage_text": "The formation of red bumps on tongue is a fairly troublesome but common tongue problem that can be caused by a variety of reasons. The condition is often accompanied by pain, burning sensation and inflammation. Nonetheless, in certain cases, a red bump on tongue can also be painless. "}, {"url": "http://www.webmd.boots.com/oral-health/guide/sore-tongue-tongue-bumps", "passage_text": "Sore tongue or bumps on the tongue. There are many things that can make your tongue sore or cause painful tongue bumps, including: 1  Biting or scalding. 2  Accidentally biting your tongue or scalding it on something straight out of the oven can result in a sore tongue until the damage heals. 1 If one or more of your taste buds becomes inflamed or irritated, it can swell and form a painful bump on your tongue. 2  Certain medical conditions. 3  Medical conditions, including diabetes and anaemia, can have a sore tongue as a symptom."}]