[{"url": "http://www.ehow.com/facts_7490701_tall-do-magnolia-trees-grow.html", "passage_text": "Short Magnolias. The pyramid magnolia is a shorter variety of magnolia tree that reaches only 30 feet tall by comparison. Another shorter magnolia tree species is the umbrella magnolia. Growing to just 40 feet tall, the umbrella magnolia has big, showy flowers, but it lacks the sweet fragrance of the Southern variety. "}, {"url": "http://www.magnoliasociety.org/MagnoliaResources", "passage_text": "This magnolia is one of the best known species because it is very cold hardy (USDA Zones 4-8), widely adaptable and blooms when very small. Star Magnolia is a slow growing, broad spreading, small tree or large shrub, ultimately reaching 15 feet tall or more. Leaves may be 4-8 inches long and up to 3 inches wide. As a deciduous plant, the dark green leaves drop in fall, sometimes turning yellow before falling. So many choices, too small a garden. When you start looking into magnolias, you will want one in every bed! Some magnolias are grown primarily for their flowers, usually in the form of a shrub or small tree. Other magnolias grow to be large shade trees, and yet others are used as evergreen shrubs, trees or hedges. Consult our Magnolia Cultivars Checklist for options and consider visiting one of the gardens listed on this map to get an idea for the kinds of magnolias that are likely to do well in your climate"}, {"url": "http://homeguides.sfgate.com/care-jane-magnolia-tree-40093.html", "passage_text": "The Jane magnolia tree is suitable for U.S. Department of Agriculture plant hardiness zones 4 to 7, where it will grow in either full or partial shade. An ideal location would be one with direct morning sunlight, and some protection in the afternoon. The tree needs about 10 feet of space to spread out comfortably. The Jane magnolia tree (Magnolia x Jane) belongs to the Little Girl group of magnolias, a group of early spring blooming hybrids originally created at the U.S. National Arboretum in Washington D.C. in the 1950s. The tree is on the small side, growing to a mature height of between 10 to 15 feet"}, {"url": "https://en.wikipedia.org/wiki/Magnolia_grandiflora", "passage_text": "Flower and foliage of M. grandiflora. Magnolia grandiflora is a medium to large evergreen tree which may grow 120 ft (37 m) tall. It typically has a single stem (or trunk) and a pyramidal shape. The leaves are simple and broadly ovate, 12–20 cm (4.7–7.9 in) long and 6–12 cm (2.4–4.7 in) broad, with smooth margins. Magnolia grandiflora, commonly known as the southern magnolia or bull bay, is a tree of the family Magnoliaceae native to the southeastern United States, from South Virginia to central Florida, and west to East Texas and Oklahoma."}, {"url": "http://www.gardenguides.com/69184-blooms-magnolia-tree.html", "passage_text": "Overview. If your magnolia tree stops blooming, there are solutions you can explore that might help the tree begin to blossom once again. If your magnolia tree has never bloomed, you might be in for a long wait. Magnolia trees that are grown from seed might take 15 to 20 years to bloom. "}, {"url": "http://homeguides.sfgate.com/tall-magnolia-trees-grow-46428.html", "passage_text": "Big Magnolias. Southern magnolia (Magnolia grandiflora), hardy and evergreen in U.S. Department of Agriculture plant hardiness zones 6 through 10, is one of the genus's largest trees at 60 to 80 feet high and 40 feet wide. Houpu magnolia (M. officinalis var. biloba) grows nearly as tall at 60 to 70 feet high and 35 to 50 feet wide in USDA zones 5 through 8. Cucumber tree magnolia (M. acuminata) reaches 60 to 70 feet high with a spread of 35 to 50 feet."}]