[{"url": "http://www2.humboldt.edu/rescuers/book/Bochove/bertlinks/wbork.html", "passage_text": "Westerbork Concentration Camp. Westerbork was the main transit camp used by the Germans during their occupation of Holland to send people--mostly Jews--to the death camps in Poland. The second, smaller, concentration camp in Holland was Vught. Between July 1942, and September 1943, approximately 110,00 Jewish people passed through the two camps. "}, {"url": "http://www.holocaustresearchproject.org/othercamps/westerbork.html", "passage_text": "Westerbork. Transit Camp. Montage of images related to Westerbork. The community of Westerbork is situated in the northeast of the Netherlands in the province of Drenthe, 11 kms from the province capital of Assen and about 130 km (80 miles) north of Amsterdam."}, {"url": "http://www.annefrank.org/en/Anne-Frank/Discovery-and-arrest/Deported-to-the-camps/", "passage_text": "Camp Westerbork Westerbork is a transit camp: from here Jews, gypsies, and members of the Resistance in the Netherlands are deported to the concentration and extermination camps. "}, {"url": "http://www.annefrank.org/en/Anne-Frank/Discovery-and-arrest/Deported-to-the-camps/To-Camp-Westerbork/", "passage_text": "Westerbork Transit Camp More than 100,000 Jews in the Netherlands are deported to concentration camps from this camp located in the Dutch town of Westerbork, near the border with Germany. "}, {"url": "https://en.wikipedia.org/wiki/Westerbork_(village)", "passage_text": "[ˈʋɛstərˌbɔrk]) is a village with a population of 4,710 in the municipality of Midden-Drenthe in the Netherlands. It is located in the middle of the eastern province of Drenthe. During World War II, the Westerbork transit camp was located near the village. In 1969, the Westerbork Synthesis Radio Telescope was installed near the site of the former camp. The radio telescope consists of an array of 14 antennas with a diameter of 25 metres each and is operated by ASTRON."}, {"url": "https://en.wikipedia.org/wiki/Westerbork_(village)", "passage_text": "History [edit]. In 1939, the refugee camp Westerbork was established outside of the village to accommodate German refugees who had fled Nazi Germany. A year later, Nazi Germany had occupied the Netherlands following the Battle of the Netherlands. In 1969, the Westerbork Synthesis Radio Telescope was installed near the site of the former camp. The radio telescope consists of an array of 14 antennas with a diameter of 25 metres each and is operated by ASTRON."}, {"url": "http://www.theholocaustexplained.org/ks4/the-nazi-camp-system/types-of-camps/what-was-life-like-in-westerbork/", "passage_text": "Dutch government. Westerbork was a transit camp located in the north east of the Netherlands. The camp had originally been set up in October 1939 by the Dutch government as a place to hold German Jews who had entered the Netherlands illegally. "}, {"url": "http://www.jewishgen.org/ForgottenCamps/Camps/WestEng.html", "passage_text": "O n July 1st, 1942, the German authorities took control of the camp. Westerbork became officially a transit camp (Durchgangslager Westerbork). On July 14th, 1942, all the Jews were examined by the SS in order to determine who was able to work or not. The first train arrived on July 15th and left the camp on July 16th with 1,135 of the first selected Jews. A transfert from Westerbock. T he camp of Westerbork was situated about 15 km from the village of Westerbork. This camp had been opened by the Dutch authorities during the summer 1939 in order to receive the Jewish refugees coming from Germany."}, {"url": "https://en.wikipedia.org/wiki/Westerbork", "passage_text": "The Westerbork transit camp (Dutch: Kamp Westerbork, German: Durchgangslager Westerbork) was a World War II Nazi refugee, detention and transit camp in Hooghalen, ten kilometres (6.2 miles) north of Westerbork, in the northeastern Netherlands. In 1939, the Dutch government erected a refugee camp, Centraal Vluchtelingenkamp Westerbork, financed partly by Dutch Jews, to absorb fleeing Jews from Nazi Germany. The Jewish refugees were housed after they had tried to escape Nazi terror in their homeland."}]