[{"url": "http://www.ourbabynamer.com/meaning-of-Walter.html", "passage_text": "Then just follow the diagram below. Just for fun, see the name Walter in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Walter in Nautical Flags page. Walter is generally used as a boy's name. It consists of 6 letters and 2 syllables and is pronounced Wal-ter. In the U.S. in 2014, it ranked 337 in baby name popularity for boys with 977 occurrences. Less than 5 girls were given the nam"}, {"url": "http://www.thinkbabynames.com/meaning/1/Walter", "passage_text": "Walter is a very prominent first name for men (#41 out of 1220, Top 3%) and also a very prominent surname for all people (#651 out of 150436, Top 1%). (2000 U.S. Census). Displayed below is the baby name popularity of Walter for boys. From an Old French personal name of Germanic origin, formed from wald rule and heri army, which are the same as the elements of Harold. Norman name that was brought to Britain, replacing the original Old English form Wealdhere, and has been used rather steadily for the last 900 years."}, {"url": "http://www.behindthename.com/name/walter", "passage_text": "Meaning & History. From a Germanic name meaning ruler of the army, composed of the elements wald rule and hari army. The Normans brought it to England, where it replaced the Old English cognate Wealdhere. A famous bearer of the name was Sir Walter Scott (1771-1832), a Scottish novelist who wrote 'Ivanhoe' and other notable works. "}, {"url": "http://www.sheknows.com/baby-names/name/walter", "passage_text": "Teutonic Meaning: The name Walter is a Teutonic baby name. In Teutonic the meaning of the name Walter is: Strong fighter. American Meaning: The name Walter is an American baby name. In American the meaning of the name Walter is: Strong fighter. Shakespearean Meaning: The name Walter is a Shakespearean baby name. In Shakespearean the meaning of the name Walter is: King Henry IV, Part 1' Sir Walter Blunt. 'Henry VI, Part 2' Walter Whitmore."}, {"url": "http://www.names.org/n/walter/about", "passage_text": "The name Walter is of English origin, and it means Army Ruler . It's a name commonly given to boys. Bruce Willis is an actor, producer, writer, and musician with the most prominent portion of his career being from 1980 to present. According to the 1939 U.S. Social Security Administration data, the name Walter ranks #35 in popularity as a baby boy's name in Missouri. Imagine that, 162 babies in Missouri have the same name as you in 1939."}, {"url": "http://www.babynamespedia.com/meaning/Walter", "passage_text": "The name Walter is widely used; it has 60 forms that are used in English and other languages. English forms include Walder, Walley, Wallie, Waltar, Walte, Walten, Walters, Walthar, Waltor, Waltur, Walty, Waltyr, Watson, and Woulter. Currently it is still a fairly popular baby name for boys, though to a lesser extent than it was in the past. Its usage peaked in 1901 with 1.487% of baby boys being named Walter. It ranked at #12 then. The baby name has since steeply slipped in popularity, and is of occasional use in recent times."}, {"url": "http://www.ourbabynamer.com/meaning-of-Walter.html", "passage_text": "Walter is a form of the name Walther. The names Bhaltair, Bhatair, Galtero, Gualter, Gualterio, Gualtier, Gualtiero, Gwallter, Quaid, Uaid, Ualtar, Wolter, Wouter are all forms of Walter. Walter has the diminutives (nicknames) Walt, Wat, Watkin. Walter falls into the name categories classic, easy nickname. Walter is generally used as a boy's name. It consists of 6 letters and 2 syllables and is pronounced Wal-ter. In the U.S. in 2014, it ranked 337 in baby name popularity for boys with 977 occurrences. Less than 5 girls were given the "}, {"url": "http://www.thinkbabynames.com/meaning/1/Walter", "passage_text": "Walter /wal-ter/ [2 sylls.] as a boys' name is pronounced WAL-ter. It is of Old German origin, and the meaning of Walter is army ruler . From an Old French personal name of Germanic origin, formed from wald rule and heri army, which are the same as the elements of Harold. Norman name that was brought to Britain, replacing the original Old English form Wealdhere, and has been used rather steadily for the last 900 years."}, {"url": "http://www.babynamespedia.com/meaning/Walter", "passage_text": "The name Walter has been mostly given to baby boys, though it has also been used as a girl name in the past century. In 1939, the name Walter was given to 144 times more baby boys than girls. Baby names that sound like Walter include Walther, Valter, Voltaire, Valtteri, and Valtr. Currently it is still a fairly popular baby name for boys, though to a lesser extent than it was in the past. Its usage peaked in 1901 with 1.487% of baby boys being named Walter. It ranked at #12 then. The baby name has since steeply slipped in popularity, and is of occasional use in recent times."}]