[{"url": "http://www.greeka.com/cyclades/", "passage_text": "Travel info. The Cyclades, in Greece, is the most popular group in the Greek islands. The name of the group comes from the Greek word cyclos, which means circle, as all the islands form a circle around Delos, the sacred island of Apollo in the ancient times. Located in the centre of the Aegean Sea, the Cyclades is the most popular island group in Greece. These islands distinguish for the picturesque architecture dominated by white and blue, and for the relaxing atmosphere. Holidays in Cyclades is an amazing experience and offers memories to cherish for a lifetime"}, {"url": "http://www.greeka.com/cyclades/", "passage_text": "The Cyclades islands is the most popular island complex in Greece. Located so close to Athens, it is easy to reach the Cyclades in Greece in few hours by ferry or in few minutes by plane. All these Greek islands provide amazing holiday destinations for romantic couples, groups of friends or families. Located in the centre of the Aegean Sea, the Cyclades is the most popular island group in Greece. These islands distinguish for the picturesque architecture dominated by white and blue, and for the relaxing atmosphere. Holidays in Cyclades is an amazing experience and offers memories to cherish for a lifetime"}, {"url": "http://www.visitgreece.gr/en/greek_islands", "passage_text": "Most of the islands are found in the Aegean Sea and are divided into seven groups (from north to south): The Northeastern Aegean Islands. Agios Efstratios, Thasos, Ikaria, Lesbos, Limnos, Inouses, Samos, Samothrace, Chios, Psara. These islands, which are the biggest of the Ionian Sea, constitute the famous Eptanissa (meaning seven islands; epta in Greek means seven). Antipaxi, Ereikoussa, Kalamos, Kastos, Mathraki, Meganissi, Othoni, Skorpios, Strofades are smaller islands of the Ionian Sea."}, {"url": "http://www.visitgreece.gr/en/greek_islands", "passage_text": "Zakynthos, Ithaca, Corfu, Kefallonia, Lefkada, Paxi, and Kythira which is situated opposite the southern Peloponnese (Laconia). These islands, which are the biggest of the Ionian Sea, constitute the famous Eptanissa (meaning seven islands; epta in Greek means seven). Antipaxi, Ereikoussa, Kalamos, Kastos, Mathraki, Meganissi, Othoni, Skorpios, Strofades are smaller islands of the Ionian Sea."}, {"url": "http://www.greeceathensaegeaninfo.com/h-greek-islands/greek-islands-glance10.htm", "passage_text": "Greek Islands at a Glance Page Ten. The Cyclades or 'cyclic chain', offers advantages to visitors with more time especially if staying within the Cycladic ferry route comfort zone. The 18 major islands ensure quite a bit of variety and that's without counting the several lesser Cyclades with their pristine beaches and laid back lifestyle. Most island groups have a HUB island or administrative center."}, {"url": "http://www.greeceathensaegeaninfo.com/h-greek-islands/greek-islands-glance10.htm", "passage_text": "For one thing, these Greek islands are a little piece of paradise only a few hours from Athens. The 18 major islands ensure quite a bit of variety and that's without counting the several lesser Cyclades with their pristine beaches and laid back lifestyle. Most island groups have a HUB island or administrative center."}, {"url": "http://www.visitgreece.gr/en/greek_islands", "passage_text": "The Greek Archipelago! The islands are the main characteristic of Greece’s morphology and an integral part of the country’s culture and tradition. Greek sovereign land includes 6,000 islands and islets scattered in the Aegean and Ionian Seas, of which only 227 islands are inhabited. This is a truly unique phenomenon for the European continent. These islands, which are the biggest of the Ionian Sea, constitute the famous Eptanissa (meaning seven islands; epta in Greek means seven). Antipaxi, Ereikoussa, Kalamos, Kastos, Mathraki, Meganissi, Othoni, Skorpios, Strofades are smaller islands of the Ionian Sea."}, {"url": "http://www.greektravel.com/greekislands/cyclades.htm", "passage_text": "Greek Island Guide Cyclades Islands. The Cyclades islands are the most well known of the Greek Islands and include Santorini and Mykonos which are the two most popular islands in Greece. top. Naxos Another overlooked gem in the Aegean, Naxos is big, green and may have the best beaches in Greece. It's close to the popular islands of Mykonos, Ios, Paros and Santorini with frequent ferry connections in the summer. Lively harbor town with restaurants, cafes, clubs and shops. Rent a car and see the whole island"}]