[{"url": "http://www.ghr.nlm.nih.gov/glossary=retrovirus", "passage_text": "A retrovirus is a virus that uses RNA as its genetic material. When a retrovirus infects a cell, it makes a DNA copy of its genome that is inserted into the DNA of the host cell. There are a variety of different retroviruses that cause human diseases, including the common cold, some forms of cancer, and AIDS. It uses an enzyme called reverse transcriptase to become part of the host cells' DNA. This allows many copies of the virus to be made in the host cells. The virus that causes AIDS, the human immunodeficiency virus (HIV), is a type of retrovirus."}, {"url": "http://www.ghr.nlm.nih.gov/glossary=retrovirus", "passage_text": "A type of virus that has RNA instead of DNA as its genetic material. It uses an enzyme called reverse transcriptase to become part of the host cells' DNA. This allows many copies of the virus to be made in the host cells. The virus that causes AIDS, the human immunodeficiency virus (HIV), is a type of retrovirus."}, {"url": "http://medical-dictionary.thefreedictionary.com/retrovirus", "passage_text": "Virology An RNA virus that encodes reverse transcriptase so that its RNA can be transcribed into DNA in a host cell; modified retroviruses are used as vectors to introduce genes–or portions thereof–of interest into eukaryotic cells. Retrovirus. A family of RNA viruses containing a reverse transcriptase enzyme which allows the viruses' genetic information to become part of the genetic information of the host cell upon replication. Mentioned in: AIDS, AIDS Tests, Antiretroviral Drugs, Antiviral Drugs, Tropical Spastic Paraparesis."}, {"url": "http://www.biology-online.org/dictionary/Retrovirus", "passage_text": "Retrovirus. Definition. noun, plural: retroviruses. Any of the group of viruses in the family Retroviridae. The virus is characterized by having a single-stranded RNA as its genetic material, which it uses to incorporate into the genome of the host cell as a means to propagate. Supplement. "}, {"url": "http://autocww.colorado.edu/~toldy3/E64ContentFiles/VirusesMoneransAndProtists/RetrovirusB1.html", "passage_text": "In gene therapy, a type of virus known as a retrovirus is used to replace a defective gene in cells with a new, healthy gene. Scientists insert the healthy gene into the ribonucleic acid (RNA) of the retroviruses. These retroviruses are mixed with cells taken from a patient and cultured in a laboratory. "}, {"url": "http://www.genetherapynet.com/viral-vector/retroviruses.html", "passage_text": "Retroviral Vectors. A retrovirus is any virus belonging to the viral family Retroviridae. All The genetic material in retroviruses is in the form of RNA molecules, while the genetic material of their hosts is in the form of DNA. When a retrovirus infects a host cell, it will introduce its RNA together with some enzymes into the cell."}, {"url": "https://en.wikipedia.org/wiki/Retrovirus", "passage_text": "Retroviridae is a family of enveloped viruses that replicate in a host cell through the process of reverse transcription. A retrovirus is a single-stranded positive-sense RNA virus with a DNA intermediate and, as an obligate parasite, targets a host cell."}, {"url": "https://simple.wikipedia.org/wiki/Retrovirus", "passage_text": "From Wikipedia, the free encyclopedia. A retrovirus is any virus which copies itself as part of the cell's DNA by reverse transcribing its RNA. Since the cell cannot proofread the step in which RNA is converted back to DNA, errors often go unnoticed. This makes the exact sequence of a retrovirus's RNA change often. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=5344", "passage_text": "Retrovirus: A virus that is composed not of DNA but of RNA. Retroviruses have an enzyme, called reverse transcriptase, that gives them the unique property of transcribing their RNA into DNA after entering a cell. The retroviral DNA can then integrate into the chromosomal DNA of the host cell, to be expressed there. HIV is a retrovirus."}, {"url": "http://medical-dictionary.thefreedictionary.com/retrovirus", "passage_text": "retrovirus. [-vī′rəs]. Etymology: L, retro + virus. any of a family of ribonucleic acid (RNA) viruses containing the enzyme reverse transcriptase in the virion. The genetic information of the virus is stored in a molecule of single-stranded ribonucleic acid. Retrovirus. A family of RNA viruses containing a reverse transcriptase enzyme which allows the viruses' genetic information to become part of the genetic information of the host cell upon replication. Mentioned in: AIDS, AIDS Tests, Antiretroviral Drugs, Antiviral Drugs, Tropical Spastic Paraparesis."}]