[{"url": "http://pets.thenest.com/can-puppies-same-litters-different-breeds-12029.html", "passage_text": "Trying to decide which of the adorable puppies in a mixed breed litter is meant for you isn't easy. It's especially difficult if each puppy boasts a unique look. While puppies in the same litter can't be different pure breeds, they can have different fathers."}, {"url": "http://pets.thenest.com/can-puppies-same-litters-different-breeds-12029.html", "passage_text": "Superfecundation is the technical term for litters sired by more than one father. It doesn't just occur in dogs and cats -- although rare, it's even possible for fraternal human twins to have different dads."}, {"url": "http://dogcare.dailypuppy.com/can-girl-dog-puppies-two-different-dogs-6722.html", "passage_text": "Female dogs can have puppies from multiple canine fathers, and not just from separate pregnancies. If you're caring for a litter of puppies and notice that a couple of the little guys look totally different from the rest, you might just be dealing with a case of two fathers for a single litter."}, {"url": "http://pets.thenest.com/can-puppies-same-litters-different-breeds-12029.html", "passage_text": "How It Happens. When a female dog goes into heat, she can remain receptive to breeding for seven days or more. If she mates with more than one dog during that roughly week-long period, puppies in the litter might have different sires."}, {"url": "http://www.kgbanswers.com/can-dogs-have-2-different-dads-for-one-litter-of-puppies/1581268", "passage_text": "Yes, one litter of puppies can have multiple fathers, so long as the mother was bred with multiple partners during a time when she had viable eggs. Since multiple eggs are released by the mother, sperm from different fathers could fertilize each egg. It is even possible in humans for twins to have two different fathers."}, {"url": "http://pets.thenest.com/can-puppies-same-litters-different-breeds-12029.html", "passage_text": "Puppies with different sires can't be different breeds, but there's a possibility that some might be purebred and others so-called designer dogs.. For example, if a cocker spaniel female mates with both a purebred cocker spaniel and a purebred poodle, her cocker spaniel puppies are purebreds."}, {"url": "http://puppyintraining.com/can-a-litter-of-puppies-have-more-than-one-father/", "passage_text": "A female dog can have as many different fathers for her puppies that bred with her. Dogs can release multiple eggs and they can be fertilized by whichever dog’s semen is present."}, {"url": "http://www.dogster.com/answers/question/can_a_dog_have_puppies_from_different_fathers_at_the_same_time-5584", "passage_text": "Answers. Yes, it is absolutely possible for puppies in the same litter to have different fathers. That said, you really need to be a more responsible dog owner. First, cross-breeding two different breeds of dog is almost never a good idea because you don't know what you will get."}]