[{"url": "http://www.babycentre.co.uk/a539332/swimming-with-your-baby", "passage_text": "It's normal to bleed for anything up to six weeks after birth. However, your baby can go swimming at any time from birth, although most baby swimming classes start at six weeks. If you are keen for your baby to be introduced to swimming before he is six weeks old, your partner or someone else can take him."}, {"url": "https://answers.yahoo.com/question/index?qid=20090127233319AA1U6Kl", "passage_text": "Best Answer: Around 3 months for the pool (Maybe 7 months for the beach). First you want to make sure that his umbilical cord has fallen off and fully healed. You also want to make sure that the baby has good head control. If you bring your baby to the beach I would only go up to ankle depth water."}, {"url": "http://www.nhs.uk/chq/Pages/1035.aspx?CategoryID=62&SubCategoryID=63", "passage_text": "You can take your baby swimming at any age, both before and after they have been vaccinated. It doesn't matter if they haven't yet completed their course of vaccinations. Some leisure facilities may suggest that babies shouldn't go swimming until they have had all of their jabs."}, {"url": "http://www.babycentre.co.uk/x542046/how-soon-can-i-take-my-new-baby-swimming", "passage_text": "Most babies up to six months of age can actually swim, with your help, of course! If you start early you can take advantage of your baby's natural ability to do basic strokes. Also, your baby's inbuilt gag reflex is generally at its strongest before six months."}, {"url": "http://www.babycentre.co.uk/x542046/how-soon-can-i-take-my-new-baby-swimming", "passage_text": "However, your baby can go swimming at any time from birth, although most baby swimming classes start at six weeks. If you're keen for your baby to be introduced to swimming before he is six weeks old, your partner or someone else can take him to a warm, baby pool."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20080530104729AAi5KX2", "passage_text": "you can take a baby swimming right from the start. some people still say after the baby has had its immunisations but that's not really necessary. they used to use live immunisation so if a little entered the pool and a baby that hadn't yet been immunised caught it that baby could get very ill."}, {"url": "http://www.babycenter.com.au/x542046/how-soon-can-i-take-my-baby-swimming", "passage_text": "If you are keen for your baby to be introduced to swimming before he is six weeks old your partner, or someone else, can take him. Some private baby swim classes start as early as four weeks but most classes at public pools begin at around 4 months."}, {"url": "http://www.babycenter.com.au/a539332/swimming-with-your-baby", "passage_text": "However, your baby can go swimming at any time from birth, although most baby swimming classes start at six weeks. If you are keen for your baby to be introduced to swimming before he is six weeks old, your partner or someone else can take him. Some private baby swimming classes start as early as four weeks. There's no need to wait until your baby is immunised (NHS Choices 2012) before taking him to a pool."}]