[{"url": "http://heteroflexibletherapy.com/traumaversus.html", "passage_text": "Sadness vs. Terror. “ 1 Sadness” is the word best used to define the experience of grief. “ 2 Sheer terror” is the best phrase to define the experience of trauma. 3  Grief can stand by itself---one can feel sad without feeling unsafe or terrorized. 4  When a person is traumatized the terror overpowers any grief reactions. 1 “Sadness” is the word best used to define the experience of grief. “ 2 Sheer terror” is the best phrase to define the experience of trauma. 3  Grief can stand by itself---one can feel sad without feeling unsafe or terrorized."}, {"url": "http://medical-dictionary.thefreedictionary.com/traumatic+grief", "passage_text": "traumatic grief. Psychology A severe form of bereavement–eg, loss of spouse, which may be similar to post-traumatic stress disorder Clinical Sleep disturbance, anguish, suicidal ideation, ↑ alcohol, ↑ food, ↑ tobacco consumption, HTN, heart disease, possibly, CA. See Bilateral mastectomy"}, {"url": "http://medical-dictionary.thefreedictionary.com/traumatic+grief", "passage_text": "Grief resulting from the loss of a loved one in a traumatic situation (natural or transportation disaster, act of terrorism or mass murder, etc.). Mentioned in: Bereavement. Psychology A severe form of bereavement–eg, loss of spouse, which may be similar to post-traumatic stress disorder Clinical Sleep disturbance, anguish, suicidal ideation, ↑ alcohol, ↑ food, ↑ tobacco consumption, HTN, heart disease, possibly, CA."}, {"url": "http://heteroflexibletherapy.com/traumaversus.html", "passage_text": "1 “Sheer terror” is the best phrase to define the experience of trauma. 2  Grief can stand by itself---one can feel sad without feeling unsafe or terrorized. 3  When a person is traumatized the terror overpowers any grief reactions. 4  The victim needs to become a survivor first by processing the trauma then grief can emerge. 1 “Sadness” is the word best used to define the experience of grief. “ 2 Sheer terror” is the best phrase to define the experience of trauma. 3  Grief can stand by itself---one can feel sad without feeling unsafe or terrorized. 4  When a person is traumatized the terror overpowers any grief reactions"}, {"url": "http://www.ptsd.va.gov/professional/treatment/vets/tgs-treatment-iraq-war.asp", "passage_text": "Traumatic grief. Traumatic grief refers to the experience of the sudden loss of a significant and close attachment. Having a close buddy, identification with soldiers in the unit, and experiencing multiple losses were the strongest predictors of grief symptoms in the above sample of Vietnam Veterans. In the early stages of grief, symptoms may be experienced as intense, but this is normal for the first days, weeks, and months. Soldiers surviving a traumatic loss in the war zone will be more likely to mask intense feelings of sadness, pain, vulnerability, anxiety, anger, and guilt."}, {"url": "http://www.cdc.gov/masstrauma/factsheets/public/coping.pdf", "passage_text": "Most everyone has been through a stressful event in his or her life. When the event, or series of events, causes a lot of stress, it is called a traumatic event. Traumatic events are marked by a sense of horror, helplessness, serious injury, or the threat of serious injury or death. "}, {"url": "http://www.mhheroes.com/wp-content/uploads/2013/06/Traumatic-Grief-PS.pptx", "passage_text": "Grief. Grief is a normal reaction to loss and refers to the distress resulting from bereavement. Grief is multidimensional with physical, behavioral and meaning/spiritual components and is characterized by a complex set of cognitive, emotional and social adjustments that follow the death of a loved one. Traumatic Grief and PTSD: Differences. Hyper vigilance in traumatic grief refers to searching the environment for cues of the deceased, whereas in PTSD it refers to fears that the traumatic event will be re-experienced. Sadness is the predominant affect in traumatic grief, whereas fear is foremost in PTSD."}, {"url": "http://www.cookcountysheriff.com/pdf/PeerSupport/AssessmentTraumaticGrief.pdf", "passage_text": "Depression and anxiety symptoms are quite common. So too is traumatic grief which involves a cluster of symptoms, such as emotional numbing, re-experiencing and avoidance, which are similar too but not the same as the symptoms of post-traumatic stress disorder – PTSD (Prigerson, Shear et al. 1999). "}, {"url": "http://www.nctsn.org/trauma-types/traumatic-grief", "passage_text": "If the child’s responses are severe or prolonged and interfere with the child’s functioning, the child may have a condition called Childhood Traumatic Grief (CTG). Thinking about the person who died—even happy thoughts—can lead to frightening images or memories of the way that person died. "}]