[{"url": "http://www.databazaar.com/Inkjet_Cartridge/UserTemplate/Inkjet_and_Laser_Printer_Difference_339.html", "passage_text": "Laser printers are better suited to larger office environments with high-volume and high-quality printing requirements. The differences between a laser and an inkjet printer are generally categorised into a few broad segments, namely, cost (initial and maintenance), speed, quality, space and networking facilities."}, {"url": "http://www.staples.com/sbd/content/article/e-h/howtopicktherightprinter.html", "passage_text": "By Mark Toft. Staples Editor. The price difference between inkjet and laser printers used to be considerable, but now you can get a quality laser printer for just a few hundred dollars. There are, nevertheless, real differences between the two."}, {"url": "http://www.desktoplabels.com/difference-between-inkjet-laser-printers.aspx", "passage_text": "Laser Printers 101. The most obvious difference between inkjet and laser printers is that while inkjets use ink, laser printers use toner to produce an image. Toner is an electrically charged powder that is fused to paper fibers using heat during the printing process."}, {"url": "http://www.differencebetween.net/object/gadgets-object/difference-between-laser-and-inkjet-printers/", "passage_text": "Laser vs Inkjet. There are two common types of printers, inkjet and laser printers. Although they achieve the same end result, the processes they use are not. Inkjet, as the name implies, sprays out a microscopic jet of ink unto the paper. The liquid ink then sticks to the paper and produces color."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070604024701AAE8P8P", "passage_text": "Best Answer: There's a huge difference between the two. Inkjet printers work by spraying ink onto a page. They're usually pretty cheap, but the print quality might not be all that great due to the paper used and the quality of the ink. A laser printer is a whole other paradigm when it comes to printing."}]