[{"url": "http://schools-wikipedia.org/wp/m/Manganese.htm", "passage_text": "Manganese is a chemical element, designated by the symbol Mn. It has the atomic number 25. It is found as a free element in nature (often in combination with iron), and in many minerals. Manganese is a metal with important industrial metal alloy uses, particularly in stainless steels."}, {"url": "http://www.chemicool.com/elements/manganese.html", "passage_text": "Like other transition metals, manganese has more than one common oxidation state. The most stable is +2, which is a pale pink color in aqueous solutions. Also important is +4, brown/black, which is found in manganese dioxide; and +7 found in the purple permanganate anion MnO 4 – . It is also is used extensively to produce a variety of important alloys. For example, the aluminum used to make most soft drinks cans contains about 1% manganese to improve the cans’ stiffness and corrosion resistance."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-182-MANGANESE.aspx?activeIngredientId=182&activeIngredientName=MANGANESE", "passage_text": "MANGANESE Overview Information. Manganese is a mineral that is found in several foods including nuts, legumes, seeds, tea, whole grains, and leafy green vegetables. It is considered an essential nutrient, because the body requires it to function properly. People use manganese as medicine"}, {"url": "http://www.docbrown.info/page07/transition05Mn.htm", "passage_text": "Uses of MANGANESE. Manganese is a hard brittle metal but is a most important metal in steels making tough and hard wearing manganese steel alloys e.g. for use as rock drills and railway points. Ferromanganese (80% Mn, 20% Fe) is commonly used in such alloys."}, {"url": "http://chemistry.about.com/od/elementfacts/a/manganese.htm", "passage_text": "Uses: Manganese is an important alloying agent. It is added to improve the strength, toughness, stiffness, hardness, wear resistance, and hardenability of steels. Together with aluminum and antimony, especially in the presence of copper, it forms highly ferromagnetic alloys. "}, {"url": "http://wanttoknowit.com/uses-of-manganese/", "passage_text": "Manganese is a chemical element with the atomic number of 25 and is represented by the symbol Mn. It is the 12th most common element found in the crust of the Earth. Manganese is a metal that can be found in its free form on Earth, often combined with iron, as well as in many minerals. 1 Manganese is essential in the production of steel and iron and this makes up the most common use of this metal. 2  It improves the workability of the steel when it reaches high temperatures. 3  Adding about 8-15% of manganese also increases the strength of the steel"}, {"url": "https://en.wikipedia.org/wiki/Manganese", "passage_text": "Manganese is a chemical element with symbol Mn and atomic number 25. It is not found as a free element in nature; it is often found in combination with iron, and in many minerals. Manganese is a metal with important industrial metal alloy uses, particularly in stainless steels. The most stable oxidation state for manganese is +2, which has a pale pink color, and many manganese(II) compounds are known, such as manganese(II) sulfate (MnSO 4) and manganese(II) chloride (MnCl 2). This oxidation state is also seen in the mineral rhodochrosite (manganese(II) carbonate)."}, {"url": "http://www.rsc.org/periodic-table/element/25/manganese", "passage_text": "Manganese is too brittle to be of much use as a pure metal. It is mainly used in alloys, such as steel. Steel contains about 1% manganese, to increase the strength and also improve workability and resistance to wear. Manganese steel contains about 13% manganese. Manganese is the fifth most abundant metal in the Earth’s crust. Its minerals are widely distributed, with pyrolusite (manganese dioxide) and rhodochrosite (manganese carbonate) being the most common. The main mining areas for manganese are in China, Africa, Australia and Gabon."}, {"url": "http://www.lookchem.com/Periodic-Table/Manganese/", "passage_text": "The metal tarnishes on exposure to air and, when heated, oxidizes to manganese(II, III) oxide (Mn 3 O 4). The pure metal exists in four allotropic forms. Manganese is used extensively to produce a variety of important alloys and to desulfurize and deoxidize steel. The metal is also used in dry cell batteries. Manganese dioxide is used as a black-brown pigment in paint. "}]