[{"url": "http://www.cancer.gov/about-cancer/causes-prevention/risk/diet/tea-fact-sheet", "passage_text": "Black tea contains much lower concentrations of these catechins than green tea (6). The extended oxidation of black tea increases the concentrations of thearubigins and theaflavins, two types of complex polyphenols (2). Oolong tea contains a mixture of simple polyphenols, such as catechins, and complex polyphenols (2). Tea is one of the most ancient and popular beverages consumed around the world. Black tea accounts for about 75 percent of the world’s tea consumption (1). In the United States, United Kingdom (UK), and Europe, black tea is the most common tea beverage consumed; green tea is the most popular tea in Japan and China (2)."}, {"url": "https://en.wikipedia.org/wiki/Polyphenol", "passage_text": "Some polyphenols are specific to particular food (flavanones in citrus fruit, isoflavones in soya, phloridzin in apples); whereas others, such as quercetin, are found in all plant products such as fruit, vegetables, cereals, leguminous plants, tea, and wine. This article is about larger phenolic substances. In arthropods such as insects and crustaceans polyphenols play a role in epicuticle hardening (sclerotization). The hardening of the cuticle is due to the presence of a polyphenol oxidase. In crustaceans, there is a second oxidase activity leading to cuticle pigmentation."}, {"url": "https://en.wikipedia.org/wiki/Phenolic_content_in_tea", "passage_text": "Most of the polyphenols in green tea are flavan-3-ols (catechins). The phenolic content in tea refers to the phenols and polyphenols, natural plant compounds which are found in tea. These chemical compounds affect the flavor and mouthfeel and are speculated to provide potential health benefits. Polyphenols in tea include catechins, theaflavins, tannins, and flavonoids. Polyphenols found in green tea include but are not limited to epigallocatechin gallate (EGCG) , epigallocatechin, epicatechin gallate, and epicatechin; flavanols such as kaempferol, quercetin, and myricitin are also found in green tea"}, {"url": "http://umm.edu/health/medical/altmed/herb/green-tea/", "passage_text": "Polyphenols contained in teas are classified as catechins. Green tea contains six primary catechin compounds: catechin, gallaogatechin, epicatechin, epigallocatechin, epicatechin gallate, and apigallocatechin gallate (also known as EGCG). Tea has been cultivated for centuries, beginning in India and China. Today, tea is the most widely-consumed beverage in the world, second only to water. Hundreds of millions of people drink tea, and studies suggest that green tea (Camellia sinesis) in particular has many health benefits."}, {"url": "http://www.greentealovers.com/greenteahealthcatechin.htm", "passage_text": "Catechin-Catechin is a tannin peculiar to green tea because the black tea fermentation process reduces catechins in black tea. Catechin is a powerful, water soluable polyphenol and antioxidant that is easily oxidized. Catechin reacts with toxins created by harmful bacteria (many of which belong to the protein family) and harmful metals such as lead, mercury, chrome, and cadmium. Tannin in green tea is mostly catechin and is a key component in its taste providing the astringency."}, {"url": "http://www.amazing-green-tea.com/egcg.html", "passage_text": "Polyphenol is a much abused term. Strictly speaking, 90% of tea polyphenols are catechins, so the two terms are almost synonymous. However, for reasons I do not yet understand, this word has been used interchangeably with green tea extract. A standardized green tea extract contains only about 30% catechins. However, what makes these catechins important is not their potency, but their abundance. About half of the catechin content of tea is EGCG. Just a small quantity of tea leaves will steep many cups of tea. It is this relative abundance that makes green tea special."}, {"url": "http://saveourbones.com/catechins-the-polyphenols-that-stimulate-osteoblast-differentiation-and-much-more/", "passage_text": "Catechins: A Type Of Polyphenol. There are many classes and types of polyphenols, one of which is referred to as flavonols or flavonoids. Catechins are in this group, and are themselves divided into various compounds: catechin, epicatechin, epigallocatechin gallate, epigallocatechin, and epicatechin gallate."}, {"url": "http://www.cancer.gov/about-cancer/causes-prevention/risk/diet/tea-fact-sheet", "passage_text": "The polyphenols, a large group of plant chemicals that includes the catechins (4), are thought to be responsible for the health benefits that have traditionally been attributed to tea, especially green tea. The most active and abundant catechin in green tea is epigallocatechin-3-gallate (EGCG). Tea is one of the most ancient and popular beverages consumed around the world. Black tea accounts for about 75 percent of the world’s tea consumption (1). In the United States, United Kingdom (UK), and Europe, black tea is the most common tea beverage consumed; green tea is the most popular tea in Japan and China (2)."}, {"url": "http://www.lifelinknet.com/siteResources/Products/EGCG.asp", "passage_text": "EGCG stands for ‘epigallocatechin-3-gallate’, a substance that falls into a chemical category called ‘catechins’, which themselves categorized as ‘flavonoids’ (or ‘bioflavonoids’), and are also examples of ‘polyphenols’. EGCG is the most abundant catechin found in tea. "}, {"url": "https://en.wikipedia.org/wiki/Polyphenol", "passage_text": "Polyphenols are also found in animals. In arthropods such as insects and crustaceans polyphenols play a role in epicuticle hardening (sclerotization). The hardening of the cuticle is due to the presence of a polyphenol oxidase. In crustaceans, there is a second oxidase activity leading to cuticle pigmentation."}]