[{"url": "http://radiopaedia.org/articles/cisterna-chyli", "passage_text": "The cisterna chyli (CC) (also known as receptaculum chyli) is a normal anatomical structure seen as saccular area of dilatation in the lymphatic channels that is located in the retrocrural space, usually to the immediate right of the abdominal aorta 4. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Cisterna+chyli", "passage_text": "cis·ter·na chy·'li. a dilated sac at the lower end of the thoracic duct into which the intestinal trunk and two lumbar lymphatic trunks open; it occurs inconsistently and when present is located posterior to the aorta on the anterior aspect of the bodies of the first and second lumbar vertebrae. cisterna cerebellomedulla´ris poste´rior the enlarged subarachnoid space between the undersurface of the cerebellum and the posterior surface of the medulla oblongata; called also cisterna magna."}, {"url": "http://beltina.org/health-dictionary/cisterna-chyli-function-anatomy.html", "passage_text": "Cisterna chyli-function and definition. Cisterna Chyli is a saclike structure of the lymphatic system, located behind the STOMACH, that collects LYMPH draining from the abdomen, notably the gastrointestinal region, and the lower body. The cisterna chyli empties into the THORACIC DUCT. "}, {"url": "http://www.merriam-webster.com/medical/cisterna%20chyli", "passage_text": "Medical Definition of CISTERNA CHYLI. : a dilated lymph channel usually opposite the first and second lumbar vertebrae and marking the beginning of the thoracic duct. What made you want to look up cisterna chyli? "}, {"url": "https://in.answers.yahoo.com/question/index?qid=20061004091441AAtkR8c", "passage_text": "Report Abuse. The cisterna chyli is a dilated sac at the lower end of the thoracic duct into which the intestinal trunk and two lumbar lymphatic trunks flow. It forms the primary lymph vessel transporting lymph and chyle from the abdomen to the left subclavian vein. In the abdomen, cleansed lymph from the intestines is collected in the cysterna chyli, and, except for the upper R quadrant of the body, is collected into the thoracic duct which empties into the circulatory system through the L"}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3587101/", "passage_text": "Anatomical considerations. The cisterna chyli is the abdominal origin of the thoracic duct, and it receives the bilateral lumbar lymphatic trunks. It is located in the retrocrural space, to the right side and behind of the abdominal aorta. Results. Visualisation of the thoracic duct and cisterna chyli was almost 100% on axial and coronal images. The lower section of the thoracic duct was most clearly visualised among the three sections. There was little difference in the maximum size of the thoracic duct"}, {"url": "https://en.wikipedia.org/wiki/Cisterna_chyli", "passage_text": "It is the most common drainage trunk of most of the body's lymphatics. The cisterna chyli is a retro-peritoneal structure, located posterior to the abdominal aorta on the anterior aspect of the bodies of the first and second lumbar vertebrae (L1 and L2). "}, {"url": "http://www.answers.com/Q/What_is_the_cisterna_chyli", "passage_text": "The cisterna chyli collects lymph from the two lumbar trunks which drain the lower limbs and it collects lymph from the intestinal trunk which drains the digestive organs. So, … yes it receives lymph drainage from the digestive organs. It is mainly responsible forwhite-fat drainage, as the name implies. Composition of the lymph in the cisterna chyli has conduit for the lipid product of digestion. General Lymphatic stream gets interstitial fluids and white blood cells, and g … oes through lymph nodes to be cleaned before sent back to the blood vessels to be carried back to the heart."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20061004091441AAtkR8c", "passage_text": "cisterna chyli is supposed to be the second heart of humans... In the abdomen, cleansed lymph from the intestines is collected in the cysterna chyli, and, except for the upper R quadrant of the body, is collected into the thoracic duct which empties into the circulatory system through the L subclavian vein."}]