[{"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-946-GRAPEFRUIT.aspx?activeIngredientId=946&activeIngredientName=GRAPEFRUIT", "passage_text": "Some people inhale grapefruit vapors to help the body retain water, for headache, stress, and depression. Grapefruit seed extract vapor has also been inhaled for the treatment of lung infections. In food and beverages, grapefruit is consumed as a fruit, juice, and is used as a flavoring component. In manufacturing, grapefruit oil and seed extract are used as a fragrance component in soaps and cosmetics; and as a household cleaner for fruits, vegetables, meats, kitchen surfaces, dishes, etc."}, {"url": "http://www.medicalnewstoday.com/articles/263332.php", "passage_text": "Grape seed extract is an industrial derivative of grape seeds, extremely rich in antioxidants and oligomeric proanthocyanidin complexes (OPCs). Grape seeds are linked to a number of. health benefits. Studies on animal models have revealed that the extract can be effective in treating heart diseases. Some experts think that grape seed extract could even have anticancer and cancer chemopreventive potential."}, {"url": "https://en.wikipedia.org/wiki/Grapefruit_seed_extract", "passage_text": "From Wikipedia, the free encyclopedia. Grapefruit seed extract (GSE), also known as citrus seed extract, is a liquid extract derived from the seeds, pulp, and white membranes of grapefruit. Self-made natural GSE processed in the laboratory without synthetic agents is prepared by grinding the grapefruit seed and juiceless pulp, then mixing with glycerin. Commercially available GSE sold to consumers are made from the seed, pulp, glycerin (and in some cases synthetic preservatives) all blended together. Grapefruit seed extract is sold as a food supplement and used in cosmetics because it is a claimed natural antimicrobial."}, {"url": "http://www.preventive-health-guide.com/grape-seed-extract.html", "passage_text": "What you may not know is that grape seed extract contains a vast array of health-giving ingredients, such as protein, lipids, carbohydrates and polyphenols (which come mainly in the form of flavonoids, also known as bioflavonoids). Take grape seeds, for example. Grape seed extract is known as waste product of the winery and grape juice industry, because they don’t go into the finished drinks."}, {"url": "https://en.wikipedia.org/wiki/Grape_seed_extract", "passage_text": "Oral grape seed extract is used in capsules or tablets usually containing 50 mg or 100 mg. Insufficient scientific information is known, however, about how long-term use of grape seed extract might affect health or any disease. From Wikipedia, the free encyclopedia. Grape seed extracts are industrial derivatives from whole grape seeds that have a great concentration of vitamin E, flavonoids, linoleic acid and phenolic procyanidins (also known as OPC or oligomeric procyanidins)."}, {"url": "http://www.medicalnewstoday.com/articles/263332.php", "passage_text": "Although many of these health claims are still not completely backed up by high quality studies, strong evidence is beginning to emerge on grape seed extract's extensive health benefits. Grape seed extract is available as a dietary supplement in either a liquid form, tablets or capsules. Supplements generally contain between 50 to 100 mg of the extract. Grape seeds are linked to a number of. health benefits. Studies on animal models have revealed that the extract can be effective in treating heart diseases. Some experts think that grape seed extract could even have anticancer and cancer chemopreventive potential."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-946-GRAPEFRUIT.aspx?activeIngredientId=946&activeIngredientName=GRAPEFRUIT", "passage_text": "Grapefruit is a citrus fruit. People use the fruit, oil from the peel, and extracts from the seed as medicine. Grapefruit seed extract is processed from grapefruit seeds and pulp obtained as a byproduct from grapefruit juice production. Vegetable glycerin is added to the final product to reduce acidity and bitterness. In food and beverages, grapefruit is consumed as a fruit, juice, and is used as a flavoring component. In manufacturing, grapefruit oil and seed extract are used as a fragrance component in soaps and cosmetics; and as a household cleaner for fruits, vegetables, meats, kitchen surfaces, dishes, etc."}, {"url": "http://umm.edu/health/medical/altmed/herb/grape-seed", "passage_text": "So far, however, there is no clear evidence that taking grape seed extract helps reduce the risk of heart disease. Some researchers speculate that the alcohol in the wine, not the flavonoids, could be responsible for any healthful effects. Others think it could be the combination of alcohol and flavonoids. More research is needed to determine whether grape seed extract helps people with high blood pressure. Cancer. Studies have found that grape seed extracts may prevent the growth of breast, stomach, colon, prostate, and lung cancer cells in test tubes."}, {"url": "https://nccih.nih.gov/health/grapeseed", "passage_text": "The grape seeds used to produce grape seed extract are generally obtained from wine manufacturers. The leaves and fruit of the grape have been used medicinally since ancient Greece. Grape Seed Extract: At a Glance. Information about grape seed extract, studied for chronic venous insufficiency, diabetic retinopathy, other conditions. From the U.S. government’s National Center for Complementary and Integrative Health."}]