[{"url": "https://en.wikipedia.org/wiki/Tim_Thomas_(basketball)", "passage_text": "Timothy Mark Tim Thomas (born February 26, 1977) is a retired American professional basketball player. The Suns went on to win that game in the overtime period when Thomas hit another important three-pointer to force a game 7; a game which they won by 31 points to claim the series and complete the 3–1 series comeback."}, {"url": "https://en.wikipedia.org/wiki/Tim_Thomas_(ice_hockey)", "passage_text": "Thomas has mentioned that he chose 34 as his jersey number with the Panthers in honor of John Vanbiesbrouck, a goaltender from Michigan that Thomas grew up watching. Tim Thomas was acquired by the Dallas Stars on March 5, 2014, in exchange for goaltender Dan Ellis. Beginning in 2002–03, Thomas played his initial two seasons with Boston's AHL affiliate, the Providence Bruins. He made his National Hockey League (NHL) debut with the Bruins during the 2002–03 season, appearing in four games total, with a .907 save percentage and a 3–1 record."}, {"url": "https://en.wikipedia.org/wiki/Tim_Thomas_(basketball)", "passage_text": "A versatile 6'10 forward with a soft shooting touch, Thomas was tabbed as a future NBA star when he was still in high school, and was selected to the McDonald's All-American team after averaging 25.3 points and 14.5 rebounds per game as a senior at Paterson Catholic High School. The Suns went on to win that game in the overtime period when Thomas hit another important three-pointer to force a game 7; a game which they won by 31 points to claim the series and complete the 3–1 series comeback."}, {"url": "https://en.wikipedia.org/wiki/Tim_Thomas_(ice_hockey)", "passage_text": "On April 2, 2009 Thomas agreed to a four-year extension with the Bruins, through the 2012–13 season. The contract saw him make $6 million the first two seasons, then $5 million and $3 million the final two seasons for an average annual salary of $5 million. Beginning in 2002–03, Thomas played his initial two seasons with Boston's AHL affiliate, the Providence Bruins. He made his National Hockey League (NHL) debut with the Bruins during the 2002–03 season, appearing in four games total, with a .907 save percentage and a 3–1 record."}, {"url": "http://www.yelp.com/biz/monterey-waterfront-and-cannery-row-tours-monterey", "passage_text": "History. Established in 2010. Tim Thomas has been conducting walking tours of Monterey's Cannery Row and the Monterey Waterfront for over 15 years. Tim has designed tours for the Monterey Bay Aquarium, CA State Parks and the Monterey Bay National Marine Sanctuary and has led tours for all age groups. He is the author of The Japanese on the Monterey Peninsula and co-author of Monterey's Waterfront published in 2006. Tim has lectured extenstivly on the history of the Monterey fishing industry both here in the Monterey area and in Japan."}, {"url": "https://en.wikipedia.org/wiki/Tim_Thomas_(basketball)", "passage_text": "On January 5, 2001, Thomas connected on eight three-point field goals in the second half of Milwaukee's 119–115 victory over Portland. During his time with the Bucks, then-teammate Ray Allen was quoted as saying, If he wanted to, Tim Thomas could be the best player in the league.. Nevertheless, after a strong playoff performance that year, Thomas signed a new deal worth roughly $66 million over six years. The Suns went on to win that game in the overtime period when Thomas hit another important three-pointer to force a game 7; a game which they won by 31 points to claim the series and complete the 3–1 series comeback."}, {"url": "http://www.healthgrades.com/provider/timothy-thomas-x69m8", "passage_text": "Dr. Timothy D. Thomas, DPM http://d1ffafozi03i4l.cloudfront.net/img/prov/X/6/9/X69M8_w120h160_v11198.jpg Visit Healthgrades for information on Dr. Timothy D. Thomas, DPM. Save Saved. "}, {"url": "https://en.wikipedia.org/wiki/Tim_Thomas_(ice_hockey)", "passage_text": "He finally emerged as the Bruins' starting goaltender at age 32. Thomas is a two-time winner of the Vezina Trophy (2009 and 2011) as the league's best goaltender, and was a member of Team USA in the 2010 Winter Olympics in Vancouver. Thomas won the Conn Smythe Trophy as the most valuable player in the 2011 Stanley Cup playoffs. Beginning in 2002–03, Thomas played his initial two seasons with Boston's AHL affiliate, the Providence Bruins. He made his National Hockey League (NHL) debut with the Bruins during the 2002–03 season, appearing in four games total, with a .907 save percentage and a 3–1 record."}]