[{"url": "http://www.webmd.com/a-to-z-guides/swollen-lymph-nodes-topic-overview", "passage_text": "1 Glands in the armpit (axillary lymph nodes) may swell from an injury or infection to the arm or hand. 2  A rare cause of axillary swelling may be breast cancer or lymphoma. 3  The lymph nodes in the groin (femoral or inguinal lymph nodes) may swell from an injury or infection in the foot, leg, groin, or genitals. Lymph nodes are small, bean-shaped glands throughout the body. They are part of the lymph system, which carries fluid (lymph fluid), nutrients, and waste material between the body tissues and the bloodstream. The lymph system is an important part of the immune system, the body's defense system against disease. The lymph nodes filter lymph fluid as it flows through them, trapping bacteria, viruses, and other foreign substances, which are then destroyed by special white blood cells called lymphocyte"}, {"url": "http://www.cancer.org/cancer/castlemandisease/detailedguide/castleman-disease-what-is-castleman-disease", "passage_text": "Castleman disease (CD) is a rare disease of lymph nodes and related tissues. It is also known as Castleman’s disease, giant lymph node hyperplasia, and angiofollicular lymph node hyperplasia (AFH). It was first described by Dr. Benjamin Castleman in the 1950s. About lymph nodes and lymphoid tissue. To understand Castleman disease, it helps to know about the body’s lymph system. Lymphoid tissue, also known as lymphatic tissue, is the main part of the immune system. It is formed by different types of cells that work together to help the body fight infections."}, {"url": "http://www.cancer.org/cancer/cancerbasics/lymph-nodes-and-cancer", "passage_text": "Lymph nodes and what they do. Lymph vessels route lymph fluid through nodes throughout the body. Lymph nodes are small structures that work as filters for harmful substances. They contain immune cells that can help fight infection by attacking and destroying germs that are carried in through the lymph fluid."}, {"url": "http://www.mayoclinic.org/diseases-conditions/swollen-lymph-nodes/basics/causes/CON-20029652", "passage_text": "A lymph node is a small, round or bean-shaped cluster of cells covered by a capsule of connective tissue. The cells are a combination of lymphocytes — which produce protein particles that capture invaders, such as viruses — and macrophages, which break down the captured material. The most common cause of swollen lymph nodes is an infection, particularly a viral infection, such as the common cold. However, there are other types of infections, including parasitic and bacterial, and other possible causes of swollen lymph nodes. They include:"}, {"url": "https://en.wikipedia.org/wiki/Swollen_lymph_nodes", "passage_text": "(Redirected from Swollen lymph nodes). Lymphadenopathy or lymphadenitis refers to lymph nodes which are abnormal in size, number or consistency and is often used as a synonym for swollen or enlarged lymph nodes. Common causes of lymphadenopathy are infection, autoimmune disease, or malignancy"}, {"url": "http://www.webmd.com/a-to-z-guides/swollen-lymph-nodes-topic-overview", "passage_text": "Lymph nodes often swell in one location when a problem such as an injury, infection, or tumor develops in or near the lymph node. Which lymph nodes are swollen can help identify the problem. 1  The glands on either side of the neck, under the jaw, or behind the ears commonly swell when you have a cold or sore throat. Lymph nodes are small, bean-shaped glands throughout the body. They are part of the lymph system, which carries fluid (lymph fluid), nutrients, and waste material between the body tissues and the bloodstream. The lymph system is an important part of the immune system, the body's defense system against disease. The lymph nodes filter lymph fluid as it flows through them, trapping bacteria, viruses, and other foreign substances, which are then destroyed by special white blood cells called lymphocytes"}, {"url": "http://www.news-medical.net/health/Lymph-nodes-and-Disease.aspx", "passage_text": "Lymph nodes are filters in the lymphatic system that sieve out infectious material as well as toxins that come via the lymphatic channels. These may be affected commonly by certain diseases or conditions. The diseases or disorders of the lymphatic system and lymph nodes include lymphedema, lymphadenopathy and so forth. "}]