[{"url": "https://www.my.vss20.com/KCDL/ImportantInformation/Rels/Appraiser/Single%20Family%20Residence%20with%20Accessory%20Unit%20or%20Multi-Family.pdf", "passage_text": "ADUs are usually subordinate in size, location, and appearance to the primary unit and may or may not have separate means of ingress or egress. Attached units, contained within a single-family home, known variously as mother-in-law apartments, are the most common type of accessory dwelling unit. Accessory units usually involve the renovation of a garage, basement, or small addition to a single-family home.” 2 UNIT MULTI-FAMILY DWELLING A residential property with a single deed that is comprised of two separate self contained dwelling units."}, {"url": "http://portal.hud.gov/hudportal/documents/huddoc?id=DOC_35984.doc", "passage_text": "This report form is designed to report an appraisal of a one-unit property or a one-unit property with an accessory unit; including a unit in a planned unit development (PUD), based on an interior and exterior inspection of the subject property. "}, {"url": "https://accessorydwellings.files.wordpress.com/2012/12/appraisingpropertieswithadusbrownwatkinsnov2012.pdf", "passage_text": "The Appraisal Journal, Fall 2012 Understanding and Appraising Properties with Accessory Dwelling Units 308. Martin John brown is a writer and researcher with a background in statistics and ecology, and an interest in architecture and development. The accessory units were usually small—the median was 487 finished square feet, 75% were 758 square feet or smaller, and the maximum was 1176 square feet. Meanwhile the primary units ranged in size from 912 to 2111 square feet, with a median size of 153"}, {"url": "http://sacramentoappraisalblog.com/2014/06/17/is-it-a-second-unit-or-an-accessory-dwelling/", "passage_text": "The Short Answer: A second unit and an accessory dwelling might look like the same thing to a casual observer, but what matters most in determining whether a structure is a second unit or accessory dwelling is what zoning allows and whether the market perceives the structure as a second unit or not. Is it a second unit or an accessory dwelling? How do you know the difference? If the post office gives the second structure an address, that makes it a second unit, right?"}, {"url": "http://appraisal.wikia.com/wiki/Multi-Family_Property_vs._Accessory_Dwelling_Unit_(ADU)", "passage_text": "29 pages on this wiki. Making a determination between whether a property is a Multi-Family/Small Income property (duplex) or a single family dwelling with an Accessory Dwelling Unit (ADU) can be challenging in some circumstances. When the use is not readily apparent the appraiser has to make a determination. "}, {"url": "https://www.fanniemae.com/content/guide_form/1004.pdf", "passage_text": "This report form is designed to report an appraisal of a one-unit property or a one-unit property with an accessory unit; including a unit in a planned unit development (PUD), based on an interior and exterior inspection of the subject property. "}, {"url": "http://www.appraisalinstitute.org/accessory-dwelling-units-may-have-higher-values-when-using-income-approach-the-appraisal-journal/", "passage_text": "CHICAGO (Nov. 20, 2012) – Residential properties with accessory dwelling units — such as in-law apartments or coach houses — may have higher value potential if the properties are valued for investment income using the income capitalization approach, according to an article published this week in The Appraisal Journal. "}, {"url": "https://www.fanniemae.com/content/guide/selling/b4/1.3/05.html", "passage_text": "If it is determined that the property contains an accessory dwelling unit that does not comply with zoning, the property is eligible under the following additional conditions: The lender confirms that the existence will not jeopardize any future property insurance claim that might need to be filed for the property. The appraisal report demonstrates that the improvements are typical for the market through an analysis of at least one comparable property with the same use. The borrower qualifies for the mortgage without considering any rental income from the accessory unit. (See B3-3.1-08, Rental Income, for further information.)."}, {"url": "https://www.fanniemae.com/content/guide/selling/b4/1.3/05.html", "passage_text": "If the property contains an accessory unit, the property is eligible under the following conditions: The property is one-unit. The appraisal report demonstrates that the improvements are typical for the market through an analysis of at least one comparable property with the same use. The borrower qualifies for the mortgage without considering any rental income from the accessory unit. (See B3-3.1-08, Rental Income, for further information.)."}, {"url": "http://appraisersforum.com/forums/threads/one-with-accessory-unit.172246/", "passage_text": "You may have to use a combination of all three. Accessory Unit / Accessory Dwelling Unit. The accessory unit is defined as a habitable living unit added to, created within, or detached from a single-family dwelling that provides the basic requirements for living, sleeping, eating, cooking, and sanitation. Accessory units usually involve the renovation of a garage, basement, or small addition to a single-family home. FHA Criteria. “Accessory dwelling unit means a subordinate dwelling unit may or may not be incorporated within, or detached from a single-family structure."}]