[{"url": "http://www.webmd.com/anxiety-panic/specific-phobias", "passage_text": "In this article. The term phobia refers to a group of anxiety symptoms brought on by certain objects or situations. A specific phobia, formerly called a simple phobia, is a lasting and unreasonable fear caused by the presence or thought of a specific object or situation that usually poses little or no actual danger."}, {"url": "http://www.phobia-fear-release.com/common-symptoms-of-phobias-2.html", "passage_text": "Though there are three different types of phobias, their symptoms are more or less similar. The different types and the common symptoms of phobias. Specific phobia: a persistent, unreasonable fear, triggered by the presence or anticipation of a particular object or situation is called a specific phobia."}, {"url": "http://www.healthcommunities.com/phobias/causes.shtml", "passage_text": "Another common symptom experienced by people with phobias is anticipatory anxiety. Anticipatory anxiety can cause people to avoid situations in which they might have a panic attack or to avoid the objects that trigger a response of intense fear and anxiety."}, {"url": "http://www.healthcommunities.com/phobias/causes.shtml", "passage_text": "Phobia Signs and Symptoms. Panic attack is common in people with agoraphobia, social phobia, and specific phobia. Symptoms experienced during a panic attack include the following: 1  Abdominal distress (diarrhea, nausea, constipation). 2  Chest pain or discomfort. 3  Chills or hot flashes. 4  Fear of dying."}, {"url": "http://www.healthcommunities.com/phobias/causes.shtml", "passage_text": "Panic attack is common in people with agoraphobia, social phobia, and specific phobia. Symptoms experienced during a panic attack include the following: 1  Abdominal distress (diarrhea, nausea, constipation). 2  Chest pain or discomfort. 3  Chills or hot flashes. 4  Fear of dying."}, {"url": "http://www.webmd.com/anxiety-panic/understanding-phobias-symptoms", "passage_text": "1 Specific phobia, a persistent, irrational fear of particular objects or situations, such as snakes, spiders, heights, blood, flying, or elevators. 2  Social phobia, or social anxiety disorder, a persistent, irrational fear of situations where you may be scrutinized or criticized or embarrassed by other people."}]