[{"url": "http://www.onegreenplanet.org/natural-health/foods-that-lower-your-blood-sugar-quickly/", "passage_text": "Healthy blood sugars are also vital to prevent or manage Type 2 diabetes, hypertension, and hypoglycemia. Eating a diet that supports your blood sugar can also help prevent obesity. Plant-based foods are jam-packed with fiber, which is the main reason they’re so supportive of blood sugar levels. Fiber slows down the release of sugar within the bloodstream, which helps steady insulin levels. This prevents those blood sugar “ups and downs” that foods high in refined sugars, animal foods, and highly-processed foods can cause."}, {"url": "http://www.onegreenplanet.org/natural-health/foods-that-lower-your-blood-sugar-quickly/", "passage_text": "To take care of your blood sugar, all you have to do is prioritize higher fiber sources of whole foods versus foods lower in fiber, such as foods with refined or added sugars, animal products (which dramatically raise insulin), and most processed foods. Fiber slows down the release of sugar within the bloodstream, which helps steady insulin levels. This prevents those blood sugar “ups and downs” that foods high in refined sugars, animal foods, and highly-processed foods can cause."}, {"url": "http://www.menshealth.com/nutrition/12-diabetes-powerfoods", "passage_text": "Yes. Certain foods are packed with nutrients that stabilize blood sugar levels, protect your heart, and even save your vision from the damaging effects of diabetes. These 12 foods can give you an extra edge against diabetes and its complications. 1. "}, {"url": "http://www.healthline.com/health-slideshow/foods-lower-blood-sugar", "passage_text": "But studies show that eating certain foods may also help lower blood sugar. Seasoning your food right, eating certain fruits, and eating the right kind of fats might help you stave off diabetes. Fenugreek seed is related to beans. It’s used as a supplement for nursing mothers, and in a wide range of herbal medicines. A 2013 review of herbal food supplements found compelling evidence that fenugreek does lower blood sugar levels in people with both type 1 and type 2 diabetes as well as those with prediabetes."}, {"url": "http://www.webmd.com/diabetes/features/diabetic-diet-6-foods-control-blood-sugar", "passage_text": "Reviewed by John A. Seibel, MD. Coffee and cinnamon have made headlines recently as foods that might be able to cut the risk of diabetes or help to improve blood sugar levels. But don't get the idea that such foods are magic bullets for your diabetic diet, experts warn. Her action plan was in keeping with the latest research on diabetes,... Nevertheless, some foods, such as white bread, are converted almost right away to blood sugar, causing a quick spike. Other foods, such as brown rice, are digested more slowly, causing a lower and gentler change in blood sugar."}, {"url": "http://www.webmd.com/diabetes/features/diabetic-diet-6-foods-control-blood-sugar?page=2", "passage_text": "Broccoli, Spinach, and Green Beans. Add plenty of nonstarchy vegetables, such as broccoli, spinach, and green beans, to your diabetic diet, diabetes experts say. These foods are high in fiber and low in carbohydrates, which make them ideal for people with diabetes. "}, {"url": "http://www.livestrong.com/article/15542-naturally-lower-blood-sugar-levels/", "passage_text": "Add some cinnamon to your diet to naturally lower your blood sugar level. According to Pennington Biomedical Research Center, results from one of its studies using mice suggest that cinnamon extract plays a regulatory role in blood glucose levels. "}, {"url": "http://www.youtube.com/watch?v=uf9kiJNim88", "passage_text": "Please try again later. http://lower-blood-sugar.onlineinfore... Foods that lower blood sugar levels can be savory, sweet and simple, all of which are good qualities in any diet. Add these tasty 10 foods to lower blood sugar naturally. 1  Howto & Style. 2  Standard YouTube License."}, {"url": "http://www.wikihow.com/Lower-Blood-Sugar-With-Diet", "passage_text": "Fiber cleanses your system and soluble fiber (see below) helps control your blood sugar levels. Most vegetables are high in fiber, especially those with leafy greens. Many fruits, nuts, and legumes are also rich in fiber, as are whole-wheat products. 1  Soluble fiber is very important for maintaining good health. "}]