[{"url": "https://answers.yahoo.com/question/index?qid=20081111210828AA0EhL3", "passage_text": "Answers I found online ranges from 3000-5000 steps per day. Less active will be around the 3000 range-very active (people who exercise will be around 10,000 or more) 10,000 step is roughly 5 miles. So if you walk to class a lot its easy to guess how far away your class is to your dorm/apartment. Rating Newest Oldest. Best Answer: Men: The men in the survey took an average of 7192 steps per day. Women: The women in the survey took an average of 5210 step per day. BMI Effects: Study participants with larger body mass indexes (a measure of overweight and obesity) on average took fewer steps"}, {"url": "http://www.themedicalquestions.com/fitness/how-many-steps-does-an-average-person-take-in-a-day.html", "passage_text": "http://wiki.answers.com/Q/How_many_steps_does_the_average_person_take_each_day. on average a person takes about 3,000-5,000 steps a day. you should take at least 10,000 steps a day :]. http://answers.ask.com/Travel/Other/how_many_steps_should_you_take_in_a_day. Increasing your steps per day is a great way to get healthy! Although 10,000 steps has been used as a standard, as little as 6,000 steps a day have been proven to have great health benefits."}, {"url": "https://answers.yahoo.com/question/index?qid=20081111210828AA0EhL3", "passage_text": "Okay... I know that you SHOULD take 10,000 steps per day. But what is a realistic average of how many steps a person takes per day? Or about how many steps does a female, working, college student take per day? Rating Newest Oldest. Best Answer: Men: The men in the survey took an average of 7192 steps per day. Women: The women in the survey took an average of 5210 step per day. BMI Effects: Study participants with larger body mass indexes (a measure of overweight and obesity) on average took fewer steps."}, {"url": "https://www.quora.com/How-many-steps-does-the-average-American-take-per-day", "passage_text": "A study tracked the steps of 1,136 adults around the United States who wore pedometers for two days in 2003. The results were compared to similar pedometer studies in Switzerland, Australia and Japan. The data collected showed that Americans, on average, took 5,117 steps a day, far short of the averages in western Australia (9,695 steps), Switzerland (9,650 steps) and Japan (7,168 steps). Written 17 Nov, 2014 • View Upvotes. "}, {"url": "http://www.answers.com/Q/How_many_steps_does_the_average_person_take_each_day", "passage_text": "on average a person takes about 3,000-5,000 steps a day. you should take at least 10,000 steps a day :]. "}, {"url": "http://www.answers.com/Q/How_many_steps_does_the_average_American_take", "passage_text": "Confidence votes 7. The average American takes between 3,000 and 5,000 steps per day. However a healthy amount of steps to take in a day is 10,000 or more. "}, {"url": "http://www.nhs.uk/LiveWell/loseweight/Pages/10000stepschallenge.aspx", "passage_text": "The average person walks between 3,000 and 4,000 steps per day. To find out how many steps you take each day, buy a pedometer similar to the one in the video at the bottom of this page. Clip it firmly to your belt or waistband, and it will measure every step you take: around the house, across the office, window shopping, to school or the park."}, {"url": "http://www.themedicalquestions.com/fitness/how-many-steps-does-an-average-person-take-in-a-day.html", "passage_text": "Health related question in topics Demographics Fitness .We found some answers as below for this question How many steps does an average person take in a day,you can compare them. The average person takes from 3,000 to 5,000 steps per day and will walk around the earth twice in their lifetime. ChaCha on. [ Source: http://www.chacha.com/question/how-many-steps-does-an-average-person-take-in-a-day ]. More Answers to  How many steps does an average person take in a day . http://answers.ask.com/Travel/Other/how_many_steps_should_you_take_in_a_day. Increasing your steps per day is a great way to get healthy! Although 10,000 steps has been used as a standard, as little as 6,000 steps a day have been proven to have great health benefits."}]