[{"url": "http://www.differencebetween.com/difference-between-broiling-and-vs-baking/", "passage_text": "Broiling vs Baking. The temperature of the heat that one uses when using either broiling or baking is the key difference between the two cooking techniques. If you know nothing about broiling and baking, they are both ways of cooking food using an oven. When we look at how heat energy is provided by the oven for broiling, we see that infrared radiation is the process that takes place in the case of broiling to cook the food. Those who know about these two heat carrying processes know that infrared radiation has the capacity to char food items in close vicinity."}, {"url": "https://en.wikipedia.org/wiki/Grilling", "passage_text": "Grilling is a form of cooking that involves dry heat applied to the surface of food, commonly from above or below (as in North America). Grilling usually involves a significant amount of direct, radiant heat, and tends to be used for cooking meat quickly. "}, {"url": "http://www.wikihow.com/Oven-Broil", "passage_text": "Broiling is a fast and easy way to cook foods without extra oils or fats. Broiling works by applying a heat source directly above the food. This high heat cooks the food quickly from the top down. Both meat and vegetables can be broiled; the use of seasonings, liquids or oils is entirely optional. Turn over thin cuts of meat or thicker cuts you are broiling to rare or medium rare after 7 to 10 minutes, depending on how far away the food is from the burners. Turn over thicker cuts of meat you are broiling to well done after 15 minutes. Replace the broiler pan and close the oven."}, {"url": "http://www.wisegeek.com/what-is-broiling.htm", "passage_text": "Broiling is a cooking process which involves the use of very high heat for a short period of time. In addition to producing food quickly, broiling is also used for low fat cooking. As a general rule of thumb, thinner cuts of meat are more suitable for broiling, to ensure that the meat is cooked all the way through. Meat, poultry, vegetables, and seafood can all be broiled. There are two different types of broiling. One involves cooking the food in an oven which is set to a “broil” setting. The other is called pan broiling, and it takes places on the stovetop using dry, high heat. Typically, food is marinated before broiling. Most cooks go light on the fat, both to make the food healthier and to reduce the amount of smoke produced. Marinades which are high in sugar can also produce a great deal of smoke, and may form unappetizing bits of charred material."}, {"url": "http://www.youtube.com/watch?v=rSHPkVZ0sFA", "passage_text": "Follow these four easy steps to better broiling. Broiling is a great method for getting grill-like results in the kitchen. Both grilling and broiling are fast and easy, and both use direct, high heat to brown and cook food. Broiling is like grilling, then, only turned on its head. In this video you'll learn how to broil in four easy steps. "}, {"url": "http://www.premierrange.com/faq-broiling.php", "passage_text": "1 Always remove the broiler pan from the broiler compartment as soon as broiler pan cools. 2  Replace broiler pan and tray after cleaning. 3  Broiler pan and tray must be in place for any oven operation. 4  Do Not step on or apply weight to the broiler door when it is open. 5  This could damage the door. Pull the entire broiler compartment forward to the stop position. The broiler compartment door folds down to allow for easy removal of the broiler pan for turning foods. Gas broiling is cool and clean since broiling is done with the broiler door closed and any smoke is consumed by the flame."}, {"url": "http://www.momsbudget.com/cooking/whatisbroiling.html", "passage_text": "Broiling is actually a setting on your oven-most ovens have off, bake and broil. With broiling you are heating food by using the top element in your oven to cook. The bake setting instead bakes your food by surrounding the food by an even heat. Normally, you use the broil setting with the oven door open ajar. Broiling is often used for browning the tops of dishes, particularly with cheese such as a lasagna. It can also be used to cook a steak when a barbeque isn't available. If you are broiling anything that drips juices or fat, use a broiling pan. This is a pan that is similar to a rimmed baking dish on the bottom but the top (that you place the food on top of) has slats that allow the fat or juices to drop down to the bottom"}, {"url": "http://recipes.howstuffworks.com/tools-and-techniques/question228.htm", "passage_text": "Baking and broiling are completely different ways to cook food. 1  In baking, you are trying to heat food by surrounding the food with hot air. 2  In broiling, you are trying to heat food using infrared radiation. Broiling generally creates a huge mess inside the oven from all the splattering, as well as tons of smoke outside the oven (and therefore in the kitchen), which is why most people use the grill instead of the oven's broiler. Launch Video Sara Snow: Detox Your Home: Oven. Launch Video."}, {"url": "http://www.premierrange.com/faq-broiling.php", "passage_text": "Broiling is a fast method for cooking tender cuts of meats, poultry, ham and fish. The broiler compartment is located beneath the oven. Pull the entire broiler compartment forward to the stop position. The broiler compartment door folds down to allow for easy removal of the broiler pan for turning foods. Gas broiling is cool and clean since broiling is done with the broiler door closed and any smoke is consumed by the flame. To operate the broiler, push-turn the oven control counter-clockwise to the BROIL positio"}]