[{"url": "http://shakerheritage.org/educational-programs/adult-programs/history-of-the-shakers", "passage_text": "The Shakers were a religious group that fled to the American colonies in 1774 to escape persecution in England, and to establish a utopian society. The group’s leader was. Ann Lee. There were eight others in the group including Ann’s brother, William. These early Shakers found a suitable site — land eight miles northwest of Albany and, accompanied by four others who had come from England, settled there in 1776."}, {"url": "http://www.answers.com/Q/Where_did_the_shakers_come_from", "passage_text": "Making the world better, one answer at a time. The Shakers were founded in 1747, in Manchester, England, from a group of dissenting Quakers. A handful of them came to America in 1774 and called themselves United Society of Believers in Christ's Second Appearing. "}, {"url": "http://www.metmuseum.org/toah/hd/shak/hd_shak.htm", "passage_text": "| More. Shakers first came to America from England in 1774. Led by the prophet Ann Lee, this small and radical group of English Quakers believed that the millennium—the thousand years of peace with Christ before the end of the world—was at hand. "}, {"url": "http://www.pbs.org/wnet/religionandethics/2011/03/18/september-17-2010-the-shakers/7026/", "passage_text": "ABERNETHY: Shakers originated in England in the 1700s, an ecstatic offshoot of the more sedate Quakers led by a charismatic preacher Shakers call Mother Ann Lee. Like today’s Pentecostals, Shakers who felt the Holy Spirit would roll and twirl and speak in tongues. Shaking Quakers they were called—Shakers. BOB ABERNETHY, host and correspondent: Now, a visit with the surviving Shakers, the Christian group known for its devotion to God, demanding lifestyle, beautiful furniture, and joyful songs. Before the Civil War there were nearly 6000 Shakers in 23 communities."}, {"url": "http://bar-b-k.tripod.com/id16.html", "passage_text": "The religious group more commonly known as Shakers, originated in the mid 1700's in England, as an offshoot of the Quakers. Indeed, they were sometimes called the Shaking Quakers. "}, {"url": "http://shakerheritage.org/educational-programs/adult-programs/history-of-the-shakers", "passage_text": "Ann Lee. Origin of the Shakers. The founder of the Shakers, Ann Lee, was a blacksmith’s daughter and a mill hand in Manchester, England. Looking for a more personal and emotional religion than the official Church of England, in 1758 she joined a group called the Wardley Society that had left the Quakers. There were eight others in the group including Ann’s brother, William. These early Shakers found a suitable site — land eight miles northwest of Albany and, accompanied by four others who had come from England, settled there in 1776."}, {"url": "https://en.wikipedia.org/wiki/Shakers", "passage_text": "The Shakers were one of a few religious groups formed in 18th century in the Northwest of England; they branched off from a group of Quakers in England. James and Jane Wardley and others left at a time when the Quakers were weaning themselves away from frenetic spiritual expression. At its peak in the mid-19th century, there were 6,000 Shaker believers. By 1920, there were only 12 Shaker communities remaining in the United States. In the present day, there is only one active Shaker village, Sabbathday Lake Shaker Village, which is located in Maine."}, {"url": "http://rootsweb.ancestry.com/~quakers/shakers.htm", "passage_text": "The Shakers rose in England in the mid-eighteenth century, followers of Ann Lee, whom they called the Blessed Mother Ann.. Shaker teaching was that Ann was the female incarnation of Christ come to earth again. "}, {"url": "http://www.answers.com/Q/Where_did_the_shakers_originate_from", "passage_text": "The Shakers were founded in 1747, in Manchester, England, from a  group of dissenting Quakers. A handful of them came to America in  1774 and called themselves United Societ … y of Believers in Christ's  Second Appearing. Known to Shakers as Chosen Land, the village is commonly referred to as Sabbathd … ay Lake Shaker Village. As of 2010, there are three active members.Sister Frances Carr was born 1927 in Lewiston, Maine."}]