[{"url": "https://en.wikipedia.org/wiki/Geography_of_Canada", "passage_text": "The population of Canada, some 34,980,000 as of November 2012, is concentrated in the south in proximity to its border with the contiguous U.S.; with a population density of 3.5 people per square kilometre (9.1/sq mi), it is one of the most sparsely populated countries in the world."}, {"url": "http://www.123independenceday.com/canada/geography.html", "passage_text": "Physical Features. The geography of Canada is distinguished for its size, being the second largest country in the world after Russia which is the largest. Covering a total area of 3.9 million square miles, Canada occupies most of the northern half of the North American continent."}, {"url": "http://www.albertacanada.com/opportunity/choosing/province-climate-geography.aspx", "passage_text": "Geography. Alberta is the fourth-largest province in Canada, covering an area of 661,000 square kilometres (255,000 square miles) — about the same size as the state of Texas and twice the size of Japan."}, {"url": "https://en.wikipedia.org/wiki/Geography_of_Canada", "passage_text": "In total area, Canada is slightly larger than both the U.S. and China; however, Canada ranks fourth in land area (i.e. total area minus the area of lakes and rivers)—China is 9,326,410 km 2 (3,600,950 sq mi) and the U.S. is 9,161,923 km 2 (3,537,438 sq mi)."}, {"url": "http://www.albertacanada.com/business/overview/location-and-geography.aspx", "passage_text": "Location and geography. Occupying the northern half of the North American continent, the province of Alberta is located between 60 degrees and 49 degrees latitude north along the Canada-U.S. border. Spanning 661,185 square kilometres (255,200 square miles), Alberta covers almost 7% of Canada’s land mass."}, {"url": "https://www.newcomerscanada.ca/arrival-and-settlement/geography-and-climate/", "passage_text": "CANADIAN GEOGRAPHY & CLIMATE. Canada is the second largest country on earth, covering an area of 10 million square kilometres (3.9 million square miles). Three oceans border Canada: the Pacific Ocean in the west, the Atlantic Ocean in the east, and the Arctic Ocean to the north."}, {"url": "http://geography.about.com/od/atlas/a/canada.htm", "passage_text": "Canada is the world's second largest country by area but its population, at slightly less than that of the state of California, is small by comparison. Canada's largest cities are Toronto, Montreal, Vancouver, Ottawa and Calgary."}]