[{"url": "http://www.flsenate.gov/Offices/President", "passage_text": "The Senate President is a constitutional officer who leads the Florida Senate for a two-year term. The President, who is elected by members of the Senate, manages the operations of the Senate and presides over its sessions. "}, {"url": "http://www.legislature.ca.gov/the_state_legislature/leadership_and_caucuses/leadership.html", "passage_text": "Secretary of the Senate, Daniel Alvarez. The Secretary of the Senate is one of the three officers of the Senate who are elected by the total Membership, the other two officers being the President pro Tempore and the Chief Sergeant-at-Arms. He or she is the chief parliamentarian and keeper of the legislative records. President pro Tempore, Kevin de Le n (D). The President pro Tempore, who also serves as the Chair of the Rule Committee, is the actual leader of the Senate. He or she is elected by the Members at the beginning of each Session."}, {"url": "http://kids.clerk.house.gov/high-school/lesson.html?intID=41", "passage_text": "The Sergeant at Arms is the chief law enforcement and protocol officer for the U.S. House of Representatives. The role of House Sergeant at Arms dates back to the first Congress (1789–1791). Chief Administrative Officer. The newest of the House officers, the Office of the Chief Administrative Officer was established at the beginning of the 104th Congress (1995–1997). The office was created to provide infrastructure support for Members and committees to operate their offices."}, {"url": "http://www.answers.com/Q/Who_is_the_chief_officer_of_senate", "passage_text": "Who is the Chief officer of the house? The Chief Administrative Officer (CAO) position was authorized by  H. Res. 6 of the 104th Congress. The first Chief Officer was  Leonard P. Wishart, appointed on October 23, … 1992. The current  Chief Officer is Ed Cassidy, elected on January 7, 2014. The President of the United States, except during time of disability under the 25th Amendment, at which point in time the chief officer of the executive branch is the Acting P … resident of the United States."}, {"url": "https://en.wikipedia.org/wiki/Chief_Administrative_Officer_of_the_United_States_House_of_Representatives", "passage_text": "Along with the other House officers, the Chief Administrative Officer is elected every two years when the House organizes for a new Congress. The majority and minority party conferences (the Democratic Caucus of the United States House of Representatives and Republican Conference of the United States House of Representatives) nominate candidates for the House officer positions after the election of the Speaker of the House."}, {"url": "http://www.answers.com/Q/Who_is_chief_officer_of_House_of_Representatives", "passage_text": "Who is the Chief officer of the house? The Chief Administrative Officer (CAO) position was authorized by  H. Res. 6 of the 104th Congress. The first Chief Officer was  Leonard P. Wishart, appointed on October 23, … 1992. The current  Chief Officer is Ed Cassidy, elected on January 7, 2014. The Speaker of the United States House of Representatives is the presiding officer of the House of Representatives. The position is elected in much the same way a prime minist … er is elected under a parliamentary system of government. Currently the Speaker is Nancy Pelosi, the first woman to hold the position"}, {"url": "http://www.answers.com/Q/Who_is_the_chief_officer_of_senate", "passage_text": "The chief officer of the Senate is the Vice-President. He is seldom  in attendance, so the President Pro-Tempore presides on a daily  basis. The President of the United States, except during time of disability under the 25th Amendment, at which point in time the chief officer of the executive branch is the Acting P … resident of the United States."}, {"url": "http://www.house.gov/content/learn/officers_and_organizations/", "passage_text": "Elected at the beginning of each Congress, House Officers include the Clerk of the House, the Sergeant at Arms, the Chief Administrative Officer, and the Chaplain. House officials include the Inspector General, the Historian, the Law Revision Counsel and the Legislative Counsel. The Parliamentarian of the House is the authoritative source on legislative proceedings in the House. An appointed officer who serves as a nonpartisan adviser to members, the Parliamentarian's chief duty is to rule on procedure and to advise the House chamber’s presiding officer."}, {"url": "https://en.wikipedia.org/wiki/Presiding_Officer_of_the_United_States_Senate", "passage_text": "The Presiding Officer is the person who presides over the United States Senate and is charged with maintaining order and decorum, recognizing members to speak, and interpreting the Senate's rules, practices and precedents. More typically, junior senators of the majority party designated by the President pro tempore preside over the chamber. An exception to this pattern is when the Senate hears the impeachment trials of the President of the United States, in which the Chief Justice of the United States is the presiding officer."}]