[{"url": "https://www.shoretel.com/history-telephone-and-communication-businesses", "passage_text": "Ring My Bell. The telephone was invented in the 1870s. Alexander Graham Bell was the first person to register the invention of the telephone at the patent office. His competitor Elisha Gray registered a similar patent just a few hours after he did. The telephone came about because they were trying to improve the capabilities of the telegraph. In many ways, the Internet is expanding and changing communication as much as the telephone did in the 1800s. The world of communications will continue to evolve and businesses will need to continue to adapt to the changes."}, {"url": "http://mentalfloss.com/article/54133/6-ways-cell-phones-are-changing-world-beyond-ways-youre-probably-thinking", "passage_text": "Getty Images. According to the World Bank, three quarters of people on Earth have access to a mobile phone. There are now at least 6 billion mobile phone subscriptions active, up from 1 billion in the year 2000 -- and 5 billion of those are in developing countries. So a key way cell phones change the world is what they were designed for: communication. In addition to person-to-person communication, cell phones are also connecting people with their local governments. As cell phones have become commonplace in the developing world, the field of mHealth (mobile health) has emerged. mHealth programs connect remote communities with healthcare services and expertise, all conducted using cell phones."}, {"url": "http://www.newsweek.com/how-cell-phone-changing-world-69979", "passage_text": "In just 40 years, in the West, they’ve gone from suitcase-size novelty to ubiquity. And they’re no longer just luxury goods. More than 4 billion of the 6 billion people on earth now have a cell phone, with a quarter of those owners getting one in just the last two years. And many are using them, in a giant global experiment, to change the way life is lived, from Manhattan to Ouagadougou"}, {"url": "https://www.shoretel.com/history-telephone-and-communication-businesses", "passage_text": "The telephone is one invention that changed the world and opened a wide world of communication. Many businesses benefited from the additional communication options that became available after the invention of the telephone. In many ways, the Internet is expanding and changing communication as much as the telephone did in the 1800s. The world of communications will continue to evolve and businesses will need to continue to adapt to the changes."}, {"url": "http://courses.educ.ubc.ca/etec540/Sept04/kangd/Researchproject/inventionoftelephone.htm", "passage_text": "The nineteenth century was era of communication revolution when many electronic communication devices were invented. Postman states that the greatest invention of the nineteenth century was the idea of invention itself (Postman, 1992, p42). The telephone has had a big impact on the world. Ong claims the telephone has brought us into the age of secondary orality (Ong, 1982, p. 133). In this paper I will examine the telephone as a communication technology and its impact on writing and society. The telephone is part of the secondary orality which has many similarities and differences to the oral culture before writing was introduced. The telephone has brought us into orality as it has generated a strong group sense, for listening to the spoken words forms hearers into a group, a true audience."}, {"url": "http://courses.educ.ubc.ca/etec540/Sept04/kangd/Researchproject/inventionoftelephone.htm", "passage_text": "Just as writing changed our thought processes the telephone has also changed our mindset to a more complex way of thinking and continues to impact us as we move into the twenty-first century. Mark Twain seemed to have summed up our love hate relationship with the telephone through his following quote. The telephone is part of the secondary orality which has many similarities and differences to the oral culture before writing was introduced. The telephone has brought us into orality as it has generated a strong group sense, for listening to the spoken words forms hearers into a group, a true audience."}, {"url": "https://prezi.com/tsuo4tcxcqnu/how-telephones-changed-the-world/", "passage_text": "hear better.The telephone was one of. Alexander Graham Bell's attempts to. help the deaf hear. This is a picture of Alexander Graham Bell Alexander Graham Bell. Connect your Facebook account to Prezi and publish your likes in the future. "}, {"url": "http://www.ericssonhistory.com/communication/how-the-telephone-changed-the-world/", "passage_text": "The telephone makes its debut in Sweden On the morning of February 14, 1876, a representative for Alexander Graham Bell handed in a patent application to the patent office in Washington for an apparatus for transmitting vocal sounds via electricity lines. With the benefit of hindsight, it is evident that the telephone and telecommunications were indicative of the modern age throughout the 1900s. The... “ 1 The telephone is the instrument of the devil” News of the telephone spread quickly in Sweden."}, {"url": "http://www.answers.com/Q/How_did_the_telephone_change_the_world", "passage_text": "Answered by The Community. Making the world better, one answer at a time. The telephone (from the Greek: τῆλε, tēle, far and φωνή, phōnē, voice) is a telecommunications device that transmits and receives sound, most commonly the human voice. Through things such as skype telephones have become unnecessary for some people who live of the internet. Though for many a telephone is still central so the use has only been … changed in some situations. Many people still consider the telephone superiour."}]