[{"url": "http://pets.thenest.com/remove-dander-allergic-cats-7223.html", "passage_text": "How to Remove Dander if Allergic to Cats. Cat dander sticks to walls, floors, furniture and other items. If you're allergic to cats, dander exposure may cause symptoms ranging from itching and sneezing to breathing problems or death. If you're moving into a home where a kitty once lived, or if you have a cat but recently developed allergic symptoms, you'll need to remove dander from your environment. Step 2. Remove dander from your clothing by washing in the hottest water possible for the fabric type and with an anti-allergen laundry detergent. These products are available at most retail stores."}, {"url": "http://www.melpomene.org/pets/cat-dander-problem/how-to-remove-cat-dander", "passage_text": "Because, if it’s not properly removed from the surface, it could cause allergies such as breathing problems, cough, etc. Instructions to remove cat dander from the surface are listed below. Go through them to have a clean and safe environment at home without even compromising on your pet’s liberty. 1  Buy a high-efficiency vacuum cleaner so that it cleans the curtains, carpets, and floor properly and eliminates the dander from floor. "}, {"url": "http://cats.lovetoknow.com/Removing_Cat_Dander", "passage_text": "Remove pet dander by bathing your cat. If you currently live with a cat but suffer from allergies, you'll want to take special care to remove the dander from your furniture, the carpet, and walls. Obviously, the more you clean, the more you reduce allergens in your home. 1  Wash your walls and ceiling with hot soapy water. 1 Use an anti-mite product such as X-Mite to remove mites and dander from upholstery and carpets. 2  Use anti-mite covers on your bed. 3  Change/clean your furnace filters every three months. 4  Add a layer of cheese cloth over the furnace vent in your bedroom to provide additional filtering of dander from your furnace."}, {"url": "http://homeguides.sfgate.com/remove-cat-dander-house-cleaning-93721.html", "passage_text": "It can take up to six months to eliminate residual cat dander even when the source is gone. If you have taken normal cleaning measures but are still experiencing symptoms, more extreme cleaning may be in order. If the pet had a favorite chair and cleaning attempts have failed, throw it away or donate it. A Winning Wipe Down. Stubborn pet danger clings to most surfaces. Regularly tackle walls, ceilings and baseboards by wiping them down with a mixture of hot water and a multipurpose cleanser. Water is critical, as dry dusting just stirs dander and releases it into the air, exacerbating symptoms before resettling nearby."}, {"url": "http://homeguides.sfgate.com/remove-cat-dander-house-cleaning-93721.html", "passage_text": "Sweat the Details. Cat dander makes its way into household cracks and crevices, so it's important to thoroughly clean out these areas. When treating furniture, look for lint brushes and rollers designed specifically for removing dander; these use adhesive sheets or rubber to efficiently get the job done. A Winning Wipe Down. Stubborn pet danger clings to most surfaces. Regularly tackle walls, ceilings and baseboards by wiping them down with a mixture of hot water and a multipurpose cleanser. Water is critical, as dry dusting just stirs dander and releases it into the air, exacerbating symptoms before resettling nearby."}, {"url": "http://homeguides.sfgate.com/rid-cat-dander-furniture-cabinets-floors-94609.html", "passage_text": "Cat dander can find its way onto almost everything, from your furniture to the cabinetry and, of course, the floors. Even if the naturally sloughed skin and fur don't trigger allergies in the occupants of your home, dander is a feast for dust mites, so you should remove it from your living quarters. Furry Furniture. Vacuuming dander and fur from upholstered furniture -- at least once a week -- can reduce its accumulation. On the days in between, use a tape or sticky-rubber lint roller designed to remove pet hair."}, {"url": "http://www.mayoclinic.org/diseases-conditions/allergies/in-depth/allergy/art-20049365", "passage_text": "Allergy-proof your home. If you have hay fever or allergic asthma, take a few steps to reduce allergens in your home. Some steps to reduce indoor allergens are complicated and time-consuming — but there are some easy things you can do that may help. 1 Store children's toys, games and stuffed animals in plastic bins. 2  Pets. 3  If you can't find a new home for your dog or cat, at least keep animals out of the bedroom. 4  Bathing pets at least once a week may reduce the amount of allergen in the dander they shed."}, {"url": "http://cats.lovetoknow.com/Removing_Cat_Dander", "passage_text": "1 Use hypo-allergenic pet wipes in between baths. 2  These wipes help remove the allergen contained in dander. 3  Use a vacuum hose on your cat's fur. 4  Some cats like this, some cats don't. 5  If yours does, you can remove a lot of loose fur and dander before it makes its way into the atmosphere. 1 Use an anti-mite product such as X-Mite to remove mites and dander from upholstery and carpets. 2  Use anti-mite covers on your bed. 3  Change/clean your furnace filters every three months. 4  Add a layer of cheese cloth over the furnace vent in your bedroom to provide additional filtering of dander from your furnace."}, {"url": "http://www.health.com/health/gallery/0,,20307037,00.html", "passage_text": "How to Reduce Pet Allergens at Home. Pets can be your best friends, but if you have allergies or asthma, they can also be your worst enemy. Pets shed dander, a combination of dead skin cells and hair (or feathers), which can trigger asthma attacks and allergic reactions in some people. However, you can cut down on pet allergens at home. Cute but hazardous. Pets can be your best friends. If you have allergies or asthma, they can also be your worst enemy. Pets shed dander, a combination of dead skin cells and hair (or feathers), which can trigger asthma attacks and allergic reactions in people who are sensitive to the allergens."}]