[{"url": "http://www.webmd.com/oral-health/wisdom-tooth-extraction", "passage_text": "After a wisdom tooth is removed, you may experience: 1  Pain and swelling in your gums and tooth socket where the tooth was removed. 2  Bleeding that won't stop for about 24 hours. 3  Difficulty with or pain from opening your jaw (trismus). Before removing a wisdom tooth, your dentist will give you a local anesthetic to numb the area where the tooth will be removed. A general anesthetic may be used, especially if several or all of your wisdom teeth will be removed at the same time."}, {"url": "http://www.nhs.uk/Conditions/Wisdom-tooth-removal/Pages/Introduction.aspx", "passage_text": "After your wisdom teeth have been removed, you may experience swelling and discomfort, both on the inside and outside of your mouth. This is usually worse for the first three days, but it can last for up to two weeks. Read more about how a wisdom tooth is removed and recovering from wisdom tooth removal. If your dentist thinks you may need your wisdom teeth removed, they'll usually carry out an X-ray of your mouth. This gives them a clearer view of the position of your teeth. As with any teeth problems, it's important to see your dentist as soon as possible, rather than waiting for your regular dental check-up."}, {"url": "http://www.webmd.com/oral-health/wisdom-tooth-extraction", "passage_text": "There seems to be less risk of dry socket during this time. After a wisdom tooth is removed, you may have or notice: 1  Pain and swelling in your gums and tooth socket where the tooth was removed. 2  Bleeding that won't stop for about 24 hours. 3  Difficulty with or pain from opening your jaw (trismus). Before removing a wisdom tooth, your dentist will give you a local anesthetic to numb the area where the tooth will be removed. A general anesthetic may be used, especially if several or all of your wisdom teeth will be removed at the same time."}, {"url": "http://www.jeffersondentalclinics.com/blog.html/2014/10/09/what-you-should-know-about-wisdom-teeth-removal/", "passage_text": "It’s not necessary for you to get your wisdom teeth removed if they are correctly positioned in your mouth and do not cause any pain or dental problems. If they are impacted and/or cause crowding in your teeth, a dentist will recommend that you have them removed. There are two ways wisdom teeth may grow. 1. "}, {"url": "http://www.wikihow.com/Tolerate-Getting-Wisdom-Teeth-Pulled", "passage_text": "How to Tolerate Getting Wisdom Teeth Pulled. When getting your wisdom teeth out, there are certain steps you can take to endure the least amount of pain as possible. Getting your wisdom teeth out is typically a painful experience. Although, when you take a step back and look at the situation, your house has not burnt down, and you are still living"}, {"url": "https://answers.yahoo.com/question/index?qid=20080426152742AASYpkS", "passage_text": "Sorry, something has gone wrong. Best Answer: I only got two wisdom teeth on the bottom, and they were both impacted. It didnt hurt getting them out and I had no swelling or pain at all. The worst part is that if theyre impacted or have funky roots, they have to cut them out bit by bit. The sound of the saw is scary, and the feel of someone tugging at your teeth is the worst. Source(s): Stinkybum · 8 years ago. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080129144214AAY6uJf", "passage_text": "Report Abuse. Getting your wisdom teeth out is actually not a big deal at all. I got mine removed last year and they give you painkillers so you're not in too much pain. You are also not out for that long, I left the doctor's office about an hour and a half after I came in. Before your wisdom tooth is extracted, the tooth and the surrounding tissue will be numbed with a local anesthetic – the same injection with the same medication you would receive to numb a tooth prior to having a cavity filled."}, {"url": "https://answers.yahoo.com/question/index?qid=20080129144214AAY6uJf", "passage_text": "i have a very small mouth and the room they have to take each tooth out (having all 4 taken out) is very small. the teeth are actually like twice as big as the whole there gona make to get them out. did it... Source(s): wisdom teeth removed hurt: https://tr.im/0nRYy. Aurelea · 2 months ago. Before your wisdom tooth is extracted, the tooth and the surrounding tissue will be numbed with a local anesthetic – the same injection with the same medication you would receive to numb a tooth prior to having a cavity filled."}, {"url": "http://www.webmd.com/oral-health/wisdom-teeth", "passage_text": "In this article. Wisdom teeth are the third and final set of molars that most people get in their late teens or early twenties. Sometimes these teeth can be a valuable asset to the mouth when healthy and properly aligned, but more often, they are misaligned and require removal. "}]