[{"url": "http://sciencenetlinks.com/science-news/science-updates/cicada-cycles/", "passage_text": "Cicadas spend years underground and come out once in a blue moon for a frenzy of activity. But certain broods, like the one that emerged in 2004, come out like clockwork every 13 or 17 years. I'm Bob Hirshon and this is Science Update. 2004 is the year of Brood X—a group of cicadas that emerge from the soil every 17 years to molt and mate. Other types come out every 13 years."}, {"url": "https://answers.yahoo.com/question/index?qid=20100918115447AArDjRh", "passage_text": "It depends on which genus of cicadas they are. Most of the North American species are in the genus Tibicen: the annual or dog-day cicadas (so named because they emerge in late July and August [1]). Which come out every year. The best-known North American genus is Magicicada, however. These periodical cicadas have an extremely long life cycle of 13 to 17 years and emerge in large numbers. xyzzy · 5 years ago. Best Answer: They came out every 17 years or so. But you have some that come out alternately. Like how people give birth every year insects come out in intervals to one another at the same time. but you also have a lot of different species of Cicadas that you see as well that are out every year"}, {"url": "http://www.businessinsider.com/17-year-cicadas-will-overrun-the-east-coast-any-day-now-2013-5", "passage_text": "There are also species of periodical cicadas, as they're called, that emerge from the ground every 13 years, but we won't see those in 2013 (p eriodical cicadas are different from annual cicadas which come out every year). There are 12 different broods of the 17-year cicada and three different broods of the 13-year cicada. Typically, only one brood emerges in one region at one time, re-entering the above-ground world in extraordinary numbers."}, {"url": "https://en.wikipedia.org/wiki/Cicada", "passage_text": "Most cicadas go through a life cycle that lasts from two to five years. Some species have much longer life cycles, such as the North American genus, Magicicada, which has a number of distinct  broods  that go through either a 17-year or, in some parts of the world, a 13-year life cycle. Most cicadas are cryptic, singing at night to avoid predators. The periodic cicadas spend most of their lives as underground nymphs, only emerging after 13 or 17 years, most likely to reduce losses by satiating their"}, {"url": "http://animals.howstuffworks.com/insects/why-17-year-cicadas-come-more-than-17-years.htm", "passage_text": "Why do 17-year cicadas come out more often than every 17 years? Along with 17-year cicadas, there are five broods of 13-year cicadas, which are more prevalent in the southeastern part of the U.S. [source: Penn State University ]."}, {"url": "http://sciencenetlinks.com/science-news/science-updates/cicada-cycles/", "passage_text": "Why cicadas come out in their prime. I'm Bob Hirshon and this is Science Update. 2004 is the year of Brood X—a group of cicadas that emerge from the soil every 17 years to molt and mate. Other types come out every 13 years. This prompted one listener from Washington, D.C., to wonder why these insects have such odd-numbered life cycles. We asked biologist Keith Clay of Indiana University"}, {"url": "http://animals.howstuffworks.com/insects/why-17-year-cicadas-come-more-than-17-years.htm", "passage_text": "Each brood includes different species of cicadas that emerge together in a collective bid to find suitable mates. There are 13 broods of 17-year cicadas. Along with 17-year cicadas, there are five broods of 13-year cicadas, which are more prevalent in the southeastern part of the U.S. [source: Penn State University ]. Each brood operates on a different schedule, which means you don't have to wait 13 or 17 years to witness the insects' next en masse eruption"}, {"url": "http://www.gardenersnet.com/atoz/cicada.htm", "passage_text": "Other names: Cicadas are also called 17 year Locust, Cicada insects or Periodical Cicada. Large spring hatches, called broods, emerge in 13 year and 17 year cycles. The 2015 Cicada emergence will have two different broods emerging. Brood IV will arrive in IA,KS,MO,NE,OK, and TX. This brood is a 17 year cycle. Brood XXIII affects several state: AR, IL, IN, KY, LA, MO, MS, and TN. It is a 13 year brood."}, {"url": "http://animals.howstuffworks.com/insects/why-17-year-cicadas-come-more-than-17-years.htm", "passage_text": "A periodical cicada of the genus Magicicada is an insect measuring 1.5 inches (3.8 centimeters) in length with a red-orange hue and protruding red eyes. In fact, this coloring is an easy way to identify periodical cicadas from other species, including the more common dog-day cicadas. Along with 17-year cicadas, there are five broods of 13-year cicadas, which are more prevalent in the southeastern part of the U.S. [source: Penn State University ]."}]