[{"url": "http://www.medindia.net/drug-price/sitagliptin.htm", "passage_text": "Drug Sitagliptin. The generic Sitagliptin is manufactured by one company. The information provided includes the cost of the drug and the type of drug-tablet, capsule, syrup, cream, gel, ointment, liquid or injection. To view the price of the drug click on the brand name"}, {"url": "https://en.wikipedia.org/wiki/Sitagliptin", "passage_text": "Sitagliptin was approved by the U.S. Food and Drug Administration (FDA) on October 17, 2006, and is marketed in the US as Januvia by Merck & Co. On April 2, 2007, the FDA approved an oral combination of sitagliptin and metformin marketed in the US as Janumet. There have been several postmarketing reports of pancreatitis (some fatal) in people treated with sitagliptin and other DPP-4 inhibitors, and the U.S. package insert carries a warning to this effect, although the causal link between sitagliptin and pancreatitis has not yet been fully substantiated."}, {"url": "https://en.wikipedia.org/wiki/Sitagliptin", "passage_text": "Sitagliptin (INN; /sɪtəˈɡlɪptɪn/ , previously identified as MK-0431 and marketed as the phosphate salt under the trade name Januvia) is an oral antihyperglycemic (antidiabetic drug) of the dipeptidyl peptidase-4 (DPP-4) inhibitor class. It was developed, and is marketed, by Merck & Co. This enzyme-inhibiting drug is used either alone or in combination with other oral antihyperglycemic agents (such as metformin or a thiazolidinedione) for treatment of diabetes mellitus type 2. There have been several postmarketing reports of pancreatitis (some fatal) in people treated with sitagliptin and other DPP-4 inhibitors, and the U.S. package insert carries a warning to this effect, although the causal link between sitagliptin and pancreatitis has not yet been fully substantiated."}, {"url": "http://www.mayoclinic.org/drugs-supplements/sitagliptin-oral-route/description/DRG-20069730", "passage_text": "Sitagliptin is used alone or together with other medicines (e.g., insulin, glimepiride, metformin, or pioglitazone) to treat high blood sugar levels caused by type 2 diabetes. Normally, after you eat, your pancreas releases insulin to help your body store excess sugar for later use. Sitagliptin does not help patients who have insulin-dependent or type 1 diabetes, because they cannot produce insulin from their pancreas. Their blood sugar is best controlled with insulin injections."}, {"url": "http://diabetes.emedtv.com/januvia/generic-januvia.html", "passage_text": "No. Sitagliptin is the active ingredient in Januvia, but it is not a generic version of Januvia. What can be confusing is that, often, the active ingredient of a brand-name drug is referred to as the generic name.. The generic name is different from a generic version of a medicine. In order for there to be a generic version of a medicine, the original medicine must have gone off patent and another company (besides the original manufacturer) would make the product."}, {"url": "http://www.webmd.com/drugs/2/drug-145697/sitagliptin-oral/details", "passage_text": "Uses. Sitagliptin is used with a proper diet and exercise program and possibly with other medications to control high blood sugar. It is used in people with type 2 diabetes. Controlling high blood sugar helps prevent kidney damage, blindness, nerve problems, loss of limbs, and sexual function problems. Sitagliptin is an anti-diabetic drug that works by increasing levels of natural substances called incretins. Incretins help to control blood sugar by increasing insulin release, especially after a meal."}, {"url": "https://www.sharecare.com/health/antidiabetic-drugs/generic-version-of-januvia", "passage_text": "There is no approved generic version of Januvia. The active ingredient in Januvia is sitagliptin phosphate (or sitagliptin), which is sometimes referred to as Januvia’s generic name, but it is not the same as a generic version."}, {"url": "http://www.medicinenet.com/sitagliptin/article.htm", "passage_text": "DRUG CLASS AND MECHANISM: Sitagliptin is an oral drug that reduces blood sugar (glucose) levels in patients with type 2 diabetes. Sitagliptin is a member of a class of drugs that inhibit the enzyme, dipeptidyl peptidase-4 (DPP-4) and are therefore called DPP-4 inhibitors. As a result, blood glucose levels fall. In summary, sitagliptin reduces blood glucose levels by inhibiting DPP-4 and increasing the levels of GLP-1 and GIP. Sitagliptin was approved by the FDA in October 2006."}, {"url": "http://www.medicinenet.com/metformin_and_sitagliptin/article.htm", "passage_text": "DRUG CLASS AND MECHANISM: Janumet is a combination of two drugs, metformin and sitagliptin, that are used for reducing blood glucose (sugar) levels in individuals with type 2 diabetes. The FDA approved Janumet in March 2007. "}]