[{"url": "http://weegy.com/?ConversationId=648CCABB", "passage_text": "The greek term “endo” that endocrine is derived from means ________. A. Within B. Outside C. Without D. None of the above. A. Within. The greek term “endo” that endocrine is derived from means within."}, {"url": "http://www.rabboar.com/studio/articles/Glands.pdf", "passage_text": "Almost every cell and organ of the body is regulated by the endocrine system. The word endocrine is derived from the Greek terms endo meaning within and krine meaning to secrete or separate. The glands in the endocrine system secrete hormones within the body."}, {"url": "http://free-ed.net/free-ed/Resources/Sci/Biol/AnatomyPhysiol/Human01_LessonMain.asp?iNum=0601", "passage_text": "The endocrine glands do not have ducts to carry their product to a surface. They are called ductless glands. The word endocrine is derived from the Greek terms endo, meaning within, and krine, meaning to separate or secrete."}, {"url": "http://www.weegy.com/?ConversationId=8E99OO89", "passage_text": "Search for an answer or ask Weegy (Free). Original conversation. User: The greek term “endo” that endocrine is derived from means ________. A. Within B. Outside C. Without D. None of the above Weegy: A. Within you can also refer to here. jbgingz|Points 374|User: The endocrine system acts through chemical messengers called ________."}, {"url": "http://www.weegy.com/?ConversationId=8E99OO89", "passage_text": "The greek term “endo” that endocrine is derived from means ________. A. Within B. Outside C. Without D. None of the above. This conversation has been flagged as incorrect. New answers have been added below ...."}, {"url": "http://www.training.seer.cancer.gov/anatomy/endocrine/", "passage_text": "Endocrine Glands. The endocrine glands do not have ducts to carry their product to a surface. They are called ductless glands. The word endocrine is derived from the Greek terms endo, meaning within, and krine, meaning to separate or secrete."}]