[{"url": "http://www.whoi.edu/science/B/people/kamaral/plankton.html", "passage_text": "So must zooplankton, which feed on the phytoplankton. Plankton have evolved many different ways to keep afloat. Spikes, like those on a radiolarian, help to distribute its weight over a large surface area and slowing its sinking. Many organisms, such as copepods and diatoms, produce oil to keep them afloat."}, {"url": "http://www.whoi.edu/science/B/people/kamaral/plankton.html", "passage_text": "That places them at the very base of the food web. Many animals eat plankton directly, or feed on animals that eat plankton. Animals that eat plants or other animals are called consumers, and bacteria that break down dead plants and animals are called decomposers.. Go to tide pool menu. 1 "}, {"url": "https://askabiologist.asu.edu/experiments/plankton", "passage_text": "1 Phytoplankton: photosynthetic plankton that are usually microscopic and are also called “algae... 2  more. 3  Zooplankton: small, sometimes microscopic animals that live in water and feed on phytoplankton (algae), other zooplankton, or detritus (dead material)..."}, {"url": "https://askabiologist.asu.edu/experiments/plankton", "passage_text": "1 more. 2  Phytoplankton: photosynthetic plankton that are usually microscopic and are also called “algae... 3  more. 4  Zooplankton: small, sometimes microscopic animals that live in water and feed on phytoplankton (algae), other zooplankton, or detritus (dead material)..."}, {"url": "http://www.miseagrant.umich.edu/lessons/lessons/by-broad-concept/life-science/food-chains-and-webs/", "passage_text": "Herbivores, such as ducks, small fish and many species of zooplankton (animal plankton) eat plants. Carnivores (meat eaters) eat other animals and can be small (e.g., frog) or large (e.g., lake trout). Omnivores are animals (including humans) that eat both plants and animals. Each is an important part of the food chain."}, {"url": "http://orma.com/sea-life/plankton-facts/", "passage_text": "Plankton are also divided into 3 main types: 1  Phytoplankton (from Greek phyton or plant), algae that live near the water surface where there is sufficient light to support photosynthesis. 2  Zooplankton (from Greek zoon or animal), small protozoa, crustaceans, jellyfish and various other animals that feed on other plankton."}, {"url": "http://marinediscovery.arizona.edu/lessonsF00/bryozoans/2.html", "passage_text": "The plankton that eat other plankton are called zooplankton, and are made up of tiny animals and single-celled protozoans. Organisms that spend their whole lives drifting are called holoplankton; those spending only part of their lives as plankton are called meroplankton (MARE, 1995)."}]