[{"url": "http://www.renewableenergyworld.com/index/tech.html", "passage_text": "Most renewable energy comes either directly or indirectly from the sun. Sunlight, or solar energy, can be used directly for heating and lighting homes and other buildings, for generating electricity, and for hot water heating, solar cooling, and a variety of commercial and industrial uses. "}, {"url": "https://en.wikipedia.org/wiki/Renewable_energy", "passage_text": "Renewable energy is generally defined as energy that comes from resources which are naturally replenished on a human timescale, such as sunlight, wind, rain, tides, waves, and geothermal heat. Renewable hydroelectric energy provides 16.3% of the worlds electricity. When hydroelectric is combined with other renewables such as wind, geothermal, solar, biomass and waste: together they make the renewables total, 21.7% of electricity generation worldwide as of 2013."}, {"url": "http://www.green-e.org/learn_re_why.shtml", "passage_text": "Electricity generation is the leading cause of industrial air pollution in the U.S. Most of our electricity comes from coal, nuclear, and other non-renewable power plants. Producing energy from these resources takes a severe toll on our environment, polluting our air, land, and water. "}, {"url": "http://www.renewables-info.com/interesting_energy_articles/why_is_renewable_energy_important_for_the_future.html", "passage_text": "The prominent position in global politics. The global clean energy race is very important and winners in this race will experience many political as well as economic benefits in years to come. Excellent potential of renewable energy resources. Our sun for instance has almost unlimited potential."}, {"url": "http://www.hi-energy.org.uk/Renewables/Why-Renewable-%20Energy/Why-Renewable-Energy-is-important.htm", "passage_text": "Why Renewable Energy is important. Climate change and the need to manage diminishing fossil fuel reserves are, today, two of the biggest challenges facing the planet. The UK is a signatory of the Kyoto Protocol and is actively involved in measures to meet our commitment of a 12.5 per cent cut in greenhouse gas emissions by the period 2008-12. But there is no single solution for the UK or the 155 other countries also aiming to reduce their emissions."}, {"url": "http://extension.psu.edu/natural-resources/energy/solar-energy", "passage_text": "The sun is probably the most important source of renewable energy available today. Traditionally, the sun has provided energy for practically all living creatures on earth, through the process of photosynthesis, in which plants absorb solar radiation and convert it into stored energy for growth and development. "}, {"url": "http://www.answers.com/Q/Why_are_renewable_resources_important", "passage_text": "Non-renewable resources such as oil and coal will eventually run out, whereby it will stop providing us with energy. Renewable resources, on the other hand, will not run out. Examples like sunlight, wind, tree,water etc. can be used to provide us with energy as well after non-renewable resources have been exhausted. "}, {"url": "http://www.answers.com/Q/Why_is_renewable_energy_important", "passage_text": "renewable energy is important because it is natural but non-renewable energy is not natural renhewable energy can be used foever but non-renewable does not last. Renewable energy sources are important to the planet because the sources we use for energy will eventually run out. Also these energy sources contribute to global warming. Ren … ewable means that it can be reused and in this case, it means it is infinite like air or water"}, {"url": "http://www.renewables-info.com/interesting_energy_articles/why_is_renewable_energy_important_for_the_future.html", "passage_text": "Ned Haluzan. There are many different reasons why renewable energy is extremely important for the future of our society and throughout this article I will mention the ones that I find to be most important. Positive environmental impact is certainly one of the top reasons. The global clean energy race is very important and winners in this race will experience many political as well as economic benefits in years to come. Excellent potential of renewable energy resources. Our sun for instance has almost unlimited potential."}]