[{"url": "http://www.yourdictionary.com/proximity", "passage_text": "1 His close proximity sent her heart racing. 2  In any case, his close proximity was unsettling. 3  The arms that rescued her continued to cradle her gently, and what the fall had failed to do to her heart beat, his close proximity completed. 4  His close proximity had the usual effect of quickening her pulse. 1 In any case, his close proximity was unsettling. 2  The arms that rescued her continued to cradle her gently, and what the fall had failed to do to her heart beat, his close proximity completed. 3"}, {"url": "http://www.thefreedictionary.com/law+of+proximity", "passage_text": "1. law of proximity-a Gestalt principle of organization holding that (other things being equal) objects or events that are near to one another (in space or time) are perceived as belonging together as a unit. Noun. 1. law of proximity-a Gestalt principle of organization holding that (other things being equal) objects or events that are near to one another (in space or time) are perceived as belonging together as a unit. proximity."}, {"url": "http://www.thefreedictionary.com/proximity", "passage_text": "Noun. 1. proximity-the property of being close together. propinquity. nearness, closeness-the spatial property resulting from a relatively small distance; the sudden closeness of the dock sent him into action. cheek by jowl Side by side, in close proximity. Cheek by jowl, in use since 1577, is a variation of the older cheek by cheek, which dates from 1330. In modern English jowl means either jaw’ or ‘cheek,’ although it is more often construed as the former. Shakespeare used the expression in A Midsummer Night’s Dream:"}, {"url": "http://www.audioenglish.org/dictionary/proximity.htm", "passage_text": "2. the region close around a person or thing. 3. a Gestalt principle of organization holding that (other things being equal) objects or events that are near to one another (in space or time) are perceived as belonging together as a unit. Familiarity information: PROXIMITY used as a noun is uncommon. Dictionary entry details. • PROXIMITY (noun). "}, {"url": "http://www.thefreedictionary.com/proximity", "passage_text": "Proximity. cheek by jowl Side by side, in close proximity. Cheek by jowl, in use since 1577, is a variation of the older cheek by cheek, which dates from 1330. In modern English jowl means either jaw’ or ‘cheek,’ although it is more often construed as the former. Shakespeare used the expression in A Midsummer Night’s Dream:"}, {"url": "http://www.sweetwater.com/insync/proximity-effect/", "passage_text": "Like +1 Tweet. An increase in bass or low frequency response when a sound source is close to a microphone. Proximity effect is distortion caused by the use of ports to create directional polar pickup patterns, so omni-directional mics are not affected. Depending on the mic design, proximity effect may easily result in a boost of up to 16 dB, usually focused below 100 Hz."}, {"url": "http://www.merriam-webster.com/dictionary/proximity", "passage_text": "Full Definition of PROXIMITY. : the quality or state of being proximate: closeness. See proximity defined for English-language learners. See proximity defined for kids. ADVERTISEMENT. Learn More About PROXIMITY. Thesaurus: All synonyms and antonyms for proximity. Spanish Central: Spanish translation of proximity. Nglish: Translation of proximity for Spanish speakers. Britannica English: Translation of proximity for Arabic speakers."}, {"url": "https://marketingtechblog.com/proximity-marketing/", "passage_text": "Proximity marketing is any system that utilizes location technologies to directly communicate with customers via their portable devices. Uses of proximity marketing include distribution of media at concerts, information, gaming and social applications, retail check-ins, payment gateways, and local advertising. "}, {"url": "https://en.wikipedia.org/wiki/Proximity", "passage_text": "Proximity (typeset as ProXimity) is a 2001 Action/Thriller film starring Rob Lowe and James Coburn. It is written by Ben Queen and Seamus Ruane and directed by Scott Ziehl. "}, {"url": "https://en.wikipedia.org/wiki/Proximity_sensor", "passage_text": "A proximity sensor is a sensor able to detect the presence of nearby objects without any physical contact. A proximity sensor often emits an electromagnetic field or a beam of electromagnetic radiation (infrared, for instance), and looks for changes in the field or return signal. The object being sensed is often referred to as the proximity sensor's target. Different proximity sensor targets demand different sensors. For example, a capacitive or photoelectric sensor might be suitable for a plastic target; an inductive proximity sensor always requires a metal target. Proximity sensors can have a high reliability and long functional life because of the absence of mechanical parts and lack of physical contact between sensor and the sensed object. Proximity sensors are commonly used on smartphones to detect (and skip) accidental touchscreen taps when held to the ear during a call."}]