[{"url": "http://www.rxlist.com/inderal-drug/patient-images-side-effects.htm", "passage_text": "Propranolol is a beta-blocker. Beta-blockers affect the heart and circulation (blood flow through arteries and veins). Propranolol is used to treat tremors, angina (chest pain), hypertension (high blood pressure), heart rhythm disorders, and other heart or circulatory conditions. It is also used to treat or prevent heart attack, and to reduce the severity and frequency of migraine headaches"}, {"url": "http://healthquestions.medhelp.org/what-is-propranolol-used-to-treat", "passage_text": "Drugs most commonly used to treat essential tremor include beta-blockers (propranolol) and an epilepsy drug called Mysoline (primidone). Topamax (topiramate), another drug used to treat epilepsy and migraine help some people. Propranolol also helps to reduce the palpitations, sweating, and tremor of severe anxiety and is also used to prevent migrane headaches. STOPPING THE DRUG Do not stop the drug without consulting your doctor."}, {"url": "http://xpil.medicines.org.uk/ViewPil.aspx?DocID=18141", "passage_text": "Propranolol belongs to a group of medicines called beta-blockers. It is used to: 1  treat high blood pressure, an enlarged heart muscle or tremors. 2  treat angina pectoris (pain in the chest caused by blockages in the arteries leading to the heart) or high blood pressure caused by a tumour near a kidney (phaeochromocytoma)."}, {"url": "http://www.everydayhealth.com/drugs/inderal", "passage_text": "It's also used to treat severe chest pain (angina), migraines, thickened heart muscle (hypertrophic subaortic stenosis), tremors, a rare tumor called pheochromocytoma, and a movement disorder known as akathisia. Off-label, Inderal is used to treat esophageal bleeding, aggressive behavior, and panic attacks. Inderal is a beta-blocker. It works by changing the response to nerve impulses in the heart and other body parts, thus making the heart beat more slowly and reducing blood pressure. Inderal is the brand name for propanolol, a prescription drug used to treat high blood pressure (hypertension)."}, {"url": "http://healthquestions.medhelp.org/what-is-propranolol-used-to-treat", "passage_text": "Read More. PROPRANOLOL Prapranolol, introduced in 1965, was the first widely used beta blocker. It is most often used to treat hypertension, agina, and abnormal heart rhythms but it is also helpful in controlling the fast heart rate and other symptoms of an overactive thyroid gland. Propranolol also helps to reduce the palpitations, sweating, and tremor of severe anxiety and is also used to prevent migrane headaches. STOPPING THE DRUG Do not stop the drug without consulting your doctor."}, {"url": "http://www.mayoclinic.org/drugs-supplements/propranolol-oral-route/description/DRG-20071164", "passage_text": "Descriptions. Propranolol is used alone or together with other medicines to treat high blood pressure (hypertension). High blood pressure adds to the workload of the heart and arteries. If it continues for a long time, the heart and arteries may not function properly. This medicine may also be used to treat irregular heartbeats, tremors, or pheochromocytoma (adrenal gland tumor). It may also be used to reduce the risk of death in patients who have heart attacks. Propranolol oral solution is used to treat proliferating infantile hemangioma. This medicine is a beta-blocker."}, {"url": "http://www.psyweb.com/drughtm/jsp/inderal.jsp", "passage_text": "Inderal® is the brand name for the drug Propranolol. It is used in the treatment of anxiety, panic attacks and post traumatic stress disorder (PTSD). It is also used to treat stage fright and because of this it is on the list of banned substances for Olympic athletes. Inderal is also being studied for use in aggressive behavior in traumatic brain injuries."}, {"url": "https://en.wikipedia.org/wiki/Propranolol", "passage_text": "Propranolol (INN) is a sympatholytic nonselective beta blocker. It is used to treat high blood pressure, a number of heart dysrhythmias, thyrotoxicosis, and essential tremors. It is used to prevent migraine headaches, and to prevent further heart problems in those with angina or previous heart attacks. It comes in both oral and intravenous forms. It should not be used in those with an already slow heart rate and most of those with heart failure."}]