[{"url": "http://benefitof.net/benefits-of-ovaltine/", "passage_text": "1. Essential minerals and vitamins. Ovaltine is a healthy drink that provides many essential minerals and vitamins. Regular consumption of ovaltine is recommended by doctors since it contain significant amount of zinc, magnesium and calcium. It is highly nutritional hence is great for children of all ages. 2. Ovaltine is a popular milk favoring drink that consists of malt extract and sugar. It is believed that this beverage is beneficial in cases of malnutrition and is also a healthy supplement. Full of healthy ingredients, ovaltine definitely suits you as it aims to improve your overall health and well-being."}, {"url": "http://www.mysentimentexactlee.com/ovaltine-is-good-for-you-but-dont-tell-the-kids/", "passage_text": "Ovaltine has healthy stuff in it. But don’t tell the kids. This was my sister’s way of thinking when my nephew was a little boy. She purchased another brand of chocolate milk, one that markets to kids instead of adults, and refilled it with Rich Chocolate Ovaltine for over 10 years. Mixed with 1 cup of skim milk Rich Chocolate Ovaltine contains between 20% to 40% of the daily vitamins and minerals that our bodies need."}, {"url": "http://www.livestrong.com/article/509883-health-benefits-of-ovaltine/", "passage_text": "Ovaltine is a chocolate-flavored drink mix with added vitamins and minerals. Photo Credit Hemera Technologies/PhotoObjects.net/Getty Images. Ovaltine is a brand of drink mix, available in malt and chocolate flavors, that contains essential vitamins and minerals. Kids and adults drink Ovaltine as a warm or cold beverage. Consumed in moderation, it offers health benefits by providing considerable amounts of several vitamins and minerals. Blood Health. The mineral iron, contained in Ovaltine, is critical for delivering oxygen throughout the body and for hemoglobin production. A person whose body is low in iron can develop iron-deficiency anemia, which can cause symptoms such as fatigue, rapid pulse and difficulty breathing."}, {"url": "http://www.livestrong.com/article/509883-health-benefits-of-ovaltine/", "passage_text": "Fat-Free. Ovaltine is a fat-free drink, which encourages good heart health. According to the American Heart Association, reducing saturated fat, cholesterol and trans-fat in your diet can help increase heart health by reducing the risk of developing heart disease or Type-2 diabetes. Blood Health. The mineral iron, contained in Ovaltine, is critical for delivering oxygen throughout the body and for hemoglobin production. A person whose body is low in iron can develop iron-deficiency anemia, which can cause symptoms such as fatigue, rapid pulse and difficulty breathing."}, {"url": "http://www.3fatchicks.com/how-to-make-chocolate-milk-healthy-and-tasty/", "passage_text": "Kids usually don’t even notice. Mostly Ovaltine is just a tasty, healthy option for chocolate milk. There are many ways to drink chocolate milk. You can choose low fat and low sugar in your ingredients, or powder that is loaded with vitamins. Ovaltine. Then there are some very traditional ways to make your chocolate milk more healthy. Ovaltine, the chocolate milk powder so popular in the 1950s, is still around and is still packing a vitamin punch."}, {"url": "http://www.nestleusa.com/brands/drinks/ovaltine", "passage_text": "Ovaltine ®. It all started in 1904 with the natural goodness of malt and milk. Today, with three delicious flavors, OVALTINE ® is a household name that kids (and adults!) love. A healthy kid is a happy kid. And OVALTINE makes nutrition easy by providing 12 essential vitamins and minerals with no artificial flavors or sweeteners. Moreover, Ovaltine has less than half the sugar per serving of the leading chocolate syrup brand"}]