[{"url": "http://www.livestrong.com/article/316430-sources-of-medium-chain-triglycerides/", "passage_text": "Olive oil is a good source of medium-chain triglycerides. Photo Credit Liv Friis-Larsen/iStock/Getty Images. Photo Credit joannawnuk/iStock/Getty Images. Coconut oil is a good source of medium-chain triglycerides, according to the Center for Science in the Public Interest. A report in Medical News Today states that coconut oil is not stored in the fat and also may boost metabolism."}, {"url": "http://www.livestrong.com/article/316430-sources-of-medium-chain-triglycerides/", "passage_text": "Olive oil contains medium-chain triglycerides, and like coconut oil, is not readily absorbed or stored in the adipose tissue of your body. As a result, it does not contribute to fat gain. Using olive oil in place of oils made with longer-chain triglycerides, such as corn oil, may help protect you from obesity. Photo Credit joannawnuk/iStock/Getty Images. Coconut oil is a good source of medium-chain triglycerides, according to the Center for Science in the Public Interest. A report in Medical News Today states that coconut oil is not stored in the fat and also may boost metabolism."}, {"url": "http://www.alzdiscovery.org/cognitive-vitality/report/medium-chain-triglycerides", "passage_text": "Medium chain triglycerides (MCTs) are source of dietary fat naturally found in certain animal and vegetable oils and are abundant in coconut oil. They are often given to patients with malabsorption disorders because they are easily tolerated and more readily digested than other forms of fat. • Food: MCTs are naturally found in foods such as coconut oil, palm oil, and butter. Coconut oil has the highest naturally occurring percentage of MCTs, which compose nearly 60% of its total fat content."}, {"url": "https://www.sharecare.com/health/fats-nutrients-diet/mtcs-and-ltcs-utilized", "passage_text": "The best source of medium chain triglycerides is coconut oil. Coconuts, like most nuts, contain significant amounts of fat, but unlike other nuts, which contain mostly monounsaturated fat, the fat provided by coconuts is almost all in the form of health-promoting medium chain triglycerides (MCTs). Researchers concluded that long-term substitution of medium chain triglycerides for long chain triglycerides [MCT for LCT] would produce weight loss if energy intake remained constant.. So if you simply substitute coconut oil for sources of LCTs in your diet, you are going to lose weight."}, {"url": "https://en.wikipedia.org/wiki/Medium-chain_triglyceride", "passage_text": "Medium-chain triglycerides (MCTs) are triglycerides whose fatty acids have an aliphatic tail of 6–12 carbon atoms. The fatty acids found in MCTs are called medium-chain fatty acids (MCFAs). Like all triglycerides, MCTs are composed of a glycerol backbone and three fatty acids. In the case of MCTs, 2 or 3 of the fatty acid chains attached to glycerol are medium-chain in length. Rich sources for commercial extraction of beneficial MCTs include palm kernel oil and coconut oil."}, {"url": "http://www.livestrong.com/article/316430-sources-of-medium-chain-triglycerides/", "passage_text": "Overview. Medium-chain triglycerides, or MCT, are triglycerides with a fatty acid chain length of six to 10 carbon atoms, according to a 2010 study in the International Journal of Food Sciences and Nutrition.. Photo Credit joannawnuk/iStock/Getty Images. Coconut oil is a good source of medium-chain triglycerides, according to the Center for Science in the Public Interest. A report in Medical News Today states that coconut oil is not stored in the fat and also may boost metabolism."}, {"url": "http://www.alzdiscovery.org/cognitive-vitality/report/medium-chain-triglycerides", "passage_text": "Medium chain triglycerides (MCTs) are a naturally occurring source of dietary fat and are abundant in coconut oil. MCT supplements may briefly improve brain function in people with mild to moderate cognitive impairment by providing an additional energy source for the brain. • Food: MCTs are naturally found in foods such as coconut oil, palm oil, and butter. Coconut oil has the highest naturally occurring percentage of MCTs, which compose nearly 60% of its total fat content."}, {"url": "http://paleoleap.com/mct-oil-need-know/", "passage_text": "Medium-chain triglycerides (or MCTs for short) are made up of medium-chain fatty acids. The “medium” refers to the length of their chemical structure: all fats are made up of strings of carbon and hydrogen. Short-chain fats (e.g. butyric acid) have fewer than 6 carbons. Medium-chain fats are in the middle, with 6 to 12. There are three separate fatty acids classified as medium-chain triglycerides: 1  Caproic acid (also called hexanoic acid or C6:0). 2  Caprylic acid (also called octanoic acid or C8:0)."}, {"url": "http://www.livestrong.com/article/316430-sources-of-medium-chain-triglycerides/", "passage_text": "Coconut Oil. Coconut oil is a good source of medium-chain triglycerides. Photo Credit joannawnuk/iStock/Getty Images. Coconut oil is a good source of medium-chain triglycerides, according to the Center for Science in the Public Interest. A report in Medical News Today states that coconut oil is not stored in the fat and also may boost metabolism."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-915-MEDIUM%20CHAIN%20TRIGLYCERIDES%20(MCTs).aspx?activeIngredientId=915&activeIngredientName=MEDIUM%20CHAIN%20TRIGLYCERIDES%20(MCTs)", "passage_text": "Medium chain triglycerides (MCTs) are partially man-made fats. The name refers to the way the carbon atoms are arranged in their chemical structure. MCTs are generally made by processing coconut and palm kernel oils in the laboratory. Usual dietary fats, by comparison, are long-chain triglycerides. People use MCTs as medicine."}]