[{"url": "http://global.practicallaw.com/about/uk-about-practical-law", "passage_text": "Practical Law maintains a vast set of practice notes and standard documents which can be used as they are or tailored for international transactions, saving vast amounts of time and meaning you don’t need to draft or research from scratch. We're delighted to report that 90% of our subscribers would recommend us to a peer or colleague*. You can read what some of them have to say here. “Practical Law is global, reliable and instant, bringing country-specific know-how for different disciplines to our doorstep."}, {"url": "https://en.wikipedia.org/wiki/Practical_Law_Company", "passage_text": "Company logo. Practical Law Company (or PLC) is a UK-based legal publishing company which provides legal know-how for business lawyers. It also acts as secretariat for the GC100 group of general counsel and company secretaries. According to the AmLaw Daily, The company was set up in the early 1990s by Chris Millerchip and Rob Dow to publish PLC Magazine. Since then it has expanded to provide predominantly web-based subscription services to law firms and law departments across a range of specialist subject areas such as corporate, finance, property, tax and intellectual property."}, {"url": "http://us.practicallaw.com/about/us-about-practical-law", "passage_text": "Practical Law provides legal know-how that gives lawyers a better starting point. Our expert team of attorney editors creates and maintains thousands of up-to-date, practical resources so you don’t have to. We go beyond primary law and traditional legal research to give lawyers the resources needed to practice more efficiently, improve client service and add more value. In addition, we work with our subscribers to help them use Practical Law’s resources as the foundation of innovative professional development and onboarding programs, practical training materials, to benchmark their own internal documents and more. We encourage you to contact us to learn more."}, {"url": "http://thomsonreuters.com/en/products-services/legal/large-law-firm-practice-and-management/practical-law.html", "passage_text": "Description: Practical Law helps lawyers to work faster and advise with confidence. We go beyond and complement primary law and research to help our customers meet client demands for increased efficiency and greater value. Practical Law for Companies Magazine-the leading monthly magazine for business lawyers advising companies active in the UK, featuring speedread summaries, news briefs, feature articles, bulletins and expert commentary."}, {"url": "http://us.practicallaw.com/about/us-about-practical-law", "passage_text": "Resources. All Practical Law content is created with the front-line lawyer in mind. Our resources include Practice Notes, Standard Documents and Clauses, Checklists, Legal Updates, State Q&As, our What’s Market and Brief Bank tools, cross-border guidance and more. In addition, we work with our subscribers to help them use Practical Law’s resources as the foundation of innovative professional development and onboarding programs, practical training materials, to benchmark their own internal documents and more. We encourage you to contact us to learn more."}, {"url": "http://legalsolutions.thomsonreuters.com/law-products/solutions/practical-law/", "passage_text": "Start with Practical Law. Practical Law offers lawyers the know-how needed to practice more efficiently, improve client service, and add more value. Now that Practical Law is part of Thomson Reuters, attorneys can access know-how, primary law, and legal solutions – all from one trusted advisor. Practical Legal Know-how. Practical Law content is created with the front-line lawyer in mind. Our trusted resources include Practice Notes, Standard Documents and Clauses, Checklists, Toolkits, legal updates, state-specific guidance, and more. Not only is our content practical – it's always up to date."}, {"url": "http://www.thefreedictionary.com/practical", "passage_text": "Usage: A distinction is usually made between practical and practicable. Practical refers to a person, idea, project, etc., as being more concerned with or relevant to practice than theory: he is a very practical person; the idea had no practical application. Practicable refers to a project or idea as being capable of being done or put into effect: the plan was expensive, yet practicable."}]