[{"url": "http://ukrainetrek.com/pripyat-city", "passage_text": "Pripyat overview. Pripyat (Prypiat) is an abandoned city located in Kiev region of Ukraine. It is standing on the Pripyat River, near the border with Belarus. It was the home city for people who were working at Chernobyl Nuclear Power Plant-one of the largest nuclear power plants in Europe"}, {"url": "http://mapcarta.com/Chernobyl", "passage_text": "Chernobyl. Chernobyl is located in Central Ukraine; the location is infamous because of the nuclear meltdown on April 26, 1986. On April 26, 1986, the No. 4 nuclear reactor at the Chernobyl Nuclear Plant near the city of Prypiat suffered from a catastrophic nuclear accident during a systems test. Loading photos…"}, {"url": "https://www.asme.org/engineering-topics/articles/nuclear/chernobyl-25-years-later", "passage_text": "The Chernobyl power-generating station is located in Pripyat, Ukraine, 110 km (68 miles) north of Kiev. There were four reactors at the plant, which began operation between 1978 and 1984. "}, {"url": "http://www.livescience.com/39961-chernobyl.html", "passage_text": "Located about 81 miles (130 km) north of the city of Kiev, Ukraine, and about 12 miles (20 km) south of the border with Belarus, the four reactors at the Chernobyl Nuclear Power Plant were designed and built during the 1970s and 1980s. In the early morning hours of April 26, 1986, the Chernobyl nuclear power plant in Ukraine (formerly part of the Soviet Union) exploded, creating what has been described as the worst nuclear disaster the world has ever seen."}, {"url": "http://www.greenfacts.org/en/chernobyl/", "passage_text": "The Chernobyl nuclear power plant is located in Ukraine, 20km south of the border with Belarus. At the time of the accident, the plant had four working reactors. The accident occurred on 26 April 1986 when operators of the power plant ran a test on an electric control system of one of the reactors. "}, {"url": "https://en.wikipedia.org/wiki/Chernobyl_disaster", "passage_text": "The Chernobyl nuclear power plant is located next to the Pripyat River, which feeds into the Dnieper reservoir system, one of the largest surface water systems in Europe, which at the time supplied water to Kiev's 2.4 million residents, and was still in spring flood when the accident occurred. "}, {"url": "http://chernobylgallery.com/chernobyl-disaster/what-is-chernobyl/", "passage_text": "Chernobyl, or Chornobyl, is the name of a city situated in northern Ukraine near the border with Belarus. Chernobyl was largely abandoned following the disaster at the Chernobyl Nuclear Power Plant located 14.5 kilometres (9 miles) away. Ukraine was part of Russia on the 26th April 1986 when the disaster occurred. Named after the nearby Pripyat River, Pripyat was founded on 4 February 1970 in northern Ukraine. Built to house the employees of the Chernobyl Nuclear Power Plant 4 kilometres away it became the ninth nuclear city in the Soviet Union."}, {"url": "http://www.answers.com/Q/Where_is_Chernobyl", "passage_text": "It is located south of Pripyat on the Pripyat River in North Central Ukraine. It was the site of the worst nuclear power plant disaster in history. Chernobyl was a nuclear power plant in the former Soviet Union. On 26 April 1986, it suffered a massive failure which caused it to spread radioactive waste across large parts … of Europe.    The accident began with a steam explosion that caused a fire, more explosions, and a subsequent nuclear meltdown."}]