[{"url": "http://www.environmentalscience.org/career/geographic-information-systems-specialist", "passage_text": "GIS specialists build and maintain GIS databases, and use GIS software to analyze the spatial and non-spatial information in them. They may work under a wide variety of job titles, including GIS Analyst, GIS Technician, and Cartographer. Employment of GIS specialists and cartographers is projected to grow 20 percent from 2012 to 2022, which is faster than average across all occupations. However, since it's a small field to start with, this growth will only create about 2,400 new jobs during that period."}, {"url": "http://www.academicinvest.com/science-careers/geography-careers/how-to-become-a-geographic-information-systems-gis-specialist", "passage_text": "Geographic Information Systems (GIS) Specialist Job Description. A geographic information systems specialist is responsible for using specialized equipment and computer software to create geographic maps which contain political borders, transportation networks and environmental resources. Below we've outlined what you'll need to succeed in a career as a geographic information systems specialist. We've also included helpful information for this career, such as job description, job duties, salary expectations, a list of possible employers and much more!"}, {"url": "http://www.academicinvest.com/science-careers/geography-careers/how-to-become-a-geographic-information-systems-gis-specialist", "passage_text": "To become a geographic information systems specialist, you should either have a Bachelor’s of Science degree in Geography with an emphasis in GIS, or you should pursue a GIS certificate or diploma program. Below we've outlined what you'll need to succeed in a career as a geographic information systems specialist. We've also included helpful information for this career, such as job description, job duties, salary expectations, a list of possible employers and much more!"}, {"url": "http://www.environmentalscience.org/career/geographic-information-systems-specialist", "passage_text": "GIS is an analysis tool that's used in a wide range of areas, including health, city government, transportation, urban planning, business marketing, geology and archaeology. Employment of GIS specialists and cartographers is projected to grow 20 percent from 2012 to 2022, which is faster than average across all occupations. However, since it's a small field to start with, this growth will only create about 2,400 new jobs during that period."}, {"url": "http://www.answers.com/Q/What_does_a_GIS_specialist_do", "passage_text": "a GIS Specialist typically uses computer software in conjunction with geographic methods to organize and display data in a useful format. Geographic Information System (GIS), or geographical information system, is any system that captures, stores, analyzes, manages, and presents data that are linked to location. … In the simplest terms, GIS is the merging of cartography and database technology."}, {"url": "http://www.forestinfo.org/careers/gis-specialist", "passage_text": "A GIS specialist is an individual that works with geographic information systems (GIS) to solve problems, present data, and store information. This can be a full time career or integrated as a duty into a position such as a natural resources manager. The versatility and efficiency of GIS systems has created a high demand for GIS specialists. Private natural resource management companies employ a large number of GIS specialists to make maps, conduct remote sensing, calculate statistics, and keep data organized and accessible."}, {"url": "http://www.environmentalscience.org/career/geographic-information-systems-specialist", "passage_text": "Many GIS Specialists use desktop GIS software to analyze data and create maps for internal purposes. However, they're increasingly involved in launching and supporting online and mobile maps for public consumption. This type of work involves a solid background in computer science and programming. Employment of GIS specialists and cartographers is projected to grow 20 percent from 2012 to 2022, which is faster than average across all occupations. However, since it's a small field to start with, this growth will only create about 2,400 new jobs during that period."}, {"url": "https://en.wikipedia.org/wiki/Geographic_information_system", "passage_text": "A geographic information system (GIS) is a system designed to capture, store, manipulate, analyze, manage, and present all types of spatial or geographical data. "}, {"url": "http://www.payscale.com/research/US/Job=Geographic_Information_Systems_(GIS)_Specialist/Salary", "passage_text": "Read More... Geographic information systems (GIS) is a term used to describe the collection and collation of various types of data in order to visually represent that data, most often in the form of charts or maps. These systems are used by a vast array of organizations for an even larger number of applications. A Geographic Information Systems (GIS) Specialist earns an average salary of $48,926 per year. People in this job generally don't have more than 20 years' experience."}, {"url": "http://www.environmentalscience.org/career/geographic-information-systems-specialist", "passage_text": "Geographic Information Systems (GIS) is a computer-based method for collecting, managing, analyzing, modeling, and presenting geographic or spatial data. GIS software allows you to overlay maps and datasets and query them in terms of their spatial relationships to each other. Employment of GIS specialists and cartographers is projected to grow 20 percent from 2012 to 2022, which is faster than average across all occupations. However, since it's a small field to start with, this growth will only create about 2,400 new jobs during that period."}]