[{"url": "http://health.costhelper.com/tummy-tuck.html", "passage_text": "1 This includes an anesthesiologist fee of $500 to $700, a facility fee of $700 to $1,000 and a surgeon's fee, which averages $5,232 according to The American Society for Aesthetic Plastic Surgery,. 1 The cost varies according to how much skin and fat has to be removed and whether the procedure is performed in a doctor's surgical suite or in a hospital. 2  Sometimes, a tummy tuck requires an overnight hospital stay, which can make the procedure considerably more expensive."}, {"url": "http://www.plasticsurgery.org/cosmetic-procedures/tummy-tuck.html?sub=How+much+does+a+tummy+tuck+cost", "passage_text": "Find Your Surgeon. Find Your Surgeon. The average cost of a tummy tuck is $5,493, according to 2014 statistics from the American Society of Plastic Surgeons. Tummy tuck surgery cost can vary widely. The average fee referenced above does not include anesthesia, operating room facilities or other related expenses"}, {"url": "http://health.costhelper.com/tummy-tuck.html", "passage_text": "Additional costs: 1  In a tummy tuck operation, which usually takes two to five hours, the surgeon makes a vertical and a horizontal incision to create a skin flap, which is lifted to reveal the girdle of muscles that holds in the internal organs. 1 The cost varies according to how much skin and fat has to be removed and whether the procedure is performed in a doctor's surgical suite or in a hospital. 2  Sometimes, a tummy tuck requires an overnight hospital stay, which can make the procedure considerably more expensive."}, {"url": "http://www.liposite.com/tummy_tuck_abdominoplasty/cost.aspx", "passage_text": "Costs for a tummy tuck vary according to where you live and the plastic surgeon you choose. According to the ASPS, the average plastic surgeon’s fee for tummy tuck surgery was $5,264 in 2007. The total cost of the procedure may run from $4,000 to $9,000 or more. These costs include the fees for the anesthesia provider, the surgical facility, and the surgeon."}, {"url": "http://www.docshop.com/education/cosmetic/body/tummy-tuck/cost", "passage_text": "A tummy tuck, or abdominoplasty, can cost between $3,000 and $12,000, depending on the surgeon you choose, the geographic location of the surgeon's practice, the scope of treatment, and several other factors. Throughout our lives, perhaps no other area of the body is subject to as many changes as the abdomen. Some medication for pain management will be necessary after surgery. With insurance, pain medication can cost under $100 for a prescription, but can cost several hundred if you are paying out of pocket. I personally include two follow-up visits in the cost of a tummy tuck treatment."}, {"url": "http://www.yourplasticsurgeryguide.com/tummy-tuck/cost.htm", "passage_text": "If you are considering a tummy tuck (abdominoplasty), the cost of the procedure will likely play a role in your final decision. In general, tummy tuck cost includes three major fees: the surgeon's fee, the anesthesia fee and the facility fee. The average surgeon's fee is slightly more than $5,000, according to the American Society of Plastic Surgeons. This is the average, which means individual surgeons may charge much more or less. Additional fees, often not included in your initial quote, may include preoperative tests (which can cost up to $500) as well as the cost of postoperative medications and compression garments (which can be as high as $350). Based on these estimated costs, the total cost of a tummy tuck ranges from $7,475 to $17,650."}, {"url": "http://health.costhelper.com/tummy-tuck.html", "passage_text": "Related articles: Forehead Lift, Facelift, Breast Lift. 1  A tummy tuck, also called abdominoplasty, varies widely in cost from $3,000 to $8,500. 2  Patients in the northeastern United States can expect to pay higher surgeon's fees, averaging $4,995, while patients in the south central states pay much less, averaging $3,681. 1 The cost varies according to how much skin and fat has to be removed and whether the procedure is performed in a doctor's surgical suite or in a hospital. 2  Sometimes, a tummy tuck requires an overnight hospital stay, which can make the procedure considerably more expensive."}, {"url": "http://www.yourplasticsurgeryguide.com/tummy-tuck/cost.htm", "passage_text": "For example, anesthesia can cost anywhere from $425 to $1,800, and the fee for the surgical facility can cost $1,200 if your tummy tuck is performed in your doctor's office or up to $10,000 if it takes place in a hospital and an overnight stay is warranted. Additional fees, often not included in your initial quote, may include preoperative tests (which can cost up to $500) as well as the cost of postoperative medications and compression garments (which can be as high as $350). Based on these estimated costs, the total cost of a tummy tuck ranges from $7,475 to $17,650."}]