[{"url": "https://en.wikipedia.org/wiki/Thyroid-stimulating_hormone", "passage_text": "From Wikipedia, the free encyclopedia. Thyroid-stimulating hormone (also known as thyrotropin, TSH, or hTSH for human TSH) is a pituitary hormone that stimulates the thyroid gland to produce thyroxine (T 4), and then triiodothyronine (T 3) which stimulates the metabolism of almost every tissue in the body. "}, {"url": "http://www.thyroid.org/thyroid-hormone-treatment/", "passage_text": "Thyroid hormone is used in two situations: 1  to replace the function of the thyroid gland, which is no longer functioning normally (“replacement therapy”) and. 2  to prevent further growth of thyroid tissue (“suppression therapy”). "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/3096042", "passage_text": "The interrelationships of thyroid and growth hormones: effect of growth hormone releasing hormone in hypo-and hyperthyroid male rats. Root AW, Shulman D, Root J, Diamond F. Growth hormone (GH) and the thyroid hormones interact in the hypothalamus, pituitary and peripheral tissues. Thyroid hormone exerts a permissive effect upon the anabolic and metabolic effects of GH, and increases pituitary synthesis of this protein hormone. GH depresses the secretion of thyrotropin and the thyroid hormones and increases the peripheral conversion of thyroxine to triiodothyronine. "}, {"url": "http://arbl.cvmbs.colostate.edu/hbooks/pathphys/endocrine/thyroid/physio.html", "passage_text": "It is likely that all cells in the body are targets for thyroid hormones. While not strictly necessary for life, thyroid hormones have profound effects on many big time physiologic processes, such as development, growth and metabolism, and deficiency in thyroid hormones is not compatible with normal health. Other Effects: As mentioned above, there do not seem to be organs and tissues that are not affected by thyroid hormones. A few additional, well-documented effects of thyroid hormones include: 1  Cardiovascular system: Thyroid hormones increases heart rate, cardiac contractility and cardiac output. 2  They also promote vasodilation, which leads to enhanced blood flow to many organs"}, {"url": "http://www.cancer.org/cancer/thyroidcancer/detailedguide/thyroid-cancer-treating-thyroid-hormone-therapy", "passage_text": "Normal thyroid function is regulated by the pituitary gland. The pituitary makes a hormone called TSH that causes the thyroid gland to make thyroid hormone for the body. TSH also promotes growth of the thyroid gland and probably of thyroid cancer cells. The level of TSH, in turn, is regulated by how much thyroid hormone is in the bloo"}, {"url": "https://thinksteroids.com/articles/thyroid-hormone-growth-hormone/", "passage_text": "The secretion of T4 is under the control of Thyroid Stimulating Hormone (TSH) which is produced by the pituitary gland. TSH secretion is in turn controlled through release of Thyrotropin Releasing Hormone which is produced in your hypothalamus. Ok…I’ll explain things a bit further. First, a brief explanation of Thyroid Hormone as well as Growth Hormone may be necessary. Your thyroid gland secretes two hormones that are going to be of primary importance in understanding Thyroid/GH interaction."}, {"url": "http://arbl.cvmbs.colostate.edu/hbooks/pathphys/endocrine/thyroid/physio.html", "passage_text": "A few examples of specific metabolic effects of thyroid hormones include: 1  Lipid metabolism: Increased thyroid hormone levels stimulate fat mobilization, leading to increased concentrations of fatty acids in plasma. 2  They also enhance oxidation of fatty acids in many tissues. Other Effects: As mentioned above, there do not seem to be organs and tissues that are not affected by thyroid hormones. A few additional, well-documented effects of thyroid hormones include: 1  Cardiovascular system: Thyroid hormones increases heart rate, cardiac contractility and cardiac output. 2  They also promote vasodilation, which leads to enhanced blood flow to many organ"}, {"url": "http://arbl.cvmbs.colostate.edu/hbooks/pathphys/endocrine/thyroid/physio.html", "passage_text": "Thyroid Hormone Receptors and Mechanism of Action. Receptors for thyroid hormones are intracellular DNA-binding proteins that function as hormone-responsive transcription factors, very similar conceptually to the receptors for steroid hormones. Other Effects: As mentioned above, there do not seem to be organs and tissues that are not affected by thyroid hormones. A few additional, well-documented effects of thyroid hormones include: 1  Cardiovascular system: Thyroid hormones increases heart rate, cardiac contractility and cardiac output. 2  They also promote vasodilation, which leads to enhanced blood flow to many organ"}, {"url": "https://en.wikipedia.org/wiki/Thyroid_hormone", "passage_text": "Thyroid hormones (T 4 and T 3) are produced by the follicular cells of the thyroid gland and are regulated by TSH made by the thyrotropes of the anterior pituitary gland. The effects of T 4 in vivo are mediated via T 3 (T 4 is converted to T 3 in target tissues). T 3 is 3- to 5- fold more active than T 4. The major form of thyroid hormone in the blood is thyroxine (T 4), which has a longer half-life than T 3. In humans, the ratio of T 4 to T 3 released into the blood is roughly 20 to 1."}]