[{"url": "http://www.healthline.com/health/subacute-thyroiditis", "passage_text": "Thyroiditis refers to an inflamed thyroid. Your thyroid is a gland in the front of your neck that controls your metabolism by releasing a variety of hormones. Most types of thyroiditis do not cause pain in the thyroid gland. However, they typically lead to either hyperthyroidism (overactive thyroid) or hypothyroidism (underactive thyroid). Both of these conditions cause symptoms such as weight changes, anxiety, and fatigue."}, {"url": "http://www.medicinenet.com/thyroiditis/page3.htm", "passage_text": "Subacute thyroiditis. Symptoms are the same as in postpartum and silent thyroiditis, but the inflammation in the thyroid leads to pain in the neck, jaw, or ear. Unlike the other types of thyroiditis, subacute thyroiditis may be caused by an infection. Thyroid Gland-Thyroiditis. SOURCE: U.S. Womenshealth.gov"}, {"url": "http://www.thyroid.org/thyroiditis/", "passage_text": "Thyroiditis is caused by an attack on the thyroid, causing inflammation and damage to the thyroid cells. Antibodies that attack the thyroid cause most types of thyroiditis. As such, thyroiditis is often an autoimmune disease, like juvenile diabetes and rheumatoid arthritis. Thyroiditis is a general term that refers to “inflammation of the thyroid gland”. Thyroiditis includes a group of individual disorders causing thyroidal inflammation but presenting in different ways. For example, Hashimoto’s thyroiditis is the most common cause of hypothyroidism in the United State"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001413/", "passage_text": "Causes. Subacute thyroiditis is a rare condition. It is thought to be caused by a viral infection. The condition often occurs after a viral infection of the upper respiratory tract, such as mumps and influenza, or a common cold. Last reviewed: May 10, 2014. Subacute thyroiditis involves swelling (inflammation) of the thyroid gland that usually follows an upper respiratory infection."}, {"url": "http://www.thyroid.org/thyroiditis/", "passage_text": "Thyroiditis can also be caused by an infection, such as a virus or bacteria, which works in the same way as antibodies to cause inflammation in the gland. Finally, drugs such as interferon and amiodarone, can also damage thyroid cells and cause thyroiditis. Thyroiditis is a general term that refers to “inflammation of the thyroid gland”. Thyroiditis includes a group of individual disorders causing thyroidal inflammation but presenting in different ways. For example, Hashimoto’s thyroiditis is the most common cause of hypothyroidism in the United State"}, {"url": "http://familydoctor.org/familydoctor/en/diseases-conditions/thyroiditis.html", "passage_text": "1 Subacute thyroiditis (also called de Quervain's thyroiditis). 2  Possibly caused by a viral infection. 3  Causes pain in the thyroid and symptoms of hyperthyroidism, followed by hypothyroidism. 4  Symptoms improve within a few months. 5  There is a slight chance of permanent hypothyroidism, which can be treated. 1 Possibly caused by a viral infection. 2  Causes pain in the thyroid and symptoms of hyperthyroidism, followed by hypothyroidism. 3  Symptoms improve within a few months. 4"}, {"url": "http://www.healthcommunities.com/thyroid-disorders/thyroiditis.shtml", "passage_text": "Thyroiditis is inflammation of the thyroid, the gland at the base of the neck that produces thyroid hormone (thyroxine), crucial in the regulation of body growth and metabolism. There are three types of thyroiditis: acute, subacute, and chronic. Although inflammation of the thyroid gland is common to all three, they differ significantly in terms of symptoms, cause, and outcome. Acute thyroiditis is extremely rare."}, {"url": "http://umm.edu/health/medical/altmed/condition/thyroiditis", "passage_text": "Introduction. Thyroiditis is an inflammation of the thyroid gland. It may be painful and tender when caused by an infection or trauma, or painless when caused by an autoimmune condition or medications. There are several types of thyroiditis. The most common forms are: 1  Hashimoto's disease. 2  Subacute granulomatous thyroiditis. "}]