[{"url": "http://www.abrandedyou.com/2011/10/25/uploading-your-resume-to-linkedin/", "passage_text": "The simplest answer is that you don’t put your resume on LinkedIn. While LinkedIn allows you to upload your resume to the service, it doesn’t actually preserve the resume in its original format. Instead, the service extracts all of the relevant information use the document to populate your LinkedIn profile."}, {"url": "https://help.linkedin.com/app/answers/detail/a_id/1815/~/importing-information-from-your-resume", "passage_text": "1 Click Profile at the top of your homepage. 2  Move your cursor over the Down arrow next to the View Profile As button and select Import resume. 3  Click Choose file or Browse to locate your resume on your computer. 4  Click Upload resume. 5  You'll be taken to a page where you can review the information extracted from your resume."}, {"url": "http://www.abrandedyou.com/2011/10/25/uploading-your-resume-to-linkedin/", "passage_text": "The official party line is that LinkedIn is a replacement for your resume. But unlike a standard paper resume, it gives you the opportunity to really customize the document and not be bound by the typical restrictions of a resume. Your LinkedIn profile doesn’t need to be limited to 1 or 2 pages."}, {"url": "http://jobsearch.about.com/od/networking/a/linkedinprofile.htm", "passage_text": "How to Use Your LinkedIn Profile as a Job Search Tool. 1  Create a Profile. 2  Create a detailed profile on LinkedIn, including employment (current and past), education, and industry. 3  Review your resume and copy/paste the relevant information into your profile."}, {"url": "http://www.careerealism.com/upload-resume-linkedin/", "passage_text": "In a word: Don’t. LinkedIn has made it very easy to upload your resume as a .pdf to make it part of your LinkedIn profile. While it’s tempting to do this rather than to do a full profile (and it’s tempting to do it even if you already have a full profile!), please do not. I have very serious reservations about uploading resumes."}, {"url": "https://help.linkedin.com/app/answers/detail/a_id/1815/~/importing-information-from-your-resume", "passage_text": "If you don't have an experience or education entry on your profile, you'll have the option to import information from your resume onto your profile: 1  Click Profile at the top of your homepage. 2  Move your cursor over the Down arrow next to the View Profile As button and select Import resume."}, {"url": "http://lisamariediasdesigns.com/blog/linkedin-question-upload-resume/", "passage_text": "And LinkedIn offers a helpful tool which will create a traditional resume for you, using the information from your LinkedIn profile! See http://www.linkedin.com/company/linkedin/linkedin-resume-builder-98959/product for more details."}, {"url": "https://help.linkedin.com/app/answers/detail/a_id/1815/~/importing-information-from-your-resume", "passage_text": "1 Move your cursor over the Down arrow next to the View Profile As button and select Import resume. 2  Click Choose file or Browse to locate your resume on your computer. 3  Click Upload resume. 4  You'll be taken to a page where you can review the information extracted from your resume."}]