[{"url": "http://snippets.com/does-chondroitin-and-glucosamine-help-gout.htm", "passage_text": "no because chondroitin are commonly used to cure arthritis that are not cause by gout while glucosamine commonly fluids produced by our bodies and commonly found in our kidneys!!! some arthritis are cause by gout, but if have this you must seek a cure for your gout not for your arthritis."}, {"url": "http://snippets.com/does-chondroitin-and-glucosamine-help-gout.htm", "passage_text": "Answer by danielledc2b (61). yes, chondroitin and glucosamine may help gout, since gout is really short for gouty arthritis. Chondroitin and glucosamine are known to help out with arthritis and degeneration in the joints of the body."}, {"url": "http://www.mayoclinic.org/diseases-conditions/gout/expert-answers/gout/faq-20058226", "passage_text": "Taking glucosamine isn't likely to have any effect on gout — either good or bad. Gout is a form of arthritis that's characterized by sudden, severe attacks of pain, redness and tenderness in joints. Gout is caused by deposits of uric acid crystals in a joint. Uric acid is a waste product formed from the breakdown of purines — substances found naturally in the body and in certain foods, including shellfish and organ meats."}, {"url": "http://glucosaminepro.com/glucosamine-and-gout/", "passage_text": "Researchers have been exploring the link between glucosamine and gout. Glucosamine and gout are linked because glucosamine may help reduce inflammation associated with arthritis, and therefore helps to reduce the pain associated with gout. Glucosamine works well when combined with chondroitin sulphate."}, {"url": "http://www.home-remedies-for-you.com/articles/1395/alternative-health/can-glucosamine-worsen-gout-symptoms.html", "passage_text": "Gout is usually treated with medication. It is often treated with a medication called glucosamine along with chondroitin sulfate, in arthritis and gout patients. The excess uric acid that is produced in a gout patient’s body is a waste product that is formed by the breakdown of a component called purines."}, {"url": "http://isgout.com/can-glucosamine-cause-gout/", "passage_text": "Can Glucosamine Cause Gout. Find out the shower head to the excess uric acid is actually control gout but rest assured in anti-inflammation in United State and much of the two main ways to do this."}, {"url": "http://www.home-remedies-for-you.com/articles/1395/alternative-health/can-glucosamine-worsen-gout-symptoms.html", "passage_text": "Gout is a form of arthritis where the joints of the body are affected by the build-up of uric acid in the body. Uric acid builds up in the blood or you body is unable to deal with the acid already being produced by your body, which also leads to a build-up. Both these conditions affect the movement of the joints."}]