[{"url": "http://www.bbc.com/earth/story/20150916-why-we-really-should-save-pandas", "passage_text": "View image of Giant panda, Bifengxia Giant Panda Breeding and Conservation Center (Credit: Binbin Li). The fact that there's a lot of other species included in those reserves is a real bonus for conservation, says Ben Collen of University College London in the UK. "}, {"url": "https://en.wikipedia.org/wiki/Giant_panda", "passage_text": "The name giant panda is sometimes used to distinguish it from the unrelated red panda. Though it belongs to the order Carnivora, the giant panda's diet is over 99% bamboo. Giant pandas in the wild will occasionally eat other grasses, wild tubers, or even meat in the form of birds, rodents or carrion. The giant panda is a highly specialized animal with unique adaptations, and has lived in bamboo forests for millions of years. The average giant panda eats as much as 9 to 14 kg (20 to 30 lb) of bamboo shoots a day to compensate for its low level of energy digestibility."}, {"url": "https://www.fws.gov/international/animals/giant-pandas.html", "passage_text": "Wild giant pandas are found in the mountains of central China in dense bamboo and coniferous forests at altitudes of 5,000 to 10,000 feet. Driven nearly to extinction by habitat loss and poaching, these elusive and secretive mammals are among the rarest in the world, with only an estimated 1,600 remaining in the wild. The U.S. Fish and Wildlife Service (Service) listed the giant panda as an endangered species under the U.S. Endangered Species Act (ESA) in 1984. The species is also listed under Appendix I of the Convention on the International Trade in Endangered Species of Wild Fauna and Flora (CITES)."}, {"url": "http://wwf.panda.org/what_we_do/endangered_species/giant_panda/", "passage_text": "Giant panda. The giant panda is perhaps the most powerful symbol in the world when it comes to species conservation. Adored around the world, the distinctive black and white animal is a national treasure in China and has been the symbol of WWF since its formation in 1961. "}, {"url": "http://www.umich.edu/~esupdate/library/98.07-08/ellis.html", "passage_text": "The endangered giant panda (Ailuropoda melanoleuca) is endemic to the mountains of Sichuan, Gansu and Shanxi Provinces in China. Historically, the species was widely distributed and may have numbered 100,000 animals, but has declined to no more than 1,200 animals as the result of numerous detrimental forces. For now, however, captive-held giant pandas are especially important as a research and educational resource and as a means for attracting substantial public support for conservation of the giant pandas living in the wild as well as other endangered endemic species in China."}, {"url": "http://nationalzoo.si.edu/Animals/GiantPandas/PandaFacts/", "passage_text": "A wild giant pandas diet is almost exclusively (99 percent) bamboo. The balance consists of other grasses and occasional small rodents or musk deer fawns. In zoos, giant pandas eat bamboo, sugar cane, rice gruel, a special high-fiber biscuit, carrots, apples, and sweet potatoes. The giant panda, a black-and-white bear, has a body typical of bears. It has black fur on ears, eye patches, muzzle, legs, and shoulders. The rest of the animal's coat is white."}, {"url": "http://www.ualr.edu/arkansasglobalprograms/china/curriculum/16.doc", "passage_text": "GIANT PANDA, Ailuropoda melanoleuca. The giant panda with its distinctive black and white coloring is a well known mammal. It is an endangered endemic wild species of China. The Chinese refer to panda as ADa Xiong Mao@ (giant bear cat). However, it is neither a bear or a cat"}, {"url": "http://www.scienceworldreport.com/articles/30213/20150918/chinas-giant-pandas-saving-endemic-species.htm", "passage_text": "We found that the giant panda's geographical range overlaps with 70 percent of forest bird species, 70 percent of forest mammals, and 31 percent of forest amphibian species found only in mainland China, said Pimm. "}, {"url": "https://en.wikipedia.org/wiki/Giant_panda", "passage_text": "The giant panda is a conservation reliant endangered species. A 2007 report shows 239 pandas living in captivity inside China and another 27 outside the country. As of December 2014, 49 giant pandas live in captivity outside China, living in 18 zoos in 13 different countries. The giant panda is a highly specialized animal with unique adaptations, and has lived in bamboo forests for millions of years. The average giant panda eats as much as 9 to 14 kg (20 to 30 lb) of bamboo shoots a day to compensate for its low level of energy digestibility."}]