[{"url": "http://www.builtlean.com/2013/02/04/high-protein-diet/", "passage_text": "If you think a high protein diet is only useful for bodybuilders or marathoners, it might be time to rethink: not only can high protein diets build muscle and optimize body composition, they can also curb hunger, enhance satiety, and promote weight loss. "}, {"url": "http://healthyeating.sfgate.com/can-women-drink-whey-protein-trying-lose-weight-8694.html", "passage_text": "Uses. To achieve weight loss with whey protein, you need to use it in a smart way. Rather than adding extra calories to your diet by drinking a whey shake in addition to meals, use the shake as a replacement for a daily snack or small meal. Protein drinks may help fill you up on fewer calories. Since many bodybuilders and weight trainers use whey protein in an effort to add muscle mass, it might come as a surprise that it can also encourage weight loss."}, {"url": "https://www.exercise.com/faq/does-whey-protein-help-with-weight-loss", "passage_text": "If you are wondering if whey protein can help with weight loss, the answer is yes! While many bodybuilders use whey protein as part of their muscle mass building program it has other uses that can help you meet your weight loss goals in a healthy way. Of course, you can use fruits and veggies for that protein replacement as well, but it takes more food to do that. Another way that whey protein helps with your weight loss goals is that protein can help suppress your appetite. It is important to note that whey protein is not sold as an appetite suppressant."}, {"url": "https://www.exercise.com/faq/does-whey-protein-help-with-weight-loss", "passage_text": "There are several reasons that whey protein can help with weight loss. The first reason is that it is simply a low calorie low or no fat product. If you eat meat and use that as your primary way of getting protein, no matter how lean the meat is, there are still fat and calories in the meat. Of course, you can use fruits and veggies for that protein replacement as well, but it takes more food to do that. Another way that whey protein helps with your weight loss goals is that protein can help suppress your appetite. It is important to note that whey protein is not sold as an appetite suppressant."}, {"url": "http://www.webmd.com/diet/guide/high-protein-diet-weight-loss", "passage_text": "Going on a high-protein diet may help you tame your hunger, which could help you lose weight. You can try it by adding some extra protein to your meals. Give yourself a week, boosting protein gradually. Remember, calories still count. You'll want to make good choices when you pick your protein. If you plan to add a lot of protein to your diet, or if you have liver or kidney disease, check with your doctor first."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/weight-loss/expert-answers/protein-shakes/faq-20058335", "passage_text": "Since protein contains calories, consuming too much can actually make losing weight more difficult — especially if you drink protein shakes in addition to your usual diet, and you're not exercising. The average adult needs 46 to 56 grams of protein a day, depending on weight and overall health. As long as you're eating a healthy diet, adding extra protein — either through protein shakes or other sources — isn't necessary. Remember, the key to losing weight is burning more calories than you consume. Choose healthy foods — such as fruits, vegetables, whole grains and lean sources of protein — and include physical activity in your daily routine. With. Katherine Zeratsky, R.D., L.D. 1  Phentermine for weight loss. 2  Vitamin B-12 injections."}, {"url": "http://healthyeating.sfgate.com/can-women-drink-whey-protein-trying-lose-weight-8694.html", "passage_text": "One theory behind the correlation between whey protein and weight loss is that protein encourages you to eat less. According to research published in “The American Journal of Clinical Nutrition” in 2008, protein is a more satiating nutrient than either fat or carbohydrate. Protein drinks may help fill you up on fewer calories. Since many bodybuilders and weight trainers use whey protein in an effort to add muscle mass, it might come as a surprise that it can also encourage weight loss."}, {"url": "http://www.wellnessresources.com/tips/articles/how_protein_helps_weight_loss/", "passage_text": "My recommendations for weight loss, based on helping thousands of people lose weight, is to consume 30 percent protein (600 calories), 30 percent carbohydrates (600 calories), and 40 percent fat (800 calories). Do not snack and do not eat after dinner at night. Eat either two or three meals a day. In order to benefit from high protein for weight loss, the amount of carbohydrates must be reduced, which is rule #5 of the Leptin Diet®: Reduce the amount of carbohydrates eaten. This is because carbohydrates are easy-to-use fuels."}, {"url": "http://www.wellnessresources.com/tips/articles/how_protein_helps_weight_loss/", "passage_text": "The amount of quality protein in your diet is the single most important calorie that influences your metabolic rate, favorably influencing weight loss. In order to benefit from high protein for weight loss, the amount of carbohydrates must be reduced, which is rule #5 of the Leptin Diet®: Reduce the amount of carbohydrates eaten. This is because carbohydrates are easy-to-use fuels."}]