[{"url": "https://en.wikipedia.org/wiki/Eye", "passage_text": "Pit eyes, also known as stemma, are eye-spots which may be set into a pit to reduce the angles of light that enters and affects the eyespot, to allow the organism to deduce the angle of incoming light. Found in about 85% of phyla, these basic forms were probably the precursors to more advanced types of simple eye. A compound eye may consist of thousands of individual photoreceptor units or ommatidia (ommatidium, singular). The image perceived is a combination of inputs from the numerous ommatidia (individual eye units), which are located on a convex surface, thus pointing in slightly different directions."}, {"url": "http://www.allaboutvision.com/eye-test/", "passage_text": "The chart can be used in two different ways, depending on what your eye doctor is trying to measure: 1  The chart is held at a specified reading distance (such as 12 inches) and you are asked to read the passage with the smallest type you can see. "}, {"url": "http://www.medicinenet.com/sty_stye/article.htm", "passage_text": "A sty is a bump that forms on or in the eyelid as the result of a blocked gland. The word sty can also be spelled stye. There are two distinct types of styes: hordeolum and chalazion. Each has different causes and treatments. "}, {"url": "http://www.webmd.com/eye-health/picture-of-the-eyes", "passage_text": "• The conjunctiva (a thin layer of tissue covering the front of the eye, except the cornea). Just behind the iris and pupil lies the lens, which helps to focus light on the back of the eye. Most of the eye is filled with a clear gel called the vitreous. Light projects through the pupil and the lens to the back of the eye. The inside lining of the eye is covered by special light-sensing cells that are collectively called the retina. The retina converts light into electrical impulses. Behind the eye, the optic nerve carries these impulses to the brain. "}, {"url": "http://www.visionaware.org/info/your-eye-condition/eye-health/anatomy-of-the-eye/125", "passage_text": "You can get a close-up look at different parts of the eye in this eye diagram from the National Institutes of Health. Diagram of the eye, viewed from the side. To understand this diagram of the eye, try to picture it as being split in two, like an apple that's been cut in half. The Cornea. The cornea is a transparent dome-shaped tissue that forms the front part of your eye. It functions as a window and allows light to enter your eye. It also begins the process of focusing light rays that allow you to see words and images clearly."}, {"url": "https://en.wikipedia.org/wiki/Human_eye", "passage_text": "The eye is not shaped like a perfect sphere, rather it is a fused two-piece unit. The smaller frontal unit, transparent and more curved, called the cornea is linked to the larger white unit called the sclera. "}, {"url": "http://www.tedmontgomery.com/the_eye/", "passage_text": "Included are descriptions, functions, and problems of the major structures of the human eye: conjunctiva, cornea, iris, lens, macula, retina, optic nerve, vitreous, and extraocular muscles. A glossary is included. There also is a test for color deficiency and two short quizzes. The light continues through the vitreous humor, the clear gel that makes up about 80% of the eye s volume, and then, ideally, back to a clear focus on the retina, behind the vitreous. The small central area of the retina is the macula, which provides the best vision of any location in the retina."}, {"url": "http://www.cancer.org/cancer/eyecancer/detailedguide/eye-cancer-what-is-eye-cancer", "passage_text": "Eyeball. The main part of the eye is the eyeball (also known as the globe), which is mostly filled with a jelly-like material called vitreous humor. The eyeball has 3 main layers: the sclera, the uvea, and the retina. Sclera: The sclera is the tough, white covering over most of the outside of the eyeball. Primary intraocular lymphoma (lymphoma of the eye). Lymphoma is a type of cancer that starts in immune system cells called lymphocytes. Most lymphomas start in lymph nodes, which are bean-sized collections of immune system cells scattered throughout the body."}]