[{"url": "http://www.biology-questions-and-answers.com/mollusca.html", "passage_text": "14. Some molluscs, such as bivalves and gastropods, secrete an external calcareous shell. Calcium carbonate is secreted by the mantle, a fold in the epidermis, forming the shell. In pelecypods, the shell is made of moving parts that contain the body between them. In gastropods, the shell only contains the visceral mass. "}, {"url": "https://en.wikipedia.org/wiki/Bivalvia", "passage_text": "The shell of a bivalve is composed of calcium carbonate, and consists of two, usually similar, parts called valves. These are joined together along one edge (the hinge line) by a flexible ligament that, usually in conjunction with interlocking teeth on each of the valves, forms the hinge. Most bivalves are filter feeders, using their gills to capture particulate food such as phytoplankton from the water. The protobranchs feed in a different way, scraping detritus from the seabed, and this may be the original mode of feeding used by all bivalves before the gills became adapted for filter feeding."}, {"url": "https://en.wikipedia.org/wiki/Bivalvia", "passage_text": "The Bivalvia, in previous centuries referred to as the Lamellibranchiata and Pelecypoda, comprise a class of marine and freshwater molluscs that have laterally compressed bodies enclosed by a shell consisting of two hinged parts. Most bivalves are filter feeders, using their gills to capture particulate food such as phytoplankton from the water. The protobranchs feed in a different way, scraping detritus from the seabed, and this may be the original mode of feeding used by all bivalves before the gills became adapted for filter feeding."}, {"url": "http://bivalves.teacherfriendlyguide.org/index.php?option=com_content&view=article&id=19:bivalve-anatomy&catid=15&Itemid=111", "passage_text": "More detailed information about bivalve shells can be found here. The valve structure and soft anatomy of the bivalves varies among species. The Hard-Shelled Clam or Cherrystone, Mercenaria mercenaria, is used here as an example of a typical bivalve. Important features of bivalve shells are: 1  two shelly valves. "}, {"url": "http://eol.org/info/445", "passage_text": "In many bivalves and snails, and in cephalopods, part of the mantle is modified into a siphon, which can be used to pump water through the mantle cavity for respiration, feeding and/or jet propulsion. Freshwater and marine mollusks have gills (called ctenidia) for respiration, located in the mantle cavity. "}, {"url": "https://en.wikipedia.org/wiki/Mantle_(mollusc)", "passage_text": "The mantle (also known by the Latin word pallium meaning mantle, robe or cloak, adjective pallial) is a significant part of the anatomy of molluscs: it is the dorsal body wall which covers the visceral mass and usually protrudes in the form of flaps well beyond the visceral mass itself. The mantle cavity is a central feature of molluscan biology. This cavity is formed by the mantle skirt, a double fold of mantle which encloses a water space. This space contains the mollusc's gills, anus, osphradium, nephridiopores, and gonopores. The mantle cavity functions as a respiratory chamber in most molluscs. In bivalves it is usually part of the feeding structure. In some molluscs the mantle cavity is a brood chamber, and in cephalopods and some bivalves such as scallops, it is a locomotory organ. The mantle is highly muscular"}, {"url": "http://www.fao.org/docrep/007/y5720e/y5720e07.htm", "passage_text": "Figure 9: The internal, soft tissue anatomy of a hermaphroditic scallop. The main function of the mantle is to secrete the shell but it also has other purposes. It has a sensory function and can initiate closure of the valves in response to unfavourable environmental conditions. It can control inflow of water into the body chamber and, in addition, it has a respiratory function. "}, {"url": "http://kids.britannica.com/comptons/article-204816/mollusk", "passage_text": "The basic body structure, consisting of a foot, visceral mass, and mantle, is similar in most mollusks. The foot is located below the visceral mass. The external shell consists of three layers. The thin outer layer, called the periostracum, is made of a tough hornlike material and serves to protect the lower layers. "}, {"url": "https://en.wikipedia.org/wiki/Bivalvia", "passage_text": "The main muscular system in bivalves is the posterior and anterior adductor muscles, although the anterior muscles may be reduced or even lost in some species. These strong muscles connect the two valves and contract in order to close the shell. Most bivalves are filter feeders, using their gills to capture particulate food such as phytoplankton from the water. The protobranchs feed in a different way, scraping detritus from the seabed, and this may be the original mode of feeding used by all bivalves before the gills became adapted for filter feeding."}]