[{"url": "https://nuts.com/cookingbaking/sweeteners/natural-sugar-replacements/agave-powder.html", "passage_text": "Organic agave inulin powder is a nutritious sweetener with a neutral, clean, mildly sweet flavor that makes it a perfect substitute for sugar. Extracted from all natural organic blue agave, this powder is an excellent source of dietary fiber and acts as a prebiotic to support intestinal health."}, {"url": "http://agaviotica.com/articles.html", "passage_text": "Agave inulin is a soluble fiber defined as a prebiotic, which means that it is not digested by the enzymes in our digestive system and can arrive intact to the colon. In the colon, inulin ferments, having a bifidogenic effect."}, {"url": "http://www.iherb.com/Now-Foods-Organic-Inulin-100-Pure-Powder-8-oz-227-g/1100", "passage_text": "NOW Organic Inulin is a fructooligosaccharide that acts as a prebiotic, simulating the growth of friendly and healthy intestinal bacteria, which supports good colon health. Since it also has very low glycemic index, it is suitable for many people who are on restricted diets. Add it to your favorite beverage or food."}, {"url": "http://www.iherb.com/Now-Foods-Organic-Inulin-Pure-Powder-8-oz-227-g/1100", "passage_text": "NOW Organic Inulin is a fructooligosaccharide that acts as a prebiotic, simulating the growth of friendly and healthy intestinal bacteria, which supports good colon health. Since it also has very low glycemic index, it is suitable for many people who are on restricted diets."}, {"url": "https://blog.honest.com/what-is-organic-inulin/", "passage_text": "Honest uses inulin from organic Jerusalem artichokes, as well as organic agave. What it does: Acting as a prebiotic, inulin stays intact through the upper digestive system and makes its way to the large intestine to stimulate the production of microbiota in the colon and gastrointestinal tract."}, {"url": "http://www.vitacost.com/now-foods-organic-inulin", "passage_text": "NOW® Organic Inulin is a fructooligosaccharide that acts as a prebiotic, stimulating the growth of friendly and healthy intestinal bacteria, which supports good colon health. Since it also has a very low glycemic index, it is suitable for many people who are on restricted diets."}, {"url": "http://www.znaturalfoods.com/Agave-Inulin-Powder-Organic", "passage_text": "Add to Cart: Organic raw agave inulin powder is a Super Fiber that has a neutral, clean, mildly sweet flavor (about 40% as sweet as sugar) that not only works like fiber, but also as a prebiotic to promote complete intestinal health."}]