[{"url": "http://transportation-services.findthecompany.com/l/1686587/Swaggin-Wagon-Inc-USDOT-2291826", "passage_text": "Overview. 1  Swaggin Wagon Inc. is an active carrier based in Tulsa, Oklahoma. 2  Its fleet predominantly consists of trucks and tractors. 3  Compared to national competitors, it runs a medium-sized, locally-and regionally-focused operation, utilizing 70 drivers and tallying 5.43M miles across its fleet of 70 vehicles. 1 The graph to the left shows the breakdown of ownership types within Swaggin Wagon Inc.'s fleet compared to peer carriers from different geographic regions. 2  As you'll notice, their fleet is entirely composed of owned vehicles, meaning they have title to each of their"}, {"url": "http://www.youtube.com/watch?v=4ac67S3FC3U", "passage_text": "Please try again later. For the very first time, Ellen's Swaggin' Wagon brought something very special to a viewer -- a marriage proposal! Stephanie Kroll is a huge Ellen fan. She had no idea Ellen would be calling, or that her boyfriend and family were parked right outside. 1  Entertainment"}, {"url": "http://swagginwagon.net/about-us.html", "passage_text": "More Than 30 Years of Experience. Swaggin Wagon’s dispatchers, billing, safety experts and owners have more than 30 years of collaborative experience in coordinating transportation of frac sand to our present and past customers. "}, {"url": "http://transportation-services.findthecompany.com/l/1686587/Swaggin-Wagon-Inc-USDOT-2291826", "passage_text": "Compared to All Carriers, Massive Mileage. 1  Swaggin Wagon Inc.'s dominates the annual mileage of almost all carriers (irrespective of peer group), logging 5.43M miles in its most recent filing. 2  To contextualize the size of its mileage, the average for all federally-registered carriers is 226,338 miles. 1 The graph to the left shows the breakdown of ownership types within Swaggin Wagon Inc.'s fleet compared to peer carriers from different geographic regions. 2  As you'll notice, their fleet is entirely composed of owned vehicles, meaning they have title to each of their 70 vehicles."}, {"url": "http://www.quicktransportsolutions.com/truckingcompany/oklahoma/swaggin-wagon-inc-usdot-2291826.php", "passage_text": "Swaggin Wagon Inc Insurance History. * If a carrier is in compliance, the amount of coverage will always be shown as the required Federal minimum ($5,000 per vehicle, $10,000 per occurrence for cargo insurance and $75,000 for bond/trust fund). The carrier may actually have higher levels of coverage.'; Vehicle Maintenance BASIC Roadside Performance"}, {"url": "http://transportation-services.findthecompany.com/l/1686587/Swaggin-Wagon-Inc-USDOT-2291826", "passage_text": "1 Swaggin Wagon Inc.'s dominates the annual mileage of almost all carriers (irrespective of peer group), logging 5.43M miles in its most recent filing. 1 The graph to the left shows the breakdown of ownership types within Swaggin Wagon Inc.'s fleet compared to peer carriers from different geographic regions. 2  As you'll notice, their fleet is entirely composed of owned vehicles, meaning they have title to each of their 70 vehicles."}, {"url": "http://swagginwagon.net/home.html", "passage_text": "Swaggin Wagon in Tulsa, OK is a trucking company specializing in the transportation of frac sand throughout Oklahoma, Texas and surrounding states. Our logistic experts provide our customers a means of delivering their frac sand to their well locations on time. Our Safe Land USA certified truck drivers and truck pushers have years of experience in hauling frac sand to oil and gas well sites. We serve the commercial clients of Barnett and Eagle Ford Shale in Texas and Woodford Shale in Oklahoma. Our dispatch service is available 7 days a week, 24 hours a day"}, {"url": "http://transportation-services.findthecompany.com/l/1686587/Swaggin-Wagon-Inc-USDOT-2291826", "passage_text": "1 Swaggin Wagon Inc. is an active carrier based in Tulsa, Oklahoma. 2  Its fleet predominantly consists of trucks and tractors. 3  Compared to national competitors, it runs a medium-sized, locally-and regionally-focused operation, utilizing 70 drivers and tallying 5.43M miles across its fleet of 70 vehicles. 1 The graph to the left shows the breakdown of ownership types within Swaggin Wagon Inc.'s fleet compared to peer carriers from different geographic regions. 2  As you'll notice, their fleet is entirely composed of owned vehicles, meaning they have title to each of their"}]