[{"url": "http://www.fcps.edu/islandcreekes/ecology/classification.htm", "passage_text": "Classification of living things is called Taxonomy.. This is when scientists put organisms into groups when they have things in common. The first groups they use are the Kingdoms. There are five kingdoms:"}, {"url": "http://www.ric.edu/faculty/ptiskus/six_kingdoms/", "passage_text": "Plants are all multicellular and consist of complex cells. In addition plants are autotrophs, organisms that make their own food. With over 250,000 species, the plant kingdom is the second largest kingdom. Plant species range from the tiny green mosses to giant trees."}, {"url": "http://www.infoplease.com/dk/science/encyclopedia/animal-kingdom.html", "passage_text": "CLASSIFICATION. In order to make animals easier to study, scientists divide the animal kingdom into divisions and subdivisions. The first division is called a phylum. Each phylum breaks down into groups called classes. Classes are divided into orders, then families, and then genera."}, {"url": "http://www.answers.com/Q/Groups_of_classification_to_largest_to_smallest", "passage_text": "FAMILY  Species is the smallest group of classification.    From largest to smallest, the seven classification are:   Kingdom  Phylum  Class  Order  Family  Ge … nus  Species  . 10 people found this useful."}, {"url": "http://www.answers.com/Q/Groups_of_classification_to_largest_to_smallest", "passage_text": "The Biological Levels of Classification from largest grouping to smallest grouping are:   Domain   Kingdom   Phylum   Class   Order   Family   Genus …   Species   A scientific name of an oganism contains the genus and the species."}, {"url": "http://www.yale.edu/ynhti/curriculum/units/1995/5/95.05.08.x.html", "passage_text": "The kingdom is the largest group and a species is the smallest. In the Animal Kingdom, the term phylum is used, and it is the second largest group. Classes have more characteristics in common than animals in a division or phylum. For example, amphibians, reptiles, and birds belong to the phylum Chordata."}, {"url": "http://www.fcps.edu/islandcreekes/ecology/classification.htm", "passage_text": "Genus. Species. As each group is split into smaller groups, the organisms are more and more alike. For instance, a White-tailed Deer, an Eastern Gray Squirrel, and an Eastern Chipmunk are all in the Mammal Class together."}, {"url": "http://www.fcps.edu/islandcreekes/ecology/classification_group_expla.htm", "passage_text": "Animal Kingdom. The Animal Kingdom is split into several Phyla. Each Phylum group contains organisms that have things in common. Below is a list of some animal Phyla: Chordate Phylum: All the animals which have a backbone. Includes: Fish, Reptiles, Birds, Amphibians, and Mammals."}, {"url": "http://www.fcps.edu/islandcreekes/ecology/classification.htm", "passage_text": "Moneran Kingdom. Each Kingdom is then split into smaller groups, called Phyla. Each Phylum is split into smaller groups called Classes, each Class is split into Orders, each Order is split into Families, each Family is split into Genera, and each Genus is split into Species. A Species is a single organism, not a group."}]