[{"url": "http://medical-dictionary.thefreedictionary.com/alveolus", "passage_text": "Etymology: L, alveolus, little hollow. 1 a small outpouching along the walls of the alveolar sacs through which gas exchange between alveolar air and pulmonary capillary blood takes place. Also called acinus, pulmonary alveolus. 2 a tooth socket. See also dental alveolus. alveolar, adj. A hollow cavity that is an outpouching of the respiratory bronchioles and the alveolar ducts; there are an estimated 150 million alveoli, which are the primary site of gas exchange between the blood and environment, covering a surface area of 75m2. "}, {"url": "https://en.wikipedia.org/wiki/Alveolar_macrophage", "passage_text": "Deep within the lungs exists its constituent alveoli sacs, the sites responsible for the uptake of oxygen and excretion of carbon dioxide. There are three major alveolar cell types in the alveolar wall (pneumocytes): 1 Type I pneumocyte (Squamous Alveolar) cells that form the structure of an alveolar wall. 2  Type II pneumocyte (Great Alveolar) cells that secrete pulmonary surfactant to lower the surface tension of water and allows the membrane to separate, thereby increasing the capability to exchange gases."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/6598039", "passage_text": "The alveolar epithelium comprises two main cell types: the alveolar type I and alveolar type II cell. The type I cell is a complex branched cell with multiple cytoplasmic plates that are greatly attenuated and relatively devoid of organelles; these plates represent the gas exchange surface in the alveolus. On the other hand, the type II cell acts as the caretaker of the alveolar compartment"}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/ptens2.html", "passage_text": "Respiratory System. The oxygen exchange in the lungs takes place across the membranes of small balloon-like structures called alveoli attached to the branches of the bronchial passages. These alveoli inflate and deflate with inhalation and exhalation. The behavior of the alveoli is largely dictated by LaPlace's law and surface tension. It takes some effort to breathe in because these tiny balloons must be inflated, but the elastic recoil of the tiny balloons assists us in the process of exhalation. This fluid, called a surfactant, lowers the surface tension of the balloon-like alveoli by about a factor of 15 compared to the normal mucous tissue fluid in which they are immersed."}, {"url": "http://www.easynotecards.com/notecard_set/3494", "passage_text": "76. alveolar sac. A cluster of alveoli located at the end of each alveolar duct in the lungs; each of the alveoli is a tiny, thin-walled, capillary-rich sac, lined by a simple squamous epithelium, where the exchange (diffusion) of oxygen and carbon dioxide (and other less important gases) takes place. The squamous epithelial cell forming the alveolar wall and through whose cell membranes and cytoplasm the exchange of oxygen and carbon dioxide (and other less important gases) takes place; collectively they cover 95% of the alveolar surface area."}, {"url": "http://www.aw-bc.com/info/ip/assignmentfiles/respiratory/Gas_Exchange.pdf", "passage_text": "• External respiration occurs within the lungs, as carbon dioxide diffuses from the pulmonary. capillaries into the alveoli, and oxygen diffuses from the alveoli into the pulmonary. capillaries. • Oxygen-rich blood leaves the lungs and is transported through the pulmonary veins to the. left side of the heart. • Oxygen diffuses from the systemic capillaries into the cells. • Carbon dioxide diffuses from the cells into the systemic capillaries. • Factors affecting the exchange of oxygen and carbon dioxide during internal respiration: 1. The available surface area, which varies in different tissues throughout the body. 2"}, {"url": "http://www.aw-bc.com/info/ip/assignmentfiles/respiratory/Gas_Exchange.pdf", "passage_text": "Introduction• Oxygen and carbon dioxide diffuse between the alveoli and pulmonary capillaries in the lungs, andbetween the systemic capillaries and cells throughout the body.• The diffusion of these gases, moving in opposite directions, is called gas exchange.Page 2. • Oxygen diffuses from the systemic capillaries into the cells. • Carbon dioxide diffuses from the cells into the systemic capillaries. • Factors affecting the exchange of oxygen and carbon dioxide during internal respiration: 1. The available surface area, which varies in different tissues throughout the body."}, {"url": "https://en.wikipedia.org/wiki/Alveolar_macrophage", "passage_text": "An alveolar macrophage (or dust cell) is a type of macrophage found in the pulmonary alveolus, near the pneumocytes, but separated from the wall. Activity of the alveolar macrophage is relatively high, because they are located at one of the major boundaries between the body and the outside world. 1 Type I pneumocyte (Squamous Alveolar) cells that form the structure of an alveolar wall. 2  Type II pneumocyte (Great Alveolar) cells that secrete pulmonary surfactant to lower the surface tension of water and allows the membrane to separate, thereby increasing the capability to exchange gases."}, {"url": "https://en.wikipedia.org/wiki/Alveolar_macrophage", "passage_text": "1 Type II pneumocyte (Great Alveolar) cells that secrete pulmonary surfactant to lower the surface tension of water and allows the membrane to separate, thereby increasing the capability to exchange gases. 1 Type I pneumocyte (Squamous Alveolar) cells that form the structure of an alveolar wall. 2 "}]