[{"url": "http://www.howtocleanstuff.net/how-to-clean-a-bird-bath/", "passage_text": "Make sure to do a dynamite job of rinsing your bird bath with water so that you get all of the bleach solution out of it. Again, use the jet sprayer on the hose or use a clean bucket filled with water and your scrub brush. 4. Let the bleach solution set. Pour the bleach solution into the bird bath so that the entire surface of the tub is covered. Be especially sure to cover any areas of mildew growth or algae. Then let the solution set for 10 to 15 minutes. *It’s crucial that you cover the bird bath during this step so that no birds attempt to sit in it"}, {"url": "http://www.ehow.com/how_5011814_clean-algae-off-birdbath.html", "passage_text": "Removing Algae. Drain the birdbath of any water. Make a paste by mixing baking soda and water in a bowl. Use a crumpled up plastic bag and scrub the paste into the algae stained areas. Continue to scrub, adding more paste as needed until all of the algae is gone. Rinse the birdbath with clean water."}, {"url": "http://www.wikihow.com/Keep-Algae-from-Growing-in-Bird-Bath", "passage_text": "3. Scrub the inside your birdbath once a week. This will remove any algae spores that may recently have settled into your birdbath. 1  Dispose your birdbath of its water and use a stiff, nylon scrub brush to scrub the entire inside your birdbath. 1 Pour the water and vinegar or bleach mixture into the birdbath, then use the nylon scrub brush to clean the insides of the bath. 2  Rinse the birdbath of all remaining vinegar or bleach using your garden hose or bucket. 3  Pour clean and fresh water into your birdbath after finishing the rinsing."}, {"url": "http://birding.about.com/od/birdingsupplies/ss/How-To-Clean-A-Bird-Bath-Without-Scrubbing.htm", "passage_text": "The first step in cleaning a very dirty bird bath is to get rid of the contaminated water. This water is often filled with organic material such as feces, algae and dirt, and it is safe to use to water nearby flowers or plants. "}, {"url": "http://www.wikihow.com/Keep-Algae-from-Growing-in-Bird-Bath", "passage_text": "Tips. 1  Although white vinegar will remove the algae from your birdbath, it does not contain properties that will remove bacteria or any other diseases that remain in your birdbath. 2  To reduce health risks from bacteria contamination, you may want to wear a pair of cleaning gloves while you handle your birdbath. 1 Pour the water and vinegar or bleach mixture into the birdbath, then use the nylon scrub brush to clean the insides of the bath. 2  Rinse the birdbath of all remaining vinegar or bleach using your garden hose or bucket. 3  Pour clean and fresh water into your birdbath after finishing the rinsing."}, {"url": "http://www.wikihow.com/Keep-Algae-from-Growing-in-Bird-Bath", "passage_text": "1 Rinse the inside your birdbath with clean water to remove any remaining debris or algae spores that were scrubbed off. 2  You may want to use a garden hose or bucket of water to aid in the rinsing. 3  Refill your birdbath with clean and fresh water. 1 Pour the water and vinegar or bleach mixture into the birdbath, then use the nylon scrub brush to clean the insides of the bath. 2  Rinse the birdbath of all remaining vinegar or bleach using your garden hose or bucket. 3  Pour clean and fresh water into your birdbath after finishing the rinsing."}, {"url": "http://www.wikihow.com/Keep-Algae-from-Growing-in-Bird-Bath", "passage_text": "2. Replace the water in the birdbath daily. This will help keep the water fresh and prevent algae growth from spreading within the birdbath. 1  If your schedule does not allow you to replace the water daily, replace the water every 2 or 3 days to keep its freshness. 1 Pour the water and vinegar or bleach mixture into the birdbath, then use the nylon scrub brush to clean the insides of the bath. 2  Rinse the birdbath of all remaining vinegar or bleach using your garden hose or bucket. 3  Pour clean and fresh water into your birdbath after finishing the rinsing."}, {"url": "http://www.instructables.com/id/How-to-Clean-a-Bird-Bath-Without-Scrubbing/", "passage_text": "Show All Items. The first step in cleaning a very dirty bird bath is to get rid of the contaminated water. This water is often filled with organic material such as feces, algae and dirt, and it is safe to use to water nearby flowers or plants. "}]