[{"url": "http://www.indonesiapoint.com/currency-of-indonesia.html", "passage_text": "Currency of Indonesia. Indonesian Currency rupiah-The local currency of Indonesia is Rupiah (Rp) and 1Rp = 100 sen. Bills come in denominations of Rp 1000, 2000, 5000, 10,000, 20,000, 50,000 and 1,00,000. Coins come in denominations of Rp 100, 200, 500 and 1000. Indonesian Currency rupiah-The local currency of Indonesia is Rupiah (Rp) and 1Rp = 100 sen. Bills come in denominations of Rp 1000, 2000, 5000, 10,000, 20,000, 50,000 and 1,00,"}, {"url": "http://www.sulawesi-experience.com/indonesia-money-currency.html", "passage_text": "Indonesia Currency is called Rupiah (IDR; symbol Rp). Notes are in denominations of Rp100.000, 50.000, 20.000, 10.000, 5.000 and 1.000. Coins are in denominations of Rp1.000, 500, 100, 50 and 25. Indonesia Money and Currency Guide Information. 5 out of 5 (33). Indonesia Currency is called Rupiah (IDR; symbol Rp), the largest banknote is Rp 100,000, which may only be US$10 but is still inconveniently large for most purchases. Next in the series are Rp 50,000, Rp 20,000, Rp 10,000, Rp 5,000, Rp 2,000 and finally Rp 1,000"}, {"url": "http://www.expat.or.id/info/rupiahworld.html", "passage_text": "The currency in Indonesia is the rupiah, which comes from the Sanskrit word for wrought silver, rupya. Indonesian banknotes come in denominations of Rp 1,000, 2,000, 5,000, 10,000, 20,000, and 50,000, and Rp 100,000. Occasionally one sees old Rp 1,000 notes, but they will eventually be phased out. "}, {"url": "http://traveltips.usatoday.com/currency-used-bali-54996.html", "passage_text": "Bali, one of the Indonesian islands in the South Pacific, uses Indonesia's rupiah as its main form of currency. Travelers heading to the island must ensure they have an understanding of the rupiah in advance to avoid being given an incorrect amount of change or an unfair exchange rate. "}, {"url": "http://coinmill.com/IDR_calculator.html", "passage_text": "The Indonesian Rupiah is the currency in Indonesia (ID, IDN). The symbol for IDR can be written Rp. The Indonesian Rupiah is divided into 100 sen. The exchange rate for the Indonesian Rupiah was last updated on October 13, 2015 from The International Monetary Fund. "}, {"url": "http://www.xe.com/currency/idr-indonesian-rupiah", "passage_text": "Indonesia, Rupiah. The Indonesian Rupiah is the currency of Indonesia. Our currency rankings show that the most popular Indonesia Rupiah exchange rate is the IDR to AUD rate. The currency code for Rupiahs is IDR, and the currency symbol is Rp. Below, you'll find Indonesian Rupiah rates and a currency converter. You can also subscribe to our currency newsletters with daily rates and analysis, read the XE Currency Blog, or take IDR rates on the go with our XE Currency Apps and website. "}, {"url": "https://en.wikipedia.org/wiki/Indonesian_rupiah", "passage_text": "The rupiah (Rp) is the official currency of Indonesia. Issued and controlled by the Bank of Indonesia, the ISO 4217 currency code for the Indonesian rupiah is IDR. The name rupiah is derived from the Hindustani word rupiyaa (روپیہ),(रुपया), ultimately from Sanskrit rupya (रूप्य; wrought silver). Informally, Indonesians also use the word  perak  ('silver' in Indonesian) in referring to rupiah. The rupiah is subdivided into 100 sen, although inflation has rendered all coins and banknotes denominated in sen obsolete."}, {"url": "http://www.discover-java-and-bali.com/indonesia-currency.html", "passage_text": "Indonesia Currency. Indonesia currency is Indonesian Rupiah IDR and its worth about US$ 0.0001. So you get about IDR 10,000 for US$ 1. A few years ago Indonesian money was more worth than nowadays. People in Indonesia keep struggling with their value of money. Especially for poor people, they can barely keep up the worth of money. "}]