[{"url": "http://www.rightdiagnosis.com/h/hepatitis_a/stats.htm", "passage_text": "See also prevalence and incidence page for Hepatitis A. Incidence (annual) of Hepatitis A: 32,000 new cases in the USA 1992 (Digestive diseases in the United States: Epidemiology and Impact NIH Publication No. 94-1447, NIDDK, 1994). Incidence Rate: approx 1 in 8,500 or 0.01% or 32,000 people in USA [ about data ]. 32 to 38 percent of U.S. population that have any history of disease (1991) (Source: excerpt from Digestive Diseases Statistics: NIDDK). Incidence of Hepatitis A: 32,000 new cases (1992"}, {"url": "http://www.rightdiagnosis.com/h/hepatitis_a/stats.htm", "passage_text": "The following statistics relate to the incidence of Hepatitis A: 1  23,229 cases annually (1998). 2  17,047 annual cases notified in USA 1999 (MMWR 1999). 3  1.59 per 100,000 in Canada 2000 1. 4  150,000 cases each year in the US (Blood Safety Surveillance and Health Care Acquired Infections Division, Health Canada). 32 to 38 percent of U.S. population that have any history of disease (1991) (Source: excerpt from Digestive Diseases Statistics: NIDDK). Incidence of Hepatitis A: 32,000 new cases (1992"}, {"url": "http://www.healthline.com/health/hepatitis-c/facts-statistics-infographic", "passage_text": "1 Many people are unaware they’re infected. 2  55–85 percent will develop chronic HCV infection. 3  For people with chronic HCV infection, the chance of developing cirrhosis of the liver is 15–30 percent within 20 years. 4  130–150 million people around the world are living with chronic HCV. 1 15–45 percent of people infected with HCV get better within six months without ever receiving treatment. 2  Many people are unaware they’re infected. 3  55–85 percent will develop chronic HCV infection. 4"}, {"url": "http://www.epidemic.org/theFacts/theEpidemic/worldPrevalence/", "passage_text": "While not every nation in the world has had adequate means to survey its population for incidence of the virus, enough statistics have been compiled to demonstrate the enormous threat posed by hepatitis C. Hepatitis C, in combination with hepatitis B, now accounts for 75% of all cases of liver disease around the world. These studies, when added together, suggest that over 200 million people around the world are infected with hepatitis C-an overall incidence of around 3.3% of the world's population. Statistically, as many people are infected with HCV as are with HIV, the virus that causes AIDS."}, {"url": "http://hepatitis-c.emedtv.com/hepatitis-c/hepatitis-c-statistics.html", "passage_text": "For about 85 percent of infected people, however, the immune system is not able to completely get rid of the hepatitis C virus, and they end up having a long-term liver infection. Hepatitis C is an infection of the liver caused by the hepatitis C virus (HCV)."}, {"url": "http://hepatitis-c.emedtv.com/hepatitis-c/hepatitis-c-statistics.html", "passage_text": "Approximately 300 million people worldwide are infected with the hepatitis C virus. About 3.9 million people in the United States have chronic hepatitis C. This represents about 1.8 percent of the population. Hepatitis C is an infection of the liver caused by the hepatitis C virus (HCV)."}, {"url": "http://www.intheknowzone.com/sexual-health-topics/hepatitis/statistics.html", "passage_text": "Hepatitis Statistics. Statistics. Hepatitis A. 1  About 15% of people infected with hepatitis A will have recurring symptoms over a 6 to 9 month period. 2  Hepatitis A occurs in epidemics (many affected people) within the United States and internationally. 3  During epidemics years the number of cases of hepatitis A reached 35,000 in the U.S. 1"}, {"url": "http://www.euro.who.int/en/health-topics/communicable-diseases/hepatitis/data-and-statistics", "passage_text": "Data and statistics. Hepatitis is an inflammation of the liver, most commonly caused by a viral infection. The five main strains of hepatitis viruses are A, B, C, D and E. 1 an overall hepatitis B incidence of 1.49 per 100 000; 2  a hepatitis C incidence of 8.7 per 100 000 in the Member States of the European Union (EU); and. 3  high prevalence in people who inject drugs."}, {"url": "http://hepatitis-c.emedtv.com/hepatitis-c/hepatitis-c-statistics.html", "passage_text": "Hepatitis C Statistics: An Overview. Hepatitis C is an infection of the liver caused by the hepatitis C virus (HCV). There are two types of hepatitis C -- acute and chronic. About 15 percent of cases end up being acute hepatitis C, in which the immune system is able to completely destroy the virus"}, {"url": "http://www.rightdiagnosis.com/h/hepatitis_a/stats.htm", "passage_text": "Society statistics for Hepatitis A. Costs for Hepatitis A: $200 million in 1991 (CDC-OC). Costs for Hepatitis A: The estimated cost for treating hepatitis A is $200 million (1991)/yearly including medical and work loss (Source: excerpt from Facts About Hepatitis A and C: CDC-OC). 32 to 38 percent of U.S. population that have any history of disease (1991) (Source: excerpt from Digestive Diseases Statistics: NIDDK). Incidence of Hepatitis A: 32,000 new cases (1992"}]