[{"url": "http://www.food.com/recipe/frittata-77953", "passage_text": "1 Preheat oven broiler. 2  In a large ovenproof nonstick skillet, brown potato slices in hot olive oil, and set aside to drain on paper towels. 3  Heat more olive oil, if needed, in same pan over medium heat, and saute onions for 4-5 minutes. Directions. 1 "}, {"url": "https://en.wikipedia.org/wiki/Frittata", "passage_text": "Frittata is an egg-based Italian dish similar to an omelette or crustless quiche, enriched with additional ingredients such as meats, cheeses, vegetables or pasta. The word frittata is Italian and roughly translates to fried. The Italian word frittata derives from friggere and roughly means fried. This was originally a general term for cooking eggs in a skillet, anywhere on the spectrum from fried egg, through conventional omelette, to an Italian version of the Spanish tortilla de patatas, made with fried potato."}, {"url": "http://www.cookingchanneltv.com/recipes/kelsey-nixon/garden-vegetable-frittata.html", "passage_text": "Season the vegetables with salt, and pepper. In a medium bowl, beat together the eggs, basil, cheese, salt, and pepper. Pour into the skillet over the vegetables. Reduce heat to medium-low and scramble the eggs for 1 minute. Return the potatoes to the skillet. Cook for an additional 2 to 3 minutes, or just until the eggs start to set around the edges. "}, {"url": "http://culinaryarts.about.com/od/eggsdairy/r/spinbacchedfrit.htm", "passage_text": "For this frittata recipe we cook everything in a cast-iron skillet because it can be heated on the stovetop and then transferred to the oven where the cooking is finished. 1 Cook the bacon in a cast iron skillet over medium-low heat. 2  When bacon is crispy, remove it from the pan, drain on paper towels and set aside. 3  When it's cool, roughly chop it into ¼ inch pieces — or just crumble it up."}, {"url": "http://www.foodnetwork.com/recipes/alton-brown/frittata-recipe.html#!", "passage_text": "In medium size bowl, using a fork, blend together eggs, Parmesan, pepper, and salt. Heat 12-inch non-stick, oven safe saute pan over medium high heat. Add butter to pan and melt. Add asparagus and ham to pan and saute for 2 to 3 minutes. Pour egg mixture into pan and stir with rubber spatula. Cook for 4 to 5 minutes or until the egg mixture has set on the bottom and begins to set up on top. Sprinkle with parsley. Place pan into oven and broil for 3 to 4 minutes, until lightly browned and fluffy. Remove from pan and cut into 6 servings."}, {"url": "http://www.tasteofhome.com/recipes/-what-s-in-the-fridge--frittata", "passage_text": "Directions. 1  In a small bowl, whisk eggs; set aside. 2  In an 8-in. 3  ovenproof skillet, saute the onion, pepper and mushrooms in oil until tender. 4  Reduce heat; sprinkle with crab. 5  Top with eggs. 6  Cover and cook for 5-7 minutes or until nearly set. 7  Uncover skillet; sprinkle with cheese. 1"}, {"url": "http://www.epicurious.com/recipes/food/views/bacon-and-potato-frittata-51107800", "passage_text": "Preparation. 1  Preheat broiler. 2  Whisk together eggs, basil, parmesan, 1/4 teaspoon salt, and 1/4 teaspoon pepper in a large bowl. 3  Cook bacon in a 10-inch heavy skillet over medium heat, stirring, until crisp. 4  Transfer bacon with a slotted spoon to a large bowl then pour off all but 2 tablespoons fat. 1 Preheat broiler. 2  Whisk together eggs, basil, parmesan, 1/4 teaspoon salt, and 1/4 teaspoon pepper in a large bowl. 3  Cook bacon in a 10-inch heavy skillet over medium heat, stirring, until crisp. 4  Transfer bacon with a slotted spoon to a large bowl then pour off all but 2 tablespoons fat."}, {"url": "http://www.thekitchn.com/how-to-make-a-frittata-cooking-lessons-from-the-kitchn-170717", "passage_text": "5. Bake the Frittata: Put the entire pan in the oven and bake for 8 to 10 minutes until the eggs are set. To check, cut a small slit in the center of the frittata. If raw eggs run into the cut, bake for another few minutes; if the eggs are set, pull the frittata from the oven."}, {"url": "http://culinaryarts.about.com/od/eggsdairy/r/spinbacchedfrit.htm", "passage_text": "1 Preheat oven to 450°F. 2  Cook the bacon in a cast iron skillet over medium-low heat. 3  When bacon is crispy, remove it from the pan, drain on paper towels and set aside. 4  When it's cool, roughly chop it into ¼ inch pieces — or just crumble it up. 1 Cook the bacon in a cast iron skillet over medium-low heat. 2  When bacon is crispy, remove it from the pan, drain on paper towels and set aside. 3"}]