[{"url": "http://cplus.about.com/od/introductiontoprogramming/p/compiler.htm", "passage_text": "A compiler is a program that translates human readable source code into computer executable machine code. To do this successfully the human readable code must comply with the syntax rules of whichever programming language it is written in. The compiler is only a program and cannot fix your programs for you. This output from Lexical Analyzer goes to the Syntactical Analyzer part of the compiler. This uses the rules of grammar to decide whether the input is valid or not. Unless variables A and B had been previously declared and were in scope, the compiler might say. ' 1 A' : undeclared identifier."}, {"url": "http://whatis.techtarget.com/definition/compiler", "passage_text": "Traditionally, the output of the compilation has been called object code or sometimes an object module. (Note that the term object here is not related to object-oriented programming .) The object code is machine code that the processor can process or execute one instruction at a time. The file that is created contains what are called the source statements. The programmer then runs the appropriate language compiler, specifying the name of the file that contains"}, {"url": "http://www.webopedia.com/TERM/C/compiler.html", "passage_text": "The compiler derives its name from the way it works, looking at the entire piece of source code and collecting and reorganizing the instructions. Thus, a compiler differs from an interpreter, which analyzes and executes each line of source code in succession, without looking at the entire program. Because compilers translate source code into object code, which is unique for each type of computer, many compilers are available for the same language. For example, there is a FORTRAN compiler for PCs and another for Apple Macintosh computers."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20091030083211AAKHkdC", "passage_text": "Rating Newest Oldest. Best Answer: An assembler translate a program written in assembly-language to machine-code (object-file), and optionally to an executable (runnable program-file), like a EXE or COM file. A compiler translate a source-code written i a programming-language (like C or Pascal) to an object-file (machine code). Report Abuse. a compiler converts the source code of a program into assembly language, and the assembler converts the assembly source into something that can be read by the computer (1's and 0's)."}, {"url": "https://en.wikibooks.org/wiki/Compiler_Construction/Lexical_analysis", "passage_text": "Lexical Analysis. Lexical analysis is the process of analyzing a stream of individual characters (normally arranged as lines), into a sequence of lexical tokens (tokenization. for instance of words and punctuation symbols that make up source code) to feed into the parser. "}, {"url": "https://en.wikipedia.org/wiki/MinGW", "passage_text": "MinGW does not rely on third-party C runtime dynamic-link library (DLL) files, and because the runtime libraries are not distributed using the GNU General Public License (GPL), it is not necessary to distribute the source code with the programs produced, unless a GPL library is used elsewhere in the program. MinGW (Minimalist GNU for Windows), formerly mingw32, is a free and open source software development environment for creating Microsoft Windows applications."}, {"url": "http://www.sciforums.com/threads/whats-the-importance-of-compiler-technology.37505/", "passage_text": "Messages: 1,296. Java has a compiler which compiles source into byte code. This can be run on a virtual machine(which can be seen as an interpreter) or a machine whose machine language is bytecode, eg. picojava chips. The third option is a just in time(JIT) compiler which compiles java to native code. Voodoo Child, Jun 18, 2004. #6."}, {"url": "http://whatis.techtarget.com/definition/compiler", "passage_text": "A compiler is a special program that processes statements written in a particular programming language and turns them into machine language or code that a computer's processor uses. Typically, a programmer writes language statements in a language such as Pascal or C one line at a time using an editor. The file that is created contains what are called the source statements. The programmer then runs the appropriate language compiler, specifying the name of the file that contains"}, {"url": "http://www.cplusplus.com/articles/o8TbqMoL/", "passage_text": "From wikipedia: The name compiler is primarily used for programs that translate source code from a high-level programming language to a lower level language (e.g., assembly language or machine code). The most common reason for wanting to transform source code is to create an executable program. So how does IDEs like Code::Blocks or Dev-C++ compile your code? They use compilers. Code::Blocks uses MinGW Compiler which is a port of the GCC set of compilers. Dev-C++ uses that same compiler too but the version may vary."}, {"url": "http://www.sciforums.com/threads/whats-the-importance-of-compiler-technology.37505/", "passage_text": "Interpreters languages like Perl, or even Interpreter programs like the browser your using to view the forums, allows human readible programming to be executed. However Interpreting code thats human readible is Slow, and in most interpreters I know of it works on the basis of Line by Line. Java has a compiler which compiles source into byte code. This can be run on a virtual machine(which can be seen as an interpreter) or a machine whose machine language is bytecode, eg. picojava chips. The third option is a just in time(JIT) compiler which compiles java to native code. Voodoo Child, Jun 18, 2004. #6."}]