[{"url": "https://en.wikipedia.org/wiki/Median_household_income", "passage_text": "(March 2015). Median income is the amount that divides the income distribution into two equal groups, half having income above that amount, and half having income below that amount. Mean income (average) is the amount obtained by dividing the total aggregate income of a group by the number of units in that group. 1 Based on analysis on US median household income, median household money income during the 2006-2012 period had an average (but not median) of $53,836, therefore by comparison the Gallup result is underreported and is even below the Census' own figures."}, {"url": "https://answers.yahoo.com/question/index?qid=20100916215024AAmO5rN", "passage_text": "Best Answer: Median is not the same as average. In your first example, you are correct as to the definition of median. Median household income is not within the family. It would be from different households. a family median income for an area is.... in an area of 3 families, one family earns $20, second family earns $30, and third family earns..."}, {"url": "http://economistsoutlook.blogs.realtor.org/2014/04/08/median-income-family-vs-household/", "passage_text": "While the median household income is $51,371 in the US, this varies by age. Households with heads under 25 years old have a median income of $24,476 compared to $55,821 for those with heads aged 25 to 44 years old. Did you know: “Typical” income for a household or family varies based on the type of family you’re interested in describing. Typical income can be measured in a variety of ways. Analysts often use median household income to indicate what is typical."}, {"url": "https://en.wikipedia.org/wiki/Median_household_income", "passage_text": "In 2013, Gallup published a list of countries with median household income. Using median, rather than mean income, results in a much more accurate picture of the average income of the middle class since the data will not be skewed by gains and abnormalities in the extreme ends. 1 Based on analysis on US median household income, median household money income during the 2006-2012 period had an average (but not median) of $53,836, therefore by comparison the Gallup result is underreported and is even below the Census' own figures."}, {"url": "http://www.investordictionary.com/definition/median-household-income", "passage_text": "The median household income is commonly used to provide data about smaller geographic areas. The median is the middle number present in a set of data when the incomes of all household are arranged in an order of highest to lowest (if number of values in a set is even, the average between the two middle values are used)."}, {"url": "https://en.wikipedia.org/wiki/Household_income_in_the_United_States", "passage_text": "Median income is the amount which divides the income distribution into two equal groups, half having income above that amount, and half having income below that amount. Mean income (average) is the amount obtained by dividing the total aggregate income of a group by the number of units in that group. According to the Federal Reserve, this measure was $51,939 in 2013, below the 1999 peak of around $57,000. The Census Bureau estimated real median household income at $53,657 for 2014 and $54,462 in 2013."}, {"url": "http://economistsoutlook.blogs.realtor.org/2014/04/08/median-income-family-vs-household/", "passage_text": "Median income for a one-person household is $27,237 while typical income for a two-person household is $58,121. Median income rises as household size increases, peaking at 4-person households with a median income of $75,343. For 5 or more person households, median income ranges from $64,747 to $69.691. In families, we see a similar pattern except that, by definition, there are no 1-person families. Did you know: “Typical” income for a household or family varies based on the type of family you’re interested in describing. Typical income can be measured in a variety of ways. Analysts often use median household income to indicate what is typical."}, {"url": "http://budgeting.thenest.com/definition-median-household-income-31126.html", "passage_text": "Median household income is a dollar amount that represents the dividing line in a household income distribution list. For example, if the median household income is $50,000, exactly one-half of the household incomes listed fall above this amount and exactly one-half fall below."}, {"url": "http://finance.zacks.com/definition-median-household-income-9856.html", "passage_text": "Meaning. Household income refers to the sum total of all income for members of the household over age 15, regardless of how many people live there or how they share the earnings. Median household income in a given year is the income for a household that's at the midpoint of all household incomes reported. It's not an average. Instead, it represents the middle income -- the point at which half of all households earn more, and half earn less. "}]