[{"url": "http://health.costhelper.com/pelvic-ultrasounds.html", "passage_text": "1 And Saint Elizabeth Regional Medical Center in Nebraska, charges $240-$620 for a non-obstetric pelvic ultrasound, $484 for a transrectal ultrasound and $580 for a transvaginal ultrasound, not including the radiologist fee. 1 For patients covered by health insurance, out-of-pocket costs typically consist of a copay of $10-$50 or more, or coinsurance of 10%-50% or more. 2  For patients not covered by health insurance, the cost of a pelvic ultrasound typically varies by provider and geographic region."}, {"url": "http://www.democraticunderground.com/10023199022", "passage_text": "For patients not covered by health insurance, the cost of a pelvic ultrasound typically varies by provider and geographic region. The typical cost range is $250 -$1,100, with a national average cost of $525, according to NewChoiceHealth.com. For example, Concierge Medicine in California charges $275 for a pelvic ultrasound. Baptist Memorial Health Care in Tennessee charges $395 for a transvaginal ultrasound"}, {"url": "http://health.costhelper.com/pelvic-ultrasounds.html", "passage_text": "1 The typical cost range is $250-$1,100, with a national average cost of $525, according to NewChoiceHealth.com. 2  For example, Concierge Medicine in California charges $275 for a pelvic ultrasound. 3  Baptist Memorial Health Care in Tennessee charges $395 for a transvaginal ultrasound. 1 For patients covered by health insurance, out-of-pocket costs typically consist of a copay of $10-$50 or more, or coinsurance of 10%-50% or more. 2  For patients not covered by health insurance, the cost of a pelvic ultrasound typically varies by provider and geographic region."}, {"url": "http://health.costhelper.com/pelvic-ultrasounds.html", "passage_text": "1 Dartmouth-Hitchcock Medical Center, in New Hampshire, charges $561 for a non-obstetric pelvic ultrasound, and $710 for an obstetric ultrasound, including the doctor fee, after an uninsured discount of 30%. 1 For patients covered by health insurance, out-of-pocket costs typically consist of a copay of $10-$50 or more, or coinsurance of 10%-50% or more. 2  For patients not covered by health insurance, the cost of a pelvic ultrasound typically varies by provider and geographic region."}, {"url": "http://www.democraticunderground.com/10023199022", "passage_text": "And Saint Elizabeth Regional Medical Center in Nebraska, charges $240 -$620 for a non-obstetric pelvic ultrasound, $484 for a transrectal ultrasound and $580 for a transvaginal ultrasound, not including the radiologist fee. For obstetric transabdominal ultrasounds, they charge $569 -$1,099. The typical cost range is $250 -$1,100, with a national average cost of $525, according to NewChoiceHealth.com. For example, Concierge Medicine in California charges $275 for a pelvic ultrasound."}, {"url": "http://www.compareultrasoundcost.com/", "passage_text": "Not all facilities charge the same amount for the same procedure. Usually stand alone ultrasound facilities, which are not associated with hospitals, cost around $99 to $300. The same ultrasound performed at a hospital may run $200 to $1000. These ultrasound cost usually include the price for black and white pictures, videos, and/or a CD photo disk. Often the cost of an ultrasound is reimbursed by insurance companies if the procedure is considered medically necessary"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/23954533", "passage_text": "OBJECTIVE: Transabdominal ultrasound (TAUS) cervical length (CL) screening has been proposed as an alternative to universal transvaginal screening to identify women at an increased risk of preterm birth. We sought to identify whether and under what circumstances TAUS would be cost-effective. In comparison to TAUS, universal transvaginal CL screening reduced preterm birth by 0.03%, reduced costs by $1.2 million and increased quality-adjusted life years by 70 per 100,000 women."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/23954533", "passage_text": "CONCLUSION: Compared with an initial TAUS screen, universal transvaginal ultrasound was a more cost-effective strategy under most assumptions. Optimizing TAUS testing characteristics or applying a transabdominal screening strategy in lower risk populations may yield an initial TAUS to be cost-effective. In comparison to TAUS, universal transvaginal CL screening reduced preterm birth by 0.03%, reduced costs by $1.2 million and increased quality-adjusted life years by 70 per 100,000 women."}, {"url": "http://www.webmd.com/women/pelvic-ultrasound", "passage_text": "Pelvic ultrasound can be done three ways: transabdominal, transrectal, and transvaginal. 1  Transabdominal ultrasound. 2  A small handheld device called a transducer is passed back and forth over the lower belly. 3  A transabdominal ultrasound is commonly done in women to look for large uterine fibroids or other problems. "}]