[{"url": "https://answers.yahoo.com/question/index?qid=20080409162618AAqLrJ9", "passage_text": "Best Answer: There are 99 Gold Bricks. You get Gold Bricks when you complete a level for the first time in Story Mode. You also get Gold Bricks when you earn True Jedi status (based on # of studs collected per level and the # required varies on each level) in Story Mode and also in Free Play Mode."}, {"url": "http://www.videogamesblogger.com/2013/10/25/lego-marvel-super-heroes-gold-bricks-locations-guide.htm", "passage_text": "Posted by: Ferry Groenendijk. Welcome to the Lego Marvel Super Heroes Gold Bricks locations guide that shows you how to find and unlock the total of 250 Gold Bricks locations for the PS3, Xbox 360, Wii U, PC, PS Vita, 3DS, DS, Xbox One & PS4 action-adventure game."}, {"url": "http://justforgamer.com/all-gold-bricks-locations-in-lego-batman-2/", "passage_text": "1 Beat a level in Story Mode to get a Gold Brick. 2  You get 1 for each of the 15 levels, so 15 Gold Bricks in all. 3  Satisfy a level’s Super Hero stud requirement during Story Mode or Free Play Mode. 4  At 1 per level, that’s another 15 Gold Bricks."}, {"url": "http://www.ign.com/wikis/lego-marvel-super-heroes/Gold_Bricks", "passage_text": "Edit Page Last Edit: 10 months 10 days ago. Welcome to the Gold Bricks guide for Lego Marvel Super Heroes. Here you will find information on how to obtain those shiny yellow bricks and each of their locations in the open-world map of Manhattan. Note: This section doesn’t cover the Gold Bricks obtained through the Story Mode or Side Missions."}, {"url": "http://www.videogamesblogger.com/2013/10/25/lego-marvel-super-heroes-gold-bricks-locations-guide.htm", "passage_text": "Go and find the “Gold Brick Finder” Red Brick first. It’ll make it a lot easier to find all the other Gold Bricks when they are being pointed out to you. We’ll add its location as soon as we find it. 1  Beat a level in Story Mode to get a Gold Brick. 2  You get 1 for each of the 15 levels, so 15 Gold Bricks in all."}, {"url": "http://www.gamesradar.com/lego-marvel-super-heroes-gold-brick-locations-guide/", "passage_text": "The world of Lego Marvel Super Heroes is absolutely packed with things to do, and if you want to get that 100% completion, you'll have to do it all. If you read our Lego Marvel Super Heroes review, you know that the biggest components of that 100% are Gold Bricks."}]