[{"url": "http://www.wisegeek.org/what-is-salt-peter.htm", "passage_text": "Salt peter typically refers to the chemical compound potassium nitrate, though it may also refer to sodium nitrate. Salt peter was once collected from decomposing material, but today, it is generally manufactured by treating sodium nitrate, mostly mined in Chile, with potassium chloride and collecting the precipitate."}, {"url": "http://www.peoplespharmacy.com/2003/09/08/will-saltpeter-dampen-sexual-d/", "passage_text": "A. Potassium nitrate, also known as niter or saltpeter, has been used to preserve meat and is found in toothpaste formulated for sensitive teeth. It is also used to make fireworks, explosives, matches and fertilizers."}, {"url": "http://www.urbandictionary.com/define.php?term=saltpeter", "passage_text": "saltpeter. Potassium nitrate (KNO3), a substance used in explosives (usually gunpowder) and fertilizers. Contrary to popular urban legend, saltpeter has no effect on libido, and too many side effects (high fever, etc.) to be used even if it did. The army doesn't want to kill our soldiers with saltpeter."}, {"url": "http://chemistry.about.com/od/moleculecompoundfacts/f/Saltpeter-Or-Potassium-Nitrate.htm", "passage_text": "Saltpeter is a common chemical, used for many products and science projects. Here's a look at what exactly saltpeter is. Answer: Saltpeter is the natural mineral source of the chemical potassium nitrate, KNO 3. Depending where you live, it may be spelled 'saltpetre' rather than 'saltpeter'."}, {"url": "http://www.wisegeek.org/what-is-salt-peter.htm", "passage_text": "Sodium nitrate, also called salt peter, shares many applications with potassium nitrate. Both can be used to manufacture nitric acid, to propel model rockets, and to increase the shelf life of meats and other foods. Sodium nitrate is also used to manufacture glass and enamel."}, {"url": "http://www.duffelblog.com/2013/02/military-to-stop-adding-saltpeter-to-chow/", "passage_text": "The switch to saltpeter-free food is scheduled for March 1. Saltpeter, or potassium nitrate, is an ionic salt added to rocket propellants, fireworks, and fertilizer. In the military, it has been used for centuries as a food additive that suppresses libido."}, {"url": "http://www.wisegeek.org/what-is-salt-peter.htm", "passage_text": "Salt peter is also used as a fertilizer and as a stump remover, as it accelerates the decomposition process of tree stumps. Salt peter can be found in many everyday products as well. It is used to preserve some foods, most commonly meats, although there are concerns about its health effects."}]