[{"url": "http://cars.costhelper.com/timing-belt.html", "passage_text": "1 Having a mechanic or repair shop replace the timing belt (and possibly the serpentine belt and accessory belt at the same time) can cost $150-$1,000 or more, depending on the make, model and type of vehicle. 1 For a passenger car, CostHelper readers report costs of $300-$1,570 for a timing belt package, with an average of $750. 2  For an SUV, minivan or pickup, readers report paying $610-$1,565, with an average cost of $1,048."}, {"url": "http://cars.costhelper.com/timing-belt.html", "passage_text": "1 For a passenger car, CostHelper readers report paying $179-$942 to replace the timing belt, at an average cost of $449. 2  For an SUV or minivan, CostHelper readers report paying $502-$950, with an average of $736. 1 For a passenger car, CostHelper readers report costs of $300-$1,570 for a timing belt package, with an average of $750. 2  For an SUV, minivan or pickup, readers report paying $610-$1,565, with an average cost of $1,048."}, {"url": "http://repairpal.com/estimator/timing-belt-replacement-cost", "passage_text": "Parts: $53 - $94. The average cost for a timing belt replacement is between $340 to $457. Labor costs are estimated between $287 to $363 while parts are priced between $53 to $94. Get a personalized estimate based on your location and specific car. It is crucial that the timing belt be replaced at or before the interval recommended by the vehicle manufacturer. Failure to do so can result in a broken timing belt, which can leave you stranded, and in some cases, it can cause severe damage to the engine."}, {"url": "http://cars.costhelper.com/timing-chain.html", "passage_text": "1 Hiring a mechanic to replace a timing chain typically costs $300-$1,000, depending on the make and model of the vehicle, its age and whether the work is performed at a dealership or an independent shop. 2  Purchased separately, a timing chain typically costs $50-$250 or more. Ran great minimal maintenance done on it however. Timing chain broke so engine had to be replaced. Replaced engine. Bought used engine from a parts house. Cost 2,200.00 for engine, $754.00 for misc. parts and for replacing, and 450.00 to rental of a car for 2 weeks."}, {"url": "http://www.ehow.com/about_5548808_average-price-replace-timing-belt.html", "passage_text": "When it comes to auto repair, costs vary according to the car part. When it comes to the timing belt, dealers and mechanics recommend replacement every 50,000 to 60,000 miles for most cars, while manufacturers advise replacement every 80,000 to 100,000 miles. Labor. When it comes to timing belt replacement (and any other form of auto repair), the labor drives the price of the repair. Replacing a timing belt can take as little as two hours and as much as six hours, depending on the skill of the mechanic, the make of the vehicle and any additional existing problems."}, {"url": "http://www.ehow.com/about_5548808_average-price-replace-timing-belt.html", "passage_text": "Average Cost. According to costhelper.com, the cost of timing belt replacement varies between $250 and $750, depending the make and model of the car as well as the price of the labor. To offset any sticker shock, it's best to discuss cost in any initial consultations with your mechanic. Labor. When it comes to timing belt replacement (and any other form of auto repair), the labor drives the price of the repair. Replacing a timing belt can take as little as two hours and as much as six hours, depending on the skill of the mechanic, the make of the vehicle and any additional existing problems."}, {"url": "http://www.howmuchisit.org/timing-belt-replacement-cost/", "passage_text": "The timing belt is a part of an automobile that needs to be checked on a regular basis. If any problems arise during this inspection, a mechanic will probably recommend a timing belt replacement. On average, a timing belt will have to be replaced every 60,000 to 100,000 miles depending on the make and model of the car. "}, {"url": "http://cars.costhelper.com/timing-belt.html", "passage_text": "1 Parts typically cost $25-$80 or more for just the timing belt, depending on vehicle make and model; or $100-$800 or more for a kit that also includes other recommended replacement parts like seals, the tensioner or a water pump. 2  CostHelper readers report. 1 For a passenger car, CostHelper readers report costs of $300-$1,570 for a timing belt package, with an average of $750. 2  For an SUV, minivan or pickup, readers report paying $610-$1,565, with an average cost of $1,048."}]