[{"url": "http://www.ehow.com/facts_5759165_mostaccioli-pasta-shapes_.html", "passage_text": "Mostaccioli is a type of small, tube-shaped pasta with angled edges resembling the shape of a quill point. Unlike its cousin penne rigate, it has smooth, rather than ridged, surfaces. Identification. Mostaccioli, Italian for moustaches, are so named for their shape and size. They are small, tube-shaped pieces of pasta, usually a little under 2 inches long."}, {"url": "https://answers.yahoo.com/question/index?qid=20080125101257AAO9ZvQ", "passage_text": "Mostaccioli is a tube shaped pasta, with ridges, about 2 long. Penne is smaller, about 1/2 and is smooth unless using penne rigata. Pasta shapes get substituted occasionally and penne may be considered more bite sized by some. It will work in most mostaccioli recipes, but would be difficult to stuff with a filling. Mostaccioli is popular in the Campagnia region of Southern Italy and is usually a little large than penne. Both penne and mostaccioli can be smooth (lisce) or ridged (rigate)."}, {"url": "https://answers.yahoo.com/question/index?qid=20080125101257AAO9ZvQ", "passage_text": "They are actually both very similar shapes of pasta. Mostaccioli is popular in the Campagnia region of Southern Italy and is usually a little large than penne. Both penne and mostaccioli can be smooth (lisce) or ridged (rigate)."}, {"url": "http://recipes.wikia.com/wiki/Mostaccioli", "passage_text": "Mostaccioli (meaning little mustache in Italian) is the same or similar shape as penne lisce, but it is smooth, not ridged, in texture. If not available, substitute penne or ziti. "}, {"url": "http://www.tasteofhome.com/recipes/baked-mostaccioli", "passage_text": "1 Preheat oven to 350 2  °. Cook mostaccioli according to package directions; drain and set aside. 3  Meanwhile, in a large saucepan, cook beef and onion over medium heat until meat is no longer pink. 4  Add garlic; cook 1 minute. Directions. 1 "}, {"url": "http://new.isitsauceorgravy.com/?p=144", "passage_text": "Very little. Both mostaccioli and penne are tubular pastas with ends that are cut at an angle. The difference between the two is the surface of each. Mostaccioli (or little mustaches) have a smooth surface. The name mostaccioli is found only in the U.S.; the same pasta in Italy is called penne lisce. There is, however, a ridged mostaccioli called mostaccioli rigati, which is just…penne. Yes, they are the same. The name penne (or pens, because of its quill shape) is more universally known. The ridges of penne allow the pasta to cling to sauc"}, {"url": "http://www.tasteofhome.com/recipes/mostaccioli", "passage_text": "1 Cook over medium heat until no longer pink; drain. 2  Stir in spaghetti sauce and pasta. 3  In a large bowl, combine the egg, ricotta cheese and mozzarella cheese. 4  Spoon half of the pasta mixture into a greased shallow 3-qt. baking dish; layer with cheese mixture and remaining pasta mixture. 1 Stir in spaghetti sauce and pasta. 2  In a large bowl, combine the egg, ricotta cheese and mozzarella cheese. 3  Spoon half of the pasta mixture into a greased shallow 3-qt. baking dish; layer with cheese mixture and remaining pasta mixture. 4  Cover and bake at 375° for 40 minutes or until a meat thermometer reads 160°."}, {"url": "http://www.tasteofhome.com/recipes/baked-mostaccioli", "passage_text": "1 Cook mostaccioli according to package directions; drain and set aside. 2  Meanwhile, in a large saucepan, cook beef and onion over medium heat until meat is no longer pink. 3  Add garlic; cook 1 minute. 4  Drain. 5  Stir in tomatoes, tomato sauce and paste, mushrooms, water, salt, sugar, basil, pepper and bay leaf. Directions. 1  Preheat oven to 350 2  °. Cook mostaccioli according to package directions; drain and set aside. 3  Meanwhile, in a large saucepan, cook beef and onion over medium heat until meat is no longer pink. 4"}, {"url": "https://en.wikipedia.org/wiki/Penne", "passage_text": "[ˈpenːe]) is a type of pasta with cylinder-shaped pieces. Penne is the plural form of the Italian penna, deriving from Latin penna (meaning  feather  or  quill ), and is a cognate of the English word pen. In Italy, penne are produced in two main variants:  penne lisce  (smooth) and  penne rigate  (furrowed), the latter having ridges on each penna. There is also pennoni (big quills), which is a wider version of penne."}, {"url": "https://answers.yahoo.com/question/index?qid=20080125101257AAO9ZvQ", "passage_text": "RE: What is the difference between Penne and Mostaccioli? Is mostaccioli a type of noodle or is penne the type of noodle used to make the dish mostaccioli? If they are two different type of noodles, what is the difference? Mostaccioli is popular in the Campagnia region of Southern Italy and is usually a little large than penne. Both penne and mostaccioli can be smooth (lisce) or ridged (rigate)."}]