[{"url": "https://congestioncharging.tfl.gov.uk/b/pb/provideVRM.faces", "passage_text": "Pay the Congestion Charge. PLEASE NOTE-The Congestion Charge is applicable to central London only and does not include the Dartford Crossing Dart Charge."}, {"url": "https://en.wikipedia.org/wiki/London_congestion_charge", "passage_text": "Following the introduction of the Western Extension, TfL stated that traffic had fallen around 10 to 15% in the extended zone. The original zone is showing a 4% increase in congestion following expansion of the congestion charge and the introduction of extended to discounts to residents of the new zone and buffer zone. TfL assessed the increase in charges in 2005 to have had only a slight impact overall."}, {"url": "https://tfl.gov.uk/modes/driving/congestion-charge/paying-the-congestion-charge", "passage_text": "You can pay the Congestion Charge in a number of ways. It's quickest and easiest if you register for CC Auto Pay. Congestion Charge Auto Pay is an automated payment system. We'll automatically record the number of charging days a vehicle travels within the charging zone each month and bill your debit or credit card each month. This automated payment system will"}, {"url": "http://tfl.gov.uk/roadusers/congestioncharging/6743.aspx", "passage_text": "Congestion Charge. The Congestion Charge is an £11.50 daily charge for driving a vehicle within the charging zone between 07:00 and 18:00, Monday to Friday. The easiest way to pay the charge is by registering for Congestion Charge Auto Pay. There are a range of exemptions and discounts available to certain vehicles and individuals."}, {"url": "https://en.wikipedia.org/wiki/London_congestion_charge", "passage_text": "The London congestion charge is a fee charged on most motor vehicles operating within the Congestion Charge Zone (CCZ) in Central London between 07:00 and 18:00 Mondays to Fridays. It is not charged on weekends, public holidays or between Christmas Day and New Year's Day (inclusive). The original zone is showing a 4% increase in congestion following expansion of the congestion charge and the introduction of extended to discounts to residents of the new zone and buffer zone. TfL assessed the increase in charges in 2005 to have had only a slight impact overall."}, {"url": "https://tfl.gov.uk/modes/driving/congestion-charge/paying-the-congestion-charge", "passage_text": "The charge is £11.50 if you pay in advance or on the same day, or £14 if paid the following charging day. Outside of call centre hours, payments for travel on the day can be made online (up to midnight) at a charge of £11.50. This automated payment system will record the number of charging days a vehicle travels within the charging zone each month and bill your debit or credit card each month."}, {"url": "http://www.theaa.com/motoring_advice/congestion_charging/", "passage_text": "If you don't pay the Congestion Charge within the time limit (before midnight the following charging day) you will receive a penalty charge notice of £130, reduced to £65 if paid within 14 days. Latest. From 16 June 2014, the daily Congestion Charge will go up from £10 to £11.50 (or £10.50 if paid using CC Auto Pay or £14 if paid the next charging day). A network of cameras reads vehicle numberplates as you enter, drive around and leave the zone."}, {"url": "https://tfl.gov.uk/modes/driving/congestion-charge/paying-the-congestion-charge", "passage_text": "Congestion Charge Auto Pay (CCAP). This automated payment system will record the number of charging days a vehicle travels within the charging zone each month and bill your debit or credit card each month."}, {"url": "https://en.wikipedia.org/wiki/London_congestion_charge", "passage_text": "Once other charges were deducted, the congestion charge brought in an annual operating net income of £89.1m for TfL. This income compares with TfL's total revenue from bus and tube fares of £2,269.4m, or 76.6% of revenue before costs, or grants from central government of £2,390.3 million. The original zone is showing a 4% increase in congestion following expansion of the congestion charge and the introduction of extended to discounts to residents of the new zone and buffer zone. TfL assessed the increase in charges in 2005 to have had only a slight impact overall."}]