[{"url": "http://www.answers.com/Q/Why_is_it_that_English_is_considered_as_the_global_language", "passage_text": "Confidence votes 79.8K. English is considered the global language because most people speak it as their first or second language. This means that if you go to any place on the planet, with few exceptions, you can communicate with the people there using English. This can be shown by the fact that many people are learning English as a second language. There are more native Chinese spea … kers than any other language in the world. But the number of English speakers in the world is even greater because so many people learn"}, {"url": "http://www.omniglot.com/language/articles/engunilang.php", "passage_text": "English is without a doubt the actual universal language. It is the world's second largest native language, the official language in 70 countries, and English-speaking countries are responsible for about 40% of world's total GNP. "}, {"url": "http://iml.jou.ufl.edu/projects/students/Wheaton/page1.htm", "passage_text": "ENGLISH AS THE GLOBAL LANGUAGE. A s global communication expands throughout the world, so does the need for a global language. A language that is recognized and understood by people everywhere. In many parts of the world that language has been established, English. "}, {"url": "http://www.answers.com/Q/Why_did_English_considered_as_global_language", "passage_text": "English is considered the global language because most people speak it as their first or second language. This means that if you go to any place on the planet, with few exce … ptions, you can communicate with the people there using English. This can be shown by the fact that many people are learning English as a second language. There are more native Chinese spea … kers than any other language in the world. But the number of English speakers in the world is even greater because so many people learn"}, {"url": "https://en.wikipedia.org/wiki/International_English", "passage_text": "International English is the concept of the English language as a global means of communication in numerous dialects, and also the movement towards an international standard for the language. It is also referred to as Global English, World English, Common English, Continental English, General English, Engas (English as associate language), or Globish. Sometimes, these terms refer simply to the array of varieties of English spoken throughout the world."}, {"url": "https://en.wikipedia.org/wiki/World_language", "passage_text": "A world language is a language spoken internationally and that is learned by many people as a second language. By these criteria, the major world languages are of Western European origin. The historical reason for this is the period of European exploration and colonialism. The world's most widely used language is English, which has over 1.38 billion users worldwide."}, {"url": "http://catdir.loc.gov/catdir/samples/cam041/2003282119.pdf", "passage_text": "ENGLISH AS A GLOBAL LANGUAGE as a mother tongue – in the case of English,this would mean theUSA,Canada,Britain,Ireland,Australia,New Zealand,SouthAfrica,several Caribbean countries and a sprinkling of other terri-tories. 21. ENGLISH AS A GLOBAL LANGUAGE need for mutual intelligibility,which is part of the argumentin favour of a global language,is only one side of the story.The other side is the need for identity – and people tend tounderestimate the role of identity when they express anxietiesabout language injury and death."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20061017055207AAilNID", "passage_text": "Report Abuse. English is considered as a global language as it is the most popular language and is widely used in all parts of the word. Most of the information is provided in English and enen in writting it is widely used. It is the most common language known by people. Believer · 9 years ago. Report Abuse. english originated in england..it is an international and a global language today. this is because most of the countries have at one point of time been the colonies of british empire like china, india, most of africa."}, {"url": "http://www.answers.com/Q/Why_did_English_considered_as_global_language", "passage_text": "Making the world better, one answer at a time. English is already arguably a global language. It is spoken by almost 2 billion people worldwide. Also it is the only language where there are 3 times more people who speak it as a second language that those who have English as their native language. This can be shown by the fact that many people are learning English as a second language. There are more native Chinese spea … kers than any other language in the world. But the number of English speakers in the world is even greater because so many people learn"}]