[{"url": "http://instructional1.calstatela.edu/lkamhis/tesl565_sp04/troy/spchact.htm", "passage_text": "Speech act theory attempts to explain how speakers use language to accomplish intended actions and how hearers infer intended meaning form what is said. Although speech act studies are now considered a sub-discipline of cross-cultural pragmatics, they actually take their origin in the philosophy of language. "}, {"url": "http://www.csus.edu/indiv/n/nogalesp/phil176spg06/austinsearle/searlewhatisaspeechactsummary.doc", "passage_text": "For Searle the basic unit of language is the speech act or. illocutionary act. , the production of a token in the context of a speech act (not the word, the sentence type, or the theory). Argues for the main thesis that to perform an illocutionary act is to primarily to do (rather than to say) and to engage in rule-governed behavior. (378). Responds to Austin’s call for a general theory of speech acts, producing a theory of speech acts in which speech acts are analyzed in terms of schemas."}, {"url": "http://carla.umn.edu/speechacts/definition.html", "passage_text": "Speech acts are difficult to perform in a second language because learners may not know the idiomatic expressions or cultural norms in the second language or they may transfer their first language rules and conventions into the second language, assuming that such rules are universal. Speech acts include real-life interactions and require not only knowledge of the language but also appropriate use of that language within a given culture. Here are some examples of speech acts we use or hear every day: Greeting: Hi, Eric."}, {"url": "http://carla.umn.edu/speechacts/definition.html", "passage_text": "A speech act is an utterance that serves a function in communication. We perform speech acts when we offer an apology, greeting, request, complaint, invitation, compliment, or refusal. Speech acts include real-life interactions and require not only knowledge of the language but also appropriate use of that language within a given culture. Here are some examples of speech acts we use or hear every day: Greeting: Hi, Eric."}, {"url": "http://www-01.sil.org/linguistics/GlossaryOfLinguisticTerms/WhatIsASpeechAct.htm", "passage_text": "Definition. A speech act is an act that a speaker performs when making an utterance, including the following: A general act (illocutionary act) that a speaker performs, analyzable as including. 1  the uttering of words (utterance acts). 2  making reference and predicating (propositional acts), and. 3  a particular intention in making the utterance (illocutionary force)"}, {"url": "http://online.sfsu.edu/kbach/spchacts.html", "passage_text": "In general, speech acts are acts of communication. To communicate is to express a certain attitude, and the type of speech act being performed corresponds to the type of attitude being expressed. For example, a statement expresses a belief, a request expresses a desire, and an apology expresses a regret. As an act of communication, a speech act succeeds if the audience identifies, in accordance with the speaker's intention, the attitude being expressed. Some speech acts, however, are not primarily acts of communication and have the function not of communicating but of affecting institutional states of affairs."}, {"url": "http://www.uniroma2.it/didattica/ling_ing1_linfo/deposito/SPEECH_ACTS.doc", "passage_text": "In general, speech acts are acts of communication. To communicate is to express a certain attitude, and the type of speech act being performed corresponds to the type of attitude being expressed. For example, a statement expresses a belief, a request expresses a desire, and an apology expresses a regret."}]