[{"url": "https://crystal-cure.com/gem-healing.html", "passage_text": "Research and understand each stone before using it. Click on the photos of the gemstones below to read more about that gemstone. Spiritual and emotional healing should also be done with a written record. You may have to experiment with many gemstones to find the correct stone for your purpose. Read this article to find out more about how healing gemstones work. In any type of healing, set stones are better set in silver."}, {"url": "https://crystal-cure.com/gem-healing.html", "passage_text": "Precious and semi-precious gemstones have been used since recorded history and probably before, for spiritual, emotional and physical healing. Alternative healers all over the world use gemstones today."}, {"url": "http://www.healing-crystals-for-you.com/healing-stone-meanings.html", "passage_text": "The healing stone meanings have been gathered throughout the centuries, in many cases since ancient times. While we do not know for certain exactly when their meanings were discovered, we do know that healing stones have been in use for a long time."}, {"url": "https://www.energymuse.com/about-gemstones", "passage_text": "Agate is one of the oldest of healing stones. As a stone of strength, it was used in ancient civilizations, on the breastplates of armor, to bring warriors strength and make them victorious in battle. Agates are very protective stones, making them the perfect stones for amulets and medicine bags."}, {"url": "https://www.energymuse.com/about-gemstones", "passage_text": "Bloodstone is a powerful healing stone that has been valued for thousands of years for its healing energy. It purifies and detoxifies the body, grounding negative energy and cleansing your body’s energy."}, {"url": "http://soularenergy.com/gemstones.htm", "passage_text": "About Healing Stones. Healing stones, crystals and semi-precious gemstones come from one unified source-Mother Earth. Created from the magma or Earth's inner core, healing stones have gone through a geologic process of heating, cooling and displacement on their way to their present form."}, {"url": "http://stone-healing.com/", "passage_text": "We have comprehensive programs on Stone Facial, Stone Massage Therapy, Spanish Stone Massage, Zone Foot Therapy, Dog Stone Massage as well a range of massage stone sets including chakra stone sets, attunement wands, facial stone sets and Healing Pet Stones."}, {"url": "http://stone-healing.com/", "passage_text": "Welcome to Stone-Healing.com! Thank you for visiting Stone-Healing.com, your one stop for premier online stone massage e-courses and certification. On our website, you will find a wide range of programs designed to help you grow and change as a massage professional."}]