[{"url": "http://www.ehow.com/how_8231766_convert-knots-mph.html", "passage_text": "A knot is a unit of velocity typically used for boats and aircraft. Miles per hour, on the other hand, measures the speed of cars in the United States. One knot equals a speed of 1 nautical mile per hour, or 6,076 feet per hour. One mile per hour equals 5,280"}, {"url": "http://www.answers.com/Q/One_knot_is_how_many_miles_per_hour", "passage_text": "A knot, or nautical mile (6076 feet), is about 15% longer than a statute mile (5280). So, if you're traveling at a speed of 20 knots in a motor boat, you simply multiply 20 X … 1.15 to get 23 mph. To go from mph to knots, multiply mph by about .87 to get knots."}, {"url": "http://www.answers.com/Q/How_many_miles_is_a_knot", "passage_text": "A knot, or nautical mile (6076 feet), is about 15% longer than a statute mile (5280). So, if you're traveling at a speed of 20 knots in a motor boat, you simply multiply 20 X … 1.15 to get 23 mph. To go from mph to knots, multiply mph by about .87 to get knots."}, {"url": "http://www.answers.com/Q/One_knot_is_how_many_miles_per_hour", "passage_text": "Confidence votes 8.2K. Slightly greater than 1.15mph A knot, or nautical mile (6076 feet), is about 15% longer than a statute mile (5280). So, if you're traveling at a speed of 20 knots in a motor boat, you simply multiply 20 X 1.15 to get 23 mph. To go from mph to knots, multiply mph by about .87 to get knots."}, {"url": "http://www.wikihow.com/Convert-Knots-to-Miles-Per-Hour", "passage_text": "Figure out how many knots you are traveling, or plan on traveling. The equation to convert knots to miles per hour is: 1 Knot = 1.15077945 mph (1.85200000 km/h). Take your number of knots and multiply it by 1.15. This will give you how fast you are moving in miles per hour."}, {"url": "http://www.grc.nasa.gov/WWW/K-12/WindTunnel/Activities/knots_vs_mph.html", "passage_text": "Knots is how the speed of aircraft and boats is measured. Both miles per hour and knots is a speed which is the number of units of distance that is covered for a certain amount of time. 1 knot = 1 nautical mile per hour = 6076 feet per hour. 1 mph =1 mile per hour = 5280"}, {"url": "http://www.onlineconversion.com/faq_07.htm", "passage_text": "A knot, therefore, is not a nautical mile, it is a nautical mile per hour. Thus 1 knot was equivalent to 1 nautical mile per hour; 5 knots were equivalent to 5 nautical miles per hour; etc. The similar sound of knot and naut is entirely coincidental."}]