[{"url": "http://www.livingthepresence.org/pdf/acid_alkaline_fds.pdf", "passage_text": "Acid-Alkaline Forming Foods page 2 Acid/Alkaline (pH) are the two characteristic conditions of blood and cell solution. Any solution is either more acid or more alkaline. If acidic characteris-tics dominate, the solution is acid. However, there is no absolute acid or alkaline. "}, {"url": "http://pickyourown.org/food_acidity.htm", "passage_text": "Acid foods are foods that contain enough acid to have a pH of 4.6 or lower. Acidic foods can be processed safely in a boiling water canner, usually without added acid (lemon juice, vinegar or citric acid). Foods can be acid because they are: 1  naturally acid foods. 2  foods that have acid, such as vinegar or lemon juice, added. 3  fermented foods, such as sauerkraut."}, {"url": "http://www.ehow.com/info_8047738_fruits-non-acidic.html", "passage_text": "Other Fruits. Bananas, sour cherries, apricots and peaches are alkaline fruits. These fruits help to remove hydrogen ions from your body, making the foods alkalizing. Tomatoes, avocados, currants and pears are also nonacidic fruits. Many vegetables are alkalizing. Red cabbage, spinach, cayenne pepper, zucchini and fresh cucumbers are nonacidic foods that can help to balance low pH levels. Lemons taste acidic, but the fruit yields an alkalizing effect after being digested. As your body assimilates the citrus fruit, the end product carries an alkaline pH level. Limes, oranges and grapefruit are other nonacidic citrus fruits which are high on the pH scale"}, {"url": "http://www.rense.com/1.mpicons/acidalka.htm", "passage_text": "The pH scale is from 0 to 14, with numbers below 7 acidic (low on oxygen) and numbers above 7 alkaline. An acidic body is a sickness magnet. What you eat and drink will impact where your body's pH level falls. Balance is Key !!! "}, {"url": "https://answers.yahoo.com/question/index?qid=20080506050518AAjT9rk", "passage_text": "Best Answer: He was meaning oranges or Lemons, both which are acidic, Pears are not considered as such. Grapefruit is considered acidic. Sounds like you are on Verapamil for high blood pressure. Pears are not acidic. Most acidic fruits ARE the citrus family. Anything like grapefruit, oranges, limes, lemons, things of that nature should be avoided."}, {"url": "http://pickyourown.org/food_acidity.htm", "passage_text": "Most mixtures of low-acid and acid foods also have pH values above 4.6 unless their recipes include enough lemon juice, citric acid, or. vinegar to make them acid foods. Acid foods have a pH of 4.6 or lower. They include fruits, pickles, sauerkraut, jams, jellies, marmalades, and fruit butters. Although tomatoes usually are considered an acid food, some are now known to have pH values slightly above 4.6. Figs also have pH values slightly above 4.6. Foods can be acid because they are: 1  naturally acid foods. 2  foods that have acid, such as vinegar or lemon juice, added. 3  fermented foods, such as sauerkraut."}, {"url": "http://greenopedia.com/alkaline-acid-food-chart/", "passage_text": "How the body reacts to certain foods is what determines what foods are alkaline-forming and what foods are acid-forming. For example lemons are acidic in nature, but have an alkalizing effect on the body once they are digested. Similarly, milk is alkaline outside the body, but acidic upon digestion. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070224095826AAZIFE5", "passage_text": "--------------------------------------... 2. VEGETABLES After fruit the most important of all foods. Along with fruits, vegetables are the only right nutrition for the human body. Vegetables contain amino acids and antioxidants in forms that do not occur in other foods. You can eat unlimited amounts. Some people may have problems with these fruits because of their acid content. The acid though is a healthy and organic nutritional element (for instance: ascorbic acid is vitamin c, found especially in citrus fruits and vegetables)."}, {"url": "http://goaskalice.columbia.edu/answered-questions/which-foods-are-acidic", "passage_text": "Gastric juice — the digestive liquids in your stomach — has a pH of 2.0, which is very, very acidic. The pH of hydrochloric acid is between 0.1 and 1.0 — probably the most acidic substance known to people. Eating acidic foods can't cause the stomach to become more acidic. "}]