[{"url": "http://www.nationsencyclopedia.com/economies/Europe/Czech-Republic.html", "passage_text": "LOCATION AND SIZE. The Czech Republic is located in Central Europe. It is surrounded by Germany to the northwest, Poland to the northeast, Slovakia to the southeast, and Austria to the south. The total area is 78,866 square kilometers (49,007 square miles). The terrain is generally composed of rolling hills and some mountainous areas."}, {"url": "http://www.answers.com/Q/Where_is_the_Czech_republic_located", "passage_text": "The Czech Republic is located in Europe bordering Germany and Poland to the North, and Austria and Slovakia to the South."}, {"url": "http://www.my-prague-sights.com/where-is-prague.html", "passage_text": "Prague is the capital and largest city of Czech Republic. It's located in Bohemia which is the western half of the country."}, {"url": "http://www.whereisprague.net/", "passage_text": "Where is Prague located? Sitting across Czech Republic’s largest river, River Vltava, Prague is in the middle left part of Czech Republic. It is the capital city of the said country. Before the 1989 Revolution, it was Czechoslovakia’s capital city."}, {"url": "http://www.czech.cz/en/67007-the-czech-republic-on-a-world-map", "passage_text": "The Czech Republic is located in the Northern Hemisphere, approximately in the middle of the European Continent. Its neighboring states are Germany (to the west), Poland (to the north), Slovakia (to the east, which together with the Czech Republic constituted Czechoslovakia until 1992) and Austria (to the south)."}, {"url": "http://www.whereig.com/czech-republic/", "passage_text": "Share |. Czech Republic is a landlocked country in Central Europe. The country is bordered by Germany to the west, Poland to the north, Slovakia to the eastand Austria to the southern part. Czech Republic is divided into thirteen regions and Prague is the Capital City of the Country."}, {"url": "http://www.gomapper.com/travel/where-is/czech-republic-located.html", "passage_text": "Czech Republic is a country with a medium population which is located in the continent/region of Europe. Countries near Czech Republic include Austria, Slovakia, Poland and Germany."}]