[{"url": "http://www.cancer.org/treatment/survivorshipduringandaftertreatment/nutritionforpeoplewithcancer/nutritionforthepersonwithcancer/nutrition-during-treatment-taste-smell-changes", "passage_text": "1 Rinse your mouth with a baking soda, salt, and water mouthwash before eating to help foods taste better. ( 2 Mix 1 teaspoon salt and 1 teaspoon baking soda in 1 quart water. 3  Shake well before swishing and spitting.). 4  Keep your mouth clean and brush your teeth to help ease bad tastes. Cancer and its treatments can change your senses of taste and smell. These changes can affect your appetite and are often described as a bitter or metallic taste. If you’re having these problems, try foods, marinades, spices, drinks, and ways of preparing foods that are different from those you usually use."}, {"url": "http://www.justanswer.com/dental/7chuv-probiotics-cause-change-taste-mouth.html", "passage_text": "I will do my best to answer your question. Probiotics help balance the bacterial flora in the mouth and because it does this the answer is yes, it can change the taste in your mouth to a degree. Most report this as a good thing as bad bacteria, acids, fungus and even blood residues have a sour or metallic kind of taste. A good way to get the benefits of probiotics is to eat yogurt. You won't notice the change as much if it seems unpleasant at first to you. Whichever way, you should give it some time to normalize while your mouth flora is re-adjusting. Let me know if this helps or you have any other questions."}, {"url": "http://www.livestrong.com/article/395019-metallic-taste-in-mouth-after-eating/", "passage_text": "A metallic taste in your mouth after eating is a sign of a food allergy. Although most food allergies cause mild to moderate reactions, a metallic taste in your mouth might be a sign of a severe allergic reaction. Stop eating foods that cause this reaction to occur and make an appointment with an allergist to discuss tests and treatment options."}, {"url": "http://www.cancer.org/treatment/survivorshipduringandaftertreatment/nutritionforpeoplewithcancer/nutritionforthepersonwithcancer/nutrition-during-treatment-taste-smell-changes", "passage_text": "1 Counter a salty taste with added sweeteners, sweet taste with added lemon juice and salt, and bitter taste with added sweeteners. 2  Rinse your mouth with a baking soda, salt, and water mouthwash before eating to help foods taste better. Cancer and its treatments can change your senses of taste and smell. These changes can affect your appetite and are often described as a bitter or metallic taste. If you’re having these problems, try foods, marinades, spices, drinks, and ways of preparing foods that are different from those you usually use."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-829-YOGURT.aspx?activeIngredientId=829&activeIngredientName=YOGURT", "passage_text": "YOGURT Overview Information. Yogurt is a dairy product made by fermenting milk using one or more of a variety of particular bacteria such as Lactobacillus acidophilus, Lactobacillus rhamnosus, Lactobacillus bulgaricus, Enterococcus faecium, Streptococcus thermophilus, and others. "}, {"url": "http://lifestyle.iloveindia.com/lounge/metallic-taste-in-mouth-676.html", "passage_text": "Metallic Taste in Mouth. Metallic Taste in Mouth, scientifically known as ‘Dysgeusia’, is a condition in which the taste of your mouth changes to something very sour and foul. You might feel as if you have something metallic inside your mouth, even when you are not eating anything. The one and only symptom of metallic taste is the continuous presence of a bitter and acidic taste in the mouth. 1 You can also try rinsing your mouth with a solution made of a teaspoon of salt and eight ounces of water. 2  Another option is to make a solution of 1/4 teaspoon baking soda and eight ounces of water and rinse your mouth with it. 3  Eat raw condiments like cloves and cinnamon in very small portions"}, {"url": "http://www.telegraph.co.uk/lifestyle/wellbeing/lifecoach/9223843/Life-coach-What-is-causing-the-bitter-taste-in-my-mouth.html", "passage_text": "Our health experts answer your questions. “Pine nut syndrome” can cause a bitter taste in the mouth. By Sara Stanner, Dan Rutherford. 3:29PM BST 24 Apr 2012. Recently I have noticed a continual bitter taste in my mouth, which interferes with my enjoyment of food, particularly as it gets worse when I eat and drink. A SARA STANNER WRITES: A bad taste in the mouth can be caused by a variety of conditions including dental or gum problems, dehydration, medication (such as some antibiotics and antihypertensives), a yeast infection in the mouth, an autoimmune condition or a respiratory tract infection."}, {"url": "http://lifestyle.iloveindia.com/lounge/metallic-taste-in-mouth-676.html", "passage_text": "1 It will help in lessening the metallic taste. 2  You can also try rinsing your mouth with a solution made of a teaspoon of salt and eight ounces of water. 3  Another option is to make a solution of 1/4 teaspoon baking soda and eight ounces of water and rinse your mouth with it. 1 You can also try rinsing your mouth with a solution made of a teaspoon of salt and eight ounces of water. 2  Another option is to make a solution of 1/4 teaspoon baking soda and eight ounces of water and rinse your mouth with it. 3  Eat raw condiments like cloves and cinnamon in very small portions"}, {"url": "https://www.healthtap.com/topics/do-iron-supplements-cause-metallic-taste-in-mouth", "passage_text": "3. Get help from a doctor now ›. They can: Iron supplements can cause a metallic taste in your mouth. There are also many other causes. Vitamin deficiencies, periodontal disease, medications, hormonal changes, diabetes and other metabolic diseases can also cause this. ...Read more. "}]