[{"url": "http://www.andymohr-chevrolet.com/2015-chevy-tahoe-cargo-space/", "passage_text": "1 With second and third-row seats folded down the 2015 Chevrolet Tahoe provides a maximum 94.7 cu. 2  ft of cargo space. 3  Maximize your available storage space by folding both rows of seats down and using non-traditional cargo areas. 4  Consider using storage areas under the seats, in wheel wells, and doors. 2015 Chevy Tahoe Cargo Space. September 2nd, 2014 by Jason Gilliam. Share this Post: Facebook Twitter Google Plus. Whether it be moving to a new home, going on a road trip, or helping somebody else get ready to, the available cargo space inside a vehicle’s trunk and other places is often suddenly very important."}, {"url": "http://www.answers.com/Q/What_is_the_maximum_cargo_capacity_of_the_2015_Chevrolet_Tahoe", "passage_text": "The maximum cargo capacity of the 2015 Chevrolet Tahoe is 94.7 cu.ft.. The maximum tosing capacity of the 2011 Chevrolet Tahoe is 8500 lbs.."}, {"url": "http://www.cars.com/chevrolet/tahoe/2013/expert-reviews", "passage_text": "Editor's note: This review was written in May 2012 about the 2012 Chevrolet Tahoe. Little of substance has changed with this year's model. To see what's new for 2013, click here, or check out a side-by-side comparison of the two model years. The Tahoe's second-row seats tumble forward, unlike the Traverse's, which again fold flat. Maximum cargo volume in this configuration is 108.9 cubic feet in the Tahoe, versus the Traverse's 116.4 cubic feet. Another alternative is the Chevrolet Suburban, which is essentially a stretched Tahoe."}, {"url": "http://usnews.rankingsandreviews.com/cars-trucks/Chevrolet_Tahoe/2009/", "passage_text": "Reviewers were generally pleased with the Tahoe’s maximum cargo capacity of 108.9 cubic feet, but bemoaned that to use all the space, you have to remove the third-row seats. Otherwise, the Tahoe was praised for its well-executed interior. The 2009 Chevrolet Tahoe offers three rows of comfortable seats and a respectable towing capacity, making it a good choice for anyone looking for a 2009 large SUV. The 2009 Chevrolet Tahoe is ranked:"}, {"url": "http://www.answers.com/Q/What_is_the_maximum_cargo_capacity_of_the_2012_Chevrolet_Tahoe", "passage_text": "The maximum cargo capacity of the 2012 Chevrolet Tahoe is 108.9 cu.ft.. The maximum tosing capacity of the 2013 Chevrolet Tahoe is 8500 lbs.."}, {"url": "http://usnews.rankingsandreviews.com/cars-trucks/Chevrolet_Tahoe/Interior/", "passage_text": "Seating. The 2015 Chevrolet Tahoe has seating for eight, cloth upholstery, fold-flat second-and third-row seats and power-adjustable front seats. A front bench seat is available, which boosts seating capacity to nine. Leather seats, heated and cooled front seats and power-folding second-and third-row seats are optional. "}, {"url": "http://www.edmunds.com/chevrolet/tahoe/2015/review/", "passage_text": "The 2015 Chevrolet Tahoe deserves consideration if you're shopping for a large, truck-based SUV with three rows of seating and impressive towing capacity. But for everyday passenger and cargo use, a large crossover SUV might be a better choice. The 2015 Chevrolet Tahoe is a full-size SUV available in three trim levels: LS, LT and LTZ. Seating for eight is standard, but there are two optional seating arrangements. Second-row captain's chairs drop the count to seven, and an available 40/20/40 front bench seat increases it to nine."}, {"url": "http://www.answers.com/Q/What_is_the_maximum_cargo_capacity_of_the_2012_Chevrolet_Tahoe", "passage_text": "The maximum cargo capacity of the 2015 Chevrolet Tahoe is 94.7 cu.ft.. The maximum tosing capacity of the 2013 Chevrolet Tahoe is 8500 lbs.."}, {"url": "http://www.answers.com/Q/What_is_the_maximum_cargo_capacity_of_the_2012_Chevrolet_Tahoe", "passage_text": "The maximum cargo capacity of the 2007 Chevrolet Tahoe is 108.9 cu.ft.. The maximum tosing capacity of the 2013 Chevrolet Tahoe is 8500 lbs.."}, {"url": "http://www.answers.com/Q/What_is_the_maximum_cargo_capacity_of_the_2015_Chevrolet_Tahoe", "passage_text": "The maximum cargo capacity of the 2012 Chevrolet Tahoe is 108.9 cu.ft.. The maximum tosing capacity of the 2011 Chevrolet Tahoe is 8500 lbs.."}]