[{"url": "http://www.universetoday.com/19305/seasons-on-uranus/", "passage_text": "by Fraser Cain on October 8, 2008. Uranus is one of the strangest planets in the Solar System. Something huge smashed into the planet billions of years ago and knocked it over on its side."}, {"url": "http://www.space.com/45-uranus-seventh-planet-in-earths-solar-system-was-first-discovered-planet.html", "passage_text": "The magnetic poles of most planets are typically lined up with the axis along which it rotates, but Uranus' magnetic field is tilted, with its magnetic axis tipped over nearly 60 degrees from the planet's axis of rotation. Uranus is the seventh planet from the sun and the first to be discovered by scientists. Although Uranus is visible to the naked eye, it was long mistaken as a star because of the planet’s dimness and slow orbit."}, {"url": "https://en.wikipedia.org/wiki/Uranus", "passage_text": "Though Uranus is visible to the naked eye like the five classical planets, it was never recognized as a planet by ancient observers because of its dimness and slow orbit. Sir William Herschel announced its discovery on March 13, 1781, expanding the known boundaries of the Solar System for the first time in history. Uranus is the only planet whose name is derived from a figure from Greek mythology, from the Latinized version of the Greek god of the sky, Ouranos. Like the other giant planets, Uranus has a ring system, a magnetosphere, and numerous moons. The Uranian system has a unique configuration among those of the planets because its axis of rotation is tilted sideways, nearly into the plane of its revolution about the Sun"}, {"url": "http://theplanets.org/uranus/", "passage_text": "1 This means that the north and south poles of Uranus lie near where the equator is on Earth. 2  During parts of its orbit one or other of the poles directly face the Sun which means the planet gets around 42 years of direct sunlight followed by 42 years of darkness. Facts about Uranus. 1  William Herschel discovered Uranus in 1781. 2  The planet is too dim to have been seen by ancient civilizations. 3  Herschel himself believed that Uranus was a comet at first, but several years later it was confirmed as a planet – making Uranus the first planet discovered in modern history."}, {"url": "https://stardate.org/astro-guide/ssguide/uranus", "passage_text": "Known Moons. 27 as of January 2006. The poles of most planets aim away from the plane of the solar system; like Earth's poles, they point roughly north and south. But the poles of Uranus point east and west, close to the plane of its orbit around the Sun. As a result, its north pole aims at the Sun at the beginning of northern summer, and away from the Sun at the start of southern summer."}, {"url": "http://www.windows2universe.org/uranus/uranus_polar_regions.html", "passage_text": "The Poles of Uranus. Uranus is the tilted planet. The axis through its North and South Poles is tilted by 98. In other words, Uranus is lying on its side! That's not all-the magnetic field of Uranus is tilted, too. The planet's magnetic field is tilted 59. A compass wouldn't be much help in finding North on Uranus! Uranus has a strange magnetic field. The magnetic poles of Uranus are not at all close to the geographic poles of Uranus. The main magnetic field of Uranus is tilted 59 away from the planet's spin axis."}, {"url": "http://www.universetoday.com/19305/seasons-on-uranus/", "passage_text": "While the other planets look like spinning tops as they make their journey around the Sun, Uranus is flipped on its side, and appears to be rolling around the Sun. And this has a dramatic effect on the seasons on Uranus. Orbit of Uranus. Uranus is one of the strangest planets in the Solar System. Something huge smashed into the planet billions of years ago and knocked it over on its side."}]