[{"url": "http://texas.obituaries.funeral.com/2014/09/23/lauren-nicole-bourne/", "passage_text": "Lauren Nicole Bourne. Heaven has a new angel. Lauren Nicole Bourne was born on December 23rd, 2004 in Brownsville, TX. She passed away on September 20th, 2014 at the age of 9. Lauren was an amazing little girl with a smile that could light up a room. She will be missed by many. "}, {"url": "http://www.biography.com/people/liam-payne-21262019#!", "passage_text": "Childhood and School Years. Liam James Payne was born on August 29, 1993, in Wolverhampton, a town located in England's West Midlands. His father, Geoff, works for the aerospace manufacturing corporation Goodrich; his mother, Karen, has worked as a nurse and a receptionist. Payne has two older sisters, Nicole and Ruth. Payne attended St. Peter's Collegiate School in Wolverhampton. As a pre-teen, he was interested in both music and athletics."}, {"url": "http://www.karennicol.com/", "passage_text": "Karen Nicol is an embroidery and mixed media textile artist working in gallery, fashion and interiors with a London based design and production studio established for over twenty-five years. "}, {"url": "http://radaronline.com/exclusives/2010/12/exclusive-nicole-richies-biological-father-wont-attend-wedding/", "passage_text": "Born Nicole Camille Escovedo on September 21, 1981, the reality star has never publicly acknowledged that Lionel Richie’s former band member is really her father. In fact, Richie denied that Escovedo was her father in a November 2005 issue of Jane magazine. "}, {"url": "http://www.theglamourouslife.com/articles/who-is-nicole-richies-mother.html", "passage_text": "Nicole Richie was born Nicole Camille Escovedo to Peter Escovedo (Sheila E’s brother) and Karen (who was Sheila E’s assistant at the time). There is Mexican in her blood. She prbly identifies as black since she was raised by Lionel and Brenda since she was two, although she wasn’t officially adopted until she was 9. Yes, Nicole’s adoptive mother is a black woman by the name of Brenda Harvey-Richie who was married to Lionel when they adopted Nicole at the age of nine."}, {"url": "http://www.biography.com/people/nicole-richie-244556", "passage_text": "Synopsis. Nicole Camille Escovedo was born in Berkeley, California, on September 21, 1981, and at age three, for financial reasons, Nicole moved in with her father's band mate, Lionel Richie, and his wife. Six years later, the Richies officially adopted Nicole. Nicole Camille Escovedo was born in Berkeley, California, on September 21st, 1981. Her biological mother was a backstage assistant for singer and musician Lionel Richie."}, {"url": "http://www.imdb.com/name/nm3548307/bio", "passage_text": "Mini Bio (1). Karen Nicole is an actress and composer, known for Cyborg Clone Rambocop 12: This Time It's Personal the Revenge Redux Reloaded to the Limit (2011), Regret (2015) and Dear Santa (2015). "}, {"url": "http://www.theglamourouslife.com/articles/who-is-nicole-richies-mother.html", "passage_text": "Many people are curious about who is Nicole Richie’s mother. Nicole has done a swell job keeping her birth mother a secret for a while. No one really what her mother is like, besides that her name is Karen, and she was an executive assistant for Sheila Escovedo. Karen had a fling with Peter Michael Escovedo, who played for Lionel Richie, the well known musician, and her adoptive father. Yes, Nicole’s adoptive mother is a black woman by the name of Brenda Harvey-Richie who was married to Lionel when they adopted Nicole at the age of nine."}]