[{"url": "http://www.idrivewithuber.com/how-much-do-uber-drivers-make/", "passage_text": "Uber driver pay varies depending on where you live and how many hours you drive. I make between $20 and $25 an hour in Los Angeles. Studies across the nation show that Uber drivers make over $19 an hour on average. In New York City, the average Uber driver makes over $30 an hour."}, {"url": "http://www.huffingtonpost.com/david-fagin/life-as-an-uber-driver_b_4698299.html", "passage_text": "One driver I spoke with suggested that Uber should allow drivers who make rush hour trips --morning or evening -- into the five boroughs to keep 90 percent of the fare. I would go a step further and say, considering they're taking in $20 million a week, they should cover all N.J. driver's river-crossing tolls."}, {"url": "http://www.idrivewithuber.com/how-much-do-uber-drivers-make/", "passage_text": "There is also no such thing as an Uber driver salary. As described above, drivers are paid a portion of the fare for every ride that is given. As promised, here is an example of my pay for one 10 ½ hour day: $256.30 / 10.5 hours = $24.41 an hour."}, {"url": "http://www.businessinsider.com/how-much-you-earn-as-an-uber-driver-2014-6", "passage_text": "So that's $15 an hour. But accounting for tolls, Uber's 20% cut, gas, car insurance, vehicle financing, and self employment taxes, the driver really only made $54.50 for 12 hours of driving. So that's just $4.54 an hour — far below minimum wage."}, {"url": "http://www.businessinsider.com/how-much-you-earn-as-an-uber-driver-2014-6", "passage_text": "If you want to make a living off of Uber, you're going to have to drive an insane number of hours. In order to make $75,000 a year driving for uberX in San Francisco, you'd have to work 3,000 hours per year, which is effectively a 58-hour work week, financial journalist Felix Salmon concluded."}, {"url": "http://www.businessinsider.com/uber-drivers-say-theyre-making-less-than-minimum-wage-2014-10", "passage_text": "The drivers we spoke with say they're making anywhere from $5 an hour to $20 an hour, meaning that in a year's time, if they're working 40-hour weeks, they could be making anywhere between $10,000 to $41,000."}, {"url": "http://bostinno.streetwise.co/2014/06/09/how-much-do-uberx-drivers-actually-make-per-hour/", "passage_text": "Part-time drivers, like the subject of an earlier BostInno report, who make $300 on an exceptional weekend night (about $200 net, after Uber's 20 percent cut and gas money is deducted), can make approximately $21,000 per year."}, {"url": "http://www.idrivewithuber.com/how-much-do-uber-drivers-make/", "passage_text": "As I already explained, how much money an Uber driver makes depends on numerous factors. As a practical example, let’s assume you make $20 an hour after taxes and expenses, and you work 40 hours a week, like a regular full-time job: $19 x 40 hours/week= $760 a week."}]