[{"url": "http://islamicart.com/library/empires/india/taj_mahal.html", "passage_text": "Cambridge, Massachusetts: Harvard University Press. The Taj Mahal The crowning jewel of Indo-Islamic architecture, the Taj Mahal is one of the worlds most beautiful and beloved structures. The monument was built in Agra, India, for Mumtaz Mahal, the favorite wife of Mughal emperor Shah Jahan. Construction of the tomb began in 1632 and employed more than 20,000 laborers for 20 years."}, {"url": "http://www.liveindia.com/tajmahal/2.html", "passage_text": "Main Entrance Gate Of The Taj Mahal Befitting the most beautiful symbol of love, the Taj, is the gateway to this great monument. Taj Mahal looks like a miniature on the landscape from a distance, but appears to grow as you start to approach it. "}, {"url": "http://travel.nationalgeographic.com/travel/world-heritage/taj-mahal/", "passage_text": "The Taj Mahal is widely considered one of the most beautiful buildings ever created. The exquisite marble structure in Agra, India, is a mausoleum, an enduring monument to the love of a husband for his favorite wife. It's also an eternal testament to the artistic and scientific accomplishments of a wealthy empire. "}, {"url": "https://en.wikipedia.org/wiki/Taj_Mahal", "passage_text": "The tomb is the central focus of the entire complex of the Taj Mahal. It is a large, white marble structure standing on a square plinth and consists of a symmetrical building with an iwan (an arch-shaped doorway) topped by a large dome and finial. Like most Mughal tombs, the basic elements are Persian in origin. It was commissioned in 1632 by the Mughal emperor Shah Jahan (reigned 1628–1658) to house the tomb of his favorite wife of three, Mumtaz Mahal. Construction of the mausoleum was essentially completed in 1643 but work continued on other phases of the project for an additional ten years."}, {"url": "http://famouswonders.com/taj-mahal-in-agra/", "passage_text": "Photo by: Zatrokz, Stock.xchng. Taj Mahal is a tomb situated in Agra, India. It was built by the Mughal emperor, Shah Jahan in memory of his beloved wife, Mumtaz Mahal. The Taj Mahal is one of The Seven Wonders of the World and is said to be one of the finest exhibitions of Mughal art and architecture. The architecture has a mixture of Persian, Ottoman, India and Islamic influence"}, {"url": "https://en.wikipedia.org/wiki/Taj_Mahal", "passage_text": "The Taj Mahal is regarded by many as the best example of Mughal architecture and is widely recognized as the jewel of Muslim art in India. It was commissioned in 1632 by the Mughal emperor Shah Jahan (reigned 1628–1658) to house the tomb of his favorite wife of three, Mumtaz Mahal. Construction of the mausoleum was essentially completed in 1643 but work continued on other phases of the project for an additional ten years."}, {"url": "http://famouswonders.com/inside-the-taj-mahal/", "passage_text": "Inside the Taj Mahal. The Taj Mahal is a very historic mausoleum in India inspired through the symbol of love which has been admired over the years. "}, {"url": "http://www.tajmahal.org.uk/inside-taj.html", "passage_text": "This article provides you information about Taj Mahal inside look. Read further to know more about the interiors of Taj Mahal at Agra. As majestically dazzling as it looks from the main gateway, with the glorious view of the mosque and the guest house on the sides and the main mausoleum in the centre with four minarets standing proud at each corner, the insides of TAj Mahal are no less stunningly beautified either."}, {"url": "https://en.wikipedia.org/wiki/Taj_Mahal", "passage_text": "The Taj Mahal complex is believed to have been completed in its entirety in 1653 at a cost estimated at the time to be around 32 million Indian rupees, which in 2015 would be valued at around 52.8 billion Indian rupees ($827 million US). It was commissioned in 1632 by the Mughal emperor Shah Jahan (reigned 1628–1658) to house the tomb of his favorite wife of three, Mumtaz Mahal. Construction of the mausoleum was essentially completed in 1643 but work continued on other phases of the project for an additional ten years."}]