[{"url": "http://www.space.com/16452-jupiters-moons.html", "passage_text": "This montage shows the best views of Jupiter's four large and diverse Galilean satellites as seen by the Long Range Reconnaissance Imager (LORRI) on the New Horizons spacecraft during its flyby of Jupiter in late February 2007. The four moons are, from left to right: Io, Europa, Ganymede and Callisto. Most of the moons of Jupiter are small, with about 50 of the satellites being less than 6.2 miles in diameter. The number of moons changes fairly frequently, with 66 and 67 being confirmed at the end of 2011."}, {"url": "https://en.wikipedia.org/wiki/Galilean_moons", "passage_text": "Io is the innermost of the four Galilean moons of Jupiter and, with a diameter of 3,642 kilometers, the fourth-largest moon in the Solar System. It was named after Io, a priestess of Hera who became one of the lovers of Zeus. Callisto is the fourth and last Galilean moon, and is the second largest of the four, and at 4820.6 kilometers in diameter, it is the third largest moon in the Solar System. Callisto was a daughter of the Arkadian King Lykaon and a hunting companion of the goddess Artemi"}, {"url": "http://www.space.com/16452-jupiters-moons.html", "passage_text": "View full size image. With a total of 67 known moons — including four large moons known as the Galilean satellites — Jupiter almost qualifies as a solar system unto itself. Most of the moons of Jupiter are small, with about 50 of the satellites being less than 6.2 miles in diameter. The number of moons changes fairly frequently, with 66 and 67 being confirmed at the end of 2011."}, {"url": "https://en.wikipedia.org/wiki/Galilean_moons", "passage_text": "The Galilean moons are the four largest moons of Jupiter — Io, Europa, Ganymede, and Callisto. They were discovered by Galileo Galilei around January 1610 and were the first group of objects found to orbit another planet. Callisto is the fourth and last Galilean moon, and is the second largest of the four, and at 4820.6 kilometers in diameter, it is the third largest moon in the Solar System. Callisto was a daughter of the Arkadian King Lykaon and a hunting companion of the goddess Artemis"}, {"url": "http://www.astronomynotes.com/solarsys/s14.htm", "passage_text": "Like the Earth, Jupiter was a planet with moons orbiting it. Galileo took the Jupiter system to be like a miniature solar system. These four satellites are called the Galilean satellites in honor of their discoverer. In order of increasing distance from Jupiter they are Io, Europa, Ganymede and Callisto. The largest of the Galilean satellites (and the largest moon in the solar system) is Ganymede. At 5262 km across, Ganymede is larger than Mercury but because Ganymede orbits a planet, it is classified as a moon. Ganymede orbits Jupiter in 7.15 days. "}, {"url": "http://lasp.colorado.edu/education/outerplanets/moons_galilean.php", "passage_text": "The Galilean Moons. Outward from Jupiter: Each of the Jovian planets has a number of moons, although Jupiter has the most with more than 60 catalogued to date. Jupiter's 4 largest moons exhibit some of the most interesting geology in the solar system. They were discovered by Galileo Galilei and are known as the Galilean moons. Jupiter's largest moon, Ganymede, is larger than Mercury while the other three are larger than Pluto. 1  Io. 2  Europa. 3  Ganymede. 4  Callisto. "}, {"url": "http://www.universetoday.com/44796/galilean-moons/", "passage_text": "Callisto: Callisto is the fourth and farthest Galilean moon. At 4820.6 kilometers in diameter, it is also the second largest of the Galileans and third largest moon in the Solar System. Callisto is named after the daughter of the Arkadian King, Lykaon, and a hunting companion of the goddess Artemis. Together, these moons contain almost 99.999% of the total mass in orbit around Jupiter, and orbit between 400,000 and 2,000,000 km from the planet. They are also among the most massive objects in the Solar System with the exception of the Sun and the eight planets, with radii larger than any of the dwarf planets."}, {"url": "http://www.space.com/7-jupiter-largest-planet-solar-system.html", "passage_text": "Jupiter has at least 63 moons, which are often named after the Roman god's many lovers. The four largest moons of Jupiter, now called Io, Europa, Ganymede, and Callisto, were discovered by Galileo Galilei himself, and are appropriately known today as the Galilean satellites. Ganymede is the largest moon in our solar system, larger even than Mercury and Pluto. "}]