[{"url": "https://en.wikipedia.org/wiki/Gerbil", "passage_text": "Gerbils are typically between six and 12 inches (150 and 300 mm) long, including the tail, which makes up about one-half of their total length. One species, the great gerbil, or Rhombomys opimus, originally native to Turkmenistan, can grow to more than 16 inches (400 mm). The average adult gerbil weighs about 2.5 oz. gerbil is a small mammal of the order Rodentia. Once known simply as  desert rats , the gerbil subfamily includes about 110 species of African, Indian, and Asian rodents, including sand rats and jirds, all of which are adapted to arid habitats."}, {"url": "http://www.humanesociety.org/animals/gerbils/tips/gerbils_as_pets.html", "passage_text": "You'll also spend a few hundred dollars per year on bedding and food, both of which average about a bag per month depending on the number of gerbils. Wood pulp bedding like Carefresh costs about $20 per bag and a high quality gerbil chow such as Gerri Gerbil runs about $5 per bag. gerbil's lifespan is about 3 to 4 years. Gerbils live longer than mice, not as long as guinea pigs, and about the same number of years as hamsters and rats."}, {"url": "http://www.wikihow.com/Care-for-Gerbils", "passage_text": "If your gerbils breed, it can be both an expensive and complicated process for you. 1  Recognizing the sex of two gerbils is not always easy. 2  To do so, turn them over on their back in your hand. 3  At three weeks old, females will exhibit a shorter distance between their urinary and anal openings. For each additional gerbil, the tank should be 5 gallons larger. Fill up a third of the tank with a substrate like Megazorb, Finacard, Carefresh or Bedexcel that the gerbils can dig in. Sufficient room to burrow is necessary to keep your gerbils active and entertained."}, {"url": "http://www.smallanimalchannel.com/critter-experts/gerbil/gerbil-breeding-and-spay-neuter-information-1105.aspx", "passage_text": "When gerbils mate, they usually have about six babies in a litter. They mate again as soon as the babies are born, so a second litter will come even if you remove the dad when the first litter arrives. The initial gestation is about 24 days. A nursing female gerbil will have a delayed gestation and usually be pregnant with the second litter for about five weeks. Male gerbils make great fathers and raising the babies is most successful when the dad is in with the mother gerbil to help out. You can get a male gerbil neutered. Just make sure you find a small animal veterinarian who has done this procedure with high frequency and success in the past. The cost varies widely depending on the part of the country and the animal hospital, but likely will cost $100 at a minimum."}, {"url": "http://www.humanesociety.org/animals/gerbils/tips/gerbils_as_pets.html", "passage_text": "The adoption fee or purchase price for gerbils (they should generally be housed in same-sex pairs) will typically be minimal, but there are startup costs and ongoing needs to anticipate. The initial investment in your gerbil's supplies is likely to cost more than $100. A new 10- or 15-gallon aquarium with a fitted cover can run $25 to $40 (you may be able to find a gently used aquarium online for a lower price), and you'll want to outfit your gerbil’s house with the basics plus some fun extras. A gerbil's lifespan is about 3 to 4 years. Gerbils live longer than mice, not as long as guinea pigs, and about the same number of years as hamsters and rats. Gerbils and other small animals have a much shorter life expectancy than dogs and cats, but they still require a commitment"}, {"url": "http://www.gerbilcare.org/", "passage_text": "If you are wishing to breed gerbils, they are not a great money spinner. The hamster cage will cost about $35, and litter approximately $220 per year, with food about $50 per year. Gerbils can be very active and will escape from a cage that is not properly secured. Their hearing and smell is acute, and so loud noises should be avoided close to gerbils"}, {"url": "http://www.wikihow.com/Care-for-Gerbils", "passage_text": "For two Gerbils a 10-gallon tank should suffice. For each additional gerbil, the tank should be 5 gallons larger. Fill up a third of the tank with a substrate like Megazorb, Finacard, Carefresh or Bedexcel that the gerbils can dig in. Sufficient room to burrow is necessary to keep your gerbils active and entertained."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20070711032646AAtcUSa", "passage_text": "Remove the male/s to a separate cage once the female is pregnant and keep them separated from her until you're ready to breed again. Be ready to separate the babies by sex as soon as they're old enough to differentiate. Don't even think about breeding your gerbils if you can't at least separate them into two cages. Get homes lined up for the babies before you breed. Otherwise, you'll either be stuck keeping the entire litter or likely have to give them away to potentially be used as cheap snake food. had a breeding pair of Gerbils had 1st litter who i sexed and separated them once weened in separate cages for both sexes,i kept a female from first litter with mum to help with the 2ND litter and males with dad."}, {"url": "http://shootingstargerbils.com/adoption.html", "passage_text": "Adoption Fees A pair of young same-sex gerbils = $30 A single gerbil as a same-sex companion to a gerbil you already have = $15 Older and special needs groups = $20 per group ~~ A single gerbil for breeding = $20 (see above) ~~ I can also provide a complete setup at an additional cost; inquire for details. "}]