[{"url": "http://www.everydayhealth.com/drugs/atenolol", "passage_text": "A: Atenolol belongs to a class of drugs called beta blockers that affect the heart and circulation (blood flow through arteries and veins). It is used to treat angina (chest pain), hypertension (high blood pressure), and to treat or prevent heart attack. Atenolol is a synthetic or man-made medication. Atenolol, sold under the brand name Tenormin, is a prescription drug used to treat high blood pressure. It is also used to treat angina and chest pain, and has been shown to improve survival rates after a heart attack by decreasing the severity of the"}, {"url": "http://www.everydayhealth.com/drugs/atenolol", "passage_text": "A: Atenolol (Tenormin) belongs to the group of drugs called beta blockers. Atenolol works by reducing heart rate and blood pressure. It is used in patients with high blood pressure (hypertension) or chest pain (angina) and to treat or prevent heart attacks. Atenolol, sold under the brand name Tenormin, is a prescription drug used to treat high blood pressure. It is also used to treat angina and chest pain, and has been shown to improve survival rates after a heart attack by decreasing the severity of the heart attack."}, {"url": "http://www.webmd.com/drugs/2/drug-1955/atenolol-chlorthalidone-oral/details", "passage_text": "Uses. This medication is used to treat high blood pressure (hypertension). Lowering high blood pressure helps prevent strokes, heart attacks, and kidney problems. This product contains 2 medications: atenolol and chlorthalidone. Atenolol belongs to a class of drugs known as beta blockers. It works by blocking the action of certain natural chemicals in your body, such as epinephrine, on the heart and blood vessel"}, {"url": "http://www.everydayhealth.com/drugs/atenolol", "passage_text": "A: Atenolol (Tenormin) belongs to a class of medications called beta-blockers. Atenolol is a beta-adrenergic (beta-1 selective) agent that blocks beta receptors on the heart. This action primarily affects the heart by slowing it down and decreasing blood pressure. Atenolol, sold under the brand name Tenormin, is a prescription drug used to treat high blood pressure. It is also used to treat angina and chest pain, and has been shown to improve survival rates after a heart attack by decreasing the severity of the heart attack."}, {"url": "http://www.webmd.com/drugs/2/drug-11035/atenolol-oral/details", "passage_text": "Uses. Atenolol is used with or without other medications to treat high blood pressure (hypertension). Lowering high blood pressure helps prevent strokes, heart attacks, and kidney problems. This medication is also used to treat chest pain (angina) and to improve survival after a heart attack. Atenolol belongs to a class of drugs known as beta blockers. It works by blocking the action of certain natural chemicals in your body, such as epinephrine, on the heart and blood vessels. "}, {"url": "https://en.wikipedia.org/wiki/Atenolol", "passage_text": "From Wikipedia, the free encyclopedia. Atenolol is a selective β1 receptor antagonist, a drug belonging to the group of beta blockers (sometimes written β-blockers), a class of drugs used primarily in cardiovascular diseases. Introduced in 1976, atenolol was developed as a replacement for propranolol in the treatment of hypertension. "}, {"url": "http://www.everydayhealth.com/drugs/atenolol", "passage_text": "A: Atenolol belongs to a class of drugs called beta blockers that affects the heart and circulation (blood flow through arteries and veins). It is used to treat angina (chest pain), hypertension (high blood pressure), and to treat or prevent heart attack. Atenolol, sold under the brand name Tenormin, is a prescription drug used to treat high blood pressure. It is also used to treat angina and chest pain, and has been shown to improve survival rates after a heart attack by decreasing the severity of the"}, {"url": "http://www.emedicinehealth.com/drug-atenolol/article_em.htm", "passage_text": "Atenolol is in a group of drugs called beta-blockers. Beta-blockers affect the heart and circulation (blood flow through arteries and veins). Atenolol is used to treat angina (chest pain) and hypertension (high blood pressure). It is also used to treat or prevent heart attack. Atenolol may also be used for purposes other than those listed in this medication guide."}, {"url": "http://www.medicinenet.com/atenolol/article.htm", "passage_text": "PRESCRIBED FOR: Atenolol is prescribed for patients with high blood pressure (hypertension). It also is used to treat chest pain (angina pectoris) related to coronary artery disease. Atenolol also is useful in slowing and regulating certain types of abnormally rapid heart rates (tachycardias). "}]