[{"url": "http://www.doh.wa.gov/YouandYourFamily/IllnessandDisease/AnimalTransmittedDiseases", "passage_text": "Valley Fever is caused by breathing in the fungus Coccidioides. The fungus is known to live in the soil, and has been found in soils of south-central Washington. The symptoms of this rare disease include tiredness, cough, fever, shortness of breath, headaches, night sweats, and muscle aches or joint pain. A zoonotic disease or zoonosis (plural is zoonoses) is any disease of animals that can be transmitted to people. This list includes some zoonotic diseases and related topics that affect people in Washington State."}, {"url": "http://www.emedicinehealth.com/sexually_transmitted_diseases/page2_em.htm", "passage_text": "Sexually Transmitted Diseases (STDs) Causes. Depending on the disease, STDs can be spread with any type of sexual activity. STDs are most often caused by viruses and bacteria. The following is a list of the most common STDs, their causes."}, {"url": "http://www.medicinenet.com/stds_pictures_slideshow/article.htm", "passage_text": "Genital Warts (HPV). It's not necessary to have sexual intercourse to get a sexually-transmitted disease (STD). The human papillomavirus (HPV) that causes genital warts can be transmitted by close skin-to-skin contact. Some types of HPVs cause cervical or anal cancer, and vaccines are available to protect against the most dangerous types"}, {"url": "https://labtestsonline.org/understanding/conditions/std", "passage_text": "Sexually transmitted diseases (STDs), also called sexually transmitted infections (STIs) or venereal diseases, are infections caused by organisms that can be transmitted from one person to another through sexual activity and intimate contact. 1 Chlamydia. 2  According to the CDC, chlamydia is the most frequently reported bacterial STD in the U.S. Infection is caused by the bacterium Chlamydia trachomatis and is often called the silent epidemic because infections are common yet many people do not realize that they are infected."}, {"url": "https://www.plannedparenthood.org/learn/stds-hiv-safer-sex", "passage_text": "Sexually transmitted diseases (STDs) are very common. Sexually transmitted diseases (STDs) are caused by infections that are passed from one person to another during sexual contact. These infections often do not cause any symptoms. Medically, infections are only called diseases when they cause symptoms. That is why STDs are also called sexually transmitted infections .. But it’s very common for people to use the terms sexually transmitted diseases or STDs, even when there are no signs of disease."}, {"url": "http://www.doh.wa.gov/YouandYourFamily/IllnessandDisease/AnimalTransmittedDiseases", "passage_text": "Histoplasmosis is a disease caused by a fungus called Histoplasma capsulatum. The fungus is found in the soil and in bat or bird droppings, primarily in Midwestern states. The fungal spores can become airborne when soil or droppings are disturbed. A zoonotic disease or zoonosis (plural is zoonoses) is any disease of animals that can be transmitted to people. This list includes some zoonotic diseases and related topics that affect people in Washington State."}, {"url": "https://en.wikipedia.org/wiki/Sexually_transmitted_disease", "passage_text": "Sexually transmitted infections (STI), also referred to as sexually transmitted diseases (STD) and venereal diseases (VD), are infections that are commonly spread by sex, especially vaginal intercourse, anal sex and oral sex. As may be noted from the name, sexually transmitted diseases are transmitted from one person to another by certain sexual activities rather than being actually caused by those sexual activities. Bacteria, fungi, protozoa or viruses are still the causative agents."}, {"url": "http://www.cdc.gov/fungal/index.html", "passage_text": "Fungal diseases are often caused by fungi that are common in the environment. Most fungi are not dangerous, but some types can be harmful to health. Mild fungal skin diseases can look like a rash and are very common. Fungal diseases in the lungs are often similar to other illnesses such as the flu or tuberculosis. Some fungal diseases like fungal meningitis and bloodstream infections are less common than skin and lung infections but can be deadly. 1  Types of fungal diseases Read about different types of fungal diseases"}, {"url": "http://www.niaid.nih.gov/topics/std/Pages/default.aspx", "passage_text": "Sexually Transmitted Diseases. STDs are an important global health priority because of their devastating impact on women and infants and their inter-relationships with HIV/AIDS. STDs and HIV are linked by biological interactions and because both infections occur in the same populations. "}, {"url": "http://www.emedicinehealth.com/sexually_transmitted_diseases/article_em.htm", "passage_text": "Sexually transmitted diseases (STDs, venereal diseases) are among the most common infectious diseases in the United States today. STDs are sometimes referred to as sexually transmitted infections, since these conditions involve the transmission of an infectious organism between sex partners. STDs are infrequently transmitted by other types of contact (blood, body fluids or tissue removed from an STD infected person and placed in contact with an uninfected person)."}]