[{"url": "http://www.businessinsider.com/mba-students-are-deluded-about-salary-2013-7", "passage_text": "Many would-be MBAs expect a salary after graduation that's far in excess of what they can actually earn. The average US MBA student expects to earn $140,000 on graduating, a 240% increase from the average current pre-enrollment salary of $58,000, according to a survey by QS TopMBA.com, Expected salary has gone down slightly from last year, but it's still extremely high. Students expect a salary that only students from the top schools in the country get close to. In fact, even Harvard and Stanford only reach $140,000 if you add the average bonus on top of salary. Since the survey includes students from the full spectrum of programs, these expectations are far out of step with reality."}, {"url": "http://moneyning.com/career/what-college-graduates-can-expect-now/", "passage_text": "In addition to this great news, most employers expect to pay their new hires between $30,000 and $40,000 — which is an improvement over the starting salaries offered in past years. 2. But it’s still a competitive market. "}, {"url": "http://money.usnews.com/money/blogs/my-money/2012/06/22/5-college-degrees-that-arent-worth-the-cost", "passage_text": "The riches and glamour of movie stars is not the reality of most college graduates with a drama and theater arts degree. Recent graduates can expect and average salary of $26,000 and an unemployment rate of 7.8 percent. With experience, however, majors can boost their salary to $45,000. Below are five degrees with average starting salaries that may not be worth paying the costs for college. Social Work. It’s great that you want to go to work every day and help others, but keep in mind that the average high school graduate will likely earn more money in his lifetime. Social work has an average starting salary of $30,000. Even those with experience can expect to find jobs at only $40"}, {"url": "http://www.sbbcollege.edu/s/mba-salary-guide/", "passage_text": "According to the salary website Payscale.com, MBA graduates can expect to earn an average of $50,000 in their first year of employment after graduating. Across the US there has been a range of average salaries evident, based on the economy of a city or state, along with the economic growth and stability of that particular business, as well as the cost of living locally. Here are some average MBA graduate salaries based on state: 1  California – $96,599. 2  New York – $95,083."}, {"url": "http://www.sbbcollege.edu/s/mba-salary-guide/", "passage_text": "At present, the average starting salary for MBA graduates can be as high as $110,000 to $130,000 per year for those graduating from top ranked institutions, while MBA graduates from other schools can earn in the range of $75,000 to $90,000 per year. Across the US there has been a range of average salaries evident, based on the economy of a city or state, along with the economic growth and stability of that particular business, as well as the cost of living locally. Here are some average MBA graduate salaries based on state: 1  California – $96,599. 2  New York – $95,083."}, {"url": "http://www.sbbcollege.edu/s/mba-salary-guide/", "passage_text": "On average, MBA graduates are likely to earn around 50 percent more than they did before gaining their qualification, proving that undertaking an MBA delivers great return on investment of time and money for those students who are capable of succeeding in this popular degree. Across the US there has been a range of average salaries evident, based on the economy of a city or state, along with the economic growth and stability of that particular business, as well as the cost of living locally. Here are some average MBA graduate salaries based on state: 1  California – $96,599. 2  New York – $95,083."}, {"url": "http://money.usnews.com/money/blogs/my-money/2012/06/22/5-college-degrees-that-arent-worth-the-cost", "passage_text": "However, paying back your college loans might be a serious challenge. The average starting salary is only $33,000, and it’s not much better when you get experience. The average salary of an experienced teacher is $40,000. Below are five degrees with average starting salaries that may not be worth paying the costs for college. Social Work. It’s great that you want to go to work every day and help others, but keep in mind that the average high school graduate will likely earn more money in his lifetime. Social work has an average starting salary of $30,000. Even those with experience can expect to find jobs at only"}, {"url": "http://www.campusexplorer.com/college-advice-tips/D4FE817A/How-Much-Will-an-MBA-Increase-My-Salary/", "passage_text": "The name and ranking of your school: Graduates from schools with greater “name recognition” that rate high on rankings from well-known publications will earn higher salaries on average. The median base salary for 2010 graduates of Harvard Business School was $110,000. Employers look just as much at the amount of work experience you have to complement your MBA degree. You can graduate from the same program at the same time as one of your peers, but if they have more experience than you, chances are they’ll receive a higher salary."}]