[{"url": "http://earthphysicsteaching.homestead.com/Kimberlite.html", "passage_text": "Kimberlite is a type of potassic volcanic rock best known for sometimes containing diamonds. It is named after the town of Kimberley in South Africa, where the discovery of an 83.5-carat (16.7 g) diamond in 1871 spawned a diamond rush."}, {"url": "http://www.kgs.ku.edu/Publications/pic16/pic16_2.html", "passage_text": "Unlike most of the surface rocks in Kansas, which are sedimentary in origin, kimberlite is an igneous rock, formed from the cooling of molten magma. Igneous rocks are extremely rare in Kansas."}, {"url": "http://www.koiduholdings.com/diamonds-deposits-faq.php", "passage_text": "Kimberlite is a special type of igneous rock that sometimes contains diamond. It is named after the town of Kimberley in South Africa, where kimberlite was first recognized (in the late eighteen hundreds) as a primary source of diamond. Kimberlites are relatively rare and occur in continental areas as small intrusions (dykes, sills and plugs) and as volcanic pipes."}, {"url": "https://en.wikipedia.org/wiki/Kimberlite", "passage_text": "Kimberlite occurs in the Earth's crust in vertical structures known as kimberlite pipes as well as igneous dykes and sills. Kimberlite pipes are the most important source of mined diamonds today. The consensus on kimberlites is that they are formed deep within the mantle."}, {"url": "http://www.amnh.org/exhibitions/permanent-exhibitions/rose-center-for-earth-and-space/david-s.-and-ruth-l.-gottesman-hall-of-planet-earth/why-are-there-ocean-basins-continents-and-mountains/plate-tectonics/the-churning-earth/what-is-the-mantle-made-of/kimberlite", "passage_text": "Kimberlite is a relatively rare type of lava. It comes from depths as great as 300 to 350 kilometers. On its way to the surface, kimberlite frequently picks up rock and mineral fragments, including diamonds, one of which can be seen in this sample."}, {"url": "https://en.wikipedia.org/wiki/Kimberlite", "passage_text": "Kimberlite is an igneous rock best known for sometimes containing diamonds. It is named after the town of Kimberley in South Africa, where the discovery of an 83.5-carat (16.70 g) diamond called the Star of South Africa in 1869 spawned a diamond rush, eventually creating the Big Hole."}]