[{"url": "http://www.huffingtonpost.com/2013/02/01/chipotle-salary_n_2601611.html", "passage_text": "That said, according to Salary.com, the median expected salary for a retail franchise manager in the U.S. is $95,764 per year. At Chipotle, entry-level employees make around $21,000 including benefits and two weeks of paid vacation, CBS Los Angeles reports."}, {"url": "http://www.huffingtonpost.com/2013/02/01/chipotle-salary_n_2601611.html", "passage_text": "One employee interviewed by the network, Lidia Castillo, said she worked her way up from a service manager all the way to restaurateur (Chipotle's title for a general manager) within a year, a position with an average salary of $99,000 annually."}, {"url": "http://losangeles.cbslocal.com/2013/01/31/you-could-make-up-to-99k-a-year-at-chipotle/", "passage_text": "“From January to December of last year, I went through service manager, apprentice, general manager, and restaurateur,” she said. Ronald Sedillo, the Director of Training and Development at Chipotle, said a restaurateur makes a comfortable salary. “Those people make about $99,000 a year,” he said."}, {"url": "http://www.businessinsider.com/chipotle-workers-salary-2013-2", "passage_text": "A Chipotle executive said that position, which is like a senior manager, pays about $99,000. “I get a bonus, I get a company car, and if I help somebody else become a general manager, I get $10,000, Castillo added. The average starting salary at Chipotle is $21,000."}, {"url": "http://www.businessinsider.com/chipotle-workers-salary-2013-2", "passage_text": "Aranami via Flickr. Those who climb the ladder from burrito-roller to manager at Chipotle can bring in the big bucks, according to a report by CBS Los Angeles. CBS interviewed Lidia Castillo, a 22-year-old woman who worked her way up from an entry-level position to manager, general manager, and restaurateur."}, {"url": "http://www.myjobapps.com/chipotle-mexican-grill-manager-salary/", "passage_text": "Restaurateur/General Manager. 1  Salary: The usual salary for this position ranges from $41,000 to $60,000 and experience is usually considered in getting a higher salary. 2  Bonuses: Restaurant owner has the discretion in giving out bonuses. 3  The amount can differ and can be anywhere from $2,000 to $5,000."}, {"url": "http://www.indeed.com/salary/q-General-Manager-Manager-Chipotle-l-Oklahoma-City,-OK.html", "passage_text": "$37,000. Average General Manager Manager Chipotle salaries for job postings in Oklahoma City, OK are 14% lower than average General Manager Manager Chipotle salaries for job postings nationwide."}]