[{"url": "https://en.wikipedia.org/wiki/Trumpeter_Swan", "passage_text": "The trumpeter swan (Cygnus buccinator) is a species of swan found in North America. The heaviest living bird native to North America, it also is on average, the largest extant species of waterfowl with a wingspan that may exceed 10 ft (3.0 m)."}, {"url": "http://dnr.wi.gov/org/caer/ce/eek/critter/bird/trumpeterswan.htm", "passage_text": "A big, beautiful, white bird. Snow-white trumpeter swans are a spectacular sight. With a wingspan of more than 7 feet and a height of about 4 feet, the trumpeter swan is the largest native waterfowl species in North America. Trumpeters have broad, flat bills with fine tooth-like notches along the edges."}, {"url": "http://www.theanimalfiles.com/birds/waterfowl/swan_black.html", "passage_text": "They have a wingspan between 1.6 and 2 m (5.2 - 6.5 ft) and they weigh between 6 and 9 kgs (13 - 20 lbs). Their feathers are mainly black in colour but they have a line of white flight feathers on the edges of their wings."}, {"url": "http://dnr.wi.gov/org/caer/ce/eek/critter/bird/trumpeterswan.htm", "passage_text": "The Trumpeter Swan (Cygnus buccinator) Wisconsin Status: removed from endangered species list in 2009 A big, beautiful, white bird Trumpeter look-alikes Trumpeter habits and habitats Swan history What you can do A big, beautiful, white bird Snow-white trumpeter swans are a spectacular sight. With a wingspan of more than 7 feet and a height of about 4 feet, the trumpeter swan is the largest native waterfowl species in North America. Trumpeters have broad, flat bills with fine tooth-like notches along the edges."}, {"url": "http://www.theanimalfiles.com/birds/waterfowl/swan_black.html", "passage_text": "Both the male and female contribute to the nest building and the nest consist of grasses, weeds and reeds. The dimensions of the nest are approximately 1 - 1.5 m (3.3 - 4.9 ft) in diameter and up to 1 m (3.3 ft) in height. 4 - 7 greenish/white eggs are laid and they are incubated for 35 - 40 days by both of the parents. The cygnets are greyish/brown in colour with pale edging on their feathers."}, {"url": "http://www.answers.com/Q/What_is_the_height_of_swans", "passage_text": "Share to: There are many different species of swans found all over the world,  including Mute Swan, Trumpeter Swan, Tundra Swan, Black Swan,  Coscoroba Swan, and Whooper Swan. While s … pecies like the Australian  Black Swan are indigenous to Australia, others like the Trumpeter  Swan is native to North America."}]