[{"url": "http://www.healthgrades.com/symptoms/muscle-weakness", "passage_text": "Muscle weakness, or myasthenia, is a decrease in strength in one or more muscles. It is a common symptom of muscular, neurological and metabolic disorders. Muscular diseases, such as muscular dystrophy and dermatomyositis (disorder characterized by muscle inflammation), are common causes of muscle weakness."}, {"url": "http://www.webmd.com/a-to-z-guides/weakness-and-fatigue-topic-overview", "passage_text": "1 If muscle weakness is the result of pain, the person may be able to make muscles work, but it will hurt. 2  Fatigue is a feeling of tiredness or exhaustion or a need to rest because of lack of energy or strength. 3  Fatigue may result from overwork, poor sleep, worry, boredom, or lack of exercise."}, {"url": "http://www.medicinenet.com/weakness/symptoms.htm", "passage_text": "Weakness is a decrease in the strength in one or more muscles. In the strictest sense, the medical definition of weakness refers to loss of muscle strength, and this article is focused upon conditions that can result in a measurable loss of muscle function. Weakness may be generalized or may affect one muscle or muscle group exclusively."}, {"url": "http://www.healthline.com/symptom/muscle-weakness", "passage_text": "The definition of true muscle weakness, however, is when your full effort does not produce a normal muscle contraction or movement. You may hear it also referred to as reduced muscle strength, muscular weakness, or weak muscles."}, {"url": "http://www.rightdiagnosis.com/sym/muscle_weakness.htm", "passage_text": "Muscle weakness: Introduction. Muscle weakness is a symptom of a wide variety of mild to serious diseases, disorders and conditions. Muscle weakness can result from infection, trauma, malignancy, autoimmune diseases, and other abnormal processes."}, {"url": "http://www.rightdiagnosis.com/m/muscle_weakness/intro.htm", "passage_text": "Muscle weakness is a symptom of a wide variety of mild to serious diseases, disorders and conditions. Muscle weakness can result from infection, trauma, malignancy, autoimmune diseases, and other abnormal processes."}, {"url": "http://www.healthgrades.com/symptoms/muscle-weakness", "passage_text": "Depending on the cause, weakness may occur in one muscle, a group of muscles, or all the muscles, and it may be accompanied by pain, atrophy, cramping, or other types of muscular symptoms. In some cases, muscle weakness that happens suddenly, especially on one side of the body, can be a sign of stroke."}]