[{"url": "http://startcooking.com/how-to-cook-a-pork-roast", "passage_text": "It is not the time in the oven but the internal temperature of the roast that will determine if it is cooked properly. According to the USDA and Minnesota Pork Board, “Pork is best when cooked to medium doneness – 160 degrees F. on a meat thermometer. Continue cooking about 50-80 minutes or until the meat registers 145 degrees on a meat thermometer. Some roasts are long and thin and others are short and fat, consequently the cooking times will vary depending on the shape of your roast. The meat thermometer is the best way to judge the right amount of cooking time."}, {"url": "http://www.cooks.com/rec/search/0,1-0,pork_chops_baking_time,FF.html", "passage_text": "4. Cover the pork chops with this mix ... 5. After an hour, bake in oven at 350 degrees. Baste from time to time with sauce. Bake for 1 hour. PORK CHOPS. Salt and pepper pork chops and put in ... over the chops. Bake at 350°F for ... first half of baking time. Uncover the ... baking time. Turn chops once."}, {"url": "http://www.porkbeinspired.com/wp-content/uploads/2014/06/2924.pdf", "passage_text": "The National Pork Board recommends cooking pork chops, roasts, and tenderloin to an internal temperature between 145° F. (medium rare) and 160° F. (medium), followed by a 3 minute rest. Since large cuts increase approximately 10° F. while resting, remove them from the heat at 150° F. followed by a 10 minute rest. rest) Average Recommended Cooking Time (min. per pound OR total min.) Roasting/Baking Roast at 350° F. unless otherwise noted. Roast in a shallow pan, un-covered. Ham, fully cooked 5-6 lbs. 140° F. 20 min."}, {"url": "http://www.food.com/recipe/baked-pork-chops-155546", "passage_text": "1 Dip each pork chop in the crumb mixture and place on prepared baking sheet. 2  Spray pork chops with cooking spray. 3  Bake at 425 degrees Fahrenheit for 40 to 45 minutes or until pork chops are no longer pink, and internal temperature reaches 160 degrees Fahrenheit. 1 Remove pork chops from the buttermilk. 2  Dip each pork chop in the crumb mixture and place on prepared baking sheet. 3  Spray pork chops with cooking spray. 4  Bake at 425 degrees Fahrenheit for 40 to 45 minutes or until pork chops are no longer pink, and internal temperature reaches 160 degrees Fahrenheit."}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-bake-pork-chops/", "passage_text": "First the pork chops are dipped in a mixture of milk and egg, then they are coated with corn bread stuffing mix. The chops are baked at 425 degrees F for 20 minutes or until the chops reach an internal temperature of 145 degrees F. Allow chops to stand for 3 minutes at room temperature before serving. To stuff, cut a pocket in the side of each pork chop. The thickness of a pork chop will determine its final cooking time, regardless of whether it's boneless or bone-in. Chops typically range in thickness from 3/4 inch to 1-1/2 inches."}, {"url": "http://allrecipes.com/recipe/16415/pork-tenderloin/", "passage_text": "1 Preheat oven to 325 degrees F (165 degrees C). 2  Bake in the preheated oven for 25 minutes per pound, or until the internal temperature reaches 145 degrees F (63 degrees C). 3  Baste the pork occasionally while cooking. 4  Meanwhile, heat the apple jelly in a small saucepan over medium heat. "}, {"url": "http://www.recipetips.com/kitchen-tips/t--907/pork-cooking-times.asp", "passage_text": "Whether you are looking for a pork loin cooking time or a pork chop cooking time, use the following chart as a cooking time and temperature guide for pork cuts (including ham) that are cooked in the oven, grilled, or are inserted into an oven bag prior to cooking. Pork Cooked at 325°F in an Oven Bag. Note: The cooking times below are for cooking pork to 160°F., the old USDA standard. The new standard for fresh pork is 145°F. Be aware that the estimated cooking times below should be reduced to meet the new USDA standards for fresh or not fully cooked pork."}]