[{"url": "https://en.wikipedia.org/wiki/Muscle_tissue", "passage_text": "Muscle tissue varies with function and location in the body. In mammals the three types are: skeletal or striated muscle; smooth or non-striated muscle; and cardiac muscle, which is sometimes known as semi-striated. Smooth and cardiac muscle contracts involuntarily, without conscious intervention"}, {"url": "http://www.columbia.edu/itc/hs/medical/sbpm_histology_old/lab/lab04_skeletal.html", "passage_text": "The most striking feature of skeletal muscle fibers is the presence of striations that are conspicuous in longitudinally sectioned fibers. The striations are due to the presence of myofibrils, which are cylindrical bundles of thick and thin myofilaments, organized into units of contraction called sarcomeres. "}, {"url": "http://www.mhhe.com/biosci/ap/histology_mh/strimusc.html", "passage_text": "Striations are a key attribute to identify skeletal and cardiac muscle types. Although striations are usually visible in most sections of these muscle types, it can sometimes take a little adjustment of the microscope lighting to see them clearly. Remember, striations across cells indicate you are viewing cardiac or skeletal muscle. Differentiation of these two types involves other structural features. We will examine these now! Skeletal muscle is the most abundant muscle type in the body."}, {"url": "https://en.wikipedia.org/wiki/Striated_muscle_tissue", "passage_text": "Striated muscle tissue is muscle tissue that has repeating sarcomeres, in contrast with smooth muscle tissue. Specifically, striated muscles are: 1  Pharyngeal muscle (embryologically different from skeletal muscle). 2  Cardiac muscle (heart muscle). Contractions in striated muscles are voluntary, except for the heart muscle, in which contractions are involuntary. Cardiac muscle is often treated separately from the other striated muscles, as it has somewhat different characteristics."}, {"url": "https://answers.yahoo.com/question/index?qid=20090427134858AAi74Wx", "passage_text": "Rating Newest Oldest. Best Answer: Sarcomeres The sarcomeres are what give skeletal and cardiac muscles their striated appearance. A sarcomere is defined as the segment between two neighbouring Z-lines (or Z-discs, or Z bodies). "}, {"url": "https://en.wikipedia.org/wiki/Skeletal_striated_muscle", "passage_text": "The myofibrils are composed of actin and myosin filaments, repeated in units called sarcomeres, the basic functional units of the muscle fiber. The sarcomere is responsible for the striated appearance of skeletal muscle, and forms the basic machinery necessary for muscle contraction. The term muscle refers to multiple bundles of muscle fibers called fascicles. All muscles also contain connective tissue arranged in layers of fasciae. Skeletal muscle is a form of striated muscle tissue which is under the voluntary control of the somatic nervous system. It is one of three major muscle types, the others being cardiac muscle and smooth muscle. Most skeletal muscles are attached to bones by bundles of collagen fibers known as tendons"}, {"url": "http://www.wisegeekhealth.com/what-is-striated.htm", "passage_text": "People may condition their striated muscles through exercises. Skeletal muscle and cardiac muscle are types of striated muscle. Skeletal muscles, a type of striated muscle, are voluntary muscles that allow for the movement of bones and joints. Thousands of sarcomeres form striated muscles. View slideshow of images above. There are two types of striated muscle: skeletal muscle and cardiac muscle. The skeletal muscles are voluntary muscles which allow for the movement of bones and joints, while cardiac muscles are involuntary, and found only in the heart."}, {"url": "http://www.mhhe.com/biosci/ap/histology_mh/strimusc.html", "passage_text": "The A and I bands repeat along the length of the muscle fibers to create the striations visible under the light microscope. 1  Sarcomeres repeat along skeletal and cardiac fibers. 2  Components between adjacent Z-lines comprise the sarcomere. 3  Sarcomeres are considered the functional units of striated muscles. Remember, striations across cells indicate you are viewing cardiac or skeletal muscle. Differentiation of these two types involves other structural features. We will examine these now! Skeletal muscle is the most abundant muscle type in the body."}, {"url": "http://www.mhhe.com/biosci/ap/histology_mh/strimusc.html", "passage_text": "1 Sarcomeres repeat along skeletal and cardiac fibers. 2  Components between adjacent Z-lines comprise the sarcomere. 3  Sarcomeres are considered the functional units of striated muscles. 4  I Bands are lighter areas of non-overlap between actin and myosin that contain the Z-lines. Remember, striations across cells indicate you are viewing cardiac or skeletal muscle. Differentiation of these two types involves other structural features. We will examine these now! Skeletal muscle is the most abundant muscle type in the body."}]