[{"url": "https://en.wikipedia.org/wiki/Dietary_fiber", "passage_text": "The FDA statement template for making this claim is: Soluble fiber from foods such as [name of soluble fiber source, and, if desired, name of food product], as part of a diet low in saturated fat and cholesterol, may reduce the risk of heart disease. Consistent intake of fermentable fiber through foods like berries and other fresh fruit, vegetables, whole grains, seeds, and nuts is now known to reduce risk of some of the world’s most prevalent diseases — obesity, diabetes, high blood cholesterol, cardiovascular disease, and numerous gastrointestinal disorders."}, {"url": "http://healthyeating.sfgate.com/5-top-natural-sources-fiber-4041.html", "passage_text": "Nuts and seeds are also good natural sources of dietary fiber. The MayoClinic.com recommends adding nuts such as almonds, pistachios and pecans to your diet. However, some nuts are high in fats and should be eaten in small amounts. Oats are considered a power-food because they are high in dietary fiber and other nutrients; one cup of cooked oatmeal contains 4.0 grams of fiber. Oats have a low glycemic index, which means they slow the absorption of sugar from the digestive tract into the blood."}, {"url": "http://www.huffingtonpost.com/2014/10/21/high-fiber-foods_n_1543165.html", "passage_text": "Inulin is often added to fiber supplements, but Ansel says onions are a good natural source, as are foods like asparagus and leeks. Bulgur. Alamy. If you are going to have grains, one of the best ones you can have is bulgur wheat, which has 8 grams per cup, says Ansel. Alamy. When it comes to sources of fiber, apples are basically hiding in plain sight. Anything with 3 grams of fiber is considered a good source of fiber, and an excellent source is anything with 5 grams, Crandall says."}, {"url": "http://commonsensehealth.com/foods-high-in-fiber-fiber-rich-foods/", "passage_text": "Pinterest148. This high fiber foods list is essential to your good health and as easy to use as ABC. And our ABC ranking for these foods high in fiber gives you simple guidelines for choosing the very best, healthiest fiber rich foods. To be healthy you need 30 to 40 grams of fiber a day from high fiber foods. The following high fiber sources are specifically ranked for fiber content. The “A” category is the highest, with over 7 grams of fiber per serving. “B” is next with 3 grams or more. And “C” fiber foods have less than 3 grams."}, {"url": "http://healthyeating.sfgate.com/5-top-natural-sources-fiber-4041.html", "passage_text": "This means they have high fiber content and nutrition. Whole-grains are made into breads, pastas and other foods. MayoClinic.com recommends eating whole-wheat spaghetti, which has 6 grams of fiber per cup and pearl barley, which contains 6.0 grams of fiber per cup. Oats are considered a power-food because they are high in dietary fiber and other nutrients; one cup of cooked oatmeal contains 4.0 grams of fiber. Oats have a low glycemic index, which means they slow the absorption of sugar from the digestive tract into the blood."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/fiber/art-20043983", "passage_text": "Most plant-based foods, such as oatmeal and beans, contain both soluble and insoluble fiber. However, the amount of each type varies in different plant foods. To receive the greatest health benefit, eat a wide variety of high-fiber foods. A high-fiber diet has many benefits, which include: 1  Normalizes bowel movements. 2  Dietary fiber increases the weight and size of your stool and softens it. 3  A bulky stool is easier to pass, decreasing your chance of constipation."}, {"url": "http://healthyeating.sfgate.com/5-top-natural-sources-fiber-4041.html", "passage_text": "Fiber is found in healthy, plant-based foods. It is not digested by the body and does not contain nutrients. Yet, fiber is critical for healthy digestion and bowel function and can help to reduce the risk of chronic disorders such as high blood pressure, cholesterol, diabetes and heart disease. Oats are considered a power-food because they are high in dietary fiber and other nutrients; one cup of cooked oatmeal contains 4.0 grams of fiber. Oats have a low glycemic index, which means they slow the absorption of sugar from the digestive tract into the blood."}, {"url": "https://en.wikipedia.org/wiki/Dietary_fiber", "passage_text": "Sources of insoluble fiber include: 1  whole grain foods. 2  wheat and corn bran. 3  legumes such as beans and peas. 4  nuts and seeds. 5  potato skins. 6  lignans. 7  vegetables such as green beans, cauliflower, zucchini (courgette), celery, and nopal. Consistent intake of fermentable fiber through foods like berries and other fresh fruit, vegetables, whole grains, seeds, and nuts is now known to reduce risk of some of the world’s most prevalent diseases — obesity, diabetes, high blood cholesterol, cardiovascular disease, and numerous gastrointestinal disorders."}]