[{"url": "http://www.gyanunlimited.com/health/datura-stramonium-medicinal-uses-side-effects-and-benefits/9184/", "passage_text": "Datura seeds parts used are seeds, flowers and leaves. All the parts of datura contain dangerous level of poison like tropane alkaloids atropine, hyoscyamine, scopolamine, which are considered as deliriants or anticholinergics. 1 Datura is used as poison because the presence of alkaloids such as scopolamine, hyoscyamine, and atropine. 2  The growing datura plant acts like as insect repellent thereby protects other plants from insects. 3  The juice of datura plant is applied over the scalp to treat hair fall, hair loss and dandruff."}, {"url": "http://bioweb.uwlax.edu/bio203/2011/hart_cale/classification.htm", "passage_text": "Taxonomic classification of Datura stramonium *Under each classification is another example organism from our host site, Multiple Organisms*. The following is the hierarchical classification of the species Datura stramonium, it has been derived from morphological, molecular, and evolutionary relationships. Species-Datura stramonium Commonly known by the name jimson weed, this species actually derives its name from the Hindu vernacular, Dhatura. Stramonium on the other hand originates from Latin, meaning spiked fruit."}, {"url": "https://en.wikipedia.org/wiki/Datura_stramonium", "passage_text": "Datura stramonium, known by the common names Jimson weed or Devil's snare, is a plant in the nightshade family. It is believed to have originated in Mexico, but has now become naturalized in many other regions. Other common names for D. stramonium include thornapple and moon flower, and it has the Spanish name Toloache. Datura stramonium is a foul-smelling, erect, annual, freely branching herb that forms a bush up to 2 to 5 ft (60 to 150 cm) tall. The root is long, thick, fibrous and white. The stem is stout, erect, leafy, smooth, and pale yellow-green"}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-921-JIMSON%20WEED.aspx?activeIngredientId=921&activeIngredientName=JIMSON%20WEED", "passage_text": "Jimson weed is a plant. The leaves and seeds are used to make medicine. Despite serious safety concerns, jimson weed is used to treat asthma, cough, flu (influenza), swine flu, and nerve diseases. Some people use it as a recreational drug to cause hallucinations and a heightened sense of well-being (euphoria). Jimson weed is UNSAFE when taken by mouth or inhaled. It is poisonous and can cause many toxic effects including dry mouth and extreme thirst, vision problems, nausea and vomiting, fast heart rate, hallucinations, high temperature, seizures, confusion, loss of consciousness, breathing problems, and death."}, {"url": "https://www.erowid.org/plants/datura/datura_info5.shtml", "passage_text": "Datura stramonium is an annual plant. It grows 4 to 6 feet tall and has dark green, long stemmed, lobed leaves which exude a foul odor. Its flower whic blooms in late spring is usually white, sometimes lavender, solitary and tubular. TOXICOLOGY. Datura stramonium is an annual plant. It grows 4 to 6 feet tall and has dark green, long stemmed, lobed leaves which exude a foul odor. Its flower whic blooms in late spring is usually white, sometimes lavender, solitary and tubular. A four lobed, thorny, green seed pod fruit ripens in early fall."}, {"url": "https://www.erowid.org/plants/datura/datura_info5.shtml", "passage_text": "Jimson Weed is a common weed along roadsides, in cornfields and pastures, and in waste areas. Datura stramonium comes from the family Solanaceae, the potato or nightshade family. The plant is native to Asia, but is also found in the West Indies, Canada, and the United States. TOXICOLOGY. Datura stramonium is an annual plant. It grows 4 to 6 feet tall and has dark green, long stemmed, lobed leaves which exude a foul odor. Its flower whic blooms in late spring is usually white, sometimes lavender, solitary and tubular. A four lobed, thorny, green seed pod fruit ripens in early fall."}, {"url": "http://medplant.nmsu.edu/datura.html", "passage_text": "Jimson weed is commonly seen among roadsides in the Southwest. Cultivation Datura is easily cultivated, growing well in virtually any type of soil, but generally prefering slightly acidic and calcareous conditions. Seeds are sown in May, 12-15 inches apart, and kept free of weeds in the early stages. Historic use of Jimson weed and various other species of Datura has occurred for many purposes throughout time. In Europe the plant was used for witch craft, in salves or ointments. Throughout most European countries the seeds were used to brew beer (Shaman Australis Ethnobotanicals). In Mexico various tribes (i.e."}]