[{"url": "https://en.wikipedia.org/wiki/Functional_symptom", "passage_text": "Unsourced material may be challenged and removed. (May 2015). A functional symptom is a medical symptom in an individual which is very broadly conceived as arising from a problem in nervous system 'functioning' and not due to a structural or pathologically defined disease cause."}, {"url": "http://annals.org/article.aspx?articleid=712735", "passage_text": "1999;130(11):910-921. doi:10.7326/0003-4819-130-11-199906010-00016. Text Size: A A A. The term functional somatic syndrome has been applied to several related syndromes characterized more by symptoms, suffering, and disability than by consistently demonstrable tissue abnormality. A six-step strategy for helping patients with functional somatic syndromes is presented here. chronic fatigue syndrome; psychiatry; stress; irritable bowel syndrome; disability; amplification; sick role; whiplash injuries; pain; fibromyalgia."}, {"url": "https://en.wikipedia.org/wiki/Somatization_disorder", "passage_text": "In the DSM-5 the disorder has been renamed to somatic symptom disorder (SSD), and includes SSD with predominantly somatic complaints (previously referred to as somatization disorder), and SSD with pain features (previously known as pain disorder). Somatization disorder is estimated to occur in 0.2% to 2% of females, and 0.2% of males. There are cultural differences in the prevalence of somatization disorder. For example, somatization disorder and symptoms were found to be significantly more common in Puerto Rico."}, {"url": "http://patient.info/doctor/somatic-symptom-disorder", "passage_text": "Recent literature has used the terms somatisation disorder, somatic symptom disorder, functional somatic syndromes and somatisation syndromes more or less interchangeably. Much of the evidence base relating to somatisation disorder is, however, also relevant to SSD and has been quoted where appropriate. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/somatic-symptom-disorder/basics/definition/con-20124065", "passage_text": "Definition. Somatic symptom disorder involves having a significant focus on physical symptoms — such as pain or fatigue — to the point that it causes major emotional distress and problems functioning. "}, {"url": "http://bjp.rcpsych.org/content/185/2/95", "passage_text": "INTRODUCTION. Functional somatic symptoms and syndromes are a major health issue. They are common, costly, persistent and may be disabling. Most of the current literature pertains to specific syndromes defined by medical subspecialties. Indeed, each medical subspecialty seems to have at least one somatic syndrome. The concept of a general functional somatic syndrome does not lead to better treatments. Antidepressant efficacy ranges widely in different functional somatic syndromes, and may be more accurately predicted by the presence of comorbid mood disorders. A recent systematic review showed that ‘ ..."}, {"url": "https://en.wikipedia.org/wiki/Functional_symptom", "passage_text": "Whilst misdiagnosis of functional symptoms does occur, in neurology, for example, this appears to occur no more frequently than of other neurological or psychiatric syndromes. Although, in order to be quantified, misdiagnosis has to be recognized as such, which can be problematic in such a challenging field as medicine. (May 2015). A functional symptom is a medical symptom in an individual which is very broadly conceived as arising from a problem in nervous system 'functioning' and not due to a structural or pathologically defined disease cause."}, {"url": "https://en.wikipedia.org/wiki/Functional_symptom", "passage_text": "A common trend is to see functional symptoms and syndromes such as fibromyalgia, irritable bowel syndrome and functional neurological symptoms such as functional weakness as symptoms in which both biological and psychological factors are relevant, without one necessarily being dominant. (May 2015). A functional symptom is a medical symptom in an individual which is very broadly conceived as arising from a problem in nervous system 'functioning' and not due to a structural or pathologically defined disease cause."}, {"url": "http://bjp.rcpsych.org/content/185/2/95", "passage_text": "Wessely and colleagues suggest that case definitions of functional somatic syndromes overlap. However, there is little overlap in the core symptoms of the two most common syndromes: irritable bowel syndrome and fibromyalgia. The concept of a general functional somatic syndrome does not lead to better treatments. Antidepressant efficacy ranges widely in different functional somatic syndromes, and may be more accurately predicted by the presence of comorbid mood disorders. A recent systematic review showed that ‘ ..."}, {"url": "http://www.nytimes.com/health/guides/disease/somatization-disorder/overview.html", "passage_text": "Somatization disorder is a long-term (chronic) condition in which a person has physical symptoms that involve more than one part of the body, but no physical cause can be found. The pain and other symptoms people with this disorder feel are real, and are not created or faked on purpose (malingering). Greenberg DB, Braun IM, Cassem NH. Functional somatic symptoms and somatoform disorders. In: Stern TA, Rosenbaum JF, Fava M, Biederman J, Rauch SL, eds. Massachusetts General Hospital Comprehensive Clinical Psychiatry. 1st ed. Philadelphia, Pa: Mosby Elsevier;2008:chap 24."}]