[{"url": "http://www.answers.com/Q/How_long_can_the_pregnancy_hormone_stay_in_your_blood_after_a_miscarriage", "passage_text": "How long does hCG stay in your system after miscarriage?     Answer     It depends but its usually out of your system within 4 weeks.     Answer     HCG levels after a miscarriage, delivery or abort … ion will decrease by 99% of their previous levels within 2 weeks. When a woman experiences the miscarriage, once the Embryo has been expelled from your system, HCG decreases daily until there is no HCG left in your system. It usually takes about two weeks for HCG to be completely eradicated from your system but it can sometimes take as long as four weeks."}, {"url": "http://www.livestrong.com/article/407996-hcg-levels-after-a-miscarriage/", "passage_text": "During pregnancy, the concentration of hCG typically rises to 25 mIU/mL by the first day of a missed menstrual period, or about 4 weeks from a woman's last menstrual period. By 8 to 10 weeks into a pregnancy, the concentration of hCG in the blood typically peaks at about 100,000 mIU/mL. The week of the pregnancy during which a miscarriage occurs and the corresponding level of hCG in the blood at that time will determine how long it takes hCG levels to return to pre-pregnancy levels."}, {"url": "http://www.medhelp.org/user_journals/show/14504/how-long-does-hcg-stay-in-your-body-after-miscarriage", "passage_text": "9-10 days. I was 9 weeks along but my HCG levels were only matching that of a 4 week pregnancy. I had what I believe was my 1st normal period following the miscarriage on May 20th, which lasted 6-7 days. I haven't gotten my period yet for June so I took a pregnancy test & it was positive. Hi everyone, I myself miscarried almost 2 weeks ago with my first 2 children. I was pregnant with twins, however one was said to be 7 weeks the other 5 weeks. A week and a half after hearing this I had a natural miscarriage while babysitting."}, {"url": "http://www.livestrong.com/article/407996-hcg-levels-after-a-miscarriage/", "passage_text": "How the miscarriage occurred, such as spontaneous miscarriage or medical procedure, can also affect how fast hCG levels decrease. In general, hCG levels return to normal by 4 to 6 weeks after a miscarriage, but they may occur sooner during the very early stages of pregnancy. The week of the pregnancy during which a miscarriage occurs and the corresponding level of hCG in the blood at that time will determine how long it takes hCG levels to return to pre-pregnancy levels."}, {"url": "http://www.answers.com/Q/How_long_can_the_pregnancy_hormone_stay_in_your_blood_after_a_miscarriage", "passage_text": "The pregnancy hormones stay in your body 2 to 3 weeks after miscarriage depending on individuals. The best way to find out that you are completely clean for another pregnancy … is through an ultrasound. When a woman experiences the miscarriage, once the Embryo has been expelled from your system, HCG decreases daily until there is no HCG left in your system. It usually takes about two weeks for HCG to be completely eradicated from your system but it can sometimes take as long as four weeks."}, {"url": "http://www.livestrong.com/article/407996-hcg-levels-after-a-miscarriage/", "passage_text": "Human chorionic gonadotropin, or hCG, is a hormone made by the placenta to help support the growth of the fetus during pregnancy. During normal pregnancy, hCG levels generally double about every 48 to 72 hours and can be detected by a blood test about 3 weeks from the last menstrual period. The week of the pregnancy during which a miscarriage occurs and the corresponding level of hCG in the blood at that time will determine how long it takes hCG levels to return to pre-pregnancy levels."}, {"url": "http://www.babycenter.com/400_how-long-after-a-miscarriage-does-it-take-for-your-hcg-level_965303_523.bc", "passage_text": "Not true all the time. I had a miscarriage, and 2 weeks later ovulated and became pregnant. I read that your HCG levels have to go back down to 0 for you to even ovulate. The doctors thought I was pregnant due to remnants too, but had my blood taken and at 3 weeks pregnant, they were over 250. I am also having twins! I went the next day for blood work and the levels were 200. I had another test yesterday and the levels are over 4500 now. In my case, I must have ovulated within a week or 2 of the miscarriage b/c based on my HCG levels, I'm about 3 or 4 weeks along now and the miscarriage was only 5 weeks ago."}, {"url": "http://www.answers.com/Q/How_long_is_the_pregnancy_hormone_in_your_system_after_having_a_miscarriage", "passage_text": "It usually takes about two weeks for HCG to be completely eradicated from your system but it can sometimes take as long as four weeks. It is also not unheard of for women to experience pregnancy/light pregnancy symptoms after having a miscarriage for four weeks.     Good luck and take care. Yes you can sti … ll feel pregnant for quite a while after a miscarriage because the HCG (pregnancy hormone) takes a couple of weeks to go down to normal (less than 5) so depending on how far along you were in your pregnancy your levels could remain high (but dropping) for a couple of weeks."}, {"url": "http://www.babycenter.com/400_how-long-after-a-miscarriage-does-it-take-for-your-hcg-level_965303_523.bc", "passage_text": "I'm going on 12 weeks after my D&C and STILL have hormone levels. My 11 week test was 68. I hope my 12 week is at zero. I'm 39 and hope to have a sibling for my 2 year old daughter. I went the next day for blood work and the levels were 200. I had another test yesterday and the levels are over 4500 now. In my case, I must have ovulated within a week or 2 of the miscarriage b/c based on my HCG levels, I'm about 3 or 4 weeks along now and the miscarriage was only 5 weeks ago."}, {"url": "http://www.answers.com/Q/How_long_can_the_pregnancy_hormone_stay_in_your_blood_after_a_miscarriage", "passage_text": "Honestly.     When a woman experiences the miscarriage, once the Embryo has been expelled from your system, HCG decreases daily until there is no HCG left in your system. It usually takes about two weeks for HCG to be completely eradicated from your system but it can sometimes take as long as four weeks. It is also not unheard of for women to experience pregnancy/light pregnancy symptoms after having a miscarriage for four weeks."}]