[{"url": "http://healthyeating.sfgate.com/good-bad-sugars-7608.html", "passage_text": "The three types of carbohydrates in your diet -- sugar, starch and fiber -- all consist of sugar. Simple sugars, such as sucrose, fructose and lactose, only have one or two molecules of sugar. Starch and fiber are complex carbohydrates because they’re made from three to hundreds of sugar molecules. During digestion, simple sugars and complex starches break down into single molecules of glucose"}, {"url": "https://en.wikipedia.org/wiki/Sugar_substitute", "passage_text": "The majority of sugar substitutes approved for food use are artificially synthesized compounds. However, some bulk natural sugar substitutes are known, including sorbitol and xylitol, which are found in berries, fruit, vegetables, and mushrooms. A sugar substitute is a food additive that provides a sweet taste like that of sugar while containing significantly less food energy. Some sugar substitutes are natural and some are synthetic. Those that are not natural are, in general, called artificial sweeteners. An important class of sugar substitutes is known as high-intensity sweeteners. These are compounds with many times the sweetness of sucrose, common table sugar"}, {"url": "http://www.naturalnews.com/027081_sugar_sugars_natural.html", "passage_text": "Date sugar is made from dates and not refined like cane sugar. Though calories for these sugars are similar to refined white sugar, they are less processed, offer some minor benefits and act more with your body more than against it. To stay sweet the right way, just make sure the amount of sugar in your diet does not account for more than 10% of your daily calories. Here is a quick guideline for working with these natural sugars in your own recipes (all equivalent to 1 cup white sugar): Sucanat 1 cup. Turbinado 1 cup. Date Sugar 1 cup. "}, {"url": "http://www.eatingwell.com/nutrition_health/nutrition_news_information/a_glossary_of_natural_sugars_added_sugars", "passage_text": "Find answers to common questions about sugar—such as what is fructose and what is glucose—in our sugar glossary. When it comes to the health implications of sugar, most of what you hear about is naturally-occurring versus added sugars. "}, {"url": "http://livewell.jillianmichaels.com/types-natural-sugars-5121.html", "passage_text": "One type of natural-occurring sugar makes up the building block for several carbohydrates in your body. Upon ingestion, some natural sugars get chemically converted into glucose and are taken up by cells within your intestines for use by your body. Some glucose remains in your blood on its own, where it provides fuel for your muscles during physical activity, as well as acts as the major source of fuel for your brain. Lactose. Lactose is a natural-occurring sugar found in milk, and other dairy products. It is also a component of human breast milk, providing a source of carbohydrates to a nursing infant. Lactose is a disaccaride, made up of one glucose and one galactose molecule bound together."}, {"url": "http://livewell.jillianmichaels.com/types-natural-sugars-5121.html", "passage_text": "Fructose. Another type of natural sugar is fructose. With a chemical structure very similar to glucose, fructose is commonly found as a carbon-based ring. Georgia State University explains that fructose is typically found in fruit, as well as honey, and represents the sweetest of the simple sugars. Lactose. Lactose is a natural-occurring sugar found in milk, and other dairy products. It is also a component of human breast milk, providing a source of carbohydrates to a nursing infant. Lactose is a disaccaride, made up of one glucose and one galactose molecule bound together."}, {"url": "http://www.wisegeek.com/what-is-natural-sugar.htm", "passage_text": "Top 10 amazing movie makeup transformations. To most dieticians and food experts, natural sugar is the kind of sugar contained in fruits, vegetables, and other plants. Most of these sugars occur as fructose, though glucose and sucrose can also be found in some foods. "}, {"url": "http://livewell.jillianmichaels.com/types-natural-sugars-5121.html", "passage_text": "Sugars, also called saccarides, represent a type of carbohydrate. Sugars are often made up of carbon-based rings, which can be linked together to form more complex carbohydrates, such as starch. Natural-occurring sugars can be produced by cells within your body, or consumed through the foods you eat. Lactose. Lactose is a natural-occurring sugar found in milk, and other dairy products. It is also a component of human breast milk, providing a source of carbohydrates to a nursing infant. Lactose is a disaccaride, made up of one glucose and one galactose molecule bound together."}]