[{"url": "http://literarydevices.net/archetype/", "passage_text": "Archetype Definition. In literature, an archetype is a typical character, an action or a situation that seems to represent such universal patterns of human nature. An archetype, also known as universal symbol, may be a character, a theme, a symbol or even a setting."}, {"url": "http://www.yourdictionary.com/archetype", "passage_text": "Frankenstein's monster is the archetype for characters of horror stories. The definition of an archetype is the first of its kind and the basis for all to follow it. An example of an archetype is Frankenstein whose character influenced many future characters of horror books and movies."}, {"url": "http://www.merriam-webster.com/dictionary/archetype", "passage_text": "Full Definition of ARCHETYPE. 1. : the original pattern or model of which all things of the same type are representations or copies: prototype; also: a perfect example. 2. : idea 1a. 3."}, {"url": "http://www.merriam-webster.com/dictionary/archetype", "passage_text": "Medical Definition of ARCHETYPE. 1. a: a primitive generalized plan of structure deduced from the characters of a natural group of plants or animals and assumed to be the characteristic of the ancestor from which they are all descended b: the original ancestor of a group of plants or animals."}, {"url": "http://literarydevices.net/archetype/", "passage_text": "In literature, an archetype is a typical character, an action or a situation that seems to represent such universal patterns of human nature. An archetype, also known as universal symbol, may be a character, a theme, a symbol or even a setting."}, {"url": "http://literary-devices.com/content/archetype", "passage_text": "Archetype. Definition: An archetype is a reference to a concept, a person or an object that has served as a prototype of its kind and is the original idea that has come to be used over and over again. Archetypes are literary devices that employ the use of a famous concept, person or object to convey a wealth of meaning."}, {"url": "https://blog.udemy.com/archetypal-characters/", "passage_text": "Archetypal characters are a major component of all genres of literature, and can also be studied in terms of film, television, and theatre. Archetypes are present in all forms of media and artistic expression, and understanding them will lead to a more developed understanding of everything you watch and read."}]