[{"url": "https://labtestsonline.org/understanding/analytes/glucose/tab/test", "passage_text": "In a person with signs and symptoms of diabetes or hyperglycemia, a non-fasting glucose level (random blood sample) that is equal to or greater than 200 mg/dL (11.1 mmol/L) indicates diabetes. The following information summarizes the meaning of other test results. 1 One-step 2-hour oral glucose tolerance test (OGTT). 2  After a fasting glucose level is measured, a woman is given a 75-gram dose of glucose to drink and her glucose levels are measured at 1 hour and 2 hours after the dose. 3  Only one of the values needs to be above a cutoff value for diagnosis."}, {"url": "http://abcnews.go.com/Health/DiabetesScreening/story?id=3812946", "passage_text": "On the other side, if blood sugar gets up above 180 to 200, then it exceeds the capacity of the kidneys to reabsorb the glucose and we begin to spill glucose into the urine. And if it gets way up high, up in the 400s or even 500s, it can be associated with some alteration in mental function. But if blood sugar drops below 50 and can get down as low as 40 or 30 or even 20, then there is a progressive loss of mental function and eventually unconsciousness and seizures."}, {"url": "https://labtestsonline.org/understanding/analytes/glucose/tab/test", "passage_text": "If the result is abnormal, it is typically followed up with a fasting blood glucose test or a GTT. Glucose blood tests are also used to screen pregnant women for gestational diabetes between their 24th and 28th week of pregnancy. 1 One-step 2-hour oral glucose tolerance test (OGTT). 2  After a fasting glucose level is measured, a woman is given a 75-gram dose of glucose to drink and her glucose levels are measured at 1 hour and 2 hours after the dose. 3  Only one of the values needs to be above a cutoff value for diagnosis."}, {"url": "http://abcnews.go.com/Health/DiabetesScreening/story?id=3812946", "passage_text": "Answer: Now, in a normal individual we measure blood sugar under different circumstances. What we call fasting blood sugar or blood glucose levels is usually done six to eight hours after the last meal. So it's most commonly done before breakfast in the morning; and the normal range there is 70 to 100 milligrams per deciliter. Now when you eat a meal, blood sugar generally rises and in a normal individual it usually does not get above a 135 to 140 milligrams per deciliter. But if blood sugar drops below 50 and can get down as low as 40 or 30 or even 20, then there is a progressive loss of mental function and eventually unconsciousness and seizures."}, {"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/expert-blog/blood-glucose-target-range/BGP-20056575", "passage_text": "A normal fasting blood glucose target range for an individual without diabetes is 70-100 mg/dL (3.9-5.6 mmol/L). The American Diabetes Association recommends a fasting plasma glucose level of 70–130 mg/dL (3.9-7.2 mmol/L) and after meals less than 180 mg/dL (10 mmol/L). I run/jog 50/50, 12-15 miles per week, for a total exercise time of 180 min or greater. In EKG, 10/23/14, my resting heart rate is 52/min, sinus bradycardia, otherwise normal ekg. My A1C has been in the 5.6-5.8 range for two years. My fasting blood glucose is 109-110."}, {"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/expert-blog/blood-glucose-target-range/BGP-20056575", "passage_text": "A person with prediabetes has a fasting blood glucose level between 100 and 125 mg/dl. If the blood glucose level rises to 126 mg/dl or above, a person has diabetes.&quot; and &quot;•An A1C 5.6% or below is normal. In prediabetes, A1C levels range between 5.7%-6.4%. I run/jog 50/50, 12-15 miles per week, for a total exercise time of 180 min or greater. In EKG, 10/23/14, my resting heart rate is 52/min, sinus bradycardia, otherwise normal ekg. My A1C has been in the 5.6-5.8 range for two years. My fasting blood glucose is 109-110."}, {"url": "http://www.ibuzzle.com/articles/normal-glucose-range.html", "passage_text": "You may want to read about blood glucose monitors. Normal Glucose Range ... For a person without diabetes, the normal glucose levels should be in the range of 70 to 120 mg/dl. According to American Diabetes Association, the normal glucose range for diabetics should always be less than 154 mg/dl. The normal glucose range for children before breakfast should be in the range 70 to 99 mg/dl. Two to four hours after a meal, the normal glucose range should be between 70 to 139 mg/dl. "}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3380786/", "passage_text": "Abstract. Control of blood glucose (BG) in an acceptable range is a major therapy target for diabetes patients in both the hospital and outpatient environments. This review focuses on the state of point-of-care (POC) glucose monitoring and the accuracy of the measurement devices. These state that 95% of the individual glucose measurements compared to the reference measurements are required to be in the range ±15 mg/dl for values less than or equal to 75 mg/dl and ±20% for glucose values greater than 75 mg/dl. This is the standard that the FDA normally uses as the goal for approval of POCGMDs."}, {"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/expert-blog/blood-glucose-target-range/BGP-20056575", "passage_text": "Sara: Your doctor wants test you for type 2 diabetes. A normal fasting blood glucose target range for an individual without diabetes is 70-100 milligrams per deciliter (mg/dL) or 3.9-5.6 millimoles per liter (mmol/L). I run/jog 50/50, 12-15 miles per week, for a total exercise time of 180 min or greater. In EKG, 10/23/14, my resting heart rate is 52/min, sinus bradycardia, otherwise normal ekg. My A1C has been in the 5.6-5.8 range for two years. My fasting blood glucose is 109-110."}]