[{"url": "https://en.wikipedia.org/wiki/Anti-fouling_paint", "passage_text": "The inventor of the anti-fouling paint was Captain Ferdinand Gravert, born in 1847 in Glueckstadt (Glückstadt-Schleswig, holstein now In germany but Then), denmark who sold his chemical formula in 1913 At, Taltal. chile Thin sheets of copper or Muntz metal were nailed onto the hull in an attempt to prevent marine growth. One famous example of the traditional use of metal sheathing is the clipper Cutty Sark, which is preserved as a museum ship in dry-dock at Greenwich in England."}, {"url": "https://en.wikipedia.org/wiki/Anti-fouling_paint", "passage_text": "The inventor of the anti-fouling paint was Captain Ferdinand Gravert, born in 1847 in Glueckstadt (Glückstadt-Schleswig, holstein now In germany but Then), denmark who sold his chemical formula in 1913 At, Taltal. Chile Captain Alex gravert has valuable documentation about. this Thin sheets of copper or Muntz metal were nailed onto the hull in an attempt to prevent marine growth. One famous example of the traditional use of metal sheathing is the clipper Cutty Sark, which is preserved as a museum ship in dry-dock at Greenwich in England."}, {"url": "https://en.wikipedia.org/wiki/Tributyltin", "passage_text": "Tributyltin (TBT) is an umbrella term for a class of organotin compounds which contain the (C 4 H 9) 3 Sn group, with a prominent example being tributyltin oxide. For 40 years TBT was used as a biocide in anti-fouling paint, commonly known as bottom paint, which was applied to the hulls of ocean going vessles. TBT compounds are organotin compounds, with 3 butyl groups covalently bonded to a tin(IV) centre. A general formula for these compounds is (n-C 4 H 9) 3 Sn-X. The X group is typically an electronegative leaving group such as chloride or carboxylate .."}, {"url": "https://en.wikipedia.org/wiki/Anti-fouling_paint", "passage_text": "Hull coatings may have other functions in addition to their antifouling properties, such as acting as a barrier against corrosion on metal hulls that will degrade and weaken the metal, or improving the flow of water past the hull of a fishing vessel or high-performance racing yacht. Thin sheets of copper or Muntz metal were nailed onto the hull in an attempt to prevent marine growth. One famous example of the traditional use of metal sheathing is the clipper Cutty Sark, which is preserved as a museum ship in dry-dock at Greenwich in England."}, {"url": "http://www.boatus.com/magazine/2014/april/boat-bottom-paint.asp", "passage_text": "Bottom paint (aka antifouling paint) is a paint or coating designed to discourage weeds, barnacles, and other aquatic organisms from attaching themselves to (and in the case of wooden boats, eating) the underwater portion of your boat's hull. If your boat has never been bottom painted and you're mulling over the idea, make sure you understand that once bottom paint is applied, the die is cast, and that periodic bottom-paint application, cleaning, and renewal become a permanent part of the vessel's routine maintenance schedule."}, {"url": "http://ucanr.edu/sites/coast/Nontoxic_Antifouling_Strategies/", "passage_text": "1 Alternative Antifouling Strategies Sampler This 2008 report covers a variety of nontoxic hull coatings and the companion strategies that are necessary to control fouling without a toxic hull coating. 2  The industry is investing in research and development and turnover in availability of products continues. "}, {"url": "https://en.wikipedia.org/wiki/Anti-fouling_paint", "passage_text": "Anti-fouling paint or bottom paint is a specialized coating applied to the hull of a ship or boat to slow the growth of subaquatic organisms that attach to the hull and can affect a vessel's performance and durability. Thin sheets of copper or Muntz metal were nailed onto the hull in an attempt to prevent marine growth. One famous example of the traditional use of metal sheathing is the clipper Cutty Sark, which is preserved as a museum ship in dry-dock at Greenwich in England."}, {"url": "https://en.wikipedia.org/wiki/Tributyltin", "passage_text": "Bottom paint improves ship performance and durability as it reduces the rate of biofouling, which is the growth of organisms on the ship's hull. Although such paints are effective, the TBT slowly leaches out into the marine environment where it is highly toxic to a wide range of organisms. TBT compounds are organotin compounds, with 3 butyl groups covalently bonded to a tin(IV) centre. A general formula for these compounds is (n-C 4 H 9) 3 Sn-X. The X group is typically an electronegative leaving group such as chloride or carboxylate .."}, {"url": "http://www.abc.net.au/radionational/programs/earthbeat/the-ban-on-toxic-marine-anti-fouling-paints/3646532", "passage_text": "Last November the International Maritime organisation banned the use of tributyltin or TBT and organic compound that's used in anti-fouling paint on ships. The ban starts on 2003 and all TBT based paints are to be phased out by 2008. John Lewis: Anti-fouling paints were first introduced in the middle of the last century and copper was the main biocide at that time. With even the advances over the successive century, the longest life you would get out of a copper based paint was to the order of 12 to 18 months."}, {"url": "http://www.boatus.com/magazine/2012/february/copper.asp", "passage_text": "More than two decades ago, the U.S. outlawed toxic tributyltin (TBT) in antifouling bottom paint, and copper-based substitutes took over to control marine growth on the hull. Last year, Washington became the first state to ban copper paint on environmental grounds. "}]