[{"url": "http://www.innovateus.net/health/what-function-thoracic-duct", "passage_text": "The Thoracic duct is the major lymphatic vessel, which starts near the lower part of the spine. It collects lymph from the lower portion of the body. It runs through the body and empties into the blood through the large vein near the left side of the neck."}, {"url": "http://www.seattlechildrens.org/kids-health/teens/body/body-basics-library/spleen-and-lymphatic-system/", "passage_text": "One of the lymphatic system's major jobs is to collect extra lymph fluid from body tissues and return it to the blood. This process is important because water, proteins, and other substances are continuously leaking out of tiny blood capillaries into the surrounding body tissues."}, {"url": "http://www.cancer.org/cancer/cancerbasics/lymph-nodes-and-cancer", "passage_text": "Our bodies have a network of lymph vessels and lymph nodes. (Lymph is pronounced limf.) This network is a part of the body’s immune system. It collects fluid, waste material, and other things (like viruses and bacteria) that are in the body tissues, outside the bloodstream. Lymph vessels are a lot like the veins that collect and carry blood through the body."}, {"url": "http://www.cancer.org/cancer/cancerbasics/lymph-nodes-and-cancer", "passage_text": "Lymph fluid would build up and cause swelling if it were not drained in some way. That’s the role of the lymph vessels. Lymph vessels draw up the lymph fluid from around the cells to send it towards the chest. There, lymph fluid collects into a large vessel that drains into a blood vessel near the heart."}, {"url": "http://www.cancer.org/acs/groups/cid/documents/webcontent/002876-pdf.pdf", "passage_text": "Our bodies have a network of lymph nodes and lymph vessels that collect and carry watery, clear lymph fluid, much like veins collect blood from distant parts of the body (like the hands and arms) and carry it back to the heart."}, {"url": "http://www.cancer.gov/about-cancer/treatment/side-effects/lymphedema/lymphedema-pdq", "passage_text": "1 Lymphedema is the build-up of fluid in soft body tissues when the lymph system is damaged or blocked. 2  The lymph system is a network of lymph vessels, tissues, and organs that carry lymph throughout the body. 3  Lymphedema occurs when lymph is not able to flow through the body the way that it should."}, {"url": "http://www.innerbody.com/anatomy/immune-lymphatic/thoracic-duct-left-lymphatic-duct", "passage_text": "Click to read more below. The thoracic duct, or the left lymphatic duct, is the largest of the body's lymphatic ducts. It collects almost all of the lymph that circulates throughout the body (the remainder is collected by the right thoracic duct); from there, the lymph flows back into the bloodstream."}, {"url": "http://www.medicalnewstoday.com/articles/180919.php", "passage_text": "Lymphedema, lymphoedema, or lymphatic obstruction is a chronic (long-term) condition in which excess fluid (lymph) collects in tissues causing edema (swelling). Lymphedema can be very debilitating. In short, lymphedema is edema due to lymphatic fluid; a blockage of the lymphatic system."}]