[{"url": "http://www.monarchwatch.org/rear/", "passage_text": "Monarch butterfly eggs are somewhat difficult to find in the wild. Since it only takes 3-5 days for eggs to hatch, timing is crucial. The best sign is to watch for adult Monarchs stopping at milkweed plants. A female will usually lay only one egg per milkweed plant to ensure enough food for each larva. "}, {"url": "http://www.monarchwatch.org/biology/cycle1.htm", "passage_text": "Egg (3-4 days). Monarchs usually lay a single egg on a plant, often on the bottom of a leaf near the top of the plant. It is difficult to tell just how many eggs each female lays during her life, but the average is probably from 100 to 300. The eggs hatch about four days after they are laid. "}, {"url": "http://www.mymonarchguide.com/2007/05/raising-caterpillars.html", "passage_text": "Raising Monarch Caterpillars. I found an egg!. If you found yourself a little creamy-white egg under a milkweed leaf, then you have probably found yourself a Monarch butterfly egg. In about four days, a caterpillar is going to hatch and soon, you will be watching the life-cycle of the gorgeous Monarch take place. In the wild, only about two to five caterpillars that hatch from the hundreds of eggs a mama Monarch lays actually make it to adulthood. "}, {"url": "http://www.answers.com/Q/How_long_does_it_take_a_butterfly%27s_eggs_to_hatch", "passage_text": "With optimum conditions such as temperature and humidity a chicken egg takes 21 days to hatch.    From when it was layed, about 20-28 days,depending on the breed. From th … e time when the egg first cracked, about one day. Turkey eggs usually take 21 to 28 days to hatch depending on what they are incubated in like an incubator or by a hen. It also depends on how fertile it is and how it is cared … for. It usually takes closer to 28 days"}, {"url": "http://www.answers.com/Q/How_long_do_Monarch_eggs_take_to_hatch", "passage_text": "With optimum conditions such as temperature and humidity a chicken egg takes 21 days to hatch.    From when it was layed, about 20-28 days,depending on the breed. From th … e time when the egg first cracked, about one day. This is a very slow process. Turkey eggs usually take 21 to 28 days to hatch depending on what they are incubated in like an incubator or by a hen. It also depends on how fertile it is and how it is cared … for. It usually takes closer to 28 days. + 158 others found this useful"}, {"url": "http://www.instructables.com/id/Monarch-Butterflies-Egg-to-Butterfly/", "passage_text": "Step 1: Timeline. Below are the dates on which significant events in the life of these Monarch butterflies occurred. The timing may vary, but it will be helpful to know about how long things take. June 28 -- Monarch butterfly observed laying eggs on milkweed. June 30 -- Five eggs brought inside (photos only show four). July 2 -- Transfer eggs to a fresh leaf in anticipation of the eggs hatching. July 3 -- Two hatched by early morning and the remaining three by noon. July 5 -- Colored bands becoming apparent. "}, {"url": "http://www.monarch-butterfly.com/", "passage_text": "This starts stage one and generation one of the new year for the monarch butterfly. In March and April the eggs are laid on milkweed plants. They hatch into baby caterpillars, also called the larvae. It takes about four days for the eggs to hatch. Then the baby caterpillar doesn t do much more than eat the milkweed in order to grow. After about two weeks, the caterpillar will be fully-grown and find a place to attach itself so that it can start the process of metamorphosis."}, {"url": "http://www.monarch-butterfly.com/", "passage_text": "Monarch butterflies go through four stages during one life cycle, and through four generations in one year. It s a little confusing but keep reading and you will understand. The four stages of the monarch butterfly life cycle are the egg, the larvae (caterpillar), the pupa (chrysalis), and the adult butterfly. The four generations are actually four different butterflies going through these four stages during one year until it is time to start over again with stage one and generation one. It takes about four days for the eggs to hatch. Then the baby caterpillar doesn t do much more than eat the milkweed in order to grow. After about two weeks, the caterpillar will be fully-grown and find a place to attach itself so that it can start the process of metamorphosis."}]