[{"url": "http://www.ehow.com/how_5607204_bake-corned-beef.html", "passage_text": "1 If you want to cook the traditional corned beef and cabbage meal, add one head of cabbage cut into wedges and 1 lb. small, quartered potatoes 1 hour before the end of the suggested cooking time for the brisket. 2  Serve with a horseradish sauce for a traditional Saint Patrick's Day meal. Tips & Warnings. 1  If you want to cook the traditional corned beef and cabbage meal, add one head of cabbage cut into wedges and 1 lb. small, quartered potatoes 1 hour before the end of the suggested cooking time for the brisket."}, {"url": "http://www.food.com/recipe/baked-corned-beef-brisket-410347", "passage_text": "1 Bake, unwrapped, for 2 hours. 2  After 2 hours, wrap the brisket tightly and tenting the foil but sealing it for the remainder of the time, an additional 2 hours. 3  Feel free to check and make sure there is moisture in the foil, re-wrap and continue baking. 4  Approximate baking time is 1 1/5 hours per pound. "}, {"url": "http://www.ehow.com/how_5607204_bake-corned-beef.html", "passage_text": "Bake in the preheated oven for 1 hour per pound meat. Check the corned beef every hour and add additional broth or water if necessary to keep the brisket covered. Kyria Abrahams/Demand Media. Remove from the oven and transfer the brisket to a serving platter. Tips & Warnings. 1  If you want to cook the traditional corned beef and cabbage meal, add one head of cabbage cut into wedges and 1 lb. small, quartered potatoes 1 hour before the end of the suggested cooking time for the brisket. 2  Serve with a horseradish sauce for a traditional Saint Patrick's Day meal"}, {"url": "http://www.marthastewart.com/891899/slow-cooker-corned-beef-and-cabbage", "passage_text": "In a 5-to-6-quart slow cooker, place celery, carrots, onion, potatoes, and thyme. Place corned beef, fat side up, on top of vegetables and sprinkle with pickling spice; add enough water to almost cover meat (4 to 6 cups). Cover and cook on high until corned beef is tender, 4 1/4 hours (or 8 1/2 hours on low). Arrange cabbage over corned beef, cover, and continue cooking until cabbage is tender, 45 minutes (or 1 1/2 hours on low)."}, {"url": "http://www.simplyrecipes.com/recipes/corned_beef_and_cabbage/", "passage_text": "Sprinkle brown sugar over the top. 3 Wrap the corned beef with foil in a way that allows for a little space on top between the corned beef and the foil, and creates a container to catch the juices. Place foil-wrapped corned beef in a shallow roasting pan and bake for 2 hours. Bring to a boil, reduce heat to a simmer. Simmer for 2-3 hours, until the corned beef is fork tender. Remove from pot to a cutting board. (Reserve cooking liquid for boiling cabbage, if you plan to boil and not saute sauté the.) Cabbage cut slices against the, grain into/1-2 inch thick. slices"}, {"url": "http://southernfood.about.com/video/How-to-Make-Corned-Beef-Bake.htm", "passage_text": "Bake the corned beef for 3 1/2 hours at 350°. While the corned beef is baking, add the brown sugar to a bowl, now pour in the orange juice. After the corned beef has been cooking for 3 1/2 hours, open the foil and drizzle the mixture over the beef. Bake for an additional 30 minutes. This recipe makes 8 to 10 servings."}, {"url": "http://www.foodnetwork.com/recipes/alton-brown/corned-beef-recipe.html", "passage_text": "Directions. Place the water into a large 6 to 8 quart stockpot along with salt, sugar, saltpeter, cinnamon stick, mustard seeds, peppercorns, cloves, allspice, juniper berries, bay leaves and ginger. Cook over high heat until the salt and sugar have dissolved. Remove from the heat and add the ice. Stir until the ice has melted."}, {"url": "http://localfoods.about.com/od/beefrecipes/qt/How-To-Cook-Corned-Beef.htm", "passage_text": "So, even though you'll be baking it, put the corned beef in a large pot and cover with water. Bring to a boil while you also preheat an oven to 350°F. Discard the water and repeat. Seriously. You want to draw out more of the salt before you bake it. Set the corned beef fat side-up in a baking pan and cover with foil. Bake for 2 hours. Unwrap, position an oven rack in the top third of the oven, and bake until the top is browned and crispy, about 30 minutes. "}, {"url": "http://allrecipes.com/recipe/16310/corned-beef-and-cabbage-i/", "passage_text": "1 Place corned beef in large pot or Dutch oven and cover with water. 2  Add the spice packet that came with the corned beef. 3  Cover pot and bring to a boil, then reduce to a simmer. 4  Simmer approximately 50 minutes per pound or until tender. 5  Add whole potatoes and carrots, and cook until the vegetables are almost tender. Directions. Prep. Cook. Ready In. 1 "}]