[{"url": "http://www.elitefitness.com/forum/weight-training-weight-lifting/how-unhealthy-bodybuilding-how-long-you-expected-live-etc-93798.html", "passage_text": "Grizzly. That's ! Bodybuilding is not bad for you at all. The whole carrying lots of muscle thing is kind of true, but for most people it's not going to be a factor. Until you reach freaking gigantic you're not doing anything your body can't handle."}, {"url": "http://www.livestrong.com/article/549093-long-term-effects-of-natural-bodybuilding/", "passage_text": "Muscle Mass. Long-term bodybuilding changes your body composition. Through resistance training, your body becomes stronger and leaner. Not only is this change a positive adaptation for your short-term health, but it can also help as you age."}, {"url": "http://www.webmd.com/fitness-exercise/20050316/why-steroids-are-bad-for-you", "passage_text": "Legal prosecution can be a serious side effect of illicit steroid use. Under federal law, first-time simple possession of anabolic steroids carries a maximum penalty of one year in prison and a $1,000 fine. For first-offense trafficking in steroids, the maximum penalty is five years in prison and a fine of $250,000."}, {"url": "https://answers.yahoo.com/question/index?qid=20090211091413AAXCsOy", "passage_text": "Hi everyone. I spend a lot of time in the gym and weightlifting has become a big part of my life. It relieves my stress and brings out my confidence. I've been doing it for a little while, but now I'm hearing that it can be bad for your heart and cause you to live a shorter life and such."}, {"url": "http://www.ironmagazine.com/2011/is-a-weight-gainer-bad-for-you/", "passage_text": "A weight gainer is nothing more than an easy way to add more calories to your daily needs to put on weight. Used properly, you can eat regular meals but add extra calories and easily be in a surplus. Which is great for optimal muscle building. Used improperly, it’s a very fast way to get fat."}, {"url": "http://www.bodybuilding.com/fun/death-by-protein-debunking-protein-is-as-bad-as-smoking-study.html", "passage_text": "If you consumed 3,000 calories per day, that would equate to 75 grams of protein total per day. If you were down at 2,000 calories per day, that would be just 50 grams! For the lead researcher to say that eating protein is as dangerous as smoking is irresponsible."}]