[{"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/basics/tests-diagnosis/CON-20033091", "passage_text": "1 A fasting blood sugar level less than 100 mg/dL (5.6 mmol/L) is normal. 2  A fasting blood sugar level from 100 to 125 mg/dL (5.6 to 6.9 mmol/L) is considered prediabetes. 3  If it's 126 mg/dL (7 mmol/L) or higher on two separate tests, you have diabetes. 4  Oral glucose tolerance test. 1 Oral glucose tolerance test. 2  For this test, you fast overnight, and the fasting blood sugar level is measured. 3  Then you drink a sugary liquid, and blood sugar levels are tested periodically for the next two hours. 4  A blood sugar level less than 140 mg/dL (7.8"}, {"url": "http://www.webmd.com/diabetes/how-sugar-affects-diabetes", "passage_text": "1 The doctor tests your blood sugar level after fasting for 8 hours and it’s higher than 126 mg/dL. 2  Oral glucose tolerance test. 3  After fasting for 8 hours, you get a special sugary drink. 4  Two hours later your sugar level is higher than 200. 5  Random check. "}, {"url": "http://www.diabetes.co.uk/diabetes_care/fasting-blood-sugar-levels.html", "passage_text": "Fasting test results. The results of a fasting test with respect to glucose levels in the body are as follows: 1  Normal: 3.9 to 5.5 mmols/l (70 to 100 mg/dl). 2  Prediabetes or Impaired Glucose Tolerance: 5.6 to 7.0 mmol/l (101 to 126 mg/dl). 3  Diagnosis of diabetes: more than 7.0 mmol/l (126 mg/dl). "}, {"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/basics/tests-diagnosis/CON-20033091", "passage_text": "1 A blood sample will be taken after an overnight fast. 2  A fasting blood sugar level less than 100 mg/dL (5.6 mmol/L) is normal. 3  A fasting blood sugar level from 100 to 125 mg/dL (5.6 to 6.9 mmol/L) is considered prediabetes. 4  If it's 126 mg/dL (7 mmol/L) or higher on two separate tests, you have diabetes. 1 Oral glucose tolerance test. 2  For this test, you fast overnight, and the fasting blood sugar level is measured. 3  Then you drink a sugary liquid, and blood sugar levels are tested periodically for the next two hours. 4  A blood sugar level less than 140 mg/dL (7.8"}, {"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/expert-blog/blood-glucose-target-range/BGP-20056575", "passage_text": "A normal fasting blood glucose target range for an individual without diabetes is 70-100 mg/dL (3.9-5.6 mmol/L). The American Diabetes Association recommends a fasting plasma glucose level of 70–130 mg/dL (3.9-7.2 mmol/L) and after meals less than 180 mg/dL (10 mmol/L). A person with prediabetes has a fasting blood glucose level between 100 and 125 mg/dl. If the blood glucose level rises to 126 mg/dl or above, a person has diabetes.&quot; and &quot;•An A1C 5.6% or below is normal. In prediabetes, A1C levels range between 5.7%-6.4%"}, {"url": "http://www.all-about-beating-diabetes.com/fasting-blood-glucose-level.html", "passage_text": "First of all, the levels of sugar in your blood measured after you've been fasting for at least 8 hours are considered as fasting. As you may see from the chart above, the normal results vary from 70 to 100 mg/dl. Meanwhile, if you get 100 to 125 mg/dl, this means that you may have pre-diabetes. For more info on how to prevent diabetes onset while having high fasting glucose level, click here. Next, if your results are higher than 126 mg/dl, this means that you most probably have diabetes. Remember: you need another tests to confirm your diabetes diagnose."}, {"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/expert-blog/blood-glucose-target-range/BGP-20056575", "passage_text": "The American Diabetes Association recommends a fasting plasma glucose level of 90-130 mg/dL (5.0-7.2 mmol/L) and after meals less than 180 mg/dL (10 mmol/L). If your doctor feels that you are pre-diabetic it would be okay to check a fasting blood sugar at home once a week or so. A person with prediabetes has a fasting blood glucose level between 100 and 125 mg/dl. If the blood glucose level rises to 126 mg/dl or above, a person has diabetes.&quot; and &quot;•An A1C 5.6% or below is normal. In prediabetes, A1C levels range between 5.7%-6.4%"}]