[{"url": "http://www.mayoclinic.org/digestive-system/expert-answers/FAQ-20058340", "passage_text": "Digestion time varies between individuals and between men and women. After you eat, it takes about six to eight hours for food to pass through your stomach and small intestine. Food then enters your large intestine (colon) for further digestion, absorption of water and, finally, elimination of undigested food. The average transit time through just the large intestine (colon) was 40 hours, with significant difference between men and women: 33 hours for men, 47 hours for women. Two British doctors studied digestion time in children"}, {"url": "http://sciencelearn.org.nz/Contexts/Digestion-Chemistry/Timeline", "passage_text": "Timeline-Digestion Chemistry. A look at the time it takes for food to pass through the gut from mouth to anus. In a healthy adult, transit time is about 24–72 hours. Find out more by browsing or searching the Science Learning Hub. "}, {"url": "http://www.answers.com/Q/What_is_time_required_for_human_digestion", "passage_text": "The food spends around 30 minutes - 2 hours getting to the small intestine, 2-6 hours getting all the nutrients extracted, and the rest in the intestines. Answer 3 It'll take about 24 hours to go through your whole body. Answer 1 It depends on what you have eaten. Some foods (such as food with poor nutrition-ie junk food) digest fast while others digest slowly. On average it takes about 2 … 4 hours to digest your food completely, ready to pass out the other end. Sometimes this can extend to 30-48 hours."}, {"url": "http://www.best-dog-food-guide.com/dog-digestion.html", "passage_text": "Also dog digestion enzymes in the stomach are different from yours to be able to function in this acid. The canine digestive tract is much shorter (20-80 cm compared to 1.5 m for you) so the food stays for a much shorter time in your dog's system. Average passing time is only 24-48 hours, whereas it can take you up to three days. The faster dog digestion also contributes to his resistance to bacteria. "}, {"url": "http://www.mayoclinic.org/digestive-system/expert-answers/FAQ-20058340", "passage_text": "In the 1980s, Mayo Clinic researchers measured digestion time in 21 healthy people. Total transit time, from eating to elimination in stool, averaged 53 hours (although that figure is a little overstated, because the markers used by the researchers passed more slowly through the stomach than actual food). The average transit time through just the large intestine (colon) was 40 hours, with significant difference between men and women: 33 hours for men, 47 hours for women. Two British doctors studied digestion time in children"}, {"url": "http://cravinglifestyle.com/blog/food-digestion-rates/", "passage_text": "Food digestion rates also depend on the gut transit. Food will pass through here slowly if you do not exercise sufficiently,people who exercise frequently will have faster digestion ability. The average time for food to stay in the gut transit is 24 to 56 hours. If food stays here for less than 2 hours it is a sign of very poor digestion. This will lead to dehydration, and there will be less time for nutrient absorption. In this article I will discuss a little bit about them. Food digestion takes 12-48 hours on average. However for clear understanding, digestion time will solely depend on the type of food consumed by an individual."}, {"url": "http://www.answers.com/Q/What_is_the_average_time_for_digestion_to_occur_in_humans", "passage_text": "On average it takes about 24 hours to digest your food completely, ready to pass out the other end. Sometimes this can extend to 30-48 hours. Answer 2. Digestion is by no means a quick process, taking around 24-48 hours. The food spends around 30 minutes - 2 hours getting to the small intestine, 2-6 hours getting all the nutrients extracted, and the rest in the intestines. Answer 3. It'll take about 24 hours to go through your whole body."}, {"url": "http://www.answers.com/Q/What_is_the_average_time_for_digestion_to_occur_in_humans", "passage_text": "This will usually take 5 to 6 hours. The food then enters the colon for further digestion and water re-absorption before defecation. The time from it's entering the colon to defecation is about 12 to 24 hours. Thus, the time for food to travel from one end to the other probably ranges from about 20 to 30 hours. Digestion is by no means a quick process, taking around 24-48 hours. The food spends around 30 minutes - 2 hours getting to the small intestine, 2-6 hours getting all the nutrients extracted, and the rest in the intestines. Answer 3. It'll take about 24 hours to go through your whole body."}, {"url": "http://www.answers.com/Q/What_is_time_required_for_human_digestion", "passage_text": "This will usually take 5 to 6 hours. The food then enters the colon for further digestion and water re-absorption before defecation. The time from it's entering the colon to defecation is about 12 to 24 hours. Thus, the time for food to travel from one end to the other probably ranges from about 20 to 30 hours. Answer 1 It depends on what you have eaten. Some foods (such as food with poor nutrition-ie junk food) digest fast while others digest slowly. On average it takes about 2 … 4 hours to digest your food completely, ready to pass out the other end. Sometimes this can extend to 30-48 hours."}]