[{"url": "http://www.hospitaljobsinc.com/how-much-does-a-medical-assistant-make/", "passage_text": "According to the bls.gov (Bureau of Labor Statistics), the average median salary for a medical assistant was $31,220 or an hourly rate of $15.01 dollars per hour in 2014. By definition, the median wage amount is the wage at which half the laborers in an occupation earned more than that wage amount and half earned less. Alaska had the highest annual average salary of $39,680 or around $19.08 dollars an hour in 2014. For employment levels for this occupation, California is the highest with an estimated 81,240 employed medical assistants with an average annual salary of $34,790."}, {"url": "http://www.healthcare-salaries.com/assistants/clinical-medical-assistant-salary", "passage_text": "Average clinical medical assistant salary. Clinical medical assistant collects between 27,000 to $38,000 annually. The median pay per annum is around $31,000. Clinical medical assistant’s hourly pay ranges from $12.00 to $15.00. Clinical medical assistant salary. Clinical medical assistant’s salary is starting around $27,000. This amount gradually increases as clinical medical assistant practices his profession and gains more experience. In fact a clinical medical assistant can collect an annual income of around $38,000."}, {"url": "http://www.medicalassistantcareerguide.com/medical-assistant-salary/", "passage_text": "Simply put, out of all medical assistants, there are ten percent that earn $10.04 or less per hour and there are another ten percent who earn an hourly rate of $19.62 or more. Those in the 50 th percentile are in the median range. This means that 50 percent of MAs earn up to $13.99 per hour. An individual just beginning a career as a medical assistant can expect to earn a starting salary of between $10.00 and $14.00 per hour. This hourly wage translates into a yearly salary of between $18,750 and $29,850. These numbers reflect a range of employees and skill levels, including those with no formal training."}, {"url": "http://www.medical-assistant-career.com/articles/how-much-does-a-medical-assistant-make.php", "passage_text": "For example, average pay for certified medical assistants in physicians offices or other managed care facility is $14.74 per hour; whereas average pay in an emergency and outpatient hospital departments, was $15.18 per hour. The same study also revealed that employers are paying higher wages for CMAs at $29,460 an average annual salary, over a non-certified medical assistant at only $26,568 an average annual salary."}, {"url": "http://work.chron.com/much-medical-assistant-make-hour-6608.html", "passage_text": "Average and Median Wages. The Bureau of Labor Statistics reports that medical assistants earned an average wage of $14.51 per hour as of 2011, which works out to an average salary of about $30,170 per year. The middle-earning 50 percent of medical assistants received hourly wages of between $11.86 and $16.87 an hour. The lowest-paid 10 percent of medical assistants made $10.04 or less per hour, while the highest-paid 10 percent reportedly made $19.62 or more an hour. Pay by Place of Employment. Medical assistants working in dentists' offices reported some of the highest average wages for their profession in 2011, $17.18 an hour. Those employed in specialty hospitals averaged $16.85 an hour, while those working in outpatient care centers reported an average hourly pay of $15.24."}, {"url": "http://www.hospitaljobsinc.com/how-much-does-a-medical-assistant-make/", "passage_text": "In addition, the lower 10% of workers earned less than $21,540 or around $10.36 dollars an hour, and the top 10% earned more than $42,760 or an hourly rate of about $20.56 per hour. Some of the top paying states for medical assistants are Alaska, District of Columbia, Massachusetts, Washington, and Connecticut. Alaska had the highest annual average salary of $39,680 or around $19.08 dollars an hour in 2014. For employment levels for this occupation, California is the highest with an estimated 81,240 employed medical assistants with an average annual salary of $34,790."}, {"url": "http://www.medicalassistantcareerguide.com/medical-assistant-salary/", "passage_text": "According to American Association of Medical Assistants (AAMA), individuals holding a certification (CMA, RMA, and others) earn more on average than non-certified medical assistants. 1  Certified MAs make about $14.94/hour or $29,460/year. An individual just beginning a career as a medical assistant can expect to earn a starting salary of between $10.00 and $14.00 per hour. This hourly wage translates into a yearly salary of between $18,750 and $29,850. These numbers reflect a range of employees and skill levels, including those with no formal training."}, {"url": "http://www.medical-assistant-career.com/articles/how-much-does-a-medical-assistant-make.php", "passage_text": "According to the AAMA 2011 Medical Assisting Salary Survey, average gross salary for certified medical assistants (CMAs) is $29,460. This is a national average, so it might be more or less depending on your area. The average gross pay for non-certified medical assistants is $26,568. The same study also revealed that employers are paying higher wages for CMAs at $29,460 an average annual salary, over a non-certified medical assistant at only $26,568 an average annual salary."}, {"url": "http://www.medical-assistant-career.com/articles/how-much-does-a-medical-assistant-make.php", "passage_text": "There is sometimes a $10,000 difference between a beginning certified medical assistant and a CMA with 16+ years experience. The best type of medical facility for higher pay (based on years of experience) is in a Emergency and outpatient hospital department or medical and surgical specialties.. The same study also revealed that employers are paying higher wages for CMAs at $29,460 an average annual salary, over a non-certified medical assistant at only $26,568 an average annual salary."}]