[{"url": "http://fairmark.com/retirement/roth-accounts/roth-distributions/distribution-overview/", "passage_text": "If you own a regular IRA, you’re required to begin taking distributions at age 70½. This rule doesn’t apply to Roth IRAs. You’re never required to take distributions from your own Roth IRA. Beneficiaries are required to take distributions after the death of the original owner. "}, {"url": "https://www.irs.gov/retirement-plans/retirement-plans-faqs-regarding-required-minimum-distributions", "passage_text": "Retirement Plan and IRA Required Minimum Distributions FAQs. Your required minimum distribution is the minimum amount you must withdraw from your account each year. You generally have to start taking withdrawals from your IRA, SEP IRA, SIMPLE IRA, or retirement plan account when you reach age 70½. Roth IRAs do not require withdrawals until after the death of the owner. 1  You can withdraw more than the minimum required amount. "}, {"url": "http://www.rothira.com/roth-ira-required-minimum-distribution-rmd", "passage_text": "The answer is that if you have a Traditional IRA or if you are considering converting a Traditional IRA to a Roth IRA, you will still need to be concerned about the Required Minimum Distributions rules. You cannot do a valid comparison between a Traditional IRA and a Roth IRA without taking into account the Required Minimum Distributions rules. After all, the major advantage of a Traditional IRA is the tax-deferred aspect of such an account."}, {"url": "http://www.rothira.com/roth-ira-required-minimum-distribution-rmd", "passage_text": "Generally (which means there are some exceptions), you must make a Required Minimum Distribution for the year in which you turn age 70½. The Required Minimum Distribution is the result of a simple calculation: you divide the IRA balance from December 31st of the preceding year by a Life Expectancy. You cannot do a valid comparison between a Traditional IRA and a Roth IRA without taking into account the Required Minimum Distributions rules. After all, the major advantage of a Traditional IRA is the tax-deferred aspect of such an account."}, {"url": "https://www.wellsfargo.com/investing/retirement/ira/roth-ira-conversion", "passage_text": "1 With a Roth IRA, unlike Traditional IRAs, you are not required to begin taking distributions at age 70 1/2. 2  A Roth IRA can be used as an estate planning tool because the assets can be passed on tax-free to your heirs. Other features include: 1 "}, {"url": "http://www.rollover.net/Inherited-Roth-IRA-Stretch-IRA.htm", "passage_text": "Non-spouse beneficiaries are required to eventually take Required Minimum Distributions (RMDs) from an inherited Roth IRA, and the amount and payout period, after the IRA holder s death, depends on who is designated as the IRA beneficiary(ies) and their age at the time of the IRA holder s death. "}, {"url": "http://www.rothira.com/roth-ira-required-minimum-distribution-rmd", "passage_text": "However, Traditional IRAs are generally subject to Required Minimum Distributions beginning at age 70½. One of the great advantages of Roth IRAs is that they are not subject to these lifetime Required Minimum Distributions rules. This advantage may be the single most valuable attribute of a Roth IRA. You cannot do a valid comparison between a Traditional IRA and a Roth IRA without taking into account the Required Minimum Distributions rules. After all, the major advantage of a Traditional IRA is the tax-deferred aspect of such an account."}, {"url": "http://www.rothira.com/roth-ira-required-minimum-distribution-rmd", "passage_text": "Roth IRAs are not subject to the lifetime Required Minimum Distribution rules since no distributions are required during the lifetime of the owner. However, Roth IRAs are subject to Required Minimum Distributions rules after the death of the owner of the Roth IRA with a 50% penalty if such distributions are not made. You cannot do a valid comparison between a Traditional IRA and a Roth IRA without taking into account the Required Minimum Distributions rules. After all, the major advantage of a Traditional IRA is the tax-deferred aspect of such an account."}, {"url": "http://finance.zacks.com/age-must-start-disbursing-ira-8178.html", "passage_text": "You do not have to take any money out of a Roth IRA. Once a Roth account is five years old and you are 59 1/2, Roth withdrawals are not taxable, so there is no reason for the IRS to require distributions. The IRS says to figure your annual required minimum distribution based on the balance in the IRA as of Dec. 31 of the previous year. You can take money out of an IRA without penalty as soon as you are 59 1/2. If it’s a traditional IRA, you must start withdrawing a required minimum amount each year starting the year you reach age 70 1/2."}]