[{"url": "http://wowwiki.wikia.com/wiki/Shaman_totem", "passage_text": "Orc totems. Draenei totems. A totem is the primary tool used by a Shaman as an instrument of war. Characterized by their immobility and area of effect, the totems embody the Shaman's mastery over the elements. Some totems possess destructive power while others aid and assist allies."}, {"url": "http://www.whats-your-sign.com/animal-totems.html", "passage_text": "and Animal Symbolism. Animal totems play huge roles in our lives. They aid in self-discovery and capture our imagination, giving us incredible avenues of self-expression and awareness. Additionally, they assist in understanding our past, and if we are attentive, our animal totems can reveal glimpses of our future. Webster's Dictionary defines a totem as: A natural object, usually an animal that serves as a distinctive, often venerated emblem or symbol. A means of personal or spiritual identity.. "}, {"url": "http://www.legendsofamerica.com/na-totems.html", "passage_text": "Are you drawn to figurines or paintings of a specific animal? The totem itself is a symbol that represents this animal. This could be any number of items-a crest, a totem pole, an emblem, a small figurine or anything else that depicts your animal guide. Note: Native American totems did not include all of the animals listed below, as many of these creatures did not exist in North America; or, in some cases, not at all."}, {"url": "https://en.wikipedia.org/wiki/Totem", "passage_text": "While the term totem is Ojibwe in origin, belief in tutelary spirits and deities is not limited to indigenous peoples of the Americas but common to a number of cultures worldwide. Totemistic beliefs are found in regions of Africa, Arabia, Asia, Australia, Europe, and the Arctic. The word totem comes from the Ojibway word dodaem and means brother/sister kin. It is the archetypal symbol, animal or plant of hereditary clan affiliations. People from the same clan have the same clan totem and are considered immediate family. It is taboo to marry someone of the same clan"}, {"url": "http://www.crystal-cure.com/article-totems.html", "passage_text": "By getting to know your animal totem, you can gain insight and understanding of your own life circumstances more clearly, and share in the totem power or 'medicine'. Animal totems manifest a specific kind of energy that will align to forces of the spiritual realm that are influencing your life. Totem: animal spirit guides. A totem is any natural or mythical animal to whom you feel a close connection during your life or some particular period of your life. The energy of the totem animal speaks to you in some way that is relevant to your own personality or circumstance in"}, {"url": "http://www.legendsofamerica.com/na-totems.html", "passage_text": "Animal Characteristics & Meaning. A totem is a spirit being, sacred object, or symbol of a tribe, clan, family or individual. Native American tradition provides that each individual is connected with nine different animals that will accompany each person through life, acting as guides. This could be any number of items-a crest, a totem pole, an emblem, a small figurine or anything else that depicts your animal guide. Note: Native American totems did not include all of the animals listed below, as many of these creatures did not exist in North America; or, in some cases, not at all."}, {"url": "http://www.legendsofamerica.com/na-totems.html", "passage_text": "Native American Totems & Their Meanings. A totem is a spirit being, sacred object, or symbol of a tribe, clan, family or individual. Native American tradition provides that each individual is connected with nine different animals that will accompany each person through life, acting as guides. This could be any number of items-a crest, a totem pole, an emblem, a small figurine or anything else that depicts your animal guide. Note: Native American totems did not include all of the animals listed below, as many of these creatures did not exist in North America; or, in some cases, not at all."}, {"url": "https://en.wikipedia.org/wiki/Totem", "passage_text": "A totem is a spirit being, sacred object, or symbol that serves as an emblem of a group of people, such as a family, clan, lineage, or tribe. The totemic symbol may serve as a reminder of the kin group's ancestry or mythic past. The word totem comes from the Ojibway word dodaem and means brother/sister kin. It is the archetypal symbol, animal or plant of hereditary clan affiliations. People from the same clan have the same clan totem and are considered immediate family. It is taboo to marry someone of the same clan"}]