[{"url": "https://simple.wikipedia.org/wiki/Treaty_of_Versailles", "passage_text": "The Treaty of Versailles was a peace treaty between the five nations, France, Germany, Britain, Austria-Hungary and the United States after World War I. Play media. The Signing of the Peace Treaty of Versailles. The Treaty of Versailles was a peace treaty between the five nations, France, Germany, Britain, Austria-Hungary and the United States after World War I. The treaty was made in 1919, but the German government did not participate in it."}, {"url": "https://en.wikipedia.org/wiki/Treaty_of_Versailles", "passage_text": "It ended the state of war between Germany and the Allied Powers. It was signed on 28 June 1919, exactly five years after the assassination of Archduke Franz Ferdinand. The other Central Powers on the German side of World War I were dealt with in separate treaties. The defeated nations of Germany, Austria, and Hungary were excluded from the negotiations. Russia was also excluded because it had negotiated a separate peace (the Treaty of Brest-Litovsk) with Germany in 1918. The terms of this treaty awarded Germany a large proportion of Russia's land and resources."}, {"url": "http://www.enotes.com/homework-help/why-was-treaty-versailles-significant-wwi-148627", "passage_text": "(Answer #3). The Treaty of Versailles was a peace treaty that did end World War I. It was signed June 28, 1919 and was a treaty that was meant specifically for Germany but not the other countries on Germany's side. They had separate treaties. The Treaty of Versailles was written in such a way as to be very harsh to Germany. It punished Germany by taking away a lot of German territory and by making Germany pay a great deal of money in war reparations. It also made Germany admit the war was all their fault even though that is not really true."}, {"url": "http://www.johndclare.net/EA3.htm", "passage_text": "The main reasons why the Germans hated the Treaty of Versailles was because they thought it was unfair. Germany had not taken part in the Conference. The terms were imposed upon Germany when Germany disagreed, the Allies threatened to go to war again. "}, {"url": "http://www.answers.com/Q/Why_is_the_Treaty_of_Versailles_important", "passage_text": "It made  Germany very poor.    Here are the terms of the Treaty of Versailles:   Germany was to accept the blame for starting the war, under the  terms of 'War guilt' cause.  Germany was to reduce its army to 100,000 men.  Germany could only have 6 battleships in its navy. The Treaty of Versailles was a treaty attended by all victorious nations of the Great War (Except for Russia as they were in the middle of a civil war). It was to sort out wha … t would happen to Germany as they were blamed of starting the Great War."}, {"url": "http://www.answers.com/Q/Why_is_the_Treaty_of_Versailles_important", "passage_text": "The reason the treaty is considered a failure is because it basically caused WWII. In clause 231-A, Germany is forced to hold blame for the entire war. (even though the war st … arted because of Austria-Hungary's blaming of Serbia for the assassination of their Archduke). The Treaty of Versailles was a treaty attended by all victorious nations of the Great War (Except for Russia as they were in the middle of a civil war). It was to sort out wha … t would happen to Germany as they were blamed of starting the Great War."}, {"url": "http://history1900s.about.com/od/worldwari/p/Versailles-Treaty.htm", "passage_text": "The Versailles Treaty, signed on June 28, 1919, was the peace settlement between Germany and the Allied Powers that officially ended World War I. The details of the Versailles Treaty had been debated and finalized at the Paris Peace Conference, which opened on January 18, 1919 - just over two months after the fighting on the Western Front ended. Although many diplomats from the Allied Powers participated, Germany was not invited to the conference."}, {"url": "https://answers.yahoo.com/question/index?qid=20090522070730AAYR1jN", "passage_text": "Best Answer: The Treaty of Versailles was important largely because of the impact it had on Germany. It certainly played a role in the onslaught of WW2. Report Abuse. peace treaty between the world countries after world war 1 france britain and usa were involved in it. they made germany sign it unconditionally. it involved things such as germany had to pay for all damage the war had caused in reparations. also germany had to have land taken away."}]