[{"url": "http://wanttoknowit.com/where-does-tobacco-come-from/", "passage_text": "Where Does Tobacco Come From. 31 Aug, 2012 where does 0. Tobacco is a product made from the leaves of a variety of plants in the Nicotiana family, more commonly known as tobacco plants. This product has many uses, but it is most commonly used as a drug in products such as cigarettes and cigars. However, the tobacco that is most commonly grown as a cash crop today originated in the Americas where it had long been cultivated and used by the native people. Christopher Columbus was the first European to be introduced to the plant on his first voyage to the New World."}, {"url": "https://answers.yahoo.com/question/index?qid=20080319165116AARfAzF", "passage_text": "Tobacco(Nicotiana tabacum) originated in America. It is indigenous to North and South America, Australia, south west Africa and the South Pacific. Report Abuse. Tobacco(Nicotiana tabacum) originated in America. It is indigenous to North and South America, Australia, south west Africa and the South Pacific. Various Nicotiana species, commonly referred to as tobacco plants, are cultivated and grown to produce tobacco."}, {"url": "https://en.wikipedia.org/wiki/Tobacco", "passage_text": "Tobacco is a product prepared from the leaves of the tobacco plant by curing them. The plant is categorized within the genus Nicotiana of the Solanaceae (nightshade) family. While more than 70 species of tobacco are known, the chief commercial crop is N. tabacum. They are also consumed as snuff, chewing tobacco, and dipping tobacco. Tobacco use is a risk factor for many diseases, especially those affecting the heart, liver, and lungs, and several cancers. In 2008, the World Health Organization named tobacco as the world's single greatest cause of preventable death."}, {"url": "https://en.wikipedia.org/wiki/Tobacco", "passage_text": "The English word tobacco originates from the Spanish and Portuguese word tabaco. The precise origin of the Spanish/Portuguese word is disputed, but it is generally thought to have originated, at least in part, from Taino, the Arawakan language of the Caribbean. They are also consumed as snuff, chewing tobacco, and dipping tobacco. Tobacco use is a risk factor for many diseases, especially those affecting the heart, liver, and lungs, and several cancers. In 2008, the World Health Organization named tobacco as the world's single greatest cause of preventable death."}, {"url": "http://wanttoknowit.com/where-does-nicotine-come-from/", "passage_text": "Nicotine is a highly addictive alkaloid (natural bases containing nitrogen found in plants) found in the nightshade family of plants. The nightshade family includes a diverse variety of plants, herbs, shrubs and trees and can impact on the nerve-function and digestive functions of humans and animals. Anywhere between 2 and 7 % of nicotine can be found in the tobacco leaf. Eggplants and tomatoes also contain a small amount of nicotine but not enough for the substance to be poisonous or act as a stimulant."}, {"url": "https://en.wikipedia.org/wiki/Tobacco", "passage_text": "Tobacco contains the alkaloid nicotine, a stimulant. Dried tobacco leaves are mainly smoked in cigarettes, cigars, pipe tobacco, and flavored shisha tobacco. They are also consumed as snuff, chewing tobacco, and dipping tobacco. Tobacco use is a risk factor for many diseases, especially those affecting the heart, liver, and lungs, and several cancers. In 2008, the World Health Organization named tobacco as the world's single greatest cause of preventable death."}, {"url": "http://wanttoknowit.com/where-does-tobacco-come-from/", "passage_text": "We already know that processed tobacco comes from the tobacco plant, most commonly Nicotiana tabacum. Plants from the Nicotiana family originated from both North and South America, Australia, Africa and the South Pacific. However, the tobacco that is most commonly grown as a cash crop today originated in the Americas where it had long been cultivated and used by the native people. Christopher Columbus was the first European to be introduced to the plant on his first voyage to the New World."}, {"url": "http://wanttoknowit.com/where-does-tobacco-come-from/", "passage_text": "The plant family Nicotiana and the word nicotine is named after Jean Nicot who brought tobacco seeds to Europe in 1560. He introduced snuff (tobacco that is inhaled) to the French court and from here the use of the product spread around Europe. However, the tobacco that is most commonly grown as a cash crop today originated in the Americas where it had long been cultivated and used by the native people. Christopher Columbus was the first European to be introduced to the plant on his first voyage to the New World."}]