[{"url": "http://www.healthcare-salaries.com/physicians/eye-surgeon-salary", "passage_text": "Eye surgeon salary in the US. The median eye surgeon’s salary for those working in the US is around $188,935, according to PayScale. Their total salary ranges between $97,679 and $357,494, while bonuses reach up to $71,954 and profit sharing ranges from $5,500 to $37,000 on top of the basic salary. Eye surgeon salary by city/state in the US. The eye surgeon salary was earned in Hawaii and California at $315,000 in 2011 if based on salaries by region. The second highest salary by region was earned in the Great Lakes States at $301,000."}, {"url": "http://www.healthcare-salaries.com/physicians/ophthalmologist-salary", "passage_text": "Ophthalmologist salary. An ophthalmologist’s salary is based on several factors such as type of employer, work experience, location, age of an ophthalmologist and gender. An average expected salary for an ophthalmologist ranges from $98,000 to $700,000 per annum. And how much does an ophthalmologist earn in Mexico. An ophthalmologist in Mexico may be earning almost the same as a doctor in general practice. The latter is shown to be earning between MXN139,620 and MXN623,404 per year, according to PayScale."}, {"url": "http://www.healthcare-salaries.com/physicians/eye-surgeon-salary", "passage_text": "According to Salary.com, the median salary for eye surgeon is around $263,003. The top 10% earners take home an eye surgeon’s salary of $336,523 or more, while the bottom 10% receive only $188,191 or less. Aside from their basic salary, eye surgeon or ophthalmologist also enjoys several benefits. Eye surgeon salary by city/state in the US. The eye surgeon salary was earned in Hawaii and California at $315,000 in 2011 if based on salaries by region. The second highest salary by region was earned in the Great Lakes States at $301,000."}, {"url": "http://work.chron.com/much-money-general-surgeons-earn-9471.html", "passage_text": "National Salary Statistics. According to a 2011 salary survey conducted by Medscape, general surgeons practicing in the United States earned an average of $265,000. Pay by Practice Setting. According to Medscape, general surgeons practicing in health care organizations earned the most by practice setting in 2011, an average of $339,000 per year. Those practicing in single-specialty group practices averaged $332,000, and those practicing in multispecialty group practices averaged $324"}, {"url": "http://www.healthcare-salaries.com/physicians/ophthalmologist-salary", "passage_text": "The average salary for an ophthalmologist with less than five years of work experience is about $249,000 per annum while an ophthalmologist over 20 years of work experience earns a much better yearly salary of about $354,900. And how much does an ophthalmologist earn in Mexico. An ophthalmologist in Mexico may be earning almost the same as a doctor in general practice. The latter is shown to be earning between MXN139,620 and MXN623,404 per year, according to PayScale."}, {"url": "http://www.healthcare-salaries.com/physicians/ophthalmologist-salary", "passage_text": "An average salary for an ophthalmologist according to Medscape ranges from $98,000 to $700,000 per year. A median expected salary for an average ophthalmologist is as high as $254,000 per annum while an annual salary for a self-employed ophthalmologist is about $300,000. And how much does an ophthalmologist earn in Mexico. An ophthalmologist in Mexico may be earning almost the same as a doctor in general practice. The latter is shown to be earning between MXN139,620 and MXN623,404 per year, according to PayScale."}, {"url": "http://work.chron.com/much-money-general-surgeons-earn-9471.html", "passage_text": "Pay by Region. General surgeons practicing in the Great Lakes region reported the highest average salary in 2011, $297,000. Those practicing in California and Hawaii earned a close second, averaging $295,000, and those in the Southwestern states earned a relatively high average salary of $285,000 per year. Pay by Practice Setting. According to Medscape, general surgeons practicing in health care organizations earned the most by practice setting in 2011, an average of $339,000 per year. Those practicing in single-specialty group practices averaged $332,000, and those practicing in multispecialty group practices averaged $324,000"}, {"url": "http://work.chron.com/salary-range-orthopedic-surgeons-8522.html", "passage_text": "A July 2011 special issue of Modern Healthcare magazine collected and compared 16 major physician salary surveys in an effort to find benchmarks for the profession. For orthopedic surgeons, the lowest reported average salary was $378,062 a year and the highest was $576,350 per year. Most fell between $450,000 and $550,000 per year. For example, staffing firm Merritt Hawkins reported an average of $521,000 per year, with a low of $300,000 and a high of $700,000. "}]