[{"url": "https://labtestsonline.org/understanding/analytes/reticulocyte/tab/test", "passage_text": "If the number of reticulocytes is not elevated with anemia, then it is likely that there is some degree of bone marrow dysfunction or failure, involvement by tumor, and/or a deficiency of certain nutrients (e.g., iron, vitamin B12, folate) or erythropoietin. 1 As a follow up to abnormal results on a CBC, RBC count, hemoglobin or hematocrit, to help determine the cause. 2  To determine if the bone marrow is functioning properly and responding adequately to the body's need for red blood cells (RBCs)."}, {"url": "http://emedicine.medscape.com/article/2086146-overview", "passage_text": "The absolute reticulocyte count is the number of reticulocytes in a volume of blood, which is a marker of RBC production. Reticulocytes are immature, but already anucleated, erythroid cells (RBCs) with residual detectable amounts of RNA, thereby capable of producing hemoglobin despite anucleation. The automated hematology analyzer can also report a measurement of reticulocyte-specific hemoglobin content as mean reticulocyte hemoglobin content (CHr) or reticulocyte hemoglobin equivalent (Ret-He), depending on the type of instrument used."}, {"url": "http://www.bloodjournal.org/content/99/4/1489?sso-checked=true", "passage_text": "Abstract. Determination of the reticulocyte hemoglobin content (CHr) provides an early measure of functional iron deficiency because reticulocytes are the earliest erythrocytes released into blood and circulate for only 1 to 2 days. "}, {"url": "http://labmed.ucsf.edu/sfghlab/data/tests/242.html", "passage_text": "INTERPRETATION: CHR represents the hemoglobin content in reticulocytes, the youngest red blood cells (RBC) which transition to mature RBC in 1 to 2 days. CLINICAL SIGNIFICANCE: CHR is helpful in identifying iron deficiency states, including functional iron deficiency earlier than traditional tests for this condition. "}, {"url": "https://labtestsonline.org/understanding/analytes/reticulocyte/tab/test", "passage_text": "Reticulocyte (%) = [Number of Reticulocytes / Number of total Red Blood Cells] X 100. Most often, however, a reticulocyte count is performed with an automated instrument (hematology analyzer) and can be done simultaneously with a CBC, which includes an RBC count, hemoglobin and hematocrit. 1 As a follow up to abnormal results on a CBC, RBC count, hemoglobin or hematocrit, to help determine the cause. 2  To determine if the bone marrow is functioning properly and responding adequately to the body's need for red blood cells (RBCs)."}, {"url": "http://emedicine.medscape.com/article/2086146-overview", "passage_text": "The mean reticulocyte hemoglobin content (CHr) and reticulocyte hemoglobin equivalent (Ret-He) are two equivalent parameters that capture the amount of hemoglobin available to the reticulocytes within the previous 3-4 days. Both parameters directly correlate with the functional availability of iron in the bone marrow. The automated hematology analyzer can also report a measurement of reticulocyte-specific hemoglobin content as mean reticulocyte hemoglobin content (CHr) or reticulocyte hemoglobin equivalent (Ret-He), depending on the type of instrument used."}, {"url": "https://labtestsonline.org/understanding/analytes/reticulocyte/tab/test", "passage_text": "The reticulocyte count may be used: 1  As a follow up to abnormal results on a CBC, RBC count, hemoglobin or hematocrit, to help determine the cause. 2  To determine if the bone marrow is functioning properly and responding adequately to the body's need for red blood cells (RBCs). 1"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/18027835", "passage_text": "Sequential measurements of reticulocyte hemoglobin content in patients with iron deficiency anemia provide a rapid means for assessing the erythropoietic response to iron replacement therapy (Brugnara et al., Blood 1994;83:3100-3101). The reticulocyte hemoglobin content (CHr or Ret-He) provides an indirect measure of the functional iron available for new red blood cell production over the previous 3-4 days."}, {"url": "http://www.webmd.com/a-to-z-guides/reticulocyte-count", "passage_text": "A reticulocyte count is a blood test that measures how fast red blood cells called reticulocytes are made by the bone marrow and released into the blood. Reticulocytes are in the blood for about 2 days before developing into mature red blood cells. The reticulocyte count rises when there is a lot of blood loss or in certain diseases in which red blood cells are destroyed prematurely, such as hemolytic anemia. Why It Is Done. A reticulocyte count is done to: 1  See whether anemia is caused by fewer red blood cells being made or by a greater loss of red blood cells. 2  Check how well bone marrow is working to make red blood cells. 3  Check to see if treatment for anemia is working."}]