[{"url": "https://en.wikipedia.org/wiki/Circuit_breaker", "passage_text": "The circuit breaker must detect a fault condition; in low voltage circuit breakers this is usually done within the breaker enclosure. Circuit breakers for large currents or high voltages are usually arranged with protective relay pilot devices to sense a fault condition and to operate the trip opening mechanism. A circuit breaker is an automatically operated electrical switch designed to protect an electrical circuit from damage caused by overload or short circuit."}, {"url": "http://www.acronymfinder.com/LSIG.html", "passage_text": "The World's most comprehensive professionally edited abbreviations and acronyms database. All trademarks/service marks referenced on this site are properties of their respective owners. The Acronym Finder is ©1988-2015, Acronym Finder, All Rights Reserved. "}, {"url": "http://www.theiet.org/forums/forum/messageview.cfm?catid=205&threadid=34057", "passage_text": "LSIG = A combination of adjustable trip functions including long-time ampere rating, long-time delay, short-time pickup, short-time delay, defeatable instantaneous pickup, ground-fault pickup and ground-fault delay. ------------------------- Regards, Brian. Top: Bottom. LIG = A combination of adjustable trip functions including long-time ampere rating, long-time delay,"}, {"url": "http://static.schneider-electric.us/docs/Circuit%20Protection/0100DB1019.pdf", "passage_text": "Circuit breakers with LI, LSI or LSIG trip functions would not require the documentation and one of the means specified in 240.87, even if the “I” setting switch has an OFF position.This section does not apply to thermal-magnetic circuit breakers as they all have an instantaneous trip function. All Square D molded case, insulated case and low voltage power circuit breakers are equipped with an instantaneous trip function and thus do not require documentation, ZSI, differential relaying or energy-reducing maintenance switching."}, {"url": "http://static.schneider-electric.us/docs/Circuit%20Protection/Low%20Voltage%20Power%20Circuit%20Breakers/0600DB1104.pdf", "passage_text": "This means that as current increases, the time that it takes the device to trip will decrease. In order to coordinate better with these types of downstream devices, Micrologic circuit breakers offer inverse time delay characteristics on the long-time, short-time and ground-fault functions. This means that the equipment has undergone additional testing to verify that it can handle. Electronic Trip Circuit Breaker Basics 0600DB1104Section 1—Electronic Trip Circuit Breakers 03/20126 © 2012 Schneider Electric All Rights Reserved the additional heat rise associated with this level of operation."}, {"url": "https://sg.answers.yahoo.com/question/index?qid=20070916234327AAGS6qc", "passage_text": "Best Answer: LSIG is common among all manuf with the definitions above. LSIA is a term used primarily by Westinghouse/Culter Hammer. The LSI are the same as above. The A means that the ground fault function is an Alarm only and will not trip the brk. There is a Ground Fault LED that will light up if there is a ground fault on the system in excess of the setting. The breaker will not trip, just indicate an alarm. This style of ground fault is not used very much. Emergency systems, or processes where a non-orderly form of equipment shutdown is more dangerous than the ground fault itself. You can only have one or the other, LSIG or LSIA."}, {"url": "http://www.theiet.org/forums/forum/messageview.cfm?catid=205&threadid=34057", "passage_text": "LSG = A combination of adjustable trip functions including long-time ampere rating, long-time delay, short-time pickup, short-time delay, defeatable instantaneous pickup, ground-fault pickup and ground-fault delay. LIG = A combination of adjustable trip functions including long-time ampere rating, long-time delay,"}, {"url": "http://forums.mikeholt.com/showthread.php?t=144204", "passage_text": "LSIG, Long time, Short time, Instantaneous, and ground fault are options that are available in breakers that electronic trip units. Breaker frames that have interchangeable trip units commonly start out with 250a frames, 400a, 600, 800, 1200a etc. Interrupting capacity has to do with the available fault current and nothing to do with LSIG. Getting a system coordination study can be of a benefit first to assure that the breakers are suitable for the available fault in different parts of the distribution system."}, {"url": "http://forums.mikeholt.com/showthread.php?t=144204", "passage_text": "I would just like to know more about LSIG breakers, firstly when (at what amperage) are they specified? What I have seen typically is that designers specify LSIG breakers once the service size/bus rating of the main swbd at and above 800A (@600V). However on smaller services (400A and below) - I dont usually see this being specified. We have sites with 30 amp and larger circuit breakers with LSIG. Interrupting capacity has to do with the available fault current and nothing to do with LSIG. Getting a system coordination study can be of a benefit first to assure that the breakers are suitable for the available fault in different parts of the distribution system."}, {"url": "https://sg.answers.yahoo.com/question/index?qid=20070916234327AAGS6qc", "passage_text": "630A, LSIG, LSIA are trip functions for the circuit breakers. L=long-time; S=short-time; I=instantaneous; G=ground fault; A=alarm. As for the meaning it is obvious from the definitions of the abbreviations! The breaker will not trip, just indicate an alarm. This style of ground fault is not used very much. Emergency systems, or processes where a non-orderly form of equipment shutdown is more dangerous than the ground fault itself. You can only have one or the other, LSIG or LSIA."}]