[{"url": "http://www.huffingtonpost.com/visualnewscom/visualizing-the-yearly-sa_b_4184716.html", "passage_text": "The figures are staggering, with NBA's average player salary clocking in at $5.15 million, $1.85 million more than players in Major League Baseball who average close to $3.2 million a year. Major League Soccer rounds out the bottom of the list, with players making a relatively meager average salary of $0.16 million. "}, {"url": "http://moneyramblings.com/money-olympic-athletes-earn/", "passage_text": "Just being an Olympic athlete doesn’t actually make you a lot of money. Olympic athletes do earn a small stipend ($200-$2,000) , and many of your expenses are reimbursed such as travel, hotels, and training camps. Your clothes will also be provided by the official sponsor – Hudson Bay Company in Canada and Nike in United States. "}, {"url": "http://www.answers.com/Q/How_much_money_does_a_professional_athlete_earn", "passage_text": "In general, basketball players earn millions of dollars. The  better players like Lebron James and Dwyane Wade will earn around  $25 million a year, average players like Bra … d Miller will earn  around $10 million a year, and rookies will earn from $800,000 a  year to $2 million a year.    Earnings vary widely. Athletes usually make salaries starting from around 200-400 Thousand per year on upwards into the millions. Average Athlete Salary Around 400,000-1,800,000. The average wrestler earns over 1,200,000 a year. If a wrestler is injured it actually adds to their pa"}, {"url": "http://www.answers.com/Q/How_much_do_professional_athletes_make_a_year", "passage_text": "How much a professional athlete makes each year depends on how well  he or she does in that sport and how many sponsors and advertisers  work with the athlete. A professiona … l athlete has the potential to  make millions of dollars per year. Answered. In Entertainment & Arts. They can make anywhere from $100,000-$160,000 per year. This sport isn't really common in the united states, however it is common. Being a pro drifter myself, i find it to be … a very fun and rewarding sport!"}, {"url": "http://www.moneyunder30.com/how-much-do-olympic-athletes-earn-unless-youre-michael-phelps-not-enough", "passage_text": "He used the money to start a charity. All U.S. athletes can also earn a “medal bonus” from the U.S. Olympic committee for each medal won. The Committee pays American medal winners $25,000 for gold, $15,000 for silver, and $10,000 for bronze medals. Some countries, though not all, pay athletes similar medal bonuses"}, {"url": "http://www1.salary.com/Professional-Athlete-salary.html", "passage_text": "For example the median expected annual pay for a typical Professional Athlete in the United States is $32,053 so 50% of the people who perform the job of Professional Athlete in the United States are expected to make less than $32,053. "}, {"url": "http://www.kaycircle.com/How-much-does-a-Professional-Athlete-make-per-Year-Average-Annual-Salary-Range-2010", "passage_text": "In 2010, the average annual salary for professional athletes is $29,500 per year. Athletes usually make a salary that falls between $22,500 and $37,000 per year. The most important factor in determining the salary of a professional athlete is their level of skill."}, {"url": "http://www.mensfitness.com/life/sports/how-much-do-the-highest-paid-athletes-make", "passage_text": "This past year, Woods ranked third, earning a measly $59.4 million. Athletes from 11 sports made the Forbes list, with the world’s 100 highest-paid athletes earning a combined $2.6 billion in salaries, bonuses, prize money, appearance fees and endorsements. LeBron James, coming in number four with $53 million, led the 13 basketball players that made the cut. Editor's Picks. Floyd Mayweather is proof that you don’t have to behave to earn a lot of money. Currently serving a three-month jail term for domestic battery, Mayweather still managed to top the Forbes magazine list of the world’s 100 highest-paid athletes."}]