[{"url": "http://answers.microsoft.com/en-us/ie/forum/ie8-windows_other/i-need-to-modify-a-saved-password-in-internet/1e355fcf-3de1-42f9-ab75-a76ff7a9881c", "passage_text": "2. Click Tools, and then click Delete Browsing History. 3. In Delete Browsing History, click Delete Files, cookies, history and form one at a time (do not delete password as that will delete all saved passwords). 4. Click to select the Also delete files and settings stored by add-ons check box, and then click OK. Internet Explorer 8. 1. Open Internet Explorer 8. 2."}, {"url": "https://kb.iu.edu/d/alcx", "passage_text": "To remove a stored password or other stored information in Internet Explorer 7: 1  From the menu, select. 2  On the tab, under, click. 3  You now have several options: 4  Delete files: Deletes temporary Internet files (copies of web pages, images, and media that are saved for faster viewing)."}, {"url": "http://www.majorgeeks.com/content/page/how_to_manage_your_internet_explorer_saved_passwords.html", "passage_text": "To delete all the saved passwords stored in your Internet Explorer, you just have to click on the Settings icon located in the toolbar of your IE, then click on Internet Options. You will now see a new window of"}, {"url": "https://kb.iu.edu/d/alcx", "passage_text": "Internet Explorer 9 and 8. To remove a stored password or other stored information in Internet Explorer 9 or 8: 1  From the menu, select. 2  On the tab, under Browsing history, click. 3  Check the item(s) you want to delete: 4  Temporary Internet files: Copies of web pages, images, and media that are saved for faster viewing."}, {"url": "http://www.intowindows.com/how-to-view-backup-passwords-saved-in-internet-explorer/", "passage_text": "To view passwords saved in Internet Explorer: Step 1: Launch Internet Explorer browser. Click on the small Gear icon (see the below picture) that appears at the upper-right of the browser window (just below caption buttons) and then click Internet Options to open the same. Step 2: Here, switch to the Content tab."}]