[{"url": "http://www.nature.com/scitable/blog/cognoculture/the_less_human_humans_recursion", "passage_text": "That basically summarizes coverage of a recent study on songbirds' artificial grammar system. More on that later. First, a summary of the study: An influential hypothesis, put forward by Noam Chomsky and colleagues, is that one ability-recursion-enables language, and that humans are alone in having this capacity."}, {"url": "http://linguistics.stackexchange.com/questions/3252/what-is-recursion", "passage_text": "Recursion is a property of language. From a Linguistics viewpoint, recursion can also be called nesting. As I've stated in this answer to what defines a language (third-last bullet point), recursion is a phenomenon where a linguistic rule can be applied to the result of the application of the same rule.. Let's see an example of this. Consider the sentence:"}, {"url": "http://www.nature.com/scitable/blog/cognoculture/the_less_human_humans_recursion", "passage_text": "Recursion, in sum, allows language to become an infinite system. The Chomskyan view is that this ability is quite special, unique to humans. It is, in essence, what distinguishes us from other animals-the source of complex thought and communication, and thus complex mathematical, artistic and linguistic ability. Abe and Watanabe's study shows that songbirds are able to process a recursive grammar-this is perhaps the most significant aspect of their paper. More on that later. First, a summary of the study: An influential hypothesis, put forward by Noam Chomsky and colleagues, is that one ability-recursion-enables language, and that humans are alone in having this capacity."}, {"url": "https://en.wikipedia.org/wiki/Universal_grammar", "passage_text": "Universal Grammar (UG) is a theory in linguistics, usually credited to Noam Chomsky, proposing that the ability to learn grammar is hard-wired into the brain. It is sometimes known as 'mental grammar', and as opposed to other 'grammars', e.g. prescriptive, descriptive and pedagogical. The distinction is important because there is a long history of argument about UG*, whereas most people working on language agree that there is Universal Grammar. Many people assume that Chomsky means UG* when he writes UG (and in some cases he might actually mean UG*, though not in the passage quoted above)."}, {"url": "https://www.edge.org/conversation/daniel_l_everett-recursion-and-human-thought", "passage_text": "You could in principle have a human language that is constrained by the culture, so that the language proper lacks recursion, but the brain has recursion. And that's very difficult to reconcile with Chomsky's ideas on where recursion comes from. Chomsky's absolutely correct to recognize the importance of recursion, but the role that he gives it, and the role that Hauser and Tecumseh Fitch give it, to me has got things backwards. And if that's the case, then you would look for evidence that this language lacked recursion. So in the case of Piraha, pirahã the Language'i ve worked with the longest of the 24 Languages'i ve worked with in The, amazon for about 30, Years piraha'pirahã doesn t have Expressions'like john's brother. s house"}, {"url": "http://thebrain.mcgill.ca/flash/capsules/outil_rouge06.html", "passage_text": "For Chomsky’s theory to hold true, all of the languages in the world must share certain structural properties. And indeed, Chomsky and other generative linguists like him have shown that the 5000 to 6000 languages in the world, despite their very different grammars, do share a set of syntactic rules and principles. These linguists believe that this “universal grammar” is innate and is embedded somewhere in the neuronal circuitry of the human brain. And that would be why children can select, from all the sentences that come to their minds, only those that conform to a “deep structure” encoded in the brain’s circuits."}, {"url": "https://en.wikipedia.org/wiki/Universal_grammar", "passage_text": "The theory of Universal Grammar proposes that if human beings are brought up under normal conditions (not conditions of extreme sensory deprivation), then they will always develop language with a certain property X (e.g., distinguishing nouns from verbs, or distinguishing function words from lexical words). The distinction is important because there is a long history of argument about UG*, whereas most people working on language agree that there is Universal Grammar. Many people assume that Chomsky means UG* when he writes UG (and in some cases he might actually mean UG*, though not in the passage quoted above)."}, {"url": "https://www.edge.org/conversation/daniel_l_everett-recursion-and-human-thought", "passage_text": "So recursion as the essential building block of human language, if Chomsky's correct, is difficult for me to apply as an intellectual trying to build a theory of human language, because it's not clear what it is, and it's not clear that it is in fact essential to different languages. And if that's the case, then you would look for evidence that this language lacked recursion. So in the case of Piraha, pirahã the Language'i ve worked with the longest of the 24 Languages'i ve worked with in The, amazon for about 30, Years piraha'pirahã doesn t have Expressions'like john's brother. s house"}, {"url": "https://en.wikipedia.org/wiki/Universal_grammar", "passage_text": "Chomsky argued that the human brain contains a limited set of rules for organizing language. This implies in turn that all languages have a common structural basis; the set of rules is what is known as universal grammar. The distinction is important because there is a long history of argument about UG*, whereas most people working on language agree that there is Universal Grammar. Many people assume that Chomsky means UG* when he writes UG (and in some cases he might actually mean UG*, though not in the passage quoted above)."}, {"url": "http://www.windowsnetworking.com/articles-tutorials/netgeneral/Understanding-DNS-Recursion.html", "passage_text": "The preferred name resolution method is called recursion. Generally speaking, recursion refers to the process of having the DNS server itself to make queries to other DNS servers on behalf of the client who made the original request. In essence, the DNS server becomes a DNS client. If the DNS server does not know the address of the requested site, then it will forward the request to another DNS server. In order to do so, the DNS server must know of the IP address of another DNS server that it can forward the request to. This is the job of root hints."}]