[{"url": "https://en.wikipedia.org/wiki/Shooting_range", "passage_text": "Shooting ranges can be indoor or outdoor and possibly restricted to certain types of firearms, e.g. handguns only or rifles, or they can specialize in certain shooting sports such Skeet shooting or 10 m Air Pistol / Rifle. Each facility is typically overseen by one or more supervisory personnel, called variously a range master or Range Safety Officer (RSO) in the United States or a range conducting officer (RCO) in the UK."}, {"url": "http://shooting-academy.com/media/building%20an%20indoor%20shooting%20range.pdf", "passage_text": "Approximate cost for this system, apart from any heating or air conditioning, is around $340,000 for a 25m range, slightly more for a 50m (additional trunking) $360,000. Second, is the range equipment: Shooting stalls, target retriever system, baffles and bullet trap. "}, {"url": "http://www.cvaltd.com/2004/02/baffles-berms-and-backstops/", "passage_text": "The principle behind the design is to equip a range with baffles so that if a fired bullet leaves the confines of the range proper, it will fall to earth within a smaller, more. predictable area that is acceptable within the range property, to protect the people or property and adjacent ranges. Erecting baffle berms and backstops are a necessary and a minimum requirement for range owners/operators who do not control 1.5 miles downrange for pistol or 3.5 miles downrange for high. powered rifle, with appropriate 5 degree left and right safety zones."}, {"url": "http://www.shooting-academy.com/Services%20Rifle%20Outdoor.html", "passage_text": "Unless you own a considerable amount of land (i.e. the military), all projectiles must be contained within the range. This is achieved by the correct design of berms, walls, bullet trap and baffle systems. The Shooting Academy specializes in outdoor shooting range design and overhead baffle systems. "}, {"url": "http://www.ballisticstech.com/BTIs-Baffled-Range-Package-6428/", "passage_text": "BTI's Baffled Range Package. A 5-lane baffled range x 50 ft long that provides shooting safety as an outdoor range or indoor range. The SACON bullet absorbing baffles protect from rounds exiting the range. Facility can be designed for pistols or long guns up to 7.62mm, military grade. If you need more lanes another baffled range module can be added to each side."}, {"url": "http://www.cvaltd.com/1196/07/design-criteria-for-ranges/", "passage_text": "There is only one overriding design criterion paramount to the design of shooting ranges and that is safety. There is an adage known by experienced range designers and range operators: A completely safe range cannot be designed. The design problem is, that by the time that bullet falls 5 feet 6 inches, it is already 2,800 feet downrange. At most ranges, shooting will occur inside of 200 yards. With a very flat trajectory, a bullet has to be contained or slowed down in the design, because so much energy still remains."}, {"url": "http://www.spaarange.com/riflerange.htm", "passage_text": "View down range from the covered shooting benches. View under the baffle system downrange facing the 100 and 200 yard berms. Covered shooting benches. 10 firing points, two for 200 yard exclusively, seven for 100 or 200 yard and one for 50 yard bullet trap only. View Downrange showing 50 Yard Bullet Trap at Firing Point one."}, {"url": "https://en.wikipedia.org/wiki/Shooting_ranges_in_the_United_States", "passage_text": "If one brings one's own firearms, ear and eye protection, it is often possible to buy a 50-round box of 9 mm ammunition and target, rent an indoor lane for an hour, and enjoy shooting for under $50 in the United States. Fees for outdoor ranges are often even less, often running $6.50 for 3 hours of range time. "}, {"url": "https://en.wikipedia.org/wiki/Shooting_range", "passage_text": "A shooting range or firing range is a specialized facility designed for firearms practice. Each facility is typically overseen by one or more supervisory personnel, called variously a range master or Range Safety Officer (RSO) in the United States or a range conducting officer (RCO) in the UK. These supervisory personnel are responsible for ensuring that all weapon safety rules are followed at all times"}, {"url": "https://en.wikipedia.org/wiki/Shooting_range", "passage_text": "An outdoor shooting range with a sheltered shooting stand and several other unsheltered stands. The targets are placed at the foot of the mountain, which the photo is taken from. This particular range is in use by both civilians and by the Swedish Army Norrbotten Regiment. Each facility is typically overseen by one or more supervisory personnel, called variously a range master or Range Safety Officer (RSO) in the United States or a range conducting officer (RCO) in the UK."}]