[{"url": "http://biblehub.com/genesis/16-1.htm", "passage_text": "Now Sarai, Abram's wife had borne him no children, and she had an Egyptian maid whose name was Hagar. King James Bible. Now Sarai Abram's wife bare him no children: and she had an handmaid, an Egyptian,"}, {"url": "http://jwa.org/encyclopedia/article/sarahsarai-bible", "passage_text": "Sarah/Sarai: Bible. by Tikva Frymer-Kensky. Sarah is the wife of Abraham, the mother of Isaac, and thus the ancestress of all Israel. The Bible explains that Sarai was her earlier name and that she was renamed at the annunciation of the birth of Isaac (Gen 17:15). Sarah’s ancestry is not clear."}, {"url": "http://christianity.about.com/od/oldtestamentpeople/a/Sarah.htm", "passage_text": "Share. By Jack Zavada. Sarah (originally named Sarai) was one of several women in the Bible who were unable to have children. That proved doubly distressing for her because God had promised her husband Abraham that he would be the father of the Jewish nation, with descendants more numerous than the stars in the sky."}, {"url": "https://en.wikipedia.org/wiki/Sarah", "passage_text": "Her name was originally Sarai. According to Genesis 17:15, God changed her name to Sarah as part of a covenant after Hagar bore Abraham his first son, Ishmael. The Hebrew name Sarah indicates a woman of high rank and is translated as  princess  or noblewoman."}, {"url": "http://jwa.org/encyclopedia/article/sarahsarai-bible", "passage_text": "Sarah is the wife of Abraham, the mother of Isaac, and thus the ancestress of all Israel. The Bible explains that Sarai was her earlier name and that she was renamed at the annunciation of the birth of Isaac (Gen 17:15). Sarah’s ancestry is not clear."}, {"url": "http://1timothy4-13.com/files/proverbs/art14.html", "passage_text": "The Bible says in Genesis 16:3 And Sarai Abram's wife took Hagar her maid the Egyptian, after Abram had dwelt ten years in the land of Canaan, and gave her to her husband Abram to be his wife."}, {"url": "http://www.nydailynews.com/new-york/social-media-shows-sarai-sierra-marietal-strife-article-1.1260331", "passage_text": "Steven Sierra husband of murdered Staten Island mom Sarai Sierra, who was killed in Turkey, leaves the Matthew Funeral Home in Staten Island after making arrangements for his wife."}]