[{"url": "http://geology.com/rocks/granite.shtml", "passage_text": "Granite is a light-colored igneous rock with grains large enough to be visible with the unaided eye. It forms from the slow crystallization of magma below Earth’s surface. Granite is composed mainly of quartz and feldspar with minor amounts of mica, amphiboles and other minerals. This mineral composition usually gives granite a red, pink, gray or white color with dark mineral grains visible throughout the rock. Granite is the best-known igneous rock. Granite is a coarse-grained, light-colored igneous rock composed mainly of feldspars and quartz with minor amounts of mica and amphibole minerals. This simple definition enables students to easily identify the rock based upon a visual inspection."}, {"url": "https://en.wikipedia.org/wiki/Granite", "passage_text": "Granites can be predominantly white, pink, or gray in color, depending on their mineralogy. The word granite comes from the Latin granum, a grain, in reference to the coarse-grained structure of such a holocrystalline rock. Granite differs from granodiorite in that at least 35% of the feldspar in granite is alkali feldspar as opposed to plagioclase; it is the potassium feldspar that gives many granites a distinctive pink color. The extrusive igneous rock equivalent of granite is rhyolite"}, {"url": "http://geology.about.com/od/more_igrocks/a/granite.htm", "passage_text": "First, granite is made of large mineral grains (which is where its name came from) that fit tightly together. Second, granite always consists of the minerals quartz and feldspar, with or without a wide variety of other minerals (accessory minerals). The quartz and feldspar generally give granite a light color, ranging from pinkish to white. That light background color is punctuated by the darker accessory minerals"}, {"url": "http://beyondpenguins.ehe.osu.edu/issue/rocks-and-minerals/the-basics-of-rocks-and-minerals-and-polar-geology", "passage_text": "MINERALS. Minerals, quite simply, are the building blocks for making rocks, and a rock is made up of one or more minerals. When you look at a rock and see different colors, those colors are minerals that make up that specific rock. Igneous rocks form when magma or lava cools and hardens into a rock. Magma and lava are rocks that are so hot they move like a liquid. Magma is molten rock that is underground; lava is molten rock that is above the ground – and that is the only difference between them. A common igneous rock is granite."}, {"url": "https://en.wikipedia.org/wiki/Granite", "passage_text": "Granite /ˈɡraenɨt/ ˈɡrænɨt is a common type of felsic intrusive igneous rock that is granular and phaneritic in. Texture granites can be predominantly, white, pink or gray in, color depending on their. mineralogy Granite differs from granodiorite in that at least 35% of the feldspar in granite is alkali feldspar as opposed to plagioclase; it is the potassium feldspar that gives many granites a distinctive pink color. The extrusive igneous rock equivalent of granite is rhyolite."}, {"url": "http://www.answers.com/Q/What_is_the_color_of_granite", "passage_text": "Granite contains quartz, amphibole, micas, and both plagioclase feldspars (generally white to gray in color) and orthoclase feldspar (usually pinkish). The amount and color of … the various minerals present in a sample can affect its color. Granites are typically pinkish/gray. In the trades the term granite is used more loosely, often describing any coarse grained igneous rock."}, {"url": "http://www.art-granite.com/article/information/Eto_interesno__Geologicheskaya_informatsiya_o_granite_.html", "passage_text": "Granite is one of the most widespread rocks in earth crust. Rocks (mountain breeds) – dense and loose masses making the Earth’s crust. Rocks (mountain breeds) consist of one material. Originally rocks (mountain breeds) are divided into igneous or magmatic. The exceptionally decorative variety of granite is amazonite (= amazon-stone) granite of green and blue-green color, containing in the structure green feldspar-amazonite (on the name of the river of Amazon, where it was first found out)."}, {"url": "http://study.com/academy/lesson/what-is-granite-definition-colors-quiz.html", "passage_text": "Granite is an igneous rock composed of mostly two minerals: quartz and feldspar. It is an intrusive rock, meaning that it crystallized from magma that cooled far below the earth's surface. Its name is derived from the Latin word 'granum', which means 'grain', a reference to the easily-seen minerals in the rock. When that happens, the granite is called a pegmatite. The overall color of granite depends largely on the kind of feldspar in the rock. Potassium-rich feldspar tends to be some shade of red or pinkish-tan, so a lot of granite is similarly red or pink."}, {"url": "http://www.answers.com/Q/What_is_the_color_of_granite", "passage_text": "Magma that is high in silica usually forms light-colored rock, such as granite. Grantis, however, comes in many shades and colors, from nearly black to light gray, red, and pi … nk. The mineral composition of granite determines its color. The amount and color of … the various minerals present in a sample can affect its color. Granites are typically pinkish/gray. In the trades the term granite is used more loosely, often describing any coarse grained igneous rock."}]