[{"url": "http://www.payscale.com/research/US/Job=Certified_Nurse_Assistant_(CNA)/Hourly_Rate", "passage_text": "Certified Nurse Assistant (CNA) Salary. (United States). The average pay for a Certified Nurse Assistant (CNA) is $10.99 per hour. Skills that are associated with high pay for this job are Telemetry, Operating Room / OR, Intensive Care Unit (ICU), and Emergency Room (ER"}, {"url": "http://www.goldenlivingcenters.com/locations-staff/CNA-SRNA-training.aspx", "passage_text": "The Golden Living CNA and SRNA Training Program is a great way to get started. We are always seeking qualified certified and state registered nursing assistants to join the caring teams at our Golden LivingCenters. For more information, please contact one of our Golden Living Training Centers below: All of your time spent in the Golden LivingCenter will be instructor-led, and you will get the opportunity to experience what it is like to care for patients. Classes are normally full-time, five days a week from 7:00 am to 8:00 pm."}, {"url": "http://www.goldenlivingcenters.com/locations-staff/CNA-SRNA-training.aspx", "passage_text": "Because Golden Living is always searching for professional, quality staff, we offer the Certified and State Registered Nursing Assistant Training Program at our special Golden Living Training Centers in California, Indiana, Missouri and Kentucky. All of your time spent in the Golden LivingCenter will be instructor-led, and you will get the opportunity to experience what it is like to care for patients. Classes are normally full-time, five days a week from 7:00 am to 8:00 pm."}, {"url": "http://www.cnaclasses.org/cna-training/cna-classes-in-mississippi/", "passage_text": "Hourly rates can vary, but at a glance, the annual salary for a Certified Nursing Assistant is $35,000 per year in Mississippi. This figure is 20% higher than the average CNA salary for the rest of the nation. You might even benefit from health and dental insurance and other paid benefits like vacation, disability, vision or sick leave coverage when you become a certified nursing assistant in Mississippi."}, {"url": "http://www.indeed.com/cmp/Golden-Living-Centers/salaries", "passage_text": "The average Golden Living Centers salary ranges from approximately $15,000 per year for Certified Nursing Assistant to $150,000 per year for Executive Director. Average Golden Living Centers hourly pay ranges from approximately $7.50 per hour for Housekeeper/Laundry to $50.00 per hour for Speech Language Pathologist. Salary information comes from 846 data points collected directly from employees, users, and jobs on Indeed"}, {"url": "http://www.ecnatraining.com/faq/cna-salary-per-hour.html", "passage_text": "Therefore on an average the salary of a certified nursing assistant ranges between $25000 and $ 35000 per year. This salary structure is beneficial for all the people working as a CNA in their respective organization. What are the best paying CNA jobs? The average salary of a CNA 2 or Patient Care Assistant is USD 38,000 per year and the CNA 3 (Patent Care Technician) is USD 45,"}, {"url": "http://nursejournal.org/certified-nursing-assistant/cna-careers-salary-outlook/", "passage_text": "Average Certified Nursing Assistant salaries for job postings in Arizona are 18% lower than average Certified Nursing Assistant salaries for job postings nationwide. The average salary ranks 43rd among states in the country. Average Certified Nursing Assistant salaries for job postings in Alabama are 1% higher than average Certified Nursing Assistant salaries for job postings nationwide. The average salary ranks 9th"}, {"url": "http://cnacareer.yolasite.com/cna-salaries.php", "passage_text": "CNA Salaries. CNA Salaries. Median annual CNA salaries were about $24,420 in May 2012. The lowest 10 percent earned a CNA salary of less than about $18,300, and the highest 10 percent earned a CNA wage of more than about $35,330. CNA and other nursing assistant salaries are included in these figures and the detailed figures below"}, {"url": "http://nursejournal.org/certified-nursing-assistant/cna-careers-salary-outlook/", "passage_text": "Average Certified Nursing Assistant salaries for job postings in Colorado are 11% lower than average Certified Nursing Assistant salaries for job postings nationwide. The average salary ranks 32nd among states in the country. Average Certified Nursing Assistant salaries for job postings in Alabama are 1% higher than average Certified Nursing Assistant salaries for job postings nationwide. The average salary ranks 9th"}]