[{"url": "http://dui.drivinglaws.org/resources/dui-refusal-blood-breath-urine-test/north-carolina.htm", "passage_text": "It usually does not help you to refuse to take a blood or breath test when you are arrested. For a first DWI in North Carolina, you will have to pay a fine, perform community service, and you could go to jail. The amount of the fine and jail time depends on how high your BAC was, whether you caused an accident, and your overall driving record."}, {"url": "http://www.mytexasdefenselawyer.com/texas-criminal-laws-penalties/dwi-laws/", "passage_text": "1 DWI with a minor – Driving while intoxicated when you have child under 15 in the vehicle is a state jail felony, punishable by 180 days to 2 years in a state jail and/or a fine of not more than $10,000. Sentencing for First Offense Drunk Driving in Texas. If convicted of DWI first offense, you are going to do at least the mandatory three days in jail – six if you had an open container when stopped – unless given probation. Fortunately, community supervision is a very likely option in many misdemeanor drunk driving cases"}, {"url": "http://www.dwitexas.com/texas-dwi-faq", "passage_text": "No, not if this is your first DWI in your lifetime. If you have a prior arrest or conviction for DWI or a BAC of .15 or greater however, you will be required to install one of these on your car to remain out of jail on bond. In Texas, if you have two or more DWI convictions (in any state) in your lifetime, you could be facing possible felony charges. The minimum felony punishment is not less than two (2) years or more that ten (10) years confinement in prison together with a fine not to exceed $10,000 or both."}, {"url": "http://www.ruaneattorneys.com/connecticut-dui-defense/faq-dui-questions/", "passage_text": "If you have not been convicted of a DUI in Connecticut or any other state, and if you have not used an AEP program in Connecticut or any other state in the past 10 years, you will qualify for the program. "}, {"url": "http://www.dwitexas.com/texas-dwi-faq", "passage_text": "If you are convicted of DWI, either by plea bargaining or losing a trial, you will be required to pay court costs and a fine by the Court. If placed on probation, you will pay a monthly probation fee ($40-$60/month). You may be required to pay for any ordered classes or chemical testing ordered in your probation. In Texas, if you have two or more DWI convictions (in any state) in your lifetime, you could be facing possible felony charges. The minimum felony punishment is not less than two (2) years or more that ten (10) years confinement in prison together with a fine not to exceed $10,000 or both."}, {"url": "http://www.missouri-criminal-defense.com/dwi/", "passage_text": "Second Offense DWI Punishment/Penalties. If you are convicted/found guilty of DWI/DUI/Drunk Driving and you have a previous conviction within the previous 5 years, you face a Class A misdemeanor, for which the penalty under Missouri law is: 1  Up to 1 year in jail, or up to a $1000 fine, or both. Third Offense Missouri DWI Punishment/Penalties. If you are convicted/found guilty of Drunk Driving and you have two previous convictions in your lifetime, you face a Class D felony, for which the penalty under Missouri law is: 1  Up to 4 years in prison, or up to a $5"}, {"url": "http://www.missouri-criminal-defense.com/dwi/", "passage_text": "First Offense Missouri DWI Penalties. If you are convicted/found guilty of DWI/DUI/Drunk Driving, you face a Class B misdemeanor, for which the penalty under Missouri law is: 1  Up to 6 months in jail, or up to a $500 fine, or both. 2  Probation for 1 to 2 years. 3  Attendance in a Substance Abuse Traffic Offender Program (SATOP). Third Offense Missouri DWI Punishment/Penalties. If you are convicted/found guilty of Drunk Driving and you have two previous convictions in your lifetime, you face a Class D felony, for which the penalty under Missouri law is: 1  Up to 4 years in prison, or up to a $50"}, {"url": "http://www.kurtzandblum.com/dwi-attorneys/will-i-go-to-jail", "passage_text": "So to give some of you a quick answer to an otherwise complex question; if you were alone in the car, have never pleaded guilty to or been convicted of DWI, and nobody was seriously injured as a result of an accident from this incident, it is highly unlikely that you will get any jail time at all. "}, {"url": "http://www.nolo.com/legal-encyclopedia/dealing-with-dui-or-dwi-30322.html", "passage_text": "Sometime after your arrest for a DUI (driving under the influence) or DWI (driving while intoxicated), you will have to appear before a judge for your arraignment. Generally, the more likely a jury is to find you guilty of driving under the influence (DUI), driving while intoxicated (DWI), or with a blood alcohol level (BAC) over .08%, the more you will want to plea bargain or negotiate a settlement with the prosecutor."}]