[{"url": "http://www.answers.com/Q/What_is_the_average_for_IQ_a_doctor", "passage_text": "Well the average IQ of a person is 100 (by definition of IQ) But I am only 11 and mine is 131, so hopefully it would be higher than that for an adult! You need to rephrase the question to get a meaningful answer. The average IQ is 100 and only a small percent have exactly that IQ. Most, however, are within the range of 8 … 5-100."}, {"url": "https://answers.yahoo.com/question/index?qid=20090228014703AAw8tVy", "passage_text": "I work in a hospital and have been associated with a number of surgeons. Surgeons are going to be above average in IQ, but there is no threshold. In fact, being a good surgeon is as much about having good spatial thinking ability and manual dexterity as it is about simple intelligence. I suppose you could say they have a sharp wit..."}, {"url": "https://answers.yahoo.com/question/index?qid=20090228014703AAw8tVy", "passage_text": "Best Answer: IQ is not what you should base a surgeon on. If you listen to a surgeon and they explain things to you in a way that you can understand then they're a great surgeon. Some doctors get high up in the vocabulary and the patient can't comprehend them. Surgeons are going to be above average in IQ, but there is no threshold. In fact, being a good surgeon is as much about having good spatial thinking ability and manual dexterity as it is about simple intelligence."}, {"url": "https://answers.yahoo.com/question/index?qid=20070622231513AAHYfEa", "passage_text": "By comparison, the perfect average. IQ is 100, with the average range being roughly 90-110. Based on this study, medical professionals skew higher in terms of IQ than any of the other occupation groups included in the study. But it also shows that there are doctors whose IQ scores fall within the average range, and that many doctors must be of above-average but not-too-unusual intelligence rather than extraordinary geniuses. Source(s): http://www.iqcomparisonsite.com/Occupati... Lamia · 8 years ago."}, {"url": "http://www.buzzle.com/articles/average-iq-score.html", "passage_text": "'Intelligence quotient' or IQ informs you about a person's intelligence. With the help of specially designed legitimate tests, it is possible to measure a person's intelligence. The average IQ is 100. A score above 100 is considered as above average, while a score below 100 is considered as a below average. An IQ score much below 50 or above 150 is usually not noticed. Studies show that the IQ of half of the population is between 90 and 110, while 25% have higher IQ's, and 25% have lower IQ's. Einstein is considered the 'only' man to have an IQ of about 160. Mensa is a society for people with higher IQ, people in the top 2% (1 in 50). Interpretation. Interpretation of IQ score is helpful in measuring certain aspects of intelligence. It reflects the level of performance of a person on a set of tasks. "}, {"url": "http://forums.studentdoctor.net/threads/physician-iq.358355/", "passage_text": "It certainly would be unscientific to say that an individual with an IQ of 110 is of high average intelligence, while an individual with an IQ of 109 is of only average intelligence. Such a strict classification of intellectual abilities would fail to take account of social elements such as home, school, and community. "}, {"url": "http://forums.studentdoctor.net/threads/can-a-person-with-a-low-iq-intelligence-make-it-through-medical-school.1107319/", "passage_text": "2. No. If your IQ is less than 110, you probably should not consider medical school. High IQ, good mcat scores, high grades, high drive, the ability to put off gratification are also required. And for most, the ability to tolerate 100k or more in student debt. "}, {"url": "http://www.answers.com/Q/What_is_the_average_for_IQ_a_doctor", "passage_text": "The average IQ for an adult is anywhere from 90 to 115. Just to give some figures the average IQ for one that has a mental disibility ranges from 30 to 50 and the IQ for one t … hat is a genius is 140 and higher. You need to rephrase the question to get a meaningful answer. The average IQ is 100 and only a small percent have exactly that IQ. Most, however, are within the range of 8 … 5-100."}, {"url": "http://anepigone.blogspot.com/2011/01/average-iq-by-occupation-estimated-from.html", "passage_text": "Anonymous said... To say that the average surgeon's IQ is 234 is completely ridiculous when 140+ is considered genius and the only people in the world to have a 230+ are the 3 highest IQ's ever recorded. You have obviously done little to no research since it took me about a whole of 10 seconds to find this out. Anyone that scores 2 SDs (meaning an IQ score of 130, at least with regard to the WAIS-IV IQ test) above the mean (IQ = 100) is considered slightly gifted, or a genius (or at least what MENSA will accept and acknowledge as genius)."}]