[{"url": "http://www.softwareshortlist.com/erp/ss-reviews/epicor/", "passage_text": "Epicor. With a powerful suite of solutions for companies in almost all industries, Epicor is a leading global player in ERP and enterprise software for mid-market firms. This review provides an overview of Epicor, its customers and capabilities, how it can help your business, and what makes it most distinctive. Epicor Software Corporation (recently combined with Activant Solutions Inc.) is a global leader delivering business software solutions to the manufacturing, distribution, retail and services industries."}, {"url": "http://finance.yahoo.com/news/epicor-announces-availability-epicor-erp-152159677.html", "passage_text": "Availability Epicor ERP version 10 is immediately available in 35 languages and 26 countries worldwide. About Epicor Software Corporation Epicor Software Corporation is a global leader delivering inspired business software solutions to the manufacturing, distribution, retail and services industries. "}, {"url": "http://panorama-consulting.com/erp-vendors/epicor-software-corporation/", "passage_text": "Epicor Software Corporation. Epicor Software is a global leader delivering business software solutions to the manufacturing, distribution, retail, hospitality and services industries. "}, {"url": "http://www.itqlick.com/epicor-erp", "passage_text": "Epicor ERP is an enterprise resource planning solution for businesses of all sizes. Its services include business intelligence, inventory management, project management, supply chain management, and others. The software was designed and launched by Epicor Software Corporation headquartered in California, United States. Epicor ERP is an enterprise resource planning solution for businesses of all sizes. Its services include business intelligence, inventory management, project management, supply chain management, and oth."}, {"url": "https://www.linkedin.com/company/epicor-software-corp", "passage_text": "AUSTIN, Texas, October 13, 2015 -- Epicor Software Corporation, a global leader in business software solutions for manufacturing, distribution, retail and services organizations, today announced Epicor customers Duncan-Parnell Inc. and Manufacturas.... Epicor delivers an entirely new approach to business software. We inspire businesses by offering choices and unprecedented flexibility. Epicor solutions free our customers from focusing on technology to focusing on what they do—their core, revenue-generating activities."}, {"url": "http://www.softwareadvice.com/manufacturing/epicor-manufacturing-software-profile/", "passage_text": "Epicor ERP is a fully integrated ERP solution with extensive functionality for accounting, inventory control, pre-production materials planning, and manufacturing execution (MES). The system is delivered either on premise, hosted, or as a cloud-based Software as a Service (SaaS) offering. "}]