[{"url": "http://stattrek.com/sampling/populations-and-samples.aspx", "passage_text": "1 A a measurable characteristic of a population, such as a mean or standard deviation, is called a parameter; but a measurable characteristic of a sample is called a statistic. 2  We will see in future lessons that the mean of a population is denoted by the symbol μ; but the mean of a sample is denoted by the symbol x. Population vs Sample. The main difference between a population and sample has to do with how observations are assigned to the data set. 1  A population includes all of the elements from a set of data. 2  A sample consists of one or more observations from the population"}, {"url": "http://smallbusiness.chron.com/difference-between-sample-population-standard-deviation-22639.html", "passage_text": "Sample Standard Deviation. A standard deviation of a sample estimates the standard deviation of a population based on a random sample. The sample standard deviation, unlike the population standard deviation, is a statistic that measures the dispersion of the data around the sample mean. Standard deviation refers to the amount of dispersion in a given data set. Researchers calculate the standard deviation of a data set by taking the square root of the variance, and the numerical result is indicated by the letter S. They use the term “variance” to describe the extent of the data spread."}, {"url": "http://onlinestatbook.com/2/sampling_distributions/samplingdist_diff_means.html", "passage_text": "Figure 2. Sampling distribution of the difference between mean heights. A difference between means of 0 or higher is a difference of 10/4 = 2.5 standard deviations above the mean of -10. The probability of a score 2.5 or more standard deviations above the mean is 0.0062. Since the standard error of a sampling distribution is the standard deviation of the sampling distribution, the standard error of the difference between means is: Just to review the notation, the symbol on the left contains a sigma (σ), which means it is a standard deviation."}, {"url": "http://onlinestatbook.com/2/sampling_distributions/samplingdist_diff_means.html", "passage_text": "For example, say that the mean test score of all 12-year-olds in a population is 34 and the mean of 10-year-olds is 25. If numerous samples were taken from each age group and the mean difference computed each time, the mean of these numerous differences between sample means would be 34 - 25 = 9. Since the standard error of a sampling distribution is the standard deviation of the sampling distribution, the standard error of the difference between means is: Just to review the notation, the symbol on the left contains a sigma (σ), which means it is a standard deviation."}, {"url": "https://statistics.laerd.com/statistical-guides/measures-of-spread-standard-deviation.php", "passage_text": "Therefore, you would normally calculate the population standard deviation if: (1) you have the entire population or (2) you have a sample of a larger population, but you are only interested in this sample and do not wish to generalize your findings to the population. "}, {"url": "http://www.differencebetween.com/difference-between-population-and-vs-sample-standard-deviation/", "passage_text": "Now to calculate the population standard deviation, we calculate deviations from the mean. The respective deviations from the mean are (70 – 71) = -1, (62 – 71) = -9, (65 – 71) = -6, (72 – 71) = 1, (80 – 71) = 9, (70 – 71) = -1, (63 – 71) = -8, (72 – 71) = 1, (77 – 71) = 6 and (79 – 71) = 8. To calculate the standard deviation of the population, first the deviations of data values from the population mean are calculated. The root mean square (quadratic mean) of deviations is called the population standard deviation."}, {"url": "https://answers.yahoo.com/question/index?qid=20110327105329AA7R1jF", "passage_text": "The difference between the sample mean and the population mean is called the. A. Population standard deviation B. Population mean C. Standard erro of the mean D. Sampling error. Follow. 2 answers 2. The difference between the sample mean and the population mean is called the. A. Population standard deviation. B. Population mean. C. Standard erro of the mean. D. Sampling error. Add your answer."}, {"url": "http://onlinestatbook.com/2/sampling_distributions/samplingdist_diff_means.html", "passage_text": "From the variance sum law, we know that: which says that the variance of the sampling distribution of the difference between means is equal to the variance of the sampling distribution of the mean for Population 1 plus the variance of the sampling distribution of the mean for Population 2. Since the standard error of a sampling distribution is the standard deviation of the sampling distribution, the standard error of the difference between means is: Just to review the notation, the symbol on the left contains a sigma (σ), which means it is a standard deviation."}, {"url": "http://stattrek.com/sampling/difference-in-means.aspx", "passage_text": "Thus, the probability that the difference between samples will be no more than 3 days is 0.035. Alternatively, we could have worked with z-scores (which have a mean of 0 and a standard deviation of 1). Here's the z-score solution: 1  Find the mean difference (male absences minus female absences) in the population. "}]