[{"url": "http://culinaryarts.about.com/od/glossary/g/Bisque.htm", "passage_text": "Definition: A bisque is a rich, creamy soup made with shellfish — specifically, bisque is traditionally made with the pureed puréed meat of, crustaceans including, lobster, crab shrimp or. crayfish When making bisque, the shells are roasted and then simmered to produce a highly flavorful stock which is then thickened. The meat itself is added to the bisque near the end of cooking. Bisque can be thickened with rice, which is the traditional method."}, {"url": "https://en.wikipedia.org/wiki/Bisque_(pottery)", "passage_text": "Capodimonte porcelain figure, c. 1790. Bisque porcelain or bisque is a type of unglazed, white porcelain, with a matte appearance and texture to the touch. It has been widely used in European pottery, mainly for objects that are not tableware and so do not need a glaze for protection. Small figurines and other decorative pieces have often been made in bisque, as well as larger portrait busts and other sculptures; the appearance of bique is very similar to that of carved and smoothed marble, the traditional prestige material for sculpture in the West."}, {"url": "http://culinaryarts.about.com/od/glossary/g/Bisque.htm", "passage_text": "Definition: A bisque is a rich, creamy soup made with shellfish — specifically, bisque is traditionally made with the pureed puréed meat of, crustaceans including, lobster, crab shrimp or. Crayfish when making, bisque the shells are roasted and then simmered to produce a highly flavorful stock which is then. thickened When making bisque, the shells are roasted and then simmered to produce a highly flavorful stock which is then thickened. The meat itself is added to the bisque near the end of cooking. Bisque can be thickened with rice, which is the traditional method."}, {"url": "http://www.thekitchn.com/whats-the-difference-between-bisque-and-chowder-word-of-mouth-207847", "passage_text": "Bisque. Bisque is a type of soup that's rich and creamy, and traditionally made from pureed shellfish. Authentic recipes ground the shells into a fine paste and use that to thicken the soup. More commonly now, bisques are thickened with rice, which can be pureed or strained out at the end of cooking. Chowder is quite a different thing altogether. Unlike bisque which is smooth, chowder is thick and chunky. Traditionally it's filled with pieces of vegetables, seafood and/or meat. It also usually includes milk or cream, and gets its thick texture from hearty vegetables, like potatoes."}, {"url": "http://colors.findthedata.com/l/833/Bisque", "passage_text": "Be the first to review. 'Bisque' is a shade of White that is 23% saturated and 100% bright. For reference purposes, Bisque has the hex value #FFE4C4. Moreover, Bisque can be referenced by the string 'Bisque' in CSS documents"}, {"url": "https://en.wikipedia.org/wiki/Bisque_%28food%29", "passage_text": "Bisque is a smooth, creamy, highly seasoned soup of French origin, classically based on a strained broth (coulis) of crustaceans. It can be made from lobster, crab, shrimp or crayfish. Also, creamy soups made from roasted and pureed puréed, fruits, vegetables or fungi are sometimes called. bisques Bisque is also sometimes used to refer to cream-based soups that do not contain seafood, in which the sometimes pre-cooked ingredients are pureed or processed in a food processor or a food mill. Common varieties include squash, tomato, mushroom, popcorn, and red pepper."}, {"url": "http://pottery.about.com/od/potterygloassary/g/bisque.htm", "passage_text": "Definition: Bisque (noun) refers to ware which has been fired once and has no chemically bonded water left in the clay. Bisque is a true ceramic material, although the clay body has not yet reached maturity. To bisque (verb) is to fire the clay for the first time. "}]