[{"url": "http://medical-dictionary.thefreedictionary.com/pilocarpine", "passage_text": "pilocarpine. An alkaloid obtained from the leaves of Pilocarpus microphyllus and other species of Pilocarpus. It is a parasympathomimetic (direct-acting cholinergic) drug, which mimics the effect of acetylcholine causing miosis and accommodation. pilocarpine. a cholinergic alkaloid from leaves of Pilocarpus jaborandi and P. microphyllus; used as an ophthalmic miotic in the form of its hydrochloride and nitrate salts."}, {"url": "http://www.medicinenet.com/pilocarpine/article.htm", "passage_text": "BRAND NAME: Salagen. DRUG CLASS AND MECHANISM: Pilocarpine is a cholinergic drug, that is, a drug that mimics the effects of the chemical, acetylcholine which is produced by nerve cells. Acetylcholine serves as a messenger between nerve cells and between nerve cells and the organs they control. PRESCRIBED FOR: Oral pilocarpine is used to treat dry mouth due to lack of saliva (xerostomia) caused by Sjoegren'sjögren s syndrome and radiation therapy to the head and. neck"}, {"url": "https://en.wikipedia.org/wiki/Pilocarpine", "passage_text": "Pilocarpine stimulates the secretion of large amounts of saliva and sweat. It is used to treat dry mouth (xerostomia), particularly in Sjoegren'sjögren s, syndrome but also as a side effect of radiation therapy for head and neck. cancer Pilocarpine is used to stimulate sweat glands in a sweat test to measure the concentration of chloride and sodium that is excreted in sweat. It is used to diagnose cystic fibrosis."}, {"url": "http://www.rxlist.com/salagen-drug.htm", "passage_text": "Each 5 mg SALAGEN® Tablet for oral administration contains 5 mg of pilocarpine hydrochloride. Inactive ingredients in the tablet, the tablet's film coating, and polishing are: carnauba wax, hypromellose, microcrystalline cellulose, stearic acid, titanium dioxide and other ingredients. Each 7.5 mg SALAGEN® Tablet for oral administration contains 7.5 mg of pilocarpine hydrochloride. Inactive ingredients in the tablet, the tablet's film coating, and polishing are: carnauba wax, hypromellose, microcrystalline cellulose, stearic acid, titanium dioxide, FD&C blue#2 aluminum lake,"}, {"url": "https://en.wikipedia.org/wiki/Pilocarpine", "passage_text": "Pilocarpine is a drug used to treat dry mouth and glaucoma. It is a parasympathomimetic alkaloid obtained from the leaves of tropical South American shrubs from the genus Pilocarpus. Pilocarpine is used to stimulate sweat glands in a sweat test to measure the concentration of chloride and sodium that is excreted in sweat. It is used to diagnose cystic fibrosis."}, {"url": "http://www.webmd.com/drugs/2/drug-78603/pilocarpine-oral/details", "passage_text": "How to use pilocarpine. Take this medication by mouth with or without food, usually 3-4 times daily, or as directed by your doctor. To reduce your risk of side effects, your doctor may direct you to start this medication at a low dose and gradually increase your dose. Follow your doctor's instructions carefully. "}, {"url": "http://www.goodrx.com/pilocarpine/what-is", "passage_text": "Pharmacologic Classification: Cholinergic. Uses For pilocarpine. Pilocarpine tablets are used to treat dryness of the mouth and throat caused by a decrease in the amount of saliva that may occur after radiation treatment for cancer of the head and neck or in patients with Sjogren's syndrome. "}, {"url": "http://www.everydayhealth.com/drugs/pilocarpine", "passage_text": "Pilocarpine affects the nervous system and increases saliva secretion in the mouth. Pilocarpine is used to treat dry mouth caused by Sjogren's syndrome, or by radiation to treat head and neck cancer. Pilocarpine may also be used for purposes not listed in this medication guide. You should not use pilocarpine if you have narrow-angle glaucoma, or asthma that is untreated or uncontrolled. You should not use pilocarpine if you are allergic to it, or if you have: 1  untreated or uncontrolled asthma; or. To make sure pilocarpine is safe for you, tell your doctor if you have: 1  asthma, chronic bronchitis, chronic obstructive pulmonary disease (COPD), or other breathing disorder; 2  glaucoma or vision problems; 3  liver disease; 4  kidney disease; 5  heart disease;"}]