[{"url": "http://www.brighthub.com/environment/science-environmental/articles/112566.aspx", "passage_text": "Conclusion. There are 264 different types of monkeys ranging in size from as small as the pygmy marmoset (4 ounces) to as large as the male mandrill (77 pounds). Smaller monkeys belong to the New World group and larger ones to the Old World. Monkeys in general, are very intelligent animals. There are two categorizations of monkeys – New World and Old World primates. They have quite a few differences; for example their eating habits, infant care, habitat, physical features, etc."}, {"url": "http://www.monkeyworlds.com/types-of-monkeys/", "passage_text": "1 Monkey Species. 2  There are more than 260 species of Monkeys found in the world today. 3  They are derived from early primates that have been around for millions of years. 4  There isn’t enough information about evolution to say with certainty how they came to be. 1 There are more than 260 species of Monkeys found in the world today. 2  They are derived from early primates that have been around for millions of years. 3  There isn’t enough information about evolution to say with certainty how they came to be. 4  Baboon."}, {"url": "http://historyofcreatures.blogspot.com/2013/04/types-of-monkeys.html", "passage_text": "Types of Monkeys. Types of monkeys are classified into two major groups, the New World primates (South and Central America) and the Old World primates (Asia and Africa). HISTORY OF CREATURES"}, {"url": "http://www.csmonitor.com/Science/2010/1214/The-top-10-monkeys/Emperor-tamarin", "passage_text": "Broadly speaking, there are two types of monkeys. Old World monkeys are native to Africa and Asia, and include familiar species such as the langur, the macaque, and the baboon. New World Monkeys, which are native to Central and South America, include marmosets, capuchins, and wooly monkeys. New World monkeys are thought to have evolved from Old World monkeys after migrating from Africa to South America on a raft of vegetation during the Oligocene period, some 23 million to 34 million years ago. But whatever. We know that you're here to find out what the best kind of monkey is."}, {"url": "http://www.livescience.com/27944-monkeys.html", "passage_text": "Monkeys live all over the world and come in various shapes, sizes and colors. As one of our closest relatives, these mammals are very intelligent and have opposable thumbs, allowing them to use tools and play games. There are more than 260 different types of monkeys. Monkeys are as varied in shape and size as humans. The world's smallest monkey is the pygmy marmoset, according to the University of Wisconsin. It weights only around 4 ounces (113 grams) and is only around 5 inches (12.7 centimeters) tall. The world's largest monkey is the mandrill."}, {"url": "http://www.brighthub.com/environment/science-environmental/articles/112566.aspx", "passage_text": "Here is an overview of different types of monkeys from both the new world and old world. We have listed a few individual species-their names, origins, features, traits, diets and what makes these amazing creatures so amusing and intriguing to the public. There are two categorizations of monkeys – New World and Old World primates. They have quite a few differences; for example their eating habits, infant care, habitat, physical features, etc."}, {"url": "https://en.wikipedia.org/wiki/Monkey", "passage_text": "Monkeys are haplorhine (dry-nosed) primates, a paraphyletic group generally possessing tails and consisting of approximately 260 known living species. Many monkey species are tree-dwelling (arboreal), although there are species that live primarily on the ground, such as baboons. Most species are also active during the day (diurnal). Monkeys are generally considered to be intelligent, particularly Old World monkeys. Lemurs, lorises, and galagos are not monkeys; instead they are strepsirrhine (wet-nosed) primates. Like monkeys, tarsiers are haplorhine primates; however, they are also not monkeys."}, {"url": "http://www.monkeyworlds.com/types-of-monkeys/", "passage_text": "1 The Howler Monkey is a large type of New World Monkey. 2  There name comes from the fact that they are louder than any other types of Monkeys. 3  Japanese Macaque. 4  The Japanese Macaque is also called the Snow Monkey. 1 There are more than 260 species of Monkeys found in the world today. 2  They are derived from early primates that have been around for millions of years. 3  There isn’t enough information about evolution to say with certainty how they came to be. 4  Baboon."}, {"url": "https://en.wikipedia.org/wiki/Monkey", "passage_text": "There are two major types of monkey: New World monkeys (platyrrhines) from South and Central America and Old World monkeys (catarrhines of the superfamily Cercopithecoidea) from Africa and Asia. Monkeys are generally considered to be intelligent, particularly Old World monkeys. Lemurs, lorises, and galagos are not monkeys; instead they are strepsirrhine (wet-nosed) primates. Like monkeys, tarsiers are haplorhine primates; however, they are also not monkeys."}]