[{"url": "https://www.kenhub.com/en/library/anatomy/the-pericardium", "passage_text": "The pericardium is a fibroserous double-walled sac that encloses the heart, the pericardial fluid and the roots of the great vessels and is situated within the middle mediastinum. Pericardium. The pericardium is a fibroserous double-walled sac that encloses the heart, the pericardial fluid and the roots of the great vessels and is situated within the middle mediastinum. Its function is to lubricate the moving surfaces of the heart."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_pericardium", "passage_text": "pericardium is a bag suuronding the heart which acts as a shock absorber. pericardium is a bag surronding the heart which acts as a shock absorber. The pericardium is the outer layer of the heart or a sack in which the heart is stored. It basically protects the heart and it's vessels. The purpose of it is to protect and lubricate the heart. the peircardium is the outermost coverin of your heart.. protects against friction rubs and protects againsts shocks(traumatic) as it contains 40-50 ml of pericardial fluid.."}, {"url": "http://beltina.org/health-dictionary/pericardium-function-definition.html", "passage_text": "What is Pericardium, definition and function. Pericardium is a tough, two-layer membranous sac that encloses the HEART. The pericardium’s fibrous outer layer, called the fibrous pericardium, protects the heart from contact with the chest wall and other structures in the chest, including the LUNGS and the sternum. The inner layer of the pericardium is a filmy envelope. Its two surfaces are the parietal pericardium, which contacts the fibrous pericardium, and the epicardium, which covers the MYOCARDIUM somewhat like a wet tissue."}, {"url": "http://biology.about.com/od/anatomy/a/aa050407a.htm", "passage_text": "Pericardial Membranes. 1  Fibrous Pericardium-the outer fibrous sac that covers the heart. 2  Parietal Pericardium-lies between the visceral pericardium and the fibrous pericardium. 3  Visceral Pericardium-also called the epicardium, this is the outer layer of the wall of the heart. The pericardium has several functions: The pericardium is divided into three layers: The pericardial cavity lies between the visceral pericardium and the parietal pericardium. This cavity is filled with pericardial fluid which serves as a shock absorber by reducing friction between the pericardial membranes."}, {"url": "https://en.wikipedia.org/wiki/Pericardium", "passage_text": "The serous pericardium, in turn, is divided into two layers, the parietal pericardium, which is fused to and inseparable from the fibrous pericardium, and the visceral pericardium, which is part of the epicardium. Both of these layers function in lubricating the heart to prevent friction during heart activity. The space between the two layers of serous pericardium (see below), the pericardial cavity, is filled with serous fluid which protects the heart from any kind of external jerk or shock. There are two layers to the pericardial sac: the outermost fibrous pericardium and the inner serous pericardium."}, {"url": "https://en.wikipedia.org/wiki/Pericardium", "passage_text": "In between the parietal and visceral pericardial layers there is a potential space called the pericardial cavity, which contains a supply of lubricating serous fluid known as the pericardial fluid. When the visceral layer comes into contact with heart (not the great vessels) it is known as the epicardium. The space between the two layers of serous pericardium (see below), the pericardial cavity, is filled with serous fluid which protects the heart from any kind of external jerk or shock. There are two layers to the pericardial sac: the outermost fibrous pericardium and the inner serous pericardium."}, {"url": "https://en.wikipedia.org/wiki/Pericardial_fluid", "passage_text": "Pericardial fluid is the serous fluid secreted by the serous layer of the pericardium into the pericardial cavity. The pericardium consists of two layers, an outer fibrous layer and the inner serous layer. "}, {"url": "https://en.wikipedia.org/wiki/Pericardium", "passage_text": "The pericardium (from the Greek περί, around and κάρδιον, heart) is a double-walled sac containing the heart and the roots of the great vessels. The pericardial sac has two layers, a serous layer and a fibrous layer. It encloses the pericardial cavity which contains pericardial fluid. The space between the two layers of serous pericardium (see below), the pericardial cavity, is filled with serous fluid which protects the heart from any kind of external jerk or shock. There are two layers to the pericardial sac: the outermost fibrous pericardium and the inner serous pericardium."}]