[{"url": "http://www.ehow.com/how_4996317_top-searched-words.html", "passage_text": "Instructions. Go to Google Trends (see resources below). Google Trends is a great way to find most popular searched words on Google. It lists the top 100 searched words and is frequently updated throughout the day. You can click on any of the search words and find out more information about it. Go to Yahoo Buzz."}, {"url": "http://abcnews.go.com/Technology/50-popular-women-web-google-search-results/story?id=10573331", "passage_text": "COED Magazine has compiled a list based on Google search results that is flying around the Internet, sporting some surprises -- Justin Bieber comes in at No. 7 -- and some givens -- Lady Gaga tops the list at No. 1. SEE PHOTOS: Celebrity Beach Bods. Here are the top 10: 1. Lady Gaga."}, {"url": "http://www.globinch.com/most-searched-words-most-popular-keywords-on-internet/", "passage_text": "In fact the title should be, 'How to find the Most searched words and Most Popular Keywords on internet'. This is true because the most searched keyword changes from time to time. So there is no keyword remains on top of the most searched words or keyword on internet. Related: Search Engine Result Page (SERP). The most searched word or keyword may very from search engine to search engine."}, {"url": "http://seattleorganicseo.com/sosblog/top-google-searches-in-2012-the-most-popular-keywords-study-version-3/", "passage_text": "2015 Update: 2014’s Version #4 of our Top Google Search Words is complete. Check out what the latest “top keyword searches are today! In late 2010, we studied for the second time, the “Most Popular Keywords” searched on the Internet."}, {"url": "http://www.globinch.com/most-searched-words-most-popular-keywords-on-internet/", "passage_text": "In fact the title should be, “ How to find the Most searched words and Most Popular Keywords on internet “. This is true because the most searched keyword changes from time to time. So there is no keyword remains on top of the most searched words or keyword on internet. Related: Search Engine Result Page (SERP). The most searched word or keyword may very from search engine to search engine."}]