[{"url": "http://www.youtube.com/watch?v=tseVt9fSYtY", "passage_text": "So i was incubating a robin egg with a home made incubator. I thought it would take 2 weeks to hatch because i bred parakeets and it took long. So because it was home made the humidity was wrong. Which because of that i had to peck the bird out of the egg because its skin was stuck to the shell."}, {"url": "http://www.answers.com/Q/What_temperature_do_you_need_to_incubate_robin_eggs", "passage_text": "Robin eggs need to be kept at a temperature of 70 to 90 degrees Fahrenheit. If they get to hot don't try to cool them off with water just let them sit in a shaded area for a while and hope that they are still alive. T~O~L."}, {"url": "http://www.answers.com/Q/What_temperature_do_you_need_to_incubate_chicken_eggs", "passage_text": "Without either of those, all you can do is mist the eggs a few times a day with water at around the incubation temperature. On day 26, the hatching period begins. The temperature should be lowered to 98.5*F. Humidity should be increased to 94%."}, {"url": "http://www.answers.com/Q/What_temperature_do_you_need_to_incubate_robin_eggs", "passage_text": "Without either of those, all you can do is mist the eggs a few times a day with water at around the incubation temperature. On day 26, the hatching period begins. The temperature should be lowered to 98.5*F. Humidity should be increased to 94%."}, {"url": "http://www.wild-bird-watching.com/bird-egg.html", "passage_text": "Even if you were successful in getting an egg to hatch, the survival chances of the young nestling would be minimal at best. Feeding a nestling would require a commitment of 16 hours a day 7 days a week for 2 weeks on average. Dietary needs of baby birds vary with species. Not all birds eat worms."}, {"url": "http://www.answers.com/Q/What_temperature_do_you_need_to_incubate_robin_eggs", "passage_text": "99.5 degrees Fahrenheit (37.5 degrees Celsius) is optimum incubating temp. for duck eggs with the temp. being lowered by one degree to 98.5 in the last 3 days of incubat … ion (25-28th day). Lowest temp. - highest temp. range is 97 - 102."}, {"url": "http://www.answers.com/Q/What_temperature_do_you_need_to_incubate_chicken_eggs", "passage_text": "Robin eggs need to be kept at a temperature of 70 to 90 degrees Fahrenheit. If they get to hot don't try to cool them off with water just let them sit in a shaded area for a w … hile and hope that they are still alive."}]