[{"url": "http://www.answers.com/Q/Does_potassium_chloride_dissolve_in_water", "passage_text": "If potassium chloride is fully dissolved in pure water, the white crystals of KCl will disappear to yield a clear solution."}, {"url": "http://www.middleschoolchemistry.com/lessonplans/chapter5/lesson3", "passage_text": "Since water is more polar than alcohol, it attracts the positive sodium and negative chloride ions better than alcohol. This is why water dissolves more salt than alcohol does. Another way of saying this is that the solubility of salt is greater in water than in alcohol."}, {"url": "http://www.middleschoolchemistry.com/lessonplans/chapter5/lesson3", "passage_text": "Project the animation Sodium Chloride Dissolving in Water. Point out that the water molecules are attracted to the sodium and chloride ions of the salt crystal. Explain that the positive area of a water molecule is attracted to a negative chloride ion."}, {"url": "http://www.800mainstreet.com/9/0009-004-solub.html", "passage_text": "A saturated KCl solution at 10oC will have 31 grams of KCl dissolved in 100 grams of water. If there are 40 grams of KCl are in the container, then there will be 9 grams of undissolved KCl remaining in the solid."}, {"url": "http://www.middleschoolchemistry.com/lessonplans/chapter5/lesson3", "passage_text": "1 Water can dissolve salt because the positive part of water molecules attracts the negative chloride ions and the negative part of water molecules attracts the positive sodium ions. 2  The amount of a substance that can dissolve in a liquid (at a particular temperature) is called the solubility of the substance."}, {"url": "http://www.funqa.com/chemistry/1045-Chemistry.html", "passage_text": "This question I don't get it. a. the Cl-ions are attracted to dissolved K+ ions. b. the Cl-ions are attracted to the partially negative oxygen atoms of the water molecule. c. the K+ ions are attracted to the Cl-ions on the KCl crystal. d. the K+ "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20110320024200AAL1eNm", "passage_text": "Best Answer: It happens because of the bonding in the two compounds. Potassium chloride is an ionic compound, meaning it has polar bonds which, in water, causes it to be dissolved, as the stronger polar bonds in water pull them apart. Potassium has metallic bonding, so it can't be pulled apart by the water."}]