[{"url": "http://www.tricountyheatingandcooling.com/home/heating_cooling_cincinnati/insights/post/20111101_whats_the_approximate_lifespan_of_a_heat-pump_system.html", "passage_text": "1 According to the Air Conditioning, Heating & Refrigeration Institute (AHRI), the average lifespan of a heat pump is approximately 14-15 years. 2  A 2006 survey by the National Association of Home Builders (NAHB) found the average life expectancy for a heat-pump system was 16 years. "}, {"url": "http://ths.gardenweb.com/discussions/2525510/sump-pump-life-preventative-replacement", "passage_text": "There is no average life span for a sump pump, just like there is no average life span for an automobile. Just like a car, it depends on how they are used. Some sump pumps run almost constantly, some never. If you are worried about it failing, install a battery back up sump pump. There are some very good ones available. "}, {"url": "http://www.improvementcenter.com/pools/swimming-pool-how-long-they-last.html", "passage_text": "Pool water heater. Life expectancy: 8 years. Replacement cost range: $730-$2,100 for natural gas heaters, $1,000+ for solar energy models, $2,000-$3,000 for electric heaters. Swimming in frigid water is no fun, and a water heater is essential to ensuring you are able to stretch how long you can use your pool. Whether you are considering a home purchase that comes with a pool or thinking about installing a pool on your current property, you probably want to know how much money replacement parts cost and what the life expectancy of swimming pools and all those parts might be."}, {"url": "http://www.orlandopoolstore.com/store/WsDefault.asp?Cat=Pumps", "passage_text": "Pumps Pool pumps keep your pool water flowing. The swimming pool pump is as vital to your pool as your heart is to your body. The average lifespan of a pool pump is about 10 years. The average lifespan of the motor on the pool pump is around 5 years. This average can be lengthened by keeping the pool pump out of the elements by building an awning or a pump room."}, {"url": "http://snippets.com/what-is-the-usual-pool-pump-life.htm", "passage_text": "An average life of a pool pump is about 10 years. The better you care for your pump the longer they will last. Be sure to keep the air vents free from things like dirt, leaves or hair. "}, {"url": "http://poolforum.com/pf2/showthread.php/6829-Average-life-expectancy-of-pump", "passage_text": "Average life expectancy of pump. I have a 6 yr old sta-rite pump that in the last two years has started to shut itself down when it gets too hot. I never noticed it doing this before. And it seems to overheat quite a bit. It will eventually turn itself back on as it cools down. Re: Average life expectancy of pump. Simple age isn't a reason for a pump to overheat. One thing to easily check is cooling. There is a fan that keeps air circulating to cool the field windings and since this is located outside it is possible critters got inside and made a home blocking some of the air passages."}, {"url": "http://www.improvementcenter.com/pools/swimming-pool-how-long-they-last.html", "passage_text": "Filter and pump. Life expectancy: 10 years. Replacement cost range: $150-$900 for filter and $450-$1,200 for pump. To keep your pool water clean and safe, you need an efficient filter and pump system. Whether you are considering a home purchase that comes with a pool or thinking about installing a pool on your current property, you probably want to know how much money replacement parts cost and what the life expectancy of swimming pools and all those parts might be."}, {"url": "http://www.inyopools.com/HowToPage/how_to_extend_the_life_of_your_swimming_pool_motor.aspx", "passage_text": "If your pool doesn’t have a lot of debris, or a screen covers it, it is unlikely that the impeller is jammed or dirty. However, if your pool does have a lot of debris and/or your pool pump basket is cracked, there is a good likelihood that your pool pump impeller may be clogged. "}, {"url": "http://www.doityourself.com/forum/pools-spas-hot-tubs/199883-how-long-should-pool-pump-last.html", "passage_text": "14 Years and still going strong. I built my pool in 2000 and put in a 2 HP 2 speed Wisperflow. It is still going strong July 2014. I have 30,000 Gal pool. I run the pump 99 % on low speed. I have an Energy SMART power saver hooked up to low speed. It cut the current from 3.3 amps to 3.0 amps. The Hayward pool pump died about 14 months afterwards. The new one has lasted about 3 years and I suspect it is in big trouble. It is making very loud noises and now it won't start. I will be bringing it in tomorrow."}]