[{"url": "http://www.nedocs.com/blog/what-is-the-average-cost-to-process-an-invoice", "passage_text": "However – there is still a disparity when comparing the top 20% to the rest. As more and more organizations realize the cost savings and process improvements that come with accounts payable automation, we will continue to see these statistics shrink. In short – there is no exact cost of processing an invoice. In a 2012 study by the Aberdeen Group, 130 enterprises were profiled to help differentiate the best-in-class AP processes from their competitors. According to the Aberdeen Group, there are 4 primary outcomes that AP automation should provide:"}, {"url": "http://www.cloudxdpo.com/accounts-payable-automation", "passage_text": "Manual accounts payable invoice processing for most organizations is inefficient, non-strategic, costly, and challenging. Not only is it error prone, the risks for organizations relying on paper based processes can be significant: 1  The average cost of processing an invoice is between $6-$15 for most organizations. 2  The average time to process an invoice is over 16 days. 3  83% of invoices are still paper based or paper dependent."}, {"url": "http://www.nedocs.com/blog/what-is-the-average-cost-to-process-an-invoice", "passage_text": "However, for the average organization, the cost to process an invoice is about $7.00. While the cost of invoice processing varies from company to company, there is one undeniable truth: Paper invoices and manual processing impedes on the efficiency of your accounts payable operations. In a 2012 study by the Aberdeen Group, 130 enterprises were profiled to help differentiate the best-in-class AP processes from their competitors. According to the Aberdeen Group, there are 4 primary outcomes that AP automation should provide:"}, {"url": "http://www.enlivensoftware.com/Portals/0/docs/Cost%20of%20Invoicing.pdf", "passage_text": "Industry analysts estimate that anywhere from 10% to 40% of all business invoices are disputed. 4 Disputes not only slow down payments, thus increasing Days Sales Outstanding, they dramatically increase the total cost of invoicing. The Gartner Group estimates that dispute settlement costs an average of $20 per invoice. 5 A second analyst puts the cost of a dispute at $10.76 per invoice, which multiples the cost per invoice by almost 4 compared to an undisputed invoice. 260 Annual Costs Labor $41,241.60 Supplies (paper, invoice, envelope, etc) $594.00 Postage costs (at $0.34 per mailing) $2,808.00 Bank charges for check processing $918.00 Total Annual Cost of Invoicing $45,561.60 Cost Per Invoice $8.44 Labor Per Invoice 34.8 minutes."}, {"url": "http://www.financialops.org/web/news/features/-/asset_publisher/X0Wf/content/How-do-you-calculate-your-cost-per-invoice", "passage_text": "Christopher Elmore, author of The 8 Pitfalls of Accounts Payable Automation, recently offered this easy process for arriving at a meaningful cost-to-process-an-invoice number. 1  Map the process. 2  Mapping is likely to be the hardest step. 3  You have to thoroughly understand the process and all the exceptions. Yes. Cost per invoice gives you a starting point when trying to determine the benefits of automating part or all of your AP process. To do that, simply refer back to the process map you created. Remove the steps that automation will take out of"}, {"url": "http://www.enlivensoftware.com/Portals/0/docs/Cost%20of%20Invoicing.pdf", "passage_text": "1 Because invoicing and receiving payments using paper checks is labor intensive, the costs to a business to process these payments is significant. For example, the total cost of invoicing for a business that sends 450 invoices per month was calculated at $45,562 per year. 260 Annual Costs Labor $41,241.60 Supplies (paper, invoice, envelope, etc) $594.00 Postage costs (at $0.34 per mailing) $2,808.00 Bank charges for check processing $918.00 Total Annual Cost of Invoicing $45,561.60 Cost Per Invoice $8.44 Labor Per Invoice 34.8 minutes."}, {"url": "http://americanmicrokc.com/how-much-does-it-cost-your-company-to-process-an-invoice/", "passage_text": "According to various research studies*, the average cost to manually process an invoice is $24. However, when you add up all of the costs associated with managing documents related to processing accounts payable documents, the cost is much higher. The studies previous mentioned have found that organizations spend on average: 1  $20 in labor to file a document"}, {"url": "http://www.apifao.com/API_Marketing.asp?DocID=197", "passage_text": "Even with that consistency, cost studies show a wide range of operating results. One benchmarking study calculated the cost to process a vendor payment ranging from $5 to $26 an invoice, while another study sited the cost ranging from $4 to $14 an invoice. If duplicate payments occur with more than half of one percent of all invoices, this can be another indication of lack of controls or an unmanaged vendor file. Benchmark results have shown that duplicate payments is generally more of a problem in smaller companies with less than 250 employees."}, {"url": "http://www.cassinfo.com/Utility-Expense-Management/Utility-Bill-Payment/Cost-To-Pay-a-Utility-Bill.aspx", "passage_text": "IOMA, the Institute of Management and Administration, publishes a leading AP benchmarking study. Its 2010 study shows the median cost to pay an invoice is $6.24, with an average of $11.63. Highly automated AP departments experienced a median cost of $5.78 per bill.*. "}, {"url": "http://www.apifao.com/API_Marketing.asp?DocID=197", "passage_text": "Best practices suggest that top performing A/P Departments process 3,339 PO invoices per A/P staffer per month. Total processing time per vendor invoice in these high performing units should average less than 3 days. This compares to the 6 days required to process an invoice in the average company. If duplicate payments occur with more than half of one percent of all invoices, this can be another indication of lack of controls or an unmanaged vendor file. Benchmark results have shown that duplicate payments is generally more of a problem in smaller companies with less than 250 employees."}]