[{"url": "http://www.whfoods.com/foodstoc.php", "passage_text": "Of course, there are many other nutritious foods other than those that we have included on our list that we feel are wonderful, health-promoting foods; if there are other whole foods-such as fruits, vegetables, nuts/seeds, whole grains, etc-that you like, by all means enjoy them. Links to the articles about these foods can be found below. In addition to questions about our foods, we often get asked about beverages and sweeteners. In the beverage category, water and green tea have been especially popular topics, and in the sweetener category, so have blackstrap molasses, honey and maple syrup."}, {"url": "http://www.huffingtonpost.com/2012/06/29/healthy-food-healthiest-list_n_1636409.html", "passage_text": "Almonds are a rich source of fiber, protein, heart-healthy fat, antioxidants and vitamins and minerals, making them a one-stop food. [They make] a great snack but watch your portion size as almonds are high in calories, warns Johnson. Stick to no more than one ounce.. That's 23 whole, shelled nuts. Berries are low in calories and are excellent sources of fiber, vitamin C, antioxidants and phytochemicals, and, according to Wixom, some research suggests they help with such divergent health challenges as age-related mental decline, heart disease, some cancers and urinary tract infections."}, {"url": "http://www.answers.com/Q/What_are_some_healthy_foods", "passage_text": "Dairy products such as eggs, milk, cheeses, yogurt, etc.  Vegetables, carrots, … squash, sweet peppers, onions, yams, tomatoes,  potatoes (skin on when you cook them is best), and ALL leafy green  veggies such as brussel sprouts, broccoli, types of lettuce. Healthy foods are not things like Taco Bell or McDonalds, or any  other fast foods, which have unhealthy preservatives. Don't let  their signs fool you. This is the type of M.S.G., hydrogenated oil,  aspartame, processed food that can damage your health."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/multimedia/health-foods/sls-20076653", "passage_text": "Give your diet a healthy boost with these 10 health foods. They're among your best bets for eating well because they meet at least three of the following criteria: "}, {"url": "http://www.huffingtonpost.com/2012/06/29/healthy-food-healthiest-list_n_1636409.html", "passage_text": "And so we turned to some of our favorite medical and nutritional experts to come up with this list of 50 of the healthiest foods, presented alphabetically. Pad your grocery list with these and you'll be on your way to a healthier, more vibrant diet. Berries are low in calories and are excellent sources of fiber, vitamin C, antioxidants and phytochemicals, and, according to Wixom, some research suggests they help with such divergent health challenges as age-related mental decline, heart disease, some cancers and urinary tract infections."}, {"url": "http://www.whfoods.com/foodstoc.php", "passage_text": "100 foods that can serve as the basis of your Healthiest Way of Eating. Links to the articles about these foods can be found below. In addition to questions about our foods, we often get asked about beverages and sweeteners. In the beverage category, water and green tea have been especially popular topics, and in the sweetener category, so have blackstrap molasses, honey and maple syrup."}, {"url": "http://www.answers.com/Q/What_are_some_healthy_foods", "passage_text": "Confidence votes 2.4K. Some healthy foods are the same as the ones that generations of school children have been told are good for them. Eat quality protein, beneficial fats and oils, fresh vegetables, fresh fruits and you can't go wrong. (Eat organic foods whenever possible.) Here are some examples of healthy foods: Also beneficial fats and oils (these are essential for health and to sustain life). Healthy foods are not things like Taco Bell or McDonalds, or any  other fast foods, which have unhealthy preservatives. Don't let  their signs fool you. This is the type of M.S.G., hydrogenated oil,  aspartame, processed food that can damage your health."}, {"url": "http://www.eatingwell.com/nutrition_health/heart_healthy_diet_center/top_15_heart_healthy_foods", "passage_text": "15 Best Heart-Healthy Foods. Eating for a healthy heart means filling your plate with fruits and vegetables, paying attention to fiber, eating fish a couple times a week and limiting unhealthy fats like saturated and trans fats, as well as salt. And although no single food is a cure-all, certain foods have been shown to improve your heart health. Find out how these 15 foods may help lower your risk of heart disease."}, {"url": "http://www.whfoods.com/foodstoc.php", "passage_text": "The World's Healthiest Foods are common everyday foods. These include the fruits, vegetables, whole grains, nuts and seeds, lean meats, fish, olive oil, herbs and spices that are familiar to most people. Although there are many foods that are exceptionally nutritious, many of them are not readily available in different areas of the country. Links to the articles about these foods can be found below. In addition to questions about our foods, we often get asked about beverages and sweeteners. In the beverage category, water and green tea have been especially popular topics, and in the sweetener category, so have blackstrap molasses, honey and maple syrup."}, {"url": "http://www.medicalnewstoday.com/articles/245259.php", "passage_text": "Second on our list of top 10 healthy foods is almonds. Almonds are rich in nutrients, including magnesium, vitamin E, iron, calcium, fiber, and riboflavin. A scientific review published in Nutrition Reviews 3 found that almonds as a food may help maintain healthy cholesterol levels. The authors wrote: Moreover, when almonds are incorporated into a healthy, balanced diet, the benefits are even greater.. Imagine a choice of foods that were tasty, nutritious and good for your health-i.e. they helped you maintain a healthy body weight, improved your overall mood, and reduced your risk of developing diseases."}]