[{"url": "http://www.sciential.net/lingual_nerve_injury_from_anesth.htm", "passage_text": "Lingual Nerve Injury from Anesthetic Injections. Damage to the lingual nerve results in pain within the tongue and along the mucosa on tongue side of the teeth (inner buccal mucosa). The pain can be burning, dull, achy or a combination. You may also have numbness as the only symptom, or can have a combination of numbness and pain. "}, {"url": "http://emedicine.medscape.com/article/1873373-overview", "passage_text": "Diagram of the third branch (mandibular) of the trigeminal nerve with its branches. The mandibular nerve carries sensory information from the lower lip, the lower teeth, gums, the chin and jaw (except the angle of the mandible, which is supplied by C2-C3), parts of the external ear, and parts of the meninges. (See the image below.) The maxillary nerve is divided into 3 branches: the zygomatic, pterygopalatine (or sphenopalatine), and posterior superior alveolar nerves. Diagram of the second branch (maxillary"}, {"url": "http://www.mccullochlaw.net/nerve_injury/lingual_nerve/index.html", "passage_text": "Image #4: Path of the lingual nerve which tracks to the inside of the mandible (lower jaw). There is a boney barrier between the third molar and the lingual nerve called the lingual plate (Image #5) which the lingual nerve runs along on the lingual side (tongue side). Image #5: Lingual nerve in relation to the lingual plate and third molar. Anatomy of the Lingual Nerve. The lingual nerve is a branch of the mandibular division of the trigeminal nerve supplying the anterior two thirds of the tongue and responding to stimuli of pressure, touch, and temperature (Image #1 & 2)."}, {"url": "http://www.medscape.com/viewarticle/462066_2", "passage_text": "The lingual nerve is a branch of the third division of the trigeminal nerve. Although injury to the first or second trigeminal divisions may occur, this is less common (with the exception of herpes zoster, which typically affects the first division). Lingual nerve injury causing numbness, dysesthesia, paresthesia, and dysgeusia may complicate invasive dental and surgical therapies."}, {"url": "http://www.mccullochlaw.net/nerve_injury/lingual_nerve/index.html", "passage_text": "The lingual nerve runs to the medial (inside of the mandible or lower jaw) and next to the inferior alveolar nerve (Image #2) as they move towards the ramus of the mandible. Image #3: Mandibular Nerve with the lingual nerve and the inferior alveolar nerve. The lingual nerve takes the inside track next to the mandible and runs next to the third molar (wisdom tooth or teeth No. 17 on the left and No. 32 on the right-Image #3) on the lingual side (tongue side) of the third molar(Image #5). Anatomy of the Lingual Nerve. The lingual nerve is a branch of the mandibular division of the trigeminal nerve supplying the anterior two thirds of the tongue and responding to stimuli of pressure, touch, and temperature (Image #1 & 2)."}, {"url": "http://emedicine.medscape.com/article/1873373-overview", "passage_text": "The semilunar (gasserian or trigeminal) ganglion is the great sensory ganglion of CN V. It contains the sensory cell bodies of the 3 branches of the trigeminal nerve (the ophthalmic, mandibular, and maxillary divisions). The ophthalmic and maxillary nerves are purely sensory. (See the image below.) The maxillary nerve is divided into 3 branches: the zygomatic, pterygopalatine (or sphenopalatine), and posterior superior alveolar nerves. Diagram of the second branch (maxillary) of the trigeminal nerve with its branches."}, {"url": "https://en.wikipedia.org/wiki/Lingual_nerve", "passage_text": "Any injury to sensory nerves can result in pain, altered sensation and or numbness, but usually a combination of all 3 symptoms arises. This can have a significant negative effect on the patients quality of life affecting their daily function and psychological health of sufferers. Warning of patients of nerve injury prior to administration of deep dental injections has a risk of injury in approximately 1:14,000 with 25% of these remaining persistent. Routine preoperative warnings about these injuries is routinely undertaken in the US and Germany."}, {"url": "https://en.wikipedia.org/wiki/Chorda_tympani", "passage_text": "The chorda tympani is a branch of the facial nerve that originates from the taste buds in the front of the tongue, runs through the middle ear, and carries taste messages to the brain. "}, {"url": "https://en.wikipedia.org/wiki/Lingual_nerve", "passage_text": "The lingual nerve supplies general somatic afferent innervation from the mucous membrane of the anterior two-thirds of the tongue, while the posterior one-third is innervated by the glossopharyngeal. Warning of patients of nerve injury prior to administration of deep dental injections has a risk of injury in approximately 1:14,000 with 25% of these remaining persistent. Routine preoperative warnings about these injuries is routinely undertaken in the US and Germany."}]