[{"url": "http://www.answers.com/Q/What_kinds_of_cases_are_brought_before_the_Supreme_Court", "passage_text": "The Supreme Court reviews the cases and determines which ones they will hear, they have the ability to decline to review a case. The Supreme Court doesn't hear only appeals, there are situations where it is the court of original jurisdiction. Confidence votes 37.0K. The Supreme Court decides cases that are appealed by a lower court; a lower court has made a decision and one of the parties feels strongly enough that the decision was wrong that they make an appeal to the Supreme Court."}, {"url": "http://www.uscourts.gov/about-federal-courts/educational-resources/about-educational-outreach/activity-resources/supreme-1", "passage_text": "Original jurisdiction means that the Supreme Court is the first, and only, Court to hear a case. The Constitution limits original jurisdiction cases to those involving disputes between the states or disputes arising among ambassadors and other high-ranking ministers. Article III, Section 1 of the Constitution establishes the Supreme Court of the United States. Currently, there are nine Justices on the Court. Before taking office, each Justice must be appointed by the President and confirmed by the Senate."}, {"url": "http://www.uscourts.gov/about-federal-courts/educational-resources/about-educational-outreach/activity-resources/about", "passage_text": "Article III, Section II of the Constitution establishes the jurisdiction (legal ability to hear a case) of the Supreme Court. The Court has original jurisdiction (a case is tried before the Court) over certain cases, e.g., suits between two or more states and/or cases involving ambassadors and other public ministers. The best-known power of the Supreme Court is judicial review, or the ability of the Court to declare a Legislative or Executive act in violation of the Constitution, is not found within the text of the Constitution itself. The Court established this doctrine in the case of Marbury v. Madison (1803)."}, {"url": "https://en.wikipedia.org/wiki/Procedures_of_the_Supreme_Court_of_the_United_States", "passage_text": "For general discussion of the court's jurisdiction and composition, see Supreme Court of the United States; for discussion of the court's present and historical accommodations, see United States Supreme Court building; for discussion of the history of the court, see history of the Supreme Court of the United States. In nearly all of the cases heard by the Supreme Court, the Court exercises the appellate jurisdiction granted it by Article III of the Constitution. This authority permits the Court to review—and affirm or overturn—decisions made by lower courts and tribunals."}, {"url": "http://litigation.findlaw.com/legal-system/how-does-the-u-s-supreme-court-decide-whether-to-hear-a-case.html", "passage_text": "Assuming the case is capable of being heard by the U.S. Supreme Court, the first step, most of the time, is to file a lawsuit in your local state or federal court. The trial judge would hear evidence and consider legal arguments from each side before making a decision. While no one really knows why some cases get heard but others do not, the Supreme Court has several factors that it considers when deciding what cases to hear: 1  The Court will Hear Cases to Resolve a. : 2  The U.S. judicial system consists of 13 federal circuits and 50 state supreme courts."}, {"url": "https://en.wikipedia.org/wiki/Procedures_of_the_Supreme_Court_of_the_United_States", "passage_text": "The Supreme Court of the United States is the highest federal court in the United States and the only court specifically established by the Constitution of the United States, implemented in 1789. This article is concerned with the process and procedures used by the modern court. In nearly all of the cases heard by the Supreme Court, the Court exercises the appellate jurisdiction granted it by Article III of the Constitution. This authority permits the Court to review—and affirm or overturn—decisions made by lower courts and tribunals."}, {"url": "http://www.pbs.org/wgbh/aia/part4/4p2932.html", "passage_text": "Dred Scott first went to trial to sue for his freedom in 1847. Ten years later, after a decade of appeals and court reversals, his case was finally brought before the United States Supreme Court. Scott and his lawyers then brought his case to a federal court, the United States Circuit Court in Missouri. In 1854, the Circuit Court upheld the decision of the Missouri Supreme Court. There was now only one other place to go. Scott appealed his case to"}, {"url": "https://en.wikipedia.org/wiki/List_of_United_States_Supreme_Court_cases", "passage_text": "This is a list of cases decided by the United States Supreme Court. This list does not contain every case decided by the Court. For all cases, see Lists of United States Supreme Court cases by volume. "}]