[{"url": "http://www.jobs.ac.uk/categories/research-technician-jobs", "passage_text": "Placed on: 02-10-2015 Salary: The starting salary will be from £19,632 on Grade D, depending on qualifications and experience. Hours: Part time, weekends The College of Life and Environmental Sciences is looking to recruit a new part-time (12 hours per week) Technician (Research). Refine your Research Technician jobs search. This is just a selection of jobs that are currently available on jobs.ac.uk, to see all a full job list and to refine your job search by keywords, salary or location please visit the Research Technician jobs page."}, {"url": "http://www.healthcare-salaries.com/technicians/research-technician-salary", "passage_text": "Based on the employment sector, an average salary for a research technician employed in a general company ranges from $32,400 to $54,000 per year according to PayScale whereas those employed in federal government agencies received an equal salary ranging from $25,000 to $51,400 per year. According to payscale, an average salary for a research technician ranges from between $26,583 – $49,972 per year and an yearly bonus of about $2,047 will be offered based on the type of job. The total national mean salary ranges from between $25,002 – $49,666 per annum. 1  Share on Facebook."}, {"url": "http://www.payscale.com/research/US/Job=Research_Technician/Salary", "passage_text": "Research Technician Salary. (United States). The average pay for a Research Technician is $37,650 per year. A skill in Biotechnology is associated with high pay for this job. Most people move on to other jobs if they have more than 10 years' experience in this career. A great deal of a research technician's work will require on-the-job training. As such, they are usually assigned to a mentor who will train them and provide feedback. To become a research technician, a bachelor’s degree in a major related to the research field is usually preferred."}, {"url": "http://www.healthcare-salaries.com/technicians/research-technician-salary", "passage_text": "Conclusion about research technician salary. According to payscale, an average salary for a research technician ranges from between $26,583 – $49,972 per year and an yearly bonus of about $2,047 will be offered based on the type of job. The total national mean salary ranges from between $25,002 – $49,666 per annum. 1  Share on Facebook. 2  Share on Twitter"}, {"url": "http://www.indeed.com/salary/Research-Technician.html", "passage_text": "Average Research Technician salaries for job postings nationwide are 44% lower than average salaries for all job postings nationwide. "}, {"url": "http://www1.salary.com/Science-and-Research-Salaries.html", "passage_text": "Well there are a wide range of jobs in the Science and Research category and their pay varies greatly. If you know the pay grade of the job you are searching for you can narrow down this list to only view Science and Research jobs that pay less than $30K, $30K-$50K, $50K-$80K, $80K-$100K, or more than $100K."}, {"url": "http://www.salarylist.com/jobs/Research-Technician-II-Salary.htm", "passage_text": "Research Technician II Salary. Research Technician II average salary is $31,728, median salary is $30,406 with a salary range from $20,000 to $398,000. Research Technician II salaries are collected from government agencies and companies. Each salary is associated with a real job position. "}, {"url": "http://www.payscale.com/research/US/Job=Research_Laboratory_Technician/Salary", "passage_text": "Median of all compensation (including tips, bonus, and overtime) by years of experience. Experience seems to be a major factor in determining the incomes of Research Laboratory Technicians. Salaries for inexperienced workers average out to $40K, and those with five to 10 years' experience earn a higher median of $34K. Research Laboratory Technicians who work for 10 to 20 years in their occupation tend to earn about $45K. Seasoned workers who boast more than two decades of relevant experience enjoy a median salary of $56K, which is substantially larger than the medians reported by folks with fewer years on their resume"}]