[{"url": "http://www.mayoclinic.org/diseases-conditions/personality-disorders/basics/symptoms/con-20030111", "passage_text": "When to see a doctor. If you have any signs or symptoms of a personality disorder, see your doctor, mental health provider or other health care professional. Untreated, personality disorders can cause significant problems in your life that may get worse without treatment. 1  Definition. 2  Causes. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/personality-disorders/basics/definition/CON-20030111", "passage_text": "A personality disorder is a type of mental disorder in which you have a rigid and unhealthy pattern of thinking, functioning and behaving. A person with a personality disorder has trouble perceiving and relating to situations and to people. This causes significant problems and limitations in relationships, social encounters, work and school."}, {"url": "https://en.wikipedia.org/wiki/Mental_disorder", "passage_text": "A mental disorder, also called a mental illness, psychological disorder or psychiatric disorder, is mental or behavioral pattern that causes either suffering or a poor ability to function in ordinary life. Many disorders are described. Conditions that are excluded include social norms. Mental disorders are usually defined by a combination of how a person feels, acts, thinks or perceives. This may be associated with particular regions or functions of the brain, often in a social context. A mental disorder is one aspect of mental health."}, {"url": "http://www.nimh.nih.gov/health/topics/borderline-personality-disorder/index.shtml", "passage_text": "Borderline personality disorder (BPD) is a serious mental illness marked by unstable moods, behavior, and relationships. In 1980, the Diagnostic and Statistical Manual for Mental Disorders, Third Edition (DSM-III) listed BPD as a diagnosable illness for the first time. While mental health experts now generally agree that the name borderline personality disorder is misleading, a more accurate term does not exist yet. Most people who have BPD suffer from: 1  Problems with regulating emotions and thoughts. 2  Impulsive and reckless behavior. 3  Unstable relationships with other people."}, {"url": "http://mentalhealth.com/home/dx/borderlinepersonality.html", "passage_text": "Course The course of Borderline Personality Disorder is quite variable. Borderline personality disorder is likely to remit (50% by 2 years, and 85% by 10 years), and once it remits, it usually does not relapse. Unfortunately, after 10 years, only about 20% have stable relationships or full-time employment. "}, {"url": "http://www.nimh.nih.gov/health/topics/borderline-personality-disorder/index.shtml", "passage_text": "In some cases, co-occurring mental illnesses may have symptoms that overlap with BPD, making it difficult to distinguish borderline personality disorder from other mental illnesses. For example, a person may describe feelings of depression but may not bring other symptoms to the mental health professional's attention. While mental health experts now generally agree that the name borderline personality disorder is misleading, a more accurate term does not exist yet. Most people who have BPD suffer from: 1  Problems with regulating emotions and thoughts. 2  Impulsive and reckless behavior. 3  Unstable relationships with other people."}, {"url": "http://psychcentral.com/disorders/borderline-personality-disorder-symptoms/", "passage_text": "Personality disorders such as borderline personality disorder are typically diagnosed by a trained mental health professional, such as a psychologist or psychiatrist. Family physicians and general practitioners are generally not trained or well-equipped to make this type of psychological diagnosis. Many people with borderline personality disorder don’t seek out treatment. People with personality disorders, in general, do not often seek out treatment until the disorder starts to significantly interfere or otherwise impact a person’s life."}, {"url": "http://www.mayoclinic.org/diseases-conditions/personality-disorders/basics/definition/CON-20030111", "passage_text": "In some cases, you may not realize that you have a personality disorder because your way of thinking and behaving seems natural to you. And you may blame others for the challenges you face. Personality disorders usually begin in the teenage years or early adulthood. There are many types of personality disorders. A person with a personality disorder has trouble perceiving and relating to situations and to people. This causes significant problems and limitations in relationships, social encounters, work and school."}, {"url": "http://www.nami.org/Learn-More/Mental-Health-Conditions/Borderline-Personality-Disorder", "passage_text": "Borderline personality disorder (BPD) is a condition characterized by difficulties in regulating emotion. This difficulty leads to severe, unstable mood swings, impulsivity and instability, poor self-image and stormy personal relationships. "}]