[{"url": "https://en.wikipedia.org/wiki/Metabolic_syndrome", "passage_text": "Metabolic syndrome is associated with the risk of developing cardiovascular disease and diabetes. Some studies have shown the prevalence in the USA to be an estimated 34% of the adult population, and the prevalence increases with age. The International Diabetes Federation consensus worldwide definition of the metabolic syndrome (2006) is: Central obesity (defined as waist circumference # with ethnicity-specific values) AND any two of the following:"}, {"url": "http://www.mayoclinic.org/diseases-conditions/inherited-metabolic-disorders/basics/definition/CON-20036708", "passage_text": "Appointments & care. At Mayo Clinic, we take the time to listen, to find answers and to provide you the best care. Inherited metabolic disorders refer to different types of medical conditions caused by genetic defects — most commonly inherited from both parents — that interfere with the body's metabolism. These conditions may also be called inborn errors of metabolism. Inherited metabolic disorders fall into different categories, depending on the specific substance and whether it builds up in harmful amounts (because it can't be broken down), it's too low, or it's missing. Some metabolic disorders can be diagnosed by routine screening tests done at birth."}, {"url": "http://www.heart.org/HEARTORG/Conditions/More/MetabolicSyndrome/Metabolic-Syndrome_UCM_002080_SubHomePage.jsp", "passage_text": "About Metabolic Syndrome. Metabolic syndrome is a combination of factors that multiply a person's risk for heart disease, diabetes and stroke. Almost 34% of American adults are affected. Metabolic syndrome is dangerous because when individual risk factors are seen together in a person, the likelihood increases for cardiovascular problems and diabetes. Your Risk for"}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/ms/", "passage_text": "Metabolic (met-ah-BOL-ik) syndrome is the name for a group of risk factors that raises your risk for heart disease and other health problems, such as diabetes and stroke. The term metabolic refers to the biochemical processes involved in the body's normal functioning. The risk of having metabolic syndrome is closely linked to overweight and obesity and a lack of physical activity. Insulin resistance also may increase your risk for metabolic syndrome."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7667", "passage_text": "Metabolic diseases, inherited: Also called inborn errors of metabolism, these are heritable (genetic) disorders of biochemistry. Examples include albinism, cystinuria (a cause of kidney stones), phenylketonuria (PKU), and some forms of gout, sun sensitivity, and thyroid disease. "}, {"url": "http://www.idf.org/metabolic-syndrome", "passage_text": "IDF Worldwide Definition of the Metabolic Syndrome. The metabolic syndrome is a cluster of the most dangerous heart attack risk factors: diabetes and prediabetes, abdominal obesity, high cholesterol and high blood pressure. Documents related to the IDF consensus worldwide definition of the metabolic syndrome (adults): 1  Rationale behind the IDF definition (pdf, 81KB). 2  The consensus workshop (pdf, 78KB). 3  Diabetes and the metabolic syndrome (pdf, 114KB). 4  Frequently asked questions. 5  Order a print copy of the IDF consensus."}, {"url": "https://en.wikipedia.org/wiki/Metabolic_syndrome", "passage_text": "Metabolic syndrome and prediabetes may be the same disorder, just diagnosed by a different set of biomarkers. The syndrome is thought to be caused by an underlying disorder of energy utilization and storage. The International Diabetes Federation consensus worldwide definition of the metabolic syndrome (2006) is: Central obesity (defined as waist circumference # with ethnicity-specific values) AND any two of the following:"}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/ms/", "passage_text": "Your risk for heart disease, diabetes, and stroke increases with the number of metabolic risk factors you have. In general, a person who has metabolic syndrome is twice as likely to develop heart disease and five times as likely to develop diabetes as someone who doesn't have metabolic syndrome. Other risk factors, besides those described above, also increase your risk for heart disease. The risk of having metabolic syndrome is closely linked to overweight and obesity and a lack of physical activity. Insulin resistance also may increase your risk for"}, {"url": "https://en.wikipedia.org/wiki/Metabolic_syndrome", "passage_text": "Metabolic syndrome is also known as metabolic syndrome X, cardiometabolic syndrome, syndrome X, insulin resistance syndrome, Reaven's syndrome (named for Gerald Reaven), and CHAOS (in Australia). The International Diabetes Federation consensus worldwide definition of the metabolic syndrome (2006) is: Central obesity (defined as waist circumference # with ethnicity-specific values) AND any two of the following:"}]