[{"url": "http://culinaryarts.about.com/od/glossary/g/Calamari.htm", "passage_text": "In the culinary arts, calamari is a recipe prepared with squid, usually (but not always) battered and deep-fried. Calamari is the Italian word for squid (singular: calamaro), and recipes for fried calamari are found in a number of Mediterranean cuisines. Fried calamari is usually served as an appetizer, garnished with lemon and parsley and served with some sort of dipping sauce. Typical sauces for calamari include marinara sauce, flavored mayonnaise or aioli, tartar sauce or yogurt. In addition to frying, calamari can also be sauteed, grilled, boiled or braised."}, {"url": "http://www.answers.com/Q/What_is_calamari_fritti", "passage_text": "The word calamari means squid in Italian, while fritti roughly means fried.. The name describes the primary ingredient of the dish and how it is prepared. Preparation. To make calamari fritti, the body of the squid is cut into rings, dipped in egg and flour and then deep-fried in oil."}, {"url": "http://www.wisegeek.org/what-is-calamari.htm", "passage_text": "Fried calamari is one of the most popular preparations, and is what many people think of when they hear the term. Most dishes of this type focus almost exclusively on the animal’s tentacles; chefs will slice them to form rings, then dip them in a batter of herbs, breadcrumbs, or spices before frying them in oil or fat."}, {"url": "http://www.differencebetween.net/science/nature/difference-between-squid-and-calamari/", "passage_text": "Calamari also is a popular sea food. Though many think squid and calamari are the same, both are different. Some even say that calamari is just the Italian word used for squid. There are over 500 species of squids and these are found in varying shapes, sizes, and weights."}, {"url": "http://www.wisegeek.org/what-is-calamari.htm", "passage_text": "Calamari is the Italian word for “ squid ” and is commonly used to describe a number of dishes that feature this sea animal. In the United States the term is most frequently associated with fried presentations, though this is by no means the only appropriate use."}, {"url": "http://homecooking.about.com/od/cookingfaqs/f/faqcalamari.htm", "passage_text": "Answer: Calamari is indeed squid. The squid is a mollusk related to the cuttlefish and octopus. It has ten tentacles, and like its cousin, the octopus, it also has a protective mechanism which releases a dark ink into the water when it senses danger. The meat is firm and white with a mild, slightly sweet and almost nutty flavor."}]