[{"url": "http://inqueery.com/html/science_and_homosexuality.html", "passage_text": "It s important to stress what I didn t find. I did not prove that homosexuality is genetic, or find a genetic cause for being gay. I didn t show that gay men are born that way, the most common mistake people make in interpreting my work."}, {"url": "http://www.mygenes.co.nz/summary.htm", "passage_text": "Identical twins with identical genes are about 11-14% concordant for SSA. If homosexuality were genetic, identical co-twins of homosexual men and women would also be homosexual 100% of the time. In classic twin studies the genetic fraction is less than 23% for men and 37% for women, and may be as low as 10%."}, {"url": "http://www.cnn.com/CNN/Programs/anderson.cooper.360/blog/2007/02/can-people-change-from-gay-to-straight.html", "passage_text": "You are all buffoons. There is no such thing as gay or straight - you should change the topic of this debate to focus on why we think people have to be one of two polarized choices. 'Homosexual' and 'heterosexual' are adjectives, not nouns. This story hinges on a ridiculous framework of discussion."}, {"url": "http://inqueery.com/html/science_and_homosexuality.html", "passage_text": "There are numerous theories about the origins of a person's sexual orientation; most scientists today agree that sexual orientation is most likely the result of a complex interaction of environmental, cognitive and biological factors. In most people, sexual orientation is shaped at an early age."}, {"url": "http://www.pureintimacy.org/a/are-people-really-born-gay/", "passage_text": "Not by a long shot. While it's true that many homosexuals and their allies believe that people are born gay and cannot change, there exists a surprising – and not insignificant – minority of gays and lesbians who recognize that sexual orientation is, in fact, flexible."}, {"url": "http://www.pureintimacy.org/a/are-people-really-born-gay/", "passage_text": "In sum, there is no scientific or DNA test to tell us if a person is homosexual, bisexual or even heterosexual for that matter. And since nobody is born gay, it's clear that sexual orientation is, at its core, a matter of how one defines oneself – not a matter of biology or genes."}, {"url": "http://www.usnews.com/news/articles/2012/12/11/scientists-may-have-finally-unlocked-puzzle-of-why-people-are-gay", "passage_text": "Though scientists have long suspected some sort of genetic link, Rice says studies attempting to explain why people are gay have been few and far between. [ READ: Sen. Hatch Wants to Show Mormons Are Christians ]. Most mainstream biologists have shied away from studying it because of the social stigma, he says."}, {"url": "http://inqueery.com/html/science_and_homosexuality.html", "passage_text": "Most researchers, by this time, have come to the conclusion that sexual orientation is likely determined by a complex interaction between a person s genetic make-up and their environment. However, there are still some who claim that science has found a gay gene."}]