[{"url": "http://www.oceanmist.com/artichokes/boil-artichoke/", "passage_text": "Cover the pot with the lid and let Artichokes cook at a high simmer on stove until they are tender. Cooking time can vary, depending on the size of the Artichokes. A good approximation is 30 minutes for a Medium-sized Artichoke or 45 minutes for a Jumbo-sized Artichoke. Prep Time: 5 mins Cook Time: 30 mins. Boiling fresh Artichokes is one of the original and classic ways to cook the veggie. Plus, a lot of restaurants still use this method today! Bring a large pot of salted water to a boil."}, {"url": "http://kitchen-parade-veggieventure.blogspot.com/2008/04/how-to-cook-artichokes-in-microwave.html", "passage_text": "But I still don't think it's that tricky to cook the artichokes. All we do is cut the stem off and then set them upright in a large pot with about a quarter inch of boiling water in the bottom; cover and steam for about 20 minutes-until we can easily put a fork through the bottom of an artichoke. "}, {"url": "http://www.wikihow.com/Steam-Artichokes", "passage_text": "4. Cook 25 to 35 minutes. Steam the artichokes until you can pierce the artichoke hearts with the tip of a paring knife and easily pull the inner leaves out with your fingers or a pair of tongs. "}, {"url": "http://www.wikihow.com/Cook-Artichokes", "passage_text": "1 Place a couple inches (4 cm) of water into a pot to boil with a steaming basket on top. 2  Add some lemon juice and salt to flavor the water if you prefer. 3  Drop the artichokes into the pot once the water begins to boil and steam for 15 to 20 minutes. 4  Drain artichokes with the stem up before serving. Boil the artichokes for the most traditional method of cooking them. 1  Put a large pot of water on the stove to boil and add salt. 2  Drop the artichokes carefully into the pot once the water begins to boil and leave them to cook for 30 to 45 minutes. 3"}, {"url": "http://cookingequipment.about.com/od/pressurecookerrecipes/qt/PressureCookerArtichokes.htm", "passage_text": "Using a pressure cooker will yield tender steamed artichokes in only 15 minutes, a vast improvement from the hour or so it takes to cook a large artichoke in a steamer. A 6-quart pressure cooker will hold 3 or 4 medium artichokes. Be sure to use. Here's how to make pressure cooker artichokes: "}, {"url": "http://localfoods.about.com/od/preparationtips/qt/steamingartichokes.htm", "passage_text": "1 Bring about 1/2 inch water to a boil in a pan deep enough to hold the artichoke(s) standing up. 2  Add a teaspoon or two of salt (the artichoke will just be sitting it in, not submerged). 3  Set artichokes in the salted boiling water, cover the pan, reduce heat to maintain a steady simmer, and cook 20 minutes. Stove-Top Steaming: The true boiling water and moisture maintained by steaming artichokes on the stove-top more than makes up for the extra time it takes, in my opinion. 1 "}, {"url": "http://moroccanfood.about.com/od/soupsandappetizers/r/steamed_artichokes.htm", "passage_text": "Place the artichokes in a steamer basket over the boiling water and cover the pot. Steam the artichokes until tender – up to an hour with a conventional pot, or 20 to 30 minutes with a pressure cooker. Exactly how long will depend on the size of the artichokes. "}, {"url": "http://www.wikihow.com/Cook-Artichokes", "passage_text": "Steam your artichokes for less cooking time and to preserve more of their nutrients. 1  Place a couple inches (4 cm) of water into a pot to boil with a steaming basket on top. 2  Drop the artichokes into the pot once the water begins to boil and steam for 15 to 20 minutes. 3  Drain artichokes with the stem up before serving. Boil the artichokes for the most traditional method of cooking them. 1  Put a large pot of water on the stove to boil and add salt. 2  Drop the artichokes carefully into the pot once the water begins to boil and leave them to cook for 30 to 45 minutes."}, {"url": "http://www.simplyrecipes.com/recipes/how_to_cook_and_eat_an_artichoke/", "passage_text": "Cover. Bring to a boil and reduce heat to simmer. Cook for 25 to 45 minutes or until the outer leaves can easily be pulled off. Note: artichokes can also be cooked in a pressure cooker (about 15-20 minutes cooking time). Cooking time depends on how large the artichoke is, the larger, the longer it takes to cook. 2 Slice about 3/4 inch to an inch off the tip of the artichoke. 3 Pull off any smaller leaves towards the base and on the stem. 4 Cut excess stem, leaving up to an inch on the artichoke. The stems tend to be more bitter than the rest of the artichoke, but some people like to eat them."}]