[{"url": "http://www.ncbi.nlm.nih.gov/pubmed/7426352/", "passage_text": "They are comparatively young and their asthma is predominantly extrinsic. The amount of sulphur dioxide in foods is limited by regulation in the UK, by directive in the EEC, and by recommendations to 'good manufacturing practice' in the USA. A list is given of foods and beverages commonly containing sulphur dioxide."}, {"url": "http://healthyeating.sfgate.com/health-risks-sulfur-dioxide-dried-fruits-3921.html", "passage_text": "Dried fruit can cause respiratory problems if you have sulfite sensitivity. Sulfur dioxide might not sound good enough to eat, but this food preservative does make its way into a number of edibles, including dried fruits such as raisins, dried apricots and prunes."}, {"url": "http://livewell.jillianmichaels.com/list-foods-contain-sulfur-5102.html", "passage_text": "Sulfur is a mineral found in the ground around volcanic craters and hot springs and occurs naturally in some plants, including grains, fruits and vegetables. Protein foods also contain sulfur, which may put vegetarians at risk for developing a sulfur deficiency. The mineral helps form muscles, hair and skin cells."}, {"url": "https://www.fsai.ie/faq/additives/sulphur_dioxide_sulphites.html", "passage_text": "What foods are permitted to contain sulphur dioxide and sulphites? Sulphur dioxide and sulphites are permitted in a wide range of foods including dried fruits, breakfast sausages and burger meats (with a minimum vegetable and/or cereal content of 4%)."}, {"url": "http://livewell.jillianmichaels.com/lowsulfur-diets-5231.html", "passage_text": "Read nutrition labels on processed foods because these might contain sulfites. Sulfur dioxide, potassium bisulfite or sodium bisulfite on the ingredients list of packaged foods indicates the presence of sulfites. Jams, potato chips, condiments and canned and frozen foods generally have sulfite additives."}, {"url": "https://www.allergyuk.org/sulphites-and-airway-symptoms/sulphites-and-airway-symptoms", "passage_text": "Sulphites work as food preservatives by releasing sulphur dioxide, a gas. Sulphur dioxide is an irritant gas that can cause the airway to become irritated and constricted. It is thought that in most people sensitive to sulphites, the gas is released when sulphite-containing foods interact with acid in the stomach."}, {"url": "http://healthyeating.sfgate.com/health-risks-sulfur-dioxide-dried-fruits-3921.html", "passage_text": "Dried fruits are among the foods highest in sulfites, with raisins and prunes containing between 500 and 2,000 parts per million, Dr. Gregory Moeller möller of The university Of iowa. Reports by, comparison -- wine a food thought by many to be high in -- sulfites contains between 20 and 350 parts per. million"}, {"url": "http://livewell.jillianmichaels.com/list-foods-contain-sulfur-5102.html", "passage_text": "Meats including beef, chicken and fish contain sulfur. Legumes, such as beans and jicama also contain protein and sulfur. Nuts such as walnuts, almonds, cashews, as well as certain seeds, such as sesame seeds and sunflower seeds,"}]