[{"url": "http://www.ehow.com/facts_5038230_wobenzym-used.html", "passage_text": "Pricing. There are two versions of Wobenzym available on the market: American and German. The German Wobenzym is considered to be more effective and is slightly costlier (around $50 to $60 for a 200-capsule bottle, as of May 2009). Shares & Saves. Save. Wobenzym is an enzyme supplement that was formulated by German scientists in the 1960s. It was primarily meant to be an anti-inflammation agent for the treatment of osteoporosis, but research has shown it to have numerous other health benefits."}, {"url": "http://www.wisdomandhealth.com/wobenzym-ps-tablets/", "passage_text": "What is Wobenzym PS? Wobenzym PS is a blend of three natural ingredients specifically blended for the support and maintenance of joints, muscles, and tendons. Wobenzym PS also works by promoting and supporting a healthy, balanced immune system, which is critical for rheumatoid arthritis and related conditions. Intestinal effects-Wobenzym PS tablets are enteric coated, meaning that this special coating protects the enzymes from stomach acids. The enzymes are then able to enter into the intestines intact. Once there, these enzymes break down some of the bacteria that we all normally have in our intestines."}, {"url": "http://www.wisdomandhealth.com/wobenzym-ps-tablets/", "passage_text": "Wobenzym PS descends from an older, European product called Phlogenzym, which is still commonly used in Germany and other European countries. Over the years, there have been many studies looking at enzymes therapy for various diseases. Intestinal effects-Wobenzym PS tablets are enteric coated, meaning that this special coating protects the enzymes from stomach acids. The enzymes are then able to enter into the intestines intact. Once there, these enzymes break down some of the bacteria that we all normally have in our intestines."}, {"url": "http://www.wisdomandhealth.com/wobenzym-ps-tablets/", "passage_text": "There are two ways in which Wobenzym PS reduces inflammation: Intestinal effects-Wobenzym PS tablets are enteric coated, meaning that this special coating protects the enzymes from stomach acids. The enzymes are then able to enter into the intestines intact. Once there, these enzymes break down some of the bacteria that we all normally have in our intestines."}, {"url": "http://wobenzymps.net/", "passage_text": "Wobenzym is an enzyme preparation originally designed in Germany in the 1960s and is a natural anti-inflammatory with many additional health benefits. * Helping to resolve many of the molecular features of aging. * Providing protection from environmental toxins in the air, water and food. * Treating autoimmune and rheumatic illnesses, such as osteo and rheumatoid arthritis, joint and muscle pain."}, {"url": "http://www.inflammationandhealth.com/usage.html", "passage_text": "No, in order for Wobenzym ® N to function properly it should be taken with a glass of water at room temperature or below. If Wobenzym ® N is taken with a warm to hot liquid such as coffee or tea the enteric coating on the tablets may be compromised. Wobenzym ® N is extremely safe and has been used by over 100 million people for over 40 years all around the world without a single instance or documented case of significant harm."}, {"url": "http://wobenzymps.net/", "passage_text": "In addition, Wobenzym acts as a natural and safe alternative to anti-inflammatory drugs such as Ibuprofen. Furthermore, some Olympic teams have used Wobenzym to reduce injuries by as much as 50% and to enhance healing after injury. * Helping to resolve many of the molecular features of aging. * Providing protection from environmental toxins in the air, water and food. * Treating autoimmune and rheumatic illnesses, such as osteo and rheumatoid arthritis, joint and muscle pain."}, {"url": "http://alternativemedicinesolution.com/Wobenzym-PS/", "passage_text": "Professional Strength Systemic Enzymes for Immune and Joint Support 100 Tablests for 40.99. 180 Tablets for 85.70. Wobenzym® PS may be a useful dietary supplement for individuals wishing to support healthy joint, immune and circulatory function. Functions. In the human body, hundreds of chemical reactions occur during the course of normal metabolic processes. Add to Wishlist. Click the button below to add the Wobenzym PS to your wish list."}, {"url": "http://www.iherb.com/Wobenzym-Wobenzym-N-Healthy-Inflammation-and-Joint-Support-200-Enteric-Coated-Tablets/10831", "passage_text": "Wobenzym N is a global leader in joint and inflammation health and Wobenzym N is the only systemic enzyme formula backed by decades of clinical research and customer satisfaction. 1  Wobenzym N has been the subject of 6 Human Clinical Studies on over 2,400 Patients. "}]