[{"url": "https://www.usaid.gov/who-we-are/organization/bureaus/bureau-democracy-conflict-and-humanitarian-assistance/office-us", "passage_text": "Mass Communication Specialist 2nd Class Chris Lussie, U.S. Navy. The Office of U.S. Foreign Disaster Assistance (OFDA) is responsible for leading and coordinating the U.S. Government’s response to disasters overseas. Recognizing the need to provide immediate relief while also setting the stage for recovery and rehabilitation, OFDA supports programs that give people tools to restart former jobs, provide psychosocial care to traumatized disaster survivors, and prepare individuals to get back on their feet."}, {"url": "http://www.redcross.org/what-we-do", "passage_text": "Although the Red Cross is not a government agency, it is an essential part of the response when disaster strikes. We work in partnership with other agencies and organizations that provide services to disaster victims. Disaster Relief. The Red Cross responds to approximately 70,000 disasters in the United States every year, ranging from home fires that affect a single family to hurricanes that affect tens of thousands, to earthquakes that impact millions."}, {"url": "https://en.wikipedia.org/wiki/National_Disaster_Medical_System", "passage_text": "The National Disaster Medical System (NDMS) is a section of the United States Department of Health and Human Services (HHS) responsible for managing Federal government's medical response to major emergencies and disasters. 1 Emergency medical response by civilian medical teams, equipment, and supplies to a disaster area when local medical resources are overwhelmed. 2  Movement of ill and injured patients from a disaster area to areas unaffected by the disaster. 3  Definitive care of patients at hospitals in areas unaffected by the disaster."}, {"url": "https://en.wikipedia.org/wiki/Disaster_assistance_response_team", "passage_text": "1 Disaster Assistance Response Team ([2]), a team of disaster experts deployed by the U.S. Agency for International Development. 2  The USAID DART was established in 1989, complete with planning, training, and equipment. 3  Based on the U.S. Forest Service Incident Command System, USAID DARTs deploy worldwide to save lives. Although the DART team was ready to leave within 24 hours of when the disaster struck, the government took two days to announce that the team would be dispatched, and it took nearly two weeks for DART to actually leave for Sri Lanka, due to a lack of available air transport."}, {"url": "https://en.wikipedia.org/wiki/National_Disaster_Medical_System", "passage_text": "1 Disaster Medical Assistance Team (DMAT) - provides medical care during a disaster or other incident. 2  National Medical Response Team (NMRT) - provides mass decontamination and medical care to victims of a release of Weapons of Mass Destruction, or a large scale release of Hazardous Material. 1 Emergency medical response by civilian medical teams, equipment, and supplies to a disaster area when local medical resources are overwhelmed. 2  Movement of ill and injured patients from a disaster area to areas unaffected by the disaster. 3  Definitive care of patients at hospitals in areas unaffected by the disaster."}, {"url": "https://en.wikipedia.org/wiki/Disaster_assistance_response_team", "passage_text": "It provides assistance to disaster-affected regions for up to 40 days. DART's headquarters is in Kingston, Ontario. DART was created by the Canadian government in 1996 in the aftermath of the inadequate response to the 1994 Rwandan genocide, when Canada's aid arrived after the peak of a cholera epidemic. Although the DART team was ready to leave within 24 hours of when the disaster struck, the government took two days to announce that the team would be dispatched, and it took nearly two weeks for DART to actually leave for Sri Lanka, due to a lack of available air transport."}, {"url": "https://en.wikipedia.org/wiki/Disaster_assistance_response_team", "passage_text": "(Redirected from Disaster assistance response team). The Disaster Assistance Response Team (DART) (French: Équipe équipe'd intervention en cas de (CATASTROPHE)) eicc is a rapidly deployable team of 200 Canadian forces. Personnel it provides assistance to-disaster affected regions for up to 40. days Although the DART team was ready to leave within 24 hours of when the disaster struck, the government took two days to announce that the team would be dispatched, and it took nearly two weeks for DART to actually leave for Sri Lanka, due to a lack of available air transport."}, {"url": "http://www.fema.gov/community-emergency-response-teams/", "passage_text": "Main Content. The Community Emergency Response Team (CERT) Program educates people about disaster preparedness for hazards that may impact their area and trains them in basic disaster response skills, such as fire safety, light search and rescue, team organization, and disaster medical operations. "}, {"url": "http://www.worldvision.org/our-impact/disaster-relief", "passage_text": "1 Within 24 to 72 hours of the disaster, our global rapid response team is on the ground, making assessments and beginning to provide emergency relief. Our impact on disaster relief. More than 90 percent of natural disaster-related deaths occur in developing countries, where poverty and lack of resources exacerbate the suffering."}]