[{"url": "http://www.infoplease.com/encyclopedia/science/phosphorus-biological-importance-applications.html", "passage_text": "Biological Importance and Applications. Phosphorus is present in plants and animals. There is over 1 lb (454 grams) of phosphorus in the human body. It is a component of adenosine triphosphate (ATP), a fundamental energy source in living things. Phosphoric acid is primarily used in the production of phosphate compounds. It is also used in pickling metals, in sugar refining, and in soft drinks. Phosphorus forms a number of compounds with the halogens, e.g., the trichloride, PCl 3, and the pentachloride, PCl. , both used as reagents."}, {"url": "https://answers.yahoo.com/question/index?qid=20080306002322AA4IQzh", "passage_text": "Report Abuse. Phosphorus is usually found in the form of phosphate in living tissue. Phosphate is used in the backbone of DNA, and it is involved in energy transformations. The energy currency of the cell is ATP, which stands for adenosine triphosphate. Manipulations involving phosphate groups can result in reactions taking plac"}, {"url": "https://en.wikipedia.org/wiki/Phosphorus", "passage_text": "Inorganic phosphorus in the form of the phosphate PO3− 4 is required for all known forms of life, playing a major role in biological molecules such as DNA and RNA where it forms part of the structural framework of these molecules. The first form of elemental phosphorus to be produced (white phosphorus, in 1669) emits a faint glow upon exposure to oxygen – hence its name given from Greek mythology, φωσφόρος meaning light-bearer (Latin Lucifer), referring to the  Morning Star , the planet Venus (or Mercury)."}, {"url": "http://healthyeating.sfgate.com/main-function-phosphorus-body-5789.html", "passage_text": "Energy Production. Phosphorus is commonly found in the body as phosphate. Phosphates play an important role in energy production as components of ATP, or adenosine triphosphate. ATP is readily used to fuel your body's many functions. Structurally, ATP consists of adenosine, an organic compound, and three phosphate molecules."}, {"url": "http://www.answers.com/Q/Why_is_phosphorus_an_important_biological_molecule", "passage_text": "1) Carbon has very high melting point and sublimation point. This gives it advantage over other elements that are common in biological molecules such as H, N or O. 2) In addit … ion, it can form multiple strong covalent bonds with other atoms (N, H, O, C)."}, {"url": "https://en.wikipedia.org/wiki/Phosphorus", "passage_text": "As an element, phosphorus exists in two major forms— white phosphorus and red phosphorus —but due to its high reactivity, phosphorus is never found as a free element on Earth. Instead phosphorus-containing minerals are almost always present in their maximally oxidised state, as inorganic phosphate rocks. The first form of elemental phosphorus to be produced (white phosphorus, in 1669) emits a faint glow upon exposure to oxygen – hence its name given from Greek mythology, φωσφόρος meaning light-bearer (Latin Lucifer), referring to the  Morning Star , the planet Venus (or Mercury)."}, {"url": "https://answers.yahoo.com/question/index?qid=20071215124158AA68noM", "passage_text": "Biological role Phosphorus is a key element in all known forms of life. Inorganic phosphorus in the form of the phosphate PO43- plays a major role in biological molecules such as DNA and RNA where it forms part of the structural framework of these molecules. Living cells also use phosphate to transport cellular energy via adenosine triphosphate (ATP). "}, {"url": "http://www.answers.com/Q/Why_is_phosphorus_important", "passage_text": "Phosphorus is an element of ATP, the energy molecule of living  organisms, hence it is important in metabolic activities.  Phosphorous is also a component of nucleic acids. 1 person found this useful. Edit. Share to: Chrishan Silva. 509,209 Contributions. I'm an undergraduate in Physical Sciences stream. "}, {"url": "http://www.answers.com/Q/Why_is_phosphorus_an_important_biological_molecule", "passage_text": "Phosphorus is an essential mineral primarily used for growth and  repair of body cells and tissues. Phosphorus is commonly found in  the body as phosphate. Phosphates play a … n important role in energy  production as components of ATP, or adenosine triphosphate.  Phosphorus is a component of deoxyribonucleic acid, or DNA, and  ribonucleic acid, or RNA, long molecules which carry genetic  information. Phosphorus also acts as a buffer, neutralizing acids  to maintain normal pH in the blood. . 1 person found this useful. This gives it advantage over other elements that are common in biological molecules such as H, N or O. 2) In addit … ion, it can form multiple strong covalent bonds with other atoms (N, H, O, C)."}]