[{"url": "http://www.merriam-webster.com/dictionary/troposphere", "passage_text": "Definition of TROPOSPHERE. : the lowest densest part of the earth's atmosphere in which most weather changes occur and temperature generally decreases rapidly with altitude and which extends from the earth's surface to the bottom of the stratosphere. — tro·po·spher·ic \\ˌtrō-pə-ˈsfir-ik, ˌtrae-, -ˌträ-\\ ˈsfer. adjective"}, {"url": "https://en.wikipedia.org/wiki/Troposphere", "passage_text": "The chemical composition of the troposphere is essentially uniform, with the notable exception of water vapor. The source of water vapour is at the surface through the processes of evaporation and transpiration. Furthermore, the temperature of the troposphere decreases with height, and saturation vapor pressure decreases strongly as temperature drops, so the amount of water vapor that can exist in the atmosphere decreases strongly with height."}, {"url": "https://en.wikipedia.org/wiki/Troposphere", "passage_text": "The troposphere is the lowest portion of Earth's atmosphere. It contains approximately 75% of the atmosphere 's mass and 99% of its water vapor and aerosols. The average depth of the troposphere is approximately 17 km (11 mi) in the middle latitudes. Furthermore, the temperature of the troposphere decreases with height, and saturation vapor pressure decreases strongly as temperature drops, so the amount of water vapor that can exist in the atmosphere decreases strongly with height."}, {"url": "http://www.definitions.net/definition/Troposphere", "passage_text": "The troposphere is the lowest portion of Earth's atmosphere. It contains approximately 80% of the atmosphere's mass and 99% of its water vapour and aerosols. The average depth of the troposphere is approximately 17 km in the middle latitudes. Wiktionary (0.00 / 0 votes) Rate this definition: troposphere (Noun). The lower levels of the atmosphere extending from the earth's surface up to the tropopause. It is characterized by convective air movements and a large vertical temperature change."}, {"url": "https://en.wikipedia.org/wiki/Troposphere", "passage_text": "The lowest part of the troposphere, where friction with the Earth's surface influences air flow, is the planetary boundary layer. This layer is typically a few hundred meters to 2 km (1.2 mi) deep depending on the landform and time of day. Furthermore, the temperature of the troposphere decreases with height, and saturation vapor pressure decreases strongly as temperature drops, so the amount of water vapor that can exist in the atmosphere decreases strongly with height."}, {"url": "http://web.physics.ucsb.edu/~lgrace/chem123/troposphere.htm", "passage_text": "Report. The troposphere is the lowest layer of Earth's atmosphere and site of all weather on Earth. The troposphere is bonded on the top by a layer of air called the tropopause, which separates the troposphere from the stratosphere, and on bottom by the surface of the Earth. Temperature and water vapor content in the troposphere decrease rapidly with altitude. Water vapor plays a major role in regulating air temperature because it absorbs solar energy and thermal radiation from the planet's surface. The troposphere contains 99% of the water vapor in the atmosphere."}, {"url": "http://scied.ucar.edu/shortcontent/troposphere-overview", "passage_text": "The troposphere is the lowest layer of Earth's atmosphere. Most of the mass (about 75-80%) of the atmosphere is in the troposphere. Most types of clouds are found in the troposphere, and almost all weather occurs within this layer. "}, {"url": "http://www.windows2universe.org/earth/Atmosphere/troposphere.html", "passage_text": "The Troposphere. The troposphere is the lowest layer of Earth's atmosphere. The troposphere starts at Earth's surface and goes up to a height of 7 to 20 km (4 to 12 miles, or 23,000 to 65,000 feet) above sea level. Most of the mass (about 75-80%) of the atmosphere is in the troposphere. Almost all weather occurs within this layer"}, {"url": "http://www.weatherquestions.com/What_is_the_troposphere.htm", "passage_text": "The boundary between the troposphere and the stratosphere is called the tropopause, located at an altitude of around 5 miles in the winter, to around 8 miles high in the summer, and as high as 11 or 12 miles in the deep tropics. The troposphere is characterized by decreasing temperature with height (at an average rate of 3.5 degrees F per thousand feet, or 6.5 degrees C per kilometer). In contrast, the stratosphere has either constant or slowly increasing temperature with height."}, {"url": "http://www.weatheronline.co.uk/reports/wxfacts/Troposphere.htm", "passage_text": "Troposphere. The troposphere (from Greek: tropein-to change, circulate or mix) is the lowermost layer of the Earth's atmosphere. Most of the weather phenomena, systems, convection, turbulence and clouds occur in this layer, although some may extend into the lower portion of the stratosphere. "}]