[{"url": "http://salarygenius.com/ny/new-york/salary/union-carpenter-salary", "passage_text": "Union Carpenter. The average yearly salary for Union Carpenter in New York, New York is $83,116. If you are just beginning to work a new job as a Union Carpenter in New York, New York, you could earn a starting pay rate of $68,448 annually."}, {"url": "http://www.indeed.com/salary/q-Carpenter-l-New-York.html", "passage_text": "Average Carpenter salaries for job postings in New York are 21% higher than average Carpenter salaries for job postings nationwide."}, {"url": "http://work.chron.com/average-starting-salary-carpenters-apprentice-5229.html", "passage_text": "Salary. The starting salary for apprentices is typically between 30 and 50 percent of the wage experienced carpenters make, according to the U.S. Department of Labor's Bureau of Labor Statistics. As of May 2011, carpenters made an average of $44,330 annually, or $21.31 per hour."}, {"url": "http://www.payscale.com/research/US/Job=Carpenter/Hourly_Rate/7a16c994/New-York-NY", "passage_text": "Carpenter Salary in New York. (United States). The average wage for a Carpenter in New York, New York is $24.87 per hour. Experience has a moderate effect on salary for this job."}, {"url": "http://www.indeed.com/salary/q-Carpenter-l-New-York,-NY.html", "passage_text": "$50,000. Average Carpenter salaries for job postings in New York, NY are 36% higher than average Carpenter salaries for job postings nationwide."}, {"url": "http://money.usnews.com/careers/best-jobs/carpenter/salary", "passage_text": "According to the BLS, carpenters earned a median salary of $40,500 in 2013, or $19.47 per hour. During that period, the highest-paid carpenters earned about $73,100, while the lowest-paid earned $25,120. The motion picture and video industry pays the highest for carpentry work."}, {"url": "http://work.chron.com/pay-scale-union-carpenter-26244.html", "passage_text": "Average Salaries. The average annual salary for a union carpenter was $76,000 as of 2013, according to Careerbliss. This equates to $36.53 per hour, based on 40-hour workweeks. During apprenticeship training, a carpenter is typically paid 30 to 50 percent of the wages he'll earn once he completes his training, according to the BLS."}]