[{"url": "http://www.huffingtonpost.com/2013/06/12/google-intern-salary_n_3429746.html", "passage_text": "Interns at Google typically commit to three months of full-time work, which means the average intern making $6,000 monthly would take home nearly $20,000 after one summer. And the staggering salary is just the beginning. Google employees enjoy a ton of office perks, and interns get in on the action, too. Rohan Shah, a 20-year-old Google intern, gushed to Business Insider earlier this month about his time with the technology behemoth. That's quite a chunk of change -- enough to put Google in second place for highest intern salaries, according to Glassdoor. Only research interns at Microsoft get better pay, pulling in $7,050 per month."}, {"url": "http://www.cnet.com/news/apple-google-facebook-dont-pay-the-highest-engineer-salary/", "passage_text": "These 2013 salaries are quite a bit higher than the numbers released by Glassdoor last year. In 2012, Google earned the top spot, paying its engineers $128,336 (which is actually $1,193 more than this year). Coming in second was Facebook paying $123,626. Third and fourth place went to Apple and eBay last year. And the unlikely winner is Juniper Networks. Paying $159,990 for its software engineers' average base salary, Juniper is way ahead of other companies on the list. Coming in No. 2 is LinkedIn, which pays its software engineers $136,427, and No. 3 is Yahoo paying $130,312."}, {"url": "http://www.salarylist.com/company/Google-Salary.htm", "passage_text": "Google Salary. Google average salary is $116,429, median salary is $111,500 with a salary range from $38,380 to $1,550,000. Google salaries are collected from government agencies and companies. Each salary is associated with a real job position. Google salary statistics is not exclusive and is for reference only. They are presented as is and updated regularly."}, {"url": "http://www.businessinsider.com/a-google-programmer-blew-off-a-500000-salary-at-startup--because-hes-already-making-3-million-every-year-2014-1", "passage_text": "A compensation of $3 million per year, or even $500,000 per year, is well above the Silicon Valley average for an engineer. Recruiter Scott Purcell says the software engineers he's placing typically make a base salary of $165,000. The average base salary for a Google engineer is $128,000. But there are outliers besides our $3 million engineer. Twitter's senior vice president of engineer, Christopher Fry, earned $10.3 million last year. Google has an industry-wide reputation for getting — and keeping — the people it wants. The startup made the programmer what it thought was a big offer: a $500,000 salary. He blew us off, said the founder. The programmer told the startup thanks for the offer, but Google was currently paying him $3 million per year in cash and restricted stock units."}, {"url": "http://www.cnet.com/news/apple-google-facebook-dont-pay-the-highest-engineer-salary/", "passage_text": "Glassdoor's survey is based on companies that had at least 50 software engineer salary reports filed over the last 12 months. In all, more than 33,000 salary reports were turned into Glassdoor this year. And the unlikely winner is Juniper Networks. Paying $159,990 for its software engineers' average base salary, Juniper is way ahead of other companies on the list. Coming in No. 2 is LinkedIn, which pays its software engineers $136,427, and No. 3 is Yahoo paying $130,312."}, {"url": "http://www.thewindowsclub.com/salaries-at-google", "passage_text": "The average salary of Product Marketing Managers at Google is $107,000. Financial Analysts – Google needs to keep a tab on what it is earning via different products, which products are giving it profits and which ones need attention. While the get all the free facilities available across different posts – like food, play rooms, laundry etc. -, it pays them in the range of $139,084. That is, the average salary of a senior programmer at Google is almost $140,000."}, {"url": "http://www.thewindowsclub.com/salaries-at-google", "passage_text": "And it treats them well. While the get all the free facilities available across different posts – like food, play rooms, laundry etc. -, it pays them in the range of $139,084. That is, the average salary of a senior programmer at Google is almost $140,000. Research Scientists – Google has taken up some “off the computer” projects such as the driverless cars. These tasks need research scientists who are good at researching and getting things done"}, {"url": "http://www.businessinsider.com/google-really-is-the-best-tech-company-to-work-for-2011-6", "passage_text": "The survey looked at salary, company culture, job satisfaction and benefits & perks at nine major companies. Although the companies weren't ranked, Google excelled in every category. Googlers have the highest mid-career median salary at $141,000. Second place goes to Microsoft at $127,000. Googlers are extremely satisfied, as are Amazon, Apple and Facebook employees. But Google and Apple employees are also relatively stress-free. As for perks, only Googlers receive free meals. "}]