[{"url": "http://www.emedicinehealth.com/emphysema/article_em.htm", "passage_text": "Emphysema is a long-term, progressive disease of the lungs that primarily causes shortness of breath due to over-inflation of the alveoli (air sacs in the lung). In people with emphysema, the lung tissue involved in exchange of gases (oxygen and carbon dioxide) is impaired or destroyed. Emphysema is included in a group of diseases called chronic obstructive pulmonary disease or COPD (pulmonary refers to the lungs)."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/necrotizing-fasciitis-flesh-eating-bacteria-topic-overview", "passage_text": "Necrotizing fasciitis is an infection caused by bacteria. It can destroy skin, fat, and the tissue covering the muscles within a very short time. The disease sometimes is called flesh-eating bacteria. When it occurs on the genitals, it is called Fournier gangrene. Necrotizing fasciitis is very rare but serious."}, {"url": "http://www.webmd.boots.com/smoking-cessation/emphysema", "passage_text": "Emphysema. Emphysema is a long-term, progressive disease of the lungs that primarily causes shortness of breath. In people with emphysema the lung tissues necessary to support the physical shape and function of the lung are damaged. Emphysema is called an obstructive lung disease because the destruction of lung tissue around smaller airways, called bronchioles, makes these airways unable to hold their shape properly when you exhale. This makes them inefficient at transferring oxygen into the blood, and in taking carbon dioxide out of the blood."}, {"url": "http://www.sophisticatededge.com/what-is-necrotic-pneumonia.html", "passage_text": "This form of lung disease can rapidly destroy lung tissue, resulting in severe and progressing pulmonary problems that may ultimately be fatal. Necrotic pneumonia can be due to severe lung infections or as a result of inhaling the contents of the stomach, also known as aspiration pneumonia. Diagnosis. You can typically diagnose necrotic pneumonia from an X-ray of the chest. A chest X-ray will show pockets or cavities of destroyed tissue, as well as a buildup of fluid in these areas of dead lung tissue. The lungs may also be surrounded by pus or pleural fluid due to the inflammation and tissue damage."}, {"url": "http://www.sophisticatededge.com/what-is-necrotic-pneumonia.html", "passage_text": "Necrotic pneumonia is typically due to a bacterial infection that begins to destroy the lung tissue. The most common type of bacteria that causes necrotic pneumonia is Streptococcus pneumoniae, though other species are increasingly being identified in sputum cultures of individuals with this serious form of pneumonia. Diagnosis. You can typically diagnose necrotic pneumonia from an X-ray of the chest. A chest X-ray will show pockets or cavities of destroyed tissue, as well as a buildup of fluid in these areas of dead lung tissue. The lungs may also be surrounded by pus or pleural fluid due to the inflammation and tissue damage."}, {"url": "http://www.webmd.boots.com/smoking-cessation/emphysema", "passage_text": "1 Cigarette smoke contributes to this disease process in two ways. 2  It destroys lung tissue, which is the cause of the obstruction, and it causes inflammation and irritation of airways that can cause the disease to get worse. 3  Destruction of lung tissue occurs in several ways. Emphysema is called an obstructive lung disease because the destruction of lung tissue around smaller airways, called bronchioles, makes these airways unable to hold their shape properly when you exhale. This makes them inefficient at transferring oxygen into the blood, and in taking carbon dioxide out of the blood."}, {"url": "http://www.emedicinehealth.com/emphysema/page2_em.htm", "passage_text": "1 It is also released by immune cells in their attempt to destroy bacteria and other material. 2  People with alpha-1-antitrypsin deficiency cannot fight the destructive effects of trypsin once it is released in the lung. 1 The pollutants cause inflammation in the airways, leading to lung tissue destruction. 2  Close relatives of people with emphysema are more likely to develop the disease themselves. 3  This is probably because the tissue sensitivity or response to smoke and other irritants may be inherited."}, {"url": "http://www.nytimes.com/health/guides/disease/pneumonia/print.html", "passage_text": "Pneumonia is an inflammation of the lung that is most often caused by infection with bacteria, viruses, or other organisms. Occasionally, inhaled chemicals that irritate the lungs can cause pneumonia. Healthy people can usually fight off pneumonia infections. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100420123331AAGEpdl", "passage_text": "Report Abuse. Bacteria don't enter cells, - that's viruses. In general: Bacteria kill and eat cells by releasing enzymes that 'digest' the cell and allow the bacteria to absorb the nutrients released. Since those enzymes destroy tissue they are poisons. The higher the number of bacteria living in the body, the greater the concentration of those poisons in the blood. I KNOW it destroys tissue causing organ failure, usually in the lungs. So DONT tell me you die by suffocating I want to know how having TB bacteria in your cells results in tissue death."}, {"url": "http://www.healthhype.com/pulmonary-tuberculosis-lung-tb.html", "passage_text": "Tweet. Tuberculosis is a disease caused by an infection with the Mycobacterium tuberculosis bacillus, a type of bacteria that can affect any part of the body but most commonly the lungs. The initial period of infection is known as the primary infection, which then progresses to the dormant phase (latent or inactive TB). Here the bacillus is sealed off from the healthy lung tissue in a tubercle. It can remain in this state for long periods of time."}]