[{"url": "http://www.strokeassociation.org/STROKEORG/AboutStroke/TypesofStroke/HemorrhagicBleeds/What-Is-an-Arteriovenous-Malformation-AVM_UCM_310099_Article.jsp", "passage_text": "A brain AVM contains abnormal and, therefore, “weakened” blood vessels that direct blood away from normal brain tissue. These abnormal and weak blood vessels dilate over time. Eventually they may burst from the high pressure of blood flow from the arteries, causing bleeding into the brain. We don’t know why AVMs occur. Brain AVMs are usually congenital, meaning someone is born with one. But they’re usually not hereditary. People probably don’t inherit an AVM from their parents, and they probably won’t pass one on to their children."}, {"url": "http://brainavm.oci.utoronto.ca/malformations/brain_avm_index.htm", "passage_text": "An AVM is a tangle of abnormal and poorly formed blood vessels (arteries and veins). They have a higher rate of bleeding than normal vessels. AVMs can occur anywhere in the body. Brain AVMs are of special concern because of the damage they cause when they bleed. Types of AVM. AVMs can occur anywhere in the body however BRAIN AVMs are of special concern because of the damage they cause when they bleed. They are very rare and occur in less than 1% of the general population. AVMs that occur in the coverings of the brain are called DURAL AVMs."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=9690", "passage_text": "AVM: An AVM (arteriovenous malformation) is a congenital disorder (one present at birth) of blood vessels in the brain, brainstem, or spinal cord that is characterized by a complex, tangled web of abnormal arteries and veins connected by one or more fistulas (abnormal communications). 1 Surgery, which is the best-known and longest-standing treatment for AVM. 2  Surgery for an AVM involves identifying the margins of the malformation, ligating (tying off) or clipping the feeder arterial vessels, obliterating the draining veins, and removing or obliterating the nidus (the nest) of the AVM."}, {"url": "http://www.strokeassociation.org/STROKEORG/AboutStroke/TypesofStroke/HemorrhagicBleeds/What-Is-an-Arteriovenous-Malformation-AVM_UCM_310099_Article.jsp", "passage_text": "When an arteriovenous malformation (AVM) occurs, a tangle of blood vessels in the brain or on its surface bypasses normal brain tissue and directly diverts blood from the arteries to the veins. We don’t know why AVMs occur. Brain AVMs are usually congenital, meaning someone is born with one. But they’re usually not hereditary. People probably don’t inherit an AVM from their parents, and they probably won’t pass one on to their children."}, {"url": "https://en.wikipedia.org/wiki/Arteriovenous_malformation", "passage_text": "Arteriovenous malformation (AVM) is an abnormal connection between arteries and veins, bypassing the capillary system. This vascular anomaly is widely known because of its occurrence in the central nervous system, but can appear in any location. AVMs are usually congenital and belong to the RASopathies. The genetic transmission patterns of AVM, if any, are unknown. AVM is not generally thought to be an inherited disorder, unless in the context of a specific hereditary syndrome."}, {"url": "http://www.mayfieldclinic.com/PE-AVM.HTM", "passage_text": "Figure 1. An AVM is a tangled bundle of blood vessels where arteries connect directly to veins with no capillary bed between. This creates a system of multiple feeding arteries, the tangle or nidus, and enlarged draining veins. The surrounding normal tissues may be damaged as the AVM steals blood from those areas. There are four types of AVMs: 1  Arteriovenous malformation  abnormal tangle of blood vessels where arteries shunt directly into veins with no intervening capillary bed; high pressure."}, {"url": "http://www.mayoclinic.org/diseases-conditions/brain-avm/home/ovc-20129992", "passage_text": "Normal and abnormal blood vessels. In a brain AVM, blood passes directly from arteries to veins via a tangle of abnormal blood vessels. A brain arteriovenous malformation (AVM) is a tangle of abnormal blood vessels connecting arteries and veins in the brain. The arteries are responsible for taking oxygen-rich blood from the heart to the brain. Veins carry the oxygen-depleted blood back to the lungs and heart. "}, {"url": "http://www.mayfieldclinic.com/PE-AVM.HTM", "passage_text": "An arteriovenous malformation (AVM) is an abnormal tangle of blood vessels in the brain or spine. Some AVMs have no specific symptoms and little or no risk to one's life or health, while others cause severe and devastating effects when they bleed. The surrounding normal tissues may be damaged as the AVM steals blood from those areas. There are four types of AVMs: 1  Arteriovenous malformation  abnormal tangle of blood vessels where arteries shunt directly into veins with no intervening capillary bed; high pressure."}, {"url": "http://www.ninds.nih.gov/disorders/avms/avms.htm", "passage_text": "Arteriovenous malformations (AVMs) are defects of the circulatory system that are generally believed to arise during embryonic or fetal development or soon after birth. Although AVMs can develop in many different sites, those located in the brain or spinal cord can have especially widespread effects on the body. The decision to perform surgery on any individual with an AVM requires a careful consideration of possible benefits versus risks. Medication can often alleviate general symptoms such as headache, back pain, and seizures caused by AVMs and other vascular lesions."}, {"url": "https://en.wikipedia.org/wiki/Automated_valuation_model", "passage_text": "Automated valuation model (AVM) is the name given to a service that can provide real estate property valuations using mathematical modelling combined with a database. Most AVMs calculate a property’s value at a specific point in time by analyzing values of comparable properties. "}]