[{"url": "https://en.wikipedia.org/wiki/Deliverable", "passage_text": "Deliverable is a term used in project management to describe a tangible or intangible object produced as a result of the project that is intended to be delivered to a customer (either internal or external). A deliverable could be a report, a document, a server upgrade or any other building block of an overall project. A deliverable is more than just a project document in that a project document is typically part of a project deliverable. A project deliverable may contain a number of documents and physical things. In technical projects, deliverables can be further classified as hardware, software, or design documents"}, {"url": "http://www.investopedia.com/terms/d/deliverables.asp", "passage_text": "BREAKING DOWN 'Deliverables'. Deliverables serves as a general term that encompasses the requirements of a project. A deliverable may be an object, used in the greater scheme of the project. For example, in a project meant to upgrade a firm's technology, a deliverable may be a dozen new computers. A project management term for the quantifiable goods or services that will be provided upon the completion of a project. Deliverables can be tangible or intangible parts of the development process, and are often specified functions or characteristics of the project. Next Up."}, {"url": "https://en.wikipedia.org/wiki/Deliverable", "passage_text": "A deliverable differs from a project milestone in that a milestone is a measurement of progress toward an output whereas the deliverable is the result of the process. For a typical project, a milestone might be the completion of a product design while the deliverable might be the technical diagram of the product. A deliverable is more than just a project document in that a project document is typically part of a project deliverable. A project deliverable may contain a number of documents and physical things. In technical projects, deliverables can be further classified as hardware, software, or design documents"}, {"url": "https://answers.yahoo.com/question/index?qid=1006050907650", "passage_text": "Breaking a complex or long-duration project down into individual Contract Deliverables protects the Customer by allowing quick identification of problem areas as the project advances, and allows follow-on initiatives to be linked to the accomplishment of prerequisite Deliverables. The deliverables are the specific items that must be delivered to the client, at a specified date, meeting the criteria defined in the contract. The details of the deliverables are usually very carefully spelled out in the contract. If they are not-get specific definitions before you get involved. Jim · 10 years ago."}, {"url": "http://yourbusiness.azcentral.com/deliverable-project-management-20764.html", "passage_text": "A deliverable is an outcome that a project team must produce and present to the customer in accordance with the terms of a contract for a project to be complete. Project leadership can present one or more deliverables to the customer during the term of the project or just prior to its completion. The project scope statement describes each deliverable and the related acceptance criteria."}, {"url": "https://answers.yahoo.com/question/index?qid=1006050907650", "passage_text": "Best Answer: From an aviation/military contracting viewpoint, a 'Contract Deliverable' is normally one of the Required Duties or sub-sets of tasks that were identified in the Customer's Specification, and to which the performing company/individual (contractor) originally submitted his Proposal (or promise) on. The deliverables are the specific items that must be delivered to the client, at a specified date, meeting the criteria defined in the contract. The details of the deliverables are usually very carefully spelled out in the contract. If they are not-get specific definitions before you get involved. Jim · 10 years ago."}, {"url": "https://en.wikipedia.org/wiki/Non-deliverable_forward", "passage_text": "In finance, a non-deliverable forward (NDF) is an outright forward or futures contract in which counterparties settle the difference between the contracted NDF price or rate and the prevailing spot price or rate on an agreed notional amount. It is used in various markets such as foreign exchange and commodities. "}, {"url": "http://yourbusiness.azcentral.com/deliverable-project-management-20764.html", "passage_text": "These deliverables are not presented to the customer. For example, a list of customer accounts is a deliverable which is a work product used to test the billing system. The primary deliverables that meet project objectives represent performance obligations and are, therefore, a basis or revenue recognition. Project leadership can present one or more deliverables to the customer during the term of the project or just prior to its completion. The project scope statement describes each deliverable and the related acceptance criteria."}]