[{"url": "http://literarydevices.net/denotation/", "passage_text": "Denotation Definition. Denotation is generally defined as literal or dictionary meanings of a word in contrast to its connotative or associated meanings. Let us try to understand this term with the help of an example"}, {"url": "http://www.chegg.com/homework-help/definitions/connotation-vs-denotation-41", "passage_text": "Definition of Connotation vs. Denotation. Words can have several meanings. The literal meanings, the denotation, are direct, realistic, and often found in the dictionary. What the word suggests or implies, the connotation, is symbolic, culturally constructed, and often influences the interpretation of poetry or literature. "}, {"url": "http://www.literarydevices.com/connotation/", "passage_text": "Connotation and denotation are opposite concepts. The denotation of a word is its literal meaning, whereas the connotation is an implicit meaning. As a mnemonic to remember the difference, it can be helpful to note that “denotation” and “dictionary definition” all start with the same letter. The connotation definition is therefore not the explicit meaning of the word, but rather the meaning that the word implies. Connotation comes from the Latin word “connotare,” which means, “to mark in addition.”. In some cases, connotation can also be similar to symbolism as it hinges on culturally-accepted meanings."}, {"url": "http://www.literarydevices.com/connotation/", "passage_text": "A. Connotation is the literal meaning of a word, while denotation is the figurative meaning. B. Connotation is the implied meaning of a word and/or the emotional associations with it, while denotation is the dictionary definition. C. Connotation is the positive association with a word, while denotation is the negative association with it. The connotation definition is therefore not the explicit meaning of the word, but rather the meaning that the word implies. Connotation comes from the Latin word “connotare,” which means, “to mark in addition.”. In some cases, connotation can also be similar to symbolism as it hinges on culturally-accepted meanings."}, {"url": "http://literarydevices.net/connotation/", "passage_text": "Connotation Definition. Connotation refers to a meaning that is implied by a word apart from the thing which it describes explicitly. Words carry cultural and emotional associations or meanings in addition to their literal meanings or denotations. Positive and Negative Connotations. Words may have positive or negative connotations that depend upon the social, cultural and personal experiences of individuals. For example, the words childish, childlike and youthful have the same denotative but different connotative meanings."}, {"url": "http://www.piclits.com/lessonplans/poetry_connotations.aspx", "passage_text": "Denotation: dictionary meaning or meanings of the word. Connotation: alternative meanings of the word that have been determined by its history of use, the contexts in which it is used, and established associations with the word. "}, {"url": "http://www.merriam-webster.com/dictionary/connotation", "passage_text": "Full Definition of CONNOTATION. 1. a: the suggesting of a meaning by a word apart from the thing it explicitly names or describes. 2. 3. : an essential property or group of properties of a thing named by a term in logic — compare denotation. "}, {"url": "http://www.poetrysoup.com/poems/connotation", "passage_text": "PoetrySoup is a great resource for examples of connotation poems or a list of connotation poetry. These examples illustrate what connotation poems look like. There is also a link below to the definition of connotation and a page where you can discuss these types of poems. "}, {"url": "http://www.shmoop.com/literature-glossary/connotation.html", "passage_text": "Definition: The denotation of connotation is the suggestive meaning of a word, and all of the cultural associations it brings up. Two words can mean exactly the same thing and have wildly different connotations. For example, if you call someone economical, it's a polite, positive way of saying they're smart with money."}, {"url": "http://www.literarydevices.com/connotation/", "passage_text": "The connotation of a word refers to the emotional or cultural association with that word rather than its dictionary definition. The connotation definition is therefore not the explicit meaning of the word, but rather the meaning that the word implies. Connotation comes from the Latin word “connotare,” which means, “to mark in addition.”. In some cases, connotation can also be similar to symbolism as it hinges on culturally-accepted meanings."}]