[{"url": "http://chronicle.com/article/Adjunct-Project-Shows-Wide/136439/", "passage_text": "The overall average pay reported by adjuncts is $2,987 per three-credit course. Adjuncts at 16 colleges reported earning less than $1,000. The highest pay reported is $12,575, in the anthropology department at Harvard University. Harvard pays adjuncts $11,037, on average, according to the data that adjuncts have submitted so far. Meanwhile, adjuncts at rural, medium-sized, two-year institutions—where pay is the lowest, according to the data submitted so far—average $1,808"}, {"url": "http://work.chron.com/average-adjunct-pay-community-colleges-18310.html", "passage_text": "According to a 2008 article at the Small Steps for Big Change website, adjunct faculty pay at community colleges also depends on the education of the instructor. Generally, the article notes, community college adjunct faculty instructors are paid $2,200 to $3,500 per course. Related Reading: Math Adjunct Jobs. A community college generally offers both academic and vocational education programs. Many community college instructors are adjunct faculty paid for teaching specific courses. Adjunct faculty pay at community colleges is usually on a per-class or per-semester-hour basis."}, {"url": "http://www.latimes.com/opinion/op-ed/la-oe-allen-adjunct-professors-20131222-story.html", "passage_text": "The highly educated, badly paid, often abused adjunct professors. Teacher. Anthony Russo / For The Times. According to the American Assn. of University Professors, the median pay for an adjunct professor is $2,700 per three-credit-hour course. According to the American Assn. of University Professors, the median pay for an adjunct professor is $2,700 per three-credit-hour course. (Anthony Russo / For The Times). "}, {"url": "http://www.ehow.com/info_7746220_average-adjunct-professor-community-college.html", "passage_text": "The average adjunct professor has a salary of $44,000 to $49,000, according to Simply Hired. Compensation for adjuncts depends on location, school,... 1  The Average Salary for a Community College Professor. In California, the average pay for adjuncts at both two-and four-year schools is $3,888. Factors that also play a part in the salary range include subject taught, degree held by the professor and location of the school."}, {"url": "http://www.huffingtonpost.com/2013/04/08/faculty-pay-survey_n_3038924.html", "passage_text": "Median pay per course for adjunct faculty is $2,700, according to the AAUP report. Generally, public institutions in the Southeast pay adjuncts the least, with median pay per course at $2,400 for a four-year college and $1,800 for a community college. The average pay for all types of professors, instructors and lecturers is $84,303 for the academic year 2012-13, but the report noted a big difference between public and private colleges. At public institutions, the average is $80,578, while at private schools, it's $99,771."}, {"url": "http://www.theatlantic.com/education/archive/2015/09/income-inequality-in-higher-education-the-college-president-to-adjunct-pay-ratio/407029/", "passage_text": "Per-class earnings offer one way to analyze pay. Adjunct professors earned a median of $2,700 per semester-long class during the 2012-13 academic year, according to an AAUP survey of thousands of part-time faculty members. Due to the scattered salary data for non-tenure-track faculty, I opted to calculate admittedly inexact college president-to-adjunct pay ratios using $20,000 as the typical income of adjunct professors based on the data cited by NPR and Pacific Standard."}, {"url": "http://work.chron.com/average-adjunct-pay-community-colleges-18310.html", "passage_text": "Average adjunct faculty instructor pay varies by community college. A 2006 report by the Modern Language Association noted that community college average adjunct faculty instructor pay ranged from about $1,397 to about $3,000 per course. A community college generally offers both academic and vocational education programs. Many community college instructors are adjunct faculty paid for teaching specific courses. Adjunct faculty pay at community colleges is usually on a per-class or per-semester-hour basis."}, {"url": "http://chronicle.com/article/Adjunct-Project-Shows-Wide/136439/", "passage_text": "In California, where faculty at two-and four-year public institutions are unionized, the average pay is $3,888 per course, according to data reported to the Adjunct Project as of last month. In Texas, by contrast, a state where unions are rare, the reported pay is lower: $2,805 per course. Harvard pays adjuncts $11,037, on average, according to the data that adjuncts have submitted so far. Meanwhile, adjuncts at rural, medium-sized, two-year institutions—where pay is the lowest, according to the data submitted so far—average $1,808 per three-credit course."}, {"url": "http://www.ehow.com/info_7746220_average-adjunct-professor-community-college.html", "passage_text": "Wide Average Swings. Nationwide, for a three-credit course, the average pay for adjunct professors in 2013 was $2,987, according to The Chronicle of Higher Education. Two-year community colleges in rural areas typically pay the lowest, averaging about $1,808 nationally for a three-credit course. In California, the average pay for adjuncts at both two-and four-year schools is $3,888. Factors that also play a part in the salary range include subject taught, degree held by the professor and location of the school."}, {"url": "http://chronicle.com/article/Adjunct-Project-Shows-Wide/136439/", "passage_text": "Yet even within that category, pay differs widely. The average per-course pay reported for adjuncts at Ohio State University is $4,853, compared with an average of $6,500 reported at the University of Michigan at Ann Arbor. Harvard pays adjuncts $11,037, on average, according to the data that adjuncts have submitted so far. Meanwhile, adjuncts at rural, medium-sized, two-year institutions—where pay is the lowest, according to the data submitted so far—average $1,808 per three-credit course."}]