[{"url": "http://www.adoptapet.com/pet/9775898-houston-texas-cat", "passage_text": "Why Adoption is a Great Option. Millicent, a Houston Domestic Mediumhair cat was adopted! Here's how you can benefit by looking at adoption as an option to buying a Domestic Mediumhair for sale in Houston, or seeking a Domestic Mediumhair cat from a breeder in Houston."}, {"url": "http://harrypotter.wikia.com/wiki/Millicent_Bulstrode", "passage_text": "First year. Millicent started her education at Hogwarts in 1991. Prior to the school year, she purchased her equipment from Diagon Alley, and brought her cat with her on the Hogwarts Express. During the Welcoming Feast, Millicent was sorted into the house of Slytherin whose head at the time was Severus Snape."}, {"url": "http://harrypotter.wikia.com/wiki/Millicent_Bulstrode", "passage_text": "This article is about the Slytherin student. You may be looking for the former Minister for Magic, Millicent Bagnold. Point me!. Millicent Bulstrode (b. 1979 or 1980) was a Slytherin student who attended Hogwarts School of Witchcraft and Wizardry from 1991 - 1998, in the same year as Harry Potter."}, {"url": "http://lifeinthedreamhouse.wikia.com/wiki/Barbie", "passage_text": "Barbie. 270 pages on this wiki. Barbara Barbie Millicent Roberts is the titular character and the main protagonist of Barbie: Life in the Dreamhouse. She lives in the Dreamhouse with her sisters Skipper, Stacie and Chelsea, as well as her pets Blissa the cat, Taffy the dog, and Tawny the horse."}, {"url": "http://www.ohbabynames.com/meaning/name/millicent/3152", "passage_text": "Millicent is a name adopted by the English from the Norman-French after the Conquest of 1066. Introduced as Milisende, the Old French (Frankish) form of the Germanic Amalswinthe, the name is ultimately derived from the elements “amal” meaning “work, labor” and “swinth” meaning “strength”."}, {"url": "http://www.ohbabynames.com/meaning/name/millicent/3152", "passage_text": "Children's Books on the Baby Name Millicent. Millicent and Meer (Richard Byrne) - Millicent is a little girl who has always wanted a cat. One day, as she is playing outside, a large shipping box falls from somewhere and lands right beside her. She peers inside and finds a strange looking but very friendly little animal."}]