[{"url": "https://www.ag.ndsu.edu/pubs/ansci/sheep/as1624.pdf", "passage_text": "2Energy and Protein Content of Feed Barley The nutrient content of barley (Table 1) compares favorably with that of corn, oats, wheat and milo, as reported by the National Research Council (NRC, 1996). Barley is used primarily as an energy and protein source in sheep diets. Barley also is higher in vitamins A and E than the other major cereal grains. Effect of Barley Processing in Sheep Diets A companion publication to this report, “Feeding Barley to Beef Cattle” (Lardy and Bauer, 1999), documents the advantages of processing barley for use in beef cattle diets."}, {"url": "http://barleyworld.org/sites/default/files/maltvs1.pdf", "passage_text": "Malt• Feed barley is used as food for animals. Varieties also differ in their feeding properties but unfortunately feed barley is simply sold by the ton. Feed barley prices are often so low that farmers grow other crops-if they can do so. • Hooded barley is a unique type of feed barley that has hoods, rather than awns. These types are usually cut green for hay or sil Th l k f ns ll s f s h in b th nim lsFeedsilage."}, {"url": "http://www.agriculturalproductsindia.com/fodder/fodder-barley.html", "passage_text": "Barley is one of the most widely cultivated cereals of the world after wheat, corn and rice. Its primary uses include animal feed, seed and malt production. This cereal belongs to the family of 'poaceae', a plant commonly known as grass. "}, {"url": "http://www.foddersystems.com/fodder-feed/barley.html", "passage_text": "Barley. Barley is a cereal grain that is commonly used in the finishing rations of cattle in the United States and Canada. These sprouts are high in protein and fiber, and are naturally balanced in protein, fat and energy. Compared to corn, barley fodder has 95% of the energy and higher digestibility. "}, {"url": "https://mosesorganic.org/farming/farming-topics/livestock/sprouted-barley-fodder-a-revolution-in-animal-feed/", "passage_text": "Some companies recommend mixing seeds–a favorite of Fodder Feeds is 2 pounds of barley and 2 ounces of sunflower seeds, which yields 20 pounds (on average, a 10:1 ratio) when sprouted in their system. A general rule of thumb is a yield of 1:7–one pound of barley seed will produce seven pounds of sprouted fodder. Sprouted fodder is not a new idea. There are references to sprouting small grains for fodder dating back at least to the 1600s. What is new is the technology and engineering that makes it economically competitive with other feeding options. Light, moisture and consistent heat are critical for sprouted fodder to work."}, {"url": "http://www.feedipedia.org/node/227", "passage_text": "1 The by-products of barley grain processing are used as feed: brewer's grains, brewer's yeast, malt culms (barley sprouts and rootlets), barley distillers and solubles, hulls, bran and barley feed (the by-product of pearl barley production) (OECD, 2004). 2  Barley forage can be fed to livestock as pasture, hay or silage. "}, {"url": "https://www.hort.purdue.edu/newcrop/Crops/Barley.html", "passage_text": "Barley is the fourth most important grain crop in the United States. Acreage planted in 1966 and 1967 averaged about 10.6 million, with an average yield for the two years of 381.7 million bushels. Barley is one of the most ancient of cultivated grains. Grains found in pits and pyramids in Egypt indicate that barley was cultivated there more than 5000 years ago. The most ancient glyph or pictograph found for barley is dated about 3000 B.C."}, {"url": "https://en.wikipedia.org/wiki/Barley", "passage_text": "Barley (Hordeum vulgare L.), a member of the grass family, is a major cereal grain. It was one of the first cultivated grains and is now grown widely. Barley grain is a staple in Tibetan cuisine and was eaten widely by peasants in Medieval Europe. Barley is the principal feed grain in Canada, Europe, and in the northern United States. A finishing diet of barley is one of the defining characteristics of western Canadian beef used in marketing campaigns."}, {"url": "http://vegetarian.about.com/od/glossary/g/barley.htm", "passage_text": "How to cook barley: Cooking barley is similar to cooking rice. Cover 1 cup of pearl barley with 2 cups of water or vegetable broth and simmer for 30-40 minutes before fluffing with a fork. Or, try using a rice cooker. Add 2 1/2 cups water per cup of barley. "}]