[{"url": "https://answers.yahoo.com/question/index?qid=20081129131221AA6XzQa", "passage_text": "Rating Newest Oldest. Best Answer: As the first three answerers agree, files downloaded from download.com are *safe*... but that doesn't mean that you can't get some (safe) junk from there ;-) My preferred download site is majorgeeks.com. Check them out too. Report Abuse. No No No Avoid CNET at all costs... it is capitalizing on it's past reputation as a trusted download site to spread malware ...CNET has recieved millions to attach junk/malicious downloads onto legitimate ones."}, {"url": "http://www.cnn.com/2009/TECH/expert.q.a/04/22/downloading.software/index.html", "passage_text": "Let's compare extremes. A site like CNET's download.com, with plenty of links to and from countless outside, big-name sources and well-written, in-depth reviews with detailed system requirements and clear notice of whether a piece of software was scanned for malware or not, is about as safe as safe gets on the Internet. 4. Always be wary of a forced download -- like your browser telling you that you need to install something in order to view a Web page. No! Just about the only browser plugin you need these days is Adobe Flash, and that should only be downloaded and installed from Adobe's Web site -- nowhere else."}, {"url": "https://en.wikipedia.org/wiki/Download.com", "passage_text": "Download.com is an Internet download directory website launched in 1996 as a part of CNET. Originally, the domain was download.com.com and is now download.cnet.com. The domain download.com attracted at least 113 million visitors annually by 2008 according to a Compete.com study. "}, {"url": "http://www.landzdown.com/web-news/are-cnet-com-downloads-safe!!!!/", "passage_text": "The new policy of CNET Download.com concerning the downloads coming from their site, involves a certain download and a possible installation of unwanted software which comes with their new installer. I see that pastywhitegurl was a victim of their new policy. All products on CNET Download.com now have a direct download link. However only CNET Installer Enabled products call it out separately with a Direct Download Link located underneath the green Download Now button. Bravo CNET."}, {"url": "https://nz.answers.yahoo.com/question/index?qid=20100423071659AAYPe3M", "passage_text": "Best Answer: The safest place online to get software. CNET and Download.com are owned by CBS. They check every piece of software before they allow it on their site to make sure it's safe and spyware/badware free. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100817064909AAVf7uu", "passage_text": "Rating Newest Oldest. Best Answer: If download.cnet.com is not safe, nothing is safe.. I use it all the time, it is the safest place to download software as all software they hosted are tested again and again before approval. I was just wondering if it is a safe website because I want to download the fave icon plugin for photoshop from there. So I REALLY want to know if its safe or not. 2 following."}, {"url": "http://www.answers.com/Q/Is_cnet_downloadcom_safe", "passage_text": "Making the world better, one answer at a time. CNET has been around for a very long time, and is almost completely safe. However, there is one specific keylogger program found on the site that is dangerous. Just be careful. Other than that, yes: CNET is completely safe. "}, {"url": "http://www.landzdown.com/web-news/are-cnet-com-downloads-safe!!!!/", "passage_text": "Those of you who think that the popular portal CNET Download.com, which offers software downloads, is a rather safe bet concerning malware, may be forced to reconsider. All products on CNET Download.com now have a direct download link. However only CNET Installer Enabled products call it out separately with a Direct Download Link located underneath the green Download Now button. Bravo CNET."}]