[{"url": "http://learn.org/articles/What_is_the_Average_Salary_for_Someone_with_a_Degree_in_Criminal_Justice.html", "passage_text": "Many people with bachelor's degrees in criminal justice decide to become police officers. PayScale.com reported in April 2014 that these professionals made salaries ranging from $30,705-$79,135 with a BS in Criminal Justice. PayScale.com reported that most probation officers with a BS in Criminal Justice earned between $29,012 and $72,069 in April 2014. The BLS reported that probation officers and correctional treatment specialists earned an average salary of $52,910 yearly in May 2013"}, {"url": "http://www.floridatechonline.com/resources/criminal-justice/criminal-justice-salary-guide/", "passage_text": "1 Probation officers are often employed with state and local governments, and earn a median salary of $46,530 according to the BLS. 2  The most experienced officers can earn as much as $78,860 a year. This exciting field offers a variety of career choices, so you can match your interests and skills with the ideal criminal justice salary for you. 1  Legal secretaries earn an average salary of $39,860, according to the U.S. Bureau of Labor Statistics (BLS). 2  Top-earning legal secretaries can bring in salaries of $62,290."}, {"url": "http://www.allcriminaljusticeschools.com/law-enforcement/criminal-justice-salaries/", "passage_text": "Legal and Criminal Justice Salaries. Legal, law enforcement, criminal investigation, forensics and corrections jobs are hot commodities in today’s job market, and a college degree or diploma will certainly give you a great advantage over non-college graduates. And criminal justice salaries usually go up when you have a college degree."}, {"url": "https://www.criminaljusticeschoolstoday.com/criminal-justice-degree-salary/", "passage_text": "Across the country criminal justice degree salary varies for police officers. Big cities, such as New York, Chicago, or Los Angeles pay the most, whereas smaller, remote areas pay less. This has a lot to do with risk factor of the job. Salaries range across the country between $31,000 and $81,000 a year. An average of the criminal justice degree salary or pay for that job will be listed. Again, this are averages. Actual salaries would be negotiated with individual employers upon hiring. Obviously, the higher the education the higher the pay (typically)."}, {"url": "http://learn.org/articles/What_is_the_Average_Salary_for_Someone_with_a_Degree_in_Criminal_Justice.html", "passage_text": "A bachelor's degree in criminal justice prepares graduates for jobs as paralegals. PayScale.com reported that most paralegals with a BS in Criminal Justice earned between $27,469 and $65,000 in April 2014. According to the BLS, the average yearly salary for paralegals and legal assistants was $51,170 in May 2013. PayScale.com reported that most probation officers with a BS in Criminal Justice earned between $29,012 and $72,069 in April 2014. The BLS reported that probation officers and correctional treatment specialists earned an average salary of $52,910 yearly"}, {"url": "http://www.floridatechonline.com/resources/criminal-justice/criminal-justice-salary-guide/", "passage_text": "1 Top-earning legal secretaries can bring in salaries of $62,290. 2  Probation officers are often employed with state and local governments, and earn a median salary of $46,530 according to the BLS. 3  The most experienced officers can earn as much as $78,860 a year. This exciting field offers a variety of career choices, so you can match your interests and skills with the ideal criminal justice salary for you. 1  Legal secretaries earn an average salary of $39,860, according to the U.S. Bureau of Labor Statistics (BLS). 2  Top-earning legal secretaries can bring in salaries of $62,290."}, {"url": "http://www.criminaljusticemajors.com/starting-salaries-for-criminal-justice-grads", "passage_text": "Private Sector Criminal Justice Positions. In the private sector, starting salaries in criminal justice can be quite high, even for a fresh-faced grad with a criminal justice degree and some internship experience. Of course, public-sector gigs often come with attractive benefits. Here’s what to expect if you go the private route. Private detective. "}, {"url": "http://www.floridatechonline.com/resources/criminal-justice/criminal-justice-salary-guide/", "passage_text": "Careers in criminal justice provide an excellent wage with real opportunities for advancement. Some positions require two-year degrees, while others require four-year degrees. Salaries for criminal justice degree holders tend to be higher than for those without associate’s or bachelor’s degrees in criminal justice. This exciting field offers a variety of career choices, so you can match your interests and skills with the ideal criminal justice salary for you. 1  Legal secretaries earn an average salary of $39,860, according to the U.S. Bureau of Labor Statistics (BLS). 2  Top-earning legal secretaries can bring in salaries of $62,290."}]