[{"url": "http://www.telegraph.co.uk/news/science/8120382/Inflation-and-earnings-what-is-the-cost-of-a-pint-of-beer.html", "passage_text": "Comments. The price of a pub pint of beer could soon go up to £4 and ‘has doubled in the last 19 years’ said The Guardian a while back, in an article warning about the soaring price of barley. There are inflation calculators on the Internet. Type in the amount and the year: the site does the sums and tells you the equivalent in today’s money. The results can be instructive. That 1991 pint cost around £1.40, which is £1.80 in today’s money. The current price is around £2.80, so beer really is more expensive. On the other hand, the average salary in 1991 was £19,000, and today it is £38,000. Relative to what we earn, a pint costs exactly the same as it did 19 years ago"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080719205857AAYFP5Z", "passage_text": "Wałbrzych ... Klubokawiarnia-nice place to have fun-casual warsaw price. Warsaw ... http://www.pintprice.com/region/Poland/ Food A cake in a Warsaw cafe café will cost you-3 8, zł a cup of coffee-4 10. Zł the price of a beer in a pub varies from 6 to 10. ... zł Wałbrzych ... Klubokawiarnia-nice place to have fun-casual warsaw price. Warsaw ... http://www.pintprice.com/region/Poland/ Food A cake in a Warsaw cafe café will cost you-3 8, zł a cup of coffee-4 10. zł"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080719205857AAYFP5Z", "passage_text": "Report Abuse. WARSAW POLAND Warsaw forum: Price of a beer in Warsaw-TripAdvisorTripAdvisor forums-Price of a beer in Warsaw-Visit TripAdvisor, your source for the web's best unbiased reviews of vacations, hotels, and resorts, ... http://www.tripadvisor.com/ShowTopic-g27... Wałbrzych ... Klubokawiarnia-nice place to have fun-casual warsaw price. Warsaw ... http://www.pintprice.com/region/Poland/ Food A cake in a Warsaw cafe café will cost you-3 8, zł a cup of coffee-4 10. zł"}, {"url": "http://www.dailymail.co.uk/travel/article-2655101/Most-expensive-cities-beer-London-Oslo-hit-wallet.html", "passage_text": "And Rio De Janeiro’s ‘achievement’ in sneaking into the top ten most pricey cities for a beer – with an average price of £1.39 – is testament to the rising cost of living in Brazil. Cheap, cheerful: Drinkers can expect more for their money in the bars of Rynek Starego Miasta in Warsaw. 1 New survey assesses the cost of a small beer in 40 cities around the world. 2  London is among the top five most expensive cities on the planet for a beer. 3  Warsaw, Berlin, Prague, Lisbon and Dublin are among the less costly cities."}, {"url": "http://www.averagejoesblog.com/reasons-visit-poland/", "passage_text": "As you can probably tell by the prices we’ve already given you, Poland is a lot cheaper than the UK. The average price for a pint is around £1.50, a meal at a restaurant costs around £10, and a swanky hotel room is equally reasonable. During our time in Warsaw, for instance, we stayed in the H15 Boutique, one of the most luxurious hotels in Poland, for £70 per night. "}, {"url": "http://www.pintprice.com/city.php?/Warsaw/Poland/gbp.htm", "passage_text": "Added on Average price of a recent four day trip to Warsaw. Average price was 8-9 zloty per 500ml glass. Thanks. Added on Don't believe those prices-pint costs on average £1.50 but can be found in bars for £1.00. Added on In the more expensive bars it might cost you 1.50GBP but in most places it's under a pound. Cheap beer and the most fantastic women, what more could you want. Added on Chopins Bar"}, {"url": "http://www.pintprice.com/city.php?/Warsaw/Poland/gbp.htm", "passage_text": "Added on You'll pay around £1.50GBP for a pint in Warsaw but around half of outwith the capital, except Krakow which is around £1 a pint. Added on Pretty standard price in warsaw, not bad and most women there are stunning. Thanks. Added on Don't believe those prices-pint costs on average £1.50 but can be found in bars for £1.00. Added on In the more expensive bars it might cost you 1.50GBP but in most places it's under a pound."}]