[{"url": "https://en.wikipedia.org/wiki/Pangaea", "passage_text": "Pangaea or Pangea (/paenˈdʒiːə/) pænˈdʒiːə was a supercontinent that existed during the Late paleozoic and Early mesozoic. eras When Rodinia broke up, it split into three pieces: the supercontinent of Proto-Laurasia, the supercontinent of Proto-Gondwana, and the smaller Congo craton. Proto-Laurasia and Proto-Gondwana were separated by the Proto-Tethys Ocean."}, {"url": "http://www.bbc.co.uk/science/earth/earth_timeline/pangaea", "passage_text": "Pangaea (sometimes spelled Pangea), the most recent of a series of supercontinents on Earth, formed about 270 million years ago and broke apart about 200 million years ago. At this time most of the dry land on Earth was joined into one huge landmass that covered nearly a third of the planet's surface. It assembled from earlier continental units approximately 300 million years ago, and it began to break apart about 175 million years ago. In contrast to the present Earth and its distribution of continental mass, much of Pangaea was in the southern hemisphere and surrounded by a super ocean, Panthalassa."}, {"url": "http://www.bbc.co.uk/science/earth/earth_timeline/pangaea", "passage_text": "Pangaea begins to break up. Pangaea or Pangea (/paenˈdʒiːə/) pænˈdʒiːə was a supercontinent that existed during the Late paleozoic and Early mesozoic. Eras it assembled from earlier continental units approximately 300 million years, ago and it began to break apart about 175 million years. ago It assembled from earlier continental units approximately 300 million years ago, and it began to break apart about 175 million years ago. In contrast to the present Earth and its distribution of continental mass, much of Pangaea was in the southern hemisphere and surrounded by a super ocean, Panthalassa."}, {"url": "http://geography.about.com/od/physicalgeography/a/Pangea.htm", "passage_text": "Pangea began to break up about 200 million years ago as a result of the movement of the Earth's tectonic plates and mantle convection. Just as Pangea was formed by being pushed together due to the movement of the Earth's plates away at rift zones, a rift of new material caused it to separate. "}, {"url": "http://www.answers.com/Q/When_was_Pangaea_or_Pangea_broken_up", "passage_text": "Pangea began its break up in the Triassic Period. North America and Gondwana first separated followed by the separation of Mexico with South America and North America with Africa. The Atlantic ocean began to form in the Northern hemisphere. Pangaea was a supercontinent that formed around 300 million years ago and began to break up around 175 million years ago. It was a roughly C-shaped landmass that had all of ou … r modern continents together as one. Its name is Ancient Greek."}, {"url": "https://answers.yahoo.com/question/index?qid=20090427204919AAaJkgc", "passage_text": "Pangaea was a supercontinent consisting of all of Earth's land masses. It existed from the Permian through Jurassic periods. It began breaking up during the late Triassic period. Pangaea started to break up into two smaller supercontinents, called Laurasia and Gondwanaland, during the late Triassic. It formed the continents Gondwanaland and Laurasia, separated by the Tethys Sea. "}, {"url": "http://www.livescience.com/38218-facts-about-pangaea.html", "passage_text": "About 200 million years ago, the supercontinent began to break up. Gondwana (what is now Africa, South America, Antarctica, India and Australia) first split from Laurasia (Eurasia and North America). Then about 150 million years ago, Gondwana broke up. "}, {"url": "https://en.wikipedia.org/wiki/Pangaea", "passage_text": "The second major phase in the break-up of Pangaea began in the Early Cretaceous (150–140 Ma), when the minor supercontinent of Gondwana separated into multiple continents (Africa, South America, India, Antarctica, and Australia). When Rodinia broke up, it split into three pieces: the supercontinent of Proto-Laurasia, the supercontinent of Proto-Gondwana, and the smaller Congo craton. Proto-Laurasia and Proto-Gondwana were separated by the Proto-Tethys Ocean."}, {"url": "https://answers.yahoo.com/question/index?qid=20090127190137AAYLSub", "passage_text": "Report Abuse. Pangaea was a supercontinent consisting of all of Earth's land masses. It existed from the Permian through Jurassic periods. It began breaking up during the late Triassic period. There were three major phases in the break-up of Pangaea. The first phase began in the Early-Middle Jurassic, when Pangaea created a rift from the Tethys Ocean in the east and the Pacific in the west"}]