[{"url": "https://cdowk.powerschool.com/powerschool-webhelp/gradebook/WebHelp/about_importing_exporting.htm", "passage_text": "About Importing and Exporting. PowerTeacher Gradebook provides the tools for exporting Scoresheet information for a single assignment from PowerTeacher Gradebook into a comma-separated values (csv) text file using the PowerTeacher Score Template. The file can then be used to record assignment scores offline. Note: A lthough the PowerTeacher Gradebook import function only imports scores for a single assignment at a given time, your import file may contain assignment score information for several assignments."}, {"url": "http://powerschool.misd.net/wp-content/uploads/2012/12/Test-Score-Import.pdf", "passage_text": "Delimited Text File sample for MME. MISD PowerSchool Document: Importing Test Scores 4 Fixed Format Text file sample for PLAN Connection to PowerSchool to obtain the student number Some test files do not have the PowerSchool student number. The program has the capability to find the student number using: 1. The program only extracts the fields specified with a PowerSchool field name. Verify the field names, the data values, and the PowerSchool field names match up before running the conversion program. The Student_Number and Test_Date fields are required for PowerSchool to import records into the test scores file."}, {"url": "http://www.tularosa.k12.nm.us/powerschool/Documentation/User%20Guides/importexport_3.6.0.pdf", "passage_text": "Click Import.Note: When importing test score data, the Select Test page appears instead. For more information,see the section  How to Import Test Scores .On the Import Records from an ASCII Text File page, determine into which PowerSchool fields thesystem will import each field of data from the file. Meal Transactions Table For the Meal transactions table, select the Use PowerSchool’s internal student id numberscheckbox if you want the system to reference the ID field versus the student_number field. Import and Export User GuideImport and Export © 2003 Apple Computer, Inc. All rights reserved. 11 • If you do not select the Suggest field map checkbox or you need to change the fields, usethe pop-up menu to choose the PowerSchool field into which the system imports the datafrom the import"}, {"url": "http://powerschool.misd.net/wp-content/uploads/2012/12/Test-Score-Import.pdf", "passage_text": "A general purpose PowerSchool import utility program is used to convert the test score files into the proper format. The benefit to this approach is only one program supports all the test score import files. The program only extracts the fields specified with a PowerSchool field name. Verify the field names, the data values, and the PowerSchool field names match up before running the conversion program. The Student_Number and Test_Date fields are required for PowerSchool to import records into the test scores file."}, {"url": "http://www.misd.net/powerschool/pdf/psimporttestscore.pdf", "passage_text": "Page 1 of 11 PowerSchool Test Score Import The test score files received from the ACT, MEAP, MME, and STAR testing organizations are converted to a tab delimited file. The tab delimited file is then imported into PowerSchool using the quick import function for test scores. This is the test score file received from the testing organization. The file can be a delimited format (comma, semi-colon, tab, space, or other) or a text file with fixed format records. 2. Output file name is created for input to PowerSchool."}, {"url": "https://cdowk.powerschool.com/powerschool-webhelp/gradebook/WebHelp/about_importing_exporting.htm", "passage_text": "Once you are finished recording assignment scores, you can then import the updated information back into PowerTeacher Gradebook. In addition to the PowerTeacher Score Template, you can also import scores for a single assignment using a variety of file formats from third party applications. Note: A lthough the PowerTeacher Gradebook import function only imports scores for a single assignment at a given time, your import file may contain assignment score information for several assignments."}, {"url": "http://www.misd.net/powerschool/pdf/psimport.pdf", "passage_text": "The PowerSchool Import File Utility Program converts comma separated value (CSV) files and text (TXT) files, with fixed format records, into a tab delimited file. The tab delimited file is then used by the PowerSchool quick import, loading data into the system. UIC conversion field name to “Student_Number” for importing into PowerSchool. The “OrigStuID” option finds the related student number in PowerSchool using the ORIG_STUDENT_ID. field. The conversion routine changes the heading of the related data conversion field name, to."}]