[{"url": "http://www.delta.com/content/www/en_US/traveling-with-us/special-travel-needs/children.html", "passage_text": "The Unaccompanied Minor Program is required for all children 5-14 years old when not traveling in the same compartment with an adult who is at least 18 years old or the child's parent/legal guardian. The program is optional for children 15-17 years old."}, {"url": "https://www.southwest.com/html/customer-service/family/unaccompanied-minors-pol.html", "passage_text": "1 Children ages five through 11 traveling without an accompanying Passenger age 12 or older must travel as an Unaccompanied Minor (UM) on Southwest Airlines. 2  For travel booked on or after April 23, 2010, Southwest Airlines will charge $50 each way ($100 roundtrip) in addition to the air fare per child for UMs to travel."}, {"url": "http://airconsumer.ost.dot.gov/publications/KidsAlone.pdf", "passage_text": "Children under the age of 5 must always be accompanied by someone at least 12 years of age flying in the same cabin (18 years of age on some airlines); airlines do not allow kids under 5 to fly alone."}, {"url": "http://airconsumer.ost.dot.gov/publications/KidsAlone.pdf", "passage_text": "Your child can also use cash to buy a ticket at an airport, an airline’s city ticket office, or a travel agency. • As noted below, at age 15 most airlines will allow a child to fly alone on domestic flights without any unaccompanied-minor procedures. Some airlines permit this for kids as young as 12."}, {"url": "http://www.airsafe.com/kidsafe/kidrules.htm", "passage_text": "Most airlines allow a child under the age of 18 to fly alone, and the rules and restrictions for what they call unaccompanied children are different for each airline."}, {"url": "http://www.airsafe.com/kidsafe/kidrules.htm", "passage_text": "Airlines treat children traveling alone differently depending on the age of the child. Most airlines have a minimum age for their unaccompanied child service, typically five, and a maximum age, typically 12. Children younger than the minimum age will have to travel with an adult."}, {"url": "http://www.independenttraveler.com/travel-tips/family-travel/children-flying-solo", "passage_text": "General Age Guidelines. Airline rules vary, but here's a good idea of what to expect on domestic flights: Children ages 1 - 4 may fly only when accompanied by an adult. A child must be at least 5 to fly alone. Kids ages 5 - 7 can take a direct flight to a single destination but not connecting flights. Those 8 and up may change aircraft on some airlines."}]