[{"url": "https://en.wikipedia.org/wiki/Gestation", "passage_text": "Gestation is the carrying of an embryo or fetus inside female viviparous animals. It is typical for mammals, but also occurs for some non-mammals. Mammals during pregnancy can have one or more gestations at the same time (multiple gestations). The time interval of a gestation is called the gestation period. In human obstetrics, gestational age refers to the embryonic or fetal age plus two weeks. This is approximately the duration since the woman's last menstrual period (LMP) began. Human pregnancy can be divided roughly into three trimesters, each approximately three months long. The first trimester is from the last period to the 13th week, the second trimester is from the 14th to 27th week, and the third trimester is from the 28th week to the 42nd week."}, {"url": "http://medical-dictionary.thefreedictionary.com/gestation+period", "passage_text": "gestation period. The period of pregnancy from conception to parturition. Average length is 10 lunar months or 280 days measured from the onset of the last menstrual period, but length varies from 250 to 310 days. See also: period."}, {"url": "http://www.vaughns-1-pagers.com/biology/gestation-periods.htm", "passage_text": "Gestation Periods Chart. by Vaughn Aubuchon. Here is a pregnancy period comparison chart of human babys, selected pets and other mammals. The length of a human pregnancy is usually referred to as 9 months for a baby, which is not completely accurate. It's eight days less. The length of time in the womb for humans and other mammals varies considerably, based mostly upon size."}, {"url": "http://www.ibuzzle.com/articles/gestation-period-for-humans.html", "passage_text": "This interval between the last menstrual period to childbirth is roughly 40 weeks. Thus, the gestation period for humans in days can be calculated as 280 days. However, the actual gestation period, as compared to other mammals, is around 267 days. But then what is the average gestation period for humans? It is taken to be about 259 to 294 days. Therefore, if the birth occurs in between 259 to 294 days, it is considered to be normal, while if it takes place before 259 days, it is termed as pre-term, and if it happens after 294 days, it is called post term."}, {"url": "http://www.wisegeek.org/what-is-the-gestation-period.htm", "passage_text": "For example, the average human gestation period is 38 weeks. Gestation may normally last anywhere from 37 to 42 weeks, however, and be considered well within the healthy range. Any child born before 37 weeks is considered preterm, and this can be accompanied by any number of health risks. The gestation period in humans is equal to the amount of time spent in gestation, plus two weeks. In other animals, the period may or may not include an extra amount of time, depending on how it is calculated."}, {"url": "http://www.sjsu.edu/faculty/watkins/gestation.htm", "passage_text": "Gestation Periods and Animal Scale. The gestation period of humans is 266 days, 8 days short of nine months. Many such biological characteristics have an explanation in terms evolutionary survival value. Even some seemingly cultural characteristics of human society have such a biological explanation. And the gestation periods of chimpanzees (237 days), gorilla (257 days) and orangutan (260 days) indicate that the approximate nine-month gestation period predates the emergence of human beings as a species."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=10675", "passage_text": "Gestation period: Fetal development period from the time of conception until birth. For humans, the full gestation period is normally 9 months. "}, {"url": "http://www.ibuzzle.com/articles/gestation-period-for-humans.html", "passage_text": "The time during which the embryo or fetus gets fully developed in the uterus is called the gestation period or pregnancy. But in the case of gestation period for humans, the accurate time of ovulation and therefore the time of fertilization is hard to determine. But then what is the average gestation period for humans? It is taken to be about 259 to 294 days. Therefore, if the birth occurs in between 259 to 294 days, it is considered to be normal, while if it takes place before 259 days, it is termed as pre-term, and if it happens after 294 days, it is called post term."}]