[{"url": "http://www.webmd.com/skin-problems-and-treatments/tc/cold-sores-topic-overview", "passage_text": "Cold sores are caused by the herpes simplex virus (HSV) . There are two types of herpes simplex virus: HSV-1 and HSV-2. Both virus types can cause sores around the mouth (herpes labialis) and on the genitals (genital herpes). Cold sores can also be spread to other areas of the body. The first symptoms of cold sores may include pain around your mouth and on your lips, a fever, a sore throat, or swollen glands in your neck or other part"}, {"url": "http://www.gurl.com/2013/11/09/if-you-have-cold-sores-does-that-mean-you-have-herpes-facts/", "passage_text": "You’re right, cold sores are a form of herpes – but not necessarily a form of the sexually transmitted disease herpes. It’s a little confusing, but basically it means that having a cold sore doesn’t automatically mean you have an STD. "}, {"url": "https://en.wikipedia.org/wiki/Cold_sores", "passage_text": "Herpes labialis (also called cold sores, fever blisters, herpes simplex labialis, recurrent herpes labialis, or orolabial herpes) is a type of herpes simplex occurring on the lip, i.e. an infection caused by herpes simplex virus (HSV). An outbreak typically causes small blisters or sores on or around the mouth. "}, {"url": "https://www.zocdoc.com/answers/9772/if-i-get-cold-sores-on-my-lip-does-it-mean-i-have-herpes", "passage_text": "Oral herpes is a very common type of infection that is caused by the herpes simplex virus. Many cold sores that people get from time to time are caused by one of the herpes viruses. The herpes simplex virus as two different types. About 10% of the cold sores are caused by herpes simplex type 2 and about 10% of the genital herpes infections are caused by herpes simplex type 1. Thus, for the most part type 1 is associated with the cold sores and type 2 is associated with the genital infection"}, {"url": "http://www.ehow.com/about_5332480_do-sores-always-mean-herpes.html", "passage_text": "HSV-1 is associated with cold sores (also called fever blisters), while herpes simplex 2 (HSV-2) is the main cause of genital herpes. But the herpes virus also causes many other illnesses, such as shingles, the Epstein Barr virus and a skin condition called Kaposi's sarcoma. Genital herpes is most often caused by skin-to-skin contact. However, if you have a cold sore, you can give someone genital herpes by infecting them with the HSV-1 virus. They won't have genital herpes caused by HSV-2, but genital herpes caused by HSV-1."}, {"url": "https://answers.yahoo.com/question/index?qid=20080903212023AAD6IGD", "passage_text": "Cold sores can be transmitted even when the person does not have a cold sore, though it is less likely to happen then. There is no over-the-counter medication or home remedy that cures cold sores. Only time will take care of that. But there is a good prescription medication for cold sores. "}, {"url": "http://www.webmd.com/skin-problems-and-treatments/guide/understanding-cold-sores-basics", "passage_text": "Cold sores are usually caused by the herpes simplex virus (HSV) type 1, which is transmitted by such forms of contact as kissing an infected person or sharing eating utensils, towels, or razors. Genital herpes is usually caused by herpes simplex virus type 2. A person with a cold sore who performs oral sex on another person can give that person genital lesions with HSV-1. Similarly, a person who performs oral sex on another person with genital HSV-2 lesions can develop oral lesions. Sores may develop as late as 20 days after exposure to the virus."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/cold-sores-topic-overview", "passage_text": "Cold Sores-Topic Overview. Cold sores, sometimes called fever blisters, are groups of small blisters on the lip and around the mouth. The skin around the blisters is often red, swollen, and sore. The blisters may break open, leak a clear fluid, and then scab over after a few days. Cold sores can also be spread to other areas of the body. The first symptoms of cold sores may include pain around your mouth and on your lips, a fever, a sore throat, or swollen glands in your neck or other part"}, {"url": "http://www.webmd.com/skin-problems-and-treatments/guide/understanding-cold-sores-basics", "passage_text": "Cold sores -- also called fever blisters -- are a painful infection caused by the herpes simplex virus (HSV). These blisters are usually caused by HSV type 1, but can less commonly be due to HSV type 2. A person with a cold sore who performs oral sex on another person can give that person genital lesions with HSV-1. Similarly, a person who performs oral sex on another person with genital HSV-2 lesions can develop oral lesions. Sores may develop as late as 20 days after exposure to the virus."}]