[{"url": "http://smallbusiness.chron.com/show-mortgage-interest-expense-balance-sheet-71333.html", "passage_text": "On the balance sheet, assets equal liabilities plus owner's equity -- or shareholders' equity if your company is a corporation. Because all balance sheets must adhere to this equation, what your company owns needs to equal what it owes to creditors and owners. The mortgage interest paid on your office appears on the income statement. Jupiterimages/Pixland/Getty Images. Your company's financial statements are relevant to you, your investors and your lenders. The income statement shows the revenues, expenses and profits your company generates over a given period."}, {"url": "http://www.investopedia.com/terms/e/ebit.asp", "passage_text": "EBIT measures the profit a company generates from its operations, making it synonymous with operating profit.. By ignoring tax and interest expenses, it focuses solely on a company's ability to generate earnings from operations, ignoring variables such as the tax burden and capital structure. This focus makes EBIT an especially useful metric for certain applications. DEFINITION of 'Earnings Before Interest & Tax-EBIT'. An indicator of a company's profitability, calculated as revenue minus expenses, excluding tax and interest. EBIT is also referred to as operating earnings, operating profit and profit before interest and taxes (PBIT)."}, {"url": "http://www.investopedia.com/terms/m/minorityinterest.asp", "passage_text": "2. If ABC Corp. owns 90% of XYZ inc, which is a $100 million company, on ABC Corp.'s balance sheet, there would be a $10 million liability in minority interest account to represent the 10% of XYZ Inc. that ABC Corp does not own. RELATED TERMS."}, {"url": "http://macabacus.com/accounting/noncontrolling-interest", "passage_text": "Suppose that in 2008 Alpha acquired 80% of the equity interest in subsidiary Sierra from Tango, which owns the 20% noncontrolling interest. On Jan 1, 2009, Alpha's total equity balance is $1,000 and Tango's noncontrolling interest is $100. During 2009, Sierra generates a net loss of $600. Noncontrolling interest (NCI) is the portion of equity ownership in a subsidiary not attributable to the parent company, who has a controlling interest (greater than 50% but less than 100%) and consolidates the subsidiary's financial results with its own."}, {"url": "http://smallbusiness.chron.com/net-income-after-tax-balance-sheet-13697.html", "passage_text": "How to Find Net Income After Tax on a Balance Sheet. A company's balance sheet shows the various aspects of the company's financial health and how well it performed during the year or other specified time period. Subtract the cost of goods sold plus any overhead or other costs to produce the goods to find the gross profit. For example, if your total revenue equals $900,000 and your costs of goods sold equals $500,000, subtract $500 from $900 to get $400,000. Related Reading: How to Figure Local Net Savings on a Balance Sheet. Step 3. Subtract any administrative expenses and costs of making the sale to find the net income before taxes. Continuing the example, if you have $100,000 in administrative costs, subtract $100,000 from $400,000 to get $300,000"}, {"url": "http://www.answers.com/Q/Where_does_interest_paid_on_loan_go_in_the_balance_sheet", "passage_text": "Joe Bob. Interest paid on a loan does not go directly on the balance sheet as correctly stated by Muscat and instead is seen as a line item on the profit and loss statement. Indirectly however, paid interest is a reduction of cash (cr entry) and owners' equity (dr entry) which obviously effects the balance sheet. "}, {"url": "http://www.readyratios.com/reference/accounting/non_controlling_interest_nci.html", "passage_text": "The 25% of Beta's equity that Alpha does not own is recorded on Alpha's balance sheet as Non-controlling interest. Consolidated net income will be allocated to the parent and non-controlling interests in proportion to their ownership percentages i.e. 75% to Alpha and 25% to the non-controlling interests. "}, {"url": "http://smallbusiness.chron.com/net-income-after-tax-balance-sheet-13697.html", "passage_text": "Subtract any income taxes paid from the net income before taxes to find the net income after taxes. Completing the example, if your taxes equal $120,000, subtract that from $300,000 to get a net income after tax of $180,000. Subtract the cost of goods sold plus any overhead or other costs to produce the goods to find the gross profit. For example, if your total revenue equals $900,000 and your costs of goods sold equals $500,000, subtract $500 from $900 to get $400,000. Related Reading: How to Figure Local Net Savings on a Balance Sheet. Step 3. Subtract any administrative expenses and costs of making the sale to find the net income before taxes. Continuing the example, if you have $100,000 in administrative costs, subtract $100,000 from $400,000 to get $30"}]