[{"url": "http://skyworksmarketing.com/tv-commercial-cost/", "passage_text": "The main surprise is how inexpensive TV advertising can be. (Having said that, the least expensive options may not be the best opportunities, either). Overall, the cost of producing a commercial can run from as little as $1,000 and upwards to hundreds of thousands of dollars. A more practical average could be from $3000 to $25,000. Following are some fundamentals about TV advertising costs"}, {"url": "http://www.ehow.com/about_5448301_average-cost-tv-commercial.html", "passage_text": "Costs. The cost of a television advertisement often depends on where the ad is placed. For example, national TV spots on the final of the popular show Survivor sold for $1 million, and commercials sold for $750,000 on Who Wants to Be a Millionaire.."}, {"url": "http://smallbusiness.chron.com/much-television-advertising-really-cost-58718.html", "passage_text": "Production costs to create a commercial range in price from free to hundreds of thousands of dollars. According to Entrepreneur, some independent television stations will produce your ad for free if you sign up for a minimum of three months of commercial spots. Local television stations typically charge from $200 to $1,500 to create a 30-second commercial. National commercials produced by an advertising agency cost far more, averaging $342,000 for a 30-second spot in 2008, according to the American Association of Advertising Agencies. If your target market is most likely to see your ad during the local news at noon, you may pay anywhere from $200 to $1,500 for a 30-second spot during that time, says Entrepreneur. Commercials that run between the prime viewing hours between 6 to 7 p.m. cost the most."}, {"url": "http://smallbusiness.costhelper.com/business-cards.html", "passage_text": "1 At VistaPrint.com, premium business cards vary from $14.99 for 250 matte-finish cards on standard paper to $66.48 for 2,000 cards on upgraded glossy stock (about $0.04-$0.06 each); with additional charges of $3.75-$5 to upload a logo or photo, or $7.50-$15 for a foil accent. 1 For a more custom card from scratch, most stores provide basic business card layout and design for $25-$120 or more depending on location, the complexity of the project and the number of revisions. 2  For example, FedEx Office offers color business cards starting at $20-$30 for 250."}, {"url": "http://www.gaebler.com/Television-Advertising-Costs.htm", "passage_text": "Not surprisingly, the cost to produce the commercial goes up as the quality and complexity of the commercial increases. Small-to medium-sized businesses cannot afford to invest $350,000 in a single commercial. But, decent quality TV commercials can be produced for as little as $1,000 if you know where to look. Commercial time is sold in 30-second spot blocks. The cost of a 30-second spot varies according to the number of viewers expected to be watching it. The standard half-hour of television contains 22 minutes of program and 8 minutes of commercials - 6 minutes for national advertising and 2 minutes for local."}, {"url": "http://smallbusiness.costhelper.com/business-cards.html", "passage_text": "1 Eliminating the VistaPrint logo text on the back of the free business cards costs $2-$5 extra. 2  Create do-it-yourself business cards with a computer by using blank business card forms designed to be used in standard printers, at a cost (for the paper) of about $0.05-$0.10 per card. 1 For a more custom card from scratch, most stores provide basic business card layout and design for $25-$120 or more depending on location, the complexity of the project and the number of revisions. 2  For example, FedEx Office offers color business cards starting at $20-$30 for 250."}, {"url": "http://www.gaebler.com/Television-Advertising-Costs.htm", "passage_text": "(article continues below). When pricing a television commercial, you need to weigh the costs of two separate things: (1) the cost of producing the commercial, and (2) the cost of airing it. It has been estimated that the average cost of producing a 30-second national TV commercial is nearly $350,000. Commercial time is sold in 30-second spot blocks. The cost of a 30-second spot varies according to the number of viewers expected to be watching it. The standard half-hour of television contains 22 minutes of program and 8 minutes of commercials - 6 minutes for national advertising and 2 minutes for local."}, {"url": "http://www.ehow.com/about_5448301_average-cost-tv-commercial.html", "passage_text": "Tactics. So you've gotten past the cost factor and you're ready to make a TV commercial to take your business or product to the next level. The first thing to do is to establish a budget that will help you determine how much you can spend to make the commercial and then to air it. The cost of a television advertisement often depends on where the ad is placed. For example, national TV spots on the final of the popular show Survivor sold for $1 million, and commercials sold for $750,000 on Who Wants to Be a Millionaire.."}, {"url": "http://www.ehow.com/about_5448301_average-cost-tv-commercial.html", "passage_text": "There is no real average cost to make a TV commercial; the costs vary widely depending on what production company or agency you use, the quality of the ad you want, and when and on what channel or channels the commercial will be broadcast. Other People Are Reading. The cost of a television advertisement often depends on where the ad is placed. For example, national TV spots on the final of the popular show Survivor sold for $1 million, and commercials sold for $750,000 on Who Wants to Be a Millionaire.."}]