[{"url": "http://www.feryal.co/blog/what-is-pu-leather/", "passage_text": "There is a difference between regular or original leather and PU leather. PU leather can be described as faux leather or synthetic leather. It sometimes consists of split leather combined with a layer of polyurethane which is embossed onto the surface. It is also referred to as bicast leather but has some similarities to original or genuine leather."}, {"url": "https://answers.yahoo.com/question/index?qid=20090219201312AAohR7m", "passage_text": "PU synthetic leather (also known as bi-cast leather, bycast leather or artificial leather, sometimes described as split leather) is a material made with asplit leather backing covered with a layer of polyurethane (hence the term PU leather) that is applied to the surface and then embossed."}, {"url": "https://en.wikipedia.org/wiki/Bicast_leather", "passage_text": "From Wikipedia, the free encyclopedia. Bicast leather (also known as bi-cast leather, bycast leather, or PU leather, sometimes described as split leather) is a material made with a split leather backing covered with a layer of polyurethane (hence the term PU leather) that is applied to the surface and then embossed."}, {"url": "https://answers.yahoo.com/question/index?qid=20090219201312AAohR7m", "passage_text": "I am going to about PU Leather PU leather, sometimes described as split leather) is a material made with a split leather backing covered with a layer of polyurethane (hence the term PU leather) that is applied to the surface and then embossed."}, {"url": "http://www.ebay.com.au/gds/PU-Leather-Better-than-the-real-thing-/10000000176902667/g.html", "passage_text": "PU leather, also known as bicast leather or split-leather is a man-made material made with a split leather backing covered with a layer of PU (polyurethane) that is applied to the surface and then embossed."}, {"url": "http://forums.macrumors.com/threads/pu-leather-explained.945791/", "passage_text": "Bicast leather (also known as bycast leather, split leather or PU leather) is a split leather with a layer of polyurethane applied to the surface and then embossed. Bycast was originally made for the shoe industry and recently was adopted by the furniture industry."}, {"url": "http://www.ask.com/science/pu-leather-made-b63cb7855070b43a", "passage_text": "Polyurethane, or PU, coated leather is split hide leather that is bonded and covered with a polyurethane coat, and then embossed with grain patterns to simulate the appearance of top grain leather. PU is also known as bicast leather and split hide leather."}, {"url": "https://answers.yahoo.com/question/index?qid=20090219201312AAohR7m", "passage_text": "Best Answer: PU leather, aka Bycast Leather, is Reconstituted Leather (small leather scraps) or Bonded Leather that is layered with thick Polyurethane to give it a sheen like real leather."}]