[{"url": "http://www.ehow.com/info_8537041_roof-rafter-calculations.html", "passage_text": "A 5 pitch rafter on a 12-foot run, for instance, will be 13 feet or 156 inches. The birdsmouth is calculated from that point on the bottom of the rafter to 3 1/2 inches back up the board and 1 inch up into the board, to make the triangle. Calculating length requires using a table on the fat leg (blade) of the square. It has six lines, starting with length of common rafters per foot of run.. Checking the pitch will show how long a rafter must be to cover each foot of run. For a 5 pitch roof, that's 13, or 13 inches for every foot of run. It will vary with the pitch -- a 4 pitch is 12.65 inches per foot, a 6 pitch 13.42 inches"}, {"url": "http://www.front-porch-ideas-and-more.com/rise-and-run.html", "passage_text": "To find the length of your rafters, multiply the run in inches by the rafter length factor and divide by 12. For example: The run is 96 x 12.65 (length factor for a 4/12 roof) = 1214.4 divided by 12 =101.2 inches. Not quite done yet! Add that to the 102.2 inches (101.2 plus 14.75 = 115.95 or 116 inches). Your rafters will need to be at least 116 inches long. Porch Home / Build a Porch / Roofing Materials Comparison. If your rise and run (or slope) is 4/12, multiply the square footage above (504) by 1.06. 1496 x 1.06 = 534.24 square feet. You did it-the area of your porch roof would be 534.24 square feet."}, {"url": "http://www.diychatroom.com/f9/2x4-rafters-roofing-question-119769/", "passage_text": "2x4 rafters/roofing question... i helped a friend build his garage's roof, kinda of uncomfortable. he says lowes told him he could use 2x4 for rafters with 1/2 inches plywood for asphalt shingles. the rafters are 18 foot long without beams or trusses (garage 28x40). he's already got the 2x4 up for rafters and it's ready for laying plywood tomorrow. i told him plywood and asphalt shingles would be too heavy. he could get his money back for the plywood and do tin roof setup instead."}, {"url": "http://www.pole-barn.info/roof-rafter-calculations.html", "passage_text": "Our roof rafter calculator tools are handy for calculating the number of rafters needed, rafter length calculator, lineal feet of rafter, board feed in ridge and sub-facia,and the total board feet in the roof. Rise and Run means that a 6/12 pitch roof has 6 of rise (vertical) for each foot of run (horizontal). This is based upon the span of the rafter (horizontal span, not total rafter length), live and dead loads. To size joists and rafters use the Maximum Span Tables for southern yellow pine. This Rafter Span Calculator is species specific for Douglas Fir, hemlock, etc. More Roof Calculators."}, {"url": "http://www.justanswer.com/home-improvement/2mo39-need-advice-constructing-long-rafters-putting.html", "passage_text": "Need advice about constructing long rafters. We are putting a shed-style addition onto an existing cabin. The cabin is 13 ft wide and its roof is built with 2x6 rafters 24 oc. The addition will extend 13 ft to the side. The contractor built the addition roof on top of the old roof. "}, {"url": "http://www.vancehester.com/gablerafters.html", "passage_text": "You will want to determine the depth of the rafter you are permitted to cut away. It is usually 25% to 30%, in this example I will use the former giving me a total rise for my plumb cut of 7 5/16 and mark this in front of the tongue on your framing square. Calculating Gable Roof rafters for normal gable roofs are cut the same way as the common rafters when figuring for a regular pitched hip roof. Dividing the span of the building in half and deducting half the ridge thickness will give you the run measurement to be used in this calculation."}, {"url": "http://www.constructionknowledge.net/public_domain_documents/Div_6_Woods_Plastics/Partial%20Carpentry%20pdfs/Roof_Framing_&_Roofing_%20Army_FM5-426.pdf", "passage_text": "Step 5. Since the length of the rafter is known to be 12 feet and 1/6 inch, measure the distancefrom the top of the plumb cut and mark it on the timber. Hold the square in the same manner withthe 8 mark on the tongue directly over the 12-foot 1/6-inch mark. The rafter length of any building may be determined by stepping it off bysuccessive steps with the square, as follows: Step 1. Step off the same number of steps as there are feet in the run. For example, if a building is20 feet 8 inches wide, the run of the rafter would be 4 inches over 10 feet."}, {"url": "http://www.front-porch-ideas-and-more.com/rise-and-run.html", "passage_text": "If your roof has a rise and run of 3/12 or less, multiply length times width. That was easy. For roofs over 3/12 measure multiply the length of your home by the width of your home after you add in the overhang. If you have a 1 foot overhang add 2 feet to the width and 2 feet to length. Add that to the 102.2 inches (101.2 plus 14.75 = 115.95 or 116 inches). Your rafters will need to be at least 116 inches long. Porch Home / Build a Porch / Roofing Materials Comparison. If your rise and run (or slope) is 4/12, multiply the square footage above (504) by 1.06. 1496 x 1.06 = 534.24 square feet. You did it-the area of your porch roof would be 534.24 square feet"}]