[{"url": "http://auburn.edu/scholarship/undergraduate/freshman.html", "passage_text": "Spirit of Auburn Scholarships are awarded among Alabama resident students from October to February, based on academic achievement as demonstrated by standardized test scores and high school GPA. These four year, renewable scholarships are awarded at three levels: Presidential, Founders, and University. Students must complete the scholarship application through AUSOM by midnight CST on February 10, and have the minimum ACT or SAT score * and high school GPA requirements to receive consideration. Minimum test scores required for consideration at each level do not include the writing score."}, {"url": "http://www.prepscholar.com/sat/s/colleges/Penn-State-SAT-scores-GPA", "passage_text": "The average GPA at Penn State is 3.57. This makes Penn State Strongly Competitive for GPAs. (Most schools use a weighted GPA out of 4.0, though some report an unweighted GPA. With a GPA of 3.57, Penn State requires you to be around average in your high school class. You'll need a mix of A's and B's, and very few C's"}, {"url": "http://scholarships.ua.edu/faq/", "passage_text": "What is the typical test score and GPA an entering freshman would need to have in order to be considered for scholarships? Generally for scholarship consideration, an entering freshman with an ACT of 24 or SAT of 1090 (critical reading and math) and a cumulative 3.0 GPA will be reviewed. *Entering freshman students who apply will be considered for all scholarships for which they are eligible except for those scholarships offered by Air Force ROTC, Army ROTC, and the College of Continuing Studies."}, {"url": "http://scholarships.ua.edu/faq/", "passage_text": "As an incoming transfer undergraduate student (applying for the Fall semester), you will need to send a completed application for admission, official college transcript(s) from any college(s) attended, application fee, and the completed scholarship section of the application for admission by March 1. *Entering freshman students who apply will be considered for all scholarships for which they are eligible except for those scholarships offered by Air Force ROTC, Army ROTC, and the College of Continuing Studies."}, {"url": "http://www.prepscholar.com/act/s/colleges/Ohio-State-University-ACT-scores-GPA", "passage_text": "With a GPA of 3.73, Ohio State University requires you to be above average in your high school class. You'll need a mix of A's and B's, with a leaning toward A's. If you took some AP or IB classes, this will help boost your weighted GPA and show your ability to take college classes. Average ACT: 28. The average ACT score composite at Ohio State University is a 28. The 25th percentile ACT score is 27, and the 75th percentile ACT score is 31. In other words, a 27 places you below average, while a 31 will move you up to above average. There's no absolute ACT requirement at Ohio State University, but they really want to see at least a 27 to have a chance at being considered"}, {"url": "http://honors-scholars.osu.edu/honors/faqs", "passage_text": "The University Honors Program and the Ohio State Scholars Program are specialized programs for high ability students interested in joining academically stimulating communities within the larger Ohio State community. Both programs are open to students in any of Ohio State's 200+ majors. If you ar e admitted to the Ohio State University Columbus campus and indicated an interest in the Honors & Scholars Programs on your Common Application, you will move on to a competitive holistic review process."}, {"url": "http://honors-scholars.osu.edu/honors/faqs", "passage_text": "1 Decisions regarding acceptance into the University Honors or Ohio State Scholars Program will be sent via email to your address on file with the Office of Undergraduate Admissions. 2  We send notifications on a rolling basis beginning in mid-January and ending mid-April. If you ar e admitted to the Ohio State University Columbus campus and indicated an interest in the Honors & Scholars Programs on your Common Application, you will move on to a competitive holistic review process."}, {"url": "http://honors-scholars.osu.edu/honors/faqs", "passage_text": "1 Decisions regarding acceptance into the University Honors or Ohio State Scholars Program will be sent via email to your address on file with the Office of Undergraduate Admissions. 2  We send notifications on a rolling basis beginning in mid-January and ending in April. If you ar e admitted to the Ohio State University Columbus campus and indicated an interest in the Honors & Scholars Programs on your Common Application, you will move on to a competitive holistic review process."}]