[{"url": "http://alternativefuels.about.com/od/glossary/g/ifcd.htm", "passage_text": "Definition: Whereas the fuel consumption display (FCD) gauge expresses average fuel usage over a distance, this gauge presents a vehicle's fuel consumption instantly, as it is used. As the vehicle moves along, sensors continuously detect fuel flow rate, throttle position, engine speed and manifold pressure."}, {"url": "https://itunes.apple.com/us/app/fuel-monitor-free-fuels-economy/id605694033?mt=8", "passage_text": "Fuel Monitor is your assistant to help keeping an eye on the cost for car: fuel consumption, cost per miles/km, fuels, services and repairs."}, {"url": "http://www.transportenvironment.org/sites/te/files/publications/CE%20Delft%20-%20Monitoring%20of%20bunker%20fuel%20consumption%20%281%29.pdf", "passage_text": "14 March 2013 7.A40.0 - Monitoring of bunker fuel consumption Tank monitoring is a common practice in the sector, sounding frequency on a ship however differs from company to company and according to the working policy and the nature of operations going on board."}, {"url": "http://www.transportenvironment.org/sites/te/files/publications/CE%20Delft%20-%20Monitoring%20of%20bunker%20fuel%20consumption%20%281%29.pdf", "passage_text": "According to Krohne and VAF 4, the costs of a fuel consumption monitoring system for a Panamax Bulker range from USD 15,000 to 60,500. 5 When data collection is done automatically, the burden for the crew regarding fuel consumption figures is minimized."}, {"url": "http://www.ckpt.ru/?lang=en", "passage_text": "Unlike other GPS vehicle tracking & fuel monitoring systems. 1. is a complete solution that allows you to solve simultaneously several problems: real-time vehicle tracking, fuel consumption monitoring, vehicle operating time control, monitoring the modes and conditions of vehicle operation. 2."}, {"url": "https://itunes.apple.com/us/app/fuel-monitor/id572413898?mt=8", "passage_text": "As of now, your iPhone can measure your fuel consumption. Fuel Monitor tracks your journeys and calculates the costs, all you have to do is select your vehicle and your phone does the rest!"}, {"url": "http://alternativefuels.about.com/od/glossary/g/ifcd.htm", "passage_text": "Whereas the fuel consumption display (FCD) gauge expresses average fuel usage over a distance, this gauge presents a vehicle's fuel consumption instantly, as it is used. As the vehicle moves along, sensors continuously detect fuel flow rate, throttle position, engine speed and manifold pressure."}, {"url": "http://www.transportenvironment.org/sites/te/files/publications/CE%20Delft%20-%20Monitoring%20of%20bunker%20fuel%20consumption%20%281%29.pdf", "passage_text": "23 March 2013 7.A40.0 - Monitoring of bunker fuel consumption 4.2.5 Implications for market-based instruments and efficiency measures With flow meters it is possible to determine the amount of fuel that a ship has consumed over a specific period of time."}]