[{"url": "http://www.parents.com/advice/pregnancy-birth/my-pregnant-body/how-soon-will-i-get-my-period-back-after-having-my-baby/", "passage_text": "The hormones circulating while you're breastfeeding can temporarily suspend ovulation, so you may not see a period (or experience a regular one) until you wean your baby. Your period should return within six to eight weeks after you stop breastfeeding, though it can take months for it to be totally regular again. If you think you should be menstruating and you're not, give your doctor a call. Q: How soon will I get my period back after having my baby? A: If you're not breastfeeding, it usually takes about six to eight weeks for your period to return to normal after delivery. If you're nursing, there's no need to stock up on tampons just yet"}, {"url": "http://www.mamapedia.com/article/how-long-does-it-take-for-your-period-to-get-back-to-normal-after", "passage_text": "Hi. It is normal not to have periods while you are nursing. Your hormones may be getting back to normal since it sounds as if you have cut back on nursing your baby. While I nursed my daughter, I did not have my period. However, after I stopped nursing, my period came back with a couple of months. Hope this helps. It is normal not to have periods while you are nursing. Your hormones may be getting back to normal since it sounds as if you have cut back on nursing your baby. While I nursed my daughter, I did not have my period. However, after I stopped nursing, my period came back with a couple of month"}, {"url": "http://www.breastfeedingquest.com/menstruation-after-pregnancy.html", "passage_text": "In women who do not breastfeed, regular production of progesterone and estrogen is back by week 6-10 postpartum. Hormones production stimulates ovulation and return of monthly period a week or so later. If there is no period for longer than 10-14 weeks after delivery, it's time to consult an OBGYN. "}, {"url": "http://www.nhs.uk/chq/pages/943.aspx?categoryid=54&subcategory..", "passage_text": "If your period does return while you are breastfeeding, it may be irregular. It is not unusual for a woman's menstrual cycle to go quicker or slower than normal while she is breastfeeding. Sometimes a woman who is breastfeeding will skip periods altogether, or have months in between periods. If your periods become irregular, or you are not fully breastfeeding and your periods have not returned after a few months, you should speak to your GP or health visitor for advice. This advice also applies to women who have had a stillbirth."}, {"url": "http://www.parents.com/advice/pregnancy-birth/giving-birth/will-a-c-section-affect-my-periods/", "passage_text": "What will affect menstruation, however, is whether or not you breastfeed your baby. If you don't nurse, it will probably take about six to eight weeks for your period to come back after delivery. If you breastfeed, you may not get your period back until you wean your baby. Your period should return within six to eight weeks after you stop breastfeeding, though it can take a while for it to be totally regular again. "}, {"url": "http://www.bellybelly.com.au/post-natal/your-period-and-ovulation-after-baby/", "passage_text": "Breastfeeding can delay menstruation and ovulation for 20 weeks or more, but it is not uncommon to find your period returning sooner, or much later, than 20 weeks. There are differences among individual women and their hormone levels, so it’s difficult to say when a period will recommence after childbirth. I had my first period 6 weeks after giving birth and I should have had a period this month like 4 days ago and still haven’t gotten it. I’m wondering if its normal to be irregular after giving birth when not breast feeding."}, {"url": "http://www.nhs.uk/chq/pages/943.aspx?categoryid=54&subcategory..", "passage_text": "If you bottle feed your baby, or combine bottle feeding with breastfeeding, your first period could start as soon as five to six weeks after you give birth. If you fully breastfeed and do not combine bottle feeding with breastfeeding, it is possible that your periods may not start again until you stop breastfeeding. If your periods become irregular, or you are not fully breastfeeding and your periods have not returned after a few months, you should speak to your GP or health visitor for advice. This advice also applies to women who have had a stillbirth."}, {"url": "http://www.babycentre.co.uk/x553497/im-breastfeeding-so-why-have-my-periods-started-again", "passage_text": "There's no usual time for you to start ovulating again and for your periods to resume. It varies from woman to woman. If you are breastfeeding, you may ovulate as early as nine weeks or 10 weeks after giving birth. Your period would then start two weeks later, as early as 11 weeks or 12 weeks after giving birth. Or it may be over a year before you start ovulating again, and your periods return. "}]