[{"url": "http://www.sanskritweb.net/cakram/", "passage_text": "Now the font is compatible with Itranslator-2003 and Sanskrit2003 font. Now font is provided in two versions-Chandas and Uttara. Chandas font represents Southern (most commonly used today) style of Devanagari script. And Uttara font represents Northern style of De vanagari Script. These styles are sometimes also called Bombay (Southern, contemporary) and Calcutta (Northern, old) pen families accordingly."}, {"url": "http://www.wisdomlib.org/definition/chanda/index.html", "passage_text": "As an evil quality it has the meaning of 'desire', and is frequently coupled with terms for 'sensuality', 'greed', etc., for instance: kāma-cchanda, 'sensuous desire', one of the 5 hindrances (s. nīvarana); chanda-rāga, 'lustful desire' (s. kāma). It is one of the 4 wrong paths (s. agati)."}, {"url": "http://www.wisdomlib.org/definition/chanda/index.html", "passage_text": "2. As an evil quality it has the meaning of 'desire', and is frequently coupled with terms for 'sensuality', 'greed', etc., for instance: kāma-cchanda, 'sensuous desire', one of the 5 hindrances (s. nīvarana); chanda-rāga, 'lustful desire' (s. kāma). It is one of the 4 wrong paths (s. agati)."}, {"url": "http://www.sanskritweb.net/cakram/", "passage_text": "Chandas-Devanagari Unicode Open Type font (ttf) with the largest ligature set. The font contains 4347 glyphs: 325 half-forms, 960 half-forms context-variations, 2743 ligature-signs. It is designed especially for Vedic and Classical Sanskrit but can also be used for Hindi, Nepali and other modern Indian languages."}, {"url": "http://www.sssbpt.info/summershowers/ss1974/ss1974part1-13.pdf", "passage_text": "Samhita has been takento mean that part which contains manthras and the otherthree parts together have been given the other names. Chandas has been given different kinds of original orroot meaning and it has also been described in manydifferent ways. Not only this, sometimes the Sruthi whichcontains the manthra and the Brahmana have also beencalled Chandas. Gayatri, Vishtubh, Anushtubh and Sishtubh have also been "}]