[{"url": "https://en.wikipedia.org/wiki/Futures_contracts", "passage_text": "A forward is like a futures in that it specifies the exchange of goods for a specified price at a specified future date. However, a forward is not traded on an exchange and thus does not have the interim partial payments due to marking to market. Nor is the contract standardized, as on the exchange. A put is the option to sell a futures contract, and a call is the option to buy a futures contract. For both, the option strike price is the specified futures price at which the future is traded if the option is exercised. Futures are often used since they are delta one instruments."}, {"url": "http://www-personal.umich.edu/~alandear/glossary/f.html", "passage_text": "A market for exchange of currencies in the future. Participants in a forward market enter into a contract to exchange currencies, not today, but at a specified date in the future, typically 30, 60, or 90 days from now, and at a price (forward exchange rate) that is agreed upon today. Factor cost. The cost of the factors used in production. The term is used especially when the value of economic activity in a sector or an economy can be measured or valued either at factor cost, adding up payments to factors, or at  market value or market price , adding up revenues from goods sold."}, {"url": "http://www.investorwords.com/5579/forward_price.html", "passage_text": "Forwards are priced in a manner similar to futures. As with a futures contract, the first step in pricing a forward is to add the spot price to the cost of carry (interest forgone, convenience yield, storage costs and interest/dividend received on the underlying). However, unlike a futures contract, the price may also include a premium for counterparty credit risk, and there is not daily marking-to-market to minimize default risk. If there is no allowance for these credit risks, then the forward price will equal the futures price."}, {"url": "http://smallbusiness.chron.com/forward-contract-commodities-work-14035.html", "passage_text": "Hemera Technologies/Photos.com/Getty Images. A forward contract is an agreement between two parties --- the seller and the buyer --- for the delivery of a certain quality and quantity of a commodity at specified time and for a specified price. Farmers often use forward contracts as hedges against falling prices. If the average price of the commodity has fallen, the contract helps the seller. In forward contracts, whenever the price of the contracted commodity changes, one of the parties to the contract gains while the other loses. Appreciation benefits the buyer while depreciation benefit"}, {"url": "https://en.wikipedia.org/wiki/Forward_price", "passage_text": "The forward price (or sometimes forward rate) is the agreed upon price of an asset in a forward contract. Using the rational pricing assumption, for a forward contract on an underlying asset that is tradeable, we can express the forward price in terms of the spot price and any dividends etc. For forwards on non-tradeables, pricing the forward may be a complex task."}, {"url": "http://www.investorwords.com/5579/forward_price.html", "passage_text": "The price specified in a forward contract for a specific commodity. The forward price makes the forward contract have no value when the contract is written. However, unlike a futures contract, the price may also include a premium for counterparty credit risk, and there is not daily marking-to-market to minimize default risk. If there is no allowance for these credit risks, then the forward price will equal the futures price."}, {"url": "https://en.wikipedia.org/wiki/Futures_contracts", "passage_text": "However futures contracts also offer opportunities for speculation in that a trader who predicts that the price of an asset will move in a particular direction can contract to buy or sell it in the future at a price which (if the prediction is correct) will yield a profit. A put is the option to sell a futures contract, and a call is the option to buy a futures contract. For both, the option strike price is the specified futures price at which the future is traded if the option is exercised. Futures are often used since they are delta one instruments."}, {"url": "http://www.investopedia.com/terms/f/forwardpe.asp", "passage_text": "DEFINITION of 'Forward Price To Earnings-Forward P/E'. A measure of the price-to-earnings ratio (P/E) using forecasted earnings for the P/E calculation. While the earnings used are just an estimate and are not as reliable as current earnings data, there is still benefit in estimated P/E analysis. BREAKING DOWN 'Forward Price To Earnings-Forward P/E'. The estimated P/E of a company is often used to compare current earnings to estimated future earnings. If earnings are expected to grow in the future, the estimated P/E will be lower than the current P/E."}]