[{"url": "http://www.indeed.com/q-Prosthetics-Engineer-jobs.html", "passage_text": "Cisco System Engineer. See/hear or use prosthetics that enable accomplishment of job. Manage the day to day availability and 24X7 uptime of all core systems and fault tolerant systems... 7 days ago-save job-email-more... "}, {"url": "http://study.com/prosthetics_degree.html", "passage_text": "Prosthetics is the replacement of a lost limb with a prosthesis, an artificial limb that helps restore patients' mobility or function. Prosthetics technology degrees combine medical engineering technology with the study of human anatomy. Additional topics covered in the bachelor's degree program include applied kinesiology, the study of how the body's joints and muscles affect a patient's gait. These courses allow prosthetics majors to examine how a prosthetic's components compensate for the loss of a limb by assisting with balance or shock absorption."}, {"url": "http://study.com/articles/Prosthetic_Technician_Job_Description_and_Info_for_Students_Considering_a_Career_in_Prosthesis_Technology.html", "passage_text": "Required Education. Prosthetic technicians usually need an associate degree or certification from an accredited institution to find a job, but a number of employers are willing to train applicants as long as they have a high school diploma. Learn about what a prosthetic technician does. Read about the education requirements and skills, as well as the expected salary and employment outlook, to see if this is the career for you."}, {"url": "http://www.ehow.com/how_6104532_become-prosthetic-engineer.html", "passage_text": "Thanks to biomedical engineers, people who have lost a limb can still be mobile and perform tasks such as driving, cooking or using a computer. Designing, building and testing prosthetic devices is one of the specialties of biomedical engineering, although the discipline is broad and includes many other activities. You can become a biomedical engineer with a bachelor’s degree, although you may need a graduate degree to lead a research team, according to the U.S. Bureau of Labor Statistics. ONet online reports that 45 percent of biomedical engineers have a bachelor’s degree and 35 percent have a master’s degree"}, {"url": "http://www.salarylist.com/jobs/Prosthetics-Engineer-Salary.htm", "passage_text": "Prosthetics Engineer Salary. Prosthetics Engineer average salary is $34,636, median salary is $35,000 with a salary range from $29,120 to $38,100. Prosthetics Engineer salaries are collected from government agencies and companies. Each salary is associated with a real job position. Prosthetics Engineer salary statistics is not exclusive and is for reference only. They are presented as is and updated regularly."}, {"url": "http://www.ehow.com/how_6104532_become-prosthetic-engineer.html", "passage_text": "Formal Education. You can become a biomedical engineer with a bachelor’s degree, although you may need a graduate degree to lead a research team, according to the U.S. Bureau of Labor Statistics. ONet online reports that 45 percent of biomedical engineers have a bachelor’s degree and 35 percent have a master’s degree"}, {"url": "http://study.com/prosthetics_degree.html", "passage_text": "A graduate program in prosthetics prepares students for entry-level clinical positions as prosthetists. Prosthetists work closely with patients to design the right prosthetic for their needs by performing consultations, fittings and an assessment of the finished product. Additional topics covered in the bachelor's degree program include applied kinesiology, the study of how the body's joints and muscles affect a patient's gait. These courses allow prosthetics majors to examine how a prosthetic's components compensate for the loss of a limb by assisting with balance or shock absorption."}, {"url": "http://www.amputation.research.va.gov/Prosthetic_Engineering/Prosthetic_Engineering_Overview.asp", "passage_text": "Prosthetic Engineering-Overview. Our aim is to improve prosthetic prescription by investigating the efficacy of prosthetic components used in current clinical practice and by developing novel approaches to improve the current standard of care. Our amputee-centric research encompasses improving patient mobility and comfort and preventing injury. Smart Cane System. People with pain or arthritis in their knee often walk with a cane to reduce knee pain and to improve or maintain their mobility. Increased pressure on the knee joint likely causes knee arthritis and reducing the pressure on the knee joint may slow the progression of arthritis."}, {"url": "http://www.ehow.com/how_6104532_become-prosthetic-engineer.html", "passage_text": "If you already know you want to work in the field of prosthetic design and development, you might be able to find an orthopedic surgeon or an orthotist to job shadow. Both of these disciplines work with people who have had amputations or were born without limbs. You can become a biomedical engineer with a bachelor’s degree, although you may need a graduate degree to lead a research team, according to the U.S. Bureau of Labor Statistics. ONet online reports that 45 percent of biomedical engineers have a bachelor’s degree and 35 percent have a master’s degree"}]