[{"url": "http://www.city-data.com/city/South-Bend-Washington.html", "passage_text": "Latest news from South Bend, WA collected exclusively by city-data.com from local newspapers, TV, and radio stations. Ancestries: German (16.6%), English (11.0%), Irish (9.6%), United States (3.3%), Norwegian (2.7%), Scottish (2.0%). Colleges/universities with over 2000 students nearest to South Bend: 1  Centralia College (about 41 miles; Centralia, WA; Full-time enrollment: 2,354). 2  South Puget Sound Community College (about 49 miles; Olympia, WA; FT enrollment: 3,981)."}, {"url": "http://www.experiencewa.com/cities/south-bend", "passage_text": "South Bend. Located on the scenic shores of the Willapa River, South Bend is the county seat of Pacific County. The beautiful Pacific County Courthouse overlooks the town and is open to the public for self-guided tours. Explore the unique history of Pacific County at the Pacific County Historical Society Museum. Fresh Willapa Bay oysters and seafood are readily available at South Bend restaurants, seafood stores and canneries. The town of South Bend had its beginnings in 1869 when the Riddell brothers, Valentine and John, built a sawmill on the bend of the Willapa River."}, {"url": "https://en.wikipedia.org/wiki/Washington_High_School_(South_Bend,_Indiana)", "passage_text": "Washington High School is a public High School located at 4747 W. Washington on the West Side of South Bend, Indiana, United States. It is part of the SBCSC magnet program, where it is the Medical/Allied Health Magnet strain. - In 2005, the South Bend Community School Corporation moved into a magnet school corporation. Washington was chosen as the Medical/Applied Health Magnet Program. The 2012 graduation rate was 86%, with a total number of 254 graduates."}, {"url": "http://www.chenssouthbend.com/pages/", "passage_text": "Motel / RV Park RATES & INFO. We’re located on the Willapa Bay in South Bend, WA. (see map below). 206 E. Robert Bush Dr. South Bend, WA 98586. (360) 875-5538 or (360) 875-5523. Room rates: $63 and up in the off season; $70 and up throughout the summer (June 1 through Sept. 30). No pets/no smoking allowed. Chen’s Restaurant & Motel-RV Park, South Bend WA. Chen’s offers free wi-fi Internet for motel guests, plus enjoy a free pancake breakfast during your stay."}, {"url": "http://www.city-data.com/city/South-Bend-Washington.html", "passage_text": "13.5%. According to our research of Washington and other state lists there was 1 registered sex offender living in South Bend, Washington as of October 06, 2015. The ratio of number of residents in South Bend to the number of sex offenders is 1,609 to 1. Colleges/universities with over 2000 students nearest to South Bend: 1  Centralia College (about 41 miles; Centralia, WA; Full-time enrollment: 2,354). 2  South Puget Sound Community College (about 49 miles; Olympia, WA; FT enrollment: 3,981)."}, {"url": "http://www.ebay.com/sch/i.html?_nkw=south+bend+washington", "passage_text": "south bend washington. Follow south bend washington to get e-mail alerts and updates on your eBay Feed. Unfollow south bend washington to stop getting updates on your eBay Feed. Yay! You're now following south bend washington in your eBay Feed. This is the median price based on sales of this product in the same condition from all listings on ebay.com in the past 14 days, or if there are any insufficient number of listings for a meaningful calculation, the past 90 days."}, {"url": "http://southbendwashingtonathletics.com/", "passage_text": "Washington’s football teamed was awarded the NIC South Division Co-Championship title! Click Here to read the South Bend Tribune Article Click Here to see the highlights from WNDU Click Here to see the highlights from WSBT Click Here to see the highlights from FOX28. Tweet. "}, {"url": "https://en.wikipedia.org/wiki/South_Bend,_Washington", "passage_text": "South Bend is a city in Pacific County, Washington, United States. It is the county seat of Pacific County. The population was 1,637 as of the 2010 census. As of the census of 2010, there were 1,637 people, 684 households, and 414 families residing in the city. The population density was 1,004.3 inhabitants per square mile (387.8/km 2). There were 780 housing units at an average density of 478.5 per square mile (184.7/km 2)."}, {"url": "https://en.wikipedia.org/wiki/South_Bend,_Washington", "passage_text": "South Bend was officially incorporated on September 27, 1890. The name of the city comes from its location on the Willapa River. The county seat was relocated from Oysterville to South Bend in 1893. The Pacific County Courthouse is on the National Register of Historic Places. As of the census of 2010, there were 1,637 people, 684 households, and 414 families residing in the city. The population density was 1,004.3 inhabitants per square mile (387.8/km 2). There were 780 housing units at an average density of 478.5 per square mile (184.7/km 2)."}, {"url": "http://www.city-data.com/city/South-Bend-Washington.html", "passage_text": "1 South Bend: South Bend Washington ,sits on the bank of the Willapa River. Colleges/universities with over 2000 students nearest to South Bend: 1  Centralia College (about 41 miles; Centralia, WA; Full-time enrollment: 2,354). 2  South Puget Sound Community College (about 49 miles; Olympia, WA; FT enrollment: 3,981)."}]