[{"url": "http://economics.about.com/od/unemployment-category/a/Measuring-Unemployment.htm", "passage_text": "Mathematically, the unemployment rate is as follows: unemployment rate = (# of unemployed / labor force) x 100%. Notice that one can also refer to an employment rate that would just be equal to 100% minus the unemployment rate, or. That said, it's important to understand more precisely how unemployment is measured in order to properly interpret and make sense of the numbers that appear in the newspaper and on television. Officially, a person is unemployed if he or she is in the labor force but does not have a job."}, {"url": "http://www.amosweb.com/cgi-bin/awb_nav.pl?s=wpd&c=dsp&k=unemployment+rate,+measurement+problems", "passage_text": "Ten part-time workers generates a lower unemployment rate, than five full-time workers combined with five unemployed workers. Part-time workers SHOULD be included in the unemployment rate. Doing so would raise the unemployment rate by two to three percentage points (that is, 5.0 to 7.0). Part-time workers might want to work full time, but they are in fact working, and are thus placed completely in the employed persons category. Correctly categorizing unemployed labor resources is likely to increase the unemployment rate above the official level."}, {"url": "http://www.epi.org/newsroom/useful_definitions/", "passage_text": "Total nonfarm employment is the total number of jobs, part time or full time, in non-farm establishments. Total private employment excludes jobs in federal, state, and local government. In order to compare between different time periods, the change in payroll employment is indexed to a benchmark. For interactive graphs that display the most recent data, go to EPI’s companion website, Economy Track. Unemployment Rate. While no single number captures all the nuances in the health of the labor market, the unemployment rate is considered one of the most important economic indicators."}, {"url": "http://www.cnbc.com/id/44451664", "passage_text": "When someone loses a job, a family is affected. When many people lose their jobs, eventually the whole nation is affected. Workers lose income, while the country loses production and consumer spending. With such a strong impact, the unemployment rate is a key way to measure the state of the economy. As such, they are not added to official unemployment statistics. Many who are not in the labor force are going to school or are retired, but would rather have full-time jobs. Family responsibilities keep others out of work as well. As a result, many people stop looking for work because they can't find a job."}, {"url": "https://en.wikipedia.org/wiki/Underemployment", "passage_text": "Underemployment refers to an employment situation that is insufficient in some important way for the worker, relative to a standard. Examples include holding a part-time job despite desiring full-time work, and overqualification, where the employee has education, experience, or skills beyond the requirements of the job. A related kind of underemployment refers to involuntary part-time workers. These are workers who could (and would like to) be working for the standard work-week (typically full-time employment means 40 hours per week in the United States) who can only find part-time work."}, {"url": "http://www.cnbc.com/id/44451664", "passage_text": "To come up with an unemployment rate, the BLS takes the number of unemployed workers it has found and divides that by the total civilian labor force. The rate is released in the first week of every month and widely reported by news organizations. The unemployment rate has obvious limitations. As such, they are not added to official unemployment statistics. Many who are not in the labor force are going to school or are retired, but would rather have full-time jobs. Family responsibilities keep others out of work as well. As a result, many people stop looking for work because they can't find a job."}, {"url": "http://economics.about.com/od/unemployment-category/a/Measuring-Unemployment.htm", "passage_text": "Because the unemployment rate is measured as a percentage of the labor force, an individual is not technically counted as unemployed if she has gotten frustrated with looking for a job and has given up on trying to find work. That said, it's important to understand more precisely how unemployment is measured in order to properly interpret and make sense of the numbers that appear in the newspaper and on television. Officially, a person is unemployed if he or she is in the labor force but does not have a job."}, {"url": "http://www.cnbc.com/id/44451664", "passage_text": "As defined by the U.S. Bureau of Labor Statistics (BLS), unemployment is when someone does not have a job, has actively looked for work in the past four weeks, and is currently available for work. Also counted as unemployed are people who are temporarily laid off and waiting to be called back to that job. As such, they are not added to official unemployment statistics. Many who are not in the labor force are going to school or are retired, but would rather have full-time jobs. Family responsibilities keep others out of work as well. As a result, many people stop looking for work because they can't find a job."}, {"url": "http://www.investopedia.com/articles/economics/10/unemployment-rate-get-real.asp", "passage_text": "The national unemployment rate is defined as the percentage of unemployed workers in the total labor force. It is widely recognized as a key indicator of labor market performance. "}, {"url": "http://www.epi.org/newsroom/useful_definitions/", "passage_text": "There are several reasons the unemployment rate rises or falls. Although a clear reason is a change in the number of job seekers, the unemployment rate may also be affected by a change in the size of the labor force. When workers become discouraged and stop looking for employment, they leave the labor force. For interactive graphs that display the most recent data, go to EPI’s companion website, Economy Track. Unemployment Rate. While no single number captures all the nuances in the health of the labor market, the unemployment rate is considered one of the most important economic indicators."}]