[{"url": "http://generalhorticulture.tamu.edu/h202/labs/lab3/sciname.html", "passage_text": "The system of nomenclature used today is based on the binomial system of nomenclature, developed by Linnaeus in the late 1700's. The binomial system of nomenclature is structured so that the scientific name of a plant consists of two names: (1) the genus or generic name, and (2) the specific epithet or species name. There are rules to follow when writing a scientific name. Genus Name The genus name is written first. "}, {"url": "https://en.wikipedia.org/wiki/Hippeastrum", "passage_text": "Hippeastrum /ˌhɪpiːˈaestrəm/ ˌhɪpiːˈæstrəm is a genus of about 90 species and over 600 hybrids and cultivars of perennial herbaceous bulbous. Plants they generally have large fleshy bulbs and tall broad, leaves generally, evergreen and large red or purple. flowers Although the 1987 decision settled the question of the scientific name of the genus, the common name amaryllis continues to be used. Bulbs sold as amaryllis and described as ready to bloom for the holidays belong to the genus Hippeastrum."}, {"url": "https://en.wikipedia.org/wiki/Hippeastrum", "passage_text": "For many years there was confusion among botanists over the generic names Amaryllis and Hippeastrum, one result of which is that the common name  amaryllis  is mainly used for cultivars of this genus, often sold as indoor flowering bulbs particularly at Christmas in the northern hemisphere. Although the 1987 decision settled the question of the scientific name of the genus, the common name amaryllis continues to be used. Bulbs sold as amaryllis and described as ready to bloom for the holidays belong to the genus Hippeastrum."}, {"url": "https://en.wikipedia.org/wiki/Amaryllis", "passage_text": "Amaryllis (/ˌaeməˈrɪlɨs/) ˌæməˈrɪlɨs is a small genus of flowering, bulbs with two. species Plants of the genus Amaryllis are known as belladonna lily, Jersey lily, naked lady, amarillo, Easter lily in Southern Australia or, in South Africa, March lily due to its propensity to flower around March."}, {"url": "http://www.pacificbulbsociety.org/pbswiki/index.php/Amaryllis", "passage_text": "Amaryllis. Amaryllis is the type genus for the family Amaryllidaceae. Although it is the common name used for hybrid hippeastrums which are found on the Hippeastrum Hybrids page, there are actually only two species in this genus and one of them was only recently discovered. Both are found in the winter rain area of South Africa"}, {"url": "https://en.wikipedia.org/wiki/Amaryllis", "passage_text": "If the latter, Amaryllis would be the correct name for the genus Hippeastrum, and a different name would have to be used for the genus discussed here. Alan W. Meerow et al. have briefly summarized the debate, which took place from 1938 onwards and involved botanists on both sides of the Atlantic. Plants of the genus Amaryllis are known as belladonna lily, Jersey lily, naked lady, amarillo, Easter lily in Southern Australia or, in South Africa, March lily due to its propensity to flower around March."}, {"url": "http://www.pacificbulbsociety.org/pbswiki/index.php/Hippeastrum", "passage_text": "Hippeastrum is a genus in the family Amaryllidaceae with about 70-90 species and 600+ hybrids and cultivars. The genus is native to tropical regions of the Caribbean, Mexico but mostly South America. "}, {"url": "https://en.wikipedia.org/wiki/Hippeastrum", "passage_text": "The taxonomy of the genus is complicated. The first issue is whether the name should more properly be Amaryllis. . In 1753 Carl Linnaeus created the name Amaryllis belladonna, the type species of the genus Amaryllis, in his Species Plantarum along with eight other Amaryllis species. Although the 1987 decision settled the question of the scientific name of the genus, the common name amaryllis continues to be used. Bulbs sold as amaryllis and described as ready to bloom for the holidays belong to the genus Hippeastrum."}, {"url": "http://www.theplantlist.org/browse/A/Amaryllidaceae/Amaryllis/", "passage_text": "The genus Amaryllis is in the family Amaryllidaceae in the major group Angiosperms (Flowering plants) . Of these 4 are accepted species names. includes a further 48 scientific plant names of infraspecific rank for the genus Amaryllis. We do not intend. to be complete for names of infraspecific rank."}, {"url": "http://www.theplantlist.org/browse/A/Amaryllidaceae/Amaryllis/", "passage_text": "Statistics. includes 421 scientific plant names of species rank for the genus Amaryllis. Of these 4 are accepted species names. includes a further 48 scientific plant names of infraspecific rank for the genus Amaryllis. We do not intend. to be complete for names of infraspecific rank. These are primarily included because names of species rank are synonyms of accepted infraspecific name"}]