[{"url": "http://www.wisegeek.org/what-is-chop-suey.htm", "passage_text": "Some people think that stir fry dishes like chop suey were actually first created in China, near Canton. Many early Chinese immigrants to the United States did come from the Canton part of China. Ad. Bean sprouts, bamboo shoots and/or water chestnuts are usually a part of chop suey. Mushrooms, onions, cabbage, celery, and bell peppers are other vegetables that may be used in the dish. Pork or beef are the most common of the meats used. Shrimp or chicken chop suey is also popular, and vegetarian versions are common."}, {"url": "https://en.wikipedia.org/wiki/Chop_suey", "passage_text": "Chop suey has become a prominent part of American Chinese cuisine, Filipino cuisine, Canadian Chinese cuisine, German Chinese cuisine, Indian Chinese cuisine, and Polynesian cuisine. In Indonesian Chinese cuisine it is known as cap cai (雜菜, mixed vegetables) and mainly consists of vegetables. The long list of colorful and conflicting stories about the origin of chop suey is, in the words of the food historian Alan Davidson, “a prime example of culinary mythology” and typical of popular foods."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070628000220AAhZ40S", "passage_text": "Best Answer: CHOP SUEY History and Origin Chop suey consists of small pieces of meat, chicken or shrimp stir-fried with celery, onions, bean sprouts, water chestnuts, mushrooms and/or other vegetables, and served over rice, usually with soy sauce. Chop suey is supposedly not Chinese, but is a Chinese American dish which originated in the mid to late 19th century, either with Chinese laborers working on the U.S. transcontinental railroad, Chinese immigrants in San Francisco, or Chinese ambassador Li Hung Chang’s cooks while he was visiting New York."}, {"url": "http://www.foodreference.com/html/fchopsuey.html", "passage_text": "Chop suey is supposedly not Chinese, but is a Chinese American dish which originated in the mid to late 19th century, either with Chinese laborers working on the U.S. transcontinental railroad, Chinese immigrants in San Francisco, or Chinese ambassador Li Hung Chang’s cooks while he was visiting New York. FREE Magazines and other PublicationsAn extensive selection of free magazines and other publications. Chop suey consists of small pieces of meat, chicken or shrimp stir-fried with celery, onions, bean sprouts, water chestnuts, mushrooms and/or other vegetables, and served over rice, usually with soy sauce."}, {"url": "https://en.wikipedia.org/wiki/Chop_suey", "passage_text": "Chop suey, made with garlic chicken and peapods, on fried rice. Far East Chop Suey restaurant in Little Tokyo, Los Angeles: Restaurants like this are now rare, but were once a common sight in the United States. Chop suey is widely believed to have been invented in America by Chinese Americans, but the anthropologist E.N. The long list of colorful and conflicting stories about the origin of chop suey is, in the words of the food historian Alan Davidson, “a prime example of culinary mythology” and typical of popular foods."}, {"url": "https://en.wikipedia.org/wiki/American_Chop_Suey", "passage_text": "Classic American chop suey consists of elbow macaroni and bits of cooked ground beef with sauteed sautéed onions and green peppers in a thick-tomato based. Sauce the dish is typically cooked in a frying or saute, sauté pan as opposed to being baked in an oven like. a casserole American chop suey is served on a plate or in a bowl, usually accompanied by bread and often Worcestershire sauce as condiment were it not used during the cooking process. Sometimes grated Parmesan cheese is added but only after the cooking process is finished. American chop suey is most prevalent in New England."}, {"url": "http://www.answers.com/Q/What_country_does_chop_suey_come_from", "passage_text": "Chicken chop suey is an American Chinese stir-fry dish. It is made  with chicken and cooked with vegetables that include bean sprouts  and cabbage. The meat and vegetables h … ave a thick sauce and are  usually served with rice. 3 people found this useful. Chop suey-main ingredient is bean sprouts with vegetables and option of meat. Subgum. - main i … ngredient is vegetables (usually with cooked celery) and option of meat. Depending on the Chinese restaurant more authentic restaurants include bean sprouts."}, {"url": "http://norecipes.com/chop-suey-recipe", "passage_text": "When chop suey arrived with early Chinese immigrants in the late 19th century, bokchoy, straw mushrooms and water chestnuts weren’t available here. So the immigrants did what any great chef would do and improvised, using readily available ingredients such as cabbage, button mushrooms and celery. "}, {"url": "http://www.foodreference.com/html/fchopsuey.html", "passage_text": "CHOP SUEY-History and Origin. Chop suey consists of small pieces of meat, chicken or shrimp stir-fried with celery, onions, bean sprouts, water chestnuts, mushrooms and/or other vegetables, and served over rice, usually with soy sauce. FREE Magazines and other PublicationsAn extensive selection of free magazines and other publications"}]