[{"url": "http://www.mapsofworld.com/world-top-ten/world-top-ten-largest-deserts-map.html", "passage_text": "The Arabian Desert is the fourth largest desert in the world, with an area of about 2,330,000 square kilometers. The Arabian Desert is situated on the Arabian peninsula, and makes up parts of Iraq, Jordan, Kuwait, Oman, Qatar, Saudi Arabia, the United Arab Emirates, and Yemen. The Kalahari Desert is a subtropical desert in southern Africa, covering 900,000 square kilometers in Angola, Botswana, Namibia, and South Africa. The Kalahari Desert ranks sixth in terms of largest deserts by area in the world."}, {"url": "http://geography.about.com/od/physicalgeography/a/deserts.htm", "passage_text": "The world's largest desert is actually the very cold continent of Antarctica. It is the world's driest place, receiving less than two inches of precipitation annually. Antarctica is 5.5 million square miles (14,245,000 square kilometers) in area. Outside of polar regions, Northern Africa's Sahara Desert is the world's largest desert at more than 3.5 million square miles (nine million square kilometers), which is slightly smaller that the size of the United States, the world's fourth largest country."}, {"url": "http://www.mapsofworld.com/world-top-ten/world-top-ten-largest-deserts-map.html", "passage_text": "The largest deserts in the world are polar deserts: the Antarctic Desert and the Arctic Desert. The Antarctic Desert covers an area of 13,829,430 square kilometers over the South Pole. Antarctica is the most extreme continent on Earth, as the coldest, driest and windiest place in the world ,and the highest elevation. The Kalahari Desert is a subtropical desert in southern Africa, covering 900,000 square kilometers in Angola, Botswana, Namibia, and South Africa. The Kalahari Desert ranks sixth in terms of largest deserts by area in the world."}, {"url": "http://www.infoplease.com/askeds/world-largest-desert.html", "passage_text": "The Answer: The largest (nonpolar) desert in the world is the Sahara, in north Africa, which spans an area measured at roughly 3.5 million square miles. The United States' contiguous 48 states could easily fit in the desert. "}, {"url": "http://www.answers.com/Q/What_is_the_world's_largest_desert", "passage_text": "Well technically,the worlds largest desert is Antarctica but the worlds largest HOT desert would be the Sahara. The name of the world's largest desert is the Sahara in norther … n  Africa. The largest desert in the world is Antarctica. It qualifies as a desert because annual precipitation is so low. The world's largest hot desert, however, is the Sahara, in Africa. i think the world's largest desert is the Sahara desert. The world's largest desert is the continent of Antarctica. Though it is not sandy like one usually thinks of when thinking about a desert it receives less than 2 inches of rain a year. Technically Antarctica, but as far as sand desert the Sahara is biggest then the Kalahari"}, {"url": "http://www.universetoday.com/73868/what-is-the-largest-desert-in-the-world/", "passage_text": "The Sahara is what most people envision when they think of a desert. It is the world’s largest hot weather desert, covering over 9,400,000 square km. It is nearly as large as the United States. Some of the sand dunes are 180 m in height. Unlike Antarctica, The Sahara region is heavily populated. It is home to a number of people and languages. Arabic is the most widely spoken language."}, {"url": "http://www.mapsofworld.com/world-top-ten/world-top-ten-largest-deserts-map.html", "passage_text": "The third largest desert in the world, and the largest non-polar desert is the Sahara. Situated in North Africa, the Sahara makes up parts of Algeria, Chad, Egypt, Eritrea, Libya, Mali, Mauritania, Morocco, Niger, Sudan, Tunisia, and Western Sahara. The Kalahari Desert is a subtropical desert in southern Africa, covering 900,000 square kilometers in Angola, Botswana, Namibia, and South Africa. The Kalahari Desert ranks sixth in terms of largest deserts by area in the world."}, {"url": "http://www.answers.com/Q/What_is_the_world's_largest_desert", "passage_text": "The world's largest hot desert is the Sahara in Northern Africa. It covers an area of about 9.1 million square kilometres, or 3.5 million square miles. It is not the world's l … argest desert, however. It qualifies as a desert because annual precipitation is so low. The world's largest hot desert, however, is the Sahara, in Africa. i think the world's largest desert is the Sahara desert. The world's largest desert is the continent of Antarctica. Though it is not sandy like one usually thinks of when thinking about a desert it receives less than 2 inches of rain a year. Technically Antarctica, but as far as sand desert the Sahara is biggest then the Kalahari"}]