[{"url": "http://wonderopolis.org/wonder/what-is-a-totem-pole/", "passage_text": "Totem poles are sculptures carved from large trees, such as the Western Red Cedar. In North America, totem poles are part of the cultures of many indigenous peoples of Alaska, British Columbia and the Pacific Northwest. Totem poles serve many purposes beyond their beauty, and their meanings are as varied as the cultures that make them. Some totem poles represent stories or important events. On these poles, each figure on the totem represents part of a story. These totems are used as a way to record the history and legends of the tribes. Figures on a totem pole are not gods to be worshipped. Instead, they represent traits and characteristics each clan or story embodies."}, {"url": "http://www.indians.org/articles/totem-poles.html", "passage_text": "Many Native American Indians expressed themselves with their artwork carved into totem poles. Many believe that all Indian tribes carved totem poles but this is far from the truth. Those Indians living in the southwest, the plains and Inuit Indians did not have trees to carve."}, {"url": "http://www.support-native-american-art.com/Native-American-Totem-Poles.html", "passage_text": "Native American totem poles are an ancient tradition of the Indian tribes of the Pacific Northwest Coast--Washington state in the USA, British Columbia in Canada--and some of the Athabaskan tribes of southern Alaska. The designs on them are as varied as the tribes."}, {"url": "http://www.manataka.org/page30.html", "passage_text": "TOTEM POLES OF THE GREAT NORTHWEST. The first totems were carved from mature cedar trees and used in the Potlatch ceremonies of families-clans of the Pacific Northwest, primarily Alaska and British Columbia. They were carved to represent the emblem of the family as a reminder of its history."}, {"url": "http://aam.govst.edu/projects/cdeltoro/totem%20pole%20colors.pdf", "passage_text": "Totem Pole Colors The Indians originally used pigments made from clay and roots. The colors were very bright and faded a bit after the pole had weathered several winters. The symbolism of the colors changed a little in different parts of the United States."}, {"url": "http://www.answers.com/Q/What_were_totem_poles_used_for", "passage_text": "Totem poles had a mixture of animal, bird, and human. They were often used to tell the Haida people about Myths and Legends. The colours on any totem pole back then were made … out of bark, seashells mixed with salmon eggs and coal."}]