[{"url": "http://www.mdjunction.com/forums/fibro-challenges-discussions/general-support/2788421-throat-spasms", "passage_text": "Does anyone else have throat spasms...feels like an irregular palpation in my throat-could be related to anxiety-this just started up recently on my trip to Massachusetts-so I thought it might be anxiety related because it seems that when I am anxious it happens-but it has also occurred when I don't feel anxious. Hi Sunset, I have these spasms as well myself and it is almost like a really harsh spasm, not sure how else to explain it. They usually don't last a long time but they hurt and feel strange, I usually massage my throat when it happens. I also have a very mild muscle relaxer that I use as well that helps. Hope this helps sweetie"}, {"url": "http://www.tandurust.com/general-health/throat-muscle-spasm.html", "passage_text": "Throat muscle spasm is a symptom of varied causes, and it usually indicates that something is wrong with your throat or respiratory including your digestive system. Spasms result when the muscles contract resulting to unbearable pain and stiffness in the muscle area. Muscle spasm in the throat is pretty manageable especially if the causes are allergic reactions to certain substances. If you are having spasms in the throat, you should try doing these simple yet proven effective natural treatments: 1  Relax and do a lot of deep breathing or breathing exercises."}, {"url": "http://www.webmd.com/digestive-disorders/tc/esophageal-spasm-topic-overview", "passage_text": "Normally, contractions of the esophagus (the tube that connects the mouth and the stomach) move food from the mouth to the stomach with a regular, coordinated rhythm. Esophageal spasm means that contractions of the esophagus are irregular, uncoordinated, and sometimes powerful. These contractions move food through the esophagus but can cause severe pain. Esophageal spasm is not common. Often, symptoms that may suggest esophageal spasm are the result of another condition such as gastroesophageal reflux disease (GERD) or achalasia."}, {"url": "http://www.everydayhealth.com/gerd/gerd-and-esophageal-spasms.aspx", "passage_text": "The symptoms are similar for both types of esophageal spasm. They include: 1  Chest pain similar to that of a heart attack. 2  This symptom is reported by 80 to 90 percent of people suffering from esophageal spasms. 3  Difficulty swallowing, or feeling like food is stuck in the throat. 4  Heartburn similar to that produced by GERD. A painful and sometimes frightening problem associated with gastroesophageal reflux disease, or GERD, is esophageal spasm, which produces an intense chest-filling pain that leads some people to believe they are having a heart attack."}, {"url": "http://www.mayoclinic.org/diseases-conditions/esophageal-spasms/basics/definition/CON-20025653", "passage_text": "Esophagus. Esophageal spasms are painful muscle contractions that affect your esophagus, the hollow tube between your throat and your stomach. Esophageal spasms can feel like sudden, severe chest pain that lasts from a few minutes to hours. Esophageal spasms usually occur only occasionally. But for some people, the muscle contractions are frequent and can prevent food and liquids from traveling through the esophagus. Esophageal spasms can lead to chronic pain and swallowing problems. Treatment for occasional esophageal spasms may not be necessary"}, {"url": "http://www.mayoclinic.org/diseases-conditions/esophageal-spasms/basics/symptoms/CON-20025653", "passage_text": "Signs and symptoms of esophageal spasms can include: 1  Squeezing pain in your chest, often intense, which you might mistake for heart pain (angina). 2  Difficulty swallowing (dysphagia). 3  The feeling that an object is stuck in your throat (globus). When to see a doctor. The squeezing chest pain that esophageal spasms can cause can also be caused by a heart attack or angina. If you experience squeezing chest pain, especially if it is a new symptom, seek medical care right away to make sure it's not a heart problem. 1  Definition. 2  Causes"}, {"url": "https://www.sharecare.com/health/gerd/throat-spasms-caused-acid-reflux", "passage_text": "Tricyclic antidepressants can also reduce the pain caused by the spasms. Contact one of our doctors if you have questions! Esophageal reflux can cause throat spasms which can feel like an intense, chest filling pain, that some people may belive to be a heart attack. Spasms can occur when eating or drinking, or even when lying down after a meal. Usually they occur without warning"}]