[{"url": "https://en.wikipedia.org/wiki/Synapse", "passage_text": "At a synapse, the plasma membrane of the signal-passing neuron (the presynaptic neuron) comes into close apposition with the membrane of the target (postsynaptic) cell. In many synapses, the presynaptic part is located on an axon, but some postsynaptic sites are located on a dendrite or soma. Astrocytes also exchange information with the synaptic neurons, responding to synaptic activity and, in turn, regulating neurotransmission."}, {"url": "http://medical-dictionary.thefreedictionary.com/synapse", "passage_text": "synapse. the junction between the processes of two neurons or between a neuron and an effector organ, where neural impulses are transmitted by chemical means. The impulse causes the release of a neurotransmitter (e.g. acetylcholine or norepinephrine) from the presynaptic membrane of the axon terminal. synapse. SYNAPSE: Axon terminal synapse. The space between the junction of two neurons in a neural pathway, where the termination of the axon of one neuron comes into close proximity with the cell body or dendrites of another."}, {"url": "http://www.qmu.ac.uk/hn/appliedscience/D%20Excitable%20Tissues/synapses.htm", "passage_text": "b) an axon and a dendrite of another neuron (axo-dendritic synapse), c) between the axon terminals (telodendria) of a neuron and the terminal regions of another neuron (axo-axonic synapses). Synapses are essential for homeostasis as they can either transmit or inhibit impulses. As well as occurring between neurons, synapses also occur at junctions between neurons and effectors (i.e. either muscles or glands); like the junction between a neuron and skeletal muscle cells shown below. Synaptic junctions are of two types; CHEMICAL and ELECTRICAL. 1) CHEMICAL. If the excitable cells are neurons (as above), or a neuron and a muscle cell (shown right), the junction between them forms a chemical synapse"}, {"url": "https://en.wikipedia.org/wiki/Synapse", "passage_text": "The word synapse – from the Greek synapsis (συνάπσις), meaning conjunction, in turn from συνάπτεὶν (συν (together) and ἅπτειν (to fasten)) – was introduced in 1897 by English physiologist Michael Foster at the suggestion of English classical scholar Arthur Woollgar Verrall. In many synapses, the presynaptic part is located on an axon, but some postsynaptic sites are located on a dendrite or soma. Astrocytes also exchange information with the synaptic neurons, responding to synaptic activity and, in turn, regulating neurotransmission."}, {"url": "http://www.answers.com/Q/What_happens_at_the_synapse_between_two_neurons", "passage_text": "Area between two neurons is called a synapse.In the nervous system, a synapse is a structure that permits a neuron to pass an electrical or chemical signal to another cell.neu … rons are cells that are specialized to pass signals to individual target cells, and synapses are the means by which they do so. For cell to cell relay of impulse the terminal of the axon of each neuron come very close to the dendrites of the adjacent neuron leaving only a microscopic gap. This end to end position of the axon of one neuron and the dendrites of another neuron without actual contact is called the Synapse."}, {"url": "https://en.wikipedia.org/wiki/Synapse", "passage_text": "In the nervous system, a synapse is a structure that permits a neuron (or nerve cell) to pass an electrical or chemical signal to another neuron. In many synapses, the presynaptic part is located on an axon, but some postsynaptic sites are located on a dendrite or soma. Astrocytes also exchange information with the synaptic neurons, responding to synaptic activity and, in turn, regulating neurotransmission."}, {"url": "https://en.wikipedia.org/wiki/Chemical_synapse", "passage_text": "At a chemical synapse, one neuron releases neurotransmitter molecules into a small space (the synaptic cleft) that is adjacent to another neuron. The neurotransmitters are kept within small sacs called vesicles, and are released into the synaptic cleft by exocytosis. Chemical synapses are specialized junctions through which neurons signal to each other and to non-neuronal cells such as those in muscles or glands. Chemical synapses allow neurons to form circuits within the central nervous system."}, {"url": "http://www.mind.ilstu.edu/curriculum/neurons_intro/neurons_intro.php", "passage_text": "Chemical neurotransmission occurs at chemical synapses. In chemical neurotransmission, the presynaptic neuron and the postsynaptic neuron are separated by a small gap — the synaptic cleft. The synaptic cleft is filled with extracellular fluid (the fluid bathing all the cells in the brain). "}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/S/Synapses.html", "passage_text": "The junction between the axon terminals of a neuron and the receiving cell is called a synapse. (Synapses at muscle fibers are also called neuromuscular junctions or myoneural junctions 1  .). Action potentials travel down the axon of the neuron to its end(s), the axon terminal(s). "}]