[{"url": "http://blacknaps.org/know-your-hair-type/", "passage_text": "Hair typing is definitely not the 100% solution to understanding your hair, but it does provide you with a good starting point. Knowing your hair type will enable you to choose more suitable products and will help provide you with guidance for how you should care for your hair."}, {"url": "http://www.naturallycurly.com/hair-types", "passage_text": "Textured hair has special care and styling needs based on its unique curl patterns. Inspired by celebrity stylist Andre Walker's hair types, and built upon by NaturallyCurly.com readers and hair professionals, our Texture Typing℠ system details the varieties of wavy, curly and coily hair."}, {"url": "http://www.wikihow.com/Determine-Hair-Type", "passage_text": "Determining your hair type will help you figure out how to handle, cut and style your hair more effectively. Hair type involves understanding different qualities of your hair, including density, texture, porosity (your hair’s ability to hold moisture), elasticity, and curl pattern."}, {"url": "http://www.naturallycurly.com/texture-typing", "passage_text": "Curl pattern refers to the amount of wave, curl, or coil in your hair. It is divided into 3 main hair type categories: Wavy Type 2, Curly Type 3, and Coily Type 4. Knowing your curl pattern will help you find the right products, styles, techniques, and care tips for your hair. More About Pattern. Porosity. Porosity refers to how easily your hair is able to absorb and hold moisture."}, {"url": "http://blacknaps.org/know-your-hair-type/", "passage_text": "find out now! The best way to see your true curl pattern is after you have washed your hair and it has aired dried without product in it. There are two types of systems that are used to classify our hair, one being Andre Walker’s Hair Type Classification System and the other is the LOIS system."}, {"url": "http://www.manlycurls.com/men-hair-types-guide-straight-curly-wavy-kinky/", "passage_text": "Both hair textures (i.e. straight hair and curly hair) do then act as parent terms for the actual men hair types. In the case of straight hair as a texture, its hair type is the same (i.e. straight hair). However, in the case of curly hair as a texture, its hair types are wavy hair, coiled hair and kinky hair."}, {"url": "http://www.wikihow.com/Determine-Hair-Type", "passage_text": "2. Use a towel to partially dry your hair. Towel off extra moisture so your hair is not dripping wet. Do not dry it too much, or else you may not be able to determine the porosity, or how well your hair retains moisture, very well."}, {"url": "http://www.naturallycurly.com/texture-typing", "passage_text": "Our Texture Typing℠ system lets you create a hair profile to help you identify the unique properties and needs of your hair. Understanding curl pattern, porosity, density, width, and length of your hair will help you find the right products, techniques, and care tips that will keep your hair beautiful and healthy."}]