[{"url": "http://www.us-passport-service-guide.com/india-visa.html", "passage_text": "An India visa affixed in a valid passport is required of all United States citizens wanting to enter India. The Indian Embassy has outsourced the processing of visa applications. apply online to expedite your India visa. An India tourist visa has a validity of 6 months, 5 years or 10 years. This is a multiple entry visa. Each entry has a limited duration of 6 months. This means that the maximum amount of time you can stay after entering the country is 6 months."}, {"url": "http://www.ustraveldocs.com/in/in-niv-visafeeinfo.asp", "passage_text": "You will need to pay a separate SEVIS fee in addition to the visa application fee. For nonimmigrant students with Form I-20, the SEVIS fee is US$200. For most exchange visitors with Form DS-2019, the SEVIS fee is US$180. The application fees are listed below and apply to one visa application. The application fee for the most common nonimmigrant visa types is $160. This includes tourist, business, student, and exchange visas. Most petition-based visas, such as work and religious visas, are US$190."}, {"url": "https://indiavisa.travisaoutsourcing.com/consular-fees?id=1", "passage_text": "Journalists traveling to India will need to apply for a Journalist visa regardless of the nature of the trip. 5 year and 10 year Tourist visas are available only to US citizens under a bilateral arrangement. All non-US passport holders are only eligible for up to a Six (6) month Tourist visa. Each stay not to exceed 180 days, hence registration is not required. Irrespective of the duration of validity of visa, on each visit maximum period of stay in India is limited to 6 months (180 days). Please note the visa is valid beginning on the day it is issued. So a 6 Month visa issued on January 1 would be valid until June 30"}, {"url": "https://india-evisa.travisa-online.com/india-eta/about", "passage_text": "The Indian e-Tourist visa is generally issued for a single entry visit with a duration of stay up to 30 days. A maximum of two Indian e-Visas can be issued for the same traveler within one year. Traditional Indian tourist visas can also still be issued, the e-Visa is simply one option. An eTV is a visa for travel to India that is issued electronically. Because the India e-Tourist visa is issued on-line; it is not necessary to submit an original passport or other documents for processing, though the traveler must have an original, valid passport."}, {"url": "http://goindia.about.com/od/planningyourtrip/a/indianvisa.htm", "passage_text": "How Much Does an Indian Tourist Visa Cost. The cost of an Indian Tourist Visa varies between countries according to the arrangement between governments. For a six month Tourist Visa you can expect to pay $76 in the United States, 92 pounds in the United Kingdom (revised upwards in January 2013), and $95 in Australia. This includes service fees. However, no matter what the duration of your Tourist visa is, you're not allowed to remain in India for more than 6 months (180 days) at a time. Furthermore, the above mentioned 5 year tourist visa only allows stays of up to 3 months (90 days) at a time"}, {"url": "http://goindia.about.com/od/visas/qt/Indian-Tourist-Visa-On-Arrival.htm", "passage_text": "The Indian government introduced a tourist visa on arrival scheme on January 1, 2010. It was initially trialed for citizens of five countries. Subsequently, a year later, it was extended to include a total of 11 countries. And, from April 15, 2014 it was extended to include South Korea. "}, {"url": "http://www.immihelp.com/nri/indiavisa/fees.html", "passage_text": "India Visa Fees. The India visa fee amount depends on the type of visa applied for and duration of visa. Since consular fees are fixed on the basis of reciprocal arrangements or special agreements between governments, the fees differ for citizens of different countries. In addition to the visa fees, a processing service fee of $17.00 will be charged by Cox & Kings Global Services per application, per passport. Applicants needing a Protected Area Permit (PAP) will need to pay an extra $30 in addition to the consular fee."}, {"url": "https://india-evisa.travisa-online.com/india-eta/faqs", "passage_text": "A multiple entry visa allows you to enter India several times within the validity period of the visa. The e-Visa is valid for one single entry, and for a maximum stay of 30 days. A traditional Indian visa normally allows multiple entries, and a stay of up to 90 days. The e-Tourist visa allows one single visit for a stay of up to 30 days in India. A maximum of two online visas can be issued within one year."}]