[{"url": "http://www.cannedalbacoretuna.com/", "passage_text": "What's the difference in this albacore? Most people understand that there is a difference between canned chunk light tuna and canned white meat albacore tuna, but most people don't realize that not all albacore tuna are the same. Albacore can vary greatly in taste, quality, and health benefits. "}, {"url": "http://www.merriam-webster.com/dictionary/albacore", "passage_text": "Definition of ALBACORE. : a large pelagic tuna (Thunnus alalunga) with long pectoral fins that is a source of canned tuna; broadly: any of various tunas (as a bonito). See albacore defined for kids. ADVERTISEMENT"}, {"url": "http://www.differencebetween.net/object/comparisons-of-food-items/difference-between-albacore-and-tuna/", "passage_text": "Albacore vs Tuna. Tuna is one of the most sought after food items nowadays. It’s not just because of its taste rather it is most likely because of its health benefits. Nevertheless, there are many types of tunas and these are: the bluefin, yellowfin, skipjack, bigeye, bonito, blackfin. and the albacore. Albacore is priced higher than regular tuna. Albacore has more fats and calories than regular tuna. According to a recent FDA report, in moderation, albacore has lower mercury levels than other tuna products. 5."}, {"url": "https://www.worldwildlife.org/species/albacore-tuna", "passage_text": "Albacore is one of the smaller tuna species, reaching sizes between skipjack and yellowfin. They are bullet-shaped with a dark blue back and lighter blue-gray sides and belly. Ocean. Albacore is one of the smaller tuna species, reaching sizes between skipjack and yellowfin. They are bullet-shaped with a dark blue back and lighter blue-gray sides and belly. Albacore tuna also have very long pectoral fins and live for around 12 years."}, {"url": "https://answers.yahoo.com/question/index?qid=20081130032723AACBLz0", "passage_text": "Best Answer: A: White tuna is albacore tuna. It has a milder flavor and whiter flesh than the tuna labeled light, which can come from skipjack or yellowfin tuna. Albacore or white tuna is slightly higher in calories and fat, but it may be the better choice. Its extra fat is the type known as omega-3 fat, which can help protect against heart disease and cancer"}, {"url": "http://www.thefreedictionary.com/albacore", "passage_text": "n. pl. albacore or al·ba·cores. A large tuna (Thunnus alalunga) of tropical to temperate seas that is commercially important as a source of canned fish. al·ba·core. n. pl. albacore or al·ba·cores. A large tuna (Thunnus alalunga) of tropical to temperate seas that is commercially important as a source of canned fish. [Portuguese."}, {"url": "https://en.wikipedia.org/wiki/Albacore", "passage_text": "The albacore (Thunnus alalunga) is a species of tuna in the family Scombridae. This species is also called albacore fish, albacore tuna, albicore, albie, pigfish, tombo ahi, binnaga, Pacific albacore, German bonito (but see bonito), longfin, longfin tuna, longfin tunny, or even just tuna. It is the only tuna species which may be marketed as white meat tuna in the United States. The albacore tuna's pectoral fin is extremely long and extends well beyond the front of the anal fin except in tuna under 30 cm long. Its average size is about 1.4 m and can weigh up to 60 kg. The albacore's fins consist of seven to 9 dorsal finlets, seven or eight anal finlets, and 25-31 gill rakers."}, {"url": "http://www.differencebetween.net/object/comparisons-of-food-items/difference-between-albacore-and-tuna/", "passage_text": "Contrary to the claim of other people, albacore tuna has a low amount of mercury, says a recent finding by the FDA. Nevertheless, it is also true that not all albacores are the same. This means that some canned albacores are healthier while some may not be that healthy. Albacore is priced higher than regular tuna. Albacore has more fats and calories than regular tuna. According to a recent FDA report, in moderation, albacore has lower mercury levels than other tuna products. 5."}]