[{"url": "https://en.wikipedia.org/wiki/Carrara", "passage_text": "Carrara [karˈraːra] (Emilian: Carara) is a city and comune in the Province of Massa and Carrara (Tuscany, Italy), notable for the white or blue-grey marble quarried there. It is on the Carrione River, some 100 kilometres (62 mi) west-northwest of Florence. "}, {"url": "http://www.ehow.com/facts_5557348_carrara-marble.html", "passage_text": "The quarries of Carrara, Italy, are where Carrara marble comes from. The marble is blasted off in huge blocks and then taken to a factory to be cut and polished. Today, technology allows quarry workers to use giant cutting machines to remove marble from the quarry, but in the past, they had to use dynamite. Carrara marble has been favored as a sculpting material throughout history, especially in the Renaissance. Michaelangelo's famous sculpture, David, is made of Carrara marble."}, {"url": "http://www.ehow.com/facts_5557348_carrara-marble.html", "passage_text": "Carrara marble was used in architecture by the ancient Greeks and Romans, usually as exterior cladding, and it still is used occasionally used today. Carrara marble has been favored as a sculpting material throughout history, especially in the Renaissance. Michaelangelo's famous sculpture, David, is made of Carrara marble."}, {"url": "http://www.ehow.com/facts_5557348_carrara-marble.html", "passage_text": "It gets its name from Carrara, Italy, the city in which this marble is most commonly quarried. With its beautiful white or grayish-blue hue, Carrara is a highly desirable marble. Carrara marble has been favored as a sculpting material throughout history, especially in the Renaissance. Michaelangelo's famous sculpture, David, is made of Carrara marble."}, {"url": "https://en.wikipedia.org/wiki/Carrara_marble", "passage_text": "Carrara marble (sometimes mistakenly Carrera marble) is a type of white or blue-grey marble of high quality, popular for use in sculpture and building decor. It is quarried at the city of Carrara in the province of Massa and Carrara in the Lunigiana, the northernmost tip of modern-day Tuscany, Italy. By the end of the 19th century, Carrara had become a cradle of anarchism in Italy, in particular among the quarry workers. According to a New York Times article of 1894, workers in the marble quarries were among the most neglected labourers in Italy. Many of them were ex-convicts or fugitives from justice."}, {"url": "http://www.ehow.com/facts_5557348_carrara-marble.html", "passage_text": "Carrara Marble. Carrara marble, like all marble, is a metamorphosed limestone. Marble starts its life beneath the Earth's surface as limestone. As the limestone is subjected to heat and pressure through millions of years, it recrystallizes into marble. Carrara marble has been favored as a sculpting material throughout history, especially in the Renaissance. Michaelangelo's famous sculpture, David, is made of Carrara marble."}, {"url": "http://www.granix.com/products/marble/carrara-white-cd/", "passage_text": "Product Description. Carrara White C/D Marble from Italy is the iconic white marble with gray veins. It is available in both tiles and slabs for ultimate flexibility and recommended interior uses include flooring, countertops, backsplashes, shower surrounds and other wall applications. Category: Marble. Marble is a metamorphic rock, which means it changes from its original, sedimentary form (in this case, limestone or dolomite rock) to marble under severe pressure and heat. That highly distinctive aspect of marble–the veining–is the result of impurities in the original limestone."}, {"url": "http://www.houzz.com/ideabooks/158673/list/carrara-vs-calacatta-marble-what-is-the-difference", "passage_text": "There is no such thing as Turkish Carrara. Carrara Marble is called Carrara because of the Italian region it is from, which is Carrara. Turkey is clearly not in Italy and not from the Carrara region so Turkish Carrara is, well an oxymoron. It is actually a gimmick or a trick to try and get you to buy it. Great overview. The biggest surprise is that the Carrara is cool toned and the Calacatta warm tones. Big difference in pricing. Clients usually decide cool or warm tone first (even over viening type believe it or not) Its usually a warmer tone with pretty viens - - Well then you $elected Calacatta."}, {"url": "https://en.wikipedia.org/wiki/Carrara_marble", "passage_text": "History [edit]. Carrara marble has been used since the time of Ancient Rome. In the 17th and 18th centuries, the marble quarries were monitored by the Cybo and Malaspina families who ruled over Massa and Carrara. The family created the Office of Marble in 1564 to regulate the marble mining industry. By the end of the 19th century, Carrara had become a cradle of anarchism in Italy, in particular among the quarry workers. According to a New York Times article of 1894, workers in the marble quarries were among the most neglected labourers in Italy. Many of them were ex-convicts or fugitives from justice."}]