[{"url": "http://www.latimes.com/books/jacketcopy/la-et-jc-2015-newbery-caldecott-and-printz-awards-announced-20150202-story.html", "passage_text": "The book is also the recipient of a Newbery honor and won the National Book Award in the young adult category. The Printz Award for young adult novel went to I'll Give You The Sun by Jandy Nelson, a book about fraternal twins whose lives have diverged. The American Library Assn. announced the winners of its slate of book prizes, including the Newbery, Caldecott and Printz awards, at its annual meeting Monday. The awards are for books for children and young adults, and the medallions that adorn the winners' book covers (and their runners-up) help..."}, {"url": "http://www.ala.org/alsc/awardsgrants/bookmedia/newberymedal/newberyhonors/1999newberymedal", "passage_text": "The 1999 Newbery Medal winner is Holes by Louis Sachar (Farrar Straus Giroux). Sachar's Holes tells the story of Stanley Yelnats. Medal Winner. The 1999 Newbery Medal winner is Holes by Louis Sachar (Farrar Straus Giroux). Sachar's Holes tells the story of Stanley Yelnats. The heir to his family's curse of bad luck, Stanley is convicted of a crime he didn't commit."}, {"url": "http://www.answers.com/Q/What_four_awards_did_the_book_holes_won", "passage_text": "§ In February the same novel won the pre … stigious British book award for children's book of the year, and then later the children's book award. § November of 1997, Rowling won an award for the Philosopher's stone, her first novel. The nestle smarties book prize."}, {"url": "http://www.answers.com/Q/What_four_awards_did_the_book_holes_won", "passage_text": "§ Her third book, Harry Potter and the Prisoner of Azkaban, won the smarties award in December of 1999, making Rowling the first person to win the award three times running.   § In January 2000, Prisoner of Azkaban won the Whitbread Children's Book of the Year award. § November of 1997, Rowling won an award for the Philosopher's stone, her first novel. The nestle smarties book prize."}, {"url": "http://www.sparknotes.com/lit/holes/context.html", "passage_text": "Holes is Sachar's most successful book and has won numerous awards, including the Newbery Medal, the National Book Award, and the Boston Globe-Horn Book Award. Although Sachar is never completely sure where the inspiration for his books comes from, his knowledge of the unbearably hot Texas summers did serve to set the scene for Camp Green Lake. Many of Sachar's books, including Holes, are about children who don't fit in or who have low self-esteem."}, {"url": "http://www.answers.com/Q/What_four_awards_did_the_book_holes_won", "passage_text": "The Giver won the Newbery Medal in 1994, the Heartland Award for Excellence in 1997, and the Buckeye Children's Book Award, also in 1997. § November of 1997, Rowling won an award for the Philosopher's stone, her first novel. The nestle smarties book prize."}, {"url": "http://www.louissachar.com/", "passage_text": "Louis Sachar is an award-winning author of over twenty-one fiction and educational books for children. Louis's book, Holes, won the prestigious National Book Award and the Newbery Medal. CLICK HERE for a review of Card Turner. ______________________________________________. And, Louis's book, Small Steps (the sequel to Holes), has been made into a play (Oregon Children's Theatre, playing April 24 to May 16, 2010). To watch a video about the recording of the music for the play CLICK HERE."}]