[{"url": "http://www.meaning-of-names.com/english-names/edgar.asp", "passage_text": "Meaning of Edgar. English name. In English, the name Edgar means-great spearman.The name Edgar originated as an English name. The name Edgar is most often used as a boy name or male name. English Name Meaning-great spearman."}, {"url": "http://www.searchforancestors.com/surnames/origin/e/edgar.php", "passage_text": "Edgar in RootsWeb surname mailing lists. Join others on the Edgar genealogy mailing list for discussion and sharing of information regarding family histories of Edgar surname and its variations. Note: Not all surnames have a mailing list. If you get the Page is Not Available message, no mailing list is available. Browse or post a query about your genealogy, surname origin, or family history in the Edgar surname forum. Look for unknown cousins or relatives with whom you may have lost touch. Whenever there's a will, you'll see an heir loom"}, {"url": "http://www.ancestry.com/name-origin?surname=edgar", "passage_text": "You can find out where the majority of the Edgar families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists. Census records can offer a lot of little known facts about your Edgar ancestors, such as occupation. Occupation can tell you about your ancestors' social status and economic status."}, {"url": "http://www.ancestry.com/name-origin?surname=edgar", "passage_text": "Edgar Name Meaning. Scottish and English: from the Old English personal name Eadgar, composed of the elements ead ‘prosperity’, ‘fortune’ + gar ‘spear’. The name is found in Middle English in various forms, e.g. Edgar, Adger, Agar. Census records can offer a lot of little known facts about your Edgar ancestors, such as occupation. Occupation can tell you about your ancestors' social status and economic status."}, {"url": "http://www.surnamedb.com/Surname/Edgar", "passage_text": "The first recorded spelling of the family name is shown to be that of William Algar, which was dated 1221, witness in the Assize Court Rolls of Worcestershire, during the reign of King Henry 111, known as The Frenchman, 1216 - 1272. Surnames became necessary when governments introduced personal taxation. "}, {"url": "http://www.searchforancestors.com/surnames/origin/e/edgar.php", "passage_text": "Instead, check the index of mailing lists for a sound-alike name. Edgar in Ancestry Message Boards. Browse or post a query about your genealogy, surname origin, or family history in the Edgar surname forum. Look for unknown cousins or relatives with whom you may have lost touch. Whenever there's a will, you'll see an heir loom"}, {"url": "https://en.wikipedia.org/wiki/EDGAR", "passage_text": "EDGAR, the Electronic Data Gathering, Analysis, and Retrieval system, performs automated collection, validation, indexing, acceptance, and forwarding of submissions by companies and others who are required by law to file forms with the U.S. Securities and Exchange Commission (the SEC). "}, {"url": "http://www.selectsurname.com/edgar.html", "passage_text": "Edgar lost out as a name after the Conquest when it became politically correct to adopt French names. But Edgar did become established as a surname on the Scottish borders. This Scottish origin and history was first recounted in J.W. Lawrence-Archer's 1873 book An Account of the Surname Edgar. "}, {"url": "http://www.thinkbabynames.com/meaning/1/Edgar", "passage_text": "Edgar /ed-gar/ [2 sylls.] as a boys' name is pronounced ED-gar. It is of Old English origin, and the meaning of Edgar is  wealthy spear. From ad meaning riches and g r meaning spear. A royal name in Anglo-Saxon England. Name of an English king and saint, Edgar the Peaceful (10th century), who was the father of two other saints, Edward and Edith."}]