[{"url": "http://www.artyfactory.com/egyptian_art/egyptian_hieroglyphs/rosetta_stone.htm", "passage_text": "The Rosetta Stone is our key to understanding the meaning of hieroglyphs. The Rosetta Stone was a black basalt slab with the same piece of writing carved in three different languages: Hieroglyphics (top), Demotic (middle) and Greek (bottom)."}, {"url": "http://ancienthistory.about.com/cs/egypt/p/rosettastone.htm", "passage_text": "Languages of the Rosetta Stone: The Rosetta Stone is inscribed in 3 languages: 1  Demotic (the everyday script, used to write documents), 2  Greek (the language of Ionian Greeks, an administrative script), and. 3  Hieroglyphs (for priestly business)."}, {"url": "http://www.byui.edu/special-collections/exhibits/rosetta-stone", "passage_text": "Summary. The Rosetta Stone, not to be confused with the language learning software, is a granodiorite stone. It was found in 1799 in Rosetta, Egypt by French scholars and sent to Napoleon. It contains the same writing in three different languages: Hieroglyphics (sacred language), Demotic (reformed Egyptian) and Greek. This allowed scholars to decipher Hieroglyphics and unlock the writings and history of Egypt"}, {"url": "http://www.ancientegypt.co.uk/writing/rosetta.html", "passage_text": "The Rosetta Stone is written in three scripts because when it was written, there were three scripts being used in Egypt. The first was hieroglyphic which was the script used for important or religious documents. Detail of hieroglyphic and demotic script on the Rosetta Stone. The second was demotic which was the common script of Egypt. The third was Greek which was the language of the rulers of Egypt at that time. The Rosetta Stone was written in all three scripts so that the priests, government officials and rulers of Egypt could read what it said"}, {"url": "http://www.ancientegypt.co.uk/writing/rosetta.html", "passage_text": "The Rosetta Stone is written in three scripts because when it was written, there were three scripts being used in Egypt.The first was hieroglyphic which was the script used for important or religious documents. Detail of hieroglyphic and demotic script on the Rosetta Stone. The second was demotic which was the common script of Egypt. The third was Greek which was the language of the rulers of Egypt at that time."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20060919112613AAhZl0s", "passage_text": "The third was Greek which was the language of the rulers of Egypt at that time. The Rosetta Stone was written in all three scripts so that the priests, government officials and rulers of Egypt could read what it said. The Rosetta Stone was written in three scripts so that it could be read by visiting priests, government officials, and rulers of Egypt. The first script was Hieroglyphic, which was the script used for religious documents and other important communications."}, {"url": "http://www.ancientegypt.co.uk/writing/rosetta.html", "passage_text": "The Rosetta Stone The Rosetta Stone What is the Rosetta Stone? The Rosetta Stone is a stone with writing on it in two languages (Egyptian and Greek), using three scripts (hieroglyphic, demotic and Greek). Detail of hieroglyphic and demotic script on the Rosetta Stone. The second was demotic which was the common script of Egypt. The third was Greek which was the language of the rulers of Egypt at that time."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20060919112613AAhZl0s", "passage_text": "The Rosetta Stone is a stone with writing on it in two languages (Egyptian and Greek), using three scripts (hieroglyphic, demotic and Greek). The Rosetta Stone was written in three scripts so that it could be read by visiting priests, government officials, and rulers of Egypt. The first script was Hieroglyphic, which was the script used for religious documents and other important communications."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20060919112613AAhZl0s", "passage_text": "The Rosetta Stone is written in three scripts because when it was written, there were three scripts being used in Egypt. The first was hieroglyphic which was the script used for important or religious documents. The Rosetta Stone was written in three scripts so that it could be read by visiting priests, government officials, and rulers of Egypt. The first script was Hieroglyphic, which was the script used for religious documents and other important communications."}, {"url": "http://www.answers.com/Q/What_three_languages_were_on_the_Rosetta_stone", "passage_text": "The second was demotic which was the common script of Egypt. The third was Greek which was the language of the rulers of Egypt at that time.The Rosetta Stone was written in all three scripts so that the priests, government officials and rulers of Egypt could read what it said. 3 people found this useful. There are two languages on the Rosetta Stone 1) # Greek and 2) Egyptian in two scripts # Demotic, used in everyday writing and # Hieroglyphs, what you see all over the temples. For more information, see 'Related links' below this box."}]