[{"url": "http://www.7continentslist.com/", "passage_text": "Read All Articles. NORTH-AMERICA. North America is the third largest continent in the world after Asia and Africa. In Mexico, there are world's largest petroleum and natural gas deposits. Geographic calculations show that North America is two times larger than Europe. Asia is the world's largest continent with respect to both population and area. Almost 1/3rd of the world’s population lives here. It is also home to 10 highest mountain peaks among which Mount Everest is the highest one. Coming next in rank, the Mount Godwin Austen (K2) is in Pakistan."}, {"url": "http://www.mapsofworld.com/continents/world-map-largest-continent.html", "passage_text": "Largest Continent in The World. The world map shows Asia is the largest continent in the world out of 7 continents, situated in the eastern and northern hemispheres. Asia has an overall area of 44,579,000 sq. km. (that constitute 8.7% of the total surface area of the earth) and a population of almost 4 billion people (60% of the human population of the world)."}, {"url": "http://www.7continents5oceans.com/", "passage_text": "But in general there are seven large land masses on earth, namely Africa, Antarctica, Asia, Australia, Europe, North America and South America. You must be wondering to know what are the 7 Continents of the World. You can get all the 7 continents of the world maps as well. The continent of Australia is a single country continent. It is the sixth largest country by total area, and is also the smallest of all the seven continents. Because of its size, and isolated location, it is also called as island"}, {"url": "http://geography.about.com/od/learnabouttheearth/qt/qzcontinents.htm", "passage_text": "In Europe and other parts of the world, many students are taught of six continents, where North and South America are combined to form a single continent of America. Thus, these six continents are Africa, America, Antarctica, Asia, Australia, and Europe. I am informed that in France, it is not taught that Antarctica is a continent and thus there are five continents for French students. By Matt Rosenberg. A continent is one of several major land masses on the earth."}, {"url": "http://www.7continents5oceans.com/", "passage_text": "Africa is the second largest continent in the world. It is also the second largest continent in the world in terms of population. Africa is commonly referred to as the black continent by many. This large land mass comprises of 54 countries and is home to one billion people. The continent of Australia is a single country continent. It is the sixth largest country by total area, and is also the smallest of all the seven continents. Because of its size, and isolated location, it is also called as island"}, {"url": "https://en.wikipedia.org/wiki/Continent", "passage_text": "A continent is one of several very large landmasses on Earth. They are generally identified by convention rather than any strict criteria, with up to seven regions commonly regarded as continents. These are (from largest in size to smallest): Asia, Africa, North America, South America, Antarctica, Europe, and Australia. In geology, areas of continental crust include regions covered with water"}, {"url": "http://www.nationalgeographic.com/faq/geography.html", "passage_text": "By convention there are seven continents: Asia, Africa, North America, South America, Europe, Australia, and Antarctica. Some geographers list only six continents, combining Europe and Asia into Eurasia. In parts of the world, students learn that there are just five continents: Eurasia, Australia, Africa, Antarctica, and the Americas."}, {"url": "http://www.answers.com/Q/List_continents_from_smallest_to_largest", "passage_text": "1 The Vast and Varied Continent of Africa Africa is the second-largest continent in the world behind Asia. 2  It has a total area of 11.73 million square miles. The largest continent is Asia, and I think the smallest is Europe Right on Asia, but wrong on Europe. the smallest continent is Australia. 6 people found this useful."}, {"url": "http://www.7continentslist.com/largest-continent-in-the-world.php", "passage_text": "Asia is the largest continent in the world both in terms of area and population, and is geographically located on the eastern and northern hemispheres. The giant continent covers nearly 9% of the total surface of the planet earth with 4.16 billion people living on it. "}]