[{"url": "http://www.potatogoodness.com/whats-new-for-potatoes-at-home/starch/", "passage_text": "1 Starch is a form of complex carbohydrate that is found in a variety of foods of all different colors. 2  Foods that are high in starch include breads, grains, cereals, pasta, rice, potatoes, peas, corn and beans – in other words, grains, legumes and some vegetables."}, {"url": "http://www.omnilexica.com/?q=starch", "passage_text": "noun-plural: starches. 1  a complex carbohydrate found chiefly in seeds, fruits, tubers, roots and stem pith of plants, notably in corn, potatoes, wheat, and rice; an important foodstuff and used otherwise especially in adhesives and as fillers and stiffeners for paper and textiles."}, {"url": "http://www.thefreedictionary.com/starch", "passage_text": "starch. 1. A carbohydrate that is the chief form of stored energy in plants, especially wheat, corn, rice, and potatoes. Starch is a kind of polysaccharide and forms a white, tasteless powder when purified. It is an important source of nutrition and is also used to make adhesives, paper, and textiles. 2."}, {"url": "http://www.audioenglish.org/dictionary/starch.htm", "passage_text": "1. a complex carbohydrate found chiefly in seeds, fruits, tubers, roots and stem pith of plants, notably in corn, potatoes, wheat, and rice; an important foodstuff and used otherwise especially in adhesives and as fillers and stiffeners for paper and textiles. Familiarity information: STARCH used as a noun is very rare."}, {"url": "http://www.potatogoodness.com/whats-new-for-potatoes-at-home/starch/", "passage_text": "1 Starchy foods provide so much more than calories! 2  Many starchy foods are also high in essential vitamins and minerals. 3  The potato is a good example of a nutritious “starch.” A potato eaten with the skin offers important dietary fiber, is rich in vitamin C and a good source of potassium and vitamin B6."}, {"url": "http://www.thefreedictionary.com/Otaheite+arrowroot+starch", "passage_text": "Otaheite arrowroot. amylum, starch-a complex carbohydrate found chiefly in seeds, fruits, tubers, roots and stem pith of plants, notably in corn, potatoes, wheat, and rice; an important foodstuff and used otherwise especially in adhesives and as fillers and stiffeners for paper and textiles. 1  Facebook."}]