[{"url": "http://www.healthlinkbc.ca/healthfiles/hfile68e.stm", "passage_text": "Very few foods have vitamin D in them. Foods with a higher amount of vitamin D include fish, liver, and egg yolk. Excellent sources of vitamin D are foods and beverages that have vitamin D added to them. Cow milk always has added vitamin D. Orange juice, margarine, and soy beverage usually have it added. For other foods, check the label. You know vitamin D has been added if you see 'fortified' or 'enriched' on the label"}, {"url": "https://www.sharecare.com/health/vitamin-d/foods-good-sources-vitamin-d", "passage_text": "Vitamin D is found primarily in foods to which vitamin D has been added (fortified). This vitamin is critical for bone health. Milk is usually fortified with vitamin D, but other dairy products such as cheese and ice cream generally are not. Such foods as milk, the major source of vitamin D in food, and most breakfast cereals, contain vitamin D as an additive. These additions, which help prevent rickets (a vitamin D deficiency disease) in children, are synthetic."}, {"url": "http://www.webmd.com/food-recipes/vitamin-mineral-sources", "passage_text": "Food sources include: Fortified cereals, fortified soy-based meat substitutes, baked potatoes with skin, bananas, light-meat chicken and turkey, eggs, and spinach. What it does: Supports your nervous system. Helps the body break down proteins. Helps the body break down stored sugar. Food sources include: Enriched, fortified, or whole-grain products such as bread, pasta, and cereals. What it does: Helps the body process carbohydrates and some protein. Vitamin B2 (Riboflavin). Food sources include: Milk, breads, fortified cereals, almonds, asparagus, dark meat chicken, and cooked beef."}, {"url": "http://phpa.dhmh.maryland.gov/OEHFP/OFPCHS/Milk/Shared%20Documents/DPC053_Vitamin_AD_Fortification_Fluid_Milk.pdf", "passage_text": "Although milk as it comes from the cow is a poor source of vitamin D, fortified milk is considered an excellent source, especially because of its calcium content. Other foods considered good dietary sources of vitamin D are relatively rare but do include fatty fish, eggs and liver. "}, {"url": "https://www.sharecare.com/health/vitamin-d/foods-good-sources-vitamin-d", "passage_text": "One way of getting enough vitamin D is through food. Some foods, mainly fish and shellfish, contain vitamin D naturally. Such foods as milk, the major source of vitamin D in food, and most breakfast cereals, contain vitamin D as an additive. These additions, which help prevent rickets (a vitamin D deficiency disease) in children, are synthetic."}, {"url": "http://www.webmd.com/food-recipes/vitamin-mineral-sources", "passage_text": "Vitamin A. Food sources include: Cod-liver oil, sweet potatoes, carrots, leafy vegetables, and fortified foods such as breakfast cereals. What it does: Promotes good eyesight and normal functioning of the immune system. Food sources include: Enriched, fortified, or whole-grain products such as bread, pasta, and cereals. What it does: Helps the body process carbohydrates and some protein. Vitamin B2 (Riboflavin). Food sources include: Milk, breads, fortified cereals, almonds, asparagus, dark meat chicken, and cooked beef."}, {"url": "http://www.dietitians.ca/Your-Health/Nutrition-A-Z/Vitamins/Food-Sources-of-Vitamin-D.aspx", "passage_text": "In Canada, some foods such as milk, soy or rice beverages and margarine have vitamin D added to them. Good food sources of vitamin D include certain kinds of fish, egg yolks and milk. The following table will show you foods that are a source of vitamin D. 1 Vitamin D is a fat-soluble vitamin. 2  This means that your body can store extra amounts of vitamin D. 3  It is important to get enough vitamin D from your diet because it helps our bodies absorb and use calcium and phosphorous for strong bones and teeth. 4  Vitamin D can help protect older adults against osteoporosis."}, {"url": "https://www.sharecare.com/health/vitamin-d/foods-good-sources-vitamin-d", "passage_text": "Good dietary sources of vitamin D -- eggs, as well as fortified milk and cereal -- while common in young people's diets, are often missing in elderly people's diets. Such foods as milk, the major source of vitamin D in food, and most breakfast cereals, contain vitamin D as an additive. These additions, which help prevent rickets (a vitamin D deficiency disease) in children, are synthetic."}, {"url": "https://www.algaecal.com/algaecal-ingredients/vitamin-d/sources/", "passage_text": "There are only a few foods that are good sources of vitamin D, 4 so vitamin D supplements are often recommended unless you are exposed to sunlight on your skin regularly. Suggested dietary sources of vitamin D are listed below. Table 1: Selected food sources of vitamin D10-12. Food. "}]