[{"url": "http://www.answers.com/Q/Who_are_the_presidents_that_were_born_in_Virginia", "passage_text": "Eight United States Presidents were born in Virginia: George Washington Thomas Jefferson James Madison James Monroe William Harrison John Tyler Zachary Taylor Woodrow Wilson. …   John Tyler, born in Virginia, 10th President, 1841-1845. 4 people found this useful."}, {"url": "http://www.answers.com/Q/What_presidents_were_born_in_virginia", "passage_text": "Eight United States Presidents were born in Virginia: George Washington Thomas Jefferson James Madison James Monroe William Harrison John Tyler Zachary Taylor Woodrow Wilson."}, {"url": "http://www.50states.com/facts/virginia.htm", "passage_text": "1 Six Presidents' wives were born in Virginia: Martha Washington, Martha Jefferson, Rachel Jackson, Letitia Tyler, Ellen Arthur, Edith Wilson. 2  Seven Presidents are buried in Virginia: Washington, Jefferson, Madison, Monroe, Tyler, Taft and Kennedy."}, {"url": "http://snippets.com/who-are-the-eight-presidents-who-were-born-in-virginia.htm", "passage_text": "Answer by suze (333). The eight United States presidents born in Virgina are George Washington, Thomas Jefferson, James Madison, James Monroe, William Henry Harrison, John Tyler, Zachary Taylor, and Woodrow Wilson. George Washington is probably the most famous being the first president of the United States. add a comment."}, {"url": "http://www.answers.com/Q/Who_are_the_presidents_that_were_born_in_Virginia", "passage_text": "The eight Presidents of the United States born in Virginia are: Eight US Presidents Born in Virginia There were eight US Presidents born in Virginia. The 1st President of the United States George Washington was born in Pope's Creek, Virginia. The 3rd President of the United States Thomas Jefferson was born in Goochland County, Virginia. The 4th President of the United States James Madison was born in Port Conwa"}, {"url": "http://www.answers.com/Q/What_presidents_were_born_in_virginia", "passage_text": "The presidents that were born in Virgina are George Washington, Thomas Jefferson, James Madison, James Monroe, William Henry Harrison, John Tyler, Zachary Taylor, and Wo … odrow Wilson."}]