[{"url": "http://www.answers.com/Q/What_is_the_area_between_the_lungs_in_the_chest_cavity_that_contains_the_heart_aorta_trachea_esophagus_and_bronchi", "passage_text": "Merge this question into. Split and merge into it. Answer by Metla Sushmitha. Confidence votes 195. the area present between two lungs in chest cavity is called mediastenum.this is the place where heart is present.The mediastinum lies between the right and left pleurae pleuræ in and near the median sagittal plane of the. chest The mediastinum contains the heart, aorta, esophagus, trachea,  bronchial tubes, and thymus. The mediastinum is a region in the  center of the thoracic cavity."}, {"url": "http://www.cts.usc.edu/zglossary-mediastinum.html", "passage_text": "The mediastinum is artificially divided into the anterior, middle and posterior sections. The mediastinum contains all of the chest organs except the lungs. Organs located in the mediastinum include the heart, the aorta, the thymus gland, the chest portion of the trachea, the esophagus, lymph nodes and important nerves."}, {"url": "https://en.wikipedia.org/wiki/Mediastinum", "passage_text": "The mediastinum (from Medieval Latin mediastinus, midway) is the central compartment of the thoracic cavity surrounded by loose connective tissue, as an undelineated region that contains a group of structures within the thorax. It is surrounded by the chest wall in front, the lungs to the sides and the spine at the back. It extends from the sternum in front to the vertebral column behind, and contains all the organs of the thorax except the lungs. It is continuous with the loose connective tissue of the neck."}, {"url": "https://en.wikipedia.org/wiki/Mediastinum", "passage_text": "The mediastinum lies within the thorax and is enclosed on the right and left by pleurae. It is surrounded by the chest wall in front, the lungs to the sides and the spine at the back. It extends from the sternum in front to the vertebral column behind, and contains all the organs of the thorax except the lungs. It is continuous with the loose connective tissue of the neck."}, {"url": "http://healthfixit.com/where-is-the-heart-located/", "passage_text": "Location of heart in the Mediastinum. Heart is located in a space in the centre of the chest cavity called mediastinum in particular theMiddle mediastinum. It is the space between the 2 lungs and the heart is wedged between them. [ 3 ]. The mediastinum is divided into. 1  Superior mediastinum. Heart is located safely inside the chest cavity which looks like a cage bound by the ribs and breast bone (sternum). The chest cavity is also called as thoracic cavity and it lies between neck and abdomen. Heart lies slightly to the left in the chest cavity. [ 2 ]"}, {"url": "http://www.wisegeek.com/what-is-the-mediastinum.htm", "passage_text": "This area may be descriptively divided into four sections. The superior mediastinum is the area above the upper level of the pericardium, the sac containing the heart. The other three sections are located below the upper level of the pericardium. From from to back, these sections are the anterior, middle, and posterior mediastina. "}, {"url": "http://www.cts.usc.edu/zglossary-mediastinum.html", "passage_text": "The mediastinum is the middle section of the chest cavity. The chest cavity contains the left and right lungs, which lie on either side of the heart. The heart is contained in the portion of the chest known as the mediastinum. Organs located in the mediastinum include the heart, the aorta, the thymus gland, the chest portion of the trachea, the esophagus, lymph nodes and important nerves."}, {"url": "http://www.answers.com/Q/What_is_located_between_the_lungs_and_mediastinum", "passage_text": "The mediastinum is a region of soft tissue located between the pleural cavities (the lungs). It is divided into a superior and inferior portion; the inferior portion is furthe … r subdivided into a anterior, middle and posterior portion. The mediastinum (the space between the lungs) is located in the thoracic body cavity. The thoracic cavity is part of the ventral body cavity. 8 people found this useful. Edit"}]