[{"url": "http://www.healthline.com/human-body-maps/tricuspid-valve", "passage_text": "Right atrioventricular valve (Tricuspid valve). The tricuspid valve forms the boundary between the right ventricle and the right atrium. Deoxygenated blood enters the right side of the heart via the inferior and superior vena cava. These are large veins that transport deoxygenated blood from the body back to the heart."}, {"url": "http://emedicine.medscape.com/article/1923232-overview", "passage_text": "The tricuspid valve is located between the right atrium and right ventricle and has a valve area of 4-6 cm 2 (see the following image and video). The valve is nearly vertical and is approximately 45° to the sagittal plane."}, {"url": "http://www.healthline.com/human-body-maps/tricuspid-valve", "passage_text": "The tricuspid valve forms the boundary between the right ventricle and the right atrium. Deoxygenated blood enters the right side of the heart via the inferior and superior vena cava. These are large veins that transport deoxygenated blood from the body back to the heart."}, {"url": "http://my.clevelandclinic.org/services/heart/disorders/heart-valve-disease/tricuspid-valve-disease", "passage_text": "For more information on valve disease and its treatment, see Valve Disease. The tricuspid valve is located between the right atrium (top chamber) and right ventricle (bottom chamber). Its role is to make sure blood flows in a forward direction from the right atrium to the ventricle. Tricuspid valve disease refers to abnormal function of the tricuspid valve."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/000169.htm", "passage_text": "Tricuspid regurgitation is a disorder in which this valve does not close tight enough. This problem causes blood to flow backward into the right upper heart chamber (atrium) when the right lower heart chamber (ventricle) contracts. An increase in size of the right ventricle is the most common cause of this condition."}, {"url": "http://www.healthline.com/human-body-maps/tricuspid-valve", "passage_text": "Blood collects within the right atrium, and it must flow through the tricuspid valve in order to enter the right ventricle. Then, blood exits the heart via the pulmonary artery, which transmits blood to the lungs for oxygenation. The term tricuspid refers to how the valve is constructed."}, {"url": "http://my.clevelandclinic.org/services/heart/disorders/heart-valve-disease/tricuspid-valve-disease", "passage_text": "Two types of tricuspid disease include: 1  Tricuspid regurgitation-the valve is leaky or doesn't close tight enough, causing blood to leak backwards across the valve. 2  Tricuspid stenosis-the valve leaflets are stiff and do not open widely enough, causing a restriction in the forward flow of blood."}]