[{"url": "http://www.thechinaguide.com/index.php?action=activity/greatWallOfChina", "passage_text": "The Great Wall of China was built over more than two thousand years. Construction on the first section began between the 7th and 6th century BC, and the last work on the wall was done between the 14th and 17th centuries. "}, {"url": "http://www.dimensionsinfo.com/how-big-is-the-great-wall-of-china/", "passage_text": "The size of the Great Wall of China makes it one of the most impressive structures ever built. The total length is 8,851.8 km (5,500.3 mi). But the actual length of the wall is 6,259.6 km (3,889.5 mi) while the trenches are 359.7 km (223.5 mi). This area of the Wall is 5 meters (16 ft) wide and 7.8 meters (26 ft) high. The Jiayuguan West Pass is the Wall’s western edge. One of the most striking areas is the steep slopes of the Ming Wall. It is 5 to 8 meters (16–26 ft) high and 1 kilometer (6.8 mi) long. Across the bottom it is 6 meters (20 ft) across. Along the top it narrows down to 5 meters (16 ft) across"}, {"url": "https://en.wikipedia.org/wiki/Great_Wall_of_China", "passage_text": "The Great Wall stretches from Dandong in the east, to Lop Lake in the west, along an arc that roughly delineates the southern edge of Inner Mongolia. A comprehensive archaeological survey, using advanced technologies, has concluded that the Ming walls measure 8,850 km (5,500 mi). Several walls were being built as early as the 7th century BCE; these, later joined together and made bigger and stronger, are now collectively referred to as the Great Wall. Especially famous is the wall built 220–206 BCE by Qin Shi Huang, the first Emperor of China. Little of that wall remains."}, {"url": "http://www.answers.com/Q/How_big_is_the_Great_Wall_of_China", "passage_text": "The Great Wall of China is a very large wall that stretches from one end of China to the other. In fact, it is so big astronauts can see it from space! It was built to keep ou … t Mongolian invaders. The Great Wall of China was most definitely a wall. How thick are the wall of the Great wall of china? The with of the great wall varies from 4,6 to 9,1 meters 515 to 30 feet) at the base and from 2.7 to 3.7 meters (from 9 to 12 feet) at the top. Watchtowers rise above the wa … ll at certain points."}, {"url": "http://www.history.com/topics/great-wall-of-china", "passage_text": "Wall Building During the Ming Dynasty. Despite its long history, the Great Wall of China as it is exists today was constructed mainly during the mighty Ming dynasty (1368-1644). Like the Mongols, the early Ming rulers had little interest in building border fortifications, and wall building was limited before the late 15th century. "}, {"url": "http://geography.about.com/od/specificplacesofinterest/a/greatwall.htm", "passage_text": "By Matt Rosenberg. The Great Wall of China is not a continuous wall but is a collection of short walls that often follow the crest of hills on the southern edge of the Mongolian plain. The Great Wall of China, known as long Wall of 10,000 Li in China, extends about 8,850 kilometers (5,500 miles). While at a low orbit, the Great Wall of China can certainly be seen from space, it is not unique in that regard. However, when leaving the Earth's orbit and acquiring an altitude of more than a few thousand miles, no man-made objects are visible at all."}, {"url": "https://en.wikipedia.org/wiki/Great_Wall_of_China", "passage_text": "One of the most striking sections of the Ming Great Wall is where it climbs extremely steep slopes in Jinshanling. There it runs 11 kilometers (6.8 mi) long, ranges from 5 to 8 meters (16 to 26 ft) in height, and 6 meters (20 ft) across the bottom, narrowing up to 5 meters (16 ft) across the top. Several walls were being built as early as the 7th century BCE; these, later joined together and made bigger and stronger, are now collectively referred to as the Great Wall. Especially famous is the wall built 220–206 BCE by Qin Shi Huang, the first Emperor of China. Little of that wall remains."}, {"url": "http://www.dailymail.co.uk/news/article-2155457/Miles-The-Great-Wall-China-13-170-miles-long--thats-twice-length-previous-estimates.html", "passage_text": "In an archaeological survey that took five years to complete, China's State Administration of Cultural Heritage announced yesterday that the wall measures 21,196.18 km (13,170.69 miles). The Great Wall of China north of Beijing, China. The Great Wall of China is among Seven Wonders of the World. That's considerably longer than the previous mark of 8,850 km (5,500 miles), which was based largely on historical records. The Great Wall was started in 500 BC and first linked up under leader Qin Shi Huang in about 220 BC to protect China's northern border and fend off foreign invaders."}, {"url": "http://www.answers.com/Q/How_big_is_the_Great_Wall_of_China", "passage_text": "In Beijing. The Great Wall. Built over thousands of years, the wall stretches over 8,851 kilometers (5,500 miles). The wall begins in Hushan in Liaoning Province in the east … and travels across China to the Jiayuguan Pass in Gansu Province in the west. How thick are the wall of the Great wall of china? The with of the great wall varies from 4,6 to 9,1 meters 515 to 30 feet) at the base and from 2.7 to 3.7 meters (from 9 to 12 feet) at the top. Watchtowers rise above the wa … ll at certain points."}]