[{"url": "http://forum.alzheimers.org.uk/showthread.php?15982-Care-at-home-for-the-bed-bound", "passage_text": "The other thing you should consider is if she's bed bound you may require something like the air matresses they use to stop bed sores. Hopefully others who have gone through this will give you some advice. Jennifer Volunteer moderator and former long distance carer. A test of a people is how it behaves toward the old. "}, {"url": "https://www.caring.com/questions/how-long-can-you-live-without-eating", "passage_text": "This must be a very intense time for you. The length of time someone can live without eating depends on their weight (or amount of body fat), health, and, many See also: After losing the ability to swallow, how long can my mom last? believe, attitude. Medical experts usually say the average person can live for 4 to 6 weeks without food. The amount of time someone can go without water is much shorter, roughly a week (or less)"}, {"url": "http://www.xmms.org/qna/How_long_can_elderly_survive_bedridden-qna849840.html", "passage_text": "1 50% - How long does it take for an an elderly person survive without food if not conscious? 2  64% - How long can an elderly person survive on a glucose drip without eating? 3  64% - How long to live bedridden no fluids? 4  28% - My father is recently bedridden,how long will he live? 1 65% - How long lives bedridden elderly? 2  65% - How long can a dying elderly person survive without water? 3  52% - How long might an elderly man survive on an iv containing dextrose and sodium-chloride? 4 "}, {"url": "https://answers.yahoo.com/question/index?qid=20070516235951AADpVMx", "passage_text": "A parapalegic or quadraplegic can live a very long time. For example, I know a parapalegic who has been living with his disability for 24 years. It all depends on the level of care and the amount of help the affected person has surrounding him or her. Only heaven knows how long a person will live whether they are healthy or have some type of medical problem. "}, {"url": "http://www.xmms.org/qna/How_long_can_a_bedridden_person_live-qna989782.html", "passage_text": "1 67% - How long lives bedridden elderly? 2  24% - How long does a person with lung,stomache cancer have to live now that they have stopped treating it and that person is taking steroids and morphine p? 3  57% - How long a person live without vegetible? 4  64% - How long can a person live old age bed ridden? 0. Typically, a person can live 4 to 6 weeks without food. Of course, age can be a factor. A 91 year old person might be in better physical, mental, and nutritional health than a 25 year old. With that being said, the older person might live longer than the younger person. If the 91 year old is already in poor health, there would be greater odds for him/her to die sooner than the 4 weeks. source: How may days can a 91 year old person live without eating"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070211041520AAQvKIh", "passage_text": "How long can a person live without water? Humans body is a very complicated thing and everybody thinks differently when you ask them, How long do you think a person could live without water?. Some people will say weeks, and others will reply a few days or even hours. Nobody knows exactly what it is but they have some guesses. It all depends on the person's shape and structure. If the person is heavy and weights a lot then it is most likely for them to survive for a while. But if the person is skinny and out of shape, that person will have less chance to surviving for as long the the fat person."}, {"url": "https://www.agingcare.com/Questions/how-long-can-a-person-live-after-reaching-the-last-stages-of-Alzheimers-139233.htm", "passage_text": "The telephone number is 1-800-272-3900 and will be answered 24/7. Still another contact you can make is with your local Hospice organization--they are wonderful people-and are VERY supportive to both the patient as well as the families involved. My mom was in this stage for about 6 years. She couldn't walk or talk, was totally incontinent and bed bound. I see this with many of my clients with end-stage dementia, and from their stories I can tell you that each person is different. Some people can thrive for years with the right care-and others, even with the best care, can pass quickly"}, {"url": "http://www.extension.umn.edu/garden/insects/find/bed-bugs-in-residences/", "passage_text": "They live close to areas where people typically sleep, rest, or sit for long periods. Hungry bugs will move out from their hiding places, in search of exposed skin. Typically, the head and neck are bitten, but bed bugs will also bite bare arms, hands, and legs. Bed bug before and after a blood meal. Adult bed bugs are oval, flattened, brown, and wingless insects approximately 1/4 to 3/8 long (5-9 mm). They are similar in appearance to a wood tick. After the bug has taken a blood meal, its color will change from brown to purplish-red."}]