[{"url": "http://www.ocra.com/jurisdictions/bermuda.asp", "passage_text": "Authorised and Issued Share Capital. The usual authorised share capital of a Bermuda exempt company is US$ 12,000; divided in to 12,000 common voting shares of US$ 1, which is the maximum capital for the minimum capital duty payable on incorporation and annually thereafter. The minimum issued capital is US$ 1. Bermuda consists of a group of over 150 small coral islands in the North Atlantic Ocean, and is not, as often believed, part of the Caribbean or West Indies. A series of bridges connect the main islands which cover a total area of 52km sq."}, {"url": "https://i-incorporate.com/Bermuda.html", "passage_text": "There is no income, corporation or capital gain taxes in Bermuda, and the Government routinely grants an assurance under the Exempted Undertakings Tax Protection Act of 1966 that no such taxes will be imposed with respect to a particular exempted company until 2016. Bermuda companies which are owned by non-Bermudians are designated as exempted and, as such, must carry on their business outside Bermuda. Only local companies at least 60 per cent owned by Bermudians are allowed to carry on business in Bermuda."}, {"url": "http://www.ocra.com/jurisdictions/bermuda.asp", "passage_text": "The usual authorised share capital of a Bermuda exempt company is US$ 12,000; divided in to 12,000 common voting shares of US$ 1, which is the maximum capital for the minimum capital duty payable on incorporation and annually thereafter. Bermuda consists of a group of over 150 small coral islands in the North Atlantic Ocean, and is not, as often believed, part of the Caribbean or West Indies. A series of bridges connect the main islands which cover a total area of 52km sq."}, {"url": "http://www.formacompany.com/en/bermuda/bermuda-company-formation-fees.php", "passage_text": "Bermuda Company Incorporation-Fees. Our professional fee to establish an exempt company in Bermuda, will be £6200. The company formation procedure normally takes 5-7 days. Wehave offices in the UK, Spain and Ireland and more than 20 years experience in the incorporation of companies. Your company will be incorporated using your chosen name and we will ensure that the procedure is as simple as possible."}, {"url": "http://www.global-money.com/item.php?id=170", "passage_text": "Bermuda is not a party to any double tax agreements. LICENCE FEES. A company with an authorised capital up to US 12,000 pays the sum of US 1,680 per annum. Thereafter there is a sliding scale up to a maximum of US 25,000 on an authorised capital more than US 500 million. COMPLIANCE: AUTHORISED SHARE CAPITAL The standard authorised share capital of a Bermuda exempt company is US 12,000; divided in to 12,000 common voting shares of US 1 which is the maximum capital for the minimum capital duty payable on incorporation and annually thereafter."}, {"url": "http://www.worldservicesgroup.com/guides/Guide%20to%20Companies%20in%20Bermuda%20(February%202007).pdf", "passage_text": "A permit company may not commence its business in or from Bermuda until it has made the first payment of the annual government fee. The fee ($1,780 or, for insurers, open ended mutual funds and companies engaged in “finance business”, $3,685) becomes payable annually thereafter, on or before 31 March. "}, {"url": "http://www.offshoresimple.com/bermuda.htm", "passage_text": "AUTHORISED SHARE CAPITAL The standard authorised share capital of a Bermuda exempt company is US$ 12,000; divided in to 12,000 common voting shares of US$ 1 which is the maximum capital for the minimum capital duty payable on incorporation and annually thereafter. The minimum issued capital is US$ 1."}, {"url": "http://www.global-money.com/item.php?id=170", "passage_text": "DOUBLE TAXATION AGREEMENTS Bermuda is not a party to any double tax agreements. LICENCE FEES A company with an authorised capital up to US 12,000 pays the sum of US 1,680 per annum. Thereafter there is a sliding scale up to a maximum of US 25,000 on an authorised capital more than US 500 million. COMPLIANCE: AUTHORISED SHARE CAPITAL The standard authorised share capital of a Bermuda exempt company is US 12,000; divided in to 12,000 common voting shares of US 1 which is the maximum capital for the minimum capital duty payable on incorporation and annually thereafter."}, {"url": "https://i-incorporate.com/Bermuda.html", "passage_text": "Overview. Bermuda has always considered itself the premier offshore jurisdiction, having successfully attracted many Fortune 500 companies to its shores. Bermuda is the largest market for insurance and reinsurance after London and New York, with a gross premium volume in 1992 of over $15 billion. Bermuda companies which are owned by non-Bermudians are designated as exempted and, as such, must carry on their business outside Bermuda. Only local companies at least 60 per cent owned by Bermudians are allowed to carry on business in Bermuda."}]