[{"url": "http://electronics.howstuffworks.com/satellite-radio-comp3.htm", "passage_text": "­Sirius broadcasts satellite radio from three satellites, which were launched in 2000 from the Baikonur Cosmodrome in the Republic of Kazakhstan. The satellites orbit the Earth in an elliptical constellation, between 15,200 and 29,280 miles above the Earth's surface. Before the two companies merged, XM and Sirius went head-to-head signing radio celebrities, and the most famous -- or infamous -- of these was Howard Stern."}, {"url": "http://www.merriam-webster.com/dictionary/Sirius", "passage_text": "Definition of SIRIUS. : a star of the constellation Canis Major that is the brightest star in the heavens —called also Dog Star. See Sirius defined for kids. ADVERTISEMENT. "}, {"url": "https://en.wikipedia.org/wiki/Sirius", "passage_text": "Sirius A is about twice as massive as the Sun (M☉) and has an absolute visual magnitude of 1.42. It is 25 times more luminous than the Sun but has a significantly lower luminosity than other bright stars such as Canopus or Rigel. Sirius is one of the 27 stars on the flag of Brazil, where it represents the state of Mato Grosso. Seven ships of Great Britain's Royal Navy have been called HMS Sirius since the 18th century, with the first being the flagship of the First Fleet to Australia in 1788."}, {"url": "http://electronics.howstuffworks.com/satellite-radio-comp3.htm", "passage_text": "© Sirius XM Radio. Sirius Satellite Radio was founded in 1990, and was the first satellite radio service to get an FCC license in 1997. But because of technical problems with its satellites, its first broadcast wasn't until July 2002, nearly a year behind XM. Before the two companies merged, XM and Sirius went head-to-head signing radio celebrities, and the most famous -- or infamous -- of these was Howard Stern."}, {"url": "https://en.wikipedia.org/wiki/Sirius", "passage_text": "Sirius (/ˈsɪriəs/) is the brightest star (in fact, a star system) in the Earth's night sky. With a visual apparent magnitude of −1.46, it is almost twice as bright as Canopus, the next brightest star. Sirius is one of the 27 stars on the flag of Brazil, where it represents the state of Mato Grosso. Seven ships of Great Britain's Royal Navy have been called HMS Sirius since the 18th century, with the first being the flagship of the First Fleet to Australia in 1788."}, {"url": "https://en.wikipedia.org/wiki/Sirius_Satellite_Radio", "passage_text": "Headquartered in New York City, with smaller studios in Los Angeles and Memphis, Sirius was officially launched on July 1, 2002, and currently provides 69 streams (channels) of music and 65 streams of sports, news and entertainment to listeners. Sirius channels are identified by Nielsen Audio with the label SR (e.g. SR120, SR9, SR17). Its business model is to provide pay-for-service radio, analogous to the business model for premium cable television."}, {"url": "http://earthsky.org/brightest-stars/sirius-the-brightest-star", "passage_text": "Sirius – in the constellation Canis Major the Greater Dog – is the sky’s brightest star. It’s very easy to spot on winter and spring evenings. The brightest star visible from any part of Earth is Sirius in the constellation Canis Major the Greater Dog. Sirius is sometimes called the Dog Star. This is what Lord Indra had wanted to hear, and then he welcomed both the prince and the dog through the gates of heaven. This Hubble Space Telescope image shows Sirius A, the brightest star in our night sky, along with Sirius B, its faint, tiny stellar companion. Sirius B is the faint, tiny dot at the lower left."}, {"url": "http://www.space.com/21702-sirius-brightest-star.html", "passage_text": "View full size image. Sirius, also known as the Dog Star or Sirius A, is the brightest star in Earth's night sky. The name means glowing in Greek. With a visual magnitude of -1.46, the star is outshone only by several planets as well as the International Space Station. Because Sirius is so bright, it was well-known to the ancients. What came as a surprise to astronomers was the discovery of a companion star, Sirius B, in 1862. The companion is so much dimmer than Sirius — 10,000 times, in fact — that it wasn't until 2005 that astronomers were able to estimate its mass."}, {"url": "http://earthsky.org/brightest-stars/sirius-the-brightest-star", "passage_text": "The next brightest star (Canopus) after Sirius, and the closest major star (Alpha Centauri) are both too far south in the sky to be easily seen from mid-north latitudes. At 8.6 light-years distance, Sirius is one of the nearest stars to us after the sun. (A light year is nearly 6 trillion miles!) In fact it is the nearest star easily visible to the unaided eye from most of the northern hemisphere. This is what Lord Indra had wanted to hear, and then he welcomed both the prince and the dog through the gates of heaven. This Hubble Space Telescope image shows Sirius A, the brightest star in our night sky, along with Sirius B, its faint, tiny stellar companion. Sirius B is the faint, tiny dot at the lower left."}, {"url": "https://en.wikipedia.org/wiki/Sirius", "passage_text": "With an apparent magnitude of −1.46, Sirius is the brightest star system in the night sky, almost twice the brightness of the second brightest star, Canopus. However, it is not as bright as the Moon, Venus, or Jupiter; at times, Mercury and Mars are also brighter than Sirius. Sirius is one of the 27 stars on the flag of Brazil, where it represents the state of Mato Grosso. Seven ships of Great Britain's Royal Navy have been called HMS Sirius since the 18th century, with the first being the flagship of the First Fleet to Australia in 1788."}]