[{"url": "http://www.answers.com/Q/Which_zone_does_giant_squid_live", "passage_text": "Where do giant squids live? This has been a long standing question of scientists and the general public alike, but the natural habitat of giant squids, scientifically re … ferred to as Architeuthis dux, is believed to be mostly found in oceanic depths that reach 660 to 2300 feet or 200 to 700 meters deep. The water above the continental shelf is the neritic zone.  Underwater forest of kelp and grassy meadows of sea grass are home  to tiny fish, green turtles, sea cows, seahor … ses and tiny shrimp.  Squid live in the twilight zone level."}, {"url": "http://www.the-science-site.com/oceanic-zones.html", "passage_text": "Below the sunlit zone is the twilight zone where some light penetrates the ocean to a depth of 3000 feet. Viper fish, firefly squid, and the chambered nautilus live in this zone. The midnight zone extends from a depth of 3000 feet to the seafloor. Animals found in this zone include the giant squid, deep sea hatchetfish and bioluminescent jellyfish. Benthic zone. The benthic zone includes the entire seafloor. About 200,000 species of plants and animals live here. "}, {"url": "http://www.iknowthat.com/Expedition/DiscoverMore/ExpedDeepS/fish13.htm", "passage_text": "Hundreds of species of squid live in the world's oceans. The smallest squid is less than one inch long when full-grown. And the biggest, Architeuthis dux, can grow to 60 feet long and weigh almost a ton! Even at more common lengths of 20 to 40 feet, the giant squid is the largest invertebrate on earth. Description. Squids belong to the class of animals called cephalopods, which means, head-foot.. The animals in this group are soft-bodied, marine invertebrates with arms attached directly to their heads. Octopuses, cuttlefishes and nautiluses are head-foots too."}, {"url": "http://www.unmuseum.org/colossalsquid.htm", "passage_text": "The eight arms of the Colossal Squid also carry fixed hooks which the Giant Squid does not have. Both the Colossal Squid and the Giant Squid live in deep water, perhaps as much as 3,300 feet (1000 meters) or more beneath the surface, where there is very little light. To help them hunt their prey in the darkness at that depth they have extremely large eyes. "}, {"url": "http://ocean.si.edu/giant-squid", "passage_text": "Tsunemi Kubodera of the National Museum of Nature and Science of Japan/AP. Giant squid live up to their name: the largest giant squid ever recorded by scientists was almost 43 feet (13 meters) long, and may have weighed nearly a ton. FEEDING TENTACLES. Giant squid can snatch prey up to 33 feet (10 meters) away by shooting out their two feeding tentacles, which are tipped with hundreds of powerful sharp-toothed suckers. These feeding tentacles are very long, often doubling the total length of the giant squid on their own."}, {"url": "http://www.answers.com/Q/Which_zone_does_giant_squid_live", "passage_text": "Scientists also believe that giant squids live mainly in water regions where sperm whales are found, and giant squid specimens found washed up on the shores around the globe have led scientists to believe that giant squids are found in almost every water region of the planet that reach such depths. The water above the continental shelf is the neritic zone.  Underwater forest of kelp and grassy meadows of sea grass are home  to tiny fish, green turtles, sea cows, seahor … ses and tiny shrimp.  Squid live in the twilight zone level."}, {"url": "http://www.answers.com/Q/Which_zone_does_giant_squid_live", "passage_text": "During the day, giant squid live in the deep water. That is where they hunt deep sea fish and other squid. The water above the continental shelf is the neritic zone.  Underwater forest of kelp and grassy meadows of sea grass are home  to tiny fish, green turtles, sea cows, seahor … ses and tiny shrimp.  Squid live in the twilight zone level."}, {"url": "http://ocean.si.edu/giant-squid", "passage_text": "If you want to see a live giant squid, you have to go to where it lives. That happens to be the inky black, icy cold waters 1,650 feet (500 meters) to 3,300 feet (1,000 meters) below the ocean’s surface—not a very convenient place to watch wildlife. FEEDING TENTACLES. Giant squid can snatch prey up to 33 feet (10 meters) away by shooting out their two feeding tentacles, which are tipped with hundreds of powerful sharp-toothed suckers. These feeding tentacles are very long, often doubling the total length of the giant squid on their own."}, {"url": "http://www.iknowthat.com/Expedition/DiscoverMore/ExpedDeepS/fish13.htm", "passage_text": "The prey is then pulled into the tangle of arms and moved to the mouth. Like many other deep-sea creatures, the giant squid's skin is a dark shade of red. In the twilight zone, where the giant squid is thought to live, there is almost no sunlight. Under these conditions the color red cannot be seen, so the giant squid blends into its dark surroundings. Description. Squids belong to the class of animals called cephalopods, which means, head-foot.. The animals in this group are soft-bodied, marine invertebrates with arms attached directly to their heads. Octopuses, cuttlefishes and nautiluses are head-foots too."}, {"url": "http://www.iknowthat.com/Expedition/DiscoverMore/ExpedDeepS/fish13.htm", "passage_text": "The giant squid has a torpedo-shaped body, called the mantle. Two small fins protrude from the thinner end. At the other end is the head, with eyes as big as volleyballs, the largest of any known animal! The giant squid's mouth is equipped with a hard, sharp beak and a raspy, tongue-like organ called a radula. Description. Squids belong to the class of animals called cephalopods, which means, head-foot.. The animals in this group are soft-bodied, marine invertebrates with arms attached directly to their heads. Octopuses, cuttlefishes and nautiluses are head-foots too."}]