[{"url": "http://www.landmarkscalifornia.org/julia-morgan-life-story/", "passage_text": "Julia Morgan (1872-1957) was a prolific twentieth-century architect in California and beyond, having designed more than 700 buildings during her career. She grew up in Oakland, California and attended the University of California, Berkeley, where she earned a degree in civil engineering in 1894."}, {"url": "http://hearstcastle.org/history-behind-hearst-castle/historic-people/profiles/julia-morgan/", "passage_text": "Julia Morgan was born in San Francisco on January 20, 1872 and grew up in nearby Oakland. She was the second child of Charles Bill and Eliza Parmelee Morgan. Miss Morgan graduated with a degree in civil engineering from University of California at Berkeley.uring this time Morgan also designed the Hearst Greek Theater on the Berkeley campus. Julia Morgan opened her own architectural firm in 1904, quickly establishing herself as an outstanding residential architect, and securing a number of commissions in the Piedmont, Claremont and Berkeley neighborhoods."}, {"url": "https://en.wikipedia.org/wiki/Julia_Morgan", "passage_text": "Morgan embraced the Arts and Crafts Movement and used various producers of California pottery to adorn her buildings. Julia Morgan is the first woman to receive the AIA Gold Medal, which she received posthumously in 2013.ulia Morgan (January 20, 1872 – February 2, 1957) was an American architect in California."}, {"url": "http://articles.latimes.com/keyword/julia-morgan", "passage_text": "May 31, 1999 | From Times Staff and Wire Reports. Sara Boutelle, an architectural historian and author who rediscovered the work of Julia Morgan, the architect who designed Hearst Castle in San Simeon, and brought it to wide public notice, has died. Boutelle was 90 when she died Wednesday at a hospital in Santa Cruz."}, {"url": "http://articles.latimes.com/keyword/julia-morgan", "passage_text": "Hines credits Julia Morgan with the design of Hearst's Wyntoon, but it was designed and built (and later destroyed by fire) by Bernard Maybeck in 1902-03. Julia Morgan was 25 at the time and just returning from her European schooling.ara Boutelle, an architectural historian and author who rediscovered the work of Julia Morgan, the architect who designed Hearst Castle in San Simeon, and brought it to wide public notice, has died."}, {"url": "https://en.wikipedia.org/wiki/Julia_Morgan", "passage_text": "Julia Morgan (January 20, 1872 – February 2, 1957) was an American architect in California. She designed more than 700 buildings in California during a long and prolific career. She is best known for her work on Hearst Castle in San Simeon,"}, {"url": "http://lib.calpoly.edu/search-and-find/collections-and-archives/architectural/julia-morgan/", "passage_text": "In 1904, Julia Morgan became the first woman licensed to practice architecture in California. A successful and prolific architect during the first half of the twentieth century, Morgan was born in San Francisco in 1872 and educated at the University of California at Berkeley and L’École école Des-Beaux arts In. parisenerous donors have made several other significant gifts of Morgan materials to the Kennedy Library, including plans and sketches for residential and business commissions, and the research files of the late architectural historian, Sara Holmes Boutelle, who wrote the first book-length biography of the architect."}, {"url": "http://hearstcastle.org/history-behind-hearst-castle/historic-people/profiles/julia-morgan/", "passage_text": "Soon after her graduation from the Ecole, Julia Morgan returned to her native San Francisco and began working for architect John Galen Howard. At the time Howard was the supervising architect of the University of California’s Master Plan, the commission of which he won by default from Phoebe Apperson Hearst.uring this time Morgan also designed the Hearst Greek Theater on the Berkeley campus. Julia Morgan opened her own architectural firm in 1904, quickly establishing herself as an outstanding residential architect, and securing a number of commissions in the Piedmont, Claremont and Berkeley neighborhoods."}, {"url": "http://www.usdreams.com/Morgan22.html", "passage_text": "One of Morgan’s most famous clients was antique collector and newspaper tycoon, William Randolph Hearst. He had been introduced to Morgan by his mother, the chief patron of the University of California at Berkeley, Phoebe Apperson Hearst. In 1919, Hearst hired Morgan as the architect for Hearst Castle, or La Cuesta Encantada.er love for architecture led her to design hundreds of buildings, many in hopes of advancing women in education and careers. The Julia Morgan Ballroom located in San Francisco at the Merchants Exchange Building was named in her honor. Early Life. Morgan was born on January 20, 1872 in San Francisco, California."}]