[{"url": "http://gospain.about.com/od/spanishclimate/qt/June.htm", "passage_text": "Main article: Barcelona Weather in June. The average maximum temperature in Barcelona in June is 75°F/24°C and the average minimum temperature is 61°F/16°C. Weather in North-West Spain in June. The average maximum temperature in Santiago de Compostela in June is 66°F/19°C and the average minimum temperature is 57°F/14°C. Read more about North-West Spain."}, {"url": "http://www.holiday-weather.com/malaga/averages/june/", "passage_text": "Weather lowdown. June is usually a hot dry sunny month in Malaga. The tempering effects of the Mediterranean Sea tend to restrict the intensity of the daytime heat and prevent the showers and thunderstorms that sometimes develop inland from reaching the Costa del Sol. Roof top bar at Salles Hotel Malaga Centro, Malaga. Dates for the diary. The San Bernabe Fiesta and Summer Fair is held on the week closest to the 11th June, in nearby Marbella, which honours Marbella’s Patron Saint. It features horse and cart rides, bullfighting, food and drink, and a fair ground."}, {"url": "http://www.holiday-weather.com/malaga/averages/june/", "passage_text": "The average relative humidity is low at this time of year with a mean of 59%, and in addition, the humidity levels tend to be lowest when the weather is particularly hot, so hot weather combined with high humidity is very unusual at Malaga. Roof top bar at Salles Hotel Malaga Centro, Malaga. Dates for the diary. The San Bernabe Fiesta and Summer Fair is held on the week closest to the 11th June, in nearby Marbella, which honours Marbella’s Patron Saint. It features horse and cart rides, bullfighting, food and drink, and a fair ground."}, {"url": "http://www.worldweatheronline.com/Malaga-weather-averages/Andalucia/ES.aspx", "passage_text": "In Malaga, summer starts in June and lasts till September. During this whole season the average maximums stays in the high 20s. It climbs to an average of 27°C in the first month of the period and reach 29°C in the following months. The regular high temperature climbs to 19°C early on, up to 20°C in the following month and 23°C in the last month of the season. Night times remain cold yet suitable enough for tourists, only getting up to an average low of 11°C in May. The sun comes out for around 7 hours a day, jumping to 9 in May."}, {"url": "http://www.worldweatheronline.com/Malaga-weather-averages/Andalucia/ES.aspx", "passage_text": "Malaga weather is very pleasant all year round with sunny days for the larger part of the year. Summer weather is dry and hot with an average temperature of 30ºC, but due to low humidity the heat is not uncomfortable. The regular high temperature climbs to 19°C early on, up to 20°C in the following month and 23°C in the last month of the season. Night times remain cold yet suitable enough for tourists, only getting up to an average low of 11°C in May. The sun comes out for around 7 hours a day, jumping to 9 in May."}, {"url": "http://www.holiday-weather.com/malaga/averages/", "passage_text": "Malaga: Annual Weather Averages. July is the hottest month in Malaga with an average temperature of 25°C (77°F) and the coldest is January at 13°C (55°F) with the most daily sunshine hours at 11.1 in July. The wettest month is November with an average of 101mm of rain. The best month to swim in the sea is in August when the average sea temperature is 28°C (82°F)."}, {"url": "http://www.holiday-weather.com/malaga/averages/june/", "passage_text": "An average June has just 12mm of precipitation and 2 days with measurable precipitation, and on the very rare occasions that it does rain, the rain is usually heavy, thundery and over with very quickly, so should not cause significant disturbance to a holiday. Roof top bar at Salles Hotel Malaga Centro, Malaga. Dates for the diary. The San Bernabe Fiesta and Summer Fair is held on the week closest to the 11th June, in nearby Marbella, which honours Marbella’s Patron Saint. It features horse and cart rides, bullfighting, food and drink, and a fair ground."}, {"url": "http://gospain.about.com/od/spanishclimate/qt/June.htm", "passage_text": "The average maximum temperature in Bilbao in June is 72°F/22°C and the average minimum temperature is 57°F/14°C. The average maximum temperature in Santiago de Compostela in June is 66°F/19°C and the average minimum temperature is 57°F/14°C. Weather in North-West Spain in June. The average maximum temperature in Santiago de Compostela in June is 66°F/19°C and the average minimum temperature is 57°F/14°C. Read more about North-West Spain."}, {"url": "https://weatherspark.com/averages/32043/Malaga-Andalucia-Spain", "passage_text": "The warm season lasts from June 18 to September 16 with an average daily high temperature above 82A°82â. F the hottest day of the year Is august, 1 with an average high OF°87a 87â f and LOW°Of. 70a 70â f the cold Season lasts from November 19 to march 20 with an average daily HIGH°Temperature. below 66a 66â f The average fraction of time spent in various temperature bands: frigid (below 15A°15â), f (FREEZING°15a 15â F°To), 32a (32â°F cold 32A°32â), f (TO°50a 50â F°Cool), 50a (50â°F to 65A°65â), f (COMFORTABLE°65a 65â F°To), 75a (75â°F warm 75A°75â) f to (85a 85â°F). hot 85a 85â f to 100a 100â f and sweltering above"}]