[{"url": "https://answers.yahoo.com/question/index?qid=20080519061354AAXeBuX", "passage_text": "Report Abuse. The hemoglobin level is expressed as the amount of hemoglobin in grams (gm) per deciliter (dl) of whole blood, a deciliter being 100 milliliters. The normal ranges for hemoglobin depend on the age and, beginning in adolescence, the sex of the person. Best Answer: What are normal hemoglobin values? The hemoglobin level is expressed as the amount of hemoglobin in grams (gm) per deciliter (dl) of whole blood, a deciliter being 100 milliliters."}, {"url": "http://www.mayoclinic.org/tests-procedures/hemoglobin-test/basics/results/PRC-20015022", "passage_text": "The normal range for hemoglobin is: 1  For men, 13.5 to 17.5 grams per deciliter. 2  For women, 12.0 to 15.5 grams per deciliter. "}, {"url": "http://www.livestrong.com/article/407472-what-is-a-healthy-hemoglobin-level/", "passage_text": "Hemoglobin Levels for Children. Children need optimal oxygenation for normal growth and development. According to the World Health Organization, a normal hemoglobin level for children age 6 months to 4 years is at or above 11 g/dL. A normal levels for children ages 5 to 12 years is at or above 11.5 g/dL. A normal level for adolescents ages 12 to 15 is at or above 12.0 g/dL. Any hemoglobin values below these cut-points can indicate anemia, a disorder characterized by a low red blood cell count, as well as low hemoglobin and hemocrit. A normal level for a non-pregnant adult woman is between 12.1 and 15.1 g/dL. Men have higher hemoglobin levels than women because women lose red bloods each month during menstruation. A normal level for a pregnant woman is at or above 11.0 g/dL."}, {"url": "http://www.livestrong.com/article/438953-normal-iron-level-for-a-woman/", "passage_text": "Normal Levels. Normal hemoglobin levels for women range from 12 to 15.5 g of hemoglobin per deciliter of blood. Hemoglobin levels below 12 g/dL for non-pregnant women and 11 g/dL for pregnant women are a sign of iron deficiency, according to the National Anemia Action Council. "}, {"url": "http://www.answers.com/Q/What_is_the_normal_range_for_hemoglobin", "passage_text": "The normal range of hemoglobin (also haemoglobin) varies in men, women, and children. The normal range of hemoglobin in male is 13.5 to 18gm/dl (gram per deciliter). For female it is 12 to 16gm/dl (gram per deciliter). In a children 11 to 16gm/dl (gram per deciliter). And for a pregnant woman 11 to 12g/dl (gram per deciliter) is the normal range of hemoglobin. If the hemoglobin is below normal, this is called anemia."}, {"url": "https://www.blood.ca/en/blood/hemoglobin", "passage_text": "Normal hemoglobin levels are different in women and in men. In non-pregnant women, normal hemoglobin ranges from 120 g/L to 160 g/L. In men, normal hemoglobin levels range from 140 g/L to 180 g/L. Canadian Blood Services tests each donor’s hemoglobin at the clinic and requires a minimum of 125 g/L for donation."}, {"url": "http://answers.webmd.com/answers/1171291/what-are-normal-hemoglobin-values", "passage_text": "A. The hemoglobin level is expressed as the amount of hemoglobin in grams (gm) per deciliter (dL) of whole blood, a deciliter being 100 milliliters. The normal ranges for hemoglobin depend on the age and, beginning in adolescence, the gender of the person. The normal ranges are: 1  Newborns: 17-22 gm/dL"}, {"url": "http://www.mayoclinic.org/diseases-conditions/iron-deficiency-anemia/basics/tests-diagnosis/CON-20019327", "passage_text": "1 Lower than normal hemoglobin levels indicate anemia. 2  The normal hemoglobin range is generally defined as 13.5 to 17.5 grams (g) of hemoglobin per deciliter (dL) of blood for men and 12.0 to 15.5 g/dL for women. 3  The normal ranges for children vary depending on the child's age and sex. 4  Ferritin. 1 Hemoglobin. 2  Lower than normal hemoglobin levels indicate anemia. 3  The normal hemoglobin range is generally defined as 13.5 to 17.5 grams (g) of hemoglobin per deciliter (dL) of blood for men and 12.0 to 15.5 g/dL for women. 4  The normal ranges for children vary depending on the child's age and sex. 5  Ferritin."}]