[{"url": "http://www.thinkbabynames.com/names/1/pure", "passage_text": "Pure Names. These boy names were at the height of their popularity in the year 2012 (usage of 0.1451%) and have remained as popular to this day (usage 0.1412%, down 2.7%), but with names like Candido, Augustine and Malcolm becoming less stylish. .. from connla meaning  pure, chaste, sensible .. Common as surname. Compare Conley (upper 1%) with common last name Condee (upper 97%) , which also begins with Co- . See also Corley."}, {"url": "http://www.thinkbabynames.com/names/0/virgin", "passage_text": "Virgin baby names and what they mean, for virgin, pure, perfect, purity. Adara-Cady. Page 1/6 of 113 Virgin names. Adara 1 .. Based on Arabic, Greek, Hebrew languages.  Virgin; beauty; noble.. Not Top 1000 names. [ Adra, .. 1 more ]. Adra 2 .. Based on Arabic word.  Virgin .. Adraai, Adraau and Auadra are kreatif variations."}, {"url": "http://www.thinkbabynames.com/names/0/virgin", "passage_text": "Baby Names associated with Virgin for Girls. Adoption of these girl names was at its highest during the years 1940-1949 (usage of 0.2562%) and is somewhat lower today (usage 0.136%, 46.9% less), with names such as Kaitlin, Mercedes, Asia, Karen and Luz becoming somewhat outmoded. Adara-Cady. Page 1/6 of 113 Virgin names. Adara 1 .. Based on Arabic, Greek, Hebrew languages.  Virgin; beauty; noble.. Not Top 1000 names. [ Adra, .. 1 more ]. Adra 2 .. Based on Arabic word.  Virgin .. Adraai, Adraau and Auadra are kreatif variations."}, {"url": "http://www.behindthename.com/names/meaning/pure", "passage_text": "Latinized form of the Greek name φοιβη (Phoibe) , which meant bright, pure from Greek φοιβος (phoibos) ... [more]. PHOEBUS m Greek Mythology (Latinized). Latinized form of the Greek name φοιβος (Phoibos) , which meant bright, pure ... "}, {"url": "http://www.thinkbabynames.com/names/1/pure", "passage_text": "Pure names and what they mean, for pure, chaste, perfect, virgin, true. Here is the list of Virgin names for girls. .. from connla meaning  pure, chaste, sensible .. Common as surname. Compare Conley (upper 1%) with common last name Condee (upper 97%) , which also begins with Co- . See also Corley."}, {"url": "http://www.babynamespedia.com/search/f/pure", "passage_text": "There are 65 Pure names for baby girls. Pure names are somewhat popular as baby girl names. Their usage peaked in 1956 with 2.208% of baby girls being given Pure names. Within the top 1000 baby names then, there were 5 Pure names. The names have substantially slipped in popularity since then, and are currently of modest use. In 2012, their total usage was only 0.154% with 3 Pure names listed among the top 1000"}, {"url": "http://scbsfm.blogspot.com/2010/09/baby-names-meaning-pure.html", "passage_text": "Baby Names Meaning PURE. Label: Names Meaning. F ind out list of baby names which mean  PURE . These names for males and females originated from Welsh, Irish, German, English, Persian, Spanish, Greek, American, Biblical, African, Slavic, Polish and Indian background. - AGNES: Greek female name meaning Pure. - BRONWEN: Welsh female name meaning Dark, Pure."}]