[{"url": "http://www.medscape.com/medline/abstract/9292042", "passage_text": "The most common neuropathological findings in SLE are a small vessel cerebral vasculopathy and microinfarcts. "}, {"url": "http://stroke.ahajournals.org/content/40/12/e675.full", "passage_text": "Cerebral amyloid angiopathy (CAA) is a small to medium vasculopathy involving deposition of β-amyloid within the vessel wall of the brain and the leptomeninges. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Vasculopathies", "passage_text": "inflammation of the blood vessels. It may be caused by a systemic disease or an allergic reaction. Kinds of vasculitis are allergic vasculitis, necrotizing vasculitis, and segmented hyalinizing vasculitis. See also angiitis. Symptoms of vasculitis depend on the severity of the inflammation and the organ system or systems affected. Some types of vasculitis are so mild that the only symptoms noted are small reddish-purple dots (called petechiae) on the skin due to tiny amounts of blood seeping out of leaky"}, {"url": "http://ghr.nlm.nih.gov/condition/col4a1-related-brain-small-vessel-disease", "passage_text": "COL4A1 -related brain small-vessel disease is part of a group of conditions called the COL4A1 -related disorders. The conditions in this group have a range of signs and symptoms that involve fragile blood vessels. COL4A1 -related brain small-vessel disease is characterized by weakening of the blood vessels in the brain. Stroke is often the first symptom of this condition, typically occurring in mid-adulthood. The COL4A1 gene mutations that cause COL4A1 -related brain small-vessel disease result in the production of a protein that disrupts the structure of type IV collagen. As a result, type IV collagen molecules cannot attach to each other to form the protein networks in basement membranes."}, {"url": "http://www.ehow.com/about_4740835_small-vessel-ischemic-disease.html", "passage_text": "The area of the brain that is affected by small vessel ischemic disease is where the brain cells and the neurons are connected. The tiny vessels that bring blood flow to that area are called small vessels, while large vessels bring blood flow to large organs including the heart, kidneys and lungs. Small vessel ischemic disease is actually a byproduct of other diseases and the impact that those diseases have on the brain's white matter. Unlike a disease of the brain itself, it is what happens to the brain during the progression of certain chronic conditions including diabetes and high blood pressure."}, {"url": "http://medical-dictionary.thefreedictionary.com/Vasculopathies", "passage_text": "When it is found in small blood vessels in the skin, characteristic rashes may be seen. Vasculitis is loosely classified by the size of the vessel involved. Takayasu and giant cell arteritis involve large arteries, including the aorta and carotids. Symptoms of vasculitis depend on the severity of the inflammation and the organ system or systems affected. Some types of vasculitis are so mild that the only symptoms noted are small reddish-purple dots (called petechiae) on the skin due to tiny amounts of blood seeping out of leaky blood vessels."}, {"url": "http://medical-dictionary.thefreedictionary.com/Vasculopathies", "passage_text": "Inflammation of the glomerular capillaries of the kidney in small vessel vasculitis may produce glomerulonephritis and decreased renal function. When blood vessels of the respiratory tract are involved, pneumonitis, sinusitis, and ulceration of the nasopharynx may result. Symptoms of vasculitis depend on the severity of the inflammation and the organ system or systems affected. Some types of vasculitis are so mild that the only symptoms noted are small reddish-purple dots (called petechiae) on the skin due to tiny amounts of blood seeping out of leaky blood vessels."}, {"url": "http://www.ehow.com/about_4740835_small-vessel-ischemic-disease.html", "passage_text": "Vessels. Small vessel ishemic disease is also called white matter disease and refers to a finding on an MRI or a Cat Scan. Small vessel ischemic disease is actually a byproduct of other diseases and the impact that those diseases have on the brain's white matter. Unlike a disease of the brain itself, it is what happens to the brain during the progression of certain chronic conditions including diabetes and high blood pressure."}, {"url": "http://medical-dictionary.thefreedictionary.com/Vasculopathies", "passage_text": "Vasculitis refers to a varied group of disorders which all share a common underlying problem of inflammation of a blood vessel or blood vessels. The inflammation may affect any size blood vessel, anywhere in the body. It may affect either arteries and/or veins. Symptoms of vasculitis depend on the severity of the inflammation and the organ system or systems affected. Some types of vasculitis are so mild that the only symptoms noted are small reddish-purple dots (called petechiae) on the skin due to tiny amounts of blood seeping out of leaky"}, {"url": "http://www.netwellness.org/healthtopics/brainattack/svidmri.cfm", "passage_text": "When blood flow to the brain is suddenly stopped, this is a stroke. A stroke is accompanied by clinical symptoms such as weakness on one side, slurred speech, visual problems, or problems with thinking or language. For example, a MRI report might mention left sided brain changes that suggest the appearance of a stroke. "}]