[{"url": "http://www.friedli.com/research/PhD/chapter5a.html", "passage_text": "The word albumin is also used to describe a protein or a group of proteins defined by solubility in water for example the albumin fraction of wheat (chapter 2). Albumin is the most abundant protein in the circulatory system and contributes 80% to colloid osmotic blood pressure (Carter and Ho, 1994). The BSA molecule is made up of three homologous domains (I, II, III) which are divided into nine loops (L1-L9) by 17 disulphide bonds. The loops in each domain are made up of a sequence of large-small-large loops forming a triplet. Each domain in turn is the product of two subdomains (IA, IB, etc.)."}, {"url": "https://en.wikipedia.org/wiki/Biotinylation", "passage_text": "(December 2009). In biochemistry, biotinylation is the process of covalently attaching biotin to a protein, nucleic acid or other molecule. Biotinylation is rapid, specific and is unlikely to perturb the natural function of the molecule due to the small size of biotin (MW = 244.31 g/mol). As the biotin binding pocket in avidin / streptavidin is buried beneath the protein surface, biotinylation reagents possessing a longer linker are desirable, as they enable the biotin molecule to be more accessible to binding avidin/streptavidin/Neutravidin protein."}, {"url": "https://en.wikipedia.org/wiki/Bovine_serum_albumin", "passage_text": "For the family of mammalian albumins, see serum albumin. Bovine serum albumin (also known as BSA or Fraction V) is a serum albumin protein derived from cows. It is often used as a protein concentration standard in lab experiments. It is also used as a nutrient in cell and microbial culture. In restriction digests, BSA is used to stabilize some enzymes during digestion of DNA and to prevent adhesion of the enzyme to reaction tubes, pipet tips, and other vessels."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0167732214002566", "passage_text": "In addition, an intermediate frequency process between these two is also resolved. However, its assignment to tightly bound hydrated water molecules is not yet very clear [10] . In this study, we investigated spatial correlations and molecular dynamics of bovine serum albumin (BSA) in solution. BSA is the most abundant plasma protein in bovine's blood stream. "}, {"url": "http://www.friedli.com/research/PhD/chapter5a.html", "passage_text": "The albumin molecule is not uniformly charged within the primary structure. At neutral pH, Peters (1985) calculated a net charge of -10, -8, and 0 for domains I, II, and III for bovine serum albumin. The BSA molecule is made up of three homologous domains (I, II, III) which are divided into nine loops (L1-L9) by 17 disulphide bonds. The loops in each domain are made up of a sequence of large-small-large loops forming a triplet. Each domain in turn is the product of two subdomains (IA, IB, etc.)."}, {"url": "http://www.sigmaaldrich.com/life-science/biochemicals/biochemical-products.html?TablePage=103994915", "passage_text": "Bovine serum albumin (BSA) is a globular protein (~66,000 Da) that is used in numerous biochemical applications due to its stability and lack of interference within biological reactions. Sigma provides a variety of Bovine serum albumins with purities ranging from 95-99%. Sigma-Aldrich manufactures and distributes bovine serum albumins purified from a variety of primary methods including the true Cohn fractionation method, modified ethanol fractionation methods, heat shock and chromatography."}, {"url": "http://www.friedli.com/research/PhD/chapter5a.html", "passage_text": "Serum albumin is one of the most widely studied proteins and is the most abundant protein in plasma with a typical concentration of 5g/100ml. The BSA molecule is made up of three homologous domains (I, II, III) which are divided into nine loops (L1-L9) by 17 disulphide bonds. The loops in each domain are made up of a sequence of large-small-large loops forming a triplet. Each domain in turn is the product of two subdomains (IA, IB, etc.)."}]