[{"url": "http://www.answers.com/Q/Where_does_your_stomach_start_getting_hard_at_during_pregnancy", "passage_text": "Your stomach will begin to get hard during your fifth month in pregnancy. Your belly gets hard when the skin stretches. This can cause markings so usea lot of lotion during th … is time. when your about three to four months. Confidence votes 12.5K. The hard part that is felt in the abdomen during pregnancy is the uterus. Early in pregnancy this will be within the pelvis. You may be able to feel it near the top of your pelvic bone. You may be able to feel your uterus at the very bottom of your belly when you are about 15-16 weeks pregnant"}, {"url": "http://www.pregnancy-baby-care.com/conditions-during-pregnancy/hard-belly-during-pregnancy.html", "passage_text": "Hard Stomach, Tummy Early Pregnancy. As soon as you complete 30 weeks of your pregnancy, don't be surprised if you get a hard feeling around your belly area. Hard stomach during pregnancy is very common and this happens because of the growing uterus. Stomach Hardening During Pregnancy. While you are in the second trimester of your pregnancy, your uterus has already traveled half-way and is now between your pubic bone and belly button. Also, your little one is growing inside your uterus causing it to swell to make more space for your baby to grow."}, {"url": "http://www.pregnancy-baby-care.com/conditions-during-pregnancy/hard-belly-during-pregnancy.html", "passage_text": "1 Hard Stomach In Pregnancy As you make progress through the stages of your pregnancy, there are various changes that 2  ... 40 Weeks Pregnant Belly At 40 weeks of pregnancy delivery is just around the corner. 3  The baby at 40 weeks weighs ... Stomach Hardening During Pregnancy. While you are in the second trimester of your pregnancy, your uterus has already traveled half-way and is now between your pubic bone and belly button. Also, your little one is growing inside your uterus causing it to swell to make more space for your baby to grow."}, {"url": "http://www.pregnancyandchildcare.org/hard-stomach-during-pregnancy", "passage_text": "Hard stomach during pregnancy is quite a normal thing that happens to most women. Excessive hardness is often a result of unnecessary stress in a pregnant woman. So, do not get worried if you are also one among suffering from hard stomach during pregnancy. Here are some of the causes for hard stomach during pregnancy: 1  Hardening of the abdomen during the 21st week is quite common because the growing uterus applies immense pressure on the stomach walls, which in turn results in a feeling of hardiness."}, {"url": "http://www.boldsky.com/pregnancy-parenting/prenatal/2014/do-you-have-a-hard-belly-during-pregnancy-049035.html", "passage_text": "With each passing day, the hardness of the stomach becomes quite normal. This condition occurs for most pregnant women. There is nothing to worry about as pregnant woman will have a hard belly during pregnancy. Don't feel surprised if you get a hard feeling around your belly as this is due to the growing uterus. For some, this condition can be as early as after the completion of 12 weeks of pregnancy. Yet this hard belly during pregnancy depends on the body type of the person. Hard belly during pregnancy can be different for various body types. Predominantly, women who are thin experience hard stomach in the early days of pregnancy, while fat women would experience hardness in the third trimester."}, {"url": "http://www.babycenter.com/400_is-my-belly-supposed-to-be-hard-or-soft-during-pregancy-i-am_7791786_363.bc", "passage_text": "Yes | No Thank you! Not everyones belly is hard during pregnancy sometimes it depends on how big the baby is &nd some times it just don't get hard my first kid wasn't hard and she came out perfect but if you feel like something is wrong go see your doctor ! posted 08/01/2013 by a BabyCenter Member. Report answer. "}, {"url": "http://www.answers.com/Q/When_does_your_stomach_get_hard_during_pregnancy", "passage_text": "The hard part that is felt in the abdomen during pregnancy is  the uterus. Early in pregnancy this will be within the pelvis. You  may be able to feel it near the top of you … r pelvic bone.  You may be able to feel your uterus at the very bottom of your  belly when you are about 15-16 weeks pregnant. Your stomach will begin to get hard during your fifth month in pregnancy. Your belly gets hard when the skin stretches. This can cause markings so usea lot of lotion during this time"}]