[{"url": "http://www.fuzeqna.com/orangecountys/ext/kb1505-wire-routing-domestic-international-swift-sort-code-iban-aba-rtn-fedwire-information-about-swift", "passage_text": "(Routing Number, RTN). An ABA, or American Bankers Association, number is a nine digit bank code used in the United States. The routing number for Orange County's Credit Union is 322281989. Orange County's Credit Union does not have a SWIFT code. What is a SORT code? A sort code is a number which is assigned to a branch of a bank for internal purposes. They are typically 6 digits in the format ##-##-## and most commonly used by banks in the UK. Orange County's Credit Union does not have a SORT code"}, {"url": "http://www.differencebetween.net/business/finance-business-2/difference-between-aba-number-and-routing-number/", "passage_text": "Another code is a nine-digit number called Routing Transit Number (RTN) or, simply, Routing Number. Like the ABA Transit Number, its purpose it to make it easy for banks to accurately sort and identify he financial institution on which a check is drawn. It can be seen on the bottom part of checks. Composition-wise, the RTN is a combination of the bank identifier code and the Federal Reserve Bank identifier code as shown in the ABA Transit Number."}, {"url": "https://en.wikipedia.org/wiki/Routing_transit_number", "passage_text": "The first two digits of the nine digit RTN must be in the ranges 00 through 12, 21 through 32, 61 through 72, or 80. The digits are assigned as follows: 1  00 is used by the United States Government. 2  01 through 12 are the normal routing numbers, and correspond to the 12 Federal Reserve Banks. They are used on paper checks, wire transfers, and ACH transactions. On a paper check, the ABA RTN is usually the middle set of nine numbers printed at the bottom of the check. Domestic transfers that use the ABA RTN will usually be returned to the paying bank."}, {"url": "http://us-routing-numbers.com/", "passage_text": "A routing number is a nine-digit numeric code printed on the bottom of checks that is used to facilitate the electronic routing of funds (ACH transfer) from one bank account to another. It's also referred to as RTN, routing transit number or bank routing number. Read more. "}, {"url": "http://bankinfos.org/", "passage_text": "Routing transit numbers. A routing transit number also known as RTN is a 9 digit bank code, which is used in the United States. Routing number can be found on the bottom of checks identifying the financial institution on which it was drawn. This code was developed to facilitate the sorting and shipment of paper checks back to the payor's (check-writer's) account. The Federal Reserve Banks FedACH Services ensure an effective, inexpensive batch payment service, which allows the electronic exchange of debit and credit transactions among business and consumer accounts at depository financial institutions."}, {"url": "https://www.ecsi.net/help/help_bcgi16_check.html", "passage_text": "An ABA number (also known as routing number or routing transfer number) is a sequence of nine numeric characters used by banks to identify specific financial institutions within the United States. An ABA number is used for wires and electronic automatic clearing house (ACH) transactions such as electronic funds transfer, direct deposit, direct payment of consumer bills, e-checks, and tax payments, among others."}, {"url": "http://www.suncorpbank.com.au/faq/what-fedwire-aba-code", "passage_text": "A Fedwire (or ABA) code is a bank code used in the United States, which identifies financial institutions. "}, {"url": "https://en.wikipedia.org/wiki/Routing_transit_number", "passage_text": "There are approximately 26,895 active ABA RTNs currently in use. Every financial institution in the United States has at least one. The Routing Number Policy allows for up to five ABA RTNs to be assigned to a financial institution. Many institutions have more than five ABA RTNs as a result of mergers. ABA RTNs are only for use in payment transactions within the United States. They are used on paper checks, wire transfers, and ACH transactions. On a paper check, the ABA RTN is usually the middle set of nine numbers printed at the bottom of the check. Domestic transfers that use the ABA RTN will usually be returned to the paying bank."}, {"url": "https://en.wikipedia.org/wiki/Routing_transit_number", "passage_text": "An ABA routing transit number (ABA RTN) is a nine digit code, used in the United States, which appears on the bottom of negotiable instruments such as checks to identify the financial institution on which it was drawn. They are used on paper checks, wire transfers, and ACH transactions. On a paper check, the ABA RTN is usually the middle set of nine numbers printed at the bottom of the check. Domestic transfers that use the ABA RTN will usually be returned to the paying bank."}]