[{"url": "http://razure-energyhealing.com/reiki-healing/what-is-reiki-used-for/", "passage_text": "Reiki used for stress and depression related conditions. Reiki is used to provide that extra help and provides a boost for the body, allowing it to begin the process of wellness. It is specifically used for a number of conditions and ailments to include: 1  Headaches – releasing tension and blood flow. 2  Fatigue – providing an energy boost. Reiki used to accelerate body natural healing. Chakras and the Glands. Glands are also responsible for organ growth and repair. Each of the seven chakras (labelled in the diagram) are situated directly over our 7 glands, providing them with life force or Ki energy."}, {"url": "http://razure-energyhealing.com/reiki-healing/what-is-reiki-used-for/", "passage_text": "“Reiki is used to give the body an energy boost via our glands and for depression and stress release”. Reiki is used for a range of physical, emotional and mental imbalances but we are going to look at it from a physical perspective. Each of our glands (shown in the diagram) has a specific purpose. Reiki used to accelerate body natural healing. Chakras and the Glands. Glands are also responsible for organ growth and repair. Each of the seven chakras (labelled in the diagram) are situated directly over our 7 glands, providing them with life force or Ki energy."}, {"url": "http://healing.about.com/cs/reiki/a/reikiplex.htm", "passage_text": "Reiki (pronounced Ray Key) is a combination of two Japanese words rei and ki meaning universal life energy. Reiki is an ancient laying-on of hands healing technique that uses the life force energy to heal, balancing the subtle energies within our bodies. Reiki addresses physical, emotional, mental and spiritual imbalances. This healing art is an effective delivery system"}, {"url": "http://www.livescience.com/40275-reiki.html", "passage_text": "View full size image. Reiki is a therapy often described as palm healing or hands-on-body healing in which a practitioner places hands lightly on or over a patient's body to facilitate the patient's process of healing. Reiki combines the Japanese and Chinese word-characters of rei (spiritual or supernatural) and ki (vital energy). "}, {"url": "http://www.webmd.com/pain-management/tc/reiki-topic-overview", "passage_text": "Reiki means universal life energy and is an ancient healing method that manipulates energy flow in the body. Reiki practitioners believe there is an energy force in and around the body. They believe that there is a flow of energy between the reiki practitioner and the receiver of the treatment. It is thought that reiki releases energy flows and allows the body's own natural healing ability to work. Reiki focuses on seven main energy centers, called chakras, in your body. People use reiki to decrease pain, ease muscle tension, speed healing, and improve sleep. Reiki is sometimes used to help people who suffer from pain or discomfort from cancer or other diseases. But reiki is not used as a treatment for cancer or any other disease."}, {"url": "http://iarp.org/what-is-reiki/", "passage_text": "Reiki is a spiritual healing art with its roots in Japanese origin. The word Reiki comes from the Japanese word (Rei) which means “Universal Life” and (Ki) which means “Energy”. Reiki is not affiliated with any particular religion or religious practice. It is not massage nor is it based on belief or suggestion. "}, {"url": "http://reiki.nu/reiki/reiki.html", "passage_text": "Reiki is a form of spiritual healing using universal life energy channelled through the practitioner to the recipient. Reiki helps to harmonize body, mind and spirit for yourself or anyone you want to help. Reiki treatment You relax, fully clothed, on a couch or seated while the healer holds his hands on or above you. "}, {"url": "https://en.wikipedia.org/wiki/Reiki", "passage_text": "Reiki (/ˈreɪkiː/) is a form of alternative medicine developed in 1922 by Japanese Buddhist Mikao Usui. Since its beginning in Japan, Reiki has been adapted across varying cultural traditions. It uses a technique commonly called palm healing or hands-on-healing. Through the use of this technique, practitioners believe that they are transferring universal energy through the palms of the practitioner, which they believe encourages healing. Reiki is considered pseudoscience. The English reiki or Reiki is a Japanese loanword. Reiki (霊気, meaning spirit or mysterious atmosphere, miraculous sign), in turn, is a Chinese loanword lingqi (língqì, 靈氣 numinous). Atmosphere the earliest Recorded english usage dates to. 1975"}, {"url": "http://www.reiki.org/faq/WhatIsReiki.html", "passage_text": "A Brief Overview. Reiki is a Japanese technique for stress reduction and relaxation that also promotes healing. It is administered by laying on hands and is based on the idea that an unseen life force energy flows through us and is what causes us to be alive. While Reiki is not a religion, it is still important to live and act in a way that promotes harmony with others. Mikao Usui, the founder of the Reiki system of natural healing, recommended that one practice certain simple ethical ideals to promote peace and harmony, which are nearly universal across all cultures."}, {"url": "http://www.takingcharge.csh.umn.edu/explore-healing-practices/reiki", "passage_text": "Reiki is a spiritual, vibrational healing practice used to promote balance throughout the human system. Reiki does not involve physical manipulation or the ingestion or application of any substances, but works with the subtle vibrational field thought to surround and penetrate the body. "}]