[{"url": "http://www.simplyhired.com/salaries-k-merchant-marine-jobs.html", "passage_text": "The average salary for merchant marine jobs is $45,000. Average merchant marine salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term merchant marine anywhere in the job listing."}, {"url": "https://www.recruiter.com/salaries/sailors-and-marine-oilers-salary/", "passage_text": "Sailors and Marine Oilers are compensated highest in Washington, where they can get average pay scales of approximating $45560. People who work inside these careers obtain the highest pay in Mining, Quarrying, and Oil and Gas Extraction, which has an average salary rate of $51310. Sailors and marine oilers keep watch and make sure there are no obstructions in the path of their ship. They may also measure water depth, rig or perform a variety of maintenance tasks or other related work. These positions usually require a high school diploma or GED or above."}, {"url": "http://www.answers.com/Q/What_is_the_average_salary_of_a_merchant_marine", "passage_text": "In the U.S. Merchant Marine, a high paying union containership can expect to see the following rates for a 4-month voyage: Ordinary Seaman/Wiper/Messman: $5,000 per month Able … Seaman/Oiler: $8,000 a month Bosun: $9,500 a month 3rd Mate/3rd Asst. 1 Gone are the days in which you would pay for your goods with cash, check, or cre…. 2  The U.S. Merchant Marine Academy Opened in 1943, the United States Merchant Marine Academy (MMA) is one of the five United States service academies. 3  It's mission is to train officers for the United States Me…."}, {"url": "http://www.answers.com/Q/What_is_the_average_salary_of_a_merchant_marine", "passage_text": "A merchant mariner does not have a set rate and their salaries  reflect the individuals experience. Younger less experienced  mariners makes approximately $33,000 while seni … or mariners can  reach well over six figures. 1 Gone are the days in which you would pay for your goods with cash, check, or cre…. 2  The U.S. Merchant Marine Academy Opened in 1943, the United States Merchant Marine Academy (MMA) is one of the five United States service academies. 3  It's mission is to train officers for the United States Me…."}, {"url": "https://answers.yahoo.com/question/index?qid=20100121014604AAI1StN", "passage_text": "Rating Newest Oldest. Best Answer: A DECK HAND... which is where everyone begins, will make about $125 a day.. maybe a bit more and maybe a bit less. After a YEAR during which you have to build up 365 ON THE WATER DAYS, you can take the test to become an ABLE BODIED SEAMAN and you will earn about $200 per day. After that it's a matter of BUILDING UP SEA TIME and TAKING TESTS. If you work hard and spend all your time on the water you can work your way up to CAPTAIN in about 10 YEARS..and for a basic 1600 ton license you can make about $350 per day. If you hope to work on the water you will HAVE to join the Seaman's Union.."}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/merchantnavydeckofficer.aspx", "passage_text": "Income. Your salary as a merchant navy deck officer will depend on the rank you hold and the type of ship you work on. Starting salaries for trainees in their final year of training start at around £20,000 a year. As a qualified third or second officer you may earn up to £42,000 a year depending on your rank. "}, {"url": "http://www.ehow.com/info_8633294_salary-merchant-seaman.html", "passage_text": "The average annual salary of sailors and marine oilers in 2010 was $38,030. The bottom 10 percent of these merchant seamen had an average annual salary of $22,320, and the bottom fourth had an average annual salary of $28,100. The middle half of sailors and marine oilers earned salaries averaging $36,260. The middle half of these merchant seamen earned an average of $64,180 per year. The top quarter had annual salaries of $91,750 per year and the average salary of the top 10 percent was $117,310 per year. The average annual salary of engineers in the merchant marine was $70,920 per year in 2010. The bottom 10 percent of these merchant seamen made an average salary of $38,170 per year, and the bottom fourth made $48,160 per year on average. The middle half of ship engineers earned salaries averaging $65,880 per year"}, {"url": "http://www.ehow.com/about_5032899_average-salary-merchant-marines.html", "passage_text": "Merchant Marine Average Salary. The average salary for the merchant marine is $45,000 as of 2014, according to the SimplyHired careers website, which also puts the 2014 average salary for a merchant marine captain, the master of the ship, at about $46,000. According to the U.S. Department of Transportation, the nation's merchant marine consists of privately owned, U.S. registered merchant ships. Employment within the merchant marine of the U.S. is handled by the owners of the various ships and other watercraft making up the fleet."}, {"url": "http://work.chron.com/much-rookie-merchant-marine-make-24699.html", "passage_text": "Pay aboard ships is based on a daily rate, however, and may include overtime as part of labor agreement. The daily rate for an ordinary seaman, as of August 2013, is $170 per day, or $4,760 for a 28-day tour of duty. For a wiper, the day rate is slightly higher at $205 per day or $5,740 for 28 days. As a rookie merchant mariner, your Merchant Mariner Credential says you’re an “Ordinary Seafarer, Wiper, Steward Department (F.H.).” You might work on deck, where you’ll chip rust, paint and clean up."}]