[{"url": "http://www.mayoclinic.org/diseases-conditions/swollen-lymph-nodes/basics/definition/CON-20029652", "passage_text": "Swollen lymph nodes. Swollen lymph nodes usually occur as a result of exposure to bacteria or viruses. When swollen lymph nodes are caused by an infection, this is known as lymphadenitis (lim-fad-uh-NIE-tis). Rarely, swollen lymph nodes are caused by cancer. Your lymph nodes, also called lymph glands, play a vital role in your body's ability to fight off viruses, bacteria and other causes of illnesses. Common areas where you might notice swollen lymph nodes include your neck, under your chin, in your armpits and in your groin."}, {"url": "http://www.answers.com/Q/What_is_the_medical_term_meaning_any_disease_of_the_lymph_nodes", "passage_text": "The sugar that collects in the coffee filter is similar to the white blood cells and lymphatic debris that collect in the lymph nodes, which is what causes the inflammation. The state is called lymphadenopathy - meaning basically disease of the lymph node(s). Adrenopathy is any disease of the adrenal glands. One example is  Addison disease, which may lead to a drop in blood sodium and blood  glucose, and increase in blood potassi … um levels, dehydration, and  weight loss. Pheochromocytoma is a tumor of adrenal gland that  produces excessive adrenaline."}, {"url": "http://www.cancer.org/cancer/castlemandisease/detailedguide/castleman-disease-what-is-castleman-disease", "passage_text": "Castleman disease (CD) is a rare disease of lymph nodes and related tissues. It is also known as Castleman’s disease, giant lymph node hyperplasia, and angiofollicular lymph node hyperplasia (AFH). It was first described by Dr. Benjamin Castleman in the 1950s. About lymph nodes and lymphoid tissue. To understand Castleman disease, it helps to know about the body’s lymph system. Lymphoid tissue, also known as lymphatic tissue, is the main part of the immune system. It is formed by different types of cells that work together to help the body fight infections."}, {"url": "http://www.cancerindex.org/medterm/medtm9.htm", "passage_text": "Lymph. Lymph is a fluid that circulates throughout the body in the lymphatic system. It forms when tissue fluids/blood plasma (mostly water, with proteins and other dissolved substances) drain into the lymphatic system. It contains a high number of lymphocytes (white cells that fight infection)"}, {"url": "http://www.answers.com/Q/What_is_the_medical_term_meaning_any_disease_of_the_lymph_nodes", "passage_text": "1 Swollen lymph nodes occur due to infection, autoimmune disease, cancer, allergies and other organ diseases. 2  If t…. 3  Ins and Outs of Adenopathy Adenopathy is by definition a common symptom that is associated with many different minor illnesses, as well as some severe ones. 4  It can also happen concurrently with the men…. Adrenopathy is any disease of the adrenal glands. One example is  Addison disease, which may lead to a drop in blood sodium and blood  glucose, and increase in blood potassi … um levels, dehydration, and  weight loss. Pheochromocytoma is a tumor of adrenal gland that  produces excessive adrenaline."}, {"url": "http://www.answers.com/Q/What_is_the_medical_term_meaning_inflammation_of_a_lymph_node", "passage_text": "Lymphadenitis is inflammation of a lymph node. Typically inflammation of the lymph nodes are signs of immune-activation in the local-area the lymph node supplies. Often this is seen in enlarged, tender lymph nodes. The state is called lymphadenopathy - meaning basically disease of the lymph node(s)"}, {"url": "http://www.answers.com/Q/What_is_the_medical_term_meaning_any_disease_of_the_lymph_nodes", "passage_text": "Typically inflammation of the lymph nodes are signs of immune-activation in the local-area the lymph node supplies. Often this … is seen in enlarged, tender lymph nodes. The state is called lymphadenopathy - meaning basically disease of the lymph node(s). Adrenopathy is any disease of the adrenal glands. One example is  Addison disease, which may lead to a drop in blood sodium and blood  glucose, and increase in blood potassi … um levels, dehydration, and  weight loss. Pheochromocytoma is a tumor of adrenal gland that  produces excessive adrenaline."}, {"url": "http://www.answers.com/Q/What_is_the_medical_term_meaning_inflammation_of_a_lymph_node", "passage_text": "The sugar that collects in the coffee filter is similar to the white blood cells and lymphatic debris that collect in the lymph nodes, which is what causes the inflammation. The state is called lymphadenopathy - meaning basically disease of the lymph node(s). Typically inflammation of the lymph nodes are signs of immune-activation in the local-area the lymph node supplies. Often this is seen in enlarged, tender lymph nodes."}]