[{"url": "http://news.bbc.co.uk/onthisday/hi/dates/stories/march/30/newsid_2530000/2530913.stm", "passage_text": "1981: President Reagan is shot President Ronald Reagan has been shot and wounded after a lone gunman opened fire in Washington. He is currently undergoing emergency surgery at George Washington University Hospital but there are unconfirmed reports he walked in unaided. Initial reports claim he may have a punctured lung."}, {"url": "http://www.nytimes.com/learning/general/onthisday/big/0330.html", "passage_text": "Washington, March 30 -- President Reagan was shot in the chest today by a gunman, apparently acting alone, as Mr. Reagan walked to his limousine after addressing a labor meeting at the Washington Hilton Hotel. The White House press secretary and two law-enforcement officers were also wounded by a burst of shots."}, {"url": "http://news.bbc.co.uk/onthisday/hi/dates/stories/march/30/newsid_2530000/2530913.stm", "passage_text": "1981: President Reagan is shot President Ronald Reagan has been shot and wounded after a lone gunman opened fire in Washington. 1981: President Reagan is shot. He is currently undergoing emergency surgery at George Washington University Hospital but there are unconfirmed reports he walked in unaided."}, {"url": "https://en.wikipedia.org/wiki/Reagan_assassination_attempt", "passage_text": "The attempted assassination of United States President Ronald Reagan occurred on March 30, 1981, 69 days into his presidency. While leaving a speaking engagement at the Washington Hilton Hotel in Washington, D.C., President Reagan and three others were shot and wounded by John Hinckley, Jr."}, {"url": "http://www.pbs.org/newshour/bb/white_house-jan-june11-reagan_03-30/", "passage_text": "GWEN IFILL: Next, remembering the attempted assassination of Ronald Reagan 30 years later. And for that, we turn to Judy Woodruff. JUDY WOODRUFF: President Reagan was just two months into his first term on that fateful day in 1981."}, {"url": "http://history1900s.about.com/od/1980s/qt/Reagan-Assassination-Attempt.htm", "passage_text": "On March 30, 1981, 25-year-old John Hinckley Jr. opened fire on U.S. President Ronald Reagan just outside the Washington Hilton Hotel. President Reagan was hit by one bullet, which punctured his lung. Three others were also injured in the shooting."}, {"url": "http://www.history.com/this-day-in-history/president-reagan-shot", "passage_text": "On this day in1981, President Ronald Reagan is shot while leaving the Washington Union Hotel in Washington, D.C. Reagan’s assailant, later identified as 25-year-old John Hinckley Jr., approached the president as he left the hotel after speaking to a union convention, and fired five to six shots from a .22 caliber..."}, {"url": "http://www.forbes.com/sites/leahbinder/2014/03/30/one-surprising-legacy-of-the-reagan-assassination-attempt/", "passage_text": "Thirty-three years ago, on the thirtieth day of the third month of 1981, a gunman attempted to assassinate President Ronald Wilson Reagan. This is not only a major historical event; it is also an American healthcare first: the only time a president was shot in office and survived."}]