[{"url": "http://www.food.com/recipe/cornish-pasties-251075", "passage_text": "1 Combine potato, onion, meat, and seasonings; mix together well. 2  Cut butter and shortening into flour in a bowl until mixture resembles fine crumbs. 3  Add about 2 tablespoons cold water and mix with a fork to form a firm dough (add more water if necessary, until mixture just holds together). "}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/cornish-pasties-recipe.html#!", "passage_text": "Sift the flour, confectioners' sugar, and salt into a mixing bowl and add the butter and lard. Using your fingers, 2 knives, or a pastry blender, cut the butter and lard into the dry ingredients until mixture resembles fine crumbs. In a small bowl, whisk the egg yolk and water together and add to the flour mixture. In a mixing bowl, combine the meat, onion, carrot, potato, salt and pepper and mix until thoroughly combined. Place the pastry circles on a clean work surface and place about 1/2 cup of the filling in the center of 1 side of the pastry."}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/cornish-pasties-recipe.html#!", "passage_text": "Preheat the oven to 400 degrees F. Remove the pastry circles from the refrigerator. In a mixing bowl, combine the meat, onion, carrot, potato, salt and pepper and mix until thoroughly combined. Place the pastry circles on a clean work surface and place about 1/2 cup of the filling in the center of 1 side of the pastry."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080217055917AABkz9Q", "passage_text": "Report Abuse. You can make reasonable pasties with lamb or minced beef, but that is not a Cornish Pasty! It has to be chuck steak or skirt, cut in small chunks, with shortcrust pastry (not puff). Source(s): Devonian married to Cornishman. steffi · 8 years ago."}, {"url": "https://en.wikipedia.org/wiki/Pasty", "passage_text": "A pasty (/ˈpaesti/ , ˈpæsti: Cornish; Hogen), (pasti sometimes known in The United states as a pastie Or british) pasty is a baked, pastry a traditional variety of which is particularly associated With, cornwall in THE. uk Pasties An uncooked pasty, crimped along the top The cooked pasty, ready for eating A modern replication of a two course pasty A Mexican paste Cornish Pirates players display a giant pasty Pasties in the oven. This article is about the baked pie or pastry. For the fried pie or pastry, see Pastie."}, {"url": "https://en.wikipedia.org/wiki/Pasty", "passage_text": "The recipe for a Cornish pasty, as defined by its protected status, includes diced or minced beef, onion, potato and swede in rough chunks along with some light peppery seasoning. The cut of beef used is generally skirt steak. Pasties An uncooked pasty, crimped along the top The cooked pasty, ready for eating A modern replication of a two course pasty A Mexican paste Cornish Pirates players display a giant pasty Pasties in the oven. This article is about the baked pie or pastry. For the fried pie or pastry, see Pastie."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080217055917AABkz9Q", "passage_text": "Skirt or feather steak and it should be diced not minced. The vegetables should be sliced too, potato onion and swede. Pile veg on pastry circle, put meat on top, season with a little salt and freshly groung black pepper, seal and make a slit either side of the pasty. Put in a hot oven for about ten minutes, then turn down the heat and cook for another 20 minutes. You can make reasonable pasties with lamb or minced beef, but that is not a Cornish Pasty! It has to be chuck steak or skirt, cut in small chunks, with shortcrust pastry (not puff). Source(s): Devonian married to Cornishman. steffi · 8 years ago."}, {"url": "http://www.cornwalls.co.uk/food/pasty.htm", "passage_text": "Recipe for Cornish Pasty. Any good pastry may be used but it should not be too flaky as it'll leak nor too rich. A very useful pastry is: 1lb flour, 1/2 lb lard and suet, 1/2 teapoonful salt, mix with water. "}, {"url": "https://en.wikipedia.org/wiki/Pasty", "passage_text": "The traditional Cornish pasty, which since 2011 has Protected Geographical Indication (PGI) status in Europe, is filled with beef, sliced or diced potato, swede (also known as yellow turnip or rutabaga – referred to in Cornwall as turnip) and onion, seasoned with salt and pepper, and is baked. Pasties An uncooked pasty, crimped along the top The cooked pasty, ready for eating A modern replication of a two course pasty A Mexican paste Cornish Pirates players display a giant pasty Pasties in the oven. This article is about the baked pie or pastry. For the fried pie or pastry, see Pastie."}]