[{"url": "http://www.inquisitr.com/2077969/how-much-do-uber-drivers-really-make-journalist-goes-undercover-to-find-out/", "passage_text": "According to a 2014 Washington Post story, Uber said the average UberX driver putting in at least 40 hours a week could expect to pull in about $74,191 dollars a year in San Francisco, and a quite respectable $90, 766 dollars a year in New York City, both incomes dwarfing the average cabbie salary of $30,000 a year. A current Uber radio commercial features a guy saying he makes about $500 dollars a month driving for Uber, but he could make $5000 a month if he so desired. The message being, it’s up to you, prospective Uber driver. Rake in as much, or as little cash as you want."}, {"url": "http://www.idrivewithuber.com/how-much-do-uber-drivers-make/", "passage_text": "Uber driver pay varies depending on where you live and how many hours you drive. I make between $20 and $25 an hour in Los Angeles. Studies across the nation show that Uber drivers make over $19 an hour on average. In New York City, the average Uber driver makes over $30 an hour. There is also no such thing as an Uber driver salary. As described above, drivers are paid a portion of the fare for every ride that is given. As promised, here is an example of my pay for one 10 ½ hour day: $256.30 / 10.5 hours = $24.41 an hour."}, {"url": "http://www.tampabay.com/news/nation/how-much-do-uber-drivers-really-make/2189259", "passage_text": "Sunday, July 20, 2014 4:42pm. Getty Images. Uber has made some lofty claims about just how much its drivers can make a year. The company has said its UberX drivers can make $90,000 a year in New York and up to $60,000 in Dallas. But in other places, UberX is the company's low-cost ridesharing service. We put Uber's salary claims to the test by talking to a half dozen UberX drivers in New York City and Dallas. The max that I've made on an hourly basis is about $45 to $55 an hour, one Dallas UberX driver told us."}, {"url": "http://bostinno.streetwise.co/2014/06/09/how-much-do-uberx-drivers-actually-make-per-hour/", "passage_text": "So, what does that mean for Boston uberX drivers? Part-time drivers, like the subject of an earlier BostInno report, who make $300 on an exceptional weekend night (about $200 net, after Uber's 20 percent cut and gas money is deducted), can make approximately $21,000 per year. While current and prospective Boston uberX drivers have been told they can potentially make upwards of $50,000 shuttling Uber users around for more than 40 hours per week, the tech company appears to be cooking the books."}, {"url": "http://www.businessinsider.com/how-much-money-uber-drivers-really-make-2014-11", "passage_text": "Uber says its drivers can make $90,000 a year driving for UberX in New York City. Last month, Business Insider talked to Uber drivers who said they weren't making nearly that much. Because drivers incur a myriad of different costs and all driver patterns and behaviors vary wildly, it is nearly impossible to estimate with certainty exactly what the average driver makes (because there really is no such thing as an average Uber driver)."}, {"url": "http://www.idrivewithuber.com/how-much-do-uber-drivers-make/", "passage_text": "This is very close to the $19 an hour the average Uber driver makes around the country. I’ve found that the more hours I drive, the more I make per hour. If I drive 30 hours a week or more I usually make closer to $25 an hour. There is also no such thing as an Uber driver salary. As described above, drivers are paid a portion of the fare for every ride that is given. As promised, here is an example of my pay for one 10 ½ hour day: $256.30 / 10.5 hours = $24.41 an hour."}, {"url": "http://www.fastcompany.com/3048563/fast-feed/this-is-how-much-uber-and-lyft-drivers-make-in-different-cities", "passage_text": "Depending on whom you ask, driving for Lyft or UberX is either a gold mine or an exploitative labor practice. Uber last year infamously claimed many of its drivers made more than $90,000 per year, but it did not account for the cost of driver expenses like gas and car maintenance. I drive for Uber in the San Francisco Bay Area. My story is I don't really make that much as an Uber driver. Guess people have the misconception of Uber drivers making tons of money due to their advertising. In reality, it ranges from $3 to $35 an hour depending on the distance of the ride."}, {"url": "http://www.idrivewithuber.com/how-much-do-uber-drivers-make/", "passage_text": "As I already explained, how much money an Uber driver makes depends on numerous factors. As a practical example, let’s assume you make $20 an hour after taxes and expenses, and you work 40 hours a week, like a regular full-time job: $19 x 40 hours/week= $760 a week. There is also no such thing as an Uber driver salary. As described above, drivers are paid a portion of the fare for every ride that is given. As promised, here is an example of my pay for one 10 ½ hour day: $256.30 / 10.5 hours = $24.41 an hour."}, {"url": "http://www.businessinsider.com/how-much-money-uber-drivers-really-make-2014-7", "passage_text": "Uber has made some lofty claims about just how much its drivers can make a year. Uber has said its UberX drivers can make a median income of $90,000 a year in New York, as long as they drive over 40 hours per week. It s ays drivers can make up to $60,000 per year in Dallas. UberX is the startup's cheaper tier service. In New York, UberX is the startup's lower-cost, lower-level black car service"}]