[{"url": "http://www.wikihow.com/Make-Hair-Grow-Long-Faster", "passage_text": "It does, however, stop loss of length from the tips, as it prevents breakages from split ends. 1  How often you should cut your hair depends on how healthy it is and how fast you want it to grow; it is totally up to your own judgement. 2  Normal hair grows anywhere from 1⁄2 inch (1.3 cm) - 5⁄8 inch (1.6 cm) per month."}, {"url": "http://www.stylecraze.com/articles/how-to-grow-hair-faster-15-tricks-that-worked-for-me/", "passage_text": "Before you get to know the various tricks to make your hair grow faster, it is important to know the actual science behind hair growth. 1  An average human has 1,00,000 hair follicles, each of which produce 20 hairs in a lifetime. 2  Each of our hair strands undergoes 3 stages: Anagen phase, Catagen phase and Telogen phase."}, {"url": "http://www.beautyandtips.com/hairtips/10-tips-how-to-make-your-hair-grow-faster/", "passage_text": "The rate at which your hair grows is genetic and it normally grows at around a quarter to a half an inch every month. You can, however, do things to increase the growth rate of your hair and improve on the thickness and the healthiness of your locks."}, {"url": "http://www.lifehack.org/articles/lifestyle/10-tips-make-hair-grow-faster.html", "passage_text": "Hair consists of keratin, which is a protein made up of amino acids. In order to grow new hair, your body must produce these amino acids: high-protein diets are therefore great for your hair, so make sure that you are including to your diet ingredients like eggs, meats and even dairy products like yogurt."}, {"url": "http://www.wikihow.com/Make-Your-Hair-Grow-Faster", "passage_text": "1 Zinc helps your body grow and repair tissue, such as your hair, and keeps the oil glands around your hair follicles working as they should. 2  Get your zinc from peanut butter, lean meat, oysters and crab, poultry, pumpkin seeds, or chickpeas."}, {"url": "http://www.top10homeremedies.com/how-to/make-hair-grow-faster.html", "passage_text": "3. Massage your scalp. Massaging promotes blood flow to the scalp, which in turn stimulates the hair follicles. In addition, deep condition your hair once a week with a hot oil treatment or deep conditioning hair mask. 1  Apply the oil (preferably warm) or conditioner to your hair. 2  Gently rub your fingers on your scalp in a circular motion for three to five minutes."}, {"url": "http://www.lifehack.org/articles/lifestyle/10-tips-make-hair-grow-faster.html", "passage_text": "Massaging the hair is also a great way to accelerate your hair’s growth, because it increases blood circulation and brings forth essential nutrients to your hair follicles. The fifth point is trimming hair: there has been a lot of discussions on why trimming hair is effective in natural hair growth."}, {"url": "http://www.stylecraze.com/articles/how-to-grow-hair-faster-15-tricks-that-worked-for-me/", "passage_text": "About 90% of the hair on your scalp now is in the growth phase or the Anagen phase which usually takes around 5 years. During the Catagen phase, the hair follicle shrinks. This happens to 1% of hair strands and takes about a month’s time. And finally in the Telogen phase, the hair rests or falls off."}]