[{"url": "http://www.faa.gov/about/initiatives/avgas/", "passage_text": "The Federal Aviation Administration (FAA) shares the Environmental Protection Agency's (EPA) concerns about lead emissions from small aircraft. Owners and operators of more than 200,000 piston-engine aircraft operating in the United States rely on aviation gasoline (avgas) to power their aircraft."}, {"url": "http://abovegroundfuelstoragetanks.com/avgas/", "passage_text": "1 Avgas 80/87 – Because of its low octane rating, it can only be used in low compression ratio engines. 2  It contains the least amount of lead of any aviation fuel. 3  Avgas 100/130 – This higher octane grade aviation gas contains a high percentage of lead, which is why 100LL was designed as a replacement."}, {"url": "https://en.wikipedia.org/wiki/Avgas", "passage_text": "Avgas (av iation gas oline), also known as aviation spirit in the UK, is an aviation fuel used in spark-ignited internal-combustion engines to propel aircraft. Avgas is distinguished from mogas (motor gasoline), which is the everyday gasoline used in motor vehicles and some light aircraft."}, {"url": "http://abovegroundfuelstoragetanks.com/avgas/", "passage_text": "According to the chemical encyclopedia of Chemeurope.com, aviation gasoline – or avgas for short – is a fuel used in piston-engine and Wankel engine aircraft. It is different from standard gas because it uses tetra-ethyl lead, or TEL, to enhance combustion."}, {"url": "http://www.csgnetwork.com/avgas.html", "passage_text": "Avgas grades are defined primarily by their octane rating. Two ratings are applied to aviation gasolines (the lean mixture rating and the rich mixture rating) which results in a multiple numbering system e.g. Avgas 100/130 (in this case the lean mixture performance rating is 100 and the rich mixture rating is 130)."}, {"url": "http://www.csgnetwork.com/avgas.html", "passage_text": "Avgas is gasoline fuel for reciprocating piston engine aircraft and is not to be confused with jet fuel. As with all gasolines, avgas is very volatile and is extremely flammable at normal operating temperatures."}, {"url": "http://100ll.com/", "passage_text": "About 100LL. 100LL.com is a pilot's information service with a continuously updated nationwide airport directory with aviation fuel prices including 100 Low Lead and Jet-A, hotels, ground transportation, airport services and more."}]