[{"url": "http://healthyeating.sfgate.com/psyllium-provide-insoluble-fiber-7737.html", "passage_text": "Psyllium in breakfast cereal adds both soluble and insoluble fiber. The unique characteristics of psyllium fiber have led to its use as a food supplement and additive. Psyllium is composed of about 70 percent soluble fiber, which forms a gel in your intestines, binding to cholesterol and helping to slow digestion. About 30 percent of psyllium is insoluble fiber that contributes bulk to stool and helps to stimulate its movement through your intestinal tract, which improves bowel regularity."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/fiber/art-20043983", "passage_text": "1 This type of fiber dissolves in water to form a gel-like material. 2  It can help lower blood cholesterol and glucose levels. 3  Soluble fiber is found in oats, peas, beans, apples, citrus fruits, carrots, barley and psyllium. 4  Insoluble fiber. 1 It can help lower blood cholesterol and glucose levels. 2  Soluble fiber is found in oats, peas, beans, apples, citrus fruits, carrots, barley and psyllium. 3"}, {"url": "http://www.webmd.com/ibs/news/20090828/ibs-relief-from-soluble-fiber", "passage_text": "Aug. 28, 2009 -- Psyllium, the soluble fiber in Metamucil and other products, can relieve abdominal pain and discomfort in some patients with irritable bowel syndrome (IBS). Bran, an insoluble fiber, did not help most patients and worsened symptoms in many, according to the results of a 275-patient clinical trial. "}, {"url": "http://www.livestrong.com/article/399053-is-psyllium-soluble-or-insoluble-fiber/", "passage_text": "Psyllium Fiber. Psyllium fiber is derived from the husk of the seeds of the plant. It is highly soluble in water and forms mucilage, which acts as a laxative purely due to the mechanical effects the fiber bulk produces in the large intestine. Psyllium slows the passage of stools in the colon, so it is helpful in the treatment of diarrhea. Intake of limited quantities of psyllium has been found to be useful in inflammatory bowel disease, or IBS, but you need to work closely with your doctor to determine the amount of fiber right for you."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/fiber/art-20043983", "passage_text": "1 Soluble fiber. 2  This type of fiber dissolves in water to form a gel-like material. 3  It can help lower blood cholesterol and glucose levels. 4  Soluble fiber is found in oats, peas, beans, apples, citrus fruits, carrots, barley and psyllium. 1 It can help lower blood cholesterol and glucose levels. 2  Soluble fiber is found in oats, peas, beans, apples, citrus fruits, carrots, barley and psyllium. 3  Ins"}, {"url": "http://healthyeating.sfgate.com/psyllium-provide-insoluble-fiber-7737.html", "passage_text": "The insoluble fiber in psyllium is an important ingredient for its intestinal health benefits. Insoluble fiber contributes structure to the form and bulk of the digesta moving through your intestines, and it reduces the length of time in between bowel movements. About 30 percent of psyllium is insoluble fiber that contributes bulk to stool and helps to stimulate its movement through your intestinal tract, which improves bowel regularity."}, {"url": "http://www.konsyl.com/what-is-psyllium-s/1833.htm", "passage_text": "It is not wheat, and is therefore gluten free. The psyllium husk is a natural source of soluble fiber, similar to fiber found in grains such as oats and barley. *The amount of soluble fiber in psyllium is nearly 5X higher than that of oat bran. 100 grams of psyllium = 50 grams of soluble fiber. 100 grams of oat bran = 5 grams of soluble fiber. A bulk forming laxative, psyllium fiber is frequently used to treat constipation. It absorbs liquid in the intestines, swells and forms a bulky stool, which is easy to pass. "}, {"url": "http://organicindia.mercola.com/psyllium.aspx", "passage_text": "Organic Whole Husk Psyllium has the soluble and insoluble fiber you want. 1  Soluble fiber that can propel food, sugars, cholesterol and fats cleanly through your digestive tract. 2  Insoluble fiber that may act as a bulking agent to support your digestive regularity and to move food quickly through your colon.*. YES – Organic Whole Husk Psyllium contains the best of beneficial soluble and insoluble fiber for you.*. Many supplements only contain soluble fiber, so you lose the benefits of insoluble fiber. Now that you've seen the competitive advantage for yourself, get started. Order now."}, {"url": "http://www.metawellness.com/en-us/articles/metamucil/psyllium-fiber-in-metamucil", "passage_text": "Metamucil® is the only leading fiber supplement brand with 100% natural psyllium fiber — and that makes all the difference. Psyllium husk, a natural dietary fiber originating from plantago ovata, has been the source of both soluble and insoluble fiber in Metamucil for 80 years. Studies suggest that the psyllium in Metamucil works differently"}, {"url": "http://organicindia.mercola.com/psyllium.aspx", "passage_text": "Organic Whole Husk Psyllium has the soluble and insoluble fiber you want. 1  Soluble fiber that can propel food, sugars, cholesterol and fats cleanly through your digestive tract. 2  Importantly, soluble fiber can contribute beneficially to your heart health. YES – Organic Whole Husk Psyllium contains the best of beneficial soluble and insoluble fiber for you.*. Many supplements only contain soluble fiber, so you lose the benefits of insoluble fiber. Now that you've seen the competitive advantage for yourself, get started. Order now."}]