[{"url": "http://news.softpedia.com/news/Neolithic-the-New-Stone-Age-81663.shtml", "passage_text": "The Neolithic (New Stone Age) was a period in the technological development of Homo sapiens that started at the end of the Ice Age, 10,000 years ago, and ended around the Mediterranean Sea and other areas about 5,500 years ago, when the Bronze Age started. It was the period when first human settlements appeared."}, {"url": "http://www.dkfindout.com/us/history/stone-age/#!", "passage_text": "The Stone Age is divided into three periods and the exact dates for each period vary across the world. The Old Stone (Paleolithic) Age lasted from the first use of stones until the end of the last Ice Age."}, {"url": "http://www.historyrocket.com/age-of-history/stone-age/Stone-Age-For-Kids.html", "passage_text": "Kids would find this information very beneficial and simple to understand. Mostly, stone age period would be very confusing for a kid who basically has just started understanding pre-historic civilization. Soto begin with, the Stone Age era took place millions of years ago."}, {"url": "http://schools-wikipedia.org/wp/s/Stone_Age.htm", "passage_text": "The Stone Age is a broad prehistoric period during which stone was widely used to make implements with a sharp edge, a point, or a percussion surface. The period lasted roughly 3.4 million years, and ended between 4500 BC and 2000 BC with the advent of metalworking."}, {"url": "http://www.kidspast.com/world-history/0008-tools-and-the-stone-age.php", "passage_text": "The Mesolithic, or Middle Stone Age, began around 12,000 years ago and continued through about 8,000 years ago. The Neolithic, or New Stone Age, lasted from 8,000 years until around 5,000 years ago. Tools and the Stone Age. One of the most important advancements in human history was the development and use of tools."}, {"url": "http://www.merriam-webster.com/dictionary/Stone%20Age", "passage_text": "Definition of STONE AGE. 1. : the first known period of prehistoric human culture characterized by the use of stone tools — compare mesolithic, neolithic, paleolithic."}, {"url": "http://www.kidspast.com/world-history/0008-tools-and-the-stone-age.php", "passage_text": "The first such period is referred to as the Paleolithic, or Old Stone Age. The Old Stone Age began about 2 million years ago with the development of the first tools by Homo habilis and lasted until around 12,000 years ago. Be slow in choosing a fried, slower in changing."}, {"url": "https://wizzley.com/the-stone-age-for-kids/", "passage_text": "The Stone Age refers to a long period of time from around 2.5 million years ago until around 5000 years ago."}, {"url": "http://timetravellerkids.co.uk/time-travel/stone-age/early-stone-age/", "passage_text": "The early stone age is also called the palaeolithic. It is by far the longest period in human history. It started in Africa more than 3 million years ago when the predecessors of modern man first started to use stone tools."}]