[{"url": "http://www.teach-nology.com/teachers/methods/info_processing/", "passage_text": "Information processing starts with input from the sensory organs, which transform physical stimuli such as touch, heat, sound waves, or photons of light into electrochemical signals. The sensory information is repeatedly transformed by the algorithms of the brain in both bottom-up and top-down processing. Information processing in the brain is the topic of a large, ongoing body of research. Although some people are fascinated by the brain on its own merits, a growing number are looking to psychology in order to better their own study skills and cognitive performance."}, {"url": "http://www.innerbody.com/image_nerv01/nerv46.html", "passage_text": "The brain stem is one of the most basic regions of the human brain, yet it is one of the most vital regions for our body’s survival. It forms the connection between the brain and the spinal cord, maintains vital control of the heart and lungs, and coordinates many important reflexes. "}, {"url": "http://www.simplypsychology.org/information-processing.html", "passage_text": "Broadbent and others in the 1950's adopted a model of the brain as a limited capacity information processing system, through which external input is transmitted. The Information Processing System. Information processing models consist of a series of stages, or boxes, which represent stages of processing. Cognitive psychology sees the individual as a processor of information, in much the same way that a computer takes in information and follows a program to produce an output."}, {"url": "http://www.simplypsychology.org/information-processing.html", "passage_text": "Information Processing. by Saul McLeod published 2008. At the very heart of cognitive psychology is the idea of information processing. Cognitive psychology sees the individual as a processor of information, in much the same way that a computer takes in information and follows a program to produce an output."}, {"url": "https://en.wikipedia.org/wiki/Information_processing", "passage_text": "Information processing is the change (processing) of information in any manner detectable by an observer. As such, it is a process that describes everything that happens (changes) in the universe, from the falling of a rock (a change in position) to the printing of a text file from a digital computer system. In the latter case, an information processor is changing the form of presentation of that text file."}, {"url": "http://www.innerbody.com/image/nerv02.html", "passage_text": "The brain is one of the most complex and magnificent organs in the human body. Our brain gives us awareness of ourselves and of our environment, processing a constant stream of sensory data. It controls our muscle movements, the secretions of our glands, and even our breathing and internal temperature. Once sensory information has entered the brain, the association areas of the brain go to work processing and analyzing this information. Sensory information is combined, evaluated, and compared to prior experiences, providing the brain with an accurate picture of its conditions."}, {"url": "http://biology.about.com/od/organsystems/ss/central-nervous-system.htm", "passage_text": "The central nervous system (CNS) is the processing center for the nervous system. It receives information from and sends information to the peripheral nervous system. The two main organs of the CNS are the brain and spinal cord. The brain processes and interprets sensory information sent from the spinal cord. Both the brain and spinal cord are protected by three layers of connective tissue called the meninges. Within the central nervous system is a system of hollow cavities called ventricles."}, {"url": "https://en.wikipedia.org/wiki/Human_brain", "passage_text": "The human brain is the main organ of the human nervous system. It is located in the head, protected by the skull. It has the same general structure as the brains of other mammals, but with a more developed cerebral cortex. "}, {"url": "http://www.teach-nology.com/teachers/methods/info_processing/", "passage_text": "The human brain is a complicated, creative information-processing system. As technology advanced from primitive to modern, the metaphors used to describe the brain also advanced. Initially, it was compared to a wax tablet, then to a sheet of papyrus, then to a book, and most recently, to a computer. Information processing in the brain is the topic of a large, ongoing body of research. Although some people are fascinated by the brain on its own merits, a growing number are looking to psychology in order to better their own study skills and cognitive performance."}, {"url": "http://www.simplypsychology.org/information-processing.html", "passage_text": "The idea of information processing was adopted by cognitive psychologists as a model of how human thought works. For example, the eye receives visual information and codes information into electric neural activity which is fed back to the brain where it is “stored” and “coded”. Cognitive psychology sees the individual as a processor of information, in much the same way that a computer takes in information and follows a program to produce an output."}]