[{"url": "https://en.wikipedia.org/wiki/Hypothalamus", "passage_text": "The hypothalamus is responsible for certain metabolic processes and other activities of the autonomic nervous system. It synthesizes and secretes certain neurohormones, often called releasing hormones or hypothalamic hormones, and these in turn stimulate or inhibit the secretion of pituitary hormones. "}, {"url": "http://homepage.smc.edu/wissmann_paul/intranetstuff/dept/scienceLRC/wissmann_site/pituitary.htm", "passage_text": "Although the hypothalamus does not produce the hormones of the anterior pituitary as in the posterior pituitary, it plays an important role in their production. Releasing hormones synthesized by hypothalamic neurons travel down axons and diffuse into the primary plexus of the hypophyseal portal system. It does not produce its own hormones, but only stores and releases the hormones created by the hypothalamus, whereas the anterior pituitary produces and secretes its own hormones. Posterior Pituitary. ADH and oxytocin are produced in neuronal cell bodies of the supraoptic and paraventricular nuclei in the hypothalamus."}, {"url": "http://www.answers.com/Q/What_hormones_do_the_hypothalamus_make", "passage_text": "The hypothalamus by itself does not produce any hormones, but regulates the hormone production by endocrine glands by releasing various controlling factors that act on the pit … uitary and help in maintaining balance. 1. ACRH (adrenocortin releasing hormone) 2. TRH is produced by the hypothalamus in medial neurons of the  paraventricular  nucleus.[3]  At the beginning, it is synthesized as a 242-amino acid precursor  polypeptide … that contains 6 copies of the sequence  -Gln-His-Pro-Gly-, flanked by Lys-Arg or Arg-Arg sequences."}, {"url": "http://homepage.smc.edu/wissmann_paul/intranetstuff/dept/scienceLRC/wissmann_site/pituitary.htm", "passage_text": "The posterior pituitary is, in effect, a projection of the hypothalamus. It does not produce its own hormones, but only stores and releases the hormones created by the hypothalamus, whereas the anterior pituitary produces and secretes its own hormones. Posterior Pituitary. ADH and oxytocin are produced in neuronal cell bodies of the supraoptic and paraventricular nuclei in the hypothalamus."}, {"url": "https://answers.yahoo.com/question/index?qid=1006043001676", "passage_text": "The hypothalamus links the nervous system to the endocrine system by synthesizing and secreting neurohormones, often called releasing hormones, as needed that control the secretion of hormones from the anterior pituitary gland — among them, gonadotropin-releasing hormone (GnRH). "}, {"url": "http://www.answers.com/Q/What_hormones_do_the_hypothalamus_make", "passage_text": "The posterior lobe of the pituitary releases the two hormones it receives from the hypothalamus, called vasopressin and oxytocin, into the bloodstream. Vasopressin plays a role in the fluid balance of the body; oxytocin is thought to pace the onset and progress of labor during childbirth. TRH is produced by the hypothalamus in medial neurons of the  paraventricular  nucleus.[3]  At the beginning, it is synthesized as a 242-amino acid precursor  polypeptide … that contains 6 copies of the sequence  -Gln-His-Pro-Gly-, flanked by Lys-Arg or Arg-Arg sequences."}, {"url": "http://www.yourhormones.info/Glands/Pituitary_gland.aspx", "passage_text": "Prolactin, which stimulates milk production Thyroid stimulating hormone, which stimulates the thyroid gland to secrete thyroid hormones. There are also some hormones that are produced by the hypothalamus and then stored in the posterior pituitary gland prior to being released into the bloodstream. The anterior pituitary gland produces the following hormones and releases them into the bloodstream: 1  Adrenocorticotropic hormone, which stimulates the adrenal glands to secrete steroid hormones, principally cortisol. 2  Growth hormone, which regulates growth, metabolism and body composition."}, {"url": "http://www.yourhormones.info/glands/hypothalamus.aspx", "passage_text": "There are two sets of nerve cells in the hypothalamus that produce hormones. One set sends the hormones they produce down through the pituitary stalk to the posterior lobe of the pituitary gland where these hormones are released directly into the bloodstream. These hormones are anti-diuretic hormone and oxytocin. You are here: Hypothalamus. Print | Email article to a friend | Last updated: January 21, 2015. The hypothalamus is a part of the brain that has a vital role in controlling many bodily functions including the release of hormones from the pituitary gland."}, {"url": "https://askabiologist.asu.edu/bird-hypothalamus", "passage_text": "This is called maintaining homeostasis. The hypothalamus also maintains homeostasis in lots of other ways, such as by controlling your blood pressure. The hypothalamus also controls many of your hormones. It does this by being a sort of gatekeeper for other glands that release hormones. When your hypothalamus senses a change in your body, it will tell the right gland how to help correct that change. The hypothalamus does many things, but two of its most important jobs are to maintain homeostasis and to control certain hormones. Homeostasis is very important to all animals, including humans. If we look at the word, we see that homeo means “the same”, and stasis means “not moving”, or “holding”."}]