[{"url": "http://www.u-s-history.com/pages/h1667.html", "passage_text": "Taft-Hartley Act of 1947. The Taft-Hartley Act of 1947, sponsored by U.S. Senator Robert A. Taft and Representative Fred A. Hartley, was designed to amend much of the National Labor Relations Act of 1935 (the Wagner Act) and discontinued parts of the Federal Anti-Injunction Act of 1932."}, {"url": "http://www.u-s-history.com/pages/h1667.html", "passage_text": "The Taft-Hartley Act was the first major revision to the Wagner Act, and after much resistance from labor leaders and a veto from President Harry S. Truman, was passed on June 23, 1947. The Taft-Hartley Act provides for the following:"}, {"url": "http://www.encyclopedia.com/topic/Taft-Hartley_Labor_Act.aspx", "passage_text": "TAFT-HARTLEY ACT (1947). Passed by Congress over the veto of President Harry Truman, the Taft-Hartley Act enacted a number of significant amendments to the National Labor Relations Act of 1935."}, {"url": "https://quizlet.com/20902997/apush-chapter-36-flash-cards/", "passage_text": "Taft-Hartley Act (1947). Also called the Labor Management Relations Act. Passed over President Truman's veto by a Republican-controlled Congress. Labor leaders condemned the Taft-Hartley Act as a slave-labor law.."}, {"url": "http://www.encyclopedia.com/topic/Taft-Hartley_Labor_Act.aspx", "passage_text": "Also known as the Labor-Management Relations Act, it passed Congress in 1947 and established guidelines to correct unions' unfair labor practices. Taft-Hartley did several things to regulate labor practices in the United States."}, {"url": "http://openstudy.com/updates/527bd74fe4b0de4fd476d192", "passage_text": "The Taft-Hartley Act intended to do which of the following? curb the laws that gave too much power to union leaders grant US veterans benefits upon returning home provide companies with a way to acquire immigrant labor give women workers more rights in World War II factories Done."}, {"url": "http://legal-dictionary.thefreedictionary.com/Wagner+Act", "passage_text": "The law was amended by the Taft-Hartley Act of 1947, also known as the Labor Management Relations Act (29 U.S.C.A. § 141 et seq.), which balanced some of the advantages given to unions under the Wagner Act by imposing corresponding duties upon unions to deal fairly with management."}, {"url": "http://legal-dictionary.thefreedictionary.com/Taft-Hartley+Act", "passage_text": "It included amendments to the National Labor Relations Act, also known as the Wagner Act of 1935 (29 U.S.C.A. § 151 et seq.), which were crafted to counteract the advantage that labor unions had gained under the original legislation by imposing corresponding duties on unions."}]