[{"url": "http://www.nationsencyclopedia.com/economies/Europe/The-Netherlands.html", "passage_text": "Once known as Holland, the Netherlands is located in Western Europe. It borders Belgium to the south, Germany to the east and north, and the North Sea along its western coast. The country has a total area of 41,526 square kilometers (16,485 square miles)."}, {"url": "http://www.fao.org/docrep/004/Y1669E/y1669e0c.htm", "passage_text": "Although the Netherlands does not collect official data on imports of certified organic products, it is a major importer. Dutch companies play an important role in import/export trade and large quantities (up to 80 percent) are re-exported, mostly to other European countries."}, {"url": "http://www.answers.com/Q/What_are_the_crops_grown_in_Netherlands", "passage_text": "The main food crops are barley, corn, potatoes, sugar beets, and wheat.. The Netherlands produces a variety of other crops, including tomatoes and other warm-weather foods which are grown in hothouses."}, {"url": "http://www.nationsencyclopedia.com/economies/Europe/The-Netherlands.html", "passage_text": "LOCATION AND SIZE. Once known as Holland, the Netherlands is located in Western Europe. It borders Belgium to the south, Germany to the east and north, and the North Sea along its western coast. The country has a total area of 41,526 square kilometers (16,485 square miles)."}, {"url": "http://www.holland.com/global/tourism/article/cheese-from-holland.htm", "passage_text": "Cheese from Holland. 7420 Views. The Dutch produce 650 million kilos of cheese every year. Two third is exported, which makes Holland the largest cheese exporter in the world. On average the Dutch eat 14,3 kilos of cheese per person per year. No wonder Holland has a worldwide reputation for being a."}, {"url": "http://www.answers.com/Q/What_does_holland_produce", "passage_text": "Holland is a region in the Netherlands, though the name Holland is often incorrectly used to refer to all of the Netherlands. It is in western Europe, to the west of Germany a … nd the north of Belgium, across the North sea from England."}]