[{"url": "http://allrecipes.com/recipe/234803/chef-johns-smothered-pork-chops/", "passage_text": "1 Stir in garlic and cook for 1 minute; stir in flour and cook for 2 minutes. 2  Pour chicken broth into skillet and stir, dissolving browned bits of food in the bottom of the skillet. 3  Pour juices that have accumulated on plate containing pork chops into the sauce. 4  Mix in buttermilk until smooth. 5  Add water. "}, {"url": "https://en.wikipedia.org/wiki/Meat_chop", "passage_text": "Lamb chops with new potatoes and green beans. A meat chop is a cut of meat cut perpendicularly to the spine, and usually containing a rib or riblet part of a vertebra and served as an individual portion. The most common kinds of meat chops are pork and lamb. A thin boneless chop, or one with only the rib bone, may be called a cutlet, though the difference is not always clear. The term chop is not usually used for beef, but a T-bone steak is essentially a loin chop, and a rib steak a rib chop."}, {"url": "http://www.chowhound.com/food-news/55072/the-basics-how-to-pan-fry-pork-chops-2/", "passage_text": "If you aren’t, place the chops, cooked side down, in a baking dish and transfer that to the oven. 6. Roast until the chops are well browned, firm, and have an internal temperature between 135 and 140 degrees Fahrenheit when a meat thermometer is inserted into the thickest part, about five minutes. This is the sweet spot for medium, with just a faint hint of pink but still plenty of juice."}, {"url": "http://www.thekitchn.com/a-complete-guide-to-pork-chops-meat-basics-208638", "passage_text": "1 Other names: Blade chops, blade steaks, blade-end pork loin chops, pork loin blade chops, pork shoulder steaks, pork shoulder blade steaks, pork steaks. 2  Where it's from: The shoulder. 3  What it looks like: Shoulder chops have dark-colored meat, lots of fat and connective tissues, and some blade bone. Rib Chop. 1  Other names: Center-cut rib chop, pork chop end cut, pork rib cut chop, rib end cut, rib pork chop. 2  Where it's from: The rib section of the loin, from the shoulder to the middle of the loin (the rib bones attached to these chops are actually baby back ribs)."}, {"url": "http://simmerandboil.cookinglight.com/2015/06/04/what-internal-temp-should-i-use-for-pork-chops/", "passage_text": "Perfectly cooked Pork Chops with Balsamic Roasted Vegetables and Gorgonzola. Whether you’re cooking boneless or bone-in pork chops, whether you’re grilling, sauteing, sautéing, roasting, broiling or-pan, frying the rule for pork chops is to cook them to an internal temperature of°. 145 "}, {"url": "http://cooking.stackexchange.com/questions/1283/how-do-you-cook-pork-chops-without-drying-them-out", "passage_text": "First, the recommended minimum cooking temperature for pork is 145 so you can cook them a little less than you already are. Also, keep in mind that meat continues to cook after it is removed from the pan/cooking element. I typically pan fry my pork chops. Heat some olive oil in a pan and put chopped onion and garlic in, put on med heat. After about 2 mins, put the pork chops in on top of the onions and garlic. Let cook for about 10 mins, flip the chops and put some dashes of soy and Worchestershire sauce on the chops."}, {"url": "http://modernfarmer.com/2014/03/pork-101/", "passage_text": "PORK CHOPS. Thick or thin, bone-in or bone-less pork chops are cut from meat perpendicular to the spine, often from the loin. Cook : “These are a high heat, fry or grill kind of thing,” says Mylan. Pork chops from the shoulder end are fattier than from the loin end."}, {"url": "https://en.wikipedia.org/wiki/Pork_chop", "passage_text": "Pork chops, cooked and served. A pork chop is a chop of pork (a meat chop) cut perpendicularly to the spine of the pig and usually containing a rib or part of a vertebra, served as an individual portion. The center cut or pork loin chop includes a large T shaped bone, and is structurally similar to the beef T-bone steak. Rib chops come from the rib portion of the loin, and are similar to rib eye steaks. Blade or shoulder chops come from the spine, and tend to contain much connective tissue."}, {"url": "http://www.thekitchn.com/a-complete-guide-to-pork-chops-meat-basics-208638", "passage_text": "1. Shoulder Chop. 1  Other names: Blade chops, blade steaks, blade-end pork loin chops, pork loin blade chops, pork shoulder steaks, pork shoulder blade steaks, pork steaks. 2  Where it's from: The shoulder. 3  What it looks like: Shoulder chops have dark-colored meat, lots of fat and connective tissues, and some blade bone. Rib Chop. 1  Other names: Center-cut rib chop, pork chop end cut, pork rib cut chop, rib end cut, rib pork chop. 2  Where it's from: The rib section of the loin, from the shoulder to the middle of the loin (the rib bones attached to these chops are actually baby back ribs)."}]