[{"url": "http://www.costowl.com/home-improvement/landscaping-retaining-wall-cost.html", "passage_text": "Concrete retaining wall prices start around $30 per square foot including materials and installation and can go as high as $45 to $50 per square foot depending on how much prep work is involved in building the forms. Walls higher than four feet typically require a different type of form which will raise the cost. Expect to pay between $15 and $30 per square foot of wall, depending on the style and strength of block you choose. More expensive blocks can hold back more weight and can be stacked higher than cheaper blocks. Brick is a very popular material for a retaining wall. It comes in a variety of shapes, size, and color."}, {"url": "http://www.homewyse.com/services/cost_to_install_concrete_block_wall.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Concrete Block Wall Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Concrete Block Wall ranges between $8.59 - $11.70 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. "}, {"url": "http://home.costhelper.com/retaining-wall.html", "passage_text": "1 Materials and labor run anywhere from $15-$30 or more a square face foot, or around $750-$1,500 for a wall 30 inches high by 20 feet long (50 square face feet). 2  The more expensive blocks are stronger and will stack higher. 1 Poured concrete costs about $30-$40 or more a square foot (usually with a minimum charge for small jobs), or about $1,500-$2,000 for a wall 30 inches high and 20 feet long."}, {"url": "http://www.howmuchisit.org/how-much-do-cinder-blocks-cost/", "passage_text": "1 Another type of cinder block such as the Quikrete normal weight block can cost $2 to $3 per piece. 2  A lightweight block can cost $2 to $3. 3  Home Depot, another popular home improvement store located around the country, sells different sized cinder blocks for $1 to $3 per piece. 1 The number of cinder blocks you purchase can also affect the price since the more you buy, the cheaper they will be per block. 2  On average, cinder blocks can cost $1-$4 per piece. 3  Different types of cinder blocks such as a Basalite standard gray block can cost $1 to $2"}, {"url": "http://home.costhelper.com/retaining-wall.html", "passage_text": "Shopping for a retaining wall: 1  Hiring an engineer to help design a retaining wall can run about $200-$500 or more, depending on the complexity and extent of the project. 2  Hiring an engineer is strongly recommended for walls over 3 feet high. 1 Poured concrete costs about $30-$40 or more a square foot (usually with a minimum charge for small jobs), or about $1,500-$2,000 for a wall 30 inches high and 20 feet long."}, {"url": "http://www.concretenetwork.com/concrete/poured_concrete_retaining_walls/cost.html", "passage_text": "Retaining Wall Cost. Poured retaining walls with elaborate curves require complex formwork and will drive up cost for a wall. The total cost to have a concrete retaining wall installed will be a combination of material and labor prices. For a basic wall you can expect to pay between $30 and $40 per square foot. If you add a decorative finish, curves, steps, lighting or other upgrades, the cost will rise. For Ralston, $39 per square foot is the average cost he charges for a wall under 4 feet tall. For walls below 4 feet, he says his prices are often competitive with finished block. A block wall has to be stuccoed or finished with veneer, while a concrete wall does not need an added finish."}, {"url": "http://home.costhelper.com/retaining-wall.html", "passage_text": "1 Material and labor for a wood retaining wall runs approximately $20-$25 a square face foot (and there's usually a minimum charge for small projects), which would be about $1,000-$1,300 for a 50-square-face-foot wall. 1 Poured concrete costs about $30-$40 or more a square foot (usually with a minimum charge for small jobs), or about $1,500-$2,000 for a wall 30 inches high and 20 feet long."}, {"url": "http://home.costhelper.com/retaining-wall.html", "passage_text": "1 Hiring an engineer to help design a retaining wall can run about $200-$500 or more, depending on the complexity and extent of the project. 2  Hiring an engineer is strongly recommended for walls over 3 feet high. 1 Poured concrete costs about $30-$40 or more a square foot (usually with a minimum charge for small jobs), or about $1,500-$2,000 for a wall 30 inches high and 20 feet long."}]