[{"url": "http://www.livescience.com/37247-dna.html", "passage_text": "Deoxyribonucleic acid or DNA is a molecule that contains the instructions an organism needs to develop, live and reproduce. These instructions are found inside every cell, and are passed down from parents to their children. Each nucleotide contains a phosphate group, a sugar group and a nitrogen base. The four types of nitrogen bases are adenine (A), thymine (T), guanine (G) and cytosine (C). The order of these bases is what determines DNA's instructions, or genetic code."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3090", "passage_text": "DNA: Deoxyribonucleic acid. One of two types of molecules that encode genetic information. (The other is RNA. In humans DNA is the genetic material; RNA is transcribed from it. In some other organisms, RNA is the genetic material and, in reverse fashion, the DNA is transcribed from it.). DNA is a double-stranded molecule held together by weak hydrogen bonds between base pairs of nucleotides. The molecule forms a double helix in which two strands of DNA spiral about one other."}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/dna", "passage_text": "DNA is a double helix formed by base pairs attached to a sugar-phosphate backbone. DNA, or deoxyribonucleic acid, is the hereditary material in humans and almost all other organisms. Nearly every cell in a person’s body has the same DNA. Most DNA is located in the cell nucleus (where it is called nuclear DNA), but a small amount of DNA can also be found in the mitochondria (where it is called mitochondrial DNA or mtDNA). The information in DNA is stored as a code made up of four chemical bases: adenine (A), guanine (G), cytosine (C), and thymine (T)."}, {"url": "http://www.ancient-minerals.com/magnesium-benefits/what-is-function/", "passage_text": "DNA, or deoxyribonucleic acid, is the body’s genetic code, used in the building of proteins and the reproduction of cells. The cells in our body are constantly being replaced by new cells. Different types of cells turnover at different rates, with the average age of a cell in the human body estimated at seven years. "}, {"url": "https://simple.wikipedia.org/wiki/DNA", "passage_text": "DNA, short for deoxyribonucleic acid, is the molecule that contains the genetic code of organisms. This includes animals, plants, protists, archaea and bacteria. DNA is in each cell in the organism and tells cells what proteins to make. Mostly, these proteins are enzymes. DNA is inherited by children from their parents. This is why children share traits with their parents, such as skin, hair and eye color. The DNA in a person is a combination of the DNA from each of their parents. Part of an organism's DNA is  non-coding DNA  sequences. They do not code for protein sequences. Some noncoding DNA is transcribed into non-coding RNA molecules, such as transfer RNA, ribosomal RNA, and regulatory RNAs)."}, {"url": "http://www2.le.ac.uk/departments/genetics/vgec/highereducation/topics/dnageneschromosomes", "passage_text": "Genes. A gene is a length of DNA that codes for a specific protein. So, for example, one gene will code for the protein insulin, which is important role in helping your body to control the amount of sugar in your blood. Genes are the basic unit of genetics. Human beings have 20,000 to 25,000 genes. These genes account for only about 3 per cent of our DNA."}, {"url": "http://www.livescience.com/37247-dna.html", "passage_text": "DNA is made up of molecules called nucleotides. Each nucleotide contains a phosphate group, a sugar group and a nitrogen base. The four types of nitrogen bases are adenine (A), thymine (T), guanine (G) and cytosine (C). The order of these bases is what determines DNA's instructions, or genetic code."}, {"url": "https://en.wikipedia.org/wiki/DNA", "passage_text": "Deoxyribonucleic acid (/diˌɒksiˌraɪbɵ.njuːˌkleɪ.ɨk ˈaesɪd/ ; ˈæSɪD) dna is a molecule that carries most of the genetic instructions used in the, development functioning and reproduction of all known living organisms and many. viruses The backbone of the DNA strand is made from alternating phosphate and sugar residues. The sugar in DNA is 2-deoxyribose, which is a pentose (five-carbon) sugar. The sugars are joined together by phosphate groups that form phosphodiester bonds between the third and fifth carbon atoms of adjacent sugar rings."}, {"url": "http://www2.le.ac.uk/departments/genetics/vgec/highereducation/topics/dnageneschromosomes", "passage_text": "Genes are made of a chemical called DNA, which is short for 'deoxyribonucleic acid'. The DNA molecule is a double helix: that is, two long, thin strands twisted around each other like a spiral staircase. So, for example, one gene will code for the protein insulin, which is important role in helping your body to control the amount of sugar in your blood. Genes are the basic unit of genetics. Human beings have 20,000 to 25,000 genes. These genes account for only about 3 per cent of our DNA."}, {"url": "http://www.thefreedictionary.com/DNA", "passage_text": "DNA. Short for deoxyribonucleic acid. The nucleic acid that is the genetic material determining the makeup of all living cells and many viruses. It consists of two strands of nucleotides linked together in a structure resembling a ladder twisted into a spiral. Deoxyribonucleic acid, commonly called DNA, exists mainly in the nucleus and mitochondria of each cell in an organism. It consists of two long strands linked together in a structure resembling a ladder twisted into a spiral, called a double helix."}]