[{"url": "http://www.tandurust.com/respiratory-lung-disease/pleural-thickening-causes.html", "passage_text": "Pleural Thickening Causes: Symptoms, Treatment Of Pleural Thickening. Pleural thickening happens when the tissue layers that cover the lungs (known as pleura) become thickened. As a result, the lungs do not expand freely and breathing will then be labored. Causes of pleural thickening include: 1  Inflammation in the lungs. 2  Infections from bacterial pneumonia. 3  Tuberculosis infection. 4  Benign or malignant tumor. 5  Rheumatoid disease of the lungs. 6  Radiation and chemotherapy"}, {"url": "http://www.allaboutmalignantmesothelioma.com/pleural-thickening.htm", "passage_text": "Pleural thickening is the term used to describe the appearance of diffuse (widespread) scarring along the lining (pleura) of the lungs. When this pleural scarring (pleural fibrosis) is limited to one location (focal scarring) it is called pleural plaque. Pleural thickening can occur as a result of any inflammation occurring in the lungs. In addition to asbestos exposure, this may stem from any of the following: 1  Bacterial pneumonia. 2  Pleural effusion (excessive fluid in the pleural space). 3  Infection. 4  Tuberculosis. 5  Tumors (both benign and malignant). 6  Rheumatoid lung diseas"}, {"url": "http://www.innovateus.net/innopedia/what-are-causes-pleural-thickening", "passage_text": "Pleural disease affects the pleural lining of the lungs. When these thin membranes become scarred and thickened, it is medically termed as pleural thickening. It can be limited to one location (focal scarring) or become widespread (diffuse scarring). Pleural plaque is the other name for focal scarring. Pleural thickening occurs due to the inflammation in the lungs. In addition to asbestos exposure, pleural thickening may occur due to the following factors: 1  Infection. 2  Tuberculosis. 3  Bacterial Pneumonia. 4  Pleural Effusion. 5  Rheumatoid Lung Disease. 6  Tumors (benign and malignant)."}, {"url": "http://womenshealthency.com/articles/pleural-thickening-how-it-affects-the-lung/", "passage_text": "Many of the organs and cavities throughout the body have a lining or membrane surrounding the tissue. The membrane surrounding the lungs is known as the pleura and its job is to support and protect the lung tissue. Pleural thickening of this lining leads to a problem in the functionality of the protective membrane. Even though pleural thickening affects only the lining of the lungs, it can lead to more severe problems. The signs and symptoms associated with the thickening can be from damage to the lining itself or any number of other complications which may have arisen."}, {"url": "http://www.pleuralthickening.org.uk/", "passage_text": "Pleural thickening definition. Pleural thickening is a lung disease that describes a scarring, calcification, and/or thickening of the pleura (the lining surrounding the lungs) often as a consequence of the inhalation of asbestos into the lungs. If the asbestos fibres work their way into the pleura, they can cause the pleural thickening condition. Pleural thickening tends to cause sufferers a tightness of the chest or breathlessness which is attributed to the reduced lung function that the thickening causes."}, {"url": "http://www.wisegeek.org/what-is-pleural-thickening.htm", "passage_text": "These symptoms occur partly because pleural thickening, fibrosis, and effusion cause lung tissue to become rigid, meaning the lungs are unable to inflate properly. Thickening of the pleura is a symptom of both asbestosis and mesothelioma, but has other causes not related to asbestos. Tuberculosis, caused by lung infection with Mycobacterium tuberculosis, and sarcoidosis, a chronic inflammatory disease, can also cause pleural thickening. Some diseases can cause these membranes to thicken, often as a result of inflammation. Pleural thickening is commonly linked to mesothelioma and asbestosis, which are caused by asbestos exposure. The condition can also be caused by other diseases such as sarcoidosis and tuberculosis."}, {"url": "http://www.wisegeek.org/what-is-pleural-thickening.htm", "passage_text": "The lining of the lungs, called the pleura or pleural membranes, consists of thin membranes that cover the lungs and provide protection and support. Some diseases can cause these membranes to thicken, often as a result of inflammation. Pleural thickening is commonly linked to mesothelioma and asbestosis, which are caused by asbestos exposure. The condition can also be caused by other diseases such as sarcoidosis and tuberculosis."}, {"url": "http://www.pleuralthickening.org.uk/causes-of-pleural-thickening", "passage_text": "Causes of Pleural Thickening. Pleural thickening is a condition of the lungs that is most often caused by the long term exposure and inhalation of asbestos particles which then settle on the pleura, or pleural membrane (the thin area surrounding the lungs) causing the area to thicken, calcify and/or scar. "}, {"url": "http://www.allaboutmalignantmesothelioma.com/pleural-thickening.htm", "passage_text": "Pleural thickening can cause shortness of breath and adversely affect the lungs' ability to function properly. It is not malignant and is not necessarily a sign of asbestos lung disease; in this sense, pleural thickening is not as serious as asbestosis or malignant mesothelioma. Pleural thickening can occur as a result of any inflammation occurring in the lungs. In addition to asbestos exposure, this may stem from any of the following: 1  Bacterial pneumonia. 2  Pleural effusion (excessive fluid in the pleural space). 3  Infection. 4  Tuberculosis. 5  Tumors (both benign and malignant). 6  Rheumatoid lung disease"}]