[{"url": "http://www.graduatenursingedu.org/georgia/georgia-salary/", "passage_text": "Georgia Nurse Practitioner Salary. The 2011 National NP Compensation Survey, conducted by the American Academy of Nurse Practitioners, shows that nurse practitioners in the southeastern United States, including Georgia, earned an average base salary of $87,653 and an average total income of $96,916. Nurse practitioners in Columbus, Georgia earn an average of $85,760 and NPs in the coastal city of Savannah reported an average salary of $78,900."}, {"url": "http://www.topregisterednurse.com/salary/georgia/", "passage_text": "RN schools offer different paths such as diploma, associate degree and baccalaureate degree to the aspirants. You can choose any course, as per your convenience to obtain certification. According to the BLS, the annual and hourly mean registered nurse salary in Georgia, in May 2013, was $61,630 and $29.63, respectively. At that time, the state employed 66,080 RNs. Employment per 1,000 jobs was estimated to be 17.031."}, {"url": "http://nursesalaryguide.net/nurse-salary-in-georgia/", "passage_text": "The average Licensed Practical Nurse LPN Salary in Georgia (GA) is $37,040 which is below the national average for LPN or LVN’S. The latest figures show that 23,650 LPN’s are employed in the state of Georgia across a range of industries. The average Nurse Practitioner Salary in Georgia (GA) is $84,930 which is below the national average for Nurse Practitioners."}, {"url": "http://www.payscale.com/research/US/Job=Registered_Nurse_(RN)/Hourly_Rate/6a13d107/Atlanta-GA", "passage_text": "(United States). A Registered Nurse (RN) in Atlanta, Georgia earns an average wage of $26.93 per hour. The highest paying skills associated with this job are Recovery / Post-Anesthesia Care Unit (PACU), Neonatal Intensive Care Unit (NICU), and Cardiology. $39,748 - $80,515. (Median"}, {"url": "http://nursesalaryguide.net/nurse-salary-in-georgia/", "passage_text": "Registered Nurse Salary in Georgia. The average Registered Nurse Salary in Georgia (GA) is $60,770 which is below the national average for RN’s. There are approximately 64,180 Registered Nurses employed in the state of Georgia across a range of industries. The average Nurse Practitioner Salary in Georgia (GA) is $84,930 which is below the national average for Nurse Practitioners."}, {"url": "http://nursesalaryguide.net/nurse-salary-in-georgia/", "passage_text": "Nurse Practitioner Salary in Georgia. The average Nurse Practitioner Salary in Georgia (GA) is $84,930 which is below the national average for Nurse Practitioners."}, {"url": "http://www.indeed.com/salary/q-Nurse-RN-l-Georgia.html", "passage_text": "$76,000. Average Nurse RN salaries for job postings in Georgia are 14% higher than average Nurse RN salaries for job postings nationwide."}, {"url": "http://www.simplyhired.com/salaries-k-registered-nurse-l-atlanta-ga-jobs.html", "passage_text": "The average salary for registered nurse jobs in Atlanta, GA is $13,000. Average registered nurse salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term registered nurse anywhere in the job listing."}, {"url": "http://www.payscale.com/research/US/Job=Registered_Nurse_(RN)/Hourly_Rate/e77914ae/Entry-Level-Atlanta-GA", "passage_text": "(United States). The average Entry-Level Registered Nurse in Atlanta, Ga. earns approximately $24.67 per hour. There are far more female Entry-Level Registered Nurses in Atlanta, Ga. who answered the questionnaire than men, making up 86 percent. Most enjoy medical while the larger part get dental coverage. "}]