[{"url": "http://www.themedicalquestions.com/drug/where-and-when-did-marijuana-originate.html", "passage_text": "Where did marijuana originate. http://emilie.recherche.ifrance.com/_images/where-can-i-buy-linh-chi/where-did-leprosy-emerge.html. choices that every watchlist performs on a fake basis. The isoc has prohibitive gifts in virginia, united states and geneva, switzerland."}, {"url": "http://www.themedicalquestions.com/drug/where-and-when-did-marijuana-originate.html", "passage_text": "Health related question in topics Addiction Drug Abuse .We found some answers as below for this question Where and when did marijuana originate,you can compare them. Marijuana originated in the middle east. A Chinese book of medicine from the 2nd Century B.C., was first to describe it in print. [ Source: http://www.chacha.com/question/where-and-when-did-marijuana-originate ]. More Answers to  Where and when did marijuana originate ."}, {"url": "http://www.answers.com/Q/Where_did_Marijuana_come_from", "passage_text": "Marijuana dates way back; the first evidence of Marijuana smoke inhalation dates back to 3rd Millennium BC from the discovery of charred seeds found in a brazier located in Romania. The most famous ancient users of Marijuana were the Hindus who called it Ganjika (or Ganja). Other ancient users included the Assyrians, Scythians, Thracians, and Dacians who all used it in religious ceremonies. It is believed that the first Marijuana plants originated in the Middle East."}, {"url": "http://www.answers.com/Q/Where_did_cannabis_come_from", "passage_text": "Instead, marijuana originated in the middle east. China used it as an anesthetic about 5,000 years ago. Marijuana also comes from Africa, where they eat/smoke/and dissolve the plant in certain liquids."}, {"url": "http://www.livescience.com/48337-marijuana-history-how-cannabis-travelled-world.html", "passage_text": "In the report, author Barney Warf describes how cannabis use originated thousands of years ago in Asia, and has since found its way to many regions of the world, eventually spreading to the Americas and the United States."}, {"url": "http://www.answers.com/Q/Where_did_cannabis_come_from", "passage_text": "Marijuana is  derived from the Mexican word maraguanquo which means  intoxicating plant. Some people site historical inf … ormation in  which the name was used to create an evil or unpatrioitc image  for use of cannabis or other THC containing compounds .I'd like  more details about this mexican word."}, {"url": "http://thc.me/history/where-did-marijuana-originate-from", "passage_text": "Marijuana originated in Central and Southern Asia. It was discovered growing in the wild in China. China is known principally for its tea and opium, the great number of its people, it’s massive high-rises, but not really known for the discovery place of marijuana."}]