[{"url": "http://surnames.meaning-of-names.com/raef/", "passage_text": "Web Sites. Meaning of Raef. Raef Meaning: The meaning of Raef has not been submitted. If you have the meaning of Raef, please submit it with along with any reference pages referring to the meaning of Raef. "}, {"url": "http://www.meaning-of-names.com/danish-names/rf.asp", "passage_text": "Meaning of R f. Danish name. In Danish, the name R f means-Originates from the Old Norse language, meaning fox..The name R f originated as an Danish name. The name R f is most often used as a boy name or male name. Danish Name Meaning-Originates from the Old Norse language, meaning fox. Origin-Danish. "}, {"url": "http://www.hebrewsurnames.com/RAEF", "passage_text": "RAEF Genealogy. This is an open forum to discuss the origin, the meaning and the family stories of the surname RAEF. Both your knowledge and the oral tradition of the origin and meaning of this surname will be helpfull. Using the Daitch-Mokotoff Soundex Code we can obtain some variants of scripture of the same surname. Below you will find the variants of scripture we have in our database. They will be useful to find and to determine the RAEF meaning. We invite you to post your knowledge and familiar tradition about your surnames. JUST DO IT at the end of the following posts."}, {"url": "http://www.ancestry.com/name-origin?surname=raef", "passage_text": "You can find out where the majority of the Raef families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists. You can find out when most of the Raef families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival"}, {"url": "http://quranicnames.com/raif/", "passage_text": "Meaning of Raif. Raif is an indirect Quranic name for boys that means “kind”, “compassionate”, “softhearted”. It is derived from the R-Hamz-F Quranic root which is used in a number of places in the Quran. Do you not see, how God has subjected everything on the earth to you, and the ships that sail on the sea by His command"}, {"url": "http://www.thinkbabynames.com/meaning/1/Rafe", "passage_text": "Rafe /rafe/ [1 syll.] as a boys' name is pronounced rayf. It is of Old German origin, and the meaning of Rafe is counsel of the wolf. From Raedwulf. Rafe is an uncommonly occurring first name for men. Rafe is an equivalently uncommon surname too for both adults and children. (2000 U.S. Census). Rafael (#293 last year) , Raul (#423) , Raphael (#596) , Rolf, Raoul and Ralph are the prominent related forms of Rafe (unlisted) ranked in the Top 1000."}, {"url": "http://www.answers.com/Q/Is_there_a_meaning_of_the_name_Raef", "passage_text": "You also spelled especially wrong. If your name meaning starts out w … ith goddess of... as the name meaning, then it was either derived from the name of a mythological goddess or is the same name as the goddess in a given mythology. A person would be called by the word for an animal or force of nature in orde … r to bring valued attributes to that person. Later names described something about a person and referred to what they did, what they looked like or where they came from. As a result, most names derive from a word with some meaning"}, {"url": "http://www.answers.com/Q/Is_there_a_meaning_of_the_name_Raef", "passage_text": "Hebrew meaning of the name RAEF for a boy: variation of Rafael, God has healed. A person would be called by the word for an animal or force of nature in orde … r to bring valued attributes to that person. Later names described something about a person and referred to what they did, what they looked like or where they came from. As a result, most names derive from a word with some meaning"}, {"url": "https://en.wikipedia.org/wiki/Rafe_(given_name)", "passage_text": "From Wikipedia, the free encyclopedia. Rafe is an English, Scandinavian and German given name for a male, used in many countries across the world but most popular in English-speaking countries. "}]