[{"url": "http://www.remodelingexpense.com/services/cost-to-install-travertine-pavers/", "passage_text": "The Cost to Install Travertine Pavers estimator will provide you with up to date pricing for your area. Simply enter your zip code and the square footage, next click update and you will see a breakdown on what it should Cost to Install Travertine Pavers at your home. Example: a 10 x 10 area = 100 square feet."}, {"url": "http://www.justpaver.com/travertine-pavers-cost.html", "passage_text": "Square footage (plus 10% overage) x cost of travertine pavers. You will also want to figure in the cost of preparing the area that you are going to install the travertine pavers. For example, you need to find out how much it will cost to even out the land."}, {"url": "http://www.remodelingexpense.com/costs/cost-of-travertine-paver/", "passage_text": "This Travertine Paver estimator will provide you with up to date pricing for your area. Simply enter your zip code and the square footage, next click update and you will see a breakdown on what it should cost to have Travertine Paver installed onto your home. Example: a 10 x 10 area = 100 square feet."}, {"url": "http://www.improvenet.com/r/costs-and-prices/travertine-pavers", "passage_text": "The Cost. $2-$3 per square foot. While brick pavers are an economical choice for many, travertine pavers are a specialty paver that requires special ordering and sizing, depending on the project. On average, most homeowners can expect to spend on average about $14 per square foot for 100 square feet of space."}, {"url": "http://www.landscape-design-advice.com/travertine-pool-paver-costs.html", "passage_text": "The travertine pavers cost $20 per square foot. Cost of travertine pool paving (without bullnose) is $20,000. Pool paving does make up a considerable part of a total pool project. If you can afford this paving material, I would highly recommend it."}, {"url": "http://www.homewyse.com/services/cost_to_install_travertine_pavers.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Travertine Paver Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Travertine Pavers ranges between $11.31 - $16.83 per square foot* . To estimate costs for your project: 1."}]