[{"url": "https://en.wikipedia.org/wiki/Amethyst", "passage_text": "Structure [edit]. Amethyst is a purple variety of quartz (SiO 2) and owes its violet color to irradiation, iron impurities (in some cases in conjunction with transition element impurities), and the presence of trace elements, which result in complex crystal lattice substitutions. From Wikipedia, the free encyclopedia. For other uses, see Amethyst (disambiguation) . Amethyst is a violet variety of quartz often used in jewelry. The name comes from the Ancient Greek ἀ a- (not) and μέθυστος methystos (méthystos), intoxicated a reference to the belief that the stone protected its owner from. drunkenness"}, {"url": "http://www.thefreedictionary.com/amethyst", "passage_text": "Noun. 1. amethyst-a transparent purple variety of quartz; used as a gemstone. quartz-a hard glossy mineral consisting of silicon dioxide in crystal form; present in most rocks (especially sandstone and granite); yellow sand is quartz with iron oxide impurities."}, {"url": "http://www.minerals.net/mineral/amethyst.aspx", "passage_text": "When used as a gemstone, Amethyst is often heat treated to deepen the color, or to transform it into Citrine. Some varieties may also change to a light green color, which is given the trade name Prasiolite, or Green Amethyst, as it is more commonly known in the gem trade. It is the purple variety of the mineral Quartz, and its most valuable and prized variety. Its name derives from the Greek amethystos, which means not drunken, as Amethyst in antiquity was thought to ward off drunkenness."}, {"url": "http://www.gemstoneeducation.com/Amethyst.htm", "passage_text": "Amethyst-The Color, Shapes, and Sizes. Amethyst is a beautiful stone that is in the quartz family. Amethyst is the most precious quartz mineral and comes in a few distinct colors including violet, purple, rose, lavender and mauve. Amethyst is a type of quartz that is extremely popular and used mainly for ornamental jewelry. Amethyst usually comes in beautiful hues of violent and purple. Sometimes it might be a lavender or pink. However the most sought after Amethyst are those that have a deep purple hue."}, {"url": "https://simple.wikipedia.org/wiki/Amethyst_(color)", "passage_text": "For other meanings of the word, see Amethyst (disambiguation). The colour amethyst is a moderate, transparent purple. It is also known as a deep shade of lavender. Its name is from the stone amethyst. This stone is a form of quartz but it is not always purple. "}, {"url": "http://www.gia.edu/amethyst-quality-factor", "passage_text": "Amethyst has been the most-prized quartz variety for centuries. Once available only to royalty, relatively plentiful supplies have made amethyst more widely available in modern times. Today, because of its availability and affordability, amethyst is used in mass-market jewelry as well as custom designer pieces. "}, {"url": "http://www.minerals.net/mineral/amethyst.aspx", "passage_text": "The Mineral amethyst. Amethyst is a well known mineral and gemstone. It is the purple variety of the mineral Quartz, and its most valuable and prized variety. Its name derives from the Greek amethystos, which means not drunken, as Amethyst in antiquity was thought to ward off drunkenness."}, {"url": "http://www.merriam-webster.com/dictionary/amethyst", "passage_text": "Full Definition of AMETHYST. 1. a: a clear purple or bluish-violet variety of crystallized quartz that is often used as a jeweler's stone b: a deep purple variety of corundum. 2. : a moderate purple. — am·e·thys·tine \\ˌa-mə-ˈthis-tən\\ adjective. See amethyst defined for English-language learners. "}]