[{"url": "https://answers.yahoo.com/question/index?qid=20100407135224AAIttRh", "passage_text": "Best Answer: It typically takes 15-25 minutes to feel the full effects of the medication, sometimes it can be faster on an empty stomach and a bit slower on a fuller stomach. If you are still in pain, I myself would take another pill. If you wait too long before taking pain medication the pain can become unmanageable. Two pills is fine to take. Be careful not to take more than 8 in a 24 hr period because of the tylenol."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20130525124146AAj8RWT", "passage_text": "Report Abuse. It varies depending on which pills you are taking. They normally take about an hour to work and will last several hours. You can't really dissolve them in water unless they have been designed specifically for that purpose but you can get soluble ones or sleeping medication in liquid form on prescription."}, {"url": "http://prescription-drug.addictionblog.org/when-does-hydrocodone-kick-in/", "passage_text": "Hydrocodone’s kick. Hydrocodone is used to treat pain and is a relatively strong opioid drug included in brands like Vicodin, Lortab, or Norco. Hydrocodone is a powerful pain killer because it attaches to opiate receptors in the brain to prevent you from feeling pain."}, {"url": "http://www.answers.com/Q/How_long_will_it_take_for_pain_medication_to_work", "passage_text": "It usually takes 20 minutes to a half hour for medicine to work, but some medicine takes more time then others. Tramadol, for example, can take 50-55 minutes to really get rolling in the blood stream, but will usually last six hours."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20130525124146AAj8RWT", "passage_text": "Best Answer: Should take them about 30-60 minutes for them to kick in, you'll be out for a few hours unless you set an alarm depending on what kind/ how strong they are. For example, Xanex will knock me out past the alarms all night. You can't dissolve pills."}, {"url": "http://prescription-drug.addictionblog.org/when-does-hydrocodone-kick-in/", "passage_text": "After hydrocodone has peaked you will still feel the effects of pain relief but it will begin to even out. For forms of hydrocodone which last up to 12 hours, you can expect hydrocodone to peak at its half-life (3.8 hours ± 0.3 hours) and continue to be a potent pain reliever before it wears off.When does hydrocodone wear off?Short active hydrocodone wears off in 4 hours."}, {"url": "http://prescription-drug.addictionblog.org/when-does-hydrocodone-kick-in/", "passage_text": "Once hydrocodone is absorbed by the digestive system, it takes about 30 minutes for you to feel the effects of hydrocodone. However, there are many factors that influence hydrocodone onset. For the most effective results read the labels and use as directed."}]