[{"url": "https://www.irs.gov/publications/p527/ch01.html", "passage_text": "Example. On March 18, 2014, you signed a 10-year lease to rent your property. During 2014, you received $9,600 for the first year's rent and $9,600 as rent for the last year of the lease. You must include $19,200 in your rental income in 2014. "}, {"url": "https://turbotax.intuit.com/tax-tools/tax-tips/Rental-Property/Real-Estate-Tax-and-Rental-Property/INF12039.html", "passage_text": "In straight-line depreciation, the cost basis is spread evenly over the tax life of the property. For example: A residential rental building with a cost basis of $150,000 would generate depreciation of $5,455 per year ($150,000 / 27.5 years). You generally depreciate the cost of business property that has a useful life of more than a year, but gradually wears out, or loses its value due to wear and tear, weather damage, etc. To figure out the depreciation on your rental property: 1  Determine your cost or other tax basis for"}, {"url": "http://www.calculatorsoup.com/calculators/financial/depreciation-property-realestate.php", "passage_text": "Calculator Use. Use this calculator specifically to calculate depreciation of residential rental or nonresidential real property related to IRS form 4562 lines 19 and 20. It assumes MM (mid month convention) and S/L (straight-line depreciation). This calculator calculates depreciation by a formula. "}, {"url": "http://bradfordtaxinstitute.com/Free_Resources/IRS-Property-Depreciation.xml.aspx", "passage_text": "Table A-8. Determine the percentage rate used in calculating the depreciation of property for property based on the straight line method of depreciation using the half-year convention. This section of the table is for years 1 through 10 with recovery periods from 2.5 years to 9.5 years. Table A-8 (continued). Tables 1, 2 and 3 are used to locate which table you are to use, (A-1 through A-20), to find the percentage rate of depreciation on property. Table 1 is used for all property other than residential rental and nonresidential real property."}, {"url": "http://www.zillow.com/blog/rental-property-depreciation-144131/", "passage_text": "The tax assessor’s estimate of the land value is $75,000, and the building value estimate is $125,000. Your depreciation expense that you take each year against rental income would be $125,000 divided by the IRS allowed 27.5 years of useful life (residential real estate) for a depreciation expense each year of $4,545. "}, {"url": "http://bradfordtaxinstitute.com/Free_Resources/IRS-Property-Depreciation.xml.aspx", "passage_text": "Ta ble A-8. Determine the percentage rate used in calculating the depreciation of property for property based on the straight line method of depreciation using the half-year convention. This section of the table is for years 1 through 10 with recovery periods from 2.5 years to 9.5 years. Table A-8 (continued). Tables 1, 2 and 3 are used to locate which table you are to use, (A-1 through A-20), to find the percentage rate of depreciation on property. Table 1 is used for all property other than residential rental and nonresidential real property."}, {"url": "https://www.irs.gov/publications/p527/ch02.html", "passage_text": "You do this by depreciating the property; that is, by deducting some of the cost each year on your tax return. Three factors determine how much depreciation you can deduct each year: (1) your basis in the property, (2) the recovery period for the property, and (3) the depreciation method used. You cannot simply deduct your mortgage or principal payments, or the cost of furniture, fixtures, and equipment, as an expense. Continue to claim a deduction for depreciation on property used in your rental activity even if it is temporarily idle (not in use). For example, if you must make repairs after a tenant moves out, you still depreciate the rental property during the time it is not available for rent."}, {"url": "http://www.easyrentaltools.com/index.cfm?event=rental-property-depreciation-calculator", "passage_text": "This depreciation calculator will show the annual depreciation deduction for a U.S. residential rental property in its simplest form. This calculator will work for single family homes, condos, townhomes and duplexes thru four-plexes. Just follow the steps shown and the results will follow. "}, {"url": "http://homeguides.sfgate.com/calculate-depreciation-rental-properties-7940.html", "passage_text": "Calculate the percentage of the property used for rental purposes. In some cases, all of the property will be for rental purposes. If that is not the case, you can measure the area that is for rent and figure the area as a percentage of the whole property's area. IRS rules allow depreciation only for the portion of a property used for rental purposes. To depreciate property, you must be the owner of the property. You cannot depreciate a property if you are renting it."}]