[{"url": "http://www.bakeat350goessavory.com/2012/02/roasted-turkey-breast-tenderloins.html", "passage_text": "Sprinkle both side with salt and pepper. Bake for 30 minutes, or until done. (If using a meat thermometer, 140 degrees. I just cut into the thickest part of the breast and make sure the meat is no longer pink.). Let rest for 15 minutes. Cut and eat or wrap in foil and store in the fridge. I love turkey...LOVE it. "}, {"url": "http://communitytable.parade.com/236361/smccook/how-long-to-cook-the-perfect-turkey-and-how-to-know-when-a-turkey-is-done/", "passage_text": "20 to 24 pounds. Unstuffed: 4 1/2 to 5 hours. Stuffed: 4 3/4 to 5 1/4 hours. How to know when a turkey is done: While the time estimates above offer a general idea of how long a turkey will take to cook, the absolute safest way to know if your turkey is done is to use meat thermometer. How long you should roast a turkey depends largely on how much it weighs, as well as whether you plan to stuff it. For an oven set to 325°F, FoodSafety.gov recommends the following roasting times based on the weight of a fully thawed turkey: 4 to 6 pounds (breast). 1 1/2 to 2 1/4 hours. 6 to 8"}, {"url": "http://www.answers.com/Q/How_long_will_it_take_to_cook_turkey_fillets_on_the_grill", "passage_text": "How long does it take to cook a 13 pound turkey breast on a gas grill? A 13 pound turkey can be cooked on a grill for about 150 minutes. Press your finger into the thickest part of the fillet, and if it leaves an indent then it is not quite cooked yet. Or, use an internal thermometer and cook until the thickest part reaches an internal temperature of 74C."}, {"url": "https://answers.yahoo.com/question/index?qid=20121224231018AA879yb", "passage_text": "YOU have 4 turkey breast fillets and I can only cook them in the oven or grill. I don't know how to prepare them I also don't have many ingredients I just have olive oil, butter, salt, pepper, garlic, lemon, some herbs. Oil and season the turkey breast with the salt pepper and herbs and pop in the pan. Fry for about 1 min on each side to seal and the pour 1/2 pint of wine over the turkey and pop a lid on and cook for about 10 mins. Turkey will go dry very quickly so by doing this you will keep moist"}, {"url": "https://answers.yahoo.com/question/index?qid=20121224231018AA879yb", "passage_text": "Once the oven is hot, pop the fillets in for 15 minutes, after which you should brush a little marinade on top of the fillets and add some more herbs. Cook a little more until you see the fillets brown a little. (Should be five minutes or so, unless you dumped a lot of marinade). Oil and season the turkey breast with the salt pepper and herbs and pop in the pan. Fry for about 1 min on each side to seal and the pour 1/2 pint of wine over the turkey and pop a lid on and cook for about 10 mins. Turkey will go dry very quickly so by doing this you will keep moist"}, {"url": "https://answers.yahoo.com/question/index?qid=20121224231018AA879yb", "passage_text": "I have 4 turkey breast fillets and I can only cook them in the oven or grill. I don't know how to prepare them I also don't have many ingredients I just have olive oil, butter, salt, pepper, garlic, lemon, some herbs. Oil and season the turkey breast with the salt pepper and herbs and pop in the pan. Fry for about 1 min on each side to seal and the pour 1/2 pint of wine over the turkey and pop a lid on and cook for about 10 mins. Turkey will go dry very quickly so by doing this you will keep moist"}, {"url": "http://communitytable.parade.com/236361/smccook/how-long-to-cook-the-perfect-turkey-and-how-to-know-when-a-turkey-is-done/", "passage_text": "If you are cooking a stuffed turkey, you must cook it until the internal temperature of the stuffing reaches a minimum of 165°F. If the stuffing in your turkey has reached a temperature of 165°F, the temperature of the innermost part of the turkey’s thigh is likely between 165°F to 185°F, at which point it is done. How long you should roast a turkey depends largely on how much it weighs, as well as whether you plan to stuff it. For an oven set to 325°F, FoodSafety.gov recommends the following roasting times based on the weight of a fully thawed turkey: 4 to 6 pounds (breast). 1 1/2 to 2 1/4 hours. 6 to 8"}, {"url": "http://www.wikihow.com/Cook-Boneless-Turkey-Breast", "passage_text": "Calculate the cooking time. The larger your turkey breast, the longer it will take to cook. When roasted at 325 °F (163 °C), turkey breast requires approximately 25 minutes cooking time per pound. 1  For a smaller four to six pound turkey breast, set aside between 1 1/2 and 2 1/2 hours. 2  If you're cooking at an altitude of 5,000 or more feet, you'll need to add five to ten extra minutes' cooking time per pound."}, {"url": "http://www.answers.com/Q/How_long_will_it_take_to_cook_turkey_fillets_on_the_grill", "passage_text": "It would take about 3.5 - 4 hours to cook a 17 pound turkey that is  unstuffed. A stuffed turkey would take about 4.5 hours. Press your finger into the thickest part of the fillet, and if it leaves an indent then it is not quite cooked yet. Or, use an internal thermometer and cook until the thickest part reaches an internal temperature of 74C."}]