[{"url": "http://study.com/academy/lesson/centripetal-force-definition-formula-examples.html", "passage_text": "Definitions. Centripetal force is a force on an object directed to the center of a circular path that keeps the object on the path. It's value is based on three factors: 1) the velocity of the object as it follows the circular path; 2) the object's is distance from the center of the path; and 3) the mass of the object."}, {"url": "https://en.wikipedia.org/wiki/Centripetal_force", "passage_text": "where is the centripetal acceleration. The direction of the force is toward the center of the circle in which the object is moving, or the osculating circle (the circle that best fits the local path of the object, if the path is not circular)."}, {"url": "http://www.merriam-webster.com/dictionary/centrifugal%20force", "passage_text": ": the apparent force that is felt by an object moving in a curved path that acts outwardly away from the center of rotation — compare centripetal force. See centrifugal force defined for English-language learners. See centrifugal force defined for kids."}, {"url": "http://encyclopedia.kids.net.au/page/ce/Centripetal_force", "passage_text": "Centripetal force. The centripetal force is the force that causes an object to move in a circle, acting towards the centre of the circle. In the case of a satellite the centripetal force is gravity, in the case of an object at the end of a rope, the centripetal force is the tension of the rope. r, where R is a constant (the radius of the circle) and u r is the unit vector pointing from the origin to the point mass. In terms of Cartesian unit vectors:"}, {"url": "http://study.com/academy/lesson/centripetal-force-definition-formula-examples.html", "passage_text": "Centripetal force is the force on an object on a circular path that keeps the object moving on the path. It is always directed to the center and its magnitude is constant, based on the mass of the object, its tangential velocity and the distance of the object (radius) from the center of the circular path."}, {"url": "http://encyclopedia.kids.net.au/page/ce/Centrifugal_force", "passage_text": "The centrifugal force is an inertial force experienced in a rotating reference frame acting away from the center of the rotation. It is equal in magnitude but opposite to the centripetal force required to constrain the body to move in a circular motion."}]