[{"url": "http://themortgagereports.com/16931/2015-conforming-mortgage-loan-limits-interest-rates", "passage_text": "For conforming loans -- loans backed by Fannie Mae or Freddie Mac -- loan limits have been unchanged since 2006 when the government moved to raise the national limit to $417,000. Conforming loans which exceed a local loan limit are commonly known as jumbo loans. With conforming loan limits held at $417,000 for at least one more year, homeowners using conventional programs to refinance -- such as HARP -- and buyers using Fannie Mae's 3% downpayment program to purchase can get access to the lowest mortgage rates possible at the largest loan size available."}, {"url": "http://www.fhfa.gov/DataTools/Downloads/Pages/Conforming-Loan-Limits.aspx", "passage_text": "The national conforming loan limit for mortgages that finance single-family one-unit properties increased from $33,000 in the early 1970s to $417,000 for 2006-2008, with limits 50 percent higher for four statutorily-designated high cost areas: Alaska, Hawaii, Guam, and the U.S. Virgin Islands. Fannie Mae and Freddie Mac are restricted by law to purchasing single-family mortgages with origination balances below a specific amount, known as the “conforming loan limit.” Loans above this limit are known as jumbo loans."}, {"url": "http://sonomacountymortgages.com/conforming-loan-limits/", "passage_text": "The Conforming Loan Limits are the maximum loan amounts to obtain Fannie Mae/Freddie Mac mortgage loan financing. Each county per state nationwide has a set loan limit in amount eligibility for the most competitive mortgage rates and terms. For California Single Family Residences…. The Conforming Loan Limit is set at $417,000 for obtaining a Conventional Loan on primary, second home or investment property. The Conforming High Balance Loan varies by county with a max loan of $625,500 for primary, second homes or investment property type"}, {"url": "http://themortgagereports.com/16931/2015-conforming-mortgage-loan-limits-interest-rates", "passage_text": "Fannie Mae and Freddie Mac have elected to make no change to conforming loan limits for 2015. Loan limits have been unchanged since 2006, when maximum loan sizes were raised to $417,000. Then, between 2007-2011, despite rapidly falling home values, officials moved to keep conforming loan limits as-is. With conforming loan limits held at $417,000 for at least one more year, homeowners using conventional programs to refinance -- such as HARP -- and buyers using Fannie Mae's 3% downpayment program to purchase can get access to the lowest mortgage rates possible at the largest loan size available."}, {"url": "http://themortgagereports.com/loan-limits/", "passage_text": "Loan Limits. Get Today's Mortgage Rates. 2015 Conforming, FHA, & VA Loan Limits. Mortgage loan limits for every U.S. county, as published by Fannie Mae & Freddie Mac, the Federal Housing Administration (FHA), and the Department of Veterans Affairs (VA). 1-Unit."}, {"url": "http://www.zillow.com/mortgage-learning/conforming-loan-limits/", "passage_text": "Most high-cost areas have maximum loan limits around $625,500. Conforming loans must also meet other guidelines related to a borrower’s loan-to-value ratio, debt-to-income ratio, credit score and history, documentation requirements, etc. The most well-known conforming loan guideline is the size of the loan. There are two different types of conforming loan size limits: standard and high-cost area. Most counties in the United States have a conforming loan limit of $417,000 for a one-unit property. However, there are high-cost areas of the country that have loan limits up to $721,050"}, {"url": "http://www.loanlimits.org/california/", "passage_text": "In 2015, most counties within California have a conforming loan limit of $417,000. Higher-priced areas have limits of up to $625,500. Other counties fall somewhere in between these “floor” and “ceiling” amounts. The table below shows 2015 conforming loan limits for all California counties. For the most part, California conforming loan limits will be the same in 2015 as they were in 2014. But in the four counties listed below, the maximum size limits were increased: 1  Monterey County went from $483,000 in 2014 to $502,550 in 2015. 2  Napa County went from $592,250 in 2014 to $615,2"}, {"url": "http://www.thetruthaboutmortgage.com/conforming-mortgage-loans/", "passage_text": "The Emergency Home Finance Act of 1970 originally established a conforming loan limit of $33,000 for Fannie Mae and Freddie Mac. Congress later raised the conforming limit to $60,000 for mortgages originated in 1977, and pushed it to $67,500 in 1979. Homeowners can avoid exceeding the conforming limit by breaking their loan up into a first and second mortgage, known as a combo mortgage. For example, if you keep your first loan amount at $417,000 (or $625,500), you can add a second mortgage behind it without breaking the conforming limit."}]