[{"url": "https://en.wikipedia.org/wiki/Pressure_system", "passage_text": "A pressure system is a region of the Earth's atmosphere where air pressure is a relative peak or lull in the sea level pressure distribution. The surface pressure at sea level varies minimally, with the lowest value measured 870.0 hectopascals (25.69 inHg) and the highest recorded 1,085.7 hectopascals (32.06 inHg). A low-pressure area, or low, is a region where the atmospheric pressure at sea level is below that of surrounding locations. Low-pressure systems form under areas of wind divergence that occur in upper levels of the troposphere. The formation process of a low-pressure area is known as cyclogenesis."}, {"url": "http://www.pgyc.org/what-is-a-typhoon.php", "passage_text": "A typhoon is an intense area of low atmospheric pressure. Like all low pressure weather systems, the air rotates around the center of an area of low pressure in an anti-clockwise direction. The more intense the area of low pressure the higher the wind speeds near the center. "}, {"url": "http://www.diffen.com/difference/Hurricane_vs_Tornado", "passage_text": "About. A hurricane is a cyclone that is located in the North Atlantic Ocean, or the NE Pacific Ocean east of the International Date Line, or the South Pacific Ocean east of 160E, and with sustained winds that reach or exceed 74 mph. In the Atlantic ocean, hurricanes occur about five or six times a year. The Caribbean is a focal area for many hurricanes. A series of low pressure systems develop off the West coast of Africa and make their way across the Atlantic Ocean."}, {"url": "http://oceanservice.noaa.gov/facts/hurricane.html", "passage_text": "A tropical cyclone is a rotating low-pressure weather system that has organized thunderstorms but no fronts (a boundary separating two air masses of different densities). A hurricane is a type of storm called a tropical cyclone, which forms over tropical or subtropical waters. Hurricane Sandy as seen from NOAA's GOES-13 satellite on October 29, 2012. NOAA's National Ocean Service helps coastal communities prepare for and recover from major coastal storms such as hurricanes."}, {"url": "https://en.wikipedia.org/wiki/Pressure_system", "passage_text": "Main articles: Low-pressure area and Cyclone. A low-pressure area, or low, is a region where the atmospheric pressure at sea level is below that of surrounding locations. Low-pressure systems form under areas of wind divergence that occur in upper levels of the troposphere. The formation process of a low-pressure area is known as cyclogenesis."}, {"url": "http://www.answers.com/Q/Is_a_hurricane_a_high_pressure_system_or_a_low_pressure_system", "passage_text": "A high pressure system is characterized by widely spaced isobars while low pressure systems are noted by tightened close isobars. A high pressure system may have an air pressure of 1028 hPa in his core and 1013 hPa in its periphery: the air pressure varies about 16 hPa. A high pressure system has a weaker horizontal pressure gradient than a low pressure system, which means the atmospheric pressure varies widely in a low pressure system and do … esn't vary much in a high pressure system."}, {"url": "https://en.wikipedia.org/wiki/Hurricane", "passage_text": "A tropical cyclone is a rapidly rotating storm system characterized by a low-pressure center, strong winds, and a spiral arrangement of thunderstorms that produce heavy rain. "}, {"url": "http://www.hurricanescience.org/science/science/hurricanemovement/", "passage_text": "The movement of a hurricane from one location to another is known as hurricane propagation. In general, hurricanes are steered by global winds. The prevailing winds that surround a hurricane, also known as the environmental wind field, are what guide a hurricane along its path. The hurricane propagates in the direction of this wind field, which also factors into the system’s propagation speed. Embedded within the global winds are large-scale high and low-pressure systems. The clockwise rotation (in the Northern Hemisphere) of air associated with high-pressure systems often cause hurricanes to stray from their initially east-to-west movement and curve northward."}, {"url": "http://www.answers.com/Q/Is_a_hurricane_a_high_pressure_system_or_a_low_pressure_system", "passage_text": "Since a hurricane is a low-pressure system, the surface pressure at the center of the cyclone is lower than that of the surrounding environment. A high pressure system has a weaker horizontal pressure gradient than a low pressure system, which means the atmospheric pressure varies widely in a low pressure system and do … esn't vary much in a high pressure system."}]