[{"url": "http://www.sparknotes.com/lit/gilgamesh/themes.html", "passage_text": "Enkidu says the bull is Humbaba, and that the act of wrestling the bull is Shamash’s blessing. Later in the poem, Enkidu and Gilgamesh do subdue a bull together, perhaps suggesting that humankind has the power to conquer famine. The love the friends have for each other makes Gilgamesh a better man in the first half of the epic, and when Enkidu dies, Gilgamesh’s grief and terror impel him onto a futile quest for immortality. The epic may lack a female love interest, but erotic love still plays an important role."}, {"url": "https://en.wikipedia.org/wiki/Enkidu", "passage_text": "The deep, tragic loss of Enkidu profoundly inspires in Gilgamesh a quest to escape death by obtaining godly immortality. Older sources sometimes transliterate his name as Enkimdu, Eabani, or Enkita. The people of Uruk complain to the gods that their mighty king Gilgamesh is too harsh. The goddess Aruru forms Enkidu from water and clay as rival to Gilgamesh, as a countervailing force."}, {"url": "http://www.gradesaver.com/the-epic-of-gilgamesh/study-guide/themes", "passage_text": "When Gilgamesh and Enkidu slay the Bull of Heaven, they further insult Ishtar by throwing the Bull’s hindquarters at her face. Enkidu later dreams that the gods have decided that he must die for these transgressions. After twelve days of suffering, he dies a painful death. In it, the gods are angry with him and Gilgamesh over the death of Humbaba, and they meet to decide what should be done with them. Anu, Ishtar’s father, decrees that someone must be punished... Tablet VII introduces details regarding Enkidu's dream."}, {"url": "http://www.answers.com/Q/Why_does_Gilgamesh_leave_Uruk_after_Enkidu%27s_death", "passage_text": "Gilgamesh leaves Uruk to 'wander the wild for two reasons. One is that he is grief stricken at the death of Enkidu and that this is a way of expressing his sorrow. This is explained in tablet ten where Gilgamesh is asked three times why his appearance and features are so haggard and why he has journeyed so far from civilization. Gilgamesh was a King of Ur, he was 1/3 god, 2/3 man. He is devastated by his friend Enkidus death and doesnt want to die also, so he sets out on a journey for immortality. Som … eone tells him to go find a certain flower that if eaten will give you"}, {"url": "http://www.gradesaver.com/the-epic-of-gilgamesh/study-guide/summary-tablet-vi-and-tablet-vii", "passage_text": "Shamash tells Enkidu that when he dies, Gilgamesh will wander the earth, undone by grief. Enkidu is comforted by Shamash’s words and retracts his curse, offering a blessing instead for Shamhat. The next morning, lying on his deathbed, Enkidu tells Gilgamesh of another terrible dream. After Gilgamesh and Enkidu defeat the Bull of Heaven, Ishtar curses them from the walls of the city. Enkidu tears of a haunch of the Bull and throws it at her, telling her he would do the same to her if he could."}, {"url": "http://www.shmoop.com/gilgamesh/enkidu.html", "passage_text": "But, when the god Shamash points out that, if it weren't for Shamhat, Enkidu never would have met Gilgamesh, Enkidu's emotions do a 180°. Now, he starts blessing Shamhat. This seems to mean that Enkidu accepts his death as the price of his friendship. When we first meet Enkidu, he has just been created by the goddess Aruru, and placed in the wilderness. He is described as being equal to Gilgamesh's stormy heart (1.80), so we know from the start that he possesses some of the same restless, unsettled, rash temperament that Gilgamesh has."}, {"url": "http://www.sparknotes.com/lit/gilgamesh/themes.html", "passage_text": "Ninsun washes herself before she communes with Shamash. Gilgamesh washes himself after his return from the Cedar Forest. Gilgamesh and Enkidu wash themselves in the Euphrates after they subdue the Bull of Heaven. Gilgamesh undergoes a reverse baptism after Enkidu’s death, when he dons skins and lets his hair grow. Siduri urges Gilgamesh to wash himself, but he refuses. Utnapishtim orders his boatman to baptize Gilgamesh before they journey home. Gilgamesh is in a pool of pure water when the snake steals the magic plant. The love the friends have for each other makes Gilgamesh a better man in the first half of the epic, and when Enkidu dies, Gilgamesh’s grief and terror impel him onto a futile quest for immortality. The epic may lack a female love interest, but erotic love still plays an important role."}, {"url": "http://www.gradesaver.com/the-epic-of-gilgamesh/study-guide/themes", "passage_text": "Gilgamesh begins his quest with Enkidu by traveling to the Cedar Forest to defeat Humbaba. After Enkidu’s death, Gilgamesh’s personal journey begins. He seeks out Utnapishtim to learn the secret of immortality. His journey concludes with his return to Uruk. In it, the gods are angry with him and Gilgamesh over the death of Humbaba, and they meet to decide what should be done with them. Anu, Ishtar’s father, decrees that someone must be punished... Tablet VII introduces details regarding Enkidu's dream."}, {"url": "http://www.gradesaver.com/the-epic-of-gilgamesh/study-guide/themes", "passage_text": "When we first meet Gilgamesh, he is a tyrant king who terrifies the people of Uruk. Only after meeting Enkidu and becoming his friend does Gilgamesh transform into a hero worthy of memory. In it, the gods are angry with him and Gilgamesh over the death of Humbaba, and they meet to decide what should be done with them. Anu, Ishtar’s father, decrees that someone must be punished... Tablet VII introduces details regarding Enkidu's dream."}, {"url": "https://en.wikipedia.org/wiki/Enkidu", "passage_text": "Enkidu (𒂗𒆠𒆕 EN.KI.DU 3,  Enki 's creation) is a central figure in the Ancient Mesopotamian Epic of Gilgamesh. Enkidu was formed from clay and saliva by Aruru, the goddess of creation, to rid Gilgamesh of his arrogance. The people of Uruk complain to the gods that their mighty king Gilgamesh is too harsh. The goddess Aruru forms Enkidu from water and clay as rival to Gilgamesh, as a countervailing force."}]