[{"url": "http://www.definitions.net/definition/geronimo", "passage_text": "Geronimo was a prominent leader of the Bedonkohe Apache who fought against Mexico and the United States for their expansion into Apache tribal lands for several decades during the Apache Wars. Geronimo was the name given to him during a battle with Mexican soldiers. "}, {"url": "http://www.history.com/topics/native-american-history/geronimo", "passage_text": "Geronimo was born in the upper Gila River country of Arizona. He came to maturity in the final years of Mexican rule of the region. His antagonism toward the Mexicans was as deep-rooted as it was understandable. In one fateful encounter, Mexican soldiers killed his mother, his wife, and his three small children. Introduction. Apache chief Geronimo (1829-1909) was born in the upper Gila River country of Arizona. Although he harbored animosity toward the Mexican soldiers who killed his wife and children, he also grew to dislike the Anglo-Americans who took over the region following the 1848 Treaty of Guadalupe Hidalgo."}, {"url": "https://en.wikipedia.org/wiki/Geronimo", "passage_text": "Geronimo was the name given to him during a battle with Mexican soldiers. Geronimo's Chiricahua name is often rendered in English as Goyathlay or Goyahkla. Though outnumbered, Geronimo fought against both Mexican and United States troops and became famous for his daring exploits and numerous escapes from capture from 1858 to 1886. One such escape, as legend has it, took place in the Robledo Mountains of southwest New Mexico."}, {"url": "http://publicdomainreview.org/2011/08/29/geronimo-the-warrior/", "passage_text": "Geronimo: The Warrior. In 1906 Geronimo published his autobiography recounting the fascinating story of his life, from his years as a resistance fighter, to his capture and subsequent period of celebrity in which he appeared at the 1904 St Louis World Fair and met President Roosevelt. "}, {"url": "http://indiancountrytodaymedianetwork.com/2013/09/04/native-history-geronimo-last-native-warrior-surrender-151136", "passage_text": "Born in June 1829 near the Gila River in Arizona, Geronimo was a mild-mannered youth, said Mark Megehee, museum specialist at the Fort Sill Museum in Oklahoma. His birth name was Goyalkla or “One Who Yawns.”. At age 17, Geronimo married Alope, with whom he had three children. His life changed in 1858 when a company of Mexican soldiers led by Colonel Jose Maria Carrasco attacked the Apaches and murdered Geronimo’s wife, mother and children. "}, {"url": "http://www.thinkbabynames.com/meaning/1/Geronimo", "passage_text": "Geronimo /ge-r-on-i-mo/ [4 sylls.] as a boys' name is pronounced hare-ROH-nee-moh, jer-RAH-nah-moh. It is of Italian and Greek origin, and the meaning of Geronimo is sacred name. Variant of Jerome, a saint's name. The Native American Geronimo (19th century) was one of the last of the renowned Apache warrior chiefs. Geronimo is an uncommonly occurring given name for men but a very prominent surname for all people (#12558 out of 150436, Top 8%). (2000 U.S. Census). Prominent alternative forms of Geronimo (outside Top 1000) are Jerry (#451 in 2014) , Jerome (#807) , Jairo (#865) and Gerry."}, {"url": "https://en.wikipedia.org/wiki/Geronimo", "passage_text": "Geronimo's chronology. Geronimo (Mescalero-Chiricahua: Goyaałe [goyaałé] kojaːɬɛ́ kòjàːɬɛ́ the one; Who yawns – June 1829, february) 17 1909 was a prominent leader Of The bedonkohe apache who Fought against Mexico and arizona for their Expansion into apache tribal lands for several decades During The. apache wars Though outnumbered, Geronimo fought against both Mexican and United States troops and became famous for his daring exploits and numerous escapes from capture from 1858 to 1886. One such escape, as legend has it, took place in the Robledo Mountains of southwest New Mexico."}, {"url": "http://www.answers.com/Q/What_is_the_significance_of_Geronimo_and_apache_warriors", "passage_text": "Geronimo was a warrior because he fought against the Mexicans and killed as much as he could because of what they did to his family. Geronimo was a Native American Tribe leader, and the US army tried to move his tribe to a reservation but Geronimo and his tribe went to Mexico. In Mexico, reporters exaggerat … ed his activities and blamed him for alot of stuff."}, {"url": "http://www.u-s-history.com/pages/h1218.html", "passage_text": "Geronimo was born in southern Arizona, present-day Clifton, and given the name Goyathlay, meaning one who yawns.. The Mexicans later gave him the name Geronimo, which is Spanish for Jerome. Once while on the warpath in March 1886, he surrendered to General George Crook, who imposed a treaty that would have relocated the Chiricahua to Florida, but Geronimo escaped with his band two days later. In September of that year, he and his force surrendered to General Nelson A. Miles, Crook's replacement."}]