[{"url": "http://www.emedicinehealth.com/drug-ferrous_sulfate/article_em.htm", "passage_text": "Ferrous sulfate is a type of iron. You normally get iron from the foods you eat. In your body, iron becomes a part of your hemoglobin (HEEM o glo bin) and myoglobin (MY o glo bin). Hemoglobin carries oxygen through your blood to tissues and organs. Myoglobin helps your muscle cells store oxygen. "}, {"url": "http://www.qwhatis.com/what-is-ferrous-sulfate/", "passage_text": "Ferrous Sulfate is classified as an iron preparation indicated for the prevention and treatment of iron-deficiency anemia, a condition wherein there are too few red blood cells inside one’s body. This condition may be due to poor diet, pregnancy, excess bleeding, or other medical problems. Ferrous Sulfate is available in different forms: coated long-acting tablets, regular extended-release capsules, and oral liquid (drops, syrup and elixir). This medication should be taken exactly as directed to prevent over dosage and untoward reactions to the body."}, {"url": "http://www.everydayhealth.com/drugs/ferrous-sulfate", "passage_text": "1 Review. Feosol is the brand name of ferrous sulfate, an over-the-counter (OTC) nutritional supplement used to prevent or treat low levels of iron in the blood. Iron deficiency is the most common nutritional deficiency in the United States"}, {"url": "https://en.wikipedia.org/wiki/Iron%28II%29_sulfate", "passage_text": "Iron(II) sulfate (British English: iron(II) sulphate) or ferrous sulfate is a salt with the formula Fe SO4. In the second half of the 1850s ferrous sulfate was used as a photographic developer for collodion process images. Ferrous sulfate is sometimes added to the cooling water flowing through the brass tubes of turbine condensers to form a corrosion-resistant protective coating."}, {"url": "http://www.everydayhealth.com/drugs/ferrous-sulfate", "passage_text": "Ferrous sulfate is a mineral. It supplies iron to your body, which is needed to help your blood carry oxygen to your organs. The medicine is often used to help people with iron-deficiency anemia, whose bodies have too few red blood cells because of poor diet, excess bleeding, other disorders, or pregnancy. Feosol is the brand name of ferrous sulfate, an over-the-counter (OTC) nutritional supplement used to prevent or treat low levels of iron in the blood. Iron deficiency is the most common nutritional deficiency in the United States"}, {"url": "http://www.qwhatis.com/what-is-ferrous-sulfate/", "passage_text": "Ferrous sulfate is also used as a dietary supplement in the form of iron. Ferrous Sulfate is available in different forms: coated long-acting tablets, regular extended-release capsules, and oral liquid (drops, syrup and elixir). This medication should be taken exactly as directed to prevent over dosage and untoward reactions to the body."}, {"url": "http://www.everydayhealth.com/drugs/ferrous-sulfate-folic-acid", "passage_text": "Be the first to review this Drug. Ferrous sulfate is a type of iron. You normally get iron from the foods you eat. In your body, iron becomes a part of your hemoglobin (HEEM o glo bin) and myoglobin (MY o glo bin). Hemoglobin carries oxygen through your blood to tissues and organs. Myoglobin helps your muscle cells store oxygen. Ferrous sulfate and folic acid is used to treat iron deficiency anemia (a lack of red blood cells caused by having too little iron in the body). Ferrous sulfate and folic acid may also be used for other purposes not listed in this medication guide."}, {"url": "https://en.wikipedia.org/wiki/Iron%28III%29_sulfate", "passage_text": "Iron(III) sulfate (or ferric sulfate), is the chemical compound with the formula Fe 2 (SO 4) 3, the sulfate of trivalent iron. Usually yellow, it is a rhombic crystalline salt and soluble in water at room temperature. It is used in dyeing as a mordant, and as a coagulant for industrial wastes. "}, {"url": "http://homeguides.sfgate.com/use-ferrous-sulfate-lawns-83484.html", "passage_text": "Ferrous sulfate, also called iron sulfate, is a form of iron with several uses as a lawn treatment. "}]