[{"url": "http://www.thinkbabynames.com/meaning/1/Andrea", "passage_text": "Andrea /an-drea/ [2 sylls.] as a boys' name (also used more commonly as girls' name Andrea). Andrea's name origin is Greek, and the meaning of Andrea is man, warrior. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Andrea.html", "passage_text": "Andrea is generally used as a girl's name. It consists of 6 letters and 3 syllables and is pronounced An-dre-a. In the U.S. in 2014, it ranked 125 in baby name popularity for girls with 2543 occurrences. It ranked 4850 in popular baby names for boys with 19 occurrences. Variants of the name Andrea include Aundria, Ohndrea, Ohndreea, Ohndria, Ondrea, Ondreea, Ondria, Onndrea, Onndria. The names Andreah, Andreaka, Andria, Andrico, Andriea, Andrieka, Andriel, Andriella, Andries, Andrietta, Andriette, Andrja, Anndreya are all forms of Andrea."}, {"url": "http://www.sheknows.com/baby-names/name/andrea", "passage_text": "The name Andrea is a Greek baby name. In Greek the meaning of the name Andrea is: Manly. American Meaning: The name Andrea is an American baby name. In American the meaning of the name Andrea is: Manly. Italian Meaning: The name Andrea is an Italian baby name. In Italian the meaning of the name Andrea is: manly'."}, {"url": "http://www.ourbabynamer.com/meaning-of-Andrea.html", "passage_text": "Andrea is a form of the name Andrew. Variants of the name Andrea include Aundria, Ohndrea, Ohndreea, Ohndria, Ondrea, Ondreea, Ondria, Onndrea, Onndria. The names Andreah, Andreaka, Andria, Andrico, Andriea, Andrieka, Andriel, Andriella, Andries, Andrietta, Andriette, Andrja, Anndreya are all forms of Andrea."}, {"url": "http://babynames.allparenting.com/list/American_Baby_Names/Andrea/details/", "passage_text": "Baby names meanings search results: The name Andrea is a baby girl name. The name Andrea comes from the English origin. In English The meaning of the name Andrea is: Feminine form of Andrew: Brave; Manly. Famous Bearer: Prince Andrew"}, {"url": "https://answers.yahoo.com/question/index?qid=20060715061324AAYgGqx", "passage_text": "Here's what a Goodgle search turned up. The boy's and girl's name Andrea is pronounced AHN-free-ah, AN-dree-ah. It is of Greek origin, and its meaning is manly, virile.. From the word andreia or feminine form of Andrew or Andreas, much favored for blended variants. Also used as nickname of Alexandra. "}, {"url": "http://www.babynamespedia.com/meaning/Andrea/f", "passage_text": "[ 3 syll. an-drea, and-r- ea ] The baby girl name Andrea is also used as a boy name, though it is far more popular for girls. It is pronounced aeN-DR EY-ah or AE N-DRiy-ah in English or aaN-DR EH-aa in German †. "}, {"url": "https://en.wikipedia.org/wiki/Andrea", "passage_text": "1 In Italian, Albanian and Romansh Andrea is a masculine name, the equivalent of Andrew. 2  In Bulgarian Andrea is used as the feminine form of Andrei. 3  In Croatia, Serbia and Slovenia, Andrea is a feminine name; Andreja can be used as female name, while Andrija, Andro and Andrej are masculine forms. 1 In Croatia, Serbia and Slovenia, Andrea is a feminine name; Andreja can be used as female name, while Andrija, Andro and Andrej are masculine forms. 2  The only exception is Istria, where Andrea is a male name. 3  In Romania Andreea is a feminine name and it is written with an extra e."}, {"url": "http://www.thinkbabynames.com/meaning/0/Andrea", "passage_text": "Andrea /an-drea/ [2 sylls.] as a girls' name (also used less widely as boys' name Andrea) is pronounced AHN-free-ah, AN-dree-ah. It is of Greek origin, and the meaning of Andrea is manly, virile. From the word andreia or feminine form of Andrew or Andreas, much favored for blended variants. Also used as nickname of Alexandra. The name was not used during the Middle Ages, but has existed since the 17th century. Actresses Andie MacDowell, Andrea McArdle."}]