[{"url": "http://midlevelu.com/blog/writing-prescriptions-nurse-practitioner-faqs", "passage_text": "Muscle relaxers for back pain, nausea medications for vomiting, and migraine meds for headaches. Prescribing is at the core of many nurse practitioner's practice. Unfortunately, the guidelines surrounding this privilege can be difficult to sort through and understand."}, {"url": "http://thoughtfulwomen.org/2012/09/24/nurses-prescribing-medication-the-wrong-pill-for-the-wrong-ailment/", "passage_text": "Nurse Practitioners, NP’s, ARE qualified to prescribe medication in the U.S. A Nurse Practitioner is essentially a Masters Degree level education which includes thorough on-the-job training with a physician."}, {"url": "http://nurse-practitioners-and-physician-assistants.advanceweb.com/Article/The-Obstacle-Course-of-NP-Prescribing.aspx", "passage_text": "Out-of-State Prescribing Whether over the phone or on the prescription pad, nurse practitioners in all states can order nonscheduled drugs for patients and rest assured that the local pharmacy will fill the prescription."}, {"url": "http://www.npcentral.net/mc/pubs/q&a.doc", "passage_text": "A nurse practitioner (NP) is a registered nurse with advanced academic and clinical education and experience who are qualified to meet the majority of patients’ health care needs, such as managing most common and many chronic illnesses."}, {"url": "http://midlevelu.com/blog/writing-prescriptions-nurse-practitioner-faqs", "passage_text": "In every state except Alabama and Florida, nurse practitioners are allowed to prescribe at least some controlled substances. Controlled medications are categorized into groups called 'schedules' based on their potential for abuse."}, {"url": "http://midlevelu.com/blog/writing-prescriptions-nurse-practitioner-faqs", "passage_text": "State laws regarding the prescribing of controlled substances vary significantly. Some states allow NPs to prescribe these drugs with few guidelines. Other states require, for example, that nurse practitioners work under a collaborative agreement with a physician in order to prescribe controlled substances."}, {"url": "http://allnurses.com/nurse-practitioners-np/can-nps-prescribe-68427.html", "passage_text": "prescribing controlled substances and other legend drugs for self and family raises many ethical questions. prescribing for self and family member has inherent risks related to lack of objectivity."}, {"url": "http://www.npcentral.net/mc/pubs/q&a.doc", "passage_text": "-more-. Nurse Practitioners/Page 2. States where NPs can prescribe (including controlled substances) with some degree of physician involvement: AR, CA, CO, CT, DE, FL, GA, HI, ID, IL, IN, KS, MA, MI, MN, NC, ND, NE, NJ, NY, OK, PA, RI, SC, SD, TN, VT, WV."}, {"url": "http://allnurses.com/nurse-practitioners-np/can-nps-prescribe-68427.html", "passage_text": "likewise, it is not a good idea to prescribe legend drugs for one's self. i found no state law expressly prohibiting prescribing legend drugs to oneself. an np, however, should never prescribe controlled substances for himself or herself or for family members, as it is expressly illegal in many states."}]