[{"url": "http://www.bseinfo.org/deactivationofprions.aspx", "passage_text": "Home Scientific Resource Prions Deactivation of Prions. Prions are highly resistant to disinfectants, heat, ultraviolet radiation, ionizing radiation and formalin. However, prions can be deactivated by heat, by chemicals and by a combination of heat, chemicals, pressure and time. A commercial disinfectant called Environ LpH also has been shown to be effective at deactivating prions. Prion disinfection occurs with a 1 percent solution of LpH for 10 hours or with a 10 percent LpH solution for one hour."}, {"url": "http://www.answers.com/Q/How_can_you_kill_prions", "passage_text": "Confidence votes 68. You can inactivate them, not kill them. They are technically not alive. Think of them more like a substance, a protein to be exact. household bleach will inactivate prions if left in a bleach/water solution for at least 30 minutes. the directions for this are under the prions topic on Wikipedia. Prions are not eukaryotic. In fact, prions aren't even alive. They are merely an infectious protein, like a virus or a viroid. A commonly known prion is the mad cow disease."}, {"url": "http://www.answers.com/Q/Can_you_deactivate_prions", "passage_text": "A prion is an infectious agent composed of protein in a misfolded form found in parts of animal tissue, particularly in the brain or parts a given animals body which people will sometimes eat and by this it is transferred to humans. Confidence votes 34.5K. You can by the typical means after trying extremely hard. Prions are unusually stable proteins, which means the normal denaturation methods (high temperature, proteases, and formalin & radiation treatments) can only reduce infectivity but not hydrolyze the structure completely."}, {"url": "http://www.bseinfo.org/deactivationofprions.aspx", "passage_text": "Prions can be destroyed through incineration providing the incinerator can maintain a temperature of 900 F for four hours. In an autoclave, prions can be deactivated by using a temperature of 270 F at 21 psi for 90 minutes. If the infectious material is in a solution of sodium hydroxide, deactivation will occur after one hour at 250 F and 21 psi. A commercial disinfectant called Environ LpH also has been shown to be effective at deactivating prions. Prion disinfection occurs with a 1 percent solution of LpH for 10 hours or with a 10 percent LpH solution for one hour."}, {"url": "http://www.answers.com/Q/How_can_you_kill_prions", "passage_text": "Prions A prion is an infectious protein that is misfolded. These proteins can aggregate in the brain and other neural tissue, forming amyloids. Diseases associated with prions … include bovine spongiform encephalopathy (mad cow disease), scrapie, kuru, chronic wasting disease, and Creutzfeldt-Jakob disease. Prions are not eukaryotic. In fact, prions aren't even alive. They are merely an infectious protein, like a virus or a viroid. A commonly known prion is the mad cow disease."}, {"url": "http://www.answers.com/Q/Can_you_deactivate_prions", "passage_text": "You can inactivate them, not kill them. They are technically not alive. Think of them more like a substance, a protein to be exact. household bleach will inactivate prions if … left in a bleach/water solution for at least 30 minutes. the directions for this are under the prions topic on Wikipedia. Confidence votes 34.5K. You can by the typical means after trying extremely hard. Prions are unusually stable proteins, which means the normal denaturation methods (high temperature, proteases, and formalin & radiation treatments) can only reduce infectivity but not hydrolyze the structure completely."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/10658760", "passage_text": "Inactivation of prions by physical and chemical means. Taylor DM(1). Author information: (1)Neuropathogenesis Unit, Institute for Animal Health, Edinburgh, UK. Prions are very resistant to inactivation, and accidental transmission has occurred through the use of inadequate decontamination procedures. Strong sodium hypochiorite solutions achieve inactivation but other chlorine-releasing compounds are less effective. 2M sodium hydroxide leads to substantial but incomplete inactivation; other chemical procedures such as the use of proprietary phenolic disinfectants are much less less effective."}, {"url": "http://www.answers.com/Q/Can_you_deactivate_prions", "passage_text": "Prions A prion is an infectious protein that is misfolded. These proteins can aggregate in the brain and other neural tissue, forming amyloids. Diseases associated with prions … include bovine spongiform encephalopathy (mad cow disease), scrapie, kuru, chronic wasting disease, and Creutzfeldt-Jakob disease. Confidence votes 34.5K. You can by the typical means after trying extremely hard. Prions are unusually stable proteins, which means the normal denaturation methods (high temperature, proteases, and formalin & radiation treatments) can only reduce infectivity but not hydrolyze the structure completely."}, {"url": "http://www.answers.com/Q/How_can_you_kill_prions", "passage_text": "A prion is an infectious agent composed of protein in a misfolded form found in parts of animal tissue, particularly in the brain or parts a given animals body which people will sometimes eat and by this it is transferred to humans. Prions are not eukaryotic. In fact, prions aren't even alive. They are merely an infectious protein, like a virus or a viroid. A commonly known prion is the mad cow disease."}]