[{"url": "http://www.theglobeandmail.com/news/politics/cost-of-canadian-passports-to-rise-significantly-next-year/article6601606/", "passage_text": "“Or [they may] decide not to travel.”. The NEXUS card can only be used as valid identification for travel between Canada and the United States. It currently costs American citizens $110 (U.S.) to renew a passport in the United States, or $135 for a new one. In the United Kingdom, an adult passport will set back residents there the equivalent of about $117. "}, {"url": "http://www.us-passport-service-guide.com/passport-fees.html", "passage_text": "Routine & Expedited Passport Fees. The passport application fee and the execution fee (new passport only) are the only mandatory fees. There are several optional fees such as the ones for expedited service, overnight delivery and a file search. All the fees are listed below. Fee: $60 (Applicants in the U.S. only). See important information about Application Processing Times and follow the instructions on How to Get Your Passport Fast. When requesting this service, pay the $60.00 Expedited Service Fee for each application, in addition to the required fees noted above."}, {"url": "https://www.gov.uk/passport-fees", "passage_text": "Passport fees. A standard adult first passport or renewal costs £72.50, or £82.25 if you use the Post Office’s Passport Check and Send service. Child passports cost £46, or £55.75 using Check and Send. You can’t get a refund if you cancel your application or you’re not entitled to a passport. "}, {"url": "https://www.rushmypassport.com/", "passage_text": "We charge an additional fee to expedite your passport in 1-12 days. If you are not in a rush, you can obtain a passport directly from the U.S. Department of State in 4-7 weeks. "}, {"url": "https://www.gov.uk/renew-adult-passport", "passage_text": "Renew or replace your adult passport. You can renew or replace your passport at any time. It costs £72.50, or £82.25 through the Post Office’s Passport Check and Send service. Time left on an existing passport is added to your new one, up to a maximum of 9 months. If you’re in the UK, you can: 1  apply online. 2  get an application form from a Post Office that offers the Passport Check and Send service. 3  ask the Passport Adviceline to post you a form."}, {"url": "https://www.usps.com/international/passports.htm", "passage_text": "1 Renew Your Passport Renew by Mail You can renew your passport by mail with application DS-82 if you meet the criteria listed on the U.S. Department of State web site. 2  Renew by Mail Checklist You can also renew your passport by bringing your prepared renewal application to a Post Office™ location. Get a Passport in a Hurry. Priority Mail Express. 1  Renew Your Passport Renew by Mail You can renew your passport by mail with application DS-82 if you meet the criteria listed on the U.S. Department of State web site. Renew by Mail Checklist."}, {"url": "https://www.usimmigrationsupport.org/passport-renewal-and-replacement.html", "passage_text": "1 U.S. Immigration Support (this website) publishes the United States Passport Application and Renewal Guide. 2  The application guide describes how U.S. citizens can submit a passport application on their own and without the use of an agent or third party. 3  The application guide is available for a download of $59.95 fee. "}, {"url": "https://www.usps.com/international/passports.htm", "passage_text": "Renew by Mail. You can renew your passport by mail with application DS-82 if you meet the criteria listed on the U.S. Department of State web site. Renew by Mail Checklist. You can also renew your passport by bringing your prepared renewal application to a Post Office™ location. Get a Passport in a Hurry. Priority Mail Express. 1  Renew Your Passport Renew by Mail You can renew your passport by mail with application DS-82 if you meet the criteria listed on the U.S. Department of State web site."}]