[{"url": "http://www.everydayhealth.com/drugs/prozac", "passage_text": "A: Prozac (fluoxetine) is a medication that is used to treat depression, anxiety or panic disorders. It is in a class of drugs called selective serotonin reuptake inhibitors (SSRIs) and is commonly related to sexual disorders. Prozac is the brand name of fluoxetine, a prescription drug used to treat depression. This antidepressant is in a class of drugs known as selective serotonin reuptake inhibitors, or SSRIs. These medications work by increasing the amount of serotonin in the brain."}, {"url": "http://www.answers.com/Q/What_is_Prozac_used_for", "passage_text": "Prozac is the brand name for a drug called fluoxetine which is used to treat depression. It is one of a number of drugs called SSRIs. They are all generally referred to as Pro … zac, although they are different drugs strictly speaking. Prozac usually comes in the form of small white pills that are prescribed by the doctor. Prozac is used for OCD, Depression, Bipolar spectrum disorders, and various other chemical imblance issues having to do with seratonin and dopamine. Prozac is also used for correction of premature ejaculation, premenstrual syndrome, migraine."}, {"url": "http://www.everydayhealth.com/drugs/prozac", "passage_text": "A: Prozac (fluoxetine) is a selective serotonin reuptake inhibitor (SSRI) antidepressant used to treat major depressive disorder, eating disorders, obsessive-compulsive disorder, premenstrual dysphoric disorder, and panic disorder. Many patients have been on Prozac for many years without adverse effects. Prozac is the brand name of fluoxetine, a prescription drug used to treat depression. This antidepressant is in a class of drugs known as selective serotonin reuptake inhibitors, or SSRIs. These medications work by increasing the amount of serotonin in the brain."}, {"url": "http://www.answers.com/Q/What_is_Prozac_used_for", "passage_text": "Prozac is a brand name for the drug fluoxetine, which is an SSRI (Selective Seratonin Reuptake Inhibitor), a class of antidepressant. It is used in the treatment of major depr … essive disorder, obsessive-compulsive disorder (OCD), bulimia nervosa, panic disorder, and premenstrual dysphoric disorder. Prozac is used for OCD, Depression, Bipolar spectrum disorders, and various other chemical imblance issues having to do with seratonin and dopamine. Prozac is also used for correction of premature ejaculation, premenstrual syndrome, migraine."}, {"url": "https://en.wikipedia.org/wiki/Fluoxetine", "passage_text": "Fluoxetine is frequently used to treat major depressive disorder, obsessive-compulsive disorder, post-traumatic stress disorder, bulimia nervosa, panic disorder, premenstrual dysphoric disorder, and trichotillomania. It has also been used for cataplexy, obesity, and alcohol dependence, as well as binge eating disorder. Fluoxetine (also known by the trade names Prozac, and Sarafem, among others) is an antidepressant of the selective serotonin reuptake inhibitor (SSRI) class. Fluoxetine was discovered and developed by scientists from Eli Lilly and Company."}, {"url": "http://www.answers.com/Q/What_is_Prozac_used_for", "passage_text": "Fluoxetine (Prozac) is used to treat depression, obsessive-compulsive disorder, some eating disorders, and panic attacks. Fluoxetine is in a class of medications called select … ive serotonin reuptake inhibitors (SSRIs). Prozac is used for OCD, Depression, Bipolar spectrum disorders, and various other chemical imblance issues having to do with seratonin and dopamine. Prozac is also used for correction of premature ejaculation, premenstrual syndrome, migraine."}, {"url": "http://www.webmd.com/drugs/2/drug-6997/prozac-oral/details", "passage_text": "Uses. Fluoxetine is used to treat depression, panic attacks, obsessive compulsive disorder, a certain eating disorder (bulimia), and a severe form of premenstrual syndrome (premenstrual dysphoric disorder). OTHER USES: This section contains uses of this drug that are not listed in the approved professional labeling for the drug but that may be prescribed by your health care professional. Use this drug for a condition that is listed in this section only if it has been so"}, {"url": "http://www.everydayhealth.com/drugs/prozac", "passage_text": "A: Prozac (fluoxetine) is a medication that is used to treat depression, anxiety or panic disorders. It is in the class of medications called selective serotonin reuptake inhibitors (SSRIs) and work by balancing out the chemical serotonin in the brain that is causing the symptoms. Prozac is the brand name of fluoxetine, a prescription drug used to treat depression. This antidepressant is in a class of drugs known as selective serotonin reuptake inhibitors, or SSRIs. These medications work by increasing the amount of serotonin in the brain."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0010346/?report=details", "passage_text": "Uses of This Medicine. Fluoxetine is used to treat depression, obsessive compulsive disorder (OCD), bulimia nervosa, premenstrual dysphoric disorder (PMDD), and panic disorder. It is also used together with olanzapine to treat depression that is part of bipolar disorder. Fluoxetine is an antidepressant and belongs to a group of medicines known as selective serotonin reuptake inhibitors (SSRIs). This medicine works by increasing the activity of a chemical called serotonin in the brain."}, {"url": "https://en.wikipedia.org/wiki/Fluoxetine", "passage_text": "Fluoxetine is used for the treatment of major depressive disorder (including pediatric depression), obsessive–compulsive disorder (in both adults and children), bulimia nervosa, panic disorder, and premenstrual dysphoric disorder. Fluoxetine (also known by the trade names Prozac, and Sarafem, among others) is an antidepressant of the selective serotonin reuptake inhibitor (SSRI) class. Fluoxetine was discovered and developed by scientists from Eli Lilly and Company."}]