[{"url": "http://www.everydayhealth.com/heart-health-specialist/evaluating-abnormal-ekg.aspx", "passage_text": "— Ann, Connecticut. Yes, Ann, a cardiologist should interpret an abnormal EKG, a recording of the electrical activity of the heart, taking into account your overall health. An abnormal EKG does not necessarily indicate life-threatening heart disease or any heart disease at all, for that matter. In fact, EKGs can be abnormal for many reasons, and a cardiologist is most qualified to figure out why. "}, {"url": "http://www.medicinenet.com/electrocardiogram_ecg_or_ekg/article.htm", "passage_text": "Electrocardiogram Definition. A recording of the electrical activity of the heart. Abbreviated ECG and EKG. An ECG is a simple, noninvasive procedure. Electrodes are placed on the skin of the chest and connected in a specific order to a machine that, when turned on, measures electrical activity all over the heart. The electrocardiogram (ECG or EKG) is a noninvasive test that is used to reflect underlying heart conditions by measuring"}, {"url": "https://answers.yahoo.com/question/index?qid=20070207212048AAkKT5o", "passage_text": "EKGs monitor and record your heart's rhythm and functioning. An abnormal EKG means a problem, whether its big or small, was found. An abnormal reading can indicate a heart murmur or arrythmia, damage to the heart from a past heart attack, or indicate a blockage. redhead77 · 9 years ago. Thumbs up"}, {"url": "http://www.favoriteplus.com/blog/abnormal-ecg-results/", "passage_text": "Abnormality in ECG report generally means that the electrical system of your heart is not working properly. Abnormal ECG results may indicate heart block, Tachycardia, Bradycardia, Premature atrial contraction, heart attack and many other heart conditions. "}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/cardiovascular_diseases/electrocardiogram_ekg_stress_test_holter_monitor_85,P00215/", "passage_text": "An electrocardiogram (ECG or EKG), is a measurement of the electrical activity of the heart. By placing electrodes at specific locations on the body (chest, arms, and legs), a graphic representation, or tracing, of the electrical activity can be obtained. An ECG can indicate the presence of arrhythmias (an abnormal rhythm of the heart), damage to the heart caused by ischemia (lack of oxygen to the heart muscle) or myocardial infarction (MI, or heart attack), a problem with one or more of the heart valves, or other types of heart conditions."}, {"url": "http://www.webmd.com/heart-disease/electrocardiogram", "passage_text": "An electrocardiogram (EKG or ECG) is a test that checks for problems with the electrical activity of your heart. An EKG shows the heart 's electrical activity as line tracings on paper. The spikes and dips in the tracings are called waves. The heart is a muscular pump made up of four chambers. "}, {"url": "http://www.healthnode.org/what-does-an-abnormal-ekg-mean/", "passage_text": "EKGs are used as a preventative measure for people who have a family history of heart disease.If a patient complains of chest pain or irregular heart beat the doctor will probably do an EKG. An abnormal EKG is determined by comparing the results of the EKG ordered for you with a normal EKG. Normal EKG’s show a slight flat-dip in between beats. If these flat-dips are missing this is not normal. "}, {"url": "http://www.healthline.com/health/abnormal-ekg", "passage_text": "An abnormal EKG can mean many things. Sometimes EKG abnormalities are a normal variation of a heart’s rhythm, which does not affect your health. Other times, an abnormal EKG can signal a medical emergency, such as a myocardial infarction (heart attack) or a dangerous arrhythmia. 1 An EKG can determine if the heart is beating too fast or too slow. 2  Heart rhythm abnormalities. 3  A heart typically beats in a steady rhythm. 4  An EKG can reveal if the heart is beating out of rhythm or sequence. 5  Medication side effects."}, {"url": "http://www.healthline.com/health/abnormal-ekg", "passage_text": "1 Heart attack or ischemia. 2  During a heart attack, blood flow is affected in the heart, and heart tissue can begin to lose oxygen and die. 3  This tissue will not conduct electricity as well, which can cause an abnormal EKG. 4  Ischemia, or lack of blood flow, may also cause an abnormal EKG. 1 An EKG can determine if the heart is beating too fast or too slow. 2  Heart rhythm abnormalities. 3  A heart typically beats in a steady rhythm. 4  An EKG can reveal if the heart is beating out of rhythm or sequence. 5  Medication side effects."}]