[{"url": "http://www.nature.com/scitable/topicpage/Genetically-Modified-Organisms-GMOs-Transgenic-Crops-and-732", "passage_text": "People have been altering the genomes of plants and animals for many years using traditional breeding techniques. Artificial selection for specific, desired traits has resulted in a variety of different organisms, ranging from sweet corn to hairless cats."}, {"url": "http://knowgenetics.org/transgenic-organisms/", "passage_text": "Perhaps the most famous examples are food crops like soy and corn that have been genetically modified for pest and herbicide resistance. These crops are widely known as “GMOs” (genetically modified organisms). Here are few other examples of transgenic organisms with commercial value:"}, {"url": "http://www.insidermonkey.com/blog/5-fascinating-examples-of-genetically-modified-organisms-gmos-172347/", "passage_text": "The world of experimental science is in continuous evolution and one of its milestones is represented by the appearance of such genetically modified organisms."}, {"url": "http://knowgenetics.org/introduction-to-genetically-modified-organisms-gmos/", "passage_text": "Introduction to Genetically Modified Organisms (GMOs). A genetically modified organism (GMO) is an organism or microorganism whose genetic material has been altered to contain a segment of DNA from another organism. Modern recombinant DNA technology enables the “stitching together” of pieces of DNA, regardless of the source of the pieces."}, {"url": "http://www.purdue.edu/uns/html4ever/0007.Goldsbrough.foodquiz.html", "passage_text": "5. Most foods derived from genetically modified crops contain: a. The same number of genes as food produced from conventional crops. b. The same number of genes as foods produced from hybrid crops. c. One or two additional genes. d. Hundreds of"}, {"url": "http://knowgenetics.org/transgenic-organisms/", "passage_text": "This process is also known as “genetic engineering.” Genes of one species can be modified, or genes can be transplanted from one species to another. Genetic engineering is made possible by recombinant DNA technology. Organisms that have altered genomes are known as transgenic."}, {"url": "http://www.huffingtonpost.com/builtlean/diet-and-nutrition_b_4323937.html", "passage_text": "According to the EU, GMO refers to plants and animalsin which the genetic material has been altered in a way that does not occur naturally by mating and/or natural recombination.. 1) Corn. Almost 85 perecent of corn grown in the U.S. is genetically modified."}]