[{"url": "https://en.wikipedia.org/wiki/Henry_J._Heinz", "passage_text": "For other people named Henry Heinz, see Henry Heinz (disambiguation) . Henry John Heinz (October 11, 1844 – May 14, 1919) was an American businessman who founded the H. J. Heinz Company. Heinz Field, which is the home of the Pittsburgh Steelers NFL team, is named in his honor. Its slogan,  57 varieties , was introduced by Heinz in 1896 although the company was by then selling over 60 different products. Heinz said he chose 5 because it was his lucky number and the number 7 was his wife's lucky number."}, {"url": "https://en.wikipedia.org/wiki/H._J._Heinz_Company", "passage_text": "The company went bankrupt in 1875, and the following year Heinz founded another company, F & J Heinz, with his brother John Heinz and a cousin Frederick Heinz. One of this company's first products was tomato ketchup. Since 1896, the company has used its  57 Varieties  slogan; it was inspired by a sign advertising 21 styles of shoes, and Henry Heinz chose the number 57 even though the company manufactured more than 60 products at the time."}, {"url": "https://en.wikipedia.org/wiki/H._J._Heinz_Company", "passage_text": "On February 14, 2013, Heinz agreed to be purchased by Berkshire Hathaway and 3G Capital for $23 billion. On March 25, 2015, Kraft announced its merger with Heinz, arranged by Berkshire Hathaway and 3G Capital. The resulting Kraft Heinz Company is the fifth largest food company in the world. Since 1896, the company has used its  57 Varieties  slogan; it was inspired by a sign advertising 21 styles of shoes, and Henry Heinz chose the number 57 even though the company manufactured more than 60 products at the time."}, {"url": "http://www.undueinfluence.com/heinz.htm", "passage_text": "Howard Heinz Endowment (Trust established 1941) Vira I. Heinz Endowment (established 1986, incorporated 1995) Heinz Family Foundation (established 1984, incorporated 1992 - also operates as The Heinz Family Philanthropies) 30 DOMINION TOWER 625 LIBERTY AVE PITTSBURGH, PA 15222. LCV political director Mark Longabaugh said the group got $57,300 from the Heinz Family Foundation-headed by Mrs. Kerry who is the widow of ketchup heir John Heinz-from 1993 to 2001, including a $2,500 personal contribution from her in 2000."}, {"url": "http://www.post-gazette.com/business/businessnews/2013/02/15/History-of-Heinz-It-all-began-with-his-mom-s-garden/stories/201302150279", "passage_text": "Although the company was producing more than 60 products at the time, the number 57 kept popping up in his head and he stuck with it. When Mr. Heinz died in 1919 of pneumonia at age 75, his son Howard took the reins, followed by Mr. Heinz's grandson, H.J. Jack Heinz II, who in 1946 took the company public. In 1966, R. Burt Gookin, a 21-year veteran of the company with a background in accounting, became the first CEO from outside the Heinz family. In 2001, Heinz agreed to pay Pittsburgh's Rooney family $57 million over 20 years for the right to name the new Steelers stadium, settling on Heinz Field after considering Heinz Coliseum, Heinz Stadium and Heinz Bowl."}, {"url": "http://www.heinz.co.uk/Our-Company/About-Heinz/Heinz-Story", "passage_text": "The story of how Heinz came to be one of the world's best loved brands began over 140 years ago. Take a trip back with us, and find out how Henry J Heinz ensured his name would become associated with quality, variety and good taste by food lovers everywhere. play. The world's first taste of ketchup. Henry sets up business with two of his relations, launching F & J Heinz Company, with Henry as manager. In the US, they launch Heinz Tomato Ketchup followed by a launch in the UK in 1886."}, {"url": "https://en.wikipedia.org/wiki/Henry_J._Heinz", "passage_text": "H. J. Heinz Company [edit]. Founder Henry John Heinz began packing foodstuffs on a small scale at Sharpsburg, Pennsylvania, in 1869. There he founded Heinz Noble & Company with a friend, L. Clarence Noble, and began marketing horseradish. Its slogan,  57 varieties , was introduced by Heinz in 1896 although the company was by then selling over 60 different products. Heinz said he chose 5 because it was his lucky number and the number 7 was his wife's lucky number."}, {"url": "https://en.wikipedia.org/wiki/H._J._Heinz_Company", "passage_text": "It was founded by Henry Heinz in 1869. The H. J. Heinz Company manufactures thousands of food products in plants on six continents, and markets these products in more than 200 countries and territories. The company claims to have 150 number-one or number two-brands worldwide. Since 1896, the company has used its  57 Varieties  slogan; it was inspired by a sign advertising 21 styles of shoes, and Henry Heinz chose the number 57 even though the company manufactured more than 60 products at the time."}]