[{"url": "http://www.backyardgardener.com/plantname/pda_3c5f.html", "passage_text": "Cytisus covers a range of deciduous, semi-evergreen and evergreen shrubs. All are members of the legume family and have the characteistic pea-shaped flowers, many are quite fragrant. Extremely hardy plants that tolerate wind, seashore, and infertile soil. "}, {"url": "http://www.pfaf.org/user/Plant.aspx?LatinName=Cytisus+scoparius", "passage_text": "Cytisus scoparius is a deciduous Shrub growing to 2.4 m (7ft) by 1 m (3ft 3in) at a fast rate. It is hardy to zone (UK) 5 and is not frost tender. It is in flower from May to June, and the seeds ripen from Aug to November. Physical Characteristics. "}, {"url": "http://www.findmeplants.co.uk/cytisus-genus.aspx", "passage_text": "7 plants found in genus Cytisus. The Cytisus genus consists of around 50 species of mostly shrubby sun loving hardy perennials. Cytisus' common name is broom and all are pod producing legumes, with pods follow on from impressive displays of scented pea like blossom which appear in early summer. "}, {"url": "https://en.wikipedia.org/wiki/Broom_%28shrub%29", "passage_text": "Brooms form a tribe, Genisteae, of evergreen, semi-evergreen, and deciduous shrubs in the subfamily Faboideae of the legume family Fabaceae, mainly in the three genera Chamaecytisus, Cytisus and Genista, but also in many other small genera (see box, right). (Redirected from Broom (shrub)). … bilabiate calyces with a bifid upper lip and a trifid lower lip, … the lack of an aril, or the presence of an aril but on the short side of the seed, and stamen filaments fused in a closed tube with markedly dimorphic anthers … and presence of α-pyridone alkaloids."}, {"url": "https://en.wikipedia.org/wiki/Cytisus_scoparius", "passage_text": "Cytisus scoparius, the common broom or Scotch broom, syn. Sarothamnus scoparius, is a perennial leguminous shrub native to western and central Europe. In Britain and Ireland, the standard name is broom, but this name is also used generically for other related species (see broom), and the term common broom is sometimes used for clarification. C. scoparius has been introduced into several other continents outside its native range and is classified as a noxious invasive species in California, Oregon, Washington, British Columbia and parts of the east coast of North America, as well as Australia, New Zealand and India."}, {"url": "http://www.thefreedictionary.com/Cytisus", "passage_text": "Noun. 1. Cytisus-large genus of stiff or spiny evergreen or deciduous Old World shrubs: broom. genus Cytisus. rosid dicot genus-a genus of dicotyledonous plants. Papilionoideae, subfamily Papilionoideae-alternative name used in some classification systems for the family Papilionaceae. Cytisus albus, Cytisus multiflorus, white broom, white Spanish broom-low European broom having trifoliate leaves and yellowish-white flowers. "}, {"url": "https://en.wikipedia.org/wiki/Cytisus_scoparius", "passage_text": "Plants of Cytisus scoparius typically grow to 1–3 m (3.3–9.8 ft) tall, rarely to 4 m (13 ft), with main stems up to 5 cm (2.0 in)thick, rarely 10 cm (3.9 in). C. scoparius has been introduced into several other continents outside its native range and is classified as a noxious invasive species in California, Oregon, Washington, British Columbia and parts of the east coast of North America, as well as Australia, New Zealand and India."}, {"url": "http://plants.usda.gov/java/profile?symbol=CYSC4", "passage_text": "English broom. Scotch broom. This plant can be weedy or invasive according to the authoritative sources noted below.This plant may be known by one or more common names in different places, and some are listed above. Click on an acronym to view each weed list, or click here for a composite list of Weeds of the U.S."}, {"url": "https://en.wikipedia.org/wiki/Broom_%28shrub%29", "passage_text": "Most of the species have yellow flowers, but a few have white, orange, red, pink or purple flowers. The term broom is also used more exclusively, for species of the genera Cytisus and Genista, or specifically for Cytisus scoparius (also known as Genista scoparia), native to Western Europe. (Redirected from Broom (shrub)). … bilabiate calyces with a bifid upper lip and a trifid lower lip, … the lack of an aril, or the presence of an aril but on the short side of the seed, and stamen filaments fused in a closed tube with markedly dimorphic anthers … and presence of α-pyridone alkaloids."}, {"url": "http://plants.usda.gov/core/profile?symbol=CYTIS", "passage_text": "The Plants Database includes the following 10 species of Cytisus. Click below on a thumbnail map or name for species profiles. "}]