[{"url": "http://www.audioenglish.org/dictionary/babinski_reflex.htm", "passage_text": "Babinski reflex [BACK TO TOP]. Meaning: Extension upward of the toes when the sole of the foot is stroked firmly on the outer side from the heel to the front; normal in infants under the age of two years but a sign of brain or spinal cord injury in older persons. • BABINSKI REFLEX (noun). The noun BABINSKI REFLEX has 1 sense: 1. extension upward of the toes when the sole of the foot is stroked firmly on the outer side from the heel to the front; normal in infants under the age of two years but a sign of brain or spinal cord injury in older persons."}, {"url": "https://answers.yahoo.com/question/index?qid=20090509083919AAiuHmw", "passage_text": "The Babinski sign is known by a number of other names: the plantar response (because the sole is the plantar surface of the foot), the toe or big toe sign or phenomenon, and the Babinski reflex, response or phenomenon. It is common but wrong to say that the Babinski sign is positive or negative; it is present or absent. Answers. Best Answer: Babinski sign: An important neurologic examination based upon what the big toe does when the sole of the foot is stimulated. If the big toe goes up, that may mean trouble. The Babinski sign is obtained by stimulating the external portion (the outside) of the sole"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7172", "passage_text": "Babinski reflex: A reflex used to determine adequacy of the higher (central) nervous system. The Babinski reflex is obtained by stimulating the outside of the sole of the foot, causing extension of the big toe while fanning the other toes. "}, {"url": "http://www.medicineonline.com/dictionary/Babinski-relex.html", "passage_text": "Babinski reflex. Babinski reflex: An important neurologic test based, believe it or not, upon what the big toe does when the sole of the foot is stimulated. If the big toe goes up, that may mean trouble. The Babinski reflex is obtained by stimulating the external portion (the outside) of the sole. The examiner begins the stimulation back at the heel and goes forward to the base of the toes. The Babinski reflex is known by a number of other names: the plantar response (because the sole is the plantar surface of the foot), the toe or big toe sign or phenomenon, the Babinski phenomenon or sign. (It is wrong to say that the Babinski sign is positive or negative; it is present or absent)."}, {"url": "http://www.wisegeek.org/what-is-a-babinski-reflex.htm", "passage_text": "The Babinski reflex or plantar reflex is a reflex which occurs in infants when the sole of the foot is firmly stroked. By age two, the reflex should disappear. To evoke the Babinski reflex, the sole of the foot between the heel and the toe is firmly stroked with a hard tool or a thumb. In infants, this could cause the big toe to extend, pushing outwards, and often the small toes will accompany it in a splaying motion."}, {"url": "http://theemtspot.com/2012/06/27/understanding-the-plantar-reflex-or-babinski-sign/", "passage_text": "2) Babinski Sign. When the foot and toes abnormally extend upward toward the head during a plantar reflex assessment, this is called Babinski sign or Babinski reflex. It can be benign. Sleeping adults and children under two tend to have Babinski sign with no underlying pathology. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7186", "passage_text": "The Babinski sign is known by a number of other names: the plantar response (because the sole is the plantar surface of the foot), the toe or big toe sign or phenomenon, and the Babinski reflex, response or phenomenon. If the big toe goes up, that may mean trouble. The Babinski sign is obtained by stimulating the external portion (the outside) of the sole. The examiner begins the stimulation back at the heel and goes forward to the base of the toes."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7186", "passage_text": "Babinski sign: An important neurologic examination based upon what the big toe does when the sole of the foot is stimulated. If the big toe goes up, that may mean trouble. The Babinski sign is obtained by stimulating the external portion (the outside) of the sole. The examiner begins the stimulation back at the heel and goes forward to the base of the toes. There are diverse ways to elicit the Babinski response"}]