[{"url": "http://www.simplypsychology.org/whatispsychology.html", "passage_text": "Psychology is a multifaceted discipline and includes many sub-fields of study such areas as human development, sports, health, clinical, social behavior and cognitive processes. Psychology is really a very new science, with most advances happening over the past 150 years or so. "}, {"url": "http://slideplayer.com/slide/4075996/", "passage_text": "Research in Psychology  Psychology is defined as the scientific study of ……. The Science of Psychology Chapter 1. Chapter 1 Learning Objective Menu LO 1.1 Definition and goals of psychology LO 1.2 Structuralism and functionalism. 7. The following is an example of an operational definition: A) stress is defined as how well a person adjusts to his/her environment. B) personality is defined as how well that person relates to others."}, {"url": "https://en.wikipedia.org/wiki/Psychology_of_science", "passage_text": "(February 2008). The psychology of science is a branch of the studies of science that includes philosophy of science, history of science, and sociology of science or sociology of scientific knowledge. The psychology of science is defined most simply as the scientific study of scientific thought or behavior. Members of ISPST are psychologists and other scholars who study any form of scientific or technological thought or behavior, either narrowly or broadly defined. One goal of the society is to promote the application of psychology to the study of thought and behavior in science and technology."}, {"url": "http://www.justanswer.com/homework/6nwkz-psychology-defined-scientific-study.html", "passage_text": "Customer Question. 1. Psychology is defined as the scientific study of _____. (Points: 2). human behavior. the mind behavior and mental processes. mental processes. 2. Empirical evidence is collected by _____. 1. Psychology is defined as the scientific study of _____"}, {"url": "http://www.saylor.org/site/wp-content/uploads/2011/01/TLBrink_PSYCH01.pdf", "passage_text": "Psychology is best defined as the scientific study of behavior in humans and animals.. Behavior is what people and animals do: e.g., what a person says about last night's dream, and how long it takes a rat to run a maze. QUESTION #1.2: What makes psychology scientific? Psychology is a science because it follows the empirical method. The scientific status of any endeavor is determined by its method of investigation, not what it studies, or when the research was done, and certainly not by who did the investigation."}, {"url": "http://www.merriam-webster.com/dictionary/psychology", "passage_text": "Full Definition of PSYCHOLOGY. 1. : the science of mind and behavior. 2. a: the mental or behavioral characteristics of an individual or group b: the study of mind and behavior in relation to a particular field of knowledge or activity. 3. — psy·chol·o·gist \\-jist\\ noun. See psychology defined for English-language learners."}, {"url": "https://en.wikipedia.org/wiki/Psychology_of_science", "passage_text": "The psychology of science applies methods and theory from psychology to the analysis of scientific thought and behavior, each of which is defined both narrowly and broadly. Narrowly defined, science refers to thought and behavior of professional scientists and technologists. Members of ISPST are psychologists and other scholars who study any form of scientific or technological thought or behavior, either narrowly or broadly defined. One goal of the society is to promote the application of psychology to the study of thought and behavior in science and technology."}, {"url": "http://slideplayer.com/slide/4075996/", "passage_text": "1. Psychology is currently defined as: A) the scientific study of behavior. B) the scientific study of behavior and mental processes. C) the scientific study of biological and cognitive processes. 7. The following is an example of an operational definition: A) stress is defined as how well a person adjusts to his/her environment. B) personality is defined as how well that person relates to others."}]