[{"url": "http://www.biology-online.org/dictionary/Muscular_system", "passage_text": "Muscular system. Definition. noun. An organ system comprised of skeletal muscles, smooth muscles, and cardiac muscles that are responsible for providing strength, keeping up balance, maintaining posture, allowing movement and producing heat. Supplement. The animal body is comprised of various organ systems and the muscular system is one of them. The muscular system includes all the muscle tissues such as the skeletal muscle tissues, smooth muscle tissues, and cardiac muscle tissues. The skeletal muscles are muscles attached to the bones and are responsible for the voluntary movements of the body."}, {"url": "http://www.yourdictionary.com/muscular-system", "passage_text": "The bodily system that is composed of skeletal, smooth, and cardiac muscle tissue and functions in movement of the body or of materials through the body, maintenance of posture, and heat production. 1  Link/Cite. "}, {"url": "http://www.innerbody.com/image/musfov.html", "passage_text": "The muscular system is responsible for the movement of the human body. Attached to the bones of the skeletal system are about 700 named muscles that make up roughly half of a person’s body weight. Each of these muscles is a discrete organ constructed of skeletal muscle tissue, blood vessels, tendons, and nerves."}, {"url": "http://www.thefreedictionary.com/muscular+system", "passage_text": "The bodily system that is composed of skeletal, smooth, and cardiac muscle tissue and functions in movement of the body or of materials through the body, maintenance of posture, and heat production. "}, {"url": "http://www.innerbody.com/image/musfov.html", "passage_text": "Function of Muscle Tissue. The main function of the muscular system is movement. Muscles are the only tissue in the body that has the ability to contract and therefore move the other parts of the body. Related to the function of movement is the muscular system’s second function: the maintenance of posture and body position. Attached to the bones of the skeletal system are about 700 named muscles that make up roughly half of a person’s body weight. Each of these muscles is a discrete organ constructed of skeletal muscle tissue, blood vessels, tendons, and nerves."}, {"url": "https://en.wikipedia.org/wiki/Muscular_system", "passage_text": "The muscular system is an organ system consisting of skeletal, smooth and cardiac muscles. There are three distinct types of muscles: skeletal muscles, cardiac or heart muscles, and smooth (non-striated) muscles."}, {"url": "https://en.wikipedia.org/wiki/Muscular_system", "passage_text": "It permits movement of the body, maintains posture, and circulates blood throughout the body. The muscular system in vertebrates is controlled through the nervous system, although some muscles (such as the cardiac muscle) can be completely autonomous. There are three distinct types of muscles: skeletal muscles, cardiac or heart muscles, and smooth (non-striated) muscles."}, {"url": "http://www.definitions.net/definition/MUSCULAR%20SYSTEM", "passage_text": "Muscular system. The muscular system is an organ system consisting of skeletal, smooth and cardiac muscles. It permits movement of the body, maintains posture, and circulates blood throughout the body. The muscular system in vertebrates is controlled through the nervous system, although some muscles can be completely autonomous."}, {"url": "http://encyclopedia2.thefreedictionary.com/Muscular+system", "passage_text": "Muscular system. The muscular system consists of muscular cells, the contractile elements with the specialized property of exerting tension during contraction, and associated connective tissues. The three morphologic types of muscles are voluntary muscle, involuntary muscle, and cardiac muscle. "}]