[{"url": "http://www.webmd.com/baby/labor-signs", "passage_text": "Before true labor begins, you may have false labor pains, also known as Braxton Hicks contractions. These irregular uterine contractions are perfectly normal and may start to occur in your second trimester, although more commonly in your third trimester of pregnancy."}, {"url": "http://www.nhs.uk/Conditions/pregnancy-and-baby/pages/labour-signs-what-happens.aspx", "passage_text": "Your midwife will probably advise you to stay at home until your contractions become frequent. When your contractions last 30-60 seconds and occur every five minutes, call your midwife for guidance. If you’re planning to have your baby in a maternity ward, phone the hospital."}, {"url": "http://www.parents.com/advice/pregnancy-birth/giving-birth/what-do-labor-pains-feel-like-and-where-might-they-occur-in-the-body/", "passage_text": "A: Labor pains, or contractions, result when the uterus (which is a muscle) begins to contract. There are 2 kinds of contractions: true labor contractions and false contractions (also known as Braxton-Hicks contractions). In general, contractions are usually felt in the lower middle abdomen."}, {"url": "http://www.babycentre.co.uk/signs-for-how-I-will-know-I-am-in-labour", "passage_text": "In pre-labour or early labour (the latent phase), you may have: As there can be an overlap between pre-labour and the start of labour itself, it's possible to confuse the symptoms of the two (Janssen et al 2009) ."}, {"url": "http://www.babycenter.com/stages-of-labor", "passage_text": "The second stage of labor begins when you're fully dilated and ends with the birth of your baby. This is sometimes referred to as the pushing stage. The third stage begins right after the birth of your baby and ends with the delivery of the placenta."}, {"url": "http://www.webmd.boots.com/pregnancy/guide/braxton-hicks-or-true-labour-contractions", "passage_text": "The way a true labour contraction feels is different for each woman and it may feel different from one pregnancy to the next. Labour contractions cause discomfort or a dull ache in your back and/or lower abdomen, along with pressure in the pelvis."}, {"url": "http://www.webmd.com/baby/labor-signs", "passage_text": "If you are pregnant, one of your first concerns might be what labor and delivery are like. This information will help answer the most common questions about labor, especially if this is your first pregnancy. For detailed information on delivery, see Methods of Delivery."}, {"url": "http://www.webmd.com/baby/labor-signs?page=2", "passage_text": "Braxton Hicks contractions can be described as a tightening in the abdomen that comes and goes. These contractions do not get closer together, do not increase with walking, do not increase in duration, and do not feel stronger over time as they do when you are in true labor."}, {"url": "http://www.webmd.com/baby/labor-signs", "passage_text": "No one knows what causes labor to start or when it will start, but several hormonal and physical changes may indicate the beginning of labor: 1  Lightening. 2  Passing of the mucus plug. 3  Contractions. 4  Water breaking. 5  Effacement and dilation of the cervix."}]