[{"url": "http://pets.thenest.com/traits-cats-share-7526.html", "passage_text": "Physical Traits. Some physical traits common to all cats, both big and small, have to do with their survival and way of life. All cats, including lions and tigers, have sandpaper tongues."}, {"url": "http://pets.thenest.com/inherited-traits-dogs-6027.html", "passage_text": "Inherited Temperament Traits. Your dog's temperament is mainly a function of her neurological makeup, which is determined at conception. Responsive, non-responsive, active, inactive, shy and aggressive -- these are all inherited temperaments that have been mapped out by your dog's DNA."}, {"url": "http://pets.thenest.com/traits-cats-share-7526.html", "passage_text": "All cats have their own personalities. Just ask anyone who has ever been owned by more than one cat! The pets can be holy terrors or angelic little pussycats. All members of the feline species share some traits, however, and they all have to do with survival."}, {"url": "http://www.answers.com/Q/What_traits_do_cats_have", "passage_text": "Traits are characteristics inherited from your parents.   A trait is something that past down from the generations. Either from Genetic based properties or enviromentally. … Example. A man with extremly good eye sight passed down his trait to his son and so on."}, {"url": "http://icatcare.org/advice/cat-breeds/inherited-disorders-cats", "passage_text": "Cats suffer from inherited disorders like other animals, but they tend to be more common among pedigree cats because the selective breeding and in-breeding (breeding together very closely related cats) used to develop particular characteristics of the breed may also increase the risk of inherited disorders."}, {"url": "http://pets.thenest.com/traits-cats-share-7526.html", "passage_text": "Their kitties are just communicating the way all cats do. Cat personalities vary greatly, but personality traits shared by all cats are their independent natures, cleanliness habits and the ability to be aloof and very, very quiet when necessary."}, {"url": "http://www.answers.com/Q/What_traits_do_cats_have", "passage_text": "Three traits that are inherited by all members of the cat species are that maybe their skin, eye color, what they eat, or the ability to catch mice or fish."}, {"url": "http://pets.thenest.com/traits-cats-share-7526.html", "passage_text": "Some physical traits common to all cats, both big and small, have to do with their survival and way of life. All cats, including lions and tigers, have sandpaper tongues."}, {"url": "http://pets.thenest.com/inherited-traits-dogs-6027.html", "passage_text": "Inherited Traits in Dogs. Many of your puppy's traits are inherited. All dogs share their ancestry with the wolf. But for the past 15,000 years they have been bred to assist us humans as guards, hunters, herders and companions."}]