[{"url": "http://www.travelozimbabwe.com/destinations/eastern-highlands-zimbabwe/", "passage_text": "Eastern Highlands, Zimbabwe. The mountainous region of eastern Zimbabwe is like an enchanted secret garden. But stretching for 300km north to south it's quite difficult to keep the Eastern Highlands a secret, much as you'd like to after visiting. "}, {"url": "http://www.infoplease.com/encyclopedia/world/eastern-highlands.html", "passage_text": "1 Toowoomba-Toowoomba Toowoomba, city (1991 pop. 75,990), Queensland, E Australia, in the Eastern Highlands, ... 2  Australian Alps-Australian Alps Australian Alps, chain of mountain ranges, SE Australia, making up the southern ... Rich in minerals, the highlands contain most of Australia's coalfields; gold, copper, tin, oil, and natural gas are also extracted. The southern part of the region is a popular winter resort area. Major segments of the system are the Australian Alps, the New England Range, and the Blue Mts."}, {"url": "https://en.wikipedia.org/wiki/Eastern_Highlands_Province", "passage_text": "Eastern Highlands is a highlands province of Papua New Guinea. The provincial capital is Goroka. The province covers an area of 11,157 km², and has a population of 579,825 (2011 census). The province shares a common administrative boundary with Madang, Morobe and Gulf and Simbu Provinces. The province derives most of its revenue from the production of coffee. Eastern Highlands is the leading producer of coffee in the region. It produces large quantities of coffee annually for export."}, {"url": "http://www.jenmansafaris.com/national-parks-and-attractions/eastern-highlands/", "passage_text": "The Chimanimani National Park, part of the Eastern highlands, is an incredible region running over 300 km’s from north to south forming a natural border with neighbouring Mozambique. Safaris to the Eastern Highlands are great all year round, if you want to climb one of the parts of the Eastern Highlands then we recommend travelling in the warmer months of the year. Have a look at our Zimbabwe tours and lodges below…."}, {"url": "https://en.wikipedia.org/wiki/Eastern_Highlands", "passage_text": "Eastern Highlands also refers to Eastern Highlands Province in Papua New Guinea, and part of the Great Dividing Range, Australia. Northern part of the Eastern Highlands range as seen from Nyanga town. The Highlands have a cooler and wetter climate than other parts of Africa with higher rainfall, low cloud and heavy mists and dew as moisture moves inland from the Indian Ocean."}, {"url": "https://en.wikipedia.org/wiki/Eastern_Highlands", "passage_text": "The Eastern or 'East African Highlands' is a mountain range in the east of Zimbabwe and one of four distinct physiographic divisions on the African continent. The Highlands have a cooler and wetter climate than other parts of Africa with higher rainfall, low cloud and heavy mists and dew as moisture moves inland from the Indian Ocean."}, {"url": "http://www.jenmansafaris.com/national-parks-and-attractions/eastern-highlands/", "passage_text": "The Eastern Highlands are a sparsely populated area; exploring this region on a safari of Zimbabwe can prove to be a fascinating discovery – the area is lush, undeveloped and rich with safari animals. Safaris to the Eastern Highlands are great all year round, if you want to climb one of the parts of the Eastern Highlands then we recommend travelling in the warmer months of the year. Have a look at our Zimbabwe tours and lodges below…."}, {"url": "http://encyclopedia2.thefreedictionary.com/Eastern+Highlands", "passage_text": "Eastern Highlands. c.2,400 mi (3,860 km) long, general name for the mountains and plateaus roughly paralleling the east and southeast coasts of Australia (including Tasmania) and forming the Continental Divide (see Great Dividing Range Great Dividing Range,crest line of the Eastern Highlands of Australia. Rugged, with many gorges and few gaps, the Eastern Highlands long hindered westward expansion of British settlement. The slopes are covered with eucalyptus forests. Rich in minerals, the highlands contain most of Australia's coalfields; gold, copper, tin, oil, and natural gas are also extracted."}, {"url": "http://www.infoplease.com/encyclopedia/world/eastern-highlands.html", "passage_text": "1 Great Dividing Range-Great Dividing Range Great Dividing Range, crest line of the Eastern Highlands of Australia. 2  For 3  ... Toowoomba-Toowoomba Toowoomba, city (1991 pop. 75,990), Queensland, E Australia, in the Eastern Highlands, ... Rich in minerals, the highlands contain most of Australia's coalfields; gold, copper, tin, oil, and natural gas are also extracted. The southern part of the region is a popular winter resort area. Major segments of the system are the Australian Alps, the New England Range, and the Blue Mts."}, {"url": "https://en.wikipedia.org/wiki/Eastern_Highlands_Province", "passage_text": "Geography [edit]. Eastern Highlands Province is made up of rugged mountain terrain and broad valleys. It has low coastal areas in the Markham and Ramu valleys. The Province's two highest peaks, Mt Tabletop and Mt Michael are located on Kratke and Bismarck Range respectively. The province derives most of its revenue from the production of coffee. Eastern Highlands is the leading producer of coffee in the region. It produces large quantities of coffee annually for export."}]