[{"url": "http://www.drugs.com/zonegran.html", "passage_text": "Zonegran (zonisamide) is a sulfa drug with anti-convulsant effects. Zonegran is used together with other anti-convulsant medications to treat partial seizures in adults with epilepsy."}, {"url": "http://epilepsy.emedtv.com/zonegran/zonegran-uses.html", "passage_text": "Zonegran ® (zonisamide) is a prescription medication used for epilepsy. In particular, Zonegran is approved for treating epilepsy in people who experience a certain type of seizure called a partial seizure or focal seizure. It is approved to be used along with other seizure medications, but not to be used alone."}, {"url": "http://epilepsy.emedtv.com/zonegran/zonegran.html", "passage_text": "Zonegran ® (zonisamide) is a prescription medication used to treat partial seizures, a specific type of epileptic seizure. Seizures are divided into two major categories: partial seizures (sometimes called focal seizures) and generalized seizures."}, {"url": "http://www.webmd.com/drugs/2/drug-18143/zonegran-oral/details", "passage_text": "Zonisamide is used with other medications to prevent and control seizures (epilepsy). Zonisamide is a sulfonamide anticonvulsant and a carbonic anhydrase inhibitor."}, {"url": "http://www.drugs.com/zonegran.html", "passage_text": "Important information. You should not use Zonegran if you are allergic to zonisamide, or to other sulfa drugs such as sulfamethoxazole (Gantanol), sulfisoxazole (Gantrisin), or sulfamethoxazole-trimethoprim (Bactrim, Septra, Sulfatrim, SMX-TMP, and others). A sulfa drug allergic reaction can be fatal."}, {"url": "http://www.webmd.com/drugs/2/drug-18143/zonegran-oral/details", "passage_text": "Uses. Zonisamide is used with other medications to prevent and control seizures (epilepsy). Zonisamide is a sulfonamide anticonvulsant and a carbonic anhydrase inhibitor. It is unknown how zonisamide works to prevent seizures."}, {"url": "http://www.webmd.com/drugs/2/drug-18137/zonisamide-oral/details", "passage_text": "Zonisamide is used with other medications to prevent and control seizures (epilepsy). Zonisamide is a sulfonamide anticonvulsant and a carbonic anhydrase inhibitor. It is unknown how zonisamide works to prevent seizures."}, {"url": "http://www.drugs.com/zonegran.html", "passage_text": "Zonegran may also be used for purposes not listed in this medication guide. You should not use Zonegran if you are allergic to zonisamide, or to other sulfa drugs such as sulfamethoxazole (Gantanol), sulfisoxazole (Gantrisin), or sulfamethoxazole-trimethoprim (Bactrim, Septra, Sulfatrim, SMX-TMP, and others)."}, {"url": "http://www.everydayhealth.com/drugs/zonisamide", "passage_text": "Zonisamide is a sulfa drug with anti-convulsant effects. Zonisamide is used together with other anti-convulsant medications to treat partial seizures in adults with epilepsy. Zonisamide may also be used for purposes not listed in this medication guide."}]