[{"url": "http://www.jsc.nasa.gov/history/flag/flag.htm", "passage_text": "The first U.S. flag on the moon was deployed by Neil Armstrong and Edwin Buzz Aldrin during their historic EVA on 20 July 1969 (at 4 days, 14 hours and 9 minutes mission-elapsed time). The flag was seen worldwide on live television (Fig. Work on the lunar flag assembly began about three months prior to the Apollo 11 mission. Robert Gilruth, Director of the Manned Spacecraft Center (MSC) (footnote 8) and a member of the Committee on Symbolic Activities, asked Jack Kinzler, Chief of Technical Services Division at MSC, for ideas regarding the EVA."}, {"url": "http://www.space.com/16798-american-flags-moon-apollo-photos.html", "passage_text": "Astronaut Buzz Aldrin reported that the flag was blown over by the exhaust from the ascent engine during liftoff of Apollo 11, and it looks like he was correct!. Each of the six manned Apollo missions that landed on the moon planted an American flag in the lunar dirt. From the LROC images it is now certain that the American flags are still standing and casting shadows at all of the sites, except Apollo 11, LROC principal investigator Mark Robinson wrote in a blog post today (July 27)."}, {"url": "https://en.wikipedia.org/wiki/Lunar_Flag_Assembly", "passage_text": "Buzz Aldrin salutes the first American flag erected on the Moon, July 21, 1969. The Lunar Flag Assembly (LFA) was a kit containing a flag of the United States designed to be planted by astronauts on the Moon during the Apollo program. Seven such flag assemblies were sent to the Moon, six of which were planted (the exception being the one carried on Apollo 13 which had to abort its landing due to a serious spacecraft failure)."}, {"url": "https://en.wikipedia.org/wiki/Apollo_11", "passage_text": "Apollo 11 was the spaceflight that landed the first humans on the Moon, Americans Neil Armstrong and Buzz Aldrin, on July 20, 1969, at 20:18 UTC. Armstrong became the first to step onto the lunar surface six hours later on July 21 at 02:56 UTC. "}, {"url": "http://www.answers.com/Q/When_did_the_american_flag_get_placed_on_the_moon", "passage_text": "There are six American flags on the moon from the Apollo 11, 12, 14, 15, 16, and 17 missions. Buzz Aldrin during the Apollo 11 mission placed the first flag on the moon. The f … lags cost $5.50 USD each, and 5 of the 6 are still casting shadows. Other than by human interaction, the flag never has waved on the  moon. There are several reasons for this.    First, all of the flags planted on the moon had a suppor … t bar  across the top to hold the flag open rather than hanging limply  down the pole."}, {"url": "http://www.answers.com/Q/When_did_the_american_flag_get_placed_on_the_moon", "passage_text": "(The first humans to land on the moon on July 20, 1969) A flag, or a form of it (as, an insgnia on the side of a spacecraft) may be on the moon on a Ranger unmanned probe (which crashed into the lunar surface, and which may or may not have survived, because of the severe force of impact!). Other than by human interaction, the flag never has waved on the  moon. There are several reasons for this.    First, all of the flags planted on the moon had a suppor … t bar  across the top to hold the flag open rather than hanging limply  down the pole."}, {"url": "http://blogs.voanews.com/science-world/2012/07/31/forty-years-later-us-flags-remain-on-moon/", "passage_text": "Only the flag planted by the first men on the moon, Apollo 11’s Neil Armstrong and Buzz Aldrin, is not erect. Back when the two men took off from the lunar surface, Aldrin noticed the flag was blown over by the exhaust from their spacecraft’s engine during liftoff. "}, {"url": "http://gizmodo.com/5930450/all-the-american-flags-on-the-moon-are-now-white", "passage_text": "These photos show that the shadows of the flags are still there. There's even a video showing how the shadows change as the Moon rotates. Indeed, all of them are standing up except the one left by Armstrong and Aldrin, the first two men on the Moon. Not quite. While the $5.50 nylon flags are still waving on the windless orb, they are not flags of the United States of America anymore. All Moon and material experts have no doubt about it: the flags are now completely white. If you leave a flag on Earth for 43 years, it would be almost completely faded."}, {"url": "https://en.wikipedia.org/wiki/Lunar_Flag_Assembly", "passage_text": "Six of the flags were ordered from a government supply catalog and measured 3 by 5 feet (0.91 by 1.52 m); the last one planted on the Moon was the slightly larger, 6-foot (1.8 m)-wide flag which had hung in the Mission Operations Control Room in the Manned Spacecraft Center for most of the Apollo program. Seven such flag assemblies were sent to the Moon, six of which were planted (the exception being the one carried on Apollo 13 which had to abort its landing due to a serious spacecraft failure)."}, {"url": "http://gizmodo.com/5930450/all-the-american-flags-on-the-moon-are-now-white", "passage_text": "NASA has finally answered a long-standing question: all but one of the six American flags on the Moon are still standing up. Everyone is now proudly talking about it. The only problem is that they aren't American flags anymore. They are all white. Not quite. While the $5.50 nylon flags are still waving on the windless orb, they are not flags of the United States of America anymore. All Moon and material experts have no doubt about it: the flags are now completely white. If you leave a flag on Earth for 43 years, it would be almost completely faded."}]