[{"url": "https://answers.yahoo.com/question/index?qid=20090406234122AAZDtNi", "passage_text": "Report Abuse. A neutralization reaction occurs when an acid and a base (usually both are in aqueous solutions) react to form water and a salt, which do not exhibit any of the acid or base properties. An acid is identified by being paired with a hydrogen ion and a base is identified by being paired with a hydroxide group."}, {"url": "http://www.answers.com/Q/What_is_a_neutralization_reaction", "passage_text": "A neutralization reaction is a chemical reaction in which an acid and a base combine. Generally, this involves the combination of a hydronium ion (H3O+) with a hydroxide ion (… OH-) to form water (2H2O)."}, {"url": "http://ch302.cm.utexas.edu/chemEQ/neutralizations/selector.php?name=neutralization-rxns", "passage_text": "A neutralization reaction is the reaction of an acid and base. In particular strong acids will always react in the presence of any base. Similarly strong bases will always react ion the presence of any acid."}, {"url": "http://study.com/academy/lesson/neutralization-reaction-definition-equation-examples.html", "passage_text": "Summary. 1  Neutralization reaction occurs when an acid and base react with each other to form salt and water. 2  Acids and bases can be classified as either strong or weak. 3  Ionization occurs completely with strong acids and bases, and only partially for weak acids and bases."}, {"url": "http://chemistry.elmhurst.edu/vchembook/183neutral.html", "passage_text": "A salt is any compound which can be derived from the neutralization of an acid and a base. The word neutralization is used because the acid and base properties of H + and OH-are destroyed or neutralized. In the reaction, H + and OH-combine to form HOH or H 2 O or water molecules. A neutralization is a type of double replacement reaction. A salt is the product of an acid-base reaction and is a much broader term then common table salt as shown in the firs"}, {"url": "http://www.sparknotes.com/testprep/books/sat2/chemistry/chapter6section6.rhtml", "passage_text": "Acid–Base Reactions: Neutralization Reactions. When a strong acid and a strong base solution are mixed, a neutralization reaction occurs, and the products do not have characteristics of either acids or bases. Instead, a neutral salt and water are formed."}, {"url": "http://study.com/academy/lesson/neutralization-reaction-definition-equation-examples.html", "passage_text": "Neutralization is a type of chemical reaction in which a strong acid and strong base react with each other to form water and salt. Have you ever been unlucky enough to be stung by a wasp or a bee?"}]