[{"url": "http://ehowtomakebeer.weebly.com/1/post/2011/08/how-long-does-it-take-to-ferment.html", "passage_text": "As you are learning how to make beer, you will likely read many varying opinions on how long to ferment in the primary. Just because fermentation completes in 7-10 days does not mean your beer is ready to drink. Chances are, it isn't ready to do anything with just yet. Remember, beer likes time. The key to remember when learning how to make beer is that allowing your beer time to age makes for better beer. It is important to let your beer completely ferment before moving on to the next stage. The simple answer for how long fermentation takes is about 10 days. The time it takes depends on the lag time--how long it takes fermentation to start after the yeast has been pitched. This varies and depends on the type of yeast used, and the condition and age of the yeast. Lag times can be as short as an hour or two, and on up to 72 hours"}, {"url": "http://winemakersacademy.com/long-primary-secondary-fermentations/", "passage_text": "Primary fermentation usually takes between three to seven days to complete. It goes by much more quickly than secondary fermentation because wine must is a much more fertile environment for the yeast. Sugar and oxygen levels are high during primary fermentation and there are plenty of nutrients. Three wines in secondary fermentation. How long secondary fermentation lasts depends on a handful of things. Not only does it depend on when you rack to a secondary container, it also depends on how agressive your yeast strain is as well as the wine’s temperature."}, {"url": "http://www.brew-dudes.com/primary-fermentation/121", "passage_text": "Get tips on how to take gravity readings during fermentation 1  ! In our experience, two weeks is better than one; we have had better results with two weeks than one. 2  It gives the yeast more time to reprocess some of the early stage fermentation byproducts and time for the yeast to settle out. "}, {"url": "http://www.eckraus.com/blog/how-can-i-tell-if-my-wine-yeast-is-working", "passage_text": "Good Morning Albert (the beginner), Let's see if we can't figure out what's going on... First, it's important to understand that it can take a wine yeast up to 36 hours to start showing signs of fermentation. On average, it takes a yeast about 8 hours, so if it hasn't been this long, you may need to wait. How long a fermentation actually take to begins depends on a whole host of factors: temperature being the most critical. You want the wine must to be between 70° and 75°F. for a timely fermentation. "}, {"url": "http://www.eckraus.com/wine-making-101", "passage_text": "This air plays an important roll in the multiplication of the yeast cells. Here's how important. The little packets of yeast that is generally called for in a five gallon wine recipe will typically be multiplied up to 100 to 200 times during the few days of primary/aerobic fermentation. * It is also important to understand that once the wine's fermentation activity has stopped that it also needs to be given time to clear as well before bottling. Yeast is a silty substance that can take up to 2-4 additional weeks to clear up once the fermentation has stopped."}, {"url": "http://www.eckraus.com/wine-making-101", "passage_text": "Unlike the typical four to seven days the primary fermentation takes, the secondary fermentation will usually last anywhere from one to two weeks depending on the amount of nutrient and sugars still available. So as you can start to see, the secondary fermentation is much slower with less activity at any given time. * It is also important to understand that once the wine's fermentation activity has stopped that it also needs to be given time to clear as well before bottling. Yeast is a silty substance that can take up to 2-4 additional weeks to clear up once the fermentation has stopped."}, {"url": "http://winemakersacademy.com/long-primary-secondary-fermentations/", "passage_text": "Secondary Fermentation. Three wines in secondary fermentation. How long secondary fermentation lasts depends on a handful of things. Not only does it depend on when you rack to a secondary container, it also depends on how agressive your yeast strain is as well as the wine’s temperature. An aggressive yeast will power through a fermentation pretty steadily to the very end"}, {"url": "https://answers.yahoo.com/question/index?qid=20080515200321AAXFJ50", "passage_text": "It takes about 6-8 days to complete a normal primary fermentation at 55-60 degrees. At 80, assuming the fruit or juice, 'mash', is 80 to begin, it would shorten the fermentation to two and a half to three and a half days depending on the sugar level in the fruit. Less sugar, less time, (and less alcohol as well). I know that yeast dies at like a 15% alcohol solution so if i mix sugar and yeast at around 80 degrees how long will it take to reach the point where the yeast dies and fermenting stops."}, {"url": "http://www.lovebrewing.co.uk/guides/wine-making/beginners-guide-to-wine-making/", "passage_text": "Wineworks superior wines: These usually take 10-15 days to ferment, and a further week to clear. Again the wine can be drunk immediately but we recommend ageing it 4 weeks but you can leave it up to 12 months. The time you will leave it will depend very much on your stocks. So get plenty built up. "}]