[{"url": "http://www.blueplanetbiomes.org/rainforest.htm", "passage_text": "Climate. Southeast Asian Rainforests. The tropical rain forest is a forest of tall trees in a region of year-round warmth. An average of 50 to 260 inches (125 to 660 cm.) of rain falls yearly. Many kinds of trees that grow in the mountains of the Amazon rain forest do not grow in the lowlands of that same forest. Layers of the Rainforest There are four very distinct layers of trees in a tropical rain forest. These layers have been identified as the emergent, upper canopy, understory, and forest floor."}, {"url": "http://geography.about.com/od/climate/a/rainforests.htm", "passage_text": "A rainforest is a forest differentiated by high levels of precipitation-normally a minimum of at least 68-78 inches (172-198 cm) annually. Rainforests tend to have fairly mild and/or warm climates and feature the highest levels of biodiversity in the world. The majority are found in Central and South America, but tropical rainforests also exist in Southeast Asia, eastern Australia, and central Africa (map of locations) . The largest in tact tropical rainforest in the world is in the Amazon River Basin. Tropical rainforests form in these locations because they are within the ITCZ, which provides the warm temperatures common in the forests. Due to the temperatures and plant growth, transpiration rates are high"}, {"url": "http://tilapiale.weebly.com/landforms.html", "passage_text": "The Tropical Rainforest made up 14% of the Earth's surface, now there are only about 6% left that covers the land. This 6% of land features mountains, valleys, flood plains, streams, rivers, and a little bit of wetlands. It also contains high and lowlands, beaches, as well as some karsts. Mountains are a landform that is formed by the Earth's tectonic plates crashing into one another. The highest Tropical Rainforest mountain is the Pica da Neblina located in the Amazon Rainforest."}, {"url": "http://www.blueplanetbiomes.org/rainforest.htm", "passage_text": "**** Rainforests by Michael G. 2001 In an average year the climate in a tropical rain forest is very humid because of all the rainfall. A tropical rainforest gets about 150 cm of rain per year. Many kinds of trees that grow in the mountains of the Amazon rain forest do not grow in the lowlands of that same forest. Layers of the Rainforest There are four very distinct layers of trees in a tropical rain forest. These layers have been identified as the emergent, upper canopy, understory, and forest floor."}, {"url": "http://tilapiale.weebly.com/landforms.html", "passage_text": "Tropical Rainforest valleys are shaped in a 'U' or a 'V'. They are usually a low land area between hills or mountains that allows a river or stream to pass by its base. Valleys and dales are somewhat alike, yet different. Mountains are a landform that is formed by the Earth's tectonic plates crashing into one another. The highest Tropical Rainforest mountain is the Pica da Neblina located in the Amazon Rainforest."}, {"url": "http://www.blueplanetbiomes.org/rnfrst_climate_page.htm", "passage_text": "In an average year in a tropical rain forest, the climate is very humid because of all the rainfall, which amounts to about 250 cm per year. The rain forest has lots of rain because it is very hot and wet. This climate is found near the equator. "}, {"url": "http://www.blueplanetbiomes.org/rainforest.htm", "passage_text": "Plants Animals Climate Southeast Asian Rainforests The tropical rain forest is a forest of tall trees in a region of year-round warmth. An average of 50 to 260 inches (125 to 660 cm.) of rain falls yearly. Rain forests belong to the tropical wet climate group. Many kinds of trees that grow in the mountains of the Amazon rain forest do not grow in the lowlands of that same forest. Layers of the Rainforest There are four very distinct layers of trees in a tropical rain forest. These layers have been identified as the emergent, upper canopy, understory, and forest floor."}, {"url": "http://geography.about.com/od/climate/a/rainforests.htm", "passage_text": "As a result, the plants release water vapor which condenses and falls as precipitation. On average, a tropical rainforest is about 80°F (26°C) and has little daily or seasonal variation in temperature. In addition, tropical rainforests have an average of 100 inches (254 cm) of precipitation annually. The majority are found in Central and South America, but tropical rainforests also exist in Southeast Asia, eastern Australia, and central Africa (map of locations) . The largest in tact tropical rainforest in the world is in the Amazon River Basin. Tropical rainforests form in these locations because they are within the ITCZ, which provides the warm temperatures common in the forests. Due to the temperatures and plant growth, transpiration rates are high"}, {"url": "http://geography.about.com/od/climate/a/rainforests.htm", "passage_text": "Some of the larger temperate rainforests are on the northwest coast of North America, southeastern Australia, Tasmania, New Zealand, and the southwest coast of South America. Within rainforests, there are four different layers with various plants that have adapted to life in that layer. The majority are found in Central and South America, but tropical rainforests also exist in Southeast Asia, eastern Australia, and central Africa (map of locations) . The largest in tact tropical rainforest in the world is in the Amazon River Basin. Tropical rainforests form in these locations because they are within the ITCZ, which provides the warm temperatures common in the forests. Due to the temperatures and plant growth, transpiration rates are high"}]