[{"url": "https://www.videosurveillance.com/tech/power-over-ethernet.asp", "passage_text": "Power over Ethernet (PoE) is a way to power cameras with an Ethernet cord, which also gives the camera direct network access. Along with providing stable network connections, PoE also makes installation easier by only requiring one cable. IP cameras wired for PoE have a special power switch in them which can use the power sent over the Ethernet cord, while cameras without this switch will simply get the network connection and no power."}, {"url": "http://www.veracityglobal.com/resources/articles-and-white-papers/poe-explained-part-1.aspx", "passage_text": "It is also possible to upgrade powered devices, such as IP cameras, to POE by using a POE splitter. The POE splitter is patched in to the camera's network connection, and taps off the POE power, which it converts into a lower voltage suitable for the camera. A POE switch is a network switch that has Power over Ethernet injection built-in. Simply connect other network devices to the switch as normal, and the switch will detect whether they are POE-compatible and enable power automatically."}, {"url": "http://www.cctvcamerapros.com/PoE-for-IP-Camera-s/522.htm", "passage_text": "PoE for IP Camera. CCTV Camera Pros is a direct supplier of devices that provide PoE for IP cameras, including individual power over Ethernet mid-span injectors, desktop PoE network switches, and rack mount PoE switches. If you have questions about which PoE power supply is recommended for your security application, please contact us via email, chat or telephone. Please note that our PoE products are 802.3af and/or 802.3at compliant and can also work with non-video surveillance products."}, {"url": "https://www.videosurveillance.com/tech/power-over-ethernet.asp", "passage_text": "There are two types of PoE, standard PoE and PoE+. The standard type of PoE found on most IP cameras, IEEE 802.3af, can send up to 15 watts of electricity. This amount of power is not enough for PTZ cameras or cameras with fans and heaters for outdoor use, but is enough to power basic IP surveillance cameras. IP cameras wired for PoE have a special power switch in them which can use the power sent over the Ethernet cord, while cameras without this switch will simply get the network connection and no power."}, {"url": "http://www.veracityglobal.com/resources/articles-and-white-papers/poe-explained-part-1.aspx", "passage_text": "Power over Ethernet (POE) is a technology that lets network cables carry electrical power. For example, a digital security camera normally requires two connections to be made when it is installed: A POE switch is a network switch that has Power over Ethernet injection built-in. Simply connect other network devices to the switch as normal, and the switch will detect whether they are POE-compatible and enable power automatically."}, {"url": "https://en.wikipedia.org/wiki/IP_camera", "passage_text": "Unsourced material may be challenged and removed. (September 2010). An Internet protocol camera, or IP camera, is a type of digital video camera commonly employed for surveillance, and which, unlike analog closed circuit television (CCTV) cameras, can send and receive data via a computer network and the Internet. Although most cameras that do this are webcams, the term IP camera or netcam is usually applied only to those used for surveillance. The first centralized IP camera was Axis Neteye 200, released in 1996 by Axis Communications."}, {"url": "http://www.cctvcamerapros.com/PoE-for-IP-Camera-s/522.htm", "passage_text": "As a direct supplier of IP cameras, CCTV Camera Pros tests all of the PoE power supplies that we carry to work with the IP cameras that we supply as well as other network cameras available in the market. If you have questions about which PoE power supply is recommended for your security application, please contact us via email, chat or telephone. Please note that our PoE products are 802.3af and/or 802.3at compliant and can also work with non-video surveillance products."}, {"url": "http://www.veracityglobal.com/resources/articles-and-white-papers/poe-explained-part-1.aspx", "passage_text": "VoIP phones-the original POE application. Using POE means phones have a single connection to a wall socket, and can be remotely powered down, just like with the older analog systems. IP cameras-POE is now ubiquitous on networked surveillance cameras, where it enables fast deployment and easy repositioning. A POE switch is a network switch that has Power over Ethernet injection built-in. Simply connect other network devices to the switch as normal, and the switch will detect whether they are POE-compatible and enable power automatically."}, {"url": "http://www.hkvstar.com/technology-news/what-s-poe-ip-surveillance-camera.html", "passage_text": "Written on. . View Comments. PoE IP surveillance camera is the traditional IP camera with added PoE module, which allow camera to utilize the Power over Ethernet (PoE) technology for reducing the network cost and increasing the flexibility of whole network system. PoE switch is a network switch that has power over Ethernet injection built-in. It's essential device if you want to use the PoE IP cameras or want to setup a PoE Ethernet LAN (local area network)."}, {"url": "http://www.hkvstar.com/technology-news/what-s-poe-ip-surveillance-camera.html", "passage_text": "For properly working of PoE IP camera, you need to use the PoE switch. PoE switch is a network switch that has power over Ethernet injection built-in. It's essential device if you want to use the PoE IP cameras or want to setup a PoE Ethernet LAN (local area network). Simply connect the PoE featured IP cameras to the swich as normal, the swich can automatically detect if they are PoE compatible, and enable power automatically"}]