[{"url": "http://www.everydayhealth.com/arthritis/osteoarthritis/treating-osteoarthritis.aspx", "passage_text": "Disease modifying anti-rheumatic drugs (DMARDs). DMARDs are often prescribed for inflammatory types of arthritis, such as rheumatoid arthritis. They not only reduce pain, but also help slow damage from these diseases. Some are older drugs, like Trexall (methotrexate) and Azulfidine (sulfasalazine) . Arthritis pain can stop you in your tracks. Fortunately, doctors can prescribe or recommend a number of medications to help you find relief from joint pain, stiffness, and swelling. But with the good comes the potential bad: Even over-the-counter (OTC) arthritis treatments can have side effects."}, {"url": "http://www.webmd.com/pain-management/guide/joint-pain", "passage_text": "They provide support and help you move. Any damage to the joints from disease or injury can interfere with your movement and cause a lot of pain. Many different conditions can lead to painful joints, including osteoarthritis, rheumatoid arthritis, bursitis, gout, strains, sprains, and other injuries. Joint pain is extremely common. Even short-term pain and swelling in the joints can affect your quality of life. Whatever the cause of joint pain, you can usually manage it with medication, physical therapy, or alternative treatments. Your doctor will first try to diagnose and treat the condition that is causing your joint pain."}, {"url": "http://www.healthline.com/health/osteoarthritis/over-counter-relief", "passage_text": "According to the American Academy of Orthopaedic Surgeons, nonsteroidal anti-inflammatory drugs (NSAIDs) are the most popular drugs for treating arthritis pain. NSAIDs include ibuprofen (Motrin), naproxen (Alleve, Naprosyn), and aspirin. Acetaminophen (Tylenol) is another over-the-counter pain reliever that can help manage arthritis discomfort. The drug works by reducing the feeling of pain in the brain. Unlike NSAIDs, Tylenol won’t decrease joint inflammation."}, {"url": "http://www.mayoclinic.org/diseases-conditions/arthritis/in-depth/arthritis/ART-20046440", "passage_text": "1 Talk to your doctor about your symptoms, arthritis related or not. 2  Sometimes seemingly unrelated problems are, in fact, connected. 3  Give your doctor complete information about your medical conditions and medications, including over-the-counter medications and supplements. Arthritis is a leading cause of pain and disability worldwide. You can find plenty of advice about easing the pain of arthritis and other conditions with exercise, medication and stress reduction."}, {"url": "http://www.everydayhealth.com/arthritis/medications.aspx", "passage_text": "Arthritis can produce many symptoms and joint problems, including inflammation, swelling, stiffness, and certainly joint pain. But arthritis medicines are available to help ease nearly all types of arthritis aches and pains. However, taking too much can lead to liver damage. NSAIDS for Arthritis. NSAIDS, or nonsteroidal anti-inflammatory drugs, are commonly prescribed for arthritis pain and other symptoms. They are available over-the-counter as aspirin (such as Bayer), naproxen (such as Aleve), and ibuprofen (such as Motrin)."}, {"url": "http://www.webmd.com/osteoarthritis/guide/medicines-overview", "passage_text": "Anti-inflammatory Painkillers (NSAIDs). Nonsteroidal anti-inflammatory drugs or NSAIDs are available both over-the-counter and by prescription. Almost everyone with arthritis has taken or is taking one of these drugs. Prescription doses can help curb joint inflammation. Other Pain-Relieving Arthritis Drugs. Acetaminophen is available over-the-counter and is a commonly used pain reliever for people with arthritis. Narcotic pain relievers are available by prescription only and may be used to help with more severe pain, but they don't relieve joint inflammation."}, {"url": "https://www.psoriasis.org/life-with-psoriatic-arthritis", "passage_text": "NSAIDs. An NSAID is a nonsteroidal anti-inflammatory drug. NSAIDs include over-the-counter meds such as aspirin and ibuprofen as well as prescription products. These drugs help to decrease inflammation, joint pain and stiffness. They can also make it easier for you to move. Talk to your doctor about NSAIDs, their interactions with other treatments for psoriatic arthritis, and their possible side effects. When the pain of psoriatic arthritis is severe or when it does not go away with traditional psoriatic arthritis treatments, you may want to talk to your doctor about medication that helps reduce your sensitivity to pain. Prescription pain medications such as Gabapentin and Pregabalin are used to treat neurological pain."}]