[{"url": "http://andalucia.com/nerja/home.htm", "passage_text": "Nerja's most spectacular attraction is undoubtedly its fascinating caves, located just three kilometres from the centre of town. They include archaeological treasures such as paintings over 20,000 years old and other pre-historic remains. Nerja boasts 16 kilometres of beaches with powdery sand and sparkling clear water. All major water sports are available here, including water skiing, scuba diving and sailing."}, {"url": "http://www.nerjatoday.com/", "passage_text": "Nerja Today. Guide to the town of Nerja. Nerja, on the Costa del Sol, is a seaside resort of sandy coves sheltered by the impressive Sierra de Almijara mountains and often referred to as 'The Jewel of the Costa del Sol'. A temperate climate means that Nerja is a great place to visit at any time of year. Nerja is located 53 kilometres east of M laga on the Costa del Sol and can be reached in about 40 minutes by car from M laga airport or about an hour and a half by bus. Find information on how to get to Nerja, including the best options for taxi and minibus transfers and local taxi rates along with bus timetables. "}, {"url": "http://andalucia.com/nerja/home.htm", "passage_text": "Overview of Nerja. Nerja is on the seashore some 50 kilometres from Malaga málaga on The n340 coastal, highway and marks the eastern tip Of'malaga Málaga s Costa. Del sol once a sleepy, fishing village the town now has a population 22,000. over 22000 Nerja boasts 16 kilometres of beaches with powdery sand and sparkling clear water. All major water sports are available here, including water skiing, scuba diving and sailing."}, {"url": "http://www.spanish-fiestas.com/nerja/", "passage_text": "Discover the Real Spain. Nerja lies 55km east of Malaga airport and is the most easterly resort on Spain’s Costa del Sol before this Mediterranean coastline becomes known as the Costa Tropical. Although Nerja is no longer the quaint fishing village from which it developed, neither is it a high rise monstrosity like some of the resorts of the western Costa del Sol. A major part of Nerja’s appeal to tourists is that it has maintained its white village charms and property development has been mainly low rise."}, {"url": "http://andalucia.com/nerja/home.htm", "passage_text": "Trips from the Costa del Sol to Nerja and Frigiliana. Nerja, a beautiful town on Malaga's eastern tip, with excellent beaches, water sports and fascinating caves. Nerja boasts 16 kilometres of beaches with powdery sand and sparkling clear water. All major water sports are available here, including water skiing, scuba diving and sailing."}, {"url": "http://wikitravel.org/en/Nerja", "passage_text": "Nerja (pronounced like: N'air'-ha) is a seaside resort on the Costa del Sol, in the region of Andalucia of Spain. It is the first resort town going away from Malaga to not be dominated by large ugly concrete hotels and is situated in the attractive foothills of the Sierra Almijara mountains. 1 Self guided Tapas Trails in Nerja, Cerro Marino, Nerja, 29780, ☎ 0034 952520748 (rentals@holidaycosta.com), [6]. 2  A great way of exploring and tasting the delights in the local Nerja tapas bars-walking maps avaialable to download."}, {"url": "https://en.wikipedia.org/wiki/Nerja", "passage_text": "Nerja is also the centre of scuba diving on the Costa del Sol, with the Natural Park of Maro-Cerro Gordo nearby. The town has 400 restaurants, bars,cafes cafés and five, supermarkets A lidl and many-mini marts spread around. Town nerja does not have any large stores of the main chains of shops In. spain Nerja is also the centre of scuba diving on the Costa del Sol, with the Natural Park of Maro-Cerro Gordo nearby. The town has 400 restaurants, bars,cafes cafés and five, supermarkets A lidl and many-mini marts spread around. town"}, {"url": "https://en.wikipedia.org/wiki/Nerja", "passage_text": "Nerja (. [ˈneɾka]) is a municipality on the Costa del Sol in the province of Malaga málaga in the autonomous community Of andalusia in Southern. Spain it belongs to the comarca Of La. Axarquia axarquía it is on'the country S southern, mediterranean coast about 50 km East. of malaga málaga Nerja is also the centre of scuba diving on the Costa del Sol, with the Natural Park of Maro-Cerro Gordo nearby. The town has 400 restaurants, bars,cafes cafés and five, supermarkets A lidl and many-mini marts spread around. town"}, {"url": "http://www.nerjatoday.com/", "passage_text": "Nerja Today is your guide to Nerja and the surrounding area, with information on Getting to Nerja, Where to Stay, Places of Interest, Things to do, Nerja beaches, Nightlife, Nerja 4 Kids, Tapas Bars, Bars and Restaurants, Fiestas and much more.... A temperate climate means that Nerja is a great place to visit at any time of year. Nerja is located 53 kilometres east of M laga on the Costa del Sol and can be reached in about 40 minutes by car from M laga airport or about an hour and a half by bus."}, {"url": "http://www.spain-holiday.com/Nerja", "passage_text": "Nerja. Nerja is situated at the eastern tip of the Costa del Sol, in the province of Malaga, 50 kilometres from the city of Malaga and within an hour and a half’s drive from Granada and the ski resort of the Sierra Nevada. The 10 best restaurants in Nerja. Nerja is one of the most visited destinations on the Costa del Sol. Here's an insider's guide on the best things to do and see while there."}]