[{"url": "http://www.fueleconomy.gov/feg/hydrogen.shtml", "passage_text": "Hydrogen. Hydrogen (H 2) is being explored as a fuel for passenger vehicles. It can be used in fuel cells to power electric motors or burned in internal combustion engines (ICEs)."}, {"url": "http://www.afdc.energy.gov/fuels/hydrogen.html", "passage_text": "Hydrogen. Hydrogen, when used in a fuel cell, is an emissions-free alternative fuel that can be produced from diverse domestic energy sources. Research and commercial efforts are under way to build the hydrogen fueling infrastructure and produce hydrogen fuel cell vehicles that are practical for widespread use."}, {"url": "http://www.infoplease.com/encyclopedia/science/hydrogen-uses.html", "passage_text": "Uses. Hydrogen was formerly used for filling balloons, airships, and other lighter-than-air craft, a dangerous practice because of hydrogen's explosive flammability; there were disastrous fires, e.g., the immolation of the German airship Hindenburg at its mooring at Lakehurst, N.J., in 1937. 1 hydrogen: Uses-Uses Hydrogen was formerly used for filling balloons, airships, and other lighter-than-air craft, a 2  ... aluminum borohydride: meaning and definitions-aluminum borohydride: Definition and Pronunciation."}, {"url": "http://www.answers.com/Q/What_is_hydrogen_used_for", "passage_text": "Confidence votes 11. hydrogen is used to make up science & social study. An additional and extremely important use is in the Haber process: This process produces the ammonia that is used in fertilizers and explosives."}, {"url": "http://www.webmd.com/drugs/2/drug-76035/hydrogen-peroxide/details", "passage_text": "Uses. Hydrogen peroxide is a mild antiseptic used on the skin to prevent infection of minor cuts, scrapes, and burns. It may also be used as a mouth rinse to help remove mucus or to relieve minor mouth irritation (e.g., due to canker/ cold sores, gingivitis). How to use hydrogen peroxide. Follow all directions on the product package. If you are uncertain about any of the information, consult your doctor or pharmacist. Do not use in the eyes or apply over large areas of skin. If you are using this product on the skin, clean the affected area before use."}, {"url": "http://www.wisegeek.org/what-are-some-uses-of-hydrogen.htm", "passage_text": "These 10 animal facts will amaze you. Hydrogen is the lightest element on the periodic table and has been used for a variety of purposes. Petroleum and chemical companies use it to access and refine crude oil and in the creation of commercial products such as margarine. "}, {"url": "http://www.usesfor.net/uses-for-hydrogen.html", "passage_text": "Uses for hydrogen varied widely. It is used in many different industries, including in petroleum and chemical businesses. It is also used in the food industry, in hydrogenating fats and oils, which permits to form margarine from vegetable oil. Hydrogen is also useful in producing methanol. It is also used in reducing metal ores. Other uses for hydrogen may be found in welding, in power generators, and in cryogenics research. "}, {"url": "https://en.wikipedia.org/wiki/Hydrogen_fuel", "passage_text": "(December 2013). Hydrogen fuel is a zero-emission fuel when burned with oxygen (if one considers water not as an emission) or used in a contained cell also capable of 'reversing' the reaction if needed. It often uses electrochemical cells, or combustion in internal engines, to power vehicles and electric devices. "}, {"url": "http://www.webelements.com/hydrogen/uses.html", "passage_text": "Hydrogen: uses. The following uses for hydrogen are gathered from a number of sources as well as from anecdotal comments. I'd be delighted to receive corrections as well as additional referenced uses (please use the feedback mechanism to add uses). One of hydrogen's isotopes, tritium (3 H) is radioactive. "}, {"url": "http://www.infoplease.com/encyclopedia/science/hydrogen-uses.html", "passage_text": "More on hydrogen Uses from Infoplease: 1  hydrogen: Uses-Uses Hydrogen was formerly used for filling balloons, airships, and other lighter-than-air craft, a ... 1 hydrogen: Uses-Uses Hydrogen was formerly used for filling balloons, airships, and other lighter-than-air craft, a 2  ... aluminum borohydride: meaning and definitions-aluminum borohydride: Definition and Pronunciation."}]