[{"url": "http://www.u-s-history.com/pages/h1584.html", "passage_text": "John Calvin Coolidge Jr. was born the son of a village storekeeper in Plymouth Notch, Vermont, on July 4, 1872. Upon graduating from college, he dropped his first name."}, {"url": "http://www.biography.com/people/calvin-coolidge-9256384", "passage_text": "Calvin Coolidge was born in Plymouth Notch, Vermont, on July 4, 1872. Coolidge rose through the ranks of Massachusetts government as a Progressive Republican. Elected U.S. vice president in 1920, he became president following the death of Warren G. Harding in 1923."}, {"url": "http://www.history.com/topics/us-presidents/calvin-coolidge", "passage_text": "John Calvin Coolidge was born on July 4, 1872, in the small village of Plymouth Notch, Vermont. His father, also named John Calvin Coolidge (1845-1926), was a hardworking and frugal businessman who ran a general store and post office."}, {"url": "http://www.biography.com/people/calvin-coolidge-9256384", "passage_text": "John Calvin Coolidge Jr. was born in Plymouth Notch, Vermont, on July 4, 1872. His father, John Coolidge, was a successful farmer who served in the Vermont House of Representatives and the Vermont Senate, as well as other local offices."}, {"url": "http://historicsites.vermont.gov/directory/coolidge/faqs", "passage_text": "Calvin Coolidge was born in Plymouth Notch on July 4, 1872 the only president born on Independence Day! He spent his boyhood here, left for college (Amherst, MA), and became a lawyer and politician in Massachusetts."}, {"url": "http://www.biography.com/people/calvin-coolidge-9256384", "passage_text": "Synopsis. Calvin Coolidge was born in Plymouth Notch, Vermont, on July 4, 1872. Coolidge rose through the ranks of Massachusetts government as a Progressive Republican. Elected U.S. vice president in 1920, he became president following the death of Warren G. Harding in 1923."}, {"url": "http://millercenter.org/president/biography/coolidge-life-in-brief", "passage_text": "Calvin Coolidge was born on Independence Day, 1872, and raised in Plymouth Notch, Vermont. His father was a pillar of the community, holding a variety of local offices from tax collector to constable. From him, Coolidge inherited his taciturn nature, his frugality, and his commitment to public service."}, {"url": "http://americanhistory.about.com/od/calvincoolidge/p/pcoolidge.htm", "passage_text": "Calvin Coolidge's Childhood and Education: Coolidge was born on July 4, 1872 in Plymouth, Vermont. His father was a storekeeper and local public official. Coolidge attended a local school before enrolling nin 1886 at the Black River Academy in Ludlow, Vermont."}]