[{"url": "http://pets.webmd.com/cats/guide/cat-hyperthyroidism", "passage_text": "Weight loss is seen in 95 to 98 percent of hyperthyroid cats, and a hearty appetite in 67 to 81 percent. Excessive thirst, increased urination, hyperactivity, unkempt appearance, panting, diarrhea and increased shedding have also been reported. Vomiting is seen in about 50 percent of affected cats. Hyperthyroidism is the most common glandular disorder in cats. It is most frequently caused by an excessive concentration of circulating thyroxine-a thyroid hormone better known as T 4 -in the bloodstream."}, {"url": "http://www.vetbook.org/wiki/cat/index.php/Thyroid_gland", "passage_text": "The feline thyroid gland is a single bilobar gland located in the neck region of cats, ventral to the trachea between the larynx and xiphoid process. The two lobes of the thymus do not interconnect. Enlarged thyroid gland is seen in association with hyperthyroidism. The function of the thyroid is to; 1  regulate metabolic function, via production of thyroxine (T4) and thriiodothyronine (T3). 2  These biologically active hormones require the dietary uptake of iodine for activation."}, {"url": "http://www.vetinfo.com/feline-hypothyroidism-symptoms.html", "passage_text": "Feline hypothyroidism is a dysfunction of the thyroid gland, a small gland located in your cat's throat. If your cat is suffering from hypothyroidism, levels of T3 and T4 thyroid hormones in his blood will be low. In many cases of feline hypothyroidism, your vet will be able to feel differences in the thyroid gland by palpitating your cat's throat."}, {"url": "http://vetmedicine.about.com/od/diseasesconditionsfaqs/f/thyroidFAQ.htm", "passage_text": "Diseases of the thyroid gland are common in dogs and cats (humans, too). Dogs with thyroid disease are more commonly hypothyroid (underactive gland) and cats with thyroid disease are more commonly hyperthyroid (overactive gland). This article discusses thyroid anatomy, common conditions and treatment options for dogs and cats with thyroid disease. There are four treatment options for hyperthyroidism in cats: 1  Medical: pills (methimazole) given once or twice daily for life. 2  Surgery: removal of the thyroid gland. 3  NOTE: this option is less commonly recommended due to risk and expense."}, {"url": "http://www.petplace.com/article/cats/diseases-conditions-of-cats/body-structure-function/structure-and-function-of-the-thyroid-gland-in-cats", "passage_text": "Below is information about the structure and function of the feline thyroid gland. We will tell you about the general structure of how the thyroid gland works in cats, common diseases that affect the thyroid gland, and common diagnostic tests performed in cats to evaluate the thyroid gland. Weight gain, sluggishness, and poor hair coat may be seen associated with this disorder. Thyroid tumors may occur in cats. The most common thyroid tumor of cats is a benign tumor that produces excessive amounts of thyroxine, and produces signs of hyperthyroidism. Malignant tumors of the thyroid are less common."}, {"url": "http://www.petplace.com/article/cats/diseases-conditions-of-cats/body-structure-function/structure-and-function-of-the-thyroid-gland-in-cats", "passage_text": "Hypothyroidism is a rare disorder of cats that arises when the thyroid gland becomes underactive and produces insufficient amounts of T4. Weight gain, sluggishness, and poor hair coat may be seen associated with this disorder. Thyroid tumors may occur in cats. The most common thyroid tumor of cats is a benign tumor that produces excessive amounts of thyroxine, and produces signs of hyperthyroidism. Malignant tumors of the thyroid are less common."}, {"url": "http://www.vet.cornell.edu/hospital/services/Companion/Internal/conditions/felinehyperthyroidism.cfm", "passage_text": "Feline hyperthyroidism is a disorder resulting from excessive thyroid hormone. The disease occurs in middle to older cats without sex or breed predilection. Though functional benign enlargement (adenoma) is most common (98%), thyroid carcinoma (cancer) is another cause (2%). "}, {"url": "http://www.our-happy-cat.com/cat-thyroid.html", "passage_text": "The only way to make an accurate diagnosis is to take your cat to the vets. Your vet will try to feel with their hands to see if the cat thyroid gland in the neck is enlarged or not. This is not always easy to do as the glands are in a difficult position on the cats neck. If your vet suspects that there is a problem they will recommend a blood test to be taken. There are two different thyroid conditions that can affect both humans and cats alike, they are: Feline Hyperthyroidism-This is when the thyroid gland becomes overactive and produces too much of the hormone that regulates the body. When this happens the body's metabolism speeds up and works too fast. This causes other organs in the body to over work as well, which in turn can lead onto other cat health problems"}]