[{"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=55", "passage_text": "Green peas are a very good source of vitamin K, manganese, dietary fiber, vitamin B1, copper, vitamin C, phosphorus, and folate. They are also a good source of vitamin B6, niacin, vitamin B2, molybdenum, zinc, protein, magnesium, iron, potassium, and choline. For an in-depth nutritional profile click here: Green peas. 1 Recent research has shown that green peas are a reliable source of omega-3 fats in the form of alpha-linolenic acid (ALA). 2  In one cup of green peas, you can expect to find about 30 milligrams of ALA. 3  About 130 milligrams of the essential omega-6 fatty acid, linoleic acid, can also be found in a cup of green peas."}, {"url": "http://www.livestrong.com/article/85539-nutritional-values-peas/", "passage_text": "Peas contain a number of vitamins, and are a surprisingly good source of vitamin C. One cup of peas, in fact, will give a person 98 percent of her recommended daily value for vitamin C, according to nutritiondata.com. Fiber, Carbs, Protein and Fat. Peas are full of fiber. One cup of peas provides 10 percent of the recommended intake of daily dietary fiber, or 2.5 g."}, {"url": "http://www.nutrition-and-you.com/green-peas.html", "passage_text": "Health benefits of green peas. Green peas are one of the most nutritious leguminous vegetables rich in health benefiting phyto-nutrients, minerals, vitamins and anti-oxidants. Fresh, tender peas are relatively low in calories on comparison to beans, and cowpeas. 100 g of green peas carry just 81 calories, and no cholesterol. Garden peas are also good in vitamin K. 100 g of fresh seeds contain about 24.8 µg or about 21% of daily requirement of vitamin K-1 (phylloquinone). Vitamin K has been found to have a potential role in bone mass building function (mineralization) through promotion of osteotrophic activity inside the bone cells."}, {"url": "http://www.nutrition-and-you.com/green-peas.html", "passage_text": "Green peas nutrition facts. Sweet, delicious green peas, also popular as garden peas, are one of the ancient cultivated vegetables grown for their succulent nutritious green seeds. Peas probably have originated in the sub-Himalayan plains of north-west India. Garden peas are also good in vitamin K. 100 g of fresh seeds contain about 24.8 µg or about 21% of daily requirement of vitamin K-1 (phylloquinone). Vitamin K has been found to have a potential role in bone mass building function (mineralization) through promotion of osteotrophic activity inside the bone cells."}, {"url": "http://lifestyle.iloveindia.com/lounge/benefits-of-peas-1852.html", "passage_text": "There are different varieties of green peas such as sweet peas, English peas, garden peas, etc. Apart from being very rich in protein, they hold a high nutritional value in the form of vitamins and minerals too. Owing to this, they have been associated with a large number of nutrition benefits. If you want to learn more about the health benefits of eating green peas, read on."}, {"url": "http://www.livestrong.com/article/85539-nutritional-values-peas/", "passage_text": "Nutritional Values for Peas. Peas have many nutrients. Peas in the pod are a crunchy, healthy snack. One cup of peas has just 41 calories and is packed with vitamins, minerals and fiber. Fiber, Carbs, Protein and Fat. Peas are full of fiber. One cup of peas provides 10 percent of the recommended intake of daily dietary fiber, or 2.5 g."}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=55", "passage_text": "In addition to the nutrients highlighted in our ratings chart, an in-depth nutritional profile for Green peas is also available. This profile includes information on a full array of nutrients, including carbohydrates, sugar, soluble and insoluble fiber, sodium, vitamins, minerals, fatty acids, amino acids and more. 1 Recent research has shown that green peas are a reliable source of omega-3 fats in the form of alpha-linolenic acid (ALA). 2  In one cup of green peas, you can expect to find about 30 milligrams of ALA. 3  About 130 milligrams of the essential omega-6 fatty acid, linoleic acid, can also be found in a cup of green peas."}]