[{"url": "http://www.promocell.com/products/human-primary-cells/keratinocytes/", "passage_text": "Epidermal keratinocytes originate in the stratum basale and move up through the layers of the epidermis. During this movement, they undergo gradual differentiation and morphology changes until they reach the stratum corneum, where they form a layer of nucleus-free, flat, and highly keratinized squamous cells. Keratinocytes. Primary Normal Human Epidermal Keratinocytes (NHEK) are available from single or from pooled donors isolated from the epidermis of juvenile foreskin or adult skin from different locations like the face, the breasts, the abdomen, and the thighs."}, {"url": "https://en.wikipedia.org/wiki/Keratinocyte", "passage_text": "A keratinocyte is the predominant cell type in the epidermis, the outermost layer of the skin, constituting 90% of the cells found there. Those keratinocytes found in the basal layer (stratum basale) of the skin are sometimes referred to as basal cells or basal keratinocytes. Since keratinocyte differentiation inhibits keratinocyte proliferation, factors that promote keratinocyte proliferation should be considered as preventing differentiation. These factors include: 1  The transcription factor p63, which preventing epidermal stem cells to differentiate into"}, {"url": "https://en.wikipedia.org/wiki/Keratinocyte", "passage_text": "Within the epidermis keratinocytes are associated with other cell types such as melanocytes and Langerhans cells. Keratinocytes form tight junctions with the nerves of the skin and hold the Langerhans cells and intra-dermal lymphocytes in position within the epidermis. Since keratinocyte differentiation inhibits keratinocyte proliferation, factors that promote keratinocyte proliferation should be considered as preventing differentiation. These factors include: 1  The transcription factor p63, which preventing epidermal stem cells to differentiate into keratinocytes."}, {"url": "https://en.wikipedia.org/wiki/Keratinocyte", "passage_text": "During this differentiation process, keratinocytes permanently withdraw from the cell cycle, initiate expression of epidermal differentiation markers, and move suprabasally as they become part of the stratum spinosum, stratum granulosum and eventually become corneocytes in the stratum corneum. Since keratinocyte differentiation inhibits keratinocyte proliferation, factors that promote keratinocyte proliferation should be considered as preventing differentiation. These factors include: 1  The transcription factor p63, which preventing epidermal stem cells to differentiate into keratinocytes."}, {"url": "http://www.answers.com/Q/Keratinocytes_are_an_important_epidermal_cell_because_they", "passage_text": "This layer of the skin has blood supply, and cells that are in the dermal layer stay al … ive just fine. However, as cells in the upper layer, the epidermis, die; the skin cells in the dermal layer gets, pushed up into the epidermal layer. In this layer of the skin, there is no blood supply. An epidermal cell is a cell that is part of the outer layer of an organism. For example, in humans, skin cells are epidermal. Leaves on plants have epidermal layers on the to … p and bottom of the leaf."}, {"url": "http://www.answers.com/Q/Keratinocytes_are_the_most_important_of_the_epidermal_cells_because", "passage_text": "An epidermal cell is a cell that is part of the outer layer of an organism. For example, in humans, skin cells are epidermal. Leaves on plants have epidermal layers on the to … p and bottom of the leaf. "}, {"url": "http://www.answers.com/Q/Keratinocytes_are_an_important_epidermal_cell_because_they", "passage_text": "Keratinocytes are the most important of the epidermal cells because? they produce a fibrous protein that gives the skin its protective  properties. An epidermal cell is a cell that is part of the outer layer of an organism. For example, in humans, skin cells are epidermal. Leaves on plants have epidermal layers on the to … p and bottom of the leaf."}, {"url": "http://www.easynotecards.com/print_list/13190?fs=2&dis=1", "passage_text": "20) Keratinocytes are an important epidermal cell because ________. A) they produce a fibrous protein that gives the skin much of its protective properties. B) they are able to transform from living cells to plasma membranes and still function. "}]