[{"url": "http://www.canterbury-tales.net/pardoners-tale/index.html", "passage_text": "The Pardoner s Tale is a unique story introduced by a unique character. The Pardoner preaches against sin and avarice by quoting that greed is the root of all evil. In his introduction to the others in the Canterbury Tales, he claims he has relics that he shows when he is preaching. These relics, he admits, are fake, and that he is gripped by the very greed he preaches against. Sin and avarice are the main points of the Pardoner s tale. The tale is often used by preachers to illustrate the vices that can lead to death. One can assume that the Pardoner, having covered his own profession, has practiced this tale several times."}, {"url": "http://www.sparknotes.com/lit/canterbury/section11.rhtml", "passage_text": "Summary: Introduction to the Pardoner’s Tale. The Host reacts to the Physician’s Tale, which has just been told. He is shocked at the death of the young Roman girl in the tale, and mourns the fact that her beauty ultimately caused the chain of events that led her father to kill her. Summary: The Pardoner’s Tale. The Pardoner describes a group of young Flemish people who spend their time drinking and reveling, indulging in all forms of excess. After commenting on their lifestyle of debauchery, the Pardoner enters into a tirade against the vices that they practice."}, {"url": "http://www.answers.com/Q/What_type_of_literature_is_the_pardoner's_tale", "passage_text": "The Pardoner's Tale is one of the Canterbury Tales by Geoffrey  Chaucer. In the Prologue, the Pardoner begins by describing his  job. The situational irony in the perdoners tale is that In The Canterbury Tales by Geoffrey Chaucer the Pardoner's actions of dishonesty and greed are prime examples of situationa … l irony. Situational irony is when something or someone does the opposite of what is expected."}, {"url": "https://en.wikipedia.org/wiki/The_Pardoner%27s_Tale", "passage_text": "Though the Pardoner preaches against greed, the irony of the character is based in the Pardoner's hypocritical actions. He admits extortion of the poor, pocketing of indulgences, and failure to abide by teachings against jealousy and avarice. In the General Prologue of the Tales, the Pardoner is introduced with these lines: With hym ther rood a gentil Pardoner. Of Rouncivale, his freend and his compeer, That streight was comen fro the court of Rome."}, {"url": "http://literature.wikia.com/wiki/The_Pardoner%27s_Tale", "passage_text": "1,181 pages on this wiki. The Young Man Meets Death, a 15th century Dutch print. The Pardoner's Tale (written in the original Middle English as The Pardoners Tale without an apostrophe) is a short story in verse from The Canterbury Tales by Geoffrey Chaucer. The tale takes the form of a religious fable which warns of the dangers of sin. "}, {"url": "http://www.studymode.com/essays/Irony-In-The-Pardoner's-Tale-80791.html", "passage_text": "Many tales are told in Chaucer's The Canterbury Tales. Probably the greatest on is The Pardoner's Tale. A greedy Pardoner who preaches to feed his own desires tells The Pardoner's Tale. This story contains excellent examples of verbal, situational, and dramatic irony. Verbal irony occurs when a writer or speaker says one thing but really means something quite different. Situational irony occurs when what actually happens is the opposite of what is expected or appropriate. An instance where situational irony occurs is in the prologue where the Pardoner states that he preaches that the root of all evil is avarice."}, {"url": "http://chaucer.lmc.gatech.edu/the-pardoners-tale-and-the-canterbury-tales-as-a-death-warrant/", "passage_text": "The Pardoner’s Tale and the Canterbury Tales as a Death Warrant. Posted on September 23, 2012 by KSnyder15. In week five of our class we discussed Chaucer’s “The Pardoner’s Tale” (the prologue and the tale itself) and “The Canterbury Tales as a Death Warrant” chapter from the Jones text. A modern “wooden tapestry” depicting the characters in the Pardoner’s tale. The Pardoner tells us a tale of three young men who spend all of their time drinking, swearing, gambling, and indulging in excess."}, {"url": "https://en.wikipedia.org/wiki/The_Pardoner%27s_Tale", "passage_text": "In the order of The Canterbury Tales, the Pardoner's Prologue and Tale are preceded by The Physician's Tale. The Physician's Tale is a harrowing tale about a judge who plots with a churl [low fellow] to abduct a beautiful young woman; rather than allow her to be raped, her father beheads her. In the General Prologue of the Tales, the Pardoner is introduced with these lines: With hym ther rood a gentil Pardoner. Of Rouncivale, his freend and his compeer, That streight was comen fro the court of Rome."}, {"url": "https://en.wikipedia.org/wiki/The_Pardoner%27s_Tale", "passage_text": "The tale and prologue are primarily concerned with what the Pardoner says is his theme: Radix malorum est cupiditas (Greed is the root of [all] evils). In the General Prologue of the Tales, the Pardoner is introduced with these lines: With hym ther rood a gentil Pardoner. Of Rouncivale, his freend and his compeer, That streight was comen fro the court of Rome."}]