[{"url": "http://pstcc.edu/departments/natural_behavioral_sciences/Web%20Physics/Experiment%2006%20PHYS%201310.htm", "passage_text": "The force of friction acts against the direction of motion. Note that and consequently, If the externally applied force (F) is just equal to the force of static friction, Fs, then the object is on the verge of slipping, and the coefficient of friction involved is called the coefficient of static friction, μs."}, {"url": "http://www.school-for-champions.com/experiments/friction_measure_coefficient_with_ramp.htm", "passage_text": "For a sliding object, the static coefficient of friction results in the force required to start the object moving. Once the object is sliding at a steady rate, the kinetic coefficient of friction results in the force required to keep the object moving at that velocity. That is the angle where the force of gravity is strong enough to overcome the static friction. By simply knowing the angle or the inclination, you can then calculate the static sliding coefficient of friction between the two materials. You can cover the ramp with various materials to determine different coefficients."}, {"url": "http://www.youtube.com/watch?v=Vpq877lvG_M", "passage_text": "This is a simple proof involving friction on an incline plane. It shows that the coefficient of static friction is equal to the tangent of the angle on the inclined plane. 1  Education. 2  Standard YouTube Licens"}, {"url": "http://www.understandingforce.com/calculatingfriction.html", "passage_text": "= 0.2. The coefficient of static friction between the body and the plane is 0.2. Question 2: A body of mass 40kg is given an acceleration of 10m/s2 on horizontal ground for which the coefficient of friction is 0.5. Calculate the force required to accelerate the body. Since at the point of sliding, frictional force is proportional to the normal reaction, giving the equation. F = µR. Therefore, µ = F/R. /R = /Wcosθ = µ. µ = /Wcos θ. µ = tanθ. Therefore, the coefficient of friction, µ for a body on an inclined plane is always given as the tangent of the angle of inclination."}, {"url": "http://web2.utc.edu/~pbs273/Iplanelab.pdf", "passage_text": "UTC Physics 1030L: Friction, Work, and the Inclined Plane 40 The magnitude of the frictional force, F f, on an object, can also be described by: F f = μN (eq. 3) where μ is the coefficient of friction. If the block is at rest, we say that the force of static friction, F s is acting to counterbalance the weight component in the x-direction, and the coefficient of friction is that for the static case, μ s. UTC Physics 1030L: Friction, Work, and the Inclined Plane 43 PART II. To find the relationship of efficiency of the machine to the angle β. 1. Use your determined value of μ k to calculate the theoretical efficiency (e T) of your machine when the angle β = 1°, 10°, 20°, 30°, 40°, 50°, 60°, 70°, 80°, and 89°."}, {"url": "http://www.school-for-champions.com/experiments/friction_measure_coefficient_with_ramp.htm", "passage_text": "You can use different combinations of materials to measure their coefficients of friction. For example, you can use a: 1  Wooden board and a brick to calculate the kinetic coefficient of friction between wood and brick material. 2  Sheet of iron on the board and an iron block to slide down the ramp. 3  Sheet of iron with film of oil on it and an iron block to slide down the ramp. That is the angle where the force of gravity is strong enough to overcome the static friction. By simply knowing the angle or the inclination, you can then calculate the static sliding coefficient of friction between the two materials. You can cover the ramp with various materials to determine different coefficients."}, {"url": "http://scienceteacherprogram.org/physics/wang03.html", "passage_text": "1. understand that a coefficient of friction could be determined via an inclined plane; 2. collect experimental data and calculate the corresponding results of coefficient; 3. compare the values of coefficient generated from different pairs of surfaces. 2. Gradually increase the slope of the plane until the penny first begins to slide down, and record the angle of the inclined plane on the data table below. 3. Repeat Step 1 and Step 2 twice, and apply a formula ms = tanq to calculate the coefficient of friction for those three trials."}, {"url": "http://physics.bu.edu/%7Eduffy/semester1/c6_measuremus.html", "passage_text": "f. because this is the angle at which the force of static friction equals its maximum value. Use a coordinate system with +x down the slope and +y perpendicular to the slope. Split the force of gravity into x and y components. Apply Newton's second law twice."}, {"url": "http://pstcc.edu/departments/natural_behavioral_sciences/Web%20Physics/Experiment%2006%20PHYS%201310.htm", "passage_text": "Equipment: An incline, a wooden block, a weight hanger, a set of slotted weights, a cord and pulley system, a sheet of graph paper, and a scientific calculator. Theory: The Coefficient of friction is defined as the ratio of force of friction to the normal force, μ = F / N. Consider the following two cases (Figures). One is for static friction and the other for kinetic friction. At constant velocity to the Right, F = F k. On the verge of motion to the Right, F = Fs μ k = Fk / N. Note that and consequently, If the externally applied force (F) is just equal to the force of static friction, Fs, then the object is on the verge of slipping, and the coefficient of friction involved is called the coefficient of static friction, μs."}, {"url": "http://scienceteacherprogram.org/physics/wang03.html", "passage_text": "In order to calculate m s (static coefficient), the slope (angle) of the inclined plane is increased gradually until the object first begins to slide down the plane. At that angle, the component of the weight of the object (F g) parallel to the plane has just succeeded in overcoming the force of static friction. 2. Gradually increase the slope of the plane until the penny first begins to slide down, and record the angle of the inclined plane on the data table below. 3. Repeat Step 1 and Step 2 twice, and apply a formula ms = tanq to calculate the coefficient of friction for those three trials."}]