[{"url": "http://www.salarycomparison.com/pilots/airline-pilot-salary", "passage_text": "PayScale reported these airline pilot salaries in some states in the US: Texas at $25,168 to $213,558; California at $37,095 to $193,991; Florida at $47,646 to $205,328; New York at $41,718 to $166,107; Colorado at $36,065 to $165,728; Georgia at $25,532 to $207,487; and Illinois at $30,639 to $176,169. In Glassdoor, the recorded basic United Airline pilot salary in within the rates of $65,000 and $138,000. Total pay rates on the other hand are from $65,000 to $147,000. Wilflyforfood.com’s data shows that pay rates will vary depending on experience and aircraft being flown."}, {"url": "http://www.salarycomparison.com/pilots/airline-pilot-salary", "passage_text": "India airline pilot salary is anywhere within the rates of Rs 223,008 and Rs 5,128,894 that may include bonuses of Rs 1,987 to Rs 402,683 according to PayScale. The median airline pilot salary in this country is Rs 1,871,626. In Glassdoor, the recorded basic United Airline pilot salary in within the rates of $65,000 and $138,000. Total pay rates on the other hand are from $65,000 to $147,000. Wilflyforfood.com’s data shows that pay rates will vary depending on experience and aircraft being flown."}, {"url": "http://www.hellogiri.com/how-to-become-commercial-pilot-in-india-salary-career-scope-of-pilot/", "passage_text": "Commercial Pilot is getting one of the highest salary in India, Fresh pilot salary is around Rs 1.5 Lakh per moth for domestic airlines. Salary moves up rapidly with year of experience and on the international route. Experienced pilot on international route can get 5-6 lakh Rupees per month as salary. To become a pilot, aspirants need to join Air flying schools after completion of 10+2, they should pass the 10+2 exam with physic, chemistry, math. Don’t confuse with the job of pilot of Indian air Force. IAF pilot is selected through NDA exam, training is free and pay is based on Indian gov salary (Air Force) which is around 40-50 K Rs per moth. IAF pilot can not to leave their job to become commercial pilot easily. You may also like:"}, {"url": "http://www.indeed.com/salary/Commercial-Pilot.html", "passage_text": "Average Commercial Pilot salaries for job postings nationwide are 37% higher than average salaries for all job postings nationwide. "}, {"url": "https://www.pea.com/airline-pilot-salary/", "passage_text": "Starting Salaries. Airline pilot salaries start low at about $20,000 a year, and most airlines pay hourly. The average airline pilot logs 75 hours a month in the air and 150 hours a month performing ground duties. Each airline has its own schedule, but nearly all offer standard raises annually. Thanks to this steady increase, airline and commercial pilots can expect to work their way up to a median annual wage of about $98,410. Pilots experience the biggest salary increase in their first five years."}, {"url": "http://www.salarycomparison.com/pilots/airline-pilot-salary", "passage_text": "Airline pilot salary in accordance to experience will give you these wages: less than a year is from $12,305 to $143,034 per annum; 1 to 4 years is from $21,000 to $120,000; 5 to 9 years is from $35,353 to $121,641; 10 to 19 years is from $49,111 to $197,875; and 20 years or more is from $96,093 to $230,520. In Glassdoor, the recorded basic United Airline pilot salary in within the rates of $65,000 and $138,000. Total pay rates on the other hand are from $65,000 to $147,000. Wilflyforfood.com’s data shows that pay rates will vary depending on experience and aircraft being flown."}, {"url": "http://www.salarycomparison.com/pilots/airline-pilot-salary", "passage_text": "SalaryExplorer says that the average pilot salary in Emirates is AED 25,161 per month. This recorded a maximum salary of AED 58,000 and a minimum salary of AED 5,000 per month. PayScale on the other hand says the median wage is AED 350,337. In Glassdoor, the recorded basic United Airline pilot salary in within the rates of $65,000 and $138,000. Total pay rates on the other hand are from $65,000 to $147,000. Wilflyforfood.com’s data shows that pay rates will vary depending on experience and aircraft being flown."}, {"url": "http://www.naukrihub.com/salary-in-india/pilot.html", "passage_text": "“Exciting and sky touching career of pilot also have sky high salary. This article gives an overview of pilot salary in India with much focus on their salary difference arises in industry with different experience level, city and certification.”. Related. Filed Under: Salary in India Tagged With: experience, industry and gender based salary of Pilot., Pilot salary in India a€“ â get free details of salary Of pilot In india by job. category"}, {"url": "https://in.answers.yahoo.com/question/index?qid=20080412175921AAt7Ssr", "passage_text": "Best Answer: These are average salaries (commercial airliners): (a) A brand new pilot starts from 70,000 Rs/month (as in Indian Airlines). The Govt Dept of Labor, (www.bls.gov) Bureau of statistics has information about median salaries for different professions and details of additional compensation offered. Other online resources are salary.com and payscale. Your salary will also depend on your educational qualification and how you handle your career."}]