[{"url": "http://www.file.net/process/miragent.exe.html", "passage_text": "The program is not visible. You can uninstall this program in the Control Panel. The file has a digital signature. The file is not a Windows system file. The program listens for or sends data on open ports to a LAN or the Internet. There is no information about the author of the file. Miragent.exe is able to monitor applications. Therefore the technical security rating is 34% dangerous, however you should also read the user reviews. The software publisher Mandiant MANDIANT Intelligent Response Agent or Mandiant Intelligent Response). Recommended: Identify miragent.exe related errors. Important: Some malware camouflages itself as miragent.exe. Therefore, you should check the miragent.exe process on your PC to see if it is a threa"}, {"url": "http://ww5.komen.org/BreastCancer/BreastMRI.html", "passage_text": "Breast magnetic resonance imaging (MRI) uses magnetic fields to create an image of the breast. It is more invasive than mammography because a contrast agent is given through an IV before the procedure. At this time, breast MRI is mostly used in breast cancer diagnosis and staging. "}, {"url": "http://www.freefixer.com/library/file/MIRAgent.exe-31353/", "passage_text": "MIRAgent.exe is part of Mandiant Intelligent Response and developed by Mandiant Corporation according to the MIRAgent.exe version information. MIRAgent.exe's description is  Mandiant Agent Manager . MIRAgent.exe is usually located in the 'C:\\Program Files\\Mandiant\\Mandiant Intelligent Response Agent\\' folder. If you have additional information about the file, please share it with the FreeFixer users by posting a comment at the bottom of this page. Hi, my name is Roger Karlsson. I've been running this website since 2006. I want to let you know about the FreeFixer program. FreeFixer is a freeware tool that analyzes your system and let you manually identify unwanted programs. Once you've identified some malware files, FreeFixer is pretty good at removing them."}, {"url": "http://www.shouldiremoveit.com/MANDIANT-Intelligent-Response-Agent-8959-program.aspx", "passage_text": "Powered by the Mandiant Intelligent Response® (MIR) appliance, the Mandiant Platform brings together all of the capabilities and intelligence that security organizations need to detect, respond and contain attacks which get through their preventive defenses. 1 When you find the program MANDIANT Intelligent Response Agent, click it, and then do one of the following: 2  Windows Vista/7/8: Click Uninstall. 3  Windows XP: Click the Remove or Change/Remove tab (to the right of the program)."}, {"url": "http://www.shouldiblockit.com/miragent.exe-8584a25222700fcbd4eb0cca13bdaaf3.aspx", "passage_text": "Overview. miragent.exe runs as a service under the name Intelligent Response Agent with extensive SYSTEM privileges (full administrator access). The file is digitally signed by MANDIANT Corporation which was issued by the VeriSign certificate authority (CA)"}, {"url": "http://www.shouldiremoveit.com/MANDIANT-Intelligent-Response-Agent-8959-program.aspx", "passage_text": "Overview. MANDIANT Intelligent Response Agent is a software program developed by MANDIANT. The most common release is 2.3.3100, with over 98% of all installations currently using this version. The setup package is about 9.41 MB (9,863,168 bytes) when donwloaded. 1 When you find the program MANDIANT Intelligent Response Agent, click it, and then do one of the following: 2  Windows Vista/7/8: Click Uninstall. 3  Windows XP: Click the Remove or Change/Remove tab (to the right of the program)."}, {"url": "http://www.scmagazine.com/mandiant-intelligent-response-v145/review/3465/", "passage_text": "Mandiant Intelligent Response (MIR) is a powerful incident response investigation and evidence collection tool. It is designed by and for incident responders to collect evidence from possibly compromised machines anywhere in a company's network. "}, {"url": "https://en.wikipedia.org/wiki/Mail.Ru", "passage_text": "Mail.Ru Group (London Stock Exchange listed since November 5, 2010) is a Russian Internet company. It was started in 1998 as an e-mail service and went on to become a major corporate figure in the Russian-speaking segment of the Internet. "}]