[{"url": "http://medinahall.com/users/editorialdisp.php?mn=710232&fn=prices", "passage_text": "The price is listed below along with what is included for Medina Hall. Dates are limited! We do not charge per person and all we do is rent the hall with chairs, tables, a bar, and Dj booth. You are free to bring in your own food, music and drinks and have as many guests upto 160ppl. If you have less people, you will have additional space to use for a dance floor or lounge area. We do not hold dates for anyone. A $400 minimum deposit is required to hold and confirm the date of your choice. The balance is due one week prior to your party. You are subject to cancellation if balance is not paid in full one week prior to the party, unless you notify a Medina Hall Representative."}, {"url": "http://www.howmuchisit.org/how-much-does-hall-rental-cost/", "passage_text": "1 This can cost anywhere from $50 to $600 per hour. 2  A VFW hall is going to range anywhere from $50 to as much as $300 per hour depending on the location. 3  Most halls are going to demand a higher price tag on the weekends since they are in greater demand. 1 Also, keep in mind that most are going to want a 2-4 hour minimum length in order to book the hall. 2  Some halls will charge per person rather than per hour. 3  For example, hotels with conference centers can cost as much as $20 to $60 per person."}, {"url": "http://www.howmuchisit.org/banquet-hall-cost/", "passage_text": "1 On average, the cost of renting a banquet hall without any sort of catering or other services is going to range anywhere between $500 and $1,800. The leasing costs are going to greatly vary depending on your location, how many people are attending, what you wish to be included, and more. How much is it? 1 "}, {"url": "http://occasionshall.com/users/editorialdisp.php?mn=710208&fn=prices", "passage_text": "Dates are limited! We do not charge per person and all we do is rent the hall with chairs, tables, a bar, and Dj booth. You are free to bring in your own food, music and drinks and have as many guests upto 80ppl. If you have less people, you will have additional space to use for a dance floor or lounge area. The hall rental rate for Occasions Hall: Fridays are $695 (choose any 5 hours). Saturdays are $995 (Evening Rental) If you choose daytime party and end by 5pm -$300 discount -- $695 (Saturday Afternoon Must end by 5pm). Sundays are $695 (choose any 5 hours). The price includes an allocated amount of hall rental time-choice of 5 hours in the evening or day for the event; you can come in prior to set up (2 Hours guaranteed, but we allow you to come in earlier if it is ready). Banquet Seats and tables included for our maximum capacity which is 80 people."}, {"url": "http://weddings.costhelper.com/wedding-reception-venue.html", "passage_text": "1 Some catering halls charge $500 to $2,500 or more for space rental, including linens, tables, chairs, flatware and stemware -- along with a per-person catering fee, usually with a minimum total food-and-drink expenditure. 1 Tip: Couples can save $200 to $2,000 or more by finding a location for both the ceremony and the reception. 2  But, if chairs must be moved from the wedding area to reception area, you might be charged up to $3 per chair for the service."}, {"url": "http://www.howmuchisit.org/how-much-does-hall-rental-cost/", "passage_text": "How much are hall rental prices? 1  On average, most halls are going to charge for the simple setups. 2  A VFW hall is going to range anywhere from $50 to as much as $300 per hour depending on the location. 3  Some halls will charge per person rather than per hour. 1 Also, keep in mind that most are going to want a 2-4 hour minimum length in order to book the hall. 2  Some halls will charge per person rather than per hour. 3  For example, hotels with conference centers can cost as much as $20 to $60 per person."}, {"url": "http://www.howmuchisit.org/how-much-does-hall-rental-cost/", "passage_text": "1 This is going to include tables, chairs, electricity, as well as access to a kitchen or bar. 2  This can cost anywhere from $50 to $600 per hour. 3  A VFW hall is going to range anywhere from $50 to as much as $300 per hour depending on the location. 1 Also, keep in mind that most are going to want a 2-4 hour minimum length in order to book the hall. 2  Some halls will charge per person rather than per hour. 3  For example, hotels with conference centers can cost as much as $20 to $60 per person."}, {"url": "http://www.howmuchisit.org/how-much-does-hall-rental-cost/", "passage_text": "1 Some halls will charge per person rather than per hour. 2  For example, hotels with conference centers can cost as much as $20 to $60 per person. 3  For a 100 person 4-6 hour party, the hotel conference room can cost as much as $6,000. 4  Some hotels will include catering, open bars and more. 1 Also, keep in mind that most are going to want a 2-4 hour minimum length in order to book the hall. 2  Some halls will charge per person rather than per hour. 3  For example, hotels with conference centers can cost as much as $20 to $60 per person."}]