[{"url": "http://bewitchingnames.blogspot.com/2011/09/indigo.html", "passage_text": "Here's a name that has a strong artsy, hippy, and New Age vibe. Indigo (pronounced IN-dih-goh) is a color name that refers to a deep purplish-blue. It is ultimately derived from the Greek word indikon, meaning from India.. I would imagine that a family with someone named Indigo would be a creative one because that's the stereotype. The name is a bit of a hippy cliche, but that doesn't stop it from being cool. Indigo is a name with great mysticism attached to it, and for that it's perfectly witchy."}, {"url": "http://www.empower-yourself-with-color-psychology.com/color-indigo.html", "passage_text": "The color indigo is the color of intuition and perception and is helpful in opening the third eye. It promotes deep concentration during times of introspection and meditation, helping you achieve deeper levels of consciousness. The negative color meaning of indigo relates to fanaticism and addiction. Its addiction encompasses everything from a need for recognized qualifications to a need for illegal drugs, from the workaholic to the religious fanatic."}, {"url": "http://www.babynamewizard.com/baby-name/girl/indigo", "passage_text": "Not only is the colour Indigo a very dark purply blue, which seems a very masculine colour to me, but the O ending is masculine sounding too-eg Hugo/Orlando/Marco... I can't think of another girls name with this ending and think in many languages the O ending is indeed considered masculine. I named my daughter Indigo for 3 reasons. 1- she is our rainbow baby after many losses, so I loved the idea of a color name for her. 2-Blue and purple are my favorite colors. 3- It is a beautiful name and just felt right! The reaction to her name so far has been overwhelmingly positive."}, {"url": "http://www.ebabynames.com/#!meaning-of-Indigo", "passage_text": "The meaning of Indigo is  Blue-purple color  and  Indigo plant or dye  and  From India . Its origin is  English . This name is mostly being used as a unisex name. Last year it ranked 3,478th in the U.S. Social Security Administration list of most popular baby names. Indigo is derived from the Greek word Indikon (India). Indigo is a plant used for making a purple-blue dye."}, {"url": "http://www.babynamewizard.com/baby-name/girl/indigo", "passage_text": "This web site does list it as a unisex name. I named my daughter Indigo for 3 reasons. 1- she is our rainbow baby after many losses, so I loved the idea of a color name for her. 2-Blue and purple are my favorite colors. 3- It is a beautiful name and just felt right! The reaction to her name so far has been overwhelmingly positive."}, {"url": "http://www.ourbabynamer.com/meaning-of-Indigo.html", "passage_text": "Indigo is used as both a boys and girls name. It consists of 6 letters and 3 syllables and is pronounced In-di-go. In the U.S. in 2014, it ranked 1858 in baby name popularity for girls with 108 occurrences. It ranked 3227 in popular baby names for boys with 34 occurrences. "}, {"url": "http://www.meaning-of-names.com/latin-american-names/indigo.asp", "passage_text": "Meaning of Indigo. Latin-American name. In Latin-American, the name Indigo means-dark blue.The name Indigo originated as an Latin-American name. The name Indigo is most often used as a girl name or female name. Latin-American Name Meaning-dark blue. "}, {"url": "http://www.babynamewizard.com/baby-name/girl/indigo", "passage_text": "Comments and insights on the name Indigo: | Edit. Indigo has a powerfully creative/artistic image. Used for both boys and girls. I DIDN'T KNOW IT WAS A NAME. I JUST THOUGHT IT WAS A WORD! I really like this name, it's gorgeous and unique. I named my daughter Indigo for 3 reasons. 1- she is our rainbow baby after many losses, so I loved the idea of a color name for her. 2-Blue and purple are my favorite colors. 3- It is a beautiful name and just felt right! The reaction to her name so far has been overwhelmingly positive."}, {"url": "http://www.empower-yourself-with-color-psychology.com/color-indigo.html", "passage_text": "The color meaning of indigo reflects great devotion, wisdom and justice along with fairness and impartiality. It is a defender of people's rights to the end. Structure creates identity and meaning for indigo. In fact an indigo person cannot function without structure-it throws them right off balance. The negative color meaning of indigo relates to fanaticism and addiction. Its addiction encompasses everything from a need for recognized qualifications to a need for illegal drugs, from the workaholic to the religious fanatic."}, {"url": "http://www.thinkbabynames.com/meaning/0/Indigo", "passage_text": "Indigo is an uncommon first name for females and also a unique surname for all people. (2000 U.S. Census). Shown below is the baby name popularity of Indigo for girls. Indigo has yet to be ranked in the list thus far. "}]