[{"url": "http://wanttoknowit.com/uses-of-potassium-permanganate/", "passage_text": "1 Potassium permanganate is a very strong disinfectant and oxidant, which makes it a good candidate for water treatment. 2  It is commonly used to reduce the levels iron and manganese as well as removing the hydrogen sulfide which causes a smell similar to rotten eggs. 1 It can also be used to extend the life of cut flowers. 2  Potassium permanganate is also added to many survival kits because it can be used for starting a fire, sterilizing water and to create an easy-to-read distress sign in the snow."}, {"url": "https://en.wikipedia.org/wiki/Potassium_permanganate", "passage_text": "As an oxidant, potassium permanganate can act as an antiseptic. For example, dilute solutions are used to treat canker sores (ulcers), disinfectant for the hands and treatment for mild pompholyx, dermatitis, and fungal infections of the hands or feet. Acidic solutions of permanganate are reduced to the faintly pink manganese(II) ion (Mn 2+) and water. In neutral solution, permanganate is only reduced by three electrons to give MnO 2, wherein Mn is in a +4 oxidation state."}, {"url": "https://en.wikipedia.org/wiki/Potassium_permanganate", "passage_text": "Potassium permanganate is an inorganic chemical compound with the chemical formula KMnO 4. It is a salt consisting of K+ and MnO− 4 ions. Formerly known as permanganate of potash or Condy's crystals, it is a strong oxidizing agent. It dissolves in water to give intensely pink or purple solutions, the evaporation of which leaves prismatic purplish-black glistening crystals. In 2000, worldwide production was estimated at 30,000 tonnes. Acidic solutions of permanganate are reduced to the faintly pink manganese(II) ion (Mn 2+) and water. In neutral solution, permanganate is only reduced by three electrons to give MnO 2, wherein Mn is in a +4 oxidation state."}, {"url": "http://study.com/academy/lesson/what-is-potassium-permanganate-structure-uses-formula.html", "passage_text": "Lesson Summary. Potassium permanganate, also known as permanganate of potash or Condy's crystals, is a chemical compound with a chemical formula of KMnO4, made of a potassium (K+) ion and a permanganate (MnO4-) ion. It is a strong oxidizing agent, so it readily takes or accepts electrons from other substances"}, {"url": "http://wanttoknowit.com/uses-of-potassium-permanganate/", "passage_text": "Potassium permanganate is a chemical compound made up of potassium, manganese and oxygen. It is a dark purple crystal-like solid and when dissolved in water it creates an intense purple solution. It is a stable compound, but can cause fire if it comes into contact with a combustible material. 1 It can also be used to extend the life of cut flowers. 2  Potassium permanganate is also added to many survival kits because it can be used for starting a fire, sterilizing water and to create an easy-to-read distress sign in the snow."}, {"url": "http://www.theaquariumwiki.com/Potassium_permanganate", "passage_text": "What is it. Potassium permanganate (PP) is a compound that is used by aquarists for the disinfecting of plants or ornaments before placement into aquariums. It is used to remove organic build-up in tank water, and kill bacteria and fungi. It is also employed to treat some parasites that infect fish. The permanganate ion is a strong oxidizing agent. It dissolves in water to give deep purple/pink solutions, evaporation of which gives prismatic purple-black glistening crystals (see picture below). 1  Potassium permanganate stains skin and clothing and should be handled with care."}, {"url": "http://wanttoknowit.com/uses-of-potassium-permanganate/", "passage_text": "Uses of potassium permanganate. 1  Potassium permanganate is a very strong disinfectant and oxidant, which makes it a good candidate for water treatment. 2  It is commonly used to reduce the levels iron and manganese as well as removing the hydrogen sulfide which causes a smell similar to rotten eggs. 1 It can also be used to extend the life of cut flowers. 2  Potassium permanganate is also added to many survival kits because it can be used for starting a fire, sterilizing water and to create an easy-to-read distress sign in the snow."}, {"url": "https://answers.yahoo.com/question/index?qid=20070606084010AAqPoQQ", "passage_text": "Report Abuse. Potassium permanganate is used as an oxidizing agent in diverse chemical reactions in the laboratory and in industry. It also serves as a disinfectant and in deodorizers. It can be used as a reagent for the synthesis of many different kinds of chemical compounds. The uses of potassium permanganate are so many. It can be used for medical purpose, for treating skin diseases. It can also be a very effective treatment for fish diseases and also ideal in use for water treatment."}]