[{"url": "http://www.answers.com/Q/Who_owns_primark", "passage_text": "Answer by GavennyLad. Confidence votes 1.1K. Primark is a clothing retailer, operating over 223 stores in Ireland (where it is branded as Penneys), the United Kingdom, the Netherlands, Germany, Spain, Portugal and Belgium. The company's main headquarters are in Ireland, and it is a subsidiary of Associated British Foods (ABF) . "}, {"url": "http://www.dailymail.co.uk/news/article-3147295/Primark-founder-s-son-drowns-grandson-feared-dead-beach-tragedy-Ireland.html", "passage_text": "They were airlifted to Cork University Hospital by an Irish Coastguard helicopter but they were both pronounced dead a short time later. Mr Davis Ryan is still missing and the search is due to resume this morning. Mr Ryan Sr was the son of Primark-known in Ireland as Penneys-founder Arthur Ryan. He held a senior executive position at the company in Dublin. Mr Ryan, 79, opened his first shop in Dublin in 1969. The company later expanded into the UK, where it opened its first store in 1974. "}, {"url": "http://www.lowellsun.com/business/ci_28227516/irish-fashion-retailer-primark-coming-burlington-mall", "passage_text": "BURLINGTON -- Primark, a Dublin-based retailer of Irish fashion products, plans three stores in Massachusetts, including one at the Burlington Mall. According to Banker & Tradesman, Primark will lease 73,000 square feet from Sears on the second level of the Burlington Mall. "}, {"url": "http://www.philly.com/philly/blogs/style/Primark-coming-to-King-of-Prussia-Mall.html", "passage_text": "Layla Jones. Sears, the struggling department store chain announced Monday that it will be leasing space to the Irish retailer Primark. Primark is owned by Associated British Foods and will be leasing space in Sears’ across the Northeast United. King of Prussia Mall will be one of the sites acquiring a Primark space. Shoppers walk past a Primark clothing store a day after the store's opening on July 12, 2012 in Berlin, Germany. Primark will be leasing space in Sears department stores across the Northeastern United States in the next 12 to 18 months."}, {"url": "http://www.economist.com/news/business/21663221-rapidly-rising-super-cheap-irish-clothes-retailer-prepares-conquer-america-rivals-should", "passage_text": "The scene, captured in a video of a store opening in France last year, is common for Primark—the company dubs such exuberance “Primania”. The Irish retailer, owned by Associated British Foods (ABF), now sells more clothes than any other retailer in Britain. In 2006 Primark opened its first store in Spain. Since then it has marched steadily across the continent, establishing outposts in the Netherlands, Portugal, Germany, Belgium, Austria and France. "}, {"url": "https://en.wikipedia.org/wiki/Primark", "passage_text": "In May 2006, the first Primark store outside Ireland and the UK opened in Madrid, Spain. In December 2008, Primark opened its first stores in the Netherlands, followed in 2009 by its first stores in Portugal, Germany and Belgium. Further expansion and success in Ireland led to the move to the United Kingdom, and, in 1971, it opened a large store in Belfast City Centre before opening four out-of-town stores in England in 1973. In October 2011, Primark opened its first concession model."}, {"url": "http://www.cnbc.com/2015/09/21/primark-could-change-the-game-for-us-retailers.html", "passage_text": "Watch out US retail: Here comes the luck of the Irish. Courtney Reagan | @CourtReagan. SHARES. As if U.S. retail didn't have enough battles to fight, now it has to contend with the luck of the Irish. Dublin-based fast-fashion retailer Primark opened its first U.S. store in Boston's Downtown Crossing this month. And more expansion is on the way. Owned by U.K.'s Associated British Foods, Primark began in 1969 and has 292 stores in nine European countries. Its hallmark is its low prices, fashionable design and decent quality. Much of the merchandise is priced at less than a pizza: $15 jeans, $14 sweaters, and $3 towels."}, {"url": "http://www.mcall.com/business/mc-bethlehem-primark-distribution-center-opening-20150903-story.html", "passage_text": "Nicole Radzievich Contact ReporterOf The Morning Call. As Primark prepares to make its U.S. debut, it opens a distribution center in Bethlehem. Primark, a cut-price Irish retailer that will open its first U.S. store next week, held a ceremonial ribbon-cutting Thursday in Bethlehem for its new distribution center."}, {"url": "https://en.wikipedia.org/wiki/Primark", "passage_text": "Primark was first opened by Arthur Ryan in June 1969 in Mary Street, Dublin under the name Penneys. Further expansion and success in Ireland led to the move to the United Kingdom, and, in 1971, it opened a large store in Belfast City Centre before opening four out-of-town stores in England in 1973. In October 2011, Primark opened its first concession model."}, {"url": "https://en.wikipedia.org/wiki/Primark", "passage_text": "Primark in the Former Lewis's Building in Manchester city centre. Primark (PRY-mark) is an Irish clothing retailer operating in Austria, Belgium, France, Germany, Ireland (branded as Penneys in Ireland), Portugal, Spain, Netherlands, the United Kingdom, the United States and soon in Italy. Further expansion and success in Ireland led to the move to the United Kingdom, and, in 1971, it opened a large store in Belfast City Centre before opening four out-of-town stores in England in 1973. In October 2011, Primark opened its first concession model."}]