[{"url": "http://smallbusiness.chron.com/examples-prepaid-expenses-61652.html", "passage_text": "Businesses make advance payments for a variety of different expenses. Any expense that is paid in advance of actually receiving the benefit of the payment is considered a prepaid expense for accounting purposes. Prepaid expenses are recorded on a company’s balance sheet as a current asset, and then recognized as an expense when it is incurred. Debit the prepaid account for the amount that is added to stock, and credit the cash account to reflect the purchase. During each month's closing process, credit prepaid supplies for the estimated amount of supplies utilized during the month, and debit the supplies expense account."}, {"url": "http://smartweb.ks.gov/announcements/module-month/travel-expense/expense-types-and-payment-types", "passage_text": "Correct Entry. First, we'll look at accounting entries that were created when a 'Prepaid' Expense Type was correctly selected along with the 'PCard Lodging' Payment Type. The first line debits the prepaid account (140300). The second line is a system-generated line which credits the prepaid account (140300). This will cause a credit balance to remain in the prepaid account (140300) and will require correcting entries to be entered into the system. It is very important to note that any expense line with a payment type of 'PCard Airfare', 'PCard Lodging' or 'PCard Other' will not produce a reimbursement to the employee."}, {"url": "http://www.investopedia.com/terms/p/prepaidexpense.asp", "passage_text": "An example of expensing prepaid expenses would be if a company had a one-year insurance policy cost of $1200. As each month elapses, $100 of prepaid insurance would be expensed to the income statement until the account is empty at the end of the year. For example, insurance is a prepaid expense, because the purpose of purchasing insurance is to buy proactive protection in case something unfortunate happens. Clearly, no insurance company would sell insurance that covers the occurrence of an unfortunate event, after the fact, so insurance expenses must be pre-paid."}, {"url": "http://smallbusiness.chron.com/prepaid-expenses-accounts-payable-affect-cash-flow-52345.html", "passage_text": "Decrease in Prepayments. A decrease in prepaid expenses results in an increase in cash flow. Operating expenses are typically paid on a monthly basis, which is why any reduction in prepaid expenses will immediately benefit cash flow for the current month."}, {"url": "http://www.investopedia.com/terms/p/prepaidexpense.asp", "passage_text": "DEFINITION of 'Prepaid Expense'. A type of asset that arises on a balance sheet as a result of business making payments for goods and services to be received in the near future. For example, insurance is a prepaid expense, because the purpose of purchasing insurance is to buy proactive protection in case something unfortunate happens. Clearly, no insurance company would sell insurance that covers the occurrence of an unfortunate event, after the fact, so insurance expenses must be pre-paid."}, {"url": "http://smallbusiness.chron.com/examples-prepaid-expenses-61652.html", "passage_text": "Debit the related prepaid account for the amount of the advanced payment, and credit the cash account for an equal amount. When the services are rendered or the expense is incurred, credit the prepaid account and then debit the corresponding expense account in the ledger. Debit the prepaid account for the amount that is added to stock, and credit the cash account to reflect the purchase. During each month's closing process, credit prepaid supplies for the estimated amount of supplies utilized during the month, and debit the supplies expense account."}, {"url": "http://www.investopedia.com/terms/p/prepaidexpense.asp", "passage_text": "Due to the nature of certain goods and services, they must be prepaid expenses. For example, insurance is a prepaid expense, because the purpose of purchasing insurance is to buy proactive protection in case something unfortunate happens. Clearly, no insurance company would sell insurance that covers the occurrence of an unfortunate event, after the fact, so insurance expenses must be pre-paid."}, {"url": "http://www.investopedia.com/terms/p/prepaidexpense.asp", "passage_text": "A prepaid expense is an asset on the balance sheet. Due to accounting principles, expenses are often accrued on the balance sheet and expensed in a later period. For example, insurance is a prepaid expense, because the purpose of purchasing insurance is to buy proactive protection in case something unfortunate happens. Clearly, no insurance company would sell insurance that covers the occurrence of an unfortunate event, after the fact, so insurance expenses must be pre-paid."}, {"url": "http://smallbusiness.chron.com/examples-prepaid-expenses-61652.html", "passage_text": "Debit the prepaid tax account for the amount of the payment, and then credit cash to recognize the reduction in the cash account. Credit prepaid taxes and debit the tax expense account when the actual liability amount is calculated at the end of the year. Debit the prepaid account for the amount that is added to stock, and credit the cash account to reflect the purchase. During each month's closing process, credit prepaid supplies for the estimated amount of supplies utilized during the month, and debit the supplies expense account."}, {"url": "http://www.investopedia.com/terms/a/accruedexpense.asp", "passage_text": "DEFINITION of 'Accrued Expense'. An accounting expense recognized in the books before it is paid for. It is a liability, and is usually current. These expenses are typically periodic and documented on a company's balance sheet due to the high probability that they will be collected. Accrued expenses are the opposite of prepaid expenses. Firms will typically incur periodic expenses such as wages, interest and taxes. Even though they are to be paid at some future date, they are indicated on the firm's balance sheet from when the firm can reasonably expect their payment, until the time they are paid."}]