[{"url": "http://www.wsj.com/articles/SB10001424052748703436504574640651941267992", "passage_text": "Factoring in initiation fees, the median annual cost for a new gym member is $775, according to the International Health, Racquet and Sportsclub Association, a trade group. Ongoing members pay slightly less than $43 per month for an average $511 annually. In many cases, new members can cut their gym membership costs by as much as 50%. Here are some ways to do it."}, {"url": "http://www.answers.com/Q/How_much_does_a_gold's_gym_membership_cost_per_month", "passage_text": "I believe that when you first buy the XBOX liv gold account, the price is $50. Every month, you pay $5. Annual cost together ($5x12) is $60. If you have an XBOX One (instead of XBOX 360) a single XBOX live (gold) account will grant gold access to every user. On average, membership dues range from $175 to $200+ a month. Some initiation fees can cost hundred … s of dollars. It's pricey, but you get what you pay for. Their gyms are spacious, clean, full of great equipment and other perks."}, {"url": "http://www.howmuchisit.org/gym-membership-cost/", "passage_text": "1 Most gyms offer monthly memberships for between $20-$50 per month. 2  This gym membership cost depends on the quality of the club, such as what types of facilities are offered, as well as the cost of living in you area. 3  Most gyms also offer yearly memberships instead of monthly – these usually cost between $200 and $500. 1 Most gyms also offer yearly memberships instead of monthly – these usually cost between $200 and $500. 2  Many facilities, such as Lifetime Fitness, also offer family packages per month or year. 3  This is usually the best value for two or more people"}, {"url": "http://www.howmuchisit.org/golds-gym-membership-cost/", "passage_text": "1 To budget properly, plan on spending anywhere from $10 to $60 in the initial enrollment fees for a Gold’s Gym membership. 2  After the enrollment fees are paid, the monthly fees are usually around $20 to $50 per month to continue the membership. 3  For example, this Long Beach location, has four different plans. 1 In most cases, the cost of a Gold’s Gym membership will depend on the length you sign up for, the current promotion and geographical location. 2  To budget properly, plan on spending anywhere from $10 to $60 in the initial enrollment fees for a Gold’s Gym membership."}, {"url": "http://www.answers.com/Q/How_much_does_a_gold's_gym_membership_cost_per_month", "passage_text": "Equinox is an exclusive gym with locations in the Northeast and California. On average, membership dues range from $175 to $200+ a month. Some initiation fees can cost hundred … s of dollars. It's pricey, but you get what you pay for. Their gyms are spacious, clean, full of great equipment and other perks."}, {"url": "http://www.gymmembershipfees.com/golds-gym-prices/", "passage_text": "Membership Fees. Membership fees at Gold’s Gym vary and depend on the location and the type of membership you apply for. On the average it is $30 to $36 a month, although some locations may charge $40 to $50, but that includes a personal trainer and additional amenities. If you’re not sure you should contact the nearest Gold’s Gym location and inquire about the fee. I visited a local Golds Gym on Saturday, April 18, 2015 and was quoted (hand-written with pen and paper) a $55/month-to-month price for individuals and $86/month for a 2-person family."}, {"url": "http://www.answers.com/Q/How_much_does_a_gold%27s_gym_membership_cost", "passage_text": "The cost of a Gold's Gym memberships may vary from state to state. The average cost of a Gold's Gym membership is $39 a month with a $9.99 enrollment fee. The membership also … generally requires a 2 year committment. 24 people found this useful."}, {"url": "http://www.howmuchisit.org/gym-membership-cost/", "passage_text": "1 According to this FatWallet thread, the average gym membership cost can range anywhere from $17 to $60. 2  For example, a user in Pennsylvania paid $35 for a monthly membership, while a user in New York paid $50 as a monthly fee. 1 Most gyms also offer yearly memberships instead of monthly – these usually cost between $200 and $500. 2  Many facilities, such as Lifetime Fitness, also offer family packages per month or year. 3  This is usually the best value for two or more peopl"}]