[{"url": "http://the-jeffersons.wikia.com/wiki/The_Jeffersons", "passage_text": "The Jeffersons is an American sitcom that was broadcast on CBS from January 18, 1975, through June 25, 1985, lasting 11 seasons and a total of 253 episodes. The show was produced by the T.A.T. Communications Company from 1975–1982 and by Embassy Television from 1982–1985. "}, {"url": "https://en.wikipedia.org/wiki/Thomas_Jefferson", "passage_text": "Thomas Jefferson (April 13. 1743 – July 4, 1826) was an American Founding Father, principal author of the Declaration of Independence (1776), and third President of the United States (1801–1809). A proponent of democracy, Jefferson embraced the concepts of republicanism and individual rights."}, {"url": "http://www.emmytvlegends.org/interviews/shows/jeffersons-the", "passage_text": "The Jeffersons, which appeared on CBS television from 1975 to 1985, focused on the lives of a nouveau riche African-American couple, George and Louise Jefferson. George Jefferson was a successful businessman, millionaire and owner of seven dry cleaning stores. In 1973, Lear cast Sherman Hemsley in the role of George Jefferson, Archie Bunker's irascible and upwardly mobile black neighbor. This character was such a hit with viewers that Hemsley was soon cast in the spin-off series, The Jeffersons."}, {"url": "http://www.tv.com/shows/the-jeffersons/", "passage_text": "Show Summary. The Jeffersons first aired in January of 1975 on CBS as a mid-season replacement. The series was a spinoff of All in the Family in which the Jeffersons were Archie and Edith Bunker's next door neighbors. In 1975, The Jeffersons moved on up when George found success in a dry cleaning business. Movin on up, to the east side. We finally got a piece of the pie.moreless. The Jeffersons first aired in January of 1975 on CBS as a mid-season replacement. The series was a spinoff of All in the Family in which the Jeffersons were Archie and Edith Bunker's next door neighbors."}, {"url": "https://en.wikipedia.org/wiki/Jeffersons", "passage_text": "The Jeffersons is an American sitcom that was broadcast on CBS from January 18, 1975, through July 2, 1985, lasting 11 seasons and a total of 253 episodes. The show was produced by the T.A.T. Communications Company from 1975 to 1982 and by Embassy Television from 1982 to 1985. The Jeffersons premiered the following week, January 18, 1975, and 253 episodes were produced and aired during its 11-year run. George's career as a dry-cleaner began in the first season of All in the Family, in the episode Oh, My Aching Back (though the character himself did not appear on-camera)."}, {"url": "https://en.wikipedia.org/wiki/Thomas_Jefferson", "passage_text": "Jefferson was born the third of ten children, on April 13, 1743 (April 2, 1743 OS) at the family home in Shadwell, Virginia. His father was Peter Jefferson, a planter and surveyor who died when Jefferson was fourteen. His mother was Jane Randolph, daughter of Isham Randolph, a ship's captain and planter. 1743 – July 4, 1826) was an American Founding Father, principal author of the Declaration of Independence (1776), and third President of the United States (1801–1809). A proponent of democracy, Jefferson embraced the concepts of republicanism and individual rights."}, {"url": "http://the-jeffersons.wikia.com/wiki/George_Jefferson", "passage_text": "George Jefferson is the protagonist on The Jeffersons. He is co-founder/president of Jefferson Cleaners on The Jeffersons. Played by Sherman Hemsley on the American television sitcoms All In The Family (from 1973 until 1975) and its spinoff, The Jeffersons (1975–1985). The background on William Jefferson, George's father, is that he was a street maintennance worker in New York City, although George doctored up the story of his family in one episode, when interviewed by a reporter in order to imress him about his rags-to-riches story, intimating that they were Alabama sharecroppers."}, {"url": "https://en.wikipedia.org/wiki/Jeffersons", "passage_text": "During the January 11, 1975 episode of All in the Family, titled The Jeffersons Move Up, Edith Bunker gave a tearful good-bye to her neighbor Louise Jefferson, as her husband George, their son Lionel, and she moved from a working-class section of Queens, New York into a luxury apartment in Manhattan. The Jeffersons premiered the following week, January 18, 1975, and 253 episodes were produced and aired during its 11-year run. George's career as a dry-cleaner began in the first season of All in the Family, in the episode Oh, My Aching Back (though the character himself did not appear on-camera)."}]