[{"url": "http://www.sheknows.com/health-and-wellness/articles/816165/irregular-periods-what-your-body-s-trying-to-tell-you-1", "passage_text": "A normal period versus an irregular period. A woman will, on average, get her period for three to seven days once a month (every 30 days or so). After menstruating for several years, women tend to settle into a cycle; some women can even predict down to the hour when their periods will come. Stress is the most common cause of irregular periods. Cortisol, the stress hormone, has a direct impact on how much estrogen and progesterone, two sex hormones, gets produced by the body. If you have too much cortisol in your bloodstream, the time and flow of your cycle could change."}, {"url": "http://www.medguidance.com/thread/Early-Period.html", "passage_text": "There are instances when spotting or early period symptoms may not be due to an early period. If this happens, sexually active women may have to consider the fact that they might be pregnant. Spotting instead of a period is an almost certain indication of implantation bleeding. Implantation bleeding occurs when a fertilized egg travels into the uterus and burrows into the lining of the uterus. Some women may experience spotting or slight bleeding due to this process."}, {"url": "http://www.webmd.com/women/rm-quiz-period-normal", "passage_text": "Missed or delayed periods are common in young women, especially in the early years of menstruation, and things like stress, weight loss, and too much exercise can make periods irregular. Also, several birth control methods can cause periods to stop and can even be designed for just that purpose. In young girls and teenagers, periods are commonly irregular and have cycles ranging between 21 and 45 days. Keep track of your periods on a calendar (which can help you and your doctor determine what pattern is normal for you). 1  Previous."}, {"url": "https://www.plannedparenthood.org/teens/my-body/your-period", "passage_text": "Even though it's normal to skip a period every once in a while, if you've had unprotected sex (sex without a condom or birth control) and missed your period, take a pregnancy test. If your period is so heavy that you have to change maxi pads or super tampons every hour, see a doctor. One day, you'll begin to bleed from your vagina, and that's your period. It means that your body is healthy and normal. Most girls have their first period when they're between 9 and 15 years old. Your period may start around the time it started for other people in your family, like your mom or sisters."}, {"url": "https://www.plannedparenthood.org/teens/my-body/your-period", "passage_text": "The menstrual cycle is the time from the first day of one period to the first day of the next. A normal menstrual cycle can be as short as 21 days or longer than 35 days. For most women, it lasts 25 - 30 days. But it's common for your cycle to vary from month to month. Here are the basics: 1  You have two ovaries. One day, you'll begin to bleed from your vagina, and that's your period. It means that your body is healthy and normal. Most girls have their first period when they're between 9 and 15 years old. Your period may start around the time it started for other people in your family, like your mom or sisters."}, {"url": "https://www.zocdoc.com/answers/8788/what-does-it-mean-if-i-get-an-early-period", "passage_text": "There are several causes of an early period. It could be stress, changes in your lifestyles, or a hormonal imbalance triggering menorrhagia along with irregular cycles. Although the average cycle is 28 days, it is perfectly normal to have a cycle that is as short as 21 days or as long as 35 days. You do not state your age. If you are a teen or a woman in her 40's, you may have a cycle that change a lot due to hormone imbalance problems. On the other hand, an early period could be a sign of early pregnancy (i.e., implantation bleeding) or a miscarriage."}, {"url": "http://www.webmd.com/women/tc/normal-menstrual-cycle-topic-overview", "passage_text": "Talk to your doctor if you notice any big change in your cycle. It's especially important to check with your doctor if you have three or more menstrual periods that last longer than 7 days or are very heavy. Also call if you have bleeding between your periods or pelvic pain that is not from your period. This is the monthly menstrual bleeding (also called menstrual period) that women have from their early teen years until menopause, around age 50. The menstrual cycle is from Day 1 of bleeding to Day 1 of the next time of bleeding. Although the average cycle is 28 days, it is normal to have a cycle that is shorter or longer. Girls usually start having menstrual periods between the ages of 11 and 14. Women usually start to have fewer periods between ages 39 and 51. Women in their 40s and teens may have cycles that are longer or change a lot"}, {"url": "http://www.webmd.com/women/rm-quiz-period-normal", "passage_text": "For most women, periods usually occur from 21 to 35 days apart. In young girls and teenagers, periods are commonly irregular and have cycles ranging between 21 and 45 days. Keep track of your periods on a calendar (which can help you and your doctor determine what pattern is normal for you). 1  Previous. 2  Continue"}, {"url": "http://www.livestrong.com/article/22195-reasons-getting-period-early/", "passage_text": "What To Do. If your period comes early once in a while, this is likely a normal occurrence and not a cause for concern. But if you frequently have early periods or if you experience other symptoms, such as pain or heavy bleeding, contact your doctor. It's also possible that you might misinterpret other causes of bleeding as an early period. For example, if you have become pregnant since your last period, you might have some bleeding before your normal period as the embryo implants into your uterus."}]