[{"url": "http://www.biology-online.org/dictionary/Cuticle", "passage_text": "noun. The outermost, noncellular, protective covering of certain organisms. Supplement. The cuticle refers to the various forms of the outermost covering of organisms. In humans, the cuticle is the outermost layer of the skin epidermis and is comprised of keratinocytes. In some animals, such as the invertebrates, the cuticle is the superficial layer that covers the epidermis. "}, {"url": "http://www.webmd.com/beauty/nails/caring-for-your-cuticles", "passage_text": "Dermatologists say there's no good reason to cut the cuticles. Cutting them could open the door to infection or irritation. If you remove the cuticle, that space is wide open, and anything can get in there, Scher says. Cutting your cuticles can also lead to nail problems, such as ridges, white spots, or white lines. Your cuticles are part of your skin. They sit atop your nails' growth matrix, which is the part of your nails that grows. Cuticles are there for a reason, like a barrier or a protection for the nail matrix, says Richard Scher, MD, a Cornell University dermatology professor."}, {"url": "http://www.thefreedictionary.com/cuticle", "passage_text": "Noun. 1. cuticle-the dead skin at the base of a fingernail or toenail. cutis, skin, tegument-a natural protective body covering and site of the sense of touch; your skin is the largest organ of your body. 1. The outer layer of skin; the epidermis. 2. The hard skin around the sides and base of a fingernail or toenail. 3. Botany A waxy layer that covers the outermost tissue layer of a plant. The cuticle is secreted by the epidermis and helps prevent water loss and infection by parasites."}, {"url": "https://en.wikipedia.org/wiki/Cuticle", "passage_text": "A cuticle /ˈkjuːtɪkəl/ , or cuticula, is a term used for any of a variety of tough but flexible, non-mineral outer coverings of an organism, or parts of an organism, that provide protection. Various types of cuticle are non-homologous, differing in their origin, structure, function, and chemical composition. In botany, plant cuticles are protective, hydrophobic, waxy coverings produced by the epidermal cells of leaves, young shoots and all other aerial plant organs. Cuticles minimize water loss and effectively reduce pathogen entry due to their waxy secre"}, {"url": "http://www.thefreedictionary.com/cuticle", "passage_text": "2. cuticle-the outer layer of the skin covering the exterior body surface of vertebrates. epidermis. cutis, skin, tegument-a natural protective body covering and site of the sense of touch; your skin is the largest organ of your body. epidermal cell-any of the cells making up the epidermis. 1. The outer layer of skin; the epidermis. 2. The hard skin around the sides and base of a fingernail or toenail. 3. Botany A waxy layer that covers the outermost tissue layer of a plant. The cuticle is secreted by the epidermis and helps prevent water loss and infection by parasites."}, {"url": "http://www.webmd.com/beauty/nails/caring-for-your-cuticles", "passage_text": "Though you may only think about your cuticles when you get a manicure, they're not just hanging out on your hands. They serve a purpose, and they need your TLC. Your cuticles are part of your skin. They sit atop your nails' growth matrix, which is the part of your nails that grows. Cuticles are there for a reason, like a barrier or a protection for the nail matrix, says Richard Scher, MD, a Cornell University dermatology professor."}, {"url": "http://www.thefreedictionary.com/cuticle", "passage_text": "cuticle-the outer layer of the skin covering the exterior body surface of vertebrates. epidermis. cutis, skin, tegument-a natural protective body covering and site of the sense of touch; your skin is the largest organ of your body. 1. The outer layer of skin; the epidermis. 2. The hard skin around the sides and base of a fingernail or toenail. 3. Botany A waxy layer that covers the outermost tissue layer of a plant. The cuticle is secreted by the epidermis and helps prevent water loss and infection by parasites."}, {"url": "http://www.wisegeek.org/what-is-cuticle-cream.htm", "passage_text": "Cuticle cream is used for moisturizing and softening the layers of dead skin surrounding the fingernails and toenails. It is often applied before a manicure or pedicure. Overgrown, dry, or ragged cuticles can then be gently pushed back and reshaped. Cuticle cream softens the skin around the nails. After softening, overgrown cuticles can be pushed back and reshaped. Nail scissors, which can be used to trim dead skin around the cuticles. Olive oil is a holistic alternative to cuticle cream. Cuticle cream can be applied to first soften cuticles before pushing them back. Cuticle creams can be used to soften the cuticles on the toenails as well as on the fingernails"}]