[{"url": "https://en.wikipedia.org/wiki/Stratosphere", "passage_text": "Within this layer, temperature increases as altitude increases (see temperature inversion) ; the top of the stratosphere has a temperature of about 270 K (−3 °C or 26.6 °F), just slightly below the freezing point of water. The stratosphere is layered in temperature because ozone (O 3) here absorbs high energy ultraviolet (UVB and UVC) radiation from the Sun and is broken down into the allotropes of atomic oxygen (O 1) and common molecular oxygen (O 2)."}, {"url": "http://www.weatherquestions.com/What_is_the_stratosphere.htm", "passage_text": "The stratosphere is the second major atmospheric layer above the troposphere, extending in altitude from about 8 to 30 miles high. No weather occurs in the stratosphere. The statosphere contains over 15% of the total mass of the atmosphere, and is where the ozone layer is located. "}, {"url": "http://www.answers.com/Q/What_is_the_temperature_in_the_stratosphere", "passage_text": "In the stratosphere, the temperature increases with height. This is due to the presence of the ozone layer near the top of the stratosphere. The ozone layer absorbs incoming U … V radiation, and thus the temperatures are warmer at the top of the stratosphere than at the bottom. Temperature reaches its coldest at the tropopause, which is the boundary between the troposphere below and the stratosphere above. In the stratosphere, the temperature increas … es with height due to absorption of radiation by ozone."}, {"url": "http://www.answers.com/Q/What_is_the_temperature_in_the_stratosphere", "passage_text": "The stratosphere ranges in temperature from approximately -56 degrees C to -2 degrees C. Unlike the troposphere where the temperatures cool as altitude increases, in the stratosphere the temperatures actually get warmer the higher you go. Temperature reaches its coldest at the tropopause, which is the boundary between the troposphere below and the stratosphere above. In the stratosphere, the temperature increas … es with height due to absorption of radiation by ozone."}, {"url": "http://forecast.weather.gov/jetstream/atmos/layers.htm", "passage_text": "Stratosphere. The Stratosphere extends from the tropopause up to 31 miles above the Earth's surface. This layer holds 19 percent of the atmosphere's gases but very little water vapor. Temperature increases with height as radiation is increasingly absorbed by oxygen molecules leading to the formation of Ozone. "}, {"url": "http://www.windows2universe.org/earth/Atmosphere/stratosphere.html", "passage_text": "The Stratosphere. The stratosphere is a layer of Earth's atmosphere. The stratosphere is the second layer, as one moves upward from Earth's surface, of the atmosphere. The stratosphere is above the troposphere and below the mesosphere. The top of the stratosphere occurs at 50 km (31 miles) altitude. The boundary between the stratosphere and the mesosphere above is called the stratopause."}, {"url": "http://ds9.ssl.berkeley.edu/LWS_GEMS/3/layers.htm", "passage_text": "The temperature decreases with altitude. Stratosphere: The stratosphere is found from about 7 to 30 miles (11-48 kilometers) above the Earths surface. In this region of the atmosphere is the ozone layer, which absorbs most of the harmful ultraviolet radiation from the Sun. "}, {"url": "https://en.wikipedia.org/wiki/Stratosphere", "passage_text": "The stratosphere /ˈstraetɵsfɪər/ ˈstrætɵsfɪər is the second major layer Of'earth s, atmosphere just above the, troposphere and below the. Mesosphere it is stratified in, temperature with warmer layers higher up and cooler layers farther. down The stratosphere is layered in temperature because ozone (O 3) here absorbs high energy ultraviolet (UVB and UVC) radiation from the Sun and is broken down into the allotropes of atomic oxygen (O 1) and common molecular oxygen (O 2)."}]