[{"url": "http://montereyprivatewealth.com/blog/2014/1/27/rules-for-deducting-investment-management-fees-on-tax-return", "passage_text": "Rob and Mary Jane, both single, are retired and have $1 million IRA accounts. They each pay a $10,000 investment management fee. Rob withdraws $40,000 from his IRA this year and pays a $10,000 investment management fee using outside funds from his checking account."}, {"url": "http://www.emarotta.com/are-investment-management-fees-tax-deductible/", "passage_text": "In next year's 28% tax bracket, this would save you $560 more in taxes. Even if you can't deduct investment management fees directly, you can still pay a portion of the fee with pretax dollars. Investment management fees can be deducted directly from the accounts for which they were charged."}, {"url": "http://www.forbes.com/sites/davidmarotta/2012/06/25/are-investment-management-fees-tax-deductible/", "passage_text": "There is no advantage in trying to pay the entire fee from a taxable account in an attempt to boost your deductions. If you pay $2,500 in management fees, it is better to pay $1,000 from an IRA with pretax dollars than to pay for it separately to get a $500 tax deduction."}, {"url": "http://www.forbes.com/sites/davidmarotta/2012/06/25/are-investment-management-fees-tax-deductible/", "passage_text": "For example, if your AGI is $100,000 and your miscellaneous expenses average $2,500 a year, in most years you will only get a $500 deduction. But if you can pay the same bills in January and December of one year, you might be able to have $5,000 in deductions one year and zero the next."}, {"url": "http://www.bankrate.com/finance/taxes/are-investment-fees-tax-deductible.aspx", "passage_text": "The key to deducting the IRA fees is to cut a check or use a credit card to pay the broker the annual maintenance fees. For example, if your broker charges you $150 for the IRA annually, you need to pay this to the broker from non-IRA assets for it to be deductible."}, {"url": "http://montereyprivatewealth.com/blog/2014/1/27/rules-for-deducting-investment-management-fees-on-tax-return", "passage_text": "Because Mary Jane paid her management fee from funds inside her IRA, her reportable IRA distribution is $30,000 even though her total withdrawal was $40,000. Rob and Mary Jane both withdrew $40,000 from their IRA accounts, but Mary Jane has $10,000 less taxable income and Rob has a possible $10,000 tax deduction."}, {"url": "http://www.emarotta.com/are-investment-management-fees-tax-deductible/", "passage_text": "There is no advantage in trying to pay the entire fee from a taxable account in an attempt to boost your deductions. If you pay $2,500 in management fees, it is better to pay $1,000 from an IRA with pretax dollars than to pay for it separately to get a $500 tax deduction. Any amount paid from an IRA is equivalent to getting that same amount as a"}, {"url": "http://finance.zacks.com/can-deduct-ira-management-fees-5865.html", "passage_text": "If you are charged a general management fee for handling the account, that expense is also deductible. In most investment accounts, including IRAs, the manager charges a percentage of the account size, typically 1 percent or 1.5 percent of the assets under management."}]