[{"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-202-BILBERRY.aspx?activeIngredientId=202&activeIngredientName=BILBERRY", "passage_text": "Bilberry contains chemicals called tannins that can help improve diarrhea, as well as mouth and throat irritation, by reducing swelling (inflammation). There is some evidence that the chemicals found in bilberry leaves can help lower blood sugar and cholesterol levels. There is some evidence that bilberry may help retinal disorders. Some people use bilberry for conditions of the heart and blood vessels including hardening of the arteries (atherosclerosis), varicose veins, decreased blood flow in the veins, and chest pain."}, {"url": "http://www.webmd.com/eye-health/features/bilberry-extract-and-vision", "passage_text": "The depth of color of the bilberry's flesh is caused by those anthocyanosides -- also found in dark berries to varying degrees. The fruit also has antimicrobial tannins, which are found in purple grapes and dark teas. WebMD went hunting for the truth -- or lack thereof -- behind the claims for bilberry's healthfulness. Here's what we learned: The bilberry, a relative of the cranberry, huckleberry, and American blueberry, is a plant with bright green leaves and bell-shaped flowers that grows wild, primarily in northern Europe."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-202-BILBERRY.aspx?activeIngredientId=202&activeIngredientName=BILBERRY", "passage_text": "Bilberry is a plant. The dried, ripe fruit and leaves are used to make medicine. Bilberry is used for improving eyesight, including night vision. In fact, during World War II, British pilots in the Royal Air Force ate bilberry jam to improve their night vision, but later research showed it probably didn’t help. Bilberry is also used for treating eye conditions such as cataracts and disorders of the retina. There is some evidence that bilberry may help retinal disorders. Some people use bilberry for conditions of the heart and blood vessels including hardening of the arteries (atherosclerosis), varicose veins, decreased blood flow in the veins, and chest pain."}, {"url": "http://umm.edu/health/medical/altmed/herb/bilberry", "passage_text": "Overview. Bilberry has been used for centuries, both medicinally and as a food in jams and pies. It is related to the blueberry and is native to Northern Europe. Bilberry fruit contains chemicals known as anthocyanosides, plant pigments that have excellent antioxidant properties. Bilberry has been used in European medicine for nearly one thousand years, primarily to treat diarrhea. The fruit contains tannins, substances that act as both an anti-inflammatory and an astringent (constricting and tightening tissues)."}, {"url": "https://nccih.nih.gov/health/bilberry", "passage_text": "Introduction. This fact sheet provides basic information about bilberry—common names, what the science says, potential side effects and cautions, and resources for more information. Bilberry is a relative of the blueberry, and its fruit is commonly used to make pies and jams. It has been used for nearly 1,000 years in traditional European medicine. Bilberry grows in North America, Europe, and northern Asia. Historically, bilberry fruit was used to treat diarrhea, scurvy, and other conditions"}, {"url": "http://www.herbslist.net/bilberry.html", "passage_text": "Bilberry Benefits. For centuries, Bilberry has been used to treat blood disorders and vascular problems, such as angina, varicose veins and thrombosis. The berry’s high content of anthocyanin and flavonoids give strength to the capillaries while thinning the blood. "}, {"url": "http://www.emedicinehealth.com/drug-bilberry/article_em.htm", "passage_text": "Bilberry is also known as Vaccinium myrtillus, bog bilberries, blueberries (variety of), and whortleberries. Bilberry has been used most commonly for diarrhea and mild inflammation of the mouth and throat. Other uses of bilberry have included kidney and urinary tract problems, arthritis, gout, skin problems, and declining vision. Bilberry has not been evaluated by the FDA for safety, effectiveness, or purity."}, {"url": "http://health.howstuffworks.com/wellness/natural-medicine/herbal-remedies/bilberry-herbal-remedies.htm", "passage_text": "Both the leaves and the ripe fruit of the bilberry and related berry species have long been a folk remedy for treating diabetes. Traditionally, people used the leaves to control blood sugar. While the leaves can lower blood sugar, they do so by impairing a normal process in the liver. "}]