[{"url": "https://www.hotelplanner.com/Hotels/44988-in-Sultan-WA.html", "passage_text": "Sultan Washington Accommodations. Find accommodations in Sultan with the hotel list provided below. Search for cheap and discounted hotel and motel rates in or close to Sultan, WA for your business or personal leisure travel. We show the best Sultan Washington hotel/motel rooms. Review the Sultan hotel list below to find the perfect lodging. We also have a map of the Sultan hotels. The Sultan center is approximately 7 miles east of Downtown Monroe and 8 miles east of Evergreen State Fairgrounds."}, {"url": "http://www.topix.com/city/sultan-wa", "passage_text": "Local news for Sultan, WA continually updated from thousands of sources on the web. "}, {"url": "http://ci.sultan.wa.us/", "passage_text": "Home. WELCOME TO THE CITY OF SULTAN. Whether you are moving to our city, or just visiting and want information, we want you to feel welcome. Established in the late 1880’s and officially incorporated in 1905, our community has a rich and colorful heritage. Today, Sultan is a quiet but growing community with a population fast approaching 5,000. Our city is on the brink of a great transformation. Already several hundred new residential homes, commercial and retail projects currently are in the development process."}, {"url": "http://www.priceline.com/hotel/POI-Sultan_WA_Sultan_Washington_United_States-90007806.html", "passage_text": "Hotels Near Sultan, WA. Priceline can help you find great deals on high quality hotels near Sultan, WA. If you know when you're traveling to Sultan, WA, use the search box below to check prices and availability."}, {"url": "http://www.city-data.com/city/Sultan-Washington.html", "passage_text": "Nearest city with pop. 1,000,000+: Los Angeles, CA (969.6 miles, pop. 3,694,820). Nearest cities: North Sultan, WA (1.1 miles), Startup, WA (1.7 miles), Woods Creek, WA (2.1 miles), Gold Bar, WA (2.3 miles), May Creek, WA (2.5 miles), Monroe, WA (2.9 miles), Monroe North, WA (2.9 miles), Chain Lake, WA (2.9 miles). According to our research of Washington and other state lists there were 6 registered sex offenders living in Sultan, Washington as of October 06, 2015."}, {"url": "https://en.wikipedia.org/wiki/Sultan,_Washington", "passage_text": "Sultan is a city in Snohomish County, Washington, United States, located where the Sultan River flows into the Skykomish. The population was 4,651 at the 2010 census. There is an annual 3-day street fair held in July, known as the 'Sultan Shindig'. Carnival rides, street vendors and logging games are a popular part of the fair. As well as this, the Shindig's loggers practice in Spring with logs that they are allowed to cut into a variety of wooden sculptures."}, {"url": "http://www.city-data.com/city/Sultan-Washington.html", "passage_text": "Sultan is mentioned 81 times on our forum: Latest news from Sultan, WA collected exclusively by city-data.com from local newspapers, TV, and radio stations. Ancestries: German (16.2%), Irish (10.3%), English (9.0%), Norwegian (5.4%), United States (4.9%), Dutch (4.3%). According to our research of Washington and other state lists there were 6 registered sex offenders living in Sultan, Washington as of October 06, 2015."}, {"url": "http://ci.sultan.wa.us/", "passage_text": "Applications and the ordinance establishing the Salary Commission are available at Sultan City Hall; 319 Main Street #200; Sultan, WA 98294 or request a packet at laura.koenig@ci.sultan.wa.us. Open until filled. Today, Sultan is a quiet but growing community with a population fast approaching 5,000. Our city is on the brink of a great transformation. Already several hundred new residential homes, commercial and retail projects currently are in the development process."}, {"url": "https://en.wikipedia.org/wiki/Sultan,_Washington", "passage_text": "Both the Sultan River and the town of Sultan were named by prospectors for the chief of a Snohomish sub-tribe who lived on the Skykomish River in the 1870s. His name as Tsul-tad or Tseul-tud, which was anglicized by the miners into Sultan. For generations Sultan remained a small logging community. There is an annual 3-day street fair held in July, known as the 'Sultan Shindig'. Carnival rides, street vendors and logging games are a popular part of the fair. As well as this, the Shindig's loggers practice in Spring with logs that they are allowed to cut into a variety of wooden sculptures."}]