[{"url": "http://didjiman.com/business/jsdemo/sellprice_calc.htm", "passage_text": "Cost per Piece. The cost of each individual piece, after you click the Calculate Now button. This is simply the cost of the unit divided by the number of pieces in the unit. For example, if a unit (carton) of candy bars costs $10.00 and contains 10 candy bars, the Cost per Piece is $1.00. Net Cost per Piece. The Net Cost of each piece in your unit. The Net Cost is the sum of the Cost per Piece and the Shipping Cost per Piece. For example, if the Cost per Piece of an item is 1.00 and the Shipping Cost per Piece is $0.10 then the Net Cost per Piece is $1.10."}, {"url": "http://didjiman.com/business/jsdemo/sellprice_calc.htm", "passage_text": "This is the cost of shipping the unit divided by the number of pieces in the unit. For example, if it costs $1.00 to ship a unit of candy bars to you, and a unit contains 10 candy bars, then the Shipping Cost per Piece is $0.10. Net Cost per Piece. The Net Cost of each piece in your unit. The Net Cost is the sum of the Cost per Piece and the Shipping Cost per Piece. For example, if the Cost per Piece of an item is 1.00 and the Shipping Cost per Piece is $0.10 then the Net Cost per Piece is $1.10."}, {"url": "http://help.makersrow.com/article/12-calculating-your-quantity-cost-per-unit-and-retail-price", "passage_text": "Thus far I have noted a $10,000 budget and want to product 100 units. This means that a maximum, the most I can afford to spend on the cost per unit is $100. (10,000 budget / 100 units = 100 cost per unit). If I want to produce 100 units of something and I have a $10,000 budget the most that I can spend per unit is $100. Cost Per Unit-This is what you intend to spend on the production cost of each particular unit item"}, {"url": "http://smallbusiness.chron.com/calculate-total-manufacturing-price-per-unit-65756.html", "passage_text": "To figure your total manufacturing cost per unit, divide your total costs by the total number of units produced. For example, say for the year your company made 1 million units and incurred production costs of $3 million. Divide your $3 million costs by the 1 million units to find your cost per unit: $3. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100930005612AAWiCjj", "passage_text": "If job #4 contained 100 units, the unit cost on the completed job cost sheet would be: $61.75 $62.50 $63.10 $55.00 Please help me solve this! THank you! Please help me with the computation. haha. By the end of the year, Snappy had worked a total of 49,000 direct labor-hours and had incurred $137,850 actual manufacturing overhead cost. If Job #334 contained 240 units, the unit product cost on the completed job cost sheet would be: $36.60 $40.19 $36.00 $42.40. Vinay."}, {"url": "http://www.mathsisfun.com/measure/unit-price.html", "passage_text": "Unit Price. The Unit Price (or unit cost) tells you the cost per liter, per kilogram, per pound, etc, of what you want to buy. Just divide the cost by the quantity: Example: 2 liters for $3.80 is $3.80/2 liters = $1.90 per liter."}, {"url": "http://help.makersrow.com/article/12-calculating-your-quantity-cost-per-unit-and-retail-price", "passage_text": "Now that I have calculated by cost per unit to be $66.25 and I know that I want to produce 100 units, I am at a minimum of $6,625 budget. This is a great in that I'm about $3,000 away from total budget of $10,000. This means that a maximum, the most I can afford to spend on the cost per unit is $100. (10,000 budget / 100 units = 100 cost per unit). If I want to produce 100 units of something and I have a $10,000 budget the most that I can spend"}, {"url": "https://answers.yahoo.com/question/index?qid=20100930005612AAWiCjj", "passage_text": "The labor rate is $6.40 per hour. By the end of the year, Snappy had worked a total of 49,000 direct labor-hours and had incurred $137,850 actual manufacturing overhead cost. If Job #334 contained 240 units, the unit product cost on the completed job cost sheet would be: $36.60 $40.19 $36.00 $42.40. Vinay."}, {"url": "http://smallbusiness.chron.com/price-per-unit-income-statement-33516.html", "passage_text": "For example, given sales of $500,000 for the year and 40,000 units sold, the price per unit is $12.50 ($500,000 divided by 40,000). Deriving per-unit price in this fashion requires that your company maintain detailed and accurate sales invoices that itemize quantity sold and sales price for each item. Price per unit details how much you charge for each unit of an item sold. If on a particular day, your business sells a cell phone for $100, a cell phone carrying case for $25 and a car charger for $30; your sales are $155."}, {"url": "http://www.accountingtools.com/questions-and-answers/how-to-calculate-cost-per-unit.html", "passage_text": "(Total fixed costs + Total variable costs) / Total units produced. The cost per unit should decline as the number of units produced increases, primarily because the total fixed costs will be spread over a larger number of units (subject to the step costing issue noted above). Thus, the cost per unit is not constant. For example, ABC Company has total variable costs of $50,000 and total fixed costs of $30,000 in May, which it incurred while producing 10,000 widgets. The cost per unit is: ($30,000 Fixed costs + $50,000 variable costs) / 10,000 units = $8 cost per unit. In the following month, ABC produces 5,000 units at a variable cost of $25,000 and the same fixed cost of $30,000. The cost per unit is: ($30,000 Fixed costs + $25,000 variable costs) / 5,000 units = $11/unit. "}]