[{"url": "http://www.gardenguides.com/93368-grow-cherry-trees-seeds.html", "passage_text": "Overview. Cherry tree seedlings can easily be grown from ripe and germinated cherry pits or seeds. While a cherry tree sapling will grow, it will likely not be an exact replica of the tree from which the seed was taken. Cherry seeds can be sown outdoors in the fall and will germinate in roughly three months. Step 1. Harvest your cherry seeds from the ripe fruits in the summer. Eat or clean off the fruit flesh and rinse the seeds of the sweet residue. Store them in a lightly covered cup or open plastic bag until early fall."}, {"url": "http://www.youtube.com/watch?v=nbKS8HDwOdM", "passage_text": "Grafting techniques are used most often to grow cherry trees, as with most other fruit trees. Cherry seeds will have roughly a 50% germination rate.Growing from seed does have an air of mystery, you could even end up with a new variety of cherry. Watch Part 2 (https://www.youtube.com/watch?v=hXgtW.."}, {"url": "http://www.ehow.com/how_5320649_grow-cherry-tree-seed-pit.html", "passage_text": "Pollen Requirements. All sour cherries are self-fruitful, meaning you can grow one tree from seed and it will bear cherries, but sweet cherries require pollen from a compatible cherry tree planted within 100 feet. Cherry tree varieties grow blossoms, produce pollen and yield cherries at different times. To stratify a cherry pit outdoors, sow it in a furrow no deeper than 1 to 2 times the width of the pit. Cover the pit with soil and put 1 or 2 inches of sand over that to prevent the soil from forming a crust on the soil as winter cold stratifies the seed."}, {"url": "http://vikkisverandah.blogspot.com/2010/07/how-to-grow-cherry-tree-from-seed.html", "passage_text": "How to grow a cherry tree from seed. at 7/14/2010 05:36:00 AM. We've been eating a lot of cherries these days ... right time of year ... fresh firm flesh ... good prices ... lots of bing red cherries and ranier yellow cherries. Hmmm! Our neighbor also has a tart cherry tree (with both red and yellow colors ... The cherry seeds will go through a natural stratification process in the winter.3. In the spring, the cherry pits and seeds will start to sprout into a tree. Wait until the trees are 8 to 12 inches tall and then transplant them to the area you would like the trees to grow permanently. After you have transplanted the cherry tree, mulchwell around it to prevent weeds and encourage moisture in the soil"}, {"url": "http://www.ehow.com/how_5320649_grow-cherry-tree-seed-pit.html", "passage_text": "The rootstock determines tree size. If you grow a tree from a pit, the tree will likely be a full-sized tree, meaning you have to give it enough space to grow. Sour cherries need 20 to 25 feet between trees. Sweet cherries need 25 to 30 feet between cherries. To stratify a cherry pit outdoors, sow it in a furrow no deeper than 1 to 2 times the width of the pit. Cover the pit with soil and put 1 or 2 inches of sand over that to prevent the soil from forming a crust on the soil as winter cold stratifies the seed."}, {"url": "http://www.youtube.com/watch?v=nbKS8HDwOdM", "passage_text": "This video shows how to best propagate a cherry tree from seed. I recommend using water from a dehumidifier when moistening the soil. In general, tap water should be avoided when watering seedlings. The cactus soil has assisted me in propagation of avocado, apple, and palm trees. Cherry seeds will have roughly a 50% germination rate.Growing from seed does have an air of mystery, you could even end up with a new variety of cherry."}, {"url": "http://www.wikihow.com/Plant-Cherry-Seeds", "passage_text": "Two Methods: Planting Cherry Seeds in the Ground Planting Cherry Seeds in a Pot. A cherry seed is actually a pit located in the middle of each cherry. You can pull out a cherry seed and plant it directly in the ground or in a pot. In order to plant cherry seeds, you must put it through a stratification process to better ensure germination of the seeds in the spring. 1 Place all of the cherry seeds in a metal or plastic container that's filled with an even mixture of sand and peat moss. 2  Make sure this mixture is moist but not soggy. 3  Make sure air is able to circulate within the container by popping a few air holes in the lid."}, {"url": "http://www.gardeningknowhow.com/edible/fruits/cherry/grow-a-cherry-tree-pit.htm", "passage_text": "Use cherries from either a tree growing in the area or purchased from a farmers market. Cherries from the grocers are stored in such a way, refrigerated, that makes starting seeds from them unreliable. Advertisement. Save the pits from the cherries you’ve just devoured and put them in a bowl of warm water. How to Grow Cherry Trees from Pits. Once the ten weeks has passed, remove the pits and allow them to come to room temperature. You are now ready for planting the cherry seeds. Put 2-3 pits into a small container filled with planting medium and water the seeds in. Keep the soil moist."}]