[{"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0010228/?report=details", "passage_text": "Uses of This Medicine. Etodolac is a nonsteroidal anti-inflammatory drug (NSAID) used to treat mild to moderate pain, and helps to relieve symptoms of arthritis (osteoarthritis and rheumatoid arthritis), such as inflammation, swelling, stiffness, and joint pain. "}, {"url": "http://www.goodrx.com/etodolac/what-is", "passage_text": "Uses For etodolac. Etodolac is a nonsteroidal anti-inflammatory drug (NSAID) used to treat mild to moderate pain, and helps to relieve symptoms of arthritis (osteoarthritis and rheumatoid arthritis), such as inflammation, swelling, stiffness, and joint pain. etodolac. ETODOLAC is a non-steroidal anti-inflammatory drug (NSAID). It is used to reduce swelling and to treat mild to moderate pain. This medicine may be used to treat osteoarthritis or rheumatoid arthritis."}, {"url": "http://www.mayoclinic.org/drugs-supplements/etodolac-oral-route/description/DRG-20069756", "passage_text": "Descriptions. Etodolac is a nonsteroidal anti-inflammatory drug (NSAID) used to treat mild to moderate pain, and helps to relieve symptoms of arthritis (osteoarthritis and rheumatoid arthritis), such as inflammation, swelling, stiffness, and joint pain. "}, {"url": "http://www.rxlist.com/lodine-drug/patient-images-side-effects.htm", "passage_text": "Etodolac is in a group of drugs called nonsteroidal anti-inflammatory drugs (NSAIDs). Etodolac works by reducing hormones that cause inflammation and pain in the body. Etodolac is used to treat pain or inflammation caused by arthritis. Etodolac may also be used for other purposes not listed in this medication guide."}, {"url": "http://www.medicinenet.com/etodolac/article.htm", "passage_text": "DISCONTINUED BRAND: Lodine. DRUG CLASS AND MECHANISM: Etodolac belongs to a class of drugs called nonsteroidal anti-inflammatory drugs (NSAIDs). Other members of this class include ibuprofen (Motrin, Advil, Nuprin, etc.), naproxen (Aleve, Naprosyn), indomethacin (Indocin), nabumetone (Relafen) and numerous others. These drugs are used for the management of mild to moderate pain, fever, and inflammation."}, {"url": "http://arthritis.emedtv.com/etodolac/etodolac.html", "passage_text": "Etodolac (Lodine ®) is in a class of drugs called nonsteroidal anti-inflammatory drugs (NSAIDs). It is used to reduce pain, inflammation, swelling, and stiffness caused by several conditions. "}, {"url": "https://en.wikipedia.org/wiki/Etodolac", "passage_text": "Main article: NSAIDs. NSAIDs are used for the management of mild to moderate pain, fever, and inflammation. They work by reducing the levels of prostaglandins, which are chemicals that are responsible for pain and the fever and tenderness that occur with inflammation. Etodolac blocks the cyclooxygenase (abbrev. Patients taking both lithium and etodolac may develop toxic blood lithium levels. Additionally, etodolac has been found to interact with certain anti-depressant medications, such as sertraline or fluoxetine, which can increase risks of stroke, heart attack, and other cardiovascular conditions."}, {"url": "http://www.everydayhealth.com/drugs/etodolac", "passage_text": "5 Reviews. 5 Reviews. Etodolac is a non-steroidal anti-inflammatory drug (NSAID) used to treat mild to moderate pain, and to relieve symptoms of arthritis (osteoarthritis and rheumatoid arthritis), such as inflammation, swelling, stiffness, and joint pain. Lodine, the brand-name formulation of the drug, has been discontinued in the United States, and only the generic form of etodolac is available. Etodolac works by reducing the levels of hormones that cause inflammation and pain in the body. Etodolac may also be used for other purposes."}, {"url": "http://www.emedicinehealth.com/drug-etodolac/article_em.htm", "passage_text": "Etodolac is in a group of drugs called nonsteroidal anti-inflammatory drugs (NSAIDs). Etodolac works by reducing hormones that cause inflammation and pain in the body. Etodolac is used to treat pain or inflammation caused by arthritis. "}]