[{"url": "http://www.uspto.gov/patents-getting-started/international-patent-cooperation", "passage_text": "International Patent Cooperation. The establishment of the Office of International Patent Cooperation reflects the USPTO's strong commitment to the IP community in improving the international patent system, said Deputy Under Secretary of Commerce for Intellectual Property and Deputy Director of the USPTO Michelle Lee."}, {"url": "http://www.merriam-webster.com/dictionary/patent", "passage_text": "Full Definition of PATENT. 1. : an official document conferring a right or privilege: letters patent. 2. a: a writing securing for a term of years the exclusive right to make, use, or sell an invention b: the monopoly or right so granted c: a patented invention. 3."}, {"url": "https://www.law.cornell.edu/wex/patent", "passage_text": "A patent grants the patent holder the exclusive right to exclude others from making, using, importing, and selling the patented innovation for a limited period of time."}, {"url": "http://definitions.uslegal.com/p/patent-attorney/", "passage_text": "Patent Attorney Law & Legal Definition. A patent attorney refers to a lawyer who is licensed to practice before the U.S. Patent and Trademark Office (USPTO). A patent attorney is also referred to as a patent agent. A patent attorney is an attorney who has the requisite qualifications necessary for representing clients trying to obtain patents. The term, patent attorney is used differently in different countries."}, {"url": "http://www.investopedia.com/terms/p/patent-agent.asp", "passage_text": "DEFINITION of 'Patent Agent'. A professional who is licensed by the United States Patent and Trademark Office (USPTO) to provide patentability opinions and assist inventors in preparing and filing patent applications."}, {"url": "http://www.wipo.int/pct/en/faqs/faqs.html", "passage_text": "In general terms, your international patent application, provided that it complies with the minimum requirements for obtaining an international filing date, has the effect of a national patent application (and certain regional patent applications) in or for all PCT Contracting States."}, {"url": "http://www.wipo.int/pct/en/faqs/faqs.html", "passage_text": "The PCT is an international treaty with more than 145 Contracting States. 1 The PCT makes it possible to seek patent protection for an invention simultaneously in a large number of countries by filing a single “international” patent application instead of filing several separate national or regional patent applications."}]