[{"url": "http://homeguides.sfgate.com/information-dappled-willow-shrubs-51245.html", "passage_text": "Characteristics. Dappled willows are deciduous shrubs that grow 4 to 6 feet in height and width with judicious pruning or 15 to 20 feet when allowed to grow into trees. Propagation. Dappled willows, like the rest of the willow family, are simple to propagate. During the spring, cut 8-inch lengths of softwood stems with no leaves; in the winter, do the same with hardwood samples."}, {"url": "http://growingthehomegarden.com/2008/06/visiting-mother-plant-japanese-dappled.html", "passage_text": "Several weeks ago I wrote a post about one of my favorite shrubs, the Japanese Dappled Willow 'Hakuro Nishiki' (Salix integra) . It's a fast growing variegated willow that works well as a privacy screen and is hardy in zones 4-9. "}, {"url": "http://forums.gardenweb.com/discussions/1788072/dappled-willow-tree-form", "passage_text": "Undo. dianasan (z5a Mtl). I purchased a small, 12-inch dappled willow shrub at a nursery in September 08 which I proceeded to train as a standard or tree-form. It's presently about 4 feet tall and I intend (hopefully) to train it to about 8 feet tall. My next-door neighbor has 2 beautiful specimen (tree forms) which are about 12 feet tall. "}, {"url": "http://www.midwestgardentips.com/hakuro-nishiki_dappled_willow.html", "passage_text": "Dappled willow trees and shrubs will grow well in full sun, part sun or part shade. Best color is produced in full sun. But in zones with hotter summers, the dappled willow will not tolerate prolonged heat. It is best to plant in part sun or part shade and water weekly where summers are long, hot and dry. They can grow several feet per year and will usually spread equal to their height (a mature ‘Hakuro Nishiki’ may reach about 10 feet). In general, willow roots are invasive and can exceed the width of the tree’s branches as much as 3 to 4 times."}, {"url": "http://www.midwestgardentips.com/hakuro-nishiki_dappled_willow.html", "passage_text": "Salix integra ‘Hakuro-nishiki Dappled Willow’, as well as other dwarf shrub willows, are available as a tree form. These are grafted to a compatible, strong and straight growing, upright willow trunk. They can grow several feet per year and will usually spread equal to their height (a mature ‘Hakuro Nishiki’ may reach about 10 feet). In general, willow roots are invasive and can exceed the width of the tree’s branches as much as 3 to 4 times."}, {"url": "http://www.gardeningcentral.org/dappled_willow/dappled_willow.html", "passage_text": "A Guide to Growing the Dappled Willow. Dappled willow is one of the more than 300 species in the willow family. It has several other names, including Hakuro-nishiki, Albo-maculata, Dappled Japanese Willow and Variegated willow. This dwarf willow is a shrub and difficult to train to tree shape. Gardeners plant the dappled willow because of its beautiful colors. It starts to grow earlier in the spring than other plants, beginning with yellow catkins which appear on the plant in April. The foliage will start out as pink in the spring and then turn to green and creamy white for the summer."}, {"url": "http://www.midwestgardentips.com/hakuro-nishiki_dappled_willow.html", "passage_text": "Willow roots in general grow very fast, just like the willow plant. They can grow several feet per year and will usually spread equal to their height (a mature ‘Hakuro Nishiki’ may reach about 10 feet). In general, willow roots are invasive and can exceed the width of the tree’s branches as much as 3 to 4 times."}, {"url": "http://www.gardenguides.com/102332-plant-dappled-willow-trees.html", "passage_text": "The dappled willow tree (Salix integra) is also sometimes referred to as the Japanese dappled willow and the Nishiki willow. It is a small-growing, deciduous tree that is usually grown as a shrub since it only grows to between 8 and 10 feet in height. The dappled willow has striking variegated, white-green foliage that is sometimes tinged with pink. If you are planting a bare-root dappled willow tree, spread out its roots in all directions. If you are planting a container-grown dappled willow tree, loosen the root system with your fingers if there are any bound or matted roots present. Scoop in garden soil to fill the planting hole about 2/3 full of soil."}]