[{"url": "http://answers.microsoft.com/en-us/windows/forum/windows_8-tms/mouse-wont-work-with-windows-8/5f2c17b3-d016-4f86-9f84-13eccb8ab6a5", "passage_text": "a) Press the ‘Windows + R’ key on the keyboard. b) In the ‘Run’ windows type ’MSCONFIG’ and click ‘Ok’. c) Click the ‘Boot’ tab and uncheck ‘Safe Boot’ option. d) On the ‘General’ tab, click to select the option ‘Selective startup’, and then click to clear the option Load startup items check box. "}, {"url": "http://www.wikihow.com/Connect-a-Wireless-Mouse", "passage_text": "Download drivers for the mouse. If you have difficulty using your mouse and you were not prompted to download anything, then try using a search engine such as Google to look up whether your mouse requires drivers or not. If your mouse came with a CD then insert the CD to install the drivers. "}, {"url": "http://theworkingmouse.com/mouse-wont-work/", "passage_text": "You may also have a reset/connect button on the remote or receiver that came with your wireless mouse. You may have to use a pencil or a pen to push in the reset button. If you have mouse with a tail (wire/cable) then make sure it is plugged in and in the correct port. If it is a ps/2 (usually with a green round connection, then make sure it is in the green ps/2 port on your computer, if it is a USB connection, be sure it is plugged in a USB port. If you cannot move the mouse and you have a button just above the mouse touch pad, then press and release it one time only because if you press it twice, it will just re-deactivate it. Some mouse touch pads activate/deactivate buttons have a light that changes in color when they are activated or deactivated."}, {"url": "http://www.ehow.com/how_6903350_laser-mouse-won_t-work.html", "passage_text": "A laser mouse, better known as a wireless mouse, can stop operating correctly for a number of reasons: the signal from the mouse to the receiver is blocked, the batteries are low, the software to run the mouse isn't installed correctly or a different reason entirely. Restart your computer if the mouse does not immediately work. Remove any other mouse software that might be installed (from a previous mouse, for example) by going to the Uninstall Programs menu, and choosing to uninstall the old mouse software. Restart the computer once the uninstall is completed"}, {"url": "http://www.ehow.com/how_6903350_laser-mouse-won_t-work.html", "passage_text": "Flip the mouse upside down and check to see if the red light on the underside of the mouse is on. If it is not, replace the batteries in the mouse and restart your computer. Move the wireless receiver to a place where it has a clear line of sight to the mouse, and then try moving your cursor around on the screen. Restart your computer if the mouse does not immediately work. Remove any other mouse software that might be installed (from a previous mouse, for example) by going to the Uninstall Programs menu, and choosing to uninstall the old mouse software. Restart the computer once the uninstall is completed"}, {"url": "http://peripherals.about.com/od/Mice/a/My-Mouse-Wo-Not-Work-Now-What.htm", "passage_text": "3. Try a different USB port. There may be a problem with the one you're using, so unplug your mouse or the receiver and try an alternate one. 4. Connect the mouse directly to the USB port if you're using a multi-card reader. There may be an issue with that device instead of the mouse or USB port. 5."}, {"url": "https://support.apple.com/en-us/HT204621", "passage_text": "1 Slide the On/Off switch on the bottom of your mouse to turn it on. 2  Note: If the battery compartment cover is not installed properly the On/Off switch may not function correctly or may be difficult to operate. 3  Remove the battery compartment cover and carefully reinstall it. "}, {"url": "https://discussions.apple.com/thread/1683673?start=0&tstart=0", "passage_text": "Level 1 (0 points). I have had my wireless mouse for almost three years now. After two years I accidentally dropped it and the metal strip on the lid of the mouse came off, but nothing a little scotch tape couldn't fix, and had worked well with my G4 laptop until now. "}, {"url": "http://smallbusiness.chron.com/reset-logitech-wireless-mouse-53415.html", "passage_text": "How to Reset a Logitech Wireless Mouse. Your Logitech wireless optical mouse gives you precise cursor control whether you're working on the office computer or using a laptop in a meeting. The mouse connects to your computer wirelessly via a USB receiver. If you have a connection problem, the mouse cursor may move slowly or erratically. Resetting the mouse typically fixes the problem."}]