[{"url": "https://en.wikipedia.org/wiki/Reflecting_telescope", "passage_text": "Since reflecting telescopes use mirrors, the design is sometimes referred to as a  catoptric  telescope. A mid-20th century innovation was catadioptric telescopes such as the Schmidt camera, which use both a spherical mirror and a lens (called a corrector plate) as primary optical elements, mainly used for wide-field imaging without spherical aberration."}, {"url": "https://en.wikipedia.org/wiki/Reflecting_telescope", "passage_text": "Almost all of the major telescopes used in astronomy research are reflectors. Reflecting telescopes come in many design variations and may employ extra optical elements to improve image quality or place the image in a mechanically advantageous position. A mid-20th century innovation was catadioptric telescopes such as the Schmidt camera, which use both a spherical mirror and a lens (called a corrector plate) as primary optical elements, mainly used for wide-field imaging without spherical aberration."}, {"url": "http://www.scientus.org/Reflecting-Telescope-History.html", "passage_text": "The one name that stands out in popular histories of the early reflecting telescope is Isaac Newton. Galileo has a similar honour in histories of the refracting telescope. In more serious histories, one name would not stand out for either the reflecting or refracting telescope. There were at least a dozen other scientists from the seventeenth century who made equally important contributions to Galileo and Newton (see Fathers of the Telescope). Newton:Inventor or Innovator. Isaac Newton developed the design for his reflecting telescope in 1668 (see Timeline of the Telescope). Newton's idea of building telescopes using mirrors instead of lenses was not new."}, {"url": "http://study.com/academy/lesson/types-of-telescopes-radio-reflecting-refracting-telescopes.html", "passage_text": "Reflector. A type of telescope used in most astronomy research is a reflecting telescope. Reflector telescopes use one mirror, or a combination of mirrors, to reflect light and form an image to the viewer. The design of this telescope allows astronomers to see things way out in space that don't emit much light. "}, {"url": "http://abyss.uoregon.edu/~js/glossary/reflecting_telescope.html", "passage_text": "Figure 5 illustrates a typical Cassegrain reflector. Some large telescopes of this kind do not have a hole in the primary mirror but use a small plane mirror in front of the primary to reflect the light outside the main tube and provide another place for observation. Reflecting telescopes have a number of other advantages over refractors. They are not subject to chromatic aberration because reflected light does not disperse according to wavelength. Also, the telescope tube of a reflector is shorter than that of a refractor of the same diameter, which reduces the cost of the tube. Consequently, the dome for housing a reflector is smaller and more economical to construct. So far only the primary mirror for the reflector has been discussed"}, {"url": "https://en.wikipedia.org/wiki/Newtonian_telescope", "passage_text": "The Newtonian telescope is a type of reflecting telescope invented by the British scientist Sir Isaac Newton (1642–1727), using a concave primary mirror and a flat diagonal secondary mirror. Newton’s first reflecting telescope was completed in 1668 and is the earliest known functional reflecting telescope. Newton built his reflecting telescope because he suspected it could prove his theory that white light is composed of a spectrum of colours."}, {"url": "http://www.softschools.com/facts/space/reflecting_telescope_facts/431/", "passage_text": "Reflecting Telescope Facts. A reflecting telescope is one that causes an image to reflect at a focus point by using mirrors. It was invented during the 1680s by Isaac Newton. These telescopes improved the before used refracting telescopes by giving a clearer picture. Reflecting telescopes are also called reflectors. Most telescopes used by astronomers today are reflectors. In Newtonian telescopes, one mirror is used to capture the image while another mirror is used to reflect the image from the first mirror. Most common reflecting telescopes are a variation of the Newtonian telescop"}, {"url": "http://www.answers.com/Q/What_do_a_scientist_use_a_telescope_for", "passage_text": "Galileo was probably the first scientist to use a telescope. Telescopes were invented about 1608 by spectacle makers in the Netherlands. Galileo used one for astronomy the f … ollowing year. "}]