[{"url": "http://www.trulia.com/voices/q_Cost+Per+Square+Foot+New+Construction+New+Jersey/", "passage_text": "what is the average price per square foot for a new single family home in 08820? We are looking to buy a single family home in North Edison or Metuchen and would ... 3 answers. Answer. What is the general cost per square foot for a second story addition in 07444? i want to add second floor on a exist range home, 500sf with 2 bedroom and 1 full bath. basement foundation is good, updated heat and plumbing."}, {"url": "http://www.answers.com/Q/What_is_the_average_construction_cost_per_square_foot_in_New_Jersey", "passage_text": "The average cost per square foot for commercial building is in the  median range of $200. There are several factors that figure into  the price such as size and location. Living space can range from $100 to $125 a square foot and up depending on finishes and what kind of mechanical systems (plumbing, HVAC, electric) are involved. I've built some REALLY nicely upgraded/finished homes for $125 to $150 per square foot. $40 and up for garages is ok."}, {"url": "http://www.zillow.com/nj/home-values/", "passage_text": "The median home value in New Jersey is $282,500. New Jersey home values have declined -0.9% over the past year and Zillow predicts they will fall -0.7% within the next year. The median rent price in New Jersey is $1,900. Read more. Foreclosures will be a factor impacting home values in the next several years. In New Jersey 2.9 homes are foreclosed (per 10,000)"}, {"url": "http://www.trulia.com/real_estate/Galloway-New_Jersey/", "passage_text": "Summary for Galloway. Average price per square foot for Galloway NJ was $93, a decrease of 7.9% compared to the same period last year. The median sales price for homes in Galloway NJ for Jul 15 to Sep 15 was $135,000 based on 5 home sales. The average listing price for homes for sale in Galloway NJ was $211,532 for the week ending Sep 30, which represents an increase of 2.1%, or $4,301, compared to the prior week. Schools in Galloway."}, {"url": "http://www.answers.com/Q/What_is_the_average_construction_cost_per_square_foot_in_New_Jersey", "passage_text": "The average new construction cost for building a house in St. Louis  is around 120 dollars per square foot. Depending on the building  materials used and the size of the hou … se, this amount will vary. Living space can range from $100 to $125 a square foot and up depending on finishes and what kind of mechanical systems (plumbing, HVAC, electric) are involved. I've built some REALLY nicely upgraded/finished homes for $125 to $150 per square foot. $40 and up for garages is ok."}, {"url": "http://www.b4ubuild.com/faq/faq_0002.shtml", "passage_text": "Home prices of $55, $66, $72, $80, $84, $92, $110, $118, and $328 per square foot combine to produce an average of $112 per square foot, which is probably a reasonable figure for many areas of the country. However, the difference between the lowest figure and the highest is very substantial. "}, {"url": "http://ths.gardenweb.com/discussions/2256012/building-in-nj-300-350k-for-2500-sqft-home-crazy-or-possible", "passage_text": "At the top of your budget, $350,000 for a 2500 square foot house comes out at $140 per square foot. I have no idea what building costs are in NJ, but I've certainly heard that they are high. Builder 3 - would not give a price per sq foot but stated he just built a 3000 sqft home and total was about 450k but it did not include a lot of upgrades.. Builder 3 actually showed us the plans for the house that he said cost around 450k.."}, {"url": "http://www.buildingsguide.com/faq/what-average-commercial-building-cost-square-foot", "passage_text": "An average commercial steel building costs between $16 and $20 per square foot, including building package (I-Beams, purlins, girts etc.) , delivery, foundation and the cost of construction. "}]