[{"url": "http://www.fe.doe.gov/education/energylessons/coal/gen_howformed.html", "passage_text": "It is from under these caprocks that most oil and natural gas is produced today. The same types of forces also created coal, but there are a few differences. Coal formed from the dead remains of trees, ferns and other plants that lived 300 to 400 million years ago. In some areas, such as portions of what-is-now the eastern United States, coal was formed from swamps covered by sea water. In fact, most of the fossil fuels we find today were formed millions of years before the first dinosaurs. Formation of Coal. Fossil fuels were formed from plants and animals that lived 300 million years ago in primordial swamps and oceans (top)."}, {"url": "http://www.eolss.net/Sample-Chapters/C08/E3-04-01-05.pdf", "passage_text": "Recently, special interests have been the formation, evolution, and appraisal of the oil derived from coal and the development of new research approaches in the organic geochemistry of coal, such as the computer simulation method. [A book dealing with the formation of oil derived from coal, a new mode of formation of oil derived from coal is presented.] Pech (1981). Trace Element Geochemistry of Coal Resource Development Related to Environment Quality and Health, 153 pp."}, {"url": "http://www.answers.com/Q/Why_is_coal_an_organic_sedimentary_rock", "passage_text": "Because coal and most limestones are formed from organic material (living things). Coal is formed from compressed plant material, and limestone from animal remains (hard parts … : soft parts are almost always rotted, broken by force or consumed by predators). Coal is an organic sedimentary rock because it forms from the remains for plant material. Source: California Edition, Earth Science; Geology, the enviorment and the Universe Pg. 131."}, {"url": "https://en.wikipedia.org/wiki/Organic_matter", "passage_text": "Other meanings can be found at Biological material (disambiguation). Organic matter or organic material, natural organic matter, NOM is matter composed of organic compounds that has come from the remains of organisms such as plants and animals and their waste products in the environment. Organic molecules can also be made by chemical reactions that don't involve life. "}, {"url": "http://www.answers.com/Q/Why_is_coal_an_organic_sedimentary_rock", "passage_text": "All coal is metamorphic and sedimentary rock. When coal forms it is made out of ancient organic material, and over a long period of time the coal is buried under sediments and … water. Coal is an organic sedimentary rock because it forms from the remains for plant material. Source: California Edition, Earth Science; Geology, the enviorment and the Universe Pg. 131."}, {"url": "http://www.coaleducation.org/lessons/sec/properties/coalderiv/coalder.htm", "passage_text": "Return To Secondary Lesson Plans. Click here for a printable version. Title: Coal Derivatives by Destructive DistillationLevel: SecondaryDay/Time: One class periodKERA Goals: 2.1Objective:This is a hands-on activity demonstrating the production of coke, one of the most widely used raw materials derived from coal. Bituminous, or soft coal, is the third stage and the most abundant type of coal. It has lost most of its moisture and nitrogen impurities and is an efficient heating material. The final stage of coal, anthracite, is a metamorphic rock."}, {"url": "http://geology.com/rocks/coal.shtml", "passage_text": "Coal is an organic sedimentary rock that forms from the accumulation and preservation of plant materials, usually in a swamp environment. Coal is a combustible rock and along with oil and natural gas it is one of the three most important fossil fuels. Coal has a wide range of uses; the most important use is for the generation of electricity. Coal forms from the accumulation of plant debri"}, {"url": "http://www.nrcan.gc.ca/mining-materials/markets/commodity-reviews/2012/14377", "passage_text": "Coal is an organically derived material. It is formed from the remains of decayed plant material compacted into a solid through millions of years of chemical changes under pressure and heat. As the organic maturity process continues, the buried plant material is transformed into different types of coal. Coal has been consumed as an energy source for hundreds of years. It provided the energy that boosted the industrial revolution of the 19th century and launched the electric era in the following century. It was the world's most important source of primary energy until the late 1960s when it was overtaken by oil."}, {"url": "http://geology.about.com/od/mineral_resources/a/aa_nutshellcoal.htm", "passage_text": "Coal, the Organic Rock. Coal differs from every other kind of rock in that it is made of organic carbon: the actual remains, not just mineralized fossils, of dead plants. Today the vast majority of dead plant matter is consumed by fire and decay, returning its carbon to the atmosphere as the gas carbon dioxide—it is oxidized. First the swampy peat is squeezed and heated to form a brown, soft coal called lignite. In the process, the material releases hydrocarbons, which migrate away and eventually become petroleum. With more heat and pressure lignite releases more hydrocarbons and becomes the higher-grade bituminous coal."}]