[{"url": "https://www.firerecruit.com/articles/1063916-What-are-the-requirements-to-be-a-firefighter", "passage_text": "The general standard is that you must be between the age of 18 and 29, although some fire departments extend the maximum age requirement past the age of 30. Be sure to check in your locality to see what the age ranges are as part of the requirements to be a firefighter. You’ll undergo a certification test at the end of the training which, if passed, will make you an official firefighter. Firefighting 101. by FireRescue1 Staff. The first step in a career in firefighting is to find out what the requirements are to be a firefighter in the location where you plan to be employed."}, {"url": "http://www.howtobecomeafirefighterguide.com/how-to-become-a-firefighter-in-texas/", "passage_text": "April 2010, you need to provide a small fee of $35 in order to have your applications reviewed for its equivalency to the basic training program and this fee is non-refundable. Again, remember to submit TCFP-002 application form to become a firefighter in Texas. Resource: TCFP. "}, {"url": "http://www.volunteerfd.org/become-a-volunteer-firefighter/", "passage_text": "1. Make sure you're ready to commit. Making the decision to become a volunteer firefighter should not be taken lightly. It requires hundreds of hours of training and a strong commitment to service. Research Volunteer firefighting by reading articles and expert columns at FireRescue1.com's Volunteer page. 5. After you join, the department will usually enter you in a training program. The length of these programs varies, but all firefighters are required to take a minimum 110-hour NFPA-certified course."}, {"url": "http://www.fireservice.co.uk/recruitment/faq", "passage_text": "The minimum age before you can join the fire service is 18 years old. Applicants can apply at 17 yrs 10 months. If you are under this age you still may be able to get help by joining a Young Firefighters Scheme. You will need to contact the brigade closest to you, to see if this is something they offer. No formal qualifications are required to become a firefighter. However, you will need to pass a series of written and apptitude tests to proceed with any application. Any qualifications you bring into the service may help with future promotion."}, {"url": "http://www.wikihow.com/Become-a-Firefighter", "passage_text": "Be at least 18 years old. This is the minimum age requirement for being a firefighter. However, in some states, you will have to be at least 21 to apply, so look in to the requirements in your own state. 3. Pass the medical exam. To be a firefighter, you will need to have coordination, agility, and strength, as well as an overall high level of physical fitness. You must also be in general good health and be free of any physical constraints."}, {"url": "http://www.learnhowtobecome.org/firefighter/", "passage_text": "You’ll need to be at least 18 years of age. Once hired, firefighters typically receive training from the fire department where the firefighter is employed or from a state fire school. College-level coursework in fire science can boost your chances of gaining entry-level jobs in urban or forest firefighting. 2. "}, {"url": "http://www.vafire.com/training/become_a_firefighter.htm", "passage_text": "The probationary period for a firefighter recruit is usually 6 months to one year. Of course, working firefighters continue to train-called in-service training-to learn about upgraded equipment and new techniques. In addition, regular testing and evaluations are common. "}, {"url": "http://www.fireservice.co.uk/recruitment/faq", "passage_text": "10. No formal qualifications are required to become a firefighter. However, you will need to pass a series of written and apptitude tests to proceed with any application. Any qualifications you bring into the service may help with future promotion."}]