[{"url": "http://www.revenuquebec.ca/en/citoyen/situation/etudiant/credits/frais_scolaire.aspx", "passage_text": "You can claim a non-refundable tax credit for your tuition or examination fees paid for 2014 or for 1997 through 2013, provided they were not previously used to calculate a tax credit for tuition or examination fees. You can transfer to one of the individuals below the unused portion of the tax credit, provided that the transferred portion relates to your tuition or examination fees paid for the year (see the instructions for line line 398.1 in the guide to the income tax return (TP-1.G-V):"}, {"url": "http://www.revenuquebec.ca/en/citoyen/situation/etudiant/credits/frais_scolaire.aspx", "passage_text": "For more information on the tax credit for tuition or examination fees, see the instructions for line 398 in the guide to the income tax return (TP-1.G-V). You can transfer to one of the individuals below the unused portion of the tax credit, provided that the transferred portion relates to your tuition or examination fees paid for the year (see the instructions for line line 398.1 in the guide to the income tax return (TP-1.G-V):"}, {"url": "https://apstudent.collegeboard.org/takingtheexam/exam-fees", "passage_text": "Exam Fees. The fee for each AP Exam is $92. The fee for exams administered at schools outside of the United States, U.S. territories and commonwealths, and Canada, with the exception of U.S. Department of Defense Dependents Schools (DoDDS), is $122 per exam. 1 If you paid for an AP Exam but then decided not to take it, you may ask your AP Coordinator for a refund. 2  Local school policy determines the amount of the refund. 3  You will probably be required to pay the $15 fee the school is charged for each unused exam."}, {"url": "http://www.revenuquebec.ca/en/citoyen/declaration/produire/comment/aideligne/ligne398.aspx", "passage_text": "398 – Tax credit for tuition or examination fees. You can claim a tax credit for your tuition or examination fees paid for 2014 or for 1997 through 2013, provided they were not previously used to calculate a tax credit for tuition or examination fees. However, the 20% rate remains in effect for the following tuition and examination fees that you have not yet used to claim the credit: 1  fees paid for 1997 through 2012. 2  fees paid for 2013 for a semester of post-secondary studies that began before March 28, 2013."}, {"url": "http://www.another71.com/cpa-exam-forum/topic/are-cpa-fees-tax-deductible", "passage_text": "CPA exam fees and study materials as well as fees associated with the bar exam are not deductible because getting your CPA license qualifies you for a new profession according to the IRS. CPA fees related to tax preparation are deductible subject to the 2% of AGI limitation. "}, {"url": "https://www.goer.ny.gov/Training_Development/PEF/CertLicenseExamFee/ExamFee_Guidelines_FY12_13.pdf", "passage_text": "Certification and Licensure Exam Fee Reimbursement Retroactive Period Provides reimbursement for first time certification and licensure examination fees to PEF-represented employees for exams that occurred on or after April 1, 2012 through March 31, 2013. fication and Licensure Exam Fee Reimbursement Program taxable income. The Office of the State Comptroller will withhold The CLEFR retroactive period covers qualifying exams that occurred between January 1, 2012 and March 31, 2012."}, {"url": "http://www.revenuquebec.ca/en/citoyen/declaration/produire/comment/aideligne/ligne398.aspx", "passage_text": "Rate of the tax credit. Since 2013, the rate of the tax credit has been 8% rather than 20%. However, the 20% rate remains in effect for the following tuition and examination fees that you have not yet used to claim the credit: 1  fees paid for 1997 through 2012. 2  fees paid for 2013 for a semester of post-secondary studies that began before March 28, 2013."}, {"url": "https://www.irs.gov/tax-professionals/registered-tax-return-preparer-test-fee-refunds", "passage_text": "The IRS is refunding the fees that return preparers paid for the Registered Tax Return Preparer test. Letters will be mailed to refund recipients on May 28 and checks will be mailed on June 2. Return preparers took the test between November 2011 and January 2013 and paid a fee of $116. "}, {"url": "http://www.revenuquebec.ca/en/citoyen/declaration/produire/comment/aideligne/ligne398.aspx", "passage_text": "Even if your tuition or examination fees were paid by another person, you can claim a tax credit for the fees or transfer the unused portion of the tax credit to one of the people mentioned above (provided the transferred portion relates to the fees paid for the year). However, the 20% rate remains in effect for the following tuition and examination fees that you have not yet used to claim the credit: 1  fees paid for 1997 through 2012. 2  fees paid for 2013 for a semester of post-secondary studies that began before March 28, 2013."}]