[{"url": "http://www.webmd.com/melanoma-skin-cancer/melanoma-guide/squamous-cell-carcinoma", "passage_text": "In this article. Font Size. A. A. A. Squamous cell carcinoma (SCC) is the second most common form of skin cancer. It’s usually found on areas of the body damaged by UV rays from the sun or tanning beds. Sun-exposed skin includes the head, neck, ears, lips, arms, legs, and hands. SCC is a fairly slow-growing skin cancer. "}, {"url": "https://en.wikipedia.org/wiki/Squamous-cell_carcinoma", "passage_text": "Squamous-cell carcinoma or squamous-cell cancer (SCC or SqCC) is a cancer of a kind of epithelial cell, the squamous cell. These cells are the main part of the epidermis of the skin, and this cancer is one of the major forms of skin cancer. "}, {"url": "http://www.cancer.gov/types/skin/patient/skin-treatment-pdq", "passage_text": "The most common types are basal cell carcinoma and squamous cell carcinoma, which are nonmelanoma skin cancers. Nonmelanoma skin cancers rarely spread to other parts of the body. Melanoma is the rarest form of skin cancer. It is more likely to invade nearby tissues and spread to other parts of the body. "}, {"url": "http://www.cancer.org/cancer/skincancer-basalandsquamouscell/detailedguide/skin-cancer-basal-and-squamous-cell-signs-and-symptoms", "passage_text": "Squamous cell carcinomas. Squamous cell cancers tend to occur on sun-exposed areas of the body such as the face, ear, neck, lip, and back of the hands. Less often, they form in the skin of the genital area. They can also develop in scars or skin sores elsewhere. Signs and symptoms of basal and squamous cell skin cancers. Skin cancers often do not cause bothersome symptoms until they have grown quite large. Then they may itch, bleed, or even hurt."}, {"url": "http://www.skinsight.com/adult/squamousCellCarcinomaSCC.htm", "passage_text": "Squamous cell carcinoma typically develops in sun-damaged skin in fair-skinned patients. Squamous cell carcinoma (SCC) is the second most common form of skin cancer. Squamous cell carcinoma usually occurs on sun-damaged skin, especially in light-skinned individuals with a long history of chronic sun exposure. Squamous cell carcinoma requires treatment to prevent it from becoming too invasive. "}, {"url": "http://www.solanodermatology.com/treatment-of-squamous-cell-carcinoma/", "passage_text": "Treatment of Squamous Cell Carcinoma. Squamous cell carcinoma is the second most common skin cancer and is increasing at an alarming rate, particularly in the elderly. Squamous cell carcinoma without question is related directly to sun exposure and also to age. There are superficial forms of squamous cell carcinoma which are called in situ or Bowen’s disease (SCC in situ). There is a specialized form of squamous cell carcinoma in situ that can occur on the genitalia called Bowenoid papulosis which is induced by the wart virus, not by sun exposure."}, {"url": "http://www.webmd.com/melanoma-skin-cancer/ss/slideshow-skin-lesions-and-cancer", "passage_text": "The Warning Signs of Skin Cancer. Skin cancers -- including melanoma, basal cell carcinoma, and squamous cell carcinoma -- often start as changes to your skin. They can be new growths or precancerous lesions -- changes that are not cancer but could become cancer over time. Bowen disease is also called squamous cell carcinoma in situ.. It is a type of skin cancer that spreads outward on the surface of the skin. By contrast, invasive squamous cell carcinomas can grow inward and spread to the interior of the body."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001832/", "passage_text": "About Squamous Cell Skin Cancer. There are different types of cancer that start in the skin. The most common types are basal cell carcinoma and squamous cell carcinoma, which are nonmelanoma skin cancers. Nonmelanoma skin cancers rarely spread to other parts of the body. Melanoma is the rarest form of skin cancer. It is more likely to invade nearby tissues and spread to other parts of the body. Non-melanoma skin cancers include basal cell cancer and squamous cell cancer. Basal cell cancer is the most common kind of skin cancer, but it usually grows slowly. Squamous cell cancer is somewhat more aggressive."}]