[{"url": "http://www.buzzle.com/articles/how-many-ribs-do-humans-have.html", "passage_text": "The Human Rib Cage. All vertebrates have ribs. Humans, being complex evolved animals, have a complex rib cage, that comprises the ribs and sternum. Since the rib cage is present in the chest or thorax, it is also known as the thoracic cage."}, {"url": "http://www.buzzle.com/articles/how-many-ribs-do-humans-have.html", "passage_text": "Coming to the number of ribs in the human body, there are 12 pairs in the human body that is 24 in all. They are further categorized as true ribs, false ribs, and floating ribs, depending on their attachment to the parts of sternum."}, {"url": "http://www.numberof.net/number-of-ribs-in-humans/", "passage_text": "Humans have 24 ribs arranged in pairs. Starting from the top the first seven pairs of ribs are called the true ribs, the 8 th, 9 th and 10 th pair of ribs are called the false ribs, while the last two pairs are called the floating ribs. The ribs collectively form the rib cage."}, {"url": "http://unrealfacts.com/extra-ribs-in-humans/", "passage_text": "The extra ribs in humans are known as cervical ribs, or neck ribs. They usually appear, as one of the common names suggest, near the neck. They are caused by a congenital abnormality. But if you thought that extra ribs in humans was freaky, it gets even weirder."}, {"url": "http://www.buzzle.com/articles/how-many-ribs-do-humans-have.html", "passage_text": "The ribs protect the vital organs of the body, and hence, are among the most important bones in the human body. They form a cage-like structure around the vital organs, and due to this, all the ribs are collectively called the rib cage. However, there are other bones besides the ribs that make up"}, {"url": "https://en.wikipedia.org/wiki/Human_rib_cage", "passage_text": "In humans, the rib cage, also known as the thoracic cage, is a bony and cartilaginous structure which surrounds the thoracic cavity and supports the pectoral girdle (shoulder girdle), forming a core portion of the human skeleton."}, {"url": "http://1howmany.com/how-many-ribs-do-humans-have", "passage_text": "It is widely known that all vertebral species have ribs 1. Humans have a complex rib cage 2 which comprises of the sternum 3, ribs and some other parts. Every doctor knows how many ribs people have, but an ordinary man can have some difficulties with such a question. In fact, it is no difficult to memorize the answer:"}]