[{"url": "https://en.wikipedia.org/wiki/Manhattan", "passage_text": "New York County is one of seven counties in the United States to share the same name as the state they are located in; the other six counties are Arkansas County, Hawaii County, Idaho County, Iowa County, Oklahoma County, and Utah County. As of 2012, Manhattan's cost of living was the highest in the United States, but the borough also contained the country's most profound level of income inequality. Manhattan is also the United States county with the highest per capita income, being the sole county whose per capita income exceeded $100,000 in 2010."}, {"url": "https://en.wikipedia.org/wiki/List_of_counties_in_New_York", "passage_text": "Five of New York's counties are coterminous with the five boroughs of New York City and do not have functioning county governments, except for a few borough officials. To uniquely identify Albany County, New York, one must use the state code of 36 plus the county code of 001; therefore, the unique nationwide identifier for Albany County, New York, is 36001. The links in the column FIPS County Code are to the Census Bureau Info page for that county."}, {"url": "https://en.wikipedia.org/wiki/List_of_counties_in_New_York", "passage_text": "The most recent county formation in New York was in 1914, when Bronx County was created from the portions of New York City that had been annexed from Westchester County in the late 19th century and added to New York County. To uniquely identify Albany County, New York, one must use the state code of 36 plus the county code of 001; therefore, the unique nationwide identifier for Albany County, New York, is 36001. The links in the column FIPS County Code are to the Census Bureau Info page for that county."}, {"url": "https://en.wikipedia.org/wiki/List_of_counties_in_New_York", "passage_text": "Because each borough has a separate main Post Office (and Queens has four of them), the county seats of the five boroughs are often stated in terms of those main post offices: New York (Manhattan), Brooklyn, Bronx, Staten Island, and Jamaica (Queens) . To uniquely identify Albany County, New York, one must use the state code of 36 plus the county code of 001; therefore, the unique nationwide identifier for Albany County, New York, is 36001. The links in the column FIPS County Code are to the Census Bureau Info page for that county."}, {"url": "https://en.wikipedia.org/wiki/List_of_counties_in_New_York", "passage_text": "New York City is considered the county seat of these five counties: New York County (Manhattan), Kings County (Brooklyn), Bronx County (The Bronx), Richmond County (Staten Island), and Queens County (Queens). To uniquely identify Albany County, New York, one must use the state code of 36 plus the county code of 001; therefore, the unique nationwide identifier for Albany County, New York, is 36001. The links in the column FIPS County Code are to the Census Bureau Info page for that county."}, {"url": "http://www.p12.nysed.gov/repcrd2005/links/nycounty.shtml", "passage_text": "Counties of New York State. Select a county from this list. 1  New York City Counties (Boroughs); New York (Manhattan), Kings (Brooklyn), Queens, Bronx, and Richmond (Staten Island). 2  New York City Annual School Report. "}, {"url": "http://www.answers.com/Q/What_county_is_Manhattan", "passage_text": "The five boroughs of New York City are Manhattan, Queens, Brooklyn, The Bronx and Staten Island. Each borough is also a county in state government: Manhattan … is New York County, Brooklyn is Kings County, Staten Island is Richmond County, and the other two have the same names (Queens County and Bronx County). So, the terms Manhattan and New York County both refer to the same piece of land. Manhattan, the borough of New York City, is located at the southermost point of New York State (along with the rest of New York City), at the edge of the Atlantic Ocean. The … re is also a city in northeast Kansas called Manhattan, and a village in northeast Illinois called Manhattan."}, {"url": "http://newyorkcityvisitorsnetwork.com/newyork/", "passage_text": "110th to 145th Street lies the village of Harlem 145th to 220th Street has no special designation, but does contain the neighborhood of Washington Heights and the Cloisters. The island of Manhattan (New York County) is largely a protrusion of granite, rising a few hundred feet from sea-level. The southern tip and center of the island are virtually solid granite, while areas in Greenwich Village and Chelsea are composed of softer soil. New York County (Manhattan) We now offer instant online reservation services for over 500 New York City Hotels at discounted rates. Just click here!"}, {"url": "http://www.answers.com/Q/What_county_is_Manhattan", "passage_text": "Each of New York City's five boroughs is also a county. Manhattan is New York County, Brooklyn is Kings County, Queens is Queens County, The Bron … x is Bronx County, and Staten Island is Richmond County. Manhattan, the borough of New York City, is located at the southermost point of New York State (along with the rest of New York City), at the edge of the Atlantic Ocean. The … re is also a city in northeast Kansas called Manhattan, and a village in northeast Illinois called Manhattan."}]