[{"url": "http://www.merriam-webster.com/dictionary/totem%20pole", "passage_text": "Full Definition of TOTEM POLE. 1. : a pole or pillar carved and painted with a series of totemic symbols representing family lineage and often mythical or historical incidents and erected by Indian tribes of the northwest coast of North America. 2. : an order of rank: hierarchy. See totem pole defined for English-language learners."}, {"url": "http://wonderopolis.org/wonder/what-is-a-totem-pole/", "passage_text": "Figures on a totem pole are not gods to be worshipped. Instead, they represent traits and characteristics each clan or story embodies. There are many other types of totem poles. Genealogy poles are erected in front of a family's home to represent the owner's clan or social status."}, {"url": "http://www.merriam-webster.com/dictionary/totem%20pole", "passage_text": "totem pole. noun. Tweet. : a tall usually wooden pole that is carved and painted with symbols, figures, or masks which represent different Native American tribes. —used to describe someone's position or level in a company or organization."}, {"url": "https://en.wikipedia.org/wiki/Totem_pole", "passage_text": "Totem poles are monumental sculptures carved on poles, posts, or pillars with symbols or figures made from large trees, mostly western red cedar, by indigenous peoples of the Pacific Northwest coast of North America (northwestern United States and Canada's western province, British Columbia)."}, {"url": "http://www.legendsofamerica.com/na-totems.html", "passage_text": "A totem is a spirit being, sacred object, or symbol of a tribe, clan, family or individual. Native American tradition provides that each individual is connected with nine different animals that will accompany each person through life, acting as guides."}, {"url": "http://www.merriam-webster.com/dictionary/totem%20pole", "passage_text": "Definition of TOTEM POLE for Kids. : a usually wooden pole or pillar carved and painted with totems and set up by American Indian tribes of the northwest coast of North America."}, {"url": "http://www.indians.org/articles/totem-poles.html", "passage_text": "Many Native American Indians expressed themselves with their artwork carved into totem poles. Many believe that all Indian tribes carved totem poles but this is far from the truth. Those Indians living in the southwest, the plains and Inuit Indians did not have trees to carve."}, {"url": "http://wonderopolis.org/wonder/what-is-a-totem-pole/", "passage_text": "In North America, totem poles are part of the cultures of many indigenous peoples of Alaska, British Columbia and the Pacific Northwest. Totem poles serve many purposes beyond their beauty, and their meanings are as varied as the cultures that make them. Some totem poles represent stories or important events."}]