[{"url": "http://ghr.nlm.nih.gov/gene/BRAF", "passage_text": "The V600E mutation (described above) is the most common BRAF gene mutation found in human cancers. This mutation has frequently been found in an aggressive form of skin cancer called melanoma as well as in cancers of the colon and rectum, ovary, and thyroid gland. Noonan syndrome-caused by mutations in the BRAF gene. At least six BRAF gene mutations have been found to cause Noonan syndrome. These mutations change single amino acids in the BRAF protein. The resulting protein is continuously active, rather than switching on and off in response to cell signals."}, {"url": "http://ghr.nlm.nih.gov/gene/BRAF", "passage_text": "The BRAF gene provides instructions for making a protein that helps transmit chemical signals from outside the cell to the cell's nucleus. This protein is part of a signaling pathway known as the RAS/MAPK pathway, which controls several important cell functions. Noonan syndrome-caused by mutations in the BRAF gene. At least six BRAF gene mutations have been found to cause Noonan syndrome. These mutations change single amino acids in the BRAF protein. The resulting protein is continuously active, rather than switching on and off in response to cell signals."}, {"url": "http://www.cancer.org/cancer/thyroidcancer/detailedguide/thyroid-cancer-what-causes", "passage_text": "Many papillary thyroid cancers have a mutated BRAF gene. The BRAF mutation is less common in thyroid cancers in children and in those thought to develop from exposure to radiation. Cancers with BRAF changes tend to grow and spread to other parts of the body more quickly. Both BRAF and RET/PTC changes are thought to make cells grow and divide."}, {"url": "http://www.nature.com/nature/journal/v417/n6892/full/nature00766.html", "passage_text": "Although BRAF mutations are found in a wide range of cancers, there is a trend towards the occurrence of mutations in cancer types in which a substantial proportion of cases are known to harbour RAS mutations (for example, malignant melanoma, colorectal cancer and borderline ovarian cancers). All mutations are within the kinase domain, with a single substitution (V599E) accounting for 80%. Mutated BRAF proteins have elevated kinase activity and are transforming in NIH3T3 cells. Furthermore, RAS function is not required for the growth of cancer cell lines with the V599E mutation."}, {"url": "https://en.wikipedia.org/wiki/BRAF_(gene)", "passage_text": "BRAF is a human gene that makes a protein called B-Raf. The gene is also referred to as proto-oncogene B-Raf and v-Raf murine sarcoma viral oncogene homolog B, while the protein is more formally known as serine/threonine-protein kinase B-Raf. "}, {"url": "http://emedicine.medscape.com/article/2045309-overview", "passage_text": "BRAF gene mutation testing has emerged as an important tool for diagnosis, prognosis, treatment, and predicting patient outcome in response to targeted therapy. Evidence indicates BRAF gene mutation testing has a role in the following: The BRAF gene mutation test result is positive (ie, a mutation is present) if V600E is found in the BRAF gene. V600E is the most common gene mutation for the BRAF gene and is the most common mutation tested for in clinical laboratories."}, {"url": "http://emedicine.medscape.com/article/2045309-overview", "passage_text": "BRAF gene mutation testing has emerged as an important tool for diagnosis, prognosis, treatment, and predicting patient outcome in response to targeted therapy for multiple cancer types. The BRAF gene mutation test result is positive (ie, a mutation is present) if V600E is found in the BRAF gene. V600E is the most common gene mutation for the BRAF gene and is the most common mutation tested for in clinical laboratories."}, {"url": "http://ghr.nlm.nih.gov/gene/BRAF", "passage_text": "At least two mutations in the BRAF gene have been found to cause multiple lentigines syndrome (formerly called LEOPARD syndrome). This condition is characterized by multiple brown skin spots (lentigines), heart defects, short stature, genital abnormalities, hearing loss, and distinctive facial features. Noonan syndrome-caused by mutations in the BRAF gene. At least six BRAF gene mutations have been found to cause Noonan syndrome. These mutations change single amino acids in the BRAF protein. The resulting protein is continuously active, rather than switching on and off in response to cell signals."}, {"url": "http://ghr.nlm.nih.gov/gene/BRAF", "passage_text": "The V600E mutation (described above) in the BRAF gene has also been found to cause giant congenital melanocytic nevus. This condition is characterized by a large, noncancerous patch of abnormally dark skin that is present from birth and an increased risk of a type of skin cell cancer called melanoma. Noonan syndrome-caused by mutations in the BRAF gene. At least six BRAF gene mutations have been found to cause Noonan syndrome. These mutations change single amino acids in the BRAF protein. The resulting protein is continuously active, rather than switching on and off in response to cell signals."}]