[{"url": "http://www.answers.com/Q/When_is_diwali_celebrated", "passage_text": "Diwali is mainly a Hindu festival. It is also celebrated by Sikhs, Jains, Buddhists for different reasons. There are several reasons to celebrate Diwali depending on the group … celebrating it. Diwali or Deepavali is a significant festival in Hinduism, Sikhism, and Jainism. All of these religions celebrate Diwali as the Festival of Lights. Diwali is celebrated by people at their work places and also in their homes by lighting of earthern lamps, now a days, candles and electric lights with worship of Goddess Lakshmi, the Goddess of all kinds of riches (money is just one, education is another)."}, {"url": "http://www.independent.co.uk/news/world/asia/diwali-2014-what-is-the-festival-of-lights-and-how-is-it-celebrated-9810212.html", "passage_text": "Diwali is the five-day festival of lights, celebrated by millions of Hindus, Sikhs and Jains across the world. The festival, which coincides with the Hindu New Year, celebrates new beginnings and the triumph of good over evil and light over darkness. One of the most significant festivals in Indian culture, Diwali, the festival of lights, sees millions attend firework displays, prayers and celebratory events across the world every autumn."}, {"url": "http://www.answers.com/Q/How_is_Diwali_celebrated", "passage_text": "Diwali is mainly a Hindu festival. It is also celebrated by Sikhs, Jains, Buddhists for different reasons. There are several reasons to celebrate Diwali depending on the gro … up celebrating it. Diwali or Deepavali is a significant festival in Hinduism, Sikhism, and Jainism. It is also celebrated by Sikhs, Jains, Buddhists for different reasons. There are several reasons to celebrate Diwali depending on the group … celebrating it. Diwali or Deepavali is a significant festival in Hinduism, Sikhism, and Jainism. All of these religions celebrate Diwali as the Festival of Lights."}, {"url": "http://www.answers.com/Q/When_is_diwali_celebrated", "passage_text": "Diwali falls on the one new moon night (Amavasya) between mid-October and mid-November. Diwali is celebrated for five days according to the lunisolar. It begins in late Ashvin (between September and October) and ends in early Kartika (between October and November). Diwali is celebrated by people at their work places and also in their homes by lighting of earthern lamps, now a days, candles and electric lights with worship of Goddess Lakshmi, the Goddess of all kinds of riches (money is just one, education is another)."}, {"url": "http://www.wikihow.com/Celebrate-Diwali", "passage_text": "Just as Christians regard Christmas as a special and important holiday, Diwali is a festival that has as much meaning for Hindus. Aside from Hinduism, other religions that celebrate this festival are Buddhism, Jainism, and Sikhism. Whatever your faith, you can join in the festivity that is The Festival of Lights. "}, {"url": "http://www.independent.co.uk/news/world/asia/diwali-2014-what-is-the-festival-of-lights-and-how-is-it-celebrated-9810212.html", "passage_text": "The actual day of Diwali is traditionally celebrated on the festival's third day, which this year falls on Thursday, October 23. The festival usually falls between the middle of October and the middle of November, although this is decided upon by the Hindu lunar calendar. One of the most significant festivals in Indian culture, Diwali, the festival of lights, sees millions attend firework displays, prayers and celebratory events across the world every autumn."}, {"url": "http://resources.woodlands-junior.kent.sch.uk/homework/religion/diwali.htm", "passage_text": "Diwali is a five-day celebration. Diwali is celebrated by Hindus in Britain and all over the world. Diwali is perhaps the most well-known of the Indian festivals. It is a five day celebration which occurs on the fifteenth day of the Hindu month of Kartika (during October/November in the Gregorian calendar). The fourth day of Diwali is the Hindu New Year. The festival of lights is held in honour of Lakshmi (pictured right), the Hindu goddess of wealth and prosperity."}, {"url": "http://www.answers.com/Q/How_is_Diwali_celebrated", "passage_text": "Diwali is mainly a Hindu festival. It is also celebrated by Sikhs, Jains, Buddhists for different reasons. There are several reasons to celebrate Diwali depending on the group … celebrating it. Diwali or Deepavali is a significant festival in Hinduism, Sikhism, and Jainism. All of these religions celebrate Diwali as the Festival of Lights."}, {"url": "https://en.wikipedia.org/wiki/Diwali", "passage_text": "Diwali (or Deepavali, the  festival of lights ) is an ancient Hindu festival celebrated in autumn (northern hemisphere) every year. Diwali is the biggest and the brightest festival in India. "}, {"url": "http://www.timeanddate.com/holidays/common/diwali", "passage_text": "Diwali, also known as Deepavali, Dipavali, Dewali, Deepawali or the Festival of Lights, marks the beginning of the Hindu New Year. It is celebrated on the 15th day of Kartika (October/November) in the Hindu calendar. Diwali celebrations can last for about five days. Lanterns for the Diwali celebrations. Lanterns for the Diwali celebrations."}]