[{"url": "http://www.collegefactual.com/colleges/henderson-state-university/paying-for-college/room-and-board/", "passage_text": "The cost of room, board, books, supplies and other expenses for on-campus students attending Henderson State University is $11,354, which is below the national average of $13,399. By their final year they will pay approximately $12,234 for an associate degree seeker, and $12,859 for a bachelor degree seeker to cover these expenses Over the entire degree (assuming you graduate on-time) the total will come to $49,569 for a four year stay or $24,168 for a two year stay."}, {"url": "http://www.collegecalc.org/colleges/arkansas/henderson-state-university/", "passage_text": "The net out-of-pocket total cost you end up paying or financing though student loans is known as the net price. The reported Henderson State University net price for in-state students $8,853* for the 2013/2014 academic year. This net price includes housing and meal expenses. Estimated future prices are based on the current in-state 4 year cost of $60,432.00. Use the college savings plan calculator below to perform a more comprehensive analysis on future costs and how much you will need to save for Henderson State University."}, {"url": "http://www.collegecalc.org/colleges/arkansas/henderson-state-university/", "passage_text": "95% of Henderson State University students received grant aid in 2013/2014. The average total aid amount was $9,155. 57 percent of students received aid in the form of Pell Grants from the U.S. Federal Government. The average Pell Grant awarded for 2013/2014 was $4,355. Estimated future prices are based on the current in-state 4 year cost of $60,432.00. Use the college savings plan calculator below to perform a more comprehensive analysis on future costs and how much you will need to save for Henderson State University."}, {"url": "http://www.collegefactual.com/colleges/henderson-state-university/paying-for-college/room-and-board/", "passage_text": "On-campus housing and dining at Henderson State University has changed an average of 4.9% for each of the past five years. If current growth trends in room, board and other expenses continue, we expect this year's incoming freshmen to pay $11,933 their first year of college. By their final year they will pay approximately $12,234 for an associate degree seeker, and $12,859 for a bachelor degree seeker to cover these expenses Over the entire degree (assuming you graduate on-time) the total will come to $49,569 for a four year stay or $24,168 for a two year stay."}, {"url": "http://www.hsu.edu/net-price-calculator/", "passage_text": "Welcome to Henderson State University's net price calculator. Begin by reading and agreeing to the statement below. Then follow the instructions on the subsequent screens to receive an estimate of how much students similar to you paid to attend Henderson State University in 2013-14. "}, {"url": "http://www.collegecalc.org/colleges/arkansas/henderson-state-university/", "passage_text": "Henderson State University tuition is $5,970 per year for in-state residents. This is 7% cheaper than the national average public four year tuition of $6,429. The cost is $6,381 and 52% cheaper than the average Arkansas tuition of $12,351 for 4 year colleges. Estimated future prices are based on the current in-state 4 year cost of $60,432.00. Use the college savings plan calculator below to perform a more comprehensive analysis on future costs and how much you will need to save for Henderson State University."}, {"url": "http://www.hsu.edu/FinancialAid/index.html", "passage_text": "Tuition. Henderson calculates tuition on a per hour rate. For the 2015-2016 academic year, 1  In-state tuition per hour is $207 for undergraduates. 2  Out-of-state tuition per hour is $427 for undergraduates. This number is used by the school to determine the maximum amount of financial aid (loans, grants, scholarships, fee-waivers, etc.) a student may receive for that award year. Please note: The cost of attendance does not represent the actual charges on a student's account."}, {"url": "http://www.collegefactual.com/colleges/henderson-state-university/paying-for-college/room-and-board/", "passage_text": "Henderson State University offers students combined housing and dining options. The on-campus cost for a typical student was $6,420 in 2013 - 2014. The following table outlines average expected costs at Henderson State University for both on-campus and off-campus housing, meals and other expenses. By their final year they will pay approximately $12,234 for an associate degree seeker, and $12,859 for a bachelor degree seeker to cover these expenses Over the entire degree (assuming you graduate on-time) the total will come to $49,569 for a four year stay or $24,168 for a two year stay."}, {"url": "http://www.onlineeducation.net/school/henderson-state-university", "passage_text": "School Costs. At Henderson State University, 98.0% percent of first-time undergrads receive financial aid, 87.0% receive grants and/or scholarships (an average of $10,780), and 52% receive loans ($6,903 on average). On-campus room and board costs about $5,398. Of the 3,096 undergraduate students at Henderson State University, 11.0% are part-time. A majority (85.0%) of the undergrad students are under 25 years of age. And 79.0% of the 471 graduate students"}]