[{"url": "http://www.sewfancy.com/batiste.htm", "passage_text": "Empress Batiste/Swiss Pima Cotton Batiste is a wonderful soft 100%cotton batiste with economy in mind. The soft hand and beautiful drape of this fabric is perfect for smocking and heirloom sewing. The fabric with its wonderful soft sheen and slight transparency will be perfect for that family heirloom. For those who want to combine easy care, good looks and economy, this 65/35 poly-cotton batiste is great. This is the best quality Imperial Batiste on the market. Yes, there are less expensive batiste blends, but you won't be sorry with this quality product. Your quality work deserves the best!"}, {"url": "https://en.wikipedia.org/wiki/Batiste", "passage_text": "History and description [edit]. Batiste is a balanced plain weave, a fine cloth made from cotton or linen such as cambric. Batiste was often used as a lining fabric for high-quality garments. Batiste is also used for handkerchiefs (cotton batiste) and lingerie (batiste de soie). In 1901 Chambers's Twentieth Century Dictionary of the English Language defined batiste as usual French name for cambric or applied in commerce to a fine texture of linen and cotton. Cambric is a synonym of the French word batiste, itself attested since 1590."}, {"url": "http://www.audioenglish.org/dictionary/batiste.htm", "passage_text": "• BATISTE (noun). The noun BATISTE has 1 sense: 1. a thin plain-weave cotton or linen fabric; used for shirts or dresses. Familiarity information: BATISTE used as a noun is very rare. "}, {"url": "http://www.ehow.com/about_5077197_batiste-fabric.html", "passage_text": "Batiste -- a very soft opaque fabric, plainly woven and lightweight -- most often has fibers of cotton, wool, linen, polyester or a synthetic blend. When batiste is manufactured, it gets no acid wash, so the material is not transparent like voiles or organdy, explains the NY Fashion Center. It has a bit of substance, and may be washed and delicately dried by machine. Delicate but Durable. Batiste is featherweight and it breathes, making it comfortable for baby and children's clothing; it smocks beautifully but is sturdy enough to hold up to a little wear and tear. The fabric has a soft sheen, yet it will hold embroidery and is a good choice for decorative samplers."}, {"url": "http://www.batistehair.com/", "passage_text": "Batiste refreshes your hair between washes, leaving it feeling gorgeously clean and fresh with added. body and texture. No water required! With a range of products to choose from, Batiste. makes every day a fabulous hair day. "}, {"url": "http://www.wisegeek.com/what-is-cotton-batiste.htm", "passage_text": "Cotton batiste is lightweight, sheer, and delicate fabric. The term batiste is a French word that refers to a fine quality cloth. This type of fabric is similar to cotton lawn, but it is thicker. Its appearance is often described as unassuming, yet elegant. Ad. Cotton batiste is easily found in white, black, and ivory at most craft and fabric stores, as well as from a number of online retailers. Specialty colors such as pastel pink, lemon yellow, baby blue, or seafoam green may be available in some locations."}, {"url": "http://www.sewfancy.com/batiste.htm", "passage_text": "Imperial Batiste is the poly-cotton fabric of choice for discriminating heirloom sewers. For those who want to combine easy care, good looks and economy, this 65/35 poly-cotton batiste is great. This is the best quality Imperial Batiste on the market. Yes, there are less expensive batiste blends, but you won't be sorry with this quality product. Your quality work deserves the best!"}, {"url": "http://www.merriam-webster.com/dictionary/batiste", "passage_text": "Definition of BATISTE. : a fine soft sheer fabric of plain weave made of various fibers. See batiste defined for kids. ADVERTISEMENT"}]