[{"url": "http://www.bankrate.com/calculators/mortgages/debt-consolidation-home-mortgage-calculator.aspx", "passage_text": "This mortgage debt consolidation calculator is designed to help determine whether using a mortgage to consolidate debt is right for you. Enter credit card balances, installment loans and the mortgages to consolidate by clicking on the Enter Data button for each category. "}, {"url": "http://www.investopedia.com/terms/m/mortgage.asp", "passage_text": "In a residential mortgage, a home buyer pledges his or her house to the bank. The bank has a claim on the house should the home buyer default on paying the mortgage. In the case of a foreclosure, the bank may evict the home's tenants and sell the house, using the income from the sale to clear the mortgage debt. Mortgages come in many forms. With a fixed-rate mortgage, the borrower pays the same interest rate for the life of the loan. Her monthly principal and interest payment never change from the first mortgage payment to the last. Most fixed-rate mortgages have a 15- or 30-year term"}, {"url": "http://www.investopedia.com/terms/m/mortgage.asp", "passage_text": "DEFINITION of 'Mortgage'. A debt instrument, secured by the collateral of specified real estate property, that the borrower is obliged to pay back with a predetermined set of payments. In the case of a foreclosure, the bank may evict the home's tenants and sell the house, using the income from the sale to clear the mortgage debt. Mortgages come in many forms. With a fixed-rate mortgage, the borrower pays the same interest rate for the life of the loan."}, {"url": "https://www.mortgageloan.com/debt-consolidation", "passage_text": "A home equity debt consolidation loan. One of the best, and most popular ways to consolidate your debt is through a home equity loan. You not only get one of the best interest rates available, but you can also stretch out your payments for 15-20 years or even longer, allowing you to minimize monthly payments."}, {"url": "http://www.bankrate.com/finance/mortgages/student-loan-debt-and-afford-mortgage.aspx", "passage_text": "Example: Jessie and Pat together earn $5,000 a month. Their total debt payments are $1,600 a month. Their debt-to-income ratio is 32 percent ($1,600 divided by $5,000). This ratio is one factor lenders use to decide whether a buyer can afford a mortgage payment. Generally, mortgage lenders prefer a debt-to-income ratio of 36 percent or less. In some situations, lenders will approve mortgages with higher debt-to-income ratios. Before you apply for a mortgage, make sure your credit is in good shape. Get your free credit score and report from myBankrate"}, {"url": "https://www.lendingtree.com/debt-consolidation-index", "passage_text": "Debt consolidation is the process of combining your debts into one loan with a lower interest rate. Instead of having multiple debt payments each month, you’ll only have one. This simplifies your bill-paying process each month plus reduces the total amount you owe to your creditors. "}, {"url": "http://www.daveramsey.com/blog/the-truth-about-debt/", "passage_text": "According to a USA Today article about debt, 78% of Baby Boomers have mortgage debt, 59% have credit card debt, and 56% have car payments. It takes a lot of will, discipline, courage and help to slay the debt monster. But it can be done. "}, {"url": "https://en.wikipedia.org/wiki/Mortgage_loan", "passage_text": "A mortgage loan, also referred to as a mortgage, is used by purchasers of real property to raise capital to buy real estate; or by existing property owners to raise funds for any purpose while putting a lien on the property being mortgaged. The loan is  secured  on the borrower's property. "}]