[{"url": "http://www.beatatest.com/resources/how-long-does-vicodin-stay-in-your-system/", "passage_text": "Potency. The same logic can be applied when considering the potency. Vicodin comes in varying strengths of milligrams. The more potent the Vicodin is, the longer it will stay in your system. Most Vicodin contains only 5 milligrams of hydrocodone, though some has up to 10 milligrams and is sold as “Vicodin HP”. Taking all of these factors into consideration, we can estimate how long vicodin will stay in your system. The common perception is that vicodin will only stay in your system for 24 to 48 hours, and this is true in some cases. "}, {"url": "http://www.everydayhealth.com/drugs/hydrocodone", "passage_text": "A: I have reviewed your question regarding hydrocodone and acetaminophen. Both these ingredients are metabolized by the liver with a half-life for hydrocodone of between 3.5 and 4 hours. Over a period of several days, it will be out of your system. A: Your question regards Hydrocodone and APAP (Vicodin, Lortab) http://www.everydayhealth.com/drugs/vicodin and what the APAP stands for. You also asked if the medication can cause a drop in blood pressure. The APAP is an abbreviation for acetaminophen, (the active ingredient in Tylenol)."}, {"url": "http://www.everydayhealth.com/drugs/hydrocodone", "passage_text": "Lorcet is a combination, narcotic pain reliever containing both hydrocodone and acetaminophen. The half-life of hydrocodone can range from 3.5 to 4.1 hours. The acetaminophen plasma half-life ranges from 1.25 to 3 hours, but may be increased in the presence of liver damage or overdosage. A: Your question regards Hydrocodone and APAP (Vicodin, Lortab) http://www.everydayhealth.com/drugs/vicodin and what the APAP stands for. You also asked if the medication can cause a drop in blood pressure. The APAP is an abbreviation for acetaminophen, (the active ingredient in Tylenol)."}, {"url": "http://answers.webmd.com/answers/1198209/how-long-does-vicodin-stay-in", "passage_text": "A. Vicodin includes a combination of acetaminophen and the opioid hydrocodone. There are several different dosages of Vicodin, with the acetaminophen dose varying from 500 to 750 milligrams (mg), and hydrocodone from 5 to 10 mg. Hydrocodone has a half-life of 3 to 4 hours; that’s how long it takes the body to eliminate half of the drug from the bloodstream. It takes several half-lives to eliminate all the"}, {"url": "http://prescription-drug.addictionblog.org/vicodin-half-life-how-long-does-vicodin-remain-in-your-body/", "passage_text": "On average, most doctors agree that the half life of Vicodin is 4 hours. Vicodin (a combination of hydrocodone and paracetamol) is a short acting opioid analgesic, which means that you can feel the effects of Vicodin quickly (within 30 minutes to 1 hour of taking it) but do not last very long. Valium can stay in the body for weeks after last dose. Oxycodone can stay in the body (and be detected in a urinalysis) for a few days after last dose. Check out our articles on this here: http://addictionblog.org/the-news/valium-half-life-how-long-does-valium-stay-in-your-system/."}, {"url": "http://prescription-drug.addictionblog.org/vicodin-half-life-how-long-does-vicodin-remain-in-your-body/", "passage_text": "The active ingredients in Vicodin are paracetamol (acetaminophen) and hydrocodone. Vicodin is mainly administered as a tablet in doses of 5 mg hydrocodone / 500 mg acetaminophen ratios or as a liquid syrup containing 2.5 mg hydrocodone and 167 mg acetaminophen per 5 ml. Doctors usually prescribe and supervise doses of 5 – 10 mg hydrocodone every 4-6 hours. Valium can stay in the body for weeks after last dose. Oxycodone can stay in the body (and be detected in a urinalysis) for a few days after last dose. Check out our articles on this here: http://addictionblog.org/the-news/valium-half-life-how-long-does-valium-stay-in-your-system/."}, {"url": "http://answers.webmd.com/answers/1198209/how-long-does-vicodin-stay-in", "passage_text": "Hydrocodone begins to work within 10 to 20 minutes of swallowing the pill. Its pain-relieving effects last 4 to 8 hours. Hydrocodone has a half-life of 3 to 4 hours; that’s how long it takes the body to eliminate half of the drug from the bloodstream. It takes several half-lives to eliminate all the hydrocodone. A small fraction may still be present in the blood a day or so after taking one pill"}, {"url": "http://prescription-drug.addictionblog.org/vicodin-half-life-how-long-does-vicodin-remain-in-your-body/", "passage_text": "Drug testing for Vicodin. Vicodin can be detected in the urine 2-4 days after you take it. If you are planning to take a drug test for Vicodin, you would be advised to be more conservative and wait the full 4 days before drug testing. Valium can stay in the body for weeks after last dose. Oxycodone can stay in the body (and be detected in a urinalysis) for a few days after last dose. Check out our articles on this here: http://addictionblog.org/the-news/valium-half-life-how-long-does-valium-stay-in-your-system/."}, {"url": "https://www.healthtap.com/topics/how-long-will-hydrocodone-stay-in-your-system", "passage_text": "I take hydrocodone 7.5 i take hydrocodone 7.5 4 a day four 3 days how long will it stay in my system. 6. Get help from a doctor now ›. Less than a Day: The half-life of hydrocodone is about 5 hours. This means that the drug should be out of you system (by effect) within 15 hours. The drug will still be detectable within your urine for 48 hours or longer. ...Read more. Hydrocodone: This depends on how much you take at one time. Usually the parent drug should be fully metabolized in about 4-6 hours ...Read more. Dr. Richard Pollard Board Certified, Anesthesiology 24 years in practice 3M people helped."}]