[{"url": "http://www.uofmhealth.org/health-library/hw255772", "passage_text": "Fetal Blood Flow. A fetus (baby) is fed, or nourished, by the mother through the placenta, which is attached to the umbilical cord. In the placenta, the mother's blood and the fetal blood both flow through vessels that are very close together. But the mother's blood does not mix with the fetal blood. When the mother's blood is close to the fetal blood, oxygen and nutrients move from the mother's blood into the fetal blood. As the blood flows through the fetus, it picks up waste products and returns to the mother through the umbilical cord. "}, {"url": "http://www.healthline.com/health/placental-insufficiency", "passage_text": "The umbilical cord grows from the placenta to the baby’s navel. It allows blood to flow from mother to baby, and back again. The mother’s blood and the baby’s blood are filtered through the placenta, but they never actually mix. The placenta’s primary jobs are to: 1  move oxygen into the baby’s bloodstream. "}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=90&ContentID=P02362", "passage_text": "The fetus is connected by the umbilical cord to the placenta, the organ that develops and implants in the mother's uterus during pregnancy. Through the blood vessels in the umbilical cord, the fetus receives all the necessary nutrition, oxygen, and life support from the mother through the placenta. Waste products and carbon dioxide from the fetus are sent back through the umbilical cord and placenta to the mother's circulation to be eliminated. It moves blood from the right atrium of the heart to the left atrium. The ductus arteriosus moves blood from the pulmonary artery to the aorta. Oxygen and nutrients from the mother's blood are transferred across the placenta to the fetus. The enriched blood flows through the umbilical cord to the liver and splits into three branches. The blood then reaches the inferior vena cava, a major vein connected to the heart"}, {"url": "http://www.answers.com/Q/Can_the_mother's_blood_mix_with_the_fetus's_blood", "passage_text": "The placenta is the container that keeps the baby isolated from the mother. The fetal blood flows through the baby, out the umbilical cord to the placenta and no further. The placental membrane separates maternal blood from fetal blood. Oxygen and nutrients in the maternal blood in the intervillous spaces diffuse through the walls of the villi and enter the fetal capillaries. "}, {"url": "http://www.ehow.com/list_6767063_transfers-between-mother-fetus_.html", "passage_text": "The mother and fetus do not share a blood supply directly. Blood is diverted from the mother's arterial system to the placenta. This is an organ that is attached to the lining of the womb while the mother is pregnant. The fetus is linked to the placenta by the umbilical cord, attached to its thorax. "}, {"url": "http://www.texasheart.org/hic/topics/cond/fetal_ht.cfm", "passage_text": "A special cord called the umbilical cord links the placenta to the fetus. The mother's blood flows through a thin layer of cells in the wall of the uterus, giving the fetus food and oxygen while removing any wastes like carbon dioxide. The baby growing inside of the mother's uterus (the womb) is called a fetus. The growing fetus is fully dependent on a special organ called the placenta for nourishment. One side of the placenta is attached to the uterus, and the other side is attached to a liquid-filled sac that holds the fetus."}, {"url": "https://answers.yahoo.com/question/index?qid=20070919194942AAe4qNJ", "passage_text": "Report Abuse. A fetus produces it's own blood. It's blood vessels lie close to the mothers, intertwines with the mother's in the umbilical cord and nutrients from the mother's bloodstream cross over to nourish the fetus, but their blood does not actually intermingle. This is a very odd question, though. "}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=90&ContentID=P02362", "passage_text": "Waste products from the fetal blood are transferred back across the placenta to the mother's blood. Inside the fetal heart: Blood enters the right atrium, the chamber on the upper right side of the heart. When the blood enters the right atrium, most of it flows through the foramen ovale into the left atrium. It moves blood from the right atrium of the heart to the left atrium. The ductus arteriosus moves blood from the pulmonary artery to the aorta. Oxygen and nutrients from the mother's blood are transferred across the placenta to the fetus. The enriched blood flows through the umbilical cord to the liver and splits into three branches. The blood then reaches the inferior vena cava, a major vein connected to the heart"}]