[{"url": "http://www.countrycallingcodes.com/mobile/mobile-codes.php?callfrom=United+States&callto=Mauritius", "passage_text": "Tips for calling a cell phone in Mauritius: To call a Mauritian cell phone from a land line, simply follow the mobile country code dialing instructions above to place your call. 1  To call a Mauritian cell phone from a land line, simply follow the mobile country code dialing instructions above to place your call. 011 - United States exit code to dial first when calling international. 230 - Mauritius country code must be dialed next. Mobile Code** - Mauritius mobile code must be dialed next. 011 + 230 + Mobile Code** + Local Number-Overall dialing format."}, {"url": "http://www.countrycallingcodes.com/mobile/mobile-codes.php?callfrom=United+States&callto=Mauritius", "passage_text": "To call a Mauritian cell phone from your cell phone, you may need to first use the + (plus) sign prior to entering the Mauritius mobile code and telephone number. 1  To call a Mauritian cell phone from a land line, simply follow the mobile country code dialing instructions above to place your call. 011 - United States exit code to dial first when calling international. 230 - Mauritius country code must be dialed next. Mobile Code** - Mauritius mobile code must be dialed next. 011 + 230 + Mobile Code** + Local Number-Overall dialing format."}, {"url": "https://countrycode.org/mauritius", "passage_text": "CountryCode.org is your complete guide to make a call from anywhere in the world, to anywhere in the world. This page details Mauritius phone code. The Mauritius country code 230 will allow you to call Mauritius from another country. Mauritius telephone code 230 is dialed after the IDD. Mauritius international dialing 230 is followed by an area code. The Mauritius area code table below shows the various city codes for Mauritius. Mauritius country codes are followed by these area codes. With the complete Mauritius dialing code, you can make your international call. "}, {"url": "http://www.countrycallingcodes.com/country.php?country=Mauritius", "passage_text": "The Mauritius country code is 230. Get the mobile country codes for Mauritius. Mauritius Information: Mauritius Emergency Numbers. Local Telephone Prefix: More ways to call Mauritius: Mauritius on Wikipedia The currency of Mauritius is the Mauritian Rupee. The nationality of Mauritius is Mauritians. To search for another Country Calling Code, select the First Letter of the Country You Are Calling [A] [B] [C] [D] [E] [F] [G] [H] [I] [J] [K] [L] [M] [N] [O] [P] [Q] [R] [S] [T] [U] [V] [W] [X] [Y] [Z]."}, {"url": "http://www.countrycallingcodes.com/country.php?country=Mauritius", "passage_text": "Mauritius Information. The local time in Mauritius is 22:13:08 PM (10:13:08 PM) Get the mobile country codes for Mauritius. Mauritius Information: Mauritius on Wikipedia The currency of Mauritius is the Mauritian Rupee. To search for another Country Calling Code, select the First Letter of the Country You Are Calling [A] [B] [C] [D] [E] [F] [G] [H] [I] [J] [K] [L] [M] [N] [O] [P] [Q] [R] [S] [T] [U] [V] [W] [X] [Y] [Z]."}, {"url": "http://www.prokerala.com/how-to/call/mauritius/area-codes/", "passage_text": "Given below is the complete list of area codes in Mauritius. The table below shows all the 173 area codes in Mauritius. Mauritius area codes usually have 3 digits. While calling Mauritius from abroad, you need to dial the ISD code followed by the area code and finally the phone number. Given below is a list of area codes for calling Mauritius's major cities/regions. Click here to know How to call Mauritius from abroad. * The number withing bracket is the trunk prefix and this number is to be ignored while calling Mauritius from another country."}, {"url": "http://www.countrycallingcodes.com/country.php?country=Mauritius", "passage_text": "We hope that our Country Calling Codes quick reference international phonebook has helped you to find the Mauritius country code and make your international call. Don't forget to share our Mauritius phone book with your friends and bookmark it to help with all of your future international calls! To search for another Country Calling Code, select the First Letter of the Country You Are Calling [A] [B] [C] [D] [E] [F] [G] [H] [I] [J] [K] [L] [M] [N] [O] [P] [Q] [R] [S] [T] [U] [V] [W] [X] [Y] [Z]."}, {"url": "http://www.howtocallabroad.com/mauritius/", "passage_text": "Calling Mauritius from the United States explained: 1  011 - US exit code; dial first for international calls made from the USA or Canada. "}, {"url": "http://www.countrycallingcodes.com/mobile/mobile-codes.php?callfrom=United+States&callto=Mauritius", "passage_text": "1 To call a Mauritian cell phone from your cell phone, you may need to first use the + (plus) sign prior to entering the Mauritius mobile code and telephone number. 2  If you are calling Mauritius from your cell phone, you may incur additional charges or fees from your mobile carrier. 011 - United States exit code to dial first when calling international. 230 - Mauritius country code must be dialed next. Mobile Code** - Mauritius mobile code must be dialed next. 011 + 230 + Mobile Code** + Local Number-Overall dialing format."}, {"url": "http://www.countrycodes.com/areacodes/call_mauritius.htm", "passage_text": "To call Mauritius you have to dial 011 + 230 + City Area Code + Number you wish to call. "}]