[{"url": "http://health.costhelper.com/cholesterol-test.html", "passage_text": "1 Walk-in clinics provide cholesterol testing for $50-$100 per visit. 2  The cost usually includes the cost of lab testing and the cost of an office visit. 3  For example, Minute Clinic, the medical clinic located inside many CVS Pharmacy locations, offers cholesterol testing for $59 plus a $30 lab fee."}, {"url": "http://health.costhelper.com/cholesterol-test.html", "passage_text": "1 The cost usually includes the cost of lab testing and the cost of an office visit. 2  For example, Minute Clinic, the medical clinic located inside many CVS Pharmacy locations, offers cholesterol testing for $59 plus a $30 lab fee."}, {"url": "http://www.howmuchisit.org/cholesterol-test-cost/", "passage_text": "1 The cost of cholesterol test depends on where the test will be performed. 2  The location of the clinic will be considered as a factor for the price difference of the test. 3  Another factor that can affect the price of cholesterol test is the type of test that will be taken."}, {"url": "http://www.vox.com/2014/8/15/6005953/a-10169-blood-test-is-everything-wrong-with-american-health-care", "passage_text": "The charge for a lipid panel ranged from $10 to $10,169. Hospital prices for a basic metabolic panel (which doctors use to measure the body's metabolism) were $35 at one facility — and $7,303 at another."}, {"url": "http://health.costhelper.com/cholesterol-test.html", "passage_text": "1 The test typically costs $5-$25. 2  For example, Bartell Drugs, a pharmacy with locations across Western Washington, offers a total cholesterol test for $5 and a complete lipid panel for $15. 3  Publix, with locations in South Carolina, Tennessee and Florida, offers cholesterol testing for $15-$20."}, {"url": "http://health.costhelper.com/cholesterol-test.html", "passage_text": "1 If an insured patient receives a cholesterol test as part of a physical, there is typically a charge for an office visit copay. 2  Walk-in clinics provide cholesterol testing for $50-$100 per visit. 3  The cost usually includes the cost of lab testing and the cost of an office visit."}, {"url": "http://health.costhelper.com/blood-test.html", "passage_text": "1 CostHelper readers with insurance report out-of-pocket costs of $283 -$675 for blood tests, with an average of $432; total billed costs were $312 -$1,200 (averaging $755), with the insurance either paying or discounting the total cost by $29 -$525."}, {"url": "http://health.costhelper.com/cholesterol-test.html", "passage_text": "1 There are two basic types of home cholesterol tests -- the kind done completely in the privacy of one's home and the kind that requires shipment to a laboratory to complete. 2  At-home tests cost $15-$25; kits requiring shipment cost $25-$50."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=lipid_panel_hdl_ratio", "passage_text": "If your total cholesterol is high, you have twice the risk for heart disease as a person with normal total cholesterol. Here is the adult range for HDL cholesterol: Normal: 35 to 65 mg/dL for men, 35 to 80 mg/dL for women. If your number is less than 25 mg/dL, your risk for coronary heart disease is doubled."}, {"url": "http://health.costhelper.com/blood-test.html", "passage_text": "1 For patients not covered by health insurance, total costs can be $100 -$3,000 or more, depending on the number and type of tests ordered; the cost of any doctor visits to order and interpret the tests; and whether the tests are done on an emergency basis."}]