[{"url": "http://www.officialtheatre.com/barbican-theatre/map/", "passage_text": "The Barbican Theatre is within the greater Barbican Centre complex on Silk Street, away from the main hub of theatre in London’s West End. The Barbican Centre is not just home to the Barbican Theatre, it also hosts art galleries, cinemas, concert halls and dance spaces."}, {"url": "http://www.facebook.com/barbicantheatreplymouth", "passage_text": "Barbican Theatre. October 2 at 4:11am ·. It's been a great week with both our young dance and theatre companies auditions, there are some really talented young people in the city. Followed by a brilliant open evening for our Force program last night too!"}, {"url": "https://www.barbicantheatre.co.uk/", "passage_text": "At the Barbican Theatre, we use theatre and dance to fire people up and get them excited about making, creating and exploring new moves and disciplines."}, {"url": "http://www.officialtheatre.com/barbican-theatre/", "passage_text": "The Barbican Theatre is a part of the vast Barbican Centre, opened by the Queen in March 1982. The centre was funded by The City of London Corporation as a cultural gift to the nation."}, {"url": "http://www.visitlondon.com/things-to-do/place/281325-barbican-centre", "passage_text": "The Barbican in London is Europe's largest arts centre all under one roof. The Barbican is also a base for the London Symphony Orchestra. The Barbican comprises a concert hall, two theatres, three cinemas, two art galleries, library, two trade exhibition halls, five conference rooms, foyers, shops and conservatory."}, {"url": "http://www.yorkbarbican.co.uk/", "passage_text": "The York Barbican. The York Barbican is managed by SMG (UK) Ltd. SMG is one of the world’s largest international venue operators. York Barbican is owned by City of York Council and re-opened in Spring 2011 after a major £2m investment."}, {"url": "http://hamlet-barbican.com/", "passage_text": "The £10 ticket ballot has now closed. Successful entrants will be notified on 19 June and booking will be open for one week only from 10am 22 June. Returned and late-release tickets may occasionally become available at the last minute on the day of the performance."}]