[{"url": "http://www.dnr.state.mn.us/education/geology/digging/fossils.html", "passage_text": "Fossils are the remains of plants and animals found in rock. A fossil can be many things: a bone from a dinosaur, the tooth of a shark, a sea shell or a footprint. Fossils provide clues to what life was like in Minnesota in ancient times. They can tell us many things about the past."}, {"url": "http://scienceviews.com/dinosaurs/fossilformation.html", "passage_text": "Almost all living organisms can leave fossils, but usually only the hard parts of plants and animals fossilize. Soft internal organs, muscle, and skin rapidly decay and are rarely preserved, but the bones and shells of animals are good candidates for fossilization. In this case, the fossil is a hole in the shape of the animal. By far the most common fossil remains are those of shelled invertebrate sea loving creatures such as snails, corrals, and clams. These make up most of the fossil record."}, {"url": "http://mygeologypage.ucdavis.edu/cowen/~GEL107/preservation.html", "passage_text": "Then there are trace fossils: where none of the original animal is preserved, but there can still be an enormous amount of information in the fossil. Footprints, for example, may be difficult to link to the animal that made them. "}, {"url": "http://scienceviews.com/dinosaurs/fossilformation.html", "passage_text": "Volcanic eruptions can form fossils when animals get trapped in the hot ash flows. In this case, the fossil is a hole in the shape of the animal. By far the most common fossil remains are those of shelled invertebrate sea loving creatures such as snails, corrals, and clams. These make up most of the fossil record."}, {"url": "http://study.com/academy/lesson/fossil-definition-types-characteristics-examples.html", "passage_text": "Characteristics and Examples of Fossil Formation. The way in which organisms are preserved gives fossils different characteristics. Let's explore a few ways fossils can form. Permineralization is when an organism dies and sediment enters the body, filling in the pores of a leaf, or a bone or a shell. The remains of a Hadrosaur are an examples of a body fossil, or fossils of the actual organism. Typically, hard structures like bones, shells and teeth fossilize more often than soft-bodied structures like tissues or plant leaves, but as is seen with the horsetail relative, plants can become fossils."}, {"url": "http://teacherweb.com/NC/EastMillbrookMiddleSchool/MrsConder/Fossils-reading-and-worksheet-ph.doc", "passage_text": "These fossils are called. preserved fossils. , or. originals remains. . Organisms can be preserved in tar, amber, or ice. When certain fossils are used to help determine the age of rocks or other fossils, it is called an. index fossil. . . Other fossils form when the. original remains. of organisms are. preserved. in substances such as tar, amber, or ice. The most common fossils are. molds and casts. , which are copies of the shapes of ancient organisms, and contain details as to what they looked like."}, {"url": "http://study.com/academy/lesson/fossil-definition-types-characteristics-examples.html", "passage_text": "1 There are two main types of fossils: body fossils (an actual organism) and trace fossils (evidence of an organism). 2  Mold and cast fossils are when an organism leaves an imprint. 3  Permineralization is when sediment enters the pores of the organism, replacing tissue and creating a replica organism. The remains of a Hadrosaur are an examples of a body fossil, or fossils of the actual organism. Typically, hard structures like bones, shells and teeth fossilize more often than soft-bodied structures like tissues or plant leaves, but as is seen with the horsetail relative, plants can become fossils."}, {"url": "http://www.ucmp.berkeley.edu/IB181/VPL/Pres/Pres2.html", "passage_text": "Three conditions are required for the preservation of plant fossils: Removing the material from oxygen-rich environment of aerobic decay; Fixing the organic material to retard anaerobic decay; Introducing the fossil to the sedimentary rock record (a.k.a., burial). Plant material can then be incorporated into the rock record in areas where sediment is being deposited, which usually, but not always, requires the presence of water. Consequently, streams, flood plains, lakes, swamps, and the ocean are good candidates for fossil-forming systems."}]