[{"url": "http://pages.ebay.com/help/pay/track-paypal.html", "passage_text": "When a buyer sends you a payment through PayPal, the money is usually available in your PayPal account right away. However, in some cases, the payment might be pending for a few days, or it might be held by PayPal for up to 21 days. "}, {"url": "http://www.wikihow.com/Send-Money-via-PayPal", "passage_text": "PayPal, a banking company, allows users to send money to another user from their PayPal account balance, a bank account, or a debit or credit card. Both parties must have a PayPal account to complete the transfer of funds. Tips. 1  You can also choose to add funds to your PayPal account before you send money so the payment can come out of your PayPal balance. 2  Click on the Add Funds tab on your account page to move money from a linked account to your PayPal account."}, {"url": "http://www.wikihow.com/Use-PayPal-to-Transfer-Money", "passage_text": "1 When you use PayPal to transfer money, you can expect the funds to appear in your bank or credit account in approximately 4 days. Sign in to PayPal using your email or mobile phone number and a password. If you are new to the website, create an account. 1  To sign up, pick your language settings and country of origin. 2  Choose whether you want a personal account, a merchant account or a premier account."}, {"url": "http://www.wikihow.com/Send-Money-via-PayPal", "passage_text": "1. Log in to your PayPal account and click on the Send Payment tab. Ad. 2. Type in the email address or the mobile phone number of the person you want to send money to. 1  Confirm that you have the email address or phone number correct before sending money so you don't accidentally send it to the wrong person. Tips. 1  You can also choose to add funds to your PayPal account before you send money so the payment can come out of your PayPal balance. 2  Click on the Add Funds tab on your account page to move money from a linked account to your PayPal account."}, {"url": "http://money.howstuffworks.com/paypal5.htm", "passage_text": "Using PayPal: Sending Funds. Though PayPal rose to stardom via eBay, one of the keys to PayPal's success has been its ability to expand beyond that market. You can use it to send money to a friend, donate to charity and buy items online. In order to send money using your PayPal account, you'll need one of two things: For an organization or business, you can usually send money from a PayPal link at its Web site. From the sender's perspective, PayPal is a free service. In fact, if you send money directly from a checking or savings account, there are never any fees involved."}, {"url": "http://archive.oreilly.com/pub/h/2144", "passage_text": "Sending a Payment via Email To send money to someone (whether they have a PayPal account or not): Log into your PayPal account. Click the Send Money tab, and then click the Pay Anyone subtab. Enter the recipient's email address. Enter the amount to send and select the currency you wish to use. For Type, select Goods or Service if you are paying someone back for a good or service they provided you."}, {"url": "http://archive.oreilly.com/pub/h/2144", "passage_text": "Sending a Payment via Email. To send money to someone (whether they have a PayPal account or not): Log into your PayPal account. Click the Send Money tab, and then click the Pay Anyone subtab. Enter the recipient's email address. Enter the amount to send and select the currency you wish to use. For Type, select Goods or Service if you are paying someone back for a good or service they provided you."}, {"url": "https://www.paypal.com/webapps/mpp/send-money-online", "passage_text": "Money well sent. You can send money to anyone with just their email address or mobile phone number, and the money will go to their PayPal account. If they don't have a PayPal account, they can create one instantly for free. So go ahead and move your checkbook from the desk drawer to the junk drawer. Email Address. "}, {"url": "https://www.usaa.com/inet/pages/mobile_banking_send_money_faqs", "passage_text": "PayPal may charge the recipient, depending on the type of payment you send and the type of PayPal account the recipient has. PayPal does not charge for sending money to friends and family. "}, {"url": "http://www.wikihow.com/Send-Money-via-PayPal", "passage_text": "1 You can also choose to add funds to your PayPal account before you send money so the payment can come out of your PayPal balance. 2  Click on the Add Funds tab on your account page to move money from a linked account to your PayPal account. Tips. 1 "}]