[{"url": "http://lightyears.blogs.cnn.com/2012/04/04/why-panda-sex-is-so-complex/", "passage_text": "Pandas are an endangered species. There are less than 1,600 in the wild, and climate change threatens their natural habitat. That's why conservationists are so keen on the production of baby pandas-not just for more cuteness in the world, but to help the survival of the species. It's the same for pandas, except there's more at stake. Hopes were high among conservationists that female panda Tian Tian (Sweetie) and male panda Yang Guang (Sunshine) would mate during breeding season at the Edinburgh Zoo in Scotland."}, {"url": "http://blogs.bootsnall.com/arnika/why-pandas-are-the-worlds-most-useless-animals.html", "passage_text": "Pandas are stupid! Everything the writer typed is true because pandas actually live the way he described!. ROBOkid and Hannah, If god has a use for pandas it’s to let them die off because of there uslessness. 1 A panda eats for 9 hours a day, then just sleeps, often getting too overweight. 2  It is unlikely that a panda will find a mate that it likes making breeding not very common. 3  They can’t protect themselves, only using their black and white fun as a deterrence."}, {"url": "http://blogs.bootsnall.com/arnika/why-pandas-are-the-worlds-most-useless-animals.html", "passage_text": "Why panda’s are the worlds most useless animals. Chengdu is very famous for panda’s, basically the only remaining wild ones live close by and there is a big panda breeding center in the city. The government has thrown a lot of money into panda breeding the last few years and China and Chengdu are regarded as the place to go and see panda’s. So of course our first day in Chengdu, Me, Alice and Ross joined up on a trip with our hostel and headed out to see what all the fuss was about. 1 A panda eats for 9 hours a day, then just sleeps, often getting too overweight. 2  It is unlikely that a panda will find a mate that it likes making breeding not very common. 3  They can’t protect themselves, only using their black and white fun as a deterrence."}, {"url": "http://www.popsci.com/science/article/2013-08/how-argue-someone-who-smirkily-says-pandas-deserve-die", "passage_text": "It's sort of true, in that yes, the panda's diet is unusual for a bear, and yes, Canadians live in a curious place for a human, but the fact that pandas have survived on a bamboo diet for millions of years and the fact that Canadians are still living up there in the Arctic is the end of that argument. The panda is the same way. Sure, bears are typically omnivores or carnivores, and the panda is a 99 percent bamboo-eater, but that doesn't make it a less worthy animal, because that kind of judgment is ridiculous."}, {"url": "https://en.wikipedia.org/wiki/Giant_panda", "passage_text": "The name giant panda is sometimes used to distinguish it from the unrelated red panda. Though it belongs to the order Carnivora, the giant panda's diet is over 99% bamboo. Giant pandas in the wild will occasionally eat other grasses, wild tubers, or even meat in the form of birds, rodents or carrion. The giant panda is a highly specialized animal with unique adaptations, and has lived in bamboo forests for millions of years. The average giant panda eats as much as 9 to 14 kg (20 to 30 lb) of bamboo shoots a day to compensate for its low level of energy digestibility."}, {"url": "http://newsthump.com/2009/04/07/zoologists-finally-bored-of-saving-frankly-useless-pandas/", "passage_text": "Zoologists finally bored of saving ‘frankly useless’ Pandas. Zoologists today finally gave up trying to save the planet’s few remaining Giant Pandas, declaring the endeavour, “utterly pointless”. The Giant Panda (Ailuropoda melanoleuca) is native to Central and Southwestern China and has for many years been the most visible of the planet’s endangered species. "}, {"url": "http://www.independent.co.uk/voices/commentators/david-thomas-the-worlds-most-useless-creatures-6272377.html", "passage_text": "All through the brutally repressive years of the Cultural Revolution, Mao was lobbing pandas at Western zoos. Edward Heath, for example, brought Chia-Chia and Ching-Ching back to London following a trip to China in 1974, much as Neville Chamberlain brought a piece of paper back from Munich in 1938. "}, {"url": "http://www.mightyheaton.com/2011/10/31/pandas-are-dumb/", "passage_text": "Pandas are lazy. Pandas imbibe so little energy from eating bamboo that it affects their behavior, to the point that they socialize comparatively little and literally avoid walking up or down hills. They mostly just sit around, listlessly, thinking about bamboo. 3. Pandas are constantly pooping. Pandas consume up to thirty pounds of bamboo shoots and leaves a day, with the logical result that they also poop on average forty times a day. Maybe instead of crapping themselves blind they should do something productive like grow bigger fangs, or set up mutual funds."}, {"url": "http://www.popsci.com/science/article/2013-08/how-argue-someone-who-smirkily-says-pandas-deserve-die", "passage_text": "Pandas are dying because we're killing them and killing their habitat, not because of some internal flaw. To argue that they're dying because evolution has just decided it's the panda's time to go away is absurd; this is our fault and nobody else's. The panda is the same way. Sure, bears are typically omnivores or carnivores, and the panda is a 99 percent bamboo-eater, but that doesn't make it a less worthy animal, because that kind of judgment is ridiculous."}, {"url": "http://www.popsci.com/science/article/2013-08/how-argue-someone-who-smirkily-says-pandas-deserve-die", "passage_text": "Breeding pandas is prolonging the existence of a hopeless and wasteful species the world should've given up on long ago, writes Timothy Lavin in Bloomberg. After the death of a panda named Hsing-Hsing, in 2009, David Plotz of Slate wrote: Pandas are not ill-natured. They are worse: They are no-natured. The panda is the same way. Sure, bears are typically omnivores or carnivores, and the panda is a 99 percent bamboo-eater, but that doesn't make it a less worthy animal, because that kind of judgment is ridiculous."}]