[{"url": "http://www.cnn.com/2014/03/06/health/who-sugar-guidelines/index.html", "passage_text": "Real or fake sugar: Does it matter? To find the amount of calories from sugar in a product, multiply the grams by 4. For example, a product containing 15 grams of sugar has 60 calories from sugar per serving, according to the American Heart Association. If you eat 2,000 calories a day, that's 3%. "}, {"url": "http://www.livestrong.com/article/474832-recommended-grams-of-sugar-per-day/", "passage_text": "This means that there is no minimum amount you need to take in each day, but there is a maximum. These recommendations are based on gender. Women should limit sugar intake to no more than 6 teaspoons per day, which provides about 100 calories. Men should limit sugar intake to no more than 9 teaspoons, or about 150 calories. In contrast, the average adult consumes 22 teaspoons per day. This is equal to about 3,550 pounds of sugar in a lifetime. The consumption of added sugar accounts for an intake of 500 calories per day, which can cause a weight gain of 1 pound per week."}, {"url": "http://www.md-health.com/How-Many-Grams-Of-Sugar-Per-Day.html", "passage_text": "For an average 2000-calorie diet, the World Health Organization recommends that a maximum of 10% of the total calories come from added sugar. This equates to less than 50 grams of added sugar per day. 1 The amount of sugar eaten daily can vary based on activity level and overall health. 2  Be sure your physician is aware of any specific dietary modifications. 3  Women may reduce the daily sugar intake to 17 g per day and men can aim for 25 g per day."}, {"url": "https://www.sharecare.com/health/carbohydrates/sugar-consume-every-year", "passage_text": "In the last 20 years, the amount of sugar each person consumes yearly in the United States has soared from 26 pounds per person to more than 135 pounds per person. The average teenage male now consumes more than 34 teaspoons of sugar per day. Most of that sugar comes from man-made or refined sugars, which are from cane sugar, beet sugar, corn syrup and corn sugar, especially in the consumption of soft drinks. American's sweet tooth may not be so sweet for their waist. Americans, on average, are consuming 22 teaspoons of added sugar daily, the equivalent of 350 calories. That's over 8,000 teaspoons annually! This amount is double the amount recommended daily by the American Heart Association."}, {"url": "http://www.nbcnews.com/id/32543288/ns/health-diet_and_nutrition/t/cut-back-way-back-sugar-says-heart-group/", "passage_text": "By comparison, most women should be getting no more than 6 teaspoons a day, or 100 calories, of added sugar — the sweeteners and syrups that are added to foods during processing, preparation or at the table. For most men, the recommended limit is 9 teaspoons, or 150 calories, the heart group says. "}, {"url": "http://answers.webmd.com/answers/5008459/how-many-grams-of-sugar-per-day", "passage_text": "Recommendations vary based on organization. For example, the World Health Organization recommends keeping added sugar intake to 10% of total calories. For the average 2000 calorie-diet that's a maximum of 50 grams. The American Heart Association recommends 6 teaspoons of sugar for women and 9 for men (1 teaspoon of sugar has about 4g of sugar). The primary source of added sugars are soft drinks and other sugar-sweetened beverages"}, {"url": "http://healthyeating.sfgate.com/healthy-sugar-intake-per-day-6128.html", "passage_text": "Recognizing Sugar on the Label. Most Americans get far more than the recommended amount of sugar. Dietary Guidelines for Americans reported the average American eats more than 22 teaspoons of sugar daily -- 16 percent of the average daily calorie intake. "}, {"url": "http://www.livestrong.com/article/474832-recommended-grams-of-sugar-per-day/", "passage_text": "The average American consumes 3 pounds of sugar a week and 130 pounds a year, reports Forbes.com. This is equal to about 3,550 pounds of sugar in a lifetime. The consumption of added sugar accounts for an intake of 500 calories per day, which can cause a weight gain of 1 pound per week."}, {"url": "http://healthyeating.sfgate.com/maximum-amount-sugar-day-children-8982.html", "passage_text": "These numbers exceed the recommended sugar limits for children by a significant amount. The actual limit of sugar for children is 3 to 4 teaspoons during the preschool and early elementary years, and between 5 and 8 teaspoons during the tween and teen years. Daily Recommendations. The average 1- to 3-year-old consumes about 12 teaspoons of sugar each day, and the average 4- to 8-year-old takes in 21 teaspoons, according to the American Heart Association."}]