[{"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1048-INULIN.aspx?activeIngredientId=1048&activeIngredientName=INULIN", "passage_text": "INULIN Overview Information. Inulin is a starchy substance found in a wide variety of fruits, vegetables, and herbs, including wheat, onions, bananas, leeks, artichokes, and asparagus. The inulin that is used for medicine is most commonly obtained by soaking chicory roots in hot water."}, {"url": "http://www.prebiotic.ca/inulin.html", "passage_text": "Inulin has a number of health benefits. As a result this dietary fibre is used as a prebiotic agent in functional foods to stimulate the growth of beneficial intestinal bacteria. It is soluble in hot water, allowing the inulin to be easily incorporated into drinks, dairy products, and baked goods."}, {"url": "http://www.prebiotic.ca/inulin.html", "passage_text": "Inulin is naturally present in many different foods. Some every day foods, such as asparagus, leek, onions, banana, wheat and garlic are sources of inulin. Higher concentrations exist in herbs. Dandelion root, elecampane root and chicory root all have large amount"}, {"url": "http://www.webmd.com/vitamins-and-supplements/inulin-uses-and-risks", "passage_text": "Many foods -- and plants that are less commonly eaten -- contain inulin. These include: 1  Asparagus. 2  Bananas. 3  Burdock. 4  Chicory, which is used in salads. 5  Dandelion root."}, {"url": "http://www.thedietchannel.com/Inulin-and-Food-Are-You-Eating-Inulin-Unknowingly.htm", "passage_text": "Here are some facts about this little-known dietary fiber. What is inulin? Inulin is a specific type of dietary fiber that is naturally found in hundreds of common foods such as leeks, artichokes, asparagus, onions, garlic, bananas, wheat, rye, and…chicory root."}, {"url": "http://www.webmd.com/vitamins-and-supplements/inulin-uses-and-risks", "passage_text": "Inulin is a type of fiber that's found in certain plant foods. Chicory root is the main source of inulin in supplement form. Chicory was originally found in Europe and Asia. Egyptians grew it thousands of years ago as a medicine."}, {"url": "https://en.wikipedia.org/wiki/Inulin", "passage_text": "Inulin is a natural storage carbohydrate present in more than 36,000 species of plants, including wheat, onion, bananas, garlic, asparagus, sunchoke and chicory. For these plants, inulin is used as an energy reserve and for regulating cold resistance. Because it is soluble in water, it is osmotically active."}, {"url": "https://en.wikipedia.org/wiki/Inulin", "passage_text": "It can be used to replace sugar, fat, and flour. This is advantageous because inulin contains 25-35% of the food energy of carbohydrates (starch, sugar). In addition to being a versatile ingredient, inulin has many health benefits."}, {"url": "http://www.wisegeek.org/what-is-inulin.htm", "passage_text": "Inulin is a polysaccharide that is produced by plants such as onions, leeks, Jerusalem artichokes, and garlic. It can also be referred to as neosugar, alant starch, Alantin, and diabetic sugar. Many manufacturers are putting it in processed foods because it has tremendous health benefits."}]