[{"url": "http://www.wikihow.com/Remove-Permanent-Marker", "passage_text": "Use a magic eraser. A magic eraser is a special cleaning pad designed to remove stains from a wide variety of surfaces. All you need to do is wet the magic eraser slightly, then use it to scrub the permanent marker stain from the surface."}, {"url": "http://www.ehow.com/how_6522335_remove-permanent-marker-car-paint.html", "passage_text": "a car in a car show image by Gary from Fotolia.com. Permanent marker stains on most surfaces present a problem. When those stains are on your car's exterior paint you have the added difficulty of trying to remove the marker and not the paint. Commercial products made for removing permanent marker stains contain acetate."}, {"url": "http://www.wikihow.com/Remove-Permanent-Marker", "passage_text": "Simply spray some WD-40 directly onto the marker stain then scrub it with a clean cloth to remove. 5. Use a dry erase marker. A dry erase marker can be used to remove stains from many surfaces, and it works extremely well on whiteboards."}, {"url": "http://www.ehow.com/how_6522335_remove-permanent-marker-car-paint.html", "passage_text": "Leave the towels over the permanent marker stain on your car's paint for at least four hours. Lift the towels and wipe the permanent marker stain with a clean towel to see if it lifts. Add more whole milk to the cotton cloth, if the stain persists, and leave the towels on the stain overnight."}, {"url": "http://home.howstuffworks.com/how-to-get-permanent-marker-out-of-clothes.htm", "passage_text": "If treated soon after the stain, even permanent-marker stains can be removed from clothing. Read the tips listed below and learn about how you can get permanent marker out of clothes. 1  Hairspray Believe it or not, hairspray is a fantastic way to remove stains from clothing. 2  Moisten the stain with water and then blot away at it with a paper towel that has been sprayed with non-oily hairspray."}, {"url": "http://www.wikihow.com/Remove-Permanent-Marker", "passage_text": "5. Use rubbing alcohol or hairspray to remove stains from carpet. Pour rubbing alcohol into a cleaning cloth. Dab the cloth onto the carpet stain. As with any carpet stain, do not rub or you'll spread the stain and weaken the fibers. Keep dabbing until the stain lifts off."}, {"url": "http://www.ehow.com/how_6522335_remove-permanent-marker-car-paint.html", "passage_text": "Rinse your car's paint with a clean cloth dampened with cool water. Dry the surface with another cloth. Apply aerosol hair spray, liberally, to any remaining permanent marker stain. Buff the area with a clean cloth then wipe down with cool water on a clean cloth."}]