[{"url": "https://gravesdiseasecure.wordpress.com/2013/09/19/can-hyperthyroidism-cause-weight-gain/", "passage_text": "“Hi, just wanted to find out what do you think about weight gain. When I first found out that I had a hyperthyroid I weighed a hundred and twenty lbs. Now, after about a year I can’t seem to loose any weight. Posted September 19, 2013 by sbankova in Graves' Disease, Graves' Disease Diet, Hyperthyroidism diet, Miscellaneous about Thyroid. Tagged: can hyperthyroidism cause gain weight, gainiing weight in hyperthyroidism, hyperthyroidism weight gain. 9 Comments."}, {"url": "http://www.naturalendocrinesolutions.com/archives/how-to-gain-weight-when-dealing-with-hyperthyroidism/", "passage_text": "WEIGHT GAIN STRATEGY #1: Normalize the thyroid hormone levels. Since the high thyroid hormone levels are usually responsible for the weight loss in hyperthyroid conditions you of course want to do what is necessary to normalize these levels. On the other hand, some people with hyperthyroid conditions begin to gain weight when taking antithyroid medication. But some people struggle to gain weight even while on the medication, and so let’s go ahead and discuss some of the things people with hyperthyroid conditions can do to gain weight."}, {"url": "http://gravesdiseasecure.com/hyperthyroidism-weight-gain/", "passage_text": "Hyperthyroidism weight gain is not so untypical today. It is logical to lose weight if you have hyperthyroidism, because the whole metabolism is accelerated and all the body processes speed up due to excessive release of thyroid hormone in the blood. Listen to this: “Hi, just wanted to find out what do you think about weight gain. When I first found out that I had a hyperthyroid I weighed 120 lbs. Now, after about a year I can’t seem to loose any weight. I am up to 150 and I am sick of gaining more even though I work out like crazy"}, {"url": "https://gravesdiseasecure.wordpress.com/2013/09/19/can-hyperthyroidism-cause-weight-gain/", "passage_text": "For example: “Hi, just wanted to find out what do you think about weight gain. When I first found out that I had a hyperthyroid I weighed a hundred and twenty lbs. Now, after about a year I can’t seem to loose any weight. I am up to one hundred fifty and I am sick of gaining more even though I work out like crazy. Posted September 19, 2013 by sbankova in Graves' Disease, Graves' Disease Diet, Hyperthyroidism diet, Miscellaneous about Thyroid. Tagged: can hyperthyroidism cause gain weight, gainiing weight in hyperthyroidism, hyperthyroidism weight gain. 9 Comments."}, {"url": "http://www.endocrineweb.com/community/hyperthyroidism/1244-hyperthyroid-weight-gain", "passage_text": "Hi,just wanted to find out what everone else thinks about weight gain. When I first found out that I had a hyper thyroid I weighed 120 lbs. NOW after about a year I can't seem to loose any weight. I am up to 150 and I am sick of gaining more even though I work out like crazy. Symptoms were excessive heat intolerance with terrible night sweats, tremors, enlarged thyroid gland, increased appetite, and weight gain. I, too, want another child, but my cycles were irregular to begin with, but have become regular since being put on Propylthiouracil, though I am not sure I am ovulating."}, {"url": "http://www.naturalendocrinesolutions.com/archives/how-to-gain-weight-when-dealing-with-hyperthyroidism/", "passage_text": "WEIGHT GAIN STRATEGY #3: Consume one or two smoothies on a daily basis with some added protein. In addition to eating nutrient dense foods, you can also have one or two smoothies per day. In the smoothie you can of course add some nutrient dense foods, such as kale, avocados, coconut oil, etc. On the other hand, some people with hyperthyroid conditions begin to gain weight when taking antithyroid medication. But some people struggle to gain weight even while on the medication, and so let’s go ahead and discuss some of the things people with hyperthyroid conditions can do to gain weight."}, {"url": "https://gravesdiseasecure.wordpress.com/2013/09/19/can-hyperthyroidism-cause-weight-gain/", "passage_text": "Patients, diagnosed with Graves’ disease, thyrotoxicosis, or hyperactive thyroid typically don’t have any dieting issues, I mean regarding gaining weight. Quite the opposite: one of the symptoms of thyrotoxicosis/hyperthyroidism (induced by whatever reason) is the uncontrollable weight loss. Posted September 19, 2013 by sbankova in Graves' Disease, Graves' Disease Diet, Hyperthyroidism diet, Miscellaneous about Thyroid. Tagged: can hyperthyroidism cause gain weight, gainiing weight in hyperthyroidism, hyperthyroidism weight gain. 9 Comments."}, {"url": "http://www.webmd.com/women/ss/slideshow-thyroid-symptoms-and-solutions", "passage_text": "An unexplained change in weight is one of the most common signs of a thyroid disorder. Weight gain may signal low levels of thyroid hormones, a condition called hypothyroidism. In contrast, if the thyroid produces more hormones than the body needs, you may lose weight unexpectedly. This is known as hyperthyroidism. Hypothyroidism is far more common. If you are diagnosed with hypothyroidism, your doctor will most likely prescribe thyroid hormones in the form of a pill. This usually leads to noticeable improvements within a couple of weeks. Long-term treatment can result in more energy, lower cholesterol levels, and gradual weight loss."}, {"url": "http://www.naturalendocrinesolutions.com/archives/how-to-gain-weight-when-dealing-with-hyperthyroidism/", "passage_text": "WEIGHT GAIN STRATEGY #2: Eat nutrient dense foods. Most people with hyperthyroid conditions try to address their weight loss issues by eating as many calories as they can. Frequently what they’ll do is try to load up on carbohydrates. Ideally what you want to do is eat nutrient dense foods. On the other hand, some people with hyperthyroid conditions begin to gain weight when taking antithyroid medication. But some people struggle to gain weight even while on the medication, and so let’s go ahead and discuss some of the things people with hyperthyroid conditions can do to gain weight."}]