[{"url": "http://www.improvenet.com/r/costs-and-prices/ductless-heat-pump", "passage_text": "Maximum Cost: $2,500. The cost to install a ductless heat pump system can vary from just over $2,000 to just under $5,000 for a single family home. This price generally includes $1,500 to $2,500 worth of materials, $600 to $1,000 worth of labor and about $100 worth of tools needed to complete the process. "}, {"url": "http://home.costhelper.com/air-heat-pump.html", "passage_text": "1 Lower prices are do-it-yourself installation, particularly for window units, which are relatively easy to install. 2  It typically costs about $2,000-$8,000 to install a whole-house electric heat pump system in an average home (three-ton capacity) with existing usable ductwork. 1 The total costs can double or triple to $4,000-$24,000 or more if new ductwork must be installed or failing ductwork must be replaced. 2  CostHelper readers report paying $3,000-$15,000 to have an air source heat pump installed, for an average cost of $7,792."}, {"url": "http://home.costhelper.com/heat-pump.html", "passage_text": "1 For less moderate climates, installing a dual-fuel air source heat pump that works with a natural gas or propane furnace under a single control system can cost $2,500-$5,500 to install just the heat pump, or $5,000-$25,000 or more for a complete system that includes both the electric heat pump and a fossil-fuel furnace. 1 Expect to pay about $2,000-$8,000 for installation of a whole-house air-source heat pump system in an average home (three-ton capacity) with existing usable ductwork. 2  The total costs can double or triple to $4,000-$24,000 or more if new ductwork must be installed or failing ductwork must be replaced"}, {"url": "http://www.homeadvisor.com/cost/heating-and-cooling/install-a-heat-pump/", "passage_text": "A heat pump will replace both the furnace and air conditioner/central air unit. It may be costly to install, with the national average falling between $3,956 and $6,702, but it will save you considerable money in energy costs. Consider the following factors before installing a heat pump: The biggest single factor is determining the price of your heat pump is the size of your house."}, {"url": "http://home.costhelper.com/heat-pump.html", "passage_text": "1 Complete installation of a geothermal heat pump (ground-source or water-source) can cost $10,000-$25,000 or more, depending on the length and depth of the underground pipes, soil conditions and other excavation and installation factors. 1 Expect to pay about $2,000-$8,000 for installation of a whole-house air-source heat pump system in an average home (three-ton capacity) with existing usable ductwork. 2  The total costs can double or triple to $4,000-$24,000 or more if new ductwork must be installed or failing ductwork must be replaced"}, {"url": "http://www.homewyse.com/services/cost_to_install_heat_pump.html", "passage_text": "$3,886.08. Get an INSTANT estimate of the cost to Install a Heat Pump! Our free calculator uses recent, trusted data to estimate costs for your Heat Pump Installation project. For a basic 1 pump project in zip code 47474, the benchmark cost to Install a Heat Pump ranges between $3,038.76 - $3,886.08 per pump. To estimate costs for your project: 1."}, {"url": "http://www.qualitysmith.com/request/articles/articles-hvac/heat-pump-prices/", "passage_text": "Heat pump prices and heat pump estimates. When entering the market for a heat pump, know that there are two general types of heat pumps available for you: air source heat pumps and geothermal heat pumps. Costs for an air source heat pump usually range from $1,500 to $7,500 for the purchase and installation. An air source heat pump pulls heat from the outside atmosphere and distribute it throughout the home. 1 Air source heat pump prices are relatively low, ranging between about $1,500 and $7,500 to buy and install a unit for the average home. 2  The amount of energy needed to create heat drops as the outside temperature rises."}, {"url": "http://www.homeadvisor.com/cost/heating-and-cooling/install-a-heat-pump/", "passage_text": "The cost of installing a heat pump will be more expensive for the geothermal type than air-source as it needs to be installed underground. The difficultly associated with the excavation of the ground will affect the installation costs. It may be costly to install, with the national average falling between $3,956 and $6,702, but it will save you considerable money in energy costs. Consider the following factors before installing a heat pump: The biggest single factor is determining the price of your heat pump is the size of your house."}, {"url": "https://www.consumer.org.nz/articles/heat-pump-installation-and-costs", "passage_text": "Heat pump installation cost. Installation costs can be significant. Our price survey shows the cost of installation varies more than the units themselves – from $750 to $1350. Make sure the cost of installation is included in your quote. "}]