[{"url": "http://www.medicinenet.com/liver_blood_tests/article.htm", "passage_text": "Liver blood tests are some of the most commonly performed blood tests. These tests can be used to assess liver functions or liver injury. An initial step in detecting liver damage is a simple blood test to determine the level of certain liver enzymes (proteins) in the blood. Under normal circumstances, these enzymes mostly reside within the cells of the liver."}, {"url": "http://liverbasics.com/ast-levels.html", "passage_text": "Aspartate transaminase (AST) is an enzyme produced in the liver. It plays an important role in amino acid metabolism. It is normally found in the liver, heart, muscles, brain, kidneys, and red blood cells. The level of AST in the blood is often tested to reveal the presence of liver disease or of damage to the liver. When elevated AST indicates damage to the liver, this damage can come from a variety of different causes, both in the sense of indicating various liver diseases and also in the sense of the diseases being due to various causes."}, {"url": "http://www.webmd.com/digestive-disorders/alanine-aminotransferase-alt", "passage_text": "The alanine aminotransferase (ALT) test is done to: 1  Identify liver disease, especially cirrhosis and hepatitis caused by alcohol, drugs, or viruses. 2  Help check for liver damage. 3  Find out whether jaundice was caused by a blood disorder or liver disease. 4  Keep track of the effects of medicines that can damage the liver. Most increases in ALT levels are caused by liver damage. The ALT test is often done along with other tests that check for liver damage, including aspartate aminotransferase (AST), alkaline phosphatase, lactate dehydrogenase (LDH), and bilirubin."}, {"url": "http://www.mayoclinic.org/tests-procedures/liver-function-tests/basics/why-its-done/PRC-20012602", "passage_text": "1 An increase in AST levels may indicate liver damage or disease or muscle damage. 2  Alkaline phosphatase (ALP). 3  ALP is an enzyme in the liver, bile ducts and bone. 4  Higher-than-normal levels of ALP may indicate liver damage or disease, such as a blocked bile duct, or certain bone diseases. 5  Albumin and total protein. 1 ALP is an enzyme in the liver, bile ducts and bone. 2"}, {"url": "http://liverbasics.com/ast-levels.html", "passage_text": "Liver Disease. When elevated AST indicates damage to the liver, this damage can come from a variety of different causes, both in the sense of indicating various liver diseases and also in the sense of the diseases being due to various causes."}, {"url": "http://www.emedicinehealth.com/liver_blood_tests/article_em.htm", "passage_text": "1 Elevated levels of AST and ALT may signify the level of liver damage in a person. 2  Common causes of elevated ALT and AST are. 3  viral liver infections, 4  alcohol abuse, 5  cirrhosis (from any chronic causes), 6  hemochromatosis (iron overload), shock, and/or. 7  heart failure. 1 Many drugs may cause elevated AST, and ALT and some medications can cause severe damage (for example, acetaminophen [ Tylenol liver damage]). 2  Less common causes of abnormal AST and ALT levels are wide ranging (for example, toxins, and autoimmune diseases)."}, {"url": "http://www.webmd.com/digestive-disorders/alanine-aminotransferase-alt", "passage_text": "ALT is measured to see if the liver is damaged or diseased. Low levels of ALT are normally found in the blood. But when the liver is damaged or diseased, it releases ALT into the bloodstream, which makes ALT levels go up. Most increases in ALT levels are caused by liver damage. The ALT test is often done along with other tests that check for liver damage, including aspartate aminotransferase (AST), alkaline phosphatase, lactate dehydrogenase (LDH), and bilirubin. Both ALT and AST levels are reliable tests for liver damage"}, {"url": "http://www.fatty-liver.com/high-elevated-alt-levels/", "passage_text": "High ALT levels in fatty liver and Elevated ALT levels. High ALT levels in fatty liver or elevated ALT levels in fatty liver (also called Alanine Transaminase and SGPT) in a fatty liver blood test can be a sign of a the severity of fatty liver disease from mild to serious. "}, {"url": "http://www.emedicinehealth.com/liver_blood_tests/article_em.htm", "passage_text": "1 The blood tests most frequently used for liver disease are the aminotransferases (alanine aminotransferase or ALT and aspartate aminotransferase or AST). 2  Normal levels of ALT ranges from about 7-56 units/liter, and 10-40units/liters for AST. 1 Many drugs may cause elevated AST, and ALT and some medications can cause severe damage (for example, acetaminophen [ Tylenol liver damage]). 2  Less common causes of abnormal AST and ALT levels are wide ranging (for example, toxins, and autoimmune diseases)."}, {"url": "http://www.medicinenet.com/liver_blood_tests/article.htm", "passage_text": "These enzymes are normally predominantly contained within liver cells and to a lesser degree in the muscle cells. If the liver is injured or damaged, the liver cells spill these enzymes into the blood, raising the AST and ALT enzyme blood levels and signaling liver disease. Other blood tests pertaining to the liver are measurements of some of the other enzymes found the liver. These tests can be used to assess liver functions or liver injury. An initial step in detecting liver damage is a simple blood test to determine the level of certain liver enzymes (proteins) in the blood. Under normal circumstances, these enzymes mostly reside within the cells of"}]