[{"url": "http://www.legalmatch.com/law-library/article/unsafe-drugs-class-action.html", "passage_text": "Avandia. 1  Medically prescribed for-Avandia was introduced following the recall of other similar diabetic drugs. 2  Avandia improves blood sugar control in adults with type II diabetes. 3  Adverse reactions experienced-Avandia has been linked to congestive heart failure, hepatitis, and liver failure. Meridia. 1  Medically prescribed for-Meridia is prescribed as a diet drug and anti-obesity medication. 2  Adverse reactions experienced-Meredia has been linked to serious side effects such as rapid heart rate, increased blood pressure, heart disease, stroke and seizures."}, {"url": "http://www.webmd.com/drugs/2/drug-6685/ativan-oral/details", "passage_text": "Uses. This medication is used to treat anxiety. Lorazepam belongs to a class of drugs known as benzodiazepines which act on the brain and nerves (central nervous system) to produce a calming effect. This drug works by enhancing the effects of a certain natural chemical in the body (GABA)"}, {"url": "http://medical-dictionary.thefreedictionary.com/lorazepam", "passage_text": "lorazepam. [lorā′lôrā]. zəpam a benzodiazepine. tranquilizer Indications it is prescribed in the treatment of, anxiety nervous, tension and insomnia and is given intravenously to abort status epilepticus and for. preanesthesia indications It is prescribed in the treatment of anxiety, nervous tension, and insomnia and is given intravenously to abort status epilepticus and for preanesthesia. contraindications Acute glaucoma, psychosis, pregnancy, or known hypersensitivity to this drug or to any benzodiazepine prohibits its use."}, {"url": "http://www.medicinenet.com/lorazepam/article.htm", "passage_text": "BRAND NAME: Ativan. DRUG CLASS AND MECHANISM: Lorazepam is a drug used for treating anxiety. It is in the benzodiazepine family of drugs, the same family that includes diazepam (Valium), alprazolam (Xanax), clonazepam (Klonopin), flurazepam (Dalmane), and others. "}, {"url": "https://en.wikipedia.org/wiki/Lorazepam", "passage_text": "Lorazepam, sold under the brand name Ativan among others, is a benzodiazepine medication often used to treat anxiety disorders. Lorazepam is used for the short-term treatment of anxiety, insomnia, acute seizures including status epilepticus, and sedation of hospitalized patients, as well as sedation of aggressive patients. Due to tolerance and dependence, lorazepam is recommended for short-term use, up to two to four weeks only."}, {"url": "http://www.empr.com/ativan/drug/322/", "passage_text": "Adult: Give in 2 or 3 divided doses, with largest dose taken at bedtime. Initially 2–3mg daily; range: 1–10mg daily. Elderly or debilitated: initially 1–2mg daily; adjust gradually if needed. "}, {"url": "http://www.celticfestms.org/holder-ativan-drug/", "passage_text": "Ativan class of drug: we fired we'd remained there with roy, and it was use for me to experience on. Now that is beyond my self. Mechanical engineering has fast and evident star expelled from both home and death. "}, {"url": "http://www.medicinenet.com/lorazepam/index.htm", "passage_text": "Featured: lorazepam, Ativan Main Article. Lorazepam (Ativan) is a prescription drug used for the management of anxiety disorders, short-term relief of anxiety, or anxiety associated with depression. Ativan is effective for insomnia, panic attacks, and is used for prevention and treatment of alcohol withdrawal. "}, {"url": "http://www.ryar.org/ativan/", "passage_text": "Ativan. Ativan is a controversial drug that contains benzodiazepine, which has been associated with a number of serious side effects as well as addiction. The drug, originally known as Lorazepam, is prescribed for panic and anxiety issues. "}, {"url": "http://anxiety.emedtv.com/ativan/ativan-drug-class.html", "passage_text": "Ativan Drug Class. As part of the benzodiazepine drug class, Ativan ® (lorazepam) has several effects on the body, including: 1  Reducing anxiety. 2  Causing sleepiness. 3  Relaxing muscles. 4  Stopping seizures. 5  Impairing short-term memory. "}]