[{"url": "http://www.wikihow.com/Grow-a-Beard", "passage_text": "1 If so, you're ready for growing a beard. 2  If your beard doesn't grow evenly, there's a bit you can do to speed up the process and ensure that your hair will eventually grow in as thickly as possible. 3  Genetics has a lot to do with your ability to grow facial hair."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20070802230416AAPgPGt", "passage_text": "I have a little facial hair now on my side burn area to my chin and some on my neck. And I shave usually 1-2 times a week. Does this usually mean that I stopped growing and have reached close to my peak height. Also I am 15 and am 6 foot 2. My dad is 5 foot 10 and my mom is 5 foot 3. Im not asking about how to grow taller, I just want to know your guys opinion if facial hair means Im done growing."}, {"url": "http://growingupboys.info/Answers/20070929.html", "passage_text": "Beginning to grow facial hair means you're in stage 4 of development. In that stage you have gone through your rapid growth spurt and the rate of your growth is slowing down. By the time you are able to grow a full, thick beard, you will have stopped growing."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20070802230416AAPgPGt", "passage_text": "show more I have a little facial hair now on my side burn area to my chin and some on my neck. And I shave usually 1-2 times a week. Does this usually mean that I stopped growing and have reached close to my peak height. Also I am 15 and am 6 foot 2. My dad is 5 foot 10 and my mom is 5 foot 3. Im not asking about how to grow taller, I just want to know your guys opinion if facial hair means Im done growing."}, {"url": "http://teens.webmd.com/boys/facial-hair-faq", "passage_text": "No. Just like all guys aren't the same height, the amount of facial hair varies from one guy to the next. That's because the amount of hair you have, how dark or light it is, and where it grows on your face, is largely controlled by your genes. That doesn't mean your beard will necessarily look like your dad's."}, {"url": "http://growingupboys.info/Answers/20070929.html", "passage_text": "Sam. Beginning to grow facial hair means you're in stage 4 of development. In that stage you have gone through your rapid growth spurt and the rate of your growth is slowing down. By the time you are able to grow a full, thick beard, you will have stopped growing."}]