[{"url": "http://budgeting.thenest.com/long-work-employer-able-collect-unemployment-benefits-26693.html", "passage_text": "Some states, such as Connecticut, will figure your benefit on one quarter of wages. In Washington, you must work at least 680 hours during your base year to qualify. If you haven’t worked long enough to meet your state’s minimum requirements, you can’t collect benefits."}, {"url": "http://budgeting.thenest.com/long-work-employer-able-collect-unemployment-benefits-26693.html", "passage_text": "Eligibility Requirements. Most states want you to work a minimum amount of time, or make a minimum amount of money during your base period. If you haven’t been employed long, your benefits will be figured with an alternate base period. In this case, they'll take into account the most recent quarter you worked."}, {"url": "http://www.nolo.com/legal-encyclopedia/unemployment-compensation-understanding-base-period-32444.html", "passage_text": "Only employees who have been working relatively recently can collect unemployment. People who have been out of work for a long time -- such as stay-at-home parents who haven't worked in years -- aren't eligible for unemployment benefits until they have rejoined the workforce for a period of time."}, {"url": "http://www.ehow.com/info_7756580_long-able-collect-unemployment-benefits.html", "passage_text": "You must work for a certain period of time before you can receive unemployment so that employees who have paid in to the unemployment system with their time can reap the benefits while those who have not put in the time do not get benefits."}, {"url": "http://www.ehow.com/info_7756580_long-able-collect-unemployment-benefits.html", "passage_text": "Base Amount. Most states require you to earn at least a base amount in one of the last four quarters, and to earn one and a half times that amount in all. For example, if you must earn at least $700 in one quarter, you also must earn at least $1,750 in total to qualify for unemployment."}, {"url": "http://www.ctdol.state.ct.us/progsupt/unemplt/uceligb.htm", "passage_text": "You can collect the equivalent of 26 weeks of total unemployment benefits on a claim. A claim is in effect for a one-year period. Within that claim year, maximum benefits would be 26 times your Weekly Benefit Rate. Using the previous example, with a Weekly Benefit Rate of $152, you would be entitled to collect $3,952."}, {"url": "http://www.aboutunemployment.org/eligibility-length/", "passage_text": "While unemployment benefits may cover up to 50% of your earned wages, most states also have established a cap on how much you can receive. Meaning, if 50% of your wages is an amount over the maximum benefits, then you will not receive 50%."}, {"url": "http://www.nolo.com/legal-encyclopedia/unemployment-compensation-understanding-base-period-32444.html", "passage_text": "Workers are eligible for unemployment compensation only if they are temporarily out of work through no fault of their own. The fault part of the eligibility requirement has to do with the reasons why the employee no longer has a job."}, {"url": "http://budgeting.thenest.com/long-work-employer-able-collect-unemployment-benefits-26693.html", "passage_text": "If you didn’t work very long during your benefit period, you may not accumulate enough earnings to make you eligible for an unemployment check. In California, you must earn at least $1,300 in one quarter of your base period."}]