[{"url": "http://doctorbarkman.blogspot.com/2012/08/how-many-calories-does-my-dog-need.html", "passage_text": "Delete. April 6, 2014 at 5:23 PM. My dog is doing much better with allergies and health now that we are on a homemade diet and OFF the vet food....we feed 20-30 calories per pound, so a 30 pound dog eats about 600- 900 calories per day, depending on how active they are."}, {"url": "http://doctorbarkman.blogspot.com/2012/08/how-many-calories-does-my-dog-need.html", "passage_text": "For instance, a 20 pound active dog needs about 650 calories. That's a little less than two cups of Pedigree Adult Complete Nutrition Dog Food."}, {"url": "http://www.fidosavvy.com/how-much-to-feed-your-dog.html", "passage_text": "When you know how many calories your dog needs, AND how many calories there are in one cup of food, it's easy to figure out how many cups to feed! Here's a quick example calculated for a dog who weighs 20 lbs, which is 9.7 kg: 9.7 X 30 + 70 = 361 .... so your 20lb dog needs approx 361 calories per day."}, {"url": "http://www.pedigree.com/All-Things-Dog/Article-Library/How-Much-Should-You-Feed-Your-Dog.aspx", "passage_text": "The number of calories a dog needs depends on his size, breed and activity. This section is a guide to how much food your dog needs to eat, according to these factors. Dogs need a balanced diet, and that means the right kinds of nutrients and enough calories to meet their energy needs."}, {"url": "http://tails.co/requirements.html", "passage_text": "Caloric Requirements For Your Dog. The chart below is a general guideline for your dog's calorie requirements. Dogs, on average, need about 30 calories per pound of body weight per day to maintain their current weight. Small active dogs, weighing less than 20 lbs. can use up to 40 calories per pound per day. Large dogs, over 50 lbs., can use as little as 2"}, {"url": "http://doctorbarkman.blogspot.com/2012/08/how-many-calories-does-my-dog-need.html", "passage_text": "The average active 35 pound dog needs about a thousand calories a day. How many calories does your dog need? Use the dog food calculator link to find out. Put in your dog's weight and describe her activity level."}]