[{"url": "https://en.wikipedia.org/wiki/DNA", "passage_text": "Deoxyribonucleic acid (/diˌɒksiˌraɪbɵ.njuːˌkleɪ.ɨk ˈaesɪd/ ; ˈæSɪD) dna is a molecule that carries most of the genetic instructions used in the, development functioning and reproduction of all known living organisms and many. viruses "}, {"url": "http://www.livescience.com/37247-dna.html", "passage_text": "DNA structure. DNA is made up of molecules called nucleotides. Each nucleotide contains a phosphate group, a sugar group and a nitrogen base. The four types of nitrogen bases are adenine (A), thymine (T), guanine (G) and cytosine (C). The order of these bases is what determines DNA's instructions, or genetic code. Deoxyribonucleic acid or DNA is a molecule that contains the instructions an organism needs to develop, live and reproduce. These instructions are found inside every cell, and are passed down from parents to their children."}, {"url": "https://simple.wikipedia.org/wiki/DNA", "passage_text": "DNA, short for deoxyribonucleic acid, is the molecule that contains the genetic code of organisms. This includes animals, plants, protists, archaea and bacteria. DNA is in each cell in the organism and tells cells what proteins to make. Mostly, these proteins are enzymes. DNA is inherited by children from their parents. This is why children share traits with their parents, such as skin, hair and eye color. "}, {"url": "http://www.answers.com/Q/What_is_the_function_of_DNA", "passage_text": "DNA actually has several functions. For example, DNA stores the genetic material of an organism. It also replicates itself when it divides. the DNA is the genetic material of a cell it is what makes each cell unique. 1  Deoxyribonucleic acid (DNA) is the genetic code which ensures that daughter cells inherit the same characteristics as the parent cells. A: replication   A: dna cells give direnctions to the nucleius and plans what yo … ur going to function all your life   A: The DNA of a cell acts as instructions for all the processes of a cell. Basically it is a spiral of information that the cell uses for everything."}, {"url": "https://www.sharecare.com/health/genetics-genetic-disorders/what-function-dna", "passage_text": "DNA contains the biological and genetic instructions that control the day-to-day function of your cells. DNA is like a blueprint, containing the directions necessary to construct other components of cells, such as proteins and RNA (ribonucleic acid). The instructions are passed down to you through inheritance."}, {"url": "https://quizlet.com/16455659/structure-function-of-dna-and-rna-flash-cards/", "passage_text": "-composed of polynucleotides -- have a phosphate group, deoxyribose sugar and a nitrogen containing bases (adenine, thymine, cytosine and guanine) -Has a doubled helix that is formed by hydrogen bonds between polynucleotides-Densely compacted into chromosomes to fit into nucleus. -deoxyribonucleic acid-contains information for the cell and genetic material-has a phosphate group/phosphoric acid, deoxyribose sugar and nitrogen containing bases (adenine, thymine, cytosine, guanine).   ."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_DNA", "passage_text": "DNA also contains all the genetic coding which is used to control functions, behavior and development of an organism. DNA is also used as a long term storage device to store the genetic instructions. These instructions must be correct so the DNA can make an exact copy of itself. A: replication   A: dna cells give direnctions to the nucleius and plans what yo … ur going to function all your life   A: The DNA of a cell acts as instructions for all the processes of a cell. Basically it is a spiral of information that the cell uses for everything."}, {"url": "http://www.ncbi.nlm.nih.gov/books/NBK26821/", "passage_text": "Summary. Genetic information is carried in the linear sequence of nucleotides in DNA. Each molecule of DNA is a double helix formed from two complementary strands of nucleotides held together by hydrogen bonds between G-C and A-T base pairs. Duplication of the genetic information occurs by the use of one DNA strand as a template for formation of a complementary strand. A DNA molecule consists of two long polynucleotide chains composed of four types of nucleotide subunits. Each of these chains is known as a DNA chain, or a DNA strand. Hydrogen bonds between the base portions of the nucleotides hold the two chains together (Figure 4-3)."}, {"url": "http://www.answers.com/Q/What_are_the_main_functions_of_DNA", "passage_text": "Making the world better, one answer at a time. Deoxyribonucleic acid (DNA) is a nucleic acid that contains the genetic instructions used in the development and functioning of all known living organisms. The flow of information from the genes determines the protein composition and thereby the functions of the cell. The DNA is situated in the nucleus, organized into chromosomes. Every cell must contain the genetic information and the DNA is therefore duplicated before a cell divides (replication)."}]