[{"url": "https://en.wikipedia.org/wiki/Rocky_Mountains", "passage_text": "The Rocky Mountains were initially formed from 80 million to 55 million years ago during the Laramide orogeny, in which a number of plates began to slide underneath the North American plate. The Rocky Mountains stretch more than 3,000 miles (4,800 km) from the northernmost part of British Columbia, in western Canada, to New Mexico, in the southwestern United States."}, {"url": "http://geology.com/rocks/limestone.shtml", "passage_text": "Limestone is a sedimentary rock composed primarily of calcium carbonate (CaCO 3) in the form of the mineral calcite. It most commonly forms in clear, warm, shallow marine waters. It is usually an organic sedimentary rock that forms from the accumulation of shell, coral, algal and fecal debris. A rock known as tufa is a limestone formed by evaporation at a hot spring, lake shore, or other area. Limestone is by definition a rock that contains at least 50% calcium carbonate in the form of calcite by weight. All limestones contain at least a few percent other materials. These can be small particles of quartz, feldspar, clay minerals, pyrite, siderite and other mineral"}, {"url": "http://www.bengadd.com/Downloads/Geology%20of%20the%20Rockies%20and%20Columbias%20plus%20time%20scale%202014.pdf", "passage_text": "—and dolomite. Gadd on the geology of the Rockies and Columbias, page 1 of 5. Unlike clastic rock, which is made of particles that have travelled before settling and hardening to rock, carbonate rock is made mostly of particles that have formed in place, usually in the sea. • You can find out more about the geology of the Rockies, including what you see along the region’s highways, in two of Ben’s books: Canadian Rockies Geology Road Tours (Corax Press, 2008) and Handbook of the Canadian Rockies (Corax Press, 2009)."}, {"url": "https://en.wikipedia.org/wiki/Canadian_Rockies", "passage_text": "The Canadian Rockies are quite different in appearance and geology from the American Rockies to the south of them. The Canadian Rockies are composed of layered sedimentary rock such as limestone and shale, whereas the American Rockies are made mostly of metamorphic and igneous rock such as gneiss and granite. The Canadian Rockies have numerous high peaks and ranges, such as Mount Robson (Sometimes called Mount Bella) (3,954 m (12,972 ft)) and Mount Columbia (3,747 m (12,293 ft)). The Canadian Rockies are composed of shale and limestone."}, {"url": "https://en.wikipedia.org/wiki/Rocky_Mountains", "passage_text": "The Rocky Mountains, commonly known as the Rockies, are a major mountain range in western North America. The Rocky Mountains stretch more than 3,000 miles (4,800 km) from the northernmost part of British Columbia, in western Canada, to New Mexico, in the southwestern United States."}, {"url": "http://schools-wikipedia.org/wp/r/Rocky_Mountains.htm", "passage_text": "The Rocky Mountains were formed from 80 million to 55 million years ago during the Laramide orogeny, in which a number of plates began to slide underneath the North American plate. The angle of subduction was shallow, resulting in a broad belt of mountains running down western North America. "}, {"url": "https://en.wikipedia.org/wiki/Canadian_Rockies", "passage_text": "The Rockies form the divide between the Pacific drainage on the west and that of Hudson Bay and the Arctic Ocean on the east. Of the range's rivers, only the Peace River penetrates the range. Notable rivers originating in the Canadian Rockies include the Fraser, Columbia, North Saskatchewan, Bow and Athabasca Rivers. The Canadian Rockies have numerous high peaks and ranges, such as Mount Robson (Sometimes called Mount Bella) (3,954 m (12,972 ft)) and Mount Columbia (3,747 m (12,293 ft)). The Canadian Rockies are composed of shale and limestone."}, {"url": "https://en.wikipedia.org/wiki/Canadian_Rockies", "passage_text": "The northern end is at the Liard River in northern British Columbia. The Canadian Rockies have numerous high peaks and ranges, such as Mount Robson (Sometimes called Mount Bella) (3,954 m (12,972 ft)) and Mount Columbia (3,747 m (12,293 ft)). The Canadian Rockies are composed of shale and limestone. Much of the range is protected by national and provincial parks, several of which collectively comprise a World Heritage Site"}, {"url": "https://en.wikipedia.org/wiki/Geology_of_the_Rocky_Mountains", "passage_text": "The rocks making up the mountains were formed before the mountains were raised. The cores of the mountain ranges are in most places formed of pieces of continental crust that are over one billion years old. In the south, an older mountain range was formed 300 million years ago, then eroded away. The rocks of that older range were reformed into the Rocky Mountains. The Rocky Mountains took shape during an intense period of plate tectonic activity that resulted in much of the rugged landscape of the western North America. The Laramide orogeny, about 80–55 million years ago, was the last of the three episodes and was responsible for raising the Rocky Mountains. "}]