[{"url": "http://www.howtogeek.com/166652/how-to-hide-and-unhide-rows-and-columns-in-excel-2013/", "passage_text": "To unhide a row, you must first select the rows both above and below the hidden row(s). Then, right-click on the selected row headers and select Unhide from the popup menu. The hidden rows display again and are highlighted along with the surrounding rows. You can also easily hide one or more columns."}, {"url": "http://www.techrepublic.com/blog/microsoft-office/how-to-unhide-row-1-and-column-a-in-an-excel-sheet/", "passage_text": "To hide multiple noncontiguous rows or columns, select the rows or columns and choose Hide & Unhide from the Format dropdown in the Cells group. In Excel 2003, choose Column or Row from the Format menu, and then select Hide. You can quickly discern that a row or column is hidden by the missing header. Unhiding is also simple. Select the adjacent columns or rows, right-click, and select Unhide from the resulting context menu."}, {"url": "https://support.office.com/en-us/article/Unhide-the-first-column-or-row-in-a-worksheet-d6b47608-80ee-4021-9b51-6a1f57269ec9", "passage_text": "To select the first hidden row or column on the worksheet, do one of the following: In the Name Box next to the formula bar, type A1, and then press ENTER. On the Home tab, in the Editing group, click Find & Select, and then click Go To. In the Reference box, type A1, and then click OK. On the Home tab, in the Cells group, click Format. Do one of the following: Under Visibility, click Hide & Unhide, and then click Unhide Rows or Unhide Columns. Under Cell Size, click Row Height or Column Width, and then in the Row Height or Column Width box, type the value that you want to use for the row height or column width."}, {"url": "http://www.techrepublic.com/blog/microsoft-office/how-to-unhide-row-1-and-column-a-in-an-excel-sheet/", "passage_text": "Excel will select cell A1, but you won't see that happen, because the cell's hidden. Next, click the Format dropdown in the Cells group (on the Home tab) and choose Hide & Unhide. Then, select Unhide and Excel will expose the hidden row or column. In Excel 2003, use the Name Box to select cell A1."}, {"url": "http://www.accountingweb.com/technology/excel/tricks-for-hiding-and-unhiding-excel-rows-and-columns", "passage_text": "First, select the row or rows that you wish to hide or unhide, and then carry out these steps: 1  Excel 2007 and later: On the Home tab, choose Format in the Cells section of the ribbon, and then choose Hide & Unhide, and then either Hide Rows or Unhide Rows."}]