[{"url": "http://www.visitorlando.com/plan-your-trip/weather/", "passage_text": "Orlando Weather. One of Orlando's biggest draws is the year-round sunny, mild weather. In keeping with the Sunshine State, Central Florida maintains a comfortable average annual temperature of 72 degrees and a mostly dry climate from October to May."}, {"url": "http://www.answers.com/Q/What_is_the_average_temperature_in_orlando_florida_in_november", "passage_text": "Temperatures in Orlando are usually warm throughout the year. The average high temperature in November is 78.5 degrees and the average low temperature is 57.5. In Panama City, Florida, the average high temperature in November is 73 degrees, with an average low of 46 degrees. This is an average, and it should be noted that 80+ degree … daytime highs and lows in the 20 degree range are not uncommon."}, {"url": "http://www.currentresults.com/Weather/Florida/Places/orlando-weather-in-november.php", "passage_text": "In most years, Orlando averages a daily maximum temperature for November that's between 76 and 81 degrees Fahrenheit (25 to 27 degrees Celsius). The minimum temperature usually falls between 55 and 62 °F (13 to 17 °C). The sun's rays reach the ground in Orlando during 66 percent of daylight hours on average in November, for a total of 213 hours in the month. Typically on 10 days this month the sky is mainly clear, with at most 30 percent cloud cover. Sunlight in November at Orlando lasts for 10 hours and 43 minutes a day on average. The longest day of the month is the 1st with 11 hours and 3 minutes of daylight. By the end of the month, the days have shortened to 10:28 from sunrise to sunset"}, {"url": "http://www.currentresults.com/Weather/Florida/Places/orlando-weather-in-november.php", "passage_text": "15 °C. In most years, Orlando averages a daily maximum temperature for November that's between 76 and 81 degrees Fahrenheit (25 to 27 degrees Celsius). The minimum temperature usually falls between 55 and 62 °F (13 to 17 °C). The days at Orlando continue their rapid cooling during November. The sun's rays reach the ground in Orlando during 66 percent of daylight hours on average in November, for a total of 213 hours in the month. Typically on 10 days this month the sky is mainly clear, with at most 30 percent cloud cover. Sunlight in November at Orlando lasts for 10 hours and 43 minutes a day on average. The longest day of the month is the 1st with 11 hours and 3 minutes of daylight. By the end of the month, the days have shortened to 10:28 from sunrise to sunset"}, {"url": "http://www.answers.com/Q/What_is_the_average_temperature_in_orlando_florida_in_november", "passage_text": "AUTUMN (SEPTEMBER-NOVEMBER): October is typically our dryest month and with mild temperatures, it is a very comfortable climate. September and October qualify as Indi … an Summer weather with mid 70s to low 80s during the daytime and mid 40s to 50s at night. In Panama City, Florida, the average high temperature in November is 73 degrees, with an average low of 46 degrees. This is an average, and it should be noted that 80+ degree … daytime highs and lows in the 20 degree range are not uncommon."}, {"url": "https://weatherspark.com/averages/30841/11/Orlando-Florida-United-States", "passage_text": "Location. This report describes the typical weather at the Orlando International Airport (Orlando, Florida, United States) weather station over the course of an average November. It is based on the historical records from 1974 to 2012. Earlier records are either unavailable or unreliable. Orlando, Florida has a warm humid temperate climate with hot summers and no dry season. The area within 25 mi of this station is covered by croplands (70%), forests (9%), lakes and rivers (8%), grasslands (8%), and built-up areas (4%)."}, {"url": "http://www.holiday-weather.com/orlando/averages/november/", "passage_text": "Weather low-down. The weather in Orlando in November is much more bearable so it’s a popular winter holiday destination for those wanting to escape the cold at home. The average daytime temperatures are around 25°C (78°F) whereas the average minimum temperatures drop down to 14°C (57°F). The humidity drops significantly at this time of year so it’s a great time for outdoor activities such as golf and swimming. The average amount of sunshine expected in this month is 8 hours per day."}]