[{"url": "https://en.wikipedia.org/wiki/Inflorescence", "passage_text": "Inflorescence can also be defined as the reproductive portion of a plant that bears a cluster of flowers in a specific pattern. Strictly speaking this kind of inflorescence could be called umbelliform cyme, although it is normally called simply 'umbel'. Another kind of definite simple inflorescence is the raceme-like cyme or botryoid; that is as a raceme with a terminal flower and is usually improperly called 'raceme'."}, {"url": "http://www.southernliving.com/home-garden/gardens/hydrangea-planting-tips", "passage_text": "Bloom in late spring or summer. Flower clusters may contain sterile flowers (conspicuous, with large, petal-like sepals) or fertile flowers (small, starry petaled); or they may feature a cluster of small fertile flowers surrounded by ring of big sterile ones (these are called lace-cap hydrangeas). "}, {"url": "http://homeguides.sfgate.com/plants-large-leaves-small-clusters-orange-flowers-86501.html", "passage_text": "Ixora Characteristics. Sometimes called scarlet jungleflame or jungle geranium for its bright, persistent flowers, ixora is a popular landscaping plant in the very warmest zones of the United States, hardy only in U.S. Department of Agriculture plant hardiness zones 10 and 11. "}, {"url": "http://www.weegy.com/?ConversationId=E5E58DAA", "passage_text": "Clusters of flowers are called _____. a.inflorescence b.petals c.sepals d.fruit. Weegy: c.fruit. fruit, matured ovary of the pistil of a flower, containing the seed. User: The male and female parts of a flower are the _____. pistil stamen receptacle sepal petal tendril Weegy: Pistil: the female part of a flower."}, {"url": "http://www.answers.com/Q/What_is_a_group_of_flowers_called", "passage_text": "Basic Rose Facts: Roses are plants and the type of plant is called a flower. The flowers of rose plants have sepals, petals, stamens, and pistils. The rose flower is term … ed complete because all four structures are present. The rose flower is termed perfect because it has both male (stamen) and female (pistil) reproductive parts."}, {"url": "http://www.thefreedictionary.com/flower+cluster", "passage_text": "1. flower cluster-an inflorescence consisting of a cluster of flowers. inflorescence-the flowering part of a plant or arrangement of flowers on a stalk. raceme-usually elongate cluster of flowers along the main stem in which the flowers at the base open first. "}, {"url": "https://en.wikipedia.org/wiki/Inflorescence", "passage_text": "An inflorescence is a group or cluster of flowers arranged on a stem that is composed of a main branch or a complicated arrangement of branches. Morphologically, it is the part of the shoot of seed plants where flowers are formed and which is accordingly modified. Strictly speaking this kind of inflorescence could be called umbelliform cyme, although it is normally called simply 'umbel'. Another kind of definite simple inflorescence is the raceme-like cyme or botryoid; that is as a raceme with a terminal flower and is usually improperly called 'raceme'."}, {"url": "https://en.wikipedia.org/wiki/Inflorescence", "passage_text": "Any flower in an inflorescence may be referred to as a floret, especially when the individual flowers are particularly small and borne in a tight cluster, such as in a pseudanthium. The fruiting stage of an inflorescence is known as an infructescence. Inflorescences may be simple (single) or complex (panicle). Strictly speaking this kind of inflorescence could be called umbelliform cyme, although it is normally called simply 'umbel'. Another kind of definite simple inflorescence is the raceme-like cyme or botryoid; that is as a raceme with a terminal flower and is usually improperly called 'raceme'."}, {"url": "https://en.wikipedia.org/wiki/Flower", "passage_text": "A flower, sometimes known as a bloom or blossom, is the reproductive structure found in flowering plants (plants of the division Magnoliophyta, also called angiosperms). The biological function of a flower is to effect reproduction, usually by providing a mechanism for the union of sperm with eggs. "}, {"url": "https://simple.wikipedia.org/wiki/Flower", "passage_text": "A flower is a part of a plant. Flowers are also called the bloom or blossom of a plant. The flower grows on a stalk – a thin node – which supports it. Flowers have petals. Inside the part of the flower that has petals are the parts which produce pollen and seeds. Flowers are the reproductive structure of flowering plants, which are plants of the division Magnoliophyta, also called the Angiosperms. In many plants, a flower is its most colourful part. We say the plant 'flowers', 'is flowering' or 'is in flower' when this colourful part begins to grow bigger and open ou"}]