[{"url": "http://www.leaderu.com/orgs/probe/docs/buddhism.html", "passage_text": "Buddhism began as an offspring of Hinduism in the country of India. The founder was Siddhartha Gautama. It is not easy to give an accurate historical account of the life of Gautama, since no biography was recorded until hundreds of years after his death."}, {"url": "http://www.ushistory.org/civ/8d.asp", "passage_text": "A wave of conversion began, and Buddhism spread not only through India, but also internationally. Ceylon, Burma, Nepal, Tibet, central Asia, China, and Japan are just some of the regions where the Middle Path was widely accepted."}, {"url": "http://religion.answers.wikia.com/wiki/About_what_date_did_buddhism_start", "passage_text": "Sakyamuni (The Buddha) lived 563 BCE to 483 BCE; Buddhism began after he sat under the Bodhi Tree and acquired enlightenment. After 49 days meditating, at the age of 35, he attained Enlightenment; according to some traditions, this occurred approximately in the fifth lunar month, and according to others in the twelfth."}, {"url": "http://www.buddhanet.net/e-learning/5minbud.htm", "passage_text": "Buddhism is a religion to about 300 million people around the world. The word comes from 'budhi', 'to awaken'. It has its origins about 2,500 years ago when Siddhartha Gotama, known as the Buddha, was himself awakened (enlightened) at the age of 35."}, {"url": "http://uri.org/kids/world_budd_basi.htm", "passage_text": "How did Buddhism begin? About 2500 years ago, a prince named Siddhartha Gautama began to question his sheltered, luxurious life in the palace. He left the palace and saw four sights: a sick man, an old man, a dead man and a monk. These sights are said to have shown him that even a prince cannot escape illness, suffering and death."}, {"url": "http://www.godrealized.org/buddhism/when_was_buddhism_founded.html", "passage_text": "When was Buddhism founded (where did buddhism start-Gautama Buddha). Around 2600 years back came Mahavira and 77 years later followed Gautama Buddha. Mahavira and Gautama Buddha were in a manner both contemporaries. Buddhism is a religion."}, {"url": "http://www.uri.org/kids/world_hind_basi.htm", "passage_text": "How did Hinduism begin? Hinduism or Sanatana Dharma (eternal spiritual path) began about 4000 years ago in India. It was the religion of an ancient people known as the Aryans (noble people) whose philosophy, religion, and customs are recorded in their sacred texts known as the Vedas."}]