[{"url": "http://www.currentresults.com/Weather/California/average-annual-city-temperatures.php", "passage_text": "Average Annual Temperatures for Cities in California. Average daily high and low temperatures for the year at dozens of cities throughout California are listed below in degrees Fahrenheit and Celsius. You can jump to separate tables for cities in Southern California and Northern California. The tables give the normal maximum and minimum temperatures based on weather data collected from 1981 to 2010 by the US National Climatic Data Center. "}, {"url": "https://en.wikipedia.org/wiki/Climate_of_California", "passage_text": "For example, the average daily high in San Francisco in July and August is 72 °F (22 °C), and in Walnut Creek, some 20 miles (32 km) inland, the average daily high in July and August is 90 °F (32 °C); a temperature gain of approximately one degree (Fahrenheit) per mile. Northwestern California has a temperate climate with rainfall of 15 inches (380 mm) to 50 inches (1,300 mm) per year. Some areas of Coast Redwood forest receive over 100 inches (2,500 mm) of precipitation per year."}, {"url": "http://www.holiday-weather.com/averages/", "passage_text": "1 Average high temperatures range from 15°C/59°F to 20°C/68°F. * 2  Average rainfall ranges from 547 mm/22 inches per year in Southeastern France to 1,510 mm/60 inches per year in Southwestern France. * 3  Sea temperatures range from 12°C/54°F to 18°C/64°F. 1 Average low temperatures range from 4°C/39°F to 12°C/54°F. 2  Average high temperatures range from 15°C/59°F to 20°C/68°F. * 3  Average rainfall ranges from 547 mm/22 inches per year in Southeastern France to 1,510 mm/60 inches per year in Southwestern France. * 4  Sea temperatures range from 12°C/54°F to 18°C/64°F."}, {"url": "http://www.bestplaces.net/climate/city/california/beaumont", "passage_text": "Beaumont, California, gets 18 inches of rain per year. The US average is 37. Snowfall is 2 inches. The average US city gets 25 inches of snow per year. The number of days with any measurable precipitation is 44. On average, there are 267 sunny days per year in Beaumont, California. The July high is around 96 degrees. The January low is 39. Our comfort index, which is based on humidity during the hot months, is a 18 out of 100, where higher is more comfortable."}, {"url": "http://www.holiday-weather.com/averages/", "passage_text": "1 * Average high temperatures range from 20°C/69°F in Northeast Spain to 25°C/77°F in Southern Spain. * 2  Average rainfall ranges from 599 mm/24 inches per year in the Balearic Islands to 1,909 mm/75 inches per year in Northwest Spain. * 3  Sea temperatures range from 16°C/61°F to 23°C/74°F. 1 Average low temperatures range from 4°C/39°F to 12°C/54°F. 2  Average high temperatures range from 15°C/59°F to 20°C/68°F. * 3  Average rainfall ranges from 547 mm/22 inches per year in Southeastern France to 1,510 mm/60 inches per year in Southwestern France. * 4  Sea temperatures range from 12°C/54°F to 18°C/64°F."}, {"url": "https://en.wikipedia.org/wiki/Climate_of_San_Diego", "passage_text": "The United States average for days above 90 °F (32 °C) is 37.9 days while San Diego's is only 2.5 days, and there are, on average 0 days below 32 °F (0 °C) in San Diego, while the national average is 88 days. Average monthly temperatures range from 57.3 °F (14.1 °C) in January to 72 °F (22 °C) in August, although late summer and early autumn are typically the hottest times of the year with temperatures occasionally reaching 90 °F (32 °C) or higher."}, {"url": "http://coolweather.net/staterainfall/california.htm", "passage_text": "1 California State Precipitation Avg - 22.20 inches - 40th wettest state in the U.S. 2  California Tornado Average - 5 per year - 32nd most in the U.S. 3  Largest reported Tornado in California from 1950-2011, 11/9/1982 - 1,300 yards / .73 miles wide. California's wettest year ever was 1983, with a state precipitation average of 42.33 inches. 45 weather reporting stations received levels of precipitation that normally occur only 1 time in over 1,000 years."}, {"url": "http://www.bestplaces.net/climate/city/california/fremont", "passage_text": "Fremont, California, gets 15 inches of rain per year. The US average is 37. Snowfall is 0 inches. The average US city gets 25 inches of snow per year. The number of days with any measurable precipitation is 55. On average, there are 264 sunny days per year in Fremont, California. The July high is around 77 degrees. The January low is 41. Our comfort index, which is based on humidity during the hot months, is a 66 out of 100, where higher is more comfortable. The US average on the comfort index is 44."}, {"url": "https://en.wikipedia.org/wiki/Climate_of_California", "passage_text": "At the Santa Monica coast, the average high in August is 75 °F (24 °C), while in Burbank, approximately 10 miles (16 km) inland, the average high in August is 95 °F (35 °C); a temperature gain over one degree per mile. Northwestern California has a temperate climate with rainfall of 15 inches (380 mm) to 50 inches (1,300 mm) per year. Some areas of Coast Redwood forest receive over 100 inches (2,500 mm) of precipitation per year."}]