[{"url": "http://asia.isp.msu.edu/wbwoa/southeast_asia/malaysia/religion.htm", "passage_text": "Malaysia is a multi-ethnic society and as such, has a variety of major religions which occupy an important place in the daily life of its citizens. The country is officially an Islamic nation and Islam is the state religion of Malaysia. The tolerance and acceptance of a variety of religions is clearly shown in the calendar of national holidays in Malaysia in which the most important celebrations of the 4 major traditions are all national holidays."}, {"url": "https://en.wikipedia.org/wiki/Islam_in_Malaysia", "passage_text": "Islam in Malaysia is thus closely associated with the Malay people, something an Islamic scholar has criticised, saying that Malaysian Islam is still clothed in communal garb; that Muslims in Malaysia have yet to understand what the universal spirit of Islam means in reality. As of 2013, there were approximately 19.5 million Muslim adherents, or 61.3% of the population. Islam in Malaysia is represented by the Shafi'i version of Sunni theology and jurisprudence. Islam was introduced by traders arriving from Arabia, China and India. It became firmly established in the 15th century."}, {"url": "http://www.frontpagemag.com/fpm/47167/malaysia-and-myth-islamic-tolerance-rich-trzupek", "passage_text": "In Malaysia, as in most of the Muslim of the world, Allah simply means God, the same God that, according to the Quran itself, both Christians and Jews worship. Nonetheless, use of the word Allah among non-Muslims has long been prohibited by law in Malaysia. The ruling class, the bumiputra (literally “princes of the earth”) are largely, though not entirely, Muslim. But when Malaysia’s High Court ruled in late December to lift a government ban on non-Muslims using the word “Allah,” Christian churches became the targets of fire-bombing attacks."}, {"url": "http://asia.isp.msu.edu/wbwoa/southeast_asia/malaysia/religion.htm", "passage_text": "Almost all Malays, the dominant ethnic group in the country, are Muslims and, because Malaysia is an Islamic state, many Muslim schools, mosques, and religious organizations are supported by the state. The tolerance and acceptance of a variety of religions is clearly shown in the calendar of national holidays in Malaysia in which the most important celebrations of the 4 major traditions are all national holidays."}, {"url": "http://www.loyarburok.com/2012/08/01/we-are-entitled-malay-muslim/", "passage_text": "Brother, this is what the Muslims in Malaysia should be sharing, educating the Muslims in this country of their rich religion rather than imposing laws to curtail others right and freedom. I have been to singapore where a Malay Muslim women was sitting with non-Malays during lunch break. Malay-Muslims are entitled not to have a Hindu temple in the vicinity of their housing estate. Malay-Muslims are entitled to dictate what names others may use to invoke the Creator."}, {"url": "http://www.itc.gov.my/tourists/discover-the-muslim-friendly-malaysia/islam-in-malaysia/", "passage_text": "Islam in Malaysia. Malaysia is a multiracial country with a population that currently stands at 28 million, of which approximately 60 percent are Muslims. Islam is constitutionally the country’s official religion, with the freedom to practise other religions. The Shariah Law in Malaysia is only applicable to Muslims and is used to resolve conflicts relating to creed and family matters. Malaysian Muslims generally follow the Shafi’e school of thought. Mosques are part of the ordinary scene in Malaysia and are as much a cultural icon as a religious one."}, {"url": "https://en.wikipedia.org/wiki/Religion_in_Malaysia", "passage_text": "The constitution makes Malaysia a secular country and guarantees freedom of religion, while establishing Islam as the religion of the Federation to symbolize its importance to Malaysian society. Per Article 160 of the Constitution of Malaysia one must be Muslim to be considered Malay. In practice, Muslims cannot convert to another religion due to the Shari'a courts denying conversion claims, and if a Malay did convert they would lose their status as bumiputera."}, {"url": "https://en.wikipedia.org/wiki/Islam_in_Malaysia", "passage_text": "Malaysia is a multiconfessional country whose most professed religion is Islam. As of 2013, there were approximately 19.5 million Muslim adherents, or 61.3% of the population. Islam in Malaysia is represented by the Shafi'i version of Sunni theology and jurisprudence. Islam was introduced by traders arriving from Arabia, China and India. It became firmly established in the 15th century."}, {"url": "https://en.wikipedia.org/wiki/Religion_in_Malaysia", "passage_text": "Malaysia is a multicultural and multiconfessional country. As of the 2010 Population and Housing Census, 61.3 percent of the population practices Islam; 19.8 percent Buddhism; 9.2 percent Christianity; 6.3 percent Hinduism; and 1.3 percent traditional Chinese religions. Per Article 160 of the Constitution of Malaysia one must be Muslim to be considered Malay. In practice, Muslims cannot convert to another religion due to the Shari'a courts denying conversion claims, and if a Malay did convert they would lose their status as bumiputera."}, {"url": "http://asia.isp.msu.edu/wbwoa/southeast_asia/malaysia/religion.htm", "passage_text": "Malaysia also has a state supported system to help Muslim fund the Hajj or pilgrimage to Mecca. The administration of the Malaysian Hajj group is done by the Pilgrim Management and Fund Board. The tolerance and acceptance of a variety of religions is clearly shown in the calendar of national holidays in Malaysia in which the most important celebrations of the 4 major traditions are all national holidays."}]