[{"url": "http://www.whataboutwatermelon.com/index.php/2014/04/second-slice-how-long-will-my-watermelon-last/", "passage_text": "Here’s the kicker: Researchers have found that whole watermelons stored outside the fridge in a cool, dark place (around 55 or 60 degrees) last much longer than watermelons stored in the fridge (around 41 degrees). So, if you’ve already got a whole watermelon in the fridge, you should keep it there. Great question, David. First of all, there’s no such thing as “too much watermelon.” Second, there are so many things you can do with those leftovers, but that’s a subject for another day. To answer your question, if the watermelon has already been cut, it should be okay in the fridge for three or four days. While it’s in there, keep it in a container (if it’s cubed) or place plastic wrap over the exposed edg"}, {"url": "http://www.fromkarenskitchen.com/tips/handling_storing_watermelon.php", "passage_text": "Cover cut watermelon and store in the refrigerator. Once the watermelon has been cut, cover the cut side with two pieces of plastic wrap tightly secured in a criss-cross pattern. Place in the refrigerate with cut side up, to prevent juices from escaping or place covered cut side down on a plate. Store uncut watermelons at room temperature. Store uncut watermelon at 55°F to 70°F (13°C to 21°C). Whole melons will keep for two weeks at 60°F (16°C), 7 to 10 days at average room temperature and up to a week in hot weather. Store it too long, and it will lose flavor and textur"}, {"url": "http://www.answers.com/Q/How_long_can_a_watermelon_stay_fresh_in_a_refrigerator", "passage_text": "Melons do not last long once they become ripe. A whole uncut melon will stay good for 5 to 7 days. If the melon is cut it will last only 3 days. + 13 others found this useful. "}, {"url": "http://www.eatbydate.com/fruits/fresh/watermelon/", "passage_text": "1 Day. 3-5 Days. Of course, all foods last for a shorter period of time if they are not stored properly. But remember, watermelon, like a lot of other fresh fruits, usually does not have a use by date or a best before date so you will have to use the date purchased or date picked. Watermelon shelf can be extended by keeping it in the refrigerator, but be sure to keep it furthest from your freezer section or it may freeze. Watermelon does not freeze well, it becomes dark red and when you cut it open the juices just flow out... leaving a pretty empty rind!"}, {"url": "http://www.whataboutwatermelon.com/index.php/2009/05/ask-the-experts-how-long-will-my-watermelon-last/", "passage_text": "First of all, there’s no such thing as “too much watermelon.” Second, there are so many things you can do with those leftovers, but that’s a subject for another day. To answer your question, if the watermelon has already been cut, it should be okay in the fridge for 3 or 4 days. While it’s in there, keep it in a container (if it’s cubed) or place plastic wrap over the exposed edge. So, if you’ve already got a whole watermelon in the fridge, you should keep it there. But if you’re storing it outside the fridge, put it in the fridge about three hours before you plan to eat it in order to cool it down to just the right temperature."}, {"url": "http://en.allexperts.com/q/Food-Safety-Issues-767/half-watermelon-long-keep.htm", "passage_text": "Generally, cut watermelon needs to be used within 3-4 days as it will start to sour and soften after 4-5 days. A colder refrigerator (34-36 degrees) will prolong this from happening but you should plan to use the watermelon within 3-4 days of cutting. You can freeze watermelon in small chunks. "}, {"url": "http://www.whataboutwatermelon.com/index.php/2009/05/ask-the-experts-how-long-will-my-watermelon-last/", "passage_text": "“Here’s the kicker: Researchers have found that whole watermelons stored outside the fridge in a cool, dark place (around 55 or 60 degrees) last much longer than watermelons stored in the fridge (around 41 degrees). So, if you’ve already got a whole watermelon in the fridge, you should keep it there. But if you’re storing it outside the fridge, put it in the fridge about three hours before you plan to eat it in order to cool it down to just the right temperature."}, {"url": "https://www.washingtonpost.com/lifestyle/food/chat-leftovers-how-long-to-store-melons/2013/09/11/c49d7790-1aa0-11e3-a628-7e6dde8f889d_story.html", "passage_text": "But how long can you keep it before it reaches the yucky point of no return? That depends a lot on whether you’ve cut it up or not. A whole, uncut cantaloupe or honeydew melon should last for seven to 10 days in the refrigerator. A whole, uncut watermelon is even sturdier: It should be good for two weeks. The picture gets somewhat bleaker once you’ve sliced into your fruit. "}]