[{"url": "http://www.history.com/topics/cold-war/formation-of-nato-and-warsaw-pact", "passage_text": "West Germany formally joined NATO on May 5, 1955, and the Warsaw Pact was signed less than two weeks later, on May 14. Joining the USSR in the alliance were Albania, Bulgaria, Czechoslovakia, the German Democratic Republic (East Germany), Hungary, Poland and Romania. Warsaw Pact: The Communist Alliance. The formation of the Warsaw Pact was in some ways a response to the creation of NATO, although it did not occur until six years after the Western alliance came into being. It was more directly inspired by the rearming of West Germany and its admission into NATO in 1955."}, {"url": "http://coldwarevents.wikispaces.com/NATO+and+the+Warsaw+Pact", "passage_text": "The North Atlantic Treaty Organization, or better known as NATO, is a mutual defense alliance that was signed on April 4, 1949. NATO started with 12 core countries: Belgium, Canada, Denmark, France, Iceland, Italy, Luxembourg, The Netherlands, Norway, Portugal, The United Kingdom, and The United States. The Warsaw pact was a response to NATO (The North Atlantic Treaty Organization), the treaty made by the Western Allies in 1949. As well as the re-militarization of West Germany in 1954, both threats to the Eastern countries. The Warsaw Pact quickly rapidly became a powerful political tool for the Soviet Union"}, {"url": "http://www.answers.com/Q/What_do_all_of_the_Warsaw_Pact_countries_have_in_common", "passage_text": "The Warsaw Pact no longer exists. It was an alliance of the Eastern Bloc countries, established in 1955 by the Soviet Union as a counterpart to NATO. It is not war saw, but Warsaw. In response to the birth of the NATO, the Communist countries of Europe signed a treaty of mutual defense and military aid in May 1955. Member of the Warsaw Pact were Soviet Union, Albania, Bulgaria,  Czechoslovakia, East Germany, Hungary, Poland, and Romania."}, {"url": "http://www.history.com/topics/cold-war/formation-of-nato-and-warsaw-pact", "passage_text": "Introduction. In 1949, the prospect of further Communist expansion prompted the United States and 11 other Western nations to form the North Atlantic Treaty Organization (NATO). The Soviet Union and its affiliated Communist nations in Eastern Europe founded a rival alliance, the Warsaw Pact, in 1955. Warsaw Pact: The Communist Alliance. The formation of the Warsaw Pact was in some ways a response to the creation of NATO, although it did not occur until six years after the Western alliance came into being. It was more directly inspired by the rearming of West Germany and its admission into NATO in 1955."}, {"url": "http://www.answers.com/Q/What_did_NATO_and_the_warsaw_pact_have_in_common", "passage_text": "The NATO countries and Warsaw Pact countries were effectively  divided by the Iron Curtain of the Cold War. Turkey, West Germany,  and Greece are NATO countries bordering th … e Warsaw Pact countries  of the Soviet Union, Bulgaria, Albania, East Germany, and  Czechoslovakia. It was formed to defend Western Europe against the USSR. … The Warsaw Pact was the USSR's response to NATO. It was similarly an alliance of nations and was made of the USSR and the Communist Eastern European countries it occupied."}, {"url": "http://coldwarevents.wikispaces.com/NATO+and+the+Warsaw+Pact", "passage_text": "Later the Warsaw pact dissolved in 1991. The treaty was given to Bulgaria, East Germany, Albania, Hungary, Czechoslovakia, Poland, Romania and the Soviet Union in response to West Germany joining NATO. The Warsaw pact was a response to NATO (The North Atlantic Treaty Organization), the treaty made by the Western Allies in 1949. As well as the re-militarization of West Germany in 1954, both threats to the Eastern countries. The Warsaw Pact quickly rapidly became a powerful political tool for the Soviet Union"}, {"url": "http://www.answers.com/Q/What_do_all_of_the_Warsaw_Pact_countries_have_in_common", "passage_text": "A military alliance of communist nations in eastern Europe. Organized in 1955 in answer to NATO, the Warsaw Pact included Albania, Bulgaria, Czechoslovakia, East Germany, Hung … ary, Poland, Romania, and the Soviet Union. It disintegrated in 1991, in the wake of the collapse of communism in eastern Europe and the Soviet Union. Member of the Warsaw Pact were Soviet Union, Albania, Bulgaria,  Czechoslovakia, East Germany, Hungary, Poland, and Romania."}, {"url": "http://www.local-life.com/warsaw/articles/warsaw-pact", "passage_text": "The Warsaw Pact. The Warsaw Pact is the name commonly given to the treaty between Albania, Bulgaria, Czechoslovakia, East Germany, Hungary, Poland, Romania, and the Soviet Union, which was signed in Poland in 1955 and was officially called 'The Treaty of Friendship, Co-operation and Mutual Assistance'. "}, {"url": "http://www.answers.com/Q/What_did_NATO_and_the_warsaw_pact_have_in_common", "passage_text": "The purpose of the NATO, aka North Atlantic Treaty Organization, was to form a union of European and North American countries against the communist Warsaw Pact nations of East … ern Europe and the Soviet Union. It was formed to defend Western Europe against the USSR. … The Warsaw Pact was the USSR's response to NATO. It was similarly an alliance of nations and was made of the USSR and the Communist Eastern European countries it occupied."}]