[{"url": "http://www.dol.gov/_sec/media/reports/dunlop/section5.htm", "passage_text": "1. As employers seek new ways to make the employment relationship more flexible, they have increasingly relied on a variety of arrangements popularly known as contingent work.. The use of independent contractors and part-time, temporary, seasonal, and leased workers has expanded tremendously in recent years. V. Contingent Workers"}, {"url": "http://www.skilledup.com/insights/longer-just-temp-rise-contingent-worker", "passage_text": "1 32 percent of the average company’s workforce fell into the contingent or contract-based category. 2  By 2017, contingent workers, including independent contractors, statement-of-work-based labor and freelancers, will account for nearly 45 percent of the world’s total workforce. Fundamentally, a contingent worker is temporary and not deemed to be a full-time employee of the company, says Debra Bergevine, chief marketing officer at DCR Workforce, which underwrote the Ardent Partners report and provides businesses with contingent workforce management solutions."}, {"url": "http://www.hrhero.com/hl/articles/2008/09/26/risks-benefits-of-using-contingent-workers/", "passage_text": "Many employers use contingent workers: independent contractors, leased employees, consultants, and temporary employees. While using an alternative workforce has benefits, it can create legal and practical risks as well. If you use or are considering using contingent workers, here are some benefits and risks to weigh. Although the specific benefits vary from case to case, some of the more common benefits include: 1  Cost savings. 2  Increased efficiency. 3  Administrative savings. 4  Better job security. 5  Recruiting opportunities. 6  Broad talent pool. 7  Flexibility."}, {"url": "http://gao.gov/products/GAO-15-168R", "passage_text": "Earnings, benefits, and measures of poverty of contingent workers also differ from those of standard full-time workers. Contingent work can be unstable, or may afford fewer worker protections than standard work, depending on a worker’s particular employment arrangement. This report examines what is known about (1) the size of the contingent workforce, (2) the characteristics and employment experiences of contingent versus standard workers, and (3) any differences in earnings, benefits, and measures of poverty between contingent and standard workers."}, {"url": "http://www.hrhero.com/hl/articles/2008/09/26/risks-benefits-of-using-contingent-workers/", "passage_text": "Practical risks of contingent workers Many employers become so overwhelmed by the potential benefits of using contingent workers that they don’t recognize the legal and practical risks. Again, although the risks vary from case to case, some of the more common practical risks include: Although the specific benefits vary from case to case, some of the more common benefits include: 1  Cost savings. 2  Increased efficiency. 3  Administrative savings. 4  Better job security. 5  Recruiting opportunities. 6  Broad talent pool. 7  Flexibility."}, {"url": "http://gao.gov/products/GAO-15-168R", "passage_text": "In the aftermath of the recent recession (2007-2009), more workers may have become contingent workers with potentially limited access to work-provided benefits as well as coverage under key workforce protection laws. In light of these developments, GAO was asked to examine issues related to the contingent workforce. This report examines what is known about (1) the size of the contingent workforce, (2) the characteristics and employment experiences of contingent versus standard workers, and (3) any differences in earnings, benefits, and measures of poverty between contingent and standard workers."}, {"url": "http://www.skilledup.com/insights/longer-just-temp-rise-contingent-worker", "passage_text": "Contingent workers can be characterized as temporary employees — they are not full-time employees of a company and once their project is finished, they are gone. To label them mere temps, however, discounts the full scope, high-tech nature and complexity of today’s contingent or “on-demand” workforce. Fundamentally, a contingent worker is temporary and not deemed to be a full-time employee of the company, says Debra Bergevine, chief marketing officer at DCR Workforce, which underwrote the Ardent Partners report and provides businesses with contingent workforce management solutions."}, {"url": "http://www.referenceforbusiness.com/management/Comp-De/Contingent-Workers.html", "passage_text": "CONTINGENT WORKERS. Photo by: Kurhan. As a category, contingent workers may include temporary employees, part-time employees, independent contract workers, employees of the temporary help industry (temps), consultants, seasonal employees, and interns. In contrast, full-time, permanent employees frequently are referred to as core employees. Contingent workers often are less expensive in terms of salary and benefits (most contingent workers receive no benefits). Additionally, many contingent workers are already trained, and therefore the company does not need to spend money on additional training."}, {"url": "http://www.hrhero.com/hl/articles/2008/09/26/risks-benefits-of-using-contingent-workers/", "passage_text": "Benefits of contingent workers. There are many potential benefits to using contingent workers. Although the specific benefits vary from case to case, some of the more common benefits include: 1  Cost savings. 2  Perhaps the most significant motivation for using workers such as independent contractors and temps is cost savings. Although the specific benefits vary from case to case, some of the more common benefits include: 1  Cost savings. 2  Increased efficiency. 3  Administrative savings. 4  Better job security. 5  Recruiting opportunities. 6  Broad talent pool. 7  Flexibility."}]