[{"url": "https://answers.yahoo.com/question/index?qid=20080317140951AADbm0m", "passage_text": "Rating Newest Oldest. Best Answer: Here's how I hard boil eggs and it works every time. Put your eggs in a pot, add water to cover and a tablespoon to white vinegar (it helps the shell peel off easily). Bring the water up to a boil, put a lid on the pot, remove from the heat, and let sit for 10 minutes. They turn out perfect every time. Put eggs in cold water in a sauce pan with a lid. Bring to a boil. Turn heat off, and let the eggs sit in the hot water with the lid on, for 15 minutes. They will always be done. You can leave them in longer, if you want, and it won't hurt anything."}, {"url": "http://www.wikihow.com/Tell-If-Eggs-Are-Raw-or-Hard-Boiled", "passage_text": "1 If you're boiling the eggs in a small pot, you can add a few drops of food coloring and a few teaspoons of vinegar directly to the water as you boil. 2  Otherwise, boil the eggs first, then soak them in a mixture of 1/2 cup boiling water, 1 teaspoon vinegar, and a few drops of food coloring afterward. 1 If the egg stays still, it is a hard boiled egg. 2  If the egg continues to slowly rotate or wobble it is uncooked. 3  This is because the liquid white and yolk are still spinning inside the shell. 4  The egg's center of gravity shifts as the liquid contents move around, causing the egg to keep moving"}, {"url": "http://www.ehow.com/how_2245243_tell-boiled-egg-done.html", "passage_text": "There are three different ways to boil an egg. Soft-cooked eggs have a runny yolk. The yolk for medium-cooked eggs is semirunny, and the yolk in hard-boiled eggs is completely cooked. No matter what method you use, the egg white, which should be completely cooked, will be firm. Instructions. Cool the egg after you boil it. Sit the larger, rounded end of the boiled egg on a counter top or a table. Spin the egg on the hard surface, the same way you would with a top. A hard-boiled egg will spin evenly and swiftly since the yolk is solid. An egg with a semi-cooked or uncooked yolk won't spin quickly and will move in another direction instead of spinning in one spot"}, {"url": "http://www.wikihow.com/Tell-When-an-Egg-Is-Boiled", "passage_text": "If you want to do this, turn the heat down slightly, to about medium, when the water reaches a boil, and start watching the clock. 1  For soft-boiled eggs, remove after 2 minutes. 2  For medium-boiled eggs, remove after 4 1/2 minutes. 3  For hard-boiled eggs, remove after 8 minutes. 1 For soft-boiled eggs, remove after 2 minutes. 2  The whites should be cooked thoroughly, and the yolks should still be somewhat runny. 3  Rinse immediately in cold water to stop the cooking process, or they'll become quickly over-done. 4"}, {"url": "https://answers.yahoo.com/question/index?qid=1006041221163", "passage_text": "Best Answer: I don't care how many you boil the key is to place the eggs in the pot and cover them with water. Bring to a boil. As soon as you get a full boil take the pot off the heat source (stove) and cover with a tight lid. Let them sit off the heat for 19 minutes and they will be done. You must cover the eggs completely with water before the boil. *** older eggs make the best hard boiled eggs. They are easier to peel if they are not fresh. Source(s): I learned this proper method to boil eggs years ago on a cooking show that featured eggs only. It works they are cooked everytime."}, {"url": "http://www.ehow.com/how_8047381_hard-boiled-eggs-done.html", "passage_text": "Place eggs in a pot in a single layer. Add enough water to fully cover the eggs with an inch of water above the tops of the eggs. Bring the eggs to a rapid boil over high heat. Remove the pan from the heat, cover it and let the eggs sit in the hot water for about 12 to 17 minutes depending on the size of the eggs. Large and extra-large eggs will need a few minutes more than small or medium eggs. "}, {"url": "http://www.simplyrecipes.com/recipes/how_to_make_perfect_hard_boiled_eggs/", "passage_text": "Depending on how cooked you like your hard boiled eggs, the eggs should be done perfectly in 10-12 minutes. That said, depending on your altitude, the shape of the pan, the size of the eggs, the ratio of water to eggs, it can take a few minutes more. If you need easy-to-peel eggs and you have fresh eggs, you might want to try steaming the eggs for 15 minutes. Pour an inch of water into a pot and insert a steamer basket.Bring to a boil. Place the eggs in the steamer basket, cover and steam for 15 minutes (more or less, check!)."}]