[{"url": "https://en.wikipedia.org/wiki/Data_flow_diagram", "passage_text": "Data flow diagram example. A data flow diagram (DFD) is a graphical representation of the flow of data through an information system, modelling its process aspects. A DFD is often used as a preliminary step to create an overview of the system, which can later be elaborated"}, {"url": "https://en.wikipedia.org/wiki/Process_Flow_diagram", "passage_text": "A process flow diagram (PFD) is a diagram commonly used in chemical and process engineering to indicate the general flow of plant processes and equipment. The PFD displays the relationship between major equipment of a plant facility and does not show minor details such as piping details and designations. "}, {"url": "http://infocenter.sybase.com/help/topic/com.sybase.infocenter.dc38088.1610/doc/html/rad1232026266129.html", "passage_text": "Data Flow Diagram (DFD). The. (DFD) is a graphical representation of the flow of data through an information system. It enables you to represent the processes in your information system from the viewpoint of data."}, {"url": "https://en.wikipedia.org/wiki/Flow_diagram", "passage_text": "The term flow diagram is used in theory and practice in different meanings. Most commonly the flow chart and flow diagram are used in an interchangeable way in the meaning of a representation of a process. In theory and practice specific types of diagrams are also called a type of flow diagrams, such as: 1  Alluvial diagram, highlights and summarizes the significant structural changes in networks. 2  Circular flow of income. 3  Control flow diagram, a diagram to describe the control flow of a business process, process or program."}, {"url": "http://commons.wikimedia.org/wiki/Flow_diagram", "passage_text": "Flow diagram of production process, since 1870s. A process flow diagram (PFD) is a diagram commonly used in chemical and process engineering to indicate the general flow of plant processes and equipment. Flow diagram for the production of Ammonia. A flow diagram is a diagram representing some kind of flow. The most known is the flowchart, often also called flow diagram but there are more different kind of flow diagrams."}, {"url": "https://en.wikipedia.org/wiki/Flow_diagram", "passage_text": "Example of a flow diagram of a nuclear submarine propulsion system. Flow diagram is a collective term for a diagram representing a flow or set of dynamic relationships in a system. The term flow diagram is also used as synonym of the flowchart, and sometimes as counterpart of the flowchart. Flow diagrams are used to structure and order a complex system, or to reveal the underlying structure of the elements and their interaction. In theory and practice specific types of diagrams are also called a type of flow diagrams, such as: 1  Alluvial diagram, highlights and summarizes the significant structural changes in networks. 2  Circular flow of income. 3  Control flow diagram, a diagram to describe the control flow of a business process, process or program."}, {"url": "http://www.rff.com/process-flow-diagrams.htm", "passage_text": "Process flow diagrams (PFDs) are used in chemical and process engineering. These diagrams show the flow of chemicals and the equipment involved in the process. Generally, a Process Flow Diagram shows only the major equipment and doesn't show details. PFDs are used for visitor information and new employee training."}]