[{"url": "http://www.twist25.com/", "passage_text": "TWIST 25 DHEA CREAM NATURALLY MAINTAINS YOUTHFUL VIGOR. Twist 25 is highly absorbable bioidentical DHEA cream made with coconut oil, coenzyme Q-10 and Vitamin E. Twist 25 is the best DHEA made with superior quality ingredients in a uniquely formulated and tested cream. More answers to frequently asked questions. Twist 25 DHEA cream is the best bioidentical DHEA supplement cream made. Twist 25 DHEA cream helps maintain hormones naturally. Sleep better at night, have energy and drive during the day, fight menopause and depression. Improve health to feel your best and look your best"}, {"url": "http://www.onelifeusa.com/Ingredients/DHEA%20Supplement%20Facts.htm", "passage_text": "Ingredient Detail Description: DHEA-DHEA is a hormone produced by the adrenal glands and is used by the body as the staring material for testosterone and estrogen. The body makes its own DHEA, however, by age 60 makes only 5-15% of what it did at age 20. For use as a supplement, DHEA is manufactured from substances found in soybeans."}, {"url": "http://www.lifeextension.com/Vitamins-Supplements/item00335/DHEA-Dehydroepiandrosterone", "passage_text": "Supplement Facts Serving Size 1 capsule Amount Per Serving Dehydroepiandrosterone (DHEA) 25 mg Other ingredients: microcrystalline cellulose, gelatin, silica.Non-GMO Dosage and Use The exact number of capsules to be taken should be determined by blood testing and the advice of a physician. "}, {"url": "http://www.twist25.com/faq.php", "passage_text": "Frequently Asked Questions (FAQ) about DHEA Cream. Twist 25 cream is the highest quality DHEA cream possible, made with select pharmaceutical grade ingredients in a carefully engineered cream base. The present formulation of Twist 25 is the result of years of testing and refinement. "}, {"url": "https://hormonesolutionscenter.com/product/dhea-cream-for-women/", "passage_text": "DHEA is also converted by the body to testosterone, as needed. The ingredients found within DHEA Cream for Women are natural compounds derived from all natural resources. Suggested use: Women apply 1/4 teaspoon cream into hairless areas such as abdomen, shoulders or the underside of arms."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-331-DHEA.aspx?activeIngredientId=331&activeIngredientName=DHEA", "passage_text": "1 Withdrawal symptoms. 2  Early research shows that taking 100 mg of DHEA daily together with standard therapy for 12 months does not improve symptoms of drug withdrawal in people addicted to heroin. 3  Taking 100 mg of DHEA daily for 12 weeks also did not improve symptoms of cocaine withdrawal. 1 For treatment of schizophrenia: Increasing doses of DHEA of 25 mg daily for 2 weeks, 25 mg two times daily for 2 weeks, and 50 mg two times daily for 2 weeks. 2  For replacement of hormones when the adrenal glands are not working well (androgen deficiency): 25-50 mg given daily as a single dose."}, {"url": "http://www.eternity-medicine.com/english/04_eternity_medicine_products/DHEA/dhea_ingredients.htm", "passage_text": "DHEA 7 Keto. Ingredients 3-beta-acetoxyarost-5-en-7, 17 dione (7-keto DHEA), rice powder, gelatin, magnesium stearate. Discussion 7-keto DHEA is a potent natural metabolite of DHEA. 7-keto DHEA is found naturally within the body, but will not convert into androgens or estrogens. Animal and in-vitro studies indicate that 7-keto is more potent than DHEA for enhancing the immune system and increasing memory retention. Hypoallergenic These capsules are formulated to be as hypoallergenic as possible."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-331-DHEA.aspx?activeIngredientId=331&activeIngredientName=DHEA", "passage_text": "DHEA is a “parent hormone” produced by the adrenal glands near the kidneys and in the liver. In men, DHEA is also secreted by the testes. It is changed in the body to a hormone called androstenedione. Androstenedione is then changed into the major male and female hormones. 1 For treatment of schizophrenia: Increasing doses of DHEA of 25 mg daily for 2 weeks, 25 mg two times daily for 2 weeks, and 50 mg two times daily for 2 weeks. 2  For replacement of hormones when the adrenal glands are not working well (androgen deficiency): 25-50 mg given daily as a single dose."}]