[{"url": "http://textbookofbacteriology.net/Bacillus_2.html", "passage_text": "Capsules The capsules of many bacilli, including B. anthracis, B. subtilis, B. megaterium, and B. licheniformis, contain poly-D- or L-glutamic acid. Other Bacillus species, e.g., B. circulans, B. megaterium, B. mycoides and B. pumilus, produce carbohydrate capsules. Structure of the muropeptide subunit of the peptidoglycan of Bacillus megaterium. In most Bacillus species, an interpeptide bridge that connects D-alanine to meso-diaminopimelic acid (DAP) is absent. In addition, all Bacillus spores contain this type of muramic acid subunit in the spore cortex."}, {"url": "https://en.wikipedia.org/wiki/Bacillus_megaterium", "passage_text": "From Wikipedia, the free encyclopedia. Bacillus megaterium is a rod-like, Gram-positive, mainly aerobic spore forming bacterium found in widely diverse habitats. With a cell length of up to 4 µm and a diameter of 1.5 µm, B. megaterium is amongst the biggest known bacteria. The cells often occur in pairs and chains, where the cells are joined together by polysaccharides on the cell walls. In the 1960s, prior to the development of Bacillus subtilis, B. megaterium was the main model organism among Gram-positive bacteria for intensive studies on biochemistry, sporulation and bacteriophages. B. megaterium grows at temperatures from 3 °C to 45 °C, with the optimum around 30 °C. Some isolates from an Antarctic geothermal lake were found to grow at temperatures up to 63 °C. B. megaterium has been recognized as an endophyte and is a potential agent for the biocontrol of plant diseases."}, {"url": "https://en.wikipedia.org/wiki/Bacillus_megaterium", "passage_text": "Bacillus megaterium is a rod-like, Gram-positive, mainly aerobic spore forming bacterium found in widely diverse habitats. B. megaterium grows at temperatures from 3 °C to 45 °C, with the optimum around 30 °C. Some isolates from an Antarctic geothermal lake were found to grow at temperatures up to 63 °C. B. megaterium has been recognized as an endophyte and is a potential agent for the biocontrol of plant diseases."}, {"url": "http://ppdictionary.com/bacteria/gpbac/cereus.htm", "passage_text": "Bacillus cereus. Overview: Bacillus cereus is a Gram-positive, spore-forming, rod-shaped, facultative anaerobic bacterium belonging to the Bacillaceae family of the Firmicutes (Figure 1). Most strains of B. cereus are motile, while only 4% are found to be non-motile. Like other members of the genus Bacillus, B. cereus can produce protective endospores. An endospore is a dormant, tough, and non-reproductive structure produced by certain bacteria from the Firmicute phylum. They are typically located at cells' centre and contain hydrophobic appendages."}, {"url": "https://microbewiki.kenyon.edu/index.php/Bacillus_megaterium", "passage_text": "Bacillus megaterium is a gram positive, endospore forming, rod shaped bacteria. It is considered aerobic. It is found in soil and considered a saprophyte. B. megaterium has often been used in the laboratory, and is used as an industrial organism that is able to produce a variety of proteins and sources of bioremediation. Bacillus megaterium is a good source of industrial proteins because it is both a desirable cloning host and produces a large variation of enzymes."}, {"url": "http://textbookofbacteriology.net/Bacillus_2.html", "passage_text": "The capsule is not synthesized by the closest relatives of B. anthracis, i.e., B. cereus and B. thuringiensis, and this criterion can be used to distinguish the species. Cell Walls The variability of cell wall structure that is common in many Gram-positive bacteria does not occur in the genus Bacillus. Structure of the muropeptide subunit of the peptidoglycan of Bacillus megaterium. In most Bacillus species, an interpeptide bridge that connects D-alanine to meso-diaminopimelic acid (DAP) is absent. In addition, all Bacillus spores contain this type of muramic acid subunit in the spore cortex."}, {"url": "https://en.wikipedia.org/wiki/Bacillus_subtilis", "passage_text": "A member of the genus Bacillus, B. subtilis is rod-shaped, and can form a tough, protective endospore, allowing it to tolerate extreme environmental conditions. B. subtilis has historically been classified as an obligate aerobe, though evidence exists that it is a facultative aerobe. As other members of the genus Bacillus, it can form an endospore, to survive extreme environmental conditions of temperature and desiccation. B. subtilis is a facultative anaerobe and had been considered as an obligate aerobe until 1998."}, {"url": "https://en.wikipedia.org/wiki/Bacillus_subtilis", "passage_text": "B. subtilis cells are typically rod-shaped, and are about 4-10 micrometers (μm) long and 0.25–1.0 μm in diameter, with a cell volume of about 4.6 fL at stationary phase. As other members of the genus Bacillus, it can form an endospore, to survive extreme environmental conditions of temperature and desiccation. B. subtilis is a facultative anaerobe and had been considered as an obligate aerobe until 1998."}, {"url": "https://microbewiki.kenyon.edu/index.php/Bacillus_megaterium", "passage_text": "Description and significance. Bacillus megaterium is a gram positive, endospore forming, rod shaped bacteria. It is considered aerobic. It is found in soil and considered a saprophyte. Bacillus megaterium is latin for the big beast because it is an extremely large bacteria, it is about 100 times as large as E. coli. Due to its immense size, about 60 micrometers cubed, B. megaterium has been used to study structure, protein localization and membranes of bacteria since the 1950’s. B. megaterium has often been used in the laboratory, and is used as an industrial organism that is able to produce a variety of proteins and sources of bioremediation. Bacillus megaterium is a good source of industrial proteins because it is both a desirable cloning host and produces a large variation of enzymes."}, {"url": "https://en.wikipedia.org/wiki/Bacillus_subtilis", "passage_text": "From Wikipedia, the free encyclopedia. Bacillus subtilis, known also as the hay bacillus or grass bacillus, is a Gram-positive, catalase-positive bacterium, found in soil and the gastrointestinal tract of ruminants and humans. As other members of the genus Bacillus, it can form an endospore, to survive extreme environmental conditions of temperature and desiccation. B. subtilis is a facultative anaerobe and had been considered as an obligate aerobe until 1998."}]