[{"url": "http://www.answers.com/Q/What_is_the_difference_between_sidereal_period_of_the_moon_and_synodic_period", "passage_text": "Synodic period relates to an object's position relative to the sun. So the cycle which goes from full moon to full moon is a synodic cycle. A sidereal period is sometimes called a 'star day'. It relates to an object's position relative to the distant stars."}, {"url": "http://www.differencebetween.net/science/difference-between-sidereal-and-synodic/", "passage_text": "Sidereal vs Synodic. Sidereal and synodic are related to the period of bodies in orbit. “Sidereal” can be defined as the time required for one period to repeat in relation to stars. On the contrary, “synodic” can be defined as the time required for one period to repeat in relation to a solar body."}, {"url": "https://answers.yahoo.com/question/index?qid=20100119132943AAyqmXr", "passage_text": "Best Answer: The synodic period is the temporal interval that it takes for an object to reappear at the same point in relation to two other objects (linear nodes), i.e. the Moon relative to the Sun as observed from Earth returns to the same illumination phase."}, {"url": "http://www.differencebetween.net/science/difference-between-sidereal-and-synodic/", "passage_text": "Summary: 1.A synodic period can be defined as the position of objects with respect to the sun. 2.A sidereal period is defined as the position of an object with respect to the stars. 3.When a synodic month lasts 29 days, 12 hours, and 44 minutes, a sidereal month lasts 27 days, 7 hours, and 43 minutes."}, {"url": "http://www.differencebetween.net/science/difference-between-sidereal-and-synodic/", "passage_text": "A sidereal period is also defined as the position of an object with respect to the stars. The synodic month is a bit longer than the sidereal month. When a synodic month lasts 29 days, 12 hours, and 44 minutes, a sidereal month lasts 27 days, 7 hours, and 43 minutes."}, {"url": "http://www.differencebetween.com/difference-between-sidereal-and-vs-synodic/", "passage_text": "Sidereal and Synodic are to be understood as two different terms used in astronomy with significant difference between them. In fact, both of them are related to the period of bodies in orbit. Sidereal is nothing but the time required for the stars to complete a period."}, {"url": "https://answers.yahoo.com/question/index?qid=20100119132943AAyqmXr", "passage_text": "The synodic period differs from the sidereal period due to the Earth orbit around the Sun, with one less synodic period than lunar orbit per solar orbit. The sidereal period is the temporal cycle that it takes an object to make one full orbit around the Sun, relative to the stars."}, {"url": "http://community.dur.ac.uk/john.lucey/users/lunar_sid_syn.html", "passage_text": "Lunar Sidereal and Synodic Periods. The Moon's sidereal orbital period (the sidereal month) is ~27.3 days; this is the time interval that the Moon takes to orbit 360° around the Earth relative to the fixed stars. The period of the lunar phases (the synodic month), e.g. the full moon to full moon period, is longer at ~29.5 days."}]