[{"url": "https://en.wikipedia.org/wiki/Armadillo", "passage_text": "Armadillos are New World placental mammals with a leathery armour shell. Dasypodidae is the only surviving family in the order Cingulata, part of the superorder Xenarthra, along with the anteaters and sloths. The word armadillo means little armoured one in Spanish. "}, {"url": "http://animalkingdom.net/2010/08/08/mammals/mammals/", "passage_text": "If you are reading this, there is a very good chance you are a mammal. More specifically, you are a probably a primate of the human family. The term mammal comes from the fact that female mammals have mammary glands that produce milk to feed their young offspring. Mammals are warm-blooded, air-breathing animals that have hair or fur on their body."}, {"url": "http://animals.mom.me/examples-marsupial-mammals-5782.html", "passage_text": "Examples of Marsupial Mammals. Marsupial females carry their young in a pouch. Tom Brakefield/Stockbyte/Getty Images. The most well-known defining feature of marsupial mammals are the females' pouches. They give birth to live offspring, but with significantly shorter gestation periods than placental mammals. Offspring are born as not much more than embryos. Opossums. Opossums are the only marsupial mammals indigenous to North America. Mothers carry their young in the pouch until they're 2 to 3 months old, then they continue carrying offspring around on their backs for about another month or two whenever they venture out of their den."}, {"url": "http://www.factmonster.com/dk/encyclopedia/mammals.html", "passage_text": "HIBERNATION. PRIMATES. RODENTS. MARSUPIALS. MONOTREMES. FIND OUT MORE. A group of warm-blooded animals with a bony skeleton, mammals include mice and other RODENTS, PRIMATES, such as monkeys and humans, and animals as various as hippos, deer, and cats. The 4,500 or so species include elephants, the largest creatures on land, and whales, the largest of all animals on Earth"}, {"url": "http://animalkingdom.net/2010/08/08/mammals/mammals/", "passage_text": "Monotremes, such as the platypus, are unusual mammals in that they lay eggs to give birth to their young. There are approximately 5,400 species of mammals on Earth, divided into 153 families of animals. More specifically, you are a probably a primate of the human family. The term mammal comes from the fact that female mammals have mammary glands that produce milk to feed their young offspring. Mammals are warm-blooded, air-breathing animals that have hair or fur on their body."}, {"url": "http://www.english-online.at/biology/mammals/world-of-mammals.htm", "passage_text": "Mammals. A mammal is an animal that feeds its babies with milk when it is young. There are over 4,500 types of mammals. Many of the most popular animals we know are mammals, for example, dogs, cats, horses, cows, but exotic animals like kangaroos, giraffes, elephants and anteaters belong to this group, too. Humans are also mammals. Mammals live in all regions and climates"}, {"url": "http://www.factmonster.com/dk/encyclopedia/mammals.html", "passage_text": "In some mammal species, males establish breeding territories, where they put on displays for the females, showing that they are healthy and strong. In others, the males fight for the right to mate. Many male hoofed mammals have horns or antlers, which they crash or lock together in tests of strength. MARSUPIALS. MONOTREMES. FIND OUT MORE. A group of warm-blooded animals with a bony skeleton, mammals include mice and other RODENTS, PRIMATES, such as monkeys and humans, and animals as various as hippos, deer, and cats."}, {"url": "http://www.answers.com/Q/What_kind_of_mammals_carry_offspring_to_term_insaid_the_body", "passage_text": "These animals use two different methods of insuring that enough of their offspring survive to reach maturity and reproduce. Most fish produce large numbers of offspring that … are often left to fend for themselves. Mammals care for and protect their young. They can have fewer offspring because the parents invest more time energy and often training to insure a higher survival rate. Mammals of different species are unable to produce offspring. For example a cat and a dog. Also hybrids are sterile. Example a liger, cross between a tiger and a lion. Edit. Share to: Answered."}, {"url": "http://animalkingdom.net/2010/08/08/mammals/mammals/", "passage_text": "There are three main classes of mammals: placentals, marsupials and monotremes. Most mammals give birth to live young using a placenta to carry the baby during gestation (i.e., placentals). Marsupials have a pouch in which females carry their young through early infancy. More specifically, you are a probably a primate of the human family. The term mammal comes from the fact that female mammals have mammary glands that produce milk to feed their young offspring. Mammals are warm-blooded, air-breathing animals that have hair or fur on their body."}, {"url": "http://anthro.palomar.edu/animal/animal_5.htm", "passage_text": "Members of the subclass Prototheria lay eggs like most non-mammalian vertebrates. However, they feed their newborn with mammary gland secretions like all other mammals. They lack nipples, but the skin over their mammary glands exude milk for their babies. "}]