[{"url": "http://www.moneycontrol.com/glossary/insurance/who-is-an-authorized-representative-ar_4205.html", "passage_text": "A policy holder who opens an e IA shall appoint an Authorized Representative (AR) who shall be entitled to access the account in the event of demise of the policy holder or in his incapacity to operate the e Insurance Account."}, {"url": "http://insurance.illinois.gov/ExternalReview/AuthRepF.pdf", "passage_text": "Illinois Department Appointment of Authorized Representative of Insurance This form is to be completed when someone other than the patient, parent, guardian or other legal representative is representing the patient in this appeal."}, {"url": "http://www.mass.gov/eohhs/docs/masshealth/privacy/ard.pdf", "passage_text": "An authorized representative can also be someone who has been appointed by law to act on your behalf. This person must fill out Section III and either you or this person must submit to us, together with this form, a copy of the applicable legal document stating that this person is lawfully representing you."}, {"url": "http://insurance.illinois.gov/ExternalReview/AuthRepF.pdf", "passage_text": "Health Care Providers must have this form completed in order to act as an Authorized Representative. This authorization may be revoked at any time with written notification to the Department of Insurance."}, {"url": "http://hcopub.dhs.state.mn.us/07_15_10.htm", "passage_text": "Authorized Representatives. Applicants and enrollees may designate an authorized representative. This section provides information on who can be an authorized representative, what their role is and other requirements."}, {"url": "https://www.healthcare.gov/glossary/authorized-representative/", "passage_text": "Authorized Representative. Someone who you choose to act on your behalf with the Marketplace, like a family member or other trusted person. Some authorized representatives may have legal authority to act on your behalf."}, {"url": "http://business.laws.com/negotiable-instruments/liability/authorized-agents", "passage_text": "In most legal matters, a duly authorized agent may be appointed by an involved party to act as that party's proxy in important legal negotiable instruments. But with negotiable instruments, the introduction of even a duly authorized agent raises the issue of liability."}, {"url": "http://legal-dictionary.thefreedictionary.com/Agent", "passage_text": "n. a person who is authorized to act for another (the agent's principal) through employment, by contract or apparent authority. The importance is that the agent can bind the principal by contract or create liability if he/she causes injury while in the scope of the agency."}]