[{"url": "http://grammar.about.com/od/pq/g/proseterm.htm", "passage_text": "Definition. Prose is ordinary writing (both fiction and nonfiction) as distinguished from verse. In his book The Establishment of Modern English Prose (1998), Ian Robinson observes that the term prose is surprisingly hard to define."}, {"url": "https://en.wikipedia.org/wiki/Prose", "passage_text": "Monsieur Jourdain asked for something to be written in neither verse nor prose. A philosophy master replied there is no other way to express oneself than with prose or verse, for the simple reason being that everything that is not prose is verse, and everything that is not verse is prose."}, {"url": "http://www.merriam-webster.com/dictionary/prose", "passage_text": "Full Definition of PROSE. 1. a: the ordinary language people use in speaking or writing b: a literary medium distinguished from poetry especially by its greater irregularity and variety of rhythm and its closer correspondence to the patterns of everyday speech. 2. : a dull or ordinary style, quality, or condition. "}, {"url": "http://literarydevices.net/prose/", "passage_text": "Prose Definition. Prose is a form of language that has no formal metrical structure. It applies a natural flow of speech, and ordinary grammatical structure rather than rhythmic structure, such as in the case of traditional poetry. Normal every day speech is spoken in prose and most people think and write in prose form. "}, {"url": "http://www.thefreedictionary.com/prose", "passage_text": "prose. 1. the ordinary form of spoken or written language, without metrical structure, as distinguished from poetry or verse. 2. matter-of-fact, commonplace, or dull expression, quality, discourse, etc. 3. of, in, or pertaining to prose. 4. commonplace; prosaic. 5. to turn into or express in prose."}, {"url": "https://en.wikipedia.org/wiki/Prose_poetry", "passage_text": "Prose poetry is poetry written in prose instead of using verse but preserving poetic qualities such as heightened imagery, parataxis and emotional effects. The simplest definition is that a prose poem is a poem written in prose....But, not unlike free verse, the oxymoronic name captures the complex nature of a beast bred to challenge conventional assumptions about what poetry is and what it can do.."}, {"url": "http://www.literarydevices.com/prose/", "passage_text": "1 Dictionary definition: Prose (n)—the ordinary form of spoken or written language, without metrical structure, as distinguished from poetry or verse. 2  Philosophical texts: Whoever fights monsters should see to it that in the process he does not become a monster. Definition of Prose. Prose is a communicative style that sounds natural and uses grammatical structure. Prose is the opposite of verse, or poetry, which employs a rhythmic structure that does not mimic ordinary speech."}, {"url": "http://www.poetrysoup.com/prose/", "passage_text": "Definition of Prose. Prose is writing distinguished from poetry by its greater variety of rhythm and its closer resemblance to the patterns of everyday speech. The word prose comes from the Latin prosa, meaning straightforward. This describes the type of writing that prose embodies, unadorned with obvious stylistic devices. "}, {"url": "http://www.diffen.com/difference/Poetry_vs_Prose", "passage_text": "Prose. noun. 1  the ordinary form of spoken or written language, without metrical structure, as distinguished from poetry or verse. 2  matter-of-fact, commonplace, or dull expression, quality, discourse, etc."}, {"url": "https://en.wikipedia.org/wiki/Prose", "passage_text": "Prose is a form of language that exhibits a grammatical structure and a natural flow of speech rather than a rhythmic structure (as in traditional poetry). A philosophy master replied there is no other way to express oneself than with prose or verse, for the simple reason being that everything that is not prose is verse, and everything that is not verse is prose."}]