[{"url": "https://www.truthinaging.com/ingredients/maltodextrin", "passage_text": "Functions: Maltodextrin is a polysaccharide and carbohydrate derived from rice, corn, or potato starch. By cooking it down, natural enzymes and acids help to break down the starch break down the starch, resulting in a simple white powder (Source). "}, {"url": "https://en.wikipedia.org/wiki/Maltodextrin", "passage_text": "Maltodextrin is a polysaccharide that is used as a food additive. It is produced from starch by partial hydrolysis and is usually found as a white hygroscopic spray-dried powder. Maltodextrin is easily digestible, being absorbed as rapidly as glucose, and might be either moderately sweet or almost flavorless. If wheat is used to make maltodextrin, it does not need to appear on the label. Maltodextrin derived from cereals containing gluten is exempt from labeling, as set out in Annex II of EC Directive 2000/13."}, {"url": "http://www.glutenfreeliving.com/gluten-free-foods/ingredients/top-10-ingredients-you-really-dont-need-to-worry-about/", "passage_text": "Maltodextrin. Why it’s on worry lists: Maltodextrin can be made from a variety of starches, including corn, potato, rice or wheat. Why you don’t need to worry: The source does not matter because maltodextrin is such a highly processed ingredient that the protein is removed, rendering it gluten free. Why you don’t need to worry: Despite what the CFR says, companies use corn because corn produces a better product. We don’t know of a single instance of a caramel color ever being made of anything containing gluten. Why that’s a good thing: Caramel color is in a lot of products."}, {"url": "https://en.wikipedia.org/wiki/Maltodextrin", "passage_text": "- glucose units connected in chains of variable length. The glucose units are primarily linked with α(1→4) glycosidic bonds. Maltodextrin is typically composed of a mixture of chains that vary from three to seventeen glucose units long. If wheat is used to make maltodextrin, it does not need to appear on the label. Maltodextrin derived from cereals containing gluten is exempt from labeling, as set out in Annex II of EC Directive 2000/13."}, {"url": "http://www.glutenfreedietitian.com/maltodextrin/", "passage_text": "You could find another product that does not contain maltodextrin. You could call the company and ask what the maltodextrin in the product is derived from. Or you could decide not to worry about it. Keep in mind, in the U.S., maltodextrin is still more likely to be made from a starch other than wheat. Starches other than corn, rice, or potato can be used to make maltodextrin as long as the company self-determines GRAS and the resulting maltodextrin has the same chemical structure as the maltodextrins made from corn, rice, or potato as described in Food Chemicals Codex."}, {"url": "http://www.glutenfreeliving.com/gluten-free-foods/ingredients/ingredients-index/", "passage_text": "Maltodextrin is gluten free. It can be made from a variety of starches, including corn, potato, rice or wheat. However the source does not matter because maltodextrin is such a highly processed ingredient that the protein is removed, rendering it gluten free. If wheat is used to make maltodextrin, “wheat” will be appear on the label. If wheat is used to make a flavor, “wheat” must appear on the label. Some flavoring is made with ethanol that comes from wheat. In that case the flavor would still be gluten free because ethanol is distilled. Distillation removes the gluten protein."}, {"url": "https://en.wikipedia.org/wiki/Maltodextrin", "passage_text": "In the US, this starch is usually corn; in Europe, it is commonly wheat. Some individuals suffering from gluten intolerance may be concerned by the presence of wheat derived maltodextrin but it is highly unlikely to contain significant (20 mg/kg or 20ppm) amounts of gluten. If wheat is used to make maltodextrin, it does not need to appear on the label. Maltodextrin derived from cereals containing gluten is exempt from labeling, as set out in Annex II of EC Directive 2000/13."}, {"url": "http://organicmaltodextrins.com/", "passage_text": "Rice Maltodextrin. Maltodextrin is sweet to taste hygroscopic powder that is generally creamy white in color, states www.agcommoditiesinc.com. The partial hydrolysis of starch results in the creation of the rice Maltodextrin. Products made from Maltodextrin are mixtures of glucose, maltose and polysaccharides. The chemical properties of each of these Maltodextrin are carried out by high-performance liquid chromatography, states www.agcommoditiesinc.com. The chemists note down the chemical properties of the substance and its usefulness measuring the color, viscosity and the molecular weight of the substance in future."}, {"url": "http://www.glutenfreeliving.com/gluten-free-foods/ingredients/top-10-ingredients-you-really-dont-need-to-worry-about/", "passage_text": "7. Why it’s on worry lists: Maltodextrin can be made from a variety of starches, including corn, potato, rice or wheat. Why you don’t need to worry: The source does not matter because maltodextrin is such a highly processed ingredient that the protein is removed, rendering it gluten free. Why you don’t need to worry: Despite what the CFR says, companies use corn because corn produces a better product. We don’t know of a single instance of a caramel color ever being made of anything containing gluten. Why that’s a good thing: Caramel color is in a lot of products."}]