[{"url": "http://www.visitguernsey.com/getting-here", "passage_text": "As well as discovering what Guernsey has to offer, the island is the gateway to its neighbouring Bailiwick islands of Alderney, Sark and Herm, as well as Jersey and the Normandy and Brittany coastlines of France. On a clear day, flying to Guernsey can offer spectacular views across the Bailiwick. There are also direct flights from Dinard in Brittany and the option to fly via Jersey from other European destinations. There is one ferry company operating to Guernsey from the UK and the French port of St Malo. During the summer months there is a passenger-only service from Normandy."}, {"url": "http://commons.wikimedia.org/wiki/Atlas_of_Guernsey", "passage_text": "English. Guernsey-Bailiwick of Guernsey. The Bailiwick of Guernsey is a British crown dependency in the English Channel off the coast of Normandy in between of ► England and ► France. As well as the island of Guernsey itself, it also includes Alderney, Sark, Herm, Jethou, Brecqhou, Burhou, Lihou and other islets. The island of Guernsey is divided into 10 parishes. Together with the Bailiwick of ► Jersey, it is included in the collective grouping known as the Channel Islands."}, {"url": "https://en.wikipedia.org/wiki/Guernsey", "passage_text": "Guernsey (/ˈɡɜrnzi/ GURN-zee), officially the Bailiwick of Guernsey (French: Bailliage de Guernesey, [bajaʒ də ɡɛʁnəzɛ]), is a possession of the British Crown in right of Guernsey in the English Channel, off the coast of Normandy. Guernsey is situated 50 kilometres (31 mi) west of France's Normandy coast and 120 kilometres (75 mi) south of Weymouth, England and lies in the Gulf of St Malo. Lihou, a tidal island, is attached to Guernsey by a causeway at low tide. The terrain is mostly level with low hills in southwest."}, {"url": "http://www.maphill.com/guernsey/detailed-maps/road-map/", "passage_text": "Detailed Road Map of Guernsey. This is not just a map. It's a piece of the world captured in the image. The detailed road map represents one of many map types and styles available. Look at Guernsey from different perspectives. Get free map for your website. Discover the beauty hidden in the maps. Maphill is more than just a map gallery."}, {"url": "http://www.visitguernsey.com/getting-here", "passage_text": "Guernsey is located in the English Channel, off the coast of Normandy and getting here couldn't be easier. Whether you choose to fly to the island or travel to Guernsey by ferry, regular flights and sea crossings mean you could be exploring the Bailiwick within hours of setting off from home. There are also direct flights from Dinard in Brittany and the option to fly via Jersey from other European destinations. There is one ferry company operating to Guernsey from the UK and the French port of St Malo. During the summer months there is a passenger-only service from Normandy."}, {"url": "http://www.maplandia.com/united-states/ohio/guernsey-county/guernsey/", "passage_text": "detailed map of Guernsey and near places. Welcome to the Guernsey google satellite map! This place is situated in Guernsey County, Ohio, United States, its geographical coordinates are 40° 10' 54 North, 81° 35' 33. West and its original name (with diacritics) is Guernsey. See Guernsey photos and images from satellite below, explore the aerial photographs of Guernsey in United States. Guernsey hotels map is available on the target page linked above."}, {"url": "https://en.wikipedia.org/wiki/Guernsey", "passage_text": "As a bailiwick, Guernsey embraces not only all ten parishes on the island of Guernsey, but also the islands of Alderney and Sark – each with its own parliament – and the smaller islands of Herm, Jethou and Lihou. Guernsey is situated 50 kilometres (31 mi) west of France's Normandy coast and 120 kilometres (75 mi) south of Weymouth, England and lies in the Gulf of St Malo. Lihou, a tidal island, is attached to Guernsey by a causeway at low tide. The terrain is mostly level with low hills in southwest."}, {"url": "http://www.visitguernsey.com/getting-here", "passage_text": "Travel Options. Guernsey is served by three airlines, with flights from the UK taking as little as 30 minutes. There are also direct flights from Dinard in Brittany and the option to fly via Jersey from other European destinations. There is one ferry company operating to Guernsey from the UK and the French port of St Malo. During the summer months there is a passenger-only service from Normandy."}, {"url": "http://www.worldatlas.com/webimage/countrys/europe/channelislandphotos.htm", "passage_text": "Print this map. St. Peter Port, Guernsey. Positioned just off the coast of France within the English Channel, the beautiful Channel Islands, all British Crown dependencies, are fiercely independent and justifiably proud of their history and traditions."}]