[{"url": "http://emedicine.medscape.com/article/330178-overview", "passage_text": "Lyme disease is a multisystem illness caused by infection with the spirochete Borrelia burgdorferi and the body's immune response to the infection. The disease is transmitted to humans via tick bites, from infected ticks of the genus Ixodes. Lyme disease is the most common vector-borne illness in the United States. Lyme disease, the most common vector-borne illness in the United States, is a multisystem illness caused by infection with the spirochete Borrelia burgdorferi (see the image below) and the body's immune response to the infection."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/17367972", "passage_text": "The treatment of secondary and tertiary Lyme borreliosis is difficult because of antibiotic lack of efficacy. This fact may be explained by several factors: the specific pathophysiology, involving not only the presence of bacteria, but also immunological reactions. "}, {"url": "http://www.nytimes.com/health/guides/disease/lyme-disease-chronic-persistent/overview.html", "passage_text": "Back to Top Causes. Lyme disease is caused by bacteria called Borrelia burgdorferi (B. burgdorferi) . Certain ticks carry these bacteria. The ticks pick up the bacteria when they bite mice or deer that are infected with Lyme disease. You can get the disease if you are bitten by an infected tick. Chronic persistent Lyme disease may develop months or years after you first develop Lyme disease infection. Chronic persistent Lyme disease can affect the skin, brain, and nervous system, and muscles, bones, and cartilage. Symptoms include: 1  Chronic arthritis. 2  Fatigue."}, {"url": "http://www.healthline.com/health/lyme-disease-chronic-persistent", "passage_text": "Causes of Chronic Lyme Disease. Lyme disease is a bacterial infection that is caused by bacteria called Borrelia burgdorferi. You can become infected if a tick that carries the bacteria bites you. Typically, black-legged ticks and deer ticks spread this disease. These ticks collect the bacteria when they bite diseased mice or deer. You are at a greater risk for chronic Lyme disease if you are infected by the bite of a diseased tick. If the disease progresses to the chronic stage, your symptoms might continue for weeks, months, or even years after the initial tick bite."}, {"url": "http://umm.edu/health/medical/ency/images/tertiary-lyme-disease", "passage_text": "Tertiary lyme disease. Toggle: English / Spanish. Tertiary Lyme disease is a late, persistent inflammatory disease characterized by skin changes, neurological and musculoskeletal symptoms caused by the bacterium Borrelia burgdorferi transmitted by the bite of a deer tick. Tertiary Lyme disease is indicated by chronic arthritis. "}, {"url": "https://en.wikipedia.org/wiki/Lyme_disease", "passage_text": "Lyme disease is the most common disease spread by ticks in the Northern Hemisphere. It is estimated to affect 300,000 people a year in the United States and 65,000 people a year in Europe. Infections are most common in the spring and early summer. Lyme disease is transmitted to humans by the bite of infected ticks of the Ixodes genus. Usually, the tick must be attached for 36 to 48 hours before the bacteria can spread."}, {"url": "https://www.utmedicalcenter.org/your-health/encyclopedia/general/image/17244/", "passage_text": "Tertiary lyme disease. Tertiary Lyme disease is a late, persistent inflammatory disease characterized by skin changes, neurological and musculoskeletal symptoms caused by the bacterium Borrelia burgdorferi transmitted by the bite of a deer tick. Tertiary Lyme disease is indicated by chronic arthritis."}, {"url": "https://en.wikipedia.org/wiki/Lyme_disease", "passage_text": "Lyme disease, also known as Lyme borreliosis, is an infectious disease caused by bacteria of the Borrelia type. The most common sign of infection is an expanding area of redness, known as erythema migrans, that begins at the site of a tick bite about a week after it has occurred. Lyme disease is transmitted to humans by the bite of infected ticks of the Ixodes genus. Usually, the tick must be attached for 36 to 48 hours before the bacteria can spread."}]