[{"url": "https://www.irs.gov/Individuals/International-Taxpayers/Fixed,-Determinable,-Annual,-Periodical-(FDAP)-Income", "passage_text": "Income can be FDAP income whether it is paid in a series of repeated payments or in a single lump sum. For example, $5,000 in royalty income would be FDAP income whether paid in 10 payments of $500 each or in one payment of $5,000."}, {"url": "http://taxmap.ntis.gov/taxmap/pubs/p515-003.htm", "passage_text": "Income can be FDAP income whether it is paid in a series of repeated payments or in a single lump sum. For example, $5,000 in royalty income would be FDAP income whether paid in 10 payments of $500 each or in one payment of $5,000."}, {"url": "https://www.irs.gov/Individuals/International-Taxpayers/Fixed,-Determinable,-Annual,-Periodical-(FDAP)-Income", "passage_text": "Tax at a 30% (or lower treaty) rate applies to FDAP income or gains from U.S. sources, but only if they are not effectively connected with your U.S. trade or business. The 30% (or lower treaty) rate applies to the gross amount of U.S. source fixed or determinable, annual or periodical gains, profits, or income."}, {"url": "http://ustaxhelp.com/2015/01/us-non-resident-aliens-must-understand-fdap-eci-achieve-international-tax-compliance/", "passage_text": "By default, FDAP income, income that is not connected with a trade or business, is taxed on the gross amount at a flat rate of 30%. However, FDAP may be taxed at a lower rate if a tax treaty provides for it or if other permissible reductions are available."}, {"url": "https://www.irs.gov/Individuals/International-Taxpayers/Fixed,-Determinable,-Annual,-Periodical-(FDAP)-Income", "passage_text": "1 A distribution from a partnership that is FDAP income, or such an amount that, although not actually distributed, is includible in the gross income of a foreign partner. 2  Taxes, mortgage interest, or insurance premiums paid to, or for the account of, a nonresident alien landlord by a tenant under the terms of a lease."}, {"url": "http://www.johnfallcpa.com/blog.php?id=2", "passage_text": "FDAP is an abbreviation for Fixed, Determinable, Annual or Periodic income. FDAP income applies to foreign persons earning income in the U.S; such persons will be subject to 30% withholding tax, or a lower rate if there is a tax treaty between the United States and the country of residency. The Internal Revenue Service (IRS) defines FDAP income by what it is not. Thus according to the IRS."}, {"url": "http://www.ustaxfs.com/fatca/fatca-faqs/", "passage_text": "FDAP is an abbreviation for Fixed, Determinable, Annual or Periodic income. FDAP income applies to foreign persons earning income in the US; such persons will be subject to 30% withholding tax or a lower rate if there is a tax treaty between the United States and the country of residency."}]