[{"url": "https://answers.yahoo.com/question/index?qid=20080723200412AABu4Es", "passage_text": "Rating Newest Oldest. Best Answer: A true hefeweizen is a German wheat beer. Generally, they are brewed with 50% or more malted wheat and about 50% malted barley. Hence the name. Hefe = half. And weizen = wheat. Your favorite beer, Widmer, really doesn't fall into this category. A hefeweizen is a German style wheat beer that is unfiltered. When you pour a hefe into a glas you'll notice a distinct haziness, that is all of the leftover goodness that gives this ale a distingushing aftertaste."}, {"url": "http://beer.about.com/od/glossary/g/Hefeweizen.htm", "passage_text": "Mr.TinDC/Flickr/CC BY-ND 2.0. Definition: Hefeweizen is a cloudy wheat ale that originated in Germany. The direct translation is hefe-yeast weizen-wheat. Yeast in the name refers to the fact that this beer is unfiltered and remains cloudy thanks to the suspended yeast. This yeast also contributes the unique banana and clove qualities to the aroma and flavor of hefeweizen. Also Known As: Wheat beer. Alternate Spellings: Hefe weizen"}, {"url": "http://beer.wikia.com/wiki/Hefeweizen", "passage_text": "A hefeweizen is typically yellow, cloudy (from the wheat proteins), has a fluffy white head. It is also noted for its low hop bitterness (about 15 IBUs) and relatively high carbonation, considered important to balance the beer's relatively malty sweetness. Some prominent commercial examples of Hefeweizen are produced by Paulaner, Erdinger, Schneider Weisse (original amber only), Franziskaner, Rothaus, Hacker-Pschorr, Ayinger (Braeu Bräu) weisse And. Weihenstephan the style is nowadays drunk Throughout, germany but is especially popular in Its Southern german. homeland"}, {"url": "http://www.whitelabs.com/yeast/wlp300-hefeweizen-ale-yeast", "passage_text": "WLP300 Hefeweizen Ale Yeast. This famous German yeast is a strain used in the production of traditional, authentic wheat beers. It produces the banana and clove nose traditionally associated with German wheat beers and leaves the desired cloudy look of traditional German wheat beers. "}, {"url": "http://beer.wikia.com/wiki/Hefeweizen", "passage_text": "372 pages on this wiki. Hefeweizen is the name for unfiltered Weissbier (weißbier wheat) beer and Is german in. Origin a hefeweizen is typically, yellow (cloudy from the wheat), proteins has a fluffy white. head Some prominent commercial examples of Hefeweizen are produced by Paulaner, Erdinger, Schneider Weisse (original amber only), Franziskaner, Rothaus, Hacker-Pschorr, Ayinger (Braeu Bräu) weisse And. Weihenstephan the style is nowadays drunk Throughout, germany but is especially popular in Its Southern german. homeland"}, {"url": "http://www.homebrewing.org/How-to-Make-Wheat-Beer_ep_36-1.html", "passage_text": "Click to view our Summer Wheat Beer Recipe Kit: German Hefeweizens (from the German words Hefe = yeast and weizen = wheat) are typically brewed with special yeasts whose phenols produce clove flavors, along with esters that produce bubble gum, banana, or vanilla flavors especially at warmer fermentation temperatures. "}, {"url": "http://www.howdoyousaythatword.com/word/hefeweizen/", "passage_text": "In German, ‘Hefe’ means ‘yeast’, and ‘Weizen’ means wheat. Hefeweizen is a type of cloudy wheat beer – the cloudiness indicates that the beer is unfiltered. The same beer is also filtered – in this case it is known as ‘Kristallweizen’. Well-known brands of Hefeweizen include Franziskaner, Ayinger and Paulaner."}, {"url": "http://beer.wikia.com/wiki/Hefeweizen", "passage_text": "Hefeweizen is the name for unfiltered Weissbier (weißbier wheat) beer and Is german in. origin Some prominent commercial examples of Hefeweizen are produced by Paulaner, Erdinger, Schneider Weisse (original amber only), Franziskaner, Rothaus, Hacker-Pschorr, Ayinger (Braeu Bräu) weisse And. Weihenstephan the style is nowadays drunk Throughout, germany but is especially popular in Its Southern german. homeland"}]