[{"url": "http://www.barcodeoflife.org/content/resources/faqs", "passage_text": "FAQs. DNA barcoding is a new technique that uses the variations in short, standardized gene regions can be used to identify known species and to discover new ones. This is possible because the variation within each species is low relative to the differences among species."}, {"url": "http://www.eufic.org/page/en/show/latest-science-news/page/LS/fftid/DNA_barcoding_tool_food_traceability/", "passage_text": "DNA barcoding is a molecular based system, which allows scientists to identify particular species, by comparing short genetic markers in the specimen DNA with reference sequences."}, {"url": "http://www.springer.com/us/book/9781617795909", "passage_text": "A DNA barcode in its simplest definition is one or more short gene sequences taken from a standardized portion of the genome that is used to identify species through reference to DNA sequence libraries or databases."}, {"url": "http://www.ibol.org/about-us/what-is-dna-barcoding/", "passage_text": "CCTATACCTAATCTTCGGAGCATGAGCGGGCATGGTAGGC.... And it’s image looks like this: Once the barcode sequence has been obtained, it is placed in the Barcode of Life Data Systems (BOLD) database – a reference library of DNA barcodes that can be used to assign identities to unknown specimens."}, {"url": "http://www.ibol.org/about-us/what-is-dna-barcoding/", "passage_text": "The gene region that is being used for almost all animal groups, a 648 base-pair region in the mitochondrial cytochrome c oxidase 1 gene (“CO1”), is proving highly effective in identifying birds, butterflies, fish, flies and many other animal groups."}, {"url": "http://www.barcodeoflife.org/content/resources/faqs", "passage_text": "DNA barcoding is a tool for both basic and applied research. In addition to the research issues described above, DNA barcoding is being tested as a way to identify species involved in legal and regulatory matters."}, {"url": "https://en.wikipedia.org/wiki/DNA_barcoding", "passage_text": "DNA barcoding is a taxonomic method that uses a short genetic marker in an organism's DNA to identify it as belonging to a particular species."}, {"url": "https://www.dnalc.org/view/16979-DNA-Barcoding.html", "passage_text": "An animation explaining how DNA barcodes can be used to identify species and answer questions about biodiversity, food fraud, and invasive species. The steps involved in DNA barcoding are explained, from sample collection, DNA isolation and PCR, through to sequencing and bioinformatics analysis."}]