[{"url": "http://encyclopedia2.thefreedictionary.com/Sepoy+Mutiny", "passage_text": "Indian Mutiny. 1857–58, revolt that began with Indian soldiers in the Bengal army of the British East India Company but developed into a widespread uprising against British rule in India. The 1857 war for independence started as a. against the East India Company, and soon escalated into a revolt by kings and civilians in northern and central India. Historians dig out 15 skeletons of 1857 Mutiny fighters by Asian News International."}, {"url": "http://encyclopedia2.thefreedictionary.com/Indian+Rebellion+of+1857", "passage_text": "Indian Mutiny. 1857–58, revolt that began with Indian soldiers in the Bengal army of the British East India Company but developed into a widespread uprising against British rule in India. It is also known as the Sepoy Rebellion, sepoys being the native soldiers"}, {"url": "https://en.wikipedia.org/wiki/Indian_Rebellion_of_1857", "passage_text": "The rebellion is also known as India's First War of Independence, the Great Rebellion, the Indian Rebellion, the Indian Mutiny, the Revolt of 1857, the Rebellion of 1857, the Uprising of 1857, the Sepoy Rebellion, the Indian Insurrection and the Sepoy Mutiny. The Indian Rebellion of 1857 occurred as the result of an accumulation of factors over time, rather than any single event. The sepoys were local soldiers, the majority Hindu or Muslim, that were recruited into the Company's army."}, {"url": "http://www.answers.com/Q/What_was_the_Sepoy_Rebellion", "passage_text": "The Sepoy rebellion was set off between the British and the Indians. Indian soldiers that worked for the British during the British rule were known as the sepoys. When British started to advance on their technology, they came up with new riffle carriages. The causes of the Sepoy rebellion were rumors were spread that the rifles were being greased with beef and pork fat. For Hindu soldiers, the cow is sacred. For Muslim soldiers … , they can't touch pork. Also, Indian soldiers were required to fight in foreign lands."}, {"url": "https://en.wikipedia.org/wiki/Indian_Rebellion_of_1857", "passage_text": "The Indian Rebellion of 1857 refers to a rebellion in India against the rule of the East India Company, that ran from May 1857 to June 1858. The Indian Rebellion of 1857 occurred as the result of an accumulation of factors over time, rather than any single event. The sepoys were local soldiers, the majority Hindu or Muslim, that were recruited into the Company's army."}, {"url": "https://simple.wikipedia.org/wiki/Indian_Rebellion_of_1857", "passage_text": "From Wikipedia, the free encyclopedia. The Indian Rebellion of 1857 was also called India's First War of Independence, the Great Rebellion, the Indian Mutiny, or the Sepoy Mutiny. It began on 10 May 1857, as a mutiny of sepoys of the British East India Company 's army"}, {"url": "https://en.wikipedia.org/wiki/Sepoy", "passage_text": "The term sepoy came into use in the forces of the British East India Company in the eighteenth century, where it was one of many, such as peons, gentoos, mestees and topasses used for various categories of native soldiers. A sepoy (/ˈsiːpɔɪ/) was formerly the designation given to an Indian soldier. In the modern Nepalese Army, Indian Army, Pakistan Army and Bangladesh Army it remains in use for the rank of private soldier."}, {"url": "http://www.answers.com/Q/What_was_the_Sepoy_Rebellion", "passage_text": "The Sepoy Rebellion, also called the Indian War of Independence, was started to rid the peoples of India of their British conquerors. Indian troops called sepoys worked for th … e English East India Company that ruled India on behalf of the British Empire. The causes of the Sepoy rebellion were rumors were spread that the rifles were being greased with beef and pork fat. For Hindu soldiers, the cow is sacred. For Muslim soldiers … , they can't touch pork. Also, Indian soldiers were required to fight in foreign lands."}, {"url": "http://history1800s.about.com/od/thebritishempire/ss/The-Sepoy-Mutiny.htm", "passage_text": "Bitter fighting between British troops and Indian sepoys during the 1857 revolt. Photo Credit: Getty Images. The Sepoy Mutiny was a violent and very bloody uprising against British rule in India in 1857. It is also known by other names: the Indian Mutiny, the Indian Rebellion of 1857, or the Indian Revolt of 1857. "}]