[{"url": "http://thebahamasguide.com/islands/abaco/", "passage_text": "Abaco Bahamas is the third most populous island in The Bahamas and bears a resemblance to New England from which it attracts so many of its visitors and winter residents — many who often purchase a second home. Marsh Harbour Abaco is the commercial centre located on Great Abaco."}, {"url": "http://thebahamasguide.com/islands/abaco/", "passage_text": "Its two major islands, Great Abaco and Little Abaco, have a myriad of small cays flanking the mainland. The sea channel between the islands allows for good cruising. Abaco, located in the northern Bahamas, typically boats pine forests and is frequented by hunters of wild boar and ducks."}, {"url": "http://treasurecay.com/resort/location/", "passage_text": "Location. Approximately 160 miles due east of Fort Lauderdale, Florida, our small coastal community and Beach Marina & Golf Resort are located on the east side of the island of Abaco in the Bahamas."}, {"url": "http://www.thesurfingsite.com/Surf-Spots-Bahamas.html", "passage_text": "The majority of Bahamas surfing spots are located on the Out Islands of Abaco, Eleuthera & Cat Island. Its 700+ islands hold more potential than any other unexplored area of the Caribbean. Surfing in the Bahamas is a great option for US East Coast surfers."}, {"url": "http://where-is-abaco.com/", "passage_text": "About Abaco. The Bahamas has over 700 islands, and you’ll find 100 of them in Abaco. Not all the islands are populated, but the largest ones are. All populated islands outside of New Providence where the capitol Nassau is located, are called Family islands or Out Islands."}, {"url": "http://where-is-abaco.com/", "passage_text": "The main island is Great Abaco, which is the second largest island in the Bahamas. Great Abaco is more than 90 miles long and 4 miles wide on average. On the Atlantic side of Great Abaco there is a chain of small islands, or cays (pronounced like “key”), and on the outside of them is a barrier reef."}, {"url": "http://www.sirbahamas.com/eng/article/abaco-real-estate", "passage_text": "The Abacos are a string of Bahamas islands located 180 miles east of Palm Beach, Florida, USA, and about 55 miles north of Nassau, the capital city of The Bahamas."}, {"url": "http://where-is-abaco.com/", "passage_text": "Abaco is a group of pristine islands and cays in the Northern part of The Bahamas. Located some 180 miles out of West Palm Beach in Florida, you need not go far in order to find white beaches, luke warm, crystal clear waters for amazing snorkeling."}]