[{"url": "https://en.wikipedia.org/wiki/Jamestown,_Virginia", "passage_text": "Jamestown, Virginia. The Jamestown settlement in the Colony of Virginia was the first permanent English settlement in the Americas. William Kelso says Jamestown is where the British Empire began ... this was the first colony in the British Empire."}, {"url": "http://www.knowswhy.com/why-was-jamestown-founded/", "passage_text": "Why was Jamestown founded? Jamestown is one of the most important historical sites in the United States. It was established on May 14, 1607 in the Colony of Virginia. It was the site of the first English settlement in the United States. When the English settlers landed on Jamestown in 1607 a settlement was established represented by the Englishmen from Virginia Company in London. There is a major reason why Jamestown was founded."}, {"url": "http://www.answers.com/Q/Why_was_jamestown_so_important", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answered by The Community. Making the world better, one answer at a time. Jamestown was very important because it was the first permanent English settlement in North America. It is America's birthplace. "}, {"url": "http://www.historyisfun.org/jamestown-settlement/history-jamestown/", "passage_text": "A History of Jamestown. The founding of Jamestown, America’s first permanent English colony, in Virginia in 1607 – 13 years before the Pilgrims landed at Plymouth in Massachusetts – sparked a series of cultural encounters that helped shape the nation and the world. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100601210931AAX26iM", "passage_text": "Answers. Best Answer: First PERMANENT British settlement in the New World, est. 1607 in Jamestown Virginia (located near the James River and named for King James of England who was previously the King of Scotland before his cousin Queen Elizabeth I died unmarried with no heir to her throne. "}, {"url": "http://www.knowswhy.com/why-was-jamestown-founded/", "passage_text": "History tells us that the place was called as such in honor of King James I of England. When the English settlers landed on Jamestown in 1607 a settlement was established represented by the Englishmen from Virginia Company in London. There is a major reason why Jamestown was founded. Settlers wanted to gain more wealth and quick profit from gold mining"}, {"url": "http://www.livescience.com/38595-jamestown-history.html", "passage_text": "View full size image. Jamestown, founded in 1607, was the first successful permanent English settlement in what would become the United States. It was located on Jamestown Island, in Virginia, about 30 miles (47 kilometers) up the James River from the Atlantic coast. Jamestown was not the first successful permanent European settlement in what would become the United States; that distinction belongs to St. Augustine, in Florida, which was founded by the Spanish in 1565."}, {"url": "https://answers.yahoo.com/question/index?qid=20091118155824AAlXN8b", "passage_text": "I recommend you check that book out(: But If you were just aiming for a straight answer: Jamestown is important to U.S. history because it is regarded as the first permanent English settlement in what we now call the United States of America. It was founded on May 14, 1607 in the Virginia Colony. In my opinion, I dont believe it was right for the English to claim Jamestown as their own because before they rudely intruded, it was strictly Indian territory."}]