[{"url": "http://medical-dictionary.thefreedictionary.com/necropsy", "passage_text": "necropsy, necroscopy. See autopsy. A postmortem examination of a body, which helps determine cause of death and identify any diseases that had not been detected while the patient was alive, or which confirms the presence of conditions diagnosed before the patient died. Autopsy types. examination of a body after death to determine the cause of death; it may be ordered by a coroner or medical examiner when the cause of death is unknown or the death has taken place under suspicious circumstances."}, {"url": "http://www.howcast.com/videos/514707-What-Is-a-Necropsy-Pet-Rabbits/", "passage_text": "Learn what a necropsy is in this Howcast video featuring bunny lover Amy Sedaris and rabbit expert Mary E. Cotter. So one of the hardest times a rabbit owner has to face is when the rabbit dies, especially when the rabbit dies of unknown causes. We encourage all owners to have what’s called a necropsy, which is another word for an autopsy. And what that means is that the rabbit’s body and his tissues are examined after death."}, {"url": "https://en.wikipedia.org/wiki/Necropsy", "passage_text": "For example, a forensic autopsy is carried out when the cause of death may be a criminal matter, while a clinical or academic autopsy is performed to find the medical cause of death and is used in cases of unknown or uncertain death, or for research purposes. It is usually performed by a specialized medical doctor called a pathologist. The word “autopsy” means to study and directly observe the body (Adkins and Barnes, 317). This includes an external examination of the deceased and the removal and dissection of the brain, kidneys, lungs and heart."}, {"url": "http://www.wisegeek.org/what-is-a-necropsy.htm", "passage_text": "A necropsy is a postmortem examination that is sometimes called an autopsy, postmortem, or obduction. During a necropsy, the person who performs the examination first inspects the exterior of the body, making notes for the record. These notes will include any signs of trauma, along with general observations about the subject's physical health."}, {"url": "http://marinelife.about.com/od/glossary/g/necropsy.htm", "passage_text": "A necropsy (animal autopsy) of a right whale in Florida. Note the extremely thick blubber layer just under the whale's skin. © Dianna Schulte, Blue Ocean Society. Definition: A necropsy is a dissection of the dead body of an animal to determine the cause of death. In essence, it is an autopsy performed on an animal, such as a whale or shark. Necropsies can help us learn more about the biology of an animal, how it is affected by disease or how human interactions may impact animals. Examples: The necropsy performed on the whale indicated that it had died of natural causes."}, {"url": "http://medical-dictionary.thefreedictionary.com/necropsy", "passage_text": "autopsy. examination of a body after death to determine the cause of death; it may be ordered by a coroner or medical examiner when the cause of death is unknown or the death has taken place under suspicious circumstances. Autopsies are also valuable sources of medical knowledge"}, {"url": "http://www.audioenglish.org/dictionary/necropsy.htm", "passage_text": "Sense 1. necropsy [BACK TO TOP]. Meaning: An examination and dissection of a dead body to determine cause of death or the changes produced by disease. Classified under: "}, {"url": "http://www.wisegeek.org/what-is-a-necropsy.htm", "passage_text": "Top 10 unbelievable historical concurrencies. A necropsy is a postmortem examination that is sometimes called an autopsy, postmortem, or obduction. Some people like to use the term specifically for examinations that are performed on non-humans, reserving “autopsy” for humans specifically. During a necropsy, the person who performs the examination first inspects the exterior of the body, making notes for the record. These notes will include any signs of trauma, along with general observations about the subject's physical health."}, {"url": "http://www.wisegeek.org/what-is-a-necropsy.htm", "passage_text": "In a necropsy, a human or animal corpse is surgically opened for examination. A medical examiner may test for the presence of harmful chemicals during an autopsy. Necropsies are another name for autopsies. During a necropsy, the person who performs the examination first inspects the exterior of the body, making notes for the record. These notes will include any signs of trauma, along with general observations about the subject's physical health."}, {"url": "http://www.thefreedictionary.com/necropsy", "passage_text": "1. necropsy-an examination and dissection of a dead body to determine cause of death or the changes produced by disease. autopsy, PM, postmortem examination, post-mortem examination, postmortem, post-mortem. examination, scrutiny-the act of examining something closely (as for mistakes). "}]