[{"url": "https://en.wikipedia.org/wiki/Bisquick", "passage_text": "Bisquick is a pre-mixed baking mix sold by General Mills under its Betty Crocker brand, consisting of flour, shortening, salt, and baking powder (a leavening agent). History [edit]. According to General Mills, Bisquick was invented in 1930 after one of their top sales executives met an innovative train dining car chef on a business trip."}, {"url": "https://en.wikipedia.org/wiki/Bisquick", "passage_text": "Substitution [edit]. One cup of Bisquick can be substituted by a mixture of one cup of flour, 1½ teaspoons of baking powder, ½ teaspoon of salt, and 2 1/2 tablespoons of oil or melted butter (or by cutting in 2 1/2 tbsp Crisco or lard). History [edit]. According to General Mills, Bisquick was invented in 1930 after one of their top sales executives met an innovative train dining car chef on a business trip."}, {"url": "http://www.wikihow.com/Make-a-Substitute-for-Bisquick", "passage_text": "1. Substitute the mix for 1 cup of Bisquick in recipes. Using your substitute is easy. Simply use it in place of one cup of normal Bisquick mix. Add the extra ingredients called for in the recipe, including additional oil or fat. 2. Cut the fat into the dry ingredients. Shortening, oil, and other fats are sometimes tricky to mix evenly into dry ingredients like flour. Using a technique called cutting can help. To cut the fat in, put or pour it onto the dry ingredients, then use two knives to distribute it in a criss-crossing motion."}, {"url": "https://au.answers.yahoo.com/question/index?qid=1006050319200", "passage_text": "http://en.wikipedia.org/wiki/Bisquick Bisquick is currently sold under the Betty Crocker brand name by General Mills. here is a copykat recipe for bisquick Basic Baking Mix like Bisquick® Prep. Rating Newest Oldest. Best Answer: Bisquick is a pre-mixed baking product made by General Mills consisting of flour, sugar, vegetable shortening, salt, powdered milk and leavening soda."}, {"url": "http://www.generalmills.com/en/Brands/Baking/bisquick", "passage_text": "Adding Bisquick baking mix to your pantry gives you some quick options. Dinners. Desserts. Egg bakes. Pancakes and waffles. Bisquick is part of the recipe. And Bisquick Heart Smart pancake and baking mix is an excellent source of calcium. It's naturally low in cholesterol and low fat with no trans fat. It has the seal of the American Heart Association."}, {"url": "http://www.topsecretrecipes.com/Bisquick-Original-All-Purpose-Baking-Mix-Copycat-Recipe.html", "passage_text": "1 1/2 teaspoons salt. 1 cup shortening. 1. Combine all the dry ingredients in a large bowl. 2. Add the shortening and mix with an electric mixer on medium speed until all the shortening is blended with the flour. 3. Use the mix as you would the real thing by following the directions on the box (see Tidbits below). : Use the following recipes to make pancakes, waffles and biscuits with the cloned version of the mix as you would with the real thing: : Stir 2 cups Bisquick clone mix with 1 cup milk and 2 eggs in a bowl until blended."}, {"url": "http://www.wikihow.com/Make-a-Substitute-for-Bisquick", "passage_text": "1. Mix the dry ingredients. In a large bowl, sift the flour, baking powder, and salt together. Use a whisk or a large spoon to get a nice even mixture. 1  All-purpose flour works best here. 2  However, alternatives are possible. 3  For example, to make gluten-free pancakes, substitute buckwheat or almond flour. 2. Cut the fat into the dry ingredients. Shortening, oil, and other fats are sometimes tricky to mix evenly into dry ingredients like flour. Using a technique called cutting can help. To cut the fat in, put or pour it onto the dry ingredients, then use two knives to distribute it in a criss-crossing motion."}, {"url": "http://www.food.com/recipe/original-bisquick-baking-mix-copycat-357101", "passage_text": "Cook. Use as an exact substitute for Original Bisquick Baking Mix in recipes. Original Bisquick does not contain powdered milk. Neither does this copycat recipe. This recipe also uses canola oil as a healthy substitute for solid shortening. =) Thanks for this recipe! it is a keeper! sandesnow. Original Bisquick Baking Mix Copycat. 5 5. Perfect! Just what I was looking for. I didn't want to go out and buy Bisquick. I'm even happier to avoid the"}, {"url": "http://www.topsecretrecipes.com/Bisquick-Original-All-Purpose-Baking-Mix-Copycat-Recipe.html", "passage_text": "Makes 6 cups. : Use the following recipes to make pancakes, waffles and biscuits with the cloned version of the mix as you would with the real thing: : Stir 2 cups Bisquick clone mix with 1 cup milk and 2 eggs in a bowl until blended. Pour 1/4 cup portions onto a hot griddle and cook until the edges are dry"}]