[{"url": "http://www.nature.com/scitable/definition/genetic-code-13", "passage_text": "The genetic code is a set of three-letter combinations of nucleotides called codons, each of which corresponds to a specific amino acid or stop signal. It is also important to note that the genetic code does not overlap, meaning that each nucleotide is part of only one codon-a single nucleotide cannot be part of two adjacent codons. Furthermore, the genetic code is nearly universal, with only rare variations reported."}, {"url": "http://www.nature.com/scitable/definition/genetic-code-13", "passage_text": "For instance, mitochondria have an alternative genetic code with slight variations. The genetic code is a set of rules defining how the four-letter code of DNA is translated into the 20-letter code of amino acids, which are the building blocks of proteins. It is also important to note that the genetic code does not overlap, meaning that each nucleotide is part of only one codon-a single nucleotide cannot be part of two adjacent codons. Furthermore, the genetic code is nearly universal, with only rare variations reported."}, {"url": "http://www.wisegeek.org/what-is-the-genetic-code.htm", "passage_text": "Top 10 amazing movie makeup transformations. The genetic code is a set of instructions for transferring genetic data stored in the form of DNA or RNA into proteins. Proteins are integral to almost all of the biological processes that occur in living things. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070708061741AAPLkCg", "passage_text": "Report Abuse. The chemical language used by the cell is known as the genetic code. The genetic code is called a triplet code, because a sequence of three nitrogenous bases specifies the identity of a single amino acid. Thus, the information encoded in the sequence of nitrogenous bases must be read in groups of three. (UAC, GGC, UCG)."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/organic/gencode.html", "passage_text": "Superimpose code. The genetic code by which DNA stores the genetic information consists of codons of three nucleotides. The functional segments of DNA which code for the transfer of genetic information are called genes. With four possible bases, the three nucleotides can give 4 3 = 64 different possibilities, and these combinations are used to specify the 20 different amino acids used by living organisms."}, {"url": "https://en.wikipedia.org/wiki/Genetic_code", "passage_text": "The genetic code is the set of rules by which information encoded within genetic material (DNA or mRNA sequences) is translated into proteins by living cells. A series of codons in part of a messenger RNA (mRNA) molecule. Each codon consists of three nucleotides, usually corresponding to a single amino acid. The nucleotides are abbreviated with the letters A, U, G and C. This is mRNA, which uses U (uracil). DNA uses T (thymine) instead."}, {"url": "http://medical-dictionary.thefreedictionary.com/genetic+code", "passage_text": "genetic code the arrangement of nucleotides in the polynucleotide chain of a chromosome; it governs the transmission of genetic information to proteins, i.e., determines the sequence of amino acids in the polypeptide chain making up each protein synthesized by the cell. genetic code, the information carried by DNA that determines the specific amino acids and their sequence in each protein synthesized by an organism. The code consists of the sequence of nucleotides in the DNA molecule of each chromosome in the nucleus of every cell."}]