[{"url": "http://brokeroutpost.com/reference/25932.htm", "passage_text": "How long does a mortgage take to closeThe average is 2-3 weeks for a refinance and 4 weeks for a purchase. The time it takes to close your loan can be affeted by many things and no loan is the same."}, {"url": "http://www.ehow.com/how-does_5141976_long-refinance-home.html", "passage_text": "Documentation. The documentation required for a home refinance includes W2 forms, last two weeks' pay stubs, tax returns and a loan application. It may take up to two weeks to gather this information. The documentation is necessary to assist the underwriters in determining the viability of the loan."}, {"url": "http://www.zillow.com/advice-thread/How-long-does-the-FHA-loan-refinance-takes-what-are-the-fees/452939/", "passage_text": "For a regular FHA refinance, closing costs consist of lender fees, appraisal, credit report, flood certificate-which usually range from $1200 to $1500. Title fees are also part of the closing cost that are included in your new loan and, depending on your state and loan amount, can range from $900 to $1800."}, {"url": "http://www.ehow.com/how-does_5141976_long-refinance-home.html", "passage_text": "The documentation required for a home refinance includes W2 forms, last two weeks' pay stubs, tax returns and a loan application. It may take up to two weeks to gather this information. The documentation is necessary to assist the underwriters in determining the viability of the loan."}, {"url": "http://brokeroutpost.com/reference/25932.htm", "passage_text": "How long does a mortgage take to close. The average is 2-3 weeks for a refinance and 4 weeks for a purchase. The time it takes to close your loan can be affeted by many things and no loan is the same."}, {"url": "https://www.veteransunited.com/realestate/how-long-does-it-take-to-close-a-va-loan/", "passage_text": "Most VA loans close in 30 to 45 days, which is standard for the mortgage industry regardless of the type of financing."}, {"url": "http://homeguides.sfgate.com/long-refinance-mortgage-38283.html", "passage_text": "Summary. Refinancing transactions might be completed within 30 days; however, 60 to 90-day time frames are more plausible. A lender's loan volume, workforce and other circumstances could impact processing speeds. You can ask your loan officer about the estimated time frame for refinancing your mortgage."}]