[{"url": "http://en.mr-ginseng.com/ginseng-panax/", "passage_text": "Ginseng: Origins. Ginseng (Panax Ginseng C.A. Meyer) originated in China and North Korea, and has been used for more than 4,000 years. The plant became known as the “root of life” due to its energizing effects. Ginseng is the plant of vitality, and its anti-fatigue properties have been recognized throughout the world. Today, however, Panax Ginseng is most renowned for its aphrodisiac properties and for its effects on the libido."}, {"url": "http://www.superfoods-for-superhealth.com/what-is-ginseng.html", "passage_text": "Asian Ginseng Vs. The main difference between Asian Panax ginseng and American ginseng varieties is that Panax is a more warming Yang stimulant, whereas American is a more Yin, cooling and calming tonic. Both are energizing but in different ways. These qualities are largely a result of the temperature in which it grows. Ginseng is the type of Chinese herb where a little bit goes a long way as far as potency and is best taken in smaller amounts and used over an extended period of time. Effects are cumulative when taken on a consistent basis over many months, or better yet, years or throughout the course of one's lifetime."}, {"url": "http://www.superfoods-for-superhealth.com/what-is-ginseng.html", "passage_text": "The Chinese term for Panax ginseng is ren shen, which means person (ren) and plant root or spirit (shen). There are several ginsengs classified under the genus Panax, but the species identified as true ginsengs are specifically Panax ginseng and Panax quinquefolius. Ginseng is the type of Chinese herb where a little bit goes a long way as far as potency and is best taken in smaller amounts and used over an extended period of time. Effects are cumulative when taken on a consistent basis over many months, or better yet, years or throughout the course of one's lifetime."}, {"url": "http://umm.edu/health/medical/altmed/herb/asian-ginseng", "passage_text": "Overview. Ginseng has been used in Chinese medicine for thousands of years. The name ginseng refers to both American (Panax quinquefolius) and Asian or Korean ginseng (Panax ginseng) , which are made up of similar chemicals. Like American ginseng, Asian ginseng is a gnarled root that looks like a human body with stringy shoots for arms and legs. Long ago, herbalists thought that because of the way ginseng looks it could treat many problems, from fatigue and stress to asthma and cancer."}, {"url": "http://en.mr-ginseng.com/ginseng-panax/", "passage_text": "Ginseng: Composition. Panax Ginseng is a very nutritionally rich plant. Ginseng root is rich in amino acids (particularly essential amino acids) and numerous mineral elements: aluminium, arsenic, calcium, cobalt, copper, iron, magnesium, manganese, phosphor, potassium, silica, zinc. Ginseng is the plant of vitality, and its anti-fatigue properties have been recognized throughout the world. Today, however, Panax Ginseng is most renowned for its aphrodisiac properties and for its effects on the libido."}, {"url": "http://en.mr-ginseng.com/ginseng-panax/", "passage_text": "Ginseng (Panax Ginseng C.A. Meyer) originated in China and Korea and has been used for more than 4,000 years. The plant is often considered a panacea, meaning it is capable of treating all kinds of illnesses and diseases. Ginseng is the plant of vitality, and its anti-fatigue properties have been recognized throughout the world. Today, however, Panax Ginseng is most renowned for its aphrodisiac properties and for its effects on the libido."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1000-GINSENG,%20PANAX.aspx?activeIngredientId=1000&activeIngredientName=GINSENG,%20PANAX", "passage_text": "Panax ginseng is a plant. People use the root to make medicine. Do not confuse Panax ginseng with American ginseng, Siberian ginseng, or Panax pseudoginseng. See the separate listings for American ginseng and Siberian ginseng. Panax ginseng is used for improving thinking, concentration, memory and work efficiency, physical stamina, and athletic endurance. Some people use Panax ginseng to help them cope with stress and as a general tonic for improving well-being"}, {"url": "http://www.aafp.org/afp/2003/1015/p1539.html", "passage_text": "One of the most commonly used and researched of the ginsengs is Panax ginseng, also called Asian or Korean ginseng. The main active components of Panax ginseng are ginsenosides, which have been shown to have a variety of beneficial effects, including anti-inflammatory, antioxidant, and anticancer effects. "}, {"url": "http://umm.edu/health/medical/altmed/herb/american-ginseng", "passage_text": "The name ginseng is used to refer to both American (Panax quinquefolius) and Asian or Korean ginseng (Panax ginseng), which belong to the genus Panax and have a somewhat similar chemical makeup. Like Asian ginseng, American ginseng is a light tan, gnarled root that often looks like a human body with stringy shoots for arms and legs. Native Americans used the root as a stimulant and to treat headaches, fever, indigestion, and infertility."}]