[{"url": "http://www.mormonmissionprep.com/preparing-for-a-mission/lds-mission-cost/", "passage_text": "Mission costs for senior missionaries range from $800–$4,000 per month (which includes expenses for housing, utilities, food, and transportation), but about 80% of all missions cost less than $1,800 per month. I specify that the figure above is for young men and women in the US, because mission costs vary for senior couples and for young people outside the US. To find out the current cost of an LDS mission outside the United States, please see your bishop or other Church leader in the country. For senior missionaries in the United States, the average cost of a mission for couples who do not live at home is approximately $1,5"}, {"url": "http://www.mormonmissionprep.com/preparing-for-a-mission/lds-mission-cost/", "passage_text": "The current LDS mission monthly cost for young men and women in the United States is $400 a month. That comes out to a total of $7,200 for 18-month long missions for sisters, and $9,600 for young men who serve two-year missions. Mission Costs Vary for Some People and Places. I specify that the figure above is for young men and women in the US, because mission costs vary for senior couples and for young people outside the US. To find out the current cost of an LDS mission outside the United States, please see your bishop or other Church leader in the country. For senior missionaries in the United States, the average cost of a mission for couples who do not live at home is approximately $1,500 per month"}, {"url": "https://en.wikipedia.org/wiki/Missionary_(LDS_Church)", "passage_text": "Many missionaries learn a new language at a missionary training center as part of their assignment. Missions typically last two years for males, 18 months for females, and 6 to 18 months for older couples. The LDS Church strongly encourages, but does not require, missionary service for young men. The LDS Church is one of the most active modern practitioners of missionary work, reporting that it had over 80,000 full-time missionaries worldwide in October 2013 (as well as over 22,000 part-time church-service missionaries at the end of 2012)."}, {"url": "http://www.answers.com/Q/How_much_does_and_average_LDS_mission_cost", "passage_text": "How much does a Mormon's mission cost? The cost of a standard full-time mission in the Church of Jesus Christ of Latter-day Saints (commonly called the Mormon church) is $400 per month. (as of April 2010) This eq … uates to about $10,000 for a male missionary and $7,500 for a female missionary over the total course of the mission. All full-time young adult missionaries for the Church of Jesus Christ of Latter-day Saints are expected to pay a flat rate of $400 per month for their missions, regardless of where they are serving."}, {"url": "http://www.answers.com/Q/How_much_does_a_Mormon's_mission_cost", "passage_text": "Confidence votes 133. The cost of a standard full-time mission in the Church of Jesus Christ of Latter-day Saints (commonly called the Mormon church) is $400 per month. (as of April 2010) This equates to about $10,000 for a male missionary and $7,500 for a female missionary over the total course of the mission. "}, {"url": "http://www.howmuchisit.org/lds-mission-cost/", "passage_text": "1 The current LDS mission cost for young people in the US is about $400 a month, no matter where you’re being sent. 2  All missionaries pay a similar amount, and this money is then re-distributed to meet the needs of missionaries depending on the region of the world where they’ve been called to serve. They are reported to have more than 80,000 full-time missionaries worldwide as well as over 22,000 part time church service missionaries. Most full-time LDS missionaries are single young people in their early twenties and late teens, as well as older couples who no longer have children in their homes."}, {"url": "http://www.howmuchisit.org/lds-mission-cost/", "passage_text": "Oftentimes, missionaries are assigned to serve away from their homes, including other countries. Typically, missions last 2 years for males, 18-months for females, and 6-18 months for older couples. 1  The current LDS mission cost for young people in the US is about $400 a month, no matter where you’re being sent. They are reported to have more than 80,000 full-time missionaries worldwide as well as over 22,000 part time church service missionaries. Most full-time LDS missionaries are single young people in their early twenties and late teens, as well as older couples who no longer have children in their homes."}, {"url": "http://www.howmuchisit.org/lds-mission-cost/", "passage_text": "1 According to MormonMissionPrep.com, the mission cost is around $400 per month, or about $7,200 for an 18-month journey. 2  Laytreasuresinheaven.com broke down what the mission expenses would look like if the funds weren’t distributed equally. They are reported to have more than 80,000 full-time missionaries worldwide as well as over 22,000 part time church service missionaries. Most full-time LDS missionaries are single young people in their early twenties and late teens, as well as older couples who no longer have children in their homes."}, {"url": "http://www.deseretnews.com/article/865569562/Saving-for-souls-Sending-a-missionary-out-can-be-cheaper-than-leaving-them-at-home.html?pg=all", "passage_text": "Saving souls and dollars. If you actually do the numbers, Marsh says, it is less expensive to have a kid on a mission than to have them at home.. In November 1990, the LDS Church announced the standardization of mission costs which, at the time, could vary from $150 to $750 a month. The current standardized cost is $400 for missionaries from the U.S. "}]