[{"url": "https://en.wikipedia.org/wiki/Mineral_lick", "passage_text": "Gaur at a natural salt lick. A mineral lick (also known as a salt lick) is a place where animals can go to lick essential mineral nutrients from a deposit of salts and other minerals. People use salt licks in the husbandry of livestock and to attract or maintain wildlife, whether it be for viewing, photography, farming, or hunting purposes. Maintaining artificial salt licks as a form of baiting is illegal in some states in the United States, but legal in others."}, {"url": "http://www.wta.org/hiking-info/basics/how-to/mountain-goat-basics-give-the-goat-the-trail-1", "passage_text": "No matter how cute they are, mountain goats are still wild animals. It's up to hikers to give the goats a wide berth, even if they are standing close to, or even in, the trail. 1  Try to stay 50 yards (or about 150 feet) away from mountain goats at all times. 2  Do not feed the mountain goats or allow them to lick your skin or gear. 1 No matter how cute they are, mountain goats are still wild animals. 2  It's up to hikers to give the goats a wide berth, even if they are standing close to, or even in, the trail. 3  If the trail doesn't permit you to go around, consider turning back early."}, {"url": "https://en.wikipedia.org/wiki/Mountain_Goat", "passage_text": "The mountain goat is an even-toed ungulate of the order Artiodactyla and the family Bovidae that includes antelopes, gazelles, and cattle. It belongs to the subfamily Caprinae (goat-antelopes), along with 32 other species including true goats, sheep, the chamois, and the muskox. Male goats also have longer horns and longer beards than females. Mountain goats can weigh between 45 and 140 kg (99 and 309 lb), though even males will often weigh less than 82 kg (181 lb)."}, {"url": "http://www.defenders.org/mountain-goat/basic-facts", "passage_text": "The mountain goat sports a coat of wooly, white fur that keeps it warm at high elevations. Known for their agility, mountain goats are most often seen scaling steep, rocky ledges. This extreme alpine environment provides them with adequate protection from predators. Behavior. Mountain goats are active both during the day and night, but take time to rest under overhanging cliffs. They mostly live in herds and move around according to season. In the summer, smaller groups will travel to salt licks."}, {"url": "https://www.thedodo.com/mountain-goats-climb-pictures-1165313702.html", "passage_text": "Mountain goats are inclined to go unbelievable lengths to get a lick of salt. Facebook/JornalCiencia. They scramble up rocks on hooves built for the steep climb and totally act like it's no big deal. Facebook/JornalCiencia. Yeah, whatevs. "}, {"url": "http://www.nationalparkstraveler.com/2010/10/how-might-fatal-attack-mountain-goat-change-backcountry-dynamics-national-parks7117", "passage_text": "I have heard about some other behaviors that were more related to salt, antifreeze, and females with young but nothing like that goat in Olympic.. Mountain goats are attracted to salt, and that can be in the form of sweat on the straps of your pack or in your urine. Submitted by admin on November 2, 2010 - 8:00am. This recent mountain goat attack should be a warning to all hikers. I recently hiked nearly 50 miles this summer in the Glacier National Forest and encountered several experiences with mountain goats."}, {"url": "http://wdfw.wa.gov/living/mountain_goats.html", "passage_text": "Living with Wildlife. Mountain Goats. Between 2,400 and 3,200 mountain goats are estimated to live in Washington. Mountain goats are native to the Cascade Range, and can be found from the Canadian border on the north to the Oregon border on the south. A few mountain goats inhabit the Blue Mountains of southeastern Washington where they have probably colonized from reintroductions in Oregon. Mountain goats are not native to the Olympic Peninsula; these goats descended from introductions in the 1920s. Description. The mountain goat (Oreamnos americanus), which occurs only in northwestern North America, is the only genus and species of its kind in the world."}, {"url": "https://en.wikipedia.org/wiki/Mountain_Goat", "passage_text": "The mountain goat (Oreamnos americanus), also known as the Rocky Mountain goat, is a large hoofed mammal endemic to North America. A subalpine to alpine species, it is a sure-footed climber commonly seen on cliffs and ice. Despite its vernacular name, it is not a member of Capra, the genus that includes all other goats, such as the wild goat, Capra aegagrus, from which the domestic goat is derived. Male goats also have longer horns and longer beards than females. Mountain goats can weigh between 45 and 140 kg (99 and 309 lb), though even males will often weigh less than 82 kg (181 lb)."}, {"url": "http://www.defenders.org/mountain-goat/basic-facts", "passage_text": "Despite its name, the mountain goat is actually a member of the antelope family. Known for their agility, mountain goats are most often seen scaling steep, rocky ledges. This extreme alpine environment provides them with adequate protection from predators. Behavior. Mountain goats are active both during the day and night, but take time to rest under overhanging cliffs. They mostly live in herds and move around according to season. In the summer, smaller groups will travel to salt licks."}]