[{"url": "http://betterforyou.com/blogs/roasted-sweet-potatoes", "passage_text": "3. When sweet potatoes are done, bake the streusel topping on a foil-lined baking sheet at 425ºF until crispy, about 15 minutes. Reheat the sweet potatoes in the oven for 5 minutes if necessary. Transfer the roasted sweet potato wedges to a serving dish and top with the streusel. Too bad it usually comes loaded with butter, cream, and sugar. Here, we take sweet potatoes and give them a better-for-you do-over with just the right amount of sweetness and crunch. Recipe Remake Secrets: 1  Crisping sweet potato wedges means you can cut the cream and a lot of the butter you would use with a casserole."}, {"url": "http://healthyeating.sfgate.com/make-healthy-potato-wedges-6295.html", "passage_text": "You’ll want to preheat your oven to 400 degrees Fahrenheit and place your potato wedges on a light-colored baking sheet. Darker baking sheets can result in burning. If you don’t have a light baking sheet, line what you have with parchment, a silicone mat or aluminum foil. Toss the potatoes with enough liquid to coat them thoroughly, then add seasonings. Ground black pepper, crushed red peppers, paprika, lemon pepper and ground cloves are examples of healthful seasonings to use. Fresh or dried herbs work well, too; parsley, cilantro, basil or rosemary is tasty on potato wedges."}, {"url": "http://www.pickyourown.org/freezing_sweetpotato.htm", "passage_text": "You probably take sweet potatoes for granted. You're there, the can of sweet potato is there, there's a sweet potato on the label... open it and mix it up with spices to make a casserole or sweet potato pie or candied yams. "}, {"url": "http://healthyeating.sfgate.com/make-healthy-potato-wedges-6295.html", "passage_text": "Either place a paper towel over them to retain moisture while they microwave, or reheat the wedges in a warm oven to refresh the crispiness. If you used russet potatoes, the wedges from one medium potato will have 168 calories. With sweet potatoes, the yield from one large potato will have around 162 calories. Toss the potatoes with enough liquid to coat them thoroughly, then add seasonings. Ground black pepper, crushed red peppers, paprika, lemon pepper and ground cloves are examples of healthful seasonings to use. Fresh or dried herbs work well, too; parsley, cilantro, basil or rosemary is tasty on potato wedges."}, {"url": "http://minimalistbaker.com/sweet-potato-wedges-no-honey-mustard-sauce/", "passage_text": "Sweet Potato Wedges with No Honey Mustard Sauce. Oh, sweet potatoes. Your color, your flavor, your texture, your nutrients. The way your edges get crisp and your centers remain tender. The way you complement spicy flavors so well. The way you pair with Mexican food like besties"}, {"url": "http://www.bbc.co.uk/food/recipes/sweetpotatowedges_83345", "passage_text": "Preheat the oven to 200C/400F/Gas 6. Toss the wedges with the oil and thyme then season well with salt and freshly ground black pepper. Roast in the oven for 15-20 minutes, until lightly browned. Serve in a warm bowl and garnish with chervil. Sweet potato wedges. Sweet potato wedges make a great alternative to potato and count as one of your 5-a-day. These wedges provide 229 kcal, 2g protein, 30g carbohydrate (of which 8g sugars), 11g fat (of which 2g saturates), 5g fibre and 0.2g salt per portion."}, {"url": "http://allrecipes.com/recipe/50768/sweet-potato-kumara-wedges/", "passage_text": "1 Drizzle a medium baking sheet with the vegetable oil. 2  In a large, resealable plastic bag, mix flour, paprika, mustard powder, salt, and pepper. 3  Place sweet potato wedges in the bag, and toss to coat. 4  Arrange coated sweet potato wedges on the prepared baking sheet. 1 Preheat oven to 400 degrees F (200 degrees C). 2  Drizzle a medium baking sheet with the vegetable oil. 3  In a large, resealable plastic bag, mix flour, paprika, mustard powder, salt, and pepper. 4  Place sweet potato wedges in the bag, and toss to coat. 5  Arrange coated sweet potato wedges on the prepared baking sheet."}, {"url": "http://minimalistbaker.com/sweet-potato-wedges-no-honey-mustard-sauce/", "passage_text": "1 Toss sweet potatoes in oil until all sides are well coated. Season with salt and pepper and toss once more, then arrange in a single layer on the baking sheet (if crowded, use two baking sheets). 2  Bake for a total of 25 minutes, or until golden brown and tender, flipping once at the halfway point to ensure even cooking. Oh, sweet potatoes. Your color, your flavor, your texture, your nutrients. The way your edges get crisp and your centers remain tender. The way you complement spicy flavors so well."}]