[{"url": "http://www.designntrend.com/articles/26378/20141119/game-thrones-star-charles-dance-says-peter-dinklage-must-envy-dwarf-actor-world.htm", "passage_text": "shares tweet. Tags: Game of Thrones. (Photo: Getty Images-Slaven Vlasic, Albert L. Ortega) 'Game of Thrones' stars Charles Dance (L) and Peter Dinklage. Charles Dance, the guy who plays Tywin Lannister in HBO's Game of Thrones, thinks Peter Dinklage must be the envy of every dwarf actor in the world.. One of the biggest joys was working with Peter Dinklage. He's the sweetest man, and a phenomenal actor, Dance, who has a supporting role alongside fellow Brit Benedict Cumberbatch in the Oscar-buzzing new film The Imitation Game, told the Daily Beast. "}, {"url": "http://gameofthrones.wikia.com/wiki/Peter_Dinklage", "passage_text": "Peter Dinklage (born 11 June 1969) is an American actor who has worked in television, film and on stage. He is arguably best known for his roles in The Station Agent, the Chronicles of Narnia film series and as a series regular on Threshold and a recurring guest star on Nip/Tuck. He stars in HBO 's Game of Thrones as Tyrion Lannister. He was announced in the role on 5 May 2009 and was the first actor confirmed for the series."}, {"url": "http://www.imdb.com/name/nm0227759/bio", "passage_text": "He was George R.R. Martin 's first choice to play Tyrion Lannister in Game of Thrones (2011). For his role on Game of Thrones (2011), named one of the Eight Actors Who Turn Television into Art, in cover story of The New York Times Magazine (9/11/11). Peter Dinklage received acclaim for his first film, Living in Oblivion (1995), where he played an actor frustrated with the limited and caricatured roles offered to dwarf actors. In 2003, he starred in The Station Agent (2003), written and directed by Tom McCarthy."}, {"url": "http://www.biography.com/people/peter-dinklage-20787107", "passage_text": "Dinklage's most significant television work, however, came in 2011 with the premiere of Game of Thrones. In the series based on George R. R. Martin 's A Song of Ice and Fire fantasy novels, he plays Tyrion Lannister, a dwarf of noble birth. "}, {"url": "http://hbowatch.com/peter-dinklage-april-season-four/", "passage_text": "EXCLUSIVE: Leading Game of Thrones actor and Emmy winner Peter Dinklage will not return to HBO’s flagship program for a fourth season in 2014. In a press conference the morning of April 1st, 2013 show creators David Benioff, Dan Weiss alongside George R.R. Martin made the announcement to stunned members of the media. "}, {"url": "https://en.wikipedia.org/wiki/Peter_Dinklage", "passage_text": "Dinklage plays Tyrion Lannister in HBO's Game of Thrones, an adaptation of author George R. R. Martin 's A Song of Ice and Fire series. Peter Hayden Dinklage (/ˈdɪŋklɪdʒ/ DINGK-lij, born June 11, 1969) is an American actor. Since his breakout role in The Station Agent (2003), he has appeared in numerous films and voiced Ghost in the video game, Destiny. Since 2011, Dinklage has played Tyrion Lannister in the HBO series Game of Thrones. He won an Emmy and a Golden Globe Award for Supporting Actor in 2011, as well as consecutive Primetime Emmy nominations for the role from 2012 to 2014. He also won a second Emmy for Outstanding Supporting Actor in a Drama Series in 2015"}, {"url": "http://www.imdb.com/name/nm0227759/", "passage_text": "Actor | Producer | Soundtrack. Peter Dinklage was born in Morristown, New Jersey, to Diane (Hayden), an elementary school teacher, and John Carl Dinklage, an insurance salesman. He is of German, Irish, and English descent. In 1991, he received a degree in drama from Bennington College and began his career. "}, {"url": "http://www.imdb.com/name/nm0227759/bio", "passage_text": "Peter Dinklage was born in Morristown, New Jersey, to Diane (Hayden), an elementary school teacher, and John Carl Dinklage, an insurance salesman. He is of German, Irish, and English descent. In 1991, he received a degree in drama from Bennington College and began his career. Peter Dinklage received acclaim for his first film, Living in Oblivion (1995), where he played an actor frustrated with the limited and caricatured roles offered to dwarf actors. In 2003, he starred in The Station Agent (2003), written and directed by Tom McCarthy."}, {"url": "http://www.businessinsider.com/game-of-thrones-peter-dinklage-almost-turned-down-role-2015-4", "passage_text": "HBO Peter Dinklage was originally concerned about how his character would be portrayed on the HBO series. It's impossible to imagine anyone but actor Peter Dinklage as Tyrion Lannister on Game of Thrones.. Dinklage, who won an Emmy for his performance on the HBO series, brings a slyness and modernity to the character, making him the show's most beloved bad boy. "}]