[{"url": "http://www.audioenglish.org/dictionary/ensign.htm", "passage_text": "The noun ENSIGN has 3 senses: 1. a person who holds a commissioned rank in the United States Navy or the United States Coast Guard; below lieutenant junior grade. 2. an emblem flown as a symbol of nationality. 3. colors flown by a ship to show its nationality. Familiarity information: ENSIGN used as a noun is uncommon. "}, {"url": "https://en.wikipedia.org/wiki/Ensign", "passage_text": "1 A civil ensign (usage symbol) is worn by merchant and pleasure vessels. 2  In some countries the yacht ensign, used on recreational boats or ships instead of merchant vessels, differs from the civil ensign. 3  A state ensign or government ensign (usage symbol) is worn by government vessels, such as coast guard ships. Ensigns are usually at the stern flagstaff when in port, and may be shifted to a gaff (if available) when the ship is under way, becoming known as a steaming ensign. Vexillologists distinguish three varieties of a national flag when used as an ensign:"}, {"url": "http://military.wikia.com/wiki/Ensign_(rank)", "passage_text": "Ensign /ˈɛnsən/ late 14c., via Scottish, from Old French enseigne (12c.) mark, symbol, signal; flag, standard, pennant, from Latin insignia (plural) is a junior rank of a commissioned officer in the armed forces of some countries, normally in the infantry or navy. Ensign is enseigne in French, Faehnrich fähnrich In, German vaandrig In (dutch whereby despite the fact That faehnrich Fähnrich and vaandrig have a, parallel etymology they are not a junior officer but only an officer), cadet rank and Chorąży, in polish each of which derives from a term for. a flag"}, {"url": "https://en.wikipedia.org/wiki/Ensign", "passage_text": "In nautical use, the ensign is flown on a ship or boat to indicate its nationality. Ensigns are usually at the stern flagstaff when in port, and may be shifted to a gaff (if available) when the ship is under way, becoming known as a steaming ensign. Vexillologists distinguish three varieties of a national flag when used as an ensign: 1  A civil ensign (usage symbol) is worn by merchant and pleasure vessels. 2  In some countries the yacht ensign, used on recreational boats or ships instead of merchant vessels, differs from the civil ensign"}, {"url": "http://www.redensigngroup.org/faqs.aspx", "passage_text": "The Red Ensign (or Red Duster as it is occasionally known) is a flag that originated in the early 17th century as a British ensign flown by the Royal Navy and was later adopted specifically by British merchantmen to be flown as the civil ensign of the British merchant fleet. A ny vessel registered in the UK, a Crown Dependency (CD) or an Overseas Territory (OT), is a British ship and is entitled to fly the British Merchant Shipping flag the 'Red Ensign' (or a version of it defaced with the appropriate national colour)."}, {"url": "https://en.wikipedia.org/wiki/Ensign", "passage_text": "An ensign is a national flag when used at sea as a country's maritime flag. Ensigns are usually at the stern flagstaff when in port, and may be shifted to a gaff (if available) when the ship is under way, becoming known as a steaming ensign. Vexillologists distinguish three varieties of a national flag when used as an ensign:"}, {"url": "http://www.usps.org/f_stuff/etiquett.html", "passage_text": "The national ensign or yacht ensign is hoisted at the stern (or set in place on its staff). This is followed, as applicable, by a foreign ensign (courtesy flag), a club or squadron burgee, organizational flags, an officer flag or private signal and then by any other signals not already fling, such as a guest flag. "}, {"url": "http://www.northernflags.com/ensign-flags", "passage_text": "Red Ensign. The Red Ensign (red field with the Union Flag in the canton*) undefaced is for the use of all other British merchant navy ships and private craft. The Red Ensign is the correct flag to be worn as courtesy flag by foreign private vessels in United Kingdom waters. Blue Ensign. The Blue Ensign (dark blue field with the Union Flag in the canton) undefaced is worn by masters of vessels in possession of a warrant issued by the Director of Naval Reserves, and by the members of certain yacht clubs."}, {"url": "http://www.merriam-webster.com/dictionary/ensign", "passage_text": "Full Definition of ENSIGN. 1. : a flag that is flown (as by a ship) as the symbol of nationality and that may also be flown with a distinctive badge added to its design. 2. a: a badge of office, rank, or power b: emblem, sign"}]