[{"url": "http://www.klonopinaddictionhelp.com/how-long-do-klonopin-withdrawal-symptoms-last", "passage_text": "What to Expect from Klonopin Detoxification. Klonopin withdrawals are different for everyone, though it will likely be intense at the beginning and then they will gradually lessen. Symptoms typically develop within 24 -72 hours and become their worst after about 5-7 days. The average length of Klonopin withdrawal is about six weeks, though in some people certain symptoms can persist for months. The symptoms often run a two-phase course where they seem to get better after a week, but then they intensify the next week."}, {"url": "http://anxiety.emedtv.com/clonazepam/clonazepam-withdrawal-symptoms.html", "passage_text": "It is a benzodiazepine medication that can cause psychological and physical dependence. If you abruptly stop taking it, withdrawal symptoms could occur. Stopping clonazepam too quickly (especially if you have been taking high doses of the drug) can lead to withdrawal symptoms such as: 1  Numbness or tingling."}, {"url": "http://mentalhealthdaily.com/2014/06/13/klonopin-clonazepam-withdrawal-symptoms-duration/", "passage_text": "Cold turkey withdrawal may result in potentially dangerous symptoms such as experiencing a seizure. Some have stated that the proper way to taper off of Klonopin is by reducing the total daily dose by 0.125 mg (1/8 mg) on a weekly basis."}, {"url": "http://mentalhealthdaily.com/2014/06/13/klonopin-clonazepam-withdrawal-symptoms-duration/", "passage_text": "I was on Klonopin for 8 years and was a slave to it because its horrible withdrawal symptoms. I decided to quit about six months ago, but was very afraid because of the horrible withdrawal feelings I had when I ran out for a day or two."}, {"url": "http://www.livestrong.com/article/77250-klonopin-withdrawal-symptoms/", "passage_text": "Klonopin Withdrawal Symptoms Photo Credit Jupiterimages/Photos.com/Getty Images. Klonopin is a medication prescribed by physicians to treat anxiety, seizure disorders and restless leg syndrome. It is a benzodiazepine type drug. Klonopin is highly effective and usually produces desirable results with minimal side effects."}, {"url": "http://mentalhealthdaily.com/2014/06/13/klonopin-clonazepam-withdrawal-symptoms-duration/", "passage_text": "Although this drug is most commonly prescribed for epileptic seizures, it has a variety of other uses including: treatment of anxiety disorders (including social phobia), migraine headaches, mania, acute psychosis, hyperekplexia, parasomnia, alcohol withdrawal syndrome, as well as restless leg syndrome."}, {"url": "http://mentalhealthdaily.com/2014/06/13/klonopin-clonazepam-withdrawal-symptoms-duration/", "passage_text": "When it comes to withdrawal from any medication, especially a benzodiazepine, there are factors that will influence the severity of withdrawal. These factors include things like time span, the dose of the drug, your individual physiology, as well as how quickly you tapered off of the drug."}, {"url": "http://www.pointofreturn.com/clonazepam_withdrawal.html", "passage_text": "One-third of Clonazepam patients will develop tolerance to the drug in 2-4 weeks and will suffer from the Benzodiazepine Withdrawal Syndrome, a grouping of extremely painful symptoms that can last many months."}]