[{"url": "https://en.wikipedia.org/wiki/Typha", "passage_text": "Typha /ˈtaɪfə/ is a genus of about 30 species of monocotyledonous flowering plants in the family Typhaceae. It has also been introduced to Australia. T. angustifolia is nearly as widespread, but does not extend as far north; it may be introduced and invasive in North America. T. domingensis has a more southern American distribution, and it occurs in Australia. T. orientalis is widespread in Asia, Australia, and New Zealand."}, {"url": "http://www.pfaf.org/user/plant.aspx?LatinName=Typha+latifolia", "passage_text": "Main Bloom Time: Late summer, Mid summer. Typha latifolia (Common Cattail, or Broadleaf Cattail) is a common perennial marsh, or wetland plant in temperate, tropical, and subtropical climates throughout the Northern Hemisphere. "}, {"url": "https://en.wikipedia.org/wiki/Typha_latifolia", "passage_text": "While Typha latifolia grows all over, including in rural areas, it is not advisable to eat specimens deriving from polluted water as it absorbs pollutants and in fact is used as a bioremediator. Specimens with a very bitter or spicy taste should not be eaten. Traditionally, Typha latifolia has been a part of many native North American cultures, as a source of food, medicine, and for other uses. The rhizomes are edible after cooking and removing the skin, while peeled stems and leaf bases can be eaten raw, or cooked."}, {"url": "https://en.wikipedia.org/wiki/Typha_latifolia", "passage_text": "Typha latifolia (bulrush, common bulrush, broadleaf cattail, common cattail, great reedmace, cooper's reed, cumbungi) is a perennial herbaceous plant in the genus Typha. It is found as a native plant species in North and South America, Europe, Eurasia, and Africa. Traditionally, Typha latifolia has been a part of many native North American cultures, as a source of food, medicine, and for other uses. The rhizomes are edible after cooking and removing the skin, while peeled stems and leaf bases can be eaten raw, or cooked."}, {"url": "http://www.ecy.wa.gov/programs/wq/plants/native/cattail.html", "passage_text": "Cattail; a common and useful native plant. Cattails are one of the most common and easily identified of our water-loving plants. Most people are familiar with the long green leaves and hot-dog shaped brown flower spikes of our common native cattail, Typha latifolia. It is found growing in dense stands in areas with shallow water or seasonal flooding, or as a narrow band along the margins of deeper water. It is a widespread plant, found throughout most of North America, Europe, Asia and Africa. Washington also harbors another cattail species, Typha angustifolia, or narrow leaf cattail. It is an invader from other parts of the country, and so far is only known from a couple of locations."}, {"url": "http://www.rook.org/earl/bwca/nature/aquatics/typhalat.html", "passage_text": "1 Typha latifolia x T. angustifolia hybrids (Typha x glauca .), commonly known as Hybrid or Glaucus Cattail, are especially common in the Midwest and may develop extensive pure stands by rhizomatous growth. 2  Hybrids are almost always intermediate in form between the parent species. 1 Distribution of these species overlaps considerably in the contiguous US. 2  Where Typha latifolia and Typha angustifolia occur together, hybrids are common, especially in habitats with variable water levels."}, {"url": "http://dnr.wi.gov/topic/Invasives/fact/NarrowLeavedCattail.html", "passage_text": "Hybrid cattail (Typha x glauca) is a hybrid of common and narrow-leaved cattails, and its structure is intermediate between that of its parental species. The best way to identify the hybrids is to first learn the characteristics of T. angustifolia and T. latifolia, then look for plants that are intermediate. Similar species: Common (broad-leaved) cattail (Typha latifolia; native) generally does not have a gap between male and female sections of the inflorescence and differs in several often tiny features of the leaves, flowers, and fruits."}, {"url": "http://www.illinoiswildflowers.info/wetland/plants/nl_cattail.htm", "passage_text": "Narrow-Leaved Cattail. Typha angustifolia. Cattail family (Typhaceae). Description: This perennial plant is 3-7' tall and unbranched, consisting of a flowering stalk and 4 or more leaves. The flowering stalk is light green to green, glabrous, stiff, and round in cross-section (terete). The leaves are 1 –6' long and up to  across. At one time, this plant was relatively uncommon in Illinois, but it has become increasingly common. In some areas, Narrow-Leaved Cattail is even more common than Typha latifolia (Common Cattail). Habitats include marshes, edges of ponds and rivers, and ditches. Narrow-Leaved Cattail is often the dominant plant in a wetland area; sometimes it is codominant with Common Cattail"}, {"url": "http://www.rook.org/earl/bwca/nature/aquatics/typhaan.html", "passage_text": "1 Typha latifolia x Typha angustifolia hybrids (Typha X glauca), commonly known as Hybrid or Glaucus Cattail, are especially common in the Midwest and may develop extensive pure stands by rhizomatous growth. Name: 1  Typha, from the Greek, tufh (typhe), bulrush, cattail, perhaps from typhein, to smoke or to emit smoke, in allusion either to the use of the spikes for maintaining smoky fires or to the smoky brown color of the fruiting spikes."}]