[{"url": "https://www.educalc.net/196488.page", "passage_text": "Blaise Pascal (1623~1662). Blaise Pascal was France’s most celebrated mathematician and physicist and religious philosopher. He was a child prodigy who was educated by his father. He worked on conic sections and projective geometry and he laid the foundations for the theory of probability. In 1642, at the age of 18, Pascal invented and build the first digital calculator as a means of helping his father perform tedious tax accounting."}, {"url": "http://www.maths.tcd.ie/pub/HistMath/People/Pascal/RouseBall/RB_Pascal.html", "passage_text": "Pascal was kept at home in order to ensure his not being overworked, and with the same object it was directed that his education should be at first confined to the study of languages, and should not include any mathematics. "}, {"url": "http://www.catholic.org/saints/saint.php?saint_id=28", "passage_text": "When Blaise was sentenced to be starved to death, the woman, in gratitude, sneaked into the prison with food and candles. Finally Blaise was killed by the governor. Blaise is the patron saint of wild animals because of his care for them and of those with throat maladies. Take time as Saint Blaise did to find out how you can help wild animals. Find out what is being done to support and protect the wildlife in your area. There is wildlife everywhere, even in cities. Saint Blaise, pray for us that we may not suffer from illnesses of the throat and pray that all who are suffering be healed by God's love. Amen. Copyright 1996-2000 by Terry Matz."}, {"url": "http://www.ideafinder.com/history/inventors/pascal.htm", "passage_text": "Blaise Pascal, French philosopher, mathematician, and physicist, considered one of the great minds in Western intellectual history. Inventor of the first mechanical adding machine. Blaise Pascal was born in Clermont-Ferrand on June 19, 1623, and his family settled in Paris in 1629. "}, {"url": "http://plato.stanford.edu/entries/pascal/", "passage_text": "Pascal was born in Clermont (now Clermont-Ferrand), France, on 19 June 1623, and died thirty-nine years later in Paris (19 August 1662). Following his mother's death when he was three years old, Blaise was reared by his father, Étienne, étienne in the company of his two, Sisters (gilberte. b) 1620 And (jacqueline. b). 1625, later In, paris the family hired a maid Named Louise, delfault who became effectively a member of the-close knit. family"}, {"url": "http://plato.stanford.edu/entries/pascal/", "passage_text": "Then, for the first time in his life, Blaise Pascal was alone and still in poor health. He soon began to accept spiritual guidance from his sister Jacqueline and subsequently from a prominent Jansenist, Antoine Singlin (1607–64). Following his mother's death when he was three years old, Blaise was reared by his father, Étienne, étienne in the company of his two, Sisters (gilberte. b) 1620 And (jacqueline. b). 1625, later In, paris the family hired a maid Named Louise, delfault who became effectively a member of the-close knit. family"}, {"url": "http://www.leaderu.com/orgs/probe/docs/pascal.html", "passage_text": "Introduction. One apologist who was not guilty of this was Blaise Pascal, a seventeenth-century mathematician, scientist, inventor and Christian apologist. Christ and the need for redemption through Him were central to Pascal's apologetics. "}, {"url": "https://www.probe.org/blaise-pascal-an-apologist-for-our-times/", "passage_text": "One apologist who was not guilty of this was Blaise Pascal, a seventeenth-century mathematician, scientist, inventor and Christian apologist. Christ and the need for redemption through Him were central to Pascal’s apologetics. Peter Kreeft, a modern day Christian philosopher and apologist, says that Pascal is a man for our day. “Pascal,” he says, “is three centuries ahead of his time. He addresses his apologetic to modern pagans, sophisticated skeptics, comfortable members of the new secular intelligentsia."}, {"url": "http://www.historyguide.org/intellect/bpascal.html", "passage_text": "Blaise Pascal, 1623-1662 We run carelessly to the precipice, after we have put some thing before us to prevent us seeing it. The French mathematician, theologian, physicist and man-of-letters, Blaise Pascal, was born June 19 at Clermont-Ferrand, the son of the local president of the court of exchequer."}, {"url": "https://www.probe.org/blaise-pascal-an-apologist-for-our-times/", "passage_text": "His mother died when he was three, and he was raised by his father, a respected mathematician, who personally directed his education. Young Blaise took after his father in mathematics. In 1640, at age 16, he published an essay on the sections of a cone which was much praised. {2} Between 1642 and 1644 Pascal developed a calculating machine for his father to use in his tax computations. Peter Kreeft, a modern day Christian philosopher and apologist, says that Pascal is a man for our day. “Pascal,” he says, “is three centuries ahead of his time. He addresses his apologetic to modern pagans, sophisticated skeptics, comfortable members of the new secular intelligentsia."}]