[{"url": "https://www.nlm.nih.gov/medlineplus/ency/article/002467.htm", "passage_text": "Amino acids are found in animal sources such as meats, milk, fish, and eggs. They are also found in plant sources such as soy, beans, legumes, nut butters, and some grains (such as wheat germ and quinoa). You do not need to eat animal products to get all the protein you need in your diet."}, {"url": "http://www.webmd.com/diet/guide/high-protein-diet-weight-loss", "passage_text": "It's a good idea to change up your protein foods. For instance, you could have salmon or other fish that's rich in omega-3s, beans or lentils that give you fiber as well as protein, walnuts on your salad, or almonds on your oatmeal."}, {"url": "http://www.diabetes.org/food-and-fitness/food/what-can-i-eat/making-healthy-food-choices/meat-and-plant-based-protein.html", "passage_text": "Protein Foods. Foods high in protein such as fish, chicken, meats, soy products, and cheese, are all called “protein foods.” You may also hear them referred to as ‘meats or meat substitutes.”. The biggest difference among foods in this group is how much fat they contain, and for the vegetarian proteins, whether they have carbohydrate."}, {"url": "http://www.daveywaveyfitness.com/nutrition/9-tips-to-increase-protein-in-your-diet-think-outside-the-shake", "passage_text": "1 Add protein powder to other foods. 2  If you add a scoop or two of protein powder to other foods – like oatmeal, muffins or pancakes – you’ll get the protein you need but without the nasty taste. 3  Just make sure you use a protein flavor (like vanilla) that works with the food’s flavor. 4  Stock up on cottage cheese."}, {"url": "http://www.ehow.com/how_4505478_increase-protein-intake-consuming-surplus.html", "passage_text": "Check with your physician before beginning any diet, but protein is a necessary part of any diet plan, and some consumption on a daily basis is necessary. There are basic amounts of protein found in any number of foods, but primarily it exists in meats, nuts, and dairy products."}, {"url": "http://www.diabetes.org/food-and-fitness/food/what-can-i-eat/making-healthy-food-choices/meat-and-plant-based-protein.html", "passage_text": "Listen. Foods high in protein such as fish, chicken, meats, soy products, and cheese, are all called “protein foods.” You may also hear them referred to as ‘meats or meat substitutes.”. The biggest difference among foods in this group is how much fat they contain, and for the vegetarian proteins, whether they have carbohydrate."}, {"url": "https://www.kidney.org/atoz/content/enjoy", "passage_text": "* It is very important for you to eat enough high-value protein to keep your body healthy. * Dairy products are high-value protein, but are also high in phosphorus. You may need to use less dairy products in your diet to control your blood level of phosphorus. 1  Vegetable or plant proteins are low-value proteins."}]