[{"url": "http://gonw.about.com/od/attractionswa/tp/whidbeyislandfun.htm", "passage_text": "Located in Coupeville, this museum is devoted to local history. Mammoths and their lives on prehistoric Whidbey Island are the subject of one exhibit. Pioneer history and island transportation are also covered. Be sure to view their film about Ebey's Landing for a greater appreciation of the island's history. Whidbey Island has a wiggle-y and twisty shoreline, resulting in interesting coves and harbors. There are also several freshwater lakes on Whidbey Island. 1  Boating. 2  Marinas are located at Deception Pass State Park, Oak Harbor, and Langley."}, {"url": "https://en.wikipedia.org/wiki/Whidbey_Island", "passage_text": "(The other large island is Camano Island, east of Whidbey.) Whidbey is about 30 miles (48 km) north of Seattle, and lies between the Olympic Peninsula and the I-5 corridor of western Washington. The island forms the northern boundary of Puget Sound. It is home to Naval Air Station Whidbey Island. Two public airports provide service to Whidbey Island. Whidbey Air Park is located 2 miles (3.2 km) southwest of Langley with a 2,470 feet (750 m) long runway. Wes Lupien Airport is located 3 miles (4.8 km) southwest of Oak Harbor with a 3,265 ft (995"}, {"url": "http://whidbeyisland.us/the-10-best-things-to-do-on-whidbey-island/", "passage_text": "Things to Do on Whidbey Island. When I was growing up on Whidbey Island, I went through a few phases. There was a phase, when I was around when I thought that Whidbey Island was boring, that there were no fun things to do on Whidbey island. Seriously. Get up, walk out the door, and go for a hike. The hiking is really just trying to find the best view, that’s what it’s all about. Whidbey Island has more than 100 miles of hiking and biking trails, plus miles upon miles of beautiful beach to comb over and enjoy."}, {"url": "http://www.cascadiakids.com/whidbey-island-for-families/", "passage_text": "We spoke with Deb Crager, author of 101 Things to Do on Whidbey Island, for her suggestions on what to do on this beautiful 35-mile-long island, an easy day trip from Seattle (it’s only 30 miles north of Seattle), or weekend getaway from British Columbia or North Washington. Knead ‘n’ Feed, a good family restaurant on Whidbey Island. Whidbey Island is an island that offers so much, every day, every month. There are events every weekend that cover the range of environmental issues to historical events, to art events."}, {"url": "http://www.coupevillelodging.com/things-to-do/", "passage_text": "Enjoy the most beautiful views and walks on Whidbey Island at Ebey’s Landing and the Bluff Trail. Located under 10 minutes from downtown Coupeville, there are stunning views of Puget Sound, the Olympic Mountains, the shipping lanes and beautiful sunsets. Things To Do. Explore historic waterfront Coupeville’s shops, restaurants, galleries and bakeries. Stroll along the Front Street with breathtaking views of Penn Cove and Mount Baker. More info. Walk to the end of the Coupeville Wharf where visitors by boat tie up."}, {"url": "http://gonw.about.com/od/attractionswa/tp/whidbeyislandfun.htm", "passage_text": "You'll want to have a general idea of the things you want to do and the sights you want to see, but relax and plan for spontaneity. Whidbey Island is long but narrow, so you really can't get lost. Whidbey Island has a wiggle-y and twisty shoreline, resulting in interesting coves and harbors. There are also several freshwater lakes on Whidbey Island. 1  Boating. 2  Marinas are located at Deception Pass State Park, Oak Harbor, and Langley."}, {"url": "http://whidbeycamanoislands.com/things-to-do/parks-scenery/family-fun/", "passage_text": "Your trip to Whidbey Island begins the moment your car stops on the ferry. The kids get to explore one of Washington’s icons, and there are plenty of interpretive signs on the vessel to help your kids (and you) understand the unique nature here. This $30 dollar year-long pass to all of Washington’s 100+ state parks is a great bargain. This parking pass means the whole family gets in for the one price. Otherwise, each park is $10 a day. Also, there are several county and city parks with beaches, and you can use them at no charge."}, {"url": "http://gonw.about.com/od/attractionswa/tp/whidbeyislandfun.htm", "passage_text": "While on Whidbey Island, you'll discover interesting history, delicious local foods, unique shops and galleries, picturesque gardens and farms, and water, island, and mountain views in every direction. You'll also have the chance to enjoy a full range of outdoor recreation, including hiking, kayaking, and boating. Whidbey Island has a wiggle-y and twisty shoreline, resulting in interesting coves and harbors. There are also several freshwater lakes on Whidbey Island. 1  Boating. 2  Marinas are located at Deception Pass State Park, Oak Harbor, and Langley."}, {"url": "http://www.cascadiakids.com/whidbey-island-for-families/", "passage_text": "The libraries on Whidbey Island have many things for the kids to do, including storytimes and craft projects. Even if the structured events don’t appeal to the kids or you, walking on the beach, collecting the rocks and shells is a timeless hobby. Knead ‘n’ Feed, a good family restaurant on Whidbey Island. Whidbey Island is an island that offers so much, every day, every month. There are events every weekend that cover the range of environmental issues to historical events, to art events."}, {"url": "http://gonw.about.com/od/attractionswa/tp/whidbeyislandfun.htm", "passage_text": "Hiking on Whidbey Island. Whether you like a vigorous hike or a scenic stroll, you'll find many opportunities to walk and wander on Whidbey Island. Here are just a few hiking options: 1  Deception Pass State Park. 2  With over 4,000 acres of hilly terrain, this gem of the Washington State Parks system has miles of trails. Whidbey Island has a wiggle-y and twisty shoreline, resulting in interesting coves and harbors. There are also several freshwater lakes on Whidbey Island. 1  Boating. 2  Marinas are located at Deception Pass State Park, Oak Harbor, and Langley."}]