[{"url": "http://www.holiday-weather.com/stockholm/averages/", "passage_text": "Stockholm: Annual Weather Averages. July is the hottest month in Stockholm with an average temperature of 18°C (64°F) and the coldest is January at -3°C (27°F) with the most daily sunshine hours at 12 in June. The wettest month is July with an average of 72mm of rain."}, {"url": "http://www.weather2travel.com/june/sweden/", "passage_text": "Check the Weather in Sweden in June before you book your next holiday. This gives the best indication of the weather in June and includes figures for temperature, sunshine and rainfall. The Sweden june weather guide shown below is for Stockholm. 1  20°C max day temperature."}, {"url": "http://www.weather2travel.com/june/sweden/stockholm.php", "passage_text": "Check the Weather in Stockholm, Sweden in June before you book your next holiday. This gives the best indication of the weather in June and includes figures for temperature, sunshine and rainfall. 1  20°C max day temperature."}, {"url": "https://weatherspark.com/averages/28952/6/Stockholm-Sweden", "passage_text": "Location. This report describes the typical weather at the Stockholm-Bromma Airport (Stockholm, Sweden) weather station over the course of an average June. It is based on the historical records from 1986 to 2012. Earlier records are either unavailable or unreliable."}, {"url": "https://weatherspark.com/averages/28952/6/Stockholm-Sweden", "passage_text": "This report describes the typical weather at the Stockholm-Bromma Airport (Stockholm, Sweden) weather station over the course of an average June. It is based on the historical records from 1986 to 2012."}, {"url": "https://weatherspark.com/averages/28952/6/Stockholm-Sweden", "passage_text": "Stockholm has a humid continental climate with warm summers and no dry season. The area within 25 mi of this station is covered by forests (60%), lakes and rivers (15%), oceans and seas (13%), and built-up areas (12%)."}, {"url": "https://weatherspark.com/averages/28952/6/Stockholm-Sweden", "passage_text": "Over the course of June typical wind speeds vary from 1 mph to 13 mph (light air to moderate breeze), rarely exceeding 17 mph (moderate breeze). The highest average wind speed of 7 mph (light breeze) occurs around June 13, at which time the average daily maximum wind speed is 13"}]