[{"url": "https://en.wikipedia.org/wiki/Lichen", "passage_text": "The lichen combination of fungus with algae and/or cyanobacteria has a very different form (morphology), physiology, and biochemistry to the component parts growing by themselves. The fungus benefits from the symbiotic relation because algae or cyanobacteria produce food by photosynthesis. The algae or cyanobacteria benefit by being protected from the environment by the filaments of the fungus, which also gather moisture and nutrients from the environment, and (usually) provide an anchor to it. Lichenized fungus may refer to the entire lichen, or to the fungus growing in it"}, {"url": "https://answers.yahoo.com/question/index?qid=20080114154617AABqmEf", "passage_text": "A thallus or the body of lichen consists of layers, that is, a cortex and medulla made up of the fungus, and a photosynthetic layer of algal or cyanobacterial cells that are closely associated with fungal hyphae. Rhizoids anchor thalli to their substrates. Best Answer: There is a plenty of information on the link provided by wikipedia = Just click on it = http://en.wikipedia.org/wiki/Lichen 1) Lichens do not have any symbiotic relationship with trees. 2) They do not bring any water / nutrients to trees 3) They do not help in keeping forest clean."}, {"url": "https://en.wikipedia.org/wiki/Symbiosis_in_lichens", "passage_text": "Symbiosis in lichens is the mutually helpful symbiotic relationship of green algae and/or blue-green algae (cyanobacteria) living among filaments of a fungus. The fungus benefits from the algae or cyanobacteria because they produce food by photosynthesis. The lichen combination of fungus and/or algae and/or cyanobacteria has a very different form (morphology), physiology, and biochemistry than the parts growing by themselves. The properties of the whole combination are very different from the sum of the properties of the parts liv"}, {"url": "http://www.answers.com/Q/A_lichen_is_a_symbiotic_association_between", "passage_text": "Lichen is the product of a symbiotic relationship between a fungus and a photosynthetic organism, usually a photosynthetic bacteria or algae. The photosynthetic organism gains … a place to live and protection. It is called a symbiotic relationship. These are very important in evolution. A lichen is made up of fungus cells for support and algae cells which fix carbon via photosynth … esis."}, {"url": "http://www.antarctica.gov.au/about-antarctica/wildlife/plants/lichens", "passage_text": "Lichens on Heard Island (Photo: Roger Kirkwood). A lichen is a plant formed from the symbiotic association of certain fungi and (usually) green algae. Lichens with associated cyanobacteria are also known. Lichens occupy many different habitats, often in extreme environments. "}, {"url": "https://answers.yahoo.com/question/index?qid=20081231232413AAlzN4D", "passage_text": "Lichens are symbiotic associations that a) usually involve an ascomycete and a green alga or cyanobacterium b) can reproduce sexually by forming soredia c) require moist environments to grow d) fix nitrogen for absorption by plant roots e) are unusually resistant to air pollution PLEASE HELP ME ANSWER THIS... Lichens are symbiotic associations that. a) usually involve an ascomycete and a green alga or cyanobacterium. b) can reproduce sexually by forming soredia. c) require moist environments to grow."}, {"url": "http://botany.si.edu/lichens/", "passage_text": "What is a Lichen? Lichens are the symbiotic association of a fungus and an alga. Most lichen-forming fungi are members of the ascomycetes, the fungal group that includes the destructive bread molds, the edible morels, and the commercially-important baking and brewing yeast. "}, {"url": "https://en.wikipedia.org/wiki/Lichen", "passage_text": "A lichen is a composite organism that arises from algae or cyanobacteria (or both) living among filaments of a fungus in a symbiotic relationship. The combined life form has properties that are very different from the properties of its component organisms. Lichens come in many colors, sizes, and forms. The fungus benefits from the symbiotic relation because algae or cyanobacteria produce food by photosynthesis. The algae or cyanobacteria benefit by being protected from the environment by the filaments of the fungus, which also gather moisture and nutrients from the environment, and (usually) provide an anchor to it. Lichenized fungus may refer to the entire lichen, or to the fungus growing in it"}, {"url": "https://answers.yahoo.com/question/index?qid=20080114154617AABqmEf", "passage_text": "The information below is from other link.== Lichens represent Symbiotic associations of fungi (mycobionts) and photosynthetic partners (photobionts). These associations always result in a distinct morphological body termed a thallus that may adhere tightly to the substrate or be leafy, stalked, or hanging. Best Answer: There is a plenty of information on the link provided by wikipedia = Just click on it = http://en.wikipedia.org/wiki/Lichen 1) Lichens do not have any symbiotic relationship with trees. 2) They do not bring any water / nutrients to trees 3) They do not help in keeping forest clean."}]