[{"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-907-CHLORELLA.aspx?activeIngredientId=907&activeIngredientName=CHLORELLA", "passage_text": "Chlorella is POSSIBLY SAFE when taken by mouth, short-term (up to 2 months). The most common side effects include diarrhea, nausea, gas (flatulence), green discoloration of the stools, and stomach cramping, especially in the first week of use. "}, {"url": "http://www.peak-health-now.com/chlorella-protocol.html", "passage_text": "Chlorella protocol do's and don'ts give you the greatest benefits for heavy metal detoxification and superfood nutrition. Do NOT take vitamin C with Chlorella! It tends to loosen the binding of the mercury and other heavy metals the chlorella is holding! This means that these toxins will go right back into your tissues rather than being eliminated. The toxins may go into vulnerable tissues such as liver, brain or kidneys. **Once you are taking 4 - 5 tablets of Chlorella Vulgaris before each meal, keep doing that, AND add Chlorella Pyrenoidosa using the same schedule as above-starting with 1 tablet and working up. Keep taking the Chlorella Vulgaris, too."}, {"url": "http://www.nutrition2000.com/chlorella.htm", "passage_text": "3 grams per day is a good maintenance dosage of Chlorella for a person to take. With this amount, you will not notice significant changes, however your body will get many of the nutrients it must have to function properly including amino acids (protein), vital minerals, vitamins, carbohydrates and enzymes. "}, {"url": "http://www.naturalnews.com/036086_chlorella_superfood_algae.html", "passage_text": "You can find chlorella in pill form or powder form, to add to smoothies. The herb cilantro is also known for its ability to leech mercury out of the body. It combines nicely with chlorella as a superfood and detoxifying combo (http://www.naturalnews.com/035177_chlorella_cilantro_detox.html). The cleansing of toxins from the body may give you gas, nausea, stomach cramps, diarrhea, etc. For this reason, its good to start taking chlorella on a weekend, when you can stay close to home. If the side-effects of detoxing are too much for you, ease up on your consumption, adding it in slowly. The symptoms will pass in a couple of days"}, {"url": "http://www.healingdaily.com/oral-chelation/chlorella-dosage.htm", "passage_text": "3 grams per day is a good maintenance dosage of Chlorella for a person to take. With this amount, you will not notice significant changes, however, your body will get many of the nutrients it must have to function properly such amino acids (protein), vital minerals, vitamins, carbohydrates and enzymes. A person taking 15-20 grams of chlorella per day is not at all unheard of if someone is trying to combat a disease with the amazing medicinal properties of chlorella. It is a whole food, not a concentrate or extract, therefore you can NOT take too much of it because of its detoxifying abilities."}, {"url": "http://www.drjomd.com/highways/detox/chlorella/", "passage_text": "Chlorella, algae, is a green food, full of a balance of nature made nutrients. On top of that it acts as a sponge to absorb toxins. Wow, nutrition and detox in one simple food. Chlorella comes in powder, tablet or capsule form depending on the manufacturer. Chlorella is a food so you can take more without difficulty. I’ve taken up to 30 per day of Nature’s Balance Chlorella. Initially fine tuning the number of chlorella you need to take to alleviate the symptoms may be a delicate balancing act. Here’s the potential problem at first."}, {"url": "http://vibrantbodyhealth.com/what-is-spirulina-chlorella/", "passage_text": "If you take a handful of Spirulina Chlorella with each meal (10 -14 tablets), that will be all the protein you need for that meal. If you want to eat meat, fish eggs or dairy with your meal it is strictly for the taste. Your body will not require more protein. Chlorella is a green single-celled algae cultivated in fresh water ponds. It has a grass-like smell because of the high amounts of chlorophyll in it, the highest concentration of any plant in the world."}, {"url": "http://chlorella.co.nz/detox-dosage.htm", "passage_text": "During the more active phase of the detox (every 2–4 weeks for 1 week), whenever cilantro (Chineese parsley) is given, the dose can be increased to 3 grams 3–4 times per day (1 week on, 2–4 weeks back down to the maintenance dosage). Chlorella should be taken 30 minutes before the main meals and at bedtime. Dosage: start with 1 gram (= 4 tab.) 3–4 times/day. This is the standard maintenance dosage for grown ups for the 6–24 months of active detox."}, {"url": "http://articles.mercola.com/sites/articles/archive/2012/02/01/is-this-one-of-natures-most-powerful-detoxification-tools.aspx#!", "passage_text": "You should always start any detox with chlorella gradually, taking just a small amount at first to see how your body tolerates this powerful detoxification tool. Some people also report benefits from beginning a detoxification by first eating small amounts of cilantro for a few days. Chlorella is a superfood, just like seaweeds. Start taking it TODAY !!!! Dietary Supplementation With Chlorella pyrenoidosa Produces Positive Results in Patients With Cancer or Suffering From Certain Common Chronic Illnesses, Merchant RE, Andre CA, JANA, Summer 2001;4(2):31-38."}]