[{"url": "https://www.nlm.nih.gov/medlineplus/ency/article/000821.htm", "passage_text": "Lymphocytes are a type of white blood cell. There are B and T type lymphocytes. 1  B lymphocytes become cells that produce antibodies. 2  Antibodies attach to a specific antigen and make it easier for the immune cells to destroy the antigen. 3  T lymphocytes attack antigens directly and help control the immune response."}, {"url": "http://faculty.ccbcmd.edu/courses/bio141/lecguide/unit6/cellular/cmidefense/cytokines/cytokines.html", "passage_text": "Cell-mediated immunity (CMI) is an immune response that does not involve antibodies but rather involves the activation of macrophages and NK-cells, the production of antigen-specific cytotoxic T-lymphocytes (def), and the release of various cytokines (def) in response to an antigen (def)."}, {"url": "http://www.sinobiological.com/Adaptive-Immunity-a-747.html", "passage_text": "Adaptive Immunity Definition. Adaptive immunity is an important part of the immune system. It is protection from an infectious disease agent that is mediated by B-and T-lymphocytes following exposure to specific antigen, and characterized by immunological memory."}, {"url": "http://www.sinobiological.com/Adaptive-Immunity-a-747.html", "passage_text": "A key feature of the adaptive immune system is memory, the development of immunological memory, in which each pathogen is remembered by a signature antibody. Part of activated B cells and T cells can develop to memory cells."}, {"url": "http://www.niaid.nih.gov/topics/immuneSystem/Pages/features.aspx", "passage_text": "Features of an Immune Response. An immune response is generally divided into innate and adaptive immunity. Innate immunity occurs immediately, when circulating innate cells recognize a problem. Adaptive immunity occurs later, as it relies on the coordination and expansion of specific adaptive immune cells."}, {"url": "http://www.sinobiological.com/Adaptive-Immunity-a-747.html", "passage_text": "The adaptive immune or specific immune response consists of antibody responses and cell-mediated responses, which are carried out by different lymphocyte cells, B cells and T cells, respectively."}, {"url": "http://www.virology.ws/2009/07/03/adaptive-immune-defenses/", "passage_text": "The cells of the adaptive immune system are lymphocytes – B cells and T cells. B cells, which are derived from the bone marrow, become the cells that produce antibodies. T cells, which mature in the thymus, differentiate into cells that either participate in lymphocyte maturation, or kill virus-infected cells."}, {"url": "http://www.sinobiological.com/Adaptive-Immunity-a-747.html", "passage_text": "The antibody responses are also called humoral immunity. Cell-mediated immunity does not involve antibodies but rather involves the activation of macrophages, natural killer cells (NK), antigen-specific cytotoxic T-lymphocytes, and the release of various cytokines in response to an antigen."}]