[{"url": "https://en.wikipedia.org/wiki/Transponder_(aviation)", "passage_text": "Transponder codes are four digit numbers transmitted by the transponder in an aircraft in response to a secondary surveillance radar interrogation signal to assist air traffic controllers in traffic separation. A discrete transponder code (often called a squawk code) is assigned by air traffic controllers to uniquely identify an aircraft. This allows easy identification of aircraft on radar."}, {"url": "https://en.wikipedia.org/wiki/Transponder", "passage_text": "In a communications satellite, a transponder gathers signals over a range of uplink frequencies and re-transmits them on a different set of downlink frequencies to receivers on Earth, often without changing the content of the received signal or signals. Depending on the type of interrogation, the transponder sends back a transponder code (or squawk code, Mode A) or altitude information (Mode C) to help air traffic controllers to identify the aircraft and to maintain separation between planes."}, {"url": "https://en.wikipedia.org/wiki/Transponder_(aviation)", "passage_text": "Around busy airspace there is often a regulatory requirement that all aircraft be equipped with an altitude-reporting mode C or mode S transponders. In the United States, this is known as a Mode C veil. A discrete transponder code (often called a squawk code) is assigned by air traffic controllers to uniquely identify an aircraft. This allows easy identification of aircraft on radar."}, {"url": "https://en.wikipedia.org/wiki/Transponder_(aviation)", "passage_text": "All mode A, C, and S transponders include an IDENT button, which activates a special thirteenth bit on the mode A reply known as IDENT, short for identify. When ground-based radar equipment receives the IDENT bit, it results in the aircraft's blip blossoming on the radar scope. A discrete transponder code (often called a squawk code) is assigned by air traffic controllers to uniquely identify an aircraft. This allows easy identification of aircraft on radar."}, {"url": "https://en.wikipedia.org/wiki/Transponder", "passage_text": "In telecommunication, a transponder is one of two types of devices. In air navigation or radio frequency identification, a flight transponder is a device that emits an identifying signal in response to an interrogating received signal. Depending on the type of interrogation, the transponder sends back a transponder code (or squawk code, Mode A) or altitude information (Mode C) to help air traffic controllers to identify the aircraft and to maintain separation between planes."}, {"url": "https://en.wikipedia.org/wiki/Transponder_(aviation)", "passage_text": "Air traffic control units use the term squawk when they are assigning an aircraft a transponder code, e.g. , Squawk 7421. Squawk thus can be said to mean select transponder code or squawking to mean I have selected transponder code xxxx. A discrete transponder code (often called a squawk code) is assigned by air traffic controllers to uniquely identify an aircraft. This allows easy identification of aircraft on radar."}, {"url": "http://www.avweb.com/news/avionics/183231-1.html", "passage_text": "Altitude reporting. The altitude-reporting capability of your transponder transmits your aircraft's PRESSURE ALTITUDE (rounded off to the nearest 100 feet) whenever it receives a Mode C interrogation and is switched to ALT mode. There's a new type of transponder called a Mode S transponder that is required for TCAS and may support datalink. A few years ago, the FAA tried to mandate that the fleet retire their Mode A/C transponders and upgrade to Mode S, but this move was strongly resisted by AOPA and other general aviation groups."}, {"url": "https://en.wikipedia.org/wiki/Transponder", "passage_text": "A communications satellite ’s channels are called transponders, because each is a separate transceiver or repeater. With digital video data compression and multiplexing, several video and audio channels may travel through a single transponder on a single wideband carrier. Depending on the type of interrogation, the transponder sends back a transponder code (or squawk code, Mode A) or altitude information (Mode C) to help air traffic controllers to identify the aircraft and to maintain separation between planes."}, {"url": "http://www.cnn.com/2014/03/12/world/asia/malaysia-airlines-transponder-explainer/index.html", "passage_text": "A transponder is a radio transmitter in the cockpit that works with ground radar. When the transponder receives a signal from a more sophisticated ground secondary radar, it returns a squawk code with the aircraft's position, its altitude and its call sign. It is constantly being radar pinged, helping air traffic controllers on the ground determine the airplane's speed and direction, too"}]