[{"url": "http://pmj.bmj.com/content/80/943/262.full", "passage_text": "The diagnosis of tuberculous aetiology in pericardial effusions is important since the prognosis is excellent with specific treatment. The clinical features may not be distinctive and the diagnosis could be missed particularly with tamponade. With the spread of HIV infection the incidence has increased. Tuberculous pericardial effusion (TPE) is still common in African and Asian countries, 1, 2 but with migrant populations and the spread of AIDS 3 there are now more frequent reports from other parts of the world like Europe and the Western hemisphere. 4, 5 TPE usually presents as a slowly progressive febrile illness."}, {"url": "http://www.rightdiagnosis.com/v/viral_pericarditis/contagious.htm", "passage_text": "Transmission of Viral pericarditis from Person to Person. Viral pericarditis has subtypes that are considered contagious and also has subtypes that are not contagious. Generally the disease can be transmitted by saliva, air, cough, fecal-oral route, surfaces, blood, needles, blood transfusions, sexual contact, mother to fetus, etc., but not ALL subtypes. Viral pericarditis, although infectious, is not a genetic disease. It is not caused by a defective or abnormal gene."}, {"url": "http://www.webmd.com/heart-disease/guide/pericardial-effusion", "passage_text": "Causes of Pericardial Effusion. Most pericardial effusions are caused by inflammation of the pericardium, a condition called pericarditis. As the pericardium becomes inflamed, extra fluid is produced, leading to a pericardial effusion. Viral infections are one of the main causes of pericarditis and pericardial effusions. Infections causing pericardial effusions include cytomegalovirus, coxsackieviruses, echoviruses, and HIV. In people with a pericardial effusion that's not due to pericarditis, there are often no symptoms. Large, serious pericardial effusions may cause symptoms including: 1  Shortness of breath. 2  Palpitations (sensation that the heart is pounding or beating fast). 3  Light-headedness or passing out. 4  Cool, clammy skin."}, {"url": "http://www.uptodate.com/contents/tuberculous-pericarditis", "passage_text": "INTRODUCTION. Tuberculous pericarditis is an important complication of tuberculosis (TB); the diagnosis can be difficult to establish and is often delayed or missed, resulting in late complications such as constrictive pericarditis and increased mortality [ 1 ]. Options for management of advanced disease are limited. "}, {"url": "http://www.webmd.com/heart-disease/guide/pericardial-effusion", "passage_text": "A pericardial effusion is an abnormal amount of fluid between the heart and the pericardium, which is the sac surrounding the heart. Pericardial effusions are associated with many different medical conditions. In people with a pericardial effusion that's not due to pericarditis, there are often no symptoms. Large, serious pericardial effusions may cause symptoms including: 1  Shortness of breath. 2  Palpitations (sensation that the heart is pounding or beating fast). 3  Light-headedness or passing out. 4  Cool, clammy skin."}, {"url": "http://pmj.bmj.com/content/80/943/262.full", "passage_text": "Apart from the signs of pericardial effusion, radiological evidence of pulmonary tuberculosis may be present. 1, 7 Pleural effusions are present in about 50% because of tuberculous pleuritis, 7 and a tuberculous granuloma on pleural biopsy can help in a specific diagnosis. Tuberculous pericardial effusion (TPE) is still common in African and Asian countries, 1, 2 but with migrant populations and the spread of AIDS 3 there are now more frequent reports from other parts of the world like Europe and the Western hemisphere. 4, 5 TPE usually presents as a slowly progressive febrile illness."}, {"url": "http://www.empowher.com/community/ask/viral-pericarditis-contagious", "passage_text": "February 21, 2010 - 1:15pm. Hi, Pericarditis is not contagious (it is the inflammation of the fluid-filled sac around the heart), but if your boyfriend has been diagnosed with pericarditis that is caused by a viral infection, then it is important to know what the viral infection is caused from. "}, {"url": "http://my.clevelandclinic.org/services/heart/disorders/pericarditis", "passage_text": "Rapid fluid accumulation in the pericardium can cause cardiac tamponade, a severe compression of the heart that impairs its ability to function. Cardiac tamponade resulting from a pericardial effusion can be life-threatening and is a medical emergency requiring emergent drainage of the fluid with a catheter. The pericardium is a thin, two-layered, fluid-filled sac that covers the outer surface of the heart. It shields the heart from infection or malignancy and contains the heart in the chest wall. It also prevents the heart from over-expanding when blood volume increases, which keeps the heart functioning efficiently."}]