[{"url": "http://www.dmv.org/nj-new-jersey/automotive-law/dui.php", "passage_text": "First offense DUI under 21 years old : If you are under 21 years old and you drive with a BAC of anything over 0.01% you may face all of the fines and imprisonments times above and: 1  License suspension: 30 to 90 days. 2  Community service: 15 to 30 days. 3  Mandatory Alcohol and Highway Safety Education with IDRC. If you are caught driving under the influence of intoxicants or with a blood alcohol concentration (BAC) of 0.08% or higher, you will be cited for (DUI). If you are under 21 years old the legal limit is 0.0.01%. For CDL drivers the limit is 0.04%. The laws in NJ are quite complex when dealing with a DUI or DWI charges."}, {"url": "http://dui.drivinglaws.org/mass.php", "passage_text": "For a child endangerment conviction, you will spend between 90 days and 2 1/2 years in prison and you will be fined from $1,000-$5000. You will also lose your drivers license for 1 year. For your 5th drunk driving conviction in the State of Massachusetts you will be fined between $2,000 and $50,000. For a child endangerment conviction, you will spend between 90 days and 2 1/2 years in prison and you will be fined from $1,000-$5000. You will also lose your drivers license for 1 year. For your 3rd drunk driving conviction in the State of Massachusetts you will be fined between $1,000 and $15,000. You will also spend from 150 days to 2 1/2 years in prison and have your drivers license suspended for 8 years"}, {"url": "http://www.dol.wa.gov/driverslicense/dui.html", "passage_text": "If you don’t request a hearing or the hearing examiner doesn’t decide in your favor, your license will be suspended for 90 days to 2 years, depending on prior offenses and the severity of the incident. Your suspension will begin 60 days from the date of your arrest. We may suspend your driver license for 90 days to 4 years, depending on prior offenses and the severity of the incident. The suspension will begin 45 days after we receive notice from the court showing you were convicted."}, {"url": "http://thelawdictionary.org/article/i-have-three-duis-how-long-will-i-lose-my-license-and-can-i-get-a-work-permit/", "passage_text": "In most jurisdictions, you'll be labeled a habitual offender after receiving your third DUI conviction in less than five years. You may lose your license for 10 years or more and face your state's maximum prison sentence for DUI offenses. If 10 years separate your three DUI convictions, you'll still face some serious penalties. You'll be on the hook for up to $5,000 in fines and be required to attend an intensive alcohol treatment program."}, {"url": "http://www.dol.wa.gov/driverslicense/dui.html", "passage_text": "If you’re convicted of DUI in court: We may suspend your driver license for 90 days to 4 years, depending on prior offenses and the severity of the incident. The suspension will begin 45 days after we receive notice from the court showing you were convicted."}, {"url": "http://dui.drivinglaws.org/mass.php", "passage_text": "For a child endangerment conviction, you will spend between 90 days and 2 1/2 years in prison and you will be fined from $1,000-$5000. You will also lose your drivers license for 1 year. For your 4th drunk driving conviction in the State of Massachusetts you will be fined between $1,500 and $25,000. For a child endangerment conviction, you will spend between 90 days and 2 1/2 years in prison and you will be fined from $1,000-$5000. You will also lose your drivers license for 1 year. For your 3rd drunk driving conviction in the State of Massachusetts you will be fined between $1,000 and $15,000. You will also spend from 150 days to 2 1/2 years in prison and have your drivers license suspended for 8 years"}, {"url": "https://answers.yahoo.com/question/index?qid=20100807191648AAXsWUe", "passage_text": "Best Answer: It depends on what state you live in, and even if it is your first offense, it also depends on what the offense was. There are various penalties for DUI in various states. I'm sorry to hear of your addiction, I pray that one day you will overcome your drinking problem. I live in California by the way. And if it matters I am under 21 19 years old. I would try and make excuses but I will be... show more I got a DUI last week and people are all telling me different things. Some are saying I will lose it for 5 years and others are saying only a year if its my first one."}, {"url": "http://dui.drivinglaws.org/mass.php", "passage_text": "You will also lose your drivers license for 1 year. If you are arrested a second time for drunk driving in the State of Massachusetts, you will be fined from $600-$10,000. You will also face from 30 days to 2 1/2 years in prison and have your drivers license suspended for a period of 2 years. For a child endangerment conviction, you will spend between 90 days and 2 1/2 years in prison and you will be fined from $1,000-$5000. You will also lose your drivers license for 1 year. For your 3rd drunk driving conviction in the State of Massachusetts you will be fined between $1,000 and $15,000. You will also spend from 150 days to 2 1/2 years in prison and have your drivers license suspended for 8"}, {"url": "http://www.dmv.org/ia-iowa/automotive-law/dui.php", "passage_text": "If you fail a chemical test: 1st offense: You will lose your license for 180 days. You are also subject to criminal penalties and fines if convicted of a OWI. 2nd offense: If it is your 2nd offense within 12 years, you will lose your license for 1 year. You may also face additional criminal penalties and fines if convicted. 3rd offense: A 3rd offense within a 12 years will result in revocation of your license for 6 years, in addition to criminal penalties if convicted of an OWI. If you are under 21 years old: 1st offense: You will lose your license for 60 days. 2nd and subsequent offenses: You will lose your license for 90 days. No one under 18 years old is permitted to apply for a temporary restricted license"}]