[{"url": "http://www.innerbody.com/image_card06/card13.html", "passage_text": "The trachea (or windpipe) is a wide, hollow tube that connects the larynx (or voice box) to the bronchi of the lungs. It is an integral part of the body’s airway and has the vital function of providing air flow to and from the lungs for respiration."}, {"url": "http://www.answers.com/Q/What_is_the_structure_of_the_bronchi", "passage_text": "Air travels to and from the lungs though two branches of the trachea called bronchi (one branch equals bronchus; 2 is bronchi). The bronchi subdivide within the lobes of the l … ungs into smaller and smaller air vessels called bronchioles or bronchioli (singular), that terminate in alveoli."}, {"url": "http://www.answers.com/Q/What_is_the_structure_of_the_bronchi", "passage_text": "Confidence votes 20. two like structures that lead to the lungs and branch off into the broncoe. (trachea). The two main bronchi are formed when the trachea (or windpipe) divides. The right bronchus is more vertical than the left. It is also wider and shorter."}, {"url": "http://www.rci.rutgers.edu/~reptools/1Functpage5.html", "passage_text": "Home › Function questions › Functions of the respiratory system › Passage of air into body › Structure of the trachea. Structure of the trachea The trachea is lined by cartilage and divided into two branches. These two branches are called the bronchi. The left bronchus enters the left lung and the right bronchus enters the right lung. Each bronchus is further divided into around 25 smaller branches. These smaller divisions of bronchi are known as the bronchioles."}, {"url": "http://www.webmd.com/lung/picture-of-the-trachea", "passage_text": "The trachea, commonly known as the windpipe, is a tube about 4 inches long and less than an inch in diameter in most people. The trachea begins just under the larynx (voice box) and runs down behind the breastbone (sternum). The trachea then divides into two smaller tubes called bronchi: one bronchus for each lung."}, {"url": "http://www.answers.com/Q/What_does_the_trachea_lead_to", "passage_text": "It is part of the inside of your throat. The trachea is the tube that brings air into the lungs, commonly called the windpipe. The trachea is the rubbery tube that connects … the nose and mouth to the lungs, and is an important part of the vertebrate respiratory system."}]