[{"url": "http://www.medicinenet.com/anemia/article.htm", "passage_text": "Anemia facts. 1  Anemia is a medical condition in which the red blood cell count or hemoglobin is less than normal. 2  For men, anemia is typically defined as hemoglobin level of less than 13.5 gram/100 ml and in women as hemoglobin of less than 12.0 gram/100 ml. 1 Anemia is caused by either a decrease in production of red blood cells or hemoglobin, or an increase in loss (usually due to bleeding) or destruction of red blood cells. 2  Some patients with anemia have no symptoms."}, {"url": "https://www.womenshealth.gov/publications/our-publications/fact-sheet/anemia.html", "passage_text": "Folate deficiency anemia. Folate, also called folic acid, is also needed to make red blood cells. This type of anemia can occur if you don't consume enough folate or if you have problems absorbing vitamins. It also may occur during the third trimester of pregnancy, when your body needs extra folate. "}, {"url": "http://www.medicinenet.com/anemia/article.htm", "passage_text": "1 Anemia is a medical condition in which the red blood cell count or hemoglobin is less than normal. 2  For men, anemia is typically defined as hemoglobin level of less than 13.5 gram/100 ml and in women as hemoglobin of less than 12.0 gram/100 ml. 1 Anemia is caused by either a decrease in production of red blood cells or hemoglobin, or an increase in loss (usually due to bleeding) or destruction of red blood cells. 2  Some patients with anemia have no symptoms."}, {"url": "http://www.nhlbi.nih.gov/health-topics/topics/ida", "passage_text": "Iron-deficiency anemia is a common, easily treated condition that occurs if you don't have enough iron in your body. Low iron levels usually are due to blood loss, poor diet, or an inability to absorb enough iron from food. Anemia also can occur if your red blood cells don't contain enough hemoglobin (HEE-muh-glow-bin). Hemoglobin is an iron-rich protein that carries oxygen from the lungs to the rest of the body. Iron-deficiency anemia usually develops over time if your body doesn't have enough iron to build healthy red blood cells."}, {"url": "http://www.healthline.com/symptom/anemia", "passage_text": "If anemia is severe, fainting may occur. Other symptoms include brittle nails, shortness of breath, and chest pains. Blood oxygen levels can be so low that a person with severe anemia can have a heart attack. A physical exam that your doctor does may show: 1  high or low blood pressure. 2  pale skin. 3  jaundice. "}, {"url": "http://www.nhlbi.nih.gov/health-topics/topics/ida", "passage_text": "Overview. Iron-deficiency anemia is a common type of anemia. The term anemia usually refers to a condition in which your blood has a lower than normal number of red blood cells. Red blood cells carry oxygen and remove carbon dioxide (a waste product) from your body. Anemia also can occur if your red blood cells don't contain enough hemoglobin (HEE-muh-glow-bin). Hemoglobin is an iron-rich protein that carries oxygen from the lungs to the rest of the body. Iron-deficiency anemia usually develops over time if your body doesn't have enough iron to build healthy"}, {"url": "https://www.nhlbi.nih.gov/health/health-topics/topics/anemia/", "passage_text": "Anemia (uh-NEE-me-uh) is a condition in which your blood has a lower than normal number of red blood cells. Anemia also can occur if your red blood cells don't contain enough hemoglobin (HEE-muh-glow-bin). Hemoglobin is an iron-rich protein that gives blood its red color. This protein helps red blood cells carry oxygen from the lungs to the rest of the body. If you have anemia, your body doesn't get enough oxygen-rich blood. As a result, you may feel tired or weak. You also may have other symptoms, such as shortness of breath, dizziness, or headaches. Severe or long-lasting anemia can damage your heart, brain, and other organs in your body. Very severe anemia may even cause death."}, {"url": "http://www.hematology.org/Patients/Anemia/Iron-Deficiency.aspx", "passage_text": "Iron-Deficiency Anemia. Iron is very important in maintaining many body functions, including the production of hemoglobin, the molecule in your blood that carries oxygen. Iron is also necessary to maintain healthy cells, skin, hair, and nails. "}, {"url": "http://www.webmd.com/a-to-z-guides/understanding-anemia-basics", "passage_text": "Anemia is a condition that develops when your blood lacks enough healthy red blood cells or hemoglobin. Hemoglobin is a main part of red blood cells and binds oxygen. If you have too few or abnormal red blood cells, or your hemoglobin is abnormal or low, the cells in your body will not get enough oxygen. Symptoms of anemia -- like fatigue -- occur because organs aren't getting what they need to function properly. Treatment: Procedures. If you have severe anemia, you may need a transfusion of blood that matches your type. When the body's production of red blood cells doesn't work right, anemia may be treated or cured with a transplant."}, {"url": "https://en.wikipedia.org/wiki/Anemia", "passage_text": "Anemia is the most common disorder of the blood with it affecting about a quarter of people globally. Iron-deficiency anemia affects nearly 1 billion. In 2013 anemia due to iron deficiency resulted in about 183,000 deaths – down from 213,000 deaths in 1990. When anemia comes on slowly the symptoms are often vague and may include: feeling tired, weakness, shortness of breath or a poor ability to exercise. Anemia that comes on quickly often has greater symptoms which may include: confusion, feeling like one is going to pass out, and increased thirst."}]