[{"url": "http://portal.hud.gov/hudportal/HUD?src=/program_offices/housing/sfh/insp/inspfaq", "passage_text": "How much will it cost? Costs vary dramatically, depending on the region, size and age of the house, scope of services and other factors. A typical range might be $300-$500, but consider the value of the home inspection in terms of the investment being made. Cost does not necessarily reflect quality. HUD Does not regulate home inspection fees."}, {"url": "http://personalfinance.costhelper.com/home-inspection.html", "passage_text": "1 A typical home inspection averages $260-$280 in the Midwest and Southwest and $320-$360 elsewhere nationwide. 2  The average home inspection will take 2-4 hours, but an extremely detailed evaluation can take 5-8 hours or more -- and will usually be billed at the higher end of the $200-$900 price range. 1 With the recent housing market slump, some inspectors may offer a home inspection for a flat rate of $100-$200."}, {"url": "http://www.homeadvisor.com/cost/inspectors-and-appraisers/hire-a-home-inspector/", "passage_text": "1 However it does come at a hefty cost. 2  On average, you should expect to spend $400-$800 for a 1,500 square foot house including lab fees, and then another $200-$400 for a re-inspection after the project is complete. 3  Asbestos removal can cost anywhere from $400-$30,000 depending on the amount of asbestos present. 1 This varies by inspector and how they compile reports. 2  The average rate for home inspection is around $200-$600 based on where you live. 3  Some inspectors can charge up to $800 or more. 4  As with most things, paying the lowest cost for a home inspection isn't always in your best interes"}, {"url": "http://personalfinance.costhelper.com/home-inspection.html", "passage_text": "1 Ask about: the inspector's training, experience and certification (only about 14 states require inspectors to be licensed); what will be included in the inspection; and how long it will take. 2  HUD lists 10 questions to ask a potential home inspector. 1 With the recent housing market slump, some inspectors may offer a home inspection for a flat rate of $100-$200."}, {"url": "http://www.homeadvisor.com/cost/inspectors-and-appraisers/hire-a-home-inspector/", "passage_text": "1 Having the home checked for asbestos is probably worth it in older homes with popcorn ceilings. 2  However it does come at a hefty cost. 3  On average, you should expect to spend $400-$800 for a 1,500 square foot house including lab fees, and then another $200-$400 for a re-inspection after the project is complete. 1 This varies by inspector and how they compile reports. 2  The average rate for home inspection is around $200-$600 based on where you live. 3  Some inspectors can charge up to $800 or more. 4  As with most things, paying the lowest cost for a home inspection isn't always in your best interest"}, {"url": "http://personalfinance.costhelper.com/home-inspection.html", "passage_text": "1 The average home inspection will take 2-4 hours, but an extremely detailed evaluation can take 5-8 hours or more -- and will usually be billed at the higher end of the $200-$900 price range. 1 With the recent housing market slump, some inspectors may offer a home inspection for a flat rate of $100-$200."}, {"url": "http://personalfinance.costhelper.com/home-inspection.html", "passage_text": "1 The price for a more thorough home inspection (including a typewritten report and photos) varies considerably depending on the region and the home's square footage, sales price, age and number of rooms, but ranges from $200-$900. 1 With the recent housing market slump, some inspectors may offer a home inspection for a flat rate of $100-$200."}, {"url": "http://www.zillow.com/advice-thread/Typically-How-much-do-Home-inspections-cost/427301/", "passage_text": "Let's put home inspection fees in perspective: If you're buying a $400,000 house and the inspection fee is $700, that's less than .2% of the cost of the house! Most real estate agencies charge 3% to 6% to sell a home, that would be $12,000 to $24,000 for a $400,000 house! There is no licensing in Nebraska. My charge for an inspection would be $300 - $500 for a single structure, depending on size. There is an additional charge for outbuildings and homes over 50 years old because of concerns over older electrical wiring and plumbing."}, {"url": "http://www.homeadvisor.com/cost/inspectors-and-appraisers/hire-a-home-inspector/", "passage_text": "The average national home inspection cost is $314, with most homeowners spending $266 and $369. This data is based on actual project costs as reported by HomeAdvisor members. Buying a home is exciting, but it can also be stressful and time-consuming. 1 This varies by inspector and how they compile reports. 2  The average rate for home inspection is around $200-$600 based on where you live. 3  Some inspectors can charge up to $800 or more. 4  As with most things, paying the lowest cost for a home inspection isn't always in your best interest"}]