[{"url": "http://www.names.org/n/rocco/about", "passage_text": "The name Rocco is of Italian origin, and it means Rest . It's a name commonly given to boys. Rocco Granata is an accordionist and singer-songwriter. According to the 1925 U.S. Social Security Administration data, the name Rocco ranks #92 in popularity as a baby boy's name in New Jersey. Imagine that, 50 babies in New Jersey have the same name as you in 1925. Across the entire United States a total of 317 babies also bear the same first name during the same year."}, {"url": "http://www.ourbabynamer.com/meaning-of-Rocco.html", "passage_text": "Rocco is generally used as a boy's name. It consists of 5 letters and 2 syllables and is pronounced Ro-cco. In the U.S. in 2014, it ranked 449 in baby name popularity for boys with 652 occurrences. Less than 5 girls were given the name. "}, {"url": "http://www.sheknows.com/baby-names/name/rocco", "passage_text": "Italian Meaning: The name Rocco is an Italian baby name. In Italian the meaning of the name Rocco is: Rock. American Meaning: The name Rocco is an American baby name. In American the meaning of the name Rocco is: Rock. SoulUrge Number: 3. Expression Number: 9. People with this name have a deep inner desire to create and express themselves, often in public speaking, acting, writing or singing."}, {"url": "http://www.babynamespedia.com/meaning/Rocco", "passage_text": "Rocco is used chiefly in the English and Italian languages, and it is derived from Germanic origins. The name is either derived from Roho (Germanic), a short form of the now obsolete Rochbert and ultimately of the element 'rohon' (meaning to roar, battle cry), or else it is from the Old German 'hrok' (rest, repose). Rocco is a fairly popular baby name for boys. The name's popularity has been rising since the 2000s. At the modest peak of its usage in 2009, 0.037% of baby boys were given the name Rocco."}, {"url": "http://www.thinkbabynames.com/meaning/1/Rocco", "passage_text": "Rocco /roc-co/ [2 sylls.] as a boys' name is of German and Italian origin, and the meaning of Rocco is rest. A common form of the name of a popular saint who cured plague victims. He was especially venerated in Italy. Shown below is the birth name popularity of Rocco for boys. Rocco entered the list in 1890-1899 and reached its apex position of #337 in the U.S. in the 1910s, and is at #449 currently. (Top 1000 Baby Names Statistics, 2014). Below is a graphed analysis of the usage of Rocco and associated names."}, {"url": "https://nz.answers.yahoo.com/question/index?qid=20070819220952AAxFchh", "passage_text": "Report Abuse. ROCCO Gender: Masculine Usage: Italian Italian form of a Germanic name derived from the element hrok meaning rest. This was name of a 14th-century saint who nursed victims of the plague but eventually contracted the disease himself. He is the patron saint of the sick"}, {"url": "http://www.babynology.com/meaning-rocco-m34.html", "passage_text": "More About Italian Name: Rocco. The name Rocco comes from the Italian origin, meaning is Rest. This was the name of a 14th-century saint who nursed victims of the plague but eventually contracted the disease himself. He is the patron saint of the sick. "}, {"url": "http://www.behindthename.com/name/rocco", "passage_text": "Germanic name derived from the element hrok meaning rest. This was the name of a 14th-century French saint who nursed victims of the plague but eventually contracted the disease himself. He is the patron saint of the sick. "}, {"url": "http://www.babynamespedia.com/meaning/Rocco", "passage_text": "The name Rochelle (English) is the female form of Rocco. Rocco has 19 variants that are used in English and other languages. Variants used in English include Rocca, Roche, Rocio, Rock, Rocke, Rockea, Rockee, Rockey, Rocki, Rockie, Rocko, Rokee, and Rokko. The pet form Rocky is another English variant. Rocco is a fairly popular baby name for boys. The name's popularity has been rising since the 2000s. At the modest peak of its usage in 2009, 0.037% of baby boys were given the name Rocco."}]