[{"url": "http://www.oakville.ca/museum/founders-of-oakville.html", "passage_text": "Colonel William Chisholm (1788–1842). In 1827, William Chisholm purchased 960 acres of land from the Crown at the mouth of Sixteen Mile Creek and planned out the Town of Oakville and Oakville harbour. The first brick building on site was erected c.1835, and served as a storehouse and possibly an early Custom House. Monty, his wife Margo and their four children were the sixth (and last) generation of the Chisholm family to live in Erchless. Erchless was sold in the 1960s and the Town of Oakville purchased it in 1977."}, {"url": "https://en.wikipedia.org/wiki/Oakville_AVA", "passage_text": "The Oakville AVA is an American Viticultural Area located within Napa Valley AVA and centered on the town of Oakville, California. The appellation extends over a flat expanse of well drained gravel soil between the Vaca and Mayacamas Mountains. There are over 50 wineries located within, or source their grapes from vineyards in, the Oakville AVA. Many are small, boutique wineries (like Harlan Estate, Screaming Eagle and Spoto Wines) with limited production."}, {"url": "http://www.oakvilleartsstudio.com/about-us/", "passage_text": "The Oakville Art Studio was founded in 2007 to introduce children and adults to the wonderful world of art. Ixchel’s children loved to paint with their friends while listening to music. Founder of the Textil Creativo, Textile school in 1989 in Mexico City and the Oakville Arts Studio in 2007. She has collaborated and written in specialized publications for major textile and design magazines as well as online resources and has been featured in Art related publications."}, {"url": "http://www.trioak.com/about/history/", "passage_text": "Our History. TriOak traces its roots back to 1951, when John McCulley and his wife Betty founded Oakville Feed & Produce. Over the years, the company’s focus has evolved from feed supplement and produce sales to include grain elevators, fertilizer operations and pork production. Ted and Willie Gerst, well-known and highly respected farmers in Oakville, were proud to partner with Oakville Feed & Grain, Inc."}, {"url": "http://www.oakvillegrocery.com/", "passage_text": "Since Its opening, Oakville Grocery has been a destination for locals and visitors alike. With our renovation, we have reconnected to our California roots, offering a highly curated selection of the best products from farmers, artisans and purveyors in the Napa and Sonoma Valleys. "}, {"url": "http://farniente.com/", "passage_text": "Founded in Oakville, California in 1885 and restored in 1979, Far Niente is consistently recognized as a benchmark producer of Napa Valley Chardonnay and Napa Valley Cabernet Sauvignon. "}, {"url": "https://en.wikipedia.org/wiki/Oakville_AVA", "passage_text": "In 1903, the United States Department of Agriculture established an experimental vineyard station in Oakville. Known as Oakville Station, the vineyard is operated by the University of California at Davis. Oakville AVA was officially declared a sub-appellation of Napa Valley in 1993. There are over 50 wineries located within, or source their grapes from vineyards in, the Oakville AVA. Many are small, boutique wineries (like Harlan Estate, Screaming Eagle and Spoto Wines) with limited production."}, {"url": "http://shop.oakvillegrocery.com/pages/about-us", "passage_text": "Since Its opening, Oakville Grocery has been a destination for locals and visitors alike. With our renovation, we have reconnected to our California roots, offering a highly curated selection of the best products from farmers, artisans and purveyors in the Napa and Sonoma Valleys. "}, {"url": "http://visitoakville.com/about-oakville/", "passage_text": "Oakville was founded in 1857 by Colonel William Chisholm, who purchased the land at the mouths of the 16 Mile and 12 Mile (now known as Bronte) Creeks from the Mississauga people and left development of the lands to his son, Robert Kerr Chisholm, and brother-in-law, Thomas Merrick. Distinguished Founder: Colonel William Chisholm fought in the War of 1812 and was elected to the Legislative Assembly of Upper Canada. Location, Location, Location: Conveniently located 30km from downtown Toronto, with easy highway access, Oakville strives to be the most livable city in Canada."}, {"url": "http://visitoakville.com/about-oakville/", "passage_text": "Welcome to Oakville! Nestled on the shores of Lake Ontario, Toronto to one side and Hamilton to the other, the beautiful Town of Oakville is known for its picturesque harbours, vibrant shopping districts, active arts community and some of the best dining options in the Greater Toronto Area. Distinguished Founder: Colonel William Chisholm fought in the War of 1812 and was elected to the Legislative Assembly of Upper Canada. Location, Location, Location: Conveniently located 30km from downtown Toronto, with easy highway access, Oakville strives to be the most livable city in Canada."}]