[{"url": "http://whatscookingamerica.net/Vegetables/BoilingCorn.htm", "passage_text": "Once water comes back to a boil, immediately remove the corn ears from the water. The corn is now cooked perfectly and NOT overcooked. Boiling time is a matter of taste; some people like to just boil them a minute or two to warm their corn on the cob, leaving the kernels crisp and fresh. Grandma Myers' Corn Tip-Put a pot of water on the stove. While the water comes to a boil, choose and husk your corn. Drop the corn into the boiling water. When the water comes to a boil again, remove the corn from the water. IT'S DONE! Jeffrey Coles' Corn Tip-I learned this from an Indian man in Copper Canyon, Mexico. Leave the husk on when you boil corn on the cob"}, {"url": "http://homecooking.about.com/od/vegetablerecipes/ht/cornonthecob.htm", "passage_text": "1 Add corn on the cob (husk and cornsilk removed) to the boiling water. 2  Let water return to a full boil. 3  Cover pot and immediately turn off heat. 4  Let covered pot sit undisturbed on the burner for 10 to 15 minutes. Here's How: 1  Fill a large stockpot halfway with unsalted water and bring to a rolling boil. 2  Add corn on the cob (husk and cornsilk removed) to the boiling water. 3  Let water return to a full boil. 4  Cover pot and immediately turn off heat. 5"}, {"url": "http://www.simplyrecipes.com/recipes/the_easiest_way_to_microwave_corn_on_the_cob/", "passage_text": "Method. 1 Place the corn in the microwave, do not remove the husk. Microwave the corn on the high setting for 4 minutes. 2 Use a kitchen towel or pot holder to remove corn from the microwave (it's hot!) Cut off the bottom of the corn, stem end, about one row of corn in from the stem. 3 Slip off the husk and silk. "}, {"url": "http://www.foodnetwork.com/recipes/ina-garten/sauteed-fresh-corn-recipe.html", "passage_text": "Directions. Remove the husks and the silk from the corn and cut the kernels off as close to the husk as possible without removing any of the husk. You should have about 7 cups of kernels. Melt the butter in a large, heavy saute pan. Add the corn, salt, and pepper and saute uncovered on medium-low heat for 8 to 10 minutes, stirring occasionally, until all the starchiness in the corn is gone. Taste, for salt and pepper, and serve."}, {"url": "http://homecooking.about.com/od/vegetablerecipes/ht/cornonthecob.htm", "passage_text": "Learn how to cook fresh corn on the cob so you don't end up with a gummy mess. Difficulty: Easy. Time Required: 15 minutes. Here's How: 1  Fill a large stockpot halfway with unsalted water and bring to a rolling boil. 2  Add corn on the cob (husk and cornsilk removed) to the boiling water. 3  Let water return to a full boil. 4  Cover pot and immediately turn off heat. 5  Let covered pot sit undisturbed on the burner for 10 to 15 minutes."}, {"url": "http://www.thekitchn.com/how-to-cook-corn-cooking-lessons-from-the-kitchn-177971", "passage_text": "Instructions. 1. Shuck the Husks: Shuck your corn husks into the compost, then rinse off the corn. This method can easily cook more than 4 ears of corn, just make sure you have a very large pot for cooking adequately. 2. Boil the Water: Heat a large pasta pot full of water to boil. "}, {"url": "http://whatscookingamerica.net/Vegetables/BoilingCorn.htm", "passage_text": "Husking the corn: For maximum freshness, husk the corn just before cooking. When ready to cook your corn on the cob, pull all the husks off of the corn and discard. Remove silk (the white hairy threads just under the husk) from the corn and discard. TIP: To help remove the silk, wet a paper towel and wipe down the corn. Grandma Myers' Corn Tip-Put a pot of water on the stove. While the water comes to a boil, choose and husk your corn. Drop the corn into the boiling water. When the water comes to a boil again, remove the corn from the water. IT'S DONE! Jeffrey Coles' Corn Tip-I learned this from an Indian man in Copper Canyon, Mexico. Leave the husk on when you boil corn on the cob"}, {"url": "http://www.tasteofhome.com/recipes/how-to-cook/how-to-boil-corn", "passage_text": "Boiling Corn on the Cob. To boil fresh corn on the cob, first remove the husks and silk. Then place the cobs in a kettle of unsalted boiling water. Cover the pan and return it to a boil. Cook the corn for 3-5 minutes or until tender. The exact cooking time will depend on the type of corn you buy and its maturity. "}, {"url": "http://www.thekitchn.com/3-easy-ways-to-cook-sweet-corn-on-the-cob-121823", "passage_text": "1. Boil It Up. Boiling is the classic way to prepare sweet corn. You can either use a wide, flat pan and lay the corn on its side, or use a taller stockpot to boil a big batch at once. Either way, fill the pan with enough water to cover the corn and bring it to a boil. Shuck off the outer husk and silk from the corn. Dissolve a tablespoon of salt in the water and add the corn. If your corn is very fresh, cook it for three to five minutes. For corn that’s a few days old, go for six to eight minutes."}]