[{"url": "http://www.aacn.org/WD/Certifications/Content/consumer-whatiscert.pcms?menu=Certification", "passage_text": "CCRN-K TM certification is for the nursing professional who in their practice applies knowledge in a way that influences patients, nurses and/or organizations to have a positive impact on acutely and/or critically ill patients but does not work at the bedside. There is an exception in the case of advanced practice licensure (for nurse practitioner, clinical nurse specialist, midwife, etc.) — a certification exam may be used as a proxy measure for APRN licensure or designation and therefore would not be voluntary, but a requirement for licensure."}, {"url": "http://www.bcencertifications.org/Get-Certified/CEN.aspx", "passage_text": "Enhance Your Career. The Certified Emergency Nurse (CEN) certification is specific to emergency nursing and measures the attainment of a defined body of nursing knowledge pertinent to that specialty. Currently, more than 30,000 nurses hold the CEN certification. Get Certified Today!"}, {"url": "http://nbcsn.org/", "passage_text": "The National Board for Certification of School Nurses (NBCSN) endorses the concept of voluntary certification by examination for all school nurses. Professional certification in school nursing provides an ongoing, quality credentialing process for eligible school nurses. Mission. The Mission of the National Board for Certification of School Nurses, Inc. (NBCSN) is to advance the health and learning of students, and wellness of the school community, through a rigorous national certification process for school nurses."}, {"url": "http://www.bcencertifications.org/Get-Certified/CEN.aspx", "passage_text": "Enrich Your Future. The Certified Emergency Nurse (CEN) certification is specific to emergency nursing and measures the attainment of a defined body of nursing knowledge pertinent to that specialty. Currently, more than 30,000 nurses hold the CEN certification. Get Certified Today!"}, {"url": "http://www.aacn.org/WD/Certifications/Content/consumer-whatiscert.pcms?menu=Certification", "passage_text": "Certification is a process by which a nongovernmental agency validates, based upon predetermined standards, an individual nurse’s qualifications for practice in a defined functional or clinical area of nursing. There is an exception in the case of advanced practice licensure (for nurse practitioner, clinical nurse specialist, midwife, etc.) — a certification exam may be used as a proxy measure for APRN licensure or designation and therefore would not be voluntary, but a requirement for licensure."}, {"url": "http://www.abms.org/board-certification/", "passage_text": "ABMS Board Certification and the ABMS Program for Maintenance of Certification (ABMS MOC®) are instrumental to the integrity of medical specialty care. They provide a trusted credential that is important to patients and relevant to physician practice. "}, {"url": "https://en.wikipedia.org/wiki/Nursing_board_certification", "passage_text": "Some hospitals and other health care facilities are willing to pay a certified nurse extra when he or she works within their specialty. Also, some hospitals may require certain nurses, such as nursing supervisors or lead nurses, be certified. Certification instills confidence in the nurses. In this role, the nurse becomes something similar to an auditor and a teacher of patient care quality and risk for the entire hospital staff. This nurse likely will also get the certification listed below: CPHQ: Certified Professional in Healthcare Quality."}, {"url": "http://www.aacn.nche.edu/cnl/cnc", "passage_text": "The Clinical Nurse Leader (CNL) Certification Program is managed by the Commission on Nurse Certification (CNC), an autonomous arm of AACN, and governed by the CNC Board of Commissioners. CNC recognizes individuals who have demonstrated professional standards and knowledge through CNL certification. "}, {"url": "http://www.nursecredentialing.org/certification.aspx", "passage_text": "ANCC Certification Center. Trusted for its commitment to quality, the ANCC Certification Program is nationally renowned as a true gauge of a nurse's ability to provide excellent care. Colleagues and employers respect ANCC-certified nurses as experts in their specialties. Advance your career by earning certification through ANCC. 1 The U.S. Patent and Trademark Office issued a patent for the ANCC Certification through Portfolio credentialing process. 2  Celebrate Certified Nurses Day March 19 with Free Promotional Tools! 3  Say “thank you” to the certified nurses on your team while allowing them to show pride in their hard work."}]