[{"url": "http://www.answers.com/Q/What_is_Armenia", "passage_text": "Armenia is a country in Eastern Europe in the Southern Caucasus. Countries that border Armenia are Georgia, The Nagorno-Karabakh Republic, Naxicevan, Turkey, Azerbaijan and Ir … an at the South. Armenia is a very Ancient Cultural and Historical Country that has a history of nearly 6000 years (until 4000BC) stretching through the Armenian Highlands. Visit Armenia and it's wonders! The capital city of Armenia is Yerevan, which is situated on the Hrazdan river and on the Araratian plain. Yerevan is the capital city of Armenia and it is one of the oldest … continuously inhabited cities in the world. + 7 others found this useful."}, {"url": "https://en.wikipedia.org/wiki/Armenians", "passage_text": "Armenians (Armenian: հայեր, hayer [hɑˈjɛɾ]) are an ethnic group native to the Armenian Highlands. Armenians constitute the main population of Armenia and the de facto independent Nagorno-Karabakh Republic. There is a wide-ranging diaspora of around 5 million people of full or partial Armenian ancestry living outside of modern Armenia. The ethnic cleansing of Armenians during the final years of the Ottoman Empire is widely considered a genocide, an estimated 1.5 million victims, with one wave of persecution in the years 1894 to 1896 culminating in the events of the Armenian Genocide in 1915 and 1916."}, {"url": "https://en.wikipedia.org/wiki/Armenia", "passage_text": "Armenia is a member of the Eurasian Economic Union, the Council of Europe and the Collective Security Treaty Organization. Armenia supports the de facto independent Nagorno-Karabakh Republic, which was proclaimed in 1991. Mount Ararat, which was historically part of Armenia, is the highest mountain in the region. Now located in Turkey, but clearly visible in Armenia, it is regarded by the Armenians as a symbol of their land. Because of this, the mountain is present on the Armenian national emblem today."}, {"url": "https://en.wikipedia.org/wiki/Armenians", "passage_text": "With the exceptions of Iran and the former Soviet states, the present-day Armenian diaspora was formed mainly as a result of the Armenian Genocide. Most Armenians adhere to the Armenian Apostolic Church, a non-Chalcedonian church, which is also the world's oldest national church. The ethnic cleansing of Armenians during the final years of the Ottoman Empire is widely considered a genocide, an estimated 1.5 million victims, with one wave of persecution in the years 1894 to 1896 culminating in the events of the Armenian Genocide in 1915 and 1916."}, {"url": "https://en.wikipedia.org/wiki/Armenia", "passage_text": "Armenia was the first nation to adopt Christianity as a state religion, an event traditionally dated to AD 301. The predominant religion in Armenia is Christianity. The roots of the Armenian Church go back to the 1st century. Mount Ararat, which was historically part of Armenia, is the highest mountain in the region. Now located in Turkey, but clearly visible in Armenia, it is regarded by the Armenians as a symbol of their land. Because of this, the mountain is present on the Armenian national emblem today."}, {"url": "http://www.worldatlas.com/webimage/countrys/europe/am.htm", "passage_text": "Historically Armenia and Azerbaijan have been long associated with Asia and the Middle East. In recent years some sources now consider them to be more closely aligned with Europe based on their modern economic and political trends. I.E. Armenia Description. Armenia is a mountainous, landlocked country, on the southeastern edge of Europe, and at the gateway to the Middle East and Asia. This valuable geographical position for potential trade between continents became a curse of sorts."}, {"url": "http://www.infoplease.com/country/armenia.html", "passage_text": "Geography. Armenia is located in the southern Caucasus and is the smallest of the former Soviet republics. It is bounded by Georgia on the north, Azerbaijan on the east, Iran on the south, and Turkey on the west. Contemporary Armenia is a fraction of the size of ancient Armenia. A land of rugged mountains and extinct volcanoes, its highest point is Mount Aragats, 13,435 ft (4,095 m)."}, {"url": "http://www.everyculture.com/A-Bo/Armenia.html", "passage_text": "Identification. The designation Armenia applies to different entities: a historical Armenia, the Armenian plateau, the 1918–1920 U.S. State Department map of an Armenia, and the current republic of Armenia. "}]