[{"url": "http://www.tdi.texas.gov/pubs/consumer/cb025.html", "passage_text": "Homeowners insurance pays to repair or replace your house and personal property if they're damaged or destroyed by an event or occurrence covered by your policy. (En Espanol). Español homeowners insurance pays to repair or replace your house and personal property if'they re damaged or destroyed by an event or occurrence covered by your. Policy these events or occurrences are called covered.. Losses: Note an insurance policy is a contract between you and your insurance. company"}, {"url": "https://www.travelers.com/personal-insurance/home-insurance/types-of-coverage/index.aspx", "passage_text": "1 Personal property coverage. 2  Reimburses you for the personal items in your home that may be damaged or destroyed by a covered cause of loss, which could include your furniture, clothes, sporting goods and electronics. 3  Learn more about Travelers Personal Property insurance. What most standard homeowners policies provide. 1  Dwelling coverage. 2  Pays to repair or rebuild your home-including electrical wiring, plumbing, and heating and air conditioning-if damaged by a covered cause of loss. 3  It's important to buy enough dwelling coverage to cover the cost to rebuild."}, {"url": "http://www.homewarrantyreviews.com/homeowners-warranty/difference-between-home-warranty-and-homeowners-insurance", "passage_text": "It also covers your personal items and gives you liability protection. Liability insurance will protect you from lawsuits in the event that someone is injured on your property. Home insurance will only insure your personal items in case they are stolen or ruined in a disaster. Let’s find answers for these questions. While home warranty and home insurance products may come across as same, they are totally different. The coverage, cost, terms and conditions vary greatly. Home insurance is compulsory in some cases whereas home warranty is a recommended choice."}, {"url": "http://homeguides.sfgate.com/covered-under-homeowners-insurance-1652.html", "passage_text": "Items stolen from your car may be covered under a standard homeowners insurance policy. Protecting your home with homeowners insurance is not only required to acquire a mortgage, it makes sound financial sense to cover your most valuable asset. Identification. Standard homeowners insurance, known as HO-3, protects your property against damages and provides personal liability coverage. Certain natural disasters are not covered under a standard HO-3 policy. Less expensive homeowner policies include HO-2 and HO-1, which cover fewer risks."}, {"url": "http://homeguides.sfgate.com/covered-under-homeowners-insurance-1652.html", "passage_text": "What Is Covered. A typical homeowners insurance policy covers your home and personal property against damage from fire, lightning, tornadoes and hurricanes. HO-3 insurance covers losses due to theft, riot and vandalism, as well as damage due to frozen plumbing, heating and air conditioning systems. Identification. Standard homeowners insurance, known as HO-3, protects your property against damages and provides personal liability coverage. Certain natural disasters are not covered under a standard HO-3 policy. Less expensive homeowner policies include HO-2 and HO-1, which cover fewer risks."}, {"url": "http://www.iii.org/article/what-covered-standard-homeowners-policy", "passage_text": "Your personal belongings. Your furniture, clothes, sports equipment and other personal items are covered if they are stolen or destroyed by fire, hurricane or other insured disaster. Most companies provide coverage for 50% to 70% of the amount of insurance you have on the structure of your home. "}, {"url": "http://www.safeco.com/blog-detail/understanding-homeowners-insurance/1240026005344", "passage_text": "What Home Insurance Covers. The typical homeowners insurance policy has six type of coverages. They are commonly known as: 1  Coverage A: Dwelling, for damage to your house that occurs due to covered losses, such as a fire. 1 Coverage A: Dwelling, for damage to your house that occurs due to covered losses, such as a fire. 2  Following a covered loss, dwelling coverage helps you repair or rebuild your home, including the structures, such as a garage or a deck, attached to it."}, {"url": "https://www.insurancehotline.com/home-insurance-and-your-home-warranty/", "passage_text": "Home insurance differs from your home warranty in that it covers the cost of damage to your home and your possessions from things such as fire, loss or theft. Home insurance can also cover you from personal liability issues, for example if someone else’s property is damaged in your home. New home warranties don’t cover theft or fire damage to your home and they also don’t offer personal liability insurance. Home insurance doesn’t cover issues of the builder’s mistakes or problems with such things as plumbing, heating and electrical issues."}, {"url": "https://www.travelers.com/personal-insurance/home-insurance/types-of-coverage/index.aspx", "passage_text": "Homeowners insurance provides financial protection in the event that your home or its contents are damaged. It also provides protection if you or a family member are held legally responsible (liable) for the injuries to others or damage to their property. What most standard homeowners policies provide. 1  Dwelling coverage. 2  Pays to repair or rebuild your home-including electrical wiring, plumbing, and heating and air conditioning-if damaged by a covered cause of loss. 3  It's important to buy enough dwelling coverage to cover the cost to rebuild."}, {"url": "http://www.hwahomewarranty.com/What-is-a-Home-Warranty", "passage_text": "A home warranty, on the other hand, offers repairs and replacements for your covered home appliances and systems only that fail due to normal wear and tear-which a homeowner's insurance policy does not. A home warranty is a contract, not a policy. It's not your homeowner's insurance policy; a home warranty is a separate contract covering repairs and replacements on systems in your home, usually for a period of one year. Home warranties cover many, but not all, of your home's appliances and systems."}]