[{"url": "http://www.yourdictionary.com/conduction", "passage_text": "Heat conduction helps to cook this meat. The definition of conduction is the movement of something such as heat or electricity through a medium or passage. An example of conduction is using a metal rod to roast marshmallows on an open fire and feeling the heat rise through the rod from the fire to your hand."}, {"url": "http://www.merriam-webster.com/dictionary/thermal%20conduction", "passage_text": "Definition of THERMAL CONDUCTION. : the transmission of heat energy by conduction (as through the bottom of a kettle). ADVERTISEMENT. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis."}, {"url": "http://www.yourdictionary.com/conductivity", "passage_text": "The definition of conductivity is the ability to transmit heat, sound or electricity. An example of conductivity is heat transferring from hot pot of soup to a metal ladle sitting in the pot."}, {"url": "http://www.yourdictionary.com/conduction", "passage_text": "The definition of conduction is the movement of something such as heat or electricity through a medium or passage. An example of conduction is using a metal rod to roast marshmallows on an open fire and feeling the heat rise through the rod from the fire to your hand."}, {"url": "http://study.com/academy/lesson/what-is-thermal-energy-definition-examples.html", "passage_text": "Because thermal energy is due to the movement of particles, it is a type of kinetic energy, which is the energy due to motion. Thermal energy results in something having an internal temperature, and that temperature can be measured-for example, in degrees Celsius or Fahrenheit on a thermometer."}, {"url": "http://study.com/academy/lesson/what-is-conduction-in-science-definition-examples.html", "passage_text": "Conduction is the transfer of energy in the form of heat or electricity from one atom to another within an object by direct contact. Conduction occurs in solids, liquids, and gases."}, {"url": "http://study.com/academy/lesson/what-is-conduction-in-science-definition-examples.html", "passage_text": "Conduction occurs when energy is transferred through an object due to the movement of particle due to contact. The energy that is transferred is in the form of heat or electricity, so the two types of conduction that we discussed are conduction of heat and conduction of electricity."}, {"url": "http://whatis.techtarget.com/definition/heat", "passage_text": "Part of the IT standards and organizations glossary: Heat is the transfer of kinetic energy from one medium or object to another, or from an energy source to a medium or object. Such energy transfer can occur in three ways: radiation, conduction, and convection."}]