[{"url": "http://pharmacistben.com/youngevity/youngevitys-beyond-tangy-tangerine/", "passage_text": "Youngevity’s Beyond Tangy Tangerine. I've been designing consumer chemistry products for over a long time. I've developed oven cleaners, paint, paint removers, toothpaste, shampoos, skincare products and a whole bunch of nutritional products; hundreds of different products in all. This kind of flexible dosing once again gives the Beyond Tangy Tangerine an ease and convenience that is impossible to achieve with tablets and capsules. The liquid format of the BTT also allows for what is in essence a sustained release of nutrients. In other words, you can sip on the stuff."}, {"url": "http://www.healthfoodemporium.com/youngevity/tangy-tangerine.php", "passage_text": "With over 8000 ORAC, certified organic ingredients, and synergizing cofactors to maximize vitamin and mineral uptake, Beyond Tangy Tangerine 2.0 is the most advanced multi-vitamin mineral complex on the market. Beyond Tangy Tangerine 2.0 provides you with: energy boosting nutrients, PuriGenic antioxidant support, PrePro prebiotic and probiotic blend, over 500 mg of natural amino acids, and increased potencies of most vitamins and minerals for optimal wellness."}, {"url": "http://forum.prisonplanet.com/index.php?topic=227939.0", "passage_text": "Besides Tangy Tangerine having a lot of synthetic vitamins in it, this is what I found most disturbing... Analysis Report of Majestic Earth Minerals: .pdf]http://www.youngevity.net/images/pdf/analysis[1].pdf. The aluminum-mg/L 1490. I used tangy tangerine and I didn't care for the iron taste. So, I have been doing the Pollen Burst for a month and noticed a significance in my cravings for different things decreased and I have increased energy levels."}, {"url": "http://forum.prisonplanet.com/index.php?topic=227939.0", "passage_text": "I know recently Alex has been promoting youngevity products particularity Tangy Tangerine. Two concerns of mine have come up after reading the ingredients label that was posted on the Youngevity Website.1. I used tangy tangerine and I didn't care for the iron taste. So, I have been doing the Pollen Burst for a month and noticed a significance in my cravings for different things decreased and I have increased energy levels."}, {"url": "http://www.mighty-90.com/beyond-tangy-tangerine-2-0/", "passage_text": "Beyond Tangy Tangerine 2.0 is the most advanced multi-vitamin mineral complex to date that provides you the highest quality essential nutrients that your body needs for optimal health. Synergizing cofactors ensure maximum nutrient absorption and benefits. All so available as…. Beyond Tangy Tangerine® (BTT) contains a base of Majestic Earth® Plant Derived Minerals® blended with vitamins, amino acids, and other beneficial nutrients to make a balanced and complete daily supplement. Click on the image for more information and quantity pricing."}, {"url": "http://forum.prisonplanet.com/index.php?topic=227939.0", "passage_text": "And the Tangy Tangerine product is amusing in that you are expected to take two scoops per hundred pounds of body weight, 1 to 2 times daily which means you will be draining that $50 container of powder in about a week. I used tangy tangerine and I didn't care for the iron taste. So, I have been doing the Pollen Burst for a month and noticed a significance in my cravings for different things decreased and I have increased energy levels."}, {"url": "http://www.youngevity.net/product/13221.html", "passage_text": "Save Money / Case Pricing Item #: 13221 MAJESTIC EARTH ULTIMATE TANGY TANGERINE - 32 FL OZ Dr. Wallach's Majestic Earth Ultimate Tangy Tangerine 32 OZ The most advanced liquid vitamin, mineral and amino acid supplement on the market. The unique properties make it the ultimate in absorption and completeness. It has a wonderful tangy, tart, tangerine taste that will tickle and delight your taste buds. Also, it is much less thick and therefore easier to use and to pour than is our original Dr. Wallach's Ultimate Classic."}, {"url": "http://www.youngevity.net/product/13221.html", "passage_text": "Dr. Wallach's Majestic Earth Ultimate Tangy Tangerine 32 OZ. The most advanced liquid vitamin, mineral and amino acid supplement on the market. The unique properties make it the ultimate in absorption and completeness. It has a wonderful tangy, tart, tangerine taste that will tickle and delight your taste buds. Also, it is much less thick and therefore easier to use and to pour than is our original Dr. Wallach's Ultimate Classic."}, {"url": "http://www.youngevity.net/category/Beyond_Tangy.html", "passage_text": "Beyond Tangy Tangerine contains a base of Majestic Earth Plant Derived Minerals blended with vitamins, amino acids, and other beneficial nutrients. Building on a foundation of our famous Beyond Juice Fruit and Veggie formulas, we've added even more nutrients to make this a balanced and complete daily supplement. Beyond Tangy Tangerine is an easily dissolving powder perfect for travel that contains Majestic Earth Plant Derived Minerals, vitamins, amino acids and 115 fruits and vegetables."}]