[{"url": "http://www.rodbikes.com/articles/material-world.html", "passage_text": "While it's true that a steel bike can be very heavy, I've also shown that an aluminum bicycle can be very heavy as well. What it boils down to is cost. A cheap bike is heavy no matter what it's made of. Steel bicycle frames can be as light as a $4,000 carbon fiber frame, and lighter than a $4,000 ti frame. Steel technology has evolved just like carbon, aluminum and ti has."}, {"url": "http://www.bikeframerepair.com/", "passage_text": "Eagle One LLC is a bicycle frame repair shop located in Warrenton, Virginia, USA. We are a bike frame repair and paint shop. Providing quality repairs to aluminum, steel, and titanium bike frames. With close to thirty years of experience your assured quality workmanship."}, {"url": "http://livehealthy.chron.com/steel-vs-titanium-bike-frames-4083.html", "passage_text": "Steel. Steel for bike frames is primarily produced in two levels of quality. Lower-cost bikes are commonly made from 1020 carbon steel, since it's inexpensive to produce. It's not as strong as other types of steel, so the tubing in the frame needs to be thicker and much heavier."}, {"url": "http://www.livestrong.com/article/231118-the-best-steel-bikes/", "passage_text": "Cost. Plan on spending anywhere in the price range of $2,000 to $5,000 just for a steel frame set. The cost of the entire bike normally depends on the options you choose such as graphics and color, components, and frame geometry."}, {"url": "http://livehealthy.chron.com/steel-vs-titanium-bike-frames-4083.html", "passage_text": "Cost of Titanium. Since titanium is less widely available than steel, it is significantly more expensive. The cost of a good titanium bike frame typically ranges from $2,000 to $4,000 as of 2013, compared with the $300 to $500 range for high-quality chrome-moly steel. However, many riders believe titanium is worth the premium price because of its corrosion resistance and exceptional strength."}, {"url": "http://livehealthy.chron.com/steel-vs-titanium-bike-frames-4083.html", "passage_text": "Related Reading: Bike Frame Size Calculation. Since titanium is less widely available than steel, it is significantly more expensive. The cost of a good titanium bike frame typically ranges from $2,000 to $4,000 as of 2013, compared with the $300 to $500 range for high-quality chrome-moly steel. However, many riders believe titanium is worth the premium price because of its corrosion resistance and exceptional strength."}]