[{"url": "http://www.eharmony.com/dating-advice/about-you/ten-things-to-never-post-on-facebook-if-you-are-single/", "passage_text": "If you’re single and not completely loving that fact, there are a few Facebook guidelines to follow to if you want to remain dateable in the eyes of other singles in your social network. Ten things to never post on Facebook if you are single: 1. What you’re looking for in a date. eHarmony should host your dating profile, not your Facebook page. 2. A play-by-play of the dates you do go on. If you chronicle the details of your personal life, no one will want to become part of it. "}, {"url": "http://www.youtube.com/watch?v=zA6IjTR10Jc", "passage_text": "This feature is not available right now. Please try again later. To upload multiple photos to a post on your Facebook page, use the photos option under your cover photo vs the photos option in your status update. 1  Film & Animation. 2  Standard YouTube License."}, {"url": "http://www.ehow.com/how_8550364_put-still-single-facebook.html", "passage_text": "Via Profile. Click the Profile button to view your Facebook profile. Click the Edit Profile button. Click the Featured People option in the left column to view your current relationships. Select Single from the drop-down menu that appears next to Relationship Status.. Click the Save Changes button to post your single status to your profile pag"}, {"url": "http://smallbusiness.chron.com/write-private-post-facebook-42430.html", "passage_text": "1 You cannot choose the audience for something you post on someone else's wall, only your own. 2  You can also send a message by going to your friend's wall and clicking the Message button along the Timeline. Step 3. Click on the small arrow next to the Post button to open the drop-down menu, the audience selector. Step 4. Slide down to the most appropriate option and click to change the privacy setting for that message. If you choose Friends, anyone on your friends list can read the post, but the general public will not see it"}, {"url": "http://en-gb.facebook.com/help/community/question/?id=689425964703", "passage_text": "how come my single status doesn't come up in news feed. News Feed. recently single after 4.5 years, i want my single friends to know. but facebook doesn't broadcast it in news feed. Why? "}, {"url": "http://smallbusiness.chron.com/write-private-post-facebook-42430.html", "passage_text": "Tips. 1  You cannot choose the audience for something you post on someone else's wall, only your own. 2  You can also send a message by going to your friend's wall and clicking the Message button along the Timeline. 3  Following this process puts that friend's name automatically in the recipients field. Step 3. Click on the small arrow next to the Post button to open the drop-down menu, the audience selector. Step 4. Slide down to the most appropriate option and click to change the privacy setting for that message. If you choose Friends, anyone on your friends list can read the post, but the general public will not see it"}, {"url": "http://www.wikihow.com/Upload-Pictures-to-Facebook", "passage_text": "5. Edit your post. You can add a caption, tag any other people with you, and adjust the privacy settings. 1  If you choose to, you may add tags to your pictures. 2  Just go to the photo, and select Tag This Photo right below your picture. 3  Click somewhere on your picture, choose a person, then click Tag.. 1 If you choose to, you may add tags to your pictures. 2  Just go to the photo, and select Tag This Photo right below your picture. 3  Click somewhere on your picture, choose a person, then click Tag.. 4  Select Done Tagging when you are finished. 5  To add a caption, click the pencil below your photo."}, {"url": "http://smallbusiness.chron.com/write-private-post-facebook-42430.html", "passage_text": "Log into your Facebook account. Step 2. Type the comment you want to make in the Update Status box at the top of your homepage or the Status box just below the cover photo on your timeline, but do not click the Post button. Step 3. Click on the small arrow next to the Post button to open the drop-down menu, the audience selector. Step 4. Slide down to the most appropriate option and click to change the privacy setting for that message. If you choose Friends, anyone on your friends list can read the post, but the general public will not see it"}, {"url": "http://www.ehow.com/how_8550364_put-still-single-facebook.html", "passage_text": "Via Facebook Note. Click the Notes option that appears in the left column of your Facebook Home page. If it is not listed, click the More link that appears below the Photos option. Click the Write a Note button that appears on the resulting page to create a new note. Click the Profile button to view your Facebook profile. Click the Edit Profile button. Click the Featured People option in the left column to view your current relationships."}]