[{"url": "http://www.s-cool.co.uk/gcse/chemistry/electrolysis/revise-it/electrolysis", "passage_text": "Submitted by Anonymous on. Electrolysis is the decomposition of a compound using electricity: The decomposition of molten lead bromide occurs using the apparatus above. A current is passed through graphite rods called electrodes. The negative terminal is attached to one rod, which becomes the negative electrode, the cathode. The positive terminal is attached to the other rod. This becomes a positive electrode, the anode. Summary of electrolysis: 1  All ionic compounds when molten can be decomposed when electricity is passed through using electrolysis. 2  The metal and hydrogen always forms at the cathode. 3  Non-metal always forms at the anode. 4  Cations travel to"}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa/electrolysis/electrolysisrev1.shtml", "passage_text": "Electrolysis. Here is what happens during electrolysis: 1  Positively charged ions move to the negative electrode electrode: Electrodes are conductors used to establish electrical contact with a circuit. 2  The electrode attached to the negative terminal of a battery is called a negative electrode, or cathode. 1 The electrode attached to the negative terminal of a battery is called a negative electrode, or cathode. 2  The electrode attached to the positive terminal of a battery is the positive electrode, or anode. 3  during electrolysis."}, {"url": "http://www.gcsescience.com/ex3.htm", "passage_text": "Electrolysis is the process where an electric current is passed through a liquid that conducts electricity. A liquid will only conduct electricity if it contains ions. The electrodes are often made from graphite. The liquid that conducts electricity is called the electrolyte. The amount of electricity needed to produce a particular mass of metal (or non-metal) can be calculated. The negative electrode, called the cathode, will attract positively charged metal ions. The metal ions collect electrons from the cathode (this is called reduction) and are discharged as metal atoms. The positive electrode, called the anode, will attract negatively charged non-metal ions"}, {"url": "https://en.wikibooks.org/wiki/GCSE_Science/Electrolysis", "passage_text": "[[ GCSE Science/Electricity ]]. Electrolysis is the decomposition of certain types of substance using electricity. The types of substance that can be split are ionic substances. This just means that they are made of charged ions rather than neutral atoms. {Remember that an ion is just an atom that has either a positive or negative charge}. An example of an ionic substance is common table salt sodium chloride."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa/electrolysis/electrolysisrev1.shtml", "passage_text": "1 ] and are reduced reduction: Reduction is a reaction in which oxygen is removed from a substance. 2  Reduction also means a gain in electrons. . 3  Negatively charged ions move to the positive electrode during electrolysis. 1 The electrode attached to the negative terminal of a battery is called a negative electrode, or cathode. 2  The electrode attached to the positive terminal of a battery is the positive electrode, or anode. 3  during electrolysis."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa/electrolysis/electrolysisrev1.shtml", "passage_text": "1 The electrode attached to the positive terminal of a battery is the positive electrode, or anode. 2  during electrolysis. 3  They receive electrons [electron: An electron is a very small negatively-charged particle found in an atom in the space surrounding the nucleus. 1 The electrode attached to the negative terminal of a battery is called a negative electrode, or cathode. 2  The electrode attached to the positive terminal of a battery is the positive electrode, or anode. 3  during electrolysis."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa_pre_2011/ions/electrolysisrev1.shtml", "passage_text": "Electrolysis. To understand electrolysis, you need to know what an ionic substance is. Ionic substances form when a metal reacts with a non-metal. They contain charged particles called ions [ions: Electrically charged particles, formed when an atom or molecule gains or loses electrons. (melted). For example, if electricity is passed through copper chloride solution, the copper chloride is broken down to form copper metal and chlorine gas. Electrolysis. Here is what happens during electrolysis: 1  Positively charged ions move to the negative electrode during electrolysis. 2  They receive electrons and are reduced reduction: Reduction is a reaction in which oxygen is removed from a substance. 3  Reduction also means a gain in"}, {"url": "http://www.educationquizzes.com/gcse/chemistry/electrolysis-1/", "passage_text": "Electrolysis 1. Electrolysis is a chemical decomposition. Electrolysis is an extremely important industrial process. It was first explained by Michael Faraday, one of the most influential scientists in history. He was probably the first scientist to conduct experiments"}]