[{"url": "https://en.wikipedia.org/wiki/Hectare", "passage_text": "The hectare (/ˈhɛktɛər/ or /ˈhɛktɑr/ ; symbol ha) is an SI accepted metric system unit of area equal to 100 ares (10,000 m 2) and primarily used in the measurement of land. An acre is about 0.4047 hectare and one hectare contains about 2.47 acres."}, {"url": "http://www.kelownanow.com/galavanting/news/Tourist_Information/14/07/17/How_Big_Is_A_Hectare_A_Better_Way_to_Visualize_The_Size", "passage_text": "Most sports fields are one hectare in size. The Apple Bowl in Kelowna for instance is a 400 m running track and the grassy area inside is 1.12 hectares. The international rugby field pictured above is very close to one hectare in size, it is actually 1.0008 hectares. A perfect square is 100 meters by 100 meters is a hectare. Source-metric views. source-Wikipedia. An acre is about 0.4047 hectare and one hectare contains about 2.47 acres."}, {"url": "http://www.asknumbers.com/HectaresToAcresConversion.aspx", "passage_text": "To find out how many acres in hectares, multiply by the conversion factor or simply use the converter below. 1 Hectare = 2.47105381 Acres. Hectare is a metric system area unit and widely used globally for land measurement, agriculture and forestry. It equals to 10,000 square meters. The abbreviation is ha."}, {"url": "http://www.conversion-metric.org/area/acre-to-hectare", "passage_text": "Used widely in the US customary system and the Imperial system, an acre is a unit of area equal to 1/640 of a square mile, or 0.4047 of a hectare, or 43,560 square feet. To imagine what an acre is, one can imagine the area which is equal to approximately 3/4 of the common football field."}, {"url": "http://www.convertunits.com/from/hectare/to/acre", "passage_text": "Its use is widespread in agriculture where it is more practical than either square metres or square kilometres, typical fields being a few hectares in size. An acre is a measure of land area in Imperial units or U.S. customary units. It is equal to 43 560 square feet, 4840 square yards, or 160 square rods."}]