[{"url": "https://www.uscarhire.com/faq-restrictions.aspx", "passage_text": "The minimum age is 21 although under age 25 drivers will be subject to a surcharge payable on collection (see below). If you choose our Young Driver's Package with Alamo or National then up to 3 drivers age 21-24 can drive the car with no additional charges on collection."}, {"url": "http://traveltips.usatoday.com/enterprise-requirements-renting-car-62736.html", "passage_text": "Age Requirements. The minimum age to rent an Enterprise car is 21 at most locations. Drivers under the age of 25 must pay a higher rental rate and select vehicles are unavailable to those under age 25."}, {"url": "https://www.uscarhire.com/faq-restrictions.aspx", "passage_text": "If you are age 21-24 then you can save money on the young drivers surcharge. Doing this, you can have up to 3 drivers age 21-24 plus additional drivers age 25 and over (up to a total of 4 drivers maximum). There will then be no additional surcharges for the young drivers on collection of the car."}, {"url": "http://www.carrentalexpress.com/tips/who-can-rent-carage-requirements", "passage_text": "Young Drivers. Most agencies will have a non-negotiable minimum age requirement of 25. Younger drivers (usually 18 to 24) will be subject to a younger driver surcharge. Even if you do meet the age requirement, some agencies will even have an upper age requirement for certain specialty vehicles."}, {"url": "https://www.sixt.com/age-restrictions/", "passage_text": "If you are under the age of 25 and want to rent a car in the USA you will be charged an underage fee. The fee ranges differs per location and state. However, if you are over the age of 25 you will have no limitations on which vehicle you would like to drive if you have held your driver’s license for over one year."}, {"url": "https://www.sixt.com/age-restrictions/", "passage_text": "If you are renting a car with Sixt within the USA, the minimum age you have to be is 21. At the age of 21 you will be able rent several categories with Sixt but you will be restricted to certain selected categories."}, {"url": "http://traveltips.usatoday.com/age-requirement-rent-car-62294.html", "passage_text": "Older Drivers. Car rental agencies in the United States do not typically impose a maximum age limit on rentals. In some countries, however, a maximum age limit is common. Age limits vary between rental agencies and from country to country, but often fall between age 75 and 80."}]