[{"url": "http://www.buzzle.com/articles/monera-characteristics.html", "passage_text": "After an in-depth study of the characteristics of Monera kingdom, it was divided into two groups archaea and bacteria. This classification of living beings was under the three-domain system of taxonomy that was established in 1991. The third domain included the Eukaryote group."}, {"url": "http://4to40.com/science/index.asp?p=Monera_Characteristics", "passage_text": "After a deep study of Monera kingdom characteristics, the kingdom was divided into two groups Archaea and Bacteria. This classification of living things was under the three domain system of taxonomy that was established in 1991. The third domain included the Eukaryote group."}, {"url": "http://biology.tutorvista.com/organism/kingdom-monera.html", "passage_text": "The Kingdom Monera includes organisms that are single-celled known as bacteria. The microorganisms in Kingdom Monera are considered as the most ancient living forms on earth. The kingdom is divided into two groups Archaebacteria and Eubacteria. All the organisms of this kingdom are prokaryotes."}, {"url": "http://kingdomsmidtermproject.weebly.com/monera.html", "passage_text": "Characteristics of Monera. All organisms that fall into the Moneran kingdom are considered prokaryotes. They are the simplest and earliest life forms on the planet. Bacteria are part of the Moneran kingdom. All members of the kingdom Monera have no nuclei in their cells. All genetic material in these cell floats around in the cytoplasm. They have plasmid DNA. Monerans reproduce both sexually and asexually. digest their food outside of the cell and then absorb the nutrients."}, {"url": "http://biology.tutorvista.com/organism/kingdom-monera.html", "passage_text": "Kingdom Monera-All the organisms of this kingdom are prokaryotes. Complex structure was the basis of classification of organisms, many centuries ago. According to R.H. Whittaker's five kingdom classification all the bacteria were placed under the Kingdom Monera."}, {"url": "http://biology.tutorvista.com/organism/kingdom-monera.html", "passage_text": "General characteristics of the kingdom Monera are as follows: They are primitive organisms. All organisms of the kingdom are prokaryotes. They are present in both living and non-living environment. They can survive in harsh and extreme climatic conditions like in hot springs, acidic soils etc."}, {"url": "http://4to40.com/science/index.asp?p=Monera_Characteristics", "passage_text": "Many centuries ago, organisms were classified according to their complex structure. The 5 kingdoms of living things includes the eukaryotic Protista, Fungi, Plantae and Animalia. You can find out more information on characteristics of Fungi. The single celled organisms like bacteria were placed under the kingdom Monera."}]