[{"url": "https://en.wikipedia.org/wiki/Ennis,_Texas", "passage_text": "In 1872 the Houston and Central Texas Railroad (H&TC) arrived at the spot that then became Ennis. The city is named for Cornelius Ennis, an official of the railroad. Ennis served as Mayor of Houston (1856–57), and as a director of the Houston Tap and Brazoria Railway and H&TC. Ennis is a city in Ellis County, Texas, United States, and a southeastern suburb of Dallas. The population was 18,513 at the 2010 census"}, {"url": "http://www.ennistx.gov/", "passage_text": "Welcome. Welcome to our redesigned City of Ennis website. Whether you're a resident, a business, or just visiting, we hope that this site will provide you with the City contacts and information you need quickly and easily. October 2015 Press Release-Ground Spraying for Mosquitoes. "}, {"url": "http://www.city-data.com/city/Ennis-Texas.html", "passage_text": "(700 replies). Latest news from Ennis, TX collected exclusively by city-data.com from local newspapers, TV, and radio stations. Ancestries: German (7.8%), English (7.0%), Irish (5.6%), United States (4.7%), Czech (4.2%), French (2.6%). Current Local Time: CST time zone. Land area: 18.0 square miles. Fire-safe hotels and motels in Ennis, Texas: 1  Quailty Inn Ennis, 107 Chamber Of Commerce, Ennis, TX 75119, Phone: (972) 875-9641. 2  Baymont Inn & Suites, 100 S I-45, Ennis, TX 75119, Phone: (972) 875-3390, Fax: (972) 875-6066."}, {"url": "http://ennis-chamber.com/", "passage_text": "Welcome to Ennis Chamber of Commerce. Open spaces, a diverse population, an award-winning education system and convenience… all within a half hour drive from one of the most vibrant cities in the nation. Welcome to Ennis, Texas. With an eye to the future and an appreciation of the past, Ennis is an exciting place to both live and work. We offer the conveniences necessary for modern living in a setting that is reminiscent of days past"}, {"url": "https://en.wikipedia.org/wiki/Ennis,_Texas", "passage_text": "Ennis is also a part of the Texas Congressional District represented by Jim Pitts. Ennis is the only incorporated city in the United States that still elects its City Marshal. The election is held every two years with the winner being named Chief of Police by the City Council and City Manager. Ennis is a city in Ellis County, Texas, United States, and a southeastern suburb of Dallas. The population was 18,513 at the 2010 census"}, {"url": "http://visitennis.org/", "passage_text": "Exceptional / Exhilarating / Exciting / Ennis!!!! Pack your bag for a Texas must-see! Ennis, just 25 minutes south of downtown Dallas on IH-45, is a perfect place to bring the family for a weekend getaway or just for the day. Ennis offers family fun year round! Feel the warm hospitality as you stroll down the brick streets of the historic district. Shopping in downtown Ennis is recommended Tuesday through Saturday. Experience the 40 mile drive of the breathtaking bluebonnets of the Official Bluebonnet Trail of Texas in April. Bus tours are welcome. Savor authentic Czech food, music, and fun at the National Polka Festival held in May, every Memorial Day weekend."}, {"url": "http://www.ennis.com/", "passage_text": "Log in to SelfService. Ennis, Inc. has a nationwide footprint with over 60 facilities across North America engaging in the print and manufacture of business forms, apparel and commercial print for the wholesale trade. "}, {"url": "http://www.visitennis.org/bluebonnet.htm", "passage_text": "Ennis was designated by the 1997 State Legislature as the home of the  Official Texas Bluebonnet Trail  and was designated the  Official Bluebonnet City of Texas .. From April 1-30, Ennis showcases over 40 miles of mapped driving Bluebonnet Trails sponsored by the Ennis Garden Club. These trails are the oldest such trails known in the state, and tens of thousands of visitors make the short trek to Ennis to view this wonderful wildflower show."}]