[{"url": "http://ir.pricelinegroup.com/faq.cfm", "passage_text": "The Priceline Group's fiscal year is based on the calendar year, with the first day of the fiscal year on January 1 and the last day of the fiscal year on December 31. The Priceline Group's 1st quarter ends March 31, its 2nd quarter ends June 30, its 3rd quarter ends September 30 and its 4th quarter ends"}, {"url": "http://ir.pricelinegroup.com/faq.cfm", "passage_text": "The Priceline Group was incorporated in the state of Delaware on July 30, 1998. Priceline.com LLC pre-existed The Priceline Group, and was formed as a limited liability company on July 18, 1997."}, {"url": "http://www.eater.com/2014/6/13/6207641/opentable-by-the-numbers-from-launch-to-2-6-billion", "passage_text": "According to TechCrunch the transaction comes with cash in Ness's coffers that brings the net value to $11.3 million.. OpenTable's plan is to discontinue the app and integrate its technology into the OpenTable recommendation platform. June: Priceline acquires OpenTable for $2.6 billion in cash. OpenTable will continue to operate as an independent brand under its current management."}, {"url": "http://www.eater.com/2014/6/13/6207641/opentable-by-the-numbers-from-launch-to-2-6-billion", "passage_text": "Templeton raised $36 million over two years. According to Fortune, in 2001 OpenTable was hemorrhaging money: despite operating in 50 cities, they were spending $1 million a month and bringing in just $100,000 in revenue. Needless to say, investors weren't happy."}, {"url": "http://tech.co/agoda-2012-02", "passage_text": "Founded in 2002, Bangkok-based Agoda was acquired five years later by Priceline. The site – with hotel reservations, reviews, and travel tips – is available in 37 languages and boasts the lowest prices at 170,000 hotels worldwide."}, {"url": "http://tech.co/agoda-2012-02", "passage_text": "It is relatively easy for me to be based in Bangkok and still be connected with our operations around the world. Tags: Acquisition, acquisitions, agoda, Asia, Entrepreneur, hotel booking, hotel bookings, hotel reservations, hotels, interviews, Priceline, robert rosenstein, thailand, travel."}]