[{"url": "http://www.everyculture.com/A-Bo/Bhutan.html", "passage_text": "Location and Geography. Bhutan is located in the northern area of South Asia and is also in the eastern Himalayan mountain area. It is 18,000 square miles (46,620 square kilometers) in size and is bordered in the north by the People's Republic of China and to the south, east, and west by India. "}, {"url": "http://www.nationsencyclopedia.com/economies/Asia-and-the-Pacific/Bhutan.html", "passage_text": "A landlocked country located in South Asia, north of India and south of China, Bhutan has an area of 47,000 square kilometers (18,1467 square miles). Bhutan's capital city, Thimpu, is centrally located towards the country's western border with India. Bhutan shares a 605-kilometer (376-mile) border with India and a 470-kilometer (292-mile) border with China. In 2000 the population of Bhutan was estimated at 2,005,222 by the CIA World Factbook"}, {"url": "http://www.nationsencyclopedia.com/economies/Asia-and-the-Pacific/Bhutan.html", "passage_text": "LOCATION AND SIZE. A landlocked country located in South Asia, north of India and south of China, Bhutan has an area of 47,000 square kilometers (18,1467 square miles). Comparatively, the area occupied by Bhutan is about half the size of Indiana. Bhutan's capital city, Thimpu, is centrally located towards the country's western border with India. Bhutan shares a 605-kilometer (376-mile) border with India and a 470-kilometer (292-mile) border with China. In 2000 the population of Bhutan was estimated at 2,005,222 by the CIA World Factbook"}, {"url": "http://atlapedia.com/online/maps/political/India_etc.htm", "passage_text": "India India is located on the Indian sub-continent in South Asia. It is bound by Pakistan to the northwest, China, Bhutan and Nepal to the north, Myanmar and Bangladesh to the east, the Bay of Bengal to the southeast and the Arabian Sea to the southwest.... It is bound by India to the north, east and west, Myanmar to the southeast and by the Bay of Bengal to the south.... Bhutan Bhutan is a landlocked country located in the East Himalayan Mountains of Central Asia. It is bound by the Tibetan region of China to the north as well as India to the south, east and "}, {"url": "http://www.gomapper.com/travel/where-is/bhutan-located.html", "passage_text": "Bhutan is a country with a small population which is located in the continent/region of Asia. Countries near Bhutan include Bangladesh, Nepal, Myanmar and India. Its biggest cities and towns include Phuntsholing, Punākha, Samdrup Jongkhar and Geylegphug. "}, {"url": "http://www.answers.com/Q/Where_is_Bhutan", "passage_text": "Split and merge into it. Answer by Cosmospup. Confidence votes 30.1K. The Kingdom of Bhutan is a landlocked country in the Northern hemisphere. Located within South Asia, located at the eastern end of the Himalaya Mountains and bordered to the south, east and west by India and to the north by Tibet. See related link for a pictorial. "}, {"url": "http://www.whereig.com/bhutan/", "passage_text": "Bhutan map also shows that Bhutan is landlocked country located eastern side of Great Himalaya Mountains. Bhutan shares its international boundary with two giant countries i.e. from the northern side it is China and from southern side it is India. "}, {"url": "http://www.mapsofworld.com/bhutan/", "passage_text": "Bhutan, a land locked state is located in South Asia. It is bordered by India, China, Nepal and Bangladesh. Its capital city is Thimphu. Print. The Kingdom of Bhutan is a country located in South Asia. The human history of Bhutan dates back to around 2000 BC, with archaeological evidence of the indigenous people of the region. Buddhism is closely tied to Bhutan's history and politics as the nation was shaped over time."}]