[{"url": "http://www.answers.com/Q/How_much_does_an_ice_hockey_stick_cost", "passage_text": "If your playing in a league it can cost form anywhere between 100 and 400 dollars. Then you have the cost of gear and hockey sticks so if you wwant top of the line your lookin … g at over one grand but with stuff that will get you by you could be speneding 150 to 300 dollars, Hope this helps. 1 person found this useful. The most expensive (although arguably of lower quality than many cheape … r sticks) can be upwards of $500 quite easily. Most are in the middle of the range, with most adult sticks being between $200 and $400. Some are a bit lower, some are a bit higher."}, {"url": "https://en.wikipedia.org/wiki/Ice_hockey_stick", "passage_text": "An ice hockey stick is a piece of equipment used in ice hockey to shoot, pass, and carry the puck. Ice hockey sticks are approximately 150–200 cm long, composed of a long, slender shaft with a flat extension at one end called the blade. The blade is the part of the stick used to contact the puck, and is typically 25 to 40 cm long. This is the most expensive AUTHENTICATED hockey stick in the history of the game. Another unauthenticated stick made in 1850 's sold for $4 million in America. In the mid-nineteenth century, the Starr Manufacturing Company began to sell the stick nationally and internationally."}, {"url": "http://www.hockeygiant.com/stick---shafts---blades-hockey-composite-sticks---shafts-one-piece-sticks-senior-one-piece-hockey-st.html", "passage_text": "Senior composite hockey sticks are typically between 58 and 64 in length, but the most common length is 60. This measurement is taken from the top of the shaft, down the backside of the shaft to the heel of the blade. HockeyGiant.com carries all of the best one piece composite hockey sticks from Bauer, Easton, Reebok, CCM, Warrior and other top hockey stick brands. Our selection of senior hockey sticks is second to none and you can always find great deals by clicking on the clearance option. 1  Bauer Nexus 1N Grip Hockey Stick-Senior. 2  Regular price: $269.99 Our Price: $269.99"}, {"url": "http://www.howmuchisit.org/hockey-equipment-cost/", "passage_text": "1 The website MyNextBuck.com gives a breakdown of an adult hockey player’s initial investment in equipment for the sport totaling to about $1000 to get all the equipment. 2  Ice skates cost from $80 to $300 but will be lower quality in this price range. 1 Other essential equipment to include in the cost are the helmet with a cage at about $80-$130; shoulder pads for $50 to $100; elbow pads costing $30 to$60 and gloves, which should be just the right fit to be able to properly hold the stick, which could cost $30 to $100."}, {"url": "https://www.purehockey.com/hockey-sticks", "passage_text": "The flex, the curve and the design all greatly influence who you are as a player. There are a few kinds of sticks to choose from-a composite stick, a wood stick, a street hockey stick and a pro stock stick. On all sticks, the curved part where the blade and the shaft meet is called the taper. The blade is typically 10 to 15 inches long and often runs at approximately 45 degrees to the shaft"}, {"url": "http://www.howmuchisit.org/how-much-do-hockey-sticks-cost/", "passage_text": "1 On average, a hockey stick is going to cost anywhere from $10 to as much as $300. 2  The wood sticks are generally going to be cheaper than those made of a composite material. 1 The wood sticks are generally going to be cheaper than those made of a composite material. 2  For a good stick, plan on spending anywhere from $30 to $100. 3  For example, Purehockey.com has composite sticks selling for as low as $27.99 to as much as $259.99."}, {"url": "http://www.howmuchisit.org/how-much-do-hockey-sticks-cost/", "passage_text": "1 Livestrong.com reports that the average wood stick sold for about $25 in June of 2010 while composite sticks were priced at around $100 on the average. 2  Due to this big difference in cost, most experts recommend wooden sticks for beginners. 1 The wood sticks are generally going to be cheaper than those made of a composite material. 2  For a good stick, plan on spending anywhere from $30 to $100. 3  For example, Purehockey.com has composite sticks selling for as low as $27.99 to as much as $259.99."}, {"url": "http://www.howmuchisit.org/how-much-do-hockey-sticks-cost/", "passage_text": "1 Wood sticks, on the other hand, only cost $10 to $50. 2  Livestrong.com reports that the average wood stick sold for about $25 in June of 2010 while composite sticks were priced at around $100 on the average. 3  Due to this big difference in cost, most experts recommend wooden sticks for beginners. 1 The wood sticks are generally going to be cheaper than those made of a composite material. 2  For a good stick, plan on spending anywhere from $30 to $100. 3  For example, Purehockey.com has composite sticks selling for as low as $27.99 to as much as $259.99."}]