[{"url": "http://www.webmd.com/baby/guide/pregnancy-am-i-pregnant", "passage_text": "You should know that these symptoms may be caused by other things besides being pregnant. So the fact that you notice some of these symptoms does not necessarily mean you are pregnant. The only way to tell for sure is with a pregnancy test. This can cause one of the earliest signs of pregnancy -- spotting and, sometimes, cramping. That's called implantation bleeding. It occurs anywhere from six to 12 days after the egg is fertilized."}, {"url": "http://www.babymed.com/pregnancy-symptoms/what-earliest-i-can-feel-pregnancy-signs-and-what-are-typical-pregnancy-signs", "passage_text": "Pregnancy Symptoms You Can Feel. Just a few days after the fetus is conceived, it implants in the uterus. This is when the first physical signs of pregnancy start. Women may feel cramping and experience spotting at this early stage. If spotting occurs, it may not show until one to two weeks after the fertilized egg is implanted. Spotting is called implantation bleeding. Timeline for Early Symptoms You Can Feel. Changes occur in the female body as soon as conception occurs, but these changes cause no physical changes until about one week after pregnancy. From that point until the end of gestation, physical changes can be felt throughout the"}, {"url": "http://www.babycenter.com/404_early-signs-of-pregnancy-when-will-i-feel-symptoms_10372077.bc", "passage_text": "Most women don't feel very different at 3 weeks, but some may notice a tiny bit of  implantation spotting  or feel early pregnancy symptoms such as fatigue, tender breasts, nausea, a heightened sense of smell, food aversions, and more frequent urination. Pregnancy symptoms at 8 weeks. Hormone changes continue to make you feel sluggish and tired, while nausea and vomiting also may be draining your energy. Your bra might start to feel a little snug as rising hormone levels prepare your breasts for lactation."}, {"url": "http://americanpregnancy.org/getting-pregnant/early-pregnancy-symptoms/", "passage_text": "Pregnancy symptoms differ from woman to woman and pregnancy to pregnancy; however, one of the most significant pregnancy symptoms is a delayed or missed period. You may experience pregnancy signs within a week of conception. However, some women report that they did not experience any symptom for a few weeks. If you need free testing, you can search below or order affordable early detection pregnancy tests online."}, {"url": "http://www.babycenter.com/404_early-signs-of-pregnancy-when-will-i-feel-symptoms_10372077.bc", "passage_text": "Pregnancy symptoms at 6 weeks. For most women, morning sickness begins between 6 and 8 weeks. You may also be exhausted and experiencing mood swings, which could be due to hormonal changes as well as the stress of wondering what lies ahead in your pregnancy. About 25 percent of women have spotting in early pregnancy. Pregnancy symptoms at 8 weeks. Hormone changes continue to make you feel sluggish and tired, while nausea and vomiting also may be draining your energy. Your bra might start to feel a little snug as rising hormone levels prepare your breasts for lactation."}, {"url": "http://www.babycentre.co.uk/x25006061/what-pregnancy-symptoms-will-i-have-at-three-weeks", "passage_text": "Hospital midwife. It is possible to get the feeling that you're pregnant soon after you've conceived. So you may experience very early pregnancy symptoms at three weeks. One of the earliest symptoms you may feel is a prickling, tingling sensation in your nipples, which can sometimes feel very sore. This happens as pregnancy hormones increase the blood supply to your breasts. Pregnancy hormones may have already started to make you feel tired and weepy. You may feel exhausted, and struggle to stay awake during the day, as your body cranks up to support your baby. Bear in mind that at three weeks, you won't yet know if you're pregnant or not, as you probably only conceived a week or so ago."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/getting-pregnant/in-depth/symptoms-of-pregnancy/art-20043853", "passage_text": "Classic symptoms of pregnancy. In addition to a missed period, the earliest signs and symptoms of pregnancy might include: 1  Tender, swollen breasts. 2  Early in pregnancy hormonal changes might make your breasts tender, sensitive or sore. 3  Or your breasts might feel fuller and heavier. 1 Or your breasts might feel fuller and heavier. 2  Nausea with or without vomiting. 3  Morning sickness, which can strike at any time of the day or night, sometimes begins as early as three weeks after conception. 4  While the cause of nausea during pregnancy isn't clear, pregnancy hormones likely play a role."}, {"url": "http://www.bounty.com/pregnancy-and-birth/pregnancy/pregnancy-week-by-week/4-weeks-pregnant", "passage_text": "You at four weeks pregnant. You might feel some pregnancy symptoms at four weeks, but there is every chance you will put them down to your period being about to arrive. You boobs might have that 'time of the month' feeling, and you might even have some spotting or light bleeding."}]