[{"url": "http://www.answers.com/Q/What_is_Mezzo_Soprano", "passage_text": "2. Even though Alto is not a voice type, mezzo-sopranos and alto are pretty much the same in range, but she is not a contralto (appropriate name for the lower alto part) because her tessitura (voice quality and sound) is not deep enough to qualify her as a contralto. 3. "}, {"url": "https://en.wikipedia.org/wiki/Mezzo-soprano", "passage_text": "A mezzo-soprano or mezzo (English pronunciation: /ˈmɛtsoʊ/ , /ˈmɛzoʊ/ ; [ˈmɛddzo soˈpraːno] meaning half soprano) is a type of classical female singing voice whose vocal range lies between the soprano and the contralto voice types. The mezzo-soprano's vocal range usually extends from the A below middle C to the A two octaves above (i.e. A 3 –A 5 in scientific pitch notation, where middle C = C 4). In the lower and upper extremes, some mezzo-sopranos may extend down to the F below middle C (F 3) and as high as high C (C 6). A dramatic mezzo-soprano has a strong medium register, a warm high register and a voice that is broader and more powerful than the lyric and coloratura mezzo-sopranos. This voice has less vocal facility than the coloratura mezzo-soprano."}, {"url": "https://en.wikipedia.org/wiki/List_of_mezzo-sopranos_in_non-classical_music", "passage_text": "The mezzo-soprano is the middle female voice and the most common of the female singing voices, which tends to dominate in non-classical music, with vocal range that typically lies between the A below  middle C  (C 4) to the A two octaves above (i.e. A 3 - A 5). A 3 - A 5). In the lower and upper extremes, some mezzo-sopranos may extend down to the F below middle C (F 3) and as high as high C (C 6). The mezzo-soprano voice (unlike the soprano voice) is strong in the middle register and weaker in the head register, resulting in a deeper tone than the soprano voice."}, {"url": "https://en.wikipedia.org/wiki/Soprano", "passage_text": "The soprano has the highest vocal range of all voice types, with the highest tessitura. A soprano and a mezzo-soprano have a similar range, but their tessituras will lie in different parts of that range. The low extreme for sopranos is roughly A 3 or B ♭ 3 (just below middle C). Within opera, the lowest demanded note for sopranos is F 3 (from Richard Strauss 's Die Frau ohne Schatten)"}, {"url": "https://en.wikipedia.org/wiki/Mezzo-soprano", "passage_text": "The vocal range of the mezzo-sopranos lies between the soprano and the contralto voice types. Mezzo-sopranos generally have a heavier, darker tone than sopranos. The mezzo-soprano voice resonates in a higher range than that of a contralto. A dramatic mezzo-soprano has a strong medium register, a warm high register and a voice that is broader and more powerful than the lyric and coloratura mezzo-sopranos. This voice has less vocal facility than the coloratura mezzo-soprano."}, {"url": "http://www.audioenglish.org/dictionary/mezzo-soprano.htm", "passage_text": "The noun MEZZO-SOPRANO has 2 senses: 1. a soprano with a voice between soprano and contralto. 2. the female singing voice between contralto and soprano. Familiarity information: MEZZO-SOPRANO used as a noun is rare. "}, {"url": "http://www.urbandictionary.com/define.php?term=mezzo-soprano", "passage_text": "Top Definition. mezzo-soprano. The medium female singing voice in opera and non-classic al music (although in the choir, the mezzo-soprano and the contralto are lumped together as alto s). The mezzo-soprano has a range of two octave s from A3 (below middle C) to A5 (just two notes short of high C). Dramatic mezzo-soprano: Powerful, rich, warm and with a stronger (and seductive) lower range than a soprano, she is reserved for the roles of villains (temptress es, femmes fatales, witches) as well as mothers and friends of the soprano."}, {"url": "http://choirly.com/dramatic-mezzo-soprano/", "passage_text": "A dramatic mezzo-soprano, just like the lyric and coloratura mezzo-soprano, can sing from a G3 to a B5 or C6. As you can see her range is very similar to that of the sopranos’ and this is why range is never the sole means of categorizing a singer’s voice. Most often a dramatic mezzo has the same range as a dramatic soprano, and what distinguishes her is that she sings more comfortably at a lower tessitura. While the dramatic soprano can sustain long notes in the higher register, the dramatic mezzo has more power in the middle and lower range."}]