[{"url": "https://en.wikipedia.org/wiki/Erika_(given_name)", "passage_text": "The given name Erika, or Erica, is a feminine form of Eric, deriving from the Old Norse name Eirikr (eiríkr Or erikr Eríkr In eastern scandinavia due). to monophthongization The name is thus usually taken to mean something along the lines of one ruler,  autocrat , eternal ruler or ever powerful. It is a common name in many Western societies. It is also a popular given name in Japan. Erica is also the name of a genus of approximately 860 species of flowering plants in the family Ericaceae, commonly known as heaths or heathers in English."}, {"url": "http://www.babynamewizard.com/baby-name/girl/erika", "passage_text": "Feminine form of Erik, which is derived from the Old Norse Eirikr (eirìkr eternal), ruler a compounding of the elements (ei, ever) always and (rikr, ríkr). Ruler, king however there are some who believe the name comes To The old norse Via the (germanic) ehrei honor And-The proto (germanic): rīk, king hence.. honorable king Feminine form of Erik, which is derived from the Old Norse Eirikr (eirìkr eternal), ruler a compounding of the elements (ei, ever) always and (rikr, ríkr). ruler king"}, {"url": "http://www.sheknows.com/baby-names/name/erika", "passage_text": "Teutonic Meaning: The name Erika is a Teutonic baby name. In Teutonic the meaning of the name Erika is: noble. American Meaning: The name Erika is an American baby name. In American the meaning of the name Erika is: noble. Hungarian Meaning: The name Erika is a Hungarian baby name. In Hungarian the meaning of the name Erika is: Powerful. Norse Meaning: The name Erika is a Norse baby name. In Norse the meaning of the name Erika is: Ever or eternal ruler."}, {"url": "http://www.names.org/n/erika/about", "passage_text": "The name Erika is of Scandinavian origin, and it means Always Ruler . It's a name commonly given to girls. Erika Eleniak is an actress. "}, {"url": "http://www.sheknows.com/baby-names/name/erica", "passage_text": "The name Erica is a Teutonic baby name. In Teutonic the meaning of the name Erica is: noble. American Meaning: The name Erica is an American baby name. In American the meaning of the name Erica is: noble. Latin Meaning: The name Erica is a Latin baby name. In Latin the meaning of the name Erica is: The plant 'erica'. Norse Meaning: The name Erica is a Norse baby name. In Norse the meaning of the name Erica is: Forever strong."}, {"url": "http://www.thinkbabynames.com/meaning/0/Erica", "passage_text": "Erica /er-i-ca/ [3 sylls.] as a girls' name is pronounced AIR-a-ka. It is of Old Norse origin, and the meaning of Erica is complete ruler . Latinate feminine form of Eric, and also a flower name, as the Latin word erica means  heather . Scandinavian name revived in the 19th century. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Erika", "passage_text": "Erika /eri-ka/ [3 sylls.] as a girls' name. Erika's name origin is Old Norse, and the name Erika means complete ruler. Erika is an alternate form of Erica (Old Norse): Latinate feminine version of Eric. Erck is a common last name. Kreatif forms: Erita, Erka. "}, {"url": "http://www.meaning-of-names.com/scandinavian-names/erika.asp", "passage_text": "Meaning of Erika. Scandinavian name. In Scandinavian, the name Erika means-from the name erica.The name Erika originated as an Scandinavian name. The name Erika is most often used as a girl name or female name. Scandinavian Name Meaning-from the name eric"}]