[{"url": "http://www.aafp.org/afp/2007/0501/p1357.html", "passage_text": "Pleurisy is inflammation of the parietal pleura that typically results in characteristic pleuritic pain and has a variety of possible causes. Pulmonary embolism is the most common life-threatening cause of pleuritic chest pain and should be considered in all patients with this symptom. Evaluation should be performed using validated clinical decision rules, D-dimer testing, and imaging studies as needed."}, {"url": "http://www.faqs.org/health/topics/15/Pleurisy.html", "passage_text": "Pleurisy is an inflammation of the membrane that surrounds and protects the lungs (the pleura). Inflammation occurs when an infection or damaging agent irritates the pleural surface. As a consequence, sharp chest pains are the primary symptom of pleurisy. Pleurisy, also called pleuritis, is a condition that generally stems from anexisting respiratory infection, disease, or injury. In people who have otherwise good health, respiratory infections or pneumonia are the main causes of pleurisy."}, {"url": "http://medical-dictionary.thefreedictionary.com/Pleuritic+chest+pain", "passage_text": "Pleurisy is an inflammation of the membrane that surrounds and protects the lungs (the pleura). Inflammation occurs when an infection or damaging agent irritates the pleural surface. As a consequence, sharp chest pains are the primary symptom of pleurisy. Pleural effusion is more common and refers to an accumulation of fluid within the pleural space; dry pleurisy is inflammation without fluid build-up. Less pain occurs with pleural effusion because the fluid forces the membrane surfaces apart."}, {"url": "http://medical-dictionary.thefreedictionary.com/Pleuritic+chest+pain", "passage_text": "The pain of pleurisy is usually treated with analgesic and anti-inflammatory drugs, such as acetaminophen, ibuprofen, and indomethacin. People with pleurisy may also receive relief from lying on the painful side. Sometimes, a painful cough will be controlled with codeine-based cough syrups. Pleural effusion is more common and refers to an accumulation of fluid within the pleural space; dry pleurisy is inflammation without fluid build-up. Less pain occurs with pleural effusion because the fluid forces the membrane surfaces apart."}, {"url": "http://www.mayoclinic.org/diseases-conditions/pleurisy/basics/symptoms/CON-20022338", "passage_text": "The signs and symptoms of pleurisy might include: 1  Chest pain that worsens when you breathe, cough or sneeze. 2  Shortness of breath — because you are trying to minimize breathing in and out. 3  A cough — only in some cases. 4  A fever — only in some cases. "}, {"url": "http://www.fpnotebook.com/Lung/Sx/PlrtcChstPn.htm", "passage_text": "Definition (CSP). inflammation of the pleura, with exudation into its cavity and upon its surface; may occur as either an acute or a chronic process. Definition (MSH). INFLAMMATION of PLEURA, the lining of the LUNG. When PARIETAL PLEURA is involved, there is pleuritic CHEST PAIN. Concepts. "}, {"url": "http://www.aafp.org/afp/2007/0501/p1357.html", "passage_text": "Pleuritic chest pain is a common presenting symptom and has many causes, which range from life-threatening to benign, self-limited conditions. Pulmonary embolism is the most common potentially life-threatening cause, found in 5 to 20 percent of patients who present to the emergency department with pleuritic pain. Other clinically significant conditions that may cause pleuritic pain include pericarditis, pneumonia, myocardial infarction, and pneumo-thorax. Pulmonary embolism is the most common life-threatening cause of pleuritic chest pain and should be considered in all patients with this symptom. Evaluation should be performed using validated clinical decision rules, D-dimer testing, and imaging studies as needed."}, {"url": "http://medical-dictionary.thefreedictionary.com/Pleuritic+chest+pain", "passage_text": "When pleurisy occurs in certain locations, such as near the diaphragm, the pain may be felt in other areas such as the neck, shoulder, or abdomen (referred pain). Another indication of pleurisy is that holding one's breath or exerting pressure against the chest causes pain relief. Pleural effusion is more common and refers to an accumulation of fluid within the pleural space; dry pleurisy is inflammation without fluid build-up. Less pain occurs with pleural effusion because the fluid forces the membrane surfaces apart."}, {"url": "http://www.webmd.com/lung/tc/pleurisy-overview", "passage_text": "The symptoms of pleurisy are chest pain and difficulty breathing. The chest pain usually starts suddenly. People often describe it as a stabbing pain, and it usually gets worse with breathing. The pain: 1  May always be present, but it usually gets worse when you breathe in. 2  You may avoid breathing deeply to prevent the pain. 3  Usually is on only one side of the chest. 4  May extend to a shoulder or the belly"}, {"url": "http://www.answers.com/Q/What_is_referred_pain_in_pleurisy", "passage_text": "The thin sac-like covering that protects and cushions the lungs is called the pleura. The word pleurisy is a broad term used for a variety of disorders that may occur to the p … leura and usually refers to inflammation, pain, and shortness of breath. Referred pain-- The presence of pain in an area other than where it originates. In some pleurisy cases, referred pain occurs in the neck, shoulder, or abdomen."}]