[{"url": "http://www.tbolin.com/history/james_gang.html", "passage_text": "THE STORY: The James Gang was originally formed by drummer Jim Fox in Cleveland, Ohio in 1966. Though guitarist/singer Joe Walsh is most often associated with the early and highly successful James Gang, he actually was the replacement for Glenn Schwartz, who departed in January, 1968. "}, {"url": "http://www.mtv.com/artists/james-gang/", "passage_text": "The Gang's roots stretch back to 1966 in Cleveland, OH, where drummer Jim Fox formed the group with a few fellow Kent State University students, guitarist Glenn Schwartz and bassist Tom Kriss. But when Schwartz left to join Pacific Gas & Electric, Fox and Kriss opted to carry on with new singer/guitarist Joe Walsh. (The album was also one of the first recordings that noted producer Bill Szymczyk worked on.) Prior to sessions for the group's sophomore effort, Kriss exited the group, and was replaced by Dale Peters, resulting in the James Gang's definitive lineup."}, {"url": "https://en.wikipedia.org/wiki/James_Gang_Rides_Again", "passage_text": "Writing for AllMusic, critic Stephen Thomas Erlewine wrote of the album With their second album Rides Again, the James Gang came into their own... Walsh's songwriting had improved, giving the band solid support for their stylistic experiments. James Gang Rides Again is the second studio album by the American rock band James Gang. The album was released in mid 1970, on the label ABC Records. It is the James Gang's first album to feature bassist Dale Peter"}, {"url": "http://phish.net/song/walk-away/history", "passage_text": "Last Update: 2015-06-17. Like Phish, Joe Walsh 's original material includes a wealth of both frivolity and rock. Solidly in the latter category, Walk Away was the sole single from Walsh's last album with The James Gang and the band's only Top 40 hit. “Walk Away” is notable as one of very few songs that witnessed an extension in jamming length in modern times – usually compacted into three-to-four minutes in the 80s and 90s, versions since 2010 have averaged well over six."}, {"url": "http://www.classicbands.com/jamesgang.html", "passage_text": "His replacement was Joe Walsh, who was lured away from a band called The Measles. Walsh re-energized the group with his innovative instrumentals and the James Gang released their debut recording, Yer' Album, which rose to No. 83 on the Billboard charts later that year. The remaining James Gang members contacted Tommy Bolin from a band called Zephyr, on the recommendation of Joe Walsh. After a 15 minute audition, Bolin was invited to join. The James Gang offered Bolin the chance to play in front of large audiences, contribute heavily in the song writing, and earn a significant living."}, {"url": "https://en.wikipedia.org/wiki/James_Gang", "passage_text": "The James Gang was a rock band formed in Cleveland, Ohio in 1966. The band enjoyed moderate success with the singles  Funk #49  and  Walk Away , and are perhaps best remembered as the first popular band to feature the guitarist/vocalist Joe Walsh, who later became a member of the Eagles. James Gang, ca. 1970, from the James Gang Rides Again photo session Left to right: Jim Fox, Dale Peters, Joe Walsh."}, {"url": "http://www.last.fm/music/James+Gang", "passage_text": "read more. James Gang was an American rock band formed in Cleveland, Ohio, in 1966. Though the band was not a huge commercial success, the fame garnered by guitarist Joe Walsh (who replaced the original guitarist in 1968) has since made the group more notable. "}, {"url": "https://en.wikipedia.org/wiki/James_Gang", "passage_text": "Drummer Fox was the only remaining member of the original band when James Gang finally disbanded early in 1977. After James Gang broke up, drummer Fox was involved for a time with the Belkin management firm, who handled the affairs for artists like Michael Stanley Band, Wild Cherry and Donnie Iris. James Gang, ca. 1970, from the James Gang Rides Again photo session Left to right: Jim Fox, Dale Peters, Joe Walsh."}, {"url": "https://en.wikipedia.org/wiki/James_Gang", "passage_text": "Barger put the Gang in touch with ABC Records staff producer Bill Szymczyk, who signed them to ABC's new Bluesway Records subsidiary in January 1969. In March 1969 the band, now consisting of Fox, Kriss and Walsh and produced by Szymczyk, released its debut LP, Yer' Album. James Gang, ca. 1970, from the James Gang Rides Again photo session Left to right: Jim Fox, Dale Peters, Joe Walsh."}]