[{"url": "http://www.clemson.edu/extension/natural_resources/wildlife/publications/fs34_whitetailed_deer.html", "passage_text": "Breeding occurs during the fall and winter, but may extend from late August through January. Peak breeding usually occurs in November. The gestation period for white-tailed deer is slightly less than 7 months or between 190 and 210 days. Fawning normally extends from March through July with peak fawn-drop occurring in late May. Does bearing young for the first time often have a single fawn. "}, {"url": "http://www.answers.com/Q/What_is_the_gestation_period_of_a_deer", "passage_text": "A femalewhite tailed deer has a gestation period of 200 days. Other breeds of deer have pregnancies as short as 160 days. So about 5.3 months to 6.7 months. Hope it helps! Gestation for a whitetailed deer is about 6 and 1/2 months or 200 days. Does can mate in their first year but usually not untill the second year. Does usually give birth to on … ly one fawn the first time."}, {"url": "http://www.answers.com/Q/What_is_the_gestation_period_of_a_deer", "passage_text": "In primary reference to white-tail and mule deer, the gestation period lasts around 200 days. Mule deer tend to have a slightly shorter gestation period than white-tailed deer. Gestation for a whitetailed deer is about 6 and 1/2 months or 200 days. Does can mate in their first year but usually not untill the second year. Does usually give birth to on … ly one fawn the first time"}, {"url": "http://www.uwsp.edu/wildlife/ungulates/Pages/Mule%20Deer/Mule-Deer-Reproduction.aspx", "passage_text": "Mule deer, along with many other ungulates, are polygynous. The bucks fight for dominance and for the right to mate with the females. Antlers are shed after the breeding season, anytime from late January to early April. Once mated, the gestation period of the mule deer lasts for a little over 200 days. The doe delivers one to four fawns (usually 2) from late May to early June. A doe will usually produce a single fawn the first year she gives birth and then produce twins in following years. "}, {"url": "https://en.wikipedia.org/wiki/Red_deer", "passage_text": "The gestation period is the same for all subspecies. Red deer live over 20 years in captivity and in the wild they live 10 to 13 years, though some subspecies with less predation pressure average 15 years. The red deer (Cervus elaphus) is one of the largest deer species. The red deer inhabits most of Europe, the Caucasus Mountains region, Asia Minor, Iran, parts of western Asia, and central Asia."}, {"url": "http://www.gestationcalculator.com/other/deer-pregnancy-calculator", "passage_text": "*Uses an average 201 day gestation period for a Deer. Deer gestation periods can generally be anywhere from 200-205 days. Deer will generally conceive after one breeding. The Deer Gestation Period Calculator above attempts to generalize the estimation of the due date without any additional factors using a 201 day gestation period for Deer."}, {"url": "https://answers.yahoo.com/question/index?qid=20080222065431AAEW7f5", "passage_text": "Best Answer: Here in Maine the white tail deer starts the breeding process in September and lasts until January. There are 5 phases of the rut for breeding in the buck's hierarchy. The gestation period is 180 days and usually born in late spring. The doe will usually give birth to twins if she is a healthy deer. The fawns usually are born between May and June and by the fall, the fawns have lost all of there spots. I have seen late bloomers too, and have a hard time through the winter months."}, {"url": "http://edersbow.com/what-is-the-gestation-period-for-whitetail-deer/", "passage_text": "If a doe is not mated, a second estrus occurs approximately 28 days later. Mating occurs from October to December and gestation is approximately 6 and a half months (200 days) . In her first year of breeding, a female generally has one fawn, but 2 per litter (occasionally 3 or 4) are born in subsequent years. Fawns are able to walk at birth and nibble on vegetation only a few days later."}, {"url": "http://www.gestationcalculator.com/other/deer-pregnancy-calculator", "passage_text": "Gestation Period for Deer. The Gestation Period for a Doe is approximately 200-205 days from the first breeding until the fawn is born. Deer will generally conceive after one breeding. The Deer Gestation Period Calculator above attempts to generalize the estimation of the due date without any additional factors using a 201 day gestation period for Deer."}]