[{"url": "http://insects.about.com/od/flies/a/10-facts-about-mosquitoes.htm", "passage_text": "1. Mosquitoes are the deadliest animals on Earth. That's right, more deaths are associated with mosquitoes than any other animal on the planet. Mosquitoes may carry any number of deadly diseases, including malaria, dengue fever, yellow fever, and encephalitis. Mosquitoes also carry heartworm, which can be lethal to your dog. 2. Only female mosquitoes bite humans and animals; males feed on flower nectar"}, {"url": "http://www.insects.org/entophiles/diptera/mosquitoes.html", "passage_text": "Mosquitoes are members of the insect order Diptera along with flies and gnats. In fact, the name mosquito comes from the Spanish word that means small fly. Most people recognize how bothersome mosquitoes can be when they are buzzing and biting. Mosquitoes spread West Nile virus from birds to people and horses. Adult mosquitoes are slender, long-legged insects. They have round heads and long, slender wings. When they are resting, the wings lie flat on the insect’s back. Both male and female mosquitoes feed on honeydew, nectar, and plant juices."}, {"url": "https://en.wikipedia.org/wiki/Mosquito", "passage_text": "Mosquitoes are small, midge-like flies which comprise the family Culicidae. Females of most species are ectoparasites, whose tube-like mouthparts (called a proboscis) pierce the hosts' skin to consume blood. The word mosquito (formed by mosca and diminutive ito) is Spanish for little fly . Some mosquitoes also attack invertebrates, mainly arthropods. Though the loss of blood is seldom of any importance to the victim, the saliva of the mosquito often causes an irritating rash that is a serious nuisance. Much more serious though, are the roles of many species of mosquitoes as vectors of diseases. In passing from host to host, some transmit extremely harmful infections such as malaria, yellow fever, west Nile virus, dengue fever, filariasis, and other arboviruses, rendering it the deadliest animal family in the world"}, {"url": "http://www.cdc.gov/malaria/about/biology/mosquitoes/index.html", "passage_text": "Larger Picture. Malaria is transmitted among humans by female mosquitoes of the genus Anopheles. Female mosquitoes take blood meals to carry out egg production, and such blood meals are the link between the human and the mosquito hosts in the parasite life cycle. The successful development of the malaria parasite in the mosquito (from the gametocyte stage to the sporozoite stage) depends on several factors. "}, {"url": "http://animals.howstuffworks.com/insects/mosquito1.htm", "passage_text": "Types of Mosquitoes. There are more than 2,700 species of mosquitoes in the world, and there are 13 mosquito genera (plural for genus) that live in the United States. Of these genera, most mosquitoes belong to three: 1  Aedes-These are sometimes called floodwater mosquitoes because flooding is important for their eggs to hatch. 1 Aedes mosquitoes have abdomens with pointed tips. 2  They include such species as the yellow-fever mosquito (Aedes aegypti) and the Asian tiger mosquito (Aedes albopictus). 3  They are strong fliers, capable of travelling great distances (up to 75 miles/121 km) from their breeding sites."}, {"url": "http://www.pestworld.org/pest-guide/mosquitoes/", "passage_text": "Spotlight on Mosquitoes. Mosquitoes are vectors of numerous diseases including malaria, yellow fever, dengue fever, encephalitis, Chikungunya and West Nile virus-a mosquito-borne disease of growing concern in the United States. "}, {"url": "http://www.insects.org/entophiles/diptera/mosquitoes.html", "passage_text": "Many people do not realize that mosquitoes are vectors of several human diseases including malaria, encephalitis, yellow fever, dengue, and filariasis. Mosquitoes spread West Nile virus from birds to people and horses. Adult mosquitoes are slender, long-legged insects. They have round heads and long, slender wings. When they are resting, the wings lie flat on the insect’s back. Both male and female mosquitoes feed on honeydew, nectar, and plant juices."}, {"url": "https://en.wikipedia.org/wiki/Mosquito", "passage_text": "Mosquitoes are members of a family of nematocerid flies: the Culicidae (from the Latin culex, genitive culicis, meaning midge or gnat). Superficially, mosquitoes resemble crane flies (family Tipulidae) and chironomid flies (family Chironomidae). Some mosquitoes also attack invertebrates, mainly arthropods. Though the loss of blood is seldom of any importance to the victim, the saliva of the mosquito often causes an irritating rash that is a serious nuisance. Much more serious though, are the roles of many species of mosquitoes as vectors of diseases. In passing from host to host, some transmit extremely harmful infections such as malaria, yellow fever, west Nile virus, dengue fever, filariasis, and other arboviruses, rendering it the deadliest animal family in the world"}]