[{"url": "http://www.answers.com/Q/What_is_the_difference_between_open_and_closed_primary_election", "passage_text": "An open primary is when a voter has to decide which party's primary they wish to participate in, meaning they can only choose candidates from that one particular party. The … blanket primary is when a voter does not have to choose which party they want and can vote for any candidates from both parties."}, {"url": "http://www.ncsl.org/research/elections-and-campaigns/primary-types.aspx", "passage_text": "State Primary Election Types. The manner in which party primary elections are conducted varies widely from state to state. Most primaries can be categorized as either open, closed or top-two. In other states, the primary type does not fall neatly into a category, but may represent a hybrid of these types."}, {"url": "http://www.ncsl.org/research/elections-and-campaigns/primary-types.aspx", "passage_text": "Hybrid. Many states use primary election systems that fall somewhere in between open and closed.. Procedures are unique from state to state, and how to categorize these primaries is a judgment call. Some states allow voters to cross party lines to vote."}, {"url": "http://www.mapsofworld.com/elections/usa/primaries-and-caucuses.html", "passage_text": "An open primary allows any registered voter to choose which primary to vote. Each voter is only allowed to cast one ballot in one primary. Each state determines whether its primary will be closed or open, or semi-closed. The names on the primary ballots also differ from state to state. Some states use the names of the candidates, while others have the names of delegates for the convention."}, {"url": "http://www.ehow.com/about_6460531_open-vs_-closed-primary-elections.html", "passage_text": "Save. joel-t/iStock/Getty Images. Before the public votes for candidates in a state or national election, there's often a primary election that determines which candidates will make it to the final round. State rules differ regarding who can vote in these primaries, which are classed as open, closed or hybrid."}]