[{"url": "https://www.linkedin.com/pulse/how-become-finance-director-stephen-tarrant-", "passage_text": "To celebrate the launch of our new Thames Valley office, Morgan McKinley are delighted to announce our latest Success Series event: How to Become a Finance Director, with: 1  Chris Ling, Finance Director-British Gas. 2  Carrie Hutchison, prev. 3  CFO-Notonthehighstreet.com. 4  Chris Filer, prev. "}, {"url": "http://study.com/articles/How_to_Become_a_Financial_Manager_Education_and_Career_Roadmap.html", "passage_text": "Learn how to become a financial manager. Research the education requirements, training information and experience required for starting a career in financial management. The minimum education requirement for financial managers is a bachelor's degree in finance, business administration or accounting. Other educational majors may be acceptable if they involve finance, business or"}, {"url": "http://www.buzzle.com/articles/how-to-become-a-finance-director.html", "passage_text": "Finance director is a senior level position in the company management and is considered as one of the most respectable jobs in the world of banking and finance. This article will try to explain how to become a finance director. Being the leading person in the department of finance, the finance director has to form teams, assign work and help in planning as and when they need. In short, the ultimate aim is to make sure that the firm achieves its financial goals or objectives in a planned way. High School Preparation."}, {"url": "http://www.totaljobs.com/careers-advice/job-profile/finance-jobs/finance-director-job-description", "passage_text": "Finance director job description. As finance director you're top of the tree when it comes to making financially related business decisions. In the finance industry, it's important everyone understands what the budgets are, how the company is performing and what needs to be achieved. "}, {"url": "http://www.academicinvest.com/business-careers/finance-careers/how-to-become-a-bank-manager", "passage_text": "Gain experience in branch operations and work your way up: If you want to become a bank manager by working your way up, you will typically need 5 years or more of experience in roles such as Loan Officer, Accountant, Auditor, Securities Sales Agent, or Financial Analyst. If you want to become a bank manager, you first need to determine if this career path is a good fit for your skills, interests and personality traits. If the following description sounds like you, then you’re probably well suited for a career as a bank manager: • You enjoy directing and supervising the work of others."}, {"url": "http://www.buzzle.com/articles/how-to-become-a-finance-director.html", "passage_text": "It would take around five years to become assistant finance controller. Enter the Senior Management. To become a finance director, you first need to enter the senior management of the company. This is possible after gaining around ten years of experience in the field of finance. Being the leading person in the department of finance, the finance director has to form teams, assign work and help in planning as and when they need. In short, the ultimate aim is to make sure that the firm achieves its financial goals or objectives in a planned way. High School Preparation."}, {"url": "http://smallbusiness.chron.com/successful-steps-becoming-successful-financial-manager-39165.html", "passage_text": "Becoming a financial manager is one of the most challenging career paths, due to the extremely specialized nature of the field. Aspiring managers start by earning bachelor's and master's degrees in their specialty. Competition for jobs is fierce, so graduates must take whatever related job they find. "}, {"url": "http://www.businessadministrationinformation.com/job-profiles/how-to-become-a-financial-manager", "passage_text": "Education Requirements for Financial Managers. The path to becoming a financial manager starts with a bachelor’s degree in a business field such as accounting, economics, business administration or finance. The bachelor’s degree is usually enough just to get you in the door. Financial managers oversee the money for a business, ensuring that a company is on sound financial footing while also making sure it complies with tax and business regulations. SHARE ON: Neil Johnson — November 15, 2012. Financial managers are responsible for all aspects of a company’s money."}, {"url": "https://autofinancemanagement.wordpress.com/2013/06/27/three-easy-steps-to-becoming-an-auto-finance-manager/", "passage_text": "Leave a reply. Discover how to become an auto finance manager.To commence you career and for you to be in the right direction in the field of automotive finance, you must first conduct an investigation on what are the required educational attainment, training information, and skills and knowledge involved. "}]