[{"url": "http://www.trucknews.com/features/air-weigh-offers-low-cost-on-board-truck-scale/", "passage_text": "LOUISVILLE, Ky. – Fleets and owner/operators looking to enjoy the benefits of on-board weigh scales but lacking the funds to invest in the technology now have a more affordable, entry-level solution courtesy of Air-Weigh."}, {"url": "http://www.weatherquestions.com/How_much_does_air_weigh.htm", "passage_text": "If we could remove 50% of the mass of the atmosphere, the global-average barometric pressure at the Earth's surface would also be reduced by 50%. Interesting facts: THATS HEAVY: The atmosphere of Venus is about 90 times heavier than that on Earth."}, {"url": "http://www.farmtronics.com/products.php?cat=184", "passage_text": "It converts pressure in the air springs into a very accurate on-the-ground weight. The heavier the load, the more air pressure is required to maintain ride-height. Once calibrated, the trailer scale displays the axle group weight to within 300 lbs of a certified scale."}, {"url": "http://www.trucknews.com/features/air-weigh-offers-low-cost-on-board-truck-scale/", "passage_text": "LOUISVILLE, Ky. - Fleets and owner/operators looking to enjoy the benefits of on-board weigh scales but lacking the funds to invest in the technology now have a more affordable, entry-level solution c..."}, {"url": "http://www.answers.com/Q/How_much_should_a_light_scaling_and_cleaning_cost", "passage_text": "You will need non-surgical periodontal therapy (Scaling and Root Planing) which is a lot more time consuming and therefore, a lot more expensive. The fee ranges from $100 to $300 per quadrant depending on the severity of disease and city/state. In our office we charge $160 - $260 per quadrant depending on severity."}, {"url": "http://www.howmuchisit.org/how-much-do-weights-cost/", "passage_text": "1 Adjustable dumbbells that can range anywhere from 5 to 90 pounds on average can cost anywhere from $130 to as much as $600. 2  Again, this is going to depend on the brand and other various factors. 3  Something as small as ankle weights can cost anywhere from $7 to $30 depending on the size of the weights."}, {"url": "http://onsitewb.com/", "passage_text": "On-Site Weight & Balance Inc. is your solution to cost effective aircraft weighing. We are an aircraft weighing service serving the state of Florida. For your quick quote call Sal Capra @ 863-206-3991."}, {"url": "http://www.weatherquestions.com/How_much_does_air_weigh.htm", "passage_text": "This is because the parcel of air is embedded in surrounding air that has the same density (mass per unit volume). But imagine that we remove that parcel of air from the atmosphere...the atmosphere would then weigh very slightly less."}, {"url": "http://www.answers.com/Q/How_much_does_one_liter_of_air_weigh", "passage_text": "The weight of 1 liter of air depends on the composition of the air, the temperature, the pressure, and the gravitational field it is subject to. As an example, let us assume air of composition:"}]