[{"url": "http://www.fluorideinfo.org/fluoride_waterFluoridation.html", "passage_text": "Fluoride is Cost Effective and Safe Fluoridation is not costly. Depending on a community size, the type of equipment used and labor costs, water fluoridation costs average from 20-50 cents per person per year. Over a lifetime, this is less than the cost of one dental filling to repair one decayed tooth. Remember, when it comes to the costs of treating dental disease, everyone pays."}, {"url": "http://www.waterloowatch.com/Index_files/Fluoridation%20Costs.pdf", "passage_text": "Costs of water fluoridation to municipalities. z Region states that fluoridation costs are 60 cents per person per year. z In 2004: “costs are about $3.00 per capita per annum” Chief Dental Officer for Health Canada, January 2004 z Due to shortage of fluoridation chemicals, their costs are rising. Costs to ordinary citizens who cannotconsume fluoridated public water, due to health concerns. 1. Purchasing water that is adequately filtered. 2. Purchasing expensive reverse osmosis or distillation equipment, [$2 - 4,000 plus $500/year for replacement filters]."}, {"url": "https://en.wikipedia.org/wiki/Water_fluoridation", "passage_text": "Water fluoridation prevents cavities in both children and adults, with studies estimating an 18–40% reduction in cavities when water fluoridation is used by children who already have access to toothpaste and other sources of fluoride. Studies on adverse effects have been mostly of low quality. Fluoride's effects depend on the total daily intake of fluoride from all sources. Drinking water is typically the largest source; other methods of fluoride therapy include fluoridation of toothpaste, salt, and milk."}, {"url": "http://www.health.ny.gov/prevention/dental/fluoridation/cost.htm", "passage_text": "1 It prevented as much tooth decay as a dental sealant program. 2  In contrast to the $23 per year cost of maintaining a child in a sealant program, the annual per capita cost (in 1981 dollars) of water fluoridation in five United States communities ranged from $0.06 in Denver, Colorado to $0.80 in rural West Virginia. 3  2. 1 5. 2  A study found that the annual savings associated with fluoridation in Colorado was $148.9 million (credible range, $115.1 million to $187.2 million) in 2003, or an average of $60.78 per person (credible range, $46.97 to $76.41). 6."}, {"url": "http://www.wellesleyinstitute.com/wp-content/uploads/2013/09/The-Real-Cost-of-Removing-Water-Fluoridation.pdf", "passage_text": "61 In Toronto, water fluoridation costs $0.77 annually per person, 62 while in Peterborough, costs are $0.38. 63 The lifetime cost of water fluoridation for one person is less than the cost of one dental filling. "}, {"url": "http://www.ada.org/~/media/ADA/Member%20Center/FIles/fluoridation_facts.ashx", "passage_text": "The average cost for a community to fluoridate its water is estimated to range from approximately $0.50 a year per person in large communities to approximately $3.00 a year per person in small communities. For most cities, every $1 invested in water fluoridation saves $38 in dental treatment costs. 355 “For most cities, every $1 invested in water fluoridation saves $38 in dental treatment costs.” It can be calculated from these data that the average lifetime cost per person to fluoridate a water system is less than the cost of one dental filling."}, {"url": "https://en.wikipedia.org/wiki/Water_fluoridation", "passage_text": "In the U.S., water fluoridation is more cost-effective than other methods to reduce tooth decay in children, and a 2008 review concluded that water fluoridation is the best tool for combating cavities in many countries, particularly among socially disadvantaged groups. Studies on adverse effects have been mostly of low quality. Fluoride's effects depend on the total daily intake of fluoride from all sources. Drinking water is typically the largest source; other methods of fluoride therapy include fluoridation of toothpaste, salt, and milk."}, {"url": "http://www.health.ny.gov/prevention/dental/fluoridation/cost.htm", "passage_text": "1 In contrast to the $23 per year cost of maintaining a child in a sealant program, the annual per capita cost (in 1981 dollars) of water fluoridation in five United States communities ranged from $0.06 in Denver, Colorado to $0.80 in rural West Virginia. 1 5. 2  A study found that the annual savings associated with fluoridation in Colorado was $148.9 million (credible range, $115.1 million to $187.2 million) in 2003, or an average of $60.78 per person (credible range, $46.97 to $76.41). 6."}, {"url": "http://www.health.ny.gov/prevention/dental/fluoridation/cost.htm", "passage_text": "1 Fluoride tablets and drops, rinses and toothpastes, are more expensive and less effective than the fluoridation of drinking water. 2  3. 3  Every dollar spent on fluoridation on average saves $38 in avoided dental bills. 4  Over a lifetime the cost of fluoridation is typically less than the cost of one dental filling. 1 5. 2  A study found that the annual savings associated with fluoridation in Colorado was $148.9 million (credible range, $115.1 million to $187.2 million) in 2003, or an average of $60.78 per person (credible range, $46.97 to $76.41). 6."}, {"url": "https://en.wikipedia.org/wiki/Water_fluoridation", "passage_text": "Water fluoridation is the controlled addition of fluoride to a public water supply to reduce tooth decay. Fluoridated water has fluoride at a level that is effective for preventing cavities; this can occur naturally or by adding fluoride. Studies on adverse effects have been mostly of low quality. Fluoride's effects depend on the total daily intake of fluoride from all sources. Drinking water is typically the largest source; other methods of fluoride therapy include fluoridation of toothpaste, salt, and milk."}]