[{"url": "http://peposevision.com/cornealtransplants/", "passage_text": "Corneal Transplants. T he cornea is the clear tissue covering the front of your eye. Like the crystal on your watch, your cornea serves as a protective window that allows light to enter your eye and come to focus on your retina. The cornea must remain clear for you to have good vision. "}, {"url": "http://www.masseyeandear.org/for-patients/patient-guide/patient-education/diseases-and-conditions/cornea/function", "passage_text": "Because the cornea is as smooth and clear as glass but is strong and durable, it helps the eye in two ways: It helps to shield the rest of the eye from germs, dust, and other harmful matter. The cornea shares this protective task with the eyelids, the eye socket, tears, and the sclera, or white part of the eye. The cornea acts as the eye's outermost lens. It functions like a window that controls and focuses the entry of light into the eye. When light strikes the cornea, it bends -- or refracts -- the incoming light onto the lens. The lens further refocuses that light onto the retina, a layer of light sensing cells lining the back of the eye that starts the translation of light into vision."}, {"url": "http://www.healthline.com/human-body-maps/cornea", "passage_text": "The cornea is the transparent part of the eye that covers the front portion of the eye. It covers the pupil (the opening at the center of the eye), iris (the colored part of the eye), and anterior chamber (the fluid-filled inside of the eye). The cornea's main function is to refract, or bend, light. "}, {"url": "https://nei.nih.gov/health/cornealdisease/", "passage_text": "Because the cornea is as smooth and clear as glass, but is strong and durable, it helps the eye in two ways: 1  It helps to shield the rest of the eye from germs, dust, and other harmful matter. 2  The cornea shares this protective task with the eyelids, the eye socket, tears, and the white part of the eye (sclera). 1 The cornea shares this protective task with the eyelids, the eye socket, tears, and the white part of the eye (sclera). 2  The cornea acts as the eye’s outermost lens. 3  It functions like a window that controls and focuses the entry of light into the eye."}, {"url": "https://answers.yahoo.com/question/index?qid=1006033103114", "passage_text": "· just now. Report Abuse. Together with the lens, the cornea refracts light and, as a result, helps the eye to focus. The cornea contributes more to the total refraction than the lens does, but, whereas the curvature of the lens can be adjusted to tune the focus, the curvature of the cornea is fixed. Source(s): www.wikipedia.com."}, {"url": "https://en.wikipedia.org/wiki/Cornea", "passage_text": "For other uses, see Cornea (disambiguation) . The cornea is the transparent front part of the eye that covers the iris, pupil, and anterior chamber. The cornea, with the anterior chamber and lens, refracts light, with the cornea accounting for approximately two-thirds of the eye's total optical power. In humans, the refractive power of the cornea is approximately 43 dioptres. While the cornea contributes most of the eye's focusing power, its focus is fixed."}, {"url": "http://familydoctor.org/familydoctor/en/prevention-wellness/staying-healthy/first-aid/corneal-abrasions.html", "passage_text": "A corneal abrasion is a cut or scratch on your cornea. The cornea is a clear layer of protective tissue at the front of your eye that lies over the iris (which is the colored part of your eye). The cornea helps focus light. "}, {"url": "http://www.webmd.com/eye-health/cornea-of-the-eye", "passage_text": "Cornea, Lens, and Iris. The iris is the colored part of the eye. A circular muscle in the iris controls the amount of light entering the eye through the pupil, the black area in the center of the iris. The cornea is the outer clear, round structure that covers the iris and the pupil. The cornea directs light rays into the eye and helps focus them on the light-sensitive retina at the back of the eye, providing sharp, clear vision. The lens is located behind the iris and is normally clear."}, {"url": "http://www.wisegeek.com/what-is-the-cornea.htm", "passage_text": "These 10 animal facts will amaze you. The cornea is the transparent portion of the eye which allows light to enter and performs two-thirds of the focusing tasks. This part also covers both the iris, the colored portion of the external eye, and the pupil, the reactive light meter in front of the lens. "}, {"url": "http://www.nkcf.org/how-the-human-eye-works/", "passage_text": "Light rays enter the eye through the cornea, the clear front “window” of the eye. The cornea’s refractive power bends the light rays in such a way that they pass freely through the pupil the opening in the center of the iris through which light enters the eye. "}]