[{"url": "http://www.healthcare-salaries.com/physicians/orthodontist-salary", "passage_text": "An average salary for an orthodontist based in Canada ranges from between 98,819 CAD – 599,522 CAD per annum while an average hourly wage ranges from between 56.46 CAD – 342.5 CAD per hour. A median salary for an orthodontist averages to about 171,292 CAD per annum while a median wage is about 97.8 CAD per hour. How much does an orthodontist earn in Mexico. Dentists in Mexico have an average pay of MXN149,400 per year, with a median pay of MXN178,800, according to PayScale. This is likely lower than what an orthodontist makes in the country because of their dental specialty."}, {"url": "http://work.chron.com/much-money-orthodontists-make-21906.html", "passage_text": "Factors. About 5,300 orthodontists worked in their own offices or the offices of other dentists to average $187,010 per year. Their highest pay was in the offices of physicians at a mean $200,010. However, this employer only offered 60 jobs. The profession ranked as sixth highest-paid in the country, making more than general dentists, who averaged $163,240. Orthodontists also averaged more than all dentists, at $166,910, and all physicians and surgeons, at $190,060."}, {"url": "http://www.healthcare-salaries.com/physicians/orthodontist-salary", "passage_text": "The median expected salary for an orthodontist in the United States is about $135,500 per annum while an average hourly wage is about $65.14 per hour. How much does an orthodontist earn in Mexico. Dentists in Mexico have an average pay of MXN149,400 per year, with a median pay of MXN178,800, according to PayScale. This is likely lower than what an orthodontist makes in the country because of their dental specialty."}, {"url": "http://www.mypursuit.com/careers-29-1023.00/Orthodontist.html", "passage_text": "The median salary for an Orthodontist in the United States is currently $140,850 annually. The middle 50 percent of American orthodontists made between $104,124 and $177,575 in the same year. These salary figures do not include bonuses and benefits such as social security, 401k, disability, healthcare and pension. "}, {"url": "http://work.chron.com/much-money-orthodontists-make-21906.html", "passage_text": "Illinois showed the most orthodontists among states, with 670 averaging $106,150 per year. California was next with 620 practitioners at a mean $165,960. At the top for pay was Wisconsin, Minnesota, Kansas, Colorado and Arizona, all with averages above $187,199. The profession ranked as sixth highest-paid in the country, making more than general dentists, who averaged $163,240. Orthodontists also averaged more than all dentists, at $166,910, and all physicians and surgeons, at $190,060."}, {"url": "http://www.healthcare-salaries.com/physicians/orthodontist-salary", "passage_text": "Orthodontist salary. Orthodontist’s salary according to the BLS in the United States is about $206,190 on an annual basis while a median hourly wage is about $99.13 per hour. The highest paid orthodontist receives an hourly wage of about $350 per hour which averages to more than $612,500 per year. How much does an orthodontist earn in Mexico. Dentists in Mexico have an average pay of MXN149,400 per year, with a median pay of MXN178,800, according to PayScale. This is likely lower than what an orthodontist makes in the country because of their dental specialty."}, {"url": "http://work.chron.com/much-money-orthodontists-make-21906.html", "passage_text": "The nation’s 5,530 orthodontists averaged $186,320 per year, as of May 2012, according to the U.S. Bureau of Labor Statistics (BLS). However, salaries fell to less than $67,530 for the lowest-earning 10 percent. The profession ranked as sixth highest-paid in the country, making more than general dentists, who averaged $163,240. Orthodontists also averaged more than all dentists, at $166,910, and all physicians and surgeons, at $190,060."}, {"url": "http://www.healthcare-salaries.com/physicians/orthodontist-salary", "passage_text": "In contrary, the lowest paid orthodontist receives an hourly wage of about $57.69 per hour which averages to about $100,958 per year. In addition, the overall mean salary for an orthodontist in the United States ranges from between $63,322 – $283,754 based on work experience. Read more about orthodontist salary. How much does an orthodontist earn in Mexico. Dentists in Mexico have an average pay of MXN149,400 per year, with a median pay of MXN178,800, according to PayScale. This is likely lower than what an orthodontist makes in the country because of their dental specialty."}, {"url": "http://woman.thenest.com/much-orthodontists-make-yearly-5102.html", "passage_text": "Orthodontists provide specialized dental care. You can earn some of the highest salaries working as an orthodontist in dentist offices. Orthodontists earned the mean annual wage of $207,350, according to May 2011 data from the Bureau of Labor Statistics, or BLS. Venture to the Atlanta metropolitan area if you want to earn some of the highest incomes as an orthodontist. Atlanta/Marietta, Georgia orthodontists earned $241,590 per year according to the BLS. You'd also do quite well in Anchorage, Alaska, at $230,810 annually."}]