[{"url": "https://www.dcccd.edu/CD/DCC/Health/HCRC/getstarted/FindOutMore/Pages/MathandScience.aspx", "passage_text": "It is important for you to earn good grades in all of the prerequisite courses, but it is especially important in math and science. Contact one of our advisors if you are having difficulty with math or if you need to take a refresher course."}, {"url": "http://www.universetoday.com/26939/why-is-science-important/", "passage_text": "Alom Shaha is a school teacher in the UK, and he has put together a website and a video, asking people to share why science is important. There are scientists, educators, psychologists, artists and many others from different walks of life who participated in this project."}, {"url": "http://www.schoolatoz.nsw.edu.au/en/homework-and-study/other-subjects-and-projects/science/why-science-is-important-in-young-kids-lives", "passage_text": "Parent and former high school science teacher Wendy Stacey says science is the perfect subject to complement a child's natural curiosity. It's practical and relevant and kids embrace it without thinking about it, she says."}, {"url": "http://www.seaes.manchester.ac.uk/study/undergraduate/undergraduate-courses/environmental-science-bsc/whystudyenvironmentalsciences/", "passage_text": "This is why the dedicated study of environmental science is so important. It is only by understanding how the world works that we can begin to tackle some of our pressing problems."}, {"url": "http://www.answers.com/Q/Why_should_you_study_science", "passage_text": "The study of science is essential. Let me give you some quick examples of why you must know science in everyday life: Here are some more specific reasons to study each type of science: BIOLOGY-this is the study of anything that is alive; there are many sub-categories like microbiology, botany, and zoology:"}, {"url": "http://microa13.imascientist.org.au/2013/08/29/why-is-science-a-realy-important-subject-in-school/", "passage_text": "Hey willynill101 That’s one of the best questions I’ve seen! Science is important in school for a lot of reasons, so here are a couple. – Science affects everyone in the world, every day. The fact that you can even type a question to us on a computer is owed to science."}, {"url": "http://www.answers.com/Q/Why_should_you_study_science", "passage_text": "1 Science is very important just like math. 2  Science is used everyday by people. 3  Science can be considered a series of trials and errors. 4  By our trials and errors we make new inventions."}, {"url": "http://www.answers.com/Q/Why_should_you_study_science", "passage_text": "1 Science is also important because without science our world would be a lot sadder. 2  Science is very important just like math. 3  Science is used everyday by people. 4  Science can be considered a series of trials and errors. 5  By our trials and errors we make new inventions."}, {"url": "http://www.answers.com/Q/Why_should_you_study_science", "passage_text": "1 ANYTHING you learn makes you smarter! 2  Science is the STUDY of the world around us-by learning science you learn HOW to study and learn (the scientific method, experimentation, research, etc)."}]