[{"url": "http://woman.thenest.com/much-weight-can-lose-walking-treadmill-45-minutes-day-13260.html", "passage_text": "Rate of Weight Loss. By estimating how many calories you burn during your 45-minute walks, you can then figure out how much weight you’ll lose. For example, the 150-pound woman walking at 3 mph for 45 minutes every day will burn 263 calories a day, which equates to 1,841 calories burned in a week. Because it will take more energy, a 200-pound woman will burn about 189 calories walking at 2 mph, 297 calories walking at 3 mph and 351 calories walking at 4 mph. Use a calorie calculator to figure out about how many calories you’ll burn."}, {"url": "http://healthyliving.azcentral.com/can-doing-30-minutes-treadmill-lose-weight-3774.html", "passage_text": "For example, a 160-pound person will burn 157 calories walking at a 3.5-mph pace for 30 minutes on a treadmill, while running at a 5-mph pace burns 303 calories for a person of the same weight exercising for the same duration, according to MayoClinic.com. To burn calories solely on your treadmill, you would have to run at an 8-mph pace seven days per week. However, if you combine treadmill exercise with efforts to cut calories on a daily basis, you can experience weight-loss results."}, {"url": "http://livehealthy.chron.com/lose-20-pounds-treadmill-walking-uphill-4854.html", "passage_text": "Since muscle burns more calories than fat, increasing your muscle will speed up weight loss. Walking on an incline also burns more calories compared to walking without an incline. In fact, at a pace of 3 mph, with a 5.0 incline, you will burn 64 percent more calories than you would without the incline. Lose 20 pounds on a treadmill walking uphill by sticking to a regular treadmill program"}, {"url": "http://livehealthy.chron.com/can-doing-30-minutes-treadmill-lose-weight-4798.html", "passage_text": "Walking on the treadmill at a leisurely pace of 3.5 mph a 125-pound person burns about 120 calories in 30 minutes. A heavier person will burn more calories however. For instance, a 185-pound person will burn 178 calories doing the same activity. Get Running. Running on the treadmill for 30 minutes at an easy pace of 5 mph, a 125-pound person will burn 240 calories while a 185-pound person will burn about 355 calories. A 240-calorie loss adds up to just over an ounce of weight lost. A 355-calorie burn adds up to about 1.6 ounces, or 1/10 of a pound"}, {"url": "https://answers.yahoo.com/question/index?qid=20080122073224AAJhKxy", "passage_text": "Report Abuse. When working on a treadmill, you can lose up to 500 calories an hour, if you do this for 5 days you can lose 1kg, if you go on the treadmll but eat alot you wont lose any weight, you have to burn more then you consume by eating healthy foods. Best of luck. Tania · 1 month ago. Thumbs up."}, {"url": "http://www.livestrong.com/article/306196-how-many-calories-are-burned-in-20-minutes-on-the-treadmill/", "passage_text": "The treadmill speed and your weight determines how many calories are consumed. According to the website Calories Per Hour, running for 20 minutes at 6 mph burns 229 calories, while running at 8 mph burns 299 calories. A 185 pound person burns more calories in a 20 minute session on the treadmill than a 125 pound person. In addition, the intensity of an exercise directly affects how many calories you burn; running at 8 mph burns more calories than walking at 3 mph."}, {"url": "http://livehealthy.chron.com/lose-20-pounds-treadmill-walking-uphill-4854.html", "passage_text": "For example, if you weigh 170 lbs. you will burn 462.4 calories per hour walking uphill. So, in 24 minutes, you will burn approximately 185 calories. Increase the amount of time you spend on the treadmill each day, or add additional workout days to burn more calories and lose weight faster. Walking on an incline also burns more calories compared to walking without an incline. In fact, at a pace of 3 mph, with a 5.0 incline, you will burn 64 percent more calories than you would without the incline."}, {"url": "http://livehealthy.chron.com/can-doing-30-minutes-treadmill-lose-weight-4798.html", "passage_text": "A 125-pound person will burn about 495 calories running on the treadmill for half an hour at a fast speed of 10 mph. This works out to weight loss of about 2.25 ounces. For a 185-pound person the calorie burn is about 733 calories. This adds up to a weight loss in the area of 3.4 ounces. Get Running. Running on the treadmill for 30 minutes at an easy pace of 5 mph, a 125-pound person will burn 240 calories while a 185-pound person will burn about 355 calories. A 240-calorie loss adds up to just over an ounce of weight lost. A 355-calorie burn adds up to about 1.6 ounces, or 1/10 of a pound"}, {"url": "http://livehealthy.chron.com/lose-20-pounds-treadmill-walking-uphill-4854.html", "passage_text": "Walk on the treadmill with an incline for 24 minutes at a pace of 3.5 to 5 mph. Start with an incline of 3.5 percent for the first five minutes. Every two minutes change the incline. Start with a 10 percent incline, followed by 6 percent, 10 percent, 7 percent, 12 percent, 10 percent and 12 percent, in that order. Walking on an incline also burns more calories compared to walking without an incline. In fact, at a pace of 3 mph, with a 5.0 incline, you will burn 64 percent more calories than you would without"}]