[{"url": "http://bio.rutgers.edu/~gb102/lab_2/309dm-arachnids.html", "passage_text": "SUBPHYLUM CHELICERATA, CLASS ARACHNIDA. Spiders. This group contains many familiar organisms, including the spiders, mites, scorpions and ticks. Examine the large spider on the right. Again, notice that there are two body regions, a cephalothorax and an abdomen. On the cephalothorax are two to four pairs of simple eyes."}, {"url": "http://insects.about.com/od/noninsectarthropods/p/arachnida.htm", "passage_text": "The class Arachnida includes a diverse group of arthropods: spiders, scorpions, ticks, mites, harvestmen, and their cousins. Scientists describe over 75,000 species of arachnids, the majority of them spiders. Most arachnids are carnivorous, typically preying on insects, and terrestrial, living on land."}, {"url": "http://eol.org/info/447", "passage_text": "Spiders belong to the phylum Arthropoda, along with insects and crustaceans. The order of spiders, Araneae—together with scorpions, harvestmen, and the large order of mites and ticks—make up the class of Arachnida. Spiders differ from other arachnids in having the body divided into cephalothorax and abdomen."}, {"url": "http://entomology.osu.edu/~bugdoc/Ent101/101Arthropods/Arthropods07.htm", "passage_text": "The class Araneae contains the spiders, a large and fascinating group. Spiders have the typical arachnid characteristics-eight legs, pedipalps, chelicerae and two major body regions. However, the chelicerae have lost the inside thumb and the outside hinged segment has become a fang."}, {"url": "http://www.answers.com/Q/What_is_the_class_of_a_spider", "passage_text": "Making the world better, one answer at a time. the class of a spider is arachnida. Spiders belong to the aracnid familly along with all the other types of spiders. Spiders are not insects. They are arachnids. So are scorpions, mite, ticks, harvestmen, and many others."}, {"url": "http://ednieuw.home.xs4all.nl/Spiders/InfoNed/The_spider.html", "passage_text": "Accordingly the spider is placed in phylum Arthropoda, class (classis) Arachnida, order (ordo) Araneae. This order is further divided into 3 sub-orders. The Mygalomorphae (the primitive spiders), the Aranaeomorphae (the modern spiders) and the Mesothelae, with one family of spiders the Liphistiidae."}]