[{"url": "http://smallbusiness.chron.com/advertising-sponsorship-17364.html", "passage_text": "Program Sponsorship. Advertising sponsorships includes several common types. Program sponsorship is when an advertiser sponsors a program as opposed to buying a few ad placements during the program. With a program sponsorship, the advertiser takes on a stronger partnership with the program and medium. Strong collaboration between advertiser and medium is a sign of a sponsorship. Comstock/Comstock/Getty Images. Advertising sponsorship is essentially the strongest relationship format between an advertiser and a medium or an event."}, {"url": "http://study.com/academy/lesson/what-is-sponsorship-advertising-definition-advantages-disadvantages.html", "passage_text": "Sponsorship advertising is a form of advertising where a company will sponsor some event or organization. Examples include the sponsorship of sporting events, charity events, and athletic teams. In fact, sponsorship advertising is very prevalent with charitable events. Besides from charitable events, companies may sponsor local sporting teams, sports tournaments, fairs, and other community events."}, {"url": "http://www.inc.com/encyclopedia/corporate-sponsorship.html", "passage_text": "Related Terms: Charitable Giving. Corporate sponsorship is a form of advertising in which companies pay to be associated with certain events. When the sponsorship of a nonprofit or charitable event is involved, the sponsorship activity is often referred to as event marketing or cause marketing. Corporate sponsorship has been growing rapidly in recent years, faster, in fact, than the growth in overall corporate advertising in the late 1990s. Even when there is a good fit between sponsor and event, it is still vital for a company to promote the event and its involvement in order to gain benefits. After all, sponsorship is a form of advertising, even when it is of a nonprofit venture or charitable event."}, {"url": "http://www.ehow.com/info_7756081_differences-between-advertising-sponsorships.html", "passage_text": "Sponsorship Basics. When advertising agencies and media refer to sponsors, they are typically talking about the company or organization that pays to buy media space. Thus, the general use of sponsorship is in reference to the paid sponsor of an advertising message delivery. Corporate or event sponsorship is a more specific form of advertising. US Legal actually uses the phrase a form of advertising in its definition of corporate sponsorship. Companies sometimes sponsor charitable events or community activities to build their image as a socially responsible company."}, {"url": "https://www.irs.gov/publications/p598/ch03.html", "passage_text": "For example, if a sponsorship payment entitles the sponsor to both product advertising and the use or acknowledgment of the sponsor's name or logo by the organization, then the unrelated business income tax does not apply to the part of the payment that is more than the fair market value of the product advertising. "}, {"url": "http://smallbusiness.chron.com/advertising-sponsorship-17364.html", "passage_text": "Event Sponsorship. Another common type of advertising sponsorship is event sponsorship. This is when an advertiser takes on a portion, or all, of the costs of an event in exchange for advertising spots and prominent mention as a sponsor. Strong collaboration between advertiser and medium is a sign of a sponsorship. Comstock/Comstock/Getty Images. Advertising sponsorship is essentially the strongest relationship format between an advertiser and a medium or an event."}, {"url": "http://smallbusiness.chron.com/advertisement-vs-sponsorship-17459.html", "passage_text": "A sponsorship is a relationship between a program or event host, and advertisers that support the program or event in exchange for an agreed-upon amount of exposure. As noted, the distinction between a simple advertiser-medium relationship and a sponsorship is sometimes just semantics. However, a sponsorship is typically a stronger and more ongoing commitment between the sponsor and the program or event provider. Sponsorship. Advertisements and sponsorships must both connect with your company's target market to have positive effects. flashfilm/Lifesize/Getty Images. An advertisement and a sponsorship are often discussed as the same thing. However, a sponsorship is typically regarded as a stronger and deeper relationship than a simple advertising exchange of value. An advertisement is a singular message placement while sponsorship is an ongoing arrangement"}, {"url": "http://study.com/academy/lesson/what-is-sponsorship-advertising-definition-advantages-disadvantages.html", "passage_text": "Sponsorship advertising is a type of advertising where a company pays to be associated with a specific event. In fact, sponsorship advertising is very prevalent with charitable events. Besides from charitable events, companies may sponsor local sporting teams, sports tournaments, fairs, and other community events. The idea is to get your name out and be viewed positively as a participating member of your community"}]