[{"url": "http://www.wisegeek.com/what-is-an-ocean-habitat.htm", "passage_text": "Ad. Demersal or benthic habitats are found on the bottom of the oceans. They are divided into the shallower coastal benthic and the deep ocean benthic habitats found beyond the continental shelf. Coral reefs are a benthic habitat in shallow, warm waters where an abundance of light penetrates. Here, no light penetrates and plants are not found. Organisms living in this ocean habitat are primarily detritus eaters, subsisting on the organic matter that floats to the bottom of the sea. Little studied due to the difficulties involved, this deep area is believed to be rich in biodiversity."}, {"url": "http://wwf.panda.org/about_our_earth/ecoregions/about/habitat_types/habitats/oceans/", "passage_text": "The floor of the ocean is called the benthic habitat while the water itself is called the pelagic habitat. Both support a diversity of animal life. Coral reefs, which grow in warm tropical and subtropical seas, are perhaps the richest marine habitat in terms of the diversity of life they shelter. Oceans of the world. "}, {"url": "https://en.wikipedia.org/wiki/Habitat", "passage_text": "A habitat is an ecological or environmental area that is inhabited by human, a particular species of animal, plant, or other type of organism. A place where a living thing lives is its habitat. It is a place where it can find food, shelter, protection and mates for reproduction. It is the natural environment in which an organism lives, or the physical environment that surrounds a species population. A habitat is not necessarily a geographic area—for a parasitic organism it is the body of its host, part of the host's body such as the digestive tract, or a cell within the host's body."}, {"url": "http://www.bbc.co.uk/nature/habitats", "passage_text": "Habitats. A habitat, or biome, is the type of environment in which plant and animals live. Habitat is dictated by what kinds of plants grow there, the climate and the geography. Rainforest, coral reefs and the tundra are all habitats where particular kinds of plants and animals might be found. Terrestrial habitats include forests, grasslands, deserts and rainforests."}, {"url": "http://marinelife.about.com/od/habitatprofiles/p/The-Ocean.htm", "passage_text": "1 Atlantic Ocean: The Atlantic Ocean is smaller and shallower than the Pacific Ocean, and is bounded by North and South America to the west, Europe and Africa to the east, the Arctic Ocean to the north and the Southern Ocean to the south. 2  Indian Ocean: The Indian Ocean is the third-largest ocean. "}, {"url": "http://alaska.usgs.gov/science/biology/seabirds_foragefish/marinehabitat/index.php", "passage_text": "Seabirds and fish are just two parts of the Alaskan marine ecosystem. Other living organisms, such as free floating, planktonic plants and animals, are part of the marine food web as well. The environment that the seabirds, fish, and other sea creatures live in is called their habitat. Think of habitat as a home and everything in it"}, {"url": "https://en.wikipedia.org/wiki/Marine_habitats", "passage_text": "The marine environment supplies many kinds of habitats that support marine life. Marine life depends in some way on the saltwater that is in the sea (the term marine comes from the Latin mare, meaning sea or ocean). A habitat is an ecological or environmental area inhabited by one or more living species. Marine habitats can be divided into coastal and open ocean habitats. Coastal habitats are found in the area that extends from as far as the tide comes in on the shoreline out to the edge of the continental shelf. Most marine life is found in coastal habitats, even though the shelf area occupies only seven percent of the total ocean area."}, {"url": "http://marinelife.about.com/od/habitatprofiles/tp/majormarinehabitats.htm", "passage_text": "• The Open Ocean (Pelagic Zone). The open ocean, or pelagic zone, is the area of the ocean outside of coastal areas, and where you’ll find some of the biggest marine life species. The pelagic zone is separated into several subzones depending on water depth, and each provide habitat for a variety of marine life. "}, {"url": "https://en.wikipedia.org/wiki/Habitat", "passage_text": "A habitat is made up of physical factors such as soil, moisture, range of temperature, and availability of light as well as biotic factors such as the availability of food and the presence of predators. A habitat is not necessarily a geographic area—for a parasitic organism it is the body of its host, part of the host's body such as the digestive tract, or a cell within the host's body."}]