[{"url": "http://www.babynamewizard.com/baby-name/girl/ethel", "passage_text": "Origin of the name Ethel: Originally a short form of any of the various Old English compound names containing the element aethel (noble), Ethel is now an independent name in its own right. From A World of Baby Names by Teresa Norman. Comments and insights on the name Ethel: | Edit. When I was a kid, gas stations sold REGULAR and HI-OCTANE ETHYL gasoline. Regular was cheaper but Ethyl was a better grade of gas. Whenever I hear the name Ethel I think of High-Octane Ethyl gasoline."}, {"url": "http://www.behindthename.com/name/ethel", "passage_text": "Short form of names beginning with the Old English element aeðel æðel meaning. Noble it was coined in the 19th, century when Many Old english names were. Revived it was popularized by the 'Novels The' (newcomes) 1855 By William Makepeace thackeray 'And The Daisy' (chain) 1856 By. C. M. yonge Short form of names beginning with the Old English element aeðel æðel meaning. Noble it was coined in the 19th, century when Many Old english names were. revived"}, {"url": "https://en.wikipedia.org/wiki/Ethel", "passage_text": "Ethel (also aethel) æthel is An Old english word meaning. Noble it is frequently attested as the first element In-Anglo saxon, names both masculine and, feminine.e. Æthelhard, Æthelred, Æthelwulf; Æthelburg, Æthelflæd, Æthelthryth (æthelwulf). aethelburg æthelburg aethelflaed æthelflæd aethelthryth æthelthryth audrey "}, {"url": "http://www.thinkbabynames.com/meaning/0/Ethel", "passage_text": "Ethel /eth-el/ [2 sylls.] as a girls' name is pronounced ETH-el. It is of Old English origin, and the meaning of Ethel is  noble . Short form of old names containing ethel like Etheldreda. First used as an independent name in the 1840s, and made somewhat popular then by a character named Ethel in Thackeray's novel The Newcomes (1855). Actresses Ethel Barrymore, Ethel Merman. "}, {"url": "http://www.babynology.com/meaning-ethel-f29.html", "passage_text": "More About Hebrew Name: Ethel. Originally a short form of any of the various Old English compound names containing the element Aethel (noble). Ethel is now an independent name in its own right. First used as an independent name in the 1840s. It was coined in the 19th century, when many Old English names were revived"}, {"url": "http://www.sheknows.com/baby-names/name/ethel", "passage_text": "The name Ethel is a German baby name. In German the meaning of the name Ethel is: noble. Hebrew Meaning: The name Ethel is a Hebrew baby name. In Hebrew the meaning of the name Ethel is: noble. Teutonic Meaning: The name Ethel is a Teutonic baby name. In Teutonic the meaning of the name Ethel is: noble. The name Ethel is an English baby name. In English the meaning of the name Ethel is: From Aethelind, the Old English name meaning noble snake. Diminutive of Etheldreda, from the Old English name Aethelthryth, meaning noble and strength. Diminutive of Eldreda from Alfred, meaning old counsel, or sage."}, {"url": "http://www.sheknows.com/baby-names/name/ethel", "passage_text": "English Meaning: The name Ethel is an English baby name. In English the meaning of the name Ethel is: From Aethelind, the Old English name meaning noble snake. Diminutive of Etheldreda, from the Old English name Aethelthryth, meaning noble and strength. Diminutive of Eldreda from Alfred, meaning old counsel, or sage."}, {"url": "http://www.names.org/n/ethel/about", "passage_text": "The name Ethel is of English origin, and it means Noble . It's a name commonly given to girls. "}, {"url": "http://www.babynamespedia.com/meaning/Ethel/f", "passage_text": "[ 2 syll. et-hel, eth-el ] The baby girl name Ethel is also used as a boy name, though it is far more popular for girls. It is pronounced EH-TH-ahL †. Ethel's origin is Old English, and its use, English. Older forms of the name include Aethel (Old English) and Athala (Germanic). "}]