[{"url": "http://www.answers.com/Q/How_long_will_employer_pay_for_your_medical_insurance_after_termination", "passage_text": "If it is just a normal involuntary termination (and the group … has at least 20 employees), such as cutbacks or being laid off then they have to offer you Cobra. Cobra allows you to continue on your current health plan for a period of 18 months with you paying up to 102% of the premium. Unless you have some contractual agreement requiring them to do so, an employer is not obligated to pay for any of your insurance after termination. You will have the right to continue coverage under HIPAA at your expense however."}, {"url": "http://employment.findlaw.com/losing-a-job/employee-rights-after-a-job-termination.html", "passage_text": "Terminated employees have the right to health insurance coverage after separation from their employer. The Consolidated Omnibus Budget Reconciliation Act (COBRA) of 1986, grants terminated employees and their families the right to continued healthcare coverage for a limited period. Other states have stricter laws; for example, in California, the law requires the employer to pay the employee immediately if the employee was fired or if the employee quit after giving at least 72 hours notice. If the employee failed to give notice, the employer has 72 hours to issue a final paycheck."}, {"url": "http://employment.findlaw.com/losing-a-job/employee-rights-after-a-job-termination.html", "passage_text": "An employee has the right to receive a final paycheck, the option of continuing health insurance coverage, and may be eligible for severance pay and unemployment compensation benefits. For a handy overview of key things to condider after losing a job, download FindLaw's Guide to Job Loss [pdf]. Other states have stricter laws; for example, in California, the law requires the employer to pay the employee immediately if the employee was fired or if the employee quit after giving at least 72 hours notice. If the employee failed to give notice, the employer has 72 hours to issue a final paycheck."}, {"url": "https://usinsuranceagents.com/insurance-after-getting-laid-off-vs-quiting-vs-getting-fired", "passage_text": "Health insurance is sometimes protected temporarily by COBRA insurance, depending on whether you were laid off, quit your job, or were terminated by the company. Under all 3, your coverage is probably going to cost you more, so it will be in your best interest to find another group plan as quickly as possible. Here is a clear explanation of what the different types of job termination mean to your health insurance. If you say, I quit! then you have voluntarily terminated yourself. Job benefits can be terminated as early as the next billing cycle or paycheck. By quitting your job, you have given up the right to use COBRA extensions for your insurance coverage and can be terminated from the health plan."}, {"url": "http://www.nolo.com/legal-encyclopedia/free-books/employee-rights-book/chapter3-6.html", "passage_text": "Time employer has to notify employee of continuation rights: 10 days after termination of coverage. Time employee has to apply: 10 days after termination of coverage or receiving notice from employer, whichever is later, but no more than 31 days from termination of coverage. Time employer has to notify employee of continuation rights: 10 days. Time employee has to apply: 30 days after termination or reduction in hours or receiving notice from employer, whichever is later, but not more than 60 days from termination or reduction in hours."}, {"url": "http://www.nolo.com/legal-encyclopedia/free-books/employee-rights-book/chapter3-6.html", "passage_text": "Length of coverage for dependents: 18 months; 29 months if disabled at termination or during first 60 days of continuation coverage; 36 months upon death of employee, divorce or legal separation, loss of dependent status, or employee’s eligibility for Medicare. Time employer has to notify employee of continuation rights: 10 days. Time employee has to apply: 30 days after termination or reduction in hours or receiving notice from employer, whichever is later, but not more than 60 days from termination or reduction in hours."}, {"url": "http://thelawdictionary.org/article/how-long-after-leaving-a-job-does-your-health-insurance-become-void/", "passage_text": "Once you quit your job, you'll probably have health insurance coverage until the end of the month in which your last day of employment falls. Fortunately, you have several options to ensure that you remain eligible for ongoing coverage. The most common of these is COBRA coverage. Enacted in 1986, COBRA is a complex law that requires employers to make group health insurance benefits available to all laid-off or voluntarily-terminated employees for at least 18 months from their termination date. Once you leave your job, you can wait up to 60 days before electing to receive COBRA benefits. "}, {"url": "https://usinsuranceagents.com/insurance-after-getting-laid-off-vs-quiting-vs-getting-fired", "passage_text": "Voluntary Termination. If you say, I quit! then you have voluntarily terminated yourself. Job benefits can be terminated as early as the next billing cycle or paycheck. By quitting your job, you have given up the right to use COBRA extensions for your insurance coverage and can be terminated from the health plan. How long your benefits will be available will depend on the processing of your cancell"}, {"url": "http://employment.findlaw.com/losing-a-job/employee-rights-after-a-job-termination.html", "passage_text": "Under the law, an employer with 20 or more employees must offer the option of continued participation in the employer's health insurance plan. It is the responsibility of the former employee to pay the full cost of coverage. In general, the employee will pay up to 102 percent of the plan's cost. Other states have stricter laws; for example, in California, the law requires the employer to pay the employee immediately if the employee was fired or if the employee quit after giving at least 72 hours notice. If the employee failed to give notice, the employer has 72 hours to issue a final paycheck."}, {"url": "http://employment.findlaw.com/losing-a-job/employee-rights-after-a-job-termination.html", "passage_text": "At-will employment refers to the rights of an employer in the private industry to terminate an employee at any time and for any reason, as long as it is not illegal or contrary to an agreement. Termination, however, may be unlawful if: 1  An implied contract governs the terms of the employment relationship. Other states have stricter laws; for example, in California, the law requires the employer to pay the employee immediately if the employee was fired or if the employee quit after giving at least 72 hours notice. If the employee failed to give notice, the employer has 72 hours to issue a final paycheck."}]