[{"url": "http://oceanservice.noaa.gov/facts/hawaii.html", "passage_text": "In areas where the plates come together, sometimes volcanoes will form. Volcanoes can also form in the middle of a plate, where magma rises upward until it erupts on the sea floor, at what is called a “hot spot.”. The Hawaiian Islands were formed by such a hot spot occurring in the middle of the Pacific Plate. While the hot spot itself is fixed, the plate is moving. So, as the plate moved over the hot spot, the string of islands that make up the Hawaiian Island chain were formed. The Hawaiian Islands form an archipelago that extends over a vast area of the North Pacific Ocean"}, {"url": "http://www.windows2universe.org/earth/interior/island_formation.html", "passage_text": "Island Arcs are formed on the opposing edge of a subducted slab. For each case, there is an associated subducting slab and a trench. The trenches for these island arcs can barely be made out in this map. 2.) The second way in which islands are formed is via plumes or hot spots in the lithosphere. The Hawaiian Islands are an example of this type of island formation. In this case, there is no associated subducting slab. "}, {"url": "http://www.utdallas.edu/~pujana/oceans/island.html", "passage_text": "Most of the world’s active volcanoes are in this belt. CROSS-SECTION. Not all volcanic chains are island arcs, however, and not all island arcs are “islands”. For example, the Hawaiian Islands are an example of a linear chain of volcanoes in the middle of the Pacific Ocean that is not an island arc. As the name implies, island arcs are typically a curving chain of volcanic islands occurring around the margin of ocean basins. The curvature and the volcanic nature are important characteristic features."}, {"url": "http://www.utdallas.edu/~pujana/oceans/island.html", "passage_text": "Island arcs and trenches are major structural features, together with oceanic ridges, of ocean basins. As the name implies, island arcs are typically a curving chain of volcanic islands occurring around the margin of ocean basins. The curvature and the volcanic nature are important characteristic features."}, {"url": "http://oceanservice.noaa.gov/facts/hawaii.html", "passage_text": "The Hawaiian Islands were formed by volcanic activity. The Hawaiian Emperor seamount chain is a well-known example of a large seamount and island chain created by hot-spot volcanism. Each island or submerged seamount in the chain is successively older toward the northwest. Volcanoes can also form in the middle of a plate, where magma rises upward until it erupts on the sea floor, at what is called a “hot spot.”. The Hawaiian Islands were formed by such a hot spot occurring in the middle of the Pacific Plate. While the hot spot itself is fixed, the plate is moving."}, {"url": "http://www.geolsoc.org.uk/Plate-Tectonics/Chap3-Plate-Margins/Mid-plate/Hawaiian-Islands", "passage_text": "Hawaiian Islands. Whilst most volcanic activity happens at plate margins, there are cases of volcanoes erupting in the middle of plates. The Hawaiian Islands are formed by volcanic activity, despite the nearest plate margin being 3,200 km away. Some geologists have suggested that a ' hot spot ' in the mantle, which remains stationary as the Pacific Plate moves over it, explains the existence of the island chain. "}, {"url": "https://en.wikipedia.org/wiki/Volcano", "passage_text": "A volcano is a rupture on the crust of a planetary-mass object, such as Earth, that allows hot lava, volcanic ash, and gases to escape from a magma chamber below the surface. Earth's volcanoes occur because its crust is broken into 17 major, rigid tectonic plates that float on a hotter, softer layer in its mantle. They are the most dangerous type of volcano. Examples include: Yellowstone Caldera in Yellowstone National Park and Valles Caldera in New Mexico (both western United States); Lake Taupo in New Zealand; Lake Toba in Sumatra, Indonesia; and Ngorongoro Crater in Tanzania."}, {"url": "http://www.bbc.co.uk/science/earth/surface_and_interior/hotspot", "passage_text": "Most volcanoes occur near the Earth's plate boundaries, but some do not. For example, the Hawaiian islands have been formed over millions of years by volcanic eruptions thousands of miles from the edges of the Pacific plate. Island formation is still happening on Hawaii every time the shield volcanoes Kilauea and Mauna Loa erupt. "}, {"url": "http://www.soest.hawaii.edu/GG/HCV/haw_formation.html", "passage_text": "[ HCV Home ] [Formation of the Islands] [ Active Hawaiian Volcanoes ] [ General Info ]. Follow site author @kenrubin on Twitter. The Hawaiian Islands are volcanic in origin. Each island is made up of at least one primary volcano, although many islands are composites of more than one. The Big Island, for instance, is constructed of 5 major volcanoes: Kilauea, Mauna Loa, Mauna Kea, Hualalai and Kohala. These other types of volcanoes (common outside of Hawaii) are typically steeper sided. The Hawaiian volcanoes were produced by the Hawaiian hot spot, which is presently under the Big Island of Hawaii. The image below shows the islands of the Hawaiian chain and the intervening shallows, banks and reefs along a line from southeast to northwest"}]