[{"url": "http://redandthepeanut.blogspot.com/2009/04/turkey-vultures-raising-their-wings-in.html", "passage_text": "Turkey vultures eat mostly carrion and therefore do Mother Nature a great service. Their feet and beaks are weak, and they can't carry food like a raptor or kill like one. Their cousins, the Black Vulture have stronger beaks, and sometimes kill food. Turkey Vultures never circle a dying animal. The sun's ultraviolet rays effectively kill the bacteria on the wings. Turkey vultures can eat decaying and contaminated meat because of enzymes and bacteria in their digestive systems. As a means of defense, Turkey Vultures will projectile vomit just like Great Blue Herons."}, {"url": "http://www.kern.audubon.org/tvfacts.htm", "passage_text": "Like all other vultures, the turkey vulture has a bald head. This is so that bits of carrion (dead meat) do not adhere to the skin as they would to feathers. The Turkey Vulture, with its bald red head and dark feathers, was given its common name due to its superficial resemblance to the Wild Turkey. TURKEY VULTURE FESTIVAL. The turkey vulture has many unique and interesting qualities that make this species one of the most fascinating birds in North America. Listed below are some of the reasons why turkey vultures are a favorite bird species of so many people! TURKEY VULTURE tidbits. . . . ."}, {"url": "http://pestproducts.com/turkey-vulture.htm", "passage_text": "The turkey vulture is a gentle and non aggressive bird that is often seen standing with its wings spread in a horaltic pose usually drying its wings, warming its body or baking off bacteria. "}, {"url": "http://www.birdinginformation.com/birds/vultures-and-condors/turkey-vulture/", "passage_text": "Early in the morning, you might see a Turkey Vulture with its wings spread out catching some sunshine. This is the way the vulture warms itself up after a cold night, as it patiently waits for the thermals to warm up. The Turkey Vulture is dark brown. It is named for its bare red head and neck which looks a lot like a turkey’s head. In comparison to its body, it has a small head with a white hooked bill. There isn’t a dividing nasal septum on the bill so you can see through the bill from one side to the other."}, {"url": "http://wildlifecenter.org/vulture-facts", "passage_text": "1 Black and Turkey Vultures are scavengers and feed primarily on carrion. 2  Vultures are part of nature’s clean-up crew. 3  They rid the landscape of deteriorating carcasses and help curb the spread of dangerous diseases and bacteria. 1 They rid the landscape of deteriorating carcasses and help curb the spread of dangerous diseases and bacteria. 2  Their stomachs have strong enzymes that kill off dangerous toxins and microorganisms. 3  Vultures lack the powerful feet that are characteristic of other raptors like eagles and hawks."}, {"url": "http://www.askthebirds.org/2010/10/sun-dried-vulture.html", "passage_text": "Turkey Vulture. One morning last week I observed this Turkey Vulture perched in the sun with its wings spread. Several species of birds engage in wing-drying as the Turkey Vulture is doing in this photo. Cormorants, Anhingas, storks, pelicans and vultures all exhibit this trait. Birds spread their wings like this for two main reasons. The first reason is to dry their wet feathers. There was a heavy dew that morning, and I suspect this vulture may have become covered in dew while roosting in that tree overnight. Second, they spread their wings in the sun for purposes of thermoregulation. That is, they can increase their internal body temperature by standing with their backs to the sun and spreading their wings. So, this wing-spread vulture was merely warming up and drying off in preparation for his day"}, {"url": "http://wildlifecenter.org/vulture-facts", "passage_text": "1 When trying to identify a Black Vulture from a Turkey Vulture while on the wing (in flight), one may do so by looking at the underside of the bird’s wings. 2  A Turkey Vulture’s wings will be largely silvery-white underneath, while the Black Vulture only has small patches of white at the tip. 1 They rid the landscape of deteriorating carcasses and help curb the spread of dangerous diseases and bacteria. 2  Their stomachs have strong enzymes that kill off dangerous toxins and microorganisms. 3  Vultures lack the powerful feet that are characteristic of other raptors like eagles and hawks."}, {"url": "http://wildlifecenter.org/vulture-facts", "passage_text": "1 Mature Turkey Vultures have dark plumage and featherless red heads; the undersides of the flight feathers are paler. 2  An immature Turkey Vulture’s head is dark gray. 3  When trying to identify a Black Vulture from a Turkey Vulture while on the wing (in flight), one may do so by looking at the underside of the bird’s wings. 1 They rid the landscape of deteriorating carcasses and help curb the spread of dangerous diseases and bacteria. 2  Their stomachs have strong enzymes that kill off dangerous toxins and microorganisms. 3  Vultures lack the powerful feet that are characteristic of other raptors like eagles and hawks."}, {"url": "https://answers.yahoo.com/question/index?qid=20080706120856AAVjy7b", "passage_text": "Best Answer: Vultures will often sit on a perch in the sun with their wings spread out. It might be to warm their wings or dry their feathers. I am not sure of the exact reason. I've often seen them doing this on cold mornings. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071123084019AApOUnj", "passage_text": "Rating Newest Oldest. Best Answer: This vulture is often seen standing in a spread-winged stance. The stance is believed to serve multiple functions: drying the wings, warming the body, and baking off bacteria. It is practiced more often following damp or rainy nights. There could various reasons they had their wings spread out. They sometimes do this when they are sun bathing. it seems to be relaxing for them as well as other animals. Source(s): I've seen turkey vultures in different places I've lived in."}]