[{"url": "http://www.weedemandreap.com/cost-of-running-small-farm/", "passage_text": "The average cost for my small farm – goats and chickens – is around $1400 a year. That is for seven dwarf/pygmy breed goats of different needs and 13 laying chickens. You can run a farm, too! If money is holding you back, don’t let it! Raising your own animals and obtaining your own food is one of the most rewarding things in the world. Yesterday I made fresh mozzarella, and ate it with fresh basil and tomatoes from the garden."}, {"url": "http://www.wikihow.com/Start-a-Cattle-Farm", "passage_text": "Determine the type of breeds you want according to your goals for your farm or ranch are, not what you like and what you are willing to do to work around the fall-backs of a particular breed. 1  If you are into beef production start with a breed that is known for good temperament and is not labour intensive. 1 Plan what kind of cattle you are looking for without looking at ANY breeds, what kind of farm or ranch you want and how you want to operate it, and write about your strengths, weaknesses, opportunities and threats, from what you are capable of doing to the cattle industry as a whole."}, {"url": "http://www.weedemandreap.com/cost-of-running-small-farm/", "passage_text": "1 Through a trade we received 2 baby doelings, we sold them for $300 together. 2  Our goat, Lacey, had 4 babies, and we sold all of them, the total being $675. 3  We sold one of our adult does, Polly, for $250. 4  We sold a horned goat (that ended up being a bad purchase on our part) for $50. You can run a farm, too! If money is holding you back, don’t let it! Raising your own animals and obtaining your own food is one of the most rewarding things in the world. Yesterday I made fresh mozzarella, and ate it with fresh basil and tomatoes from the garden."}, {"url": "http://homesweetfarm.blogspot.com/2008/07/how-to-start-sustainable-small-farm.html", "passage_text": "In order for a small farm to be profitable, you need to plan on being the farmer. If you have 2 acres available, you could sustainably operate a 50 member CSA (more or less after a few years). HOW TO START A SUSTAINABLE SMALL FARM. I have heard from a lot of folks wanting to start their own small farm, and I wanted to share some of this info that others might use as well… Here it goes."}, {"url": "http://www.professionz.com/usa/md/farm-business-plan.html", "passage_text": "7 thoughts on “ Farm Business Plan: How to Start Small Farm: Cost and Grants for Farming ”. Hello, I am in Fort Monroe city. I would like to start a retail store for Kids clothing looking at the 1 to 12 age group at the moment. Starting a farm may sound easy. All a person needs would be land, seeds, and the skills to plant them well enough to grow. The problem comes when there is no land, no money for seeds, and no background on farming. Starting a farm without much experience and little or no land at all can be perplexing."}, {"url": "http://www.wikihow.com/Calculate-the-Cost-of-Starting-a-Dairy-Farm", "passage_text": "1 Before you begin to calculate the cost of starting a dairy farm, you need to decide whether or not you will house a bull on site. 2  Bulls are known to be aggressive and, in some cases, dangerous. 3  But the cows will have to be bred regularly to continue providing milk. Tips. 1  Consider costs for hired labour on your farm. 2  Before you begin to calculate the cost of starting a dairy farm, you need to decide whether or not you will house a bull on site. 3  If you don't wish to keep a bull, consider using Artificial Insemination (AI) to keep your cows bred regularly."}, {"url": "http://permaculturenews.org/2013/11/01/start-growing-part-1-buy-farm-debt-free/", "passage_text": "Own your farm without the burden of debt. Lets look at three would-be farmers with $10,000 in savings who want to start a farm. Meet Robert. He gets a loan of $90,000 to buy a piece of land and a small herd of cattle. He should have done more research because unexpected costs such as fencing and equipment maintenance have caught him off-guard. "}, {"url": "http://www.professionz.com/usa/md/farm-business-plan.html", "passage_text": "1 Starting out with a small farm is a better investment. 2  This allows the person to acquire and save the money for expanding into a larger farm business. 3  With a small farm, a family can start planting crops in season to sell when they have grown. Starting a farm may sound easy. All a person needs would be land, seeds, and the skills to plant them well enough to grow. The problem comes when there is no land, no money for seeds, and no background on farming. Starting a farm without much experience and little or no land at all can be perplexing."}, {"url": "http://www.beginningfarmers.org/planning-a-new-farm/", "passage_text": "The Question: Lots of people write us at beginningfarmers.org excited to start a farm, asking for advice. We wish we could reply and say: “no problem, just do these things and you should be on your way.” Unfortunately, it’s not that simple! So, we’ve compiled this resource to help you make your own informed decisions. "}, {"url": "http://www.wikihow.com/Start-a-Cattle-Farm", "passage_text": "Do a SWOT analysis of yourself and the cattle industry you will be entering. Plan what kind of cows you want without looking at any breeds, and what kind of farm you wish to operate. 1  Keep in mind to start small. 1 Plan what kind of cattle you are looking for without looking at ANY breeds, what kind of farm or ranch you want and how you want to operate it, and write about your strengths, weaknesses, opportunities and threats, from what you are capable of doing to the cattle industry as a whole."}]