[{"url": "http://ephedrinewheretobuy.com/what-is-ephedrine", "passage_text": "Given the common confusion between the various types of ephedrine, it is important to have a clear understanding of what it is exactly. Ephedra sinica known in Chinese as Ma Huang. This herb has been used in the traditional Chinese medicine for more than 5,000 years for the treatment of hay fever and asthma. This plant contains also pseudoephedrine, a natural substance which we will detail later. Ephedrine HCL (for hydrochloride) is the synthetic form of the natural ephedrine present in ephedra’s leaves, it is produced by pharmaceutical companies. That was it for the basic knowledge, now if you want to know more about the effectiveness of ephedrine in weight loss, don’t miss this page."}, {"url": "https://en.wikipedia.org/wiki/Ephedrine", "passage_text": "Ephedrine (/ɨˈfɛdrɪn/ or /ˈɛfɨdriːn/) is a sympathomimetic amine and substituted amphetamine commonly used as a stimulant, concentration aid, decongestant, appetite suppressant, and to treat hypotension associated with anaesthesia. Chemically, it is an alkaloid with a phenethylamine skeleton found in various plants in the genus Ephedra (family Ephedraceae). It works mainly by increasing the activity of norepinephrine (noradrenaline) on adrenergic receptors. It is most usually marketed as the hydrochloride or sulfate salt."}, {"url": "https://en.wikipedia.org/wiki/Ephedra", "passage_text": "A wide variety of alkaloid and non-alkaloid compounds have been identified in various species of ephedra. Of the six ephedrine-type ingredients found in ephedra (at concentrations of 0.02-3.4%), the most common are ephedrine and pseudoephedrine. This article is about the use of the plant species containing ephedrine in supplements in the United States. For botanical information, see Ephedra (genus) . For the chemical ephedrine, see ephedrine."}, {"url": "https://en.wikipedia.org/wiki/Ephedra", "passage_text": "Several additional species belonging to the genus ephedra have traditionally been used for a variety of medicinal purposes, and are a possible candidate for the Soma plant of Indo-Iranian religion. This article is about the use of the plant species containing ephedrine in supplements in the United States. For botanical information, see Ephedra (genus) . For the chemical ephedrine, see ephedrine."}, {"url": "https://en.wikipedia.org/wiki/Ephedrine", "passage_text": "Ephedrine is similar in molecular structure to the well-known drugs phenylpropanolamine and methamphetamine, as well as to the important neurotransmitter epinephrine (adrenaline). Chemically, it is an alkaloid with a phenethylamine skeleton found in various plants in the genus Ephedra (family Ephedraceae). It works mainly by increasing the activity of norepinephrine (noradrenaline) on adrenergic receptors. It is most usually marketed as the hydrochloride or sulfate salt. The herb Ephedra sinica, used in traditional Chinese medicine, contains ephedrine and pseudoephedrine as its principal active constituents. The same may be true of other herbal products containing extracts from other Ephedra species"}, {"url": "http://www.rand.org/pubs/research_briefs/RB4556/index1.html", "passage_text": "Ephedra and ephedrine promote modest shortterm weight loss; their long-term effect is unknown. Ephedrine plus caffeine boosts immediate physical performance for fit young men; there is no evidence that ephedra or ephedrine improves long-term physical performance of athletes or would work for the general public. Ephedra and ephedrine increase the risk of nausea, vomiting, jitteriness, and palpitations."}, {"url": "http://www.oasas.ny.gov/AdMed/drugs/ephedra.cfm", "passage_text": "Ephedrine is metabolized into norephedrine. Also called phenylpropanolamine or PPA, norephedrine has been banned as an over-the-counter substance. Ephedrine, similar in structure to amphetamines, can cause a false positive urine drug screen for amphetamines. In fact, Ephedrine is used sometimes by “clubbers” in place of Ecstasy. Ephedra comes from the Ephedraceae family of plants. It has several scientific names, such as Ephedra major (America), Ephedra trifurca (America) and Ephedra sinica (this is Asian and called Chinese Ma Huang)."}, {"url": "https://en.wikipedia.org/wiki/Ephedra", "passage_text": "In response to accumulating evidence of adverse effects and deaths related to ephedra, the U.S. Food and Drug Administration (FDA) banned the sale of supplements containing ephedrine alkaloids in 2004. This article is about the use of the plant species containing ephedrine in supplements in the United States. For botanical information, see Ephedra (genus) . For the chemical ephedrine, see ephedrine."}, {"url": "http://ephedrinewheretobuy.com/what-is-ephedrine", "passage_text": "Ephedrine is a natural substance contained in some herbs: Ephedra sinica known in Chinese as Ma Huang. This herb has been used in the traditional Chinese medicine for more than 5,000 years for the treatment of hay fever and asthma. This plant contains also pseudoephedrine, a natural substance which we will detail later. Ephedrine HCL (for hydrochloride) is the synthetic form of the natural ephedrine present in ephedra’s leaves, it is produced by pharmaceutical companies. That was it for the basic knowledge, now if you want to know more about the effectiveness of ephedrine in weight loss, don’t miss this page."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/22945558", "passage_text": "Separation mechanism of chiral impurities, ephedrine and pseudoephedrine, found in amphetamine-type substances using achiral modifiers in the gas phase. Holness HK, Jamal A, Mebel A, Almirall JR. "}]