[{"url": "http://www.sciencebuddies.org/science-engineering-careers/engineering/automotive-engineer", "passage_text": "Education and Training. The minimum degree required for an entry-level position as an automotive engineer is a bachelor's degree in mechanical engineering or related engineering field. However, due to the complexity of the various electrical systems of cars, many employers prefer applicants with a master's degree. The average workweek for an automotive engineer is between 40 and 55 hours, but it can be longer as deadlines approach. Automotive engineers generally work in offices on computers, but they also travel to manufacturing plants to conduct experiments or collect data."}, {"url": "http://learn.org/articles/What_is_the_Yearly_Salary_of_an_Automotive_Engineer.html", "passage_text": "A survey of automotive engineers conducted for SAE International (www.sae.org) reported that in 2012 the average annual salary for these professionals was $103,400. On the other hand, PayScale.com reported that most automotive engineers made $41,046-$109,134 as of May 2014, with the median salary being $69,088. Salaries are also dependent on the engineer's location and experience, as well as the automotive industry sector."}, {"url": "http://www.payscale.com/research/US/Job=Automotive_Engineer/Salary", "passage_text": "An automotive engineer creates and improves mechanisms and designs within the automotive field. The automotive engineer may work for an original equipment manufacturer or for a company that manufactures cars. Much of the work is done on a computer with CAD software, so proficiency with design software is necessary. "}, {"url": "http://whatisengineering.com/what-is-automotive-engineering/", "passage_text": "Automotive engineers may work in the research field or be directly involved in the manufacturing process of a vehicle. An automotive engineer is able to design components, manage the vehicle production process or be involved in testing procedures. Engineers with advanced driving skills are used to test drive vehicles for research and development purposes and to ensure the vehicle functions as it should."}, {"url": "http://educatingengineers.com/degrees/automotive-engineering", "passage_text": "Automotive engineering is a branch of mechanical engineering that concerns the design, development and manufacture of cars, trucks, motorcycles and other motor vehicles. Automotive engineers also design and test the many subsystems or components that comprise a motorized vehicle. A master's degree in automotive engineering is not necessary to work in the field, but such a degree will give students specialized automotive engineering knowledge and skills. Moreover, master's degree programs offer research opportunities for students."}, {"url": "http://study.com/directory/category/Engineering/Mechanical_Engineering/Automotive_Engineering.html", "passage_text": "Automotive engineering is a combination of mechanical, electrical and materials science. Engineers in this field can design new vehicles or look for ways to improve existing automotive engineering technology. Automotive engineers can design and test brake systems, engines, safety mechanisms, fuel technologies and transmissions. In the field, engineers use design software to devise new vehicle designs or systems, including ThinkDesign Engineering, Gamma Technologies GT-SUITE or Corel Painter Sketch Pad."}, {"url": "http://www.sciencebuddies.org/science-engineering-careers/engineering/automotive-engineer", "passage_text": "Automotive engineers work for engineering consulting firms, automobile companies, and in the manufacturing and transportation industries. The average workweek for an automotive engineer is between 40 and 55 hours, but it can be longer as deadlines approach. Automotive engineers generally work in offices on computers, but they also travel to manufacturing plants to conduct experiments or collect data."}, {"url": "http://work.chron.com/become-automotive-engineer-9227.html", "passage_text": "Automotive engineers design vehicle systems and automobiles. To become an automotive engineer, you can follow one of two engineering disciplines in college: mechanical engineering or automotive technology engineering. Automotive engineers are also responsible for designing cars that use alternative sources of fuel. When you have a passion for designing or working on automobiles, an automotive engineering career might be the right choice. An affinity for advanced mathematics is critical to any type of automotive engineering classes."}, {"url": "http://educatingengineers.com/careers/automotive-engineer", "passage_text": "Automotive engineering is one of the most exciting, challenging and rewarding careers. Whenever a customer drives a new vehicle off a dealership lot, he or she is taking with them the technical expertise of many engineers, but in particular, the automotive engineer. Automotive engineers research, design and develop vehicles and their subsystems."}]