[{"url": "http://www.accountingcoach.com/careers/cpa-requirements", "passage_text": "While having a 120-credit bachelor's degree in accounting was, at one time, enough to qualify a person to sit for the CPA Exam, most states now require that candidates complete a 150-credit college degree program."}, {"url": "http://www.becker.com/cpa-review/resources/about-exam/requirements/illinois-cpa-exam-requirements", "passage_text": "1. A Bachelor's degree, or higher, from a regionally or nationally accredited college or university with 150 hours of acceptable credit and 24* hours in Accounting and 24 hours in other business courses. Financial accounting, auditing, taxation and management accounting must be part of the 24 hours in accounting, or. 2."}, {"url": "http://crushthecpaexam.com/cpa-courses-for-college-credit/", "passage_text": "The typical bachelor’s degree requires 120 credit hours, but most State Board’s now require you to have 150 credit hours to qualify for the CPA exam."}, {"url": "http://www.becker.com/cpa-review/resources/about-exam/requirements/illinois-cpa-exam-requirements", "passage_text": "1 Graduate degree with at least 30 semester credit hours in accounting at undergrad level or the equivalent at the graduate level (based on AACSB accreditation). 2  Candidates will receive provisional approval to take the CPA exam while completing educational requirements."}, {"url": "http://crushthecpaexam.com/cpa-courses-for-college-credit/", "passage_text": "Get College Credits Studying for the CPA Exam. The typical bachelor’s degree requires 120 credit hours, but most State Board’s now require you to have 150 credit hours to qualify for the CPA exam. For most people, this means going back to school for another year to gain these additional 30 credit hours."}, {"url": "http://www.gbc.edu/degrees/certs/acc150_certificate.html", "passage_text": "Goldey-Beacom's Accounting 150 Certificate Program will be tailored for each student to assure he or she completes the number of credits required to sit for the exam, while taking courses in such areas as Business Ethics, International Business Management, and accounting."}, {"url": "https://www.picpa.org/future-cpas/cpa-exam-licensing/cpa-exam-licensing-faqs", "passage_text": "You can apply to sit for the CPA Exam once you have graduated with a bachelor's or master's degree with at least 24 semester-credit hours in accounting subjects."}, {"url": "http://www.gbc.edu/degrees/certs/acc150_certificate.html", "passage_text": "1 Most graduates with a bachelor's accounting degree have already typically completed 120 to 138 of the 150 needed credit hours. 2  Many students can complete this in just one or two semesters, while others may choose to spread study over a year. 3  We will tailor a program just for you that will suit your schedule."}]