[{"url": "http://www.ncl.ac.uk/postgraduate/funding/fees/", "passage_text": "Paying fees. Tuition fees are usually payable for each year of your study. International students and research students will need to pay half of their tuition fees in order to register at the University in September. The second half of your fees will be due in the following January."}, {"url": "http://www.ncl.ac.uk/undergraduate/finance/tuitionfees/", "passage_text": "1 You will not have to pay any tuition fees up-front or while you are studying. 2  Tuition fee loans are available for eligible students from the UK and EU. 3  You only start to repay the loan after you have graduated and are earning over £21,000. 4  Different fee levels apply on some of our courses. Undergraduate Study. We will be charging a tuition fee of £9,000 per year for new undergraduates, from the UK and EU, who start university in 2015 or 2016. We provide tuition fee costs for international students (from outside the EU) in the individual degree pag"}, {"url": "http://www.scholars4dev.com/4031/list-of-european-countries-with-tuition-freelow-tuition-universities-colleges/", "passage_text": "If you are an non-EU/EEA student, federal/public universities in Austria only charge about 363.36 or 726.72 Euros per semester for tuition fees plus 17.50 Euros for the Student Union membership fee and .50 Euros insurance fee per semester. In some Federal States, Universities will charge a semester contribution (about 50 euros) and/or administration fees (about 50 euros). This tuition fee structure can change in the future, you should check this page for updated information on tuition fees in different federal states in Germany."}, {"url": "http://www.afterschoolafrica.com/7039/tuition-free-universities-in-norway/", "passage_text": "University of Bergen. The only fee to be paid at the University of Bergen is the semester fee to the Student Welfare Organisation (SiB), currently NOK 480. The University of Bergen is a public institution and therefore does not charge tuition fees. This applies both to Norwegian and international students. Master level courses: NOK 11 360 per course (6 ECTS). When students take the full semester workload of 30 ECTS, the tuition fee is equal to the maximum charge of NOK 39 950. The BI Norwegian Business School offers a number of summer programme scholarships."}, {"url": "http://www.mastersportal.eu/articles/343/tuition-fees-in-norway.html", "passage_text": "Even if there are no tuition costs, students do need to cover their living expenses, including housing, books, food and travel. In order to get an international student visa, the Norwegian government will require students to have NOK 90,800 in a Norwegian bank account in your name to cover a 10-month university year. Programmes and courses with tuition fees. Most private institutions have tuition fees for all their programmes and courses. But the fees are usually significantly lower than those of comparable studies in most other countries. Also, foreign students don't pay higher tuition fees than Norwegian students"}, {"url": "http://www.mastersportal.eu/articles/343/tuition-fees-in-norway.html", "passage_text": "Tuition Fees in Norway Cost and funding. All public (state) Norwegian universities do not charge tuition fees, even for international students. This is true for all levels, including undergraduate studies, Master's programmes and Ph.D. programmes. Programmes and courses with tuition fees. Most private institutions have tuition fees for all their programmes and courses. But the fees are usually significantly lower than those of comparable studies in most other countries. Also, foreign students don't pay higher tuition fees than Norwegian student"}, {"url": "http://www.ncl.ac.uk/undergraduate/finance/tuitionfees/", "passage_text": "Tuition Fees and Costs. We will be charging a tuition fee of £9,000 per year for new undergraduates, from the UK and EU, who start university in 2015 or 2016. We provide tuition fee costs for international students (from outside the EU) in the individual degree pages. Undergraduate Study. We will be charging a tuition fee of £9,000 per year for new undergraduates, from the UK and EU, who start university in 2015 or 2016."}, {"url": "http://www.ncl-coll.ac.uk/higher-education/tuition-fees", "passage_text": "Newcastle College’s tuition fee for full-time UK and EU students studying a Foundation Degree or one-year Honours Degree starting in September 2015 is £6,800 per annum. The tuition fee for a part-time degree course starting September 2015 is £4,000 per year. You can choose to pay your tuition fees up-front or take out a Tuition Fee Loan from the Student Loan Company, which currently defers payment until you earn over £21,000 per year after graduation. Click here to download the HE Fees Payment Factsheet that explains how to pay for your tuition fees."}]