[{"url": "http://www.healthline.com/health/urine-specific-gravity", "passage_text": "Your doctor will look at the ratio of the density of your urine to the density of water. To put it another way, the specific density of water itself would be 1.000. Ideally, urine specific gravity results will fall between 1.002 and 1.030 if your kidneys are functioning at a normal level. A urine specific gravity test compares the density of urine to the density of water. This quick test can help determine how efficiently your kidneys are diluting your urine. Urine that’s too concentrated may indicate that your kidneys aren’t functioning properly, or simply that you aren’t drinking enough water."}, {"url": "http://emedicine.medscape.com/article/2090711-overview", "passage_text": "Reference Range. Urinary specific gravity (SG) is a measure of the concentration of solutes in the urine. It measures the ratio of urine density compared with water density and provides information on the kidney’s ability to concentrate urine. A urinary specific gravity measurement is a routine part of urinalysis. Urinary specific gravity is a measure of the concentration of solutes in the urine and provides information on the kidney’s ability to concentrate urine."}, {"url": "http://www.rnceus.com/ua/uasg.html", "passage_text": "Specific gravity measures the kidney's ability to concentrate or dilute urine in relation to plasma. Because urine is a solution of minerals, salts, and compounds dissolved in water, the specific gravity is greater than 1.000. The more concentrated the urine, the higher the urine specific gravity. An adult's kidneys have a remarkable ability to concentrate or dilute urine. In infants, the range for specific gravity is less because immature kidneys are not able to concentrate urine as effectively as mature kidneys."}, {"url": "http://www.rnceus.com/ua/uasg.html", "passage_text": "1 Glomerulonephritis and pyelonephritis cause a decreased urine volume and low specific gravity. 2  In these diseases, damage to the kidney's tubules affects the ability of the kidney to re-absorb water. 3  As a result, the urine remains dilute. The more concentrated the urine, the higher the urine specific gravity. An adult's kidneys have a remarkable ability to concentrate or dilute urine. In infants, the range for specific gravity is less because immature kidneys are not able to concentrate urine as effectively as mature kidneys."}, {"url": "http://www.scripps.org/articles/3211-urine-specific-gravity-test", "passage_text": "This test helps check your body's water balance and urine concentration. Osmolality is a more specific test for urine concentration. The specific gravity test is easier and more convenient, and is usually part of a routine urinalysis. How the test is performed. After you provide a urine sample, it is tested right away. The health care provider uses a dipstick made with a color-sensitive pad. The color the dipstick changes to will tell the provider the specific gravity of your urine."}, {"url": "https://en.wikipedia.org/wiki/Urine_specific_gravity", "passage_text": "Decreased specific gravity (hyposthenuria, i.e. decreased concentration of solutes in urine) may be associated with renal failure, pyelonephritis, diabetes insipidus, acute tubular necrosis, interstitial nephritis, and excessive fluid intake (e.g., psychogenic polydipsia). "}, {"url": "http://www.rnceus.com/ua/uasg.html", "passage_text": "1 In these diseases, damage to the kidney's tubules affects the ability of the kidney to re-absorb water. 2  As a result, the urine remains dilute. 3  The third reason for low specific gravity is renal failure, which results in a fixed specific gravity between 1.007 and 1.010. The more concentrated the urine, the higher the urine specific gravity. An adult's kidneys have a remarkable ability to concentrate or dilute urine. In infants, the range for specific gravity is less because immature kidneys are not able to concentrate urine as effectively as mature kidneys."}, {"url": "http://www.healthline.com/health/urine-specific-gravity", "passage_text": "A urine sample is a painless way for your doctor to evaluate your health and test for abnormalities. One thing your doctor may check for in your urine sample test (urinalysis) is specific gravity. A urine specific gravity test compares the density of urine to the density of water. This quick test can help determine how efficiently your kidneys are diluting your urine. Urine that’s too concentrated may indicate that your kidneys aren’t functioning properly, or simply that you aren’t drinking enough water."}, {"url": "http://www.2ndchance.info/dxme-SpGravity.htm", "passage_text": "Determining the specific gravity of your pet’s urine is the way veterinarians judge how concentrated it is. The higher the SpGr number, the more concentrated your dog or cat 's urine is-the lower the number, the more dilute it is. Pure water has a specific gravity of 1.000. "}]