[{"url": "http://www.normalbreathing.com/index-nb.php", "passage_text": "Normal respiration rate in adults is 12 breaths/min. Normal breathing, as we discussed, is strictly nasal (in and out), mainly diaphragmatic (i.e., abdominal), slow (in frequency) and imperceptible (or small/shallow in its volume). The physiological and medical norm for respiratory minute ventilation at rest is 6 liters per minute for a 70 kg man (see references for textbooks below: Guyton, 1984; Ganong, 1995; Straub, 1998; Castro, 2000; etc.). These textbooks also provide the following numbers for normal breathing:"}, {"url": "https://en.wikipedia.org/wiki/Respiratory_rate", "passage_text": "The typical respiratory rate for a healthy adult at rest is 12–20 breaths per minute. Average resting respiratory rates by age are: 1  birth to 6 weeks: 30–60 breaths per minute. 2  6 months: 25–40 breaths per minute. Measurement [edit]. Human respiration rate is measured when a person is at rest and involves counting the number of breaths for one minute by counting how many times the chest rises. An optical breath rate sensor can be used for monitoring patients during a magnetic resonance imaging scan"}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=85&ContentID=P00866", "passage_text": "The respiration rate is the number of breaths a person takes per minute. The rate is usually measured when a person is at rest and simply involves counting the number of breaths for one minute by counting how many times the chest rises. Respiration rates may increase with fever, illness, and with other medical conditions. When checking respiration, it is important to also note whether a person has any difficulty breathing. Normal respiration rates for an adult person at rest range from 12 to 16 breaths per minute."}, {"url": "http://www.answers.com/Q/What_is_the_respiratory_rate_of_a_chicken", "passage_text": "What is the normal range for respiratory rate? the normal range for rispiratory rate is from 15 to 20 breathes in 15 seconds. then the numbers fo breathes is multiplied by 4 to get the nukber of breathes in a minute.   … *******************WRONG******************   this would be one breath every second. 1 Tachypnea has many different definitions depending on the age…. 2  What an Increase in Dog Respiratory Rate Could Mean Although many people own dogs, not many people are aware of what is normal for a dog with regards to their vital signs. 3  This would include things like the respiratory rate of…."}, {"url": "https://en.wikipedia.org/wiki/Respiratory_rate", "passage_text": "A normal respiratory rate is termed eupnea, an increased respiratory rate is termed tachypnea and a lower-than-normal respiratory rate is termed bradypnea. Breathing (which in organisms with lungs is called ventilation and includes inhalation and exhalation) is a part of respiration. Measurement [edit]. Human respiration rate is measured when a person is at rest and involves counting the number of breaths for one minute by counting how many times the chest rises. An optical breath rate sensor can be used for monitoring patients during a magnetic resonance imaging sca"}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/cardiovascular_diseases/vital_signs_body_temperature_pulse_rate_respiration_rate_blood_pressure_85,P00866/", "passage_text": "The respiration rate is the number of breaths a person takes per minute. The rate is usually measured when a person is at rest and simply involves counting the number of breaths for one minute by counting how many times the chest rises. Respiration rates may increase with fever, illness, and with other medical conditions. The normal pulse for healthy adults ranges from 60 to 100 beats per minute. The pulse rate may fluctuate and increase with exercise, illness, injury, and emotions. Females ages 12 and older, in general, tend to have faster heart rates than do males."}, {"url": "http://www.normalbreathing.com/index-rate.php", "passage_text": "Medical textbooks suggest that the normal respiratory rate for adults is only 12 breaths per minute at rest. Older textbooks often provide even smaller values (e.g., 8-10 breaths per minute). Definition. Respiratory rate (also known as ventilation rate, respiration rate, breathing rate, pulmonary ventilation rate, breathing frequency, and respiratory frequency or Rf) = the number of breaths a person takes during one minute. It is usually measured at rest, while sitting"}, {"url": "http://www.vcahospitals.com/main/cat-care/article/check-your-cats-vital-signs-at-home", "passage_text": "Feel your cat’s heartbeat with one hand over his left side, just behind his front leg. Count the number of beats in 15 seconds and multiply by four to get the heart rate in beats per minute (bpm). A normal cat's heart rate is between 140 and 220 bpm, with a relaxed cat measuring on the low end. Call your veterinarian if the heart rate is too rapid, too slow or irregular. Take your cat's respiratory rate. Watch your cat breathe when he is relaxed and standing; focus on the movement of the abdomen and chest wall. "}]