[{"url": "https://en.wikipedia.org/wiki/Sligo", "passage_text": "The main roads to Sligo are the N4 to Dublin, the N17 to Galway, the N15 to Lifford, County Donegal; and the N16 to Blacklion, County Cavan, and continues as the A4 road (Northern Ireland) to Enniskillen. Sligo acquired a rail link to Dublin on 3 December 1862, with the opening of Sligo railway station. Connections to Enniskillen and the north followed in 1881 and Limerick and the south in 1895. The line to Enniskillen closed in 1957 and passenger services to Galway-Ennis-Limerick closed in 1963."}, {"url": "http://www.sligoroots.com/", "passage_text": "Welcome to the homepage of the designated Genealogy Research Centre for County Sligo. This centre offers a comprehensive genealogical service to people tracing their County Sligo roots from all over the world. The Centre has over twenty years experience in carrying out ancestral research, enabling countless people to discover their family lineage."}, {"url": "https://en.wikipedia.org/wiki/County_Sligo", "passage_text": "Sligo County Council is the governing body for the county. It is divided into five Local Electoral Areas (LEAs) Ballymote, Dromore, Sligo-Drumcliff, Sligo-Strandhill and Tubbercurry. There are 25 members elected to Sligo County Council. Unlike its neighboring counties, Sligo has had more success at soccer rather than Gaelic games. The county is home to League of Ireland Premier Division club Sligo Rovers, who have played home matches at The Showgrounds since they were founded in 1928."}, {"url": "https://en.wikipedia.org/wiki/Sligo", "passage_text": "Sligo (Irish: Sligeach, meaning abounding in shells — /ˈslaɪɡoʊ/ SLY-goh; [ˈɕlʲɪɟəx]) is a coastal seaport and the county town of County Sligo, Ireland within the western province of Connacht. Sligo acquired a rail link to Dublin on 3 December 1862, with the opening of Sligo railway station. Connections to Enniskillen and the north followed in 1881 and Limerick and the south in 1895. The line to Enniskillen closed in 1957 and passenger services to Galway-Ennis-Limerick closed in 1963."}, {"url": "https://en.wikipedia.org/wiki/Sligo", "passage_text": "Sligo and County Sligo are served by Sligo Airport, 8 km (5.0 mi) from Sligo town and near Strandhill, though no scheduled flights currently operate out of the airport. The nearest airport with scheduled flights is Ireland West Airport Knock near to Charlestown, County Mayo, 55 km (34 mi) away. Sligo acquired a rail link to Dublin on 3 December 1862, with the opening of Sligo railway station. Connections to Enniskillen and the north followed in 1881 and Limerick and the south in 1895. The line to Enniskillen closed in 1957 and passenger services to Galway-Ennis-Limerick closed in 1963."}, {"url": "http://sligoheritage.com/", "passage_text": "...Each age is a dream that is dying/ or one that is coming to birth.... For the devotee of Irish history, heritage, mythology or folklore, County Sligo in the west coast province of Connacht, has everything. Yeats, defines the County Sligo landscape. This is the 'Yeats' country', a countryside rich in history, folklore and mythology. In Drumcliffe churchyard the poet himself lies at peace in the Sligo soil that inspired much of his work. My name is Joe Mc Gowan, host of this, County Sligo's only heritage site. My interest in heritage, folklore and history has led to the writing and publishing of several books on the subject"}, {"url": "http://www.sligo-ireland.com/", "passage_text": "Sligo is located in the northwest of Ireland, about forty miles from Enniskillen and the border with Northern Ireland, and 135 miles from Dublin. The city is the 12th largest city in Ireland and the 2nd largest in the West (behind only Galway) with a population of about 20,000. It's rugged landscapes rival those of tourist destinations like Killarney and Wicklow, but have gone largely un-noticed and therefore, provide the beauty without the crowds! Like many towns in Ireland, Sligo has changed dramatically in the past 20 years."}, {"url": "https://en.wikipedia.org/wiki/County_Sligo", "passage_text": "County Sligo (Irish: Contae Shligigh) is a county in Ireland. It is located in the Border Region and is also part of the province of Connacht. It is named after the town of Sligo. Sligo County Council is the local authority for the county. Unlike its neighboring counties, Sligo has had more success at soccer rather than Gaelic games. The county is home to League of Ireland Premier Division club Sligo Rovers, who have played home matches at The Showgrounds since they were founded in 1928."}]