[{"url": "http://www.thefreeinmatelocator.com/texas-inmate-search.html", "passage_text": "You can go to the online Texas Inmate Search Page and put in the last name and at least the first letter of the first name. The next screen will give you a list of Texas prison inmates, their TDCJ numbers, projected release date and unit of assignment. (Don't forget to disable your pop up blocker or it won't work!)."}, {"url": "http://www.tdcj.state.tx.us/offender_information/offender_information_telephone.html", "passage_text": "Must have TDCJ or SID# or date of birth. Offender Locator/General Information Line-Huntsville, (936) 295-6371, or (800) 535-0283. *NOTE: If you do not know the offender's TDCJ or SID number you MUST provide EXACT date of birth of offender for telephone requests."}, {"url": "https://answers.yahoo.com/question/index?qid=20070605174938AADzBGa", "passage_text": "Report Abuse. You can look at the TDCJ website under offender information.. Turn your pop-up blocker off, and fill in the offender's full name, and the TDCJ number if you have it. As for finding out about parole eligibility--it won't tell you if the offender is up for parole.."}, {"url": "http://www.tdcjinmatesearch.org/", "passage_text": "You can search an inmate online, by e-mail, or by telephone. TDCJ Inmate Search Online. Free TDCJ inmate search 24 hours a day. The result is provided by the Texas Department of Criminal Justice. TDCJ operates the second largest jail/prison system in the United States."}, {"url": "https://answers.yahoo.com/question/index?qid=20070605174938AADzBGa", "passage_text": "Best Answer: You can get basic info by going to the following web-site: tdcj-id offender information, Keep in mind that you must have the offenders T.D.C.J. # and first and last name along with any other info on them you may have."}, {"url": "http://info.legalzoom.com/out-someone-released-tdc-texas-20492.html", "passage_text": "Information about the release dates of offenders in the Texas Department of Criminal Justice, formerly the Texas Department of Corrections or TDC, is in the public domain. The TDCJ maintains an online search page that allows you to search for the location and release date of any offender or parolee."}, {"url": "http://www.answers.com/Q/How_can_i_find_out_a_inmate_parole_release_date", "passage_text": "To conduct a search, you will need to know whether the inmate is incarcerated in a state or a federal prison. You will also need to know the state, and sometimes the county, i … n which the inmate is incarcerated and, either the inmate's full name as it appears in records, or the inmate's ID number."}, {"url": "http://www.ehow.com/how_8506270_parole-status-texas.html", "passage_text": "Inquiry Targets. For information on a parolee, you'll need the name, TDCJ number or State Identification Number. Without the identification numbers, a date of birth along with name may allow the department to find the requested information."}, {"url": "http://www.thefreeinmatelocator.com/texas-inmate-search.html", "passage_text": "Use the offender's full name and 7-digit TDCJ number. If you do not know the TDCJ number, provide the exact date of birth (if date of birth is not known, provide their approximate age and county of conviction). Please include Texas inmate's name in subject line of e-mail. There is no charge for this service."}]