[{"url": "http://www.mass.gov/courts/court-info/appealscourt/appeals-court-help-center/appeals-court-faqs.html", "passage_text": "You must pay a fee to the Appeals Court within ten days of receiving the notice from the trial court clerk, in order to have your case entered into the court’s docket. The docket fee is $300 per appealing party. For example, if you and your spouse are both appealing, the fee is $600. The Record Assembly will remain in your case file during the course of your appeal. If your case is a civil case, you must enter your appeal within 10 days of receiving this Notice of Record Assembly. In other words, the Appeals Court must receive your entry fee within 10 days of your receipt of the Notice. Criminal cases are entered automatically by the court. Back to top"}, {"url": "http://www.courts.state.nh.us/supreme/faq.htm", "passage_text": "If your appeal is late, it may be dismissed by the court. Under Rule 21(6), motions for late entry of a notice of appeal are not favored and will be granted only upon a showing of exceptional circumstances. In most cases, you have 30 days to file an appeal. With each copy of the notice of appeal, you must file a copy of the trial court's decision that you are appealing, as well as the trial court clerk's written notice of the decision, which you should have received either in court or in the mail with the decision in your case."}, {"url": "http://williampfeifer.com/faqs-frequently-asked-questions/how-long-do-i-have-to-file-an-appeal-in-alabama", "passage_text": "1 Juvenile Court Civil cases – 14 days from entry of judgment. 2  Domestic Relations cases – 42 days or 14 days, depending on the situation. 3  If the domestic relations case is a divorce or a post-divorce modification proceeding, then the time to appeal will be 42 days from the date of the family court’s final order. "}, {"url": "http://athenaroussoslaw.com/yahoo_site_admin/assets/docs/Daily_Recorder_Column_1.344161651.pdf", "passage_text": "Therefore, it is important that you check the rules to make sure you know the deadline for your particular type of case. In federal courts, in civil cases where the United States is not a party, the time to file a notice of appeal is normally 30 days after entry of the judgment or order. 3. In California courts, parties normally have 60 days to file a notice of appeal after the clerk or a party mails notice of entry of the judgment, but some appeals are subject to a shorter time frame. For example, in certain types of election cases, the deadline is 10 days instead of 60 days."}, {"url": "http://www.courts.ca.gov/8546.htm", "passage_text": "Only a person or entity that was a party in the trial court case can appeal a decision made in that case. You may not appeal on behalf of a friend, a spouse, a child, or another relative unless you are a legally appointed representative for that person (such as a guardian or conservator). 1 60 days after either the trial court clerk or the other side serves you with notice that the judgment has been entered in your case or with a copy of the judgment stamped Filed, or. 2  180 days after the entry of the judgment."}, {"url": "http://www.courts.ca.gov/8546.htm", "passage_text": "You can appeal the trial court's final judgment in a case. The final judgment is the decision at the end that decides the whole the case. The final judgment usually says what 1 or more parties must do (like pay money to the other party). This judgment may be a decision by the judge or by a jury. 1 60 days after either the trial court clerk or the other side serves you with notice that the judgment has been entered in your case or with a copy of the judgment stamped Filed, or. 2  180 days after the entry of the judgment."}, {"url": "http://law.freeadvice.com/litigation/appeals/appeal_federal_court.htm", "passage_text": "The first step in appealing a federal district court decision is filing a notice of appeal with the clerk of the district court. Strict deadlines apply to the filing of the notice of appeal – usually 30 days for civil cases and just 10 for federal criminal cases. For some cases in which the federal government is a party, the deadline may be as much as 45 days, but make sure to check this requirement closely. The clock starts running on the day that the district court judge enters the final judgment in the district court trial."}, {"url": "http://courts.mi.gov/Courts/COA/clerksoffice/Documents/Appellant%20Manual.pdf", "passage_text": "It is also provided below. Within 28 days of filing a claim of appeal, MCR 7.204(H), or entry of an order granting your application for leave to appeal, MCR 7.205(E)(3), you must file a docketing statement in the Court of Appeals in a civil case. "}, {"url": "http://www.courts.state.nh.us/supreme/faq.htm", "passage_text": "In that case, the appeal is due within 30 days from the date on the trial court clerk's notice of the decision on the motion for reconsideration. In landlord-tenant cases, there is a 7-day time limit to file a motion to reconsider. With each copy of the notice of appeal, you must file a copy of the trial court's decision that you are appealing, as well as the trial court clerk's written notice of the decision, which you should have received either in court or in the mail with the decision in your case."}]