[{"url": "http://www.rxlist.com/synthroid-drug/indications-dosage.htm", "passage_text": "The average full replacement dose of levothyroxine sodium is approximately 1.7 mcg/kg/day (e.g., 100-125 mcg/day for a 70 kg adult). Older patients may require less than 1 mcg/kg/day. Levothyroxine sodium doses greater than 200 mcg/day are seldom required."}, {"url": "http://www.endocrineweb.com/conditions/hypothyroidism/synthetic-t4-supplements-hypothyroidism", "passage_text": "Synthetic forms of the thyroid hormone T4 are generally called levothyroxine, and they are considered the standard treatment for hypothyroidism. Though they are man-made, synthetic T4 hormones are exactly the same as the T4 that is produced and released by the thyroid gland."}, {"url": "https://www.synthroid.com/medication/check-your-pill", "passage_text": "USE. SYNTHROID ® (levothyroxine sodium tablets, USP) is a prescription, man-made thyroid hormone that is used to treat a condition called hypothyroidism, except in cases of temporary hypothyroidism, which is usually associated with an inflammation of the thyroid gland (thyroiditis)."}, {"url": "http://www.empoweryourhealth.org/magazine/vol4_issue3/thyroid-disease-determining-your-medication-dose", "passage_text": "For instance, your doctor may start you with 12.5 to 25 mcg of synthetic T4 (levothyroxine sodium) per day and increase the dose every four to six weeks until laboratory tests show that your TSH and T4 levels are within the normal range."}, {"url": "http://www.aafp.org/afp/2006/0401/p1271.html", "passage_text": "Treatment of hypothyroidism with levothyroxine is effective, but starting doses vary. There are two strategies for initiating levothyroxine in healthy adults younger than 65 years: low-dose (50 mcg) and full-dose (1.6 to 1.7 mcg per kg)."}, {"url": "http://endocrine-system.emedtv.com/synthroid/synthroid-dosage.html", "passage_text": "Because people have varying degrees of hypothyroidism and other thyroid problems, Synthroid is not a one-size-fits-all medication. Instead, the Synthroid dosage must be individualized. It often takes several months to find the best dose, and your dose may need to be adjusted from time to time."}, {"url": "http://www.aafp.org/afp/2001/1115/p1717.html", "passage_text": "Most otherwise healthy adult patients with hypothyroidism require thyroid hormone replacement in a dosage of 1.7 μg per kg per day, with requirements falling to 1 μg per kg per day in the elderly. Thus, levothyroxine in a dosage of 0.10 to 0.15 mg per day is needed to achieve euthyroid status."}, {"url": "http://www.thyroid.ca/fact_sheet2.php", "passage_text": "Hypothyroidism is treated by giving the patient sufficient thyroxine (thyroid hormone), the most commonly prescribed in Canada being Synthroid and Eltroxin. The average daily dose is 0.125 milligrams (125 micrograms); it is rare to require more than 0.2 milligrams (mg)."}]