[{"url": "http://www.nytimes.com/health/guides/nutrition/protein-in-diet/overview.html", "passage_text": "Every cell in the human body contains protein. It is a major part of the skin, muscles, organs, and glands. Protein is also found in all body fluids, except bile and urine. You need protein in your diet to help your body repair cells and make new ones."}, {"url": "https://answers.yahoo.com/question/index?qid=20080219061836AAzwVg1", "passage_text": "Proteins do just about *everything* in the human body. Collagen is the major component of our bodies-and it is a protein. Hormones are usually proteins. The haemoglobin in our red blood cells"}, {"url": "http://www.brighthub.com/science/medical/articles/6050.aspx", "passage_text": "Protein has a range of essential functions in the body, including the following: 1  Required for building and repair of body tissues (including muscle). 2  Enzymes, hormones, and many immune molecules are proteins. 3  Essential body processes such as water balancing, nutrient transport, and muscle contractions require protein to function. 4  Protein is a 5  ... P"}, {"url": "http://www.preservearticles.com/201105156693/4-most-essential-functions-of-protein.html", "passage_text": "Regulations of body processes: Body proteins have highly specialized functions in the regulation of body processes. For example, hemoglobin, an iron bearing protein that is the chief constituent of red blood cells performs a vital role in carrying oxygen to the tissues."}, {"url": "http://www.answers.com/Q/What_is_the_primary_function_of_protein", "passage_text": "1. The primary functions of proteins include building and repairing of body tissues, regulation of body processes and formation of enzymes and hormones. 2.Dietary protein regulates metabolism and fluid balance. Protein is required for building and repair of body tissues (including muscle). Enzymes, hormones, and many immune molecules are proteins. Essential body processes such as water balancing, nutrient transport, and muscle contractions require protein to function. Protein is a source of energy."}, {"url": "http://healthyeating.sfgate.com/6-primary-functions-proteins-5372.html", "passage_text": "Protein is involved in the creation of some hormones. These substances help control body functions that involve the interaction of several organs. Insulin, a small protein, is an example of a hormone that regulates blood sugar. It involves the interaction of organs such as the pancreas and the liver."}]