[{"url": "http://www.webopedia.com/TERM/N/non_linear_editing.html", "passage_text": "In digital video editing, non-linear editing is a method that allows you to access any frame in a digital video clip regardless of sequence in the clip. The freedom to access any frame, and use a cut-and-paste method, similar to the ease of cutting and pasting text in a word processor, and allows you to easily include fades, transitions, and other effects that cannot be achieved with linear editing."}, {"url": "http://www.yourdictionary.com/linear", "passage_text": "linear-Computer Definition. A constant progression or force. On a graph, a linear example is a straight line. Contrast with exponential or geometric, which are both nonlinear. For example, a linear set of numbers is 1, 3, 5, 7, 9, 11, etc., each number a constant increase of 2.. This sidewalk is linear. The definition of linear is consisting of or using lines. An example of linear is the length of a section of sidewalk. 1  of or relating to a line or lines. 2  made of or using lines: linear design. 3  in relation to length only; extended in a line"}, {"url": "http://www.merriam-webster.com/dictionary/linear%20programming", "passage_text": "Definition of LINEAR PROGRAMMING. : a mathematical method of solving practical problems (as the allocation of resources) by means of linear functions where the variables involved are subject to constraints. See linear programming defined for kids. Tweet. : a mathematical method of solving practical problems (as the allocation of resources) by means of linear functions where the variables involved are subject to constraints."}, {"url": "http://www.thefreedictionary.com/linear", "passage_text": "lin·e·ar. Of or resembling a line. ♦ A linear equation is an algebraic equation, such as y = 4 x + 3, in which the variables are of the first degree (that is, raised only to the first power). The graph of such an equation is a straight line. Thesaurus AntonymsRelated WordsSynonymsLegend: "}, {"url": "http://www.icoachmath.com/math_dictionary/Linear_Function.html", "passage_text": "Definition of Linear Function. A function that can be graphically represented in the Cartesian coordinate plane by a straight line is called a Linear Function. A linear function is a first degree polynomial of the form, F(x) = m x + c, where m and c are constants and x is a real variable. The constant m is called slope and c is called y-intercept. 1 Step 1: The graph of a linear function is a straight line. 2  Step 2: Graph 4 is a straight line. 3  Step 3: So, Graph 4 represents a linear function."}, {"url": "http://www.businessdictionary.com/definition/linear-programming.html", "passage_text": "7 people found this helpful. Linear programming can be applied to a wide variety of fields of study, and has proved useful in planning, routing, scheduling, assignment, and design, such as in transportation or manufacturing industries. 2 people found this helpful. Definition. Mathematical technique used in computer modeling (simulation) to find the best possible solution in allocating limited resources (energy, machines, materials, money, personnel, space, time, etc.) to achieve maximum profit or minimum cost."}, {"url": "https://en.wikipedia.org/wiki/Linear_programming", "passage_text": "Linear programming (LP; also called linear optimization) is a method to achieve the best outcome (such as maximum profit or lowest cost) in a mathematical model whose requirements are represented by linear relationships. Linear programming is a special case of mathematical programming (mathematical optimization). More formally, linear programming is a technique for the optimization of a linear objective function, subject to linear equality and linear inequality constraints."}, {"url": "http://www.merriam-webster.com/dictionary/linear", "passage_text": "Medical Definition of LINEAR. : of, relating to, or resembling a line. — lin·ear·i·ty \\ˌlin-ē-ˈar-ət-ē\\ noun, plural lin·ear·i·ties. — lin·ear·ly \\ˈlin-ē-ər-lē\\ adverb. "}]