[{"url": "http://cholesterol.emedtv.com/crestor/generic-crestor.html", "passage_text": "No, it isn't. Rosuvastatin calcium is Crestor's active ingredient, not a generic version of it. People often refer to a drug's active ingredient as its generic name.. However, a medicine's generic name is different from a generic version of it. However, there are other circumstances that could come up to extend the exclusivity period of the medication beyond 2016. This could include such things as other patents for specific Crestor uses or lawsuits. Once the patent expires, there may be several companies that will manufacture a generic Crestor drug."}, {"url": "http://www.genengnews.com/gen-news-highlights/actavis-eyes-2016-generic-crestor-launch-after-settling-patent-suit-with-az/81248139", "passage_text": "(Page 1 of 1). Actavis said today it is planning a 2016 launch for its generic versions of AstraZeneca’s cholesterol treatment rosuvastatin calcium (Crestor®) 5, 10, 20, and 40 mg tablets, after settling outstanding patent litigation with the pharma giant. Actavis, the world's third-largest generics prescription drug manufacturer, said it will launch generic Crestor 67 days before the July 8, 2016, expiration of the drug’s pediatric exclusivity. The drug’s substance patent expires six months earlier"}, {"url": "https://en.wikipedia.org/wiki/Rosuvastatin", "passage_text": "Rosuvastatin (marketed by AstraZeneca as Crestor) 10 mg tablets. Rosuvastatin, marketed as Crestor, is a member of the drug class of statins, used in combination with exercise, diet, and weight-loss to treat high cholesterol and related conditions, and to prevent cardiovascular disease. It was developed by Shionogi. "}, {"url": "http://www.pmlive.com/pharma_news/astrazeneca_settles_with_generic_rivals_in_crestor_patent_challenge_469203", "passage_text": "The substance patent for Crestor expires on January 8, 2016, but AstraZeneca won a six-month extension under the US paediatric trials incentive programme. Sales of Actavis' generic before the extension expires on July 8 will incur a 39 per cent royalty fee to AstraZeneca. The victory in the US overshadows some bad news for AstraZeneca earlier this month when it lost a lawsuit defending Crestor's intellectual property in Australia. The company said it has entered into a settlement agreement with Actavis and Egis Pharmaceuticals over their plan to launch generic Crestor (rosuvastatin calcium), blocking competition for the product until May 2016."}, {"url": "http://www.genengnews.com/gen-news-highlights/actavis-eyes-2016-generic-crestor-launch-after-settling-patent-suit-with-az/81248139", "passage_text": "Crestor racked up $6.253 billion in sales for AZ last year, down 4% from $6.622 billion in 2011. While Crestor is still expected to generate some $6 billion this year, that will be complicated somewhat by the drug’s loss of patent protection in Australia. Actavis, the world's third-largest generics prescription drug manufacturer, said it will launch generic Crestor 67 days before the July 8, 2016, expiration of the drug’s pediatric exclusivity. The drug’s substance patent expires six months earlier"}, {"url": "http://www.in-pharmatechnologist.com/Processing/AZ-s-Crestor-API-plant-set-to-shut-by-2017-as-Patent-Cliff-hits", "passage_text": "2013 sales of AstraZeneca’s cardiovascular drug Crestor (rosuvastatin) decreased 8% on the previous year to $5.6bn due to erosion from patent expiration in certain markets. Meanwhile, Pfizer’s Lipitor (atorvastatin) – a major competitor to Crestor – lost its exclusivity in the US late 2011 and since May 2012 AstraZeneca has had to compete against several generic atorvastatin products."}, {"url": "http://www.in-pharmatechnologist.com/Processing/AZ-s-Crestor-API-plant-set-to-shut-by-2017-as-Patent-Cliff-hits", "passage_text": "Patent Problems. While Crestor’s patent is set to expire in the US in 2016, AstraZeneca is already losing sales to generic products in other markets. For example, in Canada a generic version of the statin launched in 2012 and made by Apotex had a negative impact on 2013 figures. Meanwhile, Pfizer’s Lipitor (atorvastatin) – a major competitor to Crestor – lost its exclusivity in the US late 2011 and since May 2012 AstraZeneca has had to compete against several generic atorvastatin products."}, {"url": "http://cholesterol.emedtv.com/crestor/generic-crestor.html", "passage_text": "The first patent for Crestor currently expires in January 2016. This is the earliest possible date that a generic version could become available. However, there are other circumstances that could come up to extend the exclusivity period of the medication beyond 2016. This could include such things as other patents for specific Crestor uses or lawsuits. Once the patent expires, there may be several companies that will manufacture a generic Crestor drug."}, {"url": "http://healthland.time.com/2011/11/16/lipitor-vs-crestor-cholesterol-drugs-are-on-a-par/", "passage_text": "Brand-name statins can cost patients some $160 a month. But after the patent on Lipitor expires on Nov. 30, the availability of generic versions could drop its price by 80%. The patent on Crestor — which goes for about $5 a pill — won’t expire until 2016. “The market for Crestor will go close to zero,” Dr. Cam Patterson, chief of cardiology at the University of North Carolina-Chapel Hill, predicted in an interview with USA Today. Lipitor (atorvastatin) and Crestor (rosuvastatin) both effectively cleared away about 1% of artery-clogging plaque in heart patients after two years. Both drugs also lowered LDL, or “bad” cholesterol, and raised patients’ good HDL levels."}]