[{"url": "http://www.webmd.com/melanoma-skin-cancer/melanoma-malignant", "passage_text": "General Discussion. Malignant Melanoma is a common skin cancer that arises from the melanin cells within the upper layer of the skin (epidermis) or from similar cells that may be found in moles (nevi). This type of skin cancer may send down roots into deeper layers of the skin. It is possible that the main title of the report Melanoma, Malignant is not the name you expected. Please check the synonyms listing to find the alternate name(s) and disorder subdivision(s) covered by this report."}, {"url": "http://www.medicinenet.com/melanoma/article.htm", "passage_text": "Melanoma is a cancer that develops in melanocytes, the pigment cells present in the skin. It can be more serious than the other forms of skin cancer because it may spread to other parts of the body (metastasize) and cause serious illness and death. 1 Melanoma can be more serious than the other forms of skin cancer because it may spread (metastasize) to other parts of the body and cause serious illness and death. 2  Spots suspicious for melanoma usually show one or more of the following symptoms and signs (the ABCD s): 3  A symmetry, 4  B order irregularity,"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001853/", "passage_text": "About Melanoma of the Skin. Melanoma is a disease in which malignant (cancer) cells form in melanocytes (cells that color the skin). The skin is the body's largest organ. It protects against heat, sunlight, injury, and infection. Skin also helps control body temperature and stores water, fat, and vitamin D. "}, {"url": "http://www.cancer.org/cancer/malignantmesothelioma/detailedguide/malignant-mesothelioma-malignant-mesothelioma", "passage_text": "Malignant mesothelioma is a cancer that starts in cells in the linings of certain parts of the body, especially in the linings of the chest or abdomen. Cancer starts when cells start to grow out of control. Cells in nearly any part of the body can become cancer. "}, {"url": "http://www.skincancer.org/skin-cancer-information/melanoma", "passage_text": "The most dangerous form of skin cancer, these cancerous growths develop when unrepaired DNA damage to skin cells (most often caused by ultraviolet radiation from sunshine or tanning beds) triggers mutations (genetic defects) that lead the skin cells to multiply rapidly and form malignant tumors. If melanoma is recognized and treated early, it is almost always curable, but if it is not, the cancer can advance and spread to other parts of the body, where it becomes hard to treat and can be fatal."}, {"url": "http://medical-dictionary.thefreedictionary.com/Malignant+Melanoma", "passage_text": "malignant melanoma a malignant skin tumor, usually developing from a nevus and consisting of dark masses of cells with a marked tendency to metastasis. It is not common, but its incidence is increasing and it is the most aggressive type of skin cancer. Sun exposure definitely increases the risk of developing melanoma, particularly in older males. The melanocytes are part of the integument's photoprotective mechanism; in response to sunlight, they produce melanin that has a protective role from the sun's ultraviolet rays."}, {"url": "http://www.cancer.gov/types/skin/patient/melanoma-treatment-pdq", "passage_text": "1 Melanoma is a disease in which malignant (cancer) cells form in melanocytes (cells that color the skin). 2  There are different types of cancer that start in the skin. 3  Melanoma can occur anywhere on the skin. 4  Unusual moles, exposure to sunlight, and health history can affect the risk of melanoma. There are two forms of skin cancer: melanoma and nonmelanoma. Melanoma is the rarest form of skin cancer. It is more likely to invade nearby tissues and spread to other parts of the body than other types of skin cancer. When melanoma starts in the skin, it is called cutaneous melanoma."}, {"url": "https://en.wikipedia.org/wiki/Melanoma", "passage_text": "Melanoma, also known as malignant melanoma, is a type of cancer that develops from the pigment-containing cells known as melanocytes. Melanomas typically occur in the skin but may rarely occur in the mouth, intestines, or eye. In women they most commonly occur on the legs, while in men they are most common on the back. Melanoma is the most dangerous type of skin cancer. Globally, in 2012, it occurred in 232,000 people and resulted in 55,000 deaths. Australia and New Zealand have the highest rates of melanoma in the world."}, {"url": "http://www.cancer.gov/types/skin/patient/melanoma-treatment-pdq", "passage_text": "Melanoma is a disease in which malignant (cancer) cells form in melanocytes (cells that color the skin). The skin is the body’s largest organ. It protects against heat, sunlight, injury, and infection. Skin also helps control body temperature and stores water, fat, and vitamin D. There are two forms of skin cancer: melanoma and nonmelanoma. Melanoma is the rarest form of skin cancer. It is more likely to invade nearby tissues and spread to other parts of the body than other types of skin cancer. When melanoma starts in the skin, it is called cutaneous melanoma."}, {"url": "http://medical-dictionary.thefreedictionary.com/Malignant+Melanoma", "passage_text": "Malignant melanoma is a type of cancer arising from the melanocyte cells of the skin. Melanocytes are cells in the skin that produce a pigment called melanin. Sun exposure definitely increases the risk of developing melanoma, particularly in older males. The melanocytes are part of the integument's photoprotective mechanism; in response to sunlight, they produce melanin that has a protective role from the sun's ultraviolet rays."}]