[{"url": "http://www.cancer.org/cancer/cervicalcancer/detailedguide/cervical-cancer-treating-surgery", "passage_text": "Cancer that starts in the cervix can spread to lymph nodes in the pelvis (lymph nodes are pea-sized collections of immune system tissue). To check for lymph node spread, the surgeon might remove some of these lymph nodes. This procedure is known as a lymph node dissection or lymph node sampling. "}, {"url": "http://www.wisegeekhealth.com/what-are-the-cervical-lymph-nodes.htm", "passage_text": "Lymphoma. Lymphoma is a type of cancer that affects the lymphatic system. One of the first symptoms is swollen armpit, groin, or cervical lymph nodes. Lymphoma falls into two general categories: Hodgkin's disease and Non-Hodgkin's lymphoma. The cervical lymph nodes are some of the best known nodes of the lymphatic system in part because of their role in disease detection. When the body is fighting some sort of major infection, all or at least many of the lymph nodes may swell."}, {"url": "http://www.wisegeekhealth.com/what-are-the-cervical-lymph-nodes.htm", "passage_text": "The cervical lymph nodes are glands in the human lymphatic system, which is a complicated series of vessels and passageways that bring specialized fluid to the heart and most major organs. The cervical system is located in the neck and is present in people of both genders, adults and children alike. The cervical lymph nodes are some of the best known nodes of the lymphatic system in part because of their role in disease detection. When the body is fighting some sort of major infection, all or at least many of the lymph nodes may swell."}, {"url": "https://en.wikipedia.org/wiki/Cervical_lymphadenopathy", "passage_text": "Cervical lymphadenopathy is a sign or a symptom, not a diagnosis. The causes are varied, and may be inflammatory, degenerative, or neoplastic. In adults, healthy lymph nodes can be palpable (able to be felt), in the axilla, neck and groin. Similarly, the term lymphadenitis refers to inflammation of a lymph node, but often it is used as a synonym of lymphadenopathy. In this article, lymphadenopathy is defined as lymph node enlargement, and only causes of neck lumps related to lymph nodes are discussed, as there are many other causes of lumps in the neck."}, {"url": "http://doctorslounge.com/oncology/diagnosis/lymph_node/cervical.htm", "passage_text": "Causes of cervical (neck) lymph node enlargement. Localized cervical lymphadenopathy (disease of the lymph nodes) presents with lymph node enlargement that is restricted to the cervical (neck) area. "}, {"url": "http://www.healthline.com/human-body-maps/cervical-lymph-nodes", "passage_text": "Posterior lymph nodes are located along the back of the neck. Deep cervical lymph nodes are associated with their positions adjacent to the internal jugular vein, which runs near the sides of the neck. They are known as the lateral jugular, anterior jugular, and jugulo-digastric lymph nodes. The inferior deep cervical lymph nodes, the juguloomohyoid nodes, and the supraclavicular, or scalene, nodes are considered deep jugular nodes. It is involved in protecting the body against infection, by delivering immune cells, known as lymphocytes, to areas where the immune response has been triggered. There are some 600 to 700 lymph nodes scattered throughout the body."}, {"url": "http://radiopaedia.org/articles/lymph-node-levels-of-the-neck", "passage_text": "Lymph nodes in the neck have been divided into seven levels, generally for the purpose of squamous cell carcinoma staging. This system is not inclusive of several important groups, however, such as the supraclavicular, parotid and retropharyngeal space nodes. "}, {"url": "https://en.wikipedia.org/wiki/Cervical_lymph_nodes", "passage_text": "Structure [edit]. There are approximately 300 lymph nodes in the neck, and they can be classified in many different ways. Commonly used systems have been devised by the American Academy of Otolaryngology and the American Joint Committee on Cancer. One system divides the nodes as follows: 1  Level I: Submental and submandibular nodes. For lymph nodes near the cervix, see external iliac lymph nodes and inguinal lymph nodes."}, {"url": "https://en.wikipedia.org/wiki/Deep_cervical_lymph_nodes", "passage_text": "The deep cervical lymph nodes are a group of cervical lymph nodes found near the internal jugular vein. They can be divided into upper and lower groups, or superior and inferior groups. Alternatively, they can be divided into deep anterior cervical lymph nodes and deep lateral cervical lymph nodes. "}]