[{"url": "http://www.wowhead.com/quest=36679/assault-on-darktide-roost", "passage_text": "Assault the Iron Horde forces at Darktide Roost in Shadowmoon Valley. There's been a resurgence of rylaks on the battlefield in our skirmishes against the Iron Horde. If we don't stop them at the source, we'll quickly lose control of the roads and be pushed back into our outposts. 1 Or, take Azure Water Strider from the coast of Spires of Arak along the southern coast of Shadowmoon Valley until you hit the large island. 2  There are flight paths at both Socrethar’s Rise and Darktide Roost."}, {"url": "http://wow.gamepedia.com/Darktide_Roost", "passage_text": "From Wowpedia. Darktide Roost is a large island located south of Shadowmoon Valley, separated from the mainland by the Darktide Strait. It is a large breeding ground for rylaks, one which the Iron Horde has been exploiting under Grommash's orders, hoping to achieve aerial supremacy in Shadowmoon Valley. To complete the [100 Daily] Assault on Darktide Roost daily, players can kill Iron Horde personnel and the local wildlife, burn banners, or collect rylak eggs. Players can expedite this process by collecting Rylakinator-3000 Power Cells and using them to activate Unmanned Darktide Rylakinator-3000s."}, {"url": "http://eu.battle.net/wow/en/forum/topic/12618276314", "passage_text": "Quest is named Assault on Darktide Roost. I got my progress bar to 100% just like yesterday and hearthstoned to garrison. When I did that, I heard this quest fail sound. After that I flew back to shadowmoon valley to make sure I had the 100% still showing on my bar. "}, {"url": "http://wowwiki.wikia.com/wiki/Darktide_Roost", "passage_text": "Research: Wowhead WoWDB. Darktide Roost is a mountainous island located just off the South shore of Shadowmoon Valley on Draenor. There is a healthy population of Rylak throughout the mountain cliffs, and the Iron Horde have also set up a base of operations on the island. Darktide Roost is a mountainous island located just off the South shore of Shadowmoon Valley on Draenor"}, {"url": "http://www.wowhead.com/quest=35876/garrison-campaign-darktide-roost", "passage_text": "After this one I got Darktide Defender and Shredder Suppressor at the Darktide Roost. After those quests, I got Dirty Rats, then Releasing Rylak & Downsizing the Darktide and finally Rylak Rescue which is a requirement (Darktide Roost) of The Garrison Campaign. You need to have completed: Garrison Campaign: The Ring of Blood. Then one of 12 possible weekly Garrison Campaign series will open up. You receive one every week on a rotation. Edit-as stated below-the Darktide Roost quest line is also required, but this is more obvious as the quest is given to you in your Garrison."}, {"url": "http://warcraft.blizzpro.com/2015/05/18/exploring-draenor-darktide-roost-rares/", "passage_text": "Far to the south, off the coast of Shadowmoon Valley, lies Darktide Roost, the nesting grounds of the Darkwing Rylak s. While the creatures prefer the open ledges and mountaintops of the island, we are interested in what’s underground. Caves honeycomb the interior of Darktide Roost, and each one contains a rare spawn. You will find Slivermaw the rockworm at the lowest level, with a cave entrance at 60,87. Climbing higher is Nagidna the hydra, whose cave lies to the south-west at 59,89."}, {"url": "http://us.battle.net/wow/en/forum/topic/15355107713", "passage_text": "Return to Honor. 13280. So I just completed Darktide Roost (helping Rexxar free the Wrylaks), and when I finished the quest, Rexxar told me to take his dreadraven and meet him on a small island. So I take the flight, turn in the last quest, and then there's just nothing else to do"}, {"url": "http://www.bubblesofmischief.com/2015/02/01/breaching-the-barrier/", "passage_text": "Fly to Darktide Roost in Shadowmoon Valley and kill Demolisionist Megacharge for his explosives cookbook. He’s located on the south-west end of the island (56.9, 93.0). "}]