[{"url": "http://www.gomapper.com/travel/where-is/phuket-located.html", "passage_text": "Phuket is a province with a small population in the country of Thailand which is located in the continent/region of Asia. Its biggest cities and towns include Phuket, Kathu, Amphoe Thalang and Amphoe Muang Thalang. "}, {"url": "http://phuket-holiday-guide.com/where_to_stay_in_phuket.html", "passage_text": "to Stay in Phuket. Something that often takes first time visitors to the island of Phuket by surprise is its size. Its about 50km long by 20km wide and, while there are no really bad areas to stay, some people find that they've booked a hotel too far away from the things that interest them. Near the southern tip of Phuket is the pleasant little tourist village of Rawai. It has a very peaceful atmosphere compared to Patong but still posesses a few restaurants and bars with seaside dining on fresh locally-caught seafood being particularly popular."}, {"url": "https://en.wikipedia.org/wiki/Phuket_Province", "passage_text": ") is one of the southern provinces (changwat) of Thailand. It consists of the island of Phuket, the country's largest island, and another 32 smaller islands off its coast. It lies off the west coast of Thailand in the Andaman Sea. Phuket Island is connected by bridge to Phang Nga Province to the north. The next nearest province is Krabi, to the east across Phang Nga Bay. Phuket Province has an area of 576 square kilometres (222 sq mi), somewhat less than that of Singapore, and is the second-smallest province of Thailand."}, {"url": "http://whereisphuket.com/", "passage_text": "Map of south East Asia. The island of Phuket lies in the Andaman Sea off the South West coast of Thailand in the geographic region of Mainland Southeast Asia which comprises Cambodia, Laos, Burma, Thailand, Vietnam and Peninsular Malaysia. Phuket is separated from the mainland by the Chong Pak Phra channel at its northernmost point, where the Sarasin Bridge connects the island to the mainland. It takes about ten hours to drive the 900 km that separate the island from Bangkok. Neighbouring provinces are Phang Nga and Krabi."}, {"url": "http://www.travelphuket.com/", "passage_text": "An introduction to Phuket. The largest island in Thailand, Phuket is a mountainous province located in the southern tip of the Andaman Sea. It was originally valued by 17th century Dutch and English explorers as a rich source of tin. The resulting mining industry drew thousands of Chinese laborers to the island. Phuket's most popular beaches sit on the western side of the island. These include Patong Beach, Karon Beach, Kata Beach, Kata Noi Beach and Nai Harn and Rawai on the southern tip"}, {"url": "http://www.travelphuket.com/", "passage_text": "Phuket has its own international airport located in the northern end of the island, and a number of major airlines offer daily flights to Phuket. It is also possible to reach Phuket by boat, with a ferries linking Phuket Town and Ko Phi-Phi three times a day. Phuket's most popular beaches sit on the western side of the island. These include Patong Beach, Karon Beach, Kata Beach, Kata Noi Beach and Nai Harn and Rawai on the southern tip"}, {"url": "http://wikitravel.org/en/Phuket_Island", "passage_text": "Phuket is directly connected to the mainland by the Thao Thepkasattri Bridge. From Bangkok, take Highway 4 through Nakhon Pathom, Prachuap Khiri Khan, Chumphon, thence through Ranong Province’s Kra Buri and Kapoe districts, Phang Nga Province’s Takua Pa and Thai Muang districts and onto Phuket Island. Phuket has a busy nightlife, second only to Pattaya among Thailand's beach resorts. Patong is by far the busiest, and seediest, of the lot, but in addition to go-go bars there are also plenty of other bars, discos and clubs."}, {"url": "https://en.wikipedia.org/wiki/Phuket_Province", "passage_text": "Phuket (Thai: ภูเก็ต, [pʰūː.ket]. ) kèt is one of the southern (provinces) changwat Of. Thailand it consists of the island Of, phuket the'country s largest, island and another 32 smaller islands off its. coast Phuket Island is connected by bridge to Phang Nga Province to the north. The next nearest province is Krabi, to the east across Phang Nga Bay. Phuket Province has an area of 576 square kilometres (222 sq mi), somewhat less than that of Singapore, and is the second-smallest province of Thailand."}, {"url": "http://wikitravel.org/en/Phuket_Island", "passage_text": "Phuket Island (pronounced puu get) (gèt) , ภูเก็ต Is 'thailand s largest at 48km in length and 21km at its. Widest'it s In Southern, thailand on the-west Facing Andaman sea, coastline suspended from the southern tip Of Phang Nga province by a pair of short but substantial road. bridges Phuket has a busy nightlife, second only to Pattaya among Thailand's beach resorts. Patong is by far the busiest, and seediest, of the lot, but in addition to go-go bars there are also plenty of other bars, discos and clubs."}]