[{"url": "https://en.wikipedia.org/wiki/Sugar_alcohol", "passage_text": "A sugar alcohol is not alcohol and it is not sugar. These organic compounds are a class of polyols, also called polyhydric alcohol, polyalcohol, alditol or glycitol. As a group, sugar alcohols are not as sweet as sucrose, and they have less food energy than sucrose. Their flavor is like sucrose, and they can be used to mask the unpleasant aftertastes of some high intensity sweeteners."}, {"url": "https://en.wikipedia.org/wiki/Sugar_alcohol", "passage_text": "In commercial foodstuffs, sugar alcohols are commonly used in place of table sugar (sucrose), often in combination with high intensity artificial sweeteners to counter the low sweetness. As a group, sugar alcohols are not as sweet as sucrose, and they have less food energy than sucrose. Their flavor is like sucrose, and they can be used to mask the unpleasant aftertastes of some high intensity sweeteners."}, {"url": "https://www.ynhh.org/services/nutrition/sugar-alcohol.aspx", "passage_text": "Sugar alcohols, also know as polyols, are ingredients used as sweeteners and bulking agents. They occur naturally in foods and come from plant products such as fruits and berries. As a sugar substitute, they provide fewer calories (about a half to one-third less calories) than regular sugar. "}, {"url": "http://www.marksdailyapple.com/sugar-alcohols/", "passage_text": "A sugar alcohol, also known as a polyol, is an interesting type of carbohydrate. Its structure is kind of a hybrid between a sugar molecule and an alcohol molecule (hence the name “sugar alcohol”) and, for the most part, our bodies do a poor job of digesting and breaking down sugar alcohol in the small bowel."}, {"url": "http://www.webmd.com/food-recipes/sugar-alcohols", "passage_text": "Sugar alcohols occur naturally in plant foods in small amounts, such as berries and fruits. Common names for sugar alcohols are erythritol, glycerol, isomalt, lactitol, maltitol, mannitol, sorbitol, xylitol, and hydrogenated starch hydrolysates (HSH). Sugar alcohols are used to sweeten diet foods. They are also used in chewing gums, toothpaste, and mouthwash. People who have diabetes eat foods made with sugar alcohols, because sugar alcohols turn to glucose more slowly and don't cause sudden increases in blood sugar."}, {"url": "http://www.diabetes.org/food-and-fitness/food/what-can-i-eat/understanding-carbohydrates/sugar-alcohols.html", "passage_text": "Sugar alcohols are one type of reduced-calorie sweetener. You can find them in ice creams, cookies, puddings, candies and chewing gum that is labeled as sugar-free or no sugar added.. Sugar alcohols provide fewer calories than sugar and have less of an effect on blood glucose (blood sugar) than other carbohydrates. Examples of sugar alcohol are: 1  Erythritol. 2  Glycerol (also known as glycerin or glycerine). 3  hydrogenated starch hydrolysates. 4  isomalt. 5  lactitol. 6  maltitol. 7  mannitol. 8  sorbitol"}, {"url": "http://www.webmd.com/food-recipes/sugar-alcohols", "passage_text": "Sugar alcohols are a type of sweetener used in foods labeled sugar-free.. You'll find them in chewing gum, sugar-free candies, cookies, soft drinks, and other foods. Sugar alcohols have about one-half to one-third fewer calories than sugar. For example, if a food label doesn't list sugar as an ingredient, but it has 20 grams of sugar alcohol, that is equal to the calories in about 10 grams of sugar. Sugar alcohols are used to sweeten diet foods. They are also used in chewing gums, toothpaste, and mouthwash. People who have diabetes eat foods made with sugar alcohols, because sugar alcohols turn to glucose more slowly and don't cause sudden increases in blood sugar."}, {"url": "http://www.joslin.org/info/what_are_sugar_alcohols.html", "passage_text": "FOLLOW US. The sugar alcohols commonly found in foods are sorbitol, mannitol, xylitol, isomalt, and hydrogenated starch hydrolysates. Sugar alcohols come from plant products such as fruits and berries. The carbohydrate in these plant products is altered through a chemical process"}]