[{"url": "https://simple.wikipedia.org/wiki/Diode", "passage_text": "Diodes can be used to convert alternating current to direct current (Diode bridge). They are often used in power supplies and sometimes to decode amplitude modulation radio signals (like in a crystal radio). Light-emitting diodes (LEDs) are a type of diode that produce light."}, {"url": "http://www.answers.com/Q/What_is_a_diode_used_for", "passage_text": "Confidence votes 12.9K. A diode is used to control current flow in a circuit. A diode has a very high resistance to current flow in one direction and a very low resistance to current flow in the opposite direction."}, {"url": "http://whatis.techtarget.com/definition/diode", "passage_text": "A diode is a specialized electronic component with two electrodes called the anode and the cathode. Most diodes are made with semiconductor materials such as silicon, germanium, or selenium."}, {"url": "http://www.allaboutcircuits.com/textbook/semiconductors/chpt-3/introduction-to-diodes-and-rectifiers/", "passage_text": "A diode is an electrical device allowing current to move through it in one direction with far greater ease than in the other. The most common kind of diode in modern circuit design is the semiconductor diode, although other diode technologies exist."}, {"url": "http://www.answers.com/Q/What_is_a_diode_used_for", "passage_text": "They only allow current to flow in one direction. There are other applications also, such as LED's (Light Emitting Diode) ANSWER: They r … ectify current, they can be used as clamps or voltage limiters they can be used as logic gates and more."}, {"url": "http://www.radio-electronics.com/info/data/semicond/zener-voltage-reference-diodes/applications-circuits.php", "passage_text": "Zener diodes are used in many circuits in a variety of ways. The most common Zener diode circuit is one in which the Zener diode is used as a voltage reference element. This type of circuit uses the constant voltage as a reference in one of a variety of forms of power supply circuit. There are other Zener diode circuits and applications."}, {"url": "http://www.wisegeek.org/what-is-a-diode.htm", "passage_text": "A switching diode is most often used to turn a circuit on or off, and band switching diodes are used for switching high frequency band signals. A Zener diode is known as a constant voltage diode, due to the fact that even if power supply voltage varies, the Zener voltage remains at a constant level."}, {"url": "http://whatis.techtarget.com/definition/diode", "passage_text": "Diodes can be used as rectifiers, signal limiters, voltage regulators, switches, signal modulators, signal mixers, signal demodulators, and oscillators. The fundamental property of a diode is its tendency to conduct electric current in only one direction."}]