[{"url": "http://www.webmd.com/a-to-z-guides/prothrombin-time", "passage_text": "Prothrombin Time and INR. Guide. Prothrombin time (PT) is a blood test that measures how long it takes blood to clot. A prothrombin time test can be used to check for bleeding problems. PT is also used to check whether medicine to prevent blood clots is working. A PT test may also be called an INR test. INR (international normalized ratio) stands for a way of standardizing the results of prothrombin time tests, no matter the testing method. So your doctor can understand results in the same way even when they come from different labs and different test methods."}, {"url": "https://en.wikipedia.org/wiki/Prothrombin_time", "passage_text": "The prothrombin time (PT) — along with its derived measures of prothrombin ratio (PR) and international normalized ratio (INR) — are assays evaluating the extrinsic pathway of coagulation. This test is also called ProTime INR and PT/INR. They are used to determine the clotting tendency of blood, in the measure of warfarin dosage, liver damage, and vitamin K status. PT measures factors I (fibrinogen) , II (prothrombin) , V, VII, and X."}, {"url": "https://labtestsonline.org/understanding/analytes/pt/tab/test", "passage_text": "The international normalized ratio (INR) is a calculation based on results of a PT and is used to monitor individuals who are being treated with the blood-thinning medication (anticoagulant) warfarin (Coumadin®). "}, {"url": "https://healthengine.com.au/info/INR-Test", "passage_text": "INR Test. Share this page: Tweet. The INR is a test of blood clotting, which is primarily used to monitor warfarin therapy, where the aim is to maintain an elevated INR in a certain range eg, 2.0 to 3.0. It is initially checked frequently, but as treatment is stabilised it may be done less often, eg fortnightly"}, {"url": "http://www.allinahealth.org/CCS/doc/Consumer_Lab/49/150398.htm", "passage_text": "International normalized ratio (INR) is a calculation made to standardize prothrombin time. INR is based on the ratio of the patient's prothrombin time and the normal mean prothrombin time. Prothrombin time is a test to learn how fast the blood clots in patients receiving oral anticoagulant medication."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=international_normalized_ratio", "passage_text": "The international normalized ratio (INR) is a standardized number that's figured out in the lab. If you take blood thinners, also called anti-clotting drugs or anticoagulants, it's especially important to check your INR. The INR is figured out using the results of the prothrombin time (PT) test, which measures the time it takes for your blood to clot. These include the method each lab uses to do the test. Even if your test results are different from the normal value, you may not have a problem. To learn what the results mean for you, talk with your health care provider. The INR is a ratio, so it's just a number, not a number tied to time or another value."}, {"url": "http://www.answers.com/Q/What_is_an_INR_blood_test", "passage_text": "This is a test derived from another, the prothrombin ratio. It measures the extrinsic clotting pathway system, commonly used to measure warfarin (blood thinning) drugs. A normal, healthy person will have an INR of 1. In warfarin therapy, an INR is usually aimed for around 2. INR is the international normalized value for prothrombin time. It is a value that measures the extrinsic pathway of clotting, and is often used to determine how quickly the person will make clots. It is often used to determine if the patient is on therapeutic doses of blood thinners"}, {"url": "http://www.medicalhealthtests.com/blood-tests/inr-blood-test.html", "passage_text": "INR blood testing or the International Normalized Ratio is a test that is done in combination with other tests known as the PT or Prothrombin Time and PTT or Partial Thromboplastin Time. "}, {"url": "https://healthengine.com.au/info/INR-Test", "passage_text": "The INR test result is given as a number. There are no units of measurement because the number is a ratio: the ratio of the sample’s Prothrombin Time (PT – a measure of clotting), to the Prothrombin Time of a normal sample of blood. A result of 1.0, up to 1.5, is therefore normal. Share this page: Tweet. The INR is a test of blood clotting, which is primarily used to monitor warfarin therapy, where the aim is to maintain an elevated INR in a certain range eg, 2.0 to 3.0."}]