[{"url": "http://www.indiatimes.com/lifestyle/health-and-fitness/what-do-fats-in-our-body-do-79653.html", "passage_text": "But our bodies also need a certain amount of fat to function, and we can''t make it from scratch. Triglycerides, cholesterol and other essential fatty acids--the scientific term for fats the body can''t make on its own--store energy, insulate us and protect our vital organs. The so-called fat-soluble vitamins--A, D, E and K--are stored in the liver and in fatty tissues. Using a quantitative and systematic approach to study lipids, researchers have classified lipids into eight main categories."}, {"url": "http://www.livescience.com/9109-fats-body.html", "passage_text": "Credit: Tomboy2290 | Dreamstime. It’s common knowledge that too much cholesterol and other fats can lead to disease, and that a healthy diet involves watching how much fatty food we eat. However, our bodies need a certain amount of fat to function—and we can’t make it from scratch. Triglycerides, cholesterol and other essential fatty acids—the scientific term for fats the body can’t make on its own—store energy, insulate us and protect our vital organs. They act as messengers, helping proteins do their jobs"}, {"url": "http://publications.nigms.nih.gov/chemhealth/eat.htm", "passage_text": "But a certain amount of fat is really necessary: All humans need lipids, called essential fatty acids, from food because our bodies can't make them from scratch. Some body fat is also necessary as insulation to prevent heat loss and to protect vital organs from the strain of routine activities. "}, {"url": "http://www.indiatimes.com/lifestyle/health-and-fitness/what-do-fats-in-our-body-do-79653.html", "passage_text": "Fats help the body stockpile certain nutrients as well. The so-called fat-soluble vitamins--A, D, E and K--are stored in the liver and in fatty tissues. Using a quantitative and systematic approach to study lipids, researchers have classified lipids into eight main categories."}, {"url": "http://publications.nigms.nih.gov/insidelifescience/fats_do.html", "passage_text": "It's common knowledge that too much cholesterol and other fats can lead to disease, and that a healthy diet involves watching how much fatty food we eat. However, our bodies need a certain amount of fat to function—and we can't make it from scratch. An imbalance in any step can result in disease, including heart disease and diabetes. For instance, having too many triglycerides in our bloodstream raises our risk of clogged arteries, which can lead to heart attack and stroke. Fats help the body stockpile certain nutrients as well. The so-called fat-soluble vitamins—A, D, E and K—are stored in the liver and in fatty tissues"}, {"url": "http://www.visionlearning.com/en/library/Biology/2/Fats-and-Proteins/62", "passage_text": "Fats in the diet can be converted to other lipids that serve as the main structural material in the membranes surrounding our cells. Fats are also used in the manufacture of some steroids and hormones that help regulate proper growth and maintenance of tissue in the body. "}, {"url": "http://publications.nigms.nih.gov/insidelifescience/fats_do.html", "passage_text": "Triglycerides, cholesterol and other essential fatty acids—the scientific term for fats the body can't make on its own—store energy, insulate us and protect our vital organs. An imbalance in any step can result in disease, including heart disease and diabetes. For instance, having too many triglycerides in our bloodstream raises our risk of clogged arteries, which can lead to heart attack and stroke. Fats help the body stockpile certain nutrients as well. The so-called fat-soluble vitamins—A, D, E and K—are stored in the liver and in fatty tissue"}, {"url": "http://healthyeating.sfgate.com/lipids-stored-body-5236.html", "passage_text": "Lipids such as cholesterol, cholesteryl esters and triglycerides are stored in your body primarily in specialized fat cells called adipocytes, which comprise a specialized fatty tissue called adipose tissue. Stored lipids can be derived from the lipids in your diet or from lipids that your body synthesizes. Adipocytes have an almost unlimited capacity to store lipids in cell organelles called lipid droplets, which can grow to a very large size."}, {"url": "http://www.answers.com/Q/How_does_the_body_use_lipids_or_fats", "passage_text": "Fats serve as an insulation material to allow body heat to be conserved and fats line and protect delicate internal organs from physical damage. Fats in the diet can be converted to other lipids that serve as the main structural material in the membranes surrounding our cells. Fats are also used in the manufacture of some steroids and hormones that help regulate proper growth and maintenance of tissue in the body. 2 people found this useful. "}]