[{"url": "https://en.wikipedia.org/wiki/HPV_vaccine", "passage_text": "Both vaccines protect against the two HPV types (HPV-16 and HPV-18) that cause 70% of cervical cancers, 80% of anal cancers, 60% of vaginal cancers, and 40% of vulvar cancers. Gardasil also protects against the two HPV types (HPV-6 and HPV-11) that cause 90% of genital warts. Both vaccines have been shown to prevent precancerous lesions of the cervix. Gardasil has been shown to prevent precursors to anal, vulvar, vaginal, and penile cancers."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/24662710", "passage_text": "RESULTS: The current HPV vaccination programme has an estimated cost-effectiveness of NZ$18,800/QALY gained (about US$9700/QALY gained using the OECD's purchasing power parities; 95% UI: US$6900 to $33,700) compared to the status quo in NZ prior to 2008 (no vaccination, screening alone). Cost-effectiveness and equity impacts of three HPV vaccination programmes for school-aged girls in New Zealand. Blakely T(1), Kvizhinadze G(2), Karvonen T(3), Pearson AL(2), Smith M(4), Wilson N(2). Author information: (1)Department of Public Health, University of Otago, Wellington,"}, {"url": "https://en.wikipedia.org/wiki/HPV_vaccine", "passage_text": "Current preventive vaccines protect against the two HPV types (16 and 18) that cause about 70% of cervical cancers worldwide. Because of the distribution of HPV types associated with cervical cancer, the vaccines are likely to be most effective in Asia, Europe and North America. Gardasil also protects against the two HPV types (HPV-6 and HPV-11) that cause 90% of genital warts. Both vaccines have been shown to prevent precancerous lesions of the cervix. Gardasil has been shown to prevent precursors to anal, vulvar, vaginal, and penile cancers."}, {"url": "http://www.cancercouncil.com.au/1060/cancer-information/cancer-risk-and-prevention/screening-and-early-detection/cervical-cancer-vaccine-fact-sheet/", "passage_text": "The HPV vaccine currently available in Australia is called Gardasil. This vaccine prevents infection with HPV types 16, 18, 6 and 11. HPV 16 and 18 are responsible for the majority (70% internationally; 80% in Australia) of cervical cancers. HPV 6 and 11 are responsible for 90% of genital warts. Having the vaccine will protect those who have never been exposed to these types of HPV."}, {"url": "http://www.bmj.com/content/339/bmj.b3884", "passage_text": "Population Girls and boys aged 12 years. Interventions HPV vaccination of girls alone and of girls and boys in the context of screening for cervical cancer. Main outcome measure Incremental cost effectiveness ratios, expressed as cost per quality adjusted life year (QALY) gained. Objective To assess the cost effectiveness of including preadolescent boys in a routine human papillomavirus (HPV) vaccination programme for preadolescent girls. Design Cost effectiveness analysis from the societal perspective. Setting United States."}, {"url": "http://www.hpvvaccine.org.au/the-hpv-vaccine/cost.aspx", "passage_text": "How much does it cost? The HPV vaccine is provided free in schools for girls and boys aged 12–13 years as part of the National HPV Vaccination Program. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/17931529", "passage_text": "The cost per LY of vaccinating boys and girls was $92 052 and the cost per QALY was $33 644. The cost per LY of implementing a catch-up vaccination program ranged from $45 652 ($16 727 per QALY) for extending vaccination to 14-year-olds to $78 702 ($34 536 per QALY) for 26-year-olds. CONCLUSIONS: These results suggest that adding an HPV vaccine to Australia's current screening regimen is a potentially cost-effective way to reduce cervical cancer and the clinical interventions that are currently associated with its prevention via screening alone."}, {"url": "http://well.blogs.nytimes.com/2013/04/18/hpv-vaccine-showing-successes-in-australia/", "passage_text": "Australia’s program, which started in 2007, offers free HPV vaccination to girls who are 12 and 13 years old, and catch-up programs for girls and women under 26. The vaccine protects against genital warts as well as cancers of the cervix, head and neck. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/17931529", "passage_text": "BACKGROUND: The cost-effectiveness of adding a human papillomavirus (HPV) vaccine to the Australian National Cervical Screening Program compared to screening alone was examined. METHODS: A Markov model of the natural history of HPV infection that incorporates screening and vaccination was developed. CONCLUSIONS: These results suggest that adding an HPV vaccine to Australia's current screening regimen is a potentially cost-effective way to reduce cervical cancer and the clinical interventions that are currently associated with its prevention via screening alone."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/17931529", "passage_text": "A cost-effectiveness analysis of adding a human papillomavirus vaccine to the Australian National Cervical Cancer Screening Program. Kulasingam S(1), Connelly L, Conway E, Hocking JS, Myers E, Regan DG, Roder D, Ross J, Wain G. Author information: CONCLUSIONS: These results suggest that adding an HPV vaccine to Australia's current screening regimen is a potentially cost-effective way to reduce cervical cancer and the clinical interventions that are currently associated with its prevention via screening alone."}]