[{"url": "http://inspectapedia.com/heat/Aquastat_Settings.php", "passage_text": "Here we explain how to choose the best settings for a heating boiler aquastat-the combination control that sets boiler temperature and may also control hot water production via a tankless coil on the heating boiler. Rule of Thumb for Setting HI LO DIFF on an Aquastat. Or more commonly, we were taught to just use a rule of thumb which set the. 1  HI to 180 °F (should be 200F or lower). 2  a HI-DIFF value is hard-wired in the R8182 series type aquastats, is not adjustable, and no control dial is provided."}, {"url": "http://www.inspectapedia.com/heat/Aquastats.php", "passage_text": "1 AQUASTAT CONTROL-home-CONTENTS: Guide to the functions of a typical heating boiler combination control aquastat like the Honeywell R8182D, the Honeywell L8124A, and the Honeywell L8151A. Here is a link to detailed for the HONEYWELL L6006A AQUASTAT Installation & Operating Instructions [PDF]. Continue reading at AQUASTAT HI LO DIFF SETTINGS that explains the best settings to use & how & when to disable the LOW & DIFF controls or select a topic from the More Reading links shown below."}, {"url": "http://www.homedepot.com/p/Honeywell-Aquastat-Controller-L4006A1967-U/100346947", "passage_text": "The Honeywell Aquastat Controller is an immersion-type device for limiting or regulating the temperature of liquids in boilers, storage tanks and other applications where temperature control is required. "}, {"url": "https://en.wikipedia.org/wiki/Aquastat", "passage_text": "An aquastat is a device used in hydronic heating systems for controlling water temperature. If the thermostat is calling for heat, the boiler will fire until the high limit is reached, then shut off (even if the thermostat is still calling for heat). The boiler will re-fire if the boiler water temperature drops below a range around the high limit. The high limit exists for the sake of efficiency and safety."}, {"url": "http://www.supplyhouse.com/Aquastats-Wells-350000", "passage_text": "More About Aquastats & Wells. An aquastat is a device used to control water temperature in hydronic heating systems. It has both high and low limit temperature controls to prevent boilers from firing too frequently. We offer competitive pricing and our huge inventory of Honeywell Aquastats and Honeywell Aquastat Wells ensures that most models are in stock and ready to ship within 24-48 hours. If there is a model that you are looking for but can't find, give us a call or send us an e-mail and we'll find it for you. close."}, {"url": "http://www.inspectapedia.com/heat/Aquastats.php", "passage_text": "How to buy, replace, install, set-up, & wire heating system aquastat controls. 1  AQUASTAT CONTROL-home-CONTENTS: Guide to the functions of a typical heating boiler combination control aquastat like the Honeywell R8182D, the Honeywell L8124A, and the Honeywell L8151A. 2  Installation Manuals. Here is a link to detailed for the HONEYWELL L6006A AQUASTAT Installation & Operating Instructions [PDF]. Continue reading at AQUASTAT HI LO DIFF SETTINGS that explains the best settings to use & how & when to disable the LOW & DIFF controls or select a topic from the More Reading links shown below."}, {"url": "http://www.doityourself.com/stry/boiler-aquastat-control", "passage_text": "The boiler aquastat control device is used to regulate the temperature of water in your boiler and operate the pump that circulates hot water in the heating system. The way in which the boiler aquastat operates is the same way in which device that controls pressure for a boiler that is powered by steam. It also works in a similar manner as the limit control device for a forced air furnace system. The boiler aquastat has a heat sensing element that is filled. This element allows the device to switch on and off automatically and is designed to notice when the water temperature in the boiler rises and falls. If function of the aquastat is to control the boiler temperature, is closes whenever the internal temperature falls and correspondingly opens when the temperature inside the boiler increases. The aquastat closes when the circulator is in operation as the internal temperature increase."}, {"url": "http://www.inspectapedia.com/heat/Aquastats.php", "passage_text": "1 Combination control or primary control on heating boilers: this control, such as a Honeywell R8182D combine High Limit and Low Limit boiler controls (The dial marked low limit on a combination control may or may not be in use depending on presence of a tankless coil). Here is a link to detailed for the HONEYWELL L6006A AQUASTAT Installation & Operating Instructions [PDF]. Continue reading at AQUASTAT HI LO DIFF SETTINGS that explains the best settings to use & how & when to disable the LOW & DIFF controls or select a topic from the More Reading links shown below."}, {"url": "http://www.pexuniverse.com/honeywell-aquastats", "passage_text": "Aquastat is a Honeywell’s registered trademark and is a device used for temperature control in hydronic heating systems. High limit aquastats regulate boiler burners operation when thermostat call for heat. "}, {"url": "http://www.boehmerheating.com/blog/heating/what-is-an-aquastat/", "passage_text": "An aquastat is a device installed in hydronic water systems for the purpose of controlling temperature within the boiler. An aquastat is similar to the furnace limit switch in operation, maintaining a safe operating temperature for the central heating unit. Despite the name, most boilers are not actually meant to boil water. Doing so would result in steam, and a dangerous buildup of pressure in a system that is not designed for it. For this reason, the aquastat shuts off the boiler when it reaches the high temperature limit."}]