[{"url": "https://en.wikipedia.org/wiki/Humphry_Davy", "passage_text": "Sir Humphry Davy, 1st Baronet (17 December 1778 – 29 May 1829) was a Cornish chemist and inventor. He is best remembered today for his discoveries of several alkali and alkaline earth metals, as well as contributions to the discoveries of the elemental nature of chlorine and iodine. Davy's indenture is dated 10 February 1795. In the apothecary 's dispensary, Davy became a chemist, and a garret in Tonkin's house was where he conducted his earliest chemical experiments. Davy's friends said: This boy Humphry is incorrigible."}, {"url": "http://www.famousscientists.org/humphry-davy/", "passage_text": "Sir Humphry Davy, widely considered to be one of the greatest chemists and inventors that Great Britain has ever produced, is highly regarded for his work on various alkali and alkaline earth metals, and for his valuable contributions regarding the findings of the elemental nature of chlorine and iodine. Advertisements. Early Life and Education: Humphry was born on December 17, 1778 at Penzance, Cornwall to a wood carver. He was naturally a gifted and sharp boy who could write impressive fiction and poetry. At sixteen, he lost his father."}, {"url": "https://en.wikipedia.org/wiki/Humphry_Davy", "passage_text": "1 Penzance also has a secondary school named Humphry Davy School. 2  Similar to James Prescott Joule and Isaac Newton, Davy is also remembered in his hometown by a pub – The Sir Humphry Davy at 32 Alverton Street, west of the Market House. Davy's indenture is dated 10 February 1795. In the apothecary 's dispensary, Davy became a chemist, and a garret in Tonkin's house was where he conducted his earliest chemical experiments. Davy's friends said: This boy Humphry is incorrigible."}, {"url": "http://spartacus-educational.com/SCdavy.htm", "passage_text": "Humphry Davy. Humphry Davy, a woodcarver's son, was born in Penzance in 1778. After being educated in Truro, Davy was apprenticed to a Penzance surgeon. In 1797 he took up chemistry and was taken on by Thomas Beddoes, as an assistant at his Medical Pneumatic Institution in Bristol. Here he experimented with various new gases and discovered the anesthetic effect of laughing gas (nitrous oxide). Davy was now considered to be Britain's leading scientist and in 1812 was knighted by George III. His biographer, David Knight, wrote: On 8 April 1812 Davy was knighted by the prince regent, and on the 11th he and Jane Apreece were married by the bishop of Carlisle at Jane's mother's house in Portland Place."}, {"url": "https://en.wikiquote.org/wiki/Humphry_Davy", "passage_text": "Sir Humphry Davy (17 December, 1778 – 29 May, 1829), often incorrectly spelled Humphrey, was a Cornish chemist who discovered several chemical elements and studied the human body's response to electricity. "}, {"url": "http://www.bbc.co.uk/history/historic_figures/davy_humphrey.shtml", "passage_text": "Sir Humphry Davy © Davy was a British chemist best known for his experiments in electro-chemistry and his invention of a miner's safety lamp. Humphry Davy was born on 17 December 1778 in Penzance in Cornwall. He was apprenticed to a surgeon and aged 19 went to Bristol to study science. There he investigated gases. He prepared and inhaled nitrous oxide (laughing gas) and in 1800 published the results of his work in 'Researches, Chemical and Philosophical'."}, {"url": "http://famouschemists.org/humphry-davy/", "passage_text": "Davy was born on December 17th, 1778 in Penzance, Cornwall, England. He received his education in Penzance and Truro. In 1794, he lost his father and in an effort to support his family, he became an apprentice to J.Binghan Borlase, a surgeon. First Electric Light. In 1809, Humphry Davy invented the very first electric light. He did this by connecting two wires to a single battery and then attatching a charcoal strip between the other two ends of the wires. The charged carbon then glowed, making the very first arc lamp."}, {"url": "http://famouschemists.org/humphry-davy/", "passage_text": "Sir Humphry Davy was a great English chemist and inventor who is best remembered for his discoveries of many alkali and alkaline earth metals. He also helped to better understand the properties of iodine and chlorine. First Electric Light. In 1809, Humphry Davy invented the very first electric light. He did this by connecting two wires to a single battery and then attatching a charcoal strip between the other two ends of the wires. The charged carbon then glowed, making the very first arc lamp."}, {"url": "http://www.biography.com/people/humphry-davy-9268399", "passage_text": "Humphry Davy was a British chemist best known for his contributions to the discoveries of chlorine and iodine and for his invention of the Davy lamp, a device that greatly improved safety for miners in the coal industry. Early Life. Englishman Humphry Davy was born on December 17, 1778, in Penzance, Cornwall, to middle-class parents. He was well educated, but he was also naturally intelligent and curious, and those traits often manifested in fiction and poetry he wrote at an early age."}, {"url": "http://www.corrosion-doctors.org/Biographies/DavyBio.htm", "passage_text": "Sir Humphry Davy (1778-1829). Humphry Davywas born on December 17, 1778 in Penzance, Cornwall, England. He received his education in Penzance and in Truro. His father died in 1794, and Davy, in an effort to help support his family, became an apprentice to a surgeon-apothecary. "}]