[{"url": "http://www.landlordzone.co.uk/forums/showthread.php?4428-Accelerated-possession-procedure-how-long", "passage_text": "How long does the this procedure take? Having served notice under section 21 I anticipate having to submit forms N5B to the court on 18th February How long do they take to grant possession order and tell tenants to get out. After that, assuming the worst, how long to get court bailiffs to evict the tenants. Any advice appreciated. 12-12-2006, 22:06 PM #2."}, {"url": "http://www.evictions-southeast.co.uk/fastest-way-evict-tenant.htm", "passage_text": "If the tenant fails to vacate the property within the period specified by the Accelerated Possession Order, you can apply to the Court for a warrant for bailiffs to evict the tenant on your behalf. The possession order will normally take effect two weeks after the decision unless the court decides that this would cause the tenant exceptional hardship. In that case, the judge may delay the order for up to six weeks."}, {"url": "http://www.landlordlawblog.co.uk/2010/03/29/urban-myth-using-accelerated-possession-procedure-is-really-quic/", "passage_text": "Section 21 notices. For a start, before you can use the accelerated procedure at all, you need to have served an notice seeking possession on the tenant under section 21 of the Housing Act 1988. The minimum notice period you can give is two months. When the Judge does this will depend on how quickly he does his ‘box work’. This may vary depending on how busy the court is. However in my experience, assuming all goes well, you can expect to get the order back in the post about six to ten weeks after posting off the application."}, {"url": "https://www.gov.uk/private-renting-evictions/accelerated-possession", "passage_text": "Even if there’s a hearing, the court can still decide to issue a possession order. If the judge makes a possession order, you’ll normally have 14 or 28 days to leave the property. If this will cause you exceptional hardship, the judge may give you up to 42 days to leave. If you don’t leave at this point, your landlord can use bailiffs to evict you."}, {"url": "http://www.evictions-southeast.co.uk/fastest-way-evict-tenant.htm", "passage_text": "The accelerated possession procedure enables landlords to bypass the usual Court hearing and, assuming the paperwork is correct, it is usually possible to obtain an Accelerated Possession Order demanding that the tenant vacate the property within a period set by the Court which is usually 14 days. The possession order will normally take effect two weeks after the decision unless the court decides that this would cause the tenant exceptional hardship. In that case, the judge may delay the order for up to six weeks."}, {"url": "http://www.landlordlawblog.co.uk/2010/03/29/urban-myth-using-accelerated-possession-procedure-is-really-quic/", "passage_text": "The accelerated possession procedure. The procedure is called accelerated because in most cases the Judge makes the order based on the paperwork, without the need for a court hearing. When the Judge does this will depend on how quickly he does his ‘box work’. This may vary depending on how busy the court is. However in my experience, assuming all goes well, you can expect to get the order back in the post about six to ten weeks after posting off the application."}, {"url": "http://www.evictions-southeast.co.uk/fastest-way-evict-tenant.htm", "passage_text": "This is not uncommon, and even at the end of a fixed term tenancy the landlord is still required by law to serve legal notice on the tenant requiring them to leave the property! In most cases if a tenant does not vacate the property the fastest way to evict a tenant is to obtain a court order for Accelerated Possession. The possession order will normally take effect two weeks after the decision unless the court decides that this would cause the tenant exceptional hardship. In that case, the judge may delay the order for up to six weeks."}, {"url": "https://www.gov.uk/private-renting-evictions/accelerated-possession", "passage_text": "How it works. If your landlord applies to the court for accelerated possession, the court will send you a copy of the application. If you want to challenge the application, you must do this within 14 days of receiving it. If the judge makes a possession order, you’ll normally have 14 or 28 days to leave the property. If this will cause you exceptional hardship, the judge may give you up to 42 days to leave. If you don’t leave at this point, your landlord can use bailiffs to evict you."}]