[{"url": "http://www.livestrong.com/article/490948-does-oxygen-leave-muscles-during-exercise/", "passage_text": "Photo Credit DAJ/amana images/Getty Images. Your muscles need oxygen to produce energy in a process called cellular respiration. The energy is used to fuel muscle contractions. Exercise increases your muscles' need for energy and thus more oxygen is delivered to your muscles. Once oxygen is delivered to your muscles, it doesn't leave your muscle cells but is converted to other molecules. Exercise. Exercise increases the work load of your muscles. This increases the energy need and ATP production rate in your muscle cells. Your breathing rate will increase when you exercise to ensure that enough oxygen is delivered to your muscles to keep up constant ATP production."}, {"url": "https://en.wikipedia.org/wiki/Cellular_waste_product", "passage_text": "Cellular waste products are formed as a by-product of cellular respiration, a series of processes and reactions that generate energy for the cell, in the form of ATP. Two examples of cellular respiration creating cellular waste products are aerobic respiration and anaerobic respiration. When in the presence of oxygen, cells use aerobic respiration to obtain energy from glucose molecules. Simplified Theoretical Reaction: C 6 H 12 O 6 (aq) + 6O 2 (g) → 6CO 2 (g) + 6H 2 O (l) + ~ 30ATP."}, {"url": "http://www.metabolics.com/blog/how-does-the-body-produce-energy/", "passage_text": "How The Body Produces Energy. 1) Aerobic Respiration (or cellular respiration) The energy your body requires just to live, do everyday activities and cardio exercise such as long distance running, is generated by a sugar burning process in the bodies cells known as aerobic respiration. This is the process by which a cell uses oxygen to burn glucose and make ATP. There are 4 parts to this; 1  Glycolysis – Occurs in the cytoplasm This produces 4 ATP and 2 NADH, from Glucose (from sugar foods or carbohydrates) but uses 2 ATP to get there-so results in 2 ATP + 2 NADH and Pyruvate."}, {"url": "https://en.wikipedia.org/wiki/Cellular_waste_product", "passage_text": "Fermentation is another process by which cells can extract energy from glucose. It is not a form of cellular respiration, but it does generate ATP, break down glucose, and produce waste products. Fermentation, like aerobic respiration, begins by breaking glucose into two pyruvate molecules. When in the presence of oxygen, cells use aerobic respiration to obtain energy from glucose molecules. Simplified Theoretical Reaction: C 6 H 12 O 6 (aq) + 6O 2 (g) → 6CO 2 (g) + 6H 2 O (l) + ~ 30ATP."}, {"url": "http://www.7bscience.com/uploads/4/7/3/3/473362/photosynthesis_respiration_answers.pdf", "passage_text": "7 Fermentation releases energy for the cell without using oxygen. • Fermentation is the process by which cells release energy without using oxygen. Recall that in cellular respiration the cell first breaks glucose into smaller molecules. This releases a small amount of energy. • Cells can release energy in two basic processes: cellular respiration and fermentation. Cellular respiration requires oxygen, while fermentation does not. In addition, cellular respiration releases much more usable energy than does fermentation. Cellular respiration releases energy for the cell."}, {"url": "https://en.wikipedia.org/wiki/Cellular_waste_product", "passage_text": "Cells undergoing aerobic respiration produce 6 molecules of carbon dioxide, 6 molecules of water, and up to 30 molecules of ATP (adenosine triphosphate), which is directly used to produce energy, from each molecule of glucose in the presence of surplus oxygen. When in the presence of oxygen, cells use aerobic respiration to obtain energy from glucose molecules. Simplified Theoretical Reaction: C 6 H 12 O 6 (aq) + 6O 2 (g) → 6CO 2 (g) + 6H 2 O (l) + ~ 30ATP."}, {"url": "http://sciencelearn.org.nz/Contexts/Sporting-Edge/Looking-closer/Energy-for-exercise", "passage_text": "The source of energy that is used to power the movement of contraction in working muscles is adenosine triphosphate (ATP) – the body’s biochemical way to store and transport energy. However, ATP is not stored to a great extent in cells. So once muscle contraction starts, the making of more ATP must start quickly. "}, {"url": "https://www.wyzant.com/resources/lessons/science/biology/cellular-respiration", "passage_text": "Just like we need energy to get through the day, individual cells need energy for survival too. Cellular respiration is the process by which cells get their energy in the form of ATP. There are two types of cellular respiration, aerobic and anaerobic. Aerobic respiration is more efficient and can be utilized in the presence of oxygen, while anaerobic respiration does not require oxygen."}, {"url": "https://en.wikipedia.org/wiki/Cellular_respiration", "passage_text": "Cellular respiration is the set of metabolic reactions and processes that take place in the cells of organisms to convert biochemical energy from nutrients into adenosine triphosphate (ATP), and then release waste products. "}]