[{"url": "http://www.jstor.org/stable/256169", "passage_text": "Concern will be only with the concepts of strategy enclosed within the dotted line of Figure 1-corporate-level strategy and business-level stra-tegy. Corporate level strategy is conceived in terms of variation in the portfolio of industries in which a firm does business."}, {"url": "http://www.quickmba.com/strategy/levels/", "passage_text": "Hierarchical Levels of Strategy Strategy can be formulated on three different levels: corporate level business unit level functional or departmental level. While strategy may be about competing and surviving as a firm, one can argue that products, not corporations compete, and products are developed by business units."}, {"url": "http://nconyerscis4980.wikispaces.com/file/view/4+Ch+4+Quiz+key+Posted.doc", "passage_text": "5. Business-level strategies are concerned specifically with. a. creating differences between the firm’s position and its competitors. b. selecting the industries in which the firm will compete. c. how functional areas will be organized within the firm."}, {"url": "http://www.quickmba.com/strategy/levels/", "passage_text": "Many managers consider the business level to be the proper focus for strategic planning. Corporate Level Strategy Corporate level strategy fundamentally is concerned with the selection of businesses in which the company should compete and with the development and coordination of that portfolio of businesses."}, {"url": "http://www.quickmba.com/strategy/levels/", "passage_text": "Corporate Level Strategy. Corporate level strategy fundamentally is concerned with the selection of businesses in which the company should compete and with the development and coordination of that portfolio of businesses."}, {"url": "http://www.simply-strategic-planning.com/corporate-level-strategy.html", "passage_text": "Business-level strategies look at the business unit strengths, weaknesses, opportunities, and threats; much like corporate-level strategies, except the emphasis in business-level strategies is on the specific product or service, not on the corporate level investment portfolio."}, {"url": "http://www.referenceforbusiness.com/management/Sc-Str/Strategy-Levels.html", "passage_text": "A convenient way to classify levels of strategy is to view corporate-level strategy as responsible for market definition, business-level strategy as responsible for market navigation, and functional-level strategy as the foundation that supports both of these (see Table 1)."}, {"url": "http://www.quickmba.com/strategy/levels/", "passage_text": "Corporate level strategy is concerned with: Reach-defining the issues that are corporate responsibilities; these might include identifying the overall goals of the corporation, the types of businesses in which the corporation should be involved, and the way in which businesses will be integrated and managed."}, {"url": "http://www.referenceforbusiness.com/management/Sc-Str/Strategy-Levels.html", "passage_text": "Strategies for an organization may be categorized by the level of the organization addressed by the strategy. Corporate-level strategies involve top management and address issues of concern to the entire organization. Business-level strategies deal with major business units or divisions of the corporate portfolio."}, {"url": "http://smallbusiness.chron.com/five-types-business-level-strategies-781.html", "passage_text": "A common business-level strategy is the coordination of all individual unit activities found in a business. Unit activities may be broken down by department, sections of the department and individual job positions."}]