[{"url": "http://work.chron.com/long-should-answer-interview-17346.html", "passage_text": "If you don't feel like you can give a complete interview answer in 60 seconds, shoot for a 90-second answer. Some behavioral questions, such as describing how you might handle a difficult situation with a co-worker or ways you might contribute to a team project require extended details and analyses. Rehearsing answers to common interview questions can help you prepared so you don't get rattled and ramble too long about irrelevant details. A hiring manager will likely ask open-ended questions that don't have simple yes or no answers, so take time to answer them thoroughly."}, {"url": "http://www.ehow.com/info_8625561_long-should-interview-last.html", "passage_text": "If you're going to your first professional interview, or haven't been to one in a while, you might be wondering how long it will last. The person doing the interviewing will obviously guide the interview and determine how much time it will take. If you're the job candidate, you probably won't know exactly how long the interview will take, but in many cases, the interviewer may not know, either. The type of interview may affect its length."}, {"url": "http://www.askamanager.org/2014/05/how-long-should-interviews-last.html", "passage_text": "In-person interviews should usually be an absolute minimum of 45 minutes and ideally 60 minutes or more, to ensure that you can truly talk in-depth and that the candidate has time to ask their own questions. And that’s assuming that it’s one of multiple meetings in the process. Last week I had a two hour interview – four 30 minute one on ones, one right after the other. It was a little disconcerting, especially in terms of understanding the role of each person that I spoke to, but if I had a question that I forgot to ask I always had another chance and that was nice."}, {"url": "https://answers.yahoo.com/question/index?qid=20080821221825AAXWwtI", "passage_text": "How long should my responses be during an interview? I have an interview tomorrow, and I'm so nervous that I'm awake and rehearsing answers to questions I think might come up. I realized that some of them are short. Any... show more"}, {"url": "https://answers.yahoo.com/question/index?qid=20080821221825AAXWwtI", "passage_text": "Don't be so nervous about an interview. When I interview people that I can tell are really nervous I tell them not to be, I'm not gonna ask them something they can't answer because I'm gonna ask you questions about you and what your capable of. Any... show more I have an interview tomorrow, and I'm so nervous that I'm awake and rehearsing answers to questions I think might come up. I realized that some of them are short."}, {"url": "http://www.answers.com/Q/HOW_long_should_a_job_interview_last", "passage_text": "1 Finding out about you, the interviewee, though your answers to interview questions -- about 30 minutes. 2  Answering any interview questions you have and telling you more about the job -- 10 to 15 minutes. SHOULD'sBe well prepared and be yourself. Depending on how important this job is to you, do a bit of research about the company so you are more familiar with it's … history, product and other bits of info, even some fun bits of trivia."}, {"url": "https://answers.yahoo.com/question/index?qid=20090116164343AAF4gWD", "passage_text": "Usually a short answer should be no more than 3-4 sentences. The length of essay questions can vary pretty widely depending on how many questions there are on the test and how many are essay questions. Usually short answers means a paragraph or at least several sentences and an essay could require (depending on the class) between a page and a half to four pages. It's always best to ask the professor how much previous students have written that made good grades."}, {"url": "http://work.chron.com/long-should-answer-interview-17346.html", "passage_text": "60-Second Answer. You can usually respond to an interview question in 60 seconds or less. If the interviewer wants you to expound on your answer, he can ask a follow-up question or ask you to proceed with more details. Answers that are 60 seconds or less involve the interviewer because you don't have time to dominate the conversation; he must respond to your comments or ask new questions. Rehearsing answers to common interview questions can help you prepared so you don't get rattled and ramble too long about irrelevant details. A hiring manager will likely ask open-ended questions that don't have simple yes or no answers, so take time to answer them thoroughly."}, {"url": "http://www.answers.com/Q/HOW_long_should_a_job_interview_last", "passage_text": "You should relish this question and be eager to answer it! If you  are not, then you are completely unprepared for the interview.    This is one of those questions peo … ple find tricky at interviews. SHOULD'sBe well prepared and be yourself. Depending on how important this job is to you, do a bit of research about the company so you are more familiar with it's … history, product and other bits of info, even some fun bits of trivia."}]