[{"url": "http://www.finweb.com/insurance/mortgage-insurance-fraud-make-sure-you-re-not-committing-it.html", "passage_text": "The insurance company issues a policy based on the fact that it believes the loan was made in good faith, and that all information and documentation related to the loan-was accurate and truthful. If it is not, that constitutes mortgage insurance fraud. While there are some homeowners that willingly and knowingly provide false or inaccurate information to home loan lenders, for the purposes of obtaining a home mortgage loan."}, {"url": "http://www.finweb.com/insurance/mortgage-insurance-fraud-make-sure-you-re-not-committing-it.html", "passage_text": "How to Avoid Mortgage Insurance Fraud. When applying for a home mortgage, you may use a mortgage broker. The vast majority of mortgage brokers are ethical and professional in the way they conduct their businesses; however, there are those that are not."}, {"url": "http://www.finweb.com/insurance/mortgage-insurance-fraud-make-sure-you-re-not-committing-it.html", "passage_text": "How Mortgage Fraud Is Committed. Mortgage insurance fraud is committed: when the borrower or his/her agent provides fraudulent, inaccurate or untruthful information to the home loan lender for the purposes of obtaining a home mortgage loan."}, {"url": "http://dailybail.com/home/new-from-anonymous-mortgage-insurance-fraud-101-how-banks-ri.html", "passage_text": "Recently, the ex-BofA employee put together a post called Insurance Fraud 101, which explains in great detail how the force-placed insurance scams work. Basically, the servicer does everything possible to screw you over, even when you've done everything right and made every single payment on time."}, {"url": "https://www.texasattorneygeneral.gov/cpd/mortgage-fraud", "passage_text": "Mortgage fraud is a criminal offense and primarily involves fraud against mortgage lenders. Generally speaking, it occurs when facts are misrepresented: the value of a house is inflated, or the lender is misled about the buyer's income, credit history or financial situation."}, {"url": "http://www.classaction.org/private-mortgage-insurance", "passage_text": "PMI is extra insurance that lenders require from most homebuyers who obtain loans that are more than 80 percent of the home's value. In other words, buyers with less than a 20 percent down payment are normally required to pay PMI."}, {"url": "http://www.finweb.com/insurance/mortgage-insurance-fraud-make-sure-you-re-not-committing-it.html", "passage_text": "When buying a home, you may be required to purchase personal mortgage insurance; when you do, make sure you're not committing mortgage insurance fraud-and don't know it. Mortgage insurance fraud occurs when you receive a mortgage, using information or documentation that is purposefully inaccurate or untruthful."}, {"url": "http://www.mortgagebankinginsurance.com/c_mortfraud.html", "passage_text": "If a loan defaults and an investor discovers the loan was originated fraudulently, the investor is going to require you to repurchase the loan. Mortgage Fraud Insurance, also known as Reps & Warranty Insurance For Loan Repurchase, was developed to protect originators from such a large out of pocket expense."}, {"url": "http://www.dfs.ny.gov/insurance/frauds/fd7repoc.htm", "passage_text": "Insurance fraud is a crime. And far from being a victimless crime, insurance fraud victimizes every resident of New York State, costing consumers millions of dollars in the form of increased premiums and higher prices for goods and services."}]