[{"url": "http://www.ncbi.nlm.nih.gov/gene/1956/", "passage_text": "1 Epidermal growth factor receptor (EGFR) is a transmembrane receptor tyrosine kinase involved in the signaling pathways that regulate cell proliferation, apoptosis, angiogenesis, and invasion. 1 TPA-induced AP-1 activation requires EGFR protein, but not EGFR tyrosine kinase and EGFR autophosphorylation at tyrosine(1173), whereas both EGFR tyrosine kinase and EGFR autophosphorylation at Y(1173) play a critical role in EGF-induced AP-1 activation."}, {"url": "http://www.apexbt.com/research-area/tyrosine-kinase/egfr.html", "passage_text": "EGFR. EGFR (epidermal growth factor receptor) is the cell-surface receptor of its specific ligands, including epidermal growth factor and TGFα (transforming growth factor α) and is a receptor tyrosine kinase. Research Area."}, {"url": "https://labtestsonline.org/understanding/analytes/egfr-her1/tab/sample", "passage_text": "Receptor tyrosine kinases like EGFR transmit signals from the surface of the cell to within the cell. In normal cells, the binding of epidermal growth factor to its receptor on the cell surface is an important signal that promotes cell proliferation. Receptors recognize and bind to other substances, and the binding typically has a specific effect on the cells. EGFR is one of a group of receptors called receptor tyrosine kinases that help regulate cell growth, division, survival, and death. This regulation is a very complex process involving the activation of a series of signals along various pathways"}, {"url": "https://www.pharmgkb.org/pathway/PA162356267", "passage_text": "EGFR is a transmembrane tyrosine kinase receptor that plays a central role in regulating cell division and death. EGFR belongs to the HER family of receptors which comprise four related proteins (EGFR(HER1/ErbB1), ERBB2(HER2), ERBB3(HER3) and ERBB4(HER4)). "}, {"url": "http://www.ncbi.nlm.nih.gov/gene/1956/", "passage_text": "The protein encoded by this gene is a transmembrane glycoprotein that is a member of the protein kinase superfamily. This protein is a receptor for members of the epidermal growth factor family. EGFR is a cell surface protein that binds to epidermal growth factor. 1 TPA-induced AP-1 activation requires EGFR protein, but not EGFR tyrosine kinase and EGFR autophosphorylation at tyrosine(1173), whereas both EGFR tyrosine kinase and EGFR autophosphorylation at Y(1173) play a critical role in EGF-induced AP-1 activation."}, {"url": "http://www.genecards.org/cgi-bin/carddisp.pl?gene=EGFR", "passage_text": "The epidermal growth factor receptor (EGFR) is a receptor tyrosine kinase of the ErbB family. Four members of the ErbB family have been identified; EGFR (ErbB1, HER1), ErbB2 (HER2), ErbB3 (HER3) and ErbB4 (HER4). EGFR signaling is initiated by ligand binding to the extracellular ligand binding domain. Entrez Gene Summary for EGFR Gene. The protein encoded by this gene is a transmembrane glycoprotein that is a member of the protein kinase superfamily. This protein is a receptor for members of the epidermal growth factor family. EGFR is a cell surface protein that binds to epidermal growth factor. Binding of the protein to a ligand induces receptor dimerization and tyrosine autophosphorylation and leads to cell proliferatio"}, {"url": "https://en.wikipedia.org/wiki/Tyrosine_kinase", "passage_text": "A tyrosine kinase is an enzyme that can transfer a phosphate group from ATP to a protein in a cell. It functions as an on or off switch in many cellular functions. Tyrosine kinases are a subclass of protein kinase. The phosphate group is attached to the amino acid tyrosine on the protein. Tyrosine kinases are a subgroup of the larger class of protein kinases that attach phosphate groups to other amino acids (serine and threonine). "}, {"url": "http://ghr.nlm.nih.gov/gene/EGFR", "passage_text": "The EGFR gene provides instructions for making a receptor protein called the epidermal growth factor receptor, which spans the cell membrane so that one end of the protein remains inside the cell and the other end projects from the outer surface of the cell. "}]