[{"url": "http://biology.about.com/od/anatomy/ss/capillary.htm", "passage_text": "Capillary Size. Capillaries are so small that red blood cells can only travel through them in single file. Capillaries measure in size from about 5-10 microns in diameter. Capillary walls are thin and are composed of endothelium (a type of simple squamous epithelial tissue). Oxygen, carbon dioxide, nutrients and wastes are exchanged through the thin walls of the capillaries."}, {"url": "http://www.leememorial.org/cardiaccare/about/blood_body.asp", "passage_text": "The importance of capillaries lies in their very thin walls. Unlike arteries and veins, capillary walls are thin enough that oxygen and nutrients in your blood can pass through the walls to the parts of your body that need them to work normally."}, {"url": "http://my.clevelandclinic.org/services/heart/heart-blood-vessels/how-does-blood-flow-through-heart", "passage_text": "From your pulmonic valve, blood travels to the pulmonary artery to tiny capillary vessels in the lungs. Here, oxygen travels from the tiny air sacs in the lungs, through the walls of the capillaries, into the blood. At the same time, carbon dioxide, a waste product of metabolism, passes from the blood into the air sacs."}, {"url": "http://answers.webmd.com/answers/1181895/how-does-blood-flow-through-your", "passage_text": "From your pulmonic valve, blood travels to the pulmonary artery to tiny capillary vessels in the lungs. Here, oxygen travels from the tiny air sacs in the lungs, through the walls of the capillaries, into the blood. At the same time, carbon dioxide, a waste product of metabolism, passes from the blood into the air sacs."}, {"url": "http://www.biosbcc.net/doohan/sample/htm/vessels.htm", "passage_text": "Blood vessels form a tubular network that allows blood to travels from the heart to the tissues and back to the heart again. Blood that leaves the heart passes into arteries. Large arteries branch into progressively smaller arteries that function to deliver blood to various regions of the body."}, {"url": "http://www.leememorial.org/cardiaccare/about/blood_body.asp", "passage_text": "Capillary circulation is the part of your overall blood circulatory system where oxygen, nutrients, and waste pass between your blood and parts of your body. Capillaries connect the arterial and venous circulatory subsystems. Capillaries are very small blood vessels."}, {"url": "http://biology.about.com/od/anatomy/ss/capillary.htm", "passage_text": "A capillary is an extremely small blood vessel located within the tissues of the body, that transports blood from arteries to veins. Capillaries are most abundant in tissues and organs that are metabolically active."}]