[{"url": "http://www.vitabase.com/supplements/vitamins-minerals/vitamins/icelandic-kelp.aspx", "passage_text": "Icelandic Kelp contains more than 60 minerals like calcium, magnesium, phosphorus, potassium, sodium, sulfur, cobalt, copper, iodine, iron, manganese, selenium, etc., minerals involved in every process from building strong bones to maintaining normal muscle tone and nerve function. Kelp is a good source of the essential mineral iodine which is important in maintaining healthy thyroid function. Contains No Added: Yeast, milk or other dairy products, corn, wheat, soy, rice, rye, starch, di-calcium phosphate, flavoring, preservatives, coloring or animal by-products."}, {"url": "http://www.drlwilson.com/Articles/KELP.HTM", "passage_text": "Kelp versus other mineral supplements. Kelp is rich in iron, calcium, magnesium, with some zinc and selenium, but low in copper. This is quite a good blend of minerals and one of the main reasons why I prefer kelp to other mineral supplements. Most people need the extra minerals desperately. In addition to its high trace mineral content, one hundred grams of kelp also contains 1.7 grams of protein, and vitamins A, B, C, D, E, and K. It is particularly rich in folic acid. It also contains many other phytonutrients found in plants, along with soluble fiber."}, {"url": "http://www.vitacost.com/natures-life-icelandic-kelp-500-tablets", "passage_text": "Suitable For Vegetarians. Kelp is a good source of the essential mineral iodine which is important in maintaining healthy thyroid function. Nature's Life® Icelandic Kelp is harvested in late autumn and winter from the mineral-rich ocean waters around Iceland in the Northern Atlantic Ocean."}, {"url": "http://wolfcreekranch1.tripod.com/kelp.html", "passage_text": "Pure ocean marine algae seaweed from the world's cleanest and richest sea waters, Thorvin kelp contains 60 minerals, natural vitamins and other health factors. Thorvin icelandic kelp is 100% organic and complies with the USDA NOP organic feed requirements. Thorvin kelp is inspected and certified organic by the Icelandic Certification Agency TUN. Thorvin is inspected by QAI (Quality Assurance International), a U.S. reciprocating organization. Thorvin is the ONLY kelp meal currently OMRI (Organic Materials Review Institute) listed for livestock feed."}, {"url": "http://www.allstarhealth.com/f/natures_life-icelandic_kelp.htm", "passage_text": "Nature’s Life Icelandic Kelp is harvested in late autumn and winter from the mineral-rich ocean waters around Iceland in the Northern Atlantic Ocean. After harvesting, the kelp is carefully washed, chopped, dried, ground, and screened. "}, {"url": "http://www.allnaturalhorses.com/kelp.htm", "passage_text": "Thorvin Certified Organic Kelp Meal (Ascophyllum Nodosum). Pure ocean marine algae seaweed from the world's cleanest and richest sea waters, Thorvin kelp contains 60 minerals, natural vitamins and other health factors. Thorvin icelandic kelp is 100% organic and complies with the USDA NOP organic feed requirements. Thorvin is the highest quality kelp available. Thorvin kelp is geothermically dried under low temperatures that keep the vitamins, minerals, and enzymes intact. Thorvin kelp is inspected and certified organic by the Icelandic Certification Agency TUN."}, {"url": "http://www.bulkfoods.com/green-food/4293-kelp-powder-organic.html", "passage_text": "Certified organic 100 percent natural Icelandic Kelp. Icelandic Kelp has the highest percentage of minerals, of all available kelps. Heat. 1  Heat Sensitive Products. 2  Heat Protection. Kelp Powder Organic. Certified organic 100 percent natural Icelandic Kelp. Icelandic Kelp has the highest percentage of minerals, of all available kelps. More details. Quantity: This item not sold individually. Select at least 1 quantity for this item."}, {"url": "http://www.vitabase.com/supplements/vitamins-minerals/vitamins/icelandic-kelp.aspx", "passage_text": "Icelandic Kelp is derived from the Laminar species of seaweed, a type of brown algae. As a sea vegetable, kelp contains high levels of vital minerals including iodine, potassium, magnesium, calcium and iron. Kelp is a good source of the essential mineral iodine which is important in maintaining healthy thyroid function. Contains No Added: Yeast, milk or other dairy products, corn, wheat, soy, rice, rye, starch, di-calcium phosphate, flavoring, preservatives, coloring or animal by-products."}, {"url": "http://www.holisticlivestock.com/organic_kelp.htm", "passage_text": "Pure ocean marine algae seaweed from the world's cleanest and richest sea waters, Thorvin kelp contains over 60 vitamins, minerals, and amino acids. Thorvin Icelandic kelp is 100% organic and complies with the USDA NOP organic feed requirements. Thorvin kelp is produced in a pristine environment close to the Arctic Circle. Thorvin kelp is geothermically dried under low temperatures that keep the vitamins, minerals, and enzymes intact. Thorvin kelp is inspected and certified organic by the Icelandic Certification Agency TUN. Thorvin is inspected by QAI (Quality Assurance International), a U.S. reciprocating organization"}]