[{"url": "http://www.celebritynetworth.com/richest-athletes/nfl/warrick-dunn-net-worth/", "passage_text": "Warrick Dunn net worth: $11 Million. Warrick Dunn Net Worth: Warrick Dunn is a former American professional football player who has a net worth of $11 million. Born in Baton Rouge, Louisiana, in 1975, Warrick Dunn played college football at Florida State University. Dunn organized the Warrick Dunn Charities and the Homes for the Holidays organizations, working with single-parent families trying to buy homes. He later teamed up with several athletes, including Muhammad Ali, Mia Hamm, Cal Ripken Jr., and Lance Armstrong to create the Athletes for Hope organization."}, {"url": "https://en.wikipedia.org/wiki/Peter_Warrick", "passage_text": "On September 29, 1999, during Warrick's senior season at Florida State, Warrick and teammate Laveranues Coles went to Dillard's in the Tallahassee Mall and bought $412.38 worth of clothing for $21.40—a discount so large that it is considered shoplifting under Florida law. In his first season with Seattle, Warrick was used infrequently in the starting lineup. He finished the season with 11 catches for 180 yards, 1 carry for 5 yards, and 6 punt returns for 29 yards."}, {"url": "http://www.celebritynetworth.com/richest-celebrities/actors/warwick-davis-net-worth/", "passage_text": "Warwick Davis net worth: $5 Million. Warwick Davis net worth: Warwick Davis is an English actor and television presenter who has a worth of $5 million dollars. Born in Surrey, England, Warwick Davis got his start as a professional actor when he was cast as an Ewok in Return of the Jedi when he was 11. He ended up taking over the role of Wicket in the film and it launched his career."}, {"url": "http://www.celebritynetworth.com/richest-athletes/nfl/warrick-dunn-net-worth/", "passage_text": "Warrick Dunn Net Worth: Warrick Dunn is a former American professional football player who has a net worth of $11 million. Dunn organized the Warrick Dunn Charities and the Homes for the Holidays organizations, working with single-parent families trying to buy homes. He later teamed up with several athletes, including Muhammad Ali, Mia Hamm, Cal Ripken Jr., and Lance Armstrong to create the Athletes for Hope organization."}, {"url": "http://wdc.org/about-us/", "passage_text": "Since 1997, Warrick Dunn Charities, a 501(c)(3) recognized nonprofit, has helped single parents and children thrive academically, socially and economically. Warrick Dunn, former all-pro running back and philanthropist, began Homes for the Holidays during his rookie season in the NFL to honor his late mother. Warrick Dunn Charities has awarded millions in home furnishings, food and other donations to single-parent families and children across the nation to combat poverty, hunger and ensure families have comfortable surroundings and basic necessities to improve their quality of life."}, {"url": "http://www.celebritynetworth.com/richest-athletes/nfl/warrick-dunn-net-worth/", "passage_text": "The Tampa Bay Buccaneers drafted Dunn with the 12th overall pick during the first round of the 1997 NFL Draft. He earned 1997 NFL Offensive Rookie of the Year honors and went to three Pro Bowls in 1997, 2000, and 2005. Dunn earned the 1998 Ed Block Courage Award and the 2004 Walter Payton Man of the Year Award. Dunn organized the Warrick Dunn Charities and the Homes for the Holidays organizations, working with single-parent families trying to buy homes. He later teamed up with several athletes, including Muhammad Ali, Mia Hamm, Cal Ripken Jr., and Lance Armstrong to create the Athletes for Hope organization."}, {"url": "https://en.wikipedia.org/wiki/Warrick_Dunn", "passage_text": "Warrick De'Mon Dunn (born January 5, 1975) is a former American football running back who played in the National Football League (NFL) for twelve seasons. He was drafted by the Tampa Bay Buccaneers 12th overall in the 1997 NFL Draft, after playing college football at Florida State. Dunn was named AP NFL Offensive Rookie of the Year in 1997 and earned three Pro Bowl selections in his career. After his playing career, Dunn took a minority stake in the Falcons' ownership group led by Arthur Blank. For his career, Dunn has only missed 10 games and has a total of 2,256 carries for 9,461 yards 43 touchdowns and a 4.2 average. Dunn finished his first 10 seasons with over 1,000 combined rushing and receiving yards."}]