[{"url": "http://pc.net/helpcenter/answers/difference_between_router_and_modem", "passage_text": "In order for devices on the network to connect to the Internet, the router must be connected to a modem. Therefore, most routers have a specific Ethernet port that is designed to connect to the Ethernet port of a cable or DSL modem. A modem is a device that provides access to the Internet (see below). The modem connects to your ISP, which typically provides either cable or DSL Internet service."}, {"url": "http://whatismyipaddress.com/router", "passage_text": "Before we delve into the world of routers, you need to understand what a broadband connection is and how it works. According to Dictionary.com, broadband is a high-speed, high-capacity transmission medium that can carry signals from multiple independent network carriers. Wireless Routers. Wireless routers connect to your modem and create a wireless signal in your home or office. So, any computer within range can connect to your wireless router and use your broadband Internet for free. The only way to keep anyone from connecting to your system is to secure your router."}, {"url": "http://compnetworking.about.com/cs/dslcablerouters/g/bldef_bbrouter.htm", "passage_text": "Definition: A broadband router (also known as a residential or home gateway) combines the features of a traditional network switch, a network firewall, and a DHCP server. Several manufacturers offer broadband router products to consumers. Features that differentiate broadband router products include the specific Wi-Fi and Ethernet standards supported along with additional performance and security features."}, {"url": "http://whatismyipaddress.com/router", "passage_text": "Broadband Routers. Broadband routers can be used to do several different types of things. They can be used to connect two different computers or to connect two computers to the Internet. They can also be used to create a phone connection. Wireless Routers. Wireless routers connect to your modem and create a wireless signal in your home or office. So, any computer within range can connect to your wireless router and use your broadband Internet for free. The only way to keep anyone from connecting to your system is to secure your router."}, {"url": "http://www.webopedia.com/DidYouKnow/Hardware_Software/router.asp", "passage_text": "Wired and Wireless Routers. Wireless broadband routers look much the same as a wired router, with the obvious exception of the antenna on top, and the lack of cable running from the PCs to the router when it is all set up. A router is a device that forwards data packets along networks. A router is connected to at least two networks, commonly two LANs or WANs or a LAN and its ISP's network. Routers are located at gateways, the places where two or more networks connect, and are the critical device that keeps data flowing between networks and keeps the networks connected to the Internet"}, {"url": "https://en.wikipedia.org/wiki/Wireless_router", "passage_text": "A wireless router is a device that performs the functions of a router and also includes the functions of a wireless access point. It is used to provide access to the Internet or a private computer network. It can function in a wired LAN (local area network), in a wireless-only LAN (WLAN), or in a mixed wired/wireless network, depending on the manufacturer and model."}, {"url": "http://www.pcmag.com/encyclopedia/term/38940/broadband-router", "passage_text": "Definition of:broadband router. A device that provides high-speed access to the Internet for two or more computers. Essentially, all routers today are broadband routers, and they typically include three or four Ethernet ports for wired connections to desktop and laptop computers. The router forwards Internet traffic from the network to the cable or telephone company and switches non-Internet traffic between the connected machines. A wireless router includes Wi-Fi and is the most common network infrastructure in homes and small businesses (see wireless router)."}, {"url": "http://compnetworking.about.com/cs/dslcablerouters/g/bldef_bbrouter.htm", "passage_text": "A broadband router utilizes the Ethernet standard for wired connections. Traditional broadband routers required Ethernet cables be run between the router, the broadband modem, and each computer on the home network. Newer broadband routers also incorporate wireless networking capability utilizing the Wi-Fi standards. Several manufacturers offer broadband router products to consumers. Features that differentiate broadband router products include the specific Wi-Fi and Ethernet standards supported along with additional performance and security features."}]