[{"url": "http://www.space.com/28379-eris-dwarf-planet.html", "passage_text": "When Eris was first discovered in 2005, it was thought to be significantly larger than Pluto. Originally, it was submitted as the tenth planet in the solar system. Ultimately, however, Eris' discovery was a big reason astronomers demoted Pluto to dwarf planet status in 2006. But Eris is even farther-flung than Pluto, circling our star from about three times farther away. It takes 561 years for the distant dwarf planet to make a single trip around the sun, though it rotates once every 25 hours, making the length of its day very similar to a day on Earth."}, {"url": "https://en.wikipedia.org/wiki/Eris_(dwarf_planet)", "passage_text": "Eris is a trans-Neptunian dwarf planet (plutoid). Its orbital characteristics more specifically categorize it as a scattered-disk object (SDO), or a TNO that has been scattered from the Kuiper belt into more-distant and unusual orbits following gravitational interactions with Neptune as the Solar System was forming. It was measured to be 2,326 ± 12 kilometers (1,445.3 ± 7.5 mi) in diameter. Eris is 27% more massive than dwarf planet Pluto, though Pluto is slightly larger by volume. Eris's mass is about 0.27% of the Earth 's mass. Eris was discovered in January 2005 by a Palomar Observatory –based team led by Mike Brown, and its identity was verified later that year. It is a trans-Neptunian object (TNO) and a member of a high-eccentricity population known as the scattered disk"}, {"url": "https://en.wikipedia.org/wiki/Eris_(dwarf_planet)", "passage_text": "Eris (minor-planet designation 136199 Eris) is the most-massive and second-largest dwarf planet known in the Solar System. It was measured to be 2,326 ± 12 kilometers (1,445.3 ± 7.5 mi) in diameter. Eris is 27% more massive than dwarf planet Pluto, though Pluto is slightly larger by volume. Eris's mass is about 0.27% of the Earth 's mass. Eris was discovered in January 2005 by a Palomar Observatory –based team led by Mike Brown, and its identity was verified later that year. It is a trans-Neptunian object (TNO) and a member of a high-eccentricity population known as the scattered disk"}, {"url": "http://greekmythology.wikia.com/wiki/Eris", "passage_text": "The planet, re-classified as a dwarf planet along with Pluto, was named Eris on September 13, 2006 by the International Astronomical Union. The moon, named Shamlicht by Erisians, was officially named Dysnomia after Eris' daughter, the daemon of lawlessness. The dwarf planet Eris was discovered by the Palomar Observatory-based team of Mike Brown, Chad Trujillo, and David Rabinowitz on January 5, 2005, from images taken on October 21, 2003. The discovery was announced on July 29, 2005."}, {"url": "http://www.universetoday.com/37285/dwarf-planet-eris/", "passage_text": "Eris is NOT the largest dwarf planet in our solar system. It was initially thought to be so, but in November 2010, a team of astronomers led by Bruno Sicardy observed Eris occult a star and determined it is marginally smaller than Pluto though 27 percent more massive. The discovery of Eris was so important because it was a celestial body larger than Pluto, which forced astronomers to consider, for the first time in history, what the definition of a planet truly is."}, {"url": "http://www.astronomytoday.com/astronomy/eris.html", "passage_text": "Eris is a dwarf planet that lies at the outer reaches of our solar system. It was discovered in 2005 by professional astronomers who were examining images taken at California's Palomar Observatory two years previously. The International Astronomical Union (IAU) is responsible for naming and classifying planets. Eris has a diameter of 2400km, which is slightly larger than Pluto 's. In comparison, the Earth's diameter is 12,742km. Neither planets nor dwarf planets are perfect spheres, so this isn't the ideal way to measure their size but it is a reliable indicator"}, {"url": "http://starchild.gsfc.nasa.gov/docs/StarChild/solar_system_level2/eris.html", "passage_text": "Eris, the largest known dwarf planet, was first detected in data collected in October of 2003. It was not identified until January of 2005. Mike Brown and his team of astronomers discovered what was considered to be the 10th planet while doing observations at the Palomar Observatory in California. At 2400 kilometers in diameter, Eris is slightly larger than Pluto. Its discovery was one of the reasons the International Astronomical Union felt it was necessary to definitely define what should be considered a planet. Eris does not clear out its orbit, so it did not meet one of the requirements."}, {"url": "https://en.wikipedia.org/wiki/Eris_(mythology)", "passage_text": "Eris (/ˈɪərɪs, ˈɛrɪs/ ; Greek: ἔρις, Strife) is the Greek goddess of chaos, strife, and discord. Her name is the equivalent of Latin Discordia, which means discord. Eris' Greek opposite is Harmonia, whose Latin counterpart is Concordia. Homer equated her with the war-goddess Enyo, whose Roman counterpart is Bellona. The dwarf planet Eris is named after the goddess, as is the religion Discordianism. "}]