[{"url": "https://en.wikipedia.org/wiki/Aluminium_chloride", "passage_text": "Aluminium chloride is manufactured on a large scale by the exothermic reaction of aluminium metal with chlorine or hydrogen chloride at temperatures between 650 to 750 °C (1,202 to 1,382 °F). In the melt, aluminium trichloride exists as the dimer Al 2 Cl 6, with tetracoordinate aluminium. This change in structure is related to the lower density of the liquid phase (1.78 g/cm 3) vs solid aluminium trichloride (2.48 g/cm 3)."}, {"url": "http://www.aluminumchloride.net/", "passage_text": "Aluminum chloride is a crystalline compound formed by combining chlorine and aluminum atoms. It is usually white in color, but iron trichloride contamination often gives it a characteristic yellow color. The Synthesis of Aluminum Chloride. Chemically depicted as AlCl3, the compound is manufactured through an exothermic reaction that takes place at 650 to 700 degree Celsius between aluminum metal and chlorine. Alternatively, hydrogen chloride may also be used in the manufacture of the compound."}, {"url": "https://en.wikipedia.org/wiki/Aluminium_chloride", "passage_text": "The Friedel–Crafts reaction is the major use for aluminium chloride, for example in the preparation of anthraquinone (for the dyestuffs industry) from benzene and phosgene. In the melt, aluminium trichloride exists as the dimer Al 2 Cl 6, with tetracoordinate aluminium. This change in structure is related to the lower density of the liquid phase (1.78 g/cm 3) vs solid aluminium trichloride (2.48 g/cm 3)."}, {"url": "https://en.wikipedia.org/wiki/Aluminium_chlorohydrate", "passage_text": "Aluminium chlorohydrate is a group of specific aluminium salts having the general formula Al n Cl (3n-m) (OH) m. It is used in deodorants and antiperspirants and as a coagulant in water purification. "}, {"url": "http://www.answers.com/Q/What_is_aluminum_chloride", "passage_text": "Aluminum chloride is an ionic compound because aluminum is a metal and chlorine is a nonmetal. The combination of a metal bonded with a nonmetal is an ionic compound. Incorr … ect. Aluminium Chloride is covalent. Aluminum chloride is desoleved in aluminum hydroxide aquas solution  between 60 and 90 deg C some times a pressure of 2 to 3 bar is also  applied in autoclave the reaction t … ime is long almost 5 to 6 hours."}, {"url": "http://www.answers.com/Q/What_is_aluminum_chloride", "passage_text": "Aluminum chloride is a chemical compound that has several uses, including as a treatment for excessive sweating and in antiperspirants. It is used in the production of synthetic rubber and making detergents. Aluminum chloride is desoleved in aluminum hydroxide aquas solution  between 60 and 90 deg C some times a pressure of 2 to 3 bar is also  applied in autoclave the reaction t … ime is long almost 5 to 6 hours."}, {"url": "https://en.wikipedia.org/wiki/Aluminium_chloride", "passage_text": "Aluminium chloride is hygroscopic, having a very pronounced affinity for water. It fumes in moist air and hisses when mixed with liquid water as the Cl − ions are displaced with H 2 O molecules in the lattice to form the hexa hydrate AlCl 3 ·6H 2 O (also white to yellowish in color). In the melt, aluminium trichloride exists as the dimer Al 2 Cl 6, with tetracoordinate aluminium. This change in structure is related to the lower density of the liquid phase (1.78 g/cm 3) vs solid aluminium trichloride (2.48 g/cm 3)."}, {"url": "http://www.merriam-webster.com/medical/aluminum%20chloride", "passage_text": "Medical Definition of ALUMINUM CHLORIDE. : a deliquescent compound AlCl3 or Al2Cl3 that is used as a topical astringent and antiseptic on the skin, in some deodorants to control sweating, and in the anhydrous form as a catalyst—see mucicarmine."}, {"url": "https://en.wikipedia.org/wiki/Aluminium_chloride", "passage_text": "Anhydrous aluminium chloride is a powerful Lewis acid, capable of forming Lewis acid-base adducts with even weak Lewis bases such as benzophenone and mesitylene. It forms tetrachloroaluminate AlCl 4 − in the presence of chloride ions. In the melt, aluminium trichloride exists as the dimer Al 2 Cl 6, with tetracoordinate aluminium. This change in structure is related to the lower density of the liquid phase (1.78 g/cm 3) vs solid aluminium trichloride (2.48 g/cm 3)."}]