[{"url": "http://grammar.about.com/od/rs/g/symbolterm.htm", "passage_text": "In the broadest sense of the term, all words are symbols. (See also sign .) In a literary sense, says William Harmon, a symbol combines a literal and sensuous quality with an abstract or suggestive aspect (A Handbook to Literature, 2006). In language studies, symbol is sometimes used as another term for logograph. See Examples and Observations below. 1 Although symbolism works by the power of suggestion, a symbol is not the same as a meaning or a moral. 2  A symbol cannot be an abstraction. 3  Rather, a symbol is the thing that points to the abstraction. 4  In Poe's 'The Raven,' death isn't the symbol; the bird is."}, {"url": "http://www.answers.com/Q/Give_an_example_of_arbitrary_symbolism", "passage_text": "A flag is a symbol of a country. A country can have more than one symbol. For instance, an eagle is a symbol of the U.S., and the maple leaf is a symbol of Canada. A c … ross is the symbol of Christianity, and a Star of David is the symbol of Judaism. An arrow is a symbol of direction or movement. A shining sun is sometimes used as a symbol of happiness. "}, {"url": "http://www.answers.com/Q/Why_is_language_defined_as_an_arbitrary_system_of_vocal_symbols", "passage_text": "very small portion of language is non-arbitrary and is called onomatopoeia.It refers to the language formed in agreement with sound,for example: the non arbitrary connection b … etween form and meaning of such onomatopoeic words as Cuckoo,Peewit,Crashin English. 3 people found this useful. There are many incorrect definitions of language, and this is one. Some language is not vocal. And arbitrary symbols would be unintelligible to anyone except the person making them up. Better to define language as a complex system of symbols used to convey meaning, feeling and intent. Still not a complete definition, but at least it is not wrong"}, {"url": "http://intro2gl.blogspot.com/2008/09/language-is-arbitrary-conventional.html", "passage_text": "The term arbitrary here refers to the fact that the symbol that people use is made or chosen without any principle, logic or reason. For example, people in Java do not have a principle or logic to call an animal with long tail, two hands, and two legs and like scratching and playing on trees as kethek. So, to answer Daniel's question: English people do not have any reason why they call the animal that produces meauwww as cat. Again, this is because language is arbitrary: no logical reason is used when choosing a symbol, and no direct relationship between the symbol and the symbolized."}, {"url": "http://intro2gl.blogspot.com/2008/09/language-is-arbitrary-conventional.html", "passage_text": "This is what arbitrary means. So, to answer Daniel's question: English people do not have any reason why they call the animal that produces meauwww as cat. Again, this is because language is arbitrary: no logical reason is used when choosing a symbol, and no direct relationship between the symbol and the symbolized. Now that a group of people have chosen a symbol for something, all the members of the group should approve and use the same symbol to refer to the same thing"}, {"url": "http://www.markedbyteachers.com/university-degree/creative-arts-and-design/language-is-a-system-of-arbitrary-symbols-and-grammatical-signals-which-meaning-is-attributed-and-used-for-the-expression-or-communication-of-thoughts-and-feelings.html", "passage_text": "Introduction. ID number: 4580175 ERS section 3 Assignment 4: Definition Due Date: 8 November 2002 Language Language is a system of arbitrary symbols and grammatical signals which meaning is attributed and used for the expression or communication of thoughts and feelings. Language has certain things in common. Middle. It has different meaning and rule for solving the problem. This definition also includes computer language which is a special set of symbols, letters, numerals and rules, used for the transmission of information in computer. Computer language has rules for operating and programming."}, {"url": "http://pandora.cii.wwu.edu/vajda/ling201/test1materials/Signs_handout.htm", "passage_text": "Most words in any language are symbols. For instance, the word apple neither looks nor sounds like an apple (how would an apple sound, anyway?). The relation between the word-symbol apple and the fruit it signifies is arbitrary, established by a convention handed down by word of mouth in a given speech community. For instance, the octagonal shape of a stop sign is a symbol, as is the white and red striped pole which signifies a barber shop. The shape of most numerical digits is arbitrary: 2, 3, 4, 5, 6, etc. (although one could argue that the shape of the digit 1 is somewhat iconic). 2."}, {"url": "http://pandora.cii.wwu.edu/vajda/ling201/test1materials/Signs_handout.htm", "passage_text": "And there are plenty of other symbols besides words. Many graphic signs also show an arbitrary, conventional relationship to their meaning. For instance, the octagonal shape of a stop sign is a symbol, as is the white and red striped pole which signifies a barber shop. The shape of most numerical digits is arbitrary: 2, 3, 4, 5, 6, etc. (although one could argue that the shape of the digit 1 is somewhat iconic). 2."}, {"url": "http://libraries.psu.edu/nabokov/dreschersigns.htm", "passage_text": "I. A symbol. 1. A conventional symbol of emblem which represents an idea, as a word, letter, or mark; as the sign of the cross. 4. a] A motion, an action, or a gesture by which a thought is expressed, or a command or a wish made known. 6"}]