[{"url": "https://answers.yahoo.com/question/index?qid=20081207021019AASPQnT", "passage_text": "The elder James Gordon Bennett was born in Banffshire, Scotland in 1795 and emigrated to the USA, eventually becoming a journalist and founding the New York Herald in 1835. Bennett had a natural talent for journalism and the paper flourished. (more....) http://www.worldwidewords.org/articles/gordon.htm Meaning An exclamation of surprise. Origin It is commonly thought that this refers to James Gordon Bennett. JGB was a real person. In fact, with the expansiveness that is appropriate for this story, two real people."}, {"url": "https://en.wikipedia.org/wiki/Bennett_(name)", "passage_text": "This article is about the surname and given name Bennett. For other uses, see Bennett. Bennett is an English and Irish language surname (and, less commonly, given name); related to the medieval name Benedict, both ultimately from Latin Benedictus blessed. Bennett is the English spelling of the Anglo-Norman name Ben[n]et (Modern French first name Benoit, benoît Surname). Benet bénet the oldest public record of the surname is dated 1208 In. County durham people with the: name include"}, {"url": "http://www.phrases.org.uk/meanings/gordon-bennett.html", "passage_text": "Origin. It is commonly thought that this expression refers to James Gordon Bennett. JGB was a real person-in fact, with the expansiveness that is appropriate for this story, two real people."}, {"url": "http://www.surnamedb.com/Surname/Bennett", "passage_text": "One John Bennett was an early emigrant to the New World; he is recorded as sailing in the Plaine Joan from London in May 1635, bound for Virginia. A Coat of Arms granted to a Bennett family is silver, a chevron between three red lions' heads erased. The first recorded spelling of the family name is shown to be that of William Benet, which was dated 1208, in the Charter Rolls of Durham, during the reign of King John, known as Lackland, 1199 - 1216. Surnames became necessary when governments introduced personal taxation. In England this was known as Poll Tax"}, {"url": "http://genealogy.about.com/od/surname_meaning/p/bennett.htm", "passage_text": "BENNETT Surname Meaning & Origin: From the medieval given name Benedict, originating from the Latin benedictus meaning blessed.. Bennett is the 78th most popular surname in the United States. Surname Origin: English. Alternate Surname Spellings: "}, {"url": "http://www.answers.com/Q/What_country_does_the_surname_Bennett_come_from", "passage_text": "The American surname Driggers is derived from the Greek name, Gregorios, or Latin, Gregorius, most commonly seen as English form Gregory. The surname Driggers is mostly co … ncentrated in the states of South Carolina, Florida, and Georgia. "}, {"url": "http://wordsmith.org/words/gordon_bennett.html", "passage_text": "The expression is primarily used in the UK even though Gordon Bennett was an American. It comes from the name of newspaperman James Gordon Bennett, Jr. (1841-1918). He was known as Gordon Bennett to distinguish him from his father, James Gordon Bennett, Sr., a Scottish immigrant to the US and founder of the New York Herald. The son inherited the paper and wealth, and was known for his extravagant and shocking life. "}, {"url": "http://selectsurnames.com/bennett.html", "passage_text": "The English surname Bennett developed from Benet or Bennets, names that derived from the medieval name Benedict or from its Old French forms Beneit and Benoit which were popular among the Normans. Gordon Bennett, who arrived in New York from Scotland in 1823, took over the New York Herald and made it one of the best-selling newspapers in 19th century America. The phrase Gordon Bennett, denoting surprise or shock, reportedly derives from his playboy son who had a habit of outrageous behavior."}]