[{"url": "http://www.cosmeticsinfo.org/ingredient/bismuth-oxychloride", "passage_text": "Bismuth is a naturally occurring, brittle metal. Bismuth-containing compounds can be found in a number of applications: as a pigment (Bismuth Oxychloride) in cosmetics and personal care products, and in Over-The-Counter (OTC) medicines (bismuth subnitrate) such as some used to treat gastrointestinal problems. Bismuth Oxychloride may be safely used in coloring cosmetics and personal care products, including products intended for use in the area of the eye. It is not allowed to be used in lip products."}, {"url": "https://en.wikipedia.org/wiki/Bismuth", "passage_text": "Bismuth compounds account for about half the production of bismuth. They are used in cosmetics, pigments, and a few pharmaceuticals, notably Pepto-Bismol, used to treat diarrhea. Bismuth's unusual propensity to expand upon freezing is responsible for some of its uses, such as in casting of printing type. "}, {"url": "http://www.globalhealingcenter.com/natural-health/toxic-metal-cleansing-the-health-dangers-of-bismuth/", "passage_text": "Bismuth is a naturally occurring metal used to manufacture solder, fishing anchors, shotgun pellets, and more. Many cosmetics and pharmaceuticals also contain bismuth in various forms. Bismuth subsalicylate is an active ingredient in many popular, over-the-counter upset stomach remedies. Bismuth oxychloride is used in cosmetics. Bismuth subgallate is an active ingredient in products used to address flatulence odor. Although bismuth exposure is common, that does not mean it’s completely harmless"}, {"url": "http://health.howstuffworks.com/skin-care/beauty/skin-and-makeup/mineral-makeup1.htm", "passage_text": "Bismuth is naturally occurring; bismuth oxychloride is not. The other problem with bismuth oxychloride is that it's a known irritant. It can cause itchiness, rashes and can even trigger acne breakouts in people with sensitive skin. Bismuth oxychloride is a mineral, but it's not a natural one. It's a metal derivative, most commonly obtained as a byproduct of lead or copper smelting. It has been used in cosmetics for years to impart a shimmering glow."}, {"url": "http://www.paulaschoice.com/cosmetic-ingredient-dictionary/definition/bismuth-oxychloride", "passage_text": "The standard primary ingredient included in most powders that are referred to as mineral makeup.. The claim for bismuth oxychloride (which is also known as synthetic pearl) is that it is all-natural and better for skin than talc. In fact, in many ways talc is a more natural, unadulterated, pure ingredient than bismuth oxychloride."}, {"url": "http://health.howstuffworks.com/skin-care/beauty/skin-and-makeup/mineral-makeup1.htm", "passage_text": "The problem is bismuth oxychloride. Bismuth oxychloride is a mineral, but it's not a natural one. It's a metal derivative, most commonly obtained as a byproduct of lead or copper smelting. It has been used in cosmetics for years to impart a shimmering glow."}, {"url": "http://www.cosmeticsinfo.org/ingredient/bismuth-oxychloride", "passage_text": "Bismuth Oxychloride is a synthetically prepared white or nearly white amorphous or finely crystalline powder. In cosmetics and personal care products, Bismuth Oxychloride is used in the formulation of many products, including make-up, nail products, cleansing products, fragrances and hair coloring products. Bismuth Oxychloride may be safely used in coloring cosmetics and personal care products, including products intended for use in the area of the eye. It is not allowed to be used in lip products."}, {"url": "http://www.beautyblisscosmetics.com/2013/07/bismuth-oxychloride.html", "passage_text": "Bismuth oxychloride is a product that is FDA approved for use in products for the face, eyes, lips and nails. It is a very common and popular ingredient in both traditional and mineral makeup. However, skin irritation from bismuth oxychloride is not unusual. "}, {"url": "http://beautifulwithbrains.com/2009/06/27/know-your-ingredients-bismuth-oxychloride/", "passage_text": "What it is. Bismuth Oxychloride is a white powder that seldom occurs in nature. It is usually made by combining bismuth, a by-product of lead and copper metal refining, with chloride and water. What it does. Bismuth Oxychloride adheres well to skin, helping makeup stay on longer. "}, {"url": "https://en.wikipedia.org/wiki/Bismuth_oxychloride", "passage_text": "Bismuth oxychloride is an inorganic compound of bismuth with the formula BiOCl. It is a lustrous white solid used since antiquity, notably in ancient Egypt. "}]