[{"url": "http://www.cbc.ca/news/business/greater-vancouver-detached-homes-now-average-over-1m-1.2891167", "passage_text": "Downtown Vancouver is seen in the background as a house sits on top of a small island in West Vancouver, B.C. The average price of a detached house in Greater Vancouver is over $1 million, while the average sales price for any home was $638,500. The composite benchmark price for all residential properties in Metro Vancouver ends the year at $638,500, but that’s much higher in parts of the city, such as West Vancouver, where the composite price is $1.6 million."}, {"url": "http://www.areavibes.com/vancouver-wa/housing/", "passage_text": "34.5%. The median home value in Vancouver is 21% less than the Washington average and 18.8% greater than the National average. The median rental rates in Vancouver is 7.4% less than the Washington average and 0.9% less than the National average. "}, {"url": "http://www.trulia.com/real_estate/Vancouver-Washington/market-trends/", "passage_text": "Summary for Vancouver. The median sales price for homes in Vancouver WA for Jun 15 to Sep 15 was $246,000. This represents an increase of 1.8%, or $4,250, compared to the prior quarter and an increase of 6.7% compared to the prior year. Sales prices have appreciated 23% over the last 5 years in Vancouver. The average listing price for Vancouver homes for sale on Trulia was $319,817 for the week ending Sep 23, which represents an increase of 2.5%, or $7,841, compared to the prior week and an increase of 3.4%, or $10,369, compared to the week ending Sep 02."}, {"url": "http://www.vancouversun.com/business/House+prices+continue+soar+Vancouver+million+average+price/10974058/story.html", "passage_text": "The average price for detached bungalows and two-storey houses across Vancouver, North Vancouver and West Vancouver have jumped by 10.6 per cent and 10.3 per cent in the last year, according to Royal LePage’s House Price Survey, released Wednesday. The average bungalow now sells for $1.175 million. Home prices continue to soar in Vancouver, where the average two-storey detached home is now selling for more than $1.27 million. Photograph by: Kim Stallknecht, PNG."}, {"url": "http://www.ctvnews.ca/canada/home-prices-rise-quickly-in-toronto-and-vancouver-even-faster-in-some-suburbs-1.2610943", "passage_text": "The average price of a two-storey home in the City of Vancouver grew quicker than the average, up 17 per cent to $1.925 million. Prices in Burnaby, B.C., increased even faster than in the city, by 18 per cent, to $832,000. "}, {"url": "http://www.zillow.com/vancouver-wa/home-values/", "passage_text": "The median home value in Vancouver is $230,800. Vancouver home values have gone up 9.8% over the past year and Zillow predicts they will rise 5.1% within the next year. The median rent price in Vancouver is $1,425, which is lower than the Portland Metro median of $1,650. Read more"}, {"url": "http://globalnews.ca/news/1098143/vancouvers-housing-prices-2nd-most-affordable-in-the-world/", "passage_text": "Story continues below. The average house price in Metro Vancouver is $670,300, which would require 80 per cent of the average median household income to service the mortgage. That’s more than 2.5 times the 32 per cent guideline set out by Canadian Mortgage and Housing Corporation. The most unaffordable major city in the world is Hong Kong, with an average house price of $4,024,000 and median household income of $270,000. San Francisco-Oakland is the third most unaffordable city in the world, with an average house price of $705,000 and a median income of $76,300. Report an error."}]