[{"url": "http://www.webmd.com/drugs/2/drug-12235/clindamycin-hcl-oral/details", "passage_text": "Uses. Clindamycin is used to treat a wide variety of bacterial infections. It is an antibiotic that works by stopping the growth of bacteria. This antibiotic treats only bacterial infections. It will not work for virus infections (e.g., common cold, flu). Side Effects. See also Warning section. Nausea, vomiting, or diarrhea may occur. If any of these effects persist or worsen, tell your doctor or pharmacist promptly. Remember that your doctor has prescribed this medication because he or she has judged that the benefit to you is greater than the risk of side effects."}, {"url": "http://www.rxlist.com/clindamycin-side-effects-drug-center.htm", "passage_text": "It is an antibiotic. This medication is available in generic form. Common side effects of Cleocin HCl include nausea, vomiting, diarrhea, stomach pain, joint pain, vaginal itching or discharge, skin rash or itching, heartburn, or sore throat. The dose of Cleocin HCl for adults is 150 to 300 mg every 6 hours. For more severe infections is 300 to 450 mg every 6 hours"}, {"url": "http://www.medicinenet.com/clindamycin-oral/article.htm", "passage_text": "DRUG CLASS AND MECHANISM: Clindamycin is an antibiotic used for treating serious infections. It is effective again several types of bacteria such as Staphylococcus aureus, Streptococcus pneumoniae, Staphylococcus epidermidis, and Propionibacterium acnes. It reduces growth of bacteria by interfering with their ability to make proteins. The FDA approved clindamycin in February 1970. PRESCRIBED FOR: Clindamycin is used for treatment of serious infections caused by susceptible bacteria. It is most often used for treating penicillin-allergic patients or in other situations where penicillin or other alternative antibiotics cannot be used."}, {"url": "http://www.livestrong.com/article/93028-clindamycin-side-effects/", "passage_text": "Clindamycin is an antibiotic medication classified as a lincosamide; it inhibits bacteria protein synthesis. Clindamycin is used to prevent or treat bacterial infection. Clindamycin is also applied topically to the skin as an ointment to treat or prevent acne. Like any medication, clindamycin can have side effects, and some can be severe. Most people will not experience all the possible common side effects."}, {"url": "http://www.livestrong.com/article/93028-clindamycin-side-effects/", "passage_text": "Like many antibiotics, clindamycin can cause gastrointestinal upset. Common side effects of clindamycin include diarrhea, nausea, vomiting, abdominal pain or constipation. Some people complain of a metallic taste in their mouth when on the drug. Colitis, an inflammation of the colon, can occur. Clindamycin is used to prevent or treat bacterial infection. Clindamycin is also applied topically to the skin as an ointment to treat or prevent acne. Like any medication, clindamycin can have side effects, and some can be severe. Most people will not experience all the possible common side effects."}, {"url": "http://www.peoplespharmacy.com/2009/06/21/clindamycin-sid/", "passage_text": "Clindamycin Side Effects Can Be Serious. The antibiotic Clindamycin can cause serious side effects including diarrhea as well as an increased susceptibility to the dangerous bacteria C Diff. Cleveland. I was given clindamycin now for the second time because of an infection from a tooth. The first time I had to take this Rx my face was so swollen with infection I may not have really noticed any side effects."}]