[{"url": "http://homeguides.sfgate.com/differences-between-plumeria-hibiscus-70377.html", "passage_text": "Plumeria produces somewhat flat, fragrant flowers. While both add a tropical flair to the garden with their lush foliage and attractive, often fragrant flowers, hibiscus and plumeria come from two different plant families. Hibiscus belongs to the mallow, or Malvacaea family, and is related to both hollyhocks (Alcea rosea) and cotton (Gossypium barbadense). Growing to about 30 feet tall, plumeria's round canopy spreads as wide as the tree is tall. Depending on species and cultivar, plumeria foliage may be as much as 12 inches long and the trees may be deciduous or evergreen."}, {"url": "http://homeguides.sfgate.com/differences-between-plumeria-hibiscus-70377.html", "passage_text": "Plumeria rubra is the type most often grown, according to the Arizona Plumeria Society, and produces pink or red flowers. Suitable for U.S. Department of Agriculture plant hardiness zones 10 through 12, this plumeria grows 1 to 2 feet per year to a mature height of about 25 feet. Growing to about 30 feet tall, plumeria's round canopy spreads as wide as the tree is tall. Depending on species and cultivar, plumeria foliage may be as much as 12 inches long and the trees may be deciduous or evergreen."}, {"url": "http://allthingsfrangipani.com/frangipanis.html", "passage_text": "Tubular fragrant flowers occur in summer-autumn. Plumeria Rubra (and variation Plumeria Acutifolia) also known as the Common Frangipani or Red Frangipani, is native to Mexico, Central America, and Venezuela. It is a decidous, spreading, sparsely branched tree or shrub with a height to 4m and spread to 4m and more. "}, {"url": "http://allthingsfrangipani.com/frangipani-species.html", "passage_text": "Plumeria Rubra. The most common frangipani is the Plumeria Rubra. Rubra come in many colours, from white to cream to yellow, even oranges, pinks (both pale and hot pink), reds and even deep cerise. They also come in multiple colours (such as pink, apricot and yellow in the one flower). And Rubra has the most fragrant flowers! The leaves from a Plumeria Rubra are long and oval and have quite a pointed end. The leaves are quick to drop off as the winter coolness approaches. A Plumeria Rubra can grow to 5m tall and almost as wide."}, {"url": "http://www.baobabs.com/en/Plumeria.htm", "passage_text": "Plumeria rubra (and variation Plumeria acutifolia) also known as the Common Frangipani or Red Frangipani, is native to Mexico, Central America, and Venezuela. Plumeria (common name Frangipani) is a small genus of 7-8 species native to Mexico, Tropical America and the Caribbean. The genus consists of mainly deciduous shrubs and trees."}, {"url": "https://answers.yahoo.com/question/index?qid=20071016175241AAgkreM", "passage_text": "& Schult.) is a small genus of 7-8 species native to tropical and subtropical Americas. The genus consists of mainly deciduous shrubs and trees. P. rubra (Common Frangipani, Red Frangipani), native to Mexico, Central America, and Venezuela, produces flowers ranging from yellow to pink depending on form or cultivar. They are associated with temples in both Hindu and Buddhist cultures, though Hindus do not use the flowers in their temple offerings. In several Pacific islands, such as Tahiti, Hawaii and Tonga, Plumeria is used for making leis."}, {"url": "http://allthingsfrangipani.com/frangipani-species.html", "passage_text": "The petals on a Plumeria Obtusa flower are rounder than those of Plumeria Rubra, and they tend to bend over backwards at the very tips. The Plumeria Obtusa is also known as the evergreen frangipani, as, in the right climate, they will keep their leaves all year round. The leaves from a Plumeria Rubra are long and oval and have quite a pointed end. The leaves are quick to drop off as the winter coolness approaches. A Plumeria Rubra can grow to 5m tall and almost as wide."}, {"url": "https://en.wikipedia.org/wiki/Plumeria_rubra", "passage_text": "Plumeria rubra is a deciduous plant species belonging to the genus Plumeria. Originally native to Mexico, Central America, Colombia and Venezuela, it has been widely cultivated in subtropical and tropical climates worldwide and is a popular garden and park plant, as well as being used in temples and cemeteries. Plumeria rubra was one of the many species first described by the father of taxonomy Carl Linnaeus, and appeared in the 1753 edition of Species Plantarum. Its specific epithet is derived from the Latin ruber red."}, {"url": "http://www.baobabs.com/en/Plumeria.htm", "passage_text": "Plumeria rubra BIBLOS. Plumeria rubra (and variation Plumeria acutifolia) also known as the Common Frangipani or Red Frangipani, is native to Mexico, Central America, and Venezuela. It is a decidous, spreading, sparsely branched tree or shrub with a height to 4m and spread to 4m and more. Plumeria (common name Frangipani) is a small genus of 7-8 species native to Mexico, Tropical America and the Caribbean. The genus consists of mainly deciduous shrubs and trees."}, {"url": "http://lee.ifas.ufl.edu/Hort/GardenPubsAZ/GL25_Brown.pdf", "passage_text": "Plumeria rubra L. is the most commonly grown Plumeria species in Florida and in many warm climates. Its native range is from central Mexico to Colombia. The tree grows from 15 to 25 ft tall. The ﬂowering period of P. rubra is from March to July. In the past, ﬂower colors of Plumeria rubra were considered distinct species but are now regarded as different forms of the same species. All forms have twisted overlapping corollas, much like the blades of a propeller. Forma acutifolia has white ﬂowers and yellow centers. Forma lutea has yellow ﬂowers."}]