[{"url": "http://www.aafp.org/afp/1998/0215/p711.html", "passage_text": "Dyspnea is a common symptom and, in most cases, can be effectively managed in the office by the family physician. The differential diagnosis is composed of four general categories: cardiac, pulmonary, mixed cardiac or pulmonary, and noncardiac or nonpulmonary. Dyspnea is defined as abnormal or uncomfortable breathing in the context of what is normal for a person according to his or her level of fitness and exertional threshold for breathlessness. 1 – 4 Dyspnea is a common symptom and can be caused by many different conditions."}, {"url": "https://en.wikipedia.org/wiki/Dyspnea", "passage_text": "Further information: List of causes of shortness of breath. While shortness of breath is generally caused by disorders of the cardiac or respiratory system, other systems such as neurological, musculoskeletal, endocrine, hematologic, and psychiatric may be the cause. DiagnosisPro, an online medical expert system, listed 497 distinct causes in October 2010"}, {"url": "http://www.rightdiagnosis.com/symptoms/exertional_dyspnea/causes.htm", "passage_text": "Conditions listing medical symptoms: Exertional dyspnea: The following list of conditions have ' Exertional dyspnea ' or similar listed as a symptom in our database. This computer-generated list may be inaccurate or incomplete. Always seek prompt professional medical advice about the cause of any symptom. "}, {"url": "http://www.aafp.org/afp/2012/0715/p173.html", "passage_text": "Chronic dyspnea is shortness of breath that lasts more than one month. The perception of dyspnea varies based on behavioral and physiologic responses. Dyspnea that is greater than expected with the degree of exertion is a symptom of disease. Most cases of dyspnea result from asthma, heart failure and myocardial ischemia, chronic obstructive pulmonary disease, interstitial lung disease, pneumonia, or psychogenic disorders. "}, {"url": "http://www.heart.org/HEARTORG/Encyclopedia/Heart-Encyclopedia_UCM_445084_Encyclopedia.jsp?levelSelected=4&title=dyspnea", "passage_text": "dyspnea. Dyspnea is a condition that causes difficult or labored breathing, often caused by heart conditions. Two types of dyspnea are significant in cardiac illness. Dyspnea on exertion is the shortness of breath that occurs with increasing activity. "}, {"url": "http://www.cvphysiology.com/Heart%20Failure/HF001.htm", "passage_text": "Exertional Dyspnea. Shortness of breath during exercise (exertional dyspnea) produces a sensation of not being able to get enough air and a feeling of being out of breath.. A number of factors can cause exertional dyspnea, but they are usually related to insufficient tissue oxygenation by the blood. "}, {"url": "http://www.rightdiagnosis.com/sym/exertional_dyspnea.htm", "passage_text": "Conditions listing medical symptoms: Exertional dyspnea: The following list of conditions have ' Exertional dyspnea ' or similar listed as a symptom in our database. This computer-generated list may be inaccurate or incomplete. Always seek prompt professional medical advice about the cause of any symptom. "}, {"url": "http://www.bcmj.org/article/exertional-dyspnea-athletes", "passage_text": "Exertional dyspnea in active patients can be challenging to diagnose and to treat. While exercise-induced asthma (EIA) is the most common cause of exertional dyspnea in athletes, two less common causes—vocal cord dysfunction and pulmonary embolism—should also be considered. These less common causes of exertional dyspnea require treatments unlike those used for EIA."}]