[{"url": "https://en.wikipedia.org/wiki/Woolloomooloo,_New_South_Wales", "passage_text": "The current spelling of Woolloomooloo is derived from the name of the first homestead in the area, Wolloomooloo House, built by the first landowner John Palmer. There is debate as to how Palmer came up with the name with different Aboriginal words being suggested. Anthropologist J.D. McCarthy wrote in 'NSW Aboriginal Places Names', in 1946, that Woolloomooloo could be derived from either Wallamullah, meaning place of plenty or Wallabahmullah, meaning a young black kangaroo. It is in a low-lying, former docklands area at the head of Woolloomooloo Bay, on Sydney Harbour. The Domain sits to the west, the locality of East Sydney is near the south-west corner of the suburb and the locality of Kings Cross is near the south-east corner. Potts Point is immediately to the east."}, {"url": "https://www.aboriginalartonline.com/culture/dreamtim.php", "passage_text": "The Dreamtime. The Dreamtime is a widely used, but not well understood, term describing key aspects of Aboriginal spiritual beliefs and life. Following is an extract from an book by Geoff Moore. Myth, Mystery and Meaning of t"}, {"url": "https://en.wikipedia.org/wiki/Australian_Aboriginal_English", "passage_text": "AAE terms, or derivative terms, are sometimes used by the broader Australian community. Australian Aboriginal English is spoken amongst Indigenous people generally but is especially evident in what are called 'discrete communities' i.e. ex-government or mission reserves such as the DOGIT communities in Queensland. Gubbah is a term used by some Aboriginal people to refer to white people. The Macquarie Dictionary has it as ' n. Colloq. (derog.) an Aboriginal term for a white man.' Also,' gubba, n. Colloq. (derog.) 1."}, {"url": "https://en.wikipedia.org/wiki/Woolloomooloo,_New_South_Wales", "passage_text": "Woolloomooloo is 1.5 kilometres east of the Sydney central business district, in the local government area of the City of Sydney. It is in a low-lying, former docklands area at the head of Woolloomooloo Bay, on Sydney Harbour. The Domain sits to the west, the locality of East Sydney is near the south-west corner of the suburb and the locality of Kings Cross is near the south-east corner. Potts Point is immediately to the east."}, {"url": "https://en.wikipedia.org/wiki/Australian_Aboriginal_English", "passage_text": "Australian Aboriginal English (AAE) refers to a dialect of Australian English used by a large section of the Indigenous Australian population. It is made up of a number of varieties which developed differently in different parts of Australia. Gubbah is a term used by some Aboriginal people to refer to white people. The Macquarie Dictionary has it as ' n. Colloq. (derog.) an Aboriginal term for a white man.' Also,' gubba, n. Colloq. (derog.) 1."}, {"url": "http://www.audioenglish.org/dictionary/aboriginal.htm", "passage_text": "2. characteristic of or relating to people inhabiting a region from the beginning. 3. having existed from the beginning; in an earliest or original stage or state. Familiarity information: ABORIGINAL used as an adjective is uncommon. Dictionary entry details. "}, {"url": "http://www.aboriginalartonline.com/culture/dreaming.php", "passage_text": "Dreaming and the Dreamtime. The Dreaming is a term used by Aborigines to describe the relations and balance between the spiritual, natural and moral elements of the world. It is an English word but its meaning goes beyond any suggestion of a spiritual or dream-related state. "}, {"url": "http://dictionaryofsydney.org/entry/woolloomooloo", "passage_text": "Shirley Fitzgerald. Woolloomooloo is the name given to the horseshoe-shaped valley immediately east of the original settlement of Sydney Town. It stretches from William Street down to the harbour, bordered on the west by Sir John Young Crescent and the Domain, and ends abruptly on the east at a high escarpment"}]