[{"url": "http://abcnews.go.com/Health/HeartDiseaseTreatment/story?id=4222997", "passage_text": "Answer: Blood thinning medicines have been available for over a half century, and they can be defined as medicines that reduce the likelihood of small blood clots forming that may cause a heart attack, a stroke, or cardiovascular death. "}, {"url": "http://www.ahrq.gov/patients-consumers/diagnosis-treatment/treatments/btpills/btpills.html", "passage_text": "Your doctor has prescribed a medicine called a blood thinner to prevent blood clots. Blood clots can put you at risk for heart attack, stroke, and other serious medical problems. A blood thinner is a kind of drug called an anticoagulant (an-te-ko-AG-u-lent). Anti means against and coagulant means to thicken into a gel or solid. Blood thinner drugs work well when they are used correctly. To help you learn about your medicine, your doctor has given you this booklet to read."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=2490", "passage_text": "Blood-thinner: A common name for an anticoagulant agent used to prevent the formation of blood clots. Blood-thinners do not really thin the blood. They prevent it from clotting. Blood-thinners (anticoagulants) have various uses. Some are used for the prophylaxis (prevention) of thromboembolic disorders; others are used for the treatment of thromboembolism."}, {"url": "http://www.wisegeek.org/what-is-blood-thinner.htm", "passage_text": "The most common blood thinner is aspirin, an antiplatelet drug that has been recognized as a blood thinner since the middle of the 20th century. Often, a daily dose of aspirin is the only required cardiac medicine for people who are at risk for heart attack, stroke or heart disease. Heparin. Another type of blood thinner, heparin, is injected directly into the blood stream and inhibits the actions of thrombin. It is often used during certain types of surgery, blood transfusions and dialysis, and it might be used to help keep intravenous (IV) lines from clotting."}, {"url": "http://www.wisegeek.org/what-is-blood-thinner.htm", "passage_text": "10 hilariously insightful foreign words. A blood thinner, or anticoagulant, is a drug that is used to prevent blood clots from forming or to lengthen the time that it takes for blood clots to form. These drugs are often used by people who are at risk for heart attack, stroke or heart disease. Heparin. Another type of blood thinner, heparin, is injected directly into the blood stream and inhibits the actions of thrombin. It is often used during certain types of surgery, blood transfusions and dialysis, and it might be used to help keep intravenous (IV) lines from clotting."}, {"url": "http://www.blood-thinners.org/", "passage_text": "What are anticoagulants. Anti-coagulants, or blood thinners, are used to stop platelets in the blood's plasma from forming clots. People who are at risk of a heart attack, stroke or an aneurysm are most often prescribed blood thinning medications. The side effects of most prescription blood thinners are extremely severe. Warfarin one of the most commonly prescribed blood thinners is used to rat poison to induce internal bleeding. Heparin can cause Heparin-induced thrombocytopenia (HIT), a very dangerous side effect."}, {"url": "https://en.wikipedia.org/wiki/Blood_thinner", "passage_text": "Anticoagulants are a class of drugs that work to prevent the coagulation (clotting) of blood. Such substances occur naturally in leeches and blood-sucking insects. A group of pharmaceuticals called anticoagulants can be used as an injection into human beings as a medication for thrombotic disorders. Anticoagulants reduce blood clotting which can help prevent deep vein thrombosis, pulmonary embolism, myocardial infarction and ischemic stroke."}, {"url": "http://www.webmd.com/heart-disease/guide/warfarin-other-blood-thinners", "passage_text": "Font Size. A. A. A. Warfarin, which goes by the brand name Coumadin, is an anticoagulant medication. This means that it helps prevent clots from forming in the blood. Blood thinners are used to treat some types of heart disease. You have been prescribed warfarin because your body may be making blood clots or you may have a medical condition known to promote unwanted blood clots. There are other blood thinners that you may be given in the hospital or even at home for a short amount of time: Heparin, Lovenox, or Fragmin. These drugs are administered either by vein (intravenous) or just under the skin into the subcutaneous fat. Blood thinners orally in a pill include Eliquis, Pradaxa, and Xarelto."}, {"url": "http://www.mayoclinic.org/blood-thinners/expert-answers/FAQ-20058261", "passage_text": "Yes. Medications that are commonly called blood thinners — such as aspirin, warfarin (Coumadin, Jantoven), dabigatran (Pradaxa), rivaroxaban (Xarelto), apixaban (Eliquis) and heparin — significantly decrease your risk of blood clotting, but will not decrease the risk to zero. Also, blood thinners may not be able to lessen the strong blood-clotting tendency of an underlying disease, such as cancer. Interactions with other medications, food and alcohol are common with warfarin."}, {"url": "http://www.healthline.com/health/heart-disease/blood-thinners", "passage_text": "Learn how they work, who should take them, side effects, and natural remedies. Blood thinners are medications taken orally or intravenously to prevent a blood clot. Blood clots stop the flow of blood to the heart, lungs, or brain and can cause a heart attack or stroke. "}]