[{"url": "http://www.apl-shelter.org/dotnetnuke/SpayNeuterClinic/FeralCatProgram/FeralCatFrequentlyAskedQuestions/tabid/132/Default.aspx", "passage_text": "Do not ever release a feral cat once trapped, even if you discover she is nursing kittens; you might never trap her again. Most of the time the kittens will be alright for 24 hours and the queen will continue nursing when returned after her sterilization surgery."}, {"url": "http://fixourferals.org/home/trapping-care/recovery-tips/", "passage_text": "Recovery Tips & Tricks. After you trap your cat, and get it neutered you will need to keep the cats for a minimum of 24 hours fro males, and 3 days for females in order for the cat to properly recover from surgery before being returned top their outdoor home."}, {"url": "http://www.alleycat.org/Page.aspx?pid=462", "passage_text": "1 Cats usually can be returned to their outdoor home within 24 hours after surgery, depending on recovery speed. 2  Male cats and often females can be returned to the trapping site 12 to 24 hours following surgery, as long as they are fully awake and do not require further medical attention."}, {"url": "http://littlebuddies.org/feralcats.htm", "passage_text": "Before trapping a feral cat you should make plans with a veterinarian so that the vet can be ready to spay/neuter the cat within 24 hours. The cat can be tranquilized through the bars of the cage and then placed back in the cage after surgery."}, {"url": "http://www.operationpets.org/feral_cats.php3", "passage_text": "1 Cats usually need to be held for 24 hours after surgery, depending on recovery speed. 2  Cats can be returned to the trapping site 12-24 hours following surgery as long as they are fully awake and do not require further medical attention."}, {"url": "http://www.operationpets.org/feral_cats.php3", "passage_text": "FERAL CAT PROTOCOL 1. Operation PETS will do our best to fit a feral cat into our surgery schedule (Monday, Tuesday and Thursday). Trapping should coincide with our clinic s ability to spay/neuter so the cats don t remain in their traps for long."}, {"url": "http://www.alleycat.org/Page.aspx?pid=332", "passage_text": "Hold cats until they recover. Cats usually need to be held for 24 hours after surgery, depending on recovery speed. Male cats and often females can be returned to the trapping site 12 to 24 hours following surgery, as long as they are fully awake and do not require further medical attention."}, {"url": "http://www.alleycat.org/Page.aspx?pid=462", "passage_text": "1 Male cats and often females can be returned to the trapping site 12 to 24 hours following surgery, as long as they are fully awake and do not require further medical attention. 2  In some cases, females may need 48 hours of recovery, depending on their specific circumstances."}]