[{"url": "http://smallbusiness.chron.com/effects-gender-discrimination-workplace-2860.html", "passage_text": "The Effects of Gender Discrimination in the Workplace. Gender discrimination can cause many negative effects on victims and businesses. gender simbol image by Nataliya Galkina from Fotolia.com. According to TNS Research Surveys, 68 percent of women surveyed believe gender discrimination exists in the workplace. Federal law protects women and other minorities from discrimination in the work place. The Equal Pay Act of 1963 ended the practice of paying men more than women when performing the same jobs and duties. In 1964, the Civil Rights Act extended this protection to other minorities"}, {"url": "http://smallbusiness.chron.com/ways-discrimination-negatively-affects-businesses-36925.html", "passage_text": "The Ways Discrimination Negatively Affects Businesses. High-profile discrimination settlements have cost large corporations hundreds of millions of dollars. While your small business is unlikely to be forced to pay an amount that extreme, discrimination can still have a significant impact on the bottom line. Job Satisfaction and Motivation. Discriminatory practices affect the job satisfaction of all employees -- not just those who are discriminated against. Promotions, bonuses and benefits should be awarded based upon the candidate's qualifications and performance on the job."}, {"url": "http://yourbusiness.azcentral.com/gender-discrimination-affect-workplace-2546.html", "passage_text": "Increases Employee Turnover. When a worker is a victim of gender discrimination, she could reconsider the value of her job and find it lacking. Her interest in the work could diminish. According to Bloomberg Business Week, employees discriminated against can easily become demoralized and develop a bad attitude."}, {"url": "https://en.wikipedia.org/wiki/Employment_discrimination", "passage_text": "Employment discrimination is a form of discrimination based on race, gender, religion, national origin, physical or mental disability, and age by employers. Earnings differentials or occupational differentiation is not in and of itself evidence of employment discrimination. [2010] sum up the argument for government intervention to address discrimination. First, discrimination prevents equity or fairness, when an equally qualified person does not receive equal treatment as another on account of race or gender."}, {"url": "http://www.brighthub.com/office/human-resources/articles/87966.aspx", "passage_text": "The crippling effects of workplace discrimination include poor work culture and a demoralized workforce, debilitating effect on the individual, negative fallout for the society, and reduced profits for the organization. slide 1 of 7. Loss of Focus and Productivity. Another negative effect of workplace employee discrimination is loss of focus and wasting of time. Discrimination in the workplace is not just the focus of the victim, but also tends to take priority in various meetings."}, {"url": "http://www.brighthub.com/office/human-resources/articles/87966.aspx", "passage_text": "Workplace discrimination refers to a work environment that exhibits bias in the treatment of employees or discriminatory behavior by any employee to other employees based on factors such as marital status, gender, pregnancy, sexual preference, race, color, nationality, disability, belief, and age. Loss of Focus and Productivity. Another negative effect of workplace employee discrimination is loss of focus and wasting of time. Discrimination in the workplace is not just the focus of the victim, but also tends to take priority in various meetings."}, {"url": "http://yourbusiness.azcentral.com/gender-discrimination-affect-workplace-2546.html", "passage_text": "Gender discrimination in the workplace has a long history and continues to occur. According to Target Law, gender discrimination is the most frequent type of employment violation. The effects of this type of bias on a company are often palpable. The atmosphere might become one in which employees are mistrustful, apprehensive and discontented. When a worker is a victim of gender discrimination, she could reconsider the value of her job and find it lacking. Her interest in the work could diminish. According to Bloomberg Business Week, employees discriminated against can easily become demoralized and develop a bad attitude."}, {"url": "http://smallbusiness.chron.com/ways-discrimination-negatively-affects-businesses-36925.html", "passage_text": "Reputation and Recruitment. Discriminatory practices affect your company's reputation within the community it serves. Discrimination may affect clients directly if your company provides inferior service to a certain group of people based upon particular demographic criteria, such as race. But customers can also be indirectly discriminated against. Job Satisfaction and Motivation. Discriminatory practices affect the job satisfaction of all employees -- not just those who are discriminated against. Promotions, bonuses and benefits should be awarded based upon the candidate's qualifications and performance on the job."}, {"url": "http://www.workplacefairness.org/sexual-gender-discrimination", "passage_text": "Sex or gender discrimination may be accompanied by other forms of illegal discrimination as well, such as age, race, or disability discrimination. Pregnancy discrimination and sexual harassment are also considered forms of sex discrimination under the law. As noted throughout this page, there are other forms of discrimination on the basis of sex that are not sexual harassment, such as discrimination in hiring, firing, promotions or benefits, pay discrimination, and gender stereotyping."}]