[{"url": "http://www.answers.com/Q/Does_Pluto_have_a_tilted_orbit", "passage_text": "Pluto has a tilted orbit (compared with the average plane of the orbits of the other planets). Also, Pluto would be considered a terrestrial planet, but it is not now defi … ned as a planet. It's just called a dwarf planet now. 1 person found this useful. Yes, Pluto's orbit is tilted by more than 17 degrees, far more than any other planet."}, {"url": "http://www.space.com/3115-pluto-data-sheet.html", "passage_text": "It will remain the ninth planet for 228 years. Pluto's orbit is inclined, or tilted, 17.1 degrees from the ecliptic -- the plane that Earth orbits in. Except for Mercury's inclination of 7 degrees, all the other planets orbit more closely to the ecliptic. Pluto's 248-year orbit is off-center in relation to the sun, which causes the planet to cross the orbital path of Neptune. From 1979 until early 1999, Pluto had been the eighth planet from the sun."}, {"url": "http://www.answers.com/Q/Why_does_Pluto_have_a_tilted_orbit", "passage_text": "Pluto has a tilted orbit (compared with the average plane of the orbits of the other planets). Also, Pluto would be considered a terrestrial planet, but it is not now defi … ned as a planet. It's just called a dwarf planet now. "}, {"url": "http://www.nasa.gov/audience/forstudents/k-4/stories/what-is-pluto-k4_prt.htm", "passage_text": "Pluto was known as the smallest planet in the solar system and the ninth planet from the sun. Today, Pluto is called a dwarf planet.. A dwarf planet orbits the sun just like other planets, but it is smaller. A dwarf planet is so small it cannot clear other objects out of its path. Pluto is in the center. The moon Charon is just below it. The newly discovered moons, Nix and Hydra, are to the right of Pluto and Charon. Image Credit: NASA, ESA, H. Weaver (JHU/APL), A. Stern (SwRI), and the HST Pluto Companion Search Team. View Larger Image →. A drawing of the solar system shows Pluto's tilted orbit. Pluto's orbital path angles 17 degrees above the line, or plane, where the eight planets orbit"}, {"url": "http://www.universetoday.com/13865/orbit-of-pluto/", "passage_text": "Take a look at the Solar System from above, and you can see that the planets make nice circular orbits around the Sun. But dwarf planet’s Pluto’s orbit is very different. It’s highly elliptical, traveling around the Sun in a squashed circle. And Pluto’s orbit is highly inclined, traveling at an angle of 17-degrees. Instead, Pluto orbits at an angle of 17-degrees. For part of its orbit, Pluto is above the plane of the ecliptic (where the other planets orbit) and other times it’s below that plane. Because the orbit of Pluto varies so widely, it can switch places with Neptune, orbiting closer to the Sun."}, {"url": "http://www.nasa.gov/audience/forstudents/5-8/features/what-is-pluto-58_prt.htm", "passage_text": "Today, Pluto is called a dwarf planet. A dwarf planet is round and orbits the sun just like the eight major planets. But unlike a planet, a dwarf planet does not have enough gravity to attract all of the space dust and tiny objects in its path. A dwarf planet also is much smaller than a planet, but it is not a moon. Most of the other planets orbit the sun in a near-circle with the sun in the center. But Pluto's orbit is an ellipse, and the sun is not in the center. Pluto's orbit is also tilted compared to the orbits of the planets."}, {"url": "http://www.universetoday.com/13865/orbit-of-pluto/", "passage_text": "Astronomers call this orbit eccentric because Pluto follows an orbit that traces out an elongated ellipse around the Sun. Pluto’s orbit is also highly inclined. This means that it doesn’t orbit within the same plane as the rest of the Solar System. Instead, Pluto orbits at an angle of 17-degrees. For part of its orbit, Pluto is above the plane of the ecliptic (where the other planets orbit) and other times it’s below that plane. Because the orbit of Pluto varies so widely, it can switch places with Neptune, orbiting closer to the Sun."}, {"url": "http://pluto.jhuapl.edu/Participate/learn/What-We-Know.php?link=The-Basics", "passage_text": "For about 20 years in each orbit, Pluto is actually closer to the Sun than Neptune. Most of the planets orbit the Sun close to the same plane (called the ecliptic). Pluto's orbit is tilted (by 17.14 degrees) with respect to this plane, the highest inclination of any planet in the solar system. Mercury's inclination is second highest at 7 degrees. The picture below is a sideways view, looking at the solar system from the side and a little above the ecliptic plane. "}]