[{"url": "http://www.all-battery.com/inverterfaq.aspx", "passage_text": "The recommended inverter to run 1200 Watt continuous and 4800 Watt peak surge microwave is 2500/5000 Watt inverter or larger. In general, induction motors require an initial surge of power to start up (starting load or peak load)."}, {"url": "http://www.instructables.com/answers/Can-I-make-an-uninterruptible-power-supply-for-my-/", "passage_text": "You probably don't need a huge inverter. The fan will be your biggest draw, so look at that and see how many watts it says on the label, then add at least %50. If it says 200w, get a 300w inverter. If it says 500w, get a 750w inverter. Etc. Either way, an average car battery should run your furnace for 20 hours easily. You can also buy a pre-made battery pack to do the same job."}, {"url": "http://kissurvival.com/running-your-gas-furnace-from-a-generator-or-inverter/", "passage_text": "One last note, use a good extension cord between your generator or inverter and the furnace. Use a heavy duty 12 gauge grounded cord. Harbor freight sells a 25 ft 12/3 cord for $19.99 and a 50 ft 12/3 cord for $29.99."}, {"url": "http://kissurvival.com/running-your-gas-furnace-from-a-generator-or-inverter/", "passage_text": "The safe and legal ways are a Furnace Transfer Switch or a Furnace Interlock Device. Both make sure your temporary power from a generator or inverter cannot mix with your grid power. A transfer switch can run $100 or more plus installation costs. An interlock device can be $50 and can be hard to find for just your furnace. My preference is to wire your furnace in such a way that it meets code, prevents mixing temporary and grid power and costs less than $10 per furnace in parts."}, {"url": "http://powerequipment.honda.com/generators/generator-how-much-power", "passage_text": "Gas or oil forced air systems can get by with a very small generator – as little as 2500 watts. The power needed is based on the size of the furnace fan motor. See below for details. Electric furnaces and heat pumps typically need 15,000 watts or more to run and cannot be powered by a portable generator."}, {"url": "http://kissurvival.com/running-your-gas-furnace-from-a-generator-or-inverter/", "passage_text": "That said, he shows a simple, safe and inexpensive way to set your gas furnace up to run on a generator or inverter during an emergency. I did the modifications on both of my furnaces in less than an hour and for a total cost for both furnaces of less than $15."}]