[{"url": "http://www.mnn.com/food/healthy-eating/blogs/what-does-artisanal-mean", "passage_text": "Even the box for the pizza says in very large letters “We’re Not Artisans” and explains that the pizza is made with the kind of “passion and integrity to convince you we are.” Then, the box is supposed to be signed by the person that made the pizza. Really. I’m not kidding you. The fake artisan signs the pizza box. Domino’s isn’t the first chain to call its food artisanal. Panera Bread describes its breads as artisan. Wendy’s offers an egg sandwich on a honey-wheat artisan muffin. None of these foods are truly artisan. "}, {"url": "http://slice.seriouseats.com/archives/2011/10/dominos-artisan-pizza.html", "passage_text": "A couple months back, Domino's announced its new line of Artisan pizzas. Now, Domino's freely admits that they're not artisans. It says so right there on the box. (Then, confusingly in small print, it also says that they might be artisans). They also promise that every single Artisan pizza box will be signed by the employee who made it. These new Artisan pies might actually push Domino's over the edge into the best thing around. I just wish that they'd let you choose your own toppings. Dear Domino's: Good work on what's actually a pretty darn good crust."}, {"url": "http://www.grubgrade.com/reviews/review-new-artisan-pizzas-from-dominos", "passage_text": "Review: New Artisan Pizzas from Domino’s. Posted September 20th, 2011 | 4:50pm by Ryan. I’ve always held Domino’s at the #2 position when it comes to the Big 3 pizza chains. Papa Johns 1st, Domino’s 2nd, Pizza Hut a distant 3rd. $7.99 will get you an Artisan Pizza. They are rectangular (13″ x 9″) and there is more emphasis on cheese flavors and toppings rather than sauces and crust. That said, I really loved the thinner crust. Nice chew, not at all cracker-like, and holds the toppings together well."}, {"url": "http://www.pizzamaking.com/forum/index.php?topic=20258.0", "passage_text": "A few years ago, Evelyne Slomon, the author of The Pizza Book, discussed her views on what an artisan pizza is or should be, at Reply 606 at http://www.pizzamaking.com/forum/index.php/topic,576.msg41054/topicseen.html#msg41054. I was trying to focus on the SAUCE. I was wondering if anyone else has used MARJORAM in their sauce. This is one spice that i have not used in pizza sauce. Also, the sauce for Artisan pizza, according to this article, seems very basic."}, {"url": "http://www.pizzamaking.com/forum/index.php?topic=20258.0", "passage_text": "Agreed, but I'll go so far as to say 'artisan' is nothing but a marketing term, used by makers of bad pizza to trick consumers into thinking their bad pizza is something special. Much like 'gourmet.'. EDIT: ...which I guess is pretty much what everyone else has already said, now that I've read the other responses. I was trying to focus on the SAUCE. I was wondering if anyone else has used MARJORAM in their sauce. This is one spice that i have not used in pizza sauce. Also, the sauce for Artisan pizza, according to this article, seems very basic."}, {"url": "http://www.kingarthurflour.com/recipes/artisan-no-knead-pizza-crust-recipe", "passage_text": "two 10 to 12 pizzas. This Roman-style pizza is reminiscent of the artisan wood-fired pies that are all the rage on the West Coast. The pizza is light but not flat; substantial but far from bready, with a light and pillowy crust that's equal parts chewy gluten and air. In short, it's pizza perfection. Julia Reed. This Roman-style pizza is reminiscent of the artisan wood-fired pies that are all the rage on the West Coast. The pizza is light but not flat; substantial but far from bready, with a light and pillowy crust that's equal parts chewy gluten and air."}, {"url": "http://www.grubgrade.com/reviews/review-new-artisan-pizzas-from-dominos", "passage_text": "Your choices of Artisan Pizza are Spinach & Feta, Italian Sausage & Pepper Trio and Tuscan Salami & Roasted Veggie. Spinach & Feta. Spinach & Feta: Alfredo sauce, feta and parmesan-asiago cheeses, fresh baby spinach and onion toppings. All balanced and baked to perfection on an artisan-style crust. $7.99 will get you an Artisan Pizza. They are rectangular (13″ x 9″) and there is more emphasis on cheese flavors and toppings rather than sauces and crust. That said, I really loved the thinner crust. Nice chew, not at all cracker-like, and holds the toppings together well."}, {"url": "http://www.pizzamaking.com/forum/index.php?topic=20258.0", "passage_text": "An artisan pizza is one made up of the same basic ingredients as a standard pizza, baked in any one of several different types of ovens like a standard pizza, is consumed, digested, and excreted like a standard pizza but then, you end up paying four times as much compared to a standard pizza. I was trying to focus on the SAUCE. I was wondering if anyone else has used MARJORAM in their sauce. This is one spice that i have not used in pizza sauce. Also, the sauce for Artisan pizza, according to this article, seems very basic."}, {"url": "http://www.pizzamaking.com/forum/index.php?topic=20258.0", "passage_text": "Actually that is is the first site listed for define artisan pizza in a google search. http://howiesartisanpizza.com/media/What-ArtisanPizza_10.07.09.pdf. Tom, I would think a minimalist sauce with a quality crushed tomato would be in order. I was trying to focus on the SAUCE. I was wondering if anyone else has used MARJORAM in their sauce. This is one spice that i have not used in pizza sauce. Also, the sauce for Artisan pizza, according to this article, seems very basic."}]