[{"url": "http://www.gardeningknowhow.com/plant-problems/pests/insects/ants-in-flower-pots.htm", "passage_text": "1 Place the plant container inside a bucket or tub. 2  Make a solution using one or two tablespoons of insecticidal soap per quart of water. 3  Fill the bucket or tub until the solution barely covers the surface of the potting soil. 4  Let the plant soak for 20 minutes. Advertisement. The way you care for your plants can also be a source of ant problems. You may see ants in flower pots when you’ve been using home remedies that include sugar or honey. Pick up leaves that fall onto the potting soil and provide a cozy hiding place for ants."}, {"url": "http://www.gardeningknowhow.com/plant-problems/pests/insects/ants-in-flower-pots.htm", "passage_text": "Here is a simple procedure that will eliminate the ants once and for all: 1  Place the plant container inside a bucket or tub. 2  Make a solution using one or two tablespoons of insecticidal soap per quart of water. 3  Fill the bucket or tub until the solution barely covers the surface of the potting soil. Advertisement. The way you care for your plants can also be a source of ant problems. You may see ants in flower pots when you’ve been using home remedies that include sugar or honey. Pick up leaves that fall onto the potting soil and provide a cozy hiding place for ants."}, {"url": "http://www.gardenguides.com/118643-kill-ants-flower-pots.html", "passage_text": "Overview. Ants in flower pots generally do not cause any harm, but they are quite the nuisance. They may even be nesting in your flower pot, giving you a serious ant problem in your home. Killing ants in flower pots is possible, but it may take several treatments if you do not just repot the plant. Step 1. Place an ant bait in the flower pot. The ants will take the bait back to their nest (which may be in the flower pot) and kill the colony. Alternatively, make your own bait by mixing 1 part powdered boric acid for every 50 to 100 parts of bait material, such as peanut butter, condensed milk or bacon grease."}, {"url": "http://www.gardenguides.com/118643-kill-ants-flower-pots.html", "passage_text": "Ants in flower pots generally do not cause any harm, but they are quite the nuisance. They may even be nesting in your flower pot, giving you a serious ant problem in your home. Step 1. Place an ant bait in the flower pot. The ants will take the bait back to their nest (which may be in the flower pot) and kill the colony. Alternatively, make your own bait by mixing 1 part powdered boric acid for every 50 to 100 parts of bait material, such as peanut butter, condensed milk or bacon grease."}, {"url": "http://www.gardeningknowhow.com/plant-problems/pests/insects/ants-in-flower-pots.htm", "passage_text": "If you find ants in your indoor plants, take them outside immediately so the ants don’t become established inside your home. To get rid of the ants nesting in container plants, you’ll need a bucket or tub larger and deeper than your flower pot and concentrated insecticidal soap, available at any garden supply store. Advertisement. The way you care for your plants can also be a source of ant problems. You may see ants in flower pots when you’ve been using home remedies that include sugar or honey. Pick up leaves that fall onto the potting soil and provide a cozy hiding place for ants."}, {"url": "http://homeguides.sfgate.com/kill-ants-flowerpots-94081.html", "passage_text": "Ant Traps. Use baited ant traps to capture and kill ants in pots. Make the bait by dissolving 1 teaspoon of boric acid and 6 tablespoons of sugar in two cups of water. The sugar attracts the ants, and the boric acid kills them. "}, {"url": "http://www.wikihow.com/Remove-Ants-from-Potted-Plants", "passage_text": "How to Remove Ants from Potted Plants. Ants-clever little creatures but quite a nuisance too if they're in the wrong place! An ant infestation of your beloved pot plants is not good; ants will disturb the plants roots and possibly end up killing the plant. Time to give those ants their marching orders! "}, {"url": "http://www.gardenguides.com/118643-kill-ants-flower-pots.html", "passage_text": "Keep children and animals away from any kind of ant bait. Spray an insecticide labeled to kill ants on top of the soil. Or, make your own with 1 gallon of water mixed with ½ tsp. of eucalyptus oil, 1 tbsp. of vegetable oil and 1 tbsp. of liquid dish soap. Do not spray plant. Step 1. Place an ant bait in the flower pot. The ants will take the bait back to their nest (which may be in the flower pot) and kill the colony. Alternatively, make your own bait by mixing 1 part powdered boric acid for every 50 to 100 parts of bait material, such as peanut butter, condensed milk or bacon grease."}]