[{"url": "http://www.answers.com/Q/What_foods_do_cane_toads_eat", "passage_text": "Anything, in quantity. Well, except cane beetles. Introduced to Australia in 1935 as an attempt to reduce the populations of cane beetles, the cane toad Bufo marinus has been an environmental disaster. It has become so widespread and populous mainly because it will eat anything that moves. Baby toads can eat ants, small crickets, or meal worms. I have a baby toad, and she is just now starting to eat moving baby crickets, but before that, I spoon fed her su … pplement formula which you can find at a pet store, and it is filled with little dead insects that you just feed to your baby toad."}, {"url": "http://australianmuseum.net.au/cane-toad", "passage_text": "Marine snails, smaller toads and native frogs, small snakes, and small mammals are occasionally eaten by Cane Toads.The tadpoles of Cane Toads eat algae and other aquatic plants which they rasp off with five rows of tiny peg-like teeth. They also filter organic matter from the water. Cane Toads were introduced to Australia to eat French's Cane Beetle and the Greyback Cane Beetle. The 'whitegrub' larvae of these beetles eat the roots of sugar cane and kill or stunt the plants."}, {"url": "http://www.nwf.org/Wildlife/Wildlife-Library/Amphibians-Reptiles-and-Fish/Toads.aspx", "passage_text": "Cane toads are the largest toads and grow up to nine inches in length. A massive cane toad caught in Australia has been described as the size of a small dog! Diet: Like frogs, most toads eat insects and other arthropods. However, some species eat reptiles, small mammals, and even other amphibians. Typical Lifespan: The common toad (Bufo bufo) lives up to 40 years, but most toad species live approximately five to ten years."}, {"url": "http://www.answers.com/Q/What_do_toads_eat", "passage_text": "Passionate about all things Australian. Toads are carnivores and do not eat vegetation, except when they are tadpoles, when they eat freshwater algae and other water plants. Adult toads eat insects and invertebrates, such as flies, grasshoppers, spiders, beetles, crickets, grubs, slugs, centipedes, millipedes and worms. Larger types of toad, such as cane toads, are big enough to eat small rodents like mice as well, and small lizards. Since their introduction to Australia, cane toads have posed a great threat to native frog species, eating them as well. "}, {"url": "http://www.whatdotheyeat.info/what-do-cane-toads-eat/", "passage_text": "Cane Toads normally prey on insects and will eat any animal that they can ingest. Cane Toads eat almost anything such as small lizards, frogs, birds, fish, mice, bees, worms, dung beetles, scarab beetles and even younger Cane Toads. Cane toads are popular pets because the novelty aspect due to their large size. An adult cane toad can weigh up to 4 pounds, so they can consume large quantities of food. The cane toad’s main prey is insects, but will eat any animal it can fit into its mouth. This may include worms, large wood ants, beetles, smaller cane toads, fish, mice, rats, and other frogs. All of which may be purchased at your local pet shop"}, {"url": "https://en.wikipedia.org/wiki/Cane_Toad", "passage_text": "The cane toad (Rhinella marina), also known as the giant neotropical toad or marine toad, is a large, terrestrial true toad which is native to Central and South America, but has been introduced to various islands throughout Oceania and the Caribbean, as well as northern Australia. The cane toad is an old species. A fossil toad (specimen UCMP 41159) from the La Venta fauna of the late Miocene of Colombia is indistinguishable from modern cane toads from northern South America."}, {"url": "http://www.qm.qld.gov.au/Find+out+about/Animals+of+Queensland/Frogs/Cane+Toad", "passage_text": "A handful of native animals can eat Cane Toads and survive. Amongst these are the Snapping Turtle, Wollumbinia latisternum; the Freshwater Snake, Tropidonophis mairii; the saltwater crocodile, Crocodylus porosus; the Water Rat, Hydromys chrysogaster; and some birds such as ibises and the Torresian Crow, Corrus orru. "}]