[{"url": "http://www.cusd4.org/vimages/shared/vnews/stories/4e679ba30e7a0/Types%20of%20Animal%20Digestive%20Systems.pdf", "passage_text": "Besideshorses, examples of pseudo-ruminants are rabbits, guinea pigs, and hamsters. Summary: Digestion is the process of breaking down feed into simple substances that can beabsorbed into the bloodstream. The four basic types of digestive systems in animalsare monogastric, avian, ruminant, and pseudo-ruminant."}, {"url": "http://www.wikihow.com/Study-the-Physiology-of-Digestion-in-the-Human-Body", "passage_text": "2. Study the distinctiveness of the digestion process in humans. This involves mostly the degradation of three basic types of macromolecules: 1  One type of these macromolecules is the protein group of molecules. 2  The other group is the group of sugars that are called carbohydrates."}, {"url": "http://www.webmd.com/heartburn-gerd/your-digestive-system", "passage_text": "The mouth is the beginning of the digestive tract. In fact, digestion starts here as soon as you take the first bite of a meal. Chewing breaks the food into pieces that are more easily digested, while saliva mixes with food to begin the process of breaking it down into a form your body can absorb and use."}, {"url": "https://msu.edu/~potters6/te801/Biology/biounits/digestion.htm", "passage_text": "Big Ideas Digestion. Digestion is the breakdown of food into simpler molecules that can be absorbed by the body. The digestive system is actually a long hollow tube called the gastrointestinal tract, or GI tract. The digestive system includes the mouth, pharynx, esophagus, stomach, small intestine, and large intestine."}, {"url": "http://www.dummies.com/how-to/content/the-human-digestion-process.html", "passage_text": "Digestion is the process of changing food into a form that the body can absorb and use as energy or as the raw materials to repair and build new tissue."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookDIGEST.html", "passage_text": "The digestive system uses mechanical and chemical methods to break food down into nutrient molecules that can be absorbed into the blood. Once in the blood, the food molecules are routed to every cell in the animal's body. There are two types of animal body plans as well as two locations fordigestion to occur."}, {"url": "http://www.wikihow.com/Study-the-Physiology-of-Digestion-in-the-Human-Body", "passage_text": "3. The absorption of proteins takes place in the human body through a process of digestion using enzymes called proteases. Protein is broken down into amino acids and absorbed using these enzymes, which make it possible to use the proteins from your food for the things your body needs them for."}]