[{"url": "https://en.wikipedia.org/wiki/Austrians", "passage_text": "For an analysis on the nationality or Austrian citizenship, see Austrian nationality law. Austrians (German: Österreicher) österreicher are A germanic ethnic, group consisting of the population of The republic Of, austria who share a Common austrian culture And austrian descent and. history Austria had been a part of the Holy Roman Empire of the German Nation, and was a member of the German Confederation, but after the Austro-Prussian war of 1866, Austria was effectively expelled from the Confederation by Prussia. Thus, when the German Empire was founded in 1871, Austria was not a part of it."}, {"url": "http://www.telegraph.co.uk/news/worldnews/europe/austria/10878598/Austria-announces-drive-to-preserve-its-own-version-of-German-language.html", "passage_text": "It has been said of Austria and Germany, as of Britain and the USA, that they are divided by a common language. While Austrians and Germans can understand each other, there are many words and phrases that mark Austrian German out as different. When Austria joined the EU in 1995, it insisted its version of the language be given protected status."}, {"url": "https://en.wikipedia.org/wiki/Austrians", "passage_text": "Austrians (German: Österreicher) österreicher are A germanic ethnic, group consisting of the population of The republic Of, austria who share a Common austrian culture And austrian descent and. History The english Term austrians was applied to the population Of Habsburg austria from the 17th or 18th. century Austria had been a part of the Holy Roman Empire of the German Nation, and was a member of the German Confederation, but after the Austro-Prussian war of 1866, Austria was effectively expelled from the Confederation by Prussia. Thus, when the German Empire was founded in 1871, Austria was not a part of it."}, {"url": "https://en.wikipedia.org/wiki/Austrian_German", "passage_text": "With German being a pluricentric language, German dialects in Austria should not be confused with the variety of Standard German spoken by most Austrians, which is distinct from that of Germany or Switzerland. Thus Standard Austrian German has the same geographic origin as the Standard German of Germany (Bundesdeutsches Hochdeutsch, also Deutschlaendisches Deutschländisches) deutsch And Swiss High (German Schweizer, hochdeutsch not to be confused with The Alemannic Swiss german). dialects"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20100909070118AAlHVle", "passage_text": "Report Abuse. They are not the same people, Germans are Germans and Austrians are Austrians. Just because they share a language does not mean that they share the same ethnicity, nationality or culture. Some places have changed hands due to war or marriage (as gifts in dowries). Mozart always thought of himself as German but his birthplace is now in Austria so people say he is ''Austrian'' not ''German'' Hitler was born in Austria but he wanted to bring all Germans into one state, but he was ''Austrian'' because of his..."}, {"url": "https://en.wikipedia.org/wiki/Austrian_German", "passage_text": "From Wikipedia, the free encyclopedia. Austrian German (German: Österreichisches österreichisches), Deutsch Austrian Standard, German Standard Austrian (German: Österreichisches Oesterreichisches) österreichisches Standarddeutsch Or Austrian (High: Österreichisches German), oesterreichisches österreichisches hochdeutsch is The Variety of standard german written And. spoken in austria Thus Standard Austrian German has the same geographic origin as the Standard German of Germany (Bundesdeutsches Hochdeutsch, also Deutschlaendisches Deutschländisches) deutsch And Swiss High (German Schweizer, hochdeutsch not to be confused with The Alemannic Swiss german). dialects"}, {"url": "http://www.thelocal.at/20140613/what-do-austrians-think-of-germans", "passage_text": "Language spat. There’s a German joke that Austrians want to persuade the world that Hitler was German and Beethoven Austrian. Austria is preparing to fight off another invasion-of the German language. The country’s education minister has announced a major new drive to preserve the unique Austrian form of German. “In my experience, though most people don't know my mum is German, Austrians tend to think of Germans as arrogant, show-offish, uptight, too-direct and lacking humour (especially when it comes to Austrians being mean to them to their face),” she says."}, {"url": "http://www.thelocal.de/20140614/what-do-austrians-really-think-of-germans-the-local", "passage_text": "Germans and Austrians are the odd couple of Europe. They speak almost the same language, share a troubled history, and watch many of the same TV shows. 1  Austria threatens action over motorway toll (23 Dec 13). 2  German pension tax bills anger Austrians (29 Mar 13). ' 3 Austrians have humour, Germans not so much' (28 Feb 13). Language spat. There’s a German joke that Austrians want to persuade the world that Hitler was German and Beethoven Austrian. Austria is preparing to fight off another invasion-of the German language. The country’s education minister has announced a major new drive to preserve the unique Austrian form of German."}, {"url": "https://en.wikipedia.org/wiki/Austrians", "passage_text": "Historically, Austrians were considered to be Germans and viewed themselves as such. Austria had been a part of the Holy Roman Empire of the German Nation, and was a member of the German Confederation, but after the Austro-Prussian war of 1866, Austria was effectively expelled from the Confederation by Prussia. Thus, when the German Empire was founded in 1871, Austria was not a part of it."}]