[{"url": "http://www.history.com/topics/world-war-ii/battle-of-guadalcanal", "passage_text": "Introduction. The World War II Battle of Guadalcanal was the first major offensive and a decisive victory for the Allies in the Pacific theater. With Japanese troops stationed in this section of the Solomon Islands, U.S. marines launched a surprise attack in August 1942 and took control of an air base under construction. "}, {"url": "http://www.guadalcanal.com/index.html", "passage_text": "The main airport in the Solomon Islands is Henderson International Airport, 8 km outside Honiara, on Guadalcanal. Solomon Airlines flies into this airport from cities around the South Pacific, including Brisbane, Australia, Auckland, New Zealand, and Nadi, Fiji. Introduction to Guadalcanal: Guadalcanal is the largest island in the Solomon Islands, the third largest archipelago in the South Pacific, with 992 islands and a total area of 28,450 square kilometers. The capital of the Solomon Islands, Honiara, a picturesque seaport with a population of 54,600, is located on the northern coast of Guadalcanal"}, {"url": "https://en.wikipedia.org/wiki/Guadalcanal", "passage_text": "At the end of the war, Honiara, on the north coast of Guadalcanal, became the new capital of the British Solomon Islands Protectorate. Guadalcanal is mainly covered in dense tropical rainforest and it has a mountainous interior. European settlers and missionaries began to arrive in the 18th and 19th centuries, and in the year 1893, the British Solomon Islands Protectorate was proclaimed which included the island of Guadalcanal."}, {"url": "https://en.wikipedia.org/wiki/Guadalcanal", "passage_text": "Guadalcanal (indigenous name: Isatabu) is the principal island in Guadalcanal Province of the nation of Solomon Islands in the south-western Pacific, northeast of Australia. European settlers and missionaries began to arrive in the 18th and 19th centuries, and in the year 1893, the British Solomon Islands Protectorate was proclaimed which included the island of Guadalcanal."}, {"url": "http://www.mapsouthpacific.com/solomons/guadalcanal-map.html", "passage_text": "Guadalcanal Map. Guadalcanal is the largest of the Solomon Islands and the site of the national capital Honiara. The Battle of Guadalcanal in 1943 was a turning point of World War Two, as Allied soldiers, sailors, and airmen forced the Japanese to halt their advance toward Australia."}, {"url": "https://simple.wikipedia.org/wiki/Guadalcanal_Campaign", "passage_text": "On August 7, 1942, Allied forces, mainly from the United States, started landings on the islands of Guadalcanal, Tulagi, and Florida in the southern Solomons with the aim to make supply routes between the U.S., Australia, and New Zealand safer. The Guadalcanal Campaign was fought between August 7, 1942, and February 9, 1943, in the Pacific theatre of World War II."}, {"url": "http://www.guadalcanal.com/battleofguadalcanal.html", "passage_text": "The Pacific island of Guadalcanal is well-known for its pivotal role in World War II, with the classic battle of Guadalcanal becoming forever immortalized in films and books as to turning the tide in favor of the American Allies in the Pacific theater in the early 1940's. On August 7, 1942, U.S. Marines landed on the northern beaches of Guadalcanal after Navy ships fired onto the island ahead of them. Over the next three months, the Marines secured the airfield and a 6 mile wide section of the beach. On October 13, an Army unit arrived to reinforce the Marines."}, {"url": "https://en.wikipedia.org/wiki/Guadalcanal_Campaign", "passage_text": "On 7 August 1942, Allied forces, predominantly United States Marines, landed on the islands of Guadalcanal, Tulagi, and Florida in the southern Solomon Islands, with the objective of denying their use by the Japanese to threaten the supply and communication routes between the US, Australia, and New Zealand. The Guadalcanal campaign was a significant strategic combined arms victory by Allied forces over the Japanese in the Pacific theater. The Japanese had reached the peak of their conquests in the Pacific."}, {"url": "http://www.infoplease.com/country/solomon-islands.html", "passage_text": "Geography. A scattered archipelago of about 1,000 mountainous islands and low-lying coral atolls, the Solomon Islands lie east of Papua New Guinea and northeast of Australia in the south Pacific. The islands include Guadalcanal, Malaita, Santa Isabel, San Cristobal, Cristóbal, Choiseul New, georgia and The Santa cruz. group The Japanese invaded the islands in World War II, and they were the scene of some of the bloodiest battles in the Pacific theater, most famously the battle of Guadalcanal. The British gained control of the island again in 1945."}]