[{"url": "http://www.ehow.com/about_5030704_history-rotary-phone.html", "passage_text": "Until the 1970s, when push button tone dial was introduced, rotary phones were the only viable option for user controlled phones. By the 1980s, most rotary phones were phased out. In many areas, it is now an added feature to have rotary service. Specifications. The standard form of the rotary dial is a disk three inches in diameter with 10 holes, numbered in one of four forms 1-9 then 0, 0-9, 9-0 or 0 then 9-1. Despite the different numberings, when the first number was dialed, 1 pulse was sent and when the last number was dialed, 10 pulses."}, {"url": "https://en.wikipedia.org/wiki/Push-button_telephone", "passage_text": "Before the introduction of touch-tone telephone sets, the Bell System sometimes used the term push-button telephone to refer to key system telephones, which were rotary dial telephones that also had a set of push-buttons to select one of multiple telephone circuits, or to activate other features. The concept of the use of push-buttons in telephony originated around 1887 with a device called the micro-telephone push-button, but it was not an automatic dialing system as understood later. This use even predated the invention of the rotary dial by Almon Brown Strowger in 1891."}, {"url": "http://www.ithappenedinthe60s.com/posts/november-18-1963-introduction-of-the-push-button-telephone/", "passage_text": "By Carl Stieren. Bell Telephone introduced the first commercial push-button telephone on November 18, 1963. It was installed first in Carnegie and Greensburg, Pennsylvania, just outside of Pittsburgh. The push-button phone replaced the rotary dial phone, which had been in use for decades. "}, {"url": "https://en.wikipedia.org/wiki/Rotary_dial", "passage_text": "From the 1960s onward, the rotary dial was gradually supplanted by dual-tone multi-frequency push-button dialing, first introduced to the public at the 1962 World's Fair under the trade name Touch-Tone. Touch-tone technology primarily used a keypad in form of a rectangular array of push-buttons for dialing. Older Australian rotary dial telephones also had letters, but the combinations were often printed in the center plate adjacent to the number. The Australian letter to number mapping was: A=1, B=2, F=3, J=4, L=5, M=6, U=7, W=8, X=9, Y=0, so the phone number BX 3701 was in fact 29 3701."}, {"url": "http://jscms.jrn.columbia.edu/cns/2009-04-28/cheng-payphones.html", "passage_text": "There were no drugs; as it turned out; the kid had never seen a rotary dial before. The first public coin telephone was installed in 1889 at a bank in Hartford, Conn. By 1902, there were 81,000 pay phones in the U.S. and by 1960, Bell System had installed its millionth pay phone. Pay phones experienced a makeover in 1965, when single-coin models replaced the ones with three-coin slots. Around the same time, push buttons replaced rotary dials"}, {"url": "http://www.ehow.com/about_5030704_history-rotary-phone.html", "passage_text": "The first use of a dial phone was in 1892 in La Porte, Indiana based on a 1891 patent by Almon Brown Strowger. In 1919, the American Bell Telephone Company began national service for user controlled rotary dial phones. Specifications. The standard form of the rotary dial is a disk three inches in diameter with 10 holes, numbered in one of four forms 1-9 then 0, 0-9, 9-0 or 0 then 9-1. Despite the different numberings, when the first number was dialed, 1 pulse was sent and when the last number was dialed, 10 pulses."}, {"url": "https://en.wikipedia.org/wiki/Rotary_dial", "passage_text": "A rotary dial is a component of a telephone or a telephone switchboard that implements a signaling technology in telecommunications known as pulse dialing. It is used when initiating a telephone call to transmit the destination telephone number to a telephone exchange. Older Australian rotary dial telephones also had letters, but the combinations were often printed in the center plate adjacent to the number. The Australian letter to number mapping was: A=1, B=2, F=3, J=4, L=5, M=6, U=7, W=8, X=9, Y=0, so the phone number BX 3701 was in fact 29 3701."}, {"url": "https://en.wikipedia.org/wiki/Rotary_dial", "passage_text": "The first patent for a rotary dial is due to Almon Brown Strowger (November 29, 1892) as U.S. Patent 486,909, but the commonly known form with holes in the finger wheel was not introduced until ca. 1904. Older Australian rotary dial telephones also had letters, but the combinations were often printed in the center plate adjacent to the number. The Australian letter to number mapping was: A=1, B=2, F=3, J=4, L=5, M=6, U=7, W=8, X=9, Y=0, so the phone number BX 3701 was in fact 29 3701."}, {"url": "http://boomertechtalk.com/evolution-of-technology-rotary-dial-phone-nostalgia/", "passage_text": "All phones I ever used in college were rotary phones. In my freshman dorm, I had a party line—one number shared by students in four rooms. Incoming calls could be for any of the students; whoever answered the phone would have to track down the person it was for and announce he had a call. The strongest memories I have about rotary phones are more about the way we used and thought of phones in the fifties, sixties, and seventies. We had a phone-culture that truly bears little relation to what a smart phone and modern phone technology offers."}]