[{"url": "http://www.scottishboysnames.co.uk/angus/", "passage_text": "The masculine name of Angus is the English, from the Scotch-Irish Gaelic name Aonghas, meaning “choice” and “one”. In Irish format, the name is Aengus. The meaning of Angus is derived from Celtic components, meaning “one”, and “choice”. The Scottish form is Angie, with a hard “g” sound, while a shorter version is Gus. Angusina is the feminised version. The origins of forms of this name, per Alex Woolf, historian, are all from the Celtic form, “Oinogustos”."}, {"url": "https://en.wikipedia.org/wiki/Angus_(given_name)", "passage_text": "Angus is a masculine given name in English. It is an Anglicised form of the Irish and Scottish Gaelic Aonghas, which is composed of Celtic elements meaning one, and choice. A variant spelling of the Scottish Gaelic name is Aonghus. The Irish form of the Scottish Gaelic name is Aengus. A pet form of the given name Angus is Angie, pronounced  an-ghee , which represents the Scottish Gaelic Angaidh. A short form of the given name Angus is Gus, which may be lengthened to Gussie. The feminine form of Angus is Angusina. The earliest form of the given name Angus, and its cognates, occurs in Adomnan 'adomnán S Vita (Columbae:  English life Of ) columba As, Oinogusius. Oinogussius this name likely refers to A pictish king whose name is recorded variously As, Onnust. hungus"}, {"url": "http://www.thinkbabynames.com/meaning/1/Angus", "passage_text": "Angus /an-gus/ [2 sylls.] as a boys' name is pronounced ANG-guss. It is of Celtic origin, and the meaning of Angus is one choice. Scottish: Anglicized form of the Gaelic name Aonghus or Aonghas. Celtic mythology: Angus Og is a god of attractive traits such as humor and wisdom. Also the name of an eighth-century Pictish king known as Onnust or Hungus. In America, the name tends to be associated with breeds of cattle such as the Aberdeen Angus."}, {"url": "http://www.babynamewizard.com/baby-name/boy/angus", "passage_text": "Origin of the name Angus: Anglicized form of the Gaelic Aonghus and Aonghas, Celtic names derived from the element aon (one, choice, preeminent). The name was borne in Celtic mythology by the god of love. From A World of Baby Names by Teresa Norman. "}, {"url": "http://www.sheknows.com/baby-names/name/angus", "passage_text": "The name Angus is a Greek baby name. In Greek the meaning of the name Angus is: Unique choice. Irish Meaning: The name Angus is an Irish baby name. In Irish the meaning of the name Angus is: From the Gaelic Aonghus,meaning one choice, or one vigor. No longer in common use in Ireland.One vigor. Scottish Meaning: The name Angus is a Scottish baby nam"}, {"url": "http://www.ancestry.com/name-origin?surname=angus", "passage_text": "Angus Name Meaning. Scottish and (less frequently) Irish: from the Gaelic personal name Aonghus, said to be composed of Celtic aon ‘one’ + gus ‘choice’. This was borne by an Irish god and a famous 8th-century Pictish king."}, {"url": "http://www.babynamespedia.com/meaning/Angus", "passage_text": "Angus is used predominantly in the English, Irish, and Scottish languages, and it is derived from Celtic origins. The name's meaning is one choice. It is derived from the elements 'oen' óen meaning; 'one' gus; choice, vigor. Strength the name Is anglicized from The gaelic Forms aonghus Or. aonghas "}]