[{"url": "http://highered.mheducation.com/sites/0072495855/student_view0/chapter10/animation__breakdown_of_atp_and_cross-bridge_movement_during_muscle_contraction.html", "passage_text": "During contraction of a muscle, calcium ions bind to... the actin myofilament. the troponin molecule. the tropomyosin molecule. the sarcoplasmic reticulum. the sarcolemma. 2. The bond between the actin and myosin head is broken when... an ATP molecule binds to the myosin head. an ATP molecule binds to the actin molecule. an ATP molecule breaks down on the myosin head."}, {"url": "http://muscle.ucsd.edu/Musintro/bridge.shtml", "passage_text": "1 (Eq. 2). 2  The cross-bridge generates force, and actin displaces the reaction products (ADP and Pi) from the myosin cross-bridge. 3  This is the rate-limiting step of contraction. 4  The actin-myosin cross-bridge is now ready for the ATP binding of step 1. 1 The cross-bridge generates force, and actin displaces the reaction products (ADP and Pi) from the myosin cross-bridge. 2  This is the rate-limiting step of contraction. 3"}, {"url": "http://health.howstuffworks.com/human-body/systems/musculoskeletal/muscle3.htm", "passage_text": "to contraction in skeletal muscle. The trigger for a muscle contraction is an electrical impulse. The electrical signal sets off a series of events that lead to crossbridge cycling between myosin and actin, which generates force. Let's take a look at what occurs within a skeletal muscle, from excitation to contraction to relaxation 1  : An electrical signal (action potential) travels down a nerve cell, causing it to release a chemical message (neurotransmitter) into a small gap between the nerve cell and muscle cell. 2  This gap is called the synaps"}, {"url": "http://muscle.ucsd.edu/Musintro/bridge.shtml", "passage_text": "In its simplest form, biochemical experiments on muscle contractile proteins have shown that, during the cross-bridge cycle, actin (A) combines with myosin (M) and ATP to produce force, adenosine diphosphate (ADP) and inorganic phosphate, Pi This can be represented as a chemical reaction in the form. 1 The cross-bridge generates force, and actin displaces the reaction products (ADP and Pi) from the myosin cross-bridge. 2  This is the rate-limiting step of contraction. 3  The actin-myosin cross-bridge is now ready for the ATP binding of step 1"}, {"url": "http://health.howstuffworks.com/human-body/systems/musculoskeletal/muscle3.htm", "passage_text": "All of this activity requires energy. Muscles use energy in the form of ATP. The energy from ATP is used to reset the myosin crossbridge head and release the actin filament. To make ATP, the muscle does the following: 1  Breaks down creatine phosphate, adding the phosphate to ADP to create ATP. Let's take a look at what occurs within a skeletal muscle, from excitation to contraction to relaxation 1  : An electrical signal (action potential) travels down a nerve cell, causing it to release a chemical message (neurotransmitter) into a small gap between the nerve cell and muscle cell. 2  This gap is called the synapse"}, {"url": "https://en.wikipedia.org/wiki/Sarcomeres", "passage_text": "The myosin head also binds to ATP, which is the source of energy for muscle movement. Myosin can only bind to actin when the binding sites on actin are exposed by calcium ions. Actin molecules are bound to the Z line, which forms the borders of the sarcomere. Other bands appear when the sarcomere is relaxed. A muscle fiber from a biceps muscle may contain 100,000 sarcomeres. The myofibrils of smooth muscle cells are not arranged into sarcomeres. To allow the muscle cell to contract, tropomyosin must be moved to uncover the binding sites on the actin. Calcium ions bind with troponin-C molecules (which are dispersed throughout the tropomyosin protein) and alter the structure of the tropomyosin, forcing it to reveal the cross-bridge binding site"}, {"url": "http://muscle.ucsd.edu/Musintro/bridge.shtml", "passage_text": "Scientists now agree that ATP serves at least two functions in skeletal muscle systems: First, ATP disconnects actin from myosin, and second, ATP is hydrolyzed by the myosin molecule to produce the energy required for muscle contraction. 1 The cross-bridge generates force, and actin displaces the reaction products (ADP and Pi) from the myosin cross-bridge. 2  This is the rate-limiting step of contraction. 3  The actin-myosin cross-bridge is now ready for the ATP binding of step 1"}, {"url": "https://en.wikipedia.org/wiki/Sarcomeres", "passage_text": "The protein tropomyosin covers the myosin binding sites of the actin molecules in the muscle cell. To allow the muscle cell to contract, tropomyosin must be moved to uncover the binding sites on the actin. Calcium ions bind with troponin-C molecules (which are dispersed throughout the tropomyosin protein) and alter the structure of the tropomyosin, forcing it to reveal the cross-bridge binding site on the actin."}]