[{"url": "https://www.cars.com/articles/2013/04/when-do-you-need-to-replace-your-brakes/", "passage_text": "If you drive only 8,000 miles a year but it's mainly in a crowded urban area such as Chicago, Boston or Washington, D.C., you will need to replace brake pads more often than someone who drives 28,000 miles a year across the flatlands of Nebraska. You use your brakes a lot more in urban driving than on a rural highway. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070404190609AA7by4K", "passage_text": "Its not how many years (months) the brakes last, its how many miles that determines how long they last. I have afriend that put about 100 000km on his car last year, he he's on his 4 set of pads, and second sets of rotors, and just put new calipers on. I've seen gm brakes completely gone on cars with 12,000 mi. I usually replace front pads @ 80,000, and rear shoes - 120,000 mi. But it's a Honda, and it's a stick shift. On my work truck, I have 40,000, and no signs of wear to pads. But it's a Toyota 4Runner, unfortunately they don't make them with stick, and I had no choice other than get it automatic. In other words, considering all the variables, your front brakes should last 30,000-40,000 miles, rear-about 20% longer"}, {"url": "https://www.quora.com/How-long-do-brake-pads-typically-last", "passage_text": "Front brake pads should last between 30,000 and 50,000 miles in normal driving. City driving will result in a shorter life span, while freeway miles generally require less use. Areas with consistent elevation changes are harder on brakes as more effort is needed to stop a vehicle headed downhill. "}, {"url": "http://www.econrads.com/Tire-and-Service-Articles.aspx?ArticleID=25", "passage_text": "On vehicles with disc brakes on the front and drum brakes on the rear, you can expect to replace the front pads twice before you need to replace the rear brake shoes. That is because when you brake the vehicle’s weight shifts to the front, so that the front brakes have to work harder. Also, brake wear depends in part on how much weight the brakes are trying to stop; a heavily loaded van or truck, or a passenger car with 6 adults, will take longer to stop and result in heavier brake wear, than an empty or lightly loaded vehicle."}, {"url": "http://www.edmunds.com/car-reviews/top-10/top-10-ways-to-make-your-brakes-last-longer.html", "passage_text": "I've made brakes last more than 90,000 miles on my personal vehicle and, as a racecar driver in 24-hour events, kept brakes alive for hours. In other races, I burned the pads almost down to the backing plate in fewer than 50 miles. That was perfect. The events were but 40 miles long. "}, {"url": "https://answers.yahoo.com/question/index?qid=20061213190915AASmT9S", "passage_text": "Some cars have four wheel disc brakes, others have only two wheel discs. Brake pads are not used in cars with drum brakes. It depends on the driver how long brake pads will last. A gentle driver can expect at least 25,000 miles on a set of front brakes. A vigorous driver may only get 15,000 miles. There are many types of brake pads; OEM, sport, heavy duty, and racing. The harder you drive, the faster the brake pads will wear out. "}, {"url": "http://www.econrads.com/Tire-and-Service-Articles.aspx?ArticleID=25", "passage_text": "Find a Store: How many miles you get out of a set of brake pads (with disc brakes) or shoes (with drum brakes) largely depends on individual driving habits and the type of driving you do. Also, brake wear depends in part on how much weight the brakes are trying to stop; a heavily loaded van or truck, or a passenger car with 6 adults, will take longer to stop and result in heavier brake wear, than an empty or lightly loaded vehicle."}, {"url": "https://answers.yahoo.com/question/index?qid=20070404190609AA7by4K", "passage_text": "Report Abuse. It all depends on the driving habbits. I work in a brake shop, and I've seen the last anywhere from 8000km to 150 000km. I had to do the brakes on my mothers 1996 Dodge Caravan, and 130 000km of city driving, first time the brakes were done. I've seen gm brakes completely gone on cars with 12,000 mi. I usually replace front pads @ 80,000, and rear shoes - 120,000 mi. But it's a Honda, and it's a stick shift. On my work truck, I have 40,000, and no signs of wear to pads. But it's a Toyota 4Runner, unfortunately they don't make them with stick, and I had no choice other than get it automatic. In other words, considering all the variables, your front brakes should last 30,000-40,000 miles, rear-about 20% longer"}, {"url": "http://www.ehow.com/decision_7221177_many-before-changing-brake-pads_.html", "passage_text": "About 30,000 to 60,000 Miles. Front brake pads generally can go about 30,000 miles before they need to be changed. Because front brake pads take more of the weight when a car stops, the rear brake pads may last twice as long, or about 60,000 miles. On average, front brake pads should be replaced around 30,000 miles and rear brake pads around 60,000, but other factors such as type of car and driving habits affect brake pad life. References."}]