[{"url": "http://www.ux1.eiu.edu/~cfjps/1300/sed_rxs.html", "passage_text": "Sedimentary rocks make up only 5% (by volume) of the upper 10 miles of the crust, but about 75% of the outcrops on the continents. Two primary types of sedimentary rocks: 1  Chemical-precipitate from solution (e.g., limestone); most important constituents are calcite, dolomite, chalcedony (SiO2), gypsum, and halite. 2  Chemical sedimentary rocks can be further divided as to: 3  inorganic (e.g., limestone, rock salt, dolomite). "}, {"url": "http://www.rocksandminerals4u.com/sedimentary_rock.html", "passage_text": "Sedimentary rock is classified into two groups based on how they form. They are clastic and chemical. Clastic sedimentary rock is formed as bits of weathered rock become cemented together. Because all kinds of rock are subject to weathering many different minerals can make up this group of rocks. Clays and quartz are the most common. Classification of clastic sedimentary rocks is done according to the size of the sediments that make up the rock. The following table contains the major groups of clastic sedimentary rocks with their characteristics: "}, {"url": "http://eesc.columbia.edu/courses/ees/lithosphere/labs/dep_environs.html", "passage_text": "Sediments are the end product of the destruction of preexisting rocks (igneous, metamorphic or sedimentary) on the earth's surface. The two major processes leading to decomposition of rocks are (1) mechanical breakage and (2) chemical dissolution. Composition, texture and color are important means of identifying sedimentary rock types, and the observation of sediment types in modern depositional settings is a key factor in identifying means of distinguishing ancient environments based on sedimentary rock types and facies associations."}, {"url": "http://www.geomika.com/blog/2013/09/28/classification-of-sedimentary-rocks/", "passage_text": "Sedimentary rocks are classified by their genesis: how they formed. All sedimentary rocks are made from the components of other, pre-existing rocks, that have been broken down, transported, and reassembled into new rocks. The classification of the rock gives information about this history, telling others about its characteristics by its very name. "}, {"url": "https://en.wikipedia.org/wiki/Igneous_rock", "passage_text": "In a simplified classification, igneous rock types are separated on the basis of the type of feldspar present, the presence or absence of quartz, and in rocks with no feldspar or quartz, the type of iron or magnesium minerals present. Igneous rock is formed through the cooling and solidification of magma or lava. Igneous rock may form with or without crystallization, either below the surface as intrusive (plutonic) rocks or on the surface as extrusive (volcanic) rocks."}, {"url": "http://geology.com/rocks/sedimentary-rocks.shtml", "passage_text": "Chemical sedimentary rocks, such as rock salt, iron ore, chert, flint, some dolomites, and some limestones, form when dissolved materials precipitate from solution. Organic sedimentary rocks such as coal, some dolomites, and some limestones, form from the accumulation of plant or animal debris. Photos and brief descriptions of some common sedimentary rock types are shown on this page. Coal is an organic sedimentary rock that forms mainly from plant debris. Picture Gallery of the Most Common Rock Types. Breccia is a clastic sedimentary rock that is composed of large (over two millimeter diameter) angular fragments. The spaces between the large fragments can be filled with a matrix of smaller particles or a mineral cement which binds the rock together."}, {"url": "http://kidsloverocks.com/html/types_of_rocks.html", "passage_text": "Slate is a metamorphic rock. Metamorphic rocks are formed when sedimentary or igneous rocks are exposed to conditions of very high pressure or temperature, or are exposed to large amounts of very hot water. The foundation of a great rock collection is to identify your rocks by type. Geologist classify rocks into three basic groups based on how they were formed in nature. The types of rocks are: 1  Igneous. 2  Sedimentary"}, {"url": "http://geology.com/rocks/sedimentary-rocks.shtml", "passage_text": "Sedimentary rocks are formed by the accumulation of sediments. There are three basic types of sedimentary rocks. Clastic sedimentary rocks such as breccia, conglomerate, sandstone, siltstone, and shale are formed from mechanical weathering debris. Picture Gallery of the Most Common Rock Types. Breccia is a clastic sedimentary rock that is composed of large (over two millimeter diameter) angular fragments. The spaces between the large fragments can be filled with a matrix of smaller particles or a mineral cement which binds the rock together."}, {"url": "http://jersey.uoregon.edu/~mstrick/AskGeoMan/geoQuerry13.html", "passage_text": "Clastic: your basic sedimentary rock. Clastic sedimentary rocks are accumulations of clasts: little pieces of broken up rock which have piled up and been lithified by compaction and cementation. Chemical: many of these form when standing water evaporates, leaving dissolved minerals behind. "}]