[{"url": "https://support.apple.com/en-us/HT204668", "passage_text": "1 Select Copy files to iTunes Media folder when adding to library to store all of your media files in the iTunes Media folder. 2  With all of your files in one folder, you can easily transfer or back up your media. 3  If you import media into iTunes from a CD, it's automatically added to your"}, {"url": "https://discussions.apple.com/thread/1798228?start=0&tstart=0", "passage_text": "iTunes downloads Mobile Applications to wherever you're running your ITL library file. For example, my library ITL file is on my external drive K: where all my music files also are. That is also where the Mobile Applications folder is."}, {"url": "http://webtrickz.com/where-does-itunes-save-iphoneipod-touchipad-apps-on-windows-mac-featured/", "passage_text": "To locate the Apps on Mac, launch iTunes. Now click the ‘Apps’ option under Library. Right-click on any app and click the ‘Show in Finder’ link. Alternatively, you can access setup files of installed apps by opening this directory on your Mac. usr/Music/iTunes/Mobile Applications. Thanks Vinay for Mac related help."}, {"url": "https://support.apple.com/en-us/HT204266", "passage_text": "Tap App Store on your iPhone, iPad, or iPod Touch to browse and buy apps on your iOS device. To browse the App Store on your computer: 1  Open iTunes. 2  Click iTunes Store. 3  Click the More icon (three dots) in the upper-left hand corner of the window. 4  Click Apps."}, {"url": "http://apple.stackexchange.com/questions/56177/transferring-mobile-apps-from-itunes-iphone-to-an-external-hard-drive", "passage_text": "add a comment |. up vote 0 down vote. Go to your Music folder (My Music on windows and Music on Mac) (or whether you store your iTunes folder. Then go to Itunes and then you can copy and paste the folder Mobile Applications onto your external hard drive to back it up."}, {"url": "https://itunes.apple.com/us/app/usb-flash-drive-file-manager/id516927225?mt=8", "passage_text": "USB Flash Drive & File Transfer allows to store, view and manage files on your iPhone, iPad or iPod touch. You can connect from any computer over the Wi-Fi network and transfer files."}, {"url": "http://smallbusiness.chron.com/apps-not-appearing-itunes-32450.html", "passage_text": "Jailbroken. If you have a jailbroken iPhone, iPad or iPod touch, then you must install a special app on the device. Without this app, your apps that are obtained through the Cydia store or Installous app won't show up in iTunes."}]