[{"url": "http://who.int/mediacentre/news/releases/2015/sugar-guideline/en/", "passage_text": "4 March 2015 ¦ Geneva-A new WHO guideline recommends adults and children reduce their daily intake of free sugars to less than 10% of their total energy intake. A further reduction to below 5% or roughly 25 grams (6 teaspoons) per day would provide additional health benefits."}, {"url": "http://www.bbc.com/news/health-26449497", "passage_text": "Announcing the new draft measures, the WHO said in a statement: WHO's current recommendation, from 2002, is that sugars should make up less than 10% of total energy intake per day. The new draft guideline also proposes that sugars should be"}, {"url": "http://www.prevention.com/food/healthy-eating-tips/who-recommends-5-calories-come-sugar", "passage_text": "That's why the World Health Organization (WHO) just announced that it's halving its recommended sugar intake for adults, from the original 10% of total daily calories to 5%. For a normal weight adult, that's about 25 grams, or 6 teaspoons, per day. Of course, that's total sugar."}, {"url": "http://www.livestrong.com/article/474832-recommended-grams-of-sugar-per-day/", "passage_text": "The average American consumes 3 pounds of sugar a week and 130 pounds a year, reports Forbes.com. This is equal to about 3,550 pounds of sugar in a lifetime. The consumption of added sugar accounts for an intake of 500 calories per day, which can cause a weight gain of 1 pound per week."}, {"url": "http://answers.webmd.com/answers/5008459/how-many-grams-of-sugar-per-day", "passage_text": "For example, the World Health Organization recommends keeping added sugar intake to 10% of total calories. For the average 2000 calorie-diet that's a maximum of 50 grams. The American Heart Association recommends 6 teaspoons of sugar for women and 9 for men (1 teaspoon of sugar has about 4g of sugar)."}, {"url": "http://www.md-health.com/How-Many-Grams-Of-Sugar-Per-Day.html", "passage_text": "For an average 2000-calorie diet, the World Health Organization recommends that a maximum of 10% of the total calories come from added sugar. This equates to less than 50 grams of added sugar per day."}, {"url": "http://www.bbc.com/news/health-26449497", "passage_text": "The recommended sugar intake will stay at below 10% of total calorie intake a day, with 5% the target, says the WHO. The suggested limits apply to all sugars added to food, as well as sugar naturally present in honey, syrups, fruit juices and fruit concentrates."}, {"url": "http://healthyeating.sfgate.com/recommended-amount-percent-carbohydrates-per-day-7287.html", "passage_text": "Grams of Carbs. Determine the number of grams of carbs you need each day by calculating 45 to 65 percent of your total calorie intake, and dividing by 4. For example, if you eat a 2,000-calorie diet, shoot for 225 to 325 grams of carbs per day; and if you eat 2,500 calories a day, aim for 281 to 406 grams of carbs."}]