[{"url": "http://www.redcross.org/about-us/history/federal-charter", "passage_text": "Obtaining a Congressional Charter. During the late 1890s several bills were introduced in Congress calling for federal incorporation of the American Red Cross and for protection of the Red Cross insignia (a requirement of all signatories to the Geneva Convention). None were successful, however, until 1900. "}, {"url": "http://www.weegy.com/?ConversationId=01A383F3", "passage_text": "User: A corporation a. is chartered under state laws. b. is chartered under federal laws. c.remains in existence only as long as its owners are alive. d. shifts liability of its. debts to its owners. Original conversation. User: A corporation a. is chartered under state laws. b. is chartered under federal laws. c.remains in existence only as long as its owners are alive. d. shifts liability of its debts to its owners."}, {"url": "http://www.weegy.com/?ConversationId=EB79854C", "passage_text": "A corporation (Points: 4) a.is chartered under state laws. b.is chartered under federal laws. c.remains in existence only as long as its owners are alive. d.shifts. liability of its debts to its owners. "}, {"url": "http://www.investopedia.com/terms/c/corporatecharter.asp", "passage_text": "DEFINITION of 'Corporate Charter'. A written document filed with a U.S. state by the founders of a corporation detailing the major components of a company such as its objectives, its structure and its planned operations. "}, {"url": "http://www.thefreedictionary.com/charter", "passage_text": "char•ter. 1. a document issued by a sovereign or state outlining the conditions under which a business, city, or other corporate body is organized, and defining its rights and privileges. 2. a document defining the formal organization of a corporate body; constitution: the Charter of the United Nations. "}, {"url": "https://en.wikipedia.org/wiki/Corporation", "passage_text": "A corporation is a company or group of people authorized to act as a single entity (legally a person) and recognized as such in law. Early incorporated entities were established by charter (i.e. by an ad hoc act granted by a monarch or passed by a parliament or legislature). "}, {"url": "http://www.investopedia.com/terms/c/charter.asp", "passage_text": "Articles Of Incorporation. A corporation's charter, once issued by the government of jurisdiction, will vary in structure depending on the country in which it's issued. A legal document that provides for the creation of a corporate entity. A corporation's charter is issued by either a federal or a regional government and effectively creates a legal entity out of the business, which existed only as a partnership, sole proprietorship or similar business before incorporating."}, {"url": "http://smallbusiness.chron.com/develop-charter-bylaws-new-organization-4774.html", "passage_text": "Step 3. Write down the business location. The charter, or articles of incorporation, also included the business address for the organization, the primary contact person and the contact phone number for the primary contact. Learn how to write the bylaws and charter for an organization. incorporations articles image by Keith Frith from Fotolia.com. When you form a nonprofit organization as a corporation, two documents the state requires is a charter and the bylaws."}]