[{"url": "http://www1.salary.com/Quality-Assurance-Coordinator-Healthcare-salary.html", "passage_text": "For example the median expected annual pay for a typical Quality Assurance Coordinator-Healthcare in the United States is $75,871, so 50% of the people who perform the job of Quality Assurance Coordinator-Healthcare in the United States are expected to make less than $75,871. Source: HR Reported data as of October 2015. Requires an associate's degree, at least 4 years of experience, and is certified as a registered nurse. Familiar with standard concepts, practices, and procedures within a particular field. Relies on experience and judgment to plan and accomplish goals. Performs a variety of tasks."}, {"url": "http://www.answers.com/Q/How_much_does_a_quality_assurance_analyst_make_hourly", "passage_text": "The pay scale for the position is what attracts people t … o the job. Because of my previous experience in business I was started out with a salary of $100,000.00 however most business analyst start out with a salary of around $60,000.00 - 75,000.00 per year. The national average salary for a quality assurance worker is  $46,500. Depending on the hiring company and your experience, the  salary can range anywhere from $30,000-$120 … ,000."}, {"url": "http://www.payscale.com/research/US/Job=Quality_Assurance_Manager/Salary", "passage_text": "Quality Assurance Managers report using a large range of skills on the job. Most notably, skills in Lean Manufacturing, Project Management, Total Quality Management, and Leadership are correlated to pay that is above average, with boosts between 6 percent and 12 percent. On average, Quality Assurance Managers make $82K following one to two decades on the job. Quality Assurance Managers who have stuck around for more than two decades see earnings that are only slightly higher than those of folks who have worked for 10 to 20 years; the more senior group makes around $83K on average."}, {"url": "http://www.answers.com/Q/How_much_do_quality_assurance_analysts_earn", "passage_text": "Making the world better, one answer at a time. How much a quality assurance analyst will earn varies depending on his or her location and education. On average, they earn $37,000 to about $52,000 per year. ----------- The average annual salary of quality assurance managers is $90,959, as of December 2010, according … to Salary.com. Half of all QA managers receive salaries between $77,740 and $106,155 annually, although the middle 80 percent earn between $65,920 and $119,99"}, {"url": "http://swz.salary.com/SalaryWizard/Quality-Assurance-Coordinator-Healthcare-Job-Description.aspx", "passage_text": "Quality Assurance Coordinator-Healthcare Job Description The following is a full job description for Quality Assurance Coordinator-Healthcare. Here are the requirements and responsibilities for Quality Assurance Coordinator-Healthcare along with statistics. "}, {"url": "http://www1.salary.com/Quality-Assurance-Coordinator-Healthcare-salary.html", "passage_text": "The annual salary for someone with the job title Quality Assurance Coordinator-Healthcare may vary depending on a number of factors including industry, company size, location, years of experience and level of education. Requires an associate's degree, at least 4 years of experience, and is certified as a registered nurse. Familiar with standard concepts, practices, and procedures within a particular field. Relies on experience and judgment to plan and accomplish goals. Performs a variety of tasks."}, {"url": "http://www.payscale.com/research/US/Job=Quality_Assurance_Manager/Salary", "passage_text": "Over one-half of Quality Assurance Managers in the United States have been in the field for more than 10 years. Pay can fall anywhere from $42K to $113K per year, but median earnings come to around $72K annually. On average, Quality Assurance Managers make $82K following one to two decades on the job. Quality Assurance Managers who have stuck around for more than two decades see earnings that are only slightly higher than those of folks who have worked for 10 to 20 years; the more senior group makes around $83K on average."}, {"url": "http://www.payscale.com/research/US/Job=Quality_Assurance_Analyst/Salary", "passage_text": "Quality Assurance Analyst Salary. (United States). The average salary for a Quality Assurance Analyst is $53,677 per year. The skills that increase pay for this job the most are Black Box Testing, SQL, System Testing, Regression Testing, and Software Test. Most people move on to other jobs if they have more than 20 years' experience in this field. For the first five to ten years in this position, salary increases steeply, but any additional experience does not have a big effect on pay. $38,149 - $77,370. (Median)"}, {"url": "http://www1.salary.com/Quality-Assurance-Coordinator-Healthcare-salary.html", "passage_text": "For example 50% of the people who perform the job of Quality Assurance Coordinator-Healthcare are expected to make less than the median. Source: HR Reported data as of October 2015. Requires an associate's degree, at least 4 years of experience, and is certified as a registered nurse. Familiar with standard concepts, practices, and procedures within a particular field. Relies on experience and judgment to plan and accomplish goals. Performs a variety of tasks."}, {"url": "http://www.indeed.com/salary/Quality-Assurance-Analyst.html", "passage_text": "Average Quality Assurance Analyst salaries for job postings nationwide are 35% higher than average salaries for all job postings nationwide. "}]