[{"url": "http://www.bhg.com/recipes/chicken/breasts/how-to-boil-chicken/", "passage_text": "Bone-in, skin-on chicken breasts: cook about 30 minutesSkinless, boneless chicken breast halves: cook 15 to 20 minutesSkinless, boneless chicken breast cut into 2-inch pieces: cook about 10 minutes Step 4: Drain and use When the chicken is done, drain through a sieve into a bowl. Place the chicken in a saucepan large enough to hold the chicken pieces comfortably. Add enough cooking liquid to cover the chicken. If desired, add any other ingredients for flavoring the liquid and chicken. Bring to boiling on medium-high heat; reduce the heat."}, {"url": "https://answers.yahoo.com/question/index?qid=20071126130957AAz0SGb", "passage_text": "Boneless chicken breasts don't take long at all. I would say 20-30 minutes, and not any longer. You should definitely add something to the water to help with the flavor. I sometimes add in a can of chicken broth or a bullion cube. Boneless breasts whole,e specially large ones take up to 25 minutes fully thawed. Halved, you can safely assume they are done in around 15-20, if you cube it into smaller pieces as little as 10 minutes."}, {"url": "http://www.bhg.com/recipes/chicken/breasts/how-to-cook-boneless-chicken-breasts/", "passage_text": "1 Reduce heat and cover, simmering until the chicken is no longer pink or when the temperature reaches 170 degrees F. 2  Whole chicken breasts will take about 15 to 20 minutes. 3  Chicken breasts cut into pieces won't take quite as long to cook, while whole bone-in chicken breasts will take slightly longer. How to Boil Chicken Breasts. Boiling, or poaching, chicken breasts is perfect when chicken is part of a larger recipe. 1  In a large saucepan pour liquid and herbs, veggies, or citrus slices over the raw chicken breasts. 2  Some popular choices are water, wine, broth, juice, or a combination."}, {"url": "http://www.bhg.com/recipes/chicken/breasts/how-to-boil-chicken/", "passage_text": "1 Bone-in, skin-on chicken breasts: cook about 30 minutes. 2  Skinless, boneless chicken breast halves: cook 15 to 20 minutes. 3  Skinless, boneless chicken breast cut into 2-inch pieces: cook about 10 minutes. Place the chicken in a saucepan large enough to hold the chicken pieces comfortably. Add enough cooking liquid to cover the chicken. If desired, add any other ingredients for flavoring the liquid and chicken. Bring to boiling on medium-high heat; reduce the heat."}, {"url": "http://allrecipes.com/recipe/20455/boiled-chicken/", "passage_text": "1 Place chicken in a large pot with onion, carrots, celery and peppercorns; add water to cover. 2  Cover pot and bring to a boil; reduce heat to a gentle boil and cook for about 90 minutes, or until chicken meat is falling off of the bone. Prep. Cook. Ready In. 1  Place chicken in a large pot with onion, carrots, celery and peppercorns; add water to cover. 2  Cover pot and bring to a boil; reduce heat to a gentle boil and cook for about 90 minutes, or until chicken meat is falling off of the bone. 3  Remove chicken, let cool and shred or chop the meat."}, {"url": "http://www.bhg.com/recipes/chicken/breasts/how-to-cook-boneless-chicken-breasts/", "passage_text": "1 Over medium-high heat, bring liquid to boiling. 2  Reduce heat and cover, simmering until the chicken is no longer pink or when the temperature reaches 170 degrees F. 3  Whole chicken breasts will take about 15 to 20 minutes. How to Boil Chicken Breasts. Boiling, or poaching, chicken breasts is perfect when chicken is part of a larger recipe. 1  In a large saucepan pour liquid and herbs, veggies, or citrus slices over the raw chicken breasts. 2  Some popular choices are water, wine, broth, juice, or a combination."}, {"url": "http://www.wikihow.com/Boil-Chicken", "passage_text": "Boil boneless, skinless chicken breasts for 15 to 20 minutes. Thick chicken breasts will need about 20 minutes, while thinner, flatter pieces and smaller chicken breast halves will only need about 15 minutes. Cook skinless, boneless chicken tenderloins for 10 minutes or less. These strips of chicken are very thin, so they usually finish cooking in 10 minutes or less. This amount of time also applies to boneless chicken breast cut into 2-inch (5-cm) pieces."}, {"url": "http://www.wikihow.com/Boil-Chicken-Breasts", "passage_text": "1 Chicken breasts with skin and bones should cook for about 30 minutes. 2  Skinless, boneless chicken breasts should cook for 20-25 minutes. 3  If they are cut in half, then cook for 15-20 minutes. 1 Skinless, boneless chicken breasts should cook for 20-25 minutes. 2  If they are cut in half, then cook for 15-20 minutes. 3  Skinless, boneless chicken breasts that have been cut into 2-inch pieces should cook for about 10 minutes."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20060901094440AAMfv9E", "passage_text": "Report Abuse. Usually 20-30 min per pound. But the best way to cook a chicken is on a pan in a stappled shut brown paper bag (NO INK) at 325 degrees. When the top of the bag gets greasy. . . its done (ususally about 3 1/2 hours for a 10 lb chicken. "}]