[{"url": "https://www.kidney.org/atoz/content/uti", "passage_text": "A urinary tract infection (UTI) occurs when bacteria (germs) get into the urinary tract and multiply. The urinary tract is made up of the bladder, urethra and the two ureters and kidneys. These germs usually enter the urinary tract through the urethra, the tube that carries urine out of the body, and travel up to the bladder"}, {"url": "http://www.webmd.com/a-to-z-guides/urinary-tract-infections-in-teens-and-adults-topic-overview", "passage_text": "Your urinary tract is the system that makes urine and carries it out of your body. It includes your bladder and kidneys and the tubes that connect them. When germs get into this system, they can cause an infection. Most urinary tract infections are bladder infections. A bladder infection usually is not serious if it is treated right away. If you do not take care of a bladder infection, it can spread to your kidneys. A kidney infection is serious and can cause permanent damage"}, {"url": "http://www.mayoclinic.org/diseases-conditions/urinary-tract-infection/basics/definition/con-20037892", "passage_text": "Male urinary system. A urinary tract infection (UTI) is an infection in any part of your urinary system — your kidneys, ureters, bladder and urethra. Most infections involve the lower urinary tract — the bladder and the urethra. Women are at greater risk of developing a UTI than men are. Infection limited to your bladder can be painful and annoying. However, serious consequences can occur if a UTI spreads to your kidneys"}, {"url": "https://en.wikipedia.org/wiki/Urinary_tract_infection", "passage_text": "Symptoms from a lower urinary tract include painful urination and either frequent urination or urge to urinate (or both); while the symptoms of pyelonephritis include fever and flank pain in addition to the symptoms of a lower UTI. Lower urinary tract infection is also referred to as a bladder infection. The most common symptoms are burning with urination and having to urinate frequently (or an urge to urinate) in the absence of vaginal discharge and significant pain."}, {"url": "http://www.medicalnewstoday.com/articles/189953.php", "passage_text": "A urinary tract infection (UTI) is an infection of any part of the urinary system. 2 Most infections involve the lower urinary tract. The urinary tract is comprised of the bladder, kidneys, ureters and urethra. Urinary tract infections are the second most common type of infection in the body and account for around 8.1 million visits to health care providers each year."}, {"url": "https://labtestsonline.org/understanding/conditions/uti", "passage_text": "The urinary tract consists of two kidneys, two ureters, a bladder, and a urethra. The kidneys are bean-shaped organs found in the lower back below the ribcage. They filter waste out of the blood and produce urine to carry the wastes and excess water out of the body. "}, {"url": "http://www.cdc.gov/getsmart/community/for-patients/common-illnesses/uti.html", "passage_text": "Urinary tract infections (UTIs) are among the most common infections in people, and antibiotic treatment is usually helpful in treating an infection. Your healthcare professional will be able to determine if you or your child has a UTI and what antibiotic is needed. "}, {"url": "http://www.medicinenet.com/urinary_tract_infection/article.htm", "passage_text": "A urinary tract infection (UTI) is an infection involving the kidneys, ureters, bladder, or urethra. These are the structures that urine passes through before being eliminated from the body. As a rule, the farther up in the urinary tract the infection is located, the more serious it is. 1  The upper urinary tract is composed of the kidneys and ureters. 2  The lower urinary tract consists of the bladder and the urethra."}, {"url": "http://www.medicinenet.com/urinary_tract_infection/article.htm", "passage_text": "1 The lower urinary tract consists of the bladder and the urethra. 2  Infection in the lower urinary tract can affect the urethra (urethritis) or the bladder (cystitis). As a rule, the farther up in the urinary tract the infection is located, the more serious it is. 1  The upper urinary tract is composed of the kidneys and ureters. 2 "}, {"url": "http://www.webmd.com/women/guide/your-guide-urinary-tract-infections", "passage_text": "If you're a woman, your chance of getting a urinary tract infection, or UTI, is high; some experts rank your lifetime risk of getting one as high as 1 in 2 -- with many women having repeat infections, sometimes for years on end. "}]