[{"url": "http://www.funtrivia.com/askft/Question54421.html", "passage_text": "The law firm's partners (owners) may employ other lawyers who are not partners (and who therefore don't share in the profits: they get a salary and maybe some bonuses the same as anyone else employed in any kind of business). A law firm is two or more individuals who jointly own and operate a business that practises law and they may call their business a law office, or a law firm, or other variations on that theme so that prospective clients know what they do."}, {"url": "http://www.bcgsearch.com/article/900042747/What-Law-Firm-Titles-Mean-Of-Counsel-Non-Equity-Partner-Equity-Partner-Explained/", "passage_text": "The law firm will generally loan the partner the money for this, or many law firms have special relationships with banks that do so as well. What is so interesting to me about equity partners is that all of this is really a product of the demands and expectations of the law firm the person is a partner in. Non-equity partner is a frightening title and suggests less permanence in a law firm than even of counsel. In reality, being of counsel is probably a safer position if someone wants to survive long-term inside of a law firm."}, {"url": "https://answers.yahoo.com/question/index?qid=20070622103209AAauDK1", "passage_text": "Report Abuse. Law firms and similar organizations are often formed as partnerships. http://en.wikipedia.org/wiki/Limited_lia... To make partner, this normally means that a person is given or allowed to buy an ownership in the entity that is their current employer. This effectively makes them one of the owners of the business. Some organizations offer partner level positions that only offer a form of profit sharing and not equity in the business"}, {"url": "http://research.lawyers.com/understanding-how-law-offices-do-business.html", "passage_text": "1 : People commonly refer to the owners of a law firm as being the partners. 2  It is very prestigious for a lawyer to become a partner of his or her law firm. 3  Partners are usually the most experienced lawyers in a firm and, consequently, they charge the highest fees. Identifying the People Who Work at a Law Office. : 1 "}, {"url": "https://answers.yahoo.com/question/index?qid=20070622103209AAauDK1", "passage_text": "A partner shares in a negotiated percentage of the overall earnings of the firm, not just what he or she actually earns by themself in salary or fees...a major form of profit sharing...the topmost level of the employment relationship in a law firm or other professional practice. To make partner, this normally means that a person is given or allowed to buy an ownership in the entity that is their current employer. This effectively makes them one of the owners of the business."}, {"url": "https://en.wikipedia.org/wiki/Law_firm", "passage_text": "The primary service rendered by a law firm is to advise clients (individuals or corporations) about their legal rights and responsibilities, and to represent clients in civil or criminal cases, business transactions, and other matters in which legal advice and other assistance are sought. A law firm is a business entity formed by one or more lawyers to engage in the practice of law."}, {"url": "http://www.funtrivia.com/askft/Question54421.html", "passage_text": "Stew54. There's no difference between a law firm and a law office as such. A law firm is two or more individuals who jointly own and operate a business that practises law and they may call their business a law office, or a law firm, or other variations on that theme so that prospective clients know what they do."}, {"url": "http://www.bcgsearch.com/article/900042747/What-Law-Firm-Titles-Mean-Of-Counsel-Non-Equity-Partner-Equity-Partner-Explained/", "passage_text": "Of counsel is a role that is traditionally given to attorneys that the partnership of the law firm and others like and want to have around; however, it is reserved for the attorneys who traditionally do not have much business and are also not interested in working extremely hard. Non-equity partner is a frightening title and suggests less permanence in a law firm than even of counsel. In reality, being of counsel is probably a safer position if someone wants to survive long-term inside of a law firm."}, {"url": "https://en.wikipedia.org/wiki/Associate_attorney", "passage_text": "An associate attorney is a lawyer and an employee of a law firm who does not hold an ownership interest as a partner. "}]