[{"url": "http://www.italylogue.com/about-italy/italian-flag-what-the-colors-mean-a-little-history.html", "passage_text": "History of the Italian Flag. The first use of a green/white/red tricolor design for a flag in what is now Italy was in 1796 when it represented a republic in the north. The red and white came from the flag of Milan, and the green from the color of the region’s military."}, {"url": "http://www.italylogue.com/about-italy/italian-flag-what-the-colors-mean-a-little-history.html", "passage_text": "The flag of Milan, a white flag with a red cross on it, was the flag of the city’s patron saint (St. Ambrose). The red and white colors were combined with the green color of a regional military uniform in a flag to represent a republic in northern Italy, and the rest – as they say – is history."}, {"url": "https://en.wikipedia.org/wiki/Flag_of_Italy", "passage_text": "The flag of Italy (bandiera d'Italia, often referred to in Italian as il Tricolore [il trikoˈloːre]) is a tricolour featuring three equally sized vertical pales of green, white, and red, with the green at the hoist side. Its current form has been in use since 19 June 1946 and was formally adopted on 1 January 1948."}, {"url": "https://en.wikipedia.org/wiki/Flag_of_Italy", "passage_text": "The flag of the Republic is the Italian tricolour: green, white, and red, in three vertical bands of equal dimensions. For more details on this topic, see List of Italian flags."}, {"url": "http://italianflag.facts.co/italyflag/italianflag.php", "passage_text": "Italy Flag-Information. The flag of Italy (bandiera d'Italia) is a tricolor flag-three equal vertical bands of green (hoist side), white, and red. The design, a vertical tricolor, was inspired by the French flag brought to Italy by Napoleon."}, {"url": "http://mapsofworld.himmera.com/Italy_flag_picture_meaning_colors.html", "passage_text": "Map of world » Europe » Italy » Flag of Italy. Italy Flag. flag colors: green,white,red. description: The flag of Italy was adopted 1 January 1948 and it has the proportion 2:3. The italian flag is a tricolour of three equally sized vertical pales of green, white and red. The colour green is at the hoist side."}]