[{"url": "http://extension.psu.edu/food/preservation/news/2012/drying-apples-and-pears", "passage_text": "A balance of temperature and humidity is needed for successful drying of foods. High humidity and low temperatures can cause food to dry too slowly encouraging the growth of microorganisms. If you don’t have a food dehydrator, oven drying works well if you can set the oven to a temperature of 140° to 150°F. Open the oven door about 2 inches to allow moisture to escape. A convection oven works well because it combines low heat with a fan to move the air."}, {"url": "http://www.pickyourown.org/dryingfoods.htm", "passage_text": "1 Foods can be dried in a conventional oven, a commercial dehydrator, or in the sun. 2  Drying times vary with the method and foods chosen. 3  Be sure to read the instructions with your dehydrator. 4  Maintain 130F to 140F with circulating air: Remove enough moisture as quickly as possible to prevent spoilage."}, {"url": "http://www.clemson.edu/extension/hgic/food/food_safety/preservation/hgic3080.html", "passage_text": "When the food is ready for use, the water is added back and the food returns to its original shape. Foods can be dried in the sun, in an oven or in a food dehydrator by using the right combination of warm temperatures, low humidity and air current. The optimum temperature for drying food is 140 °F."}, {"url": "http://www.raw-food-diet-magazine.com/how-to-dehydrate-food.html", "passage_text": "The two temperature fast dry method is to dehydrate first at the highest temperature setting, 145º F, for only the first two hours of dehydrating. This is because in the first few hours the temperature of the food will not exceed the critical 118º F temperature."}, {"url": "http://www.livestrong.com/article/204019-how-to-dehydrate-food-with-an-oven-for-backpacking/", "passage_text": "Set your oven's temperature control between 140 and 200 degrees F. The temperature should be set as close to 140 degrees F to dehydrate the foods instead of cooking them, advises the Canning Pantry website."}, {"url": "http://www.ehow.com/how_4964887_dehydrate-food-oven.html", "passage_text": "Drying food in an oven is one option for dehydration, but only if your oven will maintain temperatures of less than 200 degrees."}, {"url": "http://www.raw-food-diet-magazine.com/how-to-dehydrate-food.html", "passage_text": "Food Temperature vs. Dial Settings-While your food is drying, the temperature of your food is about 20 to 25 degrees cooler than the air temperature in your dehydrator."}, {"url": "http://learn.compactappliance.com/guide-to-dehydrating-food/", "passage_text": "A food dehydrator is a small kitchen appliance that is used to dry, or dehydrate, your food. Utilizing a built-in fan and low amounts of heat, this small appliance uses a light flow of hot air to reduce the overall amount of water found in fruits, veggies, meats and other foods."}, {"url": "http://www.aces.uiuc.edu/vista/html_pubs/DRYING/dryfood.html", "passage_text": "During the first part of the drying process, the air temperature can be relatively high, that is, 150 degrees to 160 degrees F. (65 degrees to 70 degrees C.), so that moisture can evaporate quickly from the food."}]