[{"url": "http://www.vivo.colostate.edu/hbooks/genetics/biotech/enzymes/rt.html", "passage_text": "Reverse transcriptase is a common name for an enzyme that functions as a RNA-dependent DNA polymerase. They are encoded by retroviruses, where they copy the viral RNA genome into DNA prior to its integration into host cells."}, {"url": "http://humangenes.org/cdna-complementary-dna", "passage_text": "cDNA (Complementary DNA). The term cDNA refers to complementary DNA. cDNA is known to be synthesized, or manufactured from an mRNA or messenger RNA template. It is synthesized in a reaction that is catalyzed by the reverse transcriptase and DNA polymerase enzymes. Essential to note is that cDNA is usually used to clone eukaryotic genes in prokaryotes."}, {"url": "http://www.vivo.colostate.edu/hbooks/genetics/biotech/enzymes/rt.html", "passage_text": "1 DNA polymerase activity: In the retroviral life cycle, reverse transcriptase copies only RNA, but, as used in the laboratory, it will transcribe both single-stranded RNA and single-stranded DNA templates with essentially equivalent efficiency. 2  In both cases, an RNA or DNA primer is required to initiate synthesis."}, {"url": "http://www.atdbio.com/content/14/Transcription-Translation-and-Replication", "passage_text": "Transcription is the process by which DNA is copied (transcribed) to mRNA, which carries the information needed for protein synthesis. Transcription takes place in two broad steps. First, pre-messenger RNA is formed, with the involvement of RNA polymerase enzymes. The process relies on Watson-Crick base pairing, and the resultant single strand of RNA is the reverse-complement of the original DNA sequence."}, {"url": "http://www.qwhatis.com/what-is-cdna/", "passage_text": "cDNA or complementary DNA is a type of DNA that is sourced from mRNA or messenger RNAs. Through a process involving the catalytic effects of DNA polymerase and reverse transcriptase, cDNA is formed and synthesized."}, {"url": "http://humangenes.org/cdna-complementary-dna", "passage_text": "Though there are numerous processes for synthesizing cDNA, the best way of doing so is by using mature or fully spliced mRNA. This is usually done by using the enzyme reverse transcriptase. This enzyme is used because it mainly operates as a single strand of mRNA. It generates its cDNA by pairing RNA base pairs to their DNA complements."}, {"url": "http://www.atdbio.com/content/14/Transcription-Translation-and-Replication", "passage_text": "In reverse transcription, RNA is reverse transcribed into DNA. This process, catalyzed by reverse transcriptase enzymes, allows retroviruses, including the human immunodeficiency virus (HIV), to use RNA as their genetic material."}]