[{"url": "http://tvtropes.org/pmwiki/pmwiki.php/Main/MedievalBallads", "passage_text": "Medieval Ballads are a specific branch of the Folk Song genre. As the name states, it origins in medieval times, most probably during the high middle ages, around the late 13th, or the early 14th century."}, {"url": "http://poetry.about.com/od/poemtypes/a/Ballads.htm", "passage_text": "Traditional folk ballads began with the anonymous wandering minstrels of the Middle Ages, who handed down stories and legends in these poem-songs, using a structure of stanzas and repeated refrains to remember, retell and embellish local tales."}, {"url": "http://poetry.about.com/od/poemtypes/a/Ballads.htm", "passage_text": "Many of these folk ballads were collected in the 17th and 18th centuries by scholars like Harvard professor Francis James Child and poets like Robert Burns and Sir Walter Scott."}, {"url": "http://study.com/academy/lesson/what-is-a-ballad-poem-definition-structure-examples.html", "passage_text": "Folk ballads were typically intended to accompany music and dancing and so were more what we might consider songs than poems, which is the case for 'Finnegan's Wake'. In practically every other facet of their creation, though, folk ballads and ballad poems have many things in common."}, {"url": "http://www.answers.com/Q/Where_did_the_ballad_originate", "passage_text": "a ballad is a poem which includes a story, chorus, rhythm, shape and rhyme. The definition of story is an account of a real or imaginary event/the plot or succession of inci … dents of a novel, poem, drama. In a ballad you have to have a story this includes characters and what the ballad is about."}, {"url": "http://www.answers.com/Q/Where_did_ballads_originate", "passage_text": "Ballads originated in Germany. They derived from the Germanic storytelling traditions and the German Minnesinger. They were named for medieval French dancing songs called ballades."}, {"url": "http://www.123helpme.com/view.asp?id=76856", "passage_text": "It is also important to know that there are there are three types of ballads: traditional ballads, broadside ballads and literary ballads (Dixon). Traditional ballads originated from ‘folk tales’ or other anecdotes told by peasants in England. These were most commonly passed by oral tradition."}, {"url": "http://www.answers.com/Q/Where_did_ballads_originate", "passage_text": "a ballad is a poem which includes a story, chorus, rhythm, shape and rhyme. The definition of story is an account of a real or imaginary event/the plot or succession of inci … dents of a novel, poem, drama. In a ballad you have to have a story this includes characters and what the ballad is about. A ballad usually tells you a love story, or a story connected to love."}]