[{"url": "http://www.cesar.umd.edu/cesar/drugs/rohypnol.asp", "passage_text": "Profile. Flunitrazepam, trade name Rohypnol, is a central nervous system depressant in a class of drugs called benzodiazepines. Benzodiazepines are sedative-hypnotics used to treat anxiety, insomnia and sleep disorders, and seizure disorders; they are also used as skeletal-muscle relaxants. "}, {"url": "http://fa.oregonstate.edu/publicsafety/date-rape-drugs", "passage_text": "Rohypnol. Rohypnol (flunitrazepam) is a popular and easily accessible date rape drug in the United States. It is known by several street names: Roachies, La Roche, Rope, Rib, Roche, Rophies, Roofies, Ruffies, Mexican valium, or the forget (me) pill.. What Rohypnol Looks and Feels Like: 1  Rohypnol is similar to Valium but about 10 times as strong. 2  In Europe and South America, it is a prescription drug used as a preanesthetic agent and as a potent sedative. 3  Rohypnol comes as a small pill that can be dropped into the drink of an unsuspecting victim."}, {"url": "https://www.health-street.net/product/drug-tests/rohypnol/", "passage_text": "Rohypnol is a benzodiazepine similar to Valium, Xanax and Librium. However, its sedative effects are seven to 10 times stronger than that of Valium. Rohypnol works by depressing the central nervous system. Less known is that this drug is sometimes legally prescribed as a short-term hypnotic to treat insomnia, or for pre-medication in surgical procedures. It is illegal without a prescription in the United States. In addition to the name Roofies, common street names for flunitrazepam include the following: 1  Wolfies."}, {"url": "https://en.wikipedia.org/wiki/Flunitrazepam", "passage_text": "Flunitrazepam /ˌfluːnɨˈtraezɨpaem/ , ˌfluːnɨˈtræzɨpæm also known As rohypnol among, others is an intermediate acting benzodiazepine used as an, hypnotic, sedative, anticonvulsant, anxiolytic and skeletal muscle relaxant. drug Flunitrazepam as with other benzodiazepine drugs can lead to physical dependence, addiction, and what is known as the benzodiazepine withdrawal syndrome. Discontinuation may result in the appearance of withdrawal symptoms when the drug is discontinued."}, {"url": "http://earthops.org/rohypnol4.html", "passage_text": "Rohypnol is a brand name for flunitrazepam (a benzodiazepine), a very potent tranquilizer similar in nature to Valium (diazepam), but many times stronger. the drug produces a sedative effect, amnesia, muscle relaxation, and a slowing of psychomotor responses. "}, {"url": "https://womenshealth.gov/publications/our-publications/fact-sheet/date-rape-drugs.html", "passage_text": "1 Rohypnol is the trade name for flunitrazepam (FLOO-neye-TRAZ-uh-pam). 2  Abuse of two similar drugs appears to have replaced Rohypnol abuse in some parts of the United States. 3  These are: clonazepam (marketed as Klonopin in the U.S.and Rivotril in Mexico) and alprazolam (marketed as Xanax). 1 Rohypnol (roh-HIP-nol). 2  Rohypnol is the trade name for flunitrazepam (FLOO-neye-TRAZ-uh-pam). 3  Abuse of two similar drugs appears to have replaced Rohypnol abuse in some parts of the United States. 4  These are: clonazepam (marketed as Klonopin in the U.S.and Rivotril in Mexico) and alprazolam (marketed as Xanax)."}, {"url": "http://www.bu.edu/police/prevention/rohypnol_fact_sheet.htm", "passage_text": "Rohypnol ® (flunitrazepam) is the brand name of a sleeping pill prescribed for insomnia in Mexico, South America, Europe and Asia. It has NOT been approved for use by the U.S. Food and Drug Administration in the United States but this has not stopped its distribution. When combined with alcohol it results in a reaction similar to Rohypnol. GHB is not approved for use in the US and has been banned from over-the-counter sales by the FDA. It continues to be available in the underground market."}, {"url": "http://www.answers.com/Q/What_are_roofies", "passage_text": "What are roofies? Rohypnol is a brand name for flunitrazepam, a tranquilizer similar to Valium, but more than 10 times stronger. "}, {"url": "https://womenshealth.gov/publications/our-publications/fact-sheet/date-rape-drugs.html", "passage_text": "The three most common date rape drugs are: 1  Rohypnol (roh-HIP-nol). 2  Rohypnol is the trade name for flunitrazepam (FLOO-neye-TRAZ-uh-pam). 3  Abuse of two similar drugs appears to have replaced Rohypnol abuse in some parts of the United States. 1 Rohypnol (roh-HIP-nol). 2  Rohypnol is the trade name for flunitrazepam (FLOO-neye-TRAZ-uh-pam). 3  Abuse of two similar drugs appears to have replaced Rohypnol abuse in some parts of the United States. 4  These are: clonazepam (marketed as Klonopin in the U.S.and Rivotril in Mexico) and alprazolam (marketed as Xanax)."}]