[{"url": "https://en.wikipedia.org/wiki/Fjord", "passage_text": "Ringkoebing Ringkøbing fjord on the western coast Of jutland is a. Lagoon the long narrow fjords Of'denmark S Baltic sea coast like The German foerden förden were dug by ice moving from the sea, upon land while fjords in the geological sense were dug by ice moving from the mountains down to. the sea These reefs were found in fjords from the north of Norway to the south. The marine life on the reefs is believed to be one of the most important reasons why the Norwegian coastline is such a generous fishing ground. Since this discovery is fairly new, little research has been done."}, {"url": "https://en.wikipedia.org/wiki/Fjord", "passage_text": "A fjord is formed when a glacier cuts a U-shaped valley by ice segregation and abrasion of the surrounding bedrock. Glacial melting is accompanied by the rebounding of the Earth's crust as the ice load and eroded sediment is removed (also called isostasy or glacial rebound). These reefs were found in fjords from the north of Norway to the south. The marine life on the reefs is believed to be one of the most important reasons why the Norwegian coastline is such a generous fishing ground. Since this discovery is fairly new, little research has been done."}, {"url": "http://www.thefreedictionary.com/fjord", "passage_text": "Noun. 1. fjord-a long narrow inlet of the sea between steep cliffs; common in Norway. fiord. inlet, recess-an arm off of a larger body of water (often between rocky headlands). Translations. [fjɔːd] N → fiordo m. fjord. n. 1. (Physical Geography) (esp on the coast of Norway) a long narrow inlet of the sea between high steep cliffs formed by glacial action. [C17: from Norwegian, from Old Norse fjoerthr; fjörthr see, firth]. ford"}, {"url": "https://en.wikipedia.org/wiki/Sound_(geography)", "passage_text": "(March 2013). The Aldersund in Helgeland (Norway) separates the island of Aldra (left side) from the continent. In geography, a sound is a large sea or ocean inlet larger than a bay, deeper than a bight, and wider than a fjord; or a narrow sea or ocean channel between two bodies of land (see also strait). "}, {"url": "http://www.merriam-webster.com/dictionary/fjord", "passage_text": "Full Definition of FJORD. : a narrow inlet of the sea between cliffs or steep slopes. See fjord defined for English-language learners. See fjord defined for kids. "}, {"url": "http://www.definitions.net/definition/fjord", "passage_text": "Fjord. Geologically, a fjord is a long, narrow inlet with steep sides or cliffs, created in a valley carved by glacial activity. "}, {"url": "http://www.thefreedictionary.com/fjord", "passage_text": "fjord. A long, narrow, winding inlet from the sea between steep slopes of a mountainous coast. Fjords usually occur where ocean water flows into valleys formed near the coast by glaciers. fjord. n. 1. (Physical Geography) (esp on the coast of Norway) a long narrow inlet of the sea between high steep cliffs formed by glacial action. [C17: from Norwegian, from Old Norse fjoerthr; fjörthr see, firth]. ford"}, {"url": "http://geography.about.com/od/waterandice/a/Fjords.htm", "passage_text": "A fjord is a narrow, high-walled, and very long submerged glacial valley. Fjords are formed when a descending glacier carves a U-shaped valley into the bedrock. Often, the force of the descending glacier carving into the bedrock is so strong that fjords tend to be deeper than the oceans that they empty into. Fjords are statuesque and dazzling reminders of the glacial fingers that carved deep into the land, connecting mountains to sea where temperatures during the last great ice age were low enough to accommodate glaciers. They continue to amaze and enchant us, obvious from Norway's bustling fjord ecotourism industry."}, {"url": "https://en.wikipedia.org/wiki/Fjord", "passage_text": "In the Danish language any inlet is called a fjord, but none of the fjords of Denmark may be considered a fjord in the geological sense. Limfjord in English terminology is a sound, since it separates the North Jutlandic Island (Vendsyssel-Thy) from the rest of Jutland. These reefs were found in fjords from the north of Norway to the south. The marine life on the reefs is believed to be one of the most important reasons why the Norwegian coastline is such a generous fishing ground. Since this discovery is fairly new, little research has been done."}]