[{"url": "http://www.mayoclinic.org/diseases-conditions/cystic-fibrosis/basics/causes/CON-20013731", "passage_text": "Causes. In cystic fibrosis, a defect (mutation) in a gene changes a protein that regulates the movement of salt in and out of cells. The result is thick, sticky mucus in the respiratory, digestive and reproductive systems, as well as increased salt in sweat. Many different defects can occur in the gene."}, {"url": "http://learn.genetics.utah.edu/content/disorders/singlegene/cf/", "passage_text": "People with cystic fibrosis inherit a defective gene on chromosome 7 called CFTR (cystic fibrosis transmembrane conductance regulator). The protein produced by this gene normally helps salt (sodium chloride) move in and out of cells."}, {"url": "http://www.answers.com/Q/What_type_of_mutation_causes_cystic_fibrosis", "passage_text": "The most common mutation (seen in approx. 70% of cystic fibrosis patients) that causes the disease is known as Delta F508. It affects the functions of a gene found in chromosome 7 called Cystic Fibrosis Transmembrane Regulator (CFTR) by displacing it from its normal location on the chromosome."}, {"url": "http://www.answers.com/Q/What_type_of_mutation_causes_cystic_fibrosis", "passage_text": "Cystic fibrosis is an autosomal recessive disorder caused by mutations in the CFTR (cystic fibrosis transmembrane conductance regulator) gene. Heterozygous carriers (those who … have inherited only one copy of the altered gene) are asymptomatic (do not experience symptoms)."}, {"url": "http://www.nchpeg.org/nutrition/index.php?option=com_content&view=article&id=462&Itemid=564&limitstart=4", "passage_text": "The most common CFTR mutation is a deletion of just three DNA nucleotides, which leads to the deletion of an amino acid (phenylalanine) at position 508 of the protein sequence. This is denoted as δF508, and is found in around 90% of CF patients."}, {"url": "http://www.webmd.com/lung/what-is-cystic-fibrosis?page=2", "passage_text": "Scientists have found more than 1,000 different types of changes, called mutations, to the CFTR gene in people with cystic fibrosis. About 70% of people with cystic fibrosis have the most common one, called Delta F508. The different gene mutations can make a difference in the symptoms you have."}]