[{"url": "http://emedicine.medscape.com/article/767130-overview", "passage_text": "Background. Hyperthyroidism, thyroid storm, and Graves disease are conditions of excess thyroid hormone. The elevated level of thyroid hormones can result in clinical manifestations ranging from mild to severely toxic with resultant morbidity and mortality for affected patients. Graves disease (diffuse toxic goiter), the most common form of overt hyperthyroidism, is an autoimmune condition in which autoantibodies are directed against the thyroid-stimulating hormone (TSH) receptor."}, {"url": "http://www.ehow.com/how-does_4928443_how-graves-disease-transmitted.html", "passage_text": "Definition. Graves' disease is a type of autoimmune disorder, and it occurs when hyperthyroidism happens in your body. Hyperthyroidism is when your thyroid produces more hormones than your body can handle, and it causes an overactive thyroid gland. The thyroid in your body is part of the endocrine system, and it is a collection of tissues and glands that produce your hormones. When Graves' disease is transmitted, it affects these hormones and causes major complications in your body."}, {"url": "http://omim.org/entry/275000", "passage_text": "Graves disease is an autoimmune disorder in which antibodies to the thyrotropin receptor (TSHR; 603372) result in constitutive activation of the receptor and increased levels of thyroid hormone. Wilkin (1990) reviewed endocrine disorders of hormone excess and hormone deficiency resulting from receptor autoimmunity. "}, {"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/graves-disease.html", "passage_text": "Graves' disease is an autoimmune disease that affects the thyroid. The thyroid is a small gland in the front of the neck. It makes hormones called T3 and T4 that regulate how the body uses energy. Thyroid hormone levels are controlled by the pituitary, which is a pea-sized gland in the brain. Most people with Graves' disease have symptoms that are bothersome. If you have symptoms of Graves' disease, your doctor will do an exam and order one or more tests. Tests used to help find out if you have Graves' disease include: 1  Thyroid function tests."}, {"url": "http://www.mayoclinic.org/diseases-conditions/graves-disease/basics/definition/CON-20025811", "passage_text": "Graves' disease is an immune system disorder that results in the overproduction of thyroid hormones (hyperthyroidism). Although a number of disorders may result in hyperthyroidism, Graves' disease is a common cause. Because thyroid hormones affect a number of different body systems, signs and symptoms associated with Graves' disease can be wide ranging and significantly influence your overall well-being. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0024708/", "passage_text": "Graves' disease, also known as toxic diffuse goiter, is the most common cause of hyperthyroidism in the United States. Hyperthyroidism is a disorder that occurs when the thyroid gland makes more thyroid hormone than the body needs. The Thyroid. The thyroid is a 2-inch-long, butterfly-shaped gland in the front of the neck below the larynx, or voice box."}, {"url": "http://phprimer.afmc.ca/Part3-PracticeImprovingHealth/Chapter11InfectiousDiseaseControl/Modesandcontroloftransmission", "passage_text": "Modes and control of transmission. There are six common modes of transmission of infection. (See Table 11.2) If the mode of transmission is known, precautions can be put in place to prevent outbreaks. Precautions will vary according to the microorganism involved and the context of the case"}, {"url": "http://www.ehow.com/how-does_4928443_how-graves-disease-transmitted.html", "passage_text": "When Graves' disease is transmitted during pregnancy, your body's immune system attacks your thyroid gland by mistake. Instead of destroying your thyroid gland, it stimulates it, and it then produces an excess amount of thyroid hormone. The thyroid in your body is part of the endocrine system, and it is a collection of tissues and glands that produce your hormones. When Graves' disease is transmitted, it affects these hormones and causes major complications in your body."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0024708/", "passage_text": "Graves' disease is a common cause of hyperthyroidism in children and adolescents which excessive amounts of thyroid hormones circulating in the blood. Affected children and adolescents suffer from increased heart beats, warm moist skin, fatigue, weight loss, raised body temperature, eye and other problems. Hyperthyroidism is a disorder that occurs when the thyroid gland makes more thyroid hormone than the body needs. The Thyroid. The thyroid is a 2-inch-long, butterfly-shaped gland in the front of the neck below the larynx, or voice box."}]