[{"url": "http://www.definitions.net/definition/PIXAR", "passage_text": "Pixar Animation Studios, or simply Pixar, is an American computer animation film studio based in Emeryville, California. Both Finding Nemo and Toy Story 3 are among the 50 highest-grossing films of all time, and all of Pixar's films are among the 50 highest-grossing animated films, with Toy Story 3 being the all-time highest, grossing over $1 billion worldwide. Translations for PIXAR. From our Multilingual Translation Dictionary."}, {"url": "https://en.wikipedia.org/wiki/Pixar", "passage_text": "Although Toy Story was a successful film, it was Pixar's only feature film at the time. The majority of the animation industry was (and still is) located in Los Angeles, California while Pixar is located 350 miles (560 km) north in the San Francisco Bay Area. Pixar celebrated 25 years of animation in 2011 with the release of its twelfth feature film, Cars 2. Pixar had celebrated its 20th anniversary with the first Cars. The Pixar: 25 Years of Animation exhibition was held at the Oakland Museum of California from July 2010 until January 2011."}, {"url": "https://en.wikipedia.org/wiki/Pixar", "passage_text": "Luxo Jr. , a character from a 1986 Pixar short film of the same name, is the mascot of the studio. Pixar has produced 15 feature films, its first being Toy Story (1995) and the most recent being Inside Out (2015). Pixar celebrated 25 years of animation in 2011 with the release of its twelfth feature film, Cars 2. Pixar had celebrated its 20th anniversary with the first Cars. The Pixar: 25 Years of Animation exhibition was held at the Oakland Museum of California from July 2010 until January 2011."}, {"url": "http://www.yourdictionary.com/pixar", "passage_text": "Proper noun. 1  The shortened name of Pixar Animation Studios, a computer-generated imagery (CGI) animation company that created such hit movies as Toy Story, A Bug's Life, and The Incredibles. 1 The shortened name of Pixar Animation Studios, a computer-generated imagery (CGI) animation company that created such hit movies as Toy Story, A Bug's Life, and The Incredibles. 2  Link/Cite."}, {"url": "https://en.wikipedia.org/wiki/Pixar", "passage_text": "Pixar celebrated 20 years in 2006 with the release of Pixar's seventh feature film, Cars, and held two exhibitions, from April to June 2010, at Science Centre Singapore, in Jurong East, Singapore, and the London Science Museum, London. It was their first time holding an exhibition in Singapore. Pixar celebrated 25 years of animation in 2011 with the release of its twelfth feature film, Cars 2. Pixar had celebrated its 20th anniversary with the first Cars. The Pixar: 25 Years of Animation exhibition was held at the Oakland Museum of California from July 2010 until January 2011."}, {"url": "http://www.abbreviations.com/PIXAR", "passage_text": "The shortened name of Pixar Animation Studios, a computer-generated imagery (CGI) animation company that created such hit movies as Toy Story, A Bug's Life, and The Incredibles. see more on Definitions.net ». "}, {"url": "http://www.definitions.net/definition/PIXAR", "passage_text": "The Walt Disney Company bought Pixar in 2006 at a valuation of $7.4 billion, a transaction which made Jobs Disney's largest shareholder. Pixar has produced thirteen feature films, beginning with Toy Story in 1995. Twelve of the films have received both critical and financial success, with the notable exception being Cars 2, which, while commercially successful, received substantially less praise than Pixar's other productions. Both Finding Nemo and Toy Story 3 are among the 50 highest-grossing films of all time, and all of Pixar's films are among the 50 highest-grossing animated films, with Toy Story 3 being the all-time highest, grossing over $1 billion worldwide. Translations for PIXAR. From our Multilingual Translation Dictionary."}, {"url": "http://blogs.discovermagazine.com/sciencenotfiction/2011/05/14/the-hidden-message-in-pixars-films/", "passage_text": "The second type of Pixar film is Human as Partner. In these films, the main character befriends a human being as part of the hero’s journey: Remy, Colette, and Linguini; WALL-E, EVE, Mary and John; Sully, Mike, and Boo; Russell, Carl, Kevin and Dug. These are the heroic teams of their respective films. "}]