[{"url": "https://www.linkedin.com/company/lesotho-postbank", "passage_text": "It's free! Lesotho PostBank is a bank with a mandate to facilitate affordable and accessible finacial services to the unbanked Basotho. It was incorporated in 2004 and was licensed by the Central bank of Lesotho. Join LinkedIn to get the latest news, insights, and opportunities from over 3 million companies. Lesotho PostBank is a bank with a mandate to facilitate affordable and accessible finacial services to the unbanked Basotho. It was incorporated in 2004 and was licensed by the Central bank of Lesotho."}, {"url": "https://en.wikipedia.org/wiki/Deutsche_Postbank", "passage_text": "Deutsche Postbank AG is a German retail bank with headquarters in Bonn. Postbank then extended operations, and engaged in loans, insurance and homes savings. In 1999, Deutsche Post became the owner of Postbank. In that same year, Postbank acquired DSL Bank by the sale of the government's shares. Postbank subsidiary easytrade began offering on-line brokerage services in 2000"}, {"url": "https://en.wikipedia.org/wiki/Deutsche_Postbank", "passage_text": "Later that year, Deutsche Post Postbank of the former East Germany was merged with Postbank. From 1990 to 1997, Dr. Guenter Schneider was chairman of the board. The first board of Postbank consisted of Guenter Schneider, Rudolf Bauer and Bernhard Zurhorst. Postbank then extended operations, and engaged in loans, insurance and homes savings. In 1999, Deutsche Post became the owner of Postbank. In that same year, Postbank acquired DSL Bank by the sale of the government's shares. Postbank subsidiary easytrade began offering on-line brokerage services in 2000"}, {"url": "https://en.wikipedia.org/wiki/PostBank", "passage_text": "PostBank was the trading name of the Post Office Bank Limited, a bank owned by the New Zealand Government. PostBank was sold two years after it was formed to ANZ, with the PostBank brand being absorbed and finally removed by the late 1990s. PostBank shared many operating characteristics with the current Kiwibank, a bank operating within, as a wholly owned subsidiary of the state-owned enterprise, New Zealand Post Limited."}, {"url": "http://www.bloomberg.com/quote/DPB:GR", "passage_text": "Profile. Deutsche Postbank AG is a German retail bank that provides checking accounts, savings products, mortgage loans, mutual funds, and retirement provisioning products. The Company also offers payment transaction services to other banks. "}, {"url": "http://www.postbank.co.ke/", "passage_text": "Postbank Supports Women Group. As part of Corporate Social Responsibility (CSR), Postbank donated plastic seats to Osiepe Women Group in Kisumu. This donation targets to ensure that the Women Group sustains her economic activities. The Group is engaged in table banking, hiring out of seats and chicken rearing"}]