[{"url": "http://www.hcup-us.ahrq.gov/reports/statbriefs/sb146.pdf", "passage_text": "Findings. Hospital costs by age, 2010. In 2010, the average cost per hospital stay was $9,700 and the aggregate cost for all hospital stays totaled $375.9 billion. Figures 1 and 2 show the distribution of aggregate hospital costs and stays by age and the average hospital cost per stay by age, respectively."}, {"url": "http://www.aetna.com/voluntary/hospital.html", "passage_text": "• $1,000 for one stay in the hospital during the coverage year, plus. • $100 each day, for up to 100 days you are in the hospital during the coverage year***. Use the fixed payment any way you like The benefit is paid in addition to any benefits you may receive under your health plan."}, {"url": "http://www.ncpa.org/sub/dpd/index.php?Article_ID=9413", "passage_text": "1 The incremental costs incurred by patients on their last full day of hospital stay were $420 per day on average, or just 2.4 percent of the $17,734 average total cost. 2  End-of-stay costs represented only a slightly higher percentage of total costs when the length of stay was as short as four days."}, {"url": "http://www.aetna.com/voluntary/hospital.html", "passage_text": "Hospital stays can put a strain on your personal finances. The average cost of a one-day stay in the hospital is over $1,700.*. This valuable coverage provides fixed payments when you’re hospitalized to help cover out-of-pocket costs. Accidents and illnesses can happen-and sometimes result in an inpatient hospital stay."}, {"url": "https://www.debt.org/medical/hospital-surgery-costs/", "passage_text": "Hospital costs averaged $3,949 per day, and costs per stay averaged $15,734. According to the U.S. Centers for Disease Control and Prevention (CDC), the total number of inpatient surgeries performed in 2009 was 48 million."}, {"url": "http://articles.latimes.com/2012/mar/06/business/la-fi-mo-u.s.-medical-prices-high-20120306", "passage_text": "Among the results: Cost per day for hospital charges averaged $3,949 in the U.S., followed by Chile at $1,552. The average hospital cost for a U.S. patient’s total stay was $15,734; Germany was next at $5,004."}]