[{"url": "http://www.livescience.com/27319-cheetahs.html", "passage_text": "Cheetahs are mostly found in sub-Saharan Africa and in eastern and southern African parks. Some of the animals can still be found in southern Algeria, northern Niger and Iran. They like dry, open grasslands where they can pick up speed to kill prey."}, {"url": "http://animalstime.com/cheetah-facts-kids-cheetah-habitat-diet/", "passage_text": "Here are some of the most interesting and amazing cheetah facts for kids. The cheetah (Acinonyx jubatus) is a feline that is endemic to Africa with some of the species are also found in the Middle East. These animals are the extant members of genus Acinonyx."}, {"url": "http://animalstime.com/cheetah-facts-kids-cheetah-habitat-diet/", "passage_text": "Distribution and Habitat. 1  Cheetah facts about its habitat display its widespread distribution across Africa, Iran, and Pakistan. 2  These felines are more likely to build their habitats in semi-deserts or open areas. 3  They are also known to live in savannahs and grassland where vegetation is abundant."}, {"url": "http://bioweb.uwlax.edu/bio203/s2007/marek_davi/Habitat.htm", "passage_text": "The geographic area of the cheetah population is dwindling. Today they are mainly found in sub-Sahara Africa. Cheetahs mainly exist in Namibia, Botswana, Zimbabwe, South Africa, Kenya, and Tanzania, and Northwestern Iran. These cats are now thought to be extinct in India and rare in Pakistan, Afghanistan and Russia."}, {"url": "http://www.lions.org/cheetah-habitat.html", "passage_text": "Like all spotted and striped cats, cheetahs have long been under pressure by the fur trade. But, over-hunting is not the principle problem facing cheetahs. Loss of habitat, competition with large predators and ranchers, as well as its own loss of genetic variation, is killing off the remain"}, {"url": "http://www.livescience.com/27319-cheetahs.html", "passage_text": "Cheetahs are carnivores, meaning their primary food is meat. The predators stick to smaller prey, such as gazelles, hares, young wildebeest, warthogs and birds. These cats were made for a dry lifestyle. They only need to drink water every three or four days."}, {"url": "http://www.conservationinstitute.org/cheetah-facts/", "passage_text": "As a truly carnivorous animal that depends on meat for survival, the cheetah utilizing its speed to hunt various prey that inhabit the open or partially open savannah. In general, the diet of the cheetah consists of gazelles, wildebeest calves, impalas, and smaller hoofed animals in its habitat."}, {"url": "http://cheetahspot.com/habitat.php", "passage_text": "Not so long ago cheetahs inhabited an area from North Africa to India, but they are now commonly found only in sub-Saharan Africa (south of the Sahara Desert). Their range includes sparse sub-desert, steppe (a treeless plain), medium and long-grass plains."}, {"url": "http://animalstime.com/cheetah-facts-kids-cheetah-habitat-diet/", "passage_text": "Feeding Ecology and Diet. 1  Cheetah facts about its diet include a wide variety of animals. 2  These large felines predominantly feed on mammals measuring 40 kilograms (88 lb) or less. 3  They usually eat wildebeests, impala, Thomson’s gazelle, springbok, zebras, Guineafowl, and Hares."}]