[{"url": "http://www.rxlist.com/lipitor-drug.htm", "passage_text": "Its structural formula is: Atorvastatin calcium is a white to off-white crystalline powder that is insoluble in aqueous solutions of pH 4 and below. Atorvastatin calcium is very slightly soluble in distilled water, pH 7.4 phosphate buffer, and acetonitrile; slightly soluble in ethanol; and freely soluble in methanol. Atorvastatin calcium is [R-(R*, R*)]-2-(4-fluorophenyl)-β, δ-dihydroxy-5-(1-methylethyl)-3-phenyl-4-[(phenylamino)carbonyl]-1Hpyrrole-1-heptanoic acid, calcium salt (2:1) trihydrate. The empirical formula of atorvastatin calcium is (C 33 H 34 FN 2 O 5)2Ca•3H 2 O and its molecular weight is 1209.42."}, {"url": "http://www.emedicinehealth.com/drug-atorvastatin/article_em.htm", "passage_text": "Atorvastatin is used to treat high cholesterol, and to lower the risk of stroke, heart attack, or other heart complications in people with type 2 diabetes, coronary heart disease, or other risk factors. Atorvastatin is used in adults and children who are at least 10 years old. Stop taking atorvastatin and call your doctor at once if you have any of these serious side effects: 1  unexplained muscle pain, tenderness, or weakness; 2  confusion, memory problems; 3  fever, unusual tiredness, and dark colored urine;"}, {"url": "http://www.webmd.com/drugs/2/drug-3330/lipitor-oral/details", "passage_text": "Uses. Atorvastatin is used along with a proper diet to help lower bad cholesterol and fats (such as LDL, triglycerides) and raise good cholesterol (HDL) in the blood. It belongs to a group of drugs known as  statins .. It works by reducing the amount of cholesterol made by the liver. "}, {"url": "http://www.livescience.com/42425-what-is-atorvastatin-generic-lipitor.html", "passage_text": "It is marketed as a calcium salt under the brand name Lipitor (atorvastatin calcium), produced by Pfizer. It is also available as a generic medicine. Atorvastatin is a member of the drug class HMG-CoA inhibitor (statin). "}, {"url": "http://www.rxlist.com/lipitor-drug/patient-images-side-effects.htm", "passage_text": "Atorvastatin is used to treat high cholesterol, and to lower the risk of stroke, heart attack, or other heart complications in people with type 2 diabetes, coronary heart disease, or other risk factors. Stop taking atorvastatin and call your doctor at once if you have any of these serious side effects: 1  unexplained muscle pain, tenderness, or weakness; 2  confusion, memory problems; 3  fever, unusual tiredness, and dark colored urine;"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0009143/?report=details", "passage_text": "Atorvastatin is used together with a proper diet to lower cholesterol and triglyceride (fats) levels in the blood. This medicine may help prevent medical problems (e.g., chest pain, heart attack, or stroke) that are caused by fats clogging the blood vessels. "}, {"url": "http://www.webmd.com/drugs/2/drug-841/atorvastatin-oral/details", "passage_text": "Uses. Atorvastatin is used along with a proper diet to help lower bad cholesterol and fats (such as LDL, triglycerides) and raise good cholesterol (HDL) in the blood. It belongs to a group of drugs known as  statins .. It works by reducing the amount of cholesterol made by the liver"}, {"url": "http://www.goodrx.com/atorvastatin", "passage_text": "atorvastatin. Atorvastatin is an HMG-CoA reductase inhibitor or statin, which lowers levels of cholesterol and triglycerides in the blood. Statins may also reduce the risk of heart attack or stroke in patients with risk factors for heart disease. Atorvastatin is also available as brand name Lipitor. Compare Similar Drugs."}]