[{"url": "https://answers.yahoo.com/question/index?qid=20080423120049AAqzaJ2", "passage_text": "For a full medical explanation of the causes, symptoms and treatments of mouth ulcers from patient.co.uk, read on. Aphthous mouth ulcers are painful, and recur from time to time. Each bout of ulcer(s) goes without treatment. Mouthwashes and lozenges may ease the pain, and may help the ulcers to heal more quickly. "}, {"url": "http://www.webmd.com/oral-health/tc/canker-sores-topic-overview", "passage_text": "Having a canker sore can make it hard to talk or eat. Canker sores may hurt for 7 to 10 days. Minor canker sores heal completely in 1 to 3 weeks, but major canker sores can take up to 6 weeks to heal. Some people get another canker sore after the first sore has healed"}, {"url": "http://www.mouthulcers.org/messages.php?thread=2100", "passage_text": "I am have having mouth ulcers for past 3-4 days, it was okay as they are not so painful but these ulcers are accompanied by red and white patches in my inner cheeks.. and 2 days after the ulcers i got ulcers on my tongue also..and it is really painful, i cant eat neither talk.. I've had an ulcer at the bottom of my gum on the left hand side, its white grey and red, my lip gets rather inflamed and leaves a redish rash kind of thing around it, its so uncomfortable it bares me to eat or drink. I've been using bonjela for 2weeks now and all it does is numbs it for 5seconds."}, {"url": "http://www.wikihow.com/Treat-Canker-Sores-or-Mouth-Ulcers", "passage_text": "1 Hydrogen peroxide is an antiseptic that will reduce the amount of bacteria in your mouth and help the canker sore heal. 2  The canker sore should go away in about 2-3 days if you do it twice a day. 1 Unlike cold sores, canker sores or mouth ulcers are not contagious, kissing someone with a canker sore will not harm your partner but may still be uncomfortable for you. 2  Cold sores are different from canker sores — they form on the lips or outside the mouth."}, {"url": "http://www.mouthulcers.org/messages.php?thread=2100", "passage_text": "I've had a mouth ulcer on the side of my bottom lip for about 3 days. It gets to the point I can't eat or drink ANYTHING without the substance bothering it. I can't even enjoy my birthday dinner tomorrow because it'll be so painful. I've had an ulcer at the bottom of my gum on the left hand side, its white grey and red, my lip gets rather inflamed and leaves a redish rash kind of thing around it, its so uncomfortable it bares me to eat or drink. I've been using bonjela for 2weeks now and all it does is numbs it for 5seconds."}, {"url": "http://www.webmd.boots.com/oral-health/guide/mouth-ulcers", "passage_text": "You may have a mouth ulcer if you have: 1  A painful sore or sores inside your mouth, on the tongue, soft palate (the back portion of the roof of your mouth), or inside your cheeks. 2  Sores in your mouth that are round, white, or grey in colour, with a red edge or border. 1 These are around 2-8mm in diameter and usually clear up in 10 days to 2 weeks. 2  Major ulcers. 3  These are bigger and deeper, often with a raised or irregular border. 4  This type of ulcer can take several weeks to heal and may leave a scar in the mouth."}, {"url": "http://www.mouthulcers.org/messages.php?thread=2100", "passage_text": "I get mouth ulcers constantly, I've had one for nearly 2 weeks but it's on tip of my tongue so I think it's just getting irritated. I get them on side of my tongue to like when my tongue feels swollen, I have Undersctive thyroid. Easophogus us and ulcer on it. But always suffered with mouth ulcers. I've had an ulcer at the bottom of my gum on the left hand side, its white grey and red, my lip gets rather inflamed and leaves a redish rash kind of thing around it, its so uncomfortable it bares me to eat or drink. I've been using bonjela for 2weeks now and all it does is numbs it for 5seconds."}, {"url": "http://www.byemouthulcer.com/information/faq/", "passage_text": "Depending on the size of the mouth ulcer, mouth ulcer usually will heal in 7 to 14 days. Mouth ulcers with a size bigger then 10millimetres may take a month or several months to heal. Major ulcer is a less common type of mouth ulcer. They are 10mm and bigger in size and appear singly or in pairs. Major ulcers are very painful and take 1 or 2 months to heal and may leave a scar. Herpetiform ulcer. Herpetiform ulcer is a rare type of mouth ulcer, account for 10% of the cases. Herpetiform ulcer look like pinpoints and appear in clusters or large groups"}]