[{"url": "http://forums.steampowered.com/forums/showthread.php?t=3044559", "passage_text": "Steam cards work in the way of DLC or Microsoft points. The code for the card is printed on the receipt. So you have to go to the store to buy the Steam Wallet code, you will get a receipt and the code should be on it. I know it's a hassle and I do not understand why they chose Gamestop and Best Buy to be the ones to carry these cards/codes."}, {"url": "https://www.paypal-gifts.com/us/brands/gamestop.html", "passage_text": "OK. This card can be used to purchase merchandise only in the U.S. GameStop stores listed below or at either GameStop.com or EBgames.com. Except where required by law, it may not be returned, redeemed for cash, or applied as payment on any account, and will not be replaced if lost or stolen. To purchase a gift card (“Digital Gift”) from the PayPal Digital Gifts store (“Store”) you must have a valid U.S. PayPal account. Use of this website and the Store constitutes acceptance of the PayPal User Agreement, the PayPal Privacy Policy and any other legal agreements that apply to you as a PayPal account holder."}, {"url": "https://answers.yahoo.com/question/index?qid=20120518074650AA6Cw8K", "passage_text": "This Site Might Help You. RE: can i use a gamestop gift card on steam? i want to buy something from game stop and steam can i use a game stop gift card on both sites to buy what i want? Update: so i can use a steam wallet code on steam and on gamestop say i have a 25 dollar card i can use 10 on gamestop and 15 on steam?"}, {"url": "https://www.amazon.com/Gamestop-Gift-Cards-E-mail-Delivery/dp/B00MV9FCFQ", "passage_text": "Legal Disclaimer. This card can be used to purchase merchandise only in the U.S. GameStop stores listed below or at either GameStop.com or EBgames.com. Except where required by law, it may not be returned, redeemed for cash, or applied as payment on any account, and will not be replaced if lost or stolen. "}, {"url": "http://steamcommunity.com/discussions/forum/10/864956555002735630/", "passage_text": "Originally posted by Spawn of Totoro:Originally posted by ghost wolf:can u use gamestop gift cards to buy steam gift cards? Most places won't let you use a gift card to buy a gift card. You would have to ask Gamestop about their policy on that. I can at mine, you just give them the card and maybe some cash depending on how much was on the card, and then you buy it. Considering the Gamestop giftcard is to be used in Gamestop, though, I highly doubt they'll want you using it directly on Steam. After all, I'd imagine Valve give a percentage cut to Gamestop for every Steam Wallet code they sell."}, {"url": "http://steamcommunity.com/discussions/forum/10/864956555002735630/", "passage_text": "Using Gamestop giftcards on Steam... So, around Christmas time I got a Gamestop giftcard. Well, the problem was, it was on Christmas, so I couldn't use it to buy a Steam Wallet card... So, I was afraid that the games I wanted would be on sale, and I wouldn't have the money to buy it... Considering the Gamestop giftcard is to be used in Gamestop, though, I highly doubt they'll want you using it directly on Steam. After all, I'd imagine Valve give a percentage cut to Gamestop for every Steam Wallet code they sell."}, {"url": "http://forums.steampowered.com/forums/showthread.php?t=1627796", "passage_text": "Reputation: 496. Posts: 1,629. you can only buy steam games with a gamestop giftcard if gamestop sells those steam games. And to answer the real question you meant to ask, no you cannot use a gamestop card in the steam store. And most likely never will. Quote: Originally Posted by thejuice027"}, {"url": "http://www.shacknews.com/article/73792/prepaid-steam-cards-coming-to-gamestop", "passage_text": "With a new initiative from GameStop, you'll be able to use cash and store credit to fund your next purchase on Steam. Prepaid  Steam Wallet  cards are now available at all US GameStop locations. They will be available in $20 and $50 denominations. This gives even more options to customers now that they can put money in their Steam Wallet using cash, gift cards or trade credits through our convenient neighborhood locations, GameStop's Steve Nix said in a press release."}, {"url": "http://forums.steampowered.com/forums/showthread.php?t=1627796", "passage_text": "Posts: 20. Gamestop has no affiliation with Steam. It's like going to Best Buy and trying to use your Wal-Mart gift card. You'll get some funny looks. Though, Gamestop will sell many games offered on Steam and these games will use the Steam platform for distribution, updates, protection, ect. Quote: Originally Posted by thejuice027. you can only buy steam games with a gamestop giftcard if gamestop sells those steam games. And to answer the real question you meant to ask, no you cannot use a gamestop card in the steam store."}, {"url": "https://www.paypal-gifts.com/us/brands/gamestop.html", "passage_text": "GameStop Terms and Conditions. This card can be used to purchase merchandise only in the U.S. GameStop stores listed below or at either GameStop.com or EBgames.com. Except where required by law, it may not be returned, redeemed for cash, or applied as payment on any account, and will not be replaced if lost or stolen. To purchase a gift card (“Digital Gift”) from the PayPal Digital Gifts store (“Store”) you must have a valid U.S. PayPal account. Use of this website and the Store constitutes acceptance of the PayPal User Agreement, the PayPal Privacy Policy and any other legal agreements that apply to you as a PayPal account holder."}]