[{"url": "http://www.asknumbers.com/AcresToSquarefeetConversion.aspx", "passage_text": "1 Acre = 43 560 Square Feet. Acre is an imperial and US customary system area unit. In metric system, it's replaced by hectare. The abbreviation is ac. Square foot is an imperial and US customary area unit. In metric system, it's replaced by square meters (metres). The abbreviations are sq ft and ft 2 ."}, {"url": "http://www.answers.com/Q/How_many_square_feet_is_one_acre", "passage_text": "There are 43,560 square feet in one acre.   An acre is a unit of area. 640 acres equal a square mile. Hence, it is 1/640 of a square mile. Since a square mile contains 2 … 7,878,400 square feet, an acre is 27,878,400 divided by 640, which is 43,560 square feet."}, {"url": "http://qna.mortgagenewsdaily.com/questions/how-many-square-feet-in-an-acre-of-land", "passage_text": "There are 43,560 square feet in a acre; this is 4,840 square yards. You can find a conversion calculator at http://www.unitconversion.org/area/acres-to-square-foots-conversion.html Originally, the size of an acre was approximately the amount of land an ox could plow in a day."}, {"url": "http://1howmany.com/how-many-feet-in-an-acre", "passage_text": "Units of Measure / How Many Feet in an Acre. When we are talking about how many feet are in one acre 1, of course, we mean square feet 2, because acres and square feet are units of area and a foot is a length unit. Everybody can imagine an area of a square foot, but it is not so easy to visualize an acre. A good example comes from sport."}, {"url": "http://sizes.com/units/acre.htm", "passage_text": "A square plot of ground 208.7 feet on a side will cover an acre. An American football field, 360 feet by 160 feet, is about 1.3 acres; 12 high school basketball courts are a little more than 1 acre. Here's a way for city dwellers to use a Google map of their neighborhood to get a feel for how big an acre is."}, {"url": "http://www.convertunits.com/from/square+feet/to/acre", "passage_text": "The answer is 43560. We assume you are converting between square foot and acre. You can view more details on each measurement unit: square feet or acre. The SI derived unit for area is the square meter. 1 square meter is equal to 10.7639104167 square feet, or 0.000247105381467 acre."}]