[{"url": "http://www.homeadvisor.com/cost/lawn-and-garden/install-a-sprinkler-system/", "passage_text": "If you are nervous that the cost of a sprinkler system may not fit into your budget, here are a few things to consider that will affect the price of a new sprinkler system. One of the largest factors in the cost of your sprinkler system is the size of your property. The more pipe that needs to be laid and the more sprinkler heads that you need will make the price of your system rise. However, the price does not go up proportionally. That is to say the cost of a sprinkler system for a property that is twice the size of another is not necessarily twice the price. This is because sprinkler systems run in zones. A zone is an area with pipe and approximately 5-10 sprinkler heads"}, {"url": "http://home.costhelper.com/sprinklers.html", "passage_text": "1 Prices for underground sprinkler systems vary considerably by region and climate, but for an average 2,500-square-foot (50-x-50-foot) front yard, it's about $1,500-$2,500, while a sprinkler system for 5,000 square feet (front and back yards) costs about $2,500-$3,500. I have just received two estimates for a sprinkler system at my new (as of Oct. 2011) residence. House was built in 66 and new had a system. 1st quote seemed high at $6,000 then I got the second one for $10,000."}, {"url": "http://home.costhelper.com/fire-sprinkler.html", "passage_text": "1 According to the Fire Protection Research Organization's 2009 Fire Sprinkler Cost Assessment, sprinkler installation costs homebuilders $0.38-$3.66 per sprinklered square foot, with an average cost of $1.61 per sprinklered square foot. 2  For an average 2,200-square-foot home, expect to pay about $3,542. 1 Communities with sprinkler ordinances typically charge permit and inspection fees. 2  Some communities have flat fees, and others base the fees on square footage or value of the house. 3  Typically, the permit costs are $50-$350, but some communities charge as high as $800 in permit fees."}, {"url": "https://learningcenter.statefarm.com/safety-2/home-1/8-great-reasons-to-install-a-home-fire-sprinkler/", "passage_text": "1 In a new home, the cost may add 1% to 2.75% to the total new construction cost. 2  Nationally, on average, home fire sprinkler systems cost $1.61 per square foot of sprinkler space in new construction. 1 Sprinklers may put out the fire even as the residents are fleeing the home. 2  Stopping a fire in its earliest stages increases safety and reduces the amount of property damage. 3  Sprinkler heads activate individually and only over the area of the fire."}, {"url": "http://www.kauffmanco.net/blog/fire-sprinkler-costs/", "passage_text": "Many insurance companies offer steep discounts for building owners and homeowners who install fire sprinklers – sometimes as much as 60%! Installing a fire sprinkler system in your home is one of the smartest investments you can make in your home. They’re not expensive! The average costs for a fire sprinkler system are as follows: 1  A complete fire sprinkler system integrated into a new construction project costs about $1 – 2 per square foot. 2  This includes equipment and installation. 3  Retrofitting an existing building usually costs between $2 – 7"}, {"url": "http://home.costhelper.com/fire-sprinkler.html", "passage_text": "1 For an average 2,200-square-foot home, expect to pay about $3,542. 2  For a 3,500-square-foot home, expect to pay about $5,635. 3  Fire sprinklers cost 1%-2% of the cost of a new home. 4  In already existing properties, sprinkler systems typically cost $2,000-$16,000. 1 Communities with sprinkler ordinances typically charge permit and inspection fees. 2  Some communities have flat fees, and others base the fees on square footage or value of the house. 3  Typically, the permit costs are $50-$350, but some communities charge as high as $800 in permit fees."}, {"url": "https://learningcenter.statefarm.com/safety-2/home-1/8-great-reasons-to-install-a-home-fire-sprinkler/", "passage_text": "1 The costs of installing a home sprinkler system vary depending on many factors, including the location of the home, its water pressure and added fees. 2  In a new home, the cost may add 1% to 2.75% to the total new construction cost. 1 Sprinklers may put out the fire even as the residents are fleeing the home. 2  Stopping a fire in its earliest stages increases safety and reduces the amount of property damage. 3  Sprinkler heads activate individually and only over the area of the fire."}, {"url": "http://home.costhelper.com/fire-sprinkler.html", "passage_text": "1 For a 3,500-square-foot home, expect to pay about $5,635. 2  Fire sprinklers cost 1%-2% of the cost of a new home. 3  In already existing properties, sprinkler systems typically cost $2,000-$16,000. 1 Communities with sprinkler ordinances typically charge permit and inspection fees. 2  Some communities have flat fees, and others base the fees on square footage or value of the house. 3  Typically, the permit costs are $50-$350, but some communities charge as high as $800 in permit fees."}, {"url": "http://www.popularmechanics.com/home/lawn-garden/how-to/a724/install-sprinkler-system-underground/", "passage_text": "If you're tired of dragging that old lawn sprinkler around every few days, you may want to consider installing your own underground sprinkler system. By doing the job yourself, you can save 30 to 40 percent of the cost of a professional installation, and today's sprinkler components are easier than ever to assemble. above the highest point of the yard. I installed a reduced-pressure backflow preventer (about $350) because it's allowed below grade. I put it in the basement and will drain the system to this point each winter. The cost of an in-ground sprinkler system can vary widely."}, {"url": "http://www.bobvila.com/articles/465-residential-sprinkler-systems/", "passage_text": "The cost of a home-sprinkler system will depend on a number of factors. A new-home, stand-alone installation can run anywhere from $1.00 to $1.25 per square foot, while a retrofit could cost $5 to $6 per square foot. A residential sprinkler system will save a homeowner money in the event of a fire. When activated, a sprinkler head will spray 15 to 20 gallons per minute. “Eighty to ninety percent of fires are put out with one sprinkler head,” Marshall says."}]