[{"url": "https://en.wikipedia.org/wiki/Genetically_modified_organism", "passage_text": "A genetically modified organism (GMO), also known as a transgenic organism, is any organism whose genetic material has been altered using genetic engineering techniques (i.e. genetically engineered organism). "}, {"url": "http://www.wisegeek.org/what-are-transgenic-organisms.htm", "passage_text": "A transgenic organism occurs when an organism is modified by inserting DNA from an organism of another species. Transgenic organisms are often developed for agricultural purposes. Kiwis, oranges and other fruits have been genetically modified to be resistant to certain diseases. A transgenic organism is an organism which has been modified by inserting the DNA of another species into it as an embryo."}, {"url": "https://answers.yahoo.com/question/index?qid=20100905172303AArGWRq", "passage_text": "Answers. Best Answer: they are organisms that contain dna from another organism. it is a type of gmo, or genetically modified organism. Ex: genetically modified crops, transgenic cows that produce different milk, mice with different genes etc. Source(s):"}, {"url": "http://www.answers.com/Q/What_are_some_examples_of_transgenic_species", "passage_text": "A transgenic organism is one that has been genetically modified by humans, there are no specific species. However, some beings that have been changed are as follows: Drosophila melanogaster (common fruit fly), pigs (scientists created Enviropig, not a species), and fish (scientists created GloFish, not a species). "}, {"url": "http://biology-forums.com/index.php?topic=20502.0", "passage_text": "3 years ago. A transgenic organism is one that contains genes from other organisms. These genes usually add some special ability or function to the organism. Agriculture offers many examples of transgenic organisms. Soybeans have been engineered to contain glyphosate-resistance genes, and other crops have been engineered to grow well in soil with high salt concentrations."}, {"url": "http://knowgenetics.org/transgenic-organisms/", "passage_text": "Modern genetic technology can be used to modify the genomes of living organisms. This process is also known as “genetic engineering.” Genes of one species can be modified, or genes can be transplanted from one species to another. Genetic engineering is made possible by recombinant DNA technology. Organisms that have altered genomes are known as transgenic. Most transgenic organisms are generated in the laboratory for research purposes. For example, “knock-out” mice are transgenic mice that have a particular gene of interest disabled"}, {"url": "https://answers.yahoo.com/question/index?qid=20080212055958AA9xj06", "passage_text": "Answers. Relevance. Rating Newest Oldest. Best Answer: A transgenic organism is a type of genetically modified organism (GMO) that has genetic material from another species that provides a useful trait.For instance, a plant may be given genetic material that increases its resistance to frost. Report Abuse. Transgenic organism or genetically modified organism is a living organism that has a foreign DNA introduced to its genome. On daily basis we meet transgenic plants which carry resistance genes for insecticides or viruses."}, {"url": "http://www.wisegeek.org/what-are-transgenic-organisms.htm", "passage_text": "A transgenic organism is an organism which has been modified with genetic material from another species. The genetic modification is accomplished by inserting DNA into an embryo with the assistance of a virus, a plasmid, or a gene gun. A transgenic organism is an organism which has been modified by inserting the DNA of another species into it as an embryo."}]