[{"url": "http://www.academicinvest.com/science-careers/geology-careers/how-to-become-a-geologist", "passage_text": "To become a geologist, you need to begin by earning a Bachelor of Science degree in Geology or a closely related field such as Environmental Science. Completing coursework geology, mathematics and physics is a great way to build an educational foundation for your prospective career as a geologist. Depending on where your career ambitions and interests lie, you will likely need a graduate degree in geology to become a senior level geologist. Employers also usually accept a degree in Environmental Engineering provided the candidate has experience in geology"}, {"url": "http://www.academicinvest.com/science-careers/geology-careers/how-to-become-a-geologist", "passage_text": "Depending on the requirements of the employer, a Master’s degree in Geology or Environmental Science is typically sufficient for many applied research positions. To become a geologist who works in research and university teaching positions a PhD in Geology or Environmental Science is needed. Completing coursework geology, mathematics and physics is a great way to build an educational foundation for your prospective career as a geologist. Depending on where your career ambitions and interests lie, you will likely need a graduate degree in geology to become a senior level"}, {"url": "http://study.com/articles/Become_an_Environmental_Geologist_Career_Roadmap.html", "passage_text": "The typical requirement for an environmental geologist position is a bachelor's degree in a geoscience field, such as geology, hydrogeology or environmental science. Some employers may consider candidates who have an engineering degree. Step 2: Gain Professional Experience. After graduating, students should secure an entry-level position in the environmental geology field. Work experience can lead to more advanced positions, in addition to fulfilling requirements for licensure."}, {"url": "http://www.academicinvest.com/science-careers/geology-careers/how-to-become-a-hydrologist", "passage_text": "To become a hydrologist, you need to begin by earning a Bachelor of Science degree in Geology, Hydrology or a closely related field such as Environmental Science. Depending on where your career ambitions and interests lie, you will likely need a graduate degree in geology, hydrology, chemistry or environmental science to become a senior level hydrologist."}, {"url": "http://study.com/articles/Become_an_Environmental_Geologist_Career_Roadmap.html", "passage_text": "Some states require environmental geologists to earn a professional geologist license. Requirements vary by state but often include a degree in geological sciences, previous relevant work experience, personal references and passing the National Association of State Boards of Geology (ASBOG) exam. Step 2: Gain Professional Experience. After graduating, students should secure an entry-level position in the environmental geology field. Work experience can lead to more advanced positions, in addition to fulfilling requirements for licensure."}, {"url": "http://www.bls.gov/ooh/architecture-and-engineering/environmental-engineers.htm", "passage_text": "What Environmental Engineers Do. Environmental engineers use the principles of engineering, soil science, biology, and chemistry to develop solutions to environmental problems. They are involved in efforts to improve recycling, waste disposal, public health, and water and air pollution control. Students interested in becoming an environmental engineer should take high school courses in chemistry, biology, physics, and math, including algebra, trigonometry, and calculus. Entry-level environmental engineering jobs require a bachelor's degree."}, {"url": "http://study.com/articles/Environmental_Geology_Degree_and_Training_Program_Information.html", "passage_text": "For admission into a master's program, you need a bachelor's degree in geology, engineering, architecture or a related field. Schools often ask for an essay describing the applicant's career objectives and reasons for selecting a school's program, and letters of recommendation. Students seeking a career in the field can pursue the less common bachelor's degree in environmental geology or look into other program options."}, {"url": "http://study.com/articles/Become_an_Environmental_Geologist_Career_Roadmap.html", "passage_text": "A master's degree in geology or a related field may provide an edge when securing work or seeking advancement. Master's programs give students a broad range of advanced knowledge, including on environmental change, biodiversity, groundwater and the impact of pollution. Step 2: Gain Professional Experience. After graduating, students should secure an entry-level position in the environmental geology field. Work experience can lead to more advanced positions, in addition to fulfilling requirements for licensure."}, {"url": "http://www.bls.gov/ooh/architecture-and-engineering/environmental-engineers.htm", "passage_text": "A bachelor’s degree is needed to become an environmental engineer. Environmental engineers must have a bachelor’s degree in environmental engineering or a related field, such as civil, chemical, or general engineering. Employers also value practical experience. Therefore, cooperative engineering programs, which provide college credit for structured job experience, are valuable as well. Students interested in becoming an environmental engineer should take high school courses in chemistry, biology, physics, and math, including algebra, trigonometry, and calculus. Entry-level environmental engineering jobs require a bachelor's degree."}]