[{"url": "http://www.foodnetwork.com/recipes/oklahoma-joes-smoked-brisket-flat-recipe.html", "passage_text": "Return the brisket to the grill (or smoker) The brisket is finished cooking when it is very tender and reaches an internal temperature of 190 degrees F, about another 1 to 2 hours. Let rest for 45 minutes, then unwrap and slice. Serve with BBQ sauce on the side. "}, {"url": "http://www.charbroil.com/community/smoke-brisket-electric-smoker/", "passage_text": "If you’re smoking with a Char-Broil Digital Smoker, prehet the digital smoker to 225 degrees Fahrenheit and set the internal meat temperature of 190 degrees Fahrenheit. Stick the temperature probe into the thickest part of the brisket, and place it on a rack in the cooker. Press start on the smoker. 6 thoughts on “ How to Smoke a Brisket in an Electric Smoker ”. I have found over the years that before you RUB the meat, to paste a layer of yellow mustard on the meat to help hold the rub in place."}, {"url": "http://bbq.about.com/cs/brisket/a/aa030798a.htm", "passage_text": "You will want a fire of about 200 degrees F to 230 degrees F. (93 degrees C. to 110 degrees C.). At this temperature you can expect the cooking time to be about 1 1/2 hours per pound. Do the math ahead of time so you know how long you will need to keep the fire going. I have heard some people complain that after about 8 to 10 hours that the meat can get too smoky. If you like a milder smoke flavor then you have another reason to wrap the brisket in foil. Temperature: The general temperature to aim for is about 180 degrees F (80 degrees C.). You want to measure that with a good meat thermometer in the thickest part of the meat being careful to keep it away from the fat"}, {"url": "http://www.texasbbqforum.com/viewtopic.php?f=2&t=7360", "passage_text": "I usually cook about 10lb briskets and I will smoke them for about 3 to 3 1/2 hours at start up. Sometimes about mid way through cooking I will wrap the brisket in foil letting it finish. The smoker has a built in digital temperature probe so I usually reach the 190 degrees and then some. Maybe mist down your brisket during the early stages of the cook? I cook briskets for 10 to 12 hours at 235° to an internal temp of 195°. The smoke ring will stop forming when the internal temp of the meat gets a number I can't remember just now but it is about 3 to 4 hours into a low and slow cook."}, {"url": "http://www.smoker-cooking.com/howtosmokeabrisket.html", "passage_text": "Before we get into how to smoke a brisket, let's buy one. For tender, juicy, flavorful brisket, choose one that's untrimmed. It'll have a layer of fat on it that may be up to one inch thick. Look for one that has a quarter-inch to half-inch thick layer of fat. If it's thicker, you can trim some off later. "}, {"url": "http://bbq.about.com/cs/brisket/a/aa030798a.htm", "passage_text": "After all you have better temperature control in the average oven than you do in a smoker. Purists scoff at the idea of using the oven. The reason for the wrapping is to keep the Brisket moist. But if you have a good fat layer, your temperature isn't too high and you keep a good supply of water in the smoker you shouldn't have any trouble with the meat drying out. I have heard some people complain that after about 8 to 10 hours that the meat can get too smoky. If you like a milder smoke flavor then you have another reason to wrap the brisket in foil. Temperature: The general temperature to aim for is about 180 degrees F (80 degrees C.). You want to measure that with a good meat thermometer in the thickest part of the meat being careful to keep it away from the fa"}, {"url": "http://www.smoking-meat.com/august-1-2013-amazingly-tender-smoked-brisket-tutorial", "passage_text": "Once your smoker is maintaining 200 degrees, you are ready to place the brisket in the smoker. Smoke the Brisket. Place the brisket directly on the smoker grate with the fat side down. Maintain 200 degrees F throughout and keep the smoke going for at least 6 hours if you are not using a stick burner. "}, {"url": "http://bbq.about.com/od/brisket/ss/aa092708a.htm", "passage_text": "With the beef brisket ready, it's time to get the smoker ready. You will need a lot of fuel because the smoking process takes a long time. What I do is nearly fill the firebox on the smoker with good lump charcoal. Then I pour in a chimney full of burning charcoal. "}]