[{"url": "http://www.ri.net/schools/West_Warwick/manateeproject/grassland/plant.htm", "passage_text": "The Big Blue stem and switch grass can grow 7 feet tall. The little blue stem and needle grass types grow up to 4 feet high. In the Rocky Mountains, buffalo grass and blue grama grow between 4 and 18 inches tall. There are 23 species of plants per square yard in the grassland. The stems and leaves of all plants are made up of chloroplasts. The Purple Cone Flower attracts Japanese beetles. Another plant found in the grassland is the Big Blue Stem, is also called tallest of the tall, turkey claw, turkey foot grass, and king of the prairie. The scientific name is Andropogon Gerardii. This grass falls in the herbaceous perennial category"}, {"url": "https://en.wikipedia.org/wiki/Grassland", "passage_text": "Grasslands are areas where the vegetation is dominated by grasses (Poaceae), however sedge (Cyperaceae) and rush (Juncaceae) families can also be found. Grasslands occur naturally on all continents except Antarctica. Grasslands are found in most ecoregions of the Earth. For example, there are five terrestrial ecoregion classifications (subdivisions) of the temperate grasslands, savannas, and shrublands biome (' ecosystem '), which is one of eight terrestrial ecozones of the Earth's surface. Notable tropical and subtropical grasslands include the Llanos grasslands of South America. Mid-latitude grasslands, including the Prairie and Pacific Grasslands of North America, the Pampas of Argentina, Brazil and Uruguay, calcareous downland, and the steppes of Europe."}, {"url": "http://www.ucmp.berkeley.edu/glossary/gloss5/biome/grassland.html", "passage_text": "Grasslands are characterized as lands dominated by grasses rather than large shrubs or trees. In the Miocene and Pliocene Epochs, which spanned a period of about 25 million years, mountains rose in western North America and created a continental climate favorable to grasslands. Savanna Savanna is grassland with scattered individual trees. Savannas of one sort or another cover almost half the surface of Africa (about five million square miles, generally central Africa) and large areas of Australia, South America, and India."}, {"url": "http://globerove.com/australia/Australian-Grasslands/4507", "passage_text": "The Australian grasslands are famous for having the most species of plants in the Australian subcontinent. These grasslands are famed for the numerous types of grasses that grow on these plains. Grasses are plants that are common to every continent on the planet. Then read our article for facts and information... Australian grasslands are flat, open habitats that are covered in grass, wild flowers, low shrubs, some trees and other types of plants. The extent of rainfall received by the grassland lies between that of forests and deserts; these areas receive more rainfall than the deserts but less than the forestlands"}, {"url": "https://targetstudy.com/nature/habitats/grasslands/", "passage_text": "Grassland Adapted Animals-The Animals that live in Grasslands have adapted themselves to dry, windy conditions. Most of the Animals found in Grasslands are grazers which eat a variety of Grasses and other Plants. Some Animals, such as Bison, have broad, flat-topped teeth and digestive systems especially adapted to feed on Grasses. Basic Types of Grasslands based on Climatic Dryness. 1. Tropical Grasslands-Tropical Grasslands are located near the equator, between the Tropic of Cancer and the Tropic of Capricorn. Most of the Tropical Grasslands are found in the interior part of continents between the Tropical Rain Forests and Tropical Deserts."}, {"url": "https://targetstudy.com/nature/habitats/grasslands/", "passage_text": "A Grassland is a is a type of Habitat or Biome which is dominated by Grasses and other Herbaceous (non-woody) Flowering Plants and a variety of scattered Trees and Bushes. Grasslands occur in areas where there is not enough regular rainfall to support the growth of a Forest, but not so little as to form a Desert. Basic Types of Grasslands based on Climatic Dryness. 1. Tropical Grasslands-Tropical Grasslands are located near the equator, between the Tropic of Cancer and the Tropic of Capricorn. Most of the Tropical Grasslands are found in the interior part of continents between the Tropical Rain Forests and Tropical Deserts."}, {"url": "http://www.ri.net/schools/West_Warwick/manateeproject/grassland/plant.htm", "passage_text": "Most of the plant life in the grasslands are grasses. They include Blue Grama, Buffalo grass, Big Blue stem, switch grass and Little Blue Stem just to name a few. The Purple Cone Flower attracts Japanese beetles. Another plant found in the grassland is the Big Blue Stem, is also called tallest of the tall, turkey claw, turkey foot grass, and king of the prairie. The scientific name is Andropogon Gerardii. This grass falls in the herbaceous perennial category"}, {"url": "https://en.wikipedia.org/wiki/Flora_of_Australia", "passage_text": "The flora of Australia comprises a vast assemblage of plant species estimated to over 20,000 vascular and 14,000 non-vascular plants, 250,000 species of fungi and over 3,000 lichens. The fungal flora of Australia is not well characterised; Australia is estimated to have about 250,000 fungal species of which roughly 5% have been described. Knowledge of distribution, substrates and habitats is poor for most species, with the exception of common plant pathogens."}]