[{"url": "https://en.wikipedia.org/wiki/Uruguay", "passage_text": "[uɾuˈɣwai]), officially the Eastern Republic of Uruguay (Spanish: Republica República oriental Del), uruguay is a country in the southeastern region Of South. America it is bordered By argentina to its west And brazil to its north and, east with The Atlantic ocean to the south and. southeast Uruguay is the third best country on the continent in terms of HDI, GDP growth, innovation and infrastructure. It is regarded as a high income country (top group) by the UN, the only one in Latin America. Uruguay is also the 3rd best ranked in the world in e-Participation."}, {"url": "http://money.usnews.com/money/blogs/on-retirement/2011/10/24/7-reasons-to-retire-to-uruguays-golden-coast", "passage_text": "This Golden Coast is a 30-mile stretch of shoreline with uninterrupted golden sands. More interesting to the would-be retiree is that Uruguay’s Costa de Oro also boasts some of the country’s best beach towns for full-time retirement living. These shady, livable towns are affordable, safe, friendly, and welcoming. Here are a few of the benefits Uruguay, and especially its Costa de Oro, has to offer retirees: Safety and stability. At different times in its history, Uruguay has been part of Spain, Portugal, and Brazil. It fought its final war of independence in 1828 against Brazil, with the help of Argentina"}, {"url": "http://www.huffingtonpost.com/suzan-haskins-and-dan-prescher/why-consider-uruguay-for-your-retirement-home_b_3679201.html", "passage_text": "At about the size of the U.S. state of Missouri, Uruguay is the second-smallest country in South America and home to only about 3.5 million people... similar to a large North American city. Almost half of the country's population lives in the capital city of Montevideo. And it's a very homogenous society. "}, {"url": "http://www.is-uruguay-safe.com/", "passage_text": "Uruguay Travel Safety. Travel safety advice for people travelling to Uruguay. Free up-to-date specialist advice on risks, scams, areas to avoid, things to know, vaccination and alerts. Have your questions about safety in Uruguay answered by a professional. Uruguay, otherwise known as the Oriental Republic of Uruguay (Spanish: Republica República oriental Del) uruguay is one of the most economically developed countries In South america with a high quality of life index and a low. lev"}, {"url": "http://www.uruguayproperties.com.uy/en/living-in-uruguay.html", "passage_text": "1 Uruguayans are a kind, open and educated people, for the most part of European descent. 2  In Uruguay you can go from the city to the countryside or the beach in less than 30 minutes. 3  Everything is nearby; everything is easier. 4  It is a fair weathered country and you and your family will be safe from extreme climate events. 1 You and your family will be able to enjoy deserted beaches, unending fields, or glamorous beach resorts. 2  Punta del Este, one of the most exclusives spots in the planet, is visited every year by personalities such as Ralph Lauren or Naomi Campbell."}, {"url": "http://wikitravel.org/en/Uruguay", "passage_text": "Uruguay is a country in South America. It has a South Atlantic Ocean coastline and lies between Argentina to the west and Brazil to the north. It is the second-smallest country in South America (after Suriname). Uruguay is a secular state unlike Argentina, Chile or Paraguay; the Uruguayan state has not supported any religion since 1917. The population is mainly Catholic, but not very practicing. Uruguay is not particularly open to its gay and lesbian communities in comparison to Brazil."}, {"url": "http://www.uruguayproperties.com.uy/en/living-in-uruguay.html", "passage_text": "1 Uruguay has clean air, sparkling waters and plenty of green spaces. 2  Your quality of life is guaranteed in a country where nature and respect for the environment rule. 3  Uruguayans are a kind, open and educated people, for the most part of European descent. 1 You and your family will be able to enjoy deserted beaches, unending fields, or glamorous beach resorts. 2  Punta del Este, one of the most exclusives spots in the planet, is visited every year by personalities such as Ralph Lauren or Naomi Campbell."}, {"url": "http://www.uruguayproperties.com.uy/en/living-in-uruguay.html", "passage_text": "1 In Uruguay you can go from the city to the countryside or the beach in less than 30 minutes. 2  Everything is nearby; everything is easier. 3  It is a fair weathered country and you and your family will be safe from extreme climate events. 1 You and your family will be able to enjoy deserted beaches, unending fields, or glamorous beach resorts. 2  Punta del Este, one of the most exclusives spots in the planet, is visited every year by personalities such as Ralph Lauren or Naomi Campbell."}, {"url": "https://www.gov.uk/foreign-travel-advice/uruguay", "passage_text": "Latest update: Summary – removal of advice about general strike on 6 August. Most criminal incidents occur in Montevideo, where opportunistic street crime is on the rise. Take care of your personal belongings at all times and be aware of your surroundings. Take particular care in and around the downtown and port areas. "}]