[{"url": "http://www.answers.com/Q/Does_iTunes_cost_to_download", "passage_text": "well it doesn't cost anything to transfer a game to an ipod touch but it does cost a bit of money to get the game off the internet and put it on itunes the highest cost i have … ever seen is $9.99."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20101026151346AAAWoDC", "passage_text": "As you want to know cost for iTunes music and games, I have done some research for the same and have got basic info for the overall average cost. The average price for iPhone apps worldwide dropped 15% between December 2009 and February 2010."}, {"url": "https://support.apple.com/en-us/HT201616", "passage_text": "To upgrade your music to iTunes Plus, follow these steps on your computer: 1  Open iTunes. 2  If you're not already, sign in with your Apple ID and password. 3  Click the My Music tab at the top of iTunes. 4  Click the song or album you want to upgrade."}, {"url": "http://www.answers.com/Q/Does_iTunes_cost_to_download", "passage_text": "It's pretty variable and depends on the song. For instance, in the Australian iTunes store, most Creedence Clearwater Revival songs (just an example) are $1.69 (USD$1. … 37) but their most popular song Proud Mary is $2.19 (USD$1.78)."}, {"url": "http://www.answers.com/Q/Does_iTunes_cost_to_download", "passage_text": ". . one answer at a time. iTunes doesn't cost anything to download. You can download it off of apple.com but if you want to download a song you would have to buy it. For most cases, the songs cost $1.29, and then their are different costs to buy an entire album."}, {"url": "http://www.answers.com/Q/How_much_does_iTunes_cost", "passage_text": "$.99-$1.29 for songs, $1.49-$1.99 for videos. It really depends on what songs you buy. There are one or two free songs each week on iTunes. I have also seen songs for $0.69."}, {"url": "https://support.apple.com/en-us/HT201616", "passage_text": "All songs and music videos now for sale in the iTunes Store are iTunes Plus. In some cases, if you previously bought music with DRM from the iTunes Store, you can download the higher quality, DRM-free versions of your songs with a subscription to iTunes Match."}, {"url": "http://www.answers.com/Q/How_much_does_iTunes_cost", "passage_text": "It's pretty variable and depends on the song. For instance, in the Australian iTunes store, most Creedence Clearwater Revival songs (just an example) are $1.69 (USD$1."}]