[{"url": "http://alexsibaja.blogspot.com/2014/02/lean-manufacturing-is-not-just-about.html", "passage_text": "Lean Manufacturing is not just about Waste (Muda) reduction, is about the 3M’s (Mura, Muri and Muda). "}, {"url": "https://en.wikipedia.org/wiki/Lean_manufacturing", "passage_text": "Toyota's view is that the main method of lean is not the tools, but the reduction of three types of waste: muda (non-value-adding work), muri (overburden), and mura (unevenness), to expose problems systematically and to use the tools where the ideal cannot be achieved. Lean principles are derived from the Japanese manufacturing industry. The term was first coined by John Krafcik in his 1988 article, Triumph of the Lean Production System, based on his master's thesis at the MIT Sloan School of Management."}, {"url": "http://www.vorne.com/learning-center/lean-manufacturing.htm", "passage_text": "All other aspects of the manufacturing process are deemed waste. Lean manufacturing is used as a tool to focus resources and energies on producing the value-added features while identifying and eliminating non value added activities. We have one simple goal. However lean redefines waste. Traditionally waste has been viewed as an object. It is very easy to envision a barrel of scrap and identify it as waste. In lean manufacturing the term waste actually refers not to the physical material but rather the relationship of the resource to the end customer."}, {"url": "http://www.aleanjourney.com/2014/07/what-lean-is-not-10-things-that-are-not.html", "passage_text": "Lean manufacturing is not a head-count reduction system; instead Lean manufacturers understand employees on the shop floor know their work best. Lean manufacturers don’t want employees to work harder, or faster – they want employees to work more efficiently. The difference must then be in how the tools were applied, their appropriateness, but not the tools themselves. 2. Lean is Not Devoid of Technology. The fundamental principle of Lean manufacturing is to design a simple manufacturing system, however, that does not mean eliminating technology."}, {"url": "http://www.vorne.com/learning-center/lean-manufacturing.htm", "passage_text": "Quick Definition. Lean manufacturing is a comprehensive term referring to manufacturing methodologies based on maximizing value and minimizing waste in the manufacturing process. Lean manufacturing has evolved in North America from its beginnings in the Toyota Production System (TPS) in Japan. However lean redefines waste. Traditionally waste has been viewed as an object. It is very easy to envision a barrel of scrap and identify it as waste. In lean manufacturing the term waste actually refers not to the physical material but rather the relationship of the resource to the end customer."}, {"url": "https://en.wikipedia.org/wiki/Lean_manufacturing", "passage_text": "Essentially, lean is centered on making obvious what adds value by reducing everything else. Lean manufacturing is a management philosophy derived mostly from the Toyota Production System (TPS) (hence the term Toyotism is also prevalent) and identified as lean only in the 1990s. Lean principles are derived from the Japanese manufacturing industry. The term was first coined by John Krafcik in his 1988 article, Triumph of the Lean Production System, based on his master's thesis at the MIT Sloan School of Management."}, {"url": "https://en.wikipedia.org/wiki/Lean_manufacturing", "passage_text": "Lean manufacturing or lean production, often simply  lean , is a systematic method for the elimination of waste ( Muda ) within a manufacturing system. Lean principles are derived from the Japanese manufacturing industry. The term was first coined by John Krafcik in his 1988 article, Triumph of the Lean Production System, based on his master's thesis at the MIT Sloan School of Management."}, {"url": "http://www.aleanjourney.com/2014/07/what-lean-is-not-10-things-that-are-not.html", "passage_text": "3. Lean is Not Only for Manufacturing. Whether it is lean manufacturing, lean office, or lean management, benefits can be realized throughout the company in inventory reduction, productivity improvement, and reduction in errors, to name a few. The difference must then be in how the tools were applied, their appropriateness, but not the tools themselves. 2. Lean is Not Devoid of Technology. The fundamental principle of Lean manufacturing is to design a simple manufacturing system, however, that does not mean eliminating technology."}, {"url": "http://www.aleanjourney.com/2014/07/what-lean-is-not-10-things-that-are-not.html", "passage_text": "1. Lean is Not about Tools. Tools do not solve problem but rather people do. It is not about the tools it’s how they are applied. A large number of organizations have failed to produce the desired results from the direct and prescriptive application of Lean tools. The difference must then be in how the tools were applied, their appropriateness, but not the tools themselves. 2. Lean is Not Devoid of Technology. The fundamental principle of Lean manufacturing is to design a simple manufacturing system, however, that does not mean eliminating technology."}]