[{"url": "http://www.mhpcolorado.org/Services/Peer-Support-Services.aspx", "passage_text": "The peer support specialist program is a program designed to help clients in all stages of recovery. We have first-hand experience with mental illness and the challenges that come with it. Despite those challenges we have come to know the reality of wellness. "}, {"url": "https://www.myhealth.va.gov/mhv-portal-web/anonymous.portal?_nfpb=true&_pageLabel=healthyLiving&contentPage=healthy_living/oef_oif_peer_factsheet.htm", "passage_text": "Peer support is a cornerstone to recovery from serious mental illness. People who are mentally ill or have recovered from mental illness can inspire others. Peer support may help people who are mentally ill recover, and may increase the use of helpful resources. 1 Consumer-run services-mental health consumers plan, deliver, and assess services. 2  These include peer support groups, case management, live-in treatment settings and work therapy, crisis and drop-in centers, warmlines, and getting government benefits."}, {"url": "http://www.krasmancentre.com/cultureofrecovery/?page_id=19", "passage_text": "Peer support is a system of giving and receiving help founded on key principles of respect, shared responsibility, and mutual agreement of what is helpful. Peer support is not based on psychiatric models and diagnostic criteria. There are many different modes of peer support, but one thing is common – having lived experience is a valuable skill that not everyone has, and that makes it even more valuable. One pillar of the Culture of Recovery education strategy is Like Minds: Peer Support Education."}, {"url": "https://en.wikipedia.org/wiki/Peer_support_specialist", "passage_text": "Peer support specialist. From Wikipedia, the free encyclopedia. A Peer Support Specialist is a person who has progressed in their own recovery from alcohol or other drug abuse or mental disorder and is willing to self-identify as a peer and work to assist other individuals with chemical dependency or a mental disorder. When peer support specialists work in publicly funded services, the peer support specialists are required to meet government and state certification requirements."}, {"url": "https://en.wikipedia.org/wiki/Peer_support", "passage_text": "Peer support occurs when people provide knowledge, experience, emotional, social or practical help to each other. Trained peer support workers such as peer support specialists and peer counselors receive special training and are required to obtain Continuing Education Units, like clinical staff. Some other trained peer support workers may also be law-enforcement personnel and firefighters as well as emergency medical responders"}, {"url": "https://www.myhealth.va.gov/mhv-portal-web/anonymous.portal?_nfpb=true&_pageLabel=healthyLiving&contentPage=healthy_living/oef_oif_peer_factsheet.htm", "passage_text": "Peer support is when people with the same problem in living (mental illness in this case) come together to support each other to deal with that problem. There are three types of support: 1  Peer support group-a small group of people with serious mental illness present their problems. 1 Consumer-run services-mental health consumers plan, deliver, and assess services. 2  These include peer support groups, case management, live-in treatment settings and work therapy, crisis and drop-in centers, warmlines, and getting government benefits."}, {"url": "https://en.wikipedia.org/wiki/Peer_support", "passage_text": "Peer support is distinct from other forms of social support in that the source of support is a peer, a person who is similar in fundamental ways to the recipient of the support; their relationship is one of equality. Trained peer support workers such as peer support specialists and peer counselors receive special training and are required to obtain Continuing Education Units, like clinical staff. Some other trained peer support workers may also be law-enforcement personnel and firefighters as well as emergency medical responders"}, {"url": "http://www.recoverywithinreach.org/peersupport/", "passage_text": "Peer support can be a one-on-one experience or a group of people sharing together. To view the American Psychiatric Association (APA) Recovery-Oriented Care in Psychiatry Module 4: Peer Supports in Recovery Click Here. Peer Support Programs in Tennessee. Peer Specialists work in a variety of locations, such as peer support centers, crisis stabilization units, respite programs, psychosocial rehabilitation programs, and in psychiatric hospitals. Some of the peer support programs in Tennessee include: "}, {"url": "http://www.krasmancentre.com/cultureofrecovery/?page_id=19", "passage_text": "Peer support accepts and respects the perspective and contributions of lived experience – it shifts the balance of power in subtle but significant ways. Peer support is an important and distinct component of mental health and substance abuse services. After reviewing lots of articles, material from other courses and documents about peer support, here is the definition of Peer Support that we think best covers what is important about peer support. There are many different modes of peer support, but one thing is common – having lived experience is a valuable skill that not everyone has, and that makes it even more valuable. One pillar of the Culture of Recovery education strategy is Like Minds: Peer Support Education."}]