[{"url": "http://education.usgs.gov/lessons/schoolyard/glacialstriations.html", "passage_text": "Key Concepts 1  : Glaciers are made of ice and rocks that get trapped in the ice. 2  Glaciers flow downhill because of gravity. 3  The moving glacier acts a lot like a bulldozer, stripping away layers of rock and moving them off to the side. 4  Rocks embedded in the bottom of the glacier scrape along the newly exposed bedrock and leave behind line-shaped 5  ... T Glacial striations are parallel to the handle of the hammer. Look at how the lines all go the same direction. Click to Enlarge. About : The scratch marks on the schoolyard are formed by the process shown on top -- a broom dragged along over wet tar."}, {"url": "https://en.wikipedia.org/wiki/Glacial_striation", "passage_text": "Glacial striations are scratches or gouges cut into bedrock by glacial abrasion .These scratches and gouges were first recognized as the result of a moving glacier in the late 18th century when Swiss alpinists first associated them with moving glaciers. Large amounts of coarse gravel and boulders carried along underneath the glacier provide the abrasive power to cut trough-like glacial grooves. Finer sediments also in the base of the moving glacier further scour and polish the bedrock surface, forming a glacial pavement."}, {"url": "http://www.geography-site.co.uk/pages/physical/glaciers/stria.html", "passage_text": "Striations. When a glacier moves across the underlying rock, the process of abrasion wears it away. It is the fragments of rock held in the ice that do the abrading, scraping across the rock surface like nails across a wooden desk top. Larger rock fragments leave deep scratch marks behind them."}, {"url": "https://en.wikipedia.org/wiki/Glacial_striation", "passage_text": "They also noted that if they were visible today that the glaciers must also be receding. Glacial striations are usually multiple, straight, and parallel, representing the movement of the glacier using rock fragments and sand grains, embedded in the base of the glacier, as cutting tools. Large amounts of coarse gravel and boulders carried along underneath the glacier provide the abrasive power to cut trough-like glacial grooves. Finer sediments also in the base of the moving glacier further scour and polish the bedrock surface, forming a glacial pavement."}, {"url": "https://en.wikipedia.org/wiki/Glacial_striation", "passage_text": "Most glacial striations were exposed by the retreat of glaciers since the Last Glacial Maximum or the more recent Little Ice Age. As well as indicating the direction of flow of the glacial ice, the depth and extent of weathering of the striations may be used to estimate the duration of post-glacier exposure of the rock. Large amounts of coarse gravel and boulders carried along underneath the glacier provide the abrasive power to cut trough-like glacial grooves. Finer sediments also in the base of the moving glacier further scour and polish the bedrock surface, forming a glacial pavement."}, {"url": "http://maps.unomaha.edu/Maher/geo330/kirk1.html", "passage_text": "Striations are usually multiple, straight parallel lines which represent the movement of the sediment loaded base of the glacier over. Striae can range from microscopic size on a seemingly polished rock to obvious markings millimeters deep and nearly a meter in length. In glaciated regions the rock surfaces will show signs of ice movement over them providing that the surface has not been eroded in the time since glaciation. Signs of movement could be channels, grooves or striations depending on the size of the sediment contained in the glacier."}, {"url": "http://education.usgs.gov/lessons/schoolyard/glacialstriations.html", "passage_text": "Glacial striations on bedrock. Rocks embedded in the bottom of a massive glacier scratched the rock underneath as the glacier moved along. Even though there is no ice present today, these scratched lines are evidence that glaciers were here in the geologic past. Glacial striations are parallel to the handle of the hammer. Look at how the lines all go the same direction. Click to Enlarge. About : The scratch marks on the schoolyard are formed by the process shown on top -- a broom dragged along over wet tar."}, {"url": "http://education.usgs.gov/lessons/schoolyard/glacialstriations.html", "passage_text": "1 Glaciers are made of ice and rocks that get trapped in the ice. 2  Glaciers flow downhill because of gravity. 3  The moving glacier acts a lot like a bulldozer, stripping away layers of rock and moving them off to the side. Glacial striations are parallel to the handle of the hammer. Look at how the lines all go the same direction. Click to Enlarge. About : The scratch marks on the schoolyard are formed by the process shown on top -- a broom dragged along over wet tar."}, {"url": "http://www4.uwsp.edu/geo/faculty/lemke/alpine_glacial_glossary/landforms/striations.html", "passage_text": "Lines etched in bedrock as individual particles embedded in the ice at the base of a glacier scratch the underlying bedrock. These lines are parallel to glacial flow and thus indicate the orientation (but not necessarily the direction) of flow. "}]