[{"url": "https://answers.yahoo.com/question/index?qid=20080728182310AAp9pAl", "passage_text": "This site gives the liver size as being approximately 8 inches (20 cm) horizontally (across) and 6.5 inches (17 cm) vertically (down) and is 4.5 inches (12 cm) thick. Best Answer: This site state the liver size being 7 cm for women and 10.5 cm for men... This is a government site...hope this link works."}, {"url": "http://www.dimensionsinfo.com/liver-size/", "passage_text": "What is the size of the liver? The average width of this body part is around 21 centimeters to 22.5 centimeters. The vertical height of the organ is estimated to be 15 centimeters to 17.5 centimeters. From the front to back, the organ measures 10 centimeters to 12.5 centimeters. The average weight of this body part is between 1.4 kilograms to 1.6 kilograms. Learning the average and normal liver size is important to the detection of fatty infiltration."}, {"url": "http://www.webmd.com/digestive-disorders/picture-of-the-liver", "passage_text": "Front View of the Liver. The liver is a large, meaty organ that sits on the right side of the belly. Weighing about 3 pounds, the liver is reddish-brown in color and feels rubbery to the touch. Normally you can't feel the liver, because it's protected by the rib cage. The liver has two large sections, called the right and the left lobes. "}, {"url": "https://en.wikipedia.org/wiki/Liver", "passage_text": "The liver is a reddish brown wedge-shaped organ with four lobes of unequal size and shape. A human liver normally weighs 1.44–1.66 kg (3.2–3.7 lb). It is both the largest internal organ and the largest gland in the human body. Located in the right upper quadrant of the abdominal cavity, it rests just below the diaphragm, to the right of the stomach and overlying the gallbladder."}, {"url": "http://www.answers.com/Q/How_large_is_an_average_human_liver", "passage_text": "In Human Anatomy and Physiology.   The everage size of an adult liver is around 3 pounds (1.4 kg).   It is somewhat bigger for man, smaller for women, depending on body sizes.   More informations ab … out the anatomy and also the functions of the liver can be found on related links. 3 people found this useful. Answered."}, {"url": "http://www.curezone.org/forums/fm.asp?i=331922", "passage_text": "As adult humans can be of different size, so can the liver. It is approximately 21-22.5 cm across its widest point, 15-17.5 cm at its greatest vertical height, and 10-12.5 cm from front to back. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080728182310AAp9pAl", "passage_text": "37 centimeters equals = 14.56693 Inches The doctors can feel the liver upon examination if it is enlarged by pressing under the rib cage on the patient's right hand side. Best Answer: This site state the liver size being 7 cm for women and 10.5 cm for men... This is a government site...hope this link works."}, {"url": "http://www.mayoclinic.org/diseases-conditions/enlarged-liver/basics/definition/CON-20024769", "passage_text": "Definition. An enlarged liver is one that's bigger than normal. The liver is a large, football-shaped organ found in the upper right portion of your abdomen. The medical term for enlarged liver is hepatomegaly (hep-uh-to-MEG-uh-le). Enlarged liver isn't a disease. It's a sign of an underlying problem, such as liver disease, congestive heart failure or cancer. "}, {"url": "http://www.answers.com/Q/What_is_the_normal_size_of_a_female_liver", "passage_text": "Size of liver? An adult liver would measure 21-22.5 centimeters at it's widest  point and 15-17.5 centimeters at it's vertical height. The liver is  the largest organ in the human body."}]