[{"url": "http://www.answers.com/Q/What_are_two_parts_of_the_scientific_name_of_an_organism", "passage_text": "Confidence votes 163. The naming of an organism as a scientific name is called binomial nomenclature. In this system, the two parts that are used to identify an organism is the genus and the species. For example, Homo sapiens is a scientific name for humans. Homo is the genus and sapiens is the species. They are usually italicized and often only have the first letter of genus (H. sapiens)."}, {"url": "http://biology.tutorvista.com/organism/scientific-names-of-plants-and-animals.html", "passage_text": "The scientific names consists of two terms, the genus name and the species name. The genus name always starts with a capital letter and the species name always starts with a small letter. This process of naming organisms scientifically is known as 'taxonomy'. Assigning scientific names to organism was first developed by a Swedish scientist 'Carlous Linnaeus'."}, {"url": "http://scienceline.ucsb.edu/getkey.php?key=2205", "passage_text": "1. The name has two parts; first, the genus name and then the species or trivial name. If my email comes through correctly, all of the scientific names are in italics. In a scientific name, the genus is capitalized, the specific or trivial name is non capitalized, and the whole name is underlined or italicized."}, {"url": "http://www.answers.com/Q/What_is_the_scientific_name_of_an_organism", "passage_text": "Scientific name is the Genus and Species of the organism. The order is called phylogeny and goes from broadest to narrowest:   Kingdom (animal, plant, fungus, Eukaryo … t (single celled with nucleus) and prokaryot (single celled without nucleus)   Phylum-subphylum (ex Chordata)   Class (ex."}, {"url": "http://www.answers.com/Q/What_are_two_parts_of_the_scientific_name_of_an_organism", "passage_text": "The two parts of a scientific name are called, respectively, Genus and species. Genus is always capitalized, and species is lowercase. Often the entire thing is in italics. Th … e genus is the most specific group that some organism can be in."}, {"url": "http://tolweb.org/tree/learn/TreebuilderTools/BuildingGuide/SciNames.html", "passage_text": "A common name is a name used for an organism that varies according to place, language and culture. For example, the organism with the scientific name Terrapene carolina has the following common names: common box turtle (English), eastern box turtle (English), tortue tabatiere (Tabatière), French tortuga De (Carolina). spanish"}, {"url": "http://www.answers.com/Q/What_are_two_parts_of_the_scientific_name_of_an_organism", "passage_text": "The naming of an organism as a scientific name is called binomial nomenclature. In this system, the two parts that are used to identify an organism is the genus and the species. For example, Homo sapiens is a scientific name for humans. Homo is the genus and sapiens is the species. They are usually italicized and often only have the first letter of genus (H. sapiens)."}]