[{"url": "http://www.geography4kids.com/files/land_erosion.html", "passage_text": "Erosion is the process that breaks things down. As far as we're concerned, erosion is the breakdown of the continents and the land around you. The overall effect of breaking down and weathering the land is called denudation. Denudation is the process of erosion. In nature, large things are broken down into smaller things"}, {"url": "http://www.edu.pe.ca/southernkings/erosiondd.htm", "passage_text": "Erosion is a natural process which is usually made by rock and soil being loosened from the earth's surface at one location and moved to another. Erosion changes the landscape by wearing down mountains, filling in valleys, and making rivers appear and disappear. Erosion begins with a process called weathering; in this process, environmental factors break rock and soil into smaller pieces, and loosen them from the earth's surface. When the wind whips up a dust storm that stings our eyes, its ability to move sand is very clear."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/geography/water_rivers/river_processes_rev1.shtml", "passage_text": "Erosion involves the wearing away of rock and soil found along the river bed and banks. Erosion also involves the breaking down of the rock particles being carried downstream by the river. "}, {"url": "http://teacher.scholastic.com/dirt/erosion/whateros.htm", "passage_text": "Erosion is the process by which the surface of the Earth gets worn down. Erosion can be caused by natural elements such as wind and glacial ice. But anyone who has ever seen a picture of the Grand Canyon knows that nothing beats the slow steady movement of water when it comes to changing the Earth. To see what kind of effects water has on a model landscape, try my Science Lab."}, {"url": "https://en.wikipedia.org/wiki/Erosion", "passage_text": "In earth science, erosion is the action of exogenic processes (such as water flow or wind) which remove soil and rock from one location on the Earth's crust, then transport it to another location where it is deposited. Eroded sediment may be transported just a few millimetres, or for thousands of kilometres. Wind erosion is much more severe in arid areas and during times of drought. For example, in the Great Plains, it is estimated that soil loss due to wind erosion can be as much as 6100 times greater in drought years than in wet years."}, {"url": "http://www.ducksters.com/science/earth_science/erosion.php", "passage_text": "Erosion by Wind. Wind is a major type of erosion, especially in dry areas. Wind can erode by picking up and carrying loose particles and dust away (called deflation). It can also erode when these flying particles strike the land and break off more particles (called abrasion). "}, {"url": "http://www.answers.com/Q/What_is_erosion", "passage_text": "Erosion is the wearing away of the surface of the earth! Erosion is the process by which soil and rock are removed from the Earth's surface by natural processes such as wind or water flow, and then transported and deposited in other locations. The wearing away of land or soil by the action of wind, water, or ice. In hydrologic terms, wearing away of the lands by running water, glaciers,winds, and waves, can be subdivided into three process: Corrasion, Corrosion, and Transportation."}, {"url": "https://en.wikipedia.org/wiki/Soil_erosion", "passage_text": "In earth science, erosion is the action of exogenic processes (such as water flow or wind) which remove soil and rock from one location on the Earth's crust, then transport it to another location where it is deposited. While erosion is a natural process, human activities have increased by 10-40 times the rate at which erosion is occurring globally. Excessive (or accelerated) erosion causes both on-site and off-site problems."}, {"url": "https://en.wikipedia.org/wiki/Erosion", "passage_text": "Feedbacks are also possible between rates of erosion and the amount of eroded sediment that is already carried by, for example, a river or glacier. While erosion is a natural process, human activities have increased by 10-40 times the rate at which erosion is occurring globally. Excessive (or accelerated) erosion causes both on-site and off-site problems. On-site impacts include decreases in agricultural productivity and (on natural landscapes) ecological collapse, both because of loss of the nutrient-rich upper soil layers. In some cases, the eventual end result is desertification. Wind erosion is much more severe in arid areas and during times of drought. For example, in the Great Plains, it is estimated that soil loss due to wind erosion can be as much as 6100 times greater in drought years than in wet years."}]