[{"url": "http://www.riainvision.com/exams/thyroid_uptake_scan.aspx", "passage_text": "A thyroid uptake and scan, also known as a radioactive iodine uptake test (RAIU), is a nuclear medicine exam in which the patient receives an oral dose of a radioactive iodine that is absorbed by thyroid tissue. The amount of radioactivity taken up by the thyroid is measured and images of the thyroid are also obtained."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/003689.htm", "passage_text": "Radioactive iodine uptake (RAIU) is a test of thyroid function. It measures how much radioactive iodine is taken up by the thyroid gland in a certain time period. A similar test is the thyroid scan. The two tests are commonly performed together."}, {"url": "http://www.webmd.com/women/radioactive-iodine-uptake-test", "passage_text": "A radioactive iodine uptake (RAIU) test uses a radioactive tracer and a special probe to measure how much tracer the thyroid gland absorbs from the blood. The test can show how much tracer is absorbed by the thyroid gland."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/003829.htm", "passage_text": "A thyroid scan is a nuclear medicine test that uses a radioactive iodine tracer to examine the structure and function of the thyroid gland. This test is often done together with a radioactive iodine uptake test."}, {"url": "http://www.webmd.com/women/radioactive-iodine-uptake-test", "passage_text": "A radioactive iodine uptake (RAIU) test is done to: 1  Find the cause of an overactive thyroid gland (hyperthyroidism). 2  Plan treatment for hyperthyroidism. 3  Plan treatment for patients who have had thyroid cancer surgery."}, {"url": "http://www.cigna.com/healthwellness/hw/medical-tests/radioactive-iodine-uptake-test-tw9880", "passage_text": "A radioactive iodine uptake (RAIU) test uses a radioactive tracer and a special probe to measure how much tracer the thyroid gland absorbs from the blood. The test can show how much tracer is absorbed by the thyroid gland."}, {"url": "http://www.cigna.com/healthwellness/hw/medical-tests/radioactive-iodine-uptake-test-tw9880", "passage_text": "A radioactive iodine uptake (RAIU) test is done in the nuclear medicine section of a hospital's radiology department by a person trained in nuclear medicine (nuclear medicine technologist). For this test, you will lie on your back with your head tipped backward and your neck extended."}, {"url": "http://www.auntminnie.com/index.aspx?sec=ser&sub=def&pag=dis&ItemID=55330", "passage_text": "Normal 24 hour RAIU is between 8 to 35%. Normal 4 hour RAIU is generally between 5 to 15%. % Uptake= [(net neck counts-net thigh counts)x 100] /(net standard counts) The RAIU test provides a useful assessment of thyroid function: in general, the higher the iodine uptake, the more active the gland."}]