[{"url": "http://health.syr.edu/education/stomach-bug.html", "passage_text": "The stomach “bug” is usually a sickness caused by a virus which spreads from person to person or through food contamination. Symptoms usually appear 1 to 2 days after exposure. Symptoms are often mild and usually only last a day or two. You may experience some of the following symptoms: 1  Upset Stomach. "}, {"url": "http://www.healthline.com/health/cold-flu/best-remedies-stomach-flu", "passage_text": "A virus causes stomach flu or gastroenteritis. The most common viruses are rotavirus or norovirus. Symptoms appear one to three days after exposure to the virus. You are contagious before you even begin to develop symptoms. Even after you’ve recovered from your symptoms, you can remain contagious for up to two weeks. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/viral-gastroenteritis/expert-answers/stomach-flu/faq-20057899", "passage_text": "1 Rotavirus. 2  Symptoms of rotavirus — the leading cause of viral gastroenteritis in infants and young children — usually appear one to three days after exposure. 3  But you're contagious even before you develop symptoms, and up to two weeks after you've recovered. 1 Some people may be contagious for up to two weeks after recovery. 2  Rotavirus. 3"}, {"url": "http://www.mayoclinic.org/diseases-conditions/viral-gastroenteritis/expert-answers/stomach-flu/faq-20057899", "passage_text": "You can be contagious from a few days up to two weeks or more, depending on which virus is causing your stomach flu (gastroenteritis). A number of viruses can cause gastroenteritis, including noroviruses and rotaviruses. 1 Some people may be contagious for up to two weeks after recovery. 2  Rotavirus. 3  Symptoms of rotavirus — the leading cause of viral gastroenteritis in infants and young children — usually appear one to three days after exposure."}, {"url": "http://www.howlongdoes.com/health/how-long-does-a-stomach-virus-last/", "passage_text": "The stomach virus lasts for 2-3 days; it takes about a week’s time for the inflammation and the swelling caused by the virus to completely heal. With the necessary medication and diet one must get proper rest and avoid any kind exertion or physical activity. How long does this virus last for? Just like any other virus and its incubation period this also lasts for about 2-3 days in the patient’s body. How long does this last for in an infant or child’s case? In an infant or child’s case it lasts for more than 3 days, mostly till a week."}, {"url": "https://answers.yahoo.com/question/index?qid=20080108183223AAPhtTf", "passage_text": "Best Answer: What are noroviruses? Noroviruses are a group of viruses that cause the “stomach flu,” or gastroenteritis (GAS-tro-en-ter-I-tis), in people. The term norovirus was recently approved as the official name for this group of viruses. RE: How long would the normal stomach flu take to develop in your system and start showing symptoms.? My mother was working with someone who had it and is afraid she got it but she hasn&#39;t shown any symptoms."}, {"url": "https://answers.yahoo.com/question/index?qid=20080108183223AAPhtTf", "passage_text": "What are the symptoms of illness caused by noroviruses? The symptoms of norovirus illness usually include nausea, vomiting, diarrhea, and some stomach cramping. Sometimes people additionally have a low-grade fever, chills, headache, muscle aches, and a general sense of tiredness. The illness often begins suddenly, and the infected person may feel very sick. RE: How long would the normal stomach flu take to develop in your system and start showing symptoms.? My mother was working with someone who had it and is afraid she got it but she hasn&#39;t shown any symptoms."}, {"url": "http://www.webmd.com/digestive-disorders/diarrhea-stomach-flu", "passage_text": "These viruses target the digestive tract and cause inflammation of the stomach and intestines. The most awful symptoms -- diarrhea, vomiting, and cramps -- are actually your body's defense mechanisms. Your body is trying to drive the virus out. Stomach flu can develop at any time of the year, but it's most common in the fall and winter in the U.S. Although unpleasant, stomach flu is rarely serious."}, {"url": "http://www.howlongdoes.com/health/how-long-does-a-stomach-virus-last/", "passage_text": "On average a stomach virus or flu takes about 2-3 days to recover from cause of its incubation period. Various viruses cause Viral Gastroenteritis. Of all the others being the cause of the virus, the two that play a major role and can be contagious are Norovirus and Rotavirus. How long does this virus last for? Just like any other virus and its incubation period this also lasts for about 2-3 days in the patient’s body. How long does this last for in an infant or child’s case? In an infant or child’s case it lasts for more than 3 days, mostly till a week."}]