[{"url": "http://www.healthline.com/human-body-maps/appendix", "passage_text": "Although the physiologic function of the appendix is not clearly established, it is thought to be a vestigial remnant (from a primitive version of the large intestine). Most researchers agree that it has a minor role in immune function. In Latin, the term vermiform means worm-shaped."}, {"url": "http://www.innerbody.com/image/dige03.html", "passage_text": "Extending from the inferior end of the large intestine’s cecum, the human appendix is a narrow pouch of tissue whose resemblance to a worm inspired its alternate name, vermiform (worm-like) appendix."}, {"url": "http://www.wisegeek.com/what-is-the-function-of-the-appendix.htm", "passage_text": "The function of the appendix, known more formally as the vermiform appendix, is a topic of debate in the medical community. Some clinicians and scientists believe that it is a vestigial organ, a remainder from a time when humans ate a diet high in cellulose and needed assistance with digestion."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_appendix", "passage_text": "Additional contributor opinions:The appendix is located at the lower right quadrant of the abdomen and it is connected to the cecum which is part of the large intestine. The cecum is a pouch at the beginning of the large intestine and not the end, the end is the anus."}, {"url": "http://www.globalhealingcenter.com/natural-health/what-does-the-appendix-do/", "passage_text": "The appendix is a tube-shaped sac that’s attached to the large intestine. It exists in humans and a small number of other mammals, including the koala and apes. In medical terms, it’s referred to as ‘vermiform appendix’ for its thin, worm-like shape."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_appendix", "passage_text": "The function of the appendix was for the longest time unknown. However, it has recently been discovered that the appendix is a store-house for bacteria that assist in the dige … stive processes of the colon."}, {"url": "http://www.news-medical.net/news/2007/10/08/30907.aspx", "passage_text": "The cecum is a pouch-like structure of the colon and the appendix is near the junction of the small intestine and the large intestine and has abundant infection-fighting lymphoid cells, which suggests it plays a role in the immune system."}, {"url": "http://www.webmd.com/digestive-disorders/picture-of-the-appendix", "passage_text": "Front View of the Appendix. The appendix sits at the junction of the small intestine and large intestine. It’s a thin tube about four inches long. Normally, the appendix sits in the lower right abdomen. The function of the appendix is unknown. One theory is that the appendix acts as a storehouse for good bacteria, “rebooting” the digestive system after diarrheal illnesses. Other experts believe the appendix is just a useless remnant from our evolutionary past."}]