[{"url": "http://www.knowbotswana.com/botswana.html", "passage_text": "History of Botswana-how Botswana came to being.... Botswana adopted her name when she became an independent state on 30th September 1966. This is after she had made proposals in 1964 to be independent. The country had previously been called Bechuanaland as a British protectorate."}, {"url": "http://www.audioenglish.org/dictionary/botswana.htm", "passage_text": "• BOTSWANA (noun). The noun BOTSWANA has 1 sense: 1. a landlocked republic in south-central Africa that became independent from British control in the 1960s. Familiarity information: BOTSWANA used as a noun is very rare."}, {"url": "http://www.definitions.net/definition/Botswana", "passage_text": "Botswana. Botswana, officially the Republic of Botswana, is a landlocked country located in Southern Africa. The citizens refer to themselves as Batswana. Formerly the British protectorate of Bechuanaland, Botswana adopted its new name after becoming independent within the Commonwealth on 30 September 1966."}, {"url": "https://en.wikipedia.org/wiki/Botswana_Pula", "passage_text": "Pula literally means rain in Setswana, because rain is very scarce in Botswana — home to much of the Kalahari Desert — and therefore valuable and a blessing. The sub-unit, thebe, means shield, representing defence. The names were picked with the help of the public."}, {"url": "http://www.babynamewizard.com/baby-name/boy/kabelo", "passage_text": "It is most common among the Setswana and Sepedi speaking people but there are a lot of Basotho who give their children that name as well. This means that you can find people with this name in Lesotho, Botswana and South Africa. Its root word aba literally means to share."}, {"url": "http://files.peacecorps.gov/multimedia/audio/languagelessons/botswana/Bw_Setswana_Language_Lessons.pdf", "passage_text": "Peace Corps/ Botswana An Introduction to the Setswana Language Setswana is one of the Bantu language groups, mostly spoken in Botswana, South Africa and Namibia (Southern Africa). The following lessons have been designed to suit any new learner in Setswana who has had little or no exposure to Setswana language."}, {"url": "http://www.behindthename.com/names/usage/southern-african", "passage_text": "Southern African names include those from Botswana, Lesotho, Malawi, Namibia, South Africa, Swaziland, Zambia, and Zimbabwe. See also about African names."}, {"url": "http://www.knowbotswana.com/botswana.html", "passage_text": "Click here to share your comments on Botswana. 'Botswana' means a place for Batswana. The main meaning of Botswana refers to all citizens of the country without exclusion-referred to as Batswana. Batswana are democratic people who look beyond ethnic, cultural and identity differences for the stability of their country."}]