[{"url": "http://www.answers.com/Q/What_does_the_Declaration_of_Independence_mean", "passage_text": "The United States Declaration of Independence is a very important thing in the history of the United States of America. It is a paper which said that the United States is a country not ruled by Great Britain. American people wrote the Declaration in the year 1776."}, {"url": "http://www.answers.com/Q/What_does_the_Declaration_of_Independence_mean", "passage_text": "The people of America like the Declaration of Independence a lot. Every year on the day of July 4, they have a party. They do this to remember the day that Thomas Jefferson wrote the Declaration, and the day that the United States of America became a country."}, {"url": "http://www.sparknotes.com/history/american/declaration/section4.rhtml", "passage_text": "The Second Continental Congress represents the people of the new nation called the United States of America. This declaration informs all the people of the world that the 13 united colonies are free from British rule and any political connections with Great Britain."}, {"url": "http://www.answers.com/Q/What_does_the_Declaration_of_Independence_mean", "passage_text": "Jefferson, who did most of the writing, was a very smart man. The words he wrote in the Declaration of Independence are very famous and important to the people of the United States of America. His words are important because he explained the democracy"}, {"url": "http://www.yourdictionary.com/declaration-of-independence", "passage_text": "The Declaration of Independence is defined as the formal statement written by Thomas Jefferson declaring the freedom of the thirteen American colonies from Great Britain. An example of the Declaration of Independence was the document adopted at the Second Continental Congress on July 4th, 1776."}, {"url": "http://legal-dictionary.thefreedictionary.com/Declaration+of+Independence", "passage_text": "The Declaration of Independence was signed July 4, 1776. This work, assembled by John Binns in 1819, surrounds a facsimile of the document's text with portraits of George Washington, John Hancock, and Thomas Jefferson, along with the seals of the 13 original states."}, {"url": "http://www.heritage.org/initiatives/first-principles/primary-sources/the-declaration-of-independence", "passage_text": "More. The Declaration of Independence is the founding document of the American political tradition. It articulates the fundamental ideas that form the American nation: All men are created free and equal and possess the same inherent, natural rights."}]