[{"url": "http://www.ausetute.com.au/haberpro.html", "passage_text": "This process produces an ammonia, NH. The Haber synthesis was developed into an industrial process by Carl Bosch. The reaction between nitrogen gas and hydrogen gas to produce ammonia gas is an exothermic equilibrium reaction, releasing 92.4kJ/mol of energy at 298K (25 o C). In 1909 Fritz Haber established the conditions under which nitrogen, N. 1  medium temperature (~500 o C). 2  very high pressure (~250 atmospheres, ~25,500kPa). 3  a catalyst (a porous iron catalyst prepared by reducing magnetite, Fe 3 O 4)."}, {"url": "http://www.princeton.edu/~hos/mike/texts/readmach/zmaczynski.htm", "passage_text": "Raymond Zmaczynski (email). Chicago, IL. The Haber Process for the synthesis of ammonia (NH3) gas from its elements nitrogen (N2) and hydrogen (H2) is discussed in almost every high school chemistry text as an excellent example of chemical equilibrium. "}, {"url": "http://www.chm.bris.ac.uk/~paulmay/haber/haber.htm", "passage_text": "But during this period, the chemistry of ammonia synthesis was being explored by the German chemists Fritz Haber and Walther Bosch who found that it was possible to produce ammonia from nitrogen and hydrogen by the process: N 2 + 3 H 2 2 NH 3. The Haber-Bosch process operates at high pressure so as to shift the equilibrium to the right, and high temperature to increase the rates of the reaction."}, {"url": "http://chemguide.co.uk/physical/equilibria/haber.html", "passage_text": "A brief summary of the Haber Process. The Haber Process combines nitrogen from the air with hydrogen derived mainly from natural gas (methane) into ammonia. The reaction is reversible and the production of ammonia is exothermic. A flow scheme for the Haber Process looks like this: Some notes on the conditions The catalyst The catalyst is actually slightly more complicated than pure iron. THE HABER PROCESS This page describes the Haber Process for the manufacture of ammonia from nitrogen and hydrogen, and then goes on to explain the reasons for the conditions used in the process."}, {"url": "http://www.docbrown.info/page04/4_74revNH3c.htm", "passage_text": "The industrial manufacture of ammonia is described in terms of the reaction conditions employed in the Haber Synthesis of ammonia from hydrogen and nitrogen e.g. temperature, pressure, iron catalyst, recycling unreacted gases, condensing out of ammonia. I ndex: A Reversible Reactions * B Reversible reactions and Equilibrium * C The Haber Synthesis of ammonia * D(a) The Uses of ammonia-nitric acid-fertilisers * D(b) Fertilisers-environmental problems * E The nitrogen cycle. Foundation tier (easier) multiple choice QUIZ on ammonia, nitric acid and fertilisers etc."}, {"url": "https://en.wikipedia.org/wiki/Haber_process", "passage_text": "The Haber process, also called the Haber–Bosch process, is an artificial nitrogen fixation process and is the main industrial procedure for the production of ammonia today. It is named after its inventors, the German chemists Fritz Haber and Carl Bosch, who developed it in the first half of the twentieth century. Two opposing considerations are relevant to this synthesis: the position of the equilibrium and the rate of reaction. At room temperature, the equilibrium is strongly in favor of ammonia, but the reaction doesn't proceed at a detectable rate."}, {"url": "http://chemistry.about.com/od/chemicalreactions/fl/Haber-Bosch-Process.htm", "passage_text": "How the Haber-Bosch Process Works. Haber's original process made ammonia from air. The industrial Haber-Bosch process mixes nitrogen gas and hydrogen gas in a pressure vessel that contains a special catalyst to speed the reaction. "}, {"url": "http://mohini.nema.tripod.com/id1.html", "passage_text": "Commercial Production of Ammonia. Ammonia Production with the Haber-Bosch Process. This reaction happens in a special high pressure reactor in the presence of a special catalyst, usually a porous iron oxide. The reaction is exothermic which means that energy is released. "}, {"url": "http://www.chemistryattweed.com/uploads/1/1/2/3/11235810/haber_process_for_the_production_of_ammonia_1.pdf", "passage_text": "Osmium is a much better catalyst for the reaction but is very expensive. This process produces an ammonia, NH 3 (g), yield of approximately 10-20%. The Haber synthesis was developed into an industrial process by Carl Bosch. The reaction between nitrogen gas and hydrogen gas to produce ammonia gas is exothermic, releasing 92.4kJ/mol of energy at 298K (25 o C). The hydrogen for the ammonia synthesis was made by the water-gas process (a Carl Bosch invention) which involves blowing steam through a bed of red hot coke resulting in the separation of hydrogen from oxygen. The nitrogen was obtained by distillation of liquid air, then by cooling and compressing air."}]