[{"url": "https://www.sharecare.com/health/kids-teens-health/accurate-place-take-childs-temperature", "passage_text": "The most accurate place to take a child's temperature is in the rectum. A rectal temperature reflects the body's core temperature. An oral temperature is the second most accurate. Other areas for measuring temperature such as the axillia, ear and forehead/skin are less accurate because they are obtained outside of body cavities. It is also important to consider the age and condition of the child when choosing the place to measure body temperature"}, {"url": "http://saidsupport.org/what-is-the-most-accurate-way-to-take-a-temperature-is-oral-temporal-ear-or-rectal-best/", "passage_text": "A rectal temperature is generally considered to be the most accurate, and the standard for monitoring the core body temperature, but it is generally not recommended for use in patients, due to the risk of rectal perforation and tears with this method. Have a separate thermometer to use for oral than for rectal. Also, if you get a high or low reading, re-take the temperature! It may be correct, but it is best to confirm the temperature if it is unusual, and the doctor will ask you if you did take it again, as sometimes there are errors with thermometers, or technique in taking the temperature."}, {"url": "http://saidsupport.org/what-is-the-most-accurate-way-to-take-a-temperature-is-oral-temporal-ear-or-rectal-best/", "passage_text": "Axillary, where you measure the temperature under the armpit, can be less reliable for getting an accurate body temperature, and can register up to a degree lower than rectal or other methods of taking the internal temperature. But it is still considered acceptable if done correctly and is used in many hospitals. Also, if you get a high or low reading, re-take the temperature! It may be correct, but it is best to confirm the temperature if it is unusual, and the doctor will ask you if you did take it again, as sometimes there are errors with thermometers, or technique in taking the"}, {"url": "https://www.sharecare.com/health/health-screening-wellness/best-way-measure-body-temperature", "passage_text": "Thus an oral temperature, measured with a thermometer placed under the tongue, is the most convenient and comfortable type of temperature measurement for adults. A normal oral temperature is 98.6°F or 37.0 °C. This is the accepted standard temperature for the normal body temperature. External measure of the body’s temperature such as axillary, tympanic membrane or skin temperatures are the least accurate and may take hours to reflect true changes in the body’s core temperature. A r ectal temperatures is an internal measurement taken in the rectum, and is slightly higher at 99.6 °F or 37.6 °C. This is the best and most accurate measure of the body’s temperature. A rectal temperature can be taken on individuals of all ages, but it may be uncomfortable."}, {"url": "http://www.healthlinkbc.ca/medicaltests/content.asp?hwid=hw198785", "passage_text": "Oral (by mouth) is the most common method of taking a temperature. For you to get an accurate reading, the person must be able to breathe through his or her nose. If this is not possible, use the rectum, ear, or armpit to take the temperature. 1  Place the thermometer under the tongue, just to one side of the centre. A fever may occur as a reaction to: 1  Infection. 2  This is the most common cause of a fever. 3  Infections may affect the whole body or one body part. 4  Medicines. 5  These include antibiotics, narcotics, antihistamines, and many others. 6  This is called a drug fever.. 7  Medicines like antibiotics raise the body temperature directly."}, {"url": "http://www.ehow.com/about_5101009_normal-temperature-under-arm.html", "passage_text": "Temperature taken under the arm usually is considered to be less accurate than most other body locations for measuring temperature. This measurement, also known as axillary temperature, tends to be about half a degree to a degree below oral temperature. Ear temperature (or tympanic temperature) also is very accurate in children and adults. 99.5 degrees Fahrenheit (37.5 degrees Celsius) is the normal temperature for this method. Measuring body temperature orally is perhaps the most traditional means of measurement."}, {"url": "http://www.answers.com/Q/What_is_the_most_accurate_place_to_obtain_body_temperature", "passage_text": "Also, this method does have a slight chance for injury to the rectum or of losing the thermometer into the rectum. Next best is oral temperature. To take an oral temperature, which is almost as reliable when done correctly, make sure the person has not had anything to eat or drink within the last 10 minutes. Have the person hold their arm firmly against their body for one minute, (or until thermometer beeps). *Add* one degree to an axillary temperature to make it accurate. Note: this is not very accurate in people who are extremely thin, or who have had their arms in the air for a period of time."}, {"url": "http://www.emedicinehealth.com/script/main/art.asp?articlekey=128929", "passage_text": "Oral is the most common method of taking a temperature. To get an accurate temperature, the person must be able to breathe through the nose. If this is impossible because of a stuffy nose or lack of cooperation, use the rectum, ear, or armpit to take the temperature. A fever may occur as a reaction to: 1  Infection. 2  This is the most common cause of a fever. 3  Infections may affect the whole body or a specific body part (localized infection). 4  Medicines, such as antibiotics, narcotics, barbiturates, antihistamines, and many others. 5  These are called drug fevers."}, {"url": "http://www.answers.com/Q/What_is_the_most_accurate_place_to_obtain_body_temperature", "passage_text": "The third way of taking the temperature, is under the arm. (Called an axillary temperature.) Make sure the reading part of the thermometer is centered in the middle of the arm pit. Have the person hold their arm firmly against their body for one minute, (or until thermometer beeps). *Add* one degree to an axillary temperature to make it accurate. Note: this is not very accurate in people who are extremely thin, or who have had their arms in the air for a period of time. Nor is it accurate to obtain a temperature on someone who has hypothermia"}, {"url": "http://www.cigna.com/healthwellness/hw/medical-tests/body-temperature-hw198785", "passage_text": "Oral (by mouth) is the most common method of taking a temperature. For you to get an accurate reading, the person must be able to breathe through his or her nose. If this is not possible, use the rectum, ear, or armpit to take the temperature. 1  Place the thermometer under the tongue, just to one side of the center. "}]