[{"url": "http://work.chron.com/college-courses-needed-become-electrical-engineer-8661.html", "passage_text": "Degree Requirements. The BLS states the minimum education for an electrical engineer is a bachelor’s degree. A bachelor’s degree program in electrical engineering requires a four-year commitment. Some cooperative programs are available that allow students to earn credit for work experience in the field. "}, {"url": "http://www.studentscholarships.org/careers_salary/143/education/electrical_and_electronics_engineers.php", "passage_text": "1. You need a university degree in electrical or electronics engineering or in a related field of engineering. 2. You may also need a master's degree or doctorate in a related engineering field. 3. You need a licence from a provincial/territorial association of professional engineers to approve engineering drawings/reports and to practise as a professional engineer (P. Eng.)"}, {"url": "http://learn.org/articles/What_are_the_Requirements_for_Becoming_an_Engineer_in_the_US.html", "passage_text": "Engineers in the United States need a bachelor's degree in engineering. Engineers who work with the public are also required to become licensed. Licensure requirements include completing an accredited program and passing a series of exams. Job Requirements. The requirements to become an engineer typically include a bachelor's degree in an engineering discipline, though a master's degree may be needed for advancement in some fields."}, {"url": "http://work.chron.com/degree-need-electrical-engineer-10712.html", "passage_text": "Bachelor's Degree. To get an entry-level job in the industry, you need a bachelor’s degree in electrical engineering from a program accredited by ABET. Electrical engineering majors study in the classroom, laboratory and the field. In college, electrical engineering students take courses in engineering math, electronic circuits, electromagnetic fields and waves and digital signal processing, as well as written communications."}, {"url": "http://www.answers.com/Q/What_education_and_training_is_required_to_become_an_engineer", "passage_text": "Engineering is a 4 year college degree. You would take lots of math and science courses before you get into the core engineering courses. Chemical engineers often minor in chemistry, electrical engineers in computer science, mechanical and aeronautical engineers take a lot of physics and so on. All use math extensively. "}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/electricalengineer.aspx", "passage_text": "To become an electrical engineer, you would normally need to complete a foundation degree, HNC, HND or degree in electrical or electronic engineering or related subject, for example building services engineering. "}, {"url": "http://classroom.synonym.com/education-training-requirements-electrical-engineer-2511.html", "passage_text": "Degrees. Education requirements for electrical engineers differ depending on the level of position being sought as well as the employer. However, electrical engineers usually need a four-year bachelor's degree in this field through a college or university. Median annual wages for electrical engineers in May 2008 were $82,160, according to the U.S. Department of Labor Bureau of Labor Statistics. Electrical engineers must meet several education requirements to succeed in this field."}, {"url": "http://classroom.synonym.com/education-training-requirements-electrical-engineer-2511.html", "passage_text": "Classes. Courses in an electrical engineering training program might include computer programming, engineering economy, electrical circuits, thermodynamics, numerical analysis and engineering materials. Median annual wages for electrical engineers in May 2008 were $82,160, according to the U.S. Department of Labor Bureau of Labor Statistics. Electrical engineers must meet several education requirements to succeed in this field."}, {"url": "http://www.learnhowtobecome.org/electrical-engineer/", "passage_text": "Becoming an electrical engineer requires training, commitment, and the willingness to wonder about questions such as how a flat screen television manages to be energy efficient or how a Las Vegas casino manages to use so much electricity without blowing a fuse. Most electrical engineers must have a bachelor’s degree or even a master’s degree in electrical engineering from a university accredited by the Accreditation Board for Engineering and Technology (ABET)."}]