[{"url": "https://au.answers.yahoo.com/question/index?qid=20120319163732AAaGJWX", "passage_text": "Best Answer: One stick of butter weighs 4 ounces and contains 8 tablespoons. Therefore, one tablespoon of butter weigh 1/2 (.5 oz.) oz. This varies depending on the type of butter, different butters have varying amounts of water, milk solids and butter fats which can alter the overall weight. But one stick of butter of 4oz. There's two tablespoons in one ounce, so one tablespoon would be half of an ounce."}, {"url": "https://answers.yahoo.com/question/index?qid=20140710132928AAP9JL1", "passage_text": "Report Abuse. Butter is just about an ounce (by weight) per ounce (by volume) and it is two tablespoons per ounce so 2 1/2 ounces. I can never figure out why some people convert to metric then back to imperial when trying to convert from one imperial measurement to another. A tablespoon is officially 14grams . "}, {"url": "http://www.answers.com/Q/How_much_does_a_tablespoon_of_butter_weigh", "passage_text": "How much is 12 tablespoon of butter? 12 tablespoons of butter is equal to 3/4 of a cup of butter. 1 US cup = 16 US tablespoons. 3 tablespoons of butter is the same. 2 people found this useful. Edit. Share to: 1  Butter Substitute Tips for Cooking When you're trying to cook healthier for yourself to promote weight loss, you start to look at the ingredients you use on a regular basis."}, {"url": "http://ths.gardenweb.com/discussions/2512846/how-much-does-a-stick-of-butter-weigh", "passage_text": "A stick of butter is half a cup or 8 tablespoons. When I used to buy whole lbs to bake with at the holiday time I'd just cut the whole block in four to make it easier. Like Bookmark December 14, 2008 at 3:44PM. Thank you for reporting this comment. "}, {"url": "http://www.answers.com/Q/How_much_does_a_tablespoon_of_butter_weigh", "passage_text": "A tablespoon of butter weighs about 14 grams or 1/2 oz. 3 tablespoons of butter is the same. 2 people found this useful. Edit. Share to: 1  Butter Substitute Tips for Cooking When you're trying to cook healthier for yourself to promote weight loss, you start to look at the ingredients you use on a regular basis."}, {"url": "http://www.answers.com/Q/How_much_does_a_tablespoon_of_butter_weigh", "passage_text": "4 tablespoons of butter is about 2 ounces of butter. 3 tablespoons of butter is the same. 2 people found this useful. Edit. Share to: 1  Butter Substitute Tips for Cooking When you're trying to cook healthier for yourself to promote weight loss, you start to look at the ingredients you use on a regular basis."}, {"url": "http://www.traditionaloven.com/culinary-arts/cooking/butter/convert-table-spoon-tbsp-to-gram-g.html", "passage_text": "One tablespoon of butter converted to gram equals to 14.18 g. How many grams of butter are in 1 tablespoon? The answer is: The change of 1 tbsp (tablespoon) unit in a butter measure equals = into 14.18 g (gram) as per the equivalent measure and for the same butter type. Find in: main menu • butter menu • Tablespoons. Work out grams in butter per 1 tablespoon unit. The butter converter for cooks, chefs, culinary arts classes, students and for home kitchen use."}, {"url": "http://ochef.com/1460.htm", "passage_text": "What is the weight or measurement of one pat of butter? Nowadays individual servings of butter come wrapped in foil, in what are essentially half-tablespoon size rectangles (or 1-1/2 teaspoon, whichever way you want to look at it). Or it comes in little plastic cups with little foil covers, in 1 and 2 teaspoon sizes. Perhaps pats of butter are still available here and there, but we haven't seen one in at least ten years. We believe that there were 48 pats to the pound, meaning that nothing has really changed – a pat was 1/2 tablespoon, 1-1/2 teaspoons, 1/3 of an ounce, or 9 grams."}, {"url": "http://ochef.com/837.htm", "passage_text": "In one recipe they ask for a half-cup of butter. In the next, they ask for 8 tablespoons. Then they turn around and demand one stick of butter. And the whole time, they're asking for the same thing! In this country, butter is mostly packaged in 1-pound boxes, with four individually wrapped quarters or sticks. Each pound is two cups of butter. Each quarter-pound stick is 8 tablespoons or a half a cup. Each tablespoon is 1/2 ounce. (So to answer your question, a half pound of butter is one cup.) To thwart the wicked aims of those recipe writers once and for all, we present the following fool-proof."}, {"url": "http://www.browneyedbaker.com/wp-content/uploads/2010/09/ButterChart.pdf", "passage_text": "(1⁄4 pound) 113g3⁄4 cup11⁄2 sticks12 tablespoons 6 oz. 170g1 cup 2 sticks 16 tablespoons 8 oz. (1⁄2 pound) 227g11⁄4 cups21⁄2 sticks20 tablespoons 10 oz. 284g11⁄2 cups3 sticks 24 tablespoons 12 oz. (3⁄4 pound) 341g13⁄4 cups31⁄2 sticks28 tablespoons 14 oz. 398g2 cups 4 sticks 32 tablespoons 16 oz."}]