[{"url": "http://support.bell.ca/Mobility/Smartphones_and_mobile_internet/Samsung-Galaxy-S4.how_to_sync_microsoft_outlook_contacts_with_my", "passage_text": "On the computer, launch Microsoft Outlook. If you have contacts stored in Microsoft® Outlook®, you can export them to a CSV file and then import them into a Gmail™ account. You can then sync your Samsung Galaxy S4 with your Gmail contacts. In this example, we've used Microsoft Outlook 2010. 18"}, {"url": "https://discussions.apple.com/thread/5523526?start=0&tstart=0", "passage_text": "To sync contacts with your computer, choose Sync Contacts with within iTunes for Windows, or Sync Contacts in OS X v10.8, or Sync Address Book Contacts in OS X v10.7 and earlier. Notes: 1  When syncing contacts, you can choose to sync all of your contacts or only selected groups. 2  You can select a group of contacts to which all new contacts created on your iOS device will be added. 3  Additional options for syncing include syncing your contacts with Yahoo or Gmail/Google Mail."}, {"url": "https://support.google.com/a/users/answer/138636?hl=en", "passage_text": "You can also send mail from your Windows mobile device using a custom From address. 1  In a web browser, add another email address that you own. 2  On your device, go to m.google.com/sync/settings. 3  Select your device and check the Enable Send Mail As for this device box. These instructions are for devices running Windows ® Phone 7 and 8. 1  Swipe left on the Start screen to open the Apps list. 2  Touch Settings Email + accounts Add an account Advanced setup. 3  Enter your Google Account email address and application-specific password. 4  Touch Next."}, {"url": "https://discussions.apple.com/thread/5523526?start=0&tstart=0", "passage_text": "Contacts, Calendars, Bookmarks, and Notes You can sync contacts, calendars, bookmarks, and notes with other applications on your computer. This allows you to keep all your information in sync across multiple computers and iOS devices. The settings for these items are all in the Info tab for your iOS device in iTunes. Notes: 1  When syncing contacts, you can choose to sync all of your contacts or only selected groups. 2  You can select a group of contacts to which all new contacts created on your iOS device will be added. 3  Additional options for syncing include syncing your contacts with Yahoo or Gmail/Google Mail."}, {"url": "https://support.microsoft.com/en-us/kb/2844991", "passage_text": "1 Tap or click Import contacts. 2  Select the Microsoft Outlook (using CSV) option. 3  On your phone, swipe left and tap Settings Collapse this image Expand this image, tap Email+accounts, then tap-and-hold Microsoft account (or Windows Live) and tap sync. 4  This may take a few moments. 1 Tap Email+accounts. 2  Tap Add an account, and then tap Outlook. 3  Enter your email address and password information, and then tap Sign in. 4  Your Outlook contacts should automatically sync to your phone."}, {"url": "https://support.microsoft.com/en-us/kb/2459660", "passage_text": "1 Tap or click Import contacts. 2  Select the Microsoft Outlook (using CSV) option. 3  On your phone, swipe left and tap Settings Collapse this image Expand this image, tap Email+accounts, then tap-and-hold Microsoft account (or Windows Live) and tap sync. 4  This may take a few moments. Note You cannot use a USB cable to sync your calendar from Outlook on your computer to your Windows Phone. To sync your calendars, transfer them to a Microsoft account (such as Hotmail or Outlook.com), and then sync your calendars from your Microsoft account to your phone."}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows_7-files/where-is-my-address-book-or-contacts-list-and-how/7671521d-de82-e011-9b4b-68b599b31bf5", "passage_text": "In Windows 7, open Windows Explorer and navigate to the C:\\Users\\your name\\Contacts folder. On the Toolbar, click the Import button. In the Import dialog, select the Windows Address Book (Outlook Express contacts) option. Click the Import button and navigate to where you saved the .WAB file. Select that file and click Open. This will place all of the email addresses into the Contacts folder."}, {"url": "http://support.bell.ca/Mobility/Smartphones_and_mobile_internet/Samsung-Galaxy-S4.how_to_sync_microsoft_outlook_contacts_with_my", "passage_text": "On the phone, touch Apps. If you have contacts stored in Microsoft® Outlook®, you can export them to a CSV file and then import them into a Gmail™ account. You can then sync your Samsung Galaxy S4 with your Gmail contacts. In this example, we've used Microsoft Outlook 2010. 18"}, {"url": "http://support.bell.ca/Mobility/Smartphones_and_mobile_internet/Samsung-Galaxy-S4.how_to_sync_microsoft_outlook_contacts_with_my", "passage_text": "Click Contacts. If you have contacts stored in Microsoft® Outlook®, you can export them to a CSV file and then import them into a Gmail™ account. You can then sync your Samsung Galaxy S4 with your Gmail contacts. In this example, we've used Microsoft Outlook 2010. 18"}]