[{"url": "http://exhibits.museum.state.il.us/exhibits/larson/canis.html", "passage_text": "Wolves, Coyotes, and Dogs (Genus Canis). Drawing of dire wolf (Canis dirus) by Robert Larson. The genus Canis includes wolves, coyotes, jackals, and the domestic dogs. In the midwestern U.S. at least three members of the genus are found in sites that date from the last Ice Age. These three members are the dire wolf (Canis dirus), the gray wolf (Canis lupus) and the coyote (Canis latrans)."}, {"url": "https://en.wikipedia.org/wiki/Canis", "passage_text": "C. lupus is but one of many Canis species called wolves, most of which are now extinct and little known to the general public. Wolves, dogs, and dingoes are subspecies of Canis lupus. The original referent of the English word wolf, the Eurasian wolf, is called C. l. lupus to distinguish it from other wolf subspecies, such as the Indian wolf (C. l. pallipes), the Arabian wolf (C. l. arabs), or the Tibetan wolf (C. l. chanco)."}, {"url": "http://www.conservenature.org/learn_about_wildlife/prairie/coyote.htm", "passage_text": "photo M. Noonan. Coyote Taxonomy/Description. The coyote belongs to the dog family, Canidae, in the Mammalian Order of Carnivora. Other members of Canidae include foxes, wolves, jackals, and all breeds of domesticated dog. The coyote's scientific name is Canis latrans, which means barking dog. "}, {"url": "http://www.wolf.org/wolf-info/basic-wolf-info/types-of-wolves/", "passage_text": "Coyotes, however, are not wolves. Coyotes and wolves are in the same family (Canidae) and genus (Canis) , but are separate species, just as foxes and wolves are separate species. Like wolves, coyotes have been persecuted because of their predatory nature."}, {"url": "https://en.wikipedia.org/wiki/Canis", "passage_text": "Canis is a genus containing seven to 10 extant species, including the domestic dog, wolves, coyotes, and jackals, and many extinct species. Wolves, dogs, and dingoes are subspecies of Canis lupus. The original referent of the English word wolf, the Eurasian wolf, is called C. l. lupus to distinguish it from other wolf subspecies, such as the Indian wolf (C. l. pallipes), the Arabian wolf (C. l. arabs), or the Tibetan wolf (C. l. chanco)."}, {"url": "http://www.answers.com/Q/Which_species_does_the_Coyote_belong_to", "passage_text": "Mules cannot belong to a species of their own because they are  sterile hybrids, but they do belong to both of the species that  horses and donkeys belong to. These species … are Equus caballus and  Equus asinus. Gd Here. 41,285 Contributions. I don't think the coyotes of the American southwest are endangered. The intelligent, adaptable coyote is far from endangered. In fact, they have spread over much of the countr … y now, and are a nuisance in many areas."}, {"url": "http://www.coyotesmarts.org/coyotes101/", "passage_text": "One of these subspecies is the eastern coyote (Canis latrans thamnos) found in New England and other parts of the Northeast, along with southeastern Canada. Our coyotes are descendants of Great Plains coyotes that expanded their range to the north and east as forests were cut and wolves were extirpated. Meet Canis Latrans. The coyote (scientific name: Canis latrans or “barking dog”) is one of the world’s most adaptable animals. The coyote is a native species that has increased its range as a result of human alteration of the landscape and human intolerance of wolves, the coyote’s natural enemy."}, {"url": "https://en.wikipedia.org/wiki/Coyote", "passage_text": "The ancestors of the coyote diverged from those of the gray wolf, 1–2 million years ago, with the modern species arising in North America during the Middle Pleistocene. Prey species include bison, deer, sheep, rabbits, rodents, birds, amphibians (except toads), lizards, snakes, fish, crustaceans, and insects. Coyotes may be picky over the prey they target, as animals such as shrews, moles and brown rats do not occur in their diet in proportion to their numbers."}]