[{"url": "http://www.salarylist.com/jobs/Rehabilitation-Director-Salary.htm", "passage_text": "Rehabilitation Director Salary. Rehabilitation Director average salary is $58,230, median salary is $58,000 with a salary range from $41,500 to $89,440. Rehabilitation Director salaries are collected from government agencies and companies. Each salary is associated with a real job position. "}, {"url": "http://www.payscale.com/research/US/Job=Rehabilitation_Director/Salary", "passage_text": "On average, a Regional Rehabilitation Director earns $104K annually. Many Rehabilitation Directors go on to become Rehabilitation Services Directors or Licensed Registered Occupational Therapists despite the fact that median compensation in those roles is reportedly $6K lower and $19K lower, respectively. Popular Employer Salaries for. Although RehabCare offers the highest salaries (median pay is $93K), survey participants reported a rather limited pay range of $72K to $109K. Offering only $82K on average, Reliant Rehabilitation seems to pay the least."}, {"url": "http://www1.salary.com/Rehabilitation-Director-salary.html", "passage_text": "For example the median expected annual pay for a typical Rehabilitation Director in the United States is $119,138 so 50% of the people who perform the job of Rehabilitation Director in the United States are expected to make less than $119,138. Source: HR Reported data as of October 2015. Median $119,138. Directs the programs and staff of the rehabilitation services department. Sets and implements guidelines for rehabilitation programs such a physical therapy, occupational therapy, and speech therapy. May require an advanced degree and professional certification with at least 7 years of direct experience in the field."}, {"url": "http://www.simplyhired.com/salaries-k-director-of-rehabilitation-jobs.html", "passage_text": "Average Director Of Rehabilitation Salaries. The average salary for director of rehabilitation jobs is $59,000. Average director of rehabilitation salaries can vary greatly due to company, location, industry, experience and benefits. The average salary for director of rehabilitation jobs is $59,000"}, {"url": "http://www.payscale.com/research/US/Job=Rehabilitation_Director/Salary", "passage_text": "Rehabilitation Director Salary. (United States). Rehabilitation Directors earn around $90K annually on average in the United States, but employers pay the most in New York, offering approximately $109K at the median. Popular Employer Salaries for. Although RehabCare offers the highest salaries (median pay is $93K), survey participants reported a rather limited pay range of $72K to $109K. Offering only $82K on average, Reliant Rehabilitation seems to pay the least."}, {"url": "http://www.indeed.com/salary/q-Director-Rehab-l-Houston,-TX.html", "passage_text": "$98,000. Average Director Rehab salaries for job postings in Houston, TX are 13% higher than average Director Rehab salaries for job postings nationwide."}, {"url": "http://salarybystate.org/healthcare/rehabilitation-director-salary-by-state", "passage_text": "Bureau of Labor Statistics information for a Rehabilitation Director is only general and not specific to this career by looking at the category of Medical & Health Services Managers. The median 2010 pay for a Rehab Director was around $84,720 a year which is about $40.52 an hour. This career requires at least a Bachelors Degree and typically much higher. The total number of jobs available in 2010 was around 303,000 jobs with a 22% growth expected from 2010 – 2020"}, {"url": "http://www.simplyhired.com/salaries-k-drug-rehab-jobs.html", "passage_text": "Average Drug Rehab Salaries. The average salary for drug rehab jobs is $65,000. Average drug rehab salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term drug rehab anywhere in the job listing."}, {"url": "http://www.indeed.com/salary/Director-of-Rehabilitation.html", "passage_text": "$70,000. Average Director of Rehabilitation salaries for job postings nationwide are 21% higher than average salaries for all job postings nationwide."}]