[{"url": "http://parade.com/48421/sallyjenkins/29-does-football-cost-too-much/", "passage_text": "The Dallas Cowboys in their new $1.15 billion home. I’m in Arlington, Tex., standing outside the NFL’s newest stadium, the state-of-the-art home of the Dallas Cowboys. With its $1.15 billion price tag, Cowboys Stadium represents the best and worst of today’s NFL experience. But in order to enjoy it, fans need to dig deep into their wallets–make that bank accounts. While the average cost of attending an NFL game for a family of four is $412.64, it’s a staggering $758.58 to watch the Cowboys. (That figure includes tickets and drinks for four people, as well as a couple of caps.)"}, {"url": "http://www.answers.com/Q/What_is_the_price_of_an_NFL_football", "passage_text": "Confidence votes 52. The average cost of a new unused official leather NFL game ball made by Wilson, all official NFL footballs are made by Wilson, is $80 - $90usd. "}, {"url": "http://www.businessinsider.com/how-much-did-nfl-owners-paid-for-their-teams-2010-10", "passage_text": "With the value of a typical NFL franchise hovering around $1 billion, it's easy to see how owning a football team is considered a solid — if expensive — investment. That wasn't always the case. There was a time when the cost of ownership was less than the price of a new car today. "}, {"url": "http://work.chron.com/much-money-nfl-player-make-year-2377.html", "passage_text": "Average Salaries. The average salary of an NFL player works out to considerably less when not considering the top earners, but these players still make hundreds of thousands of dollars each. Bloomberg Businessweek says the average salary of an NFL player in 2011 was $1.9 million. The median salary was $770,000. "}, {"url": "http://www.carolinahuddle.com/boards/topic/65349-cost-to-give-nfl-football-to-a-fan/", "passage_text": "Normally it's five grand I think. Word is the panthers have ben paying the bills this season and encouraging the players to do it. I was going to post $5000. It's the cost of The Duke F1 100 (Wilson the Duke football ($100)) + the special prep that every game ball goes through. The host team must have 35 game balls prepped per game. Wait, that has changed. "}, {"url": "http://www.answers.com/Q/How_much_does_a_NFL_football_cost", "passage_text": "How much does it cost a nfl player to throw a football into the stands? Players are typically fined around $10,000 dollars for doing this  based on what the NFL calls safety violations due to fans  fighting over or jumping to try and retrieve … the balls.    This is what their contracts say.... In National Football League (NFL)."}, {"url": "http://sports.yahoo.com/news/nfl--football-teams-with-the-most-expensive-tickets-213046787.html", "passage_text": "In 2011, a ticket to a Ravens football game cost about $177. Since then, the average cost of home game tickets has increased by 24.3%. M&T Bank Stadium, which was completed in 1998 for about $220 million, sells out on a regular basis, filling its more than 70,000 seats. "}, {"url": "http://boards.straightdope.com/sdmb/archive/index.php/t-216838.html", "passage_text": "10-12-2003, 10:43 AM. Well, about 15 years ago while at a Bucs game (back when the uniforms were ugly orange and Testaverde was leader of the losers) I was told the balls cost $250 each...of course I have no cite/link but it's a start! Reeder. 10-12-2003, 11:17 AM. $74.99 retail according to this Wilson page.. "}, {"url": "http://www.answers.com/Q/How_much_does_a_NFL_football_cost", "passage_text": "Last I heard it was around $74.99 not including the special kicker balls and etc. Your looking at almost $1,000 in footballs in one game. In National Football League (NFL). Players are typically fined around $10,000 dollars for doing this  based on what the NFL calls safety violations due to fans  fighting over or jumping to try and retrieve … the balls."}]