[{"url": "http://www1.salary.com/Surgeon-Burn-salary.html", "passage_text": "For example the median expected annual pay for a typical Surgeon-Burn in the United States is $387,114 so 50% of the people who perform the job of Surgeon-Burn in the United States are expected to make less than $387,114. Source: HR Reported data as of October 2015. Median $387,114. The annual salary for someone with the job title Surgeon-Burn may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://www.ehow.com/info_7995439_salary-attending-surgeon.html", "passage_text": "The median salary for plastic surgeons in the United States is $321,017, according to Salary.com. Plastic surgeons must complete a six year residency program after medical school to become an attending plastic surgeon. Three of those years will be spent in general surgery and three are spent in plastic surgery. Neurosurgeons are required to train for at least 14 years before performing brain surgery. Neurosurgeons make between $354,000 and $936,000 a year, according to Studentdoc.com. The average salary for neurosurgeons is $541,000. Neurologists must complete a six-year residency program after medical school before working as an attending surgeon."}, {"url": "http://www.healthcare-salaries.com/physicians/plastic-surgeon-salary", "passage_text": "The average expected salary for a plastic surgeon based in United Kingdom is about £48,429 per annum while the median salary for a plastic surgeon is about £40,000 per year. An average hourly wage for a plastic surgeon is about £24.21. For sure you will think of being a plastic surgeon because surgeries are paid expensively. So if you are wondering how much you can earn being a plastic surgeon in Germany, then it will range from 60 000 Euro to 80 000 Euro. This will also depend with the years of your experience as well as the level of your expertise"}, {"url": "http://www1.salary.com/Surgeon-Plastic-Reconstructive-salary.html", "passage_text": "For example the median expected annual pay for a typical Surgeon-Plastic Reconstructive in the United States is $351,099 so 50% of the people who perform the job of Surgeon-Plastic Reconstructive in the United States are expected to make less than $351,099. Source: HR Reported data as of October 2015. The annual salary for someone with the job title Surgeon-Plastic Reconstructive may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://www1.salary.com/Surgeon-Burn-salary.html", "passage_text": "What is the average annual salary for Surgeon-Burn? The annual salary for someone with the job title Surgeon-Burn may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://work.chron.com/much-money-general-surgeons-earn-9471.html", "passage_text": "Pay by Region. General surgeons practicing in the Great Lakes region reported the highest average salary in 2011, $297,000. Those practicing in California and Hawaii earned a close second, averaging $295,000, and those in the Southwestern states earned a relatively high average salary of $285,000 per year. Pay by Practice Setting. According to Medscape, general surgeons practicing in health care organizations earned the most by practice setting in 2011, an average of $339,000 per year. Those practicing in single-specialty group practices averaged $332,000, and those practicing in multispecialty group practices averaged $324,000"}, {"url": "http://www.healthcare-salaries.com/physicians/plastic-surgeon-salary", "passage_text": "Plastic surgeon salary in USA. Based on percentiles, the median yearly salary for 90th percentile of plastic surgeons has been around $472,592. Similarly, about 75th percentile of plastic surgeons received $401,509, 25th percentile of them received $283,016 while 10th percentile received $246,218 per year. For sure you will think of being a plastic surgeon because surgeries are paid expensively. So if you are wondering how much you can earn being a plastic surgeon in Germany, then it will range from 60 000 Euro to 80 000 Euro. This will also depend with the years of your experience as well as the level of your expertise"}]