[{"url": "http://www.bathcsd.org/webpages/edepartment/shakespearean_terms.cfm", "passage_text": "The Language of Shakespeare. The English language has changed a great deal over the last few hundred years, and it is still changing. Several words in use during Shakespeare's day either have different meanings today or have been nearly forgotten. Here is a list of some of the most common words in Shakespeare with which you might not be familiar. There is also a link to a printable version of this list at the bottom of the pag"}, {"url": "http://shakespeare.about.com/od/shakespeareslanguage/", "passage_text": "Shakespeare's Language. Shakespeare was using the everyday language of his time. To really get to grips with his use of language, there are a few simple techniques and conventions that you need to understand. 8 Articles in: Shakespeare's Language. Shakespeare was using the everyday language of his time. Our Shakespeare language guide helps you get to grips with his use of language and explains the techniques and conventions he used."}, {"url": "http://www.skwirk.com/p-c_s-54_u-253_t-649_c-2526/shakespearean-language/nsw/shakespearean-language/skills-by-text-type-shakespearean-drama/shakespeare-overview", "passage_text": "Shakespearean language : Many students complain that Shakespearean language is too difficult to understand or ask why Shakespeare could not have written in 'normal' English. Shakespearean, or Elizabethan, English is 'normal' English."}, {"url": "http://shakespeare.about.com/od/teachingshakespeare/a/shakespeare_words.htm", "passage_text": "I think it is important to note that when Shakespeare was alive, language was in a state of flux and many modern words were being integrated into the language for the first time. Shakespeare himself coined many new words and phrases. "}, {"url": "http://www.shakespearehigh.com/classroom/guide/page3.shtml", "passage_text": "An On-line Shakespearean Glossary. Use this glossary to look up unusual words used in Shakespeare's plays. As this is a general glossary, you will want to make sure that the definition fits the context of the line in which the word is used."}, {"url": "http://www.answers.com/Q/How_do_you_say_me_in_shakespearean_language", "passage_text": "We're actors; we're the opposite of people - Tom Stoppard. Shakespeare's language was Modern English, the same as we are using now. It is just a different dialect, like the English used in a different country from yours. Since he spoke English, me is me. In fact, me in English has always been me as long as there has been an English language. "}, {"url": "http://www.skwirk.com/p-c_s-54_u-253_t-649_c-2526/shakespearean-language/nsw/shakespearean-language/skills-by-text-type-shakespearean-drama/shakespeare-overview", "passage_text": "Introduction. Many students complain that Shakespearean language is too difficult to understand or ask why Shakespeare could not have written in 'normal' English. Shakespearean, or Elizabethan, English is 'normal' English"}, {"url": "https://answers.yahoo.com/question/index?qid=20100216161653AAxcMI1", "passage_text": "How do you say my and I in Shakespeare language? The sentence is When I promised my love for you with the ring of marriage, I sincerely meant it. It would be awesome if you guys could convert the sentence to Shakespeare language but don't make it all confusing."}, {"url": "http://www.shakespeare-online.com/biography/shakespearelanguage.html", "passage_text": "Shakespeare's complex sentence structures and use of now obsolete words lead many students to think they are reading Old or Middle English. In fact, Shakespeare's works are written in Early Modern English. Once you see a text of Old or Middle English you'll really appreciate how easy Shakespeare is to understand (well, relatively speaking)."}, {"url": "http://www.shakespeareswords.com/FEW", "passage_text": "Frequently Encountered Words (FEW). Several of the content-carrying words in Shakespeare are used so often that we find it helpful to approach them in the manner of a language-teaching phrase-book, singling them out so that readers can more easily develop an intuition about how they are used. "}]