[{"url": "http://www.space.com/17638-how-big-is-earth.html", "passage_text": "View full size image. Earth, the third planet from the sun, is the fifth largest planet in the solar system; only the gas giants Jupiter, Saturn, Uranus and Neptune are bigger. Earth is the largest of the terrestrial planets of the inner solar system, bigger than Mercury, Venus and Mars."}, {"url": "http://www.weegy.com/?ConversationId=60C9E4FF", "passage_text": "The earth is the _____ largest planet. third fourth fifth sixth. Earth is the 5th largest planet. Earth is the third planet from the Sun, and the densest and fifth-largest of the eight planets in the Solar System."}, {"url": "http://www.space.com/17638-how-big-is-earth.html", "passage_text": "Credit: JAXA/NHK. View full size image. Earth, the third planet from the sun, is the fifth largest planet in the solar system; only the gas giants Jupiter, Saturn, Uranus and Neptune are bigger. Earth is the largest of the terrestrial planets of the inner solar system, bigger than Mercury, Venus and Mars."}, {"url": "http://www.neok12.com/Earth.htm", "passage_text": "Earth is the third planet from the Sun and the fifth largest planet in the solar system. The planet is around 4.5 billion years old, and life appeared on its surface around 3.5 billion years ago. In our universe, Earth is the only place where life is known to exist with millions of species."}, {"url": "http://www.neok12.com/Earth.htm", "passage_text": "Earth. Earth is the third planet from the Sun and the fifth largest planet in the solar system. The planet is around 4.5 billion years old, and life appeared on its surface around 3.5 billion years ago. In our universe, Earth is the only place where life is known to exist with millions of species."}, {"url": "http://www.tmclark.com/Starwatch/solarsystem.html", "passage_text": "Earth, the fifth largest planet in the solar system, is the only one known to support life. It revolves around the sun in about 365 days. Estimated to be 4.5 billion to 5 billion years old, this planet has one natural satellite, the moon."}, {"url": "http://science.nationalgeographic.com/science/space/solar-system/earth/", "passage_text": "For instance, Earth is the third planet from the sun and the fifth largest in the solar system. Earth's diameter is just a few hundred kilometers larger than that of Venus."}]