[{"url": "http://www.tulane.edu/~sanelson/eens212/sandst%26cong.htm", "passage_text": "First, sandstones are easily studied because they contain sand sized grains that can easily be distinguished with a petrographic microscope. Second, most of the world's oil and natural gas is found in sands or sandstones because of their generally high porosity. Classification For this course we will use a classification of sandstones that is partially based on Blatt and Tracey (p. 257) and partially based on Williams, Turner, and Gilbert (p. 326)."}, {"url": "http://jncc.defra.gov.uk/page-2936", "passage_text": "Erosion of the mountain belt produced the sediments of the Old Red Sandstone, deposited in the tropics south of the Equator in a semi-arid climate. The oldest Old Red Sandstone is of Wenlock age, found in the Midland Valley of Scotland. Please cite as: Barclay, W.J., Browne, M.A.E., McMillan, A.A., Pickett, E.A., Stone, P. and Wilby, P.R. (2005) The Old Red Sandstone of Great Britain, Geological Conservation Review Series, No. 31, Joint Nature Conservation Committee, Peterborough, 393 pp."}, {"url": "http://www.answers.com/Q/What_is_a_sandstone", "passage_text": "Sandstone is a rock and the terms 'cleavage' and 'fracture' apply to minerals. Sandstones are commonly composed of quartz, which doesn't have cleavage and has a concoidal frac … ture. 1 person found this useful. Sandstone is a type of rock composed on sand sized particles of sand and minerals. Sandstone is typically found in the desert, or dry climates"}, {"url": "http://geology.about.com/od/more_sedrocks/a/aboutsandstone.htm", "passage_text": "Sandstone is a category of rock made from sediment (a sedimentary rock). The sediment particles are clasts, or pieces, of minerals and fragments of rock, thus sandstone is a clastic sedimentary rock. Sandstone with a lot of matrix is called poorly sorted. If matrix amounts to more than 10 percent of the rock, it is called a wacke (wacky). A well-sorted sandstone (little matrix) with little cement is called an arenite. Another way to look at it is that wacke is dirty and arenite is clean."}, {"url": "http://www.answers.com/Q/What_is_a_sandstone", "passage_text": "Limestone is a sedimentary rock formed of calcite or calcium carbonate deposits from ancient sea life. Sandstone is a metamorphic rock formed from sand which has been solidif … ied by some geologic process. Sandstone is a type of rock composed on sand sized particles of sand and minerals. Sandstone is typically found in the desert, or dry climate"}, {"url": "https://en.wikipedia.org/wiki/Sedimentary_rock", "passage_text": "Particles that form a sedimentary rock by accumulating are called sediment. Before being deposited, sediment was formed by weathering and erosion in a source area, and then transported to the place of deposition by water, wind, ice, mass movement or glaciers which are called agents of denudation. Sedimentary rocks are types of rock that are formed by the deposition of material at the Earth 's surface and within bodies of water. Sedimentation is the collective name for processes that cause mineral and/or organic particles (detritus) to settle and accumulate or minerals to precipitate from a solu"}, {"url": "https://en.wikipedia.org/wiki/Sandstone", "passage_text": "Sandstone Rock-cut tombs (Kokhim) in Petra, Jordan. Sandstone (sometimes known as arenite) is a clastic sedimentary rock composed mainly of sand-sized minerals or rock grains. Most sandstone is composed of quartz and/or feldspar because these are the most common minerals in the Earth's crust. Like sand, sandstone may be any color, but the most common colors are: tan, brown, yellow, red, grey, pink, white, and black. Since sandstone beds often form highly visible cliffs and other topographic features, certain colors of sandstone have been strongly identified with certain regions."}, {"url": "http://www.answers.com/Q/What_is_a_sandstone", "passage_text": "Sandstone is a sedimentary rock formed when grains of sand are deposited and subsequently compacted into rock by the pressure of overlying deposits and by the cementing … effect of various other chemicals. Sandstone is a type of rock composed on sand sized particles of sand and minerals. Sandstone is typically found in the desert, or dry climate"}]