[{"url": "http://www.brianmac.co.uk/speed.htm", "passage_text": "Speed is an integral part of every sport and can be expressed as any one of, or combination of, the following: maximum speed, elastic strength (power) and speed endurance. Speed is influenced by the athlete's mobility, special strength, strength endurance and technique. A hill with a maximum of a 15° decline is most suitable. Use 40 metres to 60 metres to build up to full speed and then maintain the speed for a further 30 metres. A session could comprise of 2 to 3 sets of 3 to 6 repetitions. The difficulty with this method is to find a suitable hill with a safe surface."}, {"url": "http://www.mastersathlete.com.au/sidebar/team-players/training/training-definitions/", "passage_text": "Training Definitions. In order to get the most out of this section, a number of definitions must be understood. 1  Speed is the distance covered divided by the time it takes to cover that distance. 2  In sports such as swimming or running, the speed is covered in a straight line. 1 Maximum speed is the highest speed an aging athlete can reach. 2  This normally occurs three to five seconds after the start of a race from a stationary position. 3  Acceleration speed in sports such as team sports or tennis is crucial."}, {"url": "http://athletics.wikia.com/wiki/Speed-endurance", "passage_text": "853 pages on this wiki. Speed-endurance is the ability to prolong the amount of time where a near maximal speed can be maintained. During activity such as this, accumulation of blood lactate disturbs the excitation-contraction coupling and cross-bridge formation"}, {"url": "https://en.wikipedia.org/wiki/Interval_training", "passage_text": "Interval training can refer to organization of any cardiovascular workout (e.g., cycling, running, rowing, etc.), and is prominent in training routines for many sports. It is a technique particularly employed by runners, but athletes in many disciplines use this type of training. From Wikipedia, the free encyclopedia. Interval training is a type of physical training that involves a series of low-to high-intensity exercise workouts interspersed with rest or relief periods. The high-intensity periods are typically at or close to anaerobic exercise, while the recovery periods involve activity of lower intensity"}, {"url": "http://www.topendsports.com/fitness/speed.htm", "passage_text": "Speed is one of the main fitness components, important for success in many sports. For some athletes such as Track and Field sprinters, sprint swimmers, cyclists and speed skaters, speed is the most important aspect of fitness. In many other sports, including team field sports, good speed is also very important as part of the overall fitness profile. A vote of the top sports requiring speed has the obvious ones of track and field sprinters on top. See also another list ranking sports in which speed is important."}, {"url": "http://www.topendsports.com/fitness/speed.htm", "passage_text": "Speed is not just how fast someone can run (or cycle, swim etc.), but is dependent on their acceleration (how quickly they can accelerate from a stationary position), maximal speed of movement, and also speed maintenance (minimizing deceleration). In many other sports, including team field sports, good speed is also very important as part of the overall fitness profile. A vote of the top sports requiring speed has the obvious ones of track and field sprinters on top. See also another list ranking sports in which speed is important."}, {"url": "http://www.mastersathlete.com.au/sidebar/team-players/training/training-definitions/", "passage_text": "1 Thus, a number of types of speed training need to be defined: 2  Maximum speed is the highest speed an aging athlete can reach. 3  This normally occurs three to five seconds after the start of a race from a stationary position. 4  Acceleration speed in sports such as team sports or tennis is crucial. 1 Maximum speed is the highest speed an aging athlete can reach. 2  This normally occurs three to five seconds after the start of a race from a stationary position. 3"}, {"url": "http://www.mens-fitness-and-health.com/Physical-Fitness-Definition.html", "passage_text": "Since little or nothing can be done to improve these, our physical fitness definition below includes only physical capabilities that are amenable to training. These are strength, muscular endurance, aerobic endurance, speed, agility/quickness, flexibility, and balance: Strength. Speed is a key component of a physical fitness definition because of its wide application to many human activities. It is the maximal velocity that can be reached by part or all of the body. The speed of a sprinter is greater than that of a distance runner, although the distance runner can sustain his speed much longer."}]