[{"url": "https://en.wikipedia.org/wiki/Steam", "passage_text": "Steam is invisible; however, steam often refers to wet steam, the visible mist or aerosol of water droplets formed as this water vapor condenses. Steam is water in the gas phase, which is formed when water boils."}, {"url": "https://answers.yahoo.com/question/index?qid=20080924094103AAcKTUB", "passage_text": "'Steam' is formed when water Vaporises at its boiling temperature. This is 100°C at standard atmospheric pressure (1.0atm). Water will also boil at higher and lower temperatures depending on the surrounding pressure. (Increased pressure, increases boiling point and decreased pressure decreases boiling point). Report Abuse. Tricky question. Water will obviously boil and turn to vapor (steam) at 100 degrees celcius (212 F). But if you heat water to a point below boiling, you can see it giving off steam. The temperature at which that happens is not fixed;it varies with the ambient temperature and humidity."}, {"url": "http://www.answers.com/Q/What_temperature_does_water_steam", "passage_text": "Saturation temperature of steam is the Temperature at whihc any addition of heat does not increase the temperature of the water but produces steam.It depends upon the pressue … and for every pressure there is a saturation temperature. 3 people found this useful. Why more serious burns are caused by steam than water at same temperature? The heat content of 1 gram of steam of 100oC is much higher than that of 1 gram of 100oC, the extra comes from condensation heat (energy)."}, {"url": "https://en.wikipedia.org/wiki/Steam", "passage_text": "At lower pressures, such as in the upper atmosphere or at the top of high mountains, water boils at a lower temperature than the nominal 100 °C (212 °F) at standard temperature and pressure. If heated further it becomes superheated steam. Steam is water in the gas phase, which is formed when water boils."}, {"url": "https://en.wikipedia.org/wiki/Superheated_steam", "passage_text": "Superheated steam is steam at a temperature higher than its vaporization (boiling) point at the absolute pressure where the temperature is measured. If saturated steam is reduced in temperature (whilst retaining its pressure) it will condense to produce water droplets, even if it is still considerably above the boiling point of 100 °C at standard pressure."}, {"url": "https://www.quora.com/Is-steam-hotter-than-boiling-water-4", "passage_text": "Note: this does not mean the energy content is the same. Steam has a LOT more energy than water at the same temperature. For example, steam at 100°C contains more than six times the amount of energy than water boiling at 100°C (see here: Saturated Steam Tables). The answer to your question is then: yes, and no. In this instance, the high pressure boiling water will be at a higher temperature than the low pressure steam-a scenario where boiling water is not hotter than steam. Here, the converse is also true."}, {"url": "http://www.sophisticatededge.com/what-temperature-does-water-turn-to-steam.html", "passage_text": "ANSWER; The basic steam point of water is when it is heated to a temperature of 212 degrees Fahrenheit, 100 degrees Celsius or 373 degrees Kelvin. Prior to the advent of the steam engine, the true originator of modern applications of the water-steam temperature point was Thomas Savery. He invented and patented in 1698 the Savery Pump, a process whereby steam was used to pump water out of mines rather than the previously antiquated method of buckets and bailing."}, {"url": "https://en.wikipedia.org/wiki/Steam", "passage_text": "Water vapor that includes water droplets is described as wet steam. As wet steam is heated further, the droplets evaporate, and at a high enough temperature (which depends on the pressure) all of the water evaporates and the system is in vapor–liquid equilibrium. Steam is water in the gas phase, which is formed when water boils."}, {"url": "https://answers.yahoo.com/question/index?qid=20071231180051AAyRmra", "passage_text": "This is because steam has more energy, and the def of temp is average Kinetic energy. there you have it, steam does have more temp than boiling water. Source(s): illuminati789 · 8 years ago. "}]