[{"url": "https://www.sharecare.com/health/schizophrenia/when-does-schizophrenia-start", "passage_text": "Symptoms of schizophrenia usually start between ages 16 and 30. Men often develop symptoms at a younger age than women. People usually do not get schizophrenia after age 45. This answer is based on source information from the National Institute of Mental Health. The more well-known symptoms, such as hallucinations and delusions, typically start when a man is around 16 to 19 years old or in his early 20s. A woman with schizophrenia more typically experiences hallucinations or delusions when she is in her mid-20s or early 30s."}, {"url": "https://www.sharecare.com/health/schizophrenia/when-does-schizophrenia-start", "passage_text": "Symptoms of schizophrenia may actually start earlier than age 16. The problem is that behaviors such as irritability and sleep problems may be symptoms of the disease or may be normal teenage behaviors. As more research is done, experts should know more about when the symptoms of this lifelong disease begin. The more well-known symptoms, such as hallucinations and delusions, typically start when a man is around 16 to 19 years old or in his early 20s. A woman with schizophrenia more typically experiences hallucinations or delusions when she is in her mid-20s or early 30s."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=151148&page=2", "passage_text": "Schizophrenia affects men and women equally. It occurs at similar rates in all ethnic groups around the world. Symptoms such as hallucinations and delusions usually start between ages 16 and 30. Men tend to experience symptoms a little earlier than women. Most of the time, people do not get schizophrenia after age 45. Schizophrenia rarely occurs in children, but awareness of childhood-onset schizophrenia is increasing. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/schizophrenia/basics/symptoms/CON-20021077", "passage_text": "Symptoms. In men, schizophrenia symptoms typically start in the early to mid-20s. In women, symptoms typically begin in the late 20s. It's uncommon for children to be diagnosed with schizophrenia and rare for those older than 45. Schizophrenia involves a range of problems with thinking (cognitive), behavior or emotions. "}, {"url": "https://www.nami.org/Learn-More/Mental-Health-Conditions/Schizophrenia", "passage_text": "Although schizophrenia can occur at any age, the average age of onset tends to be in the late teens to the early 20s for men, and the late 20s to early 30s for women. It is uncommon for schizophrenia to be diagnosed in a person younger than 12 or older than 40. It is possible to live well with schizophrenia. "}, {"url": "http://www.webmd.com/schizophrenia/tc/what-happens-schizophrenia", "passage_text": "Symptoms of schizophrenia usually start in the late teens to mid-20s for men and the late 20s to 30s for women. The symptoms may start suddenly or happen gradually. Childhood schizophrenia is rare. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080619203618AAlr2iA", "passage_text": "It is rare before the age of 15, but can start at any time after this, most often between the ages of 15 and 35. Psychotic symptoms (such as hallucinations and delusions) usually emerge in men in their late teens and early 20s and in women in their mid-20s to early 30s. They seldom occur after age 45 and only rarely before puberty, although cases of schizophrenia in children as young as 5 have been reported. . Best Answer: Late-teens/early-20's if it is the normal onset/variety of the disorder. There are many variations and disorders sharing similar symptoms, and there are causes outside of genetics which can cause schizophrenia and related problems at any age. Source(s): Raj (rajb1037) · 7 years ago."}, {"url": "https://www.sharecare.com/health/schizophrenia/when-does-schizophrenia-start", "passage_text": "Schizophrenia symptoms most commonly manifest themselves between the ages of 16 and 30. It is rare for individuals who cannot drive (under age 16) and those 45 or older to show signs of the disease. And it’s important to note that symptoms in men tend to appear earlier than in women. The more well-known symptoms, such as hallucinations and delusions, typically start when a man is around 16 to 19 years old or in his early 20s. A woman with schizophrenia more typically experiences hallucinations or delusions when she is in her mid-20s or early 30s."}, {"url": "https://www.sharecare.com/health/schizophrenia/when-does-schizophrenia-start", "passage_text": "Schizophrenia is a disease that has several types of symptoms, some of which start earlier than others. The more well-known symptoms, such as hallucinations and delusions, typically start when a man is around 16 to 19 years old or in his early 20s. A woman with schizophrenia more typically experiences hallucinations or delusions when she is in her mid-20s or early 30s."}]