[{"url": "http://www.recipetips.com/kitchen-tips/t--1427/grilling-ham.asp", "passage_text": "Indirect Heat Grilling on Gas Grills. Once the ham is prepared and the gas grill have been heated properly (see Gas Grill Setup), there are several easy steps to follow in order to cook ham using indirect heat on a gas grill. 1  All of the burners, except one, are turned off. Grilling Ham Slices. 1  Preheat the grill to medium heat. 2  To help prevent the ham slices from sticking to the grate on which they will be placed, the grate can be brushed with oil and the grill should be properly preheated before placing the meat on the grate."}, {"url": "http://www.weber.com/recipes/pork/apple-glazed-ham-with-sweet-potatoes", "passage_text": "Instructions. Allow the ham to stand at room temperature for 30 minutes before grilling. Prepare the grill for direct and indirect cooking over medium-low heat (about 350°F). Score the ham in a large crisscross pattern about 1 inch apart and ½ inch deep on all sides, except the cut side. Place the ham, cut side down, in a large disposable foil pan and pour in the apple juice"}, {"url": "http://www.recipetips.com/kitchen-tips/t--752/grilling-ham.asp", "passage_text": "The grill should be at a medium heat. Place the ham slices on the grill approximately 4 inches above direct heat. Leaving the hood open, cook for 6 to 10 minutes on both sides or until each side is nicely browned. "}, {"url": "https://groups.google.com/d/topic/SmokeRingBBQ/qnuu8vz5fdI", "passage_text": "Drain the wood chips and add them to the charcoal or put the chips in. the smoker box of a gas grill, following the manufacturer’s. instructions. 3. Place the ham, flat side down, in a 13x9-inch, heavy-duty foil pan. Place the pan on the cooking grate and pour about 1 cup of water in. the pan. "}, {"url": "http://www.livestrong.com/article/436288-how-to-grill-a-fresh-ham/", "passage_text": "Prepare the grill to cook the ham. Cooking a fresh ham on the grill requires indirect heat to ensure it cooks through. This means the ham will not sit directly over the heat source. Place a drip pan under the grate where the fresh ham will sit. For a charcoal grill, fill a charcoal chimney with briquettes and ignite. When the charcoal is ready, move it to one side of the grill. For a gas grill, light one side and leave the side under the fresh ham unlit. Pre-heat the grill as you would an oven. Step 5. Place the ham on the grill over the drip pan with its fatty side facing up. Lower the grill cover, with the bottom vents fully open and the side vents open about one-quarter. Add more charcoal every 30 minutes or so for even cooking."}, {"url": "http://www.weber.com/weber-nation/blog/take-your-grilled-ham-to-another-level", "passage_text": "1 Do not change the cooking time on the recipe. 2  Just because you roast your ham on the grill instead of in the oven, there is no need to alter any cooking times. 3  A good rule of thumb is 12-15 minutes per pound when you stay between 225-250 degrees for a precooked ham. It is also one of my favorite times because I love ham and split pea soup. I really enjoy a slice of moist, tender ham with a sugary crisp crust. Now, I’ve made my fair share of ham, and can tell you without a doubt that the best way to achieve this is on a grill. The convection cooking your grill provides is unmatched."}, {"url": "http://www.weber.com/weber-nation/blog/take-your-grilled-ham-to-another-level", "passage_text": "1 Just because you roast your ham on the grill instead of in the oven, there is no need to alter any cooking times. 2  A good rule of thumb is 12-15 minutes per pound when you stay between 225-250 degrees for a precooked ham. It is also one of my favorite times because I love ham and split pea soup. I really enjoy a slice of moist, tender ham with a sugary crisp crust. Now, I’ve made my fair share of ham, and can tell you without a doubt that the best way to achieve this is on a grill. The convection cooking your grill provides is unmatched."}, {"url": "http://help.weber.com/grilling-tips/direct-indirect/", "passage_text": "To grill by the Direct Method on a charcoal grill, spread prepared coals evenly across the charcoal grate. Set the cooking grate over the coals and place food on the cooking grate. Place the lid on the grill and lift it only to turn food or to test for doneness at the end of the recommended cooking time. To grill by the Direct Method on a gas grill, preheat the grill with all burners on High. Place the food on the cooking grate, then adjust all burners to the temperature noted in the recipe. Close the lid of the grill and lift it only to turn food or to test for doneness at the end of the recommended cooking tim"}, {"url": "http://www.recipetips.com/kitchen-tips/t--1427/grilling-ham.asp", "passage_text": "1 Prepare the grill for indirect heat grilling. 2  See above. 3  Place the ham in the area where the drip pan is located where there is no heat source. 4  Instead of using a drip pan, the ham could be place in a foil pan and then placed on the grill with the heat source turned off directly under it. Grilling Ham Slices. 1  Preheat the grill to medium heat. 2  To help prevent the ham slices from sticking to the grate on which they will be placed, the grate can be brushed with oil and the grill should be properly preheated before placing the meat on the grate."}, {"url": "http://bbqlikeitshot.com/weber-smoked-glazed-ham/", "passage_text": "How to Smoke a Ham on a Weber Grill. Prepare your grill for medium heat indirect smoking with a temperature of 160°C. As the ham is already in a tray there is no need for a drip tray. To ensure the ham is heated all the way though you want to allow 10 minutes per 500g at 160°C. Adjust your cooking time accordingly to the size of your ham. For my ham I cooked for one hour 40 minutes due to the fact that while my briquettes started at 160°C they slowly dropped to around 140°C during the cook"}]