[{"url": "http://www.bobst.com/usen/products/die-cutting/processed-materials/", "passage_text": "Paper is a fibre-based material produced from wood, rags or organic material. The types of paper used in the packaging and graphic arts industries typically use wood and/or recycled paper and board, which is then chemically or mechanically processed to produce cellulose pulp. Processed materials. BOBST and flat bed die-cutting go hand in hand, after all we did invent the technology with our first Autoplaten® press, the AP 900, introduced back in 1940."}, {"url": "http://www.answers.com/Q/What_is_Processed_materials", "passage_text": "Raw materials are materials that have been harvested from the earth. Lumber, metal ores, and grain are all examples of raw materials. Processed materials are materials which … have been refined or built by humans from raw materials. Examples would include paper, steel, or glass."}, {"url": "http://www.businessdictionary.com/definition/material.html", "passage_text": "See also materiality. 2.The matter from which something can be made. Material can include but is not limited to raw and processed material, components, parts, assemblies, sub-assemblies, fuels, lubricants, coolants, cleaning agents, and small tools and accessories that may be consumed directly or indirectly. Compare with materiel. "}, {"url": "http://www.answers.com/Q/What_are_raw_materials_and_processed_materials", "passage_text": "Raw materials are materials that have been harvested from the earth. Lumber, metal ores, and grain are all examples of raw materials. Processed materials are materials which have been refined or built by humans from raw materials. Examples would include paper, steel, or glas"}, {"url": "http://www.thunderboltkids.co.za/Grade5/02-matter-and-materials/chapter4.html", "passage_text": "We call materials that have not yet been processed raw materials. Raw materials are made into other things. When raw materials are in the form in which they are found in nature, we can call them natural materials. A natural material is any material that comes from plants, animals, or the ground. INSTRUCTIONS: 1  Your task is to find examples of processed materials in the world around you, particularly non-metals. 2  You must look at why that material has been used and how its properties make it useful to us."}, {"url": "http://www.thunderboltkids.co.za/Grade5/02-matter-and-materials/chapter4.html", "passage_text": "QUESTIONS: 1  Draw a new table in which you place each processed material next to the Raw material that it may have been made from. 2  For instance, in the table below, bread and wheat have been placed next to each other, because bread can be made from wheat. INSTRUCTIONS: 1  Your task is to find examples of processed materials in the world around you, particularly non-metals. 2  You must look at why that material has been used and how its properties make it useful to us."}, {"url": "http://www.australiancurriculum.edu.au/Glossary?a=S&t=Processed%20materials", "passage_text": "Processed materials-Glossary Term. products of physical matter that have been modified from natural materials by human intervention or that do not occur at all in the natural environment, but have been designed and manufactured to fulfil a particular purpose. "}, {"url": "http://www.thunderboltkids.co.za/Grade5/02-matter-and-materials/chapter4.html", "passage_text": "1 Draw a new table in which you place each processed material next to the Raw material that it may have been made from. 2  For instance, in the table below, bread and wheat have been placed next to each other, because bread can be made from wheat. INSTRUCTIONS: 1  Your task is to find examples of processed materials in the world around you, particularly non-metals. 2  You must look at why that material has been used and how its properties make it useful to us."}, {"url": "http://medical-dictionary.thefreedictionary.com/processed+material", "passage_text": "processed material. A term used in the context of the UK’s Human Tissue Act 2004, referring to material of human origin for which permission for use or retention may be required. "}, {"url": "http://www.education.vic.gov.au/school/teachers/teachingresources/discipline/science/continuum/Pages/naturalproc.aspx", "passage_text": "Natural materials are ones that occur within the natural environment and have undergone very little modification. Processed materials are often modified from natural materials or do not occur at all in the natural environment, but have been designed and manufactured to fulfil a particular purpose. "}]