[{"url": "http://www.babynamespedia.com/meaning/Arpana", "passage_text": "Tweet. [ 3 syll. ar-pa-na, arp-ana ] The baby girl name Arpana is pronounced as aaRPae-Naa- †. Arpana's language of origin is Sanskrit and it is used mainly in the Indian language. The name means 'dedicated one'. Arpana is rare as a baby girl name. It is not listed in the top 1000. Baby names that sound like Arpana include Arpeni (Armenian), Arpine (Armenian), Aerfen (Welsh), Orphne, Orphnee, Orphney, Orphnie, and Orphny."}, {"url": "http://www.behindthename.com/submit/names/usage/indian", "passage_text": "AAHANA f Indian, Sanskrit, Hindi. The name Aahana comes from the Indian word which means, Morning Glory First rays of the sun. ,somebody so sweet and to charming like rose and Someone who cannot be destroyed... It is also suggested that the name means Angel. ... [more]."}, {"url": "http://www.meaning-of-names.com/indian-names/arpana.asp", "passage_text": "Indian name. In Indian, the name Arpana means-dedicated.The name Arpana originated as an Indian name. The name Arpana is most often used as a girl name or female name. Indian Name Meaning-dedicated."}, {"url": "http://www.20000-names.com/male_hindi_names.htm", "passage_text": "1 ISHA (ईश): Hindi name meaning master, lord.. 2  JAGANNATH (जगन्नाथ): Hindi name composed of the Sanskrit elements jagat world, universe and natha lord, master, hence master of the universe.. 3  In mythology, this is a title belonging to Vishnu. 1 In mythology, this is a name applying collectively to all the children of Aditi. 2  AGNIMUKHA: Hindi name meaning face of fire.. 3  In one of the ancient Panchatantra children's tales, this is the name of a flea."}, {"url": "http://www.hamariweb.com/names/hindu/", "passage_text": "Sirjung. Sirjung is the old hindi name which meaning is Hero, I am willing to keep this name for my baby boy because he is my hero, I hope my whole family like this lovely name. Jaganmay. Jaganmay is a new Hindu boy name page. It is unique and contain an amazing meaning and other relevant details"}, {"url": "http://www.20000-names.com/male_hindi_names.htm", "passage_text": "1 ADITYA (आदित्य): Hindi name meaning belonging to Aditi.. 2  In mythology, this is a name applying collectively to all the children of Aditi. 3  AGNIMUKHA: Hindi name meaning face of fire.. 4  In one of the ancient Panchatantra children's tales, this is the name of a flea. 1 In mythology, this is a name applying collectively to all the children of Aditi. 2  AGNIMUKHA: Hindi name meaning face of fire.. 3"}, {"url": "http://astrobix.com/name/meaning/Aparna", "passage_text": "Meaning of Indian name: Aparna. Meaning of the name Aparna is 'Goddess Parvati'. Aparna is a name of Hindu / Indian origin, and is commonly used for females. The name number for Aparna is '6"}, {"url": "http://www.thenamemeaning.com/arpana/", "passage_text": "Search comprehensively and find the name meaning of Arpana and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Arpana and check the initials of the name with your last name to discover how it looks and sounds. The history and meaning of the name Arpana is fascinating, learn more about it."}, {"url": "http://www.thenamemeaning.com/arpana/", "passage_text": "This doesn't mean that the name Arpana is not popular in other countries all over the world. The name might be popular in other countries, in different languages, or even in a different alphabet, as we use the characters from the Latin alphabet to display the data. Also note the spelling and the pronunciation of the name Arpana and check the initials of the name with your last name to discover how it looks and sounds. The history and meaning of the name Arpana is fascinating, learn more about it."}, {"url": "http://www.thenamemeaning.com/arpana/", "passage_text": "The first thing you should know if you are considering Arpana for your baby's name is that in most countries all over the world the name Arpana is a girl name. The name Arpana is of Sanskrit origin, and is used mostly in Hindi speaking countries but also in a few other countries and languages of the world. Also note the spelling and the pronunciation of the name Arpana and check the initials of the name with your last name to discover how it looks and sounds. The history and meaning of the name Arpana is fascinating, learn more about it."}]