[{"url": "http://www.thinkbabynames.com/meaning/1/Lester", "passage_text": "Lester /le-ster/ [2 sylls.] as a boys' name is pronounced LES-ter. It is of Old English origin, and the meaning of Lester is from Leicester. Place name: an area in central England. Kreatif forms: Lesterra, Lesterre, Lesterri. Presented below is the baby name popularity of Lester for boys. Lester reached its top position of #54 in the U.S. in the 1900s, but is not ranked at the moment. (Top 1000 Baby Names Records, 2014). Shown below is an analysis of the popularity of Lester and related names."}, {"url": "https://en.wikipedia.org/wiki/Lester", "passage_text": "Lester is an ancient Anglo-Saxon surname, first found in Cheshire, England. It originated from an original family living in Leicester, England and is derived from the concatenation of an Old English tribal name Ligore and the Old English word ceaster meaning Roman Town or Walled City. Lester may refer to: "}, {"url": "http://www.behindthename.com/name/lester", "passage_text": "From a surname which was derived from the name of the city of Leicester, originally denoting a person who was from that place. The city's name is derived from the river name Ligore combined with Latin castra camp. Related Names. "}, {"url": "http://www.sheknows.com/baby-names/name/lester", "passage_text": "Latin Meaning: The name Lester is a Latin baby name. In Latin the meaning of the name Lester is: From the Legion's camp. American Meaning: The name Lester is an American baby name. In American the meaning of the name Lester is: From the Legion's camp. English Meaning: The name Lester is an English baby name."}, {"url": "http://www.babynamespedia.com/meaning/Lester/m", "passage_text": "[ 2 syll. les-ter, le-st-er ] The baby boy name Lester is sometimes used as a girl name. It is pronounced as L EH ST-er †. Lester is largely used in the English language and it is derived from Old English origins. It is derived from the elements 'Ligora' ; 'caester' meaning Roman fort. The first name is from the surname, which is itself of the English place name now known as Leicester. Leicester, Lestar, Lestir, Lestor, Lestur, and Lestyr are variants of Lester. Lester is unusual as a baby name for boys. Its usage peaked modestly in 1906 with 0.335% of baby boys being given the name Lester."}, {"url": "http://www.auntyflo.com/boys-name-dictionary/lester", "passage_text": "Quick Meaning: Camp of the Legion. Number of letters: 6, Those 6 letters total to 25. Gender: Boy. Latin: Male From the Legion's camp. English: Male Fortified place. Derived from the place name, Leicester. Famous Bearer: Canadian statesman Lester B. Pearson (1897-1972). Detailed meaning: Lester is an Irish and a Scottish surname of Gaelic origin, which is a near version of the surname Lister. It is from the place name, which is the camp of the legion. It's stated that numbers hold the key to our inner most personality. Each letter inside your Christian name has a number equivalent. "}, {"url": "http://www.babynamewizard.com/baby-name/boy/lester", "passage_text": "Comments and insights on the name Lester: | Edit. Awful, old-man name. I can't imagine doing this to a little boy. I knew one woman my age who named her little boy Lester, and it was because her husband insisted on having a junior. They called him a completely different name. Les isn't a bad nickname. "}, {"url": "http://www.meaning-of-names.com/english-names/lester.asp", "passage_text": "Meaning of Lester. English name. In English, the name Lester means-from town of leicester.The name Lester originated as an English name. The name Lester is most often used as a boy name or male name. English Name Meaning-from town of leicester. Origin-England"}]