[{"url": "http://www.answers.com/Q/The_largest_extinction_the_world_has_ever_known_occurred_at_the_end_of_which_period", "passage_text": "Share to: The Permian-Triassic Extinction is considered the largest  extinction event in the history of life on planet Earth. This  extinction event, which occurred approximately 252 … million years  ago, led to the extinction of up to 96% of all marine life and 70%  of all other life, including insects. "}, {"url": "https://en.wikipedia.org/wiki/Extinction_event", "passage_text": "1 Earth's largest extinction killed 57% of all families, 83% of all genera and 90% to 96% of all species (53% of marine families, 84% of marine genera, about 96% of all marine species and an estimated 70% of land species, including insects). 2  The highly successful marine arthropod, the trilobite became extinct. 1 This extinction event lasted perhaps as long as 20 million years, and there is evidence for a series of extinction pulses within this period. 2  Ordovician–Silurian extinction events (End Ordovician or O-S): 450–440 Ma at the Ordovician-Silurian transition."}, {"url": "https://en.wikipedia.org/wiki/Extinction_event", "passage_text": "An extinction event (also known as a mass extinction or biotic crisis) is a widespread and rapid decrease in the amount of life on Earth. Such an event is identified by a sharp change in the diversity and abundance of multicellular organisms. 1 This extinction event lasted perhaps as long as 20 million years, and there is evidence for a series of extinction pulses within this period. 2  Ordovician–Silurian extinction events (End Ordovician or O-S): 450–440 Ma at the Ordovician-Silurian transition."}, {"url": "http://science.nationalgeographic.com/science/prehistoric-world/mass-extinction/", "passage_text": "An asteroid impact is another possible cause of the extinction, though a telltale crater has yet to be found. Largest Ever Die-Off. The Permian-Triassic extinction event about 250 million years ago was the deadliest: More than 90 percent of all species perished. As new species evolve to fit ever changing ecological niches, older species fade away. But the rate of extinction is far from constant. At least a handful of times in the last 500 million years, 50 to more than 90 percent of all species on Earth have disappeared in a geological blink of the eye. Though these mass extinctions are deadly events, they open up the planet for new life-forms to emerge. Dinosaurs appeared after one of the biggest mass extinction events on Earth, the Permian-Triassic extinction about 250 million years ago"}, {"url": "https://en.wikipedia.org/wiki/Permian%E2%80%93Triassic_extinction_event", "passage_text": "It is the only known mass extinction of insects. Some 57% of all families and 83% of all genera became extinct. Because so much biodiversity was lost, the recovery of life on Earth took significantly longer than after any other extinction event, possibly up to 10 million years. There is evidence for between one to three distinct pulses, or phases, of extinction. There are several proposed mechanisms for the extinctions; the earlier phase was probably due to gradual environmental change, while the latter phase has been argued to be due to a catastrophic event."}, {"url": "http://www.bbc.co.uk/nature/extinction_events", "passage_text": "All life on Earth today is descended from the 4% of species that survived. Triassic-Jurassic mass extinction During the final 18 million years of the Triassic period, there were two or three phases of extinction whose combined effects created the Triassic-Jurassic mass extinction event. "}, {"url": "http://earthsky.org/earth/ocean-acidification-drove-earths-largest-mass-extinction", "passage_text": "Computer artwork via the BBC. The Permian–Triassic mass extinction event is the largest such event to ever to have occurred on Earth. About 90% of all marine species and 70% of all terrestrial species died off during this time. During the Permian–Triassic mass extinction event 252 million years ago, most life on Earth perished. Scientists have now obtained evidence that ocean acidification played a key role in the die-off. The new research was published in the journal Science on April 10, 2015."}, {"url": "http://endangeredspeciesinternational.org/overview.html", "passage_text": "Many species vanished in five cataclysmic mass extinctions and today, 99.9 percent of all species that have existed on Earth are extinct. T he Ordovician-Silurian extinction occurred about 439 million years ago due to a drop in sea levels as glaciers formed followed by rising sea levels as glaciers melted. During this extinction 25 percent of marine families and 60 percent of marine genera (the classification above species) were lost. What is know, however, is that this mass extinction killed 22 percent of marine families and 57 percent of marine genera. T he Permian-Triassic extinction happened about 251 million years ago and was Earths worst mass extinction."}, {"url": "https://en.wikipedia.org/wiki/Permian%E2%80%93Triassic_extinction_event", "passage_text": "The Permian–Triassic extinction event is the most significant event for marine genera, with just over 50% (according to this source) failing to survive. There is evidence for between one to three distinct pulses, or phases, of extinction. There are several proposed mechanisms for the extinctions; the earlier phase was probably due to gradual environmental change, while the latter phase has been argued to be due to a catastrophic event."}]