[{"url": "http://homeguides.sfgate.com/cost-paving-driveway-asphalt-88487.html", "passage_text": "Average Costs Per Square Foot. Depending on the region of the country where you live the cost of a new asphalt paved driveway ranges from $2 to $5 per square foot installed as of 2013, with an average of around $3 to $4 per square foot. These prices include the cost of labor and the gravel base. The cost of materials and labor vary widely from region or area of the country to another. Depending on the region of the country where you live the cost of a new asphalt paved driveway ranges from $2 to $5 per square foot installed as of 2013, with an average of around $3 to $4 per square foot."}, {"url": "http://www.fixasphalt.com/blog/how-much-does-it-cost-to-sealcoat-an-asphalt-parking-lot", "passage_text": "How much does it cost to sealcoat an asphalt parking lot? The average sealcoating cost for an asphalt parking lot with either asphalt or coal tar emulsion pavement sealer ranges from $0.14 - $0.25 per square foot. "}, {"url": "http://www.thisoldhouse.com/toh/article/0,,218415-6,00.html", "passage_text": "Cost: Prices vary considerably by region. Figure on $1 to $2.50 per square foot for the base coat. Geotextile and drains cost extra. Then add $1 to $2.50 per square foot for a plain topcoat, about $3.50 for chip seal or $3 to $5 for a stamped or colored topcoat. If you're putting in a driveway where none existed, add $1 to $2.50 per square foot for an 8- to 10-in. gravel layer beneath the asphalt. Recommendations: Remember that an asphalt topcoat is only as good as the base and lasts longest with proper drainage. "}, {"url": "http://www.answers.com/Q/What_is_the_average_asphalt_paving_cost", "passage_text": "Making the world better, one answer at a time. The average cost for 2 asphalt installed is $ 1.80 sf. It really can vary, a lot of times excavation must be done and also road base needs to be laid down. You're looking at a bill ranging from $1,800 to $2,700 for base work plus asphalt for a 450 square foot driveway. On average it cost $1 per sq.ft per inch of asphalt, just to lay  it. If you are laying 3 inches of asphal … t then expect it to cost  around $3 per sq ft. If you lay 4 inches expect to pay 4 $ per  sq.ft.."}, {"url": "http://www.greatdayimprovements.com/asphalt-vs-concrete-driveways.aspx", "passage_text": "Cost. Ignoring any maintenance costs, asphalt is generally much cheaper to install than concrete. On average, the cost per square foot for asphalt will run between $2.50 to $4.00. Fluctuations in crude oil prices can cause fluctuations in asphalt prices but the price will remain around this range."}, {"url": "http://www.northjersey.com/community-news/home-and-gardening/repair-or-replace-a-damaged-asphalt-driveway-1.683214?page=all", "passage_text": "When the conditions pose a hazard and potential liability, it’s best to replace the entire driveway, McFarlane added. DOLLARS AND SENSE. Cost of demolition, removal and replacement of an existing asphalt driveway runs between $2.50-$5 per square foot, McFarlane said. He added that if a large area is involved it may bring the unit price down. "}, {"url": "http://www.answers.com/Q/What_is_the_average_asphalt_paving_cost", "passage_text": "The average cost for 2 asphalt installed is $ 1.80 sf It really can vary, a lot of times excavation must be done and also road base needs to be laid down. You're looking … at a bill ranging from $1,800 to $2,700 for base work plus asphalt for a 450 square foot driveway. On average it cost $1 per sq.ft per inch of asphalt, just to lay  it. If you are laying 3 inches of asphal … t then expect it to cost  around $3 per sq ft. If you lay 4 inches expect to pay 4 $ per  sq.ft.."}, {"url": "http://www.homewyse.com/services/cost_to_install_asphaltic_concrete_driveway.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Asphaltic Concrete Driveway Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install an Asphaltic Concrete Driveway ranges between $5.08 - $6.96 per square foot* . To estimate costs for your project: 1"}, {"url": "http://ths.gardenweb.com/discussions/2599935/asphalt-driveway-resurfacing-is-167-sf-fair", "passage_text": "An asphalt paver in the Northern VA area just gave me a price quote of $5,495 for applying a 2 1/2 inch layer of state approved asphalt on my 20-year old driveway with 3,285 suare feet, and I'm wondering if this price is fair. That works out to about $1.67 per square foot. "}]