[{"url": "http://www.wisegeek.net/what-is-a-photovoltaic-module.htm", "passage_text": "Light energy in the form of photons is collected by the photovoltaic module. Crystalline silicon cells collect these photons from a range of light frequencies. However, difficulties with the infrared and ultraviolet spectrum limits the processes efficiency. The photons impact the silicon cells and stimulate the electrons."}, {"url": "https://en.wikipedia.org/wiki/Photovoltaic_module", "passage_text": "Solar panel refers to a panel designed to absorb the sun's rays as a source of energy for generating electricity or heating. A photovoltaic (in short PV) module is a packaged, connected assembly of typically 6×10 solar cells."}, {"url": "https://en.wikipedia.org/wiki/Photovoltaic_module", "passage_text": "Solar Photovoltaic panels constitute the solar array of a photovoltaic system that generates and supplies solar electricity in commercial and residential applications. Each module is rated by its DC output power under standard test conditions, and typically ranges from 100 to 365 watts."}, {"url": "http://www.mrsolar.com/what-is-a-solar-panel/", "passage_text": "Solar energy begins with the sun. Solar panels, also known as photovoltaics, are used to convert light from the sun, which is composed of particles of energy called photons, into electricity that can be used to power elecrical loads. Light from the sun is a renewable energy resource which provides clean energy, produced by solar panels."}, {"url": "http://www.dunmore.com/products/solar-back-sheet.html", "passage_text": "The solar cell back sheet is the outermost layer of the PV module. The PV back sheet is designed to protect the inner components of the module, specifically the photovoltaic cells and electrical components from external stresses as well as act as an electric insulator."}, {"url": "http://www.wisegeek.net/what-is-a-photovoltaic-module.htm", "passage_text": "These 10 animal facts will amaze you. A photovoltaic module is a grouping of connected solar cells used to collect energy from solar radiation. Each cell is electrically connected into these modules, which in turn are merged into a panel. When photovoltaic panels are installed at various locations they become known as arrays."}, {"url": "http://www.sunlightelectric.com/pvmodules.php", "passage_text": "The heart of every PV system is the array of photovoltaic modules. Today, the overwhelming majority of PV modules (more than 95%) are crystalline silicon, made from the second most abundant element on earth."}]