[{"url": "http://www.learner.org/courses/essential/life/session2/closer_protist.html", "passage_text": "Plant-like protists make their own food, and many have cell walls made of cellulose. Animal-like protists cannot make their own food and ingest it. Some animal-like protests have “shells,” called tests, which are made of silica or calcium carbonate. Other animal-like protists lack a cell wall or protective test."}, {"url": "http://www.learner.org/courses/essential/life/session2/closer_protist.html", "passage_text": "This group contains plant-like, animal-like, and fungus-like organisms. This grouping is not based on evolutionary relationships but is more a grouping of convenience — the protists are the eukaryotes that aren’t plants, animals, or fungi."}, {"url": "http://jb004.k12.sd.us/MY%20WEBSITE%20INFO/BIOLOGY%201/CHAPTER%2017%20MATERIAL/PROTIST%20OBSERVATION%20LAB%20PART%202.htm", "passage_text": "2. Some protists are heterotrophs, a group of phyla called the protozoa. Heterotrophs get their energy by consuming other organisms. Protists reproduce asexually by binary fission, and a few species are capable of sexual reproduction."}, {"url": "http://www.answers.com/Q/Is_kelp_a_protist", "passage_text": "Actually, it is a protist and it gets nutrients from photosynthesis. Yep, kelps are seaweeds, but they are actually from the Kingdom Protista (i.e. protists). They belong to the Class Phaeophyceae which are protists, not plants (although clearly, they are plant like)."}, {"url": "http://scienceline.ucsb.edu/getkey.php?key=904", "passage_text": "Click Here to return to the search form. To understand how kelp became members of the Protista, one must delve into the convoluted and messy history of systematics. Early attempts at organizing life into a classification system usually separated all organisms as either plants or animals. According to this grouping, kelp and other algae were considered to be very primitive plant forms, along with fungi, molds, and many other types of organisms."}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/P/Protists.html", "passage_text": "1 Because some members of the group (like Euglena) have chloroplasts, these organisms used to be called Euglenophytes, but in fact they are neither plants (phytes) nor animals (zoa). 2  Rather — like the other organisms on this page — they are the living descendants of some of the very earliest eukaryotes."}, {"url": "http://www.answers.com/Q/Is_kelp_a_protist", "passage_text": "The plural of kelp is either kelp or kelps, depending on how you are using it. Non-count nouns like snow, food, kelp, people, sugar, do not usually need a plural form, but i … n certain uses they add an 's' to show that they are groups of groups."}, {"url": "http://www.answers.com/Q/Is_kelp_a_protist", "passage_text": "Protists are organisms that are part of the Protista kingdom. It is a very diverse group, the most in fact, and some examples of protists include kelp, seaweed, & plankton."}]