[{"url": "http://www.ehow.com/info_7756453_old-do-withdraw-ira.html", "passage_text": "Early Withdrawal Penalty. The IRS attempts to encourage long-term savings in IRA accounts by imposing a penalty on withdrawals taken too far before traditional retirement age. In an IRA you must wait until you are at least 59 1/2 years old to avoid this penalty, which amounts to 10 percent of the amount you withdraw. The penalty comes in the form of an additional tax on your Form 1040."}, {"url": "http://www.redeemingriches.com/2010/04/05/ira-withdrawal/", "passage_text": "Your IRA Withdrawal at Age 70 1/2. If you do decide to wait however, you won’t be able to leave that money in your IRA forever. At age 70 1/2 you will be required to take a minimum distribution (also known as RMD, which uses a formula set up by the IRS to determine the amount) and pay taxes on those withdrawals. Your IRA Withdrawal Prior to Age 59 1/2. The general rule is that if you take an IRA withdrawal before 59 1/2 the IRS whacks you with a 10% penalty. So, ideally you need to wait on your IRA withdrawal until you reach that age. As with most IRS rules, there are some exceptions: IRS publication 590 lists these exceptions to the 10% penalty for early IRA withdrawals: 1  You have unreimbursed medical expenses that are more than 7.5% of your adjusted gross income"}, {"url": "http://money.cnn.com/retirement/guide/IRA_Basics.moneymag/index7.htm", "passage_text": "You can also withdraw money from a traditional IRA and avoid paying the 10% penalty if you roll the money over into another qualified retirement account (such as a Roth IRA) within 60 days. But then you wouldn't actually be able to spend it. "}, {"url": "http://money.usnews.com/money/blogs/on-retirement/2013/01/24/401k-and-ira-withdrawal-options-for-early-retirees", "passage_text": "Roth contributions. You can take penalty-free withdrawals from a Roth IRA, if they don’t exceed the amount you contributed and the account is at least 5 years old. But the earnings in the Roth IRA don’t become tax free until you turn 59 ½. And if you take money out, you’ll have reduced its ability to grow. "}, {"url": "http://www.ehow.com/info_7756453_old-do-withdraw-ira.html", "passage_text": "Although you cannot generally take penalty-free distributions from your IRA before age 59 1/2, you must take a distribution once you reach age 70 1/2. Known as a Required Minimum Distribution, or RMD, this amount must be calculated every year (based on IRS figures) and withdrawn by December 31. In an IRA you must wait until you are at least 59 1/2 years old to avoid this penalty, which amounts to 10 percent of the amount you withdraw. The penalty comes in the form of an additional tax on your Form 1040."}, {"url": "http://money.cnn.com/retirement/guide/IRA_Roth.moneymag/index5.htm", "passage_text": "You can take money out of your Roth IRA anytime you want. However, you need to be careful how much you withdraw or you may get stuck with a penalty. In order to make qualified distributions in retirement, you must be at least 59½ years old, and at least five years must have passed since you first began contributing. Well, the IRS views withdrawals from a Roth IRA in the following order: your contributions, money converted from traditional IRAs and finally, investment earnings. For example, let's say your IRA has $100,000 in it, $50,000 of which are contributions and $50,000 of which are"}, {"url": "http://money.usnews.com/money/retirement/articles/2013/09/23/11-ways-to-avoid-the-ira-early-withdrawal-penalty", "passage_text": "+ More. If you withdraw money from your individual retirement account before age 59 1/2, you will generally have to pay a 10 percent early withdrawal penalty in addition to income tax on the amount withdrawn. This means a $5,000 withdrawal taken by a mid-career worker in the 25 percent tax bracket would result in $1,750 in taxes and penalties. But there are a variety of ways to avoid the IRA early withdrawal penalty if you meet specific criteria: Turn age 59 1/2. Once you turn age 59 1/2, you can withdraw any amount from your IRA without having to pay the 10 percent penalty. But regular income tax will still be due on each withdrawal. IRA distributions are not required until after age 70 1/2. [Read: How to Save for Retirement on a Small Salary.]."}, {"url": "http://www.ehow.com/info_7756453_old-do-withdraw-ira.html", "passage_text": "In addition to any penalties you may owe, almost all IRA distributions are subject to income taxation. For example, if you take an IRA withdrawal at the age of 50 to pay some household bills, you would owe both income tax and the 10 percent penalty. In an IRA you must wait until you are at least 59 1/2 years old to avoid this penalty, which amounts to 10 percent of the amount you withdraw. The penalty comes in the form of an additional tax on your Form 1040."}]