[{"url": "http://www.homedit.com/urban-jungle-turn-terrace-oasis/", "passage_text": "If you’re living on the top floor then you can open up the space and make a beautiful terrace and even a small garden. Include big plants in your design to create a refreshing decor. Décor view in. Gallery use green walls to completely transform a roof. Terrace turn it into a charming garden like your grandma used to. have If you’re living on the top floor then you can open up the space and make a beautiful terrace and even a small garden. Include big plants in your design to create a refreshing decor. Décor view in. Gallery use green walls to completely transform a roof. terrace"}, {"url": "http://www.homedit.com/urban-jungle-turn-terrace-oasis/", "passage_text": "You can plant different types of flowers, for each season and change the decor décor of your urban garden a few times a year without basically doing. Anything view in. Gallery a, terrace no matter how, small offers you the possibility to create a fresh and green decor décor and transform it into. a garden If you’re living on the top floor then you can open up the space and make a beautiful terrace and even a small garden. Include big plants in your design to create a refreshing decor. Décor view in. Gallery use green walls to completely transform a roof. terrace"}, {"url": "http://www.hgtv.com/design/outdoor-design/landscaping-and-hardscaping/how-to-grow-a-balcony-garden", "passage_text": "The greenery, colorful flower combinations and the bright-striped awnings all create a bold statement against the white walls of these balcony homes. No matter where you live, you can find space for an outdoor garden. If you're a city dweller, you can transform your balcony into more than just barbecue or bike storage. You can create a soothing outdoor retreat by selecting containers and plants that use every available bit of growing space."}, {"url": "http://www.gardenista.com/posts/ask-the-expert-the-balcony-gardener-isabelle-palmer/", "passage_text": "Here, her upper balcony as seen from the street. 1. Think of your balcony as an extension of your indoor space. A balcony has the greatest impact as an extension of indoor space, and it's important to ask yourself how you will want to use your balcony in relation to your indoor space. After you've installed and planted your balcony garden, any time you can save on maintenance means more time to sit back, relax, and enjoy it. Some time-saving watering tips include: 1  Using a hose pipe to water will be faster than using a watering can."}, {"url": "http://www.mysanantonio.com/life/article/Transform-your-balcony-or-terrace-into-a-3619655.php", "passage_text": "New Yorkers grow lettuce and tomatoes on fire escapes. New Orleanians have elevated balcony gardening to an art form. Urban Texans increasingly are joining the small-gardening movement, transforming balconies and terraces into upstairs green spaces. Patrick Murphy of the Perennial Potter makes great use of a small space on the balcony of a condo at the Broadway."}, {"url": "http://www.apartmenttherapy.com/5-tips-for-starting-your-balcony-garden-escape-194478", "passage_text": "Pin it. Inspired by memories of my grandfather's amazing gardens, paired with a love of the novel, The Secret Garden, I set out to transform my 100 square foot balcony into a Secret Victory Garden Lounge to call my own. "}, {"url": "http://www.gardenista.com/posts/ask-the-expert-the-balcony-gardener-isabelle-palmer/", "passage_text": "10. Make your garden low maintenance. After you've installed and planted your balcony garden, any time you can save on maintenance means more time to sit back, relax, and enjoy it. Some time-saving watering tips include: 1  Using a hose pipe to water will be faster than using a watering can."}, {"url": "http://www.minimalisti.com/home-garden-design/05/awesome-balcony-garden-ideas.html", "passage_text": "How to transform a boring balcony – awesome balcony garden ideas. Home & Garden. The warm weather when we can spend much time in the air and sun is finally here. You can have your place with a natural environment, of course, on the balcony! It can turn into a beautiful mini garden, a green oasis in the city. Your balcony could easily be transformed into a beautiful garden. It takes just seeds, soil, pots and a desire to decorate the balcony with beautiful plants and flowers. Have a look at these fascinating balcony garden ideas and get inspired for your own charming city oasis. Adding a few extra elements will add a unique character to your balcony garden. You can add stones and other decorative elements – a mini pond or a mini fountain. Large balconies can be divided into separate areas – for dining, lounge area, etc."}, {"url": "http://www.gardenista.com/posts/ask-the-expert-the-balcony-gardener-isabelle-palmer/", "passage_text": "On a recent visit to her balcony garden, she shared her top ten tips for transforming an empty balcony into a flourishing garden. Photographs by Jonathan Gooch for Gardenista. Above: Palmer's flat is on the top two floors of a converted Congregational Church with a balcony on each floor. After you've installed and planted your balcony garden, any time you can save on maintenance means more time to sit back, relax, and enjoy it. Some time-saving watering tips include: 1  Using a hose pipe to water will be faster than using a watering can."}]