[{"url": "http://www.uky.edu/~drlane/capstone/group/funcpsp.html", "passage_text": "Explanation of Theory: Functional Perspective claims that there are four functions for effective decision making which include an analysis of the problem, goal setting, identification of alternatives, and an evaluation of positive and negative characteristics, all of which are equally important. Epistemological Assumptions: This theory is based on one truth. There is a system that groups will follow. Axiological Assumptions: This theory is value-neutral because there is a four-step system that groups follow to rationalize their communication, regardless of their original values."}, {"url": "http://www.academia.edu/362874/Structural_Functional_Perspective_in_Sociology", "passage_text": "Structural Functionalism is a broad perspective in sociology and anthropology which interprets society as structure with interrelated parts. Functionalism addresses the society as a whole in terms of function of its constituent elements such as norms, customs, traditions, institutions etc. "}, {"url": "http://www.mhhe.com/socscience/comm/group/students/theory.htm", "passage_text": "Symbolic Convergence Theory is very different from the Functional Theory of group communication. One strength of symbolic convergence theory is the focus on group identity and the development of group consciousness. This section of the website provides an overview of four theories of small group communication: Functional Theory, Symbolic Convergence Theory, Structuration Theory, and the Naturalistic Paradigm."}, {"url": "http://www.mhhe.com/socscience/comm/group/students/theory.htm", "passage_text": "Symbolic Convergence Theory studies the sensemaking function of communication. Symbolic refers to verbal and nonverbal messages and convergence refers to shared understanding and meaning. In small groups, members develop private code words and signals that only those inside the group understand. This section of the website provides an overview of four theories of small group communication: Functional Theory, Symbolic Convergence Theory, Structuration Theory, and the Naturalistic Paradigm."}, {"url": "http://www.mhhe.com/socscience/comm/group/instructors/theory.htm", "passage_text": "1 Functional Theory. 2  The functional approach to small group communication is concerned with the results or outcomes of group behaviors and structures. 3  Research conducted from this perspective suggests that several conditions must exist for group members to make appropriate decisions and effectively solve problems. Examine a small group communication case study through multiple lenses.. Your two primary objectives are to analyze and evaluate the group's communication and performance. Guidelines. You will analyze and evaluate the case using three perspectives: systems theory and two other theories of your choice."}, {"url": "http://www.merriam-webster.com/dictionary/functionalism", "passage_text": ": a theory that stresses the interdependence of the patterns and institutions of a society and their interaction in maintaining cultural and social unity. 4. : a doctrine or practice that emphasizes practical utility or functional relations. — func·tion·al·ist \\-shnə-list, -shə-nə-list\\ noun. Definition of FUNCTIONALISM. 1. : a late 19th century to early 20th century American school of psychology concerned especially with how the mind functions to adapt the individual to the environment — compare structuralism 1. 2. : a philosophy of design (as in architecture) holding that form should be adapted to use, material, and structure."}, {"url": "http://www.uky.edu/~drlane/capstone/group/funcpsp.html", "passage_text": "- There are some losses due to the process of group decision making. - Promotive communication keeps the group moving along, yet some members can be disruptive or even counteractive. - Most of the research on this theory has been some in a controlled setting. Epistemological Assumptions: This theory is based on one truth. There is a system that groups will follow. Axiological Assumptions: This theory is value-neutral because there is a four-step system that groups follow to rationalize their communication, regardless of their original values."}, {"url": "https://en.wikipedia.org/wiki/Structural_functionalism", "passage_text": "Structural functionalism, or simply functionalism, is a framework for building theory that sees society as a complex system whose parts work together to promote solidarity and stability. Functionalism addresses society as a whole in terms of the function of its constituent elements; namely norms, customs, traditions, and institutions."}, {"url": "http://www.mhhe.com/socscience/comm/group/students/theory.htm", "passage_text": "So while systems theory encourages us to examine the ways in which group members and groups are inter-related, it ignores other aspects of small group communication that are equally as important. In this module we'll briefly examine other theories of small group communication. This section of the website provides an overview of four theories of small group communication: Functional Theory, Symbolic Convergence Theory, Structuration Theory, and the Naturalistic Paradigm."}, {"url": "http://www.mhhe.com/socscience/comm/group/students/theory.htm", "passage_text": "The functional approach to small group communication has several strengths. Unlike systems theory, functional theory is prescriptive in nature. That is, it suggests that critical thinking, sound logic, informed discussion, and systematic procedures are essential to effective decision making and problem solving. This section of the website provides an overview of four theories of small group communication: Functional Theory, Symbolic Convergence Theory, Structuration Theory, and the Naturalistic Paradigm."}]