[{"url": "https://uk.answers.yahoo.com/question/index?qid=20100107074543AAfrpSD", "passage_text": "Answers. Best Answer: The stomach walls are made of the following layers: The Mucosa (first main layer) consists of epithelium tissue and a thin layer of smooth muscle and connective tissue, separating the mucosa from the next layer. The Muscularis externa (next layer) has three layers of smooth muscle. The stomach is made of a number of tissues, including epithelium, (including glandular epithelium), mucosa, connective tissues, and sheets of smooth muscle. I suggest you look for pictures or diagrams..."}, {"url": "http://www.answers.com/Q/What_tissue_types_are_found_in_the_stomach", "passage_text": "Cardiac tissue is found in the heart. The types of tissues that make up your heart are cardiac muscle tissue, nerve tissue and blood tissue. The cardiac muscle tissue contract … s, making the heart pump. The nerve tissue brings messages that tell the heart how fast to beat. The blood tissue is carried from the heart to other organs of the body. The Mucosa tissue and the goblet cells are the type of tissue that  are found in the inner lining of the stomach."}, {"url": "http://www.wisegeek.org/what-is-stomach-tissue.htm", "passage_text": "Stomach tissue, also called gastric tissue, forms the stomach organ. The stomach is composed of many layers of tissue and glands, and it is an essential part of digestion, which provides fuel for proper functioning of the rest of the body. Just outside the epithelial tissue is the lamina propria. This is a thin layer of loose connective tissue that contains a moist lining of mucous membranes. Together with the epithelial tissue, it makes up the mucosa, which secretes gastric acid to aid in digestion. It also absorbs nutrients from the stomach."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20101018065547AA38A84", "passage_text": "Answers. Best Answer: rugae or folds give the stomach its well-known ability to enlarge when engorged with food. the outermost layer of these folds is mucus which helps protect the tissues below from the harsh environment of the stomach. The innermost layer is a lining of simple columnar epithelium. This type of epithelium provides the greatest surface area for absorption or secretion. In the stomach the epithelial cells exposed to the lumen are primarily constructed to resist digestion by the lumen contents. "}, {"url": "http://www.wisegeek.org/what-is-stomach-tissue.htm", "passage_text": "Fibrous connective tissue is mostly made of proteins and water, and ligaments and tendons are also made of it. In the stomach, its primary purpose is to separate the mucosa from the smooth muscle layer of the stomach wall. Just outside the epithelial tissue is the lamina propria. This is a thin layer of loose connective tissue that contains a moist lining of mucous membranes. Together with the epithelial tissue, it makes up the mucosa, which secretes gastric acid to aid in digestion. It also absorbs nutrients from the stomach."}, {"url": "http://www.merckmanuals.com/home/fundamentals/the-human-body/tissues-and-organs", "passage_text": "Inside the Torso. The body's functions are conducted by organs. Each organ is a recognizable structure (for example, the heart, lungs, liver, eyes, and stomach) that performs specific functions. An organ is made of several types of tissue and therefore several types of cells (see Cells)."}, {"url": "http://www.beaconlearningcenter.com/documents/1966_3268.pdf", "passage_text": "The muscles of our lungs, stomach, and intestines are made of smooth muscle tissue. Cardiac muscle tissue is the third type of muscle tissue. Cardiac muscle tissue makes our hearts. Organs are groups of tissues that work together to do a job. Our skin is made of hair tissue, oil and sweat gland tissues, nerve tissue, blood tissue, and many other tissues to make the organ called skin."}, {"url": "http://www.wisegeek.org/what-is-stomach-tissue.htm", "passage_text": "Epithelial tissue also protects the organs. This tissue is not only in the stomach, but it can also be found surrounding the body's organs, in the outer layer of the skin, and on the inside of the mouth. Just outside the epithelial tissue is the lamina propria. This is a thin layer of loose connective tissue that contains a moist lining of mucous membranes. Together with the epithelial tissue, it makes up the mucosa, which secretes gastric acid to aid in digestion. It also absorbs nutrients from the stomach."}]