[{"url": "http://study.com/articles/Be_an_American_Sign_Language_Interpreter_Salary_and_Career_Info.html", "passage_text": "Salary Information for ASL Interpreters. In May 2013, translators and interpreters across all fields, including ASL and foreign language translators and interpreters, earned an average annual income of $47,920, the U.S. Bureau of Labor Statistics (BLS) reports (www.bls.gov). Source: *U.S. Bureau of Labor Statistic"}, {"url": "http://learn.org/articles/Spanish_Interpreter_Your_Career_and_Salary_Questions_Answered.html", "passage_text": "The median annual salary for interpreters and translators as of May 2009, according to the U.S. Bureau of Labor Statistics, was $45,700. Annual reported wages for the bottom tenth percentile were $22,810 and the top tenth percentile were $74,150 (www.bls.gov). "}, {"url": "http://www.payscale.com/research/US/Job=Interpreter/Hourly_Rate", "passage_text": "(United States). The average pay for an Interpreter is $19.74 per hour. Most people move on to other jobs if they have more than 20 years' experience in this field. Experience has a moderate effect on salary for this job"}, {"url": "http://money.usnews.com/careers/best-jobs/interpreter-and-translator/salary", "passage_text": "However, the average salary of interpreters and translators is higher than that of exterminators ($32,480) and garbage collectors ($35,280). The highest paid in the interpreter and translator profession work in the metropolitan areas of District of Columbia, Bethesda, Maryland, and Augusta, Georgia. The Blacksburg, Virginia area also pays well, as does the city of Columbus, Georgia."}, {"url": "http://money.usnews.com/careers/best-jobs/interpreter-and-translator/salary", "passage_text": "Salary Outlook. According to the BLS, interpreters and translators earned a median annual salary of $42,420 in 2013. The best-paid earned more than $77,140, while the lowest-paid earned less than $22,180. The highest paid in the interpreter and translator profession work in the metropolitan areas of District of Columbia, Bethesda, Maryland, and Augusta, Georgia. The Blacksburg, Virginia area also pays well, as does the city of Columbus, Georgia."}, {"url": "http://money.usnews.com/careers/best-jobs/interpreter-and-translator", "passage_text": "Salary. According to the BLS, interpreters and translators earned a median annual salary of $42,420 in 2013. The best-paid earned more than $77,140, while the lowest-paid earned less than $22,180. "}, {"url": "http://money.usnews.com/careers/best-jobs/interpreter-and-translator/salary", "passage_text": "According to the BLS, interpreters and translators earned a median annual salary of $42,420 in 2013. The highest paid in the interpreter and translator profession work in the metropolitan areas of District of Columbia, Bethesda, Maryland, and Augusta, Georgia. The Blacksburg, Virginia area also pays well, as does the city of Columbus, Georgia."}, {"url": "http://money.usnews.com/careers/best-jobs/interpreter-and-translator/salary", "passage_text": "$53,410. With an average salary of $47,920 per year, interpreters and translators earn less money than similar professions, such as clinical social workers ($52,520), middle school teachers ($56,630) and school psychologists ($72,710). The highest paid in the interpreter and translator profession work in the metropolitan areas of District of Columbia, Bethesda, Maryland, and Augusta, Georgia. The Blacksburg, Virginia area also pays well, as does the city of Columbus, Georgia."}, {"url": "https://www.recruiter.com/salaries/interpreters-and-translators-salary/", "passage_text": "An Interpreter or Translator will normally get an average salary ranging from 40000 to 60000 based on experience and talent. Interpreters and Translators can expect a wage of Fifty Four Thousand Four Hundred dollars per year. Employees with these jobs are compensated at the highest average salary in Information, where they can receive average pay scales of $62620. The national wage distribution is shown below. To overlay local salaries for an Interpreter or Translator, please select your state."}, {"url": "https://www.recruiter.com/salaries/interpreters-and-translators-salary/", "passage_text": "Interpreters and Translators are paid the highest in Virginia, which has average pay scales of approximately $69360. Employees with these jobs are compensated at the highest average salary in Information, where they can receive average pay scales of $62620. The national wage distribution is shown below. To overlay local salaries for an Interpreter or Translator, please select your state."}]