[{"url": "http://www.muslimconverts.com/hajj/", "passage_text": "You have no partner.”]. The Hajj Allaah says (interpretation of the meaning): Hajj takes place on the 12th month of the Islamic Calendar is called Dhul Hijjah. The first 10 days of Dhul Hijjah are the best 10 days of the whole year. Before we look at what Hajj is. Let us first look at the importance of the first 10 daysas there are special things that all Muslims can do during these 10 days and the 3 days that follow them, even if a person is not on the Hajj. "}, {"url": "https://en.wikipedia.org/wiki/Hajj", "passage_text": "The Hajj is associated with the life of Islamic prophet Muhammad from the 7th century, but the ritual of pilgrimage to Mecca is considered by Muslims to stretch back thousands of years to the time of Abraham. Thus, each year in the Gregorian calendar, the pilgrimage starts eleven days (sometimes ten days) earlier than the preceding year. This makes it possible for the Hajj season to fall twice in one Gregorian year, and it does so every 33 years."}, {"url": "http://www.islamicbulletin.org/newsletters/issue_8/hajj.aspx", "passage_text": "The Hajj--the Pilgrimage to Mecca--is essentially a series of rites performed in and near Mecca, the holiest of the three holy cities of Islam--Mecca, Medina and Jerusalem. For the duration of the Hajj, Mecca and the Sanctuary that surrounds it have a special status. To cross the frontiers of the Haram--which lie outside Mecca between three and 18 miles from the Ka'bah--pilgrims from outside Saudi Arabia must now have a special Hajj visa in their passports."}, {"url": "http://www.islamicbulletin.org/newsletters/issue_8/hajj.aspx", "passage_text": "The Hajj must be made between the eighth and the 13th days of the 12th month (called Dhu al-Hijjah) of the Muslim lunar year. In a general sense, the Pilgrimage begins with the donning of the Ihram, a white seamless garment. For the duration of the Hajj, Mecca and the Sanctuary that surrounds it have a special status. To cross the frontiers of the Haram--which lie outside Mecca between three and 18 miles from the Ka'bah--pilgrims from outside Saudi Arabia must now have a special Hajj visa in their passports."}, {"url": "http://ummah.com/forum/showthread.php?261177-How-long-does-Hajj-last", "passage_text": "AAWRWB The actual Hajj days are only 6 days but with the majority of Hajj tours you will be in Saudi for around 2-3 weeks. Once you have decided on which operator you travel with, you will you have your exact travel dates. As an example this was my itinerary for Hajj 2009..... Assalamalikum hope you are al ok inshallah, just wanted to ask how long hajj will last so that I can inshalalh book the correct tiem of work. Jazakallah khairun. Have Sabr as this life is a big test...it is a prision for the believer and paradise for the unbelievers....."}, {"url": "http://www.religionfacts.com/hajj", "passage_text": "The second stage of the hajj takes place between the 8th and 12th days of Dhu al-Hijja, beginning with a sermon (khutba) at the mosque on the 7th day. The hajj is commanded in the Quran - And pilgrimage to the House is a duty unto God for mankind, for him who can find the way thither (3:97) - and its rites were established by Muhammad, but Muslim tradition dates it back to Adam and Abraham, who were instructed by angels in the performance of the rites."}, {"url": "http://www.religioustolerance.org/isla1.htm", "passage_text": "On this first day of the Hajj, the pilgrims walk a few miles to Mina and camp there overnight. This will occur about 2000-MAR-14. It falls on a date about 11 days earlier each year. The pilgrims spend the  Day of Arafah  (ninth day of Dhul-Hijjah) in Arafah, an empty plain. If one assumes that Muslims go on Hajj a maximum of once during their lifetime, that the number of Muslims in America are about 6.5 million, and that the typical age span for pilgrims is 60 years, then fewer than 10% of American Muslims take part in the pilgrimage. The Council on Islamic Education states:"}, {"url": "https://en.wikipedia.org/wiki/Hajj", "passage_text": "The pilgrimage occurs from the 8th to 12th (or in some cases 13th) of Dhu al-Hijjah, the last month of the Islamic calendar. Because the Islamic calendar is lunar and the Islamic year is about eleven days shorter than the Gregorian year, the Gregorian date of Hajj changes from year to year. Thus, each year in the Gregorian calendar, the pilgrimage starts eleven days (sometimes ten days) earlier than the preceding year. This makes it possible for the Hajj season to fall twice in one Gregorian year, and it does so every 33 years."}, {"url": "http://content.time.com/time/world/article/0,8599,1864624,00.html", "passage_text": "This year, the Hajj starts Nov. 25; it takes place annually between the 8th and 12th days of Dhu-al-Hijjah, the final month of the lunar Islamic calendar, a time when God's spirit is believed to be closest to earth. "}, {"url": "http://www.religioustolerance.org/isla1.htm", "passage_text": "This is a pilgrimage to Makkah (Mecca) in Saudi Arabia. Approximately two million Muslims went in 1999, of which about one million were from Saudi Arabia, and 6,000 were from the U.S. 1 Council on American-Islamic Relations estimated in 2006 that  some 10,000 American Muslims go on Hajj each year. If one assumes that Muslims go on Hajj a maximum of once during their lifetime, that the number of Muslims in America are about 6.5 million, and that the typical age span for pilgrims is 60 years, then fewer than 10% of American Muslims take part in the pilgrimage. The Council on Islamic Education states:"}]