[{"url": "http://www.interest.com/retirement-planning/news/6-step-guide-when-to-start-collecting-social-security/", "passage_text": "Yes, you'll be getting less, but you'll also start collecting earlier, and you might be surprised how long it takes to make up the difference. The government uses the example of someone who can receive $750 a month at 62 or $1,000 a month at a full retirement age of 66. A person starting early earns $3,000 less a year, but he or she also has collected $36,000 in benefits by age 66. It will take 12 years, until age 78, to make up that difference. Step 3."}, {"url": "http://ssa.gov/planners/survivors/ifyou2.html", "passage_text": "If you are the widow or widower of a person who worked long enough under Social Security, you can: receive full benefits at full retirement age for survivors or reduced benefits as early as age 60."}, {"url": "http://www.gov.je/Benefits/PensionsRetirement/Pages/HowPensionWorks.aspx", "passage_text": "Requirements for claiming a pension. To get a pension, you must have paid contributions for at least four and a half years. To get a pension at the full rate (100%), you must have paid or been credited with at total of 45 years' worth of contributions. If your contribution record is 80% full, you'll be paid 80% of the standard rate of pension."}, {"url": "http://www.ssdrc.com/disabilityquestions1-7.html", "passage_text": "Following an approval, however, how long can a person receive disability benefits? The answer is indefinitely, depending on certain factors. The factors that affect an individual's entitlement to a monthly Social Security disability benefit or SSI benefit, are work activity, or indications of medical improvement."}, {"url": "http://www.disabilitysecrets.com/page7-11.html", "passage_text": "Generally, if you begin to make more than $1,090 per month (the SGA amount in 2015), your benefits will be suspended (blind people can make a bit more). However, there are programs where you can try working for a period of time without jeopardizing your right to collect benefits, called trial work."}, {"url": "http://www.disabilitysecrets.com/page7-11.html", "passage_text": "Once your application for Social Security disability benefits has been approved, you can potentially receive disability benefits up to the point at which you reach retirement age, unless there is a reason they should stop."}]