[{"url": "http://www.webmd.com/cancer/what-is-carcinoma", "passage_text": "Squamous cell carcinoma. Most people think of skin cancer when they hear the words squamous cell carcinoma.. And it is true that this type of carcinoma often shows up on the skin. But squamous cell carcinoma can also be found in other parts of the body, such as cells lining: 1  Certain organs. 2  Digestive tract."}, {"url": "http://www.cancer.org/cancer/lungcancer-non-smallcell/detailedguide/non-small-cell-lung-cancer-what-is-non-small-cell-lung-cancer", "passage_text": "People with a type of adenocarcinoma called adenocarcinoma in situ (previously called bronchioloalveolar carcinoma) tend to have a better outlook (prognosis) than those with other types of lung cancer. Large cell (undifferentiated) carcinoma: This type of cancer accounts for about 10% to 15% of lung cancers. (If a lung cancer has some cells with characteristics of SCLC and other cells with characteristics of NSCLC it is called a combined small cell/non-small cell cancer. This is uncommon.). These 2 types of lung cancer are treated very differently. This document focuses on non-small cell"}, {"url": "http://www.cancercenter.com/terms/adenocarcinoma/", "passage_text": "Adenocarcinoma is a type of cancer that forms in mucus-secreting glands throughout the body. It can occur in many different places in the body, and is most prevalent in the following cancer types: 1  Lung cancer: Non-small cell lung cancer accounts for 80 percent of lung cancers, and adenocarcinoma is the most common type. 1 Surgery: Adenocarcinoma is often treated with surgical removal of cancerous glandular tissue, as well as some surrounding tissue. 2  Minimally invasive surgical treatment methods can help to reduce healing time and minimize the risk of infection after surgery."}, {"url": "http://www.news-medical.net/health/What-is-an-Adenocarcinoma.aspx", "passage_text": "Adenocarcinoma is a cancer originating in glandular tissue. The tissues affected are part of a larger tissue category known as epithelial. Epithelial tissues line skin, glands, cavities of organs etc. This epithelium comes from the ectoderm, endoderm and mesoderm in the fetus. The leading cancer of the colon is adenocarcinoma, and adenocarcinomas are extremely common in the lungs. Other organs that may be affected by adenocarcinoma include: 1  the cervix. 2  pancreas. 3  prostate. 4  stomach. 5  thyroid"}, {"url": "http://www.webmd.com/cancer/what-is-carcinoma", "passage_text": "Not all cancers are carcinoma. Other types of cancer that aren't carcinomas invade the body in different ways. Those cancers begin in other types of tissue, such as: 1  Bone. 2  Blood vessels. 3  Immune system cells. 4  Brain. 5  Spinal cord. And it is true that this type of carcinoma often shows up on the skin. But squamous cell carcinoma can also be found in other parts of the body, such as cells lining: 1  Certain organs. 2  Digestive tract."}, {"url": "https://en.wikipedia.org/wiki/Carcinoma", "passage_text": "Carcinoma is a type of cancer that develops from epithelial cells. Specifically, a carcinoma is a cancer that begins in a tissue that lines the inner or outer surfaces of the body, and that generally arises from cells originating in the endodermal or ectodermal germ layer during embryogenesis. The term carcinoma has also come to encompass malignant tumors composed of transformed cells whose origin or developmental lineage is unknown (see cancer of unknown primary origin (CUP)), but that possess certain specific molecular, cellular, and histological characteristics typical of"}, {"url": "http://www.webmd.com/cancer/what-is-carcinoma?page=2", "passage_text": "Adenocarcinoma. This is a type of carcinoma that starts in cells called glandular cells.. These cells make mucus and other fluids. The glandular cells are found in different organs in your body. Adenocarcinomas can occur in different parts of the body. Some examples of cancers that can be adenocarcinomas include: 1  Breast cancer."}, {"url": "http://www.webmd.com/cancer/what-is-carcinoma", "passage_text": "In this article. Carcinoma is a type of cancer that starts in cells that make up the skin or the tissue lining organs, such as the liver or kidneys. Like other types of cancer, carcinomas are abnormal cells that divide without control. They are able to spread to other parts of the body, but don't always. And it is true that this type of carcinoma often shows up on the skin. But squamous cell carcinoma can also be found in other parts of the body, such as cells lining: 1  Certain organs. 2  Digestive tract."}, {"url": "http://www.cancercenter.com/terms/adenocarcinoma/", "passage_text": "1 Prostate cancer: Cancer that forms in the prostate gland is typically an adenocarcinoma, which makes up 99 percent of all prostate cancers. 2  Pancreatic cancer: Exocrine pancreatic cancer tumors are called adenocarcinomas. 1 Surgery: Adenocarcinoma is often treated with surgical removal of cancerous glandular tissue, as well as some surrounding tissue. 2  Minimally invasive surgical treatment methods can help to reduce healing time and minimize the risk of infection after surgery."}]