[{"url": "http://www.bloodpressureuk.org/BloodPressureandyou/Yourlifestyle/Beingactive", "passage_text": "Main Content: Exercise & activity lower blood pressure. Blood pressure and exercise. If you have high blood pressure, your doctor or nurse may suggest that you try to become more active to lower it. However, you may be worried that regular exercise will increase your blood pressure to dangerous levels. It is true that physical activity (exercise) will cause your blood pressure to rise for a short time."}, {"url": "http://www.webmd.com/hypertension-high-blood-pressure/safe-exercise-tips", "passage_text": "In this article. Making exercise a habit can help lower your blood pressure. It also gives you more energy and is a great way to ease stress and feel better. Check in with your doctor first if you're not already active now. They'll make sure you're ready for exercise."}, {"url": "http://www.medicinenet.com/lowering_blood_pressure_pictures_slideshow/article.htm", "passage_text": "High blood pressure increases the risk of heart disease and stroke. High blood pressure is medically referred to as hypertension. Keys to the treatment of high blood pressure are exercise, weight management, and a healthy diet. In fact, exercising makes blood pressure medications more effective."}, {"url": "http://www.webmd.com/hypertension-high-blood-pressure/ss/slideshow-lowering-bp-tips", "passage_text": "Beyond Exercise: The DASH Diet. You can lower your systolic blood pressure (the top number) by switching to the DASH diet. The DASH diet is based on 2,000 calories a day. It's rich in fruits, vegetables, and low-fat dairy products. It's also low in saturated fat, cholesterol, and total fat."}, {"url": "http://www.webmd.com/hypertension-high-blood-pressure/ss/slideshow-lowering-bp-tips", "passage_text": "Exercise and High Blood Pressure. Exercise is one of the keys to lower your blood pressure. Working out also boosts the effectiveness of blood pressure medication if you're already being treated for hypertension."}, {"url": "http://www.webmd.com/hypertension-high-blood-pressure/ss/slideshow-lowering-bp-tips", "passage_text": "Doing aerobic exercise (cardio) is good for your blood pressure. Swimming is a gentle way to do it. Go for 30 minutes, or work up to that amount if that's too much right now. Do something that's moderate in intensity -- like brisk walking -- for at least 30 minutes a day, 5 or more days a week."}, {"url": "http://www.webmd.com/hypertension-high-blood-pressure/safe-exercise-tips", "passage_text": "1 Cardiovascular, or aerobic, exercise can help lower your blood pressure and make your heart stronger. 2  Examples include walking, jogging, jumping rope, bicycling (stationary or outdoor), cross-country skiing, skating, rowing, high-or low-impact aerobics, swimming, and water aerobics."}]