[{"url": "https://en.wikipedia.org/wiki/Criticism_of_Franklin_D._Roosevelt", "passage_text": "As president from 1933 to 1945, Roosevelt was the target of sharp criticism from both left and right. Both during and after his presidential terms, and continuing today, there has been much criticism of Franklin D. Roosevelt. When, in 1981, Reagan was quoted in The New York Times saying that fascism was admired by many New Dealers (not including Roosevelt), he came under heavy criticism, for Reagan had greatly admired Roosevelt and was a leading New Dealer in Hollywood."}, {"url": "http://www.weegy.com/?ConversationId=C07565A4", "passage_text": "D) made people dependent on the federal government. A major criticism of President Franklin D. Roosevelt’s programs to combat the Great Depression was that these programs made people dependent on the Federal Government. Expert answered| migzptz |Points 7363|"}, {"url": "https://www.whitehouse.gov/1600/presidents/theodoreroosevelt", "passage_text": "With the assassination of President McKinley, Theodore Roosevelt, not quite 43, became the youngest President in the Nation's history. He brought new excitement and power to the Presidency, as he vigorously led Congress and the American public toward progressive reforms and a strong foreign policy. With the assassination of President William McKinley, Theodore Roosevelt, not quite 43, became the 26th and youngest President in the Nation's history (1901-1909)."}, {"url": "http://www.ushistory.org/us/49f.asp", "passage_text": "Father Charles Coughlin's fiery radio broadcasts reached an estimated 40,000,000 listeners and attempted to sway popular opinion away from Franklin D. Roosevelt and his New Deal policies. FDR was a President, not a king. His goals were ambitious and extensive, and while he had many supporters, his enemies were legion. Liberals and radicals attacked from the left for not providing enough relief and for maintaining the fundamental aspects of capitalism. Despite big numbers at the ballot booth, Roosevelt needed to temper his objectives with the spirit of compromise and hope that his plans were popular enough to weather criticism. Friends and enemies alike had to admit that FDR was a political genius."}, {"url": "https://www.whitehouse.gov/1600/presidents/franklindroosevelt", "passage_text": "On St. Patrick's Day, 1905, he married Eleanor Roosevelt. Following the example of his fifth cousin, President Theodore Roosevelt, whom he greatly admired, Franklin D. Roosevelt entered public service through politics, but as a Democrat. He won election to the New York Senate in 1910. "}, {"url": "http://www.iiipublishing.com/blog/2009/10/blog_10_15_2009.html", "passage_text": "Popular pages: Franklin Delano Roosevelt was President of the United States of America from March 1933 until he died in office on April 12, 1945, a few days before Germany surrendered. He started office during the Great Depression and died towards the end of World War II. In addition, the defeat of America's World War II enemies, Germany under Adolf Hitler, Italy under Benito Mussolini, and Japan under Hideki Tojo, is attributed to Roosevelt's leadership, and is placed beyond criticism."}, {"url": "https://en.wikipedia.org/wiki/Franklin_D._Roosevelt", "passage_text": "Franklin Delano Roosevelt (/ˈroʊzəvəlt/ , his own pronunciation, or /ˈroʊzəvɛlt/) (January 30, 1882 – April 12, 1945), commonly known by his initials FDR, was an American statesman and political leader who served as the 32nd President of the United States. Roosevelt defeated incumbent Republican president Herbert Hoover in November 1932, at the depth of the Great Depression. Energized by his personal victory over polio, FDR used his persistent optimism and activism to renew the national spirit."}, {"url": "http://www.bbc.co.uk/timelines/zg4pfg8", "passage_text": "That man in the White House. Franklin D Roosevelt (or FDR) is the longest serving president in US history. His 12 years in office spanned two of the 20th Century’s greatest disasters – the Great Depression and the Second World War. "}, {"url": "http://www.weegy.com/?ConversationId=C07565A4", "passage_text": "A major criticism of President Franklin D. Roosevelt's programs to combat the Great Depression was that these programs A) reduced the power of the federal government. B) provided too much. protection for big business. C) ignored the plight of homeowners with mortgages. A major criticism of President Franklin D. Roosevelt’s programs to combat the Great Depression was that these programs made people dependent on the Federal Government."}]