[{"url": "http://www.quickbabynames.com/meaning-of-Bastian.html", "passage_text": "The following names are baby names related to Bastian and are suitable names for brothers and sisters of Bastian: Boys-Columbo, Columbus, Maximilian, Maximus, Girls-Monnie, Nydia, Prudence, Both genders-Francis, Joyce, Trinity. Variants. The name Bastian is a variant of Sebastian. Also means majestic. It is a male name, suitable for baby boys. Origins. The name Bastian is very likely a(n) Nickname variant of the name Sebastian. See other suggested Nickname boy baby names. You might also like to see the other variants of the name Sebastian."}, {"url": "http://www.sheknows.com/baby-names/name/bastian", "passage_text": "Latin Meaning: The name Bastian is a Latin baby name. In Latin the meaning of the name Bastian is: Venerable. SoulUrge Number: 11. Expression Number: 3. People with this name have a deep inner desire to inspire others in a higher cause, and to share their own strongly held views on spiritual matters."}, {"url": "http://www.babynamewizard.com/baby-name/boy/bastian", "passage_text": "Comments and insights on the name Bastian: | Edit. Share what you know! Personal experiences with the name Bastian: | Edit. My sons name is Bastian Bronx and everyone always comments on how lovely it is to meet a Bastian instead of Sebastian. We've got used to calling him Bash now. Sebastian is a refined name that was always a little too elegant for comfort in the U.S. Your parents may even call it prissy. You can toss all that away now, because elegance has gone mainstream. This paragon of sophistication is now a global hit, and pals like Adrian and Julian will admire Sebastian's classic style."}, {"url": "http://www.thinkbabynames.com/meaning/1/Bastian", "passage_text": "Bastian /bas-t-ian/ [2 sylls.] as a boys' name is of Latin origin, and the meaning of Bastian is from Sebastia. (2000 U.S. Census). Below is a graphed analysis of the popularity of Bastian and affiliated names. Prominent variation forms of Bastian (not ranked) are Sebastian (#34 in 2014) and Sabastian. Variants like Sebestyen are seldom used."}, {"url": "http://www.babynamespedia.com/meaning/Bastian", "passage_text": "[ 3 syll. bas-tian, ba-sti-an ] The baby boy name Bastian is pronounced B AH ZTiy-ahN †. Bastian's language of origin is Old Greek. It is predominantly used in English, French, German, and Spanish. Bastian is a shortening of Sebastian (English, French, German, Scandinavian, and Spanish). Bastian is not popular as a baby boy name. It is not listed within the top 1000. "}, {"url": "http://www.quickbabynames.com/meaning-of-Bastian.html", "passage_text": "As a baby boy name, Bastian is currently not a popular baby name in the USA. There are no available USA popularity statistics for the name Bastian for the past 100 years. However, the following chart shows the popularity ranking for the name Sebastian, of which the name Bastian is a variant. Also means majestic. It is a male name, suitable for baby boys. Origins. The name Bastian is very likely a(n) Nickname variant of the name Sebastian. See other suggested Nickname boy baby names. You might also like to see the other variants of the name Sebastian."}, {"url": "http://www.thinkbabynames.com/meaning/1/Bastian", "passage_text": "Bastian is an unusual given name for men but a very prominent surname for all people (#4986 out of 150436, Top 3%). (2000 U.S. Census). Below is a graphed analysis of the popularity of Bastian and affiliated names. Prominent variation forms of Bastian (not ranked) are Sebastian (#34 in 2014) and Sabastian. Variants like Sebestyen are seldom used."}, {"url": "http://nameberry.com/babyname/Bastian", "passage_text": "Hello, Guest. In Spanish cultures, and spelled either Bastian or Bastien, this is a fairly common nickname name. The German fantasy children's book The Neverending Story features a young boy character called Bastian Balthlazar Bux, and it has also been seen in several screen versions. Bastian has been enjoying recent popularity in Latin America: it reached Number 11 in Chile--as well as in Germany and Scandinavia, and is just beginning to be appreciated here. Jeremy Sisto used it for his son."}]