[{"url": "http://www.usatoday.com/story/hotelcheckin/2013/02/25/hawaii-average-hotel-rates-skyrocketing--reaches-230-in-january/1938251/", "passage_text": "The average Hawaiian hotel room in January cost $231 per night, or 12% more than one year ago and 30% more than 2010, when the average rate was $177, according to an analysis of seven years of rate data from industry tracker STR. As Hawaii hotel rates rise, budget lodging are scarce. Hawaii's hotel rates are inching towards New York City's, which is making it harder for price-conscious travelers to find low-priced lodging. The average hotel room in Hawaii cost $231 per night last month,"}, {"url": "http://www.howmuchisit.org/hotel-room-cost/", "passage_text": "1 Hotels pricing will be based on the star rating, geographical location, time of the year and more. 2  According to answers.com, “Average prices for a nice hotel in the United States start at $90 to $150 per night.”. 3  Some lower-end hotels will cost as low as $30-$50 per night. 1 On average, a hotel night can cost anywhere from $50 to as much as $500 a night. 2  Hotels pricing will be based on the star rating, geographical location, time of the year and more. 3  According to answers.com, “Average prices for a nice hotel in the United States start at $90 to $150 per night.”"}, {"url": "http://www.howmuchisit.org/hotel-room-cost/", "passage_text": "1 According to answers.com, “Average prices for a nice hotel in the United States start at $90 to $150 per night.”. 2  Some lower-end hotels will cost as low as $30-$50 per night. 3  For example, the Days Inn in Livonia, Michigan, has rooms containing 2 double beds for $39.99 per night. 1 On average, a hotel night can cost anywhere from $50 to as much as $500 a night. 2  Hotels pricing will be based on the star rating, geographical location, time of the year and more. 3  According to answers.com, “Average prices for a nice hotel in the United States start at $90 to $150 per night.”"}, {"url": "http://press.hotels.com/en-us/hpi/u-s-hotel-rates-have-increased-by-5-percent-in-2014/", "passage_text": "DALLAS – September 3, 2014 – Americans paid an average of $137 per night for hotel accommodations in the U.S. during the first six months of 2014 – an increase of five percent compared to the same period in 2013 – according to the latest data from the biannual Hotels.com® Hotel Price Index™ (HPI®) . The average cost of a night in the Music City increased 20 percent to $164 per night, likely in part due to increased demand for numerous events such as the CMA Music Festival."}, {"url": "http://press.hotels.com/en-us/hpi/u-s-hotel-rates-have-increased-by-5-percent-in-2014/", "passage_text": "Several major Midwestern cities rose in the popularity rankings while maintaining average hotel rates below the U.S. average. Detroit ($118 per night) moved up from the 32 nd to the 28 th spot on the Top 50 list, making it the region’s second most popular destination after Chicago. Indianapolis, Ind. The average cost of a night in the Music City increased 20 percent to $164 per night, likely in part due to increased demand for numerous events such as the CMA Music Festival."}, {"url": "http://press.hotels.com/en-us/hpi/u-s-hotel-rates-have-increased-by-5-percent-in-2014/", "passage_text": "“While the average price paid by US travelers on hotel rooms in North America was $137 per night in the first half of the year, over half of the 50 most popular cities for Americans to visit had prices below this average, presenting great value opportunities.”. The average cost of a night in the Music City increased 20 percent to $164 per night, likely in part due to increased demand for numerous events such as the CMA Music Festival."}, {"url": "http://www.answers.com/Q/What_is_the_Average_Cost_for_a_night_in_a_hotel", "passage_text": "The average cost per night in downtown of Seattle varies a lot, depending on the quality of hotel wanted. A 4 star hotel night would cost approximately 90-100 pounds per night … , whereas a 2 star hotel night would cost only 70 pounds. Answered. In Countries, States, and Cities. The hotels in Malacca vary for price. There are some hotels that are on the cheaper side for someone on a small budget, then there are some that are higher priced for those wh … o want to splurge. The average room cost is about $100 a night."}, {"url": "http://www.answers.com/Q/What_is_the_average_hotel_price_in_the_US", "passage_text": "Average Hotel Prices In U.S. Average prices for a nice hotel in the United States start at $90 to $150 per night. If you are staying in New York or California, the prices will be much, much higher. It depends on where you are travelling. The average price for a hotel in Orlando range from $40.00 per night all the way up to $300.00 per night. It all depends whether you want plain or high end hotels and where it … would be located."}]