[{"url": "https://en.wikibooks.org/wiki/Human_Anatomy/Terminology_and_Organization", "passage_text": "There are two types of anatomy: gross, or macroscopic, and microscopic. Gross anatomy deals with things that can be viewed by the unaided eye. Microscopic anatomy is the study of structures on the cellular level. There are, in turn, 3 fields of study within the topic of gross anatomy."}, {"url": "http://antranik.org/intro-to-human-anatomy/", "passage_text": "1 Microscopic anatomy is known as histology which is the study of tissues. 2  This is the very basis of anatomy. 3  Histo=web or tissue and-logy=Study of. 4  Developmental anatomy is the development of anatomy. 5  Embryological anatomy is a subset of developmental as it’s limited to the embryo inside the womb."}, {"url": "http://www.mananatomy.com/basic-anatomy/cartilage-types", "passage_text": "Cartilage is a type of connective tissue composed of special cells known as chondrocytes along with collagen or yellow elastic fibers. The fibers and the cells are embedded in a firm gel like matrix rich in mucopolysaccharides. Cartilage is not as hard and rigid as bone. It is much more flexible and elastic."}, {"url": "http://antranik.org/intro-to-human-anatomy/", "passage_text": "Different types of anatomy. 1  Gross anatomy involves anything that could be seen with your unaided eye. 2  Surface anatomy is a subset of gross anatomy that is anything that can be revealed on the skin. 3  Microscopic anatomy is known as histology which is the study of tissues. 4  Histo=web or tissue and-logy=Study of. 5  Developmental anatomy is the 6  ... Embryol"}, {"url": "http://www.youtube.com/watch?v=FknWsN9EVJA", "passage_text": "www.salmonellaplace.com. This is a tutorial/lecture on the different types of Joints found in the Human Body. We cover some topics important for classes such as anatomy, college and medical school levels. List of topics: - Synarthrosis: - Syndesmosis (Suture, Ligamentous & Gomphosis); - Synchondrosis; - Synostosis;"}]