[{"url": "http://science.howstuffworks.com/life/cellular-microscopic/dna5.htm", "passage_text": "Transcription takes place in the cytoplasm (prokaryote) or in the nucleus (eukaryote). The transcription is performed by an enzyme called RNA polymerase. To make mRNA, RNA polymerase: 1  Binds to the DNA strand at a specific sequence of the gene called a promoter. 2  Unwinds and unlinks the two strands of DNA. 3  Uses one of the DNA strands as a guide or template."}, {"url": "https://simple.wikipedia.org/wiki/DNA", "passage_text": "The DNA in a person is a combination of the DNA from each of their parents. Part of an organism's DNA is  non-coding DNA  sequences. They do not code for protein sequences. Some noncoding DNA is transcribed into non-coding RNA molecules, such as transfer RNA, ribosomal RNA, and regulatory RNAs). Other sequences are not transcribed at all, or give rise to RNA of unknown function. The amount of non-coding DNA varies greatly among species."}, {"url": "http://science.howstuffworks.com/life/cellular-microscopic/dna3.htm", "passage_text": "Where DNA replication occurs depends upon whether the cells is a prokaryote or a eukaryote (see the RNA sidebar on the previous page for more about the types of cells). DNA replication occurs in the cytoplasm of prokaryotes and in the nucleus of eukaryotes. DNA Replication. ­DNA carries the information for making all of the cell's proteins. These pro­teins implement all of the functions of a living organism and determine the organism'­s characteristics. When the cell reproduces, it has to pass all of this information on to the daughter cells."}, {"url": "https://simple.wikipedia.org/wiki/DNA", "passage_text": "DNA, short for deoxyribonucleic acid, is the molecule that contains the genetic code of organisms. This includes animals, plants, protists, archaea and bacteria. DNA is in each cell in the organism and tells cells what proteins to make. Mostly, these proteins are enzymes. DNA is inherited by children from their parents. This is why children share traits with their parents, such as skin, hair and eye color. Some noncoding DNA is transcribed into non-coding RNA molecules, such as transfer RNA, ribosomal RNA, and regulatory RNAs). Other sequences are not transcribed at all, or give rise to RNA of unknown function. The amount of non-coding DNA varies greatly among species."}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/dna", "passage_text": "DNA is a double helix formed by base pairs attached to a sugar-phosphate backbone. DNA, or deoxyribonucleic acid, is the hereditary material in humans and almost all other organisms. Nearly every cell in a person’s body has the same DNA. The structure of the double helix is somewhat like a ladder, with the base pairs forming the ladder’s rungs and the sugar and phosphate molecules forming the vertical sidepieces of the ladder. An important property of DNA is that it can replicate, or make copies of itself."}, {"url": "https://answers.yahoo.com/question/index?qid=20080316213549AAXDwJX", "passage_text": "Best Answer: I'll try to be as simple as possible.... Step 1 - Helicase unwinds the DNA so that the two strands are separated. Step 2 - Primase adds an RNA primer to each unwound DNA strand. (this is necessary in order for replication) Note that the two strands are different. One strand only needs one primer and then it can be replicated from start to finish."}, {"url": "https://answers.yahoo.com/question/index?qid=20080316213549AAXDwJX", "passage_text": "Can someone explain DNA replication to me without getting into all the complicated details? All I need to know is what occurs with helicase, primase, DNA polymerase, and ligase, like in this animation. Step 2 - Primase adds an RNA primer to each unwound DNA strand. (this is necessary in order for replication) Note that the two strands are different. One strand only needs one primer and then it can be replicated from start to finish."}, {"url": "http://science.howstuffworks.com/life/cellular-microscopic/dna3.htm", "passage_text": "The structure of DNA lends itself easily to DNA replication. Each side of the double helix runs in opposite (anti-parallel) directions. The beauty of this structure is that it can unzip down the middle and each side can serve as a pattern or template for the other side (called semi-conservative replication). DNA Replication. ­DNA carries the information for making all of the cell's proteins. These pro­teins implement all of the functions of a living organism and determine the organism'­s characteristics. When the cell reproduces, it has to pass all of this information on to the daughter cells."}, {"url": "http://www.rpi.edu/dept/chem-eng/Biotech-Environ/Projects00/rdna/rdna.html", "passage_text": "DNA is deoxyribose. The four nitrogen bases are the same for all organisms. The. sequence and number of bases is what creates diversity. DNA does not. actually make the organism, it only makes proteins. The DNA is transcribed. into mRNA and mRNA is translated into protein, and the protein then forms the. organism."}]