[{"url": "http://www.nhs.uk/Conditions/Dysentery/Pages/Introduction.aspx", "passage_text": "Introduction. Dysentery is an infection of the intestines that causes diarrhoea containing blood or mucus. Other symptoms of dysentery can include: 1  painful stomach cramps. 2  nausea or vomiting. 3  a high temperature (fever) of 38C (100.4F) or above, or 37.5C (99.5F) or above in children under five"}, {"url": "http://www.news-medical.net/health/What-is-Dysentery.aspx", "passage_text": "By Liji Thomas, MD. Dysentery is an infection of the intestines which causes the passage of bloody stools mixed with mucus. It is caused either by bacteria such as Shigella, or by parasites such as Entamoeba. These forms are called bacillary dysentery, or shigellosis, and amoebic dysentery respectively. Other symptoms of dysentery include cramps, bloating, and fever, along with 3-8 soft or liquid stools a day. In more severe cases there may be pain on touching the abdomen, severe diarrhea evidenced by 10 or more stools a day, nausea or vomiting. Fever may rise as high as 100.4 F (38oC)."}, {"url": "https://en.wikipedia.org/wiki/Dysentery", "passage_text": "Dysentery is an inflammation of the intestine causing diarrhea with blood. Other symptoms may include fever, abdominal pain, and rectal tenesmus (a feeling of incomplete defecation). It is caused by a number of types of infection such as bacteria, viruses, parasitic worms, or protozoa. Dysentery may also be caused by shigellosis, an infection by bacteria of the genus Shigella, and is then known as bacillary dysentery (or Marlow Syndrome)."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=6639", "passage_text": "Dysentery: Inflammation of the intestine, with pain, diarrhea, bloody stools, and often a fever above 38.3'C (101'F). The causes of dysentery include bacteria (such as Shigella), protozoa (such as amebae), parasitic worms (such as schistosomes), and viruses. "}, {"url": "http://www.medicalnewstoday.com/articles/171193.php", "passage_text": "Dysentery is an intestinal inflammation, especially in the colon, that can lead to severe diarrhea with mucus or blood in the feces. Patients typically experience mild to severe abdominal pain or stomach cramps. "}, {"url": "http://spartacus-educational.com/FWWdystentry.htm", "passage_text": "Dysentery. Dysentery is a disease involving the inflammation of the lining of the large intestines. The inflammation causes stomach pains and diarrhoea. Some cases involve vomiting and fever. The bacteria enters the body through the mouth in food or water, and also by human feaces and contact with infected people"}, {"url": "http://www.healthgrades.com/conditions/dysentery", "passage_text": "Find a Gastroenterologist Near You. Common bacterial causes of dysentery in the United States include infections with the bacteria Shigella and some types of Escherichia coli (E coli). Other less common bacterial causes of bloody diarrhea include Salmonella and Campylobacter infections. Dysentery broadly refers to infectious gastrointestinal disorders characterized by inflammation of the intestines, chiefly the colon. The World Health Organization (WHO) defines dysentery as any episode of diarrhea in which blood is present in loose, watery stool"}, {"url": "https://en.wikipedia.org/wiki/Dysentery", "passage_text": "In developed countries, the most common form of dysentery is bacillary dysentery which is typically a mild illness, causing symptoms normally consisting of mild stomach pains and frequent passage of stool or diarrhea. Dysentery may also be caused by shigellosis, an infection by bacteria of the genus Shigella, and is then known as bacillary dysentery (or Marlow Syndrome)."}]