[{"url": "https://technet.microsoft.com/en-us/library/skype-for-business-online-instant-messaging-presence-and-contacts.aspx", "passage_text": "Contacts List Configuration. You can create a persistent list of contacts for all Skype for Business users, ensuring that the contact information a user requires is immediately available. You can add other users to your Contacts list, organize, and group these contacts in different ways (by department, for example). When enabled, the option to restrict presence information to contacts becomes available in the Skype for Business status options. When disabled, users can choose either to always let everyone see their presence information, or to adhere to any future changes the administrator makes to the privacy mode."}, {"url": "http://smallbusiness.chron.com/move-numbers-personal-business-account-skype-41914.html", "passage_text": "Step 4. Right-click on your business account name in your contacts list and select the Send Contacts option from the drop-down menu. Wait for the pop-up Send Contacts window to appear. Step 5. Click on each of the contacts in the list in the Send Contacts window to select them to send to your business account. Once you have done this, you may then wish to copy contacts over from your old personal account rather than reenter them in your business account. This can be done by first adding your business account contact to your personal account, then using the Send Contacts feature in the Skype program. Step 1."}, {"url": "https://support.office.com/en-US/article/Transfer-a-Skype-for-Business-call-f9f312a3-ccc9-4215-86e8-8928b2df1f97", "passage_text": "Transfer a Skype for Business call. You can transfer a Skype for Business call to another person or number. For example, if you need someone else to handle the call, you can transfer to them. Or if you need to leave your office, but want to continue your conversation, you can transfer the call to your cell phone. Click the Call Controls button in the call window. Click Transfer, type the number, or enter the number in the text box. The Transfer Call window appears. Click one of your numbers, such as your mobile phone, (these are the numbers that were added to your Skype for Business account). Click Transfer"}, {"url": "http://www.marquette.edu/its/help/skype/transfer.shtml", "passage_text": "1 When you are in a call, click the Call Controls icon. 2  Click Transfer. 3  The Transfer Call window will open. 4  In the search bar, enter the name or phone number of the person to whom you want to transfer the call, or select a person from your Contacts. 1 Click Retrieve to retrieve it. 2  Or click Copy to copy the number and open an email or an IM and share the retrieval number with another person. 3  Transfer a call directly to a person’s voice mail. 4  When you are on the call that you will transfer to someone else, click the Call Controls icon and c"}, {"url": "http://smallbusiness.chron.com/export-skype-contacts-53086.html", "passage_text": "How to Export Skype Contacts. Skype stores all of your contacts within its central servers as a way of facilitating communication and collaboration with your business colleagues. Although you do not need to back up your contacts for safekeeping, you may still want to export them to your computer for backup purposes. "}, {"url": "http://www.marquette.edu/its/help/skype/transfer.shtml", "passage_text": "1 Transfer an incoming call directly to another person. 2  When you are in a call, click the Call Controls icon. 3  Click Transfer. 4  The Transfer Call window will open. 5  In the search bar, enter the name or phone number of the person to whom you want to transfer the call, or select a person from your Contacts. 1 Click Retrieve to retrieve it. 2  Or click Copy to copy the number and open an email or an IM and share the retrieval number with another person. 3  Transfer a call directly to a person’s voice mail. 4  When you are on the call that you will transfer to someone else, click the Call Controls icon and c"}, {"url": "http://smallbusiness.chron.com/move-numbers-personal-business-account-skype-41914.html", "passage_text": "Sign in to your personal Skype account. Step 2. Click on the Contacts option in the program menu and select the Add Contacts option from the drop-down menu. Related Reading: How to Merge Skype Phone Contacts. Step 3. Type in the username of your business account in the search field and click the Search button. Wait for the search results to populate. Once you have done this, you may then wish to copy contacts over from your old personal account rather than reenter them in your business account. This can be done by first adding your business account contact to your personal account, then using the Send Contacts feature in the Skype program. Step 1."}, {"url": "http://www.marquette.edu/its/help/skype/transfer.shtml", "passage_text": "1 Click Transfer at the bottom of the window. 2  Wait a moment and the call will transfer and you will be removed from the call. 3  Consult with a person before transferring a call to him or her. 4  When you are in a call with the incoming caller, open a new Skype for Business window and make a second call. 1 Click Retrieve to retrieve it. 2  Or click Copy to copy the number and open an email or an IM and share the retrieval number with another person. 3  Transfer a call directly to a person’s voice mail. 4  When you are on the call that you will transfer to someone else, click the Call Controls icon and click Transfer."}, {"url": "http://www.marquette.edu/its/help/skype/transfer.shtml", "passage_text": "1 When you are in a call with the incoming caller, open a new Skype for Business window and make a second call. 2  Enter the number of the person you want to speak with and press Enter. 3  Or you can enter their name in the search box and click the phone icon beside their name to make the call. 1 Click Retrieve to retrieve it. 2  Or click Copy to copy the number and open an email or an IM and share the retrieval number with another person. 3  Transfer a call directly to a person’s voice mail. 4  When you are on the call that you will transfer to someone else, click the Call Controls icon and click Transfer."}]