[{"url": "https://uk.answers.yahoo.com/question/index?qid=20081106084032AAmfK5g", "passage_text": "An atom is the smallest particle in anything and everything.An element only has one type of atom and is found in a periodic table. A molecules is two atoms joined together. A compound is two or more elements chemically joined. Both elements and compounds have molecules. Hope this helps. Report Abuse. an atom is the smallest undevidable substance of matter. an element is a substance made by two similar atome by a covalent bond. a molecule is a group of atoms; different ,made by a covalent bond. a compound is a substance made by ionic bond."}, {"url": "http://chemistry.about.com/od/moleculescompounds/f/What-Is-The-Difference-Between-A-Molecule-And-A-Compound.htm", "passage_text": "A molecule is formed when two or more atoms of an element chemically join together. If the types of atoms are different from each other, a compound is formed. Not all molecules are compounds, since some molecules, such as hydrogen gas or ozone, consist only of one element or type of atom. "}, {"url": "http://www.chem.purdue.edu/gchelp/atoms/elements.html", "passage_text": "A molecule consists of two or more atoms of the same element, or different elements, that are chemically bound together. Note that the two nitrogen atoms which comprise a nitrogen molecule move as a unit. Compounds. Microscopic view of the molecules of the compound water (gas phase). Note that a compound: 1  consists of atoms of two or more different elements bound together, 2  can be broken down into a simpler type of matter (elements) by chemical means (but not by physical means), 3  has properties that are different from its component elements, and. 4  always contains the same ratio of its component atoms"}, {"url": "http://www.diffen.com/difference/Compound_vs_Element", "passage_text": "Elements and compounds are pure chemical substances found in nature. The difference between an element and a compound is that an element is a substance made of same type of atoms, whereas a compound is made of different elements in definite proportions. Examples of elements include iron, copper, hydrogen and oxygen. "}, {"url": "http://education.jlab.org/qa/atom_02.html", "passage_text": "A compound is a substance made from two or more different elements that have been chemically joined. Some examples of compounds are water (H 2 O), table salt (NaCl), table sugar (C 12 H 22 O 11) and chalk (CaCO 3). Atoms are the smallest bits of ordinary matter and are made from particles called protons (which carry a positive electrical charge), neutrons (which carry no electrical charge) and electrons (which carry a negative electrical charge)."}, {"url": "https://answers.yahoo.com/question/index?qid=20120128191813AAYfA0q", "passage_text": "A molecule is two or more atoms chemically combined together for example O2 which is two oxygen atoms combined together. A compound is two or more MOLECULES or elements chemically combined together for example H2O which is water and is made up of 1 H2 molecule and an oxygen atom. "}, {"url": "http://www.differencebetween.net/science/difference-between-molecules-and-compounds/", "passage_text": "A molecule came into being when two or more atoms interact chemically and combine together. Compound is also a molecule but it contains atom of minimum two or more elements. Generally all compounds can be considered as molecules but are molecules are not compound. A molecule can be most appropriately defined as a group of atoms tied in a definite arrangement."}, {"url": "http://www.syvum.com/cgi/online/serve.cgi/squizzes/chem/atomic2.html", "passage_text": "A compound is formed when atoms or molecules of different elements combine. In a compound, elements are chemically combined in a fixed proportion. Examples: 1  Hydrogen and oxygen are combined in a fixed proportion of 2:1 to form the compound water [H 2 O]. 1 Since atoms are electrically neutral, the number of protons equal the number of electrons in an atom. 2  Atomic weight (or relative atomic mass) of an element is the number of times an atom of that element is heavier than an atom of hydrogen. 3  The atomic weight of hydrogen is taken to be unity [1]."}, {"url": "http://education.jlab.org/qa/compound.html", "passage_text": "A molecule is formed when two or more atoms join together chemically. A compound is a molecule that contains at least two different elements. All compounds are molecules but not all molecules are compounds. Molecular hydrogen (H 2), molecular oxygen (O 2) and molecular nitrogen (N 2) are not compounds because each is composed of a single element."}]