[{"url": "http://www.theinternetelectricalstore.com/pattress-back-box-faq-1888-c.asp", "passage_text": "The pattress is known by a number of other names. When the wall is composed of plasterboard or some type of timber construction rather than brick or cement blocks, it may be referred to as a plasterboard box. While the name may change, the essential function of the pattress remains the same. The pattress box is a simple device that looks much like any type of box. Equipped with a bottom and four sides, the container fits neatly against what is known as a pattress plate. When installed correctly, the box is more or less sealed, providing a reasonable level of protection to the contents"}, {"url": "https://en.wikipedia.org/wiki/Pattress", "passage_text": "Wall boxes are commonly made of thin galvanised metal. A pattress box is made to standard dimensions and may contain embedded bushings (in standard positions) for the attachment of wiring devices (switches and sockets). Although cables may be joined inside pattress boxes, due simply to their presence at convenient points in the wiring, their main purpose is to accommodate switches and sockets. They allow switches and sockets to be recessed into the wall for a better appearance."}, {"url": "http://www.theinternetelectricalstore.com/pattress-back-box-faq-1888-c.asp", "passage_text": "Often referred to as a pattress box, this product is a type of container that is used with electrical applications. The pattress box is a simple device that looks much like any type of box. Equipped with a bottom and four sides, the container fits neatly against what is known as a pattress plate. When installed correctly, the box is more or less sealed, providing a reasonable level of protection to the content"}, {"url": "https://en.wikipedia.org/wiki/Pattress", "passage_text": "A pattress or pattress box is the container for the space behind electrical fittings such as power outlet sockets and light switches. Pattresses may be designed for either surface mounting (with cabling running along the wall surface) or for embedding in the wall or skirting board. Although cables may be joined inside pattress boxes, due simply to their presence at convenient points in the wiring, their main purpose is to accommodate switches and sockets. They allow switches and sockets to be recessed into the wall for a better appearance."}, {"url": "http://wiki.diyfaq.org.uk/index.php?title=Pattress", "passage_text": "Pattress is derived from the latin 'pateras' meaning a shallow bowl or plate. In the 1800s 'pattress' was used to mean the flat wooden plates that gas lighting equipment was mounted on. In the 1930s electrical accessories were mounted on wooden plates, and these were mainly referred to as 'pateras.' The anglicised version 'pattress' gradually took over from pateras. Metal recessed pattresses are used to mount sockets & switches flush to a solid wall. A recess is chiselled out for the pattress to sit in. Knockouts are provided for cable entry. These are the most common domestic pattresses."}, {"url": "https://en.wikipedia.org/wiki/Pattress", "passage_text": "Some electricians use the term pattress box to describe a surface-mounted box, although simply the term pattress suffices. The term flush box is used for a mounting box that goes inside the wall, although some use the term wall box. Although cables may be joined inside pattress boxes, due simply to their presence at convenient points in the wiring, their main purpose is to accommodate switches and sockets. They allow switches and sockets to be recessed into the wall for a better appearance."}, {"url": "https://en.wikipedia.org/wiki/Pattress", "passage_text": "The term pattress is rarely seen in the United States or Canada, where the equivalent term is device box or switch box. A pattress may be made of metal or plastic. Although cables may be joined inside pattress boxes, due simply to their presence at convenient points in the wiring, their main purpose is to accommodate switches and sockets. They allow switches and sockets to be recessed into the wall for a better appearance."}, {"url": "http://www.wisegeek.com/what-is-a-pattress.htm", "passage_text": "Ad. In terms of construction, a pattress may be composed of a durable plastic or some type of metal. In residential situations that normally call for the box to be within the wall, it is not unusual for plastic containers to be utilized. The pattress is known by a number of other names, with local customs often dictating which name is used. In some parts of the world, the container may be known as a wall box when it is inserted into the wall."}]