[{"url": "http://www.bisonbasics.com/recipes/basics/basicbisonburger.html", "passage_text": "1 Grill the burgers on the medium-hot side for 4 minutes without disturbing. 2  Flip the burgers over and continue to cook on the same side of the grill for another 3 minutes. 3  Then shift the burgers over to the medium heat side of the grill well away from the direct heat coming from the fire. 1 Place the burgers on the pre-heated grill, top side down. 2  Except when the burgers are being flipped over, the barbecue lid should remain closed during grilling. 3  Grill burgers for 4 minutes without disturbing. 4  Open the barbecue lid, flip the burgers over and cook the opposite side fo"}, {"url": "http://www.thekitchn.com/how-to-grill-really-juicy-burgers-cooking-lessons-from-the-kitchn-51194", "passage_text": "4. Grill the Burgers: Grill the burgers for 2 minutes on each side, then move them to a lower-heat area of the grill. Cook another 2-3 minutes for medium-rare burgers, 3-4 minutes for medium, or 5-6 minutes for well-done burgers. In the last minute of cooking, lay a slice of cheese on top of each burger and arrange the buns over high heat to toast. If cooking on a charcoal grill, arrange coals to create a high heat and a low heat cooking zone. 2. Prepare the Ground Beef: While the grill is warming, prepare the burgers. Gently pat the ground beef into a log roughly 2 feet long on a clean baking sheet."}, {"url": "http://www.saveur.com/article/Techniques/Putting-Heat-to-the-Meat", "passage_text": "2. Place burgers on the grill and cook, waiting for at least 4 minutes before flipping. 3. Cook until both sides are browned and the burger is cooked to the desired doneness, about 10 minutes for medium rare for 8-ounce burgers. Let the burgers rest for about 5 minutes before serving. "}, {"url": "http://www.thekitchn.com/how-to-grill-really-juicy-burgers-cooking-lessons-from-the-kitchn-51194", "passage_text": "Instructions. 1. Heat the Grill: Warm your grill to high heat, about 450°F or until you can hold your hand an inch over the grate for only one second. If cooking on a charcoal grill, arrange coals to create a high heat and a low heat cooking zone. 2. Prepare the Ground Beef: While the grill is warming, prepare the burgers. Gently pat the ground beef into a log roughly 2 feet long on a clean baking sheet."}, {"url": "http://www.grillingcompanion.com/recipe/how-to-grill-hamburgers/", "passage_text": "This is a sure sign that the meat is cooking through in the middle, which pushes the juices to the top. Flip the burgers over and grill for 1 - 2 minutes shorter than the time it took to start seeing the juices (about 3 - 4 minutes should do the trick for medium, but again, it depends on the grill). Directions. Get the grill going. Go ahead and light the grill and set it up for direct grilling over high heat. Divide your ground beef into equal portions, based on how many patties you are going to make. You want to end up with about a tennis ball sized portion of ground beef."}, {"url": "http://www.addictedtogrilling.com/grilling-times/how-long-do-you-grill-hamburgers", "passage_text": "Well, that depends on two things: how you like your hamburgers done and how thick your patties are. Let's start with the patties... The optimal thickness for burgers is about 3/4 of an inch thick (unless your making sliders or mini's which can be made a little thinner). Medium (135-150° F): Grill for 3 minutes, flip, grill for 5 more minutes. Medium Well (150-165° F): Grill for 3 minutes, flip, grill for 6 more minutes. Well Done (165° F and up): Grill for 3 minutes, flip, grill for 7"}, {"url": "http://www.foodnetwork.com/recipes/bobby-flay/perfect-burger-recipe.html", "passage_text": "IF USING A GRILL: Heat a gas grill to high or heat coals in a charcoal grill until they glow bright orange and ash over. Brush the burgers with the oil. Grill the burgers until golden brown and slightly charred on the first side, about 3 minutes for beef and 5 minutes for turkey. Flip over the burgers. Cook beef burgers until golden brown and slightly charred on the second side, 4 minutes for medium rare (3 minutes if topping with cheese; see step 3) or until cooked to desired degree of doneness. Cook turkey burgers until cooked throughout, about 5 minutes on the second side. Add the cheese, if using, to the tops of the burgers during the last minute of cooking and top with a basting cover, close the grill cover, or tent the burgers with aluminum foil to melt the cheese. Cook the burgers as for a grill, above. IF USING A SAUTE PAN OR GRIDDLE (PREFERABLY CAST IRON): Heat the oil in the pan or griddle over high heat until the oil begins to shimmer. Cook"}, {"url": "http://www.addictedtogrilling.com/grilling-times/how-long-do-you-grill-hamburgers", "passage_text": "That said, here are average grilling times for burgers when grilling with the tried-and-true method of direct, high heat (450-650° F): : Medium Rare (130-135° F): Grill for 3 minutes, flip, grill for 4 more minutes. Medium (135-150° F): Grill for 3 minutes, flip, grill for 5 more minutes. Medium Well (150-165° F): Grill for 3 minutes, flip, grill for 6 more minutes. Well Done (165° F and up): Grill for 3 minutes, flip, grill for 7 more minutes. Turkey or chicken burgers: Well: Grill for 5 minutes, flip, grill for 5 more minutes. (170° F). However, keep in mind that time alone is never a reliable measure of doneness. There are just to many things that can affect it (patty thickness, wind, outdoor temp., heat source consistency, and so on...)"}, {"url": "http://www.bisonbasics.com/recipes/basics/basicbisonburger.html", "passage_text": "1 Grill burgers for 4 minutes without disturbing. 2  Open the barbecue lid, flip the burgers over and cook the opposite side for 3 minutes. 3  Flip the seared burgers twice more over the next 4 to 6 minutes, or until an internal temperature of 135F to 140F is reached. 1 Place the burgers on the pre-heated grill, top side down. 2  Except when the burgers are being flipped over, the barbecue lid should remain closed during grilling. 3  Grill burgers for 4 minutes without disturbing. 4"}, {"url": "http://www.artofmanliness.com/2011/06/22/grilling-basics-building-a-better-burger/", "passage_text": "Method. 1  Grill your burgers over high heat. 2  Avoid using your spatula to press down on your burgers while cooking. 3  Flip your burgers only one time–about 3 minutes on each side for medium rare plus. 4  If you get a flare up, cover the grill. 5  Allow your burgers to rest for a few minutes before serving. Add hamburger patties over direct heat and grill covered for 3 minutes on each side for medium rare plus. Remove from grill (or top with cheese to melt) and rest 3 – 4 minutes before serving. Top with your choice of ingredients and serve. So that’s my go-to recipe."}]