[{"url": "http://physics.stackexchange.com/questions/113263/what-is-the-difference-between-a-pulse-and-a-wave", "passage_text": "Wave usually refers to a continuous disturbance. Like if you grab hold of spring and shake it back and forth a lot. Pulse, on the other hand, often refers to some type of one-time disturbance. Like shaking the spring only once. Of course there will be overlap or ambiguities in these terms. I doubt there's any agreed-upon precise definition of these."}, {"url": "http://www.differencebetween.com/difference-between-pulse-and-vs-wave/", "passage_text": "Difference Between Pulse and Wave. Posted on. by admin Last updated on: July 22, 2013. Pulse vs Wave. Waves are a very common occurrence in nature. The origin of waves lies in the vibrations. A sudden change in the energy of a system or an object results in an immediate change, in the energy of the surroundings. This term often refers to a change in position in a medium, seen and described as amplitude, due to a vibration. A series of such sudden variations is also known as a pulse. Wave. A periodic disturbance in a medium or space is known as a wave. The disturbance can be regular or irregular. Waves are the main method of energy transfer in the nature. Whenever excess energy is released from a system or object, it is carried away by a wave"}, {"url": "https://answers.yahoo.com/question/index?qid=20071124094139AAdJhdR", "passage_text": "A pulse is a wave packet containing broad range of frequencies. A pulse (wave packet) is a localized disturbance that results from the sum of many different wave forms. The wave is the transport of disturbances in space, not associated with motion of the medium occupying this space as a whole. As there is but one pulse, the wave travels through water at velocity v and that one wave's energy compresses and releases water as the wave travels through the water."}, {"url": "https://en.wikipedia.org/wiki/Pulse_wave", "passage_text": "The shape of the pulse wave is defined by its duty cycle D, which is the ratio between the pulse duration () and the period (T). A pulse wave or pulse train is a kind of non-sinusoidal waveform that is similar to a square wave, but does not have the symmetrical shape associated with a perfect square wave. It is a term common to synthesizer programming, and is a typical waveform available on many synthesizers. "}, {"url": "http://physics.bu.edu/~duffy/py105/Waves.html", "passage_text": "A pulse is a single disturbance while a periodic wave is a continually oscillating motion. There is a close connection between simple harmonic motion and periodic waves; in most periodic waves, the particles in the medium experience simple harmonic motion. A wave is a disturbance that transfers energy from one place to another without requiring any net flow of mass. For now, we'll focus on mechanical waves, requiring a medium in which to travel. Light, and other electromagnetic waves, do not require a medium; we'll deal with those later in the semester."}, {"url": "https://answers.yahoo.com/question/index?qid=20071124094139AAdJhdR", "passage_text": "In this case, oscillation is a misnomer. As there is but one pulse, the wave travels through water at velocity v and that one wave's energy compresses and releases water as the wave travels through the water. So the only time we'd see the compression/rarefaction is when that one wave passed over our microphones"}, {"url": "https://answers.yahoo.com/question/index?qid=20071124094139AAdJhdR", "passage_text": "Best Answer: The pulse is a spurt of a wave. SONAR best exemplifies this. If the sub's captains says give me one ping of the SONAR, he will get one pulse or spurt of one wave of sound. As there is but one pulse, the wave travels through water at velocity v and that one wave's energy compresses and releases water as the wave travels through the water."}, {"url": "http://www.differencebetween.com/difference-between-pulse-and-vs-wave/", "passage_text": "• A single sudden change in a property of a medium or a quantity is known as a pulse, whereas waves are repeated oscillating changes in the properties or the quantity. • A pulse has a sharp rise and a sharp decline of amplitude, whereas a wave can be either regular or irregular. This term often refers to a change in position in a medium, seen and described as amplitude, due to a vibration. A series of such sudden variations is also known as a pulse. Wave. A periodic disturbance in a medium or space is known as a wave. The disturbance can be regular or irregular. Waves are the main method of energy transfer in the nature. Whenever excess energy is released from a system or object, it is carried away by a wave"}, {"url": "http://physics.stackexchange.com/questions/113263/what-is-the-difference-between-a-pulse-and-a-wave", "passage_text": "Waves is one common way in which nature expresses the flow of energy through space and time. A pulse is just a special type of wave-a solitary wave. And solitary waves that dissipate a minor amount of energy into the medium, have low dispersion, and are able to maintain their shape over distance are called ' solitons '. A vortex ring is a good and interesting example of a solition. Pulse, on the other hand, often refers to some type of one-time disturbance. Like shaking the spring only once. Of course there will be overlap or ambiguities in these terms. I doubt there's any agreed-upon precise definition of these."}]