[{"url": "https://en.wikipedia.org/wiki/Genetic_test", "passage_text": "Genetic testing identifies changes in chromosomes, genes, or proteins. The variety of genetic tests has expanded throughout the years. In the past, the main genetic tests searched for abnormal chromosome numbers and mutations that lead to rare, inherited disorders. Today, tests involve analyzing multiple genes to determine the risk of developing certain more common diseases such as heart disease and cancer. 1 Predictive testing can identify mutations that increase a person's chances of developing disorders with a genetic basis, such as certain types of cancer. 2  For example, an individual with a mutation in BRCA1 has a 65% cumulative risk of breast cancer."}, {"url": "https://en.wikipedia.org/wiki/Genetic_test", "passage_text": "In addition to studying chromosomes to the level of individual genes, genetic testing in a broader sense includes biochemical tests for the possible presence of genetic diseases, or mutant forms of genes associated with increased risk of developing genetic disorders. 1 Predictive testing can identify mutations that increase a person's chances of developing disorders with a genetic basis, such as certain types of cancer. 2  For example, an individual with a mutation in BRCA1 has a 65% cumulative risk of breast cancer."}, {"url": "https://en.wikipedia.org/wiki/Genetic_test", "passage_text": "The results of a genetic test can confirm or rule out a suspected genetic condition or help determine a person's chance of developing or passing on a genetic disorder. Several hundred genetic tests are currently in use, and more are being developed. 1 Predictive testing can identify mutations that increase a person's chances of developing disorders with a genetic basis, such as certain types of cancer. 2  For example, an individual with a mutation in BRCA1 has a 65% cumulative risk of breast cancer."}, {"url": "https://labtestsonline.org/understanding/features/genetics/start/2", "passage_text": "Clinical genetic testing refers to the laboratory analysis of DNA or RNA to aid in the diagnosis of disease. It is very important to understand that clinical genetic testing is quite different than other types of laboratory tests. Testing Genetic Material. Testing of genetic material is performed on a variety of specimens including blood, urine, saliva, stool, body tissues, bone, or hair. Cells in these samples are isolated and the nucleic acids (DNA or sometimes RNA) within them is extracted and examined for possible mutations or alterations."}, {"url": "http://outsmartdisease.com/autoimmune-thyroiditis-triggers-part-1-thyroid-genetics/", "passage_text": "Genetics. The family history of thyroid disorders is common and well documented in the literature. The epidemiological and population data, high sibling risk ratio, family and twin studies confirmed strong genetic involvement in the development of Hashimoto’s disease. "}, {"url": "http://genetics.thetech.org/ask/ask182", "passage_text": "Many things can cause hypothyroidism, or low thyroid hormone. And, one of these is genetics. But it isn't a simple one gene, one disease sort of problem. Genetics can play many roles in causing this condition. Before going into all of this, let's quickly go over what hypothyroidism is. The thyroid is a gland in your neck that makes thyroid hormone."}, {"url": "https://www.anthem.com/medicalpolicies/policies/mp_pw_c166603.htm", "passage_text": "Genetic testing: A type of test that is used to determine the presence or absence of a specific gene or set of genes to help diagnose a disease, screen for specific health conditions, and for other purposes. Medullary thyroid cancer: The type of thyroid cancer that develops from the C cells of the thyroid gland. Genetic tests addressed in this document include, but are not limited to the following: 1  Medullary Thyroid Cancer; and. 2  Multiple Endocrine Neoplasia Type 2 (MEN2); and. 3  Genetic testing for endocrine gland cancer susceptibility using panels of genes."}, {"url": "http://www.naturalendocrinesolutions.com/articles/should-genetic-testing-be-used-to-prevent-thyroid-disease/", "passage_text": "The only real way of knowing whether doing genetic testing will help to prevent conditions such as hypothyroidism and hyperthyroidism from developing, as well as autoimmune disorders such as Graves’ Disease and Hashimoto’s Thyroiditis, is to actually do the genetic testing. Besides it taking a long time to determine whether genetic testing truly can help prevent thyroid conditions from developing, another problem with taking the approach I just mentioned is that some people have an underlying thyroid or autoimmune thyroid disorder and do not know it."}, {"url": "http://www.medscape.com/viewarticle/782367", "passage_text": "In the majority of patients with papillary thyroid cancer, the most common form of thyroid cancer, there is no need for genetic testing. However, there might be a role for such testing in the 7% of patients who present with an aggressive form of the disease. Hence, the researchers set out to determine whether genetic testing is useful in this situation. They homed in on a prominent oncogenic mutation, BRAF V600E, which occurs in about 45% of all cases of papillary thyroid cancer, on average. Huge Undertaking. The study was a huge u"}, {"url": "https://labtestsonline.org/understanding/features/genetics/start/2", "passage_text": "Other examples include blood tests for congenital hypothyroidism, diagnosed by low blood levels or absence of thyroid hormone, and congenital adrenal hyperplasia, a genetic disease that causes the hormone cortisol to be decreased in blood. Testing Genetic Material. Testing of genetic material is performed on a variety of specimens including blood, urine, saliva, stool, body tissues, bone, or hair. Cells in these samples are isolated and the nucleic acids (DNA or sometimes RNA) within them is extracted and examined for possible mutations or alterations."}]