[{"url": "http://www.lsnjlaw.org/Health-Care/Patient-Rights/Pages/How-to-Get-a-Copy-of-Your-Medical-Records-in-New-Jersey.aspx", "passage_text": "Doctors in New Jersey must keep your medical records for seven years. After seven years, the law allows the doctor to destroy your records without any notice to you. In practice, most doctors will attempt to notify former patients by mail before they destroy medical records. Doctors may charge you no more than $1 per page or $100 for your entire medical record, whichever amount is less. If your record is fewer than 10 pages, the doctor is allowed to charge you $10. Doctors are also allowed to charge an administrative fee of no more than $10 or 10% of the copying cost, whichever is less."}, {"url": "http://www.nhs.uk/chq/Pages/1889.aspx?CategoryID=68", "passage_text": "Mental health records. Records of people who have been treated for a mental disorder should be retrained for 20 years after the date of last contact between the patient and any healthcare professional employed by the mental health provider, or eight years after the death of the patient if sooner. Children and young people. All types of records for children and young people should be retained until the patient is 25 (or 26 if they are 17 when treatment ends) or eight years after their death,"}, {"url": "http://www.cyrss.com/docs/hipaa/StateHIP/co.pdf", "passage_text": "For example, if you were 8 years old when you were last treated in the hospital, the hospital must keep your records 20 years (28-8=20). It is recommended that doctors must keep your medical records for a minimum of 7 years after your last visit. In the case of a minor, your doctor should keep your record at least 7 years after the last visit or until you reach the age of 25, whichever occurs later. Health care providers may charge for copying your medical record for you. Under Colorado law, your provider is allowed to charge you no more than the following fees: $14 for the first ten or fewer pages; 50¢ per page for pages 11-40; and 33¢ per page for pages 41 and up."}, {"url": "http://www.lsnjlaw.org/Health-Care/Patient-Rights/Pages/How-to-Get-a-Copy-of-Your-Medical-Records-in-New-Jersey.aspx", "passage_text": "How long do I have to wait to get my copy? Doctors and hospitals have 30 days from the time they receive your written request to give you the copy of your medical records. In practice, your records are usually copied and ready for you to receive in person in a week to 10 days. Doctors may charge you no more than $1 per page or $100 for your entire medical record, whichever amount is less. If your record is fewer than 10 pages, the doctor is allowed to charge you $10. Doctors are also allowed to charge an administrative fee of no more than $10 or 10% of the copying cost, whichever is less."}, {"url": "http://namimass.org/wp-content/uploads/Your-Medical-Record-Rights-Mass.pdf", "passage_text": "For example, doctors in Massachusetts must keep medical records for at least 7 years from the date of the last patient encounter. If the patient is a minor, the doctor must keep the medical record for 7 years or until the patient reaches the age of 9, whichever is longer. Massachusetts hospitals must keep medical records at least 30 years after the discharge or final treatment of the patient. "}, {"url": "http://www.health.ny.gov/publications/1443/", "passage_text": "A. Once your request is received, a physician or health care facility has 10 days to provide you with an opportunity to inspect your records. The law does not provide a specific time period by which copies of medical records must be provided. However, the state Health Department considers 10 to 14 days to be a reasonable time in which a practitioner should respond to such a request. A. A written appeal must be filed with the New York State Health Department. A provider has 10 days to provide copies of the records and an explanation for the denial to the chair of the state Medical Records Access Review Committee."}, {"url": "http://www.op.nysed.gov/prof/mhp/mhppg4.htm", "passage_text": "You should plan to retain records for a longer period, when necessary, such as a patient with a long-term condition whose treatment will continue beyond the statutory requirement. You must keep records for 6 years or until the patient turns 22 years of age, which ever is longer. "}, {"url": "http://www.health.ny.gov/publications/1443/", "passage_text": "A. Yes, but not forever. Physicians and hospitals are required by state law to maintain patient records for at least six years from the date of the patient's last visit. A doctor must keep obstetrical records and records of children for at least six years or until the child reaches age 19, whichever is later. A. A written appeal must be filed with the New York State Health Department. A provider has 10 days to provide copies of the records and an explanation for the denial to the chair of the state Medical Records Access Review Committee."}, {"url": "http://www.lsnjlaw.org/Health-Care/Patient-Rights/Pages/How-to-Get-a-Copy-of-Your-Medical-Records-in-New-Jersey.aspx", "passage_text": "Hospitals may charge you no more than $1 per page or $100 for the first 100 pages of your record. For records with more than 100 pages, hospitals are allowed to charge 25¢ a page for pages in excess of 100 pages or a maximum of $200. They may also charge the cost of mailing the records. Doctors may charge you no more than $1 per page or $100 for your entire medical record, whichever amount is less. If your record is fewer than 10 pages, the doctor is allowed to charge you $10. Doctors are also allowed to charge an administrative fee of no more than $10 or 10% of the copying cost, whichever is less."}, {"url": "http://www.answers.com/Q/How_long_do_you_have_to_keep_mental_health_records", "passage_text": "How long do you keep employment records?     Answer       You should keep all your employment records to prove in court though social security will only need to see 7years, it's worth keeping the … last 10 years as a precaution     Answer     Payroll records, I keep three years. It is necessary to preserve and keep personal records. When it comes to Tax Records, if it is 1099 forms, the minimum is three years. The same duration should be used for othe … r paperwork as well which certifies that you filed your income tax return."}]