[{"url": "http://wattsbarlakeinfo.com/", "passage_text": "Watts Bar Lake Info.Com is an information packed internet site serving all of the counties and communities surrounding Watts Bar Lake. Come visit Watts Bar Lake and see all of the wonderful things we have to offer our visitors. Take your next vacation at Watts Bar Lake. Stay at one of Watts Bar Lake Cabin rentals or Watts Bar Lake house boat rentals and other Watts Bar Lake lodging."}, {"url": "https://en.wikipedia.org/wiki/Watts_Bar_Lake", "passage_text": "The partially navigable Emory River connects with the Clinch near the TVA's Kingston Steam Plant just upriver from the meeting with the Tennessee. Including the Clinch and Emory arms, Watts Bar has 722 miles (1,160 km) of shoreline and over 39,000 acres (160 km²) of water surface. Minor tributaries include Poplar Creek, Caney Creek, and White's Creek. The lake contains several large islands, most notably Thief Neck Island, Long Island, and Sand Island. The Clinch River connects to the main channel of the lake at mile 568 (35°51′50″N 84°31′50″W﻿ / ﻿35.86389°N 84.53056°W﻿ / 35.86389; -84.53056﻿ (Clinch River mouth)) near Southwest Point (site of Andrew Jackson and John Sevier 's 1803 confrontation) in Kingston,"}, {"url": "https://en.wikipedia.org/wiki/Watts_Bar_Dam", "passage_text": "Location [edit]. Watts Bar Dam is located approximately 530 miles (850 km) upstream from the mouth of the Tennessee River, roughly halfway between Knoxville and Chattanooga. Just north of the dam, the Tennessee absorbs the Piney River, which flows down from the Cumberland Plateau to the west. Watts Bar provides 722 miles (1,162 km) of shoreline and over 39,090 acres (15,820 ha) of water surface. Watts Bar Dam is 112 feet (34 m) high and stretches 2,960 feet (900 m) across the Tennessee River."}, {"url": "http://tnwatchablewildlife.org/watchareadetails.cfm?uid=09072713580319569&region=Watts_Bar_WMA_-_Long_Island_Unit&statearea=East_Tennessee", "passage_text": "Policies & Privacy ©Copyright 2015 TWRA TENNESSEE WILDLIFE VIEWING TRAIL » East Tennessee View Larger Map Share Watts Bar WMA, Long Island Unit Long Island, Watts Bar River Mile 573Site directions to lake access: From US 70 in Kingston, take Hwy 58 south 3.6 miles to River Road (Hwy 304). To view Google Maps, enable JavaScript by changing your browser options, and then try again. View Larger Map Share Watts Bar WMA, Long Island Unit Long Island, Watts Bar River Mile 573Site directions to lake access: From US 70 in Kingston, take Hwy 58 south 3.6 miles to River Road (Hwy 304)."}, {"url": "http://tnwatchablewildlife.org/watchareadetails.cfm?uid=09072713580319569&region=Watts_Bar_WMA_-_Long_Island_Unit&statearea=East_Tennessee", "passage_text": "Long Island, Watts Bar River Mile 573. Site directions to lake access: From US 70 in Kingston, take Hwy 58 south 3.6 miles to River Road (Hwy 304). Turn right and follow River Road along the eastern shore. Also, from Rockwood, take US 27/ Hwy 29 south to Spring City for access to the western shore. To view Google Maps, enable JavaScript by changing your browser options, and then try again. View Larger Map Share Watts Bar WMA, Long Island Unit Long Island, Watts Bar River Mile 573Site directions to lake access: From US 70 in Kingston, take Hwy 58 south 3.6 miles to River Road (Hwy 304)."}, {"url": "http://www.hornsbyhollowcampground.com/", "passage_text": "We have added single and double ride Tribe Kayaks to our rental fleet. Check out the What's New tab for pictures and information. Located on beautiful Watts Bar Lake, surrounded by the Smoky Mountains, Hornsby Hollow Campground is favored by all its visitors. The spacious camp sites and immaculate grounds provide a relaxing and memorable experience for family and friends. -Kim and Andy Klinker, Campground Managers A little about Watts Bar Lake: Watts Bar Lake provides 783 miles of shoreline for fishing, boating, swimming, and skiing. With a surface area of 39,000 acres, it's an ideal lake for all water sports."}, {"url": "https://en.wikipedia.org/wiki/Watts_Bar_Dam", "passage_text": "Watts Bar Dam is located approximately 530 miles (850 km) upstream from the mouth of the Tennessee River, roughly halfway between Knoxville and Chattanooga. Watts Bar provides 722 miles (1,162 km) of shoreline and over 39,090 acres (15,820 ha) of water surface. Watts Bar Dam is 112 feet (34 m) high and stretches 2,960 feet (900 m) across the Tennessee River."}, {"url": "https://en.wikipedia.org/wiki/Watts_Bar_Dam", "passage_text": "Watts Bar Dam is named for Watt Island, a sandbar located at the dam site prior to the dam's construction. Watts Bar provides 722 miles (1,162 km) of shoreline and over 39,090 acres (15,820 ha) of water surface. Watts Bar Dam is 112 feet (34 m) high and stretches 2,960 feet (900 m) across the Tennessee River."}]