[{"url": "http://drlwilson.com/Articles/VEGETABLES.htm", "passage_text": "Do not eat the nightshade family vegetables: all tomatoes, white and red potatoes, eggplant and all peppers. This includes fresh red and green peppers, and hot peppers. The only exception is a little cayenne pepper is fine as a spice. Root vegetables deserve special mention and are too often ignored. Carrots, onions, turnips, parsnips, rutabaga, daikon (white radish), celery root, garlic, ginger root, red beets, golden beets, black, white and red radishes, burdock root and others are among them."}, {"url": "http://www.celiac.com/gluten-free/topic/74961-are-parsnips-and-turnips-root-vegetables/", "passage_text": "Are Parsnips and Turnips Root Vegetables (and Nightshades) and should I be avoiding them if I have an ulcer? I'm making stew tomorrow and I've discovered that I can't handle potatoes. They are both root vegetables and are not nightshades. They sound just right for a root vegetable stew (rutabagas too). They are both root vegetables and are not nightshades. They sound just right for a root vegetable stew (rutabagas too). Thanks!!! Loey. 0."}, {"url": "http://www.answers.com/Q/List_of_nightshade_vegetables", "passage_text": "1 Nightshade Vegetables and Arthritis Nightshade vegetables are an interesting and unique group of plants. 2  The most famous representatives of this group are tomatoes, eggplants, and potatoes. 1 The most famous representatives of this group are tomatoes, eggplants, and potatoes. 2  The connection betwe…. 3  Nightshade Vegetables: Aggravating Arthritis Nightshade vegetables include many people's favorites, such as potatoes, tomatoes, hot peppers, and eggplant."}, {"url": "https://en.wikipedia.org/wiki/Parsnip", "passage_text": "The parsnip (Pastinaca sativa) is a root vegetable closely related to the carrot and parsley. It is a biennial plant usually grown as an annual. Its long tuberous root has cream-colored skin and flesh and can be left in the ground when mature as it becomes sweeter in flavor after winter frosts. The parsnip is native to Eurasia. It has been used as a vegetable since antiquity and was cultivated by the Romans, although there is some confusion in the literature of the time between parsnips and carrots."}, {"url": "http://www.nutrition-and-you.com/parsnips.html", "passage_text": "Parsnips are sweet, succulent underground taproots closely related to the carrot family of vegetables. They indeed have similar appearance and growth characteristics as other Apiaceae family members like carrots, parsley, celery, cumin, dill, etc. As in carrots and other members of apiaceae family vegetables, parsnip too contains many poly-acetylene anti-oxidants such as falcarinol, falcarindiol, panaxydiol, and methyl-falcarindiol."}, {"url": "http://www.answers.com/Q/List_of_nightshade_vegetables", "passage_text": "Some starchy  vegetables include beans, beats, carrots, corn, green peas,  parsnips, pumpkin, sweet potatoes, taro, white potatoes, winter  squash, and yams. A balanced meal with these vegetables will not  lead to an excess in starches. 1 person found this useful. 1 The most famous representatives of this group are tomatoes, eggplants, and potatoes. 2  The connection betwe…. 3  Nightshade Vegetables: Aggravating Arthritis Nightshade vegetables include many people's favorites, such as potatoes, tomatoes, hot peppers, and eggplant."}, {"url": "http://www.livestrong.com/article/265055-list-of-foods-for-those-allergic-to-nightshade/", "passage_text": "Common foods in the nightshade include potatoes, tomatoes, bell peppers, hot peppers, eggplants, pimentos, huckleberries, tomatillos, paprika, ground cayenne pepper and hot sauce. You may find some common substitutes for the nightshade foods helpful. Sweet potatoes. Prepare sweet potato fries or chips instead of the traditional white potato versions, or serve sweet potatoes or yams mashed, whipped or roasted. Other root vegetables which may remind you of starchy white vegetables include winter squash, turnips, parsnips and rutabagas."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/vgen/nightshade-vegetable.htm", "passage_text": "Several of these plants are cultivated in the home garden and are known as nightshade vegetables. In fact, those that are edible happen to include some of the most commonly eaten vegetables today. Advertisement List of Nightshade Vegetables Here is a list of the most common (and maybe not so common) vegetables in the nightshade family. While these are perfectly safe to eat under ordinary circumstances, some people may be sensitive to these plants regardless, suffering allergic reactions. "}, {"url": "https://currituck.ces.ncsu.edu/2012/05/vegetable-crop-rotation/", "passage_text": "Members of the mustard family are cabbage, collards, brussels sprouts, kale, cauliflower, broccoli and kohlrabi. The legumes are all peas and beans. Parsley includes carrots, parsley, celery and parsnips. Nightshade vegetables include eggplant, peppers, potatoes and tomatoes. Grasses include rye, sweet corn and popcorn. Lily members are onions, leeks, shallots and chives. "}]