[{"url": "http://www.newsmax.com/FastFeatures/supplements-for-knee-joints/2014/11/20/id/370520/", "passage_text": "Calcium is helpful in reducing joint pain and inflammation and is one of the best supplements for knee joints. 8) Vitamin C: Vitamin C is an anti-oxidizing agent that helps protect connective tissues like the ligaments, tendons, and skin, not to mention the bones and joints. Vitamin C helps make collagen which is important for the flexibility of muscles and blood vessels. 1) Glucosamine: This is one of the best supplements for knee joints. This fatty acid is a part of cartilage and other components of the joints. Glucosamine helps rebuild the bones and prevent cartilage wear and tear. It also prevents inflammation of the joints and adjoining muscles."}, {"url": "http://www.bodybuilding.com/fun/md86.htm", "passage_text": "Recovery and repair of tissues require a host of vitamins and minerals that participate in synthesis of new cells and tissue. For example, certain vitamins and minerals are required to facilitate the formation of endogenous anti-inflammatory compounds, including: 1  Vitamin B6. 2  Vitamin E. 3  Vitamin C. 4  Niacin. 5  Zinc. 6  Selenium. "}, {"url": "http://www.healthy-diet-healthy-you.com/Anti-inflammatory-Supplement.html", "passage_text": "1 The main thing to remember when using Vitamin C as an anti-inflammatory supplement is that your body doesn’t store it and supplies can run low, if you don’t replenish regularly with sufficient Vitamin C rich foods or supplements. So if you’re needing pain relief from osteoarthritis; help or prevention for cardiovascular disease; lowering your risk for cancer; help with a sluggish liver; or wanting to avoid the complications of diabete s, the below top anti-inflammatory supplements may help."}, {"url": "http://www.livestrong.com/article/412251-what-supplement-is-good-for-inflamed-muscles/", "passage_text": "Glutamine helps reduce inflammation and may help boost the immune system in athletes, because prolonged athletic training may lower overall glutamine levels. This supplement is typically taken in dosages of 500 milligrams, one to three times a day, the UMMC states. There are also omega-3 fatty acid supplements, also called fish oil. Omega-3 fatty acids help reduce inflammation and can help reduce your risk of developing conditions like heart disease, high cholesterol, cancer and arthritis."}, {"url": "http://www.livestrong.com/article/412251-what-supplement-is-good-for-inflamed-muscles/", "passage_text": "There is no cure, but some supplements may ease muscle inflammation. Before using any supplements for muscles that are inflamed, see your doctor to confirm you do not have a more serious injury, and talk with your physician about whether supplements are safe for you to take. There are also omega-3 fatty acid supplements, also called fish oil. Omega-3 fatty acids help reduce inflammation and can help reduce your risk of developing conditions like heart disease, high cholesterol, cancer and arthritis."}, {"url": "https://www.sharecare.com/health/vitamins-supplements/b-vitamins-reduce-pain-inflammation", "passage_text": "Homocysteine in turn is associated with inflammation. These same two B vitamins are also being studied for a possible role in reducing nerve pain associated with diabetes, called diabetic neuropathy, as well as nerve pain associated with certain kinds of chemotherapy. Some research points to B vitamins in complex carbohydrates as being important in ending pain, particularly nocioceptive pain, which comes when you have a sprain, fracture, bump, bruise, inflammation from infection or arthritic disorder, and myofascial pain (abnormal muscle stresses)."}, {"url": "http://www.naturalantiinflammatory.org/anti-inflammatory-vitamins.html", "passage_text": "______________________________________________________________________________. The different roles and actions of vitamins for inflammation is an important concept that should be known to all. These 6 vitamins seem to have anti-inflammatory actions that work in reducing inflammation in our body naturally. It is fat-soluble, it is generally found in fat-rich foods. It is also commonly found in nuts (hazelnuts, and almonds), seeds (sunflower seeds), vegetables oils (soybean, wheat germ, corn, and sunflower oils), cereals and dark green leafy vegetables (broccoli and spinach)."}, {"url": "http://www.naturalantiinflammatory.org/anti-inflammatory-vitamins.html", "passage_text": "This is an anti-inflammatory vitamin that helps inflammation to recede. High intake is contraindicated for individuals taking anticoagulant medications such as Warfarin (coumarin). Vitamin B. Vitamin B complex is a group of anti-inflammatory vitamins sharing the B status commonly known as the ‘Happy Vitamins’. Of these Vitamins, B1, B6 and B12 have notable anti-inflammatory properties. It is fat-soluble, it is generally found in fat-rich foods. It is also commonly found in nuts (hazelnuts, and almonds), seeds (sunflower seeds), vegetables oils (soybean, wheat germ, corn, and sunflower oils), cereals and dark green leafy vegetables (broccoli and spinach)."}, {"url": "http://www.evitamins.com/a/vitamin-b12-joint-inflammation-334", "passage_text": "Vitamin B12 is a popular supplement for many reasons. The benefits of vitamin B12 include increased energy, improvement in mood, weight loss and healthy hair and skin. But this popular B vitamin may also play an important role in a bodily process that can affect our bodies in many different ways: Inflammation. "}]