[{"url": "http://homeguides.sfgate.com/long-until-marigolds-flower-seed-67615.html", "passage_text": "This will improve soil drainage and fertility. Plant marigold seeds in the soil 1/4 inch deep and water the area deeply. The appropriate spacing for marigolds depends on the mature size of the plant. French marigolds (Tagetes patula) are smaller plants and can be spaced 6 to 9 inches apart. The larger African marigolds (Tagetes erecta) need around 18 inches of space between plants. In temperate coastal climates, where soil temperatures warm quickly in the spring and where spring temperatures are mild, marigolds can easily be direct seeded into the ground at nearly any point in the early to mid spring. The best month to sow marigold seeds is in early April."}, {"url": "http://www.gardeningknowhow.com/ornamental/flowers/marigold/growing-marigold-flowers.htm", "passage_text": "Advertisement. In order for your marigolds to be ready for planting outdoors in the spring, you will need to start growing marigolds from seed indoors about 50 to 60 days before the last frost date. Start with a tray or pot filled with damp soilless potting mix. Sprinkle the marigold seeds over the potting mix. Typically, marigolds will take three to four days to germinate, but may take a few days longer if the location is cooler. Once the marigold seedlings appear, remove the plastic wrap and move the tray to a location where the seedlings will get at least five hours or more of light each day."}, {"url": "http://motherhood.modernmom.com/long-until-marigolds-flower-seed-9397.html", "passage_text": "Planting Plan. Choose a sunny location for fastest flowering; marigolds do fine in up to 20 percent shade, but take longer to bloom. Use a small garden rake to break up soil, and remove any weeds or rocks. Place seeds 6 inches apart. Cover with 1/4 inch of fine soil. Tamp down lightly, and soak gently so that seeds aren't displaced"}, {"url": "http://www.almanac.com/plant/marigolds", "passage_text": "1 Though they grow in almost any soil, marigolds thrive in moderately fertile, well-drained soil. 2  Sow them directly into the garden once the soil is warm, or start seeds indoors about a month to 6 weeks before the last spring-frost date. 3  The seeds germinate easily, but watch out for damping off if you start them inside. Then fertilize lightly with a balanced plant food. It may take a week or two for the marigolds to recover but they should be fine. Next year, if you grow marigolds, you really want to pinch or cut back the new buds and foliage tips when they are 6 to 78 inches tall."}, {"url": "http://homeguides.sfgate.com/long-until-marigolds-flower-seed-67615.html", "passage_text": "Marigolds take around 45 to 50 days to flower after you plant seeds, so seeds sown in early April should flower by May. In temperate coastal climates, where soil temperatures warm quickly in the spring and where spring temperatures are mild, marigolds can easily be direct seeded into the ground at nearly any point in the early to mid spring. The best month to sow marigold seeds is in early April."}, {"url": "http://www.almanac.com/plant/marigolds", "passage_text": "1 Marigolds need lots of sunshine. 2  Though they grow in almost any soil, marigolds thrive in moderately fertile, well-drained soil. 3  Sow them directly into the garden once the soil is warm, or start seeds indoors about a month to 6 weeks before the last spring-frost date. Then fertilize lightly with a balanced plant food. It may take a week or two for the marigolds to recover but they should be fine. Next year, if you grow marigolds, you really want to pinch or cut back the new buds and foliage tips when they are 6 to 78 inches tall."}, {"url": "http://runescape.wikia.com/wiki/Marigold_seed", "passage_text": "A Marigold seed is used in the Farming skill to grow Marigolds. When fully grown, it protects potatoes, onions, and tomatoes from disease. They may be obtained by pickpocketing Master Farmers, stealing them from Olivia 's seed stall in Draynor Village, or purchasing them from Olivia's Draynor Seed Market. "}, {"url": "http://homeguides.sfgate.com/long-until-marigolds-flower-seed-67615.html", "passage_text": "When it's time to plant marigold seeds, amend the soil in the area with organic matter, like peat moss or compost. Do this by spreading a 1- to 2-inch layer of organic matter over the surface of the soil, then work the organic matter into the soil with a rake or garden hoe. In temperate coastal climates, where soil temperatures warm quickly in the spring and where spring temperatures are mild, marigolds can easily be direct seeded into the ground at nearly any point in the early to mid spring. The best month to sow marigold seeds is in early April."}, {"url": "http://homeguides.sfgate.com/long-marigolds-germinate-77848.html", "passage_text": "Whether you use them as cut flowers, grow them in a pot or allow them to adorn a garden border, marigolds (Tagetes spp.) are bound to steal the show. Depending on the variety, marigolds can grow 8 to 40 inches tall, and develop blooms that can range in size from 1 to 5 inches. For germination within about five to 10 days, start the seeds indoors six weeks before the last spring frost and expose them to ideal conditions. Marigold seeds can germinate in light and darkness as long as they're exposed to a temperature of 70 degrees Fahrenheit. During the germination period, remove the plastic daily to aerate the tray and check the soil moisture."}]