[{"url": "http://www.answers.com/Q/In_which_region_is_Alaska_located", "passage_text": "Alaska is on the northwest coast of the North American continent. Canada is to the east, the Arctic Ocean is to the north, and the Pacific Ocean is to the west and south. Russ … ia is further west across the Bering Strait. On the very west end of Canada, but belongs to the United States of America."}, {"url": "http://oldclimate.gi.alaska.edu/ClimTrends/30year/regions1.html", "passage_text": "The climate of any given location in Alaska is largely determined by the climate region in which it lies. The influence of the Northern Pacific is largely responsible for the climate of the South Central and South Eastern regions of the state."}, {"url": "http://alaska.gov/kids/learn/region.htm", "passage_text": "At the heart of the region is Fairbanks, Alaskas second largest city. Born in the gold rush, this trade and transportation center houses military bases, and the main campus of the University of Alaska. Mt. McKinley, the highest mountain in North America, is surrounded by Denali National Park and Preserve."}, {"url": "http://alaska.gov/kids/learn/region.htm", "passage_text": "Southcentral is Alaskas most easily accessible region. More than half of Alaskas residents live here, a recreational paradise of glaciers, fjords, roadside lakes, clamming beaches, and salmon streams. Here, fall puts on a spectacular show."}, {"url": "http://alaska.gov/kids/learn/region.htm", "passage_text": "State Motto: North to the Future. State Capital: Juneau, located in the Southeast region of Alaska, has a population of 31,275 (2010 Census). Alaska Map: Alaska Flag: NOTE: The State of Alaska is not responsible for the content/information on any site outside of a State of Alaska department."}, {"url": "http://www.mapsofworld.com/usa/states/alaska/alaska-location-map.html", "passage_text": "Alaska, the largest state of US, is bordered by Canada from the east, Arctic Ocean from the north, and the Pacific Ocean from the west and south. The state has an area of 663,267 square miles. The coordinates of the state are Latitude 51°20'N to 71°50'N & Longitude 130°W to 172°E. Last Updated on: July 3, 2015."}, {"url": "http://www.mapsofworld.com/usa/usa-maps/united-states-regional-maps.html", "passage_text": "Outside of the continental United States, Alaska and Hawaii can be considered two additional regions."}]