[{"url": "http://www.webmd.com/a-to-z-guides/lactic-acid-blood-test", "passage_text": "Lactic acid levels get higher when strenuous exercise or other conditions-such as heart failure, a severe infection (sepsis), or shock-lower the flow of blood and oxygen throughout the body."}, {"url": "http://www.webmd.com/a-to-z-guides/lactic-acid-blood-test", "passage_text": "A lactic acid test is a blood test that measures the level of lactic acid made in the body. Most of it is made by muscle tissue and red blood cells. When the oxygen level in the body is normal, carbohydrate breaks down into water and carbon dioxide. When the oxygen level is low, carbohydrate breaks down for energy and makes lactic acid."}, {"url": "http://www.mattroberts.co.uk/articles/blood-lactate/", "passage_text": "Lactate that is not oxidized in this way diffuses from the exercising muscle into the capillaries and it is transported via the blood to the liver. Lactate can then be converted to pyruvate in the presence of oxygen, which can then be converted into glucose."}, {"url": "http://www.cyclingnews.com/features/lactate-and-lactic-acid-dispelling-the-myths/", "passage_text": "Lactic acid does not exist in the blood. As soon as it is produced, the substance thought to be lactic acid disassociates into lactate and hydrogen (More on lactate and hydrogen below). A lactate analyzer measures the concentration of lactate (a useful fuel)"}, {"url": "https://labtestsonline.org/understanding/analytes/lactate/tab/test", "passage_text": "A high lactate level in the blood means that the disease or condition a person has is causing lactate to accumulate. In general, a greater increase in lactate means a greater severity of the condition. When associated with lack of oxygen, an increase in lactate can indicate that organs are not functioning properly."}, {"url": "https://labtestsonline.org/understanding/analytes/lactate/tab/test", "passage_text": "The lactate test measures the level of lactate in the blood at a given point in time. A normal lactate level indicates that a person does not have lactic acidosis, that there is sufficient oxygen at the cellular level, and/or that their signs and symptoms are not caused by lactic acidosis. ^ Back to top."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/003507.htm", "passage_text": "Lactic acid is mainly produced in muscle cells and red blood cells. It forms when the body breaks down carbohydrates to use for energy during times of low oxygen levels. Times when your body's oxygen level might drop include: 1  During intense exercise."}]