[{"url": "http://www.seedguides.info/flax-seed/", "passage_text": "The fatty acids contained in flax seeds also raise the levels of good cholesterol while lowering high blood pressure. Flax seeds contain an omega 6 fatty acid known as linoleic acid, which is considered to be a very important component of human health and wellness. In addition, flax seeds are high in dietary fiber, which promotes good digestion. For vegetarians, flax seeds are an excellent dietary supplement. Consumption of flax seeds can prevent the swelling and inflammation of the prostate and reduce the urgency to urinate. Similarly, healthy sperms and improved blood flow to penis, reducing impotency are the other important benefits of flax seed for men. Numerous flaxseed oil benefits for women are known."}, {"url": "http://www.bobsredmill.com/organic-brown-flaxseeds.html", "passage_text": "Details. Organic brown flaxseed, also known as linseed, comes from the flax plant, which is cultivated for its seeds as well as its fiber. The seeds, which are a little larger than sesame seeds, contain omega-3 fatty acids, dietary fiber and lignans Used since ancient times, flax is renowned for myriad health benefits. "}, {"url": "https://en.wikipedia.org/wiki/Flax", "passage_text": "Flax (also known as common flax or linseed), with the binomial name Linum usitatissimum, is a member of the genus Linum in the family Linaceae. It is a food and fiber crop that is grown in cooler regions of the world. The textiles made from flax are known in the West as linen, and traditionally used for bed sheets, underclothes and table linen."}, {"url": "http://www.pipingrock.com/flaxseed-linseed-oil?prd=D0005P", "passage_text": "Flaxseed oil (also known as linseed oil) is extracted from flax seeds and used to promote wellness across multiple body systems. Flaxseed oil is abundant in health-enhancing essential fatty acids, most notably omega-3 fatty acids (especially alpha-linolenic acid, or ALA) and omega-6 fatty acids (linoleic acid). More Info. Flax and flaxseed (linseed) oil promote overall wellness. Rich in omega-3 and omega-6 fatty acids, it is the best vegan source of omega-3 fatty acids. Flaxseed Oil is also known for: 1  Supporting cardiovascular health. **. 2  Promoting women's health and hormonal balance. **"}, {"url": "http://www.nutrition-and-you.com/flax-seed.html", "passage_text": "Flax seed nutrition facts. Flax seed, also known as linseed, is one of the ancient cultivated crops since Mesopotamian times, grown for its oil seeds and fiber. Its chewy seeds are packed with full of nutrients, omega-3 fatty acids, antioxidants, minerals, and essential vitamins. In general, there exist two common cultivars of flax; one is predominantly grown for its oil seeds and the other variety for fiber. Seed flax generally features brown, and yellow or golden-yellow color seeds, with most types having similar nutritional values and equal amounts of short-chain omega-3 fatty acids."}, {"url": "http://www.dermaharmony.com/ingredients/flax.aspx", "passage_text": "Flax is grown both for its fiber and seeds. Throughout history the flax plant has been used to make dyes, paints, paper, fabrics, fishing nets and soaps. The seeds produce an oil known as flaxseed oil or linseed oil. Flax seeds are super rich in omega-3 oils, those essential fatty acids that are all-important for our health, including the health of our hair and skin. The flax seed plant is an erect flowering annual with slender stems reaching up to 48 inches (120 cm) in height."}, {"url": "http://www.medicalnewstoday.com/articles/263405.php", "passage_text": "Flaxseeds (also called linseeds) are a rich source of micronutrients, dietary fiber, manganese, vitamin B1, and the essential fatty acid alpha-linolenic acid, also known as ALA or omega-3. The seeds come from flax, one of the oldest fiber crops in the world-known to have been cultivated in ancient Egypt and China. Flaxseed is a source of healthy fat, antioxidants, and fiber; modern research has found evidence to suggest that flaxseed can also help lower the risk of diabetes, cancer, and heart disease. "}, {"url": "http://umm.edu/health/medical/altmed/supplement/flaxseed-oil", "passage_text": "Flaxseed oil comes from the seeds of the flax plant (Linum usitatissimum, L.). Flaxseed oil contains both omega-3 and omega-6 fatty acids, which are needed for health. "}, {"url": "http://www.seedguides.info/flax-seed/", "passage_text": "Flax seed (commonly spelled as flaxseed), also known as linseed, are the seeds of an annual plant called, Linum usitatissimum, which has been cultivated for thousands of years for textile fiber and nutrition. Consumption of flax seeds can prevent the swelling and inflammation of the prostate and reduce the urgency to urinate. Similarly, healthy sperms and improved blood flow to penis, reducing impotency are the other important benefits of flax seed for men. Numerous flaxseed oil benefits for women are known."}]