[{"url": "http://www.understandingitaly.com/food-content/recipes/passata.html", "passage_text": "La Cucina Italiana-Italian Passata. Passata is an uncooked, thick tomato sauce made entirely from raw tomatoes with all seeds and skins removed. It originated in southern Italy where it is made by almost every family when there is a glut of tomatoes at the end of the summer, around the end of September. "}, {"url": "https://en.wikipedia.org/wiki/Tomato_pur%C3%A9e", "passage_text": "Tomato puree purée is a thick liquid made by cooking and straining. Tomatoes the difference between tomato, paste tomato, puree purée and tomato sauce, is consistency tomato puree has a thicker consistency and a. Deeper flavour the definitions of tomato puree purée vary from. country to country The difference between tomato paste, tomato puree, purée and tomato sauce is, consistency tomato puree has a thicker consistency and a deeper. Flavour the definitions of tomato puree purée vary from country."}, {"url": "http://www.bbc.co.uk/food/passata", "passage_text": "Passata is made from ripe tomatoes that have been pureed puréed and sieved to remove the skin and. Seeds it is sold in jars and can be smooth or chunky depending on the. sieving "}, {"url": "http://www.everyday-vegetarian-recipes.com/what-is-passata.html", "passage_text": "Usually, high quality ripe tomatoes are used for passata, resulting in a well flavoured tomato base that is generally superior to standard canned tomatoes. Passata is an excellent base for sauces and perfect as a pizza sauce. You'll find it near the pasta sauces and canned tomatoes. Usually it is sold in a tall jar or a carton. For some reason, although it is found all over Italy and Europe in general, passata doesn't seem to be sold widely in the United States."}, {"url": "http://www.everyday-vegetarian-recipes.com/what-is-passata.html", "passage_text": "Where To Buy Passata. Passata is available in Italian delis. In Europe, passata is widely available in supermarkets. You'll find it near the pasta sauces and canned tomatoes. Usually it is sold in a tall jar or a carton. For some reason, although it is found all over Italy and Europe in general, passata doesn't seem to be sold widely in the United States."}, {"url": "http://ochef.com/409.htm", "passage_text": "Passata is a cooked tomato concentrate. In the case of the recipe you refer to, which calls for a small amount, you might prefer to substitute tomato paste rather than going to the trouble of making a batch of passata. There is also a growing body of thought that passata is an uncooked tomato concentrate. Remove the pork and use for anything you like. Add 2 or 3 tablespoons of tomato paste at a time and cook until drying. Add more, and do this over and over until the entire can is incorporated. The resulting passata will be brownish, shiny, and very concentrated, and can be used for many different dishes."}, {"url": "http://www.everyday-vegetarian-recipes.com/what-is-passata.html", "passage_text": "How To Make Passata. If you do not have the real thing, you can make a reasonable substitute at home. Use the best quality tomatoes you can find, drain them and sieve or pur&eacutee in a food processor. Don’t use tomato paste (a product which is known as tomato pur&eacutee in the UK and Ireland). You'll find it near the pasta sauces and canned tomatoes. Usually it is sold in a tall jar or a carton. For some reason, although it is found all over Italy and Europe in general, passata doesn't seem to be sold widely in the United States."}, {"url": "http://www.bbcgoodfood.com/recipes/817646/tomato-passata", "passage_text": "Make this delicious Italian passata from your fully ripened garden tomatoes, fresh basil, garlic and red onion. Good for meat, fish and pasta recipes. This recipe has been submitted by the Good Food community. Sign in or create a My Good Food account to upload your own recipe creations. "}, {"url": "http://www.cooksinfo.com/passata", "passage_text": "Newsletter sign up. Passata is a medium-thick, pourable, uncooked red tomato sauce made from crushed and strained tomatoes. It has about the same thickness as tomato ketchup. To make passata, tomatoes are skinned, then passed (thus the name) through sieves to crush the tomatoes and remove the seeds at the same time. Note that passata isn't cooked -- this isn't a ready to go pasta sauce -- but rather sauced tomatoes ready to go for whatever you need them for. Italians don't always make every pasta sauce totally from scratch. They often start with a bottle of passata. You can use it in making a pasta sauce, or as a spread on pizza"}, {"url": "http://www.thekitchn.com/what-is-tomato-passata-and-how-156321", "passage_text": "While most passatas are just plain tomatoes, some are sold with additions, such as basil, so read your label carefully if this is an issue. Tomato passata can be used in any recipe that calls for tomatoes where it is not important that there be pieces of tomato. You could make a tomato sauce from passato, for example. Or tomato soup. I've seen it added to white beans to make a stew. And tomato paste is cooked down and much thicker. You would not want to substitute either product if passata is called for in your recipe. If you cannot find it in your store, take plain canned tomatoes and run them through a sieve or a food mill."}]