[{"url": "http://home.costhelper.com/bathroom-addition.html", "passage_text": "1 Adding new floor space to your home for a basic 6x8-foot bathroom addition starts around $25,000-$50,000 and goes up depending on complexity, quality of fixtures, number of amenities and local labor rates."}, {"url": "http://www.ehow.com/about_5592249_much-cost-add-bathroom_.html", "passage_text": "Adding a half-bathroom will fall in the lower end of the cost spectrum, as a half-bath requires only a toilet and a sink. If you have to add additional floor space to your home to add a bathroom, expect to pay $25,000 to $50,000 and up, depending on complexity and local labor rates."}, {"url": "http://www.zillow.com/advice-thread/Can-anyone-give-me-a-cost-estimate-to-add-a-bathroom-and-250-300-sq-ft-addition/475386/", "passage_text": "(40sqft). Cost on adding a bathroom depends if you have an existing room or if you will be adding a new roof to cover the new room. The latter is the most expensive as you will have framing costs (and permits and blueprints,etc) and could cost $10-$15k."}, {"url": "http://www.ehow.com/about_5592249_much-cost-add-bathroom_.html", "passage_text": "Cost. In late 2009, converting existing floor space in an area such as a garage, basement or attic to include a bathroom cost between $3,000 and $6,000. Depending on the extravagance of the bathroom and its distance away from plumbing lines, it could cost between $7,000 and $25,000 or more."}, {"url": "http://home.costhelper.com/bathroom-addition.html", "passage_text": "1 Remodeling Magazine pegs the price of a 6x8-foot bathroom addition at averages of $33,188-$41,195 in the Midwest, $34,876-$42,491 along the East Coast and $35,987-$47,052 in the Western states. 2  For a spa-quality 100-square-foot master bath the survey says it averages $75,812 nationwide."}, {"url": "http://home.costhelper.com/add-room.html", "passage_text": "1 The cost of adding a porch can range from $50-$120 for do-it-yourself materials for a simple concrete slab to $3,000-$6,000 to have someone pour a 50x20-foot slab."}, {"url": "http://www.reliableremodeler.com/ask/how-much-does-it-cost-to-add-a-bathroom-on-to-a-house/", "passage_text": "A good price range for a bathroom addition might be $150 to $250 a square foot and where you end up can depend on just how expensive your tastes happen to be. If you visit a local home improvement store around Griffin, it should be easy to see just how much fixtures can vary in cost."}, {"url": "http://home.costhelper.com/bathroom-addition.html", "passage_text": "1 However, costs can be $7,000-$25,000 or more for a more luxurious bathroom, or if the new bathroom is far from existing water and sewer lines."}]