[{"url": "http://ccm.net/forum/affich-106556-change-my-facebook-language-back-to-english", "passage_text": "Open facebook on your browser: http://www.facebook.com. In the bottom left of the page click on the language you are using for example: English (U.S). Then a window will appear to choose the language you want. Report. click on the third button at the top right of the facebook page...(it might be on the top left...it is the button with the little down arrow). then, click on the second one down. then, there is a horizontal line of buttons, and click on the fifth one in. that is the language setting button. all done."}, {"url": "http://www.romcartridge.com/2010/05/how-to-change-language-back-to-english.html", "passage_text": "There, you just have to click on English (UK) or English (US) according to the version of English you would like to have: the one for the United Kingdom or the one for the United States of America. This way your Facebook user interface will be again in English. How to Use Facebook Facebook Account and Timeline. Once you have logged in to Facebook, click on the small triangle at the top right hand corner of the page and then select the option that says “ Settings ,” which is the fifth option from bottom to top inside the appearing menu."}, {"url": "http://ccm.net/forum/affich-106556-change-my-facebook-language-back-to-english", "passage_text": "2. go to the bottom on the left side Facebook 2009 will be written. 3. Click on any thing appears just a little right of Facebook 2009. this word means language . 4. select English or double click English. now this page will appear in english but the next pages after u login will not. for that follow the steps bellow. Report. click on the third button at the top right of the facebook page...(it might be on the top left...it is the button with the little down arrow). then, click on the second one down. then, there is a horizontal line of buttons, and click on the fifth one in. that is the language setting button. all done."}, {"url": "http://www.ehow.com/how_8104761_change-language-facebook-profile.html", "passage_text": "Usually, Facebook displays English as the default language on your profile page, though it may change the language automatically based on your region as well. You can, however, change the language displayed on your Facebook profile page by configuring the General Account Settings screen. Since a language change affects all other pages and settings screens besides your profile page, do not change to a language that you do not know."}, {"url": "http://personalweb.about.com/od/facebooklanguage/a/Change-Facebook-Language-To-English.htm", "passage_text": "Click on the name of the language -- English, for example -- to change it to a different language. A pop-up box will appear with all the possible languages. Click the language you want, and your Facebook pages will be translated into that language. It's easy to change the language on Facebook to English or any other language. Facebook offers more than 70 different languages to choose from. The Facebook language settings menu is accessible in several places on the network. At the bottom left of most pages, Facebook displays your current language being displayed"}, {"url": "http://www.ehow.com/how_8104761_change-language-facebook-profile.html", "passage_text": "Any Facebook Page. Alternately, you can also change your language via any Facebook page. To do so, scroll down to the very bottom of a page and click your language. On the Select Your Language pop-up box that shows up, select your preferred language and click “Okay.”. You can, however, change the language displayed on your Facebook profile page by configuring the General Account Settings screen. Since a language change affects all other pages and settings screens besides your profile page, do not change to a language that you do not know."}, {"url": "http://www.ehow.com/how_8691634_switch-back-english-facebook.html", "passage_text": "Instructions. Visit facebook.com on your PC -- language settings are not available on the mobile site. Enter your email address and password into the fields at the top of the page, then click the Log In button. Scroll to the very bottom of the page. You will see the word Facebook followed by a copyright logo. Your current language is displayed next to the copyright symbol. Click on the language -- a popup window appears, displaying all the available languages. Click English, then select your desired version of English. "}, {"url": "http://personalweb.about.com/od/facebooklanguage/a/Change-Facebook-Language-To-English.htm", "passage_text": "Alternatively, you can click the top right corner under Account Settings on Facebook. One of the many settings that will appear is Language.. Click the Edit button next to Language and then select one from the list of languages that appears. It's easy to change the language on Facebook to English or any other language. Facebook offers more than 70 different languages to choose from. The Facebook language settings menu is accessible in several places on the network. At the bottom left of most pages, Facebook displays your current language being displayed"}]