[{"url": "https://en.wikipedia.org/wiki/Literal_and_figurative_language", "passage_text": "Literal and figurative language is a distinction within some fields of language analysis, in particular stylistics, rhetoric, and semantics. 1  Literal language uses words directly according to their proper meanings (signified). 2  Figurative (or non-literal) language uses words in figures of speech. It maintains a consistent meaning regardless of the context, with the intended meaning corresponding exactly to the meaning of the individual words. Figurative use of language is the use of words or phrases that implies a non-literal meaning which does make sense or that could [also] be true."}, {"url": "https://answers.yahoo.com/question/index?qid=20080913203357AA70VO6", "passage_text": "Best Answer: Figurative language is one of the most enhancing elements in poetry, as in other forms of writing, as in speech. When we use this tool to create images which evoke in the reader (fun for the writer, too!) things which opens chapters in ones imagination, so I would say, definitely use them. Using figurative language in a poem allows the poets to express their thoughts not by language but by metaphorical and symbolic imagery. This method, if used properly, can create different meanings from one person to another because we see things differently. The Sage · 7 years ago."}, {"url": "http://www.audioenglish.org/dictionary/figurative.htm", "passage_text": "• FIGURATIVE (adjective). The adjective FIGURATIVE has 2 senses: 1. (used of the meanings of words or text) not literal; using figures of speech. 2. consisting of or forming human or animal figures. Familiarity information: FIGURATIVE used as an adjective is rare."}, {"url": "https://kidskonnect.com/language/figurative-language/", "passage_text": "Figurative Language Examples. The definition of figurative language is when you describe something by comparing it with something else. There are few different ways to use figurative language. See below for more information and examples of figurative language and how to use it. Remove these ads."}, {"url": "http://www.grammar-monster.com/glossary/figurative_language.htm", "passage_text": "Figurative language is the use of words in an unusual or imaginative manner. Often figurative language involves the use of a metaphor, a simile, personification, hyperbole, idiom, a euphemism, and pun. However, as the term figurative language also covers unusual or imaginative word constructions (and not just word meanings), it also includes alliteration, assonance, consonance, and onomatopoeia. When most people think of figurative language, similes and metaphors spring to mind. However, the term figurative language covers a wide range of literary techniques. Here are some examples of figurative language in each of the categories: A metaphor asserts that one thing is something that it literally is not."}, {"url": "http://figurativelanguage.net/index.html", "passage_text": "To understand what figurative language is, it is important to start with a working definition of literal language. Literal language refers to a phrase or sentence that is to be taken at face value to mean exactly what it says. For example, if a sentence reads, he went outside the box, that means the man was in a box and went outside of that area to another space."}, {"url": "http://www.really-learn-english.com/figurative-language.html", "passage_text": "Figurative means that words are used in a way that is different from the usual meaning. That way the description is more interesting or impressive. Figurative language creates a picture in your mind. Literal means that you mean what you say exactly. Figurative comes from the word figure (also figure of speech). "}]