[{"url": "https://en.wikipedia.org/wiki/CMOS", "passage_text": "Complementary metal–oxide–semiconductor (CMOS) /ˈsiːmɒs/ is a technology for constructing integrated circuits. CMOS technology is used in microprocessors, microcontrollers, static RAM, and other digital logic circuits."}, {"url": "https://www.quora.com/What-is-the-difference-between-NMOS-PMOS-and-CMOS-transistors", "passage_text": "1 Each of these: PMOS, NMOS and CMOS is a MOSFET transistor. 2  Basically MOSFET uses a substrate or body which can be either p type or n type semiconductor, over which two regions whose doping type is different from that used for substrate is used. 3  Let us say the substrate is p-type, then two regions would be of n-type."}, {"url": "http://electronics.wikia.com/wiki/CMOS", "passage_text": "62 pages on this wiki. Complementary metal–oxide–semiconductor (' CMOS) (see-moss, Template:IPA2), is a major class of integrated circuits. CMOS technology is used in chips such as microprocessors, microcontrollers, static RAM, and other digital logic circuits."}, {"url": "http://whatis.techtarget.com/definition/CMOS-complementary-metal-oxide-semiconductor", "passage_text": "Part of the Microprocessors glossary: CMOS (complementary metal-oxide semiconductor) is the semiconductor technology used in the transistor s that are manufactured into most of today's computer microchip s."}, {"url": "http://www.answers.com/Q/What_is_CMOS_FET_transistor", "passage_text": "CMOS, short for Complementary Metal Oxide Semiconductor Is an MOS technology in which both P-channel and N-channel devices are fabricated on the same die CMOS is a widely used type of semiconductor. CMOS semiconductors use both NMOS (negative polarity) and PMOS (positive polarity) circuits."}, {"url": "https://kb.iu.edu/d/ahxf", "passage_text": "CMOS, short for Complementary Metal Oxide Semiconductor, is a low-power, low-heat semiconductor technology used in contemporary microchips, especially useful for battery-powered devices. The specific technology is explained in detail on the CMOS Wikipedia page."}, {"url": "http://whatis.techtarget.com/definition/transistor", "passage_text": "Today's computers use circuitry made with complementary metal oxide semiconductor (CMOS) technology. CMOS uses two complementary transistors per gate (one with N-type material; the other with P-type material). When one transistor is maintaining a logic state, it requires almost no power."}]