[{"url": "http://home.costhelper.com/roof.html", "passage_text": "1 A professionally installed steel roof can be $5,100-$22,000 for steel roofing on a simple one-story ranch-style house; aluminum runs $11,900-$24,200 for the same roof; and copper jumps to $25,500-$39,600. 1 Wood shingles or shakes are beautiful but require ongoing maintenance, can be prone to fires and don't last as long as other roofing materials. 2  Installing natural wood shingles or shakes on an average one-story, ranch-style home (1,700-2,100 square feet of gently sloping roof) costs around $6,800-$20,000 or more."}, {"url": "http://home.costhelper.com/roof.html", "passage_text": "1 A metal roof is lightweight, durable, fire-resistant and does not rot. 2  A professionally installed steel roof can be $5,100-$22,000 for steel roofing on a simple one-story ranch-style house; aluminum runs $11,900-$24,200 for the same roof; and copper jumps to $25,500-$39,600. 1 Wood shingles or shakes are beautiful but require ongoing maintenance, can be prone to fires and don't last as long as other roofing materials. 2  Installing natural wood shingles or shakes on an average one-story, ranch-style home (1,700-2,100 square feet of gently sloping roof) costs around $6,800-$20,000 or more."}, {"url": "http://www.homeadvisor.com/cost/roofing/install-a-roof/", "passage_text": "1 Cost: A 2,000 square foot home will cost from $17,000 to $84,000 to roof in slate. 2  If 3,000 square feet or more, cost can range from $27,000 to $120,000, depending on the site location and the complexity of the job. Just because your roof springs a leak doesn't mean you need to call a roofing contractor right away. It's important to distinguish the cost of a new roof -- almost $6,500 on average -- versus the much more affordable $550 to repair a roof."}, {"url": "http://home.costhelper.com/roof.html", "passage_text": "1 The cost for removing and properly disposing of existing shingles starts around $3-$5 a square foot or $510-$1,100 for a basic ranch-style home -- and costs go higher depending on the type of materials being removed, the location and the difficulty of the removal project. 1 Wood shingles or shakes are beautiful but require ongoing maintenance, can be prone to fires and don't last as long as other roofing materials. 2  Installing natural wood shingles or shakes on an average one-story, ranch-style home (1,700-2,100 square feet of gently sloping roof) costs around $6,800-$20,000 or more."}, {"url": "http://www.seibertsmith.com/industry-updates/what-are-the-types-of-roofs-roofing-costs-and-other-important-informationtips-on-replacing-my-roof/", "passage_text": "The total cost for a slate roof can span quite a range due to quality and availability of slate materials, substructure repairs and/or replacements and labor costs (slate is heavy). A 1200 square foot slate roof will cost anywhere from $11,000 to $16,000. The cost of slate roof ing is considerably more than asphalt and wood shake. Using a 1200 square roof standard (same as above for comparison), slate runs between $7100 to $10,000."}, {"url": "http://www.homeadvisor.com/cost/roofing/install-a-roof/", "passage_text": "1 It is a popular choice for larger houses of about 3,000 square feet. 2  Cost: A 2,000 square foot home will cost from $17,000 to $84,000 to roof in slate. 3  If 3,000 square feet or more, cost can range from $27,000 to $120,000, depending on the site location and the complexity of the job. Just because your roof springs a leak doesn't mean you need to call a roofing contractor right away. It's important to distinguish the cost of a new roof -- almost $6,500 on average -- versus the much more affordable $550 to repair a roof."}, {"url": "http://homeguides.sfgate.com/average-repair-costs-roof-104288.html", "passage_text": "Fixing a simple roof leak in an asphalt or metal roof costs just $350 on average, according to the Lehigh Valley Roofing Company. Different materials may cost more to fix, with clay or concrete tile repairs averaging $360, wooden shakes at $420 and basic slate roof repairs averaging $500 as of 2014. The average asphalt roof replacement project in the U.S. costs $18,913 as of 2014, according to Remodeling Magazine. This figure includes removal and disposal of the old roof, new underlayment, flashing and drip edges, as well as new asphalt shingles."}, {"url": "http://home.costhelper.com/roof.html", "passage_text": "1 Do-it-yourself materials to install an asphalt shingle roof on an average one-story ranch-style home (with a gently sloping roof of 1,700-2,100 square feet) can run $680-$3,700, depending on the quality of the materials. 1 Wood shingles or shakes are beautiful but require ongoing maintenance, can be prone to fires and don't last as long as other roofing materials. 2  Installing natural wood shingles or shakes on an average one-story, ranch-style home (1,700-2,100 square feet of gently sloping roof) costs around $6,800-$20,000 or more."}, {"url": "http://homeguides.sfgate.com/average-repair-costs-roof-104288.html", "passage_text": "If your roof is made from some other material, plan to pay a premium for a total replacement. As of 2014, Bankrate.com estimates the cost of asphalt shingles at $82 to $112 per square, a roofing measurement equal to 100 square feet. Clay tiles cost between $250 and $500 per square, while wooden shakes range from $175 to $275 per square. The average asphalt roof replacement project in the U.S. costs $18,913 as of 2014, according to Remodeling Magazine. This figure includes removal and disposal of the old roof, new underlayment, flashing and drip edges, as well as new asphalt shingles."}, {"url": "http://home.costhelper.com/asphalt-shingle-roof.html", "passage_text": "1 Having a roofing contractor remove (and dispose of) old roofing materials, then install asphalt shingles runs about $1-$4 a square foot, or a total of $1,700-$8,400 for a typical ranch-style home (1,700-2,100 square foot, gently sloping roof). 1 Do-it-yourself materials run around $680-$3,700 for a typical one-story ranch-style home with a 1,700-2,100-square-foot, gently-sloping roof. 2  Standard gray asphalt shingles in a three-tab rectangle are the least expensive; expect to pay more for higher-end colors and styles."}]