[{"url": "https://en.wikipedia.org/wiki/Organic_certification", "passage_text": "Organic certification is a certification process for producers of organic food and other organic agricultural products. Organic certification is not without its critics. Some of the staunchest opponents of chemical-based farming and factory farming practices also oppose formal certification. They see it as a way to drive independent organic farmers out of business, and to undermine the quality of organic food."}, {"url": "http://www.farmfreshtoyou.com/certified_organic_farming", "passage_text": "In terms of agriculture and the growing of food, organic is a term that specifies the types of amendments that can be applied to an agricultural field. Amendments are substances that farmers put into their fields to grow things. The following is a basic list of all the amendments used in agriculture: 1  Seeds. It is an understatement to say that being certified organic has turned into a huge bureaucratic process. While the certification process does force organic farms to keep good records, it does not prevent the use of non-organic substances on organic products."}, {"url": "http://organic.about.com/od/organicdefinitionsuv/g/Usda-Organic-Seal-Definition-Of-Usda-Organic-Seal.htm", "passage_text": "Definition: The USDA Organic Seal is a seal, or label, that is affixed to certified USDA organic products. There are two levels of certified products that are allowed to wear the USDA Organic Seal. 1  100% USDA certified organic products must be made with 100% organic ingredients and may display the USDA Organic Seal. 2  Organic products must be made with at least 95% organic ingredients and may wear the USDA Organic Seal. "}, {"url": "http://www.organic.org/home/faq", "passage_text": "Organic food is produced by farmers who emphasize the use of renewable resources and the conservation of soil and water to enhance environmental quality for future generations. Organic meat, poultry, eggs, and dairy products come from animals that are given no antibiotics or growth hormones. Converting land to organic status is a three-year process. There is a two-year conversion process consisting of building up the fertility of the land. Produce grown in the first year cannot be stated as organic."}, {"url": "http://www.farmfreshtoyou.com/certified_organic_farming", "passage_text": "In order for a crop to be certified organic it must be grown on a piece of land that has not had any non-organic materials applied to it for the past three years. Land that has started the process of becoming certified organic (has started only using organic materials) is considered to be transitional or in transition. It is an understatement to say that being certified organic has turned into a huge bureaucratic process. While the certification process does force organic farms to keep good records, it does not prevent the use of non-organic substances on organic products."}, {"url": "https://en.wikipedia.org/wiki/Organic_certification", "passage_text": "The National Organic Program (run by the USDA) is in charge of the legal definition of organic in the United States and also performs organic certification. Organic certification is not without its critics. Some of the staunchest opponents of chemical-based farming and factory farming practices also oppose formal certification. They see it as a way to drive independent organic farmers out of business, and to undermine the quality of organic food."}, {"url": "https://en.wikipedia.org/wiki/Organic_certification", "passage_text": "In Australia, organic certification is performed by several organisations that are accredited by the Biosecurity section of the Department of Agriculture (Australia) , formerly the Australian Quarantine and Inspection Service, under the National Standard for Organic and Biodynamic Produce. Organic certification is not without its critics. Some of the staunchest opponents of chemical-based farming and factory farming practices also oppose formal certification. They see it as a way to drive independent organic farmers out of business, and to undermine the quality of organic food."}, {"url": "http://www.usda.gov/wps/portal/usda/usdahome?contentid=organic-agriculture.html", "passage_text": "Organic Agriculture. USDA is committed to helping organic agriculture grow and thrive. To help meet Secretary Vilsack's goal of increasing the number of certified organic operations, USDA is delivering results through its many programs which serve the growing organic sector. Trade partnerships streamline organic exports and imports with other countries, increasing the market share of organic products worldwide while maintaining rigorous production standards. Additionally, foreign products certified to the USDA organic standards can access the U.S. market."}, {"url": "http://www.farmfreshtoyou.com/certified_organic_farming", "passage_text": "When considering the term “certified organic,” it is important to understand that today this is a legal description. It is also important to understand that the term “organic” has many connotations associated with it, such as sustainability and biodiversity. It is an understatement to say that being certified organic has turned into a huge bureaucratic process. While the certification process does force organic farms to keep good records, it does not prevent the use of non-organic substances on organic products."}, {"url": "https://www.ccof.org/organic", "passage_text": "Organic food is better for your family’s health and the planet. Buying organic is a direct investment in the future of our food system, so it’s a choice you can feel good about. Learn more about why you should buy organic. Certified organic products are always non-GMO and so much more! Food that is grown organically enhances biodiversity, soil fertility, and ecological harmony. Choosing organic is choosing products that are healthy for both people and the planet! Learn more about how organic is non-GMO and more. Get the facts on organic and spread your knowledge to others. Our helpful fact sheets explain the ins and outs of organic production, labeling, and CCOF. Download our flyers. "}]