[{"url": "http://www.nj.com/mercer/index.ssf/2015/04/free_coffee_wawa_stores_plan_to_give_away_15m_cups.html", "passage_text": "Comments. HAMILTON -- It's Wawa Day on Thursday and that means free coffee for customers at the store's 680 locations to mark the company's 51st birthday. Wawa expects to give away an estimated 1.5 million free cups of coffee during the promotion. "}, {"url": "http://forthemommas.com/free-stuff/wawa-day-free-coffee-size-april-16th", "passage_text": "What is Wawa Day you ask? It’s a day to celebrate all Wawa Associates and their customers with FREE coffee any size, all day. Yes, that’s right-FREE coffee-ANY size, ALL day! What a treat! May sure you stop by Wawa on April 16th to get your java fix, FREE."}, {"url": "http://constitutioncenter.org/calendar/wawa-hoagie-day", "passage_text": "Admission is FREE on July 2, courtesy of Wawa. Wawa Hoagie Day is Life, Liberty, & the Pursuit of Deliciousness at its finest as 5 tons of hoagies will be assembled at the National Constitution Center and served free to thousands of people outside the Independence Visitor Center on Independence Mall starting at noon. "}, {"url": "https://www.wawa.com/About.aspx", "passage_text": "Today, Wawa is your all day, every day stop for fresh, built-to-order foods, beverages, coffee, fuel services, and surcharge-free ATMs. A chain of more than 645 convenience retail stores (over 365 offering gasoline), Wawa stores are located in Pennsylvania, New Jersey, Delaware, Maryland, Virginia and Central Florida. "}, {"url": "https://en.wikipedia.org/wiki/Wawa_Welcome_America", "passage_text": "Wawa Welcome America is an annual series of celebrations leading up to Independence Day, held in Philadelphia, Pennsylvania, currently sponsored by Wawa and aired on WPVI-TV, and starts 10 days prior to Independence Day. "}, {"url": "http://www.news-press.com/story/money/2015/04/15/wawa-cape-coral-fort-myers-convenience-stores/25836559/", "passage_text": "Wawa Day on Thursday is a big deal. After all, it's not every day that a convenience store chain gives away more than 1.5 million free cups of coffee. But Southwest Florida fans of the company based in Wawa, Pa., undoubtedly think April 23 is much more important. That's the day it will open three stores — two in Fort Myers and one in Cape Coral. They are the company's first stores in Southwest Florida."}, {"url": "http://www.delawareonline.com/story/secondhelpings/2015/04/15/free-coffee-thursday-at-wawa/25813915/", "passage_text": "Caffeine alert! Thursday is Wawa Day. And that means free coffee. During Wawa Day, Wawa will give away more than 1.5 million free cups of any size coffee for all customers chain-wide. Yep. Free. Coffee. Wawa is celebrating 51 years in business with a variety of celebrations at its stores. Caffeine alert! Thursday is Wawa Day. And that means free coffee. During Wawa Day, Wawa will give away more than 1.5 million free cups of any size."}, {"url": "https://en.wikipedia.org/wiki/Wawa_Food_Market", "passage_text": "Wawa Inc. is a chain of convenience store / gas stations located along the East Coast of the United States. It operates in Pennsylvania, New Jersey, Delaware, Maryland, Virginia, and Florida. The company's corporate headquarters is located in the Wawa area of Chester Heights, Pennsylvania in Greater Philadelphia. "}, {"url": "https://www.facebook.com/wawa", "passage_text": "Wawa. September 29 at 9:00am ·. Enter the I heart emoticon Wawa Coffee Video Contest for a chance to win an I heart emoticon Wawa Coffee Sweatshirt and in-store Wawa Gift Card! Share your 20-sec (or less) video on Twitter, Instagram, or the Wawa Facebook page and use ‪#‎WawaCoffeeContest‬ . Contest ends 10/26. "}]