[{"url": "http://www.embryology.ch/anglais/qblood/lymphat04.html", "passage_text": "The secondary lymphatic organs represent the location where the defense battles take place. In them the T-and B-lymphocytes that have matured in the thymus and in the bone marrow develop further when they come into contact with antigens, leading to a clonal proliferation. "}, {"url": "https://en.wikipedia.org/wiki/Lymphatic_system", "passage_text": "The lymphatic system is part of the circulatory system and a vital part of the immune system, comprising a network of lymphatic vessels that carry a clear fluid called lymph (from Latin lympha meaning water) directionally towards the heart. Lymphocytes are concentrated in the lymph nodes. The spleen and the thymus are also lymphoid organs of the immune system. The tonsils are lymphoid organs that are also associated with the digestive system."}, {"url": "http://buildyourimmunity.com/immune-system/lymphatic-system/", "passage_text": "The lymphatic system consists of two parts, the primary and secondary organs. The thymus gland (located beneath the breast bone, and functioning at its peak during adolescence) and the bone marrow produce specialized lymphocytes—T-cells and B-cells and dispatching them through the lymph vessels to the secondary organs. So, the bone marrow creates the stem cells which become the cells of the immune system. Lymphocytes are sent from the bone marrow to the thymus gland to mature and are then stored in the secondary organs of the lymph system and in the blood stream."}, {"url": "https://en.wikipedia.org/wiki/Lymphatic_system", "passage_text": "Cancer of the lymphatic system can be primary or secondary. Lymphoma refers to cancer that arises from lymphatic tissue. Lymphoid leukemias and lymphomas are now considered to be tumors of the same type of cell lineage. They are called leukemia when in the blood or marrow and lymphoma when in lymphatic tissue. Lymphocytes are concentrated in the lymph nodes. The spleen and the thymus are also lymphoid organs of the immune system. The tonsils are lymphoid organs that are also associated with the digestive system."}, {"url": "http://biology.about.com/od/organsystems/ss/lymphatic-aystem.htm", "passage_text": "1 The spleen is the largest organ of the lymphatic system. 2  Its primary function is to filter blood of damaged cells, cellular debris, and pathogens. 3  Like the thymus, the spleen houses and aids in the maturation of lymphocytes. 4  Lymphocytes destroy pathogens and dead cells in the blood. 1 Thymus. 2  The thymus gland is the main organ of the lymphatic system. 3  Its primary function is to promote the development of specific cells of the immune system called T-lymphocytes. 4  Once mature, these cells leave the thymus and are transported via blood vessels to the lymph nodes and spleen."}, {"url": "http://biology.about.com/od/organsystems/ss/lymphatic-aystem.htm", "passage_text": "1 The thymus gland is the main organ of the lymphatic system. 2  Its primary function is to promote the development of specific cells of the immune system called T-lymphocytes. 3  Once mature, these cells leave the thymus and are transported via blood vessels to the lymph nodes and spleen. 1 Thymus. 2  The thymus gland is the main organ of the lymphatic system. 3  Its primary function is to promote the development of specific cells of the immune system called T-lymphocytes. 4"}, {"url": "http://www.peteducation.com/article.cfm?c=11+2077&aid=2975", "passage_text": "The lymphatic system plays a large role in immunity. This important system also absorbs digested fats from the small intestine. The components of the lymphatic system are divided into two groups – the primary organs and the secondary organs. Primary Organs: The thymus gland and the bone marrow are primary organs. They regulate the production and differentiation of lymphocytes – the cells that make up the immune system. "}, {"url": "http://www.embryology.ch/anglais/qblood/lymphat02.html", "passage_text": "Primary lymphatic organs. In humans the largest part of the lymphocyte development ccurs in specialized tissue of the primary lymphatic organs: bone marrow (liver in the fetal period) and thymus. There a large number of immunocompetent lymphocytes are produced that colonize the secondary lymphatic tissue. "}, {"url": "http://www.livescience.com/26983-lymphatic-system.html", "passage_text": "View full size image. The lymphatic system is a network of tissues and organs that help rid the body of toxins, waste and other unwanted materials. The primary function of the lymphatic system is to transport lymph, a fluid containing infection-fighting white blood cells, throughout the body. The lymphatic system primarily consists of lymphatic vessels, which are similar to the circulatory system's veins and capillaries."}, {"url": "https://en.wikipedia.org/wiki/Lymphatic_system", "passage_text": "The lymphatic system consists of lymphatic organs, a conducting network of lymphatic vessels, and the circulating lymph. The thymus and the bone marrow constitute the primary lymphoid organs involved in the production and early clonal selection of lymphocyte tissues. Lymphocytes are concentrated in the lymph nodes. The spleen and the thymus are also lymphoid organs of the immune system. The tonsils are lymphoid organs that are also associated with the digestive system."}]