[{"url": "http://www.makemytrip.com/routeplanner/mumbai-hyderabad.html", "passage_text": "The minimum time a train takes to reach Hyderabad from Mumbai is 12h 00m. The cheapest way to reach Hyderabad from Mumbai takes you 13h 30m, which is to take Husainsagar Exp from Mumbai to Hyderabad. The fastest way to reach Hyderabad from Mumbai takes you 1h 35m, which is to take Air India"}, {"url": "http://www.makemytrip.com/routeplanner/mumbai-hyderabad.html", "passage_text": "ROAD DISTANCE. 706 km. How to Reach. There are no flights between Mumbai to Hyderabad but there is/are 10 direct train(s) from Mumbai to Hyderabad. These train(s) is/are Husainsagar Exp (12701), Sc Duronto Exp (12219), Ltt Vskp Sup Ex (12750), Ltt Vskp Sup Ex (22820), Rjt Sc Express (17017) etc."}, {"url": "http://www.makemytrip.com/routeplanner/hyderabad-mumbai.html", "passage_text": "705 km. How to Reach. No flights are available between Hyderabad to Mumbai but there is/are 9 direct train(s) from Hyderabad to Mumbai. These train(s) is/are Hussainsagar Ex (12702), Duronto Ac Exp (12220), Rajkot Express (17018), Cct Bvc Express (17204), Vskp Ltt Expres (22819) etc."}, {"url": "http://www.prokerala.com/maps/india-travel/distance-from-hyderabad-to-mumbai.html", "passage_text": "Find the distance between Mumbai and Hyderabad. The map given below shows the road distance from Hyderabad to Mumbai. This distance calculator shows the Mumbai-Hyderabad road travel distance in Kilometers."}, {"url": "http://www.prokerala.com/travel/distance/from-hyderabad/to-mumbai/", "passage_text": "What is the travel distance between Hyderabad, India and Mumbai, India? How many miles is it from Mumbai to Hyderabad. 386 miles / 621.21 km is the flight distance between these two places. Use the Distance calculator given below to find distance between any two cities or places."}, {"url": "http://www.makemytrip.com/routeplanner/hyderabad-mumbai.html", "passage_text": "The aerial distance from Hyderabad to Mumbai is 617 km while the road distance between Hyderabad to Mumbai is 705 km.By Train it is 737 Km."}]