[{"url": "http://www.bupa.co.uk/health-information/directory/e/eye-cancer", "passage_text": "There are several different types of intraocular eye cancer and all of them are very rare. Cancer that develops around your eye is called extraocular cancer. Extraocular cancers are more common. They are more common in older people, particularly those who have had a lot of sun exposure during their lives."}, {"url": "http://www.cancerresearchuk.org/about-cancer/type/eye-cancer/treatment/surgery/types-of-eye-cancer-surgery", "passage_text": "Types of eye cancer surgery. Depending on the size of the melanoma and where it is in your eye, you may have an operation to remove just the tumour, part of the eye, or the whole eye. Removing the whole eye is called enucleation."}, {"url": "http://www.cancer.org/cancer/eyecancer/detailedguide/eye-cancer-what-is-eye-cancer", "passage_text": "Cancers in the eye (intraocular cancers). Two types of cancers can be found in the eye. Primary intraocular cancers start inside the eyeball. In adults, melanoma is the most common primary intraocular cancer, followed by primary intraocular lymphoma. These 2 cancers are the focus of this document."}, {"url": "http://www.bupa.co.uk/health-information/directory/e/eye-cancer", "passage_text": "Cancer within your eye is very rare. However, there are a few types of cancer that can cause a lump in or around your eye. Cancer is caused by an abnormal and uncontrolled growth of cells. Cancer that develops in your eyeball is called intraocular cancer."}, {"url": "http://www.ocularmelanoma.org/types-of-eye-cancer.htm", "passage_text": "Types of Eye Cancer. Eye cancers can be primary (starts within the eye) and metastatic cancer (spread to the eye from another organ). The two most common cancers that spread to the eye from another organ are breast cancer and lung cancer."}, {"url": "http://www.cancer.net/cancer-types/eye-cancer/overview", "passage_text": "Eye cancer is a general term used to describe many types of tumors that can start in various parts of the eye. It occurs when healthy cells in or around the eye change and grow uncontrollably, forming a mass called a tumor. A tumor can be benign or cancerous."}]