[{"url": "http://www.rxlist.com/isuprel-drug.htm", "passage_text": "If you experience any of the following serious side effects, stop using isoproterenol inhalation and seek emergency medical attention or contact your doctor immediately: 1  an allergic reaction (difficulty breathing; closing of the throat; swelling of the lips, tongue, or face; or hives); or. Each milliliter of the sterile solution contains: Isoproterenol hydrochloride injection, USP ------------0.2 mg. Edetate Disodium (EDTA) -------------------------------0.2 mg. Sodium Chloride ---------------------------------------7.0 mg. Sodium Citrate, Dihydrate -----------------------------2.07 mg."}, {"url": "http://www.thefreedictionary.com/isoproterenol", "passage_text": "1. isoproterenol-drug (trade name Isuprel) used to treat bronchial asthma and to stimulate the heart. Isuprel. medicament, medication, medicinal drug, medicine - (medicine) something that treats or prevents or alleviates the symptoms of disease. "}, {"url": "https://en.wikipedia.org/wiki/Isoprenaline", "passage_text": "Isoprenaline (INN) or isoproterenol (USAN, trade names Medihaler-Iso and Isuprel) is a medication used for the treatment of bradycardia (slow heart rate), heart block, and rarely for asthma. In humans, it is a non-selective beta-adrenergic agonist and TAAR1 agonist that is structurally similar to adrenaline. Uses [edit]. Its primary use is for bradycardia or heart block. By activating β 1 -receptors on the heart, it induces positive chronotropic, dromotropic, and inotropic effects. It can be used as an inhaled aerosol to treat asthma, although this is currently a rare treatment."}, {"url": "http://eilat.sci.brooklyn.cuny.edu/newnyc/DRUGS/Isoprote.htm", "passage_text": "ISOPROTERENOL (ISUPREL) Description. Isoproterenol is a synthetic catecholamine that stimulates both beta1- and beta2-adrenergic receptors (no alpha-receptor capabilities). The drug affects the heart by increasing inotropic and chronotropic activity. "}, {"url": "http://www.merriam-webster.com/dictionary/isoproterenol", "passage_text": "Medical Definition of ISOPROTERENOL. : a sympathomimetic agent used in the form of its hydrochloride C11H17NO3·HCl or sulfate (C11H17NO3)2·H2SO4 especially as a bronchodilator in the treatment of asthma, bronchitis, and emphysema—called also isoprenaline, isopropylarterenol; see isuprel. Definition of ISOPROTERENOL. : a sympathomimetic agent C11H17NO3 used in the treatment of asthma."}, {"url": "http://www.emedicinehealth.com/drug-isoproterenol_inhalation/article_em.htm", "passage_text": "Other, less serious side effects may be more likely to occur. Continue to use isoproterenol inhalation and talk to your doctor if you experience. 1  headache, dizziness, lightheadedness, or insomnia; 2  tremor or nervousness; 3  sweating; 4  nausea, vomiting, or diarrhea; or. 5  dry mouth. It works by relaxing muscles in the airways to improve breathing. Isoproterenol inhalation is used to treat conditions such as asthma, bronchitis, and emphysema. Isoproterenol inhalation may also be used for conditions other than those listed in this medication guide."}, {"url": "http://www.rxlist.com/isuprel-drug/patient-images-side-effects.htm", "passage_text": "Other, less serious side effects may be more likely to occur. Continue to use isoproterenol inhalation and talk to your doctor if you experience. 1  headache, dizziness, lightheadedness, or insomnia; 2  tremor or nervousness; 3  sweating; 4  nausea, vomiting, or diarrhea; or. 5  dry mouth. It works by relaxing muscles in the airways to improve breathing. Isoproterenol inhalation is used to treat conditions such as asthma, bronchitis, and emphysema. Isoproterenol inhalation may also be used for conditions other than those listed in this medication guide."}]