[{"url": "https://en.wikipedia.org/wiki/Dominance_(genetics)", "passage_text": "Dominance in genetics is a relationship between alleles of one gene, in which the effect on phenotype of one allele masks the contribution of a second allele at the same locus. The first allele is dominant and the second allele is recessive. For genes on an autosome (any chromosome other than a sex chromosome), the alleles and their associated traits are autosomal dominant or autosomal recessive. Dominance is a key concept in Mendelian inheritance and classical genetics. Also, an allele may be dominant for a particular aspect of phenotype but not for other aspects influenced by the same gene. Dominance differs from epistasis, a relationship in which an allele of one gene affects the expression of another allele at a different gene."}, {"url": "http://www.thefreedictionary.com/recessive", "passage_text": "Relating to the form of a gene that is not expressed as a trait in an individual unless two such genes are inherited, one from each parent. In an organism having two different genes for a trait, the recessive form is suppressed by its counterpart, or dominant, form located on the other of a pair of chromosomes. "}, {"url": "http://study.com/academy/lesson/dominant-trait-definition-example-quiz.html", "passage_text": "A recessive trait is the phenotype that is not seen in the heterozygous genotype, and attached earlobes are a recessive trait. This brings us back to our main topic, which we can now define. A dominant trait is the phenotype that is seen when the heterozygous genotype is present. Before we can define exactly what a dominant trait is, we must first define and discuss many genetics terms. A gene, or unit of heredity, can have many different versions called alleles."}, {"url": "http://study.com/academy/lesson/simple-dominance-definition-lesson-quiz.html", "passage_text": "Simple dominance occurs when two alleles of a single gene, the dominant version and the recessive version, code for a heritable trait. The presence of the dominant allele masks the presence of the recessive allele. One human trait that's expressed through simple dominance is the ability to taste the bitter chemical PTC, which is expressed by a single gene that codes for a taste receptor on the tongue."}, {"url": "http://study.com/academy/lesson/simple-dominance-definition-lesson-quiz.html", "passage_text": "We get one chromosome from our mother and one from our father. Simple dominance occurs when an inherited trait is coded for by a single gene and that gene has two versions, or alleles: the dominant version and the recessive version. The dominant allele of the gene hides the presence of the recessive allele. One human trait that's expressed through simple dominance is the ability to taste the bitter chemical PTC, which is expressed by a single gene that codes for a taste receptor on the tongue."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3105", "passage_text": "Dominant: A genetic trait is considered dominant if it is expressed in a person who has only one copy of that gene. (In genetic terms, a dominant trait is one that is phenotypically expressed in heterozygotes). A dominant trait is opposed to a recessive trait which is expressed only when two copies of the gene are present. (In genetic terms, a recessive trait is one that is phenotypically expressed only in homozygotes). Examples of dominant disorders include: 1  Achondroplasia (a common form of dwarfism with short arms and legs), "}, {"url": "http://biology.about.com/od/geneticsglossary/g/incompletedom.htm", "passage_text": "By Regina Bailey. Definition: Incomplete dominance is a form of intermediate inheritance in which one allele for a specific trait is not completely expressed over its paired allele. This results in a third phenotype in which the expressed physical trait is a combination of the dominant and recessive phenotypes. Incomplete genetic dominance is similar to, but different from co-dominance."}, {"url": "http://study.com/academy/lesson/dominant-trait-definition-example-quiz.html", "passage_text": "Definition of Dominant Trait. Before we can define exactly what a dominant trait is, we must first define and discuss many genetics terms. A gene, or unit of heredity, can have many different versions called alleles. There are often two kinds of alleles: 1  Dominant allele: masks the effects of another allele; designated by an uppercase letter"}, {"url": "http://medical-dictionary.thefreedictionary.com/Dominant+gene", "passage_text": "dominant gene one that produces an effect (the phenotype) in the organism regardless of the state of the corresponding allele. An example of a trait determined by a dominant gene is brown eye color. See also heredity. histocompatibility gene one that determines the specificity of tissue antigenicity (hla antigens) and thus the compatibility of donor and recipient in tissue transplantation and blood transfusion."}, {"url": "http://www.biology-online.org/dictionary/Dominant", "passage_text": "Definition. (genetics). (1) (Of, or pertaining to) An allele or a gene that is expressed in an organism ’s phenotype, masking the effect of the recessive allele or gene when present. (2) (Of, or pertaining to) An organism that expresses the dominant gene (or allele). (ecology) (Of, or pertaining to) An organism or group of organisms having the most considerable influence or control in its ecological community among other organism."}]