[{"url": "http://www.behindthevoiceactors.com/voice-compare/SpongeBob-SquarePants/Mr-Krabs/", "passage_text": "SpongeBob's Truth or Square (2009). Bob Joles. For our first SpongeBob voice comparison, we'll start out with one of the main characters: Mr. Krabs. In the TV show and the movie, he is voiced by Clancy Brown, who brought a distinctive, gruff voice that fit Mr. Krabs' sailor attitude very well. In most of the SpongeBob video games when Clancy Brown is unavailable, Joe Whyte provides the voice instead."}, {"url": "http://animatedtv.about.com/od/spongebobsquarepants/tp/SpongeBob-SquarePants-Cast.htm", "passage_text": "Mr. Lawrence (Plankton). Mr. Lawrence is a writer on SpongeBob SquarePants who also does the voices of Plankton and Larry the Lobster (I once saw an interview when he said he puffs out his chest while he's recording to get the right sound for Larry). Mr. Lawrence is not necessarily a career voice actor but takes roles in cartoons he's writing. "}, {"url": "http://spongebob.wikia.com/wiki/Eugene_H._Krabs", "passage_text": "Gallery. Appearances. Eugene H. Krabs (born November 30, 1942; age 72), simply and more commonly known as Mr. Krabs, sometimes called Krabs by Plankton and frequently called Eugene, is a crimson sea crab who is the owner of the Krusty Krab as well as the employer of both SpongeBob SquarePants and Squidward Tentacles. In  Squilliam Returns , Krabs works as the chef in Squidward's fancy new version of the Krusty Krab, but is apparently a terrible cook, creating a disgusting and freakish appetizer, which eventually comes to life and begins attacking the restaurant's patrons."}, {"url": "http://www.behindthevoiceactors.com/voice-compare/SpongeBob-SquarePants/Mr-Krabs/", "passage_text": "Comparision of the voice over actors who have been the voice of Mr. Krabs with sound clips and images. Mr. Eugene H. Krabs is SpongeBob's cheapskate boss on the show SpongeBob SquarePants and the owner of the Krusty Krab. In the TV show and the movie, he is voiced by Clancy Brown, who brought a distinctive, gruff voice that fit Mr. Krabs' sailor attitude very well. In most of the SpongeBob video games when Clancy Brown is unavailable, Joe Whyte provides the voice instead."}, {"url": "http://nypost.com/2015/01/31/meet-the-actor-behind-mr-krabs-of-spongebob-squarepants/", "passage_text": "Everyone’s favorite pineapple inhabitant returns Friday in “The SpongeBob Movie: Sponge Out of Water.” Joining in the fun with SpongeBob, of course, is his miserly boss, Mr. Krabs. What fans of the hit animated series may not realize is that the voice of Mr. Krabs, Clancy Brown, is a pretty prolific guy. Here’s where you may know him from. ‘Highlander’ (1986). Brown’s breakthrough screen role was in the sci-fi cult favorite as the immortal Kurgan. "}, {"url": "http://www.imdb.com/name/nm0000317/", "passage_text": "Actor | Soundtrack | Producer. A tall, wavy-haired US actor with a deep, resonant voice, Clancy Brown has proved himself a versatile performer with first-class contributions to theater, feature films, television series and even animation. Born in Urbana, Ohio, he is the son of former US representative Clarence J. Brown, which meant Clancy spent much of his youth in close ..."}, {"url": "http://nickelodeon.wikia.com/wiki/List_of_SpongeBob_SquarePants_characters", "passage_text": "This is a list of characters from the Nickelodeon animated comedy series SpongeBob SquarePants. The main characters in the show are SpongeBob SquarePants and his pet snail Gary, SpongeBob's friends Patrick, Squidward and Sandy, and two restaurateur rivals; Mr. Krabs and Plankton. Eugene H. Krabs (commonly known as Mr. Krabs) is the despicable cheapskate owner and founder of the Krusty Krab. He is a red crab, though his daughter, Pearl, is a whale and they both live in an anchor. He is the employer of both SpongeBob and Squidward."}, {"url": "https://en.wikipedia.org/wiki/Mr._Krabs", "passage_text": "From Wikipedia, the free encyclopedia. Eugene Harold Armor Abs Krabs, or simply Mr. Krabs is a fictional character in the American animated television series SpongeBob SquarePants. He is voiced by actor Clancy Brown, and first appeared on television in the series' first episode  Help Wanted  on May 1,1999. Mr. Krabs served in the navy, and in the episode Krusty Krab Training Video it is revealed that Mr. Krabs served during a time of war, and fell into a depression after finishing his service."}, {"url": "https://en.wikipedia.org/wiki/Mr._Krabs", "passage_text": "Mr. Krabs is the greedy founder and owner of the Krusty Krab restaurant, where SpongeBob works as a frycook, and Squidward works as a cashier. The success of the restaurant is built in part on a lack of competition and in part on the success of the Krusty Krab's flagship sandwich, the Krabby Patty. Mr. Krabs served in the navy, and in the episode Krusty Krab Training Video it is revealed that Mr. Krabs served during a time of war, and fell into a depression after finishing his service."}, {"url": "http://www.behindthevoiceactors.com/characters/SpongeBob-SquarePants/Mr-Krabs/", "passage_text": "FRANCHISE: SpongeBob SquarePants. Eugene H. Krabs is the owner of the Krusty Krab, and SpongeBob and Squidward's boss. He is notoriously obsessed with money, has a trademark cackle, and a daughter named Pearl. "}]