[{"url": "https://en.wikipedia.org/wiki/Copper(II)_sulfate", "passage_text": "Copper (II) sulfate, also known as cupric sulfate or copper sulphate, is the inorganic compound with the chemical formula Cu SO4. Copper sulfate is also used to test blood for anemia. The blood is tested by dropping it into a solution of copper sulfate of known specific gravity – blood which contains sufficient hemoglobin sinks rapidly due to its density, whereas blood which does not sink or sinks slowly has insufficient amount of hemoglobin."}, {"url": "https://en.wikipedia.org/wiki/Copper(II)_sulfate", "passage_text": "Copper sulfate pentahydrate is a fungicide. However, some fungi are capable of adapting to elevated levels of copper ions. Mixed with lime it is called Bordeaux mixture and used to control fungus on grapes, melons, and other berries. Copper sulfate is also used to test blood for anemia. The blood is tested by dropping it into a solution of copper sulfate of known specific gravity – blood which contains sufficient hemoglobin sinks rapidly due to its density, whereas blood which does not sink or sinks slowly has insufficient amount of hemoglobin."}, {"url": "http://copperalliance.org.uk/copper-and-its-alloys/compounds/uses-of-copper-sulphate", "passage_text": "Uses of Copper Sulphate. Copper sulphate, blue stone, blue vitriol are all common names for pentahydrated cupric sulphate, CuSO 4 5H 2 O, which is the best known and the most widely used of the copper salts. Indeed it is often the starting raw material for the production of many of the other copper salts. Copper sulphate is a very versatile chemical with as extensive a range of uses in industry as it has in agriculture. Its principal employment is in agriculture, and, up to a generation or so ago, about its only uses in industry were as a mordant for dyeing and for electroplating."}, {"url": "http://www.disabled-world.com/medical/alternative/homeremedies/bluestone.php", "passage_text": "1 Copper sulfate crystals is still used today dissolved in water in a foot bath for sheep to pass through as a prevention and cure for foot rot. 2  School Projects-Growing crystals of Copper Sulfate is one of the more common science projects for middle school and high school children. 1 (You can swim right away). 2  Copper sulfate pentahydrate is a fungicide. 3  However, some fungi are capable of adapting to elevated levels of copper ions. 4  Mixed with lime it is called Bordeaux mixture and used to control fungus on grapes, melons, and other berries."}, {"url": "https://en.wikipedia.org/wiki/Copper(II)_sulfate", "passage_text": "Copper sulfate is produced industrially by treating copper metal with hot concentrated sulfuric acid or its oxides with dilute sulfuric acid. For laboratory use, copper sulfate is usually purchased. Copper sulfate is also used to test blood for anemia. The blood is tested by dropping it into a solution of copper sulfate of known specific gravity – blood which contains sufficient hemoglobin sinks rapidly due to its density, whereas blood which does not sink or sinks slowly has insufficient amount of hemoglobin."}, {"url": "http://mistralhowto.blogspot.com/2012/06/what-is-copper-sulfate-pentahydrate-and.html", "passage_text": "What is Copper sulfate pentahydrate: Copper(II) sulfate pentahydrate (CuSO4.5H2O), is a common salt of copper. Copper sulfate is a bright blue, odourless crystalline solid which is soluble in water. The archaic name for copper(II) sulphate is “blue vitriol” or “bluestone”. It has numerous applications including as a fungicide, algaecide, pesticide, laboratory analytical reagent, feed supplement, zinc etching and as a mordant. A very dilute solution of copper sulfate is used to treat aquarium fish of various parasitic infections, and is also used to remove snails from aquariums. However, as the copper ions are also highly toxic to the fish, care must be taken with the dosage."}, {"url": "https://edis.ifas.ufl.edu/fa008", "passage_text": "Copper comes in several forms which can be used in water. The cheapest and most commonly used form is copper sulfate, which is available either as a crystal or a powder (often known as Bluestone or Blue powder). Copper sulfate is water soluble, and dissolves fairly easily when mixed with water. Several companies market copper in liquid and crystal forms."}, {"url": "http://www.disabled-world.com/medical/alternative/homeremedies/bluestone.php", "passage_text": "Copper Sulphate is a widely used chemical compound comprised of Copper, Sulphur and Oxygen whose formula is CuSO4. Crystals of Copper Sulphate are often bright blue and the substance was known once as Blue Vitriol or Bluestone. Copper sulfate was used in the past as an emetic, (An agent that induces vomiting). 1 (You can swim right away). 2  Copper sulfate pentahydrate is a fungicide. 3  However, some fungi are capable of adapting to elevated levels of copper ions. 4  Mixed with lime it is called Bordeaux mixture and used to control fungus on grapes, melons, and other berries."}, {"url": "https://en.wikipedia.org/wiki/Copper(II)_sulfate", "passage_text": "Commercial copper sulfate is usually about 98% pure copper sulfate, and may contain traces of water. Anhydrous Copper sulfate is 39.81 percent copper and 60.19 percent sulfate by mass, and in its blue, hydrous form, it is 25.47% copper, 38.47% sulfate (12.82% sulfur) and 36.06% water by mass. Copper sulfate is also used to test blood for anemia. The blood is tested by dropping it into a solution of copper sulfate of known specific gravity – blood which contains sufficient hemoglobin sinks rapidly due to its density, whereas blood which does not sink or sinks slowly has insufficient amount of hemoglobin."}]