[{"url": "https://en.wikipedia.org/wiki/Farfel_the_Dog", "passage_text": "Farfel the Dog is a hound dog ventriloquist's dummy created by Jimmy Nelson. The Farfel character is best known for television commercials for Nestle'nestlé S quik which ran from 1953 to. 1965 "}, {"url": "http://omgyummy.com/2013/03/24/matzo-farfel-kugel-for-passover/", "passage_text": "On Passover, when we traditionally remove all products made with flour from our diet, other than unleavened matzo, matzo farfel kugel often finds its way to the table instead of a noodle-based kugel. Matzo farfel is just matzo broken up into small pieces. When I offered to bring kugel to the first night seder, the traditional meal eaten on the first two nights of Passover, I realized I didn’t have a tried-and-true recipe for a matzo farfel kugel. 1 I plan to add 1/2 – 1 cup of raisins to the farfel mixture. 2  I will heat the raisins (perhaps some diced apricots as well) with some orange juice or sweet red kosher wine – just enough to cover them to help soften them up. 3  Then let them cool and add the liquid and"}, {"url": "http://jewishfoods.org/farfel.html", "passage_text": "In this form, farfel simply consists of matzo broken up by any means into small pieces, and used as a bread substitute in various recipes, from kugel to mushroom pie to latkes. It is particularly prevalent in oven-baked dishes. "}, {"url": "http://kosherfood.about.com/od/glossaryofjewishfoods/g/farfel.htm", "passage_text": "(Matzo farfel is used as a bread substitute during the Passover holiday in kosher-for-Passover recipes, especially in oven-baked dishes.). At the Friday night Sabbath meal, the Baal Shem Tov, the father of Chassidut, would eat farfel. You can make farfel from scratch using this recipe. Add it to soups, as in this Farfel-Potato Dairy Soup recipe. Or try this Hungarian Browned Egg Barley, which is similar to a pilaf."}, {"url": "http://www.jewishrecipes.org/jewish-foods/farfel.html", "passage_text": "Middle High German varveln, through Yiddish farfl) are small pellet-shaped noodles, made of either flour mixed with egg or matzo. Farfel is most prevalent in Jewish cuisine, where it is a seasonal item used in Passover dishes. In this form, farfel simply consists of matzo broken up by any means into small pieces, and used as a bread substitute in various recipes, from kugel to mushroom pie to latkes. Farfel also refers to an egg noodle dough which may be cut or grated for use in soups, or served as a side dish. Among Hassidic Jews, farfel is served as a side dish on the night of the Sabbath, in accordance with a custom instituted by the Baal Shem Tov, the founder of Hasidism."}, {"url": "http://kosherfood.about.com/od/glossaryofjewishfoods/g/farfel.htm", "passage_text": "Matzo farfel likely gets its name more from its size and shape, rather than its culinary qualities, for while it's small (though not as small as real farfel), it in no way behaves like an egg noodle in recipes. You can make farfel from scratch using this recipe. Add it to soups, as in this Farfel-Potato Dairy Soup recipe. Or try this Hungarian Browned Egg Barley, which is similar to a pilaf."}, {"url": "http://seinfeld.wikia.com/wiki/Farfel", "passage_text": "Farfel. 803 pages on this wiki. Farfel is a loud, obnoxious dog who Jerry Seinfeld has to take care of when his owner gets sick, in “ The Dog ”. We never see Farfel, but we hear him bark and it is implied that he is a great inconvenience to Jerry. Categories :"}, {"url": "http://kosherfood.about.com/od/glossaryofjewishfoods/g/farfel.htm", "passage_text": "Definition: Farfel is a tiny, pellet-shaped egg noodle similar to German spaetzle or Hungarian nokedli, that was once a popular side dish -- served simply seasoned alongside meat or poultry -- in Jewish Ashkenazi cuisine. You can make farfel from scratch using this recipe. Add it to soups, as in this Farfel-Potato Dairy Soup recipe. Or try this Hungarian Browned Egg Barley, which is similar to a pilaf."}, {"url": "http://www.marthastewart.com/345541/farfel-mushrooms-arties-deli", "passage_text": "Heat 2 tablespoons oil in a large skillet over medium-high heat. Add farfel, and cook, stirring, until toasted and golden brown, about 5 minutes. Transfer to a small roasting pan, and add hot stock. Place in oven, and bake until the liquid is absorbed, about 20 minutes. "}]