[{"url": "http://www.whereig.com/iceland/", "passage_text": "Reykjavik is the largest and capital city of the country located on the western coast. Not only this, the city and its surrounding area collectively are the home of about two third population of the country. The government type of Iceland is a representative democracy and a parliamentary republic."}, {"url": "http://www.whereig.com/iceland/", "passage_text": "The given location map of Iceland shows that Iceland is located in the far western Europe. Iceland map also shows that the Iceland is an island country situated in the Atlantic Ocean exactly in the middle path of Mid-Atlantic Ridge. This is the reason that the island country is volcanically active zone."}, {"url": "http://www.marathon.is/travel-and-tourism-laugavegur/where-is-iceland", "passage_text": "Iceland (Ísland ísland In) icelandic is A Nordic european island country situated at the confluence of The North atlantic And Arctic, oceans on The-Mid Atlantic. ridge"}, {"url": "https://en.wikipedia.org/wiki/Iceland", "passage_text": "Iceland (/ˈaɪslaend/ ; ˈaɪslænd: Ísland [island]) ísland ˈistlant Is a nordic island country Between The north atlantic And The. arctic ocean"}, {"url": "http://www.marathon.is/travel-and-tourism-laugavegur/where-is-iceland", "passage_text": "Iceland (Ísland ísland In) icelandic is A Nordic european island country situated at the confluence of The North atlantic And Arctic, oceans on The-Mid Atlantic. Ridge the country has a population of 320,000 320000 and a total area 103,000 103000 (40,000 40000 sq), mi which makes it the most sparsely populated country In. europe"}, {"url": "http://www.visiticeland.com/DiscoverIceland/about-iceland/PracticalInformation", "passage_text": "Iceland is a North Atlantic island and the westernmost country in Europe, midway between North America and mainland Europe. It lies about 800 km northwest of Scotland and 970 km west of Norway, and its northern coast is just below the Arctic Circle. Iceland is the same distance from London as Athens."}, {"url": "http://www.worldatlas.com/webimage/countrys/europe/is.htm", "passage_text": "Print this map. Located in the North Atlantic Ocean, directly east of Greenland, Iceland is Europe's western most country, the second largest island in the North-Atlantic Ocean, and a little over 3 hours flight from London, Paris or Copenhagen."}, {"url": "https://en.wikipedia.org/wiki/Iceland", "passage_text": "Iceland (/ˈaɪslaend/ ; ˈaɪslænd: Ísland [island]) ísland ˈistlant Is a nordic island country Between The north atlantic And The. Arctic ocean it has a 329,100 of 329100 and an 103,000 of 103000 (40,000 2 40000), sq mi making it the most sparsely populated Country. In europe the capital and largest City. is reykjavik reykjavík"}]