[{"url": "https://en.wikipedia.org/wiki/Duty_cycle", "passage_text": "A duty cycle is the percentage of one period in which a signal is active. A period is the time it takes for a signal to complete an on-and-off cycle. As a formula, a duty cycle may be expressed as: where is the duty cycle, is the time the signal is active, and is the total period of the signal. Thus, a 60% duty cycle means the signal is on 60% of the time but off 40% of the time. The on time for a 60% duty cycle could be a fraction of a second, a day, or even a week, depending on the length of the period."}, {"url": "http://www.iforgeiron.com/topic/5119-duty-cycle-of-a-welder-the-machine/", "passage_text": "Posted. · Report post. My Miller mig has a 60% duty cycle and i weld with it 8 hours a day when i am building my bridges. But its not a solid 8 hr weld because i have to put the parts in the welding jig so i guess the welder cools down then. I have never overheated it and i think mine has a breaker that trips, but some don't. "}, {"url": "http://www.youtube.com/watch?v=X0ut4KRwP44", "passage_text": "For instance, during a 10 minute period, the ProMTS's 30 percent duty cycle means you can weld for 3 to 3-1/2 minutes at 200 amps (its maximum amperage), and then the machine needs to cool down the rest of the 10 minute period. Caron says that this is true for each of the functions on the welder (MIG, TIG and stick. It's a MIG welder with a pulse function. It also has a duty cycle of 30%, but he's welded at 150 to 170 amps on 1/2 plate with this welder and never had it shut down on him. Then he compares the MigWeld 250P to the Millermatic 251, which is another 200 amp MIG welder, although it doesn't have pulse"}, {"url": "http://www.weldingtipsandtricks.com/what-does-duty-cycle-mean.html", "passage_text": "what does duty cycle mean? What is duty cycle? ---------------------------------------------------. Duty cycle is what percentage of time a welder can weld in a 10 minute period. for example, a 30% duty cycle at 100 amps means a welding machine can weld at 100 amps for 3 minutes before needing to stop and let the welder cool down. "}, {"url": "http://www.eastwood.com/blog/tech-articles/mig-welding-duty-cycles/", "passage_text": "A perfect example of a duty cycle can be found in the Eastwood MIG 175 Amp Welder. The MIG 175 has a rated duty cycle of 30% at 130 amps. This means that the power signal of the MIG 175 should remain on for 30% of the time and off 70% of the time at 130 amps of power. If you look at your welding time in increments of 10 minutes, the duty cycle is a percentage of that 10 minute increment. In other words, with a 30% duty cycle at 130 amps, you can weld for three solid minutes and should let the welder cool off for seven minutes. You can increase the duty cycle percentage by turning down the amperage output, but going above the amp output (in this case, 130 amps) will yield a lower duty cycle."}, {"url": "http://www.zena.net/htdocs/FAQ/dutycycle.shtml", "passage_text": "Duty cycle is a welding equipment specification which defines the number of minutes, within a 10 minute period, during which a given welder can safely produce a particular welding current. For example, a 150 amp. welder with a 30% duty cycle must be rested for at least 7 minutes after 3 minutes of continuous welding. (When you are paying an employee for welding, anything less than 100% duty wastes money.). If you buy a ZENA welder, you won't need a 250A welder to get 150A, 100% duty performance! ALL ZENA welders are rated at their 100% duty cycle power ca pability."}]