[{"url": "http://www.medindia.net/patients/lifestyleandwellness/thermogenic-food-for-weight-loss.htm", "passage_text": "DIT is also called the thermic effect of food (TEF). It increases energy expenditure by stimulating the sympathetic nervous system to cause enhanced metabolic activity. Diet-induced thermogenesis takes up about 10 percent of the calories. Here, is a list of thermogenic foods or foods that enhance thermogenesis. Since these foods have high fiber content and are low in calories, therefore, such foods play an important role in weight loss. Spices. Black or red hot peppers are the best example of thermogenic food."}, {"url": "https://answers.yahoo.com/question/index?qid=20080319191730AAAsj8I", "passage_text": "Best Answer: http://www.carbohydrate-guide.....html Thermogenic Foods filed under Weight Loss Tools | Printer-friendly version Here's a list of specific foods that raise your metabolism and help burn body fat."}, {"url": "http://www.foodandweightloss.com/wp/weight-loss-tips/top-10-thermogenic-foods-the-dieters-secret-weapon/", "passage_text": "Apples are classed as a high thermogenic food. These foods can be eaten cooked or raw, and can be eaten in combination with other foods or on their own. Adding them to dishes you already make, like putting some mushrooms in a beef stew, ups the thermogenic capacity of that dish quickly and easily."}, {"url": "http://www.burnthefat.com/fat_burning_foods.html", "passage_text": "When you combine thermogenic lean protein foods with the right amounts and types of essential fats, add in plenty of green vegetables and just the right amount of natural starchy carbs, your body will literally turn into a turbo-charged fat burning machine-without drugs, supplements or weird diet gimmicks."}, {"url": "http://www.burnthefat.com/fat_burning_foods.html", "passage_text": "Dietary Thermogenesis and the Thermic Effect Of Food. In reality, ALL foods are thermogenic because the body must use energy to digest them. This is known as the thermic effect of food (TEF) or specific dynamic action of food.. However, not all foods have the same thermic effect."}]