[{"url": "http://www.maidofheaven.com/joanofarc_faq.asp", "passage_text": "When was Joan of Arc burned at the stake? Joan of Arc was burned to death on May 30, 1431 in the French town of Rouen. Learn more about Joan's execution on the Long Biography and History page. Why was Joan of Arc burned at the stake? Joan of Arc's trial and execution was completely political and most reputable historians accurately refer to it as murder. The English had been fighting the French for almost 100 years and were just about to win the War, which would have given them control of all of France."}, {"url": "http://joanofarc.us/death_of_joan_of_arc.html", "passage_text": "The death of Joan of Arc would be conducted, with Joan of Arc at the stake, on May 30, 1431. She was tied to a tall pillar in the Vieux-Marche in Rouen, where she asked two of the clergy present to hold a crucifix before her. When Joan of Arc burned at the stake, witnesses said she met it with composure and bravery, causing many to feel that there was a horrible injustice against this young woman. After Joan of Arc died, the English raked the coals and ashes to expose her charred body to show that she had not escaped alive."}, {"url": "http://www.historynet.com/joan-of-arc", "passage_text": "They sentenced her to death. On May 30, 1431, at the age of 19, Joan of Arc was burned at the stake for her crimes against the English. In 1456, Pope Callixtux III declared that Joan was innocent of her crimes; at this time, she became a martyr. Joan Of Arc summary: Joan of Arc was born in 1412 in France. Most of her childhood was relatively uneventful, until in 1424, when she began having visions. In her visions, Saint Margaret, Saint Catherine, and Saint Michael told Joan that she needed to support King Charles VII and help rid France of"}, {"url": "http://www.answers.com/Q/Why_did_Joan_of_Arc_burn", "passage_text": "Making the world better, one answer at a time. Joan of Arc burned because of her refusal to stop wearing men's clothes and leading an army that was actually winning the war against the King of France. However, the King of France's claim that Joan was not being a proper lady was a cover up"}, {"url": "https://answers.yahoo.com/question/index?qid=20081030132600AAJmTf6", "passage_text": "Rating Newest Oldest. Best Answer: The REAL reason Joan was burned was purely political. She had led the French successfully against England and the England, having captured her, wanted her dead. But they needed a handy excuse. So they trumped up charges of witchcraft, because she claimed to have heard voices. She claimed they were angels. "}, {"url": "http://thenagain.info/WebChron/WestEurope/JoanArc.html", "passage_text": "Joan of Arc is burned as a relapsed heretic 1431. Joan of Arc Photo Archive Joan of Arc, a devout saint of God, was burned at the stake in May of 1431 on charges of heresy. After a long trial that lasted over a year, three major indictments were made against her. The first of these was that she used magic because she claimed to hear voices from St. Michael, St. Margaret, and St. Catherine. On these charges, Joan of Arc was burned at the stake in the Old Market Place of Rouen, near the church of Saint-Sauveur. She was only 18 or 19 years old, and her death was a powerful witness of her commitment to God."}, {"url": "https://en.wikipedia.org/wiki/Joan_of_Arc", "passage_text": "[ʒan daʁk] ; c. 1412 – 30 May 1431), nicknamed  The Maid of Orleans  (Orléans: French La pucelle'D) orleans orléans is considered a Heroine of france for her role During the lancastrian phase Of The' Hundred, years war and was canonized As A roman. catholic saint She was beatified in 1909 and canonized in 1920. Joan of Arc is one of the nine secondary patron saints of France, along with St. Denis, St. Martin of Tours, St. Louis, St. Michael, St. Remi, St. Petronilla, St. Radegund and St. Therese thérèse Of. lisieux"}, {"url": "http://www.biography.com/people/joan-of-arc-9354756", "passage_text": "Synopsis. Joan of Arc, nicknamed The Maid of Orleans, orléans was born in 1412 In, Domremy, Domrémy. Bar france a national Heroine, of france at age 18 she Led the french army to victory Over the British. At orleans orléans captured, A year later joan was burned at the stake as a Heretic by the English and. their french collaborators "}, {"url": "http://guardianlv.com/2014/05/joan-of-arc-burned-alive-history-today/", "passage_text": "Joan of Arc was then classified as a relapsed heretic and ordered, on May 29, to be put to death. At the Place du Vieux-Marche in Rouen, her last request was to have a priest shout prayers and hold a crucifix for her to see as she died. On May 30, 1431, Joan of Arc was burned alive at the stake. Joan of Arc was sentenced to death for her beliefs and thirty years later, she was found to be not guilty. Joan was canonized (made a saint) by Pope Benedict XV in 1920 at St. Peter’s Basilica. Her legend now lives on as Saint Joan of Arc. "}]