[{"url": "http://www.avogel.co.uk/health/muscles-joints/muscle-strain/calf/", "passage_text": "An introduction from Earle. The calf is the group of muscles in your lower leg. Calf strain is a common muscle injury, most often associated with sports. It occurs when you damage or tear part of your muscle in your lower leg. It seems that men are more susceptible to this injury than women, with the most common age range being 25-45. There are two muscles in your lower leg. "}, {"url": "http://www.knee-pain-explained.com/pulled-calf-muscle.html", "passage_text": "The most important treatment for a pulled calf muscle is rest. It sounds simple, but it is vital to rest to allow the muscles to heal and to prevent the injury getting worse. Returning to activity too soon can turn a grade 1 torn calf muscle into a grade 2 or a grade 2 to a grade 3. Other common terms for the condition include a calf muscle strain or torn calf muscle. Essentially, what all these terms refer to is when the calf muscles are pulled beyond their normal elastic limit, overstretching them and damaging some or all of muscle fibres."}, {"url": "http://www.knee-pain-explained.com/pulled-calf-muscle.html", "passage_text": "A pulled calf muscle is the most common cause of calf pain, but there are other, potentially life threatening causes of calf pain. Visit the calf pain section to find out more. Other common terms for the condition include a calf muscle strain or torn calf muscle. Essentially, what all these terms refer to is when the calf muscles are pulled beyond their normal elastic limit, overstretching them and damaging some or all of muscle fibres."}, {"url": "http://www.sportsinjuryclinic.net/sport-injuries/ankle-achilles-shin-pain/calf-strain", "passage_text": "A calf strain is a tear to one or both of the muscles at the back of the lower leg. We explain symptoms as well as treatment and rehabilitation exercises to return you back to full fitness. Calf strain explained. The calf muscles consist of the gastrocnemius muscle which is the big muscle at the back of the lower leg and the soleus muscle which is a smaller muscle lower down in the leg and under the gastrocnemius."}, {"url": "http://www.wikihow.com/Diagnose-a-Torn-Calf-Muscle", "passage_text": "If you continue to work this muscle, it may tear. A torn calf muscle takes quite some time to heal, and is very prone to re-injury. There are other issues and injuries that can cause calf pain, but if the pain is severe -- or you hear a pop or snap sound from your leg -- see a doctor immediately. "}, {"url": "http://www.sportsinjuryclinic.net/sport-injuries/ankle-achilles-shin-pain/calf-strain", "passage_text": "There is likely to be tightness and aching in the calf muscles two to five days after injury. Grade 2 symptoms. Symptoms of a grade 2 strain will be more severe than a grade one with up to 90% of the muscle fibers torn. A sharp pain at the back of the lower leg will be felt with significant pain walking. There is likely to be swelling in the calf muscle with mild to moderate bruising. Calf strain explained. The calf muscles consist of the gastrocnemius muscle which is the big muscle at the back of the lower leg and the soleus muscle which is a smaller muscle lower down in the leg and under the gastrocnemius."}, {"url": "http://www.knee-pain-explained.com/pulled-calf-muscle.html", "passage_text": "Calf muscle strains can also developed due to repetitive overuse of the calf muscles usually with running and jumping, especially if the muscles are weak or tight. Pulled calf muscles are the most common cause of calf pain in runners. Other common terms for the condition include a calf muscle strain or torn calf muscle. Essentially, what all these terms refer to is when the calf muscles are pulled beyond their normal elastic limit, overstretching them and damaging some or all of muscle fibres."}, {"url": "http://www.knee-pain-explained.com/pulled-calf-muscle.html", "passage_text": "A pulled calf muscle usually happens suddenly due to injury, but can develop gradually from overuse. A calf muscle strain most commonly affects the larger, more superficial gastrocnemius muscle but can affect the soleus muscle as well. Other common terms for the condition include a calf muscle strain or torn calf muscle. Essentially, what all these terms refer to is when the calf muscles are pulled beyond their normal elastic limit, overstretching them and damaging some or all of muscle fibres."}, {"url": "http://www.webmd.com/fitness-exercise/guide/muscle-strain", "passage_text": "Muscle Strain Overview. Muscle strain, muscle pull, or even a muscle tear refers to damage to a muscle or its attaching tendons. You can put undue pressure on muscles during the course of normal daily activities, with sudden heavy lifting, during sports, or while performing work tasks. "}, {"url": "http://www.sportsinjuryclinic.net/sport-injuries/ankle-achilles-shin-pain/calf-strain", "passage_text": "A calf muscle tear is graded from 1 to 3, with grade 3 being the most severe. Grade 1 symptoms. Grade 1 calf strain is a minor tear with up to 10% of the muscle fibers effected. The athlete will feel a twinge of pain in the back of the lower leg. Calf strain explained. The calf muscles consist of the gastrocnemius muscle which is the big muscle at the back of the lower leg and the soleus muscle which is a smaller muscle lower down in the leg and under the gastrocnemius."}]