[{"url": "http://lookgoodfeelgreatalways.com/gout-prevent-reverse/", "passage_text": "Uric acid is produced as a waste product during the cell turnover process in our body tissues. When the level of uric acid is high, it is deposited and crystallized at the joints. A collection of uric acid crystals is called tophi. They are usually not painful in itself and are found in the earlobe, elbow, Achilles tendon. However, tophi can trigger inflammation at the joints leading to gouty arthritis. If you have parents who suffer from gout, there is 20% higher risk of developing it. Gout is characterized by the build up of uric acid and the problem of eliminating it. It is normally deposited at the joints, skin and other and tissue. Gout attack or gouty arthritis happened when there is a sudden onset of hot, red and swelling of the joints"}, {"url": "http://www.naturalnews.com/034658_cherries_gout_arthritis.html", "passage_text": "Cherries are also well known to help reverse gout -- a condition caused by too much uric acid circulating in the blood. (http://www.naturalnews.com/034479_cherries_g... ). Like all dark-skinned fruits, cherries are high in antioxidants and other phytochemicals that promote human health in numerous ways. "}, {"url": "http://blogs.naturalnews.com/6-natural-ways-reverse-gout/", "passage_text": "Posted Monday, July 21, 2014 at 02:29pm EDT. Keywords: gout, reverse gout, uric acid. Reversing gout doesn’t mean merely treating the symptoms that appear, such as pain and inflammation, but targeting the root causes of these symptoms. Gout is a particularly complex variation of arthritis, and generally hits at night. Natural Ways to Reverse Gout. 1. Water is your best friend! Dehydration is known to cause a buildup of uric acid, so water is the first thing many people turn to. Certain liquids are able to boost your body’s metabolism, allowing to flush your system of toxins that cause gout flare ups."}, {"url": "http://www.goutnc.com/how-to-reverse-gout.html", "passage_text": "How To Reverse Gout Detail. By looking at least 5 fruits useful in curing the arteriosclerosis and hyperucemia is the best way to prepare your food intake of foods are more prevalent in people who took 4 grams of vitamin C had an increases the result of too much uric acid gets abnormal uric acid elimination of herbs (e. "}, {"url": "http://isgout.com/can-you-reverse-gout/", "passage_text": "Make sure you avoid gout Savient can you reverse gout Pharmaceutical mediators from the use of any drugs for gout find impacted from their system. People with gout high level or uric acid efficiently it truly is instructed from the disease progress is seldom linear. The Gout Remedy Report provide excellent cure your gout returning in the fluids of the joint either by. pharmacy with a current value at $39. If cherries and even uric acid. Your bed sheet weight loss in the market to help back to what is gout pain."}, {"url": "http://www.kidneycoach.com/194/gout-kidney-disease/", "passage_text": "Purines are found in certain foods such as meat, peas, and alcohol, and also occur naturally in our cells. High levels of uric acid cause inflammation and damage to joints and soft tissues. So gout can be either caused by the overproduction or under excretion of uric acid, such as in kidney disease. Gout can be a very common occurrence in those suffering from under functioning kidneys. Here is a list of the major contributing factors, and risk factors, of gout: 1  Kidney failure. 2  Family history of gout. "}, {"url": "http://www.medicinenet.com/gout_gouty_arthritis/article.htm", "passage_text": "Gout facts. 1  Gout is a type of arthritis that causes inflammation, usually in one joint, that begins suddenly. 2  Gouty arthritis is caused by the deposition of crystals of uric acid in a joint. 3  Gout can cause symptoms and signs such as. 4  nodules under the skin called tophi, 5  joint redness, 6  swollen joints, 7  joint pain, 8  warmth of the joint. 9  The most 10  ... Ch "}, {"url": "http://www.clevelandclinicmeded.com/medicalpubs/diseasemanagement/rheumatology/gout-and-pseudogout/", "passage_text": "Gout is a crystal deposition disease characterized by the supersaturation and precipitation of MSU crystals in tissues resulting in inflammation and, consequently, tissue damage. Gout is characterized by acute or subacute attacks of joint or soft tissue inflammation resulting from MSU crystal deposition. "}]