[{"url": "http://www.academickids.com/encyclopedia/index.php/Treaty_of_Versailles", "passage_text": "The Treaty of Versailles of 1919 is the peace treaty created as a result of six months of negotiations at the Paris Peace Conference of 1919, which put an official end to World War I between the Allies and Central Powers, but if it brought peace rather than war can be disputed. Article 231 of the Treaty (the 'war guilt' clause) held Germany solely responsible for all 'loss and damage' suffered by the Allies during the war and provided the basis for reparations."}, {"url": "http://spartacus-educational.com/FWWversailles.htm", "passage_text": "Germany signed the Versailles Treaty under protest. The USA Congress refused to ratify the treaty. Many people in France and Britain were angry that there was no trial of the Kaiser or the other war leaders. "}, {"url": "http://www.ducksters.com/history/world_war_i/end_of_ww1_post_war.php", "passage_text": "However, French Prime Minister Georges Clemenceau felt that Germany was responsible for the war and should take the blame and be forced to pay large reparations. Treaty of Versailles. The Treaty of Versailles was signed between the Allied Powers and Germany on June 28, 1919. This officially ended World War I. The treaty was extremely harsh on Germany. It forced Germany to accept the responsibility for causing all the loss and damage of the war. Germany was forced to disarm, give up land to France, and to pay reparations of 132 billion Marks (around $442 billion in 2014 money)."}, {"url": "https://simple.wikipedia.org/wiki/Treaty_of_Versailles", "passage_text": "The Treaty of Versailles was a peace treaty between the five nations, France, Germany, Britain, Austria-Hungary and the United States after World War I. Play media. The Signing of the Peace Treaty of Versailles. The Treaty of Versailles was a peace treaty between the five nations, France, Germany, Britain, Austria-Hungary and the United States after World War I. The treaty was made in 1919, but the German government did not participate in it."}, {"url": "https://en.wikipedia.org/wiki/Treaty_of_Versailles", "passage_text": "It ended the state of war between Germany and the Allied Powers. It was signed on 28 June 1919, exactly five years after the assassination of Archduke Franz Ferdinand. The other Central Powers on the German side of World War I were dealt with in separate treaties. Although the armistice, signed on 11 November 1918, ended the actual fighting, it took six months of negotiations at the Paris Peace Conference to conclude the peace treaty."}, {"url": "http://encyclopedia.kids.net.au/page/tr/Treaty_of_Versailles", "passage_text": "The treaty was ratified on January 10, 1920 and required that Germany accept responsibility for the war and was thus obliged to pay large amounts of compensation (known as war reparations[?]). Like many other treaties, it is named for the place of its signing: the Hall of Mirrors[?] in the Palace of Versailles. Alsace-Lorraine) to France, northern Schleswig at Tondern in Schleswig-Holstein to Denmark, and parts of Pomerania, Silesia and Posen, West Prussia at the Baltic Sea to Poland."}, {"url": "http://encyclopedia.kids.net.au/page/tr/Treaty_of_Versailles", "passage_text": "Woodrow Wilson with the American Peace Commissioners. Other provisions included the loss of German colonies, loss of German territory (eg. Alsace-Lorraine) to France, northern Schleswig at Tondern in Schleswig-Holstein to Denmark, and parts of Pomerania, Silesia and Posen, West Prussia at the Baltic Sea to Poland. This area later became known as the  Polish Corridor "}, {"url": "http://www.historyinanhour.com/2012/06/28/treaty-of-versailles-summary/", "passage_text": "On 28 June 1919, Germany reluctantly signed the Treaty of Versailles as part of the Paris Peace Conference in the Hall of Mirrors at the Palace of Versailles – exactly five years on from the assassination of Archduke Franz Ferdinand, the spark that had ignited the First World War. The terms of the Treaty of Versailles were harsh and not for negotiation. Germany lost 13 per cent of her territory, which meant 12 per cent of Germans now lived in a foreign country, and Germany’s colonial possessions were redistributed among the other colonial powers."}]