[{"url": "https://en.wikipedia.org/wiki/Surface_tension", "passage_text": "Surface tension is an important factor in the phenomenon of capillarity. Surface tension has the dimension of force per unit length, or of energy per unit area. The two are equivalent—but when referring to energy per unit of area, people use the term surface energy —which is a more general term in the sense that it applies also to solids and not just liquids. At liquid-air interfaces, surface tension results from the greater attraction of liquid molecules to each other (due to cohesion) than to the molecules in the air (due to adhesion)."}, {"url": "http://water.usgs.gov/edu/surface-tension.html", "passage_text": "Surface tension The property of the surface of a liquid that allows it to resist an external force, due to the cohesive nature of its molecules. The cohesive forces between liquid molecules are responsible for the phenomenon known as surface tension. Surface Tension and Droplets: Surface tension is responsible for the shape of liquid droplets. Although easily deformed, droplets of water tend to be pulled into a spherical shape by the cohesive forces of the surface layer."}, {"url": "https://simple.wikipedia.org/wiki/Surface_tension", "passage_text": "Surface tension is an effect where the surface of a liquid is strong. The surface can hold up a weight, and the surface of a water droplet holds the droplet together, in a ball shape. Some small things can float on a surface because of surface tension, even though they normally couldn't float. The cohesive forces among the liquid molecules cause surface tension. In the bulk of the liquid, each molecule is pulled equally in every direction by neighboring liquid molecules, resulting in a net force of zero."}, {"url": "https://en.wikipedia.org/wiki/Surface_tension", "passage_text": "Surface tension is the elastic tendency of liquids which makes them acquire the least surface area possible. Surface tension is an important property that markedly influences many ecosystems. At liquid-air interfaces, surface tension results from the greater attraction of liquid molecules to each other (due to cohesion) than to the molecules in the air (due to adhesion)."}, {"url": "http://water.usgs.gov/edu/surface-tension.html", "passage_text": "Credit: Armin Kuebelbeck. Kübelbeck surface Tension the property of the surface of a liquid that allows it to resist an external, force due to the cohesive nature of its. Molecules the cohesive forces between liquid molecules are responsible for the phenomenon known as surface. tension Surface Tension and Droplets: Surface tension is responsible for the shape of liquid droplets. Although easily deformed, droplets of water tend to be pulled into a spherical shape by the cohesive forces of the surface layer."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/surten.html", "passage_text": "Surface Tension. The cohesive forces between liquid molecules are responsible for the phenomenon known as surface tension. The molecules at the surface do not have other like molecules on all sides of them and consequently they cohere more strongly to those directly associated with them on the surface. Surface Tension of Water. The surface tension of water is 72 dynes/cm at 25°C. It would take a force of 72 dynes to break a surface film of water 1 cm long. The surface tension of water decreases significantly with temperature as shown in the graph. The surface tension arises from the polar nature of the water molecul"}, {"url": "https://simple.wikipedia.org/wiki/Surface_tension", "passage_text": "Surface tension has the dimension of force per unit length, or of energy per unit area. The two are equivalent—but when referring to energy per unit of area, people use the term surface energy —which is a more general term in the sense that it applies also to solids and not just liquids. The cohesive forces among the liquid molecules cause surface tension. In the bulk of the liquid, each molecule is pulled equally in every direction by neighboring liquid molecules, resulting in a net force of zero."}, {"url": "http://chemistry.about.com/od/chemistryglossary/g/Surface-Tension-Definition.htm", "passage_text": "By Anne Marie Helmenstine, Ph.D. Definition: Surface tension is a physical property equal to the amount of force per unit area necessary to expand the surface of a liquid. Surface tension forces are due to intermolecular forces between the liquid's molecules at the liquid's outer boundaries. "}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/surten.html", "passage_text": "Surface tension is typically measured in dynes/cm, the force in dynes required to break a film of length 1 cm. Equivalently, it can be stated as surface energy in ergs per square centimeter. Water at 20°C has a surface tension of 72.8 dynes/cm compared to 22.3 for ethyl alcohol and 465 for mercury. Surface Tension of Water. The surface tension of water is 72 dynes/cm at 25°C. It would take a force of 72 dynes to break a surface film of water 1 cm long. The surface tension of water decreases significantly with temperature as shown in the graph. The surface tension arises from the polar nature of the water molecule"}]