[{"url": "https://en.wikipedia.org/wiki/Promontory,_Utah", "passage_text": "On May 10, in anticipation of the ceremony, Union Pacific 's No. 119 and Central Pacific's No. 60 (better known as the Jupiter) locomotives were drawn up face-to-face on Promontory Summit, separated only by the width of a single tie. Rising to an elevation of 4,902 feet (1,494 m) above sea level, it lies to the north of the Promontory Mountains and the Great Salt Lake."}, {"url": "http://history1800s.about.com/od/steamlocomotives/ig/19thcentloco/goldenspike.htm", "passage_text": "The final spike for the transcontinental railroad was driven on May 10, 1869, at Promontory Summit, Utah. A ceremonial golden spike was tapped into a hole which had been drilled to receive it, and photographer Andrew J. Russell recorded the scene. As the Union Pacific tracks had stretched westward, the tracks of the Central Pacific headed east from California. With steam locomotives able to roll from ocean to ocean, the world suddenly seemed to be getting smaller. Incidentally, the original news reports stated that the golden spike had been driven at Promontory Point, Utah, which is about 35 miles from Promontory Summit."}, {"url": "http://www.pbs.org/weta/thewest/places/states/utah/ut_promontory.htm", "passage_text": "On May 10, 1869, Promontory Summit was the site of a grand celebration, as the Union Pacific's No. 119 and the Central Pacific's Jupiter touched cowcatchers to complete the transcontinental railroad. By 1903, however, a cutoff had rendered this historic stretch of track obsolete. "}, {"url": "https://en.wikipedia.org/wiki/Promontory_Point,_Utah", "passage_text": "Promontory Point redirects here. For the meeting point of the U.S. Trans Continental Railroad, see Promontory Summit. For other uses, see Promontory Point (disambiguation) . It is 4.75 kilometres (2.95 mi) northwest of the west end of Fremont Island in Weber County. Promontory Point also refers to the location 41°13′20″N 112°24′38″W﻿ / ﻿41.22222°N 112.41056°W﻿ / 41.22222; -112.41056 where the Lucin Cutoff intersects the east coast of the peninsula, 1.7 miles (2.7 km) northeast of the cape."}, {"url": "https://en.wikipedia.org/wiki/Promontory,_Utah", "passage_text": "More than 4,000 workers, of whom two thirds were Chinese, had laid more than 100 mi (160 km) of track at altitudes above 7,000 ft (2,100 m). In May 1869, the railheads of the Union Pacific and the Central Pacific railroads finally met at Promontory Summit, Utah Territory. Rising to an elevation of 4,902 feet (1,494 m) above sea level, it lies to the north of the Promontory Mountains and the Great Salt Lake."}, {"url": "http://www.oregonlive.com/travel/index.ssf/2013/07/utahs_promontory_point_marks_t.html", "passage_text": "Actual construction took just four years to build the lines over rivers, across plains, through mountains. When completed, it allowed coast-to-coast travel in six days rather than six months. But once the rail lines were linked, it didn't take long for Promontory Point to fade from prominence. Six months after the Union Pacific and Central Pacific were joined, the Promontory site became just a whistle stop along the way. In 1903 engine 119 was sold for scrap. The Jupiter met the same fate three years later. The companies were in a race. For good reason. The project was subsidized by the federal government to the tune of between $16,000 to $48,000, plus 10 land sections (160 acres) for each mile of track laid. It was marked by a simple concrete pylon holding a brass plaque."}, {"url": "http://www.accelerationwatch.com/promontorypoint.html", "passage_text": "After a seven-year sprint and major, often heroic human effort, the first phase of construction of the transcontinental railroad had its watershed moment on May 10, 1869, when the Central Pacific and the Union Pacific railways joined at Promontory Point, Utah. "}, {"url": "https://en.wikipedia.org/wiki/Promontory,_Utah", "passage_text": "Not to be confused with Promontory Point, Utah. Promontory in Box Elder County, Utah, United States is an area of high ground 32 mi (51 km) west of Brigham City, Utah and 66 mi (106 km) northwest of Salt Lake City. Rising to an elevation of 4,902 feet (1,494 m) above sea level, it lies to the north of the Promontory Mountains and the Great Salt Lake."}, {"url": "http://www.answers.com/Q/What_important_transportation_milestone_happened_in_Promontory_Point_Utah_in_1869", "passage_text": "The transcontinental railroad project was completed at Promontory Point, Utah. A team from the the Union Pacific railroad company working west from the east coast and a team … from the Central Pacific railroad company working east from the west met there with great celebration on May 10th 1869. Promontory point, Utah.   On may 10th 1869 the construction of the transcontinental railroad linking the Union Pacific and the Central Pacific railroads met at that … spot. Leland Stanford, president of the Central Pacific railroad drove the last spike, a golden one with a silver hammer"}]