[{"url": "http://www.answers.com/Q/Where_were_the_first_mummies_found", "passage_text": "The first mummies were found in Egypt and had been known about for  many years before they became artifacts and displayed in museums.  There is no name as to know who the pe … rson was to find the first  mummy, but Christian Herzog was first to publish his findings of an  unrolled mummy in 1718. Answered."}, {"url": "http://www.timeforkids.com/news/tombs-discovered-egypt/11861", "passage_text": "Each one contains a mummy. In one tomb, 12 coffins from around 1500 B.C. were found stacked on top of one another, so the actual number of mummies comes to 57. Egypt's Supreme Council of Antiquities announced the discovery on Sunday."}, {"url": "http://ngm.nationalgeographic.com/1995/03/chinchorro-mummies/arriaza-text", "passage_text": "The Chinchorro (named in the 1960s for a beach in Arica where similar mummies had been found) were prehistoric fisherfolk who lived in scattered villages along the desert coast of Chile and Peru."}, {"url": "http://www.pbs.org/wgbh/nova/ancient/mummies-101.html", "passage_text": "Over the years, some 115 of these sacrificial mummies have been found in the high Andes. In 1995, Dr. Johan Reinhard stumbled upon the body of a young girl, barely into her teens, on top of Mount Ampato in the Peruvian Andes. Named Juanita, she is the best-preserved Incan mummy ever discovered."}, {"url": "http://news.nationalgeographic.com/news/2004/05/0519_040519_egyptmummies.html", "passage_text": "An underground maze found packed with mummies was most likely an ancient multifamily cemetery, Egypt's top archaeologist said. A French team made the recent discovery of hundreds of mummies crammed into deep shafts and corridors at Saqqara, 15 miles (25 kilometers) south of Cairo. Printer Friendly."}, {"url": "http://www.answers.com/Q/Where_were_the_first_mummies_found", "passage_text": "The first mummy that was ever found is unknown because mummies have  been a part of human cultures since culture began. The first mummy  unwrapped was from Cairo and was fou … nd by Christian Herzog in the  late 1600s."}, {"url": "http://www.thingsthatgoboo.com/monsters/mummiesmany.htm", "passage_text": "These mummies were found in the area between Chile and Peru. The Chinchorros may well have been the first people in the world to practice mummification. The Chinchorro people began preserving their dead 2,000 years before the Egyptians! There has been approximately 282 Chinchorro mummies discovered."}, {"url": "http://www.answers.com/Q/Where_were_the_first_mummies_found", "passage_text": "Dr. Joann Fletcher did believe she found Nefertiti's mummy in the tomb KV35 in the Valley of the Kings, but Dr. Zahi Hawass, Egypts leading mummy hunter (he is always seen wit … h an Indiana Jones hat on), believes otherwise and thinks it is the mummy of a 15 year old boy."}]