[{"url": "http://bodypiercingmag.com/helix-piercing.html", "passage_text": "Anti Helix Piercing. Inner helix piercing: Here the inner cartilage of the ear is pierced with a small curved needle. Inner Helix Piercing. Upper helix piercing: Perforation is made in the upper part of the helix region. "}, {"url": "http://www.asha.org/public/hearing/Outer-Ear/", "passage_text": "The Outer Ear. Parts of the Ear: Outer Ear | Middle Ear | Inner Ear. The outer ear consists of the pinna, or auricle, and the ear canal (external auditory meatus). The pinna – the part of the ear that we see on each side of our heads – is made of cartilage and soft tissue so that it keeps a particular shape but is also flexible. The pinna serves as a collector of sound vibrations around us and guides the vibrations into the ear canal."}, {"url": "https://en.wikipedia.org/wiki/Ear", "passage_text": "The ear is the organ that detects sound. It not only receives sound, but also aids in balance and body position. The ear is part of the auditory system. Often the entire organ is considered the ear, though it may also be considered just the visible portion. In most mammals, the visible ear is a flap of tissue that is also called the pinna (or auricle in humans) and is the first of many steps in hearing. Vertebrates have a pair of ears placed somewhat symmetrically on opposite sides of the head. This arrangement aids in the ability to localize sound sources."}, {"url": "http://www.bodyjewelleryshop.com/body_jewellery_shop/body_piercings/ear_piercing_jewellery.cfm", "passage_text": "Auricle Piercing. Auricle piercings consist of an ear rim piercing placed on the outside of the ear, about halfway down. They are a very popular piercing and you can wear a variety of studs, ear cuffs or rings in your auricle piercing. Industrial piercings consist of two piercings along the outer ear rim linked by one long bar. They can be placed either straight across the ear or at an angle. In different parts of the world the term industrial piercing can refer to both vertically placed piercings and horizontal piercings."}, {"url": "http://www.bodyjewelleryshop.com/body_jewellery_shop/body_piercings/ear_piercing_jewellery.cfm", "passage_text": "Helix piercings are located in the outer edge of the ear and are usually placed between the middle and top of the ear. Helix piercings at the top of the ear are also known as pina piercings, while helix piercings near the middle of the ear are also known as auricle piercings. 1  Show More Helix Jewellery ». Industrial piercings consist of two piercings along the outer ear rim linked by one long bar. They can be placed either straight across the ear or at an angle. In different parts of the world the term industrial piercing can refer to both vertically placed piercings and horizontal piercings."}, {"url": "http://medical-dictionary.thefreedictionary.com/helix", "passage_text": "helix. 1. a winding structure; see also coil and spiral. 2. the superior and posterior free margin of the pinna of the ear. α-helix (alpha helix) the complex structural arrangement of parts of protein molecules in which a single polypeptide chain forms a right-handed helix. double helix, Watson-Crick helix a representation of the structure of DNA, consisting of two coiled chains arranged antiparallel to each other, each containing information completely specifying the other chain."}, {"url": "http://www.thefreedictionary.com/DNA+double+helix", "passage_text": "The DNA molecule consists of two polynucleotide chains in the form of a double helix, containing phosphate and the sugar deoxyribose and linked by hydrogen bonds between the complementary bases adenine and thymine or cytosine and guanine. DNA. n. A nucleic acid that carries the genetic information in cells and some viruses, consisting of two long chains of nucleotides twisted into a double helix and join"}, {"url": "http://www.theodora.com/anatomy/the_external_ear.html", "passage_text": "The ligaments of the auricula (ligamenti auricularia [ Valsalva ]; ligaments of the pinna) consist of two sets: (1) extrinsic, connecting it to the side of the head; (2) intrinsic, connecting various parts of its cartilage together. The extrinsic ligaments are two in number, anterior and posterior. "}, {"url": "http://www.chop.edu/conditions-diseases/ear-deformities", "passage_text": "1 Ear tags: Also known as an accessory tragus or a branchial cleft remnant, ear tags consist of skin and cartilage. 2  Earlobe deformities: These come in a variety of shapes, including earlobes with clefts, duplicate earlobes, and earlobes with skin tags. 3  Traumatic ear deformities: Lacerations, tears and bite injuries. The ear is shaped like the letter C, formed by the helix and the earlobe. Inside the C is the letter Y, formed by the antihelix and the superior and inferior crura. The central part of the ear is shaped like a conch sea shell, and is called the concha. There is a small bump in front of the ear canal called the tragus."}]