[{"url": "http://www.ehow.com/about_5348793_history-anemometer.html", "passage_text": "Save. An anemometer is a device used to measure the speed of the wind. As with many scientific inventions, it's hard to pinpoint the first person to invent an anemometer. Sometimes the first inventor doesn't produce the best instrument, and improvements made by later scientists significantly enhance accuracy and ease of use. Cup Anemometer. A more advanced anemometer design using four cups attached by spokes to a central rod was invented by John Thomas Romney Robinson in 1846. Robinson was the director of the Armagh Observatory in Ireland. With his design, cups caught the wind and spun around faster the stronger the wind velocity."}, {"url": "http://www.answers.com/Q/Who_invented_the_anemometer_and_when", "passage_text": "Making the world better, one answer at a time. The anemometer has no precisely known inventor. The first recorded description of an anemometer was by Leon Battista Alberti in 1450. The cup anemometer was invented in 1846 by Dr. John Thomas Ronrey Robinson. An anemometer is a device used to measure wind speed. It is used by  atmospheric scientists or those gathering weather data.   Anemometer-An anemometer is a device for me … asuring wind  speed, and is one instrument used in a weather station. The term is  derived from the Greek word, anemos, meaning wind."}, {"url": "http://www.ehow.com/about_5348793_history-anemometer.html", "passage_text": "Mechanical Anemometer. Credited with devising the first mechanical anemometer is Italian art architect and mathematician Leon Batista Alberti, in 1450. In his device, the wind pushed against a disk, and an accompanying scale gave a relative strength of the wind as shown by the angle of inclination of the disk. Cup Anemometer. A more advanced anemometer design using four cups attached by spokes to a central rod was invented by John Thomas Romney Robinson in 1846. Robinson was the director of the Armagh Observatory in Ireland. With his design, cups caught the wind and spun around faster the stronger the wind velocity."}, {"url": "http://www.innovateus.net/content/anemometer", "passage_text": "An anemometer is a device for measuring wind speed, and is a common weather station instrument. The term is derived from the Greek word anemos, meaning wind. The first known description of an anemometer was given by Leon Battista Alberti around 1450. 1 Cup anemometers: Simple type of anemometer is the cup anemometer, invented (1846) by Dr. John Thomas Romney Robinson, of Armagh Observatory. 2  It consisted of four hemispherical cups."}, {"url": "http://www.hammillpost.com/2013/03/first-measurement-of-wind-speed-─-enter-the-anemometer/", "passage_text": "By Arthur K Burditt on March 20, 2013. Wind speed is measured by a device called an anemometer, which comes from the Greek word for wind “anemos”. Italian art architect, mathematician and renaissance man Leon Battista Alberti invented the first mechanical anemometer in 1450. His instrument consisted of a disk placed perpendicular to the wind. Englishman Robert Hooke re-invented the anemometer in 1664 and often is mistakenly credited as its first inventor. In 1846, Irish researcher John Thomas Romney Robinson invented the hemispherical cup anemometer which is still used today. Geologist Dr. Andreas Pflitsch invented a sonic anemometer in 1994."}, {"url": "https://en.wikipedia.org/wiki/Anemometer", "passage_text": "In 1450, the Italian art architect Leon Battista Alberti invented the first mechanical anemometer; in 1664 it was re-invented by Robert Hooke (who is often mistakenly considered the inventor of the first anemometer). An anemometer is a device used for measuring wind speed, and is a common weather station instrument. The term is derived from the Greek word anemos ,which means wind, and is used to describe any wind speed measurement instrument used in meteorology. The first known description of an anemometer given by Leon Battista Alberti in 1450"}, {"url": "http://saylor.org/site/wp-content/uploads/2011/04/Anemometer.pdf", "passage_text": "In 1450, the Italian art architect Leon Battista Alberti invented the first mechanical anemometer; in 1664 it wasre-invented by Robert Hooke (who is often mistakenly considered the inventor of the first anemometer). An anemometer is a device for measuring wind speed, and is acommon weather station instrument. The term is derived from theGreek word anemos, meaning wind. The first known description of ananemometer was given by Leon Battista Alberti around 1450."}, {"url": "http://www.whenwasitinvented.org/when-was-anemometer-invented/", "passage_text": "The first mechanical anemometer to measure the speed of wind was invented by an Italian art architect, Leon Battista Alberti in the year 1450. In the year 1846, Dr. John Thomas Romney Robinson invented a simple hemispherical cup anemometer. In the year 1991, Australian Derek Weston modified the anemometer to measure both wind speed and the direction of wind."}]