[{"url": "http://www.caranddriver.com/reviews/2011-toyota-sienna-xle-awd-instrumented-test", "passage_text": "The XLE comes pretty well equipped as standard, with first-and second-row leather seats, heated front seats, power-sliding side doors, a power rear hatch, a power sunroof, and tri-zone climate control. Our test vehicle stickered for $42,211, about what you would expect to pay for an uplevel van these days. The XLE starts at $35,315 before adding the XLE Premium package, a $6225 option that includes touchscreen DVD navigation, a rear-seat entertainment system, rear parking sensors, a 10-speaker JBL stereo with Bluetooth phone connectivity, and keyless entry and pushbutton start."}, {"url": "http://autoweek.com/article/car-reviews/2015-toyota-camry-xle-v6-first-drive", "passage_text": "With a starting price of $26,975 for the XLE model, the 2015 Camry remains a lot of car for the money and perhaps all the car that Point-A-to-Point-B drivers will need…much as it's always been. Jay Ramey-Jay Ramey is an Associate Editor with Autoweek, and has been with the magazine since 2013. The 2015 Toyota Camry is not all-new for this model year, but it might as well be -- the car's most recent facelift has touched almost every part, inside and out."}, {"url": "https://en.wikipedia.org/wiki/Camry", "passage_text": "Since the release of the wide-bodied versions, Camry has been extolled by Toyota as the firm's second world car after the Corolla. In Japan, Camry is exclusive to Toyota Corolla Store retail dealerships. Narrow-body cars also spawned a rebadged sibling in Japan, the Toyota Vista (トヨタ・ビスタ)—also introduced in 1982 and sold at Toyota Vista Store locations. When Camry became an independent model line in 1982 with the V10 series, Toyota made it available as a five-door liftback in addition to the sedan."}, {"url": "http://usnews.rankingsandreviews.com/cars-trucks/Toyota_Camry/", "passage_text": "Details: 2015 Toyota Camry. The 2015 Toyota Camry is a five-seat sedan that is available in LE, SE, XSE and XLE trims. A 2.5-liter four-cylinder engine is standard and a 3.5-liter V6 is available. Both engines come with a six-speed automatic transmission and front-wheel drive. The Toyota Camry Hybrid is reviewed separately. The Camry receives a major refresh for the 2015 model year, but its last full redesign was in 2012. As a result, this overview uses applicable research and reviews from the 2012 through 2015 model years."}, {"url": "http://ask.cars.com/2009/08/whats-the-difference-between-the-2010-toyota-camry-le-and-xle.html", "passage_text": "The 2010 Toyota Camry XLE has more features – mostly on the inside -- than the LE. The Camry lineup starts with the base model ($19,395) and progressively increases pricing and features with the LE ($20,850), SE ($22,165) and XLE ($25,925). Opting for the XLE four-cylinder adds $5,075 over the LE four-cylinder model. Notable additional features included as standard on the XLE are:"}, {"url": "https://en.wikipedia.org/wiki/Camry", "passage_text": "Between 1979 and 1982, the Camry nameplate was delegated to a four-door sedan model in Japan, known as the Celica Camry. When Camry became an independent model line in 1982 with the V10 series, Toyota made it available as a five-door liftback in addition to the sedan."}, {"url": "https://en.wikipedia.org/wiki/Camry", "passage_text": "The Toyota Camry (/ˈkaemri/ ; ˈkæmri: japanese・トヨタカム) リ is an automobile sold internationally by The japanese Manufacturer toyota since, 1982 spanning multiple. generations When Camry became an independent model line in 1982 with the V10 series, Toyota made it available as a five-door liftback in addition to the sedan."}, {"url": "https://answers.yahoo.com/question/index?qid=20110220102238AAfioTS", "passage_text": "Meaning it will handle better but ride hard (slightly) XLE has everything, heated seats wooden trim, navigation, leather etc.... This is the most comfortable camry of them all. (Extra Limited edition or Luxurious Edition Not sure??) You can get a V6 engine on LE, XLE, SE models. The higher the trim level, the higher your car insurance will be because car insurance are stupid companies who don't like it when you have luxury items in your car. they're being greedy."}]