[{"url": "https://en.wikipedia.org/wiki/Emancipation_Day", "passage_text": "Emancipation Day is celebrated in many former British colonies in the Caribbean and areas of the United States on various dates in observance of the emancipation of slaves of African descent. It is also observed in other areas in regard to the abolition of serfdom or other forms of servitude. Emancipation Day is widely observed in the British West Indies during the first week of August. In many Caribbean countries the Emancipation Day celebration is a part of Carnival, as the Caribbean Carnival takes place at this time."}, {"url": "https://www.tsl.texas.gov/ref/abouttx/juneteenth.html", "passage_text": "Juneteenth, celebrated on June 19, is the name given to emancipation day by African-Americans in Texas. On that day in 1865 Union Major-General Gordon Granger read General Orders, No.3 to the people of Galveston. It stated. "}, {"url": "http://publicholidays.us/emancipation-day/", "passage_text": "TX. Emancipation Day is a public holiday on 16 April each year that, in recent history, has been celebrated only since 2005. If the date falls on a weekend, the holiday is the nearest weekday, either Friday or Monday. Emancipation Day celebrates when President Abraham Lincoln signed the Compensated Emancipaton Act in 1862"}, {"url": "http://www.timeanddate.com/holidays/us/emancipation-day-dc", "passage_text": "Select another year-range: Emancipation Day is a holiday in Washington DC to mark the anniversary of the signing of the Compensated Emancipation Act, which president Abraham Lincoln signed on April 16, 1862. It is annually held on April 16. By 1860, there were about four million slaves in the United States. On April 16, 1862, Abraham Lincoln, who was the US president at the time, signed the Compensated Emancipation Act, which freed more than 3000 slaves in the District of Columbia."}, {"url": "http://www.emancipation-day.com/node/3", "passage_text": "ANNUAL EMANCIPATION DAY. 2015 EVENT LOCATION IS BOB EVANS FARMS, 10854 STATE ROUTE 588, RIO GRANDE, OHIO. Annual Emancipation Day. The Emancipation Proclamation has been celebrated and observed in Gallia County, Ohio continuously since 1863. The Gallia County Emancipation Day Celebration is reported to be one of the longest continuous running celebrations of the Emancipation Proclamation in the United States. Historically, the celebration originally was always celebrated on the 22nd of September."}, {"url": "https://en.wikipedia.org/wiki/Juneteenth", "passage_text": "Juneteenth, also known as Juneteenth Independence Day or Freedom Day, is a holiday that commemorates the announcement of the abolition of slavery in Texas in June 1865, and more generally the emancipation of African-American slaves throughout the Confederate South. Juneteenth is a partial staffing holiday in the state; government offices do not close but some employees use a floating holiday to take the day off. By 2008, nearly half of US states observed the holiday as a ceremonial observance."}, {"url": "http://www.timeanddate.com/holidays/us/emancipation-day-oh", "passage_text": "Emancipation Day has been observed annually since 1863 in Gallia County in south-eastern Ohio, so this celebration is most widely known and usually attracts more than 2000 visitors from Ohio and the rest of the United States. Residents of Ohio commemorate the abolishment of slavery on Emancipation Day, which falls on September 22. Some other states have similar celebrations, but they fall on different dates. The Emancipation Proclamation went into effect on January 1, 1863."}, {"url": "http://www.timeanddate.com/holidays/us/emancipation-day-dc", "passage_text": "Elsewhere in the United States, the emancipation of slaves is celebrated in Florida (May 20), Puerto Rico (March 22) and Texas (June 19). By 1860, there were about four million slaves in the United States. On April 16, 1862, Abraham Lincoln, who was the US president at the time, signed the Compensated Emancipation Act, which freed more than 3000 slaves in the District of Columbia."}]