[{"url": "http://windows.microsoft.com/en-US/windows-8/create-shortcut-to-map-network-drive", "passage_text": "In the Drive list, tap or click a drive letter. You can choose any available letter. In the Folder box, enter the path of the folder or computer, or tap or click Browse to find the folder or computer. To connect every time you sign in to your computer, select the Reconnect at sign-in check box. Tap or click Finish."}, {"url": "http://www.wikihow.com/Drive-a-Car", "passage_text": "Learning how to drive is a lot easier than it looks. It looks intimidating from the passenger's seat, or in the movies, but once you get behind the wheel and gently put your foot on the pedal, the process becomes very intuitive."}, {"url": "https://www.howtodriveonline.com/", "passage_text": "The “how to drive” team truly believes that all accidents are predictable and preventable. Many of us have lost or know someone who has lost a family member or friend in a car related incident."}, {"url": "http://www.wikihow.com/Drive", "passage_text": "Driving is one of the most useful skills in the world. But before you begin to drive, remember that driving is a privilege, not a right, and that you should learn how to be a responsible driver before you put your keys in the ignition."}, {"url": "http://ezinearticles.com/?Learn-How-to-Drive-Online---Learn-to-Drive-Easily&id=1323381", "passage_text": "Learning to drive is not the easiest thing to do, especially if you are a young person. Whether you are young or a little older and trying to get your license, you need to be aware that it is possible to learn how to drive online."}, {"url": "https://support.google.com/drive/answer/2494822?hl=en", "passage_text": "You can also share from any of the Drive, Docs, Sheets, or Slides mobile apps. 1  Open Drive, or a file or folder you want to share. 2  Open the sharing box: 3  While you have a file open: Click Share in the top-right corner. 4  While you have a folder open: Click the share icon in the top-right."}, {"url": "http://www.howcast.com/guides/821-How-to-Drive/", "passage_text": "Learn how to drive with the driving lessons from A Club Driving School in these Howcast videos."}]