[{"url": "http://www.deqebat.com/Dr_Naty.html", "passage_text": "On their part the Kunama carried out counter raids against the Abyssinians. The Kunama raided also the Hedareb people of Eritrea. The Kunama refer to these raids as sakada masa or bada. Through such raids, they were able to bring women from other societies as captives. By having them go through a ritual, (known as kafala dora in Kunama), women were incorporated into the clans of their captor. "}, {"url": "http://www.madote.com/2013/11/the-kunama-people-of-eritrea_9.html", "passage_text": "The Kunama (koo-NAH-mah), who were historically known known as the Baza and Bazen by their neighbors, are a Nilo-Saharan ethnolinguistic group who inhabit the Gash-Seitit region of Eritrea. They make up around 2% of the Eritrean population, and are mostly sedentary farmers. The term Kunama means natural. Among the Kunama if an individual misbehaves, often people would utter that the person is not behaving the Kunama way (i."}, {"url": "http://www.madote.com/2013/11/the-kunama-people-of-eritrea_9.html", "passage_text": "Dahab, who is half Kunama on her father's side and Tigrinya on her mother's side, is the daughter of Faytinga; a celebrated war hero who was among the first Eritreans to fight for the country's independence. Faytinga in Kunama means the fighting gun. The term Kunama means natural. Among the Kunama if an individual misbehaves, often people would utter that the person is not behaving the Kunama way (i."}, {"url": "http://www.madote.com/2011/02/how-to-speak-basic-kunama.html", "passage_text": "The Kunama language is categorized under the Nilo-Saharan family and is spoken by 2% of the Eritrean population. Kunama Dialects and Related Languages. There are appreciable dialect differentiation in Kunama, with Ilit and Sokodas (both sometimes refered to as Western Kunama) being two Nilo-Saharan languages closely related to Kunama."}, {"url": "http://www.mesel-biherat.com/meselbiherat/resources/POLITICAL%20AND%20CULTURAL%20HISTORY%20OF%20THE%20KUNAMA%20PEOPLE.pdf", "passage_text": "The Kunama use the name Kunama to call themselves. The meaning of the name has been misunderstood. For example, the Italian Franciscan priest, Father Giuseppe Fermo (1950) who compiled a Kunama Italian dictionary associates the name to the Oromo word konama, which means my people. The Bitama (from the Kunama word bia tama, which means fresh water have intermarried with the Hedareb so much that they have adopted the language, culture and religion of the latter. In the past the Kunama followed their traditional religion, but now some have adopted Christianity whereas a few converted to Islam."}, {"url": "http://www.madote.com/2013/11/the-kunama-people-of-eritrea_9.html", "passage_text": "The Kunama form their own distinct branch of the Nilo-Saharan language family. Both the Kunama and Nara, who are geographical neighbors, show similar results on correspondences with the ancient Sudanese Meroitic language: Nara a bit higher, Kunama lower. The term Kunama means natural. Among the Kunama if an individual misbehaves, often people would utter that the person is not behaving the Kunama way (i."}, {"url": "http://www.merriam-webster.com/dictionary/Kunama", "passage_text": "Definition of KUNAMA. 1. : a language spoken in northern Ethiopia. 2. : a branch of the Chari-Nile language family containing only the Kunama language. ADVERTISEMENT. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. Note that some information is displayed differently in the Unabridged. To access the complete Unabridged Dictionary, with an additional 300,000 words that aren't in our free dictionary, start a free trial."}, {"url": "http://www.refworld.org/docid/3f520a484.html", "passage_text": "The Kunama ethnic group lives mainly in the border areas between Eritrea and Ethiopia. Estimates of the Kunama population range from 50,000 (CNEWA 2003) to 142,000 (Ethnologue 2002). The number of native speakers of the Kunama language in Eritrea is estimated by Ethnologue to be 140,000 (Ethnologue 2002). A humanitarian update provided the following information on the situation of the Kunama refugees of the Eritrea-Ethiopia border war: The refugees first crossed into Ethiopia soon after the outbreak of the war in May 1998."}, {"url": "http://www.refworld.org/docid/3f520a484.html", "passage_text": "The Kunama are a Nilo-Saharan ethnic community living between the Gash and Setit rivers in Southwestern Eritrea. Said to number about 70,000, they are remnants of the ancient inhabitants of the region. Originally the Kunama were animists and their conversion to Islam and Protestantism is of recent history. A humanitarian update provided the following information on the situation of the Kunama refugees of the Eritrea-Ethiopia border war: The refugees first crossed into Ethiopia soon after the outbreak of the war in May 1998."}]