[{"url": "http://www1.salary.com/College-Vice-President-Salary.html", "passage_text": "For example the median expected annual pay for a typical College Vice President in the United States is $196,513, so 50% of the people who perform the job of College Vice President in the United States are expected to make less than $196,513. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. 3  Benefits. "}, {"url": "http://work.chron.com/salary-vicepresident-5228.html", "passage_text": "According to the Office of Personnel Management, the United States Vice Presidential Salary in 2011 was $230,700 per year. In addition, the Vice President is awarded a $20,000 expense account for costs incurred while maintaining the office of Vice President. As reported by the Bureau of Labor Statistics, the salary for similar positions in the public sector was $165,080 in 2010. The Vice President of the United States is on call 24 hours a day while in office. In addition to normal, day-to-day office work, a Vice President also performs ceremonial duties at home and around the world."}, {"url": "http://abcnews.go.com/blogs/politics/2013/04/vice-president-joe-biden-holds-off-on-donating-salary/", "passage_text": "The vice president is committed to sharing the burden of the sequester with his staff, an aide to the vice president said. Biden earns a salary of $230,700 a year as vice president, but his net worth is much lower than the president and some Cabinet members who have decided to donate a portion of their salary. Vice President Joe Biden is not planning on donating a portion of his salary, eschewing the lead of President Obama and other Cabinet members who are giving up part of their salary as some federal workers face furloughs because of the sequester."}, {"url": "https://en.wikipedia.org/wiki/Vice_President_of_the_United_States", "passage_text": "The Vice President of the United States (VPOTUS) is the second-highest position in the executive branch of the United States, after the president. The executive power of both the vice president and the president is granted under Article Two, Section One of the Constitution. The vice president is indirectly elected, together with the president, to a four-year term of office by the people of the United States through the Electoral College."}, {"url": "http://work.chron.com/salary-executive-vice-president-small-company-24809.html", "passage_text": "Salary By Region. In 2013, average salaries for small company executive vice presidents varied considerably in all U.S. regions, according to Indeed. In the South region, they earned the highest salaries of $124,000 in Washington, D.C., and lowest of $89,000 in Louisiana. They earn salaries averaging above $100,000 annually. The average annual salary for a small company executive vice president was $105,000 as of 2013, according to the job site Indeed."}, {"url": "http://work.chron.com/salary-vicepresident-5228.html", "passage_text": "Salary of the Vice-President. The Vice President of the United States is on call 24 hours a day while in office. In addition to normal, day-to-day office work, a Vice President also performs ceremonial duties at home and around the world. In addition, the Vice President is also president of the Senate"}, {"url": "http://www.salarylist.com/jobs/VicePresident-Salary.htm", "passage_text": "Vice-President Salary. Vice-President average salary is $131,993, median salary is $125,000 with a salary range from $24,000 to $1,800,000. Vice-President salaries are collected from government agencies and companies. Each salary is associated with a real job position. "}, {"url": "http://usgovinfo.about.com/od/thepresidentandcabinet/a/presidentialpay.htm", "passage_text": "Effective January 1, 2001, the annual salary of the President of the United States was increased to $400,000 per year, including a $50,000 expense allowance. Under the Former Presidents Act, each former president is paid a lifetime, taxable pension that is equal to the annual rate of basic pay for the head of an executive federal department -- $201,700 in 2015 -- the same annual salary paid to secretaries of the Cabinet agencies."}]