[{"url": "http://www.livescience.com/20773-sexy-advertising-increasing.html", "passage_text": "Don't blush, but chances are the magazines you read are getting sexier. Sexy advertisements are up in magazines from Playboy to Time and Newsweek to Esquire, according to new research from the University of Georgia. Since 1983, the percent of ads using sex to sell products rose from 15 percent to 27 percent by 2003. Though sexual imagery is used to sell almost everything, even banking services, the bulk of the increase has come in ads for impulse buys: alcohol, entertainment, beauty supplies."}, {"url": "http://theweek.com/articles/453857/how-advertisers-use-sex-sell-products-women", "passage_text": "In 2006, researchers from the University of Florida showed a group of women print ads of beautiful, sexy models from Vogue, Allure, and other women's magazines. They found that the hotter the model's attire or look, the lustier the model's expression, the colder it left the female subjects. Here, three lessons in selling sex to women: Make sure the product is expensive. Recently, Kathleen D. Vohs from University of Minnesota's Carlson School of Management studied whether sexual economics theory, which posits that women want sex to be rare and valuable, might apply to marketing."}, {"url": "http://theweek.com/articles/453857/how-advertisers-use-sex-sell-products-women", "passage_text": "And yet... if women are immune to sexual advertising, why are women's magazines filled with sexy images, and why does Victoria's Secret, which advertises with sex almost exclusively, make $5 billion in revenue each year? The fact that more photographers and advertisers are men is not the answer. Here, three lessons in selling sex to women: Make sure the product is expensive. Recently, Kathleen D. Vohs from University of Minnesota's Carlson School of Management studied whether sexual economics theory, which posits that women want sex to be rare and valuable, might apply to marketing."}, {"url": "http://smallbusiness.chron.com/marketing-men-vs-women-1011.html", "passage_text": "Men can be sold traditional women's products like beauty products and vacuum cleaners if advertisers promote the functionality, engineering and brand-name image, using men who aren't overly burly or overly feminine, Leo Burnett says. Men aren't looking for words like touch or smile in ad copy, but women find this approach thoughtful. To target women, advertisers have to think about how women use the product differently."}, {"url": "http://www.mhlearningsolutions.com/commonplace/index.php?q=node/5957", "passage_text": "These commercials not only use sex to sell their products, but often women are being objectified and taken advantage of in advertisements by being presented as this “fantasy element.”. Commercials for products like Axe body spray are leading examples of brands that claim to provide sex-related benefits. It’s no secret that advertisers use sex to sell their products. This catchy marketing strategy has been popular since the 1900’s and is showing no signs of slowing down."}, {"url": "http://www.marketingdonut.co.uk/marketing/marketing-strategy/your-target-market/the-truth-about-marketing-to-women", "passage_text": "The truth about marketing to women. Men and women are different and businesses need to market to them differently. That’s the controversial view of marketing expert Robert Craven, who believes firms which don’t change their approach to marketing to women will get left behind. But it’s not a view shared by all small-business owners, as we discover. Women are now the key decision-makers. Faith Popcorn, one of America’s consumer trend experts, says: “Companies think they’re marketing to women — who buy 80% of the products and control 80% of the money — but they’re not."}, {"url": "http://theweek.com/articles/453857/how-advertisers-use-sex-sell-products-women", "passage_text": "This also explains Victoria's Secret, another brand that's overtly sexy and uses overtly sexual advertising to prop up that image. So, sex sells to women when it overtly makes sense for the product, and not so much in the case of sex and watches, where it seems like a non-sequitur. Here, three lessons in selling sex to women: Make sure the product is expensive. Recently, Kathleen D. Vohs from University of Minnesota's Carlson School of Management studied whether sexual economics theory, which posits that women want sex to be rare and valuable, might apply to marketing."}, {"url": "http://www.youthkiawaaz.com/2011/06/advertisements-using-women-as-objects-to-sell-products/", "passage_text": "On one hand where these ads/advertisements help in the sale of products on the other hand the same ads are hampering the image of a woman. Most of the advertisements shown on television today make use of women in order to enhance/increase the sale of the products. Women are being portrayed as mere sex objects in most of the ads. They have been shown as a weaker section of the society who can be easily get carried away by men. In ads like that of perfumes and bikes the products are compared with that of a woman’s body. "}, {"url": "https://en.wikipedia.org/wiki/Sex_in_advertising", "passage_text": "Sex in advertising or sex sells is the use of sex appeal in advertising to help sell a particular product or service. Sexually appealing imagery may or may not pertain to the product or service in question. Examples of sexually appealing imagery include nudity, pin-up girls, and muscular men. The use of sex in advertising can be highly overt or extremely subtle."}]