[{"url": "http://www.gli.northwestern.edu/learn-languages/benefits-of-multilingualism/", "passage_text": "DID YOU KNOW THAT…. There are over 7,000 languages spoken in the world today. Speaking more than one language increases your cognitive abilities such as problem-solving, creativity, and memory. One third of all the corporations in the U.S. are either owned or based abroad. Knowing a second language broadens employment opportunities."}, {"url": "http://www.telegraph.co.uk/education/educationopinion/10126883/Why-learn-a-foreign-language-Benefits-of-bilingualism.html", "passage_text": "Comments. Physiological studies have found that speaking two or more languages is a great asset to the cognitive process. The brains of bilingual people operate differently than single language speakers, and these differences offer several mental benefits. Below are seven cognitive advantages to learning a foreign language."}, {"url": "http://www.spring.org.uk/2013/09/10-superb-psychological-advantages-of-learning-another-language.php", "passage_text": "1.Brain growth. The fact that language centres in the brain actually grow is one of the major benefits of learning a second language. The better you learn, the more those vital areas of the brain grow (Martensson mårtensson et., al). 2012"}, {"url": "http://www.huffingtonpost.com/2014/06/02/multilingual-benefits_n_5399980.html", "passage_text": "But to people who identify as bilingual or multilingual, the benefits are usually more concrete and personal. Here are a few firsthand accounts we gathered from multilinguals that help explain the daily benefits of being able to speak multiple languages."}, {"url": "http://www.spring.org.uk/2013/09/10-superb-psychological-advantages-of-learning-another-language.php", "passage_text": "“ To have another language is to possess a second soul.” –Charlemagne. People used to think that learning two languages created confusion in the mind. Far better, it was thought, to get one right than bother with two."}, {"url": "http://www.nytimes.com/2012/03/18/opinion/sunday/the-benefits-of-bilingualism.html", "passage_text": "SPEAKING two languages rather than just one has obvious practical benefits in an increasingly globalized world. But in recent years, scientists have begun to show that the advantages of bilingualism are even more fundamental than being able to converse with a wider range of people."}, {"url": "http://www.asha.org/public/speech/development/The-Advantages-of-Being-Bilingual/", "passage_text": "It is easier to learn sounds and words when the languages you are learning are similar. Over time, the more difficult sounds and words will be learned. Fact: Communication disorders affect more than 42 million Americans. Of these, 28 million have a hearing loss and 14 million have a speech or language disorder."}]