[{"url": "https://quizlet.com/6321424/suffixes-for-medical-terminology-flash-cards/", "passage_text": "Does this suffix mean pertaining to or related to; suffix indicating condition or process; indicating form, size, and formation; describing diagnostic procedures; describing therapeutic procedures; commonly used general suffixes? example: Sarcoma meaning: Tumor or neoplasm indicating a condition or process."}, {"url": "https://quizlet.com/6321424/suffixes-for-medical-terminology-flash-cards/", "passage_text": "suffixes used in the names of specialties and practitioners suffixes meaning 'related to or 'pertaining to suffixes indicating condition or process suffixes indicating form, size, and formation suffixes describing diagnostic procedures suffixes indicating therapeutic procedures commonly used general suffixes."}, {"url": "https://quizlet.com/6321424/suffixes-for-medical-terminology-flash-cards/", "passage_text": "Does this suffix mean pertaining to or related to; suffix indicating condition or process; indicating form, size, and formation; describing diagnostic procedures; describing therapeutic procedures; commonly used general suffixes? example: Phlebitis meaning: Inflammation indicating a condition or process."}, {"url": "http://www.answers.com/Q/What_is_a_suffix_which_means_process_or_result_of", "passage_text": "What is the meaning of the suffix-ion? The suffix-ion means condition of, result of, act of, process of, state of, and in medical terms it can mean a craniometric point or body point."}, {"url": "https://quizlet.com/6321424/suffixes-for-medical-terminology-flash-cards/", "passage_text": "Does this suffix mean pertaining to or related to; suffix indicating condition or process; indicating form, size, and formation; describing diagnostic procedures; describing therapeutic procedures; commonly used general suffixes? Meaning: Record or instrument used for making a record."}, {"url": "https://www.learnthat.org/pages/view/suffix.html", "passage_text": "List of English Suffixes. Our suffix word lists are the second part of our comprehensive root word tables : Suffixes are word endings that add a certain meaning to the word. Click on the icon to the left and add the suffix list to your LearnThatWord profile for personalized review. If you don't have an account yet, you can start one in a few seconds."}, {"url": "http://www.dummies.com/how-to/content/how-to-use-suffixes-to-find-the-meaning-of-medica0.html", "passage_text": "Another suffix related to procedures is-graphy, meaning the process of recording a picture or a record. Radiography is the process of recording a picture by radiograph or an x-ray. Suffixes-gram and-graph are used to describe the finished product, the recording or picture."}]