[{"url": "http://catalog.uic.edu/ucat/admissions-registration-finances/admissions/", "passage_text": "The most successful applicants will have at least a minimum ACT score of 28 or an SAT-I score of 1240 and a high school rank in the top 15% if the high school ranks. To be considered for GPPA, students must complete the UIC GPPA section when completing the UIC Supplement on the Common Application website."}, {"url": "http://colleges.startclass.com/l/1192/University-of-Illinois-at-Chicago", "passage_text": "Average ACT Score: 23. At UIC, 99% of students submitted their ACT scores for college application and the average admitted student's ACT score was around 23, which is slightly higher than the average score at other top tier public institutions."}, {"url": "https://admissions.uic.edu/undergraduate/faq", "passage_text": "There are none. Quantitative factors like GPA and test scores are key pieces of the undergraduate review, but the rest of your application is as important. Other pieces like your counselor and teacher recommendations, essays, activities, and volunteer experience are all considered as well."}, {"url": "http://collegeapps.about.com/od/GPA-SAT-ACT-Graphs/ss/university-of-illinois-chicago-admission-gpa-sat-act.htm", "passage_text": "Calculate Your Chances of Getting In with this free tool from Cappex. Discussion of UIC's Admissions Standards: UIC, the University of Illinois at Chicago has selective admissions -- roughly one out of every three applicants will not get in. Admitted students tend to have solid grades and standardized test scores."}, {"url": "http://www.collegesimply.com/colleges/illinois/university-of-illinois-at-chicago/admission/", "passage_text": "9,193 out of 14,380 applicants or 64% percent were admitted making UIC moderately easy school to get into with a good chance of acceptance assuming you meet the requirements. University of Illinois at Chicago typically accepts and attracts B average high school students."}, {"url": "https://admissions.uic.edu/undergraduate/faq", "passage_text": "Your high school GPA and ACT/SAT scores are only the beginning of your application. UIC evaluates your strength of schedule, grade trends, counselor and teacher recommendations, and essays at every step of the review process."}, {"url": "http://www.acceptancerate.com/schools/university-of-illinois-at-chicago", "passage_text": "The majority of students admitted to UIC had an SAT score between 1000 to 1240, or got accepted with an ACT score in the range of 21 to 26. By applying sampled GPA data from over 150 schools, we are able to estimate that the UIC average GPA ranges from 3.13 to 3.38 for accepted students."}, {"url": "http://gppa.uic.edu/prospective-students/frequently-asked-questions/", "passage_text": "GPPA Medicine students are required to score the average of the previous year’s class. You will be required to retake the test if your MCAT scores are below the college average. The test may be retaken up to three times until a minimum score is achieved. Guidance on test preparation is offered to all students."}, {"url": "https://admissions.uic.edu/undergraduate/faq", "passage_text": "First Year applicants need high school transcripts and ACT/SAT scores for review. See the First Year requirements. 1  International applicants: English proficiency test scores are also required. 2  TOEFL, IELTS, and PTE are accepted."}, {"url": "http://collegeapps.about.com/od/collegeprofiles/p/Illinois-Chicago.htm", "passage_text": "The University of Illinois at Chicago (UIC) is a public university located on three urban campuses in Chicago. UIC ranks well among the nation's research universities."}]