[{"url": "https://en.wikipedia.org/wiki/Mineral", "passage_text": "A mineral is a naturally occurring substance, representable by a chemical formula, that is usually solid and inorganic, and has a crystal structure. It is different from a rock, which can be an aggregate of minerals or non-minerals and does not have a specific chemical composition. Common distinguishing characteristics include crystal structure and habit, hardness, lustre, diaphaneity, colour, streak, tenacity, cleavage, fracture, parting, and specific gravity. More specific tests for minerals include magnetism, taste or smell, radioactivity and reaction to acid."}, {"url": "http://www.livestrong.com/article/305257-definition-of-minerals-in-food/", "passage_text": "Minerals are divided into two categories -- major minerals and trace minerals -- based on the amounts you need to stay healthy. Major minerals, also referred to as macrominerals, are named for the fact that you need more of them in your diet. Americans typically do not get enough of the minerals calcium, potassium and magnesium. It is best to get more of these minerals through whole foods so that your body is able to absorb them properly; however, in times of excess growth, such as during pregnancy, your doctor may recommend a supplement."}, {"url": "http://www.thefreedictionary.com/minerals", "passage_text": "3. A substance that is neither animal nor vegetable; inorganic matter. 4. An inorganic element, such as calcium, iron, potassium, sodium, or zinc, that is essential to the nutrition of humans, animals, and plants. 5. "}, {"url": "http://www.livestrong.com/article/305257-definition-of-minerals-in-food/", "passage_text": "Minerals are inorganic, which means they are not formed by living things, including your body. Instead, the minerals in plants come from the soil in which they are grown. Animal foods get their minerals from eating plants grown in mineral-rich sources. Americans typically do not get enough of the minerals calcium, potassium and magnesium. It is best to get more of these minerals through whole foods so that your body is able to absorb them properly; however, in times of excess growth, such as during pregnancy, your doctor may recommend a supplement."}, {"url": "http://www.health-alternatives.com/minerals-nutrition-chart.html", "passage_text": "Minerals are elements that originate in the soil and cannot be created by living things, such as plants and animals. Yet plants, animals and humans need minerals in order to be healthy. Plants absorb minerals from the soil, and animals get their minerals from the plants or other animals they eat. Most of the minerals in the human diet come directly from plants, such as fruits and vegetables, or indirectly from animal sources."}, {"url": "http://www.merriam-webster.com/dictionary/food", "passage_text": "Definition of FOOD for Kids. 1. : the material that people and animals eat: material containing carbohydrates, fats, proteins, and supplements (as minerals and vitamins) that is taken in by and used in the living body for growth and repair and as a source of energy for activities. 2. Medical Definition of FOOD. 1. : material consisting essentially of protein, carbohydrate, and fat used in the body of an organism to sustain growth, repair, and vital processes and to furnish energy; also: such material together with supplementary substances (as minerals, vitamins, and condiments)."}, {"url": "http://www.natural-healthy-eating.com/food-minerals.html", "passage_text": "Food minerals are those minerals that begin in the soil or sea and are tiny enough for microorganisms to eat as food. In the soil, plant roots take in the microorganisms as food. This is where our nutrient dense food comes from. "}, {"url": "http://www.healthofchildren.com/M/Minerals.html", "passage_text": "Definition. Minerals are inorganic nutrients. That is, they are materials found in foods that are essential for growth and health and do not contain the element carbon. The minerals that are relevant to human nutrition are water, sodium, potassium, chloride, calcium, phosphate, sulfate, magnesium, iron, copper, zinc, manganese, iodine, selenium, and molybdenum"}, {"url": "http://medical-dictionary.thefreedictionary.com/Minerals", "passage_text": "Definition. The minerals (inorganic nutrients) that are relevant to human nutrition include water, sodium, potassium, chloride, calcium, phosphate, sulfate, magnesium, iron, copper, zinc, manganese, iodine, selenium, and molybdenum. Cobalt is a required mineral for human health, but it is supplied by vitamin B 12. Here, minerals are administered when tests for possible mineral deficiency are not given. Examples include the practice of giving young infants iron supplements, and of the food industry's practice of supplementing infant formulas with iron."}]