[{"url": "http://pubs.rsna.org/doi/full/10.1148/radiographics.22.1.g02ja2219", "passage_text": "Architectural distortion due to prior biopsy. Left mediolateral oblique (a) and craniocaudal (b) mammograms show a focal architectural distortion (arrow) at the site of a prior biopsy (metallic marker). The distortion is more prominent on the craniocaudal view than on the mediolateral oblique view. (a, b) Bilateral craniocaudal (a) and right craniocaudal spot compression (b) mammograms demonstrate a focal area of architectural distortion with spiculation in the medial aspect of the right breast (arrow)."}, {"url": "http://breast-cancer.ca/abnorm-mams/", "passage_text": "An architectural distortions on a mammogram is basically a disruption of the normal ‘ random ‘ pattern of curvilinear and fine linear radiopaque structures normally seen on a breast X-ray. There is no visible mass, but the distortion often appears as a ‘ stellate ‘ shape or with radiating speculations. The number of those women in which the architectural distortion would actually represent invasive breast cancer is very low, perhaps 5%-7% of the 4% with architectural distortion, which becomes a very small number."}, {"url": "http://radiopaedia.org/articles/architectural-distortion-in-mammography", "passage_text": "Architectural distortion per se is not a mass. It is often due to a desmoplastic reaction in which there is focal disruption of the normal breast tissue pattern. There are several features that can be considered as part of architectural distortion 3 1  : contour abnormality. 2  trabecular thickening. 3  trabecular disorganisation. "}, {"url": "http://breast-cancer.ca/abnorm-mams/", "passage_text": "Patients who had architectural distortion on mammography were more likely to have positive margins than patients with masses or calcifications. This may be because architectural distortion on mammography is most commonly due to benign conditions, causing the surgeon to excise with minimal margins. The number of those women in which the architectural distortion would actually represent invasive breast cancer is very low, perhaps 5%-7% of the 4% with architectural distortion, which becomes a very small number."}, {"url": "http://www.netwellness.org/question.cfm/4606.htm", "passage_text": "Mammograms look at the breast and take pictures of the soft tisse. Architectural distortion is a term the radiologist used to describe the breast tissue in the right breast behind the areola that may have an abnormal area of density. I just turned 38 and had my first screening mammogram last week. The results were architectural distortion of the right breast, retroareola, indeterminate and I have been asked to go back for additional views. I am concerned as to what this means. I have been breastfeeding for the last two years and still am once to twice a da"}, {"url": "http://breast-cancer.ca/abnorm-mams/", "passage_text": "Typical mammographic findings from breast cancer screening mammograms would include asymmetrical breast tissue, asymmetric density, architectural distortion, mass, microcalcifications, interval changes compared with previous films, adenopathy, and other miscellaneous findings. What the hell, Doc. The number of those women in which the architectural distortion would actually represent invasive breast cancer is very low, perhaps 5%-7% of the 4% with architectural distortion, which becomes a very small number."}, {"url": "https://answers.yahoo.com/question/index?qid=20100308115602AAmywZa", "passage_text": "I had a reduction in 2004. Here's what the mammogram report actually says: Focal possible architectural distortion in the central posterior left CC view, not clearly seen on the MLO view. Recommend coned CC view, true lateral view and possible ultrasound of the left breast.. "}, {"url": "http://forums.webmd.com/3/breast-cancer-exchange/forum/203", "passage_text": "I had a diagnostic mammogram done a couple of days ago (for a new lump). The mammogram showed increased breast density over last year's mammogram and some architectural distortion. I then had an ultrasound which showed the same thing, along with a lot of new cysts. Report This | Share this:architectural distortion-scaredHi I was diagnosed seven years with breast cancer. I had a mastectomy and did chemo and herceptin. Last week I went in to have my mammogram and they found new areas of cysts, architectural distortion, and microcalcifications. So I had to have to an ultrasound."}]