[{"url": "http://www.medicalnewstoday.com/articles/262881.php", "passage_text": "Knowledge center. Collagen is the most abundant protein in the human body and is the substance that holds the whole body together. It is found in the bones, muscles, skin and tendons, where it forms a scaffold to provide strength and structure.1,2. 1 Collagen is most commonly found within the body in the skin, bones and connective tissues. 2  The word collagen is derived from the Greek kolla, meaning glue. 3  Collagen gives the skin its strength and structure, and also plays a role in the replacement of dead skin cells."}, {"url": "http://www.ehow.com/facts_6370701_collagen-protein-its-nutritional-value_.html", "passage_text": "Protein Quality. Collagen is not a complete protein because it is lacking in the amino acid tryptophan. A Protein Digestibility Corrected Amino Acid Score (PDCAA) of a complete protein is 1.0. Collagen is a protein found in the muscle and connective tissue of animals. Hydrolyzed collagen protein supplements are typically made from the bones and skin of cows, horses or pigs."}, {"url": "http://www.vitalproteins.com/what-is-collagen", "passage_text": "An essential amino acid is one your body cannot make, so you have to get it from food or dietary supplements. Collagen is the most abundant protein in the body and is a key constituent of all connective tissues. Collagen provides the infrastructure of the musculoskeletal system, essential for mobility. The intake of collagen ensures the cohesion, elasticity and regeneration of skin, hair, tendon, cartilage, bones and joints. Collagen is a protein made up of amino-acids: glycine, proline, hydroxyproline, and arginine. The composition of collagen is considered unique given its high hydroxyproline content. If you lack the amino acids that combine to form collagen, your body's cells can't produce enough of it"}, {"url": "https://en.wikipedia.org/wiki/Collagen", "passage_text": "The collagen protein is composed of a triple helix, which generally consists of two identical chains (α1) and an additional chain that differs slightly in its chemical composition (α2). The amino acid composition of collagen is atypical for proteins, particularly with respect to its high hydroxyproline content. Collagen, in the form of elongated fibrils, is mostly found in fibrous tissues such as tendons, ligaments and skin. It is also abundant in corneas, cartilage, bones, blood vessels, the gut, intervertebral discs and the dentin in teeth."}, {"url": "https://www.mrsupplement.com.au/hydrolysed-collagen", "passage_text": "1 Hydroylsed collagen is an amino acid supplement made from collagen, a compound that is naturally found in muscle and connective tissue. 2  It is a rich source of the amino acids glycine and proline. 3  Supplementing with hydrolysed collagen has been shown to be helpful for lean muscle growth, joint pain and skin health. As a source of protein, hydrolysed collagen should be stacked with other, more complete, sources of protein, such as whey or soy. When used for joint health, it can be stacked with glucosamine, chondroitin, and other joint support supplements."}, {"url": "http://healthyeating.sfgate.com/collagen-protein-9668.html", "passage_text": "Collagen is made from dietary proteins. As a structural protein, collagen builds connective tissues found throughout your body. While it's essential for tendons and ligaments, collagen does much more than that: It supports soft tissues such as organs, gives resilience to bones and keeps your skin firm."}, {"url": "http://www.thedoctorwithin.com/collagen/collagen/", "passage_text": "As the largest protein in the body, collagen is a chain of over 1500 amino acids. Collagen is the connective tissue for almost all our structures, including. heart …………… lungs ………. arteries ……… discs ……….0 blood cells. skin ……………. muscles ……. bones ……….. In fact, collagen is the largest and most abundant protein in the body, making up about 65% of our total protein. Proteins are made of amino acids, such as glycine, proline, arginine, hydroxyproline, which are amino acids that exist in collagen in varying proportions, depending upon the source."}, {"url": "https://en.wikipedia.org/wiki/Collagen", "passage_text": "Collagen /ˈkɒlədʒɨn/ is the main structural protein in the extracellular space in the various connective tissues in animals. As the main component of connective tissue, it is the most abundant protein in mammals, making up from 25% to 35% of the whole-body protein content. Collagen, in the form of elongated fibrils, is mostly found in fibrous tissues such as tendons, ligaments and skin. It is also abundant in corneas, cartilage, bones, blood vessels, the gut, intervertebral discs and the dentin in teeth."}, {"url": "http://www.obesityhelp.com/forums/rny/4372247/Whey-Protein-Vs-Collagen-Protein/", "passage_text": "Collagen protein is not complete in that it doesn't have all the amino acids necessary, so it is basically worthless for us. I know someone else will come along with a much more technical description, but they aren't worth the money. ~Lady Lithia~ 200 lbs lost! "}]