[{"url": "http://www.convertunits.com/from/cubic+meter/to/cubic+kilometre", "passage_text": "The answer is 1000000000. We assume you are converting between cubic metre and cubic kilometre. You can view more details on each measurement unit: cubic meter or cubic kilometre. The SI derived unit for volume is the cubic meter. 1 cubic meter is equal to 1.0E-9 cubic kilometre. Note that rounding errors may occur, so always check the results. Use this page to learn how to convert between cubic meters and cubic kilometers."}, {"url": "http://www.convertunits.com/from/cubic+kilometre/to/cubic+meters", "passage_text": "The answer is 1.0E-9. We assume you are converting between cubic kilometre and cubic metre. You can view more details on each measurement unit: cubic kilometre or cubic meters. The SI derived unit for volume is the cubic meter. 1 cubic kilometre is equal to 1000000000 cubic meter. Note that rounding errors may occur, so always check the results. Use this page to learn how to convert between cubic kilometers and cubic meters."}, {"url": "http://www.metric-conversions.org/volume/cubic-feet-to-cubic-meters.htm", "passage_text": "A cubic measurement is the three-dimensional derivative of a linear measure, so a cubic foot is defined as the volume of a cube with sides 1 ft in length. In metric terms a cubic foot is a cube with sides 0.3048 metres in length. One cubic foot is the equivalent to approximately 0.02831685 cubic metres, or 28.3169 litres. A metric unit of volume, commonly used in expressing concentrations of a chemical in a volume of air. One cubic meter equals 35.3 cubic feet or 1.3 cubic yards."}, {"url": "http://www.metric-conversions.org/volume/cubic-feet-to-cubic-meters.htm", "passage_text": "Cubic Meters. A metric unit of volume, commonly used in expressing concentrations of a chemical in a volume of air. One cubic meter equals 35.3 cubic feet or 1.3 cubic yards. One cubic meter also equals 1000 liters or one million cubic centim"}, {"url": "http://www.unitconversion.org/volume/cubic-kilometers-to-cubic-meters-conversion.html", "passage_text": "Bookmark cubic kilometer to cubic meter Conversion Calculator-you will probably need it in the future. Download Capacity and Volume Unit Converter. our powerful software utility that helps you make easy conversion between more than 2,100 various units of measure in more than 70 categories. "}, {"url": "http://www.ditutor.com/metric_system/cubic_kilometer.html", "passage_text": "Cubic Kilometer. The cubic kilometer is a metric unit of volume equal to 1,000,000,000 cubic meters. The symbol of the cubic kilometer is km³ . 1 km3 = 1,000,000,000 m3 = 109 m3. To convert cubic kilometers to hm³, dam³, m³, dm³, cm³ and mm³ , multiply by one followed by as many trios of zeros as there are places between the cubic kilometer and the other unit. 1 km 3 = 1,000 hm 3 = 10 3 hm 3. 1 km 3 = 1,000,000 dam 3 = 10 6 dam 3. 1 km 3 = 1,000,000,000 m 3 = 10 9 m 3"}, {"url": "http://www.ditutor.com/metric_system/cubic_kilometer.html", "passage_text": "The cubic kilometer is a metric unit of volume equal to 1,000,000,000 cubic meters. The symbol of the cubic kilometer is km³ . 1 km3 = 1,000,000,000 m3 = 109 m3. To convert cubic kilometers to hm³, dam³, m³, dm³, cm³ and mm³ , multiply by one followed by as many trios of zeros as there are places between the cubic kilometer and the other unit."}, {"url": "http://www.unitconversion.org/volume/cubic-meters-to-cubic-kilometers-conversion.html", "passage_text": "cubic kilometer [km3]: How to use cubic meter to cubic kilometer Conversion Calculator. Type the value in the box next to  cubic meter [m3] . The result will appear in the box next to  cubic kilometer [km3] . Bookmark cubic meter to cubic kilometer Conversion Calculator-you will probably need it in the future. Download Capacity and Volume Unit Converter."}, {"url": "http://www.metric-conversions.org/volume/cubic-meters-conversion.htm", "passage_text": "Cubic Meters. A metric unit of volume, commonly used in expressing concentrations of a chemical in a volume of air. One cubic meter equals 35.3 cubic feet or 1.3 cubic yards. One cubic meter also equals 1000 liters or one million cubic centim"}]