[{"url": "http://www.gardenguides.com/93900-list-trees-amazon-rainforest.html", "passage_text": "Submit. The largest tropical rain forest in the world, the Amazon rain forest spans across eight countries and is also the world's largest river basin. Also known as Amazonia, the tropical jungle is home to many exotic flora and fauna. Acioa edulis. Native to the Amazon region of Brazil, Acioa edulis, or Castanha-de-cutia, is a timber tree that produces deep green foliage and vibrant pink blossoms. The blossoms become the fruit of the Acioa edulis, which resemble a type of date fruit. The fruit has many uses from culinary to aromatherapy"}, {"url": "http://www.livescience.com/40508-few-tree-species-dominate-amazon-rainforest.html", "passage_text": "Until now, researchers' knowledge of the types of trees in the Amazon and where they were located was based on analyses of regions — the rain forest's vast expanse made it challenging to survey in its entirety. For instance, scientists didn't even know the most common tree species in the Amazon. 'Hyperdominant' trees. Of these 16,000 tree species, scientists unexpectedly discovered that only 227 species, or 1.4 percent of all the types of trees in Amazonia, made up half of the nearly 400 billion total trees estimated to live there."}, {"url": "http://www.ecorazzi.com/2012/02/08/ten-amazing-rainforest-plants/", "passage_text": "4. Brazil Nut Tree. Towering above all the other trees in the Amazon Rainforest, the Brazil nut tree can reach over 160 feet. Known for its production of the Brazil nut, these delectable delights are produced inside fruit the size of a baseball and can weigh up to five pounds. "}, {"url": "https://en.wikipedia.org/wiki/List_of_plants_of_the_Amazon_rainforest", "passage_text": "List of plants of the Amazon rainforest. From Wikipedia, the free encyclopedia. This is a list of plants found in the wild in Amazon Rainforest vegetation of Brazil. The estimates from useful plants suggested that there are 800 plant species of economic or social value in this forest, according to Giacometti (1990). Additions are currently being made to this list"}, {"url": "https://rainforestrescue.sky.com/amazon-rainforest/precious-plants", "passage_text": "Plants in the Amazon. The Amazon rainforest has nearly 40,000 plant species, ranging from tiny mosses to huge trees. Many of the Amazon’s trees are economically important, including: 1  Luxury woods such as mahogany. 2  Brazil nut trees, which produce edible nuts, and oils used in cooking and beauty products. 3  Kapok trees, which produce a cotton-like fibre often used as a stuffing for cushions."}, {"url": "http://www.livescience.com/40508-few-tree-species-dominate-amazon-rainforest.html", "passage_text": "View full size image. The Amazon is the largest and most diverse rain forest in the world — about 10 percent of all known species on Earth dwell there — but only a few dozen of the Amazon's thousands of tree species rule the jungle, researchers recently found. 'Hyperdominant' trees. Of these 16,000 tree species, scientists unexpectedly discovered that only 227 species, or 1.4 percent of all the types of trees in Amazonia, made up half of the nearly 400 billion total trees estimated to live there."}, {"url": "http://www.blueplanetbiomes.org/rainforest.htm", "passage_text": "A tropical rain forest has more kinds of trees than any other area in the world. Scientists have counted about 100 to 300 species in one 2 1/2-acre (1-hectare) area in South America. Seventy percent of the plants in the rainforest are trees. About 1/4 of all the medicines we use come from rainforest plants. Many kinds of trees that grow in the mountains of the Amazon rain forest do not grow in the lowlands of that same forest. Layers of the Rainforest There are four very distinct layers of trees in a tropical rain forest. These layers have been identified as the emergent, upper canopy, understory, and forest floor."}]