[{"url": "http://lpi.oregonstate.edu/mic/dietary-factors/phytochemicals/soy-isoflavones", "passage_text": "1 Soybeans and soy products are the richest sources of isoflavones in the human diet. ( 2 More information). 3  The results of randomized controlled trials suggest that substituting 50 g/day of soy protein for animal protein results in only a modest 3% reduction of LDL cholesterol."}, {"url": "http://www.veganhealth.org/articles/soy_wth", "passage_text": "A rough guide is that one serving of soy equals 1 cup of soymilk, or 1/2 cup of tofu, tempeh, soybeans, or soy meats. This is the rough equivalent of about 8 to 10 grams of soy protein and 25 mg of isoflavones. The more processed soy meats tend to have more protein (but fewer isoflavones per gram of protein)."}, {"url": "http://www.livestrong.com/article/379043-does-soy-milk-contain-isoflavones/", "passage_text": "The isoflavones in the plant bind to the sugar molecules in the soybeans and are released in the body during digestion. The isoflavones in soybeans and soy milk include genistein and daidzein, which differ only slightly in their chemical structure."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-975-SOY.aspx?activeIngredientId=975&activeIngredientName=SOY", "passage_text": "In foods, soy is used as a milk substitute in infant feeding formulas, and as an alternative to cow's milk. Soybeans are eaten boiled or roasted. Soy flour is used as an ingredient in foods, beverages, and condiments."}, {"url": "http://www.breastcancer.org/tips/nutrition/reduce_risk/foods/soy", "passage_text": "Phenolic acid and phytates are antioxidants. Then there are the isoflavones, which are weak phytoestrogens (estrogen-like compounds found in plants). Isoflavone levels vary in different types of tofu and soy milk products. Your body's estrogen is much, much stronger than the estrogen-like isoflavones in soy. So if the weak soy substance replaces the natural high-strength estrogen in cells, then maybe the soy will protect against cancers that would prefer a stronger estrogen signal."}, {"url": "http://www.livestrong.com/article/379043-does-soy-milk-contain-isoflavones/", "passage_text": "Soy milk is a fluid produced by soaking, grinding and boiling soybeans. Soybeans, a member of the legume family of vegetables, serve as a valuable source of dietary protein and fiber, and also contain essential vitamins, minerals, fats and carbohydrates. Soybeans and the soy milk produced from them contain important plant substances known as isoflavones."}, {"url": "http://www.isoflavones.info/isoflavones-content.php", "passage_text": "Below are isoflavones contents (total isoflavones, daidzein and genistein) of some foods. These isoflavones values have been taken from USDA database."}]