[{"url": "https://support.microsoft.com/en-us/kb/864913", "passage_text": "1 For example, if the profit-and-loss account has an incorrect debit beginning balance of $100.00, create a transaction that credits the profit-and-loss account for $100.00, and then debit the retained earnings account for $100.00. 2  Click Post. ( 3 The General Posting Journal should show the entry listed twice."}, {"url": "http://community.dynamics.com/gp/f/32/t/150342", "passage_text": "The 2014 balance in this account should be $0. We have gone into the account’s profile and updated it to be an Income Statement Account. I am wondering how I can have my BBF entries refreshed, to clear out this account balance and reclassify it to retained earnings? The 2013 year is still open in GP."}, {"url": "http://community.dynamics.com/gp/f/32/t/36082", "passage_text": "An oddity in our BBF (balance brought forward) journal entries was brought to my attention today. In each BBF entry since we've been on GP, there are a few accounts that have multiple lines in the journal entry. For example, the BBF entry might look like this: Account 1 $x.xx. Account 2 $x.xx."}, {"url": "https://support.microsoft.com/en-us/kb/864913", "passage_text": "1 On the Transactions menu, point to Financial, and then click General. 2  In the Transaction Entry window, enter a transaction that reverses the incorrect beginning balance of the profit-and-loss account. 3  In the Transaction Date field, enter a date that is in the closed fiscal year such as 12/31/201x."}, {"url": "https://support.microsoft.com/en-us/kb/864913", "passage_text": "Method 1: The account is supposed to be a profit-and-loss account. 1  On the Cards menu, point to Financial, and then click Account. 2  In the Account Maintenance window, type the account number in the Account field. 3  Make sure that the Posting Type area is set to Balance Sheet, and then click Save."}, {"url": "https://support.microsoft.com/en-us/kb/864913", "passage_text": "1 Enter a journal entry to create a beginning balance for the account. 2  To do this, follow these steps: 3  On the Transactions menu, point to Financial, and then click General. 4  In the Transaction Entry window, enter a transaction that creates the correct beginning balance of the balance sheet account."}, {"url": "http://community.dynamics.com/gp/f/32/t/36082", "passage_text": "Bud, the reason for this typically is that entries are made to the closed year after it is closed. When that happens, GP will not change the existing BBF, but will instead create an additional entry for the new amount that needs to be brought forward. Thus the multiple BBF entries for the same account. Hope that helps."}]