[{"url": "http://www.healthpages.org/anatomy-function/brain-anatomy/", "passage_text": "The cerebellum, “little brain”, is the second largest region of the brain. It is located behind and below the cerebrum and at the back of the brain stem and attached to the midbrain. It has two hemispheres and an outer cortex of gray matter and an inner core of white matter. The cerebral cortex is the outer layer of the brain, called gray matter. It is where our conscious thoughts and actions take place. Many of the signals our brain receives from our senses are registered in the cerebral cortex."}, {"url": "http://www.innerbody.com/image/nerv02.html", "passage_text": "The cerebellum is a wrinkled, hemispherical region of the brain located posterior to the brainstem and inferior to the cerebrum. The outer layer of the cerebellum, known as the cerebellar cortex, is made of tightly folded gray matter that provides the processing power of the cerebellum. "}, {"url": "http://www.wou.edu/~lemastm/Teaching/BI335/Laboratory%2001%20-%20Brain%20Anatomy.pdf", "passage_text": "Deep within the cerebral white matter is a third basic region of the cerebrum, a group of sub-cortical gray matter called basal nuclei. These nuclei, the caudate nucleus, putamen, and globus pallidus, are important regulators of skeletal muscle movement. The outer cortex of the cerebrum is composed of gray matter – billions of neuron cell bodies and unmyelinated axons arranged in six discrete layers. Although only 2 – 4 mm thick, this region accounts for ~ 40% of total brain mass. The inner region is composed of white matter – tracts of myelinated axons."}, {"url": "http://www.innerbody.com/image_nerv02/nerv41-new.html", "passage_text": "The surface of the cerebrum, with its many convoluted gyri and sulci, is extremely important to the function of the brain. It is in this region, known as the cerebral cortex, where most of the processing of the cerebrum takes place. The cerebral cortex is made of gray matter with billions of neurons forming trillions of synapses that produce many of the brain’s functions, including planning, creativity, and memory. "}, {"url": "http://science.nationalgeographic.com/science/health-and-human-body/human-body/brain-article/", "passage_text": "These are the brain's white matter.. The cerebrum is the largest part of the brain, accounting for 85 percent of the organ's weight. The distinctive, deeply wrinkled outer surface is the cerebral cortex, which consists of gray matter. Beneath this lies the white matter"}, {"url": "http://www.healthpages.org/anatomy-function/brain-anatomy/", "passage_text": "The surface of the cerebrum is made up of gyri and sulci. A cortex is the outer layer of any organ. The cerebral cortex is the outer layer of the brain, called gray matter. It is where our conscious thoughts and actions take place. Many of the signals our brain receives from our senses are registered in the cerebral cortex."}, {"url": "http://study.com/academy/lesson/what-is-the-cerebrum-definition-functions-location.html", "passage_text": "The outermost region is referred to as the cerebral cortex or gray matter, and the innermost portion is called cerebral white matter. The difference between gray matter and white matter is what specific part/region of the neuron is present. The gray matter is gray in color and has cell bodies. The cerebral cortex or gray matter is the most important region when it comes to carrying out the tasks of each lobe. As a result, the ridges seen on the surface of the cerebrum help to increase the physical space needed to accomplish all these tasks."}, {"url": "https://en.wikipedia.org/wiki/Telencephalon", "passage_text": "The cerebrum is a large part of the brain containing the cerebral cortex (of the two cerebral hemispheres), as well as several subcortical structures, including the hippocampus, basal ganglia, and olfactory bulb. In humans, the cerebrum is the superior-most region of the central nervous system. The cerebrum is the newest structure in the phylogenetic sense, and in mammals it is the largest and most developed, out of all known species. The cerebrum is made up of the two cerebral hemispheres and their cortices, (the outer layers of gray matter), and the underlying regions of white matter."}, {"url": "https://en.wikipedia.org/wiki/Telencephalon", "passage_text": "Cerebral cortex [edit]. Surface of the cerebrum. The cerebral cortex, the outer layer of gray matter of the cerebrum, is found only in mammals. In larger mammals, including humans, the surface of the cerebral cortex folds to create gyri (ridges) and sulci (furrows) which increase the surface area. The cerebrum is the newest structure in the phylogenetic sense, and in mammals it is the largest and most developed, out of all known species. The cerebrum is made up of the two cerebral hemispheres and their cortices, (the outer layers of gray matter), and the underlying regions of white matter."}]