[{"url": "http://www.answers.com/Q/What_is_the_largest_species_of_wolf_in_the_world", "passage_text": "Both are a subspecies of the Grey Wolf. The average weight of both are 50-65/70kg, or 11 … 0-155lbs. the largest wolf on record is an Alaskan Wolf at 175lbs, or 80kg, 1944, in Bulgaria. Even so, the largest wolves that can be found are the grey wolves found in Northern Alberta, Canada."}, {"url": "http://www.answers.com/Q/What_is_the_largest_wolf_species", "passage_text": "Confidence votes 48. the Arctic Wolf and the Mackenzie Valley Wolf, also known as the Canadian Timber Wolf. Both are a subspecies of the Grey Wolf. The average weight of both are 50-65/70kg, or 110-155lbs. the largest wolf on record is an Alaskan Wolf at 175lbs, or 80kg, 1944, in Bulgaria. Even so, the largest wolves that can be found are the grey wolves found in Northern Alberta, Canada."}, {"url": "http://animals.mom.me/largest-wolves-world-2328.html", "passage_text": "NA/AbleStock.com/Getty Images. When people think of wolves, one species usually comes to mind: the gray wolf. The gray wolf is the largest wolf and the basis of legends. According to National Geographic, the breed was almost hunted to extinction in the lower 48 states of the United States. Even now, few exist outside Alaska."}, {"url": "http://www.answers.com/Q/What_is_the_largest_species_of_wolf_in_the_world", "passage_text": "There is only one species of wolf in the world, Canis lupus. There are only geographical forms just like with humans. Although Asian, African and Caucasian people look very much different, they are all the same species, Homo sapien."}, {"url": "http://www.answers.com/Q/What_is_the_largest_species_of_wolf_in_the_world", "passage_text": "There are three species of wolves in the world-the grey wolf (Canis lupus), the red wolf (Canis rufus) and the Ethiopian wolf ((also known as Abyssian wolf, Ethipioan JAckle … , and Simain fox))(Canis simensis).    The grey wolf, of which there are numerous subspecies, is found across North America and Eurasia."}, {"url": "http://www.answers.com/Q/What_is_the_largest_wolf_species", "passage_text": "There are three species of wolves in the world-the grey wolf (Canis lupus), the red wolf (Canis rufus) and the Ethiopian wolf ((also known as Abyssian wolf, Ethipioan JAckle … , and Simain fox))(Canis simensis).    The grey wolf, of which there are numerous subspecies, is found across North America and Eurasia."}]