[{"url": "https://en.wikipedia.org/wiki/Upstart", "passage_text": "Upstart is an event-based replacement for the traditional init daemon – the method by which several Unix-like computer operating systems perform tasks when the computer is started. 1 Red Hat includes Upstart in their Red Hat Enterprise Linux 6 release. 2  As a result, it is also used by RHEL 6 variants such as CentOS, Scientific Linux, and Oracle Linux. 3  For RHEL 7, systemd is used instead."}, {"url": "http://askubuntu.com/questions/1083/what-is-upstart", "passage_text": "Upstart is a new init daemon that allows services to be started in response to events rather than in bulk runlevels. With each job file in the /etc/init directory being responsible for launching a service or for a specific component of system initialisation. Upstart is in fact based on an event monitoring system. When a certain hardware condition occurs, or another process sends an event, one or more of upstarts scripts might be triggered."}, {"url": "https://en.wikipedia.org/wiki/Upstart_(company)", "passage_text": "Upstart is a for-profit company which makes its money by charging borrowers an origination fee between 1% and 6% of the amount they borrow. It was launched in April 2012 and its beta site went live in August 2012. Upstart has thousands of borrowers and a blend of both retail and institutional investors. The company issues personal loans ranging from $3,000- $35,000."}, {"url": "http://askubuntu.com/questions/1083/what-is-upstart", "passage_text": "up vote 8 down vote accepted. Upstart is the replacement for the traditional init.d style System-V bootup scripts. However, upstart is more than just a collection of bootup scripts. It allows in fact a minute planning and control of the start of different daemons. For instance, in order to automount network drives, you need first a working network. Upstart is in fact based on an event monitoring system. When a certain hardware condition occurs, or another process sends an event, one or more of upstarts scripts might be triggered."}, {"url": "http://www.linux-magazine.com/Online/News/What-is-Upstart", "passage_text": "Originally created for use in Ubuntu, Upstart is suitable for deployment in all Linux distributions as an alternative to the System-V init. Scott James Remnant-Photo by: Simon Law. Follow along as Scott James Remnant, Upstart designer, explains what Upstart is and why it’s important to both the end user and developer. "}, {"url": "http://upstart.ubuntu.com/", "passage_text": "Overview. Upstart is an event-based replacement for the /sbin/init daemon which handles starting of tasks and services during boot, stopping them during shutdown and supervising them while the system is running."}, {"url": "https://hub.docker.com/_/ubuntu-upstart/", "passage_text": "Upstart is an event-based replacement for the traditional init daemon – the method by which several Unix-like computer operating systems perform tasks when the computer is started. It was written by Scott James Remnant, a former employee of Canonical Ltd. wikipedia.org/wiki/Upstart. "}]