[{"url": "http://nsf.gov/funding/pgm_summ.jsp?pims_id=5518", "passage_text": "Research in Undergraduate Institutions (RUI). An RUI proposal may be: 1  A request to support an individual research project or a collaborative research project involving PUI faculty and students at their own or other institutions."}, {"url": "http://www.thinkbabynames.com/meaning/0/Rui", "passage_text": "Rui /rui/ [1 syll.] as a girls' name is pronounced ROO-ee. It is of Japanese origin, and the meaning of Rui is tears; affection . Kreatif forms: Rorui, Ruima, Ruiro."}, {"url": "http://ruicreditservices.com/about.html", "passage_text": "Headquartered in Melville, New York, with regional offices throughout the United States, RUI Credit Services (“RUI”) is a leader in debt recovery services and consumer relationship management."}, {"url": "http://www.thinkbabynames.com/meaning/0/Rui", "passage_text": "How popular is Rui? Rui is an uncommon first name for women but a somewhat popular last name for both adults and children (#123314 out of 150436, Top 82%). (2000 U.S. Census). Charted below is the birth name popularity of Rui for girls."}, {"url": "http://www.solvusoft.com/en/file-extensions/file-extension-rui/", "passage_text": "If your PC opens the RUI file, but it's the wrong application, you'll need to change your Windows registry file association settings. In other words, Windows is associating RUI file extensions with the wrong software program."}, {"url": "http://www.nsf.gov/pubs/2000/nsf00144/nsf00144.htm", "passage_text": "The involvement of undergraduate students is an important feature of RUI, providing them with research-rich learning environments. However, the overriding purpose of RUI is the support of faculty research, which maintains faculty members' intellectual vibrancy in the classroom and research community."}, {"url": "http://www.nsf.gov/pubs/2000/nsf00144/nsf00144.htm", "passage_text": "The specific objectives of RUI are to (1) support high-quality research by faculty members of predominantly undergraduate institutions, (2) strengthen the research environment in academic departments that are oriented primarily toward undergraduate instruction, and (3) promote the integration of research and education."}]