[{"url": "http://www.caesarstone.com.au/news/news-announcements/8-creative-kitchen-island-styles-for-your-home", "passage_text": "The Waterfall Edge Island. By far the most popular design choice for the kitchen island is the simple waterfall edge, with the benchtop surface cascading down one or both sides of the benchtop to the floor. "}, {"url": "http://kitchenideas.com.au/benchtop.html", "passage_text": "Your benchtop/countertop is an important part of your kitchen. Not only does it need to be durable for daily use, it also affects the overall design of the kitchen. Do you want your benchtop/countertop to blend in with the rest of the kitchen or do you want it to create a contrasting feature? Benchtops of different finishes can be used together to create a unique look. Simple clean acrylic benchtop and timber island benchtop mix well together in this modern kitchen. (Image by: A. Fischer aka albertsok @ ikeafans.com). Thickness of benchtops/countertops varies, but is usually around 3-4cm."}, {"url": "http://www.oppikoferjoinery.com.au/index.php/kitchen-design-canberra/benchtops", "passage_text": "A waterfall edge benchtop is also known as an End Panel. It is the piece of stone, marble, laminate or benchtop material that runs vertically from the top of the benchtop to the floor at the end of the cabinetry. Granite is an igneous rock (formed by heat) found deep within the Earth's crust. Once quarried, cut, polished, & sealed granite is nearly impervious to scratches, heat, etching, staining, or weathering. It is truly one of Mother Nature's most versatile and beautiful creations."}, {"url": "http://forum.homeone.com.au/viewtopic.php?f=16&t=31192", "passage_text": "Hi again, I really really love the look of the waterfall bench-top however cannot afford the cost for the extra ceaser stone required. Anyhow I spoke to the cabinet company today and they can re-create this look by using 20mm vinyl gloss on the sides. There are lots of photo's of waterfall benchtops on this site, however I am having a hard time distinguishing between which ones have used ceaser for the sides and which ones have used other materials."}, {"url": "http://www.capitalcoastkitchens.com.au/benchtops/", "passage_text": "Full benchtop range to suit your needs for practicality and cost: Laminate, Reconstituted Stone, Natural Granite, Stainless Steel and Acrylics. Plus Marble and Vanity bench tops. For more information please contact us. "}, {"url": "http://www.customflatpack.com.au/flatpack-benchtops/benchtop-joints-ends/benchtop-waterfall-end", "passage_text": "Add to your flatpack kitchen benchtop order. Traditionally the domain of stone benchtops, our laminated benchtops can be customised to accommodate a matching waterfall (drop down) end. The unique Clamex fixing creates a flush finish that is easy to adjust for a neat, mitred joint. Available in single-and double-sided laminate finish."}, {"url": "http://www.oppikoferjoinery.com.au/index.php/kitchen-design-canberra/benchtops", "passage_text": "Marble is limestone that has been pressed by the earth’s pressure to produce a hard substance of crystals and beautiful lines and colors. Marble can have nearly any coloring, from blacks to white, and with a number of fantastic colors in between such as green and pink. Granite is an igneous rock (formed by heat) found deep within the Earth's crust. Once quarried, cut, polished, & sealed granite is nearly impervious to scratches, heat, etching, staining, or weathering. It is truly one of Mother Nature's most versatile and beautiful creations."}, {"url": "http://www.woodndoors.com/products/benchtops/waterfall-bench-tops/", "passage_text": "Call 08 8186 1733 for pricing information. Ideal for statement island counters the 'Waterfall Bench Top has slab ends which join the top to the floor. The top is made as one piece of timber and then cut down so that the grain matches along the sides giving it a waterfall appearance. "}, {"url": "http://kitchenideas.com.au/benchtop.html", "passage_text": "Although standard benchtop / countertop height is around 90cm (36), it is best to design a comfortable bench height based on the height of the person who will be using the kitchen most of the time. Benchtops of different finishes can be used together to create a unique look. Simple clean acrylic benchtop and timber island benchtop mix well together in this modern kitchen. (Image by: A. Fischer aka albertsok @ ikeafans.com). Thickness of benchtops/countertops varies, but is usually around 3-4cm."}, {"url": "http://kitchenideas.com.au/benchtop.html", "passage_text": "As a man-made product, uniform colour and pattern can be achieved throughout the whole surface and it is available in a wide range of colours. Stone composite countertops are easy to maintain. Engineered stone kitchen island benchtop with waterfall side panels. Benchtops of different finishes can be used together to create a unique look. Simple clean acrylic benchtop and timber island benchtop mix well together in this modern kitchen. (Image by: A. Fischer aka albertsok @ ikeafans.com). Thickness of benchtops/countertops varies, but is usually around 3-4cm."}]