[{"url": "http://www1.salary.com/Merchandise-Buyer-Assistant-salary.html", "passage_text": "For example the median expected annual pay for a typical Merchandise Buyer Assistant in the United States is $47,124 so 50% of the people who perform the job of Merchandise Buyer Assistant in the United States are expected to make less than $47,124. Source: HR Reported data as of October 2015. Median $47,124. 1  Salary."}, {"url": "http://www.ehow.com/facts_6761292_assistant-merchandiser-job-description.html", "passage_text": "Big-Picture Responsibilities. Assistant merchandisers support merchandise managers and purchasers as they find, develop and ship products. As an assistant merchandiser, you monitor and analyze sales records and economic conditions to predict buying patterns and monitor inventory."}, {"url": "http://www1.salary.com/Merchandise-Buyer-Assistant-salary.html", "passage_text": "The annual salary for someone with the job title Merchandise Buyer Assistant may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://www.mymajors.com/career/merchandising-assistant/", "passage_text": "1 Assist with duties in other areas of the store, such as monitoring fitting rooms or bagging and carrying out customers' items. 2  Supervise others and provide on-the-job training. 3  Count money in cash drawers at the beginning of shifts to ensure that amounts are correct and that there is adequate change."}, {"url": "http://www.samplejobdescriptions.org/merchandise-assistant.html", "passage_text": "The profile of a Merchandise Assistant typically pertains to a retail chain or an outlet. This job is of a high caliber where in the professional is accountable for all the goods purchased for the store and for maintaining the standards of the establishment as well as driving revenue."}, {"url": "http://www.retailhumanresources.com/job-seekers/retail-job-descriptions/merchandiser-job-description", "passage_text": "1 Devising a merchandise plan using the above techniques. 2  Relaying the merchandise plan to the buyer who, in turn, can decide on what products, styles, colours etc to purchase and from which suppliers, at what price. 3  Devising a contract for the suppliers including quality control, accuracy and flexibility."}, {"url": "http://www.retailhumanresources.com/job-seekers/retail-job-descriptions/merchandiser-job-description", "passage_text": "Merchandising is about planning and developing a strategy to enable a company to sell a range of products that delivers sales and profit targets. A Merchandiser will work closely with a Buyer to ensure the product that's bought will enable them to achieve the sales plan."}]