[{"url": "http://www.clovegarden.com/ingred/sf_pomfcsz.html", "passage_text": "Pampus chinensis is very similar but the tail is generally not so deeply forked. It is smaller, has a smaller range and is a minor commercial catch. More on Butterfish. Pomfret is one of the most sought after fish in India and Southeast Asia due to it's delicate white flesh with subtle non-fishy flavor. It is not actually a pomfret but a butterfish. It can grow to 23 inches but the photo specimen, wild caught in India, was 10 inches and weighed 9-1/2 ounces, a typical market size here in Los Angeles."}, {"url": "http://fresh.co.nz/butterfish-is-better/", "passage_text": "The delicate and delicious butterfish, endemic to New Zealand, is a source of several nutrients important for human health, including iodine. They are a premium fish, prized for their very clean, delicate flavour, translucent flesh and ability to flake well. The versatility of butterfish is such that it can be baked, marinated, poached, smoked, grilled or pan-fried. Best of all, butterfish is so-named for its deliciously moist texture and ‘butteriness’."}, {"url": "http://www.seafoods.com/product/288-butterfish", "passage_text": "THE FISH-This fish is not related to the Warehou species or other members of the Centrolophidae family which are called butterfish in Japan. It is also not related to Walu or Escolar that is sometimes marketed as butterfish in Hawaii. This is the real butterfish, truly worthy of its name. Very Rich and Delicate! "}, {"url": "http://thepelicansreef.com/FishFacts.aspx", "passage_text": "Sablefish (Butterfish). Due to its high fat content Sablefish has a velvety texture (hence the name Butterfish) with a mild but distinctive flavor profile. The flesh is white with large, delicate flakes. Sablefish is a richly flavored fish with a high oil content and satiny texture. They are highly valued for their buttery texture and are frequently sold to Japan before the US market."}, {"url": "http://healthyeating.sfgate.com/fattening-butterfish-1116.html", "passage_text": "It is also known as skipjack and the dollarfish. Butterfish is a small fish, with a mature weight of only 1 pound. It has a rich flavor and delicate texture, and it is not a fattening food if you eat it in moderation. Another factor in whether butterfish is fattening is what you eat with it. Fried butterfish on a sandwich with cheese, a high-calorie dressing and a side of potato chips is more fattening than grilled butterfish with a side of steamed broccoli."}, {"url": "http://fooduniversity.com/foodu/seafood_c/resources/ocean%20fin/Warm%20Water/Butterfish/ButterfishN.html", "passage_text": "One of the best pan fishes of the Atlantic Coast, it is fat and oily but has a delicate flavor. The maximum size is 12 inches long and 1 1/4 lbs. but average market size is 5 oz. Butterfish have dark, sweet, richly flavorful meat that's high in fat and tender in texture. "}, {"url": "http://www.bellaonline.com/articles/art68658.asp", "passage_text": "Butterfish Korma Recipe. I love seafood to the extent that I could eat it daily. My absolute hands down favorite is butterfish, otherwise known as sablefish or black cod. This delicious fish has a lovely delicate flavor and soft velvety texture. It literally just melts in your mouth. If you have never tasted butterfish before, I highly recommend trying it trust me, you will love it."}, {"url": "http://thisfish.info/fishery/species/sablefish/", "passage_text": "Anoplopoma fimbria. Sablefish is highly prized for an intensely rich, buttery flavour – hence the nickname “butterfish” – and for its surprisingly delicate texture. Although commonly called “black cod,” this deep-sea fish, which can live up to 5,000 feet (1,500 metres) below the sea, is not part of the cod family. "}]