[{"url": "http://www.vikingrange.com/MEDIA_CustomProductCatalog/m840012_f20394.pdf", "passage_text": "Food Storage Tips Frozen Food Storage ł The freezer compartment of a refrigerator should be kept atapproximately 0° F (-18° C). To check the temperature, place anappliance thermometer between the frozen packages and checkafter 24 hours. 6 7Max IceWhen activated, Max Ice reduces the freezer temperature to theoptimum setting for 24 hours in order to produce more ice. Note:When the Max Ice feature is in operation, the UP and DOWN padsfor the freezer control will not operate."}, {"url": "http://home.howstuffworks.com/appliances/energy-efficient/question121.htm", "passage_text": "Therefore, you want your refrigerator to be cold, but not so cold that it freezes things. The preferred temperature is somewhere between 35 and 38 degrees F (1.7 to 3.3 degrees C). Anything higher and foods will spoil too quickly (it also presents food poisoning problems, as described in several of the links below). "}, {"url": "http://www.vikingrange.com/consumer/category/products/frequently-asked-questions/refrigeration-appliance-questions", "passage_text": "What is the available temperature range on Viking Undercounter Refrigeration Products? For the Undercounter Beverage Center (VBCI) : temperature can be adjusted from 32 to 48 degrees F (0-8.9 degrees C); factory set at 42 degrees F (5.6 degrees C). One. Viking refrigerators are powered by Viking ProChill™ Temperature Management System. This includes and advanced DC Overdrive™ Compressor, multi-fan air distribution and electronic temperature control."}, {"url": "http://www.vikingrange.com/consumer/category/products/frequently-asked-questions/refrigeration-appliance-questions", "passage_text": "For the Undercounter Refrigerator (VRCI) : temperature can be adjusted from 32 to 39 degrees F (0-3.9 degrees C); factory set at 38 degrees F (3.3 degrees C). One. Viking refrigerators are powered by Viking ProChill™ Temperature Management System. This includes and advanced DC Overdrive™ Compressor, multi-fan air distribution and electronic temperature control."}, {"url": "http://www.wikihow.com/Set-Your-Refrigerator-Temperature", "passage_text": "When you set your refrigerator temperature to the proper setting, you keep your food from spoiling while making your refrigerator more energy efficient. Follow the steps in this article to check your refrigerator temperature and reset it accurately. Ad. "}, {"url": "http://www.fda.gov/ForConsumers/ConsumerUpdates/ucm093704.htm", "passage_text": "1 Keep the refrigerator temperature at or below 40° F (4° C). 2  The freezer temperature should be 0° F (-18° C). 3  Check temperatures periodically. 4  Appliance thermometers are the best way of knowing these temperatures and are generally inexpensive. 1 Also, when putting food away, don't crowd the refrigerator or freezer so tightly that air can't circulate. 2  Keep your appliances at the proper temperatures. 3  Keep the refrigerator temperature at or below 40° F (4° C). 4  The freezer temperature should be 0° F (-18° C). 5  Check temperatures periodically."}, {"url": "http://cooking.stackexchange.com/questions/4529/what-temperatures-should-i-keep-my-refrigerator-and-freezer-set-at", "passage_text": "Normally a domestic freezer is best set to −18 °C (0 °F) or colder, as that's what the expiration dates for many food items are based on. It's also a requirement for freezers in restaurants, supermarkets & other places that sell food (at least here in Europe) to maintain a temperature of at most -18 °C. In order to keep food out of the Danger Zone, your fridge must be set between 32-40°F (0-4°C). Your freezer must be below 32°F (0°C). I keep mine as cold as it will go."}, {"url": "http://lifehacker.com/what-temperature-should-you-keep-your-refrigerator-set-533534221", "passage_text": "In order to keep food out of the Danger Zone, your fridge must be set between 32-40° F (0-4 degrees Celsius). Your freezer must be below 32° F (0° Celsius). I keep mine as cold as it will go. Keep your freezer efficient by half-filling it with bottles of water. Your refrigerator probably isn't set right, and your food items may not be where they should be in your fridge. The kitchen fanatics at Stack Exchange offer a couple tips on ensuring your perishables don't perish."}]