[{"url": "http://www.ehow.com/facts_5113914_folders-subfolders.html", "passage_text": "In a file path, folder and subfolder names are separated by a slash (/). For example, My Documents/Stories/Novel.txt shows a file called Novel.txt inside the Stories subfolder, which is inside the My Documents folder."}, {"url": "http://agsci.psu.edu/it/how-to/create-subfolder-in-outlook", "passage_text": "How To Transfer Mail to Subfolder. 1  In your Inbox, select the message you want to transfer. 2  Click, hold, and drag that message to the folder in your Folder List. 3  If the folder is not displayed, click the + symbol beside the Inbox to expand the list of subfolders."}, {"url": "http://agsci.psu.edu/it/how-to/create-subfolder-in-outlook", "passage_text": "How To Create Subfolder. 1  Right-click on your Inbox and select New Folder. 2  In the Name field, type the name you want to call it. 3  In the Folder Contains field, make sure it says Mail & Post Items. 4  In the Select where to place Folder, select Inbox. 5  Click OK."}, {"url": "http://www.oxforddictionaries.com/definition/english/subfolder", "passage_text": "A folder contained within another folder: if you don’t already have a Programs subfolder in this directory, create one. More example sentences. 1  Each time you have a new listing or buyer, create a subfolder within the appropriate folder. 2  You only really need to place the main index sitemap in the root, the rest you can just place in a subfolder."}, {"url": "http://www.computerhope.com/jargon/s/subdirec.htm", "passage_text": "A subdirectory is a directory that is located within another directory. A similar term can be used to describe a folder beneath another folder in a graphical user interface (GUI) like Microsoft Windows. Below are some additional examples of subdirectories and subfolders."}, {"url": "http://www.oxforddictionaries.com/definition/english/subfolder", "passage_text": "1 Each time you have a new listing or buyer, create a subfolder within the appropriate folder. 2  You only really need to place the main index sitemap in the root, the rest you can just place in a subfolder. 3  Scroll the list, if necessary, until you find the subfolder containing the records of the user you want to delete."}]