[{"url": "http://www.fixr.com/costs/build-patio", "passage_text": "A patio can be made from many different materials including stone, pavers, and concrete. For this discussion we will look at the requirements and costs associated with the installation of a 192 square foot (12'x16') concrete patio. For the patio installation, the typical costs include: 1  According to PaveTech, the average concrete patio will cost around $700 using pavers and doing all of the work independently. 2  The above figures place the patio installation at $21 per square foot."}, {"url": "http://www.texaspatiobuilder.com/cost-build-patio/", "passage_text": "If you want to build your dream deck or patio you should anticipate costs starting at $8,000 and reaching up to $40,000 for multiple levels, stairs, outdoor speakers, fire place, and cooking area. I researched the average cost of a simple patio and it turns out that on the low end a simple concrete pave patio can be installed for around $2000. A covered patio complete with over head fan will likely cost $5000 to $7000."}, {"url": "http://www.ajreliable.com/how-much-does-it-cost-to-build-a-patio-roof/", "passage_text": "Experts estimate that a patio roof could cost from $10-$50 per square foot. This wide budgetary range takes into account the varying costs of the materials listed above. As you begin to price patio roof additions with local roofers, a basic aluminum roof may cost $6000-$10,000 for a 20’ x 20’ area. Adding wood latticing to a roof of the same size could add $500-$10,000 onto a project. No matter what type of roof material you choose, venting is a top priority"}, {"url": "http://www.kudzu.com/article/How-much-does-it-cost-to-build-a-patio-id8532", "passage_text": "1 Stone, concrete, or brick patio installation: The average cost for building a patio ranges from $400 to $10,000, depending upon the size of the patio and type of material used. 2  Wood patio installation: A professional carpenter will charge approximately $25 to $35 per hour for an average-sized wooden patio. Typical Patio Installation Costs. 1 "}, {"url": "http://money.usnews.com/money/personal-finance/articles/2014/06/30/how-much-will-that-patio-or-deck-cost", "passage_text": "And how much is a cheap patio? The cost to install a 200-square-foot concrete patio is about $740 to $840 on average, according to HomeWyse.com, an online reference for home projects. If you need, say, 800 inexpensive patio pavers for a 200-square-foot patio, that will generally equate to the price of a concrete patio. Not too bad, until you factor in the price of hiring someone to put them in the ground and any other extras your patio might need."}, {"url": "http://home.costhelper.com/patio.html", "passage_text": "1 Total costs for a do-it-yourself brick patio can run $2.80 a square foot or $560 for a 10x20-foot area, according to AskTheBuilder.com. 2  Having a brick patio professionally installed can run around $15 a square foot (labor and materials) or $3,000 for a 10x20-foot area, according to Landscape-Design-Advice.com. Shopping for a patio: 1  Building a patio is just the beginning; furniture, plants, a barbecue, an electric outdoor heater and other accessories can add $200-$5,000 or more to the total cost."}, {"url": "http://www.kudzu.com/article/How-much-does-it-cost-to-build-a-patio-id8532", "passage_text": "For a do-it-yourself brick patio: About $1,000. DIYNetwork estimates a do-it-yourself flagstone patio project will cost $200 - $500, take a weekend to finish and rates the difficulty at Easy to Moderate. For a professionally installed brick patio: About $2,500-$5,000. Typical Patio Installation Costs. 1  Stone, concrete, or brick patio installation: The average cost for building a patio ranges from $400 to $10,000, depending upon the size of the patio and type of material used."}, {"url": "http://www.improvenet.com/r/costs-and-prices/concrete-patios", "passage_text": "The overall cost of a concrete patio depends on the design and size of the patio. Prices usually start at around $6 per square foot up to $10 per square foot for a basic design without any colors or special designs. Adding colors or a pattern to the design can increase the price to $15 per square foot. "}, {"url": "http://www.fixr.com/costs/build-patio", "passage_text": "1 According to PaveTech, the average concrete patio will cost around $700 using pavers and doing all of the work independently. 2  When professional concrete contractors and excavators are used the costs will obviously climb substantially. 3  Traditionally, a patio at the size mentioned will cost roughly $2,000 to $4,000. For the patio installation, the typical costs include: 1  According to PaveTech, the average concrete patio will cost around $700 using pavers and doing all of the work independently. 2  The above figures place the patio installation at $21 per square foot."}, {"url": "http://www.fixr.com/costs/build-patio", "passage_text": "1 Traditionally, a patio at the size mentioned will cost roughly $2,000 to $4,000. 2  The resale value of this update would hold at the high-end of $3,200, or an 80% return on investment. 3  The above figures place the patio installation at $21 per square foot. For the patio installation, the typical costs include: 1  According to PaveTech, the average concrete patio will cost around $700 using pavers and doing all of the work independently. 2"}]