[{"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_edexcel/cells/mitosisrev2.shtml", "passage_text": "The cells from each parent that combine to form the zygote are called gametes. In humans, the male gamete is called sperm, and the female gamete is called an egg. When the gametes join they form a cell called a zygote. Human sperm and eggs contain 23 chromosomes. Human zygotes contain 46 chromosomes. "}, {"url": "https://simple.wikipedia.org/wiki/Meiosis", "passage_text": "Sexual reproduction takes place when a sperm fertilizes an egg. The eggs and sperm are special cells called gametes, or sex cells. Gametes are haploid; they have only half the number of chromosomes as a normal body cell (called a somatic cell). Fertilization restores the chromosomes in body cells to the diploid number. The basic number of chromosomes in the body cells of a species is called the somatic number and is designated 2n. "}, {"url": "http://www.shmoop.com/animal-reproduction/gametes.html", "passage_text": "An important part of gamete production is meiosis. This is the process which turns diploid cells into haploid cells. Although sperm and egg production differ in many ways, meiosis is a critical to both processes. "}, {"url": "http://biology.about.com/od/geneticsglossary/g/gametes.htm", "passage_text": "Gametes are produced by a type of cell division called meiosis. They are haploid, meaning that they contain only one set of chromosomes. When the haploid male and female gametes unite in a process called fertilization, they form what is called a zygote. The zygote is diploid and contains two sets of chromosome"}, {"url": "http://study.com/academy/lesson/female-gamete-production-definition-quiz.html", "passage_text": "Female gametes are also called eggs or ova. They are created during the cellular reproduction process known as meiosis. The resulting gamete cell is a haploid cell. When the two haploid cells, the egg and sperm, fuse together during fertilization, the result is a diploid cell called a zygote."}, {"url": "http://biology.about.com/od/geneticsglossary/g/gametes.htm", "passage_text": "Definition: Gametes are reproductive cells (sex cells) that unite during sexual reproduction to form a new cell called a zygote. Male gametes are sperm and female gametes are ova (eggs). In seed bearing plants, p ollen is the male sperm producing gametophyte. They are haploid, meaning that they contain only one set of chromosomes. When the haploid male and female gametes unite in a process called fertilization, they form what is"}, {"url": "http://www.answers.com/Q/Gametes_are_made_by", "passage_text": "Gametes are cells with only half the number of chromosomes as the organism. When two gametes fuse together, the number of chromosomes is correct, with half of those chromosomes (one from each pair) coming from the mother and the other half coming from the father. Step 2: Each of the two daughter cells is divided into two making four gametes. This step is called Meiosis II but it is really the same process as mitosis. Gametes only contain one copy of each gene, but the cell they were made from contained two varieties of each gene."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookmeiosis.html", "passage_text": "Gametogenesis is the process of forming gametes (by definition haploid, n) from diploid cells of the germ line. Spermatogenesis is the process of forming sperm cells by meiosis (in animals, by mitosis in plants) in specialized organs known as gonads (in males these are termed testes). "}, {"url": "http://www.answers.com/Q/Gametes_are_made_by", "passage_text": "In a process similar to mitosis, a cell forms two daughter cells that each have a single set of chromosomes, half the total number in the original cell. Step 2: Each of the two daughter cells is divided into two making four gametes. This step is called Meiosis II but it is really the same process as mitosis. Gametes only contain one copy of each gene, but the cell they were made from contained two varieties of each gene. The genes in each gamete are chosen randomly from each pair of alleles during meiosis"}, {"url": "http://www.nature.com/scitable/definition/gamete-gametes-311", "passage_text": "Gametes are an organism's reproductive cells. They are also referred to as sex cells. Female gametes are called ova or egg cells, and male gametes are called sperm. Gametes are haploid cells, and each cell carries only one copy of each chromosome. These reproductive cells are produced through a type of cell division called meiosis. "}]