[{"url": "http://onlinestatbook.com/2/normal_distribution/areas_normal.html", "passage_text": "Figure 3 shows a normal distribution with a mean of 75 and a standard deviation of 10. The shaded area contains 95% of the area and extends from 55.4 to 94.6. For all normal distributions, 95% of the area is within 1.96 standard deviations of the mean. The normal calculator can be used to calculate areas under the normal distribution. For example, you can use it to find the proportion of a normal distribution with a mean of 90 and a standard deviation of 12 that is above 110."}, {"url": "http://www.answers.com/Q/What_is_the_total_area_under_the_normal_distribution_curve", "passage_text": "The area under the normal distribution curve represents the probability of an event occurring that is normally distributed. So, the area under the entire normal distribution curve must be 1 (equal to 100%). For example, if the mean (average) male height is 5'10 then there is a 50% chance that a randomly selected male will have a height that is below or exactly 5'10."}, {"url": "http://www.unco.edu/nhs/mathsci/facstaff/Powers/M550/ContinuousDistributions/pdf/7.2.1%20Finding%20Areas%20under%20the%20Standard%20Normal%20Curve.pdf", "passage_text": "4. Find the area under the standard normal curve that lies to the left of Z = 1.645. Finally, an advantage of using technology is that finding the area under a normal curve is not restricted to the standard normal curve. 5."}, {"url": "http://www.psychstat.missouristate.edu/introbook/SBK11.htm", "passage_text": "All members of the family of normal curves have a total area of one (1.00) under the curve, as do all probability models or models of frequency distributions. This property, in addition to the property of symmetry, implies that the area in each half of the distribution is .50 or one half."}, {"url": "http://onlinestatbook.com/2/normal_distribution/areas_normal.html", "passage_text": "68% of the area is within one standard deviation (10) of the mean (50). Figure 2 shows a normal distribution with a mean of 100 and a standard deviation of 20. As in Figure 1, 68% of the distribution is within one standard deviation of the mean."}, {"url": "http://www.oswego.edu/~srp/stats/z.htm", "passage_text": "A standard normal distribution is a normal distribution with mean 0 and standard deviation 1. Areas under this curve can be found using a standard normal table (Table A in the Moore and Moore & McCabe textbooks). All introductory statistics texts include this table. Some do format it differently."}]