[{"url": "http://www.investopedia.com/articles/personal-finance/080714/how-do-real-estate-agents-get-paid.asp", "passage_text": "Most real estate agents make money through commissions – payments made directly to real estate brokers for services rendered in the sale or purchase of real property. A commission is usually a percentage of the property's selling price, although it can be a flat fee. According to the 2013 Profile of Home Buyers and Sellers published by the National Association of Realtors, 88% of buyers purchased their home through a real estate agent or broker, a share that has been increasing steadily from 69% in 2001."}, {"url": "https://answers.yahoo.com/question/index?qid=20080528184023AAO5cTc", "passage_text": "However the listing agent and selling agent each get half. 3.5% to the listing agent 3.5% to the selling agent Out of that 3.5% they have to pay their broker...sometimes as much as 50% or as low as 20%. For agents as other people have said, it's not a huge money making venture, everything comes out of the agents pocket until they get paid from a closed sale. "}, {"url": "http://budgeting.thenest.com/much-percentage-real-estate-agent-paid-34062.html", "passage_text": "Smile: She's only charging 4 percent. Real estate agents make their money by arranging home sales and taking a cut of the sale price, usually in the range of 5 percent to 6 percent. When you're selling a home, this can cost you a substantial amount of money come closing time, since it's the sellers who typically pay the commission. So if you sell a house for $200,000 and your agent charges a 6 percent commission, you'll have to fork over $12,000 worth of the sale price. Typically, the seller's agent and the buyer's agent split the commission 50-50, so in this case each agent would get $6,000. This split is negotiable, though"}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-do-real-estate-agents-make/", "passage_text": "In other words, the 162,560 real estate agents nationwide earned a mean hourly wage of $24.97. The lowest ten percent of real estate agents earn an average $20,700, while the top ten percent make an average of $95,540 annually. For real estate agents employed within a real estate office, the average real estate agent salary is right around normal at $52,870. Salary. Real estate agents work for brokers on a contract basis, which mean their earnings are a portion of the commission from every property they sell. According to the Bureau of Labor Statistics May 2012 record, the mean annual salary for real estate agents is $51,930."}, {"url": "http://qna.mortgagenewsdaily.com/questions/real-estate-agent-commissions-how-much-do-they-make", "passage_text": "The 6% ****real estate agent commission on a house sales price may also vary a little less, a little more depending on the region. Commission splits between listing and selling agents can also vary, i.e., 2%, 3%, or 4%. 0. Sales commissions are split a lot of ways. A real estate agent who lists a property for sale traditionally is paid a percentage of the home’s selling price, and the listing agent typically offers roughly half of that commission to an agent who brings a buyer into the transaction."}, {"url": "https://answers.yahoo.com/question/index?qid=20071223172719AA41zcP", "passage_text": "If I were to sell them they would have sale prices from a low of $900,000 to a high of $1,5000,000. I am constantly barraged by real estate agents that want to sell these properties for me. The rates they quote me are generally from a low of 4% to a high of 7% On a $900,000 house that is from $36,000 to $42,000. An agent lists a property for sale and the listing contracts stipulates how much commission will be paid when a sale takes place. If the listing agent sells the property, he earns the commission. If another agent sells it, the commission is split between the selling agent and the listing agent."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_real_estate_agent_earn", "passage_text": "The median annual earnings of salaried real estate agents in the U.S., according to the Department of Labor was $30,930 in 2002. This is including commissions. Median annual earnings of salaried real estate brokers, including commission, was $50,330 in 2002. Answer There's a huge variation in income among Real Estate agents, because earnings are based entirely on how much you sell. Some agents who advertise heavily earn well above $100,000 year after year, while some full-time agents earn as little as $12,500 per year."}, {"url": "https://www.thequotecompany.com.au/realestate/buying-tips/how-much-do-real-estate-agents-charge/", "passage_text": "Real estate agents charge a fee for advertising and marketing and a commission for selling your home. This commission is a percentage of the total sale price of your property. Before you list your property with an agent, make sure you understand all the charges. "}]