[{"url": "http://www.myhealthyfeeling.com/leg-numbness-tingling-and-pain-causes-and-treatment/", "passage_text": "Sciatica. Any disorder of the sciatic nerve will cause lower back and leg pain. Sciatica is characterized by leg numbness, tingling feet and toes, pain or weakness on the foot or leg on one side and sometimes even on both sides. Pain in the buttocks and the lower back is also to be expected. There are different causes of sciatic pain. The symptoms of herniated lumbar disc are numbness, tingling or pain from the lower back and buttocks, to the thigh, calf or foot. The sensation is usually on one side only. The symptoms get worse while standing, sitting, sleeping, bending and other specific movements."}, {"url": "http://www.mayoclinic.org/symptoms/numbness/basics/causes/sym-20050938", "passage_text": "Causes. Numbness is usually caused by damage, irritation or compression of several nerves or a single branch of a nerve, most often situated in the periphery of your body. Diseases affecting the peripheral nerves, such as diabetes, also can cause numbness. Rarely, numbness can be caused by problems in your brain or spinal cord. Fortunately, numbness by itself is only rarely associated with potentially life-threatening disorders, such as strokes or tumors."}, {"url": "http://www.healthline.com/health/fibromyalgia/numbness-in-legs-and-feet", "passage_text": "Highlights. 1  Numbness in the legs and feet can occur from simply sitting in one position, but it can also be caused by insect bites or medication. 2  Numbness of the feet can be a sign of serious conditions like fibromyalgia, multiple sclerosis, diabetes, or nerve damage. A lack of vitamin B12 can cause numb sensations in the arms and legs, as well as loss of balance and weakness. B12 is naturally found in animal products and other high-protein foods. However, older adults and those with intestinal disorders may have more difficulty absorbing the vitamin."}, {"url": "http://www.healthline.com/symptom/numbness", "passage_text": "Numbness and tingling are unusual prickling sensations that can happen in any part of your body, but they are generally noticed in hands, feet, arms, and legs. Many things can cause the feeling of numbness and tingling, including sitting with your legs crossed or falling asleep on your arm. "}, {"url": "http://www.healthgrades.com/symptoms/leg-numbness", "passage_text": "Leg numbness is an abnormal condition in which you feel a loss of sensation in the legs. You can have numbness of one (unilateral) or both (bilateral leg numbness) legs. Numbness in the legs may also extend to your toes. Leg numbness is usually due to a lack of blood supply to an area or nerve damage. Leg numbness can also result from infection, inflammation, trauma, and other abnormal processe"}, {"url": "http://www.healthline.com/health/fibromyalgia/numbness-in-legs-and-feet", "passage_text": "1 Numbness in the legs and feet can occur from simply sitting in one position, but it can also be caused by insect bites or medication. 2  Numbness of the feet can be a sign of serious conditions like fibromyalgia, multiple sclerosis, diabetes, or nerve damage. A lack of vitamin B12 can cause numb sensations in the arms and legs, as well as loss of balance and weakness. B12 is naturally found in animal products and other high-protein foods. However, older adults and those with intestinal disorders may have more difficulty absorbing the vitamin."}, {"url": "http://www.healthgrades.com/symptoms/leg-numbness--causes", "passage_text": "Leg numbness can be a symptom of a wide variety of diseases, disorders or conditions that either restrict blood flow or cause injury to the nerves. Temporary leg numbness can occur after prolonged pressure on a nerve or nerves, such as after sitting cross legged or bicycling long distance. Leg numbness can occur with moderate to serious orthopedic conditions that can lead to spinal or peripheral nerve damage. More serious conditions include multiple sclerosi"}, {"url": "http://www.rightdiagnosis.com/sym/numbness_in_one_leg.htm", "passage_text": "Numbness in one leg: Introduction. Numbness in one leg: Numbness in one leg refers to the loss or reduction of sensation in one leg. See detailed information below for a list of 7 causes of Numbness in one leg, Symptom Checker, including diseases and drug side effect causes. » Review Causes of Numbness in one leg: Causes | Symptom Checker »."}]