[{"url": "https://en.wikipedia.org/wiki/Kosher_salt", "passage_text": "Koshering salt, usually referred to as kosher salt in the US, is a variety of edible salt with a much larger grain size than some common table salt. Like common table salt, kosher salt consists of the chemical compound sodium chloride. Unlike some common table salt, kosher salt typically contains no additives such as iodine, although some brands will include anticaking agents in small amounts. Additive-free nonkosher salt is also readily available. The term kosher salt comes from its use in making meats kosher by removing surface blood, not from its being made in accordance with the guidelines for kosher foods as written in the Torah, as nearly all salt is kosher, including ordinary table salt. Grain of kosher salt taken at 60x magnification."}, {"url": "http://www.answers.com/Q/What_makes_kosher_salt_kosher", "passage_text": "No. kosher salt (or koshering salt) is totally additive free, including no iodine. It is also of a very large grain(larger than sea salt). However, it should be noted that bot … h table salt and kosher salt are primarily sodium chloride. What makes it kosher is (of course) that it be used and served according to the hebraic laws. Plain salt is always kosher. If there are additives in the salt -  such as to keep it dry-then it may need supervision. But Kosher  Salt usually refers to coarse salt us … ed to Kasher meat  (to remove the blood from meat before it may be eaten)."}, {"url": "http://www.chowhound.com/food-news/54177/why-is-kosher-salt-called-kosher-salt/", "passage_text": "Kosher salt has a coarse texture, which makes it easier to gauge and control how much you’re using. That makes it more popular with chefs than table salt. Some say it has a cleaner taste than table salt. And those large crystals sure do perch up well on a margarita glass. But bakers beware: Kosher salt weighs at least 26 percent less by volume than table salt."}, {"url": "https://en.wikipedia.org/wiki/Kosher_salt", "passage_text": "One salt manufacturer considers the term ambiguous, and distinguishes between kosher certified salt and koshering salt: Koshering salt has the small, flake-like form useful in treating meat, whereas kosher certified salt is salt that has been certified as such by an appropriate religious body. The term kosher salt comes from its use in making meats kosher by removing surface blood, not from its being made in accordance with the guidelines for kosher foods as written in the Torah, as nearly all salt is kosher, including ordinary table salt. Grain of kosher salt taken at 60x magnification."}, {"url": "http://www.chabad.org/library/article_cdo/aid/614954/jewish/What-is-Kosher-Salt.htm", "passage_text": "Salt: that is Kosher. is definitely larger in terms of grain and coarse in terms of texture. The regular table salt is fine, like sugar, and in fact, it's hard to tell, by just looking, with the naked eye, what is refined sugar from salt. I believe Kosher salt has a different taste from regular salt, but of course, salt is salt. And salty is the result. I often purchase salt that is Ocean salt, and it has more grain, being unrefined. @mac burnett-kosher salt is usually much coarser, so a tablespoon of kosher salt contains less salt than a tablespoon of table salt. Also, most kosher salt doesn't contain iodide/iodine."}, {"url": "http://www.finecooking.com/item/5462/kosher-salt", "passage_text": "koshering salt (in the UK). Kosher salt, so named because it's used in the process of koshering meats, has a larger grain than table salt. It usually contains no additives, though some kosher salts do contain iodine, which is more commonly found in table salts. Kosher salt is so named not because it's kosher, but because it is used in preparing kosher meats. All salt is kosher. And you have to wonder what genius came up with these pearls of wisdom: Compared to table salt, which can taste sharp and."}, {"url": "http://www.chowhound.com/food-news/54177/why-is-kosher-salt-called-kosher-salt/", "passage_text": "The process is sometimes called koshering. Kosher salt, like most mass-produced salts, does also happen to be kosher—that’s to say, it contains no additives and has been certified as kosher by a rabbi or an authorized organization. That makes it more popular with chefs than table salt. Some say it has a cleaner taste than table salt. And those large crystals sure do perch up well on a margarita glass. But bakers beware: Kosher salt weighs at least 26 percent less by volum"}, {"url": "http://www.thekitchn.com/kosher-salt-where-it-comes-from-why-its-called-kosher-ingredient-intelligence-219665", "passage_text": "Kosher salt is a coarse-grained salt made from the salt crystals. It is usually not iodized, but some brands may contain an anti-caking agent. The evaporation process determines the salt's final shape, so kosher salt can be flat or pyramidal in structure depending on the brand. Kosher salt's original purpose was really to kosher meat, meaning to remove the blood from meat, so it's really koshering salt. Certain salt companies labeled the boxes of this coarse salt kosher salt rather than koshering salt, and the name stuck."}, {"url": "http://science.howstuffworks.com/innovation/edible-innovations/salt3.htm", "passage_text": "Kosher Salt and Rock Salt. Kosher salt is used to make meats kosher by quickly drawing out the blood. Many chefs prefer to use kosher salt. Its coarse texture makes it easy to pick up and sprinkle on food during or after cooking. However, it doesn't dissolve as quickly as table salt, so it's better to use a finer salt when baking"}]