[{"url": "https://www.consumer.ftc.gov/articles/0252-warranties", "passage_text": "Implied Warranties. Implied warranties are created by state law, and all states have them. Almost every purchase you make is covered by an implied warranty. The most common type of implied warranty—a warranty of merchantability, means that the seller promises that the product will do what it is supposed to do. For example, a car will run and a toaster will toast"}, {"url": "http://www.ehow.com/about_6714251_warranty-clerk-job-description.html", "passage_text": "A warranty clerk ensures that all warranty paperwork is properly documented and that all verifying criteria needed by the manufacturer are processed correctly. The warranty clerk keeps abreast of all company announcements, especially factory recalls. Dealing with Manufacturers. Often the warranty clerk must deal with manufacturers who refuse to pay for certain warranted parts or service. The manufacturers also often do not pay the full amount, and the warranty clerk must discover why, and negotiate the rest of the payment on behalf of the customer and her employer."}, {"url": "http://www.ehow.com/about_6714251_warranty-clerk-job-description.html", "passage_text": "The warranty clerk is an entry-level position and is usually applied for directly. However, it is also possible to secure this position by moving laterally across the company from another office clerk position. In terms of career development, warranty clerks can advance to managerial positions within the company. Dealing with Manufacturers. Often the warranty clerk must deal with manufacturers who refuse to pay for certain warranted parts or service. The manufacturers also often do not pay the full amount, and the warranty clerk must discover why, and negotiate the rest of the payment on behalf of the customer and her employer."}, {"url": "http://www.ehow.com/about_6714251_warranty-clerk-job-description.html", "passage_text": "Warranty clerks often work for car dealerships and ensure that their employers are paid for all product maintenance parts or replacements covered under a warranty. Dealing with Manufacturers. Often the warranty clerk must deal with manufacturers who refuse to pay for certain warranted parts or service. The manufacturers also often do not pay the full amount, and the warranty clerk must discover why, and negotiate the rest of the payment on behalf of the customer and her employer."}, {"url": "http://homeguides.sfgate.com/copy-warranty-deed-deed-trust-home-46342.html", "passage_text": "Functions. A warranty deed and deed of trust are two related, yet different, documents. The warranty deed acts to convey the ownership in a property from the seller to the buyer -- known as the grantor and grantee. The deed of trust is a loan document that functions to secure the lender's interest in your property. The property being purchased with the mortgage loan acts as collateral in case you default on the loan."}, {"url": "http://www.payscale.com/research/US/Job=Warranty_Clerk/Hourly_Rate", "passage_text": "Job Description for Warranty Clerk. Read More... A warranty clerk is the person who works for an organization that offers warranty claims. This clerk also organizes and reviews warranty claims made by their customers and ensures that their employers are paid for all aspects involved in the warranty. This position typically does not require formal education, though this can vary. The warranty clerk will generally work in an office environment, and keep weekday, daytime hours. The warranty clerk plays a vital role in a business."}, {"url": "http://www.payscale.com/research/US/Job=Warranty_Clerk/Hourly_Rate", "passage_text": "A Warranty Clerk earns an average wage of $13.33 per hour. Most people move on to other jobs if they have more than 20 years' experience in this field. This position typically does not require formal education, though this can vary. The warranty clerk will generally work in an office environment, and keep weekday, daytime hours. The warranty clerk plays a vital role in a business."}]