[{"url": "https://en.wikipedia.org/wiki/African_Great_Lakes", "passage_text": "Lakes Victoria, Tanganyika, and Malawi hold a quarter of the planet's freshwater supply. Countries in the African Great Lakes region (sometimes also called Greater Lakes region) include Burundi, the Democratic Republic of Congo, Kenya, Rwanda, Tanzania and Uganda. The African Great Lake region consists of countries that surround the African Great Lakes. It comprises Burundi, the Democratic Republic of Congo, Kenya, Rwanda, Tanzania and Uganda. The Bantu Swahili language is the most commonly spoken language in the African Great Lakes region."}, {"url": "http://www.compassion.com/tanzania/lake-victoria.htm", "passage_text": "Lake Victoria is one of Africa's Great Lakes, and was named by the first European to discover the lake, John Hanning Speke, in honor of Queen Victoria of the U.K. Lake Victoria is Africa's largest lake, and crosses the borders of Tanzania, Uganda, and Kenya. 1 Crossing over the borders of Tanzania, Uganda and Kenya, Lake Victoria is Africa’s largest lake. 2  The Tanzanian portion of the lake lies in the country’s northwest, where Compassion’s ministry is found primarily in Mwanza and Shinyanga, two of Tanzania’s 30 regions."}, {"url": "http://www.compassion.com/tanzania/lake-victoria.htm", "passage_text": "The Tanzanian territory of Lake Victoria is located in the country's northwest region, where Compassion's ministry is primarily located in Mwanza and Shingaya-two of Tanzania's 30 regions. Many people in Mwanza, located along the shore of Lake Victoria, work in the fishing industry. 1 Crossing over the borders of Tanzania, Uganda and Kenya, Lake Victoria is Africa’s largest lake. 2  The Tanzanian portion of the lake lies in the country’s northwest, where Compassion’s ministry is found primarily in Mwanza and Shinyanga, two of Tanzania’"}, {"url": "https://en.wikipedia.org/wiki/African_Great_Lakes", "passage_text": "The African Great Lakes (Swahili: Maziwa Makuu) are a series of lakes constituting the part of the Rift Valley lakes in and around the East African Rift. They include Lake Victoria, the third largest fresh water lake in the world by area, and Lake Tanganyika, the world's second largest lake by volume and depth. The large rift lakes of Africa are the ancient home of great biodiversity; 10 percent of the world's fish species are found there. The African Great Lake region consists of countries that surround the African Great Lakes. It comprises Burundi, the Democratic Republic of Congo, Kenya, Rwanda, Tanzania and Uganda. The Bantu Swahili language is the most commonly spoken language in the African Great Lakes region."}, {"url": "http://www.bu.edu/ecologyonline/kaufman%20lab/Prospectus.htm", "passage_text": "INTRODUCTION. Lake Victoria, East Africa, is the largest tropical freshwater lake in the world. It is relatively shallow (maximum depth is 87m) with a surface area of 68,000km2. Its waters are shared by the nations of Tanzania, Uganda, and Kenya, with much of Burundi and Rwanda lying within the watershed. Lake Victoria is home and livelihood to millions of Africans in the countries of Kenya, Tanzania, and Uganda. It is the largest freshwater tropical lake in the world, and source of the world’s largest freshwater fishery."}, {"url": "http://www.bu.edu/ecologyonline/kaufman%20lab/Prospectus.htm", "passage_text": "Lake Victoria, East Africa, is the largest tropical freshwater lake in the world. It is relatively shallow (maximum depth is 87m) with a surface area of 68,000km2. Lake Victoria is home and livelihood to millions of Africans in the countries of Kenya, Tanzania, and Uganda. It is the largest freshwater tropical lake in the world, and source of the world’s largest freshwater fishery."}, {"url": "http://www.pbs.org/wnet/africa/explore/greatlakes/greatlakes_overview_lo.html", "passage_text": "Lake Victoria, located between Uganda to the west and Tanzania and Kenya to the east, ranks as the second-largest freshwater lake in the world after the U.S.' Lake Superior. Lake Taganayika, located on the border between the Democratic Republic of Congo and Tanzania, ranks as one of the deepest. The Great Lakes of Africa include some of the largest and most ecologically diverse freshwater systems on the planet. Twisting down the two arms of the Great Rift Valley like a chain of sapphires, the lakes are located in nine countries in East and Central Africa."}, {"url": "https://en.wikipedia.org/wiki/Lake_Victoria", "passage_text": "Speke accomplished this in 1858, while on an expedition with Richard Francis Burton to locate the source of the Nile River. With a surface area of 68,800 square kilometres (26,600 sq mi), Lake Victoria is Africa's largest lake by area, and is also the largest tropical lake in the world. Lake Victoria is the world's second largest freshwater lake by surface area; only Lake Superior in North America is larger. Lake Victoria is drained solely by the Nile River near Jinja, Uganda, on the lake's northern shore. Lake Victoria occupies a shallow depression in Africa and has a maximum depth of 84 m (276 ft) and an average depth of 40 m (130 ft). Its catchment area covers 184,000 square kilometers (71,040 sq mi)."}, {"url": "http://www.worldatlas.com/aatlas/infopage/lakevictoria.htm", "passage_text": "With a surface area of 68,800 sq km (26,600 sq mi), Lake Victoria is Africa's largest lake. In addition, it's the largest tropical lake in the world, and the planet's second largest freshwater lake. Only North America's Lake Superior is larger. The lake receives most of its water from direct precipitation. "}]