[{"url": "http://www.theothersideofcalifornia.com/independence/", "passage_text": "Independence has been Inyo County’s seat since the county’s formation in 1866. The courthouse is the fourth in Inyo’s history. The first collapsed in the 1872 earthquake, the second burned in 1892, the third was determined to be too small and was replaced in 1922 by the stately building we have today. It is the only hatchery to produce golden trout, California’s state fish. Adventure awaits you east and west of Independence where camping, hiking, fishing, and hunting abound. Extensive hiking and backpacking trails go throughout the Sierra from trail heads at Onion Valley, Shephard Pass, and Baxter Pass."}, {"url": "http://www.city-data.com/city/Independence-California.html", "passage_text": "Notable locations in Independence: Mount Whitney Fish Hatchery (A) , Inyo County Free Library (B) , Inyo County Courthouse (C) , Eastern California Museum (D) , Department of Forestry and Fire Protection Station 59 Independence (E) , Independence Fire Department (F) . According to our research of California and other state lists there was 1 registered sex offender living in Independence, California as of October 09, 2015. The ratio of number of residents in Independence to the number of sex offenders is 669 to 1"}, {"url": "http://www.theothersideofcalifornia.com/independence/", "passage_text": "Built in 1916 on land donated by the citizens of Independence, it was the second state hatchery built in California. For many years it has supplied trout eggs to other hatcheries in California and other western states. It is the only hatchery to produce golden trout, California’s state fish. Adventure awaits you east and west of Independence where camping, hiking, fishing, and hunting abound. Extensive hiking and backpacking trails go throughout the Sierra from trail heads at Onion Valley, Shephard Pass, and Baxter Pass."}, {"url": "http://www.livermont.com/Independence/Index.htm", "passage_text": "Independence -- Gateway to Discovery. Independence, California is the heart of the Owens Valley. A small rural community of approximately 800 people is the county seat for Inyo County; the second largest county in California. Independence offers: history, natural resources, recreational activities, with many things to do and places to go"}, {"url": "https://en.wikipedia.org/wiki/Independence,_California", "passage_text": "Independence is a popular resupply location for hikers trekking the 2,650 mile long Pacific Crest Trail which extends from the Mexican border to Canada along the crest of the Sierra Nevada and Cascade Ranges. The highest pass along the entire trail, 13,153 foot (4009 m) Forester Pass, is directly west of Independence. In the state legislature, Independence is in the 8th Senate District, represented by Republican Tom Berryhill, and the 26th Assembly District, represented by Republican Devon Mathis. Federally, Independence is in California's 8th congressional district, represented by Republican Paul Cook."}, {"url": "http://www.livermont.com/Independence/Index.htm", "passage_text": "The small town of Independence, Inyo County seat, boasts a stately courthouse, charming old Winnedumah Inn, Eastern California Museum, Mary Austin home, tennis court, swimming pool, nearby Mount Whitney Fish Hatchery, and an old fashioned 4th of July celebration. A small rural community of approximately 800 people is the county seat for Inyo County; the second largest county in California."}, {"url": "http://www.city-data.com/city/Independence-California.html", "passage_text": "1 Independence: picture is taken of Sierra Nevada mountains behind Black Rock Fish Hatchery of Independence Ca on a cool misty morning. According to our research of California and other state lists there was 1 registered sex offender living in Independence, California as of October 09, 2015. The ratio of number of residents in Independence to the number of sex offenders is 669 to 1"}, {"url": "https://en.wikipedia.org/wiki/Independence,_California", "passage_text": "Independence is a census-designated place in Inyo County, California. Independence is located 41 miles (66 km) south-southeast of Bishop, at an elevation of 3930 feet (1198 m). It is the county seat of Inyo County, California. The population of this census-designated place was 669 at the 2010 census, up from 574 at the 2000 census. In the state legislature, Independence is in the 8th Senate District, represented by Republican Tom Berryhill, and the 26th Assembly District, represented by Republican Devon Mathis. Federally, Independence is in California's 8th congressional district, represented by Republican Paul Cook."}, {"url": "http://www.city-data.com/city/Independence-California.html", "passage_text": "26.9%. According to our research of California and other state lists there was 1 registered sex offender living in Independence, California as of October 09, 2015. The ratio of number of residents in Independence to the number of sex offenders is 669 to 1"}]