[{"url": "http://www.plm.automation.siemens.com/it_it/Images/Lean%20in%20DM%20Environment_tcm71-54461.pdf", "passage_text": "Telephone: 617 723 7890 www.aberdeen.com 041207a August 2007 Rethinking Lean with Digital Manufacturing Lean Manufacturing processes have revolutionized the way that many leading enterprises identify and eliminate waste in complex manufacturing environments, thus streamlining processes and reducing cycle times. "}, {"url": "http://www.genpact.com/docs/default-source/resource-/putting-digital-to-work-the-lean-digital-way", "passage_text": "Yet solutions exist. Our experience indicates that a combination of classic and cutting edge methods – specifically, Lean principles, advanced digital technologies and a discovery process that involves design thinking – is powerful, practical and may prove effective for large enterprises. Genpact (NYSE: G) stands for “ generating business impact. ” We architect the Lean Digital SM enterprise through a unique approach based on our patented Smart Enterprise Processes (SEP SM) framework that reimagines our clients’ middle and back offices to generate growth, cost efficiency, and business agility."}, {"url": "http://theleanmarketer.com/about-the-lean-marketer/what-is-lean-marketing/", "passage_text": "Lean marketing is based on the book The Lean Startup by Eric Ries, which promotes the concept of iterative product design, development and launch. Lean Marketing is about being agile, about viewing each campaign or marketing activity as one step in the ever-improving progress towards customer acquisition and ultimately customer satisfaction."}, {"url": "https://en.wikipedia.org/wiki/Lean_manufacturing", "passage_text": "Lean manufacturing or lean production, often simply  lean , is a systematic method for the elimination of waste ( Muda ) within a manufacturing system. While lean is seen by many as a generalization of the Toyota Production System into other industries and contexts there are some acknowledged differences that seem to have developed in implementation."}, {"url": "http://blogs.wsj.com/cio/2014/08/08/lean-principles-in-the-digital-economy/", "passage_text": "As companies transition from the industrial to the digital economy, lean philosophies are influencing just about every aspect of their operations, strategy, organization and culture. Improving customer loyalty was the key theme of Digital Transformation-Why and How Companies are Investing in New Business Models to Lead Digital Customer Experiences, a report published earlier this year by Altimeter."}, {"url": "http://www.genpact.com/leandigital/", "passage_text": "Putting Digital to Work the Lean Digital Way. Digital technologies are radically changing how enterprises run, arguably with greater and deeper impact than that of any previous IT evolution. However, this huge business opportunity is held back by large enterprises' legacy systems and processes"}, {"url": "https://en.wikipedia.org/wiki/Lean_manufacturing", "passage_text": "Essentially, lean is centered on making obvious what adds value by reducing everything else. Lean manufacturing is a management philosophy derived mostly from the Toyota Production System (TPS) (hence the term Toyotism is also prevalent) and identified as lean only in the 1990s. While lean is seen by many as a generalization of the Toyota Production System into other industries and contexts there are some acknowledged differences that seem to have developed in implementation."}, {"url": "http://www.genpact.com/leandigital/", "passage_text": "Lean Digital. Genpact architects the Lean Digital SM enterprise-through a unique approach that reimagines our clients' middle and back offices to generate growth, cost efficiency, and business agility. Digital technologies are radically changing how enterprises run, arguably with greater and deeper impact than that of any previous IT evolution."}, {"url": "https://en.wikipedia.org/wiki/Lean_IT", "passage_text": "Lean IT is the extension of lean manufacturing and lean services principles to the development and management of information technology (IT) products and services. Its central concern, applied in the context of IT, is the elimination of waste, where waste is work that adds no value to a product or service. Although lean principles are generally well established and have broad applicability, their extension from manufacturing to IT is only just emerging. Indeed, Lean IT poses significant challenges for practitioners while raising the promise of no less significant benefits."}]