[{"url": "http://www.answers.com/Q/What_is_the_cleanest_part_of_the_human_body", "passage_text": "The butt is not the cleanest part of the human body. The eyeballs are. Despite constantly being exposed to the bacteria-filled world, your eyes are constantly coated in a laye … r of tears every time you blink, and this kills bacteria. The butt isn't necessarily dirty, but it isn't as clean as the eyeballs. The cleanest part of the woman's body is her mouth. 4 people found this useful. Edit. Share to: 1  Fasting, Sweating, Breathing: Finding the Best Ways to Cleanse Your Body A body cleanse and detox is used to clear the system of harmful toxins and promote health."}, {"url": "http://www.quibblo.com/quiz/blDnWes/Cleanest-Part-of-The-Human-Body-its-a-big-surprise", "passage_text": "Cleanest Part of The Human Body (its a big surprise!). by: LinzKay18. i looked up the ansers to this one and the other quiz i made on a reliable website and i asked my dad whom is a doctor!!!!!! this is crazy stuff!!! Your Quiz sent"}, {"url": "http://www.answers.com/Q/What_is_the_cleanest_part_on_a_woman_body", "passage_text": "Most of the skin is exposed to the environmental bacteria, and internally there are millions of bacteria, … outnumbering even the human cells. One suggestion is that the eyes, because they constantly shed salty fluid, might be the cleanest, or the interior of some organs with large numbers of white blood cells. The butt isn't necessarily dirty, but it isn't as clean as the eyeballs. Now, the anus can be dirty. Fecal matter comes out of the anus, and many people are afraid to clean the anus when they shower. Anyway, the butt isn't the cleanest part of the body, it'"}, {"url": "http://geniusbeauty.com/woman-health/dirtiest-body-part/", "passage_text": "4213. The National Human Genome Research Institute, Bethesda, Maryland, located the part of the body with the highest concentration of bacteria. During the experiment the researchers selected a group of volunteers, who were asked to use the same soap, which had no antibacterial properties, for one week. On the last stage of experiment, the scientists took hundreds of smears from various body parts. As it turns out, over 1000 species of bacteria live on human body, almost as many as live in our digestive system."}, {"url": "http://www.answers.com/Q/What_is_the_cleanest_part_of_the_human_body", "passage_text": "There is no specific region that is particularly free from bacteria. Most of the skin is exposed to the environmental bacteria, and internally there are millions of bacteria, outnumbering even the human cells. One suggestion is that the eyes, because they constantly shed salty fluid, might be the cleanest, or the interior of some organs with large numbers of white blood cells. The cleanest part of the woman's body is her mouth. 4 people found this useful. Edit. Share to: 1  Fasting, Sweating, Breathing: Finding the Best Ways to Cleanse Your Body A body cleanse and detox is used to clear the system of harmful toxins and promote health."}, {"url": "http://www.answers.com/Q/What_is_the_cleanest_part_on_a_woman_body", "passage_text": "The butt is not the cleanest part of the human body. The eyeballs are. Despite constantly being exposed to the bacteria-filled world, your eyes are constantly coated in a laye … r of tears every time you blink, and this kills bacteria. The butt isn't necessarily dirty, but it isn't as clean as the eyeballs. Now, the anus can be dirty. Fecal matter comes out of the anus, and many people are afraid to clean the anus when they shower. Anyway, the butt isn't the cleanest part of the body, it's the eyeballs."}, {"url": "http://www.answers.com/Q/What_is_the_cleanest_part_on_a_woman_body", "passage_text": "The cleanest part of your body is the surface of your eyeball. 4 people found this useful. Edit. Share to: 1  Common Side Effects Associated With Lexapro Lexapro is a medication commonly used to treat anxiety and depression in adults. The butt isn't necessarily dirty, but it isn't as clean as the eyeballs. Now, the anus can be dirty. Fecal matter comes out of the anus, and many people are afraid to clean the anus when they shower. Anyway, the butt isn't the cleanest part of the body, it'"}, {"url": "https://answers.yahoo.com/question/index?qid=20090827031424AAyieL3", "passage_text": "· just now. Report Abuse. There are several very filthy parts of the body but you asked this question in the format of philosophy so I'll have to say this the dirtiest part of the body is the Mind........external / internal body parts would be (in order) The foot, the mouth, and the dermis. Source(s): I'm only human. "}, {"url": "http://bag-o-richs.blogspot.com/2007/10/cleanest-part-of-your-body.html", "passage_text": "Someone anonymously posted about what might be the cleanest part of the human body (see the comments in my earlier hand washing post). "}]