[{"url": "http://genesdev.cshlp.org/content/1/8/868.full.pdf", "passage_text": "The idea that the recessive embryonic lethal alleles are leaky dpp ni~ mutations is consistent with ob-servations of interactions with mutations elsewhere in dpp. trans combinations of recessive embryonic lethal or haplo-lethal dpp n~ alleles with either dpp ~sk or dpp shy lesions elicit a variety of phenotypes."}, {"url": "http://biology.kenyon.edu/courses/biol114/Chap13/Chapter_13A.html", "passage_text": "At the tenth nuclear division, the nuclei migrate to the periphery of the embryo. At the thirteenth division, the 6000 or so nuclei are partitioned into separate cells. This stage is the cellular blastoderm. Although not yet evident, the major body axes and segment boundaries are determined."}, {"url": "http://genesdev.cshlp.org/content/1/8/868.full.pdf", "passage_text": "Given the similarity in lethal phenotype between homozygotes for the recessive embryonic lethal dpp alleles and monosomics for dpp ~+, Spencer et al. (1982) suggested that these reces-sive alleles are leaky dpp Hm-mutations. The recessive embryonic lethal alleles partially inactivate functions of the dpp ~sk region."}, {"url": "http://genesdev.cshlp.org/content/1/8/868.full.pdf", "passage_text": "1982). Mutations in the dpp d~sk region principally result in deletion of pattern el-ements of the adult epidermal tissues derived from the imaginal disks. In general, increasingly severe dpp d~sk mutations result in the loss of correspondingly more imaginal disk-derived tissue."}, {"url": "http://www.sdbonline.org/sites/fly/torstoll/decapen1.htm", "passage_text": "BIOLOGICAL OVERVIEW Recent literature Arias, C., Fussero, G., Zacharonok, M. and Macias, A. (2015). Dpp-expressing and non-expressing cells: two different populations of growing cells in Drosophila. PLoS One 10: e0121457. PubMed ID: 25798905 Summary: There are different models that explain growth during development."}, {"url": "http://genesdev.cshlp.org/content/1/8/868.full.pdf", "passage_text": "This supports the idea that in embryos from wild-type mothers, dpp H~- mutations cause the transformation of dorsal into ven-tral epidermis. If tissue determined to become dorsal epidermis dies in the dpp rim-null embryos, then one should not see ventral or lateral tissue formed in the double-mutant combination."}, {"url": "http://biology.kenyon.edu/courses/biol114/Chap13/Chapter_13A.html", "passage_text": "The Drosophila life cycle consists of a number of stages: embryogenesis, three larval stages, a pupal stage, and (finally) the adult stage! from the Carolina Drosophila manual. Embryogenesis in Drosophila. Following fertilization, mitosis (nuclear division) begins."}, {"url": "http://www.ucalgary.ca/~browder/D-V_drosophila.html", "passage_text": "Mutations in these genes result in abnormal or failed development of polarization in the Drosophila embryo. Nusslein-Volhard's experiments in 1979 identified and characterized all mutant alleles that affected the dorsal-ventral axis. Genes affecting dorsal-ventral polarization fall into two categories:"}, {"url": "http://www.ncbi.nlm.nih.gov/gene/33432", "passage_text": "1 MTMR4 is a necessary negative modulator for the homeostasis of BMP/Dpp signaling. 2  Bridging Decapentaplegic and Wingless signaling in Drosophila wings through repression of naked cuticle by Brinker. 3  Targets co-regulated by Eyeless and Hedgehog, Decapentaplegic or Notch, were identified."}, {"url": "http://www.ucalgary.ca/~browder/D-V_drosophila.html", "passage_text": "Dorsal-ventral patterning within the ectoderm of the Drosophila embryo requires seven zygotic genes including sog (short gastrulation). Sog is expressed in the ventrolateral region of the embryo that gives rise to the nerve cord."}]