[{"url": "http://www.answers.com/Q/How_much_does_a_Top_Secret_SCI_clearance_cost_an_employer", "passage_text": "Generally, expect your employer to spend approximately $5,000 for a secret clearance and $10,000 for a TS/SCI or Q. If your employer wants it done quickly, there are additional fees for rush processing."}, {"url": "http://www.howmuchisit.org/security-clearance-cost/", "passage_text": "1 There are no fixed charges for obtaining a security clearance. 2  The price could range from a few hundred dollars to a few thousand dollars. 3  Among the various types of security clearance, the top level one is the most expensive. 4  Such a clearance could cost about $10,000 or more, including all the other fees."}, {"url": "http://www.answers.com/Q/How_much_does_a_Top_Secret_SCI_clearance_cost_an_employer", "passage_text": "The actual cost of a clearance varies on multiple things. If you are capable of passing a simple automated background check, a secret clearance can be very simple. a TS/SCI becomes more complex, requiring personal interviews and a more in-depth, personnel-driven examination of your history."}, {"url": "http://www.your-poc.com/security-clearance-101/", "passage_text": "“The average cost to process a TOP SECRET clearance is between $3,000 and about $15,000, depending upon individual factors. . . . The law requires that contractors pay most of the costs of obtaining clearances for their employees.”."}, {"url": "http://usmilitary.about.com/cs/generalinfo/a/security2_4.htm", "passage_text": "The average cost to process a TOP SECRET clearance is between $3,000 and about $15,000, depending upon individual factors. The government pays the cost of clearances for military personnel and civilian government employees."}, {"url": "https://news.clearancejobs.com/2011/08/07/how-much-does-it-really-cost-to-get-a-security-clearance/", "passage_text": "“The average cost to process a TOP SECRET clearance is between $3,000 and about $15,000, depending upon individual factors. . . . The law requires that contractors pay most of the costs of obtaining clearances for their employees.” 1."}, {"url": "https://news.clearancejobs.com/2011/08/07/how-much-does-it-really-cost-to-get-a-security-clearance/", "passage_text": "Based on the number and type of each investigation, the weighted average cost is about $1230 per investigation. The total cost of a security clearance includes the investigation, adjudication, and front-end processing and maintenance costs. The cost of investigations is published by OPM."}, {"url": "http://www.your-poc.com/security-clearance-101/", "passage_text": "The cost of clearance adjudication is paid for by government agencies. Adjudication times can range from 0 minutes to about 17 hours depending on the type of investigation and the complexity/seriousness of issues involved. The data shown in the chart (below) is based on all DoD clearance adjudications."}]