[{"url": "https://en.wikipedia.org/wiki/Ammonium", "passage_text": "It is formed by the protonation of ammonia (NH 3). Ammonium is also a general name for positively charged or protonated substituted amines and quaternary ammonium cations (NR 4 +), where one or more hydrogen atoms are replaced by organic groups (indicated by R). Ammonium cation is found in a variety of salts such as ammonium carbonate, ammonium chloride, and ammonium nitrate. Most simple ammonium salts are very soluble in water. An exception is ammonium hexachloroplatinate, the formation of which was once used as a test for ammonium."}, {"url": "http://www.answers.com/Q/What_is_the_chemical_symbol_for_ammonium", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Adam Hackett. Confidence votes 34. Ammonia is a compound made of Nitogen and Hydrogen with compound formula NH3 Ammonium is an ionized form of Ammonia which has the chemical symbol NH4. "}, {"url": "https://en.wikipedia.org/wiki/Ammonia", "passage_text": "Ammonia or azane is a compound of nitrogen and hydrogen with the formula NH 3. It is a colourless gas with a characteristic pungent smell. Ammonia contributes significantly to the nutritional needs of terrestrial organisms by serving as a precursor to food and fertilizers. Ammonia is a colourless gas with a characteristic pungent smell. It is lighter than air, its density being 0.589 times that of air. It is easily liquefied due to the strong hydrogen bonding between molecules; the liquid boils at −33.3 °C (−27.94 °F), and freezes at −77.7 °C (−107.86 °F) to white crystals."}, {"url": "http://chemistry.about.com/od/molecularformulas/a/Ammonia-Molecular-Formula.htm", "passage_text": "Ammonia is a gas at ordinary room temperature and pressure. The chemical or molecular formula for ammonia is NH 3. By Anne Marie Helmenstine, Ph.D. "}, {"url": "http://www.waterboards.ca.gov/water_issues/programs/swamp/docs/cwt/guidance/3310en.pdf", "passage_text": "Ammonia is a nutrient that contains nitrogen and hydrogen. Its chemical formula is NH 3 in the un-ionized state and NH 4+ in the ionized form. Total ammonia is the sum of both NH 3 and NH 4+ . Total ammonia is what is measured analytically in water. "}, {"url": "http://www.chemicalformula.org/ammonium", "passage_text": "The ammonium ion is a positively charged ion or cation and has the chemical formula, NH 4 +. Ammonium salts are commonly used in fertilizers. Examples of compounds containing the ammonium ion include, ammonium nitrate, NH 4 NO 3 and ammonium sulfate, (NH 4) 2 SO 4. The ammonium ion is formed by the neutralization of the base ammonia, NH 3 with and acid. NH 3 + HNO 3 4 NO 3. NH 3 + H 2 SO 4 4) 2 SO 4. The ammonium ion has one co-ordinate covalent bond which involves the nitrogen atom donating two electrons in one of the N-H bonds."}, {"url": "https://en.wikipedia.org/wiki/Ammonium", "passage_text": "The ammonium cation is a positively charged polyatomic ion with the chemical formula NH 4 + . Ammonium cation is found in a variety of salts such as ammonium carbonate, ammonium chloride, and ammonium nitrate. Most simple ammonium salts are very soluble in water. An exception is ammonium hexachloroplatinate, the formation of which was once used as a test for ammonium."}, {"url": "https://answers.yahoo.com/question/index?qid=20091203172213AAOnCOr", "passage_text": "Best Answer: Ammonia does not have a symbol, it has the formula NH3. N and H are symbols for nitrogen and hydrogen respectively, which are elements. Only elements have symbols. Ammonia does not have a symbol but a chemical formula NH3 is ammonia NH4 is ammonium cation it is a positively charged polyatomic cation. Source(s): AP Chem student. EDFF · 6 years ago. Thumbs up."}]