[{"url": "http://www.ehow.com/info_8301853_salary-masters-economics.html", "passage_text": "Beginning Salaries. Recipients of a master's degree in economics can expect an average starting salary of $58,000 a year, according to a 2010 salary survey by the National Association for Business Economics (NABE)."}, {"url": "http://www.ehow.com/info_8301853_salary-masters-economics.html", "passage_text": "Economist Salaries. Annual salaries for economists ranged from $44,720 to more than $153,000 a year, with an average of $96,320 a year, the BLS reported in 2009. BLS data indicate that economists work in consulting firms and federal, state and local government agencies."}, {"url": "http://study.com/articles/Salary_of_an_Economics_Major_How_Much_Do_Graduates_Earn.html", "passage_text": "While graduates holding bachelor's degrees tend to be at the lower end of the salary scale, the type of bachelor's degree held can make a difference in salary. For example, according to PayScale.com in August 2014, financial analysts with Bachelor of Arts in Economics degrees earned between $41,398 and $76,351. Financial analysts with Bachelor of Science degrees earned $39,531-$74,918."}, {"url": "http://study.com/articles/Salary_of_an_Economics_Major_How_Much_Do_Graduates_Earn.html", "passage_text": "Salaries of Economics Majors: Overview. According to the U.S. Bureau of Labor Statistics (BLS), general economists held 16,900 jobs in 2012. Nearly half of them worked for the government. Economists generally need to earn master's degrees or PhDs to work in the field."}, {"url": "http://study.com/articles/Salary_of_an_Economics_Major_How_Much_Do_Graduates_Earn.html", "passage_text": "For most careers, the city an employee resides in can make a difference in salary. Below is a list of some popular cities for graduates with bachelor's degrees in economics and corresponding median salaries, based on PayScale.com 's August 2014 data. Bachelor of Arts: 1  New York: $68,693. 2  Chicago: $62,288."}, {"url": "http://www.ehow.com/info_8301853_salary-masters-economics.html", "passage_text": "Other business economists have general administrative duties and others work in market research. NABE's 2010 salary survey reported that men and women with master's degrees in economics earned an average salary of $100,380 a year, $9,000 a year more than the average salary earned by bachelor's degree recipients."}]