[{"url": "http://www.hairtransplantclinicdubai.com/", "passage_text": "HAIR TRANSPLANT IN DUBAI. Hair transplant in Dubai is a high demand procedure and an affordable treatment for hair loss problem. Hair loss or baldness is a major concern for many male and female. It is remarkably increasing high due to many reasons. A successful hair transplant can change your life"}, {"url": "http://www.hairtransplantindubaicost.com/", "passage_text": "The cos of FUE hair transplant starts from AED 15, as the number of grafts are more ,we have a promotion going in the month of November and the cost is AED 17,500 for 2500 grafts. We have a free consultation and get a detailed analysis. Good clinics with experienced and well trained doctors will charge an average of AED 12 to 15 per graft (US $ 3 TO 4 approximately). If you are planning to have hair transplantation in Dubai, then you must do your due diligence. Seeing the results is the most confident building aspect of your selection. You will see a lot of hype as you will visit a few clinics in Dubai—you will be able separate the wheat from the chaff after a few clinic visit"}, {"url": "http://www.whatclinic.com/hair-loss/united-arab-emirates/dubai/hair-transplant", "passage_text": "Choose from 22 Hair Transplant Clinics in Dubai and compare prices, patient reviews, and availability. Find the Best Price for Hair Transplant in Dubai. Compare how much Hair Transplant cost at all 22 clinics and save money on your treatment. "}, {"url": "http://www.maximhairrestoration.com/locations/dubai/", "passage_text": "MAXIM Hair Clinic in Dubai, U.A.E, offers both the conventional strip hair transplant procedure (Follicular Unit Transplant) as well as the new and advance NO stitch, No scar Follicular Unit Extraction (FUE) hair transplant technique. "}, {"url": "http://www.hairtransplantdubai.com/", "passage_text": "Cost of hair transplant in Dubai varies significantly from one physician to another depending on the technique being used and the surgical skills of the person performing the procedure. There are two major types of hair transplant depending on the extraction of graft strips or follicle units from the donor area. The first one is Follicular Unit Transplantation (FUT) while the other one is Follicular Unit Extraction (FUE)."}, {"url": "http://www.hairtransplantclinicdubai.com/hair-transplant/hair-transplant-cost-in-dubai/", "passage_text": "Cost of Hair Transplant in Dubai. The cost of hair transplant in Dubai is a key element in decision making for everybody. However, the cost of hair transplant varies person to person, according to one’s need and choice of technique. It is important for us to know the amount of hair loss that needs restoration. There are several ways used to calculate the cost of hair transplant in dubai depending upon how much hair someone wants to be transplanted and how much area desires to recover. The cost is often calculated per graft transplanted"}, {"url": "http://www.hairtransplantindubaicost.com/", "passage_text": "As mentioned above, there is a very wide range of fees for hair transplantation in Dubai. Some low key clinics may charge AED 5 per graft (approximately US $ 1.30). At the other end of the spectrum, there are clinics charging up to AED 35 plus per graft (US $ 10). Good clinics with experienced and well trained doctors will charge an average of AED 12 to 15 per graft (US $ 3 TO 4 approximately). If you are planning to have hair transplantation in Dubai, then you must do your due diligence. Seeing the results is the most confident building aspect of your selection. You will see a lot of hype as you will visit a few clinics in Dubai—you will be able separate the wheat from the chaff after a few clinic visits"}, {"url": "http://www.hairtransplantdubai.com/", "passage_text": "Generally the cost of FUE hair transplants can range between US $4 per graft to US $15 per graft. Cost of FUT hair transplant in Dubai, on the other hand, can range between US $2 and US $10 per graft. Some clinics also offer discount for larger number of grafts, but you need to discuss this during initial consultation. There are two major types of hair transplant depending on the extraction of graft strips or follicle units from the donor area. The first one is Follicular Unit Transplantation (FUT) while the other one is Follicular Unit Extraction (FUE)."}]