[{"url": "http://www.southernlightsbistro.com/", "passage_text": "Southern Lights is a neighborhood bistro specializing in fresh, innovative, seasonal cuisine as well as the classics."}, {"url": "http://www.southernlightsbistro.com/", "passage_text": "A gathering place for foodies for close to three decades, the bistro is an award-winning, four-star restaurant that gives a pan-cultural nod to the modern American menu with a focus on local ingredients."}, {"url": "http://www.houzz.com/pro/southernlights3/southern-lights-bistro", "passage_text": "Follow. For almost 28 years, we continue to serve food known for its fresh quality, innovative presentations and eclectic options. Enjoy a nice soup for lunch, a cup of coffee and dessert while reading your newspaper or stop by the bar for a drink. Come in today and taste what we have to offer you."}, {"url": "http://southernlightsofnc.com/", "passage_text": "Specializing in design, installation and management for both residential and commercial properties, Southern Lights is fully licensed, insured, and utilizes only the highest quality and environmentally friendly green products with life time warranty."}, {"url": "http://www.houzz.com/pro/southernlights3/southern-lights-bistro", "passage_text": "For almost 28 years, we continue to serve food known for its fresh quality, innovative presentations and eclectic options. Enjoy a nice soup for lunch, a cup of coffee and dessert while reading your newspaper or stop by the bar for a drink. Come in today and taste what we have to offer you."}, {"url": "http://cruiseadvice.org/CruiseShips/MainDiningRoom.aspx?ShipName=carnival+magic", "passage_text": "Carnival Magic Main Dining Rooms: the Northern Lights and the Southern Lights."}, {"url": "http://www.southernlightsbistro.com/", "passage_text": "Additional parking, catering and special event accommodation and The Gallery at Southern Lights – featuring local artists and artisans – round out the added amenities at the 2415-A Lawndale Drive location."}, {"url": "http://southernlightsofnc.com/", "passage_text": "Welcome to Southern Lights. Southern Lights Landscape Lighting is the leading full-service provider of outdoor landscape lighting design and installation in Greensboro, North Carolina, and surrounding Piedmont Triad areas of Summerfield, Oak Ridge, Kernersville, Stokesdale, Colfax, and Brown Summit."}]