[{"url": "http://www.emedicinehealth.com/peripheral_vascular_disease/article_em.htm", "passage_text": "Peripheral vascular disease refers to any disease or disorder of the circulatory system outside of the brain and heart. 1  Although the term peripheral vascular disease can include any disorder that affects any of the blood vessels, it often is used as a synonym for peripheral artery disease."}, {"url": "http://www.webmd.com/heart-disease/peripheral-vascular-disease?print=true", "passage_text": "Peripheral Vascular Disease Overview. Peripheral vascular disease, also called PVD, refers to any disease or disorder of the circulatory system outside of the brain and heart. The term can include any disorder that affects any blood vessels. It is, though, often used as a synonym for peripheral artery disease. PVD is the most common disease of the arteries."}, {"url": "http://www.fatsoflife.com/health-effects-of-fats-vascular-disease/", "passage_text": "Vascular disease affects the circulatory system, the body’s network of arteries, veins and capillaries that carries nutrients and oxygen to the tissues and removes carbon dioxide and other wastes. The cardiovascular system includes both the heart and blood vessels, including the loop through the lungs."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/atherosclerosis/", "passage_text": "Atherosclerosis is a disease in which plaque builds up inside your arteries. Arteries are blood vessels that carry oxygen-rich blood to your heart and other parts of your body. Plaque is made up of fat, cholesterol, calcium, and other substances found in the blood. Over time, plaque hardens and narrows"}, {"url": "https://www.sharecare.com/health/vascular-disease/what-parts-body-affect-pvd", "passage_text": "Peripheral vascular disease (PVD) refers to blockage disease of the blood vessels outside of the brain and heart. It can mean the arteries, which bring blood to the tissues, or the veins, which drain blood from the tissues back to the heart."}, {"url": "https://www.sharecare.com/health/vascular-disease/what-parts-body-affect-pvd", "passage_text": "Peripheral vascular disease (PVD) can affect many different arteries, including arteries of the legs, kidneys, arteries to the intestines and the carotid arteries that go to the brain."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/pad/", "passage_text": "Peripheral arterial disease (P.A.D.) is a disease in which plaque (plak) builds up in the arteries that carry blood to your head, organs, and limbs. Plaque is made up of fat, cholesterol, calcium, fibrous tissue, and other substances in the blood."}]