[{"url": "http://www.sierraflowerfinder.com/en/f/flowers-fillers/bouvardia/44?page=1&flt=0", "passage_text": "Sierra Flower Finder is dedicated to the professional floral community by Sierra Flower Trading. Through this collaborative site, we are creating the opportunity for breeders, growers, wholesalers and florists to share their knowledge and passion for the incredible diversity of flowers that make our industry so unique."}, {"url": "http://www.theflowerexpert.com/content/aboutflowers/flower-meanings", "passage_text": "Flowers are a part of the most important occasions in our lives. They are conspicuously present on birthdays, funerals, graduation, weddings, etc. forming an integral part of our lives. Some flowers have religious significance too. It is impossible for any person to be completely unaware of flower meanings. However, meanings are associated not only with roses but also with other flowers. Most people do not consider flower meanings before gifting flowers. Similarly, people who receive flowers may not know their meaning and hence miss the underlying message."}, {"url": "http://www.theflowerexpert.com/content/aboutflowers/flower-meanings", "passage_text": "Calla Lily symbolizes magnificence and beauty. White Calla lilies combine these two attributes with purity and innocence associated with the color white to make it the perfect choice of flower in a Wedding bouquet. View Collection. Carnation symbolizes pride and beauty. However, meanings are associated not only with roses but also with other flowers. Most people do not consider flower meanings before gifting flowers. Similarly, people who receive flowers may not know their meaning and hence miss the underlying message."}, {"url": "http://www.ebay.com/sch/i.html?_nkw=bouvardia", "passage_text": "Tell us what you think. This is the median price based on sales of this product in the same condition from all listings on ebay.com in the past 14 days, or if there are any insufficient number of listings for a meaningful calculation, the past 90 days. Top Rated Plus. "}, {"url": "http://www.logees.com/hummingbird-flower-bouvardia-ternifolia.html", "passage_text": "Hummingbird Flower (Bouvardia ternifolia). A never-ending display of brilliant saffron orange is brought forth to any sunny window or conservatory by this free-branching, upright grower. Clusters of these eye-catching blooms appear on the growing tips. Best of all, after a hard pruning, they quickly come back into flower. "}, {"url": "http://www.facebook.com/bouvardianailspa", "passage_text": "Well Bouvardia Day Spa has the perfect gift for you!!! Get a relaxing massage, a rejuvenating facial, a deluxe pedicure and a complimentary glass of wine on the day all for just $550 (that's a savings of over $200). Don't be left in the cold the Valentines!!!! This weekend at Bouvardia Day Spa get a rejuvenating facial, professional eyebrow shaping and a relaxing hand massage....ALL FOR JUST $230 (that's a savings of over $100!!!) Book today or tell a friend!!!! Like Comment."}, {"url": "http://www.plantdelights.com/Bouvardia-for-sale/buy-Hummingbird-Flower/Perennial-Flowers/?view_all", "passage_text": "More Information about Bouvardia. The genus Bouvardia contains around 49 species that are native to the tropical Americas. Bouvardia species are herbaceous perennials between 1' and 4' tall that produce attractive clusters of tubular flowers at the tips of the branches in shades of red, pink, yellow, and white. Even if you are not familiar with bouvardia, you may have seen them as fragrant cut-flowers that can last a week or more in a vase. In the language of flowers, bouvardia represents enthusiasm or zest for life. Bouvardia is also sold as a long-blooming house plant. The bright colors and tubular shape of Bouvardia flowers attract butterflies and hummingbirds (enthusiastic ones, I presume) to the garden"}, {"url": "http://www.teleflora.com/meaning-of-flowers/bouvardia", "passage_text": "Their star-like flowers grow in clusters on thin, branching stems, like small flower bouquets in soft shades of pink, white, yellow, salmon and red. With a delicate scent and feminine appearance, in the language of flowers, bouvardia represent enthusiasm. View more on our Flower Type Meaning Page. Shop for Bouvardia. Named after Charles Bouvard, the personal physician to Louis XIII and the superintendent of the Royal Gardens in Paris, modern varieties of bouvardia have names such as Pink Luck, Albatross and Royal Katty."}]