[{"url": "http://www.ebay.com/sch/i.html?_nkw=how+to+block+a+seller", "passage_text": "how to block a seller. Follow how to block a seller to get e-mail alerts and updates on your eBay Feed. Unfollow how to block a seller to stop getting updates on your eBay Feed. Yay! You're now following how to block a seller in your eBay Feed"}, {"url": "http://www.wikihow.com/Block-Someone-on-eBay", "passage_text": "Go to eBay’s “Managing Bidding and Buyers” overview page found at: http://pages.ebay.com/help/sell/manage_bidders_ov.html. 4. Navigate to the subsection on the landing page entitled “Blocking bidders and buyers. ”. 5. Click on the link in this section that reads, “Block bidders or buyers from your listings page. ”. 6. Type in the eBay username of the user you want added to your blocked list. 1  If you are entering multiple eBay usernames, separate each name with a comma. "}, {"url": "http://www.ehow.com/how_8165737_block-sellers-ebay.html", "passage_text": "Click the circle next to Specific sellers (enter seller's user IDs).. Click the drop-down menu under Specific sellers (enter seller's user IDs), and select Exclude.. Enter the seller's ID to the right of Exclude.. If you wish to exclude multiple sellers, place a space or comma between the series of IDs. Click the bottom Search button to perform you search with your list of sellers blocked from the results. Instructions. Go to the ebay.com home page, and log in if you have an account. If you do not have an account, you can still use the advanced search feature. Click Advanced to the right of the top Search button."}, {"url": "http://pages.ebay.co.uk/help/sell/manage_bidders_ov.html", "passage_text": "To add buyer requirements to all of your listings: Go to the Account tab in My eBay, and select Site preferences. Under Selling preferences, click Show next to Buyer requirements, and then click Edit. On the Buyer Requirements page, select your buyer requirements. Blocking bidders and buyers. If you don't want to sell to certain members, you can put their user IDs on your blocked list. Members on the list can't bid on any of your listings until you remove them from the list."}, {"url": "http://pages.ebay.co.uk/help/sell/manage_bidders_ov.html", "passage_text": "To remove a member from your blocked list: Go to the Block bidders or buyers from your listings page. Delete the user ID of the member from the text box. Click Submit. Note: You should inform members after you remove them from your blocked list, so they can resume bidding on your items. Blocking bidders and buyers. If you don't want to sell to certain members, you can put their user IDs on your blocked list. Members on the list can't bid on any of your listings until you remove them from the list."}, {"url": "http://pages.ebay.com/help/sell/manage_bidders_ov.html", "passage_text": "To add a member to your blocked list: Go to the Block bidders or buyers from your listings page. Enter the usernames of the members you want to block. Click Submit. To remove a member from your blocked list: Go to the Block bidders or buyers from your listings page. Delete the username of the member from the text box."}, {"url": "http://pages.ebay.com/services/buyandsell/biddermanagement.html", "passage_text": "You can add or delete bidders/buyers at any time. Add an eBay user to my Blocked Bidder/Buyer List. Buyer Block Exemption List. If you've already set up buyer blocks but you want to let certain users through regardless of the blocks you've set, you can create a list of specific, exempt users. You can use the buyer block exemption list to let specific users through, regardless of the blocks you've se"}, {"url": "http://pages.ebay.com.au/help/sell/manage_bidders_ov.html", "passage_text": "Blocking bidders and buyers. If you don't want to sell to certain members, you can put their user IDs on your blocked list. Members on the list can’t bid on any of your listings until you remove them from the list. You can block up to 5,000 user IDs. To add buyer requirements to all of your listings: In My eBay, place your pointer over the Account tab, and then select Site preferences. In the Buyer requirements section, click the Show link, and then click the Edit link. On the Buyer Requirements page, select your buyer requirements."}, {"url": "http://pages.ebay.com.au/help/sell/manage_bidders_ov.html", "passage_text": "To add a member to your blocked list: Go to the Block bidders or buyers from your listings page. Enter the user IDs of the members you wish to block. Click the Submit button. To remove a member from your blocked list: Go to the Block bidders or buyers from your listings page. Delete the user ID of the member from the text box. Click the Submit button. Note: You should inform members after you remove them from your blocked list, so they can resume bidding on your items. To add buyer requirements to all of your listings: In My eBay, place your pointer over the Account tab, and then select Site preferences. In the Buyer requirements section, click the Show link, and then click the Edit link. On the Buyer Requirements page, select your buyer requirements."}]