[{"url": "https://answers.yahoo.com/question/index?qid=20110103051609AA9rGLL", "passage_text": "Report Abuse. Veritable is an adjective most often incorrectly used in place of virtual. The difference is that virtual is based in essence of fact, whereas veritable is based solely in fact. yes of course i&#39;ve looked through the online dictionaries and sites but i still don&#39;t understand the meaning. could anyone please give me a definition that&#39;s pg rated cuz i&#39;m kinda dumb lols xD thank u a lot. Source(s): 39 veritable 39 mean: https://biturl.im/T1LlX. Chana · 2 months ago. Thumbs up. 0."}, {"url": "https://answers.yahoo.com/question/index?qid=20110103051609AA9rGLL", "passage_text": "RE: what does &#39;veritable&#39; mean? what does &#39;veritable&#39; mean?? yes of course i&#39;ve looked through the online dictionaries and sites but i still don&#39;t understand the meaning. could anyone please give me a definition that&#39;s pg rated cuz i&#39;m kinda dumb lols xD thank u a lot. Source(s): 39 veritable 39 mean: https://biturl.im/T1LlX. Chana · 2 months ago. Thumbs up. 0."}, {"url": "http://www.definitions.net/definition/veritable", "passage_text": "a regular morass of details; a regular nincompoop; he's a veritable swine. authentic, bona fide, unquestionable, veritable (adj). not counterfeit or copied. an authentic signature; a bona fide manuscript; an unquestionable antique; photographs taken in a veritable bull ring. "}, {"url": "http://www.answers.com/Q/What_is_the_Meaning_of_veritable", "passage_text": "Their means belonging to them.. The homophone of there/their/they're    There refers  to some place.  Their is the  possessive pronoun of them or themselves. …  They're is a contraction or shortening of 'they are'.     The homophone of there/their/they're      There refers to some place.   Their  is the possessive pronoun of them or themselves"}, {"url": "http://english.stackexchange.com/questions/95864/font-fount-of-information", "passage_text": "2. He is a veritable font of information. He is a veritable fount of information. source, fountain (a font of information). I have seen it both ways: He is a veritable font of information. He is a veritable fount of information. The first is referenced by M-W 's definition and seems to match the pronunciation I'm used to: source, fountain (a font of information). The second seems equally sensible given that 'fount' can be an abbreviation for 'fountain'. "}, {"url": "http://www.audioenglish.org/dictionary/veritable.htm", "passage_text": "Don't count your chickens before they're hatched.. (English proverb). There are many good moccasin tracks along the trail of a straight arrow. (Native American proverb, Sioux). The whisper of a pretty girl can be heard further than the roar of a lion. (Arabic proverb). He who injures with the sword will be finished by the swor"}, {"url": "http://www.answers.com/Q/What_does_veritable_plethora_mean", "passage_text": "A veritable plethora is a great and genuine excess of something. Veritable means, being truly or very much so, and a plethora is, an overabundance or excess.. "}, {"url": "http://www.answers.com/Q/What_is_the_Meaning_of_veritable", "passage_text": "A veritable plethora is a great and genuine excess of something. Veritable means, being truly or very much so, and a plethora is, an overabundance or excess.. 5 people found this useful. The homophone of there/their/they're    There refers  to some place.  Their is the  possessive pronoun of them or themselves. …  They're is a contraction or shortening of 'they are'.     The homophone of there/their/they're      There refers"}, {"url": "http://www.urbandictionary.com/define.php?term=Veritable", "passage_text": "Veritable. From the Latin word veritas meaning truth, it means literally, indicating that the statement qualified by the adjective is in no way an exaggeration. Me: I have a veritable plethora of girlfriends! My lackey: For sooth!"}, {"url": "https://answers.yahoo.com/question/index?qid=20110103051609AA9rGLL", "passage_text": "In most cases the use of veritable is superfluous, meaning that whoever's using it is being wordy and trying to sound smarter than they actually are. Synonyms are: authentic, bona fide, genuine, regular, and unquestionable. It is an archaic word which doesn't see much use in modern speech. yes of course i&#39;ve looked through the online dictionaries and sites but i still don&#39;t understand the meaning. could anyone please give me a definition that&#39;s pg rated cuz i&#39;m kinda dumb lols xD thank u a lot. Source(s): 39 veritable 39 mean: https://biturl.im/T1LlX. Chana · 2 months ago. Thumbs up. 0."}]