[{"url": "http://www.answers.com/Q/What_is_the_scientific_name_for_an_Elephant", "passage_text": "The other two species, Loxodonta africana and L. cyclotis, are found in Africa. No, Loxodonta is the scientific genus for African elephants. Asian elephants are of the genus elephas, and are closely related to the mammoth.   The full scientific name for the Asian Elephant is Elephas maximus. Make sure when you write the full name for a creature the genus is capitalized and the species is lowercase and that it is written in italics if you are handwriting the name then you can underline it."}, {"url": "http://www.answers.com/Q/What_is_the_scientific_name_of_the_african_elephant", "passage_text": "Elephas maximus elephas Maximus asianis elephantis Elephas maximum Elephus maximus Elephas maximus is the scientific, Latin or binomial name for the Asian elephant. It i … s one of three surviving elephant species. Of the three, it is the only genus to be found in Asia."}, {"url": "http://www.iucnredlist.org/details/12392/0", "passage_text": "Preliminary genetic evidence suggests that there may be at least two species of African elephants, namely the Savanna Elephant (Loxodonta africana) and the Forest Elephant (Loxodonta cyclotis). A third species, the West African Elephant, has also been postulated."}, {"url": "http://www.answers.com/Q/What_is_the_scientific_name_for_an_Elephant", "passage_text": "However, a scientific name is the genus and species. African Bush Elephants, African Forest Elephants and Asian Elephants each … have their own scientific names. Even the extinct North African Elephant has a scientific name."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20100417075023AAqf1LE", "passage_text": "The Elephas genus has one surviving species: 1. Elephas maximus (ASIAN ELEPHANT). The Loxodonta genus has two surviving species: 1. Loxodonta africana (AFRICAN BUSH ELEPHANT) and 2. Loxodonta cyclotis (AFRICAN FOREST"}, {"url": "http://www.answers.com/Q/What_is_the_scientific_name_of_the_african_elephant", "passage_text": "The scientific name of the African Elephant is Loxodonta africana. The scientific name of the African Elephant is Loxodonta africana. Loxodonta africana. Loxodonta africana. The scientific or taxonomic name would be"}]