[{"url": "http://www.mymoneyblog.com/southwest-airlines-rapid-rewards-premier-card-new-bonus-worth-800-in-airfare-500-in-amazon-gift-cards.html", "passage_text": "Southwest has brought back their 50,000 point limited-time promo for the Southwest Airlines® Rapid Rewards® Premier Credit Card. Card applicants* can get 50,000 points after you spend $2,000 on purchases in the first 3 months of opening your account. Update: Received my 50000 points from Southwest and redeemed them for $500 in Walmart cards. I’m hoping when I cancel the card I can get the $99 credited to my account. Next up…..my wife’s card for another $500."}, {"url": "http://www.frugaltravelguy.com/2014/01/stocking-up-on-points-and-miles-southwest-rapid-rewards.html", "passage_text": "1 Southwest Airlines Rapid Rewards Plus Credit Card (50,000 points after $2,000 spent within 3 months). 2  Southwest Airlines Rapid Rewards Premier Business Card (50,000 points after $2,000 spent within 3 months). Even though the program will devalue Wanna Get Away fares in March, it’s still a good option for domestic travel. Currently, points can be redeemed at a rate of 60 points per $1, though this number will increase to 70 points on March 31, 2014."}, {"url": "http://millionmilesecrets.com/2012/12/13/southwest-transfer-points/", "passage_text": "If you apply for 2 Southwest credit cards and spend $2,000 on each of them and the points post to your account in 2013, you will have earned 104,000 points out of the 110,000 points needed for the Southwest Companion Pass. The points posted to my Southwest account on November 19, 2012 (1 day) and they counted towards the Companion Pass. However, the terms said “ Please allow up to 4-6 weeks for the miles to appear in your frequent flyer account."}, {"url": "http://millionmilesecrets.com/2012/12/13/southwest-transfer-points/", "passage_text": "The cheapest way is to buy 18,000 Choice hotel points for $198 and transfer them to 5,400 Southwest points. 5,400 Southwest points are worth ~$90, so your net cost is $108. Here’s a post on 10 different ways to earn Companion Qualifying points on Southwest. The points posted to my Southwest account on November 19, 2012 (1 day) and they counted towards the Companion Pass. However, the terms said “ Please allow up to 4-6 weeks for the miles to appear in your frequent flyer account."}, {"url": "https://www.southwest.com/html/generated/help/faqs/rapid_rewards_earning_points_faq.html", "passage_text": "A Business Select Fare earns 12 points per dollar, while Anytime and Wanna Get Away ® Fares earn ten and six points per dollar, respectively. NOTE: A-List and A-List Preferred Members earn 25% and 100% more points, respectively, than regular Members. You can earn points on electronic revenue tickets. "}, {"url": "http://www.rewards-insiders.marriott.com/thread/7909", "passage_text": "I could never tell. Sometimes my points are there 3 days after my credit card has been charged,sometimes it takes 7 days. You can quicken the process by getting pre-settlements of your charges, they will be added to your account before you complete your stay. "}, {"url": "https://www.southwest.com/html/generated/help/faqs/rapid_rewards_tiers_faq.html", "passage_text": "How do I qualify for a Companion Pass? To qualify for a Companion Pass, you will need to earn 110,000 Companion Pass Qualifying Points from any combination of Southwest Airlines flights and Rapid Rewards Partners per calendar year, or fly 100 Southwest Airlines qualifying one-way flights per calendar year. "}, {"url": "http://www.southwestvacations.com/generalinformation/about-rapid-rewards", "passage_text": "Missing Rapid Rewards points may be requested up to 6 months from the qualifying stay. Please allow 30 days after completion of stay for the Rapid Rewards points to be credited to your account. If you are not already a Rapid Rewards member, you may enroll at southwest.com. If you are not already an M life member, you may enroll at mlife.com. To enroll in Rapid Rewards, complete the online enrollment form at southwest.com or call 800-445-5764 today. After completing the enrollment form, you will receive your account number. Provide this account number each time you fly on Southwest Airlines to receive Rapid Rewards points for your flight."}, {"url": "http://thepointsguy.com/2014/01/maximize-monday-southwest-companion-pass-faq-and-strategies/", "passage_text": "The break-even point would be Wanna Get Away fares that cost under $450 – the cost of a ticket that would require 25,000 Rapid Rewards points. However, if you have the Companion Pass and use 25,000 points to book one $450 ticket, you can book another $450 ticket for free – giving you $900 in value. "}]