[{"url": "http://www.spiegel.de/international/world/australia-debates-how-to-protect-the-great-barrier-reef-a-900911.html", "passage_text": "Australia's Great Barrier Reef is rapidly losing its coral, to the point that UNESCO may soon place the natural wonder on its in danger list. Climate change is one culprit, but so is the country's booming extraction industry. Environmentalists warn that time is running out for the reef. Australian scientists have calculated that the Great Barrier Reef, the earth's largest living organism, has lost half of its coral in the last 27 years, and coral death is only accelerating. One reason is that Australia feels the effects of climate change earlier and more strongly than elsewhere."}, {"url": "http://www.gbrmpa.gov.au/about-the-reef/facts-about-the-great-barrier-reef", "passage_text": "The Great Barrier Reef Marine Park stretches approximately 2300 km along the coast of Queensland in north-eastern Australia – this is about the same length as the west coast of the USA from Vancouver to the Mexican border. Covering 344,400km2 Great Barrier Reef Marine Park is: 1  bigger than Victoria and Tasmania combined. 2  bigger than the United Kingdom, Switzerland and Holland combined. 3  roughly the same area as Japan, Germany, Malaysia or Italy. 4  approximately half the size of Texas. 5  slightly smaller than the entire Baltic Sea."}, {"url": "http://www.nytimes.com/2014/09/16/world/asia/wary-of-un-action-australia-unveils-plan-to-aid-great-barrier-reef.html", "passage_text": "Continue reading the main story. Continue reading the main story. SYDNEY, Australia — In a bid to keep the Great Barrier Reef from being reclassified by the United Nations as “in danger,” the Australian government on Monday unveiled a 35-year plan to manage risks to the reef, one of the natural wonders of the world. But conservationists warned that the plan did not go far enough. "}, {"url": "http://www.australia.gov.au/about-australia/australian-story/great-barrier-reef", "passage_text": "Great Barrier Reef. The Great Barrier Reef. Image courtesy of the Great Barrier Reef Marine Park Authority. The Great Barrier Reef is the only living organic collective visible from Earth's orbit. The Great Barrier Reef, off the east coast of Australia, is one of the wonders of the natural world-it is the world's largest coral reef ecosystem. It was declared a World Heritage area in 1981 and added to the National Heritage List in 2007. "}, {"url": "http://www.spiegel.de/international/world/australia-debates-how-to-protect-the-great-barrier-reef-a-900911.html", "passage_text": "The 2,300-kilometer (1,430-mile) Great Barrier Reef, off the coast of Queensland in northeastern Australia, is a natural wonder. It is home to a quarter of all species that exist in the world's oceans. In 1981, it became the first ocean region to be declared a UNESCO World Heritage site. Australian scientists have calculated that the Great Barrier Reef, the earth's largest living organism, has lost half of its coral in the last 27 years, and coral death is only accelerating. One reason is that Australia feels the effects of climate change earlier and more strongly than elsewhere."}, {"url": "http://www.bbc.co.uk/newsround/29802782", "passage_text": "Image caption The Great Barrier Reef is the world's largest coral structure and home to rich marine life. Image caption A colourful scene on the Great Barrier Reef off Australia's northeastern coast. A plan drawn up as a result, will be studied by the World Heritage Centre in January. Scientists says the condition of Australia's Great Barrier reef is getting worse and some of the corals are degrading. It's one of the seven natural wonders of the world and the only living thing on earth visible from space. Scientists says an Australian government plan to protect the Reef in the future won't work."}, {"url": "https://en.wikipedia.org/wiki/Great_Barrier_Reef", "passage_text": "The Great Barrier Reef is the world's largest coral reef system composed of over 2,900 individual reefs and 900 islands stretching for over 2,300 kilometres (1,400 mi) over an area of approximately 344,400 square kilometres (133,000 sq mi). The reef is located in the Coral Sea, off the coast of Queensland, Australia. The Great Barrier Reef can be seen from outer space and is the world's biggest single structure made by living organisms. This reef structure is composed of and built by billions of tiny organisms, known as coral polyps"}, {"url": "https://en.wikipedia.org/wiki/Great_Barrier_Reef", "passage_text": "The Great Barrier Reef has long been known to and used by the Aboriginal Australian and Torres Strait Islander peoples, and is an important part of local groups' cultures and spirituality. The reef is a very popular destination for tourists, especially in the Whitsunday Islands and Cairns regions. The reef is located in the Coral Sea, off the coast of Queensland, Australia. The Great Barrier Reef can be seen from outer space and is the world's biggest single structure made by living organisms."}, {"url": "https://en.wikipedia.org/wiki/Environmental_threats_to_the_Great_Barrier_Reef", "passage_text": "The Great Barrier Reef is the world's largest reef system, composed of roughly 3,000 individual reefs and 900 islands that stretch for 2,600 kilometres (1,616 mi) and cover an area of approximately 344,400 square kilometres (133,000 sq mi). On 31 January 2014, the GBRMPA issued a dumping permit that will allow three million cubic metres of sea bed from Abbot Point, north of Bowen, to be transported and unloaded in the waters of the Great Barrier Reef Marine Park."}, {"url": "https://en.wikipedia.org/wiki/Environmental_threats_to_the_Great_Barrier_Reef", "passage_text": "The reef is located in the Coral Sea, off the coast of Queensland in northeast Australia. A large part of the reef is protected by the Great Barrier Reef Marine Park. On 31 January 2014, the GBRMPA issued a dumping permit that will allow three million cubic metres of sea bed from Abbot Point, north of Bowen, to be transported and unloaded in the waters of"}]