[{"url": "http://depts.gpc.edu/~decms/ibim/musclesnmustis.htm", "passage_text": "A motor unit (a neuron and groups of muscle fibers) innervate and control muscle contraction. The unit contains a muscle endplate or organ, nerve (s), neuromuscular junction. Acetylcholine is the neurotransmitter in muscle that produce muscle contraction. Muscle tissue is enclosed in facia, which in turn is attached to other structures including ligament. There are three types of muscle tissues: skeletal, cardiac and smooth muscles. Muscle tissue provides a) posture and body support b) locomotion and c) heat production."}, {"url": "https://en.wikipedia.org/wiki/Muscle_contraction", "passage_text": "Muscle contraction is the activation of tension-generating sites within muscle fibers. In physiology, muscle contraction does not mean muscle shortening because muscle tension can be produced without changes in muscle length such as holding a heavy book or a dumbbell at the same position. Muscle contractions can be described based on two variables: length and tension. A muscle contraction is described as isometric if the muscle tension changes but the muscle length remains the same. In contrast, a muscle contraction is isotonic if muscle length changes but the muscle tension"}, {"url": "https://en.wikipedia.org/wiki/Skeletal_striated_muscle", "passage_text": "The myofibrils are composed of actin and myosin filaments, repeated in units called sarcomeres, the basic functional units of the muscle fiber. The sarcomere is responsible for the striated appearance of skeletal muscle, and forms the basic machinery necessary for muscle contraction. The term muscle refers to multiple bundles of muscle fibers called fascicles. All muscles also contain connective tissue arranged in layers of fasciae. Skeletal muscle is made up of individual muscle cells or myocytes, known as muscle fibers. They are formed from the fusion of developmental myoblasts (a type of embryonic progenitor cell that gives rise to a muscle cell) in a process known as myogenesis. Muscle fibres are cylindrical, and multinucleated."}, {"url": "http://depts.gpc.edu/~decms/ibim/musclesnmustis.htm", "passage_text": "There are three types of muscle tissues: skeletal, cardiac and smooth muscles. a. skeletal muscle: multinucleated, striated; attached to bones producing locomotion, general support and posture; producing heat. Contraction is voluntary, and not long-sustained. Muscle tissue is enclosed in facia, which in turn is attached to other structures including ligament. There are three types of muscle tissues: skeletal, cardiac and smooth muscles. Muscle tissue provides a) posture and body support b) locomotion and c) heat production."}, {"url": "http://encyclopedia2.thefreedictionary.com/muscle+relaxation", "passage_text": "All types of muscles consist of muscle fibers. Striated muscle fibers in skeletal muscles form bundles joined together by layers of connective tissue. The ends of muscle fibers are intertwined with tendon fibers, and through this combination muscular tension is transmitted to the skeletal bones. The combination of a motor nerve and the group of muscle fibers that it innervates is called the motor unit. Each branch of a motor nerve in a motor unit extends to a separate muscle fiber. All the muscle fibers that constitute such a unit contract almost simultaneously when they are excited."}, {"url": "https://en.wikipedia.org/wiki/Skeletal_striated_muscle", "passage_text": "Skeletal muscle is a form of striated muscle tissue which is under the voluntary control of the somatic nervous system. It is one of three major muscle types, the others being cardiac muscle and smooth muscle. Most skeletal muscles are attached to bones by bundles of collagen fibers known as tendons. Skeletal muscle is made up of individual muscle cells or myocytes, known as muscle fibers. They are formed from the fusion of developmental myoblasts (a type of embryonic progenitor cell that gives rise to a muscle cell) in a process known as myogenesis. Muscle fibres are cylindrical, and multinucleated."}, {"url": "https://en.wikipedia.org/wiki/Muscle_contraction", "passage_text": "The termination of muscle contraction is followed by muscle relaxation, which is a return of the muscle fibers to their low tension-generating state. Muscle contractions can be described based on two variables: length and tension. A muscle contraction is described as isometric if the muscle tension changes but the muscle length remains the same. In contrast, a muscle contraction is isotonic if muscle length changes but the muscle tension remains the same."}, {"url": "https://quizlet.com/9318007/muscle-contraction-flash-cards/", "passage_text": "When a motor neuron stimulates a muscle fiber, overlapping thick and thin filaments slide along one another and sarcomeres shorten. The combined shortening of many sarcomeres in many muscle fibers results in contraction of the whole muscle. Thick Filaments and its purpose. Thick filaments in a muscle fiber are made of many molecules of the protein myosin. Each myosin molecule has a fibrous tail region and a globular head. For clarity, only one head is shown here. Thin filaments are twisted chains made of the globular protein actin."}]