[{"url": "http://www.healthhype.com/causes-of-swollen-armpit-lymph-nodes.html", "passage_text": "One or more lymph nodes in one or both axilla (armpit) may become swollen commonly due to 1  : Injury to the armpit, arm or hand. 2  Localized infection in the armpit or of the arm, hand or breast, which drains into the axillary lymph nodes. Normally the lymph nodes are not palpable but may enlarge as a result of some disorder or disease. The lymph nodes of the axilla (armpit), inguinal region (groin), and neck tend to enlarge more frequently than other areas."}, {"url": "http://ww5.komen.org/BreastCancer/LymphNodeStatus.html", "passage_text": "Lymph nodes are small clumps of immune cells that act as filters for the lymphatic system. The lymphatic system runs throughout the body (like the circulatory (blood) system) and carries fluid and cells. The lymph nodes in the underarm (the axillary lymph nodes) are the first place breast cancer is likely to spread. Figure 4.4 shows the location of the axillary lymph nodes. Prognosis is poorer when cancer has spread to the lymph nodes (lymph node-positive). The more lymph nodes that contain cancer, the poorer prognosis tends to be [ 6 ]. For a summary of research studies on lymph node status and breast cancer survival, visit the Breast Cancer Research section."}, {"url": "http://ww5.komen.org/uploadedFiles/_Komen/Content/About_Breast_Cancer/Tools_and_Resources/Fact_Sheets_and_Breast_Self_Awareness_Cards/AxillaryLymphNodes.pdf", "passage_text": "They carry lymph fluid, cells and other material. Lymph nodes are small clumps of immune cells that act as filters for the lymphatic system. They also store white blood cells that help fight illness. Lymph nodes in the underarm are called the axillary [AK-sil-air-e] nodes. It is important to know if these nodes have cancer. This helps determine breast cancer stage. "}, {"url": "https://en.wikipedia.org/wiki/Axillary_lymph_nodes", "passage_text": "These lymph nodes are clinically significant in breast cancer, and metastases from the breast to the axillary lymph nodes are considered in the staging of the disease. About 75% of lymph from the breasts drains into the axillary lymph nodes, making them important in the diagnosis of breast cancer. A doctor will usually refer a patient to a surgeon to have an axillary lymph node dissection to see if the cancer cells have been trapped in the nodes."}, {"url": "http://www.webmd.com/a-to-z-guides/swollen-lymph-nodes-topic-overview", "passage_text": "1 Glands in the armpit (axillary lymph nodes) may swell from an injury or infection to the arm or hand. 2  A rare cause of axillary swelling may be breast cancer or lymphoma. 3  The lymph nodes in the groin (femoral or inguinal lymph nodes) may swell from an injury or infection in the foot, leg, groin, or genitals. Lymph nodes are small, bean-shaped glands throughout the body. They are part of the lymph system, which carries fluid (lymph fluid), nutrients, and waste material between the body tissues and the bloodstream. The lymph system is an important part of the immune system, the body's defense system against disease."}, {"url": "http://www.innerbody.com/image_lympov/lymp05-new.html", "passage_text": "Click to read more below. The axillary nodes are a group of lymph nodes located in the axillary (or armpit) region of the body. They perform the vital function of filtration and conduction of lymph from the upper limbs, pectoral region, and upper back. The axillary lymph nodes are a group of twenty to thirty large lymph nodes located in the deep tissues in and around the armpit. These nodes are arranged into five distinct groups: pectoral (anterior), lateral, subscapular (posterior), central (intermediate), and subclavicular (medial)...."}, {"url": "http://www.breastlink.com/breast-cancer-101/rare-breast-cancer-types/enlarged-axillary-lymph-nodes/", "passage_text": "The axillary (arm pit) lymph nodes filter and/or trap lymph from the arm, chest wall and breast. It is often difficult to feel normal axillary lymph nodes. Not all enlarged axillary lymph nodes feel the same. It is also important to mention that enlarged axillary lymph nodes are not necessarily a sign of cancer. "}, {"url": "http://www.breastcancer.org/treatment/surgery/lymph_node_removal/axillary_dissection", "passage_text": "Save as Favorite. There are three levels of axillary lymph nodes (the nodes in the underarm or axilla area): 1  Level I is the bottom level, below the lower edge of the pectoralis minor muscle. 2  Level II is lying underneath the pectoralis minor muscle. 3  Level III is above the pectoralis minor muscle. "}]