[{"url": "http://www.city-data.com/city/Steamboat-Springs-Colorado.html", "passage_text": "According to our research of Colorado and other state lists there were 6 registered sex offenders living in Steamboat Springs, Colorado as of October 06, 2015. The ratio of number of residents in Steamboat Springs to the number of sex offenders is 2,005 to 1."}, {"url": "http://www.city-data.com/city/Steamboat-Springs-Colorado.html", "passage_text": "1 Vectra Bank Colorado, National Association: Steamboat Springs Branch at 2155 Resort Drive, branch established on 1984/11/01; Lincoln Branch at 703 Lincoln, Suite B-106, branch established on 1999/03/01."}, {"url": "http://www.routthumane.org/", "passage_text": "Steamboat Springs Colorado is our home and we aim to assist animals in need in Routt County. We count on the generosity of our local community so that we can provide veterinary care for dogs, cats, and the occasional bunnies and ferrets at the Routt County Humane Society facility."}, {"url": "http://agner.co.routt.co.us/assessor/web/", "passage_text": "Cookies are required to use this site. Please enable cookies before continuing. Welcome. The Routt County Assessor's office welcomes you to our online property records search. This site is designed to provide you with a vast amount of data on properties located within Routt County."}, {"url": "http://www.co.routt.co.us/index.aspx?NID=204", "passage_text": "The Sheriff's office is responsible for law enforcement, investigations, and detentions within Routt County, Colorado. The Routt County Sheriff's office works hand-in-hand with community members to provide protection and service to our community as a whole."}, {"url": "http://steamboatsprings.net/index.aspx?nid=98", "passage_text": "Home | Departments | City Clerk. Mission Statement. The mission of the Steamboat Springs city clerk’s office is to be the information resource center for council, city staff, and the public for accurate and timely access to all official documents, activities, and publications."}, {"url": "http://routtcountyriders.org/", "passage_text": "A milestone is upon us: The first ever user-specific trail on Emerald Mountain has opened! This bike-only, downhill-only trail is like nothing else on the mountain. “NPR,” which stands for No Pedaling Required, is an intermediate flow trail."}]