[{"url": "http://www.airlinereporter.com/2010/11/how-to-get-good-seat-southwest-airlines/", "passage_text": "4. Sit near the front. Try to get the first window or aisle seat on the plane. Boarding passengers are always hoping to not have to get a center seat and will travel to the back of the plane hoping to find one. This means they will leave center seats in the front of the plane hoping for premium seat in the back."}, {"url": "https://www.pointswithacrew.com/can-save-seats-southwest-airlines-seating/", "passage_text": "If you want seats together, either fly an airline that lets you pick seats, pay for early bird, or make sure to get your boarding pass at the 24 hour mark like the rest of us. Or sit in the back. Jack on April 5, 2015 at 9:53 pm. Doing the things you suggest do NOT guarantee that passengers will be seated together."}, {"url": "http://www.ehow.com/how_4562673_good-seat-southwest-airlines.html", "passage_text": "Pay for Early Boarding. The best way to secure a good seat on a Southwest flight is to pay extra in advance. Upgrade to a Business Select Fare when you're booking, which is the earliest boarding group. You'll get onto a nearly empty plane and have your pick of seats."}, {"url": "http://www.airlinereporter.com/2010/11/how-to-get-good-seat-southwest-airlines/", "passage_text": "Love it or hate it, Southwest Airlines has a unique seating process. Where most airlines will assign you an exact seat, Southwest gives you a boarding number and you can choose any open seat in the plane."}, {"url": "http://www.seatguru.com/airlines/Southwest_Airlines/checkin.php", "passage_text": "Yes, you may check-in for your Southwest Airlines (WN) flight at the airport ticket counter from 30 minutes to 3 hours before the scheduled departure time (depending on your departure city and destination) and receive a printed boarding pass."}, {"url": "http://www.seatguru.com/airlines/Southwest_Airlines/checkin.php", "passage_text": "Yes, you may check-in for your Southwest Airlines (WN) flight online starting 24 hours and ending 60 minutes before the scheduled departure time (depending on your departure city and destination) to receive a mobile boarding pass on your mobile device or a printable boarding pass."}, {"url": "http://www.usatoday.com/story/todayinthesky/2013/01/22/southwest-pay-40-and-you-can-board-earlier/1854681/", "passage_text": "Southwest Airlines may not charge customers a fee to check their bags or to change their tickets, but the carrier's list of fee-based perks is growing. The latest: For $40, Southwest will let customers pay to jump into its A boarding group and get onto the aircraft ahead of others."}, {"url": "http://www.seatguru.com/airlines/Southwest_Airlines/checkin.php", "passage_text": "(US Carriers only). Yes, you may check-in for your U S domestic Southwest Airlines (WN) flight curbside at most U S airport locations from 60 minutes to 3 hours before the scheduled departure time (depending on your departure city and destination)."}]