[{"url": "http://www.ehow.com/about_4782474_foods-contain-estrogen-hormones_.html", "passage_text": "Save. Stockbyte/Stockbyte/Getty Images. Foods that contain phytoestrogens include soy foods such as tofu, soy milk, tempeh and soy protein powder. Other foods have estrogenic effects, meaning that the body can mistake them for estrogen: fennel seed and cinnamon are two examples. "}, {"url": "http://www.modernmom.com/2c1edbf4-051f-11e2-9d62-404062497d7e.html", "passage_text": "Some foods naturally inhibit estrogen. This can be beneficial if you suffer from a condition that may be exacerbated by estrogen. This list of foods includes berries, grapes, melons, pineapples, pears, squash, green beans, cabbage, broccoli, citrus foods, corn, onions, millet, buckwheat, white rice and white flour. Seeds. Many seeds contain natural estrogen. Some examples of these seeds include anise seeds, flaxseeds, sesame seeds and sunflower seeds. Some of these seeds, such as sunflower seeds, may be consumed as snacks. Others are easy to add to other foods such as baked goods."}, {"url": "http://healthyeating.sfgate.com/estrogenboosting-foods-4911.html", "passage_text": "Foods. Foods that contain natural phytoestrogens can help gently raise estrogen levels in the body. This helps maintain health and reduce symptoms of menopause such as hot flashes, dry skin and bone density los"}, {"url": "http://healthyeating.sfgate.com/estrogenboosting-foods-4911.html", "passage_text": "The University of Minnesota notes that foods that help boost estrogen naturally include apples, alfalfa, barley, baker's yeast, beets, cherries, chickpeas, carrots, celery, cucumbers, dates, fennel, oats, olives and olive oil, papaya, peas, plums, pomegranates, potatoes, beans, rhubarb, rice, tomatoes, wheat and yams. Foods that contain natural phytoestrogens can help gently raise estrogen levels in the body. This helps maintain health and reduce symptoms of menopause such as hot flashes, dry skin and bone density los"}, {"url": "http://www.livestrong.com/article/21560-foods-high-natural-estrogen/", "passage_text": "Estrogen is a hormone primarily involved in the development, maturation and function of the female reproductive system. Phytoestrogens are natural estrogens found in some foods that can bind to estrogen receptors in your body, leading to either an estrogenic effect or an antiestrogenic effect. "}, {"url": "http://www.stylecraze.com/articles/estrogen-rich-foods/", "passage_text": "3. Soybeans: Soybeans are one of the richest sources of phytoestrogens. The intake of foods rich in estrogen like these is known to provide relief from the symptoms of menstrual cycle in women. Edamame are the pods which are produced by soy plant. These are a great choice for snack as they pack a nutritional punch. "}, {"url": "http://www.holisticonline.com/Remedies/hrt/hrt_food_and_estrogen.htm", "passage_text": "Media. Food and Estrogen Some foods are a good sources of natural estrogens. There are some foods that inhibit estrogen. Knowing how your food affect the estrogen metabolism is an important part of managing the menopause and PMS. Estrogen Inhibiting Foods. Foods Containing Natural Estrogens. A number of different foods and herbs are sources of natural plant estrogens, and can be very helpful during menopause, The following is a list of some of the best food sources of estrogen. These foods are also high in vitamins, minerals, fiber, and essential fatty acids, and they are low in saturated fat"}]