[{"url": "http://www.ehow.com/how_8219320_measure-1-acre-feet.html", "passage_text": "Acres and square footage are terms that are applied to the area of a piece of land. These measurements are extremely important when buying or selling a piece of property. You also may have to measure acres or feet if you are planning a landscaping or building project. An acre is equal to 43,560 square feet. There are multiple combinations of measurements in feet that will equal the product of 43,560. Each side of the square should equal 208.71 feet, which is equal to 1 acre. Create different shapes that equal an acre by dividing the product 43,560 by various values. For instance, you could have a lot that was 150 feet on two of the sides and 290.4 feet on the other two sides."}, {"url": "http://www.infoplease.com/encyclopedia/science/acre-measure-land-area.html", "passage_text": "acre. acre, measure of land area used in the English units of measurement. The acre was originally the area a yoke of oxen could plow in a day and therefore differed in size from one locality to another. It is now fixed as 10 square chains or 160 square rods, i.e., 4,840 sq yd, 43,560 sq ft, or 1/640 sq mi. | Share | Cite. acre, measure of land area used in the English units of measurement. The acre was originally the area a yoke of oxen could plow in a day and therefore differed in size from one locality to another. It is now fixed as 10 square chains or 160 square rods, i.e., 4,840 sq yd, 43,560 sq ft, or 1/640 sq mi."}, {"url": "https://en.wikipedia.org/wiki/Acre", "passage_text": "The acre is a unit of land area used in the imperial and US customary systems. It is defined as the area of 1 chain (22 yards) by 1 furlong (220 yards), which is exactly equal to 1⁄640 of a square mile, approximately 4,046.856 m 2, or about 40% of a hectare. Since the difference between the US survey acre and international acre is only about a quarter of the size of an A4 sheet of paper (0.016 square metres, 160 square centimetres or 24.8 square inches), it is usually not important which one is being discussed."}, {"url": "http://sizes.com/units/acre.htm", "passage_text": "In the United States, because the acre is a land measure it is currently based on the U.S. survey foot and not on the international foot. One acre is about 4,046.873 square meters. A square plot of ground 208.7 feet on a side will cover an acre. An American football field, 360 feet by 160 feet, is about 1.3 acres; 12 high school basketball courts are a little more than 1 acre. Here's a way for city dwellers to use a Google map of their neighborhood to get a feel for how big an acre is. "}, {"url": "http://www.gloverfamily.com/docs/landmeasurements.htm", "passage_text": "The standard unit of measuring land in the United States is the ACRE. An Acre is equal to 43,560 square feet (Sq. Ft.) of area. An acre is also equal to 10 square chains (66 x 66 x 10 = 43560 Sq. Ft.) or 160 square rods (16.5 x 16.5 x 160 = 43,560 Sq. Ft.) There are exactly 640 Acres in one square mile."}, {"url": "http://www.worldlandtrust.org/education/area-converter", "passage_text": "An acre is a unit of area containing 4,840 square yards and approximately the same size as one football (soccer) pitch OR 16 tennis courts. An acre of rainforest contains up to 86 different species of tree, with the amphibians, birds, insects and mammals that depend on them. "}, {"url": "http://www.landsurveyors.com/resources/land-surveying-units/", "passage_text": "Common Land Survey Measurement Units. Acre-The English acre is a unit of area equal to 43,560 square feet, 10 square chains, or 160 square poles. It originates from a plowing area that is 4 poles wide and a furlong (40 poles) long. A square mile is 640 acres. A Scottish acre is 1.27 English acres. "}, {"url": "http://www.thecalculatorsite.com/articles/units/how-big-is-an-acre.php", "passage_text": "It is important to realise that an acre can be measured in any shape-from rectangles to circles or even hexagons-so long as the total area of land is 43,560 square feet. The most common shape for an acre is 1 furlong by 1 chain, or 660 feet by 66 feet. "}]