[{"url": "https://www.melanoma.org/understand-melanoma/resource-library/pictures-of-melanoma", "passage_text": "This is one of the most frequently-asked questions we hear. Seeing pictures of moles-both benign and malignant-and the changes they undergo may help you understand what melanoma looks like, especially since these changes can sometimes be subtle. All suspicious moles or lesions, especially those that are new or changing, should be brought to the attention of your dermatologist immediately. To view more pictures of melanoma, submitted by actual melanoma patients, please visit the MRF's Melanoma Picture Gallery and Melanoma Scar Gallery. In addition, as a part of our increased efforts in pediatric melanoma, we are currently building a Pediatric Melanoma Gallery"}, {"url": "http://www.healthguideinfo.com/skin-cancer/p82821/", "passage_text": "Changes in shape and size can be a sign of early melanoma. Other recognizable traits of this cancer include: 1  Asymmetrical skin growths, a mark that is dark on one side and light on the other for example. While still in its early stage before the cancer has had the chance to spread, it can be treated. Wondering what does early melanoma look like? Find out what to look out for to make sure you don't have this form of skin cancer. If you might have it make sure to see your doctor right away"}, {"url": "http://www.webmd.com/melanoma-skin-cancer/ss/slideshow-skin-lesions-and-cancer", "passage_text": "Melanoma is not as common as other types of skin cancer, but it's the most serious and potentially deadly. Possible signs of melanoma include a change in the appearance of a mole or pigmented area. A mole (nevus) is a benign growth of melanocytes, cells that gives skin its color. Although very few moles become cancer, abnormal or atypical moles can develop into melanoma over time. Normal moles can appear flat or raised or may begin flat and become raised over time. The surface is typically smooth."}, {"url": "http://www.cancer.gov/types/skin/melanoma-photos", "passage_text": "People should tell their doctor if they notice any changes on the skin. The only way to diagnose melanoma is to remove tissue and check it for cancer cells. Thinking of ABCDE can help you remember what to look for: 1  Asymmetry: The shape of one half does not match the other half. 2  Border that is irregular: The edges are often ragged, notched, or blurred in outline. 3  The pigment may spread into the surrounding skin."}, {"url": "http://www.oralcancerfoundation.org/facts/rare/om/", "passage_text": "BACKGROUND: Melanoma is the most serious type of skin cancer. It begins in skin cells called melanocytes, the cells that produce the color of our skin. The first sign of melanoma is often a change in the size, shape, or color of a mole. However, melanoma can also appear on the body as a new mole. According to the American Cancer Society, there were 68,700 news cases of melanoma in 2009 and more than 8,500 deaths. "}, {"url": "http://www.webmd.com/melanoma-skin-cancer/ss/slideshow-skin-lesions-and-cancer", "passage_text": "The Warning Signs of Skin Cancer. Skin cancers -- including melanoma, basal cell carcinoma, and squamous cell carcinoma -- often start as changes to your skin. They can be new growths or precancerous lesions -- changes that are not cancer but could become cancer over time. A mole (nevus) is a benign growth of melanocytes, cells that gives skin its color. Although very few moles become cancer, abnormal or atypical moles can develop into melanoma over time. Normal moles can appear flat or raised or may begin flat and become raised over time. The surface is typically smooth."}, {"url": "http://www.cancer.gov/types/skin/melanoma-photos", "passage_text": "Melanoma is a type of cancer that begins in melanocytes (cells that make the pigment melanin). Below are photos of melanoma that formed on the skin. Melanoma can also start in the eye, the intestines, or other areas of the body with pigmented tissues. Often the first sign of melanoma is a change in the shape, color, size, or feel of an existing mole. However, melanoma may also appear as a new mole. Thinking of ABCDE can help you remember what to look for: 1  Asymmetry: The shape of one half does not match the other half. 2  Border that is irregular: The edges are often ragged, notched, or blurred in outline. 3  The pigment may spread into the surrounding skin."}, {"url": "https://www.sharecare.com/health/melanoma/symptoms-of-mucosal-melanoma", "passage_text": "The most visibly noticeable symptoms occur if mucosal melanoma affects the female genitals. These symptoms may include changes in an existing mole or formation of a new skin growth (generally on the vulva), and may also include pain, itching, bleeding, or other discharge. When mucosal melanoma occurs in the mouth, it may cause pain similar to a canker sore."}]