[{"url": "http://www.nhs.uk/conditions/broken-arm/Pages/Introduction.aspx", "passage_text": "How a broken arm or wrist is treated. A broken arm or wrist is usually treated in a hospital accident and emergency department. The treatment differs depending on the severity of the injury. A doctor will give you or your child painkillers and fix a splint to the arm to secure it in position and prevent further damage."}, {"url": "http://www.webmd.boots.com/a-to-z-guides/broken-wrist", "passage_text": "Broken wrist. A broken wrist is usually due to a fall, sports injury or other accident, and will be very painful and tender with swelling. Broken wrists are also known as a Colles' fracture or a distal radius fracture. A broken wrist is a break in the larger of the two bones in your forearm."}, {"url": "http://www.mayoclinic.org/diseases-conditions/broken-wrist/basics/definition/CON-20031382", "passage_text": "A broken wrist or broken hand is a break or crack in one of the many bones within your wrist and hand. The most common of these injuries occurs in the wrist when people try to catch themselves during a fall and land hard on an outstretched hand."}, {"url": "http://www.webmd.com/a-to-z-guides/colles-fracture", "passage_text": "A Colles' fracture -- or distal radius fracture -- is often called a ''broken wrist.'' Technically, it's a break in the larger of the two bones in your forearm. The bone breaks on the lower end, close to where it connects to the bones of the hand on the thumb side of the wrist."}, {"url": "http://www.rightdiagnosis.com/w/wrist_fracture/basics.htm", "passage_text": "A break or crack in one or more bones in the wrist. The wrist is the joint between the forearm and the ... more 1  ». Wrist fracture: A condition that is characterised by the fracture of one of the bones that comprise"}, {"url": "http://www.mayoclinic.org/diseases-conditions/broken-wrist/basics/causes/CON-20031382", "passage_text": "A direct blow or crushing injury to your hands and wrists can break any of the bones in them. Common causes include: 1  Falls. 2  Falling onto an outstretched hand is one of the most common causes of a broken wrist or broken hand."}, {"url": "http://www.assh.org/handcare/hand-arm-injuries/wrist-fractures", "passage_text": "DESCRIPTION. A wrist fracture is a medical term for a broken wrist. The wrist is made up of eight small bones which connect with the two long forearm bones called the radius and ulna. Although a broken wrist can happen in any of these 10 bones, by far the most common bone to break is the radius."}]