[{"url": "https://www.rainforest-rescue.org/topics/palm-oil", "passage_text": "Palm oil is an edible plant oil which has become a common ingredient in many consumer products. Today, around 50 percent of the goods we use every day contain palm oil, from processed foods to candles, grooming products and “biofuels”. "}, {"url": "https://en.wikipedia.org/wiki/Palm_oil", "passage_text": "Along with coconut oil, palm oil is one of the few highly saturated vegetable fats and is semi-solid at room temperature. Like most plant-based products, palm oil contains very little cholesterol. Palm oil is a common cooking ingredient in the tropical belt of Africa, Southeast Asia and parts of Brazil. Its use in the commercial food industry in other parts of the world is widespread because of its lower cost and the high oxidative stability (saturation) of the refined product when used for frying. Palm oil, like all fats, is composed of fatty acids, esterified with glycerol. Palm oil has an especially high concentration of saturated fat, specifically, of the 16-carbon saturated fatty acid palmitic acid, to which it gives its name. Monounsaturated oleic acid is also a major constituent of palm oil."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1139-PALM%20OIL.aspx?activeIngredientId=1139&activeIngredientName=PALM%20OIL", "passage_text": "Palm oil is obtained from the fruit of the oil palm tree. Palm oil is used for preventing vitamin A deficiency, cancer, brain disease, aging; and treating malaria, high blood pressure, high cholesterol, and cyanide poisoning. Palm oil is used for weight loss and increasing the body’s metabolism. As food, palm oil is used for frying. 1 For preventing vitamin A deficiency: about 3 tablespoons (9 grams) per day of palm oil for adults and children over age 5. 2  About 4 tablespoons (12 grams) per day for pregnant women. 3  For children less than 5 years old, 2 tablespoons (6 grams) per day."}, {"url": "https://en.wikipedia.org/wiki/Palm_oil", "passage_text": "Palm oil is naturally reddish in color because of a high beta-carotene content. It is not to be confused with palm kernel oil derived from the kernel of the same fruit, or coconut oil derived from the kernel of the coconut palm (Cocos nucifera). Palm oil, like all fats, is composed of fatty acids, esterified with glycerol. Palm oil has an especially high concentration of saturated fat, specifically, of the 16-carbon saturated fatty acid palmitic acid, to which it gives its name. Monounsaturated oleic acid is also a major constituent of palm oil."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1139-PALM%20OIL.aspx?activeIngredientId=1139&activeIngredientName=PALM%20OIL", "passage_text": "PALM OIL Side Effects & Safety. Palm oil is LIKELY SAFE when consumed in amounts found in foods. It is POSSIBLY SAFE when taken as medicine by children or adults for up to 6 months. Pregnancy and breast-feeding: Palm oil is POSSIBLY SAFE when taken as a medicine during pregnancy for up to 6 months. 1 For preventing vitamin A deficiency: about 3 tablespoons (9 grams) per day of palm oil for adults and children over age 5. 2  About 4 tablespoons (12 grams) per day for pregnant women. 3  For children less than 5 years old, 2 tablespoons (6 grams) per day."}, {"url": "http://www.worldwildlife.org/pages/which-everyday-products-contain-palm-oil", "passage_text": "Palm oil is the most widely consumed vegetable oil on the planet, and it is in about half of all packaged products sold in the supermarket. While palm oil is the most efficient source of vegetable oil, its rapid expansion threatens some of the planet’s most important and sensitive habitats. "}, {"url": "http://www.saynotopalmoil.com/Whats_the_issue.php", "passage_text": "In total, 50 million tons of palm oil is produced annually, supplying over 30% of the world’s vegetable oil production. This single vegetable oil is found in approximately 40-50% of household products in countries such as United States, Canada, Australia and England. Today, palm oil is grown throughout Africa, Asia, North America, and South America, with 85% of all palm oil globally produced and exported from Indonesia and Malaysia; but most of the time not using sustainable measures. Demand for palm oil has increased rapidly in recent decades."}, {"url": "http://www.saynotopalmoil.com/Whats_the_issue.php", "passage_text": "Palm oil is a type of edible vegetable oil that is derived from the palm fruit, grown on the African oil palm tree. Today, palm oil is grown throughout Africa, Asia, North America, and South America, with 85% of all palm oil globally produced and exported from Indonesia and Malaysia; but most of the time not using sustainable measures. Demand for palm oil has increased rapidly in recent decades."}, {"url": "https://en.wikipedia.org/wiki/Palm_oil", "passage_text": "The differences are in color (raw palm kernel oil lacks carotenoids and is not red), and in saturated fat content: Palm mesocarp oil is 41% saturated, while palm kernel oil and coconut oil are 81% and 86% saturated respectively. Palm oil, like all fats, is composed of fatty acids, esterified with glycerol. Palm oil has an especially high concentration of saturated fat, specifically, of the 16-carbon saturated fatty acid palmitic acid, to which it gives its name. Monounsaturated oleic acid is also a major constituent of palm oil."}, {"url": "http://www.greenpeace.org.uk/forests/palm-oil", "passage_text": "Palm oil. Last edited 5 November 2013 at 1:37pm. Demand for palm oil is growing-and fast. At the moment, most of it ends up in hundreds of food products-from margarine and chocolate to cream cheese and oven chips-although it's also used in cosmetics and increasingly, for use in biodiesel."}]