[{"url": "http://www.answers.com/Q/What_is_the_relationship_between_temperature_and_altitude_in_the_troposphere", "passage_text": "Making the world better, one answer at a time. Temperature and altitude are inversely proportional in the troposphere. This means that as one increases, the other decreases. Approximately 165 meters up in the troposphere is equivalent to a 1 degree Celsius drop. the relationship between atmospheric pressure and altitude is the higher you go, the lesser the atmospheric pressure becomes. if the air above you is less, then there is less … weight being pressed upon the air you are on. anonymous boy from small heath school y8 2011."}, {"url": "https://en.wikipedia.org/wiki/Mesosphere", "passage_text": "The mesosphere (/ˈmɛsoʊsfɪər/ ; from Greek mesos middle and sphaira ball) is the layer of the Earth's atmosphere that is directly above the stratopause and directly below the mesopause. In the mesosphere temperature decreases as the altitude increases. The upper boundary of the mesosphere is the mesopause, which can be the coldest naturally occurring place on Earth with temperatures below 130 K (−226 °F; −143 °C). Within the mesosphere, temperature decreases with increasing height. This is due to decreasing solar heating and increasing cooling by CO 2 radiative emission. The top of the mesosphere, called the mesopause, is the coldest part of Earth's atmosphere."}, {"url": "https://en.wikipedia.org/wiki/Mesosphere", "passage_text": "The stratosphere, mesosphere and lowest part of the thermosphere are collectively referred to as the middle atmosphere, which spans heights from approximately 10 kilometres (33,000 ft) to 100 kilometres (62 mi). Within the mesosphere, temperature decreases with increasing height. This is due to decreasing solar heating and increasing cooling by CO 2 radiative emission. The top of the mesosphere, called the mesopause, is the coldest part of Earth's atmosphere."}, {"url": "http://www.windows2universe.org/earth/Atmosphere/mesosphere.html", "passage_text": "The mesosphere is a layer of Earth's atmosphere. The mesosphere is above the stratosphere layer. The layer above the mesosphere is called the thermosphere. The mesosphere starts at 50 km (31 miles) above Earth's surface and goes up to 85 km (53 miles) high. As you get higher up in the mesosphere, the temperature gets colder. The top of the mesosphere is the coldest part of Earth's atmosphere. The temperature there is around -90 C (-130 F)! The boundaries between layers in the atmosphere have special names. The mesopause is the boundary between the mesosphere and the thermosphere above it"}, {"url": "http://www.answers.com/Q/What_is_the_relationship_between_temperature_and_height_in_the_mesosphere", "passage_text": "The temperature of the Earth's atmosphere varies with altitude; the  relationship between temperature and altitude varies between the  different atmospheric layers:    - troposphere - 0 - 7/17 km, temperature decreasing with height.    - stratosphere - 7/17 - 50 km, temperature increasing with height. "}, {"url": "https://en.wikipedia.org/wiki/Troposphere", "passage_text": "The temperature of the troposphere generally decreases as altitude increases. The rate at which the temperature decreases, , is called the environmental lapse rate (ELR). The ELR is nothing more than the difference in temperature between the surface and the tropopause divided by the height. The tropopause is the boundary region between the troposphere and the stratosphere. Measuring the temperature change with height through the troposphere and the stratosphere identifies the location of the tropopause. In the troposphere, temperature decreases with altitude."}, {"url": "http://www.answers.com/Q/What_is_the_relationship_between_temperature_and_altitude_in_the_troposphere", "passage_text": "See Temperature change as altitude increases? for info on how temperature normally decreases with altitude when there is not a temperature inversion.The rate at which the temperature goes down is down 1.1 degrees celsius for every 500 feet you go up. the relationship between atmospheric pressure and altitude is the higher you go, the lesser the atmospheric pressure becomes. if the air above you is less, then there is less … weight being pressed upon the air you are on. anonymous boy from small heath school y8 2011."}, {"url": "http://www.answers.com/Q/What_is_the_relationship_between_temperature_and_altitude_in_the_troposphere", "passage_text": "Normally, temperature decreases as altitude increases. In a temperature inversion, the temperature increases as altitude increases, up to the level of air that is causing the … inversion. the relationship between atmospheric pressure and altitude is the higher you go, the lesser the atmospheric pressure becomes. if the air above you is less, then there is less … weight being pressed upon the air you are on. anonymous boy from small heath school y8 2011."}, {"url": "https://en.wikipedia.org/wiki/Mesosphere", "passage_text": "The mesopause, at an altitude of 80–90 km (50–56 mi), separates the mesosphere from the thermosphere —the second-outermost layer of the Earth's atmosphere. This is also around the same altitude as the turbopause, below which different chemical species are well mixed due to turbulent eddies. Within the mesosphere, temperature decreases with increasing height. This is due to decreasing solar heating and increasing cooling by CO 2 radiative emission. The top of the mesosphere, called the mesopause, is the coldest part of"}, {"url": "http://openstudy.com/updates/5054f4dee4b0a91cdf447141", "passage_text": "What is the relationship between temperature and altitude in the stratosphere? (2 points) As altitude increases, temperature decreases. As altitude increases, temperature increases. "}]