[{"url": "https://en.wikipedia.org/wiki/Ramipril", "passage_text": "Ramipril (INN, BAN, USAN) is an angiotensin-converting enzyme (ACE) inhibitor, used to treat high blood pressure (hypertension) and congestive heart failure. By inhibiting an enzyme, ACE inhibitors relax the muscles around small arteries (arterioles). The arterioles expand and allow blood to flow through more easily. The AIRE trial showed a 27% reduction in mortality for patients receiving ramipril for chronic heart failure following a myocardial infarction. Ramipril was found to have similar results as telmisartan, an angiotensin II receptor blocker."}, {"url": "http://www.medicinenet.com/ramipril/article.htm", "passage_text": "BRAND NAME: Altace. DRUG CLASS AND MECHANISM: Ramipril belongs to a class of drugs called angiotensin converting enzyme (ACE) inhibitors that are used for treating high blood pressure, heart failure and for preventing kidney failure due to high blood pressure and diabetes. Other ACE inhibitors include enalapril (Vasotec), quinapril (Accupril), captopril (Capoten), fosinopril (Monopril), benazepril (Lotensin), lisinopril (Zestril, Prinivil), moexipril (Univasc) and trandolapril (Mavik). ACE is important because it is an enzyme responsible for producing the chemical, angiotensin II. Angiotensin II causes muscles in most arteries, including the arteries of the heart, to contract, thereby narrowing the arteries and elevating blood pressure. ACE inhibitors such as ramipril lower blood pressure by reducing the production of angiotensin II, thereby relaxing arterial muscle and enlarging arteries. When the blood pressure is lower, the heart--including the failing heart--does not have to work as hard to pump blood"}, {"url": "http://libraries.mackenziehealth.ca/Medications.aspx?bran_name_id=4613", "passage_text": "Ramipril belongs to the class of medications called angiotensin-converting enzyme (ACE) inhibitors. It is used to treat high blood pressure, alone or in combination with thiazide diuretics (water pills). It works by relaxing and opening blood vessels to lower blood pressure. 15 mg. Each No. 3, light gray/powder blue capsule, imprinted APO 15, contains ramipril 15 mg. Nonmedicinal ingredients: lactose monohydrate (spray-dried), magnesium stearate, and talc; capsule shell: gelatin, D&C Red No. 28, FD & C Blue No. 1, and titanium dioxide."}, {"url": "http://www.everydayhealth.com/drugs/ramipril", "passage_text": "Ramipril is in a class of drugs called angiotensin-converting enzyme inhibitors, or ACE inhibitors, which work by keeping blood flowing smoothly throughout the body. If you are taking ramipril to reduce your risk of a major cardiovascular events, your doctor will likely prescribe a daily dose of 2.5 mg for one week, then 5 mg once daily for three weeks, and finally 10 mg once daily if you tolerate the drug well."}, {"url": "http://libraries.mackenziehealth.ca/Medications.aspx?bran_name_id=4613", "passage_text": "The recommended adult dose of ramipril ranges from 2.5 mg to 20 mg daily in 1 or 2 divided doses, depending on the dose and individual circumstances such as your response to the medication. To treat high blood pressure, the usual starting dose for people not using diuretics (water pills) is 2.5 mg once daily. 15 mg. Each No. 3, light gray/powder blue capsule, imprinted APO 15, contains ramipril 15 mg. Nonmedicinal ingredients: lactose monohydrate (spray-dried), magnesium stearate, and talc; capsule shell: gelatin, D&C Red No. 28, FD & C Blue No. 1, and titanium dioxide."}, {"url": "http://www.everydayhealth.com/drugs/ramipril", "passage_text": "4 Reviews. 4 Reviews. Ramipril is the generic version of the brand-name drug Altace, which is used to treat high blood pressure (hypertension). Ramipril also reduces the risk of a heart attack, stroke, and death in people age 55 and older and at high risk of a major cardiovascular event. If you are taking ramipril to reduce your risk of a major cardiovascular events, your doctor will likely prescribe a daily dose of 2.5 mg for one week, then 5 mg once daily for three weeks, and finally 10 mg once daily if you tolerate the drug well."}, {"url": "http://www.emedicinehealth.com/drug-ramipril/article_em.htm", "passage_text": "Ramipril is in a group of drugs called ACE inhibitors. ACE stands for angiotensin converting enzyme. Ramipril is used to treat high blood pressure (hypertension) or congestive heart failure, and to improve survival after a heart attack. Ramipril may also be used for purposes not listed in this medication guide. Get emergency medical help if you have any of these signs of an allergic reaction: hives; severe stomach pain; difficulty breathing; swelling of your face, lips, tongue, or throat. Stop taking ramipril and call your doctor at once if you have a serious side effect such as: 1  feeling like you might pass out;"}, {"url": "https://www.patientslikeme.com/treatments/show/11132-aporamipril-side-effects-and-efficacy?brand=t", "passage_text": "Category: Prescription Drugs. Generic Name: Ramipril. Apo-Ramipril® is a Canadian brand name for ramipril, an angiotensin-converting enzyme (ACE) inhibitor. It is used for hypertension and to reduce risk of heart attack an stroke in high risk patients. Off label it is used for heart failure and to reduce heart problems in diabetics with hypertension"}]