[{"url": "http://www.primarytexts.co.uk/free_resources/expanded-noun-phrases.docx", "passage_text": "EXPANDED NOUN PHRASES. Expanded noun phrases add information to nouns (naming words). They make your writing more interesting and can help the reader to build a picture in their minds."}, {"url": "http://grammar.about.com/od/mo/g/nounphraseterm.htm", "passage_text": "A noun phrase is word group with a noun or pronoun as its head. The simplest noun phrase consists of a single noun, as in the sentence  Bells were ringing.. The head of a noun phrase can be accompanied by modifiers, determiners (such as the, a, her), and/or complements, as in . "}, {"url": "http://www.grammar-monster.com/glossary/adjective_phrases.htm", "passage_text": "Like a normal adjective, an adjective phrase can be used before the noun it is modifying (like in the first two examples above) or after the noun it is modifying (like in the last example). Here are some more examples of adjective phrases (with the head adjectives in bold): An adjective phrase (or adjectival phrase) is a phrase that tells us something about the noun it is modifying. The head (principal) word in an adjective phrase will be an adjective. In the examples below, the adjective phrase is shaded and the head word (i.e., the adjective) is in bold:"}, {"url": "http://www.youtube.com/watch?v=RIQN8kMXN38", "passage_text": "This animation teaches the learner to define a noun phrase and identify it in a given sentence. This is a product of Mexus Education Pvt. Ltd., an education innovations company based in Mumbai, India. http://www.mexuseducation.com, http://www.ikenstore.in. 1  Education. 2  Standard YouTube License. "}, {"url": "http://www.grammar-monster.com/glossary/noun_phrases.htm", "passage_text": "A noun phrase is a phrase that plays the role of a noun. The head word in a noun phrase will be a noun or a pronoun. In the examples below, the whole noun phrase is shaded and the head word is in bold. Compare the three examples above to these: In these three examples, the words in bold are all pronouns. Like any noun, a noun phrase can be a subject, an object, or a complement. Noun phrases are extremely common. A noun with any sort of modifier (including just a number or an article) is a noun phrase. Here are some examples of noun phrases:"}, {"url": "http://grammar.about.com/od/pq/g/phrase.htm", "passage_text": "1 An Expanded Definition.  2 A prototypical phrase is a group of words forming a unit and consisting of a head or 'nucleus' together with other words or word groups clustering around it. 3  If the head of the phrase is a noun, we speak of a noun phrase (NP) (e.g. all those beautiful houses built in the sixties). In grammar, a phrase is a small group of related words within a sentence or clause. Adjective: phrasal. A phrase functions as a part of speech and includes a head (or headword), which determines the nature of the unit. Principal Types of Phrases. 1  Adjective Phrase. 2  Adverb Phrase. 3  Infinitive Phrase. 4  Noun Phrase"}, {"url": "https://en.wikipedia.org/wiki/Noun_phrase", "passage_text": "A noun phrase or nominal phrase (abbreviated NP) is a phrase which has a noun (or indefinite pronoun) as its head word, or which performs the same grammatical function as such a phrase. Noun phrases are very common cross-linguistically, and they may be the most frequently occurring phrase type. Noun phrases often function as verb subjects and objects, as predicative expressions, and as the complements of prepositions. Noun phrases can be embedded inside each other; for instance, the noun phrase some of his constituents contains the shorter noun phrase his constituents"}, {"url": "http://www.teachingenglish.org.uk/article/noun-phrase", "passage_text": "My definition is: A noun phrase is either a pronoun or any group of words that can be replaced by a pronoun. For example, 'they', 'cars', and 'the cars' are noun phrases, but 'car' is just a noun, as you can see in these sentences (in which the noun phrases are all in bold). Because the noun phrase is a quintessential part of every sentence (even if it doesn't appear in the surface structure of a sentence as in stop!), it is potentially infinite in length, and it can include any number of other phrases (e.g. noun, adjective, adverb) within its structure."}]