[{"url": "http://www.springer.com/us/book/9783642218453", "passage_text": "About this book. Within the context of globalization, cultural transformations are increasingly analyzed as hybridization processes. Hybridity itself, however, is often treated as a specifically post-colonial phenomenon. "}, {"url": "http://www.jstor.org/stable/3630899", "passage_text": "The aim of this paper is to view the cultural hybridization that occurs in the local offices in Thailand, Mexico, and Israel of two global corporations, Solna from Sweden and Communication from the United States,1 by exploring the Thai, Mexican, and Israeli managers' sense of boundaries. To this aim I try here to understand processes of cultural border-crossing and hybridization from below, and more specifically, from the local managers' sense of boundaries. Following anthropological and geographical works on place, this paper considers cultural borders not as essential or natural phenomena."}, {"url": "https://answers.yahoo.com/question/index?qid=20080309202541AA3OTZR", "passage_text": "RE: What is Cultural Hybridization? It says that it occurs when people mix traditional arts, mass communication, and popular culture in new way, enabling people to express personal and cultural identities that are different from existing ones. Think about the people in different regional areas--east coast, west coast, gulf coast, southwest. Each one has taken bits and pieces from the groups that settled those areas, and have created different dialects, customs, etc."}, {"url": "https://awanthropology.wordpress.com/2011/09/26/cultural-hybridization/", "passage_text": "In canada, they speak english as well as french. In one country, two languages are the main language; that is an example of cultural hybridization. Some African countries speak french and mix it in with their native language, creating something new. Language is just one example of cultural hybridization. All in all, when it comes down to an example of cultural hybridization, the best example I could possibly think of is America. Known as the world’s biggest “melting pot”, America has a variety of different cultures living within a couple of feet of each other."}, {"url": "http://sociologydictionary.org/cultural-hybridization/", "passage_text": "cultural hybridization. (noun) The process by which a cultural element such a food, language, or music blend into another culture by modifying the element to fit cultural norms. "}, {"url": "http://www.answers.com/Q/What_is_cultural_hybridization", "passage_text": "Making the world better, one answer at a time. Taking things like culture, traditions, language, mass communication from a society and mixing it into another society creating a new culture from one that is current. Think of dialects and how some African countries speak french and mixed it in with their language, creating something new. "}, {"url": "https://en.wikipedia.org/wiki/Hybridity", "passage_text": "Hybridity is a cross between two separate races or cultures. A hybrid is something that is mixed, and hybridity is simply mixture. In the theoretic development of hybridity, the key text is The Location of Culture (1994), by Homi Bhabha, wherein the liminality of hybridity is presented as a paradigm of colonial anxiety."}, {"url": "https://awanthropology.wordpress.com/2011/09/26/cultural-hybridization/", "passage_text": "Cultural hybridization is the blending of elements from different cultures. I feel that without cultural hybridization, the world we live in would not be anywhere near as interesting and integrated as it is today. The phrase “spanglish” is a language that combines the language of spanish and english. All in all, when it comes down to an example of cultural hybridization, the best example I could possibly think of is America. Known as the world’s biggest “melting pot”, America has a variety of different cultures living within a couple of feet of each other."}, {"url": "https://en.wikipedia.org/wiki/Cultural_globalization", "passage_text": "Cultural globalization refers to the transmission of ideas, meanings and values around the world in such a way as to extend and intensify social relations. This process is marked by the common consumption of cultures that have been diffused by the Internet, popular culture media, and international travel. The creation and expansion of such social relations is not merely observed on a material level. Cultural globalization involves the formation of shared norms and knowledge with which people associate their individual and collective cultural identities."}]