[{"url": "http://www.immocalador.com/majorca.information/?hl=en", "passage_text": "Location of Majorca. Mallorca is a beautiful island surrounded by transparent blue waters situated in the Mediterranean sea. It’s capital is Palma de Mallorca and the main source of income is tourism. It forms part of a group of islands called the Balearics which are Mallorca, Menorca, Ibiza and Formentera. The Balearics are independent autonomies that depend on the Spanish state."}, {"url": "http://earthobservatory.nasa.gov/IOTD/view.php?id=77089", "passage_text": "The Balearic Islands are an archipelago located in the Mediterranean Sea to the southeast of Spain. Catalan—the native tongue—and Spanish are the official languages. "}, {"url": "http://majorcabocaraton.com/", "passage_text": "Majorca is conveniently located on the North side of South Verde Trail between St. Andrews Blvd. and Military Trail. Majorca-a cozy townhome community in Boca Majorca in Boca Raton was built in the late 1980's, and offers homeowners a gated, pet friendly, all-ages community. "}, {"url": "http://www.majorca.com/v/geography/", "passage_text": "Majorca, Spain » City Info » Geography. The island of Majorca is the largest of the Balearic Islands and is geographically located to the east of Spain. The main tourist attractions are located in the southwest region of Majorca, these include; Palma de Mallorca, Palmanova, Portals Nous, Santa Ponca, Peguera and Magalluf. With a population of approximately 800,000, over 50% of Majorca’s inhabitants live in the city of Palma. The tourist boom in the 20th century is said to be responsible for the population growth as many people relocated to the island from the rest of Spain, Europe, South America and Africa."}, {"url": "http://www.donquijote.org/culture/spain/places/cities/mallorca", "passage_text": "Majorca is the largest island of Spain and is located in the Mediterranean Sea. It is one of the four Balearic Islands; the others being Ibiza, Formentera and Menorca. The capital of the island, Palma, is also the capital of the Balearic Islands. Another great place to visit in Majorca is the Bellver Castle. The Bellver Castle, located just northwest of Palma on the Island of Majorca, is a 14th century Gothic style structure, famous for being one of the few circular castles in all of Europe."}, {"url": "https://en.wikipedia.org/wiki/Palma,_Majorca", "passage_text": "Palma pictured from the International Space Station. Palma is a major city and seaport geographically located in the south-west of Majorca, a western mediterranean island belonging to the Balearic Islands archipelago. The land area of the city is about 21.355 square kilometres (8.245 sq mi) with an altitude of 13 metres (43 feet) above sea level. [ˈpalma]), in full Palma de Mallorca, is the capital and largest city of the autonomous community of the Balearic Islands in Spain. It is situated on the south coast of the island Majorca on the Bay of Palma"}, {"url": "http://www.answers.com/Q/Where_is_Majorca", "passage_text": "Majorca is near Spain and is very sunny most of the year. Majorca is a small island just off the south east coast of Spain. It is part of the Balearic Islands. Majorca is the largest island in the group, with Formentera as the smallest inhabited island in the group. Formentera is widely known because it permits nude sunbathing on most of its beaches. It is approximately 310 miles/ 200Km from the main city, Palma, to Madrid, capital"}, {"url": "http://www.iberostar.com/en/hotels/majorca/iberostar-alcudia-park/location-and-map", "passage_text": "Location and map of the IBEROSTAR Alcudia Park. The IBEROSTAR Alcudia Park Hotel, sitting on the shore of the Playa de Muro, in Alcudia, on the island of Mallorca, is a full beach resort magnificently located on Majorca's north side. "}]