[{"url": "https://en.wikipedia.org/wiki/Komodo_National_Park", "passage_text": "The islands of the national park are of volcanic origin. The terrain is generally rugged, characterized by rounded hills, with altitudes up to 735 m. The climate is one of the driest of Indonesia with annual rainfall between 800mm and 1000mm. The most famous of Komodo National Park's reptiles is the Komodo dragon (Varanus komodoensis). It is the world's largest lizard and is among the world's largest reptiles and can reach 3m or more in length and weigh over 70 kg. Twelve terrestrial snake species are found on the island in addition to marine species."}, {"url": "http://www.komodo.travel/komodo-national-park/komodo-weather/", "passage_text": "Komodo Weather – sunset swim. The climate on Komodo Island is tropical, and is based on an alternating wet and dry season. During the months of January, February, March, and the beginning of April, is the rainy season. The Komodo weather during these months typically includes between thirty one and thirty nine inches of rain."}, {"url": "http://www.komodo-tours.travel/komodo-weather", "passage_text": "The climate of Komodo is fairly hot and dry with a short rainy season that lasts from January to April. The island receives an average rainfall of about 800 to 1000 mm annually. The Komodo National Park receives the least amount of rain in Indonesia. It experiences a very short spell of rain in January. The effects of the long spell of dry weather are evident in the species of flora and fauna native to the region. Lesser Sunda Islands. In complete contrast to the climate of Komodo, the climate of the Lesser Sunda Islands is tropical like the rest of Indonesia. It has a distinct wet and dry season. The wet season generally lasts from November to March while the dry season lasts from April to October."}, {"url": "http://www.komodo.travel/komodo-national-park/komodo-weather/", "passage_text": "The Best time to Visit Komodo Island: June and July are great months to visit Komodo. The waters tend to be more calm for getting there and away. The winds are present, but not very strong, making the days very pleasant and the nights slightly cool. The Lesser Sunda Islands of Indonesia weather, is more distinct. During the months of January, February, March, and the beginning of April, is the rainy season. The Komodo weather during these months typically includes between thirty one and thirty nine inches of rain."}, {"url": "https://en.wikipedia.org/wiki/Komodo_National_Park", "passage_text": "The park includes the three larger islands Komodo, Padar and Rinca, and 26 smaller ones, with a total area of 1,733 km 2 (603 km 2 of it land). The national park was founded in 1980 to protect the Komodo dragon, the world's largest lizard. Later it was dedicated to protecting other species, including marine species. The most famous of Komodo National Park's reptiles is the Komodo dragon (Varanus komodoensis). It is the world's largest lizard and is among the world's largest reptiles and can reach 3m or more in length and weigh over 70 kg. Twelve terrestrial snake species are found on the island in addition to"}, {"url": "http://www.abyssworld.com/diving-destination/komodo/komodo/good-know.htm", "passage_text": "Climate. Komodo benefits from a humid and hot climate all year round. It is however one of the driest regions of Indonesia: the arid soil and the limited vegetation in this zone contrasts with all other islands of the archipelago. The temperature varies from 20°C to 40°C"}, {"url": "http://www.weather-forecast.com/locations/Komodo/forecasts/latest", "passage_text": "Komodo 10 day weather forecast, updated four times a day and shows the weather summary plus detailed sun, rain, snow, wind and temperature. The weather forecast extends out to 10 days showing information for morning, afternoon and overnight. "}, {"url": "http://www.livescience.com/27402-komodo-dragons.html", "passage_text": "Size & characteristics. The average size of a male Komodo dragon is 8 to 9 feet and about 200 lbs., according to the Smithsonian National Zoological Park, but they can reach a whopping 10 feet (3 meters) in length. Females grow to 6 feet (1.8 m). The lizard's habitat can be anything from a tropical dry forest to a savanna to a deciduous monsoon forest. No matter where they live, the Komodo likes extreme heat. It is usually around 95 degrees Fahrenheit (35 degrees Celsius) with 70-percent humidity on the islands of Indonesia, according to the San Diego Zoo."}]