[{"url": "http://www.answers.com/Q/What_is_the_origin_of_the_word_gawdy", "passage_text": "What is the origin of the word it? The word it comes from the Old English word hit which means the same thing as it (a neuter third person singular pronoun). Meaning 'study of coins', it comes from numismatic (adj.) 'of coins,' which was borrowed in 1792 from th … e French word numismatique which comes from 1579, which comes from the Latin word numisma (gen."}, {"url": "https://en.wikipedia.org/wiki/Gaudy", "passage_text": "At the University of Oxford a gaudy ('gaude' at New College, Oxford, pronounced the same) is a college feast. It is often a reunion for its alumni. The origin of the term may be connected to the traditional student anthem, Gaudeamus. Wantage Hall, one of the university's halls of residence, holds an annual Freshers Gaudie, which is a legacy from when the University of Reading was an extension college of Christ Church, Oxford University."}, {"url": "http://www.answers.com/Q/What_is_the_origin_of_the_word_gawdy", "passage_text": "The word numismatist comes from numismatics, which originated in 1829. Meaning 'study of coins', it comes from numismatic (adj.) 'of coins,' which was borrowed in 1792 from th … e French word numismatique which comes from 1579, which comes from the Latin word numisma (gen."}, {"url": "http://www.answers.com/Q/What_is_the_origin_of_the_word_gawdy", "passage_text": "The word tiger is taken from the Greek word tigris, which is possibly derived from a Persian source meaning arrow, a reference to the animal's speed and also the origin … for the name of the Tigris river. In American English, tigress was first recorded in 1611. Meaning 'study of coins', it comes from numismatic (adj.) 'of coins,' which was borrowed in 1792 from th … e French word numismatique which comes from 1579, which comes from the Latin word numisma (gen."}, {"url": "http://ask.metafilter.com/126891/Does-the-word-gaudy-come-from-the-artist-Gaudi", "passage_text": "This gaud came from the French gaudir, meaning to rejoice or jest, which came in turn from the Latin gaudere, meaning to rejoice or delight in. (That Latin gaudere, by the way, is also the source of the English word joy.). posted by meerkatty at 2:38 PM on July 8, 2009. Including, from here : I was recently told that the word gaudy comes from the name of the Catalan architect Antoni Gaudi. I find this hard to believe as he died in the late 1920s and it seems to me that this word is of older origin. The dictionary said that it came from gaudiere, which I assume is French."}, {"url": "http://www.yourdictionary.com/gaudy", "passage_text": "LINK / CITE ADD TO WORD LIST. adjective. The definition of gaudy is something that is bright and ornate, but overdone to the point of being tacky. An example of something that might be described as gaudy is a large tiara completely covered in big fake diamonds"}, {"url": "http://ask.metafilter.com/126891/Does-the-word-gaudy-come-from-the-artist-Gaudi", "passage_text": "First, it is thought that gaudy comes from a color term from Middle English, gaudy-green, which itself originated because the plant which produced the dye was once known as weld, and weld, when borrowed into Old French, became gaude-hence English gaudy-green. Including, from here : I was recently told that the word gaudy comes from the name of the Catalan architect Antoni Gaudi. I find this hard to believe as he died in the late 1920s and it seems to me that this word is of older origin. The dictionary said that it came from gaudiere, which I assume is French."}, {"url": "https://en.wikipedia.org/wiki/Gaudy", "passage_text": "Gaudy or gaudie (from the Latin, gaudium, meaning enjoyment or merry-making) is a term used to reflect student life in a number of the ancient universities in the United Kingdom as well as other institutions such as Durham University and Reading University. Wantage Hall, one of the university's halls of residence, holds an annual Freshers Gaudie, which is a legacy from when the University of Reading was an extension college of Christ Church, Oxford"}, {"url": "http://www.etymonline.com/index.php?term=gaudy", "passage_text": "showy, tastelessly rich, c. 1600; earlier joyfully festive (1580s), probably a re-adjectivizing of gaudy (n.) large, ornamental bead in a rosary (early 14c.) via the noun + (2.). In early Modern English it also could mean full of trickery (1520s). Or possibly the adjective is from or influenced by Middle English noun gaudegrene (early 14c.), name of a yellowish-green color or pigment, originally of dye obtained from the weld plant (see (n.1)). This Germanic plant-name became gaude in Old French, and thus the Middle English word"}]