[{"url": "http://www.answers.com/Q/What_languages_do_people_in_Ireland_speak", "passage_text": "Ullans and Cant are minority languages. Second Opinion: Although the first official language is Irish, the fact is that only a minority speak it as their first language, and indeed a very large part, perhaps even a majority of the population do not speak it well enough to get by at all. Third Opinion:"}, {"url": "https://answers.yahoo.com/question/index?qid=20100715081139AAgq3L6", "passage_text": "Best Answer: They speak English with Irish accents in Ireland generally, on a day-to-day basis. However, you still get some people in rural areas who still speak Irish Gaelic, which is the native language of Ireland. Source(s): Schmaulo · 5 years ago. Report Abuse. Irish is the language of Ireland but very few people speak it.People from certain area of Ireland but like 95% of people don&#x27;t speak Gaelic Irish anymore.We speak English:). Source(s): Irish. Andrea · 2 years ago. Thumbs up"}, {"url": "http://www.answers.com/Q/What_languages_do_people_in_Ireland_speak", "passage_text": "English is the predominant language in Ireland. The native language Irish Gaelic is spoken by 2 or 3% of the population.  . 2 people found this useful. Edit. Share to: 1  5 Funny Irish Quotes People from Ireland are thought to love their food and drink. Although the first official language is Irish, the fact is that only a minority speak it as their first language, and indeed a very large part, perhaps even a majority of the population do not speak it well enough to get by at all. Third Opinion:"}, {"url": "http://www.answers.com/Q/What_language_do_they_speak_in_ireland", "passage_text": "English is the predominant language in Ireland. The native language Irish Gaelic is spoken by 2 or 3% of the population. Mainly English but in certain parts called the Gaeltacht the original Irish language is encouraged and spoken to try and keep the language alive but 99 percent of the populati … on speak English as their first language."}, {"url": "https://answers.yahoo.com/question/index?qid=20090129144552AAe7HRD", "passage_text": "Everyone (or most everyone) speaks English but this language is also spoken: Irish (Gaeilge) is a Goidelic language of the Indo-European language family, originating in Ireland and historically spoken by the Irish. "}, {"url": "https://en.wikipedia.org/wiki/Irish_language", "passage_text": "Irish (Gaeilge), also referred to as Gaelic or Irish Gaelic, is a Goidelic language of the Indo-European language family, originating in Ireland and historically spoken by the Irish people. Irish is spoken as a first language by a small minority of Irish people, and as a second language by a rather larger group. Irish enjoys constitutional status as the national and first official language of the Republic of Ireland, and is an officially recognised minority language in Northern Ireland. In Europe the language is usually referred to as Irish, with Gaelic or Irish Gaelic used in some instances elsewhere. The term Irish Gaelic is often used when English speakers discuss the relationship between the three Goidelic languages (Irish, Scottish Gaelic and Manx)."}, {"url": "https://en.wikipedia.org/wiki/Irish_language", "passage_text": "Irish was the predominant language of the Irish people for most of their recorded history, and they brought it with them to other regions, notably Scotland and the Isle of Man, where through earlier branching from Middle Irish it gave rise to Scottish Gaelic and Manx respectively. In Europe the language is usually referred to as Irish, with Gaelic or Irish Gaelic used in some instances elsewhere. The term Irish Gaelic is often used when English speakers discuss the relationship between the three Goidelic languages (Irish, Scottish Gaelic and Manx)."}, {"url": "http://www.answers.com/Q/What_languages_do_people_in_Ireland_speak", "passage_text": "The first official language is Irish (also known as Irish Gaelic, as distinct from Scottish Gaelic or the extinct Manx Gaelic). However, Irish is now the first language only in Gaeltacht regions (mostly found in western Ireland) and English is the first language of the majority of the inhabitants of areas like Dublin. Although the first official language is Irish, the fact is that only a minority speak it as their first language, and indeed a very large part, perhaps even a majority of the population do not speak it well enough to get by at all. Third Opinion:"}, {"url": "http://www.answers.com/Q/What_language_do_they_speak_in_ireland", "passage_text": "English is spoken in Ireland because of a long history of English political domination of the island. English was seen in Ireland as the language of the oppressor but at the s … ame time, quite necessary for upward social mobility. Monolingual Irish speakers had little opportunity for success in life. Mainly English but in certain parts called the Gaeltacht the original Irish language is encouraged and spoken to try and keep the language alive but 99 percent of the populati … on speak English as their first language."}]