[{"url": "http://www.grocery.com/spar/", "passage_text": "Currently, with operations in 33 countries and a total of 13,600 stores, SPAR is considered one of the largest chains of food retail stores. The company’s country of origin is Holland. In 1947, SPAR was able to expand to Belgium, and in 1957, SPAR had expanded to the UK with the help of its five founding members, which were all wholesale businesses."}, {"url": "https://en.wikipedia.org/wiki/Spar_(retailer)", "passage_text": "Spar (. [spɑr]), trademarked as SPAR, is a Dutch multinational retail chain and franchise with approximately 12,500 stores in 35 countries worldwide. It was founded in the Netherlands in 1932 by retailer Adriaan van Well. The first Spar store in Oman was inaugurated in January 2015 in Muscat. SPAR Oman plans more stores to open in the coming months as part of its expansion plans in Oman. In March 2015 the first three stores in Indonesia were opened. Twelve stores are planned to open in the country by the end of 2015."}, {"url": "http://www.grocery.com/spar/", "passage_text": "SPAR is also one of UK’s leaders when it comes to the convenience store business, having a £2.7 billion turnover. From the original five founding companies, SPAR now has six wholesale business members managing it. The members service a total of 2,600+ stores and employ more than 50,000 people in the UK alone. The company’s country of origin is Holland. In 1947, SPAR was able to expand to Belgium, and in 1957, SPAR had expanded to the UK with the help of its five founding members, which were all wholesale businesses."}, {"url": "http://www.afblakemore.com/spar/welcome", "passage_text": "Blakemore Trade Partners supports the independent SPAR estate of A.F. Blakemore & Son Ltd. SPAR is the world’s largest international food retail chain and encompasses more than 12,300 stores in 34 countries. With more than 2,400 stores, SPAR is also the UK’s leading convenience store group. SPAR UK has five retail distribution centres (RDCs), which offer retailers everything from fresh food to financial packages and a comprehensive own brand product range."}, {"url": "http://www.grocery.com/spar/", "passage_text": "SPAR. SPAR is considered one of the world’s biggest chains of food retail stores. The company’s operation is mainly centred in Europe, but it also has operations in other parts of the world. History. SPAR was founded by Adrian van Wekk in 1932. The company’s country of origin is Holland. In 1947, SPAR was able to expand to Belgium, and in 1957, SPAR had expanded to the UK with the help of its five founding members, which were all wholesale businesses. In the next twenty years, SPAR was able to steadily expand in Europe"}, {"url": "http://www.sparinc.com/careers-group-corp.html", "passage_text": "SPAR Group Corporate. SPAR Group is a publicly traded global company. We are the world’s leading retail services company, planning, sourcing, managing and supporting a variety of retail merchandising and other in-store field services, including new store sets and remodels, audits and assembly services."}, {"url": "http://www.spar.com.au/managementProfiles.cfm", "passage_text": "A host of other European countries followed rapidly in the 1950s'. Mr Van Well became the first president of International SPAR in 1953. The fast growth of the company continued over the next 20 years, with stores opening outside Europe for the first time in South Africa and Japan. In 1985 SPAR expanded into Australia, Eastern Europe and Argentina. If you're thinking seriously about becoming part of the future of SPAR, it's worth investing a minute or two to find out more about the history of our world-wide success."}, {"url": "https://en.wikipedia.org/wiki/Spar_(retailer)", "passage_text": "The name was originally DE SPAR, an acronym of the Dutch phrase Door Eendrachtig Samenwerken Profiteren Allen Regelmatig (English: through united co-operation everyone regularly profits). De Spar is Dutch for The spruce , hence Spar's logo. The first Spar store in Oman was inaugurated in January 2015 in Muscat. SPAR Oman plans more stores to open in the coming months as part of its expansion plans in Oman. In March 2015 the first three stores in Indonesia were opened. Twelve stores are planned to open in the country by the end of 2015."}]