[{"url": "http://home.costhelper.com/grass-sod.html", "passage_text": "1 For the do-it-yourselfer, rolls of sod cost 8-30 cents a square foot, depending on the variety and quantity bought. 2  For front and back lawns of 20x50 feet each, that's 2,000 square feet or $160-$600."}, {"url": "http://www.improvenet.com/r/costs-and-prices/seed-lawn-cost-estimator", "passage_text": "Average Cost to Seed a Lawn. The average cost to seed a lawn is $1,302. Most homeowners reported that the expense of replanting a lawn was between $989 and $1,615. The lowest amount paid to reseed a lawn was $50, while the highest amount paid was $3,700."}, {"url": "http://www.landscapingnetwork.com/lawns/cost.html", "passage_text": "Cost of lawn installation and maintenance. Installation costs per square foot: 1  Hydroseed: $.50-1.00. 2  Sod: $3.50. 3  Artificial turf: $8-$12. 4  Backyard putting greens: $14."}, {"url": "http://home.costhelper.com/grass-sod.html", "passage_text": "1 Having sod professionally installed just about doubles the cost to 14-60 cents a square foot, or $280-$1,000 for 2,000 square feet. 2  A contractor may use special equipment to install rolls of sod 42 inches wide and up to 128 feet long, which saves on labor costs, creates fewer seams and gets the job done more quickly."}, {"url": "http://home.costhelper.com/grass-sod.html", "passage_text": "1 For front and back lawns of 20x50 feet each, that's 2,000 square feet or $160-$600. 2  Having sod professionally installed just about doubles the cost to 14-60 cents a square foot, or $280-$1,000 for 2,000 square feet."}, {"url": "http://www.landscapingnetwork.com/lawns/cost.html", "passage_text": "Hand-seeding, hydroseeding, sod, and artificial turf vary greatly in both the initial installation cost and the ongoing cost to maintain. Learn more about the cost differences between these installation methods, both initially and over time."}, {"url": "http://www.diyornot.com/Project.aspx?ndx2=9&Rcd=67", "passage_text": "A landscaper will charge $891 to prepare the soil and seed a 2,000 square-foot lawn, which includes the labor and material. You can buy the seed and do it yourself for $100 and save 88 percent. It'll cost more if the soil requires topsoil and more labor, either yours or that of a landscaper service."}, {"url": "http://www.homeadvisor.com/cost/landscape/install-sod/", "passage_text": "Installing an irrigation system in the average yard can cost around $1,000 for a simple system if done on a bare yard (no lawn). If you plan to have one put in, the time to do it is before the sod goes on. Installing one in an existing yard can cost $1,300 for the system alone."}]