[{"url": "http://easyayurveda.com/2012/12/06/moringa-benefits-medicinal-usage-complete-ayurveda-details/", "passage_text": "Moringa seeds are called as Shweta Maricha. Moringa for headache: As explained above, moringa leaves paste applied externally, or used as vegetable helps to relieve headache. Its seed powder, in the form of nasya treatment cures headache. Moringa for diabetes Many studies have been conducted to prove the anti diabetic and anti oxidant effect of Moringa. Moringa flowers are useful in intestinal worms. It balances Pitta and kapha. Oil prepared with Moringa is useful to relieve headache, pungent, useful in skin diseases and diabetes. Moringa leaves for balanitis: Leaves are ground to make a paste. It is applied over the inflamed area."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1242-MORINGA.aspx?activeIngredientId=1242&activeIngredientName=MORINGA", "passage_text": "Moringa is sometimes applied directly to the skin as a germ-killer or drying agent (astringent). It is also used topically for treating pockets of infection (abscesses), athlete’s foot, dandruff, gum disease (gingivitis), snakebites, warts, and wounds. The leaves, fruit, and seeds might be safe when eaten as food. However, it’s important to avoid eating the root and its extracts. These parts of the plant may contain a toxic substance that can cause paralysis and death. Moringa has been used safely in doses up to 6 grams daily for up to 3 weeks. There isn’t enough information to know if moringa is safe when used in medicinal amounts. Pregnancy and breast-feeding: It’s LIKELY UNSAFE to use the root, bark or flowers of moringa if you are pregnant. Chemicals in the root, bark, and flowers can make the uterus contract, and this might cause a miscarriage"}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1242-MORINGA.aspx?activeIngredientId=1242&activeIngredientName=MORINGA", "passage_text": "Moringa is a plant that is native to the sub-Himalayan areas of India, Pakistan, Bangladesh, and Afghanistan. It is also grown in the tropics. The leaves, bark, flowers, fruit, seeds, and root are used to make medicine. The leaves, fruit, and seeds might be safe when eaten as food. However, it’s important to avoid eating the root and its extracts. These parts of the plant may contain a toxic substance that can cause paralysis and death. Moringa has been used safely in doses up to 6 grams daily for up to 3 weeks. There isn’t enough information to know if moringa is safe when used in medicinal amounts. Pregnancy and breast-feeding: It’s LIKELY UNSAFE to use the root, bark or flowers of moringa if you are pregnant. Chemicals in the root, bark, and flowers can make the uterus contract, and this might cause a miscarriag"}, {"url": "http://www.ayurvedacollege.com/articles/students/MagicalMoringa", "passage_text": "Moringa for Headaches: Moringa leaves paste applied externally, or used as vegetable helps to relieve headache. Its seed powder, in the form of nasya treatment cures headache. Moringa for Diabetes: Many studies have been conducted to prove the anti-diabetic and anti-oxidant effect of Moringa. Oil prepared with Moringa is useful to relieve headache, pungent, useful in skin diseases and diabetes."}, {"url": "http://www.thetahealth.co.za/moringa-benefits.html", "passage_text": "Today Moringa Oleifera is known as a complete super food rich in protein, calcium, magnesium, iron, potassium, vitamin A and vitamin C. Some of the Moringa benefits are its strong antioxidant properties which are said to guard against skin cancers. Moringa is also said to prevent the growth of cysts, tumours and glands. Moringa Benefits to Reduce Aches and Pains The anti-inflammatory properties of Moringa Oliefera reduce different types of body pains. It has proved effective for treating arthritis, rheumatism, joint pain, migraine and other headaches."}, {"url": "http://www.med-health.net/Moringa-Oleifera.html", "passage_text": "Nutrients in Moringa Oleifera. Moringa Oleifera, also referred to as the horseradish tree or the drumstick tree is a wonder plant. The tree is known for its nutritional value and this are found in its pods which are rich in minerals, its flowers and green leaves. 1 In its powder form, Moringa can be used a condiment. 2  Moringa doesn’t only provide health benefits. 3  The seed cake which remains after the oil has been extracted is used to purify water and can also remove salt in stored seawater. 4  The seed cake also makes for a brilliant fertilizer."}, {"url": "http://www.thetahealth.co.za/moringa-benefits.html", "passage_text": "What are the Moringa benefits and how can the Moringa plant improve your health? Moringa has been used for a long time in preventative medicine, for liver, kidney, stomach and thyroid health problems. Moringa Benefits to Reduce Aches and Pains The anti-inflammatory properties of Moringa Oliefera reduce different types of body pains. It has proved effective for treating arthritis, rheumatism, joint pain, migraine and other headaches."}, {"url": "http://www.med-health.net/Moringa-Oleifera.html", "passage_text": "1. Side Effects. Like all good things, the Moringa Oleifera also has its side effects. For starters, you are not allowed to eat the root or extracts from this part of the plant. This is because the roots could contain toxic substances and ingestion of these toxins could lead to paralysis and even death. 1 In its powder form, Moringa can be used a condiment. 2  Moringa doesn’t only provide health benefits. 3  The seed cake which remains after the oil has been extracted is used to purify water and can also remove salt in stored seawater. 4  The seed cake also makes for a brilliant fertilizer."}]