[{"url": "http://geology.com/rocks/sedimentary-rocks.shtml", "passage_text": "Chemical sedimentary rocks, such as rock salt, iron ore, chert, flint, some dolomites, and some limestones, form when dissolved materials precipitate from solution. Organic sedimentary rocks such as coal, some dolomites, and some limestones, form from the accumulation of plant or animal debris. Photos and brief descriptions of some common sedimentary rock types are shown on this page. Coal is an organic sedimentary rock that forms mainly from plant debris."}, {"url": "http://www.appstate.edu/~abbottrn/rck-id/", "passage_text": "METAMORPHIC ROCKS form when a sedimentary or igneous rock is exposed to high pressure, high temperature, or both, deep below the surface of the Earth. The process, METAMORPHISM, produces fundamental changes in the mineralogy and texture of the rock."}, {"url": "http://scienceviews.com/geology/minerals.html", "passage_text": "The roads we ride or drive on and the buildings we live learn and work in all contain minerals. Below is a selected list of commonly used metallic and nonmetallic minerals, ore minerals, mineral byproducts, aggregates, and rock types that are used to make products we use in our daily life."}, {"url": "http://www.coaleducation.org/lessons/wim/20.htm", "passage_text": "Smaller quantities are cut and polished for dimension stone (called black granite). BASALT: An igneous volcanic rock, dark gray to black, it is the volcanic equivalent of plutonic gabbro and is rich in ferromagnesian minerals. Basalt can be used in aggregate."}, {"url": "http://www.nma.org/index.php/minerals-publications/40-common-minerals-and-their-uses", "passage_text": "The most abundant metal element in Earth's crust. Aluminum originates as an oxide called alumina. Bauxite ore is the main source of aluminum and must be imported from Jamaica, Guinea, Brazil, Guyana, etc. Used in transportation (automobiles), packaging, building/construction, electrical, machinery and other uses."}, {"url": "https://en.wikibooks.org/wiki/High_School_Earth_Science/Igneous_Rocks", "passage_text": "One of the most common igneous rocks is granite (Figure 4.9). Granite is used extensively in building materials and making statues. Perhaps you have used a pumice stone to smooth your skin or to do jobs around the house. Pumice is another example of an igneous rock (Figure 4.10)."}, {"url": "http://www.answers.com/Q/What_is_metamorphic_rock_used_for", "passage_text": "Following are examples of three metamorphic rocks and a list of their uses. Marble is a metamorphic rock that is used to make floor tiles, counter tops and it is carved into statues and was used extensively in the building of the Roman Colosseum and other historic buildings."}]