[{"url": "http://chemguide.co.uk/organicprops/esters/background.html", "passage_text": "This page explains what esters are and looks at their simple physical properties such as solubility and boiling points. It includes an introduction to more complicated naturally-occurring esters like animal and vegetable fats and oils. Animal and vegetable fats and oils are just big complicated esters. The difference between a fat (like butter) and an oil (like sunflower oil) is simply in the melting points of the mixture of esters they contain. If the melting points are below room temperature, it will be a liquid-an oil."}, {"url": "http://chemguide.co.uk/organicprops/esters/background.html", "passage_text": "Esters are derived from carboxylic acids. A carboxylic acid contains the-COOH group, and in an ester the hydrogen in this group is replaced by a hydrocarbon group of some kind. This could be an alkyl group like methyl or ethyl, or one containing a benzene ring like phenyl. A common ester-ethyl ethanoate. The most commonly discussed ester is ethyl ethanoate. Animal and vegetable fats and oils are just big complicated esters. The difference between a fat (like butter) and an oil (like sunflower oil) is simply in the melting points of the mixture of esters they contain. If the melting points are below room temperature, it will be a liquid-an oil."}, {"url": "https://en.wikipedia.org/wiki/Ester", "passage_text": "Esterification is the general name for a chemical reaction in which two reactants (typically an alcohol and an acid) form an ester as the reaction product. Esters are common in organic chemistry and biological materials, and often have a characteristic pleasant, fruity odor. Esters are widespread in nature and are widely used in industry. In nature, fats are, in general, triesters derived from glycerol and fatty acids. Esters are responsible for the aroma of many fruits, including apples, durians, pears, bananas, pineapples, and strawberries."}, {"url": "https://en.wikipedia.org/wiki/Ester", "passage_text": "The equilibrium constant for such reactions is about 5 for typical esters, e.g., ethyl acetate. The reaction is slow in the absence of a catalyst. Sulfuric acid is a typical catalyst for this reaction. Many other acids are also used such as polymeric sulfonic acids. Esters are widespread in nature and are widely used in industry. In nature, fats are, in general, triesters derived from glycerol and fatty acids. Esters are responsible for the aroma of many fruits, including apples, durians, pears, bananas, pineapples, and strawberries."}, {"url": "http://www.ftmguide.org/ttypes.html", "passage_text": "Testosterone esters: what they are and how they work. Much of the testosterone that is prescribed for the purposes of hormone therapy is in the form of testosterone esters.. An ester is simply a name for a chemical compound that is formed from reaction between a carboxylic acid and an alcohol. "}, {"url": "https://en.wikipedia.org/wiki/Carboxylic_acid", "passage_text": "Carboxylic acids are commonly named as indicated in the table below. Although rarely used, IUPAC-recommended names also exist. For example, butyric acid (C 3 H 7 CO 2 H) is, according to IUPAC guidelines, also known as butanoic acid. The general formula of a carboxylic acid is R−C(O)OH with R referring to the rest of the (possibly quite large) molecule. Carboxylic acids occur widely and include the amino acids and acetic acid (as vinegar). Salts and esters of carboxylic acids are called carboxylates."}, {"url": "https://en.wikipedia.org/wiki/Ester", "passage_text": "In chemistry, esters are chemical compounds derived from an acid (organic or inorganic) in which at least one-OH (hydroxyl) group is replaced by an-O- alkyl (alkoxy) group. Usually, esters are derived from a carboxylic acid and an alcohol. Glycerides, which are fatty acid esters of glycerol, are important esters in biology, being one of the main classes of lipids, and making up the bulk of animal fats and vegetable oils. Esters are widespread in nature and are widely used in industry. In nature, fats are, in general, triesters derived from glycerol and fatty acids. Esters are responsible for the aroma of many fruits, including apples, durians, pears, bananas, pineapples, and strawberries."}, {"url": "http://extension.psu.edu/plants/green-industry/news/2014/amines-or-esters-which-should-you-use", "passage_text": "Ester formulations are typically more active on weeds in comparison to amines. This is due to the fact that esters are more soluble when in contact with the plant’s waxy cuticle. Plants are more likely to quickly absorb esters, as amines are more water soluble. As we all know, correct timing is crucial for acceptable weed control. This also comes into play when deciding what formulation to use; ester or amine. During cooler weather (March, April, and early May), ester formulations can be used safely, and typically provide better weed control than amines."}, {"url": "https://en.wikipedia.org/wiki/Carboxylic_acid", "passage_text": "Carboxylic acids also react with alcohols to give esters. This process is heavily used in the production of polyesters. Likewise, carboxylic acids are converted into amides, but this conversion typically does not occur by direct reaction of the carboxylic acid and the amine. The general formula of a carboxylic acid is R−C(O)OH with R referring to the rest of the (possibly quite large) molecule. Carboxylic acids occur widely and include the amino acids and acetic acid (as vinegar). Salts and esters of carboxylic acids are called carboxylates."}]