[{"url": "http://www.answers.com/Q/What_are_the_3_parts_that_make_up_a_nucleotide", "passage_text": "A nucleotide is made up of a sugar (deoxyribose in DNA and ribose in RNA), a phosphate and a nitrogenous base. The nitrogenous bases found in DNA are adenine (A), thymine (T …), cytosine (C) and guanine (G). 1 person found this useful."}, {"url": "http://www.phschool.com/science/biology_place/biocoach/dnarep/structure.html", "passage_text": "The nucleotide in DNA consists of a sugar (deoxyribose), one of four bases (cytosine (C), thymine (T), adenine (A), guanine (G)), and a phosphate. Cytosine and thymine are pyrimidine bases, while adenine and guanine are purine bases. The sugar and the base together are called a nucleoside."}, {"url": "http://www.answers.com/Q/What_makes_up_a_nucleotide_of_DNA", "passage_text": "A DNA nucleotide is one of two kinds of bases... a pyrimidine or a purine. The purine is a heterocyclic (two-ring) molecule with a 5 member and 6 member ring each containing 2 … Nitrogens. Purines are just a single ring with 2"}, {"url": "http://www.answers.com/Q/What_makes_up_a_nucleotide_of_DNA", "passage_text": "There are four nucleotides that make up DNA: Adenine, Thymine, Guanine and Cytosine. There are billions of them that make up one strand of DNA. Adenine always pairs with Thymi … ne and Guanine always pairs with Cytosine. Also, in the Rna during DNA transcription, Uracil replaces Thymine and pairs with Adenine instead."}, {"url": "http://chemistry.about.com/od/dnarna/f/What-Are-The-3-Parts-Of-A-Nucleotide-How-Are-They-Connected.htm", "passage_text": "Answer: Both deoxyribonucleic acid (DNA) and ribonucleic acid (RNA) are made up of nucleotides which consist of three parts: 1  Nitrogenous Base. 2  Purines and pyrimidines are the two categories of nitrogenous bases. 3  Pentose Sugar. 4  In DNA, the sugar is 2'-deoxyribose. 5  Phosphate Group. 6  A single phosphate group is PO 4 3- ."}, {"url": "http://chemistry.about.com/od/chemistryglossary/g/Nucleotide-Definition.htm", "passage_text": "Nucleotide Definition: A nucleotide is an organic molecule made up of a nucleotide base, a five-carbon sugar (ribose or deoxyribose) and at least one phosphate group. Nucleotides make up the basic units of DNA and RNA molecules."}]