[{"url": "http://www.behindthename.com/submit/names/usage/hawaiian", "passage_text": "KAMAILE f & m Hawaiian. This name means the maile from ka, which is a definite article, and maile, a type of vine native to Hawaii that is used mainly to make leis. KAMAKA m Hawaiian. Derived from Hawaiian ka the and maka meaning eye, bud or beloved one, child..."}, {"url": "http://www.babynamespedia.com/meaning/Akahi/m", "passage_text": "[ syll. a-ka-hi, ak-ahi ] The baby boy name Akahi is also used as a girl name. Its pronunciation is AA K AA HHiy †. Akahi's origin, as well as its use, is in the Hawaiian language. The name's meaning is never before. Akahi is infrequently used as a baby name for boys."}, {"url": "http://www.to-hawaii.com/hawaiian-dictionary.php", "passage_text": "Traditionally in the Hawaiian language, the “W” is pronounced like a “V.”. For example: The word “Hawai'i” is pronounced “hah-vy-ee” instead of “hah-wy-ee.”. Other pronunciation tips: The Hawaiian language has many so-called glottal stops (‘)."}, {"url": "http://www.mauimapp.com/moolelo/hwnwdshw.htm", "passage_text": "1/ Okinas and macrons impart important differences in the pronunciation and meaning of words in the Hawaiian language. Due to font limitations, macrons are represented with an underline. For macron usage, replace the underline below a letter with a macron over the same letter."}, {"url": "http://www.mauimapp.com/moolelo/hwnwdseng.htm", "passage_text": "1/ Okinas and macrons impart important differences in the pronunciation and meaning of words in the Hawaiian language. Due to font limitations, macrons are represented with an underline. For macron usage, replace the underline below a letter with a macron over the same letter."}, {"url": "http://www.to-hawaii.com/aloha.php", "passage_text": "In the Hawaiian language, it can mean hello or goodbye. It also means love and affection. The word aloha is used in a combination with other words, such as aloha kakahiaka, which means good morning; aloha auinala used as a greeting that means good afternoon; and aloha ahiahi is how you can wish good evening in Hawaiian. Because of aloha s unique meaning and popularity, Hawaii is called the Aloha State."}, {"url": "http://www.babynamespedia.com/meaning/Akahi/m", "passage_text": "It is not listed in the top 1000 names. Baby names that sound like Akahi include Acasha, Acayo, Acaysha, Accacia, Acea, Achaius (English), Achazia, Achiya (Hebrew), Agyei, Ahiga, Ahijah (Hebrew), Aigeos, Ajaya, Akaia, Akasha, Akaysha, Akia, Akiko, Akio (Japanese), and Akiyo (Japanese)."}]