[{"url": "http://www.differencebetween.net/business/difference-between-wage-and-salary/", "passage_text": "If you work 50 hours in one week, you may receive your first 40 hours at the regular pay rate, and the additional 10 hours at 1 A½ â½ times your normal pay. Rate salary earners are not often given the opportunity to get paid extra for additional. Hours: summary. 1 wage earners are paid by the. hour If you work 50 hours in one week, you may receive your first 40 hours at the regular pay rate, and the additional 10 hours at 1 A½ â½ times your normal pay. Rate salary earners are not often given the opportunity to get paid extra for additional. hours"}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_a_salary_and_a_wage", "passage_text": "A wage is better because you get paid for how many hours you work, while, with a salary, you get a set amount of payment. An example of a job that gets a salary is a teacher. It doesn't matter how much homework they grade over weekends and vacations, they get the same amount of money. What a Salary looks like: Wage usually refers to an hourly rate, and salary to a weekly or semi-honthly rate. So if a wage earner works 40 hours one week and 45 the next week, he gets paid more for the … second week. A salaried worker works long enough to get the job done and usually gets the same pay every payday."}, {"url": "http://www.differencebetween.com/difference-between-salary-and-vs-wages/", "passage_text": "· Salaried employees do not get any additional money if they put in higher number of hours, but employees working on hourly wages get 1.5 times or twice their hourly rates for all hours in addition to the minimum agreed number of hours (usually 40 hours) in a week. Related posts: When someone asks your income, if you are in a private or government service, he is obviously referring to your salary. But when we talk about the income of blue collar workers or others who earn daily through their work, we invariably talk in terms of wages."}, {"url": "http://www.accountingtools.com/questions-and-answers/what-is-the-difference-between-salary-and-wages.html", "passage_text": "The essential difference between a salary and wages is that a salaried person is paid a fixed amount per pay period and a wage earner is paid by the hour. Someone who is paid a salary is paid a fixed amount in each pay period, with the total of these fixed payments over a full year summing to the amount of the salary. This person is considered to be an exempt employee. There is no linkage between the amount paid and the number of hours worked. If a person is paid wages and there is a gap between the last day worked for which he is paid and his pay date, that gap is paid in his next paycheck. This gap does not exist for a salaried worker, since he is paid through the pay date."}, {"url": "http://www.differencebetween.net/business/difference-between-wage-and-salary/", "passage_text": "Wage vs Salary. The difference between wage and salary defines more than how much you end up making per year. We use the terms to often describe differences in types of work, as well as what is actually counted in the final total. Wages are generally paid per hour. If you work 50 hours in one week, you may receive your first 40 hours at the regular pay rate, and the additional 10 hours at 1 A½ â½ times your normal pay. Rate salary earners are not often given the opportunity to get paid extra for additional. hours"}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_a_salary_and_a_wage", "passage_text": "A salary is a fixed amount of pay per week or month (usually paid semi-monthly). A yearly pay is known as an annual amount or annual pay. Minimum wage as of July 15, 2009, is $7.25 per hour. Salary is paid notwithstanding the amount of hours to usually Management employees. Wage usually refers to an hourly rate, and salary to a weekly or semi-honthly rate. So if a wage earner works 40 hours one week and 45 the next week, he gets paid more for the … second week. A salaried worker works long enough to get the job done and usually gets the same pay every payday"}, {"url": "http://keydifferences.com/difference-between-salary-and-wages.html", "passage_text": "Following are the major differences between salary and wages: 1  Salary is the fixed amount of compensation which is paid for the performance of an employee. 2  Wage is the variable amount of compensation which is paid on the basis of hours spent in finishing the certain amount of work. Salary is a fixed amount paid to the employees at regular intervals for their performance and productivity whereas wages are the hourly-based payment given to the labor for the amount of work finished in a day. To further enhance the understanding below is the basic difference"}, {"url": "http://www.differencebetween.net/business/difference-between-wage-and-salary/", "passage_text": "The difference between wage and salary defines more than how much you end up making per year. We use the terms to often describe differences in types of work, as well as what is actually counted in the final total. If you work 50 hours in one week, you may receive your first 40 hours at the regular pay rate, and the additional 10 hours at 1 A½ â½ times your normal pay. Rate salary earners are not often given the opportunity to get paid extra for additional. hours"}]