[{"url": "http://www.answers.com/Q/What_is_the_scientific_name_of_sugar", "passage_text": "Answer by Dudeboy3. Confidence votes 28. The name for the simplest sugar that is in our blood is glucose. There are many other kinds as they become more complex. Monosacchrides include glucose and fructose (from fruit), and then there are disacchrides such as table sugar and lactose (milk sugar). The scientific name for the sugar glider is Petaurus breviceps     The sugar glider is a small mammal, specifically a marsupial.   Order: Diprodontia   Fami … ly: Petauridae   Genus Species: Petaurus (springboard used by acrobats) breviceps (short"}, {"url": "https://answers.yahoo.com/question/index?qid=20080208123050AAg3u0h", "passage_text": "Best Answer: simple sugar found in the blood is glucose milk sugar is lactose table sugar is dextrose or sucrose malt sugar is maltose A simple milk sugar is galactose sugars end in OSE. Source(s): science teacher · 8 years ago. Thumbs up. "}, {"url": "https://www.exploratorium.edu/cooking/candy/sugar.html", "passage_text": "The white stuff we know as sugar is sucrose, a molecule composed of 12 atoms of carbon, 22 atoms of hydrogen, and 11 atoms of oxygen (C12H22O11). Like all compounds made from these three elements, sugar is a carbohydrate. Its found naturally in most plants, but especially in sugarcane and sugar beetshence their names. Sucrose is actually two simpler sugars stuck together: fructose and glucose. In recipes, a little bit of acid (for example, some lemon juice or cream of tartar) will cause sucrose to break down into these two components."}, {"url": "http://science.howstuffworks.com/innovation/edible-innovations/sugar1.htm", "passage_text": "­There are numerous types of sugar, although most people might first think of basic table sugar, the white crystals used in most homes and in much cooking. This sugar is called sucrose and comes from sugar beets or sugarcane. Sucrose appears in other plants, too, along with glucose and fructose. Other types of sugar include: 1  Fructose: found in fruits and honey. 2  Galactose: found in milk and dairy products. 3  Glucose: found in honey, fruits and vegetables. 4  Lactose: found in milk, made from glucose and galactose."}, {"url": "http://commonsensehealth.com/list-of-sugar-names-and-sugar-facts/", "passage_text": "Pinterest6. This list of sugar facts and sugar names will help you uncover the many hidden sugars that are tucked away everywhere in our food today. Food and beverage manufacturers in cahoots with the sugar industry consistently look for new sugar names to add to their long sugar list. "}, {"url": "http://www.chemicalformula.org/sugar", "passage_text": "A molecule of sucrose. Glucose and fructose are monosaccharide sugars. A monosaccharide is the smallest unit of sugar, mono meaning 1. Sucrose is commonly called table sugar and is a disaccharide. A disaccharide is a sugar that is made up of two sugar units, di meaning 2. Sucrose is produced as glucose and fructose are joined together by a condensation reaction. In the process a water molecule is eliminated. See the following equation."}, {"url": "https://en.wikipedia.org/wiki/Sugar", "passage_text": "Biopolymers of sugars are common in nature. Through photosynthesis, plants produce glyceraldehyde-3-phosphate (G3P), a phosphated 3-carbon sugar that is used by the cell to make monosaccharides such as glucose (C 6H 12O 6) or (as in cane and beet) sucrose (C 12H 22O 11). Sucrose is found in the stems of sugar cane and roots of sugar beet. It also occurs naturally alongside fructose and glucose in other plants, in particular fruits and some roots such as carrots. The different proportions of sugars found in these foods determines the range of sweetness experienced when eating them."}]