[{"url": "http://www.youtube.com/watch?v=YgZ5_tMzvOM", "passage_text": "Make no mistake, the use of unmarked cars for patrol in Washington is ILLEGAL, whether done by the State Patrol or a city or county department, and any ticket issued from one is invalid. City and county cars are required to have lettering or a logo on the sides. In the case of the State Patrol, they rely on the exemption in the law for traffic control vehicles.. In short, traffic control vehicles have yellow lights and are for CONTROLLING traffic in work or accident zones."}, {"url": "http://blogs.findlaw.com/blotter/2013/07/are-unmarked-police-cars-legal.html", "passage_text": "One of the major concerns about the use of unmarked police cars for routine traffic stops is, ironically, safety. The use of unmarked cars for traffic stops has produced unintended, and quite tragic, results. The criminal used fake unmarked police cars to pull over the unsuspecting victims. The growing fear of fake unmarked cars being used to victimize drivers has inspired a groundswell of support in favor of restricting officers from using unmarked police cars to make traffic stops for routine offenses."}, {"url": "http://salem-news.com/articles/september292011/unmarked-victory.php", "passage_text": "One belongs to a cop killer, the other an unmarked police car. (SALEM, Ore.) - Opponents of unmarked police cars for traffic enforcement in Washington had a small victory Wednesday, when a traffic ticket originating from an unmarked unit was tossed out of court. Common sense may ultimately prevail in the argument against the use of unmarked police cars for traffic enforcement in the state of Washington."}, {"url": "http://www.justanswer.com/criminal-law/66h6y-ny-illegal-unmarked-police-cars-traffic-stops.html", "passage_text": "This is not a law. At one point, NY was having trouble with criminals impersonating officers on traffic stops. The then Governor ordered State Police to stop making traffic stops in unmarked vehicles. This only applied to NY State police, not to county or city law enforcement. There was a bill attempt to pass this into law. "}, {"url": "http://www.timesfreepress.com/news/news/story/2011/mar/30/police-unmarked-cars-rarely-used-traffic-stops/46144/", "passage_text": "James Dale Smith, 58, was arrested on March... DALTON, Ga. - Police officers rarely use unmarked cars to make traffic stops, so drivers should call police to confirm whether such cars carry legitimate law enforcement personnel, authorities said Tuesday. And there is nothing wrong with you calling 911 to make sure the car is a police officer.. Dalton police do not use unmarked cars for routine traffic enforcement, Frazier said. The Chattanooga Police Department has similar policies, according to spokeswoman Sgt. Jerri Weary."}, {"url": "http://www.thenewspaper.com/news/23/2390.asp", "passage_text": "California Court Weakens Ban on Unmarked Traffic PoliceCalifornia appeals court ruling allows unmarked police cars to make traffic stops for any offense other than speeding. An appellate court last Thursday weakened a ban on using unmarked cars to issue traffic citations that had stood for nearly eighty-five years. "}, {"url": "http://blogs.findlaw.com/blotter/2013/07/are-unmarked-police-cars-legal.html", "passage_text": "Unmarked police cars are used for a variety of traffic law enforcement purposes, ranging from catching drivers committing violations to promoting traffic safety. The criminal used fake unmarked police cars to pull over the unsuspecting victims. The growing fear of fake unmarked cars being used to victimize drivers has inspired a groundswell of support in favor of restricting officers from using unmarked police cars to make traffic stops for routine offenses."}, {"url": "http://blogs.findlaw.com/blotter/2013/07/are-unmarked-police-cars-legal.html", "passage_text": "Concerns. One of the major concerns about the use of unmarked police cars for routine traffic stops is, ironically, safety. The use of unmarked cars for traffic stops has produced unintended, and quite tragic, results. A number of cases have cropped up of criminals posing as policemen in unmarked cars. The criminal used fake unmarked police cars to pull over the unsuspecting victims. The growing fear of fake unmarked cars being used to victimize drivers has inspired a groundswell of support in favor of restricting officers from using unmarked police cars to make traffic stops for routine offenses."}, {"url": "http://blogs.findlaw.com/blotter/2013/07/are-unmarked-police-cars-legal.html", "passage_text": "In many states, unmarked police cars are regularly used for the routine stopping of drivers for traffic violations like speeding. In New York, for example, unmarked state police SUVs are now being used to catch texting drivers. The criminal used fake unmarked police cars to pull over the unsuspecting victims. The growing fear of fake unmarked cars being used to victimize drivers has inspired a groundswell of support in favor of restricting officers from using unmarked police cars to make traffic stops for routine offenses."}]