[{"url": "https://www.google.com/doodles/about", "passage_text": "More Doodles. Doodles are the fun, surprising, and sometimes spontaneous changes that are made to the Google logo to celebrate holidays, anniversaries, and the lives of famous artists, pioneers, and scientists. "}, {"url": "https://en.wikipedia.org/wiki/Doodle", "passage_text": "Doodle by Luise von Mecklenburg-Strelitz, Queen of Prussia, c. 1795. A doodle is a drawing made while a person's attention is otherwise occupied. Doodles are simple drawings that can have concrete representational meaning or may just be abstract shapes. Typical examples of doodling are found in school notebooks, often in the margins, drawn by students daydreaming or losing interest during class. This is also the origin of the early eighteenth century verb to doodle, meaning to swindle or to make a fool of. The modern meaning emerged in the 1930s either from this meaning or from the verb to dawdle, which since the seventeenth century has had the meaning of wasting time or being lazy."}, {"url": "http://www.doodle-art-alley.com/", "passage_text": "Explore the Magic of Doodle Art! Come explore some doodle art! A quick glance at a doodle may show scribbles, random lines and shapes with no meaning or significance. However, with a little love and direction, these drawings have the potential to compete with some of the best art work there is! "}, {"url": "http://www.art-is-fun.com/doodle-art", "passage_text": "The doodle art of Dia Stafford wiggles and dances across the paper, flowing with fun and whimsy. Using primarily pen on paper, her detailed abstract designs are striking for both their playfulness and their neatness and precision of line. Dia's doodles are primarily abstract, but many pieces have a fun twist-such as doodles in the stylized shapes of fish or people that are filled with her fun patterns. She also explores alternative surfaces for her doodles, such as fabric tote bags, envelopes and paper plates."}, {"url": "http://www.instructables.com/id/Creating-Doodle-Art/", "passage_text": "Creating Doodle Art is so much fun. It is such a great way to relax after a stressful day. You can even carry markers and paper with you whenever you have to wait at the doctor's office, or any other type of event. It not only passes the time, but allows you to be creative. The first step to creating your doodle art is to draw your beginning lines to start from. Choose which part of the design you want to start with. It is really up to you. I chose the circle in the middle and placed a large dot. Next I will begin to add lines to connect the dot to the line completing the circle."}, {"url": "http://www.creativebloq.com/illustration/doodle-art-912775", "passage_text": "Here we've picked some great examples to inspire you. Doodling is a great, fun way of expressing yourself. But because everyone can do it, it's often underrated as an art form. Yet doodle art is a serious business for many-as these stunning examples prove. Combining child-like doodles with expressive illustrations, they show how doodling can be used to create beautiful and arresting designs"}, {"url": "http://www.creativebloq.com/illustration/doodle-art-912775", "passage_text": "If you don't think of doodling as a serious art form, then think again. Doodling is a great, fun way of expressing yourself. But because everyone can do it, it's often underrated as an art form. Yet doodle art is a serious business for many-as these stunning examples prove. Combining child-like doodles with expressive illustrations, they show how doodling can be used to create beautiful and arresting designs"}]