[{"url": "http://home.costhelper.com/auto-transport.html", "passage_text": "1 Transporting a car between Hawaii and the west coast runs $800-$1,360. 2  Car shipping between Seattle, Washington and Juneau, Alaska costs about $1,010, which includes a fuel surcharge of 15%. 3  The cost is slightly less if the mover drives the car onto the deck. 1 Moving a small van, pick up or SUV costs about $800-$1,070 from California to New York. 2  The larger versions of these vehicles run $900-$1,170. 3  The same summer price hikes apply. 4  Auto movers charge $650-$850 to transport sedans between New York and Florida"}, {"url": "http://www.moving.com/auto-transport/moving-car-options.asp", "passage_text": "1 Those with classic or expensive cars usually transport by enclosed trailer. 2  This keeps the vehicle from being damaged by rocks, weather, etc. 3  Having a car transported in an enclosed trailer will cost about $1,800 to $2,000 from coast-to-coast. 1 This keeps the vehicle from being damaged by rocks, weather, etc. 2  Having a car transported in an enclosed trailer will cost about $1,800 to $2,000 from coast-to-coast. 3  There are also companies that specialize in transporting classic and collector cars exclusively."}, {"url": "http://www.moving.com/auto-transport/moving-car-options.asp", "passage_text": "1 Enclosed. 2  Those with classic or expensive cars usually transport by enclosed trailer. 3  This keeps the vehicle from being damaged by rocks, weather, etc. 4  Having a car transported in an enclosed trailer will cost about $1,800 to $2,000 from coast-to-coast. 1 This keeps the vehicle from being damaged by rocks, weather, etc. 2  Having a car transported in an enclosed trailer will cost about $1,800 to $2,000 from coast-to-coast. 3  There are also companies that specialize in transporting classic and collector cars exclusively."}, {"url": "http://home.costhelper.com/auto-transport.html", "passage_text": "1 During peak summer months, it costs $200-$300 more to ship a vehicle across the country than during winter months. 2  Exotic or classic cars -- often higher end or specialty models on the way to car shows -- may be loaded by full lift gates into closed containers and cost $800-$3,000 extra. 1 Moving a small van, pick up or SUV costs about $800-$1,070 from California to New York. 2  The larger versions of these vehicles run $900-$1,170. 3  The same summer price hikes apply. 4  Auto movers charge $650-$850 to transport sedans between New York and Florid"}, {"url": "http://www.roadrunnerautotransport.com/?r=AW", "passage_text": "RoadRunner Auto Transport is a leading provider of nationwide door-to-door auto shipping services. Our dedicated team of shipping professionals will arrange and transport your vehicle with care from start to finish. 1 My experience with RoadRunner Auto Transport was easy and fast. 2  My car was safely transported over 3,000 miles from New Jersey to California in 4 days!. 3  Daniel A-Whittier, CA."}, {"url": "http://home.costhelper.com/auto-transport.html", "passage_text": "1 Coast to coast transport for a compact four-door sedan runs $600-$1,000. 2  The lower end of the scale represents shipping during the winter months, the higher end during peak summer periods. 3  Moving a small van, pick up or SUV costs about $800-$1,070 from California to New York. 1 Moving a small van, pick up or SUV costs about $800-$1,070 from California to New York. 2  The larger versions of these vehicles run $900-$1,170. 3  The same summer price hikes apply. 4  Auto movers charge $650-$850 to transport sedans between New York and Florida"}, {"url": "http://www.carsdirect.com/car-buying/average-car-shipping-cost-for-domestic-transport", "passage_text": "Some Average Costs. As stated previously, car shipping costs vary and depend on many factors. But on average, it will cost you $750 to ship a car from New York to Florida, $1200 to ship a car from Boston to California and $695 to ship a car from Chicago to Houston. If the car you are shipping is inoperable, it will cost you approximately $120 extra"}, {"url": "http://www.jandstransport.com/how-much-does-it-cost-to-ship-a-car/", "passage_text": "When a person gets an auto transport quote from a car delivery service like J&S Transportation, it’s a careful calculation subject to seasonal and other variables. Unlike many products and services, the cost of shipping a car cannot be fixed in advance. Tips to helps save money in the cost to ship a car. 1. Get multiple interstate auto transport quotes from multiple companies. 2. Compare prices from several car shipping companies. 3."}, {"url": "http://www.jandstransport.com/how-much-does-it-cost-to-ship-a-car/", "passage_text": "If your car is shipped terminal-to-terminal, there are terminal storage fees that accumulate each day the vehicle is kept in the terminal yard. Also, a terminal may be several hundred miles away from you, which can add travel costs for you to get to the closest terminal yard. This can be very misleading, so be careful. Tips to helps save money in the cost to ship a car. 1. Get multiple interstate auto transport quotes from multiple companies. 2. Compare prices from several car shipping companies. 3."}]