[{"url": "http://www.webmd.com/parkinsons-disease/tc/parkinsons-disease-symptoms", "passage_text": "The most common one is tremor. Tremor, or shaking, often in a hand, arm, or leg, occurs when you're awake and sitting or standing still (resting tremor), and it gets better when you move that body part. Tremor is often the first symptom that people with Parkinson's disease or their family members notice. The most common cause of non-Parkinson's tremor is essential tremor. It's a treatable condition that is often wrongly diagnosed as Parkinson's. Besides tremor, the most common symptoms include: 1  Stiff muscles (rigidity) and aching muscles. 2  One of the most common early signs of Parkinson's is a reduced arm swing on one side when you walk. 3  This is caused by rigid muscles. 4  Rigidity can also affect the muscles of the legs, face, neck, or other parts of the body"}, {"url": "http://www.medicinenet.com/parkinsons_disease/article.htm", "passage_text": "Parkinson's disease is the second most common neurodegenerative disorder and the most common movement disorder. It is characterized by progressive loss of muscle control, which leads to trembling of the limbs and head while at rest, stiffness, slowness, and impaired balance. Adult-onset Parkinson's disease is most common, but early-onset Parkinson's disease (onset between 21-40 years), and juvenile-onset Parkinson's disease (onset before age 21) also exist."}, {"url": "https://en.wikipedia.org/wiki/Parkinson%E2%80%99s_disease", "passage_text": "Other symptoms include sensory, sleep and emotional problems. Parkinson's disease is more common in older people, with most cases occurring after the age of 50; when it is seen in young adults, it is called young onset PD (YOPD). Parkinson's disease (PD, also known as idiopathic or primary parkinsonism, hypokinetic rigid syndrome (HRS), or paralysis agitans) is a degenerative disorder of the central nervous system mainly affecting the motor system."}, {"url": "https://www.sharecare.com/health/parkinsons-disease/how-common-is-parkinsons-disease", "passage_text": "Parkinson's disease becomes more common with age. Below the age of 40, the disease is rare. But for those 80 years or older, there's a 10 percent chance to developing the condition. Up to one million residents of the United States have it, while there are roughly four million cases worldwide. Parkinson's is not common until late in life."}, {"url": "http://www.ninds.nih.gov/disorders/parkinsons_disease/detail_parkinsons_disease.htm", "passage_text": "PD is the most common form of parkinsonism [1] , in which disorders of other causes produce features and symptoms that closely resemble Parkinson’s disease. While most forms of parkinsonism have no known cause, there are cases in which the cause is known or suspected or where the symptoms result from another disorder. Parkinson's disease (PD) is a degenerative disorder of the central nervous system that belongs to a group of conditions called movement disorders. It is both chronic, meaning it persists over a long period of time, and progressive, meaning its symptoms grow worse over time."}, {"url": "https://www.sharecare.com/health/parkinsons-disease/how-common-is-parkinsons-disease", "passage_text": "Parkinson’s disease is the second most common movement disorder that accounts for tremor (behind essential tremor), and it’s also the second most common neurodegenerative disease that we see, second only to Alzheimer’s disease. Below the age of 40, the disease is rare. But for those 80 years or older, there's a 10 percent chance to developing the condition. Up to one million residents of the United States have it, while there are roughly four million cases worldwide. Parkinson's is not common until late in life."}, {"url": "http://www.healthcommunities.com/parkinsons-disease/incidence-prevalence.shtml", "passage_text": "Parkinson's is rare in people younger than 30 years of age, and risk for the disease increases with age. It is estimated that 510% of patients who have Parkinson's experience symptoms before the age of 40. Parkinson's disease is common in the elderly and affects one person in 20 over the age of 80. Incidence and Prevalence of Parkinson's. According to the Parkinson's Disease Foundation, Parkinson's disease affects about 1 million people in the United States and more than 4 million people worldwide. About 60,000 people are diagnosed each year in the United States"}, {"url": "http://www.webmd.com/parkinsons-disease/default.htm", "passage_text": "The most common one is tremor. Tremor, or shaking, often in a hand, arm, or leg, occurs when you're awake and sitting or standing still (resting tremor), and it gets better when you move that body part. Tremor is often the first symptom that people with Parkinson's disease or their family members notice. At first the tremor may appear in just one arm or leg or only on one side of the body. The tremor also may affect the chin, lips, and tongue. As the disease progresses, the tremor may spread to both sides of the body. Symptoms of Parkinson's disease differ from person to person. They also change as the disease progresses. Symptoms that one person gets in the early stages of the disease, another person may not get until later-or not at all. Symptoms typically begin appearing between the ages of 50 and 60."}]