[{"url": "https://answers.yahoo.com/question/index?qid=20100824145520AAtTFVM", "passage_text": "To get a PhD, you can either do a masters first, or enroll in a PhD program after the bachelors, in which case you'd take the masters coursework before working on the PhD even if you don't get a masters degree specifically (this is called masters en route). A bachelors degree is a 4-year degree. However, many people are taking 5 or more years to complete one. A masters degree comes after the bachelors and takes 1-3 years."}, {"url": "https://www.quora.com/How-long-does-it-take-to-complete-a-doctorate-PhD-after-completing-a-bachelors-of-engineering-in-the-USA", "passage_text": "If you do a thesis Master's, then it might take a while longer to do complete the PhD than if you don't. You can't reuse the same results from the Master's research in your PhD thesis. If the Master's thesis is in a different area from the PhD thesis, then that might be another year of work. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100824145520AAtTFVM", "passage_text": "A bachelor's degree usually takes 4 years. A master's degree usually takes 2 years. A doctorate degree can take 2 to several years pending the research required. This assumes you go straight through at each level and are attending school full time. A bachelors degree is a 4-year degree. However, many people are taking 5 or more years to complete one. A masters degree comes after the bachelors and takes 1-3 years."}, {"url": "http://learn.org/articles/How_Long_Does_a_Masters_Program_Typically_Take_to_Complete.html", "passage_text": "In most cases, a master's degree program takes two years to complete, although there are exceptions to the rule. If you'd like to know how long it would take to earn a master's degree, you should consider how much time you could devote to school and the specific type of program you'll be enrolling in. In a combined bachelor's and master's degree program, you will be able to use some of the credits you earn as an undergraduate student toward your graduate studies. These programs usually take a total of five years to complete, or one year longer than a normal bachelor's degree program."}, {"url": "https://answers.yahoo.com/question/index?qid=20080815152511AA93mTr", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: It generally takes 2 years to complete a master's and after that I would say at least 3-4 to complete a Ph.D. although many doctorates take much longer than that: sometimes up to 6-8 years. I wrote mine in two years, but I know people who took much longer. If you are doing clinical psychology, it could take longer, because you may need to do clinical training. Someone suggested getting a Master's first."}, {"url": "http://www.bestmastersdegrees.com/best-masters-degrees-faq/how-long-does-it-take-to-receive-a-masters-degree", "passage_text": "Bachelor’s degree programs range between 120 credit hours and 150 credit hours. Depending on the credit hours required, it can take 4 to 5 years, on a full-time basis, to earn your undergraduate degree. If you know the route that you plan on taking before you even enter an undergraduate program, you need to consider the time it takes to earn your Bachelor’s degree. A Bachelor’s degree is the most common prerequisite to enter any Master’s degree or MBA program with any public or private institution."}, {"url": "http://study.com/articles/How_Long_Does_it_Take_to_Get_a_Masters_Degree.html", "passage_text": "The typical on-site master's degree program takes two years of full-time study to complete. These are often considered terminal degrees, and graduates usually receive the advanced training necessary to enter or advance in a chosen profession. In the instance of dual degree programs, the length of time to receive a master's degree depends on the additional degree program, and may take as few as four years or as many as ten."}, {"url": "http://www.bestmastersdegrees.com/best-masters-degrees-faq/how-long-does-it-take-to-receive-a-masters-degree", "passage_text": "The average full-time student will earn their Master’s degree in 1.5 to 2 years, but some students take longer due to their schedule restrictions. If you consider the time it takes to earn a Bachelor’s, you will spend between 5 and 7 years in college and graduate school to earn your degree. If you know the route that you plan on taking before you even enter an undergraduate program, you need to consider the time it takes to earn your Bachelor’s degree. A Bachelor’s degree is the most common prerequisite to enter any Master’s degree or MBA program with any public or private institution."}, {"url": "https://answers.yahoo.com/question/index?qid=20100824145520AAtTFVM", "passage_text": "it usually takes about 2 years for a masters and 3 - 4 for the phd. Edit: bachelors can take 3 to 5 depending on the program. And the same for masters or phd, it depends on the subject and your motivation. Chad · 5 years ago. A bachelors degree is a 4-year degree. However, many people are taking 5 or more years to complete one. A masters degree comes after the bachelors and takes 1-3 years."}]