[{"url": "https://en.wikipedia.org/wiki/History_of_the_Scottish_National_Party", "passage_text": "In Scotland, the Scottish National Party (SNP) is a centre left, social democratic political party which campaigns for Scottish independence. The SNP has controlled Scotland's devolved legislature since the 2007 election as a minority government, and since the 2011 election as a majority government. The first term of the Scottish Parliament did not offer the SNP much comfort. Two MSPs quit the party, Margo MacDonald and Dorothy-Grace Elder, citing the actions of some of their colleagues as reasons for their resignations."}, {"url": "http://www.alacritech.com/legacypdf/SNP_ATCP_Drivers_What_Does_SNP_Mean.pdf", "passage_text": "These drivers will only work on systems that support SNP, and only if SNP is installed. SNP aware drivers will have a major number of 9 or higher (9.x.x.x). SNP Drivers NDIS version SNP drivers are sometimes referred to by their NDIS version. NDIS stands for Network Driver Interface Specification. With the advent of native support for TCP offload in Windows introduced by Microsoft's SNP [Scalable Networking Pack] comes a new driver architecture for Alacritech TCP offload hardware."}, {"url": "http://www.alacritech.com/legacypdf/SNP_ATCP_Drivers_What_Does_SNP_Mean.pdf", "passage_text": "From this point on, all Alacritech Accelerator drivers can now be classified as either SNP drivers or ATCP drivers. Windows Server 2003 x86 supports both SNP and ATCP drivers. For Windows Server 2003 x86, unless specific features provided by the ATCP drives are required, SNP aware drivers are preferred. SNP Drivers SNP aware drivers are those that are designed to work in conjunction with Microsoft's Scalable Networking Pack. With the advent of native support for TCP offload in Windows introduced by Microsoft's SNP [Scalable Networking Pack] comes a new driver architecture for Alacritech TCP offload hardware."}, {"url": "https://www.medicare.gov/sign-up-change-plans/medicare-health-plans/medicare-advantage-plans/special-needs-plans.html", "passage_text": "How Medicare SNPs work. Medicare SNPs are a type of Medicare Advantage Plan (like an HMO or PPO). Medicare SNPs limit membership to people with specific diseases or characteristics, and tailor their benefits, provider choices, and drug formularies to best meet the specific needs of the groups they serve."}, {"url": "http://www.cms.gov/Medicare/Health-Plans/SpecialNeedsPlans/DualEligibleSNP.html", "passage_text": "Dual Eligible Special Needs Plans (D-SNPs) enroll beneficiaries who are entitled to both Medicare (Title XVIII) and Medical Assistance from a State Plan under Title XIX (Medicaid), and offer the opportunity of enhanced benefits by combining those available through Medicare and Medicaid. An all-dual D-SNP enrolls beneficiaries who are eligible for Medicare Advantage and who are entitled to Medicaid assistance under a State/Territorial plan."}, {"url": "http://www.cms.gov/Medicare/Health-Plans/SpecialNeedsPlans/DualEligibleSNP.html", "passage_text": "This type of D-SNP limits enrollment to QMBs only and QMBs with comprehensive Medicaid benefits (QMB+), the two categories of dual eligible beneficiaries who are not financially responsible for cost sharing for Medicare Parts A or B. An all-dual D-SNP enrolls beneficiaries who are eligible for Medicare Advantage and who are entitled to Medicaid assistance under a State/Territorial plan."}, {"url": "https://en.wikipedia.org/wiki/Scottish_National_Party", "passage_text": "The SNP came to power in the 2007 Scottish general election, forming a minority government, before going on to win the 2011 election, after which it formed Scotland's first majority government. As of October 2015, the SNP is the largest political party in Scotland in terms of membership. With over 114,000 members, including 64 MSPs, 55 MPs and over 400 local councillors, more than 2% of the Scottish population is a member of the party. In the 2007 Scottish Parliamentary general election the SNP emerged as the largest party with 47 seats, narrowly ousting the Scottish Labour Party with 46 seats and Alex Salmond became Scottish First Minister."}, {"url": "https://en.wikipedia.org/wiki/Scottish_National_Party", "passage_text": "The SNP was formed in 1934 through the merger of the National Party of Scotland and the Scottish Party, with Robert Bontine Cunninghame Graham as its first president. In the 2007 Scottish Parliamentary general election the SNP emerged as the largest party with 47 seats, narrowly ousting the Scottish Labour Party with 46 seats and Alex Salmond became Scottish First Minister."}, {"url": "https://en.wikipedia.org/wiki/Scottish_National_Party", "passage_text": "The SNP was formed through the merger of the centre-left National Party of Scotland (NPS) and the centre-right Scottish Party. The SNP’s founders were united over self-determination in principle, though not its exact nature, or the best strategic means to achieve self-government. In the 2007 Scottish Parliamentary general election the SNP emerged as the largest party with 47 seats, narrowly ousting the Scottish Labour Party with 46 seats and Alex Salmond became Scottish First Minister."}]