[{"url": "http://www.birminghamcancer.nhs.uk/uploads/document_file/document/4cc5b6c9358e9875680001e7/skin_graft.pdf", "passage_text": "It may take between 6 to 8 weeks for the graft to completely heal. You should take extra care of the graft site when out in the sun. The skin graft should be covered or a sunscreen of factor 30 or higher should be applied. This is because the area will be extra sensitive to the sun’s harmful effects. Wounds of split donor skin graft sites are often more uncomfortable than the graft site. If you have been given painkillers to take home with you, take them as instructed, otherwise painkillers such as paracetamol should be taken as required (although you should not take more than 8 tablets in a 24 hour period)."}, {"url": "http://www.nhs.uk/Conditions/Plastic-surgery/Pages/How-it-is-performed.aspx", "passage_text": "The donor area of partial thickness skin grafts will usually take about two weeks to heal. For full thickness skin grafts, the donor area only takes about 5 to 10 days to heal, because it's normally quite small and closed with stitches. At first, the grafted area will appear reddish-purple, but it should fade over time. It can take a year or two for the appearance of the skin to settle down completely"}, {"url": "http://faziomd.com/faziomd_website_018.htm", "passage_text": "Wound Care Instructions For Full Thickness Skin Grafts. Your wound has been repaired by covering it with a full-thickness skin graft. Skin has been removed from a donor area and then sutured onto your wound. The donor area may be allowed to heal on its own or is closed with stitches. The results are usually good, but it may take many weeks to months for the area to look its best"}, {"url": "http://health.howstuffworks.com/skin-care/information/anatomy/skin-graft4.htm", "passage_text": "The healing process for skin grafts can be slow, depending on the severity of the wound and the size and depth of the donor sites. Patients who receive full-thickness grafts may need to stay in the hospital for as long as two weeks to keep the graft stabilized and infection-free. For a skin graft to heal, it must grow and activate new blood vessels. In a successful graft, this regeneration process begins as quickly as 36 hours after surgery [source: Medline Plus ]. Because oxygen is so important to the healing process, some doctors prescribe hyperbaric oxygen therapy."}, {"url": "http://www.nhs.uk/Conditions/Plastic-surgery/Pages/How-it-is-performed.aspx", "passage_text": "There are two main types of skin graft: 1  a full thickness skin graft – the top layer of skin (epidermis) and all the layers of skin underneath (dermis) are removed and the area is closed with stitches; only a small area of skin will be removed, usually from the neck, behind the ear or the inner side of the upper arm. For full thickness skin grafts, the donor area only takes about 5 to 10 days to heal, because it's normally quite small and closed with stitches. At first, the grafted area will appear reddish-purple, but it should fade over time."}, {"url": "http://www.birminghamcancer.nhs.uk/uploads/document_file/document/4cc5b6c9358e9875680001e7/skin_graft.pdf", "passage_text": "If this is not possible, the wound may be repaired using a skin graft. A skin graft is a piece of skin taken from another part of the body (donor site) and used to cover the wound (graft site). Types of skin graft Skin grafts can be either: • Full thickness. • Split thickness. Wounds of split donor skin graft sites are often more uncomfortable than the graft site. If you have been given painkillers to take home with you, take them as instructed, otherwise painkillers such as paracetamol should be taken as required (although you should not take more than 8 tablets in a 24 hour period)."}, {"url": "http://www.nhs.uk/Conditions/Plastic-surgery/Pages/How-it-is-performed.aspx", "passage_text": "A skin graft is a surgical procedure where healthy skin is removed from an unaffected area of the body and used to cover lost or damaged skin. Skin grafts may be used for bone fractures that break the skin (open fractures), large wounds, surgical removal of an area of the skin (for example, because of cancer) and burns. For full thickness skin grafts, the donor area only takes about 5 to 10 days to heal, because it's normally quite small and closed with stitches. At first, the grafted area will appear reddish-purple, but it should fade over time."}, {"url": "http://www.myskincancercentre.com.au/questionb/long-take-skin-graft-heal/", "passage_text": "Split thickness grafts on the lower legs in elderly patients take the longest to heal. Donor sites (from where the graft is harvested) take between 5 days (full thickness donor site) to 3 weeks (split thickness graft) to heal up. Posted On: Oct 19, 2013. Healing times range from 9-21 days, depending on the type of skin graft, the location of the graft and other factors, including your general health and circulation. Full thickness grafts on the nose and ears heal the fastest."}, {"url": "http://www.myskincancercentre.com.au/questionb/long-take-skin-graft-heal/", "passage_text": "Healing times range from 9-21 days, depending on the type of skin graft, the location of the graft and other factors, including your general health and circulation. Posted On: Oct 19, 2013. Healing times range from 9-21 days, depending on the type of skin graft, the location of the graft and other factors, including your general health and circulation. Full thickness grafts on the nose and ears heal the fastest."}]