[{"url": "http://www.efowl.com/White_Silkie_Bantam_Chickens_p/2375.htm", "passage_text": "Email me when this is Available. White Silkie Bantam Chicken Silkie Chickens are a truly unique and one of a kind breed of chicken originating in Asia. Silkie Chickens are ideal as pets and the hens are especially broody and will raise chicks from other species. Of all Bantam Chicken breeds, the Silkie is by far one of the most popular and has even been referred to as the lap dog of chickens. They have multiple features to qualify them as a fancy breed: Turquoise earlobes, Five toes, Crests, and Feathered feet."}, {"url": "http://www.efowl.com/Black_Silkie_Bantam_Chickens_p/2377.htm", "passage_text": "Black Silkie Bantam Chicken. Though Silkie Chickens are small and usually considered Bantam breed, some regions consider there to be large standard breed as well. Even the true large version of the Silkie is extremely small compared to other chicken breeds."}, {"url": "http://www.ansi.okstate.edu/breeds/poultry/chickens/silkiebantam/index.html", "passage_text": "Poultry Breeds-Silkie (Bantam) Chicken. In America, Silkies are considered bantams, whereas in Great Britain they are large fowl. Origins: The Silkie is originates from Asia, most believe China or Japan while others favor India."}, {"url": "http://www.backyardchickens.com/products/silkie", "passage_text": "Silkies are a wonderful bantam pet breed in my experience. They have funny personalities and are friendly, even with children. They make great, nurturing mothers and even the roosters are often good with chicks. This is why some use silkies to hatch eggs from other types of poultry."}, {"url": "http://www.youtube.com/watch?v=nDwTs5zSYhs", "passage_text": "Silkie chickens are believed to have originated from China. Their fluffy feathers, black bones and skin ensure that they are almost always kept as pet chickens for eggs. In Europe and Australia, there are both standard size silkie chickens and bantam Silkies."}, {"url": "http://www.efowl.com/Black_Silkie_Bantam_Chickens_p/2377.htm", "passage_text": "Bantam Silkie Chickens are excellent pets and the hens are especially broody and will raise chicks from other species. Of all Bantam Chicken breeds, the Silkie is by far one of the most popular and has even been referred to as the lap dog of chickens."}]