[{"url": "http://www.bcbsms.com/com/bcbsms/apps/PolicySearch/views/ViewPolicy.php?&noprint=yes&path=%2Fpolicy%2Femed%2FSacroiliac_Joint_Arthrography.html", "passage_text": "12/13/2004: Clarification under Policy to add a single as follows: Sacroiliac joint arthrography with a single injection for diagnostic purposes (and potential pain relief) with or without the anticipation of lumbar fusion is considered medically necessary. Up to TWO injections per calendar year are allowed. If a provider injects medication without radiographic control, it is not certain if in reality the injection is made into the joint or around it. In such a case, the service is considered to be a trigger point injection."}, {"url": "http://www.surgeryencyclopedia.com/A-Ce/Arthrography.html", "passage_text": "A normal arthrography exam will show proper placement of the dye or contrast medium throughout the joint structures, joint space, cartilage, and ligaments. The entire lining of the joint becomes opaque from the technique, which allows the radiologist to see abnormalities in the intricate workings of the joint. In the case of recurrent shoulder dislocations, arthrography results can be used to evaluate damage."}, {"url": "http://www.radiologyinfo.org/en/pdf/arthrog.pdf", "passage_text": "Alternate methods of direct arthrography examinations may also usemagnetic resonance imaging (MRI) or computed tomography (CT) following contrast material injectioninto the joint.An x-ray (radiograph) is a noninvasive medical test that helps physicians diagnose and treat medicalconditions. The images can then beexamined on a computer monitor, printed or copied to CD. MRI does not use ionizing radiation (x-rays).CT direct arthrography uses the same type of contrast material as conventional direct arthrography andmay be supplemented by air to produce a double contrast CT arthrogram."}, {"url": "https://www.hillmedical.com/ct_mr_arthrography/preparations.php", "passage_text": "Some conditions, such as severe kidney disease, may prevent you from being given contrast material for having an MRI. If you are scheduled to have MR or CT arthrography and have claustrophobia (fear of enclosed spaces) or anxiety, you may want to ask your physician about being sedated prior to the scheduled examination. Jewelry and other accessories should be left at home if possible, or removed prior to the MRI scan."}, {"url": "http://www.radiologyinfo.org/en/info.cfm?pg=arthrog", "passage_text": "Arthrography is medical imaging to evaluate conditions of joints. It can either be direct or indirect. Indirect arthrography is a medical imaging technique in which contrast material is injected into the blood stream and eventually absorbs into the joint. With direct arthrography, however, the contrast material is injected directly into the joint. Direct arthrography is the preferred method because it is better for distending or enlarging the joint and imaging small internal structures, thus allowing for better evaluation of diseases or conditions within the joint. 1 Direct arthrography is particularly effective for detecting disease of the structures within the joints such as ligaments, tendons and cartilage. 2  This is particularly true for the shoulder in the setting of shoulder dislocation and in the hip, wrist and elbow."}, {"url": "https://www.tristateimaging.com/service/mr-arthrography/", "passage_text": "This procedure is useful for the diagnosis of subtle joint abnormalities which may not be obvious in a standard MRI scan. MR arthrography allows the physician to better identify tears and provides patients with an accurate diagnosis to determine whether or not surgery is needed. Patient referred for 3T MRI Arthrography of the shoulder for suspicion of labral injury. Injection of Gadolinium based contrast agent allowed for visualization of the labrum and subsequent diagnosis of posterior tear."}, {"url": "https://www.tristateimaging.com/service/mr-arthrography/", "passage_text": "MR arthrography involves the injection of contrast material into the joint and an MRI scan is performed immediately after the injection. Patient referred for 3T MRI Arthrography of the shoulder for suspicion of labral injury. Injection of Gadolinium based contrast agent allowed for visualization of the labrum and subsequent diagnosis of posterior tear."}, {"url": "http://www.radiologyinfo.org/en/info.cfm?pg=arthrog", "passage_text": "Alternate methods of direct arthrography examinations may also use magnetic resonance imaging (MRI) or computed tomography (CT) following contrast material injection into the joint. An x-ray (radiograph) is a noninvasive medical test that helps physicians diagnose and treat medical conditions. 1 Direct arthrography is particularly effective for detecting disease of the structures within the joints such as ligaments, tendons and cartilage. 2  This is particularly true for the shoulder in the setting of shoulder dislocation and in the hip, wrist and elbow."}, {"url": "http://www.surgeryencyclopedia.com/A-Ce/Arthrography.html", "passage_text": "An arthrography procedure may locate cysts in the joint area, evaluate problems with the joint's arrangement and function, indicate the need for joint replacement, or show problems with existing joint replacement (prostheses). The most commonly studied joints are the knee and shoulder. The entire lining of the joint becomes opaque from the technique, which allows the radiologist to see abnormalities in the intricate workings of the joint. In the case of recurrent shoulder dislocations, arthrography results can be used to evaluate damage."}]