[{"url": "https://answers.yahoo.com/question/index?qid=20080329063748AA5JOIh", "passage_text": "Best Answer: Horse will carry their foals for 11 months. There are some precautions to take during the last two to three months of pregnancy. Each horse being an individual has a variation in the total number of days being preganant. Some mares go exactly 340-342 days, some go longer, some go shorter, Some have been known to go as long as 12-13 months."}, {"url": "http://www.duncity.net/horses/foalingcalc.htm", "passage_text": "Use these handy calculators to estimate her foaling date and to track the number of days in foal this pregnancy. If you know the number of days in foal on a previous pregnancy, you can check that number against this pregnancy to see how close she is to repeating her cycle each year. "}, {"url": "http://www.horses-and-horse-information.com/articles/0196foal.shtml", "passage_text": "Most mares will begin to bag up in the last month to month and a half of gestation. This means that her udder will begin to swell. Many mares will resist attempts to touch their udders or nipples, which can interfere with the foal s nursing attempts. You can also tell that the foal is breech by the flexion of the foal s hind feet. A foal s front feet will flex down toward the mare s hooves, but in a breech delivery, the hooves flex upward toward the mare s tail."}, {"url": "https://answers.yahoo.com/question/index?qid=20080329063748AA5JOIh", "passage_text": "11 months more or less. Each horse being an individual has a variation in the total number of days being preganant. Some mares go exactly 340-342 days, some go longer, some go shorter, Some have been known to go as long as 12-13 months. Donkeys in particular are more likely to carry a foal for 12-13 month"}, {"url": "http://horses.about.com/od/basiccare/a/Horse-Reproduction.htm", "passage_text": "After about 315 days of pregnancy, the mare will start to show signs of foaling. The yellowish fluid will turn into the first milk or colostrum. The udder may drip, and the muscles around her tail head may become more relaxed. Her belly may appear to drop, as the foal positions for birth. After about three months the foal will be developing rapidly and start to look like a small horse. After about six months, the mare may start to be visibly pregnant. Mares that have foaled before may show an expanding belly sooner than a maiden mare."}, {"url": "http://thalequine.com/the-late-term-pregnant-mare-foaling-and-the-newborn-foal-care/", "passage_text": "The average mare has a pregnancy of about 335 days, but normal pregnancies occasionally last over 365 days. The defining aspect of the last part of the equine pregnancy is that the fetus gains size and weight most rapidly during this time, doubling in size and weight during the last 4 to 6 weeks. The mare uses more energy – and requires more nutrition – from the last 6 weeks of pregnancy through the first 6 weeks after foaling than she does at any other time. For a mare that enters the last months of pregnancy in poor condition, it can be very difficult to feed enough to improve her condition."}, {"url": "http://www.wikihow.com/Care-for-a-Pregnant-Mare", "passage_text": "Look into the correct vaccination schedule for pregnant mares. The mare needs pneumabort at 5, 7 and 9 months to prevent abortion from rhino. Rhino is brought in by new horse's, lives in the ground and can be In the water. One month prior to foaling she should be wormed and have a five way spring vaccines, rabies and West Nile. Make sure that you have a large paddock for the mare to graze and exercise, in the coming months before birth. This bigger paddock will be the mare's home for the first 8 and a half months. This paddock should have 24/7 access to water, shelter and adequate fencing."}, {"url": "http://horses.about.com/od/basiccare/a/Horse-Reproduction.htm", "passage_text": "A mare can only produce one foal per year. A stallion is capable of producing around two hundred foals per year. A mare is capable of producing a foal at about eighteen months of age, but it is healthier for mare and foal if the mare is at least four years old. A stallion can start breeding mares as early as two years (in some cases earlier), but it is healthier for the young stallion if breeding does not begin until four years. After about three months the foal will be developing rapidly and start to look like a small horse. After about six months, the mare may start to be visibly pregnant. Mares that have foaled before may show an expanding belly sooner than a maiden mare."}]