[{"url": "http://www.buzzfile.com/business/Big-Island-Dairy-LLC-808-895-3584", "passage_text": "Business Description. Big Island Dairy is located in Ookala, Hawaii. This organization primarily operates in the Dairy Farms business / industry within the Agricultural Production-Livestock and Animal Specialties sector. The phone number for Big Island Dairy is (808) 895-3584. Big Island Dairy is located at Highway 11 Mile Marker 30, Ookala, HI 96774. Big Island Dairy has been in business for approximately 4 years."}, {"url": "http://hdoa.hawaii.gov/blog/main/bidairyopenhouse/", "passage_text": "OOKALA, Hawaii — Big Island Dairy, the largest of two dairies in the State of Hawaii, held an open house on Monday to showcase advances the dairy has accomplished since changing ownership in December 2012. The dairy also uses modern technology and methods to address environmental concerns, such as waste disposal, wastewater and run-off management. Presently, the only other commercial dairy in the state is Clover Leaf Dairy, also on Hawaii Island and operated by Ed Boteilho, who was also present at the event."}, {"url": "http://vancedairyconstruction.blogspot.com/2013/08/ookala-hawaii.html", "passage_text": "Ookala, Hawaii. Hawaii, everyone's dream destination for vacation, has been quite a challenge when it comes to construction. It all began more than a year ago with site evaluation, plan designing, and engineering challenges. The dairy is located on the Big Island at Ookala, half way between Waimea and Hilo, at mile marker 30, the average slope is 12% and there is the possibility of hurricanes, earthquakes and 80 inches of rain per year. July of 2012 found Kelly Vance in Hawaii taking classes and testing for his Hawaii Contractor's License"}, {"url": "http://www.buzzfile.com/business/Big-Island-Dairy-LLC-808-895-3584", "passage_text": "Questions & Answers. The phone number for Big Island Dairy is (808) 895-3584. Big Island Dairy is located at Highway 11 Mile Marker 30, Ookala, HI 96774. Big Island Dairy has been in business for approximately 4 years. Big Island Dairy is estimated to generate $1.7 million in annual revenues, and employs approximately 21 people at this location"}, {"url": "https://en.wikipedia.org/wiki/Ookala,_Hawaii", "passage_text": "ʻŌʻōkala (also spelled Ookala) is an unincorporated community on the island of Hawaii in Hawaii County, Hawaii, United States. Its elevation is 371 feet (113 m), and it is located at 20°1′3″N 155°17′14″W﻿ / ﻿20.01750°N 155.28722°W﻿ / 20.01750; -155.28722 Coordinates: 20°1′3″N 155°17′14″W﻿ / ﻿20.01750°N 155.28722°W﻿ / 20.01750; -155.28722 (20.0175000, -155.2872222)."}, {"url": "http://listings.findthecompany.com/l/27727343/Big-Island-Dairy-Llc-in-Ookala-HI", "passage_text": "Big Island Dairy LLC is a small, fairly new dairy farm in Ookala, Hawaii. It opened in 2011 and now has an estimated $1.7 million in yearly revenue and 21 employees. According to D&B, Big Island Dairy LLC employs 21 people, which is significantly more than its dairy farming competitors in both Hawaii County and the United States (where the median employee count is 2). Revenue per Employee. For every employee, Big Island Dairy LLC brings in an estimated $80,952 in revenue a year."}, {"url": "http://www.to-hawaii.com/big-island/cities/ookala.php", "passage_text": "Weather Geography Districts. O'okala is a small community of fewer than 200 people on the Big Island's lush Hamakua Coast, about 4 miles (6.4 km) north of Laupahoehoe. Before the year 2000, the town had multiple names until the Board of Geographic Names ruled that the town would be called O'okala. "}, {"url": "http://vancedairyconstruction.blogspot.com/2013/08/ookala-hawaii.html", "passage_text": "This year finds us on the Big Island of Hawaii, building a dairy for Steve Whitesides. We are also in Newcastle, Utah building a parlor for Bob Holt, and in Outlook, Washington updating the manure system for Jeff Bosma. Hawaii, everyone's dream destination for vacation, has been quite a challenge when it comes to construction. It all began more than a year ago with site evaluation, plan designing, and engineering challenges."}, {"url": "http://listings.findthecompany.com/l/27727343/Big-Island-Dairy-Llc-in-Ookala-HI", "passage_text": "According to Dun & Bradstreet, Big Island Dairy LLC earns an estimated $1.7 million a year, making it one of the largest dairy farms in both Hawaii County and the United States. According to D&B, Big Island Dairy LLC employs 21 people, which is significantly more than its dairy farming competitors in both Hawaii County and the United States (where the median employee count is 2). Revenue per Employee. For every employee, Big Island Dairy LLC brings in an estimated $80,952 in revenue a year."}]