[{"url": "http://www.audioenglish.org/dictionary/ingestion.htm", "passage_text": "• INGESTION (noun). The noun INGESTION has 1 sense: 1. the process of taking food into the body through the mouth (as by eating). Familiarity information: INGESTION used as a noun is very rare. "}, {"url": "http://www.oxforddictionaries.com/definition/english/ingest", "passage_text": "1 It doesn't interfere with any other ingestive behaviors such as food or water, which amperozide does a little in the animals. 2  Decreased ingestive behavior, impaired cognitive functioning, increased sleep, and altered mood have been reported by individuals experiencing immune activation or cytokine treatment. 1 Every physical ailment is classified as warm or cold, and its cure depends on restoring the body's equilibrium by ingesting foods with the opposite properties. 2  The gut model only allows for a mass intake on a daily basis that does not exceed the mass of the animal ingesting the food."}, {"url": "http://www.merriam-webster.com/dictionary/ingest", "passage_text": "Full Definition of INGEST. transitive verb. : to take in for or as if for digestion. — in·gest·ible \\-ˈjes-tə-bəl\\ adjective. — in·ges·tion \\-ˈjes-chən, -ˈjesh-\\ noun. "}, {"url": "http://www.thefreedictionary.com/Ingestion", "passage_text": "1. ingestion-the process of taking food into the body through the mouth (as by eating). consumption, intake, uptake. eating, feeding-the act of consuming food. deglutition, swallow, drink-the act of swallowing; one swallow of the liquid was enough; he took a drink of his beer and smacked his lips. "}, {"url": "http://www.wordreference.com/es/translation.asp?tranword=ingestion", "passage_text": "Principal Translations. ingestion nnoun: Refers to person, place, thing, quality, etc. (consumption, swallowing). ingestion ingestión nfnombre: Femenino sustantivo de genero género (exclusivamente, femenino). mesa tabla ingesta: Nfnombre femenino sustantivo de genero (género, exclusivamente). femenino mesa tabla"}, {"url": "https://en.wikipedia.org/wiki/Ingestion", "passage_text": "Ingestion is the consumption of a substance by an organism. In animals, it normally is accomplished by taking in the substance through the mouth into the gastrointestinal tract, such as through eating or drinking. In single-celled organisms, ingestion can take place through taking the substance through the cell membrane. Ingestion can also refer to a mechanism picking up something and making it enter an internal hollow of that mechanism, e.g.  a grille was fitted to prevent the pump from ingesting driftwood ."}, {"url": "http://www.oxforddictionaries.com/definition/english/ingest", "passage_text": "1 Take (food, drink, or another substance) into the body by swallowing or absorbing it: lead will poison anyone if enough is ingested they ingest oxygen from the air. More example sentences. 1  Frugivorous vertebrates ingest fruits and the seeds within, later defecating the seeds. 1 Every physical ailment is classified as warm or cold, and its cure depends on restoring the body's equilibrium by ingesting foods with the opposite properties. 2  The gut model only allows for a mass intake on a daily basis that does not exceed the mass of the animal ingesting the food."}, {"url": "http://www.wordreference.com/es/translation.asp?tranword=ingestion", "passage_text": "English-Spanish Spanish-English English-Italian Italian-English English-French French-English English definition English synonyms Espanol-Español Francais-Français Francais-Français Espanol-Español Espanol: español Portugues: português Portugues: português espanol... español espanol español definicion definición espanol español sinonimos sinónimos catala català definicio definició more ingestion nnoun: Refers to person, place, thing, quality, etc. (consumption, swallowing). ingestion ingestión nfnombre: Femenino sustantivo de genero género (exclusivamente, femenino). mesa tabla ingesta: Nfnombre femenino sustantivo de genero (género, exclusivamente). femenino"}, {"url": "http://www.macmillandictionary.com/dictionary/british/ingest", "passage_text": "90% of the time, speakers of English use just 7,500 words in speech and writing. These words appear in red, and are graded with stars. One-star words are frequent, two-star words are more frequent, and three-star words are the most frequent. "}, {"url": "http://www.merriam-webster.com/medical/ingestion", "passage_text": "Medical Definition of INGESTION. : the taking of material (as food) into the digestive system. Dictionary: Definition of ingestion. Spanish Central: Spanish translation of ingestion. Nglish: Translation of ingestion for Spanish speakers. "}]