[{"url": "http://www.cdc.gov/pneumococcal/drug-resistance.html", "passage_text": "Antibiotics are medicines used to kill the bacteria that cause disease. However, bacteria can change—or mutate—making it possible to resist antibiotics. This is known as antibiotic resistance. Many bacteria, including some Streptococcus pneumoniae (pneumococcus), have become resistant to one or many"}, {"url": "http://www.rxlist.com/antibiotic_resistance-page3/drugs-condition.htm", "passage_text": "Antibiotic use promotes development of antibiotic-resistant bacteria. Every time a person takes antibiotics, sensitive bacteria are killed, but resistant germs may be left to grow and multiply. Repeated and improper uses of antibiotics are primary causes of the increase in drug"}, {"url": "http://www.cdc.gov/flu/about/qa/antiviralresistance.htm", "passage_text": "Getting a yearly seasonal flu vaccination is the first and most important step in preventing the flu. The vaccine protects against an influenza A (H1N1) virus, an influenza A (H3N2) virus, and one or two influenza B viruses (depending on the vaccine)."}, {"url": "http://www.usatoday.com/story/news/health/2013/02/08/whooping-cough-may-be-becoming-resistant-to-vaccines/1903439/", "passage_text": "Those cases are a fraction of the damage caused by whooping cough in the pre-vaccine era. In the 1930s, doctors reported more than 250,000 cases a year, according to the CDC. In the new study, genetic tests showed signs of resistance in 11 of 12 children hospitalized for whooping cough in Philadelphia in 2011 and 2012."}, {"url": "http://www.nhs.uk/Conditions/Tuberculosis/Pages/Introduction.aspx", "passage_text": "With treatment, TB can usually be cured. Most people will need a course of antibiotics, usually for six months. Several different antibiotics are used. This is because some forms of TB are resistant to certain antibiotics. If you are infected with a drug-resistant form of TB, treatment can last as long as two years."}, {"url": "http://www.usatoday.com/story/news/health/2013/02/08/whooping-cough-may-be-becoming-resistant-to-vaccines/1903439/", "passage_text": "Whooping cough may be becoming resistant to vaccines. For the first time, American researchers have found evidence that the bacteria that cause whooping cough are becoming resistant to vaccines, a new study shows. Post to Facebook."}]