[{"url": "http://www.webmd.com/drugs/2/drug-87136/dristan-cold-oral/details", "passage_text": "Uses. This combination medication is used to temporarily treat symptoms caused by the common cold, flu, allergies, or other breathing illnesses (such as sinusitis, bronchitis). Decongestants help relieve stuffy nose, sinus, and ear congestion symptoms. Cough-and-cold products have not been shown to be safe or effective in children younger than 6 years. Therefore, do not use this product to treat cold symptoms in children younger than 6 years unless specifically directed by the doctor."}, {"url": "http://healthquestions.medhelp.org/flonase-antihistamine", "passage_text": "Nasonex, Rhinocort, Flonase) and a prescription antihistamine such as Zyrtec or Allegra. In cases where sinus infection persists despite this treatment, one may need to seriously consider the possibility that acid reflux is causing these symptoms and one will need to begin more aggressive treatment for acid reflux. If your nose has cleared up from the nasal steroid (flonase) and antihistamine (allegra) but your nose is still running it could still be causing your sore throat. I'd go back and see my doc and ask for additional medicines like a nasal spray antihistamine like astelin or an anticholinergic like atrovent nasal spray."}, {"url": "http://healthquestions.medhelp.org/flonase-antihistamine", "passage_text": "You can try taking a newer generation antihistamine such as Allegra or Zyrtec every day for 3 weeks straight and see if it improves. If it does, you have a good idea of what's going on. If your nose has cleared up from the nasal steroid (flonase) and antihistamine (allegra) but your nose is still running it could still be causing your sore throat. I'd go back and see my doc and ask for additional medicines like a nasal spray antihistamine like astelin or an anticholinergic like atrovent nasal spray."}, {"url": "http://allergy-link.com/Antihistamine%20List.html", "passage_text": "The following is a partial list of medications containing antihistamine. In addition to allergy more of these antihistamines. Please check with your pharmacist about these products. If you have any questions whethei a medication you are taking contains an antihistamine, please contact your pharmacy. and cold medications, sleep aids, anti-nausea and anti-depressant medications frequently contain"}, {"url": "https://en.wikipedia.org/wiki/Nasal_spray", "passage_text": "Actuation of a nasal spray bottle, used to deliver medication via the nostrils. Nasal sprays are used as local treatments for conditions such as nasal congestion and allergic rhinitis. In some situations, nasal delivery route is preferred because it provides an agreeable alternative to injection or pills. Substances can be assimilated extremely quickly and directly through the nose."}, {"url": "http://www.webmd.com/drugs/2/drug-54484/dristan-allergy-oral/details", "passage_text": "If any of these effects persist or worsen, tell your doctor or pharmacist promptly. If your doctor has directed you to use this product, remember that he or she has judged that the benefit to you is greater than the risk of side effects. Many people using the product do not have serious side effects."}, {"url": "http://www.dristan.com/product_labeling_tablet", "passage_text": "1 Pain reliever/Fever reducer. 2  Chlorpheniramine maleate, USP 2 mg 3  ........................................ Antihistamine. 4  Phenylephrine HCl, USP 5 mg 5  ........................................... Nasal decongestant. 6  Uses. 7  temporarily relieves these symptoms associated with a cold, or flu: 1 Pain reliever/Fever reducer. 2  Chlorpheniramine maleate, USP 2 mg 3  ........................................ Antihistamine. 4  Phenylephrine HCl, USP 5 mg"}, {"url": "https://www.healthtap.com/topics/is-flonase-an-antihistamine", "passage_text": "1. No: Flonase is a nasal steroid spray. It is often used in conjunction with an antihistamine. The most commonly used antihistamines today are the non-sedating antihistamines: claritin, Allegra and zyrtec. Each of these had a generic drug available, too. "}, {"url": "http://www.webmd.com/drugs/2/drug-87136/dristan-cold-oral/details", "passage_text": "If any of these effects persist or worsen, tell your doctor or pharmacist promptly. If your doctor has prescribed this medication, remember that he or she has judged that the benefit to you is greater than the risk of side effects. Many people using this medication do not have serious side effects. Cough-and-cold products have not been shown to be safe or effective in children younger than 6 years. Therefore, do not use this product to treat cold symptoms in children younger than 6 years unless specifically directed by the doctor."}, {"url": "http://www.webmd.com/drugs/2/drug-54484/dristan-allergy-oral/details", "passage_text": "Uses. This combination medication is used to temporarily relieve symptoms caused by the common cold, flu, allergies, or other breathing illnesses (such as sinusitis, bronchitis). Antihistamines help relieve watery eyes, itchy eyes /nose/throat, runny nose, and sneezing. If your doctor has directed you to use this product, remember that he or she has judged that the benefit to you is greater than the risk of side effects. Many people using the product do not have serious"}]