[{"url": "https://en.wikipedia.org/wiki/Mount_Damavand", "passage_text": "Symbolism and mythology [edit]. Damavand is a significant mountain in Persian mythology. It is the symbol of Iranian resistance against despotism and foreign rule in Persian poetry and literature. Mount Damavand first erupted in the Pleistocene almost 1.78 million years ago. After several known eruptions around 600,000 and 280,000 years ago, it finally erupted about 7300 years ago in the Holocene. Its steep cone is formed of ash and lava flows that are mainly made of trachyte, andesite and basalt."}, {"url": "https://en.wikipedia.org/wiki/Mount_Damavand", "passage_text": "The mountain is located near the southern coast of the Caspian Sea, in Damavand county, Tehran Province, 66 kilometres (41 miles) northeast of the city of Tehran. Mount Damavand first erupted in the Pleistocene almost 1.78 million years ago. After several known eruptions around 600,000 and 280,000 years ago, it finally erupted about 7300 years ago in the Holocene. Its steep cone is formed of ash and lava flows that are mainly made of trachyte, andesite and basalt."}, {"url": "http://damavand-iran.com/index.html", "passage_text": "Damavand Mountain is 5671 meters (18,605 feet) high. It is the Highest Volcano in Asia and it is officially classified as the number five by elevation in the Volcanic Seven Summits (V7S) . This mountain is home of rare animals and plants. Damavand is a popular target for mountaineers and mountain tourists. They like to trek this volcano because they like the beautiful conical shape, the prominence and the isolation of a volcano which is not attached to another mountain and also because of its less difficulty in summer season."}, {"url": "http://www.youtube.com/watch?v=n8EsoQP_dOI", "passage_text": "This feature is not available right now. Please try again later. ount Damavand (= frozen/freezing mountain) of the Alborz Range in Northern Iran, with a height of 5671m the highest peak of the Middle East and the highest Volcano of all Asia. Come long with us on the Southroute, there are two possible shelter/huts. "}, {"url": "http://damawand.com/", "passage_text": "Volcanic Seven Summits Mt Damavand 5671m is one of the Volcanic Seven Summits Mount Damavand, situated in Iran, stands tall as the highest volcano in all of Asia, at 5,671 m. A potentially active volcano, it has fumaroles near the summit crater that release sulfur gas and whose last recorded activity was in 2007. Mount Damavand also known as Donbavand, a potentially active volcano and the highest peak in Iran, has a special place in Persian mythology and folklore. It is a potentially active volcano, since there are fumaroles near the summit crater emitting sulfur, which were known to be active on July 6, 2007."}, {"url": "http://www.damawand.de/", "passage_text": "Damavand is a perfect cone-shape volcano located in the central part of Alborz Mountain Range in north of Iran on the southern coast of the Caspian Sea. Damawand Volcano is 5671 meters high. Damavand Mountain is located near the Caspian Sea and it receives heavy snowfalls in autumn, winter and spring. Damavand Winter Season may start from mid October and last to mid April. In winter condition the wind speed may reach upto 100km/h and windchill temprature to -70°C."}, {"url": "http://sevennaturalwonders.org/mount-damavand/", "passage_text": "Mount Damavand. Mount Damavand is a dormant volcano located in Iran. With the summit reaching 18,406 feet (5,610 m), it is the highest peak in Iran and the Middle East and it is the highest volcano in all of Asia. Mount Damavand is part of the Alborz mountain range."}, {"url": "http://damavandcamp.com/", "passage_text": "Damavand Mountain Eco Camp is located at Nandal village, 2366 m above sea level, in a 600 m ground including a 110 m2 building and a 490 m2 yard. The eco camp with facilities such as: 12 custom made tents, kitchen, dining room, prayer room, fireplace, arbor (to have drinks),… more. "}, {"url": "http://damavand-weather.com/Index.html", "passage_text": "Damavand Mountain is the highest ski resort in the middle-east and is a popular target for winter sport activities. Snow covers the entire Damavand in winter and the upper parts and slops in spring and autumn. Damavand Summit is snow-capped several months a year. When is the best time to go to Mount Damavand, Tehran. When is the best time to ski Mt Damāvand Tehran. Will there be any snow in Tochal Tehran on march 2012. Wind, Rain Damāvand Forecast, Sun and Temperature. Winter mountain climbing weather Tehran."}]