[{"url": "http://www.dailydot.com/business/uber-driver-actual-salary-earnings-wage-90000/", "passage_text": "What does an Uber driver really earn? Last week, the taxi cab startup, which is currently valued at $18.2 billion, offered one answer to that question, claiming an Uber driver could earn $90,000 a year working in New York City, and $70,000 in San Francisco. Not a bad take—but also not $90,000. It’s also not a hugely different hourly rate compared to the smart driver, who mostly just works more hours. In short, it seems like very few full-time Uber drivers are earning above $30 per hour."}, {"url": "http://www.businessinsider.com/uber-drivers-salary-90000-2014-5", "passage_text": "According to Uber, the median wage for an UberX driver working at least 40 hours a week in New York City is $90,766 a year and $74,191 a year in San Francisco, The Washington Post reports. UberX is its lower-cost service, where drivers use their own vehicles, similar to Lyft’s service. For contrast, estimates place the average cab driver's salary at around $30,000 a year. That's nearly triple the income. New York City Uber drivers even make more than the average tech worker across the U.S., who pull in $87,811 a year"}, {"url": "http://tomslee.net/2014/06/uber-drivers-earning-90kyear-more-evidence-needed.html", "passage_text": "CNBC led with “Uber’s $90K salary could disrupt the taxi business”. The New Orleans Times-Picayune headlined its story “Uber drivers in New York City earn more than $90,000 a year, newspaper reports” and Entrepreneur.com claimed “The Median Income of an Uber Driver in NYC Is Nearly $100,000”. Last Tuesday taxi-disrupting tech company Uber posted on the company blog that “the median income on uberX is more than $90,000/year/driver in New York and more than $74,000/year/driver in San Francisco”. I don’t think their numbers add up, but first the story so far…."}, {"url": "http://www.inquisitr.com/2077969/how-much-do-uber-drivers-really-make-journalist-goes-undercover-to-find-out/", "passage_text": "According to a 2014 Washington Post story, Uber said the average UberX driver putting in at least 40 hours a week could expect to pull in about $74,191 dollars a year in San Francisco, and a quite respectable $90, 766 dollars a year in New York City, both incomes dwarfing the average cabbie salary of $30,000 a year. "}, {"url": "http://www.slate.com/articles/business/moneybox/2014/10/uber_driver_salary_the_ride_sharing_company_says_its_drivers_make_great.html", "passage_text": "In several months of reporting on Uber, I have yet to come across a single driver earning the equivalent of $90,766 a year. Those I’ve spoken with report that they gross around $1,000 a week after commission and sales tax—but before gas and other expenses—for annual income closer to $50,000. For a driver like Garay, all those deductions mean an initial $30 in fares leaves him with about $21 for the hour. According to statements Garay provided Slate, he made $1,163.30 in fares for 40 hours of work in the week ending Oct. 13."}, {"url": "http://www.businessinsider.com/how-much-money-uber-drivers-really-make-2014-11", "passage_text": "Uber says its drivers can make $90,000 a year driving for UberX in New York City. Last month, Business Insider talked to Uber drivers who said they weren't making nearly that much. In response to criticism about how much drivers really make, Uber's New York City general manager Josh Mohrer said he would speak on the record to journalists who took 10 random Uber rides and collected pay stubs from their drivers."}, {"url": "http://www.businessinsider.com/how-much-money-uber-drivers-really-make-2014-11", "passage_text": "For a driver that typically works 10-hour days — a more realistic figure — and drives four to six days a week, the driver would need to make between an average of $28.85 and $43.27 an hour. After doing the math, Bhuiyan concluded drivers were taking home far less than $90,000. In response to criticism about how much drivers really make, Uber's New York City general manager Josh Mohrer said he would speak on the record to journalists who took 10 random Uber rides and collected pay stubs from their drivers."}, {"url": "http://www.fastcompany.com/3048563/fast-feed/this-is-how-much-uber-and-lyft-drivers-make-in-different-cities", "passage_text": "Depending on whom you ask, driving for Lyft or UberX is either a gold mine or an exploitative labor practice. Uber last year infamously claimed many of its drivers made more than $90,000 per year, but it did not account for the cost of driver expenses like gas and car maintenance. "}, {"url": "http://nypost.com/2014/11/02/ubers-claim-of-90k-average-pay-for-drivers-is-overestimated/", "passage_text": "Photo: Reuters. Uber has boasted that some of its drivers bring home more than $90,000 per year — but, in fact, their take-home pay is closer to the average that yellow cabbies make, new data reveal. But in a May blog post, Uber bragged that its UberX drivers in New York City have a median income of $90,766 a year and compared that with national data that says yellow-taxi drivers’ earnings are “often below the poverty line.”."}]