[{"url": "http://www.biology-online.org/dictionary/Closed_circulatory_system", "passage_text": "Definition. noun. A type of circulatory system where blood circulates within closed vessels, thus, blood is distinct from the interstitial fluid. Supplement. The circulatory system is one of the transport systems through which nutrients, gases, and other molecules are transported within the body of animals."}, {"url": "http://www.yourdictionary.com/circulatory-system", "passage_text": "The circulatory system is defined as the system that moves blood, oxygen and nutrients through the body. An example of the circulatory system is the functioning of the human heart, blood and blood vessels."}, {"url": "http://www.yourdictionary.com/circulatory-system", "passage_text": "circulatory system. noun. 1  The system of structures in vertebrates consisting of the heart, blood vessels, and lymphatics, by which blood and lymph are circulated throughout the body. 2  A similar system by which a fluid, such as hemolymph, is distributed in other animals."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=2738", "passage_text": "Circulatory system: The system that moves blood throughout the body. The circulatory system is composed of the heart, arteries, capillaries, and veins. This remarkable system transports oxygenated blood from the lungs and heart throughout the body via the arteries. The blood goes through the capillaries which are situated between the arteries"}, {"url": "http://www.thefreedictionary.com/circulatory+system", "passage_text": "circulatory system. n. 1. The system of structures in vertebrates consisting of the heart, blood vessels, and lymphatics, by which blood and lymph are circulated throughout the body. 2. A similar system by which a fluid, such as hemolymph, is distributed in other animals."}, {"url": "http://www.merriam-webster.com/dictionary/circulatory%20system", "passage_text": "Medical Definition of CIRCULATORY SYSTEM. : the system of blood, blood vessels, lymphatics, and heart concerned with the circulation of the blood and lymph."}]