[{"url": "http://www.holiday-weather.com/orlando/averages/november/", "passage_text": "Weather low-down. The weather in Orlando in November is much more bearable so it’s a popular winter holiday destination for those wanting to escape the cold at home. The average daytime temperatures are around 25°C (78°F) whereas the average minimum temperatures drop down to 14°C (57°F). The humidity drops significantly at this time of year so it’s a great time for outdoor activities such as golf and swimming. The average amount of sunshine expected in this month is 8 hours per day."}, {"url": "http://www.currentresults.com/Weather/Florida/Places/orlando-weather-averages.php", "passage_text": "Orlando averages 97 days a year when the thermometer reaches into the 90s °F (over 32 °C). The temperature climbs above 100 °F (38 °C) about once a decade. The thermometer dips to 40 °F (4 °C) or below on an average of 12 nights a year at Orlando. Typically two of those nights get as cold as 32 °F (0 °C). 17 °C. Orlando's coldest days of the year usually occur in mid January when the daily maximum temperature averages 71 degrees Fahrenheit (22 degrees Celsius) and the minimum averages 49 °F (9 °C). The year's hottest days are normally at the beginning of August."}, {"url": "http://orlando.about.com/od/weather/a/avetemps.htm", "passage_text": "Humidity can still be on the higher side and rainfall is at a minimum. This is the time of the year when the snowbirds of the north, ready for a break from cold dreary days, visit Florida. These 'average' temperatures and have been known to vary a good bit in either direction. If you are traveling to the Orlando area, it's always a good idea to pack a light jacket"}, {"url": "http://www.currentresults.com/Weather/Florida/Places/orlando-weather-averages.php", "passage_text": "annual average low. 17 °C. Orlando's coldest days of the year usually occur in mid January when the daily maximum temperature averages 71 degrees Fahrenheit (22 degrees Celsius) and the minimum averages 49 °F (9 °C). The year's hottest days are normally at the beginning of August."}, {"url": "https://weatherspark.com/averages/30841/Orlando-Florida-United-States", "passage_text": "Earlier records are either unavailable or unreliable. Orlando, Florida has a warm humid temperate climate with hot summers and no dry season. The area within 25 mi of this station is covered by croplands (70%), forests (9%), lakes and rivers (8%), grasslands (8%), and built-up areas (4%). The warm season lasts from May 12 to September 29 with an average daily high temperature above 87A°87â. F the hottest day of the year Is july, 29 with an average high OF°91a 91â f and LOW°Of. 74a 74â f the cold Season lasts from December 5 to february 23 with an average daily HIGH°Temperature. below 74a 74â f"}, {"url": "https://weatherspark.com/averages/30841/Orlando-Florida-United-States", "passage_text": "Location. This report describes the typical weather at the Orlando International Airport (Orlando, Florida, United States) weather station over the course of an average year. It is based on the historical records from 1974 to 2012. The warm season lasts from May 12 to September 29 with an average daily high temperature above 87A°87â. F the hottest day of the year Is july, 29 with an average high OF°91a 91â f and LOW°Of. 74a 74â f the cold Season lasts from December 5 to february 23 with an average daily HIGH°Temperature. below 74a 74â f"}, {"url": "http://www.holiday-weather.com/orlando/averages/", "passage_text": "Orlando: Annual Weather Averages. July is the hottest month in Orlando with an average temperature of 28°C (82°F) and the coldest is January at 15°C (59°F) with the most daily sunshine hours at 11 in June. The wettest month is July with an average of 196mm of rain. "}, {"url": "http://www.visitorlando.com/plan-your-trip/weather/", "passage_text": "Orlando Weather. One of Orlando's biggest draws is the year-round sunny, mild weather. In keeping with the Sunshine State, Central Florida maintains a comfortable average annual temperature of 72 degrees and a mostly dry climate from October to May."}, {"url": "http://www.currentresults.com/Weather/Florida/Places/orlando-temperatures-by-month-average.php", "passage_text": "Orlando Temperatures: Averages by Month. The numbers here tell you how hot and cold the weather usually is in Orlando, Florida during each month of the year. The average high and low temperatures are listed below by month and annually for Orlando, in both degrees Fahrenheit and Celsius. Maximums and minimums are only part of the temperature picture. To fill in the rest, there's information on how many days a month get above or below a given temperature"}, {"url": "http://goflorida.about.com/od/floridaweathe1/qt/Orlando-Weather.htm", "passage_text": "When you stay at the Orlando World Center Marriott, it's like having a water park at your resort!. © Orlando World Center Marriott. Orlando, located in Central Florida, has an overall average high temperature of 83° and an average low of 62°. On average Jacksonville's warmest month is July and January is the average coolest month. The maximum average rainfall usually falls in June. "}]