[{"url": "http://www.answers.com/Q/What_does_the_American_flag_stand_for", "passage_text": "The 50 stars on the flag represent the 50 U.S. states and the 13 stripes represent the original Thirteen Colonies that rebelled against the British Crown and became the first states in the Union. The stripes represent the 13 original colonies, the stars represent the 50 states, and the white means freedom, I believe. America was foundered as a Christian nation. The stripes come from a verse in the Bible in Isaiah 53.5- By his stripes we were healed."}, {"url": "http://www.answers.com/Q/What_does_the_American_flag_stand_for", "passage_text": "Of course, the 13 stripes of the US flag represent the original colonies that became the first states to declare independence. It was these states, minus Georgia, that convened for the First Continental Congress. Subsequent states accepted to the union were, eventually, represented on the flag by an additional star. The stripes represent the 13 original colonies, the stars represent the 50 states, and the white means freedom, I believe. America was foundered as a Christian nation. The stripes come from a verse in the Bible in Isaiah 53.5- By his stripes we were healed."}, {"url": "https://en.wikipedia.org/wiki/Flag_of_the_United_States", "passage_text": "The 50 stars on the flag represent the 50 states of the United States of America, and the 13 stripes represent the thirteen British colonies that declared independence from the Kingdom of Great Britain, and became the first states in the Union. "}, {"url": "http://www.pri.org/stories/2014-09-04/ever-wonder-what-black-and-white-isis-flag-means", "passage_text": "Another appropriated symbol on the flag is the white circle at its center, which contains the second part of the shahada: Muhammad is the Messenger of God.. It’s meant to represent the official seal of the Prophet Muhammad, but Blooms says scholars have long debated what that seal actually looked like. "}, {"url": "http://www.mapsofworld.com/flags/tokelau-flag.html", "passage_text": "Introduction. Since Tokelau is a non-autonomous province of New Zealand, it uses the official ensign of New Zealand as its flag. Nevertheless, the General Fono, or the regional parliament, acknowledged a characteristic ensign and official coat of arms for Tokelau in May 2008. The flag of Tokelau portrays a Tokelauan boat navigating in the direction of the Southern Cross or manu. This canoe represents the territory's sojourn on the road to getting the most effective administrative system for the inhabitants. The Southern Cross is a sign of a direction-finding tool for the voyage"}, {"url": "http://www.worldflags101.com/u/uruguay-flag.aspx", "passage_text": "Uruguay Flag Meaning: The sun emblem is the 'Sun of May'; it is a symbol of freedom and independence. The nine stripes represent the nine provinces of Uruguay, which existed at the time of the flags creation. Uruguay Flag History: The Uruguay flag was adopted on July 11, 1830, making it one of the world's oldest flags. When it was first adopted in 1828 it had 17 stripes but it was reduced to nine in 1830. Uruguay declared independence from Brazil on August 25, 1825."}, {"url": "http://usflag.org/colors.html", "passage_text": "Even colors have specific meanings. The colors red, white, and blue did not have meanings for The Stars and Stripes when it was adopted in 1777. However, the colors in the Great Seal did have specific meanings. Charles Thompson, Secretary of the Continental Congress, reporting to Congress on the Seal, stated: Sentimental writers and orators sometimes ascribe meanings to the colors in the flag. The practice is erroneous, as are statements on this subject attributed to George Washington and other founders of the country. From the book Our Flag published in 1989 by the House of Representatives..."}, {"url": "http://www.answers.com/Q/What_does_the_American_flag_stand_for", "passage_text": "So the stripes on the American flag also represent Jesus being wounded for us so that we could be free from our sins. Concerning the stars on the flag, there is a verse in Daniel 12 about the righteous shining as the stars. Each of the 13 original states had a destiny to shine as the stars of heaven. Nothing. The stripes represent the 13 original colonies, the stars represent the 50 states, and the white means freedom, I believe. America was foundered as a Christian nation. The stripes come from a verse in the Bible in Isaiah 53.5- By his stripes we were healed."}, {"url": "http://www.usflag.org/iamtheflag.html", "passage_text": "I am the flag of the United States of America. I was born on June 14, 1777, in Philadelphia. There the Continental Congress adopted my stars and stripes as the national flag. My thirteen stripes alternating red and white, with a union of thirteen white stars in a field of blue, represented a new constellation, a new nation dedicated to the personal and religious liberty of mankind."}]