[{"url": "http://www.payscale.com/research/LR/Country=Liberia/Salary", "passage_text": "Explore Thousands of Jobs. Dive into the most extensive database of job salaries available. In addition, see detailed job descriptions and get information on job satisfaction, job demographics, common job skills and how pay varies over time and between locations."}, {"url": "http://www.answers.com/Q/What_is_the_annual_salary_of_senators_in_Liberia", "passage_text": "In 1865, United States Senators made an annual salary of $5000, which was increased to $7500 a year in 1871. Currently, it is $165,000. The $7500 probably bought more, … but adjusting for inflation from 1872 is difficult because inflation statistics were only tracked from 1913."}, {"url": "http://www.payscale.com/research/LR/Country=Liberia/Salary", "passage_text": "Do career research and find in-depth salary data for specific jobs, employers, schools, and more."}, {"url": "http://www.un.org/Depts/OHRM/salaries_allowances/salaries/liberia.htm", "passage_text": "Back to Salary scales for the General Service front page. 2003 - 2015 United Nations Office of Human Resources Management-All rights reserved."}, {"url": "http://www.teachersalaryinfo.com/california/teacher-salary-in-monrovia-unified-school-district/", "passage_text": "The average teacher salary in Monrovia Unified School District is $53,976. To learn how to become a teacher in the Monrovia Unified School District, read our how to become a teacher in California article."}, {"url": "http://www.answers.com/Q/What_is_the_annual_salary_of_senators_in_Liberia", "passage_text": "What is the annual salary of a mineralogist? The average annual salary for a mineralogist working in the US is  about $110,000. Salaries can range depending on experience, skill,  and hiring company, from $48,000--whic … h is a typical entry level  salary--to $135,000. Aaron McClellan."}, {"url": "http://www.aljazeera.com/news/africa/2014/10/liberia-nurses-threaten-strike-over-ebola-pay-20141012134754218261.html", "passage_text": "The association said on Sunday it was calling for hazard pay to be increased by around $200, from what is currently less than $500. The average Liberian health worker's base salary is between $200 and $300."}]