[{"url": "http://espn.go.com/blog/st-louis-rams/post/_/id/12887/making-sense-of-rams-running-back-situation", "passage_text": "Rookie Tre Mason was the hot hand for the Rams at running back this past Sunday, running for 85 yards on 18 carries with a touchdown."}, {"url": "http://www.fantasyfootballchallenge.com/32-82-2/los-angeles-rams-running-backs.html", "passage_text": "There were 135 running backs for the Los Angeles Rams during their 49 year history. The top fantasy running back in Rams history is Eric Dickerson who averaged 17.26 points a game over his 65 game career with the team. He is also one of the top 25 all time Rams career fantasy point leaders, ranking 1st. Other successful Los Angeles Rams running backs besides Eric Dickerson include Greg Bell, Wendell Tyler, Jerome Bettis, Lawrence McCutcheon, Dan Towler, Dick Hoerner and Dick Bass."}, {"url": "http://mydamrams.tripod.com/index-215.html", "passage_text": "The Rams have been blessed with hot running backs year after year throughout history. Consider names from the past such as Eric Dickerson (NFL's all-time single season record-holder), Willie Ellison, Lawrence McCutcheon, Dick Bass, Greg Bell, Jerome Bettis, Charles White, Wendell Tyler, Tank Younger and Dan Towler."}, {"url": "http://www.turfshowtimes.com/2013/7/20/4538428/st-louis-rams-2013-roster-running-back-daryl-richardson-isaiah-pead-zac-stacy-terrance-ganaway", "passage_text": "Add in this year's fifth round pick Zac Stacy, and the Rams have a good mixture of backs, with speed and power. The logical assumption is the Rams go with a running back by committee approach headlined by Richardson, Pead, and Stacy."}, {"url": "http://www.nfl.com/player/tremason/2543502/profile", "passage_text": "St. Louis Rams running back Tre Mason runs to the left for the 10-yard touchdown."}, {"url": "https://en.wikipedia.org/wiki/History_of_the_Los_Angeles_Rams", "passage_text": "Eric Dickerson, one of the best running backs in history, was most famous for his time with the Los Angeles Rams. In 1984, Dickerson rushed for 2,105 yards in the season, a record that still stands today."}]