[{"url": "http://www.cdc.gov/anthrax/resources/history/index.html", "passage_text": "Scientist Robert Koch studied Bacillus anthracis, the bacterium that causes anthrax. He discovered that the bacteria formed spores and were able to survive for very long periods of time and in many different environments. All of the people who died had inhalation anthrax, the most serious form of the disease. In all, 43 people tested positive for exposure to anthrax, and 10,000 more people were considered at risk of possible exposure to anthrax."}, {"url": "https://en.wikipedia.org/wiki/Anthrax_(American_band)", "passage_text": "Anthrax was formed in Queens, New York in mid 1981 by guitarists Scott Ian and Dan Lilker. The band was named after the disease of the same name which Ian saw in a biology textbook. The name was chosen because it sounded sufficiently evil. The group was considered one of the leaders of the thrash metal scene during the 1980s. Of the Big Four thrash metal bands (the others being Metallica, Megadeth and Slayer), Anthrax were the only band from the East Coast."}, {"url": "http://www.who.int/csr/disease/Anthrax/anthraxfaq/en/", "passage_text": "The most severe form of human anthrax is called inhalation or pulmonary anthrax. Though the rarest, it is the form of human anthrax causing the most current concern. This form of the disease is caused when a person is directly exposed to a large number of anthrax spores suspended in the air, and breathes them in. The first symptoms are similar to those of a common cold, but this can rapidly progress to severe breathing difficulties and shock."}, {"url": "https://en.wikipedia.org/wiki/Anthrax_(American_band)", "passage_text": "Anthrax's lineup has changed several times over their career. The band has had a number of vocalists including Neil Turbin, Joey Belladonna, Dan Nelson and John Bush. Founding members Scott Ian and Charlie Benante, who joined Anthrax in 1983, are the only band members to appear on every album. The group was considered one of the leaders of the thrash metal scene during the 1980s. Of the Big Four thrash metal bands (the others being Metallica, Megadeth and Slayer), Anthrax were the only band from the East Coast."}, {"url": "https://en.wikipedia.org/wiki/Anthrax_(American_band)", "passage_text": "Anthrax is an American thrash metal band from New York City, formed in 1981 by guitarist Scott Ian and bassist Dan Lilker. The group was considered one of the leaders of the thrash metal scene during the 1980s. Of the Big Four thrash metal bands (the others being Metallica, Megadeth and Slayer), Anthrax were the only band from the East Coast."}, {"url": "http://www.who.int/csr/disease/Anthrax/anthraxfaq/en/", "passage_text": "A. There are three types of anthrax, each with different symptoms: Cutaneous, or skin, anthrax is the most common form. It is usually contracted when a person with a break in their skin, such as a cut or abrasion, comes into direct contact with anthrax spores. This form of the disease is caused when a person is directly exposed to a large number of anthrax spores suspended in the air, and breathes them in. The first symptoms are similar to those of a common cold, but this can rapidly progress to severe breathing difficulties and shock."}, {"url": "http://www.niaid.nih.gov/topics/anthrax/Pages/default.aspx", "passage_text": "Anthrax. Anthrax is the disease caused by the bacterium Bacillus anthracis, which lives in soil. The bacterial cell lives as a hardy spore to survive harsh conditions. The spores germinate into thriving colonies of bacteria once inside an animal or person. Cutaneous Anthrax. Cutaneous anthrax is the most common form of the disease. People with cuts or open sores can get cutaneous anthrax if they come in direct contact with the bacteria or its spores, usually through contaminated animal products."}, {"url": "http://www.who.int/csr/disease/Anthrax/anthraxfaq/en/", "passage_text": "Q. What is anthrax? A. Anthrax is a disease caused by a bacterium called Bacillus anthracis. It is a disease which has existed for hundreds of years and which still occurs naturally in both animals and humans in many parts of the world, including Asia, southern Europe, sub-Sahelian Africa and parts of Australia. Anthrax bacteria can survive in the environment by forming spores. This form of the disease is caused when a person is directly exposed to a large number of anthrax spores suspended in the air, and breathes them in. The first symptoms are similar to those of a common cold, but this can rapidly progress to severe breathing difficulties and shock."}, {"url": "https://en.wikipedia.org/wiki/Anthrax_disease", "passage_text": "Anthrax is an acute disease caused by the bacterium Bacillus anthracis. Most forms of the disease are lethal, and it affects mostly animals. Gastrointestinal (GI) infection in humans is most often caused by consuming anthrax-infected meat and is characterized by serious GI difficulty, vomiting of blood, severe diarrhea, acute inflammation of the intestinal tract, and loss of appetite. Lesions have been found in the intestines and in the mouth and throat."}, {"url": "http://www.mayoclinic.org/diseases-conditions/anthrax/basics/causes/CON-20022705", "passage_text": "Anthrax spores are formed by anthrax bacteria that occur naturally in soil in most parts of the world. The spores can remain dormant for years until they find their way into a host. Common hosts for anthrax include wild or domestic livestock, such as sheep, cattle, horses and goats. Although rare in the United States, anthrax is still common throughout the developing world, such as in Iran, Iraq, Turkey, Pakistan and sub-Saharan Africa."}]