[{"url": "http://medical-dictionary.thefreedictionary.com/Z+line", "passage_text": "Z line. A cross-striation bisecting the I band of striated muscle myofibrils and serving as the anchoring point of actin filaments at either end of the sarcomere. Z line, a narrow, darkly staining cross-striation that bisects the I band of skeletal muscles. The distance between Z lines is the length of the sarcomere. Also called intermediate disk, Z band, Z disk."}, {"url": "https://www.supercoder.com/my-ask-an-expert/topic/z-line", "passage_text": "Z line. User id: 27147 Posted 3 years ago. Can you tell me how to code irregular Z line I have no ideal what this is and my anesthesiologist seems to have discovered this new term and is using a lot now. "}, {"url": "http://www.merriam-webster.com/dictionary/Z%20line", "passage_text": "Z line. noun. : any of the dark bands across a striated muscle fiber that mark the junction of actin filaments in adjacent sarcomeres. Britannica.com: Encyclopedia article about Z line. Definition of Z LINE. : any of the dark thin bands across a striated muscle fiber that mark the junction of actin filaments in adjacent sarcomeres. ADVERTISEMENT."}, {"url": "http://www.medscape.org/viewarticle/705101_4", "passage_text": "Barrett Esophagus: Histology and Pathology for the Clinician: Significance of an Irregular Z-line. Robert D. Odze, MD, FRCPC. Faculty and Disclosures. CME Released: 07/07/2009; Valid for credit through 07/07/2010. processing.... "}, {"url": "https://en.wikipedia.org/wiki/Z-line", "passage_text": "Z-line can refer to: 1  the borders that separate and link sarcomeres within a skeletal muscle. 2  a ban on a user's IP address for the purposes of blocking their access to Internet Relay Chat. 3  the gastroesophageal junction that joins the esophagus to the stomach. 4  Z, a New York City Subway service. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Z+line", "passage_text": "Z line. n. A dark thin protein band to which actin filaments are attached in a striated muscle fiber, marking the boundaries between adjacent sarcomeres. Also called Z band. Z line, a narrow, darkly staining cross-striation that bisects the I band of skeletal muscles. The distance between Z lines is the length of the sarcomere. Also called intermediate disk, Z band, Z disk."}, {"url": "http://www.merriam-webster.com/dictionary/Z%20line", "passage_text": "Medical Definition of Z LINE. : any of the dark bands across a striated muscle fiber that mark the junction of actin filaments in adjacent sarcomeres. Britannica.com: Encyclopedia article about Z line. Definition of Z LINE. : any of the dark thin bands across a striated muscle fiber that mark the junction of actin filaments in adjacent sarcomeres. ADVERTISEMENT."}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=50537", "passage_text": "Z line. Definitions: 1. a cross-striation bisecting the I band of striated muscle myofibrils and serving as the anchoring point of actin filaments at either end of the sarcomere. Synonyms: intermediate disc, Z band, Z disc. The definition information for Z line is provided by Stedman's. You can search our medical dictionary here. Stedman's, part of Lippincott Williams & Wilkins, provides a comprehensive line of health-science publications for healthcare professionals and medical students. "}]