[{"url": "http://www.nanosweb.org/files/public/Drusen.pdf", "passage_text": "Optic Disc Drusen Your doctor has diagnosed you with optic disc drusen. Optic disc drusen are abnormal deposits of protein-like material in the optic disc – the front part of the optic nerve. We do not know the exact cause of optic disc drusen but they are thought to come from abnormal flow of material in optic nerve cells. Optic disc drusen are caused by an abnormal deposition of a protein-like material in the optic nerve. The cause of this material is unknown. In some individuals, the deposition of this material can be inherited, while in others it occurs without a family history."}, {"url": "http://www.glaucoma.org/glaucoma/the-optic-nerve-questions-and-answers-from-dr-bradley-schuster.php", "passage_text": "Its diameter is smaller than the diameter of the optic nerve. In the old days, when a doctor looked at the nerve with a monocular magnification device, the nerve head looked like a cup on a saucer (or disc). This started a whole group of optic nerve descriptors (cup to disc ratio, cupping, cupped, etc.). "}, {"url": "http://kellogg.umich.edu/theeyeshaveit/optic-fundus/normal-disc.html", "passage_text": "The optic disc is shaped like a doughnut with a pink neuroretinal rim and a central white depression called the physiologic cup. Check out the color of the neuroretinal rim, which carries the axons of the retinal ganglion cells. It should be orange-pink. If its axons die, the rim will turn white. "}, {"url": "http://www.rnib.org.uk/eye-health-eye-conditions/optic-neuritis", "passage_text": "The end of the optic nerve, where all the individual nerves from each of the cells in your retina come together, is known as the optic disc. Your optic disc is visible as a small circular area of your retina which can be seen by the ophthalmologist (eye specialist) or optician when they look into your eye. From your optic disc, the nerve fibres travel together in bundles, forming your optic nerve, to your brain. "}, {"url": "http://www.nanosweb.org/files/public/DrusenLP.pdf", "passage_text": "Optic Disc Drusen Your doctor has diagnosed you with optic disc drusen. Optic disc drusen are abnormal deposits of protein-like material in the optic disc – the front part of the optic nerve. We do not know the exact cause of optic disc drusen but they are thought to come from abnormal flow of material in optic nerve cells. Often, the optic disc has an unusual appearance, with multiple branches of the major blood vessels as they emerge on the disc. Multiple Branches of Blood Vessels As time passes, optic disc drusen can calcify and become more prominent. Optic disc drusen are rarely associated with any systemic disease or eye disease."}, {"url": "http://www.tedmontgomery.com/the_eye/optcnrve.html", "passage_text": "The optic nerve (also known as cranial nerve II) is a continuation of the axons of the ganglion cells in the retina. There are approximately 1.1 million nerve cells in each optic nerve. The optic nerve, which acts like a cable connecting the eye with the brain, actually is more like brain tissue than it is nerve tissue. Optic atrophy of the optic disc (visible to an eye doctor looking inside the eye) is the result of degeneration of the nerve fibers of the optic nerve and optic tract. It can be congenital (usually hereditary) or acquired."}, {"url": "http://phoenixvilleeyecare.com/ptinfoglaucoma6.shtml", "passage_text": "Optic Disc Photographs. Photographic images of the optic disc are essential for monitoring glaucoma. Glaucoma damage is seen clinically as loss of the nerve fiber layer and an associated thinning of tissue at the optic nerve head. With this damage, ophthalmologists (Eye M.D.s) look for what they call “cupping” of the optic nerve. "}, {"url": "http://www.tedmontgomery.com/the_eye/optcnrve.html", "passage_text": "blind spot. The beginning of the optic nerve in the retina is called the optic nerve head or optic disc. Since there are no photoreceptors (cones and rods) in the optic nerve head, this area of the retina cannot respond to light stimulation. As a result, it is known as the blind spot, and everybody has one in each eye. Optic atrophy of the optic disc (visible to an eye doctor looking inside the eye) is the result of degeneration of the nerve fibers of the optic nerve and optic tract. It can be congenital (usually hereditary) or acquired."}, {"url": "https://en.wikipedia.org/wiki/Optic_disc", "passage_text": "The optic disc or optic nerve head is the point of exit for ganglion cell axons leaving the eye. Because there are no rods or cones overlying the optic disc, it corresponds to a small physiological blind spot in each eye. The ganglion cell axons form the optic nerve after they leave the eye. The optic disc represents the beginning of the optic nerve and is the point where the axons of retinal ganglion cells come together. The optic disc is also the entry point for the major blood vessels that supply the retina. The optic disc in a normal human eye carries from 1 to 1.2 million neurons from the eye towards the brain. The optic disc is placed 3 to 4 mm to the nasal side of the fovea. It is a vertical oval, with average dimensions of 1.76mm horizontally by 1.92mm vertically. There is a central depression, of variable size, called the optic cup."}]