[{"url": "https://answers.yahoo.com/question/index?qid=20080123083152AAVNRVB", "passage_text": "show more I do not have any liver disease, am drinking plenty of water, exercise regularly, take a multivitamin and take milk thistle, eat a healthy diet and drink green tea everyday but my liver has some damage from alcohol consumption over the past few years. Under these conditions, how fast would my liver regenerate to... Best Answer: The liver is a remarkable organ... under those circumstances, probably as fast as it can to become healthy...as to a time frame, no one can say. The variables are not known."}, {"url": "http://hepatitiscnewdrugresearch.com/liver-regeneration.html", "passage_text": "Nov 26, 2014 - The liver regeneration rate rapidly increased from 39.13±4.91% befoone1 month and 90.31±13.09% 16 months after surgery furthermore. Blood levels rapidly increased 7 days after surgery and then decreased 16 months after surgery compared to the state before surgery. Hybrid hepatocytes proliferate, replenish liver mass after chronic liver injuries in miceDate:August 13, 2015Source:University of California-San DiegoSummary:The mechanisms that allow the liver to repair and regenerate itself have long been a matter of debate."}, {"url": "https://answers.yahoo.com/question/index?qid=20060625170826AAPiKw1", "passage_text": "Best Answer: The liver has a remarkable capacity to regenerate after injury and to adjust its size to match its host. Within a week after partial hepatectomy, which, in typical experimental settings entails surgical removal of two-thirds of the liver, hepatic mass is back essentially to what it was prior to surgery. This Site Might Help You. RE: How does it take a liver regenerate itself and how long does it usually take? When a doctor tells you that your liver enzymes are not in balance (or whatever the proper medical way of saying this), how long does it take the liver to regenerate itself? How does it go about regenerating itself?"}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_a_liver_to_regenerate", "passage_text": "Liver can regenerate.Liver can be transplanted from a cadaver or from a living liver donor.In living liver donor it may take around 4-6 weeks to regenerate in case of no compl … ication. This depends on the amount of the starfish's body that need to be regenerated. If it is just the tip of an arm, it would take a matter of weeks. If one arm is regenerati … ng the rest of its body, it can take quite a few months."}, {"url": "http://thehealthydrinker.com/2011/04/liver-regeneration-damage-drinking-alcohol/", "passage_text": "A human liver is pretty amazing for a lot of reasons, but it has one trick that borders on the miraculous: it is the only human organ capable of regenerating damaged tissue. It’s actually a little more impressive than that. A liver can fully regenerate up to 75% of damaged tissue. And, it can do so in fairly quick order. Size can double in as little as three to four weeks through a process that is very similar to the embryonic stage of liver development. What is important, though, is that it does happen, especially considering the effects of alcohol on the liver after prolonged exposure. The link between alcohol and liver disease was identified more than 200 years ago."}, {"url": "http://www.mayo.edu/research/centers-programs/center-regenerative-medicine/focus-areas/liver-regeneration", "passage_text": "Liver Regeneration. Transplant surgeons, hepatologists and other researchers are developing liver cell-based regenerative therapies for patients who'd otherwise need whole-liver transplants. The liver has the greatest regenerative capacity of any organ in the body. Liver regeneration has been recognized for many years, dating all the way back to Prometheus in ancient Greek mythology. When the liver is injured beyond its ability to regenerate itself, a liver transplant is the treatment of choice"}, {"url": "http://www.answers.com/Q/How_long_does_it_take_the_liver_to_regenerate_itself", "passage_text": "The liver is a unique organ. It is the only organ in the body that is able to regenerate... that is completely repair the damage. With most organs, such as the heart, th … e damaged tissue is replaced with scar, like on the skin. The liver, however, is able to replace damaged tissue with new cells. An extreme example is a patient who suffers an overdose from Tylenol. In this example up to 50 - 60 percent of the liver cells may be killed within 3 - 4 days. The liver is the only internal human organ capable of natural regeneration of lost tissue; as little as 25% of a liver can regenerate into a whole liver."}, {"url": "http://thehealthydrinker.com/2011/04/liver-regeneration-damage-drinking-alcohol/", "passage_text": "Your liver is amazing, but to keep it amazing – that is, capable of regenerating healthy tissue – it is critical to practice responsible alcohol consumption. That is why we recommend taking a “drinking break” in our healthy drinking tips article. What is important, though, is that it does happen, especially considering the effects of alcohol on the liver after prolonged exposure. The link between alcohol and liver disease was identified more than 200 years ago."}, {"url": "http://www.vivo.colostate.edu/hbooks/pathphys/digestion/liver/regen.html", "passage_text": "The liver has a remarkable capacity to regenerate after injury and to adjust its size to match its host. Within a week after partial hepatectomy, which, in typical experimental settings entails surgical removal of two-thirds of the liver, hepatic mass is back essentially to what it was prior to surgery. Partial hepatectomy leads to proliferation of all populations of cells within the liver, including hepatocytes, biliary epithelial cells and endothelial cells. DNA synthesis is initiated in these cells within 10 to 12 hours after surgery and essentially ceases in about 3 days."}]