[{"url": "http://sectionhiker.com/long-distance-hiking-trails/", "passage_text": "Arizona Trail. The Arizona Trail is a primitive long distance trail, nearly 800 miles long, that traverses the state of Arizona from Mexico to Utah. The rail is broken into 43 sections that are 11 to 35 miles in length. Built by the Green Mountain Club between 1910 and 1930, the 272 mile Long Trail is the oldest long-distance trail in the United States. The Long Trail follows the main ridge of the Green Mountains from the Massachusetts-Vermont line to the Canadian border as it crosses Vermont’s highest peaks."}, {"url": "https://en.wikipedia.org/wiki/Long-distance_trail", "passage_text": "Typically, a long-distance trail, way or path will be at least 50 km (31 mi) long, but some in Britain are several hundred miles long, and many in the US are much longer. A number of long distance multi-use trails have been created in England, including three National Trails, the Pennine Bridleway, 192 km (119 miles), The Ridgeway, 139 km (86 miles), and South Downs Way, 160 km (99 miles). Rail trails /paths are shared-use paths that make use of abandoned railway corridors."}, {"url": "https://en.wikipedia.org/wiki/Long-distance_trail", "passage_text": "Long-distance trails (or long-distance tracks, paths, footpaths or greenways) are the longer recreational trails mainly through rural areas, used for non-motorized recreational travelling (walking, backpacking, cycling, horse riding or cross-country skiing). A number of long distance multi-use trails have been created in England, including three National Trails, the Pennine Bridleway, 192 km (119 miles), The Ridgeway, 139 km (86 miles), and South Downs Way, 160 km (99 miles). Rail trails /paths are shared-use paths that make use of abandoned railway corridors."}, {"url": "https://en.wikipedia.org/wiki/Long-distance_trail", "passage_text": "Any route named as a trail (or way, in the UK) will probably be marked, or identified on a map, but it will usually only be described as long-distance if it takes the average user more than one day to travel from end to end. A number of long distance multi-use trails have been created in England, including three National Trails, the Pennine Bridleway, 192 km (119 miles), The Ridgeway, 139 km (86 miles), and South Downs Way, 160 km (99 miles). Rail trails /paths are shared-use paths that make use of abandoned railway corridors."}, {"url": "http://sectionhiker.com/long-distance-hiking-trails/", "passage_text": "This is a list of long distance trails in the US that are at least 100 miles in length and are primarily footpaths. Most of these trails are maintained by hiking clubs and outdoor recreational organizations. Built by the Green Mountain Club between 1910 and 1930, the 272 mile Long Trail is the oldest long-distance trail in the United States. The Long Trail follows the main ridge of the Green Mountains from the Massachusetts-Vermont line to the Canadian border as it crosses Vermont’s highest peaks."}, {"url": "http://www.travelchannel.com/interests/outdoors-and-adventure/photos/best-long-distance-hiking-trails", "passage_text": "Pacific Northwest Trail. The Pacific Northwest Trail spans 1,200 miles -- including 3 national parks and 7 national forests. To tackle this route, which runs through Montana, Idaho and Washington, you'll have to keep a pace of 20 miles per day. That'll get you to the trail's end in about 60 days. The trail also happens to be America’s first long-distance hiking trail. Construction began in 1912 and continued for nearly 20 years. Today, hikers can enjoy short day hikes and extended treks (including to Mount Mansfield, Vermont’s highest mountain)."}, {"url": "http://www.moneycrashers.com/best-long-distance-hiking-trails/", "passage_text": "The Appalachian Trail near Clingmans Dome in the Great Smoky Mountains. One of the oldest long trails in the U.S., the Appalachian Trail is the quintessential long-distance hike. The “A.T.,” as it’s known, stretches from Georgia’s Springer Mountain to Maine’s Mount Katahdin. Touted as the country’s oldest long trail, the aptly named Long Trail follows the north-south spine of Vermont’s Green Mountains from the Massachusetts border to Canada. The main trail is about 270 miles, with an additional 175 miles of spurs and side trails."}, {"url": "https://en.wikipedia.org/wiki/Long-distance_trails_in_the_United_States", "passage_text": "1 National Millennium Trail project – 16 long-distance trails selected in 2000 as visionary trails that reflect defining aspects America's history and culture. north central Pennsylvania. On Colton Road 0.5 miles (0.8 km) south of U.S. Route 6, near the village of Ansonia. Pennsylvania Route 414, 1.8 miles (2.9 km) south of the village of Blackwell. Long distance trail that follows the western edge of Pine Creek Gorge."}, {"url": "http://www.adventurestrong.com/adventure/the-15-longest-hikes-in-the-united-states", "passage_text": "America’s Longest Hiking Trails. (In order of total distance. ). 1  American Discovery Trail – 6,800 miles – Stretching from coast-to-coast, the American Discovery Trail is listed as being about 6,800 miles but that’s a bit misleading. 1 Appalachian National Scenic Trail – 2,174 miles – The AT is the classic long-distance hike and one of three for the prestigious, but informal, Triple Crown (other two are Pacific Crest Trail and the Continental Divide)."}]