[{"url": "http://www.upmc.com/patients-visitors/education/infection-control/Pages/vre-information-for-patients.aspx", "passage_text": "In most cases, enterococcus bacteria cause no infection. But in some people, enterococcus can cause serious infection such as urinary tract infections, wound infections, and blood infections. Vancomycin (van-ko-MY-sin) is an antibiotic often used to treat enterococcus infections. When enterococcus are vancomycin-resistant, most antibiotics cannot kill the bacteria"}, {"url": "http://www.healthlinkbc.ca/healthtopics/content.asp?hwid=tp23381spec", "passage_text": "Vancomycin-resistant enterococci (VRE) are a type of bacteria called enterococci that have developed resistance to many antibiotics, especially vancomycin. "}, {"url": "http://health.cvs.com/GetContent.aspx?token=f75979d3-9c7c-4b16-af56-3e122a3f19e3&chunkiid=349676", "passage_text": "In some cases, it can cause an infection. When this happens, the antibiotic vancomycin may be given to cure the infection. However, some types of the bacteria are resistant to vancomycin. When the bacteria are resistant, the infection is not cured. This is called vancomycin-resistant enterococci (VRE) infection. It is more common in hospitals and long-term care facilities"}, {"url": "http://www.cdc.gov/HAI/organisms/vre/vre.html", "passage_text": "These bacteria can sometimes cause infections. Vancomycin is an antibiotic that is used to treat some drug-resistant infections caused by enterococci. In some instances, enterococci have become resistant to this drug and thus are called vancomycin-resistant enterococci (VRE). Most VRE infections occur in hospitals."}, {"url": "http://www.phac-aspc.gc.ca/nois-sinp/vre-erv-eng.php", "passage_text": "Generally these bacteria do not cause illness; however when illness does occur it can usually be treated with antibiotics. Vancomycin-resistant Enterococci (VRE) are strains of enterococci bacteria that are resistant to the antibiotic vancomycin. Vancomycin is an antibiotic generally prescribed to treat serious infections caused by organisms that are resistant to other antibiotics such as penicillins. With VRE, it means vancomycin is not effective in treating an infection with enterococci bacteria. You can have VRE present in your body without being sick. "}, {"url": "http://www.webmd.com/skin-problems-and-treatments/tc/vancomycin-resistant-enterococci-vre-overview", "passage_text": "Vancomycin-resistant enterococci (VRE) are a type of bacteria called enterococci that have developed resistance to many antibiotics, especially vancomycin. Enterococci bacteria live in our intestines and on our skin, usually without causing problems. Most often, VRE infections are spread from the hands of health care workers to a patient in a hospital or other facility such as a nursing home. VRE infections are not usually spread through the air like the common cold or flu virus unless you have VRE pneumonia and are coughing, which is rare."}, {"url": "http://www.health.nt.gov.au/Vancomycin_Resistant_Enterococcus_VRE/index.aspx", "passage_text": "VRE stands for Vancomycin Resistant Enterococcus. The Enterococcus is a bacterium (germ) that everyone has in their bowel. Vancomycin is one of the antibiotics used to treat infections caused by the Enterococcus germ. Sometimes this germ develops resistance to Vancomycin. When this occurs, the infection can no longer be treated by Vancomycin. Healthy people can carry VRE with no ill effects or signs and symptoms. In hospitals VRE can cause infections in a small minority of very sick patients whose ability to fight off infections has been lowered. When this occurs, it is more difficult to treat these patients, although there are still several antibiotics to which the VRE is susceptible."}, {"url": "http://healthvermont.gov/prevent/HAI/documents/VRE-2012.pdf", "passage_text": "These bacteria can sometimes cause infections. Vancomycin (pronounced Van-ko-my-cin) is an antibiotic (medicine) that is often used to treat infections caused by enterococci. In some cases, enterococci have become resistant to vancomycin and are called vancomycin-resistant enterococci or VRE."}]