[{"url": "http://study.com/academy/lesson/what-is-cognitive-psychology-definition-theories-quiz.html", "passage_text": "Definition of Cognitive Psychology. Cognitive psychology is the branch of psychology that focuses on the way people process information. It looks at how we process information we receive and how the treatment of this information leads to our responses."}, {"url": "http://www.abpp.org/i4a/pages/index.cfm?pageid=3358", "passage_text": "The specialty of Cognitive and Behavioral Psychology emphasizes an experimental-clinical approach to the application of behavioral and cognitive sciences to understand human behavior and develop interventions that enhance the human condition."}, {"url": "http://www.apa.org/ed/graduate/specialize/behav.aspx", "passage_text": "Behavioral and Cognitive Psychology is a specialty in professional psychology that reflects an experimental-clinical approach distinguished by use of principles of human learning and development and theories of cognitive processing to promote meaningful change in maladaptive human behavior and thinking."}, {"url": "http://www.abpp.org/i4a/pages/index.cfm?pageid=3358", "passage_text": "Currently, there are four sub-areas of Cognitive and Behavioral Psychology that share theoretical foundations in learning theory and a common approach to case conceptualization. These are applied behavior analysis, behavior therapy, cognitive-behavior therapy, and cognitive therapy."}, {"url": "http://cospp.org/specialties/behavioral-and-cognitive-psychology", "passage_text": "Currently, there are four sub-areas of Behavioral and Cognitive Psychology which share theoretical foundations in learning theory and a common approach to case conceptualization: applied behavior analysis, behavior therapy, cognitive-behavior therapy, and cognitive therapy."}, {"url": "http://www.merriam-webster.com/medical/cognitive%20psychology", "passage_text": ": a branch of psychology concerned with mental processes (as perception, thinking, learning, and memory) especially with respect to the internal events occurring between sensory stimulation and the overt expression of behavior—compare behaviorism. — cognitive psychologist noun."}, {"url": "http://cospp.org/specialties/behavioral-and-cognitive-psychology", "passage_text": "Board Certification in Behavioral Psychology is available through the American Board of Cognitive and Behavioral Psychology (ABCBP – formerly the American Board of Behavioral Psychology), which is a Specialty Board of the American Board of Professional Psychology (ABPP)."}, {"url": "http://www.merriam-webster.com/medical/cognitive%20psychology", "passage_text": "Medical Definition of COGNITIVE PSYCHOLOGY. : a branch of psychology concerned with mental processes (as perception, thinking, learning, and memory) especially with respect to the internal events occurring between sensory stimulation and the overt expression of behavior—compare behaviorism. — cognitive psychologist noun."}, {"url": "http://www.alleydog.com/glossary/definition.php?term=Cognitive%20Behavioral%20Therapy", "passage_text": "Cognitive Behavioral therapy refers to a classification of psychotherapeutic techniques that emphasize the important role that thinking (cognitive) plays in how we feel and act (behavioral)."}]