[{"url": "http://www.ehow.com/facts_6173359_stem-cell-kids.html", "passage_text": "Stem cells are cells that develop into different cell types in the body during growth. Different parts of your body are made up of different kinds of cells. Stem cells are not specific to one area in the body and can turn into skin, bone, blood or brain cells. "}, {"url": "https://en.wikipedia.org/wiki/Stem_cell", "passage_text": "Stem cells are undifferentiated biological cells that can differentiate into specialized cells and can divide (through mitosis) to produce more stem cells. Embryonic stem (ES) cells are stem cells derived from the inner cell mass of a blastocyst, an early-stage embryo. Human embryos reach the blastocyst stage 4–5 days post fertilization, at which time they consist of 50–150 cells."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=10597", "passage_text": "Stem cell: One of the human body's master cells, with the ability to grow into any one of the body's more than 200 cell types. Stem cells are unspecialized (undifferentiated) cells that are characteristically of the same family type (lineage). "}, {"url": "http://www.merriam-webster.com/dictionary/stem%20cell", "passage_text": "stem cell. noun. Tweet. : a simple cell in the body that is able to develop into any one of various kinds of cells (such as blood cells, skin cells, etc.)."}, {"url": "http://science.howstuffworks.com/life/cellular-microscopic/stem-cell1.htm", "passage_text": "The earliest stem cells in the human body are those found in the human embryo. The stem cells inside an embryo will eventually give rise to every cell, tissue and organ in the fetus's body. Unlike a regular cell, which can only replicate to create more of its own kind of cell, a stem cell is pluripotent. 1 Embryonic stem cells-Embryonic stem cells include those found within the embryo, the fetus or the umbilical cord blood. 2  Depending upon when they are harvested, embryonic stem cells can give rise to just about any cell in the human body. 3  Adult stem cells-Adult stem cells can be found in infants, children and adults."}, {"url": "https://en.wikipedia.org/wiki/Stem_cell_line", "passage_text": "A stem-cell line is a group of stem cells that is cultured in vitro and can be propagated indefinitely. Stem-cell lines are derived from either animal or human tissues and come from one of three sources: embryonic stem cells, adult stem cells, or induced stem cells. "}, {"url": "http://www.loc.gov/rr/scitech/mysteries/stemcells.html", "passage_text": "3. The blastocyst has an outer-layer of cells called the trophoblast, which will eventually form the protective placenta. Inside the trophoblast is a group of cells called the inner cell mass. The organism in a stage between zygote to fetus is called an embryo* and the cells are called embryonic stem cells."}, {"url": "http://encyclopedia.kids.net.au/page/st/Stem_cell", "passage_text": "Stem cell. Stem cells are cells which are not terminally differentiated and are therefore able to produce cells of other types. Medical researchers hope they can be used to grow specific tissues or organs. There are three types of stem cells: totipotent, pluripotent, and multipotent. A single totipotent stem cell can grow into an entire organism. Another controversy in the use of embryonic stem cells is the use of therapeutic cloning. This involves the cloning of early embryos from which stem cells are harvested, providing a larger source of the cells. Many see this as encouraging human cloning, which they think could be dangerous or unethical."}, {"url": "https://en.wikipedia.org/wiki/Stem_cell", "passage_text": "Stem cells can also be taken from umbilical cord blood just after birth. Of all stem cell types, autologous harvesting involves the least risk. By definition, autologous cells are obtained from one's own body, just as one may bank his or her own blood for elective surgical procedures. Embryonic stem (ES) cells are stem cells derived from the inner cell mass of a blastocyst, an early-stage embryo. Human embryos reach the blastocyst stage 4–5 days post fertilization, at which time they consist of 50–150 cells."}]