[{"url": "https://support.apple.com/en-us/HT204621", "passage_text": "Turn on mouse. 1  Slide the On/Off switch on the bottom of your mouse to turn it on. 2  Note: If the battery compartment cover is not installed properly the On/Off switch may not function correctly or may be difficult to operate. 3  Remove the battery compartment cover and carefully reinstall it. 1 Remove the battery compartment cover and carefully reinstall it. 2  When your mouse is on and paired, and the batteries are charged, the indicator light glows steadily. 3  If your mouse isn’t paired with a Mac, the indicator light will blink, indicating your mouse is in discovery mode and ready to pair."}, {"url": "http://www.tomshardware.com/answers/id-2075127/computer-turns-move-mouse.html", "passage_text": "I am using a PS/2 Keyboard. If the settings are kept like in the photo, only the mouse can turn the system on. If I enable PS/2 keyboard then I can start the pc with either the keyboard or the mouse. My bios is up to date. My mobo is 7 years old, they havent released a bios update in ages. Every device that can wake the computer is disabled in the BIOS, and in Device manager the allow this device to wake the computer option is unchecked. I dont know what else to do to make this stop. My Motherboard is an Asus P5E3. This is a new mouse, Microsoft Wireless Mouse 4000."}, {"url": "http://www.cnet.com/forums/discussions/how-to-turn-on-computer-using-keyboard-mouse-178238/", "passage_text": "In reply to: Turning on using KB/Mouse. Using the keyboard you can turn-off your pc or put it into sleep or hibernate mode but you cannot turn on with your keyboard. Since there is no power to the keyboard until you press the power switch: then the BIOS initializes the keyboard and loads a keyboard driver. You can modify or jerry-rig the keyboard or mouse with a switch to operate a rely inside the Case which in turn operate the on-off switch of the computer. Power can be independent battery power. Yes, it is possible. Come to think of it, you can even switch on by wireless remote control."}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows_8-tms/mouse-pointer-not-showing-when-turn-on-my-pc/3f395996-7d6f-4aa8-a719-dcf75c9afbb6", "passage_text": "In 50% when i turn on PC (Win8) mouse is invisible, i can click, but only in 'middle', it's seems like mouse pointer is turned off somehow, and if i move it around and again click, still it clicks in middle, can't see pointer, just click. "}, {"url": "http://www.microsoft.com/enable/training/windows8/change-mouse.aspx", "passage_text": "1 If using a mouse is awkward or difficult, you can turn on Mouse Keys so you don't need to use a mouse. 2  Instead, you can use the numeric keypad or the arrow keys on your keyboard to move the pointer. 3  For more info, see Use the numeric keypad to move the mouse pointer. 4  Activate a window by pointing to it with the pointer. 1 In the search box, enter Change how your mouse works, tap or click Settings, and then tap or click Change how your mouse works. 2  Select the options that you want to use: 3  Change the color and size of mouse pointers. 4  You can use these options to make the mouse pointer larger, or change the color to make it easier to see."}, {"url": "https://support.apple.com/en-us/HT204621", "passage_text": "1 Slide the On/Off switch on the bottom of your mouse to turn it on. 2  Note: If the battery compartment cover is not installed properly the On/Off switch may not function correctly or may be difficult to operate. 3  Remove the battery compartment cover and carefully reinstall it. 1 Remove the battery compartment cover and carefully reinstall it. 2  When your mouse is on and paired, and the batteries are charged, the indicator light glows steadily. 3  If your mouse isn’t paired with a Mac, the indicator light will blink, indicating your mouse is in discovery mode and ready to pair."}, {"url": "http://www.computerhope.com/issues/ch000254.htm", "passage_text": "USB mouse. If you are using a USB mouse, disconnect the mouse cable and then reconnect to a different USB port. If the mouse is connected to a USB hub, unplug the mouse cable and the connect it to a USB port on the back of the computer. PS/2 mouse. If you are using a mouse with a PS/2 connection, check the back of the computer to verify that it is plugged into the PS/2 mouse port and not the PS/2 keyboard. If the mouse has worked properly in the past (I.E. this is not a new mouse), turn off the computer, then disconnect and reconnect the mouse. Note: A PS/2 mouse should not be disconnected and reconnected while a computer is turned on."}, {"url": "http://www.tomshardware.com/answers/id-2075127/computer-turns-move-mouse.html", "passage_text": "Its obvious that my wireless mouse is turning my computer on. I simply dont want that to happen. I checked all the wake options in BIOS, as well as device manager. Every device that can wake the computer is disabled in the BIOS, and in Device manager the allow this device to wake the computer option is unchecked. I dont know what else to do to make this stop. My Motherboard is an Asus P5E3. This is a new mouse, Microsoft Wireless Mouse 4000. Thanks"}, {"url": "http://www.microsoft.com/enable/training/windows8/change-mouse.aspx", "passage_text": "1 Select the options that you want to use: 2  Change the color and size of mouse pointers. 3  You can use these options to make the mouse pointer larger, or change the color to make it easier to see. 4  Turn on Mouse Keys. 5  If using a mouse is awkward or difficult, you can turn on Mouse Keys so you don't need to use a mouse. 1 In the search box, enter Change how your mouse works, tap or click Settings, and then tap or click Change how your mouse works. 2  Select the options that you want to use: 3  Change the color and size of mouse pointers. 4"}, {"url": "http://www.cnet.com/forums/discussions/how-to-turn-on-computer-using-keyboard-mouse-178238/", "passage_text": "...but not commercially available. You can modify or jerry-rig the keyboard or mouse with a switch to operate a rely inside the Case which in turn operate the on-off switch of the computer. Power can be independent battery power. Yes, it is possible. Come to think of it, you can even switch on by wireless remote control."}]