[{"url": "http://car-title.org/replace-title/illinois.html", "passage_text": "How to replace your lost title in Illinois. If you lost your title or it was stolen or damaged you can replace your title in Idaho. You cannot buy or sell a vehicle without a title. Replacing your Car Title. You need a title in order to sell your vehicle, so if your car title has been lost or stolen, you have no choice but to replace it. In that case, you've come to the right place. We will walk you through the process of getting your car title replaced as quickly and painlessly as possib"}, {"url": "http://www.wikihow.com/Get-a-Replacement-Title-for-Your-Car", "passage_text": "Take your application with the required fees and documents to the DMV. After the DMV has received your application for the replacement car title, they will either issue the new title to you in person, or send it to you in the mail. 1  Some states will allow you to mail your application for the replacement title to the DMV. 1 In some cases, you may be asked to provide your car's current odometer reading and its monetary value. 2  Indicate your reason for requesting a replacement title. 3  You can indicate whether your car title was lost, stolen, or damaged, or you may provide an alternate explanation."}, {"url": "http://car-title.org/replace-title/illinois.html", "passage_text": "Replace Car Title. You need a title in order to sell your vehicle, so if your car title has been lost or stolen, you have no choice but to replace it. In that case, you've come to the right place. Replacing your Car Title. You need a title in order to sell your vehicle, so if your car title has been lost or stolen, you have no choice but to replace it. In that case, you've come to the right place. We will walk you through the process of getting your car title replaced as quickly and painlessly as possibl"}, {"url": "http://www.4dmv.com/il_titles_replace_lost_title.php?state=Illinois", "passage_text": "REPLACE LOST TITLE. Illinois Duplicate Title. The title to your vehicle is a very important piece of documentation which proves who the vehicle belongs to. Your Illinois title should remain in the glove box of the car at all times. If for some reason, your title becomes lost, damaged or stolen, it is necessary to apply for a duplicate title. To apply for a duplicate title your must: · Apply at your local Secretary of State office."}, {"url": "http://www.dmv.org/il-illinois/replacing-a-lost-title.php", "passage_text": "See the link to the online form below. You can apply for a duplicate title in Montana by mail or in person at your local IL SOS office. You'll need to: 1  Complete the Application for Vehicle Transaction(s) (Form VSD 190). 2  You can also obtain a form at any Secretary of State local office, or by calling (800) 252-8980 or (312) 793-1010. Add/Remove a Lien From Your Title. To remove a lien during the duplicate title process, you must also submit: 1  A lien clearance letter or a lien contract letter that says the lien has been paid in full. 2  OR. 3  A court order that directs the Secretary of State's office to issue a title without the lien."}, {"url": "http://www.ehow.com/how_7263661_replace-lost-car-title-illinois.html", "passage_text": "A car title is a legal certificate of ownership of a vehicle. It is difficult to prove ownership of a car or to sell it if this document is missing or mutilated. Fortunately, Illinois residents can obtain a copy of a car title from the Secretary of State. Springfield, IL 62707. This form is also available from auto dealerships and many banks. Check the Duplicate Title box at the top of the form and provide the required information. This includes your name and address, the make, model and year of the car and the Vehicle Identification Number (VIN)."}, {"url": "http://www.wikihow.com/Get-a-Replacement-Title-for-Your-Car", "passage_text": "1. Obtain the application needed to replace the car title. In most states, you can print a copy of the application directly from the website for your state's DMV; however, an application can also be obtained directly from any full service DMV office. 1 In some cases, you may be asked to provide your car's current odometer reading and its monetary value. 2  Indicate your reason for requesting a replacement title. 3  You can indicate whether your car title was lost, stolen, or damaged, or you may provide an alternate explanation."}, {"url": "http://car-title.org/servlanding/replace-title/illinois.html", "passage_text": "Replace your Illinois Car Title. Driving without a car title is illegal, so if your title has been lost or stolen, you have no choice but to replace it. In that case, you've come to the right place. We will walk you through the process of getting your car title replaced as quickly and painlessly as possible. Click Get Started now. "}]