[{"url": "http://www.wisegeek.org/what-is-an-overdraft-facility.htm", "passage_text": "An overdraft facility is a formal arrangement with a bank that allows an account holder to draw on funds in excess of the amount on deposit. This type of financing is most commonly used by businesses as a way of making their working capital more flexible, although it can also be available to individuals."}, {"url": "http://banquefrancolao.com/overdraft-facility-sid38.aspx", "passage_text": "What this actually means is that when granted an overdraft facility, you can withdraw cash at a branch, issue cheques or transfers, even when your account balance is equal to or below zero on the date of the transaction."}, {"url": "http://www.moneysense.gov.sg/Understanding-Financial-Products/Credit-and-Loans/Types-of-Loans/Overdraft.aspx", "passage_text": "An overdraft facility can be granted on a secured or unsecured basis. A secured overdraft is one where you pledge an asset to the bank as security. The asset could include deposits in the bank, property or shares. If the bank stops your secured overdraft facility and you are unable to repay your debt, the bank has the right to sell your pledged assets to recover what you owe it."}, {"url": "http://www.wisegeek.org/what-is-an-overdraft-facility.htm", "passage_text": "An overdraft facility can give access to additional funds outside of what is currently available in a bank account. Businesses will sometimes take advantage of an overdraft facility to help make payroll during a month when their expenses outweighed their profits."}, {"url": "http://www.accaglobal.com/us/en/business-finance/types-finance/overdraft.html", "passage_text": "Overdraft. An overdraft is a facility that can be part of the current account of a business. Business overdraft borrowing takes place when the business makes payments out of its current account and exceeds its available balance."}, {"url": "http://financial-dictionary.thefreedictionary.com/Overdraft+Facility", "passage_text": "Overdraft Facility. A short term loan that a bank makes to a business automatically if that business otherwise would face an overdraft. For example, if a business has $10,000 in the bank and withdraws $12,000 for its payroll, an overdraft facility is an automatic loan for the extra $2,000."}, {"url": "http://www.accaglobal.com/us/en/business-finance/types-finance/overdraft.html", "passage_text": "An overdraft is a facility that can be part of the current account of a business."}]