[{"url": "http://www.livescience.com/9004-avoiding-depression-sleeping-dark-room.html", "passage_text": "Credit: Artem Chernyshevych | Stock Xchng. Exposure to a dim light at night, such as the glow of a TV screen, may prompt changes in the brain that lead to mood disorders, including depression, according to a new study in hamsters. A patient with major depression has a smaller hippocampus, Bedrosian said. The brain changes in the hamsters might arise from fluctuations in the production of the hormone melatonin, Bedrosian said. Melatonin signals to the body that it's nighttime, but a light at night dampens its production."}, {"url": "http://psycheducation.org/treatment/bipolar-disorder-light-and-darkness/", "passage_text": "Using light and darkness as treatment (less med’s!). Much of the information on this page is new research, not yet repeated by other scientists (it is always a good sign in this business if someone can repeat the study and get the same results!). What’s new is that you can prevent this reduction in melatonin by blocking blue light, with a simple pair of glasses made to block that particular color of light. They let everything else through. Things look pretty yellow through these things, but to your brain, it’s like darkness! What a trick."}, {"url": "http://www.scientificamerican.com/article/down-in-the-dark/", "passage_text": "“When the circadian system is not receiving normal light, that in turn might lead to changes in brain systems that regulate mood,” he says. Treating the rats with an antidepressant significantly ameliorated brain damage and depressive behaviors. “Our study provides a new animal system for antidepressant devel­opment. Many existing animal models depend on stress. Our model is a stress-free means of producing a depression."}, {"url": "http://www.huffingtonpost.com/2014/02/24/light-emotions_n_4831224.html", "passage_text": "ooyoo via Getty Images. The intensity of light could also have an impact on the intensity of our emotions, a new study suggests. Research published in the Journal of Consumer Psychology shows that the more intense the lighting, the greater a person's emotions -- both positive and negative. Researchers noted that the bright light's ability to make people feel warmer could have something to do with increasing the intensity of their emotions. We suggest that these effects arise because light underlies perception of heat, and perception of heat can trigger the hot emotional system, the study said."}, {"url": "http://www.webmd.com/depression/features/seasonal-affective-disorder", "passage_text": "Many things, including brain chemicals, ions in the air, and genetics seem to be involved. But researchers agree that people who suffer from winter depression -- also known as  seasonal affective disorder , a term that produces the cute acronym SAD -- have one thing in common. They're particularly sensitive to light, or the lack of it. "}, {"url": "http://www.scientificamerican.com/article/down-in-the-dark/", "passage_text": "By Lisa Conti | Jul 1, 2008. The association between darkness and depression is well established. Now a March 25 study in the Proceedings of the National Academy of Sciences reveals for the first time the profound changes that light deprivation causes in the brain. Neuroscientists at the University of Pennsylvania kept rats in the dark for six weeks. Treating the rats with an antidepressant significantly ameliorated brain damage and depressive behaviors. “Our study provides a new animal system for antidepressant devel­opment. Many existing animal models depend on stress. Our model is a stress-free means of producing a depression."}, {"url": "http://meatingofminds.blogspot.com/2013/04/depression-and-dark-room-problem.html", "passage_text": "Now, most of the time this is going to be correct, but on first hearing about the dark room problem my reaction was that actually I sometimes do just want to lie in a dark room. I suffer from periodic bouts of depression, and during these depressive episodes a dark room is pretty much all I can cope with. It also fits well with predictive processing and the dark room problem. Predictive processing has already been applied to the positive symptoms of schizophrenia and other delusions (in the form of false error signals), and similarly I think we could say that in some cases the dark room problem simply isn't a problem."}, {"url": "http://articles.mercola.com/sites/articles/archive/2012/08/09/too-much-night-light-causes-depression.aspx", "passage_text": "1 Exposure to light at night (even dim light) can suppress your body’s melatonin production, and there are many studies that suggest melatonin levels (and by proxy light exposures) control mood-related symptoms, such as those associated with depression. They pointed out that rates of depression have risen along with exposure to artificial light at night: Exposure to artificial light at night (LAN) has surged in prevalence during the past 50 years, coinciding with rising rates of depression.."}, {"url": "http://meatingofminds.blogspot.com/2013/04/depression-and-dark-room-problem.html", "passage_text": "On the other hand, depression and other mental illnesses are extremely complex, and I remain suspicious of any theory that tries to tell one simple story about them. Better perhaps to treat the dark room as just one of many contributing factors, or even just a useful metaphor. It also fits well with predictive processing and the dark room problem. Predictive processing has already been applied to the positive symptoms of schizophrenia and other delusions (in the form of false error signals), and similarly I think we could say that in some cases the dark room problem simply isn't a problem."}, {"url": "http://meatingofminds.blogspot.com/2013/04/depression-and-dark-room-problem.html", "passage_text": "In cases of depression this mechanism is simply over-sensitive or, in the worst cases, always switched on. I'm not sure how much I'm convinced by this theory, but lets assume that there is at least a shred of truth in it. It also fits well with predictive processing and the dark room problem. Predictive processing has already been applied to the positive symptoms of schizophrenia and other delusions (in the form of false error signals), and similarly I think we could say that in some cases the dark room problem simply isn't a problem."}]