[{"url": "https://www.citizensadvice.org.uk/debt-and-money/insurance/payment-protection-insurance/", "passage_text": "Many PPI policies pay out in blocks of 30 days. This means that if you returned to work after 28 days, you wouldn’t get a payment. There is usually a 30-day delay, or waiting period, before you can make a claim. How much will the policy cost. The cost of PPI can be high. It can add a significant amount to your loan. You should always shop around to make sure you're getting the best deal and a policy which will meet your needs if you"}, {"url": "http://www.iamhappi.com/how-much-ppi-will-i-get", "passage_text": "PPI refund claims are averaging around £2,000 to £3,000. Every case is individual, so for instance in one case, we recovered over £34,000 on a Picture Loan PPI Claim. From our calculations, as a rough and ready guide, the PPI reclaim amount is about 15% to 30% of the loan valuation. So, if your loan is £5,000 your PPI refund could be in the region of £1,000. Below is a simple ready reckoner based on an average 20% PPI to loan valuation. PPI CALCULATOR*. [Left-Hand Column = Amount Borrowed: Right-Hand PPI Re-Claim]. £5,000 = £1,000 PPI claim CLAIM FORM or CONTACT US to make a claim. £6,000 = £1,200 PPI claim CLAIM FORM or CONTACT US to make a claim"}, {"url": "http://www.netmums.com/coffeehouse/house-garden-194/money-finance-entitlements-267/887556-ppi-really-easy-all.html", "passage_text": "Originally Posted by Laura R(690) Just before Christmas I decided on the advice of a friend to write a letter to my bank to claim Payment protection on a loan I got out 9 years a go to get married. I couldn't remember any details except that it was a loan for 5000 pounds over 5 years and I paid 20 a month PPI. So if you have had a loan and had PPI what are you waiting for. Don't get a company to do the work for you and take 1/3 of the money. You can do it yourself, it will take a total of half an hour and the cost of 1 first class stamp. I'm so pleased"}, {"url": "http://www.netmums.com/coffeehouse/house-garden-194/money-finance-entitlements-267/887556-ppi-really-easy-all.html", "passage_text": "PPI-It really is that easy! Just before Christmas I decided on the advice of a friend to write a letter to my bank to claim Payment protection on a loan I got out 9 years a go to get married. I couldn't remember any details except that it was a loan for 5000 pounds over 5 years and I paid 20 a month PPI. So if you have had a loan and had PPI what are you waiting for. Don't get a company to do the work for you and take 1/3 of the money. You can do it yourself, it will take a total of half an hour and the cost of 1 first class stamp. I'm so pleased"}, {"url": "http://www.ppiclaimsandadvice.com/ppi-refund-calculator/", "passage_text": "A credit card PPI policy will usually charge 1% of the outstanding balance. If, for example, you have £5,000 outstanding on your credit card, you will have a further £50 added to your balance at that point (£5,000 x 1% = £50). "}, {"url": "http://www.ppiclaimcompany.co.uk/how-much-ppi-will-i-get-back", "passage_text": "Belmont Thornton, Belmont Thornton, has a specialist claims team on hand to help by answering your question, How much PPI will I get back? and they will also be able to tell you if they feel you have a claim based on criteria set forth by FSA. As well, you may find that the claim estimator on Belmont Thornton website will give you are fairly accurate approximation as to how much PPI you are likely to get back."}, {"url": "http://www.moneysavingexpert.com/reclaim/ppi-credit-card-insurance", "passage_text": "If you have a credit card or store card, you may be able to reclaim 1,000s of PPI yourself, easily, for free. Don't hand 30% to a no-win no-fee claims handler. This step-by-step guide with free templates will let you join the millions of people who've successfully complained. "}, {"url": "http://www.netmums.com/coffeehouse/house-garden-194/money-finance-entitlements-267/945832-ppi-all.html", "passage_text": "PPI. Hi, I just found out I have been charged PPI (payment protection insurance) on 2 loans I took out with RBS. One lone was for 3,000 and I can't remember how much the other one was for. They were both taken out in 2008. I am going through the financial ombudsman to try and sort this out. "}, {"url": "http://www.ppiclaimcompany.co.uk/how-much-ppi-will-i-get-back", "passage_text": "Again, that is solely dependent upon how much you paid in! If your loan was for £10,000 and your PPI rate was 23% then you will be able to claim back far less than the consumer who satisfied a £25,000 loan that carried a PPI rate of 34%. As well, you may find that the claim estimator on Belmont Thornton website will give you are fairly accurate approximation as to how much PPI you are likely to get back."}]