[{"url": "http://www.innovateus.net/science/what-are-spores", "passage_text": "In biology, Spore is a reproductive structure that is adapted for dispersal and surviving for extended periods of time in unfavorable conditions. Spores are a type of haploid, a unique type of cell structure produced by certain kinds of plants as a means of reproduction. Spores are usually unicellular, measuring between 4 and 20 micrometers in size."}, {"url": "http://www.innovateus.net/science/what-are-spores", "passage_text": "Main Image: In biology, Spore is a reproductive structure that is adapted for dispersal and surviving for extended periods of time in unfavorable conditions. Spores form part of life cycles of many bacteria, plants, algae, fungi and some protozoans. Spores are a type of haploid, a unique type of cell structure produced by certain kinds of plants as a means of reproduction. Spores are usually unicellular, measuring between 4 and 20 micrometers in size."}, {"url": "https://en.wikipedia.org/wiki/Ascomycetes", "passage_text": "Ascomycota is a division or phylum of the kingdom Fungi that, together with the Basidiomycota, form the subkingdom Dikarya. Its members are commonly known as the sac fungi or ascomycetes. They are the largest phylum of Fungi, with over 64,000 species. "}, {"url": "http://www.innovateus.net/science/what-are-spores", "passage_text": "Similar to pollen, spores are created from a select number of fertile cells held in the sporangium and covered by a protective layer of inert cells. These fertile, or sporogenous cells eventually develop into mother spore cells. Each mother cell creates 4 separate spore cells. Spores are a type of haploid, a unique type of cell structure produced by certain kinds of plants as a means of reproduction. Spores are usually unicellular, measuring between 4 and 20 micrometers in size."}, {"url": "https://en.wikipedia.org/wiki/Spore", "passage_text": "Spores form part of the life cycles of many plants, algae, fungi and protozoa. Bacterial spores are not part of a sexual cycle but are resistant structures used for survival under unfavourable conditions. Since fungi are often classified according to their spore-producing structures, these spores are often characteristic of a particular taxon of the fungi. 1  Sporangiospores: spores produced by a sporangium in many fungi such as zygomycetes. 2  Zygospores: spores produced by a zygosporangium, characteristic of"}, {"url": "https://en.wikipedia.org/wiki/Spore", "passage_text": "In fungi and fungus-like organisms, spores are often classified by the structure in which meiosis and spore production occurs. Since fungi are often classified according to their spore-producing structures, these spores are often characteristic of a particular taxon of the fungi. 1  Sporangiospores: spores produced by a sporangium in many fungi such as zygomycetes. 2  Zygospores: spores produced by a zygosporangium, characteristic of zygomycetes."}, {"url": "https://en.wikipedia.org/wiki/Spore", "passage_text": "This cycle is known as alternation of generations. The spores of seed plants, however, are produced internally and the megaspores, formed within the ovules and the microspores are involved in the formation of more complex structures that form the dispersal units, the seeds and pollen grains. Since fungi are often classified according to their spore-producing structures, these spores are often characteristic of a particular taxon of the fungi. 1  Sporangiospores: spores produced by a sporangium in many fungi such as zygomycetes. 2  Zygospores: spores produced by a zygosporangium, characteristic of"}, {"url": "http://study.com/academy/lesson/what-are-spores-definition-types-quiz.html", "passage_text": "Spores are the reproductive structure of the 'lower plants,' plants that don't flower. Fungi, algae, and even some bacteria all form spores when they want to pass their genes on. Plant spores are produced by the organisms we can usually recognize. The major types of plants that form spores are algae, mosses, and ferns. Algae are the simplest of these plants, and can range from tiny, single celled things to large, multi-celled plants that cover your backyard pond."}, {"url": "http://www.peteducation.com/article.cfm?c=16+2160&aid=2956", "passage_text": "Spores are tiny single cells that are produced by fungi that have hyphae. They can be produced asexually by a process in which the tips of the hyphae form specially encased cells – the spores. Some fungi also produce spores sexually. Two types of special cells called gametes are produced. One of each type unite to produce a new individual spore."}, {"url": "http://faculty.college-prep.org/~bernie/sciproject/project/Kingdoms/Fungi%207/fungi%20website/features.html", "passage_text": "Above: an anatomy diagram of a common capped club fungi. In all cases, though, this above-ground structure contains spores. This way, the spores, which are the reproductive system of fungi (much like seeds in plants), can be carried and spread. Spores are generally released from the gills of a mushroom. "}]