[{"url": "http://www.thefashionspot.com/celebrity-fashion/424689-the-spice-girls-did-it-first/", "passage_text": "The Spice Girls Did It First: 90s Fashion Trends We’re Still Wearing. Jihan Forbes. There's been a lot of 90s nostalgia happening as of late, but there's nothing from the decade we miss more than the Spice Girls. Call it a 90s revival or call it longevity, but it seems like almost everything the girls wore back in 1997 could be relevant today. Check out the trends the Spice Girls inspired that are still in style."}, {"url": "http://noisey.vice.com/blog/the-score-mapping-the-music-style-and-girl-power-of-spice-world", "passage_text": "It's also evidence of a simpler, much more naive time when people wore platform shoes unironically. The movie opens on the girls in all white outfits singing “Too Much” definitive proof that you can bend thematic dressing to suit your personality, with each Spice’s kit showing us exactly what kind of Spice they are. "}, {"url": "http://www.mtv.com/artists/spice-girls/", "passage_text": "About Spice Girls. Spice Girls were the first major British pop music phenomenon of the mid-'90s to not have a debt to independent pop/rock. Instead, the all-female quintet derived from the dance-pop tradition that made Take That the most popular British group of the early '90s, but there was one crucial difference"}, {"url": "https://en.wikipedia.org/wiki/Spice_Girls", "passage_text": "Under the guidance of their mentor and manager Simon Fuller, the Spice Girls embraced merchandising and became a regular feature of the British and global press. In 1996, Top of the Pops magazine gave each member of the group aliases, which were adopted by the group and media. 1 Emma Bunton: Emma was called Baby Spice because she was the youngest member of the group, wore her long blonde hair in pigtails, wore babydoll dresses, had an innocent smile, and had a girly girl personality."}, {"url": "https://en.wikipedia.org/wiki/Spice_Girls_discography", "passage_text": "The Spice Girls' debut single,  Wannabe , was released by Virgin Records in the United Kingdom in July 1996. It went to number one in thirty-one countries worldwide and became the biggest-selling debut single of all time. As of January 2010, the Spice Girls have sold more than 80 million records worldwide. In 2012, the Official Charts Company revealed the biggest selling singles artists in British music chart history; the Spice Girls placed at 20th overall, making them the most successful girl group in UK chart history."}, {"url": "https://en.wikipedia.org/wiki/Spice_Girls", "passage_text": "Later, Girl Talk was released. It was a television special where the Spice Girls spoke individually about themselves and the group. In April 1997, The Spice Girls appeared on the popular American television show Saturday Night Live, singing Wannabe and  Say You'll Be There . 1 Emma Bunton: Emma was called Baby Spice because she was the youngest member of the group, wore her long blonde hair in pigtails, wore babydoll dresses, had an innocent smile, and had a girly girl personality."}, {"url": "https://en.wikipedia.org/wiki/Spice_Girls_discography", "passage_text": "The fourth Spice Girls single, the double A-side  Mama / Who Do You Think You Are , also went to number one in the UK. In November 1997 the group released their second album, Spiceworld, which has been certified five times platinum by the BPI. As of January 2010, the Spice Girls have sold more than 80 million records worldwide. In 2012, the Official Charts Company revealed the biggest selling singles artists in British music chart history; the Spice Girls placed at 20th overall, making them the most successful girl group in UK chart history."}, {"url": "http://www.teen.com/2013/12/10/celebrities/spice-girls-fun-facts/", "passage_text": "now-here-this.timeout.com. The Spice Girls are arguably the biggest girl group of all time, but we bet you didn’t know that they (sort of) have a Simon Cowell connection! On The Tonight Show With Jay Leno on Monday night, The X Factor judge revealed his biggest career regret — he missed out on landing a deal with The Spice Girls. The exact details are a little muddled as he says he offered them a deal and was too late, while the group says he turned them down as Victoria Beckham revealed in 2009, “He is the only man in the music industry who turned down the Spice Girls – and said we would never work."}, {"url": "https://en.wikipedia.org/wiki/Spice_Girls", "passage_text": "The Spice Girls are an English pop girl group formed in 1994. The group consisted of Melanie Brown (Scary Spice), Melanie Chisholm (Sporty Spice), Emma Bunton (Baby Spice), Geri Halliwell (Ginger Spice), and Victoria Beckham, nee Née (Adams Posh). spice 1 Emma Bunton: Emma was called Baby Spice because she was the youngest member of the group, wore her long blonde hair in pigtails, wore babydoll dresses, had an innocent smile, and had a girly girl personality."}]