[{"url": "http://www.usmagazine.com/entertainment/news/the-walking-dead-could-glenn-have-died-in-the-season-5-finale-2015303", "passage_text": "Glenn's not dead! Though The Walking Dead characters are in constant peril, there was at least some relief in the tense season 5 finale — Daryl Dixon (Norman Reedus) and Glenn Rhee (Steven Yeun) are still alive and well."}, {"url": "https://en.wikipedia.org/wiki/Glenn_(The_Walking_Dead)", "passage_text": "Glenn Rhee is a fictional character from the comic book series The Walking Dead and is portrayed by Steven Yeun in the AMC television series of the same name. He is also voiced by Nick Herman in the video game of the same name, by Telltale Games. In the comics, he was known simply as Glenn and was not given a last name."}, {"url": "http://midtod.com/9710/glenmiller.phtml", "passage_text": "Udo Ulfkotte says instead that while doing research for a book, he discovered Secret Service files which show that Miller died of a heart attack in the arms of a Paris prostitute Dec. 15, 1944. A retired colonel who says he was Glenn Miller's pilot disputes the claim. Lt.-Col."}, {"url": "http://www.ask.com/science/did-john-glenn-die-9f9bef53d0488e46", "passage_text": "Quick Answer. As of April 2014, John Glenn is not dead, he is still alive. According to Biography, Glenn was born on July 18, 1921 in Cambridge, Ohio. In 1962, aboard Friendship 7, he became the first American to orbit the Earth."}, {"url": "http://walkingdead.wikia.com/wiki/Glenn_(Comic_Series)", "passage_text": "1 Glenn and Dale are the only adult characters who survived the prison to never kill a human. 2  Glenn is 22 years old according to the script book. 3  Glenn is the first character to die in a three digit issue of The Walking Dead. 4  Glenn died in Issue 100, a landmark issue for"}, {"url": "http://www.hngn.com/articles/33111/20140605/walking-dead-season-5-spoilers-glenn-die-new-death-rumor.htm", "passage_text": "(Photo: Facebook). Last week there was a rumor that a fan-favorite was going to be killed in Season 5 of  The Walking Dead , which is currently filming in Atlanta. According to The Spoiling Dead's Facebook page, Glenn Rhee (played by Steven Yeun) will meet his demise when the show returns in October."}]