[{"url": "https://en.wikipedia.org/wiki/Dengue_fever", "passage_text": "Dengue is transmitted by several species of mosquito within the genus Aedes, principally A. aegypti. The virus has five different types; infection with one type usually gives lifelong immunity to that type, but only short-term immunity to the others. Dengue fever virus (DENV) is an RNA virus of the family Flaviviridae; genus Flavivirus. Other members of the same genus include yellow fever virus, West Nile virus, St. Louis encephalitis virus, Japanese encephalitis virus, tick-borne encephalitis virus, Kyasanur forest disease virus, and Omsk hemorrhagic fever virus."}, {"url": "http://medical-dictionary.thefreedictionary.com/dengue+fever", "passage_text": "It is transmitted to humans by the bite of an infected Aedes aegypti mosquito and occurs in tropic and subtropic regions. The disease usually produces a triad of symptoms: fever; rash; and severe head, back, and muscle pain. Manifestations of dengue usually occur in two phases, separated by a day of remission. The virus that causes dengue fever is called an arbovirus, which stands for arthropod-borne virus. Mosquitoes are a type of arthropod. In a number of regions, mosquitoes carry this virus and are responsible for passing it along to humans."}, {"url": "http://www.medicinenet.com/dengue_fever/article.htm", "passage_text": "1 Dengue fever is a disease caused by a family of viruses that are transmitted by mosquitoes. 2  Symptoms include severe joint and muscle pain, swollen lymph nodes, headache, fever, exhaustion, and rash. 3  The presence of fever, rash, and headache (the dengue triad) is characteristic of dengue fever. Dengue hemorrhagic fever is a more severe form of the viral illness. Symptoms include headache, fever, rash, and evidence of hemorrhage in the body."}, {"url": "https://en.wikipedia.org/wiki/Dengue_fever", "passage_text": "For other uses, see Dengue fever (disambiguation) . Dengue fever, also known as breakbone fever, is a mosquito-borne tropical disease caused by the dengue virus. Symptoms include fever, headache, muscle and joint pains, and a characteristic skin rash that is similar to measles. Dengue fever virus (DENV) is an RNA virus of the family Flaviviridae; genus Flavivirus. Other members of the same genus include yellow fever virus, West Nile virus, St. Louis encephalitis virus, Japanese encephalitis virus, tick-borne encephalitis virus, Kyasanur forest disease virus, and Omsk hemorrhagic fever virus."}, {"url": "http://www.cdc.gov/dengue/fAQFacts/index.html", "passage_text": "A. Dengue is transmitted to people by the bite of an Aedes mosquito that is infected with a dengue virus. The mosquito becomes infected with dengue virus when it bites a person who has dengue virus in their blood. The person can either have symptoms of dengue fever or DHF, or they may have no symptoms. "}, {"url": "http://www.nature.com/scitable/topicpage/what-is-dengue-fever-22399100", "passage_text": "Infection with the dengue virus can also cause a disease called severe dengue, which is more serious than dengue fever. Although the early symptoms of severe dengue are similar to dengue fever, severe dengue has a much higher death rate. As with dengue fever, patients with severe dengue have a high fever, experience bleeding, and have a reduced white blood cell count. The classic symptoms of dengue include a high fever, severe pain in the muscles, bones, and joints, pain behind the eyes, severe headaches, nausea and vomiting, and a rash. Most patients recover from dengue infections with rest and fluids."}, {"url": "http://www.austincc.edu/microbio/2993p/df.htm", "passage_text": "* Disease: The universal name for the disease is Dengue Fever. Other names that are commonly associated with this disease include: Dengue Hemorrhagic Fever ((DHF) Disease caused by Dengue Fever), Breakbone Fever, Dandy Fever, O'nyong-nyong Fever, Dengue shock syndrome (DSS) and Dengue-like Disease (5). * Signs/Symptoms: The disease ranges from mild to severe. Mild dengue fever causes chills, high fever (that lasts about five to seven days), rash, severe headache, pain behind the eyes and muscle and joint pain (3, 4). The severe joint pain has given dengue the name Breakbone Fever (3)."}, {"url": "http://www.whereincity.com/medical/diseases/general/dengue-fever-61.htm", "passage_text": "Several serotypes can be in circulation during an epidemic. The virus of the mosquitoes is not contagious and cannot be spread directly from person to person. There must be a person-to-mosquito-to-another-person pathway. Other Names of Dengue Fever are: Dandy fever, Three-day fever, Breakbone fever. It is called as Breakbone Fever because the Victims of dengue often have contortions due to the intense joint and muscle pain, hence it has named as breakbone fever. Signs & Symptoms of Dengue Fever. The time between the bite of a mosquito carrying dengue virus and the start of symptoms averages 5 to 7 days, with a range of 3 to 14 days. An infected person cannot spread the infection to other persons but can be a source of dengue virus for mosquitoes for about 6 days."}, {"url": "http://www.medicinenet.com/dengue_fever/article.htm", "passage_text": "Dengue goes by other names, including breakbone fever or dandy fever.. Victims of dengue often have contortions due to the intense joint, muscle, and bone pain, hence the name breakbone fever. Slaves in the West Indies who contracted dengue were said to have dandy fever because of their postures and gait. Dengue hemorrhagic fever is a more severe form of the viral illness. Symptoms include headache, fever, rash, and evidence of hemorrhage in the body."}]