[{"url": "http://www.switchzoo.com/profiles/arcticwolf.htm", "passage_text": "Mammal. The Arctic wolf is a subspecies of the gray wolf (Canis lupus). Arctic wolves inhabit some of the most inhospitable terrain in the world where the air temperature rarely rises above -30 degrees C (-22 F) and the ground is permanently frozen."}, {"url": "http://a-z-animals.com/animals/arctic-wolf/", "passage_text": "The Arctic wolf is found in the most northern parts of the wolf\\'s range, in the Arctic Circle. Arctic wolves mainly inhabit Northern Canada and Alaska, parts of Greenland and Iceland and Northern Europe. Arctic wolves are incredibly versatile and adaptive animals, able to withstand year round sub-zero temperatures."}, {"url": "http://www.wolfquest.org/wolf_arctic.php", "passage_text": "Description: Arctic wolves have adapted very well to the icy environment where they live. They have white fur, which allows them to blend into their snowy surroundings. To help reduce heat loss, they have more-rounded ears, a shorter muzzle and shorter legs than other gray wolf subspecies."}, {"url": "http://wwf.panda.org/about_our_earth/species/profiles/mammals/arcticwolf/", "passage_text": "In fact, the arctic wolf is the only sub-species of wolf that is not threatened. Physical Description. Arctic wolves are smaller than grey wolves, They also have smaller ears and shorter muzzles to retain body heat. Size. Length: about 1-1.8m, including tail."}, {"url": "http://www.arctic.noaa.gov/essay_mech.html", "passage_text": "One of the most fascinating creatures inhabiting the Arctic is the arctic wolf (Canis lupus arctos). The arctic wolf is a race, subspecies, or geographic variant of the gray wolf (Canis lupus) species that originally lived throughout the northern hemisphere north of 15°N latitude (12°N latitude in India)."}, {"url": "http://www.wolfworlds.com/arctic-wolf/", "passage_text": "Description. No other wolf in the world can offer the same coloring as the Arctic Wolf. It is very unique due to the location where it is found. While some species of wolves do have some white coloring, this one is almost completely white. They do offer some aspects of yellow, gray, and black in places though."}, {"url": "http://animals.about.com/cs/mammals/p/arcticwolf.htm", "passage_text": "The Arctic wolf (Canis lupus arctos) is a subspecies of the grey wolf that inhabits the Arctic regions of North America and Greenland. Arctic wolves are also known as polar wolves or white wolves."}]