[{"url": "https://en.wikipedia.org/wiki/Biogeochemical_cycle", "passage_text": "In Earth science, a biogeochemical cycle or substance turnover or cycling of substances is a pathway by which a chemical substance moves through both biotic (biosphere) and abiotic (lithosphere, atmosphere, and hydrosphere) compartments of Earth. The most well-known and important biogeochemical cycles, for example, include. 1  the carbon cycle, 2  the nitrogen cycle, 3  the oxygen cycle, 4  the phosphorus cycle, 5  the sulphur cycle, 6  the water cycle, 7  and the rock cycle."}, {"url": "http://www.nature.com/scitable/knowledge/library/the-nitrogen-cycle-processes-players-and-human-15644632", "passage_text": "In fact, some predict that by 2030, the amount of nitrogen fixed by human activities will exceed that fixed by microbial processes (Vitousek 1997). Increases in available nitrogen can alter ecosystems by increasing primary productivity and impacting carbon storage (Galloway et al. 1994). In terrestrial ecosystems, the addition of nitrogen can lead to nutrient imbalance in trees, changes in forest health, and declines in biodiversity. With increased nitrogen availability there is often a change in carbon storage, thus impacting more processes than just the nitrogen cycle."}, {"url": "http://water.usgs.gov/edu/nitrogen.html", "passage_text": "Nutrients, such as nitrogen and phosphorus, are essential for plant and animal growth and nourishment, but the overabundance of certain nutrients in water can cause a number of adverse health and ecological effects. Nitrogen, in the forms of nitrate, nitrite, or ammonium, is a nutrient needed for plant growth. Excess nitrogen in water can harm people. Too much nitrogen, as nitrate, in drinking water can be harmful to young infants or young livestock. Excessive nitrate can result in restriction of oxygen transport in the bloodstream."}, {"url": "https://en.wikipedia.org/wiki/Biogeochemical_cycle", "passage_text": "The term biogeochemical tells us that biological, geological and chemical factors are all involved. The circulation of chemical nutrients like carbon, oxygen, nitrogen, phosphorus, calcium, and water etc. through the biological and physical world are known as biogeochemical cycles. In effect, the element is recycled, although in some cycles there may be places (called reservoirs) where the element is accumulated or held for a long period of time (such as an ocean or lake for water). The most well-known and important biogeochemical cycles, for example, include. 1  the carbon cycle, 2  the nitrogen cycle, 3  the oxygen cycle, 4  the phosphorus cycle, 5  the sulphur cycle, 6  the water cycle, 7  and the rock cycle."}, {"url": "http://edis.ifas.ufl.edu/sg118", "passage_text": "As they rise through the water column, these algae take up nitrogen and can attain bloom levels by the time they reach the surface. Just controlling external inputs of phosphorus may have a limited impact on Microcystis and its negative effects, depending on the ecosystem’s internal reserves of phosphorus. Figure 2. Researchers also focused more on the role of phosphorus because it is much less available than nitrogen to plants and animals in the freshwater environment, and thus considered a more important factor that limits growth."}, {"url": "https://en.wikipedia.org/wiki/Nitrogen_cycle", "passage_text": "Plants take nitrogen from the soil by absorption through their roots as nitrate ions, nitrite ions, or ammonium ions. Most nitrogen obtained by terrestrial animals can be traced back to the eating of plants at some stage of the food chain. "}, {"url": "http://edis.ifas.ufl.edu/sg118", "passage_text": "Rethinking the Role of Nitrogen and Phosphorus in the Eutrophication of Aquatic Ecosystems. Karl Havens and Thomas Frazer. For many years, environmental agencies have sought to improve the water quality of lakes and estuaries by reducing inputs of phosphorus. Researchers also focused more on the role of phosphorus because it is much less available than nitrogen to plants and animals in the freshwater environment, and thus considered a more important factor that limits growth."}, {"url": "http://water.usgs.gov/edu/nitrogen.html", "passage_text": "Nitrate can also be formed in water bodies through the oxidation of other forms of nitrogen, including nitrite, ammonia, and organic nitrogen compounds such as amino acids. Ammonia and organic nitrogen can enter water through sewage effluent and runoff from land where manure has been applied or stored. Excess nitrogen in water can harm people. Too much nitrogen, as nitrate, in drinking water can be harmful to young infants or young livestock. Excessive nitrate can result in restriction of oxygen transport in the bloodstream."}, {"url": "http://edis.ifas.ufl.edu/sg118", "passage_text": "Nutrients are chemical elements that influence the productivity of all ecosystems. Nitrogen and phosphorus are two nutrients that are essential for the growth and survival of plants and animals, but often are present in short supply. Both nitrogen and phosphorus are applied regularly through fertilizer to increase the yield of crops needed to feed human populations. Researchers also focused more on the role of phosphorus because it is much less available than nitrogen to plants and animals in the freshwater environment, and thus considered a more important factor that limits growth."}]