[{"url": "http://www.factcheck.org/2009/03/the-fairness-doctrine/", "passage_text": "As for whether the revival of the fairness doctrine would put the brakes on conservative talk radio: It well could reduce the airtime of such shows. Basically they are saying that the Fairness Doctrine will require equal time for both right and left points of view and will possibly shut down conservative talk radio. FULL ANSWER. For all the heated discussion of the fairness doctrine, it’s worth noting that there was never an official document laying it out."}, {"url": "http://content.time.com/time/nation/article/0,8599,1880786,00.html", "passage_text": "Newt Gingrich called the Fairness Doctrine Affirmative Action for liberals and Hannity called it an assault on the First Amendment.. Both sides are likely overstating the doctrine's import. The FCC has never applied the Fairness Doctrine to a talk radio host, nor does the regulation force stations to give equal time for every perspective. Further, the point might be moot without support from the Oval Office  which the doctrine does not currently enjoy."}, {"url": "http://www.factcheck.org/2009/03/the-fairness-doctrine/", "passage_text": "All of the other issues mentioned by Ortiz are controversial in their own right, but none of them are functional equivalents of the fairness doctrine from days of yore. And last month, an Obama spokesman told FoxNews.com that the president wasn’t interested in reviving the fairness doctrine. As the president stated during the campaign, he does not believe the Fairness Doctrine should be reinstated, spokesman Ben LaBolt told the Web site. Basically they are saying that the Fairness Doctrine will require equal time for both right and left points of view and will possibly shut down conservative talk radio. FULL ANSWER. For all the heated discussion of the fairness doctrine, it’s worth noting that there was never an official document laying it out."}, {"url": "http://www.merriam-webster.com/dictionary/fairness%20doctrine", "passage_text": "Definition of FAIRNESS DOCTRINE. : a tenet of licensed broadcasting that ensures a reasonable opportunity for the airing of conflicting viewpoints on controversial issues. ADVERTISEMENT. "}, {"url": "http://www.museum.tv/eotv/fairnessdoct.htm", "passage_text": "FAIRNESS DOCTRINE. U.S. Broadcasting Policy. The policy of the United States Federal Communications Commission that became known as the Fairness Doctrine is an attempt to ensure that all coverage of controversial issues by a broadcast station be balanced and fair. "}, {"url": "http://definitions.uslegal.com/f/fundamental-fairness-doctrine/", "passage_text": "Fundamental-Fairness Doctrine Law & Legal Definition. Fundamental fairness doctrine is a rule that applies the principles of due process to a judicial proceeding. Fundamental-Fairness is considered synonymous with due process. "}, {"url": "http://www.factcheck.org/2009/03/the-fairness-doctrine/", "passage_text": "A: Obama has made it clear he opposes it. If it were revived, it probably would reduce the overall number of radio hours devoted to conservative talk shows. FULL QUESTION. I hear Rush [Limbaugh] and others talk about the Fairness Doctrine. Basically they are saying that the Fairness Doctrine will require equal time for both right and left points of view and will possibly shut down conservative talk radio. FULL ANSWER. For all the heated discussion of the fairness doctrine, it’s worth noting that there was never an official document laying it out."}, {"url": "http://content.time.com/time/nation/article/0,8599,1880786,00.html", "passage_text": "It's as predictable as Rush Limbaugh sparking a controversy: every few years, someone in Congress brings up the Fairness Doctrine. The FCC has never applied the Fairness Doctrine to a talk radio host, nor does the regulation force stations to give equal time for every perspective. Further, the point might be moot without support from the Oval Office  which the doctrine does not currently enjoy."}]