[{"url": "https://en.wikipedia.org/wiki/Ketel_One", "passage_text": "Ketel One Vodka is named after the original copper pot still, Distilleerketel #1.. The alcohol content of this spirit is 40% (80 proof (US), 70 degrees proof (international)). The Nolet Distillery also makes Ketel One Citroen, Ketel One Oranje, and Ketel 1 Jenever. Ketel One Vodka is distilled from 100% wheat in copper pot stills, filtered over loose charcoal, and rests in tile lined tanks until ready."}, {"url": "https://uk.thebar.com/spirits/vodka/ketel-one-vodka/ketel-one-vodka", "passage_text": "Sophisticated and crisp, Ketel One is a super-premium vodka that’s been made by ten generations of the Nolet family, at their distillery in Schiedam, Holland since 1691. The purpose of the extensive production process is to make a truly exceptional vodka, Ketel One. The purity and smoothness of Ketel One make it ideal for being enjoyed on its own, chilled or with ice."}, {"url": "https://en.wikipedia.org/wiki/Ketel_One", "passage_text": "Ketel (Dutch for: Pot still) One is a liquor brand of the Nolet Distillery in Schiedam, the Netherlands. Ketel One Vodka is distilled from 100% wheat in copper pot stills, filtered over loose charcoal, and rests in tile lined tanks until ready."}, {"url": "http://us.thebar.com/brands/ketel-one-vodka", "passage_text": "The Ketel One® Vodka Collection: Inspired by over 300 years of family distilling expertise, Ketel One vodka is a marriage of old world pot still craft and modern distilling techniques, resulting in a distinctively crisp, sophisticated, and truly exceptional vodka. Each final production run is approved by a member of the Nolet family. Previous Next."}, {"url": "http://us.thebar.com/brands/ketel-one-vodka", "passage_text": "KETEL ONE® VODKA. Inspired by over 300 years of family distilling expertise, Ketel One vodka is a marriage of old world pot still craft and modern distilling techniques, resulting in a distinctively crisp, sophisticated, and truly exceptional vodka. Each final production run is approved by a member of the Nolet family. Previous Next."}, {"url": "https://uk.thebar.com/spirits/vodka/ketel-one-vodka/ketel-one-vodka", "passage_text": "Ketel One is carefully crafted using a combination of Old World craft and modern techniques. The process begins with the finest European wheat, bringing smoothness, neutrality and purity to crafting Ketel One. A high starch content on the wheat makes it ideal for crafting Ketel One. The purpose of the extensive production process is to make a truly exceptional vodka, Ketel One. The purity and smoothness of Ketel One make it ideal for being enjoyed on its own, chilled or with ice."}, {"url": "http://vodka.underthelabel.com/l/141/Ketel-One", "passage_text": "Ketel One is a delicious Vodka. No hash burn, a pleasant taste. I usually make Vodka mixed drinks with juice etc, at a half to half ratio, with K1 I can make a drink 3/4 to 1/4 juice and the taste is smooth refined and refreshing, no burning aftertaste. Ingredients. Ketel One is distilled from fermented Wheat. Wheat vodkas are popular in the Eastern European Vodka Belt countries. Wheat is one of the most popular ingredients in grain based vodkas and generally produces a smooth and fruity spirit."}, {"url": "http://www.drinkspirits.com/vodka/review-ketel-vodka/", "passage_text": "Ketel One Vodka. Most people don’t realize how vast the category of vodka is. Vodka can be made from a wide array of things, including (but not limited to) wheat, rye, corn, grapes, and potatoes. There are as many styles of vodkas as there are source ingredients. Ketel One actually gets its name from the labeling system mandated by the Dutch government for distilleries (each still has to be numbered and the oldest in the Nolets Distillery is “Distilleer Ketel 1″). The nose on Ketel One Vodka is crisp and clean, and slightly sweet with a hint of lemon."}, {"url": "https://en.wikipedia.org/wiki/Ketel_One", "passage_text": "Ketel One is produced by the Nolet Distillery in Schiedam, Holland. The Nolet Distillery was founded in 1691, and has remained in the Nolet family ever since. Ketel One is so named for the original coal-fired copper still that was used to distill it, Distilleerketel #1. Ketel One Vodka is distilled from 100% wheat in copper pot stills, filtered over loose charcoal, and rests in tile lined tanks until ready."}, {"url": "http://vodkabuzz.com/vodkas/ketel-one/", "passage_text": "Ketel One is a 40%. vodka from the Netherlands. The vodka is produced by Nolet Distillery and imported by Ketel One USA. The quality is considered to be great. The average price is around $23.36 per 750mL. Ketel One Vodka Review By taffyg2003. I had a great Ketel One martini over the holiday weekend. It was probably the best Ketel One martini I’ve had, and one of the best martinis I’ve had, too. Since it is a “common” vodka, it is easy to overlook just how nice Ketel One is; very smooth, crisp, and subtly sweet."}]