[{"url": "http://work.chron.com/beginning-salary-marine-8726.html", "passage_text": "A person who enlists in the Marines as a private has a pay grade of E-1.. This is the lowest level for enlisted personnel, once basic training is completed. According to the 2012 military pay charts, a Marine in her first four months as an E-1 earns $1,379 a month, or $16,548 a year."}, {"url": "http://work.chron.com/much-paid-rank-marine-corps-8642.html", "passage_text": "A corporal may be promoted to sergeant. an E-5 and also an NCO. A sergeant's pay begins at $2,090 per month and increases with time-in-grade, to a maximum pay for a sergeant is $2,966 after 12 years of service. Related Reading: How to Become a Warrant Officer in the Marine Corps."}, {"url": "http://work.chron.com/much-paid-rank-marine-corps-8642.html", "passage_text": "The field grade officers of the Marine Corps, the Lieutenant Colonels and Colonels, are pay grades O-5 and O-6, respectively. Pay for an O-5, a lieutenant colonel, begins at $4,893 per month and rises, after 20 years' service, to $8,070 per month."}, {"url": "http://work.chron.com/much-paid-rank-marine-corps-8642.html", "passage_text": "The pay for an E-7, a gunnery sergeant, begins at $2,637 per month and rises to as much as $4,189 per month, for more than 20 years of service. The pay for an E-8 starts at $3,794 per month and rises to $4,568 per month, for a master sergeant with more than 20 years of service in the Corps."}, {"url": "http://www.payscale.com/research/US/Employer=U.S._Marine_Corps/Salary", "passage_text": "Read More. Operating out of Arlington, Va., U.S. Marine Corps employs talent in positions ranging from Avionics Technician to Marine Corp Staff Sergeant, Ground Combat. A salary of $51K per year is the median rate at U.S. Marine Corps."}, {"url": "http://www.marines.com/being-a-marine/benefits/salary", "passage_text": "During Service: While on active duty, you'll be compensated at the standard Marine Corps pay rate. You can expect regular cost-of-living pay increases, housing or housing allowances and annual uniform allowances."}, {"url": "http://www.ehow.com/info_8124038_average-salary-master-sergeant.html", "passage_text": "On the military pay scale, the basic monthly pay for an E-8 with over 18 years of service in 2014 was $4,767.60. An E-7 with the same years in made $4,323.90. Therefore, an Army master sergeant, E8, with 18 years made $4,767.60 and an Air Force master sergeant, E-7, with the same time made $4323.90. Similar to the Army, the Marine Corps' master sergeant rank is considered an E-8 and thus is paid the same as an Army master sergeant. Note that pay varies depending on length of service. An E-8 with over eight years service in 2014 made $3,959.40."}]