[{"url": "http://www.cornishshellfish.co.uk/oysters/food-safety-and-oysters/", "passage_text": "Food safety controls on oyster production. Because food poisoning acquired from eating oysters contaminated with sewage has been a problem for many years, National and EU legislation has developed to attempt to control it. Two methods are used to control food safety in oysters: 1. 1 Food poisoning acquired from eating oysters infected with norovirus is still common. 2  In a recent Food Standards Agency funded study, more than 10 percent of all batches of oysters served in restaurants were associated with symptoms of norovirus food poisoning in the diners that consumed them."}, {"url": "http://www2c.cdc.gov/podcasts/media/pdf/EID_8-13_Raw_Oysters.pdf", "passage_text": "People with liver disease of any type, including alcoholic liver disease; a weakened immune system, such as from cancer treatment; diabetes, or iron overload disease, are at higher risk for severe disease and death from eating contaminated raw oysters. [Reginald Tucker] How do oysters become contaminated with Vibrio vulnificus bacteria? [Duc Vugia] Well, Vibrio bacteria exist naturally in marine waters and estuaries all over the world. Oysters and other shellfish are filter feeders, and they accumulate these bacteria as they filter water."}, {"url": "http://www.fda.gov/Food/ResourcesForYou/HealthEducators/ucm085368.htm", "passage_text": "Summer is here-and so is the time for backyard BBQ's, warm days at the beach and delicious delicacies from the sea. With the great weather comes enjoyment of a particularly favorite summer food, especially popular among Hispanic families -- raw oysters. You can't tell if an oyster is contaminated by Vibrio vulnificus by looking at it or by smelling it, said [ Name of Your Expert, Name of the Agency ] spokesperson. Nor does the freshness of the oyster mean it is safe from bacteria because it is present in the water where live oysters feed.."}, {"url": "http://www.cornishshellfish.co.uk/oysters/food-safety-and-oysters/", "passage_text": "How oysters become contaminated with norovirus. Oysters feed by filtering phytoplankton (natural microscopic plant cells) from the seawater they live in. They also filter bacteria and viruses if they are present in the seawater (which they usually are). 1 Food poisoning acquired from eating oysters infected with norovirus is still common. 2  In a recent Food Standards Agency funded study, more than 10 percent of all batches of oysters served in restaurants were associated with symptoms of norovirus food poisoning in the diners that consumed them."}, {"url": "http://www.fda.gov/Food/ResourcesForYou/HealthEducators/ucm085368.htm", "passage_text": "You can get seriously ill and even die from eating raw oysters contaminated with Vibrio vulnificus-a bacterium commonly found in waters where oysters are cultivated such as the Gulf of Mexico. You can't tell if an oyster is contaminated by Vibrio vulnificus by looking at it or by smelling it, said [ Name of Your Expert, Name of the Agency ] spokesperson. Nor does the freshness of the oyster mean it is safe from bacteria because it is present in the water where live oysters feed.."}, {"url": "http://www.cdc.gov/norovirus/food-handlers/work-with-food.html", "passage_text": "Norovirus is the leading cause of illness and outbreaks from contaminated food in the United States. The virus can easily contaminate food because it is very tiny and infective. It only takes a very small amount of virus particles (as few as 18) to make someone sick. "}, {"url": "https://en.wikipedia.org/wiki/Norovirus", "passage_text": "After infection, immunity to norovirus is usually incomplete and temporary, with one publication drawing the conclusion that protective immunity to the same strain of norovirus lasts for six months, but that all such immunity is gone after two years. Norovirus infection is characterized by nausea, projectile vomiting, watery diarrhea, abdominal pain, and in some cases, loss of taste. General lethargy, weakness, muscle aches, headache, and low-grade fever may occur."}, {"url": "http://www.cdc.gov/mmwr/preview/mmwrhtml/00031498.htm", "passage_text": "Although infection with the oysterborne Norwalk-like virus caused no fatalities in this outbreak, raw oyster consumption has been linked in Florida to 30 fatal cases of infection with Vibrio vulnificus during 1981-1992 among persons with preexisting liver disease (6). "}, {"url": "http://www.cornishshellfish.co.uk/oysters/food-safety-and-oysters/", "passage_text": "BACKGROUND TO NOROVIRUS IN OYSTERS. First a few facts about norovirus and oysters. 1  Recent Food Standards Agency research has shown that 75% of oysters carry Norovirus. 2  See this item from the Food Standards Agency. 3  Food poisoning acquired from eating oysters infected with norovirus is still common. 1 Food poisoning acquired from eating oysters infected with norovirus is still common. 2  In a recent Food Standards Agency funded study, more than 10 percent of all batches of oysters served in restaurants were associated with symptoms of norovirus food poisoning in the diners that consumed them."}, {"url": "http://www2c.cdc.gov/podcasts/media/pdf/EID_8-13_Raw_Oysters.pdf", "passage_text": "Eating raw oysters is dangerous for certain groups of people because some raw oysters contain bacteria or viruses that can cause disease. A bacterium called Vibrio vulnificus that is in some oysters can cause severe illness and death in people with certain underlying medical conditions. [Reginald Tucker] How do oysters become contaminated with Vibrio vulnificus bacteria? [Duc Vugia] Well, Vibrio bacteria exist naturally in marine waters and estuaries all over the world. Oysters and other shellfish are filter feeders, and they accumulate these bacteria as they filter water."}]