[{"url": "http://www.animalgenetics.com/newsite3/Reptile/cryptosporidiumreptile.html", "passage_text": "Cryptosporidium is a small parasite, measuring about 3-5 micrometers in size. Members of the genus Cryptosporidium are parasites of the intestinal tracts of fishes, reptiles, birds, and mammals. A number of researchers believe that to date 23 species of Cryptosporidium have been named, based on host occurrence."}, {"url": "http://www.animalgenetics.com/newsite3/Reptile/cryptosporidiumreptile.html", "passage_text": "Crypto lives in the intestine of infected humans, birds, fish, reptiles and other animals. Millions of Crypto can be released in a single bowel movement from an infected specimen. Infections occur after oral consumption of the parasite."}, {"url": "http://www.animalgenetics.eu/Reptile/cryptosporidiumreptile.html", "passage_text": "Transmission: Crypto lives in the intestine of infected humans, birds, fish, reptiles and other animals. Millions of Crypto can be released in a single bowel movement from an infected specimen."}, {"url": "http://www.animalgenetics.eu/Reptile/cryptosporidiumreptile.html", "passage_text": "Members of the genus Cryptosporidium are parasites of the intestinal tracts of fishes, reptiles, birds, and mammals. A number of researchers believe that to date 23 species of Cryptosporidium have been named, based on host occurrence."}, {"url": "http://www.cfsph.iastate.edu/Factsheets/pdfs/cryptosporidiosis.pdf", "passage_text": "Other species of Cryptosporidium can affect birds and reptiles Incubation Period for Disease Control The mean incubation period in calves is approximately 4 days. Clinical Signs Cryptosporidiosis mainly occurs in very young animals."}, {"url": "http://www.anapsid.org/cryptosporidium.html", "passage_text": "Humans and captive animals can become infected when drinking contaminated water (and the majority of municipal water supplies do not eradicate or kill Cryptosporidium, nor do most water purification devices people attached to their faucets or main water lines)."}, {"url": "http://www.leopardgeckowiki.com/index.php?title=Crypto", "passage_text": "The strains of crypto that infect reptiles are Cryptosporidium serpentis, and Cryptosporidium saurophilum. Unlike some myths claim, these strains are not zoonotic, or transmissible to humans or other mammals. Most reptiles are considered susceptible to Cryptosporidiosis, especially snakes."}]