[{"url": "http://www.ffofr.org/education/lectures/complete-dentures/occlusal-schemes-lingualized-occlusion/", "passage_text": "Complete Dentures Occlusal Schemes-Lingualized Occlusion. Lingualized occlusion (cusp to fossae) develops a mortar and pestle occlusal configuration. This arrangement enables excellent penetration of the food bolus. Bilateral balance is primarily accomplished by the maxillary lingual cusps maintaining contact during excursions with the inclines and central fossae of the mandibular cusps. This program illustrates in great detail the positioning of the posterior denture teeth so as to create bilateral balanced occlusion."}, {"url": "http://nitte.edu.in/journal/june2013/nsarovo.pdf", "passage_text": "Balanced occlusion in dentures implies occlusal contacts that contribute to equilibrium of the denture bases on their respective ridges. The search for the ideal occlusal scheme, one which provides stability, comfort, function and esthetics is still underway. Numerous concepts, techniques and philosophies have been documented concerning about complete denture occlusal schemes. There are several schools of thoughts on occlusal schemes in complet e den and some clinician believ e ther should be cusps on the teeth and must in omple te harmony with the soma ognathic y em."}, {"url": "http://nitte.edu.in/journal/june2013/nsarovo.pdf", "passage_text": "The key words used for the search were occlusal schemes, neutrocentric occlusion, lingualized occlusion, balanced occlusion, monoplane occlusion. Numerous concepts, techniques and philosophies have been documented concerning about complete denture occlusal schemes. There are several schools of thoughts on occlusal schemes in complet e den and some clinician believ e ther should be cusps on the teeth and must in omple te harmony with the soma ognathic y em. Some believ e that cuspless teeth crea minimum horizon al force o unseat denture"}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/17615993", "passage_text": "With dentures, the quantity and the intensity of these contacts determine the amount and the direction of the forces that are transmitted through the bases of the denture to the residual ridges. That is why the occlusal scheme is an important factor in the design of complete dentures. Three occlusal schemes are viewed in this review: bilateral balanced occlusion, monplane occlusion, and linear occlusion scheme. Each scheme represents a different concept of occlusion. The multiple characteristics of the occlusal schemes were reviewed in this article. Considering all of those factors in relation to a specific patient, the dentist should be able to decide on the most suitable occlusal scheme for the case."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/17615993", "passage_text": "Occlusal scheme is defined as the form and the arrangement of the occlusal contacts in natural and artificial dentition. The choice of an occlusal scheme will determine the pattern of occlusal contacts between opposing teeth during centric relation and functional movement of the mandible. The multiple characteristics of the occlusal schemes were reviewed in this article. Considering all of those factors in relation to a specific patient, the dentist should be able to decide on the most suitable occlusal scheme for the case."}, {"url": "http://www.ffofr.org/education/lectures/complete-dentures/occlusal-schemes-monoplane-neutrocentric-concept/", "passage_text": "There is no vertical overlap of the anterior teeth with this occlusal scheme although the lateral incisors may be elevated to enhance the esthetic display. This program describes and illustrates this philosophy of complete denture occlusion. 1 2. 2  This concept of occlusion assumes that the anterior-posterior plane of occlusion should be parallel to the denture foundation area and not dictated by condylar inclination. 3  The plane of occlusion is completely flat and level."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/23342330", "passage_text": "Occlusal schemes for complete dentures: a systematic review. Abduo J(1). Author information: (1)University of Western Australia, Crawley, Australia. jaafar_abduo@hotmail.com. PURPOSE: The aim of this study was to qualitatively review the literature regarding occlusal schemes for complete dentures. "}, {"url": "http://www.neuronarc.com/lingualized-occlusal-scheme.html", "passage_text": "Lingualized Occlusal Scheme. Lingualized occlusion is a type of bilaterally balanced occlusal schemes. The philosophy of a balanced occlusal scheme is to improve denture stability by maintaining contacts on both sides of the denture in excursions during function. Patients feel more confident and have less discomfort when dentures are more stable. Tags: Lingualized Occlusal Scheme, lingualized occlusal scheme advantages, lingualized occlusal scheme contraindications, lingualized occlusal scheme definition, lingualized occlusal scheme disadvantages, lingualized occlusal scheme factors."}, {"url": "http://www.ffofr.org/education/lectures/complete-dentures/occlusal-schemes-monoplane-neutrocentric-concept/", "passage_text": "Complete Dentures Occlusal Schemes-Monoplane-Neutrocentric Concept. Several clinicians have employed monoplane posterior teeth with all the anterior and posterior teeth on the same flat plane. 1 2. 2  This concept of occlusion assumes that the anterior-posterior plane of occlusion should be parallel to the denture foundation area and not dictated by condylar inclination. 3  The plane of occlusion is completely flat and level."}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=79975", "passage_text": "occlusal scheme. Synonyms: occlusal system. The definition information for occlusal scheme is provided by Stedman's. You can search our medical dictionary here."}]