[{"url": "http://alpha.fdu.edu/psychology/test_score_descriptions.htm", "passage_text": "A standard score of 100 would also be at the 50 th percentile rank. The middle half of these standard scores falls between 90 and 110. Wechsler SCALED SCORES have an average (mean) of 10 and a standard deviation of 3. A scaled score of 11 would also be at the 63 rd percentile rank and in Stanine 6. The middle half of these standard scores falls between 8 and 12. T-SCORES have an average (mean) of 50 and a standard deviation of 10. A T-score of 53 would be at the 62 nd percentile rank, Stanine 6. The middle half of T-scores falls between approximately 43 and 57. Wechsler STANDARD SCORES have an average (mean) of 100 and a standard deviation of 15"}, {"url": "http://www.springer-ld.org/blog/mmulcahey/09/20/2013", "passage_text": "As a standard score gives a position in relationship to a reference group, the score by itself is meaningless without knowing the position of the student when compared to all students who took the same test. A standard score of 90, the beginning of the average range, corresponds to a percentile rank of 25. A standard score of 110, the uppermost end of average, has a percentile range of 75. So a child at the 30 th percentile on a test of reading or math is performing within the region of what would be considered “average.”. With percentile ranks and standard scores, the comparison group matters. "}, {"url": "http://schoolpsychologistfiles.com/testscores/", "passage_text": "T scores have a mean of 50 with a standard deviation of 10. This means a score that falls at 50 or within 10 points above or below 50 is considered average, and typical of the population. The farther away from 50 a score falls, the more atypical it is. Each test tends to use their own classifications and ranges. Three percent of the population will fall in this range. On the other end three percent of the population is estimated to fall in the gifted or Superior range (130 and above). Scores between 120-129 are considered Above Average."}, {"url": "https://en.wikipedia.org/wiki/IQ_classification", "passage_text": "IQ classification is the practice by IQ test publishers of labeling IQ score ranges with (somewhat subjective) category names such as superior or average. There are several publishers of tests of cognitive abilities. An IQ score of 115 means performance one standard deviation above the median, a score of 85 performance one standard deviation below the median, and so on. Lewis Terman and other early developers of IQ tests noticed that most child IQ scores come out to approximately the same number by either procedure."}, {"url": "http://davidjcarey.com/Wechsler_Intelligence_Scale_for_Children.html", "passage_text": "The Verbal Scale, Performance Scale, and Full Scale scores are all Standard Scores. Previously I stated that standard scores all have 100 as their average, with the range of average being from 90 to 110. About two-thirds of all children will score between 85 and 115 on these three scales and scores within this range are not highly significant. Standard scores are also frequently reported following assessment. The average standard score is 100, which is at the 50th percentile, meaning the child's score isn't significantly different in that test than other, same-age children."}, {"url": "http://schoolpsychologistfiles.com/testscores/", "passage_text": "The scores are typically described in Standard Scores. Standard Scores have a mean (average) of 100. Anything within 10 points from 100 is considered Average. Scores from about 90-110 are considered average. Three percent of the population will fall in this range. On the other end three percent of the population is estimated to fall in the gifted or Superior range (130 and above). Scores between 120-129 are considered Above Average."}, {"url": "http://www.fcsuvt.org/assets/files/web-docs/Special%20Education/Special%20Educator%20Resources/Assessment/Classification%20Ranges%20of%20Normed%20Assessments.doc", "passage_text": "WJIII. Standard Score Range Percentile Rank Range WJIII Classification 131 and above 98-99.9 Very Superior 121-130 92-97 Superior 111-120 76-91 High Average 90-110 25-75 Average 80-89 9-24 Low Average 70-79 3-8 Low 69 and below 0.1-2 Very Low. DAB-3, GORT-4, TORC-3, TOWRE. Standard Score Range Classification Subtest Scaled Score 130 and above Well-above Average 16 and above 115-129 Above Average 13-15 86-114 Average 8-12 71-85 Below Average 3-7 70 or below Well-below Average 2 or below KeyMath-3."}, {"url": "https://en.wikipedia.org/wiki/Standard_score", "passage_text": "In statistics, the standard score is the (signed) number of standard deviations an observation or datum is above the mean. Thus, a positive standard score indicates a datum above the mean, while a negative standard score indicates a datum below the mean."}]