[{"url": "http://www.rics.org/us/knowledge/glossary/building-surveying/", "passage_text": "Other examples of the area of expertise that building surveyors can specialise in are building defects, building regulations, construction contracts, dilapidations health and safety, and project management. The Chartered Building Surveyor-an international perspective download showcases the work of building surveyors around the world. RICS and building surveying. Building surveyors, like all surveyors, inspect property or land."}, {"url": "http://www.mckenzie-group.com.au/faq/what-does-a-building-surveyor-do/", "passage_text": "Get in Touch. A. Building surveyors and building inspectors are responsible for making sure that buildings are safe, energy efficient and livable. They interact with other professionals such as engineers, architects and builders to ensure that buildings are designed and constructed to comply with building regulations. "}, {"url": "https://en.wikipedia.org/wiki/Surveying", "passage_text": "Surveying or land surveying is the technique, profession, and science of determining the terrestrial or three-dimensional position of points and the distances and angles between them. A land surveying professional is called a land surveyor. Traversing is a common method of surveying smaller areas. The surveyor starts from an old reference mark or known position and places a network of reference marks covering the survey area. They then measure bearings and distances between the reference marks, and to the target features."}, {"url": "https://en.wikipedia.org/wiki/Chartered_Building_Surveyor", "passage_text": "A chartered building surveyor as opposed to a building surveyor is someone that has gone through their Assessment of Professional Competence (APC) with the Royal Institution of Chartered Surveyors (RICS). The CIOB is a full member of the Construction Industry Council and also recognise building surveyors. A building surveyor can progress through the CIOB membership route also. Building surveyors work in most real estate markets including residential, commercial, retail, industrial, leisure, education and health."}, {"url": "http://www.rics.org/us/knowledge/glossary/building-surveying/", "passage_text": "Building surveying. An introduction to building surveying. Building surveyors are involved in the design, construction and management of real estate assets. You may have engaged a building surveyor when you arranged to have a property surveyed for an extension to your home or with a view to purchasing a property. The Chartered Building Surveyor-an international perspective download showcases the work of building surveyors around the world. RICS and building surveying. Building surveyors, like all surveyors, inspect property or land."}, {"url": "http://www.project-resource.co.uk/professions/building-surveyor", "passage_text": "A Building Surveyor is a construction professional who provides professional advice on property and construction including alterations, refurbishment, renovations, building defects and extensions. Building Surveyors are also required to assess and report on defects and ways to improve a building project. A Building Surveyor is an important role in any part of the construction process and to be successful in this role a range of skills are required, including:"}, {"url": "https://en.wikipedia.org/wiki/Chartered_Building_Surveyor", "passage_text": "Chartered Building Surveyors is a type of Chartered Surveyor involved in all aspects of property and construction, from supervising large mixed-use developments to planning domestic extensions. Building surveying is one of the widest areas of surveying practice. The CIOB is a full member of the Construction Industry Council and also recognise building surveyors. A building surveyor can progress through the CIOB membership route also. Building surveyors work in most real estate markets including residential, commercial, retail, industrial, leisure, education and health."}, {"url": "http://www.wisegeek.com/what-is-a-building-surveyor.htm", "passage_text": "These 10 animal facts will amaze you. Building surveyors work onsite during the construction of new buildings, and they also help to maintain older buildings. The main task of a building surveyor is to advise construction workers on design, maintenance, repair, structure, and restoration of a building. The professional advice provided by a building surveyor is used by contractors, investors, and construction crews alike. A large portion of a building surveyor's work involves advising others on the complexities of a structure. Surveyors may provide professional advice on crating an ecological structure, the many ways to preserve a historic building, pointing out health and safety concerns, and ways to make a building energy efficient."}, {"url": "http://www.greenstartconsulting.com.au/building-surveyor-definition", "passage_text": "A Building Surveyor is a trained professional working in the community’s best interest to make sure buildings are safe, accessible and energy efficient. "}]