[{"url": "http://www.ehow.com/facts_4905163_definition-undergraduate-degree.html", "passage_text": "The term degree when used in an educational context refers to a diploma granted by a college or university as a conclusion to a course of study of a specific length. Types. Undergraduate degrees are referred to as bachelor's degrees in a specific discipline and specialty; for example, a bachelor of arts (B.A.), bachelor of science (B.S.), bachelor of fine arts (B.F.A.) and bachelor of economics (B.E.)."}, {"url": "http://www.merriam-webster.com/dictionary/undergraduate", "passage_text": "Full Definition of UNDERGRADUATE. : a student at a college or university who has not received a first and especially a bachelor's degree. — undergraduate adjective. See undergraduate defined for English-language learners. See undergraduate defined for kids. "}, {"url": "https://en.wikipedia.org/wiki/Undergraduate_degree", "passage_text": "An undergraduate degree (also called first degree, bachelor's degree or simply degree) is a colloquial term for an academic degree taken by a person who has completed undergraduate courses. It is usually offered at an institution of higher education, such as a university. The most common type of this degree is the bachelor's degree, which typically takes at least three or four years to complete."}, {"url": "http://www.thefreedictionary.com/undergraduate", "passage_text": "un•der•grad•u•ate. 1. a college-level student who has not received a first, esp. a bachelor's, degree. 2. having the standing of an undergraduate. 3. pertaining to or characteristic of undergraduates. [1620–30]. Noun. 1. undergraduate-a university student who has not yet received a first degree. undergrad. co-ed, college girl-a female student at a coeducational college or university."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_an_undergraduate_and_a_graduate_degree", "passage_text": "An undergraduate degree is, basically, a Bachelor's degree. A graduate degree is one that requires you already have an undergraduate degree (in other words, that you are a g … raduate of a college) in order to even enter the program, such as a Masters or Doctorate. In the UK... In the UK, the descriptors as to what constitutes an Undergraduate / Bachelors Degree and a Graduate (Master's or Doctoral) degree is set by the Quality Assurance Agency for Higher Education (QAA) in their document The framework for higher education qualifications in England, Wales and Northern Ireland."}, {"url": "https://en.wikipedia.org/wiki/Undergraduate_degree", "passage_text": "However, in the United States, most first professional degrees are considered graduate programs by the U.S. Department of Education and require students to already possess an undergraduate degree before admission. It is usually offered at an institution of higher education, such as a university. The most common type of this degree is the bachelor's degree, which typically takes at least three or four years to complete."}, {"url": "http://www.thefreedictionary.com/undergraduate", "passage_text": "un·der·grad·u·ate. n. A college or university student who has not yet received a bachelor's or similar degree. adj. 1. Of, relating to, or characteristic of undergraduates: undergraduate courses; undergraduate humor. 2. Having the standing of an undergraduate: an undergraduate transfer student. Noun. 1. undergraduate-a university student who has not yet received a first degree. undergrad. co-ed, college girl-a female student at a coeducational college or university."}, {"url": "https://www.ice.cam.ac.uk/faqs/3-credit-faqs/140-what-do-undergraduate-and-postgraduate-mean", "passage_text": "Answer. An undergraduate student is a student who is studying for his/her first degree (usually entitled Bachelor of Arts [BA] or Bachelor of Science [BSc]). There are three levels of undergraduate study equating to first-year, second-year and third-year study"}, {"url": "http://www.ehow.com/facts_4905163_definition-undergraduate-degree.html", "passage_text": "An undergraduate degree (or baccalaureate/bachelor's degree) is one type of degree that you can achieve with college study, usually with a specific specialization in a particular area of academics. Other People Are Reading. Types. Undergraduate degrees are referred to as bachelor's degrees in a specific discipline and specialty; for example, a bachelor of arts (B.A.), bachelor of science (B.S.), bachelor of fine arts (B.F.A.) and bachelor of economics (B.E.)."}]