[{"url": "http://medical-dictionary.thefreedictionary.com/epicardium", "passage_text": "the outermost of the three layers of tissue that form the heart wall. It is composed of a single sheet of squamous epithelial cells overlying delicate connective tissue. The epicardium is the visceral portion of the serous pericardium and folds back on itself to form the parietal portion of the serous pericardium. Compare myocardium. See also pericardium. epicardial, adj"}, {"url": "http://www.answers.com/Q/What_is_visceral_pericardium_also_called", "passage_text": "Yes, the visceral pericardium adheres to the outside surface of the myocardium (heart muscle), while the parietal pericardium lies outside of the visceral pericardium. There i … s a small amount of lubricating fluid between these two membranes in the potential space known as the pericardial space. The pericardium is a sac of fibrous tissue that surrounds the heart and the roots of the large blood vessels. Visceral pericardium is the inner layer of the pericardium sac."}, {"url": "http://teachmeanatomy.info/thorax/organs/heart/pericardium/", "passage_text": "Serous Pericardium. Enclosed within the fibrous pericardium, the serous pericardium is itself divided into two layers – the outer parietal layer which lines the internal surface of the fibrous pericardium and the internal visceral layer which forms the outer layer of the heart (also known as the epicardium). The pericardium is made up of two main layers – a tough external layer known as the fibrous pericardium, and a thin, internal layer known as the serous pericardium (to overextend the orange metaphor, the outer peel could be thought of as the fibrous layer, with the inner white stuff being the serous layer)."}, {"url": "http://www.dartmouth.edu/~humananatomy/part_4/chapter_23.html", "passage_text": "The serous pericardium (fig. 23-1) is a closed sac, the parietal layer of which lines the inner surface of the fibrous pericardium and is reflected onto the heart as the visceral layer, or epicardium. "}, {"url": "http://www.answers.com/Q/How_does_the_visceral_pericardium_differ_from_parietal_pericardium", "passage_text": "Most people think of the pericardium as just a double-layered, membranous sac (The Pericardial Cavity) that is around the heart. But, the pericardium is actually TRIPLE layered: the visceral layer, the parietal layer, and the fibrous layer (fibrosa). The visceral pericardium is the inner-most layer of the pericardium, and is also known as the Epicardium as it lays upon the heart. The Pericardial Cavity lies between the visceral pericardium and the parietal pericardium. "}, {"url": "http://www.answers.com/Q/What_is_visceral_pericardium_also_called", "passage_text": "The visceral pericardium is the inner-most layer of the pericardium, and is also known as the Epicardium as it lays upon the heart. The Pericardial Cavity lies between the visceral pericardium and the parietal pericardium. The pericardium is a sac of fibrous tissue that surrounds the heart and the roots of the large blood vessels. Visceral pericardium is the inner layer of the pericardium sac."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=9134", "passage_text": "The outer layer of the pericardium is called the parietal pericardium. The inner part of the pericardium that closely envelops the heart is, as stated, the epicardium; it is also called the visceral pericardium. Epicardium: The inner layer of the pericardium, a conical sac of fibrous tissue that surrounds the heart and the roots of the great blood vessels. The pericardium has outer and inner coats."}, {"url": "http://medical-dictionary.thefreedictionary.com/visceral+pericardium", "passage_text": "serous pericardium the inner, serous portion of pericardium, consisting of two layers, visceral and parietal; the space between the layers is the pericardial cavity. visceral pericardium the inner layer of the serous pericardium, which is in contact with the heart and roots of the great vessels. parietal pericardium. the parietal layer of the serous pericardium, which is in contact with the fibrous pericardium. serous pericardium. the inner, serous portion of pericardium, consisting of two layers, visceral and parietal; the space between the layers is the pericardial cavity. visceral pericardium. the inner layer of the serous pericardium, which is intimately attached to the heart and roots of the great vessels. Called also epicardium"}]