[{"url": "http://www.timeanddate.com/calendar/mayan.html", "passage_text": "The calendar dates back to at least the 5th century BC and is still in use in a few Mayan communities today. The Mayan calendar moves in cycles with the last cycle ending in December 2012. This has often been interpreted as the world will end on 21 December 2012, at 11:11 UTC."}, {"url": "http://mayanarchaeology.tripod.com/id2.html", "passage_text": "They really began to show advancement around A.D. 250 in Southern Mexico, through all of Guatemala, present day western Belize, and northwestern Honduras. The Mayan civilization was exactly that, a civilization, or a culture."}, {"url": "http://www.aztec-history.com/mayan-civilization.html", "passage_text": "Much of Maya history is shrouded in mystery. It is believed today that the Mayan peoples began to settle in the Yucatan area of what is now Mexico between 2600 BC and 1800 BC."}, {"url": "http://mayanarchaeology.tripod.com/id2.html", "passage_text": "All of the Mayans did not disappear; although millions did vanish, all at once, about 1,200 years ago, in the ninth century AD. There are many, many Mayans living today, principally in Guatemala. There are approximately 5 million Mayans living today in Guatemala and southern Mexico."}, {"url": "http://www.history.com/topics/maya", "passage_text": "From the late eighth through the end of the ninth century, something unknown happened to shake the Maya civilization to its foundations. One by one, the Classic cities in the southern lowlands were abandoned, and by A.D. 900, Maya civilization in that region had collapsed."}, {"url": "http://www.aztec-history.com/mayan-civilization.html", "passage_text": "Origins of the ancient Mayan civilization. Much of Maya history is shrouded in mystery. It is believed today that the Mayan peoples began to settle in the Yucatan area of what is now Mexico between 2600 BC and 1800 BC. As the centuries rolled on, their culture and religion developed."}, {"url": "http://www.history.com/topics/maya", "passage_text": "Classic Maya civilization grew to some 40 cities, including Tikal, Uaxactun, Uaxactún, Copan, Copán Bonampak, Dos, Pilas calakmul Palenque And; rio río bec each city held a 5,000 of 50,000 5000. And 50000 people, at Its peak the maya population 2,000,000. have reached 2000000"}, {"url": "http://www.history.com/topics/maya", "passage_text": "The Classic Period, which began around A.D. 250, was the golden age of the Maya Empire. Classic Maya civilization grew to some 40 cities, including Tikal, Uaxactun, Uaxactún, Copan, Copán Bonampak, Dos, Pilas calakmul Palenque And; rio río bec each city held a 5,000 of 50,000 5000. and 50000 people"}, {"url": "http://www.timeanddate.com/calendar/mayan.html", "passage_text": "The Haab is a 365 day solar calendar which is divided into 18 months of 20 days each and one month which is only 5 days long (Uayeb) . The calendar has an outer ring of Mayan glyphs (pictures) which represent each of the 19 months. Each day is represented by a number in the month followed by the name of the month."}]