[{"url": "https://answers.yahoo.com/question/index?qid=20061019225551AA361te", "passage_text": "It depends. Saluki pups are very hard to place and if you are a good home for a Sighthound you may be able to get one for very little. However, if cost is your main concern, good luck. Go to some field trials to meet breeders. Best Answer: Probably you are looking in the $1,000 range, give or take. Find a breeder through the national clubs by going through www.akc.org. Do NOT simply find one on the internet unless you plan on going the breeder's facility to check it out"}, {"url": "https://answers.yahoo.com/question/index?qid=20061019225551AA361te", "passage_text": "Rating Newest Oldest. Best Answer: Probably you are looking in the $1,000 range, give or take. Find a breeder through the national clubs by going through www.akc.org. Do NOT simply find one on the internet unless you plan on going the breeder's facility to check it ou"}, {"url": "http://www.salukiclub.org/buying-a-saluki-puppy.html", "passage_text": "Listen carefully to them, heed what they tell you, and your life and the dog’s life will be much more enjoyable! 6 week old feathered saluki puppy. 6 week old feathered saluki puppy. Eight to twelve weeks is a good age at which to buy a puppy, who should come from a mother who is at least 2 years old. A pup at this age should be inquisitive, a little chubby-looking, and have a shiny coat and clear, bright eyes."}, {"url": "http://www.bidnessetc.com/business/7-of-the-most-expensive-dogs-in-the-world/", "passage_text": "As of 2012, German Shepherds are considered the second-most popular dog in the US, and can cost anywhere between $3,000 and $24,000. A dog training institute in Germany claims to train the best rescue dogs and sells them for $24,000. Published: Mar 27, 2014 at 10:44 am Est. A variety of factors make a breed expensive. Rare and purebred dogs tend to cost more than their mixed-breed counterparts. Predictably, a dog’s value increases immensely when it is owned by or seen in the possession of a celebrity. Better still, even the offspring of prize-winning dogs are valuable commodities"}, {"url": "http://www.answers.com/Q/FAQ/21896", "passage_text": "What do saluki pups cost? A quick search online shows they are a quite expensive dog. Looks like prices vary somewhat but I'd put the 'average' as about $1500. I found them as low as $600, as high as $2500. The Salukis is a breed of sight hound. They have long slender face similar to a greyhound. One of their most striking features is the long feathering on their hanging ears and tail. Their sleek athletic bodies make them look almost delicate. They are one of the oldest domesticated dog breeds."}, {"url": "http://www.haalahsalukis.com/?page_id=1796", "passage_text": "Yes it’s expensive to breed. There are many factors that are considered when pricing pups. Some litters can be less expensive, $1,000 or as high as $1800 – $2,000, depending on the situation. Sure, you can find less expensive salukis out there, to be sure. But mine are of the highest quality, well cared for and worth every penny I ask for them. This alone can run $2500 or more depending on the clinic. Yes, it’s happened. Feeding the Dam high quality food to keep her and the pups healthy is also expensive. Then comes the vet bills for removing the dew claws, checking out the pups and getting their first shots and health certificates."}]