[{"url": "http://www.merriam-webster.com/dictionary/gradient", "passage_text": "Full Definition of GRADIENT. 1. a: the rate of regular or graded ascent or descent: inclination b: a part sloping upward or downward. 2. Medical Definition of GRADIENT. 1. : change in the value of a quantity (as temperature, pressure, or concentration) with change in a given variable and especially per unit on a linear scale. 2."}, {"url": "http://www.businessdictionary.com/definition/gradient.html", "passage_text": "Steepness of a slope (incline or decline), commonly measured in one of the three ways: (1) The angle (called the 'slope angle') the line, path, or surface makes with the ground or horizontal (called ' grade line') expressed in degrees or grads. For example, a 5 degree gradient. (2) Ratio of the vertical distance to the actual distance along the slope (that is, sine of the slope angle). For example, a gradient of 1 in 4 means a vertical distance of 1 unit for 4 units along the slope, expressed as 1/4 grade or 25 percent grade. (3) Ratio of the vertical distance (elevation) to the horizontal distance (that is, tangent of the slope angle). "}, {"url": "https://en.wikipedia.org/wiki/Color_gradient", "passage_text": "An axial color gradient (sometimes also called a linear color gradient) is specified by two points, and a color at each point. The colors along the line through those points are calculated using linear interpolation, then extended perpendicular to that line. In computer graphics, a color gradient (sometimes called a color ramp or color progression) specifies a range of position-dependent colors, usually used to fill a region. For example, many window managers allow the screen background to be specified as a gradient."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/gradi.html", "passage_text": "The Gradient. The gradient is a vector operation which operates on a scalar function to produce a vector whose magnitude is the maximum rate of change of the function at the point of the gradient and which is pointed in the direction of that maximum rate of change. In rectangular coordinates the gradient of function f(x,y,z) is: If S is a surface of constant value for the function f(x,y,z) then the gradient on the surface defines a vector which is normal to the surface. ApplicationsConduction heat transfer."}, {"url": "http://www.answers.com/Q/What_is_a_gradient", "passage_text": "Gradient-The space rate of decrease of a function. The gradient of a function in three space dimensions is the vector normal to surfaces of constant value of the function and directed toward decreasing values, with magnitude equal to the rate of decrease of the function in this direction. The gradient of a straight line is the number of co-ordinates on the y axis to one co-ordinate on the x axis."}, {"url": "https://en.wikipedia.org/wiki/Gradient", "passage_text": "More precisely, the gradient points in the direction of the greatest rate of increase of the function and its magnitude is the slope of the graph in that direction. The components of the gradient in coordinates are the coefficients of the variables in the equation of the tangent space to the graph. The gradient of the function f(x,y) = −(cos2x + cos2y)2 depicted as a projected vector field on the bottom plane. The gradient (or gradient vector field) of a scalar function f (x 1, x 2, x 3, ..., xn) is denoted ∇ f or where ∇ (the nabla symbol) denotes the vector differential operator, del."}, {"url": "http://www.answers.com/Q/What_is_a_gradient", "passage_text": "Confidence votes 12.6K. In really simple terms (in common usage) the word gradient is used to describe how steep a hill is. However in more technical terms it is a mathematical term which describes the rate at which something changes (be it a slope, like our example of the hill above or more complex things). The gradient of a straight line is the number of co-ordinates on the y axis to one co-ordinate on the x axis."}, {"url": "http://www.merriam-webster.com/dictionary/gradient", "passage_text": "3. : the vector sum of the partial derivatives with respect to the three coordinate variables x, y, and z of a scalar quantity whose value varies from point to point. 4. : a graded difference in physiological activity along an axis (as of the body or an embryonic field). Medical Definition of GRADIENT. 1. : change in the value of a quantity (as temperature, pressure, or concentration) with change in a given variable and especially per unit on a linear scale. 2."}]