[{"url": "http://searchengineland.com/whats-searched-thing-google-turns-google-216096/", "passage_text": "Emphasizing the point of unexpected searches, he said “Google” is the most popular search topic the search engine handles. The most searched term on Google is “Google” itself."}, {"url": "http://www.thenewstrack.com/top-ten-most-searched-things-on-google-in-2015/", "passage_text": "You can find a lot of recipes on Google when you are cooking something new. Google is the platform where you can search for each and everything. It was founded in September 1998 in California. Below is a list of top 10 most searched things on Google in 2015."}, {"url": "http://www.thenewstrack.com/top-ten-most-searched-things-on-google-in-2015/", "passage_text": "It is ranked at 6th number in the list of top 10 most searched things on Google in 2015. Now a day’s mobile are not only for calls and messages but they are just like a mini laptop. People search for mobile games, ringing tones, movies and songs on Google."}, {"url": "http://www.appnet.com/top-50-searched-terms-recently-google/", "passage_text": "The TOP 50 Most Searched For Terms Recently on Google. Before anyone jumps on me, let me state that these are the most searched GLOBAL keywords during February 2014. …and NO, Kim didn’t make the cut. Neither did Kate Upton. Justin Bieber did."}, {"url": "http://www.thenewstrack.com/top-ten-most-searched-things-on-google-in-2015/", "passage_text": "Google is the place where a word you search for can give you thousand results. In this article, I will talk about top 10 most searched things on Google in 2015."}, {"url": "http://searchengineland.com/whats-searched-thing-google-turns-google-216096/", "passage_text": "Webmaster Trends Analyst Gary Illyes said the most searched term on Google is Google itself during SMX West session. Amy Gesenhues on March 5, 2015 at 10:20 am. Twin Design / Shutterstock.com. During yesterday’s “How to Secure Your Site for Google’s HTTPS Algorithm” SMX West session, Google Webmaster Trends Analyst Gary Illyes revealed that the most searched thing on Google is “Google” itself."}, {"url": "http://www.thenewstrack.com/top-ten-most-searched-things-on-google-in-2015/", "passage_text": "Yahoo is most searched messenger on the Google. Yahoo is not only a messenger, but it is a multinational company of Technology. It is a US company and is headquartered in an American state California. It is ranked at 2nd number in the list of top 10 most searched things on Google in 2015. The company was founded by Santa Clara in January 1994."}, {"url": "http://www.youtube.com/watch?v=Od_tKAscap8", "passage_text": "Here are the most searched people/things on Google 2015! Please like to encourage me to make more! For collaborations and business inquiries, please contact via Channel Pages: http://ChannelPages.com/lofangas."}]