[{"url": "http://www.payscale.com/research/US/Employer=CVS_%2f_Pharmacy/Hourly_Rate", "passage_text": "Pharmacies and Drug Stores. Also Known As: cvs pharmacy, CVS Pharmacy, Inc., Cvspharmacy. About: CVS Pharmacy (styled as CVS/pharmacy or simply CVS) is the second largest pharmacy chain in the United States (after Walgreens), with over 7,000 stores in 41 states and Puerto Rico. As the retail pharmacy division of CVS Caremark, it sells prescription drugs and a wide assortment of general merchandise, including…"}, {"url": "http://www1.salary.com/Pharmacy-Technician-I-hourly-wages.html", "passage_text": "For example the median expected annual pay for a typical Pharmacy Technician I in the United States is $15 an hour, so 50% of the people who perform the job of Pharmacy Technician I in the United States are expected to make less than $15. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. This chart describes the expected percentage of people who perform the job of Pharmacy Technician I that make less than that hourly rate. For example 50% of the people who perform the job of Pharmacy Technician I are expected to make less than the median. Source: HR Reported data as of October 2015."}, {"url": "https://answers.yahoo.com/question/index?qid=20130610201115AA1o3tX", "passage_text": "I had a friend who started out making $9.00/hr at CVS before she was certified. CVS paid for her to take a few classes and helped her pass the PTCB (pharmacy technician certification board). And they pushed her up to 10.25. She has now been working there for 4 yrs and makes $11.75."}, {"url": "http://learn.org/articles/Whats_the_Salary_of_a_Registered_Pharmacy_Technician.html", "passage_text": "Salary Based on State. According to May 2013 BLS figures, pharmacy technicians earning the highest mean wages worked in the District of Columbia ($42,910), Washington ($39,910), Alaska ($39,520), California ($39,570) and Hawaii ($36,810). According to the U.S. Bureau of Labor Statistics (BLS), in May 2013, pharmacy technicians received average annual salaries of $30,840 (www.bls.gov)."}, {"url": "http://learn.org/articles/Whats_the_Salary_of_a_Registered_Pharmacy_Technician.html", "passage_text": "Average Salary Overview. According to the U.S. Bureau of Labor Statistics (BLS), in May 2013, pharmacy technicians received average annual salaries of $30,840 (www.bls.gov). Additionally, PayScale.com reported that the total annual pay for pharmacy technicians ranged from $17,756-$37,131 in September 2014. According to the U.S. Bureau of Labor Statistics (BLS), in May 2013, pharmacy technicians received average annual salaries of $30,840 (www.bls.gov)"}, {"url": "http://www.payscale.com/research/US/Job=Pharmacy_Technician/Hourly_Rate", "passage_text": "Pharmacy Technician Salary. (United States). A Pharmacy Technician earns an average wage of $12.14 per hour. The skills that increase pay for this job the most are Long Term Care and Systems Computer/Console Operations. People in this job generally don't have more than 20 years' experience. Pay by Experience Level for Pharmacy Technician. Median of all compensation (including tips, bonus, and overtime) by years of"}, {"url": "http://theepharmacytechnicians.com/pharmacy-technician-salary/", "passage_text": "The downside to this situation is that the rate of pay is likely to be near minimum wage. The hourly rate for a beginning pharmacy technician with no training or experience will typically range from $7.50 to $8.50 per hour. These positions are usually found in retail, privately owned, and mail order pharmacies. Most entry level pharmacy technician jobs offer a small yearly raise and paid vacation. In 2008, the median wage for pharmacy technicians nationwide was $13.32 per hour. Fifty percent of pharmacy technicians made between $11.00 and $15.00 per hour. The bottom 10% was paid less than $9.00 per hour. The highest earners made $18.00 per hour or more."}]