[{"url": "http://www.merriam-webster.com/dictionary/motor%20neuron", "passage_text": "Definition of MOTOR NEURON. : a neuron that passes from the central nervous system or a ganglion toward a muscle and conducts an impulse that causes movement —called also motoneuron. See motor neuron defined for kids. ADVERTISEMENT. noun"}, {"url": "https://en.wikipedia.org/wiki/Motor_neuron", "passage_text": "A motor neuron (or motoneuron) is a nerve cell (neuron) whose cell body is located in the spinal cord and whose fiber (axon) projects outside the spinal cord to directly or indirectly control effector organs, mainly muscles and glands. Special visceral motor neurons, also called branchial motor neurons, which directly innervate branchial muscles (that motorize the gills in fish and the face and neck in land vertebrates)."}, {"url": "http://www.merriam-webster.com/dictionary/motor%20neuron", "passage_text": "motor neuron. noun. : a neuron that passes from the central nervous system or a ganglion toward or to a muscle and conducts an impulse that causes movement—called also motoneuron; compare interneuron, sensory neuron. Britannica.com: Encyclopedia article about motor neuron. : a neuron that passes from the central nervous system or a ganglion toward a muscle and conducts an impulse that causes movement —called also motoneuron. See motor neuron defined for kids. ADVERTISEMENT."}, {"url": "http://www.thefreedictionary.com/motor+neuron", "passage_text": "Noun. 1. motor neuron-a neuron conducting impulses outwards from the brain or spinal cord. efferent neuron, motoneuron, motor nerve fiber. nerve cell, neuron-a cell that is specialized to conduct nerve impulses. efferent, efferent nerve, motor nerve-a nerve that conveys impulses toward or to muscles or glands."}, {"url": "http://medical-dictionary.thefreedictionary.com/motor+neuron", "passage_text": "motor neuron, one of various efferent nerve cells that transmit nerve impulses from the brain or from the spinal cord to muscular or glandular tissue. According to location, some kinds of motor neurons are the peripheral motor neurons and the upper motor neurons. Also called motoneuron. Compare sensory nerve. The dendrites receive stimuli from other nerves or from a receptor organ, such as the skin or ear, and transmit them through the neuron to the axon. The axon conducts the impulses to the dendrite of another neuron or to an effector organ that is thereby stimulated to action."}, {"url": "http://courses.washington.edu/conj/motor/motorunit.htm", "passage_text": "Definition of Motor Unit. A motor unit consists of one somatic efferent (motor) neuron and all of the muscle fibers (cells) that it innervates. In the figure to the right, two motor units are illustrated diagrammatically. Notice that after an efferent axon enters the muscle, it branches and forms synapses with a number of muscle fibers"}, {"url": "https://en.wikipedia.org/wiki/Motor_neuron", "passage_text": "There are upper motor neurons and lower motor neurons, with the cell type described above being a lower motor neuron. Upper motor neurons are cortico-spinal interneurons that arise from the motor cortex and descend to the spinal cord where they activate the lower motor neurons through synapses. Special visceral motor neurons, also called branchial motor neurons, which directly innervate branchial muscles (that motorize the gills in fish and the face and neck in land vertebrates)."}, {"url": "https://en.wikipedia.org/wiki/Motor_neuron", "passage_text": "Motor neurons' axons are efferent nerve fibers that carry signals from the spinal cord to the effectors to produce effects. Types of motor neurons are alpha motor neurons, beta motor neurons, and gamma motor neurons. Special visceral motor neurons, also called branchial motor neurons, which directly innervate branchial muscles (that motorize the gills in fish and the face and neck in land vertebrates)."}]