[{"url": "http://www.historynet.com/seneca-falls-convention", "passage_text": "Seneca Falls Convention summary: The Seneca Falls Convention was the first women’s rights convention in the United States. It was organized by a handful of women who were active in the abolition and temperance movements and held July 19–20, 1848, in Seneca Falls, New York. Seneca Falls Convention: First Women’s Rights Convention. The announcement of an upcoming ‘Woman’s Rights Convention’ in the Seneca County Courier was small, but it attracted Charlotte Woodward’s attention."}, {"url": "http://study.com/academy/lesson/seneca-falls-convention-of-1848-definition-summary-significance.html", "passage_text": "The American women's rights movement began with a meeting of reformers in Seneca Falls, New York, in 1848. Out of that first convention came a historic document, the 'Declaration of Sentiments,' which demanded equal social status and legal rights for women, including the right to vote. Summary. The Seneca Falls convention lasted two days, July 19 and 20, 1848. The first day of the convention was set aside for women speakers only, although several men attended the meeting. Elizabeth Cady Stanton read a draft of the 'Declaration of Sentiments' and the women discussed and made changes to the resolutions"}, {"url": "http://www.answers.com/Q/What_was_the_purpose_of_the_Seneca_Falls_convention", "passage_text": "The purpose of the Seneca Falls Convention was to use the Declaration of Independence to claim Womens Rights. Took place in Seneca Falls, New York, in July 1848, 3. The meeting spanned two days and six sessions 4. The idea for th … e convention occurred in London in 1840 5. Were denied the opportunity to speak from the floor or to be seated as delegates 6."}, {"url": "http://www.infoplease.com/ipa/A0875901.html", "passage_text": "The Declaration of Sentiments and Resolutions was drafted by Elizabeth Cady Stanton for the women's rights convention at Seneca Falls, New York in 1848. Based on the American Declaration of Independence, the Sentiments demanded equality with men before the law, in education and employment. "}, {"url": "https://quizlet.com/4276214/seneca-falls-convention-flash-cards/", "passage_text": "Seneca Falls Convention. The meeting took place in Seneca Falls, New York on July 19th and 20th 1848. 300 Women and 40 men went to the second day to discuss the rights of women. They wrote the Declaration of Sentiments, which among other things, tried to get women the right to vote. "}, {"url": "http://www.encyclopedia.com/topic/Seneca_Falls_Convention_1848.aspx", "passage_text": "SENECA FALLS CONVENTION. The Seneca Falls Convention, which took place in Seneca Falls, New York, in July 1848, was the first national women's rights convention and a pivotal event in the continuing story of U.S. and women's rights. SENECA FALLS CONVENTION. SENECA FALLS CONVENTION was the first public gathering in the United States called explicitly for the purpose of debating the issue of"}, {"url": "http://www.encyclopedia.com/topic/Seneca_Falls_Convention_1848.aspx", "passage_text": "Seneca Falls Convention (1848) Women's rights convention held at Seneca Falls, New York. Elizabeth Stanton and Lucretia Mott organized the convention, the first aimed at obtaining equal rights for women. About 300 people attended, and a “Declaration of Sentiments” was issued. SENECA FALLS CONVENTION. SENECA FALLS CONVENTION was the first public gathering in the United States called explicitly for the purpose of debating the issue of women's rights."}, {"url": "http://www.historynet.com/seneca-falls-convention", "passage_text": "Picture of the Day: July 19 Elizabeth Cady Stanton & the Seneca Falls Convention Elizabeth Cady Stanton made her first public speech at the Woman’s Rights Convention in Seneca Falls, New York, on July 19, 1848. Seneca Falls Convention: First Women’s Rights Convention. The announcement of an upcoming ‘Woman’s Rights Convention’ in the Seneca County Courier was small, but it attracted Charlotte Woodward’s attention."}, {"url": "https://en.wikipedia.org/wiki/Seneca_Falls_Convention", "passage_text": "The Seneca Falls Convention was the first women's rights convention. It advertised itself as a convention to discuss the social, civil, and religious condition and rights of woman. 1 The Road to Seneca Falls: Elizabeth Cady Stanton and the First Women's Rights Convention, University of Illinois Press, 2004."}]