[{"url": "https://simple.wikipedia.org/wiki/Centrosome", "passage_text": "In cell biology, the centrosome is an organelle that is the main place where cell microtubules get organised. They occur only in animal cells. Also, it regulates the cell division cycle, the stages which lead up to cell division. "}, {"url": "http://www.answers.com/Q/What_is_a_centrosome", "passage_text": "The real answer is the centrosome is an area in the cell where microtubules are produced. Microtubules carry out a variety of functions, ranging from transportation to structu … ral support. During cell division, the centrosome divides, and both parts move to opposite sides of the cell. A centrosome is where microtubules are organised in a cell and can  be thought of as the centre of a spiders web with all the threads  coming out from it. It provide support … for the microtubules and is  responsible for their breakdown and construction."}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/C/Centrioles.html", "passage_text": "The Centrosome. 1  is located in the cytoplasm usually close to the nucleus. 2  It consists of two centrioles — oriented at right angles to each other — embedded in a mass of amorphous material containing more than 100 different proteins. 3  It is duplicated during S phase of the cell cycle. 1 Some attach to one kinetochore of a dyad with those growing from the opposite centrosome binding to the other kinetochore of that dyad. 2  Some bind to the arms of the chromosomes. 3  Still others continue growing from the two centrosomes until they extend between each other in a region of overlap."}, {"url": "http://micro.magnet.fsu.edu/cells/centrioles/centrioles.html", "passage_text": "Within the centrosome, the centrioles are positioned so that they are at right angles to each other, as illustrated in Figure 1. Each centriole is made of nine bundles of microtubules (three per bundle) arranged in a ring. Centrioles play a notable role in cell division. During interphase of an animal cell, the centrioles and other components of the centrosome are duplicated, though scientists are not yet sure how this duplication takes place."}, {"url": "http://www.definitions.net/definition/centrosome", "passage_text": "Centrosome. In cell biology, the centrosome is an organelle that serves as the main microtubule organizing center of the animal cell as well as a regulator of cell-cycle progression. It was discovered by Edouard Van Beneden in 1883 and was described and named in 1888 by Theodor Boveri."}, {"url": "http://www.answers.com/Q/What_is_a_centrosome", "passage_text": "Answer by Tombo H. Confidence votes 1.7K. The centrosome is a place inside the cell where microtubles are formed. inside the cell centrosome there are centrioles wich are made up of a ring of nine microtubules. these centrioles are only found inside animal cells. A centrosome is where microtubules are organised in a cell and can  be thought of as the centre of a spiders web with all the threads  coming out from it. It provide support … for the microtubules and is  responsible for their breakdown and construction."}, {"url": "http://www.answers.com/Q/What_does_the_centrosome_do_in_an_animal_cell", "passage_text": "The centrosome is a place inside the cell where microtubles are formed. inside the cell centrosome there are centrioles wich are made up of a ring of nine microtubules. these … centrioles are only found inside animal cells. The centrosome is an organelle which serves as the main Microtubule Organizing Centre of the animal cell as well as a regulator of cell cycle progression. 2 people found this useful."}, {"url": "https://en.wikipedia.org/wiki/Centrosome", "passage_text": "Role of the centrosome in cell cycle progression. Centrosomes are associated with the nuclear membrane during prophase of the cell cycle. In mitosis the nuclear membrane breaks down and the centrosome nucleated microtubules (parts of the cytoskeleton) can interact with the chromosomes to build the mitotic spindle. The centrosome replicates during the S phase of the cell cycle. During the prophase in the process of cell division called mitosis, the centrosomes migrate to opposite poles of the cell. The mitotic spindle then forms between the two centrosomes. Upon division, each daughter cell receives one centrosome. Aberrant numbers of centrosomes in a cell have been associated with cancer"}]