[{"url": "http://www.webmd.com/diet/guide/vitamin-d-deficiency", "passage_text": "Vitamin D deficiency can occur for a number of reasons: You don't consume the recommended levels of the vitamin over time. This is likely if you follow a strict vegan diet, because most of the natural sources are animal-based, including fish and fish oils, egg yolks, cheese, fortified milk, and beef liver. Symptoms of bone pain and muscle weakness can mean you have a vitamin D deficiency. However, for many people, the symptoms are subtle. Yet, even without symptoms, too little vitamin D can pose health risks."}, {"url": "http://www.webmd.com/food-recipes/guide/vitamin-b12-deficiency-symptoms-causes", "passage_text": "You can also get vitamin B12 deficiency if you're a vegan (meaning you don't eat any animal products, including meat, milk, cheese, and eggs) or a vegetarian who doesn't eat enough eggs or dairy products to meet your vitamin B12 needs. Many people don’t, and that deficiency can cause some serious problems. Vitamin B12 does a lot of things for your body."}, {"url": "http://articles.mercola.com/sites/articles/archive/2014/05/28/vitamin-d-deficiency-signs-symptoms.aspx", "passage_text": "“Many of these symptoms are classic signs of vitamin D deficiency osteomalacia, which is different from the vitamin D deficiency that causes osteoporosis in adults,” he says. “What’s happening is that the vitamin D deficiency causes a defect in putting calcium into the collagen matrix into your skeleton. "}, {"url": "https://en.wikipedia.org/wiki/Keratosis_pilaris", "passage_text": "Keratosis pilaris (KP) (also follicular keratosis, lichen pilaris, or colloquially chicken skin) is a common, autosomal dominant, genetic follicular condition characterized by the appearance of rough, slightly red, bumps on the skin. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070316175456AAEXDbU", "passage_text": "Rating Newest Oldest. Best Answer: This is a symptom of Vitamin A deficiency. It is called Chicken Skin. An early sign of Vitamin A deficiency is chicken skin-small raised bumps on the back of the neck, upper arms, back and shoulders. Other deficiency symptoms are premature wrinkles, acne, pimples, blackheads, psoriasis, vision disorders, respiratory problems, dry, rough, itchy, scaly, cracked skin and slowed healing. "}, {"url": "http://www.webmd.com/diet/guide/vitamin-d-deficiency", "passage_text": "Your exposure to sunlight is limited. Because the body makes vitamin D when your skin is exposed to sunlight, you may be at risk of deficiency if you are homebound, live in northern latitudes, wear long robes or head coverings for religious reasons, or have an occupation that prevents sun exposure. You have dark skin. Symptoms of bone pain and muscle weakness can mean you have a vitamin D deficiency. However, for many people, the symptoms are subtle. Yet, even without symptoms, too little vitamin D can pose health risks."}, {"url": "http://chriskresser.com/nutrition-for-healthy-skin-part-1/", "passage_text": "A vitamin C deficiency causes scurvy, which is first manifested as rough dry skin and corkscrew hair growth. Inadequate vitamin C is also known to contribute to the development of the common problem of hyperkeratosis pillaris, as the follicles become damaged when collagen formation is impaired. (2) Rough, dry skin is a common sign of vitamin A deficiency, which often first appears as rough, raised bumps on the back of the arms. (3) This condition is called hyperkeratosis pillaris, and is found in approximately 40% of adults."}, {"url": "http://www.livestrong.com/article/292747-symptoms-of-vitamin-deficiency-on-the-skin/", "passage_text": "A general dermatitis results as well, with overall skin dryness and itching. Riboflavin deficiency in men can cause a dermatitis-like syndrome of the scrotum with itching and scaling skin. Many skin symptoms of a vitamin deficiency occur with other disorders as well, so don't rely on the Internet for diagnosis. If you believe you have a vitamin deficiency see your doctor for help with diagnosis and treatment. Niacin. The term pellagra derives from the Italian words for rough skin. If you suffer from a niacin -- vitamin B3 -- deficiency, you could develop pellagra. The World Health Organization describes the skin manifestations of niacin deficiency as starting with redness and itching on sun-exposed areas of your skin."}, {"url": "http://chriskresser.com/nutrition-for-healthy-skin-part-1/", "passage_text": "Lack of vitamin A causes the skin to become keratinized and scaly, and mucus secretion is suppressed. (2) Rough, dry skin is a common sign of vitamin A deficiency, which often first appears as rough, raised bumps on the back of the arms. (3) This condition is called hyperkeratosis pillaris, and is found in approximately 40% of adults."}]