[{"url": "http://www.answers.com/Q/What_role_does_DNA_play_in_transcription", "passage_text": "mRNA is messenger RNA. mRNA is transcribed from DNA, and carries coding information to the ribosomes. Here, the RNA is translated into a protein. In mRNA genetic information i … s encoded in the sequence of nucleotides arranged into codons."}, {"url": "http://www.answers.com/Q/What_role_does_RNA_polymerase_play_in_the_process_of_transcription", "passage_text": "Basically, RNA polymerase's role is very similar to that of DNA polymerase. RNA polymerase is an enzyme that is used during transcription in the nucleus. Similar to DNA polyme … rase, RNA polymerase codes for the complementary nucleotides to a DNA strand. Instead of thymine though, uracil codes with adenine."}, {"url": "http://www.biology-questions-and-answers.com/what-role-does-mrna-play-in-transcription-and-translation.html", "passage_text": "by: Anonymous. mRNA is messenger RNA. mRNA is transcribed from DNA, and carries coding information to the ribosomes. Here, the RNA is translated into a protein. In mRNA genetic information is encoded in the sequence of nucleotides arranged into codons. Each codon encodes for a specific amino acid, except the stop codons that terminate protein synthesis."}, {"url": "http://biology-forums.com/index.php?topic=38791.0", "passage_text": "mRNA is messenger RNA. mRNA is transcribed from DNA, and carries coding information to the ribosomes. Here, the RNA is translated into a protein. In mRNA genetic information is encoded in the sequence of nucleotides arranged into codons."}, {"url": "http://www.answers.com/Q/What_role_does_DNA_play_in_transcription", "passage_text": "DNA (deoxyribonucleic acid) is the genetic information in a cell that is, in part, responsible for protein synthesis. DNA is constantly being replicated through a process call … ed transcription to fill its other niche, cellular mitosis (replication). 3 people found this useful. Answered."}, {"url": "http://www.atdbio.com/content/14/Transcription-Translation-and-Replication", "passage_text": "Transcription is the process by which DNA is copied (transcribed) to mRNA, which carries the information needed for protein synthesis. Transcription takes place in two broad steps. First, pre-messenger RNA is formed, with the involvement of RNA polymerase enzymes."}]