[{"url": "http://www.rsc.org/periodic-table/element/77/iridium", "passage_text": "It has a very high density and melting point. Uses. Iridium is the most corrosion-resistant material known. It is used in special alloys and forms an alloy with osmium, which is used for pen tips and compass bearings. It was used in making the standard metre bar, which is an alloy of 90% platinum and 10% iridium."}, {"url": "http://www.rsc.org/periodic-table/element/77/iridium", "passage_text": "Iridium was originally found as a contaminant (with the element osmium) in platinum, and it was from the solid remnants left when platinum was dissolved in a mix of sulphuric and hydrochloric acids that Tennant made his discovery of both elements.t has a very high density and melting point. Uses. Iridium is the most corrosion-resistant material known. It is used in special alloys and forms an alloy with osmium, which is used for pen tips and compass bearings. It was used in making the standard metre bar, which is an alloy of 90% platinum and 10% iridium."}, {"url": "http://www.livescience.com/39143-iridium.html", "passage_text": "Word origin: Iridium comes from the Latin word iris, meaning rainbow. Discovery: British chemist Smithson Tennant discovered iridium in the residue left when crude platinum is dissolved by aqua regia in 1803. Properties of iridium. Iridium is the most corrosive resistant metal known and one of the densest metals. It is a member of the platinum family and is white with a yellowish tinge. Iridium is very hard and brittle, making it difficult to machine, form, or work.[See Periodic Table of the Elements ]. Sources of iridium."}, {"url": "http://www.encyclopedia.com/topic/iridium.aspx", "passage_text": "It is not certain whether osmium or iridium is the most dense element. Iridium is found uncombined in nature as the metal and in combination with osmium and platinum. It is obtained commercially from osmiridium, a byproduct of platinum production. very rare element (0.0001 ppm of Earth 's crust), iridium is found in the naturally occurring alloys osmiridium (approximately 50% iridium) and iridiosmium (approximately 70% iridium) in Alaska and South Africa. It is obtained by igniting ammonium chloroiridate, (NH 4) 3 IrCl 6, in hydrogen atmosphere."}, {"url": "http://www.encyclopedia.com/topic/iridium.aspx", "passage_text": "iridium (symbol Ir) Silver-white, metallic element discovered in 1804 by the English chemist Smithson Tennant. A platinum-type metal, iridium is hard and brittle and the most corrosion-resistant metal. very rare element (0.0001 ppm of Earth 's crust), iridium is found in the naturally occurring alloys osmiridium (approximately 50% iridium) and iridiosmium (approximately 70% iridium) in Alaska and South Africa. It is obtained by igniting ammonium chloroiridate, (NH 4) 3 IrCl 6, in hydrogen atmosphere."}, {"url": "http://education.jlab.org/itselemental/ele077.html", "passage_text": "Pure iridium is very brittle and is nearly impossible to machine. It is primarily used as a hardening agent for platinum. Platinum-iridium alloys are used to make crucibles and other high temperature equipment. Iridium is also alloyed with osmium to make the tips of fountain pens and compass bearings. Iridium is the most corrosive resistant metal known. For this reason, the standard meter bar was created from an alloy of 90% platinum and 10% iridium."}, {"url": "http://www.answers.com/Q/Where_is_iridium_found", "passage_text": "Iridium was discovered in 1803 among insoluble impurities in natural platinum. Smithson Tennant, the primary discoverer, named the iridium for the goddess Iris, personificatio … n of the rainbow, because of the striking and diverse colors of its salts.unglasses. 2 people found this useful. Edit. Share to: 1  The Element Iridium in Chemistry The element iridium is a platinum group metal that is a very durable, hard, and lustrous metal and is similar to platinum."}, {"url": "http://www.webelements.com/iridium/", "passage_text": "Iridium is white, similar to platinum, but with a slight yellowish cast. It is very hard and brittle, making it very hard to machine, form, or work. It is the most corrosion resistant metal known, and was used in making the standard metre bar of Paris, which is a 90% platinum-10% iridium alloy.ridium has no biological role. Iridium is found as the free element alloyed with platinum and other platinum metals. Naturally occurring alloys include osmiridium and iridiosmium, both mixtures of iridium and osmium."}, {"url": "http://encyclopedia2.thefreedictionary.com/Iridium+(element)", "passage_text": "It is not certain whether osmium or iridium is the most dense element. Iridium is found uncombined in nature as the metal and in combination with osmium and platinum. It is obtained commercially from osmiridium, a byproduct of platinum production."}, {"url": "http://www.chemicool.com/elements/iridium.html", "passage_text": "Discovery of Iridium. Iridium was discovered in 1803, by English chemist Smithson Tennant in London. He found it in the residue left when crude platinum had been dissolved in aqua regia (a mixture of hydrochloric acid and nitric acid). Smithson Tennant also discovered osmium at the same time.ource: Iridium is found in natural alloys with platinum and osmium in alluvial deposits. Commercially, iridium is recovered as a by-product from the nickel mining industry. Isotopes: Iridium has 34 isotopes whose half-lives are known, with mass numbers from 165 to 198."}]