[{"url": "http://heart-disease.emedtv.com/amlodipine/how-does-amlodipine-work.html", "passage_text": "There are two basic types of calcium channel blockers: dihydropyridine and non-dihydropyridine. The most important difference between the two is that non-dihydropyridine calcium channel blockers can slow down the heart rate, while dihydropyridine calcium channel blockers do not. Amlodipine is a dihydropyridine calcium channel blocker, which means that it does not have an effect on heart rate."}, {"url": "http://www.everydayhealth.com/drugs/norvasc", "passage_text": "A: Norvasc (amlodipine) is a medication used to treat high blood pressure. Studies show that some of the common side effects are dizziness, headache, and rarely fainting as a result of low blood pressure. Some studies suggest that taking at bedtime can alleviate fainting."}, {"url": "http://www.everydayhealth.com/drugs/norvasc", "passage_text": "A: Norvasc (amlodipine) belongs to a class of drugs called calcium channel blockers (CCBs) that relaxes (widens) blood vessels and improves blood flow. Norvasc is used to treat hypertension (high blood pressure), angina (chest pain), and other conditions caused by coronary artery disease."}, {"url": "http://www.webmd.com/drugs/2/drug-5942/norvasc-oral/details", "passage_text": "Uses. Amlodipine is used with or without other medications to treat high blood pressure. Lowering high blood pressure helps prevent strokes, heart attacks, and kidney problems. Amlodipine belongs to a class of drugs known as calcium channel blockers. It works by relaxing blood vessels so blood can flow more easily."}, {"url": "https://www.nlm.nih.gov/medlineplus/druginfo/meds/a692044.html", "passage_text": "Amlodipine is used alone or in combination with other medications to treat high blood pressure and chest pain (angina). Amlodipine is in a class of medications called calcium channel blockers. It lowers blood pressure by relaxing the blood vessels so the heart does not have to pump as hard."}]