[{"url": "http://www.merriam-webster.com/dictionary/tapestry", "passage_text": ": a heavy cloth that has designs or pictures woven into it and that is used for wall hangings, curtains, etc. : something made up of different things, people, colors, etc. Full Definition of TAPESTRY. 1. a: a heavy handwoven reversible textile used for hangings, curtains, and upholstery and characterized by complicated pictorial designs b: a nonreversible imitation of tapestry used chiefly for upholstery. 2."}, {"url": "https://en.wikipedia.org/wiki/Tapestry", "passage_text": "Tapestry is a form of textile art, traditionally woven on a vertical loom. However, it can also be woven on a floor loom. First attested in English in 1467, the word tapestry derives from Old French tapisserie, from tapisser, meaning to cover with heavy fabric, to carpet, in turn from tapis, heavy fabric, via Latin tapes (. tapetis), which is the latinisation of the Greek τάπης (tapēs; τάπητος, tapētos), carpet, rug."}, {"url": "http://tapestrylabs.com/what-is-tapestry/", "passage_text": "We are a new kind of media. Tapestry helps you craft a beautiful and unique brand story using a mashup of rich content including images, GIFs, progressive disclosure and a touch of playful magic. In a tapestry, the user controls the pace of your story by tapping to proceed. "}, {"url": "https://en.wikipedia.org/wiki/Tapestry", "passage_text": "My passion for tapestry arrived suddenly on the first day of my introduction to it in my first year at ECA [Edinburgh College of Art.] I don't remember ever having consciously thought about tapestry before that day but I somehow knew that eventually I'd be really good at this. First attested in English in 1467, the word tapestry derives from Old French tapisserie, from tapisser, meaning to cover with heavy fabric, to carpet, in turn from tapis, heavy fabric, via Latin tapes (. tapetis), which is the latinisation of the Greek τάπης (tapēs; τάπητος, tapētos), carpet, rug."}, {"url": "http://tapestrycenter.org/?page_id=23", "passage_text": "From past to present, tapestry is arguably the most expressive and versatile of the textile arts. Tapestry-woven objects range from wall hangings to carpets and seat cushions, to garments, hats and shoes. They may be huge or tiny. They might be flexible or stiff, somber or bright, rough or smooth. And most importantly, their designs may be almost anything under the sun."}, {"url": "http://tapestrycenter.org/?page_id=23", "passage_text": "Tapestry weave is a specific, hand-woven, textile construction. In tapestry designs, the different colored threads of the weft interlace with the foundation threads of the warp, and the color makes a pattern. Tapestry-woven objects range from wall hangings to carpets and seat cushions, to garments, hats and shoes. They may be huge or tiny. They might be flexible or stiff, somber or bright, rough or smooth. And most importantly, their designs may be almost anything under the sun."}, {"url": "https://en.wikipedia.org/wiki/Tapestry", "passage_text": "Tapestry is weft-faced weaving, in which all the warp threads are hidden in the completed work, unlike cloth weaving where both the warp and the weft threads may be visible. First attested in English in 1467, the word tapestry derives from Old French tapisserie, from tapisser, meaning to cover with heavy fabric, to carpet, in turn from tapis, heavy fabric, via Latin tapes (. tapetis), which is the latinisation of the Greek τάπης (tapēs; τάπητος, tapētos), carpet, rug."}, {"url": "http://www.mirrixlooms.com/tapestry-basics/", "passage_text": "What is Tapestry? Tapestry is a type of fiber weaving. It is weft-faced (ie: the warp does not show at all), the wefts are generally discontinuous (they do not go from selvedge (edge) to selvedge (edge) and it is generally pictorial (like painting a picture with fiber). How do I know what warp coil to use for tapestry? This is something you have to experiment with as a tapestry weaver. For finer weft, you will want to use a warp coil with more dents per inch. For thicker weft, you will want to use a warp coil with fewer dents per inch or even warp every other dent."}, {"url": "http://www.merriam-webster.com/dictionary/tapestry", "passage_text": "Definition of TAPESTRY for Kids. : a heavy cloth that has designs or pictures woven into it and is used especially as a wall hanging. — tap·es·tried \\-strēd\\ adjective. Full Definition of TAPESTRY. 1. a: a heavy handwoven reversible textile used for hangings, curtains, and upholstery and characterized by complicated pictorial designs b: a nonreversible imitation of tapestry used chiefly for upholstery. 2."}]