[{"url": "http://www.naturalhealtheveryday.com/enzymes/nattokinase-fibrinolytic-enzyme", "passage_text": "Nattokinase is a potent fibrinolytic enzyme extracted and highly purified from a traditional Japanese food called Natto. Research has shown Nattokinase to support the body in breaking up and dissolving the unhealthy coagulation of blood and to support fibrinolytic activity. Nattokinase may help promote:"}, {"url": "https://www.taoofherbs.com/articles/88/NeprinolEnzyme.htm", "passage_text": "Amylase, Pepsin, and Lactase are the most common digestive enzymes, which break down starches, proteins and fats respectively. Similarly, Systemic enzymes, also called metabolic enzymes works inside the blood, tissues, and cell of the body system. Some of the important Systemic enzymes include Fibrinolytic enzymes, Proteases, and Catalases. Among them, Serrapeptase and Nattokinase are the essential Fibrinolytic enzymes, which act to break down excess fibrin in the body. These enzymes fight inflammation, fibrosis (scar tissues), and viruses; modulate the immune system; and cleanse the blood."}, {"url": "http://www.astenzymes.com/exclzyme", "passage_text": "Systemic enzyme therapy refers to the therapeutic use of natural enzymes to produce desired healing effects. Systemic enzymes are absorbed from the small intestine where they enter the bloodstream and execute their effects on the entire body as a system."}, {"url": "http://peyroniesrelief.com/enzyme-education", "passage_text": "Enzyme therapy consists of building up naturally derived Proteolytic, Systemic & Fibrinolytic enzymes into the human body. This regimen takes some time to build-up into one’s system to become most effective."}, {"url": "http://solutionstoaging.net/STAsitepublic_html/systemic_enzymes.html", "passage_text": "These are the premiere systemic enzyme products available. Be aware that many systemic enzyme products are not very effective. These two formulas are for professional use. Enzymes are the catalysts that ignite every chemical reaction in our body."}]