[{"url": "http://www.medfriendly.com/dolichocephaly.html", "passage_text": "DOLICHOCEPHALY Dolichocephaly is a condition in which one has an abnormally long head. A perfectly round head measures the same distance between the ears as it does from the nose to the back of the head. In dolichocephaly, the front to back measurement is longer than the side-to-side measurement."}, {"url": "http://www.cranialtech.com/my-babys-head-shape/", "passage_text": "Also known as dolichocephaly, scaphocephaly describes an abnormally tall, narrow head shape. This shape is particularly common in premature babies who have spent time in the neonatal intensive care unit. Common Characteristics: 1  Head is longer and narrower than normal."}, {"url": "http://elementsofmorphology.nih.gov/index.cgi?tid=e09c1185a1ef3e38", "passage_text": "Dolichocephaly. Dolichocephaly. Objective: Cephalic index less than 76%. Subjective: Apparently increased antero-posterior length of the head compared to width. Cephalic index is the ratio of head width expressed as a percentage of head length. The normal range is 76-80.9%."}, {"url": "http://doctor.ndtv.com/faq/ndtv/fid/8584/What_are_the_implications_of_dolichocephalic_fetal_head.html", "passage_text": "A. Dolicocephaly refers to a head shape that is longer than wide. Most of the time this is a normal variant and a follow-up scan would confirm this. Occasionally this is a sign of a generalised disorder of organ formation and this would be more evident in the follow-up scan."}, {"url": "http://radiopaedia.org/articles/scaphocephaly", "passage_text": "Scaphocephaly (also known as dolichocephaly) is the most common form of craniosynostosis, where premature closure of the sagittal suture results in impediment to lateral growth of the skull while anteroposterior growth continues, producing a narrow elongated skull."}, {"url": "https://www.healthtap.com/topics/causes-of-dolichocephaly", "passage_text": "More info: If the brain structure is normal, don't do anything. Wait until the child is born. Dolichocephaly is a head shape description, and nothing more. It does not necessarily indicate a medical problem needing treatment."}]