[{"url": "http://americanhistory.si.edu/press/fact-sheets/plymouth-rock", "passage_text": "In 1985, museum officials traveled to Plymouth, Mass., to accept the gift. History of Plymouth Rock The Mayflower arrived in Plymouth Harbor in 1620, after first stopping near today's Provincetown. According to oral tradition, Plymouth Rock was the site where William Bradford and other Pilgrims first set foot on land. In the 1920s, the Plymouth Antiquarian Society inherited a 400-pound piece of the “Mother rock” when it purchased the Sandwich Street Harlow House and discovered the rock being used as a doorstep. The society broke the doorstep in three pieces and, in 1984, offered a piece to the Smithsonian."}, {"url": "https://en.wikipedia.org/wiki/Plymouth_Rock", "passage_text": "It is an important symbol in American history. There are no contemporaneous references to the Pilgrims' landing on a rock at Plymouth, and it is not referred to in Edward Winslow 's Mourt's Relation (1620–21) or in Bradford's journal Of Plymouth Plantation (1620–47). The one thing the Pilgrims certainly did not do was step ashore on Plymouth Rock. Quite apart from the consideration that it may have stood well above the high-water mark in 1620, no prudent mariner would try to bring a ship alongside a boulder on a heaving December sea when a sheltered inlet beckoned from near by."}, {"url": "http://www.answers.com/Q/Why_is_the_plymouth_rock_important", "passage_text": "Plymouth Rock is the name of the location where the pilgrims first settled in America and is also the name of a chicken species. So the answer is Plymouth Rock chickens or Ba … rred Rocks, as they are also known as are indeed alive. Answered. In 1995-1999 Dodge & Plymouth Neons. No, the noun 'Plymouth Rock' is a proper noun, the  name of a specific thing. A proper noun is always capitalized.    A common noun is a general word for any person, p … lace, or thing."}, {"url": "http://www.answers.com/Q/Why_was_Plymouth_rock_important", "passage_text": "No, the noun 'Plymouth Rock' is a proper noun, the  name of a specific thing. A proper noun is always capitalized.    A common noun is a general word for any person, p … lace, or thing.  The noun 'rock' (lower case r) is a common noun, a general word for  any piece of stone. The pilgrims were coming to the New World(The americas) for religious freedom from England. This landing was important because it began the colonization of the Americas. If th … e Pilgrims had failed, it could have been years before another expedition was sent out."}, {"url": "http://www.answers.com/Q/Why_was_Plymouth_rock_important", "passage_text": "Plymouth Rock is the name of the location where the pilgrims first settled in America and is also the name of a chicken species. So the answer is Plymouth Rock chickens or Ba … rred Rocks, as they are also known as are indeed alive. The pilgrims were coming to the New World(The americas) for religious freedom from England. This landing was important because it began the colonization of the Americas. If th … e Pilgrims had failed, it could have been years before another expedition was sent out."}, {"url": "https://en.wikipedia.org/wiki/Plymouth_Rock", "passage_text": "Plymouth Rock is the traditional site of disembarkation of William Bradford and the Mayflower Pilgrims who founded Plymouth Colony in 1620. The one thing the Pilgrims certainly did not do was step ashore on Plymouth Rock. Quite apart from the consideration that it may have stood well above the high-water mark in 1620, no prudent mariner would try to bring a ship alongside a boulder on a heaving December sea when a sheltered inlet beckoned from near by."}, {"url": "http://www.answers.com/Q/Why_was_Plymouth_rock_important", "passage_text": "After the Mayflower arrived at the tip of Cape Cod in November, 1620, the Pilgrims explored the coastline in a small boat, to find a suitable place to build their settlement. … The place they selected was an abandoned native village called Patuxet, which is now Plymouth, Massachusetts. The pilgrims were coming to the New World(The americas) for religious freedom from England. This landing was important because it began the colonization of the Americas. If th … e Pilgrims had failed, it could have been years before another expedition was sent out."}, {"url": "http://www.smithsonianmag.com/smithsonian-institution/the-story-behind-plymouth-rock-639690/", "passage_text": "smithsonian.com. Courtesy of the National Museum of American History, Smithsonian Institution. Plymouth Rock, located on the shore of Plymouth Harbor in Massachusetts, is reputed to be the very spot where William Bradford, an early governor of Plymouth colony, and other Pilgrims first set foot on land in 1620. "}]