[{"url": "http://learn.org/articles/What_Education_is_Needed_for_Becoming_a_Mechanical_Engineer.html", "passage_text": "Career Overview. As a mechanical engineer, you're in charge of creating, designing, testing, and researching mechanized devices, like tools, machines, and engines. This broad field allows you to specialize in different areas, such as power-using machines or power-producing machines. Find out what education and career requirements you'll need to meet to enter the mechanical engineering field. Schools offering Engineering & Technology Management degrees can also be found in these popular choices."}, {"url": "http://learn.org/articles/What_Education_is_Needed_for_Becoming_a_Mechanical_Engineer.html", "passage_text": "Education Requirements. If you're new to the field, a bachelor's degree in mechanical engineering is usually suitable to qualify you for an entry-level job. Many schools offer majors specifically in mechanical engineering, though some relevant alternatives include mathematics, chemistry, or physics. Find out what education and career requirements you'll need to meet to enter the mechanical engineering field. Schools offering Engineering & Technology Management degrees can also be found in these popular choices."}, {"url": "http://www.wikihow.com/Become-a-Mechanical-Engineer", "passage_text": "Two Methods: Becoming an Engineer Sample Resume. Mechanical engineers will find their skills in demand in a variety of fields and industries including medical, scientific research, construction, aerospace, acoustics, combustion, and automotive engineering. 1 A mechanical engineering curriculum is a rigorous course of study that will require discipline and hard work to complete, but it is well worth the effort. 2  Having fun and keeping the bigger picture in mind will help you get through it."}, {"url": "http://www.studentscholarships.org/careers_salary/135/education/mechanical_engineers.php", "passage_text": "1. You usually need a university degree in mechanical engineering or in a related field of engineering. 2. You may also need a master's degree or doctorate in a related engineering field. 3. You need a licence from a provincial/territorial association of professional engineers to approve engineering drawings/reports and to practise as a professional engineer (P. Eng.). "}, {"url": "http://study.com/mechanical_engineer.html", "passage_text": "Aspiring mechanical engineers must earn a bachelor's degree in mechanical engineering at minimum, and many pursue graduate degrees in the field. Every state requires that mechanical engineers earn licensure, which calls for education, supervised work experience and several examinations. Students interested in research and development positions in academia or private industry might go on to earn a master's or doctoral degree in mechanical engineering. Graduate programs in mechanical engineering typically involve research projects in a specific area, culminating in a thesis or dissertation."}, {"url": "http://study.com/mechanical_engineer.html", "passage_text": "Learn about the education and preparation needed to become a mechanical engineer. Get a quick view of the requirements as well as details about degree programs, job duties and licensure to find out if this is the career for you. View 10 Popular Schools ». Students interested in research and development positions in academia or private industry might go on to earn a master's or doctoral degree in mechanical engineering. Graduate programs in mechanical engineering typically involve research projects in a specific area, culminating in a thesis or dissertation."}, {"url": "http://www.learnhowtobecome.org/mechanical-engineer/", "passage_text": "The following how-to guide explains what you need to know to become a mechanical engineer, from basic educational requirements to graduate training to build your credentials. The Bureau of Labor Statistics (BLS) predicts the addition of 11,600 mechanical engineers from 2012 to 2022. Mechanical Engineering Basics. Mechanical engineers research, design, develop and test mechanical and thermal devices including tools, engines, and machines. Some of the more-common devices serve the medical, energy, and automated manufacturing sectors."}, {"url": "http://www.learnhowtobecome.org/mechanical-engineer/", "passage_text": "The BLS reports that a bachelor’s degree in mechanical engineering is necessary for most entry-level positions in the field. Students may also choose to complete a two-year pre-engineering degree and find related work as a mechanical drafter. Mechanical Engineering Basics. Mechanical engineers research, design, develop and test mechanical and thermal devices including tools, engines, and machines. Some of the more-common devices serve the medical, energy, and automated manufacturing sectors."}]