[{"url": "http://theamericanrevolution.org/eventdetail.aspx?event=52", "passage_text": "By the time the Second Continental Congress met, the American Revolutionary War had already started with the Battles of Lexington and Concord. The Congress was to take charge of the war effort. For the first few months of the struggle, the Patriots had carried on their struggle in an ad-hoc and uncoordinated manner. Shortly after the fighting of the American Revolution commenced, the Second Continental Congress convened to formally manage affairs on the home front. It wasn't easy. The federal system of government was not yet created."}, {"url": "http://www.history.com/topics/american-revolution/the-continental-congress", "passage_text": "On September 5, 1774, delegates from each of the 13 colonies except for Georgia (which was fighting a Native-American uprising and was dependent on the British for military supplies) met in Philadelphia as the First Continental Congress to organize colonial resistance to Parliament’s Coercive Acts. The First Continental Congress, which was comprised of delegates from the colonies, met in 1774 in reaction to the Coercive Acts, a series of measures imposed by the British government on the colonies in response to their resistance to new taxes."}, {"url": "http://www.history.com/topics/american-revolution/the-continental-congress", "passage_text": "From 1774 to 1789, the Continental Congress served as the government of the 13 American colonies and later the United States. The First Continental Congress, which was comprised of delegates from the colonies, met in 1774 in reaction to the Coercive Acts, a series of measures imposed by the British government on the colonies in response to their resistance to new taxes."}, {"url": "http://www.answers.com/Q/What_was_the_first_government_after_the_revolutionary_war", "passage_text": "The first battle of the revolutionary war was in 1775 and was the battle of Lexington and Concord. The first battle of the Revolutionary War would be the Battle of Lexington a … nd Concord. Attucks was killed in the Boston Massacre march 15 1770, but this was 5 years before the outbreak of the Revolutionary War in … 1775. If Crispus Attucks counts, then we must also consider 11-year-old Christopher Seider who was killed 2 weeks before the Boston Massacre."}, {"url": "http://www.answers.com/Q/What_was_the_first_government_after_the_revolutionary_war", "passage_text": "The United States Congress decreed that The First Battle of the American Revolutionary War was in Point Pleasant Virginia on September 10, 1774, where Colonel Andrew Lew … is Defeated the Indian Cornstalk's Army. Attucks was killed in the Boston Massacre march 15 1770, but this was 5 years before the outbreak of the Revolutionary War in … 1775. If Crispus Attucks counts, then we must also consider 11-year-old Christopher Seider who was killed 2 weeks before the Boston Massacre."}, {"url": "http://www.history.com/topics/american-revolution/the-continental-congress", "passage_text": "In 1775, the Second Continental Congress convened after the American Revolutionary War (1775-83) had already begun. In 1776, it took the momentous step of declaring America’s independence from Britain. The First Continental Congress, which was comprised of delegates from the colonies, met in 1774 in reaction to the Coercive Acts, a series of measures imposed by the British government on the colonies in response to their resistance to new taxes."}, {"url": "http://www.history.com/topics/american-revolution/american-revolution-history", "passage_text": "The American Revolution (1775-83) is also known as the American Revolutionary War and the U.S. War of Independence. The conflict arose from growing tensions between residents of Great Britain’s 13 North American colonies and the colonial government, which represented the British crown. Lead Up to the Revolutionary War. For more than a decade before the outbreak of the American Revolution in 1775, tensions had been building between colonists and the British authorities."}, {"url": "http://www.history.com/topics/american-revolution/american-revolution-history", "passage_text": "By June 1776, with the Revolutionary War in full swing, a growing majority of the colonists had come to favor independence from Britain. On July 4, the Continental Congress voted to adopt the Declaration of Independence, drafted by a five-man committee including Franklin and John Adams but written mainly by Jefferson. Lead Up to the Revolutionary War. For more than a decade before the outbreak of the American Revolution in 1775, tensions had been building between colonists and the British authorities."}, {"url": "http://theamericanrevolution.org/eventdetail.aspx?event=52", "passage_text": "Georgia had not participated in the First Continental Congress and did not initially send delegates to the Second Continental Congress. On May 13, 1775, Lyman Hall was admitted as a delegate from the Parish of St. John's in the Colony of Georgia, not as a delegate from the colony itself. Shortly after the fighting of the American Revolution commenced, the Second Continental Congress convened to formally manage affairs on the home front. It wasn't easy. The federal system of government was not yet created."}]