[{"url": "http://www.processchecker.com/file/TTMS_OFLINE.exe.html", "passage_text": "Check what your PC is running. TTMS_OFLINE.exe is known as CompressData and it is developed by Microsoft. We have seen about 3 different instances of TTMS_OFLINE.exe in different location. So far we haven't seen any alert about this product. If you think there is a virus or malware with this product, please submit your feedback at the bottom"}, {"url": "http://www.acronymfinder.com/Slang/TTMS.html", "passage_text": "The World's most comprehensive professionally edited abbreviations and acronyms database. All trademarks/service marks referenced on this site are properties of their respective owners. The Acronym Finder is ©1988-2015, Acronym Finder, All Rights Reserved. "}, {"url": "http://www.ttmsdropper.com/faq.cfm", "passage_text": "IBM has been contracted by the U.S. Postal Service (USPS) to conduct an independent study of mail delivery performance, known as the Transit-Time Measurement System (TTMS). TTMS' main goal is to measure service performance of USPS mail delivery from the customer's point of view. IBM provides information to the USPS on a daily basis to help them gauge their success in meeting performance goals. The USPS is required by law to measure delivery performance as part of the Postal Accountability and Enhancement Act. The Mail Study is funded by the USPS, and paid for through postage revenue, not tax dollars."}, {"url": "http://www.investopedia.com/terms/t/ttm.asp", "passage_text": "The timeframe of the past 12 months used for reporting financial figures. A company's trailing 12 months is a representation of its financial performance for a 12-month period, but typically not at its fiscal year end. Since quarterly reports rarely report how the company has done in the past 12 months, TTM tends to be calculated manually or found on various websit"}, {"url": "http://www.ttms.com.au/index.html", "passage_text": "Track and Trail Management Services Pty Ltd (TTMS) is a team of specialist walking track planners and builders. TTMS employs the most experienced walking track builders in Australia. TTMS are the experts in planning and constructing new or upgraded walking tracks with an emphasis on aesthetics, long-term stability, low maintenance and cost-effective project management."}, {"url": "http://www.ttmsportal.com/", "passage_text": "Dispatching Solutions. TTMS is a web based solution allowing users to work from anywhere with an internet connection. Some of the features offered are dispatching, invoicing, customer management, rates management, inventory management, payroll, sales reports as well as many other features. TTMS is built using the latest technology using the Micorsoft.NET framework for web site development and SQL Server for database management. TTMS offers integration to 3rd party eLog solutions, such as XRS, for drivers. TTMS provides the ability to see your drivers on a map without having to log into your eLog software and to view their available drive time and duty time hours."}, {"url": "http://download.cnet.com/TTMS/3000-2051_4-10725336.html", "passage_text": "Publisher's Description. From J Cage Software: TTMS is a very cost effective solution for building and managing timetable systems for schools. TTMS's automated timetable building capability is able to reduce time needed to build timetables. TTMS is supporting a concept called Svirtual school. Virtual school is a model of the school you build giving the information needed to make time tables. You can build the virtual school in a very user friendly manner."}, {"url": "http://www.acronymfinder.com/TTMS.html", "passage_text": "The World's most comprehensive professionally edited abbreviations and acronyms database. All trademarks/service marks referenced on this site are properties of their respective owners. The Acronym Finder is ©1988-2015, Acronym Finder, All Rights Reserved. "}]