[{"url": "http://alltotems.com/hawk-spirit-meaning-symbols-and-totem/", "passage_text": "1 The spirit of hawk totem represents the ability to see meaning in ordinary experiences and will help you to become more observant. 2  Many of the messages Hawk totem brings are about freeing yourself of thoughts and beliefs that are limiting your spirit ability to soar above your life and gain a greater perspective. To see a hawk in your dream, denotes that suspicions are lurking around you and your activities. You need to proceed with caution. Alternatively, a hawk symbolizes insight. Consider the phrase “hawk’s eye” to mean that you need to keep a close watch on someone or some situation."}, {"url": "http://thresholds.typepad.com/blog/2011/06/what-does-it-mean-when-a-hawk-comes-to-you.html", "passage_text": "The hawk is a messenger bird. Usually when we see a hawk it means to pay attention because a message is coming to you. Hawks represent clear sightedness, being observant, our far memory and guardianship. They also bring courage, wisdom, illumination, creativity and truth. Hawks give us the ability to see the larger picture in life."}, {"url": "http://www.warpaths2peacepipes.com/native-american-symbols/hawk-symbol.htm", "passage_text": "Native American Symbols, like the Hawk symbol, can vary in meaning from one tribe to another and across the culture groups of North America. Discover facts and information about the meanings of secret and mysterious symbols used by Native American Indians in our List of Symbols including the Hawk symbol. The Hawk Symbol-Mythology Hawk Myth and Legend: In Cherokee mythology Tlanuwa was the name given to two giant raptors meaning the Great Mythic Hawk and was a variation of the Thunderbird and Piasa Bird myths found in other Native American tribes and cultures."}, {"url": "http://divinesparks.blogspot.com/2008/04/hawk-symbolism.html", "passage_text": "Based on the cards I drew, I sense that the hawk could be a symbol for you calling you to wake up and take notice of what you have been feeling/sensing/knowing for a long time …. You have the opportunity to wipe the slate clean and make different choices that will give you different results in your life. Next part of the dream the hawk is somehow transformed into a child – maybe around 9 months to a year old. It’s wearing white fuzzy clothing, not sure if it’s male or female. It indicates it wants to lie down (on our blanket) and sleep, using the sign language sign for sleep. We lay down on the blanket with it."}, {"url": "http://www.warpaths2peacepipes.com/native-american-symbols/hawk-symbol.htm", "passage_text": "Meaning of the Hawk Symbol Native American Indians were a deeply spiritual people and they communicated their history, thoughts, ideas and dreams from generation to generation through Symbols and Signs such as the Hawk symbol. The Hawk Symbol-Mythology Hawk Myth and Legend: In Cherokee mythology Tlanuwa was the name given to two giant raptors meaning the Great Mythic Hawk and was a variation of the Thunderbird and Piasa Bird myths found in other Native American tribes and cultures."}, {"url": "https://answers.yahoo.com/question/index?qid=20080308212045AA42vvU", "passage_text": "Best Answer: Hawk The god Horus, who was the archetype for the pharaohs, frequently appeared in Egyptian art as either a hawk, or a man with the head of a hawk. The funeral ceremonies of pharaohs often included the release of a live hawk to depict the dead king's soul flying away to the afterlife. Horus was the god who represented the Pharaohs. HAWK Sun Gods, Plunderers, Predators, Death As a high-flying raptor, the hawk shares much of the symbolism of the eagle. It is associated with light, royalty, power, the sun, watchfulness, and the heavens. Many solar gods have the hawk as an attribute or messenger"}, {"url": "http://www.warpaths2peacepipes.com/native-american-symbols/hawk-symbol.htm", "passage_text": "The Hawk Symbol-Red-tailed Hawk Feathers The feathers of the Red-tailed Hawk are considered sacred to many Native Americans and, like the feathers of the Eagle, are sometimes used in religious ceremonies and rituals. For additional information refer to Power Animals. The Hawk Symbol-Mythology Hawk Myth and Legend: In Cherokee mythology Tlanuwa was the name given to two giant raptors meaning the Great Mythic Hawk and was a variation of the Thunderbird and Piasa Bird myths found in other Native American tribes and cultures."}, {"url": "https://answers.yahoo.com/question/index?qid=20080308212045AA42vvU", "passage_text": "In ancient Egypt, the hawk was considered a royal bird and a symbol of the soul (ba). Egyptians believed that the ba of a mummy walked the earth, visiting the body from time to time, until eventually being reunited with the resurrected body. Horus was the god who represented the Pharaohs. HAWK Sun Gods, Plunderers, Predators, Death As a high-flying raptor, the hawk shares much of the symbolism of the eagle. It is associated with light, royalty, power, the sun, watchfulness, and the heavens. Many solar gods have the hawk as an attribute or messenger"}]