[{"url": "http://www.ameresco.com/solution/asset-monetization", "passage_text": "Harnessing the potential of these new fuels can provide new sources of revenue for traditional energy suppliers as well as municipal and industrial enterprises outside of the energy services industry. Municipalities: Real estate and geographical assets can be harnessed to provide solar, wind and hydroelectric energy. New approaches to energy asset management can eliminate the risks and costs associated with non-core energy infrastructure, while new fuel technologies including biomass and landfill gas provide new ways of monetizing waste."}, {"url": "http://energy.gov/management/office-management/employee-services/property-management/definitions", "passage_text": "Definitions. The definition of personal property includes but it not limited to the following. Accountability-A property management function that involves maintaining an account or record of personal property and personal property transactions from receipt to final disposition. •Receipt-Includes the delivery and acceptance of personal property assets in the DOE HQ inventory and the creation of its records in Sunflower. •Reconciliation-The process of comparing tagged and un-tagged property located during an inventory against those shown on the list"}, {"url": "https://en.wikipedia.org/wiki/Infrastructure_Asset_Management", "passage_text": "Infrastructure asset management is the integrated, multidisciplinary set of strategies in sustaining public infrastructure assets such as water treatment facilities, sewer lines, roads, utility grids, bridges, and railways. Term [edit]. Infrastructure asset management is a specific term of asset management focusing on physical, rather than financial assets. Sometimes the term infrastructure management is used to mean the same thing, most notably in title of The International Infrastructure Management Manual (2000, first edition)."}, {"url": "http://energy.gov/management/office-management/employee-services/property-management/definitions", "passage_text": "•Government Personal Property-Government-owned or Government-leased (from commercial sources) items of any kind (except real property or property related to real property) that are in the custody of DOE personnel or DOE contractors. •Receipt-Includes the delivery and acceptance of personal property assets in the DOE HQ inventory and the creation of its records in Sunflower. •Reconciliation-The process of comparing tagged and un-tagged property located during an inventory against those shown on the list"}, {"url": "http://www.investopedia.com/terms/r/regulatoryasset.asp", "passage_text": "DEFINITION of 'Regulatory Asset'. Specific costs or revenues that a regulatory agency permits a U.S. public utility (usually an energy company) to defer to its balance sheet. These amounts would otherwise be required to appear on the company's income statement and would be charged against current expenses or revenues. The accounting methods used to disclose regulatory assets may cause differences in how an electric utility company's financial condition is reported. For example, under U.K. GAAP, these assets are currently recorded on the"}, {"url": "http://en.openei.org/wiki/Definition:Critical_Assets", "passage_text": "Critical Assets. Facilities, systems, and equipment which, if destroyed, degraded, or otherwise rendered unavailable, would affect the reliability or operability of the Bulk Electric System. "}, {"url": "https://buildingenergyscore.energy.gov/", "passage_text": "Review the Asset Score Data Collection Priority Map to help focus on the most important building data given your building’s use type and climate zone. Enter Data: Register for an account, log in, create a building, and input the building data you have collected. Receive an Asset Score Report: Select the Score Building button to generate the report that includes your Asset Score, building system evaluation, and potential energy savings upgrade opportunities. "}, {"url": "http://www.investopedia.com/terms/e/energy_sector.asp", "passage_text": "DEFINITION of 'Energy Sector'. A category of stocks that relate to producing or supplying energy. This sector includes companies involved in the exploration and development of oil or gas reserves, oil and gas drilling, or integrated power firms. Next Up. "}, {"url": "https://en.wikipedia.org/wiki/Stranded_asset", "passage_text": "In this context, stranded assets are also defined as an asset that has become obsolete or non-performing, but must be recorded on the balance sheet as a loss of profit. Stranded assets can be caused by a variety of factors and are a phenomenon inherent in the ' creative destruction ' of economic growth, transformation and innovation, as such they pose risks to individuals and firms and may have systemic implications."}, {"url": "http://www.ameresco.com/solution/asset-monetization", "passage_text": "Asset Monetization. Monetizing energy assets is an effective way to offset annual utility and infrastructure expenses or develop new sources of revenue for government and industrial enterprises. New approaches to energy asset management can eliminate the risks and costs associated with non-core energy infrastructure, while new fuel technologies including biomass and landfill gas provide new ways of monetizing waste."}]