[{"url": "http://www.answers.com/Q/NATO_and_the_Warsaw_Pact_were_two_competing_alliances_during_which_time_period", "passage_text": "Confidence votes 51.7K. NATO and the Warsaw Pact were two competing alliances during the Cold War. The members of NATO were: Belgium, Canada,Denmark, France, Iceland, Italy, Luxembourg, the Netherlands, Norway, Portugal, the United Kingdom, and the United States. NATO (North Atlantic Treaty Organisation) was an alliance of nations including the USA, Canada and the United Kingdom. It was formed to defend Western Europe against the USSR. … The Warsaw Pact was the USSR's response to NATO."}, {"url": "http://www.answers.com/Q/NATO_and_the_Warsaw_Pact_were_two_competing_alliances_during_which_time_period", "passage_text": "The members of the Warsaw Pact were: People's Republic of Albania, People's Republic of Bulgaria, Czechoslovak Republic, German Democratic Republic, People's Republic of Hungary, People's Republic of Poland, People's Republic of Romania, and the Union of Soviet Socialist Republics. NATO (North Atlantic Treaty Organisation) was an alliance of nations including the USA, Canada and the United Kingdom. It was formed to defend Western Europe against the USSR. … The Warsaw Pact was the USSR's response to NATO."}, {"url": "https://en.wikipedia.org/wiki/Cold_War", "passage_text": "The Cold War was a state of political and military tension after World War II between powers in the Western Bloc (the United States, its NATO allies and others) and powers in the Eastern Bloc (the Soviet Union and its allies in the Warsaw Pact). Historians have not fully agreed on the dates, but 1947–1991 is common. "}, {"url": "http://mrkscoldwarb.wikispaces.com/NATO+v.+Warsaw+Pact", "passage_text": "What was the Warsaw Pact? The Warsaw Pact was the name of the military alliance between the Soviet Union and Eastern European nations. This treaty included all communist countries except Yugoslavia; Soviet Union, Albania, Bulgaria, Hungary, Poland, Romania, Czechoslovakia, and East Germany. Responding with this pact set up a military alliance between the Soviet Union and Eastern European Nations. (Powaski 96, 101) The formation of NATO and the re-militarization of West Germany both posed potential threats to the Eastern countries, and were the main reasons for the creation of the Warsaw Pact."}, {"url": "http://www.answers.com/Q/What_period_of_time_when_the_Warsaw_Pact_nations_and_NATO_nations_were_adversaries_yet_did_not_engage_in_direct_combat", "passage_text": "NATO (North Atlantic Treaty Organisation) was an alliance of nations including the USA, Canada and the United Kingdom. It was formed to defend Western Europe against the USSR. … The Warsaw Pact was the USSR's response to NATO. It was similarly an alliance of nations and was made of the USSR and the Communist Eastern European countries it occupied."}, {"url": "http://www.history.com/topics/cold-war/formation-of-nato-and-warsaw-pact", "passage_text": "Introduction. In 1949, the prospect of further Communist expansion prompted the United States and 11 other Western nations to form the North Atlantic Treaty Organization (NATO). The Soviet Union and its affiliated Communist nations in Eastern Europe founded a rival alliance, the Warsaw Pact, in 1955. The original membership of the North Atlantic Treaty Organization (NATO) consisted of Belgium, Britain, Canada, Denmark, France, Iceland, Italy, Luxembourg, the Netherlands, Norway, Portugal and the United States."}, {"url": "http://www.history.com/this-day-in-history/nato-pact-signed", "passage_text": "A+E Networks. The United States and 11 other nations establish the North Atlantic Treaty Organization (NATO), a mutual defense pact aimed at containing possible Soviet aggression against Western Europe. NATO stood as the main U.S.-led military alliance against the Soviet Union throughout the duration of the Cold War. The Soviet Union condemned NATO as a warmongering alliance and responded by setting up the Warsaw Pact (a military alliance between the Soviet Union and its Eastern Europe satellites) in 1955."}, {"url": "http://www.answers.com/Q/What_period_of_time_when_the_Warsaw_Pact_nations_and_NATO_nations_were_adversaries_yet_did_not_engage_in_direct_combat", "passage_text": "The Warsaw Pact was a military alliance between the Soviet Union and its satellite countries in Eastern Europe. It was formed in 1955 as a response to the entry of West German … y into NATO. The pact was dissolved in 1991. … The Warsaw Pact was the USSR's response to NATO. It was similarly an alliance of nations and was made of the USSR and the Communist Eastern European countries it occupied."}, {"url": "http://www.history.com/topics/cold-war/formation-of-nato-and-warsaw-pact", "passage_text": "West Germany formally joined NATO on May 5, 1955, and the Warsaw Pact was signed less than two weeks later, on May 14. Joining the USSR in the alliance were Albania, Bulgaria, Czechoslovakia, the German Democratic Republic (East Germany), Hungary, Poland and Romania. The original membership of the North Atlantic Treaty Organization (NATO) consisted of Belgium, Britain, Canada, Denmark, France, Iceland, Italy, Luxembourg, the Netherlands, Norway, Portugal and the United States."}]