[{"url": "http://www.mapsofworld.com/where-is/walsall.html", "passage_text": "Close. Disclaimer: All efforts have been made to make this image accurate. However Compare Infobase Limited,its directors and employees do not own any responsibility for the correctness or authenticity of the same. "}, {"url": "http://www.maplandia.com/united-kingdom/england/west-midlands/walsall/walsall/", "passage_text": "Walsall hotels map. The location of each Walsall hotel listed is shown on the detailed zoomable map. Moreover, Walsall hotel map is available where all hotels in Walsall are marked. You can easily choose your hotel by location. 3D map of Walsall in United Kingdom. You can also dive right into Walsall on unique 3D satellite map provided by Google Earth. With new GoogLe Earth plugin you can enjoy the interactive Walsall 3D map within your web browser."}, {"url": "http://www.footballgroundguide.com/leagues/england/league-one/bescot-banks-stadium-walsall.html", "passage_text": "Leave the M6 at Junction 7 and take the A34 towards Walsall (beware though of speed cameras on this stretch of dual carriageway). At the end of the dual carriageway turn left at the Bell Inn public house into Walstead Road (sign posted Bescot Stadium, Bescot Station Park & Ride). The atmosphere was good, and at one point during the first half the Walsall fans made the most noise, but Bradford made plenty of noise during the rest of the game. I barely noticed the stewards, probably as there was no hint of any trouble. I did enjoy a chicken balti pie at half time for an average price of £2.90."}, {"url": "http://www.gomapper.com/travel/where-is/walsall-located.html", "passage_text": "Location. Walsall is a city/town with a small population in the state/region of West Midlands, England which is located in the continent/region of Europe. Cities, towns and places near Walsall include Pelsall, Aldridge, Brownhills and Great Wyrley. The closest major cities include Coventry, Derby, Stoke-on-Trent and Leicester. "}, {"url": "https://en.wikipedia.org/wiki/Walsall", "passage_text": "The Industrial Revolution changed Walsall from a village of 2,000 people in the 16th century to a town of over 86,000 in approximately 200 years. The town manufactured a wide range of products including saddles, chains, buckles and plated ware. Nearby, limestone quarrying provided the town with much prosperity. It is located 8 miles north-west of the City of Birmingham and 6 miles east of the City of Wolverhampton. Historically a part of Staffordshire, Walsall is a component area of the West Midlands conurbation, and part of the Black Country."}, {"url": "http://wikitravel.org/en/Walsall", "passage_text": "1 Walsall F.C., The Banks's Stadium, Bescot Crescent (Access to the ground can be made from j9 of the M6, or via trains thats run between Birmingham New Street and Walsall (N.B. only a selection of trains will stop at Bescot Stadium)), ☎ + 44 1922 651 418 (info@walsallfc.co.uk, fax: +44 1922 613 202), [2]. 1 The New Art Gallery Walsall, Gallery Square (Parking at nearby Crown Wharf retail park, max. stay 4hrs.), ☎ +44 1922 654 400 (info@artatwalsall.org.uk, fax: +44 1922 654 401), [1]."}, {"url": "https://en.wikipedia.org/wiki/Walsall", "passage_text": "Walsall is the administrative centre of the wider Metropolitan Borough of Walsall. At the 2011 census, the town's built-up area had a population of 67,594, with the wider borough having a population of 269,323. Neighbouring settlements in the borough include Darlaston, Brownhills, Willenhall, Bloxwich, and Aldridge. It is located 8 miles north-west of the City of Birmingham and 6 miles east of the City of Wolverhampton. Historically a part of Staffordshire, Walsall is a component area of the West Midlands conurbation, and part of the Black Country."}, {"url": "http://www.maplandia.com/united-kingdom/england/west-midlands/walsall/walsall/", "passage_text": "detailed map of Walsall and near places. Welcome to the Walsall google satellite map! This place is situated in Walsall, West Midlands, England, United Kingdom, its geographical coordinates are 52° 36' 0 North, 2° 0' 0 West and its original name (with diacritics) is Walsall. See Walsall photos and images from satellite below, explore the aerial photographs of Walsall in United Kingdom. 3D map of Walsall in United Kingdom. You can also dive right into Walsall on unique 3D satellite map provided by Google Earth. With new GoogLe Earth plugin you can enjoy the interactive Walsall 3D map within your web browser."}, {"url": "https://en.wikipedia.org/wiki/Walsall", "passage_text": "Walsall (pronunciation (help·info)) is a large industrial town in the West Midlands of England. It is located 8 miles north-west of the City of Birmingham and 6 miles east of the City of Wolverhampton. Historically a part of Staffordshire, Walsall is a component area of the West Midlands conurbation, and part of the Black Country."}]