[{"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=91", "passage_text": "Although the small cumin seed looks rather unassuming, its nutty peppery flavor packs a punch when it comes to adding a nutty and peppery flavor to chili and other Mexican and Tex-Mex dishes as well playing an important role in Indian and Middle Eastern cuisine where it is a key component of curry powder. In addition to the nutrients highlighted in our ratings chart, an in-depth nutritional profile for Cumin seeds is also available. This profile includes information on a full array of nutrients, including carbohydrates, sugar, soluble and insoluble fiber, sodium, vitamins, minerals, fatty acids, amino acids and more."}, {"url": "http://wellnessmama.com/5607/cumin-herb-profile/", "passage_text": "According to Mountain Rose Herbs: “ Cumin is the seed of a small plant in the parsley family. Its use goes back 5000 years to the Egyptians, who used it not only as a spice but as an ingredient in the mummification process. The Greeks and Romans also used cumin and highly regarded it as one of the essential spices. Cumin is a good source of Iron, Manganese, and other vitamins and minerals. Some research shows that cumin can stimulate the production of pancreatic enzymes and help digestion. One study found that cumin was protective against memory loss and the damaging effects of stress on the body."}, {"url": "http://culinaryarts.about.com/od/glossary/g/Cumin.htm", "passage_text": "Cumin (pronounced KYOO-min) is a spice made from the dried seed of a plant known as Cuminum cyminum. A member of the parsley family, cumin is used in Mexican, Middle Eastern and Indian cuisines, among many others. Cumin is a typical ingredient in chili powder. Cumin is also often found in other spice blends such as garam masala and curry powder. Cumin can be used in its whole seed form as well as ground. Cumin has a warm, earthy flavor and aroma. Ground cumin is often added to chili, barbecue sauce, baked beans and marinades. "}, {"url": "http://www.food.com/about/cumin-20", "passage_text": "An aromatic spice with a distinctive bitter flavor and strong, warm aroma due to its abundant oil content. Cumin seeds are actually the small dried fruit of an annual plant in the parsley family. Native to the Mediterranean, cumin is hotter to the taste, lighter in color, and larger than caraway, another spice it's sometimes confused with. Sold whole or ground, the seeds come in three colors: amber, white or black. Substitutions: caraway seeds (use half as much); or caraway seeds plus anise seeds; or chili powder; or Amber cumin seeds may be substituted for white cumin seeds and vice versa."}, {"url": "http://www.tablespoon.com/posts/spicy-sunday-what-is-cumin/d052e975-5fdf-440f-8318-1eaede2ab519", "passage_text": "If so, you noticed that there's a lot of cumin in curry powder! In addition to India's curries, cumin is also a component in the garam masala spice blend. Cumin is common in Mexican cooking, often used in tandem with chili powder — in fact, most pre-packaged chili powder you buy at the supermarket has cumin in it. The Szechuan region of China utilizes cumin, and the Dutch put cumin in Leyden cheese. When we said cumin's been used for milennia, we weren't kidding. Cumin is used both as seeds and ground. The seeds resemble caraway, which isn't a surprise because the herb is closely related to both caraway and parsley. As with most spices, for optimum flavor you should buy the whole seeds and grind them into a powder yourself with a mortar and pestle."}, {"url": "http://theepicentre.com/spice/cumin/", "passage_text": "Cumin is native to the Levant and Upper Egypt. It now grows in most hot countries, especially India, North Africa, China and the Americas. The spice is especially associated with Morocco, where it is often the fragrance of the abundant street cookery of the medinas. Cumin is the seed of a small umbelliferous plant. The seeds come as paired or separate carpels, and are 3-6mm (1/8-1/4 in) long. They have a striped pattern of nine ridges and oil canals, and are hairy, brownish in colour, boat-shaped, tapering at each extremity, with tiny stalks attached."}, {"url": "http://www.a1spiceworld.com/cumin_powder.html", "passage_text": "Cumin (also spelled Cummin), Cuminum cyminum, small, slender annual herb of the family Apiaceae (Umbelliferae) with finely dissected leaves and white or rose-coloured flowers. Cumin Powder is available in 16 oz., 8 oz., and 3 oz. sizes. All A1 herbs, spices and seasonings are freshness sealed in durable and attractive clear plastic bottles. For bulk pricing contact us here. or call 516-801-2132."}, {"url": "http://www.nutrition-and-you.com/cumin.html", "passage_text": "Widely popular for their distinctive spice flavor, cumin seeds are commonly featuring ingredients in the North African, Middle-East, Western Chinese, Indian, Cuban and North Mexican cuisine. The spice is native to Middle-East Asian region, and today, grown all over the world for its pleasantly aromatic seeds. "}, {"url": "https://en.wikipedia.org/wiki/Cumin", "passage_text": "Cumin is the dried seed of the herb Cuminum cyminum, a member of the parsley family. The cumin plant grows to 30–50 cm (12–20 in) tall and is harvested by hand. It is an annual herbaceous plant, with a slender, glabrous, branched stem which is 20–30 cm (8–12 in) tall and has a diameter of 3–5 cm (1 1⁄4 –2 in). Cumin is grown from seeds. The seeds need 2 to 5 °C (36 to 41 °F) for emergence, an optimum of 20–30 °C (68–86 °F) is suggested. Cumin is vulnerable to frost damage, especially at flowering and early seed formation stages."}]