[{"url": "http://www.house.gov/leadership/", "passage_text": "Elected by the whole of the House of Representatives, the Speaker acts as leader of the House and combines several roles: the institutional role of presiding officer and administrative head of the House, the role of leader of the majority party in the House, and the representative role of an elected member of the House. Third parties rarely have had enough members to elect their own leadership, and independents will generally join one of the larger party organizations to receive committee assignments. A party caucus or conference is the name given to a meeting of or organization of all party members in"}, {"url": "https://en.wikipedia.org/wiki/Majority_Leader", "passage_text": "In U.S. politics, the majority floor leader is a partisan position in a legislative body. In the federal Congress, the role of the Majority Leader of the United States House of Representatives and the Majority Leader of the United States Senate differ slightly. While the responsibilities vary depending upon the political climate, the Majority Leader of the United States House of Representatives typically sets the floor agenda and oversees the committee chairmen."}, {"url": "http://www.sourcewatch.org/index.php/House_leadership", "passage_text": "The House Majority Leader is second to the Speaker of the U.S. House of Representatives in the majority party hierarchy. A representative is elected to the post by the majority party’s conference in organizational meetings prior to the start of a new Congress. "}, {"url": "http://kids.clerk.house.gov/grade-school/lesson.html?intID=39", "passage_text": "The majority leader continues to represent his or her district in the U.S. House of Representatives. Like the Speaker, however, the majority leader usually doesn’t serve on committees and does not lead floor debate on major issues. Majority Leader. Like the Speaker, the majority leader is elected every two years. The majority party selects the majority leader during meetings before the start of a new Congress. The majority leader is second-in-command to the Speaker of the House."}, {"url": "http://fpc.state.gov/documents/organization/159043.pdf", "passage_text": "Party Leaders in the House: Election, Duties, and Responsibilities Congressional Research Service 1 ach major party in the House has a leadership hierarchy. This report summarizes the election, duties, and responsibilities of the Speaker of the House, the majority and minority leaders, and the whips and whip system. "}, {"url": "https://en.wikipedia.org/wiki/Majority_Leader", "passage_text": "In the United States House of Representatives, the majority leader is elected by U.S. Congressmen in the political party holding the largest number of seats in the House. While the responsibilities vary depending upon the political climate, the Majority Leader of the United States House of Representatives typically sets the floor agenda and oversees the committee chairmen."}, {"url": "http://kids.clerk.house.gov/grade-school/lesson.html?intID=39", "passage_text": "House Leadership. The Speaker of the House is the only House leadership position mentioned in the Constitution. Over time, as the United States grew and the membership of the U.S. House of Representatives increased, a need for additional leaders developed. Majority Leader. Like the Speaker, the majority leader is elected every two years. The majority party selects the majority leader during meetings before the start of a new Congress. The majority leader is second-in-command to the Speaker of the House."}, {"url": "http://history.house.gov/People/Office/Majority-Leaders/", "passage_text": "The House of Representatives, with its large membership, has chosen majority and minority leaders since the 19th century to expedite legislative business and to keep their parties united. These leaders are elected every two years in secret balloting of the party caucus or conference. A list of House majority leaders from 1899 to present are available below. /tiles/non-collection/i/im_people_majleader_2002_021_019.xml Collection of the U.S. House of Representatives About this object Sereno Payne of New York chaired the Ways and Means Committee before becoming the House's first Majority Leader."}, {"url": "https://en.wikipedia.org/wiki/House_Majority_Leader", "passage_text": "Party leaders and whips of the United States House of Representatives are elected by their respective parties in a closed-door caucus by secret ballot and are also known as floor leaders. The U.S. House of Representatives does not officially use the term  Minority Leader  although the media frequently does. The current Minority Leader Nancy Pelosi, of the United States House of Representatives serves as floor leader of the opposition party, and is the counterpart to the Majority Leader."}]