[{"url": "http://www.medic8.com/healthguide/food-poisoning/campylobacter-jejuni.html", "passage_text": "Foods which contain the campylobacter bacteria. The worst offender is chicken but it also found in other type of poultry such as turkey, duck and goose. It also occurs in these types of foods: 1  Red meat. 2  Pork. 3  Lamb. 4  Offal, e.g. liver. 5  Shellfish. 6  Eggs. 7  Fresh fruit and vegetables (unwashed)"}, {"url": "http://biology.about.com/od/microbiology/ss/bacteria-in-turkeys.htm", "passage_text": "The United States Department of Agriculture (USDA) is not currently testing turkeys for harmful Campylobacter bacteria. Campylobacter is the most common bacterial cause of diarrhea and a leading cause of food poisoning in the United States. Other symptoms caused by the bacteria include abdominal cramps, nausea, fever, and muscle pain. It's that time of year in the United States when family and friends sit down to a traditional turkey dinner and give thanks."}, {"url": "http://patient.info/health/campylobacter-leaflet", "passage_text": "Campylobacter germs (bacteria) are commonly found in raw meat, particularly raw poultry such as chicken, turkey, etc. Cooking meat thoroughly usually kills the bacteria. Campylobacter may also be found in unpasteurised milk or untreated water (including ice cubes made from untreated water). Campylobacter are a group of germs (bacteria) that are a common cause of food poisoning. Typically, food poisoning causes gastroenteritis, an infection of the gut (intestines), leading to diarrhoea and often being sick (vomiting) too. Campylobacter bacteria are commonly found in raw meat, particularly poultry"}, {"url": "http://www.ewg.org/meateatersguide/superbugs/", "passage_text": "Salmonella bacteria are often found on chicken and turkey that have been contaminated with animal feces. People can also encounter these microbes through cross-contamination-for instance, when salad greens are sliced on a cutting board that has been used to chop raw meat -- or by touching infected birds or reptiles. "}, {"url": "http://www.foodborneillness.com/campylobacter_food_poisoning/", "passage_text": "Any raw poultry may contain Campylobacter, including organic and “free range” products. In fact, studies have found Campylobacter contamination on up to 88 percent of chicken carcasses. Despite the commonness of Campylobacter, however, infections are usually isolated events, and widespread outbreaks are rare. The most common symptom of a Campylobacter infection is diarrhea, which is often bloody. Typical symptoms include: 1  Diarrhea: Diarrhea ranges from mild to severe and is often bloody. 2  Fever. 3  Nausea. 4  Vomiting. 5  Abdominal pain."}, {"url": "https://en.wikipedia.org/wiki/Campylobacter", "passage_text": "The genomes of several Campylobacter species have been sequenced. The first Campylobacter genome to be sequenced was C. jejuni, in 2000. Campylobacter species contain two flagellin genes in tandem for motility, flaA and flaB. These genes undergo intergenic recombination, further contributing to their virulence. Nonmotile mutants do not colonize"}, {"url": "http://biology.about.com/od/microbiology/ss/bacteria-in-turkeys.htm", "passage_text": "Bacteria contamination in the turkey industry is not new. The USDA released a report in 1998 showing that in 1996 and 1997, 90% of the turkeys tested were found to contain Campylobacter and 18% contained Salmonella. Other symptoms caused by the bacteria include abdominal cramps, nausea, fever, and muscle pain. It's that time of year in the United States when family and friends sit down to a traditional turkey dinner and give thanks."}, {"url": "http://patient.info/health/campylobacter-leaflet", "passage_text": "Campylobacter germs (bacteria) are the most common bacteria causing food poisoning in the UK. Campylobacter food poisoning can affect anyone of any age. However, it is more common in certain groups of people. These include: 1  Children under the age of five and adults over the age of 60. Campylobacter are a group of germs (bacteria) that are a common cause of food poisoning. Typically, food poisoning causes gastroenteritis, an infection of the gut (intestines), leading to diarrhoea and often being sick (vomiting) too. Campylobacter bacteria are commonly found in raw meat, particularly poultry"}, {"url": "http://www.marlerblog.com/case-news/does-cargill-have-a-salmonella-turkey-problem/", "passage_text": "Establishment (owned by Hormel), recalled 54,960 pounds of frozen, raw turkey burger products. At the time the Wisconsin Department of Health and Family Services notified FSIS of a patient diagnosed with salmonellosis caused by Salmonella serotype Hadar. However, the talk was also about yet another health advisory by the U.S. Department of Agriculture’s (USDA) Food Safety and Inspection Service (FSIS) that was issued Friday night due to concerns about illnesses caused by Salmonella Heidelberg that may be associated with use and consumption of ground turkey."}]