[{"url": "http://periodic.lanl.gov/4.shtml", "passage_text": "Beryllium is used in nuclear reactors as a reflector or moderator for it has a low thermal neutron absorption cross section. It is used in gyroscopes, computer parts, and instruments where lightness, stiffness, and dimensional stability are required. "}, {"url": "https://www.osha.gov/SLTC/beryllium/index.html", "passage_text": "Beryllium is used industrially in three forms: as a pure metal, as beryllium oxide, and most commonly, as an alloy with copper, aluminum, magnesium, or nickel. Beryllium oxide (called beryllia) is known for its high heat capacity and is an important component of certain sensitive electronic equipment. "}, {"url": "http://www.rsc.org/periodic-table/element/4/beryllium", "passage_text": "Beryllium is also used in nuclear reactors as a reflector or moderator of neutrons. The oxide has a very high melting point making it useful in nuclear work as well as having ceramic applications. Biological role. Beryllium and its compounds are toxic and carcinogenic. At one time it was even thought that beryllium powder would be used as a fuel for rockets on account of the colossal amount of heat which it releases when it is burnt. Now less than 500 tons of metal are refined each year because it is dangerously toxic."}, {"url": "https://en.wikipedia.org/wiki/Beryllium", "passage_text": "Beryllium is a steel gray and hard metal that is brittle at room temperature and has a close-packed hexagonal crystal structure. It has exceptional stiffness (Young's modulus 287 GPa) and a reasonably high melting point. The modulus of elasticity of beryllium is approximately 50% greater than that of steel. Beryllium is found in over 100 minerals, but most are uncommon to rare. The more common beryllium containing minerals include: bertrandite (Be 4 Si 2 O 7 (OH) 2), beryl (Al 2 Be 3 Si 6 O 18), chrysoberyl (Al 2 BeO 4) and phenakite (Be 2 SiO 4). Precious forms of beryl are aquamarine, red beryl and emerald."}, {"url": "http://geology.com/usgs/beryllium/", "passage_text": "Beryllium is almost transparent to x-rays, and beryllium foil is used as window material in x-ray and other radiation machines. In nuclear reactors, beryllium metal and beryllium oxide are used to control fission reactions. Beryllium has also been used in the trigger mechanisms for nuclear weapons. Two minerals, bertrandite and beryl, are mined for beryllium, and both are found in association with igneous rocks. All the beryllium currently being mined in the United States comes from the mineral bertrandite."}, {"url": "http://www.answers.com/Q/What_is_beryllium_used_for", "passage_text": "A longer answer. Beryllium enjoys wide use as an alloying metal. Beryllium-copper is used to make electrical contacts, welding electrodes, non-sparking and non-magnetic tools, and also springs (for examples springs for Swiss watches, from the alloy glycodur) . In its pure form, it is used as a nozzle in some rocket engines. Also beryllium is the brazing metal for components from zirconium alloys (for example in the fabrication of nuclear fuel elements cladding from Zircaloy). This light, strong metal makes for a great window to shoot X-rays and particles or particle streams through."}, {"url": "https://en.wikipedia.org/wiki/Beryllium", "passage_text": "Beryllium alloys are used in many applications because of their combination of elasticity, high electrical conductivity and thermal conductivity, high strength and hardness, nonmagnetic properties, as well as good corrosion and fatigue resistance. Beryllium is found in over 100 minerals, but most are uncommon to rare. The more common beryllium containing minerals include: bertrandite (Be 4 Si 2 O 7 (OH) 2), beryl (Al 2 Be 3 Si 6 O 18), chrysoberyl (Al 2 BeO 4) and phenakite (Be 2 SiO 4). Precious forms of beryl are aquamarine, red beryl and emerald."}, {"url": "http://www.rsc.org/periodic-table/element/4/beryllium", "passage_text": "Uses. Beryllium is used in alloys with copper or nickel to make gyroscopes, springs, electrical contacts, spot-welding electrodes and non-sparking tools. Mixing beryllium with these metals increases their electrical and thermal conductivity. At one time it was even thought that beryllium powder would be used as a fuel for rockets on account of the colossal amount of heat which it releases when it is burnt. Now less than 500 tons of metal are refined each year because it is dangerously toxic."}, {"url": "https://en.wikipedia.org/wiki/Beryllium", "passage_text": "The commercial use of beryllium requires the use of appropriate dust control equipment and industrial controls at all times because of the toxicity of inhaled beryllium-containing dusts that can cause a chronic life-threatening allergic disease in some people called berylliosis. Beryllium is found in over 100 minerals, but most are uncommon to rare. The more common beryllium containing minerals include: bertrandite (Be 4 Si 2 O 7 (OH) 2), beryl (Al 2 Be 3 Si 6 O 18), chrysoberyl (Al 2 BeO 4) and phenakite (Be 2 SiO 4). Precious forms of beryl are aquamarine, red beryl and emerald."}, {"url": "http://clair.si.umich.edu/clair/corpora/chemical/Beryllium", "passage_text": "Beryllium (IPA : /bəˈrɪliəm/) is the chemical element that has the symbol Be and atomic number 4. A bivalent element, elemental beryllium is a steel grey, strong, light-weight yet brittle, alkaline earth metal. It is primarily used as a hardening agent in alloys (most notably beryllium copper). "}]