[{"url": "http://www.thefreedictionary.com/hypnotic", "passage_text": "hypnotic-of or relating to hypnosis. 2. hypnotic-attracting and holding interest as if by a spell; read the bedtime story in a hypnotic voice; she had a warm mesmeric charm; the sheer force of his presence was mesmerizing; a spellbinding description of life in ancient Rome. mesmeric, mesmerizing, spellbinding. hypnotic. adj. 1. (Psychology) of, relating to, or producing hypnosis or sleep. 2. (Psychology) (of a person) susceptible to hypnotism."}, {"url": "https://en.wikipedia.org/wiki/Hypnosis", "passage_text": "Hypnosis is usually induced by a procedure known as a hypnotic induction involving a series of preliminary instructions and suggestions. The use of hypnotism for therapeutic purposes is referred to as  hypnotherapy , while its use as a form of entertainment for an audience is known as  stage hypnosis . Avicenna (980-1037), a Persian Physician, documented the characteristics of the  trance (Hypnotic Trance) state in 1027. At that time hypnosis as a medical treatment was seldom used until the German Doctor, Franz Mesmer, reintroduced it in the 18th Century."}, {"url": "https://en.wikipedia.org/wiki/Hypnosis", "passage_text": "Hypnosis is a state of human consciousness involving focused attention and reduced peripheral awareness and an enhanced capacity for response to suggestion. Theories explaining what occurs during hypnosis fall into two groups. Avicenna (980-1037), a Persian Physician, documented the characteristics of the  trance (Hypnotic Trance) state in 1027. At that time hypnosis as a medical treatment was seldom used until the German Doctor, Franz Mesmer, reintroduced it in the 18th Century."}, {"url": "https://en.wikipedia.org/wiki/Hypnotic", "passage_text": "Hypnotic (from Greek Hypnos, sleep) or soporific drugs, commonly known as sleeping pills are a class of psychoactive drugs whose primary function is to induce sleep and to be used in the treatment of insomnia (sleeplessness), or surgical anesthesia. This group is related to sedatives. When prescribed, hypnotic medication should be used for the shortest period of time possible. Most hypnotics prescribed today are either benzodiazepines or nonbenzodiazepines. Early classes of drugs, such as barbiturates, have fallen out of use in most practices but are still prescribed for some patients."}, {"url": "http://cocktails.about.com/od/liqueurscordials/p/hpnotiq_liqueur.htm", "passage_text": "The Pale Blue Liqueur: Hpnotiq (pronounce like hypnotic) is a beautiful, pale blue liqueur produced in France. It is made of a proprietary (and secret) blend of tropical fruit juices, vodka and Cognac. "}, {"url": "http://www.webmd.com/anxiety-panic/guide/mental-health-hypnotherapy", "passage_text": "A. Hypnosis -- or hypnotherapy -- uses guided relaxation, intense concentration, and focused attention to achieve a heightened state of awareness that is sometimes called a trance. The person's attention is so focused while in this state that anything going on around the person is temporarily blocked out or ignored. Hypnosis is usually considered an aid to psychotherapy (counseling or therapy), because the hypnotic state allows people to explore painful thoughts, feelings, and memories they might have hidden from their conscious minds."}, {"url": "http://www.mayoclinic.org/tests-procedures/hypnosis/basics/definition/PRC-20019177", "passage_text": "At Mayo Clinic, we take the time to listen, to find answers and to provide you the best care. Hypnosis, also referred to as hypnotherapy or hypnotic suggestion, is a trance-like state in which you have heightened focus and concentration. Hypnosis is usually done with the help of a therapist using verbal repetition and mental images. "}, {"url": "http://medical-dictionary.thefreedictionary.com/hypnotic", "passage_text": "hypnotic. 1. causing sleep; called also somniferous. 2. an agent that causes sleep; called also somnifacient. 3. pertaining to or of the nature of hypnosis or hypnotism. "}, {"url": "http://nchypnosis.org/what-is-hypnosis/", "passage_text": "It’s not like what you see in the movies. Hypnosis is a natural state of selective, focused attention, and, even though it is 100% natural and normal, it remains one of the most fascinating phenomena of the human mind. Our ability to enter this unique state of consciousness opens the door to countless possibilities for healing, self-exploration and change"}]