[{"url": "http://www.howmuchisit.org/ficus-tree-cost/", "passage_text": "1 On average a smaller ficus tree will start at around $20 and can cost as much as $300 for a larger tree. 2  For example, a 6 foot silk tree created by Nearly Natural retails for $55 to $80, while a small live tree that comes in a tiny pot retails for $12 to $25."}, {"url": "http://www.howmuchisit.org/ficus-tree-cost/", "passage_text": "1 Look for a store or nursery that sells ficus trees at an affordable price. 2  You can shop around to check for ficus trees that are sold at a lower price. 3  With the help of the internet, this can be an easier task since you will be able to look for one from the comfort of your own home."}, {"url": "http://www.qualitysilkplants.com/silkficustrees.html", "passage_text": "Our silk ficus trees and artificial ficus trees are stunning with vibrantly colored green leaves, They stand strong as one of the most popular trees in the home decor market because of their beauty and balance they bring to any room or office."}, {"url": "http://www.petals.com/artificial-and-silk-trees/silk-ficus-trees", "passage_text": "Stylish silk and artificial ficus trees add a touch of elegance to any decor, with a minimum maintenance solution. Our silk ficus tree collection, like all our lifelike artificial trees, are handcrafted by skilled artisans using the finest, most realistic silk greenery available."}, {"url": "http://www.easternleaf.com/Ficus_Bonsai_Trees_s/89.htm", "passage_text": "You are here: Home Bonsai Trees-Ficus Bonsai Trees. The ficus bonsai tree is a very hardy species of bonsai that easily adapts to many environments. Ficus bonsai trees generally produce broad thick leaves that sprout continuously from the top stems, making the bonsai tree very easy to prune."}, {"url": "http://www.easternleaf.com/Golden_Gate_Ficus_Starter_Kit_p/800500-03-kit.htm", "passage_text": "Like many ficus bonsai trees, the Golden Gate Ficus Bonsai Tree or Taiwan Ficus Bonsai Tree can be kept both indoors and outdoors, and is also one of the most hardy species. It is very popular for its trunk textures and bright green leaves."}, {"url": "http://www.plantclearance.com/ficus-retusa-nitida-indian-laurel-fig-15-gallon-column/", "passage_text": "Click the button below to add the Ficus (retusa) Nitida-Indian Laurel Fig - 15 Gallon Column to your wish list."}, {"url": "http://www.howmuchisit.org/ficus-tree-cost/", "passage_text": "1 The price of this type of ficus tree can cost $50 to $250. 2  For example, live ficus trees can be purchased from 9GreenBox.com. 3  Most of the trees that they sell do not grow exponentially but mostly used as table tops. 4  One of the ficus trees that they sell is the ginseng ficus tree which costs anywhere from $20 to $30."}, {"url": "http://www.howmuchisit.org/ficus-tree-cost/", "passage_text": "1 Ficus trees can be bought from farms and they can be priced differently depending on the location from which you buy the tree. 2  They can be purchased in various sizes with varying ages; this will also affect the price of the ficus tree."}]