[{"url": "http://www.answers.com/Q/How_do_you_know_if_salmon_is_bad", "passage_text": "If it smells bad, it is bad. The fishmonger will rarely try to peddle Salmon as fresh caught to a regular customer for fear of losing repeat business. Check the eye of the fish for clarity, cloudiness indicates poor quality. Do not hesitate to ask the market manager for a smell sample even if you are making a small purchase. If the Fish Smells Fishy reject it. If, god forbid, the question refers to a canned product that smells even slightly off, then toss it and order in a pizza. Trust your nose because if it smells bad, it is."}, {"url": "http://food.onehowto.com/article/how-to-know-if-salmon-has-gone-off-2247.html", "passage_text": "Another characteristic of salmon which has gone off is the presence of dark or white spots on the flesh. The salmon's colour must not only be intense but also uniform. When there are stained pieces along the fillet it is best to not eat it. Difficulty Easy. Salmon tops the list as a favourite amongst oily fish as it is a delicious and nutritious option. Full of important health benefits, it is an excellent source of omega 3 fatty acids and essential oils. However to get the best from this food it is important to consume it fresh."}, {"url": "http://www.ehow.com/how_7261083_tell-salmon-fresh.html", "passage_text": "Smell the fish. A mild smell of the sea is normal, but fresh salmon should not have a strong fishy smell. Examine the flesh of the fish. The flesh should be firm and have a shiny appearance. If the flesh is dull, falling apart or appears to be mushy, then it isn't fresh. Rub the scales on the fish. The scales will rub off easily if the fish isn't fresh. Look at the color of the gills--located just behind the head--if it's a whole fish."}, {"url": "http://food.onehowto.com/article/how-to-know-if-salmon-has-gone-off-2247.html", "passage_text": "If it do not meet these conditions, it is likely that the salmon is not fresh. Once you have ensured that your salmon is good then you can proceed to prepare it. A good trick to preserve salmon when you know you will not use it in the next few days is to freeze it or cure it. Difficulty Easy. Salmon tops the list as a favourite amongst oily fish as it is a delicious and nutritious option. Full of important health benefits, it is an excellent source of omega 3 fatty acids and essential oils. However to get the best from this food it is important to consume it fresh."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20081214082940AAkeIJg", "passage_text": "Place the pan with the salmon into the oven and bake the rest of the way for 6 - 7 minutes. To check the 'doneness' (my word), gently press down on the salmon. If it is mushy feeling, cook it a bit longer. If it is slightly ;springy', it is ready. It is a feel you learn with experience. Best Answer: Salmon is a great fish to pan sear and pop into the oven to continue cooking. Preheat the oven to 400F. Wash fish fillets in cold water and pat dry."}, {"url": "https://answers.yahoo.com/question/index?qid=20060923180217AAgonID", "passage_text": "Report Abuse. Any fish should smell like a fresh ocean breeze, not a fishtank. If it smells fishy or is an odd color, it's bad. To be on the safe side, if you think it tastes funny, you probably shouldn't eat it. Get some pizza instead. "}, {"url": "http://food.onehowto.com/article/how-to-know-if-salmon-has-gone-off-2247.html", "passage_text": "Instructions. One of the quickest ways to know whether salmon has gone off is to assess its appearance. A piece of fresh salmon should have a deep pink or orange colour and under no circumstance should it be pale or dull; if this is the case its freshness is compromised and it should not be eaten. Difficulty Easy. Salmon tops the list as a favourite amongst oily fish as it is a delicious and nutritious option. Full of important health benefits, it is an excellent source of omega 3 fatty acids and essential oils. However to get the best from this food it is important to consume it fresh."}, {"url": "http://www.livestrong.com/article/485432-how-do-i-know-when-salmon-has-gone-bad/", "passage_text": "Always refrigerate or freeze raw salmon. Photo Credit NSritawat/iStock/Getty Images. While fresh salmon is a good source of protein and is rich in healthy omega-3 fatty acids, spoiled salmon can make you sick if you eat it. Before serving your salmon, check to see if it is still edible by examining it thoroughly. Although the shelf life of cooked, canned or smoked salmon is longer than raw salmon, all types of salmon eventually expire."}, {"url": "http://food.onehowto.com/article/how-to-know-if-salmon-has-gone-off-2247.html", "passage_text": "If the piece of salmon that you want to cook smells very strong it is best to get rid of it, thus avoiding possible food poisoning. In cases where you have purchased a complete salmon that still has the head, know that the eyes are a good identifier of its freshness. Difficulty Easy. Salmon tops the list as a favourite amongst oily fish as it is a delicious and nutritious option. Full of important health benefits, it is an excellent source of omega 3 fatty acids and essential oils. However to get the best from this food it is important to consume it fresh."}, {"url": "http://www.livestrong.com/article/485432-how-do-i-know-when-salmon-has-gone-bad/", "passage_text": "If your salmon smells somewhat sour or anything like ammonia, it has gone bad and you need to toss it. Fresh salmon has a mild aroma, or one that smells similar to the sea. Cooked or canned salmon also smells somewhat neutral or mild, while smoked salmon has a pleasant, smoky aroma. Before serving your salmon, check to see if it is still edible by examining it thoroughly. Although the shelf life of cooked, canned or smoked salmon is longer than raw salmon, all types of salmon eventually expire."}]