[{"url": "http://www.history.com/topics/bermuda-triangle", "passage_text": "The Bermuda Triangle is a mythical section of the Atlantic Ocean roughly bounded by Miami, Bermuda and Puerto Rico where dozens of ships and airplanes have disappeared."}, {"url": "http://www.buzzle.com/articles/is-bermuda-triangle-real.html", "passage_text": "Advertisement. Bermuda triangle, also referred to as the Devil's triangle, is a region in the Atlantic Ocean, renowned as a mysterious place owing to the disappearances of a number of aircraft and vessels traveling through it. The demarcated triangle is located off the Bermuda coast, from which it derives the name 'Bermuda triangle'."}, {"url": "http://skepdic.com/bermuda.html", "passage_text": "The Bermuda Triangle (a.k.a. the Devil's Triangle) is a triangular area in the Atlantic Ocean bounded roughly at its points by Miami, Bermuda, and Puerto Rico. Legend has it that many people, ships and planes have mysteriously vanished in this area."}, {"url": "http://gizmodo.com/the-truth-about-the-bermuda-triangle-1507231040", "passage_text": "The Bermuda Triangle is a large area of ocean between Florida, Puerto Rico, and Bermuda. Over the last few centuries, it's thought that dozens of ships and planes have disappeared under mysterious circumstances in the area, earning it the nickname The Devil's Triangle.."}, {"url": "http://www.buzzle.com/articles/is-bermuda-triangle-real.html", "passage_text": "While the disappearances of aircraft and ships in the Atlantic Ocean off the coast of Bermuda has left people wondering whether the Bermuda triangle is real, investigation shows that the entire mystery is nothing, but an over-hyped hoax."}, {"url": "http://www.livescience.com/23435-bermuda-triangle.html", "passage_text": "Also sinisterly known as the Devil's Triangle, the Bermuda Triangle consists of a region in the western part of the North Atlantic Ocean, and is defined by points in Bermuda, Florida and Puerto Rico. It stretches across less than a thousand miles on any one side. Credit: NOAA View full size image."}]