[{"url": "http://www.rothira.com/traditional-ira-vs-roth-ira", "passage_text": "Roth IRAs: 1  Roth contributions (but not earnings) can be withdrawn penalty-and tax-free any time, even before age 59 ½. 2  five tax years after the first contribution, you can withdraw up to $10,000 of Roth earnings penalty-free to pay for qualified first-time homebuyer expenses. "}, {"url": "http://www.investopedia.com/articles/personal-finance/040714/how-use-your-roth-ira-emergency-fund.asp", "passage_text": "2. Only Withdraw Contributions. The key to using a Roth IRA as an emergency fund is to avoid withdrawing any investment earnings. While you can withdraw contributions at any time without penalty, if you withdraw earnings before age 59.5, you will pay a 10% penalty. Following this rule is simple: Don’t withdraw more than you’ve put in."}, {"url": "http://www.sdretirementplans.com/ira-rules/", "passage_text": "Roth IRA. Contributions to a Roth IRA may be withdrawn tax-free at any time – it is a return of already taxed principle. Roth conversions – if you convert a traditional IRA into a Roth IRA, you will pay income taxes based on the converted amount. Also, there is a five-year “seasoning” period. Exactly like the traditional IRA, the maximum contribution limits for a Roth IRA are the same. For the year 2012, contributions cannot exceed $5000, if you are below 50. Participants above 50 can contribute an extra $1000 (catch-up contribution)."}, {"url": "http://fairmark.com/retirement/roth-accounts/roth-distributions/distributions-after-a-roth-ira-conversion/", "passage_text": "Example: You convert your traditional IRA, with a value of $20,000, to a Roth IRA, paying tax on the entire amount. Two years later, when you are under age 59½, you withdraw $5,000 from the Roth IRA, and the distribution comes from conversion money because you haven’t made any regular contributions to your Roth IRA. You convert this IRA to a Roth IRA, paying tax on $6,000. Two years later you make a regular contribution of $2,000 to a different Roth IRA. A year after that, you withdraw $3,000 from the conversion Roth IRA."}, {"url": "http://www.moneycrashers.com/roth-ira-college-savings-education/", "passage_text": "Remember, contributions can be withdrawn at any time. If you withdraw Roth earnings for educational purposes, make sure the account has been open with money in it for at least five years. You will be taxed on the earnings withdrawal, but not assessed a penalty. As an example, consider an example with a father named Dan. "}, {"url": "http://www.rothira.com/roth-ira-withdrawal-rules", "passage_text": "A non-qualified distribution is subject to taxation of earnings and a 10% additional tax unless an exception applies. For Roth IRAs, you can always remove post-tax penalty contributions (also known as basis) from your Roth IRA without penalty. "}, {"url": "https://www.taxact.com/support/1280/ira-or-roth-ira---excess-contributions/", "passage_text": "IRA or Roth IRA-Excess Contributions. If your total IRA contributions (both Traditional and Roth combined) are greater than the allowed amount for the year in your situation, and you have not withdrawn the excess contributions, you must complete Form 5329 to calculate a 6% penalty tax on the excess contribution. Applying excess contributions. If contributions to your Roth IRA for a year were more than the limit, you can apply the excess contribution in one year to a later year if the contributions for that later year are less than the maximum allowed for that year."}, {"url": "http://money.usnews.com/money/blogs/the-smarter-mutual-fund-investor/2012/08/06/can-a-roth-ira-be-your-emergency-fund", "passage_text": "Under Roth IRA rules (check IRS Publication 590 for more information), you can withdraw up to $5,000 without paying taxes on it, and without paying a penalty. Once you dip into your earnings – that $272.50 – the story changes. You can withdraw what you have contributed at anytime, and for any reason. So, if you have contributed $5,000 a year faithfully for the last three years, you now have $15,000 available to you from your Roth IRA. Why a Roth IRA Makes an Attractive Emergency Fund. "}, {"url": "http://fairmark.com/retirement/roth-accounts/roth-distributions/distributions-after-a-roth-ira-conversion/", "passage_text": "As a general rule, you can withdraw your contributions from a Roth IRA at any time without paying tax or penalty. If you withdraw money from a conversion too soon after that event, and before age 59½, you may incur a penalty. You convert this IRA to a Roth IRA, paying tax on $6,000. Two years later you make a regular contribution of $2,000 to a different Roth IRA. A year after that, you withdraw $3,000 from the conversion Roth IRA."}, {"url": "http://www.obliviousinvestor.com/roth-ira-withdrawal-rules/", "passage_text": "Example: During 2011, you contribute $5,000 to a Roth IRA. You also convert $20,000 from a traditional IRA into your Roth IRA. Of that $20,000, $13,000 was taxable upon the conversion, and $7,000 was not because it came from nondeductible IRA contributions. In 2012, you withdraw $8,000 from your Roth."}]