[{"url": "http://www.eurostar.com/uk-en/travel-info/your-trip/check-in", "passage_text": "How far in advance you need to check in depends on what ticket you have. If in doubt, arrive with time to spare and have a croissant. Due to increased passport controls give yourself at least 45 minutes at busy times such as weekends and bank holidays."}, {"url": "https://www.eurotunnel.com/uk/trade/coach-operators/faqs/", "passage_text": "Coaches should arrive at Check-in at least 45 minutes before departure for direct boarding and 90 minutes if you are planning to stop in the Passenger Terminal Building."}, {"url": "http://www.eurotunnel.com/uk/traveller-info/about-my-journey/", "passage_text": "Motorway-to-Motorway Access. From the UK Eurotunnel is easily reached via the M25 and M20. Come off at Junction 11a straight to our Check-in booths. Please check in at least 30 mins and no more than 2 hours before your booked departure time."}, {"url": "http://travel.stackexchange.com/questions/13164/how-early-do-you-need-to-get-to-the-station-for-a-eurostar-service", "passage_text": "For most people, on most services, the minimum checkin time is 30 minutes before departure. If you're travelling on a Business Premier ticket (the really expensive ones), or you have a Eurostar Carte Blanche frequent traveller card (lots of journeys in a year), then the minumum checkin is 10 minutes before."}, {"url": "http://www.delta.com/content/www/en_US/traveling-with-us/check-in/requirements.html", "passage_text": "Overall Requirements. Check-in Requirements for Domestic Travel. The recommended arrival time at the airport is 75 minutes prior to departure when traveling within the United States. You must be checked in at least 30 minutes before your scheduled departure time."}, {"url": "http://traveltips.usatoday.com/time-should-arrive-before-domestic-flight-61227.html", "passage_text": "If you're checking bags,you generally need to have checked in and given your bag to the airline at least 30 minutes before departure. Depending on the airline, some destinations may require checking baggage more than 30 minutes before the flight. For example, if you are flying to New York or Los Angeles on American Airlines, your baggage cutoff time is 45"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20110501131841AAQiQwP", "passage_text": "Best Answer: I would show up at least 3 hours before the flight. You want to give yourself enough time to go through security and get to your gate. Just know that you don't want to show up to late to the gate as the gate can close 20 minutes prior to departure."}, {"url": "http://traveltips.usatoday.com/time-should-arrive-before-domestic-flight-61227.html", "passage_text": "Each airline has its own specific requirements for check-in times, but in general, you need to check in for your flight at least 30 minutes before departure. Many planes begin boarding approximately 30 minutes before takeoff, and if you are not checked in at that time, you risk losing your seat to a standby passenger."}]