[{"url": "http://www.mapsofindia.com/mizoram/tourism/", "passage_text": "Phawngui, also known as the Blue Mountain, is the highest peak of Mizoram and is considered to be the abode of Gods. Phawngpui located in the Chhimtuipui district, is famous for rhododendron and orchids. Mizoram as a destination has much to offer. The Mizos are very friendly and hospitable. English is commonly spoken. The joyful enthusiasm and the gregarious spirit of the local populace has been are the main reasons for establishing some of the most attractive tourism features in this beautiful state."}, {"url": "http://uncyclopedia.wikia.com/wiki/Mizoram", "passage_text": "These are small, regional refuges from climbing and descending. Mizoram's biggest river is Chhimtuipui, also known as Kaladan, also known as Watch out, or you'll — Tribesmen throughout Mizoram swear that everyone upstream pisses into it. Several of the rivers are basically gigantic storm sewers built by the Ass People. One takes a U-turn (known as a come-uppance, by anyone with a full bladder) and goes right back to Assam. Pala Lake (74 acres) is the largest in Mizoram."}, {"url": "https://en.wikipedia.org/wiki/Mizoram", "passage_text": "After annexation by the British in the 1890s, northern part of Mizoram was administered as the Lushai Hills district of Assam, while southern Mizoram was part of Bengal. In 1898, the southern part was transferred from Bengal to Assam. In 1971, the government agreed to convert the Mizo Hills into a Union Territory, which came into being as Mizoram in 1972. Following the Mizoram Peace Accord (1986) between the Government and the MNF, Mizoram was declared a full-fledged state of India in 1987."}, {"url": "http://www.mapsofindia.com/mizoram/tourism/", "passage_text": "Places to Visit in Mizoram. Mizoram, also known as the land of blue mountains, is known for its picturesque beauty. Standing aloof from the adjacent plains of Assam and the other neighbouring states, Mizoram remains an exotic location sharing more than one-third of its boundry with Bangladesh and Mynmar. Mizoram as a destination has much to offer. The Mizos are very friendly and hospitable. English is commonly spoken. The joyful enthusiasm and the gregarious spirit of the local populace has been are the main reasons for establishing some of the most attractive tourism features in this beautiful state."}, {"url": "http://www.nationsonline.org/oneworld/map/google_map_Mizoram.htm", "passage_text": "Largest city and capital of Mizoram is Aizawl (Aijal). The country called the land of the Mizo people has a population of almost 900,000 inhabitants, official language is Mizo (also known as Lushai), a Tibeto-Burman language, and English. Satellite view is showing the Indian state of Mizoram, located in the north-east of India, bordered in west by Bangladesh, in south and east by Myanmar, to the north by the Indian states of Tripura, Assam, and Manipur. Mizoram is a mountainous region which became the 23rd State of the Indian Union in February 1987."}, {"url": "https://en.wikipedia.org/wiki/Mizoram", "passage_text": "Mizoram (English pronunciation: /mɪˈzɔərəm/) is one of the states of Northeast India, with Aizawl as its capital. The name is derived from Mi (people), Zo (Belonging to the people of Mizoram/Lushai Hills) and Ram (land), and thus Mizoram implies land of the hill people. In 1971, the government agreed to convert the Mizo Hills into a Union Territory, which came into being as Mizoram in 1972. Following the Mizoram Peace Accord (1986) between the Government and the MNF, Mizoram was declared a full-fledged state of India in 1987."}, {"url": "http://uncyclopedia.wikia.com/wiki/Mizoram", "passage_text": "Mizoram was formerly known as the hill region of Assam, having rolling hills, and valleys between them. After complaints by Marxist / feminist geographers, it is now known as a land of diverse elevations and tolerance to all levels of altitude-challengedness.. Several of the rivers are basically gigantic storm sewers built by the Ass People. One takes a U-turn (known as a come-uppance, by anyone with a full bladder) and goes right back to Assam. Pala Lake (74 acres) is the largest in Mizoram."}, {"url": "https://en.wikipedia.org/wiki/Mizoram", "passage_text": "About 20% of Mizoram's population lives below poverty line, with 35% rural poverty. The state has about 871 kilometers of national highways, with NH-54 and NH-150 connecting it to Assam and Manipur respectively. It is also a growing transit point for trade with Myanmar and Bangladesh. In 1971, the government agreed to convert the Mizo Hills into a Union Territory, which came into being as Mizoram in 1972. Following the Mizoram Peace Accord (1986) between the Government and the MNF, Mizoram was declared a full-fledged state of India in 1987."}, {"url": "http://www.mizoramonline.in/About/Profile/index.html", "passage_text": "Mizoram has a rich historical entity into its formation with diverse cultures, art & craft forms, dance forms and developed economical life. The history of Mizoram dates back to early 16th century when the tribes known as Mizos were migrated from China and settled in the Shan State. They moved on to Kabaw Valley to Khampat and then to the Chin Hills in the middle of this century. The major parts of the population of Mizoram consist of the ethnic tribes and they are interlinked by means of cultural or linguistic origins. The tribal culture of Mizoram and these ethnic groups of people as a whole are known as Mizos (Mi means ‘people’ and Zo means ‘hill’)."}, {"url": "https://en.wikipedia.org/wiki/Mizoram", "passage_text": "Like several other northeastern states of India, Mizoram was previously part of Assam until 1972, when it was carved out as a Union Territory. It became the 23rd state of India, a step above Union Territory, on 20 February 1987. In 1971, the government agreed to convert the Mizo Hills into a Union Territory, which came into being as Mizoram in 1972. Following the Mizoram Peace Accord (1986) between the Government and the MNF, Mizoram was declared a full-fledged state of India in 1987."}]