[{"url": "https://en.wikipedia.org/wiki/Thoracic_aorta", "passage_text": "The thoracic aorta is a part of the aorta located in the thorax. It is a continuation of the descending aorta and contained in the posterior mediastinal cavity. The thoracic aorta is a continuation of the descending aorta and becomes the abdominal aorta when it passes through the diaphragm. The initial part of the aorta, the ascending aorta, rises out of the left ventricle, from which it is separated by the aortic valve."}, {"url": "https://en.wikipedia.org/wiki/Thoracic_aorta", "passage_text": "The thoracic aorta is part of the aorta, which has different parts named according to their structure or location. The thoracic aorta is a continuation of the descending aorta and becomes the abdominal aorta when it passes through the diaphragm. The initial part of the aorta, the ascending aorta, rises out of the left ventricle, from which it is separated by the aortic valve."}, {"url": "https://www.healthtap.com/topics/tortuous-thoracic-aorta", "passage_text": "I have seen dozens of occasions where the aorta is tortuous or not in the usual position in relation to the diaphragm during these types of hernia repairs. Make sure to see a general or thoracic surgeon with substantial experience in laparoscopic paraesophageal hernia repair for a consultation. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/thoracic-aortic-aneurysm/home/ovc-20122021", "passage_text": "A thoracic aortic aneurysm is a weakened area in the upper part of the aorta. The aorta is the major blood vessel that feeds blood to the body. A thoracic aortic aneurysm may also be called thoracic aneurysm and aortic dissection (TAAD) because an aneurysm can lead to a tear in the artery wall (dissection) that can cause life-threatening bleeding."}, {"url": "http://www.wisegeek.org/what-is-a-tortuous-aorta.htm", "passage_text": "The aorta is the largest blood vessel in the body. It carries freshly oxygenated blood out of the heart so that it can be distributed to the circulatory system. In most people, the aorta follows a relatively straight path, but in people with tortuous aorta, the vessel may be twisted or distorted. @EarlyForest -- Sometimes tortuous aortas can indirectly cause abdominal aortic aneurysms, like pharmchick78 was talking about. Since a tortuous aorta is abnormal, sometimes the wall of the aorta can be weaker, leading to an aortic aneurysm, or, worst case scenario, an aortic aneurysm rupture."}, {"url": "http://www.wisegeek.org/what-is-a-tortuous-aorta.htm", "passage_text": "Some people have a tortuous aorta and experience no ill health effects as a result of their slightly unusual anatomy, while others can experience complications. This condition can be diagnosed with the use of medical imaging studies which reveal the structure of the aorta and other blood vessels in the body. @EarlyForest -- Sometimes tortuous aortas can indirectly cause abdominal aortic aneurysms, like pharmchick78 was talking about. Since a tortuous aorta is abnormal, sometimes the wall of the aorta can be weaker, leading to an aortic aneurysm, or, worst case scenario, an aortic aneurysm rupture."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=8635", "passage_text": "Thoracic aorta: The thoracic aorta is a section of the aorta, the largest artery in the body, within the chest. Specifically, the thoracic aorta is that part of the aorta that starts after the arch of the aorta and runs down to the diaphragm, the great muscle that separates the chest from the abdomen. The thoracic aorta gives off numerous branches that supply oxygenated blood to the chest cage and the organs within the chest. Like the other sections of the aorta (the ascending aorta, aortic arch and abdominal aorta), the thoracic aorta is an arbitrary anatomic entity. The aorta is one continuous conduit that stems from the left ventricle of the heart to carry blood to most of the body"}, {"url": "http://www.wisegeek.org/what-is-a-tortuous-aorta.htm", "passage_text": "A diagram of the structure of the aorta. Surgeons may want to know ahead of time if a patient has a tortuous aorta to help them protect the health of the patient. It is important that a tortuous aorta be noted in the patient's records. @EarlyForest -- Sometimes tortuous aortas can indirectly cause abdominal aortic aneurysms, like pharmchick78 was talking about. Since a tortuous aorta is abnormal, sometimes the wall of the aorta can be weaker, leading to an aortic aneurysm, or, worst case scenario, an aortic aneurysm rupture."}, {"url": "http://www.medhelp.org/posts/Heart-Disease/tortuosity-of-the-aorta/show/394624", "passage_text": "To: 4bopp. The cause can be a congental and/or it can be the result of high blood pressure, or the result of physical changes in the spine and chest wall. It can displace or crowd the space other organs. A twisted or distorted aorta (thoracic) can cause some blockage of blood flow from the narrowing of the aorta. The result would be the same as valvular (aorta) stenosis. If there is severe blockage, it can result in heart failure. "}]