[{"url": "http://www.muskegonhealth.net/programs/health/tb.htm", "passage_text": "Tuberculosis Skin Testing. Skin testing (PPD) for tuberculosis (TB) is available at the public health department. Testing is available Monday, Wednesday, and Friday between noon and 4:30 pm by appointment. Clients receiving a TB test must return to the public health department within 48-72 hours to have the test results checked. Cost for a TB test is currently $19 (subject to change). Medicaid can be billed for the cost of the test, otherwise the fee is due at the time of service. For more information on TB testing, please call the Immunization program at (231) 724-1220. Positive TB Test Results. Positive TB tests are reported to the client's health care provider for appropriate follow-up. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070128110514AAslxM4", "passage_text": "The TB test is NOT a vaccine. It does not protect against TB. It is only designed to identify those individuals who carry the bacterium. Background Information for Tuberculosis (TB) Skin Test (PPD, Mantoux) Worldwide, tuberculosis (TB) is the most common infectious disease. They run from $2 - $122 depending where U have it done. The sites I'm sending U have information for places to consider having the test done at. All this will be at Ur finger tips. Background Information for Tuberculosis (TB) Skin Test (PPD, Mantoux) Worldwide, tuberculosis (TB) is the most common infectious disease. It is estimated that approximately 1/3 of the entire world's population is infected with the bacterium that causes TB"}, {"url": "http://www.howmuchisit.org/tuberculosis-tb-test-cost/", "passage_text": "A tuberculosis test, also known as a TB test, is a skin test that determines if someone has developed an immune response to a bacteria that causes tuberculosis. TB is a common disease that kills more than 3 million people worldwide each year. 1 A visit to your family doctor can see prices ranging anywhere from $75 to as much as $300. 2  Those with health insurance may find the insurance company covers most if not all of the test is. 3  Check with your local health insurance provider to see what is covered. 4  For example, MuskegonHealth.net gives out TB tests for $18"}, {"url": "https://answers.yahoo.com/question/index?qid=20070128110514AAslxM4", "passage_text": "The TB test is NOT a vaccine. It does not protect against TB. It is only designed to identify those individuals who carry the bacterium. http:// Background Information for Tuberculosis (TB) Skin Test (PPD, Mantoux) Worldwide, tuberculosis (TB) is the most common infectious disease. They run from $2 - $122 depending where U have it done. The sites I'm sending U have information for places to consider having the test done at. All this will be at Ur finger tips. Background Information for Tuberculosis (TB) Skin Test (PPD, Mantoux) Worldwide, tuberculosis (TB) is the most common infectious disease. It is estimated that approximately 1/3 of the entire world's population is infected with the bacterium that causes TB"}, {"url": "http://www.howmuchisit.org/tuberculosis-tb-test-cost/", "passage_text": "1 On average, a test can cost anywhere from $10 to $65 at a local health clinic or a lab. 2  These tests are commonly found at health departments, where anyone can get them for a very low rate. 3  A visit to your family doctor can see prices ranging anywhere from $75 to as much as $300. 1 A visit to your family doctor can see prices ranging anywhere from $75 to as much as $300. 2  Those with health insurance may find the insurance company covers most if not all of the test is. 3  Check with your local health insurance provider to see what is covered. 4  For example, MuskegonHealth.net gives out TB tests for $18"}, {"url": "http://www.tspot.com/cost-savings/", "passage_text": "In the 1990s, a published study by Lambert et al. found that the total costs of a tuberculin skin test per healthcare worker tested ranged from $41 – $362.¹ When inflation is factored, that cost rises to $57 – $78 in 2011. Our Cost Comparison Calculator can help you discover the true cost of your current TB screening program, and we’ll show you what 1000 institutions have already seen; how cost-effective EASY TB blood testing can be using the T-SPOT. TB test: 1  Eliminates the costs associated with multiple visits and chasing people down."}, {"url": "http://www.howmuchisit.org/tuberculosis-tb-test-cost/", "passage_text": "The cost of a TB test is going to depend on the doctor, location, and other factors. 1  On average, a test can cost anywhere from $10 to $65 at a local health clinic or a lab. 1 A visit to your family doctor can see prices ranging anywhere from $75 to as much as $300. 2  Those with health insurance may find the insurance company covers most if not all of the test is. 3  Check with your local health insurance provider to see what is covered. 4  For example, MuskegonHealth.net gives out TB tests for $18"}]