[{"url": "http://www.genomenewsnetwork.org/articles/12_01/Parkinsons.shtml", "passage_text": "Parkinson's disease involves decreased levels of dopamine in certain areas of the brain. PET images show differences in F-DOPA levels between a Parkinson patient's brain (right) and a control (left). The Duke researchers saw evidence of genetic linkage to five distinct regions on chromosomes 5, 6, 8, 9, and 17. Chromosome 6 contains the Parkin gene, previously thought to be involved only in the rare early-onset form of the disease."}, {"url": "https://answers.yahoo.com/question/index?qid=20110201174038AA4v6Lc", "passage_text": "Parkinson's disease is a chronic, progressive, degenerative brain disorder characterized by tremors, muscle rigidity and slowed movements. •Parkinson disease 5 (PARK5): Type 5 Parkinson disease is linked to a genetic mutation on chromosome 4p14. Parkinson's disease is a chronic, progressive, degenerative brain disorder characterized by tremors, muscle rigidity and slowed movements. •Parkinson disease 8 (PARK8): Type 8 Parkinson disease is linked to a genetic mutation on chromosome 1p32. This form of the condition tends to progress slowly."}, {"url": "http://www.genomenewsnetwork.org/articles/12_01/Parkinsons.shtml", "passage_text": "In families with late-onset Parkinson's, the strongest overall evidence for linkage was on chromosome 17, near the tau gene, which has been implicated in other degenerative neurological diseases, such as Alzheimer's disease. Previously, tau has not been thought to be involved in the most common form of Parkinson's. The Duke researchers saw evidence of genetic linkage to five distinct regions on chromosomes 5, 6, 8, 9, and 17. Chromosome 6 contains the Parkin gene, previously thought to be involved only in the rare early-onset form of the disease."}, {"url": "http://www.webmd.com/parkinsons-disease/default.htm", "passage_text": "Tremor is often the first symptom that people with Parkinson's disease or their family members notice. At first the tremor may appear in just one arm or leg or only on one side of the body. The tremor also may affect the chin, lips, and tongue. As the disease progresses, the tremor may spread to both sides of the body. Besides tremor, the most common symptoms include: 1  Stiff muscles (rigidity) and aching muscles. 2  One of the most common early signs of Parkinson's is a reduced arm swing on one side when you walk. 3  This is caused by rigid muscles. 4  Rigidity can also affect the muscles of the legs, face, neck, or other part"}, {"url": "http://ghr.nlm.nih.gov/condition/parkinson-disease", "passage_text": "Often the first symptom of Parkinson disease is trembling or shaking (tremor) of a limb, especially when the body is at rest. Typically, the tremor begins on one side of the body, usually in one hand. Tremors can also affect the arms, legs, feet, and face. Some affected individuals develop psychiatric conditions such as depression and visual hallucinations. People with Parkinson disease also have an increased risk of developing dementia, which is a decline in intellectual functions including judgment and memory."}, {"url": "https://answers.yahoo.com/question/index?qid=20110201174038AA4v6Lc", "passage_text": "Parkinson's disease is a chronic, progressive, degenerative brain disorder characterized by tremors, muscle rigidity and slowed movements. •Parkinson disease 9 (PARK9): Type 9 Parkinson disease is linked to a mutation in the ATP13A2 gene on chromosome 1p36. Parkinson's disease is a chronic, progressive, degenerative brain disorder characterized by tremors, muscle rigidity and slowed movements. •Parkinson disease 8 (PARK8): Type 8 Parkinson disease is linked to a genetic mutation on chromosome 1p32. This form of the condition tends to progress slowly."}, {"url": "http://www.webmd.com/parkinsons-disease/default.htm", "passage_text": "Symptoms of Parkinson's disease differ from person to person. They also change as the disease progresses. Symptoms that one person gets in the early stages of the disease, another person may not get until later-or not at all. Symptoms typically begin appearing between the ages of 50 and 60. Besides tremor, the most common symptoms include: 1  Stiff muscles (rigidity) and aching muscles. 2  One of the most common early signs of Parkinson's is a reduced arm swing on one side when you walk. 3  This is caused by rigid muscles. 4  Rigidity can also affect the muscles of the legs, face, neck, or other parts of the body."}, {"url": "https://answers.yahoo.com/question/index?qid=20110201174038AA4v6Lc", "passage_text": "Parkinson's disease is a chronic, progressive, degenerative brain disorder characterized by tremors, muscle rigidity and slowed movements. •Parkinson disease 7, autosomal recessive early-onset (PARK7): Type 7 Parkinson disease is linked to a genetic mutation in the DJ1 gene on chromosome 1p36. Parkinson's disease is a chronic, progressive, degenerative brain disorder characterized by tremors, muscle rigidity and slowed movements. •Parkinson disease 8 (PARK8): Type 8 Parkinson disease is linked to a genetic mutation on chromosome 1p32. This form of the condition tends to progress slowly."}, {"url": "http://www.alz.org/dementia/huntingtons-disease-symptoms.asp", "passage_text": "Huntington's Disease (HD) is a progressive brain disorder caused by a defective gene. This disease causes changes in the central area of the brain, which affect movement, mood and thinking skills. Huntington's disease is a progressive brain disorder caused by a single defective gene on chromosome 4 — one of the 23 human chromosomes that carry a person’s entire genetic code. This defect is dominant, meaning that anyone who inherits it from a parent with Huntington's will eventually develop the disease."}]