[{"url": "https://quizlet.com/17371643/chapter-9-csr-flash-cards/", "passage_text": "According to integrated social contracts theory, universal ethical principles based on the collective views of multiple societies form a social contract that all individuals and organizations have a duty to observe in all situations. "}, {"url": "http://highered.mheducation.com/sites/0078029287/student_view0/chapter9/self-graded_chapter_quiz.html", "passage_text": "11. According to integrated social contracts theory, _______________. the views and principles of the school of ethical universalism are definitely wrong; the correct view is that ethics is a matter of personal responsibility not a matter of management concern. 8. The thesis that because different societies and cultures have divergent values and standards of what is ethically right and ethically wrong it is appropriate to judge behavior as ethical/unethical in the light of local customs and social mores _______________. is the basis for the theory of ethical variation."}, {"url": "https://answers.yahoo.com/question/index?qid=20090407170838AAqmXSr", "passage_text": "Answers. Best Answer: Courtney, I have no idea what it means, but I found this for you: Professors Thomas Donaldson and Thomas Dunfee proposed a version of contract theory for business, which they call Integrative Social Contracts Theory. Ethics in Business and Government class. The book does not explain this term, but I am asked a question about it. I've looked all over the web, but I can't find the definition."}, {"url": "https://en.wikipedia.org/wiki/Social_contract", "passage_text": "(September 2013). In moral and political philosophy, the social contract or political contract is a theory or model, originating during the Age of Enlightenment, that typically addresses the questions of the origin of society and the legitimacy of the authority of the state over the individual. The starting point for most social contract theories is an examination of the human condition absent from any political order that Thomas Hobbes termed the  state of nature . In this condition, individuals' actions are bound only by their personal power and conscience."}, {"url": "http://www.ehow.com/about_5431829_integrative-social-contracts-theory.html", "passage_text": "Integrative Social Contracts Theory is a theory of business ethics originated by Thomas Donaldson and Thomas... 1  The Advantages of a Social Contract Theory. The goal of Integrative Social Contracts Theory is to provide a framework by which managerial and business decisions can be made with respect to their impact on relevant communities, ethical norms and possible universal moral standards."}, {"url": "https://en.wikipedia.org/wiki/Social_contract", "passage_text": "The social contract is an agreement of man with man; an agreement from which must result what we call society. In this, the notion of commutative justice, first brought forward by the primitive fact of exchange, ... is substituted for that of distributive justice ... The starting point for most social contract theories is an examination of the human condition absent from any political order that Thomas Hobbes termed the  state of nature . In this condition, individuals' actions are bound only by their personal power and conscience."}, {"url": "http://www.ehow.com/about_5431829_integrative-social-contracts-theory.html", "passage_text": "Save. Integrative Social Contracts Theory is a theory of business ethics originated by Thomas Donaldson and Thomas Dunfee, and is heavily influenced by the social contracts theories of political philosophers such as Thomas Locke and John Rawls. The goal of Integrative Social Contracts Theory is to provide a framework by which managerial and business decisions can be made with respect to their impact on relevant communities, ethical norms and possible universal moral standards."}, {"url": "http://www.ehow.com/about_5431829_integrative-social-contracts-theory.html", "passage_text": "Integrative Social Contracts Theory. Integrative Social Contracts Theory is a theory of business ethics originated by Thomas Donaldson and Thomas Dunfee, ... The goal of Integrative Social Contracts Theory is to provide a framework by which managerial and business decisions can be made with respect to their impact on relevant communities, ethical norms and possible universal moral standards."}]