[{"url": "http://www.valuepenguin.com/average-cost-life-insurance", "passage_text": "Below you'll find the average cost of life insurance broken out by number of years on the policy. Unsurprisingly so, the longer the policy term the more expensive it is. Average policy costs range from $568 per year for a 10 year term policy to $1,528 for a 30 year term policy. Term life insurance rates are typically the cheapest way for an individual to purchase life insurance coverage. They're significantly cheaper than insuring with a whole life policy and still provide some flexibility. Our charts below detail 10, 20, and 30 year term life policies so you can see the average cost of each. Life Insurance Rates: 10 Year Term. Here we breakdown 10 year term life insurance policies and show you the average annual premiums depending on your level of health and the amount of coverage you're interested in purchasing."}, {"url": "http://www.insure.com/car-insurance/car-insurance-rates.html", "passage_text": "Car insurance rates by state, 2015 edition. By Barbara Marquand, Insure.com-Last updated: April 13, 2015. Michigan has the most expensive car insurance rates in the nation for the second consecutive year, according to the 2015 Insure.com state-by-state comparison of auto insurance premiums. The national average premium for the full-coverage policy featured in the Insure.com study is $1,311 a year, with rates varying widely in states -- from $805 in Maine to $2,476 in Michigan."}, {"url": "http://homeguides.sfgate.com/average-cost-homeowners-insurance-3020.html", "passage_text": "Estimates. According to the Federal Reserve Bureau, the average cost of an annual premium for homeowners insurance is between $300 and $1,000. For most homeowners, the annual costs for a homeowners insurance policy can be estimated by dividing the value of the home by 1,000, then multiplying the result by $3.50."}, {"url": "https://www.statefarm.com/insurance/auto/resources/low-auto-insurance-rates", "passage_text": "1 On average, switching your auto insurance to State Farm will lower your cost by $489 per year. 2  Discounts. 3  Being a good driver, studying hard, and choosing a car with common safety features are just some of the ways you can lower your cost even more. 1 Multi-line savings. 2  If you add homeowners insurance to your auto policy, you could save as much as $696 per year. 3  In addition to lowering the cost of your premiums, using one company for all of your insurance saves you time."}, {"url": "https://www.statefarm.com/insurance/auto/resources/low-auto-insurance-rates", "passage_text": "1 Low auto insurance rates. 2  On average, switching your auto insurance to State Farm will lower your cost by $489 per year. 3  Discounts. 4  Being a good driver, studying hard, and choosing a car with common safety features are just some of the ways you can lower your cost even more. 1 Multi-line savings. 2  If you add homeowners insurance to your auto policy, you could save as much as $696 per year. 3  In addition to lowering the cost of your premiums, using one company for all of your insurance saves you time."}, {"url": "http://www.valuepenguin.com/average-cost-of-homeowners-insurance", "passage_text": "In our first table we've looked at homeowners insurance premiums on both a monthly and annual basis. For additional context we've included how each state stacks up against the average annual premium of $952. Yes No. Homeowners insurance rates continue to rise at a steady rate throughout the United States, up over 50% in the last 10 years alone. And if you're in the market for a policy you might be looking to get an idea of what parts of the country are most and least expensive."}, {"url": "http://www.dfs.ny.gov/consumer/cli_h_cost.htm", "passage_text": "How The Cost Of Life Insurance Is Determined. The premium rate for a life insurance policy is based on two underlying concepts: mortality and interest. A third variable is the expense factor which is the amount the company adds to the cost of the policy to cover operating costs of selling insurance, investing the premiums, and paying claims. Mortality  Life insurance is based on the sharing of the risk of death by a large group of people."}, {"url": "http://www.aaltci.org/long-term-care-insurance-rates/", "passage_text": "High Cost: $3,446. * Average Cost (with preferred health discount): $1,720-per-year. Age 55, standard health rate. Initial policy benefit for EACH is $164,000 based on a Daily benefit of $150 and 3 year benefit period. Coverage value will increase annually because a 3 percent compound inflation growth option was included. According to the 2012 long term care insurance Price Index the costs for LTC insurance can vary significantly. Long Term Care Insurance Rates for Single Age 55. Long Term Care Insurance Rates for Couple Both Age 55. Average Cost: $3,381-per-year (combined)."}]