[{"url": "http://www.mademan.com/mm/rare-blood-types.html", "passage_text": "1 AB Negative. 2  AB Negative is the rarest blood type, and less than a percent of the world's population has this rare blood. 3  There will be slight differences in the rarity of blood types depending on location and country, but generally, this blood type is not seen very often. 1 B Negative is the second rarest type of blood in the world. 2  O Negative. 3  Also very rare, O Negative blood is seen in only in a few people. 4  But unlike other rare blood types, O Negative can be used for red blood cell donations to almost any other blood type in existence."}, {"url": "http://www.wisegeekhealth.com/what-are-some-rare-blood-types.htm", "passage_text": "Within the ABO/Rhesus Group systems which are used to classify most blood types, there are several rare blood types. The rarest is AB-, with less than one percent of the world's population having this blood type. B-and O-are also very rare, each accounting for less than 5% of the world's population. Some of the other antigens used in blood typing include: D Factor, C Factor, E Factor, M Factor, S Factor, Le(a) Factor, K Factor, Fy(a) Factor, Jk(b) Factor, and Fy(b) Factor, among others. This means that someone could have a blood type such as AB-: Fy(b)-, K-."}, {"url": "https://answers.yahoo.com/question/index?qid=20090512051740AAdmRwd", "passage_text": "Assuming you are located in the US, the types and occurrences are as follows. AB+ - 3.4% AB- - 0.6% A+ - 35.7% A- - 6.3% B+ - 8.5% B- - 1.5% O+ - 37.4% O- - 6.6% There is an even rarer type, Bombay blood, that cannot even receive type O, but Bombay type only. This type is very rare, and falls in the hh antigen system. "}, {"url": "http://www.answers.com/Q/In_what_order_are_the_blood_types_for_rarity_like_o_negative_and_positive_b_negative_and_positive_a_negative_and_positive_and_ab_negative_and_positive", "passage_text": "In what order are the blood types for rarity like o negative and positive b negative and positive a negative and positive and ab negative and positive? "}, {"url": "http://www.fastmed.com/health-resources/related-searches/what-is-the-rarest-blood-type", "passage_text": "A blood type is considered rare if fewer than 1 in 1,000 people have them. One of the rarest blood types in the world is Rh-null, which lack any antigens in the Rh system. There are only 9 active donors in the community of rare blood donors that have Rh-null blood. Rh-null is considered a “universal blood” for anyone with a rare blood type within the Rh syst"}, {"url": "http://www.mademan.com/mm/rare-blood-types.html", "passage_text": "1 AB Negative is the rarest blood type, and less than a percent of the world's population has this rare blood. 2  There will be slight differences in the rarity of blood types depending on location and country, but generally, this blood type is not seen very often. 3  B Negative. 1 B Negative is the second rarest type of blood in the world. 2  O Negative. 3  Also very rare, O Negative blood is seen in only in a few people. 4  But unlike other rare blood types, O Negative can be used for red blood cell donations to almost any other blood type in existence."}, {"url": "http://bloodbook.com/rare-chart.html", "passage_text": "Below is a chart of many of the common known rare Blood types most often indexed by Blood banks all over the world. This chart of rare Blood types, is a 'snapshot' of one day in a typical European Blood Bank banking facility. It gives us an idea of donor availability in this Blood center, and units of Blood and Blood product on hand on this typical day, as well as the diversity of Blood types in this example facility. The relatively rarity of this rare Blood type in the rest of the North-American population can result in a shortage of that rare Blood type for patients of African ethnicity, in need of a Blood transfusion."}, {"url": "http://www.redcrossblood.org/learn-about-blood/blood-types", "passage_text": "Blood Types and the Population. O positive is the most common blood type. Not all ethnic groups have the same mix of these blood types. Hispanic people, for example, have a relatively high number of O’s, while Asian people have a relatively high number of B’s. The mix of the different blood types in the U.S. population is:"}, {"url": "https://answers.yahoo.com/question/index?qid=20091020160354AAr0fB3", "passage_text": "Best Answer: Rarest to Most Common... AB-is the rarest B-AB+ A-O- B+ A+ O+ is the most common O blood can be donated to anyone no matter the blood type so it is always in demand. Type A can be given to people with type A and type AB. This is just for my own personal knowledge, I just gave blood for the first time and I was curious of what my blood type is. My results came back and it says my blood type is A+. I also would like to know the order of the blood types that are needed most often."}, {"url": "http://www.redcrossblood.org/learn-about-blood/blood-types", "passage_text": "In addition to the A and B antigens, there is a third antigen called the Rh factor, which can be either present (+) or absent (–). In general, Rh negative blood is given to Rh-negative patients, and Rh positive blood or Rh negative blood may be given to Rh positive patients. 1  The universal red cell donor has Type O negative blood type. 2  The universal plasma donor has Type AB blood type. O positive is the most common blood type. Not all ethnic groups have the same mix of these blood types. Hispanic people, for example, have a relatively high number of O’s, while Asian people have a relatively high number of B’s. The mix of the different blood types in the U.S. population is:"}]