[{"url": "https://en.wikipedia.org/wiki/Mangal_Dosha", "passage_text": "In Hindu astrology, Mangal Dosha is an astrological combination that occurs if Mars (Mangal) is in the 1st, 2nd, 4th, 7th, 8th, or 12th house of the ascendant chart. A person born in the presence of this condition is termed a manglik. Reality: There is only one planet Mars and hence, one can be either a manglik or not.Neither is there less, medium or high level of dosha. Manglik and Karma. Most Indian religions are based on the ‘Karma’ theory and clearly state that no one can escape the results of their own karma."}, {"url": "http://homeneeds.sulekha.com/what-is-manglik-dosha-what-are-its-remedies_565716_blog", "passage_text": "A A+ A++. Manglik Dosha. Mars is one of the most important planets in the astrological constituency and plays a vital role in the event of marriage of an individual. Manglik dosha is a defect is caused by the planet Mars. It is ought to bring bad luck and affect the person very badly. It is also known as Kuja d"}, {"url": "http://astrojyotishi.com/manglik.htm", "passage_text": "This Dosha is found in the kundli or Birth Chart of the Native. A comparative analysis of the Birth Chart, the Moon Chart & the Navamsha is done to conclude whether a person is Manglik or not. Manglik Dosha is also known as Kuja dosh. Mars is a fierce planet and its placement in certain houses results in Kuja dosha. Marriage is considered as one of the most auspicious ceremony. In hindi the word Manglik denotes auspiciousness. Hence a dosha makes the even inauspicious or causes problems in this event."}, {"url": "https://en.wikipedia.org/wiki/Mangal_Dosha", "passage_text": "There is a belief that the negative consequences for a single-manglik marriage can be resolved if the manglik first performs a ceremony called a kumbh vivah, in which the manglik marries a banana tree, a peepal tree, or a silver or gold idol of the Hindu God Vishnu. Reality: There is only one planet Mars and hence, one can be either a manglik or not.Neither is there less, medium or high level of dosha. Manglik and Karma. Most Indian religions are based on the ‘Karma’ theory and clearly state that no one can escape the results of their own karma."}, {"url": "http://homeneeds.sulekha.com/what-is-manglik-dosha-what-are-its-remedies_565716_blog", "passage_text": "Manglik dosha is formed when the planet Mars in placed in the 1st, 4th, 7th, 8th and 12th houses of an individual’s birth horoscope chart. When the planet is in the 7th house, it is the most dangerous position to be in since it could affect the person’s marriage at the worst levels. Mars is one of the most important planets in the astrological constituency and plays a vital role in the event of marriage of an individual. Manglik dosha is a defect is caused by the planet Mars. It is ought to bring bad luck and affect the person very badly."}, {"url": "http://www.ganeshaspeaks.com/article/MANGAL-DOSHA-SIGNIFICANCE.action", "passage_text": "The placement of ‘Mangal’ (Mars) in the horoscope is the main parameter for consideration of ‘Manglik dosha’. A person can be considered ‘Manglik’ if Mars is placed in his horoscope in the ‘Lagna’ (Ascendant), the Fourth House, the Seventh House, the Eighth House or the Twelfth House. Some astrologers and astrological texts consider the Second House also for judging ‘Manglik dosha’. "}, {"url": "http://astrojyotishi.com/manglik.htm", "passage_text": "Kuja Dosha is formed when Mars is placed in the 1st, 4th, 7th, 8th, 12th house from the ascendant (lagna), Chandra lagna (moon sign) in lagna horoscope, Chandra horoscope or navmansha horoscope. The highest degree of this dosh is formed when mars is placed in ascendant or the seventh house. Mars is a fierce planet and its placement in certain houses results in Kuja dosha. Marriage is considered as one of the most auspicious ceremony. In hindi the word Manglik denotes auspiciousness. Hence a dosha makes the even inauspicious or causes problems in this event."}, {"url": "http://astrologernitinvyas.com/?p=7", "passage_text": "Let us start by trying to understand who is a manglik. As per Vedic Astrology a horoscope has 12 houses and if in Planet Mars (Managal Grah) is placed in 1 st ,2 nd ,4 th ,7 th ,8 th or 12 th house, then the person is said to be manglik. "}, {"url": "http://www.vedicscholar.com/kuja.php", "passage_text": "Manglik/Kuja Dosha In Vedic Astrology. Mars has a special place in vedic astrology when it comes to marital affairs. Manglik or Kuja dosha is one of the most dreaded dosha in the vedic chart. A number of people get married late because of this dosha as it takes them a long time to find the match (who also have the same dosha)."}, {"url": "http://www.bollywoodshaadis.com/articles/truth-about-being-born-a-manglik-2439", "passage_text": "According to Vedic astrology, a person is a Manglik or has active Mangal Dosha in his or her horoscope, if the planet Mars is placed in either 1 st, 2 nd, 4 th, 7 th, 8 th or 12 th house of their lunar chart. "}]