[{"url": "http://drugs.webmd.boots.com/drugs/drug-51-Betahistine.aspx", "passage_text": "1 Betahistine is used to relieve vertigo or dizziness, ringing in the ears (tinnitus) and the symptoms of Menieres ménières disease which is a disorder of the inner. 2  Ear it is a histamine, analogue which is very similar to the natural substance.  histamine Betahistine should be used with caution in: 1  patients with a stomach ulcer or who have previously had a stomach ulcer. 2  people with asthma. 3  people with an intolerance to certain sugars."}, {"url": "http://drugs.webmd.boots.com/drugs/drug-51-Betahistine.aspx", "passage_text": "1 It is used to improve blood flow in the inner ear which lowers the build up of pressure. 2  In general this drug is used to treat dizziness (vertigo), ringing in the ears (tinnitus) and to treat hearing loss suffered by people with Menieres ménières.  disease Betahistine should be used with caution in: 1  patients with a stomach ulcer or who have previously had a stomach ulcer. 2  people with asthma. 3  people with an intolerance to certain sugars."}, {"url": "http://www.internationaldrugmart.com/betaserc.shtml", "passage_text": "Generic Name: Betahistine. Generic for Betaserc* (Betahistine) is used to treat dizziness (vertigo), tinnitus, and hearing problems associated with Meniere's disease. This medicine may also be used to treat other conditions as determined by your doctor. If any side effects of Generic for Betaserc* develop or change in intensity, the doctor should be informed as soon as possible. Generic for Betaserc* can cause side effects such as headache, nausea, and stomach upset. This is not a complete list of all side effects. Do concur with your doctor and follow his directions completely when you are taking Generic for Betaserc*"}, {"url": "https://en.wikipedia.org/wiki/Betahistine", "passage_text": "Chemistry [edit]. Betahistine chemically is 2-[2-(methylamino)ethyl]pyridine, and is formulated as the dihydrochloride salt. Its structure closely resembles that of phenethylamine and histamine. It is rapidly and completely absorbed. The mean plasma half-life is 3–4 hours, and excretion is virtually complete in the urine within 24 hours. Plasma protein binding is very low. Betahistine is transformed into aminoethylpyridine and hydroxyethylpyridine and excreted with the urine as pyridylacetic acid."}, {"url": "http://www.medicine-online.org/index.php?id_product=1879&controller=product&id_lang=1", "passage_text": "The active ingredient in this medicine is betahistine. It is assumed that by increasing the blood flow to the inner ear, resulting in a decrease in the strength and frequency of attacks of vertigo; reduces noise in the ears; slow or stop hearing loss, especially when you take timely treatment. More details. Quantity: This product is not sold individually."}, {"url": "http://www.internationaldrugmart.com/betahistine.shtml", "passage_text": "Betahistine is used to treat dizziness (vertigo), tinnitus, and hearing problems associated with Meniere's disease. This medicine may also be used to treat other conditions as determined by your doctor. If your physician has instructed or directed you to take Betahistine medication in a regular schedule and you have missed a dose of this medicine, take it as soon as you remember. However, if it is almost time for your next dose, then skip the missed dose and go back to your regular dosing schedule."}, {"url": "https://www.patientslikeme.com/treatments/show/8588-betaserc-side-effects-and-efficacy?brand=t", "passage_text": "Betaserc is an international brand name of betahistine used for the treatment of Meniere's disease (to decrease episodes of vertigo). PatientsLikeMe would like to remind you that your browser is out of date and many features of the website may not function as expected. Please update your browser for more security and a better experience."}, {"url": "http://drugs.webmd.boots.com/drugs/drug-51-Betahistine.aspx", "passage_text": "1 In general this drug is used to treat dizziness (vertigo), ringing in the ears (tinnitus) and to treat hearing loss suffered by people with Menieres ménières. 2  Disease benefits of being on this drug can include relief from dizziness and ringing in the.  ears Betahistine should be used with caution in: 1  patients with a stomach ulcer or who have previously had a stomach ulcer. 2  people with asthma. 3  people with an intolerance to certain sugars."}, {"url": "https://en.wikipedia.org/wiki/Betahistine", "passage_text": "Betahistine dihydrochloride (brand names Veserc, Serc, Hiserk, Betaserc) is an anti-vertigo drug. It was first registered in Europe in 1970 for the treatment of Meniere'ménière s. Disease it is commonly prescribed to patients with balance disorders or to alleviate vertigo symptoms associated With'meniere ménière. s disease It is rapidly and completely absorbed. The mean plasma half-life is 3–4 hours, and excretion is virtually complete in the urine within 24 hours. Plasma protein binding is very low. Betahistine is transformed into aminoethylpyridine and hydroxyethylpyridine and excreted with the urine as pyridylacetic acid."}]