[{"url": "http://researchmaniacs.com/Demonyms/Countries/WhatDoYouCallPeopleFromTurkey.html", "passage_text": "What do you call someone from Turkey? In other words, what are people from Turkey called? A person from Turkey and/or a citizen of Turkey is called Turkish. You may also be interested in what people from Turkey speak? The language that people speak in Turkey is Turkish. Okay, now that you know what people from Turkey are called and you know what language they speak, you may want to learn more about the people of Turkey. Here is more information about the country of Turkey."}, {"url": "http://www.answers.com/Q/What_are_people_from_turkey_called", "passage_text": "But the name of the country is Tuerkiye türkiye In.Turkish you can find many turkeys in turkey but they are not From. Turkey The french call … the m dinde which translates as From. India The turks also thought they came From india and (therefor as noted) above called Them (hindi From). india The country is called Turkey because it's home to the Turks. When European settlers arrived in America, they encountered turkeys, which they mistook for being a guineaufowl."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20111010190944AAOYJJl", "passage_text": "Best Answer: it is people's mistake to call it turkey, the real name is TURKIYA, like russia, english speaking people cant pronounce it and simply say turkey! it is to be an idiot. they dont want to learn the real name. the equal word for turkey is hindushka. in some rural places people call it hashtarkhan! Source(s): To add to that, turkeys are called hindi. To answer your second question, turkeys are birds...to make it more clear they are animals. If a cannibal is one who eats the flesh of other human beings, you tell me if that makes them cannibals."}, {"url": "http://www.funtrivia.com/askft/Question97253.html", "passage_text": "1 vote Vote for this answer. Turks. Article 66 of the Turkish Constitution defines a Turk as anyone who is bound to the Turkish state through the bond of citizenship; therefore, the legal use of the term Turkish as a citizen of Turkey is different from the ethnic definition. The Turks today are a nation in the meaning of an ethnos, defined by possessing Turkish culture and having a Turkish mother tongue, rather than by citizenship, race, religion or by being subjects of any particular state."}, {"url": "https://en.wikipedia.org/wiki/Turkish_people", "passage_text": "Turkish people (Turkish: Tuerk türk), Milleti (Turks: Turkish) tuerkler Türkler Or (Anatolian: Turks Turkish) anadolu tuerkleri Türkleri are a. Turkic ethnic group they are mostly made Up of assimilated anatolian populations and are Native to The. Republic of turkey they are also the most numerous ethnic Group among. the turkic peoples ^ f: In addition to Turkish citizens, this figure includes people with ancestral background related to Turkey, so it includes ethnic minorities of Turkey. ^ g: This figure only includes Turks of Western Thrace."}, {"url": "http://www.answers.com/Q/What_are_people_from_turkey_called", "passage_text": "The fact that the word turkey refers to both a country (Turkey) and a bird (turkey) in English is completely incidental. Turkey was not named after turkeys or vice versa. Tu … rkey is just the English version of the Turkish name Tuerkiye, türkiye literally: Meaning land of The tuerk. Türk People. regina murphy The country is called Turkey because it's home to the Turks. When European settlers arrived in America, they encountered turkeys, which they mistook for being a guineaufowl."}, {"url": "https://en.wikipedia.org/wiki/Turkish_people", "passage_text": "Turkish people (Turkish: Tuerk türk), Milleti (Turks: Turkish) tuerkler Türkler Or (Anatolian: Turks Turkish) anadolu tuerkleri Türkleri are a. Turkic ethnic group they are mostly made Up of assimilated anatolian populations and are Native to The. republic of turkey ^ f: In addition to Turkish citizens, this figure includes people with ancestral background related to Turkey, so it includes ethnic minorities of Turkey. ^ g: This figure only includes Turks of Western Thrace."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20111010190944AAOYJJl", "passage_text": "Report Abuse. FYI Turkish people are known as Turks and are from Tuerkiye. Türkiye to add to, that turkeys are called. Hindi to answer your second, question turkeys are...birds to make it more clear they are. Animals if a cannibal is one who eats the flesh of other human, beings you tell me if that makes them. cannibals To add to that, turkeys are called hindi. To answer your second question, turkeys are birds...to make it more clear they are animals. If a cannibal is one who eats the flesh of other human beings, you tell me if that makes them cannibals."}, {"url": "https://en.wikipedia.org/wiki/Turkish_people", "passage_text": "The Turkish language also known as Istanbul Turkish is a southern Oghuz branch of the Turkic languages. It is natively spoken by the Turkish people in Turkey, Balkans, the island of Cyprus, Meskhetia, and other areas of traditional settlement that formerly, in whole or part, belonged to the Ottoman Empire. Turkish is the official language of Turkey. ^ f: In addition to Turkish citizens, this figure includes people with ancestral background related to Turkey, so it includes ethnic minorities of Turkey. ^ g: This figure only includes Turks of Western Thrace."}]