[{"url": "http://assets.aarp.org/external_sites/caregiving/options/nursing_home_costs.html", "passage_text": "What it Costs Brace yourself. Most people already know nursing home care can be expensive. Although the average cost is more than $50,000 a year and climbing, it can vary widely depending on where you live. Employee health insurance does not pay for nursing home care. About a third of nursing home residents pay all of their nursing home costs from their own funds"}, {"url": "http://www.nolo.com/legal-encyclopedia/when-will-medicaid-pay-nursing-home-assisted-living.html", "passage_text": "Income Limits. Most states have more flexible income guidelines for Medicaid reimbursement of long-term care. In most states, you can make up to 300% of the SSI income limit and still qualify for nursing-home-only Medicaid. 300% of the SSI limit is $2,130 per month in 2013. Income guidelines for Medicaid may also vary according to the type of long-term care you are seeking"}, {"url": "http://www.aplaceformom.com/canada/how-to-pay-for-senior-housing", "passage_text": "According to the Canada Mortgage and Housing Corporation's 2013 Seniors' Housing Report, the average monthly cost of a private one bedroom or bachelor unit that includes at least one meal per day was $1,995. The average monthly cost for private pay heavy care spaces was $3,477 across all unit types. "}, {"url": "http://www.anythingresearch.com/industry/Retirement-Nursing-Homes.htm", "passage_text": "Download now: The total U.S. market size for the Retirement & Nursing Homes industry: statistics cover all companies, both public and private. In addition to total revenue, the industry research provides details on employees, companies, and average firm size in the sector. Research products and services in the Retirement & Nursing Homes industry generating sales. Note that products are broken into categories with different levels of classification. Market Size by State ($ millions) indicates how the industry's competition is distributed throughout the country."}, {"url": "http://money.usnews.com/money/blogs/on-retirement/2014/07/22/12-baby-boomer-retirement-trends", "passage_text": "The average income for those between ages 65 and 69 is $37,200, but drops to a little less than $20,000 for those over age 80. The main sources of income for people over 65 are Social Security (37 percent), income from working (30 percent), pensions (19 percent) and savings and investments (11 percent). "}, {"url": "http://money.cnn.com/2013/04/09/retirement/nursing-home-costs/index.html", "passage_text": "The cost of living at a nursing home has soared to a new high of more than $80,000 per year. Over the past five years, the median annual cost of private nursing home care has jumped 24% from $67,527 to $83,950, according to Genworth's 2013 Cost of Care Survey, based on data from nearly 15,000 long-term care providers. From 2012 to 2013 alone, the price climbed 4%."}, {"url": "http://www.anythingresearch.com/industry/Retirement-Nursing-Homes.htm", "passage_text": "Statistics break down facts about companies within the market. In 2014, the federal government spent a total of $217,640 on Retirement & Nursing Homes. It has awarded 24 contracts to 6 companies, with an average value of $36,273 per company. Research products and services in the Retirement & Nursing Homes industry generating sales. Note that products are broken into categories with different levels of classification. Market Size by State ($ millions) indicates how the industry's competition is distributed throughout the country."}, {"url": "http://health.usnews.com/health-news/best-nursing-homes/articles/2013/02/26/how-to-pay-for-nursing-home-costs", "passage_text": "A semi-private room ran $222 daily, or more than $81,000 per year. And the average nursing home stay is 835 days, or more than two years, according to the government's latest National Nursing Home Survey. Costs widely vary from person to person, both because of geographical difference in rates and because each resident's length of stay differs. A majority of people over age 65 will require some type of long-term care services during their lifetime, and over 40 percent of people will need a period of care in a nursing home, according to the Centers for Medicare and Medicaid Services."}, {"url": "http://www1.salary.com/Staff-Nurse-RN-Nursing-Home-salary.html", "passage_text": "For example the median expected annual pay for a typical Staff Nurse-RN-Nursing Home in the United States is $55,993, so 50% of the people who perform the job of Staff Nurse-RN-Nursing Home in the United States are expected to make less than $55,993. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. "}, {"url": "http://www1.salary.com/Nursing-Director-Nursing-Home-salary.html", "passage_text": "For example the median expected annual pay for a typical Nursing Director-Nursing Home in the United States is $99,032, so 50% of the people who perform the job of Nursing Director-Nursing Home in the United States are expected to make less than $99,032. Source: HR Reported data as of October 2015. 1  Salary. "}]