[{"url": "https://en.wikipedia.org/wiki/Liposome", "passage_text": "A liposome is a spherical vesicle having at least one lipid bilayer. The liposome can be used as a vehicle for administration of nutrients and pharmaceutical drugs. Liposomes can be prepared by disrupting biological membranes (such as by sonication). Liposomes are most often composed of phospholipids, especially phosphatidylcholine, but may also include other lipids, such as egg phosphatidylethanolamine, so long as they are compatible with lipid bilayer structure. A liposome design may employ surface ligands for attaching to unhealthy tissue"}, {"url": "http://www.biology-online.org/dictionary/Liposomes", "passage_text": "Liposomes are being developed as an approach for drug delivery in which relatively toxic drugs, e.g., amphotericin b, doxorubicin, and pentavalent antimony, are wrapped inside a liposome and tagged with an organ-specific antibody. Please contribute to this project, if you have more information about this term feel free to edit this page. This page was last modified on 3 October 2005, at 21:16.This page has been accessed 7,855 times. What links here | Related changes | Permanent link"}, {"url": "http://www.thefreedictionary.com/liposome", "passage_text": "liposome-an artificially made microscopic vesicle into which nucleic acids can be packaged; used in molecular biology as a transducing vector. vesicle, cyst-a small anatomically normal sac or bladderlike structure (especially one containing fluid). lip·o·some. n. A microscopic artificial vesicle consisting of an aqueous core enclosed in phospholipid molecules, used to convey vaccines, drugs, or other substances to target tissues. lip′o·so′mal adj."}, {"url": "http://www.thefreedictionary.com/liposome", "passage_text": "liposome. n. 1. (Biochemistry) a particle formed by lipids, consisting of a double layer similar to a natural biological membrane, enclosing an aqueous compartment. lip·o·some. n. A microscopic artificial vesicle consisting of an aqueous core enclosed in phospholipid molecules, used to convey vaccines, drugs, or other substances to target tissues. lip′o·so′mal adj."}, {"url": "http://www.encyclopedia.com/topic/liposome.aspx", "passage_text": "© A Dictionary of Biology 2004, originally published by Oxford University Press 2004. liposome A microscopic spherical membrane-enclosed vesicle or sac (20–30 nm in diameter) made artificially in the laboratory by the addition of an aqueous solution to a phospholipid gel. The membrane resembles a cell membrane and the whole vesicle is similar to a cell organelle. liposome (lī´pəsōm´, lĬp´ə–) , microscopic, fluid-filled pouch whose walls are made of layers of phospholipids identical to the phospholipids that make up cell membranes."}, {"url": "https://en.wikipedia.org/wiki/Liposome", "passage_text": "A liposome has an aqueous solution core surrounded by a hydrophobic membrane, in the form of a lipid bilayer; hydrophilic solutes dissolved in the core cannot readily pass through the bilayer. Hydrophobic chemicals associate with the bilayer. Liposomes can be prepared by disrupting biological membranes (such as by sonication). Liposomes are most often composed of phospholipids, especially phosphatidylcholine, but may also include other lipids, such as egg phosphatidylethanolamine, so long as they are compatible with lipid bilayer structure. A liposome design may employ surface ligands for attaching to unhealthy tissue"}, {"url": "http://biology.about.com/od/molecularbiology/ss/phospholipids.htm", "passage_text": "The phosphate group and polar head region of the molecule is hydrophillic (attracted to water), while the fatty acid tail is hydrophobic (repelled by water). When placed in water, phospholipids will orient themselves into a bilayer in which the non-polar tail region faces the inner area of the bilayer. The polar head region faces outward and interacts with the water. Phospholipids. A phospholipid is composed of two fatty acids, a glycerol unit, a phosphate group and a polar molecule. Photo Credit: Image credit: Ties van Brussel / Tiesworks.nl."}]