[{"url": "http://study.com/academy/lesson/anaerobic-respiration-lactic-acid-alcoholic-fermentation.html", "passage_text": "However, there are times when cells undergo anaerobic cellular respiration, or a process that does not use oxygen to convert food into energy. Your muscles' cells, when deprived of air, will use anaerobic cellular respiration. Without oxygen, these cells only undergo glycolysis and produce 2 ATP per glucose molecule. Next, they need to reduce pyruvate to regenerate NAD+ from NADH + H+. Fermentation is the process that performs this job. In lactic acid fermentation, pyruvate is reduced to lactic acid. This occurs in cells such as our muscles when we're exercising. In alcoholic fermentation, pyruvate is reduced to alcohol and releases carbon dioxide"}, {"url": "https://en.wikipedia.org/wiki/Lactic_acid_fermentation", "passage_text": "Lactic acid fermentation is a biological process by which glucose and other six-carbon sugars (also, disaccharides of six-carbon sugars, e.g. sucrose or lactose) are converted into cellular energy and the metabolite lactate. Lactic acid fermentation is also used in the production of sauerkraut. The main type of bacteria used in the production of sauerkraut is of the genus Leuconostoc. As in yogurt, when the acidity rises due to lactic acid-fermenting organisms, many other pathogenic microorganisms are killed."}, {"url": "http://www.diffen.com/difference/Aerobic_Respiration_vs_Anaerobic_Respiration", "passage_text": "Diffen › Science › Biology. Aerobic respiration, a process that uses oxygen, and anaerobic respiration, a process that doesn't use oxygen, are two forms of cellular respiration. Although some cells may engage in just one type of respiration, most cells use both types, depending on an organism's needs. Anaerobic respiration is respiration without oxygen; the process uses a respiratory electron transport chain but does not use oxygen as the electron acceptors."}, {"url": "http://www.biology-questions-and-answers.com/cell-respiration.html", "passage_text": "4. Some cells that usually obtain energy from aerobic cellular respiration can use fermentation when oxygen is not available. There are bacteria and fungi that, in the absence of oxygen, use their anaerobic metabolic capability for energy supply. Muscle cells also use fermentation when oxygen is scarce."}, {"url": "http://study.com/academy/lesson/anaerobic-respiration-lactic-acid-alcoholic-fermentation.html", "passage_text": "When in an anaerobic environment, some cells can use glycolysis and fermentation to keep producing ATP. Lactic acid fermentation happens in our muscle cells when we are exercising feverishly, while alcoholic fermentation is used in yeast cells and is what leads to beer, bread, and wine. Without oxygen, these cells only undergo glycolysis and produce 2 ATP per glucose molecule. Next, they need to reduce pyruvate to regenerate NAD+ from NADH + H+. Fermentation is the process that performs this job. In lactic acid fermentation, pyruvate is reduced to lactic acid. This occurs in cells such as our muscles when we're exercising. In alcoholic fermentation, pyruvate is reduced to alcohol and releases carbon dioxid"}, {"url": "https://answers.yahoo.com/question/index?qid=20111030220608AAETJlt", "passage_text": "In animal cells (like humans) anaerobic respiration happens mostly on muscle cells through a process called Fermentation that happens outside the Mitochondria. The end products of this process are ATP (less than in aerobic respiration) and Lactic acid. Best Answer: Anaerobic respiration occurs in muscle cells when they do not have access to enough oxygen to complete aerobic respiration to generate all the ATP they need. In human muscle cells, the end product is lactate/lactic acid. Source(s): coolanswerer · 4 years ago"}, {"url": "https://en.wikipedia.org/wiki/Lactic_acid_fermentation", "passage_text": "In homolactic fermentation, one molecule of glucose is ultimately converted to two molecules of lactic acid. Heterolactic fermentation, in contrast, yields carbon dioxide and ethanol in addition to lactic acid, in a process called the phosphoketolase pathway. Lactic acid fermentation is also used in the production of sauerkraut. The main type of bacteria used in the production of sauerkraut is of the genus Leuconostoc. As in yogurt, when the acidity rises due to lactic acid-fermenting organisms, many other pathogenic microorganisms are killed."}]