[{"url": "http://explorehealthcareers.org/en/Career/29/Diagnostic_Medical_Sonographer", "passage_text": "Overview. Diagnostic medical sonographers use sound waves to generate images used for assessing and diagnosing various medical conditions. Many people associate sonography with pregnancy. It's how a fetus can be seen in the womb. "}, {"url": "http://www.healthpronet.org/ahp_month/08_06.html", "passage_text": "Sonography is a diagnostic medical procedure that uses high frequency sound waves to produce dynamic visual images of organs, tissues, or blood flow inside the body. This type of procedure is called a sonogram. "}, {"url": "http://money.usnews.com/careers/best-jobs/diagnostic-medical-sonographer/salary", "passage_text": "Best Paying Cities for Diagnostic Medical Sonographers. The highest paid in the diagnostic medical sonographer profession work in the metropolitan areas of Oakland, California, San Francisco, and San Jose, California. The Santa Rosa, California area also pays well, as does the city of Vallejo, California."}, {"url": "http://study.com/articles/How_to_Become_a_Diagnostic_Medical_Sonographer.html", "passage_text": "Diagnostic medical sonographers use sophisticated equipment to project sound waves into patients' bodies and create images of their tissues for medical diagnostic purposes. Sonographers can choose from several specialization options, including abdomen, breast, vascular and cardiac sonography. How to Become a Diagnostic Medical Sonographer. Learn how to become a diagnostic medical sonographer. Research the job description, education and licensing requirements to find out how to start a career in medical"}, {"url": "http://www.wisegeek.com/what-does-a-sonographer-do.htm", "passage_text": "A diagnostic medical sonographer is a professional who uses special equipment that depicts images of the inside of the human body. Those images are then displayed on a monitor and used by physicians to make diagnoses. "}, {"url": "http://money.usnews.com/careers/best-jobs/diagnostic-medical-sonographer", "passage_text": "Is it a boy or a girl? As a diagnostic medical sonographer, you could be the one answering this or a host of other life-changing medical questions with the help of ultrasound technology. Beyond babies, sonograms are used to help diagnose other medical conditions by creating images of body organs and tissues. "}, {"url": "http://www.bls.gov/ooh/Healthcare/Diagnostic-medical-sonographers.htm", "passage_text": "Employment of diagnostic medical sonographers and cardiovascular technologists and technicians, including vascular technologists is projected to grow 39 percent from 2012 to 2022, much faster than the average for all occupations. Diagnostic medical sonographers and cardiovascular technologists and technicians, including vascular technologists, need formal education, such as an associate’s degree or a postsecondary certificate. Many employers also require professional certification."}, {"url": "http://www.innerbody.com/careers-in-health/becoming-sonographer.html", "passage_text": "A sonographer uses high frequency sound waves to create detailed images of various areas of the human anatomy. The sound waves bounce off of internal organs and return to an ultrasound device, which transforms them into real-time images. "}, {"url": "http://www.ibuzzle.com/articles/what-does-a-diagnostic-medical-sonographer-do.html", "passage_text": "What Does a Diagnostic Medical Sonographer Do. Sonography or ultrasound is a technology which uses sound waves of high frequency to detect abnormalities in the body. These waves are capable of penetrating the body and reaching the soft tissues underneath. A computer image is then produced on the screen, which depicts the interiors of the body. Medical sonographers can work in various medical settings such as hospitals, physician's offices, scanning centers etc. As mentioned above, the different job responsibilities of a sonographer include handling equipment, taking images, analyzing results and providing appropriate clinical data for diagnostic purposes."}, {"url": "http://www.bls.gov/ooh/Healthcare/Diagnostic-medical-sonographers.htm", "passage_text": "Diagnostic medical sonographers and cardiovascular technologists and technicians, including vascular technologists, operate special imaging equipment to create images or conduct tests. The images and test results that diagnostic imaging workers produce help physicians assess and diagnose medical conditions. Diagnostic medical sonographers and cardiovascular technologists and technicians, including vascular technologists, need formal education, such as an associate’s degree or a postsecondary certificate. Many employers also require professional certification."}]