[{"url": "http://psychcentral.com/ask-the-therapist/2008/02/20/what-is-the-point-of-living/", "passage_text": "With the right therapist, you can change your life for the better. I know that your family situation is not ideal but this is the case for many people. What you are facing others have faced and there is help for you if you make the effort. You mentioned your family and how they would feel if you ended your life. It is highly likely, as with many other depressed individuals, that you are misjudging reality when you conclude that suicide is the only option for you. You are wrong. There are other options. You feel that there is no other solution to your problem. There absolutely is. Most of the people who survived their suicide attempt came to realize that there is help for depression and things can usually get better. Many finally went to get help"}, {"url": "http://www.personal-development.com/chuck/point-of-life.htm", "passage_text": "The point of life is to experience the excitement of discovery, joy of achievement, and wonder of mystery. The point is to take delight in the surprises that constantly come our way.Simply put, the point of life is to enjoy it; that is, to live IN JOY. Since we cannot give away what we do not have, it is important that we meet our own needs first. "}, {"url": "http://ehealthforum.com/health/topic50568.html", "passage_text": "Experienced User. +1 to johnkiggs. not only that, but life is what YOU make of it. its a self-fulfilling prophecy. i think what's happening here is people are aiming low and enjoying the results of it. when i say that i am just trying to make a point. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090424071658AAEQXW9", "passage_text": "Report Abuse. The point of living is just that-it is in itself-to live. The word live has a lot of definitions, one of which being to continue in existence, and to exist means to have actual being. Life was not meant to be wasted and to be sought after lazily. There is a reason behind everything-some people don't believe that, but it's inevitable. Every action, word, emotion has a point and affects someone in some way out there. So the point in living life...is to live it-not just exist in it...but to really live it. Rose · 7 years ago."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20071019104727AAQtJLv", "passage_text": "· just now. Report Abuse. In my opinion there is no point in life because when our sun dies out and the planet Earth is no more what monumental achievement will we have honestly accomplished in the grand scheme of things. I will put my cards on the table and say that the point to life (For me) is to learn. Learn to think critically. Learn to accept that other points of view exist. Learn to discover what is valuable to you. Learn to express yourself. Learn learn learn. Whatever fascinates you."}, {"url": "http://psychcentral.com/ask-the-therapist/2008/02/20/what-is-the-point-of-living/", "passage_text": "from these things i don’t like living anymore–i haven’t enjoyed it for years now and i don’t see what reason there is for me to go on. i’m not afraid of hell, the only reason i haven’t done it yet is because i could never put that on my family. It is highly likely, as with many other depressed individuals, that you are misjudging reality when you conclude that suicide is the only option for you. You are wrong. There are other options. You feel that there is no other solution to your problem. There absolutely is. Most of the people who survived their suicide attempt came to realize that there is help for depression and things can usually get better. Many finally went to get help"}, {"url": "http://ehealthforum.com/health/what-is-the-point-of-life-t203743.html", "passage_text": "I think itÂ´itâ s hard to say what is the point of, life because everyone from us has different view on. Life If i were You i would try to help other people whose need you. Help Sometimes i have the same, Feeling i think what to do with my, life but, me you and everybody still have chance to find point of. life Some think the point of life is to find a greater personal understanding of the universe. I believe that life is to be lived and you should relish every second you're given for the potential of happiness or beauty you can experience."}, {"url": "http://lonerwolf.com/dark-night-of-the-soul-question/", "passage_text": "I don't know why I am here now. I don't see the point of living my life. I don't want anything, not material /physical achievements, not relationships, not entertainment, nothing. I don't know what to do with this body, mind, and feelings. Or maybe I just experience this life too intensely until I am numbed. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090311234841AAKF0tV", "passage_text": "The purpose of life is to grow through the experience. The end result of infinite growth is to realize our oneness with the underlying source of all reality-that of Infinite Being. Therefore, the meaning of life is growth in consciousness. Your primary purpose in life is to experience life from one individual, unique point of view. You are an expression of Infinite Being as it experiences itself from all possible viewpoints. We are all-each and every one of us-aspects of the One as it views itself from an infinite number of viewpoints"}]