[{"url": "http://www.webmd.com/asthma/guide/hypoxia-hypoxemia", "passage_text": "Hypoxemia (low oxygen in your blood) can cause hypoxia (low oxygen in your tissues) when your blood doesn't carry enough oxygen to your tissues to meet your body's needs. The word hypoxia is sometimes used to describe both problems. When your body doesn't have enough oxygen, you could get hypoxemia or hypoxia. These are dangerous conditions. Without oxygen, your brain, liver, and other organs can be damaged just minutes after symptoms start."}, {"url": "https://en.wikipedia.org/wiki/Histotoxic_hypoxia", "passage_text": "Histotoxic hypoxia (also called histoxic hypoxia) is the inability of cells to take up or utilize oxygen from the bloodstream, despite physiologically normal delivery of oxygen to such cells and tissues. Histotoxic hypoxia results from tissue poisoning, such as that caused by cyanide (which acts by inhibiting cytochrome oxidase), and certain other poisons like hydrogen sulfide (byproduct of sewage and used in leather tanning)."}, {"url": "http://byebyedoctor.com/hypoxia/", "passage_text": "In cases of Histotoxic hypoxia, there are cells which are damaged, and therefore are unable to use and absorb oxygen. This can happen often because of overuse of alcohol or drugs. The intake of certain poisons like hydrogen sulfide as well as cyanide can also be a cause of this type of hypoxia. This is a state of the human body where the body tissues are hungry for oxygen. It is oxygen shortage in the body. In the most extreme hypoxia, oxygen is totally missing from the body which is a condition known as anoxia."}, {"url": "http://medical-dictionary.thefreedictionary.com/Histotoxic+hypoxia", "passage_text": "circulatory hypoxia stagnant hypoxia. histotoxic hypoxia that due to impaired utilization of oxygen by tissues, as in cyanide poisoning. hypoxemic hypoxia (hypoxic hypoxia) that due to insufficient oxygen reaching the blood, as at the decreased barometric pressures of high altitudes. stagnant hypoxia that due to failure to transport sufficient oxygen because of inadequate blood flow, as in heart failure. affinity hypoxia hypoxia resulting from failure of the hemoglobin to release oxygen to the tissues, as may occur with a left-shifted oxyhemoglobin dissociation curve."}, {"url": "https://en.wikipedia.org/wiki/Hypoxia_(medical)", "passage_text": "Hypoxia exists when there is a reduced amount of oxygen in the tissues of the body. Hypoxemia refers to a reduction in PO2 below the normal range, regardless of whether gas exchange is impaired in the lung, CaO2 is adequate, or tissue hypoxia exists. Histotoxic hypoxia results when the quantity of oxygen reaching the cells is normal, but the cells are unable to use the oxygen effectively, due to disabled oxidative phosphorylation enzymes."}, {"url": "http://www.faa.gov/pilots/training/airman_education/topics_of_interest/hypoxia/", "passage_text": "Hypoxia is actually divided into four types: hypoxic hypoxia, hypemic hypoxia, stagnant hypoxia, and histotoxic hypoxia. No matter what the cause or type of hypoxia you experience, the symptoms and effects on your flying skills are basically the same. Hypoxia, by definition, is the lack of sufficient oxygen in the blood, tissues, and/or cells to maintain normal physiological function. Many different factors can cause this state of oxygen deficiency."}, {"url": "http://www.merriam-webster.com/medical/histotoxic%20hypoxia", "passage_text": "Medical Definition of HISTOTOXIC HYPOXIA. : a deficiency of oxygen reaching the bodily tissues due to impairment of cellular respiration especially by a toxic agent (as cyanide or alcohol). What made you want to look up histotoxic hypoxia? "}, {"url": "http://www.news-medical.net/health/What-is-Hypoxia.aspx", "passage_text": "By Dr Ananya Mandal, MD. The term hypoxia is a condition where the tissues are not oxygenated adequately, usually due to an insufficient concentration of oxygen in the blood. The oxygen deprivation can have severe adverse effects on various body cells that need to perform important biological processes. "}, {"url": "https://en.wikipedia.org/wiki/Histotoxic_hypoxia", "passage_text": "Histotoxic hypoxia refers to a reduction in ATP production by the mitochondria due to a defect in the cellular usage of oxygen. An example of histotoxic hypoxia is cyanide poisoning. Histotoxic hypoxia results from tissue poisoning, such as that caused by cyanide (which acts by inhibiting cytochrome oxidase), and certain other poisons like hydrogen sulfide (byproduct of sewage and used in leather tanning)."}]