[{"url": "http://midlandpolishedconcrete.co.uk/polished-concrete-floors-cost/", "passage_text": "The size area of the floor: Similar to any kind of design process, the bigger in size the area to be fitted, the less polished concrete floor cost per/sq meter will certainly be, areas or floor spaces which might be twenty (20) meters square or even below generally cost between £3,500.00 to £6,000.00. Below we have listed the different elements that can impact the cost of the polished concrete floor. Even large areas of polished concrete tend to be over £100 per meter squared, however when you compare this with other alternative options polished concrete can be a cost effective solution."}, {"url": "http://www.concretenetwork.com/concrete/interiorfloors/cost.html", "passage_text": "1 Extensive surface preparation, such as grinding, crack repair, and spall repair, can add as much as $2 per square foot to the overall cost of the floor. 2  If a full resurfacing is needed, expect to tack on another $2 to $3 per square foot (for a $4 to $5 per square foot increase). As the chart below shows, the average per-square-foot costs of basic stained or polished concrete floors are competitive with what you would expect to pay to install linoleum, vinyl flooring, ceramic tile and high-quality carpeting."}, {"url": "http://www.concretenetwork.com/concrete/interiorfloors/cost.html", "passage_text": "Video on the cost of concrete floors. Depending on the level of complexity, concrete floors can cost as little as $2 to $6 a square foot or be as expensive as $15 to $30 a square foot. As the chart below shows, the average per-square-foot costs of basic stained or polished concrete floors are competitive with what you would expect to pay to install linoleum, vinyl flooring, ceramic tile and high-quality carpeting."}, {"url": "http://www.skimcoat.co.uk/polished-concrete", "passage_text": "Polished Concrete Prices. Polished concrete pricing and cost per square metre for concrete polishing can range from as little as £20 to as much as £150 per metre square. Additionally polished concrete overlays with exotic aggregates could add further costs of £10 to £50 per metre. When choosing a polished concrete floor price should be the last question you ask. Firstly define the expectations you want from your concrete floor and have your budget figure in mind."}, {"url": "http://www.homeimprovementpages.com.au/article/how_much_do_polished_concrete_floors_cost", "passage_text": "Honed concrete will outlast a grind and seal finish and mechanically polished concrete lasts even longer. Concrete polishing starts at around $50-$75 per square metre for a grind and seal or honed finish on an existing concrete slab. If you want to have the slab poured and mechanically sealed, it will depend on several factors. If you have an existing concrete slab, you can have it polished to a smooth and stylish finish. If you're building or adding on, get quotes from concrete polishing services before you pour your slab and you will have even more stylish options to choose from."}, {"url": "http://www.ata.org.au/forums/topic/838", "passage_text": "Polished concrete costs about $200 a cubic meter for the concrete itself, plus another $80+ for laying, (which you need as well for the tiles!) plus between $40-$90 sqm for polishing. So it really depends on what type of tile you want, and if you compare it directly to the finish of polished concrete. "}, {"url": "http://www.skimcoat.co.uk/polished-concrete", "passage_text": "Polished concrete pricing and cost per square metre for concrete polishing can range from as little as £20 to as much as £150 per metre square. Additionally polished concrete overlays with exotic aggregates could add further costs of £10 to £50 per metre. When choosing a polished concrete floor price should be the last question you ask. Firstly define the expectations you want from your concrete floor and have your budget figure in mind."}, {"url": "http://www.homewyse.com/services/cost_to_polish_concrete.html", "passage_text": "$4.40. $5.25. Get an INSTANT estimate of the cost to Polish Concrete! Our free calculator uses recent, trusted data to estimate costs for your Concrete Polishing project. For a basic 250 square feet project in zip code 47474, the benchmark cost to Polish Concrete ranges between $4.40 - $5.25 per square foot* . To estimate costs for your project: 1."}, {"url": "http://www.homeimprovementpages.com.au/article/how_much_does_polished_concrete_flooring_cost_per_", "passage_text": "Unlike tiles, carpeting and other flooring materials, polished concrete floors are created on site. For this reason, you can't simply choose a colour or design you like and get a square metre quote. Estimates will vary, but generally expect to pay from around $50 to $75 per square metre. "}, {"url": "http://www.madaboutthehouse.com/should-i-have-polished-concrete-floors/", "passage_text": "So, to the practicalities. Where do we get some, what does it cost, when can we have it? First things first, a polished concrete floor costs anywhere between £60 to £400 a sq metre. The difference depends largely on whether it can be levelled by machine or, if the space is too tight, if it must be done by hand."}]