[{"url": "http://www.innovateus.net/science/what-anthraquinone", "passage_text": "1 Anthraquinone is highly combustible and cannot be used near an open flame or extreme heat since the compound produces toxic fumes when burned. 2  It is also recommended that workers handling anthraquinone wear a P1 filter respirator to avoid inhaling inert particles, as well as protective gloves and eyewear. 1 As a result of NTP’s findings, the California Environmental Protection Agency included anthraquinone to its list of established carcinogens. 2 "}, {"url": "http://www.niehs.nih.gov/health/materials/aloe_vera_508.pdf", "passage_text": "NTP did not conduct two-year studies of ingestion of the Aloe vera gel or of the plant’s decolorized whole leaf extracts. The difference between decolorized and non-decolorized whole leaf extracts is mostly in how the leaf is processed or filtered. In many cases, manufacturers of oral products containing Aloe vera use a charcoal filtration process to decolorize and remove some of the components from the leaf, including anthraquinones. Aloe vera specifically refers to the Aloe barbadensis Miller plant, which is the most common form used in Aloe-based products. How is Aloe used?Traditionally, the clear gel from the Aloe plant is rubbed on the skin as an ointment to treat wounds and burns."}, {"url": "http://pmep.cce.cornell.edu/profiles/rodent/rodent_A_L/anthraquinone/anthraquin_let_0503.pdf", "passage_text": "However, given the carcinogenic potential of 9,10-anthraquinone, theNYSDOH continued to have concerns for the use of Flight Control ® Plus, particularly in settings that have significant exposure potential for the public (e.g., schools, athletic fields, municipal sites anddeveloped urban areas). Given thepotential for exposure of workers and the general public to 9,10-anthraquinone from labeled use of FlightControl ®, and the fact that the draft NTP report has determined that this compound is carcinogenic, the NYSDOH expressed concerns in their previous registration reviews of the Flight Control ® product."}, {"url": "http://www.wisegeek.com/what-is-anthraquinone.htm", "passage_text": "There are a number of environmental and health concerns associated with anthraquinone. For one thing, its use as a laxative has been linked to a benign but undesirable condition known as melanosis coli, which is characterized by a discoloration of the colon wall. Anthraquinone is an aromatic organic compound that occurs naturally in certain plants, fungi and insects. Since it contributes to the coloring pigment of such organisms, the compound is used commercially to manufacture dyes."}, {"url": "http://www.innovateus.net/science/what-anthraquinone", "passage_text": "1 Though used as a laxative, anthraquinone leads to an undesirable condition known as melanosis coli, which is characterized by a discoloration of the colon wall. 2  Research performed by the National Toxicology Program (NTP) using animal models indicates that anthraquinone is a liver carcinogen when ingested. 1 As a result of NTP’s findings, the California Environmental Protection Agency included anthraquinone to its list of established carcinogens. 2  Anthraquinone is highly combustible and cannot be used near an open flame or extreme heat since the compound produces toxic fumes when burned."}, {"url": "http://www.hindawi.com/journals/ecam/2013/208378/", "passage_text": "Analyses sponsored by Tahitian Noni, the main global provider of noni juice, reported no toxicity from consumption of the product [ 11 – 13 ]. The main health concerns were based on the possible content of carcinogenic anthraquinones, in particular alizarin, rubiadin, and lucidin in noni. Anthraquinone and its derivatives are common aromatic compounds in plant pigments and are used to make dyes and paper, as well as bird repellants. "}, {"url": "http://sitem.herts.ac.uk/aeru/ppdb/en/Reports/41.htm", "passage_text": "Anthraquinone is a substance used as a bird repellent which no longer has approval for use in the EU. It has a low aqueous solubility, non-volatile with a low risk of leaching to groundwater. it is non-persistent in soil but can be persistent in water under certain conditions. It shows a low mammalian toxicity but there are some concerns regarding its potential to bioaccumulate."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/24062780", "passage_text": "Noni has been used in traditional medicine and as food for thousands of years. While the fruits serve as food and internal medicine, leaves were traditionally used only topically. In recent years, concern regarding the possible content of anthraquinones in noni has led to scrutiny by the European Food Safety Authority. Little research existed on the content of anthraquinones in different noni preparations, with no information about the potential effect of harvest and preparation methods. "}, {"url": "http://www.innovateus.net/science/what-anthraquinone", "passage_text": "Image Credit: Main Image: Anthraquinone, also called anthracenedione or dioxoanthracene is an aromatic (a hydrocarbon characterized by general alternating double and single bonds between carbons) organic compound. This compound is an important member of the quinone family. 1 As a result of NTP’s findings, the California Environmental Protection Agency included anthraquinone to its list of established carcinogens. 2  Anthraquinone is highly combustible and cannot be used near an open flame or extreme heat since the compound produces toxic fumes when burned."}, {"url": "http://pmep.cce.cornell.edu/profiles/rodent/rodent_A_L/anthraquinone/anthraquin_let_0503.pdf", "passage_text": "No. 69969-1) contains the new active ingredient 9, 10-anthraquinone.The Department’s concerns regarding the potential risks to applicators and the public have beenmitigated with the submission of revised Flight Control ® Plus product labeling received on May 12, 2003. Given thepotential for exposure of workers and the general public to 9,10-anthraquinone from labeled use of FlightControl ®, and the fact that the draft NTP report has determined that this compound is carcinogenic, the NYSDOH expressed concerns in their previous registration reviews of the Flight Control ® product."}]