[{"url": "http://www.gov.scot/Publications/2005/09/06112048/20489", "passage_text": "Listen. This document is also available in pdf format (212k). The role of the Physiotherapist is to assess and manage children and young people with movement disorders, disability or illness. The aim of the physiotherapist is to help the child/young person reach their full potential through providing physical intervention, advice and support. Assessment may include information gathering from parents, families and others involved in the child's life and building on what is already known about the child from other agencies such as education and social work. Assessment will include: 1  Strength and co-ordination. 2  Motor development."}, {"url": "http://www.rch.org.au/physio/what_is_physiotherapy/What_is_Physiotherapy/", "passage_text": "What is Physiotherapy. Physiotherapy is a clinical health science and profession that aims to rehabilitate and improve a person’s ability to move and function. Physiotherapists utilise their expertise in anatomy and physiology to assess and treat people with a variety of health conditions. Paediatric Physiotherapists assess each child individually and develop programmes with a child and family-centred focus. They provide treatment, management and education to enhance the health and wellbeing of children and maximise their participation in everyday activities."}, {"url": "https://www.specialeducationalneeds.co.uk/physiotherapy.html", "passage_text": "Physiotherapy (PT) can be used to maximise a child’s ability to move and control pain in the joints, muscles and bones. It also helps to improve a child’s range of movement in order to promote health and well-being. Physiotherapy is non-invasive and does not involve the use of medication. Physiotherapists concentrate, in particular, on problems that affect muscles, bones, the heart, circulation and lungs."}, {"url": "http://www.clch.nhs.uk/services/physiotherapy-for-children.aspx", "passage_text": "Our children's physiotherapy service caters for children from birth until they leave school, who have a wide range of disabilities, disorders and delays including those with: 1  physical disability. 2  profound and complex learning disabilities. 3  motor coordination difficulties. Our children's physiotherapy team works closely with a range of specialists including: 1  child health specialists. 2  Child Development Service (CDS). 3  local authority educational and social services. 4  health visitors. 5  school nurses. 6  occupational therapists. 7  speech and language therapists. 8  paediatricians. 9  podiatrists."}, {"url": "http://www.medicalnewstoday.com/articles/160645.php", "passage_text": "1 Back pain-the physical therapist will examine the patient's back, determine how it is affecting his/her life, and check some other aspects of the patient's health. 2  The physical therapist may perform manual therapy, help the patient learn how to manage the pain, what to do to speed up recovery and prevent recurrence. Physical therapy also means the treatment of any pain, disease, or injury by physical means. A physical therapist seeks to identify and maximize quality of life and movement potential through prevention, intervention (treatment), promotion, habilitation, and rehabilitation."}, {"url": "http://www.kamloopschildrenstherapy.org/physiotherapy", "passage_text": "To help your child move, have fun and participate, the physiotherapist might: 1  Work with you and your child in his/her environment to develop the child's skills (e.g. arm/leg movements, stretches, walking skills). 2  Support your child with equipment (e.g. walker, shoes, bike, swim floats). Babies and children learn about themselves and their environment through movement. Movement is vital for their physical and mental growth, general health and overall well being. A physiotherapist helps babies and children move to their best of their ability. In order to help the child and family, a physiotherapist: 1  Will spend some time with your child to assess your child's (emerging) skills. 2  Will provide suggestions in discussion with you. 3  Will discuss with you your ongoing concerns on a regular basis"}, {"url": "http://www.gov.scot/Publications/2005/09/06112048/20489", "passage_text": "Physiotherapists work in close partnership with the child and their family, education, social work, other healthcare professionals and the voluntary sector. Together they have a shared responsibility for meeting children's needs. Assessment may include information gathering from parents, families and others involved in the child's life and building on what is already known about the child from other agencies such as education and social work. Assessment will include: 1  Strength and co-ordination. 2  Motor development."}]