[{"url": "http://www.cic.gc.ca/english/study/study-institutions-list.asp", "passage_text": "To find an institution at the post-secondary level: Step 1: Select the province/territory in which your institution is located. A list of all the designated learning institutions in that province/territory will appear. Step 2: To search for a specific institution, type in any key words (partial name of the institution or the city in which the institution is located). Important Note: This list will be updated on a regular basis. To apply for a study permit on or after June 1, 2014, you will need a letter of acceptance from a designated learning institution. You need to include the Designated Learning Institution number (DLI #), which is the number that begins with the letter “O”, on your application form. All primary and secondary schools in Canada are automatically designated. They do not appear on this list"}, {"url": "https://www.irs.gov/individuals/eligible-educational-inst", "passage_text": "An eligible educational institution is a school offering higher education beyond high school. It is any college, university, vocational school, or other post secondary educational institution eligible to participate in a student aid program run by the U.S. Department of Education. This includes most accredited public, nonprofit and privately-owned–for-profit postsecondary institutions. If you aren’t sure if your school is an eligible educational institution: • Ask your school if it is an eligible educational institution, or. • See if your school is on the U.S. Federal Student Aid Code List."}, {"url": "http://docs.quicktaxweb.ca/ty10/english/text/en/common/glossary/d_llp_des_educ_inst.html", "passage_text": "Designated educational institution-definition. A designated educational institution is a university, college, or other educational institution that qualifies for the education amount on line 323 of your return. "}, {"url": "http://www.canadavisa.com/designated-learning-institution-list.html", "passage_text": "Applicants must provide the Designated Learning Institution number (DLI #) for their school of choice. The DLI number is the number that begins with the letter “O” on the study permit application form. Below is a list of Canada’s Designated Learning Institutions. Prospective international students who wish to study at a Canadian post-secondary institution need to provide a letter of acceptance from a Designated Learning Institution when applying for a Canadian study permit."}, {"url": "http://www.cic.gc.ca/english/resources/tools/temp/students/design.asp", "passage_text": "1 At the post-secondary level, each province or territory will designate educational institutions for the purpose of hosting international students. 2  A list of designated learning institutions at the post-secondary level is available on CIC’s website. An applicant provides the correct designated learning institution number for their institution on the application form (IMM 1294 or IMM 5709) and this number exists in GCMS. 1  Applications that include the 2-D barcode page, received online or uploaded via a visa application centre (VAC):"}, {"url": "http://www.aved.gov.bc.ca/isp/docs/OVERVIEW-COMPLIANCE-REPORTING.pdf", "passage_text": "3 education or advanced education in the province or territory in which your institution is located. Overview of the Portal CIC has developed a Designated Learning Institution Portal (DLI Portal) to support the management of compliance reporting for the International Student Program. "}, {"url": "http://www.cic.gc.ca/english/resources/tools/temp/students/design.asp", "passage_text": "The system will automatically link the designated learning institution number to the application. Officers must verify that the designated learning institution number provided by the applicant is the correct one associated with the designated learning institution that issued the letter of acceptance. An applicant provides the correct designated learning institution number for their institution on the application form (IMM 1294 or IMM 5709) and this number exists in GCMS. 1  Applications that include the 2-D barcode page, received online or uploaded via a visa application centre (VAC):"}, {"url": "http://www.cic.gc.ca/english/resources/tools/temp/students/design.asp", "passage_text": "A designated learning institution number is the external term used for Organization ID in GCMS. This number is assigned to a post-secondary institution once CIC receives confirmation of their designation status from their provincial or territorial ministry of education. An applicant provides the correct designated learning institution number for their institution on the application form (IMM 1294 or IMM 5709) and this number exists in GCMS. 1  Applications that include the 2-D barcode page, received online or uploaded via a visa application centre (VAC):"}]