[{"url": "http://www.answers.com/Q/What_are_angiosperms", "passage_text": "A  plant that has flowers and produces seeds enclosed within a carpel.  The angiosperms are a large group and include herbaceous plants,  shrubs, grasses, an … d most trees.     . 2 people found this useful. Stamens are separated into anthers, which produce pollen, and filaments. The mature ovary (part of the pistil containing the seeds) is termed a fruit.. Sepals and petals may be showy and colorful to attract pollinators, or may be quite reduced in wind-pollinated plants, such as grasses."}, {"url": "http://www.answers.com/Q/What_is_an_angiosperm", "passage_text": "Confidence votes 229. Angiosperms (a plant whose ovules are enclosed in an ovary) are commonly referred to as flowering plants, as opposed to Gymnosperms, or cone bearing plants. Angiosperms form a phylum, the phylum Anthophyta. Angiosperms are also called anthophytes or magnoliophytes. The difference between an Angiosperm and a Gymnosperm is that Angiosperms are flowering plants while Gymnosperms are not. A. include plants that use flowers to reproduce. More … information on this topic can be researched online or in a biology book. I strongly recommend Dale Layman's Biology Demystified for more info"}, {"url": "http://www.biology-questions-and-answers.com/angiosperms.html", "passage_text": "13. A typical seed is composed of the embryo, endosperm and shell. Within seeds of angiosperms, there are one or two cotyledons (seed leaves, one in monocots, two in dicots). The endosperm is the tissue within the seed that has the function of nourishing the embryo. 1  Angiosperms Review-Image Diversity: seed structure. When pollination occurs and the pollen grain makes contact with the stigma (the apex of the pistil), the tube cell elongates its cytoplasm, forming the pollen tube that grows towards the ovary. The generative cell divides to form two sperm nuclei (male gametes), which then migrate through the pollen tube."}, {"url": "http://www.theplantlist.org/browse/A/", "passage_text": "The Angiosperms (Flowering plants). are seed-bearing vascular plants. Their reproductive structures are flowers in which the ovules are enclosed in an ovary. Angiosperms are found in almost every habitat from forests and grasslands to sea margins and deserts. Angiosperms display a huge variety of life forms including trees, herbs, submerged aquatics, bulbs and epiphytes."}, {"url": "http://www.biology-online.org/dictionary/Angiosperm", "passage_text": "1 They have closed carpel enclosing the ovules. 2  The carpel (s) and other accessory parts may develop into a fruit, which is an important plant organ for seed dispersal. 3  They form endosperm, which is a nutritive tissue for the developing embryo or for the seedling. (botany) A flowering, fruit-bearing plant or tree known for having ovules (and therefore seeds) develop within an enclosed ovary. Supplement. Angiosperms are plants producing flowers. Thus, they are also commonly called as the flowering plants. They belong to the Kingdom Plantae, Subkingdom Embryophyta."}, {"url": "http://www.answers.com/Q/What_is_an_angiosperm", "passage_text": "Angiosperms (a plant whose ovules are enclosed in an ovary) are commonly referred to as flowering plants, as opposed to Gymnosperms, or cone bearing plants. The difference between an Angiosperm and a Gymnosperm is that Angiosperms are flowering plants while Gymnosperms are not. A. include plants that use flowers to reproduce. More … information on this topic can be researched online or in a biology book. I strongly recommend Dale Layman's Biology Demystified for more info"}, {"url": "http://www.answers.com/Q/What_are_angiosperms", "passage_text": "What is an angiosperm? Angiosperms (a plant whose ovules are enclosed in an ovary) are  commonly referred to as flowering plants, as opposed to  Gymnosperms, or cone bearing plants. Stamens are separated into anthers, which produce pollen, and filaments. The mature ovary (part of the pistil containing the seeds) is termed a fruit.. Sepals and petals may be showy and colorful to attract pollinators, or may be quite reduced in wind-pollinated plants, such as grasses."}, {"url": "http://mrsdaintreysonlineclassroom.wikispaces.com/file/view/Gymnosperms+and+Angiosperms.pdf", "passage_text": "5. The seed of a gymnosperm seed is made in the ______________. 6. How are the reproductive structures of a typical gymnosperm and a. typical angiosperm tree different from each other. Use the venn diagram. below to explain. Placing at least one point in each space. Daintrey’s Doings ☺ 2. 7. The seed of a gymnosperm seed is made in the ______________. 6. How are the reproductive structures of a typical gymnosperm and a. typical angiosperm tree different from each other. Use the venn diagram. below to explain"}]