[{"url": "http://www.answers.com/Q/Who_is_the_richest_person_in_Maine", "passage_text": "Confidence votes 9. The wealthiest person in Maine is Cesideo Galli at 440 million dollars. The Galli family has had power in Maine for 3 generations. Celia Galli, Normand Gallli and Vinchenzo Galli are all relatives of Cesideo. Richest person alive is Bill Gates   Richest person ever is John .B Rockefeller. Edit. Share to: 1  Avoiding Fraud in the Online Dating World Online dating is a popular trend. 2  To meet with the demand there are thousands of dating websites in the United States."}, {"url": "http://widgetsanddigits.bangordailynews.com/2014/08/01/economy/whos-maines-richest-person-only-the-countrys-48th-richest-rich-person/", "passage_text": "Leon Gorman, grandson of L.L.Bean founder Leon Leonwood Bean, former chairman of the company’s board and its past CEO for 33 years, was singled out as Maine’s richest person in a tally by the real estate blog Movoto. Noted. But what’s perhaps most notable for Maine is that our richest person — from the mashup of net worth data at Forbes and Celebrity Net Worth — is only the nation’s 48th richest rich person, with a net worth of $860 million. I know. I know"}, {"url": "http://z1073.com/who-is-the-richest-person-in-maine/", "passage_text": "Nope. The richest person in Maine is Leon Gorman, the chairman of the board of L.L. Bean. The real estate brokerage, Movoto, released its map of the wealthiest Americans by state on Friday. While Mr. Gorman has big bucks ($860 million of them to be precise), he ranks 48th on the list of the wealthiest in each state. He is richer than Delaware’s Robert Gore ($830 million) and Alaska’s Robert Gillam ($700 million.)."}, {"url": "http://92moose.fm/the-richest-person-in-maine-probably-has-you-to-thank-for-it-if-you-shop-at-l-l-bean/", "passage_text": "A new list has surfaced of the wealthiest individuals in each state. In order to qualify each must be worth at least $30 million. In Maine, our top dog is Leon Gorman. He’s the the Chairman of L.L. Bean and is worth $860 million dollars. By the way, that only places him, as Maines richest person, 43rd out of the 50 states"}, {"url": "http://z1073.com/who-is-the-richest-person-in-maine/", "passage_text": "The richest person in Maine is Leon Gorman, the chairman of the board of L.L. Bean. The real estate brokerage, Movoto, released its map of the wealthiest Americans by state on Friday. While Mr. Gorman has big bucks ($860 million of them to be precise), he ranks 48th on the list of the wealthiest in each state. He is richer than Delaware’s Robert Gore ($830 million) and Alaska’s Robert Gillam ($700 million.)."}, {"url": "http://www.nbcnews.com/business/business-news/who-richest-person-every-state-f8C11499715", "passage_text": "CORRECTION: This story has been corrected. The richest people in Maine and Delaware were transposed in an earlier version. Most of us know the richest person in America (Bill Gates at $70 billion). Bill Gates is the richest person in America (and Washington state). Here's the list, by state, person and net worth value after valuation, in billions of dollars: 1  Alabama, Jonathan Nelson, 1.5. 2  Alaska, Robert Gillam, 0.4. 3  Arizona, Bruce Halle Sr., 4.4. 4  Arkansas, James Walton, 37.1. 5  California, Lawrence Ellison, 46.4."}, {"url": "http://www.celebritynetworth.com/articles/entertainment-articles/the-richest-person-in-every-state/", "passage_text": "You probably wont be surprised to learn that Bill Gates is the richest person in Washington (and America overall), but you may be surprised to learn who the richest people are in states like Alaska, South Dakota, Maine, Kentucky or even Illinois. "}, {"url": "http://www.dailymail.co.uk/news/article-2222491/New-rich-list-reveals-wealthiest-person-50-states-guess-whos-local-billionaire.html", "passage_text": "Bill Gates, who is America's wealthiest person worth $64.5 billion, still lives in Seattle, Washington near to the headquarters of Microsoft which he founded, while Wal-Mart heir, Jim Walton, worth $33.6 billion lives in Bentonville, Arkansas, where the retail giant is headquartered. "}]