[{"url": "https://labtestsonline.org/understanding/conditions/autoimmune", "passage_text": "Autoimmune diseases arise when the immune system attacks one or more of the body's normal constituents as if they were invaders. When the immune system fails to recognize self it may produce immune cells or antibodies (called autoantibodies) that target its own cells, tissues, and/or organs."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=134&ContentID=123", "passage_text": "The lymph, or lymphatic, system is a major part of the immune system. It's a network of lymph nodes and vessels. Lymphatic vessels are thin tubes that branch, like blood vessels, throughout the body. They carry a clear fluid called lymph. Lymph contains tissue fluid, waste products, and immune system cells."}, {"url": "http://www.niaid.nih.gov/topics/immuneSystem/Pages/default.aspx", "passage_text": "Immune System The immune system is a network of cells, tissues, and organs that work together to protect the body from infection. Although scientists have learned much about the immune system, they continue to study how the body targets invading microbes, infected cells, and tumors while ignoring healthy tissues."}, {"url": "http://www.livescience.com/26579-immune-system.html", "passage_text": "Disorders of the immune system can result in autoimmune diseases, inflammatory diseases and cancer, according to the NIH. Immunodeficiency occurs when the immune system is not as strong as normal, resulting in recurring and life-threatening infections, according to the University of Rochester Medical Center."}, {"url": "http://www.webmd.com/a-to-z-guides/autoimmune-diseases", "passage_text": "Immune system disorders cause abnormally low activity or over activity of the immune system. In cases of immune system over activity, the body attacks and damages its own tissues (autoimmune diseases). Immune deficiency diseases decrease the body's ability to fight invaders, causing vulnerability to infections."}]