[{"url": "http://www.deckmagazine.com/estimating/labor-costs.aspx", "passage_text": "Of all the factors that go into an estimate for building a deck, labor costs are by far the most difficult to determine. Material pricing is easy: Count the sticks and bricks that make up the project and call your suppliers for the figures. Subcontracts are easy, too: Call your sub and add his price to your bid."}, {"url": "http://www.kompareit.com/homeandgarden/deck-compare-diy-vs-hire-deck-contractor.html", "passage_text": "Contractor prices vary widely depending on the type of wood you choose and the size and configuration of the deck. The average price to build a deck with pressure-treated pine is about $30 to $35 per square foot. That price includes the wood planks, supporting framework, railings and all labor costs. Cedar, redwood or wood composites are more expensive, ranging from $35 to $60 per square foot installed."}, {"url": "http://rempros.com/costs/building_deck_prices.html", "passage_text": "In the total materials cost section include expenses not only for decking boards, which are normally 35% - 65% of total materials expenditures, but gross amount spent on concrete, posts, hangers, railing and other components while building a deck."}, {"url": "http://rempros.com/costs/building_deck_prices.html", "passage_text": "$19.0 - $36.0. $37.0 - $71.0. Cost of materials estimated as a charge per square foot in the case a contractor will purchase and supply all necessary materials at his own discretion to build a standard deck."}, {"url": "http://www.answers.com/Q/Labor_cost_for_building_a_deck", "passage_text": "It costs roughly … $11-$13 for the materials and contractors average about $5-$8 per square foot for labor, not including steps. For example, my company charges approximately $18 per square foot to build a deck."}, {"url": "http://rempros.com/costs/building_deck_prices.html", "passage_text": "Type of decking is an essential factor in determining the cost of building a deck. Particular materials not only vary in purchase price, but labor cost will be different when using a specific product due to simplicity or complexity of working with a certain type of decking materials."}, {"url": "http://www.answers.com/Q/What_is_the_average_labor_cost_to_build_a_deck", "passage_text": "It costs roughly … $11-$13 for the materials and contractors average about $5-$8 per square foot for labor, not including steps. For example, my company charges approximately $18 per square foot to build a deck."}, {"url": "http://rempros.com/costs/building_deck_prices.html", "passage_text": "Cost of labor calculated as a fee per square foot to build standard one level deck with minimum 140 sq. ft. of deck area on a flat surface up to 5’ above ground level excluding building stairs. Multi-level custom designed or decks smaller than 140 sq. ft. will be priced at higher rates."}]