[{"url": "http://www.thefreedictionary.com/alluvium", "passage_text": "1. alluvium-clay or silt or gravel carried by rushing streams and deposited where the stream slows down. alluvial deposit, alluvial sediment, alluvion. delta-a low triangular area of alluvial deposits where a river divides before entering a larger body of water; the Mississippi River delta; the Nile delta. "}, {"url": "http://mrdata.usgs.gov/geology/state/sgmc-lith.php?text=alluvium", "passage_text": "Quaternary Alluvium (Quaternary). Quaternary Alluvium-alluvial deposits of sand, gravel, silt, and clay. Wyoming. Alluvium and Colluvium (Phanerozoic | Cenozoic | Quaternary | Pleistocene Holocene). ALLUVIUM AND COLLUVIUM--Clay, silt, sand, and gravel in flood plains, fans, terraces, and slopes. Undivided surficial deposits (Phanerozoic | Cenozoic | Quaternary | Pleistocene Holocene). UNDIVIDED SURFICIAL DEPOSITS--Mostly alluvium, colluvium, and glacial and landslide deposits."}, {"url": "http://mrdata.usgs.gov/geology/state/sgmc-lith.php?text=alluvium", "passage_text": "Alluvial, coastal and low terrace deposits (Holocene). Alluvial, coastal and low terrace deposits-Varicolored fine to coarse quartz sand containing clay lenses and gravel in places. Gravel composed of quartz and chert pebbles and assorted metmorphic and igneous rock fragments in streams near the Piedmont. ALLUVIUM AND COLLUVIUM--Clay, silt, sand, and gravel in flood plains, fans, terraces, and slopes. Undivided surficial deposits (Phanerozoic | Cenozoic | Quaternary | Pleistocene Holocene). UNDIVIDED SURFICIAL DEPOSITS--Mostly alluvium, colluvium, and glacial and landslide deposits."}, {"url": "http://mrdata.usgs.gov/geology/state/sgmc-lith.php?text=alluvium", "passage_text": "Alluvium (Phanerozoic | Cenozoic | Quaternary). Alluvium: mainly valley fill consisting of silt, sand, and gravel; includes some terrace deposits and glacial drift of Pleistocene age in some areas; locally includes hot spring tufa. The older part of the alluvium, where present, is probably of Pliocene age. ALLUVIUM AND COLLUVIUM--Clay, silt, sand, and gravel in flood plains, fans, terraces, and slopes. Undivided surficial deposits (Phanerozoic | Cenozoic | Quaternary | Pleistocene Holocene). UNDIVIDED SURFICIAL DEPOSITS--Mostly alluvium, colluvium, and glacial and landslide deposits."}, {"url": "http://geomaps.wr.usgs.gov/archive/scamp/html/scg_surf_alluv.html", "passage_text": "Alluvium is: . 1 a more or less stratified deposit of gravel, sand, silt, clay, or other debris, moved by streams from higher to lower ground.. 2  Encyclopedia of Geomorphology (Fairbridge, 1968, p. 10). Sedimentologic usage .--Deposits of relatively well stratified alluvium (gravel, sand, silt, and clay) that accumulate on the floors of axial valleys. These have a variety of physical properties and bed forms typical of deposition from fluvial (river) stream flows on gently sloping beds (e.g., Miall, 1996)."}, {"url": "http://www.thefreedictionary.com/Alluvial+deposits", "passage_text": "Noun. 1. alluvium-clay or silt or gravel carried by rushing streams and deposited where the stream slows down. alluvial deposit, alluvial sediment, alluvion. delta-a low triangular area of alluvial deposits where a river divides before entering a larger body of water; the Mississippi River delta; the Nile delta."}, {"url": "http://www.diamondfacts.org/pdfs/media/media_resources/fact_sheets/Alluvial_Mining_Background.pdf", "passage_text": "Alluvial diamonds is the term used to describe diamonds that have been removed from the primary source (Kimberlite) by natural erosive action over millions of years, and eventually deposited in a new environment such as a river bed, an ocean floor or a shoreline. What is alluvial diamond mining? Alluvial diamond mining is the term used to describe the process through which diamonds are recovered from such deposits of sand, gravel and clay. Large concentrations of alluvial diamond deposits are mined on an industrial basis. "}, {"url": "https://en.wikipedia.org/wiki/Alluvium", "passage_text": "Definitions [edit]. The term alluvium is not typically used in situations where the formation of the sediment can clearly be attributed to another geologic process that is well described. This includes (but is not limited to): lake sediments (lacustrine), river sediments (fluvial), or glacially-derived sediments (glacial till). Most, if not all, alluvium is very young (Quaternary in age), and is often referred to as cover because these sediments obscure the underlying bedrock. Most sedimentary material that fills a basin (basin fill) that is not lithified is typically lumped together as alluvial."}, {"url": "https://en.wikipedia.org/wiki/Alluvium", "passage_text": "Alluvium is typically made up of a variety of materials, including fine particles of silt and clay and larger particles of sand and gravel. When this loose alluvial material is deposited or cemented into a lithological unit, or lithified, it is called an alluvial deposit. Most, if not all, alluvium is very young (Quaternary in age), and is often referred to as cover because these sediments obscure the underlying bedrock. Most sedimentary material that fills a basin (basin fill) that is not lithified is typically lumped together as alluvial."}]