[{"url": "https://en.wikipedia.org/wiki/Messenger_RNA", "passage_text": "Finally, the mRNA is degraded. Messenger RNA (mRNA) is a large family of RNA molecules that convey genetic information from DNA to the ribosome, where they specify the amino acid sequence of the protein products of gene expression. Transcription is when RNA is made from DNA. During transcription, RNA polymerase makes a copy of a gene from the DNA to mRNA as needed. This process is similar in eukaryotes and prokaryotes."}, {"url": "https://en.wikipedia.org/wiki/RNA", "passage_text": "One of these active processes is protein synthesis, a universal function wherein mRNA molecules direct the assembly of proteins on ribosomes. This process uses transfer RNA (tRNA) molecules to deliver amino acids to the ribosome, where ribosomal RNA (rRNA) then links amino acids together to form proteins. Three of the rRNA molecules are synthesized in the nucleolus, and one is synthesized elsewhere. In the cytoplasm, ribosomal RNA and protein combine to form a nucleoprotein called a ribosome. The ribosome binds mRNA and carries out protein synthesis. Several ribosomes may be attached to a single mRNA at any time."}, {"url": "http://biology.about.com/od/molecularbiology/ss/rna.htm", "passage_text": "1 When RNA polymerase transcribes the DNA into a mRNA molecule, adenine pairs with uracil and cytosine pairs with guanine (A-U and C-G). 2  At the end of transcription, mRNA is transported to the cytoplasm for the completion of protein synthesis. 1 The amino acid sequences are joined together to form a protein. 2  Transfer RNA is shaped like a clover leaf with three hairpin loops. 3  It contains an amino acid attachment site on one end and a special section in the middle loop called the anticodon site. 4  The anticodon recognizes a specific area on mRNA called a codon."}, {"url": "http://biology.about.com/od/molecularbiology/ss/rna.htm", "passage_text": "1 Ribosomal RNA (rRNA) is a component of cell organelles called ribosomes. 2  A ribosome consists of ribosomal proteins and rRNA. 3  Ribosomes are typically composed of two subunits: a large subunit and a small subunit. 4  Ribosomal subunits are synthesized in the nucleus by the nucleolus. 1 The amino acid sequences are joined together to form a protein. 2  Transfer RNA is shaped like a clover leaf with three hairpin loops. 3  It contains an amino acid attachment site on one end and a special section in the middle loop called the anticodon site. 4  The anticodon recognizes a specific area on mRNA called a codon."}, {"url": "http://smart-therapeutics.com/Technology/RNAs-Role-in-Protein-Synthesis", "passage_text": "There are three primary types of RNA involved in protein synthesis: messenger RNA, transfer RNA and ribosomal RNA. Messenger RNA. Whereas most types of RNA are the final products of their genes, messenger RNA (mRNA) is an intermediate in the information transfer process. It carries information from DNA to the ribosome in a genetic code that the protein-synthesizing machinery translates into protein. Protein synthesis is the process by which cells build or manufacture proteins. It refers to a multi-step process through which information is transferred from DNA to RNA and then from RNA to proteins. The flow of information from DNA to RNA to proteins is one of the fundamental principles of molecular biology."}, {"url": "https://en.wikipedia.org/wiki/Messenger_RNA", "passage_text": "As in DNA, mRNA genetic information is in the sequence of nucleotides, which are arranged into codons consisting of three bases each. Each codon encodes for a specific amino acid, except the stop codons, which terminate protein synthesis. Transcription is when RNA is made from DNA. During transcription, RNA polymerase makes a copy of a gene from the DNA to mRNA as needed. This process is similar in eukaryotes and prokaryotes."}, {"url": "http://www.nature.com/scitable/definition/transcription-DNA-transcription-87", "passage_text": "The newly formed mRNA copies of the gene then serve as blueprints for protein synthesis during the process of translation. Transcription is the process by which the information in a strand of DNA is copied into a new molecule of messenger RNA (mRNA). DNA safely and stably stores genetic material in the nuclei of cells as a reference, or template"}, {"url": "http://regentsprep.org/Regents/biology/units/heredity/synthesis.cfm", "passage_text": "First, the DNA code is copied on to the mRNA (messenger RNA) codon. A codon is a sequence of three nitrogenous bases. This process is called transcription. This mRNA codon is then carried from the nucleus out to the ribosome. Messenger RNA attaches to another kind of RNA called tRNA (transfer RNA). Three different types of RNA exist, mRNA or messenger RNA, tRNA or transfer RNA, and rRNA or ribosomal RNA. Protein Synthesis Cells store and use coded information. The genetic information stored in DNA is used to direct the synthesis of the thousands of proteins that each cell requires."}, {"url": "https://en.wikipedia.org/wiki/RNA", "passage_text": "Messenger RNA (mRNA) is the RNA that carries information from DNA to the ribosome, the sites of protein synthesis (translation) in the cell. The coding sequence of the mRNA determines the amino acid sequence in the protein that is produced. Three of the rRNA molecules are synthesized in the nucleolus, and one is synthesized elsewhere. In the cytoplasm, ribosomal RNA and protein combine to form a nucleoprotein called a ribosome. The ribosome binds mRNA and carries out protein synthesis. Several ribosomes may be attached to a single mRNA at any time."}, {"url": "http://www.atdbio.com/content/14/Transcription-Translation-and-Replication", "passage_text": "Transcription is the process by which DNA is copied (transcribed) to mRNA, which carries the information needed for protein synthesis. Transcription takes place in two broad steps. First, pre-messenger RNA is formed, with the involvement of RNA polymerase enzymes. The mRNA formed in transcription is transported out of the nucleus, into the cytoplasm, to the ribosome (the cell's protein synthesis factory). Here, it directs protein synthesis. Messenger RNA is not directly involved in protein synthesis − transfer RNA (tRNA) is required for this."}]