[{"url": "http://www.steadyhealth.com/topics/does-drinking-alcohol-cause-lower-back-pain", "passage_text": "Guest. I'll get severe back pain on left side of lower back after drinking alcohol and it'll go away only if i take pain killers, if i won't take pain killers it won't away for at least 4 or 5 days."}, {"url": "http://www.md-health.com/Stomach-Pain-After-Drinking.html", "passage_text": "1 Alcohol consumption can also trigger inflammation of the pancreas (pancreatitis) which can cause severe abdominal pains. 2  These are often accompanied by nausea and vomiting. 3  Stomach pains after drinking may also be caused by chronic cholecystitis, a disease of the gallbladder."}, {"url": "http://symptomchecker.webmd.com/multiple-symptoms?symptoms=binge-drinking-(alcohol)|pain-or-discomfort&symptomids=471|1&locations=66|22", "passage_text": "Binge drinking (alcohol) and Pain or discomfort. WebMD Symptom Checker helps you find the most common medical conditions indicated by the symptoms binge drinking (alcohol) and pain or discomfort including Depression (Adult), Food poisoning, and Gas pains."}, {"url": "http://health-treatment.com/kidney-pain-drinking-alcohol-left-right-kidney-pain/", "passage_text": "Alcohol can affect the function of kidney and causes kidney pain after drinking alcohol. The main function of kidney is to filter the metabolic waste from the body and maintain water balance in body. kidney pain after drinking alcohol can actually causes an imbalance in the filtering mechanism."}, {"url": "http://www.netwellness.org/question.cfm/55299.htm", "passage_text": "1) Acute drinking binges like the one you describe often can cause some transient swelling of the liver. Since the liver is in a dense capsule or sheath, when it swells it hurts in a way that is much like you describe. 2) Binges can also produe a lot of irritation to the stomach lining-and cause this sort of pain."}, {"url": "http://www.md-health.com/Stomach-Pain-After-Drinking.html", "passage_text": "1 Drinking too much alcohol or drinking repeatedly can trigger stomach inflammation or gastritis, which can lead to ulceration of the stomach lining. 2  This can cause severe stomach cramping and pain, and sometimes, acute bleeding."}, {"url": "http://www.ehealthme.com/ds/alcohol/side+pain/", "passage_text": "Summary: Side pain is found among people who take Alcohol, especially for people who are male, 50-59 old, also take medication Zyprexa, and have Stress and anxiety. We study 5,674 people who have side effects while taking Alcohol from FDA and social media. Among them, 6 have Side pain."}, {"url": "http://health-treatment.com/kidney-pain-drinking-alcohol-left-right-kidney-pain/", "passage_text": "Kidney pain after drinking alcohol is normally occurring if you continue to drink alcohol often and large amount. Chronic pain can also result due to excessive alcohol intake. Reducing of drinking alcohol is so much important to keep well your kidney and also liver."}]