[{"url": "http://my.clevelandclinic.org/childrens-hospital/health-info/diseases-conditions/hic-Tay-Sachs", "passage_text": "Advanced Search. Tay-Sachs disease (the most severe form of Hexosaminidase A deficiency) is a progressive, fatal genetic condition that affects the nerve cells in the brain. People with Tay-Sachs lack a specific protein (enzyme) called hexosaminidase A. This enzyme deficiency causes a fatty substance, GM2 ganglioside, to build up in the brain. It is this accumulation that causes the symptoms of Tay-Sachs."}, {"url": "http://www.webmd.com/brain/tay-sachs-disease", "passage_text": "General Discussion. Tay-Sachs disease is a rare, neurodegenerative disorder in which deficiency of an enzyme (hexosaminidase A) results in excessive accumulation of certain fats (lipids) known as gangliosides in the brain and nerve cells. "}, {"url": "http://my.clevelandclinic.org/childrens-hospital/health-info/diseases-conditions/hic-Tay-Sachs", "passage_text": "Tay-Sachs Disease. Tay-Sachs disease (the most severe form of Hexosaminidase A deficiency) is a progressive, fatal genetic condition that affects the nerve cells in the brain. People with Tay-Sachs lack a specific protein (enzyme) called hexosaminidase A. This enzyme deficiency causes a fatty substance, GM2 ganglioside, to build up in the brain. It is this accumulation that causes the symptoms of Tay-Sachs."}, {"url": "http://www.mayoclinic.org/diseases-conditions/tay-sachs-disease/basics/definition/CON-20036799", "passage_text": "Tay-Sachs disease is a rare disorder passed from parents to child. In the most common form, a baby about 6 months old will begin to show symptoms. Tay-Sachs disease results when an enzyme that helps break down fatty substances is absent. "}, {"url": "http://www.tay-sachs.org/taysachs_disease.php", "passage_text": "A baby with Tay-Sachs disease appears healthy at birth, and seems to be developing normally for a few months. Symptoms generally appear by six months of age. While symptoms vary from one child to the next, there is always a slowing down of development. When both parents are carriers, there is a 2 in 4 (50%) chance, with every pregnancy, of having a child who is a carrier. When only one parent is a carrier, there is no chance the child will have Tay-Sachs disease. There is a 2 in 4 (50%) chance, with every pregnancy, of having a child who is a Tay-Sachs carrier"}, {"url": "http://www.nytimes.com/health/guides/disease/tay-sachs-disease/overview.html", "passage_text": "Back to Top Causes. Tay-Sachs disease occurs when the body lacks hexosaminidase A, a protein that helps break down a chemical found in nerve tissue called gangliosides. Without this protein, gangliosides, particularly ganglioside GM2, build up in cells, especially nerve cells in the brain. Tay-Sachs disease is caused by a defective gene on chromosome 15. When both parents carry the defective Tay-Sachs gene, a child has a 25% chance of developing the disease. The child must receive two copies of the defective gene -- one from each parent -- in order to become sick"}, {"url": "http://ghr.nlm.nih.gov/condition/tay-sachs-disease", "passage_text": "Tay-Sachs disease is a rare inherited disorder that progressively destroys nerve cells (neurons) in the brain and spinal cord. The most common form of Tay-Sachs disease becomes apparent in infancy. Infants with this disorder typically appear normal until the age of 3 to 6 months, when their development slows and muscles used for movement weaken. Because Tay-Sachs disease impairs the function of a lysosomal enzyme and involves the buildup of GM2 ganglioside, this condition is sometimes referred to as a lysosomal storage disorder or a GM2-gangliosidosis."}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/explain-tay-sachs-disease-imagine-genetic-counselor-working-couple-child-suffering-tay-sac-q4223062", "passage_text": "Explain Tay-Sachs disease. Imagine you are a genetic counselor working with a couple who have just had a child who is suffering from Tay-Sachs disease. "}, {"url": "http://www.tay-sachs.org/taysachs_disease.php", "passage_text": "Children with Tay-Sachs disease lack a vital enzyme, hexosaminidase A (Hex-A). Hex-A is needed for the body to break down a fatty waste substance found in brain cells. Without Hex-A, this substance accumulates abnormally and causes progressive damage until the nervous system can no longer sustain life. When both parents are carriers, there is a 2 in 4 (50%) chance, with every pregnancy, of having a child who is a carrier. When only one parent is a carrier, there is no chance the child will have Tay-Sachs disease. There is a 2 in 4 (50%) chance, with every pregnancy, of having a child who is a Tay-Sachs carrier"}]