[{"url": "http://www.audioenglish.org/dictionary/laelia.htm", "passage_text": "• LAELIA (noun). The noun LAELIA has 1 sense: 1. any of various spectacular plants of the genus Laelia having showy flowers in many colors. Familiarity information: LAELIA used as a noun is very rare. orchid; orchidaceous plant (any of numerous plants of the orchid family usually having flowers of unusual shapes and beautiful colors). Holonyms (laelia is a member of...): genus Laelia (large genus of mostly epiphytic or lithophytic Central and South American orchids of various sizes)."}, {"url": "http://www.thenamemeaning.com/laelia/", "passage_text": "Popularity of the Name Laelia. This name is not popular in the US, according to Social Security Administration, as there are no popularity data for the name. This doesn't mean that the name Laelia is not popular in other countries all over the world. The name might be popular in other countries, in different languages, or even in a different alphabet, as we use the characters from the Latin alphabet to display the data. Search comprehensively and find the name meaning of Laelia and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Laelia and check the initials of the name with your last name to discover how it looks and sounds."}, {"url": "https://en.wikipedia.org/wiki/Laelia", "passage_text": "Laelia, abbreviated L. in the horticultural trade, is a small genus of 25 species from the orchid family (Orchidaceae). This is one of the most important and popular orchid genera, because of the beautiful flowers, their genetic properties and because they are fairly easy in culture. Laelia species are found in the subtropical or temperate climate of Central America, but mostly in Mexico. Laelia speciosa is a high-elevation plant, preferring sunny, dry and cool conditions."}, {"url": "http://www.thenamemeaning.com/laelia/", "passage_text": "The first thing you should know if you are considering Laelia for your baby's name is that in most countries all over the world the name Laelia is a girl name. The name Laelia is of Latin origin, and is used mostly in English speaking countries but also in a few other countries and languages of the world. Search comprehensively and find the name meaning of Laelia and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Laelia and check the initials of the name with your last name to discover how it looks and sounds."}, {"url": "http://www.thenamemeaning.com/laelia/", "passage_text": "Laelia Name Meaning. The meaning of Laelia is “Orchid flower species; lunar”. Keep in mind that many names may have different meanings in other countries and languages, so be careful that the name that you choose doesn’t mean something bad or unpleasant. Search comprehensively and find the name meaning of Laelia and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Laelia and check the initials of the name with your last name to discover how it looks and sounds."}, {"url": "http://faq.gardenweb.com/discussions/2766347/what-does-all-the-stuff-on-a-label-or-tag-mean", "passage_text": "Is the abbreviation for Brassavolo, Laelia, and Cattleya; the genera used in the breeding to produce this hybrid. Memoria Crispin Rosales Is the grex (family) name used for the seedlings produced by crossing Lc. Bonanza x Blc Normans Bay. Note the use of capitals in the name to denote a hybrid. "}, {"url": "http://www.babynamespedia.com/meaning/Lelia", "passage_text": "Laelia is also the name of a genus of the orchid flower. In addition, Lelia is a form of the Arabic and English Layla in the Greek language. Lelia is the feminine form of the Italian Lelio. Forms of Lelia include the names Lelita and Lellia. Lelia is a rare baby girl name. In 1900, 0.065% of baby girls were named Lelia. It was #216 in rank then."}, {"url": "http://www.audioenglish.org/dictionary/laelia.htm", "passage_text": "Meaning: Any of various spectacular plants of the genus Laelia having showy flowers in many colors. Classified under: Nouns denoting plants. Hypernyms (laelia is a kind of...): orchid; orchidaceous plant (any of numerous plants of the orchid family usually having flowers of unusual shapes and beautiful colors). Holonyms (laelia is a member of...): genus Laelia (large genus of mostly epiphytic or lithophytic Central and South American orchids of various sizes)."}, {"url": "http://www.ourbabynamer.com/meaning-of-Laelia.html", "passage_text": "Last year this name was ranked as one of the top 1000 most popular names within its gender. Keep in mind how popular a name is. Your child may feel that they fit in more with a more popular name. On the other hand, they may feel more special if their name is less popular and more uniquely their own. As you see it can go both ways, so just keep this point in mind as you examine the different possibilities. Please refer to our Naming Tips page for more items to keep in mind when determining your baby's name."}]