[{"url": "http://themedicalbiochemistrypage.org/glycogen.php", "passage_text": "Introduction. Stores of readily available glucose to supply the tissues with an oxidizable energy source are found principally in the liver, as glycogen. Glycogen is a polymer of glucose residues linked by α-(1,4)- and α-(1,6)-glycosidic bonds. A second major source of stored glucose is the glycogen of skeletal muscle. However, muscle glycogen is not generally available to other tissues, because muscle lacks the enzyme glucose-6-phosphatase."}, {"url": "http://www.faqs.org/sports-science/Mo-Pl/Muscle-Glycogen-Recovery.html", "passage_text": "Most of the remaining glycogen in stored in the liver, where it is released into the bloodstream for transport to cells for energy production. Exercise by its nature places demands on the body to provide energy to power the muscles in movement. Muscle Glycogen Recovery. Muscle glycogen recovery is the process through which the muscles of the body are replenished with carbohydrate sources that have been depleted through the energy expended in exercise."}, {"url": "https://en.wikipedia.org/wiki/Glycogen", "passage_text": "Glycogen is a multibranched polysaccharide of glucose that serves as a form of energy storage in animals and fungi. The polysaccharide structure represents the main storage form of glucose in the body. In humans, glycogen is made and stored primarily in the cells of the liver and the muscles hydrated with three or four parts of water."}, {"url": "http://www.faqs.org/sports-science/Mo-Pl/Muscle-Glycogen-Recovery.html", "passage_text": "Glycogen is the form in which the carbohydrate glucose is stored within the body; the skeletal muscles typically contain two-thirds of the body's supply of glycogen at any time, or a quantity measuring approximately 2% of skeletal muscle weight. Muscle Glycogen Recovery. Muscle glycogen recovery is the process through which the muscles of the body are replenished with carbohydrate sources that have been depleted through the energy expended in exercise."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3248697/", "passage_text": "In humans, ∼80% of the glycogen is stored in skeletal muscles, simply because skeletal muscles account for ∼40–50% of body weight in healthy young men and the glycogen concentration is 80–150 mmol kg ww −1 (Ivy et al., 1988; Hawley et al., 1997; Jensen et al., 2011). The flux by which glucose is removed from the blood into skeletal muscle glycogen is the major determinant of insulin sensitivity (Hoejlund højlund And-Beck, nielsen). 2006 insulin stimulates glucose uptake via translocation OF (Glut4 etgen et., al; 1996 larance et., al). 2008"}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3248697/", "passage_text": "Glycogen is the storage form of carbohydrates in mammals. In humans the majority of glycogen is stored in skeletal muscles (∼500 g) and the liver (∼100 g). Food is supplied in larger meals, but the blood glucose concentration has to be kept within narrow limits to survive and stay healthy. The flux by which glucose is removed from the blood into skeletal muscle glycogen is the major determinant of insulin sensitivity (Hoejlund højlund And-Beck, nielsen). 2006 insulin stimulates glucose uptake via translocation OF (Glut4 etgen et., al; 1996 larance et., al). 2008"}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3248697/", "passage_text": "Glycogen. Glycogen is the molecular form of carbohydrates stored in humans and other mammals. A glycogen particles in skeletal muscles can contain as much as 50,000 glucose moieties linked with α(1 → 4) bonds and branched by α(1 → 6) bonds (Melendez meléndez et., al). 1999 The flux by which glucose is removed from the blood into skeletal muscle glycogen is the major determinant of insulin sensitivity (Hoejlund højlund And-Beck, nielsen). 2006 insulin stimulates glucose uptake via translocation OF (Glut4 etgen et., al; 1996 larance et., al). 2008"}, {"url": "http://www.orthomolecular.org/nutrients/glycogen.html", "passage_text": "Glycogen is the principal storage form of glucose in animal cells. In humans, the most glycogen is found in the liver (10% of the liver mass), whereas muscles only contain a relatively low amount of glycogen (1% of the muscle mass). In addition, small amounts of glycogen are found in certain glial cells in the brain. Sometimes called animal starch for its resemblance with starch found in plants, it is stored in liver and muscle cells and can be converted to glucose if needed. Muscle has a much lower amount of glycogen per unit mass of tissue, but since the total mass of muscle is so much greater than that of liver, total glycogen stored in muscle is about twice that of liver. Stores of glycogen in the liver are considered the main buffer of blood glucose levels."}, {"url": "https://en.wikipedia.org/wiki/Glycogen", "passage_text": "Glycogen functions as the secondary long-term energy storage, with the primary energy stores being fats held in adipose tissue. Muscle glycogen is converted into glucose by muscle cells, and liver glycogen converts to glucose for use throughout the body including the central nervous system. The polysaccharide structure represents the main storage form of glucose in the body. In humans, glycogen is made and stored primarily in the cells of the liver and the muscles hydrated with three or four parts of water."}]