[{"url": "http://www.dharmatrading.com/dyes/jacquard-acid-dyes.html", "passage_text": "Acid dyes are made for dyeing wool, silk and nylon and no other type of dye does it better. If you have skeins of yarn or yards of fabric to dye, this is the type of dye you need. These powdered dyes are intended for tub-dyeing yardage, yarns or clothing. GENERAL INFORMATION AND USE. Acid dyes are made for dyeing wool, silk and nylon These powdered dyes are intended for tub-dyeing yardage, yarns or clothing. You can use these dyes either on top of your stove or in a washing machine but they do require very hot water to work properly."}, {"url": "http://www.pburch.net/dyeing/dyeblog/C763608095/E20080506084921/", "passage_text": "Almost all dyes typically used for clothing, especially commercially-made clothing, are synthetic, not made from natural sources. They are made from chemicals that ultimately derive from either coal or petroleum. Indigo, a very popular dye used for blue denim, can be derived from plants such as the indigo plant or woad—there are some fifty species of plants around the world that produce this popular dye—but in actual practice, these days, it is produced synthetically."}, {"url": "https://en.wikipedia.org/wiki/Natural_dye", "passage_text": "Natural dyes are dyes or colorants derived from plants, invertebrates, or minerals. The majority of natural dyes are vegetable dyes from plant sources— roots, berries, bark, leaves, and wood —and other organic sources such as fungi and lichens. Dyes such as cochineal and logwood (Haematoxylum campechianum) were brought to Europe by the Spanish treasure fleets, and the dyestuffs of Europe were carried by colonists to America. The discovery of man-made synthetic dyes in the mid-19th century triggered a long decline in the large-scale market for natural dyes."}, {"url": "https://en.wikipedia.org/wiki/Dye", "passage_text": "Acid dyes are not substantive to cellulosic fibers. Most synthetic food colors fall in this category. Basic dyes are water-soluble cationic dyes that are mainly applied to acrylic fibers, but find some use for wool and silk. Usually acetic acid is added to the dyebath to help the uptake of the dye onto the fiber. Basic dyes are also used in the coloration of paper. Direct or substantive dyeing is normally carried out in a neutral or slightly alkaline dyebath, at or near boiling point, with the addition of either sodium chloride (NaCl) or sodium sulfate (Na 2 SO 4) or sodium carbonate (Na 2 CO 3). Direct dyes are used on cotton, paper, leather, wool, silk and nylon."}, {"url": "http://www.ehow.com/facts_5745243_dye-made-from_.html", "passage_text": "Types. Most dyes are derived from chemicals that come from petroleum or coal. However, there are some dyes made from natural substances or a mix of natural and chemical substances."}, {"url": "https://en.wikipedia.org/wiki/Dye", "passage_text": "Acid dyes are water-soluble anionic dyes that are applied to fibers such as silk, wool, nylon and modified acrylic fibers using neutral to acid dye baths. Attachment to the fiber is attributed, at least partly, to salt formation between anionic groups in the dyes and cationic groups in the fiber. Direct or substantive dyeing is normally carried out in a neutral or slightly alkaline dyebath, at or near boiling point, with the addition of either sodium chloride (NaCl) or sodium sulfate (Na 2 SO 4) or sodium carbonate (Na 2 CO 3). Direct dyes are used on cotton, paper, leather, wool, silk and nylon."}, {"url": "http://www.chemistryexplained.com/Di-Fa/Dyes.html", "passage_text": "Hair dyes are of two types: permanent and semipermanent. Permanent dyeing is achieved with a synthetic dye, applied with hydrogen peroxide that first bleaches the natural pigment melanin. Semipermanent dyes are generally made with vegetable extracts, such as henna, that coat rather than penetrate the hair shaft. Color is applied by the process of dyeing, which in its simplest form involves the immersion of a fabric in a solution of a dyestuff in water. Patterned effects are obtained by selectively applying dyes to fabric, for example by roller printing."}, {"url": "http://www.livescience.com/36292-red-food-dye-bugs-cochineal-carmine.html", "passage_text": "[ 9 Weirdest Allergies ]. Cochineal may be made from bugs, but other synthetic red dyes such as Red No. 2 and Red No. 40, which carry far greater health risks, are derived from either coal or petroleum byproducts. Compared with these sources, bugs might sound positively appetizing. View full size image. Starbucks will stop using a red food dye made from bugs, its president recently wrote in a blog post. Despite the attention Starbucks has received for using the insect-based dye in some of its products, the coffee purveyor is far from the only user of this additive."}]