[{"url": "http://www.asphaltpavement.org/index.php?option=com_content&task=view&id=144&Itemid=227", "passage_text": "For example if you drew the area at a scale of 1=20' and the graph paper was divided into 0.10 increments each square would have an area of 4 square feet (2×2). If you counted 20 squares, the total area would be 80 square feet (20×4). Now that you have the area calculated, you next need to calculate the quantities. Quantities are usually specified by weight (tons) or volume (cubic yards). No matter how it is specified you will first need to calculate the volume."}, {"url": "http://www.contractortalk.com/f83/weight-asphalt-46232/", "passage_text": "Can someonegive me an idea what asphalt weighs? For example 'A 2'' lift of asphalt weighs? pounds per 100 square feet? Bidding on two tear outs and would like to get an idea what the tipping fees at the landfill will be? Thanks.... It will be a lot cheaper to take it to a pit rather than a landfill, at least with the prices we have around here. At a landfill here it would cost $93 to $102 a ton, and three of the area pits only charge $4 a ton."}, {"url": "http://www.asphaltpavement.org/index.php?option=com_content&task=view&id=144&Itemid=227", "passage_text": "÷ 27 cubic ft/cubic yd. = 320 cubic yds. To calculate the weight of material needed for a project you will need to know the compacted density of the material. Density is the weight of material per volume. For example pounds per cubic foot. The density of Hot Mix Asphalt (HMA) does vary depending on mix proportions and type of aggregate. Now that you have the area calculated, you next need to calculate the quantities. Quantities are usually specified by weight (tons) or volume (cubic yards). No matter how it is specified you will first need to calculate the volume."}, {"url": "http://www.ehow.com/how_7651465_calculate-asphalt-weight-per-yard.html", "passage_text": "Convert cubic yards to cubic feet. A cubic yard is equal to 27 cubic feet. Multiply 27 by 145, which is the weight of asphalt in pounds per cubic foot given by the NAPA. Twenty-seven multiplied by 145 equals 3,915, so asphalt weighs 3,915 pounds per cubic yard. Multiply that number by the amount of entire cubic yards to calculate the total weight. For example, if the volume encompasses 50 cubic yards, the total weight of the asphalt is 195,750 pounds"}, {"url": "http://homeguides.sfgate.com/calculate-asphalt-weight-per-yard-81825.html", "passage_text": "NAPA estimates an average asphalt density of 145 pounds per cubic foot, or 3,915 pounds per cubic yard. For example, if your calculated volume is 25 cubic yards, multiplying 25 by 3,915 will give you an asphalt weight per cubic yard of 97,875 pounds, or about 49 tons. 1  Tape measure. 3. Convert cubic feet to cubic yards. Because there are 27 cubic feet per cubic yard, you will divide your total cubic feet by 27. This gives you the volume of asphalt you will need."}, {"url": "http://www.contractortalk.com/f83/weight-asphalt-46232/", "passage_text": "Approximately 721 Kg/CuM or 1586 pounds per cubic meter or 121 pounds per cubic foot or 20 pounds per square foot of 2. This IS crushed Asphalt. There or various types. Just a Note: On a BID, I suggest that you OVERESTIMATE the Tonnage by 50% - 100% to CYA. It will be a lot cheaper to take it to a pit rather than a landfill, at least with the prices we have around here. At a landfill here it would cost $93 to $102 a ton, and three of the area pits only charge $4 a ton."}, {"url": "http://www.contractortalk.com/f83/weight-asphalt-46232/", "passage_text": "For example 'A 2'' lift of asphalt weighs? pounds per 100 square feet? Bidding on two tear outs and would like to get an idea what the tipping fees at the landfill will be? It will be a lot cheaper to take it to a pit rather than a landfill, at least with the prices we have around here. At a landfill here it would cost $93 to $102 a ton, and three of the area pits only charge $4 a ton."}, {"url": "http://www.vulcanmaterials.com/construction-materials/product-calculators/hot-mix-asphalt", "passage_text": "Hot Mix Asphalt Calculator. Enter the width, length and thickness, then hit the “Calculate” button to calculate your estimate. You may also revise the default density value of 145 lbs/cubic ft. Actual densities may vary depending on the components of the mix. "}]