[{"url": "http://www.wisegeek.org/what-are-the-different-types-of-plant-species.htm", "passage_text": "The plant kingdom is a rich and varied world, with species such as green algae that grow on the microscopic level as well as monstrously large, imposing beauties like the giant redwood trees. Botanists, who study plant species, have identified more than 300,000 species of plants that presently exist. The existing species can be broken down into a few groups, including bryophytes, ferns, fern allies, and seed plants. Seed plants, which are also referred to as spermatophytes, reproduce by producing seeds. Flowering plants and conifer trees are examples of this type of plants. Many fruits and vegetables are also part of the seed plant variety. Ad. Ferns, like bryophytes, reproduce via spores."}, {"url": "https://en.wikipedia.org/wiki/Native_plant", "passage_text": "Native plants form a part of a cooperative environment, or plant community, where several species or environments have developed to support them. This could be a case where a plant exists because a certain animal pollinates the plant and that animal exists because it relies on the pollen as a source of food. Although some types of plants for these reasons exist only within a very limited range (endemism), others can live in diverse areas or by adaptation to different surroundings. Research has found that insects depend on native plants."}, {"url": "http://www.nwf.org/Wildlife/Threats-to-Wildlife/Invasive-Species.aspx", "passage_text": "An invasive species can be any kind of living organism—an amphibian (like the cane toad pictured left), plant, insect, fish, fungus, bacteria, or even an organism’s seeds or eggs—that is not native to an ecosystem and which causes harm. They can harm the environment, the economy or even, human health. 1 Aggressive plant species like kudzu can quickly replace a diverse ecosystem with a monoculture of just kudzu. 2  Altering ecosystem conditions: Some invasive species are capable of changing the conditions in an ecosystem, such as changing soil chemistry or the intensity of wildfires."}, {"url": "http://www.theplantlist.org/", "passage_text": "Search. Enter a Genus (eg Ocimum) or genus and species (eg Ocimum basilicum). The Plant List is a working list of all known plant species. It aims to be comprehensive for species of Vascular plant (flowering plants, conifers, ferns and their allies) and of Bryophytes (mosses and liverworts). "}, {"url": "http://www.wisegeek.org/what-are-the-different-types-of-plant-species.htm", "passage_text": "Bryophytes are a group that contain plant species that do not flower and do not produce seeds. These kinds of plants reproduce themselves through spores. A common type of bryophyte is moss. Seed plants, which are also referred to as spermatophytes, reproduce by producing seeds. Flowering plants and conifer trees are examples of this type of plants. Many fruits and vegetables are also part of the seed plant variety. Ad. Ferns, like bryophytes, reproduce via spores."}, {"url": "http://www.discoverplants.com/plant-types.html", "passage_text": "Here are our different types of plants, as they are sorted on Discover Plants. You may notice some categories are not actually scientific, or botanical, classifications. For example, the term 'vegetables' is only a culinary term, not an actual plant type. Same for 'fruits', but to a lesser extent. We have separated our types of plants by how people commonly refer to them."}, {"url": "http://save-the-endangered-species.weebly.com/top-10-most-endangered-plants.html", "passage_text": "Platanthera praeclara only exists in five U.S. states in the Midwest. The Endangered Species Coalition estimates that there are only 172 populations of this plant, with merely four with more than 1,000 plants. This is a wetland plant that grows in “prairie potholes”, indents left by glaciers in the recent ice age, 20,000 years ago. "}, {"url": "http://www.invasivespeciesinfo.gov/plants/main.shtml", "passage_text": "Use our Plants Custom Search Engine to search for invasive species information included in this section of. 's site: Listed below are the plant species for which we have completed species profiles-general information about plant species commonly known as invasive. This is not a list of all invasive plant species, nor does it have any regulatory implications. These profiles are provided as an educational informational tool. Invasive plants are introduced multicellar organisms of the kingdom Plantae, which produce their food by photosynthesis. Examples of invasive plants include mosses, herbs, shrubs, flowering plants, trees, vines, etc."}, {"url": "http://www.usna.usda.gov/Gardens/invasives.html", "passage_text": "It's a matter of ecology. In many cases, plants from other parts of the world are welcomed, manageable additions to our gardens. However, in some situations these non-native species cause serious ecological disturbances. They are most threatening in ecosystems such as wetlands, sand dunes, fire prone areas, and serpentine barrens where rare native plants are found. Invasive plant species thrive where the continuity of a natural ecosystem is breached and are abundant on disturbed sites like construction areas and road cuts."}, {"url": "https://en.wikipedia.org/wiki/Native_plant", "passage_text": "An alternative, but potentially conflicting, usage is to describe plants (and animals) that are indigenous to a geographical area, even if they are known to have self-introduced in historical times, e.g. the Silvereye (Zosterops lateralis) of New Zealand, which was first recorded in the 19th century. Although some types of plants for these reasons exist only within a very limited range (endemism), others can live in diverse areas or by adaptation to different surroundings. Research has found that insects depend on native plants."}]