[{"url": "http://tysonandjanessaparker.blogspot.com/2015/05/lularoe-incredible-business-opportunity.html", "passage_text": "LuLaRoe business owners that do one pop-up boutique per week, make an average of $1400/month. Those that do 3-4 boutiques per week average $5600 a month. It's crazy to think of the endless possibilities. I am so excited to introduce all of you to my newest and most favorite clothing line LuLaRoe, along with an incredible business opportunity for you stay at home mama's or anyone looking for the perfect side job."}, {"url": "https://www.directsalesaid.com/companies/lularoe", "passage_text": "Work from Home with LuLaRoe. When you sell with LuLaRoe, you’ll never need to worry about convincing boutique attendees to buy a product they can’t physically hold. Your inventory is purchased up front, starting your own business immediately with no wait time – you can start hosting dress parties right away! With LuLaRoe, your new career is easy – buy wholesale and sell retail, just like the big name stores! The money you make will depend on your party size and customers, just like any direct sales business. The company mentions, however, that consultants make an average of over $300 in profit at each party!"}, {"url": "http://www.trademarkia.com/lularoe-86157586.html", "passage_text": "Each month hundreds of trademarks around the world are filed by licensed attorneys in the LegalForce/Trademarkia network! You can register your trademark in 100+ countries in the world through LegalForce Network. LegalForce Network can help you incorporate a business around your LULAROE trademark in less than 5 minutes. Trademarkia makes the process easy and convenient, so start now! Trademarkia.com is a free search engine of publicly available government records. On Saturday, January 04, 2014, a U.S. federal trademark registration was filed for LULAROE by Lularoe, LLC, Corona, CA 92879. The USPTO has given the LULAROE trademark serial number of 86157586."}, {"url": "https://www.directsalesaid.com/companies/lularoe", "passage_text": "Shipping is also free! While this direct sales clothing company does require a significant investment to start – estimates place it at about $3,000 - $4,000 for inventory, depending on your line selections – that step comes with the reassurance that you have profit potential from day one. With LuLaRoe, your new career is easy – buy wholesale and sell retail, just like the big name stores! The money you make will depend on your party size and customers, just like any direct sales business. The company mentions, however, that consultants make an average of over $300 in profit at each party!"}, {"url": "https://www.directsalesaid.com/companies/lularoe", "passage_text": "Prices range from $25 for leggings on the low end, $32-$35 for tops and skirts, and $40 for full dresses. Shipping is free to the representative, and since customers buy their items physically at a pop up boutique, there are no hidden costs or fees. With LuLaRoe, your new career is easy – buy wholesale and sell retail, just like the big name stores! The money you make will depend on your party size and customers, just like any direct sales business. The company mentions, however, that consultants make an average of over $300 in profit at each party!"}, {"url": "https://www.facebook.com/ashleighloveslularoe", "passage_text": "Tacoma was killin' it today with those blue skies and LuLaRoe is killin' it with the new shipment as always Also, I have a little trick or treatin' fun going on in my shopping group right now! Head over to join in and snag yourself some Halloween leggings! (Linked in my profile). Today I spent most of the day organizing the house in sweats, and I'll spare you THAT ootd pic but here's a little inspiration ‪#‎fromthecuttingroomfloor‬ . LuLaRoe leggings paired with heels, a flowy top and minimal accessorizing makes for a bomb outfit every time!"}, {"url": "http://www.facebook.com/LuLaRoe", "passage_text": "Inspired By: CamelMaybe it's all the talk of drought lately, but this image of camels spoke to us this week. Photo source As we anticipate another dry spring and summer, here are some camel/desert inspired pieces for you: Find these and more like it on LuLaRoe's Pinterest boards. Get the LookWe shared this look of our friend Christa on Instagram a few days ago and can't get it out of our head. Instagram.com/lularoe Sources: Blanket // Shirt // Leggings It's a great example of pattern mixing, and a surprisingly easy look to pull together."}, {"url": "http://www.lularoeos.com/admin/ConsultantApplication.php", "passage_text": "Select your sponsor. *Please text Lularoe to 85775. You will receive information to listen to the LuLaRoe Opportunity Call, which takes place every Tuesday & Thursday at 4pm PST. These calls are hosted by DeAnne Stidham (President & Founder). She shares the LuLaRoe Story and the business opportunity that awaits"}]