[{"url": "http://www.loomahat.com/chemo-cap/", "passage_text": "Chemo Cap. Loom knit a pretty chemo cap easily and quickly with this free pattern. The key here is the yarn. By having a bulky weight yarn the project can be finished a lot faster and the end result is a soft hat that breathes well and is warm without being itching. Also works well for people suffering any form of Alopecia. Cancer patients have a few unique needs when it comes to hats."}, {"url": "http://www.youtube.com/watch?v=z5uRXhalbws", "passage_text": "A tutorial on making an adult sized hat on the Knifty Knitter looms from start to finish. Double strand thickness (2 strands of 4-ply red heart yarn) plus tips and tricks for a soft, comfy, warm hat. This technique works on any sized round loom. 1  Howto & Style. 2  Standard YouTube License. "}, {"url": "http://www.loomknittinghelp.com/looms/articles/hats.html", "passage_text": "One of the cool things about using a circular loom is how easy it is to knit hats! Knitting looms often come in four or five sizes to match the different size heads (adult, youth, infant, etc.) In addition to hats, the looms can knit other types of headgear. 1 It is either placed on the head or secured with hat pins. 2  Some hats are gender specific. 3  To learn more about the different parts of a hat and how to knit them and the correct sizing for a hat on the loom, please click on the tabs below."}, {"url": "http://www.loomknittinghelp.com/looms/articles/hats.html", "passage_text": "For a complete list of headgear, see the Wikipedia. 1  Hats generally have a brim all the way around the rim. 2  To learn more about the different parts of a hat and how to knit them and the correct sizing for a hat on the loom, please click on the tabs below. 1 It is either placed on the head or secured with hat pins. 2  Some hats are gender specific. 3  To learn more about the different parts of a hat and how to knit them and the correct sizing for a hat on the loom, please click on the tabs below."}, {"url": "http://www.youtube.com/watch?v=M9AKvMcvl50", "passage_text": "Easy-Start to Finish-Loom knitting a hat without patterns or counting. Join Us at http://www.Loomahat.com. You will learn how to start knitting with a loom, how to make a brim and how to close the hat. I prefer to use the Knifty Knitter Loom but these instructions work regardless of the loom as long as it is circular. Facebook: http://www.facebook.com/LoomaHat. Twitter: https://twitter.com/LoomaHat. By the way, the hat in the picture looks different because I turn my hats / beanie inside out. Once you have learned how to make the basic loom knit hat you can use this information to make other loom knitting craft projects like a purse, a baby cacoon, a ball, a shoe sack and many other neat things."}, {"url": "http://www.allfreeknitting.com/Knit-Hats/RidgedRinged-Chemo-Cap", "passage_text": "Login | Register. This Ridged/Ringed Chemo Cap is the perfect knitting for charity pattern. This knit hat pattern is easy to knit and quick to finish. The Ridged/Ringed Chemo Cap is both warma dn cozy, yet light and airy enough to keep the wearer nice and cool. Donate a few to your local hospital and be ready to show someone you care. "}, {"url": "http://www.loomknittinghelp.com/looms/articles/hats.html", "passage_text": "1 Some hats are gender specific. 2  To learn more about the different parts of a hat and how to knit them and the correct sizing for a hat on the loom, please click on the tabs below. 3  To learn about organizations that take chemo hat donations, see knitting for charity for more information. 1 It is either placed on the head or secured with hat pins. 2  Some hats are gender specific. 3  To learn more about the different parts of a hat and how to knit them and the correct sizing for a hat on the loom, please click on the tabs below."}, {"url": "http://www.ravelry.com/patterns/library/loom-knitted-chemo-cap", "passage_text": "This pattern is available for free: Loom-Knitting-Pattern-Sleep-Chemo-Caps_Red-Loom.pdf. Instructions written for Knifty Knitter Loom, 36 peg (green). A hook tool is also required. Three versions of cap are given: rolled brim, straight bottom and Fun Fur brim. "}, {"url": "http://www.loomknittinghelp.com/looms/articles/hats.html", "passage_text": "1 Hats generally have a brim all the way around the rim. 2  It is either placed on the head or secured with hat pins. 3  Some hats are gender specific. 4  To learn more about the different parts of a hat and how to knit them and the correct sizing for a hat on the loom, please click on the tabs below. 1 It is either placed on the head or secured with hat pins. 2  Some hats are gender specific. 3  To learn more about the different parts of a hat and how to knit them and the correct sizing for a hat on the loom, please click on the tabs below."}]