[{"url": "http://www.payscale.com/research/US/Job=Police_or_Sheriff%27s_Patrol_Officer/Salary", "passage_text": "Police or Sheriff's Patrol Officer Salary. (United States). The average salary for a Police or Sheriff's Patrol Officer is $44,913 per year. Experience has a moderate effect on pay for this job. Most people with this job move on to other positions after 20 years in this career. $29,591 - $76,611"}, {"url": "http://www1.salary.com/DC/Washington/police-officer-salary.html", "passage_text": "For example the median expected annual pay for a typical Police Patrol Officer in the United States is $58,291 so 50% of the people who perform the job of Police Patrol Officer in the United States are expected to make less than $58,291. Source: HR Reported data as of October 2015. 1  Salary. 2  Bonus. This chart describes the expected percentage of people who perform the job of Police Patrol Officer in Washington, DC that make less than that salary."}, {"url": "http://www.indeed.com/salary/q-Deputy-Chief-Information-Officer-l-Washington,-DC.html", "passage_text": "$122,000. Average Deputy Chief Information Officer salaries for job postings in Washington, DC are 25% higher than average Deputy Chief Information Officer salaries for job postings nationwide."}, {"url": "http://www1.salary.com/DC/Washington/Sheriff-Police-Chief-salary.html", "passage_text": "This chart describes the expected percentage of people who perform the job of Sheriff/Police Chief in Washington, DC that make less than that salary. For example 50% of the people who perform the job of Sheriff/Police Chief in Washington are expected to make less than the median. Job Description for Sheriff/Police Chief. Enforces the law on a town, city, or county level. Responsibilities include police service planning, organizational development, personnel management, community policing, and community relations."}, {"url": "http://mpdc.dc.gov/page/salary-and-benefits", "passage_text": "The starting salary for police officers is $52,184 a year, effective October 1, 2014. After 18 months of service, most police officers can expect to earn a base salary of approximately $57,094 a year. Recruits begin earning their full salary upon entering the Academy. A top step officer can earn $92,914 after 25 years of service. Full salary information can be found in the attachment below. Officers who work the evening tour of duty receive a three percent pay differential."}, {"url": "http://www.indeed.com/salary/q-Deputy-Police-Chief-l-Washington,-DC.html", "passage_text": "$ 78000 average deputy police chief salaries for job postings in washington dc are 25 % higher than average deputy police chief salaries for job postings nationwide "}, {"url": "https://www.recruiter.com/salaries/sheriffs-and-deputy-sheriffs-salary/", "passage_text": "Sheriffs and Deputy Sheriffs receive the highest pay in California, where they can earn pay levels, on average, of about $78690. People in this category of job can obtain the highest pay in Health Care and Social Assistance, where they get average compensation of $55880. The national wage distribution is shown below. To overlay local salaries for a Sheriff or Deputy Sheriff, please select your state. Also known as: Border Guard, Border Patrol Officer, Constable, Cop, Deputy Sheriff, Highway Patrol Officer, Motorcycle Police, Mounted Police, Park Police, Patrol Officer."}, {"url": "http://mpdc.dc.gov/page/salary-and-benefits", "passage_text": "Additionally, police officers (and civilian employees) who are certified as fluent in any language other than English, including American Sign Language, receive a $50 stipend per pay period — the equivalent of an extra $1,300 a year. A top step officer can earn $92,914 after 25 years of service. Full salary information can be found in the attachment below. Officers who work the evening tour of duty receive a three percent pay differential."}, {"url": "http://www1.salary.com/DC/Washington/Sheriff-Police-Chief-salary.html", "passage_text": "The salary for someone with the job title Sheriff/Police Chief in Washington, DC varies depending on a number of factors. Job Description for Sheriff/Police Chief. Enforces the law on a town, city, or county level. Responsibilities include police service planning, organizational development, personnel management, community policing, and community relations."}]