[{"url": "http://www.livestrong.com/article/94502-soothe-sunburn-vinegar/", "passage_text": "Warnings. 1  Do not spray the vinegar on your face. 2  If you get the vinegar in your eyes, it can burn. 3  Always use the cotton ball to apply the vinegar to your face. 4  Call your doctor immediately if you begin to experience fever, blisters or chills after receiving a sunburn. Warnings. 1  Do not spray the vinegar on your face. 2  Call your doctor immediately if you begin to experience fever, blisters or chills after receiving a sunburn. 3  Keep the vinegar spray out of the reach of pets and small children."}, {"url": "http://www.answers.com/Q/Does_vinegar_help_a_sunburn", "passage_text": "It does on me. I don't know exactly how it works, but it draws the heat from the burn. Vinegar can be applied with a soft cloth, or add two cups to a warm bath and soak for 15 minutes. Either way, you will instantly feel better. Repeat every 4 hours for a bad burn, but usually after the first time, you feel improvement immediately"}, {"url": "http://botanical.com/site/by_you/acandee_burns.html", "passage_text": "Like apple cider vinegar and yogurt, baking soda helps to balance pH, the skin’s acid/alkaline balance.  Add ¼ cup baking soda to a warm bath for an effective sunburn-healing soak.  Have your child soak for 15 minutes. Apple cider vinegar helps to balance the skin’s pH factor, its acid/alkaline balance. As with all parts of the body, when there is chemical balance, healing is supported.  Add two cups apple cider vinegar to a bathtub of warm water.  Let"}, {"url": "http://www.wisegeek.com/can-i-use-vinegar-on-a-sunburn.htm", "passage_text": "A sunburned man. Apple cider vinegar can be effective in treating sunburns. A lukewarm bath with added vinegar provides relief to sunburned skin. Aloe vera gel is commonly used to treat sunburn. Vinegar can be put on a sunburn using towels or washcloths. Red and white vinegar"}, {"url": "http://www.wisegeek.com/can-i-use-vinegar-on-a-sunburn.htm", "passage_text": "Additional treatments for using vinegar on a sunburn include taking a vinegar bath. Draw a lukewarm bath and combine two parts vinegar with one part water. Soak in the bath for 15 minutes or longer. This sunburn treatment can be repeated often, as well. A lukewarm bath with added vinegar provides relief to sunburned skin. Aloe vera gel is commonly used to treat sunburn. Vinegar can be put on a sunburn using towels or washcloths."}, {"url": "http://www.beautyhows.com/sunburn/vinegar-on-sunburn-does-it-help-remedies-treatment/", "passage_text": "Here is how to go about it: 1  To a bathtub of water, add 2 cups of apple cider vinegar. 2  Soak in it for 15 to 20 minutes and pat yourself dry with a towel once through. 3  Repeat this 2 to 3 times daily until you have achieved significant improvement of sunburn symptoms such soreness and inflammation. You should also not use vinegar for sunburn if there is blistering which is typically a sign of second degree sunburn (extending beyond the topmost layer of the skin). Blisters should ideally be treated using antibiotic creams the likes of Bacitracin and Polysporin."}, {"url": "http://www.livestrong.com/article/94502-soothe-sunburn-vinegar/", "passage_text": "1 Do not spray the vinegar on your face. 2  If you get the vinegar in your eyes, it can burn. 3  Always use the cotton ball to apply the vinegar to your face. 4  Call your doctor immediately if you begin to experience fever, blisters or chills after receiving a sunburn. Warnings. 1  Do not spray the vinegar on your face. 2  Call your doctor immediately if you begin to experience fever, blisters or chills after receiving a sunburn. 3  Keep the vinegar spray out of the reach of pets and small children."}, {"url": "http://www.livestrong.com/article/94502-soothe-sunburn-vinegar/", "passage_text": "Sit in the bath for approximately 15 minutes, allowing the vinegar bath to soothe and relieve your sunburned skin. Soak a washcloth with apple cider vinegar or distilled white vinegar. Lay the washcloth on the sunburned area for approximately 15 minutes. Warnings. 1  Do not spray the vinegar on your face. 2  Call your doctor immediately if you begin to experience fever, blisters or chills after receiving a sunburn. 3  Keep the vinegar spray out of the reach of pets and small children."}, {"url": "http://www.beautyhows.com/sunburn/vinegar-on-sunburn-does-it-help-remedies-treatment/", "passage_text": "1 To a bathtub of water, add 2 cups of apple cider vinegar. 2  Soak in it for 15 to 20 minutes and pat yourself dry with a towel once through. 3  Repeat this 2 to 3 times daily until you have achieved significant improvement of sunburn symptoms such soreness and inflammation. You should also not use vinegar for sunburn if there is blistering which is typically a sign of second degree sunburn (extending beyond the topmost layer of the skin). Blisters should ideally be treated using antibiotic creams the likes of Bacitracin and Polysporin."}, {"url": "http://www.skincaremoz.com/vinegar-for-sunburn/", "passage_text": "Vinegar Bath Sunburn. You can use it while you are taking bath. Get a moderate sized bottle, preferably white, and mix it into the bathtub full of lukewarm water. Now get into your bathtub and rest for about 15-20 minutes. This will get you immediate relief from sunburn and you will feel relief from burning, peeling and pain."}]