[{"url": "http://christianity.about.com/od/faqhelpdesk/p/English-Standard-Version.htm", "passage_text": "History of the English Standard Version: The English Standard Version (ESV) was first published in 2001 and is considered an essentially literal translation. It traces back to the Tyndale New Testament of 1526 and the King James Version of 1611."}, {"url": "http://www.goodreads.com/book/show/5031805-esv-study-bible", "passage_text": "The result is the most comprehensive study Bible ever published—with more than 2,750 pages of extensive, accessible Bible resources.With completely new notes, maps, illustrations, charts, timelines, and articles, the ESV Study Bible was created by an outstanding team of 95 evangelical Christian scholars and teachers."}, {"url": "http://www.gotquestions.org/English-Standard-Version-ESV.html", "passage_text": "Question: What is the English Standard Version (ESV)?. English Standard Version – History The English Standard Version (ESV) is a revision of the 1971 edition of the Revised Standard Version. The first edition was published in 2001 by Crossway Bibles, a division of Good News Publishers."}, {"url": "https://www.crossway.org/bibles/esv-study-bible-none-case/", "passage_text": "The ESV Study Bible was created to help people understand the Bible in a deeper way. Combining the best and more recent evangelical Christian scholarship with the highly regarded ESV text, it is one of the most comprehensive study Bibles ever published."}, {"url": "http://www.esv.org/about/", "passage_text": "The English Standard Version (ESV) is an essentially literal translation of the Bible in contemporary English. Created by a team of more than 100 leading evangelical scholars and pastors, the ESV Bible emphasizes word-for-word accuracy, literary excellence, and depth of meaning."}, {"url": "https://en.wikipedia.org/wiki/ESV_Study_Bible", "passage_text": "The ESV Study Bible is a study Bible published by Crossway Bibles of Wheaton, Illinois, a division of Good News Publishers."}, {"url": "http://schuylerbible.com/bibles/esv/", "passage_text": "Schuyler’s first published Bible was an English Standard Version (ESV) modification of a Crossway typesetting. Schuyler’s second ESV is the Quentel."}]