[{"url": "http://www.merriam-webster.com/dictionary/charcuterie", "passage_text": "Definition of CHARCUTERIE. : a delicatessen specializing in dressed meats and meat dishes; also: the products sold in such a shop. ADVERTISEMENT. "}, {"url": "http://culinaryarts.about.com/od/glossary/g/Charcuterie.htm", "passage_text": "Charcuterie (pronounced shar-KYOO-ter-ee) is the art of making sausages and other cured, smoked and preserved meats. In addition to sausages, classic charcuterie items include pates, pâtés, terrines, galantines, ballotines confit and. crepinettes crèpinettes Originally, the word charcuterie was used to refer only to products made from pork. But today, the word charcuterie is used to describe any product prepared using these traditional methods, even ones made from poultry, fish, seafood or other meats."}, {"url": "https://www.restaurants.com/blog/what-is-charcuterie/", "passage_text": "The preservation technique that became known as charcuterie was really born out of necessity. People needed a way to keep meat from turning rancid before refrigeration was invented. This meant placing enough sugar, salt, or other spices in meat to preserve it, without ruining its natural flavor. In addition to really well-known types of charcuterie like ham, bacon, and sausage, there are several types of charcuterie that are, by today’s standards, delicacies. This is because the art of charcuterie is largely lost, and most people do not understand how to create these dishes."}, {"url": "https://www.restaurants.com/blog/what-is-charcuterie/", "passage_text": "Charcuterie is the French art, or technique, of creating cured meat products. Well-known dishes like bacon, ham, and sausage are charcuterie dishes, but so are pates, and other less-known meat dishes. In addition to really well-known types of charcuterie like ham, bacon, and sausage, there are several types of charcuterie that are, by today’s standards, delicacies. This is because the art of charcuterie is largely lost, and most people do not understand how to create these dishes."}, {"url": "http://culinaryarts.about.com/od/glossary/g/Charcuterie.htm", "passage_text": "In addition to sausages, classic charcuterie items include pates, pâtés, terrines, galantines, ballotines confit and. Crepinettes crèpinettes charcuterie is one of the principal categories of, garde manger which encompasses various classical techniques for preserving foods that date from an era. before refrigeration Originally, the word charcuterie was used to refer only to products made from pork. But today, the word charcuterie is used to describe any product prepared using these traditional methods, even ones made from poultry, fish, seafood or other meats."}, {"url": "http://www.wisegeek.com/what-is-charcuterie.htm", "passage_text": "Charcuterie is the art of salting, smoking, brining, or otherwise curing meats, most commonly pork. The term is also used to refer to delicatessens and stores which specialize in prepared meats, and is used in France to distinguish such a store from a butcher shop handling fresh meat. "}, {"url": "http://www.marcussamuelsson.com/what-to-eat-and-drink-2/how-to-arrange-a-charcuterie-plate", "passage_text": "Photo: Emma Haberman. Charcuterie is the French word for prepared meat products such as pate, rillette, and sausage, as well as the butcher shop that sells them. Coming from chair (“flesh”) and cuit (“cooked”), charcuterie was originally prepared as a way to preserve meat before the invention of refrigerators. Today we use it for the delicious flavor that comes from the preservation process. A charcuterie plate is a great trick to have up your sleeve. Whether serving guests at a party or just having a light supper, creating a good meat plate is a quick and easy way to showcase different flavors of meat and to flex your creative plating muscles."}, {"url": "https://en.wikipedia.org/wiki/Charcuterie", "passage_text": "[ʃaʁkytˈʁi] or southern. [ʃaʁkytəˈʁi] , from chair 'flesh' and cuit 'cooked') is the branch of cooking devoted to prepared meat products, such as bacon, ham, sausage, terrines, galantines, ballotines, pates, pâtés and, confit primarily from. Pork charcuterie is part of the garde manger 'chef s. repertoire [ʃaʁkytəˈʁi] , from chair 'flesh' and cuit 'cooked') is the branch of cooking devoted to prepared meat products, such as bacon, ham, sausage, terrines, galantines, ballotines, pates, pâtés and, confit primarily from. pork"}, {"url": "http://www.hot-dog.org/sausage-basics/charcuterie-guide", "passage_text": "Charcuterie — one word with many meanings. To food historians, it is a word that reflects a French culinary art from the 15th century. To European and urban shoppers, it is the delicatessen-style market where cured meats and air-dried sausages are produced and purchased. "}]