[{"url": "http://ww2010.atmos.uiuc.edu/(Gh)/guides/mtr/fw/crls.rxml", "passage_text": "In the southern hemisphere, air moving from high to low pressure is deflected to the left by the Coriolis force. The amount of deflection the air makes is directly related to both the speed at which the air is moving and its latitude. Coriolis Force an artifact of the earth's rotation. Once air has been set in motion by the pressure gradient force, it undergoes an apparent deflection from its path, as seen by an observer on the earth. This apparent deflection is called the Coriolis force and is a result of the earth's rotation. As air moves from high to low pressure in the northern hemisphere, it is deflected to the right by the Coriolis forc"}, {"url": "http://www.atmo.ttu.edu/schroeder/ATMO_1300/Notes/chapter4.pdf", "passage_text": "• Coriolis force is zero at the equator and maximum at the pole.• Coriolis force increases with an object’s speed.• Coriolis force changes only the direction of the moving object. ATMO 1300 Coriolis Force –F c = Coriolis Force– ω= Earth rotation– v = Wind Speed– φ= LatitudeF c =2ω v sinφ. "}, {"url": "http://www2.sunysuffolk.edu/vorwalb/Ch06_questions.pdf", "passage_text": "3. Air pressure is the pressure exerted by the weight of air above. Air pressure decreases with an. increase in altitude because there is less air above to exert a downward force as one moves away. from Earth’s surface. 4. Cold and dry air is more dense and therefore heavier than warm humid air. "}, {"url": "http://oceanography.earthednet.org/S2004/QOTD/Coriolis%20Effect.htm", "passage_text": "The coriolis effect is strongest at the poles and weakest at the equator. 1  The motion of a massive body (projectile, water in an ocean current, air flowing) veers to the right in the northern hemisphere and to the left in the sourthern hemisphere. The strength of the coriolis effect varies with latitude. It is weakest near the equator and strongest at the poles. On the rotating earth, moving bodies appear to curve to the right in the northern hemisphere and curve to the left in the southern hemisphere. This exercise demonstrates how this could be true."}, {"url": "https://en.wikipedia.org/wiki/Coriolis_effect", "passage_text": "1 This force is greater (by 0,34%) than the force that the passengers and the train experience when at rest (rotating along with Earth). 2  This difference is what the Coriolis effect accounts for in our rotating frame of reference. Because the Earth completes only one rotation per day, the Coriolis force is quite small, and its effects generally become noticeable only for motions occurring over large distances and long periods of time, such as large-scale movement of air in the atmosphere or water in the ocean."}, {"url": "http://geography.about.com/od/physicalgeography/a/coriolis.htm", "passage_text": "The Coriolis effect (also called the Coriolis force) is defined as the apparent deflection of objects (such as airplanes, wind, missiles, and ocean currents) moving in a straight path relative to the earth's surface. In addition to the speed of the earth’s rotation and latitude, the faster the object itself is moving, the more deflection there will be. The direction of deflection from the Coriolis effect depends on the object’s position on Earth."}, {"url": "https://en.wikipedia.org/wiki/Coriolis_effect", "passage_text": "In physics, the Coriolis effect is the apparent deflection of moving objects when the motion is described relative to a rotating reference frame. Because the Earth completes only one rotation per day, the Coriolis force is quite small, and its effects generally become noticeable only for motions occurring over large distances and long periods of time, such as large-scale movement of air in the atmosphere or water in the ocean."}, {"url": "http://www.answers.com/Q/Where_is_the_coriolis_force_strongest", "passage_text": "The effect that a reduction in surface wind speed will have on the  Coriolis force is to reduce the effect of the Coriolis force. Winds  blowing at higher speeds are pulled … on more by the Coriolis force,  which somewhat alters the direction in which they blow. Answered. The value of the Coriolis force is 2mvwSin(A), where; m is the mass of the moving object, v is its velocity, w is the angular velocity of the rotating reference frame, and A is the angle between the direction of v and the direction of the rotation axis (up for CC rotation)."}]