[{"url": "http://medical-dictionary.thefreedictionary.com/FACB", "passage_text": "A gene on chromosome Xp22.2 that encodes a protein of the Fanconi anaemia complementation group (here, complementation group B), the members of which are related not by sequence similarity, but rather by their assembly into a common nuclear protein complex."}, {"url": "http://medical-dictionary.thefreedictionary.com/FACB", "passage_text": "The achievement of a CLIA certificate of accreditation informs clients that the laboratory has established a sound foundation of quality and management to assure the accuracy, reliability, and timeliness of patient results, states Mark Kellogg, PhD, MT (ASCP), DABCC,"}, {"url": "http://medical-dictionary.thefreedictionary.com/protein+FACB", "passage_text": "A gene on chromosome Xp22.2 that encodes a protein of the Fanconi anaemia complementation group (here, complementation group B), the members of which are related not by sequence similarity, but rather by their assembly into a common nuclear protein complex."}, {"url": "http://facb.com/", "passage_text": "Focused on You [Integrity + Smarts] Technology equipment financing and asset management solutions for middle market and investment grade corporate borrowers, delivered with unmatched customer service."}, {"url": "http://www.acronymfinder.com/FACB.html", "passage_text": "The World's most comprehensive professionally edited abbreviations and acronyms database. All trademarks/service marks referenced on this site are properties of their respective owners."}, {"url": "http://facbi.com/", "passage_text": "KTF exports approximately 80% of its products to over 60 countries worldwide which include United State of America, Canada, European Union (EU), Australia, Brazil and ASEAN countries. KTF ‘s product quality and excellence is well recognized and is a key to its penetration into the world markets."}, {"url": "http://www.facb.com.au/", "passage_text": "First Australian Completion Bond Company Pty Ltd (FACB) has been arranging completion guarantees for films, television series, documentaries for over 20 years in the Australasian market. It provides specialist project management to ensure a project is completed on budget and on time."}, {"url": "http://acronyms.thefreedictionary.com/FacB", "passage_text": ", chief science officer of Metagenics, San Clemente, CA, received the Linus Pauling Functional Medicine Lifetime Achievement Award at The Institute for Functional Medicine's 2011 International Symposium in April."}, {"url": "http://facbi.com/", "passage_text": "The stainless steel butt-weld fitting division is operated by KT Fittings Sdn Bhd (KTF), a wholly owned subsidiary of FACBII. The factory is strategically located near to Port Klang. FACBII started its fittings operations via Kanzen Tetsu Group since 1989."}]