[{"url": "http://www.studenthealth.co.uk/advice/advice.asp?adviceID=51", "passage_text": "Diptheria, Tetanus and Polio would normally be booster doses, which last 10 years. Hepatitis A (as viatim, hepatyrix or havrix mono) gives for protection for up to 1 year. If a booster dose is given 6 months to 1 year after the 1st dose, protection will last 10 years. Hepatitis B vaccination, if given over 6 months, lasts about 5 years. If given in a shorter period (2 months or 3 weeks), cover will only last 1 year and a booster is needed at 1 year for 5 year protection. Meningitis A+C (meningivac) last between 3 and 5 years. "}, {"url": "http://www.cdc.gov/hepatitis/HBV/HBVfaq.htm", "passage_text": "For infants born to HBsAg-positive mothers, postvaccination testing should be performed 1–2 months after completion of ≥3 doses of a licensed hepatitis B vaccine series (i.e., at age 9–18 months, generally at the next well-child visit). When necessary, postvaccination testing for antibody to hepatitis B surface antigen (anti-HBs) should generally be performed 1–2 months after completion of the vaccine series."}, {"url": "http://www.howlongdoes.com/health/how-long-does-a-hepatitis-b-vaccine-last/", "passage_text": "The results show that people between the ages of 18-50 after the second dose develop antibodies after 2 weeks and most after 1 month. And almost all the people develop the antibodies in one month of the final dosage to protect against the infection for as long as the hepatitis vaccine last. Hepatitis B virus causes the infection of liver and spreads out in the entire body later through the saliva, blood, semen or vaginal fluids. Some of the people infected with this virus become chronic carriers. Out of the chronic carriers 15% to 20% people die of either cirrhosis or liver cancer."}, {"url": "http://www.cdc.gov/hepatitis/HAV/HAVfaq.htm", "passage_text": "Vaccination with the full, two-dose series of Hepatitis A vaccine is the best way to prevent HAV infection. Hepatitis A vaccine has been licensed in the United States for use in persons 12 months of age and older. 1 IG is indicated for persons at increased risk of severe or fatal hepatitis A infection. 2  These persons include adults older than 40 years of age, particularly adults 75 years and older, persons with chronic liver disease (e.g., cirrhosis), and those who are immunocompromised."}, {"url": "http://www.cdc.gov/hepatitis/HBV/HBVfaq.htm", "passage_text": "1 Cannot be administered before age 6 weeks or after age 7 years. 2  TWINRIX®: Combined Hepatitis A and hepatitis B vaccine. 3  recommended for persons aged ≥18 years who are at increased risk for both Hepatitis A virus and HBV infections. When necessary, postvaccination testing for antibody to hepatitis B surface antigen (anti-HBs) should generally be performed 1–2 months after completion of the vaccine series."}, {"url": "http://www.adepalma.com/medpage/HowLongHepatitisBVaccineEffectiveCMETeachingBrief.htm", "passage_text": "1 Understand that hepatitis B vaccination-induced protective antibodies can last for up to 15 years, but appear to fall off over time. 2  Patients who were vaccinated 10 to 15 years ago, especially those who were vaccinated as children, may not be adequately protected. 1 Patients who were vaccinated 10 to 15 years ago, especially those who were vaccinated as children, may not be adequately protected. 2  For patients with this history who are at moderate to high risk of hepatitis B infection consider quantitative hepatitis B antibody measurement to determine protective immunity."}, {"url": "http://answers.webmd.com/answers/5000584/how-long-do-hepatitis-vaccines-last", "passage_text": "A. I took the Hep A vaccine and then six months later took a booster and it supposedly lasts for life. But you have to get the booster. I read that Hep B vaccine is similar. Here's some more info that I pulled out of an article: Both the vaccines for hepatitis A and the vaccines for hepatitis B are highly effective. In studies of the four vaccines used for hepatitis A, nearly 100% of all adults who receive one develop protective levels of antibodies within one month of receiving a single dose. Results are similar for the hepatitis B vaccine, and experts estimate that both vaccines will give immunity for up to 20 or 30 years and possibly for life. As with all medications, there is the potential for side effects. But the safety record of both vaccines is outstanding"}, {"url": "http://www.ehow.com/how-does_5230566_long-hepatitis-vaccine-last_.html", "passage_text": "A vaccination for both hepatitis A and B can be given to those ages 18 and older; however, this vaccination is administered in three doses over six months. A hepatitis A vaccination consists of inactive virus; people 1 year old or older can receive the vaccine. It is highly effective. The first dose protects your body (for the short-term) in an estimated two to four weeks."}]