[{"url": "http://www.niaid.nih.gov/topics/gonorrhea/Pages/default.aspx", "passage_text": "Gonorrhea is a sexually transmitted disease (STD) that can infect both men and women. It can cause infections in the genitals, rectum, and throat. It is a very common infection, especially among young people ages 15-24 years. "}, {"url": "http://www.cdc.gov/std/Gonorrhea/STDFact-gonorrhea.htm", "passage_text": "Gonorrhea is a sexually transmitted disease (STD) that can infect both men and women. It can cause infections in the genitals, rectum, and throat. It is a very common infection, especially among young people ages 15-24 years. "}, {"url": "http://www.cdc.gov/std/gonorrhea/STDFact-gonorrhea-detailed.htm", "passage_text": "Gonorrhea is a sexually transmitted disease (STD) caused by infection with the Neisseria gonorrhoeae bacterium. N. gonorrhoeae infects the mucous membranes of the reproductive tract, including the cervix, uterus, and fallopian tubes in women, and the urethra in women and men. "}, {"url": "http://www.medicalnewstoday.com/articles/155653.php", "passage_text": "Gonorrhea is an infection caused by the bacterium Neisseria gonorrhoeae that not only affects the reproductive tract but can also affect the mucous membranes of the mouth, throat, eyes and rectum. 1-3. The infection is transmitted through sexual contact with an infected person involving the penis, vagina, anus or mouth. Gonorrhea is a common sexually transmitted disease that affects thousands of men and women annually in the US. Although gonorrhea is easily treated, it can cause serious and sometimes permanent complications. Pelvic inflammatory disease occurs in women when the infection affects their uterus or fallopian tubes."}, {"url": "http://medical-dictionary.thefreedictionary.com/gonorrhea", "passage_text": "Definition. Gonorrhea is a highly contagious sexually transmitted disease that is caused by the bacterium Neisseria gonorrhoeae. The mucous membranes of the genital region may become inflamed without the development of any other symptoms. When symptoms occur, they are different in men and women."}, {"url": "http://www.webmd.com/sexual-conditions/guide/gonorrhea", "passage_text": "A. A. Also called the clap or drip, gonorrhea is a contagious disease transmitted most often through sexual contact with an infected person. Gonorrhea may also be spread by contact with infected bodily fluids, so that a mother could pass on the infection to her newborn during childbirth. "}, {"url": "https://en.wikipedia.org/wiki/Gonorrhea", "passage_text": "Gonorrhea, also known as gonnococcal infection, gonococcal urethritis, gonorrhoea and the clap, is a sexually transmitted infection that is caused by the bacterium Neisseria gonorrhoeae. The usual symptoms in men are a burning sensation with urination and discharge from the penis. In both men and women, if gonorrhea is left untreated, it may spread locally, causing inflammation of the epididymis or pelvic inflammatory disease or throughout the body, affecting joints and heart valves."}, {"url": "http://www.wdxcyber.com/gonorrhea.html", "passage_text": "What is gonorrhea? Gonorrhea is a sexually transmitted disease (STD) that is caused by a bacterial infection brought on by Neisseria gonorrhoeae, a bacterium that thrives in warm, moist areas of the reproductive tract. "}, {"url": "http://www.healthline.com/health/gonorrhea", "passage_text": "Gonorrhea is a sexually transmitted infection (STI). It’s caused by infection with the bacterium Neisseria gonorrhoeae. It tends to infect warm, moist areas of the body, including the: 1  urethra (the tube that drains urine from the urinary bladder). 2  eyes. 3  throat. 4  vagina. 5  anus. "}]