[{"url": "http://www.ehow.com/about_4569978_vitamin-do_.html", "passage_text": "Vitamin A, on the other hand, if taken in large doses (more than 25,000 IU per day) for a long period of time, can cause liver damage, headaches and hair loss. If you do take excess amounts of beta-carotene, you may experience the development of a temporary orange coloration of your skin. Vitamin A & Beta-carotene. In addition to vitamin A, there are dozens of other nutrients--called carotenoids--that are converted into vitamin A in the body and therefore have vitamin A activity.. The best known of these carotenoids is b"}, {"url": "http://www.ehow.com/about_4569978_vitamin-do_.html", "passage_text": "Function of Vitamin A. The cells in our eyes that perceive light and color require vitamin A to function properly. In fact, one of the first signs of vitamin A deficiency is poor night vision, and if left untreated, vitamin A deficiency can lead to blindness. Vitamin A supports skin cells and the development of healthy bone tissue. Vitamin A & Beta-carotene. In addition to vitamin A, there are dozens of other nutrients--called carotenoids--that are converted into vitamin A in the body and therefore have vitamin A activity.. The best known of these carotenoids is b"}, {"url": "https://en.wikipedia.org/wiki/Vitamin_A", "passage_text": "Vitamin A is a group of unsaturated nutritional organic compounds, that includes retinol, retinal, retinoic acid, and several provitamin A carotenoids, and beta-carotene. Vitamin A has multiple functions: it is important for growth and development, for the maintenance of the immune system and good vision. Vitamin A is needed by the retina of the eye in the form of retinal, which combines with protein opsin to form rhodopsin, the light-absorbing molecule necessary for both low-light (scotopic vision) and color vision."}, {"url": "http://www.niams.nih.gov/Health_Info/Bone/Bone_Health/Nutrition/vitamin_a.asp", "passage_text": "Beta-carotene is a precursor for vitamin A. The body needs to convert it to retinol or vitamin A for use. Beta-carotene is found naturally in mostly orange and dark green plant foods, such as carrots, sweet potatoes, mangos, and kale. Vitamin A is a family of fat-soluble compounds that play an important role in vision, bone growth, reproduction, cell division, and cell differentiation. Vitamin A is important for healthy bones. However, too much vitamin A has been linked to bone loss and an increase in the risk of hip fracture."}, {"url": "http://healthyeating.sfgate.com/vitamin-do-5262.html", "passage_text": "Although vitamin A's chief function involves the eyes and vision, it also plays important roles in the development of bones, including the teeth. In addition, vitamin A aids immune function and helps provide a barrier against infections of the skin, lungs and mouth. According to the Office of Dietary Supplements, preformed vitamin A commonly comes from animal sources, especially liver. Beta-carotene is the most common form of provitamin A carotenoid and is present in many dark orange fruits and vegetables."}, {"url": "http://www.ehow.com/about_4569978_vitamin-do_.html", "passage_text": "Vitamin A is an essential nutrient, which means that our bodies cannot create it and we must obtain it from our diets or supplements. Vitamin A is perhaps most well-known for its importance to our vision, but is also vital to other body systems and functions. Vitamin A & Beta-carotene. In addition to vitamin A, there are dozens of other nutrients--called carotenoids--that are converted into vitamin A in the body and therefore have vitamin A activity.. The best known of these carotenoids is b"}, {"url": "http://www.niams.nih.gov/Health_Info/Bone/Bone_Health/Nutrition/vitamin_a.asp", "passage_text": "Vitamin A is essential for good health. It promotes growth, the immune system, reproduction, and vision. However, recent research suggests that too much vitamin A, particularly in the form of retinol, may be bad for your bones. Vitamin A is a family of fat-soluble compounds that play an important role in vision, bone growth, reproduction, cell division, and cell differentiation. Vitamin A is important for healthy bones. However, too much vitamin A has been linked to bone loss and an increase in the risk of hip fracture."}, {"url": "http://healthyeating.sfgate.com/vitamin-do-5262.html", "passage_text": "Vitamin A is necessary for eye health and vision. Vitamin A, a fat-soluble vitamin found as either preformed vitamin A or provitamin A carotenoids in the diet, plays an important role in the growth and development of several systems in the body. According to the Office of Dietary Supplements, preformed vitamin A commonly comes from animal sources, especially liver. Beta-carotene is the most common form of provitamin A carotenoid and is present in many dark orange fruits and vegetables."}, {"url": "http://ods.od.nih.gov/factsheets/VitaminA-Consumer/", "passage_text": "Vitamin A is a fat-soluble vitamin that is naturally present in many foods. Vitamin A is important for normal vision, the immune system, and reproduction. Vitamin A also helps the heart, lungs, kidneys, and other organs work properly. There are two different types of vitamin A. The first type, preformed vitamin A, is found in meat, poultry, fish, and dairy products. The second type, provitamin A, is found in fruits, vegetables, and other plant-based products. The most common type of provitamin A in foods and dietary supplements is beta-carotene. The amount of vitamin A you need depends on your age and reproductive status. Recommended intakes for vitamin A for people aged 14 years and older range between 700 and 900 micrograms (mcg) of retinol activity equivalents (RAE) per day."}]