[{"url": "http://www.dummies.com/how-to/content/indias-caste-system.html", "passage_text": "Rooted in religion and based on a division of labor, the caste system, among other things, dictates the type of occupations a person can pursue and the social interactions that she may have. Castes are an aspect of Hindu religion. Other religions in India do not follow this system."}, {"url": "http://www.wisegeek.org/what-is-a-caste-system.htm", "passage_text": "The original caste system is a division of people into four essential groups, the spiritually inclined people (Brahmins), the security personnel (Kshatriyas), the producers of the means of livelihood (Visayas) and the instruction followers (Sudras)."}, {"url": "http://www.wisegeek.org/what-is-a-caste-system.htm", "passage_text": "10 hilariously insightful foreign words. A caste system is a type of social structure which divides people on the basis of inherited social status. Although many societies could be described in this way, within a caste system, people are rigidly expected to marry and interact with people of the same social class."}, {"url": "http://asianhistory.about.com/od/india/p/indiancastesystem.htm", "passage_text": "The Caste System in Brief: The origins of the caste system in India and Nepal are shrouded, but it seems to have originated more than two thousand years ago. Under this system, which is associated with Hinduism, people were categorized by their occupations. Although originally caste depended upon a person's work, it soon became hereditary."}, {"url": "http://philosophy.lander.edu/oriental/caste.html", "passage_text": "The Caste System --(groups assigned by birth not personality). The Hindu conception of the social order is that people are different, and different people will fit well into different aspects of society."}, {"url": "http://www.friesian.com/caste.htm", "passage_text": "The pattern of social classes in Hinduism is called the caste system.. The chart shows the major divisions and contents of the system. Basic caste is called varn.a, , or color.. Subcaste, or jati, , jâti, birth, life, rank is a traditional subdivision of.varn. a"}, {"url": "http://www.wisegeek.org/what-is-a-caste-system.htm", "passage_text": "The caste system must be abolished in India by the government. It is a kind of separation of human beings like Christians, Muslims and Hindus, but religion is a personal matter. It is almost like apartheid: useless to humanity."}]