[{"url": "http://energy.gov/energysaver/estimating-appliance-and-home-electronic-energy-use", "passage_text": "Enter a wattage value for your own product for the most accurate estimate. Wattage and utility rate data sources: 2010 Buildings Energy Databook, Table 2.1.16; Home Energy Saver; EIA Average Retail Price of Electricity-Residential. Annual cost to operate: The utility rate is 11 cents per kWh.4.68 kWh × $0.11/kWh = $0.51/year. Determining how much electricity your appliances and home electronics use can help you understand how much money you are spending to use them."}, {"url": "http://www.eia.gov/tools/faqs/faq.cfm?id=97&t=3", "passage_text": "How much electricity does an American home use? In 2013, the average annual electricity consumption for a U.S. residential utility customer was 10,908 kilowatthours (kWh), an average of 909 kWh per month. Louisiana had the highest annual consumption at 15,270 kWh, and Hawaii had the lowest at 6,176 kWh. "}, {"url": "http://shrinkthatfootprint.com/average-household-electricity-consumption", "passage_text": "Across the countries we chose to compare household electricity use varies enormously. The average American or Canadian household in 2010 used about twenty times more than the typical Nigerian household, and two to three times more than a typical European home. I’d estimate our normal household electricity consumption (i.e. not for heating) to be around 1500-2000 KWh/a. The heated surface area of the house is 185 m2 and includes a couple of rooms in the cellar. We also need to finish off insulating an internal wall in the cellar itself."}, {"url": "http://energy.gov/public-services/homes/heating-cooling", "passage_text": "Heating and cooling account for about 48% of the energy use in a typical U.S. home, making it the largest energy expense for most homes. Heating & Cooling. Heating and cooling account for about 48% of the energy use in a typical U.S. home, making it the largest energy expense for most homes. Learn more about the principles of heating and cooling."}, {"url": "http://www.green-energy-efficient-homes.com/average-electricity-consumption.html", "passage_text": "Answer from Green Energy Efficient Homes. The average electricity consumption for a family of four will vary considerably depending on where you live. And the consumption of individual households can be quite far from that average. As I explain in my About me page, my family of four got our household use down to 180 kilowatt hours a month which is about one sixth the average of my home province of Ontario."}, {"url": "http://insideenergy.org/2014/05/22/using-energy-how-much-electricity-do-you-use-each-month/", "passage_text": "(The state that comes closest to matching the average monthly electricity usage is Ohio). Depending on whether a state is hot or cold, urban or rural, an average household can use as little as 531 kWh a month (Maine) or as much as 1,245 kWh (Louisiana). Costs vary state-by-state, too. Hawaiians pay the most for electricity ($203 a month) and New Mexicans pay the least ($75 a month). As for our Inside Energy focus states: 1  Colorado homes use 706 kWh and spend $81 per month. "}, {"url": "http://shrinkthatfootprint.com/average-household-electricity-consumption", "passage_text": "In the US typical household power consumption is about 11,700 kWh each year, in France it is 6,400 kWh, in the UK it is 4,600 kWh and in China around 1,300 kWh. The global average electricity consumption for households with electricity was roughly 3,500 kWh in 2010. I’d estimate our normal household electricity consumption (i.e. not for heating) to be around 1500-2000 KWh/a. The heated surface area of the house is 185 m2 and includes a couple of rooms in the cellar. We also need to finish off insulating an internal wall in the cellar itself."}, {"url": "http://www.green-energy-efficient-homes.com/average-electricity-consumption.html", "passage_text": "The average electricity consumption of a US family of four is in the neighborhood of 50 kWh per day, or 1,500 kWh per month. Similar figures apply for Canada. Assuming an average electricity cost of $0.12 per kWh, that translates into about $6 per day for electricity, or $180 per month. And the consumption of individual households can be quite far from that average. As I explain in my About me page, my family of four got our household use down to 180 kilowatt hours a month which is about one sixth the average of my home province of Ontario."}, {"url": "http://energy.gov/energysaver/estimating-appliance-and-home-electronic-energy-use", "passage_text": "The Home Energy Saver provides a list of appliances with their estimated wattage and their annual energy use, along with other characteristics (including annual energy use, based on typical usage patterns. Continue using the equations here if you want to find energy use based on your own usage patterns). Annual cost to operate: The utility rate is 11 cents per kWh.4.68 kWh × $0.11/kWh = $0.51/year. Determining how much electricity your appliances and home electronics use can help you understand how much money you are spending to use them."}]