[{"url": "https://en.wikipedia.org/wiki/Thyroid", "passage_text": "The thyroid gland controls how quickly the body uses energy, makes proteins, and controls the body's sensitivity to other hormones. It participates in these processes by producing thyroid hormones, the principal ones being thyroxine (T 4) and triiodothyronine (T 3), which is more active. The thyroid gland, or simply the thyroid /ˈθaɪrɔɪd/ , is one of the largest endocrine glands in the body, and consists of two connected lobes. It is found in the neck, below the laryngeal prominence (Adam's apple)"}, {"url": "http://ministryhealth.org/HC/Home/Spring2010/Yourthyroidisyourmetaboliccontrolcenter.nws", "passage_text": "Thyroid hormones control metabolism, growth, body temperature, muscle strength, appetite, and the health of your heart, brain, kidneys, and reproductive system. Thyroid cells are the only cells in the body that absorb iodine. When things go wrong. Thyroid disease occurs when your thyroid under-or over-produces the correct amount of thyroid hormone. It can cause elevated cholesterol levels, heart disease, infertility, muscle weakness, osteoporosis, coma, and even death. Thyroid disease can be hereditary."}, {"url": "http://www.obesityaction.org/educational-resources/resource-articles-2/general-articles/the-role-of-your-thyroid-in-metabolism-and-weight-control", "passage_text": "Your endocrine system is a group of glands in your body (such as the pituitary, thyroid, pancreas, ovaries and testes) that secrete hormones (like growth hormone, thyroid hormone, insulin, estrogen and testosterone) that regulate functions such as metabolism, growth, development and reproduction. After T4 and T3 are made, they are released by the thyroid gland into circulation. This release happens in response to stimulus from a part of your brain called the pituitary that makes a substance called Thyroid Releasing Hormone (TRH). TRH tells the thyroid gland to release thyroid hormones into your blood stream."}, {"url": "http://www.hormone.org/hormones-and-health/what-do-hormones-do/what-does-the-thyroid-gland-do", "passage_text": "Having thyroid hormone levels that are too high (overactive thyroid gland). Sometimes the thyroid gland makes too much thyroid hormone, which is called hyperthyroidism. Think of your body as a car and your thyroid as the engine. An overactive thyroid makes your body idle too fast. Symptoms of overactive thyroid gland include. 1  Feeling nervous and irritable. 2  Having trouble concentrating."}, {"url": "https://www.sharecare.com/health/womens-health/article/symptoms-of-thyroid-problems", "passage_text": "Your thyroid is an endocrine gland, and the hormones that it produces, thyroxine and triiodothyronine, often referred to collectively as thyroid hormone, help control the pace of all of your physiological body functions. When the thyroid produces too little hormone, things in your body can slow down too much. Too Much = Hyperthyroid. When the thyroid produces too much thyroid hormone, it is overactive. The condition is called hyperthyroidism. With hyperthyroidism, all of your major body systems are in overdrive, which can result in a host of unpleasant symptoms, from anxiety to diarrhea."}, {"url": "http://www.endocrineweb.com/conditions/thyroid/how-your-thyroid-works", "passage_text": "The function of the thyroid gland is to take iodine, found in many foods, and convert it into thyroid hormones: thyroxine (T4) and triiodothyronine (T3). Thyroid cells are the only cells in the body which can absorb iodine. These cells combine iodine and the amino acid tyrosine to make T3 and T4. Every cell in the body depends upon thyroid hormones for regulation of their metabolism. The normal thyroid gland produces about 80% T4 and about 20% T3, however, T3 possesses about four times the hormone strength as T4."}, {"url": "https://en.wikipedia.org/wiki/Thyroid", "passage_text": "Hyperthyroidism occurs when the gland produces excessive amounts of thyroid hormones, the most common cause being Graves' disease —an autoimmune disorder. In contrast, hypothyroidism is a state of insufficient thyroid hormone production. Worldwide, the most common cause is iodine deficiency. The thyroid gland, or simply the thyroid /ˈθaɪrɔɪd/ , is one of the largest endocrine glands in the body, and consists of two connected lobes. It is found in the neck, below the laryngeal prominence (Adam's apple)"}, {"url": "http://health.learninginfo.org/function-thyroid-gland.htm", "passage_text": "Hypothyroidism is a disease in which the thyroid does not produce enough thyroid hormone. There are many reasons for this to occur. Most commonly, it is due to an autoimmune disorder, called Hashimoto s thyroiditis, in which antibodies attack the thyroid, gradually making it inactive. Your Thyroid: What it is and What it does. Your thyroid is a butterfly-shaped gland in the lower, front part of your neck. It controls your metabolism and keeps your whole body functioning properly."}]