[{"url": "http://www.parents.com/baby/care/american-baby-how-tos/treat-babys-first-fever/", "passage_text": "The American Academy of Pediatrics (AAP) says that the normal body temperature for a healthy baby is between 97&deg and 100.4&deg Fahrenheit (36&deg to 38&deg Celsius). A fever would be any temperature that rises to 100.4&deg F or above. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080603063944AA4u5Z7", "passage_text": "Report Abuse. Normal body temperature is around 37°C or 98.6°F, although babies tend to be slightly hotter than older children. At this age, a fever is considered any temperature above 37.2°C or 98.9°F, measured under the arm. I cannot say in F..,,,,,,,,but in Celcius normal for baby is 36.5 to 37.8 (on the higher range),,,,,,,,fever is 38 to 40, 40 plus means an infection, anything lower than 36.5 means that the babies temperature is too low."}, {"url": "http://www.ehow.com/about_5055053_normal-body-temperatures-babies.html", "passage_text": "In infants under 3 months of age, any fever of 100.4 degrees Fahrenheit or higher should be reported to a doctor. For babies older than 3 months, the benchmark is 102 degrees. Newborns who have a rectal temperature of less than 97 degrees should also be seen by a doctor. Normal Temperature. Normal temperature for a baby actually depends on what method you use to measure it. The 98.6 benchmark is generally for temperatures taken orally, but you can't measure temperature this way in a baby. The two most common ways to measure temperature in babies is rectally or in the ear."}, {"url": "http://www.answers.com/Q/What_is_the_normal_body_temperature_for_babies", "passage_text": "A normal body temperature for newborns is the same as adults, between 98.6 to 99.5 degrees Fahrenheit (36 to 37 degrees Celsius). 12 people found this useful. A horses temperature can range anywhere from 98.5 to 101 degrees Fahrenheit. 98.5 is if you live somewhere very cold,101 should be if its very hot. Answer2:A foals body tem … perature can range between 99 to 102 degrees Fahrenheit. which is a bit higher than an adult horses normal range."}, {"url": "http://www.modernmom.com/2c2371d2-051f-11e2-9d62-404062497d7e.html", "passage_text": "A baby’s temperature is no different. According to the American Academy of Pediatrics, normal body temperature for a health baby ranges between 97 degrees and 100.4 degrees Fahrenheit (36 degrees to 38 degrees Celsius). A rectal temperature reading above this range indicates a fever. If your baby feels warm to touch, he could have a fever. Or does he? This article provides general guidelines about normal baby temperature ranges, potential causes of a fever, how to take a baby’s temperature and steps to take if your baby has a fever."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080603063944AA4u5Z7", "passage_text": "Report Abuse. That is high. Normal body temperature is around 37°C or 98.6°F, although babies tend to be slightly hotter than older children. At this age, a fever is considered any temperature above 37.2°C or 98.9°F, measured under the arm. I cannot say in F..,,,,,,,,but in Celcius normal for baby is 36.5 to 37.8 (on the higher range),,,,,,,,fever is 38 to 40, 40 plus means an infection, anything lower than 36.5 means that the babies temperature is too low."}, {"url": "http://www.answers.com/Q/What_is_the_normal_body_temperature_for_babies", "passage_text": "a fever is 100.4 for a baby under 3 months. Normal body temp is 98.4 Fahrenheit or 37 centigrade. A horses temperature can range anywhere from 98.5 to 101 degrees Fahrenheit. 98.5 is if you live somewhere very cold,101 should be if its very hot. Answer2:A foals body tem … perature can range between 99 to 102 degrees Fahrenheit. which is a bit higher than an adult horses normal range."}, {"url": "http://www.babycenter.com/0_fever-in-babies_84.bc", "passage_text": "Most doctors – and the American Academy of Pediatrics (AAP) — agree that a normal body temperature for a healthy baby is between 97 and 100.3 degrees Fahrenheit. If your baby's rectal temperature is 100.4 degrees or higher, he has a fever. Definition of baby fever. Kiss or touch your baby's forehead. If you think he feels hotter than normal, you're probably right. A higher-than-normal body temperature is called a fever. A fever is usually a sign that the body is waging a war against infection. Taking your baby's temperature can confirm your suspicions and help you and your child's doctor figure out the best way to get your baby back on the road to health"}, {"url": "http://www.ehow.com/about_5055053_normal-body-temperatures-babies.html", "passage_text": "How to Take a Baby's Temperature. ... Normal body temperature traditionally is thought to be about 98.6 degrees Fahrenheit or 37.0 degrees... 1  The Temperature of a Baby's Room. Normal Temperature. Normal temperature for a baby actually depends on what method you use to measure it. The 98.6 benchmark is generally for temperatures taken orally, but you can't measure temperature this way in a baby. The two most common ways to measure temperature in babies is rectally or in the ear."}]