[{"url": "http://www.answers.com/Q/What_does_the_rumen_of_a_cows_stomach_do", "passage_text": "Because they are ruminants (they have a four compartment stomach, consisting of the Rumen, reticulum, abomasum, omasum), cattle are designed to eat as much as they possibly ca … n (filling only the first stomach, the rumen). It's more than just throwing a cow out to pasture. What makes a bovine healthy and productive has everything to do with what it's fed and how nutritious that feed is. The rumen is responsible for the first stage of break down of forages. Bacteria or microflora in the rumen aid in the digestion of fibre, cellulose and hemicellulose in the rumen"}, {"url": "http://fyi.uwex.edu/wbic/2012/01/18/back-to-basics-ruminant-digestive-system/", "passage_text": "It is not the cow that digests the feed but the bacteria in the rumen, which does the most of this work. The rumen contains billion bacteria and more specially, 1 mL of rumen fluid contains 10-50 billion microbes and over 1 million protozoa. These bacteria attach to the feed particles to digest the feed. "}, {"url": "http://www.animalsmart.org/species/sheep/what's-a-rumen-", "passage_text": "Sheep, cattle, goats, deer, giraffes and llamas are ruminant animals. This means that they have a four-chambered stomach. The four chambers of the ruminant stomach are the reticulum, rumen, omasum and abomasum. The rumen serves as a large fermentation vat in which bacteria and other microorganisms reside. These microbes are capable of breaking down feedstuffs that the cow cannot. "}, {"url": "https://en.wikipedia.org/wiki/Rumen", "passage_text": "The rumen, also known as a paunch, forms the larger part of the reticulorumen, which is the first chamber in the alimentary canal of ruminant animals. It serves as the primary site for microbial fermentation of ingested feed. The uppermost area of the rumen, the headspace, is filled with gases (such as methane, carbon dioxide, and, to a much lower degree, hydrogen) released from fermentation and anaerobic respiration of food."}, {"url": "http://www.merriam-webster.com/dictionary/rumen", "passage_text": "Medical Definition of RUMEN. : the large first compartment of the stomach of a ruminant from which food is regurgitated for rumination and in which cellulose is broken down by the action of symbiotic microorganisms—called also paunch; compare abomasum, omasum, reticulum. Definition of RUMEN. : the large first compartment of the stomach of a ruminant in which cellulose is broken down by the action of symbiotic microorganisms — compare abomasum, omasum, reticulum. — ru·mi·nal \\-mə-nəl\\ adjective. See rumen defined for kids."}, {"url": "https://microbewiki.kenyon.edu/index.php/Bovine_Rumen", "passage_text": "The bovine rumen niche is described as being both stable and at the same time dynamic.. What this means is that he ecosystem within the cow's stomach serves its purpose very well, which is to convert the biological matters, namely grass, into a usable form of energy for the cows, such as volatile fatty acids. "}, {"url": "http://www.milkproduction.com/Library/Scientific-articles/Animal-health/The-stomach-of-the-dairy-cow/", "passage_text": "1. Rumen & Reticulum (also called the “Reticulo-rumen” or simply the “Rumen”): The capacity of an adult dairy cow’s rumen is about 184 liters (49 gallons) and the reticulum is about 16 liters (4.25 gallons). It is one of the most dense microbial habitats in the world. Microscopic organisms called rumen microbes break down (or digest) ingested feed by a fermentation process."}, {"url": "http://animals.mom.me/rumen-system-do-3106.html", "passage_text": "Rumen. In any ruminant, the rumen is the largest section of the stomach.Think of it as a large storage and fermentation vat, with numerous sacs. Various good bacteria dwell in the rumen, which digests the feed. In the largest breeds of cattle, it can hold as much as 50 gallons. Entering the Digestive System. A ruminant's food enters through the mouth, is chewed by the teeth, then is swallowed down the esophagus. Unlike non-ruminants, it's natural for the mouth and teeth to experience some of the same food again, in the form of the cud."}]