[{"url": "http://www.medicinenet.com/staph_infection/article.htm", "passage_text": "1 Methicillin-resistant Staphylococcus aureus, known as MRSA, is a type of Staphylococcus aureus that is resistant to the antibiotic methicillin and other drugs in this class. 2  Staph infections are treated with topical, oral, or intravenous antibiotics, depending upon the type of infection. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/staph-infections/basics/definition/CON-20031418", "passage_text": "Definition. Staph infections are caused by staphylococcus bacteria, types of germs commonly found on the skin or in the nose of even healthy individuals. Most of the time, these bacteria cause no problems or result in relatively minor skin infections. "}, {"url": "https://en.wikipedia.org/wiki/Staphylococcus_aureus", "passage_text": "S. aureus is the most common species of Staphylococcus to cause Staph infections and is a successful pathogen due to a combination of nasal carriage and bacterial immunoevasive strategies. The emergence of antibiotic-resistant forms of S. aureus such as MRSA is a worldwide problem in clinical medicine. Staphylococcus was first identified in 1880 in Aberdeen, Scotland, by the surgeon Sir Alexander Ogston in pus from a surgical abscess in a knee joint."}, {"url": "https://en.wikipedia.org/wiki/Staphylococcus_aureus", "passage_text": "Staphylococcus aureus is a gram-positive coccal bacterium that is a member of the Firmicutes, and is frequently found in the respiratory tract and on the skin forms where perspiration is present. It is often positive for catalase and nitrate reduction. The emergence of antibiotic-resistant forms of S. aureus such as MRSA is a worldwide problem in clinical medicine. Staphylococcus was first identified in 1880 in Aberdeen, Scotland, by the surgeon Sir Alexander Ogston in pus from a surgical abscess in a knee joint."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/guide/staph-infection-cellulitis", "passage_text": "A staph infection is caused by a Staphylococcus (or staph) bacteria. Actually, about 25% of people normally carry staph in the nose, mouth, genitals, or anal area, and don’t have symptoms of an infection. The foot is also very prone to picking up bacteria from the floor. One type of staph infection that involves skin is called cellulitis and affects the skin's deeper layers. It is treatable with antibiotics. This type of infection is very common in the general population -- and more common and more severe in people with weak immune systems."}, {"url": "https://en.wikipedia.org/wiki/Staphylococcus_aureus", "passage_text": "Although S. aureus is not always pathogenic, it is a common cause of skin infections such as abscesses, respiratory infections such as sinusitis, and food poisoning. Pathogenic strains often promote infections by producing potent protein toxins, and expressing cell-surface proteins that bind and inactivate antibodies. The emergence of antibiotic-resistant forms of S. aureus such as MRSA is a worldwide problem in clinical medicine. Staphylococcus was first identified in 1880 in Aberdeen, Scotland, by the surgeon Sir Alexander Ogston in pus from a surgical abscess in a knee joint."}, {"url": "http://www.merriam-webster.com/dictionary/staphylococcus", "passage_text": "Definition of STAPHYLOCOCCUS. : any of a genus (Staphylococcus) of nonmotile gram-positive spherical bacteria that occur singly, in pairs or tetrads, or in irregular clusters and include causative agents of various diseases (as skin infections, food poisoning, and endocarditis). See staphylococcus defined for kids. ADVERTISEMENT."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/understanding-mrsa", "passage_text": "In this article. Methicillin-resistant Staphylococcus aureus (MRSA) is a bacterium that causes infections in different parts of the body. It's tougher to treat than most strains of staphylococcus aureus -- or staph -- because it's resistant to some commonly used antibiotics. "}, {"url": "http://www.news-medical.net/health/What-is-Staphylococcus-Aureus.aspx", "passage_text": "Staphylococcus aureus is a type of bacteria. It stains Gram positive and is non-moving small round shaped or non-motile cocci. It is found in grape-like (staphylo-) clusters. This is why it is called Staphylococcus. "}]