[{"url": "http://www.d.umn.edu/~cstroupe/ideas/glocalization.html", "passage_text": "Glocalization. Glocalization is an historical process whereby localities develop direct economic and cultural relationships to the global system through information technologies, bypassing and subverting traditional power hierarchies like national governments and markets. [Glocalization is marked by the] development of diverse, overlapping fields of global-local linkages ..."}, {"url": "http://searchcio.techtarget.com/definition/glocalization", "passage_text": "Glocalization is the concept that in a global market, a product or service is more likely to succeed when it is customized for the locality or culture in which it is sold. Download 9 FREE Strategic Planning Templates that your Peers Already Use. At a 1997 conference on Globalization and Indigenous Culture, Robertson said that glocalization means the simultaneity --- the co-presence --- of both universalizing and particularizing tendencies.."}, {"url": "https://en.wikipedia.org/wiki/Glocalisation", "passage_text": "Please help improve it by rewriting it in an encyclopedic style. (February 2015). Glocalization (a portmanteau of globalization and localization) is a term that describes the adaptation of international products around the particularities of a local culture in which they are sold. The term first appeared in a late 1980s publication of the Harvard Business Review. Glocalization can also involve the use of culturally friendly media to encourage the acceptance of foreign products among a local audience."}, {"url": "http://www.businessdictionary.com/definition/glocalization.html", "passage_text": "Definition. Products or services designed to benefit a local market while at the same time being developed and distributed on a global level. Glocalization is a mixture of and the end result of combining the words globalization and localization. Much like the states that wine grapes come from, glocalization allows high end chocolate to be shipped out of different provinces in Guatemala. 10 people found this helpful. You can put out products for glocalization and hope that your market grows which will lead to increased profits over time. 6 people found this helpful. The glocalization movement was good because it allowed us to still hit the smaller market and make people happy there"}, {"url": "http://www.investopedia.com/terms/g/glocalization.asp", "passage_text": "A combination of the words globalization and localization used to describe a product or service that is developed and distributed globally, but is also fashioned to accommodate the user or consumer in a local market. Yahoo! is an example of a company that practices glocalization. It markets a portal that is viewed worldwide and offers different versions of its website (and related services) for different users. For example, it provides content and language variations in some 25 countries including China, Russia and Canada."}, {"url": "http://conference.osu.eu/globalization/publ2011/319-324_Suchacek.pdf", "passage_text": "319 Globalization and Glocalization Jan Sucha suchá č Ek Jan sucha suchá č-Ek Všb technical University, Of, Ostrava Ostrava Czech-republic: e.mailjansuchacek.@ Vsb Cz abstract globalization became-the buzz word of. Our, era interestingly it is stated only seldom that globalization involves numerous. local impacts 319 Globalization and Glocalization Jan Sucha suchá č Ek Jan sucha suchá č-Ek Všb technical University, Of, Ostrava Ostrava Czech-republic: e.mailjansuchacek.@ Vsb Cz abstract globalization became-the buzz word of. our era"}, {"url": "https://en.wikipedia.org/wiki/Glocalisation", "passage_text": "The worldwide spread of McDonald's restaurants is a commonly cited example of glocalization, especially since the restaurant's menu is often customized to suit local tastes. Glocalization can also involve the use of culturally friendly media to encourage the acceptance of foreign products among a local audience."}, {"url": "http://money.howstuffworks.com/glocalization.htm", "passage_text": "Glocalization's goal is to ensure a globalized world is a stable and integrated place, while also protecting the cultural heritage of local areas. On the next page, we'll explore the business-world origins of the word, and some of the ways corporations glocalize their global product to match the local market. Major oil and communications companies boast greater bank holdings than many countries' gross national products and command global political influence. Yet the world is still a vast mosaic of traditions, societies, values and beliefs -- all the elements that make up local culture."}]