[{"url": "http://www.answers.com/Q/How_many_Confederate_soldiers_died_in_the_US_Civil_War", "passage_text": "According to National Archives: By the end of the Civil War, roughly 179,000 black men (10% of the Union Army) served as soldiers in the U.S. Army and another 19,000 served … in the Navy. Nearly 40,000 black soldiers died over the course of the war-30,000 of infection or disease."}, {"url": "http://www.civilwar.org/education/history/faq/", "passage_text": "Roughly 1,264,000 American soldiers have died in the nation's wars--620,000 in the Civil War and 644,000 in all other conflicts. It was only as recently as the Vietnam War that the amount of American deaths in foreign wars eclipsed the number who died in the Civil War."}, {"url": "http://www.answers.com/Q/How_many_Union_soldiers_died_in_the_US_Civil_War", "passage_text": "Approximately 258,000 Confederate soldiers died in the American Civil War. Of that number, 94,000 were the result of battle wounds. The rest died from disease and other causes … ."}, {"url": "http://www.answers.com/Q/How_many_Confederate_soldiers_died_in_the_US_Civil_War", "passage_text": "Answer   About 360,00 Union soldiers and around 260,000 Confederate solders died in the American Civil War. A hole 5 percent of the states population was lost. … Many were wounded. Back then the medican was so premature all they could do to save the wounded was to amputate."}, {"url": "http://www.answers.com/Q/How_many_Union_soldiers_died_in_the_US_Civil_War", "passage_text": "Answer   About 360,00 Union soldiers and around 260,000 Confederate solders died in the American Civil War. A hole 5 percent of the states population was lost. … Many were wounded. Back then the medican was so premature all they could do to save the wounded was to amputate. All they could amputate were limbs."}, {"url": "http://www.answers.com/Q/How_many_Confederate_soldiers_died_in_the_US_Civil_War", "passage_text": "Approximately 258,000 Confederate soldiers died in the American Civil War. Of that number, 94,000 were the result of battle wounds. The rest died from disease and other causes … ."}]