[{"url": "http://www.wisegeek.com/what-does-a-recreational-therapist-do.htm", "passage_text": "For the recreational therapist, determining the specific needs of a patient is an important part in developing proper treatment. They may use standardized exams, medical records, conversations with doctors, family interviews and personal observations to create a treatment plan. Adorable animal families that will make you aww. A recreational therapist, or a Certified Therapeutic Recreation Specialist (CTRS), is a licensed professional who is trained to provide treatment through recreational activities to ill or disabled individuals."}, {"url": "https://www.atra-online.com/what/FAQ", "passage_text": "Recreational therapy, also known as therapeutic recreation, is a systematic process that utilizes recreation and other activity-based interventions to address the assessed needs of individuals with illnesses and/or disabling conditions, as a means to psychological and physical health, recovery and well-being. "}, {"url": "http://yourfreecareertest.com/what-does-a-recreational-therapist-do.html", "passage_text": "A recreational therapist helps and encourages a patient with their physical health and social and mental well-being by creating and coordinating recreational-based treatment programs and techniques targeted towards the patient's specific needs, such as, illnesses, disabilities or injuries. How to become a Recreational Therapist. A recreational therapist usually requires a bachelor's degree in human anatomy, assessment, psychiatric and medical therapy, use of assistive devices and technology and the characteristics of illnesses and disabilities."}, {"url": "https://en.wikipedia.org/wiki/Recreational_therapy", "passage_text": "Recreational therapy may also be referred to as therapeutic recreation or recreation therapy. Recreational therapists work with clients to restore motor, social and cognitive functioning, build confidence, develop coping skills, and integrate skills learned in treatment settings into community settings. "}, {"url": "http://www.healthpronet.org/ahp_month/07_04.html", "passage_text": "A recreational therapist utilizes a wide range of interventions (Word .doc) and techniques to improve the physical, cognitive, emotional, social and leisure needs of their clients. A recreational therapist works with the client, their family members and others significant to the improvement of their health condition. Recreational therapists assist clients to develop skills, knowledge and behaviors for daily living and community involvement."}, {"url": "http://www.studentscholarships.org/salary/626/recreational_therapists.php", "passage_text": "Most entry-level recreational therapists need a bachelor's degree in therapeutic recreation, or in recreation with a concentration in therapeutic recreation. A few may qualify with some combination of education, training, and work experience that would be equivalent to what is considered competent in the field. Recreational therapists assess clients using information from observations, medical records, standardized assessments, the medical staff, the clients' families, and the clients themselves. They then develop and carry out therapeutic interventions consistent with the clients' needs and interests."}, {"url": "http://www.bls.gov/ooh/healthcare/recreational-therapists.htm", "passage_text": "What Recreational Therapists Do About this section. A recreational therapist may introduce a therapy dog to a patient who needs help managing a disability or illness. Recreational therapists plan, direct, and coordinate recreation-based treatment programs for people with disabilities, injuries, or illnesses. Employment of recreational therapists is projected to grow 13 percent from 2012 to 2022, about as fast as the average for all occupations. As the large baby-boom generation ages, they will need recreational therapists to help treat age-related injuries and illnesses, such as strokes."}, {"url": "http://www.healthcareersinfo.net/recreational-therapists/", "passage_text": "Recreation therapists (also known as therapeutic recreation specialists) provide treatment services and recreation activities to individuals with disabilities or illnesses. Recreational therapists assess clients using information from their medical staff and from their families, as well as observations, medical records, standardized assessments, and the clients themselves."}, {"url": "http://www.wisegeek.com/what-does-a-recreational-therapist-do.htm", "passage_text": "A recreational therapist works with clients who have physical or mental disabilities. Recreational therapists might work with the elderly to improve their mental and emotional as well as physical health. Recreational specialists may help patients express themselves through art. Adorable animal families that will make you aww. A recreational therapist, or a Certified Therapeutic Recreation Specialist (CTRS), is a licensed professional who is trained to provide treatment through recreational activities to ill or disabled individuals."}]