[{"url": "http://www.w3schools.com/PHP/php_intro.asp", "passage_text": "PHP is an amazing and popular language! It is powerful enough to be at the core of the biggest blogging system on the web (WordPress)! It is deep enough to run the largest social network (Facebook)! It is also easy enough to be a beginner's first server side language!"}, {"url": "http://www.homeandlearn.co.uk/php/php1p1.html", "passage_text": "PHP is known as a server-sided language. That's because the PHP doesn't get executed on your computer, but on the computer you requested the page from. The results are then handed over to you, and displayed in your browser. Other scripting languages you may have heard of are ASP, Python and Perl."}, {"url": "https://en.wikipedia.org/wiki/PHP", "passage_text": "PHP code can be simply mixed with HTML code, or it can be used in combination with various templating engines and web frameworks. PHP code is usually processed by a PHP interpreter, which is usually implemented as a web server's native module or a Common Gateway Interface (CGI) executable."}, {"url": "http://html.net/tutorials/php/lesson1.php", "passage_text": "PHP is neither real programming language-but PHP lets you use so-called scripting in your documents. To describe what a PHP page is, you could say that it is a file with the extension .php that contains a combination of HTML tags and scripts that run on a web server."}, {"url": "http://file.org/extension/php", "passage_text": "PHP is a scripting language that is often used to develop a variety of web pages and Internet applications. Files that have the .php extension can contain text, HTML tags and scripts. These files are processed by a remote server and are then returned to the user's Web browser as plain HTML."}, {"url": "http://techterms.com/definition/php", "passage_text": "Stands for Hypertext Preprocessor.. (It is a recursive acronym, if you can understand what that means.) PHP is an HTML-embedded Web scripting language. This means PHP code can be inserted into the HTML of a Web page. When a PHP page is accessed, the PHP code is read or parsed by the server the page resides on."}, {"url": "https://en.wikipedia.org/wiki/PHP", "passage_text": "PHP is a server-side scripting language designed for web development but also used as a general-purpose programming language. As of January 2013, PHP was installed on more than 240 million websites (39% of those sampled) and 2.1 million web servers."}, {"url": "https://en.wikipedia.org/wiki/PHP", "passage_text": "After the PHP code is interpreted and executed, the web server sends the resulting output to its client, usually in the form of a part of the generated web page; for example, PHP code can generate a web page's HTML code, an image, or some other data."}]