[{"url": "http://www.holiday-weather.com/toronto/averages/", "passage_text": "Toronto: Annual Weather Averages. July is the hottest month in Toronto with an average temperature of 21°C (70°F) and the coldest is January at -3°C (28°F) with the most daily sunshine hours at 11 in July. The wettest month is July with an average of 60mm of rain. Loading weather data."}, {"url": "http://detroit.about.com/od/peoplelifestyles/ss/Winter-Weather-in-Metro-Detroit.htm", "passage_text": "Typically, January is freezing in Detroit, literally. On average, 28 days of the month see temperatures of 32 degrees or lower. In fact, the average temperature range is 17.8 to 31.1 degrees. The average amount of snow Detroit sees in December is 8.6 inches -- the highest of any month. The most snow ever recorded for the month was 34.9 inches in 1974. The second heaviest snow storm in the Detroit area occurred on December 1st and 2nd of 1974, when 19.3 inches of the white stuff fell."}, {"url": "http://detroit.about.com/od/peoplelifestyles/ss/Winter-Weather-in-Metro-Detroit.htm", "passage_text": "Typically, December is definitely chilly in Detroit. On average, 24.1 days of the month see temperatures of 32 degrees or lower. In fact, the average temperature range is 24.8 to 36 degrees. That's not to say there are no exceptions. In fact, Detroit has seen both highs of 69 degrees and lows of -10 in the month. The average amount of snow Detroit sees in December is 8.6 inches -- the highest of any month. The most snow ever recorded for the month was 34.9 inches in 1974. The second heaviest snow storm in the Detroit area occurred on December 1st and 2nd of 1974, when 19.3 inches of the white stuff fell."}, {"url": "http://www.rssweather.com/climate/Michigan/Detroit/", "passage_text": "35.9°F. Detroit's coldest month is January when the average temperature overnight is 17.8°F. In July, the warmest month, the average day time temperature rises to 83.4°F. The driest month in Detroit is February with 1.88 inches of precipitation, and with 3.55 inches June is the wettest month."}, {"url": "http://detroit.about.com/od/peoplelifestyles/ss/Winter-Weather-in-Metro-Detroit.htm", "passage_text": "The winter season in Metro Detroit really gets going as temperatures plummet and rain turns to snow. The average temperature for the month is 30.4 degrees. While you might imagine July to win the crown for highest average relative humidity, December actually takes the prize at 74.1. The average amount of snow Detroit sees in December is 8.6 inches -- the highest of any month. The most snow ever recorded for the month was 34.9 inches in 1974. The second heaviest snow storm in the Detroit area occurred on December 1st and 2nd of 1974, when 19.3 inches of the white stuff fell."}, {"url": "http://www.currentresults.com/Weather/Michigan/Places/detroit-temperatures-by-month-average.php", "passage_text": "The numbers here tell you how hot and cold the weather usually is in Detroit, Michigan during each month of the year. The average high and low temperatures are listed below monthly and annually for the city, in both degrees Fahrenheit and Celsius. Maximums and minimums are only part of the temperature picture. To find out how often it rises over 70, 80 or 90 °F each month in Detroit, scroll down farther. There are also monthly and yearly counts of days with cold weather. All the numbers are long-term historical averages based on climate data gathered from 1981 to 2010."}, {"url": "http://www.currentresults.com/Weather/Michigan/Places/detroit-temperatures-by-month-average.php", "passage_text": "How Often Detroit Has Cold Temperatures. Most winter nights have freezing temperatures in Detroit and normally 15 nights drop to 10 °F or below. The city averages just four days a year when the thermometer plunges to 0 °F (-18 °C) or lower. From November to April, it can remain below freezing all day long. To find out how often it rises over 70, 80 or 90 °F each month in Detroit, scroll down farther. There are also monthly and yearly counts of days with cold weather. All the numbers are long-term historical averages based on climate data gathered from 1981 to 2010."}, {"url": "http://www.rssweather.com/climate/Michigan/Detroit/", "passage_text": "Climate for Detroit, Michigan. Detroit's coldest month is January when the average temperature overnight is 17.8°F. In July, the warmest month, the average day time temperature rises to 83.4°F. The driest month in Detroit is February with 1.88 inches of precipitation, and with 3.55 inches June is the wettest month."}, {"url": "http://www.rssweather.com/climate/Michigan/Detroit/", "passage_text": "Average Temperatures for Detroit. Detroit's coldest month is January when the average temperature overnight is 17.8°F. In July, the warmest month, the average day time temperature rises to 83.4°F. The driest month in Detroit is February with 1.88 inches of precipitation, and with 3.55 inches June is the wettest month."}]