[{"url": "http://www.abpischools.org.uk/page/modules/diabetes_16plus/diabetes8.cfm?coSiteNavigation_allTopic=1", "passage_text": "The amino acid sequence of insulin was found in 1955. Knowing this sequence, and understanding the triplet code for the bases on DNA, has allowed researchers to synthesise the gene for human insulin. This could then be used to genetically modify bacteria to produce human insulin. Use the information in the table to produce the DNA base sequence for the first three amino acids of the insulin A-chain. Drag these processes into the correct order for making human insulin from genetically engineered bacteria. Put genetically-engineered bacteria into fermentation vessels. Allow genetically-engineered bacteria to grow. Harvest bacteria and break open to release insulin."}, {"url": "http://www.learner.org/courses/biology/textbook/gmo/gmo_2.html", "passage_text": "Bacteria-the first organisms to be genetically engineered-are used for replicating and altering genes that are subsequently introduced into plants or animals. Bacteria are routinely used to produce non-bacterial proteins. An example is the production of purified proteins for vaccine use. Such proteins can be safer and as effective as vaccines that contain killed or attenuated (weakened) pathogens."}, {"url": "https://en.wikipedia.org/wiki/Genetically_modified_bacteria", "passage_text": "(January 2014). Genetically modified bacteria were the first organisms to be modified in the laboratory, due to their simple genetics. These organisms are now used for several purposes, and are particularly important in producing large amounts of pure human proteins for use in medicine. Similar bacteria have been used to produce clotting factors to treat haemophilia, and human growth hormone to treat various forms of dwarfism. These recombinant proteins are safer than the products they replaced, since the older products were purified from cadavers and could transmit diseases."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/triple_ocr_gateway/beyond_the_microscope/gene_technology/revision/1/", "passage_text": "Next. Genetic engineering can be used to create organisms that produce large amounts of useful substances-for example, bacteria can be engineered to produce human insulin to treat diabetics. Genetic engineering can also be used to create and store DNA fingerprints, which can be used for identification purposes. Bacteria [bacterium: A type of single-celled microorganism.] can be genetically engineered (genetically modified) to produce useful human proteins [protein: Organic compound made up of amino acid molecules."}, {"url": "https://answers.yahoo.com/question/index?qid=20090118191155AAK7kEh", "passage_text": "What is an advantage of using genetically engineered bacteria to produce human proteins? a. genetically engineered bacteria can produce human proteins used to make plastics b. the human proteins produced by genetically engineered bacteria work better than those produced by humans c. genetically engineered... b. the human proteins produced by genetically engineered bacteria work better than those produced by humans. c. genetically engineered bacteria can mass produce pure human proteins. d. the human proteins produced by genetically engineered bacteria last long"}, {"url": "http://www.learner.org/courses/biology/textbook/gmo/gmo_2.html", "passage_text": "Genetic Modification of Bacteria. Bacteria-the first organisms to be genetically engineered-are used for replicating and altering genes that are subsequently introduced into plants or animals. Bacterial systems lend themselves to genetic manipulation in part because of their rapid reproduction rates. Bacteria are routinely used to produce non-bacterial proteins. An example is the production of purified proteins for vaccine use. Such proteins can be safer and as effective as vaccines that contain killed or attenuated (weakened) pathogens."}, {"url": "https://answers.yahoo.com/question/index?qid=20090118191155AAK7kEh", "passage_text": "a. genetically engineered bacteria can produce human proteins used to make plastics. b. the human proteins produced by genetically engineered bacteria work better than those produced by humans. c. genetically engineered bacteria can mass produce pure human proteins. d. the human proteins produced by genetically engineered bacteria last longer than those produced by humans."}]