[{"url": "http://www.zinf.org/qna/How_much_postage_for_a_Christmas_Card_to_UK_from_Australia-qna1018921.html", "passage_text": "1 60% - How much postage from canada to australia for a christmas card? 2  65% - How much postage is it to mail a christmas card from houston texas to sydney australia? 3  49% - How long does it take to send postage to uk from australia during christmas? 1 49% - How long does it take to send postage to uk from australia during christmas? 2  69% - How much for postage costs christmas cards australia 2011? 3  17% - How much is postage sending card to australia from nz? 4  66% - How much postage card from america to"}, {"url": "http://www.singpost.com/send-documentparcel/postage-rates.html", "passage_text": "$25.00. $2.00. # The above rates are not applicable to South Korea, Australia, Japan, Germany and United Kingdom if posting volume is 1,500 pieces or more to each of the five BM1500 countries. Mail to Malaysia and Brunei will be conveyed via air."}, {"url": "http://www.answers.com/Q/What_is_cost_of_airmail_letter_UK_to_australia", "passage_text": "It depends what type of mail you're sending (and the weight)...  According to the Post Office web-site, to send (for example) a 100  gramme letter by airmail-and have it d … elivered within 2-3 working  days, the cost from the UK is £8.86. On the Wallaby."}, {"url": "http://www.answers.com/Q/What_is_cost_of_airmail_stamp_from_US_to_Australia", "passage_text": "It depends what type of mail you're sending (and the weight)...  According to the Post Office web-site, to send (for example) a 100  gramme letter by airmail-and have it d … elivered within 2-3 working  days, the cost from the UK is £8.86. Jason Harmon. "}, {"url": "http://www.mumsgone2aus.com/2010/11/04/posting-christmas-cards-and-gifts-in-and-from-australia/", "passage_text": "Christmas stamps cost 50c for cards within Australia and $1.30 for overseas destinations. I’d check at your local post office to confirm your country of origin is eligible to use the cheaper postage stamps, the UK is included. Remember to “write card” only. If you’re taking advantage of the cheaper postage, remember to write “card only” on the envelope. You also need to ensure that the card fits within the standard small letter size: no larger than 130mm x 240mm."}, {"url": "http://www.mumsgone2aus.com/2010/11/04/posting-christmas-cards-and-gifts-in-and-from-australia/", "passage_text": "Postage stamps are cheaper at Christmas. If you’re just sending cards, the postage price is 5c to 15c cheaper during November and December, when using Christmas stamps. The cost of postage for a small card or letter within Australia is usually 60c. For international mail, the cost of a postcard or greeting card by Air Mail to most countries is $1.45. Remember to “write card” only. If you’re taking advantage of the cheaper postage, remember to write “card only” on the envelope. You also need to ensure that the card fits within the standard small letter size: no larger than 130mm x 240mm."}, {"url": "http://auspost.com.au/parcels-mail/international-delivery-options.html", "passage_text": "Signature on delivery for items up to 2kg, valued up to $500. 1  Estimated 3-10 business day delivery to metropolitan areas of major cities 2  † . Signature on delivery in many destinations 3  * . Includes coverage of up to $100 for loss or damage for articles posted. Urgent, door-to-door delivery for items up to 20kg # , with Signature on Delivery and optional Extra Cover. 1  Estimated 2-4 business day delivery to metropolitan areas of major cities 2  † . Signature on delivery in many destinations 3  * . Online tracking available for certain destinations * ."}, {"url": "https://sendacard.nzpost.co.nz/pricing/", "passage_text": "Sending to an address within NZ. Postcard: sent within New Zealand, $2.75 per card. Greeting Card: sent within New Zealand, $3.99 per card. Prezzy card: Service currently only available in New Zealand. Sending to an address Overseas. Postcard: Anywhere outside New Zealand, $3.95. Greeting Card: Australia & South Pacific (Zone A & B), $5.19. Greeting Card: Rest of World (Zone C, D & E), $5.69. Prices include all printing and delivery costs, and are displayed in New Zealand dollars (GST inclusive)."}]