[{"url": "https://en.wikipedia.org/wiki/Genealogical_DNA_test", "passage_text": "Results give information about genealogy or personal ancestry. In general, these tests compare the results of an individual to others from the same lineage or to current and historic ethnic groups. The test results are not meant for medical use, where different types of genetic testing are needed. The interest in genealogical DNA tests has been linked to both an increase in curiosity about traditional genealogy and to more general personal origins. Those who test for traditional genealogy often utilize a combination of autosomal, mitochondrial, and Y-Chromosome tests."}, {"url": "http://medical-dictionary.thefreedictionary.com/DNA", "passage_text": "DNA. complementary DNA (cDNA), copy DNA DNA transcribed from a specific RNA through the action of the enzyme reverse transcriptase. mitochondrial DNA (mtDNA) the DNA of the mitochondrial chromosome, existing in several thousand copies per cell and inherited exclusively from the mother. DNA (deoxyribonucleic acid). A type of nucleic acid that constitutes the molecular basis of heredity. It is found principally in the nucleus of all cells where it forms part of the chromosome, or in the cytoplasm of cells lacking a nucleus, such as bacteria."}, {"url": "https://dna.ancestry.com/", "passage_text": "Your privacy is very important to us and we are committed to protecting your DNA. For more information on privacy at AncestryDNA, please review the AncestryDNA Privacy Statement. For a more general discussion of privacy on the Ancestry family of websites, see the Ancestry Privacy Center. Unlike some other DNA tests, which only analyze the Y-chromosome (and can only be taken by a male to look at your direct paternal lineage) or mitochondrial DNA (can be taken by a male or female but only looks at your direct maternal lineage), AncestryDNA looks at a person’s entire genome at over 700,000 locations."}, {"url": "http://web.mit.edu/racescience/in_media/what_dna_says_about_human/", "passage_text": "Even individuals can sometimes trace their heritage. (See box, Roots, DNA Style.) Matthew George, a geneticist at Howard University, is analyzing the DNA from bones found in the African Burial Ground in Wall Street's Foley Square. "}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/dna", "passage_text": "DNA is a double helix formed by base pairs attached to a sugar-phosphate backbone. DNA, or deoxyribonucleic acid, is the hereditary material in humans and almost all other organisms. Nearly every cell in a person’s body has the same DNA. Most DNA is located in the cell nucleus (where it is called nuclear DNA), but a small amount of DNA can also be found in the mitochondria (where it is called mitochondrial DNA or mtDNA). The structure of the double helix is somewhat like a ladder, with the base pairs forming the ladder’s rungs and the sugar and phosphate molecules forming the vertical sidepieces of the ladder. An important property of DNA is that it can replicate, or make copies of itself."}, {"url": "https://dna.ancestry.com/", "passage_text": "AncestryDNA is the leader in DNA testing for family history and includes more than a million people who have taken the AncestryDNA test as well as the ability to access Ancestry, the world's largest online family history resource, which includes millions of family trees and over 15 billion historical records. Unlike some other DNA tests, which only analyze the Y-chromosome (and can only be taken by a male to look at your direct paternal lineage) or mitochondrial DNA (can be taken by a male or female but only looks at your direct maternal lineage), AncestryDNA looks at a person’s entire genome at over 700,000 locations."}, {"url": "https://en.wikipedia.org/wiki/Mitochondrial_DNA", "passage_text": "Origin [edit]. Nuclear and mitochondrial DNA are thought to be of separate evolutionary origin, with the mtDNA being derived from the circular genomes of the bacteria that were engulfed by the early ancestors of today's eukaryotic cells. This theory is called the endosymbiotic theory. In humans, the 16,600 base pairs of mitochondrial DNA encode for only 37 genes. Human mitochondrial DNA was the first significant part of the human genome to be sequenced. In most species, including humans, mtDNA is inherited solely from the mother."}, {"url": "https://en.wikipedia.org/wiki/Genealogical_DNA_test", "passage_text": "A man's patrilineal ancestry, or male-line ancestry, can be traced using the DNA on his Y chromosome (Y-DNA) through Y-STR testing. This is useful because the Y chromosome passes down almost unchanged from father to son, i.e., the non-recombining and sex-determining regions of the Y chromosome do not change. The interest in genealogical DNA tests has been linked to both an increase in curiosity about traditional genealogy and to more general personal origins. Those who test for traditional genealogy often utilize a combination of autosomal, mitochondrial, and Y-Chromosome tests."}, {"url": "http://www.livescience.com/37247-dna.html", "passage_text": "Deoxyribonucleic acid or DNA is a molecule that contains the instructions an organism needs to develop, live and reproduce. These instructions are found inside every cell, and are passed down from parents to their children. Each nucleotide contains a phosphate group, a sugar group and a nitrogen base. The four types of nitrogen bases are adenine (A), thymine (T), guanine (G) and cytosine (C). The order of these bases is what determines DNA's instructions, or genetic code."}, {"url": "https://en.wikipedia.org/wiki/Mitochondrial_DNA", "passage_text": "Mitochondrial DNA is only a small portion of the DNA in a eukaryotic cell; most of the DNA can be found in the cell nucleus and, in plants, in the chloroplast. In humans, the 16,600 base pairs of mitochondrial DNA encode for only 37 genes. Human mitochondrial DNA was the first significant part of the human genome to be sequenced. In most species, including humans, mtDNA is inherited solely from the mother."}]