[{"url": "http://www.ncsl.org/research/human-services/common-law-marriage.aspx", "passage_text": "Common law marriage is allowed in a minority of states. A common law marriage is a legally recognized marriage between two people who have not purchased a marriage license or had their marriage solemnized by a ceremony. Not all states have statutes addressing common law marriage."}, {"url": "https://en.wikipedia.org/wiki/Common_law", "passage_text": "Common law is a third branch of law, in contrast to and on equal footing with statutes which are adopted through the legislative process, and regulations which are promulgated by the executive branch. A common law system is a legal system that gives great precedential weight to common law, so that consistent principles applied to similar facts yield similar outcomes."}, {"url": "http://inventors.about.com/od/definations/g/common_law.htm", "passage_text": "Definition: Common law rights are property or other legal rights that do not absolutely require formal registration in order to enforce them. Federal trademark registration is not required to establish rights in a trademark. Rights called common law rights arise from actual use of a mark. Generally, the first to either use a mark in commerce or file an intent to use application with the USPTO has the ultimate right to use and registration. A common law search is not necessary but some find it beneficial. Telephone numbers for search firms that perform these searches for a fee can be found in the yellow pages of local phone directories and through an Internet search."}, {"url": "https://en.wikipedia.org/wiki/Common-law_marriage", "passage_text": "Common-law marriage, also known as sui juris marriage, informal marriage, or marriage by habit and repute, is a legal framework in a limited number of jurisdictions where a couple is legally considered married, without that couple having formally registered their relation as a civil or religious marriage. Also, like American common law marriages, it is a form of lawful marriage, so that people cannot be common law spouses, or husband and wife by cohabitation with habit and repute, if one of them was legally married to somebody else when the relationship began."}, {"url": "http://www.investopedia.com/terms/c/common-law.asp", "passage_text": "DEFINITION of 'Common Law'. In the United States, a body of unwritten laws based on precedents established by the courts. Common law is used in deciding novel cases where the outcome cannot be determined based on existing statutes. The U.S. common-law system evolved from the precolonial system of English common law."}, {"url": "https://en.wikipedia.org/wiki/Common_law", "passage_text": "Common law (also known as case law or precedent) is law developed by judges, courts, and similar tribunals, stated in decisions that nominally decide individual cases but that in addition have precedential effect on future cases. A common law system is a legal system that gives great precedential weight to common law, so that consistent principles applied to similar facts yield similar outcomes."}, {"url": "http://legal-dictionary.thefreedictionary.com/Common+law", "passage_text": "Appellate courts in a common-law system may review only findings of law, not determinations of fact. Under common law, all citizens, including the highest-ranking officials of the government, are subject to the same set of laws, and the exercise of government power is limited by those laws. The judiciary may review legislation, but only to determine whether it conforms to constitutional requirements. The common-law system prevails in England, the United States, and other countries colonized by England. It is distinct from the civil-law system, which predominates in Europe and in areas colonized by France and Spain."}, {"url": "https://en.wikipedia.org/wiki/Common-law_marriage", "passage_text": "The term common-law marriage is often used colloquially or by the media to refer to cohabiting couples, regardless of any rights that these couples may have, which can create public confusion both in regard to the term and in regard to the rights of unmarried partners. Also, like American common law marriages, it is a form of lawful marriage, so that people cannot be common law spouses, or husband and wife by cohabitation with habit and repute, if one of them was legally married to somebody else when the relationship began."}, {"url": "http://www.investopedia.com/terms/c/common-law.asp", "passage_text": "BREAKING DOWN 'Common Law'. The decisions (precedents) of higher courts are binding on lower courts so that the U.S. legal system will have consistency and stability. The U.S. common-law system evolved from the precolonial system of English common law."}]