[{"url": "https://en.wikipedia.org/wiki/Azithromycin", "passage_text": "Azithromycin is an antibiotic useful for the treatment of a number of bacterial infections. This includes middle ear infections, strep throat, pneumonia, traveler's diarrhea, and certain other intestinal infections. In 2010, azithromycin was the most prescribed antibiotic for outpatients in the US, whereas in Sweden where outpatient antibiotic use is a third as prevalent, macrolides are only on 3% of prescriptions."}, {"url": "http://www.everydayhealth.com/drugs/azithromycin", "passage_text": "Azithromycin is also used to treat lung and other respiratory infections, such as bronchitis, sinusitis, community acquired pneumonia, some cases of chronic obstructive pulmonary disease (COPD), and whooping cough (pertussis). Doctors may also prescribe azithromycin for genital infections and sexually transmitted diseases, such as gonorrhea, infections of the urethra or cervix, genital ulcers, and severe pelvic inflammatory disease. Azithromycin belongs to group of drugs known as macrolide antibiotics."}, {"url": "http://bacteria.emedtv.com/azithromycin/what-is-azithromycin-used-for.html", "passage_text": "Azithromycin may also be used to treat a number of other more uncommon bacterial infections. Azithromycin is not effective against any infection caused by a virus, such as the flu, stomach flu, or common cold. Bacterial Infections. Azithromycin is most commonly used to treat the following infections: 1  Respiratory infections, such as bronchitis. 2  Ear infections (otitis media). 3  Sinus infections (sinusitis)."}, {"url": "http://www.medicinenet.com/azithromycin_250500mg_tablets-oral/article.htm", "passage_text": "USES: Azithromycin is used to treat a wide variety of bacterial infections. It is a macrolide-type antibiotic. It works by stopping the growth of bacteria.This medication will not work for viral infections (such as common cold, flu). Unnecessary use or misuse of any antibiotic can lead to its decreased effectiveness. "}, {"url": "http://www.rxlist.com/zithromax-side-effects-drug-center.htm", "passage_text": "Zithromax Z-PAK (azithromycin) is a semi-synthetic macrolide antibiotic used for treating otitis media (middle ear infection), tonsillitis, laryngitis, bronchitis, pneumonia, and sinusitis caused by susceptible bacteria. The most common side effects of Zithromax are diarrhea or loose stools, nausea, abdominal pain, vomiting, constipation, dizziness, tiredness, headache, vaginal itching or discharge, skin rash or itching, ringing in the ears or hearing problems, or decreased sense of taste or smell."}, {"url": "http://bacteria.emedtv.com/azithromycin/what-is-azithromycin-used-for.html", "passage_text": "Azithromycin (Zithromax ®) is a prescription antibiotic licensed to treat a number of infections in both children and adults. Some of these azithromycin uses include: 1  Treatment of bacterial infections. 2  Treatment of sexually transmitted diseases (STDs). Bacterial Infections. Azithromycin is most commonly used to treat the following infections: 1  Respiratory infections, such as bronchitis. 2  Ear infections (otitis media). 3  Sinus infections (sinusitis)."}, {"url": "http://www.everydayhealth.com/drugs/azithromycin", "passage_text": "Azithromycin is the generic name for a prescription drug available as Zithromax, Zmax, and Z-Pak. The drug is an antibiotic used to treat a variety of bacterial infections, such as cat-scratch disease, ear infections, infections of the skin or surrounding tissue, and throat or tonsil infections. Doctors may also prescribe azithromycin for genital infections and sexually transmitted diseases, such as gonorrhea, infections of the urethra or cervix, genital ulcers, and severe pelvic inflammatory disease. Azithromycin belongs to group of drugs known as macrolide antibiotics."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0009182/?report=details", "passage_text": "Azithromycin is used to treat certain bacterial infections in many different parts of the body. This medicine may mask or delay the symptoms of syphilis. It is not effective against syphilis infections. Azithromycin belongs to the class of drugs known as macrolide antibiotics. It works by killing bacteria or preventing their growth. However, this medicine will not work for colds, flu, or other virus infections."}, {"url": "http://bacteria.emedtv.com/azithromycin/azithromycin.html", "passage_text": "Azithromycin (Zithromax ®) is a prescription antibiotic that is licensed to treat a number of common infections. It is part of a class of antibiotics called macrolides. Other medicines in this class include clarithromycin and erythromycin. "}, {"url": "http://www.everydayhealth.com/drugs/azithromycin", "passage_text": "A: Z-Pak (azithromycin) is a macrolide antibiotic which is used to treat various bacterial infections. The most common side effects with Z-Pak are diarrhea and nausea. Other side effects with Z-Pak include photosensitivity or sensitivity to the sun and UV radiation. Doctors may also prescribe azithromycin for genital infections and sexually transmitted diseases, such as gonorrhea, infections of the urethra or cervix, genital ulcers, and severe pelvic inflammatory disease. Azithromycin belongs to group of drugs known as macrolide antibiotics."}]