[{"url": "http://www.answers.com/Q/What_phylum_do_ladybirds_belong_to", "passage_text": "The deer belongs to the Chordata phylum. I will list the entire classification structure below for the red stag deer, just in case you need it. Kingdom: Animalia Phylum: Chor … data Class: Mammalia Infra-class: Eutheria Order: Artiodactyla Suborder: Ruminantia Infraorder: Pecora Family: Cervidae."}, {"url": "http://insects.about.com/od/beetles/a/10-facts-ladybugs.htm", "passage_text": "Entomologically speaking, the term bugs applies to insects of the order Hemiptera. Ladybugs belong to the order Coleoptera, or beetles. Europeans have called these dome-backed beetles by the name ladybirds, or ladybird beetles, for over 500 years. In America, the name ladybird was replaced by ladybug."}, {"url": "http://www.highsierraladybugs.com/id10.html", "passage_text": "There are a number of other classifications to consider, such as the kingdom, the phylum, the class, and the family. Like every other creature on earth, ladybug classification is very intensive. Ladybugs belong to the Animalia Kingdom. They are a part of the Phylum Arthropoda."}, {"url": "http://entnemdept.ufl.edu/creatures/beneficial/lady_beetles.htm", "passage_text": "In the USA, the name ladybird was popularly americanized to ladybug, although these insects are beetles (Coleoptera), not bugs (Hemiptera). Now, the word ladybird applies to a whole family of beetles, Coccinellidae or ladybirds, not just Coccinella septempunctata."}, {"url": "http://www.ladybug-life-cycle.com/classification-species-types.html", "passage_text": "There are a number of other classifications to consider, such as the kingdom, the phylum, the class, and the family. Like every other creature on earth, ladybug classification is very intensive. Ladybugs belong to the Animalia Kingdom. They are a part of the Phylum Arthropoda. Their Class is Insecta. They belong to the order of Coleoptera, beetles, of course. Finally, their Family is that of the Coccinellidae. There are about 150 species of ladybugs in the United States, wow! That s a lot of types of ladybugs!"}]