[{"url": "https://www.sharecare.com/health/pleurisy-inflammation/pleurisy-contagious", "passage_text": "Pleurisy is not a contagious condition. However, sometimes the condition that leads to pleurisy is contagious. Infections such as influenza, pneumonia, and tuberculosis, which are the main cause of pleurisy, are all contagious conditions. If you come into contact with someone who has pleurisy because of a viral infection, it may be a good idea to limit your physical contact and to wash your hands afterward."}, {"url": "http://www.medicinenet.com/pleural_effusion_fluid_in_the_chest_or_on_lung/article.htm", "passage_text": "The development of a pleural effusion occurs from fluid seeping into the pleural space, a thin area between the visceral and pleural membranes in the chest cavity, which normally contains a small amount of fluid to facilitate smooth lung movement. Pleural effusion definition. A pleural effusion is a buildup of fluid in the pleural space, an area between the layers of tissue that line the lungs and the chest cavity. It may also be referred to as effusion or pulmonary effusion"}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/pleural-effusion", "passage_text": "Some patients with pleural effusion have no symptoms, with the condition discovered on a chest x-ray that is performed for another reason. The patient may have unrelated symptoms due to the disease or condition that has caused the effusion. Symptoms of pleural effusion include: 1  Chest pain. 2  Dry, nonproductive cough. 3  Dyspnea (shortness of breath, or difficult, labored breathing). 4  Orthopnea (the inability to breathe easily unless the person is sitting up straight or standing erect)"}, {"url": "http://antimicrobe.org/new/e29rev.asp", "passage_text": "A pleural effusion is, simply put, an abnormal fluid collection in the chest between the visceral and pleural surfaces. A thin layer of fluid is always present in this space to allow for lubrication so that the lung may glide in the chest during inspiration and expiration. Almost always exudate. Third most common cause of pleural effusion and the most common cause of an exudate effusion in patients older than 50 years of age (37). Sensitivity of cytology 50% if one sample obtained, 66.7% if two samples and 73.3% is three samples."}, {"url": "http://www.webmd.com/lung/understanding-pleurisy-basics", "passage_text": "The condition can make breathing extremely painful. Sometimes it is associated with another condition called pleural effusion, in which excess fluid fills the area between the membrane's layers. The double-layered pleura protects and lubricates the surface of the lungs as they inflate and deflate within the rib cage. People with asthma may also have asthmatic bronchitis,... In some cases of pleurisy, excess fluid seeps into the pleural space, resulting in pleural effusion. This fluid buildup usually has a lubricating effect, relieving the pain associated with pleurisy as it reduces friction"}, {"url": "https://en.wikipedia.org/wiki/Pleural_empyema", "passage_text": "Pleural empyema. Pleural empyema, also known as pyothorax or purulent pleuritis, is empyema (an accumulation of pus) in the pleural cavity that can develop when bacteria invade the pleural space, usually in the context of a pneumonia. It is one of various kinds of pleural effusion"}, {"url": "http://www.webmd.com/lung/pleural-effusion-symptoms-causes-treatments", "passage_text": "Symptoms of Pleural Effusions. Pleural effusions often cause no symptoms. Symptoms are more likely when a pleural effusion is moderate or large-sized, or if inflammation is present. Symptoms of pleural effusions may include: 1  Shortness of breath. 2  Chest pain, especially on breathing in deeply (pleurisy, or pleuritic pain). 3  Fever. 4  Cough. Chest X-ray film: Plain X-ray films of the chest are often the first step in identifying a pleural effusion. Pleural effusions appear on chest X-rays as white space at the base of the lung. If a pleural effusion is likely, additional X-ray films may be taken while a person lies on her side."}, {"url": "http://antimicrobe.org/new/e29rev.asp", "passage_text": "Adenovirus is the most common viral cause of atypical pneumonia. Pleural effusions occur in anywhere from 15% to 62% of patients (24, 71). The effusions are often bilateral and are accompanied by a diffuse parenchymal infiltrate typical of a viral pneumonia. Almost always exudate. Third most common cause of pleural effusion and the most common cause of an exudate effusion in patients older than 50 years of age (37). Sensitivity of cytology 50% if one sample obtained, 66.7% if two samples and 73.3% is three samples."}]