[{"url": "http://www.nolo.com/legal-encyclopedia/domestic-partnership-benefits-29916.html", "passage_text": "Some of these states limit domestic partnership registration to same-sex couples, though some also include opposite-sex couples in which one partner is 62 or older. In other places, domestic partnership benefits are offered by smaller governmental entities or businesses and are more limited."}, {"url": "http://www.ehow.com/facts_6824215_qualifies-domestic-partner-benefits_.html", "passage_text": "Each employer can create its own definition of domestic partner for benefits eligibility use. According to Find Law, most employers that extend benefits to domestic partners require that the two people be in a committed, exclusive relationship, be financially interdependent, be of legal age to marry."}, {"url": "http://www.washington.edu/admin/hr/benefits/insure/fac-staff-lib/meddent/ssdp.html", "passage_text": "The University of Washington provides insurance coverage to qualified same-and opposite-sex domestic partners and their children in accordance with the provisions of the Washington State Public Employees Benefits Board regulations."}, {"url": "http://employeebenefits.about.com/od/familybenefits/tp/Domestic-Partner-Qualification.htm", "passage_text": "There is no federal law qualifying who a domestic partner includes, though some state and local laws do. If your company intends to cover domestic partners, you should outline what a domestic partner is in your employee handbook. Some common elements of domestic partnership can include:"}, {"url": "https://www.irs.gov/uac/answers-to-frequently-asked-questions-for-registered-domestic-partners-and-individuals-in-civil-unions", "passage_text": "A taxpayer’s registered domestic partner is not one of the specified related individuals in section 152(c) or (d) that qualifies the taxpayer to file as head of household, even if the partner is the taxpayer’s dependent. Q11."}, {"url": "http://www.sos.ca.gov/registries/domestic-partners-registry", "passage_text": "A domestic partnership is established when persons meeting the criteria specified by California Family Code section 297 file either a Declaration of Domestic Partnership (Form NP/SF DP-1) or a Confidential Declaration of Domestic Partnership (Form NP/SF DP-1A) with the California Secretary of State."}, {"url": "https://www.irs.gov/uac/answers-to-frequently-asked-questions-for-registered-domestic-partners-and-individuals-in-civil-unions", "passage_text": "A7. No. Like other provisions of the federal tax law that apply only to married taxpayers, section 66 and section 469(i)(5) do not apply to registered domestic partners because registered domestic partners are not married for federal tax purposes."}, {"url": "http://www.courts.ca.gov/1242.htm", "passage_text": "1 If your partner files and sends you a Revocation of Termination of Domestic Partnership but you still want to get a divorce, you will not be able to get that divorce by summary dissolution. 2  Instead, you will have to start a divorce case in court. 3  Click to find out how to file for divorc"}]