[{"url": "http://eastbourne.east-sussex.co.uk/directory/24633/hilton-royal-parade-hotel/", "passage_text": "Situated on the seafront, The Hilton Royal Parade Hotel is just 10 minutes’ walk from the Victorian Eastbourne Pier, The Royal Hippodrome Theatre and the city centre. Free public parking is available at the back of the hotel and free Wi-Fi is accessible in the bar and lounge areas."}, {"url": "http://www.iknow-uk.com/england/sussex/east-sussex-coast/eastbourne-seafront/hotels/", "passage_text": "Situated on the seafront, The Hilton Royal Parade Hotel is just 10 minutes’ walk from the Victorian Eastbourne Pier, The Royal Hippodrome Theatre and the city centre."}, {"url": "http://www.britainfromabove.org.uk/image/epw000103", "passage_text": "This is Eastbourne Pier with Grand Parade on the left and Marine Parade on the right showing the junction of Cavendish Place and Elms Aevnue."}, {"url": "http://eastbourne.east-sussex.co.uk/directory/24633/hilton-royal-parade-hotel/", "passage_text": "Book Online Now. Situated on the seafront, The Hilton Royal Parade Hotel is just 10 minutes’ walk from the Victorian Eastbourne Pier, The Royal Hippodrome Theatre and the city centre. Free public parking is available at the back of the hotel and free Wi-Fi is accessible in the bar and lounge areas."}, {"url": "http://www.booking.com/hotel/gb/hilton-royal-parade.html", "passage_text": "Stay in the Heart of Eastbourne. On the seafront, The Hilton Royal Parade Hotel is just a 10-minute walk from the Victorian Eastbourne Pier, The Royal Hippodrome Theatre and the center of the city. Free public parking is available at a nearby location and free Wi-Fi is accessible in the public areas."}, {"url": "http://www.booking.com/hotel/gb/hilton-royal-parade.html", "passage_text": "35 - 42 Royal Parade, Eastbourne, BN22 7AN, United Kingdom – Show map. After booking, all of the property’s details, including telephone and address, are provided in your booking confirmation and your account. Review score 6.4/10 Score from 1037 reviews. The location of the hotel was good overlooking the seafront."}, {"url": "http://www.booking.com/hotel/gb/hilton-royal-parade.html", "passage_text": "The Carpet Gardens are just a 10-minute walk from the hotel, and Eastbourne Train Station is only one mile away. We speak your language! Hotel Rooms: 102 This property has been on Booking.com since Jan 24, 2012."}]