[{"url": "http://www.ancestry.com/name-origin?surname=huggins", "passage_text": "Click on a circle in the chart to view Huggins immigration records. You can find out when most of the Huggins families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival and destination. from the Social Security Death Index (SSDI)."}, {"url": "http://www.surnamedb.com/Surname/Huggins", "passage_text": "This most interesting surname is a patronymic form of Huggin, which itself is a diminutive from the Old French personal name Hugh, which was introduced into England by the Normans after the Conquest of 1066. The surname is first recorded in the early 14th Century (see below), while other early examples include: Amisia Hugines, recorded in the Subsidy Rolls of Worcestershire in 1327; and John Hugyn, mentioned in the Feet of Fines of Staffordshire in 1337."}, {"url": "http://www.sheknows.com/baby-names/name/michael", "passage_text": "Biblical Meaning: The name Michael is a Biblical baby name. In Biblical the meaning of the name Michael is: Poor; humble. American Meaning: The name Michael is an American baby name. In American the meaning of the name Michael is: Poor; humble. Hebrew Meaning: The name Michael is a Hebrew baby name. "}, {"url": "http://www.searchforancestors.com/surnames/origin/h/huggins.php", "passage_text": "Read online surname origin books, biographies, journals, county histories, multi-generational genealogies & family trees, memoirs and other first-hand historical narratives which pertain to the Huggins family name to help add detail and personality to the pages of your family history. You can Start your Huggins Family Tree and discover things you never knew about your own family. Construct a free family tree to trace your own genealogy and learn about your personal"}, {"url": "http://www.behindthename.com/name/joseph", "passage_text": "Meaning & History. From Ioseph, the Latin form of Greek ιωσηφ (Ioseph) , which was from the Hebrew name יוֹסֵף (Yosef) meaning he will add. In the Old Testament, Joseph is the eleventh son of Jacob. Because he was the favourite of his father, his older brothers sent him to Egypt and told their father that he had died"}, {"url": "http://www.ancestry.com/name-origin?surname=huggins", "passage_text": "You can find out where the majority of the Huggins families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists. You can find out when most of the Huggins families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival and destination. from the Social Security Death Index (SSDI)."}, {"url": "http://www.surnamedb.com/Surname/Huggins", "passage_text": "The first recorded spelling of the family name is shown to be that of Robert Hugyn, which was dated 1327, in the Subsidy Rolls of Sussex, during the reign of King Edward 111, known as The Father of the Navy, 1327 - 1377. Surnames became necessary when governments introduced personal taxation. The surname is first recorded in the early 14th Century (see below), while other early examples include: Amisia Hugines, recorded in the Subsidy Rolls of Worcestershire in 1327; and John Hugyn, mentioned in the Feet of Fines of Staffordshire in 1337."}, {"url": "http://www.surnamedb.com/Surname/Huggins", "passage_text": "Samuel Huggins (1811 - 1885), was President of the Liverpool Architectural Society, and the Society for the Protection of Ancient Buildings was founded largely due to his papers against restorations of cathedrals. The surname is first recorded in the early 14th Century (see below), while other early examples include: Amisia Hugines, recorded in the Subsidy Rolls of Worcestershire in 1327; and John Hugyn, mentioned in the Feet of Fines of Staffordshire in 1337."}, {"url": "http://www.searchforancestors.com/surnames/origin/h/huggins.php", "passage_text": "If you get the Page is Not Available message, no mailing list is available. Instead, check the index of mailing lists for a sound-alike name. Huggins in Ancestry Message Boards. Browse or post a query about your genealogy, surname origin, or family history in the Huggins surname forum. Look for unknown cousins or relatives with whom you may have lost touch. You can Start your Huggins Family Tree and discover things you never knew about your own family. Construct a free family tree to trace your own genealogy and learn about your personal family history."}]