[{"url": "http://www.vanguardsw.com/business-forecasting-101/what-is-forecasting/", "passage_text": "What is Forecasting. Forecasting is a decision-making tool used by many businesses to help in budgeting, planning, and estimating future growth. In the simplest terms, forecasting is the attempt to predict future outcomes based on past events and management insight."}, {"url": "https://en.wikipedia.org/wiki/Forecasting", "passage_text": "Forecasting is the process of making predictions of the future based on past and present data and analysis of trends. A commonplace example might be estimation of some variable of interest at some specified future date."}, {"url": "http://www.statisticalforecasting.com/", "passage_text": "Statistical forecasting: Estimating the likelihood of an event taking place in the future, based on available data. Statistical forecasting concentrates on using the past to predict the future by identifying trends, patterns and business drives within the data to develop a forecast."}, {"url": "http://kalyan-city.blogspot.com/2011/08/what-is-forecasting-meaning-features.html", "passage_text": "Forecasting is a process of predicting or estimating the future based on past and present data. Forecasting provides information about the potential future events and their consequences for the organisation."}, {"url": "http://kalyan-city.blogspot.com/2011/08/what-is-forecasting-meaning-features.html", "passage_text": "Meaning. Forecasting is a process of predicting or estimating the future based on past and present data. Forecasting provides information about the potential future events and their consequences for the organisation. It may not reduce the complications and uncertainty of the future."}, {"url": "http://www.investopedia.com/terms/f/forecasting.asp", "passage_text": "DEFINITION of 'Forecasting'. The use of historic data to determine the direction of future trends. Forecasting is used by companies to determine how to allocate their budgets for an upcoming period of time. This is typically based on demand for the goods and services it offers, compared to the cost of producing them."}]