[{"url": "http://www.definitions.net/definition/agonist", "passage_text": "Agonists often mimic the action of a naturally occurring substance. Whereas an agonist causes an action, an antagonist blocks the action of the agonist and an inverse agonist causes an action opposite to that of the agonist. "}, {"url": "https://en.wikipedia.org/wiki/Agonist", "passage_text": "Efficacy spectrum of receptor ligands. An agonist is a chemical that binds to a receptor and activates the receptor to produce a biological response. Whereas an agonist causes an action, an antagonist blocks the action of the agonist and an inverse agonist causes an action opposite to that of the agonist. Inverse agonists exert the opposite pharmacological effect of a receptor agonist, not merely an absence of the agonist effect as seen with antagonist. An example is the cannabinoid inverse agonist rimonabant. A co-agonist works with other co-agonists to produce the desired effect together."}, {"url": "https://answers.yahoo.com/question/index?qid=20100307125821AAWaMwY", "passage_text": "Agonists are chemical substances that mimic or enhance the effects of neurotransmitters on the receptor sites of the next cell. If the neurotransmitter was excitatory, the effect of the agonist would be to increase the inhibitory. the agonist blockst the inhibitory effect. Antagonist drugs are chemical substances that block or reduce a cell's response to the action of other neurotransmitters. If the neurotransmitter is inhibitory, the antagonist would increase the activity of the cell."}, {"url": "https://en.wikipedia.org/wiki/Agonist", "passage_text": "Types of agonists [edit]. Receptors can be activated by either endogenous (such as hormones and neurotransmitters) or exogenous (such as drugs) agonists, resulting in a biological response. A physiological agonist is a substance that creates the same bodily responses but does not bind to the same receptor. Inverse agonists exert the opposite pharmacological effect of a receptor agonist, not merely an absence of the agonist effect as seen with antagonist. An example is the cannabinoid inverse agonist rimonabant. A co-agonist works with other co-agonists to produce the desired effect together."}, {"url": "http://medical-dictionary.thefreedictionary.com/agonist", "passage_text": "Molecular biology A ligand which binds a receptor at a site adjacent to the active site. Pharmacology Agonist medication. A chemical entity that does not naturally occur in the body and acts on one or more receptors (e.g., mu, delta, and kappa opiate receptors) by structural mimicry of the receptors’ natural ligand(s). "}, {"url": "https://en.wikipedia.org/wiki/Agonist", "passage_text": "An inverse agonist is an agent that binds to the same receptor binding-site as an agonist for that receptor and inhibits the constitutive activity of the receptor. Inverse agonists exert the opposite pharmacological effect of a receptor agonist, not merely an absence of the agonist effect as seen with antagonist. An example is the cannabinoid inverse agonist rimonabant. A co-agonist works with other co-agonists to produce the desired effect together."}, {"url": "https://en.wikipedia.org/wiki/Dopamine_agonist", "passage_text": "A dopamine agonist is a compound that activates dopamine receptors in the absence of that receptor's physiological ligand, the neurotransmitter dopamine. Dopamine agonists activate signaling pathways through the dopamine receptor and trimeric G-proteins, ultimately leading to changes in gene transcription. "}, {"url": "http://cvpharmacology.com/cardiostimulatory/beta-agonist", "passage_text": "Beta-Adrenoceptor Agonists (β-agonists). Beta-adrenoceptor agonists (β-agonists) bind to β-receptors on cardiac and smooth muscle tissues. They also have important actions in other tissues, especially bronchial smooth muscle (relaxation), the liver (stimulate glycogenolysis) and kidneys (stimulate renin release). General Pharmacology. Beta-adrenoceptor agonists (β-agonists) bind to β-receptors on cardiac and smooth muscle tissues. They also have important actions in other tissues, especially bronchial smooth muscle (relaxation), the liver (stimulate glycogenolysis) and kidneys (stimulate renin release)."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=7835", "passage_text": "Agonist: A substance that acts like another substance and therefore stimulates an action. Agonist is the opposite of antagonist. Antagonists and agonists are key players in the chemistry of the human body and in pharmacology. "}]