[{"url": "http://forum.wordreference.com/threads/prego-vs-per-favore.46542/", "passage_text": "Italy, Italian. I agree with Alfry. The prego form is very usual, whereas the per favore is not as much; thus, asking si sieda, per favore might have the meaning that the speaker wants you to sit for a reason, and is not just using a stereotyped expression. Just a thought."}, {"url": "http://wikitravel.org/en/Italian_phrasebook", "passage_text": "Italian is the official language of Italy, San Marino, and is an official language of Switzerland, spoken mainly in the cantons of Ticino and Grigioni. It is a co-official language in Istria and the coastal regions of Slovenia and Croatia, which were part of Italy until after WW2."}, {"url": "http://dictionary.reverso.net/italian-english/per%20favore", "passage_text": "favore. Translation Italian-English Collins Dictionary &nbsp. See also: cambiale di comodo o favore, favorire, favo, favorevole."}, {"url": "http://www.gamesforlanguage.com/dictionary/italian/definition/il-conto-per-favore-translation-from-italian-2", "passage_text": "Listen to il conto, per favore: (If you have an HTML5 enabled browser, you can listen to the native audio below). Listen also to this conversation from our program as our hero Marco buys a train ticket to Florence: If you can't quite understand this dialog, register and PRACTICE ITALIAN for FREE."}, {"url": "http://www.gamesforlanguage.com/dictionary/italian/definition/per-favore-translation-from-italian", "passage_text": "Listen also to this conversation from our program as our hero Marco buys a train ticket to Florence: If you can't quite understand this dialog, register and PRACTICE ITALIAN for FREE. Then listen to the whole story as Marco travels though Italy."}, {"url": "http://www.wordreference.com/enit/favor", "passage_text": "English-Italian Italian-English Italian definition English definition Sinonimi inglesi English-French French-English English-Spanish Spanish-English Espanol-Español Francais-Français Francais-Français Espanol-Español Espanol: español Portugues: português Portugues: português espanol... español espanol español definicion definición espanol español sinonimos sinónimos catala català definicio definició altro"}]