[{"url": "http://www.gardenguides.com/94805-rid-creeping-charlie-creeping-jenny.html", "passage_text": "Glechoma hederacea, or Creeping Charlie, is a round-leaved, aromatic perennial herb with little blue flowers. It is a member of the mint family that also is known as Creeping Jenny. Lysimachia nummulari, or Moneywort, is a perennial weed with little yellow flowers. Overview. Glechoma hederacea, or Creeping Charlie, is a round-leaved, aromatic perennial herb with little blue flowers. It is a member of the mint family that also is known as Creeping Jenny. Lysimachia nummulari, or Moneywort, is a perennial weed with little yellow flowers. A member of the primrose family, it is also called"}, {"url": "http://www.gardeningknowhow.com/ornamental/groundcover/creeping-jenny/creeping-jenny-ground-cover.htm", "passage_text": "Image by DiverseFlora. By Susan Patterson, Master Gardener. Creeping jenny plant, also known as moneywort or Lysimachia, is an evergreen perennial plant belonging to the Primulaceae family. For those looking for information on how to grow creeping jenny, this low-growing plant thrives in USDA zones 2 to 10. Before planting creeping jenny, check with your local extension office to be sure that it is not restricted in your area due to its invasive nature. Creeping jenny is a hardy plant that will thrive in full sun or shade. Purchase plants from nurseries in the spring and choose a site, in the shade or sun that drains well"}, {"url": "https://en.wikipedia.org/wiki/Lysimachia_nummularia", "passage_text": "Creeping Jenny redirects here. Convolvulus arvensis (Field Bindweed) is also sometimes known by that name. Lysimachia nummularia (syn. Lysimachia zawadzkii Wiesner) is a species of flowering plant in the family Primulaceae. Its common names include creeping jenny, moneywort, herb twopence and twopenny thot. It is native to Europe, but has been introduced to North America, where it is considered an invasive species in some areas. It aggressively spreads in favorable conditions, such as low wet ground or near ponds, but is usually easily removed by hand pulling."}, {"url": "http://dnr.wi.gov/topic/Invasives/fact/Moneywort.html", "passage_text": "1 Several herbicides are effective in controlling moneywort; however, because moneywort usually grows in or near wetlands, be sure that the herbicide is aquatically-approved. 2  Rodeo is one such herbicide product that may be effective. Creeping, low-growing perennial with round, opposite leaves and yellow flowers. This species is Restricted (Orange counties). Other names for this plant include: 1  Common names: Creeping Jenny, creeping Joan, running Jenny, wandering Jenny, wandering sailor. 2  Scientific names: None."}, {"url": "http://dnr.wi.gov/topic/Invasives/fact/Moneywort.html", "passage_text": "(Lysimachia nummularia or L. nummelaria). Creeping, low-growing perennial with round, opposite leaves and yellow flowers. This species is Restricted (Orange counties). Other names for this plant include: 1  Common names: Creeping Jenny, creeping Joan, running Jenny, wandering Jenny, wandering sailor. 2  Scientific names: None."}, {"url": "http://www.eddmaps.org/ipane/ipanespecies/herbs/Lysimachia_nummularia.htm", "passage_text": "DESCRIPTION. Botanical Glossary. Lysimachia nummularia is an herbaceous mat forming perennial with smooth creeping stems. It can grow up to 61 cm (2 ft.) long and from 5.1-10.2 cm (2-4 in.) high. Its leaves are opposite, nearly sessile, broadly quadrate to subrotund in shape (roundish) and typically 1-3 cm (0.4-1.2 in.) long. "}, {"url": "http://www.invasive.org/species/subject.cfm?sub=5975", "passage_text": "Appearance. Lysimachia nummularia is an herbaceous, low-growing, perennial plant in the primrose family. The smooth creeping stems branch frequently and can grow up to 2 ft (m) long and 2-4 in (5.1-10.2 cm) tall. It is native to temperate Asia and to Europe. Foliage. The leaves are opposite, simple and broadly ovate 0.25-1.5 in (0.6-3.8 cm) long with entire margins."}, {"url": "http://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=e202", "passage_text": "Lysimachia nummularia, commonly called creeping jenny or moneywort, is a rhizomatous perennial that is exceedingly short (to 2-3 tall) and exceeding swift afoot, typically creeping to 3' or more wide. It is native to Europe, but has naturalized in parts of eastern North America. "}]