[{"url": "http://www.infoplease.com/askeds/president-pro-tempore.html", "passage_text": "The president pro tempore of the Senate is third in the line of succession for the presidency, after the vice president and the speaker of the House. —The Editors. 1  Calculator. 2  Spelling Checker. 3  Place Finder. 4  Distance Calculator. 5  Periodic Table. 6  Conversion Tool."}, {"url": "https://en.wikipedia.org/wiki/President_pro_tempore_of_the_United_States_Senate", "passage_text": "According to the United States Constitution, the Vice President of the United States is the President of the Senate, despite not being a senator, and the Senate must choose a president pro tempore to act in his absence."}, {"url": "http://www.heritage.org/constitution/articles/1/essays/16/president-pro-tempore", "passage_text": "President Pro Tempore. The Senate shall chuse their other Officers, and also a President pro tempore, in the Absence of the Vice President, or when he shall exercise the Office of President of the United States."}, {"url": "http://www.insidejobs.com/careers/president-pro-tempore", "passage_text": "The President Pro Tempore is in charge of the United States Senate when the Vice President isn’t available. The job title makes the temporary nature of power in the position quite clear, as “pro tempore” means “for the time being.” This doesn’t mean, however, that the President Pro Tempore position itself is temporary."}, {"url": "http://www.wisegeek.com/what-is-the-president-pro-tempore-of-the-senate.htm", "passage_text": "The president pro tempore of the Senate is the second-highest official in the United States Senate, after the vice president, who is the president ex officio of the Senate. Typically, the person holding this position is the senior senator of the majority party, and the highest ranking member of the Senate as a result."}, {"url": "http://www.answers.com/Q/What_are_the_duties_of_the_President_Pro-Tempore_of_the_US_Senate", "passage_text": "Patrick Leahy from Vermont is the current  president pro Tempore. The pro tempore is a senator elected by the  Senate. By tradition they elect the majority party member with … the  longest seniority in the Senate. Leahy is in his 7th term and was  72 when he replaced 88-year-old Daniel Inouye in Dec, 2012."}, {"url": "http://www.answers.com/Q/What_is_a_president_pro_tempore", "passage_text": "A president pro tempore is the leader of the Senate when the Vice-President is not there. (pro tempore is Latin phrase which means for the time being.) Unlike the VP, he can also vote to create a tie, since he is a Senator. The position is elected by the Senators."}, {"url": "http://www.answers.com/Q/What_is_a_president_pro_tempore", "passage_text": "The president pro tempore is elected by the Senate and is customarily the longest serving senator in the majority party.Originally, the president pro tempore was appointed on … an intermittent basis when the vice president was not present to preside over the Senate."}, {"url": "http://study.com/academy/lesson/president-pro-tempore-definition-role-duties.html", "passage_text": "The Duties of the President Pro Tempore. The President Pro Tempore (the phrase is Latin for 'for the time being') has been, since 1890, the senior Senator of the majority party. His or her job, when the V.P. isn't around, is to preside over Senate sessions."}]