[{"url": "https://en.wikipedia.org/wiki/Inductive_automation", "passage_text": "Inductive Automation introduced the server-centric architecture for SCADA systems with FactorySQL and FactoryPMI in 2003. "}, {"url": "http://www.sagedesignsinc.com/products/SCADA_software/ClearSCADA.htm", "passage_text": "For today’s modern installations, ClearSCADA is introduced as a premium SCADA data collection, storage, retrieval and display product. ClearSCADA offers a high level of integration between hardware and software. Application Development. ClearSCADA is designed by SCADA system users, for SCADA system users, and has evolved into a high performance platform that connects to virtually all of your SCADA infrastructure and business systems."}, {"url": "https://en.wikipedia.org/wiki/SCADA", "passage_text": "1 The historian is a client that requests data from a data acquisition server. 2  A supervisory (computer) system, gathering (acquiring) data on the process and sending commands (control) to the SCADA system. 3  Communication infrastructure connecting the supervisory system to the remote terminal units. Data acquisition begins at the RTU or PLC level and includes meter readings and equipment status reports that are communicated to SCADA as required. Data is then compiled and formatted in such a way that a control room operator using the HMI can make supervisory decisions to adjust or override normal RTU (PLC) controls."}, {"url": "http://download.cnet.com/Modbus-SCADA/3000-2064_4-75984418.html", "passage_text": "Publisher's Description. From WLC Systems: Modbus SCADA is a simple and easy to use software for data collection and system monitoring. The software collects data from Modbus enabled systems (PLCs, Instruments, I/O Modules) and displays it in a friendly way on HMI-Human Machine Interface. "}, {"url": "https://en.wikipedia.org/wiki/SCADA", "passage_text": "SCADA (supervisory control and data acquisition) is a system that operates with coded signals over communication channels so as to provide control of remote equipment (using typically one communication channel per remote station). Data acquisition begins at the RTU or PLC level and includes meter readings and equipment status reports that are communicated to SCADA as required. Data is then compiled and formatted in such a way that a control room operator using the HMI can make supervisory decisions to adjust or override normal RTU (PLC) controls."}, {"url": "http://www.automation.com/product-showcase/emerson-introduces-ovation-scada-for-wind-energy", "passage_text": "PITTSBURGH (December 20, 2007)  Emerson Process Management introduced Ovation SCADA for wind energy management. The Ovation SCADA system features state-of-the-art monitoring, control and diagnostic functionality that optimizes wind farm operations. The introduction of the Ovation SCADA Solution for wind energy management comes at an opportune time. The World Wind Energy Association expects total installed capacity for wind energy to grow from roughly 74,000 MW in 2006 to 160,000 MW in 2010  an increase of nearly 54 percent."}, {"url": "https://en.wikipedia.org/wiki/SCADA", "passage_text": "The term SCADA (Supervisory Control and Data Acquisition) usually refers to centralized systems which monitor and control entire sites, or complexes of systems spread out over large areas (anything from an industrial plant to a nation). Most control actions are performed automatically by RTUs or by PLCs. Data acquisition begins at the RTU or PLC level and includes meter readings and equipment status reports that are communicated to SCADA as required. Data is then compiled and formatted in such a way that a control room operator using the HMI can make supervisory decisions to adjust or override normal RTU (PLC) controls."}, {"url": "http://www.elp.com/articles/powergrid_international/print/volume-16/issue-2/features/the-state-of-scada.html", "passage_text": "In the 1980s, vendors and utilities were introduced to more standardized, interactive systems across larger networks, and SCADA use became common at utilities. In the power industry, SCADA is sometimes referred to as part, or all, of an EMS (energy management system). If connected to a power plant, it could be part, or all, of a GMS (generation management system). It also could be swapped with or added to a DMS (a distribu"}, {"url": "http://www.powersystem.org/scada", "passage_text": "Supervisory control and data acquisition (SCADA) systems have traditionally played a vital role by providing utilities with valuable knowledge and capabilities that are key to a primary business function-delivering power in a reliable and safe manner. A quality SCADA solution is central to effective operation of a utility's most critical and costly distribution, transmission, and generation assets. The challenging issues for SCADA systems and projects today are not the same as they were a few years ago."}, {"url": "https://en.wikipedia.org/wiki/SCADA", "passage_text": "The control system may be combined with a data acquisition system by adding the use of coded signals over communication channels to acquire information about the status of the remote equipment for display or for recording functions. Data acquisition begins at the RTU or PLC level and includes meter readings and equipment status reports that are communicated to SCADA as required. Data is then compiled and formatted in such a way that a control room operator using the HMI can make supervisory decisions to adjust or override normal RTU (PLC) controls."}]