[{"url": "http://www.encyclopedia.com/topic/Pituitary_dwarfism.aspx", "passage_text": "Dwarfism is a condition in which the growth of the individual is very slow or delayed. There are many forms of dwarfism. The word pituitary is in reference to the pituitary gland in the body. This gland regulates certain chemicals (hormones) in the body. Therefore, pituitary dwarfism is decreased bodily growth due to hormonal problems."}, {"url": "http://www.encyclopedia.com/topic/Pituitary_dwarfism.aspx", "passage_text": "Description. Pituitary dwarfism is caused by problems arising from the pituitary gland. The pituitary gland, also called the hypophysis, is a gland at the base of the brain that produces many different hormones. This gland is divided into the anterior (front) and posterior (back) halves. There are many forms of dwarfism. The word pituitary is in reference to the pituitary gland in the body. This gland regulates certain chemicals (hormones) in the body. Therefore, pituitary dwarfism is decreased bodily growth due to hormonal problems."}, {"url": "http://www.mayoclinic.org/diseases-conditions/dwarfism/basics/causes/CON-20032297", "passage_text": "Causes. Most dwarfism-related conditions are genetic disorders, but the causes of some disorders are unknown. Most occurrences of dwarfism result from a random genetic mutation in either the father's sperm or the mother's egg rather than from either parent's complete genetic makeup."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/9401536", "passage_text": "The Dwarfs of Sindh: severe growth hormone (GH) deficiency caused by a mutation in the GH-releasing hormone receptor gene. Baumann G(1), Maheshwari H. Author information: (1)Department of Medicine, Northwestern University Medical School, Chicago, Illinois 60611, USA. [PubMed-indexed for MEDLINE]. "}, {"url": "http://www.encyclopedia.com/topic/Pituitary_dwarfism.aspx", "passage_text": "A common form of pituitary dwarfism is due to deficiencies in the production of growth hormone (GH). When less GH than normal is produced during childhood, an individual's arms, legs, and other structures continue to develop in normal proportions, but at a decreased rate. There are many forms of dwarfism. The word pituitary is in reference to the pituitary gland in the body. This gland regulates certain chemicals (hormones) in the body. Therefore, pituitary dwarfism is decreased bodily growth due to hormonal problems."}, {"url": "http://discovermagazine.com/2013/april/19-double-edged-genes", "passage_text": "Rare Form of Dwarfism Protects Against Cancer. In a remote corner of Ecuador, doctors researching a rare form of dwarfism make a startling discovery: People who inherit the genetic defect may be immune to cancer and other diseases. By Gary Taubes. RELATED TAGS: CANCER, GENES & HEALTH. But unlike Rosenbloom’s other patients, a workup showed they were not lacking growth hormone; instead, they had a rare form of dwarfism known as Laron syndrome, caused by a genetic mutation that prevents the body from responding to growth hormone."}, {"url": "http://www.sciencedirect.com/science/article/pii/B9780123750976100320", "passage_text": "Contrary to many forms of dwarfism (such as achondroplasia or other bone dysplasias), GH deficiency (GHD) (commonly referred to as “pituitary dwarfism”) and GH resistance are characterized by normal body proportions. Clinically, growth hormone deficiency or defects in its binding to receptor are seen as growth retardation or dwarfism. Conversely, excess secretion of growth hormone prior to fusion of the epiphysial growth plates results in gigantism."}, {"url": "http://www.sciencedirect.com/science/article/pii/B9780123750976100320", "passage_text": "Publisher Summary. This chapter reviews the presentations and most common causes of these neuroendocrine growth disorders, highlighting various gene mutations, endocrine syndromes, and acquired defects that result in states of growth hormone deficiency or excess. Clinically, growth hormone deficiency or defects in its binding to receptor are seen as growth retardation or dwarfism. Conversely, excess secretion of growth hormone prior to fusion of the epiphysial growth plates results in gigantism."}, {"url": "http://www.touchendocrinology.com/articles/new-treatments-growth-hormone-deficiency", "passage_text": "Historical Perspective Growth hormone deficiency (GHD) was recognized only after the discovery of GH in 1921; however, this form of proportional dwarfism had been described much earlier. The Update of Guidelines for the Use of Growth Hormone in Children 12 has suggested that GH therapy for GHD be initiated only after an MRI or a computed tomography (CT) scan has excluded an intracranial mass lesion."}]