[{"url": "https://en.wikipedia.org/wiki/Sonnet", "passage_text": "The first known sonnets in English, written by Sir Thomas Wyatt and Henry Howard, Earl of Surrey, used this Italian scheme, as did sonnets by later English poets including John Milton, Thomas Gray, William Wordsworth and Elizabeth Barrett Browning. He wrote almost 250 sonnets. Other Italian poets of the time, including Dante Alighieri (1265–1321) and Guido Cavalcanti (c. 1250–1300), wrote sonnets, but the most famous early sonneteer was Petrarca (known in English as Petrarch)."}, {"url": "http://www.answers.com/Q/Where_does_a_sonnet_originate_from", "passage_text": "A sonnet is a form of poem originated from Europe-traditionally it is composed of 14 lines that follows strict rhyme scheme and specific structure. Rhyme structure could be abab cdcd efef gg... but conventions associated with the sonnet have evolved over its history. 11 people found this useful. The Shakespearean sonnet has three quartets and a couplet, and a rhyme scheme of abab,cdcd,efef,gg. The sonnet you will most often see when you study literature in a high school English class is the Shakespearean sonnet."}, {"url": "http://www.english.illinois.edu/maps/sonnet.htm", "passage_text": "Originating in Italy, the sonnet was established by Petrarch in the 14th century as a major form of love poetry, and came to be adopted in Spain, France and England in the 16th century, and in Germany in the 17th. An important variant of this is the Spenserian sonnet (introduced by the Elizabethan poet Edmund Spenser), which links the three quatrains by rhyme, in the sequence ababbabccdcdee. In either form, the 'turn' comes with the final couplet, which may sometimes achieve the neatness of an epigram."}, {"url": "http://www.answers.com/Q/Where_does_a_sonnet_originate_from", "passage_text": "A Petrarchian sonnet is comprised of an octet (8 lines) followed by a sestet (6 lines), all written in iambic pentameter. The rhyme scheme can vary, but it is generally abbaabba in the octet, and either cdecde, cdcdcd, or cdcdee for the sestet. The Spensarian sonnet has an interlocking rhyme scheme of abab,bcbc,cdcd,ee. The Shakespearean sonnet has three quartets and a couplet, and a rhyme scheme of abab,cdcd,efef,gg. The sonnet you will most often see when you study literature in a high school English class is the Shakespearean sonnet."}, {"url": "http://www.answers.com/Q/Where_does_a_sonnet_originate_from", "passage_text": "There is the Petrarchian (Italian sonnet), which is the oldest one; the Spensarian sonnet; and the Shakespearean (English or Elizabethan) sonnet. True sonnets have 14 lines, but the forms of the three sonnets named here differ. The Shakespearean sonnet has three quartets and a couplet, and a rhyme scheme of abab,cdcd,efef,gg. The sonnet you will most often see when you study literature in a high school English class is the Shakespearean sonnet."}, {"url": "https://en.wikipedia.org/wiki/Sonnet", "passage_text": "A sonnet is a poetic form which originated in Italy; Giacomo Da Lentini is credited with its invention. The term sonnet is derived from the Italian word sonetto (from Old Provencal provençal sonet a little, poem from son, song From latin sonus a). sound He wrote almost 250 sonnets. Other Italian poets of the time, including Dante Alighieri (1265–1321) and Guido Cavalcanti (c. 1250–1300), wrote sonnets, but the most famous early sonneteer was Petrarca (known in English as Petrarch)."}, {"url": "http://www.answers.com/Q/Where_did_sonnets_originate", "passage_text": "A sonnet is a form of poem originated from Europe-traditionally it is composed of 14 lines that follows strict rhyme scheme and specific structure. Rhyme structure could be abab cdcd efef gg... but conventions associated with the sonnet have evolved over its history. The Spensarian sonnet has an interlocking rhyme scheme of abab,bcbc,cdcd,ee. The Shakespearean sonnet has three quartets and a couplet, and a rhyme scheme of abab,cdcd,efef,gg."}, {"url": "https://en.wikipedia.org/wiki/Sonnet", "passage_text": "The term sonnet is derived from the Italian word sonetto (from Old Provencal provençal sonet a little, poem from son, song From latin sonus a). Sound by the thirteenth century it signified a poem of fourteen lines that follows a strict rhyme scheme and specific. structure He wrote almost 250 sonnets. Other Italian poets of the time, including Dante Alighieri (1265–1321) and Guido Cavalcanti (c. 1250–1300), wrote sonnets, but the most famous early sonneteer was Petrarca (known in English as Petrarch)."}, {"url": "http://www.english.illinois.edu/maps/sonnet.htm", "passage_text": "The transition from octave to sestet usually coincides with a 'turn' (Italian, volta) in the argument or mood of the poem. In a variant form used by the English poet John Milton, however, the 'turn' is delayed to a later position around the tenth line. An important variant of this is the Spenserian sonnet (introduced by the Elizabethan poet Edmund Spenser), which links the three quatrains by rhyme, in the sequence ababbabccdcdee. In either form, the 'turn' comes with the final couplet, which may sometimes achieve the neatness of an epigram."}]