[{"url": "http://www.livestrong.com/article/292099-how-long-after-you-eat-can-you-workout/", "passage_text": "Timing. Make it a practice to eat large meals at least three to 4 hours before working out. If you have a smaller sized meal, you can work out two to 3 hours after eating. Light snacks are typically fine when eaten right before and even during exercise. When you are done working out, you can enjoy a meal immediately"}, {"url": "http://healthyeating.sfgate.com/soon-can-bed-after-eat-11358.html", "passage_text": "Eat a Few Hours Before Bed. In a health column in The Globe and Mail newspaper, dietitian Leslie Beck recommends eating your last large meal of the day no later than two to three hours before you go to bed. If you're up late and it's been four to five hours since your last large meal, eat a small snack leading to bedtime. The misunderstanding that you'll gain weight by eating late might be tied to the types of food people typically eat before bed. Even if you make healthy dietary choices throughout the day, it's easy to reach for high-calorie snacks such as chips, cookies or sweets while watching TV in the evening."}, {"url": "http://www.runnersworld.com/for-beginners-only/how-long-should-i-wait-to-run-after-eating", "passage_text": "Good point! Let's define large meal as a meal containing more than 600 calories with several ounces of protein or meat, carbohydrates, vegetables, and dessert—a typical dinner or large lunch. If you have a meal like this, you should wait three to four hours before running. Experimenting in your training with eating and running will let you know just how much you are able to eat before a run. For the best training results though, allow three to four hours after eating before running, especially if the workout calls for some intensity."}, {"url": "http://www.popsugar.com/fitness/How-Long-Should-I-Wait-Work-Out-After-Eating-29777118", "passage_text": "When it comes to eating before exercise, it's all about timing. No matter what time of day you choose to exercise, make sure to plan your workout two to three hours after your meal. Going overboard with too much food right before a workout will leave you feeling sluggish and can lead to stomach discomfort. How you space out meals during the course of the day might not make a big difference in the calorie department, but it has huge implications on your workout performance. Not only can ineffectively fueling your body hinder your performance, but also, eating too much before exercise can interfere with your goals."}, {"url": "http://www.sixwise.com/newsletters/07/05/08/eating-and-exercise-should-you-eat-after-exercising-before-how-long-and-what.htm", "passage_text": "You should wait to exercise if you've eaten a large meal (at least three to four hours, but sometimes up to six, is required). This is because it takes your body some time to digest a large meal, but intense exercise slows your digestion (and instead diverts energy to your muscles). You should eat carbohydrates (such as a piece of fruit, raw veggies or whole-grain crackers) as soon as possible after exercising, and eat some protein (a hard-boiled egg, nuts, turkey, chicken, etc.) within two hours of your workout."}, {"url": "http://www.mindbodygreen.com/0-4970/The-Major-Rule-for-Eating-Fruit.html", "passage_text": "(3-4 servings of fruit is a proper daily requirement, that's 2 1/2 - 2 cups of fruit). If you feel very hungry after your fruit servings, pay attention to what you've had for breakfast and maybe your meal planning needs to be adjusted. You should be able to wait it out about 1-2 hours with success. We eat approximately 3 large meals a day, so space out your fruit servings in between. If this means you need to glance at the clock occasionally and calculate when you could eat the apple you brought along with you, then you do that. And aim to have it about 1 hour before a meal, or 2 hours after your meal. For heavier meals, like pasta or burgers, you need to let that food digest for even longer before you add fruit with all its acid into your stomach, about 3-4 hour"}, {"url": "http://fitness.stackexchange.com/questions/1731/how-long-should-i-wait-to-exercise-after-eating", "passage_text": "up vote 2 down vote. Unfortunately, there is no strict formula for this and the answer strongly depends on the intensity of exercise. If you are uncomfortable when exercising, it has a direct effect on my performance. If I eat a full meal, I have to wait 2 to 3 hours before high intensity exercise. tons of fluids. It takes 30 to 40 minutes for food to digest in your stomach and 3 to 4 hours for it to absorb in your intestines. I agree that there is no strict formula for this, since it also depends on what you eat and how you intend to expend that energy."}, {"url": "http://www.popsugar.com/fitness/How-Long-Should-I-Wait-Work-Out-After-Eating-29777118", "passage_text": "Damian15154122 1 year. You couldn't be more wrong, as long as ur meal is a smaller portion like you should be eating anyway if your trying t healthy, within 30-40 minutes you should be good to workout. How you space out meals during the course of the day might not make a big difference in the calorie department, but it has huge implications on your workout performance. Not only can ineffectively fueling your body hinder your performance, but also, eating too much before exercise can interfere with your goals."}]