[{"url": "http://spartacus.wikia.com/wiki/Spartacus:_War_Of_The_Damned", "passage_text": "Spartacus: War of the Damned is the fourth installment in the Spartacus series, and the official third season after its prequel, Spartacus: Vengeance. It is the final season of the series, concluding the end of the Third Servile War. War of the Damned premiered on January 25, 2013 and concluded on April 12, 2013."}, {"url": "http://www.ranker.com/list/full-cast-of-spartacus-blood-and-sand-cast-list-for-the-show-spartacus-blood-and-sand/reference", "passage_text": "This list includes all of the Spartacus: Blood and Sand main actors and actresses, so if they are an integral part of the show you'll find them below. You can various bits of trivia about these Spartacus: Blood and Sand stars, such as where the actor was born and what their year of birth is."}, {"url": "http://www.ign.com/articles/2014/09/17/arrow-spartacus-nick-tarabay-cast-as-captain-boomerang", "passage_text": "Share. Digger Harkness-aka DC's Captain Boomerang-is headed to Starling City for Arrow Season 3! According to EW.com, Nick Tarabay, who played the scheming Ashur on Starz' Spartacus, has signed on for a multi-episode arc as a villain who has both comic connections to The Flash and the Suicide Squad."}, {"url": "http://www.ranker.com/list/full-cast-of-spartacus-blood-and-sand-cast-list-for-the-show-spartacus-blood-and-sand/reference", "passage_text": "This cast list of actors from Spartacus: Blood and Sand focuses primarily on the main characters, but there may be a few actors who played smaller roles on Spartacus: Blood and Sand that are on here as well. This list features actors like Lucy Lawless Erin Cummings, and many more."}, {"url": "http://www.ranker.com/list/spartacus-vengeance-cast-list/reference", "passage_text": "This cast list of actors from Spartacus: Vengeance focuses primarily on the main characters, but there may be a few actors who played smaller roles on Spartacus: Vengeance that are on here as well. Everything from Lucy Lawless to Manu Bennett is included below."}, {"url": "http://www.ign.com/articles/2014/09/17/arrow-spartacus-nick-tarabay-cast-as-captain-boomerang", "passage_text": "Tarabay is the fourth Spartacus actor to be cast on Arrow, following Manu Bennett (Slade), Katrina Law (Nyssa al Ghul), and Cynthia Addai-Robinson (Amanda Waller). Matt Fowler is a writer for IGN. Follow him on Twitter at @TheMattFowler and Facebook at Facebook.com/Showrenity."}]