[{"url": "http://www.physiotherapynotes.com/2011/03/canada-physiotherapy-schools-list-of.html", "passage_text": "If you are planning to have a degree in physiotherapy, here is a list of physiotherapy schools in Canada with their corresponding address, contact information and PT programs offered. A link to the physiotherapy education Website is included whenever available."}, {"url": "http://bcphysio.org/faq/access-fees-and-coverage-physiotherapy-bc", "passage_text": "However, according to a 2012 nationwide survey, over three quarters of British Columbians have supplementary health benefits from group insurance plans that include physiotherapy*. Coverage can range from $200 to $500 per person, per year**, and up to $750 for some plans***. Low-income people receive supplementary coverage for physiotherapy through MSP Premium Assistance (details below). Clinic fees reflect the time spent directly with the physiotherapist. Fees are set individually and vary depending on the length of direct physiotherapist time (generally 20-60 min) and the treatment needed. Cost per visit generally fall between $63 and $190."}, {"url": "http://bcphysio.org/faq/access-fees-and-coverage-physiotherapy-bc", "passage_text": "On January 1, 2002, physiotherapy was de-listed by the government from the British Columbia Medical Services Plan (MSP), meaning that the majority of people in BC must pay for physiotherapy through extended health benefits, their own money, or a combination of the two."}, {"url": "http://www.policyalternatives.ca/sites/default/files/uploads/publications/BC%20Office/2011/07/CCPA_BC_cost_of_poverty_full_report.pdf", "passage_text": "The cost to society overall is considerably higher— $8.1 to $9.2 billion, or be-tween 4.1 per cent and 4.7 per cent of BC’s GDP (Gross Domestic Product, or the size of our econ-omy). That is as much as $2,100 for every man, woman and child in BC, or $8,400 for a family of four, every year. In contrast, the estimated cost of a comprehensive poverty reduction plan in BC is $3 to $4 billion per year."}, {"url": "http://www.policyalternatives.ca/sites/default/files/uploads/publications/BC%20Office/2011/07/CCPA_BC_cost_of_poverty_full_report.pdf", "passage_text": "We estimate that poverty in British Columbia cost us approximately $8.1 to $9.2 billion in 2008. This was about 4.1 to 4.7 per cent of BC’s GDP in 2008, or $1,900 to $2,100 annually for every man, woman and child living in the province."}, {"url": "http://www.policyalternatives.ca/sites/default/files/uploads/publications/BC%20Office/2011/07/CCPA_BC_cost_of_poverty_full_report.pdf", "passage_text": "32 THE COST OF POVERTY IN BC If the poor households in BC were able to escape poverty and earn the equivalent of the average incomes in the second income quintile (market incomes were $32,200), they would have an extra $25,300 per household."}]