[{"url": "http://articles.chicagotribune.com/1990-07-29/features/9003030670_1_human-insulin-recombinant-human-pancreas", "passage_text": "A-Human insulin has been available since 1982. It can be extracted from the human pancreas, but for the most part it is manufactured in the laboratory using recombinant DNA technology. Human insulin has been shown to have significant advantages over beef and pork extracted insulins."}, {"url": "http://www.gene.com/media/press-releases/4160/1978-09-06/first-successful-laboratory-production-o", "passage_text": "South San Francisco, Calif. -- September 6, 1978 --. Insulin is a protein hormone produced in the pancreas and used in the metabolism of sugar and other carbohydrates. The synthesis of human insulin was done using a process similar to the fermentation process used to make antibiotics."}, {"url": "http://www.biotecharticles.com/Genetics-Article/Advantages-of-Recombinant-DNA-351.html", "passage_text": "6) Treatment of Diabetes:- Beside cancer, recombinant DNA has been used to treat other diseases also. To treat the disease of diabetes, insulin is produced using recombinant DNA technology. It is now possible to produce insulin in the laboratory which is similar to the human insulin produced by pancreas. So there is no danger in using insulin made by recombinant DNA in the diabetic patients."}, {"url": "http://www.iptv.org/exploremore/ge/what/insulin.cfm", "passage_text": "Recombinant DNA: Example Using Insulin. Genetic engineering processes can make human insulin. Human insulin DNA is placed into the DNA of a second organism. The host organism becomes an insulin-producing factory."}, {"url": "http://www.iptv.org/exploremore/ge/what/insulin.cfm", "passage_text": "1. The gene for producing HUMAN insulin protein is isolated. The gene is part of the DNA in a human chromosome. The gene can be isolated and then copied so that many insulin genes are available to work with."}, {"url": "http://www.biotecharticles.com/Others-Article/Human-Insulin-and-Recombinant-DNA-Technology-70.html", "passage_text": "To treat the diabetic patient researchers produced Humulin using recombinant DNA technology by inserting human insulin gene into a vector (E. coli).... Introduction: Impaired insulin production in the beta cells of pancreas leads to the condition known as Diabetes Miletus."}]