[{"url": "https://en.wikipedia.org/wiki/Karyotype", "passage_text": "The basic number of chromosomes in the somatic cells of an individual or a species is called the somatic number and is designated 2n. Thus, in humans 2n = 46. In the germ-line (the sex cells) the chromosome number is n (humans: n = 23). p28. There may, or may not, be sex chromosomes. Polyploid cells have multiple copies of chromosomes and haploid cells have single copies. The study of karyotypes is important for cell biology and genetics, and the results may be used in evolutionary biology (karyosystematics) and medicine."}, {"url": "http://www.webmd.com/baby/karyotype-test", "passage_text": "Karyotype Test. Guide. Karyotype is a test to identify and evaluate the size, shape, and number of chromosomes in a sample of body cells. Extra or missing chromosomes, or abnormal positions of chromosome pieces, can cause problems with a person's growth, development, and body functions. "}, {"url": "http://www.answers.com/Q/How_a_karyotype_is_prepared_and_analyzed", "passage_text": "A way to test for chromosomal mutations Karyotype: A picture of all the chromosomes in a cell arranged in pairs. They are also arranged by size and shape starting with the lo … ngest chromosome. exists and is an alternate of. Merge this question into. Split and merge into it. Answer by ElijahR39. Confidence votes 177. Biologists photograph cells in Mitosis, then cut out the chromosomes from the photograph and group them together in pairs. A picture of chromosomes arranged this way is known as a Karyotyp"}, {"url": "http://www.cellgs.com/Shop/Services/Karyotyping/1192-Karyotype-Service-for-Human-Cells.html", "passage_text": "In order to generate a karyotype, cells have to be prepared to maximize the number of cells in metaphase. Prior to karyotype analysis, cell preparations are examined under the microscope and scored for karyotype spread quality with grading from 1 to 6. Preparations graded below 3 are not suitable for detailed analysis. Human cells contain 23 pairs of autosomal chromosomes (numbered 1-22) and two sex chromosomes (X and Y). Convention numbers human autosomes, in descending order by size, with the exceptions of chromosomes 21 (the smallest autosome) and 22. The sex chromosomes, X and Y, are ordered at the end of a karyotype."}, {"url": "http://arbl.cvmbs.colostate.edu/hbooks/genetics/medgen/chromo/cytotech.html", "passage_text": "Preparing a Karyotype. Metaphase cells are required to prepare a standard karyotype, and virtually any population of dividing cells could be used. Blood is easily the most frequently sampled tissue, but at times, karyotypes are prepared from cultured skin fibroblasts or bone marrow cells. None of the leukocytes in blood normally divide, but lymphocytes can readily be induced to proliferate, providing a very accessible source of metaphase cells."}, {"url": "http://employees.csbsju.edu/SSAUPE/biol121/karyotype.htm", "passage_text": "The advantage of a karyotype is that it enables a scientist to quickly determine the number of autosomes and sex chromosomes and whether or not the individual is male or female. Karyotypes are usually prepared from blood. "}, {"url": "http://study.com/academy/lesson/karyotype-definition-disorders-analysis.html", "passage_text": "Analysis of a Karyotype. It is often easier to understand a karyotype if a picture is taken. A karyogram is a photograph of an organism's chromosomes, in which the chromosomes have been sorted and arranged by size. Humans have a total of 46 chromosomes (23 from each parent), which you can see in the karyograms. The number and appearance of chromosomes vary among species. A karyotype is the number, size, and shape of chromosomes in an organism. To determine the karyotype of an organism, scientists must follow these steps: 1  Collect a cell from an individual."}, {"url": "http://monteweston.com/Biology/Jonas3.html", "passage_text": "A normal human karyotype, for example, includes 46 chromosomes or 23 pairs of chromosomes. Of these 46 chromosomes, both the male and the female each possess 22 pairs of autosomes, or non-sex chromosomes, and one pair of sex chromosomes. For the male, the sex chromosomes are XY. The term karyotype refers to the basic map, or picture, of the number,type, and structure of the chromosomes of a cell. The karyotype is created through a process in which a cell s mitotic division is halted or trapped during metaphase and held suspended by chemicals."}, {"url": "https://en.wikipedia.org/wiki/Karyotype", "passage_text": "The normal human karyotypes contain 22 pairs of autosomal chromosomes and one pair of sex chromosomes. Normal karyotypes for females contain two X chromosomes and are denoted 46,XX; males have both an X and a Y chromosome denoted 46,XY. There may, or may not, be sex chromosomes. Polyploid cells have multiple copies of chromosomes and haploid cells have single copies. The study of karyotypes is important for cell biology and genetics, and the results may be used in evolutionary biology (karyosystematics) and medicine."}]