[{"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/gynecological_health/menorrhagia_85,P00571/", "passage_text": "Menorrhagia is the most common type of abnormal uterine bleeding characterized by heavy and prolonged menstrual bleeding. In some cases, bleeding may be so severe and relentless that daily activities become interrupted. Other types of abnormal uterine bleeding (also called dysfunctional uterine bleeding) include: There are several possible causes of menorrhagia, including the following: Hormonal (particularly estrogen and progesterone) imbalance (especially seen in adolescents who are experiencing their first menstrual period and in women approaching menopause). Pelvic inflammatory disease. Uterine fibroids."}, {"url": "http://www.mayoclinic.org/diseases-conditions/menorrhagia/basics/causes/CON-20021959", "passage_text": "1 Menorrhagia is a well-known side effect of using a nonhormonal intrauterine device for birth control. 2  When an IUD is the cause of excessive menstrual bleeding, you may need to remove it. 3  Pregnancy complications. 4  A single, heavy, late period may be due to a miscarriage. 1 Uterine fibroids may cause heavier than normal or prolonged menstrual bleeding. 2  Polyps. 3  Small, benign growths on the lining of the uterus (uterine polyps) may cause heavy or prolonged menstrual bleeding. 4  Polyps of the uterus most commonly occur in women of reproductive age as the result of high hormone levels."}, {"url": "https://en.wikipedia.org/wiki/Menorrhagia", "passage_text": "A normal menstrual cycle is 21–35 days in duration, with bleeding lasting an average of 5 days and total blood flow between 25 and 80 mL. A blood loss of greater than 80 mL or lasting longer than 7 days constitutes menorrhagia (also called hypermenorrhea). Menorrhagia can be caused by abnormal blood clotting, disruption of normal hormonal regulation of periods, or disorders of the endometrial lining of the uterus. Depending upon the cause, it may be associated with abnormally painful periods (dys"}, {"url": "http://allonhealth.com/health-news/progesterone-and-menorrhagia.htm", "passage_text": "1 Menorrhagia is not the same as metrorrhagia, which means bleeding from the womb, independent of the menstrual cycle. 2  Menorrhagia is quit a common condition, experienced buy women at some time in their lives. 3  Hormone imbalances or underlying medical problems may cause menorrhagia. 1 Menorrhagia is quit a common condition, experienced buy women at some time in their lives. 2  Hormone imbalances or underlying medical problems may cause menorrhagia. 3  Some women experience heavy bleeding in the first few years after menstruation begins, or in the last few years before menopause."}, {"url": "http://www.cdc.gov/ncbddd/blooddisorders/women/menorrhagia.html", "passage_text": "If you have this type of bleeding, you should see a doctor. Untreated heavy or prolonged bleeding can stop you from living your life to the fullest. It also can cause anemia. Anemia is a common blood problem that can leave you feeling tired or weak. 1 Have menstrual periods lasting more than 7 days. 2  Have a menstrual flow with blood clots the size of a quarter or larger. 3  Have a heavy menstrual flow that keeps you from doing the things you would do normally. 4  Have constant pain in the lower part of the stomach during your periods."}, {"url": "https://www.womentowomen.com/menstruation/causes-and-treatment-of-menorrhagia/", "passage_text": "The causes of menorrhagia can vary greatly between women, but some problems are commonly root causes of the unusually heavy bleeding. Such things as fibroids, low progesterone relative to estrogen (both common in perimenopause), polycystic ovary syndrome (PCOS), or other hormonal imbalances are usually to blame. "}, {"url": "http://www.webmd.com/women/guide/heavy-period-causes-treatments", "passage_text": "A. A. A. Heavy or prolonged menstrual periods, or menorrhagia, are the most common type of abnormal bleeding from the uterus. Periods are considered heavy if there is enough blood to soak a pad or tampon every hour for several consecutive hours. Other symptoms of a heavy period can include: Causes of Menorrhagia. There are many possible causes of heavy menstrual bleeding. They include: 1  Hormonal imbalance, particularly in estrogen and progesterone; this is most common in adolescents who recently began their periods and women who are getting close to menopause."}, {"url": "http://www.cdc.gov/ncbddd/blooddisorders/women/menorrhagia.html", "passage_text": "However, women who have menorrhagia usually bleed for more than 7 days and lose twice as much blood. If you have bleeding that lasts longer than 7 days per period, or is so heavy that you have to change your pad or tampon nearly every hour, you need to talk with your doctor. 1 Have menstrual periods lasting more than 7 days. 2  Have a menstrual flow with blood clots the size of a quarter or larger. 3  Have a heavy menstrual flow that keeps you from doing the things you would do normally. 4  Have constant pain in the lower part of the stomach during your periods."}, {"url": "https://en.wikipedia.org/wiki/Menorrhagia", "passage_text": "Menorrhagia or hematomunia is an abnormally heavy and prolonged menstrual period at irregular intervals. Menorrhagia can be caused by abnormal blood clotting, disruption of normal hormonal regulation of periods, or disorders of the endometrial lining of the uterus. Depending upon the cause, it may be associated with abnormally painful periods (dysmenorrhea)."}, {"url": "http://www.aafp.org/afp/2007/0615/p1813.html", "passage_text": "Dysmenorrhea, mood change, and a perceived increase in the volume of menstrual bleeding are reported more often as severe problems by women with menorrhagia than is absolute blood loss. 4 Patient distress may be related more to disruptions in work, sexual activity, or quality of life than menstrual volume alone. Menorrhagia is defined as excessive uterine bleeding occurring at regular intervals or prolonged uterine bleeding lasting more than seven days. The classic definition of menorrhagia (i.e., greater than 80 mL of blood loss per cycle) is rarely used clinically."}]