[{"url": "http://www.pitbull-info-and-training.com/types-of-pitbulls.html", "passage_text": "The three most common types are the American Pit Bull Terrier, American Staffordshire Terrier and Staffordshire Bull Terrier. Of all of the dogs included in the pit bull grouping, only one, the American Pit Bull Terrier, is recognized by the United Kennel Club."}, {"url": "http://www.pitbull-info-and-training.com/black-and-white-pitbull.html", "passage_text": "Due to the popularity of the Black and white pit bull, it made sense to include them in the media. Aside from dogs made famous by TV and ads, there were plenty of other well-known Pitbull terriers as well. Here are just a few."}, {"url": "http://www.pitbulltraining101.com/blue-pitbulls-white-pitbulls-red-nose-pitbulls/", "passage_text": "The Point: If you have an American Pitbull Terrier, regardless of what color it is, it’s an American Pitbull Terrier. There’s no such breed as a Red Nosed Pitbull, White Pitbulls and Blue Pitbulls don’t exist as a breed, either. They do exist as color types within the breed, though. ."}, {"url": "http://www.allanimalsfacts.com/pitbull-puppies-types-of-pitbull-puppies/", "passage_text": "Black Pitbull Puppies. Black Pitbull Puppies. Black pitbulls are among a variety of colors which includes red, brindle, tan and others. Not to be mistaken for the blue pitbulls, which boast a unique shade of black, true black pitbulls are among the most common of the breed."}, {"url": "http://www.pitbulllovers.com/pitbull-articles/pitbulls-red-nose-blue-pit-bulls.html", "passage_text": "There is only one Pit Bull and that is The American Pit Bull Terrier. If they have a red nose, blue nose, blue coat, red coat, brindle coat, cream coat, fawn with white patches or a black mask, it doesn't matter at all. They are still 100% American Pit Bull Terriers (unless they are known mix breeds)."}, {"url": "http://www.answers.com/Q/What_breed_of_pitbull_if_black_and_white_has_blue_eyes", "passage_text": "Pitbull type of dogs are: American Pitbull terrier American Staffordshire terrier Staffordshire bull terrier White is just a color, not a type of breed."}]