[{"url": "http://www.networx.com/cost-guide/install-a-ceiling-fan", "passage_text": "tweet the cost to install a ceiling fan typically ranges from $ 440 to $ 970 including the fan itself supplies and labor ceiling fans are a practical energy efficient device for increasing interior air circulation in your home and reducing hvac costs both summer and winter cost breakdown cost to install a ceiling fan will normally include ceiling fan cost varies according to blade material hardwood tends to be the most expensive blade length finish and motor quality light fixture optional a light fixture may be built in to the ceiling fan model that you choose"}, {"url": "http://www.howmuchisit.org/cost-to-install-a-ceiling-fan/", "passage_text": "1 If the wiring is not there and a ceiling fan needs to be placed in an area of your choice, this area can get rather complex. 2  If wiring is needed as well as a new outlet box, the cost can be anywhere from $275 to as much as $650 depending on the complexity of the job. 1 On average, most electricians are going to charge anyhwere from $75 to $220 to install a ceiling fan in an existing light box. 2  If there is a light already in place where you want to place a ceiling fan, the electrician can simply take out the old light and replace it with a fan of your choice."}, {"url": "http://thehousingforum.com/how-much-does-it-cost-to-install-a-ceiling-fan/", "passage_text": "The majority of homeowners spent around $238-$330 for ceiling fan installations, with an average reported cost of $284. Several websites provide cost calculators that can help you determine the average price range for your specific location and project. Moreover, ceiling fans are less expensive to operate than air conditioners. National Average Cost of Ceiling Fan Installation. According to various home remodeling cost estimators, the 2013 national average price for new ceiling fan installation in the U.S. ranges from $95-$215, if done as a DIY project. The average DIYer spends around $143 on the"}, {"url": "http://home.costhelper.com/ceiling-fan.html", "passage_text": "1 Prices start at $20-$90 for a basic one-or two-speed ceiling fan that works off a pull chain or wall switch, usually with a straightforward design and a standardized (if unexciting) light fixture. 2  Expect to pay $200-$600 for a better-designed ceiling fan in a range of styles from Victorian to tropical to modernistic. "}, {"url": "http://askthehandyman.net/lighting-electrical/ceiling-fan-installation-cost/", "passage_text": "If it`s installing a fan/light in place of an existing fixture, with the required box and support, we would charge $75. Reply. My hourly rate is $55 per hour. i charge $55 to assemble and install a new standard one only if there is existing wires in the ceiling. Need 4 ceiling fans installed. 1 in living area, 1 in stairwell, and 1 in each bedroom. Moderator Comments: You could expect to pay a low of about 1 hour per fan to a high of 2 hours per fan for the installation."}, {"url": "http://www.lowes.com/cd_Ceiling+Fan+Install_177134023_", "passage_text": "Lowe's Ceiling Fan Install. Find ceiling fans for every room in your home. Use a Lowe's professional installer and save 30% on installation when you have multiple fans installed. Use our 2013 Ceiling Fan Guide to choose ceiling fans to suit your taste and lifestyle. Get Inspired. Browse ceiling fans on Lowes.com or at your local Lowe's store. Work with a Lowe's sales associate to plan your install project and select the right ceiling fan for your home and budget. 2. Get Started. Get an in-store installation quote."}, {"url": "http://www.lowes.com/projects/build-and-remodel/install-a-ceiling-fan/project", "passage_text": "The ceiling fan you install should be the right size for the room: 1  Rooms that measure about 75 square feet need a fan with a 29- to 36-inch blade diameter. 2  For rooms measuring 76 to 144 square feet, choose a fan with a blade diameter of 36 to 42 inches. "}, {"url": "http://www.homedepot.com/c/how_to_install_ceiling_fan_HT_PG_LF", "passage_text": "Hanging a ceiling fan is not mechanically difficult, and most fans come with good installation instructions; however, they are usually fairly heavy, so it's a good idea to have a helper assist you. Ceiling fans need to be properly anchored to an electric ceiling box that's designed to hold a heavy fixture. If you're swapping a simple light fixture with a ceiling fan, the box will likely need to be replaced with one rated for a ceiling fan. For an easier installation, consider a quick install ceiling fan, which installs in just three easy steps."}]