[{"url": "https://answers.yahoo.com/question/index?qid=20061227223523AAfv2zD", "passage_text": "Blood types A positive and O positive are virtually equally as common and are teh most common blood types. In general, negative blood types are far less common than their positive counterparts with AB negative being the least common. This is world wide, not restricted to any single country or region. · just now. Report Abuse. The most common blood type in the US is A+ and O+ (about 40% each) and this trend continues in most of the western nations. Many Asian nations have mostly A+ and B+ and thus there are also a lot of AB+. Rh positive is generally more commonly seen than Rh negative all over the world. Source(s): wikipedia"}, {"url": "http://tsminteractive.com/most-common-blood-types-america/", "passage_text": "It appears as if type O-positive is the most common followed by type A-positive. AB-negative has the distinction of being the least common. However, the distribution of blood types among those living in the United States seem to vary depending on racial and ethnic brackets. For example, while approximately 38 percent of Caucasians have type O-positive blood, nearly half of the African American population has it at 47 percent."}, {"url": "http://www.livescience.com/36559-common-blood-type-donation.html", "passage_text": "Answer: The approximate distribution of blood types in the U.S. population is as follows: 1  O-positive: 38 percent. 2  O-negative: 7 percent. 3  A-positive: 34 percent. 4  A-negative: 6 percent. 5  B-positive: 9 percent. 6  B-negative: 2 percent. 7  AB-positive: 3 percent. "}, {"url": "https://answers.yahoo.com/question/index?qid=20061227223523AAfv2zD", "passage_text": "Best Answer: In the US, Type O positive is the most common and type AB negative is the least common. Someone else posted a wildly incorrect ration for Rh postive and negative as 50:50, but in reality it is about 85% postive and 15% negative in the US. · just now. Report Abuse. The most common blood type in the US is A+ and O+ (about 40% each) and this trend continues in most of the western nations. Many Asian nations have mostly A+ and B+ and thus there are also a lot of AB+. Rh positive is generally more commonly seen than Rh negative all over the world. Source(s): wikipedia"}, {"url": "http://www.infoplease.com/askeds/most-common-blood-type.html", "passage_text": "The Answer: In the United States, 37% of the population has type O+ blood, making it the most common type. It's followed closely by A+, with 34%. Find out much more on our Blood Types page! —The Editors. 1  Calculator. 2  Spelling Checker. 3  Place Finder. 4  Distance Calculator. 5  Periodic Table."}, {"url": "http://www.webmd.com/heart-disease/news/20120814/blood-type-may-impact-heart-risk", "passage_text": "Half of Americans Are Type O. Type O is the most common blood type in the United States. About 45% of whites, 51% of African-Americans, 57% of Hispanics, and 40% of Asians in the U.S. have the blood type, according to the American Red Cross. The AB blood type is much rarer. Type O is the most common blood type in the United States. About 45% of whites, 51% of African-Americans, 57% of Hispanics, and 40% of Asians in the U.S. have the blood type, according to the American Red Cross"}, {"url": "http://www.redcrossblood.org/learn-about-blood/blood-types", "passage_text": "Blood Types and the Population. O positive is the most common blood type. Not all ethnic groups have the same mix of these blood types. Hispanic people, for example, have a relatively high number of O’s, while Asian people have a relatively high number of B’s. The mix of the different blood types in the U.S. population is: In general, Rh negative blood is given to Rh-negative patients, and Rh positive blood or Rh negative blood may be given to Rh positive patients. 1  The universal red cell donor has Type O negative blood type. 2  The universal plasma donor has Type AB"}, {"url": "http://www.bloodbook.com/type-facts.html", "passage_text": "Facts about Blood Types with charts about Blood Types and Blood type information O + O positive donors are needed more frequently than any other donor. Because O positive is the most common Blood type (39% of the population), it is needed more often by people requiring Blood in hospitals. Facts about Blood Types with charts about Blood Types and Blood type information. O - 7% of the population has O negative Blood. "}]