[{"url": "http://www.rappler.com/nation/89990-trillanes-sources-a1-binay", "passage_text": "'VALIDATION DONE.' Senator Antonio Trillanes IV vouches for the credibility of his sources but refuses to reveal their identities. File photo from Senate PRIB. “We can say that the information was confirmed to be true, then the sources of information, there is an Alpha and there is a Bravo, meaning there's A1 and also B1.”. Asked if he meant that he had two different sources, Trillanes said: “No, but A is a group. On B, I won't say anymore."}, {"url": "https://en.wikipedia.org/wiki/Antonio_Trillanes_IV", "passage_text": "Known as Sonny to his family and friends, Trillanes was born and raised in Caloocan, to Philippine Navy Capt. Antonio Floranza Trillanes, Sr. (PMA Class '59) of Ligao City, Albay, and Estelita (nee Née) fuentes From, Ivisan. capiz He formed part of the umbrella coalition of the administration-backed senatorial line-up for the 2013 Philippine Senate election known as the Team PNoy. Formally proclaimed as a Senator in May 2013, Trillanes was re-elected by 14,127,722 Filipinos as per Comelec's official tally of votes."}, {"url": "http://www.gmanetwork.com/news/story/274732/news/nation/who-is-antonio-trillanes-iv", "passage_text": "With more than 11 million votes, former Navy Lieutenant Senior Grade Antonio Trillanes IV ran as an independent and ranked 11th in the 2007 senatorial race. In July 2012, he signed up with Nacionalista Party, reportedly forging a coalition with the ruling Liberal Party for the upcoming 2013 polls. Oakwood mutiny. As one of the leaders of the failed Oakwood Mutiny, Trillanes was charged with violation of Article 134-A of the Revised Penal Code or coup d' etat at the Makati Regional Trial Court Branch 148."}, {"url": "http://www.spokeo.com/Antonio+Trillanes+Iv+1", "passage_text": "Ana Theresia “Risa” Hontiveros as inquest proceedings continued against Senator Antonio Trillanes IV and 49 others at the Camp Crame Multipurpose Hall who were accused of Rebellion. DOJ Undersecretary Fidel Esconde, state prosecutors Aristotle Reyes, Philip dela Cruz and Alvin Navarro were part of the inquest panel.owever, Senator Antonio Trillanes IV, an ally of the president, has filed a bill seeking to grant Aquino the necessary powers, indicating that the government may move ahead with the necessary steps to alleviate the growing crisis."}, {"url": "http://www.senate.gov.ph/senators/sen_bio/trillanes_antonio_bio.asp", "passage_text": "Antonio Fuentes Trillanes IV, or Sonny to his relatives and friends, was born and raised in Caloocan City. He traces his roots to Ligao, Albay in Bicol where his late father, Antonio Sr., grew up. His mother, Estelita, hails from the province of Capiz. Sonny is 35 years old; born on August 6, 1971. He is married to the former Arlene G. Orejana with two children namely: Francis Seth and Thea Estelle. Their third child, Alan Andrew, died of an illness while he was just twenty-one days old."}, {"url": "https://en.wikipedia.org/wiki/Antonio_Trillanes_IV", "passage_text": "In 2010, under Proclamation 75, President Benigno Aquino III granted amnesty to Trillanes and other military personnel accused of trying to oust the Arroyo administration. He was able for the first time to enter the Senate and perform his duties as a senator. He formed part of the umbrella coalition of the administration-backed senatorial line-up for the 2013 Philippine Senate election known as the Team PNoy. Formally proclaimed as a Senator in May 2013, Trillanes was re-elected by 14,127,722 Filipinos as per Comelec's official tally of votes."}, {"url": "http://www.spokeo.com/Antonio+Trillanes+Iv+1", "passage_text": "Antonio Sonny Fuentes Trillanes IV is a former Navy Lieutenant Senior Grade and currently serving as a senator of the Philippines since 2007. However, Senator Antonio Trillanes IV, an ally of the president, has filed a bill seeking to grant Aquino the necessary powers, indicating that the government may move ahead with the necessary steps to alleviate the growing crisis."}]