[{"url": "https://support.apple.com/en-us/HT201468", "passage_text": "Restart your computer. After Windows is installed, you can switch between OS X and Windows. Use the Startup Disk preference pane in OS X, or the Boot Camp system tray item in Windows to select your startup disk, then restart your computer. Get a Windows disk image. When you purchase Windows, it comes as a disk image file (ISO) that you download, or as an installation disc or USB flash drive. If your copy of Windows came on a DVD, you should create a disk image of it to work with Boot Camp."}, {"url": "http://www.howtogeek.com/186907/how-to-install-windows-on-a-mac-with-boot-camp/", "passage_text": "Click the Install button and Boot Camp Assistant will resize your Mac OS X partition and create the new partition for Windows. Your Mac will then restart and boot the Windows installer from the USB drive. Go through the installer and install Windows on your Mac like you’d install it on any other PC. However, if you already have a Boot Camp USB drive or you’ve already partitioned your Mac, you can uncheck these options to speed the process up. This is useful if you’re installing Windows on multiple Macs and you’ve already created a USB drive. Next, point your Mac at the ISO file or"}, {"url": "http://www.howtogeek.com/186907/how-to-install-windows-on-a-mac-with-boot-camp/", "passage_text": "How to Remove Windows From Your Mac. If you want to remove Windows from your Mac and free up space, reboot into Mac OS X and open the Boot Camp Assistant again. You’ll see the Remove Windows 7 or later version option here if Windows is currently installed. However, if you already have a Boot Camp USB drive or you’ve already partitioned your Mac, you can uncheck these options to speed the process up. This is useful if you’re installing Windows on multiple Macs and you’ve already created a USB drive. Next, point your Mac at the ISO file or"}, {"url": "http://lifehacker.com/5583650/run-mac-os-x-in-virtualbox-on-windows", "passage_text": "If you're on Windows, need to use OS X, but don't want to buy or build a new computer, reader Bobby Patton shows us how to run Snow Leopard in a virtual machine on Windows with just a few tweaks. UPDATE: This guide is now out of date. If you want to run OS X inside VirtualBox on Windows, check out our new guide here. "}, {"url": "http://www.wikihow.com/Install-Mac-OS-X-10-3-%28Panther%29-on-Your-Windows-PC", "passage_text": "If you are using 1024x768 with Windows, you can you can use it for PearPC. You must pick 32 for the color depth. There is a small bug in the PearPC Control Panel, that if you pick 16, PearPC will not start. For Video Driver, put either video.x, or the full path to the file, which should be C:\\PearPC\\video.x. It is possible to install Mac OS X on your Windows PC. A small software package called PearPC emulates the Mac hardware on your PC. You can even install many Mac programs."}, {"url": "http://lifehacker.com/5938332/how-to-run-mac-os-x-on-any-windows-pc-using-virtualbox", "passage_text": "1 Click on the CD icon at the bottom of the VirtualBox window and select Choose a Virtual CD/DVD Disk File. 2  This time, choose your hacked Mountain Lion ISO. 3  Go back to the HackBoot boot screen and press F5. 4  It should reload the boot menu, this time showing you an OS X Install DVD. 5  Select this option and press Enter. 1 After a moment, it'll take you to the OS X Installation screen. 2  Click on your VirtualBox hard drive in the left sidebar, then click the Erase tab in Disk Utility's main pane. 3  Give your drive a name (like Macintosh HD) and click Erase."}, {"url": "http://www.wikihow.com/Install-Mac-OS-X-10-3-%28Panther%29-on-Your-Windows-PC", "passage_text": "How to Install Mac OS X 10 3 (Panther) on Your Windows PC. It is possible to install Mac OS X on your Windows PC. A small software package called PearPC emulates the Mac hardware on your PC. You can even install many Mac programs."}, {"url": "http://www.apple.com/osx/what-is/compatibility/", "passage_text": "With OS X, you can move all the information from your old PC to your new Mac. Built-in Windows-to-Mac migration in OS X automatically transfers your documents, music, contacts, calendars, and email accounts (Outlook and Windows Live Mail), and puts them in the appropriate folders and applications on your new Mac. Just like that."}, {"url": "http://lifehacker.com/5938332/how-to-run-mac-os-x-on-any-windows-pc-using-virtualbox", "passage_text": "Before we install OS X, we'll need to set up VirtualBox so the OS X install disc can boot correctly. Here's what you need to do: 1  Start up VirtualBox and click the New button. 2  Give your new virtual machine a name (I just called it Mac OS X) and set the operating system to Mac OS X Server (64-bit). 1 After a moment, it'll take you to the OS X Installation screen. 2  Click on your VirtualBox hard drive in the left sidebar, then click the Erase tab in Disk Utility's main pane. 3  Give your drive a name (like Macintosh HD) and click Erase."}, {"url": "http://www.wikihow.com/Install-Mac-OS-X-10-3-%28Panther%29-on-Your-Windows-PC", "passage_text": "18. Now its time to run PearPC and install Mac OS X. Double-click the Mac OS X icon in the PearPC Control Panel (or whatever you named it). This starts PearPC. You'll be given a couple options on which drive to boot from, the HD, or CDROM. Choose CDROM. It is possible to install Mac OS X on your Windows PC. A small software package called PearPC emulates the Mac hardware on your PC. You can even install many Mac programs."}]