[{"url": "http://www.answers.com/Q/When_does_a_bearded_dragon_lay_eggs", "passage_text": "Do bearded dragons lay eggs? Yes, they do. Egg laying generally occurs anywhere from 4 to 6 weeks after a successful breeding. The eggs are incubated at 82 to 84 degrees Fahrenheit for a period of 65-75 d … ays, at which time the eggs will begin to collapse, and usually hatch within 24 hours. The female bearded dragon lays her eggs anywhere from 4 to 6 weeks after a successful breeding. A female will likely lay eggs whether she has been bred or not. They generally lay their eggs sometime during he spring. Last year my girls laid their eggs late April"}, {"url": "http://rioreptiles.com/eggs.html", "passage_text": "In an emergency, like if your dragon lays eggs and you didn't know she was gravid, there are a few things you can do to try and save the eggs. You must work quickly though, you only have about 24 hours to get it right. Do not delay your female from laying for any reason, she is counting on you to provide her with the necessary tools to do her job quickly and comfortably! First time egg layers may take up to a week to lay their first clutch."}, {"url": "http://www.everythingreptile.org/signs-of-a-gravid-female-bearded-dragon-and-what-to-do-for-her.html", "passage_text": "Some female bearded dragons will lay infertile eggs. Infertile eggs are eggs that have not been fertilized by a male and therefore will not hatch out into baby bearded dragons. The signs of a dragon being gravid are the same, whether the eggs are fertile or infertile. The first thing you need to do if you suspect your dragon is gravid is to increase her calcium supplementation. Instead of giving the calcium 3 days a week, you should give it 5 days a week. The extra calcium is needed for egg production."}, {"url": "http://rioreptiles.com/eggs.html", "passage_text": "How to incubate fertile bearded dragon eggs. Dig all the eggs out of the lay bin making sure you get them all, be thorough! Don't worry, it's OKAY to turn them, they haven't started developing yet! However, do not turn them after 1 week and do not handle before 4 or 5 weeks. Do not delay your female from laying for any reason, she is counting on you to provide her with the necessary tools to do her job quickly and comfortably! First time egg layers may take up to a week to lay their first clutch."}, {"url": "http://www.everythingreptile.org/signs-of-a-gravid-female-bearded-dragon-and-what-to-do-for-her.html", "passage_text": "At the first sign of your dragon being gravid,,which will be weight gain that cannot be contributed to increased eating habits, or for younger dragons, due to normal growth. Female bearded dragons generally will lay their first clutch around a year old. They can lay infertile eggs as young as 10 months old. Not all bearded dragons lay eggs, and there is no way to tell which ones will and which one won't. The first thing you need to do if you suspect your dragon is gravid is to increase her calcium supplementation. Instead of giving the calcium 3 days a week, you should give it 5 days a week. The extra calcium is needed for egg production."}, {"url": "http://www.answers.com/Q/When_does_a_bearded_dragon_lay_eggs", "passage_text": "Confidence votes 274. The female bearded dragon lays her eggs anywhere from 4 to 6 weeks after a successful breeding. A female will likely lay eggs whether she has been bred or not. They generally lay their eggs sometime during he spring. Last year my girls laid their eggs late April"}, {"url": "http://rioreptiles.com/eggs.html", "passage_text": "If she was around a male dragon, they are most likely fertile and you have to decide if you want to hatch them or not. First, you must provide a place for her to dig and lay her eggs. Bearded dragons like to tunnell and need at least 5 to 6 inches of sand to dig in. Do not delay your female from laying for any reason, she is counting on you to provide her with the necessary tools to do her job quickly and comfortably! First time egg layers may take up to a week to lay their first clutch."}, {"url": "http://www.lllreptile.com/info/library/care-and-husbandry-articles/-/reproductive-biology-of-bearded-dragons/", "passage_text": "Most bearded dragons lay their eggs in the afternoon or early evening, and if possible, place the female into the lay box during this time of day. Regardless of when or for how long the female remains in the box, every effort should be made to maintain the chamber around 80 degrees. Typically, bearded dragon eggs will take between 50 and 80 days to hatch, with 2 months being average. 24 to 48 hours prior to hatching, the eggs may begin to deflate. This should not be confused with a symptom of insufficient humidity. Rather, this is a signal to the keeper that hatching is imminent."}, {"url": "http://www.lllreptile.com/info/library/care-and-husbandry-articles/-/reproductive-biology-of-bearded-dragons/", "passage_text": "When a female bearded dragon is ready to lay her eggs, she will begin searching for a suitable spot to deposit them. She may be observed digging at the corners of the enclosure and seem hyperactive. At this point, a suitable place for her to deposit her eggs should be provided, and the water dish removed from the cage. Typically, bearded dragon eggs will take between 50 and 80 days to hatch, with 2 months being average. 24 to 48 hours prior to hatching, the eggs may begin to deflate. This should not be confused with a symptom of insufficient humidity. Rather, this is a signal to the keeper that hatching is imminent."}]