[{"url": "http://www.huffingtonpost.com/2012/10/17/lennon-and-maisy-stella-nashville_n_1975186.html", "passage_text": "Nashville stars Lennon and Maisy Stella | ABC. If you aren't yet smitten with Lennon and Maisy Stella -- the real-life sisters who play Connie Britton's daughters on ABC's  Nashville  (Wednesdays at 10 p.m. ET) -- you're about to be."}, {"url": "https://www.yahoo.com/tv/bp/nashville-casts-13-6-old-youtube-viral-singing-204411890.html", "passage_text": "Fall TV. Another viral video success story (kind of)! The talented, adorable and innovative singing sisters Lennon, 13, and Maisy Stella, 6 (awesome names, by the way), known for their cover of Robyn's Call Your Girlfriend, are guest-starring in this season's most anticipated new show, ABC's Nashville.. Nashville producer R.J. Cutler told The Hollywood Reporter, Even though the parts of Rayna and Teddy's (Eric Close) daughters had been written for a 6- and an 8-year-old, we decided on the spot to change the roles to fit Maisy and Lennon's ages. Listening to them sing literally brought tears to our eyes."}, {"url": "http://www.hollywoodreporter.com/live-feed/nashville-lennon-maisy-stella-connie-britton-369879", "passage_text": "Connie Britton won't be the only musical talent in the Jaymes family on ABC's Nashville. ABC's upcoming first-year drama has enlisted sisters Lennon and Maisy Stella to recur as Maddie and Daphne Jaymes, the musically gifted daughters to Britton's fading country star Rayna Jaymes."}, {"url": "http://abc.go.com/shows/nashville/cast/maddie-conrad", "passage_text": "Actor Biography. Continue Reading. At just 14 years old, rising star Lennon Stella, along with her real-life sister, 9-year-old Maisy, play the daughters of Rayna Jaymes on “Nashville.” In Season 1, Maddie learned that her biological dad was not Teddy Conrad but family friend Deacon Claybourne. "}, {"url": "http://www.youtube.com/watch?v=n-lLlEtoAS8", "passage_text": "This feature is not available right now. Please try again later. Lennon and Maisy Stella-real-life sisters who play Rayna James' daughters on Nashville on ABC perform Ho Hey by The Lumineers live at the Grand Ole Opry in Nashville, TN. © ℗ 2013 Grand Ole Opry, LLC. Subscribe: http://bit.ly/SubscribeOpry. Watch more Lennon & Maisy!: http://bit.ly/LennonMaisy. "}, {"url": "http://www.huffingtonpost.com/2013/07/08/nashville-lennon-and-maisy-chris-carmack-season-2-cast_n_3562300.html", "passage_text": "| ABC. Nashville has added Lennon and Maisy Stella and Chris Carmack as new series regulars for Season 2. A source at ABC confirmed The Hollywood Reporter's original story about the actors' promotions. Lennon and Maisy Stella play Maddie and Daphne Conrad, Rayna Jaymes' (Connie Britton) daughters. The Season 1 finale of Nashville, Maddie (Lennon) found out her father is Deacon Claybourne (Charles Esten) and not Teddy Conrad (Eric Close)."}, {"url": "http://www.visitmusiccity.com/nashvilleabc/nashvilleabc_trivia", "passage_text": "The Actors. 1  Actor Eric Close, who plays Nashville Mayor Teddy Conrad, will be the Grand Marshal of The 61st Annual Nashville Christmas Parade on December 6, 2013. 2  Rayna's daughters, Maddie and Daphne, are real-life sisters Lennon and Maisy Stella. 1 Rayna's manager, Bucky Dawes, is played by Nashvillian David Alford. 2  Alford has been in the Nashville theatre scene for many years, having co-founded Nashville's Mockingbird Theatre before leading the Nashville Repertory Theatre as Executive Artistic Director for a time."}, {"url": "http://www.visitmusiccity.com/nashvilleabc/nashvilleabc_trivia", "passage_text": "1 Actor Eric Close, who plays Nashville Mayor Teddy Conrad, will be the Grand Marshal of The 61st Annual Nashville Christmas Parade on December 6, 2013. 2  Rayna's daughters, Maddie and Daphne, are real-life sisters Lennon and Maisy Stella. 1 Rayna's manager, Bucky Dawes, is played by Nashvillian David Alford. 2  Alford has been in the Nashville theatre scene for many years, having co-founded Nashville's Mockingbird Theatre before leading the Nashville Repertory Theatre as Executive Artistic Director for a time."}, {"url": "http://www.hollywoodreporter.com/live-feed/nashville-lennon-maisy-stella-connie-britton-369879", "passage_text": "Nashville's Lennon and Maisy Stella ABC/KATHERINE BOMBOY-THORNTON. YouTube phenoms Lennon and Maisy will recur on the ABC country music drama as the daughters to Connie Britton's Rayna Jaymes. ABC's upcoming first-year drama has enlisted sisters Lennon and Maisy Stella to recur as Maddie and Daphne Jaymes, the musically gifted daughters to Britton's fading country star"}, {"url": "http://www.visitmusiccity.com/nashvilleabc/nashvilleabc_trivia", "passage_text": "1 Rayna's daughters, Maddie and Daphne, are real-life sisters Lennon and Maisy Stella. 2  The Stella sisters live just outside of Nashville with their parents, a country-folk duo known as The Stellas. 3  Sam Palladio, the actor that plays Gunnar, is British. 1 Rayna's manager, Bucky Dawes, is played by Nashvillian David Alford. 2  Alford has been in the Nashville theatre scene for many years, having co-founded Nashville's Mockingbird Theatre before leading the Nashville Repertory Theatre as Executive Artistic Director for a time."}]