[{"url": "http://theyoungandtherestless.wikia.com/wiki/Adam_Newman", "passage_text": "Victor Adam Newman Jr. is a fictional character on The Young and the Restless, currently portrayed by Justin Hartley as of November 2014. The role has previously been played by Chris Engen from 2008-2009 and most notably by Michael Muhney from 2009-2014. Adam returned to his suite at the GCAC where he told Skye that he took the $100,000 from the hedge fund and gave it to Justin. He then informed his wife he was divorcing her. Skye told Adam that unless he was prepared to walk away from all their money he better stay where he was."}, {"url": "http://www.inquisitr.com/1468826/michael-muhney-his-yr-return-as-adam-newman-considered-but-only-one-actress-supported-it/", "passage_text": "She is very isolated from the rest of the cast because she firmly stands in Michael’s corner.”. Soap opera actor, Michael Muhney, almost returned to his role as Adam Newman on The Young and the Restless, but not enough people rallied around him at the studio for a comeback. According to Radaronline, producers and executives met with Muhney to discuss rehiring him for the role he famously played on the hit CBS soap. He was fired last December for allegedly groping a co-star’s breasts and sexually harassing her."}, {"url": "https://en.wikipedia.org/wiki/Adam_Wilson_(The_Young_and_the_Restless)", "passage_text": "Adam was attacked by Patty Williams (Stacy Haiduk), and his impaired vision returned. Sharon looked after Adam and even returned him to his mother's farm in Kansas where they reconnected. Adam proposed to her and they returned to Genoa City. Adam was first portrayed in 1995 by infant actors, including twins Celeste and Coryn Williams, followed by Danielle and Sabrina Helper and then Spencer Klass. Hayden Tank played the role from December 1996 to August 1997, and returned for a guest appearance on June 26, 2002."}, {"url": "http://theyoungandtherestless.wikia.com/wiki/Adam_Newman", "passage_text": "Sage and Adam return to Genoa City where they talk about Constance and Adam's plan to get revenge on Victor. Adam goes to the Abbott mansion to talk to Jack. Jack is determined to turn Adam in, so Adam shows Jack a scar on his chest and claims Billy shot him. Adam returned to his suite at the GCAC where he told Skye that he took the $100,000 from the hedge fund and gave it to Justin. He then informed his wife he was divorcing her. Skye told Adam that unless he was prepared to walk away from all their money he better stay where he was."}, {"url": "https://en.wikipedia.org/wiki/Adam_Wilson_(The_Young_and_the_Restless)", "passage_text": "Victor Adam Newman, Jr. (previously Wilson) is a fictional character from the American CBS soap opera The Young and the Restless. Adam was created by William J. Bell as the son of Victor Newman (Eric Braeden) and Hope Wilson (Signy Coleman), and was born onscreen during the episode that aired on April 24, 1995. Adam left town two years after his birth and was raised in Kansas by his mother, and grew up without knowing that Victor was his father. Adam was first portrayed in 1995 by infant actors, including twins Celeste and Coryn Williams, followed by Danielle and Sabrina Helper and then Spencer Klass. Hayden Tank played the role from December 1996 to August 1997, and returned for a guest appearance on June 26, 2002."}, {"url": "http://forever.wikia.com/wiki/Adam", "passage_text": ". Adam  is a character who shares the same curse as the medical examiner Henry Morgan, only whereas Henry has lived for over 2 centuries, Adam has existed for over 2000 years. He has taken special interest in following Henry, and obtaining everything there is to know about him. Before the man died Adam appeared, and threatened Henry before he killed himself to get away. Later, Adam met with Henry and after Henry returned the puggio to him, he pulled the flintlock that had killed Henry and shot Henry in the chest. Before dying, Henry injected an air bubble into Adam's brain stem. Adam is sent to the hospital"}, {"url": "http://theyoungandtherestless.wikia.com/wiki/Connor_Newman", "passage_text": "Avery, Adam and Chelsea are able to track Dylan down to the cabin Avery and Dylan shared together. Avery manages to talk Dylan down, who is experiencing a PTSD episode, and Connor is returned to his parents. Adam and Chelsea take Connor to be checked out by a doctor. Currently both Dylan and Adam know that Connor is indeed Adam's son. He was born on August 12, 2013 and delivered by Dylan on the same day that Dylan and Chelsea were married. He was named after Dylan's father, Terrence Connor McAvoy."}, {"url": "http://theyoungandtherestless.wikia.com/wiki/Adam_Newman", "passage_text": "Off the Farm Edit. Soon accepting Victor's offer to return to Genoa City with him and work at Newman Enterprises, Victor Jr. – now going by Adam Wilson – insists that it is merely a career decision and keeps his distance from Victor. Adam returned to his suite at the GCAC where he told Skye that he took the $100,000 from the hedge fund and gave it to Justin. He then informed his wife he was divorcing her. Skye told Adam that unless he was prepared to walk away from all their money he better stay where he was."}]