[{"url": "https://www.java.com/en/download/faq/whatis_java.xml", "passage_text": "What will I get when I download Java software? The Java Runtime Environment (JRE) is what you get when you download Java software. The JRE consists of the Java Virtual Machine (JVM), Java platform core classes, and supporting Java platform libraries. The JRE is the runtime portion of Java software, which is all you need to run it in your Web browser. What is Java Plug-in software? The Java Plug-in software is a component of the Java Runtime Environment (JRE). The JRE allows applets written in the Java programming language to run inside various browsers."}, {"url": "http://www.differencebetween.com/difference-between-android-and-vs-java/", "passage_text": "Java is a programming language, while Android is a mobile phone platform. Android development is java-based (most of the times), because a large portion of Java libraries is supported in Android. However, there are key differences. Java. Java is one of the most widely used object oriented (and class-based) programming languages used for software development to web development, today. It is a general purpose and concurrent programming language."}, {"url": "http://code.tutsplus.com/tutorials/learn-java-for-android-development-introduction-to-java--mobile-2604", "passage_text": "This post is part of a series called Learn Java for Android Development. Learn Java for Android Development: Java Syntax. In this tutorial series, you’ll become familiar with Java, the programming language used to develop Android applications. Android applications are developed using the Java language. As of now, that’s really your only option for native applications. Java is a very popular programming language developed by Sun Microsystems (now owned by Oracle)."}, {"url": "https://www.java.com/en/download/faq/java_mobile.xml", "passage_text": "See your device manufacturer's website to determine if Java is available for your specific device. Windows Surface RT: Surface tablets using the Windows RT operating system do not support the Java plug-in. Java being a desktop program cannot be installed as it is not available in the Windows Store."}, {"url": "http://www.differencebetween.com/difference-between-android-and-vs-java/", "passage_text": "Android vs Java. Java is one of the most popular object oriented programming languages in the world. Java is heavily used for software and web development. Recently, Java has become a popular language for mobile-based applications as well. Android is a mobile phone based platform developed by Google. Java. Java is one of the most widely used object oriented (and class-based) programming languages used for software development to web development, today. It is a general purpose and concurrent programming language."}, {"url": "https://www.java.com/en/download/faq/whatis_java.xml", "passage_text": "Java is a programming language and computing platform first released by Sun Microsystems in 1995. There are lots of applications and websites that will not work unless you have Java installed, and more are created every day. Java is fast, secure, and reliable. The JRE is the runtime portion of Java software, which is all you need to run it in your Web browser. What is Java Plug-in software? The Java Plug-in software is a component of the Java Runtime Environment (JRE). The JRE allows applets written in the Java programming language to run inside various browsers."}, {"url": "https://www.java.com/en/download/faq/java_mobile.xml", "passage_text": "Java for mobile devices relies on the Java Platform, Micro Edition (Java ME), which provides a robust, flexible environment for applications running on mobile and other embedded devices: mobile phones, personal digital assistants (PDAs), TV set-top boxes, and printers. Windows Surface RT: Surface tablets using the Windows RT operating system do not support the Java plug-in. Java being a desktop program cannot be installed as it is not available in the Windows Store."}, {"url": "https://en.wikipedia.org/wiki/Java_Platform,_Micro_Edition", "passage_text": "Java Platform, Micro Edition. From Wikipedia, the free encyclopedia. Java Platform, Micro Edition, or Java ME, is a Java platform designed for embedded systems (mobile devices are one kind of such systems). Target devices range from industrial controls to mobile phones (especially feature phones) and set-top boxes. Java ME was formerly known as Java 2 Platform, Micro Edition (J2ME). There are more than 2.1 billion Java ME enabled mobile phones and PDAs. It is popular in sub $200 devices such as Nokia's Series 40. It was also used on the Bada operating system and on Symbian OS along with native software."}, {"url": "http://smallbusiness.chron.com/java-important-30466.html", "passage_text": "Use. Java is used to build applications and platforms for a number of devices, including computers, laptops, gaming consoles, Blu-ray players, car navigation systems, medical monitoring devices, parking meters, lottery terminals and smartphones. Applets. Java is also used to create miniature, dynamic programs that run alongside or are embedded within Web pages. These programs are called applets and can be used to display maps, weather, games or other interactive widgets or tools on a Web page."}, {"url": "https://www.java.com/en/download/faq/java_mobile.xml", "passage_text": "Java capability for mobile devices is generally integrated by the device manufacturers. It is NOT available for download or installation by consumers. You need to check with your device manufacturer about availability of this technology in your device. Windows Surface RT: Surface tablets using the Windows RT operating system do not support the Java plug-in. Java being a desktop program cannot be installed as it is not available in the Windows Store."}]