[{"url": "http://www.askaboutireland.ie/enfo/sustainable-living/farming-in-ireland-overvi/tillage-farming/", "passage_text": "Growth of crops. Over 300,000 hectares of the best land in Ireland is engaged in tillage farming, or the annual production of crops for harvest. Cereal crops are the main output, led by barley, then wheat and then oats. Cereals Ireland is a net importer of cereal grains, but there is a very specialised and efficient group of growers producing grain in Ireland for the home market."}, {"url": "http://utcrops.com/", "passage_text": "Welcome to UTcrops.com. This website is maintained by The University of Tennessee and is intended to provide high quality and current information about the management of major field crops grown in Tennessee."}, {"url": "http://www.answers.com/Q/Does_Ireland_grow_crops", "passage_text": "Ireland has a wide range of crops, as agriculture is a major part of Ireland's economy. Various grains, like wheat and barley, are common. Many vegetables like potatoes, sprouts, cabbages, cauliflowers, carrots and turnips, amongst others, are very common. A lot of fruits like apples, plums, pears and various berries are grown in Ireland. Sugar beet was common, but not so much now."}, {"url": "http://www.agriculture.gov.ie/farmingsectors/crops/seedcertification/seedcertificationscheme/", "passage_text": "The Department of Agriculture, Fisheries and Food (DAFF) is the certifying authority for Seed Certification in Ireland. The scheme covers seed production and marketing for the main agricultural crops. Crop species include fodder plants, cereals, beet, potatoes, vegetables and oil and fibre plants. Seed production rules and guidelines are set down in detailed operational manuals."}, {"url": "http://agron-www.agron.iastate.edu/Courses/agron212/Readings/Corn_history.htm", "passage_text": "Between 90 and 95 percent of the crop is harvested for grain; the remaining 5 to 10 percent is grown for silage. Of the corn fed to livestock in 1960, about 40 percent went to hogs, 20 percent to poultry, 30 percent to cattle on feed and milk cows, and 10 percent to other types of livestock."}, {"url": "http://www.askaboutireland.ie/enfo/sustainable-living/farming-in-ireland-overvi/tillage-farming/", "passage_text": "Barley. There are cereals grown in every county in Ireland, although the area in 2010 ranged from just 29 hectares in Sligo to 41,569 hectares in Wexford. This is mainly explained by differences in the suitability of the land and, to a lesser extent, more hours of sunshine in the south east."}]