[{"url": "http://www.ehow.co.uk/way_5479491_long-stay-steam-room-sauna.html", "passage_text": "Because of the health risks associated with a long sauna stay, sauna manufacturers such as Finnleo and Saunafin recommend that you limit your time in the sauna to 15 to 20 minutes. While in the steam room, sit where you feel most comfortable."}, {"url": "http://www.ehow.com/way_5479491_long-stay-steam-room-sauna.html", "passage_text": "For some people, 15 minutes may be too long for a sauna stay. If you begin to feel overly tired, nauseous, dizzy or uncomfortable in any way, you should leave the steam room immediately. Sit in an area with fresh air and drink plenty of fluids to rehydrate and bring your body back to a normal temperature."}, {"url": "http://www.livestrong.com/article/343158-recommended-time-in-steam-room/", "passage_text": "Steam Time. How long you stay in the steam room is something of a personal matter. Listen to your body. If at any point you feel uncomfortable, you should leave the steam room immediately. The very first time, you should limit your time to a few minutes. Leave the steam room, cool down and monitor how you feel."}, {"url": "http://www.youtube.com/watch?v=eu6h5YbwPjc", "passage_text": "How long a person should stay in a steam room will depend on the person and how long it feels comfortable to sit in the steam. Expect to stay in a steam room for about 10 minutes with insight from a nutrition consultant and clinical herbalist in this free video on steam rooms."}, {"url": "http://www.ehow.com/way_5479491_long-stay-steam-room-sauna.html", "passage_text": "Time Limit. Because of the health risks associated with a long sauna stay, sauna manufacturers such as Finnleo and Saunafin recommend that you limit your time in the sauna to 15 to 20 minutes. While in the steam room, sit where you feel most comfortable."}, {"url": "http://www.ehow.co.uk/way_5479491_long-stay-steam-room-sauna.html", "passage_text": "After 15 to 20 minutes in the sauna, you should leave the sauna and allow your body to cool down. Take in some fresh air, dry the body off and drink at least eight ounces of water to make up for the amount of sweat you produced in the steam room. Stay out of the sauna for at least 20 minutes."}, {"url": "http://www.ehow.com/video_4822804_long-should-stay-steam-room_.html", "passage_text": "Cancel. How long a person should stay in a steam room will depend on the person and how long it feels comfortable to sit in the steam. Expect to stay in a steam room for about 10 minutes with insight from a nutrition consultant and clinical herbalist in this free video on steam rooms."}, {"url": "http://www.ehow.com/way_5479491_long-stay-steam-room-sauna.html", "passage_text": "After 15 to 20 minutes in the sauna, you should leave the sauna and allow your body to cool down. Take in some fresh air, dry the body off and drink at least eight ounces of water to make up for the amount of sweat you produced in the steam room. Stay out of the sauna for at least 20 minutes."}]