[{"url": "http://www.girlshealth.gov/body/period/index.html", "passage_text": "Periods usually last between three and five days. It is normal to have periods that are shorter or longer, up to seven days. It is also normal if your periods are not the same number of days each month, especially in the first years. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080728070830AARorNj", "passage_text": "A normal period lasts from 3-7 days normal variations been between 3-5 days but keep your pad on until the 7 day period is over believe me ive had times when i thought nar ive finished then gush another pair of pants ruined i learned to keep my pad on for the full 7 days and that kept embarresing moments out the way!. "}, {"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/menstruation.html", "passage_text": "It also prepares your body for pregnancy each month. A cycle is counted from the first day of 1 period to the first day of the next period. The average menstrual cycle is 28 days long. Cycles can range anywhere from 21 to 35 days in adults and from 21 to 45 days in young teens. The rise and fall of levels of hormones during the month control the menstrual cycle. 1 Your period suddenly stops for more than 90 days. 2  Your periods become very irregular after having had regular, monthly cycles. 3  Your period occurs more often than every 21 days or less often than every 35 days. 4  You are bleeding for more than 7 days."}, {"url": "http://teens.webmd.com/girls/all-about-menstruation", "passage_text": "During a period, there are usually 2-3 days of relatively heavy bleeding followed by 2-4 days of lighter flow. The fluid during a menstrual period is a mixture of uterine lining tissue and blood. The total mo nthly menstrual loss varies from about 4 to 12 teaspoons. The first menstrual period is called  menarche .. The menstrual cycle is about four weeks long, starting on the first day of bleeding and ending when the next period begins. However, it can vary greatly when a girl first starts her period."}, {"url": "http://teens.webmd.com/girls/all-about-menstruation?page=2", "passage_text": "Don't worry if your early periods have longer cycles or don't follow a schedule. This irregularity is normal for at least the first 2 years. Your periods should become more regular within two years after you start menstruating. Some teens have a 28-day cycle; some have a 24-day cycle; others have a 30- to 34-day cycle. All of these are normal. For young teens, cycles can range from 21 to 45 days."}, {"url": "http://answers.webmd.com/answers/5001542/how-long-do-you-ovulate-after-your-period", "passage_text": "39 Followers. A. By convention, the first day of your period is the first day of your menstrual cycle. Around day 7 several eggs start to develop in your ovaries. However, only one egg will predominate and be release when you ovulate. For the average menstrual cycle, which is 28-32 days ovulation occurs on day 14"}, {"url": "http://www.summitmedicalgroup.com/library/pediatric_health/hhg_period_late_or_missed/", "passage_text": "A menstrual cycle is the time from the day a menstrual period starts to the time the next period starts. The average menstrual cycle is 28 days long. However, a normal cycle can be shorter or longer than this. It may be anywhere from 21 to 35 days long. Most periods last 3 to 5 days, but anywhere from 2 to 7 days is normal. Menstrual cycles may happen around the same date every month or they may be irregular."}, {"url": "http://www.acog.org/Patients/FAQs/Your-First-Period-Especially-for-Teens", "passage_text": "A menstrual cycle is counted from the first day of bleeding in one month to the first day of bleeding in the next month. The average menstrual cycle is about 28 days, but cycles that are 21–45 days also are normal. It may take 6 years or more after your period starts for your cycle to get regular. If you do this every month, you may notice a pattern. It may become easier to tell when you will get your next period. The discharge of blood and tissue from the lining of your uterus is your menstrual period (also called your period). Most girls start their periods between the ages of 12 years and 14 years, but some start earlier or later. When you first start having your period, it may last only a few days. Your first few periods may be very light. You may only see a few spots of reddish brown blood. Anywhere from 2 to 7 days is normal"}]