[{"url": "http://umm.edu/health/medical/ency/articles/methemoglobinemia", "passage_text": "Definition. Methemoglobinemia is a blood disorder in which an abnormal amount of methemoglobin -- a form of hemoglobin -- is produced. Hemoglobin is the protein in red blood cells that carries and distributes oxygen to the body. "}, {"url": "http://ghr.nlm.nih.gov/condition/methemoglobinemia-beta-globin-type", "passage_text": "Methemoglobinemia, beta-globin type is a condition that affects the function of red blood cells. Specifically, it alters a molecule called hemoglobin within these cells. Hemoglobin that contains ferric iron is known as methemoglobin. HBB gene mutations that cause methemoglobinemia, beta-globin type change the structure of beta-globin and promote the heme iron to change from ferrous to ferric."}, {"url": "http://www.nytimes.com/health/guides/disease/methemoglobinemia/overview.html", "passage_text": "Methemoglobinemia is a blood disorder in which an abnormal amount of methemoglobin -- a form of hemoglobin -- is produced. Hemoglobin is the molecule in red blood cells that distributes oxygen to the body. Methemoglobin cannot release oxygen. Methemoglobinemia may be passed down through families (inherited or congenital). Or, it may be caused by exposure to certain drugs, chemicals, or foods (acquired). There are two forms of inherited methemoglobinemia. The first form is passed on by both parents."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=15735", "passage_text": "Methemoglobinemia: The presence in the blood of methemoglobin, a form of hemoglobin that is useless for carrying oxygen and delivering it to tissues throughout the human body. "}, {"url": "http://www.medicinenet.com/methemoglobinemia/article.htm", "passage_text": "Methemoglobinemia is a condition in which more than 1% of the hemoglobin in red blood cells takes the form of methemoglobin. Methemoglobulin is an abnormal form of hemoglobin (the molecule responsible for carrying oxygen in the blood cells) that is unable to bind to oxygen. Mutations in the HBB gene cause methemoglobinemia, beta-globin type. Hemoglobin consists of four protein subunits and four iron-containing molecules called heme. Heme molecules are necessary for red blood cells to pick up oxygen in the lungs and release oxygen to other cells in the body."}, {"url": "http://emedicine.medscape.com/article/204178-overview", "passage_text": "Practice Essentials. Methemoglobinemia (congenital or acquired) occurs when red blood cells (RBCs) contain methemoglobin at levels higher than 1%. Methemoglobin results from the presence of iron in the ferric form instead of the usual ferrous form. Methemoglobinemia occurs when red blood cells (RBCs) contain methemoglobin at levels higher than 1%. This may be from congenital causes, increased synthesis, or decreased clearance. Increased levels may also result from exposure to toxins that acutely affect redox reactions, increasing methemoglobin levels."}, {"url": "http://ghr.nlm.nih.gov/condition/autosomal-recessive-congenital-methemoglobinemia", "passage_text": "Autosomal recessive congenital methemoglobinemia is an inherited condition that mainly affects the function of red blood cells. Specifically, it alters a molecule within these cells called hemoglobin. Hemoglobin carries oxygen to cells and tissues throughout the body. Mutations that cause autosomal recessive congenital methemoglobinemia type II usually result in a complete loss of enzyme activity. Cells cannot compensate for a complete loss of this enzyme, which results in a 10 to 70 percent increase in methemoglobin within"}, {"url": "https://en.wikipedia.org/wiki/Methemoglobinemia", "passage_text": "Unsourced material may be challenged and removed. (September 2007). Methemoglobinemia (or methaemoglobinaemia) is a disorder characterized by the presence of a higher than normal level of methemoglobin (metHb, i.e., ferric [Fe 3+ ] rather than ferrous [Fe 2+ ] haemoglobin) in the blood. Signs and symptoms of methemoglobinemia (methemoglobin level above 1%) include shortness of breath, cyanosis, mental status changes (~50%), headache, fatigue, exercise intolerance, dizziness and loss of consciousness."}, {"url": "http://www.medicinenet.com/methemoglobinemia/article.htm", "passage_text": "In most individuals with beta-globin type methemoglobinemia, the only symptom is cyanosis, which is a bluish appearance of the skin, mucous membranes, or the area underneath the fingernails due to a lack of oxygen in the blood. Symptoms may appear as early as age 3 to 4 months. Mutations in the HBB gene cause methemoglobinemia, beta-globin type. Hemoglobin consists of four protein subunits and four iron-containing molecules called heme. Heme molecules are necessary for red blood cells to pick up oxygen in the lungs and release oxygen to other cells in the body."}, {"url": "http://www.wisegeekhealth.com/what-is-methemoglobinemia.htm", "passage_text": "Methemoglobinemia or Met h-b is a rare blood disorder that may be caused by an inherited or congenital condition, exposure to toxins, especially nitrates, or dehydration, particularly in infants. In this condition, methemoglobin, a form of hemoglobin is present in too great a quantity. "}]