[{"url": "http://passel.unl.edu/pages/informationmodule.php?idinformationmodule=1124303183&topicorder=4&maxto=7", "passage_text": "CaCO3 + H2CO3 → Ca2+ + 2HCO3- (calcite + carbonic acid → calcium + bicarbonate). Hydrolysis is a chemical reaction caused by water. Water changes the chemical composition and size of minerals in rock, making them less resistant to weathering. Click on the video clip below to see hydrolysis of a relatively weathering resistant mineral, feldspar."}, {"url": "http://medical-dictionary.thefreedictionary.com/Hydrolysis+reaction", "passage_text": "A chemical process whereby a compound is cleaved into two or more simpler compounds with the uptake of the H and OH parts of a water molecule on either side of the chemical bond cleaved; hydrolysis is effected by the action of acids, alkalies, or enzymes. Compare: hydration. hydrolysis. the cleavage of a compound by the addition of water, the hydroxyl group being incorporated in one fragment and the hydrogen atom in the other. adj., adj hydrolyt´ic."}, {"url": "http://study.com/academy/lesson/decomposition-reaction-definition-examples-quiz.html", "passage_text": "Decomposition Reaction Defined. A chemical reaction is a process by which the atoms of one or more substances are rearranged to form different substances. There are many types of chemical reactions. These reactions are often classified by what they form or what happens during the course of the reaction. A decomposition reaction is a type of chemical reaction in which a single compound breaks down into two or more elements or new compounds. Let's review. Decomposition reactions are a type of chemical reaction that involves breaking down a compound into smaller compounds or individual elements. These reactions often involve an input of energy in the form of heat, light, or electricity to break down the compounds."}, {"url": "http://www.avogadro.co.uk/organic/hydrolysis/hydrolysis.htm", "passage_text": "Hydrolysis. In the overall process of hydrolysis, a bond in an organic molecule is broken, and an O-H bond in a water molecule also breaks. Then, from the water molecule, an O-H group adds to one part from the organic molecule, and an H atom to the other. Hydrolysis is therefore the reaction of an organic compound with water. However, hydrolysis is often catalysed (in acidic or alkaline solution), and this is discussed later."}, {"url": "http://medical-dictionary.thefreedictionary.com/Hydrolysis+reaction", "passage_text": "hydrolysis (hīdrol´isis) , n 1. a reaction between the ions of salt and those of water to form an acid and a base, one or both of which is only slightly dissociated. A process whereby a large molecule is split by the addition of water. The end products divide the water, the hydroxyl group being attached to one and the hydrogen ion to the other. hydrolysis. the cleavage of a compound by the addition of water, the hydroxyl group being incorporated in one fragment and the hydrogen atom in the other. adj., adj hydrolyt´ic."}, {"url": "http://www.thefreedictionary.com/Hydrolysis+reaction", "passage_text": "Noun. 1. hydrolysis-a chemical reaction in which water reacts with a compound to produce other compounds; involves the splitting of a bond and the addition of the hydrogen cation and the hydroxide anion from the water. The reaction of water with another chemical compound to form two or more products, involving ionization of the water molecule and usually splitting the other compound. Examples include the catalytic conversion of starch to glucose, saponification, and the formation of acids or bases from dissolved ions."}, {"url": "https://en.wikipedia.org/wiki/Hydrolyzed", "passage_text": "Types [edit]. Usually hydrolysis is a chemical process in which a molecule of water is added to a substance. Sometimes this addition causes both substance and water molecule to split into two parts. In such reactions, one fragment of the target molecule (or parent molecule) gains a hydrogen ion. It is the hydrolysis of a triglyceride (fat) with an aqueous base such as sodium hydroxide (NaOH). During the process, glycerol is formed, and the fatty acids react with the base, converting them to salts."}]