[{"url": "https://www.facebook.com/templeonline", "passage_text": "Temple Baptist Church. September 26 at 9:50am ·. Sadly the weather has put a damper on our plans for the picnic at Creekside, but this will not stop the Celebration. Come out to the Celebration Service at 10am then join us for a picnic in the Church."}, {"url": "http://www.praisetemple.com/", "passage_text": "Welcome to Praise Temple. A place where the power of God is changing a generation! At Praise Temple we’re committed to building people of purpose power and praise with a heart for service and a foundation built on the Mighty Word of God. We encourage you to experience Praise Temple this Sunday and join us as we take the cities for Jesus, one life at a time! Online Giving. In the News."}, {"url": "http://templebiblechurch.org/", "passage_text": "Tweets by @templebible. Temple Bible Church 3205 Oakview Drive | Temple, Texas 76502 | PH: 254-778-3233 Service times: 8:15, 9:30, 11:00am. Temple Bible Church."}, {"url": "http://www.templebiblechurch.org/staff", "passage_text": "Temple Bible Church 3205 Oakview Drive | Temple, Texas 76502 | PH: 254-778-3233 Service times: 8:15, 9:30, 11:00am. Temple Bible Church. 3205 Oakview Drive | Temple, Texas 76502 | PH: 254-778-3233 Service times: 8:15, 9:30, 11:00am. powered by ChurchSquare."}, {"url": "http://www.templeabq.org/", "passage_text": "Join us Sunday mornings for a free latte or espresso, 8:00am to 10:00am. Worship exalts the wonders and worth of our God and Savior! Here at Temple Baptist Church our services are alive with dynamic music, as everyone is invited to unite in wholehearted worship."}, {"url": "http://www.templeabq.org/", "passage_text": "Temple Baptist Church is a Christian church. We follow Jesus Christ, we teach from the Bible, and we worship God as the creator and ruler of the universe. Through our relationship with Jesus Christ, we are forgiven of our sins, transformed in our lives, restored in our relationship with God who loves us dearly."}]