[{"url": "http://www.healthline.com/human-body-maps/renal-artery", "passage_text": "Renal artery. There are two blood vessels leading off from the abdominal aorta that go to the kidneys. The renal artery is one of these two blood vessels."}, {"url": "http://www.anatomyatlases.org/AnatomicVariants/Cardiovascular/Text/Arteries/Renal.shtml", "passage_text": "Frequently, the renal arteries provide two to five slender branches to the suprarenal gland, whereas the inferior suprarenal arteries coming from the aorta or the renal arteries often supply one to four branches (capsular branches) to the superior pole of the kidney and its fat body."}, {"url": "http://www.anatomyatlases.org/AnatomicVariants/Cardiovascular/Text/Arteries/Renal.shtml", "passage_text": "The right and left renal arteries may arise from the aorta by a common stem. They may arise from the aorta at a lower point than usual, in which case the kidneys lie below their usual position. There may be several renal arteries on each side, or the renal artery may divide, close to its origin, into several branches."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/001272.htm", "passage_text": "The kidneys need a good blood supply. The main artery to the kidney is called the renal artery. Reduced blood flow through the renal artery can hurt kidney function. A complete blockage of blood flow to the kidney can often result in permanent kidney failure."}, {"url": "http://www.answers.com/Q/What_does_the_renal_artery_do", "passage_text": "Renal artery occlusion is a blockage of the major arteries that supply blood to the kidneys caused by thrombosis or embolism."}, {"url": "http://www.webmd.com/hypertension-high-blood-pressure/guide/renal-artery-stenosis-symptoms-treatments", "passage_text": "Renal artery stenosis is a narrowing of arteries that carry blood to one or both of the kidneys. Most often seen in older people with atherosclerosis (hardening of the arteries), renal artery stenosis can worsen over time and often leads to hypertension (high blood pressure) and kidney damage."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/001272.htm", "passage_text": "Causes. The kidneys need a good blood supply. The main artery to the kidney is called the renal artery. Reduced blood flow through the renal artery can hurt kidney function. A complete blockage of blood flow to the kidney can often result in permanent kidney failure."}]