[{"url": "http://membean.com/wrotds/ad-towards", "passage_text": "Prefixes are key morphemes in English vocabulary that begin words. The English prefix ad-means “to, towards.” Examples using this prefix include ad mit and ad just. I think that that’s enough examples thrown “towards” you of the prefix ad- ; I wouldn’t want you to become an ad dict of just that prefix! 1  advertise: turn ‘towards’. 2  adhere: stick ‘to’. 3  adjust: tilt ‘towards’. 4  adapt: make suitable"}, {"url": "http://www.answers.com/Q/What_does_the_Latin_root_word_junct_mean", "passage_text": "The latin root fac-or fic- all means make/do.. Some words containing this root are facile, factory, malefactor, manufacture, and artifact. + 10 others found this useful. You've made it your life's mission to raise awareness about addiction and educate on the importance of treatment."}, {"url": "http://www.answers.com/Q/What_does_the_root_word_junct_mean", "passage_text": "The Latin root word son means sound. Some words that are formed from this root are sonic, sonorous, resonant, resonate. 3 people found this useful. Edit. Share to: C3 Shooter. 66,336 Contributions. Be yourself. Everyone else is already taken. "}, {"url": "http://www.english-for-students.com/join.html", "passage_text": "join & junct. These ROOT-WORDS are JUNCT & JOIN which mean JOIN. This word list is a very fine illustration of the value of knowing the ROOTS to our language. Only the ROOT, JOIN of the whole list can stand alone. All the twenty words are built up by the ROOTS which are joined together. Fifteen ROOTS are represented in this list. Twelve of them you have learned formally, each on its own page."}, {"url": "http://membean.com/wrotds/ad-towards", "passage_text": "Prefixes are key morphemes in English vocabulary that begin words. The prefix ad-means “to, towards;” today we will ad dress increasing you vocabulary knowledge by looking “towards” this highly used prefix! When companies ad vertise their products, they are trying to turn your attention “towards” what they are selling. I think that that’s enough examples thrown “towards” you of the prefix ad- ; I wouldn’t want you to become an ad dict of just that prefix! 1  advertise: turn ‘towards’. 2  adhere: stick ‘to’. 3  adjust: tilt ‘towards’. 4  adapt: make suitable"}, {"url": "http://membean.com/wrotds/medi-middle", "passage_text": "The Latin root word medi means “middle.” This Latin root is the word origin of a large number of English vocabulary words, including medi eval, medi ocre, and medi a. This Latin root word medi is easily recalled through the word med ium, for a “ med ium” temperature is right in the “middle” of being hot and cold. We have certainly done no “middling” or medi ocre job when it has come to learning about the root word medi meaning “middle.” Now you’ll be able to know words im medi ately that have the root medi in them! 1  medium: in the “middle” of two extremes. 2  mediocre: of doing work in the “middle” between excellent and poor."}, {"url": "http://wordinfo.info/unit/1111/ip:1/il:J", "passage_text": "Inflammation of the conjunctiva and cornea with pain, photophobia, lacrimation, and smarting of the lids caused by repeated flashes of bright light or ultraviolet radiation. adjoin (verb) , adjoins; adjoined; adjoining. 1. To be next to; to attach something to another object, area, etc. 2. A tool that has a fixed jaw and a movable jaw which is controlled by a spiral gear or slide. It is used to install or to remove bolts and nuts of various sizes. The wrench itself comes in a variety of lengths and jaw sizes. A crescent wrench has smooth jaws while a pipe wrench has serrated jaws."}, {"url": "http://www.prefixsuffix.com/rootchart.php", "passage_text": "Below you will see a chart of English language word roots that are common prefixes and suffixes to base words. (This list is similar to that which appeared previously on this site.). This list is a small portion of our 2,000 word root database which you can search using our root search engine. "}, {"url": "http://www.answers.com/Q/What_does_the_Latin_root_word_junct_mean", "passage_text": "The Latin root word of port means to break something up. So to explain in a little sentence it would mean: Break something up. 11 people found this useful. Edit. Share to: C3 Shooter. 66,268 Contributions. Be yourself. Everyone else is already taken. You've made it your life's mission to raise awareness about addiction and educate on the importance of treatment."}]