[{"url": "http://management.about.com/cs/adminaccounting/g/grossrevenue.htm", "passage_text": "Definition: Gross Revenue is money generated by all of a company's operations, before deductions for expenses. Revenue can come from the sale of the company's products or services, from the sale of surplus equipment or property, or from the sale of shares of stock in the company."}, {"url": "http://www.moneychimp.com/glossary/gross_revenue.htm", "passage_text": "When a company sells products, it has to make allowances for some portion of its sales for products expected to be returned, lost in delivery, or otherwise requiring the company to refund the customers' money. The official revenue number, known as sales revenue, equals gross revenue minus these allowances."}, {"url": "https://en.wikipedia.org/wiki/Gross_income", "passage_text": "Gross income in United States tax law is receipts and gains from all sources. Gross income is the starting point for determining Federal and state income tax of individuals, corporations, estates and trusts, whether resident or nonresident."}, {"url": "http://www.investopedia.com/terms/r/revenue.asp", "passage_text": "DEFINITION of 'Revenue'. The amount of money that a company actually receives during a specific period, including discounts and deductions for returned merchandise. It is the top line or gross income figure from which costs are subtracted to determine net income."}, {"url": "http://financial-dictionary.thefreedictionary.com/gross+revenue", "passage_text": "The amount of money a company actually receives over a specific period; it accounts for sales discounts and deductions for returned merchandise. It is the “top line” or “gross income” figure from which costs are subtracted to determine net income."}, {"url": "http://financial-dictionary.thefreedictionary.com/Gross+Income", "passage_text": "Gross Income. An individual or company's income before taxes and deductions. For individual income, it is calculated as the individual's wages or salary, investment and asset appreciation, and the amount made from any other source of income. In a company, it is calculated as revenues minus expenses."}, {"url": "https://en.wikipedia.org/wiki/Revenue", "passage_text": "In business, revenue (net sales) is the income that a company receives from its normal business activities, usually from the sale of goods and services to customers. Revenue is also referred to as sales or turnover. Some companies receive revenue from interest, royalties, or other fees."}]