[{"url": "http://www.healthgrades.com/conditions/epstein-barr-virus", "passage_text": "The Epstein-Barr virus, also called EBV, is an extremely common virus that infects most people at one time or another during their lifetimes. Epstein-Barr virus infection generally causes a minor cold-like or flu-like illness, but, in some cases, there may be no symptoms of infection. In adolescents and young adults, the Epstein-Barr virus can cause mononucleosis, which is a more serious illness."}, {"url": "http://www.mayoclinic.org/diseases-conditions/mononucleosis/expert-answers/mononucleosis/faq-20058444", "passage_text": "Epstein-Barr virus (EBV), a widespread human herpes virus, can cause mononucleosis — but usually it doesn't. In fact, most EBV infections aren't noticeable, even when they're most active in your body. By age 35, almost everyone has antibodies to EBV, indicating past infection. "}, {"url": "http://www.webmd.com/a-to-z-guides/epstein-barr-virus", "passage_text": "In this article. Epstein-Barr is the virus that causes mononucleosis. You might know this disease better by its nickname, mono.. It's also called the  kissing disease because of one way you can spread it to someone else. Even though Epstein-Barr virus (EBV) isn't a household name, you've probably been infected without knowing it. "}, {"url": "http://www.cdc.gov/epstein-barr/about-ebv.html", "passage_text": "Epstein-Barr virus (EBV), also known as human herpesvirus 4, is a member of the herpes virus family. It is one of the most common human viruses. EBV is found all over the world. Most people get infected with EBV at some point in their lives. "}, {"url": "https://en.wikipedia.org/wiki/Epstein-Barr", "passage_text": "The Epstein–Barr virus (EBV), also called human herpesvirus 4 (HHV-4), is one of eight viruses in the herpes family, and is one of the most common viruses in humans. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3295", "passage_text": "Epstein-Barr virus: A virus in the herpes family that is best known as the cause of infectious mononucleosis (also called mono and glandular fever). Abbreviated EBV. EBV infection is characterized by fatigue and general malaise. Infection with EBV is common and is normally temporary and minor. "}, {"url": "https://labtestsonline.org/understanding/analytes/ebv/tab/sample", "passage_text": "Epstein-Barr virus (EBV) is a virus that typically causes a mild to moderate illness. These tests detect antibodies to EBV in the blood and help establish a diagnosis of an EBV infection. Epstein-Barr virus causes an infection that is very common. According to the Centers for Disease Control and Prevention (CDC), as many as 95% of people in the United States will have been infected by EBV by the time they are 40 years old. The virus is easily passed from person to person."}, {"url": "http://www.cdc.gov/epstein-barr/about-mono.html", "passage_text": "Infectious mononucleosis, also called “mono,” is a contagious disease. Epstein-Barr virus (EBV) is the most common cause of infectious mononucleosis, but other viruses can also cause this disease. It is common among teenagers and young adults, especially college students. At least 25% of teenagers and young adults who get infected with EBV will develop infectious mononucleosis."}, {"url": "http://www.healthcentral.com/encyclopedia/hc/epstein-barr-virus-3168911/", "passage_text": "Definition. Epstein-Barr Virus (EBV) is a common human virus that causes infectious mononucleosis and plays a role in the emergence of two rare forms of cancer: Burkitt's lymphoma, and nasopharyngeal carcinoma. Some doctors and medical textbooks describe and diagnose EBV as infectious mononucleosis and vise-versa"}]