[{"url": "http://www.cbpp.org/research/food-assistance/house-budget-would-slash-snap-by-125-billion-over-ten-years", "passage_text": "Dorothy Rosenbaum and Brynne Keith-Jennings. The House Budget Committee's budget plan would convert the Supplemental Nutrition Assistance Program (SNAP, formerly known as the Food Stamp Program) into a block grant beginning in 2021 and cut funding steeply -- by $125 billion (34 percent) between 2021 and 2025. The plan's only specific reference to the SNAP cut argues that: Federal spending for food stamps, the Supplemental Nutrition Assistance Program (SNAP), has increased from $21 billion in 2002 to $76 billion in 2014. Spending is forecast to be permanently higher than pre-recession levels even as the job-market recovers."}, {"url": "http://www.benefitsapplication.com/apply/TN/Food%20Stamps", "passage_text": "Apply by Mail. You can also apply for Tennessee Food Stamp program through mail. In order to do that, you will be required to download application forms first. You can download it in English, Spanish, Somali and Arabic. Here are different requirements of the program: 1  All applicants should be residing in the state of Tennessee to receive Food Stamps in Tennessee. 2  Children under the age of 21 and living with their parents will have to apply for the program as one household."}, {"url": "https://portside.org/2015-01-10/one-million-food-stamp-recipients-lose-benefits-2016", "passage_text": "According to a new report, roughly 1 million of the nation’s poorest people will be cut off the Supplemental Nutrition Assistance Program (SNAP) over the course of 2016, as states move to limit food stamp benefits for unemployed adults who aren’t disabled or raising minor children. Creative Commons Attribution-Non-Commercial 2.0 License. Food stamp eligibility rules are tightening in states across the country, causing up to 1 million current recipients to lose benefits and resulting in “serious hardship for many,” according to a new report from the Center on Budget and Policy Priorities."}, {"url": "http://www.politico.com/story/2015/05/veterans-face-losing-snap-benefits-117553", "passage_text": "State FoodShare officials confirmed that although 700 people in the three-county pilot program did lose their SNAP benefits, 259 also gained employment and either kept the food stamps or no longer needed them as a result of a new employment and training program. ”It’s worth it to us to take the time to help them transition.”. And a lot of the veterans, especially the younger ones returning from Iraq or Afghanistan, are in particular need for help, McGovern added. But the food stamp program has been a favorite target for some lawmakers in recent years."}, {"url": "http://www.alternet.org/news-amp-politics/one-million-americans-are-about-lose-their-food-stamp-benefits", "passage_text": "Print. Comments. One million of the nation’s poorest people will be cut from the federal Supplemental Nutrition Assistance (SNAP) program by the end of 2016 even if they're actively pursuing work, according to Center of Budget Policy and Priorities. Better known by its former name, the Food Stamp program, in some areas SNAP will reinstate a three-month limit on benefits for unemployed adults between 18-50 who are not disabled or raising children."}, {"url": "http://www.benefitsapplication.com/apply/TN/Food%20Stamps", "passage_text": "1 All applicants should be residing in the state of Tennessee to receive Food Stamps in Tennessee. 2  Children under the age of 21 and living with their parents will have to apply for the program as one household. Here are different requirements of the program: 1  All applicants should be residing in the state of Tennessee to receive Food Stamps in Tennessee. 2  Children under the age of 21 and living with their parents will have to apply for the program as one household."}, {"url": "http://www.benefitsapplication.com/apply/TN/Food%20Stamps", "passage_text": "Apply Online. You can apply online for Tennessee Food Stamp program. All you have to do is submit an online application. After your application is received and viewed by DHS, you will be giving a time and date for interview. Here are different requirements of the program: 1  All applicants should be residing in the state of Tennessee to receive Food Stamps in Tennessee. 2  Children under the age of 21 and living with their parents will have to apply for the program as one household."}, {"url": "http://www.fns.usda.gov/snap/apply", "passage_text": "To apply for benefits, or for information about the Supplemental Nutrition Assistance Program, contact your local SNAP office. You can find local offices and each State's application on our national map. Local offices are also listed in the State or local government pages of the telephone book. The office should be listed under Food Stamps, Social Services, Human Services, Public Assistance, or a similar title. You can also call your State's SNAP hotline number. Most are toll-free numbers."}]