[{"url": "http://www.chandrakantha.com/articles/indian_music/nritya.html", "passage_text": "India has a very rich tradition of classical and non-classical dance. The Natya Shastra, which is the oldest surviving text on stagecraft in the world, spends a considerable time discussing it. In the old days of the theatre, the dancers would mime the story while the singers would sing the dialogue."}, {"url": "http://www.danceadvantage.net/classic-confusion/", "passage_text": "The most inclusive definition I’ve found is used throughout K-12 educational documents and refers to classical dance as: “Dance that has been developed into highly stylized structures within a culture. Generally developed within the court or circle of power in a society.”."}, {"url": "http://www.thefreedictionary.com/Classical+Dance", "passage_text": "1. A classical dance form characterized by grace and precision of movement and by elaborate formal gestures, steps, and poses. 2. A theatrical presentation of group or solo dancing to a musical accompaniment, usually with costume and scenic effects, conveying a story or theme. 3."}, {"url": "http://www.answers.com/Q/What_is_classical_dance", "passage_text": "Classical dance in India has developed a type of dance-drama that is a form of a total theater. The dancer acts out a story almost exclusively through gestures. Most of the cl … assical dances enact stories from Hindu mythology. Each form represents the culture and ethos of a particular region or a group of people."}, {"url": "http://www.factmonster.com/dk/encyclopedia/dance.html", "passage_text": "Classical dance is historic and takes many years to learn. Western classical dance is called ballet and combines dance with mime (silent acting). It began in Europe in the 15th century. Countries such as India and Thailand also have great classical dance traditions. CHOREOGRAPHY is used to create classical dance."}, {"url": "https://georgandreassuhr.wordpress.com/2012/12/16/the-8-classical-dance-styles-of-india/", "passage_text": "This is the first article from a serial about the classical Indian Dance Legends from the eight dance styles Bharatnatyam, Kathak, Kathakali, Kuchipudi, Manipuri, Mohinattyam, Odissi and Sattriya. Writen by the youngest professional Indian Kuchipudi Dancer Avijit Das from Bengaluru."}, {"url": "https://georgandreassuhr.wordpress.com/2012/12/16/the-8-classical-dance-styles-of-india/", "passage_text": "Bharata Natyam is one of the eight Indian classical dance forms of India. This dance form originated in the temples and courts of southern India. Later it was documented as a performing art in the 19th century by four brothers known as the Tanjore Quartet (musicians)."}]