[{"url": "http://www.answers.com/Q/How_long_do_cooked_pork_ribs_stay_fresh_in_the_refrigerator", "passage_text": "Meats are kept better in the freezer. Meats can be kept in the refrigerator for 3 to 4 days if raw and 1 to 2 days longer if cooked. Always place cooked meats in an airt … ight container. 4 people found this useful. Answered. Raw meats go bad quickly. It only will stay fresh for a few days if kept in the refrigerator. Usually about 4 to 5 days. After that they go bad fast."}, {"url": "http://www.answers.com/Q/How_long_can_you_keep_uncooked_pork_ribs_in_the_refrigerator", "passage_text": "Confidence votes 30.7K. Meats do not last long in the refrigerator. Only about 3 to 4 days if it is raw. Then 1 to 2 days longer if cooked and placed in an airtight container. You should always cover meats when stored in the fridge. How long can you keep uncooked pork chops in the refrigerator? If they are still in packaging, you can keep an uncooked pork chop in the refrigerator for a maximum of 4 days before they start to go bad."}, {"url": "http://bbq-brethren.com/forum/showthread.php?t=14419", "passage_text": "I keep them for about 3 days. If I plan on keeping them longer than that, I just smoke extra, shrink wrap the extra and freeze them. They will last a year like that. Then, even if you can't smoke, you always have some good ribs to heat up in a minute and chow out. Smoked ribs cooked to the temps we usually do, in a smoky environment, are good to store in a standard home fridge for at least a week, probably two. If you have a modern fridge, with a good meat drawer, you may go a little longer. My Kithenaid meat drawer is set to maintain 33 degrees constant."}, {"url": "http://www.porkbeinspired.com/pork-cooking-tips/buying-handling-storing/", "passage_text": "Sealed, pre-packed fresh pork cuts can be kept in the refrigerator 2 to 4 days; sealed ground pork will keep in the refrigerator for 1 to 2 days. If you do plan on keeping the raw, fresh pork longer than 2 to 3 days before cooking it, store it well-wrapped in the freezer. How long can I store ham or other smoked products in the refrigerator? Whole smoked ham and whole ham slices can be stored in the refrigerator for 3-4 days or the use by date on the label. Leftovers should be placed in the refrigerator within 1 to 2 hours of serving. Store cooked leftovers in the coldest part of the refrigerator for 4-5 days. Well-wrapped leftovers can be kept in the freezer for up to three months."}, {"url": "http://www.foodista.com/question/VKFSDDMM/how-long-can-you-store-pork-ribs-in-your-refrigerator", "passage_text": "Permalink Anonymous. It depends on the temperature you have your refrigerator set at and how long the ribs were left unfrozen in the market before you purchased them. If you do not plan on using the pork ribs within 2 days of purchase it is best to freeze them. Ribs can last up up to 5 days in the fridge depending on the temperature but could go bad as early as 4 if your temperature is not cool enough"}, {"url": "http://cookeatshare.com/popular/how-long-does-pork-ribs-keep-in-the-refrigerator", "passage_text": "Trusted Results with How long does pork ribs keep in the refrigerator. Rockin' Roast Pork Shoulder with Spanish Rice Recipe: Paula ... Food Network invites you to try this Rockin' Roast Pork Shoulder with Spanish Rice recipe from Paula Deen. ... Cook's Note: Can keep in the refrigerator for up to 10 days. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080111043104AA2013V", "passage_text": "A good rule of thumb is remember the 3 rule. 3 days in the fridge 3 months in the Freezer I would say that if you don't have a good idea about when you would eat a left over... then freeze it. Of course some foods can be kept longer and some foods frozen longer, it depends on the container, the food etc. "}, {"url": "http://bbq-brethren.com/forum/showthread.php?t=14419", "passage_text": "Seriously, though: It somewhat depends on your fridge. Smoked ribs cooked to the temps we usually do, in a smoky environment, are good to store in a standard home fridge for at least a week, probably two. If you have a modern fridge, with a good meat drawer, you may go a little longer. My Kithenaid meat drawer is set to maintain 33 degrees constant."}, {"url": "http://www.answers.com/Q/How_long_can_you_keep_uncooked_pork_ribs_in_the_refrigerator", "passage_text": "Meats are kept better in the freezer. Meats can be kept in the refrigerator for 3 to 4 days if raw and 1 to 2 days longer if cooked. Always place cooked meats in an airt … ight container. 8 people found this useful. How long can you keep uncooked pork chops in the refrigerator? If they are still in packaging, you can keep an uncooked pork chop in the refrigerator for a maximum of 4 days before they start to go bad."}]