[{"url": "http://www.humanillnesses.com/original/U-Z/Zoonoses.html", "passage_text": "Parasites. Many organisms cause disease only in people. Others affect only certain animals. Zoonotic organisms are those that can spread from animals to humans. There are more than 175 kinds of organisms that can cause zoonoses. They include viruses, bacteria, fungi, and such parasites as mites and worms. Many of the diseases that may be transmitted to humans from pets and farm animals are also found in wild animals. Rabies, for example, also occurs in raccoons, foxes, skunks, and bats."}, {"url": "http://pets.thenest.com/can-dogs-cats-catch-human-colds-viruses-5645.html", "passage_text": "Speaking broadly, many veterinarians note that dogs and cats can't catch human colds. The H1N1 outbreak of 2009, however, challenged that conventional wisdom when at least one cat (and two ferrets) apparently contracted swine flu from humans. Many common dog colds come from canine flu virsuses and bordetella bacteria; many common cat colds come from feline herpes and calici viruses and bordetella bacteria; and many common human colds come from rhinovirus. When you catch a cold, you don't have to worry about getting your pets sick."}, {"url": "https://answers.yahoo.com/question/index?qid=20080517232925AADWz73", "passage_text": "Most animal illnesses are specific to that animal. Dogs to dogs, cats to cats, people to people. Meaning a dog can't give certain illnesses to a cat, and a can't can't catch certian illnesses from a hamster, and so on. However, things like Rabies, Lepto, and salmonella are a different story. But like others have said, those are rare cases. Currently it is not believed that dogs can catch human colds. There are things that can be passed between dogs and humans. Just about any mammal can carry Rabies. You can get parasites from your dog. Fungal infections such as ringworm are communicable."}, {"url": "http://pets.thenest.com/can-dogs-cats-catch-human-colds-viruses-5645.html", "passage_text": "Catching Colds. A variety of germs are responsible for the common cold in dogs and cats, just like in humans, but they're not the same viruses. Most respiratory infections -- and most viruses, for that matter -- are species specific. Many common dog colds come from canine flu virsuses and bordetella bacteria; many common cat colds come from feline herpes and calici viruses and bordetella bacteria; and many common human colds come from rhinovirus. When you catch a cold, you don't have to worry about getting your pets sick."}, {"url": "https://answers.yahoo.com/question/index?qid=20080517232925AADWz73", "passage_text": "YES, diseases that are transmissible from animals to humans are called zoonoses. Some diseases can also be spread from humans to animals, and these are often termed reverse zoonoses. Zoonoses include things like mumps, hepatitis, rabies, scarlet fever, tuberculosis, anthrax, ebola, malaria, etc. Currently it is not believed that dogs can catch human colds. There are things that can be passed between dogs and humans. Just about any mammal can carry Rabies. You can get parasites from your dog. Fungal infections such as ringworm are communicable."}, {"url": "http://www.besthealthmag.ca/best-you/pet-health/can-cats-and-dogs-get-colds-and-flu/", "passage_text": "Dogs can’t: “There’s no concern with dog-to-human, or human-to-dog, transmission,” says Scott Weese, the Canada research chair in zoonotic diseases and an associate professor at the Ontario Veterinary College. Dogs get viruses from each other. But a cat can catch cold or flu from you. “The virus attaches to cells in the respiratory tract of felines similarly to how it does in humans,” says Weese. He points to reports of H1N1 found in cats in the United States. Cats also get cat-to-cat viruses that are similar to a cold, but humans can’t catch those. If you have a pet, it’s always a good idea to wash your hands often, especially after contact. “Avoid exposure from the pet’s saliva to your mucous membranes, such as your nose and mouth, or broken skin,” says Weese"}, {"url": "http://www.answers.com/Q/Can_a_dog_catch_a_stomach_virus_from_humans", "passage_text": "Dogs do catch some viruses that are contagious to humans, and vice versa. Even though dogs can share illnesses with their owners, it is not possible for a dog to share h … is flu (or any other illness that causes an upst stomach) with you. "}, {"url": "http://www.mnn.com/health/fitness-well-being/stories/14-diseases-you-can-get-from-your-pets", "passage_text": "There are a minimum of 39 important diseases that people catch directly from animals, 42 important diseases that people get by eating or touching food or water contaminated with animal feces, and at least 48 important diseases that humans can get from the bite of bugs that feasted on an infected animal. "}, {"url": "http://pets.thenest.com/can-dogs-cats-catch-human-colds-viruses-5645.html", "passage_text": "Cats and dogs can both catch human colds. Dogs, cats and humans share a litany of cold symptoms -- stuffy noses and irritability, for starters -- but the underlying causes are usually alien. Pets and people can share a few viruses, but common cold culprits aren't typically among them. Many common dog colds come from canine flu virsuses and bordetella bacteria; many common cat colds come from feline herpes and calici viruses and bordetella bacteria; and many common human colds come from rhinovirus. When you catch a cold, you don't have to worry about getting your pets sick."}]