[{"url": "http://www.medicarepedia.com/medicare-part-a/opting-out-of-medicare-part-a.html", "passage_text": "However, this is not the case. There are many reasons you might want to opt out of Medicare Part A. People who live out of the country or who are still working are the two largest groups of people who can opt out of Medicare Part A without penalty. People also might want to opt out for other reasons."}, {"url": "http://www.medicarepedia.com/medicare-part-a/opting-out-of-medicare-part-a.html", "passage_text": "Opting out of Medicare will Cause You to Lose Your Social Security. However as the law stands today, if you are receiving Social Security benefits you may not opt out of Part A without also surrendering your benefits. In other words, once enrolled you must stay enrolled or risk losing y"}, {"url": "http://www.insurancelibrary.com/medicare-insurance/can-i-opt-out-of-medicare-part-b", "passage_text": "You can opt out of Medicare Part B and in some situations you should opt out. Most people are automatically enrolled in Medicare Part A and Part B when they turn age 65. And most receive Part B at no charge. Medicare Part B is optional and you may not need the coverage if you have a group health plan."}, {"url": "http://www.medicarepedia.com/medicare-part-b/opting-out-of-medicare-part-b.html", "passage_text": "Many people for one reason or another may decide to opt out of Medicare Part B. The reason most people opt out of Medicare Part B is because they have creditable coverage through another provider. This could be through an HSA Plan, through retirement benefits or through an employer's plan."}, {"url": "http://finance.yahoo.com/news/opt-medicare-122947160.html", "passage_text": "But the rest of Medicare — for doctor visits (Part B) and prescription drugs (Part D) — is voluntary. Which means, when you turn 65, you have some decisions to make. AARP explains: Medicare has a seven-month period in which you can sign up for Part B, which covers doctor bills and other outpatient medical costs. This period begins three months before the month of your 65th birthday, includes the month you turn 65 and ends three months after your birthday month."}, {"url": "http://finance.yahoo.com/news/opt-medicare-122947160.html", "passage_text": "The penalty: Part D. And then there’s the question of drug coverage, Medicare Part D. Likewise, if you opt out now, the insurance will cost you more later. The penalty is 1 percent of the premium each month for every month you are eligible and don’t enroll, says Williamson."}]