[{"url": "http://www.healthygutbugs.com/preventing-treating-food-poisoning-probiotics/", "passage_text": "Probiotics and a healthy gut micro biome have been shown to prevent many cases of traveler’s diarrhea, taking probiotics can also treat food poisoning and help sufferers feel better quickly. Note: When to Seek Immediate Medical Treatment."}, {"url": "http://www.dietadvisor.com/probiotics_food_poisoning.htm", "passage_text": "Probiotics May Help Prevent Food Poisoning This research article caught my eye because eating probiotic foods like cultured milk products (yogurt, cottage cheese or kefir) is what I recommend to promote normal intestinal function during diarrhea, vomiting or intestinal cramping due to food poisoning."}, {"url": "http://www.livestrong.com/article/409342-probiotics-for-food-poisoning/", "passage_text": "If you've been diagnosed with food poisoning, talk with your doctor about using probiotics to treat your nausea and diarrhea. Probiotics are sold in supplement form or you can obtain these healthy bacteria by eating yogurt."}, {"url": "http://www.news-medical.net/health/Treatment-of-food-poisoning.aspx", "passage_text": "Probiotics. Probiotics, such as Lactobacillus acidophilus and Lactobacillus bulgaricus, are preparations with beneficial bacteria. These can help restore the balance of good bacteria in the intestine. These are handy for travellers to an area where the food and water may be contaminated."}, {"url": "https://www.healthtap.com/topics/probiotics-for-food-poisoning", "passage_text": "Get help from a doctor now ›. Probiotics: Unfortunately probiotics won't help food poisoning. The toxin is already in what your about to eat... bacteria may already be dead. This is not to say that a healthy lactobacillis flora in the gut doesn't do a lot to help prevent injurious events (bacterial and viral alike)."}, {"url": "http://www.healthygutbugs.com/preventing-treating-food-poisoning-probiotics/", "passage_text": "Additionally, the beneficial bacteria and yeasts in the probiotics will help your digestive tract return to normal faster after a bout of food poisoning. In some cases, an unexpected side effect of food poisoning is that the sufferer develops lactose intolerance (a problem digesting milk and foods made with milk)."}, {"url": "http://www.healthygutbugs.com/preventing-treating-food-poisoning-probiotics/", "passage_text": "If you have taken antibiotics for a bout of food poisoning, taking a probiotic supplement along with, or even after, the prescription medication can help return the healthy microbes to your digestive tract that may have been inadvertently harmed by the antibiotics."}, {"url": "http://www.livestrong.com/article/409342-probiotics-for-food-poisoning/", "passage_text": "Probiotics are bacteria that live in your intestines that promote healthy digestion. During food poisoning, the lining of your intestines can become damaged and the amount of helpful bacteria in your colon may be reduced because of excessive diarrhea."}]