[{"url": "http://www.olt.com/main/home/alrefund.asp", "passage_text": "Alabama State Tax Refund Status You can check the status of your Alabama tax refund online at the Alabama Department of Revenue website. You will need to know the primary Social Security Number, tax form, the filing status, and the exact amount of your anticipated refund. Click below to check the status of your Alabama tax refund: Alabama State Tax Refund Status. Alabama State Tax Refund Status."}, {"url": "https://www.irs.gov/taxtopics/tc152.html", "passage_text": "If you don't have Internet access, you may call the refund hotline at 800-829-1954. Where’s My Refund? includes information for the most recent tax year filed in the current year and does not include information about amended returns. To check the status of an amended return, use Where’s My Amended Return? on IRS.gov. For example, you can request that we directly deposit into a checking, a savings and a retirement account by completing Form 8888 (PDF), Allocation of Refund (Including Savings Bond Purchases) and attaching it to your income tax return. This option is not available if you file Form 8379 (PDF), Injured Spouse Allocation."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_get_state_tax_refund_if_you_efile_and_have_it_direct_deposited_to_checking_account", "passage_text": "1 About 4-5 business days. 2  I filed my State Tax Returns through TurboTax E-File. 3  Federal direct deposit takes about 8 days but state returns can vary from a week to over a month. 4  I'm a Massachusetts resident and it has been close to 30 days and i still have not received the direct deposit. The length of time it takes to get a Louisiana State refund from an  e-filed return can vary. As of February 2014, the state stated  e-filed returns may take around 21 days … for processing. 2 people found this useful."}, {"url": "http://revenue.alabama.gov/directdeposit/", "passage_text": "Benefits of Direct Deposit. An increasing number of Alabama taxpayers are making the transition from traditional paper checks to the direct deposit system for their annual state income tax refunds. Direct deposit offers taxpayers safe, secure, and fast access to refunds. The direct deposit system allows you to set up an electronic deposit of your payment into the account of your choice, by providing your bank's routing number and your account number. Your funds will be automatically deposited into that account, and the money is available to use the same day it is deposited."}, {"url": "http://revenue.alabama.gov/directdeposit/", "passage_text": "Last year, two thirds of Alabama taxpayers opted to have their income tax refunds direct deposited. The direct deposit system allows you to set up an electronic deposit of your payment into the account of your choice, by providing your bank's routing number and your account number. Your funds will be automatically deposited into that account, and the money is available to use the same day it is deposited."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_get_state_tax_refund_if_you_efile_and_have_it_direct_deposited_to_checking_account", "passage_text": "1 Federal direct deposit takes about 8 days but state returns can vary from a week to over a month. 2  I'm a Massachusetts resident and it has been close to 30 days and i still have not received the direct deposit. The length of time it takes to get a Louisiana State refund from an  e-filed return can vary. As of February 2014, the state stated  e-filed returns may take around 21 days … for processing. 2 people found this useful."}, {"url": "http://www.moneysmartsblog.com/income-tax-refund/", "passage_text": "Verify Tax Refund is Correct. Once a refund is received, taxpayers should check to ensure the amount is correct. If a check or electronic deposit arrives for more than the amount listed on the tax return, the check should not be cashed. A notice will be sent out from the IRS explaining the discrepancy in amount. There are two ways for a taxpayer to get back their federal income tax refund. They can opt to have the refund amount direct deposited into their bank account or they can request a paper check be mailed. The option you choose will affect the amount of time it takes to receive your refund."}, {"url": "https://answers.yahoo.com/question/index?qid=20080229091613AANQ0ra", "passage_text": "Rating Newest Oldest. Best Answer: I am actually a certified tax preparer in the state of Alabama. The state issued so much money for larger amounts than last year at the beginning of this year. If your state refund check is over 500.00, then it is at a stand still. Report Abuse. actually, i just read in Tax Cut that your state refund (when asking for Direct Deposit) can be expected in 1-4 WEEKS if your waiting for a check it could be 6-8 weeks or so...the 8-10 business days only pertains to the Federal Return, NOT the State return...if your still waiting..."}, {"url": "http://www.moneysmartsblog.com/income-tax-refund/", "passage_text": "If you filed a tax return by mail, your refund will be issued within six weeks from the date the return was received by the IRS, whether or not you opted for a paper check or an electronic deposit. There are two ways for a taxpayer to get back their federal income tax refund. They can opt to have the refund amount direct deposited into their bank account or they can request a paper check be mailed. The option you choose will affect the amount of time it takes to receive your refund."}]