[{"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0011288/?report=details", "passage_text": "Moxifloxacin is used to treat bacterial infections in many different parts of the body. Moxifloxacin belongs to the class of medicines known as quinolone antibiotics. It works by killing bacteria or preventing their growth. However, this medicine will not work for colds, flu, or other virus infections. This medicine is available only with your doctor's prescription."}, {"url": "https://en.wikipedia.org/wiki/Moxifloxacin", "passage_text": "Avelox (moxifloxacin) was launched in the United States in 1999 and is marketed in more than 80 countries worldwide. In the United States, Avelox is marketed by Bayer's partner Merck. Moxifloxacin is also sold in an ophthalmic solution (eye drops) under the brand names Vigamox, and Moxeza for the treatment of conjunctivitis (pink eye)."}, {"url": "https://en.wikipedia.org/wiki/Moxifloxacin", "passage_text": "Moxifloxacin is a fourth-generation synthetic fluoroquinolone antibacterial agent developed by Bayer AG (initially called BAY 12-8039). It is marketed worldwide (as the hydrochloride) under the brand names Avelox, Avalox, and Avelon for oral treatment. Moxifloxacin is also sold in an ophthalmic solution (eye drops) under the brand names Vigamox, and Moxeza for the treatment of conjunctivitis (pink eye)."}, {"url": "http://www.rxlist.com/avelox-drug/patient-images-side-effects.htm", "passage_text": "Moxifloxacin is an antibiotic in a group of drugs called fluoroquinolones (flor-o-KWIN-o-lones). Moxifloxacin fights bacteria in the body. Moxifloxacin is used to treat different types of bacterial infections. Moxifloxacin may also be used for purposes not listed in this medication guide. "}, {"url": "http://www.webmd.com/drugs/2/drug-17874/moxifloxacin-oral/details", "passage_text": "Uses. Moxifloxacin is used to treat a variety of bacterial infections. This medication belongs to a class of drugs called quinolone antibiotics. It works by stopping the growth of bacteria. This antibiotic treats only bacterial infections. "}, {"url": "http://www.medicines.org.uk/EMC/medicine/11841/SPC/Avelox+400+mg+film-coated+tablets/", "passage_text": "4.1 Therapeutic indications. Avelox 400 mg film-coated tablets are indicated for the treatment of the following bacterial infections in patients of 18 years and older caused by bacteria susceptible to moxifloxacin (see sections 4.4, 4.8 and 5.1). "}]