[{"url": "http://www.livestrong.com/article/461208-how-to-calculate-mph-for-bikes/", "passage_text": "Step 4. Multiply the miles traveled per minute by 60 to find mph for biking. Continuing the example above, you would multiply 0.167 miles per minute by 60 to get your speed of 10.0 mph. Riding a bicycle is excellent cardiovascular exercise and a workout that can help you lose weight. At just 10 miles per hour an individual who weighs 200 lbs. burns over 360 calories in an hour of riding."}, {"url": "http://www.answers.com/Q/How_fast_can_average_person_ride_bike_in_an_hour", "passage_text": "Confidence votes 51.0K. Knowledge is a thing you can both share and keep. With a good bike, a fairly average person can hit about 40 KMH / 25 MPH for a short period, and cover a tad more than 30 km /20 miles in one hour. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071108173635AACL7Z7", "passage_text": "Best Answer: I see you're getting a wide range of speeds here. I'll put it this way IMHO: The average non-cyclist adult on a multi-speed bike will maybe average 9-12 mph as an easy pace-a stroll if you will on flat terrain. Average sport or training cyclists on good road bikes will find that pace painfully slow. A leisurely ride to me is around 14-15 mph. Most ardent cyclists (me included) prefer a moderate ride when not riding hard that's maybe 15-18 mph on a road bike. It's all in the bike, terrain, conditioning and mind set"}, {"url": "http://www.livestrong.com/article/486666-is-an-average-of-15-miles-per-hour-on-a-bike-good-for-a-beginner/", "passage_text": "If you are new to cycling, work on riding at a steady pace with a few short intervals of a more challenging speed, like 14 to 15 mph. The NutriStrategy website categorizes riding at speeds of 14 to 15.9 mph as a vigorous pace. Speeds above 16 mph are considered very vigorous while riding a bicycle. If you feel more comfortable at a moderate pace of 12 to 13.9 mph, and you weigh the same amount, you’ll burn an average of 563 calories per hour."}, {"url": "http://gw009.k12.sd.us/Calculators/Triathlon%20Conversion%20Calculator.htm", "passage_text": "The Bike Speed Calculator allows you to enter in the bike distance (kilometers or miles), and the biking time-it will then compute your average bike speed in kilometers/hour (km/hr) or miles per hour (MPH). The Running Pace Calculator allows you to enter in the run distance (kilometers or miles), and your running time-it will then compute your running pace in minutes per kilometer (min/km) or minutes per mile (min/mile) as well as your average run speed in kilometers per hour (km/hr) or M"}, {"url": "http://www.livestrong.com/article/486666-is-an-average-of-15-miles-per-hour-on-a-bike-good-for-a-beginner/", "passage_text": "Types. The NutriStrategy website categorizes riding at speeds of 14 to 15.9 mph as a vigorous pace. Speeds above 16 mph are considered very vigorous while riding a bicycle. A light pace would be 10 to 11.9 mph while a moderate pace is categorized as 12 to 13.9 mph. If you feel more comfortable at a moderate pace of 12 to 13.9 mph, and you weigh the same amount, you’ll burn an average of 563 calories per hour."}, {"url": "https://answers.yahoo.com/question/index?qid=20080205091955AA3pn5L", "passage_text": "Rating Newest Oldest. Best Answer: You should probably plan on at least 3 weeks and more likely 4. It's not necessarily how fast your average daily speed is but how far you can/want or need to travel. Most organized multi-day bike tours average around 75 miles per day or less with good reason. Everyone goes at their own pace and you may go faster or slower than other people. The best thing you can do especially if you are going to bike 1500 miles is get a speedometer and maybe bike 20 miles on a weekend before you go to find an average speed you can travel that distance at."}, {"url": "http://www.livestrong.com/article/486666-is-an-average-of-15-miles-per-hour-on-a-bike-good-for-a-beginner/", "passage_text": "Is an Average of 15 Miles Per Hour on a Bike Good for a Beginner? Your fitness level helps determine if 15 mph is an ideal speed for you. If you feel more comfortable at a moderate pace of 12 to 13.9 mph, and you weigh the same amount, you’ll burn an average of 563 calories per hour."}, {"url": "http://bicycles.stackexchange.com/questions/1505/how-do-on-road-mountain-bike-speeds-translate-to-road-bike-speeds", "passage_text": "On my reasonably flat commute I average around 16 mph on my road bike, but your average speed is dependent on many different factors. A general rule of thumb is that if you are switching from a mountain bike with knobbies to a road bike you will be between 15-20% faster at the same watts/effort. More like 9 mph faster. Which on a 20 mile commute = 46 minutes on the MTB, versus 33 minutes on a road bike, at the same level of effort. This is strictly a matter of gearing and mechanical advantage, for a roughly 30% increase in speed. BTW, all of the math here assumes the same tire diameter, which is not typical."}, {"url": "http://gw009.k12.sd.us/Calculators/Triathlon%20Conversion%20Calculator.htm", "passage_text": "The Swim Pace calculator allows you to enter in the swim distance (meters, yards, kilometers or miles), and the swim time-it will then compute your pace /100m, /100yds as well as an average swim speed in km/hr or miles/hr (MPH). The Running Pace Calculator allows you to enter in the run distance (kilometers or miles), and your running time-it will then compute your running pace in minutes per kilometer (min/km) or minutes per mile (min/mile) as well as your average run speed in kilometers per hour (km/hr) or Miles per hour (MPH)."}]