[{"url": "https://en.wikipedia.org/wiki/Autism", "passage_text": "Autism is a neurodevelopmental disorder characterized by impaired social interaction, verbal and non-verbal communication, and restricted and repetitive behavior. Parents usually notice signs in the first two years of their child's life. "}, {"url": "http://www.asha.org/public/speech/disorders/Autism/", "passage_text": "Children with autism, also known as autism spectrum disorder or ASD, have social, communication and language problems. They also have restricted and repetitive patterns of behavior, interests, or activities, such as flipping objects, echolalia, or excessive smelling or touching of objects. Autism may be mild or severe. "}, {"url": "https://www.autismspeaks.org/what-autism", "passage_text": "Autism spectrum disorder (ASD) and autism are both general terms for a group of complex disorders of brain development. These disorders are characterized, in varying degrees, by difficulties in social interaction, verbal and nonverbal communication and repetitive behaviors. "}, {"url": "http://www.ninds.nih.gov/disorders/autism/detail_autism.htm", "passage_text": "Autism spectrum disorder (ASD) is a range of complex neurodevelopment disorders, characterized by social impairments, communication difficulties, and restricted, repetitive, and stereotyped patterns of behavior. Autistic disorder, sometimes called autism or classical ASD, is the most severe form of ASD, while other conditions along the spectrum include a milder form known as Asperger syndrome, and childhood disintegrative disorder and pervasive developmental disorder not otherwise specified (usually referred to as PDD-NOS)."}, {"url": "https://en.wikipedia.org/wiki/Autism_spectrum", "passage_text": "A revision to autism spectrum disorder (ASD) was proposed in the Diagnostic and Statistical Manual of Mental Disorders version 5 (DSM-5), released May 2013. The new diagnosis encompasses previous diagnoses of autistic disorder, Asperger's disorder, childhood disintegrative disorder, and PDD-NOS. The DSM-5, published in 2013, redefined the autism spectrum to encompass the previous (DSM-IV-TR) diagnoses of autism, Asperger syndrome, pervasive developmental disorder not otherwise specified (PDD-NOS), Rett's disorder and childhood disintegrative disorder."}, {"url": "http://www.webmd.com/brain/autism/autism-spectrum-disorders", "passage_text": "Understanding Autism -- the Basics. Autism is a complex neurobehavioral disorder that includes impairments in social interaction and developmental language and communication skills combined with rigid, repetitive behaviors. The disorder covers a large spectrum of symptoms, skills, and levels of impairment."}, {"url": "https://en.wikipedia.org/wiki/Autism_spectrum", "passage_text": "The autism spectrum or autistic spectrum describes a range of conditions classified as neurodevelopmental disorders in the fifth revision of the American Psychiatric Association 's Diagnostic and Statistical Manual of Mental Disorders 5th edition (DSM-5). The DSM-5, published in 2013, redefined the autism spectrum to encompass the previous (DSM-IV-TR) diagnoses of autism, Asperger syndrome, pervasive developmental disorder not otherwise specified (PDD-NOS), Rett's disorder and childhood disintegrative disorder."}, {"url": "http://www.mayoclinic.org/diseases-conditions/autism-spectrum-disorder/basics/definition/con-20021148", "passage_text": "Autism spectrum disorder is a serious neurodevelopmental disorder that impairs a child's ability to communicate and interact with others. It also includes restricted repetitive behaviors, interests and activities. These issues cause significant impairment in social, occupational and other areas of functioning. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/autism-spectrum-disorder/basics/symptoms/con-20021148", "passage_text": "Symptoms. Autism spectrum disorder impacts how a child perceives and socializes with others, causing problems in crucial areas of development — social interaction, communication and behavior. Some children show signs of ASD in early infancy. "}]