[{"url": "http://www.kompareit.com/homeandgarden/windows-compare-egress-cost.html", "passage_text": "Cost of Egress Windows. If you’re simply replacing an existing egress window, budget anywhere from about $200-$1,200, depending on the material. A vinyl window will fall on the low end of that range, fiberglass will fall somewhere in the middle and wood will fall on the higher end. If you’re adding an egress window where one doesn’t exist-which means cutting a large hole in the wall-you’re looking at spending $2,000 to $5,000 for professional installation. Planning to tackle the job yourself? That brings the cost down to about $500-$1,000, but DIY is not advisable unless you have experience."}, {"url": "http://www.familyhandyman.com/basement/how-to-install-basement-windows-and-satisfy-egress-codes/view-all", "passage_text": "Allow at least three full days to install the window, plus time for finishing the interior. Hiring a contractor to install an egress window and window well like the ones shown will cost from $6,000 to $8,000. If you do the projects yourself, expect to spend $1,500 on materials, tool rental and refuse container fees. We'll show you all the how-to steps you need to install a basement egress window, from cutting a hole in the basement wall to framing the opening to setting the window. Doing the project yourself can save you more than $4,000."}, {"url": "http://replacementwindowsconnect.com/styles/egress-window-prices-costs/", "passage_text": "Egress Window Cost. Installation: $1,000 to $2,000. Replacing windows doesn’t cost more than any other project (although installing in concrete can be tricky). The retaining wall – plans, getting the plans approved, labor and materials – will run up to $2,000 for a code compliant basement egress. Entry Level Egress Window Cost: $200 – $450. Entry level projects will typically involve slider windows because they are cheaper than casements. Sliders will have to be larger though due to the size requirements. The frame will typically be vinyl or composite and be available in a limited number of colors and option"}, {"url": "http://replacementwindowsconnect.com/styles/egress-window-prices-costs/", "passage_text": "Egress Window Costs & Prices. Egress window cost will vary from $1100 to $2600 for the windows and installation. The price difference can be found in whether you are simply replacing a basement window or installing a whole project that complies with building codes and therefore qualifies as an emergency exit. Entry Level Egress Window Cost: $200 – $450. Entry level projects will typically involve slider windows because they are cheaper than casements. Sliders will have to be larger though due to the size requirements. The frame will typically be vinyl or composite and be available in a limited number of colors and options"}, {"url": "http://answers.angieslist.com/How-cost-install-Egress-Window-basement-Who-services-q61194.aspx", "passage_text": "The cost will depend a great deal on your topography around the house-if the base of the window will be above ground level at least 6 inches, then could run about $500 for a legal egress window purchase and about $1000-2000 for installation, depending on how deep into the concrete you have to cut. "}, {"url": "http://egresswindowcost.com/", "passage_text": "Mid range basement egress projects will run $2,000 to $3,000 total, which includes all the labor, materials and the cost of an egress window. Entry level egress basement projects will run somewhere in the $1,000 to $2,000 range, which includes all materials, the window and professional installation."}, {"url": "https://answers.yahoo.com/question/index?qid=20130303161531AAIEdBn", "passage_text": "Report Abuse. Depending where you live can have determine price. However, in the Midwest I would estimate the cost would be in the $1500 to $2,000.00 range. This of course depends if your foundation is high enough to install a window without digging away dirt. If dirt has to be removed to install the window the price will at least double."}, {"url": "http://egresswindowcost.com/", "passage_text": "Entry Level Egress Window Cost. Entry level egress basement projects will run somewhere in the $1,000 to $2,000 range, which includes all materials, the window and professional installation."}, {"url": "http://egresswindowcost.com/", "passage_text": "Premium Egress Windows Prices. Premium egress basement window projects will cost between $3,000 and $5,000, which includes all of the preparation and installation steps, the materials, as well as the window itself. Entry level egress basement projects will run somewhere in the $1,000 to $2,000 range, which includes all materials, the window and professional installation."}]