[{"url": "http://www.ehow.com/about_6638860_function-egg-cell_.html", "passage_text": "Features. Reproductive cells, or gametes, have half of the genetic information required to form a new individual; thus, the meeting of a sperm with an egg results in a full set of chromosomes. Mature mammalian egg cells are relatively large--0.0039 inches. in diameter--and contain many proteins and protein precursors. This is because when a sperm cell introduces its genetic information to that of the egg, the egg must respond quickly so that cell division may begin and a new organism may form. Ovulation. Egg cells are found in a special place within the body called ovaries. A woman is born with all of the egg cells she will ever have, but they do not present themselves for fertilization until after puberty. This is when ovulation first occurs."}, {"url": "http://www.answers.com/Q/Egg_cells_function", "passage_text": "The main function of egg cells is to join with male cells (sperm) for the purpose of reproduction. They also provide food for new cells that are made in the process. After a s … perm cell fertilizes an egg cell, it becomes a zygote. An egg cell, also known as an ovum, is what biologists technically refer to as a female gamete; it is the cell contributed by the female of a species, which when combined with … the male gamete or sperm, will become a zygote which is capable of growing into a new organism. 1 person found this useful."}, {"url": "http://www.online-sciences.com/the-living-organisms/the-structure-and-function-of-the-ovum-in-the-female-reproductive-system/", "passage_text": "It is very important to know that the ovum (the egg cell) is the female reproductive cell in the female reproductive system, It is large in size (as sesame seed size) due the the storage of the nutrient materials. The function of the ovum. You should know that the function of the ovum is to carry the set of chromosomes contributed by the femal and It creates the right environment to enable the fertilization by the sperm."}, {"url": "http://www.answers.com/Q/Egg_cells_function", "passage_text": "Egg cells,when fertilized with the sperm cell help with reproduction to create a baby and reproduce. The egg cell is also big and round in shape and it looks a bit like a big birds nest. An egg cell, also known as an ovum, is what biologists technically refer to as a female gamete; it is the cell contributed by the female of a species, which when combined with … the male gamete or sperm, will become a zygote which is capable of growing into a new organism. 1 person found this useful."}, {"url": "https://en.wikipedia.org/wiki/Ovum", "passage_text": "Ovum redirects here. It is not to be confused with Ovule. The egg cell, or ovum, is the female reproductive cell (gamete) in oogamous organisms. The egg cell is typically not capable of active movement, and it is much larger (visible to the naked eye) than the motile sperm cells. When egg and sperm fuse, a diploid cell (the zygote) is formed, which gradually grows into a new organism. "}, {"url": "http://study.com/academy/lesson/sperm-cell-definition-function.html", "passage_text": "A sperm cell is the male sex cell. All animals (and many other types of organisms) produce what are called sex cells. Sex cells, are the cells, that when combined, produce a completely new organism. For example, your mother and every other human female, carry egg cells (female sex cells) in their ovaries. Sperm, short for spermatozoon, is the male sex cell and, like the female egg cell, carries half of the DNA, or biological information, necessary to determine not only the type of organism, but also its characteristics. When the sperm cell and egg cell unite, an embryo is formed."}, {"url": "http://www.ehow.com/about_6638860_function-egg-cell_.html", "passage_text": "Egg cells, or ova, are the cells utilized by female organisms to reproduce offspring. In contrast, the reproductive cells used by males are referred to as sperm. In mammals, a new individual is formed when an egg from the mother and a sperm from the father come together and allow their genetic material to fuse. Ovulation. Egg cells are found in a special place within the body called ovaries. A woman is born with all of the egg cells she will ever have, but they do not present themselves for fertilization until after puberty. This is when ovulation first occurs."}, {"url": "http://www.ehow.com/about_6638860_function-egg-cell_.html", "passage_text": "Time Frame. Once inside of the fallopian tube, an egg cell has about 48 hours to live. If it is not fertilized by a sperm within this time, it will die. The follicle that released the egg is now called a corpus luteum, and it will secrete a hormone called progesterone for about two weeks after ovulation. Ovulation. Egg cells are found in a special place within the body called ovaries. A woman is born with all of the egg cells she will ever have, but they do not present themselves for fertilization until after puberty. This is when ovulation first occurs."}]