[{"url": "http://healthypets.mercola.com/sites/healthypets/archive/2013/04/29/early-rabies-vaccination.aspx", "passage_text": "I asked Dr. Dodds to first explain what California Assembly Bill AB 272 is all about. She responded that the bill was proposed by public health officials in Los Angeles County to lower the rabies vaccine age requirement for puppies in the state of California from 16 weeks to 12 weeks. There are 14 states that mandate the vaccine at 16 weeks of age, one state at five months, and several at six months. The remaining states rely on the rabies compendium, which does not say puppies should be vaccinated at 12 weeks."}, {"url": "http://pets.thenest.com/should-puppy-its-first-shots-4711.html", "passage_text": "Puppies raised by a reputable breeder or obtained through a shelter normally will have had their first shots before you get them, but typically your puppy should get his first shots when he is between six and eight weeks of age. Boosters. You puppy will need additional vaccinations after his first shots. Your vet will determine the exact schedule, but typically these booster shots are given every two to four weeks until the pup is about 16 weeks old."}, {"url": "http://puppy.lifetips.com/cat/66032/shots-required-for-puppies/index.html", "passage_text": "Rabies Shots Are Essential. Rabies shots are one of the vaccines you will need to get your new puppy. These shots can be given to puppies that are 16 weeks of age. You will also need to get a vaccine booster when your puppy is a year old. Additional boosters need to be given every three years after the first two Rabies vaccines. You're going to be firm and tell the vet that you don't need a bunch of shots when you go in for that appointment in two weeks-just the Rabies vaccine. Actually, distemper is quite serious. While it is not dangerous to all the people in your household, the way Rabies is, it is usually fatal in puppies."}, {"url": "https://answers.yahoo.com/question/index?qid=20080224100531AAZO3xq", "passage_text": "Best Answer: Puppies can safely get the Rabies vaccine at 12 weeks, however, I recommend waiting until the puppy is 16-20 weeks old. Good luck! "}, {"url": "https://answers.yahoo.com/question/index?qid=20080822072809AAIV0dO", "passage_text": "These are usually given as a combination vaccine (gives protection against several different diseases) and your pup should have three sets of this combination vaccination, given at 3 week intervals. The Rabies shot is usually give at around 14 - 16 weeks of age. Puppies are extremely susceptible to many serious, contagious dog illnesses while unvaccinated. Several of these can kill a pup very quickly. It is also illegal to have a dog who isn't vaccinated against Rabies. Asker's rating. Report Abuse. The dog gets a series of 3 or 4 combination shots, starting at 8 weeks old, and then 4 weeks later, and 4 weeks later (and sometimes one more). The rabies shot timing will depend on your local laws, generally it's given at the time of the last shot (so about 4 months), or at about 6 months."}, {"url": "http://pets.thenest.com/should-puppy-its-first-shots-4711.html", "passage_text": "Your puppy will need his first rabies shot when he’s about three to four months of age, something that usually is set by your county or town, rather than your vet. He’ll need a booster again in a year, and then once every one to three years after that. Boosters. You puppy will need additional vaccinations after his first shots. Your vet will determine the exact schedule, but typically these booster shots are given every two to four weeks until the pup is about 16 weeks old."}, {"url": "https://answers.yahoo.com/question/index?qid=20080822072809AAIV0dO", "passage_text": "Rabies is done between 12 weeks and 6 months for the first time. The other shots should have been started at 6 weeks and regular boosters. Take her to the vet. Asker's rating. Report Abuse. The dog gets a series of 3 or 4 combination shots, starting at 8 weeks old, and then 4 weeks later, and 4 weeks later (and sometimes one more). The rabies shot timing will depend on your local laws, generally it's given at the time of the last shot (so about 4 months), or at about 6 months."}, {"url": "http://www.petmd.com/dog/puppycenter/health/evr_vaccines_and_your_puppy", "passage_text": "16 weeks of age: Adminster the last combination vaccine. 12 to 16 weeks of age: Adminster rabies vaccine. The timing of this vaccine may depend on the laws in your area (since this can be a human disease, too). Confirm with your veterinarian and check your local and state laws. "}, {"url": "http://www.dogs4dogs.com/truth4dogs.html", "passage_text": "If your dog is due for a rabies shot, consult a vet trained in homeopathy if possible. Do not give a rabies shot within 2 weeks of other shots -- at least. Remain in the area for at least 30 minutes after your dog gets a rabies shot so that you can get medical help immediately in case of a reaction. "}, {"url": "http://www.vetinfo.com/rabies-shots.html", "passage_text": "Puppy vaccination regimens usually begin at between six and four weeks of age. The first vaccinations your puppy receives will be against distemper, parvovirus, and canine hepatitis. Your puppy should receive its first rabies vaccination between 16 and 26 weeks of age. While rabies is a very dangerous disease for both dogs and humans, your puppy is unlikely to catch it from another dog, due to the fact that rabies vaccinations are required by law. He is also unlikely to be exposed to wild animals carrying the disease during these first few months of his life. The age of first rabies vaccination, as well as the booster protocol, may vary somewhat in accordance with local law. A rabies booster must be administered one year later. Further rabies vaccinations must be given"}]