[{"url": "https://technet.microsoft.com/en-us/library/cc708458(v=ws.10).aspx", "passage_text": "If you choose not to automatically approve the revised version of an update, your WSUS server will use the older revision, and you must manually approve the update revision. To automatically approve revisions to updates. On the WSUS console toolbar, click Options, and then click Automatic Approval Options. Under Revisions to Updates, click Automatically approve the latest revision of the update. Under Tasks, click Save settings, and then click OK."}, {"url": "https://technet.microsoft.com/en-us/library/dd446650(v=ws.10).aspx", "passage_text": "Update Services is designed to automatically approve the most important types of updates. Using the Software Update Settings dialog, you can enable automatic approval of the following types of updates: 1  Security updates. 2  Critical updates. 3  Service packs. 4  Definition updates. 5  Windows Small Business Server update rollups."}, {"url": "https://technet.microsoft.com/en-us/library/cc708458(v=ws.10).aspx", "passage_text": "If you want to specify update classifications to automatically approve during synchronization, do the following: 1  Next to Classifications, click Add/Remove Classifications. 2  In the Add/Remove Classifications dialog box, select the update classifications that you want to automatically approve, and then click OK."}, {"url": "https://technet.microsoft.com/en-us/library/cc708458(v=ws.10).aspx", "passage_text": "When approving an update, you specify a default approval setting for the All Computers group, and any necessary settings for each computer group in the Approve Updates dialog box. If you do not approve an update, its approval status remains Not approved and your WSUS server performs no action for the update. The exceptions to this are in the Critical Updates and Security Updates classifications, which by default are automatically approved for detection after they are synchronized."}, {"url": "https://technet.microsoft.com/en-us/library/dd446650(v=ws.10).aspx", "passage_text": "Low. Automatically approve all security and definition updates. None. Do not automatically approve any updates. You can change the update level for the Server Computers group or the Client Computers group by using the Software Update Settings dialog box. For instructions about how to change the update level for computer groups, see Change software update settings."}, {"url": "https://technet.microsoft.com/en-us/library/dd446650(v=ws.10).aspx", "passage_text": "To manually approve an update that contains revised Microsoft Software License Terms. If you set an update level higher than None, Update Services automatically approves updates that match that update level. This means that you do not need to manually approve each update that matches the"}]