[{"url": "http://www.chegg.com/homework-help/questions-and-answers/quiz-chapter-12-1-avoidable-cost-cost-eliminated-whole-part-result-choosing-one-alternativ-q3498198", "passage_text": "Quiz-Chapter 12 1. An avoidable cost is a cost that can be eliminated (in whole or in part) as a result of choosing one alternative over another. A) True B) False 2. When a company has a production constraint, the product with the highest contribution margin per unit of the constrained resource should be given highest priority. A) True B) False 3. Knaack Corporation is presently making part R20 that is used in one of its products. A batch of sugar beets costs $12 to crush in the company's plant. Two intermediate products, beet fiber and beet juice, emerge from the crushing process. The beet fiber can be sold as is for $20 or processed further for $10 to make the end product industrial fiber that is sold for $26."}, {"url": "http://www.csus.edu/indiv/p/pforsichh/documents/relevantcostingvideolecture_000.pdf", "passage_text": "• The total amount of ggy ,eneral factory overhead, which is allocated on the basis of direct labor hours, would be unaffected by this decision. • The $30 unit product cost is based on 20,000 parts produced each year. • An outside supplier has offered to provide the 20,000 parts at a cost of $25 per part. In fee is not relevant the long-run these costs depend upon miles because it must be paid if Cynthia driven. drives or takes the train.At this point, we can see that some of the average cost of $0.569 per mile are relevant and others are not."}, {"url": "http://www.csus.edu/indiv/p/pforsichh/documents/relevantcostingvideolecture_000.pdf", "passage_text": "Identifying Relevant Costs Which costs and benefits are relevant in Cynthia’s decision?The decline in resale The round-trip train fare value due to additional miles is a relevant cost is clearly relevant. If she miles is a relevant cost. drives the cost can be avoided. In fee is not relevant the long-run these costs depend upon miles because it must be paid if Cynthia driven. drives or takes the train.At this point, we can see that some of the average cost of $0.569 per mile are relevant and others are not."}, {"url": "http://www.baruch.cuny.edu/sacc/documents/DecisionMakingworkshop.ppt", "passage_text": "Identifying Relevant Costs A relevant cost is a cost that differs between alternatives. An avoidable cost can be eliminated (in wholeor in part) by choosing one alternative over another. Avoidable costs are relevant costs. Unavoidable costs are irrelevant costs. The total amount of general factory overhead, which is allocated on the basis of direct labor hours, would be unaffected by this decision. The $30 unit product cost is based on 20,000 parts produced each year. An outside supplier has offered to provide the 20,000 parts at a cost of $25 per part."}, {"url": "http://www.csus.edu/indiv/p/pforsichh/documents/chap013relevantcosts.ppt", "passage_text": "Notice that this answer assumes that the fixed costs are unavoidable and that variable marketing costs must be incurred on the special order. 13-* * Northern Optical ordinarily sells the X-lens for $50. The variable production cost is $10, the fixed production cost is $18 per unit, and the variable selling cost is $1. A customer has requested a special order for 10,000 units of the X-lens to be imprinted with the customer’s logo. 13-* * The total avoidable costs of $340,000 are less than the $500,000 cost of buying the part, thereby suggesting that Essex should continue to make the part. 13-* * An opportunity cost is the benefit that is foregone as a result of pursuing a course of action."}, {"url": "http://harbert.auburn.edu/~smithts/chap013garr.pdf", "passage_text": "Quick Check 9 Northern Optical ordinarily sells the X-lens for $50. The variable production cost is $10, the fixed production cost is $18 per unit, and the variable selling cost is $1. A customer has requested a special order for 10,000 units of the X-lens to be imprinted with the customer’s logo. The monthly school parking fee is not relevant because it must be paid if Cynthia drives or takes the train.At this point, we can see that some of the average cost of $0.569 per mile are relevant and others are not.McGraw-Hill/Irwin Copyright © 2006, The McGraw-Hill Companies, Inc."}, {"url": "http://www.csus.edu/indiv/p/pforsichh/documents/relevantcostingvideolecture_000.pdf", "passage_text": "Increase in revenue (3,000 × $10) $ 30,000Increase in costs (3 000 × $8 variable cost)Increase in costs (3,000 × $8 variable cost) 24 00024,000 Increase in net income $ 6,000 Note: This answer assumes that fixed costs are unaffected by the order and that variable marketing costs must be incurred on the special order. In fee is not relevant the long-run these costs depend upon miles because it must be paid if Cynthia driven. drives or takes the train.At this point, we can see that some of the average cost of $0.569 per mile are relevant and others are not."}, {"url": "http://www.assignmentpoint.com/business/management/relevant-costs-for-decision-making.html", "passage_text": "An avoidable cost is a cost that can be eliminated, in whole or in part, by choosing one alternative over another. Avoidable costs are relevant costs. Unavoidable costs are irrelevant costs. Cost Concepts for Decision Making: A relevant cost is a cost that differs between alternatives. Identifying Relevant Costs. An avoidable cost can be eliminated, in whole or in part, by choosing one alternative over another. Avoidable costs are relevant costs. Unavoidable costs are irrelevant costs."}, {"url": "http://www.assignmenthole.com/general-questions/costs-which-can-be-eliminated-in-whole-or-in-part-if-a-particular-business-segment-is-discontinued-are-called/", "passage_text": "1. Costs which can be eliminated in whole or in part if a particular business segment is discontinued are called: a. irrelevant costs. b. sunk costs. c. opportunity costs. d. avoidable costs. 2. "}]