[{"url": "http://ambassadors.osu.edu/", "passage_text": "1 University Ambassadors primarily give full campus tours to prospective students and guests. 2  They are paid student employees of Undergraduate Admissions. 3  University Hosts primarily mingle with and welcome prospective students and guests to Ohio State. 4  They interact with families at the start of their admissions visit. 1 College-based Ambassador programs vary in responsibilities. 2  A college may need student ambassadors to serve as hosts, student panelists, desk attendants, building/lab tour guides or other assorted roles within the college."}, {"url": "http://community.mitchell.edu/StudentAmbassadors/JobDescription", "passage_text": "ESSENTIAL DUTIES AND RESPONSIBILITIES. 1  Giving tours of campus to prospective students and families. 2  Answer a multi-line phone and transfer calls to the appropriate office(s). 3  Answer/Make phone calls from or to prospective students, current students, families or other high school or college counselors. Ambassador’s show leadership, professionalism, pride and the desire to promote Mitchell College as an institution while delivering superior customer service at all times. Ambassadors give potential applicants the students’ view of college life."}, {"url": "http://community.mitchell.edu/StudentAmbassadors/JobDescription", "passage_text": "Job Description. SUMMARY: An Ambassador’s primary function is to help prospective students understand the benefits of attending Mitchell College and to recruit students who are interested in attending. Ambassador’s show leadership, professionalism, pride and the desire to promote Mitchell College as an institution while delivering superior customer service at all times. Ambassadors give potential applicants the students’ view of college life."}, {"url": "http://www.weber.edu/ambassadors/AmbassadorResponsibilities.html", "passage_text": "Our Ambassadors are student leaders who provide campus information and campus tours, staff the Student Recruitment and Orientation Office, serve as Orientation group leaders, and provide general mentoring and peer guidance to prospective students. 1 Ambassadors help staff the Student Recruitment and Orientation Office for 5 hours each week, assisting with reception, phones, mailings, meeting with students and parents, and other duties as assigned."}, {"url": "http://www.weber.edu/ambassadors/AmbassadorResponsibilities.html", "passage_text": "Ambassador Responsibilities. The Student Recruitment & Orientation Office relies heavily on the leadership and participation of its 30 Admissions Ambassadors to successfully recruit high school students to WSU. 1 Ambassadors help staff the Student Recruitment and Orientation Office for 5 hours each week, assisting with reception, phones, mailings, meeting with students and parents, and other duties as assigned."}, {"url": "http://www.samplejobdescriptions.org/student-ambassador.html", "passage_text": "1 The student ambassador of a college has to provide prospective students customer service when they come to campus in a bid to choose a college. 2  He has to answer various questions from students or their parents about the college, its courses and facilities. 1 He may have to attend workshops for ambassador professional development. 2  He will have to take part in ambassador meetings held monthly. 3  He will have to act as a guide on campus tours for prospective students of the college and their parents."}, {"url": "http://www.hgtc.edu/documents/currentstudents/clubs/StudentAmbassador.pdf", "passage_text": "Student Ambassadors provide guidance and information about Horry Georgetown Technical College to new and continuing students, their families, and other campus visitors. The responsibilities of an Ambassador include:  Representing the college in a professional and ethical manner at all times. Student Ambassador Information and Application What is a Student Ambassador? Student Ambassadors serve as representatives of HGTC for important events, including Orientation Sessions, Open Houses, Enrollment Days, Welcome Week, Group & Campus Tours, and other college-wide functions."}, {"url": "http://www.nccu.edu/Students/studentservices/becomeastudentambassador.cfm", "passage_text": "The Eagle Ambassador Program is an elite group of very special, very carefully chosen members. Eagle Ambassadors are comprised of a diverse group of students from a variety of majors and undergraduate classifications. Ambassadors serve the University by aiding in the recruiting efforts and routine affairs of the Undergraduate Admissions Office and other administrative offices as requested. Position Title: Eagle Ambassador. Primary Function. 1  To encourage prospective students to choose North Carolina Central University as their college choice. 2  To provide quality customer service to prospective students and their parents through campus tours."}, {"url": "http://www.nccu.edu/Students/studentservices/becomeastudentambassador.cfm", "passage_text": "A Senior Ambassador is responsible for conducting tours, speaking with the prospective student(s) about the student life aspect of college, their college experiences and gives them insight on how to take advantages of different student activities opportunity. Position Title: Eagle Ambassador. Primary Function. 1  To encourage prospective students to choose North Carolina Central University as their college choice. 2  To provide quality customer service to prospective students and their parents through campus tours."}]