[{"url": "http://cns.edu/program/neurosomatic-therapy.html", "passage_text": "Neurosomatic Therapy (NST) is an integrative form of manual therapy that identifies and corrects structural and biomechanical patterns in the body that cause chronic pain. Traditionally, chronic pain is treated in a way that addresses only one aspect of the condition. Whether it be massage therapy, physical therapy, or medicinal pain management, these methods fail to fully address the soft tissue causes of pain."}, {"url": "http://www.supportnst.org/", "passage_text": "Neurosomatic Therapy is an integrated manual therapy method that identifies, analyzes, and treats the biomechanical and posture issues that cause chronic pain. Through a comprehensive examination and treatment protocol, Neurosomatic Therapy can not only eliminate pain but help prevent its recurrence."}, {"url": "http://austinprimalfitness.com/about/what-is-neurosomatic-therapy/", "passage_text": "Neurosomatic Therapy (NST) is an integrative form of manual therapy that identifies and corrects structural and biomechanical patterns in the body that cause chronic pain. Chronic pain is traditionally treated in a way that does not address the underlying soft tissue causes of pain."}, {"url": "http://www.supportnst.org/ns-therapy/", "passage_text": "NST: An Integrated Approach to Therapy. Based on decades of research, Neurosomatic Therapy is a non-invasive, soft-tissue-based method of manual therapy incorporating a variety of techniques, including massage therapy and physical therapy principles."}, {"url": "http://www.supportnst.org/", "passage_text": "The mission of the Neurosomatic Therapy Foundation is to fund programs that increase the availability of Neurosomatic Therapy worldwide and advance the field by facilitating manual therapy research."}, {"url": "http://afpcenter.com/services/neurosomatic-therapy/", "passage_text": "Neuromuscular and/or Neurosomatic Therapy (NMT) is a very specialized form of manual therapy. Neuromuscular Therapy includes extensive training in the physiology of the nervous system and its effect on the muscular and skeletal systems."}, {"url": "http://www.stjohn-clarkptc.com/neurosomatic-therapy", "passage_text": "Neurosomatic Therapy (NST) is an integrative form of manual therapy that identifies and corrects structural and biomechanical patterns in the body that cause chronic pain. Chronic pain is traditionally treated in a way that does not address the underlying soft tissue causes of pain."}]