[{"url": "http://ipm.ncsu.edu/AG136/slug2.html", "passage_text": "Distribution -. The brown garden snail is native to Europe and the Mediterranean Region. It was introduced by French immigrants into California, Kentucky, Louisiana, New Mexico, Oregon, South Carolina, Texas, Utah, and Washington. Host Plants -. "}, {"url": "http://entnemdept.ufl.edu/creatures/misc/gastro/snail_eating_snails.htm", "passage_text": "1980) in California as an effective biological control agent of the brown garden snail, Cornu aspersum (Mueller, müller). 1774 relatively little is known of the other three species of-snail eating, snails two of which are less than 10 mm. long In Florida, there are three native and two introduced species of snails, belonging to five different families, that are known to feed on other snails. In addition, several introduced species of the Subulinidae are considered carnivorous, but little is known of their biology and identification is difficult. Figure 1."}, {"url": "http://www.snail-world.com/what-do-snails-eat/", "passage_text": "Snails tend to feed on a variety of items found in their natural habitat. What they will actually consume depends on where they live and the species of snail that they are. Some common items for their diet include plants, fruits, vegetables, and algae. Plants that are decaying are often a good meal for them. Seeking for calcium to get a thicker shell, snails usually will eat the dirt. Most snail species are herbivores, which means they have only a plant diet, but some species are carnivores or omnivores. You will likely find snails around your garden as this offers them plenty of fresh plants and leaves to eat."}, {"url": "https://en.wikipedia.org/wiki/Grove_snail", "passage_text": "The grove snail or brown-lipped snail (Cepaea nemoralis) is a species of air-breathing land snail, a terrestrial pulmonate gastropod mollusc. It is one of the most common species of land snail in Europe and has been introduced to North America. Cepaea nemoralis is the type species of the genus Cepaea. No doubt aided by human transport, this species is a good colonizer, and is often found in gardens, parks and abandoned land in cities. In Eastern Europe it occurs in urban areas. More recently, the grove snail has been introduced to North America, and Venezuela."}, {"url": "https://en.wikipedia.org/wiki/Helix_aspersa", "passage_text": "Cornu aspersum, known by the common name garden snail, is a species of land snail. As such it is a terrestrial pulmonate gastropod mollusc in the family Helicidae, which include the most commonly familiar land snails. Of all terrestrial molluscs, this species may well be the most widely known. The snail is relished as a food item in some areas, but it is also widely regarded as a pest in gardens and in agriculture, especially in regions where it has been introduced accidentally and where snails are not usually considered to be a menu item."}, {"url": "http://www.invadingspecies.com/invaders/invertebrates/invasive-snails/", "passage_text": "Invasive snails include a variety of gastropods invasive to areas of North America. Invasive snails, such as the channeled apple snail, Chinese mysterysnail, New Zealand mud snail and the banded mysterysnail are all non-native to North America, besides the latter which is native to eastern and southern Florida. All species were accidentally or intentionally introduced to North American waterways."}, {"url": "http://www.ehow.com/about_6575728_life-span-garden-snails.html", "passage_text": "The brown garden snail (Helix aspersa) was introduced to North America by French immigrants. This terrestrial mollusk is native to Europe and the Mediterranean. This gastronomical delight and sturdy garden pest lives two to five years. The snail's life cycle begins in moist soil. While snails are hermaphrodites, being both male and female, they require two adult snails to reproduce. Each adult snail lays up to 85 eggs, burying them 3/4 inch to 1 1/2 inches deep in the soil."}, {"url": "http://www.arkive.org/great-pond-snail/lymnaea-stagnalis/", "passage_text": "Great pond snail range. The great pond snail occurs throughout Europe, northern Asia and North America, a distribution which is likely to have been affected by the introduction of this species to garden ponds. "}, {"url": "http://www.biokids.umich.edu/critters/Storeria_dekayi/", "passage_text": "What do they look like? Brown Snakes are fairly small snakes, with a total body length of from 23 to 52.7 cm, though few Brown Snakes grow larger than 38 cm in length. They have stout bodies with large eyes and heavily keeled scales(with raised ridges along their length). Brown snakes feed largely on earthworms, snails, and slugs, but will also eat small salamanders, soft-bodied grubs, and beetles. They have specialized teeth and jaws that allow them to pull snails out of their shells and eat them. 1  Primary Diet. 2  carnivore. 3  molluscivore. 4  vermivore. 5  Animal Foods. 6  amphibians. 7  insects."}]