[{"url": "http://www.nimh.nih.gov/health/topics/depression/men-and-depression/signs-and-symptoms-of-depression/index.shtml", "passage_text": "Some people experience only a few symptoms; some people suffer many. The severity of symptoms varies among individuals and also over time. To read about the symptoms of depression and to hear what real men say about their experiences with them, click through the list below: 1  Persistent sad, anxious, or empty mood. 2  Feelings of hopelessness, pessimism. 3  Feelings of guilt, worthlessness, helplessness. 4  Loss of interest or pleasure in hobbies and activities."}, {"url": "http://psychcentral.com/lib/types-and-symptoms-of-depression/", "passage_text": "Instead, depression is characterized by a long-standing, daily feeling of sadness, hopelessness, worthlessness and emptiness."}, {"url": "http://www.healthyplace.com/depression/depression-information/signs-of-depression-depression-warning-signs/", "passage_text": "The signs of depression include markedly low or depressed mood, but this may show itself differently in different people. Signs and symptoms of depression include: 1. 1  Unexplained crying spells. 2  Negativity, a bleak feeling about the future, hopelessness."}, {"url": "http://www.medicinenet.com/depression/symptoms.htm", "passage_text": "A depressive disorder is not the same as a passing blue mood and is more than a case of persistent sadness. Symptoms of depression also include. 1  feelings of worthlessness, 2  hopelessness, 3  helplessness, 4  guilt, 5  lack of interest in daily activities, 6  irritability, 7  loss of energy, 8  loss of appetite,"}, {"url": "http://www.mayoclinic.org/diseases-conditions/depression/basics/symptoms/CON-20032977", "passage_text": "Although depression may occur only one time during your life, usually people have multiple episodes of depression. During these episodes, symptoms occur most of the day, nearly every day and may include: 1  Feelings of sadness, tearfulness, emptiness or hopelessness. 2  Angry outbursts, irritability or frustration, even over small matters. 3  Loss of interest or pleasure in most or all normal activities, such as sex, hobbies or sports."}, {"url": "http://www.medicinenet.com/depression/symptoms.htm", "passage_text": "Depression can also be caused by medications, pregnancy, postpartum state, abuse, associated illness, chronic stress, seasonal affective disorder, and other conditions. Symptoms of depression also include feelings of worthlessness, hopelessness, guilt, lack of interest in daily activities, and even thoughts of suicide."}]