[{"url": "https://www.cerebralpalsyguide.com/cerebral-palsy/prognosis/life-expectancy/", "passage_text": "Many parents have concerns about the life expectancy of their child with cerebral palsy. Life expectancy refers to the average survival time of members of a population. Because this number is the average of a larger population, an individual’s survival time may actually be longer or shorter than their life expectancy. There is no set life expectancy for cerebral palsy patients."}, {"url": "http://www.lawyershop.com/practice-areas/cerebral-palsy/life-expectancy", "passage_text": "Cerebral palsy life expectancy rates are hard to determine. People with the condition may be affected by numerous cerebral palsy complications that can affect their health and alter the course of their life. Let's examine cerebral palsy life expectancy issues more closely. Life Expectancy for Those with Cerebral Palsy. The first thing that you need to understand when examining cerebral palsy and life expectancy rates is that there are no hard and fast statistics. The life expectancy for a person with cerebral palsy can range from 30 years of age to age 60 or 70. People with rigidity and severe spasticity are likely to have shorter life expectancy, while people with mild to moderate cerebral palsy complications are likely to live longer"}, {"url": "http://www.cerebralpalsy.org/about-cerebral-palsy/life-expectancy", "passage_text": "About life expectancy. Most children with cerebral palsy can live long, happy, quality lives. Admittedly, their care may involve more visits to health care practitioners, require therapy or medications, and perhaps surgery at some point. Life Expectancy. Most children with cerebral palsy can live long, happy, quality lives. Admittedly, their care may involve more visits to the doctor, require therapy or medications, and perhaps surgery. They may be evaluated for early intervention, special education services and assistive technology"}, {"url": "http://www.birthinjuryguide.org/cerebral-palsy/life-expectancy/", "passage_text": "Although there have been no general studies of life expectancy in people with cerebral palsy, most children affected by CP live between 30 and 70 years, depending on the severity of the condition. Cerebral Palsy Life Expectancy. Cerebral palsy (CP) is a term used to describe a group of disabilities that affect a child’s ability to move as a result of birth injury to the brain."}, {"url": "http://www.abclawcenters.com/frequently-asked-questions/can-cerebral-palsy-shorten-my-childs-life-expectancy/", "passage_text": "A: Many cases of cerebral palsy do not affect the life expectancy of a child. However, severe cerebral palsy can result in certain health complications that may shorten a child’s life if proper medical care is not supplied. "}, {"url": "http://www.special-needs-hope.com/cerebral-palsy-life-expectancy.html", "passage_text": "The life expectancy for mobile, mild cerebral palsy children even approaches that of normal children. With effective therapies, early intervention, techniques, and improved care, cerebral palsy life expectancy for children across the cerebral palsy spectrum is increasing. As parents of a severely disabled cerebral palsy child, we were worried about our son's life expectancy. Our doctors were not optimistic. As you might expect, the life expectancy of cerebral palsy children correlates to the severity of their brain injury and disabilities. Children with more severe brain injury and therefore less mobility and function, typically live shorter lives."}, {"url": "http://www.cerebralpalsy.org/about-cerebral-palsy/life-expectancy/life-span", "passage_text": "About Life Span. Life span is among a parent’s immediate concerns for a child. Although life expectancy hinges on many factors, most individuals with cerebral palsy enjoy a healthy lifespan as long as life-threatening associative conditions are managed, and healthful medical care and lifestyle supports are implemented. "}, {"url": "http://www.cerebralpalsysource.com/About_CP/life_cp/index.html", "passage_text": "Doctors alone are not experts on the life expectancy for adults with cerebral palsy. Only a physician is qualified to appraise the individual, and only a statistician or actuary is qualified to relate the appraisal into a life expectancy for adults with cerebral palsy. Life expectancy for adults with cerebral palsy has many factors such as the type, severity and associated disabilities as well as the quality of care."}]