[{"url": "https://en.wikipedia.org/wiki/Type_species", "passage_text": "In zoological nomenclature, a type species (Species typica) is the species name with which the name of a genus or subgenus is considered to be permanently taxonomically associated, i.e., the species that contains the biological type specimen(s). A similar concept is used for suprageneric groups called a type genus."}, {"url": "https://www.pwrc.usgs.gov/ceetv/genussp.htm", "passage_text": "Table of Genus/Species. Click here for complete documentation for this database. 1  This table contains a list of Genus/Species that are included in the CEE-TV database to aid in querying the Genus/Species field. 2  Copy and paste the Genus and Species from this page into the search form."}, {"url": "http://www.thefreedictionary.com/genus", "passage_text": "In a scientific name, the genus name is capitalized and italicized, for example, Ovis for sheep and related animals. 2. Logic A class of objects divided into subordinate species having certain common attributes. 3. A class, group, or kind with"}, {"url": "http://oregonstate.edu/trees/genus_describe.html", "passage_text": "The genus name refers to the general type of tree (e.g. pine or Pinus), while the species name refers to the specific type of pine (e.g. sugar or lambertiana). Other pines have the same genus name in both English and Latin, but they have different species names. For example:"}, {"url": "https://en.wikipedia.org/wiki/Type_species", "passage_text": "The term type species is regulated in zoological nomenclature by article 42.3 of the International Code of Zoological Nomenclature, which defines a type species as the name-bearing type of the name of a genus or subgenus (a  genus-group name ) is the type species. In the Glossary, type species is defined as."}, {"url": "http://www.differencebetween.com/difference-between-genus-and-vs-species/", "passage_text": "Genus vs Species. Although both genus and species are referred to state a particular animal or plant or any organism, there are differences between the two that anyone should know. In biological classification, the genus comes first followed by species, and the species is never stated alone."}, {"url": "https://en.wikipedia.org/wiki/Type_species", "passage_text": "Every named genus or subgenus in zoology, whether or not currently recognized as valid, is theoretically associated with a type species. In practice, however, there is a backlog of untypified names (i.e., names which identify certain animals as belonging to separate species when in fact they belong to the same one)."}]