[{"url": "http://www.criminaldefenselawyer.com/criminal-defense-statute-of-limitations.cfm", "passage_text": "In these circumstances, the state’s three-year statute of limitations does not prevent Larry’s prosecution for burglary, because the statute of limitations was not running down during the three years that Larry was in a different state. In cases involving crimes against minors, the majority of states provide that the statute of limitations does not begin to run until the victim turns 18. The laws vary greatly state by state; any time limit for bringing an action will depend on the rules of the state where the crime was committed."}, {"url": "http://injury.findlaw.com/accident-injury-law/time-limits-to-bring-a-case-the-statute-of-limitations.html", "passage_text": "Typically, the statute of limitations in a lawsuit for injuries to a minor does not begin to run until he or she reaches the age of 18. For example, suppose Pat is injured in a car accident on his 17th birthday. The Statute of Limitations in Your State. As mentioned above, every state has enacted its own statute of limitations, requiring any personal injury suit be filed in court within a set time after the incident or injury."}, {"url": "http://www.nolo.com/legal-encyclopedia/statutes-of-limitations-lawsuit-timeline-faq-29038-5.html", "passage_text": "Once you've figured out what statute of limitations applies to your case, your next step is to determine when the clock starts ticking. In most situations the time starts to run on the date of harm -- that is, on the date when you were injured, your property was harmed, or a contract or agreement was violated. "}, {"url": "http://www.criminaldefenselawyer.com/criminal-defense-statute-of-limitations.cfm", "passage_text": "Statutes of limitations generally start to run on the date that crimes are committed. If the applicable time limit expires before criminal proceedings begin, charges should not be filed (it's up to the defendant, however, to raise the problem). In cases involving crimes against minors, the majority of states provide that the statute of limitations does not begin to run until the victim turns 18. The laws vary greatly state by state; any time limit for bringing an action will depend on the rules of the state where the crime was"}, {"url": "http://legal-dictionary.thefreedictionary.com/Statute+of+Limitations", "passage_text": "The statute of limitations is a defense that is ordinarily asserted by the defendant to defeat an action brought against him after the appropriate time has elapsed. Therefore, the defendant must plead the defense before the court upon answering the plaintiff's complaint. California also has short periods, usually one year, with two years for most property damage and oral contracts and four years for written contracts. There are also statutes of limitations on the right to enforce a judgment, ranging from five to 25 years, depending on the state."}, {"url": "http://www.creditinfocenter.com/rebuild/statuteLimitations.shtml", "passage_text": "To find out your state's statute of limitations, see our state by state listing below. If the time limit to sue on the old debt expired under your state's statute of limitations, that does not mean that a creditor or bill collector must stop contacting you about it. They can ask you to pay the debt. They just can't sue you (or threaten to sue you) for it."}, {"url": "http://www.nolo.com/legal-encyclopedia/medical-malpractice-lawsuits-the-statute-limitations.html", "passage_text": "Under the discovery rule the statute of limitations does not begin to run until a person discovers he or she has been injured. Keep in mind that this rule usually will not apply if a reasonable person should have discovered the injury within the time limit. "}, {"url": "http://injury.findlaw.com/accident-injury-law/time-limits-to-bring-a-case-the-statute-of-limitations.html", "passage_text": "However, the discovery rule may apply in some wrongful death cases. The Statute of Limitations in Your State. As mentioned above, every state has enacted its own statute of limitations, requiring any personal injury suit be filed in court within a set time after the incident or injury."}, {"url": "http://www.creditinfocenter.com/rebuild/statuteLimitations.shtml", "passage_text": "Last Updated: March 9, 2015. The statute of limitations is a rule that sets a time limit within which a creditor may sue you for payment of a debt. The length of time that a creditor has to sue you on an unpaid debt varies from state to state. In some states, it's four years. In other states, it might be longer. If the time limit to sue on the old debt expired under your state's statute of limitations, that does not mean that a creditor or bill collector must stop contacting you about it. They can ask you to pay the debt. They just can't sue you (or threaten to sue you) for it."}, {"url": "https://en.wikipedia.org/wiki/Statute_of_limitations", "passage_text": "Statutes of limitations are laws passed by a legislative body in common law systems to set the maximum time after an event when legal proceedings may be initiated. When the period of time specified in a statute of limitations passes, a claim can no longer be filed. The intention of these laws is to facilitate resolution in a reasonable length of time. In private civil matters, the limitations period may generally be shortened or lengthened by agreement of the parties. Under the Uniform Commercial Code, the parties to a contract for sale of goods may reduce the limitations period to one year but not extend it."}]