[{"url": "http://www.horsedvm.com/disease/epiglottic-entrapment/", "passage_text": "Description. Epiglottic entrapment is a condition that affects the horse's upper airway, specifically their larynx. It is a common problem in Thoroughbred and Standardbred racehorses. "}, {"url": "http://en.wikivet.net/Epiglottic_Entrapment", "passage_text": "Introduction. Epiglottic entrapment is one of the causes of respiratory noise and exercise intolerance in the horse. In this condition, the aryepiglottic fold completely envelops the apex and lateral margins of the epiglottis. The aetiology is unclear although epiglottic hypoplasia or deformity may sometimes be involved"}, {"url": "http://www.winnersranch.com/docs/Epiglottal_Entrapment.pdf", "passage_text": "Epiglottal Entrapment Epiglottic entrapment is a relatively common disorder in the throat of the horse that can produce an obstruction to airflow, resulting in a respiratory noise when the horse exercises. Epiglottic entrapment is a relatively common disorder in the throat of the horse. that can produce an obstruction to airflow, resulting in a respiratory noise when. the horse exercises. Diagnosis is made with an endoscope passed down the. horse's nose to look down the back of the throat"}, {"url": "http://vetbook.org/wiki/horse/index.php/Epiglottic_entrapment", "passage_text": "Epiglottic entrapment is a less common laryngeal disorder that causes respiratory noise and exercise intolerance in horses. More common causes include laryngeal hemiplegia, pharyngeal lymphoid hyperplasia or dorsal displacement of the soft palate. Clinical signs. Clinical signs of epiglottic entrapment include inspiratory and expiratory respiratory noise during exercise and poor exercise performance. Less common signs include cough, nasal discharge, and head shaking."}, {"url": "http://www.thehorse.com/articles/26932/new-surgical-tool-for-treating-epiglottic-entrapments-in-standing-horses", "passage_text": "An epiglottic entrapment is an upper airway abnormality that can cause poor performance in athletic horses. A team of researchers from the University of Montreal recently developed a safer instrument for surgically correcting an entrapped epiglottis. "}, {"url": "http://www.merckvetmanual.com/pethealth/horse_disorders_and_diseases/lung_and_airway_disorders_of_horses/epiglottic_entrapment_in_horses.html", "passage_text": "Epiglottic entrapment is an uncommon cause of respiratory noise and exercise intolerance. The epiglottis is a flap of tissue that, in normal situations, functions something like a “trap door” to keep food from entering the trachea and airways while the animal is swallowing. In this disease, the epiglottis is partially trapped by other tissues and cannot move normally. Signs of epiglottic entrapment include respiratory noise during exercise and poor exercise performance."}, {"url": "http://www.merckvetmanual.com/mvm/respiratory_system/respiratory_diseases_of_horses/epiglottic_entrapment_in_horses.html", "passage_text": "Epiglottic entrapment is a less common cause of respiratory noise and exercise intolerance. In this condition, the aryepiglottic fold completely envelops the apex and lateral margins of the epiglottis. The general shape of the epiglottis is visible, and the position (dorsal to the soft palate) is appropriate. However, the distinct serrated margins of the epiglottis and the dorsal epiglottic vascular pattern are obscured by a fold of aryepiglottic mucosa. Clinical signs of epiglottic entrapment include inspiratory and expiratory respiratory noise during exercise and poor exercise performance."}, {"url": "http://www.merckvetmanual.com/mvm/respiratory_system/respiratory_diseases_of_horses/epiglottic_entrapment_in_horses.html", "passage_text": "Less common signs include cough, nasal discharge, and headshaking. In mature nonracehorses, cough is the most consistent presenting complaint. Diagnosis is determined by endoscopic examination. Surgical correction of epiglottic entrapment is axial division of the aryepiglottic fold to free the epiglottis. However, the distinct serrated margins of the epiglottis and the dorsal epiglottic vascular pattern are obscured by a fold of aryepiglottic mucosa. Clinical signs of epiglottic entrapment include inspiratory and expiratory respiratory noise during exercise and poor exercise performance."}]