[{"url": "http://kids.nceas.ucsb.edu/biomes/grassland.html", "passage_text": "Sometimes the temperature is more than 100°F (37.8°C). Rain in the temperate grasslands usually occurs in the late spring and early summer. The yearly average is about 20 - 35 inches (55 - 95 cm), but much of this falls as snow in the winter. Fire is not foreign in temperate grasslands."}, {"url": "http://omartemperate.weebly.com/climate.html", "passage_text": "Sometimes the temperature is more than 100°F (37.8°C).And in winter the temperature can reach -40°C, Its amazing how cold it gets! Rain in the temperate grasslands usually occurs in the late spring and early summer. The yearly average is about 20 - 35 inches (55 - 95 cm), but much of this falls as snow in the winter."}, {"url": "http://www.ucmp.berkeley.edu/exhibits/biomes/grasslands.php", "passage_text": "Precipitation in the temperate grasslands usually occurs in the late spring and early summer. The annual average is about 50.8 to 88.9 cm (20-35 inches). The temperature range is very large over the course of the year."}, {"url": "http://alexustemperategrassland.weebly.com/weatherclimate.html", "passage_text": "Weather/ Climate. Precipitation normally occurs during the late spring, early summer. There is an annual average for precipitation: 20 to 35 inches. In the Summer temperatures average about 100 degrees fahrenheit. In the Winter tempreratures can be as low as - 40 degrees fahrenheit. The climate can affect the countries and temperate grassland becasue the climate can dry up or freeze the soil if to the right temperature."}, {"url": "http://www.defenders.org/grasslands/temperate-grasslands", "passage_text": "Climate. Temperate grasslands have hot summers and cold winters. Summer temperatures can be well over 100 degrees Fahrenheit, while winter temperatures can be as low as -40 degrees Fahrenheit. They typically have between 10 and 35 inches of precipitation a year, much of it occurring in the late spring and early summer."}]