[{"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/aqa_pre_2011/rocks/metalsrev1.shtml", "passage_text": "Ores are naturally occurring rocks that contain metal or metal compounds in sufficient amounts to make it worthwhile extracting them. For example, iron ore is used to make iron and steel. To be useful, the metals have to be extracted from whatever they are mixed with. A metal ore is a rock containing a metal, or a metal compound, in a high enough concentration to make it economic to extract the metal. The method used to extract metals from the ore in which they are found depends on their reactivity."}, {"url": "http://www.eurometaux.org/MetalsToday/MetalsFAQs/Metalsinnature.aspx", "passage_text": "Although most metal-bearing mineral compositions comprise several elements, there are a few exceptions such as gold, which is found in its elemental form as a mineral called native gold. Metals can form, or be part of, many different minerals. The number of metals (over 70 in the periodic table) and their compounds results in an enormous array of minerals. Iron, for instance, which is very abundant in nature, is found in over 1100 minerals*. The brilliant colours frequently associated with gems such as emerald, ruby and sapphire reflect the variety of metal-containing minerals."}, {"url": "http://www.weegy.com/?ConversationId=QD7SVJQO", "passage_text": "User: Naturally occurring elements or compounds found in rocks, soil, or water are called. Weegy: Naturally occurring elements or compounds found in rocks, soil, or water are called Minerals Expert answered|Marvel2|Points 2032|User: Many plants contain minerals. True False Weegy: true Many plants contain minerals. Expert answered|Marvel2|Points 2032|."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061008071036AAgBx2w", "passage_text": "Report Abuse. ALL. Metals, by their very nature occur naturally. If it is in the periodic table of elements, they occur naturally. Some combine with other metals to form-what is called-ores or oxides, or chlorides. If you are studying chemistry, it is an exciting area to learn how to extract those metals from their ore."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/aqa_pre_2011/rocks/metalsrev1.shtml", "passage_text": "Metals are very useful. Ores are naturally occurring rocks that contain metal or metal compounds in sufficient amounts to make it worthwhile extracting them. For example, iron ore is used to make iron and steel. Copper is easily extracted, but ores rich in copper are becoming more difficult to find. To be useful, the metals have to be extracted from whatever they are mixed with. A metal ore is a rock containing a metal, or a metal compound, in a high enough concentration to make it economic to extract the metal. The method used to extract metals from the ore in which they are found depends on their reactivity."}, {"url": "http://www.weegy.com/?ConversationId=QD7SVJQO", "passage_text": "Weegy: Naturally occurring elements or compounds found in rocks, soil, or water are called Selenium. Reason: Selenium is a naturally occurring element found in rocks, soil and water. Weegy: Naturally occurring elements or compounds found in rocks, soil, or water are called Minerals Expert answered|Marvel2|Points 2032|User: Many plants contain minerals. True False Weegy: true Many plants contain minerals. Expert answered|Marvel2|Points 2032|."}, {"url": "http://www.eurometaux.org/MetalsToday/MetalsFAQs/Formmetalsarefound.aspx", "passage_text": "Metals rarely occur in nature in their pure metallic state. Only gold, silver and copper (so-called native silver and copper) have been found as metals. All of the other metals occur in nature as compounds combined in structures called minerals. Rocks are composites of different minerals formed through the cooling of liquid magma, altered by the action of wind, water, glaciers and gravity, or changed through the effects of pressure and temperature as the earth evolved"}]