[{"url": "http://www.simplyhired.com/salaries-k-office-manager-law-firm-jobs.html", "passage_text": "The average salary for office manager law firm jobs is $55,000. Average office manager law firm salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term office manager law firm anywhere in the job listing."}, {"url": "http://www.simplyhired.com/salaries-k-office-coordinator-jobs.html", "passage_text": "The average salary for office coordinator jobs is $42,000. Average office coordinator salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term office coordinator anywhere in the job listing. The office coordinator salary comparisons feature allows job seekers to get the information required to make important career decisions and negotiate salary ranges. For additional office coordinator salary information, we recommend visiting Payscale.com."}, {"url": "http://www.indeed.com/salary/Office-Services-Coordinator.html", "passage_text": "$42,000. Average Office Services Coordinator salaries for job postings nationwide are 27% lower than average salaries for all job postings nationwide."}, {"url": "http://work.chron.com/nonprofit-office-coordinator-salary-27007.html", "passage_text": "They earn salaries averaging more than $30,000 annually. The average annual salary for a nonprofit office coordinator was $33,000 as of 2013, according to the job site Indeed. For example, a nonprofit office coordinator who earns $35,000 in Baton Rouge, Louisiana, would need to make $85,638 in Manhattan, New York to maintain her living standard, according to CNN Money's Cost of Living calculator."}, {"url": "http://www.indeed.com/salary/Office-Coordinator.html", "passage_text": "Average Office Coordinator salaries for job postings nationwide are 46% lower than average salaries for all job postings nationwide. "}, {"url": "http://www1.salary.com/Office-Manager-salary.html", "passage_text": "The annual salary for someone with the job title Office Manager may vary depending on a number of factors including industry, company size, location, years of experience and level of education. For example the median expected annual pay for a typical Office Manager in the United States is $69,718, so 50% of the people who perform the job of Office Manager in the United States are expected to make less than $69,718. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. 3  Benefits"}, {"url": "http://www.payscale.com/research/US/Job=Office_Coordinator/Hourly_Rate", "passage_text": "The average beginner in this position makes around $33K, but folks who have been around for five to 10 years see a markedly higher median salary of $35K. After working for 10 to 20 years, Office Coordinators make a median salary of $37K. In the end, more experience does seem to mean larger paychecks; seasoned Office Coordinators with more than 20 years of experience earn a predictably higher median salary of $39K. "}]