[{"url": "http://www.answers.com/Q/What_is_the_great_basin", "passage_text": "The Great Basin is a group of basins and mountain ranges in the western US, mostly in Nevada but also including parts of   California, Oregon, Idaho and Utah. The basin ar … ea is generally between   the Sierra and Cascade Mountains to the west and the Rocky Mountains to   the east. The Great Basin is a 200,000 square mile intermontane plateau that covers most of Nevada and more than half of Utah, as well as a couple parts of California, Idaho, Oregon & Wyoming."}, {"url": "https://en.wikipedia.org/wiki/Great_Basin_Desert", "passage_text": "The desert is a geographical region that largely overlaps the Great Basin shrub steppe defined by the World Wildlife Fund, and the Central Basin and Range ecoregion defined by the U.S. Environmental Protection Agency and United States Geological Survey. It is a temperate desert with hot, dry summers and snowy winters. The Great Basin Desert includes several arid basins lacking Larrea tridentata (chaparral) such as the  Chalfant, Hammil, Benton, and Queen valleys, as well as all but the southeast portion of the Owens Valley."}, {"url": "https://en.wikipedia.org/wiki/Great_Basin", "passage_text": "The Great Basin physiographic section is a geographic division of the Basin and Range Province defined by Nevin Fenneman in 1931. The United States Geological Survey adapted Fenneman's scheme in their Physiographic division of the United States. The section is somewhat larger than the hydrographic definition. The Great Basin's two most populous metropolitan areas are the Reno-Sparks metropolitan area to the west and Wasatch Front to the east. The region between these two areas is sparsely populated, but includes the smaller cities of Elko, Ely, Wendover, West Wendover, and Winnemucca."}, {"url": "https://en.wikipedia.org/wiki/Great_Basin_Desert", "passage_text": "The study and definition of ecoregions can also indicate the boundaries of the Great Basin Desert. In 1987, J.M. Omernik defined a desert ecoregion between the Sierra Nevada and Wasatch Range, naming it the Northern Basin and Range ecoregion. The Great Basin Desert includes several arid basins lacking Larrea tridentata (chaparral) such as the  Chalfant, Hammil, Benton, and Queen valleys, as well as all but the southeast portion of the Owens Valley."}, {"url": "http://wikitravel.org/en/Great_Basin", "passage_text": "The Great Basin is the part of the western United States that does not drain to the sea. It comprises most of Nevada and adjacent portions of eastern California, southeastern Oregon, southern Idaho, western Utah and southwestern Wyoming. Geographically, this region is bounded by the Sierra Nevada in the west, the Wasatch range in the east, the Columbia Plateau in the north, and the Mohave desert in the south. Central Wyoming's Great Divide Basin also does not drain to the sea, but is not considered to be part of the Great Basin."}, {"url": "http://www.thefreedictionary.com/Great+Basin", "passage_text": "A large self-contained drainage basin of the western United States, including most of Nevada and parts of Utah, Wyoming, Idaho, Oregon, and California. Situated in the rain shadow of the Sierra Nevada, the Great Basin is mostly arid. Great Basin. n. 1. (Placename) a semiarid region of the western US, between the Wasatch and the Sierra Nevada Mountains, having no drainage to the ocean: includes Nevada, W Utah, and parts of E California, S Oregon, and Idaho. Area: about 490 000 sq km (189 000 sq miles)."}, {"url": "http://traveltips.usatoday.com/10-great-basin-desert-101867.html", "passage_text": "The Great Basin Desert is one of four U.S. deserts, occupying a large portion of Nevada, portions of California, Oregon and Idaho, and the western desert reaches of Utah. The Great Basin’s 7 to 12 inches of annual precipitation falls throughout the year, rather than during specific seasons, and occurs primarily as snow."}, {"url": "http://traveltips.usatoday.com/10-great-basin-desert-101867.html", "passage_text": "The Great Basin's geographic boundary is defined based on either the manner in which the landscape was formed or where the water flows, also known as the land’s hydrographic features. The Great Basin Desert is defined by the plants and animals present, according to the National Park Service. The Great Basin’s 7 to 12 inches of annual precipitation falls throughout the year, rather than during specific seasons, and occurs primarily as snow."}, {"url": "http://www.answers.com/Q/What_is_the_great_basin", "passage_text": "The Great Basin is a large and Beautiful, arid region of the western United States. The Great Basin is a large region of the western US. The Great Basin is a 200,000 square mile intermontane plateau that covers most of Nevada and more than half of Utah, as well as a couple parts of California, Idaho, Oregon & Wyoming."}]