[{"url": "https://en.wikipedia.org/wiki/Gangster", "passage_text": "Some gangs are considered to be part of organized crime. Gangsters are also called mobsters, a term derived from mob and the suffix-ster. Gangs provide a level of organization and resources that support much larger and more complex criminal transactions than an individual criminal could achieve. Gangsters have been active for many years in countries around the world. Al Capone was one of the most influential gangsters during the prohibition period. Born in Williamsburg, Brooklyn in 1899 to immigrant parents, Capone was recruited by members of the Five Points Gang in the early 1920s. Capone’s childhood friend, Lucky Luciano, was also originally a member of the Five Points Gang."}, {"url": "http://www.youtube.com/watch?v=cpGbzYlnz7c", "passage_text": "Gangsta's Paradise is a rap song by Coolio featuring L.V. from the movie Dangerous Minds (1995). The song was later released on the albums Gangsta's Paradise and Dangerous Minds soundtrack in 1995. Coolio was awarded a Grammy for the song/album. "}, {"url": "http://www.thefreedictionary.com/gangster", "passage_text": "gangster. n. 1. a member of an organized gang of criminals, esp one who resorts to violence. (ˈgaeŋ ˈgæŋ). stər. n Noun. 1. gangster-a criminal who is a member of gang. mobster. gang, mob, pack, ring-an association of criminals; police tried to break up the gang; a pack of thieves."}, {"url": "http://www.urbandictionary.com/define.php?term=Gangster", "passage_text": "Gangster. There are two types of gangster: 1) A wannabe thug, often illiterate and an inhabitant of a downtrodden ghetto that hangs around in gangs; largely associated with the African-American subculture. An utter degradation of what true gangsters represent (see below), and street wannabe gangsta-types don't hold a candle to what real gangsters are. 2) The *real* gangsters are those behind organised crime; most notably the Mafia."}, {"url": "http://www.merriam-webster.com/dictionary/gangster", "passage_text": "Full Definition of GANGSTER. : a member of a gang of criminals: racketeer. — gang·ster·dom \\-dəm\\ noun. — gang·ster·ish \\-stə-rish\\ adjective. — gang·ster·ism \\-stə-ˌri-zəm\\ noun. See gangster defined for English-language learners. See gangster defined for kids. "}, {"url": "https://en.wikipedia.org/wiki/Gangster", "passage_text": "Some gangsters, such as Al Capone, have become infamous. Gangsters are the subject of many movies, particularly from the period between 1930 and 1990. Contemporary criminals often refer to themselves as gangsta in reference to non-rhotic Black American pronunciation. Al Capone was one of the most influential gangsters during the prohibition period. Born in Williamsburg, Brooklyn in 1899 to immigrant parents, Capone was recruited by members of the Five Points Gang in the early 1920s. Capone’s childhood friend, Lucky Luciano, was also originally a member of the Five Points Gang."}, {"url": "http://www.answers.com/Q/What_is_gangster_discipline", "passage_text": "Share to: The Imperial Gangster Nation is a gang that is apart of the Folk Nation, Imperial Gangsters formed on the north side of Chicago, IL in the mid to late 1960's. What is an imperial gangster? The Imperial Gangster Nation is a gang that is apart of the Folk Nation, Imperial Gangsters formed on the north side of Chicago, IL in the mid to late 1960's."}, {"url": "https://en.wikipedia.org/wiki/Gangster", "passage_text": "In modern usage, the term  gang  is generally used for a criminal organization, and the term gangster invariably describes a criminal. Much has been written on the subject of gangs, although there is no clear consensus about what constitutes a gang or what situations lead to gang formation and evolution. Al Capone was one of the most influential gangsters during the prohibition period. Born in Williamsburg, Brooklyn in 1899 to immigrant parents, Capone was recruited by members of the Five Points Gang in the early 1920s. Capone’s childhood friend, Lucky Luciano, was also originally a member of the Five Points Gang."}, {"url": "http://onlineslangdictionary.com/meaning-definition-of/gangster", "passage_text": "1 A gangsta (gangster) is usually a killer, a thug or a hoodlum who has no regard for the law or even other people's lives. 2  Someone who takes over by force. 3  Something that is or someone who is gangsta (gangster) poses a threat to people's lives. 4  He does whatever he wants-he's gangsta with it. 1 It was gangsta how he slapped the shit out of that dude when he didn't tell him what he wanted to know. 2 "}]