[{"url": "http://www.babynamespedia.com/meaning/Davina", "passage_text": "[ 3 syll. da-vi-na, dav-ina ] The baby girl name Davina is pronounced D-ahV IY-Naa- †. Davina's language of origin is Hebrew. It is predominantly used in Scottish and English. It is a biblical name derived from the word dod with the meaning 'beloved, favorite, darling, friend'. The name originated in Scotland in the early 20th century, and it has acquired somewhat aristocratic associations. "}, {"url": "http://www.sheknows.com/baby-names/name/davina", "passage_text": "The name Davina is a Hebrew baby name. In Hebrew the meaning of the name Davina is: Cherished. American Meaning: The name Davina is an American baby name. In American the meaning of the name Davina is: Cherished. Feminine of David. Scottish Meaning: The name Davina is a Scottish baby name. In Scottish the meaning of the name Davina is: Beloved or friend. Feminine form of David.Feminine form of David: Beloved or friend, adopted from the Hebrew."}, {"url": "http://www.meaning-of-names.com/hebrew-names/davina.asp", "passage_text": "Meaning of Davina. Hebrew name. In Hebrew, the name Davina means-Cherished.. Other origins for the name Davina include-Hebrew, Irish, Scottish, English.The name Davina is most often used as a girl name or female name. Hebrew Name Meaning-Cherished. Origin-Hebrew."}, {"url": "http://www.thenamemeaning.com/davina/", "passage_text": "Davina Name Meaning. The meaning of Davina is “Beloved”. Keep in mind that many names may have different meanings in other countries and languages, so be careful that the name that you choose doesn’t mean something bad or unpleasant. This doesn't mean that the name Davina is not popular in other countries all over the world. The name might be popular in other countries, in different languages, or even in a different alphabet, as we use the characters from the Latin alphabet to display the data. A derivative of the name might also be popular in US"}, {"url": "http://www.thinkbabynames.com/meaning/0/Davina", "passage_text": "Davina /dav-ina/ [3 sylls.] as a girls' name is pronounced dah-VEE-nah. It is of Scottish and Hebrew origin, and the meaning of Davina is beloved. Feminine of David. Kreatif forms: Deavina, Duvina. Davina is alike in pronunciation to Davonna, Devana and Devona. Other recommended similar baby names are Dafna, Daina, Dalina, Daphna, Darina, Devin ▼ , Divine, Gavina, Lavina ▼ , Mavina, Ravina and Savina. These names tend to be less frequently used than Da"}, {"url": "http://www.thenamemeaning.com/davina/", "passage_text": "The first thing you should know if you are considering Davina for your baby's name is that in most countries all over the world the name Davina is a girl name. The name Davina is of Hebrew origin, and is used mostly in English speaking countries but also in a few other countries and languages of the world. This doesn't mean that the name Davina is not popular in other countries all over the world. The name might be popular in other countries, in different languages, or even in a different alphabet, as we use the characters from the Latin alphabet to display the data. A derivative of the name might also be popular in US"}, {"url": "http://www.sheknows.com/baby-names/name/davina", "passage_text": "The name Davina is an English baby name. In English the meaning of the name Davina is: Beloved. Feminine of David. Scottish Meaning: The name Davina is a Scottish baby name. In Scottish the meaning of the name Davina is: Beloved or friend. Feminine form of David.Feminine form of David: Beloved or friend, adopted from the Hebrew."}, {"url": "http://www.thenamemeaning.com/davina/", "passage_text": "Search comprehensively and find the name meaning of Davina and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Davina and check the initials of the name with your last name to discover how it looks and sounds. This doesn't mean that the name Davina is not popular in other countries all over the world. The name might be popular in other countries, in different languages, or even in a different alphabet, as we use the characters from the Latin alphabet to display the data. A derivative of the name might also be popular in US"}]