[{"url": "http://www.1913intel.com/2009/11/04/why-did-the-attack-on-pearl-harbor-happen/", "passage_text": "It was intended as a preventive action to keep the U.S. Pacific Fleet from influencing the war the Empire of Japan was planning to wage in Southeast Asia against Britain, the Netherlands, and the United States. Pearl Harbor Considered. The attack on Pearl Harbor was a preventive or pre-emptive strike to keep the U.S. Pacific Fleet from influencing the war the Empire of Japan was planning to wage in Southeast Asia."}, {"url": "https://en.wikipedia.org/wiki/Attack_on_Pearl_Harbor", "passage_text": "There were near-simultaneous Japanese attacks on the U.S.-held Philippines, Guam and Wake Island and on the British Empire in Malaya, Singapore, and Hong Kong. The attacks-from troop landings at Kota Bharu, Malaya, to the air attacks ranging geographically from Hong Kong to Pearl Harbor-took place over seven hours. Preliminary planning for an attack on Pearl Harbor to protect the move into the Southern Resource Area (the Japanese term for the Dutch East Indies and Southeast Asia generally) had begun very early in 1941 under the auspices of Admiral Isoroku Yamamoto, then commanding Japan's Combined Fleet."}, {"url": "http://history1900s.about.com/od/worldwarii/a/Attack-Pearl-Harbor.htm", "passage_text": "On the morning of December 7, 1941, the Japanese attack on Pearl Harbor began. At 6:00 a.m., the Japanese aircraft carriers began launching their planes amid rough sea. In total, 183 Japanese aircraft took to the air as part of the first wave of the attack on Pearl Harbor. (The Colorado, the only other battleship of the U.S.'s Pacific fleet, was not at Pearl Harbor that day.). Since the Japanese attack was a total surprise, many of the first torpedoes and bombs dropped on the unsuspecting ships hit their targets."}, {"url": "https://en.wikipedia.org/wiki/Attack_on_Pearl_Harbor", "passage_text": "The attack on Pearl Harbor was a surprise military strike by the Imperial Japanese Navy against the United States naval base at Pearl Harbor, in the United States Territory of Hawaii, on the morning of December 7, 1941. The attack led to the United States' entry into World War II. Preliminary planning for an attack on Pearl Harbor to protect the move into the Southern Resource Area (the Japanese term for the Dutch East Indies and Southeast Asia generally) had begun very early in 1941 under the auspices of Admiral Isoroku Yamamoto, then commanding Japan's Combined Fleet."}, {"url": "http://www.answers.com/Q/Why_did_the_attack_on_Pearl_Harbor_happen", "passage_text": "During the attack on Pearl Harbor in Hawaii, the Japanese used war  planes and submarines to bomb the United States Naval Base there.  Many people lost their lives that day. … Some of them were caught on  a ship that sank in the harbor known as the USS Arizona. The attack  happened on December 6, 1941. 1 A Brief Look at the History of Pearl Harbor If you ask anyone about Pearl Harbor, he or she will probably delve into a description of the Japanese attack on it that initiated US involvement in World War II."}, {"url": "http://www.ducksters.com/history/world_war_ii/pearl_harbor_attack.php", "passage_text": "The Attack on Pearl Harbor happened on December 7th, 1941. Japanese airplanes made a surprise attack on the US Navy in Pearl Harbor. They destroyed many ships and killed many soldiers. It was this attack that forced the United States to enter World War II."}, {"url": "https://en.wikipedia.org/wiki/Attack_on_Pearl_Harbor", "passage_text": "Japan intended the attack as a preventive action to keep the U.S. Pacific Fleet from interfering with military actions the Empire of Japan planned in Southeast Asia against overseas territories of the United Kingdom, the Netherlands, and the United States. Preliminary planning for an attack on Pearl Harbor to protect the move into the Southern Resource Area (the Japanese term for the Dutch East Indies and Southeast Asia generally) had begun very early in 1941 under the auspices of Admiral Isoroku Yamamoto, then commanding Japan's Combined Fleet."}, {"url": "http://www.pearlharbor.org/history-of-pearl-harbor.asp", "passage_text": "The Japanese attack brought the U.S. into the war on December 8 and brought it in the war determined to fight to the finish. Casualty List - 2,500 dead-sorted by ship/location. The Wall Street Journal (1941) on Pearl Harbor Reprints of op-ed material from Dec. 8, 1941. "}, {"url": "http://www.answers.com/Q/Why_did_the_attack_of_Pearl_Harbor_happen", "passage_text": "Answer Pearl Harbor is a military base the Japanese attacked in Hawaii. Pearl Harbor was located in the US Territory of Hawaii.. Hawaii and Alaska were NOT states back the … n. Answer The Japanese attack on Pearl Harbor on the morning of December 7, 1941. Pearl Harbor is a harbor on the island of Oahu, Hawaii. During the attack on Pearl Harbor in Hawaii, the Japanese used war  planes and submarines to bomb the United States Naval Base there.  Many people lost their lives that day. … Some of them were caught on  a ship that sank in the harbor known as the USS Arizona. The attack  happened on December 6, 1941"}]