[{"url": "http://www.biography.com/people/ruby-dee-9269542", "passage_text": "Synopsis. Born in Ohio in 1922, actress Ruby Dee grew up in Harlem and joined the American Negro Theatre in 1941. She is well known for collaborations with her husband, actor Ossie Davis. Dee's film career spans a generation and includes 1950's The Jackie Robinson Story, 1961's A Raisin in the Sun and 1988's Do the Right Thing."}, {"url": "http://www.biography.com/people/ruby-bridges-475426", "passage_text": "Early Life. Ruby Nell Bridges was born on September 8, 1954, in Tylertown, Mississippi, and grew up on the farm her parents and grandparents sharecropped in Mississippi. When she was 4 years old, her parents, Abon and Lucille Bridges, moved to New Orleans, hoping for a better life in a bigger city. Ruby Bridges-Norman Rockwell Painting at the White House (TV-14; 1:37) Ruby Bridges visited President Barack Obama to see Norman Rockwell's painting hanging outside of the Oval Office. The painting depicts her walk to school on the day of school integration in New Orleans. Video courtesy of the White House."}, {"url": "https://en.wikipedia.org/wiki/Ruby_Hunter", "passage_text": "Ruby Charlotte Margaret Hunter (31 October 1955 – 17 February 2010) was an Australian singer, songwriter and guitarist. She was a member of the Ngarrindjeri Aboriginal nationality, and often performed with her partner, Archie Roach, (AM), whom she met at the age of 16, while both were homeless teenagers. Hunter first performed in public in 1988 during a festival at Sydney's Bondi Pavilion in Sydney, where she performed Proud, Proud Woman, the first song she had written. In 2010, she wrote the autobiographical Down City Streets, which was performed by her partner Archie Roach on his debut solo album Charcoal Lane."}, {"url": "http://murundakdocumentary.com/artists/ruby-hunter/", "passage_text": "Ruby has played alongside Joan Armatrading, Tracy Chapman, and Bob Dylan, and performed at the prestigious Brooklyn Academy of Music Festival and in recent years has collaborated with Archie and composer Paul Grabowsky on several projects, notably the Australian Art Orchestra project ‘Ruby’s Story’. MURUNDAK-SONGS OF FREEDOM. Ruby Hunter is a Ngarrindjeri/Kukatha/Pitjantjatjara woman from South Australia who was taken from her Aboriginal family at 8 years of age and fostered into a white family."}, {"url": "http://murundakdocumentary.com/artists/ruby-hunter/", "passage_text": "Archie recorded Ruby’s song ‘Down City Streets’ on his debut album but Ruby became the first Aboriginal woman to release a solo album in 1994 with her debut ‘Thoughts Within’. Her second album ‘Feeling Good’ was released in 2000 and garnered Ruby Best Female Performer of the Year at the Deadly Awards. MURUNDAK-SONGS OF FREEDOM. Ruby Hunter is a Ngarrindjeri/Kukatha/Pitjantjatjara woman from South Australia who was taken from her Aboriginal family at 8 years of age and fostered into a white family."}, {"url": "http://www.softschools.com/timelines/ruby_bridges_timeline/49/", "passage_text": "Ruby Bridges Timeline Timeline Description: Ruby Bridges is best known for being the first black child to attend an all-white school. She didn't stop there, though. Ruby went on to work actively in the Civil Rights Movement, and her contribution to society lives on. This is a timeline of her life. Date Event 1954 Ruby is born Ruby Bridges was born in Mississippi, on a farm where her parents worked. 1995 A biography is published A biography of Ruby's life was put out. It was titled The Story of Ruby Bridges. 1998 A film about her Disney produced a movie about Ruby and her courageous story. It aired for the first time in 1998 as"}, {"url": "https://en.wikipedia.org/wiki/Ruby_Hunter", "passage_text": "Ruby Hunter died of a heart attack on 17 February 2010, aged 54. Her partner Archie Roach established Ruby's Foundation to continue her legacy. The foundation is dedicated to creating opportunities for Aboriginal people through the promotion, celebration and support of Aboriginal arts and culture. Hunter first performed in public in 1988 during a festival at Sydney's Bondi Pavilion in Sydney, where she performed Proud, Proud Woman, the first song she had written. In 2010, she wrote the autobiographical Down City Streets, which was performed by her partner Archie Roach on his debut solo album Charcoal Lane."}, {"url": "http://www.biography.com/people/ruby-dee-9269542", "passage_text": "That same year, Dee and Davis won a Grammy Award (best spoken word album) for the audio version of With Ossie and Ruby. Continuing to work, despite her grief, Dee delivered one of her great performances in 2007's American Gangster. She is well known for collaborations with her husband, actor Ossie Davis. Dee's film career spans a generation and includes 1950's The Jackie Robinson Story, 1961's A Raisin in the Sun and 1988's Do the Right Thing."}, {"url": "http://www.biography.com/people/ruby-dee-9269542", "passage_text": "Ruby Dee was an American actress, playwright, screenwriter, activist, poet and journalist, perhaps best known for starring in the 1961 film A Raisin in the Sun. She's also known for her civic work with husband Ossie Davis. She is well known for collaborations with her husband, actor Ossie Davis. Dee's film career spans a generation and includes 1950's The Jackie Robinson Story, 1961's A Raisin in the Sun and 1988's Do the Right Thing."}]