[{"url": "https://en.wikipedia.org/wiki/Ants", "passage_text": "Their ability to exploit resources may bring ants into conflict with humans, however, as they can damage crops and invade buildings. Some species, such as the red imported fire ant (Solenopsis invicta), are regarded as invasive species, establishing themselves in areas where they have been introduced accidentally. Ant colonies can be long-lived. The queens can live for up to 30 years, and workers live from 1 to 3 years. Males, however, are more transitory, being quite short-lived and surviving for only a few weeks. Ant queens are estimated to live 100 times as long as solitary insects of a similar size."}, {"url": "https://en.wikipedia.org/wiki/Ants", "passage_text": "Ants are eusocial insects of the family Formicidae /fɔrˈmɪsɨdiː/ and, along with the related wasps and bees, belong to the order Hymenoptera. Ants evolved from wasp-like ancestors in the mid-Cretaceous period between 110 and 130 million years ago and diversified after the rise of flowering plants. Ant colonies can be long-lived. The queens can live for up to 30 years, and workers live from 1 to 3 years. Males, however, are more transitory, being quite short-lived and surviving for only a few weeks. Ant queens are estimated to live 100 times as long as solitary insects of a similar size."}, {"url": "http://www.extension.umn.edu/garden/insects/find/what%2Dto%2Ddo%2Dabout%2Dhousehold%2Dants/", "passage_text": "Ants are one of the most common pests in and around homes in the north central states. Ants are social insects and are divided up into three castes: workers, males, and queens (figure 1). Workers are sterile, wingless females which range in size from 1/20 inch long to about 1/2 inch long. Description: Some species of carpenter ants are the largest ants in the north central states. They are black, or red and black; workers range in size from 3/16 to 1/2 inch. Colonies consist of major and minor workers."}, {"url": "http://pestworldforkids.org/pest-guide/ants/", "passage_text": "Depending on the species, ant colonies can consist of millions of ants. There are three kinds of ants in a colony: The queen, the female workers, and males. The queen and the males have wings, while the workers don’t have wings. The queen is the only ant that can lay eggs. 1 There are more than 12,000 species of ants all over the world. 2  An ant can lift 20 times its own body weight. 3  If a second grader was as strong as an ant, she would be able to pick up a car! 4  Some queen ants can live for many years and have millions of babies! 5  Ants don’t have ear"}, {"url": "http://www.biokids.umich.edu/critters/Formicidae/", "passage_text": "Ants are skinny insects. Like their relatives the wasps, they have a narrow connection between their abdomen and thorax. They have chewing mouthparts, and their antennae are bent in the middle. Some ant species are very tiny (1-2mm long), but some tropical species are very large (30 mm). Most species are 5-15 mm long. "}, {"url": "https://en.wikipedia.org/wiki/Sugar_ant", "passage_text": "(Redirected from Sugar ant). Carpenter ants (Camponotus spp.), also known as sugar ants, are large (0.3 to 1.0 in or 0.76 to 2.54 cm) ants indigenous to many forested parts of the world. They build nests inside wood consisting of galleries chewed out with their mandibles, preferably in dead, damp wood. "}, {"url": "http://www.orkin.com/ants/little-black-ants/", "passage_text": "Appearance. Little black ants are small and dark-brown, black or jet black in color and are a native species found throughout the United States. The workers are as small as 1.5 mm in length, and queens can measure up to 4 mm. Their antennae consist of 12 segments and end in a three-segmented club. "}, {"url": "https://en.wikipedia.org/wiki/Ants", "passage_text": "Nearly all ant colonies also have some fertile males called drones and one or more fertile females called  queens . The colonies are described as superorganisms because the ants appear to operate as a unified entity, collectively working together to support the colony. Ant colonies can be long-lived. The queens can live for up to 30 years, and workers live from 1 to 3 years. Males, however, are more transitory, being quite short-lived and surviving for only a few weeks. Ant queens are estimated to live 100 times as long as solitary insects of a similar size."}]