[{"url": "http://wgnhs.uwex.edu/water-environment/karst-sinkholes/", "passage_text": "“Karst” is a landscape created when water dissolves rocks. In Wisconsin, dolomite and some limestone are typical soluble rocks. The rocks are dissolved mostly along fractures and create caves and other conduits that act as underground streams. "}, {"url": "http://geomaps.wr.usgs.gov/parks/cave/karst.html", "passage_text": "Our paper model shows features normally associated with karst topography. Sinkholes (also known as dolines) are surface depressions formed by either: 1) the dissolution of bedrock forming a bowl-shaped depression, or 2) the collapse of shallow caves that were formed by dissolution of the bedrock. Permeable bedrock makes a good aquifer, a rock layer that holds and conducts water. If the ground water that flows through the underlying permeable bedrock is acidic and the bedrock is soluble, a distinctive type of topography, karst topography, can be created."}, {"url": "https://en.wikipedia.org/wiki/List_of_karst_areas", "passage_text": "From Wikipedia, the free encyclopedia. Karst topography is a geological formation by the dissolution of a layer or layers of soluble bedrock, usually carbonate rock such as limestone or dolomite, but also in gypsum. It has also been documented for weathering-resistant rocks, such as quartzite, given the right conditions. "}, {"url": "http://www.goodearthgraphics.com/virtcave/karst/karst.html", "passage_text": "Karst is a term used to describe the distinctive surface landscapes of cave country, shaped by dissolution of soluble bedrocks such as limestone, dolomite, or gypsum. The surface character of karst results from both surface dissolution of exposed bedrock and dissolution beneath the surface as caves are formed. "}, {"url": "https://en.wikipedia.org/wiki/Karst", "passage_text": "Karst topography is a landscape formed from the dissolution of soluble rocks such as limestone, dolomite, and gypsum. It is characterized by underground drainage systems with sinkholes, dolines, and caves. It has also been documented for weathering-resistant rocks, such as quartzite, given the right conditions. "}, {"url": "http://geomaps.wr.usgs.gov/parks/cave/karst.html", "passage_text": "Our paper model represents another type of karst landscape, that of a rolling limestone plain such as is found in south-central Kentucky, northern Florida, and the Highland Rim of central Tennessee where doline karst is the dominate feature. Doline karst is the most widely distributed type of karst landscape. The landscape is dotted with sinkholes (dolines) which can vary widely in number and size. For the Sinkhole Plain in central Kentucky, there are approximately 5.4 sinkholes per square kilometer over a 153 square kilometer area. Permeable bedrock makes a good aquifer, a rock layer that holds and conducts water. If the ground water that flows through the underlying permeable bedrock is acidic and the bedrock is soluble, a distinctive type of topography, karst topography, can be created."}, {"url": "http://geography.about.com/od/physicalgeography/a/karst.htm", "passage_text": "Karst topography can also be found extensively in the Shan Plateau of China, Nullarbor Region of Australia, the Atlas Mountains of northern Africa, the Appalachian Mountains of the U.S., Belo Horizonte of Brazil, and the Carpathian Basin of Southern Europe. Limestone, with its high calcium carbonate content, is easily dissolved in the acids produced by organic materials. About 10% of the earth's land (and 15% of the United States') surface consists of soluble limestone, which can be easily dissolved by the weak solution of carbonic acid found in underground water."}, {"url": "http://geomaps.wr.usgs.gov/parks/cave/karst.html", "passage_text": "Large drainage systems in karst areas are likely to have both fluvial (surface) and karst (underground) drainage components. As stated in the introduction, the term karst describes a distinctive topography that indicates dissolution of underlying rocks by surface water or ground water. Permeable bedrock makes a good aquifer, a rock layer that holds and conducts water. If the ground water that flows through the underlying permeable bedrock is acidic and the bedrock is soluble, a distinctive type of topography, karst topography, can be created."}, {"url": "http://www.uky.edu/KGS/water/general/karst/karst_landscape.htm", "passage_text": "Technical Definition of Karst: A terrain, generally underlain by limestone or dolomite, in which the topography is chiefly formed by the dissolving of rock and which may be characterized by sinkholes, sinking streams, closed depressions, subterranean drainage, and caves. The term karst describes the whole landscape, not a single sinkhole or spring. A karst landscape most commonly develops on limestone, but can develop on several other types of rocks, such as dolostone (magnesium carbonate or the mineral dolomite), gypsum, and salt."}, {"url": "http://www.uky.edu/KGS/water/general/karst/karst_landscape.htm", "passage_text": "KGS Home Water Karst. Karst Is a Landscape. A karst landscape has sinkholes, sinking streams, caves, and springs. The term karst is derived from a Slavic word that means barren, stony ground. It is also the name of a region in Slovenia near the border with Italy that is well known for its sinkholes and springs. The term karst describes the whole landscape, not a single sinkhole or spring. A karst landscape most commonly develops on limestone, but can develop on several other types of rocks, such as dolostone (magnesium carbonate or the mineral dolomite), gypsum, and salt."}]