[{"url": "http://animals.nationalgeographic.com/animals/birds/laughing-kookaburra/", "passage_text": "Native to the eucalyptus forests of eastern Australia, the laughing kookaburra is the largest member of the Kingfisher family, with females weighing up to one pound (455 grams) and growing to 18 inches (45 centimeters) in length. Size relative to a 6-ft (2-m) man: The laughing kookaburra is well known both as a symbol of Australia’s birdlife and as the inspirational “merry, merry king of the bush” from the children’s song."}, {"url": "http://www.bioexpedition.com/laughing-kookaburra/", "passage_text": "Laughing Kookaburra Description. The body of the Laughing Kookaburra is round and short. They are a very light brownish color with areas of darker brown on their feathers and the top of the head. They also have dark brown under their eyes. They have some areas of white in the middle of the wings and underneath"}, {"url": "http://www.answers.com/Q/What_kind_of_animal_is_a_kookaburra", "passage_text": "The kookaburra is a bird, a native Australian species of kingfisher, also found in New Guinea and on the Aru islands of southeastern Indonesia. There are four species, one of … which is also known as the laughing jackass (but not by Australians). A Kookaburra is a bird with a large, straight and very strong beak,  with which they capture their prey. They do not have teeth. They  feed on lizards, snakes and other smal … l animals."}, {"url": "http://animals.nationalgeographic.com/animals/birds/laughing-kookaburra/", "passage_text": "Laughing Kookaburra. Dacelo gigas. At up to 18 inches (46 centimeters) in length, the laughing kookaburra is the largest member of the Kingfisher family. Their stout beaks can grow to 4 inches (10 centimeters). Size relative to a 6-ft (2-m) man: The laughing kookaburra is well known both as a symbol of Australia’s birdlife and as the inspirational “merry, merry king of the bush” from the children’s song."}, {"url": "https://en.wikipedia.org/wiki/Laughing_kookaburra", "passage_text": "The laughing kookaburra is a stout, stocky bird of about 45 cm (18 in) in length, with a large head, prominent brown eyes, and a very large bill. The sexes are very similar, although the female averages larger and has less blue to the rump than the male. Native to eastern Australia, it has also been introduced to parts of New Zealand, Tasmania and Western Australia. Male and female adults are similar in plumage, which is predominantly brown and white. A common and familiar bird, this species of kookaburra is well known for its laughing call."}, {"url": "https://en.wikipedia.org/wiki/Laughing_kookaburra", "passage_text": "The laughing kookaburra (Dacelo novaeguineae) is a carnivorous bird in the kingfisher family Halcyonidae. Native to eastern Australia, it has also been introduced to parts of New Zealand, Tasmania and Western Australia. Male and female adults are similar in plumage, which is predominantly brown and white. A common and familiar bird, this species of kookaburra is well known for its laughing call."}, {"url": "http://www.itsnature.org/air/birds-air/kookaburra/", "passage_text": "Kookaburra. Kookaburras are extremely large kingfisher type birds which are native to Australia. The name kookaburra is the call that the bird actually makes hence its name. "}, {"url": "https://en.wikipedia.org/wiki/Kookaburra", "passage_text": "Kookaburras are terrestrial tree kingfishers of the genus Dacelo native to Australia and New Guinea, which grow to between 28–42 cm (11–17 in) in length. The name is a loanword from Wiradjuri guuguubarra, onomatopoeic of its call. The kookaburra's loud call sounds like echoing human laughter. They are found in habitats ranging from humid forest to arid savanna, as well as in suburban areas with tall trees or near running water. Even though they belong to the larger group known as  kingfishers , kookaburras are not closely associated with water."}]