[{"url": "http://www.poets.org/poetsorg/poet/alice-walker", "passage_text": "1944- , Eatonton, GA, United States. Poet, essayist, and novelist Alice Walker was born February 9, 1944, in Eatonton, Georgia, the eighth and last child of sharecroppers Willie Lee and Minnie Lou Grant Walker. She attended Spelman College and received a B.A. from Sarah Lawrence College. "}, {"url": "http://www.biography.com/people/alice-walker-9521939", "passage_text": "Synopsis. Alice Walker was born on February 9, 1944, in Eatonton, Georgia. She worked as a social worker, teacher and lecturer, and took part in the 1960s Civil Rights Movement in Mississippi. Walker won the 1983 Pulitzer Prize for Fiction for her 1982 novel, The Color Purple, and is also an acclaimed poet and essayist. Novelist, poet and feminist Alice Malsenior Walker was born on February 9, 1944, in Eatonton, Georgia. Alice Walker is one of the most admired African-American writers working today. The youngest daughter of sharecroppers, she grew up poor. Her mother worked as a maid to help support the family's eight children"}, {"url": "https://en.wikipedia.org/wiki/Alice_Walker", "passage_text": "Walker was born in Putnam County, Georgia, the youngest of eight children, to Willie Lee Walker and Minnie Lou Tallulah Grant. Her father, who was, in her words, wonderful at math but a terrible farmer, earned only $300 ($4,000 in 2013 dollars) a year from sharecropping and dairy farming. "}, {"url": "http://www.poemhunter.com/alice-walker/biography/", "passage_text": "Biography of Alice Walker. Walker was born in Eatonton, Georgia, the youngest of eight children, to Willie Lee Walker and Minnie Lou Tallulah Grant. Her father, who was, in her words, wonderful at math but a terrible farmer, earned only $300 a year from sharecropping and dairy farming"}, {"url": "http://www.notablebiographies.com/Tu-We/Walker-Alice.html", "passage_text": "Alice Malsenior Walker was born on February 9, 1944, in Eatonton, Georgia, to Willie Lee and Minnie Tallulah (Grant) Walker. Born: February 9, 1944 Eatonton, Georgia. African American novelist. Pulitzer Prize-winning novelist Alice Walker is best known for her stories about African American women who achieve heroic stature within the borders of their ordinary day-to-day lives."}, {"url": "http://www.imdb.com/name/nm0907504/bio", "passage_text": "Mini Bio (1). Alice Walker was born on February 9, 1944 in Eatonton, Georgia, USA as Alice Malsenior Walker. She is a writer, known for The Color Purple (1985), Long Distance Revolutionary: A Journey with Mumia Abu-Jamal (2012) and Conversations with the Ancestors: 'The Color Purple' from Book to Screen (2003). "}, {"url": "http://www.notablebiographies.com/Tu-We/Walker-Alice.html", "passage_text": "Early life. Alice Malsenior Walker was born on February 9, 1944, in Eatonton, Georgia, to Willie Lee and Minnie Tallulah (Grant) Walker. Like many of Walker's fictional characters, she was the daughter of a sharecropper (a farmer who rents his land), and the youngest of eight children. Born: February 9, 1944 Eatonton, Georgia. African American novelist. Pulitzer Prize-winning novelist Alice Walker is best known for her stories about African American women who achieve heroic stature within the borders of their ordinary day-to-day lives."}]