[{"url": "http://www.definitions.net/definition/sifu", "passage_text": "Sifu. Sifu or shīfu is the identical pronunciation of two Chinese terms for a master: 師傅 and 師父. The character 師 means teacher, while the meaning of 傅 is tutor and the meaning of 父 is father. Both characters are read fu with the same tones in Cantonese and Mandarin, creating some ambiguity. sifu (Noun). A pair of Cantonese terms, homophones, used in English to mean master or teacher in the context of martial arts, especially kung fu and tai chi, also used to denote spiritual father in esoteric uses."}, {"url": "http://www.urbandictionary.com/define.php?term=Sifu", "passage_text": "Sifu. The Sifu comes from the Chinese word 師父 or 師傅. Si(師) means teacher and fu(父) means father. Sifu actually means someone who teaches you a kind of skills or techniques, which can be a kind of material arts, a kind of musical instruments, etc. Sifu is not only your teacher, but also your father. We have a idiom among us:"}, {"url": "http://www.kajukenbo.com/cafe/index.php/topic,3876.0.html", "passage_text": "Within the martial arts, an instructor is also called Sifu. A Sifu is one who, is traveling along the same path, and is farther ahead, than the student and serves as a guide to the student's journey. The Sifu also implies a relationship between student and teacher much like a master teaching a trade to an apprentice. The Sifu is the linage holder and the head of a generation, with a twofold purpose as a safe-keeper of the system, and one that is responsible for the whole system. To maintain the purity of the knowledge and to serve as the guide for the students."}, {"url": "https://answers.yahoo.com/question/index?qid=20070723112828AAj3p3o", "passage_text": "Report Abuse. Sifu is a Chinese term for a master or teacher. The character 師 means “teacher”. The meaning of 傅 is “tutor” and of 父 “father”, both characters are read fu with the same tones in Cantonese and Mandarin, creating some ambiguity. "}, {"url": "http://www.youtube.com/watch?v=5TcjiDFcwks", "passage_text": "Sifu is Chinese word for teacher. In this short presentation master Lau introduces the true definition of Sifu to the western society. And the true meaning to Chinese culture. 1  Education. 2  Standard YouTube License."}, {"url": "https://en.wikipedia.org/wiki/Sifu", "passage_text": "Shifu (Chinese) or shifu (Standard Chinese) is an accomplished worker. It is written with the Chinese characters: 師傅 and 師父. The character 師 means skilled person, while the meaning of 傅 is tutor and the meaning of 父 is father. Both characters are read fu with the same tones in Cantonese and Mandarin, creating some ambiguity. A similar term often used in Chinese is 老師 (Cantonese Chinese pronunciation: lou5 si1; Mandarin Chinese pronunciation: lǎoshī), meaning teacher or literally old person of skill"}, {"url": "http://www.ocwingchun.com/2009/05/what-is-sifu.html", "passage_text": "The general definition of Sifu is Teacher. However, a Sifu is more than someone who trains apprentices, instructors, or oversees the in-depth training of an art. A Sifu is a mentor, coach, tutor, advisor, counselor, example, leader, authority, sage, guru, master, specialist, authority, connoisseur, scholar, technician and much more. A Sifu is a guide who is passing on the tradition and philosophy of the art as a way of life, not just the techniques themselves. The term takes on a more intimate context when a student becomes a formal student or disciple of the teacher."}, {"url": "http://www.everythingwingchun.com/sifu-fernandez-wing-tchun-do-dvds-books-s/274.htm", "passage_text": "WingTchunDo is the martial art system formulated from the training and fight experience of Sifu Fernandez. This is based on the WingTsun system, created by Grandmaster Ip Man's penultimate private student, GM Leung Ting, as well as the teachings of Ip Man's third disciple, GM Chu Shing Tin. "}]