[{"url": "https://uk.answers.yahoo.com/question/index?qid=20080217045727AAvx4Jv", "passage_text": "Several factors come into play when determining the proper age of cattle ready for slaughter, such as the current market, breed characteristics, and the degree of finish, or fat on the animal. Old cattle (bulls and cows), commonly referred to as canners or cutters, are generally slaughtered promptly after purchase. Breed type of the animal is an important factor in the slaughter age. British-type cattle (Angus, Hereford, Shorthorn) reach puberty earlier and are much more feed efficient than cattle of American (Brahman, Beefmaster, Santa Gertrudis, etc.) or Continental (Limousin, Charloais) influence/ lineage. Hope that helps."}, {"url": "https://answers.yahoo.com/question/index?qid=20101128221215AAXXKB2", "passage_text": "The grain is to help put more marbling on the meat, and make it more juicier and flavorful. But if you choose to fatten the steers on grass, it will take a lot longer for them to reach their target weight. Most grass-fed cattle are slaughtered when they reach between 20 and 24 months of age. Since you folks are small-time hobby-type farmers, a steer fattened up to 1200 lbs is good enough for you. The carcass weight of a slaughtered steer is often 50% of its live weight. Cows (like the mature bovine one I mentioned earlier) get slaughtered when they are no longer productive to a breeding herd, which can range from 2 to over 20 years of age. The meat from cows is so strong that it's better off being made into ground beef or sausage."}, {"url": "http://www.wikihow.com/Slaughter-Cattle", "passage_text": "1 A good way to tell if you have the meat aging at the right temperature is if the temperature of the round (the hind-quarter) and other thick parts are lowered to 40 to 45 degrees Fahrenheit (7 to 4 degrees Celsius) within 24 hours after slaughter. It is a process that begins when the animal enters onto the kill floor or the area where they can be easily accessed to be slaughtered and ends in the cooling room. There are three ways that cattle are slaughtered: Commercial, Do-It-Yourself at Home Butchering, and Religious"}, {"url": "http://www.answers.com/Q/What_age_are_most_feeder_cattle_when_slaughtered", "passage_text": "British-breds also have a slower growth rate than Continentals do, and may not be slaughtered until they are past 18 months of age. All in all though, finishers are slaughtered at a target weight of around 1400 lb. A pig is usually slaughtered between six and ten months of age, depending on what it is used for (bacon, sausages, pork etc), the breed, and growth rate."}, {"url": "http://www.answers.com/Q/What_age_do_you_slaughter_a_beef_cow", "passage_text": "A calf raised for baby beef can be slaughtered between 5 and 8 months of age, and a calf used for veal can be slaughtered from 2 weeks to 3 months of age. 3 people found this useful. Karin L. This is my specialty. The average weight for all cows is around 1400 to 1600 lbs. However, a cow of any size and weight can be slaughtered. She can be as small as only 700 lbs, or as large as over 2000 lbs."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080217045727AAvx4Jv", "passage_text": "Due to BSE regulations the maximum age for cattle to enter the food chain, was until quite recently, 30 months. Most cattle slaughtered were within days of this, when presented. This has been relaxed, but in fact has made little difference, as cattle over 30 months still have to be certified fit for consumption. Breed type of the animal is an important factor in the slaughter age. British-type cattle (Angus, Hereford, Shorthorn) reach puberty earlier and are much more feed efficient than cattle of American (Brahman, Beefmaster, Santa Gertrudis, etc.) or Continental (Limousin, Charloais) influence/ lineage. Hope that helps."}, {"url": "http://www.answers.com/Q/What_age_are_most_feeder_cattle_when_slaughtered", "passage_text": "Most feeders/finishers are slaughtered at around 18 to 24 months of age, however finisher cattle are slaughtered according to a particular target finish weight they have to reach, not by their age. This is because there are variations in how cattle are finished due to their breeding, genetics and sex. Continentals will take a shorter time to finish because they tend to reach target weight much sooner due to their high growth rates, and may be ready for slaughter by the time they are 12 to 18 months of age. A pig is usually slaughtered between six and ten months of age, depending on what it is used for (bacon, sausages, pork etc), the breed, and growth rate."}, {"url": "http://www.wikihow.com/Slaughter-Cattle", "passage_text": "2. Make sure the animal you are going to slaughter is of the right age to butcher. This is especially true with a steer or heifer that you have raised for beef. If you are or have finished a young animal on grain, aim to butcher when they are around 15 to even 18 months old. Some people prefer to butcher their cattle between 10 and 15 months of age. It is a process that begins when the animal enters onto the kill floor or the area where they can be easily accessed to be slaughtered and ends in the cooling room. There are three ways that cattle are slaughtered: Commercial, Do-It-Yourself at Home Butchering, and Religious slaughter."}, {"url": "http://www.answers.com/Q/What_age_do_you_slaughter_a_beef_cow", "passage_text": "She can be slaughtered at 3 years of age or as old as … 20 years of age. If you are using the term cow in a very loose manner, typically a cow (being a feeder steer or heifer) is usually slaughtered at around 14 to 24 months of age. The average weight for all cows is around 1400 to 1600 lbs. However, a cow of any size and weight can be slaughtered. She can be as small as only 700 lbs, or as large as over 2000 lbs."}]