[{"url": "http://www.stylecraze.com/articles/amazing-benefits-of-castor-oil/", "passage_text": "Castor oil effectively treats ringworm (4), a common and stubborn skin problem across all age groups. The active compound called undecylenic acid, found in castor oil, helps treat ringworm successfully. Here is a step-by-step guide to its use. 1  Dilute 2 teaspoons of castor oil in 4 teaspoons of coconut oil. 2  Alternatively, you can wash castor leaves in water and soak them in coconut oil for few hours, and then heat gently. 3  Apply over the affected area and cover with a cotton cloth. Castor oil is perfect for treating stretch marks (9). Here are the directions to use: 1  Rub castor oil over the stretch marks on your stomach and thighs (caused due to pregnancy and/or excessive weight gain). 2  Apply it regularly to get the best results."}, {"url": "http://www.diyncrafts.com/4810/lifehacks/20-strange-effective-everyday-uses-castor-oil", "passage_text": "If you tend to have dry scalp or dandruff, you can rub a little castor oil into your scalp and massage it in to alleviate the flakes and itchiness. Incidentally, the oil works really well as conditioner, too. Just mix 2 teaspoons with an egg white and a teaspoon of glycerin and massage into your wet hair. Massaging castor oil into achy joints will give you a bit of relief from the pain of arthritis. You can mix castor oil with enough turmeric or cayenne powder to make a paste and then rub it into your joints. Be sure that you don’t get this in your eyes, especially if you choose to use cayenne pepper instead of turmeric."}, {"url": "http://www.beautyandtips.com/beautyoils/28-wonderful-castor-oil-benefits-and-uses-for-beauty-hair-and-health/", "passage_text": "11. Dry skin remedy. Castor oil is also good at treating such problems as skin dryness. Just mix castor oil with a little coconut oil (in proportion 1:1) and apply to the affected area of your skin, leave it on for 20-30 minutes, then rinse off and pat dry. If you have oily hair and dandruff, then mix one tablespoon of each of these ingredients: castor oil, honey and aloe vera gel, then add juice of half a lemon. Apply the mask on the roots of your hair for about 30 minutes before shampooing and conditioning your hair."}, {"url": "http://www.stylecraze.com/articles/amazing-benefits-of-castor-oil/", "passage_text": "Castor oil is rich in Ricinoleic acid (6), which fights off the acne-causing bacteria. It effectively penetrates the skin layers, making it an excellent remedy for acne. To use castor oil for skin: 1  Wash your face with warm water, as this will help open your pores. Castor oil is perfect for treating stretch marks (9). Here are the directions to use: 1  Rub castor oil over the stretch marks on your stomach and thighs (caused due to pregnancy and/or excessive weight gain). 2  Apply it regularly to get the best results."}, {"url": "http://www.beautyandtips.com/beautyoils/28-wonderful-castor-oil-benefits-and-uses-for-beauty-hair-and-health/", "passage_text": "Here is a face mask with castor oil that will help you get rid of skin dryness and will make your skin soft and smooth: Mix one teaspoon of castor oil with one egg yolk, apply it to your face for 10-15 minutes, then rinse off with lukewarm water and pat dry. Your skin will love it! 12. If you have oily hair and dandruff, then mix one tablespoon of each of these ingredients: castor oil, honey and aloe vera gel, then add juice of half a lemon. Apply the mask on the roots of your hair for about 30 minutes before shampooing and conditioning your hair."}, {"url": "http://www.mindbodygreen.com/0-6674/Why-You-Should-Wash-Your-Face-With-Oil.html", "passage_text": "1 Now, top off the bottle with the castor oil, screw on dispenser and shake for 1 minute. 2  If you want to add essential oils such as lavender or tea tree, add those in before you shake. 3  Now that the solution is ready, let’s use it! 4  Dispense a quarter-sized dollop on your hand and rub it all over your dry face for 1 minute. "}, {"url": "http://skinverse.com/castor-oils-many-uses-for-beautiful-skin-and-hair/", "passage_text": "1 For most people, when castor oil is used on the face, this means thicker and longer eyebrows/eyelashes and more rapid growth of them. 2  If you are a man with facial hair (a beard or a mustache), castor oil use over those areas will promote faster growth and thicker hair. 3  This is also the same for some hirsute women. "}, {"url": "http://www.beautyandtips.com/beautyoils/28-wonderful-castor-oil-benefits-and-uses-for-beauty-hair-and-health/", "passage_text": "For oily skin mix 1/4 of castor oil and 3/4 jojoba oil. Gently massage your face in the evening with the oil mix, then put slightly warm damp washcloth on your face for about a minute and take away the excess oil with a cotton pad. Your skin will be soft, nourished and hydrated. If you have oily hair and dandruff, then mix one tablespoon of each of these ingredients: castor oil, honey and aloe vera gel, then add juice of half a lemon. Apply the mask on the roots of your hair for about 30 minutes before shampooing and conditioning your hair."}, {"url": "http://www.homeremediesweb.com/castor-oil-health-benefits.php", "passage_text": "Successful studies have approved the use of Castor Oil for skin infections and other skin problems such as sunburn, abrasions, acne, dry skin, boils, warts, stretch marks, liver/age spots, athletes foot and chronic itching and inflamed skin. "}, {"url": "http://www.stylecraze.com/articles/amazing-benefits-of-castor-oil/", "passage_text": "1 Dilute 2 teaspoons of castor oil in 4 teaspoons of coconut oil. 2  Alternatively, you can wash castor leaves in water and soak them in coconut oil for few hours, and then heat gently. 3  Apply over the affected area and cover with a cotton cloth. Castor oil is perfect for treating stretch marks (9). Here are the directions to use: 1  Rub castor oil over the stretch marks on your stomach and thighs (caused due to pregnancy and/or excessive weight gain). 2  Apply it regularly to get the best results."}]