[{"url": "http://www.childandfamilymentalhealth.com/play-therapy/", "passage_text": "Play therapy is a form of treatment that helps children and families to express their emotions, improve their communication, and solve problems. Play therapy capitalizes on children’s natural ability to express their feelings and resolve conflicts through play. Play therapists use various media, including storytelling, puppet play, drama, music, dance, sand play, painting and drawing, and board games. Play therapy is most appropriate for children ages 4-12 years of age, or with families with children that age."}, {"url": "http://www.creativecounseling101.com/how-to-do-play-therapy.html", "passage_text": "I tell them that play therapy is a language that children are fluent in. A play therapist is a therapist that is also trained and fluent in this language. I invite the parent (only the parent / guardian) over for a session overview and also to show them my playroom and play therapy toys. It may take a few phone calls after some major incidents happen with the child to get the parent to bring the child to play therapy. A play therapist must be patient with this part of the play therapy process. Be patient and kind."}, {"url": "http://counselingcorner.net/play/index.html", "passage_text": "A: Play therapy is very different than just playing with a child, and therefore only a therapist with specialized training should provide this service for you and your child. Be sure to ask about the therapist’s training in play therapy, their areas of specialization, and their experience in providing play therapy. Make sure that you only take your child to someone who has this extensive training, experience and works primarily with children."}, {"url": "http://www.playtherapy.co.za/index.html", "passage_text": "Play Therapy is a specific counselling approach in which games, toys and mediums such as clay, drawings and paint are used to help a child or adolescent to express their emotions, thoughts, wishes and needs. In the sessions the therapist uses specific techniques to assess how a child or adolescent experience their world and how they communicate and react to the events and people in their world. Children are lead to become aware of what they are feeling and opportunities are given to express these feelings."}, {"url": "http://kathyeugster.com/articles/article003.htm", "passage_text": "No matter what the behavior looks like in a child, parents will usually become concerned and want to seek help for their child. One of the best ways to help children with behavioral and emotional problems is through an approach known as play therapy. Allowing the Development of Healthy Decision-Making Skills. During play therapy, children are given the opportunity to make decisions and choices for themselves, thus enabling them to take control of the environment and to take responsibility for their actions."}, {"url": "http://kathyeugster.com/articles/article003.htm", "passage_text": "Encouraging Creative Thoughts and New Ideas. During play, creative thoughts are encouraged, and all children use play to learn about their environment and to solve their day-to-day problems. In play therapy, children will do the same thing and play in ways that help them to make sense of their problems. They can get a better understanding of what is happening in their lives and therefore be in a better position to cope with or adjust to their situation. Allowing the Development of Healthy Decision-Making Skills. During play therapy, children are given the opportunity to make decisions and choices for themselves, thus enabling them to take control of the environment and to take responsibility for their actions."}, {"url": "http://www.creativecounseling101.com/how-to-do-play-therapy.html", "passage_text": "Let Us Teach You How to do Play Therapy and Become a Play Therapist. How to Do Play Therapy. Play therapy usually begins with a phone call. The parent of the child is distraught. Something has happened to cause the parent to want to send their child to me for play therapy. It may take a few phone calls after some major incidents happen with the child to get the parent to bring the child to play therapy. A play therapist must be patient with this part of the play therapy process. Be patient and kind."}, {"url": "http://www.playtherapy.co.za/index.html", "passage_text": "Play Therapy can be useful for any child of four years and older. It can help to become aware of what feelings and how these feelings manifest in behaviour or one's body. They can learn how to become better at regulating emotions and expressing them in constructive ways. In the sessions the therapist uses specific techniques to assess how a child or adolescent experience their world and how they communicate and react to the events and people in their world. Children are lead to become aware of what they are feeling and opportunities are given to express these feelings."}, {"url": "http://counselingcorner.net/play/index.html", "passage_text": "Play therapy is to children what talk therapy is to adults. Play is a child’s language. Adolescents and adults use languages like English, Spanish, French to express themselves. However, no matter what verbal language children speak, children express themselves best through their natural language—the language of play. Be sure to ask about the therapist’s training in play therapy, their areas of specialization, and their experience in providing play therapy. Make sure that you only take your child to someone who has this extensive training, experience and works primarily with children."}, {"url": "http://cirrie.buffalo.edu/encyclopedia/en/article/275/", "passage_text": "This article will refer to the patient/client as the child. For convenience the child will be he and the therapist she. Play therapy is used to help both typically and atypically developing children, that is children who have physical and/or learning disabilities. The play therapy session becomes a time for the child to experiment with change, learn about choice, self-responsibility and self direction, and resolve emotional difficulties and inner conflicts. The spontaneous play of children has long been recognised as a natural form of communication."}]