[{"url": "http://www.complex.com/pop-culture/2013/04/10-things-every-guy-should-know-about-moonshine/what-type-of-alchochol-is-moonshine", "passage_text": "Moonshine is essentially an un-aged whisky, traditionally clear with a hint of corn. It is perfect for sipping or using as a substitute in cocktails. There are different varieties of moonshine depending on the distillation process and number of times the spirit runs through the still.. Watch Now. "}, {"url": "https://en.wikipedia.org/wiki/Moonshine", "passage_text": "In modern usage, the term moonshine ordinarily implies that the liquor is produced illegally; however, the term has also been used on the labels of some legal products as a way of marketing them as providing a similar drinking experience as found with illegal liquor. The word moonshine is believed to be derived from the term  moonrakers  used for early English smugglers and the clandestine nature of the operations of illegal Appalachian distillers who produced and distributed whiskey. The distillation was done at night to avoid discovery."}, {"url": "https://en.wikipedia.org/wiki/Moonshine", "passage_text": "Moonshine, white lightning, mountain dew, hooch, homebrew, and white whiskey are terms used to describe high-proof distilled spirits that are generally produced illicitly. The word moonshine is believed to be derived from the term  moonrakers  used for early English smugglers and the clandestine nature of the operations of illegal Appalachian distillers who produced and distributed whiskey. The distillation was done at night to avoid discovery."}, {"url": "http://timsmithmoonshine.com/moonshine.html", "passage_text": "Moonshine is basically any kind of alcohol that is made in secret to avoid high taxes or bans on alcoholic drinks. The term moonshine originated in Britain. It was originally a verb, moonshining which referred to any activity that was done late at night by the light of the moon. "}, {"url": "http://medicinalmixology.com/legal-moonshine-a-paradox/", "passage_text": "Just the classification “legal moonshine” is a contradiction in terms. Moonshine is not a type of spirit (such as gin, tequila, or whiskey), but is defined as any spirit made at an illegal, unlicensed still. In short, moonshine is liquor made by a person that doesn’t give the government the taxes it so loves to collect on liquor sales. Moonshine goes by many names: white lightning, mountain dew, hooch, shine. It is a spirit strongly associated with the Appalachian Mountains region of the Eastern USA and the illegal stills that produce it there. Essentially moonshine is any distilled spirit made in an"}, {"url": "https://answers.yahoo.com/question/index?qid=20100222213809AAGkkys", "passage_text": "Report Abuse. Moonshine is homemade corn liquor. It is called moonshine because it is illegal to distill alcoholic beverages without a license to do so. During the Prohibition distilling and bottling of illegal liquor would be done at night. That is where the name moonshine comes from. Other names for moonshine are mountain dew and white lightning. "}, {"url": "http://www.differencebetween.info/difference-between-moonshine-and-whiskey", "passage_text": "Moonshine is usually transparent and clear in appearance. Whiskey or whisky is a type of distilled alcoholic beverage made from any form of fermented grain mash. Depending on the geographical region or type of whiskey that is being made, whiskey can be made from barley, malted barley, rye, malted rye, wheat, and corn. They are often aged in charred barrels. The most common forms of moonshine that were distributed were whiskey and rum. They most simple recipe required to make moonshine were corn meal, sugar, yeast and water. However, the corn meal could also be replaced with other forms of grains such as barley, rye or any other kind of"}, {"url": "http://science.howstuffworks.com/innovation/edible-innovations/moonshine1.htm", "passage_text": "Moonshine is any kind of alcohol, usually whisky or rum, that is made in secret to avoid high taxes or outright bans on alcoholic drinks. "}, {"url": "https://en.wikipedia.org/wiki/Moonshine", "passage_text": "Moonshine is typically made with corn mash as the main ingredient. The word moonshine is believed to be derived from the term  moonrakers  used for early English smugglers and the clandestine nature of the operations of illegal Appalachian distillers who produced and distributed whiskey. The distillation was done at night to avoid discovery."}, {"url": "https://en.wikipedia.org/wiki/Moonshine", "passage_text": "Moonshine was especially important to the Appalachian area. This white whiskey most likely entered the Appalachian region in the late 18th century to early 1800s. Scots-Irish immigrants from the Ulster region of Northern Ireland brought their recipe for their uisce beatha, Gaelic for water of life. The word moonshine is believed to be derived from the term  moonrakers  used for early English smugglers and the clandestine nature of the operations of illegal Appalachian distillers who produced and distributed whiskey. The distillation was done at night to avoid discovery."}]