[{"url": "http://www.qwhatis.com/what-is-kenning/", "passage_text": "Kenning is a synonym or an alternative word group that is used to replace a single word. It usually involves a group of two hyphenated words that is used in a sentence instead of the basic one word noun or object. In complex types of kennings, it may involve more than two words because either the base-word or the determinant is a kenning in itself. In the basic phrase “feeder of raven” for example, this may be alternatively written in kenning form using the phrase “feeder of war-gull”."}, {"url": "http://literarydevices.net/kenning/", "passage_text": "Definition of Kenning. A Kenning is derived from Norse and Anglo-Saxon poetry. It is a stylistic device and can be defined as a two-word phrase that describes an object through metaphors. A Kenning poem is also called a riddle that consists of a few lines of kennings which describe someone or something in confusing detail. Function of Kenning. The kenning is used as a poetic device and its function in poetry is to describe something in alternative ways to provide a richer and different meaning. Kenning is related to dialects as well, wherein it works as a showcase example of regional or local dialect."}, {"url": "https://en.wikipedia.org/wiki/List_of_kennings", "passage_text": "A kenning (Old Norse kenning [cʰɛnːiŋɡ] , Modern Icelandic [cʰɛnːiŋk]) is a circumlocution (an ambiguous or roundabout figure of speech) used instead of an ordinary noun in Old Norse, Old English and later Icelandic poetry. This list is not intended to be comprehensive. "}, {"url": "http://literary-devices.com/content/kennings", "passage_text": "The use of Kennings in literature is characteristically related to works in Old English poetry where the author would use a twist of words, figure of speech or magic poetic phrase or a newly created compound sentence or phrase to refer to a person, object, place, action or idea. "}, {"url": "http://www.thefreedictionary.com/kenning", "passage_text": "kenning-conventional metaphoric name for something, used especially in Old English and Old Norse poetry. figure of speech, trope, image, figure-language used in a figurative or nonliteral sense. ken·ning. n. A figurative, usually compound expression used in place of a name or noun, especially in Old English and Old Norse poetry; for example, storm of swords is a kenning for battle. [Old Norse, from."}, {"url": "https://www.youngwriters.co.uk/types-kennings", "passage_text": "A Kenning is a two word phrase describing an object often using a metaphor. A Kennings poem is a riddle made up of several lines of kennings to describe something or someone. "}, {"url": "https://en.wikipedia.org/wiki/Kenning", "passage_text": "A kenning (. [cʰɛnːiŋk] ; derived from Old Norse) is a type of circumlocution, in the form of a compound that employs figurative language in place of a more concrete single-word noun. Kennings are strongly associated with Old Norse and later Icelandic and Anglo-Saxon poetry."}, {"url": "http://www.poetryarchive.org/glossary/kenning", "passage_text": "Term: Kenning. A kenning is a much-compressed form of metaphor, originally used in Anglo-Saxon and Norse poetry. In a kenning, an object is described in a two-word phrase, such as 'whale-road' for 'sea'. Some kennings can be more obscure than others, and then grow close to being a riddle."}]