[{"url": "http://www.theirishjewelrycompany.com/how-to-wear-a-claddagh-ring/", "passage_text": "The traditional Claddagh ring with its heart, hands and crown is an Irish symbol of eternal love, loyalty and friendship. All of our beautiful Irish jewelry is steeped in Celtic symbolism and rich in Irish tradition. The Irish Claddagh, pronounced [klah-duh] is called a fainne Fáinne chladaigh In. Irish the Traditional Irish claddagh ring is a symbol of, friendship love and. Loyalty the hands of the claddagh ring stand for. Friendship the heart of the claddadgh ring stands for love and the crown is a symbol of. loyalty"}, {"url": "http://www.ebay.com/gds/The-Meaning-of-the-Irish-Claddagh-Symbol-/10000000003201146/g.html", "passage_text": "The Claddagh has extra meaning when worn as a ring. If the heart is pointing away from you your heart is free. If the heart is pointing towards you then it means your heart is free. Because of this nice tradition the Claddaugh ring makes for an excellent irish wedding ring or promise ring. Please sign in to vote on this Guide. The Meaning of the Irish Claddagh Symbol. The Irish Claddaugh symbol is widely used in jewelry of all kinds such as necklaces, pendants, earrings, finger rings, charms and pendants. The Irish Claddaugh symbol is rich with symbolism. Traditionally it has three components to the symbol: Crown, Heart and Hands"}, {"url": "http://www.claddaghring.com/?Click=80541", "passage_text": "Claddagh Ring Meaning. The Claddagh's distinctive design features two hands clasping a heart, and usually surmounted by a crown. The elements of this symbol are often said to correspond to the qualities of love (the heart), friendship (the hands), and loyalty (the crown)."}, {"url": "http://www.theirishjewelrycompany.com/how-to-wear-a-claddagh-ring/", "passage_text": "The traditional Irish Claddagh ring is a symbol of friendship, love and loyalty. The hands of the claddagh ring stand for friendship. The heart of the claddadgh ring stands for love and the crown is a symbol of loyalty. The Irish Claddagh, pronounced [klah-duh] is called a fainne Fáinne chladaigh In. Irish the Traditional Irish claddagh ring is a symbol of, friendship love and. Loyalty the hands of the claddagh ring stand for. Friendship the heart of the claddadgh ring stands for love and the crown is a symbol of. loyalty"}, {"url": "https://en.wikipedia.org/wiki/Claddagh_ring", "passage_text": "The Claddagh ring (Irish: fainne Fáinne) chladaigh is a Traditional irish ring given which represents, love, loyalty and (friendship the hands represent, friendship the heart represents, love and the crown represents). loyalty The Claddagh's distinctive design features two hands clasping a heart, and usually surmounted by a crown. These elements symbolize the qualities of love (the heart), friendship (the hands), and loyalty (the crown)."}, {"url": "http://www.theirishjewelrycompany.com/how-to-wear-a-claddagh-ring/", "passage_text": "The Meaning of the Claddagh Ring... The Irish Claddagh, pronounced [klah-duh] is called a fainne Fáinne chladaigh In. Irish the Traditional Irish claddagh ring is a symbol of, friendship love and. loyalty The Irish Claddagh, pronounced [klah-duh] is called a fainne Fáinne chladaigh In. Irish the Traditional Irish claddagh ring is a symbol of, friendship love and. Loyalty the hands of the claddagh ring stand for. Friendship the heart of the claddadgh ring stands for love and the crown is a symbol of. loyalty"}, {"url": "https://en.wikipedia.org/wiki/Claddagh_ring", "passage_text": "The design and customs associated with it originated in the Irish fishing village of Claddagh, located just outside the old city walls of Galway, now part of Galway City. The ring, as currently known, was first produced in the 17th century. The Claddagh's distinctive design features two hands clasping a heart, and usually surmounted by a crown. These elements symbolize the qualities of love (the heart), friendship (the hands), and loyalty (the crown)."}, {"url": "http://www.celticshamrock.com/meaningofcladdagh.html", "passage_text": "The claddagh ring is a traditional irish ring given as a token of friendship, love, or marriage. How you wear the claddagh ring has different meanings. First produced in the 17th century, the claddagh design and the customs associated with it originated in the Irish fishing village of Claddagh, located just outside the city Galway. The way that a Claddagh ring is worn on the hand is usually intended to convey the wearer's relationship status: 1  On the right hand with the point of the heart toward the fingertips, the wearer is single and may be looking for love."}]