[{"url": "http://www.maplandia.com/united-kingdom/england/south-east/east-sussex-county/eastbourne/", "passage_text": "Welcome to the Eastbourne google satellite map! This place is situated in East Sussex County, South East, England, United Kingdom, its geographical coordinates are 50° 48' 0 North, 0° 15' 0 East and its original name (with diacritics) is Eastbourne. 3D map of Eastbourne in United Kingdom. You can also dive right into Eastbourne on unique 3D satellite map provided by Google Earth. With new GoogLe Earth plugin you can enjoy the interactive Eastbourne 3D map within your web browser."}, {"url": "http://wikitravel.org/en/Eastbourne", "passage_text": "Understand [edit]. Eastbourne. Eastbourne is a popular and traditional sea-side resort on the south coast of England, about 110 km from London and has a population of just under 100,000, making it the second largest town in Sussex. By train [edit]. Southern Railway is the principal train company serving Eastbourne. It is linked by train to the west with Brighton, and to the east with Bexhill, Hastings and Ashford International (for Eurostar services to France and Belgium)."}, {"url": "http://www.gomapper.com/travel/where-is/eastbourne-located.html", "passage_text": "Eastbourne is a city/town with a small population in the state/region of East Sussex, England which is located in the continent/region of Europe. Cities, towns and places near Eastbourne include Pevensey Bay, Hailsham, Seaford and Bexhill. The closest major cities include London, Southampton, Seine-Maritime and Landes-Vieilles-et-Neuves."}, {"url": "https://en.wikipedia.org/wiki/Eastbourne", "passage_text": "Eastbourne is located immediately east of Beachy Head, the highest chalk sea cliff in Great Britain and part of the South Downs National Park. Sussex Downs College is a large further education college with a campus in Eastbourne. This state-funded college provides a range of GCSE, GCE A Level, BTEC and vocational programmes for students aged 16–19 years of age, plus a full range of adult FE programmes."}, {"url": "https://en.wikipedia.org/wiki/Eastbourne", "passage_text": "With a population of 100,000 people Eastbourne is the 2nd fastest growing seaside town in the UK, and is the economic driver of one of the fastest growing counties in the country. Eastbourne has a broad economic base and is home to companies in a wide range of industries. Sussex Downs College is a large further education college with a campus in Eastbourne. This state-funded college provides a range of GCSE, GCE A Level, BTEC and vocational programmes for students aged 16–19 years of age, plus a full range of adult FE programmes."}, {"url": "https://en.wikipedia.org/wiki/Eastbourne", "passage_text": "Eastbourne's population is growing; between 2001 and 2011 it increased from 89,800 to 99,412. The 2011 census shows that the average age of residents has decreased as the town has attracted students, families and those commuting to London and Brighton. Sussex Downs College is a large further education college with a campus in Eastbourne. This state-funded college provides a range of GCSE, GCE A Level, BTEC and vocational programmes for students aged 16–19 years of age, plus a full range of adult FE programmes."}, {"url": "https://en.wikipedia.org/wiki/Eastbourne", "passage_text": "Though Eastbourne is a relatively new town, there is evidence of human occupation in the area from the Stone Age. The town grew as a fashionable tourist resort largely thanks to prominent landowner, William Cavendish, later known as the Duke of Devonshire. Sussex Downs College is a large further education college with a campus in Eastbourne. This state-funded college provides a range of GCSE, GCE A Level, BTEC and vocational programmes for students aged 16–19 years of age, plus a full range of adult FE programmes."}, {"url": "https://www.brighton.ac.uk/about-us/contact-us/maps/eastbourne-maps/index.aspx", "passage_text": "Eastbourne maps. The Eastbourne campus is located to the west of the town centre in three main clusters: Darley Road, Hillbrow and Welkin. Our Eastbourne campus is set in the Meads area of this historic seaside town, on the edge of the dramatic Seven Sisters Country Park. It's just a mile from the town centre and even closer to the seafront. Almost 3,000 students study here, benefitting from the close-knit university community and the excellent facilities."}]