[{"url": "http://www.contextures.com/PowerPivot-Identical-Excel-Files.html", "passage_text": "1 On the Toolbar, click the Create a PivotTable button, or on the Ribbon, click the Home tab, then click PivotTable. 2  Select a location for the pivot table, and click OK. 3  In the PowerPivot Field List, add fields to the pivot table layout, to see a summary of the combined data."}, {"url": "http://answers.microsoft.com/en-us/office/forum/office_2007-excel/excel-pivot-table-outputting-detail-on-multiple/33975228-243f-4251-bf2a-450808eb7755", "passage_text": "If your pivot table has a report filter (what was called a page field in Excel 2003 and before), you can create a sheet for each value of the filter field as follows: Click anywhere in the pivot table. Activate the Options tab of the ribbon (under PivotTable Tools). Click the little dropdown arrow in the Options button."}, {"url": "http://blog.contextures.com/archives/2010/04/16/how-to-create-an-excel-pivot-table-from-multiple-sheets/", "passage_text": "However, while you're setting up the pivot table you can create one or more page fields, and create labels for the data ranges.\\n\\nThis video shows you the steps in Excel 2007, to create the pivot table from multiple sheets, and set up a page field.\\n____________\\nHi,\\nThanx for the video tutorial. Helped me alot."}, {"url": "http://answers.microsoft.com/en-us/office/forum/office_2010-excel/how-do-i-combine-multiple-data-ranges-as-sources/d16886fc-5903-4104-8bfd-b79caa0d9240", "passage_text": "I need to combine multiple data ranges as sources in a single pivot table. For example, one tab lists buildings with street addresses, square footages, etc. (one row per building). Another tab lists building operating expenses for maintenance, cleaning, utilities, etc. (dozens of rows for each"}, {"url": "http://www.contextures.com/xlPivot08.html", "passage_text": "In the pivot tables, generic fields are created -- Row, Column, Value and Page1. You can rename those fields, to make the pivot table easier to understand. 1  Click on any label in the pivot table, and type a new label, then press Enter. 2  For example, click on the Page1 label, type Region, and"}, {"url": "http://www.laptopmag.com/articles/excel-2013-pivot-table-from-multiples", "passage_text": "1. Click Insert at the top of the screen. 2. Click the PivotTable button on the Ribbon. 3. Select the first table you want to add to the pivot table. 4. Check the box labeled Add this data to the Data Model and press OK. 5. Click All in the PivotTable Fields window to view all of the tables."}, {"url": "http://www.contextures.com/xlPivot08.html", "passage_text": "Create a pivot table from multiple consolidation ranges. 1  To open the PivotTable and PivotChart Wizard, select any cell on a worksheet, then press Alt+D, then press P. That shortcut is used because in older versions of Excel, the wizard was listed on the D ata menu, as the P ivotTable and PivotChart Report command."}]