[{"url": "http://www.mcwdn.org/Animals/Flatworm.html", "passage_text": "When you have finished this page, take the Flatworms Quiz. Flatworms are the simplest of the worm groups. There are about 20,000 species in this group. They are found many places and can be free living or parasitic. A parasite lives off of another living thing called a host and can be harmful. One of the best known flatworms is the tapeworm. The tapeworm can get into a person's digestive tract and grow to enormous lengths."}, {"url": "https://en.wikipedia.org/wiki/Flatworm", "passage_text": "From Wikipedia, the free encyclopedia. The flatworms, or Platyhelminthes, Plathelminthes, or platyhelminths (from the Greek πλατύ, platy, meaning flat and ἕλμινς (root: ἑλμινθ-), helminth- , meaning worm) are a phylum of relatively simple bilaterian, unsegmented, soft-bodied invertebrates. Hence, the traditional platyhelminth subgroup Turbellaria is now regarded as paraphyletic, since it excludes the wholly parasitic groups, although these are descended from one group of turbellarians. Over half of all known flatworm species are parasitic, and some do enormous harm to humans and their livestock. Schistosomiasis, caused by one genus of trematodes, is the second-most devastating of all human diseases caused by parasites, surpassed only by malaria"}, {"url": "http://dvbiology.org/biologyweb/bworm.htm", "passage_text": "Type of digestive system: Some worms are parasitic, meaning that they live on or in another organism. Some worms are free-living, meaning that they are not dependant on another organism. Type of reproduction: Some worms reproduce asexually, others sexually, and still others can do both. Earthworms reproduce sexually. 1 Show how the digestive system of a free-living worm is different from that of a parasitic worm. 2  Describe sexual reproduction in earthworms. ( 3 Hint: the clitellum does not cover both worms during this process as you have seen on some zoology charts.). 4  Compare locomotion in planarians and"}, {"url": "http://medicine.ucsf.edu/education/resed/Chiefs_cover_sheets/body%20cavity%20tumors.pdf", "passage_text": "What is it? Body cavity tumors, also called primary effusion lymphomas, are a type of lymphoma that has a predilection for body cavities such as the pleural, peritoneal, or pericardial spaces. It is one of the three, and least common, subtypes of AIDS-related lymphomas (the others being NHL and primary CNS lymphoma). AD 12/02 Body Cavity Tumors Key Points: 1. Body cavity lymphomas, also called primary effusion lymphomas are liquid phase tumors that invade body cavities and present as effusions. 2. HHV8, and to some extent EBV, are implicated as important contributors to pathogenesis. 3."}, {"url": "http://dvbiology.org/biologyweb/bworm.htm", "passage_text": "1 Some worms are parasitic, meaning that they live on or in another organism. 2  Some worms are free-living, meaning that they are not dependant on another organism. 3  Some worms reproduce asexually, others sexually, and still others can do both. 1 Show how the digestive system of a free-living worm is different from that of a parasitic worm. 2  Describe sexual reproduction in earthworms. ( 3 Hint: the clitellum does not cover both worms during this process as you have seen on some zoology charts.). 4  Compare locomotion in planarians and"}, {"url": "http://www.ehow.com/facts_5661651_difference-between-flatworms-roundworms.html", "passage_text": "Body Cavity. Flatworms are acoelomate, which means they do not have a body cavity. Roundworms are psuedocoelomate, which means they have a body cavity between their mesoderm and endoderm layers. The flatworm Planaria and the roundworm Caenorhabditis elegans are both lab organisms that are called worms. However, they are not closely related. Flatworms (phylum Platyhelminthes) and roundworms (phylum Nematoda) are both called worms, but there are many differences between these two types of organisms."}, {"url": "http://study.com/academy/lesson/gastrovascular-cavity-definition-lesson-quiz.html", "passage_text": "The gastrovascular cavity is a structure found in primitive animal phyla. It is responsible for both the digestion of food and the transport of nutrients throughout the body. The cavity has only one opening to the environment. Food goes in and waste comes out that same opening, making it a two-way digestive tract. Platyhelminthes. Flatworms do not have the vase-like cavity structure of cnidarians. Instead, the cavity is more of a branching structure that runs the length of the entire body. The opening to the cavity is called the pharynx."}, {"url": "https://en.wikipedia.org/wiki/Body_cavity", "passage_text": "A body cavity is any fluid-filled space in a multicellular organism other than those of vessels (such as blood vessels and lymph vessels). The term usually refers to the space located between an animal ’s outer covering (epidermis), and the outer lining of the gut cavity, where internal organs develop. ‹The template Elucidate is being considered for deletion.›. The dorsal (posterior) cavity and the ventral (anterior) cavity are the largest body compartments. These cavities contain and protect delicate internal organs, and the ventral cavity allows for significant changes in the size and shape of the organs as they perform their functions."}, {"url": "http://avconline.avc.edu/cyorke/documents/FlatwormsRoundwormsandAnnelidslab.doc", "passage_text": "Platyhelminthes. are commonly called flatworms. There are both. parasitic. (dependent on a host organism for survival) and. free-living. forms of this group. Flatworms, either parasitic or free-living forms, have both sexes on the same individual, a condition referred to as. hermaphroditic. . Most Nematodes are free-living, but some are important parasites of plants and animals. As for the flatworms, nematode development includes all three embryonic tissue layers. Roundworms have a fluid-filled body cavity, that is lined on the outside by tissue derived from mesoderm."}]