[{"url": "http://healthletter.mayoclinic.com/editorial/editorial.cfm/i/357/t/Fatigue%3A%20Clues%20and%20news/", "passage_text": "Medical causes of fatigue Some common causes of fatigue include: 1  Anemia — When you have low red blood cell counts in your bloodstream, your body has to work harder to deliver oxygen to your cells, causing fatigue. 2  Iron deficiency is also associated with fatigue. 1 Anemia — When you have low red blood cell counts in your bloodstream, your body has to work harder to deliver oxygen to your cells, causing fatigue. 2  Iron deficiency is also associated with fatigue. 3  If you're diagnosed with anemia, then it's important to understand the cause in order to correct the problem."}, {"url": "http://www.wilsonssyndrome.com/thyroid-and-fatigue/", "passage_text": "They also tend to think “thyroid blood tests,” but patients can suffer from low body temperatures and debilitating fatigue even when their thyroid tests are normal. The thyroid system is supposed to maintain normal body temperatures. Low body temperatures can cause tremendous fatigue! Frequently, problems with thyroid and fatigue leave people feeling tired all day with difficulty sleeping at night. Their fatigue is often better when their temperatures are higher (perhaps in the late morning) and worse when their temperatures are lower (perhaps in the late afternoon)."}, {"url": "http://www.emedicinehealth.com/script/main/art.asp?articlekey=138229", "passage_text": "1 A high thyroid level (hyperthyroidism) can cause fatigue, weight loss, increased heart rate, intolerance to heat, sweating, irritability, anxiety, muscle weakness, and thyroid enlargement. "}, {"url": "http://www.webmd.com/women/guide/fatigued-or-full-throttle-is-your-thyroid-to-blame", "passage_text": "Or maybe your throttle's on idle with symptoms of depression, fatigue, and weight gain. In both cases, the root cause may be your thyroid. The thyroid -- a butterfly-shaped gland in the front of your neck -- makes hormones that control the way your body uses energy. "}, {"url": "http://www.webmd.com/women/ss/slideshow-thyroid-symptoms-and-solutions", "passage_text": "Weight gain may signal low levels of thyroid hormones, a condition called hypothyroidism. In contrast, if the thyroid produces more hormones than the body needs, you may lose weight unexpectedly. This is known as hyperthyroidism. Hypothyroidism is far more common. Hashimoto's Disease. The most common cause of hypothyroidism is Hashimoto's disease. This is an autoimmune disorder in which the body attacks the thyroid gland. The result is damage to the thyroid, preventing it from producing enough hormones."}, {"url": "http://articles.mercola.com/sites/articles/archive/2008/05/06/what-is-thyroid-related-fatigue.aspx", "passage_text": "Some of the key symptoms of thyroid fatigue include: Feeling like you don’t have the energy to exercise, and typically not exercising on a consistent basis. A heavy or tired head, especially in the afternoon, as your head is a very sensitive indicator of thyroid hormone status. Thyroid-related fatigue begins to appear when you cannot sustain energy long enough, especially when compared to a past level of fitness or ability. If your thyroid foundation is weak, sustaining energy output is difficult."}, {"url": "http://www.stop-being-tired.com/medical-causes-of-tiredness/underactive-thyroid-gland-hypothyroidism", "passage_text": "If it produces too much thyroid hormone, the body’s metabolism goes too fast, a condition which is called hyperthyroidism. If it produces too little, the reverse happens, and this condition is called hypothyroidism. Interestingly, both hyperthyroidism and hypothyroidism can cause fatigue. "}, {"url": "http://www.drrind.com/therapies/metabolic-symptoms-matrix", "passage_text": "1 In working with thyroid and adrenal dysfunction, I have come to realize that most patients with low body temperatures have a mixture of low thyroid and low adrenal symptoms (also called Wilson’s Syndrome). 2  Facial Pallor: A pale color, especially around the mouth. 3  Easiest to see in light skinned individuals. Typically over 300. 1 "}, {"url": "http://hypothyroidmom.com/10-ways-to-overcome-fatigue-with-a-low-thyroid/", "passage_text": "Revitalizing your energy is accomplishable. Fatigue and exhaustion are very common symptoms of hypothyroidism. When your hormones are balanced you are energetic and ready to take on the day. When stress comes you have the strength to deal with it without feeling like you need a glass of wine and a nap. Studies have shown that the repeated insulin surges common in insulin resistance increase the inflammation of the thyroid gland, and as the thyroid gland becomes hypo, thyroid hormone production falls. Low blood sugar is just as dangerous as high, so it is important to keep your blood sugar in balance."}]