[{"url": "http://www.answers.com/Q/What_is_moving_of_tassel_at_graduation_called", "passage_text": "Traditionally, the moving of the tassel at graduation is called, turning the tassel or the turning of the tassel ceremony.. It symbolizes one's transition from candidate to graduate. Standard protocol in the US dictates that the tassel be worn on the right side of one's mortarboard at commencement and then, during the ceremony, moved to the left side. Teachers and administrators at commencement place their tassels on the left."}, {"url": "http://www.funtrivia.com/askft/Question2463.html", "passage_text": "The tassel is worn on the right side before the degree is conferred. It is customary to change the tassel from the right to the left side after the degree is conferred. However, doctoral and MFA candidates will wear a gown, cap, and tassel. The cap tassel should be worn on the left side and flipped right."}, {"url": "http://www.answers.com/Q/On_what_side_of_the_graduation_cap_should_the_tassel_hang", "passage_text": "Standard protocol in the US dictates that the tassel be worn on the right side of one's mortarboard at commencement and then, during the ceremony, moved to the left side. Teachers and administrators at commencement place their tassels on the left. + 128 others found this useful. Jacey Easterly."}, {"url": "http://graduationshop.blogspot.com/2012/10/whether-to-turn-graduation-tassel-left.html", "passage_text": "Commonly the tassel can be turned from the right hand side to the left hand side by the moment that the graduate receives their diploma. In some cases, a leader asks the candidates to turn their tassels from the right hand side to the left hand side all together with the other graduates."}, {"url": "http://www.wikihow.com/Wear-Your-Tassel-for-a-High-School-Graduation", "passage_text": "1. Move tassels from right to left in a traditional ceremony. In most traditional graduation ceremonies, all students begin with their tassel on the right side of the cap. After the student receives a diploma, he or she moves the tassel onto the left side. 1  Many schools ask the students to move the tassels in unison, so everyone shares in the moment."}]