[{"url": "http://children.costhelper.com/nanny.html", "passage_text": "1 According to BabyCenter.com and our own data points, a nanny can cost between $400 - $1,000+ a week based on the local supply and demand, the local cost of living, and the qualifications you seek in a nanny. Related articles: Day Care, Baby Sitter, Preschool. 1  Costs for a nanny vary greatly by region. 2  According to BabyCenter.com and our own data points, a nanny can cost between $400 - $1,000+ a week based on the local supply and demand, the local cost of living, and the qualifications you seek in a nanny."}, {"url": "http://isawyournanny.blogspot.com/2012/02/calling-all-nashville-area-nannies.html", "passage_text": "As a nanny in Nashville, industry standard is indeed $12-$15 an hour. It has taken me 5 years and being willing to live my life for someone else's tour schedule to break the $20/hour mark. I have a question for the Nashville area nannies (if you are out there....). I recently relocated from the East Coast (NY/NJ area) and am having trouble with what to say when potential employers ask for a salary requirement."}, {"url": "http://www.nanniesofbrentwood.com/_Families/Family_FAQs/", "passage_text": "There is a one-time registration fee of $50 (Non-refundable) for each family that would like to use our services. This fee is paid when you register through our on-line system. Later, there is an agency referral fee for all positions (full-time nanny, part-time nanny, live-in or live-out nanny or temporary babysitting). There are two different options for paying the agency fee. The first option is to pay an on-going daily fee of $10 per day (to the agency) for every day that the nanny or babysitter is working for your family. This is in addition to the hourly wage that is paid to the nanny or babysitter. 1 Part-time: expected to work 15 to 29 hours per week. 2  Full-time: expected to work 30 hours per week or more. 3  Live-in: will live with your family and work a set schedule with one to two days off per week, this type of employee will require a separate bedroom or living quarters and a salary."}, {"url": "http://www.nannies4hire.com/tips/983-nanny-salaries.htm", "passage_text": "If you aren't required to nanny for more than 40 hours per week, you may be paid as a part-time nanny instead of a full-time one. You may also see an increase or decrease in your nanny salary depending on how much extra work you do, such as cleaning the house and doing laundry. According to the 2012 INA Nanny Salary and Benefits Survey: 1  The national average hourly rate for babysitting or short-term assignments is $16 per hour. 2  The national average gross weekly salary for full-time live-out nannies is $705. 3  The national average gross weekly salary for full-time live-in nannies is $652."}, {"url": "http://www.nannies4hire.com/tips/983-nanny-salaries.htm", "passage_text": "Generally, a nanny with a lot of experience should average about $350 to $800 or more per week, based on a variety of factors. If you are just starting out as a nanny, don't be discouraged by the pay for nannies. According to the 2012 INA Nanny Salary and Benefits Survey: 1  The national average hourly rate for babysitting or short-term assignments is $16 per hour. 2  The national average gross weekly salary for full-time live-out nannies is $705. 3  The national average gross weekly salary for full-time live-in nannies is $652."}, {"url": "http://children.costhelper.com/child-day-care.html", "passage_text": "Child's Age: 2. This cost is for only 3 days a week-Full time is roughly $1000 a month. This is twice as much as any other day care in the area, but when we went to the other ones and went to this one, there is no comparison. SCDS regularly has 3 QUALIFIED teachers for 9-10 kids in a classroom. 1 Large cities such as Boston and New York are most expensive, with average daycare costs of a little more than $1,000 a month. 2  Contacting two KinderCares in the San Jose area about infant day care, we received quotes of $300-$330 a week, plus annual fees."}, {"url": "http://children.costhelper.com/child-day-care.html", "passage_text": "1 Assuming full-time day care for a 2 year old child on weekdays, according to Runzheimer International, the U.S. national average cost for full-time day care is $611 a month. 2  Large cities such as Boston and New York are most expensive, with average daycare costs of a little more than $1,000 a month. 1 Large cities such as Boston and New York are most expensive, with average daycare costs of a little more than $1,000 a month. 2  Contacting two KinderCares in the San Jose area about infant day care, we received quotes of $300-$330 a week, plus annual fees."}, {"url": "http://www.babycenter.com/0_how-much-youll-spend-on-childcare_1199776.bc?page=2", "passage_text": "The average home daycare charges about $7,761 a year ($646 a month) for babies and toddlers. Prices start at $3,582 a year and go up to $11,940 a year ($300 to $995 a month) but in large cities this cost is likely to be higher. For preschool-age children, the average cost for home daycare is $7,627 a year ($636 a month). Prices start at $3,780 a year and top at $12,000 a year ($315 to $1,000 a month)."}, {"url": "http://children.costhelper.com/nanny.html", "passage_text": "1 Costs for a nanny vary greatly by region. 2  According to BabyCenter.com and our own data points, a nanny can cost between $400 - $1,000+ a week based on the local supply and demand, the local cost of living, and the qualifications you seek in a nanny. Related articles: Day Care, Baby Sitter, Preschool. 1  Costs for a nanny vary greatly by region. 2  According to BabyCenter.com and our own data points, a nanny can cost between $400 - $1,000+ a week based on the local supply and demand, the local cost of living, and the qualifications you seek in a nanny."}]