[{"url": "http://www.readyratios.com/reference/market/price_to_earnings_ratio.html", "passage_text": "Definition. The price to earnings ratio (P/E ratio) is the ratio of market price per share to earning per share. The P/E ratio is a valuation ratio of a company's current price per share compared to its earnings per share. It is also sometimes known as “earnings multiple” or “price multiple”. "}, {"url": "http://www.accountingdetails.com/price_earning_ratio.htm", "passage_text": "Definition: Price earnings ratio (P/E ratio) is the ratio between market price per equity share and earning per share. The ratio is calculated to make an estimate of appreciation in the value of a share of a company and is widely used by investors to decide whether or not to buy shares in a particular company."}, {"url": "http://einvestingforbeginners.com/2013/04/10/how-to-calculate-pe-ratio/", "passage_text": "So, once you have these values, simply take market cap/ earnings to calculate P/E ratio. For Ford, using today’s stock price of $13.36, we get a market capitalization of $53.6 Billion. Divide this by the earnings, $5.6 Billion, and the P/E is 9.46. "}, {"url": "http://www.investopedia.com/terms/p/price-earningsratio.asp", "passage_text": "The Price-to-Earnings Ratio or P/E ratio is a ratio for valuing a company that measures its current share price relative to its per-share earnings. The price-earnings ratio can be calculated as: Market Value per Share / Earnings per Share. For example, suppose that a company is currently trading at $43 a share and its earnings over the last 12 months were $1.95 per share. The P/E ratio for the stock could then be calculated as 43/1.95, or 22.05. The price-to-earnings (P/E) ratio is calculated by dividing a company’s stock price per share by its earnings per share (EPS), ..."}, {"url": "http://www.wikihow.com/Calculate-Price-Earnings-Ratio", "passage_text": "Price-earnings ratio, also known as P/E ratio, is a tool that is used by investors to help decide whether they should buy a stock. The P/E ratio tells investors of a stock how much they have to pay for every $1 of earnings. A low P/E ratio is attractive in the sense that one pays less for every $1 of earnings. At the same time, companies with higher P/E ratios generally expect higher earnings growth in the future than companies with low P/Es. Ad. 1. Know the formula. The formula for calculating P/E is simple: The market value per share divided by the earnings per share. 1  Market value per share is simply how much it costs to buy a share of any publicly-traded company on the stock Market."}, {"url": "http://www.morningstar.com/InvGlossary/price_earnings_ratio.aspx", "passage_text": "Price/Earnings Ratio. The Price/Earnings Ratio or P/E Ratio is a stock's current price divided by the company's trailing 12-month earnings per share from continuous operations. "}, {"url": "http://accountingexplained.com/financial/ratios/pe-ratio", "passage_text": "Price/Earnings (P/E) Ratio. Price/Earnings or P/E ratio is the ratio of a company's share price to its earnings per share. It tells whether the share price of a company is fairly valued, undervalued or overvalued"}, {"url": "http://www.investopedia.com/ask/answers/070314/how-do-i-calculate-pe-ratio-company.asp", "passage_text": "To determine the P/E ratio, investors can divide the stock price by EPS. For example, Coca-Cola Co (KO) on June 18, 2014 traded at $41.56 per share with an EPS (TTM) of $1.87, so the P/E ratio would be: 1  Stock price ($41.56) / earnings per share ($1.87) = 22.22. "}, {"url": "http://www.myaccountingcourse.com/financial-ratios/price-earnings-ratio", "passage_text": "The price earnings ratio, often called the P/E ratio or price to earnings ratio, is a market prospect ratio that calculates the market value of a stock relative to its earnings by comparing the market price per share by the earnings per share. In other words, the price earnings ratio shows what the market is willing to pay for a stock based on its current earnings. Investors often use this ratio to evaluate what a stock's fair market value should be by predicting futur"}]