[{"url": "http://www.petinsurance.com/healthzone/pet-articles/pet-owner-topics/Save-Your-Grass-from-the-Dogs.aspx", "passage_text": "It’s the Nitrogen. A common assumption is that acid in a dog’s urine causes the grass to burn and die. This is not the case. Dogs (and cats) eat a lot of protein and normal bodily functions break it down. Excess nitrogen is removed by the kidneys and is expelled in urine — and it’s the nitrogen that burns the grass. "}, {"url": "http://www.whole-dog-journal.com/issues/7_2/features/Canine-Urinalysis_5608-1.html", "passage_text": "• Cells. A few large and small round cells may appear in normal urine, but their numbers may be increased in animals with cystitis, tumors, or other inflammation of the urinary tract. Evaluation of the urine sediment under the microscope is a good way to screen for urinary tract tumors. • Casts. Urine color is clear when dilute; it is normally yellowish due to the urochromes in the urine, and the yellow color intensifies when concentrated (i.e., when the animal is dehydrated). Urine can pick up a variety of colors and odors, and these may indicate disease, diet, or drugs."}, {"url": "http://www.ivyroses.com/HumanBody/Urinary/Urinary_System_Composition_Urine.php", "passage_text": "1 Approx. 2  95% of the volume of normal urine is due to water. 3  The other 5% consists of solutes (chemicals that are dissolved in the water). 4  Some of these solutes are the results of normal biochemical activity within the cells of the body. 1 Recognition and analysis of abnormalities of urine can provide information about the condition of the body. 2  Biochemical analysis of urine is called urinalysis, and is commonly used to diagnose a wide range of diseases. 3  Typical volume of urine: 1-2 litres / 24 hours per day (normal adult)."}, {"url": "https://answers.yahoo.com/question/index?qid=20090603122620AAYrB7s", "passage_text": "Best Answer: Urine is an aqueous solution of approximately 95% water, with the remaining percentages being metabolic wastes such as urea, dissolved salts, and organic compounds. Your urine is made by the kidneys and stored in the bladder. The kidneys act as a filter, draining the water and waste products from the blood and keeping the blood cells and larger protein molecules in the circulation. As urine also contains waste products from the blood, its colour is affected by what else is in the blood, such as foods and chemicals. About one in ten people find their urine turns red after they have eaten beetroot, though most people do not experience this."}, {"url": "http://www.webmd.com/a-to-z-guides/phosphate-in-urine", "passage_text": "Guide. The phosphate urine test measures the amount of phosphate in a sample of urine collected over 24 hours (24-hour urine test). Phosphate is a charged particle (ion) that contains the mineral phosphorus. The body needs phosphorus to build and repair bones and teeth, help nerves function, and make muscles contract. If there is not enough phosphate, less is found in the urine. Kidney problems can cause high or low levels of phosphate in the urine. High levels of phosphate in the urine also may be caused by eating a meal high in phosphorus, having high levels of vitamin D in your body, or having an overactive parathyroid gland."}, {"url": "https://en.wikipedia.org/wiki/Urine", "passage_text": "Average urine production in adult humans is around 1.4 L of urine per person per day with a normal range of 0.6 to 2.6 L per person per day, produced in around 6 to 8 urinations per day depending on state of hydration, activity level, environmental factors, weight, and the individual's health. Urine (from Latin Urina, ae, f .) is a liquid by-product of the body secreted by the kidneys through a process called urination (or micturition) and excreted through the urethra."}, {"url": "http://homeguides.sfgate.com/dog-pee-hurt-plants-75960.html", "passage_text": "Dog urine contains waste products that can harm your plants, resulting in burned, wilted leaves and in some cases, the death of the plant itself. Avoid issues with your dog's urine harming your plants by designating a plant-free zone in your yard that your pup can use to eliminate. Urine Dilution. After your dog urinates on any plants in your yard, douse the area with water from your garden hose. A thorough rinsing of the area within eight hours of urination dilutes the urine enough to prevent damage to the plant, according to VeterinaryPartner.com."}, {"url": "https://labtestsonline.org/understanding/analytes/urine-culture/tab/sample", "passage_text": "The urine culture test detects and identifies bacteria and yeast in the urine. Urine is produced by the kidneys, two fist-sized organs located on either side of the spine at the base of the ribcage. The kidneys filter waste out of the blood and produce urine, a yellow fluid, to carry wastes out of the body. "}, {"url": "http://chemistry.about.com/od/biochemistry/f/What-Is-The-Chemical-Composition-Of-Urine.htm", "passage_text": "Urine is a liquid produced by the kidneys to remove waste products from the bloodstream. Human urine is yellowish in color and variable in chemical composition, but here is a list of its primary components. "}, {"url": "http://www.ivyroses.com/HumanBody/Urinary/Urinary_System_Composition_Urine.php", "passage_text": "1 Given that urine is mostly water, but also contains some other substances dissolved in the water, its density is expected to be close to, but slightly greater than, 1.0. 2  This is true-the density of normal urine is in the range 0.001 to 0.035. 3  Approx. 4  95% of the volume of normal urine is due to water. 1 Recognition and analysis of abnormalities of urine can provide information about the condition of the body. 2  Biochemical analysis of urine is called urinalysis, and is commonly used to diagnose a wide range of diseases. 3  Typical volume of urine: 1-2 litres / 24 hours per day (normal adult)."}]