[{"url": "http://www.tpwmagazine.com/archive/2014/jun/ed_1_coastalparks/", "passage_text": "Sea Rim State Park. If solitude and a Texas beach in its unfettered state call to you, seek out Sea Rim State Park, just a 23-mile seagull flight from the bright lights of south Port Arthur’s refinery complex."}, {"url": "http://tpwd.texas.gov/state-parks/sea-rim", "passage_text": "At the far southeast corner of Texas lies a remote and unique coastal park. Sea Rim State Park has 5.2 miles of Gulf shoreline and 4,000 acres of marshlands. At this park, you can camp, go birding and beach combing, paddle in a canoe or kayak, swim, fish, hunt (in season), and walk. You do not need a license to fish from shore in a state park. We also have a boat ramp. Download Sea Rim's Fishing Tip Sheet. Paddle one of our trails, from the 1.79-mile easy trail to the 9.59-mile advanced trail. Experience the coast from a kayak or canoe (bring your own)."}, {"url": "http://wildernet.com/pages/area.cfm?areaid=txspseari&cu_id=1", "passage_text": "Location-Sea Rim State Park is situated within the Gulf Coast region of Texas. The park is located 20 miles south of Port Arthur on State Highway 87. State Highway 87 is closed between Sea Rim and High Island, which necessitates a detour onto Highway 73. An American Alligator. This park has been affected by Hurricane Rita and is temporarily closed for repairs. Sea Rim State Park, 4141.1 acres of marshland with 5.2 miles of Gulf beach shoreline, is located in Jefferson County south of Port Arthur. The park was acquired by purchase from Planet Oil and Mineral Corporation and Horizon Sales Corporation in 1972 and was opened to the public in 1977"}, {"url": "http://gotexas.about.com/od/naturecentersparks/p/SeaRimSP.htm", "passage_text": "Primitive campsites are located throughout the marsh. Sea Rim State Park Visitor Information: Sea Rim State Park is located 20 miles south of the city of Port Arthur on Highway 87. Since Sea Rim State Park is undergoing extensive restoration from hurricane damage, no entry fee is currently required. But, the park remains open to the public. Sea Rim State Park Overview: A mix of marsh and beach, Sea Rim State Park isn’t a typical beach destination. However, this state park, which is located just south of Beaumont/Port Arthur is a nature-lover’s delight. Bird-watchers and beach-goers often co-exist on this stretch of sand, which is the northern-most beach in Texas"}, {"url": "http://www.texasoutside.com/easttexas/searimsp.htm", "passage_text": "All Hunters must check in at the JD Murphree WMA check station before entering the park. History: Sea Rim State Park, 4141.1 acres of marshland with 5.2 miles of Gulf of Mexico beach shoreline, is located in Jefferson County, south of Port Arthur. Acquired by purchase from Planet Oil and Mineral Corporation and Horizon Sales Corporation in 1972, Sea Rim State Park opened to the public in 1977. Texas Parks and Wildlife was provided $2 million for the recovery of Sea Rim State Park by the 81st Legislature. With these funds, the department has developed a master plan to restore the park in a two phase process"}, {"url": "https://en.wikipedia.org/wiki/Sea_Rim_State_Park", "passage_text": "Sea Rim State Park (upper right), south of Port Arthur, along the Gulf coast of southeast Texas. Sea Rim State Park is a 4,141-acre (1,676 ha) state park in southeast Texas. The park is located on the Gulf of Mexico in southern Jefferson County, south of Port Arthur and just west of Sabine Pass. The park was closed for several years due to extensive damage from Hurricanes Rita (2005) and Ike (2008)"}, {"url": "http://www.beaumontenterprise.com/life/article/Sea-Rim-State-Park-IS-actually-open-3723675.php", "passage_text": "Photo: File. This is the what was left of the Sea Rim State Park Welcome Center that was heavily damaged by Hurricane Rita,and never fully repaired before it took a major blow from Hurricane Ike in 2008. Enterprise file ... more."}]