[{"url": "http://www.worldwildlife.org/species/mountain-gorilla", "passage_text": "As humans have moved into areas near mountain gorillas, they have cleared land for agriculture and livestock. Even land within protected areas is not safe from clearing—in 2004, for example, illegal settlers cleared 3,700 acres of gorilla forest in Virunga National Park. Since the discovery of the mountain gorilla subspecies in 1902, its population has endured years of war, hunting, habitat destruction and disease—threats so severe that it was once thought the species might be extinct by the end of the twentieth century."}, {"url": "http://www.cnn.com/2012/04/13/world/africa/mountain-gorillas-rwanda-inside-africa/index.html", "passage_text": "Rwanda's mountain gorillas – A baby mountain gorilla. The world's largest mountain gorilla population is found in a mountainous region known as the Virungas, incorporating Volcanoes, Uganda's Mgahinga Gorilla National Park, and Virunga National Park in the Democratic Republic of Congo. Mountain gorillas are not frequently hunted for their meat, but can be maimed or killed by poachers leaving traps or snares for other animals. They have also been killed for their body parts to be sold to collectors."}, {"url": "http://www.nydailynews.com/news/world/uganda-mountain-gorilla-population-rises-article-1.1204975", "passage_text": "Mountain gorillas in the wild still face threats ranging from habitat loss to poaching, especially in Congo, where lawlessness in the country's vast eastern territory has allowed illegal hunters to prosper. Mountain gorillas are hunted for their meat in Congo, according to the World Wildlife Fund. Even a common cold can kill a mountain gorilla, as species is particularly vulnerable to respiratory diseases usually associated with humans. "}, {"url": "http://pin.primate.wisc.edu/factsheets/entry/gorilla/cons", "passage_text": "Photo: Bryan Lenz. All gorillas face a very high risk of extinction in the wild in the near future if current threats do not subside. Hunting, forest clearance for agriculture and timber, and disease are the main threats to gorilla survival and these problems continue to increase in intensity and extent. "}, {"url": "http://igcp.org/gorillas/threats/", "passage_text": "Habitat loss. The primary threat to mountain gorillas comes from forest clearance and degradation, as the region’s growing human population struggles to eke out a living. Conversion of land for agriculture and competition for limited natural resources such as firewood lead to varying degrees of deforestation. In the first two decades after their discovery, European and American scientists and trophy hunters killed over 50 mountain gorillas. To this day, poaching continues to jeopardize the gorillas’ survival. Poaching of mountain gorillas for food is extremely rare. It is now largely the result of unselective hunting with snares, which are set to catch antelope, bush pigs and other wildlife but occasionally kill or injure gorillas"}, {"url": "https://en.wikipedia.org/wiki/Mountain_gorilla", "passage_text": "The mountain gorilla (Gorilla beringei beringei) is one of the two subspecies of the eastern gorilla. The mountain gorilla is primarily a herbivore; the majority of its diet is composed of the leaves, shoots and stems (85.8%) of 142 plant species. It also feeds on bark (6.9%), roots (3.3%), flowers (2.3%), and fruit (1.7%), as well as small invertebrates. (0.1%)."}, {"url": "http://wwf.panda.org/what_we_do/endangered_species/great_apes/gorillas/mountain_gorilla/", "passage_text": "The mountain gorilla became known to science on 17 October 1902, and is a subspecies of eastern gorilla. It has longer hair, jaws and teeth, but slightly shorter arms, than the other subspecies, the eastern lowland gorilla. In the 100 years since its discovery, the mountain gorilla has endured uncontrolled hunting, war, disease, destruction of its forest habitat, and capture for the illegal pet trade."}, {"url": "http://wwf.panda.org/what_we_do/endangered_species/great_apes/gorillas/mountain_gorilla/", "passage_text": "Some primatologists believe the Bwindi gorillas may be a separate subspecies. Previous population. In the 100 years since its discovery, the mountain gorilla has endured uncontrolled hunting, war, disease, destruction of its forest habitat, and capture for the illegal pet trade. These factors led to a dramatic decline in numbers"}, {"url": "http://www.worldwildlife.org/species/mountain-gorilla", "passage_text": "The world’s smallest population of mountain gorillas—a subspecies of the eastern gorilla—is split in two and scientists have debated whether they may be two separate subspecies. Since the discovery of the mountain gorilla subspecies in 1902, its population has endured years of war, hunting, habitat destruction and disease—threats so severe that it was once thought the species might be extinct by the end of the twentieth century."}]