[{"url": "http://www.discoverlanzarote.com/", "passage_text": "Search. Welcome to Discover Lanzarote the independent guide to Lanzarote. Situated just 79 miles off the coast of Africa, Lanzarote is the most easterly of the Canary Islands. The island is 37 miles (60km) long and 12 miles (20 km) wide, making it the fourth largest island in the Canaries."}, {"url": "http://www.teneriferesorts.com/tenerife-places/canary-islands/lanzarote/", "passage_text": "Lanzarote. Lanzarote is situated just 70 miles off the coast of Africa and is the most easterly of the Canary Islands. The island is 37 miles long and 12 miles wide, making it the fourth largest island in the Canaries. Volcanic Origins."}, {"url": "http://www.lanzarote.com/", "passage_text": "Lanzarote is a unique place to discover. Lanzarote is the closest of the Canary Islands to Africa, just over 100 km away and a bit more than 1000 km from the mainland Spain. Its spectacular beaches and volcanic landscapes, with average annual temperature of 22°, Lanzarote is also known as the Island of eternal spring."}, {"url": "http://www.lanzaroteinformation.com/content/africa-lanzarote", "passage_text": "Although Lanzarote is part of Spain, the island is only around 120 km from Africa or 66 nautical miles. Did you know you can find a taste of Africa in central Puerto del Carmen?"}, {"url": "http://distance4.com/distance/Lanzarote/Africa", "passage_text": "Lanzarote is 4693.8 miles away from Africa. Lanzarote is located in the Canary Islands state of at the longitude of -13.6 and latitude of 29. Africa is located in the South_Africa state of Gauteng at the longitude of 28.2 and latitude of -25.7. Lanzarote is located nearly north side to Africa."}, {"url": "http://www.bigfoto.com/europe/lanzarote/", "passage_text": "In 1994, Lanzarote was declared a Reserve of the Biosphere by UNESCO. Lanzarote lies in the Atlantic Ocean, about 100 km from the African coast and 1,000 km from the Iberian Peninsular. It is the most easterly of the seven main Canary Islands, once known as the Fortune Islands."}, {"url": "http://www.teneriferesorts.com/tenerife-places/canary-islands/lanzarote/", "passage_text": "Lanzarote is situated just 70 miles off the coast of Africa and is the most easterly of the Canary Islands."}]