[{"url": "http://www.medicinenet.com/hoarseness/symptoms.htm", "passage_text": "Hoarseness is a harsh, rough quality to the voice. Hoarseness is generally caused by irritation of, or injury to, the vocal cords. The voice box, or larynx, is the portion of the respiratory (breathing) tract containing the vocal cords which produce sound. It is located between the pharynx and the trachea. The most common cause of acute laryngitis is infection, which...learn more ». Larynx Cancer (Throat Cancer) Symptoms of cancer of the larynx, the organ at the front of the neck, include hoarseness, a lump in the neck, sore throat, cough,"}, {"url": "http://www.healthline.com/symptom/hoarseness", "passage_text": "Some less common causes of hoarseness include: 1  polyps (abnormal growths) on the vocal cords. 2  throat, thyroid, or lung cancer. 3  damage to the throat, such as from the insertion of a tube. 4  male adolescence (when the voice deepens). 5  poorly functioning thyroid gland. "}, {"url": "http://www.drhull.com/EncyMaster/H/hoarseness.html", "passage_text": "Infectious causes. 1  Most infection-caused hoarseness is due to viral infection. 2  Most common viruses are rhinovirus (common cold virus), adenovirus, influenza virus, and parainfluenza virus. 3  Bacterial infection of the larynx region can occur. 1 Most infection-caused hoarseness is due to viral infection. 2  Most common viruses are rhinovirus (common cold virus), adenovirus, influenza virus, and parainfluenza virus. 3  Bacterial infection of the larynx region can occur."}, {"url": "http://www.medicinenet.com/hoarseness/symptoms.htm", "passage_text": "Hoarseness can also be caused by bacterial infection, overuse of the voice (such as from yelling or singing), inhalation of irritants (smoking, etc.), chronic sinusitis, reflux of acid from the stomach (GERD), tuberculosis, syphilis, and cancer of (or that has spread to) the larynx. The most common cause of acute laryngitis is infection, which...learn more ». Larynx Cancer (Throat Cancer) Symptoms of cancer of the larynx, the organ at the front of the neck, include hoarseness, a lump in the neck, sore throat, cough,"}, {"url": "http://www.pharmqd.com/resources/patient-guides/laryngitis-and-pharyngitis", "passage_text": "When the larynx and vocal cords are swollen and inflamed, the result is usually hoarseness or loss of voice. Laryngitis that develops over a short period of time is typically caused by a viral infection, but it can be part of a bacterial infection. A specialist of the ear, nose, and throat can perform tests on the vocal cords to determine the cause of the hoarseness and the appropriate treatment. For most cases of laryngitis, treatment consists of resting the voice box (not talking). Keeping the throat moist and the air humidified can be helpful."}, {"url": "http://www.entnet.org/content/common-problems-can-affect-your-voice", "passage_text": "Acute Laryngitis. Acute laryngitis is the most common cause of hoarseness and voice loss that starts suddenly. Most cases of acute laryngitis are caused by a viral infection that leads to swelling of the vocal cords. When the vocal cords swell, they vibrate differently, leading to hoarseness. Reflux of stomach juice into the throat can cause a variety of symptoms in the esophagus (swallowing tube) as well as in the throat. Hoarseness (chronic or intermittent), swallowing problems, a lump in the throat sensation, or throat pain are common symptoms of stomach acid irritation of"}, {"url": "http://www.mayoclinic.org/diseases-conditions/laryngitis/basics/causes/CON-20021565", "passage_text": "Causes of acute laryngitis include: 1  Viral infections similar to those that cause a cold. 2  Vocal strain, caused by yelling or overusing your voice. 3  Bacterial infections, such as diphtheria, although this is rare, in large part due to increasing rates of vaccination. Chronic laryngitis can cause vocal cord strain and injuries or growths on the vocal cords (polyps or nodules). These injuries can be caused by: 1  Inhaled irritants, such as chemical fumes, allergens or smoke. 2  Acid reflux, also called gastroesophageal reflux disease (GERD)."}, {"url": "http://www.medicinenet.com/hoarseness/article.htm", "passage_text": "Hoarseness can be caused by a number of conditions. The most common cause of hoarseness is acute laryngitis (inflammation of the vocal cords) caused most often by an upper respiratory tract infection (usually viral), and less commonly from overuse or misuse of the voice (such as from yelling or singing). Other causes of hoarseness include: 1  benign vocal cord nodules, cysts or polyps, 2  gastroesophageal reflux (GERD), 3  allergies, 4  inhalation of respiratory tract irritants, 5  smoking, 6  thyroid problems, 7  trauma to the larynx/vocal cords, 8  neurological conditions (such as Parkinson's disease and strokes), and."}, {"url": "http://www.medicalnewstoday.com/articles/180271.php", "passage_text": "The most common cause of laryngitis is a viral infection, often similar to those that cause the common cold or flu. Overusing the voice-cheering at an event, for example-can also cause inflammation of the larynx. In very rare instances, acute laryngitis can be caused by diphtheria, a bacterial infection. Not all hoarseness occurs as a result of an infection or laryngitis. Chronic hoarseness may be unrelated to laryngitis, with the cause varying in severity. Some causes of hoarseness include: 1  Cancer. 2  Age-related changes to the vocal cords. 3  Paralysis of the vocal cords as a result of another condition."}]