[{"url": "http://www.raysahelian.com/alkaloid.html", "passage_text": "Alkaloid substances in plants, Information on Vinca, Ergot and Ephedra alkaloid compounds by Ray Sahelian, M.D. An alkaloid is any of a class of organic compounds made up of carbon, hydrogen, nitrogen, and usually oxygen that are often derived from plants."}, {"url": "http://www.sciencedirect.com/science/article/pii/B978012378612800175X", "passage_text": "The transfer of alkaloids from food or feed into the milk of humans is of considerable concern, because newborn babies are very sensitive to toxins, and may derive all of their food from breast milk. Alkaloid transfer into the milk of cows, sheep, and goats can also lead to human poisoning."}, {"url": "http://www.fda.gov/Food/FoodborneIllnessContaminants/CausesOfIllnessBadBugBook/ucm071047.htm", "passage_text": "The plants most frequently implicated in pyrrolizidine poisoning are members of the Borginaceae, Compositae, and Leguminosae families. Consumption of the alkaloid-containing plants as food, contaminants of food, or as medicinals has occurred."}, {"url": "http://www.raysahelian.com/alkaloid.html", "passage_text": "Pyrrolizidine alkaloid These can cause toxic reactions in humans, primarily liver disease, when ingested with foods or herbal medicines. Comfrey, a well-known medicinal herb contains pyrrolizidine alkaloids that are capable of causing liver damage."}, {"url": "http://edepot.wur.nl/160741", "passage_text": "A large number of wild and cultured plants produce secondary metabolites that are toxic to humans and animals. Through accidental or intentional mixing of these plants with normal food and feed the consumers of these products will be exposed to the toxins. In this report tropane alkaloids will be discussed."}, {"url": "http://emedicine.medscape.com/article/816657-overview", "passage_text": "Numerous cases of anticholinergic poisoning also have resulted from belladonna alkaloid contaminants in foods, including commercially purchased Paraguay tea (an herbal tea derived from Ilex paraguariensis), hamburger, honey, stiff porridge made from contaminated millet, and homemade moon flower wine."}, {"url": "http://www2.mcdaniel.edu/Biology/botf99/herbnew/alkaloids.htm", "passage_text": "Alkaloids have many effects on humans and other animals: Known effects on mammals: 1  1. 2  Inhibit /activate enzymes-ADH (alcohol dehydrogenase), phosphatases Inhibit phosphodiesters which normally destroy cAMP which is involved in breakdown of fats and carbohydrates."}, {"url": "http://www.fda.gov/Food/FoodborneIllnessContaminants/CausesOfIllnessBadBugBook/ucm071047.htm", "passage_text": "Pyrrolizidine Alkaloids Poisoning. Pyrrolizidine alkaloid intoxication is caused by consumption of plant material containing these alkaloids. The plants may be consumed as food, for medicinal purposes, or as contaminants of other agricultural crops. Cereal crops and forage crops are sometimes contaminated with pyrrolizidine-producing weeds, and the alkaloids find their way into flour and other foods, including milk from cows feeding on these plants."}, {"url": "http://www2.mcdaniel.edu/Biology/botf99/herbnew/alkaloids.htm", "passage_text": "Glucsinolates-These mustard oil glycosides, often found in wild Brassica can cause gastroenteritis, salivation, diarrhea, and irritation of the mouth. When these compounds are modified, they can cause hyperthyroidism. Specific examples of alkaloids include: Steroid alkaloids i.e.."}]