[{"url": "http://www.irishhealth.com/article.html?id=22903", "passage_text": "The birth rate in Ireland is declining while the average age of women giving birth is increasing, according to latest statistics. However, according to the perinatal statistics report for 2012, released by the ESRI, Ireland still has the highest birth rate among EU countries."}, {"url": "http://www.irishhealth.com/article.html?id=22903", "passage_text": "Ireland's birth rate, at 15.6 per 1,000 population, is considerably above the EU average of 10.4 per 1,000, the report notes. We also have the highest fertility rate among EU countries. The average age of women giving birth was 31.9 years in 2012, compared to 31.7 years in 2011, and 30.6 in 2003."}, {"url": "http://www.rte.ie/news/2013/1119/487550-perinatal-statistics-esri/", "passage_text": "Ireland's birth rate is the highest in Europe versus the EU average of 10.4. It has dropped from a high of 16.8 per 1,000 population in 2008 to 16.2 per 1,000 in 2011 and 15.6 per 1,000 in 2012."}, {"url": "http://www.rte.ie/news/2013/1119/487550-perinatal-statistics-esri/", "passage_text": "The countries with the next highest birth rates are the UK at 12.8 and France at 12.6, followed by Sweden at 11.9 and Cyprus at 11.8. Germany had the lowest birth rate in Europe last year at 8.4. Perinatal mortality rates in Ireland continue to decline at 5.9 per 1,000 live and still births last year. In 2003, the rate was 8.6 per 1,000 live births and still births. The highest mortality rates were among babies born to mothers aged 40 to 44."}, {"url": "http://evoke.ie/news/ireland-birth-rate", "passage_text": "Ireland has the highest birth and fertility rates of any EU member nation, new statistics have found. While most women in Europe are having fewer children leading to a slowdown and even reversal of population growth in some countries, Irish mammies are bucking the trend."}, {"url": "http://www.indexmundi.com/ireland/birth_rate.html", "passage_text": "Birth rate: 15.18 births/1,000 population (2014 est.). Definition: This entry gives the average annual number of births during a year per 1,000 persons in the population at midyear; also known as crude birth rate."}, {"url": "http://evoke.ie/news/ireland-birth-rate", "passage_text": "At the other end of the spectrum, Eastern European countries such as Bulgaria, Croatia, Hungary, Poland and Romania had the lowest birth rates. Ireland also boasted the equal highest fertility rate in the EU with 2.01 births per female, sharing the mantle with France."}, {"url": "http://www.rte.ie/news/2012/1220/359766-esri-birth-rate/", "passage_text": "New figures from the ESRI show that Ireland has the highest birth rate of any of the 27 European Union countries. Over 74,000 babies were born in the country last year, representing a slight fall at 16 births per 1,000 of population."}, {"url": "http://www.irishtimes.com/news/ireland/irish-news/ireland-has-highest-birth-rate-in-the-eu-1.1553211", "passage_text": "It shows that Ireland recorded the highest fertility rate in the EU in 2011, with 2.05 live births per woman. It was followed by France, at 2.01 and the UK at 1.96, while Hungary recorded the lowest birth rate at 1.23."}]