[{"url": "http://wanttoknowit.com/where-do-elephants-live/", "passage_text": "Where Do Elephants Live? Elephants live in just 2 continents in the world-Africa and Asia. African elephants are found in 36 African countries. 2 species of elephants live in Africa-Savanna Elephants (which live in grasslands, marshes and beside lakes) and Forest Elephants (which live in dense rainforests). Asian elephants have smaller ears than African elephants"}, {"url": "http://www.defenders.org/elephant/basic-facts", "passage_text": "Range. African savannah elephants are found in savannah zones in 37 countries south of the Sahara Desert. African forest elephants inhabit the dense rainforests of west and central Africa. The Asian elephant is found in India, Sri Lanka, China and much of Southeast Asia. At the turn of the 20th century, there were a few million African elephants and about 100,000 Asian elephants. Today, there are an estimated 450,000 - 700,000 African elephants and between 35,000 - 40,000 wild Asian elephants."}, {"url": "http://www.answers.com/Q/What_is_the_climate_an_african_elephant_live_in", "passage_text": "Elephants are very social creatures. Both African and Asian elephants live in groups called herds. The herd is made up of cows or female elephants. Male or bull elephants leav … e their herd when 10-15 and join bachelor herds. The leader of a female elephant herd is called a matriarch. Forest elephants tend to live in jungle-like areas. Elephants are generally tropical; that is, they live between 23 deg N an … d 23 deg S latitude, usually towards the middle of that range-the equatorial zone."}, {"url": "http://www.answers.com/Q/What_is_the_climate_an_african_elephant_live_in", "passage_text": "African elephants live in grassy regions south of the Sahara Desert. So, living in the desert it is very hot and dry. It hardly ever rains. But when it does everything is brought to life. Forest elephants tend to live in jungle-like areas. Elephants are generally tropical; that is, they live between 23 deg N an … d 23 deg S latitude, usually towards the middle of that range-the equatorial zone."}, {"url": "http://www.livescience.com/27320-elephants.html", "passage_text": "African elephants live in sub-Saharan Africa, the rain forests of Central and West Africa and the Sahel desert in Mali. Asian elephants live in Nepal, India and Southeast Asia in scrub forests and rain forests. Male elephants are called bulls and females are called cows. After mating, the cow will be pregnant for around 22 months. When the baby elephant is finally born, it can weigh around 200 lbs. (91 kg) and stand about 3 feet (1 m) tall. A baby elephant is called a calf. As the calf grows, it will gain 2 to 3 lbs."}, {"url": "http://www.defenders.org/elephant/basic-facts", "passage_text": "Behavior. Elephants form deep family bonds and live in tight matriarchal family groups of related females called a herd. The herd is led by the oldest and often largest female in the herd, called a matriarch. Herds consist of 8-100 individuals depending on terrain and family size. At the turn of the 20th century, there were a few million African elephants and about 100,000 Asian elephants. Today, there are an estimated 450,000 - 700,000 African elephants and between 35,000 - 40,000 wild Asian elephants."}, {"url": "http://nationalzoo.si.edu/Animals/AsianElephants/factasianelephant.cfm", "passage_text": "A dexterous trunk and large, rasping molars allow Asian elephants to gather and process a wide variety of vegetation, including grasses and herbs, leaves, fruit, farm crops, and bark. In the wild, Asian elephants may live up to about 60 years but most do not live that long. Asian elephants once ranged from Iraq east through Asia south of the Himalayas, into southern China and possibly south to Java. However, centuries of hunting and habitat destruction caused dramatic declines"}, {"url": "http://nationalzoo.si.edu/Animals/AsianElephants/factasianelephant.cfm", "passage_text": "Size: Asian elephants live in large blocks of forest near water sources and grasslands, habitat that has been greatly reduced in the last half century. They inhabit India, Sri Lanka, Myanmar (Burma), Indonesia, Thailand, Cambodia, Vietnam, Laos, Malaysia, Nepal, Bangladesh, and southern China. In the wild, Asian elephants may live up to about 60 years but most do not live that long. Asian elephants once ranged from Iraq east through Asia south of the Himalayas, into southern China and possibly south to Java."}, {"url": "http://www.worldwildlife.org/species/savanna-elephant", "passage_text": "They are found throughout the grassy plains and bushlands of Africa. Savanna elephants live in eastern and southern Africa, where the highest densities are found in Botswana, Tanzania, Zimbabwe, Kenya, Namibia, Mozambique and South Africa. As a result of their visibility within the open areas where they live, Savanna elephants are well studied and populations are easily estimated"}]