[{"url": "https://en.wikipedia.org/wiki/AngularJS", "passage_text": "The AngularJS library works by first reading the HTML page, which has embedded into it additional custom tag attributes. Angular interprets those attributes as directives to bind input or output parts of the page to a model that is represented by standard JavaScript variables. AngularJS's design goals include: 1  to decouple DOM manipulation from application logic. 2  to decouple the client side of an application from the server side. 3  to provide structure for the journey of building an application: from designing the UI, through writing the business logic, to testing."}, {"url": "http://www.infoworld.com/article/2612801/javascript/what-s-so-special-about-google-s-angularjs.html", "passage_text": "Misko Hevery, of Google, is the founding co-author of AngularJS, a popular JavaScript UI framework that has seen considerable growth lately. Recently, Hevery outlined plans for AngularJS 2.0, which will improve on dependency injection but cut support for older browsers. "}, {"url": "https://en.wikipedia.org/wiki/AngularJS", "passage_text": "AngularJS (commonly referred to as  Angular ) is an open-source web application framework maintained by Google and by a community of individual developers and corporations to address many of the challenges encountered in developing single-page applications. AngularJS's design goals include: 1  to decouple DOM manipulation from application logic. 2  to decouple the client side of an application from the server side. 3  to provide structure for the journey of building an application: from designing the UI, through writing the business logic, to testing."}, {"url": "http://www.dotnet-tricks.com/Tutorial/angularjs/H917260512-What-is-AngularJS-and-Why-to-use-it?.html", "passage_text": "Keywords: angularjs introduction,angularjs features,angularjs version. AngularJS is an open-source JavaScript framework developed by Google. It helps you to create single-page applications, one-page web applications that only require HTML, CSS, and JavaScript on the client side. It is based on MV-* pattern and build well structured, easily testable, and maintainable front-end applications. AngularJS has changed the way to web development. It does not based on jQuery to perform its operations. Till now you are using ASP.NET, ASP.NET MVC, PHP, JSP, Ruby on Rails for web development but now you can do your complete web development by using most powerful and adaptive JavaScript Framework AngularJS"}, {"url": "http://www.w3schools.com/angular/", "passage_text": "This tutorial is specially designed to help you learn AngularJS as quickly and efficiently as possible. First, you will learn the basics of AngularJS: directives, expressions, filters, modules, and controllers. Then you will learn everything else you need to know about AngularJS: Events, DOM, Forms, Input, Validation, Http, and more."}, {"url": "https://docs.angularjs.org/guide/introduction", "passage_text": "AngularJS is a structural framework for dynamic web apps. It lets you use HTML as your template language and lets you extend HTML's syntax to express your application's components clearly and succinctly. Angular's data binding and dependency injection eliminate much of the code you would otherwise have to write. "}, {"url": "https://en.wikipedia.org/wiki/AngularJS", "passage_text": "According to JavaScript analytics service Libscore, AngularJS is used on the websites of NBC, Walgreens, Intel, Sprint, ABC News, and approximately 8,400 other sites out of 1 million tested in July 2015. AngularJS's design goals include: 1  to decouple DOM manipulation from application logic. 2  to decouple the client side of an application from the server side. 3  to provide structure for the journey of building an application: from designing the UI, through writing the business logic, to testing."}, {"url": "https://en.wikipedia.org/wiki/AngularJS", "passage_text": "AngularJS is built on the belief that declarative programming should be used to create user interfaces and connect software components, while imperative programming is better suited to defining an application's business logic. AngularJS's design goals include: 1  to decouple DOM manipulation from application logic. 2  to decouple the client side of an application from the server side. 3  to provide structure for the journey of building an application: from designing the UI, through writing the business logic, to testing."}, {"url": "http://www.codeproject.com/Articles/891718/AngularJS-Interview-Questions-and-Answers", "passage_text": "AngularJS is one of those hot topics which interviewer’s ask for Web programming. In this article we will run through some important Interview questions around AngularJS and how we should be go about answering the same. Do not forget to see our Learn MVC with Angular in 2 days i.e. (16 hours) video series. That’s what the use of Factory in Angular. For example see the below code we have a “Customer”, “Phone” and “Address” class. So now we would create different types of “Customer” object types using the combination of “Address” and “Phones” object."}]