[{"url": "http://www.depressionforums.org/forums/topic/17910-does-prozac-help-with-anxiety/", "passage_text": "Posted. Well i think that it being an SSRI drug, it can help with anxiety, actually alot of meds not marketed for certain things can work for other problems. I was taking prozac for my ocd, at a high dose, it worked wonders but didnt help my depression, go figure. But on the other hand prozac can make you jittery and antsy."}, {"url": "http://www.depressionforums.org/forums/topic/17910-does-prozac-help-with-anxiety/", "passage_text": "Hi...If you're looking for just personal experiences, Prozac did help with my anxiety. This was years ago--Prozac was the first AD I took. I had recently begun to experience panic attacks, though that wasn't why I was taking the PZ. I was taking it for depression."}, {"url": "http://www.webmd.com/anxiety-panic/understanding-anxiety-treatment", "passage_text": "Examples of SSRIs that are commonly used to treat chronic anxiety include Prozac, Zoloft, Celexa, Paxil, and Lexapro. The antidepressants Effexor and Cymbalta, which act on the brain chemicals serotonin and norephinephrine, and some of the tricyclic antidepressants, like Tofranil, may also help."}, {"url": "http://www.calmclinic.com/anxiety/drugs/antidepressants", "passage_text": "But doctors do commonly prescribe antidepressants to treat anxiety. They include: 1  Selective Serotonin Reuptake Inhibitors (SSRI) Examples include Lexapro, Paxil, Prozac, and Zoloft. 2  Serotonin-Norepinephrine Reuptake Inhibitors (SNRI) Examples include Cymbalta and Effexor."}, {"url": "http://www.panic-anxiety.com/articles/prozac-fluoxetine/", "passage_text": "I was prescribed Prozac (fluoxetine) in 1989, the same year that it was launched as an antidepressant and licensed to use in the treatment of anxiety disorders. My anxiety didn't improve and I started suffering from insomnia and head symptoms, including headaches and a 'buzzing sensation'."}, {"url": "http://www.ehow.com/way_5544140_prozac-generalized-anxiety.html", "passage_text": "Prozac For Anxiety. Prozac is prescribed for a variety of anxiety disorders such as OCD (obsessive compulsive disorder), manic depression, bulimia, bipolar disorder and panic attacks. These types of anxiety disorders are caused by imbalances of neurotransmitters in the brain."}]