[{"url": "http://www.selfhelpandmore.com/plumbing/copper-pvc-water-pipes.php", "passage_text": "1 Copper and PVC water pipes are relatively non-toxic. 2  Copper is a natural material that has been proven to be safe to health. 3  PVC pipes are also safe. 4  Lead on the other hand is extremely toxic. 5  Lead is corrosive and can leak into the drinking water system. 1 PVC is likewise a safe material to carry drinking water. 2  Copper and PVC water pipes do not suffer easily from corrosion, while iron corrodes relatively easily. 3  Copper is relatively easy to work with because it is much softer than iron or lead. 4  PVC water pipes are also much easier to shape"}, {"url": "https://answers.yahoo.com/question/index?qid=20100812070341AA2zsqo", "passage_text": "The plumbing company I work for will never use plastic pipes for potable (drinking) water. We use them only for waste water disposal. Don't drink water from PVC pipe as chemicals can be leached from the glue used to join the pipes into the water. If in doubt, call your town/city building inspector and ask. They can tell you if it is up to code for your area"}, {"url": "http://www.emaxhealth.com/8782/drinking-water-plastic-pipes-may-not-be-safe-chemical-additives-found", "passage_text": "By Tim Boyer G+. 2011-11-09 12:19. Drinking water from plastic pipes is used more often in construction than traditional copper piping for delivering water to homes and within homes to the faucet. Previous studies on plastic pipe safety for drinking water were limited to issues regarding taste and odor. "}, {"url": "http://www.wqpmag.com/picking-plastic-pipe", "passage_text": "PVC Pipe. Polyvinyl chloride (PVC) pipe is made from a thermoplastic resin that is less flexible than the resin used to make ABS pipe, and comes in a wide variety of sizes. It is typically used in drain, waste, vent and cold drinking water applications."}, {"url": "http://www.selfhelpandmore.com/plumbing/copper-pvc-water-pipes.php", "passage_text": "If the plumbing in your home is old, it is likely that your water pipes are made from iron, steel, or lead. Modern water pipes are almost always made from copper, although plastic or polyvinyl chloride (PVC) pipes are becoming popular too. 1 PVC is likewise a safe material to carry drinking water. 2  Copper and PVC water pipes do not suffer easily from corrosion, while iron corrodes relatively easily. 3  Copper is relatively easy to work with because it is much softer than iron or lead. 4  PVC water pipes are also much easier to shape"}, {"url": "http://diy.stackexchange.com/questions/31364/is-pvc-schedule-40-pipe-safe-to-use-in-a-potable-water-supply", "passage_text": "The solution is to replace your pipes with an approved material such as CPVC (a stronger type of PVC), PEX, or copper. All of these are considered safe for potable water (by the government and standards bodies), though one can find claims online of all of them being toxic. "}, {"url": "http://www.kudzu.com/article/GA/Atlanta/PVC-water-pipes-Safe-for-home-water-supply-id10001493", "passage_text": "While PVC pipes are certainly... Whether PVC water pipes are safe for potable water is a matter of some debate. While PVC pipes are certainly safer than lead pipes, copper is often deemed the more reasonable choice for internal home water plumbing, and PVC is not safe for potable hot water. CPVC is safe for hot water; however, there are some important pros and cons in the debate been plastic and copper piping. Internal plumbing. For internal plumbing, copper is considered the gold standard, particularly since PVC is not safe for hot water. Once the piping is past your home's water heater, it makes the most sense to use piping that can support hot and cold potable water."}, {"url": "http://www.todayshomeowner.com/are-plastic-water-pipes-safe/", "passage_text": "Those living in older homes should have their water tested to see if lead is a problem. Plastic pipe such as PVC (polyvinyl chloride, used for cold water only), and CPVC (chlorinated polyvinyl chloride, used for both hot and cold water) have been around for years, and both are approved for use with drinking water. "}]