[{"url": "https://www.esupplemental.com/cancer-insurance/", "passage_text": "Use the cash benefits from a cancer insurance policy to help with deductibles, co-insurance, mortgage payment, car payment, groceries, gas, cable bill, and any other daily living expenses you may have. Remember Health Insurance won’t write a check to your mortgage company but a cancer insurance policy can help. Find out if you need this kind of coverage and how to get it by completing the form to the right to request a no obligation quote. We will show you quotes from multiple top rated cancer insurance carriers. You should think about purchasing cancer insurance if: 1  You have a family history of cancer. 2  You don’t have enough in savings to pay medical bills your regular health insurance won’t cover. 3  You are your family’s sole wage earner. 4  You are concerned about protecting your family’s financial assets."}, {"url": "http://www.cancer.org/acs/groups/cid/documents/webcontent/002562-pdf.pdf", "passage_text": "These plans will not provide comprehensive coverage to treat a disease such as cancer and do not meet the requirement of the health care law to have insurance. If this is your only form of coverage, you will likely still face a penalty at tax time unless you’re exempted from the requirement to buy health insurance. Where to get private coverage: the health insurance marketplaces You can buy your insurance coverage (online, by phone, mail or in person) through health insurance marketplaces in each state. All plans sold in the marketplaces must meet the requirements of the ACA that make sure plans cover certain benefits."}, {"url": "http://www.cancercare.org/questions/147", "passage_text": "1 If you have a job and your employer offers health insurance, ask if you’re eligible to receive it or buy into it. 2  If you had insurance but lost your job within the last 60 days, ask if you’re eligible for COBRA. 3  COBRA is a law that lets you keep your insurance for 18 months, sometimes longer. A. I understand your concern about the cost, but if you think you have cancer, you can’t afford not to visit the doctor. Cancer responds to treatment better when it’s caught early, and if it turns out that you don’t have it, you will have peace of mind. There are 3 main ways to get health insurance :"}, {"url": "http://www.takepart.com/article/2013/02/11/insurance-coverage-critical-surviving-cancer", "passage_text": "No Problem—You Can Pay With Your Life. Cancer patients are twice as likely to die if they don't have health coverage. In 2009, 34 percent of Hispanics, 23 percent of African-Americans, 28 percent of American Indians, and 18 percent of Asians didn’t have health coverage, compared to 14 percent of whites."}, {"url": "https://www.trustedchoice.com/life-insurance/coverage-types/critical-illness/cancer/", "passage_text": "Life Insurance Coverage After Cancer. If you have had cancer, you should know that life insurance for cancer patients is available. The best way to know whether you can qualify is to learn about the way a life insurance company will evaluate you as a cancer survivor. You can potentially get life insurance following a cancer diagnosis, but it will depend on several factors. The most important information that a life insurance company will want to know include: 1  The date you were first diagnosed with cancer. 2  The type of cancer that was diagnosed. 3  Manner of treatment."}, {"url": "http://www.macmillan.org.uk/information-and-support/organising/your-finances/insurance/buying-and-claiming-health-insurance.html", "passage_text": "How cancer can affect buying insurance. If you've had cancer or you’re living with cancer, you can sometimes face higher premiums, special conditions or refusal when buying life insurance and some types of health insurance. This includes policies that have a health insurance element, such as travel insurance. Claiming on health insurance. If you’ve been diagnosed with cancer or you’re off work because of it, you may be able to claim against any health insurance policies you already have. Try to claim as soon as possible because there will usually be a time limit (for example, six months)."}, {"url": "http://www.cancer.org/acs/groups/cid/documents/webcontent/002562-pdf.pdf", "passage_text": "Health Insurance and Financial Assistance for the Cancer Patient Covering the costs of cancer treatment When you’re told you have cancer, how to pay for your care is not usually the first thing that comes to mind. Where to get private coverage: the health insurance marketplaces You can buy your insurance coverage (online, by phone, mail or in person) through health insurance marketplaces in each state. All plans sold in the marketplaces must meet the requirements of the ACA that make sure plans cover certain benefits."}, {"url": "http://www.cancerresearchuk.org/about-cancer/coping-with-cancer/coping-practically/travel/travel-insurance", "passage_text": "Getting travel insurance when you have had cancer can be difficult. From the company's point of view, you are a bigger risk. As they see it, having been ill, you are more likely to need medical treatment while you are abroad. Or they may think that illness could make you cancel your trip at the last minute. So you can get travel insurance, but if you need treatment as a result of the cancer, you will have to pay for it yourself. There are some insurance companies specialised in policies for people with pre existing medical problems. You can read about these further down the page."}, {"url": "https://www.esupplemental.com/cancer-insurance/", "passage_text": "1 Help pay your health insurance deductibles and co-pays or even the monthly premium for your health insurance. 2  Help pay the cost of gas for driving back and forth to treatments. 3  Help pay for childcare. 4  The cash from a cancer policy is paid directly to you so you can use it however you need. You should think about purchasing cancer insurance if: 1  You have a family history of cancer. 2  You don’t have enough in savings to pay medical bills your regular health insurance won’t cover. 3  You are your family’s sole wage earner. 4  You are concerned about protecting your family’s financial assets."}, {"url": "http://action.acscan.org/site/DocServer/Affordable_Care_Act_Through_the_Cancer_Lens_Final.pdf?docID=18421", "passage_text": "Learn how the new law could help you and the people you love. We have some of the best health care in the world, but for many years that care has gone to fewer and fewer people who can afford it. Cancer patients and survivors are denied coverage because of pre-existing conditions. They have to pay more than they can afford for the care they need. And they pay for health insurance that does not cover lifesaving cancer screenings, treatments, or follow-up care.Many people with cancer live in fear of losing their health coverage if they lose their job. It was found during a routine mammogram that was covered by the health insurance she had through her job. After her diagnosis, Kathi had eight rounds of chemo, a double mastectomy, and ongoing hormonal therapy. She has been cancer-free since. She credits early detection with finding her breast cancer."}]