[{"url": "http://homeguides.sfgate.com/difference-between-hybrid-tea-floribunda-roses-27319.html", "passage_text": "Flowers. The most striking difference between hybrid tea roses and floribundas are their flowers. Hybrid tea roses appear as a single blossom on a long stem, making them a favorite for cut flower arrangements. Floribunda, as the name implies, produces abundant clusters of flowers on its stems."}, {"url": "http://www.jacksonandperkins.com/floribundas/c/JP-Floribundas/", "passage_text": "If you love beautiful, large Roses, you'll love Floribundas! Hybrids producing generous, colorful blooms in impressive clusters, these shrubs are ideal for rows and hedges. Jackson and Perkins has a wide selection of colorful Floribundas, including several award-winning varieties of appealing colors and styles!"}, {"url": "http://www.merriam-webster.com/dictionary/floribunda", "passage_text": "Definition of FLORIBUNDA. : any of various bush roses with large flowers in open clusters that derive from crosses of polyantha and tea roses. ADVERTISEMENT. New Latin, feminine of floribundus flowering freely. First Known Use: 1898."}, {"url": "http://home.howstuffworks.com/floribunda-roses.htm", "passage_text": "Floribunda roses first became popular in the middle of the 20th century. They resulted from crosses between hybrid teas and polyanthas. They are renowned for their season-long clusters of medium-size blooms."}, {"url": "https://en.wikipedia.org/wiki/Floribunda_(rose)", "passage_text": "Floribunda (Latin for many-flowering) is a modern group of garden roses that was developed by crossing hybrid teas with polyantha roses, the latter being derived from crosses between Rosa chinensis and Rosa multiflora (sometimes called R. polyantha)."}, {"url": "http://www.heirloomroses.com/roses/floribunda-roses.html", "passage_text": "Floribunda Roses. The Floribunda Rose is a crossbred flower that is loved for its hardiness in harsh climates, minimal upkeep, and its ability to have continual blooms. They are recongnized for their familiar traits of stocky and rigid shrubbery with an abundance of color, fragrance and beauty."}, {"url": "http://www.bhg.com/gardening/plant-dictionary/rose/floribunda-rose/", "passage_text": "Floribunda roses offer a bouquet on every branch. The small flowers look like elegant hybrid tea blooms but appear in clusters instead of one flower per stem. Floribundas are a cross between polyantha species roses and hybrid teas, combining hardiness, free flowering, and showy, usually fragrant blooms."}]