[{"url": "https://www.algaecal.com/algaecal-ingredients/vitamin-d/sources/", "passage_text": "There are only a few foods that are good sources of vitamin D, 4 so vitamin D supplements are often recommended unless you are exposed to sunlight on your skin regularly. Suggested dietary sources of vitamin D are listed below. Table 1: Selected food sources of vitamin D10-12. Food. "}, {"url": "http://ods.od.nih.gov/factsheets/VitaminD-HealthProfessional/", "passage_text": "Vitamin D is a fat-soluble vitamin that is naturally present in very few foods, added to others, and available as a dietary supplement. It is also produced endogenously when ultraviolet rays from sunlight strike the skin and trigger vitamin D synthesis. Vitamin D in these foods is primarily in the form of vitamin D 3 and its metabolite 25(OH)D 3 [ 12 ]. Some mushrooms provide vitamin D 2 in variable amounts [ 13, 14 ]. Mushrooms with enhanced levels of vitamin D 2 from being exposed to ultraviolet light under controlled conditions are also available."}, {"url": "http://www.fitnessmagazine.com/recipes/healthy-eating/superfoods/top-10-superfoods-for-skin-and-hair/", "passage_text": "This leafy green vegetable is rich in nutrients and antioxidants. Spinach is loaded with lutein, which keeps your eyes healthy and sparkling. Spinach is also a good source of vitamins B, C, and E, potassium, calcium, iron, magnesium, and omega-3 fatty acids. Wild Salmon. Wild salmon — not farm-raised — is one of the best food sources for omega-3 fatty acids, which helps keep your skin supple and moisturized. Salmon also has selenium, a mineral that protects the skin from sun exposure. The vitamin D in salmon keeps your bones and teeth strong and healthy, too"}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/adult-health/expert-answers/healthy-skin/faq-20058184", "passage_text": "Research on the best foods for healthy skin is limited. Still, antioxidant-rich foods seem to have a protective effect for the skin. Consider these skin-friendly foods: 1  Carrots, apricots, and other yellow and orange fruits and vegetables. 2  Spinach and other green leafy vegetables. 3  Tomatoes. 4  Blueberries. 5  Beans, peas and lentils. 6  Salmon, mackerel and other fatty fish."}, {"url": "http://www.medicinenet.com/foods_for_healthy_skin_pictures_slideshow/article.htm", "passage_text": "Low-fat dairy products are excellent sources of vitamin A, an important component of healthy skin. Vitamin A is essential for skin cell development, and getting adequate amounts in the diet can maintain strong, supple skin. Healthy skin cells hold moisture better, which results in plumper, younger-looking skin. Good sources of omega-3 and omega-6 fatty acids include salmon, walnuts, canola oil, and flaxseed. Essential fatty acids also pretect against inflammation, which is good for our hearts and arteries, as well as our skin."}, {"url": "http://www.medicinenet.com/foods_for_healthy_skin_pictures_slideshow/article.htm", "passage_text": "Eating a balanced diet and drinking plenty of water is the best way to get the nutrients needed for healthy, young-looking skin. Some foods are touted for their benefits to your complexion. We will talk about some of the best foods to eat for glowing, healthy skin on the following slides. Healthy skin cells hold moisture better, which results in plumper, younger-looking skin. Good sources of omega-3 and omega-6 fatty acids include salmon, walnuts, canola oil, and flaxseed. Essential fatty acids also pretect against inflammation, which is good for our hearts and arteries, as well as our skin."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/adult-health/expert-answers/healthy-skin/faq-20058184", "passage_text": "On the flip side, some foods seem to be associated with skin damage. For example, some research suggests that a diet high in processed or refined carbohydrates and unhealthy fats promotes skin aging. Remember, many of the best foods for healthy skin also promote good health overall. Still, antioxidant-rich foods seem to have a protective effect for the skin. Consider these skin-friendly foods: 1  Carrots, apricots, and other yellow and orange fruits and vegetables. 2  Spinach and other green leafy vegetables. 3  Tomatoes. 4  Blueberries. 5  Beans, peas and lentils. 6  Salmon, mackerel and other fatty fish."}]