[{"url": "http://www.pmgenerators.com/how-permanent-magnet-generators-work/", "passage_text": "Permanent Magnet Generators are Highly Durable. As permanent magnet generators do not require a battery to work, these are ideal for homes which are located in remote regions where it is hard to gather spare parts and find qualified mechanics. Permanent magnet generators are relatively easy to set up and these are also small in size which further adds to the mobility and helps in saving space in a place where these are installed. Benefits of Using Permanent Magnet Generators."}, {"url": "http://www.alxion.com/permanent-magnet-generator/", "passage_text": "A permanent magnet generator is a device that converts mechanical energy to electrical energy. In this device the rotor windings have been replaced with permanent magnets. These devices do not require a separate DC supply for the excitation circuit or do they have slip rings and contact brushes. The demand for these devices is increasing day by day. With the increasing cost of electricity people are looking for an alternate source of energy and the permanent magnet generator perfectly fits in that place. These devices do not use any environmental resources to produce energy and thus are environment friendly."}, {"url": "http://www.pmgenerators.com/how-permanent-magnet-generators-work/", "passage_text": "Also, permanent magnet generators do not require additional current for the excitation circuit. These generators do not use slip rings which aids in a maintenance free and simple design. Once you install a permanent magnet generator, you can expect years of dependable service from these machines. The sealed construction of these generators also makes them ideal for usage in harsh environments that contain dust, grit and heat. Permanent magnet generators are relatively easy to set up and these are also small in size which further adds to the mobility and helps in saving space in a place where these are installed. Benefits of Using Permanent Magnet Generators."}, {"url": "https://en.wikipedia.org/wiki/Permanent_magnet_synchronous_generator", "passage_text": "Permanent magnet generators (PMG's) or alternators (PMA's) do not require a DC supply for the excitation circuit, nor do they have slip rings and contact brushes. The term synchronous refers here to the fact that the rotor and magnetic field rotate with the same speed, because the magnetic field is generated through a shaft mounted permanent magnet mechanism and current is induced into the stationary armature."}, {"url": "http://www.dangerouslaboratories.org/altp1.html", "passage_text": "Permanent magnet alternators have a big advantage over regular field-wound alternators. Permanent Magnet Alternators do NOT require a battery to generate power. This is important if you are generating in a remote area with no auto parts store nearby. "}, {"url": "http://www.alxion.com/permanent-magnet-generator/", "passage_text": "If you are considering a permanent magnet DC generator then the inductor will be found at the stator with an array of permanent magnets. But in case of an AC generator the inductor is located at the rotor with an assembly of permanent magnets. A PMG reduces loses in the rotor by 20 to 30 percent. The demand for these devices is increasing day by day. With the increasing cost of electricity people are looking for an alternate source of energy and the permanent magnet generator perfectly fits in that place. These devices do not use any environmental resources to produce energy and thus are environment friendly."}, {"url": "https://en.wikipedia.org/wiki/Permanent_magnet_synchronous_generator", "passage_text": "A permanent magnet synchronous generator is a generator where the excitation field is provided by a permanent magnet instead of a coil. The term synchronous refers here to the fact that the rotor and magnetic field rotate with the same speed, because the magnetic field is generated through a shaft mounted permanent magnet mechanism and current is induced into the stationary armature."}, {"url": "https://en.wikipedia.org/wiki/Alternator", "passage_text": "An alternator that uses a permanent magnet for its magnetic field is called a magneto. Alternators in power stations driven by steam turbines are called turbo-alternators. Large 50 or 60 Hz three phase alternators in power plants generate most of the world's electric power, which is distributed by electric power grids. "}, {"url": "http://www.windbluepower.com/Articles.asp?ID=124", "passage_text": "A Permanent Magnet Alternator is a modified car alternator in which the electro-magnet in the rotor of the alternator has been replaced with a very strong Neodymium rare earth magnet. "}]