[{"url": "https://en.wikipedia.org/wiki/Benidorm", "passage_text": "History [edit]. It is believed there were settlements in the Benidorm area possibly as far back as 3000 BC, including evidence of Roman and Punic remains. However, settlements in the area were small and it was not until the arrival of the Moors (from whom the town derived its Arabic origin name) that the local population began to grow. Benidorm’s history for the next few centuries was plagued by attacks from the sea by Ottoman and Barbary pirates. The 17th century saw conditions improve for Benidorm and its people, most notably with the construction of an advanced irrigation system in 1666 to channel water to the region."}, {"url": "http://www.benidorm-info.com/hotels-benidorm//", "passage_text": "Benidorm 3503, Alicante, Spain. Location: Orange Hotel is located in a lively central hotel area in Benidorm town, just 250m from Levante Beach. The location, its modern facilities and a careful service turn Orange Hotel into an excellent option to enjoy a wonderful holiday, in winter or summer. The La Era park apartments is lively around the swimming pool and bar making it popular for younger fun lovers. Location La Era park apartments. Located on a slight hill 740m from Levante beach, and 450m from Benidorm's Old Town in a quieter area near to Aiguera park."}, {"url": "http://www.alicante-spain.com/benidorm.html", "passage_text": "To get from Alicante Airport to Benidorm, you can take the new Benidorm Bus from the Airport or the narrow gauge railway from downtown Alicante. The so called FGV is the little Benidorm Denia train which is also a wonderful way of getting around the Costa Blanca area. Benidorm’s two beaches, the playa de poniente and the playa de levante are about 5 km long in total. Along most of the Playa de Poniente Beach, a main Benidorm road with heavy traffic passes by. So, if you are looking for a quiet and relaxing bath under Benidorm’s sun, you should go for the Playa de Levante."}, {"url": "http://www.benidorm-info.com/hotels-benidorm//", "passage_text": "Location. The Magic Villa de Benidorm hotel is located in Rincon de Loix and 250 metres from Levante beach. Shops, bars, restaurants and a mini supermarket are only 100 metres, with the resort centre & nightlife are apprximatly 1 kilometre away. The La Era park apartments is lively around the swimming pool and bar making it popular for younger fun lovers. Location La Era park apartments. Located on a slight hill 740m from Levante beach, and 450m from Benidorm's Old Town in a quieter area near to Aiguera park."}, {"url": "http://www.servigroup.com/en/hotels-in-benidorm/servigroup-orange-hotel/", "passage_text": "SERVIGROUP ORANGE HOTEL IN BENIDORM. The Hotel is located in a lively hotel area of Benidorm, just 250 m. walk from Levante Beach. The hotel locating, modern facilities, an excellent gastronomic choice, and an attentive service turn this hotel into an excellent option to enjoy a wonderful holiday all year round. Promotion only valid for our hotels in Benidorm. The transfer will only be to and from the Alicante airport (ALC). This promotion is only valid for flights from United Kingdom or Ireland. The transfer must be booked through the Resort Care company in the search engine that appears in this webpage."}, {"url": "http://www.clubitbenidorm.com/benidorm_nightlife.html", "passage_text": "Benidorm nightlife is one reason that makes Benidorm the holiday capital of the costa Blanca region. From all night clubbing on the top road, disco bars on the square to the hundreds of great bars from the new town to the old town. Benidorm Cabaret. Benidorm is also the home of cabaret and has some of the best shows and comedians on 7 nights a week and if you don’t make the effort to check out this side of the Benidorm nightlife scene then you are missing out."}, {"url": "http://thebenidormmap.com/benidorm_map.html", "passage_text": "Sinatra's Benidorm is a very popular venue in the new town of Benidorm, which offers a combination of a disco, live music and cabaret. The Why Not Karaoke bar is situated near the Levante beach in Benidorm and is owned by Lesley and Tad of The Yorkshire Pride 1, 2 and 3. Why Not Pub. The Triangle Pub, benidorm has been serving the British way since 1974, and has many families and customers returning year after year."}, {"url": "http://thebenidormmap.com/benidorm_map.html", "passage_text": "Rachel's Bar Benidorm which is situated in the Rincon de Loix area of Benidorm offers you everything you need for a great night out for the young & old alike! Rachel's Bar. If you like a spot of line-dancing then Red Dog authentic Western style bar on Calle Lepanto is the place for you. The Why Not Karaoke bar is situated near the Levante beach in Benidorm and is owned by Lesley and Tad of The Yorkshire Pride 1, 2 and 3. Why Not Pub. The Triangle Pub, benidorm has been serving the British way since 1974, and has many families and customers returning year after year."}, {"url": "http://www.alicante-spain.com/benidorm.html", "passage_text": "Benidorm or Benedorm like some like to call it, located about 45 km northeast of Alicante, just south of Altea is one main attraction along the costa blanca. Benidorm’s two beaches, the playa de poniente and the playa de levante are about 5 km long in total. Along most of the Playa de Poniente Beach, a main Benidorm road with heavy traffic passes by. So, if you are looking for a quiet and relaxing bath under Benidorm’s sun, you should go for the Playa de Levante."}, {"url": "http://www.alicante-spain.com/benidorm.html", "passage_text": "Benidorm. Benidorm or Benedorm like some like to call it, located about 45 km northeast of Alicante, just south of Altea is one main attraction along the costa blanca. Despite its skyscraper skyline, it stands for beach and nightlife, Lots of Benidorm nightlife. Benidorm’s two beaches, the playa de poniente and the playa de levante are about 5 km long in total. Along most of the Playa de Poniente Beach, a main Benidorm road with heavy traffic passes by. So, if you are looking for a quiet and relaxing bath under Benidorm’s sun, you should go for the Playa de Levante."}]