[{"url": "http://www.salon.com/2003/10/15/sya_wed_43/", "passage_text": "The key is in the first three words: “Some may see …” Some may see lizards crawling up my face when I am bathing. Some may not. Some may see Jews as the controllers of the world banking system. Some may see white bread as the cause of colon cancer. Some may not. Some may see the truth and some may see illusions. On this theory, love is a product of patriarchy, and acts analogously to Marx’s view of religion (the opiate of the people) that love is the opiate of women. The implication is that were they to shrug off the language and notions of ‘love,’ ‘being in love,’ ‘loving someone,’ and so on, they [women] would be empowered"}, {"url": "https://jesurgislac.wordpress.com/2008/05/30/feminism-the-patriarchy-and-parallel-paradigms/", "passage_text": "They say things like “Not all men are like this!” or “Men do bad things to other men, too!” But “the patriarchy” isn’t “all men”: it isn’t “non-feminists”. The patriarchy is a paradigm. Feminism is a parallel paradigm. "}, {"url": "http://www.academia.edu/8850958/The_Paradigm_of_the_Language_of_Patriarchy", "passage_text": "The Paradigm of the Language of Patriarchy. Download. 1 The Paradigm of the Language of Patriarchy Introduction As part of my Feminist Theories class, I chose to study how the language of patriarchy maintains this oppression and the many complex facets inherent in language and its use across disciplines. This certainly pertains to how the language of the patriarchy establishes that men are superior to women, and how societal construction of gender and roles are geared to maintain men in the uppermost position."}, {"url": "http://matriarchy.info/index.php?option=com_content&task=view&id=36&Itemid=26", "passage_text": "Synopsis: Inside the matriarchal culture another paradigm could emerge as a result of vast changes of climates. The nurturers and caretakers, the women, were substituted by men, who were more mobile in a state of emergency and had the ability of linear thinking, what was necessary at the edge of life or dead. If we claim to be rational, then we suppress-to ourselves and others-the emotional sources on which our rational arguments ground. At the same time I think, that living, acting or moving inside a given culture is carried by various configurations of emotions which determine what humans of this culture see or do not see."}, {"url": "https://answers.yahoo.com/question/index?qid=20080314122754AAJHLiX", "passage_text": "Best Answer: A paradigm is a worldview shared by a group of people based on values. A patriarchal culture is one in which males are regarded as dominant. A patriarchal paradigm, then, would mean a group of people who share the belief (or worldview) that males are dominant. Hope this helps!"}, {"url": "http://matriarchy.info/index.php?option=com_content&task=view&id=36&Itemid=26", "passage_text": "Emergence of a Paradigm. This essay is an invitation to reflect about modern world by studying our emotional fundamentals which create the characteristics of culture and inversely are formed by culture themselves. If we claim to be rational, then we suppress-to ourselves and others-the emotional sources on which our rational arguments ground. At the same time I think, that living, acting or moving inside a given culture is carried by various configurations of emotions which determine what humans of this culture see or do not see."}, {"url": "http://matriarchy.info/index.php?option=com_content&task=view&id=36&Itemid=26", "passage_text": "The Emotional Background of the Patriarchal Paradigm Emergence of a Paradigm This essay is an invitation to reflect about modern world by studying our emotional fundamentals which create the characteristics of culture and inversely are formed by culture themselves. If we claim to be rational, then we suppress-to ourselves and others-the emotional sources on which our rational arguments ground. At the same time I think, that living, acting or moving inside a given culture is carried by various configurations of emotions which determine what humans of this culture see or do not see."}, {"url": "https://en.wikipedia.org/wiki/Patriarchal", "passage_text": "For other uses, see Patriarch (disambiguation) . Patriarchy is a social system in which males hold primary power, predominate in roles of political leadership, moral authority, social privilege and control of property; in the domain of the family, fathers or father-figures hold authority over women and children. The female equivalent is matriarchy. Historically, patriarchy has manifested itself in the social, legal, political, and economic organization of a range of different cultures. Analysis of patriarchy and its effects is a major topic within the social sciences and humanities."}, {"url": "https://en.wikipedia.org/wiki/Patriarchal", "passage_text": "Many patriarchal societies are also patrilineal, meaning that property and title are inherited by the male lineage. The female equivalent is matriarchy. Historically, patriarchy has manifested itself in the social, legal, political, and economic organization of a range of different cultures. Analysis of patriarchy and its effects is a major topic within the social sciences and humanities."}]