[{"url": "http://www.marinwoodfire.org/about-us", "passage_text": "To provide improved local services, particularly fire protection, and to be able to secure bond financing, the Community Services District was formed in 1960. With bond funding, the CSD was able to purchase the land for Marinwood Park and to develop the firehouse, park, community center and pool. In 1972, the community again voted to tax itself for the purchase of the ridge of open space bordering the community in order to preserve it from development. The original purchase of 321 acres has grown to 812 acres as additional parcels were purchased and developers were required to set aside land as open space."}, {"url": "https://en.wikipedia.org/wiki/Lucas_Valley-Marinwood,_California", "passage_text": "Lucas Valley-Marinwood is a census-designated place (CDP) in Marin County, California, United States. It includes the neighborhoods of Lucas Valley and Marinwood. As of the 2010 census, the population was 6,094. In 1977, George Lucas purchased 1,267 acres (5.13 km 2) west of Marinwood, which he subsequently refashioned into Skywalker Ranch. The streets of lower Lucas Valley were named so their names all ended in berry."}, {"url": "http://www.marinwood.org/about-us/history", "passage_text": "History. Marinwood Community Services District is an agency of local government providing fire protection and emergency response services, street lighting, recreation programs and facilities, and parks and open space to the unincorporated community of Marinwood. "}, {"url": "http://www.marinwoodfire.org/services/community-risk-reduction/vegetation-clearance", "passage_text": "To help protect your home, the Marin County Open Space District, the Marinwood Community Services District, and County Service Area 13, in cooperation with the Marin County Fire Chiefs Association, invites and encourages you to mow grass on District lands thirty to one hundred feet of your property. Vegetation Clearance. A message from the Marin County Open Space District and the Marinwood Fire Department: Each year, the Open Space District and Marin Fire Agencies perform a variety of tasks to reduce the possibility of wildfire on the countys wild lands."}, {"url": "https://en.wikipedia.org/wiki/Lucas_Valley-Marinwood,_California", "passage_text": "The Lucas Valley community center and pool were also constructed by Eichler as a centerpiece of the neighborhood. In 1977, George Lucas purchased 1,267 acres (5.13 km 2) west of Marinwood, which he subsequently refashioned into Skywalker Ranch. The streets of lower Lucas Valley were named so their names all ended in berry."}, {"url": "http://www.marinwoodrealestateblog.com/", "passage_text": "2050 Huckleberry Rd., Marinwood. Just Listed For Sale in Marinwood: 2050 Huckleberry Rd., Marinwood $975,000 Status: Active Date listed for sale: 10/6/2015 Description: Sleek mid century modern atrium ... Just Sold in Mont Marin/San Rafael Park: 1778 Las Gallinas Ave., Mont Marin/San Rafael Park $930,000 Status: Sold Date Sold: 10/5/2015 Description: This home ..."}, {"url": "http://www.marinwoodrealestateblog.com/marinwood/", "passage_text": "Marinwood. Marinwood and the local surrounding communities make a wonderful place to call home! Just a short drive from Highway 101, the unincorporated community of Marinwood is the first town you reach on your drive to West Marin along Lucas Valley Road. The northernmost neighborhood of San Rafael is made up of 1900 acres which are bordered by open spaces of 800 acres. The Marinwood Community Center even has a preschool as part of the Recreation Center. You can rent BBQ areas or even the pool for parties. Throughout the year the Recreation Department puts on Friday Summer nights with live music, Holiday family activities and much more."}, {"url": "http://www.marinwoodfire.org/services/community-risk-reduction/vegetation-clearance", "passage_text": "It is extremely important that your clearance work does not start a fire and that you follow the guidelines below: 1  Confirm that the property you want to mow is owned by the Marin County Open Space District, the Marinwood Community Services District, or CSA 13, not your neighbor or another agency. Vegetation Clearance. A message from the Marin County Open Space District and the Marinwood Fire Department: Each year, the Open Space District and Marin Fire Agencies perform a variety of tasks to reduce the possibility of wildfire on the countys wild lands."}, {"url": "https://en.wikipedia.org/wiki/Lucas_Valley-Marinwood,_California", "passage_text": "Then, in 1846 he purchased 680 acres (2.8 km 2) of land from Timothy Murphy, grantee of Rancho San Pedro, Santa Margarita y Las Gallinas. The land encompassed present day Marinwood and a creek which was later named Miller Creek. In 1977, George Lucas purchased 1,267 acres (5.13 km 2) west of Marinwood, which he subsequently refashioned into Skywalker Ranch. The streets of lower Lucas Valley were named so their names all ended in berry."}]