[{"url": "http://matplotlib.org/api/colors_api.html", "passage_text": "Make a linear segmented colormap with name from a sequence of colors which evenly transitions from colors[0] at val=0 to colors[-1] at val=1. N is the number of rgb quantization levels. Alternatively, a list of (value, color) tuples can be given to divide the range unevenly. colors. a list of matplotlib color specifications, or an equivalent Nx3 or Nx4 floating point array (N rgb or rgba values). name. a string to identify the colormap. N. the number of entries in the map. The default is None, in which case there is one colormap entry for each element in the list of colors."}, {"url": "http://www.mathworks.com/help/matlab/ref/colormap.html", "passage_text": "colormap(map) sets the colormap for the current figure to the colormap specified by map. The figure colormap affects all axes in the figure, unless you set an axes colormap separately. Use this syntax if you want to use a built-in colormap with a specific number of colors or if you want to use a custom colormap. Return the colormap values for a specific axes by passing its axes handle to the colormap function. Create a figure with two subplots and return the axes handles, ax1 and ax2. Add a filled contour plot to each axes and use a different colormap for each axes."}, {"url": "http://www.mathworks.com/help/matlab/ref/rgb2hsv.html", "passage_text": "cmap = rgb2hsv(M) converts an RGB colormap M to an HSV colormap cmap. Both colormaps are m-by-3 matrices. RGB is an m-by-n-by-3 image array whose three planes contain the red, green, and blue components for the image. HSV is returned as an m-by-n-by-3 image array whose three planes contain the hue, saturation, and va"}, {"url": "http://www.mathworks.com/help/matlab/ref/colormap.html", "passage_text": "Built-In Colormap Functions. To use a built-in colormap with a specific number of colors, specify map as one of the built-in colormaps functions and pass it an integer value as an input argument. For example, colormap(parula(12)) uses a map with 12 colors from the parula colormap. Return the colormap values for a specific axes by passing its axes handle to the colormap function. Create a figure with two subplots and return the axes handles, ax1 and ax2. Add a filled contour plot to each axes and use a different colormap for each axes."}, {"url": "http://www.johnboccio.com/courses/Physics50L_2008/Matlab_2008S/Matlab_Exercises.pdf", "passage_text": "The colormap is particularly appropriate for displaying periodic functions. hsv(m) ---- is the same as hsv2rgb([h ones(m,2)]) where h is the linear ramp, h = (0:m-1)'/m. jet ------- ranges from blue to red, and passes through the colors cyan, yellow, and orange. It is a variation of the hsv colormap. The jet colormap is associated with an astrophysical fluid jet simulation from the National Center for Supercomputer Applications. See the Examples section. lines ----- produces a colormap of colors specified by the axes ColorOrder property and a shade of gray. Try it. Remember to use hold off when finished. Scalar Functions of Two Variables Often we want to visualize a scalar function of two variables, say, z = f(x,y), where each pair of values (x,y) generates a value for z. A plot of z as a function of x and y is a surface in three dimensions."}, {"url": "https://en.wikipedia.org/wiki/HSL_and_HSV", "passage_text": "HSL stands for hue, saturation, and lightness, and is also often called HLS. HSV stands for hue, saturation, and value, and is also often called HSB (B for brightness). A third model, common in computer vision applications, is HSI, for hue, saturation, and intensity. If we plot hue and (a) HSL lightness or (b) HSV value against chroma rather than saturation, the resulting solid is a bicone or cone, respectively, not a cylinder. Such diagrams often claim to represent HSL or HSV directly, with the chroma dimension deceptively labeled saturation."}, {"url": "http://www.mathworks.com/help/matlab/ref/colormap.html", "passage_text": "colormap name sets the colormap for the current figure to the built-in colormap specified by name. The new colormap uses the same number of colors as the current colormap. The figure colormap affects all axes in the figure, unless you set an axes colormap separately. Return the colormap values for a specific axes by passing its axes handle to the colormap function. Create a figure with two subplots and return the axes handles, ax1 and ax2. Add a filled contour plot to each axes and use a different colormap for each axes."}, {"url": "http://matplotlib.org/api/colors_api.html", "passage_text": "For a greater range of colors, you have two options. You can specify the color using an html hex string, as in: or you can pass an R, G, B tuple, where each of R, G, B are in the range [0,1]. colors. a list of matplotlib color specifications, or an equivalent Nx3 or Nx4 floating point array (N rgb or rgba values). name. a string to identify the colormap. N. the number of entries in the map. The default is None, in which case there is one colormap entry for each element in the list of colors."}, {"url": "http://matplotlib.org/api/colors_api.html", "passage_text": "A module for converting numbers or color arguments to RGB or RGBA. RGB and RGBA are sequences of, respectively, 3 or 4 floats in the range 0-1. This module includes functions and classes for color specification conversions, and for mapping numbers to colors in a 1-D array of colors called a colormap. colors. a list of matplotlib color specifications, or an equivalent Nx3 or Nx4 floating point array (N rgb or rgba values). name. a string to identify the colormap. N. the number of entries in the map. The default is None, in which case there is one colormap entry for each element in the list of colors."}, {"url": "http://www.mathworks.com/help/matlab/ref/rgb2hsv.html", "passage_text": "Description. cmap = rgb2hsv(M) converts an RGB colormap M to an HSV colormap cmap. Both colormaps are m-by-3 matrices. The elements of both colormaps are in the range 0 to 1. The columns of the input matrix M represent intensities of red, green, and blue, respectively. RGB is an m-by-n-by-3 image array whose three planes contain the red, green, and blue components for the image. HSV is returned as an m-by-n-by-3 image array whose three planes contain the hue, saturation, and va"}]