[{"url": "http://www.investopedia.com/ask/answers/031815/united-states-considered-market-economy-or-mixed-economy.asp", "passage_text": "The U.S. is clearly a mixed economy. The government controls or partially controls many goods or services, such as education, courts, roads, hospital care and postal delivery. It also provides subsidies to agricultural producers, oil companies, financial companies and utilities. Market Economy. A true or absolute free market economy requires that all property be owned by private individuals and all goods and services be privately provided. Prices are allowed to fluctuate based on supply and demand, and all transactions are voluntary, not compelled or restricted by government."}, {"url": "http://www.let.rug.nl/usa/outlines/economy-1991/how-the-united-states-economy-works/a-mixed-economy-the-us-system.php", "passage_text": "The economic system of the United States is principally one of private ownership. This system, often referred to as a free enterprise system, can be contrasted with a socialist economic system, which depends heavily on government planning and public ownership of the means of production. The market's primary force, however, is the interaction of producers and consumers; this has led analysts to dub the U.S. economic system a market economy.. As a rule, consumers look for the best values for what they spend, while producers seek the best price and profit for what they have to sell."}, {"url": "http://ecedweb.unomaha.edu/lessons/fecga.htm", "passage_text": "1 Tell students that in a mixed market economy like that of the United States, where both markets and government decisions play important roles, citizens often do not agree on the role of government in the economy and how it should carry out the six economic functions. Economists, however, identify six major functions of governments in market economies. Governments provide the legal and social framework, maintain competition, provide public goods and services, redistribute income, correct for externalities, and stabilize the economy."}, {"url": "http://ecedweb.unomaha.edu/lessons/fecga.htm", "passage_text": "In a market economy, such as the one established by our Constitution, most economic decisions are made by individual buyers and sellers, not by the government. Economists, however, identify six major functions of governments in market economies. Governments provide the legal and social framework, maintain competition, provide public goods and services, redistribute income, correct for externalities, and stabilize the economy."}, {"url": "http://www.infoplease.com/cig/economics/role-government-capitalist-economy.html", "passage_text": "By and large there is general agreement on the role of government in the U.S. economy, which is to 1  …. Provide the public goods that society requires. 2  Issue currency, levy taxes, and borrow money. 3  Maintain economic order, stability, and growth. This stands in sharp contrast to the role of government in a market economy. In a market economy, the government usually acts as a referee, ensuring that the market works properly and achieves the goal of delivering the greatest good to the greatest number of people. Toward that end, the U.S. government regulates certain activities in the market"}, {"url": "http://www.investopedia.com/ask/answers/031815/united-states-considered-market-economy-or-mixed-economy.asp", "passage_text": "Conversely, a mixed economic system has elements of both free markets and planned economic control by government. There are several different ways market economies are changed in a mixed economy. Governments might place regulatory restrictions on voluntary transactions in the private market. Market Economy. A true or absolute free market economy requires that all property be owned by private individuals and all goods and services be privately provided. Prices are allowed to fluctuate based on supply and demand, and all transactions are voluntary, not compelled or restricted"}, {"url": "https://wikis.engrade.com/economicsystems", "passage_text": "Definition. An economic system refers to the way in which the resources of a country are used to produce goods and services, and the manner in which these goods and services are distributed for consumption. Definition. Economic systems are characterised by the following: - role of government. {http://s3.amazonaws.com/engrade-myfiles/4062078742888268/concept_map_economic_systems.bmp}. Concept Map: Economic Systems. An economic system refers to the way in which the resources of a country are used to produce goods and services, and the manner in which these goods and services are distributed for consumption."}, {"url": "http://ecedweb.unomaha.edu/lessons/fecga.htm", "passage_text": "There is an economic role, such as provide for national defense, address environment concerns, protect property rights, and make market more competitive, for government in a market economy whenever the benefits of a government policy outweigh its costs. Economists, however, identify six major functions of governments in market economies. Governments provide the legal and social framework, maintain competition, provide public goods and services, redistribute income, correct for externalities, and stabilize the economy."}]