[{"url": "https://en.wikipedia.org/wiki/Purcell_Mountains", "passage_text": "The Purcells are shown on some United States maps as the Percell Mountains, where their southern limit protrudes into the states of Idaho and Montana, abutting Lake Koocanusa, a reservoir on the Kootenai River. American geographic classifications consider the Percells to be part of the Rocky Mountains but in Canada that terminology is reserved for ranges on the east side of the Rocky Mountain Trench. In the Purcell Mountains, most of the peaks are near or above 10,000 feet in elevation."}, {"url": "http://www.bosunsranch.com/discover-the-slocan/mountain-ranges/default.aspx", "passage_text": "The range is nestled between the Monashee Mountains to the west and the Purcell Mountains to the east. The Selkirk Mountains are characterized by steep, majestic peaks, lush vegetation and large glaciers. Famous Rogers Pass runs through the Selkirk Mountains to the north. The central Purcells (roughly between Duncan and Invermere) are home to the Purcell Wilderness Conservancy Park. It is a hiker’s dream with 202,709 hectares (500,000+ acres) of pristine wilderness. The park is undisturbed by roads or any other form of mechanized transportation including helicopters."}, {"url": "http://www.idahoaclimbingguide.com/bookupdates/purcell-mountains/", "passage_text": "Posted on April 25, 2014 by Tom Lopez. The Purcell Mountains, a Canadian range which extends south across the border into Idaho and Montana, is situated northeast of Bonners Ferry. The highest point in the Idaho section of the Purcells is 6,779-foot Buckhorn Mountain sits along the Idaho/Montana border. Regions: NORTHERN IDAHO Purcell Mountains. "}, {"url": "https://en.wikipedia.org/wiki/Purcell_Mountains", "passage_text": "From Wikipedia, the free encyclopedia. The Purcell Mountains are a mountain range in southeastern British Columbia, Canada. They are a subrange of the Columbia Mountains, which includes the Selkirk, Monashee, and Cariboo Mountains. American geographic classifications consider the Percells to be part of the Rocky Mountains but in Canada that terminology is reserved for ranges on the east side of the Rocky Mountain Trench. In the Purcell Mountains, most of the peaks are near or above 10,000 feet in elevation."}, {"url": "http://www.forwolves.org/ralph/wpages/purcellmts.htm", "passage_text": "Purcell Mountains. Beginning in northwest Montana, the Purcell Mountains rise and march northward into British Columbia, where they become a spectacular, forest and glacier-clad uplift, a part of what are generically called the Columbia Mountains. Copyright Ralph Maughan. The Purcells are separated from the Rockies by the Rocky Mountain Trench, an amazing valley that is about 600 miles long, but only one to five miles wide. British Columbia has protected one large roadless portion in the middle of the Purcells as the Purcell Wilderness Conservancy Park."}, {"url": "https://en.wikipedia.org/wiki/Selkirk_Mountains", "passage_text": "The Selkirk Mountains are a mountain range spanning the northern portion of the Idaho Panhandle, eastern Washington, and southeastern British Columbia. They begin at Mica Peak near Coeur d'Alene, Idaho and extend approximately 320 km north (200 miles) from the border to Kinbasket Lake, at the now-inundated location of the onetime fur company post Boat Encampment."}, {"url": "http://www.thecanadianencyclopedia.ca/en/article/purcell-mountains/", "passage_text": "Purcell Mountains. The Purcells are generally 300 to 600 m lower than the Rockies with the higher heights in the centre of the range. The highest peaks are Mount Farnham (3481 m), Mount Jumbo (3429 m), Howser Spire and Mount Delphine (both at 3399 m). The Purcell Mountains are one of the interior ranges of British Columbia. They are located in the southeastern part of the province between the ROCKY MOUNTAIN TRENCH to the east, KOOTENAY LAKE to the west, the Trans-Canada Highway to the north and extend beyond the US-Canadian border to the south"}, {"url": "https://en.wikipedia.org/wiki/Selkirk_Mountains", "passage_text": "From the Columbia's confluence with the Beaver River, they are bounded on their east by the Purcell Trench, which contains the Beaver River, Duncan River, Duncan Lake, Kootenay Lake and the Kootenay River. The Selkirks are distinct from, and geologically older than, the Rocky Mountains. They begin at Mica Peak near Coeur d'Alene, Idaho and extend approximately 320 km north (200 miles) from the border to Kinbasket Lake, at the now-inundated location of the onetime fur company post Boat Encampment."}, {"url": "https://en.wikipedia.org/wiki/Selkirk_Mountains", "passage_text": "Together with the neighboring Monashee and Purcell Mountains, and sometimes including the Cariboo Mountains to the northwest, the Selkirks are part of a larger grouping known as the Columbia Mountains. A scenic highway loop, the International Selkirk Loop, encircles the southern portions of the mountain range. They begin at Mica Peak near Coeur d'Alene, Idaho and extend approximately 320 km north (200 miles) from the border to Kinbasket Lake, at the now-inundated location of the onetime fur company post Boat Encampment."}]