[{"url": "http://drbenkim.com/articles/lung-damage.htm", "passage_text": "Health Warnings. Researchers at the National Institute of Environmental Health Sciences report that exposure to a chemical found in mothballs, air fresheners, and toilet deodorizers can cause lung damage and possibly even lung cancer, heart disease, and stroke. The chemical in question is called 1,4-dichlorobenzene or 1,4-DCB."}, {"url": "http://www.ct.gov/dph/lib/dph/environmental_health/eoha/pdf/moth_balls_fs.pdf", "passage_text": "Moth balls contain a toxic chemical, either naphthalene or paradichlorobenzene. Both become a gas when exposed to air and cause that pungent moth ball smell. These gases are irritating to the eyes and lungs and may cause headache, dizziness and nausea. They are both suspected of causing cancer."}, {"url": "http://www.ehow.com/info_12023293_causes-house-smell-like-mothballs.html", "passage_text": "Mothballs are made of naphthalene, a chemical that evaporates quickly and leaves a strong odor behind. If used for long periods or in poorly-ventilated spaces, the odor of dissipated naphthalene can remain long after the mothballs have been removed."}, {"url": "http://www.drugrehab.us/news/mothball-abuse/", "passage_text": "The fumes given off by the naphthalene in mothballs kills the larvae. Modern mothballs use a different chemical, called para-dichlorobenzene (p-DCB) because naphthalene is flammable. This compound, like naphthalene, gives off a strong odor and can kill moth larvae. This chemical is also used as a disinfectant, often in bathroom garbage cans and in urinals cakes. Mothballs, whether they contain naphthalene or p-DCB, work by giving off fumes."}, {"url": "http://npic.orst.edu/ingred/ptype/mothball/health.html", "passage_text": "Mothballs are nearly 100% active ingredient, and the active ingredient may be either naphthalene or paradichlorobenzene. Each active ingredient can cause different health effects if the exposure is high enough. Mothballs slowly turn from solids to toxic vapor. When you smell mothballs, you are inhaling the insecticide."}]