[{"url": "http://www.simplypsychology.org/zimbardo.html", "passage_text": "Procedure: To study the roles people play in prison situations, Zimbardo converted a basement of the Stanford University psychology building into a mock prison. He advertised for students to play the roles of prisoners and guards for a fortnight. Zimbardo (1973) was interested in finding out whether the brutality reported among guards in American prisons was due to the sadistic personalities of the guards (i.e. dispositional) or had more to do with the prison environment (i.e. situational)."}, {"url": "http://www.simplypsychology.org/zimbardo.html", "passage_text": "A study of prisoners and guards in a simulated prison. Naval Research Review, 30, 4-17. Further Information Zimbardo Zimbardo Prison Experiment Stanford Prison Simulation The Stanford Prison Experiment How to cite this article: McLeod, S. A. (2008). Zimbardo-Stanford Prison Experiment. by Saul McLeod published 2008. Aim: To investigate how readily people would conform to the roles of guard and prisoner in a role-playing exercise that simulated prison life. Zimbardo (1973) was interested in finding out whether the brutality reported among guards in American prisons was due to the sadistic personalities of the guards (i.e. dispositional) or had more to do with the prison environment (i.e. situational)."}, {"url": "http://www.rabe.org/serious-questions-about-spe/", "passage_text": "The Stanford Prison Experiment (SPE) by Phil Zimbardo has been for me an example of the astonishing things that we humans are capable of. I guess as an example of human gullibility, I had not been skeptical about the experiment, which lacks quite a few scientific markers (aside from its ethical problems). "}, {"url": "https://en.wikipedia.org/wiki/Stanford_prison_experiment", "passage_text": "The Stanford prison experiment (SPE) was a study of the psychological effects of becoming a prisoner or prison guard. The experiment was conducted at Stanford University on August 14–20, 1971, by a team of researchers led by psychology professor Philip Zimbardo. 1 The Experiment (2010), is a film released by Inferno Distribution which is an English-language remake of the 2001 film Das Experiment. 2  Prison School (first published February 7, 2011) is a Japanese serialized manga that heavily references the Stanford Prison Experiment as the inspiration for Kate's revenge plot."}, {"url": "https://en.wikipedia.org/wiki/Stanford_prison_experiment", "passage_text": "The Stanford prison experiment was in part a response to the Milgram experiment at Yale beginning in 1961 and published in 1963. The Third Wave was a 1967 recreation of Nazi Party dynamics by high school teacher Ron Jones in Palo Alto, California. 1 The Experiment (2010), is a film released by Inferno Distribution which is an English-language remake of the 2001 film Das Experiment. 2  Prison School (first published February 7, 2011) is a Japanese serialized manga that heavily references the Stanford Prison Experiment as the inspiration for Kate's revenge plot."}, {"url": "https://answers.yahoo.com/question/index?qid=20080909105637AAqY2ca", "passage_text": "Zimbardo and his team set out to test the idea that the inherent personality traits of prisoners and guards were key to understanding abusive prison situations. The Stanford experiment ended on August 20, 1971, only 6 days after it began instead of the 14 it was supposed to have lasted. I have recently been learning about the famous prison experiment by Phillip Zimbardo and although I understand everything that happened, I am slightly unsure as to what the actual purpose of the experiment was. Could somebody please help let me know. Add your answer. Source."}, {"url": "http://www.bbcprisonstudy.org/bbc-prison-study.php?p=17", "passage_text": "The Stanford Prison Experiment (SPE) took place in 1971. Young men were divided into the roles of Prisoner and Guard and put in a prison-like environment in the basement of the Psychology Department at Stanford University. The study was meant to last two weeks. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080909105637AAqY2ca", "passage_text": "Report Abuse. The Stanford prison experiment was a study of the psychological effects of becoming a prisoner or prison guard. The experiment was conducted in 1971 by a team of researchers led by psychologist Philip Zimbardo at Stanford University. I have recently been learning about the famous prison experiment by Phillip Zimbardo and although I understand everything that happened, I am slightly unsure as to what the actual purpose of the experiment was. Could somebody please help let me know. Add your answer. Source."}, {"url": "https://en.wikipedia.org/wiki/Stanford_prison_experiment", "passage_text": "1 Quiet Rage: The Stanford Prison Experiment (1992), is a documentary about the experiment, made available via the Stanford Prison Experiment website. 2  The documentary was written by Zimbardo and directed and produced by Ken Musen. 1 The Experiment (2010), is a film released by Inferno Distribution which is an English-language remake of the 2001 film Das Experiment. 2  Prison School (first published February 7, 2011) is a Japanese serialized manga that heavily references the Stanford Prison Experiment as the inspiration for Kate's revenge plot."}]