[{"url": "http://www.answers.com/Q/What_is_the_leader_of_a_marching_band_called", "passage_text": "Marching band-is where you march and play instruments. Concert band-you are seated in chairs playing instruments. Marching bands also do field shows and parades while th … ey play. These bands also include a color guard, who are people that spin flags This guy does NOT say the true difference. Marching band is 10000% different than concert band."}, {"url": "https://en.wikipedia.org/wiki/Bandleader", "passage_text": "From Wikipedia, the free encyclopedia. A bandleader is the leader of a band of musicians. The term is most commonly, though not exclusively, used with a group that plays popular music as a small combo or a big band, such as one which plays jazz, blues, rhythm and blues or rock and roll music. Most bandleaders are also performers with their own band. The bandleader role is dependent on a variety of skills, not just musicianship. A bandleader needs to be a music director and performer."}, {"url": "http://pdfjazzmusic.com/articles/6-things-every-band-leader-should-know/", "passage_text": "6 Things Every Band Leader Should Know. ….if you are or have been a Chicago musician, you will probably be familiar with Steve Hashimoto’s weekly newsletter called “News from the Trenches”. Steve is a bass player in the Chicago area, and his newsletter is great. Steve pulls no punches and tells it like it is. Last week he wrote a few comments about what band leaders should know or be aware of. I asked Steve if I could list them here and he agreed. Here they are…. Excerpted from Steve Hashimoto’s News from the Trenches…. ……On another front, I had another gig that showed the perils of being a bandleader (it wasn’t my gig)."}, {"url": "http://www.wikihow.com/Be-a-Good-Section-Leader", "passage_text": "1. Understand what being section leader means. Being a section leader is harder than being a non-section leader; not only do you have to worry about your music, but you have to worry about the music of your section. It also doesn't mean you get to be some dictator; you have to help your section. Warnings. 1  Remember: A good leader is selfless. 2  Don't be bossy. 3  Make sure you don't get too power-hungry; remember that being section leader doesn't mean you have to control every minute aspect of your section's lives. 4  Don't let other people in your section tell you or your section what to do."}, {"url": "http://www.thunderband.com/wp-content/uploads/2011/01/SectionLeaders.pdf", "passage_text": "Being a section leader is hard; not only do you have to worry about your music, but you have to worry about the music of your section. It also doesn't mean you get to be some dictator; you have to help your section. You are there to serve the people in your section, not to rule over them. Learn Names. An really easy and ridiculous way to motivate your section is to give stickers to them when they do. a good job. For some reason this works. Offer to throw a movie or pizza party if everyone memorizes their music by a. certain date. Warnings-Don't let other people in your section tell you or your section what to do."}, {"url": "https://en.wikipedia.org/wiki/Drum_major", "passage_text": "A drum major or Field Commander is the leader of a marching band, drum and bugle corps, or pipe band, usually positioned at the head of the band or corps. In addition, they serve as the liaison between the band director and the band. Essentially a drum major is the leader that keeps the rhythm and beat of time with the use of its baton or other forms of time keeping such as conducting. The drum major often holds the responsibility to keep the band organized and structured"}]