[{"url": "http://www.mahalo.com/how-to-file-for-south-carolina-extended-unemployment-benefits/", "passage_text": "Retroactive benefits have been paid to those who qualify by the South Carolina Department of Employment and Workforce. To receive South Carolina extended unemployment benefits, you'll need to do three things. First, you need to determine if you qualify for the EUC program. Then, you'll want to collect all of your vital information regarding your eligibility."}, {"url": "http://swz.salary.com/salarywizard/layouthtmls/swzl_unemployment_SC.html", "passage_text": "The duration of unemployment benefits in South Carolina may also differ from that of other states. You can compare state unemployment insurance programs, including eligibility, benefit amounts, and duration here. One-Click Job Search: Openings for in the United States."}, {"url": "http://unemploymenthandbook.com/state-unemployment-directory/south-carolina-unemployment", "passage_text": "The State Extended Benefits extends benefits for up to 13 additional weeks. State Extended Benefits are available for individuals who have exhausted all regular unemployment insurance and all Emergency Unemployment Compensation (EUC), First, Second, Third and Fourth Tier on or after February 15, 2009."}, {"url": "http://fileunemployment.org/south-carolina/extension", "passage_text": "All EUC payments will cease when the program ends. Total available weeks currently available in South Carolina are 48 weeks (Regular 20 weeks+ EUC 28 weeks – a final week of partial benefits is also available). Note: Currently South Carolina does not offer extended benefits (EB) . Unemployment Extension."}, {"url": "http://palmettoconnections.dew.sc.gov/important-information-for-claimants-federal-and-state-benefits-update/", "passage_text": "If there is no extension, South Carolina will no longer offer those benefits after Dec. 31. These benefits are for people who exhausted their first 20 weeks of state-funded unemployment and were found eligible for the federal program, which was designed to assist the long-term jobless as a result of the Great Recession."}, {"url": "http://unemploymenthandbook.com/state-unemployment-directory/south-carolina-unemployment", "passage_text": "I would like to know if I would be eligible for unemployment benefits if I quit. I was hired by a company in Houston to work out of North Carolina but after my training I was told I had to work in South Carolina. I have a two hour drive to work and a two hour drive home every day."}, {"url": "http://www.mahalo.com/how-to-file-for-south-carolina-extended-unemployment-benefits/", "passage_text": "Unemployed workers in South Carolina may qualify to receive extended unemployment benefits. This page will explain how to file for South Carolina extended unemployment benefits, but you should also consult the South Carolina Employment Security Commission website for complete details about the claim process."}, {"url": "http://unemploymenthandbook.com/state-unemployment-directory/south-carolina-unemployment", "passage_text": "If losing your job wasn’t your fault and your employer(s) paid taxes in your name, you can receive unemployment benefits if your year’s income prior to the quarter you lost work meets a specified minimum."}, {"url": "http://palmettoconnections.dew.sc.gov/answers-to-some-of-your-questions-about-unemployment-benefits/", "passage_text": "The Extended Benefits (EB) program is the final stage of federal Unemployment Insurance (UI), which means you have exhausted your 20 weeks of state UI and have qualified for four tiers of Emergency Unemployment Compensation (EUC). The EB program will end in South Carolina next week."}]