[{"url": "https://en.wikipedia.org/wiki/Thoroughbred", "passage_text": "The Thoroughbred is a horse breed best known for its use in horse racing. Although the word thoroughbred is sometimes used to refer to any breed of purebred horse, it technically refers only to the Thoroughbred breed. Thoroughbreds are considered  hot-blooded  horses, known for their agility, speed and spirit. The Thoroughbred as it is known today was developed in 17th-and 18th-century England, when native mares were crossbred with imported Oriental stallions of Arabian, Barb, and Turkoman breeding. Thoroughbreds in the United States have historically been used not only for racing but also to improve other breeds. The early import Messenger was the foundation of the Standardbred, and Thoroughbred blood was also instrumental in the development of the American Quarter Horse."}, {"url": "http://www.horsebreedslist.com/horse-breeds/110/thoroughbred", "passage_text": "USES. Although the Thoroughbred is primarily bred for racing, the breed is also used for show jumping and combined training because of its athleticism, and many retired and retrained race horses become fine family riding horses, dressage horses, and youth show horses. The Thoroughbred is a horse breed best known for its use in horse racing. Although the word thoroughbred is sometimes used to refer to any breed of purebred horse, it technically refers only to the Thoroughbred breed."}, {"url": "http://www.answers.com/Q/List_of_horse_breeds_for_racing", "passage_text": "The Thoroughbred. The Thoroughbred, Being shaped somewhat like the Akhal-Teke, is bred mostly for speed. Though the Thoroughbred is slim, fast and muscular the horse lacks the endurance of the Akhal-Teke and the Kuhaylan Arabian. This horse is not often used for long distance racing like its latter ancestors. The Akhal-Teke has influenced the Thoroughbred, Trakehner, Russian Don, Budyonny, Karabair, and the Karabakh. Has the endurance of an Arabian and is built thin and muscled. The Arabian. The Arabian horse, arguably the most beautiful breed of horse was originally breed for speed and endurance."}, {"url": "http://www.gamblingsites.com/horse-racing/basics/horse-types/", "passage_text": "The main forms of horse racing which most people bet on feature Thoroughbred horses. There are, however, several other breeds of horses involved in horse racing for sport. There are Arabian horses, Standardbreds and American Quarter Horses for example. These feature in other forms of horse racing such as harness racing, endurance riding and quarter horse racing. Although there are plenty of races for other breeds, the biggest races in the world are open only to Thoroughbred horses. Horses of this breed are known for their strength, speed and athleticism, and they are also used for other equestrian sports as well as racing."}, {"url": "https://answers.yahoo.com/question/index?qid=20110306181759AAJ6H6S", "passage_text": "Best Answer: Here in the USA, there is horse racing with pari-mutuel wagering offered on races involving the following breeds: Thoroughbreds. This is the most common racing breed, and Thoroughbreds are primarily bred for racing. Mostly they race only against other Thoroughbreds, but there are some racetracks that offer both Thoroughbred races and Quarter Horse races on the same card. At these tracks, very occasionally you will have Thoroughbreds and Quarter horses racing in the same races-- usually at 870 yards."}, {"url": "http://www.answers.com/Q/List_of_horse_breeds_for_racing", "passage_text": "Used as battle horses long ago, is considered one of the fastest racing breed known. The Akhal-Teke has influenced the Thoroughbred, Trakehner, Russian Don, Budyonny, Karabair, and the Karabakh. Has the endurance of an Arabian and is built thin and muscled. The Arabian. The Arabian horse, arguably the most beautiful breed of horse was originally breed for speed and endurance."}, {"url": "http://www.gamblingsites.com/horse-racing/basics/horse-types/", "passage_text": "Horses of this breed are used competitively in quarter horse racing, in which races typically take place over distances of a quarter of a mile. This is where the breed got its name from. These horses are also used to perform in rodeos and to work on ranches. Although there are plenty of races for other breeds, the biggest races in the world are open only to Thoroughbred horses. Horses of this breed are known for their strength, speed and athleticism, and they are also used for other equestrian sports as well as racing."}, {"url": "https://en.wikipedia.org/wiki/Thoroughbred", "passage_text": "Although the Thoroughbred is primarily bred for racing, the breed is also used for show jumping and combined training because of its athleticism, and many retired and retrained race horses become fine family riding horses, dressage horses, and youth show horses. Thoroughbreds in the United States have historically been used not only for racing but also to improve other breeds. The early import Messenger was the foundation of the Standardbred, and Thoroughbred blood was also instrumental in the development of the American Quarter Horse."}]