[{"url": "http://www.gardenguides.com/135700-difference-between-plants-fungi-animals.html", "passage_text": "Fungi and animals both contain a polysaccharide molecule called chitin that plants do not share. Chitin is a complex carbohydrate used as a structural component. Fungi use chitin as the structural element in the cell walls. In animals, chitin is contained in the exoskeleton of insects and in the beaks of mollusks. Plant cellulose is different than fungal cellulose. When X-rayed, plant cellulose is more crystalline than fungal cellulose. Both fungi and animals do not contain chloroblasts, which means that neither fungi nor animals can process photosynthesis."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_a_plant_cell_and_a_fungal_cell", "passage_text": "Plant cells have cell walls, large central vacuoles and in some cases chloroplasts. Plant cells have more of a boxy shape because of the cell wall. A plant cell can have chl … orophyll, which gives the plant its green color. On the other hand an animal cell is more curved because it has no cell wall, and they are not green because the cells contain no chlorophyll. Both plant and animal cells have cell membranes. Plant cells also contain what is called a cell wall. This cell wall gives plants cells much of its structure and makes them fa … irly rigid."}, {"url": "http://www.brighthubeducation.com/science-homework-help/8061-relationship-between-animal-plant-and-fungi-phylogeny/", "passage_text": "Differences Between Fungi and Animals. Some fungi are single-celled organisms, such as the yeasts. All metazoans, on the other hand, have multiple cells. Even the simplest animal, the sponge, consists of many cells specialized for different tasks. All animals are motile, that is, able to move independently, at least at some stage of development. The most obvious similarity between fungi and animals is their trophic level, that is, their place in the food chain. Neither fungi nor animals are producers as plants are. Both must use external food sources for energy. Fungi and animals share a molecule called chitin that is not found in plants. Fungi and many invertebrate animals use this complex carbohydrate for structural purposes. In fungi, chitin is the structural component of the cell walls"}, {"url": "http://www.stepbystep.com/difference-between-fungal-and-plant-cells-90144/", "passage_text": "The parasitic nature is one of the main differences between the two cells. Fungal cells are found mostly in moist habitats whereas Plant cells can be found in all habitats. The fungi cell walls are made from chitin, which is a derivative if glucose. On the other hand, cell walls of plants are made from cellulose. The fungal cells survive on nutrients which are from carbon-based life forms whereas plant cells produce their own food for survival. Plants produce food through the process of photosynthesis, which is a process of making food from water, sunlight and carbon dioxide. Both cells have uses also."}, {"url": "http://boards.straightdope.com/sdmb/showthread.php?t=266651", "passage_text": "The main differences are: * cell walls-fungi have them, animals don't. * sense organs (or tissues) - animals have them, fungi don't. * method of nutrient intake-fungi: absorption; animal: ingestion. * movement-animals move by cilia, flagella, or muscular structures/organs; fungi. A multicellular organism that undergoes photosyntesis is a plant, while one which does not is an animal or a fungus (I won't go into the difference between animals and fungi here)."}, {"url": "http://www.gardenguides.com/135700-difference-between-plants-fungi-animals.html", "passage_text": "Eukaryotes are any kind of organisms that have complex cells that include mitochondria, nuclei and other cell parts. The three major cell groups are fungi, plants and animals. Many fungi are only related to plants in a superficial way. They might look somewhat like plants and have cell walls that are similar to plant cell walls, but there is a phrenology tree that shows how fungi can be more closely related to animals than plants. Plant cellulose is different than fungal cellulose. When X-rayed, plant cellulose is more crystalline than fungal cellulose. Both fungi and animals do not contain chloroblasts, which means that neither fungi nor animals can process photosynthesis."}, {"url": "http://www.stepbystep.com/difference-between-fungal-and-plant-cells-90144/", "passage_text": "Difference Between Fungal and Plant Cells. Fungal cells or fungi are a group of eukaryotic organisms that belong to the fungi kingdom and are parasitic in nature. On the other hand, plant cells are living organisms that belong to the plantae kingdom and are non-parasitic in nature. The fungal cells survive on nutrients which are from carbon-based life forms whereas plant cells produce their own food for survival. Plants produce food through the process of photosynthesis, which is a process of making food from water, sunlight and carbon dioxide. Both cells have uses also."}, {"url": "http://www.ehow.com/about_6330037_difference-between-plants_-fungi-animals_.html", "passage_text": "Eukaryotes are any kind of organisms that have complex cells that include mitochondria, nuclei and other cell parts. The three major cell groups are fungi, plants and animals. Many fungi are only related to plants in a superficial way. They might look somewhat like plants and have cell walls that are similar to plant cell walls, but there is a phrenology tree that shows how fungi can be more closely related to animals than plants. Chitin is a complex carbohydrate used as a structural component. Fungi use chitin as the structural element in the cell walls. In animals, chitin is contained in the exoskeleton of insects and in the beaks of mollusks. Chitin functions similarly to plant cellulose, but chitin is stronger"}]