[{"url": "https://www.nlm.nih.gov/medlineplus/ency/article/001177.htm", "passage_text": "Medications that treat male pattern baldness include: 1  Minoxidil (Rogaine), a solution that is applied directly to the scalp to stimulate the hair follicles. 2  It slows hair loss for many men, and some men grow new hair."}, {"url": "https://www.sharecare.com/health/mens-health/health-guide/mens-health-guide/testosterone-can-cause-hair-loss-and-baldness-in-men", "passage_text": "The role of testosterone in premature balding has led to the myth that going bald is a sign of virility. However, men with male pattern baldness aren't any more well-endowed with testosterone than other guys. Their hair follicles are simply more sensitive to the hormones."}, {"url": "http://www.womenscenterforhairloss.com/hair-loss-in-women/hormonal-hair-loss", "passage_text": "Female pattern baldness occurs when dihydrotestosterone (DHT) levels become elevated in the scalp. Additionally, low levels of female hormones may cause male hormones to become relatively elevated in women, resulting in hair loss."}, {"url": "http://www.womenscenterforhairloss.com/hair-loss-in-women/hormonal-hair-loss", "passage_text": "Hormonal Hair Loss. When hormones are not in balance, hair loss can occur. A woman’s hormones can begin to decline and lose balance as early as when she is in her 30’s. There are many hormones that could cause hair loss. Male hormones, called androgens, are responsible for both female and male pattern"}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/001177.htm", "passage_text": "Causes. Male pattern baldness is related to your genes and male sex hormones. It usually follows a pattern of receding hairline and hair thinning on the crown, and is caused by hormones and genetic predisposition. Each strand of hair you have sits in a tiny hole (cavity) in the skin called a follicle."}, {"url": "http://www.healthline.com/health/male-pattern-baldness", "passage_text": "One cause of male pattern baldness is genetics, or having a family history of baldness. Research has found that male pattern baldness is associated with male sex hormones called androgens. The androgens have many functions including regulating hair growth."}, {"url": "https://www.sharecare.com/health/mens-health/health-guide/mens-health-guide/testosterone-can-cause-hair-loss-and-baldness-in-men", "passage_text": "Men graced with male pattern baldness genes inherit hair follicles that are oversensitive to the male hormone dihydrotestosterone (DHT). When testosterone is converted into DHT, it shrinks the hair follicles, resulting in shorter and finer hair until, eventually, hair growth stops altogether."}, {"url": "http://www.healthline.com/health/male-pattern-baldness", "passage_text": "Doctors use the pattern of hair loss to diagnose male pattern baldness. They may perform a medical history and exam to rule out certain health conditions as the cause, such as fungal conditions of the scalp or nutritional disorders."}]