[{"url": "https://en.wikipedia.org/wiki/Green_bean", "passage_text": "Haricots verts, French for green beans (also known as French beans, French green beans, French filet beans, or fine beans (British English)) is a variety of green beans that is longer, thinner, crisper, and more tender than standard green beans. It is different from the haricot bean, which is sold as a dried seed. Green beans, also known as string beans, or snap beans in the northeastern and western United States, are the unripe fruit and protective pods of various cultivars of the common bean (Phaseolus vulgaris)."}, {"url": "http://www.epicurious.com/recipes/food/views/haricots-verts-with-herb-butter-240576", "passage_text": "Preparation. 1  Stir together all ingredients except haricots verts with 3/4 teaspoon salt and 1/4 teaspoon pepper in a large bowl until combined well. 2  Cook beans in a large pot of boiling salted water (1 tablespoon salt for 6 quarts water), uncovered, until crisp-tender, about 6 minutes, then drain. 3  Toss with herb butter. 1 Stir together all ingredients except haricots verts with 3/4 teaspoon salt and 1/4 teaspoon pepper in a large bowl until combined well. 2  Cook beans in a large pot of boiling salted water (1 tablespoon salt for 6 quarts water), uncovered, until crisp-tender, about 6 minutes, then drain."}, {"url": "http://www.myrecipes.com/recipe/garlic-haricots-verts", "passage_text": "French for green beans, Haricots Verts refers to a longer, thinner type of green bean than the typical American green bean. Garlic, olive oil, salt and pepper is all you need to bring out the best flavor in this dish. 5. "}, {"url": "http://www.foodnetwork.com/recipes/haricots-verts-recipe.html#!", "passage_text": "Bring a small saucepan of salted water to a boil. Add the haricots verts and cook until just tender, about 1 minute. Transfer with a slotted spoon to an ice bath. Drain. In a large skillet, melt the butter over medium-high heat. Add the drained haricots verts and salt and pepper to taste, and cook, stirring, for 3 minutes, or until just heated through and crisp-tender"}, {"url": "http://homecooking.about.com/od/cookingfaqs/f/faqharicotvert.htm", "passage_text": "Answer: Haricot vert is indeed French for green beans. Haricot meaning beans and vert meaning green. French green beans are longer and thinner than most American varieties. They are also more tender and have a more complex flavor. For the most part, they are interchangeable with American green beans which are also called string beans or snap beans. If your recipe specifies haricot vert and you are unable to find them, substitute with the thinnest young green beans you can find. "}, {"url": "http://www.myrecipes.com/recipe/haricots-verts-salad", "passage_text": "Haricots verts is French for green string bean and refers to a type of long, thin, green bean. Here the beans are combined with pine nuts, basil and sundried tomatoes for a savory vegetable salad. 5. "}]