[{"url": "http://www.webmd.com/drugs/2/drug-63564/calcium-phosphate-vitamin-d3-oral/details", "passage_text": "Vitamin D is also made by the body as a result of exposure to the sun. Foods rich in calcium include: dairy products (e.g., milk, yogurt, cheese, ice cream), dark-green leafy vegetables (e.g., broccoli, spinach, bok choy), and calcium-fortified foods (e.g., orange juice). If there is not enough calcium in the blood, then the body will take calcium from bones, thereby weakening bones. Vitamin D helps your body absorb calcium and phosphorus. Having the right amounts of vitamin D, calcium, and phosphorus is important for building and keeping strong bones."}, {"url": "http://www.livestrong.com/article/250216-foods-rich-in-calcium-phosphorus/", "passage_text": "Fish, Meat and Dairy. Most types of meat, including beef, chicken and pork, are high in phosphorus but contain only low amounts of calcium. Many types of fish, however, including halibut, salmon and sardines, are rich in both calcium and phosphorus. Tuna contains a lot of phosphorus but not very much calcium--18mg per 3 oz. of cooked yellowfin. Dairy products like milk, cheese, milkshakes and yogurt are all very high in both calcium and phosphorus. Ice cream contains a lot of calcium, but significantly less phosphorus. "}, {"url": "http://www.pittsburgh.va.gov/Dialysis/docs/PhosphorusContentinFoods.pdf", "passage_text": "Phosphorus is a mineral found in many foods. When you have kidney disease, phosphorus may build up in your blood. This can weaken your bones over time. Phosphorus works with calcium to build bone. Your. body works best when these minerals are in balance. When calcium and phosphorus are out of balance. you may run the risk of bone tissue forming in your. heart, liver, and blood vessels. Some common symptoms of high. phosphorus include bone & joint pain, weakness, itching, bone weakness. and red eyes."}, {"url": "http://www.pediatriconcall.com/forpatients/DietandDisease/article.aspx?reportid=102", "passage_text": "(2). Foods Rich in Calcium and Phosphorus (3). Excellent sources of calcium include dairy products, spinach, turnip greens, mustard greens, and collard greens. Milk and juices fortified with calcium are also good sources of calcium. Foods rich in phosphates are all-bran cereal, almonds, cashew nuts, cheese, dried fruit, egg, garlic, legumes, lentils, meat, milk, peanuts, sesame seeds, sunflower seeds, whole wheat bread and yogurt. (4) It is present in the body in the form of phosphates (PO4). It forms calcium phosphate with calcium and forms the skeleton of the bones. Bone contains about 85% of the body's phosphate. The rest is located primarily inside cells and only 1% is present in the ECF (4,5)."}, {"url": "http://www.webmd.com/osteoporosis/news/20020320/bones-need-both-calcium-phosphorus", "passage_text": "Researchers say it's the first time the two elements have been shown to be co-dependent for bone health. Both calcium and phosphorus are found naturally in dairy products, but most calcium supplements and calcium-fortified foods and beverages don't contain phosphorus. March 20, 2002 -- Calcium alone can't build strong bones and tissues. New research shows calcium needs phosphorus to maximize its bone-strengthening benefits, and taking a lot of calcium supplements without enough phosphorus could be a waste of money."}, {"url": "http://www.mayoclinic.org/food-and-nutrition/expert-answers/FAQ-20058408", "passage_text": "Choose low-phosphorus foods. The best way to limit phosphorus in your diet is to limit foods highest in phosphorus, including: 1  Fast food, convenience foods and processed foods, which may be full of phosphorus additives. 2  Beverages that contain phosphorus (look for the letters phos in the ingredient list). Soups made with lower phosphorus ingredients (broth-or water-based with other lower phosphorus ingredients). Whole grains, including whole-grain breads, crackers, cereal, rice and pasta. White bread, crackers, cereals, rice and pasta. Quick breads, biscuits, cornbread, muffins, pancakes or waffles."}, {"url": "http://www.mayoclinic.org/food-and-nutrition/expert-answers/FAQ-20058408", "passage_text": "Calcium and phosphorus, which are minerals, help build strong bones. Healthy kidneys help regulate the level of phosphorus in your blood by removing extra phosphorus. If your kidneys aren't working properly, eventually you may have high phosphorus levels in your blood (hyperphosphatemia). Soups made with lower phosphorus ingredients (broth-or water-based with other lower phosphorus ingredients). Whole grains, including whole-grain breads, crackers, cereal, rice and pasta. White bread, crackers, cereals, rice and pasta. Quick breads, biscuits, cornbread, muffins, pancakes or waffles."}, {"url": "http://www.berkeleywellness.com/healthy-eating/food-safety/article/phosphorus-friend-or-foe", "passage_text": "The calcium content of phosphorus-containing foods may also matter, and may mitigate potential problems. In fact, dairy foods (high in both phosphorus and calcium) lower blood pressure, which is why they are an integral part of the DASH (Dietary Approaches to Stop Hypertension) diet. "}, {"url": "http://www.webmd.com/osteoporosis/news/20020320/bones-need-both-calcium-phosphorus", "passage_text": "Researchers say their study shows both calcium and phosphorus are needed to support any increase in bone mass, and a calcium supplement that contains phosphorus would be preferable to one that provides calcium alone. Other dietary sources of phosphates include eggs, cereals, and meats. March 20, 2002 -- Calcium alone can't build strong bones and tissues. New research shows calcium needs phosphorus to maximize its bone-strengthening benefits, and taking a lot of calcium supplements without enough phosphorus could be a waste of money."}, {"url": "http://www.whfoods.com/genpage.php?tname=nutrient&dbid=127", "passage_text": "In fact, the main crystalline structure in bone, called hydroxyapatite, consists of phosphorus, calcium, oxygen, and hydrogen, and calcium and phosphorus are so important in formation of hydroxyapatite that it is often referred to as a calcium phosphate molecule. "}]