[{"url": "http://semester6theory.wikispaces.com/file/view/ch+22.pdf", "passage_text": "CASE STUDIES You are admitting a newborn and performing a gestational age assessment. The infant weighs 6 pounds, 10 ounces; her length is 19 inches; her head circumference is 13 inches. An infant’s gestational age assessment reveals that her weight is SGA. This means thata. she was born before 37 completed weeks of gestation.b. her weight falls between the 10th and 90th percentile.c. she has a low birth weight in relation to her length.d."}, {"url": "http://www.ballardscore.com/", "passage_text": "The New Ballard Score is a set of procedures developed by Dr. Jeanne L Ballard, MD to determine Gestational Age through neuromuscular and physical assessment of a newborn infant. Physical characteristics are also key in determining gestational age. The eyes transform from being fused in very premature infants, to wide open in full-term babies. The skin and hair also give away important information in determining gestational age, as well as a host of other characteristics described in this site."}, {"url": "http://www.atitesting.com/ati_next_gen/skillsmodules/content/maternal-newborn/equipment/gestational_age.html", "passage_text": "To determine the approximate gestational age of a newborn, you’ll assess six neuromuscular and six physical characteristics. This assessment, the New Ballard Score, is appropriate for newborns from 20 to 44 weeks of gestation, with the characteristics to assess varying with the stage of maturity. Each parameter scores from minus 2 to 5, with the cumulative score correlating with a gestational age between 26 and 44 weeks. Timing of the gestational assessment influences the accuracy of its results. For newborns younger than 26 gestational weeks, perform the assessment sooner than 12 hours after birth. For newborns beyond 26 gestational weeks, perform the examination within 96 hours of birth."}, {"url": "http://www.medcomrn.com/?a=product/detailbase&basecode=78811ER", "passage_text": "Overview: This program focuses on the New Ballard Gestational Age Assessment. In the process of this discussion, both the assessment of neuromuscular maturity and that of physical maturity are examined. As the infant is assessed, reference is made to the system developed by Dr. Jeanne Ballard. "}, {"url": "https://en.wikipedia.org/wiki/Ballard_Maturational_Assessment", "passage_text": "It assigns a score to various criteria, the sum of all of which is then extrapolated to the gestational age of the baby. These criteria are divided into Physical and Neurological criteria. This scoring allows for the estimation of age in the range of 26 weeks-44 weeks. The New Ballard Score is an extension of the above to include extremely pre-term babies i.e. up to 20 weeks. The scoring relies on the intra-uterine changes that the fetus undergoes during its maturation"}, {"url": "https://quizlet.com/16239190/hesi-review-test-maternity-flash-cards/", "passage_text": "The nurse is performing a gestational age assessment on a full-term newborn during the first hour of transition using the Ballard (Dubowitz) scale. Admission weight of 4 pounds, 15 ounces (2244 grams). Head to heel length of 17 inches (42.5 cm). Frontal occipital circumference of 12.5 inches (31.25 cm). When assessing a client who is at 12-weeks gestation, the nurse recommends that she and her husband consider attending childbirth preparation classes. At 30-weeks gestation is closest to the time parents would be ready for such classes."}, {"url": "http://www.freezingblue.com/flashcards/print_preview.cgi?cardsetID=256737", "passage_text": "A labor room nurse is performing an assessment on a client in labor and notes that the fetal heart rate (FHR) is 158 beats/min and regular. The client's contractions are every 5 minutes, with a duration of 40 seconds and of moderate intensity. On March 10, 2015, the nurse performed an initial assessment on a client admitted to the labor and delivery unit for rule out labor.. The client has not received prenatal care but is certain that the first day of her last menstrual period (LMP) was July 7, 2014."}, {"url": "https://quizlet.com/16239190/hesi-review-test-maternity-flash-cards/", "passage_text": "Based on this assessment, the nurse determines that the neonate has a maturity rating of 40-weeks. Admission weight of 4 pounds, 15 ounces (2244 grams). Head to heel length of 17 inches (42.5 cm). Frontal occipital circumference of 12.5 inches (31.25 cm). When assessing a client who is at 12-weeks gestation, the nurse recommends that she and her husband consider attending childbirth preparation classes. At 30-weeks gestation is closest to the time parents would be ready for such classes."}, {"url": "https://quizlet.com/16239190/hesi-review-test-maternity-flash-cards/", "passage_text": "The nurse bases the explanation on knowledge that for the normal newborn, the. anterior fontanel closes at 12 to 18 months and the posterior by the end of the second month. In the normal infant the anterior fontanel closes at 12 to 18 months of age and the posterior fontanel by the end of the second month (D). When assessing a client who is at 12-weeks gestation, the nurse recommends that she and her husband consider attending childbirth preparation classes. At 30-weeks gestation is closest to the time parents would be ready for such classes."}, {"url": "http://www.ballardscore.com/", "passage_text": "This site is intended to provide detailed information on gestational age assessment, specifically focused on the New Ballard Score. In the Monograph section each maneuver and examination is described and illustrated in full detail. Use the score sheet to record the results of each examination. Physical characteristics are also key in determining gestational age. The eyes transform from being fused in very premature infants, to wide open in full-term babies. The skin and hair also give away important information in determining gestational age, as well as a host of other characteristics described in this site."}]