[{"url": "http://operations.nfl.com/the-players/the-nfl-draft/the-rules-of-the-draft", "passage_text": "Draft Rules and Process. The NFL Draft takes place over three days (Thursday through Saturday) each spring; this year the draft will be April 30 to May 2 in Chicago. Only the first round is held on Thursday. It starts at 8 p.m. Eastern time, and each team has 10 minutes to make its pick. "}, {"url": "http://www.answers.com/Q/How_long_does_the_first_round_in_the_NFL_draft_take", "passage_text": "Based on the 2013 NFL draft, a first round draft pick can expect to  sign a 4 year contract, earning between 1.7 million and 4.5 million  dollars per year (rounded). Obvious … ly the higher you are selected  in the draft, the higher your salary will be. Through the 2008 NFL draft, 33 first rounders have come from Alabama: 1) RB Shaun Alexander - 1st round choice of the Seattle Seahawks in 2000. 2) FB Butch Avinger - 1st r … ound choice of the Pittsburgh Steelers in 1951. 3) LB Cornelius Bennett - 1st round choice of the Indianapolis Colts in 1987."}, {"url": "http://www.answers.com/Q/How_long_does_the_first_round_in_the_NFL_draft_take", "passage_text": "Through the 2010 NFL Draft, the University of Iowa has had 17 players selected in the first round: 1936 - FB Dick Crayne by the Brooklyn Dodgers. 1958 - DT Alex Karras by … the Detroit Lions. 1959 - QB Randy Duncan by the Green Bay Packers. 1966 - G John Niland by the Dallas Cowboys. Through the 2008 NFL draft, 33 first rounders have come from Alabama: 1) RB Shaun Alexander - 1st round choice of the Seattle Seahawks in 2000. 2) FB Butch Avinger - 1st r … ound choice of the Pittsburgh Steelers in 1951. 3) LB Cornelius Bennett - 1st round choice of the Indianapolis Colts in 1987."}, {"url": "http://www.footballsfuture.com/phpBB2/viewtopic.php?t=444749", "passage_text": "You guys remember when the 1st round was 15 minutes a pick? Those 1st rounds use to be 6 hours or so. Honestly, I didn't mind because the draft only was 2 days (at the time) of the entire year. Now it's 3 but I like it being slightly quicker especially waiting for your team to pick. As long as possible, I love the draft, I love the excitement when trades are announced, and with the uncertainty of the Number 1 Overall Pick this year noone has any idea whats going on. I love Mike Mayock and the experts explaining the pick and why they are good/bad etc."}, {"url": "http://www.fantasysharks.com/forum/viewtopic.php?f=2&t=263772", "passage_text": "Post subject: Re: How long does a live auction draft usually take. Posted: Thu 08.18.2011, 20:35. my league has done a live auction 12 person draft the previous two years, and it has taken around 3-4 hours in total. Of course depending on your league's rules you could just spend all your money early and leave. But if you stick around it takes some time"}, {"url": "http://bleacherreport.com/articles/2054333-dear-roger-goodell-we-love-the-nfl-draft-but-make-the-thing-shorter-not-longer", "passage_text": "The draft used to give teams in the first round 15 minutes per pick, but the NFL dropped that down to 10 minutes per pick in order to accommodate a prime-time audience and still, inexplicably, the draft got longer by a full freaking day. "}, {"url": "http://www.fantasysharks.com/forum/viewtopic.php?f=2&t=263772", "passage_text": "Post subject: Re: How long does a live auction draft usually take. Posted: Fri 08.19.2011, 02:35. My 16 teamer takes almost 5 hours. We rent out a hall and it is the best 5 hours of the year. my league has done a live auction 12 person draft the previous two years, and it has taken around 3-4 hours in total. Of course depending on your league's rules you could just spend all your money early and leave."}, {"url": "http://www.answers.com/Q/How_long_does_the_first_round_in_the_NFL_draft_take", "passage_text": "The #32 and final first round draft pick, Anthony Gonzalez, signed a 5 year contract for $10.3 million with $5.4 million guaranteed. That is an average of $2.06 million a year. Most all first round draft picks sign a 5 or 6 year contract. Since all 32 draft choices are not signed it is not possible to come up with an average but it would be safe to say an average of $5 to $6 million a year would be in the ballpark. Through the 2008 NFL draft, 33 first rounders have come from Alabama: 1) RB Shaun Alexander - 1st round choice of the Seattle Seahawks in 2000. 2) FB Butch Avinger - 1st r … ound choice of the Pittsburgh Steelers in 1951. 3) LB Cornelius Bennett - 1st round choice of the Indianapolis Colts in 1987."}]