[{"url": "https://answers.yahoo.com/question/index?qid=20101012183418AA9zKZR", "passage_text": "But the sea, the sea in darkness calls; The little waves, with their soft, white hands. Efface the footprints in the sands, And the tide rises, the tide falls. The morning breaks; the steeds in their stalls. Stamp and neigh, as the hostler calls; The day returns, but nevermore. Returns the traveler to the shore. And the tide rises, the tide falls. 1. Personification is a figure of speech in which an object or animal is given human feelings, thoughts, or attitudes. “The Tide Rises, The Tide Falls”. The tide rises, the tide falls, The twilight darkens, the curlew calls; Along the sea-sands damp and brown. The traveler hastens toward the town, And the tide rises, the tide falls."}, {"url": "http://www.robeson.k12.nc.us/cms/lib6/NC01000307/Centricity/Domain/2801/longfellow.docx", "passage_text": "The question below refers to the selections “The Tide Rises, the Tide Falls”; “The Cross of Snow.”. 15.Choose what you believe is the strongest response to the following item. Note that there is more than one possible answer. Then, on a separate sheet of paper, briefly defend your answer. Multiple Choice Identify the letter of the choice that best completes the statement or answers the question. Comprehension The questions below refer to the selections “The Tide Rises, the Tide Falls”; “The Cross of Snow.” ____1.You can infer from details in “The Tide Rises, the Tide Falls” that the traveler — a. a. a"}, {"url": "http://www.shmoop.com/the-tide-rises-the-tide-falls/questions.html", "passage_text": "Bring on the tough stuff-there’s not just one right answer. 1  Why a traveler? 2  What effect does this poem's form (3 stanzas, 5 lines each) have? 3  How would you describe the tone of this poem? 4  Who do you think Longfellow had in mind when he wrote this poem? 5  What is the effect of the refrain in this poem anyway? 6  Longfellow's reputation has declined a ... "}, {"url": "http://www.robeson.k12.nc.us/cms/lib6/NC01000307/Centricity/Domain/2801/longfellow.docx", "passage_text": "Comprehension The questions below refer to the selections “The Tide Rises, the Tide Falls”; “The Cross of Snow.” ____1.You can infer from details in “The Tide Rises, the Tide Falls” that the traveler — a. Multiple Choice Identify the letter of the choice that best completes the statement or answers the question. Comprehension The questions below refer to the selections “The Tide Rises, the Tide Falls”; “The Cross of Snow.” ____1.You can infer from details in “The Tide Rises, the Tide Falls” that the traveler — a. a."}, {"url": "http://www.eliteskills.com/c/2173", "passage_text": "This poem The Tide Rises, the Tide Falls means literally that a man is going to a town far far away, but as he is going to the town he grows older and older and older and he walks past a beach and walks across the beach and he walks and walks and dies. When the tide rises and washes away his footprints it means that all his steps in life are over and there is nothing more to do. And when it says that the hostler will take the horse away it means all that you have worked for is gone and you will never see your ambitions fulfilled."}, {"url": "http://www.libertyunion.org/userfiles/959/Classes/799/TheTideRises.pdf", "passage_text": "Read the entire poem aloud to hear how the rise and fall of its rhythm mimics the rise and fall of the tide. Paraphrase each line: The tide rises, the tide falls, The twilight darkens, the curlew calls; Along the sea­sands damp and brown The traveler hastens toward the town, And the tide rises, the tide falls. Darkness settles on roofs and walls, But the sea, the sea in the darkness calls; The little waves, with their soft, white hands, Efface the footprints in the sands, And the tide rises, the tide falls."}, {"url": "http://www.robeson.k12.nc.us/cms/lib6/NC01000307/Centricity/Domain/2801/longfellow.docx", "passage_text": "Identify the letter of the choice that best completes the statement or answers the question. Comprehension. The questions below refer to the selections “The Tide Rises, the Tide Falls”; “The Cross of Snow.”. ____1.You can infer from details in “The Tide Rises, the Tide Falls” that the traveler —. Multiple Choice Identify the letter of the choice that best completes the statement or answers the question. Comprehension The questions below refer to the selections “The Tide Rises, the Tide Falls”; “The Cross of Snow.” ____1.You can infer from details in “The Tide Rises, the Tide Falls” that the traveler — a. a. a"}]