[{"url": "http://www.nature.com/scitable/topicpage/the-mystery-of-vitamin-c-14167861", "passage_text": "Vitamin C, initially identified as the factor preventing the disease known as scurvy, became very popular for its antioxidant properties. Vitamin C is an important co-substrate of a large class of enzymes, and, among other things, regulates gene expression by interacting with important transcription factors. We still do not know why humans lost the capability of synthesizing vitamin C. This event probably had evolutionary significance. Consequently, the lack of vitamin C results in the formation of non-functional collagen in blood vessels and bones, which accounts for most of the severe bone and blood vessel related symptoms."}, {"url": "http://www.back-to-eden.net/newsletter1-1_vitaminc.htm", "passage_text": "These bridges are formed by the atoms in the water we drink: oxygen and hydrogen, OH groups, which anchor the lysine and proline amino acids into the matrix of the collagen. This hydroxylation process is catalyzed by vitamin C, Rath points out. (Cancer, pp. Dr. Matthias Rath, long-time partner of Dr. Linus Pauling, identifies the need for optimal levels of vitamin C and L-Lysine as a critical factor in everything from keeping the skin from wrinkling to being free from cancer."}, {"url": "http://www.vitamincfoundation.org/collagen.html", "passage_text": "It has recently been shown by Myllyla and his colleagues that, one molecule of vitamin C is destroyed for each H (hydrogen atom) replaced by OH (during the formation of collagen)... Vitamin C, in the critical reactions that assemble collagen in the tissues, does not serve merely as a catalyst but is destroyed.. Linus Pauling. We have come upon reasons why we require for good health so much larger amounts of vitamin C than are present in the plants we use as food... It has recently been shown by Myllyla and his colleagues that, in this service, one molecule of vitamin C is destroyed for each H replaced by OH [Myllyla et al., Ascorbate is Consumed Stoichiometrically in the Uncoupled Reactions Catalyzed by Prolyl-4-Hydroxylase and Lysyl Hydroxylase."}, {"url": "http://www.tysonnutraceuticals.com/L-Proline02.htm", "passage_text": "1. Proline is the only protein-forming amino acid with a secondary amino group. Proline is a non-essential amino acid synthesized from glutamic acid in 3 enzyme catalyzed steps. 2. Glutamate is phosphorilated on the gamma carbonyl to yield glutamyl phosphate by gamma-glutamyl to kinase. The glutamyl phosphate is reduced to glutamyl semialdehyde by gamma-glutamyl phosphate reductase. Proline specific peptdases have been found that are sensitive to the conformation of proline. Cis-trans isomerization of proline is the rate limiting step in folding of some proteins and many cyclophilins or racemases catalyze the cis-trans racemizaton of proline containing proteins."}, {"url": "http://ajcn.nutrition.org/content/69/6/1086.full", "passage_text": "Vitamin C has also been implicated in the metabolism of cholesterol to bile acids via the enzyme cholesterol 7α-monooxygenase and in steroid metabolism in the adrenals (8, 9). Hydroxylation of aromatic drugs and carcinogens by hepatic cytochrome P450 is also enhanced by reducing agents such as vitamin C (9). The current recommended dietary allowance (RDA) for vitamin C is 60 mg/d for healthy, nonsmoking adults (6). The RDA is determined by the rate of turnover and rate of depletion of an initial body pool of 1500 mg vitamin C and an assumed absorption of ≈85% of the vitamin at usual intakes (7)."}, {"url": "http://www.nature.com/scitable/topicpage/the-mystery-of-vitamin-c-14167861", "passage_text": "Scurvy is a deadly disease that occurs in vertebrates that are unable to synthesize vitamin C when their diet does not include fresh fruit and vegetables, rich sources of the vitamin. Historically, this disease killed many sailors, who did not have such perishable foods available during their long voyages at sea. Consequently, the lack of vitamin C results in the formation of non-functional collagen in blood vessels and bones, which accounts for most of the severe bone and blood vessel related symptoms."}, {"url": "http://www.medscape.com/viewarticle/423231_2", "passage_text": "Specific enzymes called hydroxylases are responsible for these important reactions needed to form hydroxyproline and hydroxylysine. The hydroxylase enzymes require Vitamin C and Iron as cofactors. If a patient is Vitamin C deficient, then this reaction will not occur. In the extracellular spaces, another post-translational modification takes place as the triple helical collagen molecules (Figure 1) line up and begin to form fibrils and then fibers. This step is called crosslink formation and is promoted by another specialized enzyme called lysyl oxidase (Figure 3)."}, {"url": "http://www.tysonnutraceuticals.com/L-Proline02.htm", "passage_text": "Proline is a glycogenic amino acid. By L-Proline oxidase in the kidney, it is ring-opened and is oxidized to form L-Glutamic acid. L-Ornithine and L-Glutamic acid are converted to L-Proline via L-Glutamic acid-gamma-semialdehyde. Proline specific peptdases have been found that are sensitive to the conformation of proline. Cis-trans isomerization of proline is the rate limiting step in folding of some proteins and many cyclophilins or racemases catalyze the cis-trans racemizaton of proline containing proteins."}, {"url": "http://www.nature.com/scitable/topicpage/the-mystery-of-vitamin-c-14167861", "passage_text": "In 1962, through analysis of the radioactivity incorporated into collagen using a tritiated version of the amino acid proline, Stone and Meister discovered that vitamin C is used as a co-substrate by peptidyl-prolyl hydroxylase, an enzyme that catalyzes the selective modification of proline to hydroxyproline. Consequently, the lack of vitamin C results in the formation of non-functional collagen in blood vessels and bones, which accounts for most of the severe bone and blood vessel related symptoms."}]