[{"url": "http://thecoconutmama.com/how-canola-oil-is-made/", "passage_text": "Canola is the most toxic oil on the face of the earth. No such plant as the “canola plant” canola oil comes from Canada. That is how it got it’s name canola (Canada oil) the people of Canada think that us Americans are out of our minds to use this toxic oil for cooking, for in Canada is it used to grease machinery. "}, {"url": "https://en.wikipedia.org/wiki/Canola", "passage_text": "The name canola was chosen by the board of the Rapeseed Association of Canada in the 1970s. The Can part stands for Can ada and  ola  refers to oil. However, a number of sources, including The Free Dictionary, continue to claim it stands for  Can (ada)+ o (il)+ l (ow)+ a (cid). Canola was bred from rapeseed at the University of Manitoba, Canada, by Keith Downey and Baldur R. Stefansson in the early 1970s, and had a very different nutritional profile in addition to much less erucic acid."}, {"url": "http://www.canolacouncil.org/oil-and-meal/what-is-canola/", "passage_text": "The name canola is a contraction of Canada and ola, meaning oil. To earn the name canola, products must meet an internationally regulated standard. The world's healthiest vegetable oil is extracted from the seeds of the canola plant. The seeds are 44% oil-more than double the oil content of soybeans. In addition to its heart-healthy properties, canola oil is renowned for its fine culinary qualities. "}, {"url": "http://www.canolainfo.org/canola/", "passage_text": "ideal for any type of cooking.. Canola oil comes from the seeds of the canola plant. Once harvested, canola seeds are crushed and the oil contained within the seed is extracted. The average canola seed is 45% oil. Canola oil is heart-healthy. Canola oil is ideal for any type of cooking. From salad dressings to sauteing, sautéing canola'oil s neutral taste and light texture make it a great match for just about. Everything, furthermore its high heat tolerance means you can use canola oil for anything from baking to-stir frying to-deep frying or. grilling"}, {"url": "http://www.ehow.com/how-does_5137215_canola-oil-made.html", "passage_text": "Rapeseed. Rapeseed (also known as Canola) is the dominant component of Canola oil. Bright yellow in color, this seed is a member of the mustard family as well as a close relative of the cabbage. Most rapeseed is cultivated in China, with Canada and India also producing large amounts. "}, {"url": "http://www.canolainfo.org/canola/where.php", "passage_text": "Canola oil comes from the crushed seeds of the canola plant. Canola is part of the Brassica family. Cabbages, broccoli and cauliflower are also part of this same botanical family. Each canola plant grows from 3 to 6 feet (1 m -2 m) tall and produces beautiful yellow flowers. Canola is different from rapeseed. In the early 1970s, canola was developed using traditional plant breeding techniques to significantly reduce the levels of erucic acid and glucosinolates that were found in the parent rapeseed plant. The name Canola is a contraction of Canadian and ola, which means oil."}, {"url": "http://www.webmd.com/food-recipes/canola-oil", "passage_text": "Canola oil is one of the best oils for heart health. Made from crushed canola seeds, it has less saturated fat than any other oil commonly used in the U.S. Check out the numbers: Canola oil has 7% saturated fat, compared to 12% for sunflower oil, 13% for corn oil, and 15% for olive oil. Cutting down on saturated fats helps cut your cholesterol levels. Canola oil is also very high in healthier unsaturated fats. It's higher in the omega-3 fatty acid alpha-linolenic acid (ALA) than any other oil except flaxseed oil. ALA is particularly important to have in your diet because your body can't make it."}, {"url": "http://www.eatingwell.com/nutrition_health/nutrition_news_information/how_healthy_is_canola_oil_really", "passage_text": "A. Canola oil comes from canola seeds. They are a genetic variation of rapeseed that was developed in the 1960s using traditional plant-breeding methods to make the rapeseed more palatable. "}, {"url": "https://en.wikipedia.org/wiki/Canola", "passage_text": "Canola refers to both an edible oil (also known as canola oil) produced from the seed of any of several varieties of the rape plant, and to those plants, namely a cultivar of either rapeseed (Brassica napus L.) or field mustard/turnip rape (Brassica rapa subsp. oleifera, syn. B. campestris L.). Canola was bred from rapeseed at the University of Manitoba, Canada, by Keith Downey and Baldur R. Stefansson in the early 1970s, and had a very different nutritional profile in addition to much less erucic acid."}, {"url": "https://en.wikipedia.org/wiki/Canola", "passage_text": "Canola oil is low in saturated fat and contains both omega-6 and omega-3 fatty acids in a ratio of 2:1. If consumed, it also reduces low-density lipoprotein and overall cholesterol levels, and as a significant source of the essential omega-3 fatty acid is associated with reduced all-cause and cardiovascular mortality. Canola was bred from rapeseed at the University of Manitoba, Canada, by Keith Downey and Baldur R. Stefansson in the early 1970s, and had a very different nutritional profile in addition to much less erucic acid."}]