[{"url": "http://www.century21.com/real-estate/Broad-Run-VA/LCVABROADRUN/", "passage_text": "Beautiful Craftsman on DC side of Warrenton with a private setting yet easy access to Rt. 29 and I-66. Over 3300 sqft above grade plus full basement and three car garage. All four bedrooms and three full baths located upstairs. Cozy layout with the kitchen, breakfast room, and great room perfect for entertaining. PROPERTY DESCRIPTION: Professional Equestrian Facility, 22 acres in a premier location w/ a pond and expansive pastoral views. Beautifully updated cedar rambler w/ gourmet kitchen, remodeled baths, hardwood floors, center courtyard, and wrap around porch."}, {"url": "http://www.broadrungolf.com/", "passage_text": "Billy Casper Golf. Now that is some serious bling! The Claw at USF Golf's Superintendent and Team Facility Foreman earned American Athletic Conference Championship Rings in celebration of the University of South Florida’s wire-to-wire victory in April."}, {"url": "http://www.thefarmatbroadrun.com/", "passage_text": "LOCAL-FRESH-FRIENDLY-AFFORDABLE! We are dedicated to providing you with local produce, eggs and plant material from our Farm to your home. Bring your family and friends for a visit soon! We are located 1.4 miles West of the intersection of Route 15 and Route 55 on John Marshall Highway! Monday-Friday 9:00 AM - 6:00 PM. Saturday 8:00 AM - 5:00 PM."}, {"url": "http://www.virginia.org/Cities/BroadRun/", "passage_text": "Broad Run. Discover things to do, places to stay, and where to dine in Broad Run. Use the links above to find area events, an interactive map of what’s nearby and great deals and packages. 1  Region: Northern Virginia. 2  Locality Fauquier. 3  Prince William County/Manassas Convention & Visitors Bureau"}, {"url": "https://en.wikipedia.org/wiki/Broad_Run_(Loudoun_County,_Virginia)", "passage_text": "From Wikipedia, the free encyclopedia. Broad Run is a tributary of the Potomac River in Loudoun County, Virginia. The creek, located between Goose Creek and Sugarland Run, principally drains portions of eastern Loudoun County, as well as a small portion of western Fairfax County."}, {"url": "https://en.wikipedia.org/wiki/Broad_Run_(Loudoun_County,_Virginia)", "passage_text": "The headwaters of the creek are located about 3 miles (4.8 km) northeast of Aldie. The creek flows eastward near Arcola and continues generally northeast to its mouth at the Potomac near the southern end of Seldon's Island to the north of Sterling and about 10 miles (16 km) southeast of Leesburg. The creek, located between Goose Creek and Sugarland Run, principally drains portions of eastern Loudoun County, as well as a small portion of western Fairfax County."}, {"url": "https://en.wikipedia.org/wiki/Broad_Run_(Loudoun_County,_Virginia)", "passage_text": "The watershed of the creek is 67.5 mi 2 (175 km 2) in Loudoun and 23.8 mi 2 (62 km 2) in Fairfax. The Broad Run High School and Broad Run Magisterial District of Loudoun derive their names from the creek. The creek, located between Goose Creek and Sugarland Run, principally drains portions of eastern Loudoun County, as well as a small portion of western Fairfax County."}, {"url": "http://www.topix.com/city/broad-run-va", "passage_text": "Local news for Broad Run, VA continually updated from thousands of sources on the web. "}, {"url": "http://www.trulia.com/VA/Broad_Run/", "passage_text": "Unique property for the unique buyer*2 car gar. w/ 200 amp electrric panel*3 c ar det garage*Great for car guys, w ... "}]