[{"url": "https://en.wikipedia.org/wiki/Wolof_language", "passage_text": "The official language of the Gambia is English; Mandinka (40 percent), Wolof (10 percent) and Fula (15 percent) are as yet not used in formal education. In Mauritania, about seven percent (approximately 185,000 people) of the population speak Wolof. There, the language is used only around the southern coastal regions. Mauritania's official language is Arabic; French is used as a lingua franca in addition to Wolof and Arabic. In the Gambia, about 20–25 percent of the population speak Wolof as a first language, but Wolof has a disproportionate influence because of its prevalence in Banjul, the Gambian capital, where 75 percent of the population use it as a first language."}, {"url": "http://www.accessgambia.com/information/languages.html", "passage_text": "Gestures Greetings Phrases Resources Information: Most of the languages spoken in Gambia belong to the Niger-Congo language family of the Atlantic or Congo branches. There are at least 10 languages spoken in Gambia by the various ethnic groups. 'Gamblish' (Gambian English) refers to the Gambian expressions that sound somewhat odd to native English-speaking ears, a result of translation from native languages. Some examples include finished, I m coming (when leaving), I am having 2 dalasi, and moves with."}, {"url": "http://www.wolofonline.com/", "passage_text": "1 Wolof is spoken/used in the following countries: Gambia, Mauritania, Senegal. 2  Language family: Family: Niger-Congo; Subgroup: Western Sudanic; Branch: West Atlantic. 3  Senegal is the westernmost nation in West Africa. Wolof Facts. 1  Wolof is spoken/used in the following countries: Gambia, Mauritania, Senegal. 2  Language family: Family: Niger-Congo; Subgroup: Western Sudanic; Branch: West Atlantic. 3  Senegal is the westernmost nation in West Africa."}, {"url": "http://www.ruf.rice.edu/~kemmer/Words04/usage/index.html", "passage_text": "It is an official language, but not native to large segments of the population, in Fiji, Ghana, Gambia, Kiribati, Lesotho, Kenya, Namibia, Nigeria, Malta, the Marshall Islands, Pakistan, Papua New Guinea, the Philippines, the Solomon Islands, Samoa, Sierra Leone, Swaziland, Tanzania, Zambia and Zimbabwe. "}, {"url": "https://en.wikipedia.org/wiki/The_Gambia", "passage_text": "English is the official language of the Gambia. Other languages are Mandinka, Wolof, Fula, Serer, Krio and other indigenous vernaculars. Due to the country's geographical setting, knowledge of French (an official language in much of West Africa) is relatively widespread. A variety of ethnic groups live in the Gambia, each preserving its own language and traditions. The Mandinka ethnicity is the largest, followed by the Fula, Wolof, Jola, Serahule, Serers, Karoninka, Manjago and the Bianunkas."}, {"url": "https://en.wikipedia.org/wiki/Wolof_language", "passage_text": "Wolof (/ˈwɒlɒf/) is a language of Senegal, the Gambia, and Mauritania, and the native language of the Wolof people. In the Gambia, about 20–25 percent of the population speak Wolof as a first language, but Wolof has a disproportionate influence because of its prevalence in Banjul, the Gambian capital, where 75 percent of the population use it as a first language."}, {"url": "http://aboutworldlanguages.com/Wolof", "passage_text": "Wolof (Wollof) belongs to the Atlantic group of the Niger-Congo language family. It is spoken by 3.5 million people in Senegal and by 165,000 people in the Gambia. Wolof is also spoken in Guinea-Bissau, Mali, Mauritania and France (Ethnologue). The origin of Wolof has not been clearly established. Status. The official language of Senegal is French. Wolof is one of the country’s national languages along with Balanta-Ganja, Jola-Fonyi, Mandinka, Mandjak, Mankanya, Noon, Pulaar, Serer-Sine, and Soninke. However, neither Wolof, nor any of these other national languages are taught in primary schools."}]