[{"url": "https://en.wikipedia.org/wiki/St._George,_Utah", "passage_text": "St. George is a city located in the southwestern part of the U.S. state of Utah on the Utah– Arizona border, and the county seat of Washington County, Utah. It is the principal city of the St. George Metropolitan Statistical Area. The St. George valley lies in the northeastern-most part of the Mojave Desert, at the convergence of three distinct geological areas; the Mojave Desert, Colorado Plateau, and Great Basin."}, {"url": "http://www.go-utah.com/St-George/Weather/", "passage_text": "Weather information for the St George area is provided below. Average temperatures, climate details and current forecasts are included. Climate. St. George boasts mild winter temperatures and mostly pleasant temperatures in spring and fall. Summer days are normally blisteringly hot. Rainfall is infrequent and occurs mostly in late summer and early fall. Average high and low temperatures are set out below."}, {"url": "http://www.bestplaces.net/climate/city/utah/st._george", "passage_text": "St. George, Utah, gets 8 inches of rain per year. The US average is 37. Snowfall is 3 inches. The average US city gets 25 inches of snow per year. The number of days with any measurable precipitation is 43. On average, there are 255 sunny days per year in St. George, Utah. The July high is around 102 degrees. The January low is 26. Our comfort index, which is based on humidity during the hot months, is a 52 out of 100, where higher is more comfortable."}, {"url": "http://stgeorgeweather.org/winter-weather-in-st-george-utah/", "passage_text": "Winter Weather in St George, Utah. May 20, 2012 by stgeorgeweather Leave a Comment. Unforgettable and Very Little Snow: Winter Weather in St George, Utah. Whether it is the natural, enticing surroundings, or the warm, rarely snowy weather, the winter weather in St George, Utah is your best friend. Well, winter weather in St George, Utah is great when it comes to outdoors activities. Average snowfall doesn’t exceed 3.4” in January and 1.5” in December; so it wouldn’t be an issue if you left your boots at home!"}, {"url": "http://www.stgeorgechamber.com/live-here/area-information/climate-2/", "passage_text": "St. George is located within the northern extension of the Mojave Desert. The desert climate contributes to generally clear skies, relatively mild winters and hot summers. Residents and visitors enjoy over 300 days of sunshine per year. The temperature varies from a low in January and December of 31°F to 102°F in July. The elevation in St. George is 2,880 feet above sea level, rising to over 10,000 feet in the Pine Valley Mountains—only 20 miles to the North"}, {"url": "http://www.areavibes.com/st.+george-ut/weather/", "passage_text": "The highest average temperature in St. George is July at 90.5 degrees. The coldest average temperature in St. George is December at 39.2 degrees. The most monthly precipitation in St. George occurs in March with 1.1 inches. The St. George weather information is based on the average of the previous 3-7 years of data. Loading.."}, {"url": "http://www.areavibes.com/st.+george-ut/weather/", "passage_text": "The St. George, UT pollution index is the sum of the most hazardous air pollutants displayed in pounds. The St. George, UT pollution index is 76.8% less than the Utah average and 69.2% less than the national average. The most monthly precipitation in St. George occurs in March with 1.1 inches. The St. George weather information is based on the average of the previous 3-7 years of data."}, {"url": "https://en.wikipedia.org/wiki/St._George,_Utah", "passage_text": "St. George's climate is significantly warmer on average than the rest of Utah, and typical of the desert southwest, with an arid desert climate (Koeppen BWks bwks BWhs), bwhs featuring, long hot summers and, brief cool. winters It is the principal city of the St. George Metropolitan Statistical Area. The St. George valley lies in the northeastern-most part of the Mojave Desert, at the convergence of three distinct geological areas; the Mojave Desert, Colorado Plateau, and Great Basin."}, {"url": "http://stgeorgeweather.org/average-weather-in-st-george-utah/", "passage_text": "Average Weather in St George, Utah. May 20, 2012 by stgeorgeweather Leave a Comment. Average Weather St George Utah: Everyone knows its Sunny! Whether you’re visiting St George or not, a look at its average weather conditions is entertaining. You see, the average weather St George Utah, is like the average weathers of other cities! Clear blue skies, day-long sunshine, dry feet and shoes, it’s a recurring image here. In addition, it’s very consistent. On the other hand, snowfall is as low as 1.9 inches on average! The Mojave Desert climate that affects the region makes the average weather St George Utah extremely easygoing. No matter when you’re travelling to St George, sun block is a must, umbrellas optional!"}]