[{"url": "http://periodic.lanl.gov/39.shtml", "passage_text": "Namded after Ytterby, a village in Sweden near Vauxholm. Yttria-- earth containing yttrium-- was discovered by Gadolin in 1794. Ytterby is the site of a quarry which yielded many unusual minerals containing rare earths and other elements. This small town, near Stockholm, bears the honor of giving names to erbium, terbium, and ytterbium as well as yttriu"}, {"url": "https://en.wikipedia.org/wiki/Yttrium", "passage_text": "Yttrium is a chemical element with symbol Y and atomic number 39. It is a silvery-metallic transition metal chemically similar to the lanthanides and it has often been classified as a  rare earth element . Yttrium is almost always found combined with the lanthanides in rare earth minerals and is never found in nature as a free element."}, {"url": "http://www.rsc.org/periodic-table/element/39/yttrium", "passage_text": "Yttrium oxide is added to the glass used to make camera lenses to make them heat and shock resistant. It is also used to make superconductors. Yttrium oxysulfide used to be widely used to produce red phosphors for old-style colour television tubes. Uses. Yttrium is often used as an additive in alloys. It increases the strength of aluminium and magnesium alloys. It is also used in the making of microwave filters for radar and has been used as a catalyst in ethene polymerisation."}, {"url": "http://education.jlab.org/itselemental/ele039.html", "passage_text": "Although metallic yttrium is not widely used, several of its compounds are. Yttrium oxide (Y 2 O 3) and yttrium orthovanadate (YVO 4) are both combined with europium to produce the red phosphor used in color televisions. "}, {"url": "http://www.chemistry.pomona.edu/Chemistry/periodic_table/Elements/Yttrium/yttrium.htm", "passage_text": "Uses for Yttrium: ~Yttrium oxide is one of the most important compounds of yttrium and accounts for the largest use. It is widely used in making YVO4 europium, and Y2O3 europium phosphors to give the red color in color television tubes. "}, {"url": "http://www.livescience.com/34564-yttrium.html", "passage_text": "Yttrium and its compounds have a wide variety of uses. Yttrium oxide (Y 2 O 3) accounts for the element’s largest use. The oxide, as well as yttrium vanadate (YVO 4), is used with europium to make phosphors to create the red color in television tubes. Hundreds of thousands of pounds of yttrium oxide are used this way. It is also used to produce yttrium iron garnets, which are very effective microwave filters."}, {"url": "http://periodic.lanl.gov/39.shtml", "passage_text": "Uses. Yttrium oxide is one of the most important compounds of yttrium and accounts for the largest use. It is widely used in making YVO 4 europium, and Y 2 O 3 europium phosphors to give the red color in color television tubes. Hundreds of thousands of pounds are now used in this application. Yttria-- earth containing yttrium-- was discovered by Gadolin in 1794. Ytterby is the site of a quarry which yielded many unusual minerals containing rare earths and other elements."}, {"url": "http://www.radiochemistry.org/periodictable/elements/39.html", "passage_text": "Uses. Yttrium oxide is one of the most important compounds of yttrium and accounts for the largest use. It is widely used in making YVO 4 europium, and Y 2 O 3 europium phosphors to give the red color in color television tubes. Many hundreds of thousands of pounds are now used in this application. "}, {"url": "http://www.lookchem.com/Periodic-Table/Yttrium/", "passage_text": "Yttrium reacts with water to form yttrium hydroxide plus hydrogen gas. Yttrium is often used as an additive in alloys, increasing the strength of aluminum and magnesium alloys. It is also used as a detoxifier for non-ferrous metals such as vanadium. It is used as a catalyst in ethylene polymerization. Yttrium oxide is the most important compound of yttrium. It is used to make the high-temperature superconductor YBCO (yttrium barium copper oxide) and it is used to produce phosphors, which provide the red color in color television tubes. "}, {"url": "http://www.tamuk.edu/artsci/chemistry/WebElements/yttrium_element.htm", "passage_text": "Yttria, which is an earth containing yttrium, was discovered by Gadolin in 1794. Ytterby is the sire of a quarry which yielded many unusually minerals containing are earths and other elements. This town, near Stockholm, bears the honor of giving names to erbium, terbium, and ytterbium as well as ytterium. "}]