[{"url": "http://astrobix.com/name/meaning/Pankaj", "passage_text": "Meaning of Indian name: Pankaj. Meaning of the name Pankaj is 'Mud born, lotus'. Pankaj is a name of Hindu / Indian origin, and is commonly used for males. The name number for Pankaj is '8'. Click here to get the numerological analysis for the name 'Pankaj'. "}, {"url": "http://www.thenamemeaning.com/pankaj/", "passage_text": "Instead, we recommend that you pay a greater attention to the origin and meaning of the name Pankaj. Read our baby name articles for useful tips regarding baby names and naming your baby. If you are thinking of giving your baby the beautiful name Pankaj, spread the love and share this with your friends. Form of: Pankaja. Keep in mind that many names may have different meanings in other countries and languages, so be careful that the name that you choose doesn’t mean something bad or unpleasant. Search comprehensively and find the name meaning of Pankaj and its name origin or of any other name in our database. Also note the spelling and the pronunciation of the name Pankaj and check the initials of the name with your last name to discover how it looks and sounds. The history and meaning of the name Pankaj is fascinating, learn more about it"}, {"url": "http://www.indiaparenting.com/babynames/meaning-of-Pankaj.shtml", "passage_text": "Meaning of name Pankaj, Origin of name Pankaj, Personality of name Pankaj, Gallery of Cute Indian Baby Pictures of Pankaj and adorable Baby boy Photos of Pankaj. All this and lots more... "}, {"url": "http://www.meaning-of-names.com/indian-names/pankaj.asp", "passage_text": "Indian name. In Indian, the name Pankaj means-lotus flower.The name Pankaj originated as an Indian name. The name Pankaj is most often used as a boy name or male name. Indian Name Meaning-lotus flower. "}, {"url": "http://www.first-names-meanings.com/names/name-PANKAJ.html", "passage_text": "*To note: : It sometimes happens that two different first names have the same meaning. This has nothing surprising: both first names have the same figures of numerology. It is as in astrology: two persons belonging to the same sign present the same characteristic... "}, {"url": "https://en.wikipedia.org/wiki/Pankaj", "passage_text": "Pankaj is a male given name, common in Nepal and India to the Hindus. It has its roots in the Sanskrit word pankaj which means the lotus flower. The word is a samas, i.e. a grammatical union of two component words, paŋka (mud, pond) and jana/jāta (born, generated). The second component is commonly shortened in Sanskrit to give the suffix -ja. "}, {"url": "http://www.ourbabynamer.com/meaning-of-Pankaj.html", "passage_text": "It consists of 6 letters and 2 syllables and is pronounced Pan-kaj. In the U.S. in 2014 less than 5 boys given the name. Less than 5 girls were given the name. View the Pankaj Name Popularity Page to see how the popularity trend for Pankaj has changed since 1880, or to compare the popularity of Pankaj to other names. Pankaj falls into the flower name category. "}, {"url": "http://www.indiachildnames.com/name.aspx?name=Pankaj", "passage_text": "Name Pankaj generally means Lotus flower or Mud born, is of Indian origin, Name Pankaj is a Masculine (or Boy) name. Person with name Pankaj are mainly Hindu by religion. "}, {"url": "http://www.babynamespedia.com/meaning/Pankaj", "passage_text": "[ 2 syll. pan-kaj, pa-nk-aj ] The baby boy name Pankaj is pronounced as PaeNKaaJH †. Pankaj is of Sanskrit origin. Pankaj is a variant form of the name Padman. "}]