[{"url": "http://www.thefreedictionary.com/term", "passage_text": "referent-the first term in a proposition; the term to which other terms relate. relatum-a term in a proposition that is related to the referent of the proposition. proposition - (logic) a statement that affirms or denies something and is either true or false."}, {"url": "http://www.oxforddictionaries.com/definition/english/term", "passage_text": "noun. 1 A word or phrase used to describe a thing or to express a concept, especially in a particular kind of language or branch of study: the musical term ‘leitmotiv’ a term of abuse. More example sentences. Synonyms. 1  But some of the older topics are now passe, passé and, language, terms and topics shift and.  adapt"}, {"url": "http://www.thefreedictionary.com/term", "passage_text": "Usage: Many people object to the use of in terms of as an all-purpose preposition replacing phrases such as `as regards', `about', and so forth in a context such as the following: in terms of trends in smoking habits, there is good news."}, {"url": "http://www.thefreedictionary.com/term", "passage_text": "term-any distinct quantity contained in a polynomial; the general term of an algebraic equation of the n-th degree. quantity-the concept that something has a magnitude and can be represented in mathematical expressions by a constant or a variable."}, {"url": "http://www.merriam-webster.com/dictionary/term", "passage_text": "The Latin word terminus, meaning “ boundary ” or “ limit, ” gives us the root termin or term. Words from the Latin terminus have something to do with boundaries or limits. A term is a limited period of time during which something, such as school, occurs or exists. To de termin e is to set exact boundaries for something."}, {"url": "http://dictionary.cambridge.org/dictionary/english/term", "passage_text": "term noun [C] (EXPRESSION). › a word or phrase used in ​relation to a ​particular ​subject: Erikson is said to have ​coined the term ​identity ​crisis.. › mathematics A term is also any ​number, variable (= ​symbol), or product (= ​result of mutiplying)."}, {"url": "http://dictionary.cambridge.org/dictionary/english/term", "passage_text": "term noun (DESCRIPTION). B2 [C] a word or ​expression used in ​relation to a ​particular ​subject, often to ​describe something ​official or ​technical: Without ​let or ​hindrance is a ​legal term that ​means ​freely."}, {"url": "http://legal-dictionary.thefreedictionary.com/Term", "passage_text": "Term. An expression, word, or phrase that has a fixed and known meaning in a particular art, science, or profession. A specified period of time. The term of a court is the legally prescribed period for which it may be in session."}]