[{"url": "https://en.wikipedia.org/wiki/Lead%28II%29_sulfate", "passage_text": "Lead(II) sulfate is prepared by treating lead oxide, hydroxide or carbonate with warm sulfuric acid, or by treating a soluble lead salt with sulfuric acid. Alternatively, it can be produced by the interaction of solutions of lead nitrate and sodium sulfate. Lead(II) sulfate can be dissolved in concentrated HNO 3, HCl, H 2 SO 4 producing acidic salts or complex compounds, and in concentrated alkali giving soluble hexahydroxidoplumbate(II) [Pb(OH) 6 ] 2− complexes."}, {"url": "http://www.chemguide.co.uk/inorganic/group4/lead.html", "passage_text": "Making lead(II) sulphate Adding a source of aqueous sulphate ions to a solution of lead(II) nitrate results in a white precipitate of lead(II) sulphate. The easiest thing to add is usually dilute sulphuric acid-but any other soluble sulphate would do. Making lead(II) iodide. If you add colourless potassium iodide solution (or any other source of iodide ions in solution) to a solution of lead(II) nitrate, a bright yellow precipitate of lead(II) iodide is produced."}, {"url": "https://en.wikipedia.org/wiki/Lead%28II%29_sulfate", "passage_text": "Lead(II) sulfate (PbSO 4) is a colourless solid, which appears white in microcrystalline form. It is also known as fast white, milk white, sulfuric acid lead salt or anglesite. Lead(II) sulfate can be dissolved in concentrated HNO 3, HCl, H 2 SO 4 producing acidic salts or complex compounds, and in concentrated alkali giving soluble hexahydroxidoplumbate(II) [Pb(OH) 6 ] 2− complexes."}, {"url": "https://en.wikipedia.org/wiki/Lead%28II%29_sulfate", "passage_text": "It is often seen in the plates/electrodes of car batteries, as it is formed when the battery is discharged (when the battery is recharged, then the lead sulfate is transformed back to metallic lead and sulfuric acid on the negative terminal or lead dioxide and sulfuric acid on the positive terminal). Lead(II) sulfate can be dissolved in concentrated HNO 3, HCl, H 2 SO 4 producing acidic salts or complex compounds, and in concentrated alkali giving soluble hexahydroxidoplumbate(II) [Pb(OH) 6 ] 2− complexes."}, {"url": "http://www.answers.com/Q/Lead_sulfate_soluble_in_water", "passage_text": "Confidence votes 4. Sulphates are usually soluble in water except for Ag2SO4, BaSO4, CaSO4 and PbSO4 (lead sulphate). Hope that helps (: PbSO4 is sparingly soluble in water, its solubility at 298K is about 1.4E-4 mol/L, a very small value. So its not insoluble, it just has a very small solubility. Although the anion (SO4 2-) is found on the solubility chart, you must remember that there are exceptions i.e. the silver group (Silver ion-A … g+, Mercury (I) ion-Hg2 2+, and Lead (II) ion-Pb 2+) Since the Lead (II) cation is in the chemical formula Lead (II) Sulfate (PbSO4), it will be INSOLUBLE in water."}, {"url": "http://www.answers.com/Q/Is_lead_II_sulfate_water_soluble_or_water_insoluble", "passage_text": "Sulphates are usually soluble in water except for Ag2SO4, BaSO4, CaSO4 and PbSO4 (lead sulphate).  Hope that helps (:  PbSO4 is sparingly soluble in water, its solubility at … 298K is about 1.4E-4 mol/L, a very small value. So its not insoluble, it just has a very small solubility. All nitrates are soluble in water. Lead, Silver, and Mercury, however, are some of the most insoluble metals. The halides of these metals are almost always considered insolubl … e. 2 people found this useful."}, {"url": "http://www.chemguide.co.uk/inorganic/group4/lead.html", "passage_text": "SOME INSOLUBLE LEAD(II) COMPOUNDS This page looks at the formation of some insoluble lead(II) compounds from aqueous lead(II) ions using precipitation reactions. It describes the reactions to form lead(II) hydroxide, lead(II) chloride, lead(II) iodide and lead(II) sulphate. The easiest thing to add is usually dilute sulphuric acid-but any other soluble sulphate would do. Making lead(II) iodide. If you add colourless potassium iodide solution (or any other source of iodide ions in solution) to a solution of lead(II) nitrate, a bright yellow precipitate of lead(II) iodide is produced."}, {"url": "http://chemdemos.uoregon.edu/demos/Precipitation-of-Lead-Iodide", "passage_text": "One day of lead time is required for this project. Discussion. The solubility rules tell us that salts of group 1 (IA) metals are soluble, salts containing the nitrate anion are soluble, and salts containing the iodide anion are insoluble except for those containing the lead(II) cation (among others). This demo illustrates these rules. "}]