[{"url": "https://owl.english.purdue.edu/owl/resource/747/02/", "passage_text": "MLA format follows the author-page method of in-text citation. This means that the author's last name and the page number(s) from which the quotation or paraphrase is taken must appear in the text, and a complete reference should appear on your Works Cited page."}, {"url": "http://libraryanswers.apu.edu/a.php?qid=264974", "passage_text": "With MLA style, you need to cite the Bible two ways: in the text of your paper, and on your Works Cited page. In Text. The first time you include a quote from the Bible, you need to include the translation, chapter (abbreviated), book, and verse, like this:"}, {"url": "http://www.wikihow.com/Cite-a-Website", "passage_text": "For MLA style, you'll embed a reference to your citation in the text, then include a works cited page at the end of your essay. 2. Cite the website in the text. Directly after the sentence in which you reference the information from the website, put in a reference to your works cited page."}, {"url": "https://answers.yahoo.com/question/index?qid=20090405135647AAm0h5r", "passage_text": "Best Answer: You cite any secondary sources you quoted or paraphrased in your paper. For example, any journal articles, books, etc that you used as a reference for your paper and you used to support or develop an idea. A good general rule is, if you didn't come up with it yourself, you need to cite it."}, {"url": "http://abacus.bates.edu/~ganderso/biology/resources/writing/HTWcitations.html", "passage_text": "Throughout the body of your paper (primarily the Intro and Discussion), whenever you refer to outside sources of information, you must cite the sources from which you drew information. The simplest way to do this is to parenthetically give the author's last name and the year of publication, e.g., (Clarke 2001)."}, {"url": "https://owl.english.purdue.edu/owl/resource/747/02/", "passage_text": "1 Include in the text the first item that appears in the Work Cited entry that corresponds to the citation (e.g. author name, article name, website name, film name). 2  You do not need to give paragraph numbers or page numbers based on your Web browser’s print preview function."}, {"url": "http://www.princeton.edu/pr/pub/integrity/pages/cite/", "passage_text": "4. Facts, Information, and Data. Often you’ll want to use facts or information to support your own argument. If the information is found exclusively in a particular source, you must clearly acknowledge that source."}, {"url": "http://www.writing-with-confidence.org/citing-sources.html", "passage_text": "So you need to cite every time to use material from your research. You should place a citation in any sentence in which you use words, thoughts, facts, or opinions that you learned from a source. This is true whether you use the exact words of the source or put the information into your own words."}, {"url": "https://owl.english.purdue.edu/owl/resource/747/02/", "passage_text": "For Print sources like books, magazines, scholarly journal articles, and newspapers, provide a signal word or phrase (usually the author’s last name) and a page number. If you provide the signal word/phrase in the sentence, you do not need to include it in the parenthetical citation."}]