[{"url": "http://www.sheknows.com/baby-names/name/roxanne", "passage_text": "French Meaning: The name Roxanne is a French baby name. In French the meaning of the name Roxanne is: Dawn. American Meaning: The name Roxanne is an American baby name. In American the meaning of the name Roxanne is: Dawn. Persian Meaning: The name Roxanne is a Persian baby name. In Persian the meaning of the name Roxanne is: Dawn; bright."}, {"url": "http://www.babynamewizard.com/baby-name/girl/roxane", "passage_text": "Origin of the name Roxanne: From the Greek Roxanē, which is believed to be derived from the Persian Roschana (dawn of day). The name was borne by the Bactrian wife of Alexander the Great, which seems to substantiate the name's roots. From A World of Baby Names by Teresa Norman. Buy the book."}, {"url": "http://www.names.org/n/roxanne/about", "passage_text": "The name Roxanne is of English origin, and it means Dawn . It's a name commonly given to girls. Roxanne Pallett is an actress and singer with the most prominent portion of her career being from 2 to present. "}, {"url": "http://www.babynamewizard.com/baby-name/girl/roxanne", "passage_text": "Origin of the name Roxanne: From the Greek Roxanē, which is believed to be derived from the Persian Roschana (dawn of day). The name was borne by the Bactrian wife of Alexander the Great, which seems to substantiate the name's roots. From A World of Baby Names by Teresa Norman. Personal experiences with the name Roxanne: | Edit. Often get sung Roooooooooxxxxxaaaaaaaaane, you don't have to put on the red light!. I was named after the lovely lady on Beat the Clock game show. She was popular in the fifties when the name was most popular. There was even a Roxanne doll."}, {"url": "http://babynames.allparenting.com/list/French_Baby_Names/Roxanne/details/", "passage_text": "Baby names meanings search results: The name Roxanne is a baby girl name. The name Roxanne comes from the French origin. In French The meaning of the name Roxanne is: Dawn. "}, {"url": "http://www.ohbabynames.com/meaning/name/roxanne/5344", "passage_text": "Etymology & Historical Origin-Roxanne. Roxanne is the English and French form of an ancient Greek name Roxana (ρωξάνη) which was ultimately derived from the Bactrian-Persian Roshanak (روشنک) meaning “dawn” (or “bright, radiant one”). Literary Characters of the Baby Name Roxanne. Roxana (The Fortunate Mistress) Roxana Beleau is the title character of Daniel Defoe’s 1724 novel, Roxana: The Fortunate Mistress, purported to be a first person account of her life."}, {"url": "http://www.thinkbabynames.com/meaning/0/Roxanne", "passage_text": "Roxanne /rox-anne/ [2 sylls.] as a girls' name is pronounced roks-ANN. It is of Persian origin, and the meaning of Roxanne is  dawn . Roxandra is a contemporary blend of Roxane and Alexandra, appropriate since Roxane was the Persian princess Alexander the Great married during his travels of conquest. Roxane is the heroine of Rostand's play Cyrano de Bergerac. Shown below is the birth name popularity of Roxanne for girls. Roxanne was first listed in 1940-1949 and reached its peak position of #196 in the U.S. during the years 1950-1959, but is not ranked currently."}]