[{"url": "http://onlineslangdictionary.com/meaning-definition-of/granola", "passage_text": "Link to this slang definition. To link to this term in a web page or blog, insert the following. To link to this term in a wiki such as Wikipedia, insert the following. Some wikis use a different format for links, so be sure to check the documentation."}, {"url": "http://www.urbandictionary.com/define.php?term=granola", "passage_text": "Jack: My best friend is vegan and only buys produce that is organically grown from local farmers. Her and her feminist, vegan boyfriend are both in Greenpeace and advocate for queer rights. She waxes her legs but she's still granola. A middle age/late age suburbian white man or woman who is usually middle class that values natural things. Granola people, dispite common belief are NOT hippies and have normal houses and familys. They are extremely Left. A Granola person can usually be found in nature or at L.L. Bean"}, {"url": "http://thesnapmom.com/what-is-crunchy/", "passage_text": "The definition of Crunchy: Crunchy refers to the crunch of granola, which (as goes the stereotype) hippie-esque people are likely to eat. To be crunchy is to be along the mindset of all-natural. There’s a very broad spectrum but here are some topics associated with crunchy mommies: "}, {"url": "https://en.wikipedia.org/wiki/Granola", "passage_text": "Granola is a breakfast food and snack food consisting of rolled oats, nuts, honey, and sometimes puffed rice, that is usually baked until crisp. During the baking process the mixture is stirred to maintain a loose, breakfast cereal-type consistency. Dried fruits, such as raisins and dates, are sometimes added. It is often combined into a bar form. Granola is often eaten in combination with yogurt, honey, fruit (such as bananas, strawberries, and/or blueberries), milk, and/or other forms of cereal. It can also serve as a topping for various types of pastries and/or desserts. Granola, particularly recipes that include flax seeds, is often used to improve digestion"}, {"url": "http://pistachioproject.com/2011/07/crunchy-defined-what-is-crunchy.html", "passage_text": "Being crunchy usually means that the person is someone who doesn’t just go with mainstream ideas and philosophies simply because everyone else does. Now that is not to say that someone who is crunchy doesn’t do mainstream things, sometimes mainstream works. However, it means that (usually) crunchy people are notorious for researching their hearts out. We spend hours reading books, talking with others, and scouring the Internet. I decided to do this series to explain what being crunchy means, why people choose to be crunchy and even include a few interviews of fellow crunchy people. Crunchy is generally a term used to describe a type of parenting style. Although I hardly think that it needs to solely apply to parents."}, {"url": "http://www.urbandictionary.com/define.php?term=granola", "passage_text": "The choice of not removing body hair (see amazon) and drug use are not characteristics that define granola people, and people, regardless of granola status, may or may not partake in said activities. This definition is sometimes confused with hippy. A middle age/late age suburbian white man or woman who is usually middle class that values natural things. Granola people, dispite common belief are NOT hippies and have normal houses and familys. They are extremely Left. A Granola person can usually be found in nature or at L.L. Bean"}, {"url": "http://www.thefreedictionary.com/granola", "passage_text": "gra·no·la. n. Rolled oats mixed with various ingredients, such as dried fruit, brown sugar or honey, and nuts, and then baked. Granola is used especially as a breakfast cereal. adj. "}, {"url": "http://www.answers.com/Q/What_does_being_granola_mean", "passage_text": "'Being granola' means that your lifestyle is like that of a hippie. You tend to eat natural, organic foods and are often vegetarian. You tend to recycle, have a compost bin/pile at your home, use carpooling or walk. You wear loose fitting, comfortable clothes. 1 Homemade Low-Fat Granola Bars Eating well does not always have to mean eating without flavor. 2  Low-fat granola bars are easy to make, and it is even possible to find low-fat recipes for them. 3  Adding your o…. 4  Homemade Nut-free Granola Made Simple It is often difficult to find nut-free granola recipes."}]