[{"url": "http://www.laits.utexas.edu/~anorman/long/DII.html", "passage_text": "It is important to distinguish between an invention and an innovation. Spreadsheet software is an invention. A new business application of spreadsheets that increases profits is an innovation. An example of an innovation in government is submitting tax returns to the IRS by E-mail instead of regular mail. The interaction between discovery and invention is a two-way street. Obviously, as science advances, it produces opportunities to create new inventions. However, the development of the full economic value of an invention requires massive discoveries for many"}, {"url": "https://en.wikipedia.org/wiki/Timeline_of_historic_inventions", "passage_text": "The timeline of historic inventions is a chronological list of particularly important or significant technological inventions and the people who created the inventions. Note: Dates for inventions are often controversial. 1 However, others inventors before Bell had worked on the development of the telephone and the invention had several pioneers. 2  1877: The first working phonograph is invented by Thomas Edison. 3  1878: Henry Fleuss is granted a patent for the first practical rebreather."}, {"url": "https://en.wikipedia.org/wiki/Timeline_of_historic_inventions", "passage_text": "1 1811: Friedrich Koenig invents the first powered printing press which was also the first to use a cylinder. 2  1814: The modern planing machine is invented by James Fox, though Matthew Murray of Leeds and Richard Roberts of Manchester have also been credited at times with its invention. 1 However, others inventors before Bell had worked on the development of the telephone and the invention had several pioneers. 2  1877: The first working phonograph is invented by Thomas Edison. 3  1878: Henry Fleuss is granted a patent for the first practical rebreather."}, {"url": "http://www.royalfaires.com/arizona/images/pdf/Renaissance%20Discoveries%20%26%20Inventions.pdf", "passage_text": "Some of the everyday things that we use today are Renaissance inventions and technology. Some of the greatest inventions of all times were made during this period. Renaissance inventions and inventors were truly revolutionary and unique and the world is what it is today, due to these inventions made at that period. Inventions and Discoveries: 1300 Invention of the first mechanical clock. 1366 Invention of scales for weighing. Looking at this timeline will help you to get a better idea of the chronological order in which these inventions were made. Renaissance inventions and discoveries had a great impact in the evolution of arts and science."}, {"url": "http://www.inventionreaction.com/famous/", "passage_text": "Invention of the Internet. The Internet is something which many of us now take for granted, but the invention of the Internet, is still recent. The Internet is essentially a network connecting thousands of smaller networks into a single global network. The Internet model and the.."}, {"url": "http://www.inventionreaction.com/famous/", "passage_text": "Invention of the Steam Engine. The invention of the engine has played a major role in the environment we live in today-surrounded by transport and industries all reliant on an engine of some description. The engine we see today is a progression of the steam engine, using the same... The Internet is something which many of us now take for granted, but the invention of the Internet, is still recent. The Internet is essentially a network connecting thousands of smaller networks into a single global network. The Internet model and th"}, {"url": "http://wonderfulengineering.com/10-inventions-that-were-created-due-to-world-war-i/", "passage_text": "Advertisement. Advertisement. Many inventions are created out of necessity, and many of the items we take for granted today were created during war times. During World War I, the majority of the planet was going through a hard time and it was in these times of harshness that a lot of modern day technologies came to be. Here is a look at 10 such inventions that came about during WWI. 3. Stainless Steel. This major component of the modern world was created by Harry Brearley of Sheffield in 1913. The British military was having trouble with the barrels of their rifles which became distorted with repeated firing, and so Brearley, a metallurgist, was asked to find a solution."}, {"url": "http://www.inventionreaction.com/famous/", "passage_text": "Our famous inventions include the invention of the telephone, computer, radio and television. The invention of the automobile can be traced back as far as 1769, when one Nicolas-Joseph Cugnot, devised the very first concept-a complex, three wheeled steam engine. The Internet is something which many of us now take for granted, but the invention of the Internet, is still recent. The Internet is essentially a network connecting thousands of smaller networks into a single global network. The Internet model and the.."}, {"url": "http://www.softschools.com/timelines/industrial_revolution_timeline/40/", "passage_text": "As these inventions created new manufacturing and industry, many people also moved away from farms into cities. It was a time of very rapid change in the world. Date Event 1712 The steam engine is invented. Thomas Newcomen invents the first steam engine. One of the most important inventions of the Industrial Revolution, steam engines power the first trains, steamboats, and factories. 1794 Eli Whitney patents the cotton gin. Eli Whitney creates a machine that makes it much easier to separate cotton seeds from cotton fiber."}]