[{"url": "http://www.collectorsweekly.com/costume-jewelry/celluloid", "passage_text": "Examples of celluloid costume jewelry include bangles studded with small rhinestones, pins and necklaces made out of molded leaves in a variety of colors, and earrings that resemble everything from carved ivory and coral to Christmas ornaments. The advent of hard, carvable Bakelite and this new, somewhat-less-flammable version of celluloid (lowercase now, since the word was often used imprecisely to describe plastics in general) spurred even more uses of the material, particularly in costume jewelry."}, {"url": "http://www.midcenturyjewelry.com/what-is-celluloid/", "passage_text": "The two bangles with rhinestones are celluloid. These are unusual in that the most common type of celluloid jewelry I see are celluloid bangle bracelets and pins in a pale cream or white color, with molded flowers painted in a pastel color. Celluloid was used to make pins, hat pins, bracelets, beads, etc. Today it is still used to make guitar picks. The dress clip shown below is more typical of the type of celluloid flower jewelry you might run across in the marketplace. Celluloid is many times quite lightweight and the creamy colors remind me of chalk"}, {"url": "http://www.midcenturyjewelry.com/how-to-identify-celluloid-jewelry/", "passage_text": "How To Identify Celluloid Jewelry. Celluloid was manufactured as an early plastic. Jewelry made of celluloid dates to about 1900 and was quite popular during the Art Deco period. It is a lightweight plastic, many times a cream color. Sometimes the cream celluloid is painted to add color, though. In the 1950s, a lot of celluloid jewelry was manufactured in Japan. Celluloid can be quite distinctive looking, many times with rhinestones embedded into the jewelry or molded/carved into floral designs. Smell test: Hold your celluloid jewelry under hot water for 30 seconds. Now, put it up to your nose and smell it"}, {"url": "http://www.ebay.com/gds/What-Is-Celluloid-A-Jewelry-Guide-/10000000004565574/g.html", "passage_text": "I have also seen Bakelite and Celluloid in the same piece of jewelry. Celluloid bangle bracelets are frequently seen on the antique and collectibles market, normally with the aforementioned molded floral design. It isn't easy to find these items in pristine condition. Comments Comment. 88 Vote 88 Votes. Please sign in to vote on this Guide. If you found this guide helpful, please click the link and give it your vote. Unlike the harder, more resilient Bakelite or Catalin (two other collectible old plastics), Celluloid is flammable, sensitive to heat and easily damaged."}, {"url": "http://www.ebay.com/gds/What-Is-Celluloid-A-Jewelry-Guide-/10000000004565574/g.html", "passage_text": "Never expose celluloid items (or items you think may be made of celluloid) to heat or solvents. It could be dangerous to both you and your collectible. If you found this guide helpful, please click on the link and give it your vote. Thank you. Comments Comment. 88 Vote 88 Votes. Please sign in to vote on this Guide. If you found this guide helpful, please click the link and give it your vote. Unlike the harder, more resilient Bakelite or Catalin (two other collectible old plastics), Celluloid is flammable, sensitive to heat and easily damaged."}, {"url": "http://www.ebay.com/gds/What-Is-Celluloid-A-Jewelry-Guide-/10000000004565574/g.html", "passage_text": "Today, celluloid is still used to make guitar picks. During the late 19th and early 20th centuries, the material was used in a variety of items, including handles of utensils, buttons, pens, film etc. Comments Comment. 88 Vote 88 Votes. Please sign in to vote on this Guide. If you found this guide helpful, please click the link and give it your vote. Unlike the harder, more resilient Bakelite or Catalin (two other collectible old plastics), Celluloid is flammable, sensitive to heat and easily damaged."}, {"url": "https://theloveofvintage.wordpress.com/2012/03/30/alessonincelluloid/", "passage_text": "Celluloid Novelty Jewellery. In the 1950s, Japan produced a lot of Celluloid jewellery such as novelty brooches of Scottie dogs, people, flowers, etc. I particularly love this type of Celluloid jewellery as the pieces are so unique and adorable. Celluloid Scottie, Etsy itsagoodthing. Celluloid was widely used for a variety of items including jewellery, due to its versatility. Combs were made that resembled tortoise and necklaces, vanity sets, and other items were made to look like ivory (often referred to as ‘French ivory’)."}, {"url": "http://www.collectorsweekly.com/costume-jewelry/celluloid", "passage_text": "Celluloid was also a popular material for dress and fur clips of the 1920s and ’30s, often used in combination with metal or casein, another type of early plastic. Shapes included flowers of all types and colors, birds, puppy dogs, and characters from Popeye to ice skaters. The advent of hard, carvable Bakelite and this new, somewhat-less-flammable version of celluloid (lowercase now, since the word was often used imprecisely to describe plastics in general) spurred even more uses of the material, particularly in costume jewelry."}, {"url": "http://antiques.about.com/od/learningaboutantiques/a/Collecting-Celluloid090612.htm", "passage_text": "Celluloid is actually a trade name, like Band-Aid or Kleenex, but the term has been generically used for many years to reference a type of plastic material invented in the mid 1800s and used to make a variety of objects until around 1940. While some of these items, especially dresser sets, can be found in the common pale yellow coloring, there are many other ways this plastic was colored and decorated. Take celluloid jewelry as an example."}]