[{"url": "http://www.mbp.state.md.us/pages/faq_records.htm", "passage_text": "Maryland law (Health General Sec. 4-304) allows physicians to charge patients (or the patient's personal representative) a fee for copying medical records. The charges may be adjusted annually for inflation. 1 A fee for copying not to exceed .76 cents for each page of the medical record, and. 2  The actual cost of postage and handling. 3  Preparation fee of $22.88, if the records are sent to another provider. 4  The federal HIPAA regulations do not allow a charge for a preparation fee for records provided directly to the patient."}, {"url": "http://medicalboard.georgia.gov/can-my-doctor-charge-me-copy-my-medical-records", "passage_text": "Are there exceptions to charging for a copy of my medical records?Yes, A physician may not charge for medical records requested in order to make or complete an application for a disability benefits program per O.C.G.A. § 31-33-3(a). O.C.G.A. § 31-33-3 -provides the fees that a physician may charge for copying and mailing patient records. The physician may even require the payment up front, (before providing the records). HIPAA * may apply."}, {"url": "http://www.mbc.ca.gov/Consumers/Complaints/Complaints_FAQ/Medical_Records_FAQ.aspx", "passage_text": "If you made your request in writing for the records to be sent directly to you, the physician must provide copies to you within 15 days. The physician can charge a reasonable fee for the cost of making the copies. If the physician's office advises you that a fee will be charged for the records, the medical records do not need to be provided until the fee is paid. If the physician does not comply within the time frame you can file a written complaint with the Medical Board. If you want to insure that your new doctor receives a copy of your medical records from your previous doctor, you can write your previous doctor requesting that a copy of your medical records be sent directly to you. When you receive your records, you can provide a copy of those records to any provider you choose."}, {"url": "http://patientsafetyauthority.org/NewsAndInformation/Brochures/Documents/brochure_medical_records.pdf", "passage_text": "Providers may charge reasonable copying fees, set by the Department of Health, and may also charge for shipping and postage. The right to amend your medical record by having information added to it. You can request to have information added to your medical record in order to make it more complete or more accurate. Your provider must consider your request and respond to it within 30 days of receipt of your written request."}, {"url": "http://www.mass.gov/eohhs/docs/borim/physicians/medical-record-obligations.doc", "passage_text": "Under HIPAA a physician has 30 days to provide the patient or the patient’s representative with a copy of the requested medical records; however, if the medical records are not maintained or are not accessible on-site, then a physician has 60 days to provide the records. The records can be requested by a patient, the patient’s parent (if a minor) or legal guardian, or, with patient authorization, by another physician or any person authorized by the patient."}, {"url": "http://www.cpso.on.ca/Policies-Publications/Policy/Medical-Records", "passage_text": "The medical record is a powerful tool that allows the treating physician to track the patient’s medical history and identify problems or patterns that may help determine the course of health care. The primary purpose of the medical record is to enable physicians to provide quality health care to their patients. A fee for a transfer of medical records may only be requested after a fee estimate has been provided to the patient and when, in the best judgment of the treating physician, the patient’s health and safety will not be put at risk if the records are not transferred until payment is received."}, {"url": "http://patientsafetyauthority.org/NewsAndInformation/Brochures/Documents/brochure_medical_records.pdf", "passage_text": "The right to see and get a copy of your medical record. Your provider must make reasonable accom-modations for you to view your medical records, or he must provide you with copies of your medical records within 30 days of receipt of your written request. You can request to have information added to your medical record in order to make it more complete or more accurate. Your provider must consider your request and respond to it"}, {"url": "https://www.health.ny.gov/professionals/doctors/conduct/frequently_asked_questions.htm", "passage_text": "You can request a copy of your medical records from your physician. The cost can be no more than 75 cents per copied paper page. A physician cannot refuse to let a patient see medical records because of an unpaid bill. "}, {"url": "http://journal.ahima.org/2012/03/01/how-to-request-your-medical-records/", "passage_text": "There are many good reasons to request a copy of your medical records. Physicians don’t always share complete patient information or exchange a patient’s health records, so if a patient is seeing a new provider it is beneficial to ensure a copy of their record is sent to the new physician, Tegen says. "}, {"url": "http://www.azmd.gov/FAQ/MedRecordsPatient.aspx", "passage_text": "You must start by making a written request for your medical records. Your new physician may ask you to sign a records release form that staff will send to your old physician, requesting your charts. When a physician requests a patient’s records from another doctor for continuity of care, there is no charge. If the physician was in a practice with other physicians, the practice may have retained your medical records. You should make your request there. The Arizona Medical Board does not store any patient records for dispersal."}]