[{"url": "http://www.popsugar.com/fitness/How-Much-Should-You-Exercise-Lose-Weight-20090267", "passage_text": "Read on to see how many hours you should be spending on moderate or vigorous exercise every week. Lose weight: Creating a calorie deficit that results in weight loss is hard work. Most recommendations say that to lose weight, you must exercise for at least an hour a day, five times a week. The type of exercise matters, too. "}, {"url": "http://www.livestrong.com/article/442311-how-many-minutes-should-i-work-out-to-lose-weight/", "passage_text": "Calories. For weight loss, you should be attempting to burn a certain amount of calories during exercise. Burning at least 2,000 calories per week from exercise is the recommendation of the American College of Sports Medicine. The amount you need to exercise for weight loss exceeds the amount you should exercise to maintain your weight or health. According to the American College of Sports Medicine, you should try to accumulate 300 minutes of exercise per week for weight loss. This is compared to the recommendations from the American College of Sports Medicine and the American Heart Association to exercise of 30 minutes, five days per week"}, {"url": "http://www.motleyhealth.com/fitness/how-much-exercise-is-needed-to-get-fit-and-lose-weight", "passage_text": "21 Minutes a Day – UK Health Department. In July 2011 the UK government updated its guidelines on exercise. The latest guidelines is that everyone should aim to get 150 minutes of exercise each week, which averages out at 21 1/2 minutes each day, or five 30 minute sessions, which is the general recommendation given. Part of the problem is that these guidelines still do not address lifestyle factors. "}, {"url": "http://www.livestrong.com/article/442311-how-many-minutes-should-i-work-out-to-lose-weight/", "passage_text": "Try to accumulate 300 minutes of exercise for weight loss. Photo Credit Jupiterimages/Photos.com/Getty Images. Weight loss is a great motivator for exercise. However, you should be sure you are doing the right amount of exercise to reach your goals. The amount you need to exercise for weight loss exceeds the amount you should exercise to maintain your weight or health. According to the American College of Sports Medicine, you should try to accumulate 300 minutes of exercise per week for weight loss. This is compared to the recommendations from the American College of Sports Medicine and the American Heart Association to exercise of 30 minutes, five days per week"}, {"url": "http://www.webmd.com/fitness-exercise/guide/your-exercise-routine-how-much-is-enough", "passage_text": "Experts explain why some people should try for 30 minutes of exercise a day, while others need up to 90 minutes. In January 2005, the U.S. government released a new set of dietary guidelines essentially telling us that as Americans get bigger, so does the length of time we need to be physically active. "}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/fitness/expert-answers/exercise/faq-20057916", "passage_text": "As a general goal, aim for at least 30 minutes of physical activity every day. If you want to lose weight or meet specific fitness goals, you may need to exercise more. Want to aim even higher? You can achieve more health benefits, including increased weight loss, if you ramp up your exercise to 300 minutes a week. 1 Aerobic activity. 2  Get at least 150 minutes a week of moderate aerobic activity or 75 minutes a week of vigorous aerobic activity. 3  You also can do a combination of moderate and vigorous activity. 4  The guidelines suggest that you spread out this exercise during the course of a week. 5  Strength training."}, {"url": "http://www.sparkpeople.com/blog/blog.asp?post=how_much_exercise_you_really_need_to_lose_weight", "passage_text": "In 2001, ACSM recommended that overweight and obese adults get at least 150 minutes of moderate-intensity exercise per week to improve their health. 200 to 300 minutes per week was recommended for long-term weight loss. I think for most people 50 minutes may be enough but it also depends on how hard you exercise. I tend to do a good hour and a half per day 5 days a week for sure but that doesn't include all of the walking that I try to get in and I still have to stay within my calories and make sure that I track everything."}, {"url": "http://www.wikihow.com/Use-Exercise-to-Help-You-Lose-Weight", "passage_text": "5. Work up to exercising at least 30 to 45 minutes per day, 4 or 5 days per week. Depending on your level of fitness, you may want to work up to that gradually. Lesser amounts of exercise are adequate if your goal is longevity or a healthy body and mind. "}, {"url": "http://www.sparkpeople.com/blog/blog.asp?post=how_much_exercise_you_really_need_to_lose_weight", "passage_text": "50 minutes of exercise doesn't seem like a lot to me. 30 minutes of it come naturally to me because I don't own a car and do nearly everything by bicycle. I've done this all my life and it didn't help me to lose weight, on the contrary. I think for most people 50 minutes may be enough but it also depends on how hard you exercise. I tend to do a good hour and a half per day 5 days a week for sure but that doesn't include all of the walking that I try to get in and I still have to stay within my calories and make sure that I track everything."}]