[{"url": "http://iisrp.com/WebPolymers/07NBR-18Feb2002.pdf", "passage_text": "With a temperature range of –40C to +125C, NBR materials can withstand all but the most severe automotive applications. On the industrial side NBR finds uses in roll covers, hydraulic hoses, conveyor belting, graphic arts, oil field packers, and seals for all kinds of plumbing and appliance applications. Worldwide consumption of NBR is expected to reach 368,000 metric tons annually by the year 2005[1]"}, {"url": "http://www.kflexusa.com/downloads/Technical%20Bulletins/TA67%20NBR%20vs%20EPDM.pdf", "passage_text": "TECHNICAL BULLETIN TA67 Page 1 of 4 TA67-0315 NBR vs. EPDM Based Elastomeric Insulation Materials Polymer Comparison Physical Property Characteristics Historically, elastomeric insulation has been manufactured from an NBR (Nitrile Butadiene Rubber)/PVC polymeric blend. The lower temperature flexibility and lower temperature limits of NBR polymeric blends meet or exceed the requirements of common installation practices and refrigerant line temperatures. EPDM-based materials would have a lower flexibility limit (down to -60F)."}, {"url": "http://www.solenoidvalvesuk.com/solenoidvalveseals.asp", "passage_text": "The chemical name for Nitrile rubber is Butadiene Acrylonitrile. However, most commonly it is referred to as NBR or Buna-N. NBR is probably the most common solenoid valve seal material and it is considered the standard material for neutral fluids by many. NBR is also the standard material for O-rings. NBR can stand media temperatures to approximately 90 degrees Celsius on continuous basis, and higher temperatures intermittently. NBR resists aging caused by heat very well. However, NBR's resistance to sunlight is very poor. Abrasion and tear resistance of NBR is very good. "}, {"url": "http://www.azom.com/article.aspx?ArticleID=1724", "passage_text": "The unique properties attributed to HNBR have resulted in wide adoption of HNBR in automotive, industrial, and assorted, performance-demanding applications. On a volume basis, the automotive market is the largest consumer, using HNBR for a host of dynamic and static seals, hoses, and belts. HNBR has also been widely employed in industrial sealing for oil field exploration and processing, as well as rolls for steel and paper mills. HNBR is widely known for its physical strength and retention of properties after long-term exposure to heat, oil, and chemicals. Depending on filler selection and loading, HNBR compounds typically have tensile strengths of 20 - 31 MPa when measured at 23°C."}, {"url": "http://www.sealseastern.com/hnbr.htm", "passage_text": "Subsequent improvements to the material properties, over that of a nitrile rubber (NBR), include greater thermal stability, broader chemical resistance, and greater tensile strength. HNBR is classified by ASTM as a DH-type polymer. SRI. H ydrogenated N itrile B utadiene R ubber (HNBR), also known as H ighly S aturated N itrile (HSN), is special class of nitrile rubber (NBR) that has been hydrogenated to increase saturation of the butadiene segment of the carbon polymer backbone."}, {"url": "https://en.wikipedia.org/wiki/Nitrile_rubber", "passage_text": "Nitrile rubber, also known as Buna-N, Perbunan, acrylonitrile butadiene rubber, and NBR, is a synthetic rubber copolymer of acrylonitrile (ACN) and butadiene. Trade names include Nipol, Krynac and Europrene. Nitrile butadiene rubber (NBR) is a family of unsaturated copolymers of 2-propenenitrile and various butadiene monomers (1,2-butadiene and 1,3-butadiene). Its resilience makes NBR a useful material for disposable lab, cleaning, and examination gloves. Nitrile rubber is more resistant than natural rubber to oils and acids, and has superior strength, but has inferior flexibility."}, {"url": "http://www.robinsonrubber.com/pdfs/NitrileRubber.pdf", "passage_text": "All rights reserved. Rubber Material Selection Guide NBR / Nitrile or Buna N Acrylonitrile Butadiene 2 Robinson Rubber Products – Nitrile or Buna N © Copyright 2005 Robinson Rubber Products Company, Inc. "}, {"url": "http://www.skf.com/group/products/seals/materials/elastomers/nbr/nitrile-rubber/index.html", "passage_text": "Nitrile rubber (R). The term nitrile rubber is used for acrylonitrile-butadiene rubber (NBR). This material has very good engineering properties and is a general-purpose sealing lip material. It is a copolymer manufactured from acrylonitrile and butadiene that provides good resistance to the following media:"}]