[{"url": "http://boxtrees.com/FAQs.html", "passage_text": "Once the plant is established, buxus sempervirens will grow about 6-9 inches a year under reasonable growing conditions. In deep shade, very poor soil and very exposed sites, the growth rate is lower. For most box garden hedges, multiply the length of the hedge in metres by 5 to calculate the number of plants required. This corresponds to a spacing of 20cm (8 inches), and is suitable for are root and container grown plants up to 40cm tall when planted."}, {"url": "http://www.pfaf.org/user/Plant.aspx?LatinName=Buxus+sempervirens", "passage_text": "Physical Characteristics. Buxus sempervirens is an evergreen Shrub growing to 5 m (16ft) by 5 m (16ft) at a slow rate. It is hardy to zone (UK) 5. It is in leaf 12-Jan It is in flower from Apr to May, and the seeds ripen in September"}, {"url": "http://www.ehow.com/info_8137710_tall-do-boxwood-shrubs-grow.html", "passage_text": "In fact, Compacta has an extremely slow growth rate and may take 15 years to reach a height of about 10 inches. On the other hand, taller varieties grow more quickly. Most grow, on average, between 3 and 6 inches per year, but Buxus sempervirens Highlander grows at an astonishing rate of 24 inches per year. In fact, boxwoods have been used as garden plants for about 4,000 years. Although there are over 90 species of boxwood, just three of them -- and their hybrids -- make up the majority of boxwoods used in landscapes in the United States today. The tallest can grow to heights of around 20 feet."}, {"url": "http://www.topiarygarden.co.uk/Diary/diary-clipping-buxus-sempervirens.html", "passage_text": "Buxus Sempervirens-a growing diary. Following on from our propagating buxus softwood cuttings growing diary. This year we shall be trialing differing clipping / pruning techniques on more mature Buxus Sempervirens plants. The plants we have chosen are all 3 to 4 years old and have been pot grown. "}, {"url": "http://homeguides.sfgate.com/fast-green-tower-boxwood-grow-per-year-49934.html", "passage_text": "Green Tower boxwood (Buxus sempervirens Monrue) is a cultivar of boxwood renowned for its tall, narrow, columnar shape. Hardy in U.S. Department of Agriculture zones 5 to 9, this boxwood is an excellent choice for use as a privacy screen, a hedge, a backdrop to a formal garden or in pairs to flank an entry way. A Column of Green. Green Tower boxwood is a moderately fast grower, adding about 18 inches each year until it reaches its mature height of 9 feet. It remains only 1 to 2 feet wide at maturity, giving it a pronounced"}, {"url": "http://www.growsonyou.com/question/show/15226", "passage_text": "4 x 2.5 feet after 5 years, ultimately 13 feet high-if you don't clip it or keep it in pot. Cliffo. or box common ' tree ultimate height, in ten to twenty years 30ft (9m) hedge height 1to 9ft avgrage groth 4 to 6inches per year, thats upward groth but the weeping nature means it will grow a lot more, hope this helps."}, {"url": "https://en.wikipedia.org/wiki/Buxus_sempervirens", "passage_text": "Buxus sempervirens is an evergreen shrub or small tree growing to 1–9 m (3 ft 3 in–29 ft 6 in) tall, with a trunk up to 20 centimetres (7.9 in) in diameter (exceptionally to 10 m tall and 45 cm diameter). Buxus sempervirens (common box, European box, or boxwood), is a species of flowering plant in the genus Buxus, native to western and southern Europe, northwest Africa, and southwest Asia, from southern England south to northern Morocco, and east through the northern Mediterranean region to Turkey."}, {"url": "http://boxwoodgarden.com/cultivars-of-boxwood.htm", "passage_text": "Buxus sempervirens (common boxwood) Ideal for hedges, 21” or taller and topiary. Grows 4”-6” per year. Zone 5-8 Buxus sempervirens ‘Suffruticosa’ Dwarf boxwood, smaller rounded leaves. Traditionally used for edges up to 21.” Fabulous free growing in groups. Grows 1”-2” per year. Zone 5-8 Buxus sempervirens ‘Graham Blandy’ Excellent for vertical accent."}, {"url": "http://homeguides.sfgate.com/dwarf-english-boxwood-26095.html", "passage_text": "Dwarf English boxwoods can serve as borders for formal plantings. The dwarf English boxwood (Buxus sempervirens “Suffruticosa”), an evergreen shrub, gets to around 3 feet tall. The small leaves are dark green on the top and light green on the underside. "}]