[{"url": "http://www.livescience.com/38218-facts-about-pangaea.html", "passage_text": "About 200 million years ago, the supercontinent began to break up. Gondwana (what is now Africa, South America, Antarctica, India and Australia) first split from Laurasia (Eurasia and North America). Then about 150 million years ago, Gondwana broke up. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080123190646AAbjReJ", "passage_text": "Pangaea was the supercontinent that existed during the Paleozoic and Mesozoic eras about 250 million years ago, before each of the component continents were separated into their current configuration. Source(s): wikipedia.com. love_4depp · 8 years ago. Thumbs up. "}, {"url": "http://www.answers.com/Q/What_is_pangaea", "passage_text": "Pangaea was a large, ancient landmass that was composed of all the continents joined together, also called a supercontinent.. Its name is Ancient Greek: Pan meaning entire and Gaea meaning Earth; from the Greek meaning all lands.. Pangaea is believed to have formed around 300 million years ago and began to break up around 175 million years ago. It was a roughly C-shaped landmass that had all of our modern continents together as one."}, {"url": "http://www.answers.com/Q/What_was_Pangaea", "passage_text": "Pangaea was a supercontinent that formed approximately 300 million years ago. It existed during the Paleozoic and early Mesozoic eras, breaking apart to form the continents we know today after about 100 million years. Pangaea was a large, ancient landmass that was composed of all the  continents joined together, also called a supercontinent.. Its  name is Ancient Greek:  Pan meaning  … entire and  Gaea meaning  Earth; from the Greek meaning all lands.."}, {"url": "http://geography.about.com/od/physicalgeography/a/Pangea.htm", "passage_text": "Pangea, also spelled Pangaea, was a supercontinent that existed on the Earth millions of years ago and covered about one-third of its surface. Pangea began to break up about 200 million years ago as a result of the movement of the Earth's tectonic plates and mantle convection."}, {"url": "http://www.answers.com/Q/What_is_pangaea", "passage_text": "Pangaea was a supercontinent that formed approximately 300 million  years ago. It existed during the Paleozoic and early Mesozoic eras,  breaking apart to form the continent … s we know today after about 100  million years. Its name is Ancient Greek: Pan meaning entire and Gaea meaning Earth; from the Greek meaning all lands.. Pangaea is believed to have formed around 300 million years ago and began to break up around 175 million years ago. It was a roughly C-shaped landmass that had all of our modern continents together as one."}, {"url": "https://en.wikipedia.org/wiki/Pangaea", "passage_text": "Pangaea or Pangea (/paenˈdʒiːə/) pænˈdʒiːə was a supercontinent that existed during the Late paleozoic and Early mesozoic. eras The second major phase in the break-up of Pangaea began in the Early Cretaceous (150–140 Ma), when the minor supercontinent of Gondwana separated into multiple continents (Africa, South America, India, Antarctica, and Australia)."}, {"url": "http://www.universetoday.com/73678/what-is-pangea/", "passage_text": "It was the supercontinent that existed 250 million years ago during the Paleozoic and Mesozoic eras. During the ensuing millenia, plate tectonics slowly moved each continent to its current position on the planet. Each continent is still slowly moving across the face of our world. The next-to-last one, Pannotia, formed about 600 million years ago during the Proterozoic eon. Pannotia included large amounts of land near the poles and only a relatively small strip near the equator connecting the polar masses."}, {"url": "http://www.bbc.co.uk/science/earth/earth_timeline/pangaea", "passage_text": "Pangaea (sometimes spelled Pangea), the most recent of a series of supercontinents on Earth, formed about 270 million years ago and broke apart about 200 million years ago. At this time most of the dry land on Earth was joined into one huge landmass that covered nearly a third of the planet's surface. Pangaea begins to break up. Pangaea or Pangea (/paenˈdʒiːə/) pænˈdʒiːə was a supercontinent that existed during the Late paleozoic and Early mesozoic. Eras it assembled from earlier continental units approximately 300 million years, ago and it began to break apart about 175 million years. ago"}, {"url": "http://study.com/academy/lesson/what-is-pangaea-theory-definition-quiz.html", "passage_text": "In 1927, his proposed supercontinent was named Pangaea, which means 'whole earth,' and scientists still believe that Pangaea was the most recent supercontinent in the earth's history, existing about 225 million years ago. "}]