[{"url": "http://www.webmd.com/drugs/2/drug-9667/restoril-oral/details", "passage_text": "Tell your doctor right away if you have any serious side effects, including: memory loss, mental/mood/behavior changes (such as new/worsening depression, abnormal thoughts, thoughts of suicide, hallucinations, confusion, agitation, aggressive behavior, anxiety)."}, {"url": "http://www.rxlist.com/restoril-side-effects-drug-center.htm", "passage_text": "Our Restoril (temazepam) Side Effects Drug Center provides a comprehensive view of available drug information on the potential side effects when taking this medication. This is not a complete list of side effects and others may occur."}, {"url": "http://www.rxlist.com/restoril-side-effects-drug-center.htm", "passage_text": "Restoril Overview-Patient Information: Side Effects. SIDE EFFECTS: Dizziness or difficulty with coordination may occur. If either of these effects persists or worsens, tell your doctor or pharmacist promptly. To reduce the risk of dizziness or falling, get up slowly when rising from a sitting or lying position."}, {"url": "http://www.medicinenet.com/temazepam/page2.htm", "passage_text": "PRESCRIBED FOR: Temazepam is used for the short-term (7-10 days) management of insomnia. Insomnia is defined as difficulty falling asleep, frequent awakening during the night after falling asleep, and/or early morning awakening. SIDE EFFECTS: The most common side effects associated with temazepam are."}, {"url": "http://www.rxlist.com/restoril-side-effects-drug-center.htm", "passage_text": "Get emergency medical help if you have any of these signs of an allergic reaction: hives; difficulty breathing; swelling of your face, lips, tongue, or throat. Stop using temazepam and call your doctor at once if you have any of these serious side effects: 1  weak or shallow breathing; 2  fast or pounding heartbeats;"}, {"url": "http://www.rxlist.com/restoril-side-effects-drug-center.htm", "passage_text": "Less serious side effects may include: 1  daytime drowsiness (or during hours when you are not normally sleeping); 2  amnesia or forgetfulness; 3  muscle weakness, lack of balance or coordination; 4  numbness, burning, pain, or tingly feeling; 5  headache, blurred vision, depressed mood; 6  feeling nervous, excited, or irritable; 7  nausea, vomiting, stomach ...."}, {"url": "http://www.rxlist.com/restoril-drug/patient-images-side-effects.htm", "passage_text": "What are the possible side effects of temazepam (Restoril)? Temazepam may cause a severe allergic reaction. Stop taking temazepam and get emergency medical help if you have any of these signs of an allergic reaction: hives; difficulty breathing; swelling of your face, lips, tongue, or throat."}, {"url": "http://www.emedicinehealth.com/drug-temazepam/article_em.htm", "passage_text": "Get emergency medical help if you have any of these signs of an allergic reaction: hives; difficulty breathing; swelling of your face, lips, tongue, or throat. Stop using temazepam and call your doctor at once if you have any of these serious side effects: 1  weak or shallow breathing; 2  fast or pounding heartbeats;"}]