[{"url": "http://whatis.techtarget.com/definition/variable", "passage_text": "Part of the Programming glossary: In programming, a variable is a value that can change, depending on conditions or on information passed to the program. Typically, a program consists of instruction s that tell the computer what to do and data that the program uses when it is running. "}, {"url": "http://www.c4learn.com/c-programming/c-variable/", "passage_text": "Variable in C Programming is also called as container to store the data. Variable name may have different data types to identify the type of value stored. "}, {"url": "http://www.cs.utah.edu/~germain/PPS/Topics/variables.html", "passage_text": "Variables in a computer program are analogous to Buckets or Envelopes where information can be maintained and referenced. On the outside of the bucket is a name. When referring to the bucket, we use the name of the bucket, not the data stored in the bucket. The life time of a variable is strongly related to the scope of the variable. When a program begins, variables come to life when the program reaches the line of code where they are declared. Variables die when the program leaves the Scope of the variable."}, {"url": "http://www.webopedia.com/TERM/V/variable.html", "passage_text": "Every variable has a name, called the variable name, and a data type. A variable's data type indicates what sort of value the variable represents, such as whether it is an integer, a floating-point number, or a character. x+y. x and y are variables. Variables can represent numeric values, characters, character strings, or memory addresses. Variables play an important role in computer programming because they enable programmers to write flexible programs."}, {"url": "https://en.wikipedia.org/wiki/Variable_%28programming%29", "passage_text": "In computer programming, a variable or scalar is a storage location paired with an associated symbolic name (an identifier), which contains some known or unknown quantity of information referred to as a value. The scope of a variable is actually a property of the name of the variable, and the extent is a property of the variable itself. These should not be confused with context (also called environment), which is a property of the program, and varies by point in the source code or execution – see scope: overview."}, {"url": "http://www.cs.utah.edu/~germain/PPS/Topics/variables.html", "passage_text": "Variables. A variable is a symbolic name for (or reference to) information. The variable's name represents what information the variable contains. They are called variables because the represented information can change but the operations on the variable remain the same. In general, a program should be written with Symbolic notation, such that a statement is always true symbolically. The life time of a variable is strongly related to the scope of the variable. When a program begins, variables come to life when the program reaches the line of code where they are declared. Variables die when the program leaves the Scope of the variable."}, {"url": "http://www.webopedia.com/TERM/V/variable.html", "passage_text": "A symbol or name that stands for a value. For example, in the expression. x+y. x and y are variables. Variables can represent numeric values, characters, character strings, or memory addresses. Variables play an important role in computer programming because they enable programmers to write flexible programs."}]