[{"url": "http://www.gardeningknowhow.com/edible/vegetables/vgen/vegetable-garden-soil.htm", "passage_text": "Organic material can come from either a compost or well rotted manure, or even a combination of both. Nitrogen, Phosphorus and Potassium – When it comes to soil preparation for vegetable garden, these three nutrients are the basic nutrients that all plants need."}, {"url": "http://www.chicagonow.com/chicago-garden/2010/06/best-potting-soil-for-edible-container-gardens/", "passage_text": "There are a lot of ways you can be frugal in your garden and save some money. The potting mix you use in your container gardens should be something you feel comfortable splurging on. In my opinion, the best potting soil for edible container garden is the Happy Frog line of potting soil distributed by FoxFarm."}, {"url": "http://www.youtube.com/watch?v=MtDBsn0b-Fc", "passage_text": "You'll want to be sure to refresh the soil with compost and manure to replace the nutrients that were taken up by the plants in the prior season. By using 2 parts of your existing soil and adding in 1 part compost and 1 part well rotted manure, you'll have a great start to your edible garden."}, {"url": "http://www.chicagonow.com/chicago-garden/2010/06/best-potting-soil-for-edible-container-gardens/", "passage_text": "A good potting mix should be loose to allow water to drain. Finally, the price. If the bag of soil costs less than you'd pay for a cup of coffee chances are that it isn't going to be very good for your plants. Whenever I see those $2.99 bags of potting soil at drug stores I have to shake my head."}, {"url": "http://www.gardeningknowhow.com/edible/vegetables/vgen/vegetable-garden-soil.htm", "passage_text": "Soil pH for Vegetables. While exact pH requirements for vegetables vary somewhat, in general, the soil in a vegetable garden should fall somewhere be 6 and 7. If your vegetable garden soil tests significantly above that, you will need to lower the pH of the soil."}, {"url": "http://www.washingtonpost.com/pb/recipes/edible-soil/11956/", "passage_text": "Mette Randem for The Washington Post. This can be made with almost any ingredients you want, as long as the result is the same: a mixture of edible items that resembles soil. It is an outlandish, or at least unexpected, thing to have on the table, especially when small vegetable or herb shoots are placed in the mixture."}]