[{"url": "http://thesaurus.factmonster.com/mostly", "passage_text": "1. largely, mostly, for the most part. usage: in large part; mainly or chiefly; These accounts are largely inactive. 2. by and large, generally, more often than not, mostly. usage: usually; as a rule; by and large it doesn't rain much here."}, {"url": "http://www.synonyms.net/synonym/mostly", "passage_text": "PPDB, the paraphrase database (0.00 / 0 votes) Rate these synonyms: List of paraphrases: mainly, primarily, largely, predominantly, essentially, principally, especially, chiefly, particularly, most, often, generally, basically, usually."}, {"url": "http://www.collinsdictionary.com/dictionary/english-thesaurus/mostly", "passage_text": "1 British English: mostly You use mostly to indicate that a statement is true about the majority of a group of things or people, true most of the time, or true in most respects.I work with mostly highly motivated people.ˈməʊstlɪ ADVERB."}, {"url": "http://www.smart-words.org/list-of-synonyms/", "passage_text": "Different words which have the same meaning (or similar meaning) are called synonyms. Words which have an opposite meaning are called antonyms. Words that are synonyms are referred to as being synonymous, and the state of being a synonym is called synonymy."}, {"url": "http://www.macmillandictionary.com/dictionary/british/mostly", "passage_text": "Thesaurus. The thesaurus of synonyms and related words is fully integrated into the dictionary. Click on the thesaurus category heading under the button in an entry to see the synonyms and related words for that meaning."}, {"url": "http://www.smart-words.org/list-of-synonyms/", "passage_text": "Common Synonyms — sorted by Category. These lists also contain examples for the most common 100 words or so; however, the intention is not to replace a thesaurus. Within the categories the sorting is alphabetical."}, {"url": "http://www.collinsdictionary.com/dictionary/english-thesaurus/mostly", "passage_text": "1 = mainly, largely, chiefly, principally, primarily, above all, on the whole, predominantly, for the most part, almost entirely • I am working with mostly highly motivated people. = 2  generally, usually, on the whole, most often, as a rule, customarily • We mostly go to clubs, or round to a friend's house."}, {"url": "http://www.thefreedictionary.com/mostly", "passage_text": "1. mainly, largely, chiefly, principally, primarily, above all, on the whole, predominantly, for the most part, almost entirely I am working with mostly highly motivated people."}]