[{"url": "http://celiac-disease.emedtv.com/celiac-disease/causes-of-celiac-disease.html", "passage_text": "Researchers are still trying to figure out the exact cause or causes of celiac disease. At this point, scientists believe that the disorder is a type of autoimmune disease and that certain genes and environmental factors play a role in a person developing the condition. Celiac disease is believed to be an autoimmune disorder. Celiac disease is a condition that damages the digestive tract (specifically the small intestine), causing problems with absorption of vital vitamins, minerals, and nutrients."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001280/", "passage_text": "Celiac Disease (Gluten Intolerance). The inability to digest and absorb proteins called gluten found in wheat, rye, and barley. Celiac disease causes damage to the lining of the small intestine and prevents absorption of nutrients. Also called celiac sprue, gluten intolerance, and nontropical sprue. PubMed Health Glossary. "}, {"url": "http://www.webmd.com/digestive-disorders/celiac-disease/celiac-disease", "passage_text": "Celiac disease is a digestive disorder that occurs in reaction to gluten, a protein found in rye, barley, wheat, and hundreds of foods made with these grains. The body's immune system reacts to the gluten and causes damage to the intestine. Symptoms of celiac disease vary among sufferers and include: 1  Digestive problems (abdominal bloating, pain, gas, diarrhea, pale stools, and weight loss). 2  A severe skin rash called dermatitis herpetiformis. 3  Iron deficiency anemia (low blood count)."}, {"url": "http://www.nhs.uk/Conditions/Coeliac-disease/Pages/Causes.aspx", "passage_text": "Causes of coeliac disease. Coeliac disease is caused by an abnormal reaction by your immune system to the protein gluten, found in foods such as bread, pasta, cereals and biscuits. Some people with coeliac disease find eating oats can also trigger symptoms. Coeliac disease is an example of an autoimmune condition, when your immune system mistakes healthy cells and substances for harmful ones and produces antibodies against them (antibodies usually fight off bacteria and viruses)."}, {"url": "http://www.webmd.com/digestive-disorders/celiac-disease/celiac-disease", "passage_text": "Celiac disease -- also known as celiac sprue or gluten-sensitive enteropathy -- is a digestive and autoimmune disorder that results in damage to the lining of the small intestine when foods with gluten are eaten. Symptoms of celiac disease vary among sufferers and include: 1  Digestive problems (abdominal bloating, pain, gas, diarrhea, pale stools, and weight loss). 2  A severe skin rash called dermatitis herpetiformis. 3  Iron deficiency anemia (low blood count)."}, {"url": "http://www.webmd.com/digestive-disorders/celiac-disease/celiac-disease-cause", "passage_text": "Celiac Disease-Cause. Although the exact cause of celiac disease isn't known, having certain genes increases your risk. You are more likely to have these genes if you have a first-degree relative (mother, father, brother, sister, son, or daughter) who has celiac disease. Environmental factors, such as infections, may trigger changes in the small intestine of a person with these genes."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_celiac_disease", "passage_text": "Celiac disease (also known as celiac sprue or gluten-sensitive enteropathy) is a digestive and autoimmune disorder. An autoimmune disorder is one in which the immune system directs antibodies to attack the body. The antibody of celiac disease is directed against gluten, a protein found in grains. Symptoms of celiac disease vary among sufferers and include: 1  Digestive problems (abdominal bloating, pain, gas, diarrhea, pale stools, and weight loss). 2  A severe skin rash called dermatitis herpitiformis. 3  Anemia (low blood count). 4  Musculoskeletal problems (muscle cramps, joint and bone pain)"}, {"url": "http://ghr.nlm.nih.gov/condition/celiac-disease", "passage_text": "Celiac disease is a condition in which the immune system is abnormally sensitive to gluten, a protein found in wheat, rye, and barley. Celiac disease is an autoimmune disorder; autoimmune disorders occur when the immune system malfunctions and attacks the body's own tissues and organs. In celiac disease, the villi become shortened and eventually flatten out. Intestinal damage causes diarrhea and poor absorption of nutrients, which may lead to weight loss. Abdominal pain, swelling (distention), and food intolerances are common in celiac disease."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_celiac_disease", "passage_text": "When people with celiac disease eat foods containing gluten, their immune system forms antibodies to gluten, which then attack the intestinal lining. This causes inflammation in the intestines and damages the villi, the hair-like structures on the lining of the small intestine. Symptoms of celiac disease vary among sufferers and include: 1  Digestive problems (abdominal bloating, pain, gas, diarrhea, pale stools, and weight loss). 2  A severe skin rash called dermatitis herpitiformis. 3  Anemia (low blood count). 4  Musculoskeletal problems (muscle cramps, joint and bone pain)"}]