[{"url": "http://www.getridofthings.com/health/infections/get-rid-of-a-stomach-flu/", "passage_text": "Natural & Organic Stomach Flu Remedies. Yogurt is a great way to regain your digestive abilities after a bout with gastroenteritis. Gastroenteritis, or an intestinal infection, can kill a lot of the good bacteria in your intestines, leaving you digestively incapacitated."}, {"url": "http://www.livestrong.com/article/393108-is-yogurt-good-food-to-eat-with-a-stomach-virus/", "passage_text": "Not all yogurt is beneficial, according to CBS News. Many yogurt brands are high in sugar and fat, and while they may provide some good bacteria, the fat and sugar in the yogurt may worsen diarrhea. If you eat yogurt to treat a stomach virus, use low-fat, plain yogurt."}, {"url": "http://www.livestrong.com/article/393108-is-yogurt-good-food-to-eat-with-a-stomach-virus/", "passage_text": "Eating Yogurt. Eating yogurt is a good food if you have the stomach flu. Yogurt can help shorten the length and severity of your symptoms, such as diarrhea and nausea. Yogurt contains probiotics, good bacteria found in your gut that help regulate your digestive system."}, {"url": "http://www.mnn.com/health/fitness-well-being/stories/home-remedies-for-stomach-flu", "passage_text": "You know it when you have it: diarrhea, nausea, vomiting, cramps and sometimes fever. Stomach flu symptoms — which can range from mild to horrific — can last 24-48 hours or as long as 10 miserable days. Antibiotics won't help because the cause of your discomfort is viral."}, {"url": "http://www.cdc.gov/Features/Norovirus/index.html", "passage_text": "You may hear norovirus illness called food poisoning or stomach flu.. Norovirus can cause foodborne illness, as can other germs and chemicals. Norovirus illness is not related to the flu (influenza). Though they may share some of the same symptoms, the flu is a respiratory illness caused by influenza virus."}, {"url": "http://www.livestrong.com/article/393108-is-yogurt-good-food-to-eat-with-a-stomach-virus/", "passage_text": "Because viral intestinal complications cause nausea, vomiting and diarrhea, eating yogurt with other easy-to-digest foods can help ease your symptoms. Before treating a stomach problem with diet modification, talk with your doctor."}, {"url": "http://www.theorganicprepper.ca/stomach-flu-survival-01152013", "passage_text": "Stomach Flu Survival. There are few things more unpleasant than the stomach flu. That crippling nausea, the stomach and intestinal cramps and the frantic rush to the bathroom are sheer misery. Sometimes this type of illness is caused by a virus and at other times it isn’t a virus at all, but food poisoning."}, {"url": "http://truelifeblog.com/2010/08/probiotics-a-virus-remover/", "passage_text": "Probiotics are not just considered as virus removers but can prevent us from being hit with a stomach virus. 1  Tags: dairy, diarrhea, disease, inflammatory bowel disease, irritable bowel syndrome, lactic acid bacteria, stomach virus, Virus, world doctors, yogurt."}]