[{"url": "http://listverse.com/2011/03/30/top-10-most-venomous-snakes/", "passage_text": "Vipers. Vipers are found throughout most of the world, but arguably the most venomous is the Saw Scaled Viper and the Chain Viper, found primarily in the Middle East and Central Asia, particularly India, China and South East Asia. Vipers are quick tempered and generally nocturnal, often active after rains."}, {"url": "http://www.dec.ny.gov/animals/7147.html", "passage_text": "Measuring from 3-4.5 feet (91-137 cm) or more in length, the timber rattlesnake is the largest venomous snake in New York. The record length is 74 ½ inches (189 cm). Timber rattlers impress one as being very stocky; they are large snakes. Despite their size, cryptic coloration allows them to be easily concealed."}, {"url": "http://www.livescience.com/43683-rattlesnake.html", "passage_text": "Rattlesnakes are large, venomous snakes that are found throughout North and South America. The greatest concentration of them is in the Southwestern United States and in Northern Mexico. Arizona is home to 13 species of rattler, more than any other state."}, {"url": "http://listverse.com/2011/03/30/top-10-most-venomous-snakes/", "passage_text": "8. Vipers. Vipers are found throughout most of the world, but arguably the most venomous is the Saw Scaled Viper and the Chain Viper, found primarily in the Middle East and Central Asia, particularly India, China and South East Asia. Vipers are quick tempered and generally nocturnal, often active after rains."}, {"url": "http://tennsnakes.org/timber.htm", "passage_text": "Timber rattlesnakes are the 2nd largest venomous snake found in the eastern United States. Despite their size, they use cryptic coloration and concealment as their primary means of defense. Another distinguishing feature for the species is the rattle. These snakes will typically shed twice a year."}, {"url": "http://wanttoknowit.com/where-do-snakes-live/", "passage_text": "Snakes live in every continent in the world except for Antarctica. So they live in Europe, Asia, Australia, North America, South America and Africa. Strangely, they are not found in New Zealand, Ireland or Iceland. King cobras live in forests."}]