[{"url": "http://www.infoplease.com/ipa/A0005061.html", "passage_text": "Median Age at First Marriage, 1890–2010. The following table shows the median age of men and women when they were first married in the United States from 1890 to 2010. The median age for a man's first marriage was 28.2 years in 2010, up from 26.1 in 1990. The median age for a woman's first marriage was 26.1 years in 2010, up from 23.9 in 1990. "}, {"url": "http://www.huffingtonpost.com/2013/11/14/married-young_n_4227924.html", "passage_text": "The average age for Americans getting married has reached a historic high -- 27 for women and 29 for men -- a jump from the 1990 average marrying age of 23 for women and 26 for men. You'll have more sex. Couples who marry in their 20s tend to have more frequent sex than those who marry later. In a 2011 paper, Dana Rotz of Harvard University wrote that a four year increase in age at marriage is associated with a couple having sex about one time less per month .."}, {"url": "http://www.theatlantic.com/sexes/archive/2013/03/getting-married-later-is-great-for-college-educated-women/274040/", "passage_text": "NBC. Americans are getting married later and later. The average age of first marriage in the United States is 27 for women and 29 for men, up from 23 for women and 26 for men in 1990 and 20 and 22 (!) in 1960. For women who graduated from high school and went to some college, the average age for first birth is 24 and the average marriage age is 27; 58 percent of first births are to unwed mothers."}, {"url": "http://www.theatlantic.com/sexes/archive/2013/03/getting-married-later-is-great-for-college-educated-women/274040/", "passage_text": "College-educated women are unlikely to have a child before getting married For college-educated women, the average age of first birth (30) has risen along with the average age of marriage (27). Only 12 percent of births by college graduates are to unmarried women. For women who graduated from high school and went to some college, the average age for first birth is 24 and the average marriage age is 27; 58 percent of first births are to unwed mothers."}, {"url": "http://www.wisegeek.org/how-has-the-average-age-at-marriage-changed-over-time.htm", "passage_text": "Lowest average age for marriage in men was in 1960, when the mean age for marriage was 22.8 years. There are negligible declines in average age at marriage from 1910-1960 in women. However the difference between the 1910 figures and figures in 1960 are less than two years. Women in 1900 had an average age at marriage of 22 years. For some this shatters an illusion that women 100 years ago were sold into marriage as young children. Even Jane Austen, writing in the early 19th century had heroines married at the earliest age of 17 or 18."}, {"url": "http://www.huffingtonpost.com/2013/11/22/marriage-map_n_4326504.html", "passage_text": "Nordic countries and Western Europe rank among the highest for mean age at marriage at above 30 years. Afghanistan has one of the lowest at 20.2 years.. In the United States, the average marrying age for women is 26.9 and for men it's 29.8, per a 2011 report by the Pew Research Center. However, though people seem to be waiting later to get hitched in many countries around the globe, marriage still seems to be a popular life choice in most places. "}, {"url": "http://www.theatlantic.com/sexes/archive/2013/03/getting-married-later-is-great-for-college-educated-women/274040/", "passage_text": "The average age of first birth for this group is lower than the average marriage age. For women who dropped out of high school, the average age of first birth is 20, while the average marriage age is 25; 83 percent of first births in this demographic are to unmarried mothers. For women who graduated from high school and went to some college, the average age for first birth is 24 and the average marriage age is 27; 58 percent of first births are to unwed mothers."}]