[{"url": "http://www.kompareit.com/homeandgarden/pools-compare-remodeling-cost.html", "passage_text": "1 Minor repairs to decorative stonework or tiles might cost $1,000 or less. 2  Upgrading your filter and pump might cost $500-$1,500. 3  A new liner for a vinyl pool costs about $3,000-$5,000, including installation. Aesthetic improvements are all over the map when it comes to price, depending on what you choose. You could spend $100,000 or more for a complete transformation of the pool and backyard. 1  Minor repairs to decorative stonework or tiles might cost $1,000 or less. 2  Upgrading your filter and pump might cost $500-$1,500"}, {"url": "http://www.homeadvisor.com/cost/swimming-pools-hot-tubs-and-saunas/remodel-a-swimming-pool/", "passage_text": "The main advantage to a pool remodel is to revamp the look of the pool and backyard area without having to replace the existing pool. While this can't be done with all pools, most homeowner want to keep the project as cost effective as possible. Pool remodels can save the homeowner thousands of dollars. If the pool is inground or above ground and has a liner, the cost of the liner as well as any pool additions or features such as a waterfall, table or stairs will have to be added to the final cost estimate."}, {"url": "http://www.kompareit.com/homeandgarden/pools-compare-remodeling-cost.html", "passage_text": "The cost really depends on the extent of the renovations, and to a lesser extent the size of your pool and your location. The best way to get an accurate price is to seek multiple quotes from pool builders in your area. That being said, the average cost is typically somewhere between $4,000 and $15,000. Aesthetic improvements are all over the map when it comes to price, depending on what you choose. You could spend $100,000 or more for a complete transformation of the pool and backyard. 1  Minor repairs to decorative stonework or tiles might cost $1,000 or less. 2  Upgrading your filter and pump might cost $500-$1,5"}, {"url": "http://www.regalpools.net/remodeling.html", "passage_text": "We are told around $10,000.00 to $15,000.00 “Base Cost”. Most of our pool remodels are under $20,000.00 and average about $15,000.00. Add the “Base Cost” to the remodeling cost and you can save as much as $15,000.00 on the purchase of a pre-existing swimming pool. Is it better to remodel? Years later, the price for a pool/spa combination is over forty thousand. We have broken it down for you. Remember this is an average size pool, with a perimeter of approximately 90 feet, with average equipment."}, {"url": "http://www.kompareit.com/homeandgarden/pools-compare-remodeling-cost.html", "passage_text": "1 Upgrading your filter and pump might cost $500-$1,500. 2  A new liner for a vinyl pool costs about $3,000-$5,000, including installation. 3  Basic concrete resurfacing costs $5,000-$10,000, although fancy features such as quartz or tile could push the price much higher. Aesthetic improvements are all over the map when it comes to price, depending on what you choose. You could spend $100,000 or more for a complete transformation of the pool and backyard. 1  Minor repairs to decorative stonework or tiles might cost $1,000 or less. 2  Upgrading your filter and pump might cost $500-$1,500"}, {"url": "http://www.homeadvisor.com/cost/swimming-pools-hot-tubs-and-saunas/remodel-a-swimming-pool/", "passage_text": "Labor Costs. When homeowners are thinking about remodeling their outdoor pool area, one of the first things to consider is how much it is going to cost to hire a contractor or pool professional. When determining labor costs, there are several things to keep in mind. If the pool is inground or above ground and has a liner, the cost of the liner as well as any pool additions or features such as a waterfall, table or stairs will have to be added to the final cost estimate."}, {"url": "http://www.answers.com/Q/How_much_does_it_cost_to_remodel_a_pool", "passage_text": "Confidence votes 114. It really varies in price, based on the size of your pool and what options you are considering. The average price of a pool remodel ranges from $4000-$15,000 You have many options to consider for your pool remodeling project,interior finishes and waterline tile,equipment,lighting,automation,etc. It depends on a lot of different things-the main two being size (length, width and depth) and materials (concrete, vinyl, fiberglass). Prices also vary by region. That said, … the average backyard pool costs somewhere between $25,000 and $50,000 to install via a pool contractor. If you want something big and fancy, it will obviously cost more. If you can do some or all of the work yourself, it could cost significantly less"}, {"url": "http://archive.azcentral.com/home/articles/20130620ways-remodel-pool-backyard-budget-tips.html", "passage_text": "If you’re in the market for a pool remodel, here are popular add-ons and upgrades. The prices are estimates for an average-size pool — roughly 350-450 square feet, or a pool with an 80- to 90-foot perimeter. Prices vary depending on the overall scope of remodeling work being done, but here are ballpark numbers compiled from interviews with Valley pool contractors. Here are some options by budget: 14 ways to remodel your pool and backyard on a budget. By Kara G. Morrison The Republic | azcentral.com Thu Jun 20, 2013 4:31 PM. We’re finally opening our wallets to add some bells and whistles to the backyard pool. Valley pool companies say they’re busy with remodels."}]