[{"url": "http://www.hopkinsmedicine.org/neurology_neurosurgery/centers_clinics/pituitary_center/conditions/diabetes-insipidus.html", "passage_text": "Diabetes insipidus is a condition that results from insufficient production of the antidiuretic hormone (ADH) , a hormone that helps the kidneys and body conserve the correct amount of water. Normally, the antidiuretic hormone controls the kidneys' output of urine."}, {"url": "http://www.webmd.com/diabetes/guide/what-is-diabetes-insipidus", "passage_text": "When your body doesn’t make enough ADH, the condition is called central diabetes insipidus. If you make enough but your kidneys can't respond to it, you have nephrogenic diabetes insipidus. In either form, the result is the same."}, {"url": "https://labtestsonline.org/understanding/analytes/adh/tab/test", "passage_text": "ADH deficiency is often seen with one of two types of diabetes insipidus. Central diabetes insipidus is a decrease in the production of ADH by the hypothalamus or in the release of ADH from the pituitary while nephrogenic diabetes insipidus is characterized by a decrease in the kidney's response to ADH."}, {"url": "http://www.childrenshospital.org/conditions-and-treatments/conditions/diabetes-insipidus", "passage_text": "Diabetes insipidus is a rare disorder of vasopressin (also called the antidiuretic hormone or ADH), a hormone that helps the kidneys regulate the amount of water in the body."}, {"url": "http://www.medicalnewstoday.com/articles/183251.php", "passage_text": "An uncommon condition, diabetes insipidus is a disorder of the regulation of body fluid levels. It has symptoms resembling two of those seen with the more common forms of diabetes involving blood sugar levels (diabetes mellitus types 1 and 2). 1-5."}, {"url": "http://familydoctor.org/familydoctor/en/diseases-conditions/diabetes-insipidus.html", "passage_text": "Despite the name, diabetes insipidus is not related to type 1 or type 2 diabetes (diabetes mellitus). Diabetes insipidus is a hormone disorder that occurs when the body doesn't produce enough antidiuretic hormone (ADH) or doesn't use the hormone effectively. Next: Symptoms."}]