[{"url": "https://en.wikipedia.org/wiki/Alprazolam", "passage_text": "Alprazolam /aelˈpraezəlaem/ ælˈpræzəlæm /or/ , aelˈpreɪzəlaem ælˈpreɪzəlæm available as the Trade /name/ xanax ˈzaenaeks, ˈzænæks among others-is a short acting anxiolytic of. The benzodiazepine class it is commonly used for the treatment, of panic disorder, and anxiety disorders such as (GENERALIZED) anxiety disorder gad or (SOCIAL). anxiety disorder sad It is covered under U.S. Patent 3,987,052, which was filed on 29 October 1969, granted on 19 October 1976, and expired in September 1993. Alprazolam was released in 1981. The first approved indication was panic disorder and within two years of its original marketing Upjohn's Xanax became a blockbuster drug in the US."}, {"url": "https://en.wikipedia.org/wiki/Alprazolam", "passage_text": "Alprazolam /aelˈpraezəlaem/ ælˈpræzəlæm /or/ , aelˈpreɪzəlaem ælˈpreɪzəlæm available as the Trade /name/ xanax ˈzaenaeks, ˈzænæks among others-is a short acting anxiolytic of. the benzodiazepine class It is covered under U.S. Patent 3,987,052, which was filed on 29 October 1969, granted on 19 October 1976, and expired in September 1993. Alprazolam was released in 1981. The first approved indication was panic disorder and within two years of its original marketing Upjohn's Xanax became a blockbuster drug in the US."}, {"url": "http://prescription-drug.addictionblog.org/is-xanax-a-narcotic/", "passage_text": "Probably not. But using Xanax use outside of a prescription is illegal as Xanax is a Schedule IV benzodiazepine under the Controlled Substances Act. Still, Xanax is not a medical narcotic. Furthermore, if you are taking Xanax without a prescription or are using Xanax other than prescribed your risk of Xanax addiction increases. Xanax addiction risk is further increased in people with a history of alcohol or drug abuse."}, {"url": "http://www.deadiversion.usdoj.gov/schedules/", "passage_text": "Section 812 of the Controlled Substances Act (21 U.S.C. §801 et seq.) (CSA) lists substances which were controlled in 1970 when the law was enacted. Since then, approximately 160 substances have been added, removed, or transferred from one schedule to another. Definition of Controlled Substance Schedules. Drugs and other substances that are considered controlled substances under the Controlled Substances Act (CSA) are divided into five schedules. An updated and complete list of the schedules is published annually in Title 21 Code of Federal Regulations (C.F.R.) §§ 1308.11 through 1308.15"}, {"url": "https://en.wikipedia.org/wiki/Alprazolam", "passage_text": "It is commonly used for the treatment of panic disorder, and anxiety disorders, such as generalized anxiety disorder (GAD) or social anxiety disorder (SAD). It was the 12th most prescribed medicine in 2010. Alprazolam, like other benzodiazepines, binds to specific sites on the GABAA receptor. It is covered under U.S. Patent 3,987,052, which was filed on 29 October 1969, granted on 19 October 1976, and expired in September 1993. Alprazolam was released in 1981. The first approved indication was panic disorder and within two years of its original marketing Upjohn's Xanax became a blockbuster drug in the US."}, {"url": "http://www.drugstrategies.org/drugs_crime_96/impact.html", "passage_text": "Prescription drug abuse is a widespread problem, and Xanax addiction is one of the most common addictions to a drug that’s widely prescribed. Used since the 1960s, Xanax is listed on the Controlled Substance Act as a Schedule IV controlled substance. It’s used for anxiety, stress, panic attacks, nervousness and tension springing from any or all of those problems, so it’s widely prescribed in a psychiatric setting. "}, {"url": "http://www.substanceabuseusa.org/addictions/xanax.html", "passage_text": "Xanax is a benzodiazepine, or a Central Nervous System depressant often prescribed to treat anxiety, nervousness, panic attacks, and tension. Xanax can be found in the generic form called, Alprazolam. Xanax (Alprazolam) is a Schedule IV drug as per the Controlled Substance Act (CSA). According to the Drug Enforcement Agency of the United States Department of Justice and CSA, controlled substances are given a five-schedule rating systems for their potential for dependency and abuse. "}, {"url": "http://www.addictionsearch.com/treatment_articles/article/xanax-addiction-and-treatment_4.html", "passage_text": "Xanax is a Central Nervous System (CNA) depressant known as benzodiazepine which is commonly prescribed by physicians to treat panic attacks, nervousness, and tension. Xanax, also known as alprazolam and considered to be a Schedule IV controlled substance under the Controlled Substance Act (CSA). Xanax has been used as a tranquilizer since the 1960s with strong opposition to the use of benzodiazepines in the 1970s. According to the United States Department of Justice Drug Enforcement Agency (DEA) and under the CSA all controlled substances are rated on a five-schedule system. Schedule V, is the lowest for the potential for abuse or dependency and I, is the highest. Xanax is a Schedule IV."}]