[{"url": "http://healthyliving.azcentral.com/causes-visceral-fat-vs-subcutaneous-fat-5985.html", "passage_text": "Subcutaneous Fat. Subcutaneous fat is the kind you can grasp with your hand on any part of your body, including around your middle. While visceral fat is the more dangerous of the two types, subcutaneous fat isn’t benign. The added weight caused by overeating and lack of physical activity can stress your joints and increase your risk of heart disease."}, {"url": "http://healthyliving.azcentral.com/causes-visceral-fat-vs-subcutaneous-fat-5985.html", "passage_text": "Poor diet and lack of exercise can lead to weight gain in the form of visceral fat, which is especially a danger as you age because it increases your health risks. Fat that is located just under your skin is subcutaneous, and fat that is deeply embedded in your abdominal region is visceral. Talk to your doctor to see if your health is at risk because of excess abdominal fat. While visceral fat is the more dangerous of the two types, subcutaneous fat isn’t benign. The added weight caused by overeating and lack of physical activity can stress your joints and increase your risk of heart disease."}, {"url": "https://en.wikipedia.org/wiki/Subcutaneous_tissue", "passage_text": "The subcutaneous tissue (from Latin subcutaneous, meaning beneath the skin), also called the hypodermis, hypoderm (from Greek, meaning beneath the skin), subcutis, or superficial fascia, is the lowermost layer of the integumentary system in vertebrates. Just as the subcutaneous tissue can store fat, it can also provide good storage space for drugs that need to be released gradually because there is limited blood flow.  Skin popping  is a slang term that includes this method of administration, and is usually used in association with recreational drugs."}, {"url": "http://www.drhirani.com/diabetes/difference-visceral-fat-subcutaneous-fat/", "passage_text": "Much of the fat in the stomach area lies directly under the skin. This is called subcutaneous fat and is not necessarily hazardous to your health. The fat that is harmful is the unseen fat around your organs, otherwise known are visceral abdominal fat. You may have visceral fat but yet not be obese."}, {"url": "https://www.sharecare.com/health/healthy-skin/what-is-subcutaneous-fat", "passage_text": "Just below the dermis is the aptly named subcutaneous fat layer, which covers the muscles. It provides shock-absorbent padding for the body and an insulating layer to conserve heat. The fat stored here also serves as an energy source. Subcutaneous fat can be as thin as a fraction of an inch thick in the eyelids to several inches thick in the abdomen and buttock. This layer of fat helps to insulate your body, and is a primary way that our bodies store energy."}, {"url": "http://www.wisegeek.org/what-is-subcutaneous-fat.htm", "passage_text": "You won't believe these 10 facts about people. Subcutaneous fat is the fatty or adipose tissue lying directly under the skin layers. Subcutaneous translates to under the skin.. It contains not only fatty tissues but also blood vessels, which supply the skin with oxygen, and nerves. Subcutaneous fat, on the other hand is the fat we most see lying under the skin. Too much fat can cause the skin to become tight or stretched, and result in dreaded cellulite or a dimpled look of the skin."}, {"url": "https://en.wikipedia.org/wiki/Adipose_tissue", "passage_text": "In humans, adipose tissue is located beneath the skin (subcutaneous fat), around internal organs (visceral fat), in bone marrow (yellow bone marrow), intermuscular (Muscular system) and in the breast tissue. Adipose tissue is found in specific locations, which are referred to as adipose depots. Visceral fat or abdominal fat (also known as organ fat or intra-abdominal fat) is located inside the abdominal cavity, packed between the organs (stomach, liver, intestines, kidneys, etc.). Visceral fat is different from subcutaneous fat underneath the skin, and intramuscular fat interspersed in skeletal muscles."}, {"url": "https://en.wikipedia.org/wiki/Subcutaneous_tissue", "passage_text": "Subcutaneous fat is the layer of subcutaneous tissue that is most widely distributed. It is composed of adipocytes, which are grouped together in lobules separated by connective tissue. Just as the subcutaneous tissue can store fat, it can also provide good storage space for drugs that need to be released gradually because there is limited blood flow.  Skin popping  is a slang term that includes this method of administration, and is usually used in association with recreational drugs."}, {"url": "http://watchfit.com/weight-loss/tips/subcutaneous-fat/", "passage_text": "White fat is stored two different ways, as subcutaneous fat and visceral fat. Of these two types, subcutaneous fat is the most easily identifiable because it is stored directly under the skin. Visceral fat, on the other hand, is stored inside the body around the organs. "}]