[{"url": "http://money.usnews.com/money/personal-finance/articles/2015/05/19/the-real-cost-of-owning-a-swimming-pool", "passage_text": "PK Data reports that the average cost of a residential in-ground swimming pool was $39,084 last year. Don't expect to recoup all of that money when you sell your house in the future, cautions Sabine H. Schoenberg, a home improvement expert and founder of SabinesHome.com. "}, {"url": "http://home.costhelper.com/pool-cleaning.html", "passage_text": "1 Do-it-yourself pool cleaning runs $20-$100 per month for chemicals during the summer after initial purchase of pool tools including a vacuum head and hose from $50, and a maintenance kit with a wall brush, leaf skimmer, test kits and telescopic pole for around $60. We do all pool maintenance ourselves. We've had a green pool that we had to clean back to clear and blue a few times because of storms and power outtages. To include all chlorine, equipment repair and replacement, algaecide, and clarifier $50-$60 a month is what it costs."}, {"url": "http://homeguides.sfgate.com/average-monthly-cost-run-swimming-pool-71174.html", "passage_text": "A cost that can get overlooked is the cost for generally maintaining and fixing a pool. Pools can develop cracks or rips in liners, pumps can break or malfunction, and filters need replacing. In general, a pool can cost about 10 percent of the original installation cost per year, more if you use a pool service company. "}, {"url": "http://www.trulia.com/voices/Home_Buying/What_is_approx_monthly_cost_to_maintain_inground_p-407912", "passage_text": "Lisa Reeves, Agent, Tampa, FL. The cost of maintaining a pool is usually minimal. The time it takes to take care of a pool is more of the issue; especially if it isn't screened and you have a lot of trees. You can get decent service for about $50 a month or self maintain for less. You can maintain the pool yourself for just a few dollars a month in chemicals from Pinch a Penny or any pool supply company. If you want to hire a pool service to come in, it will cost you between $40 to $50 a month for a weekly visit."}, {"url": "http://www.improvenet.com/a/the-hidden-costs-of-buying-maintaining-a-swimming-pool", "passage_text": "You will have to dig a very large hole to place the pool and this can only be done by a swimming pool professional. On average, the cost of installing a new inground swimming pool runs between $14,961 and $21,649. Choosing a pool installed at the ground level won't require excavation (save $$$). In fact, the cost of an above ground pool is typically a third of that price. We want jaw-dropping designs. We want extra pool accessories. Swimming pool slides generally cost around $1,674 for purchase and professional installation. Diving boards, while still providing just as much fun for the kids, are far less at an average of $384."}, {"url": "http://www.answers.com/Q/What_is_the_average_cost_of_maintaining_a_pool", "passage_text": "the average price of an inground pool is between 25,000 and 40,000 the prices are very high but worth it     Many companies advertise that you can have a pool bui … lt starting at $30,000. This will usually be what we call in Las Vegas a play pool. We are in the NY area. The average price of a typical built  in pool is around $30,000. A really cheap one might be built for  $20,000 in some parts of the country, but the pool will lack many  of the features most people expect in a new pool and very few pool  builders will want to build one."}, {"url": "http://www.homeadvisor.com/cost/swimming-pools-hot-tubs-and-saunas/maintain-a-swimming-pool/", "passage_text": "A pool water test kit is an inexpensive way to test the pH of your swimming pool. If you have a pool maintenance pro who is doing regular, routine cleaning and maintenance of your pool, they will certainly be doing this testing for you as part of their services. However, if you want to save money you can do it yourself. You can manage the heating cost for your pool by not heating it year-round. If you only use your pool for entertainment, you are most likely not going to have pool parties in the dead of winter."}, {"url": "http://www.homeadvisor.com/cost/swimming-pools-hot-tubs-and-saunas/maintain-a-swimming-pool/", "passage_text": "$142 - $665. On average, pool maintenance costs $256, with most homeowners spending between $132 and $381. This data is based on actual project costs as reported by HomeAdvisor members. While a swimming pool adds many years of fun and exercise to your home life, it needs to be maintained correctly and consistently. You can manage the heating cost for your pool by not heating it year-round. If you only use your pool for entertainment, you are most likely not going to have pool parties in the dead of winter."}, {"url": "http://www.trulia.com/voices/Home_Buying/What_is_approx_monthly_cost_to_maintain_inground_p-407912", "passage_text": "Pools are fun but it is a lot of work cleaning the pool, chemicals. There is also costs in pool liner that typically can last anywhere from 5 years and some may go up to 12 years. The average is usually around 10 years. It will had to utility costs. You can maintain the pool yourself for just a few dollars a month in chemicals from Pinch a Penny or any pool supply company. If you want to hire a pool service to come in, it will cost you between $40 to $50 a month for a weekly visit."}]