[{"url": "http://www.skwirk.com/p-c_s-1_u-20_t-205_c-687/plants-and-animals-in-a-tropical-rainforest/nsw/hsie/global-environments-rainforests/flora-and-fauna", "passage_text": "Plants. Rainforests have a diverse range of plant and animal life. There are approximately 3000 plant species, from 210 different families in a rainforest. There are very few flowers on the forest floor, because there is so little sunlight at this level. There are several ways that plants under the canopy receive sunlight. One way is by living off the trunks and branches of tree"}, {"url": "http://www.blueplanetbiomes.org/rainforest.htm", "passage_text": "F.A.O. Plants Animals Climate Southeast Asian Rainforests The tropical rain forest is a forest of tall trees in a region of year-round warmth. An average of 50 to 260 inches (125 to 660 cm.) of rain falls yearly. Rain forests belong to the tropical wet climate group. The temperature in a rain forest rarely gets higher than 93 °F (34 °C) or drops below 68 °F (20 °C); average humidity is between 77 and 88%; rainfall is often more than 100 inches a year."}, {"url": "http://kids.nceas.ucsb.edu/biomes/rainforest.html", "passage_text": "LOCATION: There are two types of rainforest biomes: temperate and tropical rainforests. Temperate rainforests are found along coasts in temperate regions. The largest temperate rainforests are on the Pacific coast in North America, stretching from Alaska to Oregon. Other temperate rainforests are found along the coast of Chile, the United Kingdom, Norway, Japan, New Zealand, and S. Australia."}, {"url": "http://kids.nceas.ucsb.edu/biomes/rainforest.html", "passage_text": "PLANTS: One type of plant often found in a rainforest is an epiphyte. Epiphytes are plants that live on the surface of other plants, especially the trunks and branches. They often grow on trees to take advantage of sunlight in the canopy. Temperate rainforests are found along coasts in temperate regions. The largest temperate rainforests are on the Pacific coast in North America, stretching from Alaska to Oregon. Other temperate rainforests are found along the coast of Chile, the United Kingdom, Norway, Japan, New Zealand, and S. Australia."}, {"url": "http://tropicalrainforestmdtessmer.weebly.com/flora-and-fauna.html", "passage_text": "flora and fauna. The tropical rain forest is the most diverse biome on earth. It is full of some of the most interesting plants and animals on this earth from frogs that can kill just from touching them to adorable cats that can walk down trees upside down. The tropical rain forest has many interesting animals. The poison Dart frog is a frog that has poison on its back which probably made from built up poisons from their prey. The poison dart frog, when touched, kills you almost instantly and has enough poison to kill ten grown men."}, {"url": "http://tropicalrainforestlssher.weebly.com/flora.html", "passage_text": "Flora. The main kinds of flora in a tropical rain forest are vines, palm trees, orchids and many ferns. Three specific types of flora are coconut trees, strangler figs and mangrove forests. The soil is filled with nutrients and it is easy for plants to grow because of the constant amount of water. "}, {"url": "http://www.rainforestfauna.com/", "passage_text": "The animals and plants that live in each tropical rainforest evolved so that they are well adapted to living in their environment. However, the flora and fauna of each rainforest evolved differently and so you'll find different animal species living in each of the different rainforest locations of the world. "}, {"url": "http://www.blueplanetbiomes.org/rainforest.htm", "passage_text": "**** Rainforests by Michael G. 2001 In an average year the climate in a tropical rain forest is very humid because of all the rainfall. A tropical rainforest gets about 150 cm of rain per year. It gets lots of rain because it is very hot and wet in rain forests. The hotter the air, the more water vapor it can hold. An average of 50 to 260 inches (125 to 660 cm.) of rain falls yearly. Rain forests belong to the tropical wet climate group. The temperature in a rain forest rarely gets higher than 93 °F (34 °C) or drops below 68 °F (20 °C); average humidity is between 77 and 88%; rainfall is often more than 100 inches a year."}, {"url": "http://www.bioexpedition.com/tropical-rainforest-biome/", "passage_text": "There are thousands of types of flowering plants found in the tropical rainforest biome. What is interesting about them is that the roots aren’t in the soil. Instead, they are in the water that comes from the rainfall. These air plants are very important as thousands of types of insects in this biome feed on them. Both vines and ferns grow all over the tropical rainforest biome. They help to connect the various layers found in the biome. For example there are herbs and mushrooms that grow on the floor. Various types of fruits and nuts grow on the plants and in the trees. Bananas grow on the vines in this particular biome as well."}]