[{"url": "http://study.com/electrician_training.html", "passage_text": "Electrician Training Requirements and Recommendations. Aspiring electricians can complete a 4-year apprenticeship program that incorporates didactic instruction with paid on-the-job training. They can also complete an associate's degree program at a vocational school or community college. Those hoping to work as supervisors, managers or product developers in the industry should consider pursuing an associate's degree. The curriculum for all electrician training programs is guided by the National Electric Code (NEC) and OSHA safety requirements."}, {"url": "http://study.com/articles/Electrician_Educational_Requirements_and_Career_Profile.html", "passage_text": "Candidates who hold a high school diploma or the equivalent might apply to become apprentices through various unions, such as the International Brotherhood of Electrical Workers or the National Electrical Contractors Association. Electrician: Educational Requirements and Career Profile. Electricians require some formal education. Learn more about the education requirements, licensing requirements and job duties to find out if this is the right career for you. View 10 Popular Schools »."}, {"url": "http://study.com/electrician_training.html", "passage_text": "Electrician apprentices or students must complete 2,000 hours of on-the-job training each year, for a total of 8,000 hours. Skills learned include the design, fabrication and installation of conduits, wiring, switches and outlets. An electrician must also be able to draw a diagram for a comprehensive electrical system. Those hoping to work as supervisors, managers or product developers in the industry should consider pursuing an associate's degree. The curriculum for all electrician training programs is guided by the National Electric Code (NEC) and OSHA safety requirements."}, {"url": "http://learn.org/articles/Electrician_How_to_Become_an_Electrician_in_5_Steps.html", "passage_text": "How to Become an Electrician in 5 Steps. Research what it takes to become an electrician. Learn about education requirements, job duties, average salary and job outlook to find out if this is the career for you. Schools offering Electrician degrees can also be found in these popular choices. "}, {"url": "http://www.explorethetrades.org/electrical/how-to-become-an-electrician/", "passage_text": "How to Become an Electrician. If you want to become an electrician, here are the steps to take. 1  Get your high school diploma or GED. 2  An electrician needs a foundation in math (i.e., one year of algebra), science (i.e., physics) and practical courses (i.e., electronics). 3  Get formal training. If you want to become an electrician, here are the steps to take. 1  Get your high school diploma or GED. 2  Get formal training. 3  Get working. 4  Get licensed."}, {"url": "http://www.become-an-electrician.com/", "passage_text": "Become an electrician with the help of the electrician's union. Know the requirements, how & where to apply and many more! The union apprenticeship program is a combined effort between the International Brotherhood of Electrical Workers (IBEW) and the National Joint Apprenticeship and Training Committee (N.J.A.T.C). Learning how to become an electrician is a two part process. One part is hands-on learning while the other is book learning. It is possible to complete the book learning portion through an online electrician program."}, {"url": "http://study.com/articles/Electrician_Educational_Requirements_and_Career_Profile.html", "passage_text": "Educational Requirements. Electricians usually gain career training through an apprenticeship program. Some electricians begin the training process by attending a classroom-based vocational program or serving as an electrician's helper; however, these electricians often go on to complete apprenticeships. Electrician: Educational Requirements and Career Profile. Electricians require some formal education. Learn more about the education requirements, licensing requirements and job duties to find out if this is the right career for you. View 10 Popular Schools »."}, {"url": "http://www.wikihow.com/Become-a-Licensed-Electrician", "passage_text": "3. Enter an electrician apprentice program. Most states require at least two years, and in most cases up to four years, of apprenticeship with a master or licensed electrician before one can take the examination to become a licensed electrician. During an apprenticeship, one earns the title of journeyman electrician. 1 Some electrician programs include an apprenticeship program. 2  You will have to complete an apprenticeship program in order to get certified, so a combined coursework/apprenticeship program might be a convenient option."}, {"url": "http://www.bls.gov/ooh/construction-and-extraction/electricians.htm", "passage_text": "Training. Most electricians learn their trade in a 4- or 5-year apprenticeship program. For each year of the program, apprentices must complete at least 144 hours of technical training and 2,000 hours of paid on-the-job training. "}, {"url": "http://study.com/articles/Electrician_Educational_Requirements_and_Career_Profile.html", "passage_text": "Electricians require some formal education. Learn more about the education requirements, licensing requirements and job duties to find out if this is the right career for you. Electrician: Educational Requirements and Career Profile. Electricians require some formal education. Learn more about the education requirements, licensing requirements and job duties to find out if this is the right career for you. View 10 Popular Schools »."}]