[{"url": "http://www.histology.leeds.ac.uk/female/oviduct.php", "passage_text": "Oviduct. The oviduct is also known as the fallopian or uterine tube. It is the passageway through which the ovum passes from the ovary to the uterine cavity. The oviducts are part of the genital tract. They have a wall of smooth muscle, an inner mucosal lining and an outer layer of loose supporting tissue (serosa)"}, {"url": "http://www.bbc.co.uk/education/clips/zywc87h", "passage_text": "Description. In this clip the structure and function of a ciliated epithelial cell is described. Cilia are tiny hair like structures on the surface of the cell. The hairs sweep hair, mucus, trapped dust and bacteria up to the back of the throat where it can be swallowed. "}, {"url": "http://www.answers.com/Q/What_is_the_function_of_ciliated_cells_in_the_oviduct", "passage_text": "The ciliated cells has tiny hairs on it, called cilia, which sweep mucus, which is produced by goblet cells, up the airway. The mucus traps dirt particles and stop them from e … ntering the lungs and causing infection. Making the world better, one answer at a time. Ciliated cells in the oviduct push the eggs toward the uterus. They are very important during sexual reproduction of humans."}, {"url": "http://www.dartmouth.edu/~anatomy/Histo/lab_1/epithelium/DMS029/popup.html", "passage_text": "The lumen of the trachea is lined by pseudostratified columnar epithelium. Note that all the surface cells have cilia at their free (apical) surface. (What function do these cilia serve in the trachea?) Mucus-secreting unicellular gland cells (goblet cells) are interspersed among the ciliated cells."}, {"url": "http://www.siumed.edu/~dking2/erg/oviduct.htm", "passage_text": "The mucosal lining is simple columnar epithelium, consisting of two cell types -- ciliated cells and secretory cells. Cilia, rather than muscular contraction, provide the principal motive power to move an egg toward the uterus. "}, {"url": "https://en.wikipedia.org/wiki/Simple_columnar_epithelium", "passage_text": "Ciliated columnar epithelium moves mucus and other substances via cilia and is found in the upper respiratory tract, the Fallopian tubes, the uterus, and the central part of the spinal cord .They are the primary target of infection for common cold viruses such as coronaviruses, influenza virus and rhinoviruses. A simple columnar epithelium is a columnar epithelium that is uni-layered. In humans, a simple columnar epithelium lines most organs of the digestive tract including the stomach, small intestine, and large intestine. Simple ciliated columnar epithelia line the uteru"}, {"url": "http://www.answers.com/Q/What_is_the_function_of_the_ciliated_cells_in_the_lining_of_the_oviduct", "passage_text": "The ciliated cells has tiny hairs on it, called cilia, which sweep mucus, which is produced by goblet cells, up the airway. The mucus traps dirt particles and stop them from e … ntering the lungs and causing infection. 1 Common Causes for a Thick Uterus Lining As part of the reproductive cycle in a woman of childbearing years, the uterine lining thickens each month in anticipation of a potential pregnancy. 2  When a pregnancy does not…."}]