[{"url": "http://learn.org/articles/What_is_the_Average_Salary_of_Someone_with_a_MCSE_Certification.html", "passage_text": "PayScale.com reported network support technicians in the 10th-90th percentile with MCSE certification earned $32,026-$78,350 as of December 2013. The BLS reported that network and computer systems administrators earned an average salary of $76,320 as of May 2012."}, {"url": "http://resources.infosecinstitute.com/mcsa-salary/", "passage_text": "The salary of candidates varies according to job role and experience. A candidate with less than a 1 year experience will get around $50,649 and this it will increase to $75,850 with 10 years of experience or even more."}, {"url": "http://www.cwjobs.co.uk/salary-checker/average-mcse-salary", "passage_text": "Salary results for MCSE. Here you can see the average salary for the keyword you entered, based on our most recent job adverts. Clicking on the 'Top salaries' tab will provide you with a breakdown of salaries based on industry and location."}, {"url": "http://learn.org/articles/What_is_the_Average_Salary_of_Someone_with_a_MCSE_Certification.html", "passage_text": "While your earnings may vary depending on your experience and job title, average salaries for some of the positions available to IT professionals with MCSE certification are profiled below. Please note that all require some form of postsecondary training, usually in the form of a bachelor's degree."}, {"url": "http://resources.infosecinstitute.com/average-mcse-salary/", "passage_text": "The average salary of an individual certified in MCSE is between $44,429 and $110, 757, depending on the designation within the organization. Average salaries in MCSE vary greatly owing to the location, experience in the field, the current market and the benefits the company is currently offering."}, {"url": "http://salaryinfohq.com/mcse/the-salary-of-an-mcse/", "passage_text": "Now I’ll break it down for you. Overall, the average MCSE salary is around $77,000. Now this is higher than the national average wages. However, there are a lot of factors that will affect the average MCSE salary."}, {"url": "http://www.naceweb.org/salary-resources/starting-salaries.aspx", "passage_text": "Salary Survey: Top-Paying Industries With an average starting salary that topped $85,000, mining, quarrying, and oil and gas extraction was far and away the top-paying industry for Class of 2013 graduates who earned bachelor’s degrees, according to NACE’s September 2013 Salary Survey."}, {"url": "http://salaryinfohq.com/mcse/the-salary-of-an-mcse/", "passage_text": "An information technology manager can earn an MCSE salary near the overall average of $77,000. On the other hand, a systems engineer would earn an MCSE salary closer to $64,000."}]