[{"url": "http://www.carecredit.com/vetmed/avgcost/", "passage_text": "The cost of dental care for dogs can reach $200 per visit, vision care procedures such as canine cataract treatments cost $1,244, and some life-saving surgeries cost $15,000. Treating skin problems such as feline fibrosarcoma has an average cost of $780."}, {"url": "http://www.thisismoney.co.uk/money/bills/article-2042014/How-does-cost-dog-cat.html", "passage_text": "When you take into account inflation and rising costs, if you bought a new puppy today, Sainsbury’s estimate the annual cost could easily rise by about 20 per cent to £1,418 during its life expectancy, which is on average 13 years. This would take the cost of owning a dog to nearly £18,500 in its lifetime."}, {"url": "http://www.peteducation.com/article.cfm?c=2+2106&aid=1543", "passage_text": "Many people balk at paying $500 to $1000 for a dog. They rationalize that they simply can not afford it and settle for a poorly bred $150 puppy instead. What a huge mistake. The cost of a guaranteed healthy, well-bred $1000 puppy is a fraction of what it will cost to own that dog for 12 years. A poorly bred dog with bad hips, allergies, and a not so bright disposition will end up costing you thousands more in medical bills not to mention hours of frustration and disappointment."}, {"url": "http://www.thisismoney.co.uk/money/bills/article-2042014/How-does-cost-dog-cat.html", "passage_text": "The average annual cost of owning a cat is slightly lower at £1,028, but this could increase to annual cost of £1,270 in 15 years’ time – the average life expectancy of a pet cat in the UK."}, {"url": "http://www.thisismoney.co.uk/money/bills/article-2042014/How-does-cost-dog-cat.html", "passage_text": "And it's set to get even more expensive. Cost of a pet: Cats and dogs will cost their owner £17k in their lifetime. The average annual cost of owning a dog is currently £1,183. However, pet inflation will bump this up over its lifetime."}, {"url": "https://www.rspcansw.org.au/learn/owning-a-pet/costs", "passage_text": "Costs of owning a dog. Dogs can live for up to 15 years, so on top of the initial costs for the first year, you may be looking at an additional $910 per year minimum for the duration of the dog's life. The final figure may be more or less, depending on the dog, breed, age, size and any illness or accidents, etc."}, {"url": "http://www.confused.com/pet-insurance/articles/average-vet-bill-costs-300", "passage_text": "Between 2007 and 2012 the average claim paid rose by 52 per cent – or £207 - much more than the £57 rise on average in pet insurance premiums. While the average UK vet bill is now around £300, some more complex treatments for conditions can cost more than £4,000."}]