[{"url": "http://buddhism.about.com/od/chanandzenbuddhism/a/zen101.htm", "passage_text": "In China it is called Ch'an Buddhism. Ch'an is the Chinese rendering of the Sanskrit word dhyana, which refers to a mind absorbed in meditation. Zen is the Japanese rendering of Ch'an. Zen is called Thien in Vietnam and Seon in Korea. In any language, the name could be translated Meditation Buddhism.. Here I want to provide a bare-bones introduction to Zen."}, {"url": "http://www.thefreedictionary.com/Zen", "passage_text": "The Japanese word zen is a borrowing of a medieval Chinese word (now pronounced chan, chán in Modern Mandarin) chinese meaning, meditation.. Contemplation chan chán is one of The many buddhist Terms in chinese that Originate, in india the Homeland. of buddhism n. 1. A school of Mahayana Buddhism that asserts that enlightenment can be attained through meditation, self-contemplation, and intuition rather than through faith and devotion and that is practiced mainly in China, Japan, Korea, and Vietnam. Also called Zen Buddhism."}, {"url": "https://en.wikipedia.org/wiki/Zen", "passage_text": "Zen (Chinese: 禪; pinyin: Chan, Chán Middle: chinese) dʑjen is a school Of Mahayana buddhism that originated In china during The tang dynasty As. chan chán Contrary to the popular image, literature does play a role in the Zen-training. Zen is deeply rooted in the teachings and doctrines of Mahāyāna Buddhism. Unsui, Zen-monks, are expected to become familiar with the classics of the Zen canon."}, {"url": "http://www.bbc.co.uk/religion/religions/buddhism/subdivisions/zen_1.shtml", "passage_text": "Zen Buddhism. Zen Buddhism is a mixture of Indian Mahayana Buddhism and Taoism. It began in China, spread to Korea and Japan, and became very popular in the West from the mid 20th century. The essence of Zen is attempting to understand the meaning of life directly, without being misled by logical thought or language. 1 Zen is not a philosophy or a religion. 2  Zen tries to free the mind from the slavery of words and the constriction of logic. 3  Zen in its essence is the art of seeing into the nature of one's own being, and it points the way from bondage to freedom. 4  Zen is meditation"}, {"url": "http://buddhism.about.com/od/chanandzenbuddhism/a/zen101.htm", "passage_text": "Zen began to emerge as a distinctive school of Mahayana Buddhism when the Indian sage Bodhidharma (ca. 470-543) taught at the Shaolin Monastery of China. (Yes, it's a real place, and yes, there is a historic connection between kung fu and Zen.) To this day Bodhidharma is called the First Patriarch of Zen. Zen is the Japanese rendering of Ch'an. Zen is called Thien in Vietnam and Seon in Korea. In any language, the name could be translated Meditation Buddhism.. Here I want to provide a bare-bones introduction to Zen."}, {"url": "http://www.taoism.net/articles/what_zen.htm", "passage_text": "by Derek Lin. Zen is the Japanese pronunciation of the Chinese character chan, which is in turn the Chinese translation from the Indian Sanskrit term dhyana, which means meditation. Zen, like Tao, cannot be totally explained in words. Much of your grasp of Zen must necessarily depend on your own intuition. Given thats the case, the closest we can come to describing Zen in words may be as follows: 1  Zen is more of an attitude than a belief. 2  Zen is the peace that comes from being one with an entity other than yourself. 3  Zen means being aware of your oneness with the world and everything in it. 4  Zen means living in the present and experiencing reality ..."}, {"url": "http://www2.bc.cc.ca.us/resperic/what_is_the_meaning_of_zen.htm", "passage_text": "Very Zen. The word Zen is the Japanese attempt at pronouncing the Chinese word Chan, which in turn is the Chinese attempt at pronouncing the Sanskrit word Dhyana, which translates as meditation. And indeed, the word Zen conjures up an image of motionless Buddhist monks lost in deep meditation. "}, {"url": "https://en.wikipedia.org/wiki/Zen", "passage_text": "Zen emphasizes rigorous meditation-practice, insight into Buddha-nature, and the personal expression of this insight in daily life, especially for the benefit of others. Contrary to the popular image, literature does play a role in the Zen-training. Zen is deeply rooted in the teachings and doctrines of Mahāyāna Buddhism. Unsui, Zen-monks, are expected to become familiar with the classics of the Zen canon."}]