[{"url": "http://nursejournal.org/registered-nursing/rn-careers-salary-outlook/", "passage_text": "Average Registered Nursing salaries for job postings in Florida are 7% lower than average Registered Nursing salaries for job postings nationwide. The average salary ranks 30th among states in the country. Average Registered Nursing salaries for job postings in Colorado are 11% lower than average Registered Nursing salaries for job postings nationwide. The average salary ranks 35"}, {"url": "http://learn.org/articles/What_is_the_Average_Salary_for_a_Nursing_Graduate_with_a_BSN.html", "passage_text": "A BSN may open up higher-paying advancement and specialization opportunities. According to PayScale.com, most entry-level RNs earned salaries ranging from $39,930-$69,985 in February 2014, with a median wage of $50,152. On the other hand, the median salary for an RN possessing a BSN degree was higher at $57,759. As with most jobs in health care, the salaries for RNs increase with additional experience. As ofFebruary 2014, RNs at the mid-career level earned between $44,622 and $80,975, according to PayScale.com. Salary by Years of Experience"}, {"url": "http://www.indeed.com/salary/q-Bsn-l-Florida.html", "passage_text": "Average Bsn salaries for job postings in Florida are 7% lower than average Bsn salaries for job postings nationwide. "}, {"url": "http://www.healthcare-salaries.com/nursing/bsn-nurse-salary", "passage_text": "Average BSN nurse salary. In the United States, a BSN Nurse receives an average salary from between $52,397- $72,458 per annum. The average national hourly rate for BSN nurse is from $22.85 to $32.91. The median yearly rate for BSN Nurses is $620.427. Conclusion about BSN nurse salary. As noted by payscale, the average pay per annum of BSN Nurse in the United States is from $50,733 to $77,034 with the median average of around $62,427."}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/bsn-salary", "passage_text": "BSN salary in USA. An average starting hourly wage for a BSN the United States is around $22.93 per hour which gradually increases by around $33.55 per hour overtime. An average annual salary for a BSN ranges from between $49,851 – $130,200 per annum and a yearly bonus of around $507 will be included. BSN salary in India. On an average, a BSN in India receives an average starting yearly salary of around INR 120,000, while a highest received annual salary is around INR 400,000 per year. In addition, a yearly bonus of about INR 1,500 will be credited to his or her account."}, {"url": "http://www.bsnsalary.net/bsn-salary-in-florida/", "passage_text": "A person holding a Bachelor of Science in Nursing (BSN) degree can choose to work in many different job categories. When working as a Registered Nurse (RN) in the state of Florida will earn you a median salary of approximately $ 55,227 per annum. As you can see the BSN Salary in Florida also varies with the job title which affects the hourly rates which one gets. Bonuses. The bonuses one gets can also have an impact on the salary one gets at the end of the day."}, {"url": "http://www.indeed.com/salary/q-RN-Clinic-Bsn-l-Florida.html", "passage_text": "Average RN Clinic Bsn salaries for job postings in Florida are 7% lower than average RN Clinic Bsn salaries for job postings nationwide. "}, {"url": "http://www.bsnsalary.net/bsn-salary-in-florida/", "passage_text": "BSN Salary In Florida. BSN Salary in Florida details here. Find Florida nursing salary information by job and company. Data on hourly rates, bonuses and commission information here. As you can see the BSN Salary in Florida also varies with the job title which affects the hourly rates which one gets. Bonuses. The bonuses one gets can also have an impact on the salary one gets at the end of the day."}, {"url": "http://www.healthcare-salaries.com/nursing/bsn-nurse-salary", "passage_text": "A BSN Nurse with less than 1-4 years of experience collects an average yearly pay of $60,496 while a BSN Nurse practicing for 5 to 9 years receives an average salary of $63,006 per year. Conclusion about BSN nurse salary. As noted by payscale, the average pay per annum of BSN Nurse in the United States is from $50,733 to $77,034 with the median average of around $62,427."}, {"url": "http://www.bsnsalary.net/bsn-salary-in-florida/", "passage_text": "Depending on the job you are working in the BSN Salary in Florida will also vary. If you are a Registered Nurse (RN), Clinical Nurse Manager, Assistant Director of Nursing (ADON), or a Registered Nurse (RN), Emergency Room, then you do not get any commissions as your job title does not involve selling anything. As you can see the BSN Salary in Florida also varies with the job title which affects the hourly rates which one gets. Bonuses. The bonuses one gets can also have an impact on the salary one gets at the end of the day."}]