[{"url": "https://en.wikipedia.org/wiki/Deformation_(mechanics)", "passage_text": "It is defined as the ratio between the final length ℓ and the initial length L of the material line. The extension ratio is approximately related to the engineering strain by. This equation implies that the normal strain is zero, so that there is no deformation when the stretch is equal to unity. Deformation implies the change in shape and/or size of the body from an initial or undeformed configuration to a current or deformed configuration (Figure 1). If after a displacement of the continuum there is a relative displacement between particles, a deformation has occurred."}, {"url": "https://en.wikipedia.org/wiki/Hyperelastic_material", "passage_text": "The isochoric deformation gradient is defined as, resulting in the isochoric deformation gradient having a determinant of 1, in other words it is volume stretch free. Using this one can subsequently define the isochoric left Cauchy–Green deformation tensor tensor. For isotropic hyperelastic materials, the Cauchy stress can be expressed in terms of the invariants of the left Cauchy–Green deformation tensor (or right Cauchy–Green deformation tensor)."}, {"url": "http://hpc.mtech.edu/comsol/html/nsm/nsm_ug_theory.3.09.html", "passage_text": "The invariants of the isochoric (modified) elastic Green-Lagrange strain tensor are related to the invariants of the isochoric-elastic right Cauchy-Green deformation tensor. It turns out to be convenient for some classes of hyperelastic materials to split the strain energy density into volumetric (also called dilatational) and isochoric (also called distortional or volume-preserving) contributions."}, {"url": "https://en.wikipedia.org/wiki/Deformation_(mechanics)", "passage_text": "Deformation in continuum mechanics is the transformation of a body from a reference configuration to a current configuration. A configuration is a set containing the positions of all particles of the body. Deformation implies the change in shape and/or size of the body from an initial or undeformed configuration to a current or deformed configuration (Figure 1). If after a displacement of the continuum there is a relative displacement between particles, a deformation has occurred."}, {"url": "http://hpc.mtech.edu/comsol/html/nsm/nsm_ug_theory.3.11.html", "passage_text": "In the special case of φ = 1, the strain energy reduces to a similar form of the Neo-Hookean model. Gao. Gao proposed (Ref. 16) a simple hyperelastic material where the strain energy density is defined by two parameters, a and n, and two invariants of the elastic right Cauchy-Green deformation tensors C el : The Ogden model is empirical, in the sense that it does not relate the material parameters α p and μ p to physical phenomena. The parameters α p and μ p are obtained by curve-fitting measured data, which can be difficult for N."}, {"url": "http://hpc.mtech.edu/comsol/html/nsm/nsm_ug_theory.3.09.html", "passage_text": "with F evol as the volumetric elastic deformation (a diagonal tensor) and the isochoric elastic deformation gradient. Isochoric deformation means that the volume ratio is kept constant during deformation, so the isochoric elastic deformation is computed by scaling it by the elastic volume ratio. The elastic volume ratio is defined by. It turns out to be convenient for some classes of hyperelastic materials to split the strain energy density into volumetric (also called dilatational) and isochoric (also called distortional or volume-preserving) contributions."}, {"url": "https://en.wikipedia.org/wiki/Hyperelastic_material", "passage_text": "The simplest hyperelastic material model is the Saint Venant–Kirchhoff model which is just an extension of the linear elastic material model to the nonlinear regime. This model has the form. where is the second Piola–Kirchhoff stress and is the Lagrangian Green strain, and and are the Lame lamé. constants For isotropic hyperelastic materials, the Cauchy stress can be expressed in terms of the invariants of the left Cauchy–Green deformation tensor (or right Cauchy–Green deformation tensor)."}, {"url": "https://en.wikipedia.org/wiki/Hyperelastic_material", "passage_text": "The most common example of this kind of material is rubber, whose stress-strain relationship can be defined as non-linearly elastic, isotropic, incompressible and generally independent of strain rate. Hyperelasticity provides a means of modeling the stress-strain behavior of such materials. For isotropic hyperelastic materials, the Cauchy stress can be expressed in terms of the invariants of the left Cauchy–Green deformation tensor (or right Cauchy–Green deformation tensor)."}, {"url": "https://en.wikipedia.org/wiki/Deformation_(mechanics)", "passage_text": "A simple shear deformation is defined as an isochoric plane deformation in which there is a set of line elements with a given reference orientation that do not change length and orientation during the deformation. If is the fixed reference orientation in which line elements do not deform during the deformation then and. Deformation implies the change in shape and/or size of the body from an initial or undeformed configuration to a current or deformed configuration (Figure 1). If after a displacement of the continuum there is a relative displacement between particles, a deformation has occurred."}]