[{"url": "http://theworldthroughthebaritoneseyes.weebly.com/how-its-made.html", "passage_text": "How the Baritone is made. This Labelled Baritone presents to you the basic components the Baritone consists of. The baritone was first invented as a wooden instrument with a brass style mouthpiece and holes where your fingers are placed, which are now called valves."}, {"url": "https://en.wikipedia.org/wiki/Sousaphone", "passage_text": "The first sousaphone was built by James Welsh Pepper in 1893 at the request of John Philip Sousa, who was dissatisfied with the helicons hélicons in use by The United States Marine. band In large marching bands of the United States, the bell is often covered with a tight fitting cloth, called a sock, which enables the sousaphone section to spell out the school's name, initials, or mascot."}, {"url": "http://beginband.com/tuba.shtml", "passage_text": "Its called the sousaphone. The sousaphone is known as a marching tuba. It coils around the player with the bell pointing forward. Sousaphones are either made of brass or a white plastic. The difference between sousaphones and tubas is very small."}, {"url": "http://www.madehow.com/Volume-5/Tuba.html", "passage_text": "Piece making. 1  1 The main body, valves, bell, and mouthpiece are produced separately during manufacture. 2  In some cases, these different parts may be made by various contractors who ship them to the tuba manufacturer for assembly. 3  The main body is made by first putting a tube of brass on a pole-shaped mandrel. In 1835, the first bass tuba was patented by Johann Gottfried Moritz (an instrument maker) and Wilheim Wieprecht (a bandmaster) It was completely distinct from the keyed ophicleide in that it was equipped with a new type of short piston valve called the Berliner-Pumpe."}, {"url": "http://www.wikihow.com/Play-a-Tuba", "passage_text": "As tuba is a large brass, try blowing a raspberry into the mouthpiece. That's the kind of vibration you are looking at. Once you've got your buzz figured out, start your note by saying either ta or da into the mouthpiece, depending on how you want to articulate the note. "}, {"url": "http://www.madehow.com/Volume-5/Tuba.html", "passage_text": "A tuba is a brass instrument characterized by its large size and deep sound. It consists of vertically coiled tubing, three or four valves, a wide conical bore, flared bell, and a cup-shaped mouthpiece. The different segments of the tuba are shaped and bent from machinable brass using standard techniques. In 1835, the first bass tuba was patented by Johann Gottfried Moritz (an instrument maker) and Wilheim Wieprecht (a bandmaster) It was completely distinct from the keyed ophicleide in that it was equipped with a new type of short piston valve called the Berliner-Pumpe."}, {"url": "http://www.ducksters.com/musicforkids/brass_instruments.php", "passage_text": "A major family of instruments is the brass instrument family. It includes the trumpet, tuba, trombone, French horn, bugle, and cornet, just to name a few. Most brass instruments are made out of, you guessed it brass! The main difference between brass instruments and other instruments is how the vibration to create the sound and notes is made. With a brass instrument the vibration is created by the lips of the musician. By pressing the lips up against the mouthpiece and blowing, a vibration is created."}, {"url": "http://www.blackdiamondbrass.com/tbahist/tubahist.htm", "passage_text": "The Sousaphone, alleged to have been first made by C. G. Conn in 1898, was actually first manufactured by J. W. Pepper in 1893, where it was displayed at the industrial exhibit in Philadelphia that same year. http://www.jwpepper.com/history/sousa.html. http://members.aol.com/ncpmb/sousaphone.htm. The tuba is an instrument for which there was a demand long before its creation. Various inventors sought to fill the desire of composers, bandmasters and orchestra conductors for an instrument that could supply the bottom end, especially in the days when orchestras were growing exponentially in size."}, {"url": "https://en.wikipedia.org/wiki/Sousaphone", "passage_text": "The first sousaphone was built by James Welsh Pepper in 1893 at the request of John Philip Sousa, who was dissatisfied with the helicons hélicons in use by The United States Marine. Band some sources Credit.C. G conn with its, construction because of the first sousaphone he built later in. 1898 In large marching bands of the United States, the bell is often covered with a tight fitting cloth, called a sock, which enables the sousaphone section to spell out the school's name, initials, or mascot."}, {"url": "http://www.lutherhigh.org/documents/arts/les_band/instrument_info/tuba_info.pdf", "passage_text": "Tuba Links http://www.iteaonline.org/ http://www.tubanews.com/ How the sound is made Sound on a brass instrument comes from a vibrating column of air inside the instrument. The player makes this column of air vibrate by buzzing the lips while blowing air through a cup or funnel shaped mouthpiece. The tuba is used a lot in marches and other compositions where it is important to have a strong beat. Made of about 16 feet of tubing, the tuba is the largest and lowest sounding member of the brass family. The tuba uses valves and its cup shaped mouthpiece to change pitches."}]