[{"url": "http://www.innerbody.com/image/endo04.html", "passage_text": "The thyroid gland is a butterfly-shaped organ made of mostly glandular tissue and located in the base of the neck.... Click to read more below. The thyroid gland and parathyroid glands are a group of endocrine glands located in the base of the neck. These glands play a vital role in maintaining the body’s homeostasis by producing hormones that regulate the body’s metabolism and free calcium levels. "}, {"url": "http://www.medicinenet.com/image-collection/thyroid_picture/picture.htm", "passage_text": "The thyroid is a butterfly-shaped gland located in the front of the neck just below the Adams apple. The gland wraps around the windpipe (trachea) and has a shape that is similar to a butterfly formed by two wings (lobes) and attached by a middle part (isthmus). "}, {"url": "http://www.healthline.com/human-body-maps/thyroid-gland", "passage_text": "The thyroid gland covers the windpipe from three sides. Two hormones of the thyroid gland, T3 (thyroxine) and T4 (triiodothyronine), help the body to produce and regulate the hormones adrenaline (also called epinephrine) and dopamine. Hormones are chemical substances that help control certain cells and organs. "}, {"url": "http://endocrinediseases.org/thyroid/thyroid_background.shtml", "passage_text": "The thyroid gland is one of the body's most important endocrine organs. It is located in the neck just below the thyroid cartilage (Adam's apple) and cricoid cartilage. Although its size can vary, based on each individual's size and iodine intake, the thyroid generally weighs approximately 15-20 grams (1/2 - 3/4 oz). "}, {"url": "https://en.wikipedia.org/wiki/Thyroid", "passage_text": "The thyroid gland, or simply the thyroid /ˈθaɪrɔɪd/ , is one of the largest endocrine glands in the body, and consists of two connected lobes. It is found in the neck, below the laryngeal prominence (Adam's apple). The thyroid gland is found in all vertebrates. In fish, it is usually located below the gills and is not always divided into distinct lobes. However, in some teleosts, patches of thyroid tissue are found elsewhere in the body, associated with the kidneys, spleen, heart, or eyes."}, {"url": "http://www.webmd.com/women/picture-of-the-thyroid", "passage_text": "© 2014 WebMD, LLC. All rights reserved. The thyroid is a butterfly-shaped gland that sits low on the front of the neck. Your thyroid lies below your Adam’s apple, along the front of the windpipe. The thyroid has two side lobes, connected by a bridge (isthmus) in the middle. 1 Thyroid cancer: An uncommon form of cancer, thyroid cancer is usually curable. 2  Surgery, radiation, and hormone treatments may be used to treat thyroid cancer. 3  Thyroid nodule: A small abnormal mass or lump in the thyroid gland. 4  Thyroid nodules are extremely common."}, {"url": "http://www.endocrineweb.com/conditions/thyroid-nodules/thyroid-gland-controls-bodys-metabolism-how-it-works-symptoms-hyperthyroi", "passage_text": "The thyroid gland is a butterfly-shaped organ located in the base of your neck. It releases hormones that control metabolism—the way your body uses energy. The thyroid's hormones regulate vital body functions, including: 1  Breathing. 2  Heart rate. 3  Central and peripheral nervous systems. 4  Body weight. 5  Muscle strength. "}, {"url": "http://www.yourhormones.info/glands/thyroid_gland.aspx", "passage_text": "The thyroid gland is located at the front of the neck just below the Adam's apple (larynx). It is butterfly-shaped and consists of two lobes located either side of the windpipe (trachea). A normal thyroid gland is not usually outwardly visible or able to be felt if finger pressure is applied to the neck. "}, {"url": "http://www.healthhype.com/thyroid-gland-location-anatomy-parts-and-pictures.html", "passage_text": "Location of the Thyroid Gland. The thyroid gland is located at the levels of C5 to T1 vertebrae lying immediately below the larynx, with the two lobes on each side of and anterior to the trachea. It starts just below the Adam’s apple (thyroid cartilage), about the same level as the cricoid cartilage. Parts of the Thyroid Gland. The thyroid is a bilobular gland surrounded by a fibrous capsule and can be divided into the following parts 1  : Right lobe that lies to the right side (lateral) of the larynx and trachea. 2  Left lobe that lies to the lef"}, {"url": "http://teachmeanatomy.info/neck/viscera/the-thyroid-gland/", "passage_text": "Anatomical Location. The thyroid gland is located in the anterior neck, spanning between the C5 and T1 vertebrae. It is an endocrine gland, divided into two lobes which are connected by an isthmus. It is said to have a butterfly shape. "}]