[{"url": "http://www.diffen.com/difference/Oxygen_vs_Ozone", "passage_text": "Diffen › Science › Chemistry. Ozone (O 3) is a triatomic molecule, consisting of three oxygen atoms. It is an allotrope of oxygen that is much less stable than the diatomic O 2 (oxygen gas). In order to understand the difference between oxygen and ozone, it is important to understand what an allotrope is. "}, {"url": "http://www.easychem.com.au/monitoring-and-management/the-atmosphere/allotropes-of-oxygen", "passage_text": "Allotropes of Oxygen. Compare the properties of the oxygen allotropes O2 and O3 and account for them on the basis of molecular structure and bonding. 1  Allotropy: The existence of two or more alternative forms of the same element in the same physical state. 2  Two allotropes of oxygen are: 3  M olecular oxygen (O2), also known as diatomic oxygen. "}, {"url": "http://www.ausetute.com.au/allotropy.html", "passage_text": "1 Elements such as carbon, oxygen, phosphorus, tin and sulfur, display allotropy. 2  The different physical properties displayed by allotropes of an element are explained by the fact that the atoms are arranged into molecules or crystals in different ways. Some properties of the allotropes of oxygen are shown below: The two most common, naturally occurring allotropes of carbon are graphite and diamond. There are three allotropes of phosphorus; white, red and black."}, {"url": "http://chemed.chem.purdue.edu/genchem/topicreview/bp/ch10/group6.php", "passage_text": "Oxygen (O 2) and ozone (O 3) are examples of allotropes (from the Greek meaning in another manner). By definition, allotropes are different forms of an element. Because they have different structures, allotropes have different chemical and physical properties (see table below). "}, {"url": "http://www.edurite.com/kbase/2-allotropes-of-oxygen", "passage_text": "You must hear about the allotropes which are basically more than one forms of same element. Two allotropes are differed from each other in their crystal shape or the attachments of atoms in an element. One of the most common examples of allotropes is sulphur. (O3), triatomic allotrope of oxygen (a form of oxygen in which the molecule contains three atoms instead of two as in the common form) that accounts for the distinctive odour of the air after a thunderstorm or around electrical equipment."}, {"url": "https://en.wikipedia.org/wiki/Allotropy", "passage_text": "Allotropy or allotropism (from Greek ἄλλος (allos) , meaning other, and τρόπος (tropos) , meaning manner, form) is the property of some chemical elements to exist in two or more different forms, in the same physical state, known as allotropes of these elements. For some elements, allotropes have different molecular formulae which can persist in different phases – for example, two allotropes of oxygen (dioxygen, O 2, and ozone, O 3), can both exist in the solid, liquid and gaseous states."}, {"url": "http://www.buzzle.com/articles/allotropes-of-oxygen.html", "passage_text": "Allotropes are different forms of the same chemical element that exhibit different physical and chemical properties. Different bonding arrangement between the atoms of an element ,result in a new molecular configuration, with new physical as well as chemical properties. Dioxygen. Dioxygen (O 2) is the most common form of elemental oxygen. It is a colorless gas at room temperature and forms about 21% of the earth's atmosphere. It exists as a diradical, and is the only allotrope that has unpaired electrons."}, {"url": "http://www.buzzle.com/articles/allotropes-of-oxygen.html", "passage_text": "Examples of elements that have allotropes include carbon, oxygen, phosphorus, and sulfur. Allotropes. Oxygen is a chemical element represented by the symbol 'O' and has the atomic number 8. It is the first element in Group VI A of the modern periodic table. Dioxygen. Dioxygen (O 2) is the most common form of elemental oxygen. It is a colorless gas at room temperature and forms about 21% of the earth's atmosphere. It exists as a diradical, and is the only allotrope that has unpaired electrons."}, {"url": "https://en.wikipedia.org/wiki/Allotropes_of_oxygen", "passage_text": "There are several known allotropes of oxygen. The most familiar is molecular oxygen (O 2), present at significant levels in Earth's atmosphere and also known as dioxygen or triplet oxygen. Another is the highly reactive ozone (O 3). Others include: 1  Atomic oxygen (O 1, a free radical). 2  Singlet oxygen (O 2 *), either of two metastable states of molecular oxygen. See also: Dioxygen in biological reactions. The common allotrope of elemental oxygen on Earth, O 2, is generally known as oxygen, but may be called dioxygen or molecular oxygen to distinguish it from the element itself. Elemental oxygen is most commonly encountered in this form, as about 21% (by volume) of Earth's atmosphere"}]