[{"url": "http://www.ehow.com/facts_6777679_role-hospice-nurse_.html", "passage_text": "nurse on duty image by Pix by Marti from Fotolia.com. Hospice nurses play a vital role in the care of patients that are in the final stage of life. They may be generalists who deal with patients with a variety of different conditions, or they may specialize in specific areas such as oncology, geriatrics or pediatrics. 1  What Education Is Needed to Be a Hospice Nurse? The hospice nurse will be responsible for pain management, keeping track of vital signs, patient care, crisis care and reporting vital information to the physician or other medical staff that is overseeing the patient's treatment."}, {"url": "http://www.ehospice.com/kenya/tabid/10674/ArticleId/4632/language/en-GB/View.aspx", "passage_text": "Improving a nurse’s role in palliative care. Nurses play a significant role in hospice/palliative care. In addition to the conventional nursing duties of observing and recording symptoms and treatments, they also provide emotional support to terminally ill patients and their families, through a series of roles. CAREGIVER-Nurses are always regarded to be the primary care providers because in a whole shift, their role revolves around checking and seeing that everyone is in good condition. When a patient cries out of pain, the nurse responds immediately by giving any type of care to lessen the discomforts felt by patient."}, {"url": "http://work.chron.com/role-nurse-hospice-care-3410.html", "passage_text": "Hospice nurses focus entirely on end-of-life care. A hospice nurse provides hands-on nursing care around the clock in the patient’s home or a hospice. Hospice nurses manage pain and other symptoms, provide support to patients and families and assist in the process of death with dignity. In addition to providing direct care, a hospice nurse may order supplies or obtain the necessary equipment to care for the patient at home and ensure medications are available. Hospice nurses perform patient assessments and create a plan of care for all professional caregivers to follow."}, {"url": "http://www.aseracare.com/expert-thinking/blogs/post.aspx?assetId=8e4e21f4-0b62-4d60-9e36-4feac5739f43", "passage_text": "Mahveen Hussain | posted September 06, 2011 |. Caring is the essence of nursing and that is particularly true in hospice, where nurses are present to help patients and families navigate the end-of-life journey. I’ve often heard hospice nurses called “angels” in the lives of those affected because of the comfort and ease they provide to patients in their final stages of life and to their families and friends."}, {"url": "http://www.aseracare.com/expert-thinking/blogs/post.aspx?assetId=8e4e21f4-0b62-4d60-9e36-4feac5739f43", "passage_text": "A hospice nurse is frequently asked to fill several vital roles, from medication supervision to emotional support. It can be difficult to care for patients with terminal illnesses, but more often, I see it become a meaningful journey for patients, families and those who work with them. I’ve often heard hospice nurses called “angels” in the lives of those affected because of the comfort and ease they provide to patients in their final stages of life and to their families and friends."}, {"url": "http://www.nursingexplorer.com/careers/hospice-nurse", "passage_text": "Because of this, hospice nurses play a significant role not only for the patients, but not only with the patient’s family as well. Dreams of becoming a hospice care nurse requires you to earn your degree in nursing and become a licenced practical nurse (LPN) or a registered nurse (RN). Hospice nurses are vital to terminally or critically ill patients. They are needed to provide palliative care during the final stages of the patient’s life. In general, the role of a hospice nurse is summarized into two simple points: 1  Pain management."}, {"url": "http://work.chron.com/role-nurse-hospice-care-3410.html", "passage_text": "In addition to registered nurses, licensed practical nurses and home health aides also perform hospice care nursing functions. The RN is the senior nursing professional on the hospice team and is responsible for providing education, supervision and direction to other nursing staff. Nurse practitioners, who are advanced practice nurses with master’s or doctorate degrees, may perform many of the functions of a physician in hospice care. In addition to providing direct care, a hospice nurse may order supplies or obtain the necessary equipment to care for the patient at home and ensure medications are available. Hospice nurses perform patient assessments and create a plan of care for all professional caregivers to follow."}, {"url": "http://www.aseracare.com/expert-thinking/blogs/post.aspx?assetId=8e4e21f4-0b62-4d60-9e36-4feac5739f43", "passage_text": "A hospice nurse serves as a case manager and advocate for their patients. Their job is to monitor vital signs; manage medications, particularly for pain; and generally take care of the needs of the patient. I’ve often heard hospice nurses called “angels” in the lives of those affected because of the comfort and ease they provide to patients in their final stages of life and to their families and friends."}]