[{"url": "http://www.recordgone.com/expungement-pennsylvania/pa-pardon-faq.htm", "passage_text": "After the investigation is complete, the Board will vote on whether to grant a hearing. If a hearing is granted, you will be provided 15 minutes (for non-capital cases) to make a presentation in support of your application. Any parties objecting will also receive 15 minutes for their presentation. You must get a majority of the Board to vote in favor of granting the pardon. If the Board votes in your favor, the pardon is then sent to the Governor for approval."}, {"url": "https://www.pardons.org/pardons/faqs/", "passage_text": "It takes an average of 12-24 months for a pardon/record suspension application to be processed and granted. However, to prepare the pardon/record suspension application, many documents must be collected. Acquiring the proper supporting documents takes between 3-10 months. "}, {"url": "http://pardons.delaware.gov/faqs.shtml", "passage_text": "mean that you were granted a pardon. Only the Governor has the executive authority to make this decision. Your file is then forwarded to the Governor's Office for review and a decision will be mailed to you. The whole process varies from case to case, so please be patient. "}, {"url": "https://www.gov.ca.gov/s_pardonsandcommutations.php", "passage_text": "Individuals who have been convicted of a crime in California may apply to the Governor for a gubernatorial pardon. A gubernatorial pardon is an honor that may be granted to people who have demonstrated exemplary behavior following their conviction. A pardon will not be granted unless it has been earned. Historically, governors have granted very few pardons."}, {"url": "https://www.pardons.org/how-long-for-waiver-to-be-granted/", "passage_text": "The U.S. normally takes between 4-10 months to process a Waiver application. You must wait at least 4 months after submitting your Waiver before contacting the Admissibility Review Office (ARO). "}, {"url": "http://www.ct.gov/bopp/cwp/view.asp?a=4331&q=508292", "passage_text": "You may apply to the Pardons Board for a full pardon three (3) years after the date of the disposition of your most recent misdemeanor conviction and/or five (5) years after the date of the disposition of your most recent felony conviction. The granting of a pardon is an act of grace and mercy and is taken seriously. It is a thoughtful and deliberative process where many different things are considered. The process can take up to 2 years because of the large number of applications received by the Pardons Board each month."}, {"url": "http://famm.org/wp-content/uploads/2013/08/FAQ-Commutations-4.13.pdf", "passage_text": "For those seeking federal pardons, the application process will often take at least 18 months to two years because the Office of the Pardon Attorney will typically do a full background check and investigation when a person requests a pardon, and this investigation takes between 18 months and two years to complete. Depending on the type of crime and the length of the sentence, it is usually wise for a prisoner to serve a significant part of their sentence (i.e., 30-50% of their total time) before filing for a commutation."}, {"url": "https://pardoncanadaservice.ca/pardon-faq.php", "passage_text": "The pardon is granted depending on the nature of offences and also whether you have had a good behaviour in accordance with the law during a period of time varying with the nature of the offence committed. (Call to discuss your situation with our consultants) Call…1-866-630-3660. It's free. "}, {"url": "https://pap.georgia.gov/pardons-restoration-rights", "passage_text": "The application process for Pardons and Restoration of Rights has changed effective 01/01/2015 and the revised application will be required. All previous versions of applications received by the State Board of Pardons and Paroles on or after 02/16/2015 will be returned to the applicant. "}, {"url": "http://www.ct.gov/doc/lib/doc/pdf/PardonFAQ.pdf", "passage_text": "-There is no guarantee that a pardon will be granted. 22. If I am denied a pardon, do I have to wait an entire year from the hearing date to re-apply for a pardon? -Generally you must wait one year from the date of denial before you can reapply. The Board may at its discretion specify a longer waiting period. There are two types of pardons: An Expungement pardon is an erasure of the official criminal record. You may apply to the Board for an expungement 3 years after the date of the disposition of your most recent misdemeanor conviction and/or 5 years after the date of the disposition of your most recent felony conviction."}]