[{"url": "http://www.answers.com/Q/Why_was_the_typewriter_invented", "passage_text": "In the 1860s there were early typewriters invented in Italy, Brazil, Austria, Denmark and the US. The first commercially sold typewriter seems to be the Hansen Writing Ball, … which was sold in Denmark in 1865. The first typewriter, a invention made by the Austrian carpenter Peter Mitterhofer in 1864, can be seen at the technical museum in Vienna (Austria). Christopher Latham Shole … s also invented a typewriter. Sholes was a U.S. mechanical engineer who invented the first practical modern typewriter, patented in 1868. Sholes invented the typewriter with partners S. W. Soule and G. Glidden, that was manufactured (by Remington Arms Company) in 1873"}, {"url": "http://www.edinformatics.com/inventions_inventors/typewriter.htm", "passage_text": "In 1867 Christopher Sholes, Carlos Glidden, and Samuel W. Soule invented another typewriter. The Sholes and Glidden typewriter was the first device that allowed an operator to type substantially faster than a person could write by hand. "}, {"url": "http://www.answers.com/Q/Why_was_the_typewriter_invented", "passage_text": "The first typewriter to be commercially successful was invented in 1867 by C. Latham Sholes, Carlos Glidden and Samuel W. Soule in Milwaukee, Wisconsin, USA. The patent was sold to Remington. Remington's first commercial machine appeared in 1873. It was also the first appearance of the QWERTY keyboard. The first typewriter, a invention made by the Austrian carpenter Peter Mitterhofer in 1864, can be seen at the technical museum in Vienna (Austria). Christopher Latham Shole … s also invented a typewriter. Sholes was a U.S. mechanical engineer who invented the first practical modern typewriter, patented in 1868. Sholes invented the typewriter with partners S. W. Soule and G. Glidden, that was manufactured (by Remington Arms Company) in 1873"}, {"url": "http://www.answers.com/Q/Why_is_the_typewriter_important", "passage_text": "The first commercially sold typewriter seems to be the Hansen Writing Ball, … which was sold in Denmark in 1865. The first typewriter to be commercially successful was invented in 1867 by C. Latham Sholes, Carlos Glidden and Samuel W. Soule in Milwaukee, Wisconsin, USA. The patent was sold to Remington. Remington's first commercial machine appeared in 1873. It was also the first appearance of the QWERTY keyboard"}, {"url": "http://www.typewritermuseum.org/history/why.html", "passage_text": "From printing to typing. When Johann Gutenberg invented the printing press with loose type in the 15th century, he cleared the way for the gradual proliferation of the printed word. It would seem an obvious second step to use the printing technology to create a machine that could take over the cumbersome task of hand writing. "}, {"url": "https://en.wikipedia.org/wiki/Typewriter", "passage_text": "The first typewriter to be commercially successful was invented in 1868 by Americans Christopher Latham Sholes, Carlos Glidden and Samuel W. Soule in Milwaukee, Wisconsin, although Sholes soon disowned the machine and refused to use, or even to recommend it. Typewriter examination was used in the Leopold and Loeb and Alger Hiss cases. In the Eastern Bloc, typewriters (together with printing presses, copy machines, and later computer printers) were a controlled technology, with secret police in charge of maintaining files of the typewriters and their owners."}, {"url": "http://www.mit.edu/%7Ejcb/Dvorak/history.html", "passage_text": "Early Typewriter History. The first practical typewriter was invented by Christopher Latham Sholes, and was marketed by the Remington Arms company in 1873. The action of the type bars in the early typewriters was very sluggish, and tended to jam frequently. "}, {"url": "https://en.wikipedia.org/wiki/Typewriter", "passage_text": "A typewriter is a mechanical or electromechanical machine for writing in characters similar to those produced by printer's movable type by means of keyboard-operated types striking a ribbon to transfer ink or carbon impressions onto paper. Typewriter examination was used in the Leopold and Loeb and Alger Hiss cases. In the Eastern Bloc, typewriters (together with printing presses, copy machines, and later computer printers) were a controlled technology, with secret police in charge of maintaining files of the typewriters and their owners."}]