[{"url": "http://www.areavibes.com/deerfield+beach-fl/livability/", "passage_text": "Deerfield Beach, FL-An Awesome Place to Live I relocated to Deerfield Beach, Fl about 8 years ago because of my job, and have been here ever since. When I am not at work, I enjoy water skiing and spending time on the beach."}, {"url": "http://florida.hometownlocator.com/fl/broward/deerfield-beach.cfm", "passage_text": "The primary coordinate point for Deerfield Beach is located at latitude 26.3117 and longitude -80.1254 in Broward County. The formal boundaries for the City of Deerfield Beach (see map below) encompass a land area of 15.09 sq. miles and a water area of 1.15 sq. miles."}, {"url": "http://www.citytowninfo.com/places/florida/deerfield-beach", "passage_text": "Tweet. Introduction to Deerfield Beach, Florida. The Florida city of Deerfield Beach, part of Broward County, is located on the Atlantic Ocean about three miles south of Boca Raton and 20 miles north of Fort Lauderdale."}, {"url": "http://www.rent.com/florida/deerfield-beach-apartments/2-326", "passage_text": "Renting a Deerfield Beach apartment puts those looking for employment in a perfect location to work at one of the Fortune 500 companies with headquarters or regional offices in South Florida, including Office Depot, AutoNation and World Fuel Services."}, {"url": "http://www.deerfield-beach.com/", "passage_text": "Marine Advisory Board to meet October 15th-The Deerfield Beach Marine Advisory Board will meet at 6 PM on October 15, 2015 in the City Commission Chambers, City Hall, 150 Northeast Second Avenue, Deerfield Beach, Florida."}, {"url": "https://en.wikipedia.org/wiki/Deerfield_Beach,_Florida", "passage_text": "Deerfield Beach is a city in Broward County, Florida, USA. It is located just south of the Palm Beach County line. The city is named for the numerous deer that once roamed the area."}, {"url": "http://florida.hometownlocator.com/fl/broward/deerfield-beach.cfm", "passage_text": "The City of Deerfield Beach had a population of 75,929 as of July 1, 2015. Deerfield Beach ranks in the upper quartile for Population Density and Diversity Index when compared to the other cities, towns and Census Designated Places (CDPs) in Florida. See peer rankings below."}]