[{"url": "http://www.nutrition-and-you.com/flax-seed.html", "passage_text": "Exposing flax powder to air for extended periods can oxidize their fatty acids and deprives them of their nutritional value. Therefore, generally, the seeds are ground in a coffee or nut/seed grinder just before use in order to preserve their nutrition-profile."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/expert-answers/flaxseed/faq-20058354", "passage_text": "Refrigerating whole seeds may also extend their freshness. Tips for including flaxseed in your diet: 1  Add a tablespoon of ground flaxseed to your hot or cold breakfast cereal. 2  Add a teaspoon of ground flaxseed to mayonnaise or mustard when making a sandwich."}, {"url": "http://www.nutrition-and-you.com/flax-seed.html", "passage_text": "Flax seed nutrition facts. Flax seed, also known as linseed, is one of the ancient cultivated crops since Mesopotamian times, grown for its oil seeds and fiber. Its chewy seeds are packed with full of nutrients, omega-3 fatty acids, antioxidants, minerals, and essential vitamins."}, {"url": "http://www.medicalnewstoday.com/articles/263405.php", "passage_text": "Flaxseeds (also called linseeds) are a rich source of micronutrients, dietary fiber, manganese, vitamin B1, and the essential fatty acid alpha-linolenic acid, also known as ALA or omega-3. The seeds come from flax, one of the oldest fiber crops in the world-known to have been cultivated in ancient Egypt and China."}, {"url": "http://www.greatplainsflax.com/flax-seed-information/why-golden-flaxseeds-are-better.php", "passage_text": "Recommended daily usage: To get the maximum benefits from our Omega-3,6 golden flax seeds we recommend using 3 tbsp of ground flax seeds per day. A 20 lb supply of unground golden flax seeds will generally last one person for about one year."}, {"url": "http://www.greatplainsflax.com/flax-seed-information/why-golden-flaxseeds-are-better.php", "passage_text": "Quality is very important in determining the omega-3,6 content and overall nutritional value. The variety we sell is a Golden Omega Flax Seed that was developed specifically for human consumption on the plains of North Dakota and is one of the highest quality and purity flax seeds available to the public."}, {"url": "http://www.greatplainsflax.com/flax-seed-information/why-golden-flaxseeds-are-better.php", "passage_text": "…….for more golden flax seed information see nutritional benefits of golden flax seeds or check out the Wikipedia entry for golden flax seeds. How to grow your own golden (Linum Usitatissimum) flax seeds: Flax is easy to grow. As wildflowers, they require little care."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/expert-answers/flaxseed/faq-20058354", "passage_text": "One tablespoon of ground flaxseed contains 2 grams of polyunsaturated fatty acids (includes the omega 3s) and 2 grams of dietary fiber and 37 calories. Flaxseed is commonly used to improve digestive health or relieve constipation."}, {"url": "http://www.greatplainsflax.com/flax-seed-information/why-golden-flaxseeds-are-better.php", "passage_text": "The Omega Golden Flax Seed was developed for human consumption and is preferred for the food market because of its nutty-buttery flavor. The nutritional value of golden flaxseed vs. brown flaxseed are very similar if the samples are of the same quality."}]