[{"url": "http://www.vitacost.com/vitacost-senna-leaf-100-vegetarian-capsules-2", "passage_text": "Warnings This product contains Senna. Read and follow directions carefully. Consult your physician before use if you have nausea, vomiting, abdominal pain, intestinal obstruction, hemorrhoids, frequent diarrhea, loose stools or a sudden change in bowel movements that persist over a period of 2 weeks."}, {"url": "https://en.wikipedia.org/wiki/Senna_%28plant%29", "passage_text": "The genus Senna has had a complex taxonomic history. What is now known as Senna was included by Linnaeus in his concept of Cassia in Species Plantarum in 1753. Philip Miller segregated Senna from Cassia in 1754 in the fourth edition of The Gardeners Dictionary. Cassia gum, an extract of the seeds of Chinese senna (S. obtusifolia), is used as a thickening agent. The leaves and flowers of Siamese cassia (S. siamea) are used in some Southeast Asian cuisines, such as Thai and Lao cuisines. They are known as khi-lek in Thai, and are used in curries"}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-652-SENNA.aspx?activeIngredientId=652&activeIngredientName=SENNA", "passage_text": "Senna is an herb. The leaves and the fruit of the plant are used to make medicine. Senna is an FDA-approved nonprescription laxative. It is used to treat constipation and also to clear the bowel before diagnostic tests such as colonoscopy. Senna is also used for irritable bowel syndrome (IBS), hemorrhoids, and weight loss. Senna fruit seems to be gentler than senna leaf. This has led the American Herbal Products Association (AHPA) to warn against long-term use of senna leaf, but not senna fruit."}, {"url": "http://www.botanical.com/botanical/mgmh/s/senna-42.html", "passage_text": "---Adulterations and Other Species Used--- Owing to the high price, what is known as 'broken Senna' is found on the market and sold for the genuine article with government sanction in the United States of America. Commercial Senna is prepared for use by garbling, or picking out the leaflets and rejecting the lead-stalks, impurities, and leaves of other plants. The amount annually exported is about 8,000 bales of each of the varieties, and the price is high, owing to the failure of the crops at certain seasons."}, {"url": "http://www.botanical.com/botanical/mgmh/s/senna-42.html", "passage_text": "'Senna is found in abundance in many parts of Kardofan, but the leaves are not collected on account of the existing monopoly. The Government draws its supplies from Dongola in Nubia.'. Senna appears to have been cultivated in England about 1640. By keeping the plants in a hot-bed all the summer, they frequently flowered; but rarely perfected their seeds. Commercial Senna is prepared for use by garbling, or picking out the leaflets and rejecting the lead-stalks, impurities, and leaves of other plants. The amount annually exported is about 8,000 bales of each of the varieties, and the price is high, owing to the failure of the crops at certain seasons."}, {"url": "http://www.botanical.com/botanical/mgmh/s/senna-42.html", "passage_text": "(3) Senna exhausted by alcohol is a reliable and pleasant purgative, but somewhat weaker in its action than the unexhausted leaves. Cathartin is the name of a mixture of the salts of cathartic acid which may be used in doses of from 3 to 6 grains. Commercial Senna is prepared for use by garbling, or picking out the leaflets and rejecting the lead-stalks, impurities, and leaves of other plants. The amount annually exported is about 8,000 bales of each of the varieties, and the price is high, owing to the failure of the crops at certain seasons."}, {"url": "http://www.uofmhealth.org/health-library/d01013a1", "passage_text": "Senna is also known as Cassia senna, tinnevelly senna, Indian senna, Alexandrian senna, and Khartoum senna. Senna has been used in alternative medicine as an aid to treat constipation. Not all uses for senna have been approved by the FDA. Senna should not be used in place of medication prescribed for you by your doctor. Senna is often sold as an herbal supplement. There are no regulated manufacturing standards in place for many herbal compounds and some marketed supplements have been found to be contaminated with toxic metals or other drugs."}, {"url": "https://en.wikipedia.org/wiki/Senna_%28plant%29", "passage_text": "Senna (from Arabic sanā), the sennas, is a large genus of flowering plants in the legume family Fabaceae, and the subfamily Caesalpinioideae. This diverse genus is native throughout the tropics, with a small number of species in temperate regions. The number of species is estimated to be from about 260 to 350. Cassia gum, an extract of the seeds of Chinese senna (S. obtusifolia), is used as a thickening agent. The leaves and flowers of Siamese cassia (S. siamea) are used in some Southeast Asian cuisines, such as Thai and Lao cuisines. They are known as khi-lek in Thai, and are used in curries"}, {"url": "http://www.herbco.com/p-646-senna-leaf-powder.aspx", "passage_text": "Bulk Discounts: 5 or more = 10% OFF | 25 or more = 15% OFF. Our source for senna leaf powder is Senna alexandrina, a species of desert plant native to the Mediterranean region that is also known as East Indian Senna, Egyptian Senna and Alexandrian Senna. senna leaf. There are roughly between 250 and 300 species of plants in the senna family, but S. alexandrina is attributed as the source of senna leaf and senna pods. With the exception of Europe, the plant thrives in the tropical and subtropical regions of every continent in the world."}]