[{"url": "http://www.youtube.com/watch?v=4ZopTiJX1X0", "passage_text": "Please try again later. A production company is responsible for supervising the filming from concept to completion, and they hold the sole legal and financial responsibility of the movie as a whole. Understand the job of a production company with helpful tips from an independent filmmaker in this free video on film. Expert: Nathan Boehme."}, {"url": "http://www.ehow.com/video_4872070_production-company-do_.html", "passage_text": "Cancel. A production company is responsible for supervising the filming from concept to completion, and they hold the sole legal and financial responsibility of the movie as a whole. Understand the job of a production company with helpful tips from an independent filmmaker in this free video on film."}, {"url": "http://www.youtube.com/watch?v=4ZopTiJX1X0", "passage_text": "A production company is responsible for supervising the filming from concept to completion, and they hold the sole legal and financial responsibility of the movie as a whole. Understand the job of a production company with helpful tips from an independent filmmaker in this free video on film. Expert: Nathan Boehme."}, {"url": "https://en.wikipedia.org/wiki/Production_company", "passage_text": "A production company provides the physical basis for works in the realms of the performing arts, new media art, film, television, radio, and video."}, {"url": "http://www.ehow.com/video_4872070_production-company-do_.html", "passage_text": "A production company to sum it up basically is the business that shepherds movies through completion, from start to completion. That is essentially what a film production company does."}, {"url": "http://www.ehow.com/video_4872070_production-company-do_.html", "passage_text": "A production company is responsible for supervising the filming from concept to completion, and they hold the sole legal and financial responsibility of the movie as a whole."}, {"url": "http://www.slideshare.net/ShonaJoanna/what-does-a-production-company-do", "passage_text": "1 What does a ProductionCompany do ?A production company essentially helps tocreate the film-its assists in thebudgeting, scheduling, scripting, castingand more."}, {"url": "http://smallbusiness.chron.com/start-up-film-production-company-4702.html", "passage_text": "A production company that does the physical work of making the film does not need a large operating budget until production starts, since the work is contracted out as needed. Step 5. Talk to an insurance agent regarding the insurance needed for different production companies."}, {"url": "https://en.wikipedia.org/wiki/Production_company", "passage_text": "A production company is responsible for the development and filming of a specific production or media broadcast. In entertainment, the production process begins with the development of a specific project."}]