[{"url": "http://www.dol.gov/oasam/regs/statutes/2000e-16.htm", "passage_text": "This Act, referred to in subsec. (e), means Pub. L. 88-352, July 2, 1964, 78 Stat. 241, as amended, known as the Civil Rights Act of 1964, which is classified principally to subchapters II to IX of this chapter (Sec. 2000a et seq.)."}, {"url": "http://www.dol.gov/oasam/regs/statutes/2000e-16.htm", "passage_text": "For complete classification of this Act to the Code, see Short Title note set out under section 2000a of this title and Tables. Executive Order 11478, as amended, referred to in subsecs. (c) and (e), is set out as a note under section 2000e of this title. 1991 - Subsec. (c). (e), means Pub. L. 88-352, July 2, 1964, 78 Stat. 241, as amended, known as the Civil Rights Act of 1964, which is classified principally to subchapters II to IX of this chapter (Sec. 2000a et seq.)."}, {"url": "http://www.eeoc.gov/federal/otherprotections.cfm", "passage_text": "The EEOC has held that discrimination against an individual because that person is transgender (also known as gender identity discrimination) is discrimination because of sex and therefore is covered under Title VII of the Civil Rights Act of 1964. "}, {"url": "https://en.wikipedia.org/wiki/Title_VII", "passage_text": "In 1972, Congress passed the Equal Employment Opportunity Act. The Act amended Title VII and gave EEOC authority to initiate its own enforcement litigation. The EEOC now played a major role in guiding judicial interpretations of civil rights legislation. The commission was also permitted for the first time to define discrimination, a term excluded from the 1964 Act. This was of crucial importance to civil rights activists who could not get fair trials in state courts. Title IX of the Civil Rights Act of 1964 should not be confused with Title IX of the Education Amendments Act of 1972, which prohibits sex discrimination in federally funded education programs and activities."}, {"url": "http://www.aauw.org/what-we-do/legal-resources/know-your-rights-at-work/title-vii/", "passage_text": "Title VII of the Civil Rights Act of 1964 is a federal law that prohibits employers from discriminating against employees on the basis of sex, race, color, national origin, and religion. It generally applies to employers with 15 or more employees, including federal, state, and local governments. "}, {"url": "https://www.law.cornell.edu/uscode/text/2/1311", "passage_text": "“(A) Application.—. The rights and protections under title VII of the Civil Rights Act of 1964 (42 U.S.C. 2000e et seq.) shall, subject to subparagraph (B), apply with respect to any employee in an employment position in the House of Representatives and any employing authority of the House of Representatives. “(1) In general.—. Notwithstanding any provision of title VII of the Civil Rights Act of 1964 (42 U.S.C. 2000e et seq.) or of other law, the purposes of such title shall, subject to paragraph (2), apply in their entirety to"}, {"url": "https://www.law.cornell.edu/uscode/text/2/1311", "passage_text": "2 U.S. Code § 1311 - Rights and protections under title VII of Civil Rights Act of 1964, Age Discrimination in Employment Act of 1967, Rehabilitation Act of 1973, and title I of Americans with Disabilities Act of 1990. “(1) In general.—. Notwithstanding any provision of title VII of the Civil Rights Act of 1964 (42 U.S.C. 2000e et seq.) or of other law, the purposes of such title shall, subject to paragraph (2), apply in their entirety to the House of Representatives."}, {"url": "https://en.wikipedia.org/wiki/Title_VII", "passage_text": "The Civil Rights Act of 1964 (Pub.L. 88–352, 78 Stat. 241, enacted July 2, 1964) is a landmark piece of civil rights legislation in the United States that outlawed discrimination based on race, color, religion, sex, or national origin. This was of crucial importance to civil rights activists who could not get fair trials in state courts. Title IX of the Civil Rights Act of 1964 should not be confused with Title IX of the Education Amendments Act of 1972, which prohibits sex discrimination in federally funded education programs and activities."}, {"url": "http://www.eeoc.gov/laws/statutes/titlevii.cfm", "passage_text": "EDITOR'S NOTE: The following is the text of Title VII of the Civil Rights Act of 1964 (Pub. L. 88-352) (Title VII), as amended, as it appears in volume 42 of the United States Code, beginning at section 2000e. Title VII prohibits employment discrimination based on race, color, religion, sex and national origin. The Civil Rights Act of 1991 (Pub. L. 102-166) (CRA) and the Lily Ledbetter Fair Pay Act of 2009 (Pub. L. 111-2) amend several sections of Title VII. (1) is the certified representative of employees under the provisions of the National Labor Relations Act, as amended [29 U.S.C. 151 et seq.] , or the Railway Labor Act, as amended [45 U.S.C. 151 et seq.] ;"}, {"url": "https://www.law.cornell.edu/uscode/text/2/1311", "passage_text": "“(1) In general.—. The rights and protections under this title [see Tables for classification] and title VII of the Civil Rights Act of 1964 (42 U.S.C. 2000e et seq.) shall, subject to paragraph (2), apply with respect to the conduct of each instrumentality of the Congress. “(1) In general.—. Notwithstanding any provision of title VII of the Civil Rights Act of 1964 (42 U.S.C. 2000e et seq.) or of other law, the purposes of such title shall, subject to paragraph (2), apply in their entirety to the House of Representatives."}]