[{"url": "https://en.wikipedia.org/wiki/Tuberosity_of_the_tibia", "passage_text": "From Wikipedia, the free encyclopedia. The tuberosity of the tibia or tibial tuberosity or tibial tubercle is a large oblong elevation on the proximal, anterior aspect of the tibia, just below where the anterior surfaces of the lateral and medial tibial condyles end. "}, {"url": "http://www.wisegeek.org/what-is-an-ischial-tuberosity.htm", "passage_text": "When a person is in a seated position, his or her weight typically rests on a section of bone called the ischial tuberosity. There are two of these bony swellings, sometimes called the sitting bones, located at the front of the superior ramus of the ischium, which is the lower back portion of the hip bone. Due to the number of leg muscles attached to the ischial tuberosity, sports-related injuries are fairly common in this area. Sports such as running, soccer, and cycling, where a high level of strain is put on the thighs, are often the culprit."}, {"url": "http://www.merriam-webster.com/dictionary/tuberosity", "passage_text": "Medical Definition of TUBEROSITY. : a rounded prominence; especially: a large prominence on a bone usually serving for the attachment of muscles or ligaments. See tuberosity defined for kids. ADVERTISEMENT"}, {"url": "http://medical-dictionary.thefreedictionary.com/tuberosity", "passage_text": "prominent tuberosity protruding from the cranial aspect of the proximal end of the tibia onto which the patellar ligament inserts. a prominence on the lateral aspect of the humerus; the point of attachment of the deltoid muscle. facial tuberosity. a discrete elevation on the maxilla of cows which serves as an attachment for the rostral part of the masseter muscle."}, {"url": "http://www.wisegeek.org/what-does-tibial-tuberosity-mean.htm", "passage_text": "The tibial tuberosity is the bony protrusion at the top of the tibia bone in the lower leg. It is located just underneath the kneecap and can be easily felt with the hand. X-ray of a human knee, where both the tibia and kneecap can be seen clearly. Physical therapy may be needed to treat tibial tuberosity. Sports such as tennis can be rough on the knees. Acute injuries tend to benefit most from applying ice while chronic injuries are often helped by heat."}, {"url": "http://www.wisegeek.org/what-does-tibial-tuberosity-mean.htm", "passage_text": "The tibial tuberosity is located near the top of the tibia, which is the larger of the lower leg bones (left), just below the kneecap. X-ray of a human knee, where both the tibia and kneecap can be seen clearly. Physical therapy may be needed to treat tibial tuberosity. Sports such as tennis can be rough on the knees. Acute injuries tend to benefit most from applying ice while chronic injuries are often helped by heat."}, {"url": "http://www.audioenglish.org/dictionary/tuberosity.htm", "passage_text": "• TUBEROSITY (noun). The noun TUBEROSITY has 1 sense: 1. a protuberance on a bone especially for attachment of a muscle or ligament. Familiarity information: TUBEROSITY used as a noun is very rare. "}, {"url": "http://www.wisegeek.com/what-is-the-greater-tuberosity.htm", "passage_text": "10 most extreme places on Earth. The greater tuberosity, located on the humerus next to the head of the humerus and the lesser tuberosity, is a large, bulbous protrusion from this long arm bone that serves as an attachment point for several muscles. Four of these muscles control movement of the shoulder. "}, {"url": "http://www.shoulderdoc.co.uk/article/1482", "passage_text": "The greater tuberosity is the prominent area of bone at the top of the humerus and is the attachment for the two large, powerful rotator cuff muscles-supraspinatus and infraspinatus. It is injured/fractured in a fall by either landing directly onto the side of your shoulder or landing with your arm outstretched. As greater tuberosity fractures are usually retracted posteriorly and superiorly, a closed reduction is difficult. If left in position, impingement will develop against the acromion, limiting elevation and external rotation of the shoulder."}]