[{"url": "http://www.acaloriecounter.com/diet/how-many-calories-should-i-eat-per-day-to-lose-weight/", "passage_text": "What this means is, whatever your daily calorie maintenance level is, you should be about 20% below it each day. Here’s an example…. 1  Let’s say some person (male or female) had a daily calorie maintenance level of 2500 calories. 2  They’d first figure out that 20% of 2500 is 500 (2500 x 0.20 = 500). "}, {"url": "http://www.calorieking.com/interactive-tools/how-many-calories-should-you-eat/?ref=nav", "passage_text": "The Body Mass Index (BMI), is a statistical measure of body weight based on a person's weight and height. BMI is a widely used measure to find out whether you're a healthy weight for your height. A BMI of 18.5 to 25 is considered healthy for most adults. Find out in two simple steps. The amount of calories you should eat every day depends on a few things: 1  Age, height and gender. 2  Daily activity level. 3  If you want to lose, maintain or gain weight"}, {"url": "http://www.webmd.com/diet/guide/calories-chart", "passage_text": "To maintain weight, the chart below shows you your daily calorie limit. It's based on your age, activity level, and the BMI (body-mass index) of 21.5 for women and 22.5 for men. To lose weight -- about 1 pound a week -- reduce total calories in the chart by 500 a day. To gain weight, add 500 calories per day for each pound you want to gain per week. "}, {"url": "http://www.shapefit.com/calculators/calories-per-day-calculator.html", "passage_text": "To Lose Weight. To take off one pound per week, you’ll need to reduce calories by 500 per day (1 pound of body fat equals about 3,500 calories). Try eating 250 calories less per day and exercising enough to burn 250 calories, like walking about 2.5 miles each day. The easiest way to cut back on calories is to watch your portion sizes. To Gain Weight. "}, {"url": "http://www.healthline.com/health/lose-weight-calories", "passage_text": "Daily Calories. According to the United States Department of Agriculture (USDA), the recommended calorie intake for women aged 19-51 years ranges from 1800-2000 calories per day. Generally, younger women require more calories than older women. Men aged 19-51 years of age require even more, anywhere between 2,200-2,400 calories per day. People that lead more active lifestyles or those who want to gain weight require more calories. For children aged between 2 and 18 years, calorie intake ranges from anywhere between 1000-2200 per day."}, {"url": "http://www.medicalnewstoday.com/articles/245588.php", "passage_text": "The number of calories you need to eat each day depends on several factors, including your age, size, height, sex, lifestyle, and overall general health. As an example, a physically active 6ft 2in male, aged 22 years, requires considerably more calories than a 5ft 2ins sedentary woman in her 70s. 1 The longer you chew your food, the more calories your body retains. 2  Recommended daily calorie intakes in the US are 2,700 for men and 2,200 for women. 3  Eating a big breakfast could help with weight reduction and maintenance. 4  When food is eaten may matter as much as what and how many calories are eaten."}, {"url": "http://www.acaloriecounter.com/diet/how-much-fat-per-day/", "passage_text": "(Just multiply your calorie intake by 0.20 and 0.30.). Then, since 1 gram of fat contains 9 calories, just divide both of your answers by 9. The amount you get now is the ideal range for how many grams of fat you should eat each day. 1 Next, they’d figure out that 20-30% of 2500 calories is between 500-750 calories. 2  They’d then divide 500 and 750 by 9 (because there’s 9 calories per gram of fat) and get a range of 55-83. 3  So, in this example, this person would eat between 55-83 grams of fat per day."}]