[{"url": "http://www.flyingstart.scot.nhs.uk/learning-programmes/equality-and-diversity/patient-autonomy.aspx", "passage_text": "Patient autonomy. Patient autonomy means ensuring that patients make informed decisions and give consent based on good information. It is important not to make assumptions about what patients/clients and their carers want, but to work in partnership for the best outcomes."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=13551", "passage_text": "Patient autonomy: The right of patients to make decisions about their medical care without their health care provider trying to influence the decision. Patient autonomy does allow for health care providers to educate the patient but does not allow the health care provider to make the decision for the patient."}, {"url": "http://www.iep.utm.edu/autonomy/", "passage_text": "Another distinction that can be made is between autonomy as a bare capacity to make decisions and of autonomy as an ideal. When autonomy functions as an ideal, agents who do not meet certain criteria in having reached a decision are deemed non-autonomous with respect to that decision."}, {"url": "http://www.nursingworld.org/MainMenuCategories/EthicsStandards/Resources/Ethics-Definitions.pdf", "passage_text": "Example: In clinical situations nurses respect a patient’s autonomy, where the patient is allowed the freedom of choice regarding treatment, such as in deciding whether he/she wishes to be intubated during an exacerbation of COPD, or deciding when he/she wishes to forgo further dialysis."}, {"url": "http://healthcare.uslegal.com/patient-rights/right-to-autonomy-and-self-determination/", "passage_text": "Patient “autonomy” or self-determination is at the core of all medical decision-making in the United States. It means that patients have the right and ability to make their own choices and decisions about medical care and treatment they receive, as long as those decisions are within the boundaries of law. There is a legal presumption that they are fit and competent to make those decisions until a court determines otherwise."}, {"url": "http://healthcare.uslegal.com/patient-rights/right-to-autonomy-and-self-determination/", "passage_text": "Right to Autonomy and Self Determination. In early 2005, a shocked and empathetic nation watched the private and personal drama of a family in conflict play out on national television, as the parents of quasi-comatose Terri Schiavo fought with her husband over whether to remove her from life support."}, {"url": "http://www.caresearch.com.au/caresearch/tabid/1549/Default.aspx", "passage_text": "Patient choice and autonomy are considered key in palliative care. Part of the nurse’s role, wherever possible, is to advocate for a competent patient’s right to decide their own course of action, whether it is something that the nurse feels is appropriate or not."}, {"url": "http://www.iep.utm.edu/aut-norm/", "passage_text": "Autonomy: Normative. Autonomy is variously rendered as self-law, self-government, self-rule, or self-determination. The concept first came into prominence in ancient Greece (from the Greek auto-nomos), where it characterized city states that were self governing."}]