[{"url": "http://www.e-missions.net/cybersurgeons/?/nerv_teacher/", "passage_text": "3) motor neurons —carry impulses from the brain and spinal cord to muscles or glands. The Response Mechanism. When a stimulus is received by a sensory neuron, the impulse (or message) is carried through fibrous extensions called dendrites to the cell body."}, {"url": "http://www.fallriverschools.org/uploads/JamiePacheco/Chemistry%20of%20Life/Neurons%20_%20Nerve%20Impulses.pdf", "passage_text": "Neurons • Neurons –cells that transmit nerve impulses•3 Types of Neurons –Sensory neurons carry impulses from sense organs to the spinal cord and brain–Motor neurons carry impulses from the brain and spinal cord to muscles and glands–Interneurons connect sensory and motor neurons and carry impulses between them."}, {"url": "http://www.ptdirect.com/training-design/anatomy-and-physiology/nerves-neurons-2013-anatomy-and-function", "passage_text": "1 Transmit nerve impulses: Nerves are able to transmit impulses along the length of the nerve cell in the form of an electrical signal (like power lines). 2  These electrical signals move from one end of the nerve cell to another and can pass from nerve to nerve (power pole to power pole)."}, {"url": "http://www.e-missions.net/cybersurgeons/?/nerv_teacher/", "passage_text": "The Neuron. The neuron, a nerve cell, is the functional unit of the nervous system that carries the impulse (the message) to the appropriate part of the nervous system or interprets the impulse and allows a response. There are three types of neurons and each has different functions."}, {"url": "http://www.e-missions.net/cybersurgeons/?/nerv_teacher/", "passage_text": "The neuron, a nerve cell, is the functional unit of the nervous system that carries the impulse (the message) to the appropriate part of the nervous system or interprets the impulse and allows a response."}, {"url": "http://nortonhealthcare.adam.com/pages/guide/reftext/html/nerv_sys_fin.html", "passage_text": "The ventral root contains efferent (motor) fibers that carry messages from the spinal cord to the effectors. Cell bodies of the efferent fibers reside in the spinal cord gray matter. These roots become nerves that innervate (transmit nerve impulses to) muscles and organs throughout the body."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_21c/brain_mind/nervoussystemrev1.shtml", "passage_text": "Neurons. Neurons carry impulses from one place to another, around the many parts of the nervous system. They connect receptors to the central nervous system and also connect one part of the nervous system to another, for example in the brain and spinal cord. They also carry impulses from the nervous system to effector organs, such as muscles and glands. When neurons are stimulated they transmit an electrical impulse. The diagram below shows a motor neuron. It has a nucleus [nucleus: The central part of an atom."}]