[{"url": "http://www.thecandidadiet.com/what-is-candida-albicans/", "passage_text": "Candida Albicans is an opportunistic fungus (or form of yeast) that is the cause of many undesirable symptoms ranging from fatigue and weight gain, to joint pain and gas. The Candida Albicans yeast is a part of the gut flora, a group of microorganisms that live in your mouth and intestine. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/oral-thrush/basics/definition/CON-20022381", "passage_text": "Oral thrush. Oral thrush — also called oral candidiasis (kan-dih-DIE-uh-sis) — is a condition in which the fungus Candida albicans accumulates on the lining of your mouth. Candida is a normal organism in your mouth, but sometimes it can overgrow and cause symptoms. Oral thrush causes creamy white lesions, usually on your tongue or inner cheeks. Sometimes oral thrush may spread to the roof of your mouth, your gums or tonsils, or the back of your throat. "}, {"url": "https://en.wikipedia.org/wiki/Oral_candidiasis", "passage_text": "That is, oral candidiasis is a mycosis (yeast/fungal infection) of Candida species on the mucous membranes of the mouth. Candida albicans is the most commonly implicated organism in this condition. "}, {"url": "http://www.cdc.gov/fungal/diseases/candidiasis/index.html", "passage_text": "Photomicrograph of the fungus Candida albicans. Candidiasis is a fungal infection caused by yeasts that belong to the genus Candida. There are over 20 species of Candida yeasts that can cause infection in humans, the most common of which is Candida albicans. Candida yeasts normally live on the skin and mucous membranes without causing infection; however, overgrowth of these organisms can cause symptoms to develop."}, {"url": "http://www.medicinenet.com/thrush/article.htm", "passage_text": "1 Thrush (oropharyngeal candidiasis) is a medical condition in which a fungus called Candida albicans overgrows in the mouth and throat. 2  Thrush may be caused by a variety of factors, including illness, pregnancy, medications, smoking, or dentures. Thrush facts. 1  Thrush (oropharyngeal candidiasis) is a medical condition in which a fungus called Candida albicans overgrows in the mouth and throat. 2  Thrush may be caused by a variety of factors, including illness, pregnancy, medications, smoking, or dentures."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/guide/candidiasis-yeast-infection", "passage_text": "But certain medicines and health problems can cause more yeast to grow, particularly in warm, moist body areas. This can cause uncomfortable and sometimes dangerous symptoms. There are several types of candidiasis 1  : If it is in the mouth or throat, it is called oral candidiasis, oropharyngeal candidiasis, or thrush. 2  If it affects the genital area, it is called a yeast infection. 3  If yeast infects the skin on a baby's bottom area, it causes a diaper rash. 4  If the infection enters your bloodstream, it is called invasive ... 1 If it is in the mouth or throat, it is called oral candidiasis, oropharyngeal candidiasis, or thrush. 2  If it affects the genital area, it is called a yeast infection. 3  In women, it may be called a vulvovaginal yeast infection. 4  If yeast infects the skin on a baby's bottom area, it causes a diaper rash"}, {"url": "http://medical-dictionary.thefreedictionary.com/Candida+albicans", "passage_text": "Candida. a genus of yeast, commonly part of the normal flora of the mouth, skin, intestinal tract and vagina, but can cause a variety of diseases. Most infections are associated with predisposing factors, particularly immune suppression. Only C. albicans is commonly associated with disease. See also candidiasis. Candida albicans. causes thrush in the mouth, crop, proventriculus and the gizzard of birds, and stomatitis, pneumonia and miscellaneous infections in other species. See candidiasis. Previously called Monilia albicans."}, {"url": "http://umm.edu/health/medical/altmed/condition/candidiasis", "passage_text": "Candidiasis is an infection caused by a yeast-like fungus called Candida albicans. It can infect the mouth, vagina, skin, stomach, and urinary tract. "}]