[{"url": "https://en.wikibooks.org/wiki/Organic_Chemistry/Amines", "passage_text": "Amines are organic compounds which contain and are often actually based on one or more atoms of nitrogen. Structurally amines resemble ammonia in that the nitrogen can bond up to three hydrogens, but amines also have additional properties based on their carbon connectivity."}, {"url": "http://psychology.wikia.com/wiki/Amines", "passage_text": "Structurally amines resemble ammonia, wherein one or more hydrogen atoms are replaced by organic substituents such as alkyl and aryl groups. An important exception to this rule is that compounds of the type RC(O)NR 2, where the C(O) refers to a carbonyl group, are called amides rather than amines."}, {"url": "http://www.innovateus.net/science/what-are-amines", "passage_text": "Amines are organic molecules containing nitrogen and are relatives of ammonia. In amines one of the hydrogen atoms on the nitrogen is replaced with a hydrocarbon group. Depending on how many hydrogens have been replaced by the hydrocarbon group they have been classified into Primary, secondary and tertiary amines. Amines have single bonds between carbon and nitrogen."}, {"url": "http://chemistry.about.com/od/chemistryglossary/g/amine-definition.htm", "passage_text": "Definition: An amine is a compound in which one or more of the hydrogen atoms in ammonia have been replaced by an organic functional group. Amines are generally weak bases. Further, most amines are organic bases. Amines have the prefix amino-or the suffix-amine included in their name. Examples: Methylamine is an amine."}, {"url": "http://www.innovateus.net/science/what-are-amines", "passage_text": "A) Primary amines: Primary amines are formed when one of three hydrogen atoms in ammonia is substituted by an alkyl group which means the formula of the primary amine will be RNH2 where R is an alkyl group. Significant primary alkyl amines encompass methylamine (CH3NH2), ethanolamine (2-aminoethanol)."}, {"url": "http://chemed.chem.purdue.edu/genchem/topicreview/bp/2organic/amines.html", "passage_text": "Amines are derivatives of ammonia in which one or more hydrogen atoms are replaced by alkyl groups. We indicate the degree of substitution by labeling the amine as either primary (RNH 2), secondary (R 2 NH), or tertiary (R 3 N). The common names of these compounds are derived from the names of the"}]