[{"url": "http://www.techypcapps.com/facetime-for-pc-windows-download/", "passage_text": "One of the most striking advantages of using Facetime app on your Windows PC is that being a non-IOS user, you still get to use this wonderful app. Once you have downloaded the app for your PC you can call your friends & family at free of cost. The app is the default video calling app for iPhone and iPad. Features of Facetime for PC: The app is very simple & it’s free of cost. To make use of this app you need Wi-Fi data connection & you can njoy the conversations with your friends & family via video conferencing. The minimum requirements for Facetime PC app are as follows. 1  Windows XP/7/8/Vista."}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows_7-windows_programs/how-to-set-up-facetime-on-my-window-7-of-toshiba/564d1321-88d2-418c-838c-40ae904279d0", "passage_text": "While Facetime isn't available for Windows, Skype runs on both platforms. You can find a link to Skype for the iPad here: http://itunes.apple.com/us/app/skype-for-ipad/id442012681?mt=8 Your friend's son should be able to install Skype on your friend's iPad easily through the iTunes Store. "}, {"url": "http://www.answers.com/Q/Where_can_you_download_facetime_for_windows", "passage_text": "If you are using a Mac, you can download the FaceTime app of the Mac App Store (You may need to update you Mac Software If you do not have a Mac App Store). On a IPhone 4 or i … Phone 4s to FaceTime select the contact you want to call in the Phone App or in the Contacts App. Instead of taping on their phone number, scroll down and you will see a button that says FaceTime. You must be connected to a Wi-Fi to use FaceTime."}, {"url": "http://www.apple.com/mac/facetime/", "passage_text": "FaceTime for Mac makes it possible to talk, smile, and laugh with anyone on an iPad, iPhone, iPod touch, or Mac with a built-in FaceTime camera. * So you can catch up, hang out, joke around, and stay in touch with just a click. Sure, it’s great to hear a voice. But it’s even better to see the face that goes with it. FaceTime works perfectly with Contacts and Address Book so you don’t have to enter your contacts from scratch. Click her phone number if you want to call her iPhone. To call her iPad, iPod touch, or Mac, use her email address. An invitation pops up on her screen."}, {"url": "http://www.idganswers.com/question/7844/is-there-any-way-to-use-facetime-on-a-windows-pc", "passage_text": "Facetime is an app only for apple devices and it cant be used on windows. But i think that if there is a version of itunes for windows there will be soon a version of facetime also for windows. You cant install facetime on any version of windows. "}, {"url": "http://www.apple.com/mac/facetime/", "passage_text": "Now FaceTime for Mac supports video calls up to 720p. All you need is an iMac, MacBook Pro, or MacBook Air with a built-in FaceTime HD camera, and your calls display with next-best-thing-to-real-life clarity. FaceTime works perfectly with Contacts and Address Book so you don’t have to enter your contacts from scratch. Click her phone number if you want to call her iPhone. To call her iPad, iPod touch, or Mac, use her email address. An invitation pops up on her screen."}, {"url": "https://www.apple.com/uk/mac/facetime/", "passage_text": "Now your smile goes even further. FaceTime for Mac makes it possible to talk, smile and laugh with anyone on an iPad, iPhone, iPod touch or Mac with a built-in FaceTime camera. * So you can catch up, hang out, joke around and stay in touch with just a click. Of course, it’s great to hear a voice. "}, {"url": "http://ipod.about.com/od/usingios4/qt/Facetime-On-Windows.htm", "passage_text": "Apple's FaceTime video calling technology is one of the flashiest features of the iPhone. In Feb. 2011, Apple released a FaceTime app for the Mac OS, allowing users to make video calls between any iOS devices and Macs running FaceTime. Even though FaceTime doesn't work on Windows, there are some other programs that offer similar features and that work across many operating systems. If you want to make video calls using Windows, Android, Mac OS X, or iOS, try these programs: 1  iMovicha-A free video chat app for iOS, Windows Phone, Android, Mac OS X, and Windows. 2  Like Facetime, iMovicha works over 3G and 4G LTE cellular data networks, not just Wi-Fi"}, {"url": "http://www.techypcapps.com/facetime-for-pc-windows-download/", "passage_text": "Once you have downloaded the Facetime app for your Windows 7/8/Xp you can call your friends & family for free of cost. It will use front-facing camera of your Laptop/PC/Desktop when you are talking to your friend or relative. Features of Facetime for PC: The app is very simple & it’s free of cost. To make use of this app you need Wi-Fi data connection & you can njoy the conversations with your friends & family via video conferencing. The minimum requirements for Facetime PC app are as follows. 1  Windows XP/7/8/Vista."}]