[{"url": "http://www.wisegeekhealth.com/what-is-a-transmetatarsal-amputation.htm", "passage_text": "Physical therapy sessions are often important to help people who have undergone transmetatarsal amputations learn to walk comfortably. Diabetics are at risk of developing poor circulation in the feet, which can lead to the need for a transmetatarsal amputation. Diabetics should inspect all parts of the legs and feet for sores or wounds on a regular basis."}, {"url": "http://emedicine.medscape.com/article/1839900-overview", "passage_text": "Transmetatarsal amputation (TMA) is a relatively common operation that is performed to safeguard limb viability. A curved fish-mouth incision is made just proximal to the infected tissue of the foot (see the image below). The incision runs from the fifth metatarsal midshaft laterally to the midshaft of the first metatarsal medially through a midplane axis."}, {"url": "http://www.wisegeekhealth.com/what-is-a-transmetatarsal-amputation.htm", "passage_text": "A transmetatarsal amputation is a surgical procedure to remove the forefoot in cases where the tissues in a patient's foot have been injured beyond repair. It is more extreme than a toe amputation, but preserves more of the foot than a full foot amputation, and can help the patient remain more mobile after the surgery. Diabetics are at risk of developing poor circulation in the feet, which can lead to the need for a transmetatarsal amputation. Diabetics should inspect all parts of the legs and feet for sores or wounds on a regular basis."}, {"url": "https://en.wikipedia.org/wiki/Amputation", "passage_text": "For the band, see Amputated (band) . Amputation is the removal of a limb by trauma, medical illness, or surgery. As a surgical measure, it is used to control pain or a disease process in the affected limb, such as malignancy or gangrene. In some countries, amputation of the hands, feet or other body parts is or was used as a form of punishment for people who committed crimes. Amputation has also been used as a tactic in war and acts of terrorism; it may also occur as a war injury."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0891842205000273", "passage_text": "In 1855, Bernard and Huete [1] originally described the first transmetatarsal amputation (TMA) in a patient with trench foot. In 1949, McKittrick et al [2] applied TMA for management of gangrene and diabetic foot infections. Example of a failed fifth toe amputation secondary to infection that required a TMA. TMA is indicated for severe trauma to the distal forefoot that is unsalvageable (Fig. 3). Trauma can be the result of a motorcycle or car accident or lawnmower, industrial, gunshot, or thermal injuries."}, {"url": "http://www.wisegeekhealth.com/what-is-a-transmetatarsal-amputation.htm", "passage_text": "After a transmetatarsal amputation, patients can experience varying pain levels. It is usually necessary to keep weight off the foot for comfort at first and there is a risk of developing neurological problems like pain signals that make the patient feel like the missing part of the foot is still there. Diabetics are at risk of developing poor circulation in the feet, which can lead to the need for a transmetatarsal amputation. Diabetics should inspect all parts of the legs and feet for sores or wounds on a regular basis."}, {"url": "http://emedicine.medscape.com/article/1829931-technique", "passage_text": "For a disarticulation or a transmetatarsal amputation, a long plantar flap is the best choice. Markup for second-toe amputation (fish-mouth skin excision): anterior view of (dry) gangrenous toe. Markup for second-toe amputation: posterior view. Adjacent toe amputations: anterior view of markup. Steps common to all toe amputations. Incision lines are marked on the skin as appropriate for the planned amputation (see the images below). For a partial toe amputation, a plantar-based flap is commonly used. However, several other possibilities exist (eg, dorsal flap, side-to-side flap, and fish-mouth flap)."}, {"url": "http://emedicine.medscape.com/article/1829931-technique", "passage_text": "Amputation of adjacent toes at metatarsophalangeal joint using fish-mouth incisions. Revision of transmetatarsal amputation. After informed consent has been obtained and the patient has been adequately anesthetized, a sterile field is set up so that the surgeon has access to the entire foot on the affected side. Steps common to all toe amputations. Incision lines are marked on the skin as appropriate for the planned amputation (see the images below). For a partial toe amputation, a plantar-based flap is commonly used. However, several other possibilities exist (eg, dorsal flap, side-to-side flap, and fish-mouth flap)."}, {"url": "http://emedicine.medscape.com/article/1839900-overview", "passage_text": "Transmetatarsal Amputation. A curved fish-mouth incision is made just proximal to the infected tissue of the foot (see the image below). The incision runs from the fifth metatarsal midshaft laterally to the midshaft of the first metatarsal medially through a midplane axis. Alternatively, a dorsal incision is made transversely, with the residual plantar flap left longer to allow for closure"}]