[{"url": "https://en.wikipedia.org/wiki/Salmonella", "passage_text": "Infection with nontyphoidal serovars of Salmonella will generally result in food poisoning. Infection usually occurs when a person ingests foods that contain a high concentration of the bacteria. Infants and young children are much more susceptible to infection, easily achieved by ingesting a small number of bacteria. There are two species of Salmonella, Salmonella bongori and Salmonella enterica. Salmonella enterica is further divided into six subspecies and over 2500 serovars."}, {"url": "https://en.wikipedia.org/wiki/Salmonella", "passage_text": "Most cases of invasive nontyphoidal salmonella infection (iNTS) are caused by S Typhimurium or S Enteritidis. A new form of Salmonella Typhimurium (ST313) emerged in the southeast of the African continent 75 years ago, followed by a second wave which came out of central Africa 18 years later. There are two species of Salmonella, Salmonella bongori and Salmonella enterica. Salmonella enterica is further divided into six subspecies and over 2500 serovars."}, {"url": "http://www.foodborneillness.com/salmonella_food_poisoning/", "passage_text": "Symptoms of Salmonella infection, or Salmonellosis, range widely, and are sometimes absent altogether. The most common symptoms include diarrhea, abdominal cramps, and fever. Typical Symptoms of Salmonella infection: Appear 6 to 72 hours after eating contaminated food and last for 3 to 7 days without treatment. 1  Diarrhea. 2  Abdominal Cramps. 3  Fever of 100 F to 102 F. "}, {"url": "http://www.cdc.gov/salmonella/general/index.html", "passage_text": "There are many different kinds of Salmonella bacteria. Salmonella serotype Typhimurium [PDF - 15 pages] and Salmonella serotype Enteritidis [PDF - 15 pages] are the most common in the United States. Salmonella infections are more common in the summer than winter. Learn more about Salmonella serotypes"}, {"url": "http://www.about-salmonella.com/", "passage_text": "The term Salmonella refers to a group or family of bacteria that variously cause illness in humans. Salmonella serotype typhimurium and Salmonella serotype Enteritidis are the most common in the United States. [5, 15, 26] Salmonella javiana is the fifth most common serotype in the United States and accounted for 3.4% of Salmonella isolates reported to the CDC during 2002. [24] According to one study, During the 1980s, S. Enteritidis emerged as an important cause of human illness in the United States."}, {"url": "https://answers.yahoo.com/question/index?qid=20100201122153AAxPqHy", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: The most common is Salmonella enterica Serovar Typhimurium The more severe relative that causes typhoid fever is Salmonella enterica Serovar Typhi For both enterica is the species name. Source(s): Microbiologist. Weise Ente · 6 years ago. "}, {"url": "http://genome.wustl.edu/genomes/detail/salmonella-enterica-serovar-typhimurium-strain-lt2/", "passage_text": "Biology. Salmonella is a Gram-negative bacterium, a cylindrical rod of size about 2 microns by 0.5 microns, thus much smaller than the cells of higher organisms such as humans. In culture, the bacterium will grow on artificial media to form colonies. "}, {"url": "https://en.wikipedia.org/wiki/Salmonella", "passage_text": "Salmonella /ˌsaelməˈnɛlə/ ˌsælməˈnɛlə is a genus of-rod (shaped) bacillus bacteria of The enterobacteriaceae. Family there are two species Of, Salmonella salmonella bongori And salmonella. enterica There are two species of Salmonella, Salmonella bongori and Salmonella enterica. Salmonella enterica is further divided into six subspecies and over 2500 serovars."}, {"url": "http://www.answers.com/Q/What_is_the_common_name_for_Salmonella", "passage_text": "Salmonella is a type of bacteria that can cause food poisoning, an infection in the small intestine. The most common sources of salmonella are reptiles (they carry the bacteri … a so washing hands after handling them is cirtical), and improperly prepared food (especially poultry and eggs). Recently there has been an outbreak of salmonella in ground turkey meat (August 2011). Answered."}, {"url": "http://www.medicinenet.com/salmonella_food_poisoning_salmonellosis/article.htm", "passage_text": "Different types of the Salmonella bacteria can cause the illness. The two most common types in the U.S. are S. typhimurium and S. enteritidis. Specific strains of the bacteria can be responsible for outbreaks of the disease. For example, an outbreak in 2013-2014 was linked to multidrug-resistant Salmonella Heidelberg. Salmonella infection, or salmonellosis, is sometimes referred to as Salmonella food poisoning. Salmonella are a type of bacteria that have been known to cause illness for over 125 years."}]