[{"url": "http://www.thefreedictionary.com/plentiful", "passage_text": "plen′ti·ful·ness n. Synonyms: plentiful, abundant, ample, copious, plenteous. These adjectives mean being fully as much as one needs or desires: a plentiful supply; the artist's abundant talent; ample space; copious provisions; a plenteous crop of wheat."}, {"url": "http://dictionary.reverso.net/english-synonyms/abundant", "passage_text": "abundant. English Collins Dictionary-English synonyms & Thesaurus &nbsp. abundant Something that is abundant is present in large quantities. adj (=plentiful) There is an abundant supply of cheap labour..., Birds are abundant in the tall vegetation. abundant."}, {"url": "http://dictionary.reverso.net/english-synonyms/plentiful", "passage_text": "English Collins Dictionary-English synonyms & Thesaurus &nbsp. plentiful Things that are plentiful exist in such large amounts or numbers that there is enough for people's wants or needs. adj usu v-link ADJ Fish are plentiful in the lake., ...a plentiful supply of vegetables and salads and fruits."}, {"url": "http://www.english-for-students.com/Plentiful.html", "passage_text": "Antonyms are the negative connotation of a particular word. An Antonym is a word or phrase that is opposite in meaning to a particular word or a phrase in the same language. So enjoy this list and then get around for preparing your own list of Synonyms and Antonyms. There is no better way of boosting your words power."}, {"url": "http://thesaurus.yourdictionary.com/plentiful", "passage_text": "Another word for plentiful. LINK / CITE ADD TO WORD LIST. plentiful abundant ample copious plenteous. These adjectives mean being fully as much as one needs or desires: a plentiful supply; the artist's abundant talent; ample space; copious provisions; a plenteous crop of wheat."}, {"url": "http://www.english-for-students.com/Plentiful.html", "passage_text": "(Adjective) To come out of this problem of scarcity of water, what we need is plentiful supply of river water at once. Synonyms: Abundant Lavish Replete Luxuriant Bountiful Ample Plenteous Teeming Sufficient Contextual Examples: Oranges are abundant in Spain."}]