[{"url": "http://www.payscale.com/research/US/Job=School-Based_Occupational_Therapist/Salary", "passage_text": "School-Based Occupational Therapists claiming one to two decades of experience make an estimated median of $64K. In the end, more experience does seem to mean larger paychecks; seasoned School-Based Occupational Therapists with more than 20 years of experience earn a predictably higher median salary of $68K."}, {"url": "http://www.simplyhired.com/salaries-k-school-based-therapist-jobs.html", "passage_text": "Average School Based Therapist Salaries. The average salary for school based therapist jobs is $61,000. Average school based therapist salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term school based therapist anywhere in the job listing."}, {"url": "http://www.simplyhired.com/salaries-k-school-based-occupational-therapist-jobs.html", "passage_text": "Average School Based Occupational Therapist Salaries. The average salary for school based occupational therapist jobs is $42,000. Average school based occupational therapist salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term school based occupational therapist anywhere in the job listing."}, {"url": "http://work.chron.com/school-based-occupational-therapist-salaries-4111.html", "passage_text": "Average Salary. There were 13,280 occupational therapists working in elementary and secondary schools nationwide as of May 2011, according to the Bureau of Labor Statistics. These school-based therapists earned a mean annual wage of $66,880, or $32.15 an hour."}, {"url": "http://work.chron.com/school-based-occupational-therapist-salaries-4111.html", "passage_text": "The remaining 1,260 elementary and secondary school-based occupational therapists worked for private schools. These therapists earned a mean annual wage of $67,550, or $32.48 an hour, according to the bureau. This was about 1 percent higher than the average salaries for those working in local public school districts."}]