[{"url": "https://en.wikipedia.org/wiki/Sausage", "passage_text": "Blood sausage, morcilla, is found in both cured and fresh varieties. They are made with pork meat and blood, usually adding rice, garlic, paprika and other spices. There are many regional variations, and in general they are either fried or cooked in cocidos. 1 Bulk sausage, or sometimes sausage meat, refers to raw, ground, spiced meat, usually sold without any casing. 2  Vegetarian sausage are made without meat, for example, based on soya protein or tofu, with herbs and spices."}, {"url": "https://en.wikipedia.org/wiki/Sausage", "passage_text": "In most areas, sausage meat for frying and stuffing into poultry or other meats is sold as ground, spiced meat without casing. Battered sausage, consisting of a sausage dipped in batter, and fried, is sold throughout Britain from Fish and Chip shops. 1 Bulk sausage, or sometimes sausage meat, refers to raw, ground, spiced meat, usually sold without any casing. 2  Vegetarian sausage are made without meat, for example, based on soya protein or tofu, with herbs and spices."}, {"url": "https://en.wikipedia.org/wiki/Sausage", "passage_text": "A sausage is a food usually made from ground meat, often pork, beef or veal, along with salt, spices and breadcrumbs, with a skin around it. Typically, a sausage is formed in a casing traditionally made from intestine, but sometimes synthetic. 1 Bulk sausage, or sometimes sausage meat, refers to raw, ground, spiced meat, usually sold without any casing. 2  Vegetarian sausage are made without meat, for example, based on soya protein or tofu, with herbs and spices."}, {"url": "http://www.fsis.usda.gov/wps/portal/fsis/topics/food-safety-education/get-answers/food-safety-fact-sheets/meat-preparation/sausages-and-food-safety/ct_index", "passage_text": "1 Italian Sausage Products are cured or uncured sausages containing at least 85% meat, or a combination of meat and fat, with the total fat content constituting not more than 35% of the finished product. 2  It contains salt, pepper, fennel and/or anise and no more than 3% water. If sausages are made in a retail establishment (such as a grocery store, meat market or restaurant) and are sold within the State where the establishment is located, the sausage may be under the jurisdiction of that State's health or agriculture department."}, {"url": "http://www.lets-make-sausage.com/sausage-meat.html", "passage_text": "From the beginning, sausage meat was chosen based on what was available and abundant. Sausage recipes were developed that took advantage of what people had. If pigs were common (as they were in so many areas), people made pork sausage. ...I doubt you would find many traditional Muslim or Jewish pork sausage recipes. Pork. There was a time when most families had a pig or two fattening...and many of them found their way into sausage meat. the recipes that we still use."}, {"url": "http://sausageandmeat.com/", "passage_text": "The provocative new meatery from the mind of Scott Slater. S&M Sausage & Meat is located in the center of historic North City San Diego. Designed to be the newest landmark for experimental dining, featuring exotic game meats, chef conceived sausages, bacon and charcuterie. "}, {"url": "https://en.wikipedia.org/wiki/Sausage", "passage_text": "A sausage consists of meat, cut into pieces or ground, and filled into a casing, with other ingredients. Ingredients may include a cheap starch filler such as breadcrumbs, seasoning and flavourings such as spices, and sometimes others. The meat may be from any animal, but is often pork, beef, or veal. 1 Bulk sausage, or sometimes sausage meat, refers to raw, ground, spiced meat, usually sold without any casing. 2  Vegetarian sausage are made without meat, for example, based on soya protein or tofu, with herbs and spices."}, {"url": "http://www.thefreedictionary.com/sausage", "passage_text": "sausage-highly seasoned minced meat stuffed in casings. meat-the flesh of animals (including fishes and birds and snails) used as food. sausage meat-any meat that is minced and spiced and cooked as patties or used to fill sausages. black pudding, blood pudding, blood sausage-a black sausage containing pig's blood and other ingredients. Bologna sausage, bologna-large smooth-textured smoked sausage of beef and veal and pork. sausage. n. 1. (Cookery) finely minced meat, esp pork or beef, mixed with fat, cereal or bread, and seasonings (sausage meat), and packed into a tube-shaped animal intestine or synthetic casing. 2. an object shaped like a sausage."}, {"url": "http://www.meatsandsausages.com/sausage-recipes", "passage_text": "Sausage recipes will make quality sausages only if sausage making rules are obeyed. The same recipe can produce a different type of sausage just by changing the manufacturing process. And whether you want to apply smoke or not is entirely up to you. There are books which list thousands of sausage recipes such as Sausage and Processed Meat Formulations by Herbert Ockermann, but don't tell you how to make a great product."}, {"url": "http://www.meatsandsausages.com/", "passage_text": "1 Cooked sausages that were submitted to 160º F (72º C) internal meat temperature before storing them. 2  Most sausages such as smoked sausages, liver sausages, blood sausages, head cheeses, emulsified sausages (hot dog, bologna, mortadela), meat loaves and pates fit into this group. This group covers every other sausage type regardless how it was made (smoked or not, cured or not) or what meats and ingredients were used. This group is further subdivided into: 1 "}]