[{"url": "http://www.landscapingnetwork.com/paving/permeable.html", "passage_text": "Grass Pavers: Grass pavers are another form of permeable paving. A patio or driveway made of grass pavers will closely resemble a lawn. Open cells within the pavers are filled with dirt and then planted with grass seed. This paving option doesn’t just look good; it’s beneficial to our environment. Consider permeable paving in large walkways or driveways and make sure that a 6-inch gravel bed is immediately below the porous material. From the top down there are four layers to permeable paving."}, {"url": "https://en.wikipedia.org/wiki/Permeable_paving", "passage_text": "Some estimates put the cost of permeable paving at two to three times that of conventional asphalt paving. Using permeable paving, however, can reduce the cost of providing larger or more stormwater BMPs on site, and these savings should be factored into any cost analysis."}, {"url": "http://www.rubberflooringinc.com/interlocking-tile/paver-tiles-west-coast.html", "passage_text": "Rubber paver tiles are are easy to clean and maintain. Maintenance of these outdoor deck and patio tiles typically includes: 1  Sweeping the surface of the tile with a stiff outdoor bristle broom when necessary. 2  Spraying or hosing off the tiles with clean water as needed. 3  Vacuuming the surface of the recycled rubber tiles with a shop vac if needed. 1 1/2 thick paver tiles are typically installed by adhering the tiles to a substrate such as an outdoor concrete pad, wood asphalt, or compacted gravel. 2  A polyurethane adhesive is normally recommended since they often can handle freezing and thawing and are moisture cured."}, {"url": "https://en.wikipedia.org/wiki/Permeable_paving", "passage_text": "Permeable paving is a range of sustainable materials and techniques for permeable pavements with a base and subbase that allow the movement of stormwater through the surface. In addition to reducing runoff, this effectively traps suspended solids and filters pollutants from the water. Using permeable paving, however, can reduce the cost of providing larger or more stormwater BMPs on site, and these savings should be factored into any cost analysis."}, {"url": "http://www.kirklandwa.gov/Assets/Planning/Planning+PDFs/Pervious+surfaces+faq.pdf", "passage_text": "A pervious surface is a surface that allows infiltration through the pavement section. Allowable pervious surfaces for a lot coverage credit are porous concrete, porous asphalt, permeable pavers, modular grid pavement, and grass modular grid pavement per Appendix C of the 2009 King County Surface Water Design Manual. Below explains general criteria to consider a surface pervious"}, {"url": "http://www.city-data.com/forum/raleigh-durham-chapel-hill-cary/1587223-what-arent-impervious-surfaces-durham.html", "passage_text": "A: An impervious surface is a hard surface that does not let water soak into the ground or greatly reduces the amount of water that soaks into the ground. Examples include roofs, solid decks, patios, sidewalks, driveways, parking areas, and roads. Compacted gravel is considered an impervious surface. A: Areas covered with grass or that are planted (such as forests or gardens) are not counted as impervious surface. For billing purposes, wooden decks (without roofs) and the area of swimming pools that actually hold water are considered pervious."}, {"url": "http://stormwater.wef.org/2013/10/pervious-permeable-porous-pavers-really/", "passage_text": "Permeable pavers are composed of a layer of concrete or fired clay brick. The pavers are separated by joints filled with crushed aggregate. Permeable pavers are different from pervious and porous pavers in that rainwater passes around the paver opposed to through it. Permeable is a term used to describe paving methods for roads, parking lots, and walkways. This type of system allows the movement of water and air around the paving material. Water enters the joints between the solid impervious pavers and flows through the paver system. There is an obvious and distinct difference between pervious, permeable, and porous pavers. Each possesses certain physical and aesthetic qualities that need to be considered prior to project design and installation."}, {"url": "http://www.nexaninc.com/products/decking", "passage_text": "LockDry® Decking not only creates a beautifully finished and gapless deck-but when installed on a 2nd or 3rd level deck, the area underneath is instantly transformed into a dry outdoor patio, carport or storage. This allows home owners the added advantage of having more usable outdoor deck space no matter the weather. "}, {"url": "http://www.kleinberg.com/permeable.htm", "passage_text": "In a permeable system the base is constructed of clean stone over an un-compacted subsoil that will adsorb the rainwater that comes through. The base stone layers are constructed thick enough to hold up to the traffic that it will receive, and the base stone is compacted. The pavers are installed on a layer of 3/8-in. stone (not sand) with larger joint than with impervious pavers and these joints are filled with small stone (never sand) to allow for water to run through. Some additional benefits of permeable paving: Environmentally friendly. "}]