[{"url": "http://searchsoa.techtarget.com/definition/white-paper", "passage_text": "Typically, a white paper explains the results, conclusions, or construction resulting from some organized committee or research collaboration or design and development effort. In information technology, a white paper is often a paper written by a lead product designer to explain the philosophy and operation of a product in a marketplace or technology context."}, {"url": "http://definitions.uslegal.com/w/white-paper/", "passage_text": "White Paper Law & Legal Definition. A white paper is generally an authoritative report. It often states an entity's position or philosophy about a social, political, or other subject, or a general explanation of an architecture, framework, or product technology. Typically, a white paper explains the results, conclusions, or construction resulting from a collaborative effort by a group. In information technology, a white paper is often a paper written by a top product designer which explains the philosophy and use of a product in a marketplace or technology setting. In government, a white paper usually refers to a policy or position paper"}, {"url": "https://owl.english.purdue.edu/owl/owlprint/546/", "passage_text": "Summary: A white paper is a certain type of report that is distinctive in terms of purpose, audience, and organization. This resource will explain these issues and provide some other tips to enhance white paper content. "}, {"url": "https://owl.english.purdue.edu/owl/resource/546/1", "passage_text": "White Paper: Purpose and Audience. Summary: A white paper is a certain type of report that is distinctive in terms of purpose, audience, and organization. This resource will explain these issues and provide some other tips to enhance white paper content. Contributors: Sachiko Sakamuro, Karl Stolley, Charlotte Hyde. "}, {"url": "http://www.merriam-webster.com/dictionary/white%20paper", "passage_text": "Definition of WHITE PAPER. 1. : a government report on any subject; especially: a British publication that is usually less extensive than a blue book. 2. : a detailed or authoritative report. ADVERTISEMENT"}, {"url": "http://searchsoa.techtarget.com/definition/white-paper", "passage_text": "A white paper is an article that states an organization's position or philosophy about a social, political, or other subject, or a not-too-detailed technical explanation of an architecture, framework, or product technology. In information technology, a white paper is often a paper written by a lead product designer to explain the philosophy and operation of a product in a marketplace or technology context."}, {"url": "http://www.investopedia.com/terms/w/whitepaper.asp", "passage_text": "DEFINITION of 'White Paper'. An informational document issued by a company to promote or highlight the features of a solution, product or service. White papers are sales and marketing documents used to entice or persuade potential customers to learn more about or purchase a particular product, service, technology or methodology. The white paper is used to inform and persuade the other company that a certain offering (such as a product or technology) is superior for solving a particular business problem or addressing a certain challenge."}, {"url": "https://en.wikipedia.org/wiki/White_paper", "passage_text": "For other uses, see White paper (disambiguation) . A white paper is an authoritative report or guide informing readers in a concise manner about a complex issue and presenting the issuing body's philosophy on the matter. It is meant to help readers understand an issue, solve a problem, or make a decision. White papers are a ... tool of participatory democracy ... not [an] unalterable policy commitment. White Papers have tried to perform the dual role of presenting firm government policies while at the same time inviting opinions upon them.."}]