[{"url": "http://asiasociety.org/geographical-setting-silk-roads", "passage_text": "Geographical Setting of the Silk Roads. Silk Road in Sumur, India today (sanjoyg/flickr). by John Major. The term Silk Road denotes a network of trails and trading posts, oases and emporia connecting East Asia to the Mediterranean. Trade along the Silk Road waxed or waned according to conditions in China, Byzantium, Persia, and other regions and countries along the way. There were always competing or alternative routes, by land and sea, to absorb long distance Eurasian trade when conditions along the Silk Road were unfavorable."}, {"url": "http://womeninworldhistory.com/silk-road-12.html", "passage_text": "Byzantium at the Terminus of the Silk Route. Irene in a panel in the famous Pala dOro St. Marks Basilica, Venice. Byzantium and the Silk Trade: Byzantium was one of the most important western terminals of the Silk Road. Constantinople, the capital, stood at the crossroads of Europe and Asia where many sea and overland trade routes linked the two regions"}, {"url": "http://www.answers.com/Q/What_regions_did_the_silk_road_connect", "passage_text": "The Silk Road extended from Southern Europe through Arabia, Egypt, Persia, India till it reached China. It connected the Roman empire and the Chinese empires. See the related link below for a map. Axum was located just south of Kush on a high plateau. Today the countries of Ethiopia and Eritrea are located here. Axum … had access to the Red Sea. By 50 CE, traders, using the Silk Road, came to Axum for its salt, gold, and gems."}, {"url": "http://www.answers.com/Q/Which_continents_were_connected_by_the_silk_road", "passage_text": "The two continents connected were Europe and Asia. The silk road starts at Antioch, Europe to Luoyang, China. The two goods that Marco Polo brought back were silk and spices. The Silk Road was not just one road-it was a series of routes  that connected China to various countries south and west of it.  Using the modern names of present-day count … ries to describe the  routes is the easiest way to talk about which countries were  connected."}, {"url": "http://www.ancient.eu/Silk_Road/", "passage_text": "While many different kinds of merchandise traveled along the Silk Road, the name comes from the popularity of Chinese silk with the west, especially with Rome. The Silk Road routes stretched from China through India, Asia Minor, up throughout Mesopotamia, to Egypt, the African continent, Greece, Rome, and Britain. The northern Mesopotamian region (present day Iran) became China’s closest partner in trade, as part of the Parthian Empire, initiating important cultural exchanges. As the Silk Road was not a single thoroughfare from east to west, the term 'Silk Routes’ has become increasingly favored by historians, though 'Silk Road’ is the more common and recognized name."}, {"url": "http://www.ancient.eu/Silk_Road/", "passage_text": "The Silk Road was a network of trade routes, formally established during the Han Dynasty of China, which linked the regions of the ancient world in commerce. As the Silk Road was not a single thoroughfare from east to west, the term 'Silk Routes’ has become increasingly favored by historians, though 'Silk Road’ is the more common and recognized name."}, {"url": "http://www.answers.com/Q/What_regions_did_the_silk_road_connect", "passage_text": "The Silk Road, or Silk Routes, are an extensive interconnected network of trade routes across the Asian continent connecting East, South, and Western Asia with the Mediterrane … an world, including North Africa and Europe. Axum was located just south of Kush on a high plateau. Today the countries of Ethiopia and Eritrea are located here. Axum … had access to the Red Sea. By 50 CE, traders, using the Silk Road, came to Axum for its salt, gold, and gems."}, {"url": "http://www.answers.com/Q/Which_continents_were_connected_by_the_silk_road", "passage_text": "The Silk Road, or Silk Routes, are an extensive interconnected network of trade routes across the Asian continent connecting East, South, and Western Asia with the Mediterrane … an world, including North Africa and Europe. The Silk Road was not just one road-it was a series of routes  that connected China to various countries south and west of it.  Using the modern names of present-day count … ries to describe the  routes is the easiest way to talk about which countries were  connected."}, {"url": "http://www.answers.com/Q/What_regions_did_the_silk_road_connect", "passage_text": "The Silk Road or network of trade routes across the Asian continent connected East, South, and Western Asia with the Mediterranean world, as well as North and Northeast Africa … and Europe. It encouraged development by opening the lands through trade. 2 people found this useful. Axum was located just south of Kush on a high plateau. Today the countries of Ethiopia and Eritrea are located here. Axum … had access to the Red Sea. By 50 CE, traders, using the Silk Road, came to Axum for its salt, gold, and gems."}]