[{"url": "http://www.greatwar.co.uk/poems/john-mccrae-in-flanders-fields.htm", "passage_text": "by John McCrae, May 1915. In Flanders fields the poppies blow. Between the crosses, row on row, That mark our place; and in the sky. The larks, still bravely singing, fly. Scarce heard amid the guns below. We are the Dead. Short days ago. We lived, felt dawn, saw sunset glow, Loved and were loved, and now we lie. In Flanders fields."}, {"url": "https://en.wikipedia.org/wiki/In_Flanders_Fields", "passage_text": "In Flanders Fields is a war poem in the form of a rondeau, written during the First World War by Canadian physician Major John McCrae. He was inspired to write it on May 3, 1915, after presiding over the funeral of friend and fellow soldier Alexis Helmer, who died in the Second Battle of Ypres. In Belgium, the In Flanders Fields Museum in Ypres, named after the poem and devoted to the First World War, is situated in one of Flanders' largest tourist areas. Despite its enduring fame, In Flanders Fields is often ignored by academics teaching and discussing Canadian literature."}, {"url": "http://davesgarden.com/guides/articles/view/1182/", "passage_text": "Here is the poem that he wrote: IN FLANDERS FIELDS. In Flanders fields the poppies blow Between the crosses, row on row, That mark our place; and in the sky The larks, still bravely singing, fly Scarce heard amid the guns below. We are the Dead. Short days ago We lived, felt dawn, saw sunset glow, Loved and were loved, and now we lie In Flanders fields"}, {"url": "https://en.wikipedia.org/wiki/Papaver_rhoeas", "passage_text": "(December 2012). Papaver rhoeas (common names include common poppy, corn poppy, corn rose, field poppy, Flanders poppy, red poppy, red weed, coquelicot, and, due to its odour, which is said to cause them, as headache and headwark) is a herbaceous species of flowering plant in the poppy family, Papaveraceae. This poppy is notable as an agricultural weed (hence the common names including corn and field) and after World War I as a symbol of dead soldiers. Before the advent of herbicides, P. rhoeas sometimes was so abundant in agricultural fields that it could be mistaken for a crop."}, {"url": "http://bobgeorgeff.weebly.com/uploads/1/1/0/7/1107105/molly_poem_analysis.pdf", "passage_text": "The Flanders Fields that the poem is based off of is in Flanders Belgium. John McCrae, the author of the poem is Canadian and the poppies, “Which grow in Flanders fields”1 is now a symbol of remembrance and is on the ten dollar bill in Canada. The Poppies which were mentioned in the poem grew abundantly in Flanders and later they became a symbol of Remembrance Day. The first line of the poem “In Flanders fields the poppies blow”1 where it says poppies blow, it originally said “In Flanders fields the poppies grow”."}, {"url": "https://en.wikipedia.org/wiki/In_Flanders_Fields", "passage_text": "The poem and poppy are prominent Remembrance Day symbols throughout the Commonwealth of Nations, particularly in Canada, where In Flanders Fields is one of the nation's best-known literary works. The poem also has wide exposure in the United States, where it is associated with Memorial Day. In Belgium, the In Flanders Fields Museum in Ypres, named after the poem and devoted to the First World War, is situated in one of Flanders' largest tourist areas. Despite its enduring fame, In Flanders Fields is often ignored by academics teaching and discussing Canadian literature."}, {"url": "http://www.flandershouse.org/in-flanders-fields-poem", "passage_text": "In Flanders Fields is one of the most notable poems written during World War I, perhaps even the most famous war poem of all time. Canadian physician and Lieutenant Colonel John McCrae wrote it on 3 May 1915, after he witnessed the death of his friend, Lieutenant Alexis Helmer, 22 years old, the day before. In Flanders fields the poppies blowBetween the crosses, row on row,That mark our place; and in the skyThe larks, still bravely singing, flyScarce heard amid the guns below. We are the Dead. Short days agoWe lived, felt dawn, saw sunset glow,Loved and were loved, and now we lie,In Flanders fields."}, {"url": "http://www.americanmeadows.com/the-red-poppy", "passage_text": "We shall not sleep, though poppies grow. In Flanders fields. Red Poppy is the symbol of the American Legion, handed out for Memorial Day, and worn in lapels for the same symbolism in Great Britain on Remembrance Day. "}]