[{"url": "http://www.worldatlas.com/webimage/countrys/europe/sicily.htm", "passage_text": "Sicily is Italy's largest island and the largest island in the Mediterranean Sea. It's also a geographical and political region of Italy, famed for its beautiful beaches, cuisine, and fascinating history."}, {"url": "http://www.answers.com/Q/Is_sicily_part_of_Italy", "passage_text": "1 Airports on the Island of Sicily Sicily is one of the autonomous regions in Italy and the largest island in the Mediterranean Sea."}, {"url": "https://en.wikipedia.org/wiki/Sicily", "passage_text": "Sicily has a roughly triangular shape, which earned it the name Trinacria. To the east, it is separated from the Italian region of Calabria by the Strait of Messina, about 3 km (1.9 mi) wide in the north, and about 16 km (9.9 mi) in the southern part."}, {"url": "http://www.answers.com/Q/Is_sicily_part_of_Italy", "passage_text": "Share to: 1  Airports on the Island of Sicily Sicily is one of the autonomous regions in Italy and the largest island in the Mediterranean Sea. 2  Rocky coasts opening up to the emerald sea, delicious cuisine, exquisite win…."}, {"url": "http://www.answers.com/Q/Is_the_island_of_Sicily_part_of_Italy", "passage_text": "Sicily is an autonomous region of Italy. It is an island of southern Italy in the Mediterranean Sea west of the southern end of the Italian peninsula."}, {"url": "http://geography.about.com/od/italymaps/a/Ten-Sicily-Italy-Facts.htm", "passage_text": "It is separated from the mainland of Italy by the Strait of Messina. At their closest points, Sicily and Italy are separated by just 2 miles (3 km) in the northern part of the strait, while in the southern part the distance between the two is 10 miles (16 km)."}, {"url": "http://www.italylogue.com/sicily", "passage_text": "1 The capital of Sicily is Palermo. 2  Sicily is the largest island in the Mediterranean Sea. 3  Sicily is one of the five autonomous regions of Italy. 4  Sicily’s Mount Etna is Europe’s tallest active volcano, and one of the most active in the world."}, {"url": "http://www.italylogue.com/sicily", "passage_text": "1 Sicily is the largest island in the Mediterranean Sea. 2  Sicily is one of the five autonomous regions of Italy. 3  Sicily’s Mount Etna is Europe’s tallest active volcano, and one of the most active in the world."}, {"url": "http://wikitravel.org/en/Sicily", "passage_text": "Sicily [1] (Sicilia) is a rugged and attractive island on the southern tip of Italy, and is one of the country's 20 regions. It is separated from the mainland region of Calabria by the 5 km Straits of Messina."}]