[{"url": "https://en.wikipedia.org/wiki/Flow_Science,_Inc.", "passage_text": "Flow Science, Inc. is a developer of software for computational fluid dynamics, also known as CFD, a branch of fluid mechanics that uses numerical methods and algorithms to solve and analyze problems that involve fluid flows. "}, {"url": "http://www.engr.utexas.edu/features/formula1cfd", "passage_text": "The linchpin of F1's technology is computational fluid dynamics (CFD), a field that utilizes advanced mathematics and computer simulation to model and predict how the laws of physics and racing conditions will affect a race car's performance on race day. While Ferrari, Red Bull and other teams are conducting more CFD runs, they are also limited by F1 regulations in the amount of CFD that can be used. F1's governing body dictates the number of teraflops [computing power] a team can run, as well as the hours of wind tunnel testing performed each week."}, {"url": "http://www.cfd-online.com/Wiki/Introduction_to_CFD", "passage_text": "Fluid dynamics is a field of science which studies the physical laws governing the flow of fluids under various conditions. Great effort has gone into understanding the governing laws and the nature of fluids themselves, resulting in a complex yet theoretically strong field of research. CFD has enabled us to understand the world in new ways. We can now see what it is like to be in a furnace, model how blood flows through our arteries and veins and even create virtual worlds."}, {"url": "http://whatis.techtarget.com/definition/computational-fluid-dynamics-CFD", "passage_text": "Part of the Mathematics glossary: Computational fluid dynamics (CFD) is the use of applied mathematics, physics and computational software to visualize how a gas or liquid flows -- as well as how the gas or liquid affects objects as it flows past. Computational fluid dynamics is based on the Navier-Stokes equations. These equations describe how the velocity, pressure, temperature, and density of a moving fluid are related."}, {"url": "https://en.wikipedia.org/wiki/Computational_fluid_dynamics", "passage_text": "Computational fluid dynamics, usually abbreviated as CFD, is a branch of fluid mechanics that uses numerical analysis and algorithms to solve and analyze problems that involve fluid flows. The fundamental basis of almost all CFD problems are the Navier–Stokes equations, which define any single-phase (gas or liquid, but not both) fluid flow."}, {"url": "http://www3.nd.edu/~gtryggva/CFD-Intro.pdf", "passage_text": "!Using CFD to solve a problem:!Introduction ! Computational Fluid Dynamics!Numerical !Analysis !!!!! Fluid Mechanics!CFD!!!!!!!!!Computer!Science!CFD is an interdisciplinary topic!Introduction ! Computational Fluid Dynamics!Many website contain information about ﬂuid dynamics and computational ﬂuid dynamics speciﬁcally. Computational Fluid Dynamics!Notation: the location of variables on a structured grid! i f, j i f +1, j i f i, j = f (x, y) f i +1, j = f (x + h, y) f i !1, j = f (x ! h, y) f i, j +1 = f (x, y + h) f, j !1 = f (x, y ! h)(x, y) i - 1 i i+!j+ 1! ! ! j! ! j- 1 !"}, {"url": "http://www.qwhatis.com/what-is-cfd/", "passage_text": "CFD is the acronym for computational fluid dynamics, a division of fluid mechanics that uses cutting edge computer technology to represent fluid flowing in a controlled environment and to use this as a means to solve and analyze problems involved in this setup. Fluids can mean gas or liquid or a combination of both. This CFD simulation can be used in a lot of practical applications, to test physical design and performance. The outcome from the practical CFD testing can yield results that can help achieve optimal performance."}, {"url": "http://www.qwhatis.com/what-is-cfd/", "passage_text": "CFD is used in many fields, most obvious of which is in the field of aeronautics, aerospace engineering and aviation where CFD is used to analyze how aircrafts will react to different environments. Other fields which use CFD include physics, chemistry, meteorology and geology. If you like this article or our site. This CFD simulation can be used in a lot of practical applications, to test physical design and performance. The outcome from the practical CFD testing can yield results that can help achieve optimal"}, {"url": "http://www3.nd.edu/~gtryggva/CFD-Course2010/2010-Lecture-1.pdf", "passage_text": "Fluid Mechanics!CFD!Computer!Science!CFD is an interdisciplinary topic!Computational Fluid Dynamics I! Background needed:! Undergraduate Numerical Analysis and Fluid Mechanics!Graduate Level Fluid Mechanics (can be taken concurrently).!Basic computer skills. "}]