[{"url": "http://www.goarmy.com/amedd/nurse.html", "passage_text": "You may choose active duty or serve in the U.S. Army Reserve. As a nurse and an officer on the U.S. Army Reserve health care team, you can continue to work in your own community and serve when needed. And if you have nursing school loans to repay, the Active Duty Health Professions Loan Repayment Program may help you repay up to $120,000 of those loans. The U.S. Army health care team offers one more important benefit."}, {"url": "http://work.chron.com/qualifications-army-nurse-need-7194.html", "passage_text": "Education and Experience. Army nurses are required to have a bachelor's degree in nursing. This degree may be obtained before being commissioned, or you may join the Army ROTC in college, receiving benefits as you complete your degree and pursue your registered nursing license. Those who choose to become an Army nurse through the ROTC program attend a nurse summer training program every summer where they work and receive additional training in an Army hospital."}, {"url": "http://www.ehow.com/how_4927618_become-nurse-military.html", "passage_text": "Education and Licensure. The military requires nurses to have at least a bachelor of science degree in nursing from an accredited university. The degree can usually be completed in four years, and includes classes in anatomy and physiology, microbiology and psychology, as wells as clinical experience. To commission as an officer and nurse in the military, you must be between the ages of 18 and 41, and a citizen of the United States. You must pass a medical exam and physical fitness test. When you join the military, you are required to serve for a period of time according to your contract."}, {"url": "http://www.nmaetc.org/nursing/how-to-become-a-military-nurse/", "passage_text": "A: To become a nurse in the military, you must first complete a nursing degree. You can choose to specialize in a certain nursing field such as mental health or emergency nursing. With your education complete, you can either enroll in an ROTC program, or directly apply via form/application. Just as other nurses, there is a lot of demand for military nurses. These nurses can remain unspecialized or opt for a specialization in critical care, psychiatric or obstetrical care. How to Become a Military Nurse. If you want to become a military nurse, you must provide proof of U.S. citizenship. You also need to have a bachelor's or master's degree in nursing. BSN programs may span over four years, while a master’s degree in nursing can be completed in 1-2 years"}, {"url": "http://www.goarmy.com/amedd/nurse.html", "passage_text": "Learn More. Nurse Benefits. When you become a nurse and an officer in the Army, you’ll enjoy competitive pay and a comprehensive benefits package that includes low-or no-cost medical, dental and life insurance, generous retirement plan options, exciting educational opportunities, financial incentives and much more. And if you have nursing school loans to repay, the Active Duty Health Professions Loan Repayment Program may help you repay up to $120,000 of those loans. The U.S. Army health care team offers one more important benefit."}, {"url": "http://science.howstuffworks.com/military/army-careers/army-nurse-corps3.htm", "passage_text": "Today, more than 40,000 men and women serve in the Army Nurse Corps as nurses, medics, nursing assistants and in many other roles [source: Wiegel ]. As an Army nurse you can serve as an Army Reserve nurse, an Army National Guard nurse or an active duty nurse. Army Reserve nurses serve on a part-time basis as needed by the military. The rest of the time, you're free to pursue a civilian (non-military) career. Reserve nurses can earn up to $10,000 per year (critical care nurses can earn $12,500) for up to three years. "}, {"url": "http://science.howstuffworks.com/military/army-careers/army-nurse-corps2.htm", "passage_text": "Since Army nurses are officers, you'll instead be required to attend a Basic Officer Leader Course to acquaint you with military life. In addition, Army nurses must have a bachelor's degree in nursing from an accredited school and must be between the ages of 21 and 42. Army nurse recruits are also expected to write a motivational statement explaining why they want to join the Army Nurse Corps as part of their application. Even if you don't join the Army Nurse Corps through an Army ROTC program, the Army offers loan repayment opportunities to help you pay back any loans you may have taken out in order to pay for nursing school."}, {"url": "http://www.goarmy.com/amedd/nurse/benefits.html", "passage_text": "You can make the most of your time and career by taking advantage of the benefits available to nurses serving in the U.S. Army Nurse Corps. Not only will you come to know the pride that comes with serving your country as an officer, but you'll also know that you're providing our Soldiers with the best nursing care. As a nurse serving as an officer in the active Army, you'll receive a comprehensive benefits package that may include a competitive salary and financial incentives such as nursing school loan repayment."}]