[{"url": "http://www.freestudy.co.uk/statics/complex/t5.pdf", "passage_text": "STRAIN ENERGY 1. INTRODUCTION When an elastic body is deformed, work is done. The energy used up is stored in the body as strain energy and it may be regained by allowing the body to relax. The best example of this is a clockwork device which stores strain energy and then gives it up. "}, {"url": "http://www.definitions.net/definition/strain%20energy%20density%20function", "passage_text": "Freebase (0.00 / 0 votes) Rate this definition: Strain energy density function. A strain energy density function or stored energy density function is a scalar valued function that relates the strain energy density of a material to the deformation gradient. In other words, the strain energy density function can be expressed uniquely in terms of the principal stretches or in terms of the invariants of the left Cauchy-Green deformation tensor or right Cauchy-Green deformation tensor and we have:"}, {"url": "http://www.oxforddictionaries.com/definition/english/strain-energy", "passage_text": "noun. Energy stored in an elastic body under loading: ligaments and tendons are elastic structures that can store strain energy, like a spring determinations of the form of the strain energy function. More example sentences. 1  These are elastic structures that can store strain energy, like a spring. 2  That is, if the change in elastic strain energy due to crack extension is larger than the energy required to create new crack surfaces, crack propagation will occur. 1"}, {"url": "http://www.definitions.net/definition/strain%20energy", "passage_text": "The external work done on an elastic member in causing it to distort from its unstressed state is transformed into strain energy which is a form of potential energy. The strain energy in the form of elastic deformation is mostly recoverable in the form of mechanical work. For example, the heat of combustion of cyclopropane is higher than that of propane for each additional CH2 unit."}, {"url": "http://www.definitions.net/definition/strain%20energy", "passage_text": "Strain energy. In a molecule, strain energy is released when the constituent atoms are allowed to rearrange themselves in a chemical reaction or a change of chemical conformation in a way that: ⁕angle strain, ⁕torsional strain, ⁕ring strain and/or steric strain, ⁕Allylic strain, and ⁕pentane interference are reduced. The strain energy in the form of elastic deformation is mostly recoverable in the form of mechanical work. For example, the heat of combustion of cyclopropane is higher than that of propane for each additional CH2 unit."}, {"url": "https://en.wikipedia.org/wiki/Strain_energy", "passage_text": "For strain energy of structures, see Energy principles in structural mechanics. For strain energy of solids, see Strain energy density function. In physics, strain energy is the energy stored by a system undergoing deformation. When the load is removed, strain energy as : where σ is stress, ε is strain, V is volume, and E is Young's modulus :"}, {"url": "http://emweb.unl.edu/Mechanics-Pages/Marina-Gandelsman/strain.html", "passage_text": "The work done by the load is equal to the area under the curve. As the load is applied, strains are produced and their presence increases the energy of our bar. This strain energy is the energy absorbed by the bar as a result of its deformation under load. From the principle of conservation of energy we know that this energy is equal to the work done by the load, assuming no other energy transfer (such as heat) occurred. by Marina Gandelsman. Strain energy is one of fundamental concepts in mechanics and its principles are widely used in practical applications to determine the response of a structure to loads."}, {"url": "http://encyclopedia2.thefreedictionary.com/Strain+energy", "passage_text": "strain energy. (mechanics). The potential energy stored in a body by virtue of an elastic deformation, equal to the work that must be done to produce this deformation. The work which is done in deforming a body. 1  Facebook. 2  Twitter"}, {"url": "http://www.answers.com/Q/Strain_energy_definitions", "passage_text": "Confidence votes 5.0K. Strain energy is a form of potential energy. Work done to distort an elastic member is stored as strain energy. Some energy may be lost in plastic deformation of the member and some may be converted into heat instead of stored as strain energy, but the rest is recoverable. A spring is an example of a storage device for strain energy"}]