[{"url": "http://www.answers.com/Q/What_is_a_cam_sensor_and_how_do_you_know_when_it_is_going_bad_and_where_would_you_look_for_it", "passage_text": "Confidence votes 131. The cam sensor tells the computer where your cam is in it's rotation. The info is used to determine spark timing and fuel delivery. if it's bad, you'll run rough or not at all. Vehicles with distributors will sometimes integrate thet sensor with the distributor. "}, {"url": "https://en.wikipedia.org/wiki/Crankshaft_position_sensor", "passage_text": "Typical inductive crankshaft position sensor. A crank sensor is an electronic device used in an internal combustion engine to monitor the position or rotational speed of the crankshaft. This information is used by engine management systems to control ignition system timing and other engine parameters. The sensor output can also be related to other sensor data including the cam position to derive the current combustion cycle, this is very important for the starting of a four stroke engine. Sometimes, the sensor may become burnt or worn out."}, {"url": "http://www.autopartswarehouse.com/camshaft_position_sensor~pop.html", "passage_text": "Simply put, a camshaft position sensor determines the position and rotational speed (in RPM) of the crank. This is important because this information is used to control ignition timing and/or fuel injection timing. As the name implies, this sensor detects the camshaft's speed, position, acceleration, and even deceleration. Information on these are sent by the sensor to the engine management system, which then makes the adjustments needed for the fuel injection's timing."}, {"url": "http://www.autopartswarehouse.com/camshaft_position_sensor~pop.html", "passage_text": "Camshaft Position Sensor Products. When it comes to knowing if the air and fuel ratio is correct or not, knowing the position of your engine's camshaft can go a long way. That's because the camshaft's speed determines when the mixture should be ignited in the engine cylinders. As the name implies, this sensor detects the camshaft's speed, position, acceleration, and even deceleration. Information on these are sent by the sensor to the engine management system, which then makes the adjustments needed for the fuel injection's timing."}, {"url": "http://www.answers.com/Q/What_does_the_crankshaft_sensor_do", "passage_text": "Answer 1It is a sensing device which detects each revolution of the crankshaft, and the rotational position of the crankshaft at any given time, in order to provide that information to the engine computer. The computer then uses that information as a reference upon which to base ignition timing adjustments. there's usually also a camshaft sensor, and many vehicles will use the camshaft sensor if the crankshaft sensor fails to provide limited functionality (limp home mode). If its dead, you'll have to replace it for the engine to operate properly. I don't know if your vehicle has any mileage limits on limp-home mode."}, {"url": "http://www.standardbrand.com/media/885978/ST10235PC-FEB14_JTF_CamCrankShaft.pdf", "passage_text": "The Camshaft sensor determines which cylinder is firing to establish injector synchronization and coil firing sequence in DIS systems. Crankshaft sensors set ignition timing, supply the RPM signal, and determine engine speed. "}, {"url": "http://www.answers.com/Q/What_does_the_crankshaft_sensor_do", "passage_text": "The Crankshaft Sensor communicates to the computer what position the motor is in so it can fire the appropriate spark plugs and fuel injectors in a continuous cycle, or firing order. there's usually also a camshaft sensor, and many vehicles will use the camshaft sensor if the crankshaft sensor fails to provide limited functionality (limp home mode). If its dead, you'll have to replace it for the engine to operate properly. I don't know if your vehicle has any mileage limits on limp-home mode."}, {"url": "https://forums.finalgear.com/questions-and-answers/what-problems-would-a-sick-cam-shaft-position-sensor-cause-in-my-engine-44465/", "passage_text": "Either a crank or camshaft position sensor can cause this-some cars have one or the other, some have both. The symptoms match. What the crank (or cam) shaft position sensor does is to tell the engine control computer where in the cycle the engine is at any given time as well as how fast the engine is turning over. This allows the computer to calculate when to inject fuel and when to fire the spark plugs (as applicable)."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080821233427AAVBqXI", "passage_text": "The cam sensor is a magnetic sensor that tells the computer on start up what position the cam is at in relation to the crankshaft. Report Abuse. Its a camshaft position sensor and some added features of you engine may be disabled. The camshaft is a rod with nibs on it to activate the valves. Without the cam sensor, variable valve timing will not work properly."}]