[{"url": "http://www.iron-foundry.com/machining-surface-finish-chart-comparator-method-degree-ra-rz-rms.html", "passage_text": "Machining surface finish chart, comparator, method, degree, Ra, Rz, RMS. As for machining to iron and steel castings, the surface finish smooth degree is also an important requirement. The photos of surface finish comparator for milling, turning, reaming and grinding. Home | More Articles. © DANDONG FUDING ENGINEERING MACHINERY CO., LTD."}, {"url": "http://www.wisetool.com/surfacefinish.htm", "passage_text": "Surface finish is generally broken up into three components such as roughness, waviness, and form. Roughness is generally the machined marks made on a surface by the cutting tool. Waviness is the result of the vibration of the tool. Form surface irregularities caused by worn off machine bad, table etc. All three surface finish components exist simultaneously."}, {"url": "http://www.engineersedge.com/manufacturing/surface-roughness-conversion.htm", "passage_text": "Thye Waviness is the measure of surface irregularities with a spacing greater than that of surface roughness. These usually occur due to warping, vibrations, or deflection during machining. "}, {"url": "https://en.wikipedia.org/wiki/Surface_finish", "passage_text": "Surface finish, also known a surface texture or surface topography, is the nature of a surface as defined by the 3 characteristics of lay, surface roughness, and waviness. It comprises the small local deviations of a surface from the perfectly flat ideal (a true plane). Finally, the data is summarized using one or more roughness parameters, or a graph. In the past, surface finish was usually analyzed by hand. The roughness trace would be plotted on graph paper, and an experienced machinist decided what data to ignore and where to place the mean line. Today, the measured data is stored on a computer, and analyzed using methods from signal analysis and statistics"}, {"url": "http://www.slideshare.net/mokhtarpadeli/unit4-surface-texture", "passage_text": "1 The inch unit for surface finish measurement is microinch (µin), while the metric unit is micrometer (µm). 2  3. F T ra n sf o F T ra n sf o PD rm PD rm Y Y Y Y er er ABB ABB y y bu bu 2.0 2.0 to to re re J3103/4/3 he he k k lic lic SURFACE TEXTURE C C w om w om w w w. w. 3  A B B Y Y.c A B B Y Y.c 4.1. 1 The microinch is equal to 0.000 001 inch and the micrometer equals to 0.000 001 meter. 2  6. 3  F T ra n sf o F T ra n sf o PD rm PD rm Y Y Y Y er er ABB ABB y y bu bu 2.0 2.0 to to re re J3103/4/6 he he k k lic lic SURFACE TEXTURE C C w om w om w w w. w. 4  A B B Y Y.c A B B Y Y.c 4.2."}, {"url": "http://engineersedge.com/surface_finish.htm", "passage_text": "Surface Roughness Conversion Chart. Surface roughness ot texture is the measure if the finer surface irregularities in the surface texture and is composed of three components: roughness, waviness and form. These are the result of the manufacturing process employed to create the surface. Surface roughness average (Ra), also know as arithmetric average (AA) is rated as the arithmetic average deviation of the surface valleys and peaks expressed in micro inches or micro meters. ISO standards use the term CLA (Center Line Average)"}, {"url": "http://www.iron-foundry.com/machining-surface-finish-chart-comparator-method-degree-ra-rz-rms.html", "passage_text": "The following is the conversion chart is from dandong foundry, for Ra (um), Ra (micro inch), Rz (um), RMS and finish degree in China and USA, including the related finish methods. China Finish Degree. China Ra (um). China Rz (um). The photos of surface finish comparator for milling, turning, reaming and grinding. Home | More Articles. © DANDONG FUDING ENGINEERING MACHINERY CO., LTD."}, {"url": "http://www.vesconite.com/design/techinfo/tech_tips.htm", "passage_text": "Metal tolerances Standard steel tolerances can be used with Vesconite bearings. Housings: H7 Shafts: h7. Surface finish Housings The surface finish on the housing is not critical as there is no movement after installation. For the purpose of installing the bearing the cut must not be too coarse. Lead in chamfers are required to ensure that the bearing does not score when been installed. Shafts The surface finish of the shaft is very important to ensure a correct operation of the bearing. A good finish of the order of 2.5 µm Ra (20 micro inch Ra) should be provided on shaft surfaces for an optimum wear life. For shafts with an axial motion relative to the bearing, a finish of the order of 0.5 µm Ra (20 micro inch Ra) should be provided on shaft. Rough surface finishes and corroded and scored shafts will cause wear of Vesconite bearings and should be avoided"}, {"url": "http://www.wisetool.com/surfacefinish.htm", "passage_text": "Surface roughness and finished. By definition, surface finish is the allowable deviation from a perfectly flat surface that is made by some manufacturing process. All machining processes will produces some roughness on the surface. Roughness is generally the machined marks made on a surface by the cutting tool. Waviness is the result of the vibration of the tool. Form surface irregularities caused by worn off machine bad, table etc. All three surface finish components exist simultaneously."}]