[{"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/hbp/", "passage_text": "Normal Blood Pressure. Normal blood pressure for adults is defined as a systolic pressure below 120 mmHg and a diastolic pressure below 80 mmHg. It is normal for blood pressures to change when you sleep, wake up, or are excited or nervous. When you are active, it is normal for your blood pressure to increase. "}, {"url": "http://www.livestrong.com/article/199572-normal-blood-pressure-range-for-women/", "passage_text": "Normal Range. According to highbloodpressureinfo.org, the normal range for blood pressure for everyone is 120/80 mmHg or lower. For women, this may vary depending on menstruation and pregnancy. Normal blood pressure for women is the same as for everyone else. However, women experience physiological changes that may cause the blood pressure to increase or decrease."}, {"url": "http://www.bloodpressureuk.org/BloodPressureandyou/Thebasics/Whatisnormal/", "passage_text": "Ideally, we should all have a blood pressure below 120 over 80 (120/80). This is the ideal blood pressure for people wishing to have good health. At this level, we have a much lower risk of heart disease or stroke. If your blood pressure is optimal, this is great news. Most adults in the UK have blood pressure readings in the range from 120 over 80 (120/80) to 140 over 90 (140/90). If your blood pressure is within this range, you should be taking steps to bring it down or to stop it rising any further. Our five top tips will show you how."}, {"url": "http://www.betterhealthfacts.com/2013/01/blood-pressure-chart-for-women-over-20.html", "passage_text": "Systolic is the pressure when heart beats and diastolic is when heart relaxes. Normal Blood Pressure is Systolic=120mm Hg and Diastolic=80mm Hg, usually written as 120/80. These reading differ according to age and sex of the person. Here we are providing these various age groups of women. "}, {"url": "http://www.health.harvard.edu/press_releases/Women-especially-older-women-need-to-pay-more-attention-to-blood-pressure", "passage_text": "Most older women have isolated systolic hypertension—a systolic pressure of 140 or higher with a normal (under 90) diastolic pressure. Up to about age 55, women are less likely to have high blood pressure than men. The older a woman gets, the greater her chances of developing high blood pressure, also known as hypertension: it affects 13% of women under age 44, nearly half of women in their 60s, and 80% or more of those over age 75."}, {"url": "http://www.ehow.com/about_5460740_normal-blood-pressure-range-women.html", "passage_text": "Identification. A blood pressure of 120/80 or lower is considered normal for adults, women included. The range above this, with systolic below 140 and diastolic below 90, is regarded as borderline and should be closely monitored. Anything consistently above 140 over 90 is called hypertension, or high blood pressure, and needs to be addressed."}, {"url": "http://www.buzzle.com/articles/normal-blood-pressure-for-women.html", "passage_text": "Under normal circumstances, blood pressure reading for women, as well as men should be 120/80 mm Hg. Abnormally high or low blood pressure can have serious repercussions on one's health, which is why blood pressure must be monitored at regular intervals. On the other hand, diastolic pressure is the minimum pressure exerted by blood on the arteries when the heart relaxes between beats. Normal Blood Pressure in Women. Ideally, the blood pressure reading should be 120/80 mm Hg (millimeters of mercury). The first figure refers to the systolic pressure, while the second figure represents the diastolic pressure. It is measured by a sphygmomanometer"}, {"url": "http://www.ehow.com/about_5460740_normal-blood-pressure-range-women.html", "passage_text": "Blood pressure is the force of your blood against artery walls. When it measures above normal levels, it is called high blood pressure and increases your risk for having a stroke. It is also a precursor to heart and kidney disease. The range above this, with systolic below 140 and diastolic below 90, is regarded as borderline and should be closely monitored. Anything consistently above 140 over 90 is called hypertension, or high blood pressure, and needs to be addressed."}]