[{"url": "http://www.food.com/recipe/kittencals-best-blasted-rapid-roast-whole-chicken-221743", "passage_text": "1 Set oven to 450 degrees F. 2  Roast the chicken at 450 degrees for 20 minutes, then reduce the heat to 400 degrees and continue roasting for about 40 minutes (or until the internal temperature reaches about 175 to 180 degrees F. about 1 hour or a little less)."}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/perfect-roast-chicken-recipe.html", "passage_text": "Rub the chicken both inside and out with the garlic rosemary blend and place in the roasting pan. Place the pan in the oven and roast the chicken for 40 to 50 minutes, or until the juices run clear. To test this, insert a thermometer in the thickest part of a leg. It should register at 160 degrees internal temperature. Remove the chicken from the oven and allow to cool for 10 to 15 minutes before carving."}, {"url": "http://whatscookingamerica.net/Q-A/ChickenCook.htm", "passage_text": "One and a half hours is much too long to cook the chicken at 350 degrees F. The time your chicken will bake in the oven does depend on the internal temperature and the size of your chicken or chicken pieces. Generally I bake chicken at 350 degrees F. for 30 to 40 minutes."}, {"url": "http://www.chowhound.com/recipes/basic-whole-roasted-chicken-30264", "passage_text": "1 4 Roast the chicken in the oven for 15 minutes. 2  Reduce the temperature to 375°F and continue roasting until the juices run clear and a thermometer inserted into the inner thigh (but not touching the bone) registers 165°F, about 50 minutes to 1 hour more."}, {"url": "https://answers.yahoo.com/question/index?qid=20090405125655AAJHDg6", "passage_text": "Best Answer: The FDA's official recommendation is to cook whole chicken to an internal temperature of 165. I have heard it is better to cook chicken parts to 170 or 180 - but the FDA doesn't have that recommendation on their website."}, {"url": "http://www.inspiredtaste.net/895/simply-roasted-chicken/", "passage_text": "1 Roast the chicken for 1 1/2 hours or until the juices run clear when you cut between a leg and a thigh and the internal temperature of the breast is about 165-170°F and 180-185°F for the thigh. 2  Remove the chicken and allow to rest for at least 15 minutes, then serve."}, {"url": "http://www.food.com/recipe/kittencals-best-blasted-rapid-roast-whole-chicken-221743", "passage_text": "1 Roast the chicken at 450 degrees for 20 minutes, then reduce the heat to 400 degrees and continue roasting for about 40 minutes (or until the internal temperature reaches about 175 to 180 degrees F. about 1 hour or a little less)."}]