[{"url": "http://health.costhelper.com/hepatitis-vaccine.html", "passage_text": "1 A Hepatitis B vaccination costs $70 per shot for a total of at least $370."}, {"url": "http://www.hepb.org/hepb/vaccine_information.htm", "passage_text": "The three-shot vaccine series for children in the United States usually costs $75 to $165, but this can vary. Infants up to age 18 months, and sometimes older children, can receive the vaccine free of charge from most local public health clinics."}, {"url": "http://www.walgreens.com/topic/scheduler/hepatitis-b-vaccine_34.jsp", "passage_text": "The hepatitis B vaccine is the best way to prevent infection. It is a series of 3 or 4 shots usually given over a 6-to-12 month period. It is given by an injection into the arm muscle of adolescents and adults and thigh muscle of infants and young children."}, {"url": "http://www.cvs.com/minuteclinic/services/vaccinations-and-injections/hepatitis-b/N-d8ZbtnbZd5", "passage_text": "The hepatitis B vaccine protects against hepatitis B. It is administered in one primary dose and two booster doses to healthy adults 20 years and older and to healthy children and young adults 18 months to 20 years old."}, {"url": "http://health.costhelper.com/hepatitis-vaccine.html", "passage_text": "1 For patients not covered by insurance, the total cost of a Hepatitis B vaccination sometimes includes a consultation fee, and usually includes shot administration fees and the cost of the three required doses of the vaccine for a total of about $120 to $370 or more."}, {"url": "http://www.howmuchisit.org/hepatitis-vaccine-cost/", "passage_text": "1 The Hepatitis B vaccination is going to protect from a disease that is contracted through contact of bodily fluids. 2  The cost of this vaccination is going to cost anywhere from $20 to $55 each per injection."}, {"url": "http://health.costhelper.com/hepatitis-vaccine.html", "passage_text": "1 And at Baylor Travel Medicine in Texas, an initial consultation costs $85 to $150, depending on the complexity of the patient's travel itinerary and medical history, and follow-up appointments to administer the shots cost $25 to $85 each. 2  A Hepatitis B vaccination costs $70 per shot for a total of at least $370."}, {"url": "http://www.howmuchisit.org/hepatitis-vaccine-cost/", "passage_text": "1 The cost of this vaccination is going to cost anywhere from $20 to $55 each per injection. 2  Since there are 3 total shots that are required, the overall costs can vary from $60 to $165 for the complete package. 3  To have both Hepatitis shots combined, it is going to cost an average of $70 to $315 without insurance."}, {"url": "http://health.costhelper.com/hepatitis-vaccine.html", "passage_text": "1 For patients not covered by insurance, the total cost of a combined Hepatitis A/B vaccination sometimes includes a consultation fee, and usually includes shot administration fees and the cost of the three required doses of the vaccine for a total of about $330 to $700."}, {"url": "http://www.cdc.gov/vaccines/vpd-vac/hepb/default.htm", "passage_text": "Hepatitis B is a serious disease caused by a virus that attacks the liver. The virus, which is called hepatitis B virus (HBV), can cause lifelong infection, cirrhosis (scarring) of the liver, liver cancer, liver failure, and death. Hepatitis B vaccine is available for all age groups to prevent HBV infection."}]