[{"url": "http://www.qwhatis.com/what-is-lca-in-h1b/", "passage_text": "LCA or Labor Condition Application is part of the application requirements for H1B visas in the US. Employers are also restricted in filing H1B applications with LCA during times of labor strikes and disputes. Under the LCA, employers must also show proof that no local or American talent can fulfill a specialty job, which makes it necessary for them to hire workers from foreign lands."}, {"url": "https://en.wikipedia.org/wiki/Life-cycle_assessment", "passage_text": "Based on a survey of LCA practitioners carried out in 2006 LCA is mostly used to support business strategy (18%) and R&D (18%), as input to product or process design (15%), in education (13%) and for labeling or product declarations (11%). Gate-to-gate is a partial LCA looking at only one value-added process in the entire production chain. Gate-to-gate modules may also later be linked in their appropriate production chain to form a complete cradle-to-gate evaluation."}, {"url": "http://www.wonderbaby.org/articles/lebers-congenital-amaurosis-lca-faq", "passage_text": "Leber's Congenital Amaurosis (LCA) is a rare genetic disorder in which retinal dysfunction causes vision loss, often from birth. The extent of vision loss varies from patient to patient, but can be quite severe (with little to no light perception). In most cases, LCA is considered a degenerative disease. However, the extent of that degeneration depends on the type of LCA your child has. For some types of LCA, however, vision (or lack of vision) remains stable."}, {"url": "http://www.qwhatis.com/what-is-lca-in-h1b/", "passage_text": "The LCA or Labor Condition Application became a requirement for H1B visa applications under the 1990 Immigration Act. It basically ensures that wages in the US will not be lessened or depressed by letting in foreign workers for a specific job. Employers are also restricted in filing H1B applications with LCA during times of labor strikes and disputes. Under the LCA, employers must also show proof that no local or American talent can fulfill a specialty job, which makes it necessary for them to hire workers from foreign lands."}, {"url": "http://www.h1bwiki.com/h1b-lca-overview/", "passage_text": "The above two items comprise of H-1B application. Once your LCA is certified and form I-129 is filled and signed, your employer may submit your H-1B petition to the USCIS, when subject to cap. Form I-129, specifically is petition for the non-immigrant worker. You can download Form I-129 and other related documents here. LCA Document Submission to USCIS. Once LCA is certified by DOL, your employer may file your H-1B petition(I-129). While your employer is filing your form I-129 (H-1B petition) with the USCIS, your employer also need to submit a certified Department of Labor (DOL) LCA (Form ETA 9035) at the time of filing your petition."}, {"url": "http://www.happyschools.com/what-is-lca-h1b-visa/", "passage_text": "LCA stands for Labor Condition Application and H1B application (New, Extension or Transfer) cannot be filed with USCIS without Approved LCA. H1B Visa 2015 season is coming up shortly. Employers will be applying for LCA this month to get their application ready to file this April. Attirney Murali Bashyam answers the above questions in this video. Hi Raghuram, when is the LCA generally filed for a new H1b, i have been approached by a consultant/employer and they are telling in month of OCT only they will file the LCA, is it, but as per your above description it seems it generally starts much later."}, {"url": "http://www.visapro.com/Immigration-Articles/?a=182&z=48", "passage_text": "The LCA must be certified by the Department of Labor (DOL) before the H1B petition is submitted to USCIS. The employer must also document compliance with the LCA requirements in a public access file. "}, {"url": "https://en.wikipedia.org/wiki/Labor_Condition_Application", "passage_text": "The Labor Condition Application (LCA) is an application filed by prospective employers on behalf of workers applying for work authorization for the non-immigrant statuses H-1B, H-1B1 (a variant of H-1B for people from Singapore and Chile) and E-3 (a variant of H-1B for workers from Australia). A Labor Condition Application must include four attestations from the employer. Employers need to maintain relevant documentation and may need to submit it if asked. The attestations are in Section F of ETA Form 9035 (the LCA form)."}, {"url": "http://www.wonderbaby.org/articles/lebers-congenital-amaurosis-lca-faq", "passage_text": "Maybe you've just realized that your infant is blind and you've come across the acronym LCA in your research, or maybe your child has been given a diagnosis of LCA (Leber's Congenital Amaurosis) from your doctor. In most cases, LCA is considered a degenerative disease. However, the extent of that degeneration depends on the type of LCA your child has. For some types of LCA, however, vision (or lack of vision) remains stable."}]