[{"url": "http://www.powerhomebiz.com/financing-a-business/startup-expenses/how-much-money.htm", "passage_text": "Always plan on everything in a start-up business to take twice as long and cost twice as much as you expect. If a client says “I will pay you in 30 days,” you should plan for having to wait 60 to 90 days until you get your money."}, {"url": "http://apps.americanbar.org/lpm/lpt/articles/ftr05094.shtml", "passage_text": "How much money you need is a question that you, and only you, can answer. It depends entirely on how quickly you can acquire positive cash flow. Getting your practice to a state of positive cash flow depends on a lot factors, such as: 1  How many new clients your marketing drives to your door."}, {"url": "http://smallbusiness.chron.com/much-money-required-start-pharmacy-12266.html", "passage_text": "The average pharmacy technician made $13.32 per hour. Assuming one pharmacist and one pharmacy technician, then, will cost $131,984 per year in salaries. Two of each will cost $263,968. One pharmacist and three pharmacy technicians, however, will cost $183,132."}, {"url": "http://smallbusiness.chron.com/much-cost-startup-hair-salon-business-12478.html", "passage_text": "Business Start-Up Costs. A booth rental can require a monthly rent up to $1,000, but it includes insurance, utilities and the business license for the establishment. As a sole business or a franchise, you are required to pay rent, insurance, deposits and utilities."}, {"url": "http://smallbusiness.chron.com/much-money-required-start-pharmacy-12266.html", "passage_text": "You'll need $882,352 to $1,764,705 per year in either borrowed or non-borrowed cash to start a pharmacy, which might seem like a lot (and may be for less expensive areas), but the costs are in line with typical start-up costs: rent, inventory, and staff."}, {"url": "http://smallbusiness.chron.com/much-cost-startup-hair-salon-business-12478.html", "passage_text": "The cost to start up a hair salon business varies depending on the type of business. A small booth salon, where you rent a section of an existing salon as your own business, costs infinitely less than purchasing a large well-known franchise. Both may share similar start-up costs, but the amounts will be different."}, {"url": "http://www.businessknowhow.com/startup/startup.htm", "passage_text": "Calculate your business startup costs using the calculator below to find out how much cash you'll need to launch your business and run until it becomes profitable."}, {"url": "http://www.powerhomebiz.com/financing-a-business/startup-expenses/how-much-money.htm", "passage_text": "You need to know how much it will cost you to run your business and how much money you are likely to make. Remember your reason for pursuing a business idea is to make money. The capital requirements of a new business will vary depending upon several factors."}, {"url": "http://www.powerhomebiz.com/financing-a-business/startup-expenses/how-much-money.htm", "passage_text": "You need to know if your business needs $15,000 at the start and you expect to reach your break-even point after six months, then your start-up budget should be as much as $30,000 to cover basic living expenses and how much you need to run the business."}]