[{"url": "http://whatscookingamerica.net/saffron.htm", "passage_text": "Saffron, the yellow-orange stigmas from a small purple saffron crocus (Crocus sativus), commonly known as Rose of Saffron, is the world's most expensive spice. That's because each flower provides only three (3) red stigmas. "}, {"url": "http://foodfacts.mercola.com/saffron.html", "passage_text": "Naturally, one of saffron’s first uses may have been for dyeing textiles, since a single grain can color 10 gallons of water with a distinctive yellow hue. More than a grain is used, however, to color the bright orange robes worn by Buddhist priests in India. Three wispy saffron threads can be gleaned from each delicate crocus, which, ironically, is lavender-purple in color. As a spice, saffron is known for what it does to energize dishes with a pungent, earthy essence. "}, {"url": "http://mydogischelsea.com/2005/02/16/wednesday-february-16-2005-at-0648-pm/", "passage_text": "My last entry sparked quite the debate over the color of saffron, so I feel the need to address this issue before we move on. Saffron, actually, is neither orange nor yellow. It is somewhat reddish in tone, although I have to admit that I am not the best measure of this. My left eye sees things in bluish tones, and my right in reddish tones. "}, {"url": "https://en.wikipedia.org/wiki/Saffron", "passage_text": "Saffron – delicate threads, plucked from the flowers and dried in Vienna. Saffron (pronounced /ˈsaefrən/ ˈsæfrən /or/) ˈsaefrɒn ˈsæfrɒn is a spice derived from the Flower of, crocus sativus commonly known as the. saffron crocus The saffron crocus, unknown in the wild, probably descends from Crocus cartwrightianus, which originated in Crete; C. thomasii and C. pallasii are other possible precursors."}, {"url": "http://colors.findthedata.com/l/571/Saffron", "passage_text": "'Saffron' is a shade of Yellow that is 80% saturated and 96% bright. For reference purposes, Saffron has the hex value #F4C430. "}, {"url": "https://en.wikipedia.org/wiki/Saffron_(color)", "passage_text": "For other uses, see Saffron (disambiguation) . Saffron is a color that is a tone of golden yellow resembling the color of the tip of the saffron crocus thread, from which the spice saffron is derived. The first recorded use of saffron as a color name in English was in 1200. Close-up of a single saffron crocus thread (the dried stigma). India saffron, white and what is now called India green were chosen for the three bands, representing courage and sacrifice, peace and truth, and faith and chivalry respectively."}, {"url": "http://www.answers.com/Q/What_color_is_saffron", "passage_text": "Saffron is a yellow spice used to color and flavor foods like rice, used a lot in Indian dishes. It comes from a plant that produces threads. The threads can be purchased in s … pice jars in grocery stores or spice shops. Saffron is also available ground as a powder. Saffron is the dried bright red stigmas of the flower Crocus sativus, which is fairly easy to grow. It needs cold winters and warm dry summers. It takes a lot of work to … gather the spice, which is very expensive. Each crocus produces one flower and each flower produces just 3 stigmas."}, {"url": "http://www.foodcolor.com/saffron-color", "passage_text": "Saffron is a spice derived from the flower of Crocus sativus, commonly known as the saffron crocus. Crocus is a genus in the family Irida ceae. Each saffron crocus grows to 20–30 cm (8–12 in) and bears up to four flowers, each with three vivid crimson stigm as, which are each the distal end of a carp el. "}, {"url": "https://en.wikipedia.org/wiki/Saffron", "passage_text": "Saffron (pronounced /ˈsaefrən/ ˈsæfrən /or/) ˈsaefrɒn ˈsæfrɒn is a spice derived from the Flower of, crocus sativus commonly known as the. Saffron crocus saffron crocus grows–to 20 (30–cm 8) 12 in and bears up to, four flowers each with three vivid, crimson stigmas which are the distal end of. a carpel The saffron crocus, unknown in the wild, probably descends from Crocus cartwrightianus, which originated in Crete; C. thomasii and C. pallasii are other possible precursors."}]