[{"url": "http://www.torontotenants.org/news/time-turn-heat", "passage_text": "Time to Turn on the Heat!! The heat should now be on in your apartments to ensure that it is a minimum of 21 degrees Celsius (69.8 F) all the time! The landlord has this requirement from September 15th to June 1st. If you find your apartment cold, you should pick yourself up a thermometer and for a few days write down the date, the time, and the temperature in your unit. Measure the temperature in the middle of the room. If the temperature in your unit is less than 21C, let your landlord know, in writing (keeping a copy for yourself), that they must address the issue immediately. If the landlord does not address the issue, you can contact the City of Toronto Property Standards office at 3-1-1. Best of luck and happy heating!"}, {"url": "https://answers.yahoo.com/question/index?qid=20080808220159AABxaHw", "passage_text": "If you don't have a lease agreement between you and the landlord, then you don't have the law on your side.That's why your landlord turns off your heat.Turning off your heat will not be misconstruded as constructive eviction, because you don't have a lease contract. jimulik · 7 years ago. Thumbs up. Can the landlord turn off the heat in your apartment? It is summer but it has been low 50's at night were I live and has gotten very cold."}, {"url": "http://www.lawguru.com/legal-questions/pennsylvania-landlord-tenant/landlord-turned-heat-daughters-house-596110040/", "passage_text": "0 attorneys agreed. Re: Landlord turned off heat. No. If heat was included in the rent then he needs to provide it. If the apartment is uninhabitable she could move out and assert a defense of constructive eviction. Before do that she should write a letter asking him to turn on the heat. If he fails to turn on the heat she can move. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080808220159AABxaHw", "passage_text": "Report Abuse. Yes, the landlord can turn off the heat during the off season. This would be covered either by your state's landlord/tenant laws or local housing codes and ordinances. Can the landlord turn off the heat in your apartment? It is summer but it has been low 50's at night were I live and has gotten very cold."}, {"url": "https://answers.yahoo.com/question/index?qid=20080808220159AABxaHw", "passage_text": "Under the state housing codes, ***from October 1 to May 1***, the landlord must provide enough heat so that the temperature in the apartment is at least 68 degrees from 6 a.m. to 11 p.m. Between the hours of 11 p.m. and 6 a.m., the temperature in the apartment must be at least 65 degrees. Can the landlord turn off the heat in your apartment? It is summer but it has been low 50's at night were I live and has gotten very cold."}, {"url": "http://settlement.org/ontario/housing/rent-a-home/tenant-rights-and-responsibilities/what-are-my-rights-as-a-tenant/", "passage_text": "1 Your landlord may shut-off services for a short time so that they can make repairs. 2  Your landlord might pay for vital services; or you might pay for them. 3  Heat: Your landlord must heat your home from September 1 to June 15. 4  The landlord has to make sure the heat is at 20°C or more. 1 Heat: Your landlord must heat your home from September 1 to June 15. 2  The landlord has to make sure the heat is at 20°C or more. 3  Some cities have a higher heat standard. 4  Check with your local government to find out more about minimum heat standards in your community."}, {"url": "http://ontariolandlordandtenantlaw.blogspot.ca/2012/11/more-heat-please-its-cold-in-my.html", "passage_text": "Hello, We rent an apartment in an 80 unit building in Ottawa and the heat is not on. Last year it wasn't turned on until October 15. There is a frost warning right now and tonight is forecasted for zero degrees. I have had the oven on since 7am the last 3 days, and turn it off at 5pm. If a landlord fails to provide heat in accordance with the provisions of the Residential Tenancies Act and the Regulations, a tenant may file an application to the Ontario Landlord and Tenant Board to have the Board determine what the appropriate remedy is."}, {"url": "http://renting.in-kw.com/rental-faq/when-does-a-landlord-have-to-turn-the-he", "passage_text": "Here's the answer from the Ontario Landlord and Tenant Board website: ... If a landlord provides heat, the Act requires the landlord to keep the heat to at least 20 degrees Celsius from September 1 to June 15. In addition, many municipalities have their own property standards or bylaws about heat"}]