[{"url": "http://content.papamurphys.com/133/reheatinstructions.pdf", "passage_text": "Bake-and-Serve tray intended for single use only. Do not reheat pizza on the tray. Bake 7-10 minutes.(Stuffed Pizzas/Calzones 10-14 minutes)Continue baking to your liking.Preheat oven to 400º.Remove pizza from bake-and-serve tray it was baked on. "}, {"url": "http://www.artofmanliness.com/2014/09/25/the-best-way-to-reheat-pizza/", "passage_text": "Method #2 – Oven. Next up was the oven. I had seen a tip in a random forum (yes — there are forums regarding the best ways to reheat pizza) from a man who swore to high heaven to cook the pizza for 5 minutes at 350 degrees. I followed suit, letting the oven preheat all the way before putting it directly on the rack"}, {"url": "http://www.labefanapizza.com/best-reheating-pizza-methods-from-la-befana-pizzeria/", "passage_text": "If you don’t have a stone or tiles then use a flat pan to lay the pizza on top of foil. A pizza shop oven is 650 – 700 degrees but for reheating pizza set the oven to preheat at 450 – 475 degrees and put pizza in oven and leave until oven preheats to set temperature or until you see cheese bubbling. La Befana Pizzeria offers Gourmet pizza for Allston and Brookline neighborhoods of Boston. Reheating pizza in an oven is definitely one of those “ know your own oven .” Times and temperature will vary between ovens and depending on whether you use a pizza stone or unglazed tiles. If you use tiles then keep the stones clean by putting the pizza on a sheet of foil."}, {"url": "http://www.huffingtonpost.com/2014/06/27/reheat-pizza-best-way_n_5533124.html", "passage_text": "A pizza is cooked in a pizza oven, not a pizza skillet. So to reheat pizza, you attempt to replicate a pizza oven. Place a baking sheet in your oven, blasting the heat as high as your oven will go. Once the baking sheet is hot, place the pizza on it. The bottom will be crispified by the hot baking sheet."}, {"url": "http://www.ehow.com/how_5032253_reheat-pizza-oven.html", "passage_text": "Leftover pizza, properly handled, makes for a tasty, casual lunch. Heating pizza in the microwave can be messy and often results in a soggy, tasteless slice. Reheating it in the oven is definitely preferable. Pizza experts recommend using either a baking stone or parchment paper to reheat pizza in a traditional oven. It keeps the pizza crisp and best emulates that fresh-from-the-box taste. Laura Beth Drilling/Demand Media. Baking Sheet. Place a sheet of absorbent parchment paper -- large enough to hold all of your leftover pizza -- on top of a metal baking sheet. Place the pizza on top of it and put it in the oven. Laura Beth Drilling/Demand Media. Baking Sheet. Let it cook for 5 to 10 minutes or until the cheese bubbles gently"}, {"url": "http://www.seriouseats.com/talk/2012/10/reheating-pizza.html", "passage_text": "Put a baking sheet into a cold oven. Turn it up to 400, let it come up to temperature. Put pizza on pan, let it go for about 10 minutes. Take the pan out of the oven, let it sit for a couple minutes. Remove to plate. Crispy bottom, melted cheese. DanielJ. So after years of trial and error, I think I've discovered the right way to reheat cold pizza. My main issue has always been with the crust: after reheating in the oven, microwave, toaster oven, etc, it's always been limp and saggy (ok for rolling up into a pizzarito, but not much else)."}, {"url": "http://www.wikihow.com/Store-and-Reheat-Pizza", "passage_text": "Preheat toaster oven to 400 degrees F (200 C). Make sure the toaster oven is fully preheated before you put the pizza inside, or the texture will suffer for it. This method should result in pizza that is crunchy on the bottom and bubbly on top. Preheat the oven to 400 degrees F (200 C). Allow the oven to completely preheat before placing the pizza inside. The final result will be worth the wait-especially if you're reheating an entire pizza. If you place the pizza in too soon, it could turn out soft in the wrong places."}]