[{"url": "http://www.remss.com/measurements/brightness-temperature", "passage_text": "Overview. The brightness temperature is a measurement of the radiance of the microwave radiation traveling upward from the top of the atmosphere to the satellite, expressed in units of the temperature of an equivalent black body. Brightness temperature (also referred to as TB) is a measure of the radiance of microwave radiation traveling upward from the top of Earth's atmosphere. The conversion from radiometer counts to top-of-the-atmosphere TB is called the calibration process"}, {"url": "https://en.wikipedia.org/wiki/Brightness_temperature", "passage_text": "In pulsars the brightness temperature can reach 10 26 K. For the radiation of a typical helium–neon laser with a power of 60 mW and a coherence length of 20 cm, focused in a spot with a diameter of 10 µm, the brightness temperature will be nearly 7010140000000000000♠14×109 K. (the Intensity or Brightness) is the amount of energy emitted per unit surface area per unit time per unit solid angle and in the frequency range between and; is the temperature of the black body; is Planck's constant; is frequency; is the speed of light; and is Boltzmann's constant."}, {"url": "https://en.wikipedia.org/wiki/Brightness_temperature", "passage_text": "Brightness temperature is the temperature a black body in thermal equilibrium with its surroundings would have to be to duplicate the observed intensity of a grey body object at a frequency. This concept is extensively used in radio astronomy and planetary science. (the Intensity or Brightness) is the amount of energy emitted per unit surface area per unit time per unit solid angle and in the frequency range between and; is the temperature of the black body; is Planck's constant; is frequency; is the speed of light; and is Boltzmann's constant."}, {"url": "http://ies.org/lighting/science/color.cfm", "passage_text": "The color temperature of a light source is a numerical measurement of its color appearance. It is based on the principle that any object will emit light if it is heated to a high enough temperature and that, as the temperature increases, the color of that light will change along with the temperature. A light source's color temperature, then, is the temperature at which the color of the horseshoe would match the color of the light source. We express this temperature in degrees, but not Fahrenheit degrees like we are used to, but in Kelvin. This scale was named after Lord Kelvin, a British inventor."}, {"url": "http://www.eaglelight.com/category/lighting_tutorials.color_temperature/", "passage_text": "In this installment EagleLight's LED University explains what color temperature means. LED color temperature measures the color of an LED light bulb. It defines the amount of pure white, yellow, red and blue in a light. Another way to think of the color temperature is how 'warm' or 'cool' is the white LED light bulb. Color temperature is measured in degrees Kelvin and is a measure of the part of the color spectrum that is found in light. A simple way to think about this is to compare the light from the sun from sunrise to sunset."}, {"url": "https://en.wikipedia.org/wiki/Brightness_temperature", "passage_text": "In general, the brightness temperature is a function of, and only in the case of blackbody radiation it is the same at all frequencies. The brightness temperature can be used to calculate the spectral index of a body, in the case of non-thermal radiation. (the Intensity or Brightness) is the amount of energy emitted per unit surface area per unit time per unit solid angle and in the frequency range between and; is the temperature of the black body; is Planck's constant; is frequency; is the speed of light; and is Boltzmann's constant."}, {"url": "https://en.wikipedia.org/wiki/Color_temperature", "passage_text": "The color temperature of a light source is the temperature of an ideal black-body radiator that radiates light of comparable hue to that of the light source. This means that the emitted radiation does not follow the form of a black-body spectrum. These sources are assigned what is known as a correlated color temperature (CCT). CCT is the color temperature of a black-body radiator which to human color perception most closely matches the light from the lamp."}]