[{"url": "http://www.gemvara.com/Precious-Metal-Guide/pages/v/education/metals/palladium/", "passage_text": "Since palladium isn't as heavy as platinum, you can wear elaborate palladium earrings or large palladium bracelets without feeling like a heavy weight is pulling you down. And just like platinum, palladium jewelry is 95% pure, which means you get more precious metal in your jewelry: White gold is only 58.5% pure. From the same metal family as platinum, palladium is a naturally bright white metal. However, palladium is lighter and less dense than platinum, which also means that it's lighter on your wallet."}, {"url": "http://www.gemvara.com/Precious-Metal-Guide/pages/v/education/metals/palladium/", "passage_text": "Palladium Jewelry. Palladium is the newest precious metal. A platinum group metal, palladium is rare, lustrous, and naturally white. Palladium has the purity and white tone of platinum but is less dense, making it more affordable. From the same metal family as platinum, palladium is a naturally bright white metal. However, palladium is lighter and less dense than platinum, which also means that it's lighter on your wallet."}, {"url": "http://www.arpaiajewelry.com/pages/palladium-continuum", "passage_text": "Palladium is Hypoallergenic. As a pure metal, Palladium is “skin sensitive,” which means that it typically can be worn by people who are allergic to other metals, especially white gold. As mentioned, Palladium gets its white color and luster from nature."}, {"url": "https://www.larsonjewelers.com/t-aboutpalladium.aspx", "passage_text": "Both metals are hypoallergenic. Both metals are about equal in scratch resistance, palladium is actually slight higher. Platinum is heavier in weight than palladium and the metal is valued higher on the metals market. At Larson Jewelers, all of our palladium wedding bands are made with 950 palladium (PD950) to create lightweight, malleable and hypoallergenic jewelry from seamless tubing by jewelers located in the United States. Our delivery times are short and there is no concern about the quality issues."}, {"url": "https://www.larsonjewelers.com/t-buying-a-palladium-ring-facts-characteristics.aspx", "passage_text": "With the new 950 Palladium alloy, you no longer have to sacrifice hypoallergenic properties just to get a better price. A palladium ring will retail at prices similar to white gold, but since the 950 Palladium alloy is 95% pure you will not have to worry about ring rashes or finger discomfort. In 2001, Palladium was actually more expensive than Platinum. As popularity grew, the price for Palladium rings dropped."}, {"url": "http://www.arpaiajewelry.com/pages/palladium-continuum", "passage_text": "Platinum might be the most luxurious white metal for heirloom designs, but Palladium is more affordable and possesses many of Platinum’s attributes. Also, Palladium has several superior qualities over White Gold, most notably, its natural luster, pure silvery-white color, and hypoallergenic nature. As a pure metal, Palladium is “skin sensitive,” which means that it typically can be worn by people who are allergic to other metals, especially white gold. As mentioned, Palladium gets its white color and luster from nature."}, {"url": "http://www.bluenile.com/education/metal/palladium", "passage_text": "Palladium, which is listed on the Periodic Table of elements, is lighter in weight than its sister metal, Platinum. A naturally white metal, Palladium is hypoallergenic, will not tarnish and remains white forever. Palladium. Palladium, one of the rarest metals in the world, is a member of the Platinum Group Metals. These metals are also referred to as Noble Metals due to their superior ability to withstand corrosion and oxidation."}, {"url": "http://www.sorellajewelry.com/palladium-jewelry-s/458.htm", "passage_text": "Hypoallergenic: Palladium, and it's ruthenium alloy, are both non-allergenic metals, significantly decreasing any possibility of a skin reaction. Durable: Palladium is much harder than gold of any karat and actually 12% harder than even platinum. It is a member of the platinum group of metals (the most precious metals in the world); meaning it's mined and extracted from the same mineral deposits as platinum and shares similar qualities. Palladium is found only in Australia, Africa, Russia, and North and South America."}, {"url": "http://www.ebay.com/gds/What-is-Palladium-Palladium-vs-Platinum-/10000000005735227/g.html", "passage_text": "Please sign in to vote on this Guide. The fact is Palladium is pure, natural, less dense, hard, hypoallergenic, whiter, and most importantly, economical. Worldwide in 2005 more jewelry units were sold in Palladium than in platinum. Palladium is not a man made or fabricated metal. Its is mined in its natural state. It is white, light, and strong. It never needs rhodium and is a platinum group metal."}]