[{"url": "http://iambicpentameter.net/iambic-pentameter-definition/", "passage_text": "da DUM | da DUM | da DUM | da DUM | da DUM. That’s the simplest way to define iambic pentameter. Great examples of a iambic pentameter poems would be many of Shakespeare’s sonnets. He often wrote sonnets and whole lines of dialogue from plays in this meter."}, {"url": "http://www.poetrysoup.com/dictionary/iambic_pentameter", "passage_text": "Poetry Definition. A meter in poetry, consisting of lines with five feet (hence pentameter) in which the iamb is the dominant foot (hence Iambic). Iambic rhythms are quite easy to write in English and iambic pentameter is among the most common metrical forms in English poetry."}, {"url": "http://iambicpentameter.net/iambic-pentameter-definition/", "passage_text": "Pentameter is simply penta, which means 5, meters. So a line of poetry written in pentameter has 5 feet, or 5 sets of stressed and unstressed syllables. In basic iambic pentameter, a line would have 5 feet of iambs, which is an unstressed and then a stressed syllable."}, {"url": "https://en.wikipedia.org/wiki/Iambic_pentameter", "passage_text": "Iambic pentameter is a commonly used type of metrical line in traditional English poetry and verse drama. The term describes the rhythm that the words establish in that line, which is measured in small groups of syllables called  feet ."}, {"url": "http://literarydevices.net/pentameter/", "passage_text": "Definition of Pentameter. Pentameter is a literary device that can be defined as a line in verse or poetry that has five strong metrical feet or beats. There are different forms of pentameter: iamb, trochaic, dactylic and anapestic."}, {"url": "http://study.com/academy/lesson/iambic-pentameter-definition-examples-quiz.html", "passage_text": "FreeDictionary.com defines pentameter as a line of verse consisting of five metrical feet. When put together, iambic pentameter may be defined as a line of verse consisting of five metrical feet where each foot consists of an unstressed syllable and a stressed syllable."}, {"url": "http://study.com/academy/lesson/iambic-pentameter-definition-examples-quiz.html", "passage_text": "Iambic Pentameter Definition. In a line of poetry, an iamb is a foot or beat consisting of an unstressed syllable followed by a stressed syllable, or a short syllable followed by a long syllable, according to FreeDictionary.com. An example is the word comPLETE."}]