[{"url": "http://faculty-salaries.startclass.com/l/11430/University-of-Rhode-Island", "passage_text": "In 2013 professors at University of Rhode Island had an effective annual salary of $138,071. This is $660 more than professors earned in 2012, the most recently reported prior year, and a 0.5 percent increase in effective annual salary over the previous year's average annual salary ($137,411)."}, {"url": "http://www.salarylist.com/company/University-Of-Rhode-Island-Salary.htm", "passage_text": "University of Rhode Island Salary. University of Rhode Island average salary is $55,383, median salary is $50,099 with a salary range from $22,000 to $118,450. University of Rhode Island salaries are collected from government agencies and companies. Each salary is associated with a real job position."}, {"url": "http://faculty-salaries.startclass.com/l/11430/University-of-Rhode-Island", "passage_text": "In 2013 male professors at University of Rhode Island had an average monthly salary of $11,779. This is $44 more than male professors earned per month in 2012, the most recently reported prior year, and a 0.4 percent increase in monthly earnings over the previous year's average monthly salary ($11,735)."}, {"url": "http://www.salarylist.com/company/University-Of-Rhode-Island-Salary.htm", "passage_text": "University of Rhode Island average salary is $55,383, median salary is $50,099 with a salary range from $22,000 to $118,450. University of Rhode Island salaries are collected from government agencies and companies. Each salary is associated with a real job position."}, {"url": "http://www.american-school-search.com/faculty/university-of-rhode-island", "passage_text": "Faculty monthly salaries at University of Rhode Island vary approximately from $4,000 to $12,000. The average full-time faculty salary at this college is approximately $109,000 a year, it is 5% lower than Rhode Island average faculty compensation."}, {"url": "http://faculty-salaries.startclass.com/l/11430/University-of-Rhode-Island", "passage_text": "In 2013 professors at University of Rhode Island had an average nine month salary of $103,554. This is $496 more than professors earned in 2012, the most recently reported prior year, and a 0.5 percent increase in earnings over the previous year's average nine month salary ($103,058)."}, {"url": "http://faculty-salaries.startclass.com/l/11430/University-of-Rhode-Island", "passage_text": "In 2013 male professors at University of Rhode Island had an average nine month salary of $106,008. This is $388 more than male professors earned in 2012, the most recently reported prior year, and a 0.4 percent increase in earnings over the previous year's average nine month salary ($105,620)."}, {"url": "http://faculty-salaries.startclass.com/l/11430/University-of-Rhode-Island", "passage_text": "In 2013 professors at University of Rhode Island had an average monthly salary of $11,506. This is $55 more than professors earned per month in 2012, the most recently reported prior year, and a 0.5 percent increase in monthly earnings over the previous year's average monthly salary ($11,451)."}]