[{"url": "http://www.athleticscholarships.net/history-rowing.htm", "passage_text": "The History of the Sport of Rowing. The sport of rowing has been in existence as long as humans have traveled the water by boat. The first reference to rowing as a sport, and not simply as a means of transportation, comes from a fifteenth century BC Egyptian funerary carving. The writer Virgil mentioned rowing as part of the funeral games for Aeneas."}, {"url": "https://en.wikipedia.org/wiki/Rowing_(sport)", "passage_text": "Modern rowing as a competitive sport can be traced to the early 18th century when races were held between professional watermen on the River Thames in London, United Kingdom. Often prizes were offered by the London Guilds and Livery Companies."}, {"url": "http://www.academia.lt/index.php/pageid/887", "passage_text": "Did you know that rowing first became popular in ancient Egypt, Greece and Rome? Of course, at that time, boats served as vehicles for transportation and war, as opposed to sporting activities. The ancient Romans prepared rowing regattas for entertainment, whereas in Greece it was more common to use boats to wage war."}, {"url": "http://www.academia.lt/index.php/pageid/887", "passage_text": "By the middle of the 19th century rowing had become very popular in England and America. At that time big stakes were set and rowers could win impressive monetary prizes. The rowing champion, Ned Hanlan of Canada, is famous for becoming the first world champion in all branches of the sport!"}, {"url": "https://en.wikipedia.org/wiki/Rowing_(sport)", "passage_text": "Rowing, often referred to as crew in the United States, is a sport with origins back to Ancient Egyptian times. It is based on propelling a boat (racing shell) on water using oars. By pushing against the water with an oar, a force is generated to move the boat."}, {"url": "http://paddling.about.com/od/rowingcrew/a/learn_rowing.htm", "passage_text": "Clive Brunskill/Staff/Getty Images Sport/Getty Images. Rowing is one of the oldest sports in existence and has been a part of the Olympic games since 1900. Besides its age, rowing has another remarkable characteristic that distinguishes itself from other sports, activities, or fitness regimens."}, {"url": "http://rowinghistory.net/unique.htm", "passage_text": "Rowing is America s oldest intercollegiate sport, and one of its least understood. In 1876, it was the only college sport that had a place at our national Centennial celebration in Philadelphia, and, in those days, it drew more spectators to its contests than any other team sport in the country."}, {"url": "http://rowinghistory.net/unique.htm", "passage_text": "Rowing became one of the first team sports because rowing was already a part of everyday adult life when organized sport began to take hold. It wasn t very hard to get a boat race going when major cities were sited on rivers or coasts, and watermen provided one of the principal means of transport."}]