[{"url": "http://www.accountingcoach.com/terms/D/deferral", "passage_text": "deferral. In accounting this means to defer or to delay recognizing certain revenues or expenses on the income statement until a later, more appropriate time. Revenues are deferred to a balance sheet liability account until they are earned in a later period. When the revenues are earned they will be moved from the balance sheet account to revenues on the income statement."}, {"url": "http://www.thefreedictionary.com/defer", "passage_text": "syn: defer, delay, postpone imply keeping something from occurring until a future time. To defer is to decide to do something at a more convenient time in the future; it often suggests avoidance: to defer making a payment. delay is sometimes equivalent to defer, but it usu. suggests a hindrance or dilatory tactic: Completion of the work was deferred by bad weather. Synonyms: defer 1, postpone, shelve, suspend. These verbs mean to put off until a later time: deferred paying the bills; postponing our trip; shelved the issue; suspending train service."}, {"url": "http://www.yourdictionary.com/defer", "passage_text": "LINK / CITE ADD TO WORD LIST. verb. To defer is defined as to delay something until later or to give into someone else. 1  An example of defer is when you tell the college to hold your place because you want to work for a year. 2  An example of defer is when you let your husband have his way. "}, {"url": "http://www.businessdictionary.com/definition/deferred-payment.html", "passage_text": "Definition. A loan arrangement in which the borrower is allowed to start making payments at some specified time in the future. Deferred payment arrangements are often used in retail settings where a person buys and receives and item with a commitment to begin making payments at a future date."}, {"url": "http://www.merriam-webster.com/dictionary/defer", "passage_text": "1 Backers say the arrangement will make patients more cost-conscious and judicious in their use of medical service, thus restraining health-cost increases; critics say it will cause patients to defer needed treatment and will be attractive only to younger, healthier workers. Synonym Discussion of DEFER. defer, postpone, suspend, stay mean to delay an action or proceeding. defer implies a deliberate putting off to a later time. postpone implies an intentional deferring usually to a definite time."}, {"url": "http://www.oxforddictionaries.com/definition/english/defer", "passage_text": "1 Put off (an action or event) to a later time; postpone: they deferred the decision until February. More example sentences. Synonyms. 1  The Government decision to defer the programme is to be hailed. 1.1 Law (Of a judge) postpone (a sentence) so that the circumstances or conduct of the defendant can be further assessed: the judge deferred sentence until 5 April for background reports. More example sentences. 1  Sentence was deferred for reports until June 5 and they were remanded in custody."}, {"url": "http://www.merriam-webster.com/dictionary/defer", "passage_text": "Examples of DEFER. 1  Backers say the arrangement will make patients more cost-conscious and judicious in their use of medical service, thus restraining health-cost increases; critics say it will cause patients to defer needed treatment and will be attractive only to younger, healthier workers. Synonym Discussion of DEFER. defer, postpone, suspend, stay mean to delay an action or proceeding. defer implies a deliberate putting off to a later time. postpone implies an intentional deferring usually to a definite time."}, {"url": "http://www.thefreedictionary.com/defer", "passage_text": "de·fer′ra·ble adj. de·fer′rer n. Synonyms: defer 1, postpone, shelve, suspend. These verbs mean to put off until a later time: deferred paying the bills; postponing our trip; shelved the issue; suspending train service."}, {"url": "http://dictionary.cambridge.org/us/dictionary/english/defer-to-someone", "passage_text": "defer to someone. — phrasal verb with defer us /dɪˈfɜr/ verb [T] (-rr-). › to ​let another ​person ​decide, or to ​accept another person’s ​opinion, usually because you ​respect the ​knowledge or ​experience of that ​person: I deferred to Brian on the ​question of what to ​serve at the ​party."}]