[{"url": "http://www.qwhatis.com/what-is-aorta/", "passage_text": "Abdominal aorta – half of the descending aorta that is below the diaphragm. In the abdomen, the aorta is divided into the single celiac, superior mesenteric and inferior mesenteric, and the paired renal and internal spermatic or ovarian arteries. Other branches are distributed through other organs and the body wall. If you like this article, you might also like.... 1  What is Aortic Aneurysm? 2  What is aortic dissection? 3  What is aortic stenosis? 4  What is Lymphatic System? 5  What is aortic regurgitation? 6  What is CDH? 7  What is Angina? 8  What is Low Blood Pressure? 9  What is Oxygen Saturation? 10  What is CVD?"}, {"url": "http://archive.ahrq.gov/patients-consumers/prevention/screening/aaapatient.html", "passage_text": "An aneurysm (AN-yuh-rizm) is a bulge in a weakened blood vessel. An aneurysm can lead to serious problems. Your heart pumps blood to the lower part of your body through a large blood vessel called the abdominal aorta.. If an aneurysm develops here, it is called an abdominal aortic aneurysm. 1 A large aneurysm can burst. 2  This is very serious, and can even result in death. 3  If you have a large aneurysm, you may need surgery. 4  Finding large aneurysms with screening before they burst may make the surgery and recovery easier."}, {"url": "http://www.qwhatis.com/what-is-aorta/", "passage_text": "Blood pressure is highest at the aorta and decreases as it travels and divides into arteries, arterioles, and capillaries making the flow slow and smooth for nutrient and gas exchange. Because the aorta is a flexible artery, it beats accordingly with the heart. It made up of an assorted mixture of nerves, endothelial cells, complex extracellular matrix, fibroblast-like cells, intimal cells and smooth muscles. If you like this article, you might also like.... 1  What is Aortic Aneurysm? 2  What is aortic dissection? 3  What is aortic stenosis? 4  What is Lymphatic System? 5  What is aortic regurgitation? 6  What is CDH? 7  What is Angina? 8  What is Low Blood Pressure? 9  What is Oxygen Saturation? 10  What is CVD?"}, {"url": "http://www.dicardiology.com/article/tavi-planning-software-introduced", "passage_text": "The software helps evaluate the aortic anatomy of patients to see if the route is clear for the larger delivery catheters required for the procedure. A heavily calcified aorta may disqualify a patient from the femoral access route. The software helps automate manipulation of a CT dataset to quickly extract only the anatomy of interest and measurements, such as sizing of the aortic valve annulus and evaluation of clearance between the new valve and the right and left main coronary arteries."}, {"url": "http://www.massgeneral.org/heartcenter/faq.aspx", "passage_text": "An aneurysm is a dilatation-or a bulging ballooning out-of the walls of an artery. An aortic aneurysm is bulging out of the walls of the aorta, which is the largest artery in the body and carries oxygen-rich blood from the heart to the rest of the body. The surgery to repair aortic aneurysms carries a small but real risk. (This risk varies based on the patient’s age, the patient’s overall health condition, the location and extent of the aneurysm and the volume of aortic procedures performed by the surgeon and at the center where the surgery is performed)."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=8635", "passage_text": "Thoracic aorta: The thoracic aorta is a section of the aorta, the largest artery in the body, within the chest. Specifically, the thoracic aorta is that part of the aorta that starts after the arch of the aorta and runs down to the diaphragm, the great muscle that separates the chest from the abdomen. The thoracic aorta gives off numerous branches that supply oxygenated blood to the chest cage and the organs within the chest. Like the other sections of the aorta (the ascending aorta, aortic arch and abdominal aorta), the thoracic aorta is an arbitrary anatomic entity. The aorta is one continuous conduit that stems from the left ventricle of the heart to carry blood to most of the body"}, {"url": "http://www.aortasoftware.com/", "passage_text": "Businesses of all sizes rely on countless systems to run smoothly. AORTA gets all those separate systems talking to each other, increasing efficiency and reducing overhead costs tied to everyday development, operations, installation, and management. By using APIs, AORTA converts closed systems into open, configurable services. APIs make it possible to automate functions that that would otherwise require multiple steps across multiple systems, optimizing the way you do business. And when you optimize, everyone wins — even your customers"}, {"url": "http://www.qwhatis.com/what-is-aorta/", "passage_text": "Then it is divided into two arteries called the iliac arteries that deliver blood to the legs. The aorta has five divisions which are: Ascending aorta – located amid the arc of aorta and the heart. Arch of aorta – located on the top most branch that gives the impression of a reversed “U”. If you like this article, you might also like.... 1  What is Aortic Aneurysm? 2  What is aortic dissection? 3  What is aortic stenosis? 4  What is Lymphatic System? 5  What is aortic regurgitation? 6  What is CDH? 7  What is Angina? 8  What is Low Blood Pressure? 9  What is Oxygen Saturation? 10  What is CVD?"}, {"url": "http://www.aortarepair.com/basics-of-the-surveillance-program.html", "passage_text": "The Aortic Aneurysm Surveillance Program is one of the largest of its kind in the United States. This is a formal aortic program which evaluates your aortic aneurysm or dissection, underlying connective tissue disorder or valve problem(s) and determines the best surveillance program which meets your needs. If needed, we will recommend you and possibly your family members to a geneticist. During your visit you and family members will have ample time to discuss your condition and new symptoms with the doctor. Your primary care physician and cardiologist will be informed by mail of your evaluation and new imaging studies."}]