[{"url": "http://healthyeating.sfgate.com/nutrients-liver-kidney-4358.html", "passage_text": "Magnesium. Prevent kidney stones by getting plenty of magnesium in your diet, according to Dr. James F. Balch, author of the book Prescription for Natural Cures: A Self-Care Guide for Treating Health Problems with Natural Remedies, Including Diet and Nutrition, Nutritional Supplements, Bodywork and More.. Each day, your liver carries out more than 400 different functions that help you digest food, store nutrients, produce proteins and detoxify your body. Your kidneys use a specialized filtration system to continually purify your blood and produce urine"}, {"url": "https://answers.yahoo.com/question/index?qid=20091015104033AAhRNZg", "passage_text": "Best Answer: Eating healthy foods for the liver can improve and support liver function on a daily basis. Having a healthy liver results in greater energy and general well-being. A poorly functioning liver can result in tiredness, headaches, bad breath, allergies and intolerances, problem skin and weight gain. Bitter leafy salad greens (dandelion, chicory, endive, rocket). The bitterness of these foods helps to stimulate bile flow within the liver. Good food for kidneys: Apple Apples can be eaten raw, baked, or drunk, which makes them a very versatile food."}, {"url": "http://woman.thenest.com/foods-promote-healthy-kidney-liver-1242.html", "passage_text": "Fruits and vegetables contain antioxidants, which promote kidney and liver health. Your kidneys and liver are responsible for a variety of functions, but both organs work as as filters that remove toxins and waste products from your body. Diets high in preservatives, chemicals, toxins, refined sugar, hydrogenated fats or protein can damage your kidneys and liver, leading to dysfunction and disease. Produce rich in these potent nutrients include citrus fruits, most berries, dark-colored grapes, apples, tomatoes, carrots, broccoli, spinach and asparagus, the “American Dietetic Association Complete Food and Nutrition Guide” notes."}, {"url": "http://www.livestrong.com/article/328091-foods-and-drinks-for-liver-and-kidney-cleansing/", "passage_text": "The liver, your largest internal organ, aids in digestion, produces bile to break down fats and absorb nutrients and rids the body of toxic substances. For kidney and liver cleansing, eat a whole foods diet, low in animal protein and saturated fat. Avoid alcohol, caffeine, tobacco and unnecessary drug"}, {"url": "http://healthyeating.sfgate.com/foods-increase-kidney-function-6538.html", "passage_text": "Kidney stones can develop when minerals build up in your urine. However, eating a diet rich in fruits and vegetables, and low in salt or oxalate-rich food can help prevent mineral build up. Additionally, drinking lots of water throughout the day, especially if you exercise frequently, is important for kidney health."}, {"url": "https://answers.yahoo.com/question/index?qid=20091015104033AAhRNZg", "passage_text": "First are those that promote the detoxification process of the liver. And second, are those that are high in antioxidants and therefore protect the liver while it's carrying out its detoxification processes. Below are a list of the top eight foods that are considered to be good for your liver. Garlic and onions. Garlic contains allicin which is a sulphur-based compound needed by the liver for effective detoxification. Garlic helps the liver rid the body of mercury, certain food additives and the hormone oestrogen. Bitter leafy salad greens (dandelion, chicory, endive, rocket). The bitterness of these foods helps to stimulate bile flow within the liver. Good food for kidneys: Apple Apples can be eaten raw, baked, or drunk, which makes them a very versatile food."}, {"url": "http://www.livestrong.com/article/328091-foods-and-drinks-for-liver-and-kidney-cleansing/", "passage_text": "Overview. The kidneys and liver are organs of detoxification and elimination that help your body filter waste. The kidneys regulate sodium and mineral levels, excreting extra salts so that toxins do not build up in your body. For kidney and liver cleansing, eat a whole foods diet, low in animal protein and saturated fat."}, {"url": "http://yourkidneys.com/kidney-education/Diet-and-nutrition/15-super-foods-for-kidney-health/2924", "passage_text": "If you have kidney disease, it's important that you consult a renal dietitian and follow a kidney diet. Including super foods in your kidney diet eating plan can help you increase your intake of nutrients and antioxidants. Here’s a list of the top 15 kidney-friendly super foods. Most of us know that eating a balanced diet is important for good health. Now scientists have pinpointed certain foods as super foods. In addition to promoting overall health, these are foods for kidney health as well."}]