[{"url": "http://www.cumc.columbia.edu/pediatrics/patient-care/allergy-immunology/research/hives", "passage_text": "Hives or urticaria are a type of rash consisting of itchy, swollen, red welts. The itching may be mild or severe. Foods, medications, infections, exercise, scratching, alcoholic beverages, emotional stress and many other factors may worsen hives. The most common cause of hives is infections. Foods such as eggs, nuts and shellfish are common causes of urticaria. Medications such as aspirin and antibiotics (especially penicillin and sulfa) also are common causes of hives. Infections causing hives include the common cold, and other viral"}, {"url": "http://www.webmd.com/skin-problems-and-treatments/guide/hives-urticaria-angioedema", "passage_text": "Urticaria, also known as hives, is an outbreak of swollen, pale red bumps or plaques (wheals) on the skin that appear suddenly -- either as a result of the body's reaction to certain allergens, or for unknown reasons. Hives usually cause itching, but may also burn or sting. Drugs that can cause hives and angioedema include aspirin and other nonsteroidal anti-inflammatory medications such as ibuprofen, high blood pressure drugs (ACE inhibitors), or painkillers such as codeine."}, {"url": "http://umm.edu/health/medical/altmed/condition/angioedema/", "passage_text": "Angioedema is like hives, but with hives there are itchy red welts on the surface of your skin. Angioedema is a deeper swelling. Both hives and angioedema are usually caused by an allergic reaction to either a food or medication. Things like pollen or insect stings can also cause angioedema. In rare cases, it may be a sign of an underlying condition, such as leukemia or Hodgkin's disease. There are two basic types of angioedema: "}, {"url": "http://www.cumc.columbia.edu/pediatrics/patient-care/allergy-immunology/research/hives", "passage_text": "Acute episodes of urticaria last for six weeks or less. Acute urticaria can be due to infections foods, medications, insect stings, blood transfusions and infections. The most common cause of hives is infections. Foods such as eggs, nuts and shellfish are common causes of urticaria. Medications such as aspirin and antibiotics (especially penicillin and sulfa) also are common causes of hives. Infections causing hives include the common cold, and other viral infections."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/guide/hives-urticaria-angioedema", "passage_text": "The most common causes are certain foods, medications, or infections. Insect bites and internal disease may also be responsible. The most common foods that cause hives are nuts, chocolate, fish, tomatoes, eggs, fresh berries, and milk. Fresh foods cause hives more often than cooked foods. Drugs that can cause hives and angioedema include aspirin and other nonsteroidal anti-inflammatory medications such as ibuprofen, high blood pressure drugs (ACE inhibitors), or painkillers such as codeine."}, {"url": "http://www.webmd.com/allergies/guide/hives-urticaria-angioedema", "passage_text": "1 The most common causes are foods, medicines, latex, or infections. 2  Insect bites and internal disease may also be responsible. 3  The most common foods that cause hives are nuts, chocolate, fish, tomatoes, eggs, fresh berries, soy, wheat, and milk. 4  Fresh foods cause hives more often than cooked foods. A. Hives, also known as urticaria, are an outbreak of swollen, pale red bumps, patches, or welts on the skin that appear suddenly -- either as a result of allergies, or for other reasons. Hives usually cause itching, but may also burn or sting."}, {"url": "http://www.cancerresearchuk.org/about-cancer/coping-with-cancer/coping-physically/skin/types-of-skin-problems-with-cancer", "passage_text": "Some treatments for cancer can cause problems with your skin. Some types of biological therapy and hormone therapy cause skin rashes. You can look at the list of individual cancer drugs in the cancer treatment section to find out whether your treatment causes skin problems, and what can help. Some chemotherapy drugs can make your skin dry and itchy or more sensitive to the sun. You can find out more about chemotherapy effects on your skin in the general side effects of cancer drugs section. Radiotherapy can also cause skin problems."}]