[{"url": "https://answers.yahoo.com/question/index?qid=20080425144443AAmgo6k", "passage_text": "Report Abuse. Eggs usually survive 12-24 hours after release. However, sometimes another egg is released within 24 hours of the first egg (how you get fraternal twins), which means you could still get pregnant 48 hours after ovulation. Its possible that's what happened-the timing for the spotting looks good"}, {"url": "http://www.babycenter.com/400_how-long-do-you-ovulate-for_2405608_886.bc", "passage_text": "Yes | No Thank you! sperm can live up to 5 days, not 3. a human egg is only viable for 12 to 24 hours, you can get pregnant anytime from about five days prior to ovulation to even occasionally two days after, for a total of about seven days. "}, {"url": "http://www.sophisticatededge.com/how-long-after-ovulation-is-the-egg-viable.html", "passage_text": "An egg is viable for 12-24 hours after ovulation. More Info: Conception must occur within the 12-24 hour time period or the egg will die, and a menstrual cycle will begin approximately two weeks after. Because every woman is different, it is often hard to predict exactly when ovulation might occur"}, {"url": "https://answers.yahoo.com/question/index?qid=20080523130135AASoT65", "passage_text": "The egg is fertilized by the sperms within 24 hours. The fertilized egg travels down the tube, sits around in there for about 3 days then heads to the uterus floating around looking for a nice cushion, finds it, and implants about five days after it heads out of the tubes. Ovulation happens once a month most of the time. babydollies · 7 years ago."}, {"url": "http://www.clearblueeasy.com/ovulation.php", "passage_text": "The egg can be fertilized for up to 24 hours after ovulation. If it isn‘t fertilized the lining of the womb is shed and your period begins. This marks the start of the next cycle. While an egg is only viable for about 24 hours, sperm can remain active for up to five days. 1 The so–called LH surge causes the release of the egg from the ovary and you‘re ovulating. 2  Ovulation normally occurs 24 to 36 hours after the LH surge, which is why LH is a good predictor for peak fertility."}, {"url": "https://answers.yahoo.com/question/index?qid=20080425144443AAmgo6k", "passage_text": "Best Answer: The egg typically survives no more than 12-24 hours after ovulation. But that doesn't mean you could get pregnant from making love shortly after ovulation. However, sometimes another egg is released within 24 hours of the first egg (how you get fraternal twins), which means you could still get pregnant 48"}, {"url": "https://answers.yahoo.com/question/index?qid=20080523130135AASoT65", "passage_text": "You ovulate once a month and the egg stays viable for 12-24 hours. If your trying to get pregnant, having sex before you ovulate makes conceiving more likely. Emily · 7 years ago. Thumbs up. The fertilized egg travels down the tube, sits around in there for about 3 days then heads to the uterus floating around looking for a nice cushion, finds it, and implants about five days after it heads out of the tubes. Ovulation happens once a month most of the time. babydollies"}, {"url": "http://www.answers.com/Q/How_long_after_ovulation_is_egg_viable", "passage_text": "About 3 days after egg is released and intercourse is conducted. U will know ur pregnant two weeks after that. Example, egg release on 1st of month, then have sex in next 12 h … ours, egg is fertilized by the 4th of the month. It takes 72 hours after egg is released to b fertilized. A hit or miss situation every month"}, {"url": "http://www.menstruation-info-with-doc.com/how-long-does-ovulation-last.html", "passage_text": "This is about the lifespan of the ovum. Once released, the egg stays viable for 12 to 24 hours during which it must be fertilized for conception to occur. However, sperms remain viable for up to 3 days when deposited in the female genital tract. That means you must not have sex on the ovulation date to become pregnant. "}]