[{"url": "https://en.wikipedia.org/wiki/Emissaries_of_Divine_Light", "passage_text": "The trustees of Emissaries of Divine Light lead the Creative Field Project. The project is an exploration of the power of human intention to influence the field of energy held by a group of people. The Creative Field Project began in 2009 with a network of small groups around the world that meet monthly by telephone. In August 2004, the trustees of Emissaries of Divine Light named David Karchere as the leader of the global network. In 2008, David Karchere and Jane Anetrini developed and taught a year-long Leadership Program based on the teachings of Emissaries of Divine Light."}, {"url": "https://en.wikipedia.org/wiki/Emissaries_of_Divine_Light", "passage_text": "The mission of Emissaries of Divine Light, as cited in its articles of incorporation, is to assist in the spiritual regeneration of humanity under the inspiration of the spirit of God. In August 2004, the trustees of Emissaries of Divine Light named David Karchere as the leader of the global network. In 2008, David Karchere and Jane Anetrini developed and taught a year-long Leadership Program based on the teachings of Emissaries of Divine Light."}, {"url": "https://www.emissary.io/about-us/", "passage_text": "About us. Emissary was founded on the belief that everybody has valuable experience— but we don't know who it's valuable to, or how much it's worth. We're creating technology that makes it easier than it's ever been for people and businesses to benefit from each other's experiences. Prior to Emissary, David spent 6 years as a product manager at Google, where he founded Google’s Doubleclick Bid Manager product, a central component of Google’s Display Advertising business."}, {"url": "http://www.definitions.net/definition/Emissary", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: emissary (Noun). An agent sent on a mission to represent the interests of someone else. emissary (Noun). A venous channel in the skull. Emissary. Emissary is the first and second episodes, comprising the pilot, of the science fiction television series Star Trek: Deep Space Nine. A new crew takes command of an abandoned space station and makes an astonishing discovery that will change the galaxy."}, {"url": "https://www.emissary.io/about-us/", "passage_text": "Mike heads up the Advisor Operations team at Emissary. Prior to Emissary, Mike co-founded a medical-social networking startup in 2007 and pursued a PhD in the philosophy of science. (He loves discussing the minutia of sliding blocks and inclined planes). Prior to Emissary, David spent 6 years as a product manager at Google, where he founded Google’s Doubleclick Bid Manager product, a central component of Google’s Display Advertising business."}, {"url": "http://www.emissarytransition.com/home/", "passage_text": "Emissary Transition Group (ETG) is a woman owned company founded to encourage sustainable economic growth in fragile and in-transition environments thus reducing violence and restoring stability. © 2015 Emissary Transition Group. "}, {"url": "http://emissary.com/", "passage_text": "Contract Research Organization (CRO). Emissary International has been navigating the clinical trials process for over a decade, earning itself a second-to-none reputation with clients in the medical device, pharmaceutical, biotechnology and contract research organization (CRO) industries. In this environment, experience and knowledge become critical in expediting clinical research programs. This is the reason Emissary places high value on the experience of its team. Emissary is proud of its track record in the vigilant planning, managing and monitoring of clinical research studies."}, {"url": "http://www.merriam-webster.com/dictionary/emissary", "passage_text": ": a person who is sent on a mission to represent another person or organization. "}, {"url": "https://www.emissary.io/about-us/", "passage_text": "David Hammer. As founder and CEO, David leads the Emissary team on its mission to democratize access to experience. Prior to Emissary, David spent 6 years as a product manager at Google, where he founded Google’s Doubleclick Bid Manager product, a central component of Google’s Display Advertising business."}, {"url": "https://www.emissary.io/", "passage_text": "Profit from experience. We connect teams seeking an edge with the advisors who provide an inside track to win more deals, waste less time, and make better decisions. "}]