[{"url": "http://startlowcarb.com/get-into-reach-ketosis-fast/", "passage_text": "Ketosis happens when carbs are very low, usually when you eat 20 to 50 grams of carbs (or less) per day. Typical Keto Ratio. Getting into ketosis requires eating meals that are high in healthy fats and low in carbs."}, {"url": "http://www.grassfedgirl.com/10-tips-for-getting-into-nutritonal-ketosis-for-weight-loss/", "passage_text": "Ketosis is an eating plan where the body uses ketones to fuel the brain and body instead of glucose like most people use when on the SAD (standard American diet). It can be very helpful for blood sugar and consistent energy because fat is a very stable source of fuel."}, {"url": "http://www.grassfedgirl.com/10-tips-for-getting-into-nutritonal-ketosis-for-weight-loss/", "passage_text": "When you are in ketosis, fat will need to be 70-85% of your calories. Make sure to eat only healthy fats listed here: 3. Get A Meter. Get a ketone blood meter (find resources here from the King of Keto: Jimmy Moore) and the testing sticks."}, {"url": "http://startlowcarb.com/get-into-reach-ketosis-fast/", "passage_text": "Cut Carbs to Reach Keto. The fastest way to reach ketosis using your diet is by limiting carbs to 20% of total calories per day, but some low carbers eat ver y low amounts of carbs – less than 5%. How to Eat Carbs for Keto. Choose the lowest carb fruits and the lowest carb veggies. Cover them with healthy fats."}, {"url": "http://startlowcarb.com/get-into-reach-ketosis-fast/", "passage_text": "In order to reach ketosis you’ll need to burn off all additional glycogen supplies. To get into ketosis fast, change your workout. How to Exercise for Keto. 1  Try a HIIT routine (short bursts of exercise followed by short periods of rest) for maximum sugar-burning with minimal effort."}, {"url": "http://www.livestrong.com/article/553603-how-long-does-it-take-for-the-ketosis-diet-to-work/", "passage_text": "The rate of weight loss on a ketosis diet varies, and how long it takes to work depends on how much weight you need to lose, but you may be able to lose more than 12 pounds in a month."}, {"url": "http://lowcarbediem.com/quick-start-ketosis-low-carb-foods-list/", "passage_text": "The fastest way to reach ketosis using your diet is by limiting carbs: 20 to 50 grams per day, or less than 10% of total daily calories."}, {"url": "http://www.paleohacks.com/ketosis/how-long-does-it-take-to-reach-ketosis-16885", "passage_text": "It only takes 1-3 days to get into ketosis. But getting in ketosis is easy, becoming keto-adapted is the tricky part. It usually takes a month to get to the first stage of becoming keto-adapted, and it takes up to 2 years to fully train your body to use ketones fully."}]