[{"url": "http://www.homeadvisor.com/cost/inspectors-and-appraisers/hire-a-home-inspector/", "passage_text": "1 On average, you should expect to spend $400-$800 for a 1,500 square foot house including lab fees, and then another $200-$400 for a re-inspection after the project is complete. 2  Asbestos removal can cost anywhere from $400-$30,000 depending on the amount of asbestos present. 1 Having the home checked for asbestos is probably worth it in older homes with popcorn ceilings. 2  However it does come at a hefty cost. 3  On average, you should expect to spend $400-$800 for a 1,500 square foot house including lab fees, and then another $200-$400 for a re-inspection after the project is complete."}, {"url": "http://portal.hud.gov/hudportal/HUD?src=/program_offices/housing/sfh/insp/inspfaq", "passage_text": "How much will it cost? Costs vary dramatically, depending on the region, size and age of the house, scope of services and other factors. A typical range might be $300-$500, but consider the value of the home inspection in terms of the investment being made. Cost does not necessarily reflect quality. HUD Does not regulate home inspection fees."}, {"url": "http://www.zillow.com/advice-thread/Typically-How-much-do-Home-inspections-cost/427301/", "passage_text": "Let's put home inspection fees in perspective: If you're buying a $400,000 house and the inspection fee is $700, that's less than .2% of the cost of the house! Most real estate agencies charge 3% to 6% to sell a home, that would be $12,000 to $24,000 for a $400,000 house! There is no licensing in Nebraska. My charge for an inspection would be $300 - $500 for a single structure, depending on size. There is an additional charge for outbuildings and homes over 50 years old because of concerns over older electrical wiring and plumbing."}, {"url": "http://www.homeadvisor.com/cost/inspectors-and-appraisers/hire-a-home-inspector/", "passage_text": "1 However it does come at a hefty cost. 2  On average, you should expect to spend $400-$800 for a 1,500 square foot house including lab fees, and then another $200-$400 for a re-inspection after the project is complete. 3  Asbestos removal can cost anywhere from $400-$30,000 depending on the amount of asbestos present. 1 Having the home checked for asbestos is probably worth it in older homes with popcorn ceilings. 2  However it does come at a hefty cost. 3  On average, you should expect to spend $400-$800 for a 1,500 square foot house including lab fees, and then another $200-$400 for a re-inspection after the project is complete."}, {"url": "http://www.bls.gov/ooh/Construction-and-Extraction/Construction-and-building-inspectors.htm", "passage_text": "11%. Employment of construction and building inspectors is projected to grow 12 percent from 2012 to 2022, about as fast as the average for all occupations. Concern for public safety and a desire to improve the quality of construction should continue to increase demand for inspectors. The median annual wage for construction and building inspectors was $53,450 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $32,050, and the top 10 percent earned more than $83,760."}, {"url": "http://www.homeimprovementpages.com.au/article/how_much_does_a_building_inspection_cost", "passage_text": "There is no flat rate for building inspections, as the fee will depend on the size of your property. On the lower end of the scale, an inspection of a small property might only cost between $200 and $300. For an average sized house in a regional area, the cost is usually somewhere between $400 and $500. In metropolitan areas, a complete inspection can be closer to $800 or up to $1000. Pest inspections are less extensive and so tend to cost less. Expect to shell out around $100-$150 for a pest inspection."}, {"url": "http://www.homeadvisor.com/cost/inspectors-and-appraisers/hire-a-home-inspector/", "passage_text": "1 This varies by inspector and how they compile reports. 2  The average rate for home inspection is around $200-$600 based on where you live. 3  Some inspectors can charge up to $800 or more. 4  As with most things, paying the lowest cost for a home inspection isn't always in your best interest. 1 Having the home checked for asbestos is probably worth it in older homes with popcorn ceilings. 2  However it does come at a hefty cost. 3  On average, you should expect to spend $400-$800 for a 1,500 square foot house including lab fees, and then another $200-$400 for a re-inspection after the project is complete."}, {"url": "http://portal.hud.gov/hudportal/HUD?src=/program_offices/housing/sfh/insp/inspfaq", "passage_text": "The average on-site inspection time for a single inspector is two to three hours for a typical single-family house; anything significantly less may not be enough time to perform a thorough inspection. Additional inspectors may be brought in for very large properties and buildings. Costs vary dramatically, depending on the region, size and age of the house, scope of services and other factors. A typical range might be $300-$500, but consider the value of the home inspection in terms of the investment being made. Cost does not necessarily reflect quality. HUD Does not regulate home inspection fee"}]