[{"url": "http://www.answers.com/Q/What_parts_of_an_earthworm_serve_as_its_brain_and_how_are_these_parts_connected_to_the_rest_of_the_body", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Peterperrino. Confidence votes 92. 2 The earthworm's brain consists of the celebral ganglion, and is connected to the rest of the body through the ventral nerve cord. By a complex system of nerves.The brain has a large system of nerves that make up the spinal cord and these branch out to different parts of the body as they pass down t … he spine. 4 people found this useful. Emdrgreg. 108,323 Contributions."}, {"url": "https://en.wikipedia.org/wiki/Earthworm", "passage_text": "An earthworm is a tube-shaped, segmented worm found in the phylum Annelida. They are commonly found living in soil, feeding on live and dead organic matter. Its digestive system runs through the length of its body. It conducts respiration through its skin. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070525161412AAse1MC", "passage_text": "Rating Newest Oldest. Best Answer: The earthworm has a cerebral ganglion, which serves as its brain. It is connected to the rest of the body by means of a ventral nerve cord. There is a swelling, called a ganglion, in each segment. 2. These two cerebral ganglia are connected to the rest of the body as follows: Sensory nerves leave the brain and run forward into the prostomium (extreme anterior end) and first segment. From there, a ventral nerve cord connects all the segments of the worm. 3."}, {"url": "http://www.southgateschools.com/web/userfiles/strightj/Earthworm%20Dissection.pdf", "passage_text": "2. Place a paper towel in the bottom of a dissection tray, and moisten it withwater. Place an earthworm on the towel. Identify the dorsal side, which is theworm’s rounded top, and the ventral side, which is its flattened bottom. Turnthe worm ventral side up, as shown in Figure 1"}, {"url": "http://www.answers.com/Q/What_part_of_the_earthworm_serves_as_the_brain", "passage_text": "2   The earthworm's brain consists of the celebral ganglion, and is connected to the rest of the body through the ventral nerve cord. + 68 others found this useful. exists and is an alternate of. Merge this question into. Split and merge into it. This answer has been marked for improvement. Answer by Robbb. Confidence votes 86.7K. the earthworm has a brain in its head or front behind its mouth which is connected to a nerve stem that runs along its bottom to the back."}, {"url": "https://answers.yahoo.com/question/index?qid=20080520191249AAsPNzo", "passage_text": "2. Subpharyngeal ganglion. It is continuous with the ventral nerve cord that runs the length of the body. 3. nepherida 2 per segment except for the first 5 and last one. 4. there will be some found in the crop of the worm. 5. they are used to hold on to the sides of the burrow and they help the worm move in and out of it. 6"}]