[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=2490", "passage_text": "Blood-thinner: A common name for an anticoagulant agent used to prevent the formation of blood clots. Blood-thinners do not really thin the blood. They prevent it from clotting. Blood-thinners (anticoagulants) have various uses. Some are used for the prophylaxis (prevention) of thromboembolic disorders; others are used for the treatment of thromboembolism."}, {"url": "http://www.mayoclinic.org/blood-thinners/expert-answers/FAQ-20058261", "passage_text": "Yes. Medications that are commonly called blood thinners — such as aspirin, warfarin (Coumadin, Jantoven), dabigatran (Pradaxa), rivaroxaban (Xarelto), apixaban (Eliquis) and heparin — significantly decrease your risk of blood clotting, but will not decrease the risk to zero. Also, blood thinners may not be able to lessen the strong blood-clotting tendency of an underlying disease, such as cancer. Interactions with other medications, food and alcohol are common with warfarin. These interactions are less so with other blood-thinning medications."}, {"url": "http://www.healthline.com/health/heart-disease/blood-thinners", "passage_text": "Learn how they work, who should take them, side effects, and natural remedies. Blood thinners are medications taken orally or intravenously to prevent a blood clot. Blood clots stop the flow of blood to the heart, lungs, or brain and can cause a heart attack or stroke. "}, {"url": "http://www.webmd.com/heart-disease/guide/warfarin-other-blood-thinners", "passage_text": "Warfarin may also prevent other clots from forming or prevent clots from becoming larger. There are other blood thinners that you may be given in the hospital or even at home for a short amount of time: Heparin, Lovenox, or Fragmin. A. A. Warfarin, which goes by the brand name Coumadin, is an anticoagulant medication. This means that it helps prevent clots from forming in the blood. Blood thinners are used to treat some types of heart disease. You have been prescribed warfarin because your body may be making blood clots or you may have a medical condition known to promote unwanted blood clots"}, {"url": "http://www.mayoclinic.org/blood-thinners/expert-answers/FAQ-20058261", "passage_text": "If you take a blood thinner, be sure to follow your doctor's advice on dosing and ask about foods and other medications — including over-the-counter drugs and herbal supplements — that may interfere with safety and efficacy of the blood thinner. With. Rekha Mankad, M.D. Also, blood thinners may not be able to lessen the strong blood-clotting tendency of an underlying disease, such as cancer. Interactions with other medications, food and alcohol are common with warfarin. These interactions are less so with other blood-thinning medications."}, {"url": "http://www.wisegeek.org/what-is-blood-thinner.htm", "passage_text": "10 hilariously insightful foreign words. A blood thinner, or anticoagulant, is a drug that is used to prevent blood clots from forming or to lengthen the time that it takes for blood clots to form. These drugs are often used by people who are at risk for heart attack, stroke or heart disease. Warfarin. In some cases, aspirin is not a strong enough blood thinner to address the risk of potentially life-threatening clots forming. The second most common blood thinner is warfarin. It is much stronger than aspirin, so its use must be carefully monitored."}, {"url": "http://www.texasheart.org/HIC/Topics/Meds/blodmeds.cfm", "passage_text": "1 Although anticoagulants are called blood thinners, these medicines do not really thin your blood. 2  Instead, they decrease the blood's ability to clot. 3  Decreased clotting keeps fewer harmful blood clots from forming and from blocking blood vessels. "}, {"url": "http://www.webmd.com/heart-disease/rm-quiz-blood-thinners", "passage_text": "The most common side effect of blood thinners is uncontrolled bleeding. That could be a cut that won't stop, pee that's red or brown, or bowel movements that are red or look like tar. Other signs are bruises you don't know how you got or a very bad headache. Call your doctor if you notice any of these. Some blood thinners need to be taken around the same time every day. If you forget to take yours, do it when you remember. Then take your next day's dose on your regular schedule. A pill box with slots for different days can help you stay on track. Call your doctor if you miss a day."}, {"url": "http://www.ahrq.gov/patients-consumers/diagnosis-treatment/treatments/btpills/btpills.html", "passage_text": "Your doctor has prescribed a medicine called a blood thinner to prevent blood clots. Blood clots can put you at risk for heart attack, stroke, and other serious medical problems. A blood thinner is a kind of drug called an anticoagulant (an-te-ko-AG-u-lent). Anti means against and coagulant means to thicken into a gel or solid. Blood thinner drugs work well when they are used correctly. To help you learn about your medicine, your doctor has given you this booklet to read."}]