[{"url": "http://work.chron.com/much-psychologists-paid-8216.html", "passage_text": "Salaries. Clinical, counseling and school psychologists in the U.S. averaged $72,310 a year, or $34.77 an hour, as of 2011, according to the Bureau of Labor Statistics. The highest-paid psychologists received more than $109,470, or $52.63 an hour, while the lowest-paid earned $39,270, or $18.88. Location. The state with the highest concentration of clinical, counseling and school psychologists was New Mexico, which had 2.1 psychologists per thousand workers, according to the BLS. Average wages were $61,880, or $29.75 an hour."}, {"url": "http://www.collegeatlas.org/highest-paying-psychology-careers.html", "passage_text": "As is the case with other psychology professions, experience greatly influences how much a clinical psychologist can earn. Clinical psychologists just getting started can expect to earn about $50,000 per year, where more experienced psychologists can earn up to $100,000 per year. For example, a psychiatrist working in a medical office with a few years of experience may earn roughly $150,000 per year, while a veteran psychiatrist working in an outpatient care center can make over $2"}, {"url": "http://www.insidejobs.com/articles/how-much-does-a-psychiatrist-make", "passage_text": "What is the average income of a Psychiatrist? The average income of a Psychiatrist was $167,610 as of May 2010, according to the U.S. Bureau of Labor Statistics. The lowest-paid 10 percent of Psychiatrists earn less than $65,530 per year, while the highest-paid 10 percent earn more than $166,400. The middle 50 percent of Psychiatrists are paid between $112,950 and $164,220 per year, meaning there’s a good chance that you’ll earn an average income of more than $100,000 annually."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_psychologist_earn", "passage_text": "1 The tend to make much less than a psychiatrist. 2  Depending on where they work...(private practice, hospitals, schools) psychologist salaries range from 20,000 to well, well over 100,000. 3  There is no real median. 4  Psychologists can be paid very different salaries and rates. 1 Clinical psychologists tend to earn $10-$15,000 more than registered psychologists, however, the top earners (once they have some experience) are organizational psychologists, who can earn up to $120,000."}, {"url": "http://work.chron.com/much-psychologists-paid-8216.html", "passage_text": "Industrial-organizational psychologists averaged $86,610, or $41.64 an hour. The highest pay for this specialty was more than $136,840, or $65.79, and the lowest was less than $38,910, or $18.71. These psychologists help businesses solve problems in management, personnel, administration, sales and marketing. Location. The state with the highest concentration of clinical, counseling and school psychologists was New Mexico, which had 2.1 psychologists per thousand workers, according to the BLS. Average wages were $61,880, or $29.75 an hour."}, {"url": "http://www.insidejobs.com/articles/how-much-does-a-forensic-psychologist-make", "passage_text": "The lowest-paid 10 percent of Forensic Psychologists earn less than $37,900 per year, while the highest-paid 10 percent earn more than $106,840. The average salary of a Forensic Psychologist is based on a number of factors, most notably the location of the position and the employer. For example, Forensic Psychologists employed in Arizona are paid $102,310 per year on average."}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-does-a-psychologist-make/", "passage_text": "The 10,350 other psychologists not listed separately by the Bureau nationwide earn an average annual salary of $86,360, which is equivalent to an hourly wage of $41.53. While the bottom ten percent in the profession earn $42,240 or less, the top ten percent of psychologists make considerably more at $116,240+ annually. "}, {"url": "http://www.answers.com/Q/How_much_money_does_a_psychologist_earn", "passage_text": "1 A psychologist holds a PhD or a PsyD (Doctor of Psychology) and treats mental disorders using psychotherapy. 2  The tend to make much less than a psychiatrist. 3  Depending on where they work...(private practice, hospitals, schools) psychologist salaries range from 20,000 to well, well over 100,000. 1 Clinical psychologists tend to earn $10-$15,000 more than registered psychologists, however, the top earners (once they have some experience) are organizational psychologists, who can earn up to $120,000."}]