[{"url": "http://chemistry.about.com/od/stoichiometry/a/reactionrate.htm", "passage_text": "Factors that influence the rate of a chemical reaction include temperature, state of matter of reactants, concentration, presence of catalysts, and pressure. PM Images, Getty Images. Anne Marie Helmenstine, Ph.D. For solids, the shape and size of the reactants makes a big difference in the reaction rate. Presence of Catalysts and Competitors. Catalysts (e.g., enzymes) lower the activation energy of a chemical reaction and increase the rate of a chemical reaction without being consumed in the process."}, {"url": "http://chemistry.about.com/od/stoichiometry/a/reactionrate.htm", "passage_text": "There are several factors that can influence chemical reaction rate. In general, a factor that increases the number of collisions between particles will increase the reaction rate and a factor that decreases the number of collisions between particles will decrease the chemical reaction rate. For solids, the shape and size of the reactants makes a big difference in the reaction rate. Presence of Catalysts and Competitors. Catalysts (e.g., enzymes) lower the activation energy of a chemical reaction and increase the rate of a chemical reaction without being consumed in the process."}, {"url": "https://en.wikipedia.org/wiki/Chemical_reaction", "passage_text": "The substance (or substances) initially involved in a chemical reaction are called reactants or reagents. Chemical reactions are usually characterized by a chemical change, and they yield one or more products, which usually have properties different from the reactants. In a synthesis reaction, two or more simple substances combine to form a more complex substance. These reactions are in the general form: Two or more reactants yielding one product is another way to identify a synthesis reaction."}, {"url": "https://en.wikipedia.org/wiki/Chemical_reaction", "passage_text": "The general concept of a chemical reaction has been extended to reactions between entities smaller than atoms, including nuclear reactions, radioactive decays, and reactions between elementary particles as described by quantum field theory. In a synthesis reaction, two or more simple substances combine to form a more complex substance. These reactions are in the general form: Two or more reactants yielding one product is another way to identify a synthesis reaction."}, {"url": "https://en.wikipedia.org/wiki/Chemical_reaction", "passage_text": "In biochemistry, a consecutive series of chemical reactions (where the product of one reaction is the reactant of the next reaction) form metabolic pathways. These reactions are often catalyzed by protein enzymes. In a synthesis reaction, two or more simple substances combine to form a more complex substance. These reactions are in the general form: Two or more reactants yielding one product is another way to identify a synthesis reaction."}, {"url": "https://en.wikipedia.org/wiki/Chemical_reaction", "passage_text": "Chemical equations are used to graphically illustrate chemical reactions. They consist of chemical or structural formulas of the reactants on the left and those of the products on the right. They are separated by an arrow (→) which indicates the direction and type of the reaction; the arrow is read as the word yields. In a synthesis reaction, two or more simple substances combine to form a more complex substance. These reactions are in the general form: Two or more reactants yielding one product is another way to identify a synthesis reaction."}, {"url": "http://www.science.uwaterloo.ca/~cchieh/cact/c120/reaction.html", "passage_text": "The most important aspect of a chemical reaction is to know what are the reactants and what are the products. For this, the best description of a reaction is to write an equation for the reaction. Skills to develop. 1  To distinguish chemical changes from physical changes. 2  To write chemical equations to describe a chemical reaction. 3  To balance chemical equations. 4  To calculate the quantities of reactants required or the quantities produced in"}, {"url": "http://chemistry.about.com/od/stoichiometry/a/reactionrate.htm", "passage_text": "A general rule of thumb for most (not all) chemical reactions is that the rate at which the reaction proceeds will approximately double for each 10°C increase in temperature. For solids, the shape and size of the reactants makes a big difference in the reaction rate. Presence of Catalysts and Competitors. Catalysts (e.g., enzymes) lower the activation energy of a chemical reaction and increase the rate of a chemical reaction without being consumed in the process."}, {"url": "http://chemistry.about.com/od/stoichiometry/a/reactionrate.htm", "passage_text": "The rate of a chemical reaction depends on the medium in which the reaction occurs. It may make a difference whether a medium is aqueous or organic; polar or nonpolar; or liquid, solid, or gaseous. Reactions involving liquids and especially solids depend on the available surface area. For solids, the shape and size of the reactants makes a big difference in the reaction rate. Presence of Catalysts and Competitors. Catalysts (e.g., enzymes) lower the activation energy of a chemical reaction and increase the rate of a chemical reaction without being consumed in the process."}, {"url": "http://www.sartep.com/chem/tutorials/tut.cfm?tutorial=Chemical+Equations&chap=6", "passage_text": "Chemical Equations. A chemical equation is a short hand expression of a chemical reaction. There are two parts to a chemical equation. The reactants are the elements or compounds on the left right of the arrow are the products. Identify the reactants and the products in the equation below. "}]