[{"url": "http://www.med.umich.edu/lrc/coursepages/m1/embryology/embryo/05embryonicperiod.htm", "passage_text": "Gastrulation Gastrulation is the conversion of the epiblast from a bilaminar disc into a trilaminar embryonic disc consisting of ectoderm, mesoderm, and endoderm. Gastrulation begins with the formation of the primitive streak."}, {"url": "http://www.enotes.com/homework-help/what-do-endoderm-ectoderm-mesoderm-form-91045", "passage_text": "The endoderm is one of the germ layers formed during animal embryogenesis. Cells migrating inward along the archenteron form the inner layer of the gastrula, which develops into the endoderm. The mesoderm germ layer forms in the embryos of animals more complex than cnidarians, making them triploblastic. During gastrulation, some of the cells migrating inward contribute to the mesoderm, an additional layer between the endoderm and the ectoderm. The ectoderm is the start of a tissue that covers the body surfaces. It emerges first and forms from the outermost of the germ layers."}, {"url": "http://discovery.lifemapsc.com/in-vivo-development/ectoderm", "passage_text": "Embryonic Development of the Ectoderm: The ectoderm originates in the epiblast, and is formed during gastrulation. Once the mesoderm forms, cells cease to ingress into the primitive streak; the remaining epiblast cells are hereafter called ectoderm."}, {"url": "http://www.med.umich.edu/lrc/coursepages/m1/embryology/embryo/05embryonicperiod.htm", "passage_text": "Gastrulation is the conversion of the epiblast from a bilaminar disc into a trilaminar embryonic disc consisting of ectoderm, mesoderm, and endoderm."}, {"url": "http://study.com/academy/lesson/ectoderm-layer-definition-derivatives-quiz.html", "passage_text": "Definition. During development, most animals form a gastrula. A gastrula is an embryo that has undergone gastrulation, or the process that produces different germ layers. Germ layers are the initial tissue layers of an embryo, and animals can have up to three. 1  Ectoderm is the outermost layer of cells."}, {"url": "http://study.com/academy/lesson/gastrulation-and-the-3-germ-layers-ectoderm-endoderm-mesoderm.html", "passage_text": "Gastrulation is a key process in embryonic development-it's how a simple ball of cells begins to grow into a fully functioning being! Watch this lesson to learn about a key process in the development of almost all multicellular organisms."}]