[{"url": "http://www.vox.com/2014/12/17/7402311/lyft-driver-pay", "passage_text": "When I signed up, Lyft was running a promotion guaranteeing new drivers that they'd make at least $1,500 per week if they worked 50 hours and served 50 passengers. That works out to an average compensation of $30 per passenger, which was a little crazy since I didn't have a single passenger who paid more than $25. I wound up working 50 hours, earning almost $600 in fares. And I actually made a lot more than that. Lyft paid me $1,500 (which I'll be donating to DC Central Kitchen) under a program that guaranteed drivers would make $30 per hour if they worked 50 hours."}, {"url": "http://www.vox.com/2014/12/17/7402311/lyft-driver-pay", "passage_text": "Things got better later in the week. I wound up working 50 hours, earning almost $600 in fares. And I actually made a lot more than that. Lyft paid me $1,500 (which I'll be donating to DC Central Kitchen) under a program that guaranteed drivers would make $30 per hour if they worked 50 hours."}, {"url": "https://answers.yahoo.com/question/index?qid=20130819123303AAtGOHo", "passage_text": "Generally, Lyft drivers make 80% of the donations submitted by passengers. In beta test markets, Lyft drivers are paid $15/hr or $20/hr during peak hours. Manynlyft drivers make $15-$35/hr. it's a great opportunity and always looking for new drivers. Use code 37PZ7Z to get $10 in Lyft credits! See my website if you'd like to become a driver. I have a referral link to get you started and more info :D http://lyft.webs.com/ is an awesome website that explains what Lyft is all about. The site has videos and referral links to $25 of FREE driving credit."}, {"url": "http://www.vox.com/2014/12/17/7402311/lyft-driver-pay", "passage_text": "Obviously this get $15 per ride, pay the driver $30 business model isn't going to to be sustainable — indeed, the promotion was only available for a driver's first month on the job, and Lyft stopped offering it at all a few weeks after I signed up. I wound up working 50 hours, earning almost $600 in fares. And I actually made a lot more than that. Lyft paid me $1,500 (which I'll be donating to DC Central Kitchen) under a program that guaranteed drivers would make $30 per hour if they worked 50 hours."}, {"url": "https://answers.yahoo.com/question/index?qid=20130819123303AAtGOHo", "passage_text": "· just now. Report Abuse. I work in San Diego, I make about $22/hr and on Friday/Saturday night I make around $28/hr. See my website if you'd like to become a driver. I have a referral link to get you started and more info :D http://lyft.webs.com/ is an awesome website that explains what Lyft is all about. The site has videos and referral links to $25 of FREE driving credit."}, {"url": "http://therideshareguy.com/how-much-did-i-make-driving-for-lyft-uber-on-a-saturday-night-in-the-oc/", "passage_text": "Realistically, as an Uber/Lyft driver in a major city you should be able to make $20-$35/hr depending on the time you drive. During absolute peak times, you can probably clear $30-$45/hr but that usually doesn’t last longer than 1-2 hours. With that being said, I decided that I was ready to try out my first full Saturday night driving for both Lyft and Uber. It was actually my first full Saturday night in general ever since I normally do other things on Saturday nights. But here in Orange County, Friday nights are usually a little bit slow."}, {"url": "https://www.lyft.com/drivers", "passage_text": "Lyft matches drivers with passengers who request rides through our smartphone app, and passengers pay automatically through the app. Whether you’re trying to offset costs of your car, cover this month’s bills, or fund your dreams, Lyft will get you there. So, go ahead. Be your own boss. How Lyft Driving Works. Once the ride ends, the app processes pay from the passenger’s saved credit card. Open the app and turn on driver mode. Accept a ride request. Pick up your passenger. Once the ride ends, the app processes pay from the passenger’s saved credit card. Open the app and turn on driver mode."}, {"url": "http://www.vox.com/2014/12/17/7402311/lyft-driver-pay", "passage_text": "My net earnings: about $10.50 per hour. Without Lyft's guarantee I would have made around $12 per hour — around $10.50 after subtracting the $80 I spent on gas. That's just slightly above the $9.50 minimum wage in Washington, DC. I wound up working 50 hours, earning almost $600 in fares. And I actually made a lot more than that. Lyft paid me $1,500 (which I'll be donating to DC Central Kitchen) under a program that guaranteed drivers would make $30 per hour if they worked 50 hours."}, {"url": "http://rideshareapps.com/how-do-lyft-drivers-get-paid/", "passage_text": "Today we will touch on one of the most common questions I hear, How do Lyft drivers get paid? Lyft drivers get paid on a weekly basis, and get paid an accumulation of their ride earnings from the previous week. The payment gets deposited directly into their bank accounts via an ACH transfer, and drivers must have an ACH transfer-compatible checking account to get paid. "}]