[{"url": "http://www.inspiredsilver.com/what-is-vermeil", "passage_text": "Vermeil is essentially .925 sterling silver jewelry layered with gold. Standard plating is 2 millionths of an inch of gold over the base metal, as compared to vermeils 100 millionths of an inch over sterling silver."}, {"url": "http://www.jewelrynotes.com/what-is-gold-vermeil/", "passage_text": "Gold vermeil, or just vermeil, is a term used to refer to jewelry or other items made of silver and coated with gold. The word “vermeil” comes from French and is pronounced “ver-may.”."}, {"url": "http://www.jewelrynotes.com/what-is-gold-vermeil/", "passage_text": "An alternative term is “silver-gilt” (or “gilded silver”), which has the same meaning as “vermeil.”. Vermeil is a term used to refer to jewelry or other items made of silver and coated with gold. © Aleksandr Ugorenkov / Fotolia."}, {"url": "http://www.jewelrynotes.com/vermeil-vs-gold-plating-difference/", "passage_text": "Gold vermeil, or just vermeil, refers to items made of silver that are plated with a thin layer of gold. In the U.S., to be considered vermeil, a piece has to be coated with gold that is at least 10 karats pure. In addition, the thickness of the gold layer has to be at least 2.5 microns."}, {"url": "http://www.ebay.com/gds/Vermeil-Jewelry-A-Guide-to-Smart-Buying-/10000000000711542/g.html", "passage_text": "Pronounced 'Ver-May', the Trade Standard for vermeil is a piece consisting of at least 92.5% silver (sterling silver is 92.5% and fine silver is 99.9%) coated with at least 2.5 microns (that's 1/1000 of a millimeter) of gold-to ensure quality, the gold should be no less than 14K."}, {"url": "http://www.ehow.com/about_4710262_what-gold-vermeil.html", "passage_text": "Although vermeil jewelry typically costs less than pieces made from pure gold, it is more expensive than gold-plated pieces. That's because its coating of the precious metal is 50 times thicker. In addition, plated jewelry often features a core of cheaper copper, rather than silver."}, {"url": "http://craft.ontheinternet.com.au/beads/gold-filled.htm", "passage_text": "Vermeil (Pronounced: Vermay) is sterling silver that has been gold-plated. Most of our vermeil is plated with 24K gold. This is a good combination for those with allergy to normal, plated findings. The difference between vermeil, and gold-filled, is in the thickness of the gold and the base metal used."}, {"url": "http://www.ehow.com/about_4710262_what-gold-vermeil.html", "passage_text": "DAJ/amana images/Getty Images. Jewelry made of gold vermeil is less expensive than solid gold but higher in quality than gold-plated pieces. To create vermeil, sterling silver is covered in a layer of gold that's at least 10 karats and 1.5 microns thick. To the naked eye, vermeil looks like pure gold."}]