[{"url": "http://engineeredmaterials.net/", "passage_text": "At Gaddis Engineered Materials, we specialize in providing you with custom engineered solutions that meet or exceed the requirements of your applications. If you have a need for a part custom machined from carbon-graphite, alumina ceramic, silicon carbide, tungsten carbide or other technical ceramics, Gaddis is your source! Our products are used primarily in rotating applications such as pumps, compressors, industrial mixers and mechanical seals. You will also find Gaddis materials and components in a broad range of other applications, such as Diamond Tooling Processes, Glass & Fiberglass Manufacturing, and Specialty Textile Applications. Anywhere there is a requirement for any technical ceramic material for mechanical or thermal service, we can meet the need!"}, {"url": "https://en.wikipedia.org/wiki/Genetic_engineering", "passage_text": "Genetic engineering is also being used to create BioArt. Some bacteria have been genetically engineered to create black and white photographs. Genetic engineering has also been used to create novelty items such as lavender-colored carnations, blue roses, and glowing fish. If genetic material from the same species or a species that can naturally breed with the host is used the resulting organism is called cisgenic. Genetic engineering can also be used to remove genetic material from the target organism, creating a gene knockout organism."}, {"url": "http://www.pennfoster.edu/~/media/Files/PDF/SampleLessons/104-Carpenter%20Career%20Diploma.ashx", "passage_text": "The thicker the growth ring,the coarser the texture.As a carpenter, you’ll often hear the terms wood grain and wood texture. Wood grain most often refers to the thickness of the annular rings. The term fine grain refers to thinnerannular rings, while coarse grain refers to thicker rings. Theterm wood grain is also used to indicate the direction of thewood fibers, as in straight grain, spiral grain, and curly grain. You’ll learn about different types and sizes ofnails and the proper use for each. Screws, bolts, and otherfasteners also have specific applications in construction, andyou’ll learn how to identify the correct fastener for a job.You’ll also learn about the use of adhesives, such as glue,mastic, epoxy, and contact cement."}, {"url": "http://www.hubermaterials.com/markets-applications.aspx", "passage_text": "Engineered Materials Applications. Our engineered materials applications are produced to enhance the performance, appeal and processing of a broad range of products used in industrial, paper and consumer-based markets and applications. "}, {"url": "http://www.ametek.com/products/businessunits/engineeredmaterialsinterconnectsandpackaging", "passage_text": "Engineered Materials Interconnects & Packaging (EMIP) is a leading manufacturer of electronic connectors and electrical packaging designed to protect sensitive electronic devices in demanding aerospace, industrial, petrochemical, subsea and telecommunications applications. "}, {"url": "http://www.niehs.nih.gov/health/topics/agents/sya-nano/", "passage_text": "Materials engineered to such a small scale are often referred to as engineered nanomaterials (ENMs), which can take on unique optical, magnetic, electrical, and other properties. These emergent properties have the potential for great impacts in electronics, medicine, and other fields. Some nanomaterials can occur naturally, such as blood borne proteins essential for life and lipids found in the blood and body fat. Scientists, however, are particularly interested in engineered nanomaterials (ENMs), which are designed for use in many commercial materials, devices and structures."}, {"url": "http://www.engineeredmaterialsinc.com/", "passage_text": "Engineered Materials Inc. has been manufacturing and distributing a wide range of custom industrial products to a variety of industries for over 20 years. Converting and Fabrication. – we can cut and slit a wide variety of materials, such as flexible foams, rubber, and insulations. As a VHB tape converter, we’re able to modify industrial bonding tapes to your specs."}, {"url": "https://en.wikipedia.org/wiki/Genetic_engineering", "passage_text": "An organism that is generated through genetic engineering is considered to be a genetically modified organism (GMO). The first GMOs were bacteria generated in 1973 and GM mice in 1974. Insulin-producing bacteria were commercialized in 1982 and genetically modified food has been sold since 1994. If genetic material from the same species or a species that can naturally breed with the host is used the resulting organism is called cisgenic. Genetic engineering can also be used to remove genetic material from the target organism, creating a gene knockout organism."}, {"url": "http://engineeredmaterials.net/", "passage_text": "We provide personal attention to each of our customers. Our goal is to understand your needs and anticipate your requirements in advance. Many of our customers look at Gaddis Engineered Materials as a resource and extension of their own businesses. If you have a need for a part custom machined from carbon-graphite, alumina ceramic, silicon carbide, tungsten carbide or other technical ceramics, Gaddis is your source! Our products are used primarily in rotating applications such as pumps, compressors, industrial mixers and mechanical seals. You will also find Gaddis materials and components in a broad range of other applications, such as Diamond Tooling Processes, Glass & Fiberglass Manufacturing, and Specialty Textile Applications. Anywhere there is a requirement for any technical ceramic material for mechanical or thermal service, we can meet the need!"}]