[{"url": "http://info.legalzoom.com/average-cost-uncontested-divorce-20665.html", "passage_text": "The average cost is about $300. You can also hire an attorney by the hour to review your paperwork for you. This will cost less than a flat uncontested divorce rate, but would not require putting down a retainer fee. Whether you handle your divorce yourself or hire an attorney, there will be extra costs. State courts charge a filing fee for a divorce petition, usually in the neighborhood of $200. If you use a sheriff or private process server to deliver your petition to your spouse, this will cost an additional $35 to $100."}, {"url": "http://www.costowl.com/legal/lawyer-child-custody-cost.html", "passage_text": "1 Family law lawyer fees typically average around $100 to $500 per hour. 2  Again, the actual rate charged will depend on an attorney s credentials, your location, and the particulars of the case. "}, {"url": "http://research.lawyers.com/how-and-how-much-do-lawyers-charge.html", "passage_text": "Believe it or not, rates may vary anywhere from $50 an hour to a $1,000 an hour or more. In rural areas and small towns, lawyers tend to charge less, and fees in the range of $100 to $200 an hour for an experienced attorney are probably the norm. In major metropolitan areas, the norm is probably closer to $200 to $400 an hour. Lawyers with expertise in specialized areas may charge much"}, {"url": "http://personalfinance.costhelper.com/criminal-attorney.html", "passage_text": "Comments (2). The cost of hiring a criminal attorney depends a great deal on the nature and severity of the charges, the complexity of the case, the lawyer's years of experience and the size of the law firm, among other factors. Fees can vary significantly in different cities, counties and states. 1 A lawyer will almost always want to meet and discuss the specific circumstances of your case before quoting a fee, either an hourly rate ($100-$300) or a flat charge based on the type of case, such as $500-$1,200 for first-time drunk driving charges."}, {"url": "http://info.legalzoom.com/average-cost-divorce-20103.html", "passage_text": "According to a 2006 article on Forbes.com, divorce proceedings can range from a few hundred to many thousands of dollars, with the average cost of a contested divorce ranging from $15,000 to $30,000. Most of this money is spent on legal fees. Legal Fees. In a divorce, both spouses will generally have lawyers. Attorney fees vary widely depending on the area, the individual attorney, the number of contested issues and the length of the trial. According to Divorce Court Attorneys, a two day divorce trial can cost as much as $25,000 in legal fees alone."}, {"url": "http://www.alllaw.com/articles/nolo/bankruptcy/paying-lawyer-attorney-fees.html", "passage_text": "In general, attorney fees for a Chapter 7 bankruptcy range from $500 to $3,500 depending on the complexity of the case. Larger firms with more advertising and overhead costs may charge more than a solo practitioner. Also, a newer attorney will typically charge less than a more experienced lawyer. "}, {"url": "http://info.legalzoom.com/average-cost-uncontested-divorce-20665.html", "passage_text": "The average flat fee ranges from $200 to $1,500, depending on the complexity of your assets and whether you have children. If you retain an attorney, he will bill your deposit at the rate of $250 to $450 for each hour of his time. Whether you handle your divorce yourself or hire an attorney, there will be extra costs. State courts charge a filing fee for a divorce petition, usually in the neighborhood of $200. If you use a sheriff or private process server to deliver your petition to your spouse, this will cost an additional $35 to $100."}, {"url": "http://www.goodfinancialcents.com/average-cost-law-school-tuition-is-it-worth-becoming-lawyer/", "passage_text": "Therefore, the average cost of law school for a graduate of the top twenty law schools in the country comes out to be $136,707 plus their undergraduate degree of $76,000 to be a final total of $212,707. Second, we will analyze the second group of top law schools. Finally we will analyze the third grouping of top law degrees in the United States. The average cost of these schools does not vary significantly from the second grouping at $37,500. This would lead to a three year grad school cost of $112,500, with a total cost of $188,500 to become a lawyer. The following table summarizes the total cost figures from the three different rankings of"}, {"url": "http://www.goodfinancialcents.com/average-cost-law-school-tuition-is-it-worth-becoming-lawyer/", "passage_text": "Also according to payscale.com, the average Boston University Lawyer who is a member of our second group gets paid on average between $45,302 and $160,818. Finally, a lawyer from George Mason University according to payscale.com gets paid on average around $59,958 and $81,488. Finally we will analyze the third grouping of top law degrees in the United States. The average cost of these schools does not vary significantly from the second grouping at $37,500. This would lead to a three year grad school cost of $112,500, with a total cost of $188,500 to become a lawyer. The following table summarizes the total cost figures from the three different rankings of schools"}]