[{"url": "http://www.oxforddictionaries.com/definition/english/eponymous", "passage_text": "1 On the evidence of their eponymous debut album, they don't even have much in common with others in the new wave of bands influenced by post-punk guitar. 2  The bad news for the British fashion industry was that Stella McCartney would not be showing her debut eponymous collection in London. More example sentences. 1  He has just released his second solo album, the follow-up to his eponymous solo debut of two years ago, and a cracking record it is too. 2 "}, {"url": "http://www.yourdictionary.com/eponymous", "passage_text": "1 An example of eponymous is a person named Jackson who founded a city being the reason for naming the city Jacksonville. 2  An example of eponymous is a band using its name as the name for the band’s album. eponymous. adjective. 1  Of, relating to, or constituting an eponym. 2  Named after something else or deriving from an existing name or word: “Programs such as He-Man and Masters of the Universe &ellipsis; were all created with the explicit purpose of selling the eponymous toys to children” (Susan Gregory Thomas)."}, {"url": "https://en.wikipedia.org/wiki/Eponym", "passage_text": "An eponym is a person, a place, or thing for whom or for which something is named, or believed to be named. For example, Elizabeth I of England is the eponym of the Elizabethan era. Many genericized trademarks such as aspirin, heroin and thermos are based on their original brand eponyms. "}, {"url": "http://www.thefreedictionary.com/eponymous", "passage_text": "eponymous. adj. 1. (of a person) being the person after whom a literary work, film, etc, is named: the eponymous heroine in the film of Jane Eyre. 2. (of a literary work, film, etc) named after its central character or creator: the Stooges' eponymous debut album. (əˈpɒn ə məs)."}, {"url": "https://en.wikipedia.org/wiki/Young_the_Giant_(album)", "passage_text": "Young the Giant is the eponymous debut album by American indie rock band Young the Giant. It was released digitally by the Roadrunner record label on October 26, 2010, and was followed by a physical CD and vinyl release in the United States on January 25, 2011. "}, {"url": "http://www.oxforddictionaries.com/definition/english/eponymous", "passage_text": "adjective. 1 (Of a person) giving their name to something: the eponymous hero of the novel. More example sentences. 1  A hardy few climb to another refuge, Re Alberto I, named after the eponymous king of the Belgians who came here to climb. More example sentences. 1  He has just released his second solo album, the follow-up to his eponymous solo debut of two years ago, and a cracking record it is too. 2  On the evidence of their eponymous debut album, they don't even have much in common with others in the new wave of bands influenced by post-punk guitar."}, {"url": "http://www.thefreedictionary.com/eponymously", "passage_text": "eponymous. adj. 1. (of a person) being the person after whom a literary work, film, etc, is named: the eponymous heroine in the film of Jane Eyre. 2. (of a literary work, film, etc) named after its central character or creator: the Stooges' eponymous debut album. (əˈpɒn ə məs). adj."}, {"url": "http://www.yourdictionary.com/eponymous", "passage_text": "The definition of eponymous is something or someone that gives its name to something else. 1  An example of eponymous is a person named Jackson who founded a city being the reason for naming the city Jacksonville. 2  An example of eponymous is a band using its name as the name for the band’s album. eponymous. adjective. 1  Of, relating to, or constituting an eponym. 2  Named after something else or deriving from an existing name or word: “Programs such as He-Man and Masters of the Universe &ellipsis; were all created with the explicit purpose of selling the eponymous toys to children” (Susan Gregory Thomas)."}, {"url": "http://www.definitions.net/definition/do", "passage_text": "Do. Do is the eponymous debut album of Dutch singer Do, including the singles Heaven, On and On, Love Is Killing Me and Angel By My Side. Do co-wrote 4 songs on the album, Closer To You, Should I, Selfish and I Believe In Love. It charted at #3 in the Netherlands."}, {"url": "http://www.oxforddictionaries.com/definition/english/eponymous", "passage_text": "1.1 (Of a thing) named after a particular person or group: their eponymous debut LP. More example sentences. 1  He has just released his second solo album, the follow-up to his eponymous solo debut of two years ago, and a cracking record it is too. 2  On the evidence of their eponymous debut album, they don't even have much in common with others in the new wave of bands influenced by post-punk guitar."}]