[{"url": "http://www.theguardian.com/music/2014/oct/17/glen-campbell-country-stars-death", "passage_text": "Glen Campbell and the country stars staring death in the face. The authenticity of Campbell, who sings unflinchingly about Alzheimer’s in his final single, is part of a country music tradition imperilled by a party-loving younger generation. Glen Campbell in 2013, after his Alzheimer’s diagnosis."}, {"url": "http://abcnews.go.com/topics/entertainment/music/glen-campbell.htm", "passage_text": "Glen Campbell is a Grammy-winning country music icon, but his wife Kim Campbell ..... but as a human being.. The tour was featured in the documentary  Glen Campbell ...I’ll Be Me  and Kim said her daughter Ashley actually wrote."}, {"url": "https://en.wikipedia.org/wiki/Glen_Campbell", "passage_text": "He is best known for a series of hits in the 1960s and 1970s, and for hosting a variety show called The Glen Campbell Goodtime Hour on CBS television. During his 50 years in show business, Campbell has released more than 70 albums."}, {"url": "http://www.theguardian.com/music/2014/oct/17/glen-campbell-country-stars-death", "passage_text": "Country music’s legendary rhinestone cowboy, Glen Campbell, is taking his last bow this fall. The 78-year-old, who was diagnosed with Alzheimer’s disease in 2011, said farewell to fans on a Goodbye Tour in 2012, but this week marked the official sunset of Campbell’s professional music career."}, {"url": "http://deadoraliveinfo.com/dead.nsf/cnames-nf/Campbell+Glen", "passage_text": "Field: Music, Entertainment. Info: Country music singer whose hits include Galveston, By the Time I Get to Phoenix, and Rhinestone Cowboy, he had a TV variety show in the 1970s called The Glen Campbell Goodtime Hour."}, {"url": "http://www.whosaliveandwhosdead.com/n/campgl01.htm", "passage_text": "Full name: Glen Travis Campbell. Noted For: country singer; hits include By the Time I Get To Phoenix (1967), Galveston (1969), Rhinestone Cowboy (1975), Southern Nights (1977), and A Lady Like You (1984). TV host, The Glen Campbell Goodtime Hour (1969-72). Inducted into the Country Music Hall of Fame (2005)."}, {"url": "http://www.cbsnews.com/news/glen-campbells-wife-defends-alzheimers-care-for-singer/", "passage_text": "Glen Campbell's wife defends Alzheimer's care for singer. Glen Campbell and his wife Kim pose on arrival at the 2012 MusiCares Person of the Year Tribute honoring Paul McCartney on February 10, 2012, in Los Angeles. FREDERIC J. BROWN/AFP/Getty Images."}]