[{"url": "http://www.mit.edu/~rei/Expl.html", "passage_text": "So here's a long one. (Pardon me for its length and its wandering; I was doing chain-of-thought writing :). Many people might say Manga are Japanese comics, and Anime is the Japanese version of animation. Anime is usually, but not always, the animated version of popular manga.. That's partially true, but it can be misleading. The heart of manga and anime is in the hearts of the characters. That brings us to three other aspects of manga and anime that I really like: the reality of the world, the spirituality, and the fact that things end. With comics, the merging of art and words creates a unique medium."}, {"url": "http://www.viz.com/company/faq", "passage_text": "Weekly Shonen Jump is known worldwide as the home of the world's greatest manga. You can subscribe to a digital version of the anthology in the US, Canada, United Kingdom, New Zealand, Australia, and South Africa! "}, {"url": "http://www.answers.com/Q/What_company_made_naruto", "passage_text": "Naruto   Naruto is a very successful Anime/Manga series produced in Japan by Masashi Kishimoto. It is now shown worldwide and is successful on both USA and Europe. Development   Naruto started much like all of Japan's Animes, Manga. Naruto's Manga consists of 403 chapters (Up to 12th June 2008) and growing, the Anime is based on that Manga. Based on the Anime, video games and movies were produced. Making it very popular even in the US and many other countries."}, {"url": "http://www.answers.com/Q/What_company_made_naruto", "passage_text": "Shueisha publishes Naruto in Japan, Viz Media publishes it in America/English countries. It is part of a Japanese magazine called Akamaru Jump, and Shoen Jump is the English version which is published in America, the author of Naruto is Mashashi Kishumoto. The TV anime is directed by Hayato Date, in Studio Pierott. Development   Naruto started much like all of Japan's Animes, Manga. Naruto's Manga consists of 403 chapters (Up to 12th June 2008) and growing, the Anime is based on that Manga. Based on the Anime, video games and movies were produced. Making it very popular even in the US and many other"}, {"url": "https://en.wikipedia.org/wiki/Manga", "passage_text": "Manga (漫画, Manga) are comics created in Japan, or by creators in the Japanese language, conforming to a style developed in Japan in the late 19th century. They have a long and complex pre-history in earlier Japanese art. In Japan, people of all ages read manga. The medium includes works in a broad range of genres: action-adventure, business/commerce, comedy, detective, historical drama, horror, mystery, romance, science fiction and fantasy, sexuality, sports and games, and suspense, among others."}, {"url": "https://simple.wikipedia.org/wiki/Anime", "passage_text": "If a manga or anime is not translated by a company in another country, sometimes people in that country will translate the story to share with other people for free before a company translates it for the general public. This is good because it allows more people to watch animes, but some companies think it is stealing. In Japan, anime is the word used for all animation. Outside of Japan, the term anime refers to Japanese Animation or Animation similar in style to Japanese Animation."}, {"url": "https://en.wikipedia.org/wiki/Manga", "passage_text": "Since the 1950s, manga has steadily become a major part of the Japanese publishing industry, representing a ¥ 406 billion market in Japan in 2007 (approximately $ 3.6 billion) and ¥ 420 billion ($ 5.5 billion) in 2009. In Japan, people of all ages read manga. The medium includes works in a broad range of genres: action-adventure, business/commerce, comedy, detective, historical drama, horror, mystery, romance, science fiction and fantasy, sexuality, sports and games, and suspense, among others."}, {"url": "https://en.wikipedia.org/wiki/Manga", "passage_text": "Manga have also gained a significant worldwide audience. In Europe and the Middle East the market was worth $250 million in 2012. In 2008, in the U.S. and Canada, the manga market was valued at $175 million; the markets in France and the United States are about the same size. In Japan, people of all ages read manga. The medium includes works in a broad range of genres: action-adventure, business/commerce, comedy, detective, historical drama, horror, mystery, romance, science fiction and fantasy, sexuality, sports and games, and suspense, among others."}, {"url": "https://en.wikipedia.org/wiki/List_of_anime_companies", "passage_text": "This is a list of anime industry companies involved in the production or distribution of anime. 1 Sav! The World Productions (Fr, producer of Oban Star-Racers with Bandai Visual and HAL Film Maker). 2  Harmony Gold USA (U.S., produced the seminal Robotech series in 1985; stopped releasing new anime in the late 1980s and virtually dormant in the 1990s, the company technically still exists and issues re-releases)."}]