[{"url": "https://en.wikipedia.org/wiki/Subsidence", "passage_text": "Subsidence is the motion of a surface (usually, the Earth's surface) as it shifts downward relative to a datum such as sea-level. The opposite of subsidence is uplift, which results in an increase in elevation. Ground subsidence is of concern to geologists, geotechnical engineers and surveyors. In Northern Japan, subsidence of 0.50 m (1.64 ft) was observed on the coast of the Pacific Ocean in Miyako, Tōhoku, while Rikuzentakata, Iwate measured 0.84 m (2.75 ft)."}, {"url": "http://www.answers.com/Q/What_is_land_subsidence_and_how_does_it_occur", "passage_text": "Split and merge into it. Answer by Paul Jones. Confidence votes 68.5K. Rockhound. A drop in the elevation of the surface of the land is called land subsidence, and can be caused by a collapse of underground mining shafts or naturally occurring underground cave system collapses, commonly called sinkholes. "}, {"url": "http://www.tulane.edu/~sanelson/geol204/subsidence.htm", "passage_text": "Surface Subsidence and Collapse. Subsidence hazards involve either the sudden collapse of the ground to form a depression or the slow subsidence or compaction of the sediments near the Earth's surface. The exact place and time of a disaster related to subsidence cannot usually be predicted with any degree of certainty. This is true of both slow subsidence related to fluid withdrawal and sudden subsidence related to sinkhole formation or mine collapse."}, {"url": "http://www.answers.com/Q/How_does_subsidence_occur", "passage_text": "Making the world better, one answer at a time. Subsidence occurs when one plate is denser than the plate it is moving into. It then slips under the less dense plate and melts into the mantle. A drop in the elevation of the surface of the land is called land subsidence, and can be caused by a collapse of underground mining shafts or naturally occurring underground c … ave system collapses, commonly called sinkholes.    . 6 people found this useful."}, {"url": "https://answers.yahoo.com/question/index?qid=20101026082554AA7ZswN", "passage_text": "Answers. Best Answer: Subsidence is the motion of a surface (usually, the Earth's surface) as it shifts downward relative to a datum such as sea-level. The opposite of subsidence is uplift, which results in an increase in elevation. Ground subsidence is of concern to geologists, structural engineers and surveyors. "}, {"url": "http://volcanoes.usgs.gov/volcanoes/yellowstone/yellowstone_sub_page_51.html", "passage_text": "Corals deposited on the ocean floor about 500 years ago are now found over 100 m (328 feet) above sea level. This requires uplift of the island of over 100 m (328 feet) within that short period of time. In addition, a shoreline landed upon by Captain Cook's surveying crew in 1779 is now 40 m (131 feet) above sea level. Normal activity for Yellowstone includes extensive seismicity, periods of uplift and subsidence of the caldera, and intermittent changes to hydrothermal features at the surface. There are usually over a thousand earthquakes per year at Yellowstone."}, {"url": "http://geoscience.wisc.edu/~chuck/Classes/Mtn_and_Plates/rock_deformation.html", "passage_text": "For low angle faults (10 degrees), uplift will occur at rates of about 1 mm/yr (1 kilometer per million years). Over 5 million years, this amounts to uplift of 5 kilometers or 3 miles (15,900 feet). "}, {"url": "http://www.maybeck.com/inversions/", "passage_text": "Subsidence inversions are usually only about two or three thousand feet thick. The base of subsidence inversions may vary from about 6,000 feet to around 18,000 feet, but usually range in the 8,000 to 12,000 foot range. "}, {"url": "https://en.wikipedia.org/wiki/Subsidence", "passage_text": "If the pressure drops, the soil pressure increases and this leads to subsidence at the ground level. Since exploitation of the Slochteren (Netherlands) gas field started in the late 1960s the ground level over a 250 km² area has dropped by a current maximum of 30 cm. In Northern Japan, subsidence of 0.50 m (1.64 ft) was observed on the coast of the Pacific Ocean in Miyako, Tōhoku, while Rikuzentakata, Iwate measured 0.84 m (2.75 ft)."}]