[{"url": "https://en.wikipedia.org/wiki/Aluminium_carbide", "passage_text": "Aluminium carbide, chemical formula Al 4 C 3, is a carbide of aluminium. It has the appearance of pale yellow to brown crystals. It is stable up to 1400 °C."}, {"url": "https://en.wikipedia.org/wiki/Carbide", "passage_text": "Examples include calcium carbide (CaC 2), silicon carbide (SiC), tungsten carbide (WC) (often called simply carbide when referring to machine tooling), and cementite (Fe 3 C), each used in key industrial applications. The naming of ionic carbides is not systematic."}, {"url": "https://answers.yahoo.com/question/index?qid=20120414210140AA0KSyJ", "passage_text": "There are two structures that can be called carbide. The first is when carbon exists in the -4 oxidation state in combination with a metal. Aluminum carbide, Al4C3, is an example. But aluminum carbide is definitely NOT ionic."}, {"url": "https://en.wikipedia.org/wiki/Aluminium_carbide", "passage_text": "Structure [edit]. Aluminium carbide has an unusual crystal structure that consists of two types of layers. It is based on AlC 4 tetrahedra of two types and thus two types of carbon atoms. One is surrounded by a deformed octahedron of 6 Al atoms at a distance of 217 pm."}, {"url": "http://www.azom.com/article.aspx?ArticleID=4827", "passage_text": "Background. Tungsten Carbide is often referred to as a Hard Metal due to it’s very high hardness in relation to other metals. Typically a Tungsten Carbide Hard Metal can have a hardness value of 1600 HV, whereas mild steel would be in the region of 160 HV a factor of 10 lower."}, {"url": "https://en.wikipedia.org/wiki/Carbide", "passage_text": "In chemistry, a carbide is a compound composed of carbon and a less electronegative element. Carbides can be generally classified by chemical bonding type as follows: (i) salt-like, (ii) covalent compounds, (iii) interstitial compounds, and (iv) intermediate transition metal carbides."}, {"url": "https://en.wikipedia.org/wiki/Aluminium_carbide", "passage_text": "Aluminium carbide has an unusual crystal structure that consists of two types of layers. It is based on AlC 4 tetrahedra of two types and thus two types of carbon atoms."}]