[{"url": "http://www.madrid-tourist-guide.com/en/airport/madrid-airport-transport.html", "passage_text": "Go to the Line C1 of RENFE running which runs from Terminal 4 Madrid-Barajas airport to the city centre. The train stops at Chamartin, Nuevos Ministerios, Atocha, Mendez Avaro, and Principe Pio."}, {"url": "http://www.aeropuertomadrid-barajas.com/eng/", "passage_text": "Madrid-Barajas Airport (code IATA: MAD, code OACI: LEMD) is located on the northeast of Madrid, Barajas district, only 12 kilometers from Madrid city centre. The airport changed its name from Madrid-Barajas to Adolfo Suarez Suárez-Madrid barajas in. 2014"}, {"url": "http://www.gomadrid.com/transport/airport_options.html", "passage_text": "The visitor to Madrid has several options to get from Barajas Airport to the city centre. These are: Aerocity, AresMobile, Bus (Airport Express) , Car Rental, Metro, and Taxi. Aerocity."}, {"url": "http://www.gowithoh.com/guide-madrid/airport-transport/", "passage_text": "Luggage storage is available at Terminals 1, 2 and 4. Getting from the airport to Madrid’s city centre is made simple by how well-connected it is. You can grab the metro, the bus, the train or a taxi. Hop on metro line 8 from Madrid-Barajas (in any terminal) to Nuevos Ministerios in Madrid's city centre. The trip takes around 15 minutes. From there you can transfer to metro lines 6 and 10."}, {"url": "http://www.answers.com/Q/What_airport_is_nearest_to_Madrid_city_centre", "passage_text": "Granada City Center is 20 km from the Granada Airport. Granada  Airport mainly handles flights to Madrid and Barcelona. The Granada  Airport was opened in 1972."}, {"url": "http://www.travelmath.com/nearest-airport/Madrid,+Spain", "passage_text": "Major airports near Madrid, Spain: The nearest major airport is Madrid-Cuatro Vientos Airport (MCV / LECU). This airport has international flights and is 18 km from the center of Madrid, Spain. Another major airport is Madrid-Barajas Airport (MAD / LEMD), which has international and domestic flights and is 21 km from"}]