[{"url": "http://www.indeed.com/q-Executive-Producer-jobs.html", "passage_text": "Identify and hire line producers. 10+ years of experience as a production executive, line producer and/or production manager, preferably in both film and... 4 hours ago-save job-email-more... 1  View all Netflix jobs in Beverly Hills, CA-Beverly Hills jobs. 2  Salary Search: Director salaries in Beverly Hills, CA. KOMO-TV in Seattle, Washington (market #14) is looking for an Executive Producer of our award winning morning newscasts...."}, {"url": "http://work.chron.com/pay-scale-executive-producer-20105.html", "passage_text": "Salary and Qualifications. Executive producers earned average annual salaries of $124,000 as of 2013, according to the job website Simply Hired. This is about 25 percent higher than the average salary the U.S. Bureau of Labor Statistics reports for a producer -- $92,390 annually."}, {"url": "http://learn.org/articles/Executive_Producer_Jobs_Career_and_Salary_FAQs.html", "passage_text": "Although a film's director may be a powerful figure, he or she may ultimately defer to the executive producer, who usually has the final word on film production-related matters. The salary range for most executive producers was between $50,139 and $194,156 as of December 2014, according to PayScale.com. In 2013, the average salary for producers and directors in general was $90,240, according to the U.S. Bureau of Labor Statistics. A 3% job growth rate is predicted for the period of 2012-2022, which is slower than average. Some of this growth will likely be due to an increased appetite for U.S. movies overseas. "}, {"url": "http://www.payscale.com/research/US/Job=Executive_Producer/Salary", "passage_text": "Read More... Executive producers are in charge of overseeing production activities and collaborating with content producers in their company. They are responsible for selecting content and coordinating with production and engineering teams to make sure all production activities are completed correctly and on time. "}, {"url": "http://www1.salary.com/Executive-Producer-Web-salary.html", "passage_text": "For example the median expected annual pay for a typical Executive Producer-Web in the United States is $146,412 so 50% of the people who perform the job of Executive Producer-Web in the United States are expected to make less than $146,412. Source: HR Reported data as of October 2015. Median $146,412. 1  Salary. This chart describes the expected percentage of people who perform the job of Executive Producer-Web in the United States that make less than that annual salary."}, {"url": "http://work.chron.com/pay-scale-executive-producer-20105.html", "passage_text": "Salary by Region. In 2013, average regional salaries varied somewhat for executive producers. In the Northeast region, they earned the lowest salaries in Maine and highest in Massachusetts, according to Simply Hired, -- $112,000 and $151,000 per year, respectively. This is about 25 percent higher than the average salary the U.S. Bureau of Labor Statistics reports for a producer -- $92,390 annually."}, {"url": "http://work.chron.com/pay-scale-executive-producer-20105.html", "passage_text": "Those in the West region earned between $100,000 and $141,000 -- with the lowest salaries in Montana and highest in California. Executive producers made $97,000 and $196,000 per year, respectively, in Mississippi and the District of Columbia, which represented the lowest and highest salaries in the South region. This is about 25 percent higher than the average salary the U.S. Bureau of Labor Statistics reports for a producer -- $92,390 annually."}, {"url": "http://swz.salary.com/SalaryWizard/Executive-Producer-Web-Job-Description.aspx", "passage_text": "Executive Producer-Web Job Description. The following is a full job description for Executive Producer-Web. Here are the requirements and responsibilities for Executive Producer-Web along with statistics. Executive Producer-Web Job Description The following is a full job description for Executive Producer-Web."}]