[{"url": "http://www.everydayhealth.com/hs/hip-replacement-physical-therapy/", "passage_text": "Why You Need Physical Therapy After Surgery. When you’re healing from surgery, it’s vital to work with a physical therapist on your hip's range of motion, says Jennifer Mussro, DPT, a physical therapist in the outpatient department of Thomas Jefferson University Hospital in Philadelphia."}, {"url": "http://www.webmd.com/osteoporosis/tc/hip-fracture-topic-overview", "passage_text": "If you are older, breaking your hip can mean a major change in your life. You will probably need surgery, and it can take as long as a year to recover. But activity and physical therapy can help you get your strength and mobility back. Most people break their hip near the upper part of the thighbone (femur) . It usually happens near where the thighbone fits into the hip joint."}, {"url": "http://www.ehow.com/way_5491864_treatment-severe-bone-spurs-hips.html", "passage_text": "Most bone spurs in the hip are caused by wear and tear in the joint; a condition called osteoarthritis. Over time, the condition can worsen to the point where walking or sitting can be painful. When the cartilage wears down, it can setup a symptom where the tendons rub against the joint, causing irritation."}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00213", "passage_text": "Recovery time and rehabilitation depends on the type of surgery performed. Your doctor may recommend physical therapy to help you regain strength in your hip and to restore range of motion. After your procedure, you may need to use a cane, crutches, or a walker for a time."}, {"url": "http://www.advancedortho.net/diseases/hiplabraltears.php", "passage_text": "The hip is a ball and socket joint. The labrum is an O-ring cartilage around the socket. It can become torn for a variety of reasons, but the most common is femoroacetabular impingement, wherein bone spurs on either the femur (ball) or acetabulum (socket) rub on the labrum and cause it to tear."}, {"url": "http://www.elixirindustry.com/Bone-Spurs.htm", "passage_text": "As a result, the soft tissues in the area are calcified and form bone spurs. If ignored, bone spurs will cause permanent damage to bones and joints, eventually leading to or osteoarthritis. A is a common type of bone spur that can be caused by imbalance of weight on weakened bones and joints of the foot."}, {"url": "http://www.schrierpt.com/links/blogs/how-physical-therapy-can-help-with-hip-pain.html", "passage_text": "Fortunately, there are plenty of treatment options before hip replacement is considered. Physical therapy can reduce pain, improve quality of life, and delay or even eliminate the need for surgery. The best way to know whether physical therapy can help your hip problems is to talk with a licensed physical therapist."}]