[{"url": "http://www.knowswhy.com/why-does-uranus-spin-on-its-side/", "passage_text": "Uranus rotates along its side with its poles lying in the same plane as that of solar system and appears like drum rolling around the sun instead of a rotating top. Unlike other planets Venus and Uranus rotate in clockwise direction. But Uranus is observed to be rotating parallel to the plane of the solar system."}, {"url": "http://www.answers.com/Q/Which_way_does_Uranus_rotate", "passage_text": "Uranus rotates on it's axis once every 17 hours 14 minutes. However, in its upper atmosphere very strong winds makes this even faster, and storm features have been noticed tha … t can make a rotation once every 14 hours."}, {"url": "http://cseligman.com/text/planets/uranusrot.htm", "passage_text": "(more to follow in the next iteration of this page). Uranus rotates once every 17 hours 14 minutes 24 seconds, as determined from the rate of rotation of its magnetic field."}, {"url": "http://coolcosmos.ipac.caltech.edu/ask/131-How-long-is-a-day-on-Uranus-", "passage_text": "A planet's day is the time it takes the planet to rotate or spin once on its axis. Uranus rotates faster than Earth so a day on Uranus is shorter than a day on Earth. A day on Uranus is 17.24 Earth hours while a day on Earth is 23.934 hours. However, Uranus spins backwards compared to Earth and most of the other planets."}, {"url": "http://cseligman.com/text/planets/uranusrot.htm", "passage_text": "Because the planet has a retrograde or backwards rotation relative to its orbital motion, its day is shorter than its rotation period (for the Earth, which rotates in the same direction it orbits the Sun, the day is longer than the rotation period)."}, {"url": "http://coolcosmos.ipac.caltech.edu/ask/130-How-long-does-it-take-Uranus-to-go-around-the-Sun-", "passage_text": "Uranus revolves or orbits around the Sun once every 84 Earth years, or once every 30,687 Earth days. Uranus travels at an average speed of 15,290 miles per hour or 24,607 kilometers per hour in its orbit around the Sun. 1  Javascript must be enabled to use Cool Cosmos. 2  Learn how."}, {"url": "http://astronomy.nmsu.edu/tharriso/ast105/UranusandNeptune.html", "passage_text": "Uranus has a radius of 25,500 km, and a mass of 14.5 Earth's. It has a density similar to Jupiter: 1.27 gm/cm 3. It also spins rapidly, and has a day of 17 hours and 14 minutes. This is the internal rotation period, the cloud layers rotate in about 14 hours."}]