[{"url": "http://www.youtube.com/watch?v=afmH3oI5S2w", "passage_text": "When the electronic Robi Comb touches lice, they get zapped and die and then get combed out of the hair. In addition, while lice have been reported to be building up a resistance to pesticides used in other lice treatments, lice cannot become resistant to the Robi Comb treatment. Unlike harsh chemical treatments, you can use Robi Comb over and over as often as you like."}, {"url": "http://www.kidsheadlice.com/lice-comb.html", "passage_text": "Sunshine is best, or a light that can be directed right at the area of the scalp you’re working on. There are a couple of electric combs that are marketed for head lice. The Robi Comb is designed to electrocute head lice, killing them instantly, but it does nothing for nits. The Quantum Magicomb has vibrating teeth and claims to remove both lice and nits. I’m not sure why vibrating teeth are supposed to help. A good nit comb: 1  Has METAL teeth, not plastic. 2  This is critical. 3  Plastic bends, and will not stand up to the rigorous combing needed to remove stubborn nits. 4  Has teeth incredibly close together. 5  If you see a space between the teeth, then nits that fit into that space can escape the comb."}, {"url": "http://robicomb.com.au/frequently-asked-question-faq.html", "passage_text": "1 Robi Comb Detects Lice The Robi Comb can be used to quickly detect lice in an non-invasive way. 2  The Robi Comb lets you know by an audible signal whether or not head lice are present, so it can be used to detect an infestation. 3  In fact, many school nurses use the Robi Comb for exactly that reason. 1 Robi Comb Can Be Used Anywhere. 2  Robi Comb can be used in just a few minutes on dry hair: at school, in a car, at the park... 3  anywhere. 4  It is travel sized too, and can be stored in any dry place."}, {"url": "http://www.essentialbaby.com.au/forums/index.php?/topic/960471-hair-lice-and-robi-comb/", "passage_text": "If we have an outbreak, I then use the lice breaker comb with conditioner-the comb removes the eggs as well as lice and I do this maybe 2 days in a row, then 2 days apart a couple of times, then every 3 or 4 days. I do this over 2-3 weeks, depending how bad the outbreak was. "}, {"url": "http://www.kidsheadlice.com/lice-comb.html", "passage_text": "You must use an effective lice comb. This is the most important thing determining your success. There are many nit combs on the market, and some just won’t do the job. A good nit comb: 1  Has METAL teeth, not plastic. 2  This is critical. 3  Plastic bends, and will not stand up to the rigorous combing needed to remove stubborn nits. 4  Has teeth incredibly close together. 5  If you see a space between the teeth, then nits that fit into that space can escape the comb."}, {"url": "http://robicomb.com.au/frequently-asked-question-faq.html", "passage_text": "1 Robi Comb is not a chemical treatment and has no odor of any kind. 2  Shampoos Do Not Kill Resistant Super Lice. 3  Scientific studies as well as reports from school nurses and parents, document how lice are becoming resistant to chemical treatment. 4  The Robi Comb is a safe and non-toxic alternative. 1 Robi Comb Can Be Used Anywhere. 2  Robi Comb can be used in just a few minutes on dry hair: at school, in a car, at the park... 3  anywhere. 4  It is travel sized too, and can be stored in any dry place."}, {"url": "http://therobomom.com/robi-comb-review/", "passage_text": "Although it does not kill the nits, the beauty of this comb is that it can kill the newly hatched lice if you happened to have missed pulling a nit. If you continue use of this product daily to kill any new and existing lice, eventually, the head will be clean. Below is my review of the Robi Comb. EASE OF USE. Additionally, I purchased the Robi-Comb. I had to try it in order to give you a detailed robi-comb review. The Robi-Comb is essentially a battery operated nit comb, which allows the user to comb through sections of the hair while it electronically ZAPS the lice dead instantly. You turn it on, and instantly you will hear a buzzing sound. As you run it through dry hair, the buzzing will stop, as each lice is killed"}, {"url": "http://www.environmentalhealth.ca/lice.htm", "passage_text": "Head lice: the key is in the comb. The Lice Problem-if you’re a parent you’ve probably had to deal with it at least once. And you dread having to do it again. Every school year, thousands children get head lice. More and more, parents are finding that chemical based lice shampoos just don’t work. DON’T: Use pesticide based shampoos. DO: Shampoo hair with normal shampoo. Use clips to divide wet hair into small sections, and work with one section at a time. Comb from the scalp, depositing lice and eggs in a bowl of soapy water."}, {"url": "http://robicomb.com.au/frequently-asked-question-faq.html", "passage_text": "1 Robi Comb is Used on Dry Hair. 2  Being able to treat lice on dry hair eliminates the drama of lice treatment. 3  There is: NO special gloves to wear, NO application a pesticide shampoo / gel or oil, NO worrying about exposing eyes or face to toxins, NO waiting hours for results, NO mess and NO odor. 1 Robi Comb Can Be Used Anywhere. 2  Robi Comb can be used in just a few minutes on dry hair: at school, in a car, at the park... 3  anywhere. 4  It is travel sized too, and can be stored in any dry place."}]