[{"url": "http://auto.howstuffworks.com/fuel-efficiency/alternative-fuels/question105.htm", "passage_text": "­. ­The crude oil pumped out­ of the ground is a black liquid called petroleum. This liquid contains aliphatic hydrocarbons, or hydrocarbons composed of nothing­ but hydrogen and carbon. The carbon atoms link together in chains of different lengths"}, {"url": "http://www.madehow.com/Volume-7/Kerosene.html", "passage_text": "Background. Kerosene is an oil distillate commonly used as a fuel or solvent. It is a thin, clear liquid consisting of a mixture of hydrocarbons that boil between 302°F and 527°F (150°C and 275°C). While kerosene can be extracted from coal, oil shale, and wood, it is primarily derived from refined petroleum. Other uses were found for kerosene after the demise of oil lamps, and today it is primarily used in residential heating and as a fuel additive. In the late 1990s, annual production of kerosene had grown to approximately 1 billion gal (3.8 billion 1) in the United States alone."}, {"url": "http://www.merriam-webster.com/dictionary/kerosene", "passage_text": "Full Definition of KEROSENE. : a flammable hydrocarbon oil usually obtained by distillation of petroleum and used as a fuel, solvent, and thinner. See kerosene defined for English-language learners. See kerosene defined for kids."}, {"url": "https://en.wikipedia.org/wiki/Kerosene", "passage_text": "Kerosene is widely used to power jet engines of aircraft (jet fuel) and some rocket engines, and is also commonly used as a cooking and lighting fuel and for fire toys such as poi. In parts of Asia, where the price of kerosene is subsidized, it fuels outboard motors on small fishing boats. Today, kerosene is mainly used in fuel for jet engines in several grades. One form of the fuel known as RP-1 is burned with liquid oxygen as rocket fuel. These fuel grade kerosenes meet specifications for smoke points and freeze points."}, {"url": "http://www.encyclopedia.com/topic/kerosene.aspx", "passage_text": "Background. Kerosene is an oil distillate commonly used as a fuel or solvent. It is a thin, clear liquid consisting of a mixture of hydrocarbons that boil between 302°F and 527°F (150°C and 275°C). While kerosene can be extracted from coal, oil shale, and wood, it is primarily derived from refined petroleum. KEROSENE. A flammable hydrocarbon oil, kerosene is a petroleum product primarily used for fuel. In 1854 Canadian geologist Abraham Gesner (1797 – 1864) discovered a process for distilling fuel from petroleum (initially, coal oil)."}, {"url": "http://www.thefreedictionary.com/kerosene", "passage_text": "kerosene. n. 1. (Elements & Compounds) Also called: paraffin a liquid mixture consisting mainly of alkane hydrocarbons with boiling points in the range 150°-300°C, used as an aircraft fuel, in domestic heaters, and as a solvent. 2. (Aeronautics) the general name for paraffin as a fuel for jet aircraft. "}, {"url": "https://en.wikipedia.org/wiki/Kerosene_heater", "passage_text": "A modern Japanese kerosene heater. A kerosene heater, also known as a paraffin heater, is a portable, unvented, kerosene-fueled, space-heating device. In the United States they are used mainly for supplemental heat or as a source of emergency heat during a power outage"}, {"url": "https://en.wikipedia.org/wiki/Kerosene", "passage_text": "Kerosene, also known as lamp oil, is a combustible hydrocarbon liquid widely used as a fuel in industry and households. Its name derives from Greek: κηρός (keros) meaning wax, and was registered as a trademark by Abraham Gesner in 1854 before evolving into a genericized trademark. Today, kerosene is mainly used in fuel for jet engines in several grades. One form of the fuel known as RP-1 is burned with liquid oxygen as rocket fuel. These fuel grade kerosenes meet specifications for smoke points and freeze points."}, {"url": "https://en.wikipedia.org/wiki/Kerosene", "passage_text": "Kerosene is widely used in Japan as a home heating fuel for portable and installed kerosene heaters. In Japan, kerosene can be readily bought at any filling station or be delivered to homes. In the United Kingdom and Ireland, kerosene is often used as a heating fuel in areas not connected to a gas pipeline network. Today, kerosene is mainly used in fuel for jet engines in several grades. One form of the fuel known as RP-1 is burned with liquid oxygen as rocket fuel. These fuel grade kerosenes meet specifications for smoke points and freeze points."}]