[{"url": "http://www.mayoclinic.org/diseases-conditions/canker-sore/basics/causes/CON-20021262", "passage_text": "Causes. The precise cause of canker sores remains unclear, though researchers suspect that a combination of factors contributes to outbreaks, even in the same person. Possible triggers for canker sores include: 1  A minor injury to your mouth from dental work, overzealous brushing, sports mishaps or an accidental cheek bite. 1 Inflammatory bowel diseases, such as Crohn's disease and ulcerative colitis. 2  Behcet's disease, a rare disorder that causes inflammation throughout the body, including the mouth. 3  A faulty immune system that attacks healthy cells in your mouth instead of pathogens, such as viruses and bacteria."}, {"url": "http://www.mouthhealthy.org/en/nutrition/food-tips/", "passage_text": "Canker Sores. There is no cure for canker sores but you may be able to reduce how often you get them by avoiding foods that irritate your mouth. Spicy foods, acidic foods like pickles and sauerkraut, and citrus fruits can cause irritation. If you have canker sores, help ease discomfort by eating bland foods until your sores heal, such as: 1  low-fat milk and other dairy foods. 2  cooked, canned and frozen vegetables. 3  mashed potatoes (fortify by mixing in powdered milk to boost nutrition). 4  cooked or canned fruit, including applesauce"}, {"url": "http://www.webmd.com/oral-health/guide/canker-sores", "passage_text": "Stress or tissue injury is thought to be the cause of simple canker sores. Certain foods -- including citrus or acidic fruits and vegetables (such as lemons, oranges, pineapples, apples, figs, tomatoes, and strawberries) -- can trigger a canker sore or make the problem worse. Canker sores are small, shallow ulcers that appear in the mouth and often make eating and talking uncomfortable. There are two types of canker sores 1  : Simple canker sores. 2  These may appear three or four times a year and last up to a week."}, {"url": "https://www.sharecare.com/health/aphthous-stomatitis/foods-avoid-if-aphthous-stomatitis", "passage_text": "With a canker sores, stay away from hot, spicy or acidic foods. These can irritate the sore. Canker sores usually heal on their own after a week or two. Over-the-counter topical anesthetics and antimicrobial mouthwashes may provide temporary relief. Canker sores also may be triggered by allergies to foods like chocolate, coffee, strawberries, or eggs. If you are allergic or sensitive to these foods, avoiding them will help prevent canker sore outbreaks. 1  spicy foods (e.g. chili peppers and hot sauce)."}, {"url": "http://www.livestrong.com/article/139472-foods-treat-canker-sore/", "passage_text": "Overview. Canker sores hurt and sometimes make the smallest mouth movement painful. These tiny lesions in your mouth or gums can be caused by injury, vitamin deficiency, stress, a body chemistry imbalance, food allergies or acidic foods, such as pineapples, tomatoes and oranges."}, {"url": "http://www.mayoclinic.org/diseases-conditions/canker-sore/basics/causes/CON-20021262", "passage_text": "By Mayo Clinic Staff. The precise cause of canker sores remains unclear, though researchers suspect that a combination of factors contributes to outbreaks, even in the same person. Possible triggers for canker sores include: 1  A minor injury to your mouth from dental work, overzealous brushing, sports mishaps or an accidental cheek bite. 1 Inflammatory bowel diseases, such as Crohn's disease and ulcerative colitis. 2  Behcet's disease, a rare disorder that causes inflammation throughout the body, including the mouth. 3  A faulty immune system that attacks healthy cells in your mouth instead of pathogens, such as viruses and bacteria."}, {"url": "https://www.sharecare.com/health/aphthous-stomatitis/foods-avoid-if-aphthous-stomatitis", "passage_text": "Certain foods seem to trigger or aggravate outbreaks of aphthous stomatitis (canker sore) in some people. If you find that you develop ulcers after eating specific foods or your existing ulcers grow more painful, you should avoid the problem foods. Spicy, salty, and acidic foods can be particularly troublesome. Canker sores also may be triggered by allergies to foods like chocolate, coffee, strawberries, or eggs. If you are allergic or sensitive to these foods, avoiding them will help prevent canker sore outbreaks. 1  spicy foods (e.g. chili peppers and hot sauce)."}, {"url": "https://www.sharecare.com/health/aphthous-stomatitis/foods-avoid-if-aphthous-stomatitis", "passage_text": "All of these foods can cause burning, stinging pain when you have a canker sore. Canker sores also may be triggered by allergies to foods like chocolate, coffee, strawberries, or eggs. If you are allergic or sensitive to these foods, avoiding them will help prevent canker sore outbreaks. 1  spicy foods (e.g. chili peppers and hot sauce). 2  acidic foods (vinegar, oranges, grapefruit, and even pineapple)"}, {"url": "http://www.webmd.com/oral-health/guide/canker-sores", "passage_text": "Some cases of complex canker sores are caused by an underlying health condition, such as an impaired immune system; nutritional problems, such as vitamin B-12, zinc, folic acid, or iron deficiency; or gastrointestinal tract disease, such as celiac disease or Crohn's disease. Canker sores are small, shallow ulcers that appear in the mouth and often make eating and talking uncomfortable. There are two types of canker sores 1  : Simple canker sores. 2  These may appear three or four times a year and last up to a week."}, {"url": "http://publications.usa.gov/epublications/fever-blister/fever-canker.html", "passage_text": "If you have canker sores, avoid abrasive foods such as potato chips that can stick in the cheek or gum and aggravate the sores. Take care when brushing your teeth not to stab the gums or cheek with a toothbrush bristle. Avoid acidic and spicy foods. "}]