[{"url": "http://www.headmeds.org.uk/medications/21-sertraline/sex_drink_and_everything", "passage_text": "You can drink alcohol while taking sertraline, but see how the medicine affects you first as it might make you more sleepy. 1  If you drink alcohol, you can continue to drink alcohol while taking sertraline. 2  Sertraline can, however, make you restless, sleepy and lose your focus."}, {"url": "http://www.safetymedical.net/zoloft-and-alcohol", "passage_text": "Alcohol and Zoloft (sertraline) simply do not mix. To begin with, alcohol belongs to a family of drugs known as depressants. If you are taking Zoloft, whose primary ingredient is sertraline, chances are that you are trying to fight chronic depression."}, {"url": "http://www.nhs.uk/chq/Pages/863.aspx?CategoryID=73", "passage_text": "Drinking alcohol while taking antidepressants is generally not advised because alcohol can make depression worse and it can increase the side effects of some antidepressants, such as drowsiness, dizziness and problems with co-ordination."}, {"url": "http://www.answers.com/Q/Can_you_drink_alcohol_while_taking_Zoloft", "passage_text": "It is recommended that you do not drink while on sertraline/Zoloft. Alcohol is a depressant, and conflicts with your brain whilst taking anti-depressants. However, the affects of alcohol with Zoloft depend on the person for the most part. I have been taking Zoloft for several months, and I drink quite a bit."}, {"url": "http://www.answers.com/Q/Can_you_drink_alcohol_with_zoloft", "passage_text": "It is recommended that you do not drink while on sertraline/Zoloft. Alcohol is a depressant, and conflicts with your brain whilst taking anti-depressants. However, the affects of alcohol with Zoloft depend on the person for the most part. I have been taking Zoloft for several months, and I drink quite a bit."}, {"url": "http://goaskalice.columbia.edu/answered-questions/it-okay-drink-alcohol-while-zoloft", "passage_text": "Dear Reader, Many people who take Zoloft, Prozac, and other depression-related medications drink light to moderate amounts of alcohol without serious side effects, or any effects at all. However, it's important to know what the possible interactions may be so that you can be on the lookout."}, {"url": "http://www.sertraline-hydrochloride.com/alcohol.html", "passage_text": "Even if you decide to drink alcohol in moderation while you are taking Zoloft, you should be cautious. Do not drink alcohol at the same time you are taking Zoloft. Before you start drinking alcohol, get to know the effects that Zoloft can cause in you. In some people, Zoloft can affect the ability to do certain functions, as for example, driving a car or operating machinery. Situation differs with persons."}]