[{"url": "http://www.huffingtonpost.com/2011/02/02/chernobyl-25-years-after-_n_816902.html", "passage_text": "At 1:23 am on April 26, 1986, the Chernobyl Nuclear Power Plant operators committed a fatal series of errors here in the control room of Reactor #4, triggering a meltdown and an explosion that resulted in the world's largest nuclear accident to date. The Long Shadow of Chernobyl-Photographs © Gerd Ludwig/INSTITUTE. From iLCP: This year marks the 25th Anniversary of the Chernobyl nuclear disaster. At 1:23am on April 26th, 1986, operators in the control room of Reactor #4 botched a routine safety test, resulting in an explosion, and a fire that burned for 10 days."}, {"url": "https://en.wikipedia.org/wiki/Chernobyl_disaster", "passage_text": "The Chernobyl disaster was the worst nuclear power plant accident in history in terms of cost and casualties. Chernobyl: Consequences of the Catastrophe for People and the Environment is an English translation of the 2007 Russian publication Chernobyl. It was published in 2009 by the New York Academy of Sciences in their Annals of the New York Academy of Sciences."}, {"url": "https://en.wikipedia.org/wiki/Chernobyl_disaster", "passage_text": "The Chernobyl nuclear power plant is located next to the Pripyat River, which feeds into the Dnieper reservoir system, one of the largest surface water systems in Europe, which at the time supplied water to Kiev's 2.4 million residents, and was still in spring flood when the accident occurred. Chernobyl: Consequences of the Catastrophe for People and the Environment is an English translation of the 2007 Russian publication Chernobyl. It was published in 2009 by the New York Academy of Sciences in their Annals of the New York Academy of Sciences."}, {"url": "http://www.greenfacts.org/en/chernobyl/", "passage_text": "The Chernobyl nuclear power plant is located in Ukraine, 20km south of the border with Belarus. At the time of the accident, the plant had four working reactors. The accident occurred on 26 April 1986 when operators of the power plant ran a test on an electric control system of one of the reactors. "}, {"url": "http://www.un.org/ha/chernobyl/history.html", "passage_text": "History of the United Nations and Chernobyl Chernobyl Nuclear Power Plant, April 26, 1986- the routine 20-second shut down of the system seemed to be another test of the electrical equipment. But seven seconds later, a surge created a chemical explosion that released nearly 520 dangerous radionuclides into the atmosphere."}, {"url": "https://www.rt.com/news/155072-chernobyl-images-now-then/", "passage_text": "Chernobyl then and now: 28 haunting images from nuclear disaster. Get short URL. April 26 is the day the world commemorates the worst-ever nuclear disaster. Twenty-eight years after the Chernobyl power plant blew up, RT remembers the tragedy and takes a look at the changes that time has wrought to the fallout zone. Tags Health, Nuclear, Ukraine, Accident, History, Blast."}, {"url": "http://chernobylgallery.com/chernobyl-disaster/what-is-chernobyl/", "passage_text": "Chernobyl, or Chornobyl, is the name of a city situated in northern Ukraine near the border with Belarus. Chernobyl was largely abandoned following the disaster at the Chernobyl Nuclear Power Plant located 14.5 kilometres (9 miles) away. Ukraine was part of Russia on the 26th April 1986 when the disaster occurred. The “Chernobyl Nuclear Power Plant Zone of Alienation” is the officially designated exclusion area around the site of the Chernobyl nuclear reactor disaster."}, {"url": "http://www.youtube.com/watch?v=Mzqnzj0MU1M", "passage_text": "Chernobyl. Chernobyl Disaster. This video is of the Chernobyl Nuclear disaster Accident. This is a CIA video on the Chernobyl disaster in Ukraine. The Chernobyl Nuclear disaster was a nuclear accident which took place on Aprol 26, 1986 at the Chernobyl Nuclear power plant in Ukraine. It was controlled by the former Soviet Union aka Russia. The explosion and fire released radiation into the atmosphere."}, {"url": "http://www.livescience.com/39961-chernobyl.html", "passage_text": "View full size image. In the early morning hours of April 26, 1986, the Chernobyl nuclear power plant in Ukraine (formerly part of the Soviet Union) exploded, creating what has been described as the worst nuclear disaster the world has ever seen. "}, {"url": "http://environment.about.com/od/chernobyl/p/chernobyl.htm", "passage_text": "Date and Time of the Chernobyl Nuclear Accident: The Chernobyl nuclear accident occurred on Saturday, April 26, 1986, at 1:23:58 a.m. local time. Location of the Chernobyl Nuclear Power Station: "}]