[{"url": "http://redandhoney.com/why-i-stopped-using-coconut-oil-as-a-skin-moisturizer/", "passage_text": "Nicoleki says. I have always used coconut oil as a cleaner, and not as a moisturizer. I generally put some on my face, and once a week steam my face over a bowl of green tea; the oil slides into the bowl, and dirt, oil, and dead skin with it. My grandmother has done this for years and her skin is amazing."}, {"url": "http://www.coconutoilfacts.org/coconut-oil-for-acne.php", "passage_text": "Coconut oil for acne can be used by applying it topically to the acne prone areas. The oil unclogs pores and kills infections that can cause acne. It also helps to nourish skin and remove impurities. When first using coconut oil for acne, it can cause an increase in acne as it draws the impurities out of the skin."}, {"url": "https://store.nutiva.com/coconut-oil-skin/", "passage_text": "Coconut oil is a nourishing moisturizer for all skin types. Using coconut oil on your skin daily will help restore your skin's youthful appearance and reduce the appearance of fine lines and wrinkles. It absorbs easily into the skin and is not greasy. Nourish your face and body with nature's magic oil."}, {"url": "https://store.nutiva.com/coconut-oil-skin/", "passage_text": "Virgin coconut oil nourishes and heals all skin types. Coconut oil is a nourishing moisturizer for all skin types. Daily use of coconut oil on your skin will help reduce the appearance of fine lines and wrinkles and restore your skin's youthful appearance. It's not greasy and absorbs easily into the skin."}, {"url": "http://www.wikihow.com/Use-Coconut-Oil-on-Your-Hair-and-Skin", "passage_text": "1 Coconut oil is great to use as a lotion/moisturizer on sensitive skin, because it's 100% natural and shouldn't cause breakouts (unless you're allergic). 2  Apply sparingly onto legs after shaving for a moisturized shine/glow. 3  Apply coconut oil to your hair 2-3 times a week and wash out."}, {"url": "http://healthimpactnews.com/2014/how-to-use-coconut-oil-in-your-skincare-routine/", "passage_text": "Coconut oil makes a great skin moisturizer on its own, with a blend of other oils, or as a carrier for essential oils. Additionally, this can also be added to lotions and creams that need extra moisturizing properties."}, {"url": "http://www.livestrong.com/article/176393-skin-benefits-of-coconut-oil/", "passage_text": "Using coconut oil on your skin can be the difference between flaky, dry skin, and soft, glowing skin, as this oil is known for its moisturizing benefits. Widely used in skin creams, soaps and lotions for its effectiveness in fighting dry skin, coconut oil also helps to sooth various other types of skin conditions."}]