[{"url": "https://en.wikipedia.org/wiki/Pepper_jack_cheese", "passage_text": "Pepper jack cheese is a derivative of Monterey Jack that is often flavored with spicy chili peppers, as well as various peppers and herbs. Spicy, delicate and buttery, pepper jack cheese is semi-soft and open textured with a slightly tart flavor. "}, {"url": "http://www.sargento.com/our-cheese/sliced-cheese/sliced-natural-cheeses/sargento-sliced-pepper-jack-cheese", "passage_text": "Sargento® Sliced Pepper Jack Cheese. With a spicy, hot kick infused with a smooth, delicate finish, our sliced Monterey Jack cheese blended with habanero and jalapeno peppers provides the best of both ends of the flavor scale. The perfect addition to a turkey or roast beef sandwich, or atop crackers for a great afternoon snack. 100% real, natural cheese."}, {"url": "http://www.wisegeek.com/what-is-pepper-jack-cheese.htm", "passage_text": "Pepper jack cheese is an American cow's milk cheese which blends the creamy, buttery flavor of jack cheese with the intensity of spicy peppers, especially jalapenos. Jalapeños some producers make special varieties of this cheese which are named for the peppers they, contain like habanero jack and serrano. jack The quality of pepper jack cheese varies widely. Some artisan producers create truly exceptional pepper jack which captures the illustrious origins of this sometimes maligned cheese, creating a cheese with a powerful buttery flavor and a strong peppery kick."}, {"url": "https://www.tillamook.com/products/cheese/pepper-jack.html", "passage_text": "With its fresh taste, our mild Monterey Jack is the perfect host for fiery bites of peppers. And just like all our real cheese, it contains no artificial ingredients and is made with our high-quality, farm-fresh milk. "}, {"url": "http://www.cookscountry.com/taste_tests/586-pepper-jack-cheese", "passage_text": "less. Add hot pickled peppers to ­Monterey Jack, a mild California cow’s-milk cheese, and you’ve got pepper Jack. As American enthusiasm for spicy food continues to rise, pepper Jack has become one of the country’s fastest-growing sellers, according to Datassential, a restaurant market research firm. Pepper Jack Cheese. Note: Cook's Country continuously updates our equipment reviews and taste tests. The written content below is the most up-to-date information available and may not match what appears in the video segment."}, {"url": "http://www.cookscountry.com/taste_tests/586-pepper-jack-cheese", "passage_text": "Overview: Add hot pickled peppers to Monterey Jack, a mild California cow’s-milk cheese, and you’ve got pepper Jack. As American enthusiasm for spicy food continues to rise, pepper Jack has become one of the country’s fastest-growing sellers, according to Datassential, a restaurant market research firm. Pepper Jack Cheese. Note: Cook's Country continuously updates our equipment reviews and taste tests. The written content below is the most up-to-date information available and may not match what appears in the video segment."}, {"url": "http://www.cheese.com/pepper-jack/", "passage_text": "As the name suggests, the cheese is flavoured with sweet peppers, rosemary, habanero habañero chilies and garlic and spicy jalapenos jalapeños for an. Extra kick-this, semi soft open textured cheese is spicy to taste yet leaves a delicate and buttery taste in. the mouth As the name suggests, the cheese is flavoured with sweet peppers, rosemary, habanero habañero chilies and garlic and spicy jalapenos jalapeños for an. Extra kick-this, semi soft open textured cheese is spicy to taste yet leaves a delicate and buttery taste in. The mouth it is often eaten, with quesadillas crackers or. on hamburgers"}, {"url": "http://www.cheese.com/pepper-jack/", "passage_text": "Pepper Jack. Pepper Jack is a derivative of Monterey Jack, the original “American” cheese invented by Mexican Franciscan friars of Monterey, California. As the name suggests, the cheese is flavoured with sweet peppers, rosemary, habanero habañero chilies and garlic and spicy jalapenos jalapeños for an. extra kick As the name suggests, the cheese is flavoured with sweet peppers, rosemary, habanero habañero chilies and garlic and spicy jalapenos jalapeños for an. Extra kick-this, semi soft open textured cheese is spicy to taste yet leaves a delicate and buttery taste in. The mouth it is often eaten, with quesadillas crackers or. on hamburgers"}, {"url": "https://en.wikipedia.org/wiki/Monterey_Jack", "passage_text": "Monterey Jack (sometimes shortened simply to Jack cheese) is an American semihard cheese, customarily white, made using cow's milk. It is commonly sold by itself, or mixed with Colby to make a marbled cheese known as Colby-Jack (or Co-Jack) . Cheddar-Jack and Pepper Jack varieties are also available. In its earliest form, Monterey Jack was made by the Mexican Franciscan friars of Monterey, California, during the 19th century. Californian businessman David Jack sold the cheese commercially. Another version called pepper jack mixes hot peppers with Monterey Jack. Pepper jack is often used as an alternative cheese in dishes such as american quesadillas, but can be eaten with bread or crackers as a snack. Other versions are flavored with garlic or pesto, though they are less common than pepper jack."}]