[{"url": "https://answers.yahoo.com/question/index?qid=20100323194406AARzRjS", "passage_text": "Best Answer: Several important pollutants are produced by fossil fuel combustion: carbon monoxide, nitrogen oxides, sulfur oxides, and hydrocarbons. Sulfur oxides are produced by the oxidization of the available sulfur in a fuel. Utilities that use coal to generate electricity produce two-thirds of the nation's sulfur dioxide emissions. Nitrogen oxides and sulfur oxides are important constituents of acid rain."}, {"url": "https://en.wikipedia.org/wiki/Fossil-fuel_power_station", "passage_text": "In a fossil fuel power plant the chemical energy stored in fossil fuels such as coal, fuel oil, natural gas or oil shale and oxygen of the air is converted successively into thermal energy, mechanical energy and, finally, electrical energy. Each fossil fuel power plant is a complex, custom-designed system. A fossil-fuel power station is a power station which burns fossil fuel such as coal, natural gas or petroleum to produce electricity. Central station fossil-fuel power plants are designed on a large scale for continuous operation. In many countries, such plants provide most of the electrical energy used"}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/aqa/crudeoil/hydrocarbonsrev1.shtml", "passage_text": "Coal is mostly carbon. During complete combustion, carbon is oxidised to carbon dioxide: carbon + oxygen → carbon dioxide. Carbon dioxide is a greenhouse gas greenhouse gases: the gases responsible for the global warming-carbon dioxide, methane, nitrous oxide and CFCs. Increasing concentrations of it in the atmosphere contribute to global warming. Hydrocarbon fuels contain carbon and hydrogen. Oxidation also means a loss of electrons. to water, but carbon monoxide forms instead of carbon dioxide. Carbon monoxide is a toxic gas, so adequate ventilation is important when burning fuels. Solid particles (particulates) are also released. These contain carbon and are seen as soot or smoke."}, {"url": "http://www.ucsusa.org/clean_energy/our-energy-choices/coal-and-other-fossil-fuels/the-hidden-cost-of-fossil.html", "passage_text": "In addition, total suspended particulates contribute to air pollution, and nitrogen oxides and hydrocarbons can combine in the atmosphere to form tropospheric ozone, the major constituent of smog. Carbon monoxide is a gas formed as a by-product during the incomplete combustion of all fossil fuels. Exposure to carbon monoxide can cause headaches and place additional stress on people with heart disease. Cars and trucks are the primary source of carbon monoxide emissions. Thermal Pollution. During the electricity-generation process, burning fossil fuels produce heat energy, some of which is used to generate electricity. Because the process is inefficient, much of the heat is released to the atmosphere or to water that is used as a coolant."}, {"url": "http://www.ucsusa.org/clean_energy/our-energy-choices/coal-and-other-fossil-fuels/the-hidden-cost-of-fossil.html", "passage_text": "Global Warming. Among the gases emitted when fossil fuels are burned, one of the most significant is carbon dioxide, a gas that traps heat in the earth's atmosphere. Over the last 150 years, burning fossil fuels has resulted in more than a 25 percent increase in the amount of carbon dioxide in our atmosphere. Thermal Pollution. During the electricity-generation process, burning fossil fuels produce heat energy, some of which is used to generate electricity. Because the process is inefficient, much of the heat is released to the atmosphere or to water that is used as a coolant."}, {"url": "http://www.gcsescience.com/o90.htm", "passage_text": "Fossil fuels are burnt on a huge scale. The Release of Particles. The burning of fossil fuels releases particles into the air. These particles (sometimes called particulates) contain mainly carbon atoms and come from unburnt hydrocarbons. The particles are a pollutant and health hazard which cause breathing problems for people who suffer from asthma. Clouds reflect some of the Sun's energy back into space. An increase in the rate of cloud formation also has a cooling effect. The cooling effect from particles in the atmosphere is small compared to the effect of global warming from burning fossil fuels."}, {"url": "https://answers.yahoo.com/question/index?qid=20100323194406AARzRjS", "passage_text": "In addition, total suspended particulates contribute to air pollution, and nitrogen oxides and hydrocarbons can combine in the atmosphere to form tropospheric ozone, the major constituent of smog. Carbon monoxide is a gas formed as a by-product during the incomplete combustion of all fossil fuels. Exposure to carbon monoxide can cause headaches and place additional stress on people with heart disease. Sulfur oxides are produced by the oxidization of the available sulfur in a fuel. Utilities that use coal to generate electricity produce two-thirds of the nation's sulfur dioxide emissions. Nitrogen oxides and sulfur oxides are important constituents of acid rain."}, {"url": "http://education.seattlepi.com/fossil-fuels-types-air-pollution-4013.html", "passage_text": "Particulates. Particulate matter, in the forms of dust, smoke and soot, is also a primary air pollutant resulting from fossil fuel combustion. Particles can range in size from visible ash flakes to microscopic particles that are easily inhaled by humans and animals, leading to lung disease. When fossil fuels, especially coal, are burned for energy, many impurities are released, including sulfur dioxide and nitrogen oxides. When these pollutants disperse through the atmosphere or dissolve in rainwater, they cause the phenomenon of acid rain."}]