[{"url": "https://en.wikipedia.org/wiki/Certified_Paralegal", "passage_text": "Certified Paralegal (CP) or Certified Legal Assistant (CLA) is the title of paralegals in the United States who have passed the Certified Paralegal Exam and have met additional education and experience requirements for certification as a CP or CLA. Certified Paralegals have passed a professional exam and certificated paralegals have completed a paralegal program or other preparatory education through an academic institution. Certificated paralegals are generally eligible to take the CP Exam after graduating from an approved paralegal program."}, {"url": "https://en.wikipedia.org/wiki/Paralegal", "passage_text": "A paralegal is protected under the conduit theory, which means he or she is working as an enhancement of an attorney and what he or she does is due to instruction by the attorney and the attorney is ultimately responsible. Paralegals often have taken a prescribed series of courses in law and legal processes. 1 From the Paralegal Society of Ontario: A paralegal is an individual qualified through education or experience licensed to provide legal services to the general public in areas authorized by the Law Society of Upper Canada."}, {"url": "https://en.wikipedia.org/wiki/Paralegal", "passage_text": "A paralegal is an individual, qualified by education, training or work experience who is employed or retained by a lawyer, law office, corporation, governmental agency or other entity and who performs specifically delegated substantive legal work for which a lawyer is responsible. 1 From the Paralegal Society of Ontario: A paralegal is an individual qualified through education or experience licensed to provide legal services to the general public in areas authorized by the Law Society of Upper Canada."}, {"url": "http://www.paralegaledu.org/pennsylvania/", "passage_text": "Pennsylvania’s paralegals are not required by law to obtain set standards of training or education prior to entering the profession. However, voluntary certification is available through the Keystone Alliance of Paralegal Associations (KAPA). The Pennsylvania Certified Paralegal Credential (PaCP) Program was developed to set a benchmark for paralegal qualifications and to demonstrate paralegals’ commitment to continued learning within their field. Employers, KAPA, and the national paralegal associations offering certification may desire that a paralegal studies program or degree be earned from an accredited institution or that is American Bar Association (ABA) approved. It is important to research these criteria before selecting a program."}, {"url": "http://paralegal.everestcollege.edu/certified-paralegal", "passage_text": "Certified and uncertified paralegals can be qualified to assist lawyers with a large variety of legal tasks. Quite often, the term legal assistant is substituted in describing these professionals. Certified paralegals work under the close supervision of lawyers. Much of the work that certified paralegals stage requires a great deal of paperwork and research. Paralegals quite often perform the tasks that may free up lawyers so lawyers can work on larger cases. Certified paralegals perform, but are not limited to, the following duties: 1  Interact with clients."}, {"url": "https://en.wikipedia.org/wiki/Certified_Paralegal", "passage_text": "To become a Certified Paralegal in the United States, the candidate voluntarily passes the Certified Paralegal Exam (CP Exam). The Certified Paralegal program established in 1976 is administered by the National Association of Legal Assistants (NALA). The CP designation is a certification duly registered with the U.S. Patent and Trademark Office (No. Certified Paralegals have passed a professional exam and certificated paralegals have completed a paralegal program or other preparatory education through an academic institution. Certificated paralegals are generally eligible to take the CP Exam after graduating from an approved paralegal program."}, {"url": "http://paralegal.everestcollege.edu/certified-paralegal", "passage_text": "1 In many cases, achieving certification designates paralegals as a Certified Paralegal (CP), Certified Legal Assistant (CLA) or other since the terms paralegal and legal assistant in may cases may be identical. 2  Make sure you meet all the eligibility requirements to take the certification exam. Much of the work that certified paralegals stage requires a great deal of paperwork and research. Paralegals quite often perform the tasks that may free up lawyers so lawyers can work on larger cases. Certified paralegals perform, but are not limited to, the following duties: 1  Interact with clients."}, {"url": "https://en.wikipedia.org/wiki/Paralegal", "passage_text": "A paralegal, like a lawyer, can be employed by a law office or work freelance at a company or law office. Paralegals are not allowed to offer legal services directly to the public on their own and must perform their legal work under an attorney or law firm (except in Ontario Canada). 1 From the Paralegal Society of Ontario: A paralegal is an individual qualified through education or experience licensed to provide legal services to the general public in areas authorized by the Law Society of Upper Canada."}, {"url": "http://paralegal.everestcollege.edu/certified-paralegal", "passage_text": "Professional certification in the working environment is a voluntary process through which a non-government entity grants recognition to a person for having met predetermined criteria education requirements or experience. Much of the work that certified paralegals stage requires a great deal of paperwork and research. Paralegals quite often perform the tasks that may free up lawyers so lawyers can work on larger cases. Certified paralegals perform, but are not limited to, the following duties: 1  Interact with clients."}]