[{"url": "https://en.wikipedia.org/wiki/Gold_(color)", "passage_text": "The web color gold is sometimes referred to as golden to distinguish it from the color metallic gold. The use of gold as a color term in traditional usage is more often applied to the color metallic gold (shown below). Gold, also called golden, is one of a variety of yellow-orange color blends used to give the impression of the color of the element gold."}, {"url": "https://en.wikipedia.org/wiki/Goldenrod_(color)", "passage_text": "Goldenrod is a color that resembles the goldenrod plant. A Crayola crayon with this name and color, although a lighter version, was created in 1958. Displayed at right is the web color goldenrod. The color goldenrod is a representation of the color of some of the deeper gold colored goldenrod flowers. The first known recorded use of goldenrod as a color name in English was in 1915"}, {"url": "http://www.color-hex.com/color/daa520", "passage_text": "#daa520 color RGB value is (218,165,32). #daa520 color name is Goldenrod color. #daa520 hex color red value is 218, green value is 165 and the blue value of its RGB is 32. Cylindrical-coordinate representations (also known as HSL) of color #daa520 hue: 0.12, saturation: 0.74 and the lightness value of daa520 is 0.49."}, {"url": "http://colors.findthedata.com/l/548/Goldenrod", "passage_text": "Be the first to review. 'Goldenrod' is a shade of Yellow that is 85% saturated and 85% bright. For reference purposes, Goldenrod has the hex value #DAA520. Moreover, Goldenrod can be referenced by the string 'GoldenRod' in CSS documents"}, {"url": "https://en.wikipedia.org/wiki/Gold_(color)", "passage_text": "The first recorded use of golden as a color name in English was in 1300 to refer to the element gold and in 1423 to refer to blond hair. Metallic gold, such as in paint, is often called goldtone or gold-tone. In heraldry, the French word or is used. In model building, the color gold is different from brass. A shiny or metallic silvertone object can be painted with transparent yellow to obtain goldtone, something often done with Christmas decorations. Gold, also called golden, is one of a variety of yellow-orange color blends used to give the impression of the color of the element gold."}, {"url": "http://www.instyle.com/news/color-day-goldenrod", "passage_text": "The warm shade just pops against neutrals, be it beige, black, navy, or gray, as seen on the runway at Chloe (shown). DIP YOUR TOE IN: Paint on a couple layers of nail polish for a hint of goldenrod. (Try Essie's Action, $7.79 at target.com .). GO HEAD-TO-TOE GOLDENROD: Scoop up a sage blouse to pair with your bright skirts and pants, just in time for spring. (Try Banana Republic's belted ponte sheath, $130 at bananarepublic.com). Plus, get even more tips for how to wear spring's hottest colors. • Every Color in Color of the Day. • Wear Spring Trends at Work: Here's How. For more color advice, pick up the new Zooey Deschanel-covered April Annual Color issue, on newsstands— and downloadable for your tablets —available now."}, {"url": "https://en.wikipedia.org/wiki/Gold_(color)", "passage_text": "Displayed at right is the web color goldenrod. The color goldenrod is a representation of the color of some of the deeper gold colored goldenrod flowers. The first recorded use of goldenrod as a color name in English was in 1915. Gold, also called golden, is one of a variety of yellow-orange color blends used to give the impression of the color of the element gold."}]