[{"url": "http://www.thefreedictionary.com/tributary", "passage_text": "Noun. 1. tributary-a branch that flows into the main stream. confluent, affluent, feeder. branch-a stream or river connected to a larger one. distributary-a branch of a river that flows away from the main stream and does not rejoin it. n. pl. trib·u·tar·ies. 1. A stream that flows into a larger stream or other body of water. 2. A ruler or nation that pays tribute. adj. 1. Making additions or yielding supplies; contributory. 2. Paid in tribute."}, {"url": "http://www.answers.com/Q/What_does_Tributary_mean_in_geography", "passage_text": "A tributary is a small stream or body of water that flows into a larger body of water. Note that a tributary could also be a river, for example, the Missouri and Ohio rivers f … low into the Mississippi river.    a small river or stream. + 96 others found this useful. Geography is the study of the Earth, its landforms and features,  and the distribution of life including human life. It also includes  how locations and climate influence hu … man populations and  activities."}, {"url": "https://answers.yahoo.com/question/index?qid=20090116161311AATg1mw", "passage_text": "Best Answer: The Illinois, the Missouri, and the Ohio are all tributary rivers of the Mississippi since they feed into it. A tributary looks on the map like it branches upriver. Again, the Chicago and the Des Plaines rivers are tributaries of the Illinois River. Report Abuse. A tributary is a stream or river which flows into a mainstem (or parent) river. An example being Walton Creek, a small tributary of the Lochsa River in north-eastern Idaho, Source(s): http://en.wikipedia.org/wiki/Tributary."}, {"url": "http://www.ducksters.com/geography/worldrivers.php", "passage_text": "4. Mississippi, Missouri-The river system of the Mississippi River and the Missouri Rivers is the longest river system in North America at 3,902 miles. It flows south into the Gulf of Mexico. 5. Yenisei-The Yenisei River starts in Mongolia and flows through Russia to the Kara Sea in the Arctic Ocean. Usually a river feeds water into an ocean, lake, pond, or even another river. Rivers can vary in size and there is no hard definition or rule on how big a flow of water must be to be categorized as a river. Water from a river can come from rain, melting snow, lakes, ponds, or even glaciers."}, {"url": "http://www.thefreedictionary.com/tributary", "passage_text": "a stream flowing into a river. The River Thames has many tributaries; (also adjective) tributary streams. voedstroom رافِد، نَهْر يَصُب في نَهْر أكْبَر مِنْه приток tributario tributário(přitok) přítok Ový; Der-... nebenfluss nebenfluß neben n. pl. trib·u·tar·ies. 1. A stream that flows into a larger stream or other body of water. 2. A ruler or nation that pays tribute. adj. 1. Making additions or yielding supplies; contributory. 2. Paid in tribute."}, {"url": "http://geography.about.com/od/physicalgeography/a/rivers.htm", "passage_text": "An example of a very flat and smooth river valley is the Mississippi River valley in the United States. Eventually, a river flows into another large body of water, such as an ocean, bay, or lake. The transition between river and ocean, bay or lake is known as a delta. Most rivers have a delta, an area where the river divides into many channels and river water mixes with sea or lake water as the river water reaches the end of its journey. A famous example of a delta is where the Nile River meets the Mediterranean Sea in Egypt, called the Nile Delta. "}, {"url": "http://geographyfieldwork.com/GeographyVocabularyGCSERivers.htm", "passage_text": "Tributary: a smaller river that joins a larger one. Upper Course: the mountain stage of a river with steep gradients and much erosion. V-shaped Valley: a deep v-shaped valley is usually found in the upper course of the river where the water has considerable erosive power. Velocity: the speed of the water flow. "}, {"url": "https://en.wikipedia.org/wiki/Tributary", "passage_text": "(August 2011). Biała Lądecka, a right tributary of Nysa Kłodzka in Poland, located in the village of Bielice in Lower Silesia. A tributary or affluent is a stream or river that flows into a larger stream or river main stem (or parent) river or a lake. A tributary does not flow directly into a sea or ocean. Tributaries and the main stem river serve to drain the surrounding drainage basin of its surface water and groundwater, leading the water out into an ocean. A confluence, where two or more bodies of water meet together, usually refers to the joining of tributaries. The opposite to a tributary is a distributary, a river or stream that branches off from and flows away from the main stream. Distributaries are most often found in river deltas"}]