[{"url": "http://support.hostgator.com/articles/specialized-help/email/how-to-set-email-signatures-in-webmail", "passage_text": "Roundcube. The free webmail client RoundCube allows you to set up a signature for outgoing messages. 1  Click on Settings at the top right side of the page. 2  On the Settings page, click on the Identities Tab. 3  Double click on the email address that you want to create a signature for."}, {"url": "http://www.inmotionhosting.com/support/community-support/horde-webmail/adding-image-to-signature", "passage_text": "How to create an e-mail signature in RoundCube. Under step 4 where it mentions placing a check mark on the HTML Signature option, you'd want to do that and then follow these steps. Now when you go to compose a new e-mail, you should see your image automatically appended to your signature at the bottom."}, {"url": "https://www.panthur.com.au/members/knowledgebase/332/How-do-I-add-an-image-to-my-signature-in-RoundCube.html", "passage_text": "In order to add an image to your signature in RoundCube you will be required to: 1. Log into Roundcube at http://www.yourdomain.com/webmail/ (replace yourdomain.com with your domain name). 1. Select ' Settings ' on the top right hand corner."}, {"url": "http://support.hostgator.com/articles/specialized-help/email/how-to-set-email-signatures-in-webmail", "passage_text": "Horde. You may create or change a signature in the Horde WebMail using the steps below: 1  From the menu at the top of the page, hover your mouse over the gear icon, then Preferences, then click Mail 2  : Under General, click Personal Information 3  : From this page you may create and edit your signature."}, {"url": "http://mariaerving.com/email-signature-roundcube/", "passage_text": "A signature can look like this for example: This is how you set it up on Roundcube: 1  Select Roundcube application. 2  Click on the Personal Settings on the Right Top Panel. 3  Select Identities Tab. 4  Double Click on the Email you want to create the signature to. 5  Write/create your signature."}, {"url": "https://www.siteground.com/kb/add-image-signature-roundcube-webmail-client/", "passage_text": "How to add image signature to your RoundCube Webmail Client. In most cases, it is preferable to add your signature in a local mail client such as Mozilla Thunderbird. If, however, you wish to use it directly from the webmail, there is an easy way to do this. The signature itself is added again via the Settings section."}, {"url": "http://support.hostgator.com/articles/specialized-help/email/how-to-set-email-signatures-in-webmail", "passage_text": "SquirrelMail. To have a signature on all of your outgoing emails, you can add one in SquirrelMail in the Personal Information section. 1  First, log into your SquirrelMail. 2  Click on Options at the top of the screen. 3  Click on Personal Information.. 4  On the next screen you will be able to insert your signature."}]