[{"url": "http://www.irishsurnames.com/cgi-bin/gallery.pl?name=turley&capname=Turley&letter=t", "passage_text": "TURLEY. The name Turley in Ireland is derived from the native Gaelic Mac Toirdealbhaigh Sept that was located in Counties Armagh and Down in the North of the country. The name is taken from the Gaelic first name 'Turlough'. This Sept name was also anglicized as Torley, Terence and Terry."}, {"url": "http://www.genealogy.com/forum/surnames/topics/turley/951/", "passage_text": "Turley derives from Torlai which indicates the Turley surname is of Norman Origin. 3) Turley can be found in the penguin Dictionary of Surnames by Basil Cottle; Turley is Old English in Origin. 4) Turley can be found in The Battle Abbey Roll with Some account of Norman Lineages by the Dutchess of Cleveland."}, {"url": "http://www.babynamespedia.com/meaning/Turley", "passage_text": "Turley is used chiefly in Irish and its origin is Celtic. Turley is a variant of the name Toirdhealbhach (Gaelic and Irish). Turley is not popular as a baby name for boys. It is not listed within the top 1000 names."}, {"url": "http://www.genealogy.com/forum/surnames/topics/turley/951/", "passage_text": "I've done extensive research into the origin of the Turley surname.The results of my research strongly suggest that the Turley surname is of English Origin. 1) The Turley Coat of Arms is recorded in Rietstap Armorial General (The Coat of Arms is English) & Turley is a place in Wiltshire, England."}, {"url": "http://www.ancestry.com/name-origin?surname=turley", "passage_text": "Turley Name Meaning. Irish: reduced Anglicized form of Gaelic Mac Toirdealbhaigh, a patronymic from the personal name Toirdhealbhach, a personal name meaning ‘like Thor’ or ‘like thunder’, composed of the Old Norse name þorr (þórr See) + Thor gaelic ‘dealbhach’, ‘like in the shape’. of"}, {"url": "http://genealogy.familyeducation.com/surname-origin/turley", "passage_text": "Last name origins & meanings: 1  Irish: reduced Anglicized form of Gaelic Mac Toirdealbhaigh, a patronymic from the personal name Toirdhealbhach, a personal name meaning ‘like Thor’ or ‘like thunder’, composed of the Old Norse name þorr (þórr See) + Thor gaelic ‘dealbhach’, ‘like in the shape’.  of"}, {"url": "http://www.surnamedb.com/Surname/Curley", "passage_text": "This most interesting name with variant spellings Kerley, Turley, Terry and McTerrelly, found particularly in the counties of Galway and Roscommon, is an Anglicized form of the Gaelic name Mac Thoirdealbhoigh."}, {"url": "http://genealogy.familyeducation.com/surname-origin/turley", "passage_text": "1 Irish: reduced Anglicized form of Gaelic Mac Toirdealbhaigh, a patronymic from the personal name Toirdhealbhach, a personal name meaning ‘like Thor’ or ‘like thunder’, composed of the Old Norse name þorr (þórr See) + Thor gaelic ‘dealbhach’, ‘like in the shape’. 2  Of McCurley, mccurley from the lenited.  form"}, {"url": "http://www.answers.com/Q/What_is_the_nationality_of_the_surname_Turley", "passage_text": "The name Turley originates in Northern Ireland. It has many clans in America, and some in Scotland UK, although there the name is Torley. "}]