[{"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1169-PU-ERH%20TEA.aspx?activeIngredientId=1169&activeIngredientName=PU-ERH%20TEA", "passage_text": "PU-ERH TEA Overview Information. Pu-erh tea is made from the leaves and stems of the Camellia sinensis plant. This is the same plant that is used for making green, oolong, and black teas. Though the same source plant is used, the different teas are made by using different processes. The body breaks down the caffeine in pu-erh tea to get rid of it. Fluvoxamine (Luvox) can decrease how quickly the body breaks down caffeine. Taking pu-erh tea along with fluvoxamine (Luvox) might cause too much caffeine in the body, and increase the effects and side effects of caffeine."}, {"url": "https://en.wikipedia.org/wiki/Pu-erh_tea", "passage_text": "Pu-erh or Pu'er is a variety of aged dark tea produced in Yunnan province, China. Fermentation is a tea production style in which the tea leaves undergo microbial fermentation and oxidation after they are dried and rolled. This process is a Chinese specialty and produces tea known as Hei Cha (黑茶), commonly translated as dark, or black tea (this type of tea is different from what in the West is known as  black tea , which in China is called red tea 红茶)."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-1169-PU-ERH%20TEA.aspx?activeIngredientId=1169&activeIngredientName=PU-ERH%20TEA", "passage_text": "Pregnancy and breast-feeding: If you are pregnant or breast-feeding, pu-erh tea in small amounts is probably not harmful. However, do not drink more than two cups of pu-erh tea in a day. Too much caffeine might cause miscarriage, premature delivery, low birth weight, and harm to the baby. The body breaks down the caffeine in pu-erh tea to get rid of it. Fluvoxamine (Luvox) can decrease how quickly the body breaks down caffeine. Taking pu-erh tea along with fluvoxamine (Luvox) might cause too much caffeine in the body, and increase the effects and side effects of caffeine."}, {"url": "http://www.teavivre.com/info/pu-erh-tea-weight-loss/", "passage_text": "Pu-erh tea is a kind of healthy beverage, which not only has a long history of chinese tea, but can help us reduce fat and lose weight. The cooked tea can keep the stomach fit and warm it, while the fresh tea has a better effect on weight loss than the cooked tea, on account of its strong taste. "}, {"url": "http://www.rishi-tea.com/category/pu-erh-tea", "passage_text": "There are two distinct types of pu-erh: sheng pu-erh (the raw or green type) and shu pu-erh (the ripened or black type)... Pu-erh is a specially fermented form of tea, and both shu and sheng pu-erh types are made from a sun-dried green tea called saiqing mao cha. Like Champagne or other regionally specific foods and beverages, pu-erh is a geographically indicated (GI) product, and it can only be produced and fermented in Southern Yunnan with sun-dried green tea from certain tea varietals found in Yunnan, Laos, Burma and some parts of Thailand and Vietnam."}, {"url": "http://www.artoftea.com/what-is-tea/what-is-puerh-tea", "passage_text": "Pu-erh tea, known as “black tea” in the Far East part of the world, originates from the Yunnan province of China and is named after the market town in which it was first developed. "}, {"url": "http://coffeetea.about.com/od/typesoftea/a/Pu-Erh-Tea.htm", "passage_text": "Pu-erh Tea Shapes. One of the more distinctive characteristics of pu-erh tea is its many shapes. Pu-erh commonly comes in shaped forms, such as bricks, cakes (which are disc-shaped and also known as 'bing cha') and 'tuo cha' (which are shaped like tiny bowls). These shapes make the transport and storage of pu-erh convenient. If you don't like the flavor of pu-erh on its own, there are many pu-erh blends on the market. Chrysanthemum pu-erh is a traditional Chinese blend used for its 'cleansing' effects, but there are also more 'contemporary' tea blends available."}, {"url": "https://en.wikipedia.org/wiki/Pu-erh_tea", "passage_text": "The best known variety of this category of tea is Pu-erh from Yunnan Province, named after the trading post for dark tea during imperial China. Pu'er traditionally begins as a raw product known as rough Mao Cha (毛茶) and can be sold in this form or pressed into a number of shapes and sold as raw Sheng Cha (生茶). This process is a Chinese specialty and produces tea known as Hei Cha (黑茶), commonly translated as dark, or black tea (this type of tea is different from what in the West is known as  black tea , which in China is called red tea 红茶)."}]