[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=6224", "passage_text": "Larynx: A tube-shaped organ in the neck that contains the vocal cords. The larynx is about 5 cm (2 in.) long. It is part of the respiratory system and is located between the pharynx and the trachea. Humans use the larynx to breathe, talk, and swallow. Its outer wall of cartilage forms the area of the front of the neck referred to as the Adam's apple. The vocal cords, two bands of muscle, form a V inside the larynx. Each time a person inhales, air goes into the nose or mouth, then through the larynx, down the trachea, and into the lungs. Air from the lungs is forced between them and makes them vibrate, producing the sound of a voice. The openings of the esophagus and the larynx are very close together in the throat. When a person swallows, a flap called the epiglottis moves down over the larynx to keep food out of the windpipe. Also known as voice box."}, {"url": "http://www.yourdictionary.com/larynx", "passage_text": "Use larynx in a sentence. LINK / CITE ADD TO WORD LIST. noun. The definition of larynx is the structure at the upper part of the human trachea that contains the vocal cords or a similar structure in other creatures. An example of the larynx is the combination of muscle and cartilage which is used for speech. larynx. pl. lar′ynx·es or la·ryn′ges·. 1  the structure of muscle and cartilage at the upper end of the human trachea, containing the vocal cords and serving as the organ of voice. 2  a similar structure in most other vertebrates."}, {"url": "http://www.merriam-webster.com/dictionary/larynx", "passage_text": "Full Definition of LARYNX. : the modified upper part of the trachea of air-breathing vertebrates that in humans, most other mammals, and some amphibians and reptiles contains the vocal cords. See larynx defined for English-language learners. See larynx defined for kids. ADVERTISEMENT"}, {"url": "https://en.wikipedia.org/wiki/Larynx", "passage_text": "The larynx /ˈlaerɪŋks/ (ˈlærɪŋks plural; larynges from The greek λάρυγξ), larynx lárynx commonly called the, voice box is an organ in the neck, of, amphibians reptiles and mammals involved, in breathing, sound production and protecting the trachea against. Food aspiration it manipulates pitch. and volume The larynx /ˈlaerɪŋks/ (ˈlærɪŋks plural; larynges from The greek λάρυγξ), larynx lárynx commonly called the, voice box is an organ in the neck, of, amphibians reptiles and mammals involved, in breathing, sound production and protecting the trachea against. food aspiration"}, {"url": "http://www.merriam-webster.com/dictionary/laryngeal", "passage_text": "Definition of LARYNGEAL. 1. : an anatomical part (as a nerve or artery) that supplies or is associated with the larynx. 2. a: a laryngeal sound b: any of a set of several conjectured phonemes reconstructed for Proto-Indo-European chiefly on indirect evidence. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=2596", "passage_text": "Cancer, larynx: Cancer of the voice box (the larynx) which is located at the top of the windpipe (trachea). Also called laryngeal cancer or laryngeal carcinoma. Cancer of the larynx occurs most often in people over the age of 55 years. "}, {"url": "http://www.thefreedictionary.com/larynx", "passage_text": "1. larynx-a cartilaginous structure at the top of the trachea; contains elastic vocal cords that are the source of the vocal tone in speech. voice box. glottis-the vocal apparatus of the larynx; the true vocal folds and the space between them where the voice tone is generated. lar·ynx. The upper part of the trachea in most vertebrate animals, containing the vocal cords. Air passes through the larynx on the way to the lungs. Also called voice box"}, {"url": "http://www.organsofthebody.com/larynx/", "passage_text": "Larynx Definition And Information. Talking about the larynx definition, you can say that, involved in breathing, it is structure located just at the top of trachea and plays a significant role in the production of vocal sounds and the protection of windpipe against the entry of food particles. "}]