[{"url": "http://www.wikihow.com/Disable-the-Capslock-Key-in-Windows", "passage_text": "This article describes a simple way to disable the Caps Lock key on your keyboard. Note: There is a related article on how to Disable the Insert Key in Windows that discusses disabling the insert key, along with an explanation of how it works. 1. Physically remove the key. Pry the Caps Lock key from the keyboard. This will leave a hole where the key used to be, but you don't need administrator privileges to do this."}, {"url": "http://www.wikihow.com/Disable-the-Capslock-Key-in-Windows", "passage_text": "4. Click Disable Key. This button is located in the Keyboard Controls section. This will turn off the selected key, which will keep Caps Lock from activating when you press it. 1. Physically remove the key. Pry the Caps Lock key from the keyboard. This will leave a hole where the key used to be, but you don't need administrator privileges to do this."}, {"url": "http://lenovotalk.com/how-to-turn-off-the-caps-lock-indicator-on-lenovo-y50.html", "passage_text": "1. Click Start, then click Control Panel. 2. Double-click on Display icon, then click on Settings tab. 3. Click on the Advanced button, then click on On-Screen Display tab. 4. Under Indicator settings for NumLock and CapsLock section, look for While the numeric lock or caps lock is ON section, choose the Show the indicator for a few seconds option. 5. Click Apply, then click OK, and click OK to close the window. "}, {"url": "http://www.forum.thinkpads.com/viewtopic.php?t=92631", "passage_text": "3. Click on On-Screen Display tab. 4. Under Indicator settings for NumLock and CapsLock section, look for While the numeric lock or caps lock is ON section, choose the Show the indicator for a few seconds option. 5. Click Apply, then click OK, and click OK to close the window."}, {"url": "http://www.wikihow.com/Disable-the-Capslock-Key-in-Windows", "passage_text": "6. Turn Caps Lock back on. When you want to re-enable the CapsLock key again, open up KeyTweak, select the CapsLock key from the diagram, and click the Restore Default button in the Keyboard Controls section. You will need to restart your computer for the changes to take effect. 1. Physically remove the key. Pry the Caps Lock key from the keyboard. This will leave a hole where the key used to be, but you don't need administrator privileges to do this."}, {"url": "http://answers.microsoft.com/en-us/windows/forum/windows_7-desktop/caps-lock-notification-appears-on-the-screen-when/285a5edf-eb03-4e19-93c3-63e869486180", "passage_text": "Thank You. Go to the Control panel and select Keyboard. Select the Key settings Tab. Scroll down to Caps lock and double click it. Uncheck the box marked Displays CAPS Lock status on screen. It sounds like one of the Accessibility options has been enabled. Open Control Panel / Ease of Access Center. Select the Make the Keyboard easier to use item. Remove the check marks from Turn on Toggle Keys and Turn on Toggle Keys by holding down the NUM LOCK key for 5 seconds. Click Apply/OK. Hope this helps"}, {"url": "http://www.forum.thinkpads.com/viewtopic.php?t=92631", "passage_text": "2. Double-click on Display icon, then click on Settings tab. 3. Click on the Advanced button, then click on On-Screen Display tab. 4. Under Indicator settings for NumLock and CapsLock section, look for While the numeric lock or caps lock is ON section, choose the Show the indicator for a few seconds option. 5. Click Apply, then click OK, and click OK to close the window."}, {"url": "https://dakocode.wordpress.com/2013/06/17/removing-caps-lock-indicator-on-screen-in-lenovo-notebook/", "passage_text": "Choose On Screen Display tab. In the “While the numeric lock or the caps lock is ON:” selection, choose “Show the indicator for a few seconds.” and then click “OK” button. Then caps lock indicator will be shown for a few seconds before it disappears. 8 thoughts on “ Removing Caps Lock Indicator On Screen In Lenovo Notebook ”. In the “While the numeric lock or the caps lock is ON:” selection, choose “Show the indicator for a few seconds.” and then click “OK” button."}]