[{"url": "http://chinesefood.about.com/od/shrimprecipes/r/shrimptoast.htm", "passage_text": "6. To deep-fry the shrimp toast: Heat oil in a wok or other deep-frying utensil to 350 degrees Fahrenheit (approximately 175 degrees Celsius). (To test the oil, drop a small piece of dried bread into the oil – it should rise up and start bubbling). 7. This is the popular dim sum appetizer, with a shrimp mixture spread on slices of toast and deep-fried. To add something extra to the taste and appearance, feel free to use a good crusty bread such as a French baguette."}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/shrimp-toast-recipe2.html#!", "passage_text": "Spread 1/4 cup of the shrimp mixture onto each slice of bread, spreading to the edges and smoothing the top. Heat the vegetable oil to 360 degrees F in large deep skillet. Add the shrimp toast in batches, coated sides down, and fry until golden on the first side, 2 to 2 1/2 minutes. Turn and cook until golden on the second side, about 1 1/2 minutes. Drain on paper towels. To serve, cut each toast diagonally into quarters. Directions. Combine the shrimp, egg, egg white, green onions, parsley, garlic, salt, and white pepper in a food processor and process until blended but still slightly chunky. Add the cream cheese and pulse until smooth and thick."}, {"url": "http://www.food.com/recipe/shrimp-toast-110022", "passage_text": "1 Remove crusts from the bread. 2  Using a food processor, blend shrimp, soy sauce, garlic, sesame oil and egg until a smooth paste has formed. 3  Spread paste evenly on top of bread. 4  Sprinkle bread with sesame seeds and press them into spread. 5  Cut bread from corner to corner twice, to form small triangles. 1 Using a food processor, blend shrimp, soy sauce, garlic, sesame oil and egg until a smooth paste has formed. 2  Spread paste evenly on top of bread. 3  Sprinkle bread with sesame seeds and press them into spread. 4"}, {"url": "http://norecipes.com/shrimp-toast-recipe", "passage_text": "Add the toasts, shrimp side down. When the edges of the bread start to brown, flip the toasts over and fry the bread side until it is golden brown. Transfer to a paper towel lined rack with the bread side facing the paper towel to drain as much oil as possible. Serve with the Sweet Thai Chili Sauce for dipping. Spread about a teaspoon of the shrimp mixture on each piece of bread. Make sure to get the shrimp all the way to the edges or the bread will curl while frying. Press a small piece of parsley into each toast for color. Add about 2 inches of oil to a heavy bottomed pot and heat to 350 degrees F."}, {"url": "http://chinesefood.about.com/od/shrimprecipes/r/shrimptoast.htm", "passage_text": "Carefully add 1 or 2 pieces of shrimp toast into the oil, shrimp side down. The bread should float on top of the oil and begin bubbling immediately. Cook for about 1 1/2 minutes, then turn over and cook for about 15 more seconds. Remove the shrimp toast with a slotted toast and drain on paper towels. This is the popular dim sum appetizer, with a shrimp mixture spread on slices of toast and deep-fried. To add something extra to the taste and appearance, feel free to use a good crusty bread such as a French baguette."}, {"url": "http://www.seriouseats.com/recipes/2011/04/shrimp-toast-appetizers-recipe.html", "passage_text": "Carefully transfer half of toasts to the oil, shrimp side-down. Cook until golden brown, about 2 minutes, adjusting flame as necessary to maintain heat, then carefully flip toast and cook until second side is golden brown, about 1 minute longer. "}, {"url": "https://en.wikipedia.org/wiki/Shrimp_toast", "passage_text": "Shrimp toast or prawn toast is a Chinese dim sum dish. It is made from small triangles of bread, brushed with egg and coated with minced shrimp and water chestnuts, then cooked by baking or deep frying. It is a common appetizer in Australian and American Chinese cuisine. In Japanese, shrimp toast is known as Hatoshi (Japanese: ハトシ), a loan word from Cantonese. Many Chinese restaurants and shops in Nagasaki's Chinatown still serve this dish. Some also serve a variant made with pork."}, {"url": "http://www.food.com/recipe/shrimp-toast-110022", "passage_text": "Directions. 1  Remove crusts from the bread. 2  Using a food processor, blend shrimp, soy sauce, garlic, sesame oil and egg until a smooth paste has formed. 3  Spread paste evenly on top of bread. 4  Sprinkle bread with sesame seeds and press them into spread. 5  Cut bread from corner to corner twice, to form small triangles. 1 Using a food processor, blend shrimp, soy sauce, garlic, sesame oil and egg until a smooth paste has formed. 2  Spread paste evenly on top of bread. 3  Sprinkle bread with sesame seeds and press them into spread. 4"}, {"url": "http://www.marthastewart.com/318323/shrimp-toast", "passage_text": "Directions. In the bowl of a food processor, combine the shrimp, onion, ginger, 1/2 teaspoon salt, and pepper. Process until mixture is finely chopped. With the motor running, add the egg whites through the feed tube, and process until well combined. Place the breadcrumbs in a small bowl. "}, {"url": "http://norecipes.com/shrimp-toast-recipe", "passage_text": "Originally a Chinese appetizer called Hatosi (蝦多士) or shrimp toast, this is a simplified version that makes for a great party canape. Canapé aside from a little cutting and, spreading’they re simple to prepare and are a tasty finger food that goes well with, beer wine or. champagne Spread about a teaspoon of the shrimp mixture on each piece of bread. Make sure to get the shrimp all the way to the edges or the bread will curl while frying. Press a small piece of parsley into each toast for color. Add about 2 inches of oil to a heavy bottomed pot and heat to 350 degrees F."}]