[{"url": "https://www.expatistan.com/price/big-mac/new-york-city", "passage_text": "The price of Combo meal in fast food restaurant (Big Mac Meal or similar) in New York City is $8. Change the currency to. € (EUR) , $ (USD) , £ (GBP) , AU$ (AUD) , or. This average is based on 47 price points. 1 The price of 1 summer dress in a chain store (Zara, H&M, ...) in New York City is $44. 2  The price of Microwave, known brand, 800/900 Watt in New York City is $140. 3  The price of Hair shampoo 2-in-1 (400 ml ~ 12 oz.) in New York City is $7."}, {"url": "https://smartasset.com/mortgage/what-is-the-cost-of-living-in-new-york-city", "passage_text": "The average price of admission to a movie in New York is $14.00, well above the national average ticket price of $10.00, and a round of bowling is at least twice as expensive in New York as in the rest of the country. If you’re okay giving up your car, New York’s public transportation system is one of the best in the country—and one of the most expensive. A monthly transit pass in New York costs $116.50 per month, about 75% greater than the national average."}, {"url": "http://www.nydailynews.com/new-york/nyc-tops-new-living-expenses-article-1.1390134", "passage_text": "Marshall County has the lowest cost of modest living for a family of four in the U.S., according to a new study by the Economic Policy Institute. The average monthly rent in the small city of 7,900 people is about $500 a month, and spacious houses can be snapped up for less than $100,000. As for housing, families in places like New York and San Francisco fork over as much as 25% of the budget for shelter — while the eight lowest-cost areas for a family of four are all counties in Mississippi. In Holly Springs — the seat of Marshall County — $48,000 can have you living high on the hog."}, {"url": "https://smartasset.com/mortgage/what-is-the-cost-of-living-in-new-york-city", "passage_text": "In addition to parking, the price of gas in New York is often 5-10% higher than the national average, and insurance can also be pricey. According to carinsurance.com, the average insurance rate for drivers in Manhattan tops $4,000 per year. If you’re okay giving up your car, New York’s public transportation system is one of the best in the country—and one of the most expensive. A monthly transit pass in New York costs $116.50 per month, about 75% greater than the national average."}, {"url": "http://www.nydailynews.com/new-york/nyc-tops-new-living-expenses-article-1.1390134", "passage_text": "The only price the two places draw close to is a slice of pizza: it’s $1.59 in Holly Springs versus an average $2.25 in Manhattan. As expected, the cities with the highest total living expenses were New York, Washington, D.C. ($88,600), Boston ($85,600) and San Francisco ($84,100). The median cost of modest living was $63,000 for a family of four living in Newaygo County, Mich., EPI said. As for housing, families in places like New York and San Francisco fork over as much as 25% of the budget for shelter — while the eight lowest-cost areas for a family of four are all counties in Mississippi. In Holly Springs — the seat of Marshall County — $48,000 can have you living high on the hog."}, {"url": "http://money.cnn.com/2005/12/22/pf/meals_averagecost/", "passage_text": "New York takes the No. 1 spot in the United States. An average meal in Gotham costs $37.61, while your tab for a meal at the most expensive restaurants will average $112.49. In Tokyo, expect to pay an average of $70.64 for dinner out, and $181.08 for a meal at a top restaurant. In London, an average meal out will run you $67.69. But you'll enjoy a relative bargain for those high-end meals compared with Tokyo diners because you'll only need to fork over an average of $142.40."}, {"url": "https://www.zagat.com/b/new-york-city/48.56-what-can-you-get-for-nycs-average-meal-cost", "passage_text": "$48.56. That’s the average price that New York surveyors report spending on dinner in the Big Apple, per person. That’s $8.03 more than the national average of $40.53 - and with New Yorkers going out for an average of 2.7 dinners a week, that adds up to about $131 per week and over $500 per month."}, {"url": "https://smartasset.com/mortgage/what-is-the-cost-of-living-in-new-york-city", "passage_text": "Eating out in the Big Apple is even less affordable. A meal at an inexpensive restaurant in New York costs $15, and a meal for two at a moderately expensive restaurant costs $75. Those prices are 50% and 67% higher the national averages, respectively. Your best bet may be to eat at one of the city’s many food trucks, although even those can be expensive. If you’re okay giving up your car, New York’s public transportation system is one of the best in the country—and one of the most expensive. A monthly transit pass in New York costs $116.50 per month, about 75% greater than the national average."}, {"url": "http://money.cnn.com/2005/12/22/pf/meals_averagecost/", "passage_text": "The survey also measured the average meal cost at the 20 priciest restaurants in each city. New York takes the No. 1 spot in the United States. An average meal in Gotham costs $37.61, while your tab for a meal at the most expensive restaurants will average $112.49. San Francisco, at No. 2, isn't far behind. An average meal there costs $35.52, but you get a much better deal at the top spots relative to New York, since swank meals in the Bay Area average a mere $85.27. In Tokyo, expect to pay an average of $70.64 for dinner out, and $181.08 for a meal at a top restaurant. In London, an average meal out will run you $67.69. But you'll enjoy a relative bargain for those high-end meals compared with Tokyo diners because you'll only need to fork over an average of $142.40."}]