[{"url": "http://www.braai.co.za/blog/generalbraai/what-is-a-braai/", "passage_text": "The “Bring & Braai”. Similar to a potluck party, this is a grand social event (but still casual and laid-back) where family and friends converge on a picnic spot or someone’s home (normally the garden or verandah) with their own meat, salad, or side dish in hand. Meats are the star of the South African braai."}, {"url": "http://www.wisegeek.com/what-is-braai.htm", "passage_text": "10 hilariously insightful foreign words. Braai is the South African word for barbecue, plural braaie, and refers to a meal cooked over an open fire, usually outdoors. Originally it was derived from an Afrikaans word, braaivleis, meaning grilled meat, but it is now a universally used term in South Africa."}, {"url": "https://thebraaiman.com/braai-news/", "passage_text": "To South Africans the Braai is as important an implement in the household as an oven is to us Brits. Simply put, a Braai is a wood or charcoal fuelled barbecue, but more than that it is an incredibly versatile and exciting way to cook which provides a great social hub for a gathering or celebration!"}, {"url": "http://www.oxforddictionaries.com/definition/english/braai", "passage_text": "1 Just outside the pub, in Quartz Street, is The Braai & Meat, a small outdoor restaurant, with happy customers tucking into pap and braaied meat. 2  They covered topics such as measures to take when storing food at room temperature, and how to handle and braai meat in open areas to ensure that food is not contaminated."}, {"url": "https://en.wiktionary.org/wiki/braai", "passage_text": "braai ‎(third-person singular simple present braais, present participle braaing or braaiing, simple past and past participle braaied). ( 1 South Africa, chiefly cooking) To grill meat over an open flame."}, {"url": "http://www.braai.co.za/blog/generalbraai/what-is-a-braai/", "passage_text": "If you are a South African, you definitely know the answer to that question. So you probably don’t need to read this. If, as a South African citizen, you don’t know what a braai is, you should not have been given that citizenship in the first place. However, for those of you that don’t know what a braai is, here is Wikipedia’s description of it: “The word braaivleis is Afrikaans for “roasted meat.”."}, {"url": "https://en.wiktionary.org/wiki/braai", "passage_text": "braai ‎(plural braais). ( 1 South Africa) A barbecue (grill) , especially an open outdoor grill built specifically for the purpose of braaing. ( 2 South Africa) A social meeting, including the braaing of meat; a cookout."}]