[{"url": "http://www.definitions.net/definition/shrubbery", "passage_text": "Shrubbery. A shrubbery is a wide border to a garden where shrubs are thickly planted; or a similar larger area with a path winding through it. A shrubbery was a feature of 19th-century gardens in the English manner, with its origins in the gardenesque style of the early part of the century. A shrubbery was a collection of hardy shrubs, quite distinct from a flower garden, which was a cutting garden to supply flowers in the house."}, {"url": "http://www.thefreedictionary.com/shrubbery", "passage_text": "2. shrubbery-a collection of shrubs growing together. botany, flora, vegetation-all the plant life in a particular region or period; Pleistocene vegetation; the flora of southern California; the botany of China. bush, shrub-a low woody perennial plant usually having several major stems."}, {"url": "http://www.definitions.net/definition/shrubbery", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: shrubbery (Noun). A planting of shrubs; a wide border to a garden where shrubs are thickly planted; or a similar larger area with a path winding through it."}, {"url": "http://www.audioenglish.org/dictionary/shrubbery.htm", "passage_text": "Nouns denoting spatial position. Hypernyms (shrubbery is a kind of...): area; country (a particular geographical region of indefinite boundary (usually serving some special purpose or distinguished by its people or culture or geography))."}, {"url": "http://www.merriam-webster.com/dictionary/shrubbery", "passage_text": "Full Definition of SHRUBBERY. : a planting or growth of shrubs. See shrubbery defined for English-language learners. See shrubbery defined for kids. ADVERTISEMENT."}, {"url": "http://www.urbandictionary.com/define.php?term=SHRUBBERY", "passage_text": "shrubberies. An object that is usually small and round-ish, and can consist of one or several various plants; usually fuzzy, short plants or thorns. They are known for their quaintness, delicacy, and outrageous prices. The Knights of Ni regarded this particular plant with great admiration."}, {"url": "http://www.thefreedictionary.com/shrub", "passage_text": "Noun. 1. shrub-a low woody perennial plant usually having several major stems. bush. shrubbery-a collection of shrubs growing together. Catha edulis-a shrub that is cultivated by Arabs for its leaves which are chewed or used to make tea."}]