[{"url": "http://umm.edu/health/medical/altmed/supplement/vitamin-b1-thiamine", "passage_text": "Overview. Vitamin B1, also called thiamine or thiamin, is one of 8 B vitamins. All B vitamins help the body convert food (carbohydrates) into fuel (glucose), which the body uses to produce energy. These B vitamins, often referred to as B complex vitamins, also help the body metabolize fats and protein. The most important use of thiamine is to treat beriberi, which is caused by not getting enough thiamine in your diet. Symptoms include: 1  Swelling, tingling, or burning sensation in the hands and feet. 2  Confusion. 3  Trouble breathing because of fluid in the lungs. 4  Uncontrolled eye movements (nystagmus)."}, {"url": "http://www.livestrong.com/article/408468-signs-symptoms-of-thiamine-deficiency/", "passage_text": "Early symptoms of thiamine deficiency are easy to miss because they are so nonspecific. They can include fatigue, irritability, sleep disturbances and even abdominal discomfort -- all symptoms that can easily describe a host of other conditions and ailments. Conditions known as beriberi and Wernicke-Korsakoff syndrome occur because of thiamine deficiency. Thiamine deficiency is highly avoidable for most, although some are born with a condition known as genetic beriberi in which the body loses its ability to absorb thiamine in foods."}, {"url": "http://www.mayoclinic.org/drugs-supplements/thiamine/background/HRB-20060129", "passage_text": "Severe thiamine deficiency may lead to serious complications involving the nervous system, brain, muscles, heart, and stomach and intestines. Dietary sources of thiamine include beef, brewer's yeast, legumes (beans, lentils), milk, nuts, oats, oranges, pork, rice, seeds, wheat, whole-grain cereals, and yeast. Thiamine was one of the first compounds recognized as a vitamin. Thiamine is involved in many body functions, including nervous system and muscle function, the flow of electrolytes in and out of nerve and muscle cells, digestion, and carbohydrate metabolism."}, {"url": "https://www.sharecare.com/health/vitamins-supplements/symptoms-of-thiamine-deficiency", "passage_text": "Symptoms of thiamine deficiency, or a lack of vitamin B1, include fatigue, irritability, depression and stomach problems. Thiamine deficiency is not common. However, people with Crohn's disease or anorexia, those undergoing kidney dialysis and people with alcoholism are at risk of having low thiamine levels. Thiamin deficiency in alcoholics leads to a disease called Wernicke-Korsakoff syndrome/encephalopathy, which leads to many symptoms and signs which mimick drunkenness. These include double vision, staggering, poor muscle coordination, and mental confusion. Thiamin deficiency can be prevented by eating good food sources."}, {"url": "http://emedicine.medscape.com/article/116930-clinical", "passage_text": "History and Physical Examination. Most patients have no symptoms and signs of thiamine deficiency; therefore, it must be suspected in the appropriate clinical setting. Early symptoms and signs are often nonspecific and vague, such as fatigue"}, {"url": "http://www.healthgrades.com/conditions/thiamine-deficiency", "passage_text": "Thiamine deficiency (beriberi) results when your body does not have enough of the vitamin thiamine. Your body requires thiamine to help it break down different types of sugar. Without enough thiamine, you may experience a variety of symptoms that can be serious. Because many foods are supplemented with thiamine, thiamine deficiency is rare in the United States. However, thiamine deficiency is possible in some people with rare genetic conditions, in people who eat very unbalanced diets, in alcoholics, and in some people with kidney disease. Depending on the level of thiamine deficiency, symptoms can vary greatly."}, {"url": "http://www.healthgrades.com/conditions/thiamine-deficiency--symptoms", "passage_text": "Thiamine deficiency is associated with a wide variety of symptoms, depending on the type of thiamine deficiency. In one type of deficiency, known as wet beriberi, symptoms are similar to those of congestive heart failure. They include difficulty breathing with exercise or exertion or when lying down, and swelling in the legs. In another type of thiamine deficiency, dry beriberi, symptoms include weakness or paralysis of muscles or limbs, changes in thinking, difficulty sensing vibration, and other nervous system symptoms."}, {"url": "http://www.mayoclinic.org/drugs-supplements/thiamine/background/HRB-20060129", "passage_text": "Thiamine is used as part of a treatment for metabolic disorders and thiamine deficiency symptoms, as well as in alcoholics. It has been studied for other uses, but conclusions are lacking at this time. Thiamine was one of the first compounds recognized as a vitamin. Thiamine is involved in many body functions, including nervous system and muscle function, the flow of electrolytes in and out of nerve and muscle cells, digestion, and carbohydrate metabolism."}, {"url": "http://www.healthgrades.com/conditions/thiamine-deficiency", "passage_text": "There are two primary types of thiamine deficiency: wet beriberi and dry beriberi. Wet beriberi includes symptoms somewhat like those of congestive heart failure (heart failure is a deterioration of the heart’s ability to pump blood), including difficulty breathing and lower leg swelling. However, thiamine deficiency is possible in some people with rare genetic conditions, in people who eat very unbalanced diets, in alcoholics, and in some people with kidney disease. Depending on the level of thiamine deficiency, symptoms can vary greatly."}]