[{"url": "http://www.sportingintelligence.com/2011/10/30/revealed-official-english-football-wage-figures-for-the-past-25-years-301002/", "passage_text": "According to the PFA document, the average annual basic salary in the Championship in 2009-10 was £211,068, in League One it was £73,320 and in League Two it was £38,844. Those in the Championship earn only 14 times as much as their counterparts. In League One the figure is six and a half times as much. In League Two the figure is 4.6 times as much. The average working man earns about three"}, {"url": "http://www.onaverage.co.uk/money-averages/average-premier-league-salary", "passage_text": "The difference in salary between the Premier League and lower leagues is very big. In the Championship the average salary is between £4.000 and £5.000 a week. But how much does the average Premier League football player earn? According to the PFA (Professional Footballers’ Association) the average salary of a Premier League football player is between £25.000 and £30.000 per week. This average is high partially due to that some of the top players earn up to £250.000!"}, {"url": "http://www.dailymail.co.uk/sport/football/article-2055140/Premier-League-wages-FIVE-times-Championship.html", "passage_text": "1 Average Championship earnings are £4,059 a week (£211,068 a year), less than a fifth of players one division above. 2  In the bottom division, League Two, their weekly pay of £747 is not much more than the national average. 3  League Two earnings are also 30 times smaller than those in the Premier League. The new figures show that: 1  Average Premier League wages have reached £22,353 a week-before lucrative bonuses-or £1.16million a year. 2  Average Championship earnings are £4,059 a week (£211,068 a year), less than a fifth of players one division above."}, {"url": "http://www.telegraph.co.uk/sport/football/competitions/premier-league/11231076/Average-Premier-League-salary-rockets-to-2.3m-as-clubs-TV-windfall-goes-straight-into-players-pockets.html", "passage_text": "Follow. Comments. The average annual salary of Premier League footballers has broken through the £2m barrier for the first time, a new survey has revealed. Premier League players earned an average of £2.3m-or £43,000-a-week-during the 2013-14 season, a huge jump from the average of £1.6m the season before. The figure is comfortably the highest of any any league in the world, the next highest being the £1.5m average in Germany's Bundesliga. The survey, compiled by the Daily Mail, says that the average player in the Championship earns just under £10,000-week, making it the eighth best-paying league in world football."}, {"url": "http://soccerlens.com/english-football-wages/83769/", "passage_text": "1 The average annual basic salary in the Championship in 2009-10 was £211,068, in League One it was £73,320 and in League Two it was £38,844. 2  Top division footballers now earn 46 times as much as they did in 1984-85. 3  Those in the Championship earn only 14 times as much as their counterparts. 1 In 1984-85, according to the PFA’s data, the average basic wage in the First Division – as the top division was then called – was £24,934 a year, or about two and a half times the average working man’s salary. 2  With bonuses, it would have been around £36,000, perhaps more."}, {"url": "http://www.dailymail.co.uk/sport/football/article-2833020/Premier-League-wages-dwarf-Europe-flight-players-England-earning-average-2-3million-year.html", "passage_text": "The average annual player wage in Croatia of £45,500 is roughly the same as the average weekly wage in the Premier League. In South Africa the average annual pay is £33,659 a year and in Nigeria, where domestic football has been in crisis, it is just £6,776 a year, or £130 a week. Players in England's Championship are next, earning £486,000 on average, a staggering sum for a second tier-and higher than most top divisions around the world."}, {"url": "http://soccerlens.com/finance-in-english-football-wage-disparities-between-the-divisions/92692/", "passage_text": "Lower Leagues Finances. Figures show that the increase in television revenues has also benefited players in the lower leagues. The average salary for a Championship player is £250,000, while League One and League Two players can expect to bring in £80,000 and £65,000 a year respectively. However the difference between these divisions and the top-flight are still huge. As the money involved in football increases, so does each individual player’s salary. According to a study, a player at one of the top-flight teams in England earns £1.5 million a year. This compares to the £646,000 of six seasons ago."}, {"url": "http://soccerlens.com/finance-in-english-football-wage-disparities-between-the-divisions/92692/", "passage_text": "1 Average Championship earnings are £4,059 a week (£211,068 a year), less than a fifth of players one division above. 2  In the bottom division, League Two, their weekly pay of £747 is not much more than the national average. 3  League Two earnings are also 30 times smaller than those in the Premier League. As the money involved in football increases, so does each individual player’s salary. According to a study, a player at one of the top-flight teams in England earns £1.5 million a year. This compares to the £646,000 of six seasons ago."}]