[{"url": "http://fescue.com/info/whentoplant.html", "passage_text": "Cool season grass such as Fescue, germinate best when the soil temperatures are between 50&deg and 65&deg degrees F. These soil temperatures usually occur when the daytime air temperatures are between 60&deg and 75&deg degrees."}, {"url": "http://homeguides.sfgate.com/warm-must-plant-lawn-grass-seed-67816.html", "passage_text": "Usually planted in the early fall, cool-season grass seeds prefer daytime temperatures ranging from 60 to 75 F. With this temperature range, the soil itself is usually between 50 and 65 F -- the right environment for germination."}, {"url": "http://www.gardenguides.com/128827-temperature-rye-grass-seed.html", "passage_text": "Submit. Rye grass seed sprouts in soil temperatures of 50 to 65 degrees Fahrenheit and air temperatures 10 degrees higher. Cool-season grasses, both annual and perennial rye grasses perform best in spring and fall and deteriorate in the summer heat. Keywords: rye grass temperatures, ryegrass best temperature, rye grass seed."}, {"url": "http://grassing.com/info/best-time-to-plant-grass-seed.html", "passage_text": "Cool season grass germinates best when the soil temperatures are between 50 and 65 degrees F. These temperatures usually occur when the daytime air temperatures are between 60 and 75 degrees. High temperatures of summer can cause these plants to go dormant and thus planting during summer is asking for problems."}, {"url": "http://www.seedland.com/tips1.html", "passage_text": "PLANT WHEN DAYTIME TEMPERATURES ARE BETWEEN 60 & 75 DEGREES: Cool season grasses grow best when the soil temperatures are between 50 and 65 degrees F. These temperatures usually occur when the daytime air temperatures are between 60 and 75 degrees. High temperatures of summer can cause these plants to go dormant and thus planting during summer is asking for problems."}, {"url": "http://www.ehow.com/way_5762636_temperature-planting-grass-seed.html", "passage_text": "Grass seed germinates when the soil temperature is 65 degrees and above. It's important to understand that it is the soil temperature, and not the surrounding air temperature, that is the trigger for seed germination."}, {"url": "http://www.scotts.com/smg/goART2/InfoHowTo/the-questions-people-ask-most-about-grass-seed/18700002///", "passage_text": "The answer depends on the type of grass you're planting. Cool-season grasses grow best when temperatures are between 60-80 degrees. Early fall is the best time to seed because of its shorter days, cooler nights, and heavier dews."}]