[{"url": "http://www.answers.com/Q/How_fast_does_the_earth_spin_on_its_axis", "passage_text": "The earth spins around at the equator at a speed of roughly 900 miles per hour. 360degrees/24hours x 60 miles/degree = 900 Miles /hour. Also, with a circumference of 24,000 … miles covered in 24 hours yields 1,000 miles per hour. 8 people found this useful. The circumference of the Earth is about 25,000 miles, and it rotates once about every 24 hours. Therefore, your answer would be about 25000 miles per 24 hours, which would be … about 1"}, {"url": "http://www.scientificamerican.com/article/how-fast-is-the-earth-mov/", "passage_text": "The earth rotates once every 23 hours, 56 minutes and 4.09053 seconds, called the sidereal period, and its circumference is roughly 40,075 kilometers. Thus, the surface of the earth at the equator moves at a speed of 460 meters per second--or roughly 1,000 miles per hour. "}, {"url": "http://geography.about.com/od/learnabouttheearth/a/earthspeed.htm", "passage_text": "In addition to the rotational speed of the Earth spinning on its axis, the Earth is also speeding at about 66,660 miles per hour (107278.87 km/h) in its revolution around the sun once ever 365.2425 days. The Earth rotates on its axis once each day. Since the circumference of the Earth at the Equator is 24,901.55 miles, a spot on the Equator rotates at approximately 1037.5646 miles per hour (1037.5646 times 24 equals 24,901.55) (1669.8 km/h)."}, {"url": "http://www.dailymail.co.uk/sciencetech/article-2546864/How-fast-YOU-spinning-Earths-axis.html", "passage_text": "An object on the Earth's equator travels once around the Earth's circumference. This is about 24,901 miles (40,075 kilometres) per day. To calculate speed, Mr Kadish divided that distance by 23hr, 56m, 4s to reach the figure of 1,040 mph. "}, {"url": "http://image.gsfc.nasa.gov/poetry/ask/a10840.html", "passage_text": "At the equator, the circumference of the Earth is 40,070 kilometers, and the day is 24 hours long so the speed is 1670 kilometers/hour (1037 miles/hr). This decreases by the cosine of your latitude so that at a latitude of 45 degrees, cos(45) = .707 and the speed is .707 x 1670 = 1180 kilometers/hr. "}, {"url": "http://www.answers.com/Q/How_fast_is_the_earth_is_spinning", "passage_text": "-- Earth rotates on its axis at a rate of 15 degrees per hour -- Earth rotates 360 degrees in 24 hours -- The Earth rotates on its axis exactly once per day. If you are interested in knowing what this means in terms of miles per hour, that depends where on the globe you are measuring the speed of rotation. -- The circumference of the earth at the equator is approximately 25,000 miles and it takes 24 hours for a full rotation. Therefore a point on the equator is spinning at a … t just over 1000 miles per hour."}, {"url": "http://www.answers.com/Q/How_fast_is_the_earth_is_spinning", "passage_text": "The earth spins around at the equator at a speed of roughly 900 miles per hour. 360degrees/24hours x 60 miles/degree = 900 Miles /hour. Also, with a circumference of 24,000 … miles covered in 24 hours yields 1,000 miles per hour. -- The circumference of the earth at the equator is approximately 25,000 miles and it takes 24 hours for a full rotation. Therefore a point on the equator is spinning at a … t just over 1"}, {"url": "http://earthsky.org/earth/why-cant-we-feel-earths-spin", "passage_text": "We can’t feel Earth’s rotation or spin because we’re all moving with it, at the same constant speed. Earth spins on its axis once in every 24-hour day. At Earth’s equator, the speed of Earth’s spin is about 1,000 miles per hour (1,600 kph). The day-night has carried you around in a grand circle under the stars every day of your life, and yet you don’t feel Earth spinning"}, {"url": "https://en.wikipedia.org/wiki/Earth%27s_rotation", "passage_text": "The South Pole is the other point where the Earth's axis of rotation intersects its surface, in Antarctica. The Earth rotates once in about 24 hours with respect to the sun and once every 23 hours 56 minutes and 4 seconds with respect to the stars (see below). Earth's rotation is slowing slightly with time; thus, a day was shorter in the past"}]