[{"url": "https://en.wikipedia.org/wiki/Cornus_florida", "passage_text": "Cornus florida inflorescence, showing four large white bracts and central flower cluster. Flowering dogwood is a small deciduous tree growing to 10 m (33 ft) high, often wider than it is tall when mature, with a trunk diameter of up to 30 cm (1 ft). A 10-year-old tree will stand about 5 m (16 ft) tall. The flowering dogwood is usually included in the dogwood genus Cornus as Cornus florida L., although it is sometimes treated in a separate genus as Benthamidia florida (L.) Spach."}, {"url": "http://hort.ufl.edu/database/documents/pdf/tree_fact_sheets/corfloa.pdf", "passage_text": "Fact Sheet ST-185November 1993 Cornus florida Figure 1. Middle-aged Flowering Dogwood. Flowering Dogwood 1Edward F. Gilman and Dennis G. Watson 2 INTRODUCTION The state tree of Virginia, Flowering Dogwoodgrows 20 to 35 feet tall and spreads 25 to 30 feet (Fig.1). "}, {"url": "http://plants.wedels.com/12120009/Plant/3455", "passage_text": "Cherokee Brave Flowering Dogwood will grow to be about 30 feet tall at maturity, with a spread of 35 feet. It has a low canopy with a typical clearance of 4 feet from the ground, and should not be planted underneath power lines. Cherokee Brave Flowering Dogwood features showy clusters of crimson flowers with white centers held atop the branches in mid spring. It has forest green foliage which emerges burgundy in spring. The pointy leaves turn an outstanding brick red in the fall."}, {"url": "http://plants.oaklandnursery.com/12130001/Plant/3455/Cherokee_Brave_Flowering_Dogwood", "passage_text": "Cherokee Brave Flowering Dogwood will grow to be about 30 feet tall at maturity, with a spread of 35 feet. It has a low canopy with a typical clearance of 4 feet from the ground, and should not be planted underneath power lines. It grows at a slow rate, and under ideal conditions can be expected to live for approximately 30 years. This tree does best in full sun to partial shade. Cherokee Brave Flowering Dogwood features showy clusters of crimson flowers with white centers held atop the branches in mid spring. It has forest green foliage which emerges burgundy in spring. The pointy leaves turn an outstanding brick red in the fall."}, {"url": "http://parkseed.com/cherokee-brave-dogwood/p/v1674/", "passage_text": "Growing to 15 feet high and 15 to 20 feet wide, Cherokee Brave™ has a rounded, naturally symmetrical shape that creates a fine canopy of shade in the garden. It thrives in full sun in cooler climates, preferring a bit of shade in warmer areas, and serves as an understory tree in hot climates. Even before the tree leafs out in spring, giant deep pink blooms (actually bracts) starred with a white eye cover its branches, each 3 to 4 inches wide and very showy. They last for many weeks, and are followed by bright red fruit that birds adore."}, {"url": "https://myfolia.com/plants/1008-flowering-dogwood-cornus-florida/varieties/98801-cherokee-brave", "passage_text": "'Cherokee Brave' is a Flowering dogwood variety in the Cornus genus with a scientific name of Cornus florida. It grows mainly as a Deciduous, so it will tend to lose its leaves annually. Normally grows with a tree-like habit. Cherokee Brave Flowering dogwood needs a moderate amount of maintenance, so some level of previous experience comes in handy when growing this plant. Ensure that you are aware of the soil, sun, ph and water requirements for this plant and keep an eye out for pests"}, {"url": "http://www.clemson.edu/extension/hgic/plants/landscape/trees/hgic1010.html", "passage_text": "The height ranges from 15 to 20 feet tall (flowering dogwood in the sun) to 40 feet tall (flowering dogwood in the shade). The spread may be even greater than the height. Growth Rate: Dogwoods grow at a slow to moderate rate (about 20 feet in 25 years). Flowering Dogwood (C. florida). Mature Height/Spread: The flowering dogwood will grow 40 feet tall when grown as an understory tree in a woodland setting. In the sun, the same tree may only grow 15 to 20 feet tall and wide. Spread can be greater than height at maturity. It can be grown as a single or multi-trunk tree."}]