[{"url": "http://ramsni.com/information_links/Circulatory%20Disorders/Circulatory%20Disorders%20info.html", "passage_text": "The circulatory system is the body’s blood transport system. A circulatory disorder is any disorder or condition that affects the circulatory system. Circulatory disorders can arise from problems with the heart, blood vessels or the blood itself. Disorders of the circulatory system generally result in diminished flow of blood and oxygen supply to the tissues."}, {"url": "http://www.medicinenet.com/vascular_disease/article.htm", "passage_text": "Vascular disease includes any condition that affects the circulatory system. As the heart beats, it pumps blood through a system of blood vessels called the circulatory system. The vessels are elastic tubes that carry blood to every part of the body. Arteries carry blood away from the heart while veins return it. "}, {"url": "http://www.livestrong.com/article/111570-diseases-disorders-circulatory-system/", "passage_text": "The circulatory system, or cardiovascular system, is made up of the heart, veins, arteries and capillaries. This system is responsible for carrying oxygen and nutrients to all parts of the body. Heart disease and other circulatory problems are major sources of disability and death. "}, {"url": "http://www.webmd.com/heart-disease/peripheral-vascular-disease?print=true", "passage_text": "Peripheral Vascular Disease Overview. Peripheral vascular disease, also called PVD, refers to any disease or disorder of the circulatory system outside of the brain and heart. The term can include any disorder that affects any blood vessels. It is, though, often used as a synonym for peripheral artery disease. PVD is the most common disease of the arteries. "}, {"url": "http://www.livescience.com/22486-circulatory-system.html", "passage_text": "The systemic circulation is the portion of the circulatory system is the network of veins, arteries and blood vessels that transports blood from heart, services the body's cells and then re-enters the heart, the Mayo Clinic noted. View full size image. One of the most common diseases of the circulatory system is arteriosclerosis, in which the fatty deposits in the arteries causes the walls to stiffen and thicken the walls. According to the Mayo Clinic, the causes are a buildup of fat, cholesterol and other material in the artery walls."}, {"url": "http://www.phac-aspc.gc.ca/cd-mc/cvd-mcv/cvd-mcv-eng.php", "passage_text": "Cardiovascular disease is a term that refers to more than one disease of the circulatory system including the heart and blood vessels, whether the blood vessels are affecting the lungs, the brain, kidneys or other parts of the body. Cardiovascular diseases are the leading cause of death in adult Canadian men and women. "}, {"url": "http://www.answers.com/Q/What_diseases_can_damage_the_circulatory_system", "passage_text": "The circulatory system can be damaged by disease or injury. One of the most common diseases of the system is arteriosclerosis, which results from the accumulation of fatty dep … osits in the arteries. Such deposits stiffen and thicken the walls of the arteries. As a result, the flow of blood is restricted. "}, {"url": "http://www.md-health.com/Circulatory-System-Diseases.html", "passage_text": "Heart Disease. Heart disease, or coronary artery disease, occurs when the blood vessels that supply oxygen to the heart narrow and stiffen. Smoking, an unhealthy diet, stress, and a sedentary lifestyle all increase the risk of heart disease. A heart attack or stroke can occur if the condition is untreated. The blood vessels transport blood to and from the heart, the heart pumps oxygenated blood to the body, and the oxygen, gases, and nutrients exchange in the capillaries. Anything that affects the integrity of the tubing can impair the health of the circulatory system."}, {"url": "http://www.livescience.com/22486-circulatory-system.html", "passage_text": "The circulatory system is a vast network of organs and vessels that is responsible for the flow of blood, nutrients, hormones, oxygen and other gases to and from cells. View full size image. One of the most common diseases of the circulatory system is arteriosclerosis, in which the fatty deposits in the arteries causes the walls to stiffen and thicken the walls. According to the Mayo Clinic, the causes are a buildup of fat, cholesterol and other material in the artery walls."}]