[{"url": "http://www.geekinterview.com/question_details/70926", "passage_text": "(3) Encumbrance: Encumbrance balances are the funds reserved for the budgets for future expenses. peterson1975 Profile Answers by peterson1975 Questions by peterson1975 Nov 16th, 2009 A budget is a forecast (estimate) of cost, expenditure or /and revenue for a specified period of time. Simply a budget is a kind of Reserve kept for future purpose expenses for KNOWN expense overheads. Ex: Stationary, Machinery, Computers, Bonuses..etc. etc.. Whereas. Encumbrance is a kind of Reserve kept for future purpose expenses for UNKNOWN expenses or Unexpected Expenses."}, {"url": "http://smallbusiness.chron.com/encumbered-mean-accounting-74964.html", "passage_text": "Basic Definition. An encumbrance is a portion of a budget set aside for spending required by law or contract. Like the budget itself, an encumbrance is a projection and not yet a reality. If business conditions continue as they are when you set the budget, then the encumbrance will become an expense. Conditions, however, may change over the course of a year or over the period set by the budget."}, {"url": "https://en.wikipedia.org/wiki/Encumbrance", "passage_text": "An encumbrance is a right to, interest in, or legal liability on real property that does not prohibit passing title to the property but that diminishes its value. Encumbrances can be classified in several ways. They may be financial (ex: liens) or non-financial (ex: easements, private restrictions). "}, {"url": "http://www.investopedia.com/terms/e/encumbrance.asp", "passage_text": "DEFINITION of 'Encumbrance'. An encumbrance is a claim against a property by a party that is not the owner. An encumbrance can impact the transferability of the property and restrict its free use until the encumbrance is lifted. The most common types of encumbrance apply to real estate; these include mortgages, easements and property tax liens. "}, {"url": "http://docs.oracle.com/cd/A60725_05/html/comnls/us/gl/enccycle.htm", "passage_text": "You have two options for using encumbrance data to monitor over-expenditure of a budget: After actuals and encumbrances have been posted, you can generate reports to show over-expenditures. You can also can use funds checking to prevent over-expenditures before they occur. "}, {"url": "https://technet.microsoft.com/en-us/library/hh335139.aspx", "passage_text": "The Encumbrance and ledger reconciliation report identifies imbalances between budget reservations for encumbrances and pre-encumbrances, and the corresponding budget register entries that are tracked in the general ledger. "}, {"url": "http://docs.oracle.com/cd/A60725_05/html/comnls/us/gl/contval.htm", "passage_text": "Including Budgets, Encumbrances, and Currencies in an FSG Report. When you assign a Budget to a control value number, FSG automatically prints the appropriate budget amounts in the budget-related rows or columns that are assigned that control value number. For example, if you assigned the number 1 to a column with the PTD-Budget amount type and the number 3 to a column with the PTD-Encumbrance amount type, you must assign a budget to the control value number 1 and an encumbrance to the control value number 3. This same logic applies to currency types. Notes: 1  You must assign the same budget, encumbrance type, or currency to intersecting row and column control values. 2  You cannot enter currencies in the report definition if the report does not contain a row and/or column set with a currency control value"}, {"url": "https://technet.microsoft.com/en-us/library/hh209307.aspx", "passage_text": "An encumbrance is a reservation of budget funds that are set aside to make sure that actual expenditures do not exceed the available budget. If the encumbrance process is enabled, you can create purchase order encumbrances that are recorded in the general ledger when a purchase order is confirmed. "}]