[{"url": "http://vetmedicine.about.com/od/diseasesandconditions/a/5-Things-To-Know-About-Canine-Parvo.htm", "passage_text": "4) The parvo incubation period is 3 - 7 days, sometimes longer. This is important because during the incubation period, your dog may act and appear normal. Vet visits and pre-purchase exams may reveal no signs of pending illness only to have parvo appear in a few days. The incidence of this disease in adult vaccinated dogs is now thankfully extremely rare. But parvo still kills puppies and non-vaccinated dogs. Here are a few key points about this disease."}, {"url": "http://www.future-of-vaccination.co.uk/canine-parvovirus-disease.asp", "passage_text": "Signs and symptoms. The incubation period of CPV is generally 4-7 days. Individuals normally have severe enteritis, however occasionally, animals may only have mild symptoms. Signs usually consist of depression, severe vomiting, refusal of food and water, abdominal pain and profuse smelly, bloody diarrhoea. Cause of canine parvovirus. The cause of canine parvovirus disease is a highly contagious DNA-containing virus. There are currently two types prevalent in the UK, namely CPV-2a and CPV-2b. The virus is transmitted through the mouth or nose from faeces."}, {"url": "http://www.aspcapro.org/parvo", "passage_text": "Canine Parvovirus (parvo) is a highly contagious viral disease that is one of the most common causes of diarrhea in dogs under 6 months of age. It first appeared in the late 1970s, and is one of the most frequent serious dog disease problems encountered in animal shelters. Parvovirus can be shed in the feces 3-4 days after infection with the virus, which is generally before clinical signs of illness appear. The virus will also be shed in the feces for approximately 10-14 days post-recovery from clinical signs of infection."}, {"url": "https://www.avma.org/public/PetCare/Pages/Canine-Parvovirus-FAQs.aspx", "passage_text": "A: CPV-2c is the most recent variant of canine parvovirus type 2 (CPV-2), the virus that causes parvo enteritis in dogs. There are several variants of CPV-2; all of the variants of CPV-2 are genetically related. CPV-2c differs from CPV-2a and CPV-2b at only one point on the DNA strand. A: CPV-2c causes similar signs as those seen with infection with CPV-2, CPV-2a and CPV-2b. These include loss of appetite, vomiting, diarrhea (which may be bloody), and dehydration. The bloody diarrhea might be mild or absent with any of the variants, but affected dogs are more likely to stop eating."}, {"url": "http://www.peteducation.com/article.cfm?c=2+2102&aid=467", "passage_text": "Canine parvovirus (CPV) disease is currently the most common infectious disorder of dogs in the United States. 'Parvo' is a highly contagious disease characterized by diarrhea that is often bloody. Prior to 1980, most canine parvovirus that caused disease was Type 2 (CPV-2). The normal incubation period (time from exposure to the virus to the time when signs of disease appear) is from 7-14 days. Virus can be found in the feces several days before clinical signs of disease appear, and may last for one to two weeks after the onset of the disease."}, {"url": "http://www.vet.cornell.edu/baker/about/articles/CanineParvovirus.cfm", "passage_text": "The virus that causes the disease known as “parvo”, canine parvovirus type 2 (CPV), first emerged among dogs in Europe around 1976. By 1978 the virus had spread unchecked, causing a worldwide epidemic of myocarditis and inflammation in the intestines (gastroenteritis). Veterinarians usually administer the CPV vaccine as part of a combination shot which includes, among others, the distemper, canine adenovirus, and parainfluenza vaccines. These shots are given every 3 to 4 weeks from the time a puppy is 6 weeks old until he is at least 16 weeks of age."}, {"url": "http://www.aspcapro.org/sites/pro/files/parvo_template.pdf", "passage_text": "Page 3 of 4 CPV Response Isolation Measures and Treatment Response after parvo is diagnosed in one dog: 1. Patients with parvovirus are not to be treated on site as there is no one here overnight 2. Dogs that are owned by the shelter but not strong adoption candidates are immediately euthanized a. Every shelter is unique and SOPs must be developed that are relevant to the particular facility General information: Canine parvovirus is highly contagious, durable in nature, and capable of producing severe or life-threatening disease in dogs."}, {"url": "http://www.vet.cornell.edu/baker/about/articles/CanineParvovirus.cfm", "passage_text": "Once a dog or puppy is infected, there is an incubation period of three to seven days before the onset of first symptoms. Inside the dog, CPV needs the help of rapidly dividing cells in order to successfully cause disease, and the virus usually begins by attacking the tonsils or lymph nodes of the throat. Veterinarians usually administer the CPV vaccine as part of a combination shot which includes, among others, the distemper, canine adenovirus, and parainfluenza vaccines. These shots are given every 3 to 4 weeks from the time a puppy is 6 weeks old until he is at least 16 weeks of age."}, {"url": "http://www.vet.cornell.edu/baker/about/articles/CanineParvovirus.cfm", "passage_text": "Animal health article: canine parvovirus. Canine parvovirus (CPV) is a highly contagious viral disease of dogs that commonly causes acute gastrointestinal illness in puppies. The disease most often strikes in pups between six and 20 weeks old, but older animals are sometimes also affected. Veterinarians usually administer the CPV vaccine as part of a combination shot which includes, among others, the distemper, canine adenovirus, and parainfluenza vaccines. These shots are given every 3 to 4 weeks from the time a puppy is 6 weeks old until he is at least 16 weeks of age."}]