[{"url": "http://www.nydailynews.com/entertainment/movies/simon-pegg-films-secret-role-star-wars-episode-vii-report-claims-article-1.1826998", "passage_text": "Simon Pegg played Scotty in J.J. Abrams' 'Star Trek' reboot films. He also teamed with frequent collaborator Nick Frost to don cardboard droid costumes to film a parody reenactment of a Star Wars scene posted to the Internet in 2011."}, {"url": "http://www.nydailynews.com/entertainment/movies/simon-pegg-films-secret-role-star-wars-episode-vii-report-claims-article-1.1826998", "passage_text": "Director J.J. Abrams, right, reportedly recruited his pal, actor Simon Pegg, for a role in ‘Star Wars: Episode VII.’. He may be a little short for a Stormtrooper, but Simon Pegg is rumored to have made his way into Star Wars: Episode VII anyway. The actor secretly wrapped a scene in Abu Dhabi for Star Trek director J.J. Abrams' foray into the Star Wars universe, a source told IGN Middle East."}, {"url": "http://metro.co.uk/2015/05/15/oops-simon-pegg-accidentally-reveals-daniel-craigs-role-in-star-wars-episode-7-the-force-awakens-5199199/", "passage_text": "Exciting news for Star Wars fans – Daniel Craig will play a Stormtrooper in The Force Awakens. Simon Pegg accidentally let the cat out of the bag to The Sun newspaper about what role the Bond star would be taking in a galaxy far, far away."}, {"url": "http://www.nydailynews.com/entertainment/movies/simon-pegg-films-secret-role-star-wars-episode-vii-report-claims-article-1.1826998", "passage_text": "But the British comedian downplayed the possibility of nabbing a role in Episode VII to the Daily News last summer. If he were to say there's a role in it for you, of course I would immediately be interested because it's J.J.,  Pegg told the News before the release of Star Trek Into Darkness.."}, {"url": "http://www.dailymail.co.uk/tvshowbiz/article-3082870/Simon-Pegg-accidentally-reveals-Daniel-Craig-play-Stormtrooper-Star-Wars-Episode-VII-Force-Awakens.html", "passage_text": "View. comments. Daniel Craig will play a Stormtrooper in 'Star Wars: Episode VII-The Force Awakens'. The 'Skyfall' actor's mystery role in the highly-anticipated blockbuster was accidentally leaked by fellow actor Simon Pegg, who let the secret slip before realising his mistake."}, {"url": "http://www.ew.com/article/2015/08/14/star-wars-force-awakens-simon-pegg", "passage_text": "“You know, I’ve never met Simon Pegg,” Abrams tells EW. But when reminded, it gradually rings a bell: You know … Pegg played Scotty in Abrams’ Star Trek reboots… He was Shaun in Shaun of the Dead … The tech-savvy agent Benji in Abrams’ Mission: Impossible III … Hot Fuzz. The World’s End."}, {"url": "http://www.etonline.com/news/164601_simon_pegg_reveals_daniel_craig_star_wars_role_a_stormtrooper/", "passage_text": "Pegg, 45, accidentally revealed the Skyfall star's role in the highly anticipated film Star Wars: Episode VII -- The Force Awakens. At the London premiere of Man Up, Pegg told The Sun newspaper, I wasn't a stormtrooper. Daniel Craig, he was a stormtrooper.."}]