[{"url": "http://www.usconcealedcarry.net/join-now/", "passage_text": "Every USCCA Membership includes a subscription to the nation’s leading defense publication for self-reliant Americans (that’s over 900 pages per year!).. Inside, you'll discover unbiased handgun, holster, and gear reviews from real people who carry concealed every day. "}, {"url": "http://www.defensivecarry.com/forum/concealed-carry-issues-discussions/11111-uscca-membership-worth-money.html", "passage_text": "This is a discussion on USCCA Membership worth the money? within the Concealed Carry Issues & Discussions forums, part of the Defensive Carry Discussions category; Hey guys, I was considering joining the USCCA and was wondering if any of you are members and whether it was actually worth the money."}, {"url": "https://www.usccainstructors.com/toolkit.asp?id=USCCA_Instructor&sid=get_equipped", "passage_text": "As a bonus, you’ll also be paid 15% of the membership fee for any of your students that upgrade to a USCCA membership! 1  Reduces the effort needed to prepare. 2  for your class with an all-in-one kit. 3  Allows you more time with your family. 4  and less time creating or preparing for your classes because it’s already been done for you. 5  Decreases your 6  .... by "}, {"url": "http://www.christiangunowner.com/uscca-review.html", "passage_text": "In my estimation there is now no reason not to join the USCCA. The full value of the USCCA: 1  The United States Concealed Carry Association is a top, informative organization with excellent, expert writers. 2  It provides archives of valuable and seemingly endless articles. 3  It puts out a top of the line magazine rivaling any gun magazine. 1 The SHIELD includes legal protection if your firearm is reported stolen and used in a crime. 2  The benefits of the SHIELD are for all 50 states. 3  It is not a law firm limited to state licensed practice. 4  That means if you travel, no matter the state you're in, you're protected."}, {"url": "https://www.usconcealedcarry.com/membership/", "passage_text": "If you’re someone who is not afraid to take immediate action, I invite you to join the USCCA right now. Join over 70,000 of your fellow Responsibly Armed Americans in doing exactly what it takes to be the ultimate defender and protector of your loved ones. The funny thing is that none of these “experts” can agree on anything. It’s comforting to know that the USCCA and Concealed Carry Magazine are the “thought leaders” and true pioneers when it comes to educating and training good, honest Americans with exactly what they need to defend thei"}, {"url": "https://www.usconcealedcarry.com/membership/", "passage_text": "Liberal judges, overzealous prosecutors and families willing to file a civil suit because you had to defend yourself can drain your bank account overnight. A Platinum USCCA membership will provide you up to $1.1 million in legal defense horsepower for less than $1 per day. It's funny...I know people who spend more than $1 a day on coffee, cigarettes, cable TV—even cell phone service!—but NONE of those things help keep you or your family safe. The funny thing is that none of these “experts” can agree on anything. It’s comforting to know that the USCCA and Concealed Carry Magazine are the “thought leaders” and true pioneers when it comes to educating and training good, honest Americans with exactly what they need to defend their loved ones."}, {"url": "http://www.defensivecarry.com/forum/concealed-carry-issues-discussions/11111-uscca-membership-worth-money.html", "passage_text": "I am a member of USCCA and I do believe that it is worth the cost. I have never had the opportunity to be on the ground floor of an organization that supports what I believe. It may be a little expensive, but what startup isn't. There have been some ideas that didn't work out, again who hasn't had those. Hey guys, I was considering joining the USCCA and was wondering if any of you are members and whether it was actually worth the money."}, {"url": "http://www.christiangunowner.com/uscca-review.html", "passage_text": "1 The USCCA Facebook page is valuable, informative and fun. 2  The organization has achieved a reputation that allows it to offer excellent periodic resources with special member price values. 3  The membership is now an excellent value at any level. 1 The SHIELD includes legal protection if your firearm is reported stolen and used in a crime. 2  The benefits of the SHIELD are for all 50 states. 3  It is not a law firm limited to state licensed practice. 4  That means if you travel, no matter the state you're in, you're protected."}, {"url": "http://www.usconcealedcarry.net/about-us/", "passage_text": "“The one thing I value most from USCCA membership is the “member’s area” on the website. It goes above and beyond the “public area” in gear, tactics and all other articles or explanations.”. "}, {"url": "https://www.usconcealedcarry.com/worth/", "passage_text": "Of course, one car got there first. Now, I’ve seen too many such situations explode into violence. So, if I were in the other car, I would have simply looked for the next open pump. It’s just not worth it. However, in this case, driver number two just had to let that other guy know how miffed he was. And when I saw him getting out of his car and heading for the driver’s side of the “offending” vehicle, I became concerned. Email *. Website. Signup for the Weekly Concealed Carry Report. Your email address will not be published. Required fields are marked * . All comments will be reviewed by the Delta Defense team before posting. If your comment is in poor taste, or contains profanity or racial slurs, it will not be posted."}]