[{"url": "http://navienreview.com/index.php/component/content/article/8-navien-tankless-water-heater-nr240a/58-what-temperature-should-i-set-my-tankless-water-heater-at", "passage_text": "Answer to 1: The amount of gas consumed to set the temperature of your tankless water heater higher is negligible. Unlike a tank water heater, your tankless heater does not consume gas when water is not in demand. "}, {"url": "http://www.thesimpledollar.com/turn-down-your-water-heater-155365/", "passage_text": "The Department of Energy recommends having your tank-based hot water heater set to 120 degrees Fahrenheit for most people, but if you’ve never adjusted the temperature on your hot water heater, it’s probably set to 140 degrees, which is the default setting from most manufacturers. Annual energy costs for a hot water heater vary from $100 to $200, so this simple change could save you anywhere from $6 to $20 per year. It also keeps you from getting scalded if you accidentally turn up the hot water too much."}, {"url": "http://energy.gov/energysaver/projects/savings-project-lower-water-heating-temperature", "passage_text": "Although some manufacturers set water heater thermostats at 140ºF, most households usually only require them to be set at 120ºF, which also slows mineral buildup and corrosion in your water heater and pipes. Water heated at 140ºF also poses a safety hazard—scalding. 2.) Mark the setting, then turn down the thermostat. Mark the beginning temperature on your water heater thermostat with a marker, and then turn the thermostat down."}, {"url": "http://removeandreplace.com/2014/02/19/what-temperature-should-my-water-heater-be-set-at/", "passage_text": "Before you adjust the temperature on your water heater: Read your water heater owner’s manual for instructions on how to operate the thermostat (whether Gas or Electric). FOR GAS WATER HEATERS: You will find a thermostat dial near the bottom of the tank on the gas valve. Increasing your water heater temperature by just 10ºF from 130ºF to 140ºF may increase heat loss resulting in a larger electric bill from $30 to $75 dollars annually. Setting the temperature to 140ºF can also increase demand losses resulting in an annual expense of up to $500 dollars."}, {"url": "http://removeandreplace.com/2014/02/19/what-temperature-should-my-water-heater-be-set-at/", "passage_text": "Most households can have the temperature set between 120ºF and 130ºF on their water heaters. If you are concerned about energy savings and reducing your monthly energy bill then set your heater temp to 120ºF and see if that is sufficient for your needs. Increasing your water heater temperature by just 10ºF from 130ºF to 140ºF may increase heat loss resulting in a larger electric bill from $30 to $75 dollars annually. Setting the temperature to 140ºF can also increase demand losses resulting in an annual expense of up to $500 dollars."}, {"url": "http://energy.gov/energysaver/projects/savings-project-lower-water-heating-temperature", "passage_text": "Measure the beginning temperature of your hot water using a thermometer at the tap farthest from the water heater. Thermostat dials are often inaccurate. 2.) Mark the setting, then turn down the thermostat. Mark the beginning temperature on your water heater thermostat with a marker, and then turn the thermostat down. 3.) Measure and adjust. Wait a couple of hours, and then measure the water temperature again at the farthest tap from the water heater"}, {"url": "http://www.thesimpledollar.com/turn-down-your-water-heater-155365/", "passage_text": "How much does turning down the temperature save you? Turning down the temperature 10 degrees Fahrenheit on your hot water heater saves 3 to 5 percent on energy costs, so a drop from 140 F to 120 F saves you 6 to 10 percent. Annual energy costs for a hot water heater vary from $100 to $200, so this simple change could save you anywhere from $6 to $20 per year. It also keeps you from getting scalded if you accidentally turn up the hot water too much."}, {"url": "http://www.wisegeek.org/what-are-the-safest-temperature-settings-for-a-hot-water-heater.htm", "passage_text": "Every water heater is preset in America to 120F by the manufactures, but some states like Wisconsin require the water heater temp to be at least 125F. I set mine at 125F, which is the recommended setting for my REEM water heater. Very hot water temperature can cause burns with great rapidity, and as such, care in setting your hot water heater is required. Setting the hot water temperature lower also means a savings in energy bills for heating the home's water in many cases."}, {"url": "http://removeandreplace.com/2014/02/19/what-temperature-should-my-water-heater-be-set-at/", "passage_text": "Whether you have a gas or electric water heater, the default temperature set from the factory will be between 120ºF to 140ºF. It is estimated that the average water heater temperature is set to 130ºF in the United States. Increasing your water heater temperature by just 10ºF from 130ºF to 140ºF may increase heat loss resulting in a larger electric bill from $30 to $75 dollars annually. Setting the temperature to 140ºF can also increase demand losses resulting in an annual expense of up to $500 dollars."}]