[{"url": "http://www.accountingtools.com/questions-and-answers/what-is-the-formula-for-calculating-efficiency.html", "passage_text": "The efficiency equation is a comparison of the work output from an operation to the work input to that same operation. The amount of work could refer to time, effort, capacity, or more tangible items. A high level of efficiency implies a minimal amount of wasted time, effort, capacity, materials, and so forth."}, {"url": "http://www.delcoremy.com/Documents/High-Efficiency-White-Paper.aspx", "passage_text": "With a typical engine efficiency of 40%, a belt efficiency of 98% and an alternator efficiency of 55%, this leads to an overall energy conversion efficiency of only 21%. Assuming a fuel cost of $4.00/gal, this leads to an on-board electrical power cost of $0.51/kWh, or roughly 4 times a typical household utility rate."}, {"url": "http://wikieducator.org/Cost_and_Financing_in_Open_Schooling/Efficiency_and_Effectiveness_of_ODL/Cost-Effectiveness", "passage_text": "The equation for calculating the cost-effectiveness ratio is the same as that for the efficiency ratio, but the average cost per graduate is used in place of the average cost per student. EQUATION for Cost-Effectiveness Ratio."}, {"url": "http://www.accountingtools.com/questions-and-answers/what-is-the-formula-for-calculating-efficiency.html", "passage_text": "This can translate into a high level of profitability in a business. The efficiency formula is: (Work output / Work input) x 100%. The work output in this definition is considered to be the useful amount of work output-that is, all scrap, spoilage, and waste is excluded from the numerator. The efficiency formula can be used in a variety of areas, such as to examine the efficiency of motors and in quantifying energy utilization. The concept has been most thoroughly formalized in cost accounting. For example: 1  Labor efficiency variance."}, {"url": "http://www.unf.edu/~dtanner/dtch/dt_ch5.htm", "passage_text": "The variable cost per unit is plugged into the cost formula as the variable cost (VC). The fixed costs are totaled separately to calculate the Y-intercept (TFC) component of the equation. This results in a cost equation that can be used to estimate costs for future periods."}, {"url": "http://wikieducator.org/Cost_and_Financing_in_Open_Schooling/Efficiency_and_Effectiveness_of_ODL/Cost-Effectiveness", "passage_text": "Cost-effectiveness is that term. Definition. Huelsmann hülsmann defines-cost effectiveness “. . . as the most efficient way to achieve a set (goal, 2004 page).” 22, essentially it expresses a balance between attempts to keep costs to a minimum while maximising the/outcomes outputs of an educational institution or. programme"}]