[{"url": "http://www.investopedia.com/articles/retirement/05/021505.asp", "passage_text": "You must have eligible compensation in order to be eligible to contribute to an IRA. For IRA purposes, eligible compensation includes wages, salaries, tips, commissions received as a percentage of sales, taxable alimony and separate maintenance payment you receive under a decree of divorce or separate maintenance. You may contribute up to $5,500 to your IRA for 2013. If you are at least age 50 by the end of the year to which the contribution applies, you may contribute an additional $1,000. This additional amount is referred to as a catch-up contribution"}, {"url": "http://www.investopedia.com/articles/retirement/05/021505.asp", "passage_text": "Maximum Contribution. You may contribute up to $5,500 to your IRA for 2013. If you are at least age 50 by the end of the year to which the contribution applies, you may contribute an additional $1,000. This additional amount is referred to as a catch-up c"}, {"url": "https://www.wellsfargo.com/investing/retirement/tools/eligibility/", "passage_text": "Annual IRA Contribution Limit. If you’re eligible, you can contribute up to $5,500 in 2014 and 2015, and if you’re age 50 or older, you can contribute up to $6,500 for each year. You can make both a Traditional IRA and a Roth IRA contribution in the same year, but the total amount cannot exceed the annual limit. With a Traditional IRA, you may be able to deduct your contributions on your taxes, which can help lower your tax bill. Your eligibility to deduct is based on your Modified Adjusted Gross Income (MAGI) and whether you or your spouse participates in a retirement plan at work."}, {"url": "http://finance.zacks.com/can-contribute-ira-alimony-5246.html", "passage_text": "Deducting Traditional IRA Contributions. Though you're eligible to contribute to a traditional IRA with your alimony, you might not be able to deduct your contribution if you're covered by a retirement plan at work. You don't necessarily have to participate in the plan -- for example, just being eligible for a defined benefit plan counts. "}, {"url": "https://www.wellsfargo.com/investing/retirement/tools/eligibility/", "passage_text": "Individuals and their spouses, if married filing jointly, with earned income are eligible to contribute to a Roth IRA as long as their MAGI meets the following limits: 1  Maximum Roth IRA contribution for 2014: Full contribution if MAGI is less than $114,000 (single) or $181,000 (joint). With a Traditional IRA, you may be able to deduct your contributions on your taxes, which can help lower your tax bill. Your eligibility to deduct is based on your Modified Adjusted Gross Income (MAGI) and whether you or your spouse participates in a retirement plan at work."}, {"url": "http://www.forbes.com/sites/advisor/2011/05/31/4-ways-to-make-ira-contributions-without-a-job/", "passage_text": "1 If you receive alimony, it is taxable as ordinary income, which is eligible for an IRA contribution. 2  Scholarships and Fellowships – if these are taxable, that is, reported in box 1 of a W2 form, they’re eligible for contribution to an IRA. 3  Spousal contribution. 1 If your spouse has earned income (and you have none or not enough to make a maximum contribution), you are eligible to make an IRA contribution based on your spouse’s income. 2  The limit is that the total of all IRA contributions (yours and your spouse’s) cannot exceed the earned income of the working spouse."}, {"url": "http://www.rothira.com/roth-ira-eligibility", "passage_text": "Roth IRA Contribution Eligibility. Anyone with earned income that falls under the above guidelines can use a Roth IRA to save for retirement. How much you can save is dependent upon your age. If you under the age of 50 years old you can contribute $5,500 toward retirement in a Roth IRA. "}, {"url": "http://fairmark.com/retirement/roth-accounts/contributions-to-roth-accounts/qualifying-income-for-ira-contributions/", "passage_text": "Alimony income. For purposes of making an IRA contribution, taxable alimony income counts as qualifying income. This is a special rule that permits you to build retirement savings in an IRA even if you rely on alimony income for your support. The rule applies only to taxable alimony income, though. You can’t make a regular (non-rollover) contribution to a traditional IRA or a Roth IRA unless you or your spouse have qualifying income. This page explains what types of income count as qualifying income for this purpose."}, {"url": "http://www.moneycrashers.com/spousal-ira-rules-eligibility/", "passage_text": "Roth IRA. The contribution amount limits to a Roth IRA are the same as those to a traditional IRA. However, your eligibility to contribute to a Roth IRA depends on your income. You can make a full contribution to each Roth IRA as long as your working spouse makes less than $173,000 in 2012. "}]