[{"url": "http://www.financialsamurai.com/the-average-net-worth-for-the-above-average-person/", "passage_text": "Based on my assumptions above, the average net worth of the above average 30 year old is around $250,000. By the time this person is 40, his/her net worth should climb to around $660,000 and all the way up to around $2,180,000 million by the age of 60. THE ABOVE AVERAGE NET WORTH DECONSTRUCTED. First, we must highlight what the average tax-deferred retirement savings plan is for those in America. We’ll focus on the simple 401K system we have here where one can contribute $18,000 of their pre-tax income every year in 2015 (was $17,500 in 2014)."}, {"url": "http://www.financialsamurai.com/the-average-net-worth-by-age-for-the-upper-middle-class/", "passage_text": "Clearly the $349,843 average net worth figure is probably skewed to those closer to 35 than 20. But, the $349,843 figure is significant and very believable based on hundreds of people I’ve personally talked to or interacted with online over the years i this age group, b/c I was in this age group as of pre-2013. Median net worth by age provides for potentially a more realistic picture of the “average” American. The sweet spot for net worth amount continues to be ages 55 – 64, right before the traditional retirement age of 65."}, {"url": "http://www.stackmeup.com/net-worth/average-net-worth-by-age.php", "passage_text": "Those are just a couple of reasons that you may want to compare your wealth to the average net worth by age. We're sure you can think of a lot more reasons to compare your worth to the average net worth by age. You can see how your average net worth stacks up by age, gender, and ethnicity. There are many reasons why you may want to compare your net worth to the average net worth by age. For example, you can see if all your hard work has paid off and if you're similar or more successful than your peers."}, {"url": "http://www.stackmeup.com/net-worth/average-net-worth-by-age.php", "passage_text": "Once your done comparing your net worth to the average net worth by age, you can stack yourself up by education, age, gender, ethnicity, location, and credit information here. Lastly, we just want to remind you that all the information you enter on this site is 100% anonymous and completely secure. You can see how your average net worth stacks up by age, gender, and ethnicity. There are many reasons why you may want to compare your net worth to the average net worth by age. For example, you can see if all your hard work has paid off and if you're similar or more successful than your peers."}, {"url": "http://www.stackmeup.com/net-worth/average-net-worth-by-age.php", "passage_text": "Compare your average net worth by age at StackMeUp! Above you can see how your net worth compares with the average net worth by age. You can see how your average net worth stacks up by age, gender, and ethnicity. There are many reasons why you may want to compare your net worth to the average net worth by age. For example, you can see if all your hard work has paid off and if you're similar or more successful than your peers."}, {"url": "https://en.wikipedia.org/wiki/Wealth_in_the_United_States", "passage_text": "In addition, wealth is unevenly distributed, with the wealthiest 25% of US households owning 87% of the wealth in the United States, which was $54.2 trillion in 2009. Including human capital such as skills, the United Nations estimated the total wealth of the United States in 2008 to be $118 trillion. "}, {"url": "http://www.financialsamurai.com/the-average-net-worth-for-the-above-average-person/", "passage_text": "1) My lifetime gross income from December 1986 to August 2015 (age 53.5) will be about $316,000 (about $11,000 a year). 2) 73 % of my $500,000 net worth is in investments. 3) I am expecting a 7.5%(+) long term return from my equities and a 2.5%(+) long term return from my bonds and cash (a 5% average). THE ABOVE AVERAGE NET WORTH DECONSTRUCTED. First, we must highlight what the average tax-deferred retirement savings plan is for those in America. We’ll focus on the simple 401K system we have here where one can contribute $18,000 of their pre-tax income every year in 2015 (was $17,500 in 2014)."}, {"url": "http://www.usatoday.com/story/money/personalfinance/2015/01/31/motley-fool-net-worth-age/22415229/", "passage_text": "And if you're in the 50th percentile, and over the age of 65, it's important to know that even if all $171,135 of your net worth is in cash and investments -- that will provide less than $7,000 per year in living expenses. What's left is the 30th, 50th, and 70th percentiles. The plain English explanation is this: the 30th percentile means that if you have exactly this net worth, it is greater than 30% of households your age. The same is true for the 50th"}, {"url": "http://www.demos.org/blog/9/8/14/wealth-distributed-extremely-unevenly-within-every-age-group", "passage_text": "The below-35 age group is the least wealthy and has a mean net worth of $76k. From there, it just goes up and up, topping out in the 65-74 age group at $1.06 million. Here is median wealth broken down by age group: These median wealth figures tell the same story as mean wealth. The below-35 age group has the lowest median wealth at $10k. The 65-74 age group has the highest median wealth at $232k."}, {"url": "http://www.financialsamurai.com/the-average-net-worth-for-the-above-average-person/", "passage_text": "According to CNN Money 2014, the average net worth for the following ages are: $9,000 for ages 25-34, $52,000 for ages 35-44, $100,000 for ages 45-54, $180,000 for ages 55-64, and $232,000+ for 65+. Seems very low, but that’s because we use averages and a large age range. THE ABOVE AVERAGE NET WORTH DECONSTRUCTED. First, we must highlight what the average tax-deferred retirement savings plan is for those in America. We’ll focus on the simple 401K system we have here where one can contribute $18,000 of their pre-tax income every year in 2015 (was $17,500 in 2014)."}]