[{"url": "http://www.buzzle.com/articles/kidney-stones-symptoms-in-women.html", "passage_text": "The symptoms of kidney stones in women are somewhat similar to the symptoms observed in men. These symptoms include pain in the lower back or flank area, pain or a burning sensation while urinating, blood in urine, etc."}, {"url": "http://www.webmd.com/kidney-stones/kidney-stones-symptoms", "passage_text": "1 No symptoms, if the stone is small enough. 2  Sudden, severe pain that gets worse in waves. 3  Stones may cause intense pain in the back, side, abdomen, groin, or genitals. 4  People who have had a kidney stone often describe the pain as the worst pain I've ever had.. 5  Feeling sick to the stomach (nausea) and vomiting."}, {"url": "http://www.buzzle.com/articles/kidney-stones-symptoms-in-women.html", "passage_text": "Nausea and Vomiting. There are different types of kidney stones, such as-calcium stones, oxalate stones, struvite stones, uric acid stones and cystine stones. Usually, kidney stones form when the urine becomes too concentrated and it contains more calcium, oxalate and uric acid than fluid."}, {"url": "http://www.webmd.com/kidney-stones/kidney-stones-symptoms", "passage_text": "If they stay in the kidney, they typically do not cause pain. When they travel out of the body through the tubes of the urinary tract (including the ureters, which connect the kidney to the bladder, or the urethra, which leads outside the body), their movement may cause: 1  No symptoms, if the stone is small enough. 2  Sudden, severe pain that gets worse in waves."}, {"url": "http://www.urology.wustl.edu/en/Patient-Care/Kidney-Stones/Kidney-Stones-Overview", "passage_text": "Symptoms associated with kidney stones. When a kidney stone starts to pass, symptoms typically occur suddenly and without warning. Sharp, stabbing pain usually develops in your side or back, typically right at the bottom part of the ribcage. Sometimes, the pain will travel downward into the genital area."}, {"url": "http://www.mayoclinic.org/diseases-conditions/kidney-stones/basics/symptoms/CON-20024829", "passage_text": "Symptoms. A kidney stone may not cause symptoms until it moves around within your kidney or passes into your ureter — the tube connecting the kidney and bladder. At that point, you may experience these signs and symptoms: 1  Severe pain in the side and back, below the ribs. 2  Pain that spreads to the lower abdomen and groin."}]