[{"url": "http://careers.chipotle.com/", "passage_text": "Chipotle’s on a mission to change the way people think about and eat fast food, and it’s catching on—fast. Whether you’re interested in restaurant jobs or the “corporate” side of things, there’s plenty of opportunity for you. Sign In or Register En Espanol. Español’chipotle s on a mission to change the way people think about and eat fast, food and’it s catching—on. Fast whether’you re interested in restaurant jobs or “the” corporate side of, things’there s plenty of opportunity for. you"}, {"url": "http://certifiedhumane.org/9-disappointing-facts-chipotle/", "passage_text": "Some of Chipotle’s locally sourced food travels thousands of extra miles so it can be processed in Chicago. “The less distance food has to travel,” Chipotle’s website says, “the better.” Sourcing locally — defined by the company as within 350 miles from the restaurant — has long been part of the Chipotle mantra. It’s good for local economies, the environment, and the consumers, who get to enjoy the freshest foods"}, {"url": "http://beefmagazine.com/blog/chipotle-continues-use-fear-sell-its-burritos", "passage_text": "The Chipotle fast-food burrito chain is at it again – using fear-mongering tactics to scare folks into buying its burritos. This isn’t the first time the brand has used fear to sell products, as the chain’s anti-conventional agriculture messages have been around since the chain’s establishment. "}, {"url": "http://www.nytimes.com/interactive/2015/02/17/upshot/what-do-people-actually-order-at-chipotle.html", "passage_text": "Today, we have a ballpark estimate. The typical order at Chipotle has about 1,070 calories. That’s more than half of the calories that most adults are supposed to eat in an entire day. The recommended range for most adults is between 1,600 and 2,400. The spike around 1,000 calories represents “standard” burrito orders – a meat burrito with typical additions: cheese, salsa, lettuce, sour cream, rice and beans. If you order a meat burrito at Chipotle with these toppings, it’s very likely to reach 1,000 calories. But there’s so much more to this data than the averages."}, {"url": "http://www.urbanfoodlife.com/why-doesnt-chipotle-have-queso/", "passage_text": "Chipotle is in the business (like Apple) of giving you what you need and not always what you want. By focusing on only serving food free of added hormones, without additives, without preservatives, etc… Chipotle has created a foodie movement that is long overdue. Chipotle Mexican Grill is famous for focusing on “Food With Integrity” and its menu is as short and simple as the company mission to change the way people think and eat fast food."}, {"url": "http://foodbabe.com/2013/03/24/a-food-babe-investigates-win-chipotle-posts-ingredients/", "passage_text": "Chipotle’s burrito and flour taco shells have partially hydrogenated vegetable oils (a.k.a. trans fat). “A 40-calorie-per-day increase in trans fat intake can lead to a 23% higher risk of heart disease .” 40 calories is a mere 2% of a typical 2000 calorie per day diet. Some of the original results of my investigation still hold true – but Chipotle made a major oil switch in some of their products like the black beans that don’t use GMO oil any longer and has made a fanastic committment to eliminate the transfat, preservatives and other GMO ingredients in the future."}, {"url": "http://www.motherjones.com/politics/2013/09/chipotle-commercial-sustainable-food-truth", "passage_text": "Chipotle Mexican Grill, the popular burrito chain that has more than 1,500 restaurants worldwide, hit the advertising jackpot earlier this month when it released a Pixar-style commercial that went viral and turned the restaurant into an overnight poster child for sustainable food. According to Chipotle's website, all soy bean oil and corn products contain GMOs. That doesn't sound so bad, except that Chipotle chicken, steak, fajita vegetables, rice, tortilla chips, and tortillas all contain one or both of these items."}, {"url": "https://en.wikipedia.org/wiki/Chipotle_Mexican_Grill", "passage_text": "Chipotle Mexican Grill, Inc. (/tʃɨˈpoʊtleɪ/) is a chain of restaurants in the United States, United Kingdom, Canada, Germany, and France, specializing in Mission burritos and tacos. The company has released a mission statement called Food with Integrity, which highlights its efforts in using organic ingredients, and serves more naturally raised meat than any other restaurant chain. Chipotle is one of the first chains of fast casual dining establishments. Founded by Steve Ells in 1993, Chipotle had 16 restaurants (all in Colorado) when McDonald's Corporation became a major investor in 1998. By the time McDonald's fully divested itself from Chipotle in 2006, the chain had grown to over 500 locations. With more than 1700 locations, Chipotle had a net income in 2013 of US$327.4 million and a staff of more than 45,000 employees as reported in a 2015 CNN Money syndicated report via WTVR"}]