[{"url": "http://compnetworking.about.com/cs/wireless/g/bldef_ssid.htm", "passage_text": "Definition: An SSID is the name of a wireless local area network (WLAN). All wireless devices on a WLAN must employ the same SSID in order to communicate with each other. The SSID is a sequence of alphanumeric characters (letters or numbers). SSIDs have a maximum length of 32 characters. Also Known As: Service Set Identifier, Network Name. Examples: Wardrivers sometimes scan for the SSIDs being broadcast by wireless LANs, then set that SSID on their client to attempt to join that WLAN."}, {"url": "http://www.linuxquestions.org/questions/linux-networking-3/how-can-i-find-out-my-bssid-724263/", "passage_text": "An alternative is to use the BSSID, or MAC address of the access point to. The point of both methods is to automatically connect to the correct access point. If neither is defined, the client will be prompted to select an access point from a list of detected access points. Then type /sbin/arp-a and you will see your IP address to MAC address associations. Just as DNS matches names to IP addresses, the arp protocol associates MAC addresses to IP addresses on the local network. This is the OSI layer 2, or DataLink layer at work."}, {"url": "http://www.juniper.net/documentation/en_US/network-director1.5/topics/concept/wireless-ssid-bssid-essid.html", "passage_text": "Understanding the Network Terms SSID, BSSID, and ESSID. The terms BSSID, ESSID, and SSID are all used to describe sections of a wireless network (WLAN)—the three terms have slightly different meanings. As a wireless user you are concerned only with the broadcast SSIDs that let you connect to a wireless network. However, there are usually multiple access points within each WLAN, and there has to be a way to identify those access points and their associated clients. This identifier is called a basic service set identifier (BSSID) and is included in all wireless packets. Figure 2: Each Access Point Has Its Own BSS. As a user, you are usually unaware of which basic service set (BSS) you currently belong to"}, {"url": "http://sourcedaddy.com/networking/bssid-ssid-and-essid.html", "passage_text": "The Basic Service Set Identifier (BSSID) defines the most basic infrastructure mode network, a BSS of one WAP and one or more wireless nodes. With such a simple network, the Wi-Fi folks didn't see any reason to create some new numbering or naming scheme, so they made the BSSID the same as the MAC address for the WAP. Unfortunately, most Wi-Fi devices just use the term SSID, not ESSID. When you configure a wireless device to connect to an ESS, you're technically using the ESSID rather than just the SSID, but the manufacturer often has tried to make it simple for you by using only the term SSID."}, {"url": "http://compnetworking.about.com/cs/wireless/g/bldef_ssid.htm", "passage_text": "A network administrator often uses a public SSID, that is set on the access point and broadcast to all wireless devices in range. Some newer wireless access points disable the automatic SSID broadcast feature in an attempt to improve network security. SSIDs are case sensitive text strings. The SSID is a sequence of alphanumeric characters (letters or numbers). SSIDs have a maximum length of 32 characters. Also Known As: Service Set Identifier, Network Name. Examples: Wardrivers sometimes scan for the SSIDs being broadcast by wireless LANs, then set that SSID on their client to attempt to join that WLAN."}, {"url": "http://documentation.netgear.com/reference/enu/wireless/WirelessNetworkingBasics-3-04.html", "passage_text": "The Extended Service Set Identification (ESSID) is one of two types of Service Set Identification (SSID). In an ad hoc wireless network with no access points, the Basic Service Set Identification (BSSID) is used. In an infrastructure wireless network that includes an access point, the ESSID is used, but may still be referred to as SSID. An SSID is a 32-character (maximum) alphanumeric key identifying the name of the wireless local area network."}, {"url": "https://answers.yahoo.com/question/index?qid=20080409094532AAgvGhP", "passage_text": "Best Answer: SSID stands for Service Set Identifier. BSSID stands for Broadcast Service Set Identifier. They are exactly the same thing. It is the 'name' of the wireless network that shows up under network connections."}, {"url": "http://searchmobilecomputing.techtarget.com/definition/service-set-identifier", "passage_text": "A service set identifier (SSID) is a sequence of characters that uniquely names a wireless local area network (WLAN). An SSID is sometimes referred to as a network name.. This name allows stations to connect to the desired network when multiple independent networks operate in the same physical area. "}, {"url": "http://sourcedaddy.com/networking/bssid-ssid-and-essid.html", "passage_text": "BSSID, SSID, and ESSID. Wireless devices connected together into a network, whether ad hoc or infrastructure, require some way to identify that network. Packets bound for computers within the network need to go where they're supposed to go, even when you have more than one Wi-Fi network overlapping. Unfortunately, most Wi-Fi devices just use the term SSID, not ESSID. When you configure a wireless device to connect to an ESS, you're technically using the ESSID rather than just the SSID, but the manufacturer often has tried to make it simple for you by using only the term SSID."}]