[{"url": "http://www.youreable.com/forums/showthread.php/9174-Contribution-based-ESA-will-this-be-affected-if-my-carer-claims-carers-allowance", "passage_text": "If someone claimed Carer's Allowance for looking after you, you would cease to be entitled to Severe Disability Premium. Carer's Allowance has no effect on Contributions Based ESA, as this benefit has no premiums. For more information on PIP, see the sticky PIP thread. Hello again I have been awarded PIP. My relative would like to claim carers allowance for taking care of me but would this effect my contribution based ESA allowance. I have read somewhere that if I got income based ESA then it would effect me but it doesn't tell me about contribution based ESA. Your advice would be much appreciated Thank you."}, {"url": "https://www.carersuk.org/help-and-advice/financial-support/help-with-benefits/carers-allowance", "passage_text": "Your Carer's Allowance will stop if you are no longer caring for them for at least 35 hours a week or their qualifying disability benefit stops. The following benefits will usually stop after 4 weeks when someone moves into residential care: To find out more contact the Carers UK Adviceline. If your Carer's Allowance stops due the person you care for moving into residential care, you can continue to get the carer premium or addition paid with your means-tested benefits for 8 weeks after your Carer's Allowance stops."}, {"url": "https://www.gov.uk/carers-allowance/overview", "passage_text": "1. Carer’s Allowance is £62.10 a week to help you look after someone with substantial caring needs. You don’t have to be related to, or live with, the person you care for. You must be 16 or over and spend at least 35 hours a week caring for them. Carer’s Allowance is taxable. Overview. Carer’s Allowance is £62.10 a week to help you look after someone with substantial caring needs. You don’t have to be related to, or live with, the person you care for. You must be 16 or over and spend at least 35 hours a week caring for them."}, {"url": "https://www.gov.uk/carers-allowance/further-information", "passage_text": "You can still get Carer’s Allowance if you take a break. A break is any time you spent less than 35 hours a week caring for the other person. You could for example get Carer’s Allowance for up to: 1  12 weeks if either of you go into respite care or hospital. 2  4 weeks if either of you go on holiday."}, {"url": "https://www.carersuk.org/help-and-advice/financial-support/help-with-benefits/carers-allowance", "passage_text": "If the person you care for is receiving a means tested benefit, your claim for Carer’s Allowance could affect how much they get. If they are receiving the severe disability premium (or addition in pension credit) as part of their benefit, then they will lose this if you are paid Carer’s Allowance. To find out more contact the Carers UK Adviceline. If your Carer's Allowance stops due the person you care for moving into residential care, you can continue to get the carer premium or addition paid with your means-tested benefits for 8 weeks after your Carer's Allowance stops."}, {"url": "https://www.moneyadviceservice.org.uk/en/articles/benefits-and-tax-credits-you-can-claim-as-a-carer", "passage_text": "It can also affect the benefits of the person you’re caring for. You can only get Carer’s Allowance if you aren’t already claiming State Pension or certain income-replacing benefits such as contribution-based Employment and Support Allowance. Millions of pounds of carers’ benefits go unclaimed every year. Carer’s Allowance is £62.10 a week in (2015/16). You might be able to claim it if you: 1  spend more than 35 hours a week caring for someone."}, {"url": "http://www.nhs.uk/Conditions/social-care-and-support-guide/Pages/carers-allowance.aspx", "passage_text": "Before claiming Carer's Allowance, wait until the person you look after receives a decision about their claim for PIP, AA or DLA. If you make your claim for Carer's Allowance within three months of the date of that decision, your Carer's Allowance will be paid from the same date the PIP, DLA or AA is paid. Age rules for Carer's Allowance. You can claim Carer's Allowance if you're aged 16 or over. There is no upper age limit, but it's not normally possible to get Carer's Allowance and State Pension at the same time."}, {"url": "https://www.carersuk.org/help-and-advice/financial-support/help-with-benefits/carers-allowance", "passage_text": "The carer premium or addition can continue to be paid for a further 8 weeks after your Carer's Allowance stops. If you are receiving Income Support as a carer, this will continue for 8 weeks after your Carer's Allowance stops. To find out more contact the Carers UK Adviceline. If your Carer's Allowance stops due the person you care for moving into residential care, you can continue to get the carer premium or addition paid with your means-tested benefits for 8 weeks after your Carer's Allowance stops."}]