[{"url": "http://www.candida-albicans-cure.com/candida-test.html", "passage_text": "Medical Candida Test. If you want medical proof that you have a Candida albicans overgrowth, you will want to have a medical test performed. The most reliable medical Candida test is the Candida Immune Complexes test. The second most reliable is the combination of IgA, IgG and IgM tests. None of the Ig tests are reliable alone. They must be used as a combination."}, {"url": "http://www.candida-albicans-cure.com/candida-test.html", "passage_text": "It is known as the Candida saliva test or the Candida spit test. Fill a clear glass with water and place it by your bed at night. When you wake in the morning, work up a bit of saliva and spit into the glass of water. It is important that nothing enters your mouth or touches your lips before you do this. The most reliable medical Candida test is the Candida Immune Complexes test. The second most reliable is the combination of IgA, IgG and IgM tests. None of the Ig tests are reliable alone. They must be used as a combination."}, {"url": "http://www.mycandidadiet.com/candida-test.php", "passage_text": "There are many symptoms commonly associated with yeast overgrowth. Use this online Candida test to see if your causes and symptoms line up with the most common Candida related issues. Instructions: Simply click the button next to the Yes and No buttons in the first section of common causes. When you are finished click submit to get your instant results. This Candida test is for informational purposes only and is not intended to diagnose or be relied upon as medical advice. It is intended to give you a better understanding of your overall health as it relates to the specific symptoms of Candida"}, {"url": "http://www.antiagingresourcecenter.com/Candida-Overgrowth-Test.html", "passage_text": "Larger pictures are posted below for a better view of test results. The Candida water saliva test is accurate to the degree of identifying if you have a Candida problem. Since there are many different varieties of Candida, it can not identify which variety you have, but that you have an overgrowth problem. Let me explain:"}, {"url": "http://www.antiagingresourcecenter.com/Candida-Overgrowth-Test.html", "passage_text": "There is quite a lot of controversy with the Candida spit test and most of that controversy comes from the companies and websites with a motive for financial gain; selling you supplements or blood test to determine if you have Candida overgrowth. The Candida water saliva test is accurate to the degree of identifying if you have a Candida problem. Since there are many different varieties of Candida, it can not identify which variety you have, but that you have an overgrowth problem. Let me explain:"}, {"url": "http://www.yeastinfectionadvisor.com/candidatests.html", "passage_text": "The preferred candida test is a stool test along with the blood antibody test that can be ordered through a doctor to check for good bacteria and yeast. Many times people are missing entire species of bacteria and this is the root of their problems. Immuno Labs does an IgG candida blood yeast test that is accurate. You can get this test done at the directlabs.com website. You can also do this test at home with this simple yeast test kit."}, {"url": "http://www.yeastinfectionadvisor.com/candidatests.html", "passage_text": "Cultures. Your doctor or ob-gyn can perform this very common candida test. During a full blown vaginal yeast infection they can take a culture to determine the species. This also can be done with skin infections but care must be take to not cut the skin and allow the yeast to get into the blood stream. Immuno Labs does an IgG candida blood yeast test that is accurate. You can get this test done at the directlabs.com website. You can also do this test at home with this simple yeast test kit."}, {"url": "http://www.candida-yeast-infection-relief.com/report.shtml", "passage_text": "Candida concentrates in saliva overnight, so this test is most accurate first thing in the morning. I suggest rinsing out your mouth first, because, if you happen to be sleeping in a room with mold, you may have mold in your mouth from the room, and that could show up in the saliva too. The logic behind the test is simple. If you have candida overgrowth, it will show up in the saliva, a friendly environment for candida. When you spit into the glass, the aerated saliva is lighter than water."}, {"url": "http://www.candida-yeast-infection-relief.com/report.shtml", "passage_text": "If you are not sure if you have candida yeast overgrowth, try this simple test:First thing in the morning, take the spit test. It is very accurate, and won't cost you a penny. The logic behind the test is simple. If you have candida overgrowth, it will show up in the saliva, a friendly environment for candida. When you spit into the glass, the aerated saliva is lighter than water."}]