[{"url": "http://historyrocket.com/American-History/timeline/1600-1799/jamestown/Who-Founded-Jamestown.html", "passage_text": "Early Jamestown Settlement. On the land of America, the first English settlement was The Jamestown Settlement Colony, the first English successful settlement. It was named after the King of England; named James I. Jamestown was the first colony of Virginia, founded on May 14, 1607. More.."}, {"url": "http://historyrocket.com/American-History/timeline/1600-1799/jamestown/Who-Founded-Jamestown.html", "passage_text": "Jamestown was founded on May 14, 1607, in the Colony of Virginia. Jamestown was set up in the New World as the first English colony which had its own permanent settlement. It is presently situated in the peninsular area, near the James River in the state"}, {"url": "http://www.americaslibrary.gov/jb/colonial/jb_colonial_jamestwn_1.html", "passage_text": "The Virginia Company of England made a daring proposition: sail to the new, mysterious land, which they called Virginia in honor of Elizabeth I, the Virgin Queen, and begin a settlement. They established Jamestown, Virginia, on May 14, 1607, the first permanent British settlement in North America."}, {"url": "http://www.answers.com/Q/Who_founded_Jamestown", "passage_text": "Jamestown, founded on May 14, 1607, was the first permanent English colony established in America. It was located on a peninsula of the James River in the present-day state of Virginia. It was named for King James I of England and here the first American representative government was established."}, {"url": "http://www.livescience.com/38595-jamestown-history.html", "passage_text": "View full size image. Jamestown, founded in 1607, was the first successful permanent English settlement in what would become the United States. It was located on Jamestown Island, in Virginia, about 30 miles (47 kilometers) up the James River from the Atlantic coast."}, {"url": "http://www.answers.com/Q/When_was_Jamestown_founded", "passage_text": "Jamestown, founded on May 14, 1607, was the first permanent English colony established in America. It was located on a peninsula of the James River in the present-day state of Virginia. It was named for King James I of England and here the first American representative government was established."}, {"url": "http://www.historyrocket.com/American-History/timeline/1600-1799/jamestown/When-Was-Jamestown-Founded.html", "passage_text": "On 14th May 1607, Jamestown, the first English colony was founded, located on Jamestown Island in the colony of Virginia. The United States of America, now the most powerful and well developed country, was earlier a permanent English settlement colony."}, {"url": "http://historyrocket.com/American-History/timeline/1600-1799/jamestown/Who-Founded-Jamestown.html", "passage_text": "On the land of America, the first English settlement was The Jamestown Settlement Colony, the first English successful settlement. It was named after the King of England; named James I. Jamestown was the first colony of Virginia, founded on May 14, 1607. More.."}]