[{"url": "http://www.answers.com/Q/What_is_the_chemical_formula_of_vinegar", "passage_text": "Vinegar's formula is very dilute CH3COOH. Vinegar is mainly water (H2O), but is also comprised of acetic acid (the boxlike acid which gives vinegar its pungent/sour smell). Vinegar is a liquid produced by aerobic fermentation (meaning: it needs oxygen) of alcohol into acetic acid as well as other fermentation byproducts. The acetic acid concentration ranges from 4 to 9 percent by volume for table vinegar (typically 9 %) and higher concentrations for pickling (up to 18 %) although in some countries the minimum strength may be less. Natural vinegars also contain smaller amounts of tartaric acid, citric acid, and other acids."}, {"url": "https://en.wikipedia.org/wiki/Vinegar", "passage_text": "Vinegar is a liquid consisting mainly of acetic acid (CH 3 COOH) and water. The acetic acid is produced by the fermentation of ethanol by acetic acid bacteria. Vinegar is now mainly used as a cooking ingredient. "}, {"url": "https://en.wikipedia.org/wiki/Acetic_acid", "passage_text": "Acetic acid /əˈsiːtɨk/ , systematically named ethanoic acid /ˌɛθəˈnoʊɨk/ , is an organic compound with the chemical formula CH 3 COOH (also written as CH 3 CO 2 H or C 2 H 4 O 2). It is a colourless liquid that when undiluted is also called glacial acetic acid. Vinegar is roughly 3–9% acetic acid by volume, making acetic acid the main component of vinegar apart from water. Acetic acid has a distinctive sour taste and pungent smell. Besides its production as household vinegar, it is mainly produced as a precursor to polyvinylacetate and cellulose acetate. Vinegar is typically 4–18% acetic acid by mass. Vinegar is used directly as a condiment, and in the pickling of vegetables and other foods. Table vinegar tends to be more diluted (4% to 8% acetic acid), while commercial food pickling employs solutions that are more concentrated."}, {"url": "http://www.chemicalformula.org/chemistry-help/facts-about-vinegar", "passage_text": "1 Vinegar is a weak acid with a pH of 2-3. 2  Vinegar is a mixture of about 5% acetic and water with a small amount of other flavoring and coloring chemicals which depends on the method of production. 3  eg. balsamic vinegar, apple vinegar, brown vinegar and white vinegar. 1 Vinegar is a mixture of about 5% acetic and water with a small amount of other flavoring and coloring chemicals which depends on the method of production. 2  eg. balsamic vinegar, apple vinegar, brown vinegar and white vinegar. 3  The chemical formula for vinegar is shown by its main component, acetic acid"}, {"url": "http://www.chemicalformula.org/chemistry-help/facts-about-vinegar", "passage_text": "Facts about vinegar. 1  Vinegar is a weak acid with a pH of 2-3. 2  Vinegar is a mixture of about 5% acetic and water with a small amount of other flavoring and coloring chemicals which depends on the method of production. 1 Vinegar is a mixture of about 5% acetic and water with a small amount of other flavoring and coloring chemicals which depends on the method of production. 2  eg. balsamic vinegar, apple vinegar, brown vinegar and white vinegar. 3  The chemical formula for vinegar is shown by its main component, acetic acid"}, {"url": "http://www.chemicalformula.org/vinegar", "passage_text": "Chemical formula for vinegar. Vinegar is composed of about 5% acetic acid. This is the major chemical component of vinegar. The systematic or proper chemical name of acetic acid is ethanoic acid. Vinegar is a weak acid produced by the oxidation of alcohol (ethanol) from wines and ciders by bacteria. It has a pleasant sour taste and is used in cooking or as a condiment."}, {"url": "http://chemistry.about.com/od/chemicalcomposition/f/What-Is-The-Chemical-Composition-Of-Vinegar.htm", "passage_text": "Vinegar is a liquid that is produced from the fermentation of ethanol into acetic acid. The fermentation is carried out by bacteria. Answer: Vinegar consists of acetic acid (CH 3 COOH), water and trace amounts of other chemicals, which may include flavorings. The concentration of the acetic acid is variable. Distilled vinegar contains 5-8% acetic acid. Spirit of vinegar is a stronger form of vinegar that contains 5-20% acetic acid. Flavorings may include sweeteners, such as sugar or fruit juices"}, {"url": "http://scienceline.ucsb.edu/getkey.php?key=4147", "passage_text": "Baking soda and vinegar react with each other because of an acid-base reaction. Baking soda is a bicarbonate (NaHCO 3) and vinegar is an acetic acid (HCH 3 COO). One of the products this reaction creates is carbon dioxide. Answer 4: They react because baking soda is a base and vinegar is an acid dissolved in water. When you mix an acid and a base in a solvent, which in this case is the water, usually the acid transfers hydrogen to the base to form a new compound."}, {"url": "http://www.enzyme-facts.com/properties-of-vinegar.html", "passage_text": "Tweet. Properties of vinegar...Vinegar is mainly a dilute aqueous solution of acetic acid and this is reflected in its physical and chemical properties. It’s the product of two biochemical processes. These processes are alcoholic fermentation and acid fermentation. "}]