[{"url": "http://arbl.cvmbs.colostate.edu/hbooks/pathphys/digestion/basics/gi_microanatomy.html", "passage_text": "Between the inner circular and outer longitudinal layers of smooth muscle is another critical component of the digestive tract's nervous system-the myenteric plexus. Tunica submucosa lies immediately beneath the mucosa, and is a layer of loose to dense connective tissue containing blood and lymphatic vessels. The submucosa also contains the submucous plexus, a critical component of the digestive tract's nervous system which provides nervous control to the mucosa. In most of the digestive tract (stomach and intestines) it consists of a thin layer of loose connective tissue covered by mesothelium (a type of squamous epithelium that lines body cavities); within the peritoneal cavity, this structure is also referred to as visceral peritoneum."}, {"url": "https://en.wikipedia.org/wiki/Submucosa", "passage_text": "In the gastrointestinal tract, the submucosa is the layer of dense irregular connective tissue or loose connective tissue that supports the mucosa, as well as joins the mucosa to the bulk of overlying smooth muscle (fibers running circularly within layer of longitudinal muscle). "}, {"url": "http://arbl.cvmbs.colostate.edu/hbooks/pathphys/digestion/basics/gi_microanatomy.html", "passage_text": "Beneath the epithelium, but still within the tunica mucosa is a layer-the lamina propria-of loose connective tissue through which course blood vessels and lymphatics that supply the epithelium. This layer also contains lymphatic nodules important to immune functions of the digestive tract. In most of the digestive tract (stomach and intestines) it consists of a thin layer of loose connective tissue covered by mesothelium (a type of squamous epithelium that lines body cavities); within the peritoneal cavity, this structure is also referred to as visceral peritoneum."}, {"url": "http://www.innerbody.com/image_digeov/dige10-new3.html", "passage_text": "Deep to the mucosa is the submucosa layer that provides blood vessels, lymphatic vessels, and nerves to support the mucosa on the surface. Several layers of smooth muscle tissue form the muscularis layer that contracts and moves the small intestines. The small intestine is, however, about twice the length of the large intestine and usually measures about 10 feet in length. The small intestine winds throughout the abdominal cavity inferior to the stomach. Its many folds help it to pack all 10 feet of its length into such a small body cavity...."}, {"url": "http://www.aboutgastro.com/digestive-system/tissue-layers-of-digestive-tract", "passage_text": "Most of the tissue in the digestive tract itself has four layers. These layers are called the mucosa, the submucosa, muscularis externa, and the serosa. The layer in the innermost part of the digestive tract is called the mucosa. The mucosa serves to line the cavity of the tract. The mucosa consists of three sub-layers called the epithelium, the lamina propria, and the muscularis mucosae. This mucus lubricates the digestive tract. The lamina propia is a sub-layer that is made of loose connective tissue. The muscularis mucosae is a sub-layer of smooth muscle. The next layer after the mucosa is called the submucosa. This layer is a thick layer of loose connective tissue. Although this layer does not have any sub-layers, it does have blood vessels, vessels belonging to the lymphatic system, and nerves, some of which control digestion"}, {"url": "http://training.seer.cancer.gov/anatomy/digestive/regions/intestine.html", "passage_text": "The small intestine is divided into the duodenum, jejunum, and ileum. The small intestine follows the general structure of the digestive tract in that the wall has a mucosa with simple columnar epithelium, submucosa, smooth muscle with inner circular and outer longitudinal layers, and serosa. The large intestine consists of the colon, rectum, and anal canal. The wall of the large intestine has the same types of tissue that are found in other parts of the digestive tract but there are some distinguishing characteristics. The mucosa has a large number of goblet cells but does not have any villi. The longitudinal muscle layer, although present, is incomplete"}, {"url": "http://www.training.seer.cancer.gov/anatomy/digestive/structure.html", "passage_text": "The mucosa, or mucous membrane layer, is the innermost tunic of the wall. It lines the lumen of the digestive tract. The mucosa consists of epithelium, an underlying loose connective tissue layer called lamina propria, and a thin layer of smooth muscle called the muscularis mucosa. In certain regions, the mucosa develops folds that increase the surface area. Certain cells in the mucosa secrete mucus, digestive enzymes, and hormones."}, {"url": "http://www.aboutgastro.com/digestive-system/tissue-layers-of-digestive-tract", "passage_text": "This layer has two sub-layers of smooth muscle called the inner circular layer and the outer longitudinal layer. The cells of the inner circular layer, which is closer to the submucosa layer, wrap around the digestive tract like a ring. This mucus lubricates the digestive tract. The lamina propia is a sub-layer that is made of loose connective tissue. The muscularis mucosae is a sub-layer of smooth muscle. The next layer after the mucosa is called the submucosa. This layer is a thick layer of loose connective tissue. Although this layer does not have any sub-layers, it does have blood vessels, vessels belonging to the lymphatic system, and nerves, some of which control digestion"}]