[{"url": "http://www.wikihow.com/Grow-Bacteria-in-a-Petri-Dish", "passage_text": "1 The ideal temperature for growing bacteria is between 70 and 98 degrees F (20-37 degrees C). 2  If necessary, you can place the petri dishes in a cooler location, but the bacteria will grow a lot more slowly. 3  Leave the bacteria to develop for 4-6 days, as this will give the cultures enough time to grow. 1 If necessary, you can place the petri dishes in a cooler location, but the bacteria will grow a lot more slowly. 2  Leave the bacteria to develop for 4-6 days, as this will give the cultures enough time to grow. 3  Once the bacteria begins to grow, you may notice a smell coming from the dishes."}, {"url": "http://www.sciencecompany.com/Bacteria-Growing-Experiments-in-Petri-Plates.aspx", "passage_text": "Introduction. Bacteria are microorganisms that grow everywhere. We can collect and grow them in specially prepared petri dishes. Blood agar or tryptic soy agar with 5% sheep's blood is an excellent medium for supplying bacteria with nutrients and an environment in which we can see them grow. Sterile powdered agar with nutrients can be mixed with water, heated and then poured into empty petri plates or ready-to-use dishes can be purchased. The undigestible agar is a gelatin-like substance with a semi solid surface on which the bacteria can grow while they consume the added nutrients (like sheep's blood). Keep growing petri dishes taped closed until your experiment is done. Then you should safely destroy the fuzzy bacteria colonies using bleach. Below are general outlines of three types of experiments involving bacteria growth. They are offered to assist in designing your own experiment or project."}, {"url": "http://www.freesciencefairproject.com/biology/bacteria_colonies.html", "passage_text": "Peteri-dishes: Petri-dishes are disposable clear plastic dishes with a cap that are used for many science experiments and bacteria growth. A thin layer of nutrient agar in a petri-dish is enough for growing bacteria. You can see the bacteria colony shapes and count them without opening the lead of the petri-dish. Since petri-dishes are clear, you can see the bacteria from either side of the dish. "}, {"url": "http://www.wikihow.com/Grow-Bacteria-in-a-Petri-Dish", "passage_text": "Once you have introduced the bacteria, you should replace the lid on the petri dish and seal it with some tape. 1  Make sure to label each petri dish with the source of the bacteria it contains, otherwise you won't be able to tell which is which. 2  As an extra precaution, you can place each petri dish in a zipper-lock bag. 1 If necessary, you can place the petri dishes in a cooler location, but the bacteria will grow a lot more slowly. 2  Leave the bacteria to develop for 4-6 days, as this will give the cultures enough time to grow. 3  Once the bacteria begins to grow, you may notice a smell coming from the dishes."}, {"url": "http://www.madaboutscience.com.au/store/index.php?main_page=page&id=43", "passage_text": "1 Now it s time to collect and grow your bacteria (or fungi) on the agar Petri dishes. 2  Note: the Petri dishes can be stored in the fridge for 1-2 days before use. 3  Bacteria is not hard to collect because it is everywhere. 1 Immediately put the lid back on the Petri dish and put it in the fridge for about 4 hours until the agar has set. 2  Do not touch the agar or you will contaminate it with bacteria on your fingers. 3 "}, {"url": "http://www.hometrainingtools.com/life-science-biology/agar-petri-dishes", "passage_text": "Use agar and petri dishes to grow bacteria cultures. Nutrient agar works well for general use. To make an agar plate, just heat the agar and pour it into a sterile petri dish. Rub a swab along a surface you want to test (your mouth, the bathroom counter, etc.) and then smear it in a zig-zag pattern on the surface of the agar plate. Getting started:"}, {"url": "http://www.scienceenterprises.com/growingbacteria.aspx", "passage_text": "The best place to successfully and safely grow bacteria, mold and yeast are in specially shaped glass or plastic dishes called Petri Dishes. Cultures grow best with gentle heat in the range between 70 degrees to 95 degrees Fahrenheit. Cultures will grow at lower temperatures but at a much slower rate. "}, {"url": "http://www.wikihow.com/Grow-Bacteria-in-a-Petri-Dish", "passage_text": "1 You will need 1.2 grams (approximately half a teaspoon) of agar powder for every 4-inch petri dish you wish to use. 2  In a heat proof dish or bowl, stir half a teaspoon of the nutrient agar powder into 60 ml (approximately 1/4 cup) of hot water. 3  Multiply these quantities for however many petri dishes you plan on using. 1 If necessary, you can place the petri dishes in a cooler location, but the bacteria will grow a lot more slowly. 2  Leave the bacteria to develop for 4-6 days, as this will give the cultures enough time to grow. 3  Once the bacteria begins to grow, you may notice a smell coming from the dishes."}, {"url": "http://www.madaboutscience.com.au/store/index.php?main_page=page&id=43", "passage_text": "1 Do not touch the agar or you will contaminate it with bacteria on your fingers. 2  Now it s time to collect and grow your bacteria (or fungi) on the agar Petri dishes. 3  Note: the Petri dishes can be stored in the fridge for 1-2 days before use. 4  Bacteria is not hard to collect because it is everywhere. 1 Immediately put the lid back on the Petri dish and put it in the fridge for about 4 hours until the agar has set. 2  Do not touch the agar or you will contaminate it with bacteria on your fingers. 3"}, {"url": "http://www.geoquery.net/petri.pdf", "passage_text": "We can collect and grow them in specially prepared petri dishes. Blood agar or tryptic soy agar with 5% sheep's blood is an excellent medium for supplying bacteria with nutrients and an environment in which we can see them grow. Sterile powdered agar with nutrients can be mixed with water, heated and then poured into empty petri dishes or ready-to-use dishes can be purchased. The undigestible agar is a gelatin-like substance with a semi solid surface on which the bacteria can grow while they consume the added nutrients (like sheep's blood)."}]