[{"url": "http://fawesome.ifood.tv/health/435512-benefits-of-tomato-enzyme", "passage_text": "The enzyme activity of tomatoes have been well studied and understood. Galactosidase and pectinesterase enzymes are abundantly found in tomatoes and are responsible for it ripening and eventually becoming soft and mushy. These enzymes have been isolated and extracted and are available in the form of tablets and capsules for convenience of use. They help to supplement the enzymes already present in our body and improve health. A ripe tomato is a rich source and should be preferably eaten daily to attain maximum benefits. The usefulness of tomato enzymes for the human body has been better understood in the past couple of years and some of the important functions are listed in the blog below. Uses And Functions of Tomato Enzyme. As Antioxidant-A recent study concluded that the enzyme in tomato is a powerful antioxidant and along with lycopene, another important constituent, it can combat the harmful effects of free radicals that are produced by our body with every breath of oxygen that we breathe in"}, {"url": "http://www.plantphysiol.org/content/153/1/80.full", "passage_text": "Enzymes interact to generate metabolic networks. The activities of more than 22 enzymes from central metabolism were profiled during the development of fruit of the modern tomato cultivar Solanum lycopersicum ‘M82’ and its wild relative Solanum pennellii (LA0716). More recently, these studies of enzyme activities have been complemented by proteomic analyses during fruit ripening (Rose et al., 2004; Faurobert et al., 2007). We have now investigated the activities of 28 enzymes during tomato fruit development, located in most of the major pathways in central metabolism."}, {"url": "http://iosrjournals.org/iosr-jpbs/papers/Vol5-issue5/F0552935.pdf", "passage_text": "4.2 Protease The activity of protease was taken after every 2 minutes at 540 nm. The change in absorbance value was noted after incubating the sample for 30 minutes to enhance the activity of Protease enzyme (Fig.4). Protease activity of tomato at 0 minute was found to be 1.55. The mixture was then incubated for 30 minutes and the absorbance was noted after every 2 minutes. Absorbance was found to increase up to 6 minutes initially and then became constant"}, {"url": "http://www.brettb.com/Biotechnology.asp", "passage_text": "The work developed using tomato is being applied to enzyme extracted from other fruit (such as strawberry and mango) as it is eventually hoped to isolate and characterise PE genes from a range of fruit. The ethics of using genetic engineering techniques for the improvement of food products are complex. In tomato, the enzyme has been detected in fruit, leaves and roots. In particular, the fruit contain very high levels of the enzyme, leading to the theory that it has an important role in fruit ripening and softening [ 1 ]. Column chromatography has been able to separate PE into distinct isoforms."}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=44", "passage_text": "1 That's because the lycopene in deep red tomatoes is mostly trans-lycopene, and the lycopene in orange/tangerine tomatoes is mostly tetra-cis-lycopene. 2  In a recent study, this tetra-cis form of lycopene turned out to be more efficiently absorbed by the study participants. 1 They also argued for the importance of tomatoes and other lycopene-containing foods in the diet. 2  We don't always think about antioxidant protection as being important for bone health, but it is, and tomato lycopene (and other tomato antioxidants) may have a special role to play in this area."}, {"url": "http://www.plantphysiol.org/content/153/1/80.full", "passage_text": "The optimal dilution ratio for tomato fruit material was between 1 mg fresh weight of tomato fruit per 0.45 and 1.5 mL of assay mix for most enzymes (Supplemental Table S2; Supplemental Fig. S3A). As all enzyme reactions were linear for at least 70 min (Supplemental Fig. More recently, these studies of enzyme activities have been complemented by proteomic analyses during fruit ripening (Rose et al., 2004; Faurobert et al., 2007). We have now investigated the activities of 28 enzymes during tomato fruit development, located in most of the major pathways in central metabolism."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0141022911000913", "passage_text": "A central composite design was used to optimize the enzyme-assisted extraction of lycopene from the peel fraction of tomato processing waste. The yield of lycopene extraction from untreated tomato skins was 4.1 ± 0.3%, while the values determined for the enzyme-treated material were between 33.2% and 72.3% (mean value: 50.7%), depending on the set of operating conditions used (Table 3)."}, {"url": "http://www.brettb.com/Biotechnology.asp", "passage_text": "The enzyme is especially abundant in tomato, where it has been most extensively studied. In tomato, the enzyme has been detected in fruit, leaves and roots. In particular, the fruit contain very high levels of the enzyme, leading to the theory that it has an important role in fruit ripening and softening [ 1 ]. Column chromatography has been able to separate PE into distinct isoforms."}, {"url": "http://www.indiacurry.com/nutrients/digestiveenzymesfoodsources.htm", "passage_text": "Digestive Enzymes and Food Sources. Digestive enzymes help digest foods so the body can use the nutrients. The enzymes are found in raw foods. Structure of the enzymes changes with temperature, the enzymes in cooked foods are functionally dead. The grains and legumes are sprouted to make them edible. Eat raw fruits at the beginning of a meal."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0141022911000913", "passage_text": "Abstract. A central composite design was used to optimize the enzyme-assisted extraction of lycopene from the peel fraction of tomato processing waste. Tomato skins were pretreated by a food-grade enzyme preparation with pectinolytic and cellulolytic activities and then subjected to hexane extraction. The yield of lycopene extraction from untreated tomato skins was 4.1 ± 0.3%, while the values determined for the enzyme-treated material were between 33.2% and 72.3% (mean value: 50.7%), depending on the set of operating conditions used (Table 3)."}]