[{"url": "https://kb.iu.edu/d/apge", "passage_text": "In Outlook 2007 and 2003, in the Folder List, right-click the name of the mailbox (e.g.,), and choose or. 1  In the window that appears, click the tab, and then click. 2  Under Show Names from the: in the Add Users window, select. 3  To search for your name, enter it in the field in Last Name, First Name format."}, {"url": "http://email.about.com/od/outlooktips/qt/How-To-Attach-A-File-In-Outlook.htm", "passage_text": "1 In Outlook 2000-2003: 2  Select Insert | File from the menu. 3  Use the file selection dialog to locate the file you want to attach. 4  Click on the down arrow on the Insert button. 5  Select Insert as Attachment. 6  Compose the rest of the message as usual and eventually send it."}, {"url": "https://support.office.com/en-us/article/attach-a-file-message-contact-or-task-to-an-email-message-477e3f61-5564-41e3-aa95-bb4737ad8cbb", "passage_text": "Attach an Outlook item to a message. You can attach Outlook items, such as other email messages, tasks, contacts or calendar items, to a message. This is the easiest way to forward multiple items or messages. Create a message, or for an existing message, click Reply, Reply All, or Forward."}, {"url": "http://email.about.com/od/outlooktips/qt/How-To-Attach-A-File-In-Outlook.htm", "passage_text": "Attach a File in Outlook. To send a file as an attachment in Outlook 1  : Start with a new message in Outlook. 2  In Outlook 2007/10: 3  Go to the Insert tab of the message's toolbar. 4  Click Attach File. 5  In Outlook 2000-2003: 6  Select Insert | File from the menu. 7  Use the file selection dialog to locate the file you want to attach."}, {"url": "http://www.sperrysoftware.com/Email-Tools/how-to-attach-a-folder-to-email/", "passage_text": "How to attach a folder to email in Outlook: 1  Starting in Windows Explorer, navigate to the folder you want to email. 2  Right click on the folder itself. 3  In the menu that pops up, choose “Send to”, then choose “Compressed (zipped) folder”. 4  Rename the zipped folder if necessary, then hit enter."}, {"url": "https://support.office.com/en-us/article/Attach-a-message-contact-file-or-task-to-an-email-message-6263434a-b5f4-4606-8504-2f0e6fe7750d", "passage_text": "Attach an Outlook item to a message. You can attach Outlook items, such as other email messages, tasks, contacts or calendar items, to a message. This is the easiest way to forward multiple items or messages. Create a message, or for an existing message, click Reply, Reply All, or Forward. In the message window, click Message."}]