[{"url": "http://www.uptodate.com/contents/stenotrophomonas-maltophilia", "passage_text": "INTRODUCTION. Stenotrophomonas maltophilia is a multi-drug resistant gram-negative bacillus that is an opportunistic pathogen [ 1-4 ], particularly among hospitalized patients. Stenotrophomonas infections have been associated with high morbidity and mortality in severely immunocompromised and debilitated individuals. S. maltophilia is the only species of Stenotrophomonas known to infect humans [ 7 ], whereas its closest genetic relatives are plant pathogens [ 7,8 ]. It is frequently isolated from soil, water, animals, plant matter, and hospital equipment [ 4,9-21 ]."}, {"url": "http://emedicine.medscape.com/article/237024-overview", "passage_text": "Background. Stenotrophomonas (Xanthomonas) maltophilia is an aerobic gram-negative bacillus that is found in various aquatic environments. It is an uncommon pathogen in humans. S maltophilia is an organism of low virulence and frequently colonizes fluids used in the hospital setting (eg, irrigation solutions, intravenous fluids) and patient secretions (eg, respiratory secretions, urine, wound exudates)."}, {"url": "http://jac.oxfordjournals.org/content/62/5/889.full", "passage_text": "Stenotrophomonas maltophilia, formerly known as Pseudomonas or Xanthomonas maltophilia, is an aerobic, glucose non-fermentative, Gram-negative bacillus that is frequently isolated from water, soil, animals, plant materials and hospital equipment. Background Stenotrophomonas maltophilia has emerged as an important opportunistic pathogen, causing infections whose management is often problematic due to its inherent resistance to many antibiotics, making co-trimoxazole the main therapeutic option."}, {"url": "http://www.answers.com/Q/What_is_Stenotrophomonas_maltophilia", "passage_text": "Making the world better, one answer at a time. I think you mean Stenotrophomonas (Pseudomonas) maltophilia-an aerobic gram-negative bacillus that is an infrequent pathogen in humans. I am not an expert on the subject but my understang is that: "}, {"url": "http://antimicrobe.org/b236.asp", "passage_text": "Microbiology. Stenotrophomonas maltophilia is a motile non-fermentative, gram negative bacillus that is readily isolated from environmental sources and water. It is an obligate aerobe, and is capable of growth between 5o and 40oC (18)"}, {"url": "http://www.rightdiagnosis.com/s/stenotrophomonas_maltophilia/intro.htm", "passage_text": "Stenotrophomonas maltophilia: A bacteria that is usually found in aquatic environments, is not very virulent and rarely infects humans. Most cases of infection tends to occur through use of hospital appliances such as catheters, I.V lines and breathing tubes in immunocompromised people. A species of STENOTROPHOMONAS, formerly called Xanthomonas maltophilia, which reduces nitrate. It is a cause of hospital-acquired ocular and lung infections, especially in those patients with cystic fibrosis and those who are immunosuppressed."}, {"url": "http://www.uptodate.com/contents/stenotrophomonas-maltophilia", "passage_text": "Stenotrophomonas (Xanthomonas) maltophilia is a ubiquitous, aerobic, non-fermentative, gram-negative bacillus that is closely related to the Pseudomonas species [ 5 ]. The name signifies a unit feeding on few substrates, based on the Greek roots stenos (narrow), trophos (one who feeds), and monas (a unit). S. maltophilia is the only species of Stenotrophomonas known to infect humans [ 7 ], whereas its closest genetic relatives are plant pathogens [ 7,8 ]. It is frequently isolated from soil, water, animals, plant matter, and hospital equipment [ 4,9-21 ]."}, {"url": "http://microbewiki.kenyon.edu/index.php/Stenotrophomonas_maltophilia", "passage_text": "Stenotrophomonas maltophilia is a gram-negative, motile, multitrichous flagellated bacillus that is aerobic and non-fermenting (1). While Stenotrophomonas maltophilia is an aerobe, it can still grow using nitrate as a terminal electron acceptor in the absence of oxygen (5). Stenotrophomonas maltophilia is an aerobic, non-fermentative, gram-negative bacillus possessing flagella in a multitrichous formation, and that naturally lives in the rhizosphere (1)."}, {"url": "http://www.specialpathogenslab.com/perch/resources/stenotrophomonas-fact-sheet.pdf", "passage_text": "Stenotrophomonas maltophilia FACT sheet © Special Pathogens Laboratory WWW.SPECIALPATHOGENSLAB.COM What is Stenotrophomonas maltophilia? Stenotrophomonas maltophilia is a motile, gram-negative non-fermentative bacillus previously known as Pseudomonas maltophilia and Xanthomonas maltophilia. "}]