[{"url": "https://answers.yahoo.com/question/index?qid=20101217100920AA6vEPQ", "passage_text": "Best Answer: My place is around that same size. I live in Texas, so the winters are mild. In the spring and fall I use around 500 Kwh/mo. In the summer it goes up to around 800 Kwh/mo. Last winter we had a few cold snaps. my usage went up to 750 Kwh for a couple of months. Its very mild today and I have the windows open and a nice cool breeze through here; not running the HVAC at all.... I negotiated what I think is a good rate. I pay .09¢ per Kwh. The average Texas home pays around .12 to .22¢. By contrast, the average price in Kentucky is .609¢. -it must be nice"}, {"url": "http://www.eia.gov/tools/faqs/faq.cfm?id=97&t=3", "passage_text": "How much electricity does an American home use? In 2013, the average annual electricity consumption for a U.S. residential utility customer was 10,908 kilowatthours (kWh), an average of 909 kWh per month. Louisiana had the highest annual consumption at 15,270 kWh, and Hawaii had the lowest at 6,176 kWh. "}, {"url": "http://www.xmms.org/qna/How_many_kwh_does_the_average_apartment_use_per_month-qna673976.html", "passage_text": "The average cost would be around $200-$220 per month.... 0. 0. If you are a new driver and getting your first car insurance, the average cost would be around $200-$220 per month. Though it may also depend on the car you own and the state but the cheapest car insurance I found for my car was just about $200 per month."}, {"url": "http://shrinkthatfootprint.com/average-household-electricity-consumption", "passage_text": "In the US typical household power consumption is about 11,700 kWh each year, in France it is 6,400 kWh, in the UK it is 4,600 kWh and in China around 1,300 kWh. The global average electricity consumption for households with electricity was roughly 3,500 kWh in 2010. "}, {"url": "http://www.beatingupwind.com/2012-10/electric-bills-for-townhouse-vs-apartment", "passage_text": "From 9/20 to 10/23 we used an average of 31.4 kWh/day (72% over winter average). Now, mind you, the house is a lot bigger has more things going on. Instead of 1,350 sq. ft., it’s about 3,200 sq. ft. There’s 180 watts of light bulbs that are on from dusk to dawn (roughly 2 kWh/day). But the “winter” (non-summer) power is considerably higher. So far, the townhouse seems to consistently use 15 kWh/day more than our old apartment – that’s 80% more power. Electricity seems to be costing about 25 cents per kWh, so that’s less then $4/day, or about $115/month additional."}, {"url": "http://www.city-data.com/forum/dallas/1571032-average-electricity-kwh-usage-1-bedroom.html", "passage_text": "Reputation: 17. Not 750 sq. ft., but just to give you an idea. I am in an 850 sw. ft. apartment, roughly 5 years old, windows facing North, keep my ac on 82 while at work, 80 when home, and 77 at night. On my first bill, on a 22 day billing cycle it was 304KWh. Roughly 14 KWh/day, so at 30 days, that would be 420 Kwh. 1500 KWh in a 750 sq. ft. apartment, in as mild a month as this April is BAD. Something is really wrong, unless you have bad insulation, old apartment, leaky areas, and keep the AC on 65 all day. "}, {"url": "http://www.beatingupwind.com/2012-10/electric-bills-for-townhouse-vs-apartment", "passage_text": "The average up to 6/12 and after 9/20 is 33.4 kWh/day. So once again we see power going up roughly 11 kWh/day for A/C during the summer. That’s great since we’re cooling more space than we did at the apartment with about the same amount of energy. But the “winter” (non-summer) power is considerably higher. So far, the townhouse seems to consistently use 15 kWh/day more than our old apartment – that’s 80% more power. Electricity seems to be costing about 25 cents per kWh, so that’s less then $4/day, or about $115/month additional."}, {"url": "http://www.motherearthnews.com/renewable-energy/average-electric-bills.aspx", "passage_text": "My family's average over the past year is about 650 kwh per month. We pay $0.097 USD per kwh in our area. Before I had made any changes (switching to CFLs, lowering the water heater temperature, upgrading to a new energy star fridge, etc...) we typically consumed 1000-1200 kwh per month. Tags: electricity, conservation. * The average residential monthly bill is $95.66 * Average residential monthly use is 920 kilowatt hours (kWh) * The average price paid per kWh is 10.4 cents, so about a dime."}]