[{"url": "http://nlp.cs.nyu.edu/meyers/controversial-wikipedia-corpus/english-html/main/main_0403.html", "passage_text": "Dr. Paul Joseph Goebbels (October 29, 1897 – May 1, 1945) was Adolf Hitler 's Propaganda Minister (see Propagandaministerium) in Nazi Germany. Goebbels was known for his zealous and energetic oratory and virulent anti-Semitism. Following Hitler's death, he served as Chancellor for one day. "}, {"url": "http://www.history.com/topics/world-war-ii/joseph-goebbels", "passage_text": "In 1933, the year Adolf Hitler (1889-1945) became chancellor of Germany, he named Joseph Goebbels (1897-1945), his trusted friend and colleague, to the key post of minister for public enlightenment and propaganda. In 1928, Goebbels was elected to the Reichstag, the German Parliament. More significantly, Hitler named him the Nazi Party propaganda director. It was in this capacity that Goebbels began formulating the strategy that fashioned the myth of Hitler as a brilliant and decisive leader."}, {"url": "http://www.historylearningsite.co.uk/nazi-germany/nazi-leaders/joseph-goebbels/", "passage_text": "Goebbels demanded “total war” from the Germans and in 1944, he was appointed Reich Commissioner for Total Mobilisation. As Berlin was besieged by the Russians in April/May 1945, Goebbels stayed with Hitler in Hitler’s bunker. In his diary, he blamed the defeat of Germany on the German people and not Hitler. On May 1st, he gave poison to his six children and then shot his wife and then himself"}, {"url": "http://www.historylearningsite.co.uk/nazi-germany/nazi-leaders/joseph-goebbels/", "passage_text": "Joseph Goebbels was born in 1897 and died in 1945. Goebbels was Hitler’sMinister of Propaganda and one of the most important and influential people in Nazi Germany. Goebbels was born in the Rhineland and he attended the established Heidelberg University where he was awarded a doctorate of philosophy in 1920. He had not served in the German Army during the First World War as he was disabled by a clubbed foot which hindered his ability to walk. As Berlin was besieged by the Russians in April/May 1945, Goebbels stayed with Hitler in Hitler’s bunker. In his diary, he blamed the defeat of Germany on the German people and not Hitler."}, {"url": "https://en.wikipedia.org/wiki/Goebbels_children", "passage_text": "The Goebbels children were the five daughters and one son born to Nazi propaganda minister Joseph Goebbels and his wife Magda Goebbels. The children, born between 1932 and 1940, were murdered by their parents in Berlin on 1 May 1945, the day both parents committed suicide. The Goebbels family in 1942: (back row) Hildegard, Harald Quandt, Helga; (front row) Helmut, Hedwig, Magda, Heidrun, Joseph and Holdine. (In this well-known manipulated image, the visage of the uniformed Harald, who was away on military duties when the photo was taken, was inserted and retouched.)."}, {"url": "http://www.biography.com/people/joseph-goebbels-9313998", "passage_text": "Following Adolf Hitler's suicide, Goebbels served as chancellor of Germany for a single day before he and his wife, Magda Goebbels, poisoned their six children and took their own lives. Infamous Nazi Paul Joseph Goebbels was born on October 29, 1897, in Rheydt, Germany, the third of five children. Joseph Goebbels served as minister of propaganda for the German Third Reich under Adolf Hitler—a position from which he spread the Nazi message."}, {"url": "http://spartacus-educational.com/GERgoebbels.htm", "passage_text": "Joseph Goebbels, the son of Fritz Goebbels and Katharina Odenhausen, was born in Rheydt, Germany, on 29th October, 1897. His father was a bookkeeper at the United Wick Factories. Joseph was the third son born to the couple. "}, {"url": "http://www.pbs.org/wgbh/amex/holocaust/peopleevents/pandeAMEX98.html", "passage_text": "On April 30, 1945, the day Hitler killed himself in his bunker, Goebbels was among a small coterie of the Fuehrer'führer s inner circle who retrieved the body and placed it in the garden outside where it was. Burned On may, 1 goebbels Followed'hitler s. Lead he poisoned his six, children and then shot his wife and. himself On April 30, 1945, the day Hitler killed himself in his bunker, Goebbels was among a small coterie of the Fuehrer'führer s inner circle who retrieved the body and placed it in the garden outside where it was. Burned On may, 1 goebbels Followed'hitler s. lead"}, {"url": "http://www.history.com/topics/world-war-ii/joseph-goebbels", "passage_text": "Despite the anti-Semitism Joseph Goebbels promoted as Germany's minister for public enlightenment and propaganda, some of his favorite schoolteachers were Jewish, and Goebbels was even once engaged to a young woman who was part-Jewish. In 1928, Goebbels was elected to the Reichstag, the German Parliament. More significantly, Hitler named him the Nazi Party propaganda director. It was in this capacity that Goebbels began formulating the strategy that fashioned the myth of Hitler as a brilliant and decisive leader."}]