[{"url": "https://en.wikipedia.org/wiki/Orthopedic_surgery", "passage_text": "Orthopaedic surgery or orthopaedics (sometimes spelled orthopedic surgery and orthopedics) is the branch of surgery concerned with conditions involving the musculoskeletal system. In the United States, orthopedic surgeons have typically completed four years of undergraduate education and four years of medical school. Subsequently, these medical school graduates undergo residency training in orthopedic surgery. The five-year residency is a categorical orthopaedic surgery training."}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=A00099", "passage_text": "Education and Training. Your orthopaedic surgeon is a medical doctor with extensive training in the proper diagnosis and treatment of injuries and diseases of the musculoskeletal system. Your orthopaedic surgeons completed up to 14 years of formal education. 1  Four years of study in a college or university. While orthopaedic surgeons are familiar with all aspects of the musculoskeletal system, many orthopaedists specialize in certain areas, such as the foot and ankle, spine, hip or knee. They may also choose to focus on specific fields like pediatrics, trauma or sports medicine."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=6957", "passage_text": "Orthopaedics: The branch of surgery broadly concerned with the skeletal system (bones). This particular term is commonly misspelled. Orthopedics is how this field of surgery is listed under Physicians & Surgeons in the telephone Yellow Pages in Jacksonville, Florida. This spelling is quite common today. Orthopaedics is not merely old-fashioned. It is the correct spelling. What was meant by the term orthopaedics when it was composed goes back to its roots: ortho-, straight + the Greek paes, child = the practice, literally, of straightening the child."}, {"url": "http://www.thefreedictionary.com/orthopaedics", "passage_text": "Noun. 1. orthopaedics-the branch of medical science concerned with disorders or deformities of the spine and joints. orthopedics. traction - (orthopedics) the act of pulling on a bone or limb (as in a fracture) to relieve pressure or align parts in a special way during healing; his leg was in traction for several days. "}, {"url": "https://en.wikipedia.org/wiki/Orthopedic_surgery", "passage_text": "Nomenclature [edit]. Nicholas Andry coined the word  orthopaedics  orthopædics In french as, orthopedie orthopédie derived From the greek words (ὀρθός, orthos) correct straight and (παιδίον), paidion child when He (published orthopedie Translated: as orthopaedia Orthopædia or The art Of Correcting and Preventing) deformities in. children in 1741 In the United States, orthopedic surgeons have typically completed four years of undergraduate education and four years of medical school. Subsequently, these medical school graduates undergo residency training in orthopedic surgery. The five-year residency is a categorical orthopaedic surgery training."}, {"url": "http://www.ibji.com/blog/2011-12-08/what-is-orthopedics", "passage_text": "Orthopedics Defined: In a nutshell, the study and research of the musculoskeletal system (bones, joints, nerves, etc.) is known as orthopedics. Orthopedics was first developed to treat children who had crippling or debilitating diseases. In fact the word “orthopedic” is derived from the Greek words “ortho,” meaning straight, and “pais,” meaning children or pediatric. Modern orthopedic physicians treat everyone, no matter their age. Inside the big umbrella of orthopedics there are a number of specialties including: 1  Arthritis and osteoarthritis. 2  Injury care including fractures. 3  Joint replacement surgery. 4  Rheumatology. 5  Pain management. 6  Sports medicine. 7  Back & Spine Surgery. 8  Hand Surgery."}, {"url": "http://www2.ipswichhospital.net/microsites/ortho/orthopaedics.asp", "passage_text": "Orthopaedics is the branch of surgery concerned with treating problems involving the musculoskeletal system. The musculoskeletal system includes bones, joints, ligaments, tendons, muscles and nerves. The Greek word ' ortho ' means straight and ' paedics ' comes from the Greek ' pais ' meaning children. "}, {"url": "http://www.ucdenver.edu/academics/colleges/medicalschool/departments/Orthopaedics/Pages/orthopedicsorthopaedics.aspx", "passage_text": "Orthopedics (or orthopaedics) is the line of surgery and treatment involving the musculoskeletal system, and can entail degenerative conditions, trauma, sports injury, tumors, and congenital issues. You may have noticed the spelling variations of orthopedics/orthopaedics. "}, {"url": "http://www.nhs.uk/Conditions/orthopaedics/Pages/Introduction.aspx", "passage_text": "Introduction. Trauma and orthopaedics is an area of surgery concerned with injuries and conditions that affect the musculoskeletal system (the bones, joints, ligaments, tendons, muscles and nerves). "}, {"url": "http://www.differencebetween.info/difference-between-orthopedics-and-orthopaedics", "passage_text": "Tweet. Key difference: Orthopedics or Orthopaedics is the branch of medicine which deals with the correction of deformities of bones or muscles. The term ‘orthopedics’ is a generally accepted spelling for the specialty in the relevant field, but ‘orthopaedics’ is the correct medical spelling of the term. Orthopaedics is the traditional spelling for the study of fixing bones and muscles. Orthopaedic Surgeons are doctors who are considered as specialists in bone and muscle treatments. The usage of the term orthopedics is most commonly found in the United States."}]