[{"url": "http://www.meaning-of-names.com/biblical-names/olivia.asp", "passage_text": "Meaning of Olivia. Biblical name. In Biblical, the name Olivia means-peace-of the olive tree. Other origins for the name Olivia include-Biblical, Spanish, Italian.The name Olivia is most often used as a girl name or female name. Biblical Name Meaning-peace-of the olive tree."}, {"url": "http://www.babynology.com/meaning-olivia-f1.html", "passage_text": "The girl's name Olivia is of Latin origin, feminine form of Oliver and its meaning is olive tree. Coined by Shakespeare, as in the play Twelfth Night (1599) Olivia is a noblewoman who is wooed by Duke Orsino but instead falls in love with his messenger Cesario. Biblical: the olive tree is a symbol of fruitfulness, beauty, and dignity. Olivia was the fifth most popular name for girls in the US in 2005, and the third most popular name for girls in the UK in 2007. Olivia Popularity."}, {"url": "http://www.sheknows.com/baby-names/name/olivia", "passage_text": "The name Olivia is a Spanish baby name. In Spanish the meaning of the name Olivia is: Olive. Swedish Meaning: The name Olivia is a Swedish baby name. In Swedish the meaning of the name Olivia is: Olive. American Meaning: The name Olivia is an American baby name. In American the meaning of the name Olivia is: Olive. In Latin the meaning of the name Olivia is: Olive: symbol of peace. Shakespearean Meaning: The name Olivia is a Shakespearean baby name. In Shakespearean the meaning of the name Olivia is: Twelfth Night', also called 'What You Will' A rich countess."}, {"url": "http://baby-names-and-stuff.com/biblical-baby-names/olivia.asp", "passage_text": "Baby Names Biblical Baby Names meaning of Olivia. Meaning/Origin of Baby Name - Olivia. Olivia. Report Incorrect Information. The name Olivia is a baby girl name. The baby name Olivia originated as an Biblical name. In Biblical the name Olivia means-peace-of the olive tree"}, {"url": "http://www.meaning-of-names.com/spanish-names/olivia.asp", "passage_text": "Meaning of Olivia. Spanish name. In Spanish, the name Olivia means-Olive.. Other origins for the name Olivia include-Spanish, Biblical, Italian.The name Olivia is most often used as a girl name or female name. Spanish Name Meaning-Olive"}, {"url": "http://www.answers.com/Q/What_does_the_name_Olivia_mean_in_the_bible", "passage_text": "That is a lovely name. The name Olivia is Latin and means olive tree. A feminine name that is highly popular. Also the name of a character in Shakespeare's Twelfth Night The … name Grace is English. Initially the name had nothing to do with the physical grace, but was more to do with divine favour. While the name Olivia is not directly in the Bible, the name is derived from the latin for olive. There are many references to olives in the bible, the most notable being Jesu … s praying on the Mount of Olives. Olives symbolize fruitfulness, beauty, dignity, and peace (in extending an olive branch)"}, {"url": "http://www.thinkbabynames.com/meaning/0/Olivia", "passage_text": "It is of Latin origin, and the meaning of Olivia is  olive tree. Coined by Shakespeare as the name of a much-wooed aristocrat in his play Twelfth Night (1599). He may have derived the name from the olive plant, or as a feminine form of Oliver. Olivia is a very prominent first name for women (#352 out of 4276, Top 8%) and also a very prominent last name for all people (#41596 out of 150436, Top 28%). (2000 U.S. Census). Charted below is the birth name popularity of Olivia for girls."}, {"url": "http://www.sheknows.com/baby-names/name/olivia", "passage_text": "Latin Meaning: The name Olivia is a Latin baby name. In Latin the meaning of the name Olivia is: Olive: symbol of peace. Shakespearean Meaning: The name Olivia is a Shakespearean baby name. In Shakespearean the meaning of the name Olivia is: Twelfth Night', also called 'What You Will' A rich countess."}]