[{"url": "http://bankruptcyhq.com/how-much-does-bankruptcy-attorney-cost", "passage_text": "Cost of a Chapter 13 Bankruptcy Attorney. The cost of a Chapter 13 bankruptcy attorney varies geographically, but the typical fee is between $2200 and $3200 for the 3-5 years that the attorney will be representing you. The cost of a Chapter 7 bankruptcy attorney varies geographically, but typically are between $800 and $2500. The fee is based on the estimated amount of time the bankruptcy attorney anticipates spending on the case. Payment plans vary, but many firms allow you to retain their services for as little as $100"}, {"url": "http://www.attorneys.com/bankruptcy/how-much-do-bankruptcy-lawyers-cost", "passage_text": "Say, for example, you talk to your bankruptcy attorney for 5 minutes by phone. If the attorney charges $200 an hour in 15-minute increments, that conversation just cost you $50. If the attorney charges $200 an hour in 6-minute increments, the call only cost you $20. Lawyers take several factors into consideration when figuring out how much to charge by the hour. They consider:"}, {"url": "http://personalfinance.costhelper.com/personal-bankruptcy.html", "passage_text": "1 The bankruptcy court filing fee is $299 for Chapter 7 and $274 for Chapter 13, but (depending on your location and circumstances) you might be eligible to apply to pay the fee in installments or have it waived. "}, {"url": "http://www.natlbankruptcy.com/how-much-does-it-cost-to-file-bankruptcy/", "passage_text": "Average Chapter 13 Bankruptcy Attorney Fees. Under Chapter 13, you’ll work with the Trustee to create a payment plan for your debts. The plan will last for three to five years and at the end of it, your remaining unsecured debt is discharged. For a Chapter 13 case, the fee is $310. The Bankruptcy Trustee may charge a fee of $15 to $20 when you file, as well. You may request to pay the filing fees in installments; most courts will allow it if you can show it would be a financial hardship to pay all at once."}, {"url": "http://www.alllaw.com/articles/nolo/bankruptcy/paying-lawyer-attorney-fees.html", "passage_text": "If you have a lot of assets or your income is higher than the state median for a similar household, you will typically have to pay more in attorney fees than an unemployed person with no assets. In general, attorney fees for a Chapter 7 bankruptcy range from $500 to $3,500 depending on the complexity of the case. Larger firms with more advertising and overhead costs may charge more than a solo practitioner. Also, a newer attorney will typically charge less than a more experienced lawyer. "}, {"url": "http://bankruptcyhq.com/how-much-does-bankruptcy-attorney-cost", "passage_text": "The fees are also structured differently. The cost of a Chapter 13 bankruptcy attorney varies geographically, but the typical fee is between $2200 and $3200 for the 3-5 years that the attorney will be representing you. The cost of a Chapter 7 bankruptcy attorney varies geographically, but typically are between $800 and $2500. The fee is based on the estimated amount of time the bankruptcy attorney anticipates spending on the case. Payment plans vary, but many firms allow you to retain their services for as little as $100"}, {"url": "http://www.memphisbankruptcylawyer.com/view/11", "passage_text": "That money goes to the court clerk. The filing fees do not absolutely have to be paid in advance, but I do strongly recommend it. The filing fee for Chapter 11 is $1,717.00. The attorney fee for a Chapter 7 is usually between $1,000.00 and $1,500.00, depending on how complicated the case is. Some newer attorneys and high-volume attorneys do charge less, but as with most things, you get what you pay for."}, {"url": "http://www.natlbankruptcy.com/how-much-does-it-cost-to-file-bankruptcy/", "passage_text": "Bankruptcy filers must pay a filing fee. For a Chapter 7 case, the fee is $335. For a Chapter 13 case, the fee is $310. The Bankruptcy Trustee may charge a fee of $15 to $20 when you file, as well. You may request to pay the filing fees in installments; most courts will allow it if you can show it would be a financial hardship to pay all at once."}, {"url": "http://www.debtkid.com/bankruptcy-how-much-does-it-cost", "passage_text": "The us bankruptcy courts have filing fees. The cost of bankruptcy chapter 7 is a filing fee of $299, Chapter 13′s filing fee is $274. On top of that you have…. "}]