[{"url": "http://www.fixr.com/costs/garage-door-opener-installation", "passage_text": "Each has its proverbial pluses and minuses, and each comes with a different range of costs and requirements. According to DIYOrNot.com, it will cost between $200 and $425 to install a single new garage door opener."}, {"url": "http://www.homewyse.com/services/cost_to_install_automatic_garage_door_opener.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Automatic Garage Door Opener Installation project. For a basic 6 doors project in zip code 47474, the benchmark cost to Install an Automatic Garage Door Opener ranges between $221.02 - $363.88 per door. To estimate costs for your project: 1."}, {"url": "http://www.homeadvisor.com/cost/garages/install-a-garage-door/", "passage_text": "A garage door will cost anywhere from $200 for single doors to $4,000 for two or more doors, with better materials accounting for the higher cost. Most homeowners report spending about $1,060 for the door and installation."}, {"url": "http://www.fixr.com/costs/install-garage-door", "passage_text": "According to DIYOrNot.com, it should cost between $500 and $800 to install a single new garage door. They demonstrate that the average homeowner can usually tackle such a project in a nine hour time span and a professional will be able to complete it in roughly five hours."}, {"url": "http://www.fixr.com/costs/garage-door-opener-installation", "passage_text": "1 Selecting an opener-The screw-drive varieties will cost between $150 to $250 for the equipment and will be far less noisy than the chain drive versions. 2  The chain drive types average $130 to $180 for the equipment, and the belt drives are the quietest and most costly averaging between $170 and $350 each."}, {"url": "http://homeguides.sfgate.com/much-garage-door-installation-cost-91051.html", "passage_text": "The national average cost of a garage door installation, including labor and material, ranges from $700.92 to $1,345.92, according to homewyse.com. Receiving bids from several reputable contractors can help you get the best value on installation costs."}]