[{"url": "https://en.wikipedia.org/wiki/Polybutylene", "passage_text": "Polybutylene (polybutene-1, poly(1-butene) , PB-1) is a polyolefin or saturated polymer with the chemical formula (C 4 H 8) n. It should not be confused with polybutene, a low molecular weight oligomer. Polybutylene is produced by polymerisation of 1-butene using supported Ziegler-Natta catalysts. PB-1 is a high molecular weight, linear, isotactic, and semi-crystalline polymer"}, {"url": "http://aztecplumbing.net/blog/what-is-polybutylene-piping", "passage_text": "The piping is a form of plastic resin that was used extensively for water supply piping between the years of 1978 and 1995. It’s estimated that 1 out of 5 homes had polybutylene piping installed within the years of manufacturing. Over time, polybutylene piping loses its strength and becomes brittle, sometimes even scaling or flaking. Micro-fractures result and the basic structural integrity of the system is reduced. It’s believed that the oxidants in water, such as chlorine, are what cause polybutylene to break down and lose its resilience."}, {"url": "http://porch.com/advice/polybutylene-piping-concerns-risks-resolutions/", "passage_text": "Replacing polybutylene piping in the home. Unfortunately, if there are polybutylene pipes within the home, or leading into the home, the best course of action is to replace the pipes entirely by hiring a re-pipe specialist. An expert can assess the current plumbing, replace the pipes and expertly patch up any holes."}, {"url": "http://porch.com/advice/polybutylene-piping-concerns-risks-resolutions/", "passage_text": "Email. Polybutylene piping is a form of plastic resin and was commonly used for plumbing U.S. homes built between 1978 and 1995. Due to its inexpensive production cost and ability to withstand high water pressure, it was widely seen as a better, cheaper alternative to copper plumbing. Unfortunately, if there are polybutylene pipes within the home, or leading into the home, the best course of action is to replace the pipes entirely by hiring a re-pipe specialist. An expert can assess the current plumbing, replace the pipes and expertly patch up any holes."}, {"url": "http://www.greeneinsurance.com/blog/2015/02/03/what-is-polybutylene-pipes-and-plumbing.aspx", "passage_text": "Polybutylene is simply a type of plumbing material that was manufactured between the late 70's and early 90's. It is thought that it was installed in over 6 million homes during that time period. Polybutylene was originally thought to be a versatile and inexpensive product to use. If the PB bursts it can cause major, immediate water damage. Polybutylene-main plumbing Imprint PB 2110 What are we looking for? Polybutylene usually has the PB2110 stamp on it, as seen in the photo at right. However, not all PB will be marked so there are a few other ways to determine if it's PB."}, {"url": "http://www.deltamechanical.com/polybutylene-pipe-replacement/", "passage_text": "The presence of Polybutylene pipe can severely affect a home’s value on the real estate market. WHAT IS POLYBUTYLENE. Polybutylene is a plastic resin used to make water pipes. Polybutylene Pipe, (a Polymer) was manufactured for installation in the United States from the late 1978 to 1995. Polybutylene was the next big wonder product; cheap to produce, easy to install and no maintenance. Any repair to the piping is strictly temporary. WHAT IS THE SOLUTION. If you have Polybutylene pipes in your home, it is a matter of when, not if you will have leaks. The only real solution to the Polybutylene problem is to completely repipe the Potable water system in yourhome."}, {"url": "http://www.thehomeinspector.com/Newsletter/Wicklund/1WicklundIndex.html", "passage_text": "PEX is the plastic piping that came about to replace the polybutylene. As a general rule you can assume that it is PEX if it any volor but gray if it was installed after 1998 and polybutylene if it was installed before 1993. The five year transition period could have either piping installed. We usually think of polybutylene pipe as being plastic and gray in color. It does come in some other colors, such as blue, white, and black. Look at the photo to the right. It shows four different pipes above a water heater."}, {"url": "http://www.thehomeinspector.com/Newsletter/Wicklund/1WicklundIndex.html", "passage_text": "The polybutylene was used for the water softener upgrade and was only found in this one area as it spliced the added water softener into the original plumbing system. PEX-The white pipe is white plastic PEX. Pex comes in white, blue, orange, red, and even a more translucent milky white clear. We usually think of polybutylene pipe as being plastic and gray in color. It does come in some other colors, such as blue, white, and black. Look at the photo to the right. It shows four different pipes above a water heater."}]