[{"url": "http://home.howstuffworks.com/appliances/energy-efficient/question121.htm", "passage_text": "Therefore, you want your refrigerator to be cold, but not so cold that it freezes things. The preferred temperature is somewhere between 35 and 38 degrees F (1.7 to 3.3 degrees C). Anything higher and foods will spoil too quickly (it also presents food poisoning problems, as described in several of the links below)."}, {"url": "http://www.ehow.com/info_8056888_temp-should-refrigerator.html", "passage_text": "Everyone should have a refrigerator thermometer to monitor temperature. Buy the best quality thermometer that you can afford. To check the temperature of your refrigerator, put a glass of water in the middle of the refrigerator and put the thermometer in it. Wait 8 hours before checking temperature. While maintenance-free for the most part, some things like temperature setting do need attention. For the safest food, your refrigerator should stay between 32 and 40 degrees Fahrenheit. According to Home Food Safety, one out of three consumers incorrectly considers the refrigerator dial accurate."}, {"url": "http://www.fda.gov/ForConsumers/ConsumerUpdates/ucm093704.htm", "passage_text": "1 Keep the refrigerator temperature at or below 40° F (4° C). 2  The freezer temperature should be 0° F (-18° C). 3  Check temperatures periodically. 4  Appliance thermometers are the best way of knowing these temperatures and are generally inexpensive. 1 Also, when putting food away, don't crowd the refrigerator or freezer so tightly that air can't circulate. 2  Keep your appliances at the proper temperatures. 3  Keep the refrigerator temperature at or below 40° F (4° C). 4  The freezer temperature should be 0° F (-18° C). 5  Check temperatures periodically."}, {"url": "http://www.answers.com/Q/What_is_the_proper_temperature_for_a_refrigerator", "passage_text": "Average temperature of a refrigerator is 35 - 38 degrees and -18 °C (0 °F) for the freezer. A household refrigerator should be maintained between 34 and 40 degrees Fahrenheit-just above freezing to maintain food quality but low enough to inhibit bacterial growth. Ideally your refrigerator should be at the correct temperature (less than 4°C). When the fridge is very full, turn thermostat to Colder setting. If in doubt about your fridge's efficiency check it with a fridge thermometer. Various Answers The refrigerator should be at about 35°F (1.6°C) which is above freezing, so your milk won't freeze. The refrigerator should be set between 40°F and 34°F (~4.4°C to 1.1°C). The closer it gets to freezing (32°F or 0°C), the longer the food will keep"}, {"url": "http://www.ehow.com/info_8056888_temp-should-refrigerator.html", "passage_text": "Food kept between 40 degrees and 140 degrees Fahrenheit for longer than two hours should be considered risky. Bacteria that cause food poisoning multiply readily in this range. Refrigeration at the proper temperature will not kill bacteria, but will slow growth considerably. While maintenance-free for the most part, some things like temperature setting do need attention. For the safest food, your refrigerator should stay between 32 and 40 degrees Fahrenheit. According to Home Food Safety, one out of three consumers incorrectly considers the refrigerator dial accurate."}, {"url": "http://www.fda.gov/Food/ResourcesForYou/Consumers/ucm253954.htm", "passage_text": "1 If you do lose power, keep the doors to your fridge and freezer closed as much as possible to keep foods cold. 2  Before using any foods, check your refrigerator and freezer thermometers. 3  If the fridge is still at or below 40 °F, or the food has been above 40 °F for only two hours or less, it should be safe to eat. "}, {"url": "http://www.digitaltrends.com/home/what-temperature-should-my-fridge-be/", "passage_text": "The FDA advises that you should keep the temperature of your fridge between 32 and 40 degrees Fahrenheit, preferably right in the middle of that range, at, say, 35 degrees. Set the temperature at 35, and you avoid the risk of frozen food (that’s what the freezer’s for!) and you avoid the risk of spoilage. "}, {"url": "http://lifehacker.com/what-temperature-should-you-keep-your-refrigerator-set-533534221", "passage_text": "In order to keep food out of the Danger Zone, your fridge must be set between 32-40° F (0-4 degrees Celsius). Your freezer must be below 32° F (0° Celsius). I keep mine as cold as it will go. Keep your freezer efficient by half-filling it with bottles of water. You're not hugging the danger zone like you would be at 40° F (4.4° C), and you're distancing yourself sufficiently from 32° F (0° C) that you don't freeze half the stuff in your refrigerator."}]