[{"url": "http://www.kgs.ku.edu/Extension/geotopics/earth_age.html", "passage_text": "Radiometric dating works best on igneous rocks, which are formed from the cooling of molten rock, or magma. As magma cools, radioactive parent isotopes are separated from previously formed daughter isotopes by the crystallization process. (The nucleus of an atom is made up of protons and neutrons.) For example, the element carbon, which always has six protons in its nucleus, has three isotopes: one with six neutrons in the nucleus, one with seven, and one with eight. Some isotopes are stable, but some are unstable or radioactive."}, {"url": "http://www.minerals.net/resource/property/radioact.aspx", "passage_text": "MINERAL PROPERTIES: RADIOACTIVITY. Radioactivity is an attribute of minerals that contain radioactive element s. Radioactive elements are elements that contain disintegrating nuclei, emitting alpha rays, beta rays, and gamma rays. Uranium and thorium are the best known radioactive elements. "}, {"url": "http://pubs.usgs.gov/gip/geotime/radiometric.html", "passage_text": "106 billion years. The mathematical expression that relates radioactive decay to geologic time is called the age equation and is: Dating rocks by these radioactive timekeepers is simple in theory, but the laboratory procedures are complex. Most sedimentary rocks such as sandstone, limestone, and shale are related to the radiometric time scale by bracketing them within time zones that are determined by dating appropriately selected igneous rocks, as shown by a hypothetical example."}, {"url": "http://pubs.usgs.gov/gip/geotime/radiometric.html", "passage_text": "Another important atomic clock used for dating purposes is based on the radioactive decay of the isotope carbon-14, which has a half-life of 5,730 years. Carbon-14 is produced continuously in the Earth's upper atmosphere as a result of the bombardment of nitrogen by neutrons from cosmic rays. Most sedimentary rocks such as sandstone, limestone, and shale are related to the radiometric time scale by bracketing them within time zones that are determined by dating appropriately selected igneous rocks, as shown by a hypothetical example."}, {"url": "https://en.wikipedia.org/wiki/Radiometric_dating", "passage_text": "Radiometric dating (often called radioactive dating) is a technique used to date materials such as rocks or carbon, in which trace radioactive impurities were selectively incorporated when they formed. Example of a radioactive decay chain from lead-212 (212 Pb) to lead-208 (208 Pb) . Each parent nuclide spontaneously decays into a daughter nuclide (the decay product) via an α decay or a β− decay. The final decay product, lead-208 (208 Pb), is stable and can no longer undergo spontaneous radioactive decay."}, {"url": "http://www.webmineral.com/help/Radioactivity.shtml", "passage_text": "Radioactive accessory minerals such as zircon may contribute to the radioactivity of a mineral which is otherwise non-radioactive by calculation. Many granites or other igneous rocks contain some radioactivity because of minor, but highly radioactive, accessory minerals. re = mineral density (S Atomic number / Molecular Weight) where re is the electron density in grams/cc. Definition. Radioactivity in minerals are caused by the inclusion of naturally-occurring radioactive elements in the mineral's composition. The degree of radioactivity is dependent on the concentration and isotope present in the mineral. For the most part, minerals that contain potassium (K), uranium (U), and thorium (Th) are radioactive. This table lists all of the naturally-occurring radioactive isotopes. Mineral radioactivity is due to alpha, beta, and gamma radiation from the unstable isotopes in the composition"}, {"url": "http://physics.isu.edu/radinf/natural.htm", "passage_text": "They are even found in us, being that we are products of our environment. Every day, we ingest and inhale radionuclides in our air and food and the water. Natural radioactivity is common in the rocks and soil that makes up our planet, in water and oceans, and in our building materials and homes. There is nowhere on Earth that you can not find Natural Radioactivity. Radioactive elements are often called radioactive isotopes or radionuclides or just nuclides. "}, {"url": "http://geomaps.wr.usgs.gov/parks/gtime/ageofearth.html", "passage_text": "Hafnium-176. 35.9. Radiometric dating using the naturally-occurring radioactive elements is simple in concept even though technically complex. If we know the number of radioactive parent atoms present when a rock formed and the number present now, we can calculate the age of the rock using the decay constant. 1 The oldest rocks on Earth, found in western Greenland, have been dated by four independent radiometric dating methods at 3.7-3.8 billion years. 2  Rocks 3.4-3.6 billion years in age have been found in southern Africa, western Australia, and the Great Lakes region of North America."}, {"url": "http://www.kgs.ku.edu/Extension/geotopics/earth_age.html", "passage_text": "Age of the Earth. Scientists determined the Earth's age using a technique called radiometric dating. Radiometric dating is based upon the fact that some forms of chemical elements are radioactive, which was discovered in 1896 by Henri Becquerel and his assistants, Marie and Pierre Curie. The discovery gave scientists a tool for dating rocks that contain radioactive elements. (The nucleus of an atom is made up of protons and neutrons.) For example, the element carbon, which always has six protons in its nucleus, has three isotopes: one with six neutrons in the nucleus, one with seven, and one with eight. Some isotopes are stable, but some are unstable or radioactive."}]