[{"url": "http://www.answers.com/Q/What_is_the_normal_range_for_basophils", "passage_text": "Body temperatures vary, even within humans. The adult average is lower than 37° C, and skin temperature can vary from around 32° to 35° C (90° to 95° F), and will be cold … er when losing heat to the environment. The body temperatures of mammals range from around 97° to over 103° Fahrenheit. Birds have average temperatures of around 105° Fahrenheit. The phi point between the freezing temperature (32° F) and the boiling temperature (212° F) of water is 100.8° F, or 38.2° Centigrade."}, {"url": "http://www.cmlsupport.org.uk/section/normal-blood-counts", "passage_text": "The normal range of the percentage of neutrophils is between 45% and 70%. More important than the percentage of neutrophils is the absolute neutrophil count (ANC) , which should fall between 1.0 to 8.0 k/ul. The normal range of ALT levels is between 5 IU/L (International Units per Liter) and 60 IU/L. The normal range of AST levels is between 5 IU/L and 43 IU/L. Elevated liver enzymes may be a sign of hepatotoxicity (liver toxicity)."}, {"url": "http://www.lymphomation.org/CBC-blood-counts.htm", "passage_text": "Your doctor will sometimes schedule a Complete Blood Count (CBC) blood test to monitor your health, watch for indirect indications of disease direction, and side effects of treatment. Reference ranges and unit measurements can vary per lab. And what is normal can also vary per person and race. If your lab results are outside the normal range, we suggest that you discuss with your doctor. Often it is not the result, but the change from a previous test that is most instructive. For best comparisons of lab results, the tests should be done in the same lab. Range 11.0 - 15.0. Measures the range of sizes of red blood cells in a blood sample. RDW results are often used together with MCV results to determine possible cause of anemia when anemia is indicated by other test results."}, {"url": "http://orthomolecular.org/library/jom/2006/pdf/2006-v21n02-p107.pdf", "passage_text": "The fractions represent a mathematical figure since it is impossible to count less than one basophil. ‘= Normal absolute basophil count is the percent of basophils counted per 100 cells times the total white blood cell count. The normal range is 0.0 to 216 μL. *= Normal total WBC count by our method is 4600 to 10800 K μL. As Table 1 shows, the basophils in-enic group were in the accepted normal range.The lack of correlation between blood histamine and basophil count in these patients compared with previous reports is difficult to explain."}, {"url": "http://effectivediagnosis.org/absolute-basophils-blood-test/", "passage_text": "Although they make up only a small portion of the total white blood cells normally present, basophils play an important part and are responsible for the release of histamines and other chemicals. Often the release of histamines, in response to exposure to mold or dander, will result in some of the symptoms of asthma. "}, {"url": "http://www.cmlsupport.org.uk/section/normal-blood-counts", "passage_text": "Normal Ranges. The normal range describes the range where 95% of the normal healthy population will lie. This also means that there is 5% of the normal healthy population will fall outside the normal range, however they too are normal. Normal ranges are a guide. The normal range of ALT levels is between 5 IU/L (International Units per Liter) and 60 IU/L. The normal range of AST levels is between 5 IU/L and 43 IU/L. Elevated liver enzymes may be a sign of hepatotoxicity (liver toxicity)."}, {"url": "http://emedicine.medscape.com/article/2090595-overview", "passage_text": "The serum reference ranges of eosinophils are as follows: Eosinophils blood (%): 0.0-6.0 (This range may vary slightly in different laboratories.). Eosinophil blood count (absolute): 30-350. The percentage of eosinophils is multiplied by the white blood cell count to give the absolute eosinophil count. "}, {"url": "http://www.cmlsupport.org.uk/section/normal-blood-counts", "passage_text": "The Basophils should remain within the normal range, generally between 0% and 2%. Some clinicians believe that, as in the case of neutrophils, the absolute basophil count is more important than the percentage of basophils and should fall between 0 to 0.3 k/ul. The normal range of ALT levels is between 5 IU/L (International Units per Liter) and 60 IU/L. The normal range of AST levels is between 5 IU/L and 43 IU/L. Elevated liver enzymes may be a sign of hepatotoxicity (liver toxicity)."}, {"url": "https://en.wikipedia.org/wiki/Basophil_granulocyte", "passage_text": "3D Rendering of a Basophil Granulocyte. Basophil granulocytes, mostly referred to as basophils, are the least common of the granulocytes, representing about 0.01% to 0.3% of circulating white blood cells. Standard Range is 0.0 - 2.0 % via differential blood count. Basopenia (a low basophil count) is difficult to demonstrate as the normal basophil count is so low; it has been reported in association with autoimmune urticaria (a chronic itching condition). Basophilia is also uncommon but may be seen in some forms of leukaemia or lymphoma."}]