[{"url": "http://www.accountingtools.com/weighted-average-method", "passage_text": "When using the weighted average method, divide the cost of goods available for sale by the number of units available for sale, which yields the weighted-average cost per unit. In this calculation, the cost of goods available for sale is the sum of beginning inventory and net purchases. The ending inventory valuation is $45,112 (175 units × $257.78 weighted average cost), while the cost of goods sold valuation is $70,890 (275 units × $257.78 weighted average cost). The sum of these two amounts (less a rounding error) equals the $116,000 total actual cost of all purchases and beginning inventory"}, {"url": "http://www.wikihow.com/Calculate-Weighted-Average", "passage_text": "List the weight next to the number. 1  Percentages are common because weights are often a percentage of a total of 100. 2  If you are figuring out the weighted average of grades, investments and other financial data, look for the percentage of the occurrence out of 100. Multiply each number by its weight. 1  You can choose to write this at the end of the chart or to do it on 1 line, in a formula. 2  For example, if you are trying to figure out the weighted average of certain grades, you might write 0.9(0.25) to indicate a 90 percent grade times 25 percent of the total grade."}, {"url": "https://en.wikipedia.org/wiki/Weighted_arithmetic_mean", "passage_text": "When a weighted mean is used, the variance of the weighted sample is different from the variance of the unweighted sample. The biased weighted sample variance is defined similarly to the normal biased sample variance: where, which is 1 for normalized weights. For example, consider the weighted mean of the point [1 0] with high variance in the second component and [0 1] with high variance in the first component."}, {"url": "http://www.twc.state.tx.us/news/efte/i_employees_two_rates.html", "passage_text": "If you are using the weighted average method, you would take her earnings from the clerical job (44.5 hours at $10/hour, or $445.00) plus her earnings from answering the phone at home (8 hours at $8/hour, or $64.00), to get a total of $509.00. The default method under the regulations is the weighted average method, found in 29 C.F.R. 778.115. The other method is allowed under section 207(g)(2) of the Act and is explained in regulation 29 C.F.R. 778.419."}, {"url": "http://www.accountingtools.com/weighted-average-method", "passage_text": "Weighted Average Method Overview. The weighted average method is used to assign the average cost of production to a product. Weighted average costing is commonly used in situations where: 1  Inventory items are so intermingled that it is impossible to assign a specific cost to an individual unit. The ending inventory valuation is $45,112 (175 units × $257.78 weighted average cost), while the cost of goods sold valuation is $70,890 (275 units × $257.78 weighted average cost). The sum of these two amounts (less a rounding error) equals the $116,000 total actual cost of all purchases and beginning inventory"}, {"url": "http://www.wikihow.com/Calculate-Weighted-Average", "passage_text": "A weighted average is a more accurate measurement of scores or investments that are of relative importance to each other. This is often the case with investment portfolios, grade scoring and other statistics. You can find out how to calculate weighted averages. Multiply each number by its weight. 1  You can choose to write this at the end of the chart or to do it on 1 line, in a formula. 2  For example, if you are trying to figure out the weighted average of certain grades, you might write 0.9(0.25) to indicate a 90 percent grade times 25 percent of the total grade."}, {"url": "https://en.wikipedia.org/wiki/Weight_function", "passage_text": "The result of this application of a weight function is a weighted sum or weighted average. Weight functions occur frequently in statistics and analysis, and are closely related to the concept of a measure. Weight functions can be employed in both discrete and continuous settings. A weight function is a mathematical device used when performing a sum, integral, or average to give some elements more weight or influence on the result than other elements in the same set."}, {"url": "http://www.businessdictionary.com/definition/weighted-average.html", "passage_text": "Mean in which each item being averaged is multiplied by a number (weight) based on the item's relative importance. The result is summed and the total is divided by the sum of the weights. Weighted averages are used extensively in descriptive statistical analysis such as index numbers. Also called weighted mean. Show more usage examples... The final exam for Ms. Merkel's European economics class is worth 35% of the total grade, and class participation is worth 65%; she is using a weighted average to calculate the final grade for each student."}, {"url": "http://www.twc.state.tx.us/news/efte/i_employees_two_rates.html", "passage_text": "In the situation of an employee who works two different jobs at two different rates of pay, the FLSA allows two different methods of computing the regular rate for overtime calculation purposes: 1) the weighted average and 2) the regular rate associated with the job that caused the overtime to occur. The default method under the regulations is the weighted average method, found in 29 C.F.R. 778.115. The other method is allowed under section 207(g)(2) of the Act and is explained in regulation 29 C.F.R. 778.419."}]