[{"url": "http://www.2dcurves.com/fractal/fractald.html", "passage_text": "George Cantor (1845-1918) constructed the Cantor dust. The curve is a base motif fractal which uses a square segment as base. The motif is to divide the square into nine equal parts and let only the outer four remain: The fractal dimension of the Cantor dust is equal to log4/log3, what is about 1.26186. A variant on this curve is given by the box fractal: divide the square into 9 equal parts and let the five diagonal parts remain. This curve is also named the anticross-stitch :"}, {"url": "https://sites.google.com/site/xxcantorxdustxx/", "passage_text": "sift through megabytes of data in seconds rapidly conceptualize a file identify based on patterns, not headers break out embedded types visualize data tampering investigate structure, a priori isolate areas of interest make no assumptions about the underlying data type even arbitrary data has a visual fingerprint. "}, {"url": "http://www.math.ubc.ca/%7ecass/courses/m308-03b/projects-03b/skinner/ex-dimension-cantors_dust.htm", "passage_text": "And when determining the dimension of the snowflake, we decided that the dimension of each line segment that makes up a fractal is the same as the dimension of the fractal itself. So for the capacity dimension of Cantor's dust, we can use P = 2 and S = 3: Just as expected, our result is between 0 and 1, somewhere between the dimension of a point and the dimension of a line. Georg Cantor invented this fractal to describe a set of numbers that he had defined, which is now called Cantor's set. It involves the unit interval in the ternary number system. As was stated in the fractal generation examples, this particular Lindenmayer fractal (shown above) is not so visually appealing but is mathematically interesting. This time, let's predict what type of value we will get for the capacity dimension of Cantor's dust. We have already noted that this fractal is produced by removing the middle third of every line at each iteration, and thus the limit of its length is zero (even though the limit of the number of lines is infinite)"}, {"url": "http://mathworld.wolfram.com/CantorSet.html", "passage_text": "Cantor Set. The Cantor set, sometimes also called the Cantor comb or no middle third set (Cullen 1968, pp. 78-81), is given by taking the interval (set), removing the open middle third (), removing the middle third of each of the two remaining pieces (), and continuing this procedure ad infinitum. It is therefore the set of points in the interval whose ternary expansions do not contain 1, illustrated above."}, {"url": "http://mathworld.wolfram.com/CantorDust.html", "passage_text": "Cantor Dust. Cantor dust is a fractal that can be constructed using string rewriting beginning with a cell [0] and iterating the rules. (1). Let be the number of black boxes, the length of a side of a box, and the fractional area of black boxes after the th iteration, then. (2)."}, {"url": "http://infohost.nmt.edu/%7Eblewis/html/cantordust-student.html", "passage_text": "As we created each level of Cantor Dust fractal, each segment was replaced by the motif that had 2 pieces. Therefore, the # of pieces in our formula is 2. In addition, each new segment was 1/3 the original size of the segment length from the previous level. The total length of the fractal is getting shorter at each level. We can find the total length of the Cantor Dust fractal by studying how much has been removed at each level. The total length removed = (1/3)s + (2/9)s + (4/27)s + … + 2n-1/3n + … =. (1/3)s[1 + 2/3 + (2/3)2 + (2/3)3 + …] =."}, {"url": "http://infohost.nmt.edu/%7Eblewis/html/cantordust-student.html", "passage_text": "Since the Cantor Dust Fractal began with length 1s, and also a length of 1s is then removed, the total length of the Cantor Dust Fractal is length = 0 (after an infinite number of levels). The total length of the fractal is getting shorter at each level. We can find the total length of the Cantor Dust fractal by studying how much has been removed at each level. The total length removed = (1/3)s + (2/9)s + (4/27)s + … + 2n-1/3n + … =. (1/3)s[1 + 2/3 + (2/3)2 + (2/3)3 + …] =."}, {"url": "http://www.answers.com/Q/What_are_true_statements_about_cantor_dust", "passage_text": "Cantor dust is a dynamic visualization tool us for numerous computer applications. Firmware, forensics, and proprietary data formats all use cantor dust. "}, {"url": "http://mathed.uta.edu/kribs/fractal.html", "passage_text": "One of the earliest, and simplest, fractals is the Cantor set, or Cantor dust, defined by mathematician Georg Cantor (1845-1918). To create it, begin with a line segment (say, the segment from 0 to 1 on a number line), and remove the middle third. The Cantor set The Cantor set is a good example of an elementary fractal. The object first used to demonstrate fractal dimensions, figure 1c, is actually the Cantor set. The process of generating this fractal is very simple. The set is generated by the iteration of a single operation on a line of unit lenght."}]