[{"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/hbc/", "passage_text": "Cholesterol is a waxy, fat-like substance that’s found in all cells of the body. Your body needs some cholesterol to make hormones, vitamin D, and substances that help you digest foods. Your body makes all the cholesterol it needs. However, cholesterol also is found in some of the foods you eat. A high LDL level leads to a buildup of cholesterol in your arteries. (Arteries are blood vessels that carry blood from your heart to your body.). HDL cholesterol sometimes is called “good” cholesterol."}, {"url": "http://www.cholesterol-and-health.com/Cholesterol-Cell-Membrane.html", "passage_text": "Molecule for molecule, cholesterol can make up nearly half of the cell membrane. 1 Since it is smaller and weighs less than other molecules in the cell membrane, it makes up a lesser proportion of the cell membrane's mass, usually roughly 20 percent. 2. Cholesterol is also present in membranes of organelles inside the cells, although it usually makes up a smaller proportion of the membrane. Surrounding each of our cells is a membrane called the plasma membrane. The plasma membrane is a continuous double-layer of phospholipids, interweaved with cholesterol and proteins."}, {"url": "http://www.webmd.com/cholesterol-management/ss/slideshow-cholesterol-overview", "passage_text": "'Bad' Cholesterol. Most of the cholesterol in the blood is carried by proteins called low density lipoproteins or LDL. This is known as the bad cholesterol because it combines with other substances to clog the arteries. A diet high in saturated fats and trans fats tends to raise the level of LDL cholesterol. The body converts excess calories, sugar, and alcohol into triglycerides, a type of fat that is carried in the blood and stored in fat cells throughout the body. People who are overweight, inactive, smokers, or heavy drinkers tend to have high triglycerides, as do those who eat a very high-carb diet."}, {"url": "http://cholesterol.emedtv.com/cholesterol/cholesterol.html", "passage_text": "Cholesterol is a soft, waxy substance found in all of your body's cells. Your body needs it in order to work properly. This is because your body uses cholesterol to hold cells together. Your body also uses it to make hormones, vitamin D, and substances that help you digest foods. "}, {"url": "http://www.webmd.com/cholesterol-management/ss/slideshow-cholesterol-overview", "passage_text": "The liver produces 75% of the cholesterol that circulates in our blood. The other 25% comes from food. At normal levels, cholesterol actually plays an important role in helping cells do their jobs. But cholesterol levels are precariously high in more than 100 million Americans. The body converts excess calories, sugar, and alcohol into triglycerides, a type of fat that is carried in the blood and stored in fat cells throughout the body. People who are overweight, inactive, smokers, or heavy drinkers tend to have high triglycerides, as do those who eat a very high-carb diet."}, {"url": "http://courses.washington.edu/conj/bess/cholesterol/liver.html", "passage_text": "1 Additionally, excess cholesterol from cells is brought back to the liver by HDL in a process known as reverse cholesterol transport (green pathway). 2  HDL (or really, the HDL precursor) is synthesized and secreted by the liver and small intestine. 1 The liver removes LDL and other lipoproteins from the circulation by receptor-mediated endocytosis. 2 "}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/hbc/", "passage_text": "LDL cholesterol sometimes is called “bad” cholesterol. A high LDL level leads to a buildup of cholesterol in your arteries. (Arteries are blood vessels that carry blood from your heart to your body.). HDL cholesterol sometimes is called “good” cholesterol. This is because it carries cholesterol from other parts of your body back to your liver"}, {"url": "http://nihseniorhealth.gov/highbloodcholesterol/whatishighbloodcholesterol/01.html", "passage_text": "High-density lipoproteins (HDL) carry cholesterol away from the cells in your body. HDL cholesterol is sometimes called good cholesterol because it helps remove cholesterol from your artery walls. The liver then removes the cholesterol from your body. Click for more information. Cholesterol is found in all parts of your body. It plays a vital role in your body. It makes hormones, helps you digest food, and supports the workings of all the cells in your body. But your liver makes all the cholesterol that your body needs to do this."}, {"url": "http://courses.washington.edu/conj/bess/cholesterol/liver.html", "passage_text": "The liver is central to the regulation of cholesterol levels in the body. Not only does it synthesize cholesterol for export to other cells, but it also removes cholesterol from the body by converting it to bile salts and putting it into the bile where it can be eliminated in the feces. 1 The liver removes LDL and other lipoproteins from the circulation by receptor-mediated endocytosis. 2  Additionally, excess cholesterol from cells is brought back to the liver by HDL in a process known as reverse cholesterol transport (green pathway)."}, {"url": "http://www.livestrong.com/article/31887-function-cholesterol-body/", "passage_text": "Cholesterol is a structural component of cells. Cholesterol along with polar lipids make up the structure of each and every cell in our bodies. Cholesterol is there to basically provide a protective barrier. Most people think of cholesterol in a negative way. However, cholesterol actually plays a very important role in the functioning of the body. According to The Mayo Clinic, cholesterol is found in every cell in our body and without it our bodies would not function properly."}]