[{"url": "http://www.wikihow.com/Breed-Beef-Cattle", "passage_text": "1 Some bulls, depending on the fertility rate of the cows and how many cows are in heat at one time, can breed over 50 cows in one season. 2  Body condition score your cows and heifers 30 days before breeding season. 3  They need to be at around a Cdn BCS of 2.5 to 3 to be ready to breed."}, {"url": "http://www.wikihow.com/Breed-Cows-and-Heifers-Naturally", "passage_text": "Purchase a good herd bull. Make sure the bull is a calving-ease bull if you are wanting to naturally breed heifers, or a herd bull that is selected to improve your cow-herd, not disprove it. Look at the breed[s] your cows are made up of and choose your bull from there."}, {"url": "http://www.wikihow.com/Breed-Beef-Cattle", "passage_text": "Monitor your bulls and cows during breeding season. If you have one too many bulls for your herd, there may be more fighting than mating. 1  Running bull[s] under 4 years of age with older bull[s] may prevent cows from being serviced by the bull with the highest fertility."}, {"url": "http://www.wikihow.com/Breed-Beef-Cattle", "passage_text": "1 The optimum bull-to-cow ratio is 1 bull per 10 to 30 cows, depending on the size of the pasture, and the bull's age, promiscuity/libido and experience. 2  Some bulls, depending on the fertility rate of the cows and how many cows are in heat at one time, can breed over 50 cows in one season."}, {"url": "http://www.wikihow.com/Breed-Beef-Cattle", "passage_text": "1 Body condition score your cows and heifers 30 days before breeding season. 2  They need to be at around a Cdn BCS of 2.5 to 3 to be ready to breed. 3  Heifers should be at a Cdn BCS of 3 to 3.5 to be ready to be bred. 4  Anything lower or higher than that will decrease fertility in your herd."}, {"url": "http://www.wikihow.com/Breed-Cows-and-Heifers-Naturally", "passage_text": "5. Keep the bull in for as long as your breeding season entails. This can range from 45 days to 120 days. Ideally, you should have your breeding season between 45 to 60 days, but of course this varies between farm to farm and ranch to ranch. 1  Check the breeding herd[s] regularly to check up on the bull's progress with breeding the cows/heifers."}, {"url": "http://www.answers.com/Q/How_long_does_the_bull_breed_the_cow", "passage_text": "Maximum is 25 to 50 cows in one breeding season. Younger yearling bulls tend to service 15 to 30 cows/heifers in one season. Some farms can only afford to have a bull per 10 … cows if the pastures are too large for one bull to cover 20 or 50 female"}]