[{"url": "http://www.ehow.com/about_7505638_much-do-emts-make-hour.html", "passage_text": "By Location. EMTs in the state of Washington had the highest average wage by state, according to the BLS, at $27.35 per hour. The District of Columbia was next, at $26.65 per hour. Illinois was third, at $23.72. Average hourly wages in this industry were $15.17, according to the BLS. Local government technicians had the highest hourly wage, at $19.12. EMTs who worked for general medical and surgical hospitals averaged $16.97 per hour."}, {"url": "http://www.paramedictrainingspot.com/paramedic-salary-in-wyoming/", "passage_text": "And a flight paramedic salary makes $28,306 every year. In Rock Springs, EMTs make $23,745 per year. Paramedics earn $30,101 each year. And a flight paramedic pulls in $32,206 annually. Using Salary.com as our guide, let’s see how the salaries for EMTs, paramedics, and flight medics compare in the largest cities in Wyoming (by population). In Cheyenne, EMTs earn $26,927 annually. Paramedics earn $34,135. And flight paramedics make $36,522 in yearly income. In Casper, EMTs make $26,927"}, {"url": "http://www.paramedictrainingspot.com/paramedic-salary-in-wyoming/", "passage_text": "As you can see, paramedics in Wyoming make quite a bit less than the national average. In fact, paramedics in cities such as Cheyenne, Casper, and Laramie make $3,000 to $4,000 less than the national average (according to Salary.com), while a city like Gillette makes almost $10,000 less than the national average. Using Salary.com as our guide, let’s see how the salaries for EMTs, paramedics, and flight medics compare in the largest cities in Wyoming (by population). In Cheyenne, EMTs earn $26,927 annually. Paramedics earn $34,135. And flight paramedics make $36,522 in yearly income. In Casper, EMTs make $26,927"}, {"url": "http://www1.salary.com/WY/Paramedic-salary.html", "passage_text": "New Search Wyoming Paramedic SalariesNew SearchWithin Wyoming there is a lot of variation in Paramedic Salaries. These variations depend on on a wide range of factors from population to general competitiveness in the market. Below is a map displaying a few key cities in Wyoming and surrounding states, click on any one to find Paramedic Salaries for that area. "}, {"url": "http://www.paramedictrainingspot.com/paramedic-salary-in-washington/", "passage_text": "Using Salary.com as our guide, let’s see how the salaries for EMTs, paramedics, and flight medics compare in the largest cities in Washington (by population). In Seattle, EMTs make $32,691 every year. Paramedics make an average of $41,442 per year. And flight medics make $44,340 annually. In Spokane, EMTs make $30,268 every year. Paramedics make an average of $38,371 per year. And flight medics make $41,054 annually. In Tacoma, EMTs make $32,662 every year. Paramedics make an average of $41,405 per year. According to the U.S. Bureau of Labor Statistics (BLS), EMTs and paramedics earn an annual average salary of $34,030. On Salary.com, that number is a little higher for paramedics specifically, averaging out to $38,347."}, {"url": "http://www.emtexamace.com/after-emt-basic-certifiction-salary-of-emt-basic", "passage_text": "EMT Pay Levels Vary from State to State. The salaries received by EMTs vary according to the state they live in. Some states pay as little as $8.37 while other states pay EMTs much more. Average Hourly Wage by State. 1  Alabama: $14.56. 2  Alaska: $23.10. 3  Arkansas: $13.85. 4  Arizona: $15.00. 5  California: $17.37. 6  Colorado: $17.60. "}, {"url": "http://www.ehow.com/about_7505638_much-do-emts-make-hour.html", "passage_text": "Ambulatory care was the most prominent employment sector for EMTs. Average hourly wages in this industry were $15.17, according to the BLS. Local government technicians had the highest hourly wage, at $19.12. EMTs who worked for general medical and surgical hospitals averaged $16.97 per hour."}, {"url": "http://www1.salary.com/Paramedic-salary.html", "passage_text": "For example the median expected annual pay for a typical Paramedic in the United States is $39,953 so 50% of the people who perform the job of Paramedic in the United States are expected to make less than $39,953. Source: HR Reported data as of October 2015. Median $39,953. "}]