[{"url": "https://en.wikipedia.org/wiki/Deletion_%28genetics%29", "passage_text": "Deletion on a chromosome. In genetics, a deletion (also called gene deletion, deficiency, or deletion mutation) (sign: δ) is a mutation (a genetic aberration) in which a part of a chromosome or a sequence of DNA is lost during DNA replication. Any number of nucleotides can be deleted, from a single base to an entire piece of chromosome. The smallest single base deletion mutations are believed occur by a single base flipping in the template DNA, followed by template DNA strand slippage, within the DNA polymerase active site."}, {"url": "http://www.answers.com/Q/What_is_deletion_mutation", "passage_text": "The addition or deletion of a nucleotide can lead to a Frameshift mutation. The Frameshift mutation causes a shift in the reading frame of the codons in the mRNA. This may l … ead to the change in the amino acid sequence at protein translation. "}, {"url": "https://en.wikipedia.org/wiki/DNA_mutations", "passage_text": "Mutation can result in several different types of change in sequences. Mutations in genes can either have no effect, alter the product of a gene, or prevent the gene from functioning properly or completely. Mutations can also occur in nongenic regions. In biology, a mutation is a permanent change of the nucleotide sequence of the genome of an organism, virus, or extrachromosomal DNA or other genetic elements."}, {"url": "http://greengenes.lbl.gov/cgi-bin/JD_Tutorial/nph-Mutations.cgi", "passage_text": "Of the three types of point mutations the most harmful are insertions and deletions. They result in what is known as a frameshift mutation. When a nucleotide base is either inserted or deleted it disrupts the amino acids coded for from the site of the mutation on to the end of the gene. "}, {"url": "http://www.nature.com/scitable/topicpage/DNA-Is-Constantly-Changing-through-the-Process-6524898", "passage_text": "Figure Detail. Insertion or deletion of one or more nucleotides during replication can also lead to another type of mutation known as a frameshift mutation. The outcome of a frameshift mutation is complete alteration of the amino acid sequence of a protein. "}, {"url": "http://www.nature.com/scitable/definition/frameshift-mutation-frame-shift-mutation-frameshift-203", "passage_text": "frameshift mutation / frame-shift mutation; frameshift. A frameshift mutation is a genetic mutation caused by a deletion or insertion in a DNA sequence that shifts the way the sequence is read. A DNA sequence is a chain of many smaller molecules called nucleotides. "}, {"url": "http://ghr.nlm.nih.gov/handbook/mutationsanddisorders/possiblemutations", "passage_text": "This type of mutation is a change in one DNA base pair that results in the substitution of one amino acid for another in the protein made by a gene. A nonsense mutation is also a change in one DNA base pair. Instead of substituting one amino acid for another, however, the altered DNA sequence prematurely signals the cell to stop building a protein. This type of mutation results in a shortened protein that may function improperly or not at all."}, {"url": "http://www.biology-online.org/dictionary/Deletion_mutation", "passage_text": "Deletion mutation. Definition. noun. A type of gene mutation wherein the deletion (as well as addition) of (a number of) nucleotide (s) causes a shift in the reading frame of the codons in the mRNA, thus, may eventually lead to the alteration in the amino acid sequence at protein translation. Supplement."}, {"url": "http://ghr.nlm.nih.gov/handbook/mutationsanddisorders/possiblemutations", "passage_text": "Frameshift mutation (illustration). This type of mutation occurs when the addition or loss of DNA bases changes a gene’s reading frame. A reading frame consists of groups of 3 bases that each code for one amino acid. A frameshift mutation shifts the grouping of these bases and changes the code for amino acids. A nonsense mutation is also a change in one DNA base pair. Instead of substituting one amino acid for another, however, the altered DNA sequence prematurely signals the cell to stop building a protein. This type of mutation results in a shortened protein that may function improperly or not at all."}, {"url": "http://www.georgetownisd.org/cms/lib/TX01001838/Centricity/Domain/789/Mutations_-_WS_-_KEY.docx", "passage_text": "There are several types of mutation: DELETION (a base is lost) INSERTION (an extra base is inserted) Deletion and insertion may cause what’s called a FRAMESHIFT, meaning the reading “frame” changes, changing the amino acid sequence. "}]