[{"url": "https://bestplacesintheworldtoretire.com/questions-and-answers/2649-what-type-of-government-does-belize-have,-and-is-the-government-in-belize-stable", "passage_text": "0 1. Belize has a stable parliamentary democracy where there are two parties: the United Democratic Party and People's United Party-the UDP and the PUP. I would probably equate the PUP with more of the liberal philosophy and the UDP more of the conservative philosophy. Belize, formally known as British Honduras, gained its independence in 1981 from England. Their current government is based on the British Parliamentary, and has a democratically elected Prime Minister and cabinet. They follow British Common Law. There are two primary parties in Belize, the Red and the Blue party."}, {"url": "http://www.answers.com/Q/What_type_of_government_does_Belize_have", "passage_text": "Queen Elizabeth II is the head of state of Belize, however, the  country has a prime minister that is the head of the government. As  of July 2014, Dean Barrow is the Prime … Minister. Belize is a country on the northeastern coast of Central America  and is the only Central American country where English is an  official language. It is bordered on the west … and south by  Guatemala and on the north by Mexico."}, {"url": "http://www.infoplease.com/country/belize.html", "passage_text": "Geography. Belize is situated on the Caribbean Sea, south of Mexico and east and north of Guatemala in Central America. In area, it is about the size of New Hampshire. Most of the country is heavily forested with various hardwoods. Mangrove swamps and cays along the coast give way to hills and mountains in the interior. "}, {"url": "http://globaledge.msu.edu/countries/belize/government/", "passage_text": "Government Control of Economy Scale ranks countries on a basis of 1-100, with 100 representing the greatest amount of economic autonomy from government intervention. The queen/governor-general is the chief of state representing the commonwealth for ceremonies and appoints cabinet from advice of the prime minister. The prime minister advises the governor-general on the executive duties of the government. "}, {"url": "http://world-leaders.findthedata.com/l/39/Belize", "passage_text": "Overview. Belize is a Parliamentary Democracy whose current leader is Chief Executive Dean Oliver Barrow. The chief executive in Belize typically has a term length of 5 years. Belize's Legislature has 31 seats, and the last legislative elections were in 2008. "}, {"url": "https://en.wikipedia.org/wiki/Politics_of_Belize", "passage_text": "Belize is a constitutional monarchy and parliamentary, its democracy is based on the Westminster model. Belize is a member of the Commonwealth of Nations. Queen Elizabeth II is head of state and is represented in the country by Governor General Dr. Colville N. Young, Sr., a Belizean and Belize's second governor general. The primary executive organ of government is the Cabinet led by a Prime Minister (head of government). Legislative power is vested in both the government and the Parliament of Belize. The party system is dominated by the center-left People's United Party and the center-right United Democratic Party. There have been other small parties that have participated at all levels of governmental elections in the past."}, {"url": "http://www.incorporatebelize.com/Belize.Government/", "passage_text": "Executive branch in Belize is represented by the Chief of State, the Head of Government and the Cabinet. The Chief of State is Queen Elizabeth II, represented by Governor General Sir Colville Young, Sr. The Head of Government is Prime Minister Said Wilbert Musa, the Deputy Prime Minister is John Briceno. Belize is a parliamentary democracy and constitutional monarchy which recognizes Queen Elizabeth II as Sovereign."}, {"url": "http://www.incorporatebelize.com/Belize.Government/", "passage_text": "Belize Government. Belize is a parliamentary democracy and constitutional monarchy which recognizes Queen Elizabeth II as Sovereign. Since Belize attained independence from Britain on September 21, 1981, its Government was stable and democratic"}, {"url": "https://en.wikipedia.org/wiki/Politics_of_Belize", "passage_text": "From Wikipedia, the free encyclopedia. Politics of Belize takes place in a framework of a parliamentary representative democratic monarchy, where by Queen Elizabeth II serves as head of state and the prime minister is the head of government, and of a multi-party system. Executive power is exercised by the government. Legislative power is vested in both the government and the Parliament of Belize. The party system is dominated by the center-left People's United Party and the center-right United Democratic Party. There have been other small parties that have participated at all levels of governmental elections in the past."}]