[{"url": "https://simple.wikipedia.org/wiki/Testicle", "passage_text": "Male mammals, including men, have two testicles, supported in a sac of skin below the penis called the scrotum. Along with the penis, testicles are called reproductory organs or sex organs. Only males have testicles; females have ovaries. In mammals, testicles can be very big or very small in relation to the size of the animal itself. The size has to do with the amount of sperm that the male animal needs to make. Some types of male animal generally only have one sexual partner at a time and are called monogamous."}, {"url": "http://www.cancerresearchuk.org/about-cancer/type/testicular-cancer/about/the-testicles", "passage_text": "The testicles. The testicles are two small oval shaped organs which hang below the penis in a pouch of skin called the scrotum. They are part of the male reproductive system. From the age of puberty the testicles produce sperm which can fertilise the female egg. The testicles also produce the hormone testosterone. Testosterone leads to the development of male qualities such as a deep voice and facial and body hair growth. "}, {"url": "http://goaskalice.columbia.edu/answered-questions/what-are-testicles", "passage_text": "Ah, the family jewels. Testicles produce sperm and the hormone testosterone. Sperm grows at the back of the testicle, in the epididymis. The testicles hang in a sack, called the scrotum, that sits outside of the body because it is necessary for sperm to be stored at a temperature that is slightly below that of the body. Just as penis size varies from one man to the next, there is a wide range in testicle size as a proportion of the human body. Here are some guidelines for performing testicular self-exam: 1  Find each testicle and the epididymis. 2  Turn each testicle between the thumb and forefinger-you should feel a round, firm surface. 3  Examine the rest of the scrotum contents. 4  If you feel a lump on the testicle surface, even if it is not painful, see a health care provider."}, {"url": "https://en.wikipedia.org/wiki/Testicle", "passage_text": "The testicle (from Latin testiculus, diminutive of testis, meaning witness of virility, plural testes) is the male gonad in animals. Like the ovaries to which they are homologous, testes are components of both the reproductive system and the endocrine system. "}, {"url": "http://teens.webmd.com/boys/testicles-faq", "passage_text": "We... After puberty is finished, the testicles will produce millions of sperm a day. Sperm mixes with a white, milky substance to make semen. Semen is what's released from the penis when you ejaculate. Guys become fertile between the ages of 11 and 17, meaning they are able to ejaculate semen and get a girl pregnant"}, {"url": "https://simple.wikipedia.org/wiki/Testicle", "passage_text": "Women do not have testicles. The glands in their bodies that do the same sort of jobs as testicles are called ovaries. Women have two ovaries, but unlike testicles, ovaries are inside the body, on either side of the uterus. They release ova (or eggs) and female hormones. Ovaries and testicles are sometimes called gonads. In mammals, testicles can be very big or very small in relation to the size of the animal itself. The size has to do with the amount of sperm that the male animal needs to make. Some types of male animal generally only have one sexual partner at a time and are called monogamous."}, {"url": "http://teens.webmd.com/boys/testicles-faq", "passage_text": "Testicles, also called testes or balls, are oval-shaped organs that sit in a sac that hangs behind the penis. The main job of testicles is to make and store sperm and produce testosterone. Testosterone is the male hormone that's responsible for the changes that occur during puberty. Puberty is the time in life when your body begins to change and you start to look more and more like an adult. After puberty is finished, the testicles will produce millions of sperm a day. Sperm mixes with a white, milky substance to make semen. Semen is what's released from the penis when you ejaculate. Guys become fertile between the ages of 11 and 17, meaning they are able to ejaculate semen and get a girl pregnan"}, {"url": "http://www.coloplastmenshealth.com/learn-more/testicular-implants/function-testicle/", "passage_text": "The testicles (also called testes) are part of the male reproductive system. 1  The testicles are two oval organs that are located inside the scrotum, the loose sac of skin that hangs behind the penis. 2  The testicles make the male hormones, including testosterone, and produce sperm, the male reproductive cells. 1 The testicles are two oval organs that are located inside the scrotum, the loose sac of skin that hangs behind the penis. 2  The testicles make the male hormones, including testosterone, and produce sperm, the male reproductive cells."}]