[{"url": "http://www.pdr.net/full-prescribing-information/bactroban-nasal?druglabelid=2208", "passage_text": "Common side effects of BACTROBAN nasal ointment may include headache, runny nose, congestion, sore throat, distorted sense of taste, burning and/or stinging, cough and itching. These are not all the possible side effects of BACTROBAN nasal ointment. Call your healthcare provider for medical advice about side effects. •. Press the sides of the nose together and gently massage after application to spread the ointment throughout the inside of the nostrils. •. Avoid contact of the medication with the eyes; if BACTROBAN nasal ointment gets in or near the eyes, rinse thoroughly with water."}, {"url": "http://www.rxlist.com/bactroban-nasal-drug/overdosage-contraindications.htm", "passage_text": "Following single or repeated intranasal applications of BACTROBAN NASAL (mupirocin calcium ointment) to adults, no evidence for systemic absorption of mupirocin was obtained. Intravenous infusions of 252 mg, as well as single oral doses of 500 mg of mupirocin, have been well tolerated in healthy adult subjects. There is no information regarding local overdose of BACTROBAN NASAL (mupirocin calcium ointment) or regarding oral ingestion of the nasal ointment formulation."}, {"url": "http://www.empr.com/bactroban-nasal/drug/720/", "passage_text": "Indications for BACTROBAN NASAL: Eradication of nasal colonization of methicillin-resistant S. aureus (MRSA) in adult patients and healthcare workers in certain institutional settings during outbreaks of infections with MRSA (see literature). "}, {"url": "https://www.gsksource.com/pharma/content/dam/GlaxoSmithKline/US/en/Prescribing_Information/Bactroban_Ointment/pdf/BACTROBAN-OINTMENT.PDF", "passage_text": "(mupirocin ointment, 2%) For Dermatologic Use DESCRIPTION Each gram of BACTROBAN Ointment (mupirocin ointment, 2%) contains 20 mg mupirocin in a bland water miscible ointment base (polyethylene glycol ointment, N.F.) consisting of polyethylene glycol 400 and polyethylene glycol 3350. The following local adverse reactions have been reported in connection with the use of. BACTROBAN Ointment: burning, stinging, or pain in 1.5% of subjects; itching in 1% of. subjects; rash, nausea, erythema, dry skin, tenderness, swelling, contact dermatitis, and increased. exudate in less than 1% of subjects."}, {"url": "http://www.pdr.net/full-prescribing-information/bactroban-nasal?druglabelid=2208", "passage_text": "The structural formula of mupirocin calcium is: BACTROBAN nasal ointment is a white to off‑white ointment that contains 2.15% w/w mupirocin calcium (equivalent to 2% mupirocin free acid) in a soft white ointment base. The inactive ingredients are paraffin and a mixture of glycerin esters (SOFTISAN ® 649). •. Press the sides of the nose together and gently massage after application to spread the ointment throughout the inside of the nostrils. •. Avoid contact of the medication with the eyes; if BACTROBAN nasal ointment gets in or near the eyes, rinse thoroughly with water."}, {"url": "http://www.rxlist.com/bactroban-nasal-drug/indications-dosage.htm", "passage_text": "BACTROBAN NASAL (mupirocin calcium ointment) is supplied in 1.0-gram tubes packaged in cartons of 10. NDC 0029-1526-11 (1.0 gram tubes in packages of 10). Store between 20° and 25°C (68° and 77°F); excursions permitted to 15°-30°C (59°-86°F). Do not refrigerate. Here is a collection of user reviews for the medication Bactroban Nasal sorted by most helpful. See User Reviews. Report Problems to the Food and Drug Administration. You are encouraged to report negative side effects of prescription drugs to the FDA. Visit the FDA MedWatch website or call 1-800-FDA-1088."}, {"url": "http://www.rxlist.com/bactroban-nasal-drug/overdosage-contraindications.htm", "passage_text": "Here is a collection of user reviews for the medication Bactroban Nasal sorted by most helpful. See User Reviews. Report Problems to the Food and Drug Administration. You are encouraged to report negative side effects of prescription drugs to the FDA. Visit the FDA MedWatch website or call 1-800-FDA-1088. There is no information regarding local overdose of BACTROBAN NASAL (mupirocin calcium ointment) or regarding oral ingestion of the nasal ointment formulation."}, {"url": "http://www.rxlist.com/bactroban-nasal-drug/indications-dosage.htm", "passage_text": "1 There are insufficient data at this time to recommend use of BACTROBAN NASAL (mupirocin calcium ointment) for general prophylaxis of any infection in any patient population. 2  Greater than 90% of subjects/patients in clinical trials had eradication of nasal colonization 2 to 4 days after therapy was completed. Here is a collection of user reviews for the medication Bactroban Nasal sorted by most helpful. See User Reviews. Report Problems to the Food and Drug Administration. You are encouraged to report negative side effects of prescription drugs to the FDA. Visit the FDA MedWatch website or call 1-800-FDA-1088."}, {"url": "http://www.rxlist.com/bactroban-nasal-drug/overdosage-contraindications.htm", "passage_text": "BACTROBAN NASAL (mupirocin calcium ointment) is contraindicated in patients with known hypersensitivity to any of the constituents of the product. Last reviewed on RxList: 12/9/2008. This monograph has been modified to include the generic and brand name in many instances. There is no information regarding local overdose of BACTROBAN NASAL (mupirocin calcium ointment) or regarding oral ingestion of the nasal ointment formulation."}]