[{"url": "http://www.lifebeyondhepatitisc.com/2014/01/understanding-meld-score-liver-transplant-patients-2/", "passage_text": "This list is maintained by the UNOS (United Network for Organ Sharing). Determining who gets a liver is based on a formula that takes into consideration lab values such as, creatinine, total bilirubin, and INR. UNOS will then assign a MELD score based upon these values. The higher the MELD score, the more advanced the liver disease is, and the sooner the patient will be allocated a liver for transplant. Very helpful articles and videos to understand more about liver transplants and the steps for evaluation include: 1  John Hopkins Medicine. www.hopkinsmedicine.org."}, {"url": "https://www.unos.org/", "passage_text": "UNOS’ computer system stores information about every person who is waiting for a transplant, and matches donor organs with transplant candidates 24 hours a day, 365 days a year. When a patient is “added to the list,” a transplant hospital adds a patient’s medical information into UNOS’ computer system. "}, {"url": "http://www.transplantcalculator.com/Transplant-Calculators/MELD.aspx", "passage_text": "The Model for End-Stage Liver Disease (MELD) is a numerical scale that is currently used by UNOS for liver allocation in the United States. MELD score predicts a patient's risk of dying while waiting for a liver transplant, and is based on objective and verifiable medical data."}, {"url": "http://www.lifebeyondhepatitisc.com/2014/01/understanding-meld-score-liver-transplant-patients-2/", "passage_text": "The higher the MELD score the sicker the patient, and the higher on the transplant waiting list. UT Southwest Medicine reports livers are only matched for blood type (A, B, O, AB) and size. Unlike other organs, special tissue typing is not necessary to determine which liver donor makes the best match. The higher the MELD score, the more advanced the liver disease is, and the sooner the patient will be allocated a liver for transplant. Very helpful articles and videos to understand more about liver transplants and the steps for evaluation include: 1  John Hopkins Medicine. www.hopkinsmedicine.org."}, {"url": "http://my.clevelandclinic.org/services/transplant-center/transplant-programs/liver-transplant-program", "passage_text": "The MELD formula, which is calculated on the basis of three objective variables (creatinine, bilirubin, and INR), predicts liver transplant survivability of patients waiting for liver transplantation, with higher MELD scores associated with higher mortality rates. Cleveland Clinic's liver transplant program is a member of the Ohio Solid Organ Transplant Consortium (OSOTC) and the United Network for Organ Sharing (UNOS), meeting all their requirements for liver transplants."}, {"url": "http://www.cpmc.org/advanced/liver/patients/topics/MELD.html", "passage_text": "Currently, the average MELD score for a patient undergoing a liver transplant is 20 nationally. The average MELD score for liver transplant patients in our region varies from 26-33, depending on blood type. The average waiting time for a patient to receive a liver in our region, once a patient is placed on the UNOS waiting list, is 12-36 months. Waiting time is only a factor when patients have the same MELD score. In summary, the priority of an individual patient on the UNOS waiting list for a donor liver depends on the following factors: 1  Local versus distant (donor organs are first offered locally within the Northern California/Bay Area)."}, {"url": "http://www.cpmc.org/advanced/liver/patients/topics/MELD.html", "passage_text": "MELD is a numerical scale used for adult liver transplant candidates. The range is from 6 (less ill) to 40 (gravely ill). The individual score determines how urgently a patient needs a liver transplant within the next three months. The number is calculated using the most recent laboratory tests. Waiting time is only a factor when patients have the same MELD score. In summary, the priority of an individual patient on the UNOS waiting list for a donor liver depends on the following factors: 1  Local versus distant (donor organs are first offered locally within the Northern California/Bay Area)."}, {"url": "http://my.clevelandclinic.org/ccf/media/Files/Transplant/MELD-PELD-Calculator.pdf", "passage_text": "MELD/PELD Calculator Documentation 1/28/2009 Page 1 of 4 The MELD/PELD Calculator is a utility that allows you to enter hypothetical or actual parameters and calculate a MELD or PELD score for an individual patient. MELD/PELD Calculator Documentation 1/28/2009 Page 2 of 4 The maximum serum creatinine considered within the MELD score equation is 4.0 mg/dl (e.g. if you enter 4.3 for serum creatinine the formula will calculate 0.957 x Log e (4.0) for the serum creatinine portion of the MELD formula)."}, {"url": "http://www.lifebeyondhepatitisc.com/2014/01/understanding-meld-score-liver-transplant-patients-2/", "passage_text": "The Methodist Hospital is the largest liver transplant center in Texas, and one of the largest in the United States. The MELD score is calculated by determining the patients bilirubin, creatinine, and INR. The MELD score ranges from 5-40. The higher the MELD score, the more advanced the liver disease is, and the sooner the patient will be allocated a liver for transplant. Very helpful articles and videos to understand more about liver transplants and the steps for evaluation include: 1  John Hopkins Medicine. www.hopkinsmedicine.org."}, {"url": "http://www.hepatitisc.uw.edu/page/clinical-calculators/meld", "passage_text": "MELD Score: 1  This version of the MELD calculator includes United Network for Organ Sharing (UNOS) modifications of the original model. 2  The MELD utlizes log scale calculations and thus any value less than 1 is automatically given a lower limit value of 1 to prevent generating a negative score. "}]