[{"url": "http://www.webmd.com/oral-health/guide/veneers?page=4", "passage_text": "Costs of veneers vary depending on what part of the country you live in and on the extent of your procedure. Generally, veneers range in cost from $500 to $1,300 per tooth. The cost of veneers is not generally covered by insurance. To be certain, check with your specific dental insurance company. "}, {"url": "http://www.veneers101.com/much-veneers-cost/", "passage_text": "The Cost of Porcelain Veneers. Porcelain veneers are one the most expensive types of veneers, but they are also one of the longest lasting. Porcelain veneers cost can range anywhere from $1000 to $3000 per tooth. This seems a bit steep for some, but they can last anywhere from 10-15+ years. They can cost anywhere from $1000 to $3000 per tooth, depending on how extensive the veneers need to be. If the technician is skilled they can make them look very realistic as technicians actually paint the material directly onto the existing tooth structure."}, {"url": "http://health.costhelper.com/veneer-lumineer.html", "passage_text": "1 At 0.2mm-0.3mm thick, the Lumineers brand of veneers are thin like a contact lens, and cost $700-$1,300 per tooth, or total costs of $2,800-$5,500 on four upper front teeth. 2  Veneers are considered purely cosmetic and are rarely covered by dental insurance. 1 If teeth are unsightly after being shaved, temporary veneers can be installed for an extra fee; if interested in temporaries, let the dentist know and ask for a quote in advance. 2  There might be additional charges for an initial office visit ($50-$350) or initial office visit."}, {"url": "http://www.smilebrilliant.com/articles/average-cost-of-dental-veneers", "passage_text": "The cost of veneers will vary depending on the difficulty of your individual case, the amount of veneers needed, and the city and state you are located in. Only your individual dentist can tell you what the final cost will be. Typically, veneers can cost on average $1000 per tooth. between $800 and $2,000 per tooth."}, {"url": "http://www.newimage.com/cosmetic-dentistry/dental-veneers-cost.html", "passage_text": "Although the cost of veneers varies significantly, there are national averages serving as a price indicator. Composite veneers cost per tooth ranges between $250 and $1,500. Porcelain veneers cost per tooth ranges between $925 and $2,500. Compare with the cost of mini implants, the cost of dentures and the cost of tooth bridges. "}, {"url": "http://jamiethedentist.com/dental-veneers/costs", "passage_text": "In Australia: The cost of a porcelain veneer is on average $800-$1200 per tooth. Yes... per tooth. The cost of a composite veneer would be $250-$500 per tooth. The ADA dental fee survey for 2012 reported an average price amongst dentists who responded (about 3000 members) of $1087 per tooth for porcelain veneers and $326 for a composite veneer. In the US: the cost of veneers is actually proportionally higher and can range anywhere from $1000-$3000 per tooth."}, {"url": "http://www.yourdentistryguide.com/veneer-procedure/", "passage_text": "Porcelain veneers are more expensive than indirect or direct composite resin veneers. Traditional porcelain veneers cost between $925 and $2,500 per tooth but can last 10 to 15 years. Composite veneers cost approximately $250 to $1500 per tooth and may last between five and seven years. "}, {"url": "http://www.howmuchisit.org/porcelain-veneers-cost/", "passage_text": "1 On average, the cost of porcelain veneers can vary anywhere from as little as $1,500 to as much as $20,000. 2  The pricing has such as wide range because each person’s teeth vary. 3  With that being said, replacing a few teeth with porcelain veneers will be a lot cheaper than replacing a full set of teeth. 1 If you want to budget per tooth, some dentists will tell you it can be anywhere from $1,000 to $2,500 per tooth. 2  According to some dentists on the website RealSelf.com, you should expect to budget anywhere from $2,000 to $20,000 for the entire procedure."}, {"url": "http://www.veneers101.com/much-veneers-cost/", "passage_text": "Lumineers are another type of porcelain veneer and can cost anywhere from $800 to $2000 per tooth. The price is of course dependent upon several factors such as difficulty to fit, where they are in your mouth, and how large or small they need to be. They can cost anywhere from $1000 to $3000 per tooth, depending on how extensive the veneers need to be. If the technician is skilled they can make them look very realistic as technicians actually paint the material directly onto the existing tooth structure."}]