[{"url": "http://www.vwwaterloo.com/aboutus/whoweare.aspx?lng=2", "passage_text": "Volkswagen Waterloo was founded in 1973 as Auto-Haus Waterloo. We are proud to have been part of Volkswagen's 60 year history in Canada for 40 years. After an ownership change in the mid nineties, the name was changed to Volkswagen Waterloo."}, {"url": "http://www.vwwaterloo.com/aboutus/whoweare.aspx?lng=2", "passage_text": "Volkswagen Waterloo has established itself as a one of leading Volkswagen retailers in the region, not only in sales numbers, but more importantly in customer satisfaction ratings. With their positive attitude, our professional staff have created a culture of enthusiastic commitment."}, {"url": "http://www.autoevolution.com/volkswagen/", "passage_text": "VOLKSWAGEN Cars and Brand History. The history of the “People's Car”, Volkswagen, begins on May 28th 1937 when the “Geselschaft zur Vorbereitung des Deutschen Volkswagen mbH” company is created."}, {"url": "http://www.autoevolution.com/volkswagen/", "passage_text": "A year later it is renamed into “Volkswagenwerk GmbH” has it's headquarters established in Wolfsburg, a city especially created for the workers on the Volkswagen plant that are going to mass produce Hitler's dream car for the average German, designed by Ferdinand Porsche."}, {"url": "http://www.vwwaterloo.com/aboutus/whoweare.aspx?lng=2", "passage_text": "Dear Visitor, Thank you for looking up Volkswagen Waterloo in the virtual world and for your interest in our company, our people, our services and products. Volkswagen Waterloo was established in 1973 and last year we proudly celebrated the 40th anniversary of the company."}, {"url": "http://www.volkswagenag.com/content/vwcorp/info_center/en/themes/2014/01/Volkswagen_de_Mexico/50_years_of_Volkswagen_de_Mexico.html", "passage_text": "The free trade agreement with the European Union was signed in 2000. Volkswagen's New Beetle project and DaimlerChrysler's PT Cruiser project had convinced the Mexican government of the need for a counterbalance to NAFTA in the automobile industry as elsewhere."}, {"url": "http://www.volkswagenag.com/content/vwcorp/info_center/en/themes/2014/01/Volkswagen_de_Mexico/50_years_of_Volkswagen_de_Mexico.html", "passage_text": "In 1958, responsibility for the Mexico operations was transferred to Volkswagen Interamericana S.A. which was in charge of exports to other Central and South American countries. Sales on the Mexican market subsequently rose to 3,201 units in 1961."}]