[{"url": "https://en.wikipedia.org/wiki/Languages_of_Russia", "passage_text": "Of all the languages of Russia, Russian is the only official language. There are 35 different languages which are considered official languages in various regions of Russia, along with Russian. There are over 100 minority languages spoken in Russia today."}, {"url": "http://aboutworldlanguages.com/Russian", "passage_text": "Russian is primarily spoken in the Russian Federation and by older people in the other countries that were once part of the Soviet Union, as well as in Eastern Europe. According to the 2010 census, there were 137 million speakers of Russian in the Russian Federation, and 166 million worldwide (Ethnologue). In addition, Russian is spoken in Canada, China, Finland, Germany, Greece, India, Israel, and the U.S. It is one of the world’s ten most spoken languages."}, {"url": "http://www.effectivelanguagelearning.com/language-guide/russian-language", "passage_text": "Popularity. While Russian is spoken majoritively in Russia, it is also an official language for the countries Belarus, Kazakhstan and Kyrgyzstan. It also shares joint official status as a language for the countries Abkhazia, Crimea, Gagauzia, Transinistria and South Ossetia."}, {"url": "http://www.bbc.co.uk/languages/european_languages/countries/russia.shtml", "passage_text": "Russia. Of Russia's estimated 150m population, it is thought that over 81% speak the official language of Russian as their first and only language. Most speakers of a minority language are also bilingual speakers of Russian. There are over 100 minority languages spoken in Russia today, the most popular of which is Tatar (Tartar), spoken by more than 3% of the country's population."}, {"url": "http://www.bbc.co.uk/languages/russian/soap/facts.shtml", "passage_text": "Russian is the official language in the Russian Federation, which has a population of more than 140 million people. Russian is also spoken in Ukraine, Belarus, Kazakhstan and other republics of the former USSR."}, {"url": "http://www.learningrussian.net/russianlanguage/", "passage_text": "The majority of Russian language speakers live in the Russian Federation. Russian is also spoken in the countries of the former Soviet Union (Armenia, Azerbaijan, Byelorussia, Estonia, Georgia, Kazakhstan, Kyrghyzstan, Latvia, Lithuania, Moldova, Tajikistan, Turkmenistan, Uzbekistan, Ukraine)."}, {"url": "http://aboutworldlanguages.com/Russian", "passage_text": "Russian is the official language of the Russian Federation, sharing its official status at the regional level with other languages in various ethnic autonomous regions within the Federation, such as Chuvash, Bashkort, Tatar, and Yakut. Russian is also a co-official language of Belarus, Kazakhstan, and Kyrgyzstan."}]