[{"url": "http://www.larkinam.com/Hurdy.html", "passage_text": "The hurdy gurdy, known in France as the vielle a roue or vielle for short, is an ancient instrument which is undergoing a modern renaissance in Europe and America. First, to dispel a popular misconception: the hurdy gurdy was not played by the organ grinder or his monkey. Today's hurdy gurdy is roughly the same as those built in the middle ages. It has three to six strings which are caused to vibrate by a resined wheel turned by a crank. Melody notes are produced on one string, or two tuned in unison, by pressing keys which stop the string at the proper intervals for the scale."}, {"url": "http://hurdygurdy.org/pdfs/hghistory.pdf", "passage_text": "The hurdy gurdy, known in France as the vielle a roue or vielle for short, is an ancient instrument which is undergoing a modern renaissance in Europe and America. First, to dispel a popular misconception: the hurdy gurdy was not played by the organ grinder or his monkey. They used a large music box operated by a crank. Today's hurdy gurdy is roughly the same as those built in the middle ages."}, {"url": "http://www.hotpipes.com/hgdemo.html", "passage_text": "A hurdy-gurdy is a string instrument incorporating a wooden wheel rotated by a simple shaft connected to a hand crank. Sound is produced by the action of the rim of the rotating wheel rubbing across the string(s) as the wheel is turned. "}, {"url": "https://en.wikipedia.org/wiki/Hurdy_gurdy", "passage_text": "In the eighteenth century the term hurdy-gurdy was also applied to a small, portable  barrel organ  (a cranked box instrument with a number of organ pipes, a bellows and a barrel with pins that rotated and programmed the tunes) that was frequently played by poor buskers (street musicians). According to the Oxford English Dictionary, the mid 18th century origin of the term hurdy-gurdy is onomatopoeic in origin, after the repetitive warble in pitch that characterizes instruments with solid wooden wheels that have warped due to changes in humidity or after the sound of the buzzing-bridge."}, {"url": "https://en.wikipedia.org/wiki/Hurdy_gurdy", "passage_text": "The hurdy-gurdy is a stringed instrument that produces sound by a crank-turned, rosined wheel rubbing against the strings. The wheel functions much like a violin bow, and single notes played on the instrument sound similar to those of a violin. According to the Oxford English Dictionary, the mid 18th century origin of the term hurdy-gurdy is onomatopoeic in origin, after the repetitive warble in pitch that characterizes instruments with solid wooden wheels that have warped due to changes in humidity or after the sound of the buzzing-bridge."}, {"url": "http://www.music.iastate.edu/antiqua/hurdy.htm", "passage_text": "Kemp's Jig variation. The hurdy-gurdy is the first stringed instrument to which the keyboard principle was applied. The French name, Viella a Roue (wheel fiddle), describes the method by which sound is produced. The bowing action of the fiddle is replaced by a wheel cranked by a handle. The outer rim of the wooden wheel is coated with resin. Both bagpipe and hurdy-gurdy use drones, provided in the former by reed pipes, and in the latter by strings which sound fixed pitches. Other strings tuned in unison provide notes of the scale. Tangents activated by keys press these strings at the appropriate points to produce different pitches."}, {"url": "https://en.wikipedia.org/wiki/Hurdy_Gurdy_Man", "passage_text": "It was written during a trip to India, was recorded in early 1968, and was released in May 1968 as a single. It gave its name to the album The Hurdy Gurdy Man, which was released in October of that year in the U.S. The single reached No.5 in the U.S. and No.4 in the UK pop charts. The song features a harder rock sound than Donovan's usual material, supplying a range of distorted guitars. Hurdy Gurdy Man  is a song by the Scottish singer/songwriter Donovan."}, {"url": "http://www.thefreedictionary.com/hurdy+gurdy", "passage_text": "Noun. 1. hurdy gurdy-a musical instrument that makes music by rotation of a cylinder studded with pegs. barrel organ, grind organ, hand organ, hurdy-gurdy, street organ. musical instrument, instrument-any of various devices or contrivances that can be used to produce musical tones or sounds. music-an artistic form of auditory communication incorporating instrumental or vocal tones in a structured and continuous manner. "}, {"url": "http://www.thefreedictionary.com/hurdy-gurdy", "passage_text": "Noun. 1. hurdy-gurdy-a musical instrument that makes music by rotation of a cylinder studded with pegs. barrel organ, grind organ, hand organ, hurdy gurdy, street organ. musical instrument, instrument-any of various devices or contrivances that can be used to produce musical tones or sounds. hurdy-gurdy. n, pl-dies. 1. (Instruments) any mechanical musical instrument, such as a barrel organ. 2. (Instruments) a medieval instrument shaped like a viol in which a rosined wheel rotated by a handle sounds the strings."}]