[{"url": "http://www.blueplanetbiomes.org/med_chaparral.htm", "passage_text": "Animals. Climate. Chaparral. California Chaparral. Chaparral, or Sclerophyll forest biomes, occur in Europe, Africa, Asia Minor, North America, and South America. Chaparrals exist between 30° and 40° North and South latitude on the west coasts of continents."}, {"url": "https://php.radford.edu/~swoodwar/biomes/?page_id=98", "passage_text": "Mediterranean Scrub. Introduction: Regions of Mediterranean-type climate occur roughly between 30° and 40° latitude on the west coasts of continents, where offshore there are cold ocean currents. Climate: The Mediterranean Climate (Cs) is unique in that the wet season coincides with the low sun or winter period. Summers are dry. Total annual precipitation ranges between 15 and 40 inches per year."}, {"url": "http://www.mednscience.org/mediterranean_ecosystem", "passage_text": "Throughout the world, the Mediterranean climate region is characterized by evergreen or drought deciduous shrublands. The chaparral of southern California is echoed in the old world Mediterranen maquis, the Chilean matorral, South African fynbos and the Australian mallee scrub communities. Mediterranean ecosystems are limited to five relatively small areas around the planet: the region bordering the Mediterranean Sea, central Chile, the Cape region of South Africa, southwestern and southern Australia, and California south to northern Baja California."}, {"url": "http://www.thewildclassroom.com/biomes/chaparral.html", "passage_text": "Chaparral or Mediterranean forests, woodlands, and shrub is a temperate biome, characterized by hot-dry summers and mild and rainy winters. Nearly all of the rainfall occurs in the winter and spring rainy season. "}, {"url": "http://www.blueplanetbiomes.org/med_chaparral.htm", "passage_text": "Plants Animals Climate Chaparral California Chaparral Chaparral, or Sclerophyll forest biomes, occur in Europe, Africa, Asia Minor, North America, and South America. Chaparrals exist between 30° and 40° North and South latitude on the west coasts of continents. Chaparral. California Chaparral."}, {"url": "https://en.wikipedia.org/wiki/Mediterranean_forests,_woodlands,_and_scrub", "passage_text": "Mediterranean forests in Salamanca, Spain. Mediterranean forests, woodlands, and scrub biome, as defined by the World Wildlife Fund, is characterized by dry summers and rainy winters. Summers are typically hot in low-lying inland locations but can be cool near colder seas. Winters are typically mild to cool in low-lying locations but can be cold in inland and higher locations. The Mediterranean forests, woodlands, and scrub biome occurs in the world's five Mediterranean climate zones, on the west coast of continents in the mid-latitudes:"}, {"url": "https://php.radford.edu/~swoodwar/biomes/?page_id=98", "passage_text": "Many plants are adapted to. Vegetation: Throughout the world, the Mediterranean biome is characterized by shrubs. In most regions these shrubs are evergreen and have small, leathery (sclerophyllous) leaves with thick cuticles. Sometimes the leaves are so reduced as to appear needle-like. Climate: The Mediterranean Climate (Cs) is unique in that the wet season coincides with the low sun or winter period. Summers are dry. Total annual precipitation ranges between 15 and 40 inches per year."}, {"url": "http://www.terracesports.com/eoqvpdb/Temperate-Shrubland", "passage_text": "Temperate. Each region in which the Mediterranean shrublands and woodlands occur is island-like in character and thus there is frequently a high degree of endemism. Feb 16, 2009 Temperate Woodland and Shrub land-A PowerPoint presentation. We have the information you need about Temperate Woodland and Shrubland."}, {"url": "https://php.radford.edu/~swoodwar/biomes/?page_id=98", "passage_text": "Vegetation: Throughout the world, the Mediterranean biome is characterized by shrubs. In most regions these shrubs are evergreen and have small, leathery (sclerophyllous) leaves with thick cuticles. Climate: The Mediterranean Climate (Cs) is unique in that the wet season coincides with the low sun or winter period. Summers are dry. Total annual precipitation ranges between 15 and 40 inches per year."}, {"url": "https://en.wikipedia.org/wiki/Shrubland", "passage_text": "Mediterranean scrublands. Mediterranean scrublands occur naturally in the Mediterranean forests, woodlands, and scrub biomes, located in the five Mediterranean climate regions of the world. Scrublands are most common near the seacoast, and have often adapted to the wind and salt air of the ocean. Shrubland may either occur naturally or be the result of human activity. It may be the mature vegetation type in a particular region and remain stable over time, or a transitional community that occurs temporarily as the result of a disturbance, such as fire."}]