[{"url": "http://www.visitlondon.com/things-to-do/place/77552-piccadilly-circus", "passage_text": "About. Piccadilly Circus is one of London's most popular tourist destinations. Here you can sit by the famous statue of Eros (a popular meeting point), or take some photos in front of the iconic advertising hoarding. From here, you can easily walk to Regent's Street, Piccadilly or Soho. This content has been supplied by Piccadilly Circus."}, {"url": "https://en.wikipedia.org/wiki/Piccadilly_Circus_tube_station", "passage_text": "Piccadilly Circus is a London Underground station located directly beneath Piccadilly Circus itself, with entrances at every corner. Located in Travelcard Zone 1, the station is on the Piccadilly line between Green Park and Leicester Square and on the Bakerloo line between Charing Cross and Oxford Circus. Piccadilly Circus is a proposed stop on the Chelsea-Hackney Line, also known as the Crossrail 2. It would be between Victoria and Tottenham Court Road stations."}, {"url": "http://www.london-tourist-guide.com/en/areas/piccadilly-circus-in-london.html", "passage_text": "Page Content. Piccadilly Circus is an iconic and famous area of London. It is based in the heart of the city and its large neon signs and ornate buildings give it a instantly recongizable look. It is a relatively small area, with only a handful of bars, restaurants or shops in the square itself. How to get there. Piccadilly Circus is in the very heart of London, therefore it is best to use public transport to travel to the city centre. Piccadilly Circus has a tube stop that will allow you to arrive right in the heart of the area."}, {"url": "http://www.london-tourist-guide.com/en/areas/piccadilly-circus-in-london.html", "passage_text": "Piccadilly Circus is situated between Leicester Square, famous for its cinemas, and Regent Street, one of London's most popular shopping destinations. It is also within easy walking distance of Trafalgar Square, Pall Mall, Soho and Buckingham Palace. How to get there. Piccadilly Circus is in the very heart of London, therefore it is best to use public transport to travel to the city centre. Piccadilly Circus has a tube stop that will allow you to arrive right in the heart of the area."}, {"url": "http://www.londontown.com/LondonStreets/piccadilly_circus_8a9.html/", "passage_text": "181 Piccadilly, St James's, London W1A | 2 minutes from Piccadilly Circus. The Fortnum's wine bar has had a makeover as part of the store's refurbishment in 2007, three hundred years after this grand old department store first ... Welcome to our guide for the area around Piccadilly Circus in City of Westminster. Below we present a selection of upcoming events, local attractions and great places to eat and shop."}, {"url": "http://www.englandforever.org/piccadilly-circus.php", "passage_text": "Piccadilly Circus. Piccadilly Circus was built in 1819 with the aim of connecting Regent Street and Piccadilly Street, which was famous for its ample shopping opportunities. The circus (.circus. meaning .circle.) is an open area situated at the junction of these streets. Some of the popular tourist attractions around Piccadilly Circus include the Shaftesbury Memorial and the statue of Eros, the Criterion Theatre, the central hub of Soho, and the London Pavilion. In addition, there are many shops to satisfy even the most discriminating of shopaholics."}, {"url": "https://en.wikipedia.org/wiki/Piccadilly_Circus", "passage_text": "Piccadilly Circus is a road junction and public space of London 's West End in the City of Westminster, built in 1819 to connect Regent Street with Piccadilly. In this context, a circus, from the Latin word meaning circle, is a round open space at a street junction. Piccadilly now links directly to the theatres on Shaftesbury Avenue, as well as the Haymarket, Coventry Street (onwards to Leicester Square), and Glasshouse Street. The Circus is close to major shopping and entertainment areas in the West End. The Piccadilly Circus tube station was opened 10 March 1906, on the Bakerloo line, and on the Piccadilly line in December of that year. In 1928, the station was extensively rebuilt to handle an increase in traffic."}, {"url": "http://www.aviewoncities.com/london/piccadillycircus.htm", "passage_text": "Piccadilly Circus. The Circus lies at the intersection of five main roads: Regent Street, Shaftesbury Avenue, Piccadilly Street, Covent Street and Haymarket. It was created by John Nash as part of the future King George IV's plan to connect Carlton House-where the Prince Regent resided-with Regent's Park. Piccadilly Circus is a busy square in the heart of London. It is famous for the fountain that was installed here at the end of the nineteenth century and for the neon advertising that turned the square into a miniature version of Times Square."}]