[{"url": "http://wiki.ggc.usg.edu/wiki/Shigellosis_-_Shigella", "passage_text": "Shigellosis. Shigella, Gram-negative bacteria. Shigellosis, or bacillary dysentery, is an intestinal infection, especially of the colon, that is a major public health problem in many undeveloped and developing countries, and is the main cause of childhood diarrhea. "}, {"url": "http://www.niaid.nih.gov/topics/shigellosis/pages/shigellosis.aspx", "passage_text": "Cause. Shigellosis is caused by Shigella bacteria. There are four groups of Shigella that cause infection in humans: Shigella sonnei, S. dysenteriae, S. flexneri, and S. boydii. S. sonnei is the most common type of Shigella in developed countries, including the United States. Shigellosis is an intestinal infectious disease that is spread primarily through consumption of contaminated food and water. Transmission also can occur via person-to-person contact or by handling contaminated surfaces."}, {"url": "http://www.medicinenet.com/shigella_infection/article.htm", "passage_text": "1 Shigellosis is an infectious disease caused by a group of bacteria called Shigella. 2  Symptoms of Shigella infection include diarrhea (often bloody), fever, and stomach cramps starting a day or two after exposure to the bacteria. 3  Shigellosis usually resolves in 5 to 7 days. Shigellosis is an infectious disease caused by a group of bacteria called Shigella. Most who are infected with Shigella develop diarrhea, fever, and stomach cramps starting a day or two after they are exposed to the bacteria. The diarrhea is often bloody."}, {"url": "http://www.rightdiagnosis.com/s/shigella_dysenteriae_infection/intro.htm", "passage_text": "Shigella dysenteriae infection: Shigella dysenteriae is a species of bacteria from the Shigella genus. Dysenteriae is the most common cause of epidemic dysentery in condensed populations such as refugee camps. Infection with this bacteria causes diarrhea. The severity of the disease is variable depending on the underlying health of the individual-the young and old tend to be more severely affected."}, {"url": "http://wwwnc.cdc.gov/travel/yellowbook/2016/infectious-diseases-related-to-travel/shigellosis", "passage_text": "INFECTIOUS AGENT. Shigellosis is an acute infection of the intestine caused by bacteria in the genus Shigella. There are 4 species of Shigella: Shigella dysenteriae, S. flexneri, S. boydii, and S. sonnei (also referred to as group A, B, C, and D, respectively). Several distinct serotypes are recognized within the first 3 species. The symptoms of shigellosis range from mild to severe and typically last 4–7 days. Disease severity varies according to species; serotype S. dysenteriae serotype 1 (Sd1) is the agent of epidemic dysentery, while S. sonnei commonly causes milder diarrheal illness."}, {"url": "http://www.about-shigella.com/", "passage_text": "Shigella is a species of enteric bacteria that causes disease in humans and other primates. [16, 20] The disease caused by the ingestion of Shigella bacteria is referred to as shigellosis, which is most typically associated with diarrhea and other gastrointestinal symptoms."}, {"url": "http://www.mayoclinic.org/diseases-conditions/shigella/basics/definition/CON-20028418", "passage_text": "Definition. Shigella infection (shigellosis) is an intestinal disease caused by a family of bacteria known as shigella. The main sign of shigella infection is diarrhea, which often is bloody. Shigella can be passed through direct contact with the bacteria in the stool. "}, {"url": "http://www.cdc.gov/shigella/general-information.html", "passage_text": "Shigellosis is a diarrheal disease caused by a group of bacteria called Shigella. Shigella causes about 500,000 cases of diarrhea in the United States annually 1. There are four different species of Shigella 1  : Shigella sonnei (the most common species in the United States). "}, {"url": "http://study.com/academy/lesson/dysentery-and-the-bacteria-shigella-symptoms-causes.html", "passage_text": "Shigellosis and Dysentery. Regardless of how it happens, consuming Shigella usually leads to the development of illness. Shigellosis is a food infection caused by bacteria of the genus Shigella. Remember, in a food infection, the symptoms are a result of actively growing bacteria in the host's body. Shigella is noteworthy here because a person only needs to consume a few cells, as few as 10 to 200, for the infection to develop"}]