[{"url": "http://math.tutorvista.com/statistics/frequency-distribution.html", "passage_text": "A grouped frequency distribution is an ordered listed of a variable X, into groups in one column with a listing in a second column, the frequency column. A grouped frequency distribution is an arrangement class intervals and corresponding frequencies in a table."}, {"url": "http://www.math.ku.edu/~mandal/math365/les1.html", "passage_text": "Each of these blood groups may be referred to as a  class .. The frequency of a class is defined as the number of data members that belong to that class. For example, the frequency of the class O is 16; the frequency of class A is 14. A table that lists the classes and the corresponding frequency is called the frequency distribution of this qualitative data."}, {"url": "http://www.statcan.gc.ca/edu/power-pouvoir/ch8/5214814-eng.htm", "passage_text": "Use the following steps to present this data in a frequency distribution table. 1  Divide the results (x) into intervals, and then count the number of results in each interval. 2  In this case, the intervals would be the number of households with no car (0), one car (1), two cars (2) and so forth."}, {"url": "http://math.tutorvista.com/statistics/frequency-distribution.html", "passage_text": "The cumulative frequency for each class interval is the frequency for that class interval added to the preceding cumulative total. Cumulative frequency can also defined as the sum of all previous frequencies up to the current point. Cumulative relative frequency distribution is one type of frequency distribution."}, {"url": "http://math.tutorvista.com/statistics/frequency-distribution.html", "passage_text": "The class interval between 10 and 20 is defined as 10-20. Class limits: The smallest and largest possible values in each class of a frequency distribution table are known as class limits. For the class 10-20, the class limits are 10 and 20. 10 is called the lower class limit and 20 is called the upper class limit."}, {"url": "http://www.merriam-webster.com/dictionary/frequency%20distribution", "passage_text": "Definition of FREQUENCY DISTRIBUTION. : an arrangement of statistical data that exhibits the frequency of the occurrence of the values of a variable. See frequency distribution defined for kids. ADVERTISEMENT."}, {"url": "http://math.tutorvista.com/statistics/frequency-distribution.html", "passage_text": "This page includes the study of frequency distribution with various examples. Our study on frequency distribution includes a study on cumulative frequency, mean frequency table. Frequency distribution can be defined as the tabulation of the values with one or more variables."}]