[{"url": "http://www.collegesimply.com/colleges/new-york/syracuse-university/admission/", "passage_text": "What are the SAT and ACT requirements for students admitted to Syracuse University and what score do you need to get in? The tables below describe the SAT and ACT test score percentile profile of the Fall 2013 freshman class. These admission statistics provide an indication as to the selectivity of the school and how difficult it is to get in. 13,240 out of 25,790 applicants or 51% percent were admitted making Syracuse University moderately easy school to get into with a good chance of acceptance assuming you meet the requirements."}, {"url": "http://www.syracuse.edu/admissions/undergraduate/applytosu/requirements/req_newhouse.html", "passage_text": "Students generally present their portfolio for review in their sophomore year; therefore, no portfolio is required at the time you apply for admission to Syracuse University. The photography and graphics majors may require a minimum of five semesters to complete. "}, {"url": "http://www.upstate.edu/emergency/education/residency/application.php", "passage_text": "Upstate Medical University Syracuse, EM Program DOES NOT have a minimum Board score requirement. However, if all other factors are equal, board scores may influence the decision to call someone for interview. "}, {"url": "http://admissions.syr.edu/apply/internationalrequirements/", "passage_text": "English Proficiency. All international students whose native language is not English are required to have an official TOEFL, IELTS or PTE Academic score report sent directly to the University from the testing service. Use ID code 2823 when requesting your official scores. Preferred TOEFL and IELTS scores vary by college (see chart below). "}, {"url": "http://www.prepscholar.com/sat/s/colleges/Syracuse-University-admission-requirements", "passage_text": "The acceptance rate at Syracuse University is 49% . For every 100 applicants, 49 are admitted. This means the school is moderately selective. The school expects you to meet their requirements for GPA and SAT/ACT scores, but they're more flexible than other schools. (Most schools use a weighted GPA out of 4.0, though some report an unweighted GPA. With a GPA of 3.6, Syracuse University requires you to be above average in your high school class. You'll need at least a mix of A's and B's, with more A's than B's."}, {"url": "http://www.satscores.us/sat_scores_by_college.asp?college_id=196413", "passage_text": "17 Months Ago. SAT Score 1490, Top 20% Interested in Syracuse University My involvement with my school, I started to attend Glyn School in September 2012 and one of the first things that I did was to join the school council. "}, {"url": "http://www.prepscholar.com/sat/s/colleges/Syracuse-University-admission-requirements", "passage_text": "The average SAT score composite at Syracuse University is a 1730. This score makes Syracuse University Competitive for SAT test scores. The 25th percentile SAT score is 1560, and the 75th percentile SAT score is 1900. In other words, a 1560 places you below average, while a 1900 will move you up to above average. (Most schools use a weighted GPA out of 4.0, though some report an unweighted GPA. With a GPA of 3.6, Syracuse University requires you to be above average in your high school class. You'll need at least a mix of A's and B's, with more A's than B's."}, {"url": "http://www.americanexamservices.com/about-the-toefl/toefl-scores-usa-universities", "passage_text": "If you score below the minimum required but above 450PBT/52iBT TOEFL or 5.0 IELTS, you will be considered for our 4 – 12 month ESL program and ESL (conditional) admission to Michigan Tech. Mississippi State University. These are the minimum scores required in order to be accepted into the universities. Scores above the minimum will increase your chance of being admitted into the university, while scores below the minimum will guarantee you being denied admittance."}, {"url": "http://collegeapps.about.com/od/GPA-SAT-ACT-Graphs/ss/syracuse-university-admission-gpa-sat-act.htm", "passage_text": "Discussion of Syracuse's Admissions Standards: About 60% of applicants to Syracuse University don't get in. Successful applicants will need grades and standardized test scores that are at least a little above average. In the graph above, the blue and green dots represent accepted students. Most admitted students had a high school average of B or better, a combined SAT score of 1600 or higher, and an ACT composite score of 22 or higher. The higher those grades and scores, the better your chance of receiving an acceptance letter."}, {"url": "http://whitman.syr.edu/programs-and-academics/programs/ms/finance/admission/admission-requirements.aspx", "passage_text": "Admission is highly selective. Applicants who meet the minimum criteria are not automatically admitted to the program. To be considered for admission, an applicant must possess at a minimum: 1  A U.S. bachelor's degree or its equivalent from an accredited college or university. 2  Completed application. 3  GMAT or GRE exam. 4  Recommended minimum GMAT score is 600. 5  The 2014 entering class average was 684"}]