[{"url": "http://www.biznews.com/sa-investing/2014/11/25/markus-jooste-todays-history-making-deal-r200bn-steinhoff-ready-take-world/", "passage_text": "Steinhoff shares did little for a decade and a half – then took off 18 months ago as investors bought into Markus Jooste’s vision. MARKUS JOOSTE: No Alec, at that stage the Pep transaction was not advanced at all in terms of getting close to a corporate transaction. Markus Jooste: After today’s history-making deal, R200bn Steinhoff ready to take on the world. Steinhoff’s R63bn acquisition of Pepkor today ranks as the biggest transaction in South African corporate history."}, {"url": "http://www.bdlive.co.za/business/retail/2014/11/25/steinhoff-to-buy-retail-chain-pepkor-for-r62.8bn", "passage_text": "Steinhoff to buy retail chain Pepkor for R62.8bn. STEINHOFF International Holdings has agreed to buy retail chain Pepkor for R62.8bn, denting shares in Pepkor shareholder Brait by 21.42% in morning trade. Steinhoff will pay for its controlling stake through the issue of 839-million shares and R15bn in cash. Steinhoff said the combined entity would consist of more than 6,000 stores globally and would boost its sales by R39bn to R156bn."}, {"url": "http://www.forbes.com/companies/steinhoff-international/", "passage_text": "The company's business roots back to 1964 when Bruno Ewald Steinhoff started his own business sourcing furniture from eastern Europe to sell within western Europe. Steinhoff International Holdings was founded in 1988 and is headquartered in Johannesburg, South Africa. More ». Steinhoff International Holdings Ltd. is an integrated retailer, which manufactures, sources and retails furniture and household goods in Europe, Africa and the Pacific Rim. Its diversified industrial businesses in southern Africa provide supply chain and logistics services, timber products and other raw materials"}, {"url": "http://www.steinhoffinternational.com/", "passage_text": "Pricing of Convertible Bonds 30 July 2015. Steinhoff International Holdings Limited (SIHL) this morning announced the launch of its offering (the Bond Offering) of senior unsecured guaranteed convertible bonds due August 2022 (the Bonds). "}, {"url": "http://www.bdlive.co.za/Feeds/Business_Times/2014/02/23/steinhoff-takes-jd-group-under-its-wing", "passage_text": "THERE is little doubt that Steinhoff International has taken strategic and operational control of JD Group, the country’s largest listed furniture retailer, which reported a loss at its interim results presentation this week. But Steinhoff has long wanted JD as part of its portfolio. Steinhoff became JD’s largest shareholder last March, when the group’s shareholders voted for a share swap that allowed Steinhoff to take 50.1% of the furniture retailer. It subsequently increased its stake to 56%."}, {"url": "http://www.bdlive.co.za/business/retail/2014/11/25/steinhoff-to-buy-retail-chain-pepkor-for-r62.8bn", "passage_text": "The deal values clothes and homeware group Pepkor at R68bn. Steinhoff will pay for its controlling stake through the issue of 839-million shares and R15bn in cash. Steinhoff said the combined entity would consist of more than 6,000 stores globally and would boost its sales by R39bn to R156bn."}, {"url": "http://showme.co.za/lifestyle/how-steinhoff-got-jd-group-for-a-steal/", "passage_text": "Subtract the R568m it got in cash from JD Group, and it turns out that Steinhoff probably used less than R250m of its own money to get control of JD Group – a company worth R10,9bn. Fair and reasonable Piet Viljoen-Execution hasn’t been great. It was a sweet deal for Steinhoff, to be sure. And Jooste did it for a steal: in all, Steinhoff appears to have parted with less than R250m in cash – a minuscule amount to wrest control of a retailer worth R11,3bn. This emerges from an analysis of the labyrinthine set of transactions that led to Jooste’s company building up a 50,1% stake in JD Group."}, {"url": "http://www.sportingpost.co.za/2014/11/markus-jooste-steinhoff-pep-deal-markus-has-pep-in-his-step/", "passage_text": "He adds that dilution also occurs when shares of a low PE company [Steinhoff trades off a PE of 13x] are issued to pay for an earnings stream at a higher PE. According to pro forma information supplied by Steinhoff, its diluted headline earnings per share (Heps) for the year to June were 402 cents per share. "}]