[{"url": "http://siding.homeblue.com/pros/siding-contractors-installation-cost.aspx", "passage_text": "We can help you find a siding installation or repair contractor in your area. The pros in our network provide free cost estimates for a variety of siding projects and material types such as: vinyl, wood, metal, aluminum, stucco, fiber cement, brick, stone, and liquid spray on siding."}, {"url": "http://www.fixr.com/costs/siding-replacement", "passage_text": "1 Soffit installation in vinyl or aluminum will cost from $4.50 to $6.50 per linear foot. 2  Vapor barrier sheathing installed underneath siding to reduce moisture entry and improve insulation will cost between $0.25 and $0.65 per sq.ft. 3  depending upon local climate demands."}, {"url": "http://homewyse.com/services/cost_to_install_vinyl_siding.html", "passage_text": "$6.16. Get an INSTANT estimate of the cost to Install Vinyl Siding! Our free calculator uses recent, trusted data to estimate costs for your Vinyl Siding Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install Vinyl Siding ranges between $4.52 - $6.16 per square foot* ."}, {"url": "http://budgeting.thenest.com/average-cost-siding-removal-replacement-23085.html", "passage_text": "The price for materials varies, but the cost of the siding itself is only a fraction of the overall price tag. For example, vinyl siding can range between $1.67 and 3.74 per square foot. Aluminum siding can cost between $2.40 and $5.00 per square foot. Insulated vinyl siding costs between $2.12 and $5.04 per square foot. Fiber cement siding costs between $2.07 and $5.64 per square foot. In addition to the basic materials you will need a vapor barrier, soffit and facia for the eaves, and corner trim."}, {"url": "http://www.improvenet.com/r/costs-and-prices/siding-repair-cost", "passage_text": "On average, home owners can expect to spend between $400 and $600 for siding repair. Of course, there are many factors that can influence the actual cost. Aside from regional pricing trends, the type of siding can also influence repair and replacement costs."}, {"url": "http://budgeting.thenest.com/average-cost-siding-removal-replacement-23085.html", "passage_text": "The average total cost for replacing 1,250 square feet of vinyl siding, including trim like soffit and facia, in 2011 was $11,387, according to Remodeling Magazine. The average cost to replace the same amount of siding with a premium foam-backed vinyl was $13,927. Using fiber cement siding as a replacement, the average cost was $13,382. Of course, much of this investment can be recovered if you plan to sell your house."}]