[{"url": "http://www.webmd.com/cancer/tc/osteosarcomamalignant-fibrous-histiocytoma-of-bone-treatment-general", "passage_text": "Red marrow contains blood stem cells that can become red blood cells, white blood cells, or platelets. Yellow marrow is made mostly of fat. Leukemia may affect red blood cells, white blood cells, and platelets. Normally, the bone marrow makes blood stem cells (immature cells) that become mature blood cells over time. A blood stem cell may become a myeloid stem cell or a lymphoid stem cell. A lymphoid stem cell becomes a white blood cell."}, {"url": "http://www.webmd.com/cancer/tc/osteosarcomamalignant-fibrous-histiocytoma-of-bone-treatment-general", "passage_text": "In CML, too many blood stem cells become a type of white blood cell called granulocytes. These granulocytes are abnormal and do not become healthy white blood cells. They are also called leukemia cells."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0002267/", "passage_text": "1 Sarcoma is a cancer that begins in bone, cartilage, fat, muscle, blood vessels, or other connective or supportive tissue. 2  Leukemia is a cancer that starts in blood-forming tissue, such as the bone marrow, and causes large numbers of abnormal blood cells to be produced and enter the blood."}, {"url": "http://medical-dictionary.thefreedictionary.com/Lukemia", "passage_text": "Rieder cell leukemia a form of acute myelogenous leukemia in which the blood contains the abnormal cells called Rieder's lymphocytes, asynchronously developed lymphocytes that have immature cytoplasm and a lobulated, indented, comparatively more mature nucleus."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0002267/", "passage_text": "1 Leukemia is a cancer that starts in blood-forming tissue, such as the bone marrow, and causes large numbers of abnormal blood cells to be produced and enter the blood."}, {"url": "http://www.icd9data.com/2013/Volume1/140-239/200-209/208/default.htm", "passage_text": "1 A clonal (malignant) hematopoietic disorder affecting the bone marrow and the peripheral blood. 2  The malignant cells show minimal differentiation and are called blasts, either myeloid blasts (myeloblasts) or lymphoid blasts (lymphoblasts)."}, {"url": "http://www.cancer.org/cancer/leukemia-chronicmyeloidcml/detailedguide/leukemia-chronic-myeloid-myelogenous-what-is-c-m-l", "passage_text": "Chronic myeloid leukemia (CML), also known as chronic myelogenous leukemia, is a type of cancer that starts in certain blood-forming cells of the bone marrow."}, {"url": "http://csuanimalcancercenter.org/tumors-by-name", "passage_text": "Myeloid Leukemia. A malignant leukemia (cancer of blood or bone marrow) characterized by proliferation of myeloid tissue (bone marrow and spleen) and an abnormal increase in the number of myeloid cells (non-lymphoid cells)."}]