[{"url": "http://www.facebook.com/help/385017548218624/", "passage_text": "You can then choose to remove the tag or ask the person who posted it to take it down. 1  Go to your activity log. 2  Click Photos in the left column. 3  Select the photos you'd like to remove a tag from."}, {"url": "http://en-gb.facebook.com/help/community/question/?id=10151681112368562", "passage_text": "Privacy. Timeline (Profile). In the Edit Sections. The first 3 check boxes to hide the About, Photos, and Friends sections are grayed out. I would like to hide all but if not at the very least the Photos section."}, {"url": "http://www.wikihow.com/Hide-Your-Photos-on-Facebook", "passage_text": "3. Look at your albums. After clicking on “Photos,” click on “Albums.” A list of your photo albums will appear. 4. Change your audience. If you want to hide an album, click the settings icon under it. You will be given several options. 1  Choose “Only Me” if you want to hide the album completely."}, {"url": "http://www.guidingtech.com/6496/hide-facebook-status-photos-from-certain-people/", "passage_text": "Let see how we can hide a status message, or a photo/video that we upload using the status tab, from certain people. Step 1. On the Facebook status tab on your homepage, you’ll find a small security lock icon beside the share button. Click on it."}, {"url": "http://www.facebook.com/help/385017548218624/", "passage_text": "When you hide a photo or post you're tagged in on your Timeline, or adjust your Timeline and tagging privacy setting, this only limits who can see the content on your Timeline. The photo or post is still visible to the audience it's shared with other places on Facebook, such as in News Feed or search."}, {"url": "http://www.facebook.com/help/385017548218624/", "passage_text": "To adjust the privacy settings of photos you've posted to these albums: 1  Click the photo to expand it. 2  Click on the audience selector (ex: Public, Friends). 3  Select the audience you want to share the photo with. 4  Learn more about how to choose who can see stuff you share."}, {"url": "http://www.youtube.com/watch?v=Wgdp4_RFru0", "passage_text": "Here is the answer How to hide photos from everyone on facebook timeline, how to hide photos on facebook timeline. FACEBOOK-Facebook is one of the largest websites in the world, with more than 500 million monthly users."}, {"url": "http://www.wikihow.com/Hide-Your-Photos-on-Facebook", "passage_text": "Select photos to hide. As you look through the photos, if you see one that you want to hide, hover your mouse over it and click the pencil icon that appears. Select “Hide from Timeline.” Repeat as many times as you like. 1  Note that this process will work, to some extent, for photos you have been tagged in."}, {"url": "http://www.facebook.com/help/385017548218624/", "passage_text": "To edit the privacy settings for photo albums you've posted: 1  Go to your profile and click Photos. 2  Click Albums. 3  Use the audience selector tool under each album to control who can see your album."}]