[{"url": "http://www.fws.gov/sacramento/ES_Kids/Riparian-Brush-Rabbit/es_kids_riparian-brush-rabbit.htm", "passage_text": "Riparian brush rabbit and riparian woodrat (PDF 1MB) from the California Dept. of Pesticide Regulation. This publication is designed to help farmers avoid brush rabbits and woodrats. But it has lots of pictures and information. Visit the U.S. Fish & Wildlife Service's Homework Help page to learn more about endangered species. Photo credits: Picture at top of page by Heather Bell, USFWS. Linked photos by Laurissa Hamilton, a biologist with the Endangered Species Recovery Program."}, {"url": "http://esrp.csustan.edu/speciesprofiles/profile.php?sp=syba", "passage_text": "Life History. The riparian brush rabbit is a small cottontail that is secretive by nature. Historically, riparian brush rabbits inhabited dense, brushy areas of Valley riparian forests, marked by extensive thickets of wild rose (Rosa spp.), blackberries (Rubus spp.), and willows (Salix spp.). Riparian brush rabbits feed at the edges of shrub cover rather than in large openings. Their diet consists of herbaceous vegetation, such as grasses, sedges, clover, forbs, and buds, bark, and leaves of woody plants. One preferred plant is green clover (Trifolium wormskiolodii)."}, {"url": "https://en.wikipedia.org/wiki/Brush_Rabbit", "passage_text": "The brush rabbit (Sylvilagus bachmani), or western brush rabbit, is a species of cottontail rabbit found in western coastal regions of North America, from the Columbia River in Oregon to the southern tip of the Baja California Peninsula. It also occurs in oak and conifer habitats and it will live in brush or grassland, and form networks of runways through the vegetation. The brush rabbit does not dig its own burrow or den, but uses the burrow of other species, brush piles, or forms."}, {"url": "https://en.wikipedia.org/wiki/Brush_Rabbit", "passage_text": "The brush rabbit is not hunted as are many other cottontail species, probably because of its small size. It is not a major cause of damage to crops or other human developments in its habitat. Certain subspecies of the brush rabbit are considered endangered and are protected by state and federal laws. It also occurs in oak and conifer habitats and it will live in brush or grassland, and form networks of runways through the vegetation. The brush rabbit does not dig its own burrow or den, but uses the burrow of other species, brush piles, or forms."}, {"url": "http://esrp.csustan.edu/publications/pubhtml.php?doc=sjvrp&file=chapter02M07.html", "passage_text": "Distributional records for the riparian brush rabbit (Sylvilagus bachmani riparius). Food and Foraging .-- Avoiding large openings in shrub cover, riparian brush rabbits frequent small clearings where they feed on a variety of herbaceous vegetation, including grasses, sedges, clover, forbs, shoots, and leaves. Recovery of the riparian brush rabbit population from such a devastating event would be improbable. Like most rabbits, the riparian brush rabbit is subject to a variety of common diseases, including tularemia, plague, myxomatosis, silverwater, encephalitis, listeriosis, Q-fever, and brucellosis."}, {"url": "http://www.fws.gov/sacramento/ES_Kids/Riparian-Brush-Rabbit/es_kids_riparian-brush-rabbit.htm", "passage_text": "Scientific names are in Latin or Greek. The riparian brush rabbit is a subspecies of the brush rabbit species. Biologists add riparius to the species name to say that this is the riparian subspecies. So the scientific name of the riparian brush rabbit is Sylvilagus bachmani riparius. Brush rabbits are in the Leporidae family. But it has lots of pictures and information. Visit the U.S. Fish & Wildlife Service's Homework Help page to learn more about endangered species. Photo credits: Picture at top of page by Heather Bell, USFWS. Linked photos by Laurissa Hamilton, a biologist with the Endangered Species Recovery Program."}, {"url": "http://esrp.csustan.edu/speciesprofiles/profile.php?sp=syba", "passage_text": "The riparian brush rabbit, Sylvilagus bachmani riparius, is 1 of 13 subspecies of the brush rabbit, 8 of which are found in California. Riparian brush rabbits feed at the edges of shrub cover rather than in large openings. Their diet consists of herbaceous vegetation, such as grasses, sedges, clover, forbs, and buds, bark, and leaves of woody plants. One preferred plant is green clover (Trifolium wormskiolodii)."}, {"url": "http://esrp.csustan.edu/publications/pubhtml.php?doc=sjvrp&file=chapter02M07.html", "passage_text": "The species is found west of the Cascade-Sierra crest from the Columbia River to the tip of Baja California (Williams and Basey 1986). Thirteen subspecies of brush rabbit are recognized. The riparian brush rabbit, S. b. riparius, is one of eight subspecies found in California. It was described by Orr (1935) based on a specimen from the west side of the San Joaquin River about 3 kilometers (2 miles) northeast of Vernalis in Stanislaus County, California. Recovery of the riparian brush rabbit population from such a devastating event would be improbable. Like most rabbits, the riparian brush rabbit is subject to a variety of common diseases, including tularemia, plague, myxomatosis, silverwater, encephalitis, listeriosis, Q-fever, and brucellosis."}, {"url": "http://eol.org/pages/122356/details", "passage_text": "The brush rabbit (Sylvilagus bachmani), or western brush rabbit, is a species of cottontail rabbit found in western coastal regions of North America, from the Columbia River in Oregon to the southern tip of the Baja California peninsula. "}, {"url": "http://www.iucnredlist.org/details/41302/0", "passage_text": "Population: Except for the Riparian brush rabbit (subspecies riparius) which is state and federally listed as endangered (Williams et al. 2004), Sylvilagus bachmani is considered common where it is known to exist, throughout Oregon, California, and Baja California (Chapman and Ceballos 1990). This refuge has about 285 ha of habitat for brush rabbits. An additional few hundred hectares are actively being restored from cropland to natural, riparian vegetation. Refugia from flooding are also being established on the refuge for rabbits and other terrestrial wildlife (Hansen 2006)."}]