[{"url": "https://en.wikipedia.org/wiki/DNAdependent_DNA_polymerase", "passage_text": "DNA polymerase III holoenzyme is the primary enzyme involved in DNA replication in E. coli and belongs to Family C polymerases. It consists of three assemblies: the pol III core, the beta sliding clamp processivity factor and the clamp-loading complex."}, {"url": "http://www.answers.com/Q/What_is_DNA_polymerase_III", "passage_text": "Once a primer is assembled by primase, DNA polymerase III begins its work of adding nucleotides to the 3 prime end of the primer. It is important to note that replication proceeds in two directions, since a DNA replication bubble consists of two DNA templates."}, {"url": "https://www.ndsu.edu/pubweb/~mcclean/plsc431/eukarychrom/eukaryo2.htm", "passage_text": "The second two activities of DNA Pol I are important for replication, but DNA Polymerase III (Pol III) is the enzyme that performs the 5'-3' polymerase function. 1  Primase-The requirement for a free 3' hydroxyl group is fulfilled by the RNA primers that are synthesized at the initiation sites by these enzymes."}, {"url": "http://www.answers.com/Q/What_is_DNA_polymerase_III", "passage_text": "DNA polymerase III (not DNA polymerase) is an enzyme that works in association with other enzymes during the replication of a DNA molecule. DNA replication begins when the enz … yme, known as helicase unwinds a DNA strand."}, {"url": "https://en.wikipedia.org/wiki/DNA_polymerase_III_holoenzyme", "passage_text": "DNA polymerase III holoenzyme is the primary enzyme complex involved in prokaryotic DNA replication. It was discovered by Thomas Kornberg (son of Arthur Kornberg) and Malcolm Gefter in 1970."}, {"url": "http://www.tokresource.org/tok_classes/biobiobio/biomenu/dna_replication/index.htm", "passage_text": "7.2 .2 Explain the process of DNA replication in prokaryotes, including the role of enzymes (helicase, DNA polymerase, RNA primase and DNA ligase), Okazaki fragments and deoxynucleoside triphosphates. The explanation of Okazaki fragments in relation to the direction of DNA polymerase III action is required."}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/dna-replication-bacteria-enzyme-dna-polymerase-iii-abbreviated-dna-pol-iii-adds-nucleotide-q3844347", "passage_text": "In DNA replication in bacteria, the enzyme DNA polymerase III (abbreviated DNA pol III) adds nucleotides to a template strand of DNA. But DNA pol III cannot start a new strand from scratch."}, {"url": "http://www.worthington-biochem.com/DNAECI/default.html", "passage_text": "DNA polymerase III is the main replicative enzyme. DNA polymerase IV and V have large active sites that allow for more base misincorporation, and are therefore more error-prone. They also lack proofreading-exonuclease subunits to correct misincorporations (Nohmi 2006, and Hastings et al. 2010)."}, {"url": "http://www.jbc.org/content/273/4/2452.full", "passage_text": "The pol III HE is itself composed of 10 subunits (8). α, the catalytic polymerase subunit (9), ε, the 3′ → 5′ proofreading exonuclease (10), and θ, a subunit of unknown function, associate to form the polymerase core (11). α binds ε but not θ, whereas θ binds ε but not α (12), suggesting a linear array of αεθ."}]