[{"url": "https://nz.finance.yahoo.com/news/How-long-should-you-keep-tax-brn-1091529861.html", "passage_text": "Basic records are documents that everybody should keep. Although the Internal Revenue Service doesn't require you to keep your records in a particular way, it does urge taxpayers to keep them in an orderly fashion and in a safe place. Also keep in mind that while the basic IRS review period is three years, there are exceptions -- in the tax collector's favor.If the agency suspects you've underreported your income or has questions about a worthless stock write-off, look out."}, {"url": "http://www.bankrate.com/finance/personal-finance/how-long-to-keep-financial-records.aspx", "passage_text": "Credit card receipts and statements. Length of time to keep, and why: From 45 days to seven years. 1  Keep your original receipts until you get your monthly statement; shred the receipts if the two match up. 2  Keep the statements for seven years if tax-related expenses are documented. Length of time to keep, and why: From one year to permanently. 1  Go through your checks each year and keep those related to your taxes, business expenses, home improvements and mortgage payments. 2  Shred those that have no long-term importance."}, {"url": "http://www.aranz.org.nz/Site/resources/general/recordkeeping_legislation.aspx", "passage_text": "Employment Relations Act 2000. This Act contains a of number recordkeeping retention requirements. Sections 130 and 132 require employees wage (and other money payable) records to be kept for 6 years. Section 130 requires that wages and time records are to be available for the preceding 6 years."}, {"url": "https://www.gov.uk/running-a-limited-company/company-and-accounting-records", "passage_text": "How long to keep records. You must normally keep records for at least 6 years from the end of the last company financial year they relate to. You may need to keep records longer if: 1  they show a transaction that covers more than one of the company’s accounting periods. 2  the company has bought something that it expects to last more than 6 years, like equipment or machinery. 3  you sent your Company Tax Return late"}, {"url": "http://www.ird.govt.nz/non-profit/np-records/keep/np-records-keeping.html", "passage_text": "What records your organisation needs to keep. You have to keep sufficient records to calculate the income, expenses and GST liability of your organisation, and to enable us to confirm your accounts if necessary. The records you must keep are: 1  receipt and payment account books. 2  bank statements. 3  invoices (including GST tax invoices). 4  receipts. For GST you do not need to hold a tax invoice for items costing less than $50, but you do need to maintain a record of such payments. For income tax, you should have invoices for all expenses, whatever the amount."}, {"url": "http://www.ird.govt.nz/non-profit/np-records/keep/np-records-keeping.html", "passage_text": "Note. If you file your tax returns electronically, you must keep a paper copy of the return (and supporting records) for seven years. It is important to keep all this information as we routinely audit people's records. For GST you do not need to hold a tax invoice for items costing less than $50, but you do need to maintain a record of such payments. For income tax, you should have invoices for all expenses, whatever the amount."}, {"url": "http://www.bankrate.com/finance/personal-finance/how-long-to-keep-financial-records.aspx", "passage_text": "Bank records. Length of time to keep, and why: From one year to permanently. 1  Go through your checks each year and keep those related to your taxes, business expenses, home improvements and mortgage payments. 2  Shred those that have no long-term importance."}, {"url": "http://www.cra-arc.gc.ca/records/", "passage_text": "Keeping records. Records are your accounting and other financial information documents kept in an organized way. By law, you have to keep records when any of these apply: 1  you are carrying on a business in Canada. 2  you are engaged in a commercial activity in Canada. 3  you are responsible for collecting tax or other amounts. 4  you have to file an income tax return. 5  you have to file a Goods and Services Tax/Harmonized Sales Tax (GST/HST) return"}, {"url": "http://www.ird.govt.nz/non-profit/np-records/keep/np-records-keeping.html", "passage_text": "How long your organisation needs to keep it's records. Your organisation must hold all records for seven years, even if you cease operating (except for incorporated organisations that have been wound up and dissolved). For GST you do not need to hold a tax invoice for items costing less than $50, but you do need to maintain a record of such payments. For income tax, you should have invoices for all expenses, whatever the amount."}, {"url": "http://www.bankrate.com/finance/personal-finance/how-long-to-keep-financial-records.aspx", "passage_text": "You can't take everything with you, but you should safely store or electronically scan and save certain essential documents. The following are suggestions about how long you should keep personal finance and investment records on file: Length of time to keep, and why: From one year to permanently. 1  Go through your checks each year and keep those related to your taxes, business expenses, home improvements and mortgage payments. 2  Shred those that have no long-term importance."}]