[{"url": "http://www.womansday.com/style/beauty/tips/a4944/waxing-101-tips-tricks-for-beginners-108331/", "passage_text": "In the last several years, waxing has become a common (and popular) service offered at salons and spas. Whether it's the eyebrow, upper lip, armpit or, well, someplace more intimate, many people choose waxing for longer-lasting hair removal. Although the pain does subside as soon as the wax is over, the area can remain sensitive, which is why Zicu says not to use any scrubs for the next 48 hours and not to expose the area to direct sun for at least 24 hours. To treat redness or swelling, apply a small amount of cortisone cream from the drugstore."}, {"url": "http://www.waxaway.com.au/faqs/", "passage_text": "Waxing is a popular depilatory method where hair is removed from the roots for longer lasting results. Wax is applied to the skin and clings to the hairs. When wax is removed, the hairs are stuck to the wax, leaving your skin smooth. Hair regrowth becomes softer and results last longer than other forms of hair removal."}, {"url": "http://beauty.about.com/od/hairremoval/ht/bikiniwax.htm", "passage_text": "Brazilian bikini waxes were introduced to New York in 1987 by the J Sisters, 7 Brazilian-born sisters. The Brazilian remains a popular hair removal method in the United States. Brazilian waxes differ from regular bikini waxes because hair is removed in the front, back and everything in between. Sometimes a  landing strip  is left in the front, but many clients opt for the  Hollywood Wax , where everything is removed."}, {"url": "http://www.waxaway.com.au/faqs/", "passage_text": "Hard Wax (Salon Wax or Salon Wax Sensitive) is a peel off wax applied thickly on the skin and removed with your fingertips. It is used for waxing sensitive & delicate areas such as eyebrows, upper lip, facial waxing, underarms, bikini line & Brazilian waxing. Wax is applied to the skin and clings to the hairs. When wax is removed, the hairs are stuck to the wax, leaving your skin smooth. Hair regrowth becomes softer and results last longer than other forms of hair removal."}, {"url": "http://hairremoval.about.com/od/waxing/a/waxing101.htm", "passage_text": "Wax on. A warm wax mixture is spread over hair in the direction of its growth and a paper or cloth strip is then placed on top of soft wax. Hard wax doesn't require a strip because it cools solid enough, and becomes a strip in itself. "}, {"url": "https://en.wikipedia.org/wiki/Waxing", "passage_text": "Waxing is a form of semi-permanent hair removal which removes the hair from the root. This removes the wax along with the hair. Strip-less wax (as opposed to strip wax), also referred to as hard wax, is applied somewhat thickly and with no cloth or paper strips. The wax then hardens when it cools, thus allowing the easy removal by a therapist without the aid of cloths."}, {"url": "https://simple.wikipedia.org/wiki/Waxing", "passage_text": "Waxing is a method of removing hair from the body. Waxing removes the whole hair including the root. Both men and women engage in waxing, as do female children as young as eight. Any area of the body can be waxed but the more common areas are the legs, underarms, genitals, torso and face. "}, {"url": "https://en.wikipedia.org/wiki/Bikini_waxing", "passage_text": "Bikini waxing is the epilation of pubic hair in and around the pubic region by the use of wax. While the practice is mainly associated with women, men at times also remove pubic hair. With certain styles of women's swimwear, pubic hair may become visible around the crotch area of a swimsuit. It is also known as a partial Brazilian wax. Hair of the peri-anal area and labia may be removed. Removal of hair from these areas is also known as the Playboy wax or G-waxing. The landing strip wax has become popular with models who must wear garments of an extreme narrowness in the crotch region."}, {"url": "https://en.wikipedia.org/wiki/Waxing", "passage_text": "There are many types of waxing suitable for removing unwanted hair. Strip waxing (soft wax) is accomplished by spreading a wax thinly over the skin. A cloth or paper strip is applied and pressed firmly, adhering the strip to the wax and the wax to the skin. This removes the wax along with the hair. Strip-less wax (as opposed to strip wax), also referred to as hard wax, is applied somewhat thickly and with no cloth or paper strips. The wax then hardens when it cools, thus allowing the easy removal by a therapist without the aid of cloths."}]