[{"url": "http://www.wikihow.com/Become-a-Radiology-Technician", "passage_text": "You will need to pursue a higher education to become a radiologic technologist, so you will have to start here if you do not have this degree already. If you're still in high school and know you want to be a radiologic technologist, then you can try to take courses that can help you succeed in the field."}, {"url": "http://www.radiology-schools.com/radiology-degrees.html", "passage_text": "An associate degree may be required before you can enter a radiology bachelor's degree program. Each school has different requirements, so it is important to request information and discuss the requirements with a school representative."}, {"url": "http://learn.org/articles/Radiography_Associates_Degree.html", "passage_text": "According to the American Registry of Radiologic Technologists (ARRT) as of January, 2015, all candidates for certification must have earned an academic degree in order to be eligible to sit for a certification examination (www.arrt.org)."}, {"url": "http://radiographycareers.co.uk/how-do-i-become-radiographer", "passage_text": "To work as a radiographer in the UK you must be registered with the Health and Care Professions Council (HCPC). CASE STUDY Find out how Laura returned to radiography after seven years out of the profession. Check the HCPC's website for information on registration renewal or visit the Society of Radiographers website."}, {"url": "http://www.onlineradiologyschools.org/everything-you-need-to-know-about-radiography-and-radiologic-sciences-programs.html", "passage_text": "Types of Radiography Degrees. The type of educational program you attend depends on your career goals. On average, you’ll have to go through a longer program if you want to be a radiology technologist, since you’ll have more to learn. You can get started in this career field with an associate’s degree."}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/radiographer.aspx", "passage_text": "To work as a radiographer you will need a degree approved by the Health and Care Professions Council (HCPC). Before you apply, you will need to decide whether you want to work in diagnostic radiography or therapeutic radiography. Visiting a radiography department or radiotherapy centre may help you decide."}, {"url": "http://learn.org/articles/Radiography_Associates_Degree.html", "passage_text": "Radiographers, or radiologic technologists, operate and maintain x-ray machines. Find out about associate's degree programs that train you to work in this field. Schools offering Cardiovascular Sonography degrees can also be found in these popular choices."}, {"url": "http://www.radiology-schools.com/radiology-bachelors-degree.html", "passage_text": "A radiology bachelors degree is designed to prepare you for leadership roles such as Lead Radiologic Technologist, Radiology Program Director, or Radiology Trainer. In addition to leadership roles, a radiology bachelors degree will set the foundation for further career development in roles such as Radiologist Assistant."}, {"url": "http://study.com/radiology_degree.html", "passage_text": "Essential Information. There are associate's, bachelor's and master's degree programs in radiology, each of which builds in complexity through advanced coursework and hands-on training. With the associate's degree program, students are introduced to radiology, basic patient care and the equipment used."}]