[{"url": "http://searchsecurity.techtarget.com/definition/AAA-server", "passage_text": "An AAA server is a server program that handles user requests for access to computer resources and, for an enterprise, provides authentication, authorization, and accounting (AAA) services. The AAA server typically interacts with network access and gateway servers and with databases and directories containing user information. The current standard by which devices or applications communicate with an AAA server is the Remote Authentication Dial-In User Service (RADIUS) ."}, {"url": "https://en.wikipedia.org/wiki/AAA_protocol", "passage_text": "Diameter is a protocol within the family of AAA Protocols. Diameter uses the URI scheme; AAA stands for Authentication, Authorization and Accounting, AAAS stands for Authentication, Authorization and Accounting with Secure Transport, which is a Diameter based Protocol."}, {"url": "http://www.techrepublic.com/blog/data-center/what-is-aaa-and-how-do-you-configure-it-in-the-cisco-ios/", "passage_text": "When it comes to network security, AAA is a requirement. Here is what each of these are used for and why you should care: 1  Authentication: Identifies users by login and password using challenge and response methodology before the user even gains access to the network. 2  Depending on your security options, it can also support encryption."}, {"url": "http://searchsecurity.techtarget.com/definition/authentication-authorization-and-accounting", "passage_text": "The AAA server compares a user's authentication credentials with other user credentials stored in a database. If the credentials match, the user is granted access to the network. CA Advanced Authentication. vs. CRYPTOCARD BlackShield. Authentication, authorization, and accounting (AAA) is a term for a framework for intelligently controlling access to computer resources, enforcing policies, auditing usage, and providing the information necessary to bill for services."}, {"url": "https://en.wikipedia.org/wiki/AAA_protocol", "passage_text": "1 Visited AAA (V-AAA) – The AAA server in the visited network from which a roamer is receiving service. 2  The V-AAA in the serving network communicates with the H-AAA in a roamer's home network. 3  Authentication requests and accounting information are forwarded by the V-AAA to the H-AAA, either directly or through a B-AAA. Diameter uses the URI scheme; AAA stands for Authentication, Authorization and Accounting, AAAS stands for Authentication, Authorization and Accounting with Secure Transport, which is a Diameter based Protocol."}, {"url": "http://www.cisco.com/c/en/us/support/docs/security-vpn/terminal-access-controller-access-control-system-tacacs-/10384-security.html", "passage_text": "Introduction. This document explains how to configure Authentication, Authorization, and Accounting (AAA) on a Cisco router using Radius or TACACS+ protocols. The goal of this document is not to cover all AAA features, but to explain the main commands and provide some examples and guidelines. Note: The server (Radius or TACACS+) will not reply to an aaa authentication request sent by the access server if there is no IP connectivity, if the access server is not correctly defined on the AAA server or the AAA server is not correctly defined on the access server."}, {"url": "http://www.wisegeek.com/what-is-a-aaa-server.htm", "passage_text": "An AAA server refers to the process of authentication, authorization and accounting utilized by the Remote Authentication Dial In User Services (RADIUS) network protocol. RADIUS permits remote users or computers to access a computerized network server. When the AAA server process is not required, a server is called “open” or “anonymous.” RADIUS and AAA server protocol is usually used by internet service providers (ISPs) to identify and bill their clients."}]