[{"url": "http://www.garden-counselor-lawn-care.com/when-to-apply-crabgrass-preventer.html", "passage_text": "For Early and Best Control. Crabgrass seeds can germinate each year when nighttime soil temperatures reach over 50 degrees for 3 days. This “wakes up” the seed, and starts it on its process of growing up to be your worst nightmare. Note, the seed “can” germinate at that point."}, {"url": "http://www.doctorgreen.com/beneficial-services/crabgrass/", "passage_text": "Crabgrass germination is related to soil temperature. When the soil temperature reaches 60 degrees F, crabgrass begins to germinate. However, the soil temperature must be in this range at least for a week."}, {"url": "http://www.gardenandflowers.com/facts_7810501_crab-grass-germinate.html", "passage_text": "Germination Period. Once soil reaches germination temperatures, crabgrass continues to sprout through spring and summer. Germination generally slows down in late July and August, as existing crabgrass plants mature and begin to set seed. Freezing temperatures kill the annual in fall."}, {"url": "http://www.ehow.com/info_8073362_crabgrass-germination-temperatures.html", "passage_text": "Crabgrass needs soil temperatures of 60 degrees to germinate, according to the University of Rhode Island Horticulture Program. Soil temperatures must remain around 60 degrees for a week. If soil temperatures dip or if there is a sudden frost, crabgrass germination will be delayed."}, {"url": "http://www.ehow.com/info_8073362_crabgrass-germination-temperatures.html", "passage_text": "Do not wait until soil temperatures are optimal for crabgrass germination before applying pre-emergent herbicide. Apply it right before it is within crabgrass' optimal range or when soil temperatures hit 55 degrees, according to Danny Lipford."}, {"url": "http://www.gardenandflowers.com/facts_7810501_crab-grass-germinate.html", "passage_text": "Once soil reaches germination temperatures, crabgrass continues to sprout through spring and summer. Germination generally slows down in late July and August, as existing crabgrass plants mature and begin to set seed. Freezing temperatures kill the annual in fall."}, {"url": "http://www.gardenandflowers.com/facts_7810501_crab-grass-germinate.html", "passage_text": "Herbicides. Apply pre-emergent herbicides before soil temperatures rise to the critical germination level. Timing varies depending on your individual climate; homeowners in lower latitudes may need to treat their lawns in late February, while colder landscapes can wait until early May."}]