[{"url": "http://plato.wilmington.edu/faculty/kcipolli/24Hormones%20and%20the%20Endocrine%20System.pdf", "passage_text": "C. the nontarget tissues catabolize or destroy the hormones. D. the hormones know where their targets are located. . .. 25% 25% 25% 25% Oxytocin, the milk-release hormone secreted from nerve endings (axon terminals) in the posterior pituitary gland, is synthesized in a) the anterior pituitary gland. b) the hypothalamus. c) the mammary glands. d) the posterior pituitary gland. •d) are carried to target cells in the blood. •e) are produced by endocrine glands. . .. 20% 20% 20% 20% 20% Hormones are transported throughout the circulatory system, but they affect only specific tissues or cells because A. only the capillaries at the target will let"}, {"url": "http://www.biologyaspoetry.com/terms/paracrine_signaling.html", "passage_text": "Hemostasis, that is, various mechanisms that can lead to the clotting of blood, is a process that involves paracrine signaling as so too are various signals exchanged between leukocytes (i.e., white blood cells) such as during antigen presentation. Paracrine signaling can be loosely viewed as hormone-like signaling though, unlike hormones, the signalling molecules do not enter the blood and therefore have only local immediate effects rather than systemic effects."}, {"url": "http://www.biologyaspoetry.com/terms/paracrine_signaling.html", "passage_text": "This is paracrine-like because neurotransmitters are hormone like – indeed, some can serve also as hormones – but the primary effects of neurotransmitters are only immediately local, i.e., from one neuron (presynaptic) to another (postsynaptic). For more on this topic, see Wikipedia and Google. Contact web master. Paracrine signaling can be loosely viewed as hormone-like signaling though, unlike hormones, the signalling molecules do not enter the blood and therefore have only local immediate effects rather than systemic effects."}, {"url": "http://www.answers.com/Q/What_is_paracrine_signaling", "passage_text": "Synaptic signaling is a paracrine t … ype signaling but rather than being secreted to several local cells in the vicinity of the signaling cell, the signaling molecules are just secreted to a receptor cell only a narrow space away. Confidence votes 14. Paracrine signaling is a form of cell signaling in which the target cell is near (para = near) the signal-releasing cell. A distinction is sometimes made between paracrine and autocrine signaling"}, {"url": "http://www.fastbleep.com/biology-notes/31/174/997", "passage_text": "Examples include autocrine, where the cell signals to itself, and paracrine, where a cell signals to a nearby neighbour. However, when cells need to communicate a message over a long distance, they can use the endocrine system. Endocrine signalling uses chemicals called hormones to send messages throughout the body. The hormones are released from the cell into the bloodstream and can travel around the entire body. There are many types of hormones-the chemicals which are responsible for endocrine signalling. Like most signalling pathways, hormones will bind to receptors on specific cells. This will produce the desired response within the cell."}, {"url": "https://en.wikipedia.org/wiki/Paracrine_signalling", "passage_text": "Paracrine signaling is a form of cell-cell communication in which a cell produces a signal to induce changes in nearby cells, altering the behavior or differentiation of those cells. The Wnt signaling pathways are critical in cell-cell signaling during normal development and embryogenesis and required for maintenance of adult tissue, therefore it is not difficult to understand why disruption in Wnt signaling pathways can promote human degenerative disease and cancer."}, {"url": "https://en.wikipedia.org/wiki/Paracrine_signalling", "passage_text": "Signaling molecules known as paracrine factors diffuse over a relatively short distance (local action), as opposed to endocrine factors (hormones which travel considerably longer distances via the circulatory system), juxtacrine interactions, and autocrine signaling. The Wnt signaling pathways are critical in cell-cell signaling during normal development and embryogenesis and required for maintenance of adult tissue, therefore it is not difficult to understand why disruption in Wnt signaling pathways can promote human degenerative disease and cancer."}, {"url": "https://en.wikipedia.org/wiki/Paracrine_signalling", "passage_text": "In order for paracrine factors to successfully induce a response in the receiving cell, that cell must have the appropriate receptors available on the cell membrane to receive the signals, also known as being competent. The Wnt signaling pathways are critical in cell-cell signaling during normal development and embryogenesis and required for maintenance of adult tissue, therefore it is not difficult to understand why disruption in Wnt signaling pathways can promote human degenerative disease and cancer."}, {"url": "http://scicurious.scientopia.org/2009/11/09/oxytocin-starting-with-the-basics/", "passage_text": "Hormones can have three major types of action: autocrine, paracrine, and endocrine. Autocrine refers to chemicals released from a cell that have an action on that same cell (like negative feedback, where a cell releases a chemical that hits receptors on the same cell, and stops further release of the chemical). Oxytocin is one of the two major hormones which are secreted from an area of the brain called the posterior pituitary (the other one is called vasopressin, and is involved in water regulation, though it also has been known to curl the toes of male voles)."}]