[{"url": "http://www.nsi.tafensw.edu.au/campus/Meadowbank/Default.aspx", "passage_text": "The student infopoint located in building P at Meadowbank Campus provides a modern look, with comfortable seating and easy to use information stations that help our current and future students with their enquiries. Meadowbank is home to one of only two Cisco Academy Training Centres in the Australasia Pacific region. Information technology students at Meadowbank access Cisco vendor certification training from basic essentials through all professional CCNA levels."}, {"url": "http://www.discovertasmania.com.au/attraction/lakemeadowbank", "passage_text": "Lake Meadowbank is between Hamilton and Ouse on the Lyell Highway, a one-hour drive north-west of Hobart. Lake Meadowbank is the most downstream lake in the Derwent River hydro-scheme. Like all Hydro Tasmania lakes, Lake Meadowbank is stocked with trout. Try your luck fly fishing, spinning or trolling for brown trout-the lake’s most abundant fish-or perhaps a big rainbow trou"}, {"url": "http://www.booking.com/hotel/gb/meadowbank.html", "passage_text": "Looking out across the beautiful Lake District, family-run Meadowbank bed and breakfast is just 5 minutes’ walk from Ambleside’s charming centre. It serves freshly cooked breakfasts, made with local produce. "}, {"url": "https://en.wikipedia.org/wiki/Meadowbank,_New_South_Wales", "passage_text": "Meadowbank railway station is on the North Shore, Northern & Western Line of the Sydney Trains network. Meadowbank has two side platforms. The station is served by two trains per hour each way, with additional trains on weekday peak hours. Meadowbank is a mixed commercial-residential area. Meadowbank features a small group of shops on either side of Meadowbank railway station and a shopping centre within the residential apartment complex to the south, along Bay Drive."}, {"url": "https://en.wikipedia.org/wiki/Meadowbank,_New_South_Wales", "passage_text": "Meadowbank is located 15 kilometres west of the Sydney central business district, in the local government area of the City of Ryde and part of the Northern Suburbs area. Meadowbank is a mixed commercial-residential area. Meadowbank features a small group of shops on either side of Meadowbank railway station and a shopping centre within the residential apartment complex to the south, along Bay Drive."}, {"url": "http://www.nsi.tafensw.edu.au/campus/Meadowbank/Default.aspx", "passage_text": "Take a campus tour. One of the largest campuses in Sydney, our Meadowbank campus offers an extensive range of study areas. Meadowbank is the Institute’s higher education campus offering degrees in network security and finance. Meadowbank is home to one of only two Cisco Academy Training Centres in the Australasia Pacific region. Information technology students at Meadowbank access Cisco vendor certification training from basic essentials through all professional CCNA levels."}, {"url": "http://www.ryde.nsw.gov.au/Recreation/Parks-and-Sportsgrounds/Find-a-Park-or-Sportsground/Meadowbank-Park", "passage_text": "Meadowbank Park. Meadowbank Park is one of our major sporting and recreation areas. There are more than 10 playing fields used mainly for soccer and cricket, as well as netball hard courts and tennis courts. There are three playgrounds and walking and cycling paths along the Parramatta River as part of the Ryde Riverwalk. "}, {"url": "https://en.wikipedia.org/wiki/Meadowbank,_New_South_Wales", "passage_text": "Meadowbank is a suburb of Sydney, New South Wales, Australia. Meadowbank is a mixed commercial-residential area. Meadowbank features a small group of shops on either side of Meadowbank railway station and a shopping centre within the residential apartment complex to the south, along Bay Drive."}, {"url": "http://www.nsi.tafensw.edu.au/international/campuses/meadowbank", "passage_text": "Take a campus tour. One of the largest TAFE campuses in Sydney, our Meadowbank Campus offers an extensive range of programs to international students. Meadowbank Campus is the Institute’s higher education campus delivering degree programs in information technology and accounting. Specialist training facilities include the sports and fitness centre and massage therapy clinic."}, {"url": "https://en.wikipedia.org/wiki/Meadowbank,_New_South_Wales", "passage_text": "Meadowbank has a ferry wharf on the Parramatta River as part of the Sydney Ferries network. The next wharf west is Sydney Olympic Park and east is Kissing Point. The ferry primarily services tourists on weekends and city workers during the week. Meadowbank is a mixed commercial-residential area. Meadowbank features a small group of shops on either side of Meadowbank railway station and a shopping centre within the residential apartment complex to the south, along Bay Drive."}]