[{"url": "http://www.thesaurus.com/browse/dutch+uncle", "passage_text": "Usage Notes. Because Dutch is used here to describe someone manifesting the opposite of warm, affectionate, typically avuncular behavior, this term is sometimes perceived as insulting to or by the Dutch. See also Dutch. "}, {"url": "http://www.thefreedictionary.com/Dutch+uncle", "passage_text": "Dutch uncle. n. 1. a person who criticizes or reproves frankly and severely. n. "}, {"url": "http://dictionary.reverso.net/english-definition/Dutch%20uncle", "passage_text": "2 ♦ the Pennsylvania Dutch functioning as pl a group of German-speaking people in E Pennsylvania, descended from 18th-century settlers from SW Germany and Switzerland. South African Dutch. n (not used in South Africa) another name for → Afrikaans. English Collins Dictionary-English Definition & Thesaurus. See also: Dutch, Dutch auction, Dutch barn, Dutch cap. Add your entry in the Collaborative Dictionary"}, {"url": "http://www.merriam-webster.com/dictionary/Dutch%20uncle", "passage_text": "Definition of DUTCH UNCLE. : one who admonishes sternly and bluntly. "}, {"url": "http://idioms.thefreedictionary.com/Dutch+uncle", "passage_text": "a man who gives frank and direct advice to someone. (In the way an uncle might, but not a real relative.) I would not have to lecture you like a Dutch uncle if you were not so extravagant. He acts more like a Dutch uncle than a husband. He's forever telling her what to do in public. Dutch uncle. A stern, candid critic or adviser, as in When I got in trouble with the teacher again, the principal talked to me like a Dutch uncle. This expression, often put as talk to one like a Dutch uncle, presumably alludes to the sternness and sobriety attributed to the Dutch."}, {"url": "http://www.macmillandictionary.com/us/dictionary/american/dutch-uncle", "passage_text": "Thesaurus. The thesaurus of synonyms and related words is fully integrated into the dictionary. Click on the thesaurus category heading under the button in an entry to see the synonyms and related words for that meaning. The Macmillan Dictionary blog explores English as it is spoken around the world today. American definition and synonyms of Dutch uncle from the online English dictionary from Macmillan Publishers Limited."}, {"url": "http://www.macmillandictionary.com/us/dictionary/american/dutch-uncle", "passage_text": "A must for anyone with an interest in the changing face of language. The Macmillan Dictionary blog explores English as it is spoken around the world today. American definition and synonyms of Dutch uncle from the online English dictionary from Macmillan Publishers Limited."}, {"url": "http://idioms.thefreedictionary.com/talk+to+like+a+Dutch+uncle", "passage_text": "talk to. Also, give a talking to. Scold, reprimand, as in The teacher said he'd have to talk to Jeff after school, or Dad gave us both a good talking to. [ Colloquial; second half of 1800s] For talk to like a Dutch uncle, see Dutch uncle. See also: talk, to. "}, {"url": "http://www.urbandictionary.com/define.php?term=Dutch%20uncle", "passage_text": "20 Words related to Dutch uncle. 1  cleveland steamer. 2  dutch-uncle. 3  dutch uncles. 4  chili dog. 5  classless. 6  debt. 7  dirty sanchez. 8  double dutch. 9  dutch. 10  dutch day off. 11  dutche uncle. 12  dutch thumb. 13  fart. 14  mustache ride. 15  pass that dutch. 16  portugese breakfast. 17  sixty-nine. 18  unckle. 19  uncle. 20  wet willie. "}]