[{"url": "http://www.youtube.com/watch?v=cjULid1Z0k0", "passage_text": "How to find out who's been checking out my facebook profile. Here's how to find out who's checking you out on Facebook! Copy and paste the unique Facebook ID's who have been checking out your profile. Google Chrome (download for free and open Facebook in this) : https://support.google.com/chrome/ans... Please stay AWAY from apps that say they can do it for you."}, {"url": "http://www.socialsprouts.com/2011/02/three-secret-tricks-to-find-out-whos.html", "passage_text": "When you look at the three categories of people: 1) people who have accepted your invitation 2) people who are still waiting to reply, 3) people who have rejected your invitation, you can see the top 5 people who appear are the top 5 people in each category who look at your profile or pictures. Test the Tricks trick: send a message to, poke, post on the wall of (best bet-do all three) of someone you see is currently active on facebook ... afterwhich check your facebook reveal tricks to see if they are showing up ..."}, {"url": "https://answers.yahoo.com/question/index?qid=20100224104524AA6nyHg", "passage_text": "No, it can't determine who views your profile the most. Most of the applications similar to that one only takes a look at one's profile and checks out who interacts with one the most (eg, commenting, posting wall messages, etc). Don't worry, you're not the only one who stalks your friend's profiles. I do that to. Rating Newest Oldest. Best Answer: Facebook doesn't allow people to track who views their profiles. Facebook applications, on the other hand, are unable to track anybody unless they have the consent of the viewer. Follow the source to see the Facebook's statement about this issue."}, {"url": "https://www.grahamcluley.com/2013/05/who-view-my-facebook-profile/", "passage_text": "And, of course, you might be keen to find out if that creepy guy in the lunch queue at work is cyber-stalking you. Bad news, I'm afraid. There is *no* way that you can find out who has been looking at your Facebook profile. The only people who might have the data is Facebook itself, and it doesn't seem interested in providing the functionality. So anything which claims to offer you a way to find out who has been peeking at your profile, is almost certainly a scam. Proceed with caution and be careful not to be duped into clicking on any links, or completing any surveys to get some magic Facebook power."}, {"url": "https://m.facebook.com/Neteworker", "passage_text": "Find out who is Stalking your profile is on Facebook. To connect with Find out who is Stalking your profile, join Facebook today."}, {"url": "https://uk.news.yahoo.com/who%E2%80%99s-been-looking-at-your-facebook-page--can-you-find-out-.html", "passage_text": "Facebook. First the warning: there are s cams aplenty promising to show you who is stalking your Facebook page. I put in a call to Facebook and spoke with their technical folks-the truth is no-one can see who's been on your Facebook page. There are no features buried in the Facebook settings with that data. There are no apps that can unearth that info. Facebook says it is one of the most common scam come-ons on the site. Don't fall for it; you cannot see who's looking at your profile (and no one can see if you've been looking at theirs)."}, {"url": "http://www.socialsprouts.com/2011/02/three-secret-tricks-to-find-out-whos.html", "passage_text": "Facebook Reveal Trick #1: The first method is to refresh your profile page and see which friends appear again and again on your profile. Typically, these are the people who look at your profile the most over a given time period. Test the Tricks trick: send a message to, poke, post on the wall of (best bet-do all three) of someone you see is currently active on facebook ... afterwhich check your facebook reveal tricks to see if they are showing up ..."}, {"url": "https://www.simplyzesty.com/blog/article/september-2009/new-facebook-app-gets-5-million-downloads-in-1-day,-lets-you-find-your-stalkers", "passage_text": "Well it has just become a thing of the past thanks to a new application called Fan check just launched on Facebook that allows you to see who is stalking you (or just generally checking out your profile). "}, {"url": "http://virgintech.org/find-whos-checking-facebook-profile-facebook-spam.html", "passage_text": "New app. www.facebook.com/pages/FIND-OUT-WHOS-CHECKING-YOUR-FACEB00K-PR0FILE-NEW-UPDATED-APP/141870902496388. OMG OMG OMG… I can’t believe this actually works! Now you really can see who views your facebook profile!!! This is what Facebook’s recent status update states about this rapidly growing spam. On Facebook, there’s no way to see who has visited your profile. We’ve also prevented others from providing this functionality. We’re working hard to block and remove websites, Pages, and applications that claim to do this."}, {"url": "http://virgintech.org/find-whos-checking-facebook-profile-facebook-spam.html", "passage_text": "Facebook itself says that there is no way at all with which you can see/check who is visiting your facebook profile. This is what Facebook’s recent status update states about this rapidly growing spam. On Facebook, there’s no way to see who has visited your profile. We’ve also prevented others from providing this functionality. We’re working hard to block and remove websites, Pages, and applications that claim to do this. If you see one, don’t be fooled, and report it to us immediately"}]