[{"url": "http://www.answers.com/Q/Is_sulfur_magnetic", "passage_text": "The element does have a magnetic moment. This is because there is one pair of electrons and two individual electron molecules in the valence shell. This is to say that the unp … aired electron molecules create a magnetic moment. That is sulfur's magnetic property."}, {"url": "http://www.bbc.co.uk/bitesize/ks2/science/physical_processes/magnets/read/1/", "passage_text": "Introduction. Magnets have north poles and south poles. These attract each other. But two north poles will repel each other, as will two south poles. Iron is magnetic, so any metal with iron in it will be attracted to a magnet. Most other metals, like aluminium, copper or gold, are not magnetic."}, {"url": "http://www.answers.com/Q/Is_sulfur_magnetic", "passage_text": "Iron is a magnetic substance, which means it is attracted by a magnet. On the other hand, Sulfur is a non-magnetic substance. If you place a magnet near a mixture of Iron and … Sulfur, the iron pieces will stick to the magnet, while the sulfur powder will remain."}, {"url": "http://www.answers.com/Q/Is_sulphur_magnetic", "passage_text": "1 Sulphur is widely available and is usually found within sulfate minerals or amino acids 2  …. Magnetic Therapy: Alternatives for Treating Arthritis Magnetic therapy, or the application of magnetic fields to the body for the purposes of healing, is a popular alternative treatment for a variety of reasons. 3  One of the areas…."}, {"url": "http://www.answers.com/Q/Is_sulphur_magnetic", "passage_text": "Magnetism is the force generated by any moving charged particle or charged particles. A magnetic field is the result of the motion of a charged particle or charged particles, and this field is generated in no other way. Any time a charged particle moves, it creates a magnetic field around its path of travel. There are no exceptions that we know of."}, {"url": "http://www.webelements.com/sulfur/", "passage_text": "Sulfur: the essentials. Sulphur (sulfur) is a pale yellow, odourless, brittle solid, which is insoluble in water but soluble in carbon disulphide. Sulphur is essential to life. It is a minor constituent of fats, body fluids, and skeletal minerals."}, {"url": "http://www.answers.com/Q/Is_sulfur_magnetic", "passage_text": "A mixture of iron and sulfur can be separated using a magnet-the iron will be attracted to the magnet, sulfur will not. Not the that the iron could be coated with sulfur powd … er so an extra step is required to remove it."}]