[{"url": "http://phoenix.about.com/od/foodanddrink/ss/chilepepper.htm", "passage_text": "The habanero is the hottest chile pepper you'll find in your local grocery stores, and they are very, very hot. The oil in the habanero, as well as many other hot chiles, can be very painful if you get it in your eyes or on open wounds on your hands. Wearing gloves while handling is your best bet. "}, {"url": "http://www.kgbanswers.com/is-the-poblano-pepper-hotter-than-the-jalapeno/23136159", "passage_text": "Is the Poblano pepper hotter than the jalapeno. No. Peppers such as the jalapeno (2,500 to 8,000 SHU) and the habanero (100,000 to 350,000 SHU) are significantly spicier than the poblano pepper. report this answer. Answered by kgb agent Cynie M on Friday, December 28 2012 at 03:35PM EST."}, {"url": "http://www.differencebetween.net/object/comparisons-of-food-items/vegetables-fruits/difference-between-poblano-and-jalapeno/", "passage_text": "Poblano vs Jalapeno. Poblanos and jalapenos are two different chili varieties of Mexico. They have different tastes and appearances. They grow and originate in different parts of Mexico and are used as different ingredients for different dishes. Poblano. Poblano. Poblanos are the most common and favorite chilies of Mexico. They originated from the Puebla State of Mexico. The word “poblano” means “an inhabitant of Puebla” thus the name given to it."}, {"url": "http://www.pepperscale.com/poblano-peppers/", "passage_text": "When you ripen and dry poblano peppers into ancho peppers, their heat rises due to the ripening. Green poblano peppers are much less spicy than when they are ripened into red poblano peppers. It is, but this label can be tricky. Poblano peppers have been known to pack a surprising punch every once in a while. In fact, two peppers from the same plant can have a great difference in heat. But overall, the heat is much less than other hot peppers out there. As a reference point, the jalapeno jalapeño pepper is around five times hotter on. average"}, {"url": "http://www.pepperscale.com/poblano-peppers/", "passage_text": "$3.15. When you ripen and dry poblano peppers into ancho peppers, their heat rises due to the ripening. Green poblano peppers are much less spicy than when they are ripened into red poblano peppers. So note that when using anchos, the flavor will definitely be more pungent. It is, but this label can be tricky. Poblano peppers have been known to pack a surprising punch every once in a while. In fact, two peppers from the same plant can have a great difference in heat. But overall, the heat is much less than other hot peppers out there. As a reference point, the jalapeno jalapeño pepper is around five times hotter on. average"}, {"url": "https://en.wikipedia.org/wiki/Poblano", "passage_text": "The poblano (Capsicum annuum) is a mild chili pepper originating in the state of Puebla, Mexico. Dried, it is called ancho or chile ancho, from the Mexican Spanish name ancho (wide) or chile ancho (wide chile). Stuffed fresh and roasted it is popular in chile rellenos poblanos. While poblanos tend to have a mild flavor, occasionally and unpredictably they can have significant heat. Different peppers from the same plant have been reported to vary substantially in heat intensity. The ripened red poblano is significantly hotter and more flavorful than the less ripe, green poblan"}, {"url": "http://www.pepperscale.com/poblano-peppers/", "passage_text": "As a reference point, the jalapeno jalapeño pepper is around five times hotter on. Average if you are looking for a pepper pretty much in the middle between a bell pepper and a, jalapeno jalapeño the poblano is. your match It is, but this label can be tricky. Poblano peppers have been known to pack a surprising punch every once in a while. In fact, two peppers from the same plant can have a great difference in heat. But overall, the heat is much less than other hot peppers out there. As a reference point, the jalapeno jalapeño pepper is around five times hotter on. average"}, {"url": "http://www.foodsubs.com/Chilefre.html", "passage_text": "New Mexico green chiles peak in the late summer, while the hotter New Mexico red chiles appear in the fall. Substitutes: Anaheim chile (milder) OR a combination of Anaheim chiles and jalapenos. pasilla chile pepper See chilaca or ancho chile or poblano pepper. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090202140121AA1DuoU", "passage_text": "Report Abuse. A poblano is a large, mild pepper, usually used to stuff. A jalapeno is smaller, and a lot hotter. The other answerer was right, an anaheim would be a good sub! Best Answer: No A Jalepeno is too hot. a pasilla is a good substitute if you can find those (probably just as difficult). Ancho or Anaheim would also work Use this heat scale to get an idea on what peppers would work for you http://www.missouriscenicrivers.com/pepp..."}]