[{"url": "http://www.indians.org/articles/native-american-culture.html", "passage_text": "Native American Culture. Perhaps no other group of people has quite the rich and storied culture as those of the Native Americans. They have a history rich in struggle, strife, and triumph. So many aspects of our modern life were adapted from the old Indian cultures practiced centuries ago. Totem poles were a very integral part of Native American culture. The Indians believed that each person was assigned the spirit of a particular animal, and that their spirit was absorbed into this animal in death."}, {"url": "http://nwindian.evergreen.edu/curriculum/ValuesBehaviors.pdf", "passage_text": "Traditional Native American Values and Behaviors The following paragraphs draw contrast between selected and widely shared NativeAmerican core cultural values and non-Native American values and associated behaviors andattitudes. These brief descriptions are somewhat idealized. "}, {"url": "https://en.wikipedia.org/wiki/Dominant_culture", "passage_text": "These traits are often the norm for the society as a whole. The dominant culture is usually, but not always, in the majority and achieves its dominance by controlling social institutions such as communication, educational institutions, artistic expression, law, political process, and business. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090916203313AAc3ke6", "passage_text": "There is a lot of support between families and the community itself as a whole. Individuals are very autonomous but there is a strong sense of belonging to a group. First is the family, second is the community, third to a nation, fourth is other Native people/Nations. And the relationships, support and the responsibility for the welfare of the people/group radiates through all. I think men are more involve with the children than in mainstream society. It’s not uncommon for men to be a primary caregiver nor to be the custodial parent in a single parent family. Because family ties are very strong, when you look at single parent families they are much different then that of"}, {"url": "http://www.mindlink.org/online_courses/cultural_competency_6.html", "passage_text": "VI. American Indians (AI) and Alaska Natives (AN) are terms identifying the indigenous peoples of North America. As of the 2000 Census, four million people identified themselves as American Indian or Alaska Native and most live near urban areas. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090916203313AAc3ke6", "passage_text": "Best Answer: I can only talk about my community. We are Anishinaabe (Ojibwa/Chippewa} The extended family is the backbone of Anishinaabe society. The family is multi-generational. Aunts, uncles and cousins are just as important as parents, grandparents and siblings. I think men are more involve with the children than in mainstream society. It’s not uncommon for men to be a primary caregiver nor to be the custodial parent in a single parent family. Because family ties are very strong, when you look at single parent families they are much different then that of"}, {"url": "https://ethemes.missouri.edu/themes/1299", "passage_text": "Learn more about the cultures of various Native American tribes. Some sites emphasize that these are live cultures because there are more than a million American Indians living today. Watch videos of a powwow, read biographies of famous Native Americans, and view paintings and photographs. These sites focus on Native American lifestyles and how they lived in early days. Learn about values, norms, cultures, traditions, and customs of Native American Indians and how those things affected their lifestyles."}, {"url": "http://www.native-languages.org/home.htm", "passage_text": "Central and South American Indian Cultures: We also have some pages on Native American cultures of Central and South America. Click here to check them out. Our site is designed to present information about American Indian peoples and their languages contextually--language by language and nation by nation. Native Languages of the Americas: Native American Cultures. Hello, and welcome to Native Languages of the Americas! We are a small non-profit organization dedicated to preserving and promoting American Indian languages, particularly through the use of Internet technology. Our website is not beautiful."}, {"url": "https://ethemes.missouri.edu/themes/1299", "passage_text": "Native Americans: Lifestyles. These sites focus on Native American lifestyles and how they lived in early days. Learn about values, norms, cultures, traditions, and customs of Native American Indians and how those things affected their lifestyles. Includes pictures, games, lesson plans, and worksheet"}]