[{"url": "https://en.wikipedia.org/wiki/Linguistic_relativity", "passage_text": "The distinction between a weak and a strong version of this hypothesis is also a later invention; Sapir and Whorf never set up such a dichotomy, although often in their writings their views of this relativity principle are phrased in stronger or weaker terms. The principle of linguistic relativity and the relation between language and thought has also received attention in varying academic fields from philosophy to psychology and anthropology, and it has also inspired and colored works of fiction and the invention of constructed languages. Contents."}, {"url": "https://en.wikipedia.org/wiki/Linguistic_relativity", "passage_text": "Whorf's principle of linguistic relativity was reformulated as a testable hypothesis by Roger Brown and Eric Lenneberg who conducted experiments designed to find out whether color perception varies between speakers of languages that classified colors differently. The principle of linguistic relativity and the relation between language and thought has also received attention in varying academic fields from philosophy to psychology and anthropology, and it has also inspired and colored works of fiction and the invention of constructed languages. Contents."}, {"url": "https://en.wikipedia.org/wiki/Benjamin_Lee_Whorf", "passage_text": "By comparison Whorf's other work in linguistics, the development of such concepts as the allophone and the cryptotype, and the formulation of  Whorf's law  in Uto-Aztecan historical linguistics, have met with broad acceptance. At Yale, Whorf joined the circle of Sapir's students that included such luminary linguists as Morris Swadesh, Mary Haas, Harry Hoijer, G. L. Trager and Charles F. Voegelin. Whorf took on a central role among Sapir's students and was well respected."}, {"url": "https://en.wikipedia.org/wiki/Linguistic_relativity", "passage_text": "Independently of Whorf and Sapir, Korzybski described the basic principle of his theory in a way that is a strong version of the hypothesis of linguistic relativity. The principle of linguistic relativity and the relation between language and thought has also received attention in varying academic fields from philosophy to psychology and anthropology, and it has also inspired and colored works of fiction and the invention of constructed languages. Contents."}, {"url": "http://www.answers.com/Q/In_which_year_did_Isaac_Newton_come_up_with_his_theory_of_relativity", "passage_text": "Confidence votes 8. Sir Isaac Newton's theory of gravity was written in 1687, however he did not come up with a theory of relativity. The first person to come up with a theory of relativity was Galileo Galilei, but this theory turned out to be incorrect. In a paper in 1905 Albert Einstein built upon Galileo's ideas and produced the special theory of relativity. This is a very famous paper that turned the physics world on its head"}, {"url": "https://en.wikipedia.org/wiki/Benjamin_Lee_Whorf", "passage_text": "Benjamin Lee Whorf (/hwɔrf/ ; April 24, 1897 – July 26, 1941) was an American linguist and fire prevention engineer. Whorf is widely known as an advocate for the idea that because of linguistic differences in grammar and usage, speakers of different languages conceptualize and experience the world differently. At Yale, Whorf joined the circle of Sapir's students that included such luminary linguists as Morris Swadesh, Mary Haas, Harry Hoijer, G. L. Trager and Charles F. Voegelin. Whorf took on a central role among Sapir's students and was well respected."}, {"url": "http://c2.com/cgi/wiki?SapirWhorfHypothesis", "passage_text": "Edward Sapir and his student Benjamin Lee Whorf developed a theory of linguistics which claims that language shapes thought. This idea lies behind the LinguisticDeterminism of LeftWing and PostModern philosophers. Or see at much greater length http://sloan.stanford.edu/mousesite/Secondary/ThoughtReality.htm. "}, {"url": "http://visual-memory.co.uk/daniel/Documents/short/whorf.html", "passage_text": "The doctrine that language is the 'dress of thought' was fundamental in Neo-Classical literary theory (Abrams 1953, p. 290), but was rejected by the Romantics (ibid.; Stone 1967, Ch. 5). There is also a related view (held by behaviourists, for instance) that language and thought are identical. According to this stance thinking is entirely linguistic: there is no 'non-verbal thought', no 'translation' at all from thought to language. In this sense, thought is seen as completely determined by language. The Sapir-Whorf theory, named after the American linguists Edward Sapir and Benjamin Lee Whorf, is a mould theory of language"}]