[{"url": "http://www.manufacturingnews.com/news/06/0502/art1.html", "passage_text": "An average Chinese wage of $0.57 per hour -- or $104 per month -- is about 3 percent of the average U.S. manufacturing worker's wage, according to data collected by Banister."}, {"url": "http://www.huffingtonpost.com/2012/03/08/average-cost-factory-worker_n_1327413.html", "passage_text": "Partly, it can be explained by China's cheaper workers: The average hourly wage for Chinese manufacturing workers is less than a tenth that of their average U.S. counterparts, according to the Bureau of Labor Statistics. It being about twice as cheap to live in China, those lower Chinese wages go further."}, {"url": "http://news.bbc.co.uk/2/hi/asia-pacific/7833779.stm", "passage_text": "In 2008, the average income for a worker in rural China was around $690 - while those in the cities earned $2,290 on average. Wages in big cities like Shanghai and Beijing are even higher. The main cause for the widening gap is the low price of agricultural products such as rice, vegetable and fruits."}, {"url": "http://qz.com/170363/the-average-chinese-private-sector-worker-earns-about-the-same-as-a-cleaner-in-thailand/", "passage_text": "According to CNN’s online global wage calculator, which uses data from the International Labor Organization, the average annual salary of a worker in China’s private sector was 28,752 yuan (about $4,755) in 2012, or 38% of the global average. That’s roughly the same as a cleaner in Thailand, according to CNN’s data."}, {"url": "http://news.bbc.co.uk/2/hi/asia-pacific/7833779.stm", "passage_text": "The average wealth gap has now reached 11,100 yuan or $1,620 (1,100), $200 more than it was in 2007. In 2008, the average income for a worker in rural China was around $690 - while those in the cities earned $2,290 on average. Wages in big cities like Shanghai and Beijing are even higher. The main cause for the widening gap is the low price of agricultural products such as rice, vegetable and fruits."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20090306055418AA2VOaL", "passage_text": "Report Abuse. An average Chinese wage of $0.57 per hour -- or $104 per month -- is about 3 percent of the average U.S. manufacturing worker's wage, according to data collected by Banister."}]