[{"url": "https://support.office.com/en-us/article/sort-data-in-a-range-or-table-62d0b95d-2a90-4610-a6ae-2e545c4a4654", "passage_text": "On the Data tab, in the Sort & Filter group, click Sort. The Sort dialog box is displayed. Under Column, in the Sort by or Then by box, select the column that you want to sort by a custom list. Under Order, select Custom List. In the Custom Lists dialog box, select the list that you want. Select a column of numeric data in a range of cells, or make sure that the active cell is in a table column containing numeric data. On the Data tab, in the Sort & Filter group, do one of the following: To sort from low numbers to high numbers, click Sort Smallest to Largest."}, {"url": "http://www.ehow.com/how_6541368_change-order-first-last-excel.html", "passage_text": "Sort Just One Column. Select a single cell in the column you want to sort or select the entire column. The easiest way to do this is by clicking the letter at the top of the column you want to sort. Click A-Z in the Sort & Filter group of the Home tab to sort alphabetically in ascending order (from A to Z). Sort an Entire Table. Select the table that you want to sort by clicking the cell in the upper-left corner of the table and dragging your mouse to the lower-right corner. Click the Data tab. Click Sort in the Sort & Filter group to open the Sort window. Click the drop-down arrow under Sort By to view a list of the column headers. Clear the My Data Has Headers check box if your table doesn't have headings. Choose the column name or letter by which you want to sort the table. Choose A to Z or Z to A in the Order drop-down list and click OK to sort the table"}, {"url": "http://yourbusiness.azcentral.com/alphabetize-last-names-excel-21939.html", "passage_text": "Provided you enter separate types of information -- such as first names, last names and titles -- into unique columns, you can quickly sort your data alphabetically by any column on the worksheet, whether you want to alphabetize names, sort by department or organize in another fashion. Click the A to Z button in the Sort & Filter group. The Sort Warning dialog appears if other adjacent columns contain data. Step 4. Choose Expand the Selection to sort the entire worksheet by the last name column or select Continue with the Current Selection if you only want to sort the currently selected column."}, {"url": "http://www.wikihow.com/Sort-a-List-in-Microsoft-Excel", "passage_text": "Create your first rule. Click the Sort by menu to choose the column that you want. In this example, you would first be sorting by city, so select the appropriate column from the menu. 1  Keep Sort on set to Values. 2  Set the order to either A to Z or Z to A depending on how you want to sort. Select the second column (The Name column in our example) and then select the sort order (for ease of reading, choose the same order as your first rule). 5. Click OK. Your list will be sorted according to your rules."}, {"url": "http://smallbusiness.chron.com/sort-multiple-rows-columns-excel-40472.html", "passage_text": "For example, if you want to sort an employee list by column headings Hire Date, Last Name and First Name, in that order, then the first column you select should be Hire Date.. Step 4. Click the Sort On drop-down menu and choose a sort criterion for this column. Click on the Sort By drop-down menu to select a column by name. The names correspond to the headings typed in the first row of your data. The column you choose first should represent your primary sorting criteria."}, {"url": "http://smallbusiness.chron.com/sort-multiple-rows-columns-excel-40472.html", "passage_text": "You can sort all the rows in a worksheet by sorting the values in one column, simplifying the task of alphabetizing a list of employees by last name or reordering a list of customer transactions by invoice value. To deepen the value of a sorting process, use Excel to sort by more than one criterion at a time. Step 1. Click on the Sort By drop-down menu to select a column by name. The names correspond to the headings typed in the first row of your data. The column you choose first should represent your primary sorting criteria."}, {"url": "https://support.office.com/en-us/article/combine-first-and-last-names-6a2c1222-837d-482e-94f0-a38a4effb1b5", "passage_text": "Combine first and last names. Let's say you want to create a single Full Name column by combining two other columns, First Name and Last Name. To combine first and last names, use the CONCATENATE function or the ampersand (&) operator. The example may be easier to understand if you copy it to a blank worksheet. How to copy an example. Create a blank workbook or worksheet. Select the example in the Help topic. Note Do not select the row or column headers. Selecting an example from Help. Press CTRL+C. In the worksheet, select cell A1, and press CTRL+V."}, {"url": "http://www.wikihow.com/Sort-a-List-in-Microsoft-Excel", "passage_text": "Select your data. You can either click and drag to select the column that you want to sort, or you can click one of the cells in the column to make it active and let Excel select the data automatically. 1  All of your data in the column will need to be formatted in the same way in order to sort (i.e. text, numbers, dates). Select the second column (The Name column in our example) and then select the sort order (for ease of reading, choose the same order as your first rule). 5. Click OK. Your list will be sorted according to your rules."}]