[{"url": "http://www.epicurious.com/recipes/food/views/roast-sirloin-of-beef-365771", "passage_text": "1 Heat oil in an ovenproof skillet or a small roasting pan set over high heat. 2  Add roast to skillet and brown on all sides, about 3 minutes per side. 3  Transfer skillet to oven and roast until an instant-read thermometer inserted into center of roast registers 120°F for medium-rare, 40-50 minutes. 1 Transfer skillet to oven and roast until an instant-read thermometer inserted into center of roast registers 120°F for medium-rare, 40-50 minutes. 2  Tent with foil; let rest 15 minutes. 3  Thinly slice roast. 4  Arrange on a platter and sprinkle with additional gray sea salt."}, {"url": "http://www.wikihow.com/Cook-Top-Sirloin-Steak", "passage_text": "1 Choose steaks that are at least 1 inch (2.5 cm) thick, and preferably 2 inches (5.1 cm). 2  Thinner steaks will dry out easily when you cook them. 3  Fresh sirloin steak is deep red in color, with a generous marbling of fat. 4  This marbling is what makes steak succulent. 1 Plan to serve 1/4 to 1/2 pound per of steak per person. 2  Choose steaks that are at least 1 inch (2.5 cm) thick, and preferably 2 inches (5.1 cm). 3  Thinner steaks will dry out easily when you cook them. 4  Fresh sirloin steak is deep red in color, with a generous marbling of fat. 5"}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-cook-tri-tip/", "passage_text": "3. Oven-roasting the tri-tip roast Place roast in the oven and roast, uncovered, for 30 to 35 minutes or until the thermometer registers 135 degrees F. Remove from the oven and cover with foil. Let the meat stand for 15 minutes, which will bring the temperature up to 145 degrees F (medium rare) after standing. Other names for the tri-tip are bottom sirloin roast and triangle roast. If you don't see it in the meat case, you may need to request it from your butcher. A boneless tri-tip roast weighs around 1-1/2 to 2 pounds and is around 2 inches thick."}, {"url": "http://www.wikihow.com/Cook-Top-Sirloin-Steak", "passage_text": "Continue turning the steaks every thirty seconds until they are cooked. 1  For rare steaks, cook for a total of 1 1/2 minutes on each side. 2  For medium rare steaks, cook for a total of 2 minutes on each side. 3  For medium well steaks, cook for a total of 2 1/2 minutes on each side. 1 Plan to serve 1/4 to 1/2 pound per of steak per person. 2  Choose steaks that are at least 1 inch (2.5 cm) thick, and preferably 2 inches (5.1 cm). 3  Thinner steaks will dry out easily when you cook them. 4  Fresh sirloin steak is deep red in color, with a generous marbling of fat. 5  This marbling is what makes steak succulent."}, {"url": "http://www.foodnetwork.com/recipes/melissa-darabian/sliced-sirloin-steak-recipe.html", "passage_text": "Directions. Season the steak liberally with salt and pepper, and allow to sit at room temperature for 15 to 30 minutes. Meanwhile, heat a grill pan over medium-high heat. Brush the steak with vegetable oil and cook on grill pan, undisturbed for 3 minutes. Flip the steak over and cook until the steak is 130 degrees F for medium rare, about 3 minutes more. Remove to a cutting board, and allow to rest a full 5 minutes before slicing"}, {"url": "http://www.hannaford.com/recipe/Beef-Sirloin-with-Oven-Roasted-Vegetables/9321.uts", "passage_text": "Set aside. 3. Place steak on rack in shallow baking pan. Insert ovenproof meat thermometer in thickest part of beef. Do not cover or add water. Roast steak and vegetables in oven for 25 minutes. Stir vegetables and add zucchini to baking pan; continue roasting 20 to 25 minutes or until vegetables are tender and meat registers at 140 degrees F for medium-rare doneness. 4. Transfer steak to carving board. Let stand 5 to 10 minutes. 5. Carve steaks into slices. "}, {"url": "http://www.bonappetit.com/recipe/roast-sirloin-of-beef", "passage_text": "Preheat oven to 425°. Season roast generously with gray sea salt and pepper. Heat oil in an ovenproof skillet or a small roasting pan set over high heat. Add roast to skillet and brown on all sides, about 3 minutes per side. Transfer skillet to oven and roast until an instant-read thermometer inserted into center of roast registers 120° for medium-rare, 40-50 minutes. Tent with foil; let rest 15 minutes. Thinly slice roast. Arrange on a platter and sprinkle with additional gray sea salt."}, {"url": "http://www.bhg.com/recipes/how-to/cooking-basics/how-to-cook-tri-tip/", "passage_text": "3. Oven-roasting the tri-tip roast. 1  Place roast in the oven and roast, uncovered, for 30 to 35 minutes or until the thermometer registers 135 degrees F. Remove from the oven and cover with foil. Other names for the tri-tip are bottom sirloin roast and triangle roast. If you don't see it in the meat case, you may need to request it from your butcher. A boneless tri-tip roast weighs around 1-1/2 to 2 pounds and is around 2 inches thick."}, {"url": "http://www.wikihow.com/Cook-Top-Sirloin-Steak", "passage_text": "1 For rare steaks, cook for a total of 1 1/2 minutes on each side. 2  For medium rare steaks, cook for a total of 2 minutes on each side. 3  For medium well steaks, cook for a total of 2 1/2 minutes on each side. 4  For well done steaks, cook for 3 or more minutes on each side. 1 Plan to serve 1/4 to 1/2 pound per of steak per person. 2  Choose steaks that are at least 1 inch (2.5 cm) thick, and preferably 2 inches (5.1 cm). 3  Thinner steaks will dry out easily when you cook them. 4  Fresh sirloin steak is deep red in color, with a generous marbling of fat. 5  This marbling is what makes steak succulent."}]