[{"url": "https://en.wikipedia.org/wiki/Brand", "passage_text": "A great brand raises the bar – it adds a greater sense of purpose to the experience, whether it's the challenge to do your best in sports and fitness, or the affirmation that the cup of coffee you're drinking really matters. The word brand is often used as a metonym referring to the company that is strongly identified with a brand. Marque or make are often used to denote a brand of motor vehicle, which may be distinguished from a car model."}, {"url": "http://www.brandingstrategyinsider.com/brand-purpose", "passage_text": "A sizzling brand purpose sets out how a company intends to change the world for the better. Its role is to unite customers and culture alike in the pursuit of that intention. It’s a statement of belief, of hope, of pursuit. It’s born of a wish to see the world put to rights. Consider this most brilliantly executed example of how higher brand purpose begets flawless story staging and storytelling, illustrating the more elaborate a scene is — props, staging, ambiance — the easier it is for customers to imagine themselves in it."}, {"url": "http://www.brandingstrategyinsider.com/2015/04/developing-powerful-purpose.html", "passage_text": "A sizzling brand purpose sets out how a company intends to change the world for the better. Its role is to unite customers and culture alike in the pursuit of that intention. It’s a statement of belief, of hope, of pursuit. A purpose that is not worth sharing is not worth having. We can help you identify and develop your brand purpose. Grow with us. The Un-Conference: 360 Degrees of Brand Strategy for a Changing World. May 18th ~ 20th at the famed Versace Mansion in South Beach, Florida."}, {"url": "https://marketoonist.com/2013/10/brand-purpose.html", "passage_text": "Chipotle has been leading with brand purpose for several years with its powerful message to “Cultivate a Better World” (The Scarecrow last month and Back to the Start in 2011). Chipotle is one of the more successful companies in branding with purpose. Many marketers are feeling pressure to define their “brand purpose” and create campaigns with a higher cause. The more brands that jump on the purpose bandwagon, however, the more that consumers will be skeptical and cynical about companies’ motivations, even if their motivations are sincere."}, {"url": "http://www.adweek.com/news/advertising-branding/brands-need-know-their-purpose-and-what-they-aspire-be-155875", "passage_text": "What we need is purpose and to help people realize their purpose. To know your purpose as a brand is to know who you, as the brand, aspire to be. This defines your subsequent behavior inside the company, in your products, and ultimately how you impact the world. It’s the “why” your brand exists. If you commit to a purpose that will truly benefit the world in some way, you are on your way to defining your brand’s role in people’s lives, and the way you communicate with them. It is within this dialogue between brand and consumer that we can find solutions, innovate and challenge the status quo."}, {"url": "http://www.harbingerideas.com/brand-purpose", "passage_text": "Purpose defined. Harbinger defines it as the ownable, actionable impact your brand will make on the lives of your target consumers, rooted in a fundamental insight. It resides at the intersection of what your brand offers the world and your consumer’s deepest cares and desires. Brand Purpose: Connecting Women Consumers and Brands For 25 years, our team has observed a significant shift in how and why consumers connect with brands. Not surprisingly, today’s consumers are looking for more from brands than just a product that delivers a functional benefit... Blog."}, {"url": "https://en.wikipedia.org/wiki/Brand", "passage_text": "A brand (or marque for car model) is a name, term, design, symbol or other feature that distinguishes one seller's product from those of others. Brands are used in business, marketing, and advertising. The word brand is often used as a metonym referring to the company that is strongly identified with a brand. Marque or make are often used to denote a brand of motor vehicle, which may be distinguished from a car model."}, {"url": "http://www.brandingstrategyinsider.com/2015/04/developing-powerful-purpose.html", "passage_text": "0 Comments. A sizzling brand purpose sets out how a company intends to change the world for the better. Its role is to unite customers and culture alike in the pursuit of that intention. It’s a statement of belief, of hope, of pursuit. It’s born of a wish to see the world put to rights. A purpose that is not worth sharing is not worth having. We can help you identify and develop your brand purpose. Grow with us. The Un-Conference: 360 Degrees of Brand Strategy for a Changing World. May 18th ~ 20th at the famed Versace Mansion in South Beach, Florida."}, {"url": "http://www.brandingstrategyinsider.com/brand-purpose", "passage_text": "Brand purpose is the foundation for brand story. Consider this most brilliantly executed example of how higher brand purpose begets flawless story staging and storytelling, illustrating the more elaborate a scene is — props, staging, ambiance — the easier it is for customers to imagine themselves in it."}]