[{"url": "http://www.diychatroom.com/f9/old-felt-left-45465/index2/", "passage_text": "well why can't I put new felt over top of old flat nonwrinkled felt how does this void a warrantee tell me the page on the manufactures warrentee please as I will avoid this company."}, {"url": "http://www.askaroofer.com/wet-felt-paper-can-i-roof-over-it", "passage_text": "Moisture should evaporate between the shingles and the felt and not cause any issues or damage any of the roofing products. My concerns with wet or damp felt is that it causes the felt to wrinkle. These wrinkles can hold up the shingles from laying flat till the moisture evaporates. This can be unsightly and disturbing to the home owner. In some cases, I have seen the roofer slice these wrinkles and not repair the felt properly."}, {"url": "http://www.askaroofer.com/asphalt-shingle-replacement-and-old-felt", "passage_text": "I get this question many times and it is my opinion that the old felt should be removed and not covered over. I don’t know why some roofers say “leave it on”. I seem to me if you are going to the trouble of removing the shingles, you now have a chance to do repair on the roof deck by removing all the old felt."}, {"url": "http://talk.roofing.com/t/putting-new-felt-over-old-felt/4759", "passage_text": "Leaving the old felt on does not make the roof work or last any different. dave63028 2009-10-03 15:22:53 UTC #5. Sometimes theres no reason to remove the old felt. You can tell the decking is bad when you walk on the roof deck during tear off.If the felt is laying flat leave it on.I would have him use 15 lb Ul felt."}, {"url": "http://www.contractortalk.com/f15/okay-leave-old-felt-53597/", "passage_text": "I got up on a roof that I'm having replaced today (wind damage Friday). I noticed that the roofers are leaving on the old felt, substantially. They assure me that it's normal, and I'm hard pressed to insist otherwise."}, {"url": "http://talk.roofing.com/t/putting-new-felt-over-old-felt/4759", "passage_text": "It's lays out nice and flat rarely wrinkles but sure can be slippery on some roofs. Another reason why to tear off felt is if you are putting on ice and water shield by code of course it does no good over felt. johne5 2009-10-04 00:57:12 UTC #10. Old felt is part of the old roof. Remove if tearing off old roof. re-nail roof deck and apply new roof system as per contract."}]