[{"url": "http://www.innerbody.com/image/endoov.html", "passage_text": "The endocrine system includes all of the glands of the body and the hormones produced by those glands. The glands are controlled directly by stimulation from the nervous system as well as by chemical receptors in the blood and hormones produced by other glands. "}, {"url": "https://en.wikipedia.org/wiki/Endocrinology", "passage_text": "For the academic journal, see Endocrinology (journal) . Endocrinology (from Greek ἔνδον, endon, within; κρίνω, krīnō, to separate; and -λογία, -logia) is a branch of biology and medicine dealing with the endocrine system, its diseases, and its specific secretions known as hormones. Because endocrinology encompasses so many conditions and diseases, there are many organizations that provide education to patients and the public. The Hormone Foundation is the public education affiliate of The Endocrine Society and provides information on all endocrine-related conditions."}, {"url": "http://www.mananatomy.com/body-systems/endocrine-system", "passage_text": "Introduction to endocrine System: Endocrine system is the system of glands of human body. Each of these glands secretes one or more different hormones in the blood for different functions. The secretions of endocrine glands are known as hormones. Endocrine glands of human body are divided into two categories; 1) Typical endocrine glands, 2) Organs having secondary endocrine function. 1) TYPICAL ENDOCRINE GLANDS: These glands have primary function of producing hormones for human body. Typical endocrine glands include; 1  PITUITARY GLAND."}, {"url": "http://www.hormone.org/hormones-and-health/the-endocrine-system/endocrine-related-organs", "passage_text": "Stomach and Small Intestine. The digestive tract is the largest endocrine-related organ system in the body. It makes and secretes several different types of hormones that play a role in the body's metabolism. "}, {"url": "http://biology.about.com/od/organsystems/ss/endocrine-system.htm", "passage_text": "The major glands of the endocrine system are the pineal gland, pituitary gland, thyroid and parathyroid glands, adrenal glands, pancreas, thymus, ovaries, and testes. There are also other organs in the body that have secondary endocrine functions. 1 The endocrine system includes certain organs of the reproductive system. 2  Male and female primary reproductive organs are called gonads. 3  Gonads produce sex cells and also secrete reproductive hormones. 4  The male gonads, the testes, produce hormones called androgens."}, {"url": "https://wikis.engrade.com/apreview/endocrinesystem", "passage_text": "OTHER ENDOCRINE STRUCTURES. A. Many organs (for example, the stomach, intestines, and kidney) produce endocrine hormones The following is a list of the primary endocrine glands, their location, and their hormonal secretions. "}, {"url": "http://biology.about.com/od/organsystems/ss/endocrine-system.htm", "passage_text": "1 Gonads (Ovaries and Testes). 2  The endocrine system includes certain organs of the reproductive system. 3  Male and female primary reproductive organs are called gonads. 4  Gonads produce sex cells and also secrete reproductive hormones. 1 The endocrine system includes certain organs of the reproductive system. 2  Male and female primary reproductive organs are called gonads. 3  Gonads produce sex cells and also secrete reproductive hormones. 4  The male gonads, the testes, produce hormones called androgens."}, {"url": "http://www.cancer.ca/en/cancer-information/cancer-type/neuroendocrine/anatomy-and-physiology/?region=on", "passage_text": "The endocrine system is made up of pituitary, pineal, thyroid, parathyroid and adrenal glands, pancreatic islet cells (also known as islets of Langerhans) and the ovaries or testicles. 1  The pituitary, pineal and parathyroid glands are neuroendocrine glands. "}, {"url": "http://rapidlearningcenter.com/biology/anatomy-physiology/15-The-Endocrine-System.html", "passage_text": "They produce and secrete parathyroid hormone (PTH). 1  The adrenal gland: The adrenal glands are located on top of the kidneys. 2  The pancreas: The pancreas is both an endocrine organ and an exocrine organ. 3  The testes: The testes are responsible for the synthesis and secretion of androgens, such as testosterone. 4  The ovaries: The ovaries produce and ... Other endocrine glands within the body include: thyroid, parathyroids, adrenals, pancreas, ovaries, and testes. 1  The hypothalamus: The hypothalamus is located in the forebrain, directly above the pituitary gland. 2  The hypothalamus receives input from other parts of the brain and from peripheral nerves."}, {"url": "http://www.emedicinehealth.com/anatomy_of_the_endocrine_system/article_em.htm", "passage_text": "Endocrine System Introduction. The endocrine system is made up of glands that produce and secrete hormones, chemical substances produced in the body that regulate the activity of cells or organs. "}]