[{"url": "http://www.ebay.com/gds/How-to-Buy-Leggings-/10000000177632111/g.html", "passage_text": "The legging is made from a number of different fabrics, but almost all of them are composite materials mixed with a small amount of spandex to make them super stretchy. The most commonly used legging fabric is nylon/spandex or polyester/spandex. These two fabrics are both man-made and naturally resist stains. Leggings are usually worn as outerwear paired with long shirts and tunics. The wearer may also choose to add a pair of high heels or platforms to the look. Leggings draw the eye down the leg and help make a pair of high quality shoes stand out."}, {"url": "http://www.wikihow.com/Wear-Leggings", "passage_text": "Wear leggings that are made of fancy material. There's nothing wrong with cotton leggings, but if you need to dress up for work, you should try wearing leggings that are made of suede, leather, or even dark denim. Having a variety of leggings to choose from will help you mix and match more fantastic work outfits. Don't wear your leggings with the wrong shoes. Leggings look great with knee-high boots, sandals, flip-flops, or even low-cut boots. If you wear your leggings with heels or pumps, make sure that they match your shirt and that you don't look too trashy."}, {"url": "http://stretch-fabric.com/tag/leggings/", "passage_text": "To make your own pattern, use your favorite pair of legging and turn them inside out. Keep in mind that while stretch vinyl does stretch, it does not stretch as much as most leggings do, so you should be careful to leave extra room on each side, erring on the side of larger than necessary. You could pair this look with a pair of black leggings or a short sexy stretch skirt. All of these styles that we generally see as off limits to us non-celebrities are in fact attainable, and they can either be bought or recreated by you in order to get that perfect look."}, {"url": "https://www.worldofleggings.com/", "passage_text": "Whether you are in Australia, United Kingdom, Spain, Brazil, Singapore, Germany, Japan, France, New Zealand, any EU country, World of Leggings will ship your fabulous new leg fashion products to you at $15.00 flat rate shipping. Have fun shopping the very best in Made in the USA leggings and leg fashion. World of Leggings ships internationally from Australia and New Zealand to Europe, the Middle East, South America and Asia. We offer $15.00 flat rate international shipping so if you are not in North America, you can shop our leggings and know that your shipping will always be $15.00."}, {"url": "https://en.wikipedia.org/wiki/Leggings", "passage_text": "Leggings made from cotton-lycra, or a cotton-polyester-lycra combination, are more typically worn for fashion, but are also worn as exercise wear. Cotton-lycra leggings are available in many colors, prints and designs; but black, navy and various shades of gray remain the most commonly worn. Leggings made from a nylon-lycra blend (usually 90% nylon, 10% lycra) have traditionally been worn during exercise. Nylon lycra leggings are often referred to as bicycle or running tights, and are shinier in appearance than those made from cotton."}, {"url": "http://www.wikihow.com/Make-Leggings-from-Tights", "passage_text": "How to Make Leggings from Tights. Beautiful leggings add a lot to an outfit and are a fashionable and easy way to add warmth during the cooler fall months. And should your fave pair of tights begin to get holey in the toe area, turning them into a pair of leggings will give them a new lease of life. 1. Find suitable tights. The best tights to turn into leggings will be those that have a high denier, or strength of fabric. Tights made from cotton, wool, bamboo or opaque synthetics may work best. Transparent or lightweight denier won't usually turn into good leggings and risk more tears and runs"}, {"url": "http://www.ebay.com/gds/How-to-Buy-Leggings-/10000000177632111/g.html", "passage_text": "The modern legging is made from a mix of spandex and another material. It is styled like a pant or a pair of tights, but of slightly heavier weight. The legging came into high fashion in 2005, and since then, it’s seen a number of style evolutions. You can find these different types of leggings in most stores. Leggings are usually worn as outerwear paired with long shirts and tunics. The wearer may also choose to add a pair of high heels or platforms to the look. Leggings draw the eye down the leg and help make a pair of high quality shoes stand out."}, {"url": "https://en.wikipedia.org/wiki/Leggings", "passage_text": "Formerly, leggings were two separate garments, one for each leg. Modern leggings are typically made from a blend of lycra (aka spandex), nylon, cotton, or polyester blend, but they can also be made from wool, silk and other materials. Leggings made from a nylon-lycra blend (usually 90% nylon, 10% lycra) have traditionally been worn during exercise. Nylon lycra leggings are often referred to as bicycle or running tights, and are shinier in appearance than those made from cotton."}]