[{"url": "http://www.ourbabynamer.com/meaning-of-Lari.html", "passage_text": "Lari is generally used as a girl's name. It consists of 4 letters and 2 syllables and is pronounced La-ri. In the U.S. in 2014 less than 5 girls were given the name. Less than 5 boys were given the name. View the Lari Name Popularity Page to see how the popularity trend for Lari has changed since 1880, or to compare the popularity of Lari to other names. Lari is a diminutive (nickname) of Laura. Lari falls into the flower name category"}, {"url": "http://www.audioenglish.org/dictionary/lari.htm", "passage_text": "Meaning: Gulls; terns; jaegers; skimmers. Classified under: Nouns denoting animals. Synonyms: suborder Lari; Lari. Hypernyms (Lari is a kind of...): animal order (the order of animals). Holonyms (Lari is a member of...): Charadriiformes; order Charadriiformes (large diverse order of aquatic birds found along seacoasts and inland waters: shorebirds and coastal diving birds; most feed on anima life)."}, {"url": "http://www.babynamespedia.com/meaning/Lari", "passage_text": "[ syll. la-ri, lar-i ] The baby girl name Lari is pronounced as L AA Riy †. Lari is used chiefly in English, and it is derived from Latin and Old Greek origins. From Latin roots, its meaning is famous. Lari is a pet form of the name Lara (English, Russian, Slavic, and German). Lari is also a variant of the name Larissa (German and Russian). Lari is also a variant of Laura in the English language. Lare, Laree, Larey, Larie, Larilia, Larre, Larrie, and Layr are variants of Lari. Lari is seldom used as a baby name for girls. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Lari", "passage_text": "Lari /lari/ [2 sylls.] as a girls' name. Lari's name origin is Latin, and the meaning of the name Lari is cheerful; the bay, or laurel plant. Lari is a variant transcription of Larissa (Latin): version of Lara. Lari is also a variation of Laura (Latin). Kreatif forms: Lyri."}, {"url": "http://www.sheknows.com/baby-names/name/lari", "passage_text": "Russian Meaning: The name Lari is a Russian baby name. In Russian the meaning of the name Lari is: Protection. SoulUrge Number: 1. Expression Number: 22. People with this name have a deep inner desire to use their abilities in leadership, and to have personal independence. They would rather focus on large, important issues, and delegate the details."}, {"url": "https://en.wikipedia.org/wiki/Georgian_lari", "passage_text": "The Lari (Georgian: ლარი; ISO 4217: GEL) is the currency of Georgia. Lari sign is based on graphic outline of one arched letter. (Lasi) of the Georgian script. According to the world experience with regard to various signs the first symbol of the sign is crossed by one or two parallel lines."}, {"url": "http://www.ourbabynamer.com/meaning-of-Lari.html", "passage_text": "Then just follow the diagram below. Just for fun, see the name Lari in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Lari in Nautical Flags page. Less than 5 boys were given the name. View the Lari Name Popularity Page to see how the popularity trend for Lari has changed since 1880, or to compare the popularity of Lari to other names."}, {"url": "http://www.thinkbabynames.com/meaning/0/Larissa", "passage_text": "Larissa /lar-is-sa/ [3 sylls.] as a girls' name is pronounced la-RISS-ah. It is of Latin origin, and the meaning of Larissa is cheerful. Variant of Lara; from the same root as Hilary. Popular in Russia. Kreatif forms: Laurissa, Liarissa. "}]