[{"url": "http://www.educ.ualberta.ca/staff/olenka.bilash/Best%20of%20Bilash/languageawareness.html", "passage_text": "Language Awareness. In the Giving It stage of B-SLIM, language awareness is part of WHAT the teacher chooses to teach. As language teachers know, there is much more to a language than simply knowing vocabulary and grammar and reproducing them in either written or oral form."}, {"url": "http://www.academia.edu/710962/Language_awareness_and_cultural_awareness_for_language_learners", "passage_text": "Language Awareness is defined as follows by the (British) National Council for Language education (NCLE): „Language awareness is a person's sensitivity to and conscious perception of the nature of language and its role in human life (James and Garrett eds."}, {"url": "http://www.educ.ualberta.ca/staff/olenka.bilash/Best%20of%20Bilash/languageawareness.html", "passage_text": "All four of these aspects of language awareness need to be integrated into the existing subject areas. A focus on language awareness is a key aspect of creating student-centered classrooms, and assists the teacher to present material accordingly to student readiness (Bilash and Tulasiewicz, 1995, p.49)."}, {"url": "http://www.educ.ualberta.ca/staff/olenka.bilash/Best%20of%20Bilash/languageawareness.html", "passage_text": "By increasing students’ language awareness, the students are better able to understand, appreciate and use the language. In this section we will look at what the phrase ‘language awareness’ means, what role it plays in the second language classroom, and ways teachers can increase their students’ language awareness."}, {"url": "http://www.learnersdictionary.com/definition/awareness", "passage_text": "self–awareness /ˌsɛlfəˈweɚnəs/ noun. self–awareness. /ˌsɛlfəˈweɚnəs/. noun. Learner's definition of SELF–AWARENESS. [noncount]. : knowledge and awareness of your own personality or character. Her self-awareness was unusual in such a young child."}, {"url": "http://www.academia.edu/800690/Language_awareness_metapragmatics_and_the_L2_teacher", "passage_text": "Teacher Language Awareness should comprise of a metapragmatic component provided by the teacher-whether native or non-native-where students can benefit from learning conditions where certain words or expressions would be most appropriate."}, {"url": "http://www.lexically.net/ala/la_defined.htm", "passage_text": "It covers a wide spectrum of fields. For example, Language Awareness issues include exploring the benefits that can be derived from developing a good knowledge about language, a conscious understanding of how languages work, of how people learn them and use them."}]