[{"url": "https://en.wikipedia.org/wiki/Natrona_Heights,_Pennsylvania", "passage_text": "See also: List of museums in Pennsylvania. Natrona Heights is home to both the Pittsburgh-Tarentum Campmeeting Association, a Methodist-based camp over 160 years old, and to the Pittsburgh Buddhist Center. The town's first structure, the Burtner House, still stands and is open for festivals several times a year. The film Knightriders (1981) by George A. Romero starring Ed Harris used scenes shot on Pennsylvania Avenue and in a restaurant on Freeport Road in Natrona Heights, as well as several scenes in neighboring Natrona for the movie."}, {"url": "http://harrisontwp.com/", "passage_text": "Welcome to Harrison Township! Most people know us as Natrona and Natrona Heights, but we are actually Harrison Township. Harrison Township was formally organized as a First Class Township in March 1900. The largest portion of Harrison Township is residential with mostly single family homes. Currently Maronda Homes is developing over 100 acres of land with additional multi-family and single-family housing, which will number over 300 new units."}, {"url": "http://www.homefacts.com/city/Pennsylvania/Allegheny-County/Natrona-Heights.html", "passage_text": "Natrona Heights is located in Allegheny County, PA. The population is NR. There are 3 public schools in Natrona Heights with an average Homefacts rating of C. there are 9 registered sex offenders residing in the city. Unemployment in Natrona Heights is moderate and the median home sales price is $71,000. Cities near Natrona Heights include Harrison Township, Brackenridge and Tarentum"}, {"url": "http://pennsylvania.hometownlocator.com/pa/allegheny/natrona-heights.cfm", "passage_text": "Natrona Heights (GNIS FID: 1182183) is a populated place located in Allegheny County at latitude 40.623 and longitude -79.73. The elevation is 984 feet. Natrona Heights appears on the New Kensington East U.S. Geological Survey Map. Allegheny County is in the Eastern Time Zone (UTC -5 hours). Allegheny County: Cities & Towns | ZIP Codes | Schools | Features (airports, churches, hospitals, etc."}, {"url": "http://doctor.webmd.com/doctor/john-balacko-md-456838fe-0bf4-4c8e-b996-5c638f7ab0ab-overview", "passage_text": "Dr. Balacko's Overview. Dr. John A. Balacko graduated from the University of Pittsburgh School of Medicine in 1984. He works in Natrona Heights, PA and 1 other location and specializes in Cardiovascular Disease and Interventional Cardiology. "}, {"url": "https://en.wikipedia.org/wiki/Natrona,_Pennsylvania", "passage_text": "Natrona is an unincorporated community in Harrison Township, Allegheny County in the U.S. state of Pennsylvania. The original village of Natrona – then known as East Tarentum – was built as a company town by the Pennsylvania Salt Manufacturing Company in the 1850s."}, {"url": "http://www.falconmd.com/", "passage_text": "Dr. Joseph Falcon. Dr. Joseph Falcon is a plastic surgeon in Natrona Heights, Pennsylvania and is affiliated with multiple hospitals in the area, including Forbes Regional Hospital and UPMC St. Margaret. 1  American Medical Association. 2  Allegheny County Medical Society. 3  Pennsylvania Medical Society. "}, {"url": "https://en.wikipedia.org/wiki/Natrona_Heights,_Pennsylvania", "passage_text": "Natrona Heights is an unincorporated community in Harrison Township, Allegheny County in the U.S. state of Pennsylvania; it is located in Western Pennsylvania within the Pittsburgh Metropolitan Statistical Area, approximately 24 miles (39 km) northeast of Pittsburgh. The film Knightriders (1981) by George A. Romero starring Ed Harris used scenes shot on Pennsylvania Avenue and in a restaurant on Freeport Road in Natrona Heights, as well as several scenes in neighboring Natrona for the movie."}, {"url": "https://en.wikipedia.org/wiki/Natrona_Heights,_Pennsylvania", "passage_text": "Natrona Heights is situated near the Allegheny River, Natrona, Brackenridge, and Tarentum. The film Knightriders (1981) by George A. Romero starring Ed Harris used scenes shot on Pennsylvania Avenue and in a restaurant on Freeport Road in Natrona Heights, as well as several scenes in neighboring Natrona for the movie."}]