[{"url": "http://www.cdc.gov/tb/publications/factsheets/general/tb.htm", "passage_text": "Tuberculosis (TB) is a disease caused by germs that are spread from person to person through the air. TB usually affects the lungs, but it can also affect other parts of the body, such as the brain, the kidneys, or the spine. The symptoms of TB disease of the lungs also include coughing, chest pain, and the coughing up of blood. Symptoms of TB disease in other parts of the body depend on the area affected. TB germs are put into the air when a person with TB disease of the lungs or throat coughs, sneezes, speaks, or sings."}, {"url": "http://www.cdc.gov/tb/topic/basics/default.htm", "passage_text": "Tuberculosis (TB) is caused by a bacterium called Mycobacterium tuberculosis. The bacteria usually attack the lungs, but TB bacteria can attack any part of the body such as the kidney, spine, and brain. If not treated properly, TB disease can be fatal. The TB bacteria are put into the air when a person with TB disease of the lungs or throat coughs, sneezes, speaks, or sings. People nearby may breathe in these bacteria and become infected. TB is NOT spread by. 1  shaking someone's hand. 2  sharing food or drink. 3  touching bed linens or toilet seats. 4  sharing toothbrushes."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001141/", "passage_text": "About TB. TB is a contagious and often severe airborne disease caused by infection with Mycobacterium tuberculosis (Mtb). TB typically affects the lungs, but it also can affect any other organ of the body. It is usually treated with a regimen of drugs taken for 6 months to 2 years depending on the type of infection. For someone to develop active TB disease, the following two events must take place:"}, {"url": "https://en.wikipedia.org/wiki/Tuberculosis", "passage_text": "Tuberculosis, MTB, or TB (short for tubercle bacillus), in the past also called phthisis, phthisis pulmonalis, or consumption, is a widespread, infectious disease caused by various strains of mycobacteria, usually Mycobacterium tuberculosis. The classic symptoms of active TB infection are a chronic cough with blood-tinged sputum, fever, night sweats, and weight loss (the last of these giving rise to the formerly common term for the disease, consumption). Infection of other organs causes a wide range of symptoms."}, {"url": "http://health.williams.edu/keephealthy/general-health-concerns/tuberculosis-tb/", "passage_text": "Tuberculosis, also called TB, is an infection caused by a bacteria. TB usually affects the lungs, but it can spread to the kidneys, bones, spine, brain, and other parts of the body. Not necessarily. A person can be infected with the bacteria that causes TB and NOT have the disease. Many people are infected with the bacteria, but only a few of these people (about 10%) go on to develop the disease. People who have the disease are said to have “active” TB."}, {"url": "http://www.niaid.nih.gov/topics/tuberculosis/Understanding/WhatIsTB/Pages/detailed.aspx", "passage_text": "TB is a contagious and often severe airborne disease caused by infection with Mycobacterium tuberculosis (Mtb) bacteria. TB typically affects the lungs, but it also can affect any other organ of the body. "}, {"url": "http://www.webmd.com/lung/tc/tuberculosis-tb-topic-overview", "passage_text": "Tuberculosis is either latent or active. 1  Latent TB means that you have the TB bacteria in your body, but your body's defenses (immune system) are keeping it from turning into active TB. 2  Active TB means that the TB bacteria are growing and causing symptoms. "}, {"url": "http://www.cdc.gov/tb/topic/basics/default.htm", "passage_text": "TB is spread through the air from one person to another. The TB bacteria are put into the air when a person with TB disease of the lungs or throat coughs, sneezes, speaks, or sings. People nearby may breathe in these bacteria and become infected. TB is NOT spread by. 1  shaking someone's hand. 2  sharing food or drink. 3  touching bed linens or toilet seats. 4  sharing toothbrushes."}, {"url": "http://www.who.int/features/qa/08/en/", "passage_text": "A: Tuberculosis (TB) is caused by bacteria (Mycobacterium tuberculosis) that most often affect the lungs. Tuberculosis is curable and preventable. TB is spread from person to person through the air. When people with lung TB cough, sneeze or spit, they propel the TB germs into the air. "}, {"url": "https://en.wikipedia.org/wiki/Tuberculosis", "passage_text": "Tuberculosis typically attacks the lungs, but can also affect other parts of the body. It is spread through the air when people who have an active TB infection cough, sneeze, or otherwise transmit respiratory fluids through the air. The classic symptoms of active TB infection are a chronic cough with blood-tinged sputum, fever, night sweats, and weight loss (the last of these giving rise to the formerly common term for the disease, consumption). Infection of other organs causes a wide range of symptoms."}]