[{"url": "http://nutgrowing.org/chestnutidentification.htm", "passage_text": "Introduction Chestnuts have been cultivated for nuts and wood for thousands of years. The name Castanea is believed to come from Kastanea, a city in Pontus, Turkey. European chestnuts (Castanea sativa) probably survived the ice age in Southern Russia in the Caucasus Mountains, between the Black and the Caspian Seas. Chestnuts are also important in Asia, where there are four native species (Castanea mollissima, C. henryi, C. seguinii, and C. crenata). In North America, pollen records from the last interglacial period show that American chestnut trees, Castanea dentata, were present on Long Island 30,000 to 50,000 years ago."}, {"url": "http://www.ehow.com/facts_5006928_what-types-chestnut-tree.html", "passage_text": "Chinese. There are many different Chinese species of chestnut, including Castanea mollisima, davidii, henryl and seguinii. The Chinese varieties of chestnut tend to be wide and not as tall as European and American versions. European. Castanea sativa, or sweet chestnut, is the only European species of chestnut. The European chestnut is tall and has a massive trunk, and the foliage changes to yellow in the autumn."}, {"url": "http://www.gardenguides.com/74709-types-chestnut-trees.html", "passage_text": "Types of Chestnut Trees image by algiamil/sxc.hu, Steve Hurst/USDA-NRCS PLANTS Database. Nothing tastes better than roasted chestnuts with a cup of hot chocolate on a cold winter's night. The American chestnut tree once dominated forests in the Eastern United States, but a blight of Asian fungus destroyed 3.5 billion trees by 1940. Japanese Chestnut. According to the U.S. Department of Agriculture, the Japanese chestnut (Castanea crenata) grows well only in Florida in the United States; it is native to Japan and grows prolifically there. This tree grows to a height of nearly 30 feet, and its leaves are about 7 inches long."}, {"url": "https://en.wikipedia.org/wiki/Chestnut", "passage_text": "The chestnut group is a genus (Castanea) of eight or nine species of deciduous trees and shrubs in the beech family Fagaceae, native to temperate regions of the Northern Hemisphere. 1 Asiatic species Castanea crenata (Japanese chestnut), Castanea mollissima (Chinese chestnut), Castanea davidii (China), Castanea henryi (Chinese chinkapin, also called Henry's chestnut – China) and Castanea seguinii (also called Seguin's chestnut – China)."}, {"url": "http://www.scientificamerican.com/article/chestnut-forest-a-new-generation-of-american-chestnut-trees-may-redefine-americas-forests/", "passage_text": "As a whole, the deciduous forest was home to many different tree species—oaks, beeches, maples, basswoods, hickories, chestnut, ashes, elms, birches and poplars—but different types of trees predominated in different regions. Between Maine and northern Georgia oaks and chestnuts prevailed. "}, {"url": "http://www.gardenguides.com/74709-types-chestnut-trees.html", "passage_text": "Chinquapin Chestnut. The chinquapin (Castanea pumila), also spelled chinkapin, is a dwarf chestnut that has yellow flowers and grows to a height of 14 feet by the time it is 20 years old. It grows well in coarse-and medium-textured soils in zones 5 to 9. The nuts are small. It needs at least 40 days of rain and 150 frost-free days per year. Japanese Chestnut. According to the U.S. Department of Agriculture, the Japanese chestnut (Castanea crenata) grows well only in Florida in the United States; it is native to Japan and grows prolifically there. This tree grows to a height of nearly 30 feet, and its leaves are about 7 inches long."}, {"url": "http://www.gardenguides.com/121144-types-chestnut-tree.html", "passage_text": "Comments. Submit. Chestnut trees are deciduous trees, meaning they lose their leaves each fall and remain leafless during the winter. Some chestnut tree types produce sweet, edible nuts that are encased in a hard, spiny shell while others are known for their striking flowers. Grown in a wide range of shapes and sizes, chestnut trees make ideal specimen trees. "}, {"url": "http://ecosystems.psu.edu/research/chestnut/breeding/identification", "passage_text": "Chestnut Tree Identification. Some may be surprised to learn that the Horse Chestnut is not really a chestnut. They are actually a member of a completely different family, Hippocastanaceae, which contains horse chestnuts and buckeyes. "}, {"url": "http://www.songonline.ca/nuts/chestnut.htm", "passage_text": "Sweet Chestnut (Castanea species). Forest Chestnuts. The American chestnut (Castanea dentata) was one of the largest growing forest trees in eastern North America. It was important for timber as well as nuts for human use as well as wildlife. A deadly fungus disease, introduced from the Orient effectively wiped out this chestnut in the first half of the 20th century."}, {"url": "http://www.ehow.com/facts_5006928_what-types-chestnut-tree.html", "passage_text": "The chestnut tree is a member of the Fagaceae family, the same family as the oak and the beech tree. The chestnut belongs to the genus Castanea, and is divided into four main types: European, Chinese, Japanese and American. European. Castanea sativa, or sweet chestnut, is the only European species of chestnut. The European chestnut is tall and has a massive trunk, and the foliage changes to yellow in the autumn."}]