[{"url": "http://ancienthistory.mrdonn.org/money.html", "passage_text": "Ancient India: In ancient India, people used money trees to store their coins. A money tree was a flat piece of metal, shaped like a tree, with metal branches. At the end of each branch was a round disk with a hole in the center. Each of these disks was an ancient Indian coin. The ancient Egyptians used ring money. Ring money was an actual ring made of bronze, copper, or gold. In ancient Egypt, people like to wear their wealth. When it came time to pay their bills, they simply pulled off a ring or two to use as payment."}, {"url": "http://ancienthistory.mrdonn.org/money.html", "passage_text": "Coins were not only used as money. In ancient Greece, coins were also believed to have magical powers. The Greeks designed their coins with pictures of their gods and goddesses. The Greeks were the first civilization to use pictures of real people on their coins. The first was Alexander the Great, back around 325 BCE. As time went on, the Greeks created bigger coins, each designed to commemorate a special event. Ancient Rome: The ancient Romans thought the use of coins was really clever. The ancient Egyptians used ring money. Ring money was an actual ring made of bronze, copper, or gold. In ancient Egypt, people like to wear their wealth. When it came time to pay their bills, they simply pulled off a ring or two to use as payment."}, {"url": "http://historylink101.com/2/greece3/money.htm", "passage_text": "Money in Ancient Greece. Before 600 B.C. there was no monetary system in Greece, so they utilized the barter system. This was a system of trading goods and /or services for other goods and/or services. By 500 B.C., each city-state began minting their own coin. A merchant usually only took coins from their own city. "}, {"url": "http://www.mycoincollecting.com/ancient-coins.html", "passage_text": "The minting of coins spread rapidly from Lydia to the city states of ancient Greece. Around 600 BC, the island of Aegina produced what are believed to be the first Greek coins. These coins were known as silver drachmae and obols and depicted a turtle on the reverse, the symbol of Aegina. Ancient Coins Collecting is a challenging task, but it's the best way to enjoy and learn history of ancient civilizations. As everyone knows, coins are a form of money or medium of exchange. In addition to coins and paper currency as we now know them, a wide variety of items have been used as money at different times in history, both prior to and after the invention of coins. These items have included, beads, cigarettes, feathers, ivory, cattle, salt, shells, thimbles and wampum"}, {"url": "https://en.wikipedia.org/wiki/History_of_money", "passage_text": "Many cultures around the world eventually developed the use of commodity money. Ancient China, Africa, and India used cowry shells. Trade in Japan's feudal system was based on the koku – a unit of rice. As early as 9000 BC both grain and cattle were used as money or as barter (Davies) (the first grain remains found, considered to be evidence of pre-agricultural practice date to 17,000 BC)."}, {"url": "http://ancientmesopotamians.com/ancient-mesopotamia-money-and-currency.html", "passage_text": "Money was not in coin form at that time, although words like minas and shekels that are used in connection with coinage were applied to the weights of the ancient Mesopotamian form of money. Silver rings were used in Mesopotamia and Egypt as currency about 2000 years before the first coins were struck. Some archaeologists suggest that money was used by wealthy citizens of Mesopotamia as early as 2,500 B.C., or perhaps a few hundred years earlier. Later, around 250 BC, coins made from valuable metals such as gold, silver and bronze became popular and were extensively used in most parts of the Mediterranean, the Near East as well as countries located in Southwest Asia, especially in India."}, {"url": "https://en.wikipedia.org/wiki/History_of_money", "passage_text": "Gold and silver were used as the most common form of money throughout history. In many languages, such as Spanish, French, and Italian, the word for silver is still directly related to the word for money. Although gold and silver were commonly used to mint coins, other metals were used. As early as 9000 BC both grain and cattle were used as money or as barter (Davies) (the first grain remains found, considered to be evidence of pre-agricultural practice date to 17,000 BC)."}, {"url": "http://www.funtrivia.com/askft/Question118955.html", "passage_text": "The history of coins used primarily as currency in the Western world usually begins by mentioning Lydia, the neo-Hittite civilization that arose in the 12th century B.C. Coins dating back to around 643 B.C. in that region were found made of electrum, a natural alloy of gold and silver. These coins are generally considered the first real use of metal for money, because they were guaranteed by the Lydian rulers, and were manufactured consistently."}, {"url": "http://rome.mrdonn.org/money.html", "passage_text": "The Greeks designed their coins with pictures of their gods and goddesses. But the Greeks were the first civilization to use pictures of real people on their coins. The first was Alexander the Great, back around 325 BCE. Ancient Greece: 2,500 years ago, each Greek city-state had developed its own coinage. Each Greek city-state had banks where visiting traders could exchange their coins for Greek coins, coins they would then use to buy and sell in the great Greek marketplaces."}]