[{"url": "http://www.news-medical.net/health/Hippocampus-Functions.aspx", "passage_text": "Hippocampus Functions. By Dr Ananya Mandal, MD. The hippocampus is a small organ located within the brain's medial temporal lobe and forms an important part of the limbic system, the region that regulates emotions. The hippocampus is associated mainly with memory, in particular long-term memory. The organ also plays an important role in spatial navigation. Damage to the hippocampus can lead to loss of memory and difficulty in establishing new memories. "}, {"url": "http://www.wisegeek.com/what-is-the-hippocampus.htm", "passage_text": "The hippocampus, so named because its shape vaguely resembles that of a seahorse, is responsible for encoding long-term memories and helping with spatial navigation. It's one of the phylogenetically oldest parts of the brain, and the first part chosen to be artificially replicated as a brain prosthesis. "}, {"url": "http://study.com/academy/lesson/hippocampus-definition-function-location.html", "passage_text": "The Hippocampus. The hippocampus is a part of the limbic system. The limbic system is the area in the brain that is associated with memory, emotions, and motivation. The limbic system is located just above the brain stem and below the cortex. The hippocampus itself is highly involved with our memories."}, {"url": "http://www.news-medical.net/health/Hippocampus-What-is-the-Hippocampus.aspx", "passage_text": "The hippocampus is a small region of the brain that forms part of the limbic system and is primarily associated with memory and spatial navigation. The hippocampus can become also become damaged through oxygen deprivation or hypoxia, infection or inflammation or as a result of temporal lobe epilepsy. Individuals with hippocampal damage develop amnesia and may be unable to form new memories of the time or location of an event, for example."}, {"url": "http://www.news-medical.net/health/Hippocampus-What-is-the-Hippocampus.aspx", "passage_text": "Anatomy and location. The hippocampus is located in the medial temporal lobe of the brain, underneath the cortical surface. Its structure is divided into two halves which lie in the left and right sides of the brain. The hippocampus can become also become damaged through oxygen deprivation or hypoxia, infection or inflammation or as a result of temporal lobe epilepsy. Individuals with hippocampal damage develop amnesia and may be unable to form new memories of the time or location of an event, for example."}, {"url": "http://www.merriam-webster.com/dictionary/hippocampus", "passage_text": "Definition of HIPPOCAMPUS. : a curved elongated ridge that extends over the floor of the descending horn of each lateral ventricle of the brain, that consists of gray matter covered on the ventricular surface with white matter, and that is involved in forming, storing, and processing memory. : a curved elongated ridge that is an important part of the limbic system, extends over the floor of the descending horn of each lateral ventricle of the brain, consists of gray matter covered on the ventricular surface with white matter, and is involved in forming, storing, and processing memory—see pes hippocampi."}, {"url": "https://en.wikipedia.org/wiki/Hippocampus", "passage_text": "Humans and other mammals have two hippocampi, one in each side of the brain. It belongs to the limbic system and plays important roles in the consolidation of information from short-term memory to long-term memory and spatial navigation. The hippocampus is located under the cerebral cortex; and in primates it is located in the medial temporal lobe, underneath the cortical surface. Today, the structure is called the hippocampus rather than hippocampus major, with pes hippocampi often being regarded as synonymous with De Garengeot's cornu Ammonis, a term that survives in the names of the four main histological divisions of the hippocampus: CA1, CA2, CA3, and CA4."}, {"url": "http://biology.about.com/od/anatomy/p/hippocampus.htm", "passage_text": "By Regina Bailey. Hippocampus: The hippocampus is the part of the brain that is involved in memory forming, organizing, and storing. It is a limbic system structure that is particularly important in forming new memories and connecting emotions and senses, such as smell and sound, to memories. The hippocampus is a horseshoe shaped paired structure, with one hippocampus located in the left brain hemisphere and the other in the right hemisphere."}, {"url": "https://en.wikipedia.org/wiki/Hippocampus", "passage_text": "In Alzheimer's disease, the hippocampus is one of the first regions of the brain to suffer damage; memory loss and disorientation are included among the early symptoms. Damage to the hippocampus can also result from oxygen starvation (hypoxia), encephalitis, or medial temporal lobe epilepsy. Today, the structure is called the hippocampus rather than hippocampus major, with pes hippocampi often being regarded as synonymous with De Garengeot's cornu Ammonis, a term that survives in the names of the four main histological divisions of the hippocampus: CA1, CA2, CA3, and CA4."}, {"url": "http://www.healthline.com/human-body-maps/hippocampus", "passage_text": "The hippocampus, Latin for seahorse, is named for its shape. It is part of a system that directs many bodily functions: the limbic system. This system is located in the brain's medial temporal lobe, near the center of the brain. The hippocampus is involved in the storage of long-term memory, which includes all past knowledge and experiences. The hippocampus is not involved with short-term memory and procedural memory types (memory of how to do motor actions, like walking)."}]