[{"url": "http://www.thefreedictionary.com/wimple", "passage_text": "wimple-headdress of cloth; worn over the head and around the neck and ears by medieval women. wimple. portrait of Margaret of Austria (1480-1530) by Bernard van Orley (1488-1551). n."}, {"url": "http://www.merriam-webster.com/dictionary/wimple", "passage_text": "Full Definition of WIMPLE. 1. : a cloth covering worn over the head and around the neck and chin especially by women in the late medieval period and by some nuns. 2. Scottish a: a crafty turn: twist b: curve, bend. See wimple defined for English-language learners. See wimple defined for kids. ADVERTISEMENT. : a cloth covering worn over the head and around the neck and chin especially by women in the late medieval period and by some nuns"}, {"url": "https://en.wikipedia.org/wiki/Wimple", "passage_text": "Its use developed among women in early medieval Europe. At many stages of medieval culture it was unseemly for a married woman to show her hair. A wimple might be elaborately starched, and creased and folded in prescribed ways, even supported on wire or wicker framing (cornette). Italian women abandoned their head cloths in the 15th century, or replaced them with transparent gauze, and showed their elaborate braids. "}, {"url": "https://en.wikipedia.org/wiki/Wimpel", "passage_text": "A wimpel (Yiddish: ווימפל ‎, from German, cloth, derived from Old German, bewimfen, meaning to cover up or conceal) is a long, linen sash used as a binding for the Sefer Torah by Jews of Germanic (Yekke) origin. "}, {"url": "http://rosaliegilbert.com/veilsandwimples.html", "passage_text": "The difference between a wimple and a gorget The difference between a wimple and a gorget, is that the wimple encircles the entire head under the veil, whereas a gorget covers the neck alone and was usually draped upwards and tucked into either a headdress or styled hair. Wimple shapes and sizes It appears there is no one standard size or shape to the wimple other than it passes under the chin and over the neck. It can be a rectangular piece which wraps around the head and neck or a circular piece with a hole cut for the face. There seems to be no one correct way."}, {"url": "http://slumberland.org/sca/articles/how_to_make_a_wimple.pdf", "passage_text": "How to make a simple medieval wimple by Lady Wenyeva atte greneA wimple is a useful item of clothing for medieval recreationists. It covers modern hair, it covers the neck and upper chest (preventing sunburn), and it gives you something to pin a veil to. Pretty handy! This handout will show you how to make a pattern for your own wimple. The result is a funnel-like wimple that you can just pull on over your head."}, {"url": "http://www.wisegeek.com/what-is-a-wimple.htm", "passage_text": "A wimple is a garment which is worn over the head and ears and around the chin. Many people associate wimples with very traditional orders of nuns, who continue to wear this garment along with full habits. White linen was the most common fabric for the wimple wearer during the Renaissance period. Wealthy women would prefer cotton however because it was regarded as a rich person's fabric."}, {"url": "http://www.revivalclothing.com/wimple.aspx", "passage_text": "Although less ubiquitous by the 14th century than in earlier centuries, the wimple remained a common piece of female attire throughout the period, and was a natural way to attach the veil. Our wimple has a smooth, elegant line that frames the face, and is specifically designed to be integrated with our veils. It can be worn to completely conceal the hair or not, as you choose. We have made the wimple out of lightweight linen for comfort, even during the heat of summer. 22 - 22.5 / 56 - 57cm. XLarge. 23 - 24.5 / 58 - 60cm. Use the head measurement at the place you will want to wear the front edge of the wimple. Choose your size based on how you prefer the wimple to fit-smaller for a tighter fit to keep hair inside wimple or larger for a looser, more relaxed fit."}]