[{"url": "http://culinaryarts.about.com/od/glossary/g/Corned-Beef.htm", "passage_text": "Corned beef can also be made from the beef round primal cut. Both the round and the brisket are relatively tough cuts of meat that are best cooked by slow, moist-heat cooking. A good corned beef is quite tender with a delicious salty flavor."}, {"url": "http://articles.mercola.com/sites/articles/archive/2011/01/22/if-you-eat-processed-meats-youre-risking-your-life.aspx", "passage_text": "Try to avoid processed meats such as bacon, ham, salami, corned beef and some sausages.. You read that right -- no amount of processed meat is safe. The reaction of the meat industry was swift, and they promptly accused the report of being erroneous and a tool of the anti-meat lobby."}, {"url": "http://www.besthealthmag.ca/best-eats/nutrition/are-processed-meats-safe/", "passage_text": "There isn’t an exact definition of 'processed meat,' but most often (including in this article), it refers to meats preserved by smoking, curing, salting or adding chemicals such as sodium nitrite. They include ham, bacon, corned beef, salami, bologna, pastrami, hot dogs and bratwurst."}, {"url": "http://homecooking.about.com/od/beef/a/cornedbeef.htm", "passage_text": "Luckily, most of today's corned beef is processed without nitrates (saltpeter), which used to be used as a preservative against botulism and to maintain the bright red color."}, {"url": "http://www.simplyrecipes.com/recipes/home_cured_corned_beef/", "passage_text": "(You can use the spiced cooking liquid to cook vegetables for boiled dinner or corned beef and cabbage .) Notice the visible lines on the meat; this is the grain of the meat, or the direction of the muscle fibers. To make the meat easier to cut, cut it first in half, along the grain of the meat."}, {"url": "http://blog.aicr.org/2012/02/23/what-is-processed-meat-anyway/", "passage_text": "Corned beef is a processed meat because it is cured through the curing brine. The brine contains both salt and usually a type of pink curing salt which contains sodium nitrite. The pink curing salt is what makes the corned beef a pink color."}, {"url": "http://homecooking.about.com/od/beef/a/cornedbeef.htm", "passage_text": "Brisket is the most common cut used for corned beef, although other cuts can also be used. Corned beef is beef that is cured in a salt brine, often with spices. Some meat-packers actually inject the brine into the arterial network."}, {"url": "http://www.aicr.org/enews/2014/08-august/faq-processed-meat-and.html", "passage_text": "Bacon, ham, cold cuts – we get more questions about processed meats than any other type of food. It’s not surprising since the headlines can change with every new study. So we put together some answers to your most-asked questions."}]