[{"url": "https://ca.answers.yahoo.com/question/index?qid=20090614232115AAD0da1", "passage_text": "The stronger the contractions the more you dilate. Often you could begin to dilate more after the water breaks and begin to have contractions and just stall. So again, it depends on your body. You have to be at least 3/12 or 4 cm before admittance to hospital to give birth. Or of course, if your contractions are 1-2 minutes a part! Yes, it's 10 cm to start pushing. However, if the baby is not in the birth canal some pushing may be required to help to get the baby in position. Again, that doesn't always help. "}, {"url": "http://www.babycenter.com/400_how-many-centimeters-dilated-do-i-have-to-be-before-i-go-int_8991965_445.bc", "passage_text": "Active labor is usually defined as being 4 centimeters dilated and experiencing contractions that are furthur dilating the cervix. Fully dilated is 10 centimeters, more or less depending on the size of your baby's head. Honestly, some people walk around for weeks, or sometimes even months a couple of centimeters dilated. posted 04/23/2011 by DannysMommy2009. Report answer"}, {"url": "http://americanpregnancy.org/labor-and-birth/first-stage-of-labor/", "passage_text": "1 Early Labor Phase – The time of the onset of labor until the cervix is dilated to 3 cm. 2  Active Labor Phase – Continues from 3 cm. until the cervix is dilated to 7 cm. 3  Transition Phase – Continues from 7 cm. until the cervix is fully dilated to 10 cm. What to expect: 1  Early labor will last approximately 8-12 hours. 2  Your cervix will efface and dilate to 3 cm. 3  Contractions will last about 30-45 seconds, giving you 5-30 minutes of rest between contractions. 4  Contractions are typically mild and somewhat irregular, but become progressively stronger and more frequent."}, {"url": "http://www.justmommies.com/articles/effacement-and-dilation.shtml", "passage_text": "It’s generally estimated that the cervix will dilate one centimeter during each hour of labor, but this cannot be generalized for every woman or every pregnancy. 0-4 centimeters dilation is considered early labor, and it’s not uncommon for a woman to be up to 2 centimeters dilated several weeks before giving birth. Dilation of 4-7 centimeters occurs during active labor. 7-10 centimeters is the transition phase (shift from active labor to the final phase, delivery), and when your cervix is at 10 centimeters (about the size of a newborn’s head), it’s considered fully dilated and you’re ready to give birth. Average:"}, {"url": "http://www.answers.com/Q/How_many_centimeters_do_you_have_to_be_to_give_birth", "passage_text": "Ideally, the uterus needs to be dilated to 10 centimeters for a woman to give birth. "}, {"url": "http://www.givingbirthnaturally.com/stages-of-labor.html", "passage_text": "ACTIVE. Active labor is more intense with longer, stronger, more intense contractions that may be 3-5 minutes apart and last up to 60 seconds. This is the beginning of the serious phase, where relaxation comes into play and the birth companion's role becomes more prominent. Dilation is usually from 5-7 centimeters. The pushing stage, the second phase of labor, begins once 10 centimeters has been reached. This will end with the much-anticipated birth of the baby. This stage can last a few minutes or several hours. In a natural birth, the pushing phase is typically much shorter than in a medicated one."}, {"url": "http://www.themedicalquestions.com/Med/how-much-must-you-be-dilated-to-give-birth.html", "passage_text": "How much must you be dilated to give birth. http://www.chacha.com/question/how-much-must-you-be-dilated-to-give-birth. You need to be at 10 cm. If you push before cervix is fully dilated, cervix may swell & you may not be able to deliver vaginally. [ Source: http://www.chacha.com/question/how-much-must-you-be-dilated-to-give-birth ]. More Answers to  How much must you be dilated to give birth "}]