[{"url": "http://www.artofmanliness.com/2010/05/24/finding-your-calling-part-i-what-is-a-vocation/", "passage_text": "The etymology of vocation versus career is most revealing. The word vocation comes from the Latin word “vocare” or “to call.” It denotes a voice summoning a person to a unique purpose. The word career derives from the Latin word for cart and the Middle French word for race track. "}, {"url": "http://www.merriam-webster.com/dictionary/vocation", "passage_text": "Word Root of VOCATION. The Latin word vox, meaning “ voice, ” and the related word vocāre, meaning “ to call ” , give us the root voc or vok. Words from the Latin vox or vocāre have something to do with the voice or with calling. Anything voc al is produced by the voice. A voc ation is the work that someone is called to do as a job."}, {"url": "https://en.wikipedia.org/wiki/Vocation", "passage_text": "Use of the word vocation before the sixteenth century referred firstly to the call by God to an individual, or calling of all humankind to salvation, particularly in the Vulgate, and more specifically to the vocation to the priesthood or to the religious life, which is still the usual sense in Roman Catholicism. Calvinism developed complex ideas about different types of vocations of the first type, connected with the concepts of Predestination, Irresistible grace, and the elect. There are the vocatio universalis, the vocatio specialis, only extended to some."}, {"url": "http://www.csbsju.edu/journey/mission-and-vision/meditations-and-reflections/vocation-discernment", "passage_text": "No matter how you define vocation, one definition that can bring great purpose to one's life is a Christian belief that God has created each person with gifts and talents oriented toward specific purposes and way of life. In other words Its what you do while you do what you do.. Each of us has a vocation. So you want to become a teacher, a lawyer, a gardner, a receptionist. A doctor, a network engineer, a musician, an administrator. You want to live your life as a mother, a father, an Aunt or Uncle. Vocation is the act of living out the gifts and talents that allow you to live as the lawyer, musician, father, or aunt"}, {"url": "https://en.wikipedia.org/wiki/Vocational_education", "passage_text": "Vocational education is education within vocational schools that prepares people for a specific trade. It directly develops expertise in techniques related to technology, skill and scientific technique to span all aspects of the trade. Vocational education is classified as using procedural knowledge. "}, {"url": "http://www.arlingtondiocese.org/vocations/voc_definitions.aspx", "passage_text": "vocation definitions. Vocation: Vocation means a call. It is God’s invitation, His call to each person to love and serve Him and His Church in a particular state or way of life. Each person's vocation flows from the grace of Baptism. Discernment: When talking about discovering your vocation, discernment means the process of that discovery through prayer, reflection and discussion as to how God calls each person to love Him, whether as a priest, a consecrated religious man or woman, a married person or a consecrated single person."}, {"url": "http://www.cam.org.au/vocations/The-Call/What-is-a-Vocation-", "passage_text": "A vocation is a call from God, and anyone who has felt God's call knows that the process is anything but simple. While most people think of a vocation as what they are called to do in life, it is important to understand that the first and most important call from God is a call to be-the universal call to holiness. Clarification. Your vocation is not the same as your career or profession. However, there is an overlap between a vocation and a profession. A career or a profession is something that you have in order to support yourself and to contribute in some way to the good of the society. The lifestyle and demands of each particular vocation is very different but there are some similarities between them. Each vocation is a commitment to love in a certain way. The object of every vocation is God."}, {"url": "https://en.wikipedia.org/wiki/Vocation", "passage_text": "A vocation (from Latin vocātiō, meaning a call, summons) is an occupation to which a person is specially drawn or for which she/he is suited, trained, or qualified. Though now often used in non-religious contexts, the meanings of the term originated in Christianity. Calvinism developed complex ideas about different types of vocations of the first type, connected with the concepts of Predestination, Irresistible grace, and the elect. There are the vocatio universalis, the vocatio specialis, only extended to some."}, {"url": "http://www.merriam-webster.com/dictionary/vocation", "passage_text": "Full Definition of VOCATION. 1. a: a summons or strong inclination to a particular state or course of action; especially: a divine call to the religious life b: an entry into the priesthood or a religious order. 2. a: the work in which a person is employed: occupation b: the persons engaged in a particular occupation. 3. The Latin word vox, meaning “ voice, ” and the related word vocāre, meaning “ to call ” , give us the root voc or vok. Words from the Latin vox or vocāre have something to do with the voice or with calling. Anything voc al is produced by the voice. A voc ation is the work that someone is called to do as a job."}, {"url": "http://www.vocation.com/QandAItem.aspx?id=1831", "passage_text": "In the simplest terms, “vocation” means a “call.” So, in general terms your vocation is what God calls you to do with your life. Everybody is called by God to know, love and serve him. The difference is how each one does this. Individual vocations vary between being single, married, consecrated, religious or a priest. "}]