[{"url": "https://en.wikipedia.org/wiki/Genetically_modified_food", "passage_text": "The genetically modified foods controversy is a dispute over the use of food and other goods derived from genetically modified crops and other uses of genetic engineering in food production. Scientists discovered in 1946 that DNA can transfer between organisms. The first genetically modified plant was produced in 1983, using antibiotic-resistant tobacco. In 1994, the transgenic Flavr Savr tomato was approved by the FDA for marketing in the US."}, {"url": "http://www.who.int/foodsafety/areas_work/food-technology/faq-genetically-modified-food/en/", "passage_text": "1. Genetically modified organisms (GMOs) can be defined as organisms (i.e. plants, animals or microorganisms) in which the genetic material (DNA) has been altered in a way that does not occur naturally by mating and/or natural recombination. Frequently asked questions on genetically modified foods. These questions and answers have been prepared by WHO in response to questions and concerns from WHO Member State Governments with regard to the nature and safety of genetically modified food."}, {"url": "https://en.wikipedia.org/wiki/Genetically_modified_food", "passage_text": "There is general scientific agreement that food on the market from genetically modified crops is not inherently riskier to human health than conventional food. No reports of ill effects have been documented in the human population from GM food. Scientists discovered in 1946 that DNA can transfer between organisms. The first genetically modified plant was produced in 1983, using antibiotic-resistant tobacco. In 1994, the transgenic Flavr Savr tomato was approved by the FDA for marketing in the US."}, {"url": "http://www.who.int/topics/food_genetically_modified/en/", "passage_text": "Genetically modified (GM) foods are foods derived from organisms whose genetic material (DNA) has been modified in a way that does not occur naturally, e.g. through the introduction of a gene from a different organism. "}, {"url": "https://en.wikipedia.org/wiki/Genetically_modified_food", "passage_text": "Corn used for food has been genetically modified to tolerate various herbicides and to express a protein from Bacillus thuringiensis (Bt) that kills certain insects. About 90% of the corn grown in the U.S. was genetically modified in 2010. Scientists discovered in 1946 that DNA can transfer between organisms. The first genetically modified plant was produced in 1983, using antibiotic-resistant tobacco. In 1994, the transgenic Flavr Savr tomato was approved by the FDA for marketing in the US."}, {"url": "http://edis.ifas.ufl.edu/fs084", "passage_text": "A genetically engineered (GE) organism is one where its DNA is modified using techniques that permit the direct transfer or removal of genes in that organism. Organisms that undergo genetic engineering are sometimes referred to as transgenic. Hard cheeses provide another example of the use of genetically modified organisms in food production. Chymosin, the primary component of rennet, is the milk-clotting enzyme used to make cheese and other dairy products. Traditionally, this substance was derived from the stomachs of calves"}, {"url": "http://edis.ifas.ufl.edu/fs084", "passage_text": "A genetically modified (GM) food or genetically modified organism (GMO) results from the use of recombinant DNA biotechnological procedures that allow the genetic makeup of a food or organism to be altered in some way. Hard cheeses provide another example of the use of genetically modified organisms in food production. Chymosin, the primary component of rennet, is the milk-clotting enzyme used to make cheese and other dairy products. Traditionally, this substance was derived from the stomachs of calves"}, {"url": "http://learn.genetics.utah.edu/content/science/gmfoods/", "passage_text": "Yet there is considerable opposition to the use of genetically modified plants for food production and other uses. Genetic engineering offers a time-saving method for producing larger, higher-quality crops with less effort and expense. 1 You are a tomato farmer whose crops are threatened by a persistent species of beetle. 2  Each year, you spend large sums of money for pesticides to protect your crops."}, {"url": "https://en.wikipedia.org/wiki/Genetically_modified_organism", "passage_text": "A genetically modified organism (GMO), also known as a transgenic organism, is any organism whose genetic material has been altered using genetic engineering techniques (i.e. genetically engineered organism). While some genetically modified plants are developed by the introduction of a gene originating from distant, sexually incompatible species into the host genome, cisgenic plants contain genes that have been isolated either directly from the host species or from sexually compatible species."}]