[{"url": "http://www1.salary.com/Helicopter-Pilot-salary.html", "passage_text": "The annual salary for someone with the job title Helicopter Pilot may vary depending on a number of factors including industry, company size, location, years of experience and level of education. For example the median expected annual pay for a typical Helicopter Pilot in the United States is $86,822, so 50% of the people who perform the job of Helicopter Pilot in the United States are expected to make less than $86,822. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus"}, {"url": "http://www.ehow.com/info_8669750_salary-private-jet-pilot.html", "passage_text": "National Ranges and Averages. Commercial pilots earned an average of $82,430 as of May 2014, reports the U.S. Bureau of Labor Statistics. The median, or middle salary, was $75,620, with commercial pilots in the top one-tenth making $141,210 and the bottom 10 percent earning $35,250. Where Salaries Fly High. Based on the Bureau of Labor Statistics' data, look to the northeast corridor for the highest average pay. As of 2014, New Jersey led the way among states with $111,120, and Connecticut was second with $102,160. Among metropolitan areas:"}, {"url": "http://tdmoney.com/2013/04/executive-private-pilots-earn/", "passage_text": "Earning data from 2010 bears this assertion out. Corporate pilots, with between five and nine years of flight service, earned between $53,607 and $79,623, while their compatriots, who had lodged twenty or more years in the cockpit, earned within the range of $70,159 to $103,285. New York offers the highest corporate pilot salaries with median earnings clocking in at $142,390 with Kentucky following close behind at annual salaries of $138,670. Hawaii rounds out the top three states with average salaries of $122,800."}, {"url": "http://tdmoney.com/2013/04/executive-private-pilots-earn/", "passage_text": "Wyoming, North Dakota, Montana, and Idaho registered the lowest pilot salaries at $48,050. By city, pilots earned the most in Louisville, Kentucky at $150,250, while New York City flyers earned $148,960 for their efforts. New York offers the highest corporate pilot salaries with median earnings clocking in at $142,390 with Kentucky following close behind at annual salaries of $138,670. Hawaii rounds out the top three states with average salaries of $122,800."}, {"url": "http://tdmoney.com/2013/04/executive-private-pilots-earn/", "passage_text": "Compensation for private chartered pilots is just under $90,000, according to United States Bureau of Labor Statistics. With an annual mean wage of $89,870, these pilots can expects those numbers to be influenced by a number of factors. New York offers the highest corporate pilot salaries with median earnings clocking in at $142,390 with Kentucky following close behind at annual salaries of $138,670. Hawaii rounds out the top three states with average salaries of $122,800."}, {"url": "http://www.avjobs.com/salaries-wages-pay/pilot-pay.asp", "passage_text": "Pilot Based Pay Rates. Pilot Career salary, wage, and pay information as of 10/15/2015. World Wide Companies, legacy, major, low cost, national, regional and cargo earnings. Current Salary & Hourly New Hire earnings as reported by Participating Aviation Employers. This is what aviation employers are offering to new hire Pilots today."}, {"url": "http://www.insidejobs.com/articles/how-much-does-a-helicopter-pilot-make", "passage_text": "Education: Associate's Salary: $35,000 – $120,000 Balloonist Ride the air currents in colorful hot-air balloons. Education: Associate's Salary: $35,000 – $120,000 Helicopter Pilot Fly high with tail-rotors as the captain of these crafts. Education: Associate's Salary: $35,000 – $120,000 Blimp Pilot Leisurely travel the skies as the captain of a dirigible. Education: Associate's Salary: $35,000 – $120,000. But of course, income should also be a concern. According to the U.S. Bureau of Labor Statistics, the average salary of a Helicopter Pilot is $111,680 annually. However, mid-range Helicopter Pilot salaries range from $81,580 to $150,480."}]