[{"url": "http://www.healthhype.com/supraspinatus-tendon-tendinitis-tendinosis-and-tear.html", "passage_text": "The supraspinatus tendon attaches the supraspinatus muscle, which arise from the shoulder blade, to the head of the arm bone at the shoulder joint. Function of Supraspinatus Muscle. The supraspinatus muscle is part of the rotator cuff – a group of muscles that move the shoulder joint. It arises from the upper part of the spine of the scapula (upper in Latin = supra; from here the name supraspinatus)."}, {"url": "http://www.healthhype.com/supraspinatus-tendon-tendinitis-tendinosis-and-tear.html", "passage_text": "This may lead to a supraspinatus tendon tear. Even after a complete supraspinatus tendon tear, lifting the arm is still possible, since the function of the supraspinatus muscle is partly compensated by the other shoulder muscles. Function of Supraspinatus Muscle. The supraspinatus muscle is part of the rotator cuff – a group of muscles that move the shoulder joint. It arises from the upper part of the spine of the scapula (upper in Latin = supra; from here the name supraspinatus)."}, {"url": "http://www.livestrong.com/article/230873-what-are-the-treatments-for-a-supraspinatus-tendon/", "passage_text": "The supraspinatus tendon is part of the rotator cuff, and rotator cuff injury or inflammation is a common source of shoulder pain in many patients. The supraspinatus tendon is a thick fibrous band of tissue that connects the supraspinatus muscle to the shoulder joint. The supraspinatus muscle is attached to the shoulder blade and aids in shoulder movement"}, {"url": "http://www.healthhype.com/supraspinatus-tendon-tendinitis-tendinosis-and-tear.html", "passage_text": "Check the treatment of a torn rotator cuff. Surgical or conservative treatment of a supraspinatus tendon injury at an early stage can result in the full resolution of symptoms. However, if treatment is delayed, permanent damage to the shoulder joint may occur, with the end-result being a stiff and weak shoulder joint. Function of Supraspinatus Muscle. The supraspinatus muscle is part of the rotator cuff – a group of muscles that move the shoulder joint. It arises from the upper part of the spine of the scapula (upper in Latin = supra; from here the name supraspinatus)."}, {"url": "https://en.wikipedia.org/wiki/Rotator_cuff_tear", "passage_text": "Tears of the rotator cuff tendon are described as partial or full thickness, and full thickness with complete detachment of the tendons from bone. 1  Partial-thickness tears often appear as fraying of an intact tendon. 2  Full-thickness tears are through-and-through. The tendons of the rotator cuff, not the muscles, are most commonly involved, and of the four, the supraspinatus is most frequently affected, as it passes below the acromion. Such a tear usually occurs at its point of insertion onto the humeral head at the greater tubercle"}, {"url": "http://www.orthop.washington.edu/?q=patient-care/articles/shoulder/repair-of-rotator-cuff-tears.html", "passage_text": "Rotator cuff tears may involve the entire thickness of the tendon (full thickness rotator cuff tears) or they may be incomplete (partial thickness). Full thickness tears may involve only part of one tendon (usually the supraspinatus). They may extend to become massive involving multiple tendons as shown in the figure. "}, {"url": "https://en.wikipedia.org/wiki/Rotator_cuff_tear", "passage_text": "A rotator cuff tear is a tear of one or more of the tendons of the four rotator cuff muscles of the shoulder. The tendons of the rotator cuff, not the muscles, are most commonly involved, and of the four, the supraspinatus is most frequently affected, as it passes below the acromion. Such a tear usually occurs at its point of insertion onto the humeral head at the greater tubercle"}, {"url": "http://www.mypacs.net/cases/COMPLETE-SUPRASPINATUS-TEAR-4401116.html", "passage_text": "Findings: MRI examination reveals a full-thickness tear of the rotator cuff and supraspinatus best depicted on coronal images(posted above). There is approximately 1 cm retraction of the supraspinatus tendon with associated atrophy of the supraspinatus muscle. No fractures or osseous lesions are identified. "}]