[{"url": "http://money.usnews.com/careers/best-jobs/lawyer/salary", "passage_text": "Average Lawyer Pay vs. Other Best Jobs. Lawyers earned an average annual salary of $131,990 in 2013, which is substantially more than any other occupation on our list of Best Social Service Jobs. In 2013, paralegals earned an average annual salary of $51,170. Other jobs that also earn less than half of what lawyers make include patrol officers ($58,720), high school teachers ($58,260) and school counselors ($56,160). "}, {"url": "http://work.chron.com/salary-lawyer-based-field-law-5096.html", "passage_text": "In some cases, fees are on a contingency basis, meaning the lawyer is only paid if the client prevails. A 2007 survey by the National Association for Law Placement reported that an associate at a private law firm with eight years' experience earned a median salary of $157,000. The BLS further breaks down government salaries to reflect a mean yearly salary of $93,070 for local government lawyers, $81,960 for state government lawyers and $129,430 for lawyers employed by the federal executive branch."}, {"url": "http://www.buzzle.com/articles/types-of-lawyers-and-their-salaries.html", "passage_text": "This is the reason these lawyers are paid handsomely, if employed in huge corporations, and are considered to be the highest paid among their peers in the United States. The yearly salary of a corporate lawyer falls in range of USD 49,579 to USD 210,000, according to the website PayScale. When the earnings are calculated with bonus, profit sharing, and other benefits, they range within USD 49,761 to USD 287,250. Have a look at what their median salaries look like. According to the website, PayScale, their salary range is USD 48,366 - USD 118,644, annually. After including added earnings such as profit sharing and bonus, they may earn up to USD 145,437. The following table consists of the state-wise median salary information of family lawyers, as obtained from the website, Indeed."}, {"url": "http://work.chron.com/salary-lawyer-based-field-law-5096.html", "passage_text": "According to Above the Law, the average salary of corporate counsel is $174,000 while the Bureau of Labor Statistics reports that lawyers working as part of the management of companies and businesses earn $161,750 per year. The BLS further breaks down government salaries to reflect a mean yearly salary of $93,070 for local government lawyers, $81,960 for state government lawyers and $129,430 for lawyers employed by the federal executive branch."}, {"url": "http://www.buzzle.com/articles/types-of-lawyers-and-their-salaries.html", "passage_text": "The salary range for a family lawyer varies depending upon the level of experience, education, qualification, reputation, and the area of living. According to the website, PayScale, their salary range is USD 48,366 - USD 118,644, annually. After including added earnings such as profit sharing and bonus, they may earn up to USD 145,437. The following table consists of the state-wise median salary information of family lawyers, as obtained from the website, Indeed."}, {"url": "http://crushthelsatexam.com/lawyer-salary/", "passage_text": "Average Salary. According to PayScale, the average annual salary of a corporate lawyer in 2014 was $98,823. Corporate lawyers are paid for their knowledge and experience, both of which have a strong effect on salary. Starting Salary. In most cases, a corporate lawyer’s salary will start somewhere between $30,000 and $100,000 a year, depending on the size, location and financial condition of the employer."}, {"url": "http://work.chron.com/salary-lawyer-based-field-law-5096.html", "passage_text": "According to the Bureau of Labor Statistics, the national average salary for lawyers is $112,760 per year. However, this figure can be misleading, as salaries vary between the different fields of law. The BLS further breaks down government salaries to reflect a mean yearly salary of $93,070 for local government lawyers, $81,960 for state government lawyers and $129,430 for lawyers employed by the federal executive branch."}, {"url": "http://crushthelsatexam.com/lawyer-salary/", "passage_text": "As shown below, the median annual salary for tax attorneys in 2014 was $99,690. Starting salaries tend to be somewhere between $55,000 and $83,000; lawyers who remain in the field of tax law can expect a steady increase in their annual earnings as their career progresses. Starting Salary. In most cases, a corporate lawyer’s salary will start somewhere between $30,000 and $100,000 a year, depending on the size, location and financial condition of the employer."}]