[{"url": "http://www.statesymbolsusa.org/symbol-official-item/national-us/state-cultural-heritage/liberty-bell", "passage_text": "Liberty Bell. Tourists from all over the world come to Independence Hall in Philadelphia to see The Liberty Bell-an international symbol of freedom."}, {"url": "https://en.wikipedia.org/wiki/Liberty_Bell", "passage_text": "[T]he Liberty Bell is the most venerated object in the park, a national icon. It is not as beautiful as some other things that were in Independence Hall in those momentous days two hundred years ago, and it is irreparably damaged. Bells were rung to mark the reading of the Declaration of Independence on July 8, 1776, and while there is no contemporary account of the Liberty Bell ringing, most historians believe it was one of the bells rung. After American independence was secured, it fell into relative obscurity for some years."}, {"url": "http://www.ushistory.org/libertybell/", "passage_text": "The Liberty Bell. Tradition tells of a chime that changed the world on July 8, 1776, with the Liberty Bell ringing out from the tower of Independence Hall summoning the citizens of Philadelphia to hear the first public reading of the Declaration of Independence by Colonel John Nixon. It was, in fact, the abolitionists who gave it the name Liberty Bell, in reference to its inscription. It was previously called simply the State House bell.. In retrospect, it is a remarkably apt metaphor for a country literally cracked and freedom fissured for its black inhabitants."}, {"url": "http://www.socialstudiesforkids.com/articles/ushistory/libertybell.htm", "passage_text": "The Story of the Liberty Bell. The Liberty Bell, one of America's most treasured artifacts, first tolled on July 8, 1776, announcing a new birth of freedom throughout the land. Since then, it has endured as a symbol of the liberty that Americans enjoy under their representative form of government. On This Site. "}, {"url": "https://en.wikipedia.org/wiki/Liberty_Bell", "passage_text": "The Liberty Bell is an iconic symbol of American independence, located in Philadelphia, Pennsylvania. Formerly placed in the steeple of the Pennsylvania State House (now renamed Independence Hall), the bell today is located in the Liberty Bell Center in Independence National Historical Park. Bells were rung to mark the reading of the Declaration of Independence on July 8, 1776, and while there is no contemporary account of the Liberty Bell ringing, most historians believe it was one of the bells rung. After American independence was secured, it fell into relative obscurity for some years."}, {"url": "http://www.historicphiladelphia.org/liberty-bell-philadelphia/", "passage_text": "The Liberty Bell was cast in the Whitechapel Foundry in London and hung in the belfry of the Pennsylvania State House in 1753. That building is known today as Independence Hall. The bell cracked upon its first use before being recast twice by John Pass and John Stow, of Philadelphia. Just across from the Liberty Bell at 6th & Chestnut Streets is the Historic Philadelphia Center, home of Liberty 360 in the PECO Theater, a 3-D journey through American symbols."}, {"url": "http://www.softschools.com/facts/us_national_landmarks/liberty_bell_facts/493/", "passage_text": "Liberty Bell Facts. The original Liberty Bell was cast in 1752, in London, England. It was hung in the Pennsylvania State House, in Philadelphia, Pennsylvania, United States, which was later renamed Independence Hall. It cracked the first time it was rung and was then recast by local artisans, twice for the same reason. "}, {"url": "http://www.visitphilly.com/history/philadelphia/the-liberty-bell-center/", "passage_text": "The bell now called the Liberty Bell was cast in the Whitechapel Foundry in the East End of London and sent to the building currently known as Independence Hall, then the Pennsylvania State House, in 1753. Overview. The Liberty Bell’s home on Independence Mall is as powerful and dramatic as the bell itself. Throughout the expansive, light-filled center, larger-than-life historic documents and graphic images explore the facts and the myths surrounding the bell."}, {"url": "http://www.audioenglish.org/dictionary/liberty_bell.htm", "passage_text": "• LIBERTY BELL (noun). The noun LIBERTY BELL has 1 sense: 1. the bell of Independence Hall; rung 8 July 1776 to announce the signing of the Declaration of Independence. Familiarity information: LIBERTY BELL used as a noun is very rare."}, {"url": "http://kids.britannica.com/elementary/article-353382/Liberty-Bell", "passage_text": "In Philadelphia in 1776, the Liberty Bell rang to announce the independence of the United States from Great Britain. At that time, however, the bell was not called the Liberty Bell. People who wanted liberty, or freedom, for slaves gave the bell its name in 1839. The Liberty Bell is mostly copper and tin. It is 3 feet (91 centimeters) high and 12 feet (3.7 meters) around at the bottom."}]