[{"url": "http://www.moneycrashers.com/how-much-save-month-prioritize/", "passage_text": "For example, if earnings before all deductions are $1,500, earmark $150 for savings. 10% is the starting point for savings. If you can save more, you will attain your goals faster. Another method to determining how much to save is the budget method. "}, {"url": "http://www.howtosavemoney.com/how-much-money-should-i-save/", "passage_text": "The rule of thumb is to start out by saving 10% of your pay every month to start out. Eventually you should be able to save 20% every month. That may seem like a lot. If you make $5000 a month you will want to save anywhere between $500 and $1000. In today’s economy, this could be difficult. If this is the case, you need save what you are comfortable with while working to lower your expenses. Many financial planners recommend that you use the 50-20-30 plan."}, {"url": "http://www.getrichslowly.org/blog/2009/05/07/how-much-money-should-you-save/", "passage_text": "While I do not try to go overboard in saving too much money, I certainly have a target of saving 20% or more of my income every month. This way I’m able to enjoy the fruits of my labor as well as save for a comfortable retirement in the future. Again, with savings, you have to come to a point where you ask yourself, how much is enough. I tend to save more than the typical 3-6 months of living expenses and feel I should invest the rest but I like having the liquidity at any given moment. Great article. Thanks."}, {"url": "http://money.cnn.com/retirement/guide/basics_basics.moneymag/index7.htm", "passage_text": "Ultimate guide to retirement. As much as you can is the standard advice. Many financial planners recommend that you save 10% to 15% of your income for retirement, starting in your 20s. But that's just a general guideline. This is your retirement we're talking about, so it pays to get a little more specific by doing your homework up front."}, {"url": "http://www.getrichslowly.org/blog/2009/05/07/how-much-money-should-you-save/", "passage_text": "Plus I am trying to save around $650 each month into my savings account some of which get spent on special occasions. Together I am trying to save 33%. I am wondering if that is too much. If I should pull back a little on the savings so that I have some play money and not feel so strapped for cash. Again, with savings, you have to come to a point where you ask yourself, how much is enough. I tend to save more than the typical 3-6 months of living expenses and feel I should invest the rest but I like having the liquidity at any given moment. Great article. Thanks."}, {"url": "http://money.howstuffworks.com/personal-finance/budgeting/how-much-should-i-save-from-paycheck1.htm", "passage_text": "If you're 25, have no savings, and make $40,000 a year, you should be socking between $4,000 and $6,000 away annually. If you're 35 and make $50,000, you should be saving between $10,500 and $17,500 a year. Don't get discouraged. No matter how much your paycheck is, if you want to save money, you can. Most experts say if you're in your 20s, you should be saving at least 10 percent or more of your income, especially if you're single [source: Spiegelman ]. The earlier you start, the more time your investments have to grow [source: Lankford ]."}, {"url": "http://www.savingforcollege.com/articles/the-magic-number-for-college-savings", "passage_text": "If not, you can be sure that one of your friends will remark in a joking sort of way that paying for her college education in 18 years could put you in the poorhouse. So you ask yourself how much you really should be putting away for each month for your newborn's college education. In any set of circumstances you are better off saving something than saving nothing. For a more in-depth look at how much to save for your family s specific college needs, and to see if your state offers additional tax benefits for 529 contributions, try our College Savings Planner."}, {"url": "https://www.citizensadvice.org.uk/debt-and-money/savings/about-savings/can-i-afford-to-save-and-how-much/", "passage_text": "If you know the amount of money you need for a savings goal, you can use an online savings calculator to work out how long it will take you to save at the interest rate paid on your savings. To find a calculator, try www.guardian.co.uk/money. The amount you save will depend on how much you have to spare after you’ve worked out your budget. You can use an online calculator to help you work out how much you should save each month if you are saving up for something specific. Go to the moneysavingexpert website at: www.moneysavingexpert.com."}]