[{"url": "http://www.projectnoah.org/missions/10588529", "passage_text": "Turtles of the Southeast U.S. For spottings of the 42 turtle species in Alabama, Arkansas, Florida, Georgia, Kentucky, Louisiana, Mississippi, North Carolina, South Carolina, Tennessee, and Virginia. Sign in to join mission. NeilDazet. The Southeast has the highest diversity of turtles in the U.S. and is home to 75 percent of all native species found in the United States and Canada. Unfortunately these turtle populations are declining due to international trade demand and habitat loss."}, {"url": "http://www.outdooralabama.com/reptiles", "passage_text": "Alabama is home to 93 native reptiles, including 12 lizards, 49 snakes 31 turtles and the American alligator. In addition, four exotic lizard species have established populations in south Alabama. "}, {"url": "http://www.encyclopediaofalabama.org/article/h-1398", "passage_text": "Alabama is home to approximately 85 species of native reptiles, including turtles, lizards, snakes, and one species of crocodilian. The only species of turtle in North America that resides in brackish water—the diamondback terrapin (Malaclemys terrapin)— inhabits the coastline. The loggerhead (Caretta caretta) is the only sea turtle known to nest commonly on Alabama beaches, although four other species of marine turtles may frequent coastal Alabama."}, {"url": "http://www.archives.state.al.us/emblems/st_rept.html", "passage_text": "picture by: Robert H. Mount. The Alabama Red-Bellied Turtle, Pseudemys alabamensis, is native to Alabama. The Emydidae turtle family, of which the Alabama red-bellied turtle belongs, is the largest turtle family with over 80 species worldwide. Six genera and 13 species occur in Alabama. The Alabama red-bellied turtle was placed on the U. S. Fish and Wildlife Service's Endangered Species List in 1987. The turtle is also protected under the Nongame Species Regulation by the Alabama Department of Conservation and Natural Resources. Decline in numbers had been documented during the 1980's."}, {"url": "http://www.encyclopediaofalabama.org/article/h-1398", "passage_text": "Turtles (Order Chelonia or Testudines). Alabama has 30 species of turtles, which constitute the most ancient group of reptiles known. Lacking teeth, turtles are characterized by prominent, hard shells that encase most of their bodies, and that are connected directly to their vertebral columns (backbones). The only species of turtle in North America that resides in brackish water—the diamondback terrapin (Malaclemys terrapin)— inhabits the coastline. The loggerhead (Caretta caretta) is the only sea turtle known to nest commonly on Alabama beaches, although four other species of marine turtles may frequent coastal Alabama."}, {"url": "http://www.encyclopediaofalabama.org/article/h-1398", "passage_text": "Alabama is home to 12 native species of lizards that also occur in other southeastern states; none are endangered or restricted to Alabama. Most unusual are the three species of limbless glass lizards (Ophisaurus spp.), which superficially resemble snakes. The only species of turtle in North America that resides in brackish water—the diamondback terrapin (Malaclemys terrapin)— inhabits the coastline. The loggerhead (Caretta caretta) is the only sea turtle known to nest commonly on Alabama beaches, although four other species of marine turtles may frequent coastal Alabama."}, {"url": "https://en.wikipedia.org/wiki/Gopherus_polyphemus", "passage_text": "The gopher tortoise is a representative of the genus Gopherus, which contains the only tortoises native to North America. This species of gopher tortoise is the state reptile of Georgia and the state tortoise of Florida. The gopher tortoise (Gopherus polyphemus) is a species of the Gopherus genus native to the southeastern United States. The gopher tortoise is seen as a keystone species because it digs burrows that provide shelter for 360 other animal species. They are threatened by predation and habitat destruction"}, {"url": "https://en.wikipedia.org/wiki/List_of_reptiles_of_Alabama", "passage_text": "The U.S. state of Alabama is home to 93 indigenous reptile species, not including subspecies. Indigenous species include one species of crocodilian, 12 lizard species, 49 snake species, and 31 turtle species. Three native species have possibly been extirpated from the state."}]