[{"url": "https://itunes.apple.com/us/app/stubhub-sports-concert-theatre/id366562751?mt=8", "passage_text": "Seats you'll love. From the day they go on sale to the day of the event. Get tickets to the games, concerts and theater shows you want to see – or sell them when you can’t go – right from the StubHub app. Our FanProtect® Guarantee means we back every order, so you can buy and sell tickets with 100% confidence. FEATURES"}, {"url": "http://www.ticketmaster.com/h/print-at-home.html", "passage_text": "If you buy tickets by phone they won't appear in My Account, but printing is just as easy. After your purchase confirmation email you'll get a second email with your tickets attached-just open the attachment to print your tickets (black & white works). All done-have fun! Yes, if you bought online: 1  Click View My Tickets in your confirmation email, or go to My Account and then Orders and click the event. 2  Click the View & Print Tickets button next to your event parking and print away! ( 3 There'll be another View & Print Tickets button next to your tickets.)."}, {"url": "https://answers.yahoo.com/question/index?qid=20090603211438AAKWCbH", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: Yes, you can print the tickets off your printer and they will can them. It usually works best off a laser printer but any printer will do, all they are looking for is a bar code. Usually E-delivery when there is not enough time before the game to ship the tickets. "}, {"url": "http://chicago.cubs.mlb.com/ticketing/stubhub_faq_seller.jsp?c_id=chc", "passage_text": "StubHub is an online ticket marketplace where anyone can buy or sell any ticket to any event nationwide. StubHub is the largest ticket marketplace in the world, based on sales, and the Official Fan to Fan Ticket Marketplace of cubs.com. If you listed your tickets from the StubHub website and did not select to deliver them by Instant Download, you'll get an email when your tickets sell instructing you to return to StubHub and enter the barcodes printed on the tickets you sold."}, {"url": "http://chicago.cubs.mlb.com/ticketing/stubhub_faq_buyer.jsp?c_id=chc", "passage_text": "StubHub is not a ticket broker and doesn't own the tickets you purchase on StubHub.com. StubHub is an open marketplace where fans can gather to buy and sell tickets, and ticket prices are determined by the sellers. Sellers may be individuals, businesses, ticket brokers, corporate sponsors, promoters, fan club members, or contest winners. 1 Instant Download-If the seller made the tickets available for Instant Download, you'll get them within minutes of placing your order. 2  After you place your order, StubHub will send you an email with instructions on how to download and print your tickets."}, {"url": "http://www.wikihow.com/Print-Tickets", "passage_text": "Print the tickets. You will need to print the file containing your ticket images so that you can bring them to the event for entry. 1  Begin by opening the web page or PDF containing the image of your tickets. 2  Click on File in your application's tool bar and then click on Print.. 3  You will be prompted to print the page. "}, {"url": "https://answers.yahoo.com/question/index?qid=20120303222607AA9W6AR", "passage_text": "Best Answer: Hey there, Seth! My name is Emilee and I am writing from StubHub's Executive Customer Care Team. To download and print your tickets, you can log in to your StubHub account from any computer, and select 'Orders' under 'Going to Events'. Your tickets will remain in your StubHub account until the event starts. You can also save the ticket files to your computer, and email them to someone as an attachment. I don't have a printer for my laptop. I want to buy tickets off StubHub, but I know you can't email them or anything."}, {"url": "http://chicago.cubs.mlb.com/ticketing/stubhub_faq_seller.jsp?c_id=chc", "passage_text": "Anyone with an Cubs ticket can sell them on StubHub. If you have an Cubs account, you can list your ticket for sale right from your season ticket account. If you don't have an Cubs account, you can list your ticket for sale on the StubHub website. If you listed your tickets from the StubHub website and did not select to deliver them by Instant Download, you'll get an email when your tickets sell instructing you to return to StubHub and enter the barcodes printed on the tickets you sold."}]