[{"url": "http://www.answers.com/Q/How_much_is_tuition_for_ITT_Tech", "passage_text": "1 I'm a student at ITT Technical Institute in Duluth, GA. 2  It costs roughly $25,000 per year, but it includes tuition, books, tutoring, and your instructors' undivided attention. 3  It's a good school for an Associates Degree, but DON'T go there for a Bachelor's Degree. 4  The bachelor program is ALL online classes. Confidence votes 105. 1  I'm a student at ITT Technical Institute in Duluth, GA. 2  I was a student at ITT Tech in Tulsa, OK. and all I have to say is they are a RIP OFF! you can go elsewhere and get the same degree for a lot cheaper. 3  I was a student in Ft. Wayne Indiana."}, {"url": "http://www.collegecalc.org/colleges/maryland/itt-technical-institute-hanover/", "passage_text": "Tuition for ITT Technical Institute Hanover is $17,748 for the 2014/2015 academic year. This is 17% more expensive than the national average private for-profit four year college tuition of $15,139. The cost is $952 and 5% cheaper than the average Maryland tuition of $18,700 for 4 year colleges. At the current published rates, an estimated total tuition, fees and living expense price for a 4 year bachelor's degree at ITT Technical Institute-Hanover is $102,624 for students graduating in normal time."}, {"url": "http://www.answers.com/Q/How_much_is_tuition_for_ITT_Tech", "passage_text": "Confidence votes 105. 1  I'm a student at ITT Technical Institute in Duluth, GA. 2  It costs roughly $25,000 per year, but it includes tuition, books, tutoring, and your instructors' undivided attention. 3  It's a good school for an Associates Degree, but DON'T go there for a Bachelor's Degree. Confidence votes 105. 1  I'm a student at ITT Technical Institute in Duluth, GA. 2  I was a student at ITT Tech in Tulsa, OK. and all I have to say is they are a RIP OFF! you can go elsewhere and get the same degree for a lot cheaper. 3  I was a student in Ft. Wayne Indiana."}, {"url": "https://en.wikipedia.org/wiki/ITT_Technical_Institute", "passage_text": "ITT Technical Institute charges among the highest tuition in the industry. It also has the industry's highest rate of loans that go into default within two years of attendance. In 2014, the tuition for attending an ITT Tech campus ranged from $45,000 to $85,000. According to ITT Tech literature, credits earned at ITT Tech are unlikely to transfer to other colleges"}, {"url": "http://www.collegecalc.org/colleges/maryland/itt-technical-institute-hanover/", "passage_text": "Annual Total Cost. The annual total list price cost to go to ITT Technical Institute-Hanover was $25,656 for the 2014/2015 academic year. The cost is the same for all students regardless of Maryland residence status as there is no in-state discount. At the current published rates, an estimated total tuition, fees and living expense price for a 4 year bachelor's degree at ITT Technical Institute-Hanover is $102,624 for students graduating in normal time."}, {"url": "http://www.answers.com/Q/How_much_is_tuition_for_ITT_Tech", "passage_text": "Two year degrees at ITT cost $40,000 and four year degrees cost $80,000. Please think long and hard, and do lots of research BEFORE you even go for an interview at ITT. Their … admissions officers are like used-car salesmen, and will not let you out the door until you sign on the dotted line. Confidence votes 105. 1  I'm a student at ITT Technical Institute in Duluth, GA. 2  I was a student at ITT Tech in Tulsa, OK. and all I have to say is they are a RIP OFF! you can go elsewhere and get the same degree for a lot cheaper. 3  I was a student in Ft. Wayne Indiana."}, {"url": "https://en.wikipedia.org/wiki/ITT_Technical_Institute", "passage_text": "ITT Technical Institute (often shortened to ITT Tech or ITTTI), is a for-profit technical institute with over 130 campuses in 38 states of the United States. ITT Tech is owned and operated by ITT Educational Services, Inc. (NYSE: ESI), a publicly traded company headquartered in Carmel, Indiana. It also has the industry's highest rate of loans that go into default within two years of attendance. In 2014, the tuition for attending an ITT Tech campus ranged from $45,000 to $85,000."}, {"url": "http://www.indeed.com/forum/cmp/Itt-Technical-Institute/ITT-Tech-Is-SCAM-DON-T-DO-IT/t42772", "passage_text": "92 months ago. From a former ITT-Tech instructor (4.5 years in Houston) - the school is a scam that preys on s tupid, uneducated (and uneducable) people for the $40,000 federal student loans that they obtain. All colleges are a scam these days. It's not jut ITT Tech, it's 4 year universities too. I graduated from a great school, with a great degree, and I can't find work. All of college is a hoax"}, {"url": "http://www.collegecalc.org/colleges/maryland/itt-technical-institute-hanover/", "passage_text": "The net out-of-pocket total cost you end up paying or financing though student loans is known as the net price. The reported ITT Technical Institute-Hanover net price for in-state students $21,557* for the 2013/2014 academic year. This net price includes housing and meal expenses. At the current published rates, an estimated total tuition, fees and living expense price for a 4 year bachelor's degree at ITT Technical Institute-Hanover is $102,624 for students graduating in normal time."}, {"url": "http://programinfo.itt-tech.edu/cost.pdf", "passage_text": "The cost of any tools that a student purchases from ITT Technical Institute is due and payable by the student to ITT Technical Institute upon the student’s. receipt of those tools. The Tools cost for the associate degree in Nursing program offered in the state of Michigan is $700. All online programs of study are offered through the ITT Technical Institute location at 9511 Angola Court, Indianapolis, IN 46268 (IN AC-0148 OH Reg. No 01-12-1614T). This is an estimate of the cost, as of July 1, 2014, of the tools required for the program of study, if purchased from ITT Technical Institute."}]