[{"url": "https://support.microsoft.com/en-us/kb/281662", "passage_text": "1 You cannot cluster domain controllers for fault tolerance. 2  You can promote computers to be domain controllers, and then you can install the Cluster service on those computers, but there is no method to store Active Directory on any one of the cluster's managed drives. 3  There is no failover of Active Directory."}, {"url": "http://www.networkonline.com.my/support/index.php?/Knowledgebase/Article/View/1/1/installing-the-remote-desktop-session-host-role-service-on-a-standalone-computer-running-windows-server-2012", "passage_text": "Users can now initiate Remote Desktop Sessions to the server from any supported RDS client. This article provides the guidelines to install and configure the Remote Desktop Session Host role service on a computer running Windows Server 2012 without the Remote Desktop Connection Broker role service installed."}, {"url": "http://serverfault.com/questions/555085/which-rdp-roles-should-i-install-on-my-domain-controller-vs-the-actual-applicati", "passage_text": "A DC should be a DC and nothing else. But I know, I'm a purist. So if you must install RDS on a DC, then all you need is the RD Session Host, and RD Licensing. You can install them both together. The session host is what you need to allow 10 simultaneous connections. The RD Licensing role service will store your CALs."}, {"url": "https://support.microsoft.com/en-us/kb/2833839", "passage_text": "1 If the system needs to be configured as a Domain Controller, install the Active Directory Domain Service (AD DS) role service on the Server and promote as Domain Controller. 2  For more information on how to install AD DS in Windows Server 2012, Visit the following Microsoft Web page:"}, {"url": "https://support.microsoft.com/en-us/kb/2833839", "passage_text": "If a Domain Controller is available on a separate server, it is recommended to use the Standard Remote Desktop Services deployment wizard. This configuration is appropriate when there is only one server on the network. This server can be part of a workgroup or may be configured as a Domain Controller."}, {"url": "https://community.rackspace.com/products/f/18/t/1700", "passage_text": "Official Definition-Remote Desktop Session Host (RD Session Host) enables a server to host RemoteApp programs or session-based desktops. Users can connect to RD Session Host servers in a session collection to run programs, save files, and use resources on those servers."}, {"url": "https://support.microsoft.com/en-us/kb/2833839", "passage_text": "1 Add the users you want to allow to connect to the Remote Desktop Users group. 2  For example: Domain Users. ( 3 On DC this will be in Built in groups). 4  Configure the Remote Desktop Session Host role with to use the local Remote Desktop Licensing server."}, {"url": "http://www.networkonline.com.my/support/index.php?/Knowledgebase/Article/View/1/1/installing-the-remote-desktop-session-host-role-service-on-a-standalone-computer-running-windows-server-2012", "passage_text": "1 Add the users you want to allow to connect to the Remote Desktop Users group. 2  For example: Domain Users. ( 3 On DC this will be in Built in groups). 4  Configure the Remote Desktop Session Host role with to use the local Remote Desktop Licensing server."}, {"url": "https://support.microsoft.com/en-us/kb/2833839", "passage_text": "The deployment of a Remote Desktop Session Host role service without the Remote Desktop Connection Broker role service adds certain requirements and considerations. Unless otherwise noted, the steps apply to both Workgroup and Domain Controller cases:"}]