[{"url": "http://home.costhelper.com/window-replacement.html", "passage_text": "1 Be sure the estimate includes disposing of the old windows. 2  Replacing non-standard-sized windows requires either custom windows or enlarging the old opening to accommodate a larger standard size, which can up costs by 50-100 percent per window. 1 Larger, two-story homes with more windows can run $10,000-$20,000. 2  Double-and triple-glazed windows, or those filled with argon gas increase energy savings but bump the cost to the higher end of the scale."}, {"url": "http://home.costhelper.com/window-replacement.html", "passage_text": "1 This are called new construction windows, and can cost as much as 50-100 percent more than replacement windows, or $5,000-$40,000 for completely rebuilding all the windows in a home. 1 Larger, two-story homes with more windows can run $10,000-$20,000. 2  Double-and triple-glazed windows, or those filled with argon gas increase energy savings but bump the cost to the higher end of the scale."}, {"url": "http://replacementwindowsadvisor.com/bay-and-bow-windows-how-much-are-they/", "passage_text": "Cost of Bay and Bow Windows. Bay windows are not cheap and the average price for a basic bay window can be anywhere from $1200 to $3000 for just the window. The cost of the bay window will depend on how large the window is and the materials that are used for creating the window frame. The average cost for wood bay and bow windows is $2000 to $2600. Fiberglass is one of the newer materials that are available and the cost is a bit higher for this type of bay or bow window."}, {"url": "https://en.wikipedia.org/wiki/Replacement_Windows", "passage_text": "A replacement window is a window that is installed in an existing window opening as replacement of the existing window. Old weather beaten windows deteriorate and become loose and drafty. Replacement windows are designed for a variety of installation situations and techniques. In a full-frame installation, trim around the old window (interior and/or exterior) is removed and the old window frame is removed completely."}, {"url": "http://home.costhelper.com/window-replacement.html", "passage_text": "1 A window installer should remove the existing windows, install the new ones, cleanup and dispose of the old windows, and wash the new windows. 2  Estimates are usually based on united inches, which is equal to the sum of the length and width of each window; a 40x55-inch window is 95 united inches. 1 Larger, two-story homes with more windows can run $10,000-$20,000. 2  Double-and triple-glazed windows, or those filled with argon gas increase energy savings but bump the cost to the higher end of the scale."}, {"url": "http://homewyse.com/services/cost_to_install_replacement_windows.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Replacement Window Installation project. For a basic 1 window project in zip code 47474, the benchmark cost to Install Replacement Windows ranges between $340.04 - $593.63 per window. To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased"}, {"url": "http://clearchoice-usa.com/how_much_should_replacement_windows_cost_01/", "passage_text": "As soon as you skimp, you get what you pay for. And when companies try to hide their pricing, you often get swindled. A good vinyl replacement window should cost between $440 and $550.00, installed. There are many, many articles out there for you to read, take a look: [ How much should replacement windows cost? "}, {"url": "http://replacementwindowsadvisor.com/bay-and-bow-windows-how-much-are-they/", "passage_text": "Bow windows are great because they offer a bit more dimension and a unique look for any home. The average cost of a typical bow window is pretty much the same as bay windows or even slightly more $1400 to $3200. When choosing the material for your bay or bow windows you will find that vinyl bay and bow windows are quite affordable with the average price ranging from $1200 to $1800. The average cost for wood bay and bow windows is $2000 to $2600. Fiberglass is one of the newer materials that are available and the cost is a bit higher for this type of bay or bow window."}, {"url": "http://home.costhelper.com/window-replacement.html", "passage_text": "Additional costs: 1  A window installer should remove the existing windows, install the new ones, cleanup and dispose of the old windows, and wash the new windows. 2  Estimates are usually based on united inches, which is equal to the sum of the length and width of each window; a 40x55-inch window is 95 united inches. 1 Larger, two-story homes with more windows can run $10,000-$20,000. 2  Double-and triple-glazed windows, or those filled with argon gas increase energy savings but bump the cost to the higher end of the scale."}]