[{"url": "https://en.wikipedia.org/wiki/Baby_the_Rain_Must_Fall", "passage_text": "Baby the Rain Must Fall is a 1965 American drama film starring Lee Remick and Steve McQueen, directed by Robert Mulligan. Dramatist Horton Foote, who wrote the screenplay, based it on his play The Traveling Lady. This is Glen Campbell 's film debut, in an uncredited role."}, {"url": "http://www.nytimes.com/movie/review?res=9D07E4D91F3FE03ABC4C52DFB766838E679EDE", "passage_text": "BABY, THE RAIN MUST FALL, screenplay by Horton Foote; based on his play The Traveling Lady; directed by Robert Mulligan and produced by Alan Pakula. A Pakula-Mulligan production released by Columbia Pictures Corporation. At Loew's State Theater, 45th Street and Broadway, and other local theaters."}, {"url": "http://www.youtube.com/watch?v=GtvDq1zn4Vg", "passage_text": "Glenn Yarbrough singing Baby The Rain Must Fall-from the movie of the same name starring Steve McQueen. Glenn Yarbrough (born January 12, 1930) is an American folk singer. He was the lead singer with The Limeliters between 1959 and 1963, and had a prolific solo career, recording on various labels."}, {"url": "http://www.youtube.com/watch?v=GtvDq1zn4Vg", "passage_text": "Please try again later. Glenn Yarbrough singing Baby The Rain Must Fall-from the movie of the same name starring Steve McQueen. Glenn Yarbrough (born January 12, 1930) is an American folk singer. He was the lead singer with The Limeliters between 1959 and 1963, and had a prolific solo career, recording on various labels."}, {"url": "http://www.youtube.com/watch?v=H09g3gZ7XAs", "passage_text": "...every baby boomer honestly believes that. the average woman would rather sleep with a dead Steve McQueen. than a live Ben Affleck.. Joe Queenan in the latest GQ.  1 Baby The Rain Must Fall by Glenn Yarbrough (Google Play • iTunes • AmazonMP3). 2  Music."}, {"url": "http://www.tcm.com/tcmdb/title/67873/Baby-the-Rain-Must-Fall/articles.html", "passage_text": "With the exception of only a few scenes, Baby the Rain Must Fall was shot entirely in Horton Foote's hometown of Wharton, Texas. Foote even helped director Robert Mulligan scout the area for filming locations."}]