[{"url": "http://www.thefreedictionary.com/Thrace", "passage_text": "Thrace. n. 1. (Placename) an ancient country in the E Balkan Peninsula: successively under the Persians, Macedonians, and Romans. 2. (Placename) a region of SE Europe, corresponding to the S part of the ancient country: divided by the Maritsa River into Western Thrace (Greece) and Eastern Thrace (Turkey). A region and ancient country of the southeast Balkan Peninsula north of the Aegean Sea. In ancient times it extended as far north as the Danube River. The region was colonized by Greeks in the sixth century bc and later passed under the control of Rome, Byzantium, and Ottoman Turkey."}, {"url": "http://www.historyfiles.co.uk/KingListsEurope/GreeceThrace.htm", "passage_text": "It consisted largely of territory within the traditional boundaries of ancient Thrace, incorporating present-day Bulgaria, and at times spreading into parts of Romania, northern Greece and the European part of Turkey. Its former capital was Uscudama or Odrysia which is now the city of Edirne, in European Turkey. 513/12 - c.479 BC. Thrace south of the Danube is conquered by the Persians and held for about fifty years, possibly until they are forced out of Macedonia by Alexander I. Following their evacuation, and possibly unified to an extent under Persian occupation of the region, the Thracians form the Odrysian kingdom."}, {"url": "http://www.forumancientcoins.com/dougsmith/thrace.html", "passage_text": "Thrace (including modern Bulgaria and parts of Greece and Turkey) was a wild region to the north of Greece and Macedonia inhabited by a number of different tribes. Thrace. Ancient Greece consisted of much more than the small area that makes up the modern country. Greek civilization was spread throughout the Mediterranean by sailors and colonists. Greek language and details of Greek culture were introduced to a wide variety of native people."}, {"url": "http://www.thefreedictionary.com/Thrace", "passage_text": "Noun. 1. Thrace-an ancient country and wine producing region in the east of the Balkan Peninsula to the north of the Aegean Sea; colonized by ancient Greeks; later a Roman province; now divided between Bulgaria and Greece and Turkey. A region and ancient country of the southeast Balkan Peninsula north of the Aegean Sea. In ancient times it extended as far north as the Danube River. The region was colonized by Greeks in the sixth century bc and later passed under the control of Rome, Byzantium, and Ottoman Turkey."}, {"url": "https://simple.wikipedia.org/wiki/Thrace", "passage_text": "Thrace included areas which are now southeastern Bulgaria, northeastern Greece, and the European part of Turkey. The Thracians were an ancient Indo-European people inhabiting Central, Eastern and Southeastern Europe. "}, {"url": "http://www.thefreedictionary.com/Thrace", "passage_text": "Thrace. 1. an ancient region of varying extent in the E part of the Balkan Peninsula: later a Roman province; now in Bulgaria, Turkey, and Greece. 2. a modern region corresponding to the S part of the Roman province: now divided between Greece (Western Thrace) and Turkey (Eastern Thrace). A region and ancient country of the southeast Balkan Peninsula north of the Aegean Sea. In ancient times it extended as far north as the Danube River. The region was colonized by Greeks in the sixth century bc and later passed under the control of Rome, Byzantium, and Ottoman Turkey."}, {"url": "http://www.thefreedictionary.com/Thrace+(Greece)", "passage_text": "Noun. 1. Thrace-an ancient country and wine producing region in the east of the Balkan Peninsula to the north of the Aegean Sea; colonized by ancient Greeks; later a Roman province; now divided between Bulgaria and Greece and Turkey. Thrace. n. 1. (Placename) an ancient country in the E Balkan Peninsula: successively under the Persians, Macedonians, and Romans. 2. (Placename) a region of SE Europe, corresponding to the S part of the ancient country: divided by the Maritsa River into Western Thrace (Greece) and Eastern Thrace (Turkey)."}, {"url": "http://www.mapsofworld.com/world-ancient-history/thrace-map.html", "passage_text": "Ancient Thrace Map. Modern-day Thrace consists of the southeastern regions of Bulgaria, northwestern Greece, and the parts of Turkey that separate the Black Sea from the Sea of Marmara. Ancient Thrace was rich in gold and silver, and maintained healthy trade with Greece and other European kingdoms. Persian and Roman Annexation. In around 516 BC to 510 BC, Thrace was invaded and annexed by Persian emperors. In 360 BC, Philip II, King of Macedon, annexed Thrace as part of the Macedonian empire."}, {"url": "http://www.thefreedictionary.com/Thrace+(Greece)", "passage_text": "Thrace. A region and ancient country of the southeast Balkan Peninsula north of the Aegean Sea. In ancient times it extended as far north as the Danube River. The region was colonized by Greeks in the sixth century bc and later passed under the control of Rome, Byzantium, and Ottoman Turkey. Thrace. n. 1. (Placename) an ancient country in the E Balkan Peninsula: successively under the Persians, Macedonians, and Romans. 2. (Placename) a region of SE Europe, corresponding to the S part of the ancient country: divided by the Maritsa River into Western Thrace (Greece) and Eastern Thrace (Turkey)."}, {"url": "https://en.wikipedia.org/wiki/Thrace", "passage_text": "The areas it comprises are southeastern Bulgaria (Northern Thrace), northeastern Greece (Western Thrace), and the European part of Turkey (Eastern Thrace). The biggest part of Thrace is part of present-day Bulgaria. In Turkey, it is also called Rumeli. Thrace in ancient Greek mythology [edit]. Ancient Greek mythology provides them with a mythical ancestor, named Thrax, son of the war-god Ares, who was said to reside in Thrace. The Thracians appear in Homer 's Iliad as Trojan allies, led by Acamas and Peiros."}]