[{"url": "http://www.livestrong.com/article/27398-list-complex-carbohydrates-foods/", "passage_text": "Oatmeal, brown rice, quinoa, potatoes, beans, peas and lentils are examples of complex carbs. Simple carbs are often softer in texture – white bread, white rice and baked goods. Soda, candy and other sweeteners like table sugar and honey are also simple carbs. These easily digested carbohydrates are rapidly absorbed, causing a spike in blood sugar and quick boost in energy. Refined flours have been stripped of some of their natural, high fiber content including the bran, germ or endosperm. Wheat. Wheat Berries. Whole-Grain (breads, cereals and flours). Remember, fruits and vegetables are simple carbohydrates that contain fiber, protein, vitamins and minerals, so they are more complex in nature. These are nutrient-dense foods that should be eaten daily."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/carbs/simple-vs-complex-carbohydrates.html", "passage_text": "Simple carbohydrates include monosaccharides (one-unit sugars) and disaccharides (two-unit sugars). Monosaccharides include glucose, fructose and galactose. These can be absorbed directly and don't require further breakdown from enzymes, unlike disaccharides and polysaccharides. As a dietitian, I'm often asked to explain the difference between simple and complex carbohydrates. While most people have heard that complex carbohydrates are better for you than simple carbohydrates, what's often unclear is how the two differ, and why the differences between the two affect your health."}, {"url": "http://umm.edu/health/medical/reports/images/complex-carbohydrates", "passage_text": "Complex carbohydrates are made up of sugar molecules that are strung together in long, complex chains. Complex carbohydrates are found in foods such as peas, beans, whole grains, and vegetables. The body turns both simple and complex carbohydrates into glucose (blood sugar), but blood glucose levels rise slowly when complex carbohyrdrates are digested. Glucose is used in the cells of the body and in the brain. Any unused glucose is stored in the liver and muscles as glycogen for use later"}, {"url": "http://www.healthline.com/health/food-nutrition/simple-carbohydrates-complex-carbohydrates", "passage_text": "You may have heard that eating complex carbs is better than simple carbs. The problem is that nutrition labels don’t tell you if the carbohydrate content is simple or complex. Either way, understanding how these foods are classified and how they work in your body can help ensure you choose the right carbs. Carbohydrates are made up of three components: fiber, starch, and sugar. Fiber and starch are complex carbs, while sugar is a simple carb. Depending on how much of each of these is found in a food determines its nutrient quality."}, {"url": "http://www.popsugar.com/fitness/What-Complex-Carbs-35686730", "passage_text": "On the other hand, complex carbohydrates are fibrous and starchy and are found in foods like legumes, starchy vegetables, and whole grains. Complex carbs release glucose more slowly into the bloodstream, offering a steadier source of energy to keep blood sugar levels stable and pesky hunger pangs away. "}, {"url": "http://www.weightlossforall.com/complex-carbs.htm", "passage_text": "Excellent Sources of Complex Carbohydrates. Complex carbohydrate foods are basically those in wholegrain form such as wholegrain breads, oats, muesli and brown rice. Complex carbs are broken down into glucose more slowly than simple carbohydrates and thus provide a gradual steady stream of energy throughout the day. Natural complex carbs are often devoid of additives and preservatives unlike many processed simple carb sources. The food list below shows natural complex carbohydrate foods from grains that are frequently used to produce food products or meals."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/carbs/simple-vs-complex-carbohydrates.html", "passage_text": "Since complex carbohydrates come from plant-based foods, we know that those foods also contain a plethora of beneficial nutrients in addition to their carbs, including vitamins, minerals and antioxidants. The complex carbs are broken down into simple sugars. As a dietitian, I'm often asked to explain the difference between simple and complex carbohydrates. While most people have heard that complex carbohydrates are better for you than simple carbohydrates, what's often unclear is how the two differ, and why the differences between the two affect your health."}, {"url": "http://www.3fatchicks.com/5-foods-with-complex-carbohydrates/", "passage_text": "Complex carbohydrates are created when three or more simple sugar molecules link together in a chain. Complex carbohydrates are found mostly in plant foods. They form the starches that plants use to store energy, as well as the cellulose that forms the structure of plants. Fruits and vegetables contain vitamins, minerals, high levels of starches and other complex carbs, and may also contain fat and protein. Some fruits and vegetables high in complex carbs include: 1  Potatoes. 2  Beans. 3  Carrots. 4  Okra. 5  Zucchini. 6  Cucumber"}]