[{"url": "http://www.redspottedhanky.com/trains/train-operators/docklands-light-railway/", "passage_text": "The automated Docklands Light Railway is an innovative railway service managed by Transport for London (TfL), which connects many areas of London to the redeveloped Docklands area. The Docklands Light Railway is now part of the London fare zone system, meaning Transport for London Travelcards are valid for all journeys within the zones covered."}, {"url": "http://www.visitgreenwich.org.uk/business/dlr/", "passage_text": "The fastest way to get to Greenwich. Opened by the Queen in 1987, Docklands Light Railway (DLR) is one of the world’s most advanced automatic train control systems and one of the most exciting ways to get to Greenwich. A trip on the DLR is always an event. "}, {"url": "https://en.wikipedia.org/wiki/Docklands_Light_Railway", "passage_text": "Similar proposals have been made for the Tube. The DLR is operated under a concession awarded by Transport for London to KeolisAmey Docklands, a joint venture between transport operator Keolis and infrastructure specialists Amey plc. It was previously run for over 17 years by Serco Docklands, part of the Serco Group. The system is owned by Docklands Light Railway Ltd, part of the London Rail division of Transport for London."}, {"url": "http://www.visitlondon.com/traveller-information/getting-around-london/docklands-light-railway-network", "passage_text": "You can pay for your DLR fare with a Visitor Oyster card, Oyster card or Travelcard as well as contactless payment cards. If you pay with a Visitor Oyster card, Oyster card or contactless payment card, the fare is the same. The DLR serves Beckton, Stratford and London City Airport to the East and North East, and Docklands, Greenwich and Lewisham to the South. The DLR also connects with London's cable car, the Emirates Air Line, at Royal Victoria. The DLR runs from 5.30am-12.30am, Monday-Saturday, and from 7am-11.30pm on Sunday."}, {"url": "https://en.wikipedia.org/wiki/London_City_Airport_DLR_station", "passage_text": "London City Airport is a station on the Docklands Light Railway (DLR) serving London City Airport in east London, which is on the Woolwich Arsenal branch. It opened on 2 December 2005. "}, {"url": "http://london.wikia.com/wiki/Docklands_Light_Railway", "passage_text": "Docklands Light Railway. 8,690 pages on this wiki. The Docklands Light Railway, or DLR as it is more commonly known, is a light rail system that operates in the East End of London and other part's of East London and South London. The trains are all ran by computers which is a first for any London railway. "}, {"url": "https://www.londoncityairport.com/visitingtheairport/page/publictransport", "passage_text": "The Docklands Light Railway is an overground system connecting East London to the London Underground network. The London City Airport DLR station is connected to the airport Terminal making transport to and from the Airport fast and convenient. The Airport is located in Zone 3. Visiting the Airport. London City Airport is easy to reach by public transport, with a fast Docklands Light Railway service linking to London’s Underground and national rail stations. The July 2008 issue of Business Traveller magazine rated London City Airport as having the best public transport links in the world."}, {"url": "http://www.visitlondon.com/traveller-information/getting-around-london/docklands-light-railway-network", "passage_text": "London's innovative, driverless Docklands Light Railway (DLR) serves parts of East and South East London. The Docklands Light Railway (DLR) connects with the Tube network at Bank and Tower Gateway (Tower Hill) stations and also at Shadwell, Stratford, Bow, Heron Quays, Canning Town and Canary Wharf. The DLR serves Beckton, Stratford and London City Airport to the East and North East, and Docklands, Greenwich and Lewisham to the South. The DLR also connects with London's cable car, the Emirates Air Line, at Royal Victoria. The DLR runs from 5.30am-12.30am, Monday-Saturday, and from 7am-11.30pm on Sunday."}]