[{"url": "http://www.thefreedictionary.com/arbitrage", "passage_text": "ar·bi·trage. n. The simultaneous purchase and sale of equivalent assets or of the same asset in multiple markets in order to exploit a temporary discrepancy in prices. intr.v. ar·bi·traged, ar·bi·trag·ing, ar·bi·trag·es. To be involved in arbitrage. Verb. 1. arbitrage-practice arbitrage, as in the stock market. commerce, commercialism, mercantilism-transactions (sales and purchases) having the objective of supplying commodities (goods and services). merchandise, trade-engage in the trade of; he is merchandising telephone sets."}, {"url": "http://economictimes.indiatimes.com/definition/arbitrage", "passage_text": "Tweet. Arbitrage is the market activity of buying and selling of same security on exchanges or between spot prices of a security and its future contract. Hence arbitrage as a practice is followed to take advantage of the price disparity. Originally arbitrage occurred in the currency market, but now it applies equally in the commodity, futures and the stock market as well."}, {"url": "http://www.investopedia.com/terms/a/arbitrage.asp", "passage_text": "DEFINITION of 'Arbitrage'. The simultaneous purchase and sale of an asset in order to profit from a difference in the price. It is a trade that profits by exploiting price differences of identical or similar financial instruments, on different markets or in different forms. Arbitrage exists as a result of market inefficiencies; it provides a mechanism to ensure prices do not deviate substantially from fair value for long periods of time."}, {"url": "http://financial-dictionary.thefreedictionary.com/Arbitrage", "passage_text": "Arbitrage. Arbitrage is the technique of simultaneously buying at a lower price in one market and selling at a higher price in another market to make a profit on the spread between the prices. Arbitrage is not a long-term investment strategy but a short-term trading strategy to exploit short-term pricing inefficiencies. Arbitrage helps ensure that prices do not deviate too far from an asset's fair value for long periods."}, {"url": "http://economics.about.com/cs/finance/a/arbitrage.htm", "passage_text": "The Economics Glossary defines arbitrage opportunity as the opportunity to buy an asset at a low price then immediately selling it on a different market for a higher price.. If I can buy an asset for $5, turn around and sell it for $20 and make $15 for my trouble, that is arbitrage. The $15 I gain represents an arbitrage profit. Arbitrage profits can occur in a number of different ways."}, {"url": "http://www.investinganswers.com/financial-dictionary/world-markets/arbitrage-2171", "passage_text": "What it is: Arbitrage is the process of exploiting differences in the price of an asset by simultaneously buying and selling it. In the process the arbitrageur pockets a risk-free return. Differences in prices usually occur because of imperfect dissemination of information. "}, {"url": "http://economictimes.indiatimes.com/definition/arbitrage", "passage_text": "Definition: Arbitrage is the profit making market activity of buying and selling of same security on different exchanges or between spot prices of a security and its future contract. Here exchange refers to the stock market where shares are traded, like the NSE and BSE. Hence arbitrage as a practice is followed to take advantage of the price disparity. Originally arbitrage occurred in the currency market, but now it applies equally in the commodity, futures and the stock market as well."}, {"url": "http://www.merriam-webster.com/dictionary/arbitrage", "passage_text": "Full Definition of ARBITRAGE. 1. : the nearly simultaneous purchase and sale of securities or foreign exchange in different markets in order to profit from price discrepancies. 2. : the purchase of the stock of a takeover target especially with a view to selling it profitably to the raider. See arbitrage defined for English-language learners. business: the practice of buying something (such as foreign money, gold, etc.) in one place and selling it almost immediately in another place where it is worth more."}, {"url": "http://economics.about.com/cs/economicsglossary/g/arbitrage.htm", "passage_text": "Definition: An arbitrage opportunity is the opportunity to buy an asset at a low price then immediately selling it on a different market for a higher price. Terms related to Arbitrage Opportunity: None. "}]