[{"url": "http://chemistry.about.com/cs/5/f/blwaterintox.htm", "passage_text": "In a word, yes. Drinking too much water can lead to a condition known as water intoxication and to a related problem resulting from the dilution of sodium in the body, hyponatremia. Water intoxication is most commonly seen in infants under six months of age and sometimes in athletes. A baby can get water intoxication as a result of drinking several bottles of water a day or from drinking infant formula that has been diluted too much. Athletes can also suffer from water intoxication."}, {"url": "http://news.bbc.co.uk/2/hi/6263029.stm", "passage_text": "If you drink too much water it lowers the concentration of salt in your blood so that it is lower than the concentration of salt in cells, says Professor Robert Forrest, a consultant in clinical chemistry and forensic toxicology at the Royal Hallamshire Hospital in Sheffield. If you are going to the toilet more than once every two hours or so that might be too much, especially if your urine is clear, she says, but adds that drinking too much water is unusual. Below is a selection of your comments"}, {"url": "http://www.livestrong.com/article/550244-can-drinking-too-much-water-damage-your-lungs/", "passage_text": "Water intoxication can damage your lungs, brain, heart and other organs. The condition occurs when you drink too much water too quickly, placing stress on your kidneys. Your kidneys normally filter water and waste from your body. When you drink too much water, your kidneys cannot perform swiftly enough. Water builds up in your body, diluting the electrolytes in your blood. Electrolytes are minerals that perform important body functio"}, {"url": "http://www.answers.com/Q/Can_you_get_brain_damage_from_drinking_too_much_water", "passage_text": "When you drink too much water it may cause imbalance in water and sodium of your body, which may cause other consequences, further enquiries you should ask more to your doctor. If you drink many gallons in short time, you can die. Initial symptoms include having to urinate, and vomiting. Drinking too much water can lead to a condition known as water intoxication and to a related problem resulting from … the dilution of sodium in the body, hyponatremia. Water intoxication is most commonly seen in infants under six months of age and sometimes in athletes"}, {"url": "http://www.healthline.com/health/overhydration", "passage_text": "When too much water collects in the body, it can lead to water intoxication or dangerously low levels of sodium in the blood (hyponatremia). There are two types of overhydration: increased water intake and retaining water. 1  Increased water intake—or drinking more water than the kidneys can get rid of in the urine—can cause too much water to collect in the body. 2  When the body is unable to get rid of excess water, it is said to be retaining water. However, overhydration—or drinking too much water—is also a potentially deadly condition, one that can throw off the balance between water and sodium in your blood."}, {"url": "http://scienceline.ucsb.edu/getkey.php?key=2047", "passage_text": "Yes, you can drink too much water. It will mess with the electrolytes in your blood and make your body less likely to work properly. This is similar to when you are dehydrated which is why you drink electrolyte fluid(Gatorade, etc) to replace electrolytes lost through sweating. If you dilute the blood too much, the brain and muscles can fail, resulting in coma or heart attack and death. Several people have died from water-drinking contests. Normally this is very difficult to do: an adult usually has to drink 1-2 gallons of pure water for symptoms to occur."}, {"url": "http://scienceline.ucsb.edu/getkey.php?key=2047", "passage_text": "Answer 1: You can drink too much water, but it's difficult to do. A healthy person's kidneys usually remove excess water from the blood pretty quickly. A healthy intake for a woman is about 2.7 liters (91 ounces)per day, with about a fifth of that coming from food. If you dilute the blood too much, the brain and muscles can fail, resulting in coma or heart attack and death. Several people have died from water-drinking contests. Normally this is very difficult to do: an adult usually has to drink 1-2 gallons of pure water for symptoms to occur."}, {"url": "http://www.healthline.com/health/overhydration", "passage_text": "Most people, especially those who exercise in hot weather, are more concerned about not drinking enough water. However, overhydration—or drinking too much water—is also a potentially deadly condition, one that can throw off the balance between water and sodium in your blood. The amount of water in the body is carefully controlled by two processes: urine production in the kidneys, and the thirst response"}]