[{"url": "http://www.pbs.org/wgbh/aia/part4/4h1549.html", "passage_text": "The proclamation declared, all persons held as slaves within any States, or designated part of the State, the people whereof shall be in rebellion against the United States, shall be then, thenceforward, and forever free.The Emancipation Proclamation did not free all slaves in the United States. In September of 1862, after the Union's victory at Antietam, Lincoln issued a preliminary decree stating that, unless the rebellious states returned to the Union by January 1, freedom would be granted to slaves within those states. The decree also left room for a plan of compensated emancipation."}, {"url": "https://hsp.org/education/unit-plans/the-immediate-effects-of-the-emancipation-proclamation", "passage_text": "The Immediate Effects of the Emancipation Proclamation. The Emancipation Proclamation was an executive order issued by Abraham Lincoln on January 1, 1863. It proclaimed the freedom of slaves in the ten Confederate states still in rebellion. Because the Emancipation Proclamation made the abolition of slavery into a Union goal, it linked support for the Confederacy to support for slavery. As Lincoln hoped, the Proclamation swung foreign popular opinion in favor of the Union by gaining the support of European countries that had already outlawed slaver."}, {"url": "http://www.historynet.com/emancipation-proclamation", "passage_text": "On September 22, 1862, Lincoln signed the preliminary Emancipation Proclamation, which informed both the Confederacy and the Union of his intention to free all persons held as slaves in the rebellious states. Emancipation Proclamation summary: The Emancipation Proclamation was issued by President Abraham Lincoln on January 1, 1863, as the country entered the third year of the Civil War."}, {"url": "http://www.buzzle.com/articles/purpose-and-effects-of-the-emancipation-proclamation.html", "passage_text": "The Emancipation Proclamation denounced slavery, and used the emancipation of slaves as the point of contention to bring the Civil War to an end. President Abraham Lincoln, issued executive orders to control rebellious southern states, and to bring them back into the Union. Abraham Lincoln, the 16th President of the United States, is remembered for the role he played in the emancipation of slaves. Lincoln issued the Emancipation Proclamation on September 22, 1862. According to the proclamation,"}, {"url": "http://www.civilwar.org/education/history/emancipation-150/10-facts.html", "passage_text": "Fact #1: Lincoln actually issued the Emancipation Proclamation twice. Abraham Lincoln issued the preliminary Emancipation Proclamation on September 22nd, 1862. It stipulated that if the Southern states did not cease their rebellion by January 1st, 1863, then Proclamation would go into effect. When the Confederacy did not yield, Lincoln issued the final Emancipation Proclamation on January 1st, 1863. Fact #2: The Emancipation Proclamation only applied to the states in rebellion. President Lincoln justified the Emancipation Proclamation as a war measure intended to cripple the Confederacy"}, {"url": "http://www.buzzle.com/articles/purpose-and-effects-of-the-emancipation-proclamation.html", "passage_text": "As the Confederate states did not end the war, Abraham Lincoln signed the Preliminary Emancipation Proclamation, and turned a war, fought for the preservation of Union, into a war that was aimed at ending slavery. Abraham Lincoln, the 16th President of the United States, is remembered for the role he played in the emancipation of slaves. Lincoln issued the Emancipation Proclamation on September 22, 1862. According to the proclamation,"}, {"url": "https://hsp.org/education/unit-plans/the-immediate-effects-of-the-emancipation-proclamation", "passage_text": "The Proclamation also prevented European forces from intervening in the war on behalf of the Confederacy. Because the Emancipation Proclamation made the abolition of slavery into a Union goal, it linked support for the Confederacy to support for slavery. As Lincoln hoped, the Proclamation swung foreign popular opinion in favor of the Union by gaining the support of European countries that had already outlawed slaver."}, {"url": "https://en.wikipedia.org/wiki/Emancipation_Proclamation", "passage_text": "On September 22, 1862, Lincoln had issued a preliminary proclamation warning that he would order the emancipation of all slaves in any state that did not end its rebellion against the Union by January 1, 1863. The Proclamation applied in the ten states that were still in rebellion in 1863, and thus did not cover the nearly 500,000 slaves in the slave-holding border states (Missouri, Kentucky, Maryland or Delaware) which were Union states."}]