[{"url": "http://thisoldearth.net/Sedimentary-Rocks-chemical.html", "passage_text": "Chemical and Biochemical Sedimentary Rocks. Chemical sedimentary rock is formed when minerals, dissolved in water, begin to precipitate out of solution and deposit at the base of the water body. "}, {"url": "http://geologyclass.org/sedimentary_concepts.htm", "passage_text": "1) Clastic (or detrital) sedimentary rocks-Form from the cementation of sediment grains that come from pre-existing rocks. This is the most common sedimentary rock type. Clastic sedimentary rocks are classified by grain size, and to a lesser extent by chemical composition. 2) Chemical (and biochemical) sedimentary rocks-Chemical sedimentary rocks form by the precipitation of minerals from water (this process may or may not involve the actions of organisms). In contrast to the clastic textures of the rocks discussed above, chemical sedimentary rocks have crystalline textures"}, {"url": "https://en.wikipedia.org/wiki/Sedimentary_rock", "passage_text": "Sedimentary rocks are types of rock that are formed by the deposition of material at the Earth 's surface and within bodies of water. The sedimentary rock cover of the continents of the Earth's crust is extensive, but the total contribution of sedimentary rocks is estimated to be only 8% of the total volume of the crust. Sedimentary rocks are only a thin veneer over a crust consisting mainly of igneous and metamorphic rocks."}, {"url": "http://geology.com/rocks/sedimentary-rocks.shtml", "passage_text": "Sedimentary rocks are formed by the accumulation of sediments. There are three basic types of sedimentary rocks. Clastic sedimentary rocks such as breccia, conglomerate, sandstone, siltstone, and shale are formed from mechanical weathering debris. Picture Gallery of the Most Common Rock Types. Breccia is a clastic sedimentary rock that is composed of large (over two millimeter diameter) angular fragments. The spaces between the large fragments can be filled with a matrix of smaller particles or a mineral cement which binds the rock together."}, {"url": "http://homepage.smc.edu/grippo_alessandro/rockssedimentary.html", "passage_text": "Clastic sedimentary rocks form when individual grains (the sediment), made by fragments of rocks, minerals, or shells, are cemented together (the clastic sediemntary rock). These are the only type of rock that is NOT made simply of crystals, but rather fragments of other materials, broken and then reassembled together. Biochemical sedimentary rocks are formed mostly by the remains (whole or broken) of organisms. These remains can be of different kind and include, but are not limited to, for instance, shells, reefs and corals, structures like echinoids' stems, plant fragments, carbon, and many more."}, {"url": "http://faculty.chemeketa.edu/afrank1/rocks/sedimentary/id1.htm", "passage_text": "The first step involves determining what type of sedimentary rock you have. There are three basic types, clastic, biochemical, and chemical. Examples of each are shown below. Clastic Your rock is made of bits and pieces of another rock. Those pieces may be fairly large to where you can see them with the unaided eye, or they may be very small and you cannot readily see them. "}, {"url": "http://geology.com/rocks/sedimentary-rocks.shtml", "passage_text": "Organic sedimentary rocks such as coal, some dolomites, and some limestones, form from the accumulation of plant or animal debris. Photos and brief descriptions of some common sedimentary rock types are shown on this page. Coal is an organic sedimentary rock that forms mainly from plant debris. Picture Gallery of the Most Common Rock Types. Breccia is a clastic sedimentary rock that is composed of large (over two millimeter diameter) angular fragments. The spaces between the large fragments can be filled with a matrix of smaller particles or a mineral cement which binds the rock together."}, {"url": "http://homepage.smc.edu/grippo_alessandro/rockssedimentary.html", "passage_text": "Sedimentary rocks form from sediment. Sediment is a general term that indicates loose grains (such as the sand at the beach) and chemical precipitates (such as crystals of salt). Sedimentary rocks can be subdivided in three categories: clastic, chemical, and biochemical sedimentary rocks. Biochemical sedimentary rocks are formed mostly by the remains (whole or broken) of organisms. These remains can be of different kind and include, but are not limited to, for instance, shells, reefs and corals, structures like echinoids' stems, plant fragments, carbon, and many more."}, {"url": "http://www.arch.dcr.state.nc.us/ncarch/GeoArcheo/SedimentaryA.htm", "passage_text": "A sedimentary rock is an accumulation of fragments of pre-existing rocks (sediments). There are three types of sedimentary rocks; Clastic (detrital), Chemical, and Biochemical (organic) rocks. "}]