[{"url": "http://ndnuargos.com/", "passage_text": "BELMONT, Calif. – The Notre Dame de Namur women's soccer team returned home and suffered a tough 2-1 loss to Dominican as the Penguins scored twice in the final 15 minutes. The Argonauts led after a goal early in the second ... NDNU Men’s Cross Country Finishes 16th at SF State Invitational. BELMONT, Calif. – The Notre Dame de Namur men's cross country team placed 16 th at the SF State Invitational on Friday afternoon, their final tune up before the Pacific West Conference Championships."}, {"url": "http://www.ndnuargos.com/index.aspx?path=softball&", "passage_text": "Belmont, Calif. – The Notre Dame de Namur softball team earned a very important sweep, downing BYU Hawaii 7-0 and 7-6 to improve to 16-12 in Pacific West play. Belmont, Calif. – The Notre Dame de Namur softball team belted three homeruns in the first game of a doubleheader with Dominican, earning a split with the Penguins. The Argonauts used a pair of six run innings in the opening ... [Full Story]."}, {"url": "https://en.wikipedia.org/wiki/Notre_Dame_de_Namur_University", "passage_text": "The university is organized into three schools: College of Arts and Sciences, School of Business and Management and School of Education and Leadership. Notre Dame de Namur University offers 22 undergraduate degrees, 12 graduate degrees and four credentials. In 1953 the College of Notre Dame became a four year college with 23 Sisters of Notre Dame de Namur involved in the school. The college introduced evening classes in 1955, and in 1965, started the teaching credential programs."}, {"url": "https://en.wikipedia.org/wiki/Notre_Dame_de_Namur_University", "passage_text": "History [edit]. Notre Dame de Namur University was founded by the Sisters of Notre Dame de Namur as College of Notre Dame in 1851 on 10 acres in San Jose, California. The college was chartered in 1868 as the first college in the state of California authorized to grant the baccalaureate degree to women. In 1953 the College of Notre Dame became a four year college with 23 Sisters of Notre Dame de Namur involved in the school. The college introduced evening classes in 1955, and in 1965, started the teaching credential programs."}, {"url": "http://ndnuargos.com/", "passage_text": "BELMONT, Calif. – In their final race before the Pacific West Championships the Notre Dame de Namur women's cross country team turned in a strong performance at the San Francisco State Invitational. NDNU Men’s Cross Country Finishes 16th at SF State Invitational. BELMONT, Calif. – The Notre Dame de Namur men's cross country team placed 16 th at the SF State Invitational on Friday afternoon, their final tune up before the Pacific West Conference Championships."}, {"url": "http://ndnuargos.com/", "passage_text": "BELMONT, Calif. – The Notre Dame de Namur volleyball team got back to their winning ways, defeating Holy Names in four games. The Argonauts moved to 3-4 in PacWest play on the season, eclipsing their conference win total from ... NDNU Men’s Cross Country Finishes 16th at SF State Invitational. BELMONT, Calif. – The Notre Dame de Namur men's cross country team placed 16 th at the SF State Invitational on Friday afternoon, their final tune up before the Pacific West Conference Championships."}, {"url": "http://recsports.nd.edu/club-sports/womens-club-sports/", "passage_text": "Lacrosse. Women's Club Lacrosse is a new competitive club team for Notre Dame women who wish to continue playing lacrosse in college. The Club competes in the Central Division of the WCLL against other universities and colleges in Illinois, Indiana, Ohio, and Michigan. Pom Squad. The Notre Dame Pom Squad is a non-competitive athletic club composed of eleven students of the University of Notre Dame and St. Mary’s College who perform during football pep rallies, men’s home basketball games, and select soccer and women’s basketball games, and other campus events."}, {"url": "http://www.ndnuargos.com/index.aspx?path=softball&", "passage_text": "Belmont, Calif. – The Notre Dame de Namur softball team scored 11 unanswered runs in the first game to cap off a comeback victory and earn a split with Hawaii Pacific. The Argonauts took the first game 12-5 before falling 7-5 ... [Full Story]. Belmont, Calif. – The Notre Dame de Namur softball team belted three homeruns in the first game of a doubleheader with Dominican, earning a split with the Penguins. The Argonauts used a pair of six run innings in the opening ... [Full Story]."}, {"url": "https://en.wikipedia.org/wiki/Notre_Dame_Stadium", "passage_text": "The Notre Dame Stadium is an outdoor football stadium in Notre Dame, Indiana, the home field of the University of Notre Dame Fighting Irish. It is located on the university's campus, just north of South Bend. The first Notre Dame touchdown in the stadium was scored by Jumping Joe Savoldi on a 98-yard kickoff return. The official dedication was a week later on October 11 against Navy, and Savoldi scored three touchdowns and was cited as the first hero in the lore of Notre Dame Stadium.."}]