[{"url": "http://www.answers.com/Q/What_is_the_difference_between_an_electrical_3-phase_delta_connection_and_a_star_connection", "passage_text": "With a wye connection (also called a star connection) take our triangle above and use your wire cutters (literally) to cut the triangle apart at the corners. rearrange the three sides (transformer or motor windings) to form a Y. Where the three sides join in the center, connect a fourth wire. Call this wire neutral. The neutral is grounded at the service entrance. Wye systems must be used where you have single phase loads that you must feed. Interestingly, if you hide the neutral, you really can't tell the difference between star and delta systems. The phase-to-phase voltage is exactly the same."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_Y_or_Wye_and_Delta_3_phase_power", "passage_text": "The main difference between star and delta is that in star, the phase voltage is root 3 multiplied by the line voltage making the speed of the machine to run at low speed whil … e in delta, the phase voltage is equal to the line voltage making the machine to run at high speed. The delta connection provides three line conductors, whereas the star connection provides three line conductors plus a neutral conductor. To obtain a single-phase supply, the load is connected either between any two line conductors, or between a line conductor and a neutral conductor."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_Y_or_Wye_and_Delta_3_phase_power", "passage_text": "The transformer connection. Transformers can be connected in Wye (One side of each winding connected to the phase wire and the other connected to neutral or ground) or Delta (the polarity of each winding connected to the nonpolarity of another winding to form a triangle). The delta connection provides three line conductors, whereas the star connection provides three line conductors plus a neutral conductor. To obtain a single-phase supply, the load is connected either between any two line conductors, or between a line conductor and a neutral conductor."}, {"url": "http://forums.mikeholt.com/showthread.php?t=84841", "passage_text": "There is 120v from any phase to ground (neutral) with each winding at 120v, but 208v (120 x 1.73) between phases. The 480/277v Y system is connected the same way: 480v line-to-line and 277v line-to-ground. Now, back to our as-of-yet ungrounded Delta system for a moment. There are two ways of grounding a Delta system. "}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_Y_or_Wye_and_Delta_3_phase_power", "passage_text": "In wye-connected systems, the line voltage (line-to-line) is 1.732 times larger than the phase voltage (line-to-neutral). In a delta-connected system the line voltage is exactly the same as the phase voltage (line-to-line in both cases). The delta connection provides three line conductors, whereas the star connection provides three line conductors plus a neutral conductor. To obtain a single-phase supply, the load is connected either between any two line conductors, or between a line conductor and a neutral conductor."}, {"url": "http://www.ecmag.com/section/your-business/wye-does-it-matter", "passage_text": "A significant difference between a delta and wye circuit is relative to the current flow. Looking at a typical wye connected load, the current flowing down a phase conductor flows through one leg or element of the load into the center conductor or neutral and back to the source. This holds for each of the three phases. Poly-phase circuits are often three-phase circuits in most industrial and commercial electrical distribution systems with wye and delta the most common. Loads in a wye circuits can be connected line-to-neutral as well as line-to-line, which can make the phase power flow calculations a bit confusing."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_an_electrical_3-phase_delta_connection_and_a_star_connection", "passage_text": "In a wye system, the supply service line-to-line voltage is 1.73 times the voltage from any phase to neutral. Delta power is used for motors, 3-phase heaters, anywhere you don't need a neutral. The biggest use of delta is in power transmission. The neutral is grounded at the service entrance. Wye systems must be used where you have single phase loads that you must feed. Interestingly, if you hide the neutral, you really can't tell the difference between star and delta systems. The phase-to-phase voltage is exactly the same."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_Y_or_Wye_and_Delta_3_phase_power", "passage_text": "A wye connection is generally a four-wire system, comprising three line conductors and a neutral conductor, whereas a delta connection is a three-wire system, comprising three line conductors. For a perfectly-balanced load (e.g. a three-phase motor), a wye-connected system can dispense with the neutral conductor. The delta connection provides three line conductors, whereas the star connection provides three line conductors plus a neutral conductor. To obtain a single-phase supply, the load is connected either between any two line conductors, or between a line conductor and a neutral conductor."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_an_electrical_3-phase_delta_connection_and_a_star_connection", "passage_text": "The main difference between star and delta is that in star, the phase voltage is root 3 multiplied by the line voltage making the speed of the machine to run at low speed whil … e in delta, the phase voltage is equal to the line voltage making the machine to run at high speed. The neutral is grounded at the service entrance. Wye systems must be used where you have single phase loads that you must feed. Interestingly, if you hide the neutral, you really can't tell the difference between star and delta systems. The phase-to-phase voltage is exactly the same."}]