[{"url": "http://genealogy.about.com/od/surname_meaning/p/smith.htm", "passage_text": "Smith still tops the list of most popular surnames in England and America, and is also a very common last name in Germany, Ireland, Scotland, Canada and Australia. Surname Origin: English. Alternate Surname Spellings: SMYTH, SMYTHE, SCHMIDT. Smith Name Meaning & Family History. An overview of the Smith surname meaning, plus subscription-based access to genealogical records on Smith families around the world from Ancestry.com."}, {"url": "https://en.wikipedia.org/wiki/Smith_(surname)", "passage_text": "Smith is a family name (surname) originating in England. It is the most prevalent surname in the United Kingdom, Australia and the United States, the second most common surname in Canada, and the fifth most common surname in Ireland. For example: 1  It is common for people in English-speaking countries to adopt the surname Smith in order to maintain a secret identity, when they wish to avoid being found. 2  Smith is an extremely common name among English Gypsies; see also John Smith."}, {"url": "http://www.behindthename.com/name/smith", "passage_text": "Meaning & History. From an English surname meaning metal worker, blacksmith, derived from Old English smitan to smite, to hit. It is the most common surname in most of the English-speaking world. "}, {"url": "http://www.answers.com/Q/What_does_smith_mean", "passage_text": "Smith is the most common family name (surname) in the United Kingdom and the United States,[1] representing more than 1 out of every 100 persons in each of these countries. [edit] Comparative note Although Smith is the most common surname in the English-speaking world, it is held by fewer than five-million people worldwide. It is, therefore, dwarfed by the most common surname-Li-which is held by over one hundred and eight million people."}, {"url": "http://www.ourbabynamer.com/meaning-of-Smith.html", "passage_text": "English names generally consist of a given name, middle name and family name. Many English speaking countries have fairly flexible naming laws. This allows the multicultural families that live in these countries to merge the naming conventions of their faiths or previous nationalities with their current homeland. View the Smith Name Popularity Page to see how the popularity trend for Smith has changed since 1880, or to compare the popularity of Smith to other names."}, {"url": "http://www.sheknows.com/baby-names/name/smith", "passage_text": "English Meaning: The name Smith is an English baby name. In English the meaning of the name Smith is: Tradesman. American Meaning: The name Smith is an American baby name. In American the meaning of the name Smith is: Tradesman. Shakespearean Meaning: The name Smith is a Shakespearean baby name."}, {"url": "http://genealogy.about.com/od/surname_meaning/p/smith.htm", "passage_text": "Derived from the Anglo-Saxon smitan, meaning to smite or strike, SMITH and its derivations are an occupational name for a man who works with metal (smith or blacksmith), one of the earliest jobs for which specialist skills were required. Smith Name Meaning & Family History. An overview of the Smith surname meaning, plus subscription-based access to genealogical records on Smith families around the world from Ancestry.com."}, {"url": "http://www.ourbabynamer.com/meaning-of-Smith.html", "passage_text": "Smith is generally used as a boy's name. It consists of 5 letters and 1 syllable and is pronounced Smith. In the U.S. in 2014, it ranked 1285 in baby name popularity for boys with 137 occurrences. It ranked 16129 in popular baby names for girls with 6 occurrences. View the Smith Name Popularity Page to see how the popularity trend for Smith has changed since 1880, or to compare the popularity of Smith to other names."}, {"url": "http://www.babynamespedia.com/meaning/Smith", "passage_text": "[ 1 syll. smit (h), sm-i- th ] The baby boy name Smith is pronounced as SMih-TH †. Smith is used mostly in English and its language of origin is also English. The name Smith means craftsman. Smith has 20 derivatives. Derivatives of Smith include Schmidt, Smedt, Smid, Smidt, Smit, Smithe, Smithey, Smithi, Smithie, Smithy, Smitt, Smittea, Smittee, Smittey, Smitth, Smitti, Smittie, Smyth, and Smythe. Another English derivative is the diminutive Smitty. Smith is uncommon as a baby boy name. In 1900, 0.016% of baby boys were named Smith."}, {"url": "http://www.thinkbabynames.com/meaning/1/Smith", "passage_text": "Smith /smith/ [1 syll.] as a boys' name is of Old English origin, and the meaning of Smith is blacksmith. Occupational name. and surname. Economist Adam Smith; Mormon leader Joseph Smith; Smithsonian founder James Smithson. "}]