[{"url": "http://www.bpac.org.nz/BPJ/2011/august/gout.aspx", "passage_text": "As with allopurinol treatment, the dose should be slowly increased. The recommended dose of probenecid is 250 mg, twice daily, for the first week, increasing to 500 mg, twice daily, for the second week and then increasing by 500 mg in subsequent months to a maximum of 2000 mg, daily in divided doses. For people who are intolerant to allopurinol give probenecid 250 mg, twice daily for one week, increasing to 500 mg, twice daily. Dose can be increased by 500 mg per month to a maximum of 2000 mg daily in divided doses. Increase fluid intake to prevent renal stone formation."}, {"url": "http://www.saferx.co.nz/allopurinol.pdf", "passage_text": "‘Start low and go slow’. The recommended starting dose is 100mg daily or lower (50mg daily) in stage 4 or worse chronic kidney disease. If allopurinol is well tolerated, the dose may be increased until the target serum urate is reached. The maximum recommended dose is 900mg daily; 300mg per day is not usually sufficient.Sudden changes in serum urate levels are likely to precipitate gout attacks. To reduce the risk of an acute attack, increase the daily dose gradually (by 50-100mg) at monthly intervals and prescribe in combination with a prophylactic dose of colchicine* (eg 0.5mg daily or twice daily), or low-dose NSAID (eg naproxen 250mg twice daily), for 3-6 months after achieving target serum urate."}, {"url": "http://www.rxlist.com/zyloprim-drug/indications-dosage.htm", "passage_text": "The dose of ZYLOPRIM (allopurinol) recommended for management of recurrent calcium oxalate stones in hyperuricosuric patients is 200 to 300 mg/day in divided doses or as the single equivalent. The dosage of ZYLOPRIM (allopurinol) to accomplish full control of gout and to lower serum uric acid to normal or near-normal levels varies with the severity of the disease. The average is 200 to 300 mg/day for patients with mild gout and 400 to 600 mg/day for those with moderately severe tophaceous gou"}, {"url": "http://arthritis.emedtv.com/allopurinol/allopurinol-dosage.html", "passage_text": "As is always the case, do not adjust your dose unless your healthcare provider specifically instructs you to do so. To help avoid a flare-up of gout attacks (which can occur when starting allopurinol), it is recommended to start at a low dosage for treating gout: allopurinol 100 mg once daily. Doses of 300 mg or less can be taken as a single daily dose, but higher doses should be split up into a few (usually two or three) smaller doses per day. Allopurinol Medication Information."}, {"url": "http://www.rxwiki.com/allopurinol", "passage_text": "Your doctor will likely start you on a low dose and gradually increase the dose to avoid a flare-up of gout attacks which may occur when starting allopurinol. The recommended starting dose is 100 mg daily. The allopurinol dose is then increased by 100 mg each week based on the uric acid level in your blood. 1  The maximum recommended dose is 800 mg."}, {"url": "http://www.bpac.org.nz/BPJ/2011/august/gout.aspx", "passage_text": "For patients with renal impairment, where the eGFR is less than 30 mL/min/1.73 m 2, it is recommended that the starting dose of allopurinol is reduced to 50 mg per day, or every second day, and then increased by 50 mg every month as guided by the serum urate levels and tolerance. For people who are intolerant to allopurinol give probenecid 250 mg, twice daily for one week, increasing to 500 mg, twice daily. Dose can be increased by 500 mg per month to a maximum of 2000 mg daily in divided doses. Increase fluid intake to prevent renal stone formation."}, {"url": "http://www.rxwiki.com/allopurinol", "passage_text": "To prevent calcium oxalate kidney stones in adults is 200 mg or 300 mg per day, taken as a single dose or as a few (two or three) smaller doses throughout the day. For children with cancer, ages 6 to 10, the recommended daily dose is 300 mg. Children under 6 years of age are usually given 150 mg allopurinol daily. 1  The recommended daily dose of Aloprim for adults is 200 to 400 mg/m /day. 2  The maximum daily dose is 600 mg. 3  The recommended starting daily dose of Aloprim for children is 200 mg/m /day. The recommended starting dose is 100 mg daily. The allopurinol dose is then increased by 100 mg each week based on the uric acid level in your blood. 1  The maximum recommended dose is 800 mg."}, {"url": "http://www.rxlist.com/zyloprim-drug/indications-dosage.htm", "passage_text": "To reduce the possibility of flare-up of acute gouty attacks, it is recommended that the patient start with a low dose of ZYLOPRIM (allopurinol) (100 mg daily) and increase at weekly intervals by 100 mg until a serum uric acid level of 6 mg/dL or less is attained but without exceeding the maximal recommended dosage. The dosage of ZYLOPRIM (allopurinol) to accomplish full control of gout and to lower serum uric acid to normal or near-normal levels varies with the severity of the disease. The average is 200 to 300 mg/day for patients with mild gout and 400 to 600 mg/day for those with moderately severe tophaceous gout"}, {"url": "http://arthritis.emedtv.com/allopurinol/allopurinol-dosage.html", "passage_text": "Also, allopurinol can initially cause gout attacks. Doses of 300 mg or less can be taken as a single daily dose, but higher doses should be split up into a few (usually two or three) smaller doses per day. Allopurinol Medication Information."}]