[{"url": "http://www.littlefieldranch.com/template/img/SteakCookingGuide.pdf", "passage_text": "Internal Temp 140 F, 60 o C Medium Rare Approx. Internal Temp 145 o F, 63 o C Medium Approx. Internal Temp 160 o F, 71 o C o Medium Well Approx. Internal Temp 170 F, 77 o C Well Done Approx. Internal Temp 180 F, 82 o C Before cooking your steaks, you should bring a thawed steak to room temperature.  Suggested cooking times for steaks 1.25 - 1.5 thick (total cooking time):  Very Rare 4-5 minutes  Rare 5-6 minutes  Medium Rare 6-8 minutes  Medium 7-10 minutes  Well Done Not Recommended Porterhouse Steak  This extra heavy cut is a combination of a Fillet Mignon and a juicy New York Strip."}, {"url": "http://www.littlefieldranch.com/template/img/SteakCookingGuide.pdf", "passage_text": " Suggested cooking times for steaks 1.25 thick  Very Rare 6-8 minutes  Rare 8-9 minutes  Medium Rare 9-12 minutes  Medium 12-15 minutes  Well Done Not Recommended. T-Bone Steaks T-Bone Steak  This generous cut is a slightly smaller version of the Porterhouse.  Suggested cooking times for steaks 1.25 - 1.5 thick (total cooking time):  Very Rare 4-5 minutes  Rare 5-6 minutes  Medium Rare 6-8 minutes  Medium 7-10 minutes  Well Done Not Recommended Porterhouse Steak  This extra heavy cut is a combination of a Fillet Mignon and a juicy New York Strip."}, {"url": "http://culinaryarts.about.com/od/beefporkothermeats/a/Well-Done-Steak.htm", "passage_text": "You could try to cook the steak medium-well, which is one notch less done than well-done, and hope they can't tell the difference. A medium-well steak is cooked to an interior temperature of around 150° to 155°F. The interior will be mostly gray but with just a faint streak of pink at the very center. If you dim the lights when you serve it, they might not notice. Even if you could get away with it, though, this is still a waste of a good steak."}, {"url": "https://www.heb.com/recipe/recipe-article/grill-times-temperatures-for-steak/1392677044707", "passage_text": "Medium: Grill 10 minutes per side or to 155°F internal temperature. Check Internal Temperature. Remove steaks from the grill when a quick-response meat thermometer inserted through the side of the steak to its center reads the desired temperature below. To retain juices and reach final temperature, let steaks sit for 2 minutes before cutting"}, {"url": "http://www.ehow.com/facts_7445190_temperature-steaks.html", "passage_text": "Well cooked refers not only to a perfectly grilled T-bone but also to a desired internal temperature of steak. Medium-well indicates a steak cooked until all the pink is gone, which is achieved by reaching a temperature of 150 to 155 degrees. Well Done. Well cooked refers not only to a perfectly grilled T-bone but also to a desired internal temperature of steak. Medium-well indicates a steak cooked until all the pink is gone, which is achieved by reaching a temperature of 150 to 155 degrees. Anything cooked over a temperature of 160 is considered well done."}, {"url": "http://www.foodnetwork.com/recipes/bobby-flay/perfectly-grilled-steak-recipe.html/", "passage_text": "Turn the steaks over and continue to grill 3 to 5 minutes for medium-rare (an internal temperature of 135 degrees F), 5 to 7 minutes for medium (140 degrees F) or 8 to 10 minutes for medium-well (150 degrees F). "}, {"url": "http://www.askthemeatman.com/steaks_med_rare_updated_9300.htm", "passage_text": "So, if you want your steak medium rare, take it out of the oven, or off the grill or skillet when its' internal temperature is 140 degrees. Don't forget this or your meat may well be more done than you wanted!Allow it to stand for 10 minutes, and dig in! The steak should be ideally cooked for medium rare then at 145 ! "}, {"url": "https://en.wikipedia.org/wiki/Temperature_(meat)", "passage_text": "Temperature is a gauge of how thoroughly cooked a cut of meat is based on the color, juiciness and internal temperature when cooked. The gradations of cooking are most often used in reference to beef (especially steak and roasts) but are also applicable to lamb, pork, poultry, veal and seafood (especially fish). The whole meat and the center will also continue to cook slightly as the hot exterior continues to warm the comparatively cooler interior. The exception is if the meat has been prepared in a sous-vide process, as it will already be at temperature equilibrium."}, {"url": "http://bbq.about.com/od/steaks/ss/aa101606a.htm", "passage_text": "Internal Temperature 155 to 165 degrees F. (68 to 74 degrees C.). A medium well steak should have a hint of pink in the very middle of the steak. The surface should be a dark brown with good charring on the top and bottom. This steak will be very stiff but still have a little squish in the center. This is the steak for the squeamish who don't want color in their meat. A Well Done steak is the hardest to cook. The secret is to do it low and slow. It's the only way to prevent burning while fully cooking it through the middle. Grill this steak over a medium heat between 10 and 12 minutes per side."}, {"url": "http://southernfood.about.com/od/foodsafety/fl/Meat-and-Poultry-Temperature-Chart.htm", "passage_text": "Marinated Grilled Steak. The proper temperature to cook a medium-rare steak is 130° - 135° F. Although, according to foodsafety.gov, beef, lamb, and pork should be cooked to at least 145° (or above, if desired). Ground meat must be cooked to at least 160° F. Ground poultry must be cooked to at least 165°. "}]