[{"url": "http://www.rxlist.com/cialis-drug/indications-dosage.htm", "passage_text": "1 The dose may be increased to 20 mg or decreased to 5 mg, based on individual efficacy and tolerability. 2  The maximum recommended dosing frequency is once per day in most patients. 3  CIALIS for use as needed was shown to improve erectile function compared to placebo up to 36 hours following dosing."}, {"url": "http://www.rxlist.com/cialis-tadalafil/drug.htm", "passage_text": "Erectile Dysfunction (used as needed). 1  For most patients the recommended starting dose is 10 mg as needed prior to anticipated sexual activity. 2  The dose may be increased to 20 mg or decreased to 5 mg based on efficacy or tolerability. 3  The maximum dosing frequency is once daily for most patients."}, {"url": "http://erectile-dysfunction.emedtv.com/cialis/cialis-dosage.html", "passage_text": "For most people with ED, the recommended starting dose of Cialis is 10 mg, taken one hour prior to sexual activity."}, {"url": "http://www.rxlist.com/cialis-drug/indications-dosage.htm", "passage_text": "1 The recommended dose of CIALIS for once daily use is 5 mg, taken at approximately the same time every day. 2  When therapy for BPH is initiated with CIALIS and finasteride, the recommended dose of CIALIS for once daily use is 5 mg, taken at approximately the same time every day for up to 26 weeks."}, {"url": "http://men.emedtv.com/tadalafil/dosage-of-tadalafil.html", "passage_text": "The recommended starting dosage of tadalafil for treating erectile dysfunction is tadalafil 10 mg one hour prior to sexual activity. However, you may take tadalafil anywhere from 1 hour to 36 hours before"}, {"url": "http://www.rxlist.com/cialis-drug/indications-dosage.htm", "passage_text": "CIALIS For Use As Needed For Erectile Dysfunction. 1  The recommended starting dose of CIALIS for use as needed in most patients is 10 mg, taken prior to anticipated sexual activity. 2  The dose may be increased to 20 mg or decreased to 5 mg, based on individual efficacy and tolerability."}, {"url": "http://www.rxlist.com/cialis-tadalafil/drug.htm", "passage_text": "1 For most patients the recommended starting dose is 10 mg as needed prior to anticipated sexual activity. 2  The dose may be increased to 20 mg or decreased to 5 mg based on efficacy or tolerability. 3  The maximum dosing frequency is once daily for most patients. 4  Cialis is effective for up to 36 hours."}, {"url": "http://erectile-dysfunction.emedtv.com/cialis/cialis-dosage.html", "passage_text": "Alternatively, Cialis can be taken on a daily basis (every single day, whether you plan sexual activity or not). For this use, the recommended dose is Cialis 2.5 mg once daily, taken at the same time each day (it does not matter when you plan to have sexual activity if you take Cialis this way)."}, {"url": "http://www.rxlist.com/cialis-drug/indications-dosage.htm", "passage_text": "CYP3A4 Inhibitors. CIALIS for Use as Needed — For patients taking concomitant potent inhibitors of CYP3A4, such as ketoconazole or ritonavir, the maximum recommended dose of CIALIS is 10 mg, not to exceed once every 72 hours [see WARNINGS AND PRECAUTIONS and DRUG INTERACTIONS ]."}]