[{"url": "http://www.paleodietandliving.com/paleo-diet/beginners-guide-to-rendering-goose-fat-and-other-animal-fats/", "passage_text": "Anyhow, I wanted to render this goose fat to use for cooking, but also because it was almost 1″ thick in some places and the smoker I built is more of a cold smoker. It probably would have taken 2 days to cook this bird as thick as the fat layer was. "}, {"url": "http://www.cooksinfo.com/goose-fat", "passage_text": "In France, goose fat is sold in tins or jars (jars are more flexible for daily use as they can be re-sealed.) In some parts of France, everyday cooking is still based on goose fat in the way that other parts of Europe rely on butter or oil. Brown fat is the fat that you get while roasting a goose; it renders off the goose as a by-product of the roasting. Blonde (actually more white) fat is rendered in a saucepan. Either kind is spreadable like butter, and has a smoke point of 375 F / 190 C."}, {"url": "http://www.chowhound.com/post/left-goose-fat-665042#!", "passage_text": "here were my suggestions: goose fat pie crust (sub goose fat for butter or lard in pie crust recipe); use goose fat for frying ingredients for wild rice stuffing (sub for bacon & bacon grease); make potted goose with juniper berries (with leftover goose meat, and rendered goose fat) as a cocktail hour centerpiece. Hi, everyone! My son is coming home for Christmas, and we're hoping to cook a goose. I asked on the Twin Cities board where to purchase a goose, and also what to do with the leftover goose fat. The board monitors suggested posting the question here, as well."}, {"url": "http://www.bbc.co.uk/food/goose_fat", "passage_text": "Goose fat recipes. When goose is roasted it gives off a quantity of fat that can be strained and stored, once cool, in the refrigerator. Goose fat is an excellent cooking medium with a rich, silky texture and has a very fine, savoury flavour. It can be cooked at a high temperature without burning. Once opened, keep in the fridge. If strained through muslin into sterilised jars, home-produced goose fat will keep for up to six months. Goose fat freezes well and lasts many months. A good tip is to freeze small quantities in small blocks or ice-cube trays for ease of use."}, {"url": "https://en.wikipedia.org/wiki/Schmaltz", "passage_text": "For the brewery, see Shmaltz Brewing Company. Schmaltz (also spelled schmalz or shmalz) is rendered (clarified) chicken or goose fat used for frying or as a spread on bread in Central European cuisine, and in the United States, particularly identified with Ashkenazi Jewish cuisine. Homemade Jewish-style schmaltz is made by cutting chicken or goose fat into small pieces and melting in a pan over low-to-moderate heat, generally with onions. After the majority of the fat has been extracted, the melted fat is strained through a cheesecloth into a storage container."}, {"url": "http://www.cooksinfo.com/goose-fat", "passage_text": "When people say that something cooked with goose fat was greasy, it's because too much was used, and it tends to stay more on the surface of food items than be soaked in the way oil is. Goose fat can be used as a spread on bread. Many people swear by goose fat for making roast potatoes with. To render blonde goose fat: Remove loose fat from the raw goose. Put the fat in a small pot with an equal amount of water, and render over low heat. Brown fat is the fat that you get while roasting a goose; it renders off the goose as a by-product of the roasting. Blonde (actually more white) fat is rendered in a saucepan. Either kind is spreadable like butter, and has a smoke point of 375 F / 190 C."}, {"url": "http://www.motherlindas.com/French_goose_fat.htm", "passage_text": "French goose and duck fat: A Golden Treasure Mother Linda's. You can no longer buy French goose fat in the United States, but I have wonderful duck fat from Rougie, the same French company that used to export goose fat to the US. Rougie recently started working with a duck farm in Quebec. Duck fat is wonderfully golden and has a fatty acid profile similar to goose fat. When it cools, goose fat is a beautiful pale yellow and solid at room temperature, but softer than lard. The French goose fat I sell comes packed in a can that you can leave at room temperature until it is opened and thereafter keep in the refrigerator."}, {"url": "http://www.goosefat.co.uk/page/usage-recipes", "passage_text": "1 Duck and goose confit: the French way of preserving food in fat, so goose fat is perfect for this. 2  See recipe for Duck confit. 3  Use goose fat for duck, goose or pork rillettes, which is a homemade coarse pate, made from confit. 1 Pastry: Shortcrust pastry can be made with goose fat, however it can be very short and difficult to handle. 2  Here again, use less fat than if using butter or lard. 3  Cut 100g hard goose fat into 250g plain flour with a round-bladed knife. 4  No water is needed."}, {"url": "https://en.wikipedia.org/wiki/Schmaltz", "passage_text": "The English term schmaltz is derived from Yiddish, and is cognate with the German term Schmalz, meaning rendered animal fat, regardless of source—both tallow and lard are considered forms of Schmalz in German, as is clarified butter. However, English usage tends to follow Yiddish, where it means poultry fat. Homemade Jewish-style schmaltz is made by cutting chicken or goose fat into small pieces and melting in a pan over low-to-moderate heat, generally with onions. After the majority of the fat has been extracted, the melted fat is strained through a cheesecloth into a storage container."}]