[{"url": "https://answers.yahoo.com/question/index?qid=20091014231824AARXyye", "passage_text": "Rating Newest Oldest. Best Answer: muscle soreness-as in it's painful. You can move it, but the more you move, the more painful it gets. Eventually the pain stops you from wanting to move. muscle stiffness-this is when your muscle is fatigued, and it doesn't contract anymore. "}, {"url": "http://azopt.net/difference-pain-soreness-exercise/", "passage_text": "Another cue you are experiencing pain and not muscle soreness is if you begin to feel symptoms in a part of your body not being exercised. For example, if your low back experiences pain while performing an abdominal exercise. This could be caused by the body’s normal response to build muscle (soreness) or due to more serious injury (pain). Many people have a difficult time distinguishing between soreness and pain. First, let’s talk about the process your body goes through during and after a workout to build muscle."}, {"url": "https://www.sharecare.com/health/types-exercise/what-difference-between-soreness-pain", "passage_text": "When working out you will experience Delay Onset Muscle Soreness (DOMS), usually felt 12-48 hours after exercise. This usually happens when your body begins a new exercise routine that your body is not familiar with. This will go away after a few days. Pain is something you do not want to ignore. There is a big difference between pain and soreness. Soreness is part of the workout equation and will subside. Pain is your body's way of telling you to take a break. Unless you get paid to play a sport, I do not suggest working through the pain"}, {"url": "http://answers.webmd.com/answers/1200343/what-is-the-difference-between-nerve-pain-and-muscle-pain", "passage_text": "112 Followers. A. The tingling and burning sensations of nerve pain are very different from the soreness and aches you might feel from muscle pain. Muscle pain is caused by a physical injury, such as a fall, and disappears once the injury has healed. It can also be treated with many common pain medications, including medicine you buy over the counter."}]