[{"url": "http://www.thebestofrawfood.com/alkaline-foods.html", "passage_text": "Alkaline foods are foods that raise the the amount of oxygen that your blood takes in. The most alkalizing foods are RAW green leafy vegetables, non-sweet fruits and (wheat) grasses. The opposite of alkaline foods are acid foods. How much oxygen your blood can absorb is measured on a pH scale that ranges from 0 to 14. A pH of 0 is most acidic while a pH of 14 is most alkaline."}, {"url": "http://greenopedia.com/alkaline-acid-food-chart/", "passage_text": "How the body reacts to certain foods is what determines what foods are alkaline-forming and what foods are acid-forming. For example lemons are acidic in nature, but have an alkalizing effect on the body once they are digested. Similarly, milk is alkaline outside the body, but acidic upon digestion."}, {"url": "http://www.acidalkalinediet.net/alkaline-foods.php", "passage_text": "An alkaline diet emphasizes alkaline foods such as whole fruits and vegetables and certain whole grains, which are low in caloric density. Healthy Alkaline Diet Foods involve the ideal balance between acidifying and alkalizing foods."}, {"url": "http://www.acidalkalinediet.com/Alkaline-Foods-Chart.htm", "passage_text": "1 The color of the text under each food represents the pH rating. 2  This chart is based on the resulting pH ash of foods after digestion. 3  This is the reading you should go by when alkalizing foods for your body. 4  You should aim for a 70/30 ratio between high alkaline vs acid foods."}, {"url": "http://www.rense.com/1.mpicons/acidalka.htm", "passage_text": "Generally, alkaline forming foods include: most fruits, green vegetables, peas, beans, lentils, spices, herbs and seasonings, and seeds and nuts. Generally, acid forming foods include: meat, fish, poultry, eggs, grains, and legumes."}, {"url": "http://thealkalinefoods.com/", "passage_text": "All foods that we digest release an alkaline ash (bicarbonate) or an acid ash into blood and tissues of the body depending on the mineral compounds that the foods contain. It is worth noting that acid-producing foods can lose some of the essential minerals such a potassium, magnesium, calcium, and sodium."}]