[{"url": "http://www.machupicchu-inca.com/getting-to-machu-picchu.html", "passage_text": "Machu Picchu from Lima. If you are coming from outside Peru, certainly you are going to land at Lima, which is the only International Airport at Peru. It is located in Callao, 10 km (6 miles) from Downtown Lima. Jorge Chavez International Airport, Lima. As I mentioned above to reach Machu Picchu you have to be Cusco first. Once you reach Cusco, you need to take train to reach Machu Picchu. Distance between Cusco and Machu Picchu is 112 Kilometers. You can reach Machu Picchu by train, bus or even by helicopter. Usually travelers reach Machu Picchu by trains."}, {"url": "http://www.machupicchu.org/lima_to_machu_picchu.htm", "passage_text": "LIMA TO MACHU PICCHU. Machu Picchu is an ancient Incan city in Peru about 795 miles southeast of Lima. The Incas built the city in about 1450, and most researchers believe it was abandoned less than 100 years later. Today, a 70-mile train ride connects visitors to Machu Picchu from Cusco, a regional center in the eastern Andes Mountains. At 7,546 feet, the surroundings are permeated by lush growth."}, {"url": "http://www.escapetraveler.com/getting-to-machu-picchu-how-to-get-to-machu-picchu-peru/", "passage_text": "While in Cuzco, you can find many 1 or 2 days packaged tour to Machu Picchu ($US270-350), 4 days Inca Trail Hike (US$450-650), half-day Cuzco city tour (US$10-15 or S./25-40), or 1 day Sacred Valley tour (US$12-20 or S./30-50). The Cuzco-Machu Picchu trains also fill up quickly, so this is a good alternative. Ollantaytambo (65km from Cuzco) is along a scenic paved road. It is a very lovely town, and it is recommended to spend 1- 2 here and slow down to soak up the basic lifestyle."}, {"url": "http://www.lan.com/en_ca/sitio_personas/destinos/peru/machu_picchu.html", "passage_text": "About Machu Picchu. This impressive Inca citadel is located 130 kilometers north-east of Cuzco and is one of the Seven Wonders of the Modern World, as well as a World Heritage Site. Its history, architecture, beauty, location and geography make Machu Picchu one of the most visited places in the world"}, {"url": "http://www.distances-calculator.com/world-distances-lima-to-machu_picchu.htm", "passage_text": "Advertisements. This page http://www.distances-calculator.com/world-distances-lima-to-machu_picchu.htm uses Javascript to deliver what you require. If you want to calculate the distance for lima to machu_picchu you'll need to enable it to see maps, calculate fuel costs and directions. "}, {"url": "http://traveltips.usatoday.com/machu-picchu-tours-lima-35905.html", "passage_text": "Machu Picchu Facts. Machu Picchu is an ancient Incan city in Peru about 795 miles southeast of Lima. The Incas built the city in about 1450, and most researchers believe it was abandoned less than 100 years later. Airfares vary depending on the airline and day of week, and cost from $150 to $300 round trip from Lima to Cusco. Tours may be booked in Lima via storefront travel agencies or online. For the more adventurous, a bus line operates service between Lima and Cusco and costs $57 one way. Travel time is 18 hours."}, {"url": "http://traveltips.usatoday.com/machu-picchu-tours-lima-35905.html", "passage_text": "A World Heritage site, Machu Picchu and its civilization were lost until discovery of the site in 1911. As Machu Picchu is Peru's premier tourist attraction, many tour operators offer excursions to the city from its major international gateway and capital, Lima. Airfares vary depending on the airline and day of week, and cost from $150 to $300 round trip from Lima to Cusco. Tours may be booked in Lima via storefront travel agencies or online. For the more adventurous, a bus line operates service between Lima and Cusco and costs $57 one way. Travel time is 18 hours."}, {"url": "http://www.machupicchu-inca.com/getting-to-machu-picchu.html", "passage_text": "First you have to reach Lima (capital of Peru), then Cusco (another important city of Peru), then a three hour train journey to Aguas Calientes (a small town next to Machu Picchu ruins), and finally another 20 minutes by bus and you are at the gate of stunning, awesome Machu Picchu. Once you reach Cusco, you need to take train to reach Machu Picchu. Distance between Cusco and Machu Picchu is 112 Kilometers. You can reach Machu Picchu by train, bus or even by helicopter. Usually travelers reach Machu Picchu by trains."}]