[{"url": "http://appliedscienceresearch.labanca.net/?p=27", "passage_text": "A standard curve is a tool used in research the concentration of substances quantitatively. It is used to find the concentrations of unknown substances. This is done by comparing the assay data of the unknown substance concentrations to that of the known. The standard curve can be used to verify the concentration of substances in different consumer products. An example might be the amount of dye in fruit juices or the amount of a specific protein in meat products or the amount of a certain chemical in beauty products."}, {"url": "https://en.wikipedia.org/wiki/Standard_curve", "passage_text": "For example, a standard curve for protein concentration is often created using known concentrations of bovine serum albumin. The property measured may be absorbance, optical density, luminescence, fluorescence, radioactivity, or other parameters. To analyze the data, one locates the measurement on the Y-axis that corresponds to the assay measurement of the unknown substance and follows a line to intersect the standard curve. The corresponding value on the X-axis is the concentration of substance in the unknown sample."}, {"url": "https://en.wikipedia.org/wiki/Standard_curve", "passage_text": "From Wikipedia, the free encyclopedia. An example of a standard curve showing the absorbance of different concentrations of protein (two trials for each measurement). The concentration of protein in a different sample is determined by determining where on the standard curve it should go-in this case, 30 milligrams. To analyze the data, one locates the measurement on the Y-axis that corresponds to the assay measurement of the unknown substance and follows a line to intersect the standard curve. The corresponding value on the X-axis is the concentration of substance in the unknown sample."}, {"url": "http://science.kennesaw.edu/~jdemaio/1107/Chap5.htm", "passage_text": "The Standard Normal Curve The normal distribution is the bell curve (or normal curve). The standard normal curve is the normal curve with a mean of zero and a standard deviation of one. The probability that an observation falls into an interval I will be computed as the area of interval I under the normal curve. The Non-Standard Normal Curve. Not every normal curve will be the standard normal curve. A normal curve is defined by two parameters, the mean and the standard deviation. Consider a normal distribution where the mean is 56.8 and the standard deviation is 5.5."}, {"url": "http://appliedscienceresearch.labanca.net/?p=27", "passage_text": "A standard curve is a graphing function or method for plotting assay data of known solution concentrations to determine the unknown concentrations of similar solutions. It is extremely valuable in the study of proteins and DNA. The standard curve can be used to verify the concentration of substances in different consumer products. An example might be the amount of dye in fruit juices or the amount of a specific protein in meat products or the amount of a certain chemical in beauty products."}, {"url": "http://math.stackexchange.com/questions/21872/what-is-a-standard-curve", "passage_text": "active oldest votes. up vote 2 down vote. Standard curves are usually used in the field of biology to help you identify how much stuff (in many cases, this is the concentration of some kind of protein) you have in your samples. Simply put, a standard curve is a plot of known x and y values. Given just y from your experiment, you should be able to determine x from the plot of known values (standard curve). To get into a bit more detail, a standard curve for immunoassays such as ELISAs is usually fit to the 4 parameter logistic (4PL) or 5 parameter logistic (5PL) nonlinear regression model equations."}, {"url": "http://biology-forums.com/index.php?topic=9109.0", "passage_text": "A standard curve is a graphing function or method for plotting assay data of known solution concentrations to determine the unknown concentrations of similar solutions. It is extremely valuable in the study of proteins and DNA. Graph these data to make a standard curve-concentration on the X axis, and assay measurement on the Y axis. Also perform the same assay with your unknown samples. You want to know the concentration of the substance in each of these unknown samples. To analyze the data, fit a line or curve through the standards."}, {"url": "https://en.wikipedia.org/wiki/Standard_curve", "passage_text": "A standard curve is a type of graph used as a quantitative research technique. Multiple samples with known properties are measured and graphed, which then allows the same properties to be determined for unknown samples by interpolation on the graph. To analyze the data, one locates the measurement on the Y-axis that corresponds to the assay measurement of the unknown substance and follows a line to intersect the standard curve. The corresponding value on the X-axis is the concentration of substance in the unknown sample."}, {"url": "http://appliedscienceresearch.labanca.net/?p=27", "passage_text": "A standard curve is used to determine the concentration of a substance that is unknown. To start the standard curve test known concentrations of similar solutions, one way to do this is using a spectrophotometer to measure absorption when compared with concentration. The standard curve can be used to verify the concentration of substances in different consumer products. An example might be the amount of dye in fruit juices or the amount of a specific protein in meat products or the amount of a certain chemical in beauty products."}]