[{"url": "http://biology.about.com/od/humananatomybiology/ss/gonads.htm", "passage_text": "Gonads. Gonads are the male and female primary reproductive organs. The male gonads are the testes and the female gonads are the ovaries. These reproductive system organs are necessary for sexual reproduction as they are responsible for the production of male and female gametes. Sex hormones may be regulated by other hormones, by glands and organs, and by a negative feedback mechanism. Hormones that regulate the release of other hormones are called tropic hormones. Gonadotropins are tropic hormones that regulate the release of sex hormones by gonads."}, {"url": "http://biology.about.com/od/organsystems/ss/reproductive-system.htm", "passage_text": "Secondary organs aid in the growth and maturation of gametes and developing offspring. 1  Female Reproductive System. 2  Labia majora-Larger lip-like external structures that cover and protect sexual structures. 3  Labia minora-Smaller lip-like external structures found inside the labia majora. 1 Fallopian tubes-Uterine tubes which transport egg cells from the ovaries to the uterus. 2  Fertilization typically occurs in these tubes. 3  Ovaries-Female primary reproductive structures that produce gametes and sex hormones."}, {"url": "http://biology.about.com/od/organsystems/ss/reproductive-system.htm", "passage_text": "1 Uterus-Muscular internal organ that houses and nurtures female gametes after fertilization. 2  Also called the womb, the uterus is where a developing fetus resides during pregnancy. 3  Fallopian tubes-Uterine tubes which transport egg cells from the ovaries to the uterus. 4  Fertilization typically occurs in these tubes. 1 Fallopian tubes-Uterine tubes which transport egg cells from the ovaries to the uterus. 2  Fertilization typically occurs in these tubes. 3  Ovaries-Female primary reproductive structures that produce gametes and sex hormones."}, {"url": "https://en.wikipedia.org/wiki/Gametophyte", "passage_text": "It develops from a spore by mitotic cell division. Spores are the products of meiosis in sporophytes. Gametophytes produce haploid gametes by mitosis. In some types of plants and algae (e.g. Ulva) gametes are isogamous --that is, the gametes are all of one size, shape and general morphology. In land plants, Anisogamy is universal. As in animals, female and male gametes are called, respectively, eggs and sperm. The fusion of male and female gametes produces a diploid zygote, which develops by repeated mitotic cell divisions into a multicellular sporophyte. "}, {"url": "http://www.austincc.edu/apreview/PhysText/Reproductive.html", "passage_text": "The primary reproductive organs are the organs responsible for. 1  producing the egg and sperm cells (gametes), 2  producing hormones that function in the maturation of the reproductive system. 3  the development of sexual characteristics. 4  regulating the normal physiology of the reproductive system. Female Reproductive System. Ovaries. 1  Are the primary female reproductive organs. 2  Produce female gametes (ova). 3  Secrete female sex hormones (estrogen and progesterone). 4  Have ovarian follicles embedded in the ovary cortex are ovarian follicles; each follicle consists of an immature egg called an oocyte"}, {"url": "https://en.wikipedia.org/wiki/Gametogenesis", "passage_text": "Animals produce gametes directly through meiosis in organs called gonads (testicle in males and ovary in females). Males and females of a species that reproduces sexually have different forms of gametogenesis. 1  spermatogenesis (male). 2  oogenesis (female). For example, plants produce gametes through mitosis in gametophytes. The gametophytes grow from haploid spores after sporic meiosis. The existence of a multicellular, haploid phase in the life cycle between meiosis and gametogenesis is also referred to as alternation of generations."}, {"url": "http://www.biology.lifeeasy.org/67/what-are-the-male-and-female-gamete-producing-organs", "passage_text": "0 votes. answered by Shubham bhagat. The male and female gamete producing organs are called primary sex organs. In male primary sex organ is TESTIS which is present in scrotum, it is a pair gland each present in each scrotal lobe. it produces male gamete called sperm. In female primary sex organ is OVERIES present in abdominal cavity it is also a pair gland. it produces female gamete called ovum/oospere/egg."}, {"url": "http://highered.mheducation.com/sites/dl/free/0072919329/65697/ch22.doc", "passage_text": "Illustrate the steps involved in gamete formation (meiosis), explain the highlight(s) of each step, and explain any differences between male and female end-products. 7. Name the specific step of meiosis where homologous chromosomes are arranged together in tetrads (this is also called synapsis). "}, {"url": "http://biology.about.com/od/organsystems/ss/reproductive-system.htm", "passage_text": "1 This organ is composed of erectile tissue, connective tissue, and skin. 2  The urethra extends through the length of the penis, allowing urine and sperm to pass. 3  Testes-Male primary reproductive structures that produce male gametes (sperm) and sex hormones. 4  Scrotum-External pouch of skin that contains the testes. 1 Fallopian tubes-Uterine tubes which transport egg cells from the ovaries to the uterus. 2  Fertilization typically occurs in these tubes. 3  Ovaries-Female primary reproductive structures that produce gametes"}]