[{"url": "https://en.wikipedia.org/wiki/Effects_of_high_altitude_on_humans", "passage_text": "The effects of high altitude on humans are considerable. The percentage saturation of haemoglobin with oxygen determines the content of oxygen in our blood. After the human body reaches around 2,100 m (7,000 feet) above sea level, the saturation of oxyhemoglobin begins to plummet. Mountain medicine recognizes three altitude regions that reflect the lowered amount of oxygen in the atmosphere: 1  High altitude = 1,500–3,500 metres (4,900–11,500 ft). 2  Very high altitude = 3,500–5,500 metres (11,500–18,000 ft). 3  Extreme altitude = above 5,500 metres ("}, {"url": "http://www.liver.ca/liver-disease/having-liver-disease/healthy-living-guidelines/sodium-guidelines.aspx", "passage_text": "Most Canadians consume far more sodium than is needed. The recommended amount per day is between 1500 mg (considered adequate intake) and 2300 mg (upper amount) for people 9 -50 years of age. For people over 50 years of age, an adequate intake drops to 1300 mg per day until 70 and then 1200 mg over 70 years of age. However, the average daily intake in the Canadian diet is about 3500 mg of sodium, although many Canadians eat well in excess of 5000 mg per day. Can I get too much sodium? Yes."}, {"url": "https://en.wikipedia.org/wiki/Health_effects_of_salt", "passage_text": "The United States Department of Health and Human Services recommends that individuals consume no more than 1500–2300 mg of sodium (3750–5750 mg of salt) per day depending on age. UK: The Food Standards Agency defines the level of salt in foods as follows: High is more than 1.5 g salt per 100 g (or 0.6 g sodium). Low is 0.3 g salt or less per 100 g (or 0.1 g sodium). If the amount of salt per 100 g is in between these figures, then that is a medium level of salt.. In the UK, foods produced by some supermarkets and manufacturers have 'traffic light' colors on the front of the packet: red (high), amber (medium), or green (low)"}, {"url": "http://lpi.oregonstate.edu/mic/minerals/phosphorus", "passage_text": "1 The tolerable upper intake level (UL) for phosphorus is 4,000 mg/day for generally healthy adults. 2  Yet, daily phosphorus intakes in excess of the RDA have been linked to an increased risk of all-cause mortality in healthy individuals. (More information). The recommended dietary allowance (RDA) for phosphorus is based on the maintenance of normal serum phosphorus levels in adults (2.5-4.5 milligrams/deciliter [mg/dL]) and is believed to represent adequate phosphorus intakes to meet cellular and bone formation needs (6; Table 1)."}, {"url": "https://en.wikipedia.org/wiki/Copper_in_health", "passage_text": "The World Health Organization recommends a minimal acceptable intake of approximately 1.3 mg/day. These values are considered to be adequate and safe for most of the general population. In North America, the recommended intake of copper for healthy adult men and women is 900 micrograms/day (0.9 mg/day). Daily dietary standards for copper have been set by various health agencies around the world. Standards adopted by some nations recommend different copper intake levels for adults, pregnant women, infants, and children, corresponding to the varying need for copper during different stages of life."}, {"url": "http://www.gbhealthwatch.com/Nutrient-Potassium-Overview.php", "passage_text": "Potassium is a key mineral for the human body because it counteracts sodium in many physiological processes. High doses of dietary potassium are an effective approach for reducing hypertension and related chronic heart diseases caused by high sodium intake. The Dietary Guidelines for Americans recommends an intake of 4,700 mg of potassium (approximately 6 to 7 small potatoes worth) for the average adult. Currently, most Americans do not consume an adequate amount of potassium. In fact, the typical American consumes only 56% this amount."}, {"url": "http://www.gbhealthwatch.com/Nutrient-Potassium-Overview.php", "passage_text": "Normal potassium levels in the human body range between 3.5-5.0 mEq/L (136.5-195 μg/ml). Anything lower than 3.5 mEq/L is called hypokalemia, which can cause a lack of energy, muscle cramps, stomach disturbances, and irregular heartbeat. The Dietary Guidelines for Americans recommends an intake of 4,700 mg of potassium (approximately 6 to 7 small potatoes worth) for the average adult. Currently, most Americans do not consume an adequate amount of potassium. In fact, the typical American consumes only 56% this amount."}, {"url": "http://www.bawellwaterionizers.com/phandorp.html", "passage_text": "The ideal pH level of alkaline ionized water for long term human consumption is between 8.5 and 9.5 (and no greater than 10.0) with the ideal ORP value around -250mV to -350mV (and in no way significantly greater than -400mV). "}, {"url": "https://en.wikipedia.org/wiki/Copper_in_health", "passage_text": "In North America, a maximum tolerable intake has been established at 10 mg/day. This is the highest level of copper intake that is not likely to pose a health risk to most adults in the general population. However, this daily intake level is not recommended by any authority. Daily dietary standards for copper have been set by various health agencies around the world. Standards adopted by some nations recommend different copper intake levels for adults, pregnant women, infants, and children, corresponding to the varying need for copper during different stages of life."}]