[{"url": "http://radiopaedia.org/articles/endometrial-thickness", "passage_text": "The normal endometrium changes in appearance as well as in thickness throughout the menstrual cycle: 1  in the menstrual and early proliferative phase it is a thin, brightly echogenic stripe comprising of the basal layer (Figure 1). Endometrial thickness is a commonly measured parameter on routine gynaecological ultrasound and MR imaging."}, {"url": "https://en.wikipedia.org/wiki/Endometrium", "passage_text": "At the time of embryo transfer, it is favorable to have an endometrium of a thickness of between 7 and 14 mm with a triple-line configuration, which means that the endometrium contains a hyperechoic (usually displayed as light) line in the middle surrounded by two more hypoechoic (darker) lines. An endometrial thickness (EMT) of less than 7 mm decreases the pregnancy rate in in vitro fertilization by an odds ratio of approximately 0.4 compared to an EMT of over 7 mm. However, such low thickness rarely occurs, and any routine use of this parameter is regarded as not justified."}, {"url": "http://sogc.org/wp-content/uploads/2013/01/gui249CPG1010E.pdf", "passage_text": "INTRODUCTION I 1–3 Current ultrasound literature suggests that asymp-tomatic endometrial thickness of 8 to 11 mm in apostmenopausal women is not abnormal. 4–8 The measure-ment of the endometrium is made at its maximal thicknesson a midline sagittal image of the uterus obtained bytransvaginal ultrasound. "}, {"url": "http://www.advancedfertility.com/uterus.htm", "passage_text": "A (fairly) normal uterine cavity and endometrial lining are necessary in order to conceive and maintain a pregnancy. There are several conditions related to the cavity or the lining that can cause problems. 1  When a woman has her menses (period) the endometrial lining of the uterus and some associated blood is shed. 1 Thin endometrial lining-this is also uncommon. 2  We like to see a lining of at least 8mm in thickness when measured by ultrasound at the time of maximal thickness during the cycle (see above ultrasound picture of an 11.2 mm lining)."}, {"url": "http://emedicine.medscape.com/article/403578-overview", "passage_text": "The reported normal range for this bilayer endometrial thickness is up to 5 mm in asymptomatic postmenopausal women not receiving hormones and up to 8 mm in asymptomatic postmenopausal women on HRT. Some advocate calling all measurements greater than 5 mm abnormal with or without HRT. In 24 patients with primary endometrial malignancy reported by Walsh and Goplerud, CT showed normal uterine attenuation findings in 50% of patients and 1- to 5-cm low-attenuation tumor areas in the uterus in the other 50% of patients."}, {"url": "http://radiopaedia.org/articles/endometrial-thickness", "passage_text": "The appearance, as well as the thickness of the endometrium, will depend on whether the patient is of reproductive age or post-menopausal and, if of reproductive age, at what point in the menstrual cycle they are examined. The endometrium should be measured in the long axis or sagittal plane. Endometrial thickness is a commonly measured parameter on routine gynaecological ultrasound and MR imaging."}, {"url": "http://radiopaedia.org/articles/endometrial-thickness", "passage_text": "The designation of normal limits of endometrial thickness rests on determining at which thickness the risk of endometrial carcinoma is significantly increased. Endometrial thickness is a commonly measured parameter on routine gynaecological ultrasound and MR imaging."}, {"url": "http://www.ehow.com/about_5437155_normal-endometrial-stripe-thickness.html", "passage_text": "Save. The inner lining of the uterus is called the endometrium. The endometrium is the tissue to which a fertilized egg, or blastocycst, attaches for the duration of a pregnancy. The endometrial size varies throughout the menstrual cycle, but should be less than 8 mm in post-menopausal women. Menstruation. The endometrium starts off as a thickened lining, sometimes measuring up to 15 mm in thickness. Menstruation occurs during the first week of the menstrual cycle. As the endometrium is expelled, it may vary in thickness and may have an irregular appearance on ultrasound."}]