[{"url": "http://www.historyofvaccines.org/content/articles/rubella", "passage_text": "U.S. Vaccination Recommendations. Vaccination against rubella is included on the U.S. childhood immunization schedule as part of the combined MMR vaccination. This vaccine is given in two doses, the first at 12-15 months of age and the second between 4-6 years of age. Alternatively, rubella vaccination is available as part of the newer MMRV (measles, mumps, rubella, and varicella) combination vaccine, which also protects against chickenpox. "}, {"url": "http://www.phac-aspc.gc.ca/publicat/cig-gci/p04-meas-roug-eng.php", "passage_text": "The first dose of measles-containing vaccine should be administered at 12 to 15 months of age and the second dose at 18 months of age or any time thereafter, but should be given no later than around school entry. The recommended minimum interval between doses of MMR vaccine is 4 weeks. How. 1  Routine childhood immunization: administer two doses of measles-containing vaccine (MMR or MMRV); the first dose at 12 to 15 months of age and the second dose at 18 months of age or any time thereafter, but should be given not"}, {"url": "https://en.wikipedia.org/wiki/MMR_vaccine", "passage_text": "A licensed vaccine to prevent measles first became available in 1963, an improved measles vaccine in 1968. Vaccines for the mumps and rubella became available in 1967 and 1969, respectively. The three vaccines (for mumps, measles, and rubella) were combined in 1971 to become the measles-mumps-rubella (MMR) vaccine. The MMR vaccine is generally administered to children around the age of one year, with a second dose before starting school (i.e. age 4/5). The second dose is a dose to produce immunity in the small number of persons (2–5%) who fail to develop measles immunity after the first dose. The MMR vaccine is an immunization vaccine against measles, mumps, and rubella (German measles) . It is a mixture of live attenuated viruses of the three diseases, administered via injection. It was first developed by Maurice Hilleman while at Merck."}, {"url": "http://www.phac-aspc.gc.ca/publicat/cig-gci/p04-meas-roug-eng.php", "passage_text": "1 Routine childhood immunization: administer two doses of measles-containing vaccine (MMR or MMRV); the first dose at 12 to 15 months of age and the second dose at 18 months of age or any time thereafter, but should be given not later than around school entry. How. 1 "}, {"url": "http://www.cdc.gov/vaccines/vpd-vac/combo-vaccines/mmrv/vacopt-faqs-hcp.htm", "passage_text": "When the first dose of measles, mumps, rubella, and varicella vaccines is administered at ages 48 months and older, use of MMRV vaccine generally is preferred over separate injections of MMR and varicella vaccines. However, the overall risk of febrile seizures is very low for both options (about 8 out of every 10,000 children vaccinated with MMRV vaccine when they are 12-23 months old, and about 4 out of every 10,000 children vaccinated with the MMR and varicella vaccines at the same visit when they are 12-23 months old)."}, {"url": "http://www.cdc.gov/vaccines/hcp/vis/vis-statements/mmr.html", "passage_text": "MMR vaccine may be given at the same time as other vaccines. Children between 1 and 12 years of age can get a combination vaccine called MMRV, which contains both MMR and varicella (chickenpox) vaccines. There is a separate Vaccine Information Statement for MMRV. Top of Page. "}, {"url": "http://www.cdc.gov/vaccines/vpd-vac/combo-vaccines/mmrv/vacopt-faqs-hcp.htm", "passage_text": "Vaccines and Immunizations. ShareCompartir. For the first dose of measles, mumps, rubella, and varicella vaccines at age 12-47 months, either MMR vaccine and varicella vaccine or MMRV vaccine may be used. However, the overall risk of febrile seizures is very low for both options (about 8 out of every 10,000 children vaccinated with MMRV vaccine when they are 12-23 months old, and about 4 out of every 10,000 children vaccinated with the MMR and varicella vaccines at the same visit when they are 12-23 months old)."}, {"url": "http://www.cdc.gov/vaccines/vpd-vac/combo-vaccines/mmrv/vacopt-faqs-hcp.htm", "passage_text": "The Advisory Committee on Immunization Practices (ACIP) recommends a two-dose vaccine schedule for measles, mumps, rubella and varicella vaccines for children, with the first dose at age 12-15 months and the second at age 4-6 years. However, the overall risk of febrile seizures is very low for both options (about 8 out of every 10,000 children vaccinated with MMRV vaccine when they are 12-23 months old, and about 4 out of every 10,000 children vaccinated with the MMR and varicella vaccines at the same visit when they are 12-23 months old)."}, {"url": "http://www.webmd.com/children/vaccines/measles-mumps-and-rubella-mmr-vaccine", "passage_text": "MMR is a two-shot series of vaccines usually given during childhood. A child should receive the first shot when he is between 12-15 months, and the second when he's between 4-6 years of age. If you're not sure if you have had the diseases or the vaccines (prior to 1971 it was given in three separate shots), you can get the MMR vaccine as an adult. Talk to your doctor about it if:"}]