[{"url": "https://en.wikipedia.org/wiki/Leaf_vegetable", "passage_text": "Leaf vegetables, also called potherbs, greens, vegetable greens, leafy greens or salad greens, are plant leaves eaten as a vegetable, sometimes accompanied by tender petioles and shoots. "}, {"url": "http://healthyeating.sfgate.com/list-dark-green-leafy-vegetables-1647.html", "passage_text": "Edible green leaves have an abundance of nutrients. Dark green leafy vegetables are nutritional powerhouses filled with vitamins, minerals and phytonutrients. They are rich in chlorophyll, which alkalinizes the blood, and fiber, which keeps the colon healthy. Cruciferous Leafy Greens. Kale, mustard greens, collard greens, cabbage and broccoli are cruciferous leafy greens. Cruciferous vegetables are high in nutrients and contain glucosinolates, which inhibit the growth of certain cancers."}, {"url": "http://www.ars.usda.gov/News/docs.htm?docid=23199", "passage_text": "Dark green leafy vegetables are great sources of nutrition. Salad greens, kale and spinach are rich in vitamins A, C, E and K, and broccoli, bok choy and mustard are also rich in many of the B-vitamins. Lin Yan. People have been eating leafy greens since prehistoric times. But it wasn't until the first Africans arrived in North America in the early 1600s that America got its first real tastes of dark green leafy vegetables, which they grew for themselves and their families."}, {"url": "http://youngwomenshealth.org/2012/12/10/dark-green-leafy-vegetables/", "passage_text": "1 Add to a soup: Try mixing leafy greens such as collard greens, kale or mustard greens into your favorite soup. 2  Stir-fry: Add chopped leafy greens or broccoli to your stir-fry. 3  Chicken or tofu stir-fried with olive or canola oil and your favorite dark green vegetable is delicious! 1 Make a salad: Leafy greens such as romaine lettuce, spinach and arugula taste great when mixed in a salad with different kinds of veggies, such as tomatoes, cucumbers, carrots, and lettuce."}, {"url": "http://www.aicr.org/foods-that-fight-cancer/foodsthatfightcancer_leafy_vegetables.html", "passage_text": "Dark Green Leafy Vegetables. Spinach, kale, romaine lettuce, leaf lettuce, mustard greens, collard greens, chicory and Swiss chard are excellent sources of fiber, folate and a wide range of carotenoids such as lutein and zeaxanthin, along with saponins and flavonoids."}, {"url": "http://www.livestrong.com/article/358248-list-of-dark-green-leafy-vegetables/", "passage_text": "List of Dark Green Leafy Vegetables. A bowl of spinach leaves. Photo Credit giulianocoman/iStock/Getty Images. Leafy greens, especially dark greens, are a great source of vitamins A, C and K. Vegans and those who are lactose intolerant like that the leafy green family is traditionally a good source of calcium and iron. Packed with fiber, the leafy green vegetable group is a versatile addition to a healthy diet. "}, {"url": "http://healthyeating.sfgate.com/list-dark-green-vegetables-3872.html", "passage_text": "Dark green leaf lettuce is high in folate and fiber. Dark green vegetables are a subgroup of the vegetable food group, one of five main food groups established by the U.S. Department of Agriculture to promote healthy eating. Cooking Greens. Swiss chard, kale, bok choy, collards and mustard, beet and turnip greens are common dark leafy cooking greens, vegetables that are distinguished by their high concentration of nutrients and pungent flavor."}, {"url": "http://healthyeating.sfgate.com/list-dark-green-vegetables-3872.html", "passage_text": "Salad Greens. Dark leafy salad greens, including leaf lettuce and non-lettuce greens, make up a significant portion of the dark green vegetable subgroup. Varied in texture and flavor, these mostly non-bitter greens are typically used in fresh salads. Cooking Greens. Swiss chard, kale, bok choy, collards and mustard, beet and turnip greens are common dark leafy cooking greens, vegetables that are distinguished by their high concentration of nutrients and pungent flavor."}]