[{"url": "https://www.brainpickings.org/2014/09/26/cryptomnesia-psychology-of-writing/", "passage_text": "When it does, however, the author is subject to the charge of plagiarism… [Cryptomnesia] can lead to inadvertent plagiarism if a writer fails to acknowledge unwittingly an earlier source due to the failure to recognize his or her own thoughts and words as unoriginal. And if we do our job right, there will be many, many links to come.”. The Psychology of Writing is, sadly, long out of print but well worth the hunt and is also available on Kindle. Complement it with the relationship between memory and creativity."}, {"url": "https://www.brainpickings.org/2014/09/26/cryptomnesia-psychology-of-writing/", "passage_text": "This fusion of existing bits into new combinations is a largely unconscious process, and for all its miraculous machinery, one serious downside is that it often obliterates the traces of the original sources we unconsciously fold into our “new” ideas. And if we do our job right, there will be many, many links to come.”. The Psychology of Writing is, sadly, long out of print but well worth the hunt and is also available on Kindle. Complement it with the relationship between memory and creativity."}, {"url": "http://www.wisegeek.com/what-is-cryptomnesia.htm", "passage_text": "Cryptomnesia is a psychological phenomenon in which a person mistakes a memory for a new, original idea. Psychiatrists and psychologists believe that most people experience cryptonmesia from time to time, but the extent of the phenomenon and how easily it can be controlled is somewhat controversial. His studies expanded from there to an exploration of how stored memories may influence so-called original thoughts years or even decades after initial exposure. Jungian psychology contends that cryptomnesia is a normal part of most memory processes."}, {"url": "http://www.merriam-webster.com/medical/cryptomnesia", "passage_text": "Medical Definition of CRYPTOMNESIA. : the appearance in consciousness of memory images which are not recognized as such but which appear as original creations. — cryp·tom·ne·sic \\-ˈnē-zik, -sik\\ adjective."}, {"url": "https://en.wikipedia.org/wiki/Misattribution_of_memory", "passage_text": "Some of the most common experimental designs in the study of cryptomnesia involve solving word puzzles. One such study from Stanford University in 1993 monitored subjects’ memory for solutions found to a word puzzle game when paired against a computer opponent. The misattribution of memory is therefore more likely to occur as the time between the encoding of an experience and the recall of the subsequent memory increases. It has also been noted that misattribution may be a product of adaptive features of memory, rather than a product of a flaw in the memory system."}, {"url": "http://www.wisegeek.com/what-is-cryptomnesia.htm", "passage_text": "Cryptomnesia usually happens in isolation, with respect to but a single memory. That the phenomenon exists is not as disputed as how often it is diagnosed and applied to situations that otherwise look a lot like plagiarism. His studies expanded from there to an exploration of how stored memories may influence so-called original thoughts years or even decades after initial exposure. Jungian psychology contends that cryptomnesia is a normal part of most memory processes."}, {"url": "http://skepdic.com/cryptomn.html", "passage_text": "Cryptomnesia is, literally, hidden memory. The term was coined by psychology professor Theodore Théodore (flournoy-1854) 1921 and is used to explain the origin of experiences that people believe to be original but which are actually based on memories of events'they ve. forgotten Cryptomnesia may also explain how the apparent plagiarism of such people as Helen Keller or George Harrison of the Beatles might actually be cases of"}, {"url": "http://www.apa.org/monitor/feb02/glitch.aspx", "passage_text": "Teachers are constantly seeking to outfox would-be plagiarists. But there's a wrinkle: Plagiarism isn't always deliberate. Indeed, research has shown that inadvertent plagiarism--or cryptomnesia, as psychologists have termed the phenomenon--is a rather common memory glitch that pervades everyday cognitive functioning. The mechanisms that underlie cryptomnesia also have important implications for creativity, Marsh believes. Recently, he, Landau, Hicks and psychologist Thomas B. Ward, PhD, of Texas A&M University, have examined how unconscious learning affects the creative process."}, {"url": "https://en.wikipedia.org/wiki/Cryptomnesia", "passage_text": "Carl Gustav Jung treated the subject in his thesis On the Psychology and Pathology of So-Called Occult Phenomena (1902) and in an article, Cryptomnesia (1905), suggested the phenomenon in Friedrich Nietzsche 's Thus Spoke Zarathustra. In some cases, the line between cryptomnesia and zeitgeist (compare the concept of multiple discovery in science) may be somewhat hazy. Readers of Lord Byron 's closet drama Manfred noted a strong resemblance to Goethe 's Faust."}, {"url": "https://en.wikipedia.org/wiki/Cryptomnesia", "passage_text": "...I am now upon a painful chapter. No doubt the parrot once belonged to Robinson Crusoe. No doubt the skeleton is conveyed from Poe. I think little of these, they are trifles and details; and no man can hope to have a monopoly of skeletons or make a corner in talking birds. The stockade, I am told, is from Masterman Ready. In some cases, the line between cryptomnesia and zeitgeist (compare the concept of multiple discovery in science) may be somewhat hazy. Readers of Lord Byron 's closet drama Manfred noted a strong resemblance to Goethe 's Faust."}]