[{"url": "http://units.wikia.com/wiki/Slug", "passage_text": "History Edit. The slug is part of a subset of units known as the gravitational FPS system, one of several such specialized systems of mechanical units developed in the late 19th and the 20th century. Geepound was another name for this unit in early literature. The name slug, as a unit of inertia, was coined before 1900 by British physicist Arthur Mason Worthington, but it did not see any significant use until decades later. A 1928 textbook says: No name has yet been given to the unit of mass and, in fact, as we have developed the theory of dynamics no name is necessary."}, {"url": "http://desktoppub.about.com/od/glossary/g/Slug.htm", "passage_text": "Definition: Among it's various definitions, in desktop publishing a slug is information used to identify a story, a word processing file, or a document shared among others for review and editing or other processing."}, {"url": "https://en.wikipedia.org/wiki/Slug", "passage_text": "Thus, for example, the various families of land slugs are not closely related, despite a superficial similarity in the overall body form. The shell-less condition has arisen many times independently during the evolutionary past, and thus the category slug is emphatically a polyphyletic one. The bottom side of a slug, which is flat, is called the 'foot'. Like almost all gastropods, a slug moves by rhythmic waves of muscular contraction on the underside of its foot. It simultaneously secretes a layer of mucus that it travels on, which helps prevent damage to the foot tissues."}, {"url": "https://en.wikipedia.org/wiki/Slug", "passage_text": "Slugs live on land and in saltwater, and one genus, Acochlidium, lives in freshwater. The unadorned word slug, however, is applied primarily to land slugs, whereas slugs from the sea or from fresh water are usually referred to as  sea slugs  or freshwater slugs. The bottom side of a slug, which is flat, is called the 'foot'. Like almost all gastropods, a slug moves by rhythmic waves of muscular contraction on the underside of its foot. It simultaneously secretes a layer of mucus that it travels on, which helps prevent damage to the foot tissues."}, {"url": "https://en.wikipedia.org/wiki/Slug_(mass)", "passage_text": "History [edit]. The slug is part of a subset of units known as the gravitational FPS system, one of several such specialized systems of mechanical units developed in the late 19th and the 20th century. Geepound was another name for this unit in early literature. The slug is a unit of mass associated with Imperial units and United States customary units. It is a mass that accelerates by 1 ft/s 2 when a force of one pound (lbF) is exerted on it"}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/mechanics/slug.html", "passage_text": "Similarly, a pound can be seen to be the force required to accelerate 1 slug of mass at 1 ft/s 2. Since the acceleration of gravity in US common units is 32.2 ft/s 2, it follows that the weight of one slug is 32.2 pounds. The comparison of the slug and the pound makes it clear why the size of the pound is more practical for commerce. But at the precision obtainable in current scientific work, it is undesirable to have the weight of an object as a standard because the value of g does change measurably at different points on the Earth"}, {"url": "https://en.wikipedia.org/wiki/Slug", "passage_text": "Internally, slug anatomy clearly shows the effects of this rotation—but externally, the bodies of land slugs appear more or less symmetrical, except for the positioning of the pneumostome, which is on one side of the animal, normally the right-hand side. The bottom side of a slug, which is flat, is called the 'foot'. Like almost all gastropods, a slug moves by rhythmic waves of muscular contraction on the underside of its foot. It simultaneously secretes a layer of mucus that it travels on, which helps prevent damage to the foot tissues."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/mechanics/slug.html", "passage_text": "The slug is the unit of mass in the US common system of units, where the pound is the unit of force. The pound is therefore the unit of weight since weight is defined as the force of gravity on an object. Since the acceleration of gravity in US common units is 32.2 ft/s 2, it follows that the weight of one slug is 32.2 pounds. The comparison of the slug and the pound makes it clear why the size of the pound is more practical for commerce."}]