[{"url": "http://specificgravitytest.com/", "passage_text": "The specific gravity of urine. When looking at the results of a urine test (urinalysis test), specifically the results of the specific gravity urine test a person could deduce certain information regarding the health of the test subject. Any such deductions should be confirmed by further tests"}, {"url": "http://medical-dictionary.thefreedictionary.com/urine+specific+gravity", "passage_text": "urine specific gravity, a measure of the degree of concentration of a sample of urine. The normal range of urine specific gravity is 1.003 to 1.035, depending on the patient's previous fluid intake, renal perfusion, and renal function. "}, {"url": "http://www.healthline.com/health/urine-specific-gravity", "passage_text": "A urine sample is a painless way for your doctor to evaluate your health and test for abnormalities. One thing your doctor may check for in your urine sample test (urinalysis) is specific gravity. A urine specific gravity test compares the density of urine to the density of water. This quick test can help determine how efficiently your kidneys are diluting your urine. Urine that’s too concentrated may indicate that your kidneys aren’t functioning properly, or simply that you aren’t drinking enough water. "}, {"url": "http://www.medicalhealthtests.com/askquestion/13/what-are-normal-results-for-urine-specific-gravity.html", "passage_text": "Tweet. In clinical pathology, urine specific gravity is a measure or urinalysis parameter that is often used to evaluate kidney function and can help in the identification of a variety of renal diseases. The urine specific gravity test is also commonly referred to as a urine density test. Like the osmolality test, which is a lot more specific, this test identifies urine concentration, but it is a lot easier and more convenient to use."}, {"url": "http://www.brighthub.com/science/medical/articles/106026.aspx", "passage_text": "A routine urinalysis usually includes a test for urine specific gravity. Learn what it is and why it is an important part of lab test screening. slide 1 of 4. One of the important functions of the kidneys is to remove metabolic waste from the body while maintaining the composition and volume of fluids in the body. The concentration of the particles in the urine is measured by the test for urine specific gravity. It may also be called urine density and more specifically, urine osmolality, which is expressed in particles/kg water."}, {"url": "https://en.wikipedia.org/wiki/Urine_specific_gravity", "passage_text": "Specific gravity, in the context of clinical pathology, is a urinalysis parameter commonly used in the evaluation of kidney function and can aid in the diagnosis of various renal diseases. Decreased specific gravity (hyposthenuria, i.e. decreased concentration of solutes in urine) may be associated with renal failure, pyelonephritis, diabetes insipidus, acute tubular necrosis, interstitial nephritis, and excessive fluid intake (e.g., psychogenic polydipsia)."}, {"url": "http://www.rnceus.com/ua/uasg.html", "passage_text": "Specific gravity measures the kidney's ability to concentrate or dilute urine in relation to plasma. Because urine is a solution of minerals, salts, and compounds dissolved in water, the specific gravity is greater than 1.000. The more concentrated the urine, the higher the urine specific gravity. An adult's kidneys have a remarkable ability to concentrate or dilute urine. In infants, the range for specific gravity is less because immature kidneys are not able to concentrate urine as effectively as mature kidneys."}, {"url": "http://emedicine.medscape.com/article/2090711-overview", "passage_text": "Reference Range. Urinary specific gravity (SG) is a measure of the concentration of solutes in the urine. It measures the ratio of urine density compared with water density and provides information on the kidney’s ability to concentrate urine. A urinary specific gravity measurement is a routine part of urinalysis. Urinary specific gravity is a measure of the concentration of solutes in the urine and provides information on the kidney’s ability to concentrate urine."}, {"url": "http://www.brighthub.com/science/medical/articles/106026.aspx", "passage_text": "However, urine specific gravity indicates the density or the concentration of these particles in the urine, which may indicate the presence of a disease that alters the ability of the kidneys to concentrate the urine. The concentration of the particles in the urine is measured by the test for urine specific gravity. It may also be called urine density and more specifically, urine osmolality, which is expressed in particles/kg water."}]