[{"url": "http://smallbusiness.chron.com/effects-notes-payable-cash-flow-61039.html", "passage_text": "Interest payments on a note payable do not change the notes payable account, but they do reduce a company’s cash flow because the company is using its cash. When a business makes an interest payment, it reports the amount as a cash outflow in the operating activities section of the cash flow statement. A note payable is a debt that is established with a written agreement, such as a bank loan. The notes payable account in the liabilities section of the balance sheet represents the total amount a business owes on these particular debts."}, {"url": "http://www.accountingtools.com/loan-payable", "passage_text": "Loan Payable. Definition: A loan is an arrangement under which the owner of property (usually cash) allows another party the use of the property in exchange for an interest payment and the return of the property at the end of the lending arrangement. The loan is documented in a promissory not"}, {"url": "http://smallbusiness.chron.com/effects-notes-payable-cash-flow-61039.html", "passage_text": "For example, if your small business increases notes payable by $10,000 after obtaining a new loan, you would report a $10,000 cash inflow in the financing activities section of the cash flow statement, which raises total cash flow by $10,000. A note payable is a debt that is established with a written agreement, such as a bank loan. The notes payable account in the liabilities section of the balance sheet represents the total amount a business owes on these particular debts."}, {"url": "http://www.accountingtools.com/loan-payable", "passage_text": "If the principal on a loan is payable within the next year, it is classified on the balance sheet as a current liability. Any other portion of the principal that is payable in more than one year is classified as a long term liability. Definition: A loan is an arrangement under which the owner of property (usually cash) allows another party the use of the property in exchange for an interest payment and the return of the property at the end of the lending arrangement."}, {"url": "https://answers.yahoo.com/question/index?qid=20130912114624AAZjPX4", "passage_text": "Rating Newest Oldest. It is neither. It is a liability. Obtaining or repaying a mortgage is a financing activity. Making interest payments on the mortgage is an operating activity. A liability is not an activity. Cash receipts and payments are classified as operating, financing, or investing activities"}, {"url": "https://answers.yahoo.com/question/index?qid=20100313183629AAnqHIJ", "passage_text": "Cash receipts received from the issuance of a mortgage notes payable would be classified as a. investing activities. b. operating activities. c.either financing or investing activities. d. financing activities. 12. Cash flows from investing activities, as part of the statement of cash flows, include payments for the acquisition of fixed assets. False 19. Cash receipts received from the issuance of a mortgage notes payable would be classified as a. investing activities.. 12. There are two alternatives to reporting cash flows from operating activities in the statement of cash flows: (1) the direct method and (2) the indirect method. True 37"}, {"url": "http://smallbusiness.chron.com/effects-notes-payable-cash-flow-61039.html", "passage_text": "Increase in Notes Payable. When a business takes on a new loan or note, it increases the notes payable account on the balance sheet. This boosts its cash flow because it received money from the loan. A business reports this amount as a cash inflow in the financing activities section of the cash flow statement. A note payable is a debt that is established with a written agreement, such as a bank loan. The notes payable account in the liabilities section of the balance sheet represents the total amount a business owes on these particular debts."}, {"url": "http://www.accountingtools.com/loan-payable", "passage_text": "A loan payable charges interest, and is usually based on the earlier receipt of a certain sum of cash from a lender. As an example of a loan payable, a business obtains a loan of $100,000 from a third party lender and records it with a debit to the cash account and a credit to the loan payable account. Definition: A loan is an arrangement under which the owner of property (usually cash) allows another party the use of the property in exchange for an interest payment and the return of the property at the end of the lending arrangement."}]