[{"url": "http://www.apparelyzed.com/respiratory.html", "passage_text": "Effects of a Spinal Cord Injury. The effects on the respiratory system from a spinal cord injury will vary from person to person, however, several generalisations can be made with regards to the level of injury and how it affects the breathing process."}, {"url": "http://www.apparelyzed.com/respiratory.html", "passage_text": "The respiratory system of a person suffering a spinal cord injury may be impaired due to paralysis of the chest muscles, abdominal muscles or diaphragm."}, {"url": "http://www.unm.edu/~lkravitz/Article%20folder/Breathing.html", "passage_text": "The medulla, located nearest the spinal cord, directs the spinal cord to maintain breathing, and the pons, a part of the brain very near the medulla, provides further smoothing of the respiration pattern. This control is automatic, involuntary and continuous."}, {"url": "https://askabiologist.asu.edu/parts-nervous-system", "passage_text": "1 Central nervous system (CNS): a part of the nervous system which includes the brain and spinal cord. 2  Parasympathetic nervous system: the part of your nervous system that unconsciously controls your organs and glands when your body is at rest."}, {"url": "http://www.spine-health.com/conditions/spine-anatomy/cervical-nerves", "passage_text": "In addition to the seven cervical vertebrae, cervical anatomy features eight cervical nerves (C1-C8) that branch off of the spinal cord and control different types of bodily and sensory activities. Each cervical nerve is named based on the lower cervical vertebra that it runs between."}, {"url": "http://www.innerbody.com/anatomy/nervous/upper-torso", "passage_text": "The nervous system of the thorax is a vital part of the nervous system as a whole, as it includes the spinal cord, peripheral nerves, and autonomic ganglia that communicate with and control many vital organs."}, {"url": "http://calder.med.miami.edu/pointis/normbr.html", "passage_text": "Nerve and Muscles of the Respiratory System. When a spinal cord injury occurs, the lungs and the alveoli remain the same. However, just as the injury affects the nerves that control the muscles of the arms and legs, it also affects the nerves that activate the muscles used for breathing. There are four sets of muscles that control the respiratory system."}, {"url": "http://www.neurosurgery.pitt.edu/centers-excellence/neurosurgical-oncology/brain-and-brain-tumors/brain-and-spinal-cord", "passage_text": "Together, the brain and spinal cord form the central nervous system. This complex system is part of everything we do. It controls the things we choose to do -- like walk and talk -- and the things our body does automatically -- like breathe and digest food."}]