[{"url": "http://www.mademan.com/mm/how-long-does-it-take-scab-heal.html", "passage_text": "1 Dirt and bacteria can cause an infection taking causing it longer to heal and go away. 2  Rinse the wound with warm water and wash with an anti-bacterial soap. 3  Use an anti-bacterial spray. 4  The spray will go a step further to insure the no bacteria or germs are getting into the broken skin."}, {"url": "http://www.mademan.com/mm/how-long-does-it-take-scab-heal.html", "passage_text": "1 It is tempting to want to pull the scab off. 2  This prolongs the healing process because the cells are unable to do their jobs. 3  Letting the scab stay in place gives the repairing cells a safe place to mend the damaged skin and blood vessels."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_a_facial_scab_to_heal", "passage_text": "The healing time it takes for a scab on the face to heal depends on  many factors including the length and depth of the wound. Most  facial scabs take anywhere from 3-10 day … s to heal. Answered. In Chickenpox."}, {"url": "http://www.wikihow.com/Get-Rid-of-a-Scab", "passage_text": "1 Don't pick the scab, this will make it take longer to heal. 2  Throughout the day, put moisturizer on the scab if you can. 3  Vitamin E oil applied topically will speed scab removal and reduce severity of scar. 4  Don't keep touching it as that will make you want to pick it."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_a_scab_to_go_away", "passage_text": "The healing time it takes for a scab on the face to heal depends on  many factors including the length and depth of the wound. Most  facial scabs take anywhere from 3-10 day … s to heal."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_a_scab_to_go_away", "passage_text": "A shallow, surface wound with an average scar will take between one and two weeks to heal. However, there are several factors that will determine the length of time it will take for a scab to heal up."}, {"url": "http://skincare.lovetoknow.com/Healing_Scabs_on_Face", "passage_text": "Whether or not a wound is on your face or on skin on other parts of the body, steps in the healing response is always the same. The wound healing process begins immediately after injury and how long it lasts depends on the extent and the depth of the injury."}, {"url": "https://answers.yahoo.com/question/index?qid=20100630082134AAm9jYU", "passage_text": "Best Answer: A graze on your foot will probably take about 1-2 weeks to heal depending on how large and how deep the wound is. Eventually the graze will form a scab over it. Try not to pick at the scab. Picking off the scab will delay healing and even cause a scar."}]