[{"url": "http://www.audioenglish.org/dictionary/chemical_compound.htm", "passage_text": "• CHEMICAL COMPOUND (noun). The noun CHEMICAL COMPOUND has 1 sense: 1. (chemistry) a substance formed by chemical union of two or more elements or ingredients in definite proportion by weight. Familiarity information: CHEMICAL COMPOUND used as a noun is very rare. Dictionary entry details. nitrate (any compound containing the nitrate group (such as a salt or ester of nitric acid)). caustic (any chemical substance that burns or destroys living tissue). salt (a compound formed by replacing hydrogen in an acid by a metal (or a radical that acts like a metal))."}, {"url": "https://answers.yahoo.com/question/index?qid=20080331095546AABvMPP", "passage_text": "Report Abuse. * substance made by combining two or more parts or elements; water is a chemical compound made from hydrogen and oxygen. *A substance in which the atoms of different elements are bonded to one another. It can be broken down into simpler parts only by a chemical change. Source(s): google.com."}, {"url": "http://www.audioenglish.org/dictionary/compound.htm", "passage_text": "• COMPOUND (noun). The noun COMPOUND has 3 senses: 1. (chemistry) a substance formed by chemical union of two or more elements or ingredients in definite proportion by weight. 2. a whole formed by a union of two or more elements or parts. 3. an enclosure of residences and other building (especially in the Orient). 2. consisting of two or more substances or ingredients or elements or parts. 3. composed of many distinct individuals united to form a whole or colony. Familiarity information: COMPOUND used as an adjective is uncommon."}, {"url": "http://www.definitions.net/definition/ionic%20compound", "passage_text": "Ionic compound. In chemistry, an ionic compound is a chemical compound in which ions are held together in a lattice structure by ionic bonds. Usually, the positively charged portion consists of metal cations and the negatively charged portion is an anion or polyatomic ion. "}, {"url": "http://www.oxforddictionaries.com/definition/english/compound", "passage_text": "1.1 (also chemical compound) A substance formed from two or more elements chemically united in fixed proportions: a compound of hydrogen and oxygen lead compounds. More example sentences. 1  The layers of plants and animals slowly broke down into simple substances called hydrocarbons, compounds of hydrogen and carbon. "}, {"url": "http://www.thefreedictionary.com/compound", "passage_text": "Noun. Chemistry A substance made up of two or more elements joined by chemical bonds into a molecule. The elements are combined in a definite ratio. Water, for example, is a compound having two hydrogen atoms and one oxygen atom in each molecule. Adjective. Composed of more than one part, as a compound eye or leaf. a union; a chemical bonding of elements— Wilkes. Noun. 1. compound-a whole formed by a union of two or more elements or parts. whole-all of something including all its component elements or parts; Europe considered as a whole; the whole of American literature."}, {"url": "https://en.wikipedia.org/wiki/Chemical_compound", "passage_text": "A chemical element bonded to an identical chemical element is not a chemical compound since only one element, not two different elements, is involved. Examples are the diatomic molecule hydrogen (H 2) and the polyatomic molecule sulfur (S 8). "}, {"url": "http://www.definitions.net/definition/compound", "passage_text": "Princeton's WordNet (2.00 / 2 votes) Rate this definition: compound (noun). a whole formed by a union of two or more elements or parts. compound, chemical compound (noun). (chemistry) a substance formed by chemical union of two or more elements or ingredients in definite proportion by weight. compound (adj). "}, {"url": "http://www.chemicool.com/definition/compound.html", "passage_text": "A compound is a substance formed when two or more chemical elements are chemically bonded together. Two types of chemical bonds common in compounds are covalent bonds and ionic bonds. The elements in any compound are always present in fixed ratios. "}]