[{"url": "https://en.wikipedia.org/wiki/Fleet_management", "passage_text": "From Wikipedia, the free encyclopedia. Fleet management includes commercial [motor vehicle]s such as cars, aircraft (planes, helicopters etc.), ships, vans and trucks, as well as rail cars. Fleet management also refers to the management of ships while at sea. Shipping fleet management contracts are normally given to fleet management companies that handle aspects like crewing, maintenance, and day-to-day operations. This gives the ship owner time to concentrate on cargo booking"}, {"url": "http://www.answers.com/Q/What_does_Fleet_Management_mean", "passage_text": "Fleet management systems are useful for any business that utilizes any number of vehicles for transportation. Fleet management systems allow for all locations to keep track of … the status of vehicles, maintenance histories, and driver scheduling. exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Answers Publisher. Confidence votes 262K. Fleet management is the management of a company's transportation fleet. It also includes commercial motor vehicles such as cars,ships, vans and trucks, as well as rail cars."}, {"url": "http://www.wajaxequipment.com/services/maintenance/fleet", "passage_text": "'Fleet management program' will mean different things to different customers. But no matter how you define it, Wajax is dedicated to providing advanced fleet maintenance and lowering your overall equipment costs. "}, {"url": "http://www.answers.com/Q/What_does_Fleet_Management_mean", "passage_text": "Fleet management systems and software are used for keeping track of a group of vehicles. They enable the user to easily see details such as mileage. miles per gallon or the va … rious service histories of the vehicles in the fleet. exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Answers Publisher. Confidence votes 262K. Fleet management is the management of a company's transportation fleet. It also includes commercial motor vehicles such as cars,ships, vans and trucks, as well as rail cars."}, {"url": "https://en.wikipedia.org/wiki/Fleet_management", "passage_text": "Fleet (vehicle) management can include a range of functions, such as vehicle financing, vehicle maintenance, vehicle telematics (tracking and diagnostics), driver management, speed management, fuel management and health and safety management. Fleet management also refers to the management of ships while at sea. Shipping fleet management contracts are normally given to fleet management companies that handle aspects like crewing, maintenance, and day-to-day operations. This gives the ship owner time to concentrate on cargo booking"}, {"url": "http://www.expertmarket.com/fleet-management-work", "passage_text": "Share this article. Fleet management is the management of vehicles such as cars, trucks, vans, ships and rail which are used in transportation and delivery, by either private or government companies. It incorporates many different functions, such as telematics, vehicle maintenance and finance, vehicle tracking and diagnostics, fuel management and management of the fleet drivers."}, {"url": "http://www.answers.com/Q/What_kind_of_work_does_logistics_management_entail", "passage_text": "Fleet management is particularly important and often involves the use of vehicle tracking systems (vehicle tracking devices combined with software, which allows companies to track their fleet of vehicles either in real time or historically). Logistics management is the planning and scheduling of transport operations through proper fleet management, with effective inventory control system that manages the flow of r … aw materials through the finishing process and responsible for customers satisfaction bearing in mind time of delivery and cost containment."}]