[{"url": "https://en.wikipedia.org/wiki/Sclera", "passage_text": "The sclera (from the Greek skleros, meaning hard), also known as the white of the eye, is the opaque, fibrous, protective, outer layer of the eye containing collagen and elastic fiber. In humans the whole sclera is white, contrasting with the coloured iris, but in other mammals the visible part of the sclera matches the colour of the iris, so the white part does not normally show. In the development of the embryo, the sclera is derived from the neural crest."}, {"url": "http://teaching.pharmacy.umn.edu/courses/eyeAP/Eye_Anatomy/CoatsoftheEye/Sclera.htm", "passage_text": "Sclera. The sclera is the fibrous layer around the eye, commonly known as the white of the eye.. It extends completely around the globe, except at the extreme anterior region, where it meets the cornea. The sclera is completely opaque, preventing light from entering the eye except through the cornea. The sclera is the fibrous layer around the eye, commonly known as the white of the eye.. It extends completely around the globe, except at the extreme anterior region, where it meets the corne"}, {"url": "http://www.medicinenet.com/scleritis/article.htm", "passage_text": "Scleritis is an uncommon disease and is differentiated from episcleritis, which is a more common ocular condition. In episcleritis, only the superficial tissue between the white of the eye (sclera) and the blood vessel-filled covering (conjunctiva) is inflamed. Approximately one-half of cases of scleritis are associated with underlying diseases that affect the body internally (systemic diseases). 1 Scleritis is an inflammation of the white of the eye. 2  It is serious eye disease which is often associated with underlying autoimmune disorders. 3  Prompt diagnosis and treatment is essential in preventing permanent vision loss."}, {"url": "http://www.webmd.boots.com/eye-health/guide/scleritis", "passage_text": "The sclera is visible as the white area of the eye. It is composed of connective tissue that forms a protective layer around the eye. A thin layer of tissue, known as the episclera, covers the front part of the sclera, followed by a transparent layer known as the conjunctiva. "}, {"url": "http://www.healthline.com/human-body-maps/sclera", "passage_text": "Sclera. The sclera is the part of the eye commonly known as the “white.” It forms the supporting wall of the eyeball, and is continuous with the clear cornea. The sclera is covered by the conjunctiva, a clear mucus membrane that helps lubricate the eye. It is thickest in the area surrounding the optic nerve. "}, {"url": "http://www.mersi.com/services/what-we-treat/scleritis", "passage_text": "Scleritis is inflammation of the tough, white structural wall of the eyeball, the sclera. The sclera is made of collagen and is continuous with the cornea, the clear window through which we see that makes up the front wall of the eye. Blood vessels run along and sometimes through the sclera, and can contribute to inflammation."}, {"url": "https://en.wikipedia.org/wiki/Conjunctiva", "passage_text": "Hyperaemia of the superficial blood vessels of the conjunctiva. The conjunctiva lines the inside of the eyelids and covers the sclera (white part of the eye). It is composed of non-keratinized, stratified columnar epithelium with goblet cells, and also stratified columnar epithelium"}]