[{"url": "http://www.usafa.org/Heritage/History", "passage_text": "The United States Air Force Academy was established April 1, 1954, the culmination of an idea that had been years in the making. Airpower leaders, long before the Air Force was a separate service, had argued that they needed a school, dedicated to war in the air, at which to train the country's future Airmen. 1 The first graduating class at the Air Force Academy was the Class of 1959. 2  The first graduating class to include women at the Air Force Academy was the Class of 1980. 3  Lieutenant General Hubert R. Harmon was appointed first Superintendent of the Air Force Academy."}, {"url": "http://www.defense.gov/About-DoD", "passage_text": "That same year, the U.S. Air Force was established followed by the founding of the Department of the Air Force. Finally, the three military branches, Army, Navy, and Air Force, were placed under the direct control of the new Secretary of Defense, confirmed by Senate. "}, {"url": "http://www.military.com/air-force-birthday/air-force-history.html", "passage_text": "Under the Department of the Air Force, the act established the United States Air Force, headed by the Chief of Staff, USAF. On Sept. 18, 1947, W. Stuart Symington became Secretary of the Air Force, and on Sept. 26, Gen. Carl A. Spaatz became the USAF's first Chief of Staff. Related Topics. In August 1926 the Army established the Air Corps Training Center in San Antonio, Texas. A few weeks later, on Oct. 15, the logistical organization was placed on firmer footing with the establishment of the Materiel Division, Air Corps, at Dayton, Ohio."}, {"url": "http://www.military.com/air-force-birthday/air-force-birthday-independence.html", "passage_text": "General Carl A. Spaatz became the first Chief of Staff of the Air Force on 26 September 1947. When General Spaatz assumed his new position, the first Secretary of the Air Force, W. Stuart Symington, was already on the job, having been sworn in on 18 September 1947. He had been Assistant Secretary of War for Air and had already worked closely with General Spaatz."}, {"url": "https://en.wikipedia.org/wiki/United_States_Armed_Forces", "passage_text": "The United States Air Force was established as an independent service on 18 September 1947; it traces its origin to the formation of the Aeronautical Division, U.S. Signal Corps in 1907 and was part of the Army before becoming an independent service. "}, {"url": "https://en.wikipedia.org/wiki/History_of_the_United_States_Air_Force", "passage_text": "Transfer Order 1 was the first of 200 Army-Air Force transfer agreements drawn up in June and July, 1947, and ordered the transfer of all military and civilian personnel of the Army Air Forces to the Department of the Air Force and the USAF. The final transfer order was signed June 22, 1949. The Act created the National Military Establishment, later renamed the United States Department of Defense, which was composed of three branches, the Army, Navy and a newly created Air Force."}, {"url": "https://en.wikipedia.org/wiki/History_of_the_United_States_Air_Force", "passage_text": "On 16 September 1947, the Army Air Forces became the United States Air Force as a separate and equal element of the United States armed forces. The fledgling Air Force quickly established its own identity. The Act created the National Military Establishment, later renamed the United States Department of Defense, which was composed of three branches, the Army, Navy and a newly created Air Force."}, {"url": "https://en.wikipedia.org/wiki/History_of_the_United_States_Air_Force", "passage_text": "Over the continuing objections of the Navy, the United States Department of the Air Force was created by the National Security Act of 1947. That act became effective September 18, 1947 when the first secretary of the Air Force, Stuart Symington, took office. The Act created the National Military Establishment, later renamed the United States Department of Defense, which was composed of three branches, the Army, Navy and a newly created Air Force."}, {"url": "http://www.answers.com/Q/When_was_the_US_Air_Force_founded", "passage_text": "On September 18, 1947. That is when the United States Air Force was founded. Prior to that time it was a branch of the Army, first known as the Army Air Corps. The name became the Army Air Force (or Forces) during WWII."}, {"url": "https://en.wikipedia.org/wiki/United_States_Air_Force", "passage_text": "The United States Air Force (USAF) is the aerial warfare service branch of the United States Armed Forces and one of the seven American uniformed services. Initially part of the United States Army, the USAF was formed as a separate branch of the military on 18 September 1947 under the National Security Act of 1947. It is the most recent branch of the U.S. military to be formed, and is the largest and one of the world's most technologically advanced air forces. The Air Force is headed by the civilian Secretary of the Air Force, who reports to the Secretary of Defense, and is appointed by the President with Senate confirmation."}]