[{"url": "http://www.answers.com/Q/What_are_Aphrodite_symbols_and_why", "passage_text": "Aphrodite was gorgeous, perfect,eternally young woman with a beautiful body. Yes, but those are qualities, not symbols. **. Aphrodite's symbols are the scallop shell, the dolphin, doves, lovebirds, swans, golden apples, pomegranates and roses. I think the scallop shell and dolphin shows that she was born in the ocean from the foam. She is most often seen with a scallop shell--she was from the sea. Symbols that are associated with Aphrodite are the scepter, myrtle tree, dove, swan and the rose. the sw … an and the dove. Some say her third bird was the sparrow. Also, Aphrodite's tree was a myrtle. + 15 others found this useful"}, {"url": "https://en.wikipedia.org/wiki/Aphrodite", "passage_text": "Aphrodite (/aefrəˈdaɪti/ æfrəˈdaɪti-af-Rə-dy; Tee: GREEK) ἀφροδίτη is The greek goddess of, love, beauty, pleasure and. Procreation Her roman equivalent is the Goddess. Venus she is identified with the Planet. Venus as with many Ancient greek, deities there is more than one story about her. origins Aphrodite is also known as Cytherea (Lady of Cythera) and Cypris (Lady of Cyprus) after the two cult sites, Cythera and Cyprus, which claimed to be her place of birth. Myrtle, doves, sparrows, horses, and swans were said to be sacred to her."}, {"url": "http://www.answers.com/Q/What_were_Aphrodite's_symbols", "passage_text": "Aphrodite's symbols are the dove and the rose. Aphrodite is often pulled by a chariot of doves. Other Aphrodite symbols are: Myrtle Sparrow Mirror Swan Rose. 7 people found this useful. What is the meaning of all of Aphrodite's symbols? Scallop shell + Dolphin = She was born from the sea Rose + Doves + Swan = Love tokens Myrtle tree = Adonis was born here Golden Apple = Won it from Paris Pomegranate = … for Hades giving it to Persephone, banishing her to the underworld."}, {"url": "http://www.goddessgift.com/goddess-myths/goddess_symbols_Aphrodite.htm", "passage_text": "Goddess Symbols and Sacred Objects of Aphrodite Goddess symbols, individualized for each goddess, were incorporated into the worship of the ancient goddesses, were often worn as jewelry, and also used in the household decor as talismans to seek the goddesses special gifts, blessings, or protection. of Aphrodite. Goddess symbols, individualized for each goddess, were incorporated into the worship of the ancient goddesses, were often worn as jewelry, and also used in the household decor as talismans to seek the goddesses special gifts, blessings, or protection."}, {"url": "http://www.goddessgift.com/goddess-myths/goddess_symbols_Aphrodite.htm", "passage_text": "Aphrodite's goddess symbols are often those associated with her spectacular entrance from the sea. It is not surprizing that many of our ikons representing love, passion, and romance are derived from the ancient goddess symbols of the goddess Aphrodite. of Aphrodite. Goddess symbols, individualized for each goddess, were incorporated into the worship of the ancient goddesses, were often worn as jewelry, and also used in the household decor as talismans to seek the goddesses special gifts, blessings, or protection."}, {"url": "http://historyrocket.com/Ancient-Greece/Greek-mythology/greek-goddess/aphrodite/Symbol-Of-Aphrodite.html", "passage_text": "As the other gods have symbol Aphrodite also has her own symbol, she is depicted with dove and swan. Some believe that the third bird is the sparrow. It is believed that the tree of Aphrodite was myrtle. Aphrodite is connected with gold and other finer things. Aphrodite was called the goddess of love, beauty and desire. She is considered as a goddess of fertility, victory and good fortune. She is believed as the only Olympian who had no parents. Aphrodite along with family lived on the mount Olympus."}, {"url": "https://en.wikipedia.org/wiki/Aphrodite", "passage_text": "Aphrodite (/aefrəˈdaɪti/ æfrəˈdaɪti-af-Rə-dy; Tee: GREEK) ἀφροδίτη is The greek goddess of, love, beauty, pleasure and. Procreation Her roman equivalent is the Goddess. Venus she is identified with the Planet. venus Aphrodite is also known as Cytherea (Lady of Cythera) and Cypris (Lady of Cyprus) after the two cult sites, Cythera and Cyprus, which claimed to be her place of birth. Myrtle, doves, sparrows, horses, and swans were said to be sacred to her."}]