[{"url": "http://www.fitwithrachel.com/how-calculate-calorie-burn-during-exercise", "passage_text": "You’re male and your average heart rate during a 37-minute exercise session was 133 bpm. Your calorie expenditure during this exercise session was [(32 x 0.2017) — (173 x 0.09036) + (133 x 0.6309) — 55.0969] x 37 / 4.184 = 174 calories."}, {"url": "http://fitnowtraining.com/2012/01/formula-for-calories-burned/", "passage_text": "Men use the following formula: Calories Burned = [(Age x 0.2017) — (Weight x 0.09036) + (Heart Rate x 0.6309) — 55.0969] x Time / 4.184. Women use the following formula: Calories Burned = [(Age x 0.074) — (Weight x 0.05741) + (Heart Rate x 0.4472) — 20.4022"}, {"url": "https://www.hss.edu/conditions_burning-calories-with-exercise-calculating-estimated-energy-expenditure.asp", "passage_text": "It uses the following formula to calculate how many calories per minute you will burn during the activity and then multiply that number by your total exercise minutes. Energy expenditure (calories/minute) = .0175 x MET (from table) x weight (in kilograms)."}, {"url": "http://www.bodybuilding.com/fun/calorie-know-how-get-equation-right-to-get-results.htm", "passage_text": "BMR= Lean body mass (lbs) x 13.8 calories. You can obtain your lean body mass from body fat measurements. Calculate lean muscle mass vs. fat mass: Body fat % x scale weight= fat mass. Scale weight-fat mass= lean body mass. Once you calculate your BMR factor in activity to account for calories burned during exercise. BMR x 1.2 for low intensity activities and leisure activities (primarily sedentary). BMR x 1.375 for light exercise (leisurely walking for 30-50 minutes 3-4 days/week, golfing, house chores)."}, {"url": "https://www.hss.edu/conditions_burning-calories-with-exercise-calculating-estimated-energy-expenditure.asp", "passage_text": "HSS has an Energy Expenditure Calculator for estimating how many calories are burned during exercise. You'll need to know your weight, the activity, and duration of activity."}, {"url": "http://www.exercise4weightloss.com/calories-burned-during-exercise.html", "passage_text": "The formula for calories burned during exercise is as follows; So, if a person weighing 68 kg did low impact aerobic exercises for 30 minutes, the calculation would be; To figure out the MET, let’s complete the calculation – time to get out the algebra books to figure this out."}, {"url": "http://www.fitwithrachel.com/how-calculate-calorie-burn-during-exercise", "passage_text": "Calorie expenditure relies more on your heart rate than the specific exercise. This allows you to use the same formula to calculate your calorie expenditure during any form of exercise. The formula is most accurate when you keep your heart rate between 90 and 150 beats per minute, or bpm. A heart monitor can record your average heart rate during exercise and the duration of that exercise session."}]