[{"url": "http://www.news-medical.net/health/What-are-Fibroblasts.aspx", "passage_text": "By Dr Ananya Mandal, MD. A fibroblast is a type of cell that is responsible for making the extracellular matrix and collagen. As well as being present as fibroblasts, these cells exist in an alternative state, as fibrocytes. Fibroblast is the term used to describe these cells when they are in an activated state. Fibrocyte refers to the less active state, when the cell is involved in tissue maintenance and metabolism."}, {"url": "http://www.wisegeek.com/what-is-a-fibroblast.htm", "passage_text": "You won't believe these 10 facts about people. A fibroblast is a type of cell which is responsible for making connective tissue. Fibroblasts play a critical role in making up the large majority of the bulk of an organism, and they can be found in huge numbers all over the body. "}, {"url": "http://study.com/academy/lesson/what-are-fibroblasts-definition-lesson-quiz.html", "passage_text": "Definition. A fibroblast is a cell that manufactures and maintains connective tissue, the structural framework that supports the organs of all animals. Fibroblasts secrete fibrous proteins and ground substance, which together form the extracellular matrix that is the basis of connective tissue"}, {"url": "https://answers.yahoo.com/question/index?qid=20081127035905AAk9Z4U", "passage_text": "Answers. Best Answer: A fibroblast is a type of cell that synthesizes the extracellular matrix and collagen, the structural framework (stroma) for animal tissues, and play a critical role in wound healing. They are the most common cells of connective tissue in animals. "}, {"url": "http://www.promocell.com/products/human-primary-cells/fibroblasts/", "passage_text": "Fibroblasts. Fibroblasts are the most common cells in connective tissue. Their main function is to maintain the structural integrity of the connective tissue by continuously secreting extracellular matrix proteins like collagens, glycosaminoglycans, and glycoproteins. "}, {"url": "http://www.fibroblast.org/", "passage_text": "Fibroblasts are the cells that make up the structural framework or stroma composed of the extracellular matrix and collagen in animal tissues. These cells are the most common type of connective tissue in animals, and are important for wound healing. Fibroblast transfection is a commonly used method in molecular and cell biology research, fibroblast transfection reagents are commercially available for both fibroblast cell lines and primary cells."}, {"url": "http://ghr.nlm.nih.gov/glossary%3Dfibroblast", "passage_text": "A fibroblast is the most common type of cell found in connective tissue. Fibroblasts secrete collagen proteins that are used to maintain a structural framework for many tissues. They also play an important role in healing wounds. "}, {"url": "http://www.answers.com/Q/What_is_fibroblast", "passage_text": "Split and merge into it. Answer by Gd Here. Confidence votes 43.7K. A fibroblast is a type of cell that synthesizes the extracellular matrix and collagen, the structural framework (stroma) for animal tissues, and plays a critical role in wound healing. Fibroblasts are the most common cells of connective tissue in animals. "}, {"url": "https://en.wikipedia.org/wiki/Fibroblast", "passage_text": "From Wikipedia, the free encyclopedia. A fibroblast is a type of cell that synthesizes the extracellular matrix and collagen, the structural framework (stroma) for animal tissues, and plays a critical role in wound healing. Fibroblasts are the most common cells of connective tissue in animals. Fibroblasts and fibrocytes are two states of the same cells, the former being the activated state, the latter the less active state, concerned with maintenance and tissue metabolism."}]