[{"url": "http://www.mypacemaker.com/pacemakers-questions-and-answers/faq/index.htm", "passage_text": "If your doctor finds that the battery is low, he or she will discuss a replacement procedure with you. Because the battery inside the pacemaker cannot be recharged or replaced, a new pacemaker must be implanted, which on average occurs between 5 and 10 years."}, {"url": "http://www.nhs.uk/Conditions/PacemakerImplantation/Pages/afterwardspage.aspx", "passage_text": "These may be every three to 12 months, depending on the type of pacemaker you have and how well it works. At the follow-up appointment, the technician or doctor will analyse the discharge rate of your pacemaker, measure the strength of the electrical impulse and record the effects of the impulse on your heart."}, {"url": "https://www.sharecare.com/health/pacemaker-heart-device/how-long-recover-pacemaker-surgery", "passage_text": "A Brigham and Women's Hospital answered. Recovering from a pacemaker implantation (surgical insertion of a small device to regulate your heart rhythm) is rather quick. You may either go home the same day, or most patients spend one night in the hospital following the procedure. There may be some minor discomfort"}, {"url": "http://healthquestions.medhelp.org/how-long-does-pacemaker-surgery-take", "passage_text": "My mother-in-law will be 90 in April. Her doctor wants to put in a pacemaker to stabilize her heart. She has lung cancer, quite a large mass but apparently not very fast-growing. She has diabetes, which might mean amputation in her future, and she has Alzheimers that is no long mild but not very advanced."}, {"url": "http://www.nhs.uk/Conditions/PacemakerImplantation/Pages/whathappenspage2.aspx", "passage_text": "The procedure usually takes about an hour, but it may take longer if you're having a biventricular pacemaker (with three leads) fitted or other heart surgery at the same time. You will usually need to stay in hospital overnight and have a day’s rest after the procedure."}, {"url": "http://www.seattlechildrens.org/clinics-programs/heart/what-to-expect/pacemakers/", "passage_text": "The doctor places the pacemaker inside the body (implantation) during a surgical procedure. Defibrillator. A defibrillator (implantable cardioverter defibrillator, or ICD) is similar to a pacemaker, but it sends electrical shocks to the heart if the heart stops beating or beats in a disorganized way (chaotically). A defibrillator is also placed inside the body"}]