[{"url": "https://en.wikipedia.org/wiki/Tangata_whenua", "passage_text": "According to Williams' definitive Dictionary of the Māori Language, tangata means man or human being, whilst tāngata (with the long ā) is the plural meaning people; tangata (without the macron) can also mean people in reference to a group with a singular identity. "}, {"url": "http://www.behindthename.com/names/usage/maori", "passage_text": "HEMI m Maori. Maori form of JAMES. HINE f Maori. Means girl in Maori. HOHEPA m Maori. Maori form of JOSEPH. HUHANA f Maori. Maori form of SUSAN. KAHURANGI f & m Maori. From the name of a type of green gemstone found in New Zealand, meaning sky blue in Maori. KAURI m Maori. From the name of a type of tree found in New Zealand (species Agathis australis)."}, {"url": "http://www.sheknows.com/baby-names/name/manu", "passage_text": "Egyptian Meaning: The name Manu is an Egyptian baby name. In Egyptian the meaning of the name Manu is: Born second. Hindi Meaning: The name Manu is a Hindi baby name. In Hindi the meaning of the name Manu is: A ruler of the earth. SoulUrge Number: 4. Expression Number: 4. People with this name have a deep inner desire for order and physical creativity, and want to be involved in conventional, safe activities"}, {"url": "http://www.nzbirds.com/birds/maorikites.html", "passage_text": "“The maori kite was known under several names, and probably each name described some special variety, differing from others in size, shape, or material of which it was made. Thus there is the manu or bird, the kaahu or hawk, the paakau or wing, and the manuwhara or kite of the canoe sail. "}, {"url": "http://www.teara.govt.nz/en/kites-and-manu-tukutuku/page-1", "passage_text": "The Māori kite is known as manu tukutuku or manu aute. Manu means both kite and bird, and the word tukutuku refers to the winding out of the line as the kite ascends. Kites were also known as pākau, a name for the wing of a bird. Kites were flown for recreation, but they also had other purposes."}, {"url": "http://maoridictionary.co.nz/search?idiom=&phrase=&proverb=&loan=&keywords=manu&search=", "passage_text": "1. (noun) kite-especially one made in the shape of a bird using paper mulberry cloth. Te manu aute nō te iwi Māori: Mehemea ka whatua taua mea, kia rite tonu ki te āhua o te manu e rere nei. Ka mahia e te Maori hei manu, ko ngā paihau me te tinana o te manu. Ka takaia te tinana o te manu, me ngā paihau, ki te aute. Koia tōna ingoa he manu aute (JPS 1901:191). / The kite made of paper mulberry cloth of the Māori people. Ki te kore he kai, kua riro mā tētahi o ngā tohunga e karakia, kua rere mai he kai ki runga ki te waka. He ika, he manu me ētahi atu tūmomo kai mata (HP 1991:9). / If there was no food, one of the tohunga would say a ritual chant and food would fly onto the vessel-fish, birds and other types of raw food. 2. (noun) kite."}, {"url": "http://www.babynamespedia.com/meaning/Manu/m", "passage_text": "Tweet. Manu is largely used in the African, Basque, French, and Indian languages, and it is derived from Sanskrit origins. The name's meaning is original man. It is derived literally from the word 'manu' which means man. The name was borne in Hindu mythology by the father of mankind and the first king to rule the earth, also known as Satyavrata. Manu is used chiefly in the Tahitian language and its origin is Polynesian-Tahitian. Here, it means bird"}, {"url": "http://www.urbandictionary.com/define.php?term=manus", "passage_text": "1. An insult to use against someone with no actual meaning, it sounds rude but it hasn't got a meaning so dumb maori's on TV in New Zealand can use it without their land being claimed. --. 2. Manus is a transferable disease that only one person may have at a time. "}, {"url": "http://maoridictionary.co.nz/search?idiom=&phrase=&proverb=&loan=&keywords=manu&search=", "passage_text": "manu. 1. (noun) bird-any winged creature including bats, cicadas, butterflies, etc. Ki te kore he kai, kua riro mā tētahi o ngā tohunga e karakia, kua rere mai he kai ki runga ki te waka. He ika, he manu me ētahi atu tūmomo kai mata (HP 1991:9). / If there was no food, one of the tohunga would say a ritual chant and food would fly onto the vessel-fish, birds and other types of raw food. 2. (noun) kite."}]