[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=25697", "passage_text": "Stapes: A stirrup-shaped bone in the middle ear. The stapes transmits sound vibrations from the incus, another little bone in the middle ear, to the oval window adjacent to the inner ear. The stapes is the smallest bone in the body. Pronounced stay-peas."}, {"url": "http://www.answers.com/Q/What_is_a_stirrup_in_your_ear", "passage_text": "There are three bones in the middle ear, between the eardrum and the oval window of the inner ear: the malleus, incus, and stapes. These are called the auditory ossicles. The stapes resembles a stirrup. stirrup is one of the bones present in the ear.Thee are 3 bones altogether: hammer anvil and stirrup, and their scientific names...malleus, incuz and stapes respectively. th … ese magnify the vibrations due to their small area and pass them to the cochlea through the oval window."}, {"url": "http://www.answers.com/Q/What_is_a_stirrup_in_your_ear", "passage_text": "Location: The stirrup is one of the three main bones (ossicles) in the middle ear connecting the eardrum to the cochlea. Its medical name is Stapes. It is called a stirrup b … ecause of its shape (It looks like a horse's stirrup). It is present at end of the three bones and opens into the oval window (A part of the inner ear). Main Function: It along with the other ossicles transmits the vibration of the eardrum to the inner ear. stirrup is one of the bones present in the ear.Thee are 3 bones altogether: hammer anvil and stirrup, and their scientific names...malleus, incuz and stapes respectively. th … ese magnify the vibrations due to their small area and pass them to the cochlea through the oval window."}, {"url": "http://www.answers.com/Q/What_is_the_function_of_stirrup_in_the_ear", "passage_text": "Location: The stirrup is one of the three main bones (ossicles) in the middle ear connecting the eardrum to the cochlea. Its medical name is Stapes. It is called a stirrup b … ecause of its shape (It looks like a horse's stirrup). It is present at end of the three bones and opens into the oval window (A part of the inner ear). Main Function: It along with the other ossicles transmits the vibration of the eardrum to the inner ear. It is the stirrup or stapes ossicle that is transmitting vibrations  to the oval window and ultimately to the cochlea  of the inner ear. 5 people found this useful."}, {"url": "http://www.thefreedictionary.com/stapes", "passage_text": "Noun. 1. stapes-the stirrup-shaped ossicle that transmits sound from the incus to the cochlea. stirrup. auditory ossicle-ossicles of the middle ear that transmit acoustic vibrations from the eardrum to the inner ear. middle ear, tympanic cavity, tympanum-the main cavity of the ear; between the eardrum and the inner ear. n. pl. stapes or sta·pe·des (stā′pĭ-dēz′). The innermost of the three small bones of the middle ear, shaped somewhat like a stirrup. Also called stirrup."}, {"url": "http://www.thefreedictionary.com/stirrup", "passage_text": "2. stirrup-the stirrup-shaped ossicle that transmits sound from the incus to the cochlea. stapes. auditory ossicle-ossicles of the middle ear that transmit acoustic vibrations from the eardrum to the inner ear. middle ear, tympanic cavity, tympanum-the main cavity of the ear; between the eardrum and the inner ear. 1. A flat-based loop or ring hung from either side of a horse's saddle to support the rider's foot in mounting and riding; a stirrup iron. 2. A part or device shaped like an inverted U in which something is supported, held, or fixed."}, {"url": "https://en.wikipedia.org/wiki/Stapes", "passage_text": "From Wikipedia, the free encyclopedia. The stapes /ˈsteɪpiːz/ is a bone in the middle ear of humans and other mammals which is involved in the conduction of sound vibrations to the inner ear. The stirrup-shaped small bone is on and transmits these to the oval window, medially. Situated between the incus and the inner ear, the stapes transmits sound vibrations from the incus to the oval window, a membrane-covered opening to the inner ear. The stapes is also stabilized by the stapedius muscle, which is innervated by the facial nerve"}, {"url": "http://www.alleydog.com/glossary/definition.php?term=Middle%20Ear", "passage_text": "Middle Ear refers to the space between the eardrum and the inner ear, where three tiny bones (also known as ossicles) are located and named based on their shapes: the malleus, meaning hammer, the incus or anvil and the stapes or stirrup. "}, {"url": "http://www.thefreedictionary.com/stapes", "passage_text": "1. stapes-the stirrup-shaped ossicle that transmits sound from the incus to the cochlea. stirrup. auditory ossicle-ossicles of the middle ear that transmit acoustic vibrations from the eardrum to the inner ear. n. pl. stapes or sta·pe·des (stā′pĭ-dēz′). The innermost of the three small bones of the middle ear, shaped somewhat like a stirrup. Also called stirrup."}]