[{"url": "http://www.investopedia.com/terms/t/turnover.asp", "passage_text": "In accounting, the number of times an asset is replaced during a financial period. 2. The number of shares traded for a period as a percentage of the total shares in a portfolio or of an exchange. In accounting, turnover often refers to inventory or accounts receivable. A quick turnover is desired because it means that inventory is not sitting on the shelves for too long. 2. In a portfolio, a small turnover is desired because it means the investor is paying less in commissions to the broker."}, {"url": "http://financial-dictionary.thefreedictionary.com/turnover", "passage_text": "1. The trading volume of the market or of a particular security. 2. The number of times that an asset is replaced during a given period. For example, an inventory turnover of five indicates that the firm's inventory has been turned into sales and has been replaced five times. Companies desire a fast or high turnover, as this indicates financial health. 2. The number of shares traded in a portfolio over a given period of time, expressed as a percentage of the number of shares in the portfolio."}, {"url": "http://financial-dictionary.thefreedictionary.com/turnover", "passage_text": "(2) The number of shares traded in a specific period expressed as a percentage of the total shares in a portfolio or traded on an exchange. Investopedia explains Turnover. (1) In accounting, turnover often refers to inventory or accounts receivable. A quick turnover is desired because it means that inventory is not sitting on the shelves for too long. Companies desire a fast or high turnover, as this indicates financial health. 2. The number of shares traded in a portfolio over a given period of time, expressed as a percentage of the number of shares in the portfolio."}, {"url": "http://financial-dictionary.thefreedictionary.com/turnover", "passage_text": "A turnover rate of 25% means that the value of trades represented one-fourth of the assets of the fund. For finance, the number of times a given asset, such as inventory, is replaced during the accounting period, usually a year. Companies desire a fast or high turnover, as this indicates financial health. 2. The number of shares traded in a portfolio over a given period of time, expressed as a percentage of the number of shares in the portfolio."}, {"url": "https://en.wikipedia.org/wiki/Revenue", "passage_text": "In business, revenue (net sales) is the income that a company receives from its normal business activities, usually from the sale of goods and services to customers. Revenue is also referred to as sales or turnover. Some companies receive revenue from interest, royalties, or other fees. "}, {"url": "http://www.investopedia.com/terms/o/overall-turnover.asp", "passage_text": "Overall turnover, in the North American context, may also refer to certain metrics, such as labor turnover or asset turnover for an organization as a whole. Overall turnover measures these metrics on a company-wide basis, as opposed to measuring them for a specific division or business unit. Next Up. "}, {"url": "http://www.financepractitioner.com/dictionary/turnover", "passage_text": "1. firm's total sales revenue the total sales revenue of an organization for an accounting period. This is shown net of VAT, trade discounts, and any other taxes based on the revenue in a profit and loss account. Accounting"}, {"url": "http://www.investopedia.com/terms/t/turnover.asp", "passage_text": "BREAKING DOWN 'Turnover'. 1. In accounting, turnover often refers to inventory or accounts receivable. A quick turnover is desired because it means that inventory is not sitting on the shelves for too long. 2. In a portfolio, a small turnover is desired because it means the investor is paying less in commissions to the broker."}]