[{"url": "https://en.wikipedia.org/wiki/Account_manager", "passage_text": "An account manager is a person who works for a company and is responsible for the management of sales, and relationships with particular customers. The account manager does not manage the daily running of the account itself. They manage the relationship with the client of the account(s) they are assigned to. Generally, a client will remain with one account manager throughout the duration of hiring the company. Account managers serve as the interface between the customer service and the sales team in a company"}, {"url": "http://www.accountingjobstoday.com/cm/Job-Descriptions/accounting-manager2.html", "passage_text": "If you are an employer seeking qualified job seekers for your Accounting Manager position, read our sample job description below and revise it to meet your company's specific job duties and requirements. "}, {"url": "http://www.investopedia.com/terms/a/account-manager.asp", "passage_text": "An employee who is responsible for the day-to-day management of a particular customer's account with the business. The account manager is a point of contact, and provides customer support, upselling, technical assistance and general relationship management. "}, {"url": "http://www.wisegeekedu.com/what-does-a-financial-accounting-manager-do.htm", "passage_text": "Adorable animal families that will make you aww. It is the job of the financial accounting manager to track and analyze a company's financial information, and to report on it to top-level management, as well as advising them on a number of different fiscal issues. This type of manager also usually supervises the recruitment of a corporation's investors. Many times, a financial accounting manager is also responsible for delegating a number of accounting functions. He or she tends to hand over fund management activities to a lower-level employee, who then approves certain account transactions and prepares reports in addition to other duties."}, {"url": "http://www1.salary.com/Accounting-Manager-salary.html", "passage_text": "The annual salary for someone with the job title Accounting Manager may vary depending on a number of factors including industry, company size, location, years of experience and level of education. "}, {"url": "https://en.wikipedia.org/wiki/Management_accounting", "passage_text": "In Management accounting or managerial accounting, managers use the provisions of accounting information in order to better inform themselves before they decide matters within their organizations, which aids their management and performance of control functions. "}, {"url": "http://www.jobshadow.com/interview-with-an-accounting-manager/", "passage_text": "Since we don’t live in a perfect world there are always problems. As an accounting manager, you will be expected to either have the answer, know who has the answer or be able to figure out the answer. Accounting is a field that many people do not understand so they will come to you for those answers. Managing a team is a rewarding and challenging. "}, {"url": "http://www.wisegeekedu.com/what-does-a-financial-accounting-manager-do.htm", "passage_text": "A financial accounting manager usually spends a large amount of time analyzing account statements and creating reports. These reports, which include charts, graphs, texts, and more, are regularly given to the manager's senior management team. Many times, a financial accounting manager is also responsible for delegating a number of accounting functions. He or she tends to hand over fund management activities to a lower-level employee, who then approves certain account transactions and prepares reports in addition to other duties."}, {"url": "http://www.payscale.com/research/US/Job=Accounting_Manager/Salary", "passage_text": "An Accounting Manager earns an average salary of $63,244 per year. A skill in Financial Analysis is associated with high pay for this job. For the first five to ten years in this position, pay increases steeply, but any additional experience does not have a big effect on pay. Accounting Manager Tasks. 1  Manage the daily activities of the accounting department. 2  Collect and provide information for audit inquiries and give assistance to auditors. 3  Assist in the development and implementation of policies and procedures relating to financial management, budget and accounting."}]