[{"url": "http://geology.about.com/od/more_sedrocks/a/aboutsandstone.htm", "passage_text": "What Sandstone Says. The sand grains in sandstone give information about the past: 1  The presence of feldspar and lithic grains means that the sediment is close to the mountains where it arose. 2  Detailed studies of sandstone give insight into its provenance —the kind of countryside that produced the sand. "}, {"url": "http://www.concretenetwork.com/concrete.html", "passage_text": "What is Concrete: Concrete & Cement Defined. Contrary to popular belief, concrete and cement are not the same thing; cement is actually just a component of concrete. Concrete is made up of three basic components: water, aggregate (rock, sand, or gravel) and Portland cement. "}, {"url": "http://www.sandatlas.org/what-is-sand-made-of/", "passage_text": "What is sand made of. Sand is usually composed of mineral grains. You’ll find a post about the sand-forming minerals here. Sand itself is not a mineral. It is a sediment just like clay, gravel and silt. Most common sand-forming mineral is quartz. There are two good reasons for that. First, quartz is very important rock-forming mineral."}, {"url": "https://en.wikipedia.org/wiki/Sand", "passage_text": "Sand from Pismo Beach, California. Components are primarily quartz, chert, igneous rock and shell fragments. In terms of particle size as used by geologists, sand particles range in diameter from 0.0625 mm (or 1⁄16 mm) to 2 mm. An individual particle in this range size is termed a sand grain. Sand is a naturally occurring granular material composed of finely divided rock and mineral particles. It is defined by size, being finer than gravel and coarser than silt. Sand can also refer to a textural class of soil or soil type; i.e. a soil containing more than 85% sand-sized particles (by mass)."}, {"url": "https://en.wikipedia.org/wiki/Sandstone", "passage_text": "Sandstone (sometimes known as arenite) is a clastic sedimentary rock composed mainly of sand-sized minerals or rock grains. Most sandstone is composed of quartz and/or feldspar because these are the most common minerals in the Earth's crust. Like sand, sandstone may be any color, but the most common colors are: tan, brown, yellow, red, grey, pink, white, and black."}, {"url": "http://www.huffingtonpost.com/2014/03/29/hawaii-beaches-parrotfish-poop_n_5052935.html", "passage_text": "ADVERTISEMENT. There are seven quintillion, five hundred quadrillion grains of sand in the world, according to math geniuses at the University of Hawaii. That’s more sand granules in Earth’s seas, lakes, and deserts than we could ever imagine. "}, {"url": "http://www.brighthub.com/environment/science-environmental/articles/106281.aspx", "passage_text": "What Soil is Made Of: Humus. After a plant dies, things living in the soil such as earthworms, fungi, and soil microbes decompose it by eating its constituent organic compounds-carbohydrates, proteins, fats, lignins, etc. "}, {"url": "http://www.desertusa.com/geofacts/sanddune.html", "passage_text": "Stack 'em up. Where the sand piles up researchers found that the dunes are actually made up of several sets of dunes, stacked one on top of another. Each set formed in response to some past climate change! The Kelso Dunes depend upon times when the sand grain (sediment) supply is enhanced. "}, {"url": "http://www.madehow.com/Volume-3/Sand.html", "passage_text": "Background. Sand is a loose, fragmented, naturally-occurring material consisting of very small particles of decomposed rocks, corals, or shells. Sand is used to provide bulk, strength, and other properties to construction materials like asphalt and concrete. It is also used as a decorative material in landscaping. "}]