[{"url": "http://www.admiss.vt.edu/apply/what-we-look-for/", "passage_text": "*This means that 25% of freshmen offered admission to Virginia Tech scored below 1160 on the SAT (combined critical reading and math) and 25% of freshmen offered admission scored above 1340 on the SAT (combined critical reading and math). Please note: These are not minimum requirements for admission to Virginia Tech."}, {"url": "http://www.prepscholar.com/sat/s/colleges/Virginia-Tech-SAT-scores-GPA", "passage_text": "Average SAT: 1220. The average SAT score composite at Virginia Tech is a 1220. (According to our records, this school requires only Reading and Math, so this score is out of 1600.). The 25th percentile SAT score is 1120, and the 75th percentile SAT score is 1320."}, {"url": "http://www.admiss.vt.edu/apply/what-we-look-for/", "passage_text": "As Non-Degree-Seeking. A student who enrolls at Virginia Tech under the non-degree program must meet minimum requirements set by the university. All students must be in good standing at their current school and have at least a recalculated 2.0 GPA to be considered for non-degree student status. Transcripts are required."}, {"url": "http://www.prepscholar.com/act/s/colleges/Virginia-Tech-ACT-scores-GPA", "passage_text": "Virginia Tech Admissions Statistics. There are three critical numbers when considering your admissions chances: ACT scores, GPA, and acceptance rate. All these combine to tell you what you scores are required to get into Virginia Polytechnic Institute and State University."}, {"url": "http://www.collegesimply.com/colleges/virginia/virginia-polytechnic-institute-and-state-university/admission/", "passage_text": "The average high school GPA of the admitted freshman class at Virginia Tech was 3.95 on the 4.0 scale indicating that primarily A-students are accepted and ultimately attend."}, {"url": "http://www.prepscholar.com/act/s/colleges/Virginia-Tech-ACT-scores-GPA", "passage_text": "The average ACT score composite at Virginia Tech is a 27. The 25th percentile ACT score is 24, and the 75th percentile ACT score is 29. In other words, a 24 places you below average, while a 29 will move you up to above average."}]