[{"url": "http://www.rothira.com/roth-ira-contribution-limits", "passage_text": "Roth IRA Contribution Limits for Individuals 50 or Older. For individuals that are age 50 or older the same $5,500 contribution limit across all Roth IRAs is in place. However, the IRS also allows these individuals to also contribute an additional $1,000 as catch up contributions. Individuals may contribute money to a Roth IRA from January 1 of the current tax year to April 15 of the following tax year. Contributions are made with post-tax dollars. You pay tax today so that in retirement no tax is charged to you in retirement."}, {"url": "http://www.mydollarplan.com/roth-401k-and-roth-ira-limits/", "passage_text": "Roth IRA Income Limits. You may contribute the full amount to your Roth IRA if your 2015 modified adjusted gross income is below $116,000 for singles ($183,000 for married). You may make partial contributions until your income hits $131,000 ($193,000 for married). If you contribute 2015 Roth IRA money between January 1 and April 15, be sure to designate calendar year 2015 if you have already contributed the maximum for 2014. To maximize your IRA investments, make sure you aren’t paying extra fees in your IRA."}, {"url": "http://www.mydollarplan.com/roth-401k-and-roth-ira-limits/", "passage_text": "You can make your 2015 contributions as early as January 1, 2015 for the whole year. If you contribute 2015 Roth IRA money between January 1 and April 15, be sure to designate calendar year 2015 if you have already contributed the maximum for 2014. To maximize your IRA investments, make sure you aren’t paying extra fees in your IRA."}, {"url": "https://www.fidelity.com/retirement-ira/contribution-limits-deadlines", "passage_text": "Learn about the deadlines, income limits, and contribution limits for contributing to Traditional and Roth IRAs each year. Deadline for contributions for the 2014 tax year: April 15, 2015. 1  Contribute to your Fidelity IRA.Log In Required. 2  Set up automatic contributions to your Fidelity IRA. 2014 Traditional & Roth IRA contribution limits. Total annual contributions to your Traditional and Roth IRAs combined cannot exceed: 1  $5,500 (under age 50). 2  $6,500 (age 50 or older)."}, {"url": "http://cashmoneylife.com/traditional-roth-ira-contribution-limits/", "passage_text": "1 Contribution rates phase out beginning at a MAGI above $116,001, and end at $131,000 (up from $114,000, and $129,000, respectively in 2014). 2  Married Filing Jointly can make maximum Roth IRA contributions for an income of $183,000 or less. Persons age 50 and over can make additional catch up contributions of $1,000, for a total contribution limit of $6,500. You can have both a Roth IRA and a Traditional IRA in the same tax year, but you can’t exceed the contribution limit with your combined contributions to both accounts."}, {"url": "http://cashmoneylife.com/traditional-roth-ira-contribution-limits/", "passage_text": "The Traditional and Roth IRA contribution limits are $5,500 for those under age 50. Persons age 50 and over can make additional catch up contributions of $1,000, for a total contribution limit of $6,500. You can have both a Roth IRA and a Traditional IRA in the same tax year, but you can’t exceed the contribution limit with your combined contributions to both accounts."}, {"url": "http://www.rothira.com/roth-ira-limits", "passage_text": "If your income falls between $116,000 and $131,000 you cannot contribute up to the limit. Your contribution is reduced. Use the IRS worksheet to calculate your new reduced Roth IRA contribution limit. If you do not have income you will not be allowed to contribute to a Roth IRA. If your income is less than $10"}, {"url": "http://www.rothira.com/roth-ira-limits", "passage_text": "Roth IRA Income Limits for Single Filers. If you file as single, head of household, or married filing separately (if you did not live with your spouse at any time during the year) your income must be less than $116,000 to contribute up to the limit. If you do not have income you will not be allowed to contribute to a Roth IRA. If your income is less than $10,000 you cannot contribute up to the limit. Your contribution is reduced."}, {"url": "http://www.rothira.com/roth-ira-contribution-limits", "passage_text": "For example, you could contribute $2,500 to a Roth IRA with one provider and $3,000 with a second provider. You cannot contribute $5,500 to the first Roth IRA and $5,500 to the second provider. Your total contribution limit is $5,500 for all accounts for the tax year. Individuals may contribute money to a Roth IRA from January 1 of the current tax year to April 15 of the following tax year. Contributions are made with post-tax dollars. You pay tax today so that in retirement no tax is charged to you in retirement."}, {"url": "http://www.rothira.com/roth-ira-limits", "passage_text": "The IRS severely limits the ability to contribute to a Roth IRA for individuals that are married but file separately. If you do not have income you will not be allowed to contribute to a Roth IRA. If your income is less than $10,000 you cannot contribute up to the limit. Your contribution is reduced. Use the IRS worksheet to calculate your new reduced Roth IRA contribution limit"}]