[{"url": "http://www.indigoguide.com/france/normandy-cuisine.htm", "passage_text": "Normandy is a region full of fields and orchards, which in turn means that there are plenty of cows and fruit and so food in Normandy tends to be based on these products. In fact, milk from cows in Normandy makes up about half of France's milk, butter, cheese and cream. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080225020856AAhHZVu", "passage_text": "Best Answer: Regional French Food of Burgandy The French regional food of Burgundy is known for being substantial and served in particularly large portions. The most famous regional food from Burgundy in Boeuf Bourguignon, which is beef marinated with mushrooms, onions and carrots. Similar to French regional food from Normandy, many recipes from Burgundy make substantial use of cream based sauces. The food of Perigord is famous for its truffles and poultry. A special food that is particularly popular in Perigord is goose liver pate served with many main dishes in this region in France."}, {"url": "http://www.roughguides.com/destinations/europe/france/food-drink/", "passage_text": "Food and drink. France is famous for producing some of the most sublime food in the world, whether it’s the rarefied delicacies of haute cuisine or the robust, no-nonsense fare served up at country inns. In France, drinking is done at a leisurely pace whether it’s a prelude to food (aperitif) apéritif or a (sequel), digestif and-cafe café bars are the standard places to. do it"}, {"url": "http://www.worldtravelguide.net/france/food-and-drink", "passage_text": "National drinks: • Wine is the most popular alcoholic drink in France, with grape and vintage varying according to region. • Pastis is a popular aperitif (apéritif brand Name ricard Or). • Pernod beer is brewed In Nord pas De, Calais picardy And. alsace France Food and Drink. From the baking aromas wafting from its traditional village boulangeries to the Michelin-starred fussiness of its gourmet restaurants, France has an almost unparalleled world reputation for its food."}, {"url": "http://en.normandie-tourisme.fr/normandy-tourism/main-menu/things-to-do/food-and-drink-214-2.html", "passage_text": "1 Markets Markets in Normandy showcase traditions, authenticity, the quality of life a à la francaise française and the diversity of. 2  Local produce to experience the great pleasures of, a colourful lively and welcoming atmosphere by browsing at the, ...  local markets 1 Products The 600 km coastline provides an abundance of fresh seafood, the lush green pastures of the Normandy countryside makes ideal grazing for dairy herds and cattle; and the apple orchards give delicious fruit that is used to make a variety of tasty ..."}, {"url": "http://www.francetravelplanner.com/go/bourgogne/food_drink/index.html", "passage_text": "Food & Drink in Burgundy, France. Burgundy has long been associated with some of the finest French food, and you're sure to eat well in the region. The Burgundy region is of course known for its wonderful wines, many of which are grands crus, the very best. It's also a great brunch dish. The best known and most traditional main courses (plats principals) in Burgundy are boeuf bourguignon and coq au vin. Boeuf bourguignon, or Burgundy beef, is a hearty delicious meal, with lots of sauce to mop up with your bread."}, {"url": "http://travelfoodanddrink.com/france-food-and-drink/", "passage_text": "Many of the best chefs in France call Lyon home, and two of France’s best wine growing regions are just outside this region. To the North is the Beaujolais wine region and to the south is the Cotes côtes Du. Rhone rhône beaujolais wine is very common In the lyon region and is usually served with. local dishes "}, {"url": "http://en.normandie-tourisme.fr/normandy-tourism/main-menu/things-to-do/food-and-drink-214-2.html", "passage_text": "Food and drink. Famous for its dairy products, like butter, milk, cream and cheese, the region is also world wide renowned for its apples. Most restaurants in Normandy will use locally sourced products and some producers are delighted to welcome visitors. 1 Products The 600 km coastline provides an abundance of fresh seafood, the lush green pastures of the Normandy countryside makes ideal grazing for dairy herds and cattle; and the apple orchards give delicious fruit that is used to make a variety of tasty ..."}, {"url": "http://www.expatfocus.com/expatriate-france-food-drink", "passage_text": "France-Food and Drink. Food and drink are a major part of the way of life in France. However, as there are so many different regions in the country you will find many variations on typical dishes. "}, {"url": "http://en.normandie-tourisme.fr/normandy-tourism/main-menu/things-to-do/food-and-drink-214-2.html", "passage_text": "Normandy is haute-cuisine heaven for food lovers and visitors seeking authentic culinary experiences. 1  Markets Markets in Normandy showcase traditions, authenticity, the quality of life a à la francaise française and the diversity of.  local produce 1 Products The 600 km coastline provides an abundance of fresh seafood, the lush green pastures of the Normandy countryside makes ideal grazing for dairy herds and cattle; and the apple orchards give delicious fruit that is used to make a variety of tasty ..."}]