[{"url": "https://en.wikipedia.org/wiki/Transnet", "passage_text": "Transnet Engineering is dedicated to in-service maintenance, repair, upgrade, conversion and manufacture of freight wagons, mainline and suburban coaches, diesel and electric locomotives as well as wheels, rotating machines, rolling stock equipment, castings auxiliary equipment and services. Transnet port terminals was established in 2000, when Transnet's then single port division, Portnet, was divided into operations and landlord businesses namely, SAPO (Transnet port terminals) and National Port Authority (TNPA)."}, {"url": "http://www.transnet.net/AboutUs/Overview.aspx", "passage_text": "Every day Transnet delivers thousands of tons of goods around South Africa, through its pipelines and both to and from its ports. It moves that cargo on to ships for export while it unloads goods from overseas. Transnet is fully owned by the South African government but operates as a corporate entity aimed at both supporting and contributing to the country’s freight logistics network. It aims at developing South African industry, reducing the cost of doing business, while at the same time operating efficiently and profitably."}, {"url": "https://en.wikipedia.org/wiki/Transnet", "passage_text": "Transnet SOC Ltd is a large South African rail, port and pipeline company, headquartered in the Carlton Centre in Johannesburg. It was formed as a limited company on 1 April 1990. A majority of the company's stock is owned by the Department of Public Enterprises, or DPE, of the South African government. Transnet port terminals was established in 2000, when Transnet's then single port division, Portnet, was divided into operations and landlord businesses namely, SAPO (Transnet port terminals) and National Port Authority (TNPA)."}, {"url": "http://www.transnet.net/AboutUs/Overview.aspx", "passage_text": "About Us Transnet is the largest and most crucial part of the freight logistics chain that delivers goods to every South African. T ransnet is the largest and most crucial part of the freight logistics chain that delivers goods to each and every South African. Transnet is fully owned by the South African government but operates as a corporate entity aimed at both supporting and contributing to the country’s freight logistics network. It aims at developing South African industry, reducing the cost of doing business, while at the same time operating efficiently and profitably."}, {"url": "http://www.transnet-tpt.net/pages/Default.aspx", "passage_text": "​ Transnet Port Terminals (TPT) is a division of Transnet SOC Limited; South Africa’s state-owned freight transport company which owns and operates 16 terminal operations situated across seven South African Ports. In order to provide efficient loading, unloading, transhipment, temporary storage and terminal services to our customers, Transnet Port Terminals’ safety objectives are characterised by the promotion of value-driven behaviour and proactive leadership."}, {"url": "http://www.transnet.net/Pages/Home.aspx", "passage_text": "Welcome to Transnet. Transnet is the largest and most crucial part of the freight logistics chain that delivers goods to each and every South African. Every day Transnet delivers thousands of tons of goods around South Africa, through its pipelines and both to and from its ports. It moves that cargo on to ships for export while it unloads goods for overseas."}, {"url": "http://www.transnetnationalportsauthority.net/", "passage_text": "Transnet National Ports Authority is a division of Transnet Limited and is mandated to control and manage all eight commercial ports on the 2954km South African coastline. "}, {"url": "https://en.wikipedia.org/wiki/Transnet_Freight_Rail", "passage_text": "Transnet Freight Rail is a freight logistics and passenger transport railway. It is the largest freight hauler in Africa. The company comprises several businesses: 1  GFB Commercial (General Freight Business) – Transnet's largest division; handles over 50% of its freight; 1 Maputo Corridor: Transnet Freight Rail is developing a plan with the Railroad Development Corporation to transport magnetite from Phalaborwa to Maputo as feedstock for a proposed steel plant in Maputo."}]