[{"url": "https://en.wikipedia.org/wiki/List_of_cities_in_Australia_by_population", "passage_text": "These correspond to the more common and international usage of metropolitan areas. Significant Urban Areas are similarly defined but include population centres which are not capital cities. In Australia the population of the GCCSA/SUA is the most-often quoted figure for that city's population. The following ranks GCSSAs and SUAs which are not included within the GCCSAs with populations of over 30,000. Greater Capital City Statistical Areas are in bold, the remainder are Significant Urban A"}, {"url": "http://www.mapsofworld.com/australia/cities/", "passage_text": "Perth is situated in Western Australia and is the largest city and capital of the state. Perth has a population of 1.8 million people living in its metropolitan area, which covers 5,386 square kilometers (2,079 square miles). The fifth largest city in Australia is Adelaide, the South Australian capital. The capital of Australia is Canberra, which is located in the Australian Capital Territory in southeastern Australia. Canberra has a population of about 367,000, making it the largest inland city in the country, but the eight largest city in all. Canberra covers an area of 814 square kilometers (314 square miles)"}, {"url": "http://www.mapsofworld.com/australia/cities/", "passage_text": "Brisbane is Queensland's capital, and the third largest city in Australia with a population of 2.1 million. Brisbane covers an area of 5,949 square kilometers (2,297 square miles) along the east coast of the continent. The capital of Australia is Canberra, which is located in the Australian Capital Territory in southeastern Australia. Canberra has a population of about 367,000, making it the largest inland city in the country, but the eight largest city in all. Canberra covers an area of 814 square kilometers (314 square miles)"}, {"url": "http://worldpopulationreview.com/countries/australia-population/", "passage_text": "Victoria, named after the English Queen, is Australia’s second largest state. It’s population in January 2012 was 5,574,500. It’s largest city is Melbourne, Australia’s second city, where three quarters of all Victoria ns live. If Victoria was a country, it would be Denmark. South Australia (1.6 million). South Australia, in the centre of Australia's south coast, is home to 1,645,000 people. It's largest city is its capital, Adelaide, which is home to all but 400,000 of South Australia's residents. If South Australia were a country, it would be Qatar."}, {"url": "http://www.australia.com/en/facts/cities-states-territories.html", "passage_text": "New South Wales is Australia’s oldest and most populated state. It was originally settled as a penal colony on the shores of Port Jackson where the bustling capital city of Sydney now stands. More than a third of Australians live in New South Wales, and Sydney is the nation’s largest city. Victoria is the smallest of the mainland states in size but the second most populated. Melbourne is the capital and is Australia’s second most populated city. During the gold rush of the 1850s, it became one of the world's largest and wealthiest cities. "}, {"url": "http://www.mapsofworld.com/australia/cities/", "passage_text": "Melbourne, the capital of Victoria, is the second largest city in Australia with a population of about 4.1 million. The area of Melbourne is about 8,806 square kilometers (3,400 square miles), and it is called Garden City. The capital of Australia is Canberra, which is located in the Australian Capital Territory in southeastern Australia. Canberra has a population of about 367,000, making it the largest inland city in the country, but the eight largest city in all. Canberra covers an area of 814 square kilometers (314 square miles)"}, {"url": "http://www.answers.com/Q/What_are_the_three_largest_cities_in_Australia", "passage_text": "The three largest cities in southeastern Australia are Sydney  (capital of New South Wales), Melbourne (capital of Victoria) and  Adelaide (capital of South Australia). It has an area of 424,400 sq km and is located in Western Australia. The second largest desert is the Great Sand … y Desert in Western Australia), with an area of 284,993 sq km. The third largest desert in Australia is the Tanami Desert which extends over part of Western Australia and the Northern Territory."}, {"url": "http://blog.id.com.au/2012/population/australian-census-2011/top-33-largest-cities-in-australia-by-population/", "passage_text": "While Sydney and Melbourne are by far the two biggest cities, some of the smaller state capitals are eclipsed in population by some of the larger regional centres. Here is the official list of the top 33 centres for 2010-11. "}, {"url": "http://www.answers.com/Q/What_is_the_name_of_Australia's_largest_city", "passage_text": "The largest city in Australia by population is Sydney, with 4,605,992 people as of the 2011 census. "}]