[{"url": "http://www.myczechrepublic.com/basics/czech_currency.html", "passage_text": "The official currency of the Czech Republic is the Czech crown (koruna) , abbreviated as Kč, with the international abbreviation CZK. 1 crown consists of 100 hellers (haleř), haléř abbreviated as. hal Banknotes: 100 Kč, 200 Kč, 500 Kč, 1000 Kč, 2000 Kč, 5000 Kč View Czech banknotes. Currencies Accepted. As the official currency, the Czech crown is the best and often the only possible currency to use when paying. Although the Czech Republic is part of the European Union, the euro is not widely accepted here yet."}, {"url": "http://www.answers.com/Q/What_is_the_currency_of_the_Czech_Republic", "passage_text": "Confidence votes 58.1K. The currency is the Czech koruna (which notionally consists of 100 heleru). Koruna (= Czech Crown or koruna česka) - česká Symbol kč OR. Czk it has coins of, 1, 2, 5, 10, 20 50-Czk czechs nowadays has no-heleru and/banknotes bills of, 50, 100, 200, 500, 1000, 2000 5000. czk"}, {"url": "https://www.czechtourism.com/a/currency/", "passage_text": "The official unit of currency of the Czech Republic is the Czech crown (Kč, CZK), which is divided into 100 hellers. Although it is possible to pay in euros for certain services and in many shops, it is better to get some local currency for a stay in the Czech Republic. The Czech Republic uses coins in values of CZK 1, CZK 2, CZK 5, CZK 10, CZK 20 and CZK 50. Paper banknotes have values of CZK 50, CZK 100, CZK 200, CZK 500, CZK 1,000, CZK 2,000 and CZK 5,000."}, {"url": "https://en.wikipedia.org/wiki/Czech_Republic_and_the_euro", "passage_text": "2 non-European Union member states using the euro unilaterally (Kosovo and Montenegro). The Czech Republic uses the Czech koruna as its currency and does not participate in European Exchange Rate Mechanism II. It is bound by its 2003 Treaty of Accession to the European Union to join the eurozone once it has satisfied the euro convergence criteria. "}, {"url": "http://www.myczechrepublic.com/basics/czech_currency.html", "passage_text": "The official currency of the Czech Republic is the Czech crown (koruna) , abbreviated as Kč, with the international abbreviation CZK. 1 crown consists of 100 hellers (haleř), haléř abbreviated as. Hal heller coins have not been in use as Of september, 1, 2008 but hellers are still incorporated into merchandise. prices Banknotes: 100 Kč, 200 Kč, 500 Kč, 1000 Kč, 2000 Kč, 5000 Kč View Czech banknotes. Currencies Accepted. As the official currency, the Czech crown is the best and often the only possible currency to use when paying. Although the Czech Republic is part of the European Union, the euro is not widely accepted here yet."}, {"url": "http://studiesabroad.com/programs/country/czech_republic/city/prague/cultureCorner/moneyMatters", "passage_text": "Currency. Though the Czech Republic is a member of the European Union, Czech Republic's official form of currency is the Czech Republic Koruny (CZK), or Czech crown. There are six different coin denominations and seven different bill denominations in circulation. Coins are denominated in 1, 2 5, 10, 20 and 50 CZK"}, {"url": "http://easysegway.com/what-currency-do-they-use-in-prague-and-czech-republic/", "passage_text": "What currency do they use in Prague – Coins. The Czech Republic uses coins in these values: CZK 1, CZK2, CZK 5, CZK 10, CZK 20 and CZK 50. The banknotes feature renowned Czech people on the obverse and abstract compositions on the reserve. Modern protective elements can be found on all banknotes. The official unit of Czech currency is the Czech crown that is dividing into 100 hellers. What currency do they use in Prague and Czech republic? The Czech koruna replaced the Czechoslovak koruna in 1993 after the dissolution of Czechoslovakia."}]