[{"url": "http://fourriverscharter.org/projects/Inventions/pages/china_papermoney.htm", "passage_text": "Paper money was made by the Tang Dynasty in China in 740 B.C. They made the paper money as an offshoot of the invention of block printing. Block printing is like stamping. Some people used the process for quilts, but the government made ready use of it in printing money."}, {"url": "http://fourriverscharter.org/projects/Inventions/pages/china_papermoney.htm", "passage_text": "Paper Money. by Colleen Dumas. Paper money was made by the Tang Dynasty in China in 740 B.C. They made the paper money as an offshoot of the invention of block printing. Block printing is like stamping. Some people used the process for quilts, but the government made ready use of it in printing money."}, {"url": "http://content.time.com/time/specials/packages/article/0,28804,1914560_1914558_1914593,00.html", "passage_text": "As a result, China eliminated paper money entirely in 1455 and wouldn't adopt it again for several hundred years. Another not-so-well-known fact: the word cash was originally used to describe the type of round bronze coins with square holes commonly used in the Tang Dynasty, called kai-yuans."}, {"url": "http://www.silk-road.com/artl/papermoney.shtml", "passage_text": "Real paper currency was not introduced until early in the Song (960-1279) dynasty, when it was utilitzed by a group of rich merchants and financiers in Szechuan, the same province where the art of printing had been invented."}, {"url": "http://www.whoinventedit.net/who-invented-paper-money.html", "passage_text": "Swedes are the other group of people who invented paper money, at least in the European continent. Their adoption of the use of paper money may be hundreds of years behind the Chinese’ but their official use of paper currency led to their widespread use in the Western world. After Sweden used paper money, governments not only in Europe but around the world have made the paper money a staple of trade and commerce."}, {"url": "http://content.time.com/time/specials/packages/article/0,28804,1914560_1914558_1914593,00.html", "passage_text": "Paper bills were first used by the Chinese, who started carrying folding money during the Tang Dynasty (A.D. 618-907)  mostly in the form of privately issued bills of credit or exchange notes  and used it for more than 500 years before the practice began to catch on in Europe in the 17th century."}, {"url": "http://www.computersmiths.com/chineseinvention/papermoney.htm", "passage_text": "By the 15th century even China had more or less given up paper money. Over this period, paper notes were issued irresponsibly, to the point that their value rapidly depreciated and inflation soared. Then beginning in 1455, the use of paper money in China disappeared for several hundred years."}]