[{"url": "https://en.wikipedia.org/wiki/Oxytocin", "passage_text": "Studies have looked at oxytocin's role in various behaviors, including orgasm, social recognition, pair bonding, anxiety, and maternal behaviors. As a medication, it is used to cause contraction of the uterus, which is used to start labor, increase the speed of labor, and to stop bleeding following delivery. 1 Uterine contraction: Important for cervical dilation before birth, oxytocin causes contractions during the second and third stages of labor. 2  Oxytocin release during breastfeeding causes mild but often painful contractions during the first few weeks of lactation."}, {"url": "http://www.chm.bris.ac.uk/motm/oxytocin/oxytocinh.htm", "passage_text": "It began to look as if oxytocin was implicit in sexual fidelity, and that prairie voles were a model for human love, but paternity tests on prairie voles found that up to a quarter of the litters had not been fathered by the life partner. In humans, oxytocin is produced in the hypothalmus; it is released from the posterior pituitary gland. There are receptors in many parts of the brain, as well as elsewhere in the body, such as the reproductive system."}, {"url": "http://apa.org/monitor/feb08/oxytocin.aspx", "passage_text": "Given oxytocin's connection to such life-affirming activities as maternal behavior, lactation, selective social bonding and sexual pleasure, researchers have been working overtime to uncover its role in the brain and in regulating behavior. Likewise, recent animal studies demonstrate a developmental relationship between exposure to extra oxytocin in early life and subsequent maternal and social behaviors. In the August issue of Hormones and Behavior (Vol."}, {"url": "https://en.wikipedia.org/wiki/Oxytocin", "passage_text": "It is also available as a medication. Oxytocin is normally produced in the hypothalamus and stored in the posterior pituitary gland. It plays a role in intimacy, sexual reproduction of both sexes, and during and after childbirth as well as social bonding. 1 Uterine contraction: Important for cervical dilation before birth, oxytocin causes contractions during the second and third stages of labor. 2  Oxytocin release during breastfeeding causes mild but often painful contractions during the first few weeks of lactation."}, {"url": "http://psychcentral.com/lib/about-oxytocin/", "passage_text": "By Wikipedia ~ 8 min read. Pages: 1 2 All. Oxytocin (Greek, “quick birth”) is a mammalian hormone that also acts as a neurotransmitter in the brain. In humans, oxytocin is thought to be released during hugging, touching, and orgasm in both sexes. In the brain, oxytocin is involved in social recognition and bonding, and may be involved in the formation of trust between people and generosity. [1][2][3]"}, {"url": "http://www.livescience.com/35219-11-effects-of-oxytocin.html", "passage_text": "The hormone's influence on our behavior and physiology originates in the brain, where it's produced by the by a structure called the hypothalamus, and then transfers to the pituitary gland which releases into the bloodstream.. Like antennas picking up a signal, oxytocin receptors are found on cells throughout the body. Levels of the hormone tend to be higher during both stressful and socially bonding experiences, according to the American Psychological Association. Oxytocin the so-called love hormone is being increasingly shown to trigger a wide variety of physical and psychological effects in both women and men. Th} DUPipeline_QISnippet_FirstGoodLong_Snippet_v1: {},{-1|-1|1|Intro."}, {"url": "https://en.wikipedia.org/wiki/Oxytocin", "passage_text": "1 Oxytocin has a role in social behaviors in many species, so it likely also does in humans. 2  In a 2003 study, both humans and dog oxytocin levels in the blood rose after five to 24 minutes of a petting session. 1 Uterine contraction: Important for cervical dilation before birth, oxytocin causes contractions during the second and third stages of labor. 2  Oxytocin release during breastfeeding causes mild but often painful contractions during the first few weeks of lactation."}, {"url": "http://www.raysahelian.com/oxytocin.html", "passage_text": "Oxytocin is a hormone that helps relax and reduce blood pressure and cortisol levels. It increases pain thresholds, has anti anxiety effects, and stimulates various types of positive social interaction. In addition, it promotes growth and healing. Anorexia treatment Oxytocin is sometimes called the love hormone.. It's released during bonding activities like childbirth and sex. Researchers gave oxytocin or a placebo, via nasal spray, to 31 patients with anorexia and 33 healthy control patients."}, {"url": "http://www.dailymail.co.uk/sciencetech/article-2557013/How-love-hormone-doesnt-live-Oxytocin-make-women-friendly-men-competitive.html", "passage_text": "View. comments. The reason why men are competitive and women are more social has been explained-and it’s all down to the hormone oxytocin. Although known as the love hormone, it affects the sexes differently and not always in a loving way. "}, {"url": "http://www.livescience.com/35219-11-effects-of-oxytocin.html", "passage_text": "Oxytocin the so-called \\\\\\\\love hormone\\\\\\\\ is being increasingly shown to trigger a wide variety of physical and psychological effects in both women and men. Oxytocin the so-called love hormone is being increasingly shown to trigger a wide variety of physical and psychological effects in both women and men. Th} DUPipeline_QISnippet_FirstGoodLong_Snippet_v1: {},{-1|-1|1|Intro."}]