[{"url": "http://www.webmd.com/drugs/2/drug-8715/temazepam-oral/details", "passage_text": "Before taking temazepam, tell your doctor or pharmacist if you are allergic to it; or if you have any other allergies. This product may contain inactive ingredients, which can cause allergic reactions or other problems. This medication may make you sleepy during the day. Tell your doctor if you have daytime drowsiness. Your dose may need to be adjusted. Remember that your doctor has prescribed this medication because he or she has judged that the benefit to you is greater than the risk of side effects."}, {"url": "http://www.cvs.com/drug/temazepam/oral-capsule/15mg", "passage_text": "Marijuana and Benzodiazepines(Temazepam). Avoid Marijuana, Medical while you are taking Benzodiazepines to reduce anxiety or to induce sleep or sedation. Using some of these drugs along with Marijuana can lead to serious side effects. You may feel drowsy or more tired when taking these drugs together. It is used to help you to fall asleep and sleep through the night. Similar Brand Name Drugs: Restoril: Oral capsule (15mg) | Restoril: Oral capsule (22.5mg) | Restoril: Oral capsule (7.5mg) | Restoril: Oral capsule (30mg)."}, {"url": "http://www.emedicinehealth.com/drug-temazepam/article_em.htm", "passage_text": "Temazepam is in a group of drugs called benzodiazepines (ben-zoe-dye-AZE-eh-peens). Temazepam affects chemicals in the brain that may become unbalanced and cause sleep problems (insomnia). Stop using temazepam and call your doctor at once if you have any of these serious side effects: 1  weak or shallow breathing; 2  fast or pounding heartbeats; 3  confusion, slurred speech, unusual thoughts or behavior; 4  hallucinations, agitation, aggression; 5  thoughts of suicide or hurting yourself; 6  restless muscle movements in your eyes, tongue, jaw, or ..."}, {"url": "http://www.webmd.com/drugs/2/drug-8715/temazepam-oral/details", "passage_text": "Precautions. Before taking temazepam, tell your doctor or pharmacist if you are allergic to it; or if you have any other allergies. This product may contain inactive ingredients, which can cause allergic reactions or other problems. Talk to your pharmacist for more details. This medication may make you sleepy during the day. Tell your doctor if you have daytime drowsiness. Your dose may need to be adjusted. Remember that your doctor has prescribed this medication because he or she has judged that the benefit to you is greater than the risk of side effects."}, {"url": "http://www.emedicinehealth.com/drug-temazepam/article_em.htm", "passage_text": "Do not drink alcohol while taking temazepam. It can increase some of the side effects, and could possibly cause a fatal overdose. Avoid using other medicines that make you sleepy. They can add to sleepiness caused by temazepam. Temazepam may be habit-forming and should be used only by the person it was prescribed for. Stop using temazepam and call your doctor at once if you have any of these serious side effects: 1  weak or shallow breathing; 2  fast or pounding heartbeats; 3  confusion, slurred speech, unusual thoughts or behavior; 4  hallucinations, agitation, aggression; 5  thoughts of suicide or hurting yourself; 6  restless muscle movements in your eyes, tongue, jaw, or ..."}, {"url": "http://www.webmd.com/drugs/2/drug-8715/temazepam-oral/details", "passage_text": "This medication is used to treat sleep problems (insomnia). It may help you fall asleep faster, stay asleep longer, and lessen how often you wake up during the night, so you can get a better night's rest. Temazepam belongs to a class of drugs called sedative-hypnotics. It acts on your brain to produce a calming effect. Use of this medication is usually limited to short treatment periods of 1 to 2 weeks or less. This medication may make you sleepy during the day. Tell your doctor if you have daytime drowsiness. Your dose may need to be adjusted. Remember that your doctor has prescribed this medication because he or she has judged that the benefit to you is greater than the risk of side effects."}, {"url": "http://www.lifescript.com/health/centers/sleep/drugs/temazepam.aspx", "passage_text": "Temazepam comes as a capsule to take by mouth. It is usually taken as needed at bedtime. Follow the directions on your prescription label carefully, and ask your doctor or pharmacist to explain any part you do not understand. Take temazepam exactly as directed. Do not take more or less of it or take it more often than prescribed by your doctor. You will probably become very sleepy soon after you take temazepam and will remain sleepy for some time after you take the medication. Plan to go to bed right after you take temazepam and to stay in bed for 7 to 8 hours."}, {"url": "http://www.rxlist.com/restoril-drug.htm", "passage_text": "DRUG DESCRIPTION. Restoril™ (temazepam) is a benzodiazepine hypnotic agent. The chemical name is 7-chloro1,3-dihydro-3-hydroxy-1-methyl-5-phenyl-2H-1,4-benzodiazepin-2-one, and the structural formula is: C16H13ClN2O2 MW = 300.74. Temazepam is a white, crystalline substance, very slightly soluble in water and sparingly soluble in alcohol USP. Restoril™ (temazepam) capsules USP, 7.5 mg, 15 mg, 22.5 mg, and 30 mg, are for oral administration. Active Ingredient: temazepam USP. Inactive Ingredients: FD&C Blue #1, FD&C Red #3, gelatin, lactose, magnesium stearate, red iron oxide, titanium dioxide. "}, {"url": "http://www.rxwiki.com/temazepam", "passage_text": "Temazepam is a prescription medication used to treat insomnia. Temazepam belongs to a group of drugs called benzodiazepines. It works by slowing activity in the brain to allow sleep. This medication comes in capsule form. It is usually taken as needed at bedtime. Temazepam is a prescription medication used in the treatment of a sleep problem called insomnia. Symptoms of insomnia include: 1  trouble falling asleep. 2  waking up often during the night."}]