[{"url": "https://en.wikipedia.org/wiki/Feminism_in_Canada", "passage_text": "The first wave of feminism in Canada occurred in the late 19th and early 20th centuries. This early activism was focused on increasing women’s role in public life, with goals including women’s suffrage, increased property rights, increased access to education, and recognition as “persons” under the law. The history of feminism in Canada has been a gradual struggle aimed at establishing equal rights. The history of Canadian feminism, like modern, Western feminism in other countries has been divided by scholars into three waves , each describing a period of intense activism and social change."}, {"url": "http://www.infoplease.com/ipa/A0931343.html", "passage_text": "Timeline of Women’s Suffrage Granted, by Country. Learn the year in which women's suffrage was granted, organized by year. New Zealand was the first country to allow women to vote (in 1893), while the King Abdullah of Saudi Arabia granted women the right to vote in 2011. The United States finally began allowing women to vote in 1920, after the ratification of the 19th Amendment to the Constitution. 1  1918 Austria, Germany, Poland, Russia"}, {"url": "https://en.wikipedia.org/wiki/Women%27s_Suffrage", "passage_text": "Canada, the United States and a few Latin American nations passed women's suffrage before World War II while the vast majority of Latin American nations established women's suffrage in the 1940s (see table in Summary below). Propertied British women over 30 had the vote in 1918, Dutch women in 1919, and American women won the vote on 26 August 1920 with the passage of the 19th Amendment. Irish women won the same voting rights as men in the Irish Free State constitution, 1922. In 1928, British women won suffrage on the same terms as men, that is, for persons 21 years old and older. Suffrage of Turkish women introduced in 1930 for local elections and in 1934 for national elections"}, {"url": "https://en.wikipedia.org/wiki/Women%27s_Suffrage", "passage_text": "Of currently existing independent countries, New Zealand was the first to acknowledge women's right to vote in 1893 when it was a self-governing British colony. Unrestricted women's suffrage in terms of voting rights (women were not initially permitted to stand for election) was adopted in New Zealand in 1893. Propertied British women over 30 had the vote in 1918, Dutch women in 1919, and American women won the vote on 26 August 1920 with the passage of the 19th Amendment. Irish women won the same voting rights as men in the Irish Free State constitution, 1922. In 1928, British women won suffrage on the same terms as men, that is, for persons 21 years old and older. Suffrage of Turkish women introduced in 1930 for local elections and in 1934 for national elections"}, {"url": "http://www.infoplease.com/spot/womenstimeline1.html", "passage_text": "This timeline covers the years of 1848 to 1920, which includes the famed women's rights convention in Seneca Falls, N.Y., the formation of the National American Woman Suffrage Association, and the passage of the nineteenth amendment to the Constitution, giving women the right to vote. The first women's rights convention is held in Seneca Falls, New York. After 2 days of discussion and debate, 68 women and 32 men sign a Declaration of Sentiments, which outlines grievances and sets the agenda for the women's rights movement."}, {"url": "http://www.history.com/topics/womens-history/19th-amendment", "passage_text": "Introduction. Ratified on August 18, 1920, the 19th Amendment to the U.S. Constitution granted American women the right to vote—a right known as woman suffrage. At the time the U.S. was founded, its female citizens did not share all of the same rights as men, including the right to vote. On November 2 of that same year, more than 8 million women across the U.S. voted in elections for the first time. It took over 60 years for the remaining 12 states to ratify the 19th Amendment."}, {"url": "http://www.crf-usa.org/bill-of-rights-in-action/bria-20-2-b-have-women-achieved-equality", "passage_text": "Since 1920, women have won many other rights, but some people argue today that women have not yet achieved equality. After the ratification of the 19th Amendment in 1920, politicians learned that women, like men, did not always agree and vote as a bloc. At first women did not even vote in large numbers. "}, {"url": "https://en.wikipedia.org/wiki/Women%27s_Suffrage", "passage_text": "Women's suffrage (also known as woman suffrage or woman's right to vote) is the right of women to vote and to stand for electoral office. Limited voting rights were gained by women in Finland, Iceland, Sweden and some western U.S. states in the late 19th century. Propertied British women over 30 had the vote in 1918, Dutch women in 1919, and American women won the vote on 26 August 1920 with the passage of the 19th Amendment. Irish women won the same voting rights as men in the Irish Free State constitution, 1922. In 1928, British women won suffrage on the same terms as men, that is, for persons 21 years old and older. Suffrage of Turkish women introduced in 1930 for local elections and in 1934 for national elections"}]