[{"url": "http://www.klkntv.com/story/29347810/life-expectancy-varies-by-neighborhood", "passage_text": "A new study shows your life expectancy may be more determined by your zip code, than your DNA. This study was done by the Community Health Endowment of Lincoln. With their data they compiled maps to show what the life expectancy by neighborhoods looks like in the capital city."}, {"url": "http://journalstar.com/news/local/place-matters----life-expectancy/image_59d00561-b63c-5089-b042-fa38eaf278c5.html", "passage_text": "Print Email. When it comes to life expectancy -- where you live matters, as the Community Health Endowment of Lincoln notes in this year's annual report, Place Matters. The report and its geographic-specific health findings are the focus of Wednesday's annual meeting. June 10, 2015 5:53 pm • Courtesy image. Loading&#8230. View Comments."}, {"url": "http://journalstar.com/lifestyles/family/place-matters-lincoln-maps-highlight-health-disparities-across-neighborhoods-zip/article_1be90244-8533-5ad2-9e8b-2b632899cd5d.html", "passage_text": "The average life expectancy of a southeast Lincoln resident is 91.8 years."}, {"url": "http://www.klkntv.com/story/29347810/life-expectancy-varies-by-neighborhood", "passage_text": "In north Lincoln, life expectancy is in the mid to upper 70's, east Lincoln about 85 years and southwest Lincoln, about 80 years. Community Health Endowment of Lincoln CEO, Lori Seibel said, There are disparities that exist in our community."}, {"url": "http://www.chelincoln.org/", "passage_text": "At its Annual Meeting on June 17, CHE released the findings from “Place Matters”, a community mapping project that illustrates how your health is affected by where you live. The maps also depicted that life expectancy in Lincoln can vary by nearly three decades from neighborhood to neighborhood."}, {"url": "http://www.1011now.com/home/headlines/Your-Neighborhood-and-Life-Expectancy-307901311.html", "passage_text": "The organizations gathered information on demographic, socioeconomic and health indicators at the census tract level. What they found could tell Lincoln residents a lot about how these factors can impact their life expectancy. In 1980, 18 census tracts found at least 10 percent of residents were living in poverty."}]