[{"url": "http://www.nhs.uk/Conditions/Dehydration/Pages/Treatment.aspx", "passage_text": "The best way to treat dehydration is to rehydrate the body by drinking plenty of fluids, such as water, diluted squash or diluted fruit juice. A sweet drink can help to replace lost sugar, and a salty snack can help to replace lost salt."}, {"url": "http://www.webmd.com/first-aid/dehydration-in-adults-treatment", "passage_text": "1 The person should try to drink 2 quarts of fluid, such as water, juice, or sports drinks, in 2 to 4 hours. 2  But it is better to drink small amounts of fluid often, because drinking too much fluid at once can bring on vomiting. 3  The person should drink at least 10 glasses of liquid a day to replace lost fluids."}, {"url": "http://www.mayoclinic.org/diseases-conditions/dehydration/basics/treatment/con-20030056", "passage_text": "The only effective treatment for dehydration is to replace lost fluids and lost electrolytes. The best approach to dehydration treatment depends on age, the severity of dehydration and its cause."}, {"url": "http://www.wikihow.com/Treat-Dehydration", "passage_text": "Dehydration happens when you do not replace the water in your body that is lost throughout the day. Dehydration can be caused by exercise, illness, or simply not drinking enough water. Understanding the signs and knowing how to react are essential for good health and recovery."}, {"url": "http://www.mayoclinic.org/diseases-conditions/dehydration/basics/definition/con-20030056", "passage_text": "Definition. Dehydration occurs when you use or lose more fluid than you take in, and your body doesn't have enough water and other fluids to carry out its normal functions. If you don't replace lost fluids, you will get dehydrated."}, {"url": "http://www.webmd.com/fitness-exercise/dehydration-home-treatment", "passage_text": "1 Drink a rehydration drink, water, juice, or sports drink to replace fluids and minerals. 2  Drink 2 qt (2 L) of cool liquids over the next 2 to 4 hours. 3  You should drink at least 10 glasses of liquid a day to replace lost fluids."}, {"url": "http://www.webmd.com/fitness-exercise/dehydration-home-treatment", "passage_text": "1 Take off any extra clothes. 2  Drink a rehydration drink, water, juice, or sports drink to replace fluids and minerals. 3  Drink 2 qt (2 L) of cool liquids over the next 2 to 4 hours. 4  You should drink at least 10 glasses of liquid a day to replace lost fluids."}, {"url": "http://www.webmd.com/first-aid/dehydration-in-adults-treatment", "passage_text": "1. Replace Fluids. For mild dehydration or while waiting for medical care for an adult with severe dehydration that is not due to heat stroke 1  : The person should try to drink 2 quarts of fluid, such as water, juice, or sports drinks, in 2 to 4 hours."}]