[{"url": "http://textilelearner.blogspot.com/2012/01/acetate-fiber-characteristics-of.html", "passage_text": "Acetate Fiber: A manufactured fiber in which the fiber-forming substance is called cellulose acetate (FTC definition). Acetate ismanufactured by treating purified cellulose refined from cotton linters and/or wood pulp with acetic anhydride in the presence of a catalyst. The cellulose acetate fibers are intermingled and wound onto a bobbin or shippable metier cheese package, ready for use without further chemical processing. In the manufacture of staple fiber, the filaments from numerous spinnerets are combined into tow form, crimped, cut to the required length, and packaged in bales."}, {"url": "http://www.apparelsearch.com/definitions/fiber/acetate_definition.htm", "passage_text": "Cellulose acetate or acetate rayon fiber (1924) is one of the earliest synthetic fibers and is based on cotton or tree pulp cellulose (biopolymers). These cellulosic fibers have passed their peak as cheap petro-based fibers (nylon and polyester) and have displaced regenerated pulp fibers. "}, {"url": "http://www.textileschool.com/articles/366/man-made-regenerated-cellulose-fibres", "passage_text": "Acetate fibers are the manufactured fibers in which the fiber-forming substance is cellulose acetate. The cellulose esters triacetate and acetate are formed through acetylation of cotton linters or wood pulp using acetic anhydride and an acid catalyst in acetic acid. 1 Cellulose is an excellent fiber. 2  Cellulose is made of repeat units of the monomer glucose. 3  The three types of regenerated cellulosic fibres are rayon, acetate and triacetate which are derived from the cell walls of short cotton fibres called linters."}, {"url": "http://www.dharmatrading.com/acetate-fiber.html", "passage_text": "Federal Trade Commission Definition for Acetate Fiber: A manufactured fiber in which the fiber forming substance is cellulose acetate. Where not less than 92% of the hydroxyl groups are acetylated, the term triacetate may be used as a generic description of the fiber. After it is formed, cellulose acetate is dissolved in acetone for extrusion. As the filaments emerge from the spinneret, the solvent is evaporated in warm air (dry spinning) , producing fine filaments of cellulose acetate. Acetate Fiber Characteristics: 1  Luxurious feel and appearance. 2  Wide range of colors and lusters."}, {"url": "https://en.wikipedia.org/wiki/Cellulose_acetate", "passage_text": "Cellulose acetate fiber is one of the earliest synthetic fibers and is based on cotton or tree pulp cellulose (biopolymers). These cellulosic fibers have been replaced in many applications by cheaper petro-based fibers (nylon and polyester) in recent decades. Acetate fiber is known as modified or secondary acetate having two or more hydroxyl groups. Triacetate fibers, although no longer produced in the United States, contain a higher ratio of acetate-to-cellulose than do acetate fibers."}, {"url": "http://www.fibersource.com/f-tutor/acetate.htm", "passage_text": "Federal Trade Commission Definition for Acetate Fiber: A manufactured fiber in which the fiber forming substance is cellulose acetate. Where not less than 92% of the hydroxyl groups are acetylated, the term triacetate may be used as a generic description of the fiber. (Complete FTC Fiber Rules here .). Basic Principles of Acetate Fiber Production  Acetate is derived from cellulose by reacting purified cellulose from wood pulp with acetic acid and acetic anhydride in the presence of sulfuric acid."}, {"url": "https://en.wikipedia.org/wiki/Cellulose_acetate", "passage_text": "Cellulose acetate is the acetate ester of cellulose. It was first prepared in 1865. Cellulose acetate is used as a film base in photography, as a component in some coatings, and as a frame material for eyeglasses; it is also used as a synthetic fiber in the manufacture of cigarette filters and playing cards. Acetate fiber is known as modified or secondary acetate having two or more hydroxyl groups. Triacetate fibers, although no longer produced in the United States, contain a higher ratio of acetate-to-cellulose than do acetate fibers."}, {"url": "http://textilelibrary.weebly.com/uploads/1/1/7/4/11749432/15570324-textile-fibres-classificationppt.pdf", "passage_text": "ACETATE  A manufactured fiber in which the fiber forming substance is cellulose acetate.  Acetate is derived from cellulose by reacting purified cellulose from wood pulp with acetic acid and acetic anhydride in the presence of sulfuric acid. Traces of natural fibres have been located to ancient civilizations all over the gobe. For many thousand years, the usage of fiber was limited by natural fibres such as flax, cotton, silk, wool and plant fibres for different applications. Fibers can be divided into natural fibres and man-made or chemical fibres."}, {"url": "http://encyclopedia2.thefreedictionary.com/Acetate+Fibers", "passage_text": "Acetate fibers are molded from solutions of cellulose acetate in organic solvents (triacetate cellulose in a mixture of methylene chloride and alcohol, secondary cellulose acetate in acetone), usually by the so-called dry method. By this method filaments, the so-called acetate silk, are obtained. Later acetate fiber production decreased after the appearance of new types of valuable synthetic fibers. In 1967 the world output of acetate fibers was 397,000 tons, 6.4 percent of the total production of chemical fibers. Rogovin, Z. A. Osnovy khimii i tekhnologii proizvodstva khimicheskikh volokon, vol. 1, 3rd ed."}, {"url": "http://www.cirfs.org/ManmadeFibres/Fibrerange/Acetate.aspx", "passage_text": "Acetate and triacetate. The term acetate fibres is used to describe fibres made from cellulose acetate. The difference between acetate and triacetate fibres lies in the number of the cellulose hydroxyl groups that are acetylated. "}]