[{"url": "http://www.egardenplace.com/pruning-knock-out-roses-in-late-spring/", "passage_text": "The next time that you will prune your roses will be in late November when most of the foliage has fallen to the ground. This is what my established Knock Out roses looked like BEFORE I pruned them. You can see the purple ribbon that I have tied to a stake so you can determine just how much I have pruned. Remove at least 12″ of new growth with pruners or shears. The answer is clearly no. The reason that I suggest to prune your roses now is to remove the first heavy flush of growth after your Knock Out roses have passed their first full display of color."}, {"url": "http://www.egardenplace.com/pruning-knock-out-roses-in-late-spring/", "passage_text": "If you decide not to prune them, they will continue to grow and bloom all summer, but the roses will get large. If you have your Knock Out roses as a landscape plant and you have plenty of room for them to grow, you may not need to prune your roses as heavy as I am suggesting. The answer is clearly no. The reason that I suggest to prune your roses now is to remove the first heavy flush of growth after your Knock Out roses have passed their first full display of color."}, {"url": "http://www.bbc.co.uk/gardening/basics/techniques/pruning_roses1.shtml", "passage_text": "1 Prune in mid-spring. 2  First remove dead, diseased and dying branches. 3  Prune most by about half, cutting to within 8cm (3in) of the previous year's growth. 4  Miniature roses only need pruning to maintain an attractive shape and if you want a larger floribunda, prune less severely. "}, {"url": "http://www.rosemagazine.com/pages/pruning.asp", "passage_text": "The time of year for pruning roses depends on where you live. It is a good idea to prune back long canes in the fall before winter winds and storms can cause windrock or loosening of the roots. You can also avoid damage or breakage of long canes if they are slightly cut back at this time. "}, {"url": "http://www.heirloomroses.com/care/pruning/", "passage_text": "If you prune in the spring, you will lose all of that year’s bloom. Old Garden Roses can be pruned to 15 inches every other year without damage. This keeps a large bush within bounds and provides shaping. For most roses, spring pruning should reduce the overall height of the bush to 18-24.. The shorter you prune – the fewer blooms you will have, but generally these blooms will be larger. Leaving taller canes will produce smaller blooms in more abundance."}, {"url": "http://www.almanac.com/plant/roses", "passage_text": "You have different varieties of roses and some may start growing leaves earlier than others. It's recommended that you feed your roses when you prune in the spring. You can add compost to the soil or use rose food or an all purpose fertilizer. You can also give the roses a handful of Epsom salts for an extra dose of magnesium. It's better to move roses when they are dormant (late winter, early spring). But you can transplant them now, if you do it soon, the roots need some time to get established in the new location before the soil freezes. Water the roses well the days before digging them up. Don't prune the roses way back."}, {"url": "http://www.bhg.com/gardening/flowers/roses/tips-for-pruning-roses/", "passage_text": "In general, you will be pruning just before the plant breaks dormancy after spring's final frost. This will be early in the year in warm climates, and anytime between January and April in cold climates. If it's old roses you are tending, prune them after blooming. They bear flowers on last year's wood. Cut away the dead wood first -- it will help you see the shape of the plant without distraction. It's a good idea to visit a public rose garden and find specimens of roses you are growing"}, {"url": "http://www.dilip.info/roses/HowTo/pruning.html", "passage_text": "You should expect blooms about 6-8 weeks after pruning; keep this in mind if you need roses for a rose show or special event. If you prune too early, you risk late winter freezes of the new growth you have encouraged, which will die back. It is important to prune according to the type of rose you have; more on this later. In general, pruning helps keep the rose plant healthy, encourages more (light or moderate pruning) or larger (more severe pruning, as is commonly done with hybrid teas) blooms, and allows you to help shape the bush."}, {"url": "http://www.thegardenrose.com/too-late-to-prune-rose-bushes", "passage_text": "you could lightly prune know cut back to just above a side shoot. Prune roses with a slanting cut, directly above an outward facing bud – the cut should slope away from the bud. With all plants, start by removing dead, diseased or dying branches. . Prune shrub roses in mid-spring. Remove about a quarter of growth and any old branches causing congestion. Prune bush roses in mid-spring. These can be pruned quite hard, reducing plants by up to a half or to within 8cm (3in) of the previous year’s growth. Prune climbers in autumn as flowers fade. Cut side branches to leave two leaf buds and tie in new shoots. "}]