[{"url": "http://learn.org/articles/How_Much_Do_Security_Guard_Jobs_Pay.html", "passage_text": "Salary by Experience. According to PayScale.com in January 2014, reported wages for security guards with less than a year of experience were $13,289-$52,148. Salaries increased to $17,879-$42,282 with 1-4 years of experience and to $19,923-$38,849 with 5-9 years of experience. The industries with the highest levels of employment for security guards in May 2012 were investigation and security services, local government, hospitals, schools and traveler accommodation. Average salaries for these industries were $25,340, $31,590, $31,820, $31,140 and $28,680, respectively."}, {"url": "https://www.recruiter.com/salaries/security-guards-salary/", "passage_text": "A Security Guard can earn a salary of between 16000 to 24000 depending on education and experience. Security Guards can expect an average compensation of Twenty Six Thousand Four Hundred dollars every year. Security Guards are paid the highest in Louisiana, where they earn an average job salary of approximating $40120. People with these jobs can make the most money in Professional, Scientific, and Technical Services, where they earn job pay of $47620. The national wage distribution is shown below."}, {"url": "https://answers.yahoo.com/question/index?qid=20090611130854AAGtpYP", "passage_text": "But here in the U.S. on average, Unarmed Guards make between $8.00-12.00 bucks an hour. For armed security, they make between $16.00-25.00 bucks an hour. Some security professions can even pay a lot more than that, it really all depends on the field and the level of training/responsibility. "}, {"url": "http://www.ehow.com/info_8425270_much-do-security-guards-make.html", "passage_text": "Pay for security guards is affected somewhat by the industry in which they work. Of the 1,028,830 guards employed in 2009, the Bureau of Labor Statistics indicates that 598,790 of them worked for various investigative and security services. These guards made an average annual salary of $24,450 per year, as of May 2009. The Bureau of Labor Statistics notes that the average pay for security guards nationwide was $26,430 annually, or $12.70 per hour, as of May 2009. The median pay was $23,820 in annual salary or $11.45 per hour"}, {"url": "http://www.access2knowledge.org/jobs-education/how-much-do-security-guards-make/", "passage_text": "Salary. How much does a salary guard make? According to the Bureau of Labor Statistics May 2012 records, the 1,046,420 security guards employed throughout the United States earn an average yearly security guard salary of $27,240, or a mean hourly wage of $13.10. Security guards employed in investigation and security services earn slightly less than average at $25,340, but those that work for banks and monetary authorities make considerably more at an annual average salary of $38,570."}, {"url": "http://www.ehow.com/info_8425270_much-do-security-guards-make.html", "passage_text": "According to the Bureau of Labor Statistics, the average annual salary for security guards was highest in Alaska at $37,030 per year, as of 2009. Guards in the District of Columbia and in the state of Washington pulled in the next highest salaries, at $37,010 and $35,420 per year, respectively. The Bureau of Labor Statistics notes that the average pay for security guards nationwide was $26,430 annually, or $12.70 per hour, as of May 2009. The median pay was $23,820 in annual salary or $11.45 per hour"}, {"url": "http://www.payscale.com/research/US/Job=Security_Guard/Hourly_Rate", "passage_text": "Security Guard Salary. (United States). Security Guards in the United States take home an average $10.42 per hour. Compensation ranges from $8.47 per hour on the lower end to $14.97 on the higher end. While the company and tenure impact pay for this group, geographic location is the most influential factor. After working for 10 to 20 years, Security Guards make a median salary of $25K. In the end, more experience does seem to mean larger paychecks; seasoned Security Guards with more than 20 years of experience earn a predictably higher median salary of $27K."}, {"url": "http://www.ehow.com/info_8425270_much-do-security-guards-make.html", "passage_text": "The salary tracking website PayScale breaks down security guard pay by the number of years of experience. Guards with less than one year of experience made a range of pay from about $8.70 to 11.09 per hour, as of April 2011. The Bureau of Labor Statistics notes that the average pay for security guards nationwide was $26,430 annually, or $12.70 per hour, as of May 2009. The median pay was $23,820 in annual salary or $11.45 per hour"}]