[{"url": "https://en.wikipedia.org/wiki/Cocoa_bean", "passage_text": "The cocoa bean, also cacao bean or simply cocoa (/ˈkoʊ.koʊ/) or cacao (/kəˈkaʊ/), is the dried and fully fermented fatty seed of Theobroma cacao, from which cocoa solids and cocoa butter are extracted. They are the basis of chocolate, as well as many Mesoamerican foods such as mole sauce and tejate. Cocoa trees grow in hot, rainy tropical areas within 20° of latitude from the equator. Cocoa harvest is not restricted to one period per year and a harvest typically occurs over several months. In fact, in many countries cocoa can be harvested at any time of the year."}, {"url": "https://www.cadbury.com.au/About-Chocolate/Cocoa-Growing-Countries.aspx", "passage_text": "Cocoa Growing Countries. The cocoa tree is a native of the Amazon basin and other tropical areas of South and Central America, where wild varieties still grow in the forests, but the cocoa growing area has extended to the Carribbean and beyond. Different types of cocoa are selected for cultivation in the various growing areas. West Africa. Ghana, which grows some of the best quality cocoa in the world, Nigeria and Cote D'Ivore. Cocoa was first planted in Ghana, now a major producer, in 1879 and as in the rest of West Africa, cocoa is grown almost entirely on small family farms."}, {"url": "http://www.answers.com/Q/Where_does_chocolate_grow", "passage_text": "A lot of countries grow cocoa beans but the main ones are: • West Africa-Ghana which grows some of the best quality cocoa in the world, Nigeria and Cote D'Ivoire • … South America-Brazil and Ecuador • Asia-Malaysia and Indonesia, where cocoa is a relatively new crop, are becoming increasingly important growing areas. "}, {"url": "http://www.amanochocolate.com/faqs/where-do-cocoa-beans-grow/", "passage_text": "Cocoa beans grow into beautiful trees; these trees grow most successfully in a narrow band called the Cocoa Belt or the Chocolate Belt; this band extends up to 20 degrees of latitude north and south of the equator. One of the reasons why people ask us “Where do cocoa beans grow” is because they are interested in knowing whether they can grow cocoa beans in their house into a cocoa tree. Unfortunately, it is very difficult to grow cocoa trees indoors – especially in the United States"}, {"url": "http://www.gardenguides.com/93918-grow-cocoa-plant.html", "passage_text": "Overview. Cocoa plant varieties grow wild in the Amazon basin of South America. Of the 20 species of cocoa plants, the cocoa tree (Theobroma cacao) serves as the most widely grown and popular. Known for its use in creating chocolate for confectionery industries, the cocoa plant now grows in 58 countries and the crop covers more than 17 million acres. "}, {"url": "http://facts-about-chocolate.com/where-does-chocolate-come-from/", "passage_text": "Actually, it DOES grow on trees. It all starts with a small tropical tree, the Theobroma cacao, usually called simply, “cacao.” (Pronounced ka-KOW. Theobroma is Greek for “food of the gods.”) Cacao is native to Central and South America, but it is grown commercially throughout the tropics. About 70% of the world’s cacao is grown in Africa"}, {"url": "http://www.fao.org/docrep/006/AD220E/AD220E01.htm", "passage_text": "WHY COCOA IS GROWN. People grow cocoa trees in order to sell the cocoa beans that are in the pods. The kernel of the cocoa beans is used to make cocoa and chocolate. In the countries of Europe and North America people eat a lot of cocoa and chocolate. But the cocoa tree does not grow in their countries; they buy cocoa from Africa. The countries of Africa earn a lot of money by selling their cocoa. "}, {"url": "http://www.amanochocolate.com/faqs/where-do-cocoa-beans-grow/", "passage_text": "Cocoa beans grow best where there are fairly constant, warm or even hot temperatures all year round (usually in the 65 to 90 degree F range). For cocoa beans to thrive, they need high humidity and a lot of rainfall (from about 40 to 100 inches per year). One of the reasons why people ask us “Where do cocoa beans grow” is because they are interested in knowing whether they can grow cocoa beans in their house into a cocoa tree. Unfortunately, it is very difficult to grow cocoa trees indoors – especially in the United States"}, {"url": "https://en.wikipedia.org/wiki/Theobroma_cacao", "passage_text": "Theobroma cacao also cacao tree and cocoa tree, is a small (4–8 m (13–26 ft) tall) evergreen tree in the family Malvaceae, native to the deep tropical regions of Central and South America. Its seeds, cocoa beans, are used to make cocoa mass, cocoa powder, and chocolate. "}]