[{"url": "http://www.forbes.com/sites/perianneboring/2014/04/25/the-death-of-the-death-care-industry-and-eternal-life-online/", "passage_text": "The increased cost of overhead, including real estate, other building costs, and labor, factor into the increase in funeral prices, however, this is a small piece of the puzzle. Even Wilde was somewhat stumped as to what else is driving up the cost of funeral services. “A government program is the nearest thing we’ll ever see to eternal life on earth.” -President Ronald Reagan. Death is a dying industry with an economic phenomenon. As Americans perceived value of “traditional” funerals diminish, the cost of funerals have increased nearly 1,328% in just four decades."}, {"url": "https://www.funeralwise.com/plan/costs/funeral-insurance/", "passage_text": "The most important benefit of funeral insurance is financial security for your family. According to the 2010 General Price List Survey by the National Funeral Directors Association, the average cost of a traditional funeral is over $7,700, not including cemetery costs. "}, {"url": "http://www.forbes.com/sites/perianneboring/2014/04/25/the-death-of-the-death-care-industry-and-eternal-life-online/", "passage_text": "The most expensive cost of a funeral is the casket, which on average has a mark-up of 289% from wholesale to retail, but sometimes is much higher. Under The Funeral Rule, funeral service providers must produce a “General Price List” for all the funeral goods and services they offer. “A government program is the nearest thing we’ll ever see to eternal life on earth.” -President Ronald Reagan. Death is a dying industry with an economic phenomenon. As Americans perceived value of “traditional” funerals diminish, the cost of funerals have increased nearly 1,328% in just four decades."}, {"url": "http://www.funeralplanning101.com/funeral-costs/", "passage_text": "A guide to various aspects of funeral expenses. According to most sources, the cost of a funeral is one of the three or four most expensive consumer purchases. Traditional Funerals can cost upwards of $15000. They definitely don't have to be so expensive, and there's no reason (other than stubborn sentimentalism) to believe that paying so much for a funeral is somehow a sign of love for the departed."}, {"url": "http://www.mydollarplan.com/average-funeral-cost/", "passage_text": "Casket Cost. Another major funeral cost is the casket. There are many choices of caskets available from cardboard to stainless steel. According to the Casket & Funeral Supply Association of America, metal caskets were the predominant choice with 65 percent of all caskets sold in 2007. Average Funeral Costs. According to the Federal Trade Commission, the average funeral costs in the United States can be well over $10,000 by the time you add floral arrangements, prayer cards and family transportation. Traditionally, when people think of funeral expenses they think of things like a casket and flowers."}, {"url": "http://www.nbcnews.com/business/cremation-hottest-trend-funeral-industry-1B8068228", "passage_text": "But the main reason, as you might expect, is cost. Cremation is cheaper than burial. The average cost of a funeral today is about $6,500, including the typical $2,000-or-more cost of a casket. Add a burial vault, and the average jumps to around $7,700. A cremation, by contrast, typically costs a third of those amounts, or less. In a tough economy like the current one, cost counts – a lot. "}, {"url": "http://www.canadianfunerals.com/cremations.html", "passage_text": "So why is cremation on the increase? Most in the industry would claim that the primary reason is cost. Whereas a traditional funeral with burial can amount to a total cost in the region of $10,000, a simple cremation can start at around $1,200. People who are opting for cremation are now just thinking practically."}, {"url": "http://www.cnbc.com/id/100391603", "passage_text": "But the main reason, as you might expect, is cost. Cremation is cheaper than burial. In fact, the average cost of a funeral today is about $6,500, including the typical $2,000-or-more cost of a casket. Add a burial vault, and the average jumps to around $7,700. A cremation, by contrast, typically costs a third of those amounts, or less. In a tough economy like the current one, cost counts – a lot."}, {"url": "http://www.canadianfunerals.com/funeral-related-articles/differences-in-cost-between-burial-and-cremation-in-canada.html", "passage_text": "However, the cost of a funeral can still vary significantly depending on where you live and which funeral services provider you use. Be sure to check what kind of funeral business you are dealing with. As a very general guide a cremation is likely to cost a quarter of the cost of a burial. A simple, direct cremation in Canada can start at around $600, whereas a cremation with a service, and extra disbursements (obit notice, viewing, funeral flowers, etc), may cost in the region of $4,500."}]