[{"url": "http://www.biography.com/people/charles-schulz-222709", "passage_text": "Charles Schulz, born in Minneapolis, Minnesota, on November 26, 1922, launched his comic strip Peanuts in 1950. Featuring hero Charlie Brown, over the years the strip would run in more than 2,000 newspapers and in many languages."}, {"url": "http://www.huffingtonpost.com/2012/11/26/happy-birthday-charles-sc_n_2188327.html", "passage_text": "Today is the birthday of American cartoonist Charles Monroe Schulz. The  Peanuts  creator would turn 90 years old if he were still alive today. Born in Minneapolis, Minnesota, Schulz is remembered most fondly for the wholesome characters he created throughout his 50-year-long career."}, {"url": "http://www.imdb.com/name/nm0776433/bio", "passage_text": "Mini Bio (1). Charles M. Schulz was born on November 26, 1922 in St. Paul, Minnesota, USA as Charles Monroe Schulz. He was a writer and producer, known for A Charlie Brown Christmas (1965), Bon Voyage, Charlie Brown (and Don't Come Back!!) (1980) and A Boy Named Charlie Brown (1969)."}, {"url": "http://www.nytimes.com/learning/general/onthisday/bday/1126.html", "passage_text": "Charles Monroe Schulz, the son of Carl Schulz, a barber, like Charlie Brown's father, and the former Dena Halverson, was born in Minneapolis on Nov. 26, 1922."}, {"url": "http://www.huffingtonpost.com/2013/11/26/charles-schulz-birthday_n_4339337.html", "passage_text": "Today is the birthday of American cartoonist Charles Monroe Schulz, that beloved Peanuts creator who would turn 91 years old if he were still alive today. Born in Minneapolis, Minnesota, Schulz is remembered most fondly for the wholesome characters he created throughout his 50-year-long illustration career."}, {"url": "http://www.notablebiographies.com/Ro-Sc/Schulz-Charles-M.html", "passage_text": "Charles Monroe Schulz was born in Minneapolis, Minnesota, on November 26, 1922, the son of Carl and Dena Halverson Schulz. His father was a barber."}, {"url": "http://www.imdb.com/name/nm0776433/", "passage_text": "Charles M. Schulz was born on November 26, 1922 in St. Paul, Minnesota, USA as Charles Monroe Schulz. He was a writer and producer, known for A Charlie Brown Christmas (1965), Bon Voyage, Charlie Brown (and Don't Come Back!!) (1980) and A Boy Named Charlie Brown (1969)."}]