[{"url": "http://homlegal.com/Attorneys/Robert-S-Ocko.shtml", "passage_text": "Mr. Ocko has over 30 years of experience representing corporations, limited liability companies, partnerships and individuals in the areas of corporate, business, commercial and residential real estate; state, federal and international tax law; estate planning and trust and estate administration."}, {"url": "http://www.nasa.gov/centers/goddard/about/organizations/OCKO/about/index.html", "passage_text": "The office also conducts Knowledge Sharing Workshops, which provide discussion forums on relevant topics or recently launched Goddard Missions. The OCKO has produced a number of case studies to enhance participants' learning in the Road to Mission Success workshop series and other Knowledge Sharing Workshops."}, {"url": "http://www.nasa.gov/centers/goddard/about/organizations/OCKO/about/index.html", "passage_text": "About the Office of the Chief Knowledge Officer (OCKO). The Office of the Chief Knowledge Officer (OCKO) is responsible for assuring that the Center operates as a learning organization. It is responsible for policy and guidance on Lessons Learned, Knowledge Management and Learning Practices."}, {"url": "http://www.nasa.gov/centers/goddard/about/organizations/OCKO/about/index.html", "passage_text": "The role of the OCKO is to design, develop and deploy meaningful learning activities that augment individual learning, sharing and collaboration."}, {"url": "http://blogs.wsj.com/venturecapital/2014/12/23/vc-in-2015-matt-ocko-of-data-collective-on-early-stage-investment/", "passage_text": "Matt Ocko. Venture capital exploded in 2014, with bigger deals and more eye-popping valuations than anytime since the dot-com boom. So what happens next, and which opportunities will define 2015?"}, {"url": "http://www.nasa.gov/centers/goddard/about/organizations/OCKO/about/index.html", "passage_text": "Finally, the OCKO developed the Pause & Learn (PaL) process as a facilitated team meeting for reflective learning. PaLs are often used to informally transfer individual lessons about a specific project event within a rich context of discussion. The OCKO is led by Dr. Edward W. Rogers, Goddard’s Chief Knowledge Officer."}, {"url": "http://homlegal.com/Attorneys/Robert-S-Ocko.shtml", "passage_text": "Robert Ocko is the managing partner of the corporate and real estate practice groups at Harrington, Ocko & Monk, LLP."}, {"url": "https://www.linkedin.com/in/mattocko", "passage_text": "Matt holds a BA in Physics from Yale University. Matt has been a Partner of VantagePoint Venture Partners and General Partner of Softbank Technology Ventures (of which he was a founder)."}]