[{"url": "http://supernatural.wikia.com/wiki/Astaroth", "passage_text": "1 Although she was not named in the episode, Astaroth's name was revealed in the Supernatural Companion for Season 3. 2  Astaroth was the second demon of lore to appear in the show; the first was Azazel. 3  In lore, Astaroth is the demon of laziness, vanity and rationalization. Astaroth was a powerful demon who worked to condemn human souls to Hell by turning them into witches. She turned Renee Van Allen, Elizabeth, and Amanda Burns into witches, which resulted in several deaths, including the entire coven in question."}, {"url": "http://tapestry.wikia.com/wiki/Astaroth", "passage_text": "Astaroth is the primary antagonist of the Tapestry. He appears to be an ancient demon/deity whose goal is to seek out the Book of Thoth and use it to re-shape the world. David Menlo suspects that what he craves is not power but approval. Astaroth is an ancient being of prodigious magical might, and is easily one of the series' most powerful characters. Shapechanging: Astaroth may alter his shape at will into any form he desires. Devour: Astaroth can consume other magical beings to gain their power, as he did with Elias Bram."}, {"url": "https://en.wikipedia.org/wiki/Astaroth", "passage_text": "Background [edit]. The name Astaroth was ultimately derived from that of 2nd millennium BC Phoenician goddess Astarte, an equivalent of the Babylonian Ishtar, and the earlier Sumerian Inanna. According to Francis Barrett (c. 1801), Astaroth is the prince of accusers and inquisitors. In art, in the Dictionnaire Infernal (1818), Astaroth is depicted as a nude man with feathered wings, wearing a crown, holding a serpent in one hand, and riding a beast with dragon-like wings and a serpent-like tail."}, {"url": "http://catherine.wikia.com/wiki/Astaroth", "passage_text": "Astaroth is one of the many avatars of Ishtar (Trisha, the Midnight Venus), Goddess of Fertility. The name Astaroth is derived from the goddess Astarte who is the Phoenician equivalent of Ishtar. He is the mastermind behind the entire plot of the game: the weakening deaths and the nightmares."}, {"url": "http://www.gods-and-monsters.com/astaroth.html", "passage_text": "Astaroth is undoubtedly one of the oldest demons as well as one of the most powerful and respected. She was an early goddess among the Sumerians, known to them as the Queen of Heaven. Astaroth is something of a politician among the demons. She counsels both humans and demons alike, but only those humans who still believe in her as a goddess. She can help one gain a good reputation and can create friendships between her followers and people with power and status in society."}, {"url": "https://shinrabanshochocolate.wordpress.com/astaroth/", "passage_text": "Astaroth (アスタロット, also Astarot or Asutarotto) is one of the earliest characters introduced, initially appearing in Volume 2 of the first card series (7/18/2005). She is the reason most English speakers are aware of Shinra Bansho at all, thanks to her popularity in fan art, cosplay, and doujinshi over the years. "}, {"url": "https://en.wikipedia.org/wiki/Astaroth", "passage_text": "Astaroth illustration from the Dictionnaire Infernal (1818). Astaroth (also Ashtaroth, Astarot and Asteroth), in demonology, is a Crowned Prince of Hell. He is a male figure named after the Canaanite goddess Ashtoreth. According to Francis Barrett (c. 1801), Astaroth is the prince of accusers and inquisitors. In art, in the Dictionnaire Infernal (1818), Astaroth is depicted as a nude man with feathered wings, wearing a crown, holding a serpent in one hand, and riding a beast with dragon-like wings and a serpent-like tail."}, {"url": "http://demons.wikia.com/wiki/Astaroth", "passage_text": "190 pages on this wiki. The name Astaroth (sometimes spelled Ashtaroth) probably derives from Astarte, a canaanite fertility goddess worshipped by the Philistines and at Sidon. She was also an early goddess among the Sumerians, known to them as the Queen of Heaven. The demon Astaroth was once considered Queen of Heaven to Sumerians. She also played a major role in the early development of other ancient cultures such as the Phoenicians, Babylonians, Canaanites, and Egyptians. In each culture she played a slightly different role, but was always a powerful mother figure."}, {"url": "http://supernatural.wikia.com/wiki/Astaroth", "passage_text": "Astaroth was hundreds of years old. In the fourteenth century, she came into contact with a human whom she taught witchcraft to in exchange for the human's soul, which went to Hell and became another demon, named Ruby. Astaroth herself later ended up in Hell. Astaroth was a powerful demon who worked to condemn human souls to Hell by turning them into witches. She turned Renee Van Allen, Elizabeth, and Amanda Burns into witches, which resulted in several deaths, including the entire coven in question."}, {"url": "https://en.wikipedia.org/wiki/Astaroth", "passage_text": "The name Astaroth as a male demon is first known from The Book of Abramelin, purportedly written in Hebrew ca. 1458, and recurred in most occult grimoires of the following centuries. Astaroth also features as an arch-demon associated with the qliphoth (adverse forces) according to later Kabbalistic texts. According to Francis Barrett (c. 1801), Astaroth is the prince of accusers and inquisitors. In art, in the Dictionnaire Infernal (1818), Astaroth is depicted as a nude man with feathered wings, wearing a crown, holding a serpent in one hand, and riding a beast with dragon-like wings and a serpent-like tail."}]