[{"url": "https://en.wikipedia.org/wiki/Honolulu", "passage_text": "Honolulu is a major financial center of the islands and of the Pacific Ocean. The population of Honolulu CCD was 390,738 at the 2010 census, while the population of the consolidated city and county was 953,207. These indicate that there was a settlement where Honolulu now stands in the 11th century. However, after Kamehameha I conquered Oʻahu in the Battle of Nuʻuanu at Nuʻuanu Pali, he moved his royal court from the Island of Hawaiʻi to Waikīkī in 1804. His court relocated in 1809 to what is now downtown Honolulu."}, {"url": "http://www.answers.com/Q/What_is_the_island_of_Honolulu", "passage_text": "The distance between Honolulu, Hawaii and the Republic of the Marshall Islands is approximately 2500 miles.   In order to get there you either need to go by boat or fly to … Guam then do some short ranged island hopping to finally get to the Marshall Islands. It is a city and county. The island Honolulu is on is called O'ahu. Second of all, it is not the biggest. The island of Hawai'i … is"}, {"url": "https://www.hawaiianairlines.com/", "passage_text": "the Hawaiian Islands. Six of the main Hawaiian Islands are open to guests and each has a character all its own. Visit our Island Guide and find information on activities, nightlife, hole-in-the-wall restaurants, and more, all in one place. Just click on an island and explore."}, {"url": "http://hawaii.gov/hnl/", "passage_text": "Aloha. Welcome to the Official Honolulu International Airport website. HNL is the largest airport in the State of Hawaii and is located in Honolulu on the island of Oahu. From Honolulu you can fly to all of the Hawaiian islands. "}, {"url": "http://www.answers.com/Q/What_is_the_island_of_Honolulu", "passage_text": "There is no Honolulu Island. Honolulu is a city on the Island of Oahu. It is a city and county. The island Honolulu is on is called O'ahu. Second of all, it is not the biggest. The island of Hawai'i … is"}, {"url": "https://en.wikipedia.org/wiki/Honolulu", "passage_text": "Evidence of the first settlement of Honolulu by the original Polynesian migrants to the archipelago comes from oral histories and artifacts. These indicate that there was a settlement where Honolulu now stands in the 11th century. However, after Kamehameha I conquered Oʻahu in the Battle of Nuʻuanu at Nuʻuanu Pali, he moved his royal court from the Island of Hawaiʻi to Waikīkī in 1804. His court relocated in 1809 to what is now downtown Honolulu."}, {"url": "http://www.answers.com/Q/What_is_the_island_of_Honolulu", "passage_text": "No, Honolulu is a city on Oahu. The Big Island is named Hawaii. It is a city and county. The island Honolulu is on is called O'ahu. Second of all, it is not the biggest. The island of Hawai'i … is"}, {"url": "http://www.answers.com/Q/What_is_the_island_of_Honolulu", "passage_text": "The distance from Honolulu, Hawaii to Wake Island is 2,305 miles. A  flight takes about 4 hours 10 minutes. Wake Island is located just  north of the Marshall Islands. It is a city and county. The island Honolulu is on is called O'ahu. Second of all, it is not the biggest. The island of Hawai'i … is"}, {"url": "https://en.wikipedia.org/wiki/Honolulu", "passage_text": "[honoˈlulu]) is the state capital and the most populous city in the U.S. state of Hawaii. It is the county seat of the City and County of Honolulu. Hawaii is a major tourist destination and Honolulu, situated on the island of Oahu, is the main gateway to Hawaii and a major gateway into the United States. These indicate that there was a settlement where Honolulu now stands in the 11th century. However, after Kamehameha I conquered Oʻahu in the Battle of Nuʻuanu at Nuʻuanu Pali, he moved his royal court from the Island of Hawaiʻi to Waikīkī in 1804. His court relocated in 1809 to what is now downtown Honolulu."}, {"url": "https://en.wikipedia.org/wiki/Hawaii_(island)", "passage_text": "With an area of 4,028 square miles (10,430 km 2), it is larger than all of the other islands in the archipelago combined and is the largest island in the United States. The island of Hawaii is the third largest island in Polynesia, behind the two main islands of New Zealand. The island is often referred to as the Island of Hawaiʻi, the Big Island, or Hawaiʻi Island to distinguish between the island and the state. It is coterminous with Hawaiʻi County and includes the Hilo Micropolitan Statistical Area. As of the 2010 Census the population was 185,079. "}]