[{"url": "http://www.ehow.com/decision_6904561_long-frozen-shrimp-freezer-home_.html", "passage_text": "If you've bought frozen shrimp in their original packaging, the packaging will often have a Use-by or Best before date on it. That's the vendor's estimate of how long your shrimp will retain their best flavor and quality. Usually it will be 4 to 6 months for uncooked shrimp, or about half that for cooked. You can still eat them after that time -- they'll be safe for as long as they stay properly frozen -- but their texture will suffer, they'll begin to acquire off-flavors from the freezer, and eventually they'll succumb to freezer burn. Tip. For the longest storage life, keep your shrimp in a chest freezer rather than a refrigerator freezer. The relatively small freezer compartment in your fridge warms up quickly whenever you open it and takes time to return to its usual 0 degrees Fahrenheit."}, {"url": "http://www.answers.com/Q/How_long_does_frozen_shrimp_stay_good_in_the_freezer", "passage_text": "This food can stay good in the freezer for a long time. It can last up to 2 years if frozen properly. Place in an airtight container or freezer bag or freezer paper. Aproxame … tly 1 year after the expiration date if it has an experation date im not sure im allergic to basicly ALL seafood sorry! Raw frozen shrimp will last up to 6 months, wher … eas cooked frozen shrimp should be eaten with a 2 month time period. Commercially-frozen shrimp will last longer too because they've been flash-frozen. + 5 others found this useful."}, {"url": "http://www.eatbydate.com/proteins/seafood/how-long-does-shrimp-last/", "passage_text": "Shrimp Cindy 2015-04-21T07:21:57+00:00. How long does shrimp last? The shelf life of shrimp depends on a variety of factors, such as the sell by date, the preparation method and how they were stored. You can help shrimp keep fresh longer by storing it in your refrigerator immediately after purchase. Once prepared, shrimp should be stored in a tightly closed container to keep out moisture and other contaminants."}, {"url": "http://www.answers.com/Q/How_long_does_frozen_shrimp_stay_good_in_the_freezer", "passage_text": "How long does cooked frozen shrimp last in a freezer? Cooked shrimp can be stored in a sealed bag or ziplock for no longer than three days, even in the coldest part of your fridge. Raw frozen shrimp will last up to 6 months, wher … eas cooked frozen shrimp should be eaten with a 2 month time period. Commercially-frozen shrimp will last longer too because they've been flash-frozen. + 5 others found this useful."}, {"url": "http://www.answers.com/Q/How_long_can_you_keep_frozen_uncooked_shrimp", "passage_text": "This food can stay good in the freezer for a long time. It can last up to 2 years if frozen properly. Place in an airtight container or freezer bag or freezer paper. Aproxame … tly 1 year after the expiration date if it has an experation date im not sure im allergic to basicly ALL seafood sorry! Making the world better, one answer at a time. Most things frozen can last awhile, but....once you start to see lots of ice crystals on your frozen food, or places on the shrimp that might have dried out with some discoloration then it's probably freezer burnt and been in there too long. A couple months....."}, {"url": "http://www.answers.com/Q/How_long_can_you_keep_frozen_uncooked_shrimp", "passage_text": "ANSWER:Unless frozen, shrimp breaks down rather rapidly. If you peel and de-vein, and soak in salted water, you can keep shrimp in a 34.5 degree refrigerator for up to 4 days. … After that the shrimp will spoil. Making the world better, one answer at a time. Most things frozen can last awhile, but....once you start to see lots of ice crystals on your frozen food, or places on the shrimp that might have dried out with some discoloration then it's probably freezer burnt and been in there too long. A couple months...."}, {"url": "http://www.eatbydate.com/proteins/seafood/how-long-does-shrimp-last/", "passage_text": "36-8 Months Days. 9-12 Months (No can). Of course, shrimp lasts for a shorter period of time if it is not stored properly. But remember that shrimp, like a lot of other proteins, usually has a sell by date and not a use by date or expiration date. You can help shrimp keep fresh longer by storing it in your refrigerator immediately after purchase. Once prepared, shrimp should be stored in a tightly closed container to keep out moisture and other contaminants."}, {"url": "http://stilltasty.com/fooditems/index/18320", "passage_text": "1 Refrigerate within two hours of cooking. 2  Refrigerate cooked shrimp in covered airtight containers. 3  To freeze, place shrimp in airtight plastic containers or heavy-duty freezer bags. 4  Freezer time shown is for best quality only — foods kept constantly frozen at 0° F will keep safe indefinitely. "}]