[{"url": "https://en.wikipedia.org/wiki/Bromine", "passage_text": "It is a halogen. The element was isolated independently by two chemists, Carl Jacob Loewig löwig And Antoine Jerome, balard in–1825. 1826 elemental bromine is a fuming-red brown liquid at room, temperature corrosive and, toxic with properties between those of chlorine and. iodine Bromine is rarer than about three-quarters of elements in the Earth 's crust. The high solubility of bromide ions has caused its accumulation in the oceans, and commercially the element is easily extracted from brine pools, mostly in the United States, Israel and China."}, {"url": "http://environmentalchemistry.com/yogi/periodic/Br.html", "passage_text": "Element Bromine-Br. Comprehensive data on the chemical element Bromine is provided on this page; including scores of properties, element names in many languages, most known nuclides of Bromine. Common chemical compounds are also provided for many elements"}, {"url": "http://chemistry.about.com/od/elementfacts/a/bromine.htm", "passage_text": "1 Compounds containing bromine in the -1 oxidation state are called bromides. 2  Bromine is the tenth most abundant element in sea water with an abundance of 67.3 mg/L. 3  Bromine is the 64th most abundant element in the Earth's crust with an abundance of 2.4 mg/kg. 1 The only other element that is a liquid at room temperature is mercury. 2  Bromine is used in many fire retardant compounds. 3  Bromide compounds used to be used as sedatives. 4  The ancient royal purple dye called Tyrian Purple is a bromine compound. 5  Bromine was used in leaded fuels to help prevent engine knock."}, {"url": "http://www.webelements.com/bromine/", "passage_text": "Bromine: the essentials. Bromine is the only liquid nonmetallic element. It is a member of the halogen group. It is a heavy, volatile, mobile, dangerous reddish-brown liquid. The red vapour has a strong unpleasant odour and the vapour irritates the eyes and throat. It is a bleaching. When spilled on the skin it produces painful sores. "}, {"url": "https://en.wikipedia.org/wiki/Bromine", "passage_text": "Bromine (from Greek: βρῶμος, bromos, brómos meaning-strong smelling or) stench is a chemical element with Symbol, br and atomic number. 35 it is a. halogen Bromine is rarer than about three-quarters of elements in the Earth 's crust. The high solubility of bromide ions has caused its accumulation in the oceans, and commercially the element is easily extracted from brine pools, mostly in the United States, Israel and China."}, {"url": "http://chemistry.about.com/od/elementfacts/a/bromine.htm", "passage_text": "1 At room temperature, elemental bromine is a reddish-brown liquid. 2  The only other element that is a liquid at room temperature is mercury. 3  Bromine is used in many fire retardant compounds. 1 The only other element that is a liquid at room temperature is mercury. 2  Bromine is used in many fire retardant compounds. 3  Bromide compounds used to be used as sedatives. 4  The ancient royal purple dye called Tyrian Purple is a bromine compound. 5  Bromine was used in leaded fuels to help prevent engine knock."}, {"url": "http://www.chemistryexplained.com/elements/A-C/Bromine.html", "passage_text": "Overview. Bromine is a member of the halogen family. Halogens are the elements that make up Group 17 (VIIA) of the periodic table. The periodic table is a chart that shows how elements are related to one another. The halogens are also known as the salt formers. Bromine is too reactive to exist as a free element in nature. Instead, it occurs in compounds, the most common of which are sodium bromide (NaBr) and potassium bromide (KBr). These compounds are found in seawater and underground salt beds. These salt beds were formed in regions where oceans once covered the land."}, {"url": "http://www.chemistryexplained.com/elements/A-C/Bromine.html", "passage_text": "Bromine is a very reactive element. While it is less reactive than fluorine or chlorine, it is more reactive than iodine. It reacts with many metals, sometimes very vigorously. For instance, with potassium, it reacts explosively. Bromine even combines with relatively unreactive metals, such as platinum and palladium. Bromine is too reactive to exist as a free element in nature. Instead, it occurs in compounds, the most common of which are sodium bromide (NaBr) and potassium bromide (KBr). These compounds are found in seawater and underground salt beds. These salt beds were formed in regions where oceans once covered the land."}, {"url": "http://www.chem4kids.com/files/elements/035_speak.html", "passage_text": "Balard discovered the element in 1826. One of the very cool physical properties of bromine is that it is the only nonmetallic element that is a liquid at room temperature. Don't let that cool trait overwhelm you. Bromine is a very dangerous chemical, purified or in gas form. Bromine is a member of the halogen family of elements. When you think of bromine, think reddish-brown. Gases with bromine atoms often have a dirty color, they smell bad, and they might make your skin and nose irritated. The name bromine is even based on the Greek word bromos that means something that smells bad."}]