[{"url": "http://www.babynamespedia.com/meaning/Zaheer", "passage_text": "[ syll. za-hee(r) , zah-e- er ] The baby boy name Zaheer is pronounced ZAHHH-R †. Zaheer is of Arabic origin and it is also used largely in the Arabic language. Zaheer is a variant spelling of the Arabic, Hebrew, Swahili, and Turkish Zahir. Zaheer is not regularly used as a baby name for boys. It is not ranked within the top 1000 names"}, {"url": "http://hamariweb.com/names/muslim/arabic/boy/zaheer-meaning_3271", "passage_text": "Find Zaheer meaning and definition at Hamariweb.com name dictionary a Best place to find your accurate name meanings in Urdu. Zaheer name reviews, Origin, gender, rating an many more about Zaheer. Hello, I m Muhammad Zaheer i like sooo much my name and also i m proud that I m a muslim good means my name and also really i want help other pleople. and please if you can give more informition about my name my date of birth 02-02-1994 Thanks, Zaheer. great name."}, {"url": "http://www.babynamespedia.com/meaning/Zahir/m", "passage_text": "[ 2 syll. za-hir, zah-ir ] The baby boy name Zahir is also used as a girl name. It is pronounced as Z AA-HHih-R or Zey-HH IH-R †. Zahir is largely used in the Arabic, Hebrew, Swahili, and Turkish languages, and it is derived from Arabic origins. It is derived literally from the word 'zahir' meaning apparent, manifest, bright. The name Az-Zahir was borne as one of the many of names of Allah in the Quran, of the meaning 'The Manifest'. The name Zahira (Arabic and Spanish) is the female equivalent of Zahir. Zahir has 21 variants that are used in English and other languages."}, {"url": "http://avatar.wikia.com/wiki/Zaheer", "passage_text": "1 Zaheer is a common name in Asia and the Middle East that is inspired by the Islamic concept of Quran interpretation, which can be divided into its apparent meaning or zahir (Arabic: ظاهر ‎) and its inner meaning or batin (Arabic: باطن). "}, {"url": "http://islam.onepakistan.com.pk/urdu/name_meaning.php?eu=zaheer", "passage_text": "You have searched for Zaheer meaning in urdu or زہیر meaning in english in muslim baby name databasae, remember names selection is very important in the life of every muslim family with new born babies, so choose the best names according to meaning, history and characteristics associated with each name. "}, {"url": "http://www.thinkbabynames.com/meaning/1/Zaheer", "passage_text": "Zaheer /za-heer/ [3 sylls.] as a name for boys. Zaheer's name origin is Arabic, and the meaning of Zaheer is blossoming, flourishing. Zaheer is a variant transcription of Zahir (Arabic). Compare surname Zahar. Kreatif forms: Zalheer, Zanheer, Zeheer. Zaheer has 1 more different form via Zahir: Zayyir. Zaheer is a rare first name for males but a very popular surname for all people (#55237 out of 150436, Top 37%). (2000 U.S. Census). Displayed below is the birth name popularity of Zaheer for boys"}, {"url": "http://www.meaning-of-names.com/african-names/zaheer.asp", "passage_text": "Meaning of Zaheer. African name. In African, the name Zaheer means-supporter ally.The name Zaheer originated as an African name. The name Zaheer is most often used as a boy name or male name. African Name Meaning-supporter ally. Origin-Africa."}, {"url": "http://www.babynamespedia.com/meaning/Zahir/m", "passage_text": "Another foreign form is the variant spelling Zaheer (Arabic). Zahir is a rarely used baby name for boys. It is listed outside of the top 1000 names. In 2012, among the group of boy names directly linked to Zahir, Zaire was the most regularly used. The name Az-Zahir was borne as one of the many of names of Allah in the Quran, of the meaning 'The Manifest'. The name Zahira (Arabic and Spanish) is the female equivalent of Zahir. Zahir has 21 variants that are used in English and other languages."}, {"url": "http://www.sheknows.com/baby-names/name/zaheer", "passage_text": "Muslim Meaning: The name Zaheer is a Muslim baby name. In Muslim the meaning of the name Zaheer is: Supporter. Ally. SoulUrge Number: 11. Expression Number: 9. People with this name have a deep inner desire to inspire others in a higher cause, and to share their own strongly held views on spiritual matters. People with this name tend to be passionate, compassionate, intuitive, romantic, and to have magnetic personalities."}]