[{"url": "http://www.hopkinsmedicine.org/neurology_neurosurgery/centers_clinics/cutaneous_nerve_lab/patients/skin_anatomy.html", "passage_text": "1 Sensory Nerves-These are the nerves that innervate the epidermis. 2  These nerves are the subject of evaluation when examining a skin biopsy after it has been immunostained. 3  The sensory nerves in the epidermis serve to sense and transmit heat, pain, and other noxious sensations. A basic understanding of skin anatomy is important when explaining the process of skin biopsy. Each component of the skin plays a role in its daily function, therefore every component is a source of vital information that can be captured and assessed with a"}, {"url": "http://www.hopkinsmedicine.org/neurology_neurosurgery/centers_clinics/cutaneous_nerve_lab/patients/skin_anatomy.html", "passage_text": "1 Stratum Corneum-This is the dead skin layer that is visible when you look at your skin. 2  It functions to protect the living cells beneath by providing a hard barrier between the outside world and the delicate cells inside. A basic understanding of skin anatomy is important when explaining the process of skin biopsy. Each component of the skin plays a role in its daily function, therefore every component is a source of vital information that can be captured and assessed with a"}, {"url": "http://www.siumed.edu/~dking2/intro/skin.htm", "passage_text": "1 The epidermis is the epithelial tissue layer of skin. 2  Hair follicles, sebaceous glands, and sweat glands are epithelial invaginations from the epidermis. 3  The dermis is the connective tissue layer of skin. 4  Embedded within the dermis are hair follicles and sweat glands as well as blood vessels and sensory nerve endings. The skin has two principal layers. 1 "}, {"url": "http://www.histology.leeds.ac.uk/skin/skin_layers.php", "passage_text": "The dermis: a thicker inner portion. This is the connective tissue layer of skin. It is important for sensation, protection and thermoregulation. It contains nerves, the blood supply, fibroblasts, etc, as well as sweat glands, which open out onto the surface of the skin, and in some regions, hair. Three layers of skin: The epidermis: a thin outer portion, that is the keratinised stratified squamous epithelium of skin. The epidermis is important for the protective function of skin. The basal layers of this epithelium are folded to form dermal papillae. Thin skin contains four types of cellular layers, and thick skin contains five"}, {"url": "http://owh.adam.com/pages/guide/reftext/html/skin_sys_fin.html", "passage_text": "Back to top. Skin: dermal layers. The dermis, called true skin,  is the layer beneath the epidermis. Its major parts are collagen (a protein that adds strength), reticular fibers (thin protein fibers that add support), and elastic fibers (a protein that adds flexibility). Its two main layers are the epidermis (outer layer) and dermis (inner layer). The epidermis has several strata (layers) that contain four cell types. Keratinocytes produce keratin, a protein that gives skin its strength and flexibility and waterproofs the skin surface."}, {"url": "https://answers.yahoo.com/question/index?qid=20081012234001AA20jM1", "passage_text": "Best Answer: The upper layer of the slin is called the 'epidermis'. It contains no blood vessels or nerves. Blood nourishes this layer by diffusion. The middle layer of the skin, the layer that is asked about in this question is called the 'dermis' and conatins blood vessels, nerves and other structures. The lower layer of the skin is called the 'sub-cutis' and contains fat. "}, {"url": "http://www.merckmanuals.com/home/skin-disorders/biology-of-the-skin/structure-and-function-of-the-skin", "passage_text": "Dermis. The dermis, the skin's next layer, is a thick layer of fibrous and elastic tissue (made mostly of collagen, elastin, and fibrillin) that gives the skin its flexibility and strength. The dermis contains nerve endings, sweat glands and oil (sebaceous) glands, hair follicles, and blood vessel"}, {"url": "http://training.seer.cancer.gov/melanoma/anatomy/", "passage_text": "The outer layer is called the epidermis; it is a tough protective layer that contains the melanin-producing melanocytes. The second layer (located under the epidermis) is called the dermis; it contains nerve endings, sweat glands, oil glands, and hair follicles. Under these two skin layers is a fatty layer of subcutaneous tissue, known as the subcutis or hypodermis. The skin is a vital organ that covers the entire outside of the body, forming a protective barrier against pathogens and injuries from the environment. The skin is the body's largest organ; covering the entire outside of the body, it is about 2 mm thick and weighs approximately six pounds."}]