[{"url": "http://www.daveywaveyfitness.com/nutrition/8-side-effects-of-too-much-protein", "passage_text": "Protein isn’t particularly dangerous, but an over-consumption of protein may be associated with: 1  Weight gain. 2  Intestinal irritation. 3  Dehydration. 4  Seizures. 5  Increase in liver enzymes. 6  Nutritional deficiencies. 7  Risk of heart disease. 8  Kidney problems. Protein isn’t particularly dangerous, but an over-consumption of protein may be associated with: 1  Weight gain. 2  Excess calories from excess protein may be stored as body fat. 3"}, {"url": "http://healthyeating.sfgate.com/risks-associated-overconsumption-underconsumption-protein-1862.html", "passage_text": "If you have liver or kidney problems, eating too much protein can worsen your condition. If you don't get enough protein, you can develop a type of malnutrition called Kwashiorkor, which results in diarrhea, loss of muscle mass, fatigue, failure to thrive, frequent infections and swelling. If you’re healthy, over-consumption of protein likely won’t hurt you, as long as you are not eating too many foods high in saturated fat and skipping healthful carbohydrate-rich foods such as vegetables and fruit."}, {"url": "http://www.daveywaveyfitness.com/nutrition/8-side-effects-of-too-much-protein", "passage_text": "1 This is a bit misleading. 2  A healthy high-protein diet is not associated with heart disease. 3  But if you are getting all of your protein from unhealthy sources that are loaded in unhealthy fats, obviously the risk for heart disease will increase. 4  Kidney problems. Protein isn’t particularly dangerous, but an over-consumption of protein may be associated with: 1  Weight gain. 2  Excess calories from excess protein may be stored as body fat. 3  Intestinal irritation."}, {"url": "http://healthyeating.sfgate.com/risks-associated-overconsumption-underconsumption-protein-1862.html", "passage_text": "Under-consumption of protein is rare in the United States, and can lead to malnutrition and serious illness. Foods rich in proteins include animal-based foods such as meats, poultry, fish, eggs and dairy products. Among plant-based foods, the best protein sources include legumes such as beans, peas, peanuts and especially soybeans and soy-based foods. If you’re healthy, over-consumption of protein likely won’t hurt you, as long as you are not eating too many foods high in saturated fat and skipping healthful carbohydrate-rich foods such as vegetables and fruit."}, {"url": "http://healthyeating.sfgate.com/risks-associated-overconsumption-underconsumption-protein-1862.html", "passage_text": "Sources of Protein. Foods rich in proteins include animal-based foods such as meats, poultry, fish, eggs and dairy products. Among plant-based foods, the best protein sources include legumes such as beans, peas, peanuts and especially soybeans and soy-based foods. If you’re healthy, over-consumption of protein likely won’t hurt you, as long as you are not eating too many foods high in saturated fat and skipping healthful carbohydrate-rich foods such as vegetables and fruit."}, {"url": "http://www.daveywaveyfitness.com/nutrition/8-side-effects-of-too-much-protein", "passage_text": "1 A healthy high-protein diet is not associated with heart disease. 2  But if you are getting all of your protein from unhealthy sources that are loaded in unhealthy fats, obviously the risk for heart disease will increase. 3  Kidney problems. Protein isn’t particularly dangerous, but an over-consumption of protein may be associated with: 1  Weight gain. 2  Excess calories from excess protein may be stored as body fat. 3  Intestinal irritation."}, {"url": "http://www.healthguideinfo.com/diet-reviews/p4518/", "passage_text": "High protein diets can increase the risk of some types of cancer. Cancer risk is increased due to the lack of essential vitamins and antioxidants in the diet. Too much protein in the diet increases the risk of osteoporosis. High amounts of protein can cause the body to excrete calcium in the urine. High protein diets that rely on large amounts of animal protein can increase the risk of heart disease, due to higher cholesterol intake. slide 4 of 4"}, {"url": "https://answers.yahoo.com/question/index?qid=20080508064928AAjif8d", "passage_text": "Kidney function can be compromised by too much protein in older people and in patients with kidney disease; also, a high protein intake may adversely affect calcium balance and contribute to mineral loss from bone. Best Answer: The previous poster is correct. I found this: Excessive protein consumption may be associated with health risks."}]