[{"url": "https://www.psychologytoday.com/basics/dopamine", "passage_text": "Dopamine is a neurotransmitter that helps control the brain 's reward and pleasure centers. Dopamine also helps regulate movement and emotional responses, and it enables us not only to see rewards, but to take action to move toward them. Dopamine deficiency results in Parkinson's Disease, and people with low dopamine activity may be more prone to addiction. The presence of a certain kind of dopamine receptor is also associated with sensation-seeking people, more commonly known as risk takers.."}, {"url": "https://www.dnalc.org/view/812-The-Dopamine-System.html", "passage_text": "Professor Trevor Robbins explains that the dopamine system is a group of cells originating in the midbrain whose function may be to prepare the brain to think, move, and anticipate rewards. Transcript: The dopamine system is basically a group of nerve cells, most of which originate in the midbrain."}, {"url": "http://www.wisegeek.org/what-is-dopamine.htm", "passage_text": "Dopamine is a neurotransmitter that is produced by the brains of many organisms, including humans. Like many neurotransmitters, it has several different functions. It plays a critical role in the function of the central nervous system, and it is also linked with the brain 's complex system of motivation and reward."}, {"url": "https://www.dnalc.org/view/812-The-Dopamine-System.html", "passage_text": "There is a very famous branch which goes to a structure called the striatum, which is implicated in Parkinson’s disease. Here dopamine is involved in facilitating movements. So in Parkinson’s disease, when you lose dopamine, your movements become rigid and rather reduced in number and amplitude."}, {"url": "http://alcoholrehab.com/addiction-articles/mesolimbic-dopamine-system/", "passage_text": "There are five known kinds of dopamine receptors in the human brain. These receptors are able to detect the neurotransmitter dopamine and activate a response. Dopamine receptors are found in the brain, the blood vessels, the kidneys, and the central nervous system."}, {"url": "http://alcoholrehab.com/addiction-articles/mesolimbic-dopamine-system/", "passage_text": "The mesolimbic dopamine system is a pathway in the brain in which dopamine is carried from one area of the brain to another. Dopamine is responsible for controlling the brain’s pleasure and reward centers."}]