[{"url": "http://www.novel-writing-help.com/3rd-person.html", "passage_text": "The chances are that you could write two versions of a novel-one in 3rd person point of view, the other in 1st-and both would turn out fine, just differently. And the beauty of fiction writing is that you can always change your mind..."}, {"url": "http://fictionwriting.about.com/od/glossary/g/3rdperson.htm", "passage_text": "Definition: The third person point of view is a form of storytelling in which a narrator relates all action in third person, using third person pronouns such as he or she.. Third person point of view may be omniscient or limited."}, {"url": "http://www.novel-writing-help.com/3rd-person.html", "passage_text": "1 (Although this advantage really isn't a deal-breaker if you want to write a first person novel.). 2  Third person isn't claustrophobic like first person can be-and it is more objective, too, presenting a more rounded portrait of the central character."}, {"url": "http://www.wisegeek.org/what-is-the-difference-between-first-person-second-person-and-third-person.htm", "passage_text": "The use of first, second, and third person creates the perspective or point of view of a piece of writing. Writing in first person uses the personal pronouns I, we, me, and us, and the possessive forms my, mine, our, and ours; while second person uses you, and the possessives your and yours.."}, {"url": "http://www.novel-writing-help.com/third-person-point-of-view.html", "passage_text": "But here is the biggest loss of freedom in a first person point of view novel... In first person novels, the narrator and the viewpoint character are essentially one and the same. But because they are separate in a third person novel, you can achieve so much more as a writer..."}, {"url": "http://www.novel-writing-help.com/3rd-person.html", "passage_text": "If you have already read the comprehensive information looking at the advantages of First Person, and Third Person, you have probably more or less come to a decision on which viewpoint is right for your own novel."}, {"url": "http://fictionwriting.about.com/od/glossary/g/3rdperson.htm", "passage_text": "Often new writers feel most comfortable with first person, but writing in the third person allows a writer more freedom in how a story is told. If you're unsure about which is right for your story, read an article on choosing a point of view, or a discussion on point of view in response to a blog post. Examples: Jane Austen 's novel, Pride and Prejudice, like many classic novels, is told from the third person point of view:"}, {"url": "http://www.advancedfictionwriting.com/blog/2010/08/12/should-your-novel-be-first-person/", "passage_text": "Usually, of course, a first-person novel has only a single viewpoint character. The hazard there is that one person can only be in one place at a time, so if you have action going on in multiple venues at the same time, you really have to use multiple first-person viewpoint characters."}]