[{"url": "http://www.esquire.com/news-politics/g1517/great-divorces-history-061313/", "passage_text": "The great King of the Franks spent a year married to Desiderata, a daughter of the Lombard king. The marriage was supposed to ease relations between the two kingdoms, but a year in, Charlemagne decided to send Desiderata back home. Her dad was mad and the Franks and Lombards went to war. "}, {"url": "https://en.wikipedia.org/wiki/Desiderata,_wife_of_Charlemagne", "passage_text": "Desiderata or Ermengarda was one of four daughters of Desiderius, king of the Lombards, and his queen, Ansa. She was married to Charlemagne, king of the Franks, in 770, probably to form a bond between the otherwise enemy states of Francia and Lombardy. The marriage was annulled in 771 and this hurt relations with Lombardy, presaging the war of 774. She had no known children and her ultimate fate is unknown. Although she is commonly referred to by the name Desiderata, it is now theorised that the name derives from an editorial error in a 19th-century copy of the Monumenta Germaniae Historica which capitalised the D in desideratam filiam (Latin for desired daughter)."}, {"url": "https://en.wikipedia.org/wiki/Carloman_I", "passage_text": "Carloman I (28 June 751 – 4 December 771) was the king of the Franks from 768 until his death in 771. He was the second surviving son of Pepin the Short and Bertrada of Laon and was a younger brother of Charlemagne. Little is known of him, except such as touches upon his more famous father and brother. At the time of his death, he and his brother Charlemagne were close to outright war, which Charlemagne's biographer Einhard attributes to the miscounsel of Carloman's advisors. Carloman was buried in Reims, but he was reburied in the Basilique Saint-Denis in the 13th century."}, {"url": "http://dearmrgable.com/?p=5667", "passage_text": "In my humble experience with Clark Gable fans, there are two things that are the most popular topics: His role as Rhett Butler in Gone with the Wind and his tragic marriage to Carole Lombard. Sadly, Clark wouldn’t probably want to be remembered for either of those things. They didn’t. Just a bit of digging provides the truth, but yet every Clark Gable bio I own says that they did. In turn, they, like any celebrity couple, constantly endured rumors of strife and infidelity. I have yet to find an actress who admits sleeping with Clark when he was with Carole."}, {"url": "http://nypost.com/2014/01/19/why-did-carole-lombard-die/", "passage_text": "Carole Lombard, 1935. Carole Lombard and her mother, Elizabeth Peters, 1935. Carole Lombard, 1936. Carole Lombard, 1939. Clark Gable and Carole Lombard after their elopement. Keystone/Getty Images. Actor Clark Gable and his wife, Carole Lombard, were considered the Brad Pitt and Angelina Jolie of their time. Gable cheated on Lombard with his co-star, Lana Turner. A new book reveals the chain of events that ultimately took Lombard’s life. Actor Clark Gable and his wife, Carole Lombard, were considered the Brad Pitt and Angelina Jolie of their time. GA"}, {"url": "http://www.thehistoryconnection.com/Charlemagne.html", "passage_text": "Charlemagne crowned his son, Louis the Pious, King of the Franks and Emperor of. the Romans. Just a few months afterwards, Charlemagne was killed by a fever. after a hunting trip. He was 71 years old. Conclusion Charlemagne by far had the. longest rule of any ruler to date in Europe, with a reign of 45 years. Charlemagne responded by killing one of the supporters in battle, and would. return later to kill the rest. While Charlemagne was fighting the Lombards, the. Saxons again revolted, and Charlemagne again marched his armies to Saxony."}, {"url": "https://en.wikipedia.org/wiki/Carloman_I", "passage_text": "Split of the Frankish kingdom [edit]. At the age of 3, he was, together with his father, Pepin the Short, and his elder brother, Charlemagne, anointed King of the Franks and titled Patrician of the Romans by Pope Stephen II, who had left Rome to beg the Frankish King for assistance against the Lombards. At the time of his death, he and his brother Charlemagne were close to outright war, which Charlemagne's biographer Einhard attributes to the miscounsel of Carloman's advisors. Carloman was buried in Reims, but he was reburied in the Basilique Saint-Denis in the 13th century."}, {"url": "http://www.answers.com/Q/How_many_children_did_Charlemagne_have", "passage_text": "This was probably something like a morganatic wife, i.e. of higher status than a concubine because he could not have another wife while he had her, but she still did not have the full rights of an official wife. Himiltrude bore Charlemagne two children, but he put her aside in order to marry Desiderata. There are twenty people who are recorded to have been children of Charlemagne. He probably had others. We are not sure whether Charlemagne had four wives or five. The generally accepted number is four. He had seven children recorded to have been born to concubines. There is a link below"}]