[{"url": "http://legal-dictionary.thefreedictionary.com/Subrogation", "passage_text": "SUBROGATION, civil law, contracts. The act of putting by a transfer, a person in the place of another, or a thing in the place of another thing. It is the substitution (q.v.) of a new for an old creditor, and the succession to his rights, which is called subrogation; transfusio unius creditoris in alium."}, {"url": "http://legal-dictionary.thefreedictionary.com/Subrogation", "passage_text": "Subrogation. The substitution of one person in the place of another with reference to a lawful claim, demand, or right, so that he or she who is substituted succeeds to the rights of the other in relation to the debt or claim, and its rights, remedies, or Securities."}, {"url": "http://www.investopedia.com/terms/s/subrogation.asp", "passage_text": "An example of subrogation is when an insured driver's car is totalled through the fault of another driver. The insurance carrier will reimburse the covered driver under the terms of the policy and then pursue legal action against the driver at fault."}, {"url": "http://www.investopedia.com/terms/s/subrogation.asp", "passage_text": "DEFINITION of 'Subrogation'. A term denoting a legal right that is reserved by most insurance carriers. Subrogation is the right for an insurer to pursue a third party that caused an insurance loss to the insured. This is done as a means of recovering the amount of the claim paid to the insured for the loss. Next Up."}, {"url": "http://www.merriam-webster.com/dictionary/subrogation", "passage_text": "Definition of SUBROGATION. : the act of subrogating; specifically: the assumption by a third party (as a second creditor or an insurance company) of another's legal right to collect a debt or damages. ADVERTISEMENT. 15th century."}, {"url": "http://businessinsure.about.com/od/glossaryofinsuranceterms/fl/What-Does-Subrogation-Mean.htm", "passage_text": "Subrogation is a legal term that is widely used in the insurance industry. Perhaps you have encountered this word in an insurance policy and wondered what it meant. This article will explain the meaning of this term and its significance to policyholders. Subrogation derives from laws of equity (fairness)."}]