[{"url": "http://www.biology-online.org/dictionary/Polygenic_trait", "passage_text": "A trait that is controlled by a group of nonallelic genes. Supplement. Polygenic traits are controlled by two or more than two genes (usually by many different genes) at different loci on different chromosomes. These genes are described as polygenes. "}, {"url": "http://www.aboutkidshealth.ca/En/HowTheBodyWorks/GeneticsIntroduction/SimpleSingleGeneInheritance/Pages/default.aspx", "passage_text": "MainPlaceHolder. An illustrated introduction to simple (single gene) inheritance, when a trait is entirely controlled by one gene—these traits are typically qualitative (also called discrete), meaning that they’re expressed as a few distinct phenotypes, and a person will either have the trait or not with no in-between. "}, {"url": "http://hihg.med.miami.edu/thromboticstorm/genetics-overview/single-gene-disorders", "passage_text": "Single Gene Disorders. When a certain gene is known to cause a disease, we refer to it as a single gene disorder or a Mendelian disorder. For example, you may have heard of cystic fibrosis, sickle cell disease, Fragile X syndrome, muscular dystrophy, or Huntington disease. These are all examples of single gene disorders. "}, {"url": "http://highered.mheducation.com/sites/007246268x/student_view0/chapter4/index.html", "passage_text": "1. Modes of inheritance are the rules explaining the common patterns of inheritance. 2. A Mendelian trait is caused by a single gene. 3. Traits can be dominant or recessive and recur in a predictable pattern in subsequent generations. 4. Autosomal Dominant Inheritance: Autosomal dominant traits do not generally skip generations and can affect both sexes. 5."}, {"url": "http://www.answers.com/Q/WHAT_is_single_gene_trait", "passage_text": "Making the world better, one answer at a time. A single gene trait is an allele. An allele is a trait controlled by a single gene. Each allele produces a distinct phenotype. A polygenic trait is a trait in which multiple sets of alleles are used to determine the trait, whereas in a single gene trait aka. a Mendelian trait, only one pair of alleles … is used."}, {"url": "http://www.thefreedictionary.com/trait", "passage_text": "trait. A characteristic or condition that is determined by one's genes. The color of an animal's coat and the shape of a plant's leaves are physical traits. Nesting in birds and burrowing in rodents are examples of behavioral traits. - A stroke of a pen or pencil."}, {"url": "http://employees.csbsju.edu/ssaupe/biol115/genetics_single_gene.htm", "passage_text": "Single Gene Traits in Humans. The following is a list of some autosomal human traits that have been attributed to a single gene. Although clearly other genes are involved, the inheritance of each of these phenotypic traits acts as if it were governed by a single gene. First, indicate your expression of the trait (i.e., circle the appropriate phenotype)."}, {"url": "http://study.com/academy/lesson/the-influence-of-single-gene-pair-inheritance-on-development.html", "passage_text": "Single gene-pair inheritance occurs when a trait is linked to one gene-pair that consists of two alleles. This is also referred to as Mendelian inheritance. An allele is one part of the gene-pair. One allele is inherited from the father and one is inherited from the mother. One way that this can occur is through single gene-pair inheritance. Single gene-pair inheritance occurs when a trait is linked to one gene-pair that consists of two alleles. Traits that are controlled by a single gene will follow a predictable pattern of inheritance."}, {"url": "http://www.answers.com/Q/What_is_a_single-gene_trait", "passage_text": "A single gene trait is controlled by a single gene. Polygenic traits are controlled by two or more than two genes on different chromosomes. These genes are described as polyge … nes. A polygenic trait is a trait in which multiple sets of alleles are used to determine the trait, whereas in a single gene trait aka. a Mendelian trait, only one pair of alleles … is used. 27 people found this useful."}]