[{"url": "http://www.webmd.com/a-to-z-guides/thyroid-hormone-replacement-for-hypothyroidism-topic-overview", "passage_text": "Thyroid hormones help regulate the way the body uses energy. You need thyroid hormone replacement when you do not have enough thyroid hormones in your blood (hypothyroidism). Depending on the cause of your hypothyroidism, you may need to take thyroid hormones for the rest of your life."}, {"url": "https://www.synthroid.com/what-is-synthroid/definition", "passage_text": "SYNTHROID ® (levothyroxine sodium tablets, USP) is a prescription, man-made thyroid hormone that is used to treat a condition called hypothyroidism, except in cases of temporary hypothyroidism, which is usually associated with an inflammation of the thyroid gland (thyroiditis)."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=85&ContentID=P00433", "passage_text": "Thyroid hormone therapy is the use of manmade thyroid hormones to raise abnormally low levels of natural thyroid hormones in the body. Thyroid hormone is usually given in pill form and is often used to treat an underactive thyroid that is secreting little or no thyroid hormones."}, {"url": "http://www.endocrineweb.com/conditions/hypothyroidism/what-thyroid-hormone-replacement-therapy", "passage_text": "To best understand the purpose of thyroid hormone replacement therapy, you need to understand the interaction of T3 and T4—the two thyroid hormones. T3 and T4. The full name of T3 is triiodothyronine, and T4's full name is tetraiodothyronine or thyroxine. T3 and T4 control your body's metabolism."}, {"url": "http://www.thyroid.org/thyroid-hormone-treatment/", "passage_text": "Thyroid hormone is used in two situations: 1  to replace the function of the thyroid gland, which is no longer functioning normally (“replacement therapy”) and. 2  to prevent further growth of thyroid tissue (“suppression therapy”)."}, {"url": "http://thyroid.org/wp-content/uploads/patients/brochures/HormoneTreatment_brochure.pdf", "passage_text": "Thyroid hormone TreATmenT Thyroid hormone is used in two situations: 1. to replace the function of the thyroid gland, which is no longer functioning normally (“replacement therapy”) and 2. to prevent further growth of thyroid tissue (“suppression therapy”)."}, {"url": "http://www.medicinenet.com/thyroid_replacement-oral/page2.htm", "passage_text": "Thyroid replacement hormones are used to treat hypothyroidism (low production of thyroid hormone) and myxedema, a condition that is caused by prolonged hypothyroidism. Thyroid replacement hormones prevent thyroid hormone release from cancerous thyroid nodules and are used therefore to treat thyroid cancers."}, {"url": "http://www.endocrineweb.com/conditions/hypothyroidism/what-thyroid-hormone-replacement-therapy", "passage_text": "Continue ReadingSynthetic T4 Supplements for Hypothyroidism. Hypothyroidism is a condition classified by an under-active thyroid gland —when the thyroid does not produce enough hormones. There are various treatments available, but the basic concept is the same—and it's known as thyroid hormone replacement therapy."}, {"url": "http://www.endocrineweb.com/conditions/hashimotos-thyroiditis/thyroid-hormone-replacement-therapy-hashimotos-thyroiditis", "passage_text": "The most common form of thyroid hormone replacement therapy is synthetic T4 hormone, which is generally known as levothyroxine. Your thyroid gland actually produces 2 types of hormones—T3 and T4. The reason you'll likely only take T4 hormone is that most of the T3 in our bodies actually used to be T4."}]