[{"url": "http://www.american-lawns.com/grasses/carpet.html", "passage_text": "Carpetgrass is a perennial, coarse-leaved, creeping grass. It grows better on low, wet soils than do other grasses. It will grow well in either sun or shade but is less shade tolerant than St. Augustine and Centipede grass which it resembles. Carpetgrass may be planted by seed or sprigs. Carpetgrass is recommended only for lawns on wet, low fertility, acid, (pH 4.5-5.5) sandy soils where ease of establishment and care is more important than quality."}, {"url": "http://aggie-horticulture.tamu.edu/archives/parsons/turf/publications/carpetgrass.html", "passage_text": "Description. Carpetgrass (Axonopus affinis) is a creeping, stoloniferous, perennial warm season grass. It is characterized by flat, two-edged runners or stolons; by wide leaves with blunt, rounded tips and by long, slender seedstalks that terminate with two branches, very similar to crabgrass."}, {"url": "https://en.wikipedia.org/wiki/Carpet_grass", "passage_text": "Axonopus is a genus of plants in the grass family, known generally as carpetgrass. They are native primrily to the tropical and subtropical regions of the Americas with one species in tropical Africa and another on Easter Island. They are sometimes rhizomatous and many are tolerant of periodic submersion. "}, {"url": "http://hancockseed.com/seed-varieties-241/carpetgrass-seed-369/", "passage_text": "Carpetgrass Seed. Carpetgrass Seed-Carpetgrass is primarily used in lawn, pasture and landscape applications in the south. This grass has the ability to withstand saturated soils and will tolerate periods of standing water. Carpetgrass is used in coastal and low lying areas. "}, {"url": "http://www.landscape-america.com/grasses/carpet.html", "passage_text": "Carpet Grass. Carpet grass is a creeping perennial grass that does well in wet, poor soils including excessively wet and shady areas where most other grasses do not do well. Carpet grass is similar to centipede grass in its cold tolerance, but it does NOT tolerate sea salt. Home. Carpet grass is a creeping perennial grass that does well in wet, poor soils including excessively wet and shady areas where most other grasses do not do well."}, {"url": "http://homeguides.sfgate.com/plant-carpet-grass-44682.html", "passage_text": "Carpet grass forms a dense mat of green for barefoot play in shady locations. Carpet grass (Axonopus affinis) is a warm-season grass that is valuable for its ability to grow in difficult places, such as shady and boggy areas."}, {"url": "http://carpetgrass.com/", "passage_text": "Carpetgrass is a native grass to the interior Gulf states and similar tropical climates. Weeds and Bermuda grass can be crowded out by its thick sod. It is a good grass for erosion control and is a low maintenance grass on low fertility soils and can thrive if not mown without the addition of fertilizers. Carpet grass is a warm season, creeping, perennial grass that grows well on wet, poor soils where most others will not grow. Search our store for products: Seeds for the future. It is coarse bladed, makes a dense turf, can be grown from seed, shallow rooted and therefore is not drought tolerant."}]