[{"url": "http://smallbusiness.chron.com/build-self-storage-business-4678.html", "passage_text": "Step 3. Find a property that meets the needs of your storage facility size needs. A storage facility doesn't need a large footprint, meaning the length and width of the property doesn't need to be huge. Consider property costs versus building a taller structure. With only a few employees needed to run the storage facility, building it may be the most complex part of the venture. Step 1. Become a member of the Self Storage Association, a trade organization specifically designed to help self-storage owners research trends and make better business decisions."}, {"url": "http://www.pellabuildings.com/mini-storage-facility-building-costs.html", "passage_text": "Are you thinking about investing in a mini storage facility, but you're not sure of what it will cost to build? With over 28 year's experience in the Self Storage Industry, Pella Building Systems in Pella, Iowa is the industry's leader in self storage design, construction, systems, and front end operations. From the very beginning of your project planning, Pella Building Systems can help you with determining where to locate your new facility and what it will cost to build it to completion. We start by checking other facilities in the market area to determine occupancy rates, pricing, and land acquisition costs."}, {"url": "http://business.lovetoknow.com/wiki/Storage_Unit_Business:_Cost_to_Build", "passage_text": "Many people need climate controlled units to preserve items than can be destroyed by mold or mildew. A ballpark figure for storage unit business cost to build: 1  Including permits, rental space, construction and other incidentals, start up costs for a storage unit business will come to at least $50,000. If you're putting together a business plan to start a self-storage business, one category to be researched is Storage Unit Business: Cost to Build. This article will help provide the information and resources you will need"}, {"url": "http://www.makosteel.com/blog/bid/84411/cost-to-build-self-storage", "passage_text": "Costs to Build Self Storage. To give you even ballpark costs, we will need to know if you are planning to build a single story or a multi-story facility. Costs for Single Story Self Storage Construction typically ranges between $25-$40 per square foot – not including land or site improvement costs. Multi-Story Self Storage Building Costs have more variables and can range from $42 per square foot to as much as $70 per square foot. Today, there are almost unlimited options in designing a self-storage facility that will blend into the area you plan to build. The most common state of the art facility will be about 60,000 - 80,000 net rentable square feet, cost $45-65 per square foot to construct (outside of existing land costs), and have break even operating expenses in the 40-60 percent range (not including debt service) of total stabilized income."}, {"url": "http://www.answers.com/Q/Whats_the_cost_to_build_a_mini_storage_facility", "passage_text": "Answered by The Community. Making the world better, one answer at a time. The average cost to build a mini storage facility is $1,386,000.00. This does not include the cost of installing security cameras or the cost of making the units climate controlled or fireproof. "}, {"url": "http://business.lovetoknow.com/wiki/Storage_Unit_Business:_Cost_to_Build", "passage_text": "Costs for building storage units vary, depending on location and what features you include. For example, if the unit is climate controlled, it will cost more to build and operate than one that is not. Climate controlled units keep temperatures from dropping below 55 degrees or rising to more than 80 degrees. If you're putting together a business plan to start a self-storage business, one category to be researched is Storage Unit Business: Cost to Build. This article will help provide the information and resources you will need"}, {"url": "http://www.cannonstorage.com/Things.htm", "passage_text": "N. Permit fees and any other fees required by your local government. Total costs for a self storage facility should run about $40.00 to $43.00 per square foot of storage. This however depends on local code and regulation requirements. We hope this guide will help you in your self storage facility venture. "}, {"url": "http://www.makosteel.com/blog/bid/71344/building-self-storage-the-cost-question", "passage_text": "Answering the Single Story vs. Multi-Story Question is the first step in setting adequate budgets for Self Storage Construction. While costs for Single Story construction typically range from $25-$40 psf, Multi-Story projects have a larger variable and can range from $42 psf to as much as $70 psf."}]