[{"url": "http://painting.about.com/od/famouspainters/ig/famous-paintings/Leonardo-Mona-Lisa.htm", "passage_text": "Leonardo da Vinci's Mona Lisa painting, in the Louvre in Paris, is arguably the most famous painting in the world. It is probably also the best known example of sfumato, a painting technique partly responsible for her enigmatic smile. There's been a lot of speculation about who the woman in the painting was."}, {"url": "https://en.wikipedia.org/wiki/Mona_Lisa", "passage_text": "The title of the painting, which is known in English as Mona Lisa, comes from a description by Renaissance art historian Giorgio Vasari, who wrote Leonardo undertook to paint, for Francesco del Giocondo, the portrait of Mona Lisa, his wife.."}, {"url": "https://en.wikipedia.org/wiki/Mona_Lisa", "passage_text": "The painting, thought to be a portrait of Lisa Gherardini, the wife of Francesco del Giocondo, is in oil on a white Lombardy poplar panel, and is believed to have been painted between 1503 and 1506. Leonardo may have continued working on it as late as 1517."}, {"url": "http://totallyhistory.com/mona-lisa/", "passage_text": "The Mona Lisa is an oil painting, with a cottonwood panel as the surface. It is unusual in that most paintings are commissioned as oil on canvas, but the cottonwood panel is part of what has attributed to the fame of the painting."}, {"url": "http://totallyhistory.com/mona-lisa/", "passage_text": "The Mona Lisa is quite possibly the most well-known piece of painted artwork in the entire world. It was painted by the Leonardo Da Vinci, the famous Italian artist, between 1504 and 1519, and is a half body commission for a woman named Lisa Gherardini."}, {"url": "http://www.leonardodavinci.net/the-mona-lisa.jsp", "passage_text": "Portrait of Mona Lisa, also known as La Gioconda, the wife of Francesco del Giocondo; This painting is painted as oil on wood."}, {"url": "http://wonderopolis.org/wonder/who-was-mona-lisa/", "passage_text": "According to art experts, the Mona Lisa is the best known, most visited and overall most famous work of art in the entire world. Painted by da Vinci between 1503 and 1506, the Mona Lisa is an oil painting on a poplar panel. Acquired by King Francis I of France, the Mona Lisa is now the property of France."}, {"url": "https://en.wikipedia.org/wiki/Mona_Lisa", "passage_text": "Leonardo da Vinci began painting the Mona Lisa in 1503 or 1504 in Florence, Italy. Although the Louvre states that it was doubtless painted between 1503 and 1506, the art historian Martin Kemp says there is some difficulty in confirming the actual dates with certainty."}, {"url": "http://totallyhistory.com/mona-lisa/", "passage_text": "The Mona Lisa is famous for a variety of reasons. One of the reasons, of course, for the popularity of the painting is the artist himself. Leonardo da Vinci is perhaps the most recognized artist in the world."}]