[{"url": "http://www.degreesthatpay.com/info/Associates-vs-Bachelors", "passage_text": "The most obvious differences between the two degrees are time and cost. An Associate's degree can normally be obtained in only two years as opposed to four years for a Bachelor's degree. Because you're finishing school in half the time, the cost will obviously be much less. Now that you have an idea of which career path you'd like to take, it's time to look at which type of degree would be best suited for you. We'll compare an Associate's degree versus a Bachelor's degree and examine the many differences between them."}, {"url": "http://study.com/articles/Associate_Degree_vs_Bachelor_Degree_in_Accounting_Whats_the_Difference.html", "passage_text": "Associate Vs. The differences between an associate degree and a bachelor's degree in accounting include program duration, the rigorousness of coursework and career opportunities available to graduates. Keep reading to learn more about the differences between these two accounting program options. View 10 Popular Schools ». Bachelor Degree in Accounting. The differences between an associate degree and a bachelor's degree in accounting include program duration, the rigorousness of coursework and career opportunities available to graduates."}, {"url": "http://www.capella.edu/blogs/cublog/5-differences-of-associates-vs-bachelors-degree/", "passage_text": "Whether to pursue an associate’s degree or a bachelor’s degree is a highly personal decision based on a variety of factors. Here are the top five differences between the two degrees to consider as you contemplate your options. Part-time students take longer to earn each degree, but generally an associate’s degree will be faster to get than a bachelor’s degree. Note: Often credits earned for an associate’s degree will transfer to a bachelor’s degree program. So if you already have an associate’s degree, check with your school’s credit transfer policies to see if you can fast-track your bachelor’s degree and finish it up in just two years instead of four"}, {"url": "http://www.campusexplorer.com/college-advice-tips/89B1101E/Associates-vs-Bachelors/", "passage_text": "Costs of Associate’s Degree vs. Bachelor’s Degree. When choosing a college, some of the main concerns are the costs of the school and the program. Many people find associate’s degrees to be the more lucrative option in the short term because they cost less money and have a higher starting salary. Transfer associate’s degrees are typically designed to take the place of your first two-years of a bachelor’s degree program. Courses will be in general education, liberal arts, and sciences; so when your credits transfer to a four-year college, you’re able to focus only on courses related to your major."}, {"url": "http://www.marketwatch.com/story/is-an-associates-degree-the-new-bachelors-degree-2014-08-01", "passage_text": "The average worker with an associate’s degree and little experience makes an annual salary of $37,100 vs. $46,900 for someone with a bachelor’s degree — a 26% difference. But fast-forward down the road a few years when that worker has 10 or more years of experience and the discrepancy between what the average worker with an associate’s degree and bachelor’s degree earns is nearly $30,000 per year — a difference of more than 50%."}, {"url": "http://learn.org/articles/Associates_Degree_VS_Bachelors_Degree_in_Accounting_Whats_the_Difference.html", "passage_text": "Choosing a Degree. One major difference between an associate's degree program and a bachelor's degree program is the selection of career opportunities available after you graduate. An associate's degree in accounting may qualify you for entry-level positions, such as accounting clerk, bookkeeper or auditing clerk. Associate Vs. Associate's and bachelor's degrees in accounting lead to different career options and have slightly different coursework. Associate's programs typically take two years to complete, while earning a bachelor's degree usually takes four years."}, {"url": "http://allnurses.com/registered-nurses-diploma/associates-vs-bachelors-229716.html", "passage_text": "Top. 0 Hi! I am starting nursing school this fall and recently asked about the difference in salary between an RN with an associates degree and an RN with a bachelor's degree and was told there is no difference in salary between the two. "}, {"url": "http://www.payscale.com/career-news/2009/10/4-year-vs-2-year-college-degrees-how-does-the-pay-compare", "passage_text": "In general, getting a bachelor's degree is a win in terms of pay over an associate's degree. In our sample, the national starting median pay for those who hold only a bachelor's degree is $43,200, which is over 20 percent higher than the national starting median pay for those who hold an associate's degree ($35,100). In other jobs, it does truly pay to hold a bachelor's degree, although one is not required in the job. In these jobs, which are mostly managerial and professional jobs, bachelor's degree workers earn a median pay 15 percent or more above associate's degree workers. Jobs."}]