[{"url": "https://en.wikipedia.org/wiki/Elementary_and_Secondary_Education_Act", "passage_text": "The act was originally authorized through 1965; however, the government has reauthorized the act every five years since its enactment. The reauthorization of ESEA by President George W. Bush was known as the No Child Left Behind Act of 2001. Schools receiving Title I funding are regulated by federal legislation. Most recently, this legislation includes the No Child Left Behind Act which was passed in 2001. In the 2006-2007 school year, Title I provided assistance to over 17 million students who range from kindergarten through twelfth grade."}, {"url": "https://en.wikipedia.org/wiki/Elementary_and_Secondary_Education_Act", "passage_text": "During the Reagan Administration, Congress passed the Education Consolidation and Improvement Act (ECIA) in 1981 to reduce federal regulations of Title I. This reflected the administration’s stance that resource control should be in the hands of states and local jurisdictions rather than at a federal level. Schools receiving Title I funding are regulated by federal legislation. Most recently, this legislation includes the No Child Left Behind Act which was passed in 2001. In the 2006-2007 school year, Title I provided assistance to over 17 million students who range from kindergarten through twelfth grade."}, {"url": "http://www.dol.gov/ebsa/aboutebsa/history.html", "passage_text": "The provisions of Title I of ERISA, which are administered by the U.S. Department of Labor, were enacted to address public concern that funds of private pension plans were being mismanaged and abused. As a result of the enactment of the Federal Employees' Retirement System Act of 1986 (FERSA), EBSA has fiduciary and auditing oversight of the Thrift Savings Plan that was established by this Act."}, {"url": "http://www.eeoc.gov/laws/statutes/ada.cfm", "passage_text": "Be it enacted by the Senate and House of Representatives of the United States of America assembled, that this Act may be cited as the Americans with Disabilities Act of 1990. L. 101-336) (ADA), as amended, as these titles will appear in volume 42 of the United States Code, beginning at section 12101. Title I of the ADA, which became effective for employers with 25 or more employees on July 26, 1992, prohibits employment discrimination against qualified individuals with disabilities."}, {"url": "http://uscode.house.gov/about/info.shtml", "passage_text": "Certain titles of the Code have been enacted into positive law, and pursuant to section 204 of title 1 of the Code, the text of those titles is legal evidence of the law contained in those titles. The other titles of the Code are prima facie evidence of the laws contained in those titles. The following titles of the Code have been enacted into positive law: 1, 3, 4, 5, 9, 10, 11, 13, 14, 17, 18, 23, 28, 31, 32, 35, 36, 37, 38, 39, 40, 44, 46, and 49. Titles 1 through 41 and the Table of Popular Names are based on Supplement II of the 2006 edition (January 5, 2009) of the Code."}, {"url": "http://www.eeoc.gov/laws/statutes/ada.cfm", "passage_text": "EDITOR'S NOTE: The following is the text of Titles I and V of the Americans with Disabilities Act of 1990 (Pub. L. 101-336) (ADA), as amended, as these titles will appear in volume 42 of the United States Code, beginning at section 12101. Title I of the ADA, which became effective for employers with 25 or more employees on July 26, 1992, prohibits employment discrimination against qualified individuals with disabilities."}, {"url": "https://en.wikipedia.org/wiki/Americans_with_Disabilities_Act_of_1990", "passage_text": "The Americans with Disabilities Act of 1990 (ADA) is a law that was enacted by the U.S. Congress in 1990. It was signed into law on July 26, 1990, by President George H. W. Bush, amended and signed by President George W. Bush with changes effective January 1, 2009. The ADA is a wide-ranging civil rights law that prohibits discrimination based on disability."}, {"url": "https://www.law.cornell.edu/uscode/text/1", "passage_text": "“Title 1 of the United States Code entitled ‘General Provisions’, is codified and enacted into positive law and may be cited as ‘1 U. S. C., § ——.’ ”. 1 CHAPTER 1 - RULES OF CONSTRUCTION (§§ 1 to 8). 2  CHAPTER 2 - ACTS AND RESOLUTIONS; FORMALITIES OF ENACTMENT; REPEALS; SEALING OF INSTRUMENTS (§§ 101 to 114). 3  CHAPTER 3 - CODE OF LAWS OF UNITED STATES AND SUPPLEMENTS; DISTRICT OF COLUMBIA CODE AND SUPPLEMENTS (§§ 201 to 213)."}, {"url": "https://en.wikipedia.org/wiki/Elementary_and_Secondary_Education_Act", "passage_text": "Title I (Title One), a provision of the Elementary and Secondary Education Act passed in 1965, is a program created by the United States Department of Education to distribute funding to schools and school districts with a high percentage of students from low-income families. Schools receiving Title I funding are regulated by federal legislation. Most recently, this legislation includes the No Child Left Behind Act which was passed in 2001. In the 2006-2007 school year, Title I provided assistance to over 17 million students who range from kindergarten through twelfth grade."}, {"url": "https://en.wikipedia.org/wiki/Elementary_and_Secondary_Education_Act", "passage_text": "The Elementary and Secondary Education Act (ESEA) was passed as a part of United States President Lyndon B. Johnson 's  War on Poverty  and has been the most far-reaching federal legislation affecting education ever passed by the United States Congress. Schools receiving Title I funding are regulated by federal legislation. Most recently, this legislation includes the No Child Left Behind Act which was passed in 2001. In the 2006-2007 school year, Title I provided assistance to over 17 million students who range from kindergarten through twelfth grade."}]