[{"url": "http://www.behindthename.com/name/grant", "passage_text": "From an English and Scottish surname which was derived from Norman French grand meaning great, large. A famous bearer of the surname was Ulysses Grant (1822-1885), the commander of the Union forces during the American Civil War who later served as president. In America the name has often been given in his honour."}, {"url": "http://www.thinkbabynames.com/meaning/1/Grant", "passage_text": "Grant /grant/ [1 syll.] as a boys' name is pronounced grant. It is of English and Gaelic origin, and the meaning of Grant is tall, big. A Scottish name. American President Ulysses S. Grant; painter Grant Wood; actor Hugh Grant. Grant is a very popular first name for men (#343 out of 1220, Top 28%) and also a very popular last name for both adults and children (#192 out of 150436, Top 1%)."}, {"url": "https://en.wikipedia.org/wiki/Grant_(name)", "passage_text": "Grant can be both a surname and a given name. The name is of English and Scottish origin, and there are several possible origins for the name. 1  One possible origin of the name is from a nickname derived from the Anglo-Norman graund, graunt (tall, large). 1 This nickname was likely given to a person of remarkable size or merely to distinguish two persons bearing the same name. 2  Another possible origin of the surname is from a medieval personal name ultimately derived from the Old English byname Granta, which might have meant snarler."}, {"url": "https://en.wikipedia.org/wiki/Grant_(name)", "passage_text": "1 This in turn was derived from the Old French grand, grant, which was originally derived from the Latin grandis. 2  This nickname was likely given to a person of remarkable size or merely to distinguish two persons bearing the same name. 1 This nickname was likely given to a person of remarkable size or merely to distinguish two persons bearing the same name. 2  Another possible origin of the surname is from a medieval personal name ultimately derived from the Old English byname Granta, which might have meant snarler."}, {"url": "http://www.ohbabynames.com/meaning/name/grant/1330", "passage_text": "The name Grant is the transferred use of an Anglo-Scottish surname which is derived from the French word “graunt” meaning ‘great, tall’ and was introduced to England by way of the Normans. "}, {"url": "https://en.wikipedia.org/wiki/Grant_(name)", "passage_text": "1 Another possible origin of the surname is from a medieval personal name ultimately derived from the Old English byname Granta, which might have meant snarler. 2  The surname may also be an alternate spelling of the German Grandt or Grand. 1 This nickname was likely given to a person of remarkable size or merely to distinguish two persons bearing the same name. 2 "}, {"url": "http://www.meaning-of-names.com/english-names/grant.asp", "passage_text": "English name. In English, the name Grant means-Bestow or great; tall. The American General and president Ulysses S. Grant. Surname.. Other origins for the name Grant include-English, Irish, Scottish.The name Grant is most often used as a boy name or male name. English Name Meaning-Bestow or great; tall. The American General and president Ulysses S. Grant. Surname. "}, {"url": "http://www.sheknows.com/baby-names/name/grant", "passage_text": "Scottish Meaning: The name Grant is a Scottish baby name. In Scottish the meaning of the name Grant is: Originally a Scottish surname derived from the French 'grand', meaning tall or great. Now common both as a surname and given name. Famous bearer: American President Ulysses S. Grant."}, {"url": "http://www.babynamewizard.com/baby-name/boy/grant", "passage_text": "Origin of the name Grant: Transferred use of the English surname derived from the Anglo-French graund, graunt (great) and the Old French grand, grant (great). The name originated as a nickname for a large or tall person. From A World of Baby Names by Teresa Norman."}]