[{"url": "http://www.milgard.com/materials/aluminum", "passage_text": "Light yet strong, aluminum windows and doors can be configured into a wide variety of combinations. The narrowness of the frame places the focus on the glass and subsequently, the view it offers. Multi-panel door systems are often made with aluminum frames to facilitate indoor/outdoor living. Aluminum Windows & DoorsThe strength and distinct feel of aluminum has made it timeless and the choice of architects and homeowners alike for windows and doors. The strength and distinct feel of aluminum has made it timeless and the choice of architects and homeowners alike for windows and doors."}, {"url": "http://www.trimbender.com/window-trim", "passage_text": "Aluminum Window Trim provides a low maintenance and durable exterior trim solution. All you have to do is order the trim for your project's needs and then trim and wrap your existing or new wood casing on windows, entry doors, and garage doors. "}, {"url": "http://www.doorandwindow.com/windows/types/aluminum-vs-vinyl-windows.php", "passage_text": "1 Aluminum offers excellent noise reduction. 2  A double-pane window set into an aluminum frame can block a great deal of noise simply due to the overall mass. 3  If you live in a place where noise is an issue, such as near an industrial area, aluminum windows might be your best bet. 1 A broken pane of glass is easy to replace in an aluminum frame, thanks to the design--simply remove a few screws to get the new pane in, and you're done. 2  Aluminum is a good conductor of heat, which means it is not as energy-efficient as other window types."}, {"url": "http://www.doorandwindow.com/windows/types/aluminum/", "passage_text": "Aluminum windows keep their value and do everything they are supposed to do without rusting or corroding. They last, they are inexpensive, and they protect homes and commercial buildings quite well. Aluminum windows are the standard in most tract houses. Aluminum windows are both wind and moisture-resistant as well. They are very versatile in terms of making them fit any window shape. If you want easy installation, aluminum windows are a great choice. And if noise problems exist, aluminum is a great choice for keeping that under control."}, {"url": "http://www.soundproofwindows.com/aluminum-vs-vinyl-windows/", "passage_text": "Vinyl Must be Thicker than Aluminum Windows. This is necessary in order to gain the strength they need. For noise abatement windows this is even more true. To stop as much noise as we do with our Soundproof Window frames (which are 1-1/8″ thick), there would have to be 3″ of vinyl frame. Vinyl and wood windows now have well over 70% of the residential window market. Aluminum windows have the overwhelming market share for commercial buildings."}, {"url": "http://www.doorandwindow.com/windows/types/aluminum/", "passage_text": "1 Aluminum Window Materials and Colors. 2  Learn more about what aluminum window material is best for your window, and find out what. 3  aluminum window colors are available. 4  Aluminum Window Installers. 5  Find out what to look for in a aluminum window installer and how to work with them in order to create the best results. Aluminum windows are both wind and moisture-resistant as well. They are very versatile in terms of making them fit any window shape. If you want easy installation, aluminum windows are a great choice. And if noise problems exist, aluminum is a great choice for keeping that under control."}, {"url": "http://www.soundproofwindows.com/aluminum-vs-vinyl-windows/", "passage_text": "Secondary windows are used to improve the insulation values of the primary window, and, in the case of Soundproof Windows, they are used to stop noise. Vinyl and wood windows now have well over 70% of the residential window market. Aluminum windows have the overwhelming market share for commercial buildings."}, {"url": "https://en.wikipedia.org/wiki/Aluminium", "passage_text": "Aluminium (or aluminum; see different endings) is a chemical element in the boron group with symbol Al and atomic number 13. It is a silvery-white, soft, nonmagnetic, ductile metal. Aluminium is the third most abundant element (after oxygen and silicon) in the Earth 's crust, and the most abundant metal there. "}, {"url": "http://www.stanekwindows.com/vinyl-vs-aluminum-windows.aspx", "passage_text": "Appearance. The wood-grain appearance on vinyl windows is a popular alternative to actual wood, which is more problematic than either vinyl or aluminum. It’s also superior to the painted surface of aluminum windows. To get the look of wood on an aluminum window requires the use of a coating treatment. This is inferior to the vinyl wood grain effect, which is the same material throughout, as opposed to an external coating. Corrosion. Not a problem with vinyl windows"}]