[{"url": "http://www.bathroomremodel.com/small-bathroom-remodeling/cost/", "passage_text": "The materials for the average small bathroom remodel will cost between $8,000 and $10,000. This includes new fixtures like a new toilet, new sink, and a new bathtub. It also includes the cost of new tiling, new cupboards, and a countertop for the sink. For a small bathroom of roughly 100 square feet, labor costs could run an average of $12,000 or $13,000 on the high end. This would include the labor to completely redo tile, completely install new fixtures, complete any necessary wiring and plumbing, and have everything inspected afterward."}, {"url": "http://www.homeadvisor.com/cost/bathrooms/remodel-a-bathroom/", "passage_text": "Homeowners have many options when it comes to bathroom remodels and the total cost depends on style and budget. The average bathroom remodel costs $9,254, but you can spend less-between $3,500 and $7,000 - to fix up the essentials in a small-to medium-sized bathroom. The average cost to remodel a bathroom in Dallas is approximately $7,300 to $10,000. by Beyond Designs and Remodeling, Inc. , a Bathroom Remodeling Contractor in Brooklyn, NY. For most homeowners in Brooklyn, the average cost for a bathroom remodel is approximately $9,800 to $13,000."}, {"url": "http://www.hgtv.com/design/rooms/bathrooms/budgeting-your-bathroom-renovation", "passage_text": "And once you know what costs what, you can figure out which corners — or countertops — to cut. According to Remodeling magazine's 2005 Cost vs. Value Report, a mid-range bathroom remodel is approximately $10,499, higher or lower depending on where you live (and how you define mid-range). Redoing your bathroom will cost you less in the South and more in the West and Northeast. "}, {"url": "http://www.fixr.com/costs/bathroom-remodeling", "passage_text": "Bathroom remodeling can be extremely simple or quite complex, but for this discussion we will consider the costs and requirements for a bathroom remodel of a previously 40 square foot bathroom into a 120 square foot bathroom. "}, {"url": "http://www.bathroomremodel.com/small-bathroom-remodeling/cost/", "passage_text": "Cost of Labor. As a general rule, most people expect that the labor for a remodel will cost roughly twice as much as the materials did. This is not a hard and fast rule, but the numbers generally support the claim. On average, a bathroom remodeling job will cost you around twice as much as the materials cost you. For a small bathroom of roughly 100 square feet, labor costs could run an average of $12,000 or $13,000 on the high end. This would include the labor to completely redo tile, completely install new fixtures, complete any necessary wiring and plumbing, and have everything inspected afterward."}, {"url": "http://www.homeadvisor.com/cost/bathrooms/remodel-a-bathroom/", "passage_text": "And the average cost of a bathroom remodel in New York City is roughly $9,500 to $13,000. Once you have ideas for your renovation planned out, the next step is to find bath remodel accessories in your price range. The average cost to remodel a bathroom in Dallas is approximately $7,300 to $10,000. by Beyond Designs and Remodeling, Inc. , a Bathroom Remodeling Contractor in Brooklyn, NY. For most homeowners in Brooklyn, the average cost for a bathroom remodel is approximately $9,8"}, {"url": "http://www.improvenet.com/r/costs-and-prices/bathroom-remodel-cost-estimator", "passage_text": "The major expense here, as you might guess, will be the price of the toilet itself. If you can deliver the toilet to your home alone, then the installation cost will be minimal. On average, the cost of a new toilet as well as installation comes in between $360 and $492. Bathroom remodels can include everything from painting the walls to installing a brand new tub. On average, most homeowners will pay between $8,265 and $11,426 to remodel their existing bathrooms. "}, {"url": "http://www.repair-home.com/bathroom-remodeling/average-costs-of-bathroom-remodeling.html", "passage_text": "So what are the average costs of bathroom remodeling? This is a hard question to answer as prices range anywhere from $5,000 up to $30,000 depending on the amount of work and change you want to implement into your bathroom remodeling project. When you have your bathroom remodeling estimate ready, remember to always take into account any extras such as decorating-towel racks and towels alone can run up to $500 in costs. In the end, this is a costly project but it's much rewarding and worthy of all of your money and efforts."}, {"url": "http://www.bathroomremodel.com/small-bathroom-remodeling/cost/", "passage_text": "Typical Hourly Rate = $50-$75 per hour. When you are remodeling a small bathroom, you need to make sure that your costs are always in the forefront of your mind. Using this guide, you will be able to develop a reasonably accurate estimate of how much a small bathroom remodel costs. For a small bathroom of roughly 100 square feet, labor costs could run an average of $12,000 or $13,000 on the high end. This would include the labor to completely redo tile, completely install new fixtures, complete any necessary wiring and plumbing, and have everything inspected afterward."}, {"url": "http://www.improvenet.com/r/costs-and-prices/bathroom-renovation-cost-estimator", "passage_text": "Enter your zip code to get started. According to costs reported by ImproveNet members, the average bathroom remodel costed approximately $7,920 in 2014, with most homeowners spending between $6,000 and $9,000. "}]