[{"url": "http://eacair.com/blogs/long-will-furnace-last", "passage_text": "The answer to this question depends on a variety of factors and you will need to examine them carefully. Typically, a forced-air gas furnace can be expected to last from 15 to 20 years. Some experts give a range of 13 to 25 years, because there are many variables. For example, some home builders use lower quality units made by well-known manufacturers. Typically a forced-air heat exchanger can be expected to last between 15 and 20 years. Ultimately, heat exchangers fail because of the constant heating and cooling."}, {"url": "http://www.thisismoney.co.uk/money/experts/article-2074651/How-old-boiler-replace-it.html", "passage_text": "If you heat your home with a boiler and radiators, it is likely that roughly two-thirds of your total home energy expenditure goes on the fuel, (whether that be mains gas, oil or LPG,) used to run your central heating. "}, {"url": "http://homeguides.sfgate.com/long-average-furnace-last-87533.html", "passage_text": "Time's Up. Generally speaking, a furnace can be expected to last between 15 and 20 years. This average varies, of course, based on the quality of the unit, how it's used and whether it has been properly maintained. It can also depend on the specific type of unit, with forced air systems with a heat pump at the lower end of the range (at around 15 years), and gas-or oil-fueled models coming in at around 18 years."}, {"url": "http://ths.gardenweb.com/discussions/2396136/how-long-might-my-boiler-last", "passage_text": "Keep the water level in the proper range and the boiler should last for many years. It is difficult to say how much a replacement would be. I would expect a new boiler would be in the $4000 - $6000 range. I have no experience with boiler repair, so I can't advise you whether if it is even feasible. I would expect a boiler to last 25 - 30 years. Your thermostat may have a battery in it, but I doubt it powers the control to your boiler. Try this experiment. Shut off the main breaker in the house, and then push the thermostat up and see if the boiler fires."}, {"url": "http://forum.heatinghelp.com/discussion/130076/How-long-should-a-boiler-last", "passage_text": "A boiler 60 years old may last another 10 to 20 years, wasting fuel every day. another boiler 2 years old could be dead in a month due to poor installation. 35 years +- is for cast iron hot water. I've been in my house since 1992 (it was built in 1928). In 1993 I had to replace the boiler which was about 16-18 years old, based on what the previous owner said. It was rotted out and leaking. The plumber who installed that boiler told me that the water in the area (Bergen County, NJ) tended to shorten the life of boilers"}, {"url": "http://eacair.com/blogs/long-will-furnace-last", "passage_text": "When considering the life expectancy of your furnace, you are really focusing on the life of the heat exchanger itself. Typically a forced-air heat exchanger can be expected to last between 15 and 20 years. Ultimately, heat exchangers fail because of the constant heating and cooling. Cracking and rusting are signs of a failing heat exchanger. Your furnace may not be bad just because it is old"}, {"url": "http://tempcoheatingandac.com/long-furnaces-boilers-last", "passage_text": "The average lifespan for a boiler or furnace can hinge on a number of factors, including the quality and type of the unit, and the consistency of maintenance performed on it. For example, a well-maintained traditional gas boiler or furnace has an average expectancy of 15 years. Electrical units have an average expectancy of 10 years. With a superior quality furnace or boiler that is professionally serviced, the life expectancy rises to 20 years. If it’s time to have your furnace or boiler serviced, give us a call at Tempco Heating & Air Conditioning. We’ve proudly served Crystal Lake and nearby communities for more than 20 years. Be sure to check out our Internet specials before you call, too!"}, {"url": "http://forum.heatinghelp.com/discussion/130076/How-long-should-a-boiler-last", "passage_text": "Last year, I had to have that boiler replaced -- it having rotted out, so it lasted about 17 years. A different plumber installed this boiler (and used black pipe) and told me that this 17 years was not an unusual life expectancy. I've been in my house since 1992 (it was built in 1928). In 1993 I had to replace the boiler which was about 16-18 years old, based on what the previous owner said. It was rotted out and leaking. The plumber who installed that boiler told me that the water in the area (Bergen County, NJ) tended to shorten the life of boilers"}]