[{"url": "http://www.bmionline.com/book-binding.aspx", "passage_text": "BMI Book Binding Services. BMI now has three options for our Book Binding Services! To extend the lives of your books, you can get your books BMI Bound whether you buy from us or want to get your current library rebound. close X. BMI now has three options for our Book Binding Services! To extend the lives of your books, you can get your books BMI Bound whether you buy from us or want to get your current library rebound."}, {"url": "http://www.ehow.com/info_8723290_difference-between-prebound-library-binding.html", "passage_text": "Binding Process. Library binding is a process outsourced by libraries to binding companies. The most common method used to library-bind books is called oversewing. In oversewing, the cover of the paperback's spine is removed, leaving a bundle of loose pages. Library Binding Alternatives. A cheaper way to preserve paperback books for library use in-house is known as stiffening. To stiffen a paperback book, a strip of cloth or durable material such as Tyvek is glued to the book's inside joints to reinforce the cover's attachment to the pages."}, {"url": "http://cool.conservation-us.org/coolaic/sg/bpg/annual/v17/bp17-09.html", "passage_text": "Paperback Rebinding at a Library Repair Station. Paperback Rebinding Using Transfer Tape Technique. To a great extent, the methods of paperback rebinding are imposed by acquisition and circulation policies and bindery preparation routines. "}, {"url": "http://www.answers.com/Q/Does_library_binding_mean_the_book_will_be_hardback", "passage_text": "Making the world better, one answer at a time. yes, the difference between library binding and regular hardback books is that library binding not only glues the pages to the cover but also has the paper portion of a hardback cover. What is Complete Hardback set of Zane Grey books worth? A complete set of 75 Walter J. Black editions in good to excellent condition with rice paper dust covers would sell for as little as $5.00 a piece for some of the individual v … olumes, with some of the rarer ones going for as much as $100.00."}, {"url": "http://bindery.berkeley.edu/campus-libraries/library-binding-vs-publishers-binding", "passage_text": "Library Binding Subject to Rigorous Standards. Library binding specifications were first established in 1923, and continued to evolve and formalize through the efforts of a dedicated standards body, the Library Binding Institute (LBI). "}, {"url": "https://en.wikipedia.org/wiki/Library_binding", "passage_text": "Library binding is the method of binding serials, and re-binding paperback or hardcover books, for use within libraries. Library binding increases the durability of books, as well as making the materials easier to use. The stiffening process is a low-cost, in-house alternative to library binding of paperbacks. "}, {"url": "http://windsorpeak.com/vbulletin/showthread.php?337891-Difference-between-hardcover-amp-library-binding", "passage_text": "Found it!! # Hardcover: The common bookstore variety of hardcover book usually comes with a dust jacket. # School/Library Binding: This is the most durable form of hardcover, bound for the heaviest use. These rarely come with a dust jacket since paper covers don't last long in the school or library environment. "}]