[{"url": "http://carla.umn.edu/assessment/vac/improvement/p_5.html", "passage_text": "Just as a variety of task-types should be used in language classrooms, so should a variety of rubrics and checklists be used for assessing performance on those tasks (p. 37). Holistic scales may be either generic or task-specific. Figure 4 is a sample of a holistic rubric for a Presentational Writing task. Advantages of holistic rubrics: 1  They are often written generically and can be used with many tasks."}, {"url": "http://www.lifehacker.com.au/2014/04/the-best-apps-for-automatically-cleaning-up-your-music-library/", "passage_text": "However, it’s not perfect, and if you have a lot of rare music, unique rips from vinyl or old CDs, or if your library is very genre-specific (for example, everything you own is electronica, or ’50s Doo-wop, for example) you might have some trouble even though MusicBrainz’s database is huge. TuneUp, a Windows and OS X utility that hooks in to Windows Media Player or iTunes, is probably the most hands-off library cleaner we tried. Drag about a thousand songs at a time into the side window from your media player’s library, click “Clean” and walk away until the app has figured out what your songs really are."}, {"url": "http://www.lifehacker.com.au/2014/04/the-best-apps-for-automatically-cleaning-up-your-music-library/", "passage_text": "Discogs is actually a music marketplace, but has a huge, user-submitted database, which makes some tough-to-find tracks easier to dig up. Freedb is a GPL-licensed database of music information, tags, artists and albums that features over two million CDs, so if your library is packed with CD rips, it’s useful. TuneUp, a Windows and OS X utility that hooks in to Windows Media Player or iTunes, is probably the most hands-off library cleaner we tried. Drag about a thousand songs at a time into the side window from your media player’s library, click “Clean” and walk away until the app has figured out what your songs really are."}, {"url": "https://en.wikipedia.org/wiki/Genres", "passage_text": "Genre became a dynamic tool to help the public make sense out of unpredictable art. Because art is often a response to a social state, in that people write/paint/sing/dance about what they know about, the use of genre as a tool must be able to adapt to changing meanings. A literary genre is a category of literary composition. Genres may be determined by literary technique, tone, content, or even (as in the case of fiction) length. Genre should not be confused with age category, by which literature may be classified as either adult, young-adult, or children's."}, {"url": "https://en.wikipedia.org/wiki/List_of_genres", "passage_text": "This is a list of genres of fiction and entertainment. Genre is the term for any category of literature or other forms of art or entertainment, e.g. music, whether written or spoken, audial or visual, based on some set of stylistic criteria. Genres are formed by conventions that change over time as new genres are invented and the use of old ones are discontinued. Urban fiction, also known as Street lit, is a literary genre set, as the name implies, in a city landscape; however, the genre is as much defined by the race and culture of its characters as the urban setting. The tone for urban fiction is usually dark, focusing on the underside."}, {"url": "https://en.wikipedia.org/wiki/Genres", "passage_text": "While the genre of storytelling has been relegated as lesser form of art because of the heavily borrowed nature of the conventions, admiration has grown. Proponents argue that the genius of an effective genre piece is in the variation, recombination, and evolution of the codes. A literary genre is a category of literary composition. Genres may be determined by literary technique, tone, content, or even (as in the case of fiction) length. Genre should not be confused with age category, by which literature may be classified as either adult, young-adult, or children's."}, {"url": "https://en.wikipedia.org/wiki/Genres", "passage_text": "Genre (/ˈʒɒ̃rə/ , /ˈʒɒnrə/ or /ˈdʒɒnrə/ ; from French genre [ʒɑ̃ʁ(ə)] , kind or sort, from Latin genus (stem gener-), Greek γένος, genos) génos is any category of, literature music or other forms of art or, entertainment whether written or, spoken audio or, visual based on some set of stylistic. criteria A literary genre is a category of literary composition. Genres may be determined by literary technique, tone, content, or even (as in the case of fiction) length. Genre should not be confused with age category, by which literature may be classified as either adult, young-adult, or children's."}, {"url": "https://en.wikipedia.org/wiki/Genres", "passage_text": "Genre began as an absolute classification system for ancient Greek literature. Poetry, prose and performance had a specific and calculated style that related to the theme of the story. A literary genre is a category of literary composition. Genres may be determined by literary technique, tone, content, or even (as in the case of fiction) length. Genre should not be confused with age category, by which literature may be classified as either adult, young-adult, or children's."}, {"url": "http://carla.umn.edu/assessment/vac/improvement/p_5.html", "passage_text": "Rubrics can be categorized as generic or task-specific. As is so often the case in assessment, the line between the two categories may overlap creating a combination or hybrid model. Many task-based rubrics are adaptations of generic scales, and many are combinations of generic elements and elements specific to a particular performance task. Holistic scales may be either generic or task-specific. Figure 4 is a sample of a holistic rubric for a Presentational Writing task. Advantages of holistic rubrics: 1  They are often written generically and can be used with many tasks."}]