[{"url": "http://www.webmd.com/lung/tc/tuberculosis-tb-topic-overview", "passage_text": "Tuberculosis (TB) is an infection caused by slow-growing bacteria that grow best in areas of the body that have lots of blood and oxygen. That's why it is most often found in the lungs. This is called pulmonary TB. But TB can also spread to other parts of the body, which is called extrapulmonary TB. Treatment is often a success, but it is a long process. It usually takes about 6 to 9 months to treat TB"}, {"url": "http://www.cancerresearchuk.org/about-cancer/type/lung-cancer/about/the-lungs", "passage_text": "At the end of the bronchioles are tiny air sacs called alveoli. In the alveoli oxygen passes into the bloodstream to be carried round the body. Carbon dioxide passes into the alveoli from the bloodstream to be breathed out. The right lung is divided into 3 sections called the upper, middle and lower lobes. The left lung is divided into 2 sections called the upper and lower lobes. The windpipe (trachea) divides into 2 airways, called the right main bronchus and the left main bronchus. One goes to each lung. Within the lungs, they divide into smaller tubes called the secondary bronchi. There are 2 of these on the left side and 3 on the right."}, {"url": "http://www.cancer.org/treatment/understandingyourdiagnosis/advancedcancer/advanced-cancer-what-is-metastatic", "passage_text": "More often, cancer cells that break off from the main tumor travel through the bloodstream. Once in the blood, they can go to any part of the body. Many of these cells die, but some may settle in a new area, begin to grow, and form new tumors. This spread of cancer to a new part of the body is called metastasis. Cancer cells have to go through several steps to spread to new parts of the body:. 1  They have to be able to break away from the original tumor and enter the bloodstream or lymph system, which can carry them to another part of the body. Why cancer cells tend to spread to certain parts of the body. Where a cancer starts often plays a role in where it will spread. Most cancer cells that break free from the original tumor are carried in the blood or lymph until they get trapped in the next “downstream” organ or set of lymph nodes."}, {"url": "https://en.wikipedia.org/wiki/Tuberculosis", "passage_text": "Tuberculosis typically attacks the lungs, but can also affect other parts of the body. It is spread through the air when people who have an active TB infection cough, sneeze, or otherwise transmit respiratory fluids through the air. "}, {"url": "http://www.innerbody.com/image_card06/card13.html", "passage_text": "Click to read more below. The trachea (or windpipe) is a wide, hollow tube that connects the larynx (or voice box) to the bronchi of the lungs. It is an integral part of the body’s airway and has the vital function of providing air flow to and from the lungs for respiration. The trachea begins at the inferior end of the larynx in the base of the neck. "}, {"url": "http://www.cancer.org/treatment/understandingyourdiagnosis/advancedcancer/advanced-cancer-what-is-metastatic", "passage_text": "While most start in the lymph nodes, spleen, and/or bone marrow, some start in lymph tissue in the stomach, intestines, or even the eye socket. Lymphomas can spread within the lymph system to distant parts of the body. Less often, they spread outside the lymph system to other organs, such as the lungs, liver, or bone. Why cancer cells tend to spread to certain parts of the body. Where a cancer starts often plays a role in where it will spread. Most cancer cells that break free from the original tumor are carried in the blood or lymph until they get trapped in the next “downstream” organ or set of lymph nodes."}, {"url": "http://www.webmd.com/lung/picture-of-the-lungs", "passage_text": "The lungs are a pair of spongy, air-filled organs located on either side of the chest (thorax). The trachea (windpipe) conducts inhaled air into the lungs through its tubular branches, called bronchi. The bronchi then divide into smaller and smaller branches (bronchioles), finally becoming microscopic. The bronchioles eventually end in clusters of microscopic air sacs called alveoli. 1 Sarcoidosis: Tiny areas of inflammation can affect all organs in the body, with the lungs involved most of the time. 2  The symptoms are usually mild; sarcoidosis is usually found when X-rays are done for other reasons. 3  Obesity hypoventilation syndrome: Extra weight makes it difficult to expand the chest when breathing."}, {"url": "http://www.innerbody.com/anatomy/respiratory/lungs", "passage_text": "At the same time, carbon dioxide diffuses out of the blood and into the air through the respiratory membrane. The exchange of oxygen into the blood and carbon dioxide into the air allows the blood leaving the lungs to provide oxygen to the body’s cells, while depositing carbon dioxide waste into the air. Control of Breathing. Breathing is controlled by the brain and may be controlled both consciously and unconsciously. "}, {"url": "https://en.wikipedia.org/wiki/Lung", "passage_text": "The lungs of birds are relatively small, but are connected to 8–9 air sacs that extend through much of the body, and are in turn connected to air spaces within the bones. On inspiration, air travels through the trachea of a bird into the 8-9 air sacs. In humans, the lungs are located on either side of the heart in the chest, with the left lung sharing the left side of the space with the heart, which sits in an impression called the cardiac notch."}, {"url": "http://leavingbio.net/respiratory%20system/the%20respiratory%20system.htm", "passage_text": "Body cells use the inhaled oxygen gotten from the alveoli of the lungs. In turn, they produce carbon dioxide and water, which is taken to the alveoli and then exhaled. These exchanges occur as a result of diffusion. In each case the materials move from an area of high concentration to an area of lower concentration. "}]