[{"url": "http://www.cosmeticsmd.org/collagen/", "passage_text": "What is it? Collagen is a fibrous protein that plays a very important role in various structures of the human body. There are several types in the human body and more or less they provide integrity to structures such as the skin, bone, tendon, cartilage, hair, placenta, etc."}, {"url": "http://www.dailymail.co.uk/health/article-2288955/Anti-wrinkle-creams-really-work--magic-ingredient.html", "passage_text": "Anti-wrinkle creams that really work... 1  A chemical called Matrixyl used in some anti-wrinkle creams may double the amount of collagen in skin. 2  Collagen is needed to keep skin elastic and give it a plump, youthful feel-but production declines with age. 3  Scientists say Matrixyl can help the skin produce more."}, {"url": "http://health.howstuffworks.com/skin-care/problems/treating/naturally-boost-collagen2.htm", "passage_text": "1 These creams work on the layers of skin where new skin cells are formed and where collagen gives your skin the support and firmness it needs to appear young and wrinkle-free. 2  By increasing skin cell turnover, retinoid helps stimulate your body's collagen production."}, {"url": "http://musicalhouses.blogspot.com/2013/01/collagen-skincare-and-supplements-do.html", "passage_text": "Basically, these products market themselves on the premise that applying collagen to your skin will replace the collagen lost as a result of aging. Just take a look! Unfortunately, putting collagen creams, lotions, serums, masks or what-have-yous on your skin will not help replace your skins collagen."}, {"url": "http://www.3fatchicks.com/why-topical-collagen-enhancers-dont-work/", "passage_text": "Topical collagen enhancers seem like an easy solution, and to some extent they may seem logical. If collagen is found in skin, then rubbing these creams on the skin must do the trick. That is the prevalent marketing behind the sale of the products and the motivator for purchasing these creams."}, {"url": "http://www.dailymail.co.uk/health/article-2288955/Anti-wrinkle-creams-really-work--magic-ingredient.html", "passage_text": "Anti-ageing creams really do work, scientists claim. Experiments have found that an ingredient in anti-wrinkle creams does have the power to turn back the hands of time. Researchers say chemical called Matrixyl used in some anti-wrinkle creams really can work-by doubling the amount of skin-plumping collagen it produces."}, {"url": "http://musicalhouses.blogspot.com/2013/01/collagen-skincare-and-supplements-do.html", "passage_text": "Secondly, the collagen in some creams also form a film on the skin that gives the appearance of smoother skin by filling in surface irregularities. Such creams that have this effect on skin are typically also formulated with other proteins/peptides in them to enhance the film-forming effect."}]