[{"url": "https://en.wikipedia.org/wiki/Pacific_razor_clam", "passage_text": "Pacific razor clams can be found along the Pacific West Coast from the eastern Aleutian Islands, Alaska, to Pismo Beach, California. They inhabit sandy beaches in the intertidal zone down to a maximum depth of about 30 feet (9 m). Pacific razor clams are highly desirable and edible, collected both commercially and by recreational harvesters. Razor clams, like other shellfish, may sometimes accumulate dangerous levels of domoic acid, a marine toxin."}, {"url": "https://en.wikipedia.org/wiki/Pacific_razor_clam", "passage_text": "The Pacific razor clam, Siliqua patula, is a species of large edible marine bivalve mollusc in the family Pharidae. Pacific razor clams are highly desirable and edible, collected both commercially and by recreational harvesters. Razor clams, like other shellfish, may sometimes accumulate dangerous levels of domoic acid, a marine toxin."}, {"url": "http://wdfw.wa.gov/fishing/shellfish/razorclams/", "passage_text": "Razor clams dredged in water deeper than 30 feet, although similar to the beach clam, are a different species (Siliqua sloati). In Washington waters, the razor clam grows to a maximum length of six inches, although they are seldom found. Clams seven inches long have been recorded, but are very rare. Other areas where razor clams exist are: a series of sand spits in the mouth of Willapa Bay, the Quinault Indian Reservation and numerous small beaches north of Olympic National Park (ONP) Trail 3 at Kalaloch."}, {"url": "http://wdfw.wa.gov/fishing/shellfish/razorclams/", "passage_text": "In contrast, razor clams found in Alaska may grow to eleven inches in length and live to be 15 years old, due to colder water temperatures and slower growth rates. Razor clams are found primarily on the intertidal coastal beaches (those that are exposed at low tide) from a +3 foot level to a -2 foot tide level. Other areas where razor clams exist are: a series of sand spits in the mouth of Willapa Bay, the Quinault Indian Reservation and numerous small beaches north of Olympic National Park (ONP) Trail 3 at Kalaloch."}, {"url": "http://www.adfg.alaska.gov/index.cfm?adfg=razorclam.main", "passage_text": "Range and Habitat. The Arctic razor clam is found in southern Cook Inlet westward to the Bering Sea and Siberia. The Pacific razor clam is more widely distributed and is found from Pismo, California, north to the Aleutian Islands. The Pacific razor clam is the more frequently encountered of the two species. Razor clams live in surf-swept and somewhat protected sand beaches of the open ocean. They are found from approximately 4 feet above the mean low water level down to depths of 30 fathoms. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070412121808AA9NRTh", "passage_text": "Rating Newest Oldest. Best Answer: Hard clams are caught wild from the Gulf of St. Lawrence to Florida, Texas, Cuba and Mexico. They are also harvested in five East and West Coast counties in Florida where they are farm raised. Live clams should only be taken from approved coastal waters. "}, {"url": "https://en.wikipedia.org/wiki/Atlantic_jackknife_clam", "passage_text": "The Atlantic jackknife clam, Ensis directus, also known as the bamboo clam, American jackknife clam or razor clam (but note that  razor clam  sometimes refers to different species), is a large species of edible marine bivalve mollusc, found on the North American Atlantic coast, from Canada to South Carolina. "}, {"url": "http://www.clamdigging.info/", "passage_text": "A limit of razor clams dug in the wet sand at Agate Beach. The razor clams in the photo on the right were dug from the Cove in Seaside Oregon. The book includes:Oregon's Razor Clams discloses all of the beach locations where razor clams are commonly found along the Oregon Coast. The photo array of the razor clam shows displays how to identify razor clams in the wet or dry sand."}, {"url": "http://www.clamdigging.info/clamsbay.html", "passage_text": "Oregon's Clams includes: All the information necessary to consistently dig limits of Oregon's Razor Clams and Oregon's Bay Clams. Oregon's Clams discloses all of the locations where both bay clams and razor clams are commonly found along the Oregon Coast. The photos of the bay clam and razor clam shows displays how to identify both bay clam shows and razor clam shows in the wet and dry sand. Oregon's Razor Clams describes the methods to dig razor clams from the wet and dry sand."}, {"url": "http://www.dfw.state.or.us/MRP/shellfish/razorclams/index.asp", "passage_text": "About Razor Clams. Razor clams (Silqua patula) are found throughout Oregon’s ocean beaches. Clatsop beaches (Columbia River to Seaside) have the most stable populations (because of beach stability), 95 percent of Oregon's razor clam digging occurs here."}]