[{"url": "http://www.manageyourlifenow.com/6-Major-causes-of-daily-headaches/", "passage_text": "1. The abuse of headache drugs is a frequent cause of chronic daily headaches. This can occur in people with migraine or tension-type headache. Usually these are people who have migraine or tension headaches for many years and over the years, the headache incidents become more frequent and more powerful. Abuse of headache drugs 2. Chronic migraines 3. Chronic tension headache 4. Recent beginning of daily headaches 5. Cumulative headache 6. Continuous unilateral headache See below a brief description of each of the situations that can cause daily headaches for more than ten or fifteen times a month."}, {"url": "http://www.mayoclinic.org/diseases-conditions/chronic-daily-headaches/basics/symptoms/CON-20025386", "passage_text": "By definition, chronic daily headaches occur 15 days or more a month, for at least three months. True (primary) chronic daily headaches aren't caused by another condition. There are short-lasting and long-lasting chronic daily headaches. Long-lasting last more than four hours. They include: 1  Chronic migraine. 2  Chronic tension-type headache. 3  New daily persistent headache. 4  Hemicrania continua"}, {"url": "http://www.everydayhealth.com/symptom-checker/headache", "passage_text": "A headache commonly occurs alone, but may occur with other symptoms. Associated symptoms can be important clues for identifying the underlying cause of a headache. Symptoms that may occur with headache include blurry vision, nausea, vomiting, fever, neck pain, neck stiffness, and increased sensitivity to light or noise. Headache. A person with a headache has discomfort beneath the scalp, forehead, or behind the eyes. Headaches may occur occasionally, or headaches may become chronic by occurring frequently. The most common cause of headache is a muscle tension headache. Other common causes of headache include fever, head injury, viral infections, sinusitis, and migraine headaches"}, {"url": "http://www.mayoclinic.org/diseases-conditions/chronic-daily-headaches/basics/causes/CON-20025386", "passage_text": "True (primary) chronic daily headaches don't have an identifiable underlying cause. Conditions that may cause non-primary chronic daily headaches include: 1  Inflammation or other problems with the blood vessels in and around the brain, including stroke. 2  Infections, such as meningitis. 3  Intracranial pressure that's either too high or too low. 4  Brain tumor. 5  Traumatic brain injury."}, {"url": "http://www.webmd.com/migraines-headaches/guide/migraines-headaches-basics", "passage_text": "The most common types of headaches are: Tension headaches: Also called chronic daily headaches or chronic non-progressive headaches, tension headaches are the most common type of headaches among adults and adolescents. These muscle contraction headaches cause mild to moderate pain and come and go over a prolonged period of time. Both adults and children experience this type of headache. Cluster headaches: The least common -- although the most severe -- type of primary headache, the pain of a cluster headache is intense and may be described as having a burning or piercing quality that is throbbing or constant."}, {"url": "http://www.webmd.com/migraines-headaches/guide/tension-headaches", "passage_text": "A. A. Tension headaches are the most common type of headaches among adults. They are commonly referred to as stress headaches. A tension headache may appear periodically (episodic, less than 15 days per month) or daily (chronic, more than 15 days per month). In others, tightened muscles are not part of tension headaches, and the cause is unknown. Tension headaches are usually triggered by some type of environmental or internal stress. The most common sources of stress include family, social relationships, friends, work, and school."}, {"url": "http://www.healthline.com/health/headache-and-nausea", "passage_text": "Migraine headaches are a common cause of headache and nausea. Migraine headaches cause extreme symptoms, including nausea, dizziness, light sensitivity, and severe pain. They’re often preceded by a visual or sensory disturbance, called an aura. "}, {"url": "http://www.medicinenet.com/headache/article.htm", "passage_text": "1 The most common types of primary headaches are 1) tension, 2) migraine, and 3) cluster. 2  Tension headaches are the most common type of primary headache and usually are treated with over-the-counter (OTC) medications for pain. 3  Secondary headaches are a symptom of an injury or an underlying illness. "}]