[{"url": "http://www.babynamespedia.com/meaning/Kyara", "passage_text": "Kyara's language of origin is Latin and Celtic. It is predominantly used in English. Kyara is an English form of the English and Italian Chiara. Kyara is also a form of the English Kiara. Kyara is also a form of the English Kierra. Kyara is an unusual baby girl name. Its usage peaked modestly in 1999 with 0.012% of baby girls being named Kyara. It had a ranking of #928 then"}, {"url": "http://www.ourbabynamer.com/meaning-of-Kiara.html", "passage_text": "Less than 5 boys were given the name. View the Kiara Name Popularity Page to see how the popularity trend for Kiara has changed since 1880, or to compare the popularity of Kiara to other names. Kiara is a variant spelling of Ciara. Variants of the name Kiara include Kiarra, Kiera, Kierra"}, {"url": "http://www.quickbabynames.com/meaning-of-Kyara.html", "passage_text": "In one word, you might describe Kyara as a(n)  pretty  person. See other pretty names for girls. Popularity. See worldwide popularity rankings of Kyara as a baby name (outside USA). As a baby girl name, Kyara is currently not a popular baby name in the USA. There are no available USA popularity statistics for the name Kyara for the past 100 years. However, the following chart shows the popularity ranking for the name Kiara, of which the name Kyara is a variant. See the meaning of Kiara for names of some famous persons with the name Kyara or Kiara (or their variants). Meaning of Names | Baby Boy Names A-Z | Baby Girl Names A-Z | Top 100 Baby Names | Sitemap | Privacy Policy | Tell Your Friends."}, {"url": "http://www.thenamemeaning.com/kyara/", "passage_text": "This doesn't mean that the name Kyara is not popular in other countries all over the world. The name might be popular in other countries, in different languages, or even in a different alphabet, as we use the characters from the Latin alphabet to display the data. Instead, we recommend that you pay a greater attention to the origin and meaning of the name Kyara. Read our baby name articles for useful tips regarding baby names and naming your baby. If you are thinking of giving your baby the beautiful name Kyara, spread the love and share this with your friends."}, {"url": "http://www.thinkbabynames.com/meaning/0/Kyra", "passage_text": "Kyra /kyra/ [2 sylls.] as a girls' name is pronounced KEER-ah. It is of Greek origin, and the meaning of Kyra is lord. From the male name Kyros (see Kyrie), from the Persian and Egyptian word for like Ra, the sun. A short form of Kyria, the Greek title of respect for a woman. In Slavonic it means strong woman. May also be a Russian name meaning beloved"}, {"url": "http://www.quickbabynames.com/meaning-of-Kyara.html", "passage_text": "Form of Ciara meaning dark. It is a female name, suitable for baby girls. Origins. The name Kyara is very likely a(n) Irish variant of the name Kiara. See other suggested Irish girl baby names. See the meaning of Kiara for names of some famous persons with the name Kyara or Kiara (or their variants). Meaning of Names | Baby Boy Names A-Z | Baby Girl Names A-Z | Top 100 Baby Names | Sitemap | Privacy Policy | Tell Your Friends."}, {"url": "http://www.sheknows.com/baby-names/name/kiara", "passage_text": "Irish Meaning: The name Kiara is an Irish baby name. In Irish the meaning of the name Kiara is: Dark. Feminine of Ciaran. Name of a saint. American Meaning: The name Kiara is an American baby name. In American the meaning of the name Kiara is: Dark. Feminine of Ciaran. Name of a saint. "}, {"url": "http://www.thenamemeaning.com/kyara/", "passage_text": "The meaning of Kyara has more than one different etymologies. It has same or different meanings in other countries and languages. The different meanings of the name Kyara are: 1  Latin meaning: Clear; bright; famous. 2  Italian meaning: Clear; bright; famous. Instead, we recommend that you pay a greater attention to the origin and meaning of the name Kyara. Read our baby name articles for useful tips regarding baby names and naming your baby. If you are thinking of giving your baby the beautiful name Kyara, spread the love and share this with your friends."}]