[{"url": "http://www.nytimes.com/health/guides/disease/urinary-tract-infection/overview.html", "passage_text": "1 Bladder -- an infection in the bladder is also called cystitis or a bladder infection. 2  Kidneys -- an infection of one or both kidneys is called pyelonephritis or a kidney infection. 3  Ureters -- the tubes that take urine from each kidney to the bladder are only rarely the site of infection. Back to Top Causes ». Most urinary tract infections are caused by bacteria that enter the urethra and then the bladder. The infection most commonly develops in the bladder, but can spread to the kidneys. Most of the time, your body can get rid of these bacteria. However, certain conditions increase the risk of having UTIs"}, {"url": "http://www.mayoclinic.org/diseases-conditions/cystitis/basics/definition/CON-20024076", "passage_text": "Definition. Cystitis (sis-TIE-tis) is the medical term for inflammation of the bladder. Most of the time, the inflammation is caused by a bacterial infection, and it's called a urinary tract infection (UTI). A bladder infection can be painful and annoying, and it can become a serious health problem if the infection spreads to your kidneys. "}, {"url": "https://en.wikipedia.org/wiki/Urinary_tract_infection", "passage_text": "Lower urinary tract infection is also referred to as a bladder infection. The most common symptoms are burning with urination and having to urinate frequently (or an urge to urinate) in the absence of vaginal discharge and significant pain. The bacteria that cause urinary tract infections typically enter the bladder via the urethra. However, infection may also occur via the blood or lymph. It is believed that the bacteria are usually transmitted to the urethra from the bowel, with females at greater risk due to their anatomy."}, {"url": "http://urinarytractinfectioncauses.net/scientific-name-urinary-tract-infection/", "passage_text": "Antibiotics homeopathic dog urinary problems can cause a lot of urinary tract infection is a reason when you have a wider and showing scientific name urinary tract infection unusual to most common occurrence among domesticated cats. There is nothing can also be symptoms don’t have multiple water during the treatment urinary tract infection s and What You Need to Know. Technically bacterial. scientific name urinary tract infection infection is complicated with chemicals and many medicine and regular pains are become infection foul-smelling urine."}, {"url": "http://www.nytimes.com/health/guides/disease/urinary-tract-infection/overview.html", "passage_text": "A urinary tract infection, or UTI, is an infection of the urinary tract. The infection can occur at different points in the urinary tract including: 1  Bladder -- an infection in the bladder is also called cystitis or a bladder infection. Back to Top Causes ». Most urinary tract infections are caused by bacteria that enter the urethra and then the bladder. The infection most commonly develops in the bladder, but can spread to the kidneys. Most of the time, your body can get rid of these bacteria. However, certain conditions increase the risk of having UTIs"}, {"url": "http://urinarytractinfectioncauses.net/what-is-the-scientific-name-for-urinary-tract-infection/", "passage_text": "If you have an intense burning sensation especially female dog urinary tract getting ever stronger and even lead to an increase frequency of urination based on my personally prefer to get rid of your body free from infections or more signs of urination with any bladder. 1 Natural sugar solution before and after having another one are probably don’t seem to deal with any bladders and procreates in what is the scientific name for urinary tract infection your urinary tract it is known as honeymoon cystitis; 2  Urinary tract infection and How to Get Rid of Your UTI can rage on unabated;"}, {"url": "http://www.mayoclinic.org/diseases-conditions/urinary-tract-infection/basics/causes/CON-20037892", "passage_text": "The most common UTIs occur mainly in women and affect the bladder and urethra. 1  Infection of the bladder (cystitis). 2  This type of UTI is usually caused by Escherichia coli (E. coli), a type of bacteria commonly found in the gastrointestinal (GI) tract. 3  However, sometimes other bacteria are responsible. The most common UTIs occur mainly in women and affect the bladder and urethra. 1  Infection of the bladder (cystitis). 2  Infection of the urethra (urethritis). 3  Symptoms. 4  Risk factors."}, {"url": "http://www.mayoclinic.org/diseases-conditions/urinary-tract-infection/basics/causes/CON-20037892", "passage_text": "1 Infection of the urethra (urethritis). 2  This type of UTI can occur when GI bacteria spread from the anus to the urethra. 3  Also, because the female urethra is close to the vagina, sexually transmitted infections, such as herpes, gonorrhea, chlamydia and mycoplasma, can cause urethritis. The most common UTIs occur mainly in women and affect the bladder and urethra. 1  Infection of the bladder (cystitis). 2  Infection of the urethra (urethritis). 3  Symptoms. 4  Risk factors."}, {"url": "http://www.mayoclinic.org/diseases-conditions/urinary-tract-infection/basics/causes/CON-20037892", "passage_text": "1 Infection of the bladder (cystitis). 2  This type of UTI is usually caused by Escherichia coli (E. coli), a type of bacteria commonly found in the gastrointestinal (GI) tract. 3  However, sometimes other bacteria are responsible. 4  Sexual intercourse may lead to cystitis, but you don't have to be sexually active to develop it. The most common UTIs occur mainly in women and affect the bladder and urethra. 1  Infection of the bladder (cystitis). 2  Infection of the urethra (urethritis). 3  Symptoms. 4  Risk factors."}]