[{"url": "http://exoticpets.about.com/cs/sugargliders/a/sgaspets.htm", "passage_text": "Sugar gliders have become a popular exotic pet. They are small and relatively easy to care for, and have a cute if not unusual appearance. As with any other exotic pet, a potential owner should be aware of their care requirements and personality before acquiring a sugar glider. 1 Glider Basics-basic facts about sugar gliders. 2  Feeding Sugar Gliders-feeding recommendations from an exotic pet veterinarian and an Australian zoo, along with some other resources. 3  Housing Sugar Gliders-More detailed information on the type of cage and accessories needed for"}, {"url": "http://exoticpets.about.com/cs/sugargliders/a/sgaspets.htm", "passage_text": "As for housing, a cage of 24 by 24 inches, by 36 inches high is a good minimum size for a pair. This is a minimum, though-bigger is better and for sugar gliders the height is more valuable than floor space. The cage wire should be no more than 1/2 inch wide, and horizontal cage bars allow climbing. 1 Glider Basics-basic facts about sugar gliders. 2  Feeding Sugar Gliders-feeding recommendations from an exotic pet veterinarian and an Australian zoo, along with some other resources. 3  Housing Sugar Gliders-More detailed information on the type of cage and accessories needed for"}, {"url": "https://simple.wikipedia.org/wiki/Sugar_Glider", "passage_text": "The sugar glider (Petaurus breviceps) is a small marsupial originally native to eastern and northern mainland Australia, New Guinea, and the Bismarck Archipelago, and introduced to Tasmania. Around the world, the sugar glider is a popular domestic pet. It is one of the most commonly traded wild animals in the illegal pet trade, where animals are plucked directly from their natural habitats."}, {"url": "http://www.loveablepocketpets.com/whatis.htm", "passage_text": "(Petaurus Breviceps). A Sugar Glider is a small marsupial possum found in the tree tops of Australia, Tasmania, Indonesia, and Papua-New Guinea. They are so named because they have a preference for sweet foods and a patagium (gliding membrane). The gliding membrane is connected from the wrist to the ankle."}, {"url": "https://en.wikipedia.org/wiki/Sugar_Glider", "passage_text": "The sugar glider has a squirrel-like body with a long, partially (weakly) prehensile tail. The length from the nose to the tip of the tail is about 24 to 30 cm (12–13 inches), and males and females weigh 140 grams and 115 grams respectively. A sugar glider female gives birth to one (19%) or two (81%) babies (joeys) per litter. The gestation period is 15 to 17 days, after which the tiny joey (0.2 g) will crawl into a mother's pouch for further development."}, {"url": "http://www.sugargliderinfo.org/", "passage_text": "The scientific name for Sugar Gliders is Petaurus Breviceps, which is a species of small and tree dwelling marsupial. They are mainly native to countries, including Australia, Indonesia, New Guinea, and Tasmania. Behavior Traits of Sugar Gliders. The average life span of a Sugar Glider is around 12 to 15 years. They are known for their sociable behavior. They are active pets that love to jump, hover around and glide."}, {"url": "http://www.loveablepocketpets.com/whatis.htm", "passage_text": "(Petaurus Breviceps) A Sugar Glider is a small marsupial possum found in the tree tops of Australia, Tasmania, Indonesia, and Papua-New Guinea. They are so named because they have a preference for sweet foods and a patagium (gliding membrane). The gliding membrane is connected from the wrist to the ankle."}, {"url": "https://en.wikipedia.org/wiki/Sugar_Glider", "passage_text": "Around the world, the sugar glider is popular as an exotic pet. It is also one of the most commonly traded wild animals in the illegal pet trade, where animals are taken directly from their natural habitats. A sugar glider female gives birth to one (19%) or two (81%) babies (joeys) per litter. The gestation period is 15 to 17 days, after which the tiny joey (0.2 g) will crawl into a mother's pouch for further development."}, {"url": "http://www.sugarglider.com/gliderpedia/index.asp?SugarGlider", "passage_text": "The sugar glider (Petaurus breviceps) is a small arboreal marsupial that is found in the forests of Australia, as well as in Tasmania, New Guinea, and the neighboring islands of Indonesia. This little creature is a member of the same order that includes kangaroos, opossums, wombats and Tasmanian devils! "}, {"url": "https://en.wikipedia.org/wiki/Sugar_Glider", "passage_text": "The sugar glider (Petaurus breviceps) is a small, omnivorous, arboreal, and nocturnal gliding possum belonging to the marsupial infraclass. The common name refers to its preference for sugary nectarous foods and ability to glide through the air, much like a flying squirrel. A sugar glider female gives birth to one (19%) or two (81%) babies (joeys) per litter. The gestation period is 15 to 17 days, after which the tiny joey (0.2 g) will crawl into a mother's pouch for further development."}]