[{"url": "http://umm.edu/health/medical/ency/articles/nerve-conduction-velocity", "passage_text": "Normal Values. NCV is related to the diameter of the nerve and the degree of myelination (the presence of a myelin sheath on the axon) of the nerve. Newborn infants have values that are approximately half that of adults, and adult values are normally reached by age 3 or 4. Often, the nerve conduction test is followed by electromyography (EMG), which involves needles being placed into the muscle and you contracting that muscle."}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=58877", "passage_text": "Definitions: 1. Abbreviation for nerve conduction velocity. The definition information for NCV is provided by Stedman's. You can search our medical dictionary here. Stedman's, part of Lippincott Williams & Wilkins, provides a comprehensive line of health-science publications for healthcare professionals and medical students."}, {"url": "http://www.webmd.com/brain/electromyogram-emg-and-nerve-conduction-studies", "passage_text": "Guide. An electromyogram (EMG) measures the electrical activity of muscles at rest and during contraction. Nerve conduction studies measure how well and how fast the nerves can send electrical signals. Nerves control the muscles in the body with electrical signals called impulses. An EMG is done to: 1  Find diseases that damage muscle tissue, nerves, or the junctions between nerve and muscle. 2  Find the cause of weakness, paralysis, or muscle twitching."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=34030", "passage_text": "The resulting electrical activity is recorded by the other electrodes. The distance between electrodes and the time it takes for electrical impulses to travel between electrodes are used to calculate the speed of impulse transmission (the nerve conduction velocity, or NCV). A decreased speed of nerve conduction indicates nerve disease. The NCV test is often done at the same time as an electromyogram (EMG) in order to exclude or detect both nerve and muscle conditions. The interpretation of an abnormal NCV test depends on why the test was done in the first place."}, {"url": "https://en.wikipedia.org/wiki/Nerve_conduction_velocity", "passage_text": "Nerve conduction velocity is an important aspect of nerve conduction studies. It is the speed at which an electrochemical impulse propagates down a neural pathway. Conduction velocities are affected by a wide array of factors, including age, sex, and various medical conditions. The purpose of these studies is to determine whether nerve damage is present and how severe that damage may be. Nerve conduction studies are performed as follows: 1  Two electrodes are attached to the subject's skin over the nerve being tested. 2  Electrical impulses are sent through one electrode to stimulate the nerve."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=34030", "passage_text": "Nerve conduction velocity test: An electrical test used to detect nerve conditions. In the nerve conduction velocity (NCV) test, the nerve is electrically stimulated by one electrode while other electrodes detect the electrical impulse down stream from the first electrode. The NCV test is usually done with surface patch electrodes similar to those used for an EKG (electrocardiogram). The patch electrodes are placed on the skin over the nerve at various locations. One electrode stimulates the nerve with a very mild electrical impulse. A decreased speed of nerve conduction indicates nerve disease. The NCV test is often done at the same time as an electromyogram (EMG) in order to exclude or detect both nerve and muscle conditions. The interpretation of an abnormal NCV test depends on why the test was done in the first place."}, {"url": "http://medical-dictionary.thefreedictionary.com/nerve+conduction", "passage_text": "Nerve conduction. The speed and strength of a signal being transmitted by nerve cells. Testing these factors can reveal the nature of nerve injury, such as damage to nerve cells or to the protective myelin sheath. "}, {"url": "https://en.wikipedia.org/wiki/Nerve_conduction_velocity", "passage_text": "Nerve Conduction Velocity is just one of many measurements commonly made during a nerve conduction study (NCS) . The purpose of these studies is to determine whether nerve damage is present and how severe that damage may be. Nerve conduction studies are performed as follows: 1  Two electrodes are attached to the subject's skin over the nerve being tested. 2  Electrical impulses are sent through one electrode to stimulate the nerve."}, {"url": "http://www.mayoclinic.org/tests-procedures/electroconvulsive-therapy/basics/definition/PRC-20014183", "passage_text": "Electromyography (EMG) is a diagnostic procedure to assess the health of muscles and the nerve cells that control them (motor neurons). Motor neurons transmit electrical signals that cause muscles to contract. An EMG translates these signals into graphs, sounds or numerical values that a specialist interprets. An EMG uses tiny devices called electrodes to transmit or detect electrical signals. During a needle EMG, a needle electrode inserted directly into a muscle records the electrical activity in that muscle."}]