[{"url": "http://www.myjobsearch.com/careers/leisure-centre-manager.html", "passage_text": "Leisure centre managers are responsible for ensuring that the separate parts of a leisure centre work together effectively at all times. They work hard to provide excellent services to members of the public, and leisure centres certainly have an important part to play in the local community. "}, {"url": "http://work.chron.com/duties-gym-general-manager-26332.html", "passage_text": "Gym general managers are responsible for the efficient, cost-effective operation of community recreation facilities, private fitness clubs and other venues. To carry out their duties, they require a background in the fitness and leisure industry, with a balance of good administrative, marketing and interpersonal skills. "}, {"url": "http://learningpath.org/articles/Fitness_Manager_Career_Info.html", "passage_text": "1 A New Jersey fitness group needs general and assistant fitness managers who can oversee the personal training department. 2  They'll also need to meet biweekly revenue and client retention goals. 3  Minimum qualifications include personal training certification or a fitness-related degree. Fitness managers use their sales skills and knowledge of exercise science to ensure that a personal training department helps a gym or fitness center meet its bottom line."}, {"url": "http://work.chron.com/general-manager-requirements-10599.html", "passage_text": "Most general managers have a bachelor’s degree in business administration, management or a field related to their work. For example, engineering executives may have an electrical engineering degree. General managers are often the highest-level employees in a business, and their authority is sometimes exceeded only by chief executive officers. So, their most necessary requirement is leadership."}, {"url": "http://www.academicinvest.com/business-careers/management-careers/how-to-become-a-gym-manager", "passage_text": "If you have a university degree or college diploma in management or business administration, you will have an excellent chance of qualifying for a position as a gym or fitness centre manager, especially if you have work experience in a gym, or in fitness, at any capacity during your time as a student. If you want to become a gym manager, you first need to determine if this career path is a good fit for you. If the following description sounds like you, then you’re probably well suited for a career as a gym manager: Those who become gym and fitness centre managers have a genuine interest in fitness and health, and enjoy working with people from different backgrounds"}, {"url": "http://www.snagajob.com/job-descriptions/general-manager/", "passage_text": "Most general managers will have at least a bachelor's degree in business management or a related field, with many electing to get a master's degree. In addition, many managers work their way up after many years of lower-level managerial positions. This depends a lot on what kind of field you are in and what sort of company you are hired to manage. According to the Bureau of Labor Statistics, the median income for general managers in 2010 was $94,400 annually in 2010, or $45.38 per hour."}, {"url": "http://www.snagajob.com/job-descriptions/general-manager/", "passage_text": "Maybe you! General managers are in charge of the operations for a large areas within a company. General managers often oversee local managers and their employees, as well as a local office of employees. General managers set policies, operations, create and maintain budgets, and coordinate with local management in the company to evaluate employees, company performance and efficiencies. This depends a lot on what kind of field you are in and what sort of company you are hired to manage. According to the Bureau of Labor Statistics, the median income for general managers in 2010 was $94,400 annually in 2010, or $45.38 per hour."}, {"url": "http://www.academicinvest.com/business-careers/management-careers/how-to-become-a-gym-manager", "passage_text": "Fitness centre managers are individuals that are able to combine an interest and knowledge in fitness, with an aptitude for business and management. Below we've outlined what you'll need to begin a career as a gym manager. If you want to become a gym manager, you first need to determine if this career path is a good fit for you. If the following description sounds like you, then you’re probably well suited for a career as a gym manager: Those who become gym and fitness centre managers have a genuine interest in fitness and health, and enjoy working with people from different backgrounds"}]