[{"url": "http://www.emedicinehealth.com/medications-drugs/article_em.htm", "passage_text": "Cephalexin fights bacteria in the body. Cephalexin is used to treat infections caused by bacteria, including upper respiratory infections, ear infections, skin infections, and urinary tract infections. Aspirin is in a group of drugs called salicylates. It works by reducing substances in the body that cause pain and inflammation. Aspirin also reduces fever. Rectal aspirin is used to reduce pain, inflammation, and fever. Aspirin is also used to treat the symptoms of arthritis and rheumatic fever."}, {"url": "http://www.answers.com/Q/What_are_the_drugs_that_are_used_to_treat_bacterial_diseases_called", "passage_text": "Yes. Bacterial diseases can be treated with antibiotics. Viral diseases have to run their course. Many viral diseases have vaccines available, such as flu, measles, mumps, chi … cken pox and so on. If your cold or flu turns into pneumonia, then that can be treated since it is bacterial. 1 person found this useful."}, {"url": "http://www.medicalnewstoday.com/articles/10278.php", "passage_text": "An antibiotic is given for the treatment of an infection caused by bacteria. Antibiotics target microorganisms such as bacteria, fungi and parasites. However, they are not effective against viruses. If you have an infection it is important to know whether it is caused by bacteria or a virus. The Greek word anti means against, and the Greek word bios means life (bacteria are life forms). Antibiotics are used to treat infections caused by bacteria. Bacteria are microscopic organisms, some of which may cause illness. The word bacteria is the plural of bacterium."}, {"url": "http://www.rightdiagnosis.com/b/bacterial_diseases/treatments.htm", "passage_text": "Drugs and Medications used to treat Bacterial diseases: Note: You must always seek professional medical advice about any prescription drug, OTC drug, medication, treatment or change in treatment plans. Some of the different medications used in the treatment of Bacterial diseases include: 1  Tetracycline antibiotic. 2  Doxycycline. 3  Adoxa. 4  Apo-Doxy. 5  Apo-Doxy-Tabs. 6  Atridox. 7  Doryx. 8  Doxy Caps. 9  Doxychel."}, {"url": "https://en.wikipedia.org/wiki/Antibacterial", "passage_text": "Self prescription of antibiotics is an example of misuse. Many antibiotics are frequently prescribed to treat symptoms or diseases that do not respond to antibiotics or that are likely to resolve without treatment. Also, incorrect or suboptimal antibiotics are prescribed for certain bacterial infections. Antibiotics revolutionized medicine in the 20th century, and have together with vaccination led to the near eradication of diseases such as tuberculosis in the developed world. Their effectiveness and easy access led to overuse, especially in live-stock raising, prompting bacteria to develop resistance."}, {"url": "http://www.rightdiagnosis.com/v/viral/treatments.htm", "passage_text": "Antibiotics treat bacterial infections and are ineffective for the treatment of viral infections. Sometimes drugs called antiviral drugs may be used to help treat certain types of viral infections. Antiviral drugs help to minimize the severity of a viral infection. Depending on the type of viral infection and the presence of complications, a wide variety of other treatments may be needed. Viral diseases can be very difficult to treat because viruses live inside the body's cells where they are protected from medicines in the blood stream. Researchers developed the first antiviral drug in the late 20th century."}, {"url": "http://www.medicalnewstoday.com/articles/10278.php", "passage_text": "Antibiotics, also known as antibacterials, are types of medications that destroy or slow down the growth of bacteria. The Greek word anti means against, and the Greek word bios means life (bacteria are life forms). Antibiotics are used to treat infections caused by bacteria. Bacteria are microscopic organisms, some of which may cause illness. The word bacteria is the plural of bacterium. Such illnesses as syphilis, tuberculosis, salmonella, and some forms of meningitis are caused by"}, {"url": "https://en.wikipedia.org/wiki/Antibacterial", "passage_text": "Antibiotics or antibacterials are a type of antimicrobial used in the treatment and prevention of bacterial infection. Antibiotics revolutionized medicine in the 20th century, and have together with vaccination led to the near eradication of diseases such as tuberculosis in the developed world. Their effectiveness and easy access led to overuse, especially in live-stock raising, prompting bacteria to develop resistance."}, {"url": "http://www.emedicinehealth.com/medications-drugs/article_em.htm", "passage_text": "Azithromycin is in a group of drugs called macrolide antibiotics. Azithromycin fights bacteria in the body. Azithromycin is used to treat many different types of infections caused by bacteria, such as respiratory infections, skin infections, ear infections, and sexually transmitted diseases. Methylprednisolone is in a class of drugs called steroids. Aspirin is in a group of drugs called salicylates. It works by reducing substances in the body that cause pain and inflammation. Aspirin also reduces fever. Rectal aspirin is used to reduce pain, inflammation, and fever. Aspirin is also used to treat the symptoms of arthritis and rheumatic fever."}, {"url": "https://en.wikipedia.org/wiki/Antibacterial", "passage_text": "Antibiotics are not effective against viruses such as the common cold or influenza, and may be harmful when taken inappropriately. In 1929, Alexander Fleming identified penicillin, the first chemical compound with antibiotic properties. Antibiotics revolutionized medicine in the 20th century, and have together with vaccination led to the near eradication of diseases such as tuberculosis in the developed world. Their effectiveness and easy access led to overuse, especially in live-stock raising, prompting bacteria to develop resistance."}]