[{"url": "https://en.wikipedia.org/wiki/Havrix", "passage_text": "Hepatitis A vaccine is a vaccine against the hepatitis A virus. The first successful vaccine against it was invented by Maurice Hilleman at Merck. The vaccine protects against the virus in more than 95% of cases and provides protection from the virus for at least fifteen years. The vaccine should be given in the muscle of the upper arm and be given in two doses for the best protection. The initial dose of the vaccine should be followed up by a booster six to twelve months later. Protection against hepatitis A begins approximately two to four weeks after the initial vaccination."}, {"url": "http://www.rxlist.com/havrix-drug.htm", "passage_text": "HAVRIX (Hepatitis A Vaccine) is a sterile suspension of inactivated virus for intramuscular administration. The virus (strain HM175) is propagated in MRC -5 human diploid cells. After removal of the cell culture medium, the cells are lysed to form a suspension. HAVRIX is formulated without preservatives. HAVRIX is available in vials and prefilled syringes. The tip caps of the prefilled syringes may contain natural rubber latex; the plungers are not made with natural rubber latex. The vial stopp"}, {"url": "http://hepatitis.emedtv.com/havrix/havrix.html", "passage_text": "The prescription drug Havrix is an injectable vaccine that provides protection against the virus that causes hepatitis A. It works by exposing the body to a weakened form of the virus, which causes a specific immune system response. Havrix ® (hepatitis A vaccine) is used to provide protection against hepatitis A. It is approved for use in individuals one year of age and older."}, {"url": "http://hepatitis.emedtv.com/havrix/havrix.html", "passage_text": "Havrix does not contain thimerosal (a mercury-containing preservative). People who are concerned about exposure to this substance can be confident that this vaccine has no thimerosal -- not even trace amounts. Some people also are concerned about the aluminum content of vaccines. Havrix ® (hepatitis A vaccine) is used to provide protection against hepatitis A. It is approved for use in individuals one year of age and older."}, {"url": "http://www.emedicinehealth.com/drug-hepatitis_a_pediatric_vaccine/article_em.htm", "passage_text": "Hepatitis causes inflammation of the liver, vomiting, and jaundice (yellowing of the skin or eyes). Hepatitis can lead to liver cancer, cirrhosis, or death. The hepatitis A pediatric vaccine is used to help prevent this disease in children. The vaccine works by exposing your child to a small amount of the virus, which causes the body to develop immunity to the disease. This vaccine will not treat an active infection that has already developed in the body. "}, {"url": "http://www.medicinenet.com/hepatitis_a_vaccine-injection/article.htm", "passage_text": "GENERIC NAME: hepatitis A vaccine. DRUG CLASS AND MECHANISM: Hepatitis A vaccine (Havrix, Vaqta) is used to prevent hepatitis A, a type of liver disease that is caused by the hepatitis A virus (HAV). Hepatitis A vaccine was approved in 2005. PRESCRIBED FOR: Hepatitis A vaccine is used to prevent hepatitis A. Hepatitis A vaccine can be used in persons 1 year of age and older. Although anyone can be infected with hepatitis A, certain people are at high risk and should be routinely vaccinated."}, {"url": "http://www.cdc.gov/vaccines/hcp/vis/vis-statements/hep-a.html", "passage_text": "Children who are not vaccinated by 2 years of age can be vaccinated at later visits. For others at risk, the hepatitis A vaccine series may be started whenever a person wishes to be protected or is at risk of infection. For travelers, it is best to start the vaccine series at least one month before traveling. Hepatitis A is a serious liver disease caused by the hepatitis A virus (HAV). HAV is found in the stool of people with hepatitis A. It is usually spread by close personal contact and sometimes by eating food or drinking water containing HAV."}, {"url": "http://www.rxlist.com/havrix-drug/patient-images-side-effects.htm", "passage_text": "Hepatitis causes inflammation of the liver, vomiting, and jaundice (yellowing of the skin or eyes). Hepatitis can lead to liver cancer, cirrhosis, or death. The hepatitis A adult vaccine is used to help prevent this disease in adults. The vaccine works by exposing you to a small amount of the virus, which causes the body to develop immunity to the disease. This vaccine will not treat an active infection that has already developed in the body. Like any medicine, this vaccine can cause side effects, but the risk of serious side effects is extremely low. Call your doctor at once if you have any of these serious side effects: 1  high fever; 2  fast or uneven heartbeats; or. 3  behavior changes."}, {"url": "https://www.gsksource.com/pharma/content/dam/GlaxoSmithKline/US/en/Prescribing_Information/Havrix/pdf/HAVRIX.PDF", "passage_text": "HAVRIX is approved for use in persons 12 months of age and older. Primary immunization should be administered at least 2 weeks prior to expected exposure to HAV. (1) ----------------------- DOSAGE AND ADMNISTI RATONI ---------------- • HAVRIX is administered by intramuscular injection. "}]