[{"url": "http://www.parathyroid.com/diagnosis.htm", "passage_text": "You must be diagnosed with parathyroid disease (hyperparathyroidism) if your parathyroid hormone level is high and your calcium level is also high. The excess parathyroid hormone is the CAUSE of the high calcium. The high calcium is caused by a parathyroid tumor--nothing else will cause this. However... many people (about 20% of all patients with hyperparathyroidism) will have parathyroid disease when they have high calcium and NORMAL PTH levels... The point here is that the parathyroid gland is still the problem. This is a more complex situation, so we will discuss it at the end of this page."}, {"url": "http://patient.info/health/hyperparathyroidism-leaflet", "passage_text": "If you have secondary hyperparathyroidism, your blood calcium level may be low or normal but you will still have a raised parathyroid hormone level. If you also have kidney disease, your blood phosphate level can be high because your kidney cannot get rid of (excrete) phosphate in your urine. When the calcium level rises and is back to normal, the release of parathyroid hormone is suppressed. Parathyroid hormone has a number of effects in your body: 1  It causes the release of calcium from your bones. 2  It causes calcium to be absorbed (taken up into your blood) from your gut (small intestine)."}, {"url": "http://www.stopthethyroidmadness.com/parathyroid/", "passage_text": "It is when the blood parathyroid hormone (PTH) levels are higher than normal, but the blood calcium level is normal in patients who do not have secondary hyperparathyroidism disease. Patients can have blood calcium levels that are occasionally high. If either calcium level is high and the PTH high (and that includes even moderately high), you’ve got a problem! Even if your PTH is “normal”, and your calcium is high, you may have hyperparathyroidism (pHPT). Even if it’s in the normal range, someone can have pHPT. There needs to be a proportionate balance between the two levels"}, {"url": "http://www.parathyroid.com/diagnosis.htm", "passage_text": "Parathyroid problem and parathyroid disease. It is NORMAL for patients with hyperparathyroidism (parathyroid disease) to have calcium levels that are high one time it is checked, and normal the next time it is checked. ALL patients with hyperparathyroidism will have calcium levels that change from day to day, week to week, month to month. However... many people (about 20% of all patients with hyperparathyroidism) will have parathyroid disease when they have high calcium and NORMAL PTH levels... The point here is that the parathyroid gland is still the problem. This is a more complex situation, so we will discuss it at the end of this page."}, {"url": "http://hypopara.org.uk/hpth.php?id=154", "passage_text": "In Secondary Hyperparathyroidism, you will have symptoms of low NOT high calcium which can be seen here. But-you may develop bone complications (see osteopenia above) and the symptoms related to that. In secondary hyperparathyroidism, you will have a low or normal calcium level with a raised parathyroid hormone level. This, in turn, releases TOO MUCH calcium into the blood.A blood test will show hypercalcaemia, a high level of calcium in the blood The normal range is around 2.1 - 2.6 mmol/LHypercalcaemia can cause various symptoms-tiredness, thirst, headaches, nausea, vomiting, kidney stones and bone pains."}, {"url": "http://www.parathyroid.com/parathyroid-disease.htm", "passage_text": "This graph shows the blood parathyroid hormone levels in 18,000 patients operated on at the Norman Parathyroid Center for primary hyperparathyroidism. Normal blood levels of parathyroid hormone vary according to the lab that measures the hormone, but most labs have a normal level between 15 and 65 pg/ml. Thus, even when the blood calcium level is high--when the parathyroids should not be making any hormone at all--one of the glands keeps making hormone. Remember as you read about hyperparathyroidism on these pages, it is a hormone problem secreted by a benign parathyroid tumor."}, {"url": "http://www.parathyroid.com/diagnosis.htm", "passage_text": "The diagnosis is made with blood tests--ONLY. About 20% of parathyroid patients will have high calcium levels but their PTH levels will be in the normal range (like patients 3, 7 and 8 in the table above). However... many people (about 20% of all patients with hyperparathyroidism) will have parathyroid disease when they have high calcium and NORMAL PTH levels... The point here is that the parathyroid gland is still the problem. This is a more complex situation, so we will discuss it at the end of this page."}, {"url": "http://blog.parathyroid.com/parathyroid-hormone-pth-levels/", "passage_text": "Included in these tests were repeat calcium and PTH levels (and an assortment of other tests…) The calcium level was still high (10.9), but the parathyroid hormone level was now 63 pg/ml. Like magic it was back down to normal again. “You can’t have a parathyroid tumor when your parathyroid hormone level is normal. Come on back in six months, but in the meantime take this Fosamax for your bones”. Note, this is one of the 10 most common mistakes doctors make when diagnosing hyperparathyroidism as discussed in another recent blog."}, {"url": "http://my.clevelandclinic.org/health/transcripts/1386_calcium-disorders-and-parathyroid-disease-what-you-should-know-about-your-parathyroid", "passage_text": "Dr_Doshi: It is true that PTH (parathyroid hormone) levels can be high with normal calcium levels. It may be a good idea to have your Vitamin D levels tested, which can drive the PTH levels up independent of a primary parathyroid problem. Parathyroid glands make parathyroid hormone (PTH), which regulates the balance of calcium and phosphorous levels in the body. Hyperparathyroidism is caused by too much PTH, which causes excess calcium in the body. Hypoparathyroidism is the result of too little PTH, causing a deficiency of"}]