[{"url": "http://work.chron.com/job-description-infectious-disease-physician-17104.html", "passage_text": "Many infectious disease physicians complete undergraduate degrees in biology, pre-med, infectious disease or epidemiology before attending medical school, which typically lasts four years. Upon graduation, they earn their Doctor of Medicine degree and must then pass the United States Medical Licensing Exam."}, {"url": "http://learningpath.org/articles/Infectious_Disease_Specialist_Career_Overview.html", "passage_text": "Job Description and Duties. An ID specialist is an internal medicine doctor, according to the American Board of Medical Specialties. While some physicians may focus on a specific area or structure of the human anatomy, an ID specialist must have an extensive understanding of the entire anatomy and system functions."}, {"url": "http://www.gapmedics.com/blog/2014/09/24/becoming-an-infectious-disease-specialist/", "passage_text": "An infectious disease is an illness that can be transmitted from person to person. There are several different causes of infectious diseases, including parasites, fungi, bacteria and viruses. Infections can develop in all areas of the body including the heart, brain, lungs and bones."}, {"url": "http://study.com/articles/Doctor_of_Infectious_Disease_Career_Info_for_Infectious_Disease_Specialists.html", "passage_text": "Educational Requirements. Doctors of infectious diseases need nine to ten years of training in order to practice, not including any undergraduate education. This includes four years of medical school, three years of training as a doctor of internal medicine and two years of specialized training in infectious disease."}, {"url": "http://learningpath.org/articles/Infectious_Disease_Specialist_Career_Overview.html", "passage_text": "Pros and Cons of a Career as an Infectious Disease Specialist. These specialists are internal medicine physicians who diagnose and treat infectious diseases. Find out about the pros and cons of this career to find out if being an ID specialist might be a specialty you'd enjoy."}, {"url": "http://study.com/articles/Doctor_of_Infectious_Disease_Career_Info_for_Infectious_Disease_Specialists.html", "passage_text": "Infectious disease specialists are employed in public health organizations, like the Centers for Disease Control and Prevention (CDC) or the National Institutes of Health (NIH). These agencies train doctors of infectious diseases and contribute to the development of research in the field."}, {"url": "http://healthcareers.about.com/od/physiciancareers/a/InfectiousDiseaseMD.htm", "passage_text": "Infectious diseases include sexually transmitted diseases (STD) such as HIV/AIDS. Most infectious disease physicians are hospital based, or they can also see patients in a clinic, or outpatient setting. Infectious disease specialists help to identify and manage patients who have been infected."}]