[{"url": "http://www.spine-health.com/treatment/pain-medication/about-celebrex-celecoxib-cox-2-inhibitor", "passage_text": "Dosage of Celebrex is based on the patient’s medical condition and response to therapy. The FDA has recommended the following dosages for Celebrex: 1  For osteoarthritis, oral dosage of 100 mg twice daily or 200 mg once daily. Celebrex is the brand name of a prescription pain medication in the COX-2 inhibitor class of drugs. The active ingredient in Celebrex is celecoxib. Celebrex works by reducing inflammation, which often is a component of arthritis, back pain and neck pain."}, {"url": "http://www.nsaidslist.com/celebrex-dosage/", "passage_text": "Remember that to relieve the pain, Celebrex must be used in the lowest effective dose. To treat symptoms of osteoarthritis the usual indicated dose is 200 mg 1 a day, or 100 mg 2 times a day. This Celebrex dosage is the same for those suffering from ankylosing spondylitis, 200 mg 1 a day, or 100 mg 2 times a day. The dose can be increased to 200 mg 2 times per day, only if it was recommended by your doctor. Celebrex dosage for elderly (over 65 years) it begins with a dose of 200 mg per day. If needed, it can be administered 4"}, {"url": "http://www.rxlist.com/celebrex-drug/indications-dosage.htm", "passage_text": "The recommended dose of CELEBREX is 400 mg initially, followed by an additional 200 mg dose if needed on the first day. On subsequent days, the recommended dose is 200 mg twice daily as needed. Ankylosing Spondylitis. For the management of the signs and symptoms of AS, the recommended dose of CELEBREX is 200 mg daily in single (once per day) or divided (twice per day) doses. If no effect is observed after 6 weeks, a trial of 400 mg daily may be worthwhile"}, {"url": "http://www.ehow.com/about_5038077_usual-dosage-celebrex.html", "passage_text": "Adult Dosage. Adult dosage of Celebrex will vary according to the condition for which you are taking the drug. Generally speaking, arthritis patients will take 200 mg daily. Your doctor may direct you to take a 200 mg pill of Celebrex once daily, or to split the dose and take two 100 mg pills at each end of the day. Women who suffer from debilitating menstrual cramps may also be prescribed Celebrex. When the question of a usual dosage of Celebrex arises, there is no short answer. The dosages prescribed depend on the individual's medical history and the condition for which the drug is prescribed."}, {"url": "http://arthritis.emedtv.com/celebrex/celebrex-dosage.html", "passage_text": "Children who are poor CYP 2C9 metabolizers probably should not take Celebrex at all. Osteoarthritis. The recommended starting dose of Celebrex for most people with osteoarthritis is 200 mg -- either once a day as a single dose or as 100 mg twice a day. Celebrex Medication Information. Advertisement"}, {"url": "http://canadianmedsusa.com/celebrex-information.htm", "passage_text": "The dosage of Celebrex prescribed to each patient will vary. Always follow your physicians instructions and/or the directions on the prescription drug label. The following dosage information includes some common doses of Celebrex. Do not follow any of the dosages described below unless your physician has approved. If your physician or pharmacist has ordered you to take Celebrex medicine an a regular schedule and you have missed a Celebrex dose you can take it as soon as you remember. If you remember close to the time for your next dose, skip the missed dose and go back to your regular dosing schedule."}, {"url": "http://www.everydayhealth.com/drugs/celebrex", "passage_text": "For those patients greater than 10 kg but weighing less than 25 kg, the usual dosage of Celebrex is 50 mg administered twice daily. For patients weighing greater than 25 kg, the usual dosage of Celebrex is 100 mg administered twice daily. A: Celebrex (celecoxib) is classified as a nonsteroidal anti inflammatory drug, and is COX-2 selective. It is used for the treatment of osteoarthritis, ankylosing spondylitis, rheumatoid arthritis, acute pain, familial adenomatous polyposis and treatment of dysmenorrhea."}, {"url": "http://www.everydayhealth.com/drugs/celebrex", "passage_text": "Celebrex is the brand name for the prescription pain reliever celecoxib, the drug's active ingredient. Doctors prescribe Celebrex to treat pain, swelling, and stiffness of arthritis and some other conditions. Celebrex is a non-steroidal anti-inflammatory drug, often referred to simply as an NSAID. NSAIDs block swelling, pain, and fever. Celebrex works by stopping the production of COX-2, a natural substance in the body that causes pain and inflammation. Celebrex is an NSAID and a COX-2 inhibitor. A: Celebrex (celecoxib) is classified as a nonsteroidal anti inflammatory drug, and is COX-2 selective. It is used for the treatment of osteoarthritis, ankylosing spondylitis, rheumatoid arthritis, acute pain, familial adenomatous polyposis and treatment of dysmenorrhea."}, {"url": "http://www.nsaidslist.com/celebrex-dosage/", "passage_text": "For those suffering from rheumatoid arthritis, the usual indicated starting dose is 100 mg 2 times a day. The dose can be increased to 200 mg 2 times per day, only if it was recommended by your doctor. Celebrex dosage for elderly (over 65 years) it begins with a dose of 200 mg per day. If needed, it can be administered 400 mg per day. Particular caution is recommended for elderly with weight below 50 kg"}]