[{"url": "http://digital-photography-school.com/break-the-rules-of-photography-and-take-stunning-images/", "passage_text": "While you probably won’t want to break these rules in every photograph that you take – breaking them can bring about some fairly spectacular results. Stay tuned for the first rule of photography to try breaking shortly (and feel free to nominate some of the rules you break in comments below). PS: to follow this series of posts Subscribe to Digital Photography School via Email or RSS. Since starting this blog I’ve written about many rules of photography – but in almost every ‘rule post’ I’ve included some sort of disclaimer indicating that breaking the rule can lead to great results."}, {"url": "http://photography.nationalgeographic.com/photography/photo-tips/breaking-the-rules/", "passage_text": "Photograph by James Nachtwey, National Geographic. Learn the rules of photography—then break them. While the conventional guidelines provide an important framework, once you learn the basics, there are no limits to personal expression. Keeping the horizon line—and overall scene—straight is an important rule of photography when composing for almost any landscape. However, an intentional and dramatic tilt of the camera can add a dynamic twist to your shot, transforming the scene from the expected to something surprising."}, {"url": "http://openstudy.com/updates/50bfebabe4b0689d52fdefca", "passage_text": "Now that you’ve learned a bit about some of the rules of photography, let’s talk a little bit about breaking those rules. Deliberately breaking the rules, with intention, can help you be a better photographer. notice how it says DELIBERATELY i think the answer is C and @eazy-e is wrong. Show full answer. "}, {"url": "http://www.photographymad.com/pages/view/rule-of-thirds", "passage_text": "As with all rules (at least in photography), the rule of thirds doesn't apply in every situation, and sometimes breaking it can result in a much more eye-catching, interesting photo. Experiment and test out different compositions even if they go against any rules you've learned. "}, {"url": "http://www.photographymad.com/pages/view/10-top-photography-composition-rules", "passage_text": "10 Top Photography Composition Rules. There are no fixed rules in photography, but there are guidelines which can often help you to enhance the impact of your photos. It may sound cliched, clichéd but the only rule in photography is that there are no. rules"}, {"url": "http://www.digital-photo-secrets.com/tip/4191/breaking-rules-ignoring-rule-thirds/", "passage_text": "So I’ll just say that in photography, the word “rule” doesn’t mean the same thing as at means, say, in politics. Not that it means anything there, either. In photography, rules are like pirate code: they’re really more like guidelines. You can break them, but you need to have a good reason. So to help you along in that goal, I’d like to welcome you to my series on breaking photography rules, starting with the grand master of all photography rules, the rule of thirds. Yes, the rule of thirds. That rule which should not be broken. "}, {"url": "https://en.wikipedia.org/wiki/Rule_of_thirds", "passage_text": "This photograph of a sunset taken in the Thousand Islands region demonstrates the principles of the rule of thirds. The rule of thirds is a  rule of thumb  or guideline which applies to the process of composing visual images such as designs, films, paintings, and photographs. "}, {"url": "http://www.picturecorrect.com/tips/breaking-photography-rules/", "passage_text": "The times to consider breaking the rule of thirds are times when you have a natural frame that highlights a central subject or strong lines and other picture elements that lead the eye to a strong central point of interest. It’s sometimes a good idea to consider shooting a subject both ways. Some of your shots aligned with the Rule of Thirds and one or two deliberately outside the guidelines. Then you can decide in the comfort of your own work space which composition works better. But before you break the basic rules of photography, you have to learn them. There’s a time to follow the rules and a time to throw out the rule book; experience that will help you choose between the two."}, {"url": "http://photography.nationalgeographic.com/photography/photo-tips/breaking-the-rules/", "passage_text": "Shooting with the light source behind you, so that the subject is illuminated from the front, is an oft-cited rule of thumb. Backlighting creates the opposite effect—and serves to separate the background from the subject in a way that can be quite dramatic. Keeping the horizon line—and overall scene—straight is an important rule of photography when composing for almost any landscape. However, an intentional and dramatic tilt of the camera can add a dynamic twist to your shot, transforming the scene from the expected to something surprising."}]