[{"url": "http://www.infoplease.com/encyclopedia/history/guadalupe-hidalgo-treaty-of.html", "passage_text": "Guadalupe Hidalgo, Treaty of. Guadalupe Hidalgo, Treaty of, 1848, peace treaty between the United States and Mexico that ended the Mexican War. Negotiations were carried on for the United States by Nicholas P. Trist. The treaty was signed on Feb. 2, 1848, in the village of Guadalupe Hidalgo, just outside Mexico City. It confirmed U.S. claims to Texas and set its boundary at the Rio Grande"}, {"url": "http://memory.loc.gov/ammem/today/feb02.html", "passage_text": "The Treaty of Guadalupe Hidalgo was signed in village of Guadalupe Hidalgo on February 2, 1848, ending the Mexican War and extending the boundaries of the United States west to the Pacific Ocean. Today in History: February 2. There shall be firm and universal peace between the United States of America and the Mexican Republic… Article I, Treaty of Guadalupe Hidalgo, signed February 2, 1848."}, {"url": "http://loc.gov/rr/program/bib/ourdocs/Guadalupe.html", "passage_text": "Reproduction Number: LC-USZC2-2800. The Treaty of Guadalupe Hidalgo was signed by the United States and Mexico on February 2, 1848, ending the Mexican War and extending the boundaries of the United States by over 525,000 square miles. February 2, 1848 - The Treaty of Guadalupe Hidalgo was signed by the United States and Mexico. March 10, 1848 - The Senate ratified the Treaty of Guadalupe Hidalgo by a vote of 38 to 14."}, {"url": "http://loc.gov/rr/program/bib/ourdocs/Guadalupe.html", "passage_text": "February 2, 1848 The Treaty of Guadalupe Hidalgo was signed in Mexico City on February 2, 1848. February 23, 1847 The Battle of Buena Vista was won by the United States on February 23, 1847. February 2, 1848 - The Treaty of Guadalupe Hidalgo was signed by the United States and Mexico. March 10, 1848 - The Senate ratified the Treaty of Guadalupe Hidalgo by a vote of 38 to 14."}, {"url": "http://www.americaslibrary.gov/jb/reform/jb_reform_guadalup_1.html", "passage_text": "On February 2, 1848, U.S. and Mexican officials met in Mexico City to sign the Treaty of Guadalupe Hidalgo. The agreement brought an end to the Mexican War after nearly two years and extended the U.S. west to the Pacific Ocean with 525,000 square miles of former Mexican territory. "}, {"url": "http://www.history.com/topics/treaty-of-guadalupe-hidalgo", "passage_text": "The Treaty of Guadalupe Hidalgo, signed on February 2, 1848, ended the Mexican-American War in favor of the United States. The war had begun almost two years earlier, in May 1846, over a territorial dispute involving Texas. The treaty added an additional 525,000 square miles to United States territory, including the land that makes up all or parts of present-day Arizona, California, Colorado, Nevada, New Mexico, Utah and Wyoming."}, {"url": "http://www.ourdocuments.gov/doc.php?doc=26", "passage_text": "The Treaty of Guadalupe Hidalgo, which brought an official end to the Mexican-American War (1846–48), was signed on February 2, 1848, at Guadalupe Hidalgo, a city to which the Mexican government had fled with the advance of U.S. forces. By its terms, Mexico ceded 55 percent of its territory, including parts of present-day Arizona, California, New Mexico, Texas, Colorado, Nevada, and Utah, to the United States."}, {"url": "http://www.ourdocuments.gov/doc.php?doc=26", "passage_text": "How to use citation info. (on Archives.gov). This treaty, signed on February 2, 1848, ended the war between the United States and Mexico. By its terms, Mexico ceded 55 percent of its territory, including parts of present-day Arizona, California, New Mexico, Texas, Colorado, Nevada, and Utah, to the United States."}]