[{"url": "http://truckertaxglossary.com/per_diem_deduction/", "passage_text": "A more correct name for per diem deduction would be meal expenses and incidental expenses tax deduction. The term Per Diem Deduction is not a term that truckers will find in the tax code, yet this term describes a very lucrative tax write-off for truckers. "}, {"url": "http://smallbusiness.chron.com/file-truckers-per-diem-expenses-32801.html", "passage_text": "Rates vary by location. According to the U.S. General Services Administration, if a trucker is allotted $56 in per diem expenses a day, that breaks down to about $9 for breakfast, $13 for lunch, $29 for dinner and $5 for incidental charges. Per diem expenses for truckers are expenses that are granted for truckers that live away from home during work. For example, meals are a per diem expense. Lodging and clothing might be acceptable as well, depending on the employer. Employers grant truckers a certain amount of per diem expenses each day, week or job."}, {"url": "http://www.ehow.com/info_12168951_per-diem-tax-credit-truck-drivers.html", "passage_text": "One way that truck drivers can offset some of their earnings and receive a tax deduction is to use the per diem allowance established by the Internal Revenue Service. This information is published in IRS Publication 463 and establishes the limits for daily meal deductions that truck drivers can take. Employers, on the other hand, adhere to Publication 1542, which establishes the maximum per diem rates the employer can pay the employee as a reimbursement of expenses. To qualify for a tax deduction on a per diem basis, you must first meet the requirements established by the IRS. In general, you must be a transportation worker whose job requires that you be away from home on a regular basis."}, {"url": "http://www.mcmcpa.com/trucking-per-diems-drivers-beware", "passage_text": "For travel post-September 30, 2012, the IRS-approved per diem rate for high-cost areas is $242 (reflecting $177 for lodging and $65 for meals and incidental expenses). The IRS-approved per diem rate for all other areas is $163 (reflecting $111 for lodging and $52 for meals and incidental expenses). The $242/$163 amounts are unchanged from last year’s amounts. If a locality is not listed in the IRS tables, the maximum per diem for lodging in 2013 is $83 and the maximum for meals and incidental expenses in 2013 is $46. High-low method. Rather than using the per diem rates, an employer may use simplified “high-low” rates for travel within CONUS (Continental United States)."}, {"url": "http://www.ehow.com/info_8661295_per-diem-work-trucking.html", "passage_text": "The per diem rate for meals as of 2011 is 80 percent of $59 per day in the continental United States and 80 percent of $65 per day if you travel to Canada or Mexico. The IRS requires you to keep track of your per diem expenses in order to receive the per diem deduction. Truck drivers should maintain a daily log that itemizes the number of days you traveled away from your home. At the end of the year, you will need to total your daily log to determine your total per diem deduction. "}, {"url": "http://www.mcmcpa.com/trucking-per-diems-drivers-beware", "passage_text": "The IRS provides tables that identify the maximum per diem amounts for lodging and the maximum per diem rates for meals and incidental expenses in many localities. The IRS issued its 2013 per diem amounts in September 2012. If a locality is not listed in the IRS tables, the maximum per diem for lodging in 2013 is $83 and the maximum for meals and incidental expenses in 2013 is $46. High-low method. Rather than using the per diem rates, an employer may use simplified “high-low” rates for travel within CONUS (Continental United States)."}, {"url": "http://www.truckingtruth.com/wiki/topic-31/per-diem-pay", "passage_text": "Without per diem pay, most drivers would normally take the IRS's standard meal deduction (currently $59/day) when filing their taxes. Since per diem is not taxable income, drivers taking part in it cannot take that deduction, as it is already technically reimbursement. Official IRS Publication 463 (2014), Travel, Entertainment, Gift, and Car Expenses: Information about truck drivers per diem deduction, and travel and meal expenses, can be found in IRS Publication 463. Dm:Dispatcher, Fleet Manager, Driver Manager The primary person a driver communicates with at his/her company."}, {"url": "http://www.landlinemag.com/Story.aspx?StoryID=26515", "passage_text": "In 2013, the daily per diem is $59, and all over-the-road drivers qualify for an 80 percent deduction of that amount. A driver who spends 300 days on the road should receive a yearly deduction of more than $14,000, according to O’Donnell. "}, {"url": "http://truckertaxglossary.com/irs_publication_1542/", "passage_text": "Lodging rates are almost never used by truckers in their per diem deduction because the hotel costs are almost always covered by the trucker's employer. The IRS Publication that lists per diem rates for travel within the Continental United States (CONUS) is called IRS Publication 1542. IRS Publication 1542 contains all the domestic CONUS per diem rates established by the GSA for each individual locality and yea"}]