[{"url": "http://beekeeping.wikia.com/wiki/Nuc", "passage_text": "Nucs, or Nucleus Colonies, are small honey bee colonies created from larger colonies. The term refers both to the smaller size box and the colony of honeybees within it. The name is derived from the fact that a nuc hive is centered around a queen-the nucleus of the honey bee colony. Layout Edit. A nuc hive has all the features of a standard 10 frame Langstroth hive except with a reduced width. The link shows a United States Department of Agriculture USDA lay out for building a nuc."}, {"url": "http://edis.ifas.ufl.edu/in869", "passage_text": "If nucs remain strong after removing bees/brood, you can purchase nuc queen excluders and nuc medium supers in order to manage the nuc as a regular colony. Many companies carry equipment – excluders, supers, feeders, etc. (Figure 1) – for five-frame nucs but not for three-or four-frame nucs. 1) Creating nucs is a good way to alleviate swarming tendencies in crowded colonies .Taking bees and brood from a colony to create a nuc is, in essence, a controlled swarm. The creation of nucs four to six weeks before the primary nectar flow alleviates the stress of growing colony populations in crowded colonies."}, {"url": "http://www.westnyackhoney.com/bees/what-is-a-bee-nuc/", "passage_text": "A Nuc on the other hand, is 4 or 5 frames from an existing hive. It is a colony that had been working well for a time and the bees know and are related to their queen. The frames contain honey and pollen and eggs and larva. The frames were pulled from a working hive. This is the nucleus of a hive. When you get bees, you can obtain your colony in two ways. First is with a Package. Package bees come in a screened cage the size of a shoebox. There are three pounds of bees (upwards to 10,000) in the package. There is a can of sugar syrup in the cage and a queen in a box."}, {"url": "http://www.westnyackhoney.com/bees/what-is-a-bee-nuc/", "passage_text": "A Nuc, pronounced nuke, is a nuclear hive. It is four or five frames from a working hive including a queen. When you get bees, you can obtain your colony in two ways. First is with a Package. Package bees come in a screened cage the size of a shoebox. There are three pounds of bees (upwards to 10,000) in the package. There is a can of sugar syrup in the cage and a queen in a box."}, {"url": "http://www.stormthecastle.com/mead/bees-honey/what-is-a-nuc.htm", "passage_text": "A nuc is just bee terminology for a small and complete hive that you buy from an apiary and install in your hive. It is typically a small wooden box with five frames in it. These frames compose everything that a young colony needs including a queen, honey and brood. A nuc is a really nice way to set up a new hive. All you do is transfer those five frames from the nuc into the hive. If you are getting a nuc and want to install it into your hive I have a tutorial with pictures right here: How to set up a beehive by installing a nuc. Setting up a beehive is not difficult."}, {"url": "http://www.honeybees4sale.com/NucsvsPackages.aspx", "passage_text": "Since both have an equivalent number of bees and a queen-it's not apparent why a Nuc at $160 is a better bargain than a package picked up for $95. It has to do with time and what's happening in the bees' season.. Spring is when colonies build-as temperatures grow warmer and pollen and nectar become plentiful, their inclination is to make a new colony. Packages, nucs and swarms all arrive about the same time in the southern Appalachians."}, {"url": "http://beekeeping.wikia.com/wiki/Nuc", "passage_text": "Feeding allows the worker bees to remain in the nuc, acting as nurse bees for developing brood. Because of their small population, Nucs are vulnerable to robbing, in which a stronger hive steals all the nectar, honey, or syrup from a weaker hive. Layout Edit. A nuc hive has all the features of a standard 10 frame Langstroth hive except with a reduced width. The link shows a United States Department of Agriculture USDA lay out for building a nuc."}, {"url": "https://en.wikipedia.org/wiki/Nuc", "passage_text": "Feeding allows the worker bees to remain in the nuc, acting as nurse bees for developing brood. Because of their small population, Nucs are vulnerable to robbing, in which a stronger hive steals all the nectar, honey, or syrup from a weaker hive. The bees from a robbing hive will kill any bees that defend the nuc. Layout [edit]. A nuc hive has all the features of a standard 10 frame Langstroth hive except with a reduced width. A link shows a United States Department of Agriculture USDA layout for building a nuc. A typical nuc has 5 Langstroth frames arranged side-by-side."}, {"url": "https://en.wikipedia.org/wiki/Nuc", "passage_text": "Nucs, or nucleus colonies, are small honey bee colonies created from larger colonies. The term refers both to the smaller size box and the colony of honeybees within it. The name is derived from the fact that a nuc hive is centered on a queen, the nucleus of the honey bee colony. Layout [edit]. A nuc hive has all the features of a standard 10 frame Langstroth hive except with a reduced width. A link shows a United States Department of Agriculture USDA layout for building a nuc. A typical nuc has 5 Langstroth frames arranged side-by-side."}]