[{"url": "http://neuroscience.uth.tmc.edu/s3/chapter06.html", "passage_text": "Damage to any part of the motor system hierarchy above the level of alpha motor neurons (not including the side loops) results in a set of symptoms termed the upper motor neuron syndrome. Some of these symptoms are opposite of those of lower motor neuron disorders. Also unlike basal ganglia (and motor cortex), damage to the cerebellum causes impairments on the ipsilateral side of the body. 1  Ataxia is a general term used to describe the general impairments in movement coordination and accuracy that accompany cerebellar damage."}, {"url": "http://www.neuroanatomy.wisc.edu/coursebook/motor2.pdf", "passage_text": "Without information from the basal ganglia, the cortex is unable to properlydirect motor control, and the deficits seen in Parkinson’s and Huntington’s disease and relatedmovement disorders become apparent.Let’s start with the anatomy of the basal ganglia. There are no descending pathways that go from the basal ganglia directly to the spinal cord. ALL OF THIS CIRCUITRY IS ONTHE SAME SIDE OF THE BRAIN—UNCROSSED .Thus, the basal ganglia affectfunction mediated by the ipsilateralmotor cortex. Since motor cortexcontrols the movements of thecontralateral body...."}, {"url": "http://pediatricneuro.com/alfonso/pg103.htm", "passage_text": "The neurons of the upper motor neuron system are located in the cerebral cortex (Figure 103.1[1]), basal ganglia (Figure 103.1[2]), cerebellar nuclei (Figure 103.1[3]), red nuclei (Figure 103.1[4), reticular formation (Figure 103.1[5]), and the lateral vestibular nucleus (Figure 103.1[6]). These axons travel through the brain and brainstem to make contact with the motor neurons in the brainstem and through the brain, brainstem, and spinal cord (Figure 103.1[4]) to make contact with the motor neurons in the anterior horn of the spinal cord."}, {"url": "https://en.wikipedia.org/wiki/Basal_ganglia_system", "passage_text": "The substantia nigra is the source of the striatal input of the neurotransmitter dopamine, which plays an important role in basal ganglia function. The subthalamic nucleus receives input mainly from the striatum and cerebral cortex, and projects to the globus pallidus. Currently, popular theories implicate the basal ganglia primarily in action selection; that is, it helps determine the decision of which of several possible behaviors to execute at any given time. The largest component, the striatum (dorsal and ventral), receives input from many brain areas beyond the basal ganglia, but only sends output to other components of the basal ganglia. The pallidum receives input from the striatum, and sends inhibitory output to a number of motor-related areas."}, {"url": "https://en.wikipedia.org/wiki/Basal_ganglia_system", "passage_text": "The main components of the basal ganglia – as defined functionally – are the dorsal striatum (caudate nucleus and putamen), ventral striatum (nucleus accumbens and olfactory tubercle), globus pallidus, ventral pallidum, substantia nigra, and subthalamic nucleus. The largest component, the striatum (dorsal and ventral), receives input from many brain areas beyond the basal ganglia, but only sends output to other components of the basal ganglia. The pallidum receives input from the striatum, and sends inhibitory output to a number of motor-related areas."}, {"url": "http://neuroscience.uth.tmc.edu/s3/chapter06.html", "passage_text": "Damage to alpha motor neurons results in a characteristic set of symptoms called the lower motor neuron syndrome (lower motor neurons refer to alpha motor neurons in the spinal cord and brain stem; all motor system neurons higher in the hierarchy are referred to as upper motor neurons). Also unlike basal ganglia (and motor cortex), damage to the cerebellum causes impairments on the ipsilateral side of the body. 1  Ataxia is a general term used to describe the general impairments in movement coordination and accuracy that accompany cerebellar damage."}, {"url": "http://neuroscience.uth.tmc.edu/s3/chapter04.html", "passage_text": "It is now known that the basal ganglia do not originate a separate motor pathway. Instead, they influence and modulate the activity of motor cortex and the descending motor pathways in ways that cause distinct symptoms when different basal ganglia structures are damaged. Basal ganglia dysfunction causes a set of symptoms that are quite different from damage to descending motor pathways, and thus the basal ganglia were at one time considered to form an “extrapyramidal motor system” that was distinct from the pyramidal tract pathways."}, {"url": "http://pediatricneuro.com/alfonso/pg103.htm", "passage_text": "The term refers to all the neurons in the brain (Figure 103.1[1]), cerebellum (Figure 103.1[2]), and brainstem (Figure 103.1[3]) that directly or indirectly convey information to the motor neurons in the brainstem and in the anterior horns of the spinal cord (lower motor neurons). These axons travel through the brain and brainstem to make contact with the motor neurons in the brainstem and through the brain, brainstem, and spinal cord (Figure 103.1[4]) to make contact with the motor neurons in the anterior horn of the spinal cord."}, {"url": "https://en.wikipedia.org/wiki/Basal_ganglia_system", "passage_text": "The basal ganglia (or basal nuclei) comprise multiple subcortical nuclei, of varied origin, in the brains of vertebrates, which are situated at the base of the forebrain. Basal ganglia nuclei are strongly interconnected with the cerebral cortex, thalamus, and brainstem, as well as several other brain areas. The largest component, the striatum (dorsal and ventral), receives input from many brain areas beyond the basal ganglia, but only sends output to other components of the basal ganglia. The pallidum receives input from the striatum, and sends inhibitory output to a number of motor-related areas."}, {"url": "http://www.neuroanatomy.wisc.edu/coursebook/motor2.pdf", "passage_text": "The term “basal ganglia” usually includes the caudate,putamen, globus pallidus, and amygdala. We use the term more loosely to refer to a group of nucleithat are anatomically interconnected and have important motor functions. These are the caudate,putamen, globus pallidus, substantia nigra, and subthalamic nuclei. There are no descending pathways that go from the basal ganglia directly to the spinal cord. ALL OF THIS CIRCUITRY IS ONTHE SAME SIDE OF THE BRAIN—UNCROSSED .Thus, the basal ganglia affectfunction mediated by the ipsilateralmotor cortex. Since motor cortexcontrols the movements of thecontralateral body...."}]