[{"url": "http://money.federaltimes.com/tag/minimum-retirement-age/", "passage_text": "Q. I am under FERS and my minimum retirement age is 56. I plan to take regular retirement at age 58 with 34 years of service. I would like to take level monthly payments, rather than a Thrift Savings Plan annuity, as my TSP withdrawal choice starting immediately upon retirement."}, {"url": "https://www.nasi.org/learn/socialsecurity/retirement-age", "passage_text": "Social Security's full-benefit retirement age is increasing gradually because of legislation passed by Congress in 1983. Traditionally, the full benefit age was 65, and early retirement benefits were first available at age 62, with a permanent reduction to 80 percent of the full benefit amount."}, {"url": "http://www.drs.wa.gov/publications/member/multisystem/p23earlyretirement.htm", "passage_text": "In some cases, you can retire at age 62 with a monthly benefit that isn't reduced (see the Early retirement factors chart). Retirement before age 65 is considered an early retirement. 1  Plan 2 members: You can retire as early as age 55 with a reduced benefit if you have at least 20 service credit years. 2  Plan 3 members: You can retire as early as age 55 with a reduced benefit if you have at least 1"}, {"url": "http://ssa.gov/planners/retire/1943.html", "passage_text": "Your full retirement age is 66. Remember, the earliest a person can start receiving Social Security retirement benefits will remain age 62. If you start receiving retirement benefits at. 1  age 62, you will get 75% of the monthly benefit because you will be getting benefits for an additional 48 months."}, {"url": "http://www.fedsmith.com/2014/05/28/your-minimum-retirement-age-and-how-it-will-impact-your-federal-employee-annuity/", "passage_text": "Under the Federal Employee Retirement System (FERS), there is an option where federal employees can retire at their minimum retirement age (MRA) with as little as 10 years of service."}, {"url": "http://www.myfederalretirement.com/public/171.cfm", "passage_text": "The FERS MRA (Minimum Retirement Age) is the earliest age in which you can retire without an age reduction penalty if you have at least 30 years of service."}, {"url": "http://www.opm.gov/retirement-services/fers-information/eligibility", "passage_text": "MRA. 30. MRA. 10. If you retire at the MRA with at least 10, but less than 30 years of service, your benefit will be reduced by 5 percent a year for each year you are under 62, unless you have 20 years of service and your benefit starts when you reach age 60 or later."}, {"url": "http://www.federalretirement.net/fers_eligibility.htm", "passage_text": "FERS retirement eligibility is based on your years of service and minimum retirement age (MRA). FERS retirement plans provide benefits from a combination of the Basic Benefit Plan, Social Security and the Thrift Savings Plan (TSP)."}]