[{"url": "http://chemocare.com/chemotherapy/drug-info/Revlimid.aspx", "passage_text": "Drug Type: Revlimid is classified as an immunomodulatory agent, and an antiangiogenic agent (For more detail, see How Revlimid Works section below.). A rare, but serious side effect of Revlimid is blood clots, including deep vein thrombosis (DVT) and pulmonary embolus (PE). You should seek emergency help and notify your health care provider immediately if you develop sudden chest pain and shortness of breath."}, {"url": "https://en.wikipedia.org/wiki/Lenalidomide", "passage_text": "Multiple myeloma is a cancer of the blood, characterized by accumulation of a plasma cell clone in the bone marrow. Lenalidomide is one of the novel drug agents used to treat multiple myeloma. Lenalidomide /lɛnəˈlɪdɵmaɪd/ (trade name Revlimid) is a derivative of thalidomide introduced in 2004. It was initially intended as a treatment for multiple myeloma, for which thalidomide is an accepted therapeutic treatment"}, {"url": "http://cancer.emedtv.com/revlimid/revlimid-uses.html", "passage_text": "Revlimid ® (lenalidomide) is a prescription medication that belongs to a group of medications known as immunomodulators. It is approved to treat people who have certain bone marrow diseases, specifically multiple myeloma and myelodysplastic syndrome. (Click Symptoms of Multiple Myeloma for more information on possible symptoms of this condition.). Revlimid is used in combination with dexamethasone to treat multiple myeloma in people who have already received at least one other treatment."}, {"url": "http://www.goodrx.com/revlimid/what-is", "passage_text": "Revlimid. LENALIDOMIDE is a chemotherapy drug that targets specific proteins within cancer cells and stops the cancer cell from growing. It is used to treat multiple myeloma, mantle cell lymphoma, and some myelodysplastic syndromes that cause severe anemia requiring blood transfusions. Although these uses are not included in product labeling, lenalidomide is used in certain patients with the following medical condition: 1  Multiple myeloma, first-line treatment, in combination with dexamethasone (treatment of bone marrow cancer; used together with dexamethasone)."}, {"url": "http://www.revlimid.com/mm-patient/about-revlimid/", "passage_text": "REVLIMID is an immunomodulatory therapy with anti-cancer effects. Dexamethasone is a man-made steroid with anti-inflammatory effects. Together, REVLIMID and dexamethasone work to fight multiple myeloma. REVLIMID ® (lenalidomide) is used with dexamethasone to treat patients with multiple myeloma (MM). REVLIMID should not be used to treat people who have chronic lymphocytic leukemia (CLL) unless they are participants in a controlled clinical trial. "}, {"url": "http://www.macmillan.org.uk/cancerinformation/cancertreatment/treatmenttypes/biologicaltherapies/angiogenesisinhibitors/lenalidomide.aspx", "passage_text": "Lenalidomide is used to treat people with myeloma | and myelodysplastic syndromes | (MDS). It may be used to treat other cancers in clinical trials | . Lenalidomide (Revlimid ®) is used to treat people with myeloma | . This is a type of cancer that affects the plasma cells inside bone marrow."}, {"url": "http://answers.webmd.com/answers/1168759/what-is-revlimid-and-what-is", "passage_text": "Revlimid is also used with dexamethasone to treat patients with multiple myeloma who have already had another treatment. Multiple myeloma is a cancer of plasma cells. Plasma cells are found in the bone marrow. Plasma cells produce a protein called antibodies. A. Revlimid is a medicine taken by mouth to treat certain patients who have myelodysplastic syndromes (MDS). Patients with MDS have bone marrow that does not produce enough mature blood cells. This causes a lack of healthy blood cells that can function properly in the body. There are different types of MDS"}, {"url": "http://www.cancercenter.com/cancer-drugs/lenalidomide/", "passage_text": "Lenalidomide. Brand Name: Revlimid ®. Lenalidomide is used to treat myelodysplastic syndrome and multiple myeloma. Lenalidomide belongs to a class of drugs known as immunomodulatory agents. It works by helping the bone marrow produce normal, healthy blood cells and by killing abnormal blood cells inside the bone marrow."}]