[{"url": "http://taxation.lawyers.com/income-tax/business-use-of-your-home-tax-deduction.html", "passage_text": "You can’t take the deduction because the business use of your home isn’t for the school’s convenience – it doesn’t require you to work from home. Also, there’s no difference between a house and an apartment. So, you may be able to deduct a portion of the expenses of your apartment used for work purposes. For example, your gross income from the business use of your home is $6,000. The deductible mortgage interest and real estate taxes total $3,000. Your direct business expenses are $2,000."}, {"url": "https://www.irs.gov/taxtopics/tc509.html", "passage_text": "Deductible expenses for business use of your home include the business portion of real estate taxes, mortgage interest, rent, casualty losses, utilities, insurance, depreciation, maintenance, and repairs. You may not deduct expenses for lawn care in general or for painting a room not used for business. Whether you are self-employed or are an employee, you may be able to deduct certain expenses for the part of your home you use for business. To deduct expenses for business use of the home, you must use part of your home as one of the following:"}, {"url": "http://taxation.lawyers.com/income-tax/business-use-of-your-home-tax-deduction.html", "passage_text": "To qualify for the deduction, part of your home must be: 1  The principal place of business for your trade or business. 2  The place where you meet and deal with your patients, clients or customers. 3  Used in connection with your trade or business if you use a separate structure unattached to your home, like a garage. For example, your gross income from the business use of your home is $6,000. The deductible mortgage interest and real estate taxes total $3,000. Your direct business expenses are $2,000."}, {"url": "http://www.irsvideos.gov/SmallBusinessTaxpayer/BusinessExpenses/HomeOfficeDeductionWhatsAllowable", "passage_text": "However, if you use a portion of your home for business, you may be able to take a home-office deduction if you meet certain requirements. Deductible expenses might include the business portion of real estate taxes, mortgage interest, rent, utility, insurance, depreciation, painting, and repairs. Also, if you work as someone's employee, you can claim this deduction only if the regular and exclusive business use of the home is for your employer's convenience, not yours, and your employer does not rent the business portion of your home."}, {"url": "https://www.irs.gov/taxtopics/tc509.html", "passage_text": "If you are in the farming business or are an employee, use the worksheet in Publication 587 to figure your deduction. As an employee, you must itemize deductions on Form 1040, Schedule A (PDF) to claim expenses for the business use of your home. Farmers claim their expenses on Form 1040, Schedule F (PDF), Profit or Loss From Farming. Whether you are self-employed or are an employee, you may be able to deduct certain expenses for the part of your home you use for business. To deduct expenses for business use of the home, you must use part of your home as one of the following:"}, {"url": "http://taxation.lawyers.com/income-tax/business-use-of-your-home-tax-deduction.html", "passage_text": "“Home Office” Deduction. The tax deduction for the business use of your home is often called the home office deduction. There are different requirements for self-employed workers and those who work for others. For example, your gross income from the business use of your home is $6,000. The deductible mortgage interest and real estate taxes total $3,000. Your direct business expenses are $2,000."}, {"url": "http://www.irsvideos.gov/SmallBusinessTaxpayer/virtualworkshop/Lesson4", "passage_text": "If you qualify to claim business use of your home expenses, you can use the business part of these expenses to calculate your business use of the home deduction. These expenses are real estate taxes, deductible mortgage interest, qualified mortgage insurance premiums, and casualty losses. To qualify to deduct expenses related to the business use of part of your home, you must meet specific requirements. Even then, the deduction may be limited. To qualify to claim expenses for the business use of your home, you must meet the following test."}, {"url": "http://www.taxmap.ntis.gov/taxmap/pubs/p587-007.htm", "passage_text": "If you deducted actual expenses for business use of your home on your 2013 tax return, enter on line 28 the amount from line 41 of your 2013 worksheet. If you used the simplified method in 2013, enter on line 28 the amount from line 6b of your 2013 Simplified Method Worksheet. Use this worksheet if you file Schedule F (Form 1040) or you are an employee or a partner, and you are using actual expenses to figure your deduction for business use of the home. Use a separate worksheet for each qualified business use of your home."}, {"url": "http://www.taxmap.ntis.gov/taxmap/pubs/p587-008.htm", "passage_text": "If you are filing Schedule C (Form 1040) to report a business use of your home in your trade or business and you are using the simplified method to figure the deduction, use the Simplified Method Worksheet and Daycare Facility Worksheet in your Instructions for Schedule C for that business use. Since you are using the simplified method this year, you cannot deduct the amounts you entered on lines 6a and 6b this year. If you figure your deduction for business use of the home using actual expenses next year, you will be able to include these expenses when you figure your deduction."}, {"url": "http://www.taxmap.ntis.gov/taxmap/pubs/p587-007.htm", "passage_text": "If you deducted actual expenses for the business use of your home on your 2013 tax return, enter on line 22 the amount from line 40 of your 2013 worksheet. If you used the simplified method in 2013, enter on line 22 the amount from line 6a of your 2013 Simplified Method Worksheet. Use this worksheet if you file Schedule F (Form 1040) or you are an employee or a partner, and you are using actual expenses to figure your deduction for business use of the home. Use a separate worksheet for each qualified business use of your home."}]