[{"url": "http://www.indeed.com/salary/q-Office-Manager-l-Texas.html", "passage_text": "Average Office Manager salaries for job postings in Texas are 3% lower than average Office Manager salaries for job postings nationwide. "}, {"url": "http://learn.org/articles/What_is_the_Average_Salary_of_an_Office_Management_Professional.html", "passage_text": "PayScale.com reported that most office managers in the 10th-90th percentile range made a salary of $28,681-$61,091 as of February 2014. To gain a job as an office manager or supervisor, the U.S. Bureau of Labor Statistics (BLS) recommends that you earn your associate's or bachelor's degree (www.bls.gov). If you pursue a bachelor's or graduate degree, you might earn a higher average salary as an administrative services manager. You might work as an office manager, an administrative services manager or an executive secretary at a government agency, private corporation or school. If you're looking to become an office management professional, you can learn about the average salaries that you can expect to make in the field."}, {"url": "http://www1.salary.com/TX/Austin/Office-Manager-salary.html", "passage_text": "This chart describes the expected percentage of people who perform the job of Office Manager in Austin, TX that make less than that salary. For example 50% of the people who perform the job of Office Manager in Austin are expected to make less than the median. Source: HR Reported data as of October 2015. Job Description for Office Manager. Supervises office activities to achieve maximum expense control and productivity. Develops procedures and policies for office activities, such as filing, dictating, records maintenance, typing, word processing, faxing and mail distribution."}, {"url": "http://www.simplyhired.com/salaries-k-office-manager-l-dallas-tx-jobs.html", "passage_text": "Average Office Manager Salaries. The average salary for office manager jobs in Dallas, TX is $59,000. Average office manager salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term office manager anywhere in the job listing. This free salary calculator uses salary data from millions of job listings indexed by Simply Hired's job search engine. The office manager salary comparisons feature allows job seekers to get the information required to make important career decisions and negotiate salary ranges."}, {"url": "http://www.indeed.com/salary/q-Office-Manager-l-Austin,-TX.html", "passage_text": "$48,000. Average Office Manager salaries for job postings in Austin, TX are 6% lower than average Office Manager salaries for job postings nationwide."}, {"url": "http://work.chron.com/average-salary-administrative-assistant-office-manager-lubbock-texas-25075.html", "passage_text": "Supervisors of Secretaries and Administrative Assistants. First-line supervisors of secretaries and administrative assistants reported an average salary of $52,830 per year to the BLS in 2012. The average pay for office supervisors in Texas was comparable, at $52,740 per year. However, first-line supervisors of office staff and secretaries working in the Lubbock metropolitan area earned significantly less in 2012, with an average annual salary of $44,550. According to the U.S. Bureau of Labor Statistics, general secretaries and administrative assistants working in the United States earned an average salary of $33,560 per year as of 2012. The average salary for general administrative assistants in the state of Texas was somewhat lower at $31,020 per year."}, {"url": "http://work.chron.com/average-salary-administrative-assistant-office-manager-lubbock-texas-25075.html", "passage_text": "Office Managers. Administrative services managers, sometimes called office managers or business office managers, earned an average of $88,660 per year as of 2012. Administrative services managers employed in Texas earned slightly above the national average in 2012, with a mean salary of $89,920 per year. According to the U.S. Bureau of Labor Statistics, general secretaries and administrative assistants working in the United States earned an average salary of $33,560 per year as of 2012. The average salary for general administrative assistants in the state of Texas was somewhat lower at $31,020 per year."}, {"url": "http://learn.org/articles/What_is_the_Average_Salary_of_an_Office_Management_Professional.html", "passage_text": "As an office management professional, you might work in a variety of industries, which can further impact your average salary. According to PayScale.com, most office managers at non-profit organizations earned $18.58 per hour as of February 2014. You might work as an office manager, an administrative services manager or an executive secretary at a government agency, private corporation or school. If you're looking to become an office management professional, you can learn about the average salaries that you can expect to make in the field."}]