[{"url": "https://answers.yahoo.com/question/index?qid=20080127113952AA6kwjq", "passage_text": "The average age is 5 and 6 when they are in kindergarten. Some kids who are developmentally ready can read when they are 4. If you are truly interested in teaching your child to read I suggest that you do a lot of reading on the stages that children go through when first learning to read. kind · 8 years ago."}, {"url": "https://answers.yahoo.com/question/index?qid=20080127113952AA6kwjq", "passage_text": "Some kids who are developmentally ready can read when they are 4. If you are truly interested in teaching your child to read I suggest that you do a lot of reading on the stages that children go through when first learning to read."}, {"url": "http://athome.readinghorizons.com/blog/at-what-age-should-your-child-be-able-to-read", "passage_text": "According to the U.S. Department of Education, here are the language milestones your child should reach at each age: CHILDREN AGES 0-3: 1  Imitate some of the sounds and rhythms adults use when they speak. 2  Begin to associate frequent words with their meanings. 3  Recognize some books by their covers."}, {"url": "http://www.readingrockets.org/article/how-most-children-learn-read", "passage_text": "Between the ages of four and nine, your child will have to master some 100 phonics rules, learn to recognize 3,000 words with just a glance, and develop a comfortable reading speed approaching 100 words a minute."}, {"url": "https://answers.yahoo.com/question/index?qid=20080127113952AA6kwjq", "passage_text": "Hey, For a simple, step-by-step program that can help your child learn to read visit this site: http://readingprogram.toptips.org Learning to read at a young age is important for the development of the child."}, {"url": "http://bens-abc.com/learning-timeline.htm", "passage_text": "From this age, schools aim to teach children to read within 3 years so that children should have a solid reading base by the age of nine. However, it is possible for children to learn to read much earlier than this."}, {"url": "http://www.webmd.com/parenting/features/when-should-kids-learn-read-write-math", "passage_text": "Ages 6-10: learning to read. Kids learn to: 1  read simple books by mid-first grade and know about 100 common words. 2  understand that letters represent sounds, which form words, by mid-first grade. 3  enjoy a variety of types of stories and talk about characters, settings and events."}, {"url": "http://www.webmd.com/parenting/features/when-should-kids-learn-read-write-math", "passage_text": "When kids learn reading: Milestones that matter. Pat Wolfe, EdD, education consultant, former teacher, and author of Building the Reading Brain, says you can tell by kindergarten-age whether children are likely to have trouble with reading."}]