[{"url": "http://www.businessdictionary.com/definition/culture.html", "passage_text": "Culture determines what is acceptable or unacceptable, important or unimportant, right or wrong, workable or unworkable. It encompasses all learned and shared, explicit or tacit, assumptions, beliefs, knowledge, norms, and values, as well as attitudes, behavior, dress, and language. See also organizational culture."}, {"url": "http://smallbusiness.chron.com/determines-workplace-culture-15591.html", "passage_text": "The culture of a small business reflects the organization's values, beliefs and policies, setting the tone for how the business interacts with employees, customers and business partners."}, {"url": "http://www.livescience.com/21478-what-is-culture-definition-of-culture.html", "passage_text": "Culture is the characteristics and knowledge of a particular group of people, defined by everything from language, religion, cuisine, social habits, music and arts."}, {"url": "http://www.studymode.com/essays/What-Determines-Culture-Discuss-And-Use-564130.html", "passage_text": "Discuss and use examples. Culture is the way of thinking and doing things that are passed on from one generation to another such as language, norms and values of society. It is the total pattern of human behavior which creates human beings and human societies."}, {"url": "http://www.studymode.com/essays/What-Determines-Culture-Discuss-And-Use-564130.html", "passage_text": "Culture is cumulative, by slow accumulation over many generations; culture is the product of human societies and of the individuals who compose them. Culture holds society together. It is the way of life that people in a society follow, which includes capabilities acquired by a human being as a member of society."}, {"url": "http://smallbusiness.chron.com/determines-workplace-culture-15591.html", "passage_text": "Beyond the written policies of the business, management has a hand in developing a workplace culture. The actions of management and the way they handle various aspects of the business, such as employee development and discipline, have an affect on"}, {"url": "http://www.tamu.edu/faculty/choudhury/culture.html", "passage_text": "1 The position that the ideas, meanings, beliefs and values people learn as members of society determines human nature. 2  People are what they learn. 3  Optimistic version of cultural determinism place no limits on the abilities of human beings to do or to be whatever they want."}, {"url": "http://smallbusiness.chron.com/determines-workplace-culture-15591.html", "passage_text": "Policies. A small business's policies can affect the culture of the workplace. While policies seek to lay out the expectations for employee productivity and adherence to policies related to employee safety, policies also should set the standard for expectations related to company missions and goals."}, {"url": "http://www.cultureindevelopment.nl/Cultural_Heritage/What_is_Cultural_Heritage", "passage_text": "Cultural Heritage is an expression of the ways of living developed by a community and passed on from generation to generation, including customs, practices, places, objects, artistic expressions and values. Cultural Heritage is often expressed as either Intangible or Tangible Cultural Heritage (ICOMOS, 2002)."}]