[{"url": "http://www.sparkpeople.com/ma/What-are-good-sources-of-protein,-other-than-meat/7/1/26618953", "passage_text": "I only occasionally eat meat. Mostly I eat fish, skim plain yogurt, eggs, lentils, beans, garbanzos, nuts, brown rice and whole wheat bread/spaghetti. The last two are not really rich in proteins, but they are good sources of carbohydrates with some protein in them. All the rest is very rich with proteins. If you want also low calories in addition to high protein, fish and skim plain yogurt are the bes"}, {"url": "http://www.health.com/health/gallery/0,,20718479,00.html", "passage_text": "(They also take longer to digest than carbohydrates, helping you feel fuller for longer and on fewer caloriesa plus for anyone trying to lose weight.) You probably know that animal productsmeat, eggs and dairyare good sources of protein; unfortunately, they can also be high in saturated fat and cholesterol. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080125072143AAbhhy0", "passage_text": "Best Answer: Eggs, dried beans and peas, fish, nuts, cheese, tofu, peanut butter, milk, yogurt, etc. You will need to focus on getting complete protein, so you will need to eat some foods in combination with certain other foods. After all...with a true Vegan, Eggs, Meat and Dairy are taboo, and many if not most supplements use one of these three sources for their protein. Incidentally...many VACCINES are also sourced from one of these three sources as well"}, {"url": "http://greatist.com/health/unexpected-sources-protein", "passage_text": "Many of us have heard that meat and eggs are good sources of protein (and they are), but there are alternatives (including plenty of vegan options !) to these standbys for every meal and all the snacks in between. "}, {"url": "http://www.livestrong.com/article/25759-foods-protein-other-meat/", "passage_text": "Eggs, Cheese, and Milk. Eggs, cheese and milk are all protein-rich. In fact, like meat, they offer all of the essential amino acids necessary for human health, thus are complete protein foods. One whole egg, 1 cup of milk (skim, 2 percent, or whole), and 1 ounce of most varieties of cheese provide 8 grams of protein. Some nuts are an excellent source of protein. Almonds are particularly protein-rich, providing 6 grams per ounce. Other nuts that provide between 5 and 6 grams of protein per ounce include Brazil nuts, cashew nuts, hazelnuts and walnuts."}, {"url": "http://www.livestrong.com/article/25759-foods-protein-other-meat/", "passage_text": "Protein is found in nearly all foods, including meats, poultry, fish, dairy products, starches and grains, vegetables, soy foods, nuts, beans, and some whole grains. Meats, eggs, dairy products and soy are complete protein foods (contain all essential amino acids). Proteins in plant foods (except soy) is incomplete (contain some essential amino acids). There are many foods, other than meat, that are high in protein. Some nuts are an excellent source of protein. Almonds are particularly protein-rich, providing 6 grams per ounce. Other nuts that provide between 5 and 6 grams of protein per ounce include Brazil nuts, cashew nuts, hazelnuts and walnuts."}, {"url": "http://www.medicaldaily.com/meatless-protein-7-great-sources-protein-other-meat-300872", "passage_text": "4. Nuts. The best part about adding nuts to your diet as a healthy protein source is the amount of variety you have. Almonds, pistachios, walnuts, peanuts, and cashews are packed with all three macronutrients on top of essential micronutrients such as vitamin E, vitamin B6, magnesium, phosphorus, zinc, and potassium. The all-natural, high-quality protein found in eggs is often used as the benchmark for evaluating the protein quality of other foods. Although it is true that eggs are high in cholesterol, they are only high in HDL “good” cholesterol and do not have an unhealthy impact on our cholesterol levels."}, {"url": "http://www.webmd.com/fitness-exercise/guide/good-protein-sources", "passage_text": "Not only are dairy foods like milk, cheese, and yogurt excellent sources of protein, but they also contain valuable calcium, and many are fortified with vitamin D. Choose skim or low-fat dairy to keep bones and teeth strong and help prevent osteoporosis. Eggs are one of the least expensive forms of protein. Fifty grams of soy protein daily can help lower cholesterol by about 3%. Eating soy protein instead of sources of higher-fat protein -- and maintaining a healthy diet -- can be good for your heart. Lean beef has only one more gram of saturated fat than a skinless chicken breast."}]