[{"url": "http://www.west-crete.com/weather-crete-may.htm", "passage_text": "Weather in Crete in May. May signals the transition from spring into summer. Average temperatures are around 20°C, the sun shines on average 10 hours a day but nights remain cool. You might still get some rain (around 3 to 4 days during the month) but it's generally of a short duration. The sea temperature is around 19°C and most people find it just about warm enough to swim in. The spring flowers are still plentiful but the vegetation is starting to dry out a little at low altitude. The table below lists weather averages in May for 7 towns of Crete."}, {"url": "http://www.weather2travel.com/climate-guides/greece/crete/", "passage_text": "The Crete climate guide is perfect for planning your holiday. Monthly weather averages give the best indication of what the weather is usually like for every month of the year including figures for temperature, rainfall and sunshine. The Crete climate guide shown below is for Iraklion."}, {"url": "http://www.holiday-weather.com/crete/averages/", "passage_text": "Crete: Annual Weather Averages. July is the hottest month in Crete with an average temperature of 26°C (79°F) and the coldest is January at 11°C (52°F) with the most daily sunshine hours at 13 in July. The wettest month is December with an average of 89mm of rain. The best month to swim in the sea is in August when the average sea temperature is 25°C (77°F)."}, {"url": "http://www.currentresults.com/Weather/Greece/temperature-may.php", "passage_text": "Average Temperatures for Greece in May. Average temperatures for May at cities and islands throughout Greece are listed below in degrees Celsius and Fahrenheit. The tables give the maximum and minimum monthly temperatures based on weather data collected over several decades"}, {"url": "http://www.west-crete.com/weather-crete-january.htm", "passage_text": "Weather in Crete in January. January is the coldest, wettest month in Crete. It's not a good time to come to the island if you are looking for the sun but on the positive side, 15 days with rain also mean 16 days without rain and you still get an average of almost three and a half hours of sun per day. "}, {"url": "http://www.holiday-weather.com/crete/averages/may/", "passage_text": "Weather lowdown. While still technically spring, May is considered a summer month by locals and tourists who come to enjoy the fine weather already in full swing. Average daytime temperature rises up to an inviting 24 degrees Celsius with highs going a bit above that figure and lows rarely dropping below 15 degrees. Sea temperature rises too and in May you should expect average seawater temperatures of about 19 degrees. May sees the sun shine for 8 full hours each day. Rain is scarce as the signature summer drought comes about in Crete. "}, {"url": "http://w-weather.com/Greece/Crete/may/", "passage_text": "The highest day temperature in May 2015 was 91 °F. The lowest night temperature was 37 °F. The average values for day and night temperatures during May were 81.2 °F и 51.3 °F respectivly. Precipitation Totals in May, in. Precipitation total in May for Crete is 0.8 in. It makes may one of the least rainy months of the year. Wind Speed in May, mph. The average wind speed in May is 7.2 mph. It makes May the most windless month of the year for Crete. Average Sunny Hours Per Day. We are using day length and cloud cover information for each day of the month to calculate averages for this chart. Average sunny hours for Crete in May is 12.3 hours"}, {"url": "http://www.weather2travel.com/may/greece/crete/stalis.php", "passage_text": "Check the Weather in Stalis, Crete in May before you book your next holiday. This gives the best indication of the weather in May and includes figures for temperature, sunshine and rainfall. 1  21°C max day temperature. "}]