[{"url": "http://www.howmuchisit.org/sidewalk-repair-cost/", "passage_text": "1 The cost to have their services depends on how big the job is, but a safe average range is from $2,500 to $5,000. 2  Sidewalk repair may involve the use of materials such as concrete or brick, stone, and asphalt depending on the look that you want for the house. 1 They can charge differently depending on their location as well as the experience and knowledge that they offer. 2  On average, the cost to repair a sidewalk could be anywhere from $4 to as much as $10 per square foot."}, {"url": "http://home.costhelper.com/sidewalk-repair.html", "passage_text": "1 Hiring a contractor to pour a concrete sidewalk runs around $5-$9 a square foot, or $1,500-$2,250 for a sidewalk 5 feet wide and 50 feet long. 2  Depending on the type of finish used, costs can be as high as $10-$18 or more a square foot, or $2,500-$4,500 for a 5-by-50-foot sidewalk. Related articles: Fence, Patio, Deck. 1 "}, {"url": "http://home.costhelper.com/sidewalk-repair.html", "passage_text": "1 Depending on the type of finish used, costs can be as high as $10-$18 or more a square foot, or $2,500-$4,500 for a 5-by-50-foot sidewalk. 2  Materials and rental tools for a do-it-yourself project run about $3-$4 a square foot, or $750-$1,000 for a 5-by-50-foot sidewalk. Related articles: Fence, Patio, Deck. 1  Hiring a contractor to pour a concrete sidewalk runs around $5-$9 a square foot, or $1,500-$2,250 for a sidewalk 5 feet wide and 50 feet long."}, {"url": "http://home.costhelper.com/sidewalk-repair.html", "passage_text": "Typical costs: 1  Hiring a contractor to pour a concrete sidewalk runs around $5-$9 a square foot, or $1,500-$2,250 for a sidewalk 5 feet wide and 50 feet long. Related articles: Fence, Patio, Deck."}, {"url": "http://www.generalcode.com/codification/sample-legislation/sidewalk-repair-costs", "passage_text": "Costs for Sidewalk Repairs. Walking is one of the best forms of exercise, but it can be hazardous to one's health if sidewalks are in poor shape. Over the years, sidewalks require maintenance to keep them safe, but the costs can be prohibitive. "}, {"url": "http://www.howmuchisit.org/sidewalk-repair-cost/", "passage_text": "1 On average, the cost to repair a sidewalk could be anywhere from $4 to as much as $10 per square foot. 2  If a higher quality finish is used, the price can reach as high as $15 per square foot. 1 They can charge differently depending on their location as well as the experience and knowledge that they offer. 2 "}, {"url": "http://www.howmuchisit.org/sidewalk-repair-cost/", "passage_text": "1 The cost to repair the sidewalk according to the site ranges anywhere from $8 to $20 per foot for concrete pouring while panels that will be placed on the surface can cost $75 each. 1 They can charge differently depending on their location as well as the experience and knowledge that they offer. 2  On average, the cost to repair a sidewalk could be anywhere from $4 to as much as $10 per square foot."}, {"url": "http://homeguides.sfgate.com/cost-sidewalk-repair-102847.html", "passage_text": "The average cost per foot may be as low at $3 for small do-it-yourself projects but can be as high as $18 per square foot for contracted jobs requiring special materials or finishes. In San Francisco, for example, the standard bid price per square foot of sidewalk repairs was $10.40 in 2013. Cost Responsibility. The determination of cost responsibility for sidewalk repairs is determined by city ordinances. In some cities, the local Department of Public Works is responsible for sidewalk maintenance and repair. However, many cities defer at least part of the cost of sidewalk repair to the adjacent homeowner."}, {"url": "http://www.kudzu.com/article/How-much-does-it-cost-to-repair-a-sidewalk-id8488", "passage_text": "If they have to wheelbarrow the concrete over a long distance, contractors may charge more for labor. To repair a damaged section with just concrete and bonding, it will be about $6 to $8 per square foot cheaper than putting in a brand new sidewalk section. Brand new sections of sidewalk can cost between $90 to $175 each. Keep in mind that most major sidewalk repair jobs actually call for the removal of the pre-existing concrete and replacing it with newly poured materials. Find out the typical costs to repair a sidewalk, the amount of time it should take, materials needed, and more."}, {"url": "http://homeguides.sfgate.com/cost-sidewalk-repair-102847.html", "passage_text": "The cost of sidewalk repairs varies largely by location, materials use and extent of damage. Prices may be given per square foot or by total job cost. Cost Responsibility. The determination of cost responsibility for sidewalk repairs is determined by city ordinances. In some cities, the local Department of Public Works is responsible for sidewalk maintenance and repair. However, many cities defer at least part of the cost of sidewalk repair to the adjacent homeowner."}]