[{"url": "http://www.behindthename.com/name/anthony", "passage_text": "English form of the Roman family name Antonius, which is of unknown Etruscan origin. The most notable member of the Roman family was the general Marcus Antonius (called Mark Antony in English), who for a period in the 1st century BC ruled the Roman Empire jointly with Augustus. "}, {"url": "http://www.babynamewizard.com/baby-name/boy/antony", "passage_text": "Derived from the Latin Antonius, an old Roman family name of unknown etymology. “Priceless” and “of inestimable worth” are popular folk definitions of the name. Var: Anton, Antonio. Short: Toni, Tonio, Tony. From A World of Baby Names by Teresa Norman. "}, {"url": "http://www.sheknows.com/baby-names/name/anthony", "passage_text": "English Meaning: The name Anthony is an English baby name. In English the meaning of the name Anthony is: Highly praiseworthy. From a Roman clan name. In the 17th century, the spelling Anthony was associated with the Greek anthos meaning flower. Latin Meaning: The name Anthony is a Latin baby name. In Latin the meaning of the name Anthony is: Highly praiseworthy. Famous bearer: Mark Antony, Roman triumvir and general who shared a throne with Queen Cleopatra of Egypt"}, {"url": "http://www.ourbabynamer.com/meaning-of-Antony.html", "passage_text": "Antony is a form of the name Anthony. The name Anthony is derived from the old Roman clan or family name Antonius. Antonius is probably of Etruscan origin. Antony is a variant spelling of Anthony. Anthony is the English form of the old Roman family name Antonius. Antonius is probably of Etruscan origin. The name was origianlly spelled without an h, Antony. The letter h was inserted in the seventeenth century, under the mistaken belief that the name derived from the Greek word anthos meaning flower"}, {"url": "http://www.ohbabynames.com/meaning/name/antony/2170", "passage_text": "Etymology & Historical Origin-Antony. Antony is the original English form of the old Roman Family name “Antonius” from the gens “Antonia” (the “h” would be added in the 17th century). The Antonius clan name is of uncertain origin, probably originated from the ancient Etruscan civilization in Italy (near modern day Tuscany) whose language is now extinct. The family name was shared by both the patrician and plebian classes, and most famously borne by Mark Antony (Marcus Antonius, 83 B.C.-30 B.C.)"}, {"url": "http://www.sheknows.com/baby-names/name/antony", "passage_text": "English Meaning: The name Antony is an English baby name. In English the meaning of the name Antony is: Highly praiseworthy. From a Roman clan name. In the 17th century, the spelling Anthony was associated with the Greek anthos meaning flower. Italian Meaning: The name Antony is an Italian baby name. American Meaning: The name Antony is an American baby name. In American the meaning of the name Antony is: Priceless. Latin Meaning: The name Antony is a Latin baby name. In Latin the meaning of the name Antony is: Worthy of praise; of value. Saint Anthony is the patron sain of poor people. Famous Bearer: actor Anthony Hopkins"}, {"url": "http://www.thinkbabynames.com/meaning/1/Antony", "passage_text": "Antony /ant-ony/ [3 sylls.] as a name for boys is of Latin origin. Antony is a variant form of Anthony (Latin). "}, {"url": "http://meaning-of-names.com/english-names/anthony.asp", "passage_text": "In English, the name Anthony means-Highly praiseworthy. From a Roman clan name. In the 17th century, the spelling Anthony was associated with the Greek anthos meaning flower.. Other origins for the name Anthony include-English, Biblical, Basque.The name Anthony is most often used as a boy name or male name."}, {"url": "https://en.wikipedia.org/wiki/Anthony_(given_name)", "passage_text": "From Wikipedia, the free encyclopedia. Anthony or Antony is a masculine given name, derived from Antonius, a gens (Roman family name) to which Mark Antony (Marcus Antonius) belonged. That name seems to have come originally from the Etruscan language, although nothing further is known about this derivation. "}]