[{"url": "http://famouswonders.com/botswana-pula/", "passage_text": "In Botswana, people make use of the currency called Pula. Such currency is held dear by the country’s people."}, {"url": "http://www.knowbotswana.com/botswana-people.html", "passage_text": "BATSWANA-People of Botswana. Botswana people are called Batswana (singular-Motswana). Botswana's main ethnic groups are the Tswana, Kalanga, Batswapong, Babirwa, Basarwa or Bushmen, Bayei, Hambukushu, Basubia, Baherero and Bakgalagadi. The Tswana, who are the largest ethnic group have eight tribes or sub-groups who are Bamangwato, Bakwena, Bangwaketse, Batawana, Batlokwa, Bakgatla, Barolong and Balete."}, {"url": "http://www.everyculture.com/Bo-Co/Botswana.html", "passage_text": "Identification. Formerly Bechuanaland Protectorate under the British, Botswana became independent in 1966. Bot swana means place of Tswana in the dominant national language (Set swana), and the citizenry are called Bat swana, or Tswana people. The term Batswana, however, bears a double meaning."}, {"url": "http://www.botswanaembassy.or.jp/culture/index1.html", "passage_text": "The people of Tswana origin or citizens of the country, Botswana, are called Batswana. 'Motswana' refers to a citizen of Botswana or a person of Tswana ancestry. 'Setswana' refers to the national language of Botswana, also spoken by other people of Tswana descent in the neighbouring countries."}, {"url": "http://researchmaniacs.com/Demonyms/Countries/WhatDoYouCallPeopleFromBotswana.html", "passage_text": "In other words, what are people from Botswana called? A person from Botswana and/or a citizen of Botswana is called Batswana. You may also be interested in what people from Botswana speak? In other words, what language do people in"}, {"url": "http://researchmaniacs.com/Demonyms/Countries/WhatDoYouCallPeopleFromBotswana.html", "passage_text": "What do you call someone from Botswana? In other words, what are people from Botswana called? A person from Botswana and/or a citizen of Botswana is called Batswana. You may also be interested in what people from Botswana speak? In other words, what language do people in"}]