[{"url": "https://answers.yahoo.com/question/index?qid=20070625012220AA0IWbC", "passage_text": "Meiosis-the daughter cells contain half the number of chromosomes present in the parent cell. Meiosis generally takes place in the formation of gametes, though in some organisms it may occur in the formation of spores. And yeah, thanks for posting this question. Mitosis is the process in which a cell duplicates its chromosomes to generate TWO, identical cells. It is generally followed by cytokinesis which divides the cytoplasm and cell membrane."}, {"url": "http://highered.mheducation.com/sites/9834092339/student_view0/chapter11/comparison_of_meiosis_and_mitosis.html", "passage_text": "Both mitosis and meiosis are associated with cytokinesis. The end result of both are daughter cells produced from a parent cell. The fundamental sequence of events in mitosis is the same as in meiosis (in meiosis it happens twice). Both processes include the breakdown of the nuclear membrane, the separation of genetic material into two groups, followed by cell division and the reformation of the nuclear membrane in each cells. Meiosis has two rounds of genetic separation and cellular division while mitosis only has one of each. In meiosis homologous chromosomes separate leading to daughter cells that are not genetically identical."}, {"url": "http://www.differencebetween.com/difference-between-mitosis-and-meiosis/", "passage_text": "Mitosis. Mitosis helps to produce two daughter cells which are identical to the parent cell. For a haploid parent cell the daughter cells will be haploid. It forms diploid daughter cells in case of diploid parent cells. During mitosis, a cell duplicates its contents and form two identical daughter cells. Meiosis results in the formation of four haploid daughter cells via a two step process. Mitosis essentially produces new cells whereas meiosis produces gametes."}, {"url": "http://www.differencebetween.info/difference-between-mitosis-and-meiosis", "passage_text": "Cell division accounts for approximately 10% of the cell cycle. It is a process by which a parent cell divides into two or more daughter cells. There are three main types of cell division processes: binary fission, mitosis and meiosis. Binary fission takes place in prokaryotes, single-celled organisms that lack a cell nucleus."}, {"url": "http://www.differencebetween.info/difference-between-mitosis-and-meiosis", "passage_text": "Mitosis is the process through which a eukaryotic cell separates the chromosomes in its cell nucleus into two identical sets. These are called the daughter cells. Essentially, a cell (the mother cell) divides itself into two cells (the daughter cells), which are identical to the mother cell. It is a process by which a parent cell divides into two or more daughter cells. There are three main types of cell division processes: binary fission, mitosis and meiosis. Binary fission takes place in prokaryotes, single-celled organisms that lack a cell nucleus."}, {"url": "http://www.diffen.com/difference/Meiosis_vs_Mitosis", "passage_text": "In mitosis, the end product is two cells: the original parent cell and a new, genetically identical daughter cell. Meiosis is more complex and goes through additional phases to create four genetically different haploid cells which then have the potential to combine and form a new, genetically diverse diploid offspring. Meiosis is a more specific type of cell division (of germ cells, in particular) that results in gametes, either eggs or sperm, that contain half of the chromosomes found in a parent cell. Unlike mitosis with its many functions, meiosis has a narrow but significant purpose: assisting sexual reproduction."}, {"url": "http://www.diffen.com/difference/Meiosis_vs_Mitosis", "passage_text": "Cells divide and reproduce in two ways: mitosis and meiosis. Mitosis is a process of cell division that results in two genetically identical daughter cells developing from a single parent cell. Meiosis is a more specific type of cell division (of germ cells, in particular) that results in gametes, either eggs or sperm, that contain half of the chromosomes found in a parent cell. Unlike mitosis with its many functions, meiosis has a narrow but significant purpose: assisting sexual reproduction."}, {"url": "http://www.yourgenome.org/facts/mitosis-versus-meiosis", "passage_text": "Mitosis versus meiosis. Cells divide and reproduce in two ways, mitosis and meiosis. Mitosis results in two identical daughter cells, whereas meiosis results in four sex cells. Below we highlight the keys differences and similarities between the two types of cell division."}, {"url": "http://www.differencebetween.info/difference-between-mitosis-and-meiosis", "passage_text": "Mitosis is a process of asexual reproduction in which the cell divides in two producing a replica, with an equal number of chromosomes in haploid cell. Meiosis is a type of cellular reproduction in which the number of chromosomes are reduced by half through the separation of homologous chromosomes in a diploid cell. It is a process by which a parent cell divides into two or more daughter cells. There are three main types of cell division processes: binary fission, mitosis and meiosis. Binary fission takes place in prokaryotes, single-celled organisms that lack a cell nucleus."}, {"url": "http://www.sparknotes.com/biology/cellreproduction/intro/section2.rhtml", "passage_text": "There are two major differences between mitosis and meiosis. First, meiosis involves not one, but two cell divisions. Second, meiosis leads to the production of germ cells, which are cells that give rise to gametes. Germ cells are different from somatic cells in a critical way. Mitosis and meiosis are similar processes in that they both result in the separation of existing cells into new ones. They differ, however, in their specific processes as well as in their products. The reason for these differences lies in the difference in the class of cells that each process creates."}]