[{"url": "http://www.babycenter.com/0_how-much-youll-spend-on-childcare_1199776.bc", "passage_text": "The average cost of center-based daycare in the United States is $11,666 per year ($972 a month), but prices range from $3,582 to $18,773 a year ($300 to $1,564 monthly), according to the National Association of Child Care Resource & Referral Agencies (NACCRRA). Nanny care costs significantly less in, say, St. Louis than in Manhattan simply because the cost of living is lower there and so are wages. And daycare – whether in a center or in someone's home – could cost double or triple per month in a relatively expensive city compared to a cheaper area."}, {"url": "http://www.howmuchisit.org/how-much-does-day-care-cost/", "passage_text": "1 Generally speaking, the busier the area, the more expensive the daycare rates will be. 2  According to babycenter, day care costs can average anywhere between $250 and $1200 per month. 3  The average national monthly cost of child care is $611. 4  Larger chains such as Kindercare may cost more than a local daycare center. 1 Larger chains such as Kindercare may cost more than a local daycare center. 2  For example, a Kindercare may ask for $280 to $350 per week while a local no-name center could be near the $180 to $250 per week mark."}, {"url": "http://www.babycenter.com/0_home-daycare-how-much-does-it-cost_6041.bc", "passage_text": "Pinning down a nationwide average for home daycare costs is difficult – prices vary widely depending on where you live. Some providers charge very little, especially if they're close friends or neighbors of the families whose children they're caring for, but some may charge as much as daycare centers or more. Signs of a bad home daycare. When you're making the rounds--which you should start doing about six months before you need childcare--watch for our warning s... National Association for Family Child Care. Find a database of accredited childcare providers and information about safety in childcare places."}, {"url": "http://children.costhelper.com/child-day-care.html", "passage_text": "1 Large cities such as Boston and New York are most expensive, with average daycare costs of a little more than $1,000 a month. 2  Contacting two KinderCares in the San Jose area about infant day care, we received quotes of $300-$330 a week, plus annual fees. 1 Assuming full-time day care for a 2 year old child on weekdays, according to Runzheimer International, the U.S. national average cost for full-time day care is $611 a month. 2  Large cities such as Boston and New York are most expensive, with average daycare costs of a little more than $1,000 a month"}, {"url": "http://www.everydayfamily.com/home-daycare-costs/", "passage_text": "Family daycare is usually less expensive than daycare centers, preschools, and in-home childcare options like nannies and au pairs. Parents choosing to utilize family daycare can expect to pay on average $300 to $800 per month per child. According to the National Association of Child Care Resource and Referral Agencies (NACCRRA), there are slight differences in price with age. Full-time care for an infant family daycare can range from $3,900 to $9,630 per year, while the same care for a 4 year old fulltime may cost from $3,380 to $9,146. Your rates will increase if you enroll more than one child in family daycare. {Continued: Geographic Location }. Geographic Location"}, {"url": "http://www.babycenter.com/0_home-daycare-how-much-does-it-cost_6041.bc", "passage_text": "According to the National Association of Child Care Resource and Referral Agencies (NACCRRA), home daycare averages from around $330 to $920 a month for infants, toddlers, and preschoolers (less in rural areas, a lot more in big cities). Signs of a bad home daycare. When you're making the rounds--which you should start doing about six months before you need childcare--watch for our warning s... National Association for Family Child Care. Find a database of accredited childcare providers and information about safety in childcare places."}, {"url": "http://www.howmuchisit.org/how-much-does-day-care-cost/", "passage_text": "1 The cost of daycare can vary greatly from state to state and city to city. 2  Generally speaking, the busier the area, the more expensive the daycare rates will be. 3  According to babycenter, day care costs can average anywhere between $250 and $1200 per month. 4  The average national monthly cost of child care is $611. 1 Larger chains such as Kindercare may cost more than a local daycare center. 2  For example, a Kindercare may ask for $280 to $350 per week while a local no-name center could be near the $180 to $250 per week mark."}, {"url": "http://www.howmuchisit.org/day-care-insurance-cost/", "passage_text": "1 A family day care center is going to cost less than a group day care center. 2  According to CultureofSafety.com, the average small in-home day care will pay between $250 to $500 for business insurance. 3  However, larger commercial based centers could pay closer to $2,000 pear year. 1 The lowest amount of coverage, which is usually around $25,000, could cost as little as $200 to as much as $500 per year. 2  A family day care center is going to cost less than a group day care center. 3"}]