[{"url": "http://www.access2knowledge.org/jobs-education/much-dental-hygienists-make/", "passage_text": "According to the May 2012 records from the Bureau of Labor Statistics, the mean annual dental hygienist salary is $70,700, which is equivalent to a mean hourly wage of $33.99. The bottom ten percent in the occupation earns an annual salary of $46,540, while the top ten percent make an average $96,280 each year. Dental hygienists employed in dental offices earn an average $71,000, while those employed in physician offices make significantly less at a mean salary of $65,310. Within the United States, the highest paid dental hygienists are employed in California, where they earn an annual salary of $93,280"}, {"url": "https://en.wikipedia.org/wiki/Dental_nurse", "passage_text": "Registered dental nurses work as part of a dental team in a variety of clinical and non-clinical settings. The term registered dental nurse has a defined meaning within the United Kingdom. From 30 July 2008, all dental nurses in the UK must be registered with the GDC General Dental Council to continue working legally. "}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/dentalnurse.aspx", "passage_text": "Dental nurses starting out in the NHS can earn around £16,500 a year. Qualified dental nurses can earn between £19,000 and £22,000 a year. Private practice rates are broadly similar. Team leaders and dental nurse specialists can earn up to £28,000 a year. You can become a dental nurse by starting as a trainee with a dental practice and training on the job, or by taking a full-time college course in dental nursing."}, {"url": "http://work.chron.com/pays-more-dental-hygienists-registered-nurses-25394.html", "passage_text": "Dental Hygienist Basic Pay. The average annual salary for a dental hygienist was $70,700 as of May 2012, according to the Bureau of Labor Statistics. Top-end pay was much higher, though. The top 10 percent of earners made at or more than $96,280 per year. Average pay for RNs was within $3,000 of the hygienist average. The BLS indicated a mean annual salary of $67,930 for RNs as of May 2012. Top-end pay was even closer. The top 10 percent of RNs earned $94,720 or more. California was -- not surprisingly -- the highest-paying state for RNs, too, at $94,120."}, {"url": "http://work.chron.com/much-dental-hygienist-make-year-6792.html", "passage_text": "Pay by Employment Setting. About 95 percent of dental hygienists were employed in dentists' offices as of 2011, where they earned an average of $33.69 an hour and $70,070 a year in 2011. The few employed by outpatient care centers made an average of $69,220 a year, and those working in physician's offices made an average of $64,160 a year. Nearly 600 dental hygienists were employed directly by the federal government in 2011, reporting a relatively low average salary of $53,960 a year."}, {"url": "http://money.usnews.com/careers/best-jobs/dental-hygienist/salary", "passage_text": "$70,700. With an average salary of $71,530 in 2013, dental hygienists earn salaries that compare well to other health care jobs. However, dental assistants ($35,640) and clinical laboratory technicians ($40,240) generally make about half as much money. Registered nurses, who earned an average of $68,910 in 2013, made pay similar to dental hygienists. In 2013, their median salary was $71,110. The best-paid earned about $96,690, and the bottom 10 percent earned $47,880. Many of the top-paid hygienists work in dental offices, but ambulatory health care services also pay well."}, {"url": "http://work.chron.com/much-dental-hygienist-make-year-6792.html", "passage_text": "Regional Salary Differences. Dental hygienists in the western United States reported the highest average wages as of 2011. Those in California made the most, an average of $91,010 a year, followed closely by dental hygienists working in the District of Columbia, who earned an average yearly salary of $90,500. The few employed by outpatient care centers made an average of $69,220 a year, and those working in physician's offices made an average of $64,160 a year. Nearly 600 dental hygienists were employed directly by the federal government in 2011, reporting a relatively low average salary of $53,960 a year."}, {"url": "http://money.usnews.com/careers/best-jobs/dental-assistant", "passage_text": "Salary. The pay scale for dental assistants ranges from about $24,220 to $48,350. In 2013, the average pay for dental assistants was $35,640, and the median pay was $34,900. Those with the highest salaries live in the metropolitan areas of Manchester, New Hampshire; San Francisco; and Haverhill, Massachusetts"}]