[{"url": "https://en.wikipedia.org/wiki/Mantua", "passage_text": "; Emilian and Latin: Mantua) is a city and comune in Lombardy, Italy, and capital of the province of the same name. In 2007, Mantua's centro storico (old town) and Sabbioneta were declared by UNESCO to be a World Heritage Site. Mantua's historic power and influence under the Gonzaga family has made it one of the main artistic, cultural, and especially musical hubs of Northern Italy and the country as a whole. It is the nearest town to the birthplace of the Roman poet Virgil, who was commemorated by a statue at the lakeside park Piazza Virgilio. Mantua is surrounded on three sides by artificial lakes, created during the 12th century, as the city's defence system."}, {"url": "http://goitaly.about.com/od/lombardyandthelakes/ss/Lombardy-Cities-Map-and-Travel-Guide.htm", "passage_text": "Mantova. Mantova, or Mantua, is a beautiful, historic city surrounded on three sides by lakes. Mantova was one of the greatest Renaissance Courts in Europe and its Renaissance architecture makes it part of the UNESCO Quadrilateral, a district of historic cities in northeastern Italy with World Heritage status. Milan. Milan, Milano in Italian, is one of Italy's top cities to visit and also one of the most fashionable. Milan is a fast-paced city with a thriving cultural scene and is a great city for shopping."}, {"url": "https://www.summerinitaly.com/guide/mantova", "passage_text": "Mantova. Mantova is a lovely art city, lively cultural spot and musical center for northern Italy. It is surrounded on three sides by lakes formed by a tributary of the Po River, the Mincio. Mantova was originally settled by the Etruscans, before passing to the Gallic, but it was under the Romans that it flourished."}, {"url": "http://www.italymagazine.com/featured-story/ten-things-do-mantova", "passage_text": "Ten things to do in Mantova. Pat Eggleton | Tuesday, May 4, 2010 - 12:30. Words by Pat Eggleton. Mantova-or Mantua in Emilian dialect-in Lombardy is famous for its artistic and cultural heritage and, under the rule of the Gonzaga family, had one of the most important courts of the Renaissance. "}, {"url": "http://goitaly.about.com/od/moreitaliancities/p/montova.htm", "passage_text": "Mantua Introduction: Mantua, or Mantova, is a beautiful, historic city in northern Italy surrounded on three sides by lakes. It was one of the greatest Renaissance Courts in Europe and home of the wealthy Gonzaga family. The town's center is three spacious and lively squares that join together. In 2008 Mantova became a World Heritage Site based on its Renaissance planning and architecture and is part of the UNESCO Quadrilateral, a district of historic cities in northeastern Italy."}, {"url": "https://en.wikipedia.org/wiki/Mantua", "passage_text": "Mantova railway station, opened in 1873, lies on the train routes of Milan-Codogno-Cremona-Mantua and Verona-Mantua-Modena. The station is a terminus of three regional lines, Mantova to Cremona and Milan, Mantova to Monselice, and Mantova to Verona Porta Nuova and Modena. It is the nearest town to the birthplace of the Roman poet Virgil, who was commemorated by a statue at the lakeside park Piazza Virgilio. Mantua is surrounded on three sides by artificial lakes, created during the 12th century, as the city's defence system."}, {"url": "https://en.wikipedia.org/wiki/Province_of_Mantua", "passage_text": "The Province of Mantua (Italian: Provincia di Mantova) is a province in the Lombardy region of northern Italy. The Province of Mantua is in northern Italy and is part of the region of Lombardy. It is divided into eleven districts. It does not have a sea coast but is bounded by several rivers."}, {"url": "http://www.maplandia.com/italy/lombardia/mantova/mantova/", "passage_text": "Welcome to the Mantova google satellite map! This place is situated in Mantova, Lombardia, Italy, its geographical coordinates are 45° 9' 0 North, 10° 48' 0 East and its original name (with diacritics) is Mantova. See Mantova photos and images from satellite below, explore the aerial photographs of Mantova in Italy. Mantova hotels map is available on the target page linked above."}]