[{"url": "http://www.saps.org.uk/attachments/article/171/SAPS%20Student%20Project%20-%20catechol.doc", "passage_text": "Catechol is present in small quantities in the vacuoles of cells of many plant tissues. Catechol oxidase is present in the cell cytoplasm. If the plant tissues are damaged, the catechol is released and the enzyme converts the catechol to ortho-quinone, which is a natural antiseptic."}, {"url": "http://www.mystrica.com/Enzymes/catecholoxidase", "passage_text": "Methods. Catechol oxidase is the enzyme responsible for the browning of fruit. It is easy to prepare from a number of different sources – bananas are particularly good – and the reaction is readily followed using a colorimeter."}, {"url": "http://www.science-projects.com/Tyrosinase.htm", "passage_text": "In the presence of oxygen, catechol oxidase catalyzes the removal of electrons and hydrogens from catechol, a phenolic compound found in plant cells. Catechol is converted to benzoquinone, a pigment product. The hydrogens combine with oxygen, forming water (Fig."}, {"url": "http://www.mystrica.com/Pages/Enzymes/catecholoxidase.pdf", "passage_text": "Catechol oxidase Introduction Catechol oxidase is the enzyme responsible for the browning of fruit. It is easy to prepare from a number of different sources – bananas are particularly good – and the reaction is readily followed using a colorimeter."}, {"url": "http://www.csub.edu/~kszick_miranda/Lab09_Catechol%20Oxidase.docx", "passage_text": ", a phenolic compound found in plant cells. Catechol is converted to benzoquinone, a pigment product. The hydrogens combine with oxygen, forming water (Figue 2). The pigment products are responsible for the darkening of fruits and vegetables, such as apples and potatoes after exposure to air."}, {"url": "http://www.csub.edu/~kszick_miranda/Lab09_Catechol%20Oxidase.pdf", "passage_text": "3. Introduction This exercise will investigate the result of catechol oxidase activity. In the presence of oxygen, catechol oxidase catalyzes the removal of electrons and hydrogens from catechol, a phenolic compound found in plant cells. Catechol is converted to benzoquinone, a pigment product."}, {"url": "https://en.wikipedia.org/wiki/Catechol_oxidase", "passage_text": "Catechol oxidase carries out the oxidation of phenols such as catechol, using dioxygen (O 2). In the presence of catechol, benzoquinone is formed (see reaction below). Hydrogens removed from catechol combine with oxygen to form water."}, {"url": "http://www.umanitoba.ca/Biology/BIOL1020/lab2/biolab2_4.html", "passage_text": "The enzyme you will be using, catechol oxidase, is found in plant tissues. As its name implies, catechol oxidase oxidizes (removes hydrogen from) the substrate catechol, also found in plants, and converts it to benzoquinone, which is brown in colour."}]