[{"url": "http://www.webmd.com/multiple-sclerosis/guide/what-is-multiple-sclerosis", "passage_text": "A. A. A. Multiple sclerosis, or MS, is a long-lasting disease that can affect your brain, spinal cord, and the optic nerves in your eyes. It can cause problems with vision, balance, muscle control, and other basic body functions. The effects are often different for everyone who has the disease. "}, {"url": "http://www.healthline.com/health/multiple-sclerosis/early-signs", "passage_text": "A Close Look at MS Symptoms. Multiple sclerosis (MS) is a disease with unpredictable symptoms that can vary in intensity. While some people experience fatigue and numbness, severe cases of MS can cause paralysis, vision loss, and diminished brain function. MS affects an estimated 2.3 million people worldwide. "}, {"url": "http://medical-dictionary.thefreedictionary.com/sclerosis", "passage_text": "sclerosis. an induration or hardening, especially of a part from inflammation, or in disease of the interstitial substance. The term is used chiefly for such a hardening of the nervous system due to hyperplasia of the connective tissue or for hardening of the blood vessels. Called also induration. adj., adj sclerot´ic. tuberous sclerosis a congenital heredofamilial disease, transmitted as an autosomal dominant trait, characterized principally by the presence of hamartomas of the brain (tubers), retina (phakomas), and viscera, mental retardation, seizures, and adenoma sebaceum, and often associated with other skin lesions."}, {"url": "http://www.ninds.nih.gov/disorders/tuberous_sclerosis/detail_tuberous_sclerosis.htm", "passage_text": "Tuberous sclerosis--also called tuberous sclerosis complex (TSC) 1 --is a rare, multi-system genetic disease that causes benign tumors to grow in the brain and on other vital organs such as the kidneys, heart, eyes, lungs, and skin. "}, {"url": "http://www.ehow.com/facts_5508828_sclerosis.html", "passage_text": "Sclerosis is a condition that is characterized by either the hardening of tissue or the depositing of excess tissue. Several types of sclerosis may affect the body. Multiple sclerosis is a serious condition that occurs when the body's immune system attacks the sheath that covers the nerves. Over time the nerves can become severely damage, resulting in trouble with speaking and walking."}, {"url": "http://www.mayoclinic.org/diseases-conditions/multiple-sclerosis/home/ovc-20131882", "passage_text": "Multiple sclerosis (MS) is a potentially disabling disease of the brain and spinal cord (central nervous system). In MS, the immune system attacks the protective sheath (myelin) that covers nerve fibers and causes communication problems between your brain and the rest of your body. Multiple sclerosis. In multiple sclerosis, the protective coating on nerve fibers (myelin) is damaged and may eventually be destroyed. Depending on where the nerve damage occurs, MS can affect vision, sensation, coordination, movement, and bladder and bowel control."}, {"url": "http://www.healthline.com/health/multiple-sclerosis", "passage_text": "Multiple sclerosis (MS) is an autoimmune disease that affects the central nervous system. With multiple sclerosis, the brain has difficulty getting messages to the rest of the body. Though we know relatively little about multiple sclerosis, research into its causes and possible treatments is rapidly developing. "}, {"url": "http://www.medicinenet.com/multiple_sclerosis_ms/article.htm", "passage_text": "1 Multiple sclerosis (MS) is a disease that causes demyelination (disruption of the myelin that insulates and protects nerve cells) of spinal nerve and brain cells. 2  Although the exact case is unknown, multiple sclerosis is considered to be an autoimmune disease. "}, {"url": "http://www.answers.com/Q/What_is_sclerosis", "passage_text": "Sclerosis is the term used to describe where there has been wear & tear to a bone, and the body has attempted to make the bony area stronger by depositing new bone & calcium into the area. The area shows up as whiter that the rest of the bone in the area (because of the extra calcium)... "}, {"url": "https://en.wikipedia.org/wiki/Multiple_sclerosis", "passage_text": "Multiple sclerosis (MS), also known as disseminated sclerosis or encephalomyelitis disseminata, is a demyelinating disease in which the insulating covers of nerve cells in the brain and spinal cord are damaged. "}]