[{"url": "http://www.excite.com/education/criminal-justice/forensics/careers/how-to-become-a-forensic-scientist", "passage_text": "A: In order to become a forensic scientist, you will need an education in forensic sciences. If you are just looking for an entry level in the criminal justice sector, you can go for a 6 month certificate or diploma. A 4 year bachelor's degree can also get you entry-level positions with forensic departments. Individuals who have completed high school can enroll in an associate degree in forensic science or a bachelor degree in forensic science. Forensic science degree programs are designed to provide individuals with in-depth knowledge of the field and skills."}, {"url": "http://www.excite.com/education/criminal-justice/forensics/careers/how-to-become-a-forensic-scientist", "passage_text": "A: A forensic scientist needs to have a proper education in their respective field. You first need a bachelor's degree in forensic sciences or any other related science topic like psychology, medicine etc. after the completion of the degree it is recommended by most employers that you have a graduate degree as well. Individuals who have completed high school can enroll in an associate degree in forensic science or a bachelor degree in forensic science. Forensic science degree programs are designed to provide individuals with in-depth knowledge of the field and skills."}, {"url": "http://study.com/forensic_scientist.html", "passage_text": "Forensic Scientist Education Requirements. A minimum of a bachelor's degree in natural science or forensic science is required for working in this field. Some labs might require a master's degree in forensic science for more advanced positions, such as lab technician leader or supervisor. Learn about the education and preparation needed to become a forensic scientist. Get a quick view of the requirements-including degree programs, job duties and certification-to see if a career in forensic science is right for you."}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/forensicscientist.aspx", "passage_text": "£20,000 + per year. If you enjoy science and want to help solve crimes, this job could be perfect for you. This type of scientist prepares traces of physical evidence for use in courts of law. Before you can start as a trainee you are likely to need an honours degree in a biology or chemistry-related subject. "}, {"url": "http://work.chron.com/education-required-become-forensic-scientist-14661.html", "passage_text": "Specialists in forensic jurisprudence must have a law degree and belong to at least one state bar, according to American Academy of Forensic Sciences. Forensic dentists, whose specialty is called odontology, need a Doctor of Dental Science degree at a minimum. Entry-level forensic scientists usually have a bachelor's degree in forensic science or a related field, such as biology, chemistry or physics. A forensic science major typically includes those basic sciences, plus classes in pharmacology, statistics, computer modeling, biochemistry and criminal justice"}, {"url": "http://study.com/forensic_scientist.html", "passage_text": "Forensic science includes a diverse field of specialized professionals who work in criminal investigation. A minimum of a bachelor's degree is required to become a forensic scientist, although some specialties require graduate work. Forensic scientists often work closely with lawyers and law enforcement. Learn about the education and preparation needed to become a forensic scientist. Get a quick view of the requirements-including degree programs, job duties and certification-to see if a career in forensic science is right for you."}, {"url": "http://work.chron.com/education-required-become-forensic-scientist-14661.html", "passage_text": "Master's Degrees. Because a bachelor's degree in forensic science only prepares you for general work, most colleges with the major also offer graduate degrees. During a graduate program, you can choose a specialty, such ballistics, forensic engineering, toxicology or digital and multimedia sciences. Entry-level forensic scientists usually have a bachelor's degree in forensic science or a related field, such as biology, chemistry or physics. A forensic science major typically includes those basic sciences, plus classes in pharmacology, statistics, computer modeling, biochemistry and criminal justice"}, {"url": "http://www.excite.com/education/criminal-justice/forensics/careers/how-to-become-a-forensic-scientist", "passage_text": "A: In order to become a qualified Forensic Chemist, you need to gain education in the field of forensic science, involving a criminal justice element. The most basic degree that you need to acquire is the Bachelor of Science in Chemistry. Individuals who have completed high school can enroll in an associate degree in forensic science or a bachelor degree in forensic science. Forensic science degree programs are designed to provide individuals with in-depth knowledge of the field and skills."}]