[{"url": "http://home.costhelper.com/carpet-cleaning.html", "passage_text": "1 Sofa cleaning varies from $60-$196 and loveseats are $40-$140. 2  In-house area rug cleaning is charged by the square foot and varies with rug type. 3  Wool costs around $1-$1.50 per sq. ft., or $168-252 for a 12x14 foot rug, while synthetics average .75 cents per sq. ft., or $126 for a 12x14 foot. 1 Stain removal varies according to type and size of stain, but can run an additional .10 cents per square foot, or $30 for 300-square feet of cleaning space. 2  Deodorizing averages .05 cents per square foot, or $15 for 300-square feet of cleaning area. 3  Each carpet cleaning company has an individual furniture moving policy."}, {"url": "http://home.costhelper.com/carpet-cleaning.html", "passage_text": "1 In-house area rug cleaning is charged by the square foot and varies with rug type. 2  Wool costs around $1-$1.50 per sq. ft., or $168-252 for a 12x14 foot rug, while synthetics average .75 cents per sq. ft., or $126 for a 12x14 foot. 1 Stain removal varies according to type and size of stain, but can run an additional .10 cents per square foot, or $30 for 300-square feet of cleaning space. 2  Deodorizing averages .05 cents per square foot, or $15 for 300-square feet of cleaning area. 3  Each carpet cleaning company has an individual furniture moving policy."}, {"url": "http://columbuscarpetcleaners.net/pricing.htm", "passage_text": "Carpet Cleaning Prices – (Residential & Commercial). 1  Carpet cleaning prices are based on room size of 150 sq. ft. area. 2  Prices include pre-treating traffic areas to loosen heavy soil, stain removal, and deodorizing. Other carpet cleaning terms, conditions, disclaimers, and pricing information. • Prices are subject to change. One area equals any room up to 150 square feet; combined living areas may be considered as two rooms. • Areas exceeding 150 square feet will be priced as additional areas."}, {"url": "http://www.kudzu.com/article/How-much-could-I-pay-for-carpet-cleaning-id9968", "passage_text": "1 If you have more carpet than a typical home, you are likely to get a discount from the carpet cleaning service, since your home is a larger job. 2  In order for carpet cleaning companies to make a profit on homes with less than 1,000 square feet of carpet, they raise the price per square foot. 1 Typical costs (without any add-on services) will average about $100 - $500 per carpet cleaning. 2 "}, {"url": "http://home.costhelper.com/carpet-cleaning.html", "passage_text": "1 Furniture cleaning is also available through most carpet cleaners. 2  Sofa cleaning varies from $60-$196 and loveseats are $40-$140. 3  In-house area rug cleaning is charged by the square foot and varies with rug type. 1 Stain removal varies according to type and size of stain, but can run an additional .10 cents per square foot, or $30 for 300-square feet of cleaning space. 2  Deodorizing averages .05 cents per square foot, or $15 for 300-square feet of cleaning area. 3  Each carpet cleaning company has an individual furniture moving policy."}, {"url": "http://www.homeadvisor.com/cost/cleaning-services/clean-carpeting/", "passage_text": "Professional carpet cleaning costs vary depending on the size of the area, the cleaning method, the carpet type, and whether stain removal is required. For example, you can expect to pay more for a wool carpet than for berber. On average, homeowners report paying $174 and most spend between $120 and $236. Steam cleaner rentals cost anywhere from $35 to $50 per day, plus the cost of the cleaning solution. Most steam cleaner rental venues and manufacturers recommend using their own cleaning solution rather than a third party's brand."}, {"url": "http://columbuscarpetcleaners.net/pricing.htm", "passage_text": "1 Carpet cleaning prices are based on room size of 150 sq. ft. area. 2  Prices include pre-treating traffic areas to loosen heavy soil, stain removal, and deodorizing. 3  We most furniture and place it back in its original position. 4  Carpet protector available at .10 per sq. ft. or $15.00 per area. Other carpet cleaning terms, conditions, disclaimers, and pricing information. • Prices are subject to change. One area equals any room up to 150 square feet; combined living areas may be considered as two rooms. • Areas exceeding 150 square feet will be priced as additional areas."}, {"url": "http://www.carpetpriceguides.com/cleaning-costs/", "passage_text": "Cleaning Prices Per Room – You can get an approximate carpet cleaning cost estimate over the phone by getting a quote per room. Cleaning services will have set rates for a standard room which they will judge to be anywhere between 150 sq/ft (bedroom) and 250 sq/ft (dining room). Final prices may vary. Pet Stains and Odors – Stubborn stains and odors from pets are a common problem and not solved with standard cleaning. Specialized products are required and can be quite expensive, between $40 and $90 per room. Carpet on Stairs – Cleaning carpet on stairs incurs and extra charge, usually between $2 and $3 per step."}, {"url": "http://restorationmasterfinder.com/restoration/carpet-cleaning-costs-guide/", "passage_text": "Professional Carpet Cleaning Cost. Most homes have an average of between 800 and 1000 square feet of carpet and the cost of carpet cleaning per square foot can range from $0.30 to $0.40. This means that the carpet cleaning cost for the average home will be close to $350. "}]