[{"url": "http://www.crosswordgiant.com/crossword-clue/1370233/Very-fierce", "passage_text": "We have 1 possible answer for the clue Very fierce which appears 1 time in our database. "}, {"url": "http://crosswordtracker.com/", "passage_text": "Crossword Tracker solves most popular crossword puzzles every day and maps the relationships, allowing you to improve your puzzle solving skills. You can find the answer to a clue using the letters you already know and even see all the other clues we have seen that point to the same answer. Never again get stuck or finish not knowing if that word you never heard of was right. If you're working on a puzzle now, try out the search box in the top right. "}, {"url": "http://www.wordplays.com/crossword-clues/FIERCE", "passage_text": "FIERCE-Crossword Puzzle Clues. Search through millions of crossword puzzle answers to find crossword clues with the answer FIERCE. Type the crossword puzzle answer, not the clue, below. Optionally, type any part of the clue in the Contains box. Click on clues to find other crossword answers with the same clue or find answers for the FIERCE crossword clue."}, {"url": "http://www.wordplays.com/crossword-clues", "passage_text": "Crossword Puzzle Clues. Search through millions of crossword puzzle answers to find crossword clues with the same crossword answer. Type the crossword puzzle answer, not the clue, below. Optionally, type any part of the clue in the Contains box. Click on clues to find other crossword answers with the same clue."}, {"url": "http://www.oneacross.com/crosswords/", "passage_text": "Length or Pattern: How to Search: Enter a crossword puzzle clue and either the length of the answer or an answer pattern. For unknown letters in the word pattern, you can use a question mark or a period. Clue: Clue: Pattern: "}, {"url": "http://www.oneacross.com/", "passage_text": "How to Search: Enter a crossword puzzle clue and either the length of the answer or an answer pattern. For unknown letters in the word pattern, you can use a question mark. According to Will Shortz, editor of the New York Times crossword puzzle, perhaps as many as 50 million people do crosswords just in America. Whether this is your first puzzle ever or your fourth today, if you get stuck, OneAcross can help."}, {"url": "http://www.crosswordgiant.com/crossword-clue/1938285/One-not-as-fierce-as-seems", "passage_text": "Clue: One not as fierce as seems. We have 1 possible answer for the clue One not as fierce as seems which appears 1 time in our database."}, {"url": "http://englishforeveryone.org/PDFs/Intermediate%20Crossword%20Puzzle%20Fruit.pdf", "passage_text": "english for everyone.org Name________________ Date________________ Intermediate Crossword Puzzle-Fruit Directions: use the clues below to fill in the crossword puzzle with the correct words. Across: 1. There are many types of these: the Blue_________, Straw__________, Cran_________, and Rasp_________. 2. "}]