[{"url": "http://medical-dictionary.thefreedictionary.com/prostatectomy", "passage_text": "RADICAL PERINEAL PROSTATECTOMY. This procedure is just as curative as radical retropubic prostatectomy but is performed less often because it does not allow the surgeon to spare the nerves associated with erection or, because the incision is made above the rectum and below the scrotum, to remove lymph nodes."}, {"url": "http://medical-dictionary.thefreedictionary.com/prostatectomy", "passage_text": "RADICAL RETROPUBIC PROSTATECTOMY. This is a useful approach if the prostate is very large, or cancer is suspected. With the patient under general or spinal anesthesia or an epidural, a horizontal incision is made in the center of the lower abdomen. This procedure is just as curative as radical retropubic prostatectomy but is performed less often because it does not allow the surgeon to spare the nerves associated with erection or, because the incision is made above the rectum and below the scrotum, to remove lymph nodes."}, {"url": "http://urology.jhu.edu/newsletter/prostate_cancer52.php", "passage_text": "PSA is very sensitive in detecting any recurrence of cancer. That's because only prostate cells make PSA -- so if it goes up after a radical prostatectomy, it means prostate cells are still present somewhere. Until now, there has been no way to tell. In a landmark paper -- the largest, most complete study of the return of PSA after radical prostatectomy -- Hopkins doctors have developed guidelines to help patients and doctors know what to do if PSA comes back."}, {"url": "http://medical-dictionary.thefreedictionary.com/prostatectomy", "passage_text": "Definition. Prostatectomy refers to the surgical removal of part of the prostate gland (transurethral resection, a procedure performed to relieve urinary symptoms caused by benign enlargement), or all of the prostate (radical prostatectomy, the curative surgery most often used to treat prostate cancer). This procedure is just as curative as radical retropubic prostatectomy but is performed less often because it does not allow the surgeon to spare the nerves associated with erection or, because the incision is made above the rectum and below the scrotum, to remove lymph nodes."}, {"url": "http://www.cancerresearchuk.org/about-cancer/type/prostate-cancer/treatment/surgery/radical-prostatectomy", "passage_text": "Removing the prostate gland (radical prostatectomy). A radical prostatectomy means an operation to remove the whole prostate gland. It is a common operation for prostate cancer. The operation used to be called total prostatectomy. A specialist surgeon removes the prostate through a cut made in your abdomen or between the testicles and the back passage. Removing the prostate gland. Removing the prostate gland is called a radical prostatectomy. It is a common operation for treating prostate cancer. It used to be called total prostatectomy. This means using surgery to remove the whole prostate gland"}, {"url": "http://www.pcf.org/site/c.leJRIROrEpH/b.5838551/k.6D69/PSA_Rising_PostTreatment.htm", "passage_text": "For the majority of men, prostate cancer is treatable and curable and does not recur after local definitive therapy with surgery or radiation. However, this next section summarizes key points to consider when your PSA is rising after undergoing initial treatment. Some of these men can still be cured with radiation after surgery, or with other local therapies after radiation. However, some men develop a form of prostate cancer that, while not curable, remains TREATABLE for a very long time. Below is a list of questions to ask when your PSA is rising after"}, {"url": "http://medical-dictionary.thefreedictionary.com/prostatectomy", "passage_text": "Radical perineal prostatectomy is sometimes used when the cancer is limited to the prostate and there is no need to spare nerves or when the patient's health might be compromised by the longer procedure. The perineal operation is less invasive than retropubic prostatectomy. This procedure is just as curative as radical retropubic prostatectomy but is performed less often because it does not allow the surgeon to spare the nerves associated with erection or, because the incision is made above the rectum and below the scrotum, to remove lymph nodes."}, {"url": "http://www.cancer.org/cancer/prostatecancer/detailedguide/prostate-cancer-treating-p-s-a-levels-after-treatment", "passage_text": "Following PSA levels during and after treatment. A man’s prostate-specific antigen (PSA) blood level is often a good indicator of how effective treatment is or has been. Generally speaking, your PSA level should get very low after treatment. But PSA results aren’t always cut and dry, and sometimes doctors aren’t sure what they mean. "}]