[{"url": "http://www.wealthprofessional.com.au/news/australians-must-increase-concessional-contributions-even-after-super-guarantee-hits-12-143359.aspx", "passage_text": "“For example, those aged 50 with the average super balance of that age group of $152,000 will only have approximately $535,000 in savings when they retire at age 65 if they rely on superannuation guarantee contributions alone. He claims, for example, that a 45-year-olds on an average household income of $100,000 and the average household superannuation balance for that age group of $120,000 will have just over $662,000 in their superannuation if they retired at 65 – giving them an income of just $33,000 to $46,000 a year."}, {"url": "http://www.abc.net.au/news/2013-04-03/kohler-the-great-unknowns-of-australian-super/4606650", "passage_text": "Well, the average super balance on retirement is around $280,000, which would provide a lifetime annuity income of around $15,000, or $577 per fortnight. That would reduce the age pension by $212.50 for a single, under the income test rules, and $154.50 for a couple. "}, {"url": "http://www.superannuation.asn.au/ArticleDocuments/116/rc0706_retirement_savings.pdf.aspx", "passage_text": "More specifically, for the 30% of men in the 60 to 64 age group with more than $100,000 in super, the average balance was around $338,000 while for the 12% of women in that age group with more than $100,000 in super the average was $236,000. Median balances were considerably lower given that many individuals have no or little superannuation. With average retirement payouts in 2003-04 of the order of $110,000 for men and only $37,000 for women clearly most recent retirees will need to substantially rely on the Age Pension in their retirement."}, {"url": "https://www.australiansuper.com/superannuation/women-and-super.aspx", "passage_text": "The average super balance for men still adding to their accounts is $71,645 while women hold an average of just $40,475. The average retirement payout (determined by the average savings for those aged 60-64) was $112,600 for women and $198,000 for men. "}, {"url": "http://www.challenger.com.au/funds/TechnicalUpdates/CRIR_How_much_super_do_Aussies_have_Apr12.pdf", "passage_text": "Figures for average balances in the self-managed super fund (SMSF) segment are also important. SMSFs make up 31 per cent of total super assets ($1.3 trillion) 3 and generally have higher member balances than large funds. ATO data indicate that the average super balance per SMSF is $888,433."}, {"url": "http://www.challenger.com.au/funds/TechnicalUpdates/CRIR_How_much_super_do_Aussies_have_Apr12.pdf", "passage_text": "Consider a saw-mill where there are 10 workers. Nine of the workers have super accounts of $50,000 while the manager of the saw-mill has $500,000. In this case, the median super balance is $50,000, while the average super balance is $95,000. None of the workers has a super balance of $95,000 and in this case the average does not paint an accurate picture of the typical super balance at the mill. SMSFs make up 31 per cent of total super assets ($1.3 trillion) 3 and generally have higher member balances than large funds. ATO data indicate that the average super balance per SMSF is $888,433."}, {"url": "http://www.futureassist.com.au/average-super-balance/", "passage_text": "The average super balance for women of 25 years of age is $9,476. The average super balance for women of 30 years of age is $20,177. The average super balance for women of 35 years of age is $34,501. The average super balance for women of 40 years of age is $38,416. The average super balance for women of 45 years of age is $47,480. The average super balance for men of 25 years of age is $10,704. The average super balance for men of 30 years of age is $22,239. The average super balance for men of 35 years of age is $42,245."}, {"url": "http://www.futureassist.com.au/average-super-balance/", "passage_text": "The average super balance for men of 40 years of age is $57,950. The average super balance for men of 45 years of age is $84,293. The average super balance for men of 50 years of age is $101,948. The average super balance for men of 55 years of age is $128,371. The average super balance for men of 25 years of age is $10,704. The average super balance for men of 30 years of age is $22,239. The average super balance for men of 35 years of age is $42,245."}, {"url": "http://www.challenger.com.au/funds/TechnicalUpdates/CRIR_How_much_super_do_Aussies_have_Apr12.pdf", "passage_text": "Australian Bureau of Statistics (ABS) statistics suggest that between the ages of 15 and 39, average male aggregate personal super balances are around 40 per cent higher than female ones. By the mid-50s, average male aggregate personal balances are double those of women in the same age group. SMSFs make up 31 per cent of total super assets ($1.3 trillion) 3 and generally have higher member balances than large funds. ATO data indicate that the average super balance per SMSF is $888,433."}]