[{"url": "http://www.answers.com/Q/How_early_can_you_spay_a_kitten", "passage_text": "Confidence votes 29. Kittens can be spayed as early as 6 weeks; however, ideally they should be spayed between 8 weeks to 6 months. That is called Juvenile or Early spay. The younger the kitten, the more quickly they recover and less pain they experience."}, {"url": "http://www.spayusa.org/pet-owners-faq.php", "passage_text": "Today some vets will spay/neuter at eight weeks of age, while other adhere to the old practice of six months of age. The average age at which pets are spayed or neutered is four months. Adolescent cats and dogs as young as five months can get pregnant."}, {"url": "http://pets.thenest.com/recovery-spayed-kittens-6808.html", "passage_text": "You may cringe at the idea of spaying your very young kitten, but early spaying can be a helpful preventive measure, keeping female cats healthy and totally avoiding the potential physical toll of a very young pregnancy."}, {"url": "http://www.friendsofanimals.org/programs/spaying-neutering/dont-delay-neuter-or-spay", "passage_text": "Female cats can go into estrus ('heat') at as young as 4 months. More and more veterinarians are performing early-age spay/ neuter procedures on animals as young as 8 weeks of age, to ensure the animal will never be at risk of accidental pregnancy or able to impregnate."}, {"url": "http://www.answers.com/Q/How_early_can_you_spay_a_kitten", "passage_text": "Kittens can be spayed/neutered as young as 8-12 weeks so long as they weigh a minimum of 2 pounds. Most shelters are performing early spay/neuters where traditionally most spa … y/neuters are performed at 5-7 months of age."}, {"url": "http://www.answers.com/Q/How_early_can_you_spay_a_kitten", "passage_text": "Kittens can be spayed as early as 6 weeks; however, ideally they should be spayed between 8 weeks to 6 months. That is called Juvenile or Early spay. The younger the kitten, the more quickly they recover and less pain they experience."}, {"url": "http://www.kittencare.com/why-neuter-male-kittens.html", "passage_text": "Congratulations on your new kitten! Male kittens are usually neutered at between 4 to 6 months of age. However, the AVMA has endorsed early age neutering of dogs and cats 8 to 16 weeks of age. You and your vet can decide what is the best time starting in a few weeks."}, {"url": "http://www.catchannel.com/cat-advocacy/becky-robinson/early-age-spay-neuter-for-kittens.aspx", "passage_text": "But research shows that healthy kittens can be safely neutered at 6 weeks, or as soon as they weigh 2 pounds. Referred to as early-age, pediatric, or pre-pubertal spay/neuter, the procedure eliminates any chance of an “oops litter,” since female cats can become pregnant as young as 4 months of age."}]