[{"url": "https://en.wikipedia.org/wiki/Oogenesis", "passage_text": "Oogenesis, ovogenesis, or ooegenesis /oögenesis.ˌoʊ/ əˈdʒɛnɨsɪs is the creation of an (ovum egg). Cell it is the female form of; gametogenesis the male equivalent is. Spermatogenesis it involves the development of the various stages of the immature. ovum Oogenesis occurs within the embryo sac and leads to the formation of a single egg cell per ovule. In ascaris, the oocyte does not even begin meiosis until the sperm touches it, in contrast to mammals, where meiosis is completed in the estrus cycle."}, {"url": "http://www.biology.iupui.edu/biocourses/N100H/ch9meiosis.html", "passage_text": "1 In a human egg or sperm, there are 23 chromosomes, one of which is an X or Y. 2  The number of chromosomes is reduced from 46 to 23 during the process of meiosis. 3  Fertilization of the egg by the sperm restores the diploid number of 46 chromosomes. Summary: At the end of meiosis, 4 daughter cells are formed = eggs or sperm. Each contains half as many chromosomes as the parent cell (n); each cell is genetically different from its parents and from its siblings. Fertilization of an egg by a sperm restores the chromosome number to 2n."}, {"url": "http://study.com/academy/lesson/what-is-human-fertilization-process-definition-symptoms.html", "passage_text": "Simply put, the definition of human fertilization is the union or joining of the egg and the sperm, resulting in a fertilized egg, otherwise known as a zygote. But the process of human fertilization is very complicated and comprised of many steps and components necessary to achieve the ultimate result of human life. Human fertilization is a very complicated process with many steps that take place in a short amount of time. Luckily, the definition is not as complicated as the process. Human fertilization is basically the fusion of the egg and sperm resulting in a zygote."}, {"url": "http://chickscope.beckman.uiuc.edu/explore/embryology/day05/ovary.html", "passage_text": "The free oocyte is guided by the infundibulum into the mouth of the hen's left oviduct. (In the female chicken only the left ovary and oviduct develop.). In the Oviduct. Shortly after release from the ovary, the egg's nucleus undergoes meiosis to prepare it for fertilization. "}, {"url": "http://americanpregnancy.org/infertility/in-vitro-fertilization/", "passage_text": "In Vitro Fertilization is a one assisted reproductive technology (ART) commonly referred to as IVF. IVF is the process of fertilization by manually combining an egg and sperm in a laboratory dish, and then transferring the embryo to the uterus. There are five basic steps in the IVF and embryo transfer process: 1  Monitor and stimulate the development of healthy egg(s) in the ovaries. 2  Collect the eggs. 3  Secure the sperm. 4  Combine the eggs and sperm together in the laboratory and provide the appropriate environment for fertilization and early embryo growth."}, {"url": "http://www.biology.iupui.edu/biocourses/N100H/ch9meiosis.html", "passage_text": "1 All cells in a higher eukaryote (like us) are diploid ­ EXCEPT ...for the germ cells ­ eggs and sperm. 2  Germ cells have only half the number of chromosomes as a diploid cell ­ one of each pair-and are termed haploid (n) . 3  In a human egg or sperm, there are 23 chromosomes, one of which is an X or Y. Summary: At the end of meiosis, 4 daughter cells are formed = eggs or sperm. Each contains half as many chromosomes as the parent cell (n); each cell is genetically different from its parents and from its siblings. Fertilization of an egg by a sperm restores the chromosome number to 2n."}, {"url": "https://en.wikipedia.org/wiki/Ovum", "passage_text": "Ovum redirects here. It is not to be confused with Ovule. The egg cell, or ovum, is the female reproductive cell (gamete) in oogamous organisms. The egg cell is typically not capable of active movement, and it is much larger (visible to the naked eye) than the motile sperm cells. When egg and sperm fuse, a diploid cell (the zygote) is formed, which gradually grows into a new organism"}, {"url": "http://study.com/academy/lesson/oogenesis-how-the-female-reproductive-system-produces-eggs.html", "passage_text": "The Ovum. Oogenesis is the process by which the female gametes, or ova, are created. The female gamete is called an ovum. Sometimes people will refer to female gametes as eggs, but the term egg can include more than one stage of development, and the definition of an egg also changes depending on the type of organism. In this lesson, you'll learn how the human body produces an ovum through the process of oogenesis. You'll also learn how polar bodies help to ensure that female gametes are of high quality even though they are not produced in high quantities."}, {"url": "http://www.biology.iupui.edu/biocourses/N100H/ch9meiosis.html", "passage_text": "1 Germ cells have only half the number of chromosomes as a diploid cell ­ one of each pair-and are termed haploid (n) . 2  In a human egg or sperm, there are 23 chromosomes, one of which is an X or Y. 3  The number of chromosomes is reduced from 46 to 23 during the process of meiosis. Summary: At the end of meiosis, 4 daughter cells are formed = eggs or sperm. Each contains half as many chromosomes as the parent cell (n); each cell is genetically different from its parents and from its siblings. Fertilization of an egg by a sperm restores the chromosome number to 2n."}, {"url": "http://study.com/academy/lesson/oogenesis-how-the-female-reproductive-system-produces-eggs.html", "passage_text": "Lesson Summary. In summary, oogenesis is the process by which the female gametes, or ova, are created. The female gamete is called an ovum. The diploid germ cells that have the potential to develop into ova are called oogonia. In this lesson, you'll learn how the human body produces an ovum through the process of oogenesis. You'll also learn how polar bodies help to ensure that female gametes are of high quality even though they are not produced in high quantities."}]