[{"url": "http://www.edelsteine.at/dictionary/sterndiopsid/", "passage_text": "Star Diopside. Diopside is a calcium-magnesium-silicate and one of the most common minerals of the pyroxene-group. It forms two complete series with Hedenbergite and Johannsenite. The 4-rayed star is caused by reflection of light at needle-shaped inclusions of magnetit"}, {"url": "http://www.minerals.net/gemstone/diopside_gemstone.aspx", "passage_text": "1 Chrome Diopside-Deep forest-green variety of Diopside. 2  Its color is caused from traces of the element chromium. 3  Star Diopside-Diopside polished into a cabochon that displays asterism in the form of a four-rayed star. 4  Its colors is usually very dark green to black. VARIETIES. 1  Chrome Diopside-Deep forest-green variety of Diopside. 2  Star Diopside-Diopside polished into a cabochon that displays asterism in the form of a four-rayed star. 3  Tashmarine Diopside-Light yellowish-green form of Diopside from a recently exploited deposit in eastern Uzbekistan. 4  Violane-Light blue to purple, manganese-rich variety of ..."}, {"url": "http://www.mineralszone.com/minerals/diopside.html", "passage_text": "CaMgSi 2 O 6 Diopside is an important rock forming mineral in several metamorphic and basic to ultra basic igneous rocks, also found in meteorites. Diopside is a part of an important solid solution series of the pyroxene group. "}, {"url": "http://www.minerals.net/mineral/diopside.aspx", "passage_text": "Diopside is a very common mineral and forms as an accessory mineral in many environment s, and is an important constituent of skarn rocks. Diopside forms a series with Hedenbergite, the iron equivalent of Diopside, and may be partially replaced by it. Diopside creates fine collector specimens, and transparent crystals from the classic localities are highly valued. Diopside is faceted as a minor gemstone, and the emerald-green, chromium-rich Chrome-Diopside variety has been increasing in popularity."}, {"url": "http://www.gemstone.org/index.php?option=com_content&view=article&id=132:sapphire&catid=1:gem-by-gem&Itemid=14", "passage_text": "Chrome diopside certainly won't win any contests for the most beautiful name. To most people, it sounds more like a car polish than a gemstone. But don't be misled by that! Chrome diopside has a beautiful rich green colour and an amazingly low price. In fact it is the most affordable gemstone in a pure rich green. There are a few drawbacks"}, {"url": "https://en.wikipedia.org/wiki/Diopside", "passage_text": "Diopside is found in ultramafic (kimberlite and peridotite) igneous rocks, and diopside-rich augite is common in mafic rocks, such as olivine basalt and andesite. Diopside is also found in a variety of metamorphic rocks, such as in contact metamorphosed skarns developed from high silica dolomites. It is an important mineral in the Earth 's mantle and is common in peridotite xenoliths erupted in kimberlite and alkali basalt."}, {"url": "https://en.wikipedia.org/wiki/Diopside", "passage_text": "Diopside is a monoclinic pyroxene mineral with composition MgCaSi 2 O 6. It forms complete solid solution series with hedenbergite (FeCaSi 2 O 6) and augite, and partial solid solutions with orthopyroxene and pigeonite. It forms variably colored, but typically dull green crystals in the monoclinic prismatic class. Diopside is also found in a variety of metamorphic rocks, such as in contact metamorphosed skarns developed from high silica dolomites. It is an important mineral in the Earth 's mantle and is common in peridotite xenoliths erupted in kimberlite and alkali basalt."}, {"url": "https://www.artfire.com/ext/shop/blog_post/MaggieMays/6254/russian_chrome_diopside_-_what_is_it_where_does_it_come_from_", "passage_text": "Chrome Diopside makes an excellent substitute for other green gemstones, mainly Emerald and Tsavorite, as it exhibits a similar color at a fraction of the cost. In fact, Chrome Diopside is the most affordable of all the rich green colored gemstones. Chrome Diopside is not treated. Chrome Diopside is in the pyroxene group of minerals, and has PRISMATIC CLEAVAGE, which means the angles of cleavage are 87 degrees and 93 degrees (almost perpendicular). This makes it a very difficult gem to facet. But at the same time, it has about twice the refraction of an emerald, giving it a brilliant sparkle."}, {"url": "http://meanings.crystalsandjewelry.com/diopside", "passage_text": "Diopside. Learn about the crystal meanings and metaphysical and healing properties lore of diopside. Diopside is a stone that is green to black-green to black. It is a very creative stone and can bring creativity to the bearer. It can is used to help with analysis and logic as an assistant to learning"}]