[{"url": "http://www.nhs.uk/Conditions/Antibiotics-penicillins/Pages/Introduction.aspx", "passage_text": "Introduction. Antibiotics are medications used to treat – and, in some cases, prevent – bacterial infections. They can be used to treat relatively mild conditions such as acne, as well as potentially life-threatening conditions such as pneumonia. However, antibiotics often have no benefit for many other types of infection. "}, {"url": "http://www.medicalnewstoday.com/articles/216798.php", "passage_text": "Penicillins are a certain collection of antibiotics that eliminate infection causing bacteria. Also known in short as pen or PCN, they originate from a type of fungi called Penicillium fungi. They are used in the treatment or prevention of many different bacterial infections, usually caused by Gram-positive organisms. Penicillins are all β-Lactam (Beta-Lactam) antibiotics, which are antibiotic molecules with a β-Lactam nucleus. There are a number of penicillin types, that react to bacteria in a variety of degrees, some of these are: 1  ampicillin. 2  amoxicillin. 3  flucloxacillin. 4  phenoxymethylpenicillin."}, {"url": "http://medical-dictionary.thefreedictionary.com/Penicillins", "passage_text": "There are several types of penicillins, each used to treat different kinds of infections, such as skin infections, dental infections, ear infections, respiratory tract infections, urinary tract infections, gonorrhea, and other infections caused by bacteria. "}, {"url": "https://en.wikipedia.org/wiki/Penicillin", "passage_text": "Penicillin antibiotics were among the first medications to be effective against many bacterial infections caused by staphylococci and streptococci. Penicillins are still widely used today, though many types of bacteria have developed resistance following extensive use. All penicillins are β-lactam antibiotics. "}, {"url": "http://familydoctor.org/familydoctor/en/drugs-procedures-devices/prescription-medicines/antibiotics-when-they-can-and-cant-help.html", "passage_text": "1 Antibiotics are used for some (but not all) ear infections. 2  Sinus infections. 3  Antibiotics are often used to treat sinus infections. 4  However, a runny nose and yellow or green mucus do not necessarily mean you need an antibiotic. 1 Sinus infections. 2  Antibiotics are often used to treat sinus infections. 3  However, a runny nose and yellow or green mucus do not necessarily mean you need an antibiotic. 4  Read more about treating sinusitis."}, {"url": "http://www.medicalnewstoday.com/articles/10278.php", "passage_text": "A broad-spectrum antibiotic can be used to treat a wide range of infections. A narrow-spectrum antibiotic is only effective against a few types of bacteria. There are antibiotics that attack aerobic bacteria, while others work against anaerobic bacteria. Aerobic bacteria need oxygen, while anaerobic bacteria don't. An antibiotic is given for the treatment of an infection caused by bacteria. Antibiotics target microorganisms such as bacteria, fungi and parasites. However, they are not effective against viruses."}, {"url": "http://www.ehow.com/facts_4914662_what-does-penicillin-treat.html", "passage_text": "Penicillin is the standard antibiotic treatment prescribed by doctors for bacterial infections in wounds, from sexually transmitted diseases, and diseases spread by animals and insects. Consider this information from drugs.com and the Mayo Clinic about the uses of penicillin. "}, {"url": "http://www.webmd.boots.com/nhs/antibiotics", "passage_text": "Antibiotics are some of the most frequently prescribed medicines. They work by killing bacteria or preventing bacteria from multiplying and spreading. Antibiotics can be used to treat potentially life-threatening conditions such as pneumonia or other conditions such as acne. Although antibiotics are useful in a wide variety of infections, it's important to understand that antibiotics only treat bacterial infections. Antibiotics are useless against viral infections such as the common cold, or fungal infections such as ringworm."}, {"url": "http://familydoctor.org/familydoctor/en/drugs-procedures-devices/prescription-medicines/antibiotics-when-they-can-and-cant-help.html", "passage_text": "1 Ear infections. 2  There are several types of ear infections. 3  Antibiotics are used for some (but not all) ear infections. 4  Sinus infections. 5  Antibiotics are often used to treat sinus infections. 6  However, a runny nose and yellow or green mucus do not necessarily mean you need an antibiotic. 1 Sinus infections. 2  Antibiotics are often used to treat sinus infections. 3  However, a runny nose and yellow or green mucus do not necessarily mean you need an antibiotic. 4  Read more about treating sinusitis."}, {"url": "http://www.mayoclinic.org/diseases-conditions/staph-infections/basics/treatment/con-20031418", "passage_text": "Antibiotics. Your doctor may perform tests to identify what type of staph bacteria is behind your infection, and to help choose the antibiotic that will work best. Antibiotics commonly prescribed to treat staph infections include certain cephalosporins, nafcillin or related antibiotics, sulfa drugs or vancomycin."}]