[{"url": "http://dinopedia.wikia.com/wiki/Abrictosaurus", "passage_text": "Abrictosaurus (wakeful lizard) is a genus of heterodontosaurid dinosaur from the Early Jurassic Period of what is now southern Africa."}, {"url": "http://www.dinosaurfact.net/jurassic/Abrictosaurus.php", "passage_text": "The fossils of the Abrictosaurus were discovered in southern Africa. It could have existed on South America as well since Africa and South America was a single continent in the Jurassic period. The Abrictosaurus belonged to order Orinithischia, which includes 'bird hipped' dinosaurs."}, {"url": "http://www.dinosaurfact.net/jurassic/Abrictosaurus.php", "passage_text": "The Abrictosaurus was a dinosaur that lived in the early Jurassic period of the Mesozoic era. It was a tiny dinosaur not weighing more than 40 to 50 kilos. It was during the middle of the Jurassic period that the large, dominant dinosaurs were seen on the earth."}, {"url": "http://dino.wikia.com/wiki/Abrictosaurus", "passage_text": "723 pages on this wiki. Abrictosaurus was an early bird-hipped bipedal herbivore from the heterodontosauridae family. Abrictosaurus was different from other heterodontosaurids in the fact that it did not have pointed canine teeth at the front of its lower jaw."}, {"url": "https://en.wikipedia.org/wiki/Abrictosaurus", "passage_text": "Abrictosaurus (/əˌbrɪktəˈsɔrəs/ ; wakeful lizard) is a genus of heterodontosaurid dinosaur from the Early Jurassic Period of what is now southern Africa. It was a small bipedal herbivore or omnivore, approximately 1.2 meters (4 feet) long, and weighing less than 45 kilograms (100 pounds)."}, {"url": "http://www.dinosaurfact.net/jurassic/Abrictosaurus.php", "passage_text": "1 The fossils of the Abrictosaurus were excavated in the Upper Elliot Formation of southern Africa. 2  Two sets of remains were discovered; one from Cape Province in South Africa and the other from Qacha's Nek in present day Lesotho. 3  The remains found in Lesotho were discovered by scientist Richard Thulborn in 1974."}, {"url": "http://www.ageofdinosaurs.com/dinosaurs/abrictosaurus.htm", "passage_text": "Abrictosaurus provides more evidence that dinosaurs originated in or near what is now South America. This little plant-eating dinosaur lived at the very beginning of the Jurassic Period and looked like many of the early dinosaurs. It would have walked on its hind legs and been a swift runner."}, {"url": "http://www.sciencekids.co.nz/pictures/dinosaurs/abrictosaurus.html", "passage_text": "Facts & description: This drawing shows the possible appearance of Abrictosaurus, a dinosaur from the early Jurassic Period (around 200 million years ago) that weighed around 45 kg (100 lb) and reached around 1.2 m (4 ft) in length."}]