[{"url": "http://www.theodora.com/encyclopedia/u/treaty_of_utrecht.html", "passage_text": "Then, England and France having concluded a truce, the pace was quickened and the main treaties were signed on the 11th of April 1713. By the treaty between England and France Louis XIV. recognized the Protestant succession in England and undertook to give no further aid to the Stuarts. Other treaties were signed at Utrecht between Spain and the allies, Philip now concluding these as the recognized and lawful king of Spain. On the 13th of July 1713 a treaty was signed between England and Spain, which embodied certain commercial arrangements previously made between the two countries."}, {"url": "http://www.theodora.com/encyclopedia/u/treaty_of_utrecht.html", "passage_text": "Treaty Of Utrecht. GEOGRAPHICAL NAMES TREATY OF UTRECHT, the general name given to the important series of treaties which in 1713 and 1714 concluded the great European war of the Spanish Succession, and by which inter alia England obtained possession of Newfoundland, Nova Scotia and Gibraltar. Other treaties were signed at Utrecht between Spain and the allies, Philip now concluding these as the recognized and lawful king of Spain. On the 13th of July 1713 a treaty was signed between England and Spain, which embodied certain commercial arrangements previously made between the two countries."}, {"url": "https://en.wikipedia.org/wiki/Treaty_of_Utrecht", "passage_text": "The treaties were concluded between the representatives of Louis XIV of France and of his grandson Philip V of Spain on one hand, and representatives of Anne of Great Britain, Victor Amadeus I of Sardinia, John V of Portugal and the United Provinces of the Netherlands on the other. The preliminaries were based on a tacit acceptance of the partition of Spain's European possessions. Following this, the Congress of Utrecht opened on 29 January 1712, with the British representatives being John Robinson, Bishop of Bristol, and Thomas Wentworth, Lord Strafford."}, {"url": "http://www.answers.com/Q/What_were_three_provisions_of_the_treaty_of_Utrecht", "passage_text": "What is the Treaty of Utrecht? The Treaty of Utrecht (1713) was a series of individual peace treaties that helped put an end to the War of Spanish Succession (known in America as Queen Anne's War) that wa … s being fought in order to determine who would succeed Charles II of Spain after his death. "}, {"url": "http://althistory.wikia.com/wiki/Treaty_of_Utrecht_(Unbalance)", "passage_text": "The Treaty of Utrecht was a treaty signed in the Dutch city of Utrecht in 1713, ending the War of the Spanish Succession. The main provisions of the Treaty of Utrecht are as follows: 1  Phillip V will be recognized as the Rightful Monarch of the Holy Christian Kingdom of Spain. 2  Phillip V will now and forever relinquish any and all claims to the Throne of the Holy Christian Kingdom of France. Provisions Edit. The main provisions of the Treaty of Utrecht are as follows: 1  Phillip V will be recognized as the Rightful Monarch of the Holy Christian Kingdom of Spain. 2  Phillip V will now and forever relinquish any and all claims to the Throne of the Holy Christian Kingdom of France."}, {"url": "https://en.wikipedia.org/wiki/Treaty_of_Utrecht", "passage_text": "The Treaty of Utrecht, which established the Peace of Utrecht, is a series of individual peace treaties, rather than a single document, signed by the belligerents in the War of the Spanish Succession, in the Dutch city of Utrecht in March and April 1713. The preliminaries were based on a tacit acceptance of the partition of Spain's European possessions. Following this, the Congress of Utrecht opened on 29 January 1712, with the British representatives being John Robinson, Bishop of Bristol, and Thomas Wentworth, Lord Strafford."}, {"url": "http://military.wikia.com/wiki/Treaty_of_Utrecht", "passage_text": "Template:Infobox treaty. The Treaty of Utrecht, which established the Peace of Utrecht, is a series of individual peace treaties, rather than a single document, signed by the belligerents in the War of the Spanish Succession, in the Dutch city of Utrecht in March and April 1713. Western Europe's borders after the Treaties of Utrecht and Rastatt. The treaty recognised Louis XIV's grandson Philip, Duke of Anjou, as King of Spain (as Philip V), thus confirming the succession stipulated in the will of the Charles II of Spain who died in 1700."}, {"url": "http://www.heraldica.org/topics/france/utrecht.htm", "passage_text": "Spain acceded to the terms of the treaty by the treaty of the Hague, Feb 17, 1720. Treaty signed between Great Britain, France and the Netherlands; to which Austria, Spain, Sardinia, Modena and Genoa acceded. (Treaty signed between Spain and Great Britain. Source: Chalmers, vol. "}, {"url": "http://www.infoplease.com/encyclopedia/history/utrecht-peace-of.html", "passage_text": "Utrecht, Peace of. Utrecht, Peace of, series of treaties that concluded the War of the Spanish Succession. It put an end to French expansion and signaled the rise of the British Empire."}]