[{"url": "http://my.clevelandclinic.org/services/imaging-institute/imaging-services/hic-pet-scan", "passage_text": "Positron Emission Tomography (PET Scan). A positron emission tomography (PET) scan is a unique type of imaging test that helps doctors see how the organs and tissues inside your body are actually functioning. The test involves injecting a very small dose of a radioactive chemical, called a radiotracer, into the vein of your arm. One of the main differences between PET scans and other imaging tests like CT scan or magnetic resonance imaging (MRI) is that the PET scan reveals the cellular level metabolic changes occurring in an organ or tissue."}, {"url": "https://en.wikipedia.org/wiki/Positron_emission_tomography", "passage_text": "Positron emission tomography (PET) is a nuclear medicine, functional imaging technique that produces a three-dimensional image of functional processes in the body. "}, {"url": "http://my.clevelandclinic.org/services/imaging-institute/imaging-services/hic-pet-scan", "passage_text": "Advanced Search. A positron emission tomography (PET) scan is a unique type of imaging test that helps doctors see how the organs and tissues inside your body are actually functioning. The test involves injecting a very small dose of a radioactive chemical, called a radiotracer, into the vein of your arm. One of the main differences between PET scans and other imaging tests like CT scan or magnetic resonance imaging (MRI) is that the PET scan reveals the cellular level metabolic changes occurring in an organ or tissue."}, {"url": "http://www.nhs.uk/Conditions/PET-scan/Pages/Introduction.aspx", "passage_text": "Why PET scans are used. An advantage of a PET scan is that it can show how well certain parts of your body are working, rather that showing what it looks like. They're particularly helpful for investigating confirmed cases of cancer, to determine how far the cancer has spread and how well it's responding to treatment. Introduction. Positron emission tomography (PET) scans are used to produce detailed three-dimensional images of the inside of the body. The images can clearly show the part of the body being investigated, including any abnormal areas, and can highlight how well certain functions of the body are working."}, {"url": "http://www.medicalnewstoday.com/articles/154877.php", "passage_text": "1 PET is an acronym for positron emission tomography. 2  PET scans are often used to diagnose a condition or how a condition is developing. 3  They are used alongside X-rays or MRI (magnetic resonance imaging) scan to diagnose or provide more insight into a condition. Also look out for links to information about related conditions. Fast facts on PET scans. Here are some key points about PET scans. More detail and supporting information is in the main article. 1  A PET scan uses radiation to create 3-dimensional, color images of the functional processes in the human body. 2  PET is an acronym for positron emission tomography"}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/test_procedures/neurological/positron_emission_tomography_pet_scan_92,P07654/", "passage_text": "Positron emission tomography (PET or PET scan) is a specialized radiology procedure used to examine various body tissues to identify certain conditions. PET may also be used to follow the progress of the treatment of certain conditions. "}, {"url": "http://www.radiologyinfo.org/en/info.cfm?PG=pet", "passage_text": "Positron emission tomography (PET) uses small amounts of radioactive materials called radiotracers, a special camera and a computer to help evaluate your organ and tissue functions. By identifying body changes at the cellular level, PET may detect the early onset of disease before it is evident on other imaging tests. PET and PET/CT scans are performed to: 1  detect cancer. 2  determine whether a cancer has spread in the body. 3  assess the effectiveness of a treatment plan, such as cancer therapy. 4  determine if a cancer has returned after treatment. 5  determine blood flow to the heart muscle."}, {"url": "http://petmri.in/", "passage_text": "We have the world class SIEMENS fully integrated whole body PET/MRI system that helps to make imaging the entire body. This zero radiation emitting machine and thus, it is safe for our patients. It takes less time, economical way, and equips with the 100% clinical diagnosis. Petmri is the leader in providing the high-end PET-MRI scanning that helps to identify the life threatening diseases such as heart disease or cancer. We have the veteran doctors that help for the proper diagnosis of these diseases and with this; you can get away from the health risks as well."}]