[{"url": "http://www.huffingtonpost.co.uk/john-fleming/why-do-bbc-itv-and-sky-ne_b_2328492.html", "passage_text": "To get regular news on Africa, Asia and Australasia, you have to watch Al Jazeera. There is no reason why the BBC or ITN or Sky could not have a 15 minute slot every hour in which they report genuine World News. Quantity, in this case, is more important than in-depth reports."}, {"url": "http://www.dailymail.co.uk/news/article-2013463/BBC-paid-22m-19-stars-salaries-500-000-year.html", "passage_text": "The BBC paid £22million to 19 stars who are all on more than £500,000 per year, according to accounts released today. The astonishing number is believed to include Graham Norton and Gary Lineker, on an estimated £2million a year each, and Alan Hansen, who earns a reported £1.4million."}, {"url": "http://www.bbc.co.uk/news/entertainment-arts-27109260", "passage_text": "Reid has said she quit the BBC last month after a fabulous two decades as the new ITV job was a fantastic opportunity. At the age of 43, I have got three children and I have been a journalist for more than 20 years-and so I do hope I know a few things about quite a lot of stuff, Reid said."}, {"url": "http://www.dailymail.co.uk/news/article-2013463/BBC-paid-22m-19-stars-salaries-500-000-year.html", "passage_text": "Reports last week revealed that around 20 actors, presenters and journalists are paid more than £500,000 by the BBC, but Sir Michael's promise to MPs that the corporation would publish more precise pay bands will not be upheld following legal advice."}, {"url": "http://www.itv.com/news/update/2013-02-18/bbc-sorry-for-disruption-to-services/", "passage_text": "we are disappointed that the nuj has gone ahead with today s strike and apologise to our audience for the disruption to services unfortunately industrial action does not alter the fact that the bbc has significant savings targets and as a consequence may have to make a number of compulsory redundancies"}, {"url": "http://www.dailymail.co.uk/news/article-2822111/BBC-education-editor-returns-ITV-just-six-months-following-comments-TV-newsrooms-created-men-men.html", "passage_text": "A BBC journalist who said yesterday that TV newsrooms are ‘created by men, largely for men’ is returning to ITV News only six months after she left. Penny Marshall, 51, left ITV News in May after three decades with ITN, then joined the BBC as education editor-but is now heading back to ITV as social affairs editor."}, {"url": "http://www.bbc.co.uk/news/entertainment-arts-27109260", "passage_text": "Image caption Reid made the final of 2013's Strictly Come Dancing. Image caption After TV-am in the 1980s, Owen and Diamond also hosted Good Morning with Anne and Nick on the BBC in the 1990s. They helped to turn around the show's fortunes and it went on to be very successful."}, {"url": "http://www.bbc.co.uk/news/entertainment-arts-27109260", "passage_text": "Former TV-am host Nick Owen has claimed viewers are put off watching ITV's breakfast shows because of the high salaries paid to big-name presenters. It comes as former BBC Breakfast host Susanna Reid prepares to front new show Good Morning Britain from next week, in a deal reported to be worth £1 million."}]