[{"url": "http://www.theanimalfiles.com/mammals/rabbits_hares_pikas/desert_cottontail.html", "passage_text": "They can leave the nest at 14 days old and they are weaned at 21 - 28 days old. Desert Cottontails reach sexual maturity at 3 months old. Predators Predators of Desert Cottontails include humans, foxes, coyotes, bobcats, mustelids, owls and birds of prey."}, {"url": "https://www.desertmuseum.org/books/nhsd_rabbits.php", "passage_text": "Rabbits and Hares. Of all the desert-dwelling mammals, the desert cottontail is probably the one you will see most frequently. Preyed upon by everything from snakes to coyotes to owls, most cottontails are killed within their first year."}, {"url": "https://www.superteacherworksheets.com/reading-comp/4th-desert-cottontails.pdf", "passage_text": "The desert cottontail is a type of rabbit that lives in the dry dusty areas of New Mexico, Arizona, and Western Texas. They can also live as far north as Montana, and as far west as California. 2."}, {"url": "http://digital-desert.com/wildlife/prey.html", "passage_text": "Desert Wildlife Prey Animals The term prey refers to an animal that is sought, captured, and eaten by a predator. A predator is an animal that hunts and kills other animals for food in an act called predation. Smaller predators, such as mice and lizards can be, and often are, prey for larger predators."}, {"url": "https://www.superteacherworksheets.com/reading-comp/4th-desert-cottontails.pdf", "passage_text": "Name: ____________________________ Reading Comprehension Desert Cottontails The desert cottontail is a type of rabbit that lives in the dry, dusty areas of New Mexico, Arizona, and Western Texas. They can also live as far north as Montana and as far west as California."}, {"url": "https://en.wikipedia.org/wiki/Desert_Cottontail", "passage_text": "Many desert animals prey on cottontails, including birds of prey, mustelids, the coyote, the bobcat, the lynx, wolves, mountain lions, snakes, weasels, humans, and even squirrels, should a cottontail be a juvenile, injured or docile."}, {"url": "https://en.wikipedia.org/wiki/Desert_Cottontail", "passage_text": "The desert cottontail (Sylvilagus audubonii), also known as Audubon's cottontail, is a New World cottontail rabbit, and a member of the family Leporidae. The desert cottontail is found throughout the western United States from eastern Montana to western Texas, and in northern and central Mexico."}]