[{"url": "http://www.businessdictionary.com/definition/leadership.html", "passage_text": "The individuals who are the leaders in an organization, regarded collectively. 2. The activity of leading a group of people or an organization or the ability to do this. Leadership involves: A leader steps up in times of crisis, and is able to think and act creatively in difficult situations. Unlike management, leadership cannot be taught, although it may be learned and enhanced through coaching or mentoring."}, {"url": "http://www.webster-dictionary.org/definition/leadership", "passage_text": "The office, position or function of a leader; as, Gingrich held the House leadership for six years. 2. The quality of character and personality giving a person the ability to gain the confidence of and lead others; as, Washington 's leadership was indispensible to success of the American Revolution. 3. "}, {"url": "http://www.oxforddictionaries.com/definition/english/leadership", "passage_text": "1.2 [treated as singular or plural] The leaders of an organization, country, etc. the leadership was divided into two camps. More example sentences. 1  The linkage between a tight ruling circle and the military coupled with oil revenues in the successive regimes created authoritarian leaderships. 1 But the leader can still govern well through his or her leadership style or ability. 2  The report singled out the quality of teaching, leadership and management within the school. 3  It said a different style of leadership was required, and that it was the right time for a change."}, {"url": "http://www.oxforddictionaries.com/definition/english/leadership", "passage_text": "Synonyms. 1  But the leader can still govern well through his or her leadership style or ability. 2  The report singled out the quality of teaching, leadership and management within the school. 3  It said a different style of leadership was required, and that it was the right time for a change. 1"}, {"url": "http://www.merriam-webster.com/dictionary/leadership", "passage_text": "Full Definition of LEADERSHIP. 1. : the office or position of a leader. 2. : capacity to lead. 3. : the act or an instance of leading. 4. See leadership defined for English-language learners. : a position as a leader of a group, organization, etc. : the time when a person holds the position of leader. : the power or ability to lead other people"}, {"url": "http://andersonleadershipsolutions.com/leadership-beyond-the-dictionary-definition/", "passage_text": "1 “Leadership is the process of persuasion or example by which an individual (or leadership team) induces the group to pursue objectives held by the leader or shared by the leader and his or her followers.” John W. Gardner, On Leadership. 2  Leaders do not just pursue objectives – they get results. Merriam Webster took me on an odyssey to get to a definition of leadership. I seem to remember being taught in school to not use the root of a word to define that word. Someone should have told Merriam that!"}, {"url": "http://dictionary.cambridge.org/us/dictionary/english/leader", "passage_text": "leader noun [C] (THE FIRST). › someone or something that is the first or the most ​important: Her ​company is a leader in the women’s ​clothing ​industry. (Definition of leader from the Cambridge Academic Content Dictionary © Cambridge University Press). leader noun [C] (CONTROLLING). B1 a ​person in ​control of a ​group, ​country, or ​situation: a ​religious leader The ​Russian leader ​wants to ​introduce ​further ​changes."}, {"url": "http://www.urbandictionary.com/define.php?term=leadership", "passage_text": "Top Definition. leadership. Leadership is great men and women with certain preferred traits influencing followers to do what the leaders wish in order to achieve group/organizational goals that reflect excellence defined as some kind of higher level effectiveness. - Joseph Rost"}, {"url": "http://www.thefreedictionary.com/leadership", "passage_text": "leadership. n. 1. the position or function of a leader. 2. the period during which a person occupies the position of leader: during her leadership very little was achieved. 3. leadership-the status of a leader; they challenged his leadership of the union. status, position-the relative position or standing of things or especially persons in a society; he had the status of a minor; the novel attained the status of a classic; atheists do not enjoy a favorable position in American life."}]