[{"url": "http://www.arthritis-treatment-and-relief.com/arthritis-chest-and-shoulder-pain.html", "passage_text": "•Osteoarthritis. Unlike rheumatoid arthritis, osteoarthritis develops from normal wear-and-tear of the joints. Aging can cause the cartilage in the joints of the neck to wear out, producing bony spurs that can irritate nerves and cause pain. •Accidents and falls."}, {"url": "http://www.webmd.com/arthritis/psoriatic-arthritis/psoriatic-arthritis-symptoms", "passage_text": "Although rare, chest pain and shortness of breath can be symptoms of psoriatic arthritis. These might happen when the chest wall and the cartilage that links your ribs to your breastbone get inflamed. Even more rarely, your lungs or your aorta (the large blood vessel that leaves your heart) could be affected. "}, {"url": "http://www.medicinenet.com/psoriatic_arthritis/page2.htm", "passage_text": "Inflammation in and around the lungs (pleuritis) causes chest pain, especially with deep breathing as the lungs expand against the inflamed areas, as well as shortness of breath. Inflammation of the aorta (aortitis) can cause leakage of the aortic valves, leading to heart failure and shortness of breath. Less commonly, psoriatic arthritis may involve many joints of the body in a symmetrical fashion, mimicking the pattern seen in rheumatoid arthritis. Psoriatic arthritis can also cause inflammation of the spine (spondylitis) and the sacrum, causing pain and stiffness in the low back, buttocks, neck, and upper back. Occasionally, psoriatic arthritis involves the small joints at the ends of the fingers"}, {"url": "http://www.arthritis-treatment-and-relief.com/arthritis-chest-and-shoulder-pain.html", "passage_text": "• Myocarditis, inflammation of the heart wall; can also cause chest pain that may be mistaken for chest wall pain. •Psychogenic-unexplained chest pain and hyperventilation; inability to recall past episodes. •Pleurisy-inflammation of the lining of the lung-may cause chest wall pain. Other lung problems that may be associated with chest pain and be confused with arthritis are bronchitis, oneumonia, lung cancer, or pneumothorax (punctured lung). Unlike rheumatoid arthritis, osteoarthritis develops from normal wear-and-tear of the joints. Aging can cause the cartilage in the joints of the neck to wear out, producing bony spurs that can irritate nerves and cause pain. •Accidents and falls."}, {"url": "https://www.jointhealthmagazine.com/chest-arthritis-in-women.html", "passage_text": "Therapies for Chest Arthritis: 1  Minocycline – Used when the patient is suffering from really severe arthritis. 2  Cortisone injection – To address the inflammation, a steroid injection can benefit the patient from the pain and discomfort. 3  Extra Strength Tylenol – Common choice for doctors. Therapies for Chest Arthritis: 1  Minocycline – Used when the patient is suffering from really severe arthritis. 2  The seriousness of the condition may become such that the patient’s breathing is severely affected and can be life threatening."}, {"url": "http://www.medicinenet.com/psoriatic_arthritis/page2.htm", "passage_text": "Inflammation of the tendon behind the heel causes Achilles tendinitis, leading to pain with walking and climbing stairs. Inflammation of the chest wall and of the cartilage that links the ribs to the breastbone (sternum) can cause chest pain, as seen in costochondritis. Less commonly, psoriatic arthritis may involve many joints of the body in a symmetrical fashion, mimicking the pattern seen in rheumatoid arthritis. Psoriatic arthritis can also cause inflammation of the spine (spondylitis) and the sacrum, causing pain and stiffness in the low back, buttocks, neck, and upper back. Occasionally, psoriatic arthritis involves the small joints at the ends of the finger"}, {"url": "http://www.emedicinehealth.com/costochondritis/article_em.htm", "passage_text": "Costochondritis is inflammation of the junctions where the upper ribs join the cartilage that holds them to the breastbone (sternum). Costochondritis causes localized chest wall pain and tenderness that can be reproduced by pushing on the involved cartilage in the front of the rib cage. 1 Overall, costochondritis is one of the most common causes of musculoskeletal chest pain. 2  While chest pain can represent heart disease and heart attack, inflammation around the heart (pericarditis) or lungs (pleuritis), costochondritis is also considered as a possible diagnosis in adults with"}, {"url": "http://www.uptodate.com/contents/chest-pain-beyond-the-basics", "passage_text": "Pressing on this area of the chest usually causes the pain to become worse. ● Sometimes, the cartilage that connects the ribs to the breastbone can become inflamed, causing pain. This is known as costochondritis. ● Diseases such as arthritis or fibromyalgia may also cause chest wall pain. ● Inflammation of the heart muscle itself, called myocarditis, can also cause chest pain, and it may mimic ischemic pain. Myocarditis is often caused by a viral infection. ● Another cause for a classic pain of angina in people with normal coronary arteries is syndrome X; this is more common in women."}]