[{"url": "http://www.digitaljournal.com/article/264124", "passage_text": "By KJ Mullins Dec 28, 2008 in Health. Cooling saves lifes after a heart attack. Taking the body down to a hypothermic state within hours can save not only heart muscle but improve the severity of a brain injury. Within four minutes of a heart attack brain cells begin to die off. Doctors have had the technology for several years for therapeutic hypothermia. An increase of using the procedure though has only taken off in the past 18 months. There are risks involved when the body core temperature is reduced. The body gains about a half a degree increase in temperature an hour. The process can be the cause of serious risks including an increased rate of infections. Changes to the blood sugar, fluid balance, blood pressure, heart rhythms and abnormal clotting are all concerns with the cooling and rewarming process."}, {"url": "https://en.wikipedia.org/wiki/Therapeutic_hypothermia", "passage_text": "Targeted temperature management (TTM) previously known as therapeutic hypothermia or protective hypothermia is active treatment that tries to achieve and maintain a specific body temperature in a person for a specific duration of time in an effort to improve health outcomes. The lowering of body temperature may be accomplished by many means including the use of cooling blankets, cooling helmets, cooling catheters, ice packs and ice water lavage."}, {"url": "http://ptca.org/news/2008/0415_CARDIUM.html", "passage_text": "About Patient Temperature Modulation. Patient temperature modulation is a rapidly-advancing field focused on preserving ischemic tissue and improving patient outcomes following major medical events such as cardiac arrest, heart attack and stroke, as well as in the management of patients experiencing trauma or fever. Patients randomized to the cooling arm (hypothermia) will be infused with 1 liter of iced saline in addition to endovascular cooling with the InnerCool Accutrol™ catheter, which contains an integrated temperature sensor that accurately measures the patient's core body temperature."}, {"url": "https://en.wikipedia.org/wiki/Therapeutic_hypothermia", "passage_text": "Periods of poor blood flow may be due to cardiac arrest or the blockage of an artery by a clot as in the case of a stroke. Targeted temperature management improves survival and brain function following resuscitation from cardiac arrest. The lowering of body temperature may be accomplished by many means including the use of cooling blankets, cooling helmets, cooling catheters, ice packs and ice water lavage."}, {"url": "http://www.webmd.com/heart-disease/news/20150406/cooling-after-cardiac-arrest-may-help-preserve-brain-function", "passage_text": "People who received what is called targeted body temperature management after cardiac arrest -- when the heart stops beating -- had good outcomes in terms of quality of life and mental function, researchers said. Body temperatures were lowered between 2 and 7 degrees Fahrenheit. "}, {"url": "https://en.wikipedia.org/wiki/Therapeutic_hypothermia", "passage_text": "Targeted temperature management is thought to prevent brain injury by several methods including decreasing the brain's oxygen demand, reducing the production of neurotransmitters like glutamate, as well as reducing free radicals that might damage the brain. The lowering of body temperature may be accomplished by many means including the use of cooling blankets, cooling helmets, cooling catheters, ice packs and ice water lavage."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=164820", "passage_text": "Researchers also found that cooling cardiac arrest patients could result in greater brain function and the ability to perform normal daily tasks, such as bathing and dressing, after recovery. During cardiac arrest, the heart suddenly stops working. If a person's heartbeat is restored but they are comatose, treatment may include lowering the patients' body temperature in an attempt to decrease the amount of oxygen they need, to prevent brain damage. In the 32 years that I've been caring for patients in the coronary care unit, Antman noted, this is a very challenging set of patients to have to deal with. Those who've had an out-of-hospital cardiac arrest often have these horrible neurologic outcomes, despite successful resuscitation.."}, {"url": "https://timeinmoments.wordpress.com/2008/12/30/brain-injuries-and-cooling-the-body-after-a-heart-attack/", "passage_text": "Cooling saves lifes after a heart attack. Taking the body down to a hypothermic state within hours can save not only heart muscle but improve the severity of a brain injury. Within four minutes of a heart attack brain cells begin to die off. Doctors have had the technology for several years for therapeutic hypothermia."}]