[{"url": "http://www.uptodate.com/contents/blood-in-the-stool-rectal-bleeding-in-adults-beyond-the-basics", "passage_text": "Seeing blood in the toilet, on the outside of your stool, or with wiping after a bowel movement is common. Fortunately, most of the causes of such rectal bleeding are not life-threatening; common causes include hemorrhoids and anal fissures. Bright red blood typically coats the stool or blood may drip into the toilet or stain toilet paper. (See Patient information: Hemorrhoids (Beyond the Basics) .). Anal fissure — An anal fissure is a tear in the lining of the anus, the opening where feces are excreted."}, {"url": "http://www.medicinenet.com/blood_in_the_stool_rectal_bleeding/article.htm", "passage_text": "Rectal Bleeding Symptoms. Blood in the stool or rectal bleeding is a symptom of a disease or condition. The color of blood in the stool can be: 1  bright red, 2  maroon, 3  yellow, 4  white, 5  green, 6  black and tarry, or. 7  not visible to the naked eye (occult)"}, {"url": "http://www.medicinenet.com/rectal_bleeding/symptoms.htm", "passage_text": "Blood in the stool can be bright red, maroon in color, black and tarry, or occult (not visible to the naked eye). Causes of blood in the stool range from harmless, annoying conditions of the gastrointestinal tract such as hemorrhoids to serious conditions such as cancer. Sometimes, bleeding from the gastrointestinal tract can be too slow to cause either rectal bleeding or melena. In these patients, bleeding is occult (not visible to the naked eye). The blood is found only by testing the stool for blood (fecal occult blood testing) in the laboratory."}, {"url": "http://www.uptodate.com/contents/blood-in-the-stool-rectal-bleeding-in-adults-beyond-the-basics", "passage_text": "RECTAL BLEEDING CAUSES. Seeing a small amount of blood after wiping, on the outside of your stool, or in the toilet is most commonly caused by hemorrhoids or an anal fissure. Hemorrhoids — Hemorrhoids are swollen blood vessels in the rectum or anus that can be painful, itchy, and can sometimes bleed (figure 1). Bright red blood typically coats the stool or blood may drip into the toilet or stain toilet paper. (See Patient information: Hemorrhoids (Beyond the Basics) .). Anal fissure — An anal fissure is a tear in the lining of the anus, the opening where feces are excreted."}, {"url": "http://www.nhs.uk/Conditions/rectal-bleeding/Pages/Introduction.aspx", "passage_text": "1 piles (haemorrhoids) – swollen blood vessels in and around the rectum. 2  They can bleed when you have a bowel movement, which can leave streaks of bright-red blood in your stools and on the toilet paper. 3  Piles may also cause itchiness around your anus. 4  They often heal on their own. Click on the links for more information about these causes. 1  piles (haemorrhoids) – swollen blood vessels in and around the rectum. 2  They can bleed when you have a bowel movement, which can leave streaks of bright-red blood in your stools and on the toilet paper. 3  Piles may also cause itchiness around your anus"}, {"url": "http://www.medicinenet.com/blood_in_the_stool_rectal_bleeding/article.htm", "passage_text": "1 Rectal bleeding is the passage of blood through the anus. 2  Rectal bleeding may be red, maroon, black, or occult. 3  The common causes of rectal bleeding include anal fissure, hemorrhoids, diverticulosis, colon cancer and polyps, post-polypectomy, angiodysplasias, colitis proctitis, and Meckel's diverticula. Blood in the stool or rectal bleeding is a symptom of a disease or condition. The color of blood in the stool can be: 1  bright red, 2  maroon, 3  yellow, 4  white, 5  green, 6  black and tarry, or. 7  not visible to the naked eye (occult)"}, {"url": "http://www.medicinenet.com/blood_in_the_stool_rectal_bleeding/article.htm", "passage_text": "1 Rectal bleeding may be red, maroon, black, or occult. 2  The common causes of rectal bleeding include anal fissure, hemorrhoids, diverticulosis, colon cancer and polyps, post-polypectomy, angiodysplasias, colitis proctitis, and Meckel's diverticula. Blood in the stool or rectal bleeding is a symptom of a disease or condition. The color of blood in the stool can be: 1  bright red, 2  maroon, 3  yellow, 4  white, 5  green, 6  black and tarry, or. 7  not visible to the naked eye (occult)"}]