[{"url": "https://en.wikipedia.org/wiki/PepsiCo", "passage_text": "PepsiCo Inc. is an American multinational food, snack and beverage corporation headquartered in Purchase, New York, United States, with interests in the manufacturing, marketing, and distribution of grain-based snack foods, beverages, and other products. The structure of PepsiCo's global operations has shifted multiple times in its history as a result of international expansion, and as of 2010 it is separated into four main divisions: PepsiCo Americas Foods, PepsiCo Americas Beverages, PepsiCo Europe, and PepsiCo Asia, Middle East and Africa."}, {"url": "https://www.pepsibottlingventures.com/faq/", "passage_text": "No. Pepsi Bottling Ventures does not own the formulas to most of the beverages we sell. Pepsi Bottling Ventures purchases the exclusive rights to make, sell, and distribute the beverages within its territory from the syrup companies, such as PepsiCo, Inc., which owns the formula rights. "}, {"url": "http://www.pepsicobeveragefacts.com/", "passage_text": "Your beverage choices change by the day and sometimes by the hour and PepsiCo is there for you every sip of the way. We offer the variety of beverages you want, ingredients you trust, and package sizes that fit your lifestyle. CHOICES. Your beverage choices change by the day and sometimes by the hour and PepsiCo is there for you every sip of the way. We offer the variety of beverages you want, ingredients you trust, and package sizes that fit your lifestyle. It’s all about choice and finding the match that’s right for you."}, {"url": "https://en.wikipedia.org/wiki/PepsiCo", "passage_text": "The primary brands sold by PepsiCo in Europe include Pepsi-Cola beverages, Frito-Lay snacks, Tropicana juices and Quaker food products, as well as regional brands unique to Europe such as Walkers crisps, Copella, Paw Ridge, Snack-a-Jack, Duyvis and others. The structure of PepsiCo's global operations has shifted multiple times in its history as a result of international expansion, and as of 2010 it is separated into four main divisions: PepsiCo Americas Foods, PepsiCo Americas Beverages, PepsiCo Europe, and PepsiCo Asia, Middle East and Africa."}, {"url": "http://www.pepsicobeveragefacts.com/", "passage_text": "PepsiCo begins with Pepsi-invented more than a century ago. Today, we’re Pepsi and so much more with soft drink choices like Mountain Dew and Sierra Mist, Aquafina bottled waters, Gatorade sports drinks, Tropicana and Naked Juice, Lipton ready-to-drink teas and Starbucks ready-to-drink coffees. CHOICES. Your beverage choices change by the day and sometimes by the hour and PepsiCo is there for you every sip of the way. We offer the variety of beverages you want, ingredients you trust, and package sizes that fit your lifestyle. It’s all about choice and finding the match that’s right for you."}, {"url": "https://en.wikipedia.org/wiki/PepsiCo", "passage_text": "In August 2009, PepsiCo made a $7 billion offer to acquire the two largest bottlers of its products in North America: Pepsi Bottling Group and PepsiAmericas. In 2010 this acquisition was completed, resulting in the formation of a new wholly owned subsidiary of PepsiCo, Pepsi Beverages Company. The structure of PepsiCo's global operations has shifted multiple times in its history as a result of international expansion, and as of 2010 it is separated into four main divisions: PepsiCo Americas Foods, PepsiCo Americas Beverages, PepsiCo Europe, and PepsiCo Asia, Middle East and Africa."}, {"url": "http://www.pepsico.com/Purpose/Human-Sustainability/Product-Choices", "passage_text": "PepsiCo anticipated the increasing focus on health and wellness more than 15 years ago and continues to innovate to provide consumers with a wide variety of choices. Reduce the average amount of saturated fats per serving in key global food brands, in key countries, by 15 percent by 2020, against a 2006 baseline. In 2009, PepsiCo established ambitious targets for the reduction of sodium, saturated fats and added sugars in our key global brands. We remain steadfastly committed to these goals and believe we will ultimately achieve them despite some challenges affecting our rates of progress."}, {"url": "https://en.wikipedia.org/wiki/PepsiCo", "passage_text": "PepsiCo's product mix as of 2012 (based on worldwide net revenue) consists of 63 percent foods, and 37 percent beverages. On a worldwide basis, the company's current products lines include several hundred brands that in 2009 were estimated to have generated approximately $108 billion in cumulative annual retail sales. The structure of PepsiCo's global operations has shifted multiple times in its history as a result of international expansion, and as of 2010 it is separated into four main divisions: PepsiCo Americas Foods, PepsiCo Americas Beverages, PepsiCo Europe, and PepsiCo Asia, Middle East and Africa."}]