[{"url": "http://trace.wisc.edu/docs/2004-About-dB/", "passage_text": "A 20 dB difference in SPL represents a ratio of ten-to-one in sound pressure. 1  Thus, a 40dB SPL would be a sound pressure level that is 100 times greater than the sound pressure level of the quietest sound that normal human hearing can detect."}, {"url": "http://www.noisyplanet.nidcd.nih.gov/info/pages/howloud.aspx", "passage_text": "Sound is measured in units called decibels. Decibel levels begin at zero, which is near total silence and the weakest sound our ears can hear. By comparison, a whisper is 30 decibels and a normal conversation is 60 decibels. An increase of 10 means that a sound is 10 times more intense, or powerful."}, {"url": "http://www.engineeringtoolbox.com/voice-level-d_938.html", "passage_text": "Talking with a normal voice approximate to a sound pressure level of 70 dB, a raised voice to 76 dB, a very loud voice to 82 dB and a shouting voice to 88 dB (1 ft distance). For every doubling of the distance from the noise source the sound pressure levels will be reduced by 6 decibels."}, {"url": "http://www.physicsclassroom.com/Class/sound/u11l2b.cfm", "passage_text": "The scale for measuring intensity is the decibel scale. The threshold of hearing is assigned a sound level of 0 decibels (abbreviated 0 dB); this sound corresponds to an intensity of 1*10-12 W/m2."}, {"url": "http://www.physicsclassroom.com/Class/sound/u11l2b.cfm", "passage_text": "This type of scale is sometimes referred to as a logarithmic scale. The scale for measuring intensity is the decibel scale. The threshold of hearing is assigned a sound level of 0 decibels (abbreviated 0 dB); this sound corresponds to an intensity of 1*10 -12 W/m 2."}, {"url": "http://www.webmd.com/brain/tc/harmful-noise-levels-topic-overview", "passage_text": "Normal conversation is about 60 dB, a lawn mower is about 90 dB, and a loud rock concert is about 120 dB. In general, sounds above 85 are harmful, depending on how long and how often you are exposed to them and whether you wear hearing protection, such as earplugs or earmuffs."}]