[{"url": "http://www.rollinghillswildlife.com/animals/l/leopardamur/index.html", "passage_text": "Amur leopards have the northernmost range of any leopard subspecies. Amur leopards are found in eastern Russia, near the Amur River within a thin strip south of Lake Khanka; and in the Jilin Province of China."}, {"url": "http://www.rollinghillswildlife.com/animals/l/leopardamur/index.html", "passage_text": "RHWA is a sponsor of Tigris Foundation. The Tigris Foundation supports Amur leopard conservation. For more information, go to the Tigris Foundation website. Leopards (Panthera pardus) are among the most adaptable of the cat species and are found in a wide variety of habitats across Africa and Asia."}, {"url": "http://eol.org/pages/1253182/details", "passage_text": "The Amur leopard (Panthera pardus orientalis), also known as the Manchurian leopard, is a wild feline predator native to the mountainous areas of the taiga as well as other temperate forests in Korea, Northeast China and the Russian Far East."}, {"url": "http://eol.org/pages/1253182/details", "passage_text": "Learn more about this article. The Amur leopard (Panthera pardus orientalis) is a leopard subspecies native to the Primorye region of southeastern Russia and the Jilin Province of northeast China. It is classified as Critically Endangered since 1996 by IUCN."}, {"url": "https://en.wikipedia.org/wiki/Amur_Leopard", "passage_text": "The Amur leopard (Panthera pardus orientalis) is a leopard subspecies native to the Primorye region of southeastern Russia and the Jilin Province of northeast China. It is classified as Critically Endangered since 1996 by IUCN. In 2007, only 19–26 wild Amur leopards were estimated to survive."}, {"url": "http://animalstime.com/amur-leopard-facts-amur-leopard-diet-habitat/", "passage_text": "Most people aren’t actually aware of where do amur leopards live! Amur leopards reside in North Korea, Russia, China and Japan. Amur Leopard facts about its habitat show that these animals are found in the sea coast of Japan and northern Suchan Basin. Hermann Schlegel was the first explorer to discover these animals back in 1857."}]