[{"url": "http://www.answers.com/Q/When_can_kittens_eat_solid_food", "passage_text": "Most kittens are ready to eat some solids between 4 1/2 to 5 weeks old. You should always start them with some soft food mixed with kitten milk replacer, NOT cow's milk EVER. … You can use a bit of goat's milk but the kitten replacer is preferred as it won't give them diarrhea. Kittens at four weeks old can be introduced to solid food as this is around the time they start to be weaned off the mother's milk. Try mashing up some good quality wet/canned … food (look for a brand with a high named meat content and no grain, such as EVO or Blue Buffalo to avoid tummy upsets) for them."}, {"url": "http://www.thecatsite.com/t/177338/when-should-the-kittens-start-eating-solid-food", "passage_text": "I've had rex kittens eating solid foods at 6-7 weeks but still want to nurse up to 12 weeks old Many kittens if given the chance will eat solid food and nurse (if mom allows it). That's why I don't rush weaning or pushing to eat. As long as mom's nursing them and they are eating well, I don't even attempt to start canned kitten food till 5-6 weeks old. Most kittens younger then that don't show a lot of interest."}, {"url": "https://answers.yahoo.com/question/index?qid=20070527115736AAIpgfg", "passage_text": "Rating Newest Oldest. Best Answer: At four or five weeks. When the mother is eating, put a saucer of cat food moistened with warm water (not milk...cow's milk is not good for cats) to a very runny consistency near her, and put the kittens close to it. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070522133435AAjjx4l", "passage_text": "Answers. Relevance. Rating Newest Oldest. Best Answer: They can start eating some solid food at about age 5 -6 weeks, but if there is a mom cat, keep letting her nurse them too until she chooses to wean them-that will give them the best nourishment. Around 5-6 weeks, start on can moist food first. My kitten was 5 weeks when I got him and he didnt have a problem eating can food, now he is 6 week's and he eat's Meow-Mix for kittens, they are small and perfect for him."}, {"url": "http://pets.thenest.com/should-give-newborn-kittens-food-11425.html", "passage_text": "Kittens are usually old enough to start eating solid foods when they're around 3 or 4 weeks in age, according to veterinarian J. Veronika Kiklevich of CatChannel.com. They're usually read to eat solid foods exclusively when they're between 6 and 7 weeks old. By then there is no need for them to nurse with mom. Soft food is much easier for kittens to manage -- remember, they've never eaten solid food before. Whether the food is canned or dry, blend it thoroughly with kitten formula that is slightly warmed. Once they're around 6 weeks old, however, you can stop mixing the food in with formula."}, {"url": "http://www.petmd.com/cat/centers/kitten/nutrition/evr_ct_weaning_kittens_what_to_feed_a_kitten", "passage_text": "Normally, the kitten weaning process begins at about four weeks of age. “With mom, they’ll start to try to eat her food, and she’ll push them away from her,” says Benson. But if you’re weaning a kitten that has been orphaned, you can start a little earlier, between three and four weeks. "}, {"url": "http://pets.webmd.com/cats/weaning-kitten", "passage_text": "In this article. Weaning is the process of transitioning kittens from mother’s milk to solid food. During weaning, kittens gradually progress from dependence on a mother’s care to social independence. Ideally, weaning is handled entirely by the mother cat. When the kittens reach four weeks old, you can place them in a separate area for a few hours at a time to reduce their dependency on mother’s milk and her overall presence."}, {"url": "http://www.ehow.com/about_4595755_do-kittens-start-eating-solids.html", "passage_text": "At 3 to 4 weeks of age, kittens are becoming big boys and girls, and it's time to initiate the first stage of the transition from their all-milk diet. Don't expect much the first time you plunk that dish of solid food on the floor within the reach of hungry kitties. "}, {"url": "http://www.answers.com/Q/When_can_kittens_eat_solid_food", "passage_text": "Kittens usually begin the weaning process around 4-6 weeks of age. They begin by taking an interest, or picking at their mother's solid food. At this age they will still be su … ckling and getting nutrients from their mother, but putting a tiny bit of wet food down every few hours will entice them to eat. Kittens at four weeks old can be introduced to solid food as this is around the time they start to be weaned off the mother's milk. Try mashing up some good quality wet/canned … food (look for a brand with a high named meat content and no grain, such as EVO or Blue Buffalo to avoid tummy upsets) for them."}]