[{"url": "http://www.homeadvisor.com/cost/inspectors-and-appraisers/hire-a-home-inspector/", "passage_text": "1 This varies by inspector and how they compile reports. 2  The average rate for home inspection is around $200-$600 based on where you live. 3  Some inspectors can charge up to $800 or more. 4  As with most things, paying the lowest cost for a home inspection isn't always in your best interest."}, {"url": "http://homeguides.sfgate.com/home-inspectors-look-house-36993.html", "passage_text": "One of the common contingencies to real estate purchase agreements is a home inspection. Hired by the buyer, an inspector examines the house thoroughly for non-functioning systems, damages, and repairs that may be needed."}, {"url": "http://home-inspectors.homeblue.com/pros/home-inspectors.aspx", "passage_text": "We can help you find a home inspector in your area. The pros in our network provide free cost estimates for a variety of home inspection services including: real estate inspections, pre-purchase inspections, pool inspections, condo inspections, property inspections, FHA inspections, mortgage inspections."}, {"url": "http://home-inspectors.homeblue.com/pros/home-inspectors.aspx", "passage_text": "What does a home inspector do? Home inspectors look at the interior and exterior of your home and provide you a general understanding of the “condition” of the home. They will assess for you the general condition of the roof, gutters, foundation, electrical system, plumbing system, and HVAC system."}, {"url": "http://www.getwhatyouwant.ca/do-i-need-a-condo-inspection", "passage_text": "Brand new condominiums are subject to different home inspections as part of the closing process. If you bought a condominium from a builder, you will take part in a Pre-delivery Inspection (PDI) – you can read more about the PDI on the Tarion website."}, {"url": "http://homeguides.sfgate.com/condo-inspection-check-list-40919.html", "passage_text": "A home inspection is a major contingency and it’s your responsibility to hire a licensed home inspector to go over the entire property and give you a detailed description of the unit, its operating systems and the building."}, {"url": "http://realtormag.realtor.org/sales-and-marketing/handouts-for-customers/for-buyers/what-home-inspection-should-cover", "passage_text": "What a Home Inspection Should Cover. Home inspections will vary depending on the type of property you are purchasing. A large historic home, for example, will require a more specialized inspection than a small condominium. However, the following are the basic elements that a home inspector will check."}, {"url": "http://forums.redfin.com/t5/Seattle/Home-inspection-in-Condo-purchase/td-p/15793", "passage_text": "Re: Home inspection in Condo purchase. ‎12-31-2008 10:04 AM. How much you can get out of a condo inspection depends on how old it is. If it's more than 10 years old, an inspector could check to make sure things like wiring, electrical panel, and plumbing are up to date."}, {"url": "http://forums.redfin.com/t5/Seattle/Home-inspection-in-Condo-purchase/td-p/15793", "passage_text": "Is it a good idea to hire a home inspector in a condo purchase? I assume most home inspector don't do roof, attic, foundations, heating inspection any way in a large association like high or mid rise building."}]