[{"url": "https://en.wikipedia.org/wiki/Trusted_Platform_Module", "passage_text": "Software can use a Trusted Platform Module to authenticate hardware devices. Since each TPM chip has a unique and secret RSA key burned in as it is produced, it is capable of performing platform authentication. Trusted Platform Module offers facilities for the secure generation of cryptographic keys, and limitation of their use, in addition to a random number generator. It also includes capabilities such as remote attestation and sealed storage, as follows:"}, {"url": "https://msdn.microsoft.com/en-us/library/windows/hardware/dn653315(v=vs.85).aspx", "passage_text": "This section provides links to information about the Windows BitLocker Drive Encryption feature and about Trusted Platform Module (TPM) hardware. Note. If you're looking for BitLocker and TPM content for Windows 10, see What's New in BitLocker and Trusted Platform Module. Microsoft continues to work broadly across the industry to improve security and system integrity for platforms that run Windows. "}, {"url": "https://technet.microsoft.com/en-us/library/cc749022(v=ws.10).aspx", "passage_text": "This Step-by-Step Guide provides the instructions necessary to use Trusted Platform Module (TPM) Management in a test lab environment. After logging on to Windows, right-click the Windows Defender icon in the notification area, point to Run blocked program, and then click TPM Initialization Wizard. If the User Account Control dialog box appears, confirm that the action it displays is what you want, and then click Continue."}, {"url": "https://technet.microsoft.com/en-us/library/cc749022(v=ws.10).aspx", "passage_text": "Trusted Platform Module (TPM) Management is a new feature set in Windows Vista® and Microsoft ® Windows Server® 2008 used to administer the TPM security hardware in your computer. The feature set includes the TPM Management console, and an API called TPM Base Services (TBS). After logging on to Windows, right-click the Windows Defender icon in the notification area, point to Run blocked program, and then click TPM Initialization Wizard. If the User Account Control dialog box appears, confirm that the action it displays is what you want, and then click Continue."}, {"url": "https://technet.microsoft.com/en-us/library/cc766159(v=ws.10).aspx", "passage_text": "TPM security hardware is used to enable other components or software that protect your system or encrypt data, such as BitLocker Drive Encryption. You may find the following resources helpful in understanding the role of TPM Management and BitLocker: 1  Trusted Platform Module Step-by-Step Guide. Computers that incorporate a TPM can also create a key that has not only been wrapped, but also tied to certain platform measurements. This type of key can only be unwrapped when those platform measurements have the same values that they had when the key was created. This process is called sealing the key to the TPM."}, {"url": "https://technet.microsoft.com/en-us/library/cc766159(v=ws.10).aspx", "passage_text": "Trusted Platform Module (TPM) Services is used to administer the TPM security hardware in a computer. The TPM Services architecture provides the infrastructure for hardware-based security by providing access to and assuring application-level sharing of a TPM. Computers that incorporate a TPM can also create a key that has not only been wrapped, but also tied to certain platform measurements. This type of key can only be unwrapped when those platform measurements have the same values that they had when the key was created. This process is called sealing the key to the TPM."}, {"url": "https://en.wikipedia.org/wiki/Trusted_Platform_Module", "passage_text": "Trusted Platform Module (TPM) is an international standard for a secure cryptoprocessor, which is a dedicated microprocessor designed to secure hardware by integrating cryptographic keys into devices. TPM's technical specification was written by a computer industry consortium called Trusted Computing Group (TCG). Trusted Platform Module offers facilities for the secure generation of cryptographic keys, and limitation of their use, in addition to a random number generator. It also includes capabilities such as remote attestation and sealed storage, as follows:"}, {"url": "http://www.webopedia.com/TERM/T/Trusted_Platform_Module.html", "passage_text": "Trusted Platform Module (TPM) is a hardware device that is basically a secure micro-controller with added cryptographic functionality. "}, {"url": "https://technet.microsoft.com/en-us/library/cc749022(v=ws.10).aspx", "passage_text": "A TPM is a microchip designed to provide basic security-related functions, primarily involving encryption keys. The TPM is usually installed on the motherboard of a computer or laptop, and communicates with the rest of the system using a hardware bus. After logging on to Windows, right-click the Windows Defender icon in the notification area, point to Run blocked program, and then click TPM Initialization Wizard. If the User Account Control dialog box appears, confirm that the action it displays is what you want, and then click Continue."}, {"url": "http://whatis.techtarget.com/definition/trusted-platform-module-TPM", "passage_text": "Part of the Hardware glossary: A Trusted Platform Module (TPM) is a specialized chip on an endpoint device that stores RSA encryption keys specific to the host system for hardware authentication. Each TPM chip contains an RSA key pair called the Endorsement Key (EK). The pair is maintained inside the chip and cannot be accessed by software. "}]