[{"url": "http://au.indeed.com/Disability-Support-Worker-jobs", "passage_text": "Disability Support Workers. Prospective applicants should be aware that part of the process to assess your suitability for the role will involve checking your name against the Department... 2 days ago-save job-email-more..."}, {"url": "http://au.indeed.com/Disability-Support-Worker-jobs", "passage_text": "As a Disability Support Worker, you will help people with a disability achieve their personal goals and aspirations.... 1 day ago-save job-email-more... 1  View all Victorian Government jobs-Murrindindi jobs."}, {"url": "http://www.payscale.com/research/AU/Job=Disability_Care_Worker/Hourly_Rate", "passage_text": "X Total Pay combines base annual salary or hourly wage, bonuses, profit sharing, tips, commissions, overtime pay and other forms of cash earnings, as applicable for this job. It does not include equity (stock) compensation, cash value of retirement benefits, or the value of other non-cash benefits (e.g. healthcare)."}, {"url": "http://au.indeed.com/Disability-Support-Worker-jobs-in-Victoria", "passage_text": "As a Disability Support Worker, you will help people with a disability achieve their personal goals and aspirations.... 14 days ago-save job-email-more... 1  View all Victorian Government jobs-Colac jobs."}, {"url": "http://au.indeed.com/Disability-Support-Worker-jobs-in-Victoria", "passage_text": "Casual. Respite Support Workers provide support for children with disabilities in areas such as personal care, health and well-being, accessing the local community,... 7 days ago-save job-email-more... 1  View all Gateways Support Services jobs-Victoria jobs."}, {"url": "http://au.indeed.com/Disability-Support-Worker-jobs-in-Victoria", "passage_text": "Part-time. As a Disability Support Worker, you will help people with a disability achieve their personal goals and aspirations.... 5 days ago-save job-email-more... 1  View all Victorian Government jobs-Latrobe Valley jobs."}, {"url": "http://www.payscale.com/research/AU/Job=Community_Support_Worker/Hourly_Rate", "passage_text": "Community Support Worker Salary. (Australia). The average wage for a Community Support Worker is AU$21.72 per hour. A skill in Case Management is associated with high pay for this job. Experience does not have a big impact on this job’s wage. People in this job generally don't have more than 20 years' experience."}, {"url": "http://www.payscale.com/research/AU/Job=Disability_Care_Worker/Hourly_Rate", "passage_text": "The average pay for a Disability Care Worker is AU$22.24 per hour. People in this job generally don't have more than 20 years' experience."}]