[{"url": "http://misc.medscape.com/pi/android/medscapeapp/html/A760145-business.html", "passage_text": "Hypovolemic shock refers to a medical or surgical condition in which rapid fluid loss results in multiple organ failure due to inadequate circulating volume and subsequent inadequate perfusion. Most often, hypovolemic shock is secondary to rapid blood loss (hemorrhagic shock). History. In a patient with possible shock secondary to hypovolemia, the history is vital in determining the possible causes and in directing the workup. Hypovolemic shock secondary to external blood loss typically is obvious and easily diagnosed."}, {"url": "http://www.ehealthstar.com/hypovolemia", "passage_text": "Symptoms and signs of hypovolemia (pale, cool and moist skin, increased heart rate, weak pulse) may not be present until the blood volume decreases for more than 10-20%, when hypovolemic shock starts to develop. Absolute hypovolemia refers to a decreased volume of the fluid (blood) within the circulatory system in which the fluid leaves the body, for example in bleeding. In relative hypovolemia, the fluid from the circulatory system does not leave the body and it can refer to 2 different situations:"}, {"url": "http://www.rightdiagnosis.com/sym/hypovolemia.htm", "passage_text": "Hypovolemia: a state of decreased blood volume; more specifically, decrease in volume of blood plasma. See detailed information below for a list of 19 causes of Hypovolemia, Symptom Checker, including diseases and drug side effect causes. » Review Causes of Hypovolemia: Causes | Symptom Checker ». "}, {"url": "http://emedicine.medscape.com/article/760145-overview", "passage_text": "Background. Hypovolemic shock refers to a medical or surgical condition in which rapid fluid loss results in multiple organ failure due to inadequate circulating volume and subsequent inadequate perfusion. Most often, hypovolemic shock is secondary to rapid blood loss (hemorrhagic shock). "}, {"url": "http://howshealth.com/hypovolemia/", "passage_text": "Hypovolemia Definition. Hypovolemia is a condition, where the blood volume decreases, otherwise decrease in blood plasma volume occurs. Thus, it is the volume contraction’s intravascular component, or blood volume loss due to hemorrhage and dehydration. Hence, sometimes, volume contraction and hypovolemia are used synonymously. Hypovolemia is represented by depletion of sodium (salt), thereby differing from dehydration, and meaning excessive water loss from the body. Historically, hypovolemia was termed desanguination meaning extensive loss of blood (derived from the Latin word sanguis, meaning blood). Hippocrates widely used this term."}, {"url": "https://en.wikipedia.org/wiki/Hypovolemia", "passage_text": "Common causes of hypovolemia are. 1  Loss of blood (external or internal bleeding or blood donation). 2  Loss of plasma (severe burns and lesions discharging fluid). 3  Loss of body sodium and consequent intravascular water; e.g. diarrhea or vomiting. Hypovolemia can be recognized by tachycardia, diminished blood pressure, and the absence of perfusion as assessed by skin signs (skin turning pale) and/or capillary refill on forehead, lips and nail beds. The patient may feel dizzy, faint, nauseated, or very thirsty."}, {"url": "http://www.healthline.com/health/hypovolemic-shock", "passage_text": "Hypovolemic shock, also known as hemorrhagic shock, is a life-threatening condition that results when you lose more than 20 percent (one-fifth) of your body’s blood or fluid supply. This severe fluid loss makes it impossible for the heart to pump a sufficient amount of blood to your body. Hypovolemic shock results from significant and sudden blood or fluid losses within your body. Blood loss of this magnitude can occur because of: 1  bleeding from cuts or wounds. 2  bleeding from blunt traumatic injuries due to accidents or seizure activity."}, {"url": "http://www.ehealthstar.com/hypovolemia", "passage_text": "Hypovolemia means any decrease in the blood volume and does not already mean hypovolemic shock. For example, donation of 500 mL blood causes hypovolemia, but usually not shock 12. Hypovolemic shock may start to develop at 10-20% blood loss (0.5-1 liter blood) because of inadequate perfusion of the body tissues. Absolute hypovolemia refers to a decreased volume of the fluid (blood) within the circulatory system in which the fluid leaves the body, for example in bleeding. In relative hypovolemia, the fluid from the circulatory system does not leave the body and it can refer to 2 different situations:"}, {"url": "http://www.healthgrades.com/conditions/hypovolemia", "passage_text": "Hypovolemia is a decrease in the volume of blood in your body, which can be due to blood loss or loss of body fluids. Blood loss can result from external injuries, internal bleeding, or certain obstetric emergencies. Diarrhea and vomiting are common causes of body fluid loss. Fluid can also be lost as a result of large burns, excessive perspiration, or diuretics. Inadequate fluid intake can also cause hypovolemia."}]