[{"url": "http://www.smoothradio.com/artists/elton-john/who-sang-rocket-man-best-version/", "passage_text": "Rocket Man – Kate Bush. Kate Bush ’s cover version of ‘Rocket Man’ was released in 1991, as part of the Elton John /Bernie Taupin tribute album Two Rooms: Celebrating the Songs of Elton John & Bernie Taupin. It reached number 12 in the UK and was considered a commercial success. It was composed by Elton John and his long-term songwriting partner, Bernie Taupin. According to an account in Elizabeth Rosenthal's book His Song: The Musical Journey of Elton John, the song was inspired by Taupin's sighting of either a shooting star or a distant airplane."}, {"url": "https://en.wikipedia.org/wiki/Rocket_Man_(song)", "passage_text": "Another song called Rocket Man (and also based on Bradbury's short story The Rocket Man) was released by the musical group Pearls Before Swine on their 1970 album The Use of Ashes. 1 In the song Home Life by John Mayer, he sings I am not a rocket man, a reference to the song."}, {"url": "https://en.wikipedia.org/wiki/Piano_Man_%28song%29", "passage_text": "Piano Man  is the first single released by Billy Joel. It was released on November 2, 1973, and has been included on several subsequent albums. Joel's first major hit and his signature song, the song peaked at #25 on the Billboard Hot 100 chart in April 1974. Piano Man is a fictionalized retelling of Joel's experience as a piano-lounge singer for six months in 1972 at the now defunct Executive Room bar in Los Angeles. Joel has stated that all of the characters depicted in the song were based on real people."}, {"url": "http://crosswordheaven.com/clues/john-who-sang-rocket-man", "passage_text": "Clue: John who sang Rocket Man. We have 1 answer for the clue John who sang Rocket Man . See the results below. "}, {"url": "https://en.wikipedia.org/wiki/Rocket_Man_(song)", "passage_text": "Kate Bush released a cover of Rocket Man in 1991 as part of the Elton John/Bernie Taupin tribute album Two Rooms: Celebrating the Songs of Elton John & Bernie Taupin. 1 In the song Home Life by John Mayer, he sings I am not a rocket man, a reference to the song."}, {"url": "http://www.eltonjohn.com/about/", "passage_text": "In 2007, Elton released Rocket Man – The Definitive Hits, a single CD album that features 18 classic hit songs. Also in 2007, for the first time ever, Elton’s entire back catalogue of nearly 500 tracks (90 singles and 32 albums) became available to download legally. "}, {"url": "http://www.smoothradio.com/artists/elton-john/who-sang-rocket-man-best-version/", "passage_text": "Rocket Man-Elton John. The original version of 'Rocket Man' was performed, of course, by Elton John and was released in 1972. It was composed by Elton John and his long-term songwriting partner, Bernie Taupin. According to an account in Elizabeth Rosenthal's book His Song: The Musical Journey of Elton John, the song was inspired by Taupin's sighting of either a shooting star or a distant airplane."}, {"url": "https://en.wikipedia.org/wiki/Rocket_Man_(song)", "passage_text": "Rocket Man  is a song composed by Elton John and Bernie Taupin and originally performed by John. 1 In the song Home Life by John Mayer, he sings I am not a rocket man, a reference to the song."}, {"url": "https://en.wikipedia.org/wiki/Rocket_Man_(song)", "passage_text": "It is also known for being the first song in John's catalog to feature what would become the signature backing vocal combination of his band at the time, Dee Murray, Nigel Olsson and Davey Johnstone. Rocket Man was ranked #242 in the 2004 list of Rolling Stone's 500 Greatest Songs of All Time. 1 In the song Home Life by John Mayer, he sings I am not a rocket man, a reference to the song."}]