[{"url": "http://www.answers.com/Q/Is_graphite_toxic", "passage_text": "Graphite is a type of mineral which is most known for its use in pencils. Graphite is carbon arranged in a very different way to how it is arranged in diamond.   …   Pencils made out of the mineral graphite. 21 people found this useful."}, {"url": "http://pencils.com/the-unleaded-pencil/", "passage_text": "• Charcoal pencils, used primarily by artists, are another popular form of black lead pencil, made from a different form of carbon than graphite that is more like coal. These make a very dark black mark on the paper compared to even very soft graphite pencils, such as 8B."}, {"url": "http://drawsketch.about.com/od/drawingglossary/g/graphite.htm", "passage_text": "Graphite is not lead at all; the misnomer arose because it was mistaken for a form of lead when first discovered in England. Graphite is in fact a form of carbon, and is non-toxic. Pencils have never been made from lead, but it was not until the late 18th century that the true composition of the material was identified, and the original name stuck."}, {"url": "http://www.answers.com/Q/Is_graphite_toxic", "passage_text": "Graphite, a natural mineral, is a form (allotrope) of the element carbon, and it is composed of carbon atoms. But graphite is not … the only allotrope of carbon. There are also diamonds and amorphous carbon."}, {"url": "http://pencils.com/lead-in-pencils/", "passage_text": "The core is made of non-toxic graphite and does not contain lead. As a result of increased concern for the safety of different consumer products such as toys or art products from China, we often receive inquiries regarding the potential for exposure to lead in pencils."}, {"url": "http://www.rightdiagnosis.com/c/chemical_poisoning_graphite/intro.htm", "passage_text": "Chemical poisoning -- Graphite: Graphite is a mineral used mainly in steel manufacturing, brake lining, pencils and lubricants. Ingestion and other exposures to the chemical can cause various symptoms."}, {"url": "http://pencils.com/the-unleaded-pencil/", "passage_text": "Here’s a myth buster: There is no lead in pencils. Rather, the core is made up of a non-toxic mineral called graphite. The common name “pencil lead” is due to an historic association with the stylus made of lead in ancient Roman times. If you’re looking for information on potential lead exposure risks in pencils, Click here."}]