[{"url": "http://www.spadre.com/", "passage_text": "Corpus Christi is NOT South Padre Island, it is 3 hours north on North Padre Island. South Padre Island is the finest coastal resort in Texas, with beautiful beaches, tall sand dunes, and warm clear clean Gulf waters. South Padre Island is the finest coastal resort in Texas, with beautiful clean beaches, tall sand dunes, and warm clear clean Gulf waters. * Note-Corpus Christi is North Padre Island, three hours north of Sou"}, {"url": "http://www.stayonsouthpadre.com/south_padre_is_not_padre.htm", "passage_text": "We want you to know that there is a MAJOR difference from Padre Island to South Padre Island. The difference is approximately 160 miles. Padre Island used to be 150 miles long many decades ago. It stretched from Corpus Christi, TX. south to Port Isabel, TX. Approximately 4 or 5 decades ago a ship channel was cut through the barrier reef island approximately 36 miles north from the south tip of the island. You were on Padre Island! South Padre Island is 160 miles south about 24 miles from the Mexican border at Port Isabel, TX. They would look at me with eyes full of enlightenment and say Ohhhh! This has been a point of confusion to many vacationers."}, {"url": "http://www.visitcorpuschristitx.org/explore/padre-island/", "passage_text": "Padre Island features several beach options and Bob Hall pier ideal for fishing and surfing. Padre Island also is home to the newest waterpark of the award-winning Schlitterbahn family. The Padre Island waterpark is slated to open in 2015. Padre Island offers some of the area’s best dining options and nightlife. Padre Island also features a Texas-style way to explore the beach – on horseback! This popular attraction is open to both beginners and advanced riders."}, {"url": "http://www.south-padre-island.com/", "passage_text": "Welcome To South Padre Island! A resort vacation spot off the southernmost Gulf Coast of Texas, South Padre Island offers the perfect beach vacation for everyone. Once a sleepy fishing village, South Padre Island is now ranked as the one of the Top Beaches in the US by many national publications. With the 30mi."}, {"url": "https://en.wikipedia.org/wiki/South_Padre_Island,_Texas", "passage_text": "South Padre Island is a resort town in Cameron County, Texas, United States. It is part of the Brownsville – Harlingen Metropolitan Statistical Area. The town is located on South Padre Island, a barrier island along the Texas Gulf Coast accessible via a causeway from the town of Port Isabel. South Padre Island is named after Jose José Nicolas (Nicolás Balli), ballí Padre balli ballí a. catholic priest and settler"}, {"url": "http://www.sopadre.com/", "passage_text": "With 34-miles of uninterrupted beaches, South Padre Island leads the Texas beach scene for all ages! From young and old and everyone in between, South Padre Island welcomes guests to this paradise in South Texas. Whether you are planning a romantic weekend, spring break or the perfect family vacation, South Padre Island has the events, lodging and activities for visitors of all ages."}, {"url": "https://en.wikipedia.org/wiki/Padre_Island", "passage_text": "Padre Island sand dunes. Padre Island is the largest of the Texas barrier islands and is the world's longest barrier island. It is part of the U.S. state of Texas. The island is located along Texas' southern coast of the Gulf of Mexico and is noted for its white sandy beaches at the south end. The town of South Padre Island is located on its southern end, but the island as a whole is sparsely populated. The central part of the island is preserved in a natural wild state as Padre Island National Seashore. Since 1964, the island has been divided by the artificial Port Mansfield Channel."}, {"url": "https://en.wikipedia.org/wiki/Padre_Island", "passage_text": "Padre Island is the second-largest island by area in the contiguous United States, after Long Island in New York on the Atlantic Coast. It is about 113 miles (182 km) long and 1.8 miles (3 km) wide, stretching from the city of Corpus Christi, in the north, to the resort community of South Padre Island in the south. The town of South Padre Island is located on its southern end, but the island as a whole is sparsely populated. The central part of the island is preserved in a natural wild state as Padre Island National Seashore. Since 1964, the island has been divided by the artificial Port Mansfield Channel."}, {"url": "https://en.wikipedia.org/wiki/Padre_Island", "passage_text": "The terms  North Padre Island  and  South Padre Island  are often used to refer to the separated portions of the island. Padre Island is included within the jurisdictions of Cameron, Kenedy, Kleberg, Nueces, and Willacy counties in Texas. The town of South Padre Island is located on its southern end, but the island as a whole is sparsely populated. The central part of the island is preserved in a natural wild state as Padre Island National Seashore. Since 1964, the island has been divided by the artificial Port Mansfield Channel."}]