[{"url": "http://www.answers.com/Q/Can_you_burn_off_fingerprints", "passage_text": "Merge this question into. Split and merge into it. Answer by Figureskater8901. Confidence votes 24. No. It is impossable to burn off your fingerprints. If Jhon Dillon did not get away with shaving them off then you can not burn them off."}, {"url": "http://www.answers.com/Q/Can_you_burn_off_your_fingerprints_and_still_feel_objects", "passage_text": "Confidence votes 470. Fingerprints don't affect whether you can feel objects or not. They help improve the sensitivity of your skin at your fingers and improve grip, but you don't need to have fingerprints to feel an object. The rest of your body doesn't have fingerprint-like patterns but you can still feel things. But if you burn your fingers so badly that your fingerprints are gone, I would think that your nerves would be so damaged that you wouldn't be able to feel anything (I don't know if this would be permanent though)."}, {"url": "http://www.answers.com/Q/Can_you_burn_off_fingerprints", "passage_text": "You can't wipe off fingerprints from paper because it has the oil  from your hands soaked into the paper. The only way to get rid of  them is to throw the paper away. Edit. Share to: Answered. In Entertainment & Arts."}, {"url": "https://www.quora.com/Is-it-possible-to-remove-your-fingerprints", "passage_text": "In the past, criminals have burned their fingerprints off using caustic substances such as acid, notably John Dillinger as early as 1934 [1]."}, {"url": "http://www.answers.com/Q/Can_you_burn_off_fingerprints", "passage_text": "Fingerprints don't affect whether you can feel objects or not. They help improve the sensitivity of your skin at your fingers and improve grip, but you don't need to have fing … erprints to feel an object. The rest of your body doesn't have fingerprint-like patterns but you can still feel things."}, {"url": "http://www.answers.com/Q/Can_you_burn_off_your_fingerprints_and_still_feel_objects", "passage_text": "Fingerprints don't affect whether you can feel objects or not. They help improve the sensitivity of your skin at your fingers and improve grip, but you don't need to have fingerprints to feel an object. The rest of your body doesn't have fingerprint-like patterns but you can still feel things. But if you burn your fingers so badly that your fingerprints are gone, I would think that your nerves would be so damaged that you wouldn't be able to feel anything (I don't know if this would be permanent though)."}]