[{"url": "http://www.webmd.com/women/tc/bartholin-gland-cyst-topic-overview", "passage_text": "The Bartholin glands are two small organs under the skin in a woman's genital area. They are on either side of the folds of skin (labia) that surround the vagina and urethra. Most of the time, you can't feel or see these glands. If a Bartholin duct gets blocked, fluid builds up in the gland. The blocked gland is called a Bartholin gland cyst. (Sometimes it's called a Bartholin duct cyst.) These cysts can range in size from a pea to a large marble. They usually grow slowly. If the Bartholin gland or duct gets infected, it's called a Bartholin gland abscess. Bartholin gland cysts are often small and painless. Some go away without treatment. But if you have symptoms, you might want treatment. If the cyst is infected, you will need treatment"}, {"url": "http://www.mayoclinic.org/diseases-conditions/bartholin-cyst/basics/definition/CON-20026333", "passage_text": "The Bartholin's (BAHR-toe-linz) glands are located on each side of the vaginal opening. These glands secrete fluid that helps lubricate the vagina. Sometimes the openings of these glands become obstructed, causing fluid to back up into the gland. The result is relatively painless swelling called a Bartholin's cyst. A Bartholin's cyst or abscess is common. Treatment of a Bartholin's cyst depends on the size of the cyst, how painful the cyst is and whether the cyst is infected. Sometimes home treatment is all you need. In other cases, surgical drainage of the Bartholin's cyst is necessary."}, {"url": "https://en.wikipedia.org/wiki/Bartholin%27s_cyst", "passage_text": "A Bartholin's cyst, also known as Bartholinitis occurs when a Bartholin's gland is blocked and the gland becomes inflamed. Sizes range from that of a pea to that of an egg and form just within each side of the lower part of the opening of the vagina. An abscess may form if the cyst becomes infected. A Bartholin's cyst is not an infection, although it can be caused by an infection, inflammation, or physical blockage (mucus or other impediment) to the Bartholin's ducts (tubes which lead from the glands to the vulva). If infection sets in, the result is a Bartholin's abscess. Cysts are not sexually transmit"}, {"url": "http://www.medicalnewstoday.com/articles/185022.php", "passage_text": "Knowledge center. A Bartholin's cyst, or Bartholin's duct cyst occurs when the duct of the Bartholin's gland is blocked, resulting in the development of a fluid-filled cyst. Even though it may sometimes be caused by an infection, a Bartholin's cysts is not an infection. The Bartholin's glands, also known as the major vestibular glands, are a pair of glands between the vagina and the vulva that produce lubrication (mucus-like fluid) when stimulated."}, {"url": "http://www.emedicinehealth.com/bartholin_cyst/article_em.htm", "passage_text": "The Bartholin's glands are located at the entrance to a woman's vagina, one on each side. They are small and cannot be seen or felt when they are normal. Their function is to secrete fluid onto the mucosal (inner) surface of the labia-the liplike skin surrounding the vagina. Bartholin's Cyst Causes. A Bartholin's cyst develops when the duct exiting the Bartholin's gland becomes blocked. The fluid produced by the gland then accumulates, causing the gland to swell and form a cyst."}]