[{"url": "http://www.answers.com/Q/Is_uracil_a_purine_or_a_pyrimidine", "passage_text": "In DNA, adenine and guanine are purines and thymine and cytosine are pyrimidines. In RNA, thymine is replaced by … pyrimidine uracil. 4 people found this useful. 1  A Comprehensive List of Purine-rich Foods If you suffer from gout, then you know that there are many foods you need to avoid as a result of your condition. Pyrimidines are just the 6 member ring you made in the purine. It is called a 1 3 diazine ring. Pyrimidines are the basis of the other nucleic bases in DNA and RNA called cytosine, uracil, and thymine. Pyrimidines have much lower boiling points and molecular masses than purines."}, {"url": "http://www.differencebetween.com/difference-between-purine-and-vs-pyrimidine/", "passage_text": "Cytosine, thymine, and uracil are examples for pyrimidine bases. Adenine and guanine are the two purine bases. DNA has adenine, Guanine, cytosine, and thymine bases, whereas RNA has A, G, C, and uracil (instead of thymine). In DNA and RNA, complimentary bases form hydrogen bonds between them. That is adenine: thiamine/ uracil and guanine: cytosine are complimentary to each other. They have the following structures. In nucleic acids, purine groups make hydrogen bonds with complementary pyrimidine bases. That is adenine makes hydrogen bonds with thymine and guanine makes hydrogen bonds with cytosine. IN RNA, since thymine is absent, adenine makes hydrogen bonds with uracil."}, {"url": "https://en.wikipedia.org/wiki/Purine", "passage_text": "Two of the five bases in nucleic acids, adenine (2) and guanine (3), are purines. In DNA, these bases form hydrogen bonds with their complementary pyrimidines thymine and cytosine, respectively. This is called complementary base pairing. In RNA, the complement of adenine is uracil instead of thymine. Other notable purines are hypoxanthine (4), xanthine (5), theobromine (6), caffeine (7), uric acid (8) and isoguanine (9)."}, {"url": "http://www.mayomedicallaboratories.com/test-catalog/Clinical+and+Interpretive/81420", "passage_text": "Purines (adenine, guanine, xanthine, hypoxanthine) and pyrimidines (uracil, thymine, cytosine, orotic acid) are involved in all biological processes, providing the basis for storage, transcription, and translation of genetic information as RNA and DNA. "}, {"url": "http://www.differencebetween.com/difference-between-purine-and-vs-pyrimidine/", "passage_text": "• Purine has a pyrimidine ring and an imidazole ring. • Adenine and guanine are the purine derivative present in nucleic acids whereas cytosine, uracil and thymine are the pyrimidine derivatives present in the nucleic acids. • Purines have more intermolecular interactions than pyrimidines. They have the following structures. In nucleic acids, purine groups make hydrogen bonds with complementary pyrimidine bases. That is adenine makes hydrogen bonds with thymine and guanine makes hydrogen bonds with cytosine. IN RNA, since thymine is absent, adenine makes hydrogen bonds with uracil."}, {"url": "http://www.answers.com/Q/What_are_purines_and_pyrimidines", "passage_text": "The purines are Adenine and Guanine nucleotides; while the pyrimidines are Cytosine, Thymine-and Uracil in Rna-nucleotides. They are the 'beads' that make up the immense chain of nucleotide bases in Dna. The three kinds are; thymine (DNA), Uracil (RNA), and cytosine.A purine is a double ringed base. the two kinds are; adenine and guanine. Adenine pairs with thymine in DNA or Uracil in RNA. Guanine pairs with Cytosine in both DNA and RNA. 3 people found this useful."}, {"url": "http://chemistry.umeche.maine.edu/CHY431/Basics/PurPyrm.html", "passage_text": "Purines and pyrimidines are two of the building blocks of nucleic acids. Only two purines and three pyrimidines occur widely in nucleic acids. Here are their structures in organic chemists' line notation: The Purines Adenine Guanine The Pyrimidines Cytosine Thymine Uracil. "}, {"url": "https://en.wikipedia.org/wiki/Purine", "passage_text": "A purine is a heterocyclic aromatic organic compound. It consists of a pyrimidine ring fused to an imidazole ring. Purines, which include substituted purines and their tautomers, are the most widely occurring nitrogen-containing heterocycle in nature. This is called complementary base pairing. In RNA, the complement of adenine is uracil instead of thymine. Other notable purines are hypoxanthine (4), xanthine (5), theobromine (6), caffeine (7), uric acid (8) and isoguanine (9)."}, {"url": "http://www.answers.com/Q/Is_uracil_a_purine_or_a_pyrimidine", "passage_text": "A pyrimidine is a single ringed base. The three kinds are; Cytosine, Thymine (in Dna) and Uracil (only in Rna). A purine is a double ringed base. the two kinds are; Adenine and Guanine. Adenine pairs with Thymine in Dna-or Uracil in Rna; Guanine pairs with Cytosine in both Dna and Rna. Pyrimidines are just the 6 member ring you made in the purine. It is called a 1 3 diazine ring. Pyrimidines are the basis of the other nucleic bases in DNA and RNA called cytosine, uracil, and thymine. Pyrimidines have much lower boiling points and molecular masses than purines."}, {"url": "http://www.answers.com/Q/Is_uracil_a_purine_or_a_pyrimidine", "passage_text": "The purines are Adenine and Guanine nucleotides; while the pyrimidines are Cytosine, Thymine-and Uracil in Rna-nucleotides. They are the 'beads' that make up the immense … chain of nucleotide bases in Dna. Pyrimidines are just the 6 member ring you made in the purine. It is called a 1 3 diazine ring. Pyrimidines are the basis of the other nucleic bases in DNA and RNA called cytosine, uracil, and thymine. Pyrimidines have much lower boiling points and molecular masses than purines."}]