[{"url": "http://theconsultinglife.ca/consulting-fees/", "passage_text": "Average Consulting Fees in Canada. According to the Canadian Association of Management Consultants, the average hourly rate for a certified management consultant in Canada is $200 per hour. In Canada, the management consultant fee will depend on the level of expertise required and the level of specialization the business consultant brings. The consulting engagement price will also depend on the amount of research (primary and secondary) required."}, {"url": "http://www.ieeeusa.org/business/files/2002feesurvey.pdf", "passage_text": "Regional fee surveys taken at that time. reported at $80 per hour fee (based on a small sample size), as well as average fees of. $100 and $120 per hour. In comparison, this survey’s all consultants data showed an average fee of $130 and a median fee of $100 per hour. The number of consultants charging fees in the higher ranges made the results of this survey unusual. The data show that six percent of the independent consultants charged fees of $250/hr or more. Analysis of Fee Data for All Consultants Consulting experience Minimum Maximum Count Average Median 1 to 3 years $20/hr $370/hr 94 $107hr $100/hr 3.1 to 10 years $25/hr $600/hr 177 $122/hr $100/hr 10.1 to 20 years $25/hr $2000/hr 95 $151/hr $120/hr Over 20 years $45/hr $1000/hr 30 $194/hr $150/hr 2."}, {"url": "http://consultantjournal.com/blog/setting-consulting-fee-rates", "passage_text": "I f you triple this, your consulting fee should be about $120 an hour. (Or $39.06 x 3 = $117.18, rounded to $120 per hour.). I recommend rounding up to the nearest $5 or $10 multiple, because a $78/hr or $117 fee looks odd. To set a daily rate, simply multiply the hours you work in a day by the hourly rate from the above example. 8 hours * $80 hourly rate = $640 per day. 3. Setting Consultant Fees by the Project. Some consultants set their rates by the project."}, {"url": "http://consultantjournal.com/blog/setting-consulting-fee-rates", "passage_text": "$5.72 overhead + $85.81 fee = $91.53 fee. Profit margin and consulting fees. As a consultant, you’re taking a risk and running a business. So it’s reasonable to expect a profit margin on your fees. Consultants usually mark up their fees by 10% to 33%. $91.53 + 25% mark up = $114.41. Since consultants tend to round to the nearest $5, our example results in $115 per hour rate. To set a daily rate, simply multiply the hours you work in a day by the hourly rate from the above example. 8 hours * $80 hourly rate = $640 per day. 3. Setting Consultant Fees by the Project. Some consultants set their rates by the project."}, {"url": "http://www.payscale.com/research/CA/Job=Management_Consultant/Salary", "passage_text": "Management Consultant Salary. (Canada). The average salary for a Management Consultant is C$79,040 per year. Most people move on to other jobs if they have more than 20 years' experience in this field. The highest paying skills associated with this job are Business Strategy, Change Management, and Strategy. Experience strongly influences income for this job"}, {"url": "http://gmsystems.com/uploads/3/1/4/3/3143302/consultantfeesurvey2011.pdf", "passage_text": "10 2011 Edition iEEE-USA ConSULtAntS FEE SURVEY REPoRt Consultants have an average of 15 years of experience in consulting. Further, almost a fifth (19%) have been consulting for more than 25 years. Men have more years in consulting than women, with the female average being 13 years (two less than the average). About 1 in 5 consultants (21%) charge $200 or more per hour. Median hourly wage correlates positively with number of years of experience in consulting. The rate is $117 for consultants with less than 5 years experience, and increases 28.2% to $150, for those with 25 years of experience or more."}, {"url": "http://www.brentpurves.com/marketing-consultant-rates/", "passage_text": "1 Hourly fees range from about $75 to $500, depending on the experience and background of the marketing consultant and the type of project undertaken. 2  Some consultants will agree to a flat rate, or project-based fee. 3  Again, fees will fluctuate greatly depending on the scope of work and the expertise of the consultant. The fees a consultant charges will depend on different factors including experience, duties, and the standards in the local market."}]