[{"url": "http://www.fuelourfuturenow.com/educationandtraining/how-to-become-a-neonatal-nurse/", "passage_text": "Typically, a four year Bachelor of Science in Nursing degree is the minimum requirement. An additional two year Master of Science in Nursing degree is necessary for the individual hoping to become a neonatal nurse practitioner. Becoming a neonatal nurse requires time and dedication. Many years of education and on-the-job experience make these nursing specialists much in demand by hospitals and clinics around the country. Job opportunities are expected to grow, and salaries are generally solid."}, {"url": "http://study.com/articles/Neonatal_Nurse_Educational_Requirements_for_a_Neonatal_Nursing_Career.html", "passage_text": "Bachelor's Degree Programs. Neonatal nurses first need to complete a Bachelor's of Science in Nursing (BSN) program. BSN programs usually require students to complete their non-nursing requirements in the first two years."}, {"url": "http://www.allnursingschools.com/nursing-careers/article/neonatal-nursing/", "passage_text": "1 You may also be required to complete a minimum number of years of clinical experience in a hospital setting. 2  To become a neonatal nurse practitioner (NNP), you will also need a Master of Science in Nursing (MSN) degree. Median annual salary: RN: $65,470, NNP: $105,325*. Neonatal nurses (RNs) and neonatal nurse practitioners (NNPs) may work in clinics, community-based settings, hospitals or neonatal intensive care units. They may also conduct research, act as consultants or provide education to staff and family members."}, {"url": "http://www.wikihow.com/Become-a-Neonatal-Nurse", "passage_text": "5. To become a neonatal nurse practitioner (NNP), you will also need a Master of Science in Nursing (MSN) degree. Many nursing schools offer this degree through a two-year Advanced Practice Neonatal Nursing (APNN) program. This type of program will prepare you for licensure as a Nurse Practitioner (NP) and/or Clinical Nurse Specialist (CNS). 1 A neonatal nurse must be a registered nurse (RN) with a four-year bachelor of science in nursing degree (BSN). 2  Try to maintain a grade point average above a 3.0 in college to set yourself up for desirable nursing programs."}, {"url": "http://www.learnhowtobecome.org/nurse/neonatal-nurse/", "passage_text": "A small bump in education could translate to a serious bump in pay for neonatal nurses. According to Payscale, neonatal nurses made a median salary of $59,598, while neonatal nurse practitioners earned $92,259. Neonatal nurses work primarily with infants less than one month old, though they might work with children up to toddlerhood. Many of their patients are transferred to the NICU due to premature birth or significant medical conditions."}, {"url": "http://www.allnursingschools.com/nursing-careers/article/neonatal-nursing/", "passage_text": "Neonatal Nurse Specialist Education. Entry-level requirements vary by location. At a minimum, you need to meet these requirements: 1  A neonatal nurse must be a registered nurse (RN) with a four-year Bachelor of Science in Nursing Degree (BSN). Median annual salary: RN: $65,470, NNP: $105,325*. Neonatal nurses (RNs) and neonatal nurse practitioners (NNPs) may work in clinics, community-based settings, hospitals or neonatal intensive care units. They may also conduct research, act as consultants or provide education to staff and family members."}, {"url": "http://neonatalnurse.org/", "passage_text": "A neonatal nurse must be a registered nurse (RN) with a four-year bachelor of science in nursing degree (BSN). You must be certified in Neonatal Resuscitation and/or Neonatal Intensive Care Nursing. You may also be required to complete a minimum number of years of clinical experience in a hospital setting. To become a neonatal nurse practitioner (NNP), you will also need a Master of Science in Nursing (MSN) degree. Many nursing schools offer this degree through a two-year Advanced Practice Neonatal Nursing (APNN) program. "}, {"url": "http://www.allnursingschools.com/nursing-careers/article/neonatal-nursing/", "passage_text": "1 To become a neonatal nurse practitioner (NNP), you will also need a Master of Science in Nursing (MSN) degree. 2  Many neonatal nursing schools offer this degree through a two-year Advanced Practice Neonatal Nursing (APNN) program. Median annual salary: RN: $65,470, NNP: $105,325*. Neonatal nurses (RNs) and neonatal nurse practitioners (NNPs) may work in clinics, community-based settings, hospitals or neonatal intensive care units. They may also conduct research, act as consultants or provide education to staff and family members."}, {"url": "http://www.allnursingschools.com/nursing-careers/article/neonatal-nursing/", "passage_text": "1 You must be certified in Neonatal Resuscitation and/or Neonatal Intensive Care Nursing. 2  You may also be required to complete a minimum number of years of clinical experience in a hospital setting. 3  To become a neonatal nurse practitioner (NNP), you will also need a Master of Science in Nursing (MSN) degree. Median annual salary: RN: $65,470, NNP: $105,325*. Neonatal nurses (RNs) and neonatal nurse practitioners (NNPs) may work in clinics, community-based settings, hospitals or neonatal intensive care units. They may also conduct research, act as consultants or provide education to staff and family members."}]