[{"url": "http://english.stackexchange.com/questions/25578/meaning-of-sup-my-homeslice-harvard-jv-field-hockey-is-da-bomb", "passage_text": "1. I think you've nailed the original meaning of homeslice, but it might be worth noting to the OP that it probably hasn't been used in that context in quite some time. Now it seems it's just a silly term thrown about among friends. – HaL May 16 '11 at 14:27. 1 sup is an interjection that is quicker to write but basically means the same as what's up (last three letters). 2  da is a colloquial phonetic spelling of the. 3  homslice is a slang for buddy, pal, mate. 4  Harvard jv stands for Harvard Junior Varsity."}, {"url": "http://www.answers.com/Q/What_does_homeslice_mean", "passage_text": "exists and is an alternate of. Merge this question into. Split and merge into it. Answer by Nirel Matsil. Confidence votes 19.6K. Homeslice is a slang term meaning 'good friend,' usually used as a term of endearment. …  They're is a contraction or shortening of 'they are'.     The homophone of there/their/they're      There refers to some place.   Their  is the possessive pronoun of them or themselves. "}, {"url": "http://english.stackexchange.com/questions/25578/meaning-of-sup-my-homeslice-harvard-jv-field-hockey-is-da-bomb", "passage_text": "The Harvard Junior Varsity Field Hockey team is the bomb! 1  sup is an interjection that is quicker to write but basically means the same as what's up (last three letters). 2  da is a colloquial phonetic spelling of the. 3  homslice is a slang for buddy, pal, mate. 4  Harvard jv stands for Harvard Junior Varsity. 1"}, {"url": "https://answers.yahoo.com/question/index?qid=1006050410580", "passage_text": "my friends keep say  hey whats up homeslice  what does that mean!! and what does it mean when someone wants to see your gravy? So they began cuttin' them up! and everytime they would, they would say! HOMESLICE! instead of TIMBER!!!. As for Gravy check this out and choose the meaning that fits most http://www.urbandictionary.com/define.ph... Source(s): Dr Addo · 10 years ago."}, {"url": "http://onlineslangdictionary.com/meaning-definition-of/home-slice", "passage_text": "Link to this slang definition. To link to this term in a web page or blog, insert the following. To link to this term in a wiki such as Wikipedia, insert the following. Some wikis use a different format for links, so be sure to check the documentation."}, {"url": "https://answers.yahoo.com/question/index?qid=1006050410580", "passage_text": "Rating Newest Oldest. Best Answer: Homeslice: Buddy, Bestfriend The history behind the intrepid word goes as follows; Lumberjacks in the 1850s were wondering around the west, immensely bored, and found some indians'(not the thank you come again kind, but the wo! wo! kind.) homes. So they began cuttin' them up! and everytime they would, they would say! HOMESLICE! instead of TIMBER!!!. As for Gravy check this out and choose the meaning that fits most http://www.urbandictionary.com/define.ph... Source(s): Dr Addo · 10 years ago."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080327150648AAv8FDF", "passage_text": "What does it mean when someone calls you a 'home slice'? Update: oooo someone got out of the wrong side of the cardboard box and used their personality as a contraceptive. "}, {"url": "https://en.wikipedia.org/wiki/Homie", "passage_text": "Homie (from  homeboy ) is an English language slang term found in American urban culture, whose origins etymologists generally trace to Mexican American Spanglish from the late 19th century, with the word homeboy meaning a male friend from back home. "}, {"url": "https://answers.yahoo.com/question/index?qid=20061204104925AA8ez8z", "passage_text": "Rating Newest Oldest. Best Answer: 1. home slice: synonomous to homie. def 1: means good friend or buddy def 2: means someone who seems like a little slice of home, thus home slice. Hey whassup home slice. 2.Someone who is an over the top dork. Someone who is trying way too hard to be cool and fails miserably"}]