[{"url": "http://www.mtgprofessor.com/A%20-%20Predatory%20Lending/what_is_predatory_lending.htm", "passage_text": "In cases of predatory lending, over-charges are offensively large, often associated with steering into inappropriate mortgage types, and sometimes associated with refinances that make the borrower poorer. The result is a significant adverse impact on the borrower’s life."}, {"url": "http://www.dfi.wa.gov/financial-education/information/predatory-lending", "passage_text": "Predatory Lending. Lending and mortgage origination practices become predatory when the borrower is led into a transaction that is not what they expected. Predatory lending practices may involve lenders, mortgage brokers, real estate brokers, attorneys, and home improvement contractors."}, {"url": "http://www.investopedia.com/terms/p/predatory_lending.asp", "passage_text": "DEFINITION of 'Predatory Lending'. Unscrupulous actions carried out by a lender to entice, induce and/or assist a borrower in taking a mortgage that carries high fees, a high interest rate, strips the borrower of equity, or places the borrower in a lower credit rated loan to the benefit of the lender."}, {"url": "https://www.debt.org/credit/predatory-lending/", "passage_text": "Predatory lending is any lending practice that imposes unfair or abusive loan terms on a borrower. It is also any practice that convinces a borrower to accept unfair terms through deceptive, coercive, exploitative or unscrupulous actions for a loan that a borrower doesn’t need, doesn’t want or can’t afford."}, {"url": "http://www.businessnewsdaily.com/4348-predatory-lending.html", "passage_text": "Predatory lending is when money lenders use unfair, deceptive or fraudulent practices to entice borrowers, typically those most in need of cash, into taking a loan from them, whether it be for homes, cars or everyday expenses."}, {"url": "http://www.mtgprofessor.com/A%20-%20Predatory%20Lending/what_is_predatory_lending.htm", "passage_text": "Mortgage lending is predatory when it has a significant adverse impact on a borrower s life, either because the loan is inappropriate to the borrower s situation, is grossly over-priced, or both."}, {"url": "http://www.ag.ny.gov/consumer-frauds/predatory-lending", "passage_text": "Predatory lending is a term commonly used to describe certain unfair and deceptive practices engaged in by unscrupulous merchants in the mortgage lending and consumer finance industries."}, {"url": "https://en.wikipedia.org/wiki/Predatory_lending", "passage_text": "Predatory lending is the unfair, deceptive, or fraudulent practices of some lenders during the loan origination process."}, {"url": "http://www.mhcdo.org/index.php/predatory-lending2", "passage_text": "Predatory lending is a term used to describe the abusive practices of a lender who pressures or deceives a borrower to take on a debt that is beyond his/her ability to repay."}]