[{"url": "https://answers.yahoo.com/question/index?qid=20130603102635AA9S0Hs", "passage_text": "Report Abuse. Spitz may be used in the general sense as a term for a group of related or similar breeds-the Akita is a spitz, so is the Siberian Husky, the Pomeranian, and the Jindo. It is most often used, though, as a shortened version of the breed name German Spitz. A spitz is a group of breeds in which the American Eskimo is apart of. If you mean the difference between a German spitz or Japanese spitz and an American Eskimo, they are different individual breeds. Misfit Rebelz · 2 years ago. Thumbs up."}, {"url": "https://en.wikipedia.org/wiki/German_Spitz", "passage_text": "The Japanese Spitz, also bred from the German Spitz, is very similar to the Spitz Klein but is limited to the white colour and has a different breed history. The Zwergspitz, the Pomeranian, is also registered as a separate breed in the UK and North America. All the German Spitz type dogs are dogs of the Spitz type of German origin."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20101211035147AAhayFO", "passage_text": "I know that the Japanese Spitz only comes in White and that the German Spitz comes in various colours. There really isn't much difference unless you're looking for very subtle differences. So unless you're a breeder, cynologist, or dog showperson, it really doesn't matter. All Spitz are generally the same. German Spitz can also be a category of dog as opposed to a single breed. If you really want in-depth information, I would suggest going to www.AKC.com and searching for those breeds, looking them up on Wikipedia, or flipping through Dogalog (dog encyclopedia)"}, {"url": "http://plushpuppyusa.com/page.php?tpg=QU_GERMANSPITZ", "passage_text": "Show day for both the German and Japanese Spitz, brush up using a dilution of Plush Puppy OMG Grooming Spray the concentrate version diluted 30:1 i.e. 30 parts water to one part OMG. You can dilute as much as 40:1. Brush through using Plush Puppy Pin Brush either regular pins or long pins. Wrong! If you are to show this breed and the Japanese Spitz each week, you need to have a full coat not one halfway there and the quickest and best way is to get that dead hair out and fast! No amount of brushing will remove it fully or as well as my routine I use. That is to bath, oil and blow dry."}, {"url": "http://www.differencebetween.com/difference-between-german-spitz-and-vs-pomeranian/", "passage_text": "German Spitz. German Spitz is usually referred as a breed of dog and type of dog, because several modern breeds have been developed from the German Spitz. They originated in Germany as their name indicates."}, {"url": "http://www.differencebetween.com/difference-between-german-spitz-and-vs-pomeranian/", "passage_text": "Pomeranian. Pomeranian is a popular Spitz dog and their country of origin is Germany. They descend from the famous German Spitz breed. Pomeranians are small and according to the classification of dogs, Pomeranians come under toy dogs, considering its size. Their average weight is about 1.9 – 3.5 kilograms, and they have a height ranging from 13 to 28 centimetres at withers. German Spitz is usually referred as a breed of dog and type of dog, because several modern breeds have been developed from the German Spitz. They originated in Germany as their name indicates."}, {"url": "https://answers.yahoo.com/question/index?qid=20130603102635AA9S0Hs", "passage_text": "Rating Newest Oldest. A spitz is a group of breeds in which the American Eskimo is apart of. If you mean the difference between a German spitz or Japanese spitz and an American Eskimo, they are different individual breeds. Misfit Rebelz · 2 years ago. Thumbs up."}, {"url": "http://www.russiandog.net/differences-between-american-eskimo-dog-japanese-spitz-and-samoyed.html", "passage_text": "Answer by Chelan. Actually, the American Eskimo and the Japanese Spitz is actually the SAME. When German immigrants brought the dogs to the Americas, U.S. and Canadian fanciers particularly chose the smaller, mid size, and the white dogs as favored varieties. "}, {"url": "https://au.answers.yahoo.com/question/index?qid=20101211035147AAhayFO", "passage_text": "Best Answer: Here are the breed standards, you can see for yourself. An important note is that the German Spitz comes in multiple sizes that are treated as separate breeds in most countries. http://www.thekennelclub.org.uk/item/164 http://www.thekennelclub.org.uk/item/161. There really isn't much difference unless you're looking for very subtle differences. So unless you're a breeder, cynologist, or dog showperson, it really doesn't matter. All Spitz are generally the same. German Spitz can also be a category of dog as opposed to a single breed. If you really want in-depth information, I would suggest going to www.AKC.com and searching for those breeds, looking them up on Wikipedia, or flipping through Dogalog (dog encyclopedia)"}]