[{"url": "http://finance.mapsofworld.com/economy/kiribati/currency.html", "passage_text": "1 US dollar is equal to the value of 1.9619 Australian dollars or currency of Kiribati. Australian Dollar as the Kiribati currency, is manufactured in the Royal Australian Mint and regulated in Kiribati Island by the Reserve Bank of Australia. The inflation rate of this currency is about 0.5%. Australian dollar is the official Kiribati currency. It is pegged intrinsically to the Australian dollar (AUD). The ISO international currency code of Kiribati currency is KIR. The currency of Kiribati, however, is not independent money but pegged at 1:1 ratio to the Australian dollar. With respect to money in Kiribati, paper notes were more prevalent until 1979, when coins were issued and circulated along with the coins and banknotes of the Australian dollar"}, {"url": "https://en.wikipedia.org/wiki/Kiribati_dollar", "passage_text": "Kiribati's first coins were introduced in 1979 following independence and were directly pegged to the Australian dollar. The coins were issued in denominations of 1, 2, 5, 10, 20 and 50 cents, and 1 dollar. The Kiribati $2 piece is round and much larger than the Australia's comparatively tiny $2 piece, with the same circumference of the 20 cent coin and a thickness similar to the British 1 Pound coin."}, {"url": "http://www.einfopedia.com/currency-of-kiribati.php", "passage_text": "The currency of Kiribati is dollar and international ISO code of Kiribati currency is KIR. It is totally dependent on Australian dollar and sometimes the AUD is also termed as the currency of Kiribati. Kiribati was British owned state and it got independence on 1 October 1975 but it was named as the state of Tuvalu. The denominations of these coins are 1, 2, 5, 10, 20 and 50 cents and 1 dollar. These are made up of bronze and cupro-nickel material, which is similar to the Australian currency coins. In addition, their size, composition and structure also resemble the state of Australian dollar."}, {"url": "https://en.wikipedia.org/wiki/Kiribati_dollar", "passage_text": "In 1989, nickel-brass 2 dollar coins were introduced coinciding with Kiribati's tenth anniversary of independence, and followed Australia's issuance of its 2 dollar coin and withdrawal of the 2 dollar note in 1988. The Kiribati $2 piece is round and much larger than the Australia's comparatively tiny $2 piece, with the same circumference of the 20 cent coin and a thickness similar to the British 1 Pound coin."}, {"url": "http://www.exchangerate.com/currency-information/kiribati-dollar.html", "passage_text": "The Australian dollar (sign: $; code: AUD) is the currency of the Commonwealth of Australia, including Christmas Island, Cocos (Keeling) Islands, and Norfolk Island, as well as the independent Pacific Island states of Kiribati, Nauru and Tuvalu. It is subdivided into 100 cents. The Australian dollar is currently the sixth-most-traded currency in the world foreign exchange markets behind the US dollar, the euro, the yen, the pound sterling, and the Swiss franc, accounting in 2007 for approx. 3.3% of worldwide daily foreign-exchange turnover."}, {"url": "http://finance.mapsofworld.com/economy/kiribati/currency.html", "passage_text": "Kiribati Currency. Australian dollar is the official Kiribati currency. It is pegged intrinsically to the Australian dollar (AUD). The ISO international currency code of Kiribati currency is KIR. The currency of Kiribati, however, is not independent money but pegged at 1:1 ratio to the Australian dollar. With respect to money in Kiribati, paper notes were more prevalent until 1979, when coins were issued and circulated along with the coins and banknotes of the Australian dollar"}, {"url": "http://forums.whirlpool.net.au/archive/1946748", "passage_text": "While Kiribati has had their own coins and notes in the past the official currency in Kiribati is the Aussie dollar. (*2) so even if you purchased a $10 coin and donate it to the needy in Kiribati I see no evidence that they would even be able to exchange it for $10 worth of groceries. The offer is for a Kiribati coin, legal tender in Kiribati for $10 of their dollars. Their dollar is pegged 1:1 to ours. The price is AUD$10, which is $10 Kiribati dollars."}, {"url": "http://www.exchangerates.org.uk/countries/122/money-transfer-to-kiribati.html", "passage_text": "Currency in Kiribati: There is 1 official currency of Kiribati. The Australian Dollar which has the ISO of AUD (see Australian Dollar exchange rate) . Top 10 Money Transfers to Kiribati on website popularity: Below we show the top 10 most popular currency conversions for sending money abroad... Compare Money Transfers to Kiribati. If you need to transfer money to Kiribati from the UK or any other country worldwide, Exchange Rates UK provides you with the latest Australian Dollar exchange rate comparison."}, {"url": "https://en.wikipedia.org/wiki/Kiribati_dollar", "passage_text": "The dollar is the currency of Kiribati. It is pegged at 1:1 ratio to the Australian dollar. Coins were issued in 1979 and circulate alongside banknotes and coins of the Australian dollar. The Kiribati $2 piece is round and much larger than the Australia's comparatively tiny $2 piece, with the same circumference of the 20 cent coin and a thickness similar to the British 1 Pound coin."}]