[{"url": "http://www.city-data.com/city/Burke-Virginia.html", "passage_text": "11.5%. According to our research of Virginia and other state lists there were 14 registered sex offenders living in Burke, Virginia as of October 08, 2015. The ratio of number of residents in Burke to the number of sex offenders is 2,933 to 1. Latest news from Burke, VA collected exclusively by city-data.com from local newspapers, TV, and radio stations. Ancestries: German (12.0%), Irish (8.9%), English (8.7%), Italian (7.4%), United States (3.4%), Polish (3.1%). Current Local Time: EST time zone. Elevation: 255 feet. Land area: 11.5 square miles."}, {"url": "http://www.apartments.com/burke-va/", "passage_text": "Apartments for Rent in Burke, VA. You searched for apartments in Burke, VA. Let Apartments.com help you find the perfect rental near you. Click to view any of these 32 available rental units in Burke to see photos, reviews, floor plans and verified information about schools, neighborhoods, unit availability and more. Apartments.com has the most extensive inventory of any apartment search site, with over 149 thousand currently available apartments for rent. You can trust Apartments.com to find your next Burke rental."}, {"url": "https://en.wikipedia.org/wiki/Burke,_Virginia", "passage_text": "The area of Fairfax County known as Burke is named for Silas Burke (1796–1854), a 19th-century farmer, merchant, and local politician who built a house on a hill overlooking the valley of Pohick Creek in approximately 1824. As of the census of 2000, there were 57,737 people, 19,215 households, and 15,756 families residing in the community. Burke is the largest community in Virginia recognized by the Census Bureau, other than counties and incorporated cities (although 11 cities and Arlington, Virginia have greater populations)."}, {"url": "http://www.virginia.org/Cities/Burke/", "passage_text": "Burke. Discover things to do, places to stay, and where to dine in Burke. Use the links above to find area events, an interactive map of what’s nearby and great deals and packages. 1  Region: Northern Virginia. 2  Locality Fairfax. 3  Visit Fairfax. 4  7927 Jones Branch Drive. 5  McLean, VA, 22102"}, {"url": "http://www.greatschools.org/virginia/burke/3069-Burke-School/", "passage_text": "ALC at Burke Burke, VA | Public district | Ungraded White Oaks Elementary School Burke, VA | Public district | PK-6 Nativity Catholic School Burke, VA | Private | PK-8 Terra Centre Elementary School Burke, VA | Public district | PK-6 Cherry Run Elementary School Burke, VA | Public district | PK-6 See more schools. "}, {"url": "http://www.topix.com/city/burke-va", "passage_text": "Local news for Burke, VA continually updated from thousands of sources on the web. "}, {"url": "https://en.wikipedia.org/wiki/Burke,_Virginia", "passage_text": "Burke is a census-designated place (CDP) in Fairfax County, Virginia, United States. As of the 2000 census, Burke had a total population of 57,737. Before 2010, the CDP was divided, with a portion of it becoming Burke Centre CDP; the population remaining in the Burke CDP was reported at 41,055 in the 2010 census. As of the census of 2000, there were 57,737 people, 19,215 households, and 15,756 families residing in the community. Burke is the largest community in Virginia recognized by the Census Bureau, other than counties and incorporated cities (although 11 cities and Arlington, Virginia have greater populations)."}]