[{"url": "http://www.bakersfieldpoolplastering.com/menus/Plaster-Start-Up-Dos-and-Donts.html&pId=93", "passage_text": "The main objective in a pool start-up is to clear or get rid of the plaster dust, and to balance and stabilize the water chemistry in the pool as soon as possible. The first 30 days of plaster curing are the most critical. The need for proper water chemistry and maintenance continues for the life of the pool. "}, {"url": "http://blog.poolcenter.com/article.aspx?articleid=6175", "passage_text": "4. Acid Start the Pool: The Acid Start procedure is a method of lowering the Total Alkalinity level in the pool to near 0.0, so that the water will absorb the plaster dust. It also helps to cure the plaster fast. My process for this is to add 1 gallon of Muriatic Acid for every 5,000 gallons of water. You can add the acid as the pool fills, just be sure to wait until you have at least 5,000 gals in the pool, and be careful not to splash any acid directly on the plaster walls or floor. "}, {"url": "http://www.poolcenter.com/plaster3", "passage_text": "Here's how I do it. As the pool is filling, immediately after plastering, add 1 gallon of muriatic acid directly to the water (don't splash it on the bare plaster) per 5,000 gallons of fill water. With a watch, time the amount of time it takes to fill up a 1 gallon or 5 gallon bucket with the hose(s) used to fill up the pool. "}, {"url": "http://arturospoolplastering.com/faq.html", "passage_text": "PLASTER IS LONG LASTING: The secret to long life of any pool surface is properly maintained water balance. Improper water balance will destroy any pool surface and in many cases, void the warranty of that surface. A plaster surface, in a properly maintained pool, can last 15 to 25 years. A. PLASTER IS A TIME TESTED PRODUCT: Plaster has been used as a swimming pool surface coating for the past 50 years. This experience has shown that plaster is a durable surface that can stand up to the environment of proper pool water chemistry."}, {"url": "http://ths.gardenweb.com/discussions/2538294/swimming-after-plaster-timeframe", "passage_text": "My A&S pool is filling as I type and we will have our start up meeting tomorrow or the next day. We have been told by our PB that the proper protocol is 2 full weeks of brushing the plaster and then 2 weeks of chemical balancing-totalling approx. 28 days. before we can swim in it. l1234. Swim at will, but -- at start-up it is best to delay chlorination for as long as possible and than keep it low. Heavy use of the pool may make chlorination more important. ALso a lot depends on what type of stratup was done: accid or alkali start."}, {"url": "http://www.troublefreepool.com/content/154-start-up-new-pool-plaster", "passage_text": "1 Make sure to brush the entire plaster surface. 2  Brush from the top of the walls down and from the shallow to the deep end to knock off any loose plaster dust. 3  Do not SLAM (or shock) the pool during the first 30 days. 4  If you have a SWG, do NOT add salt, or turn on the SWG, until 30 days after the plaster was applied. 1 Brush from the top of the walls down and from the shallow to the deep end to knock off any loose plaster dust. 2  Do not SLAM (or shock) the pool during the first 30 days. 3  If you have a SWG, do NOT add salt, or turn on the SWG, until 30 days after the plaster was applied."}, {"url": "http://www.troublefreepool.com/content/154-start-up-new-pool-plaster", "passage_text": "1 Do not SLAM (or shock) the pool during the first 30 days. 2  If you have a SWG, do NOT add salt, or turn on the SWG, until 30 days after the plaster was applied. 3  Do not use any automated cleaning system, buit-in or robotic, during the first three weeks. 1 Brush from the top of the walls down and from the shallow to the deep end to knock off any loose plaster dust. 2  Do not SLAM (or shock) the pool during the first 30 days. 3  If you have a SWG, do NOT add salt, or turn on the SWG, until 30 days after the plaster was applied."}, {"url": "http://www.reyespoolplastering.com/FAQ.html", "passage_text": "4. PLASTER IS LONG LASTING: The secret to long life of any pool surface is properly maintained water balance. Improper water balance will destroy any pool surface and in many cases, void the warranty of that surface. A plaster surface, in a properly maintained pool, can last 15 to 25 years. The pool plaster industry has come a long way from the white only. Although white plaster is still the most popular, we offer 6 different swimming pool plaster finishes in over 50 different colors. We can also do custom colors, to match other popular pool plaster finishes."}]