[{"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001467/", "passage_text": "Autoimmune Disease. Disease that results when the immune system mistakenly attacks the body's own tissues. Examples include multiple sclerosis, type 1 diabetes, rheumatoid arthritis, and systemic lupus erythematosus. Inflammation. Redness, swelling, pain, and/or a feeling of heat in an area of the body."}, {"url": "http://www.everydayhealth.com/arthritis/understanding/the-immune-system.aspx", "passage_text": "Your immune system is your body's defense against all kinds of germs and diseases — but with certain types of arthritis, the same system that's meant to protect you can also play a role in the development of the disease."}, {"url": "http://pennstatehershey.adam.com/content.aspx?productId=10&pid=10&gid=000048", "passage_text": "Rheumatoid arthritis (RA) is an autoimmune disease in which the body's immune system attacks joints and other tissues. The pattern of joints affected is usually on both sides, involves the hands and other joints, and is worse in the morning."}, {"url": "http://www.curearthritis.org/rheumatoid-arthritis-research/", "passage_text": "Researchers are working to understand what causes rheumatoid arthritis. Rheumatoid arthritis (RA) is a complex disease in which the patient’s immune system attacks its own tissue causing swelling and inflammation in the joints and damage of tissues and other organs."}, {"url": "http://www.webmd.com/rheumatoid-arthritis/features/autoimmune-disease-and-ra", "passage_text": "When you have an autoimmune disease a similar thing happens. But the results aren’t so good. Something causes your immune system to mistake your own cells, tissues, or organs as the bad guys. So it fights them. With RA it attacks your joints and their lining, called synovium."}, {"url": "http://umm.edu/health/medical/reports/articles/rheumatoid-arthritis", "passage_text": "Introduction. Rheumatoid arthritis (RA) is a chronic disease in which various joints in the body are inflamed, leading to swelling, pain, stiffness, and the possible loss of function. Rheumatoid arthritis is an autoimmune disease in which the body's immune system attacks joints and other tissues. The pattern of joints affected is usually symmetrical, involves the hands and other joints, and is worse in the morning."}, {"url": "http://www.everydayhealth.com/arthritis/understanding/the-immune-system.aspx", "passage_text": "The types of arthritis related to your immune system include: 1  Rheumatoid arthritis. 2  Not much is known about how or why this autoimmune disease strikes. 3  The body's immune system attacks itself, resulting in a lifelong condition that may start with symptom-free periods and flare-ups that get progressively worse over time."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=85&ContentID=P01133", "passage_text": "The exact cause of rheumatoid arthritis is not known. Rheumatoid arthritis is an autoimmune disorder, which means the body's immune system attacks its own healthy cells and tissues. The response of the body causes inflammation in and around the joints, which then may lead to a destruction of the skeletal system."}]