[{"url": "https://en.wikipedia.org/wiki/Toxic_Waste_(confectionery)", "passage_text": "Production and distribution [edit]. Some Toxic Waste products have a hard, sour exterior and a sour liquid filling. Toxic Waste candy products are made in Mexico, Pakistan and Turkey. The product is distributed in the United States, United Kingdom, Europe, Canada, South Africa and other countries"}, {"url": "http://environment.nationalgeographic.com/environment/global-warming/toxic-waste-overview/", "passage_text": "A common hazardous waste facility is one that stores the waste in sealed containers in the ground. Less toxic waste that is unlikely to migrate, like soil with lead, is sometimes allowed to remain in place under the ground and then be sealed with a cap of hard clay. Substances that are not on the list but are toxic are also considered hazardous waste and subject to EPA’s rules. The Superfund Act contains rules about cleaning up hazardous waste that was dumped illegally."}, {"url": "http://www.wisegeek.com/what-is-toxic-waste.htm", "passage_text": "Toxic waste is a type of waste that can be hazardous to humans, other living creatures, and plants. The various types of waste materials that fall under this heading can pollute the environment and threaten life in a number of ways. They can be found not only on land, but also in the air and water. Some types of hazardous waste cause cancer, for example, or lead to the development of birth defects; plant and animal life may also face death when exposed to some types of waste. Radioactive waste is one type of toxic waste."}, {"url": "https://en.wikipedia.org/wiki/Toxic_waste", "passage_text": "Toxic waste is waste material that can cause death, injury or birth defects to living creatures. It spreads quite easily and can contaminate lakes, rivers, and the atmosphere. The term is often used interchangeably with “ hazardous waste ”, or discarded material that can pose a long-term risk to health or environment. Hazardous wastes are poisonous byproducts of manufacturing, farming, city septic systems, construction, automotive garages, laboratories, hospitals and other industri"}, {"url": "https://en.wikipedia.org/wiki/Toxic_waste", "passage_text": "The waste may be liquid, solid, or sludge and contain chemicals, heavy metals, radiation, dangerous pathogens, or other toxins. Even households generate hazardous waste from items such as batteries, used computer equipment, and leftover paints or pesticides. It spreads quite easily and can contaminate lakes, rivers, and the atmosphere. The term is often used interchangeably with “ hazardous waste ”, or discarded material that can pose a long-term risk to health or environment."}, {"url": "http://environment.nationalgeographic.com/environment/global-warming/toxic-waste-overview/", "passage_text": "Hazardous wastes are poisonous byproducts of manufacturing, farming, city septic systems, construction, automotive garages, laboratories, hospitals, and other industries. The waste may be liquid, solid, or sludge and contain chemicals, heavy metals, radiation, dangerous pathogens, or other toxins. Substances that are not on the list but are toxic are also considered hazardous waste and subject to EPA’s rules. The Superfund Act contains rules about cleaning up hazardous waste that was dumped illegally."}, {"url": "http://www.wisegeek.com/what-is-toxic-waste.htm", "passage_text": "When people are exposed to toxic waste, they may become ill or die. Some types of hazardous waste cause cancer, for example, or lead to the development of birth defects; plant and animal life may also face death when exposed to some types of waste. Radioactive waste is one type of toxic waste. It is produced as a byproduct of other processes, including, but not limited to, those that involve the generation of power. Medical waste is another type of hazardous wast"}, {"url": "http://www.businessdictionary.com/definition/toxic-waste.html", "passage_text": "Definition. Discharge or byproducts of industrial processes, such as cyanide compounds, chlorinated compounds, and heavy metals, known to cause serious injury to animals, humans, and plats if disposed of indiscriminately in the environment. See also hazardous waste. "}, {"url": "http://www.infoplease.com/encyclopedia/science/toxic-waste.html", "passage_text": "Toxic waste treatment and control has proved to be expensive and time-consuming with more resources spent on court battles than on actual cleanup. The disposal of toxic wastes is also a topic of international concern. In 1989, some 50 countries signed a treaty aimed at regulating the international shipment of toxic wastes. In some cases such wastes are shipped to developing countries for cheap disposal without the informed consent of their governments."}]