[{"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_pre_2011/chemicals/rocksmineralsrev3.shtml", "passage_text": "These properties result from the very strong covalent bonds that hold the silicon and oxygen atoms in the giant covalent structure. Silicon dioxide is found as quartz in granite, and is the major compound in sandstone. The sand on a beach is made mostly of silicon dioxide. Page: 1  1. 2  2. 3  3. 4  4. Each silicon atom is covalently bonded to four oxygen atoms. Each oxygen atom is covalently bonded to two silicon atoms. This means that, overall, the ratio is two oxygen atoms to each silicon atom, giving the formula SiO 2. Silicon dioxide is very hard."}, {"url": "https://en.wikipedia.org/wiki/Silicon_dioxide", "passage_text": "Silicon dioxide, also known as silica (from the Latin silex), is a chemical compound that is an oxide of silicon with the chemical formula Si O 2. It has been known since ancient times. Silica is most commonly found in nature as quartz, as well as in various living organisms. In dimeric silicon dioxide there are two oxygen atoms bridging between the silicon atoms with an Si-O-Si angle of 94° and bond length of 164.6 pm and the terminal Si-O bond length is 150.2 pm."}, {"url": "http://www.answers.com/Q/Why_silicon_is_more_suitable_in_IC_fabrication", "passage_text": "Silicon dioxide is suitable for lining furnaces because of its very  high melting point of 1,600 to 1,725 degrees celcius. It is so high  because of the strong intermolecula … r forces between SiO2  molecules in the giant covalent structure comparable to that of  diamond and graphite. A large amount of energy is required to  overcome these intermolecular forces and thus SiO2 has a  high melting point. silicon dioxide is so important in fabrication process because it exhibits good thermal isolation and also having low thermal conductivity and more it has low thermal expansio … n coefficient."}, {"url": "http://filestore.aqa.org.uk/subjects/AQA-CH2HP-QP-JAN13.PDF", "passage_text": "The diagram shows a small part of the structure of silicon dioxide.Oxygen atom Key Silicon atom Explain why silicon dioxide is a suitable material for lining furnaces. .............................................................................................................................. The membrane must be replaced every 3 years. Amount of electricity used for each tonne of chlorine produced in kWh 3400 2950 Quality of chlorine produced Pure Needs to be liquefied and distilled to make it pure. Quality of sodium hydroxide solution produced 50% concentration."}, {"url": "http://www.answers.com/Q/Why_is_silicon_dioxide_a_suitable_material_for_lining_furnaces", "passage_text": "The chemical compound silicon dioxide, also known as silica (from the Latin silex), is an oxide of silicon with the chemical formula SiO2. It has been known for its hardness s … ince antiquity. A large amount of energy is required to overcome these intermolecular forces and thus SiO2 has a high melting point. Note: no silicon-oxygen bonds are broken during melting, just intermolecular forces between SiO2 molecules."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_pre_2011/chemicals/rocksmineralsrev3.shtml", "passage_text": "Silicon dioxide. Much of the silicon and oxygen in the Earth’s crust is present as the compound silicon dioxide also known as silica. Silicon dioxide has a giant covalent structure. Part of this structure is shown in the diagram-oxygen atoms are shown as red, silicon atoms shown as brown: Each silicon atom is covalently bonded to four oxygen atoms. Each oxygen atom is covalently bonded to two silicon atoms. This means that, overall, the ratio is two oxygen atoms to each silicon atom, giving the formula SiO 2. Silicon dioxide is very hard."}, {"url": "https://en.wikipedia.org/wiki/Silicon_dioxide", "passage_text": "The solubility of silicon dioxide in water strongly depends on its crystalline form and is 3–4 times higher for silica than quartz; as a function of temperature, it peaks at about 340 °C. In dimeric silicon dioxide there are two oxygen atoms bridging between the silicon atoms with an Si-O-Si angle of 94° and bond length of 164.6 pm and the terminal Si-O bond length is 150.2 pm."}, {"url": "http://www.answers.com/Q/Why_is_silicon_dioxide_a_suitable_material_for_lining_furnaces", "passage_text": "Chemical compounds and the reactions they undergo are my areas of knowledge and interest. Silicon dioxide is suitable for lining furnaces because of its very high melting point of 1,600 to 1,725 degrees celcius. It is so high because of the strong intermolecular forces between SiO2 molecules in the giant covalent structure comparable to that of diamond and graphite. A large amount of energy is required to overcome these intermolecular forces and thus SiO2 has a high melting point. Note: no silicon-oxygen bonds are broken during melting, just intermolecular forces between SiO2 molecules."}, {"url": "http://schools-wikipedia.org/wp/s/Silicon_dioxide.htm", "passage_text": "The chemical compound silicon dioxide, also known as silica or silox (from the Latin  silex), is the oxide of silicon, chemical formula Si O 2, and has been known for its hardness since the 9th century. Silica is most commonly found in nature as sand or quartz, as well as in the cell walls of diatoms. Silicon dioxide is attacked by hydrofluoric acid (HF). HF is used to remove or pattern silicon dioxide in the semiconductor industry. Wikipedia for Schools is a selection taken from the original English-language Wikipedia by the child sponsorship charity SOS Children."}]