[{"url": "http://www.webmd.com/brain/vertigo-symptoms-causes-treatment", "passage_text": "Causes of Vertigo. Vertigo is often caused by an inner ear problem. Some of the most common causes include: BPPV. These initials stand for benign paroxysmal positional vertigo. BPPV occurs when tiny calcium particles (canaliths) clump up in canals of the inner ear. Meniere's disease. This is an inner ear disorder thought to be caused by a buildup of fluid and changing pressure in the ear. It can cause episodes of vertigo along with ringing in the ears (tinnitus) and hearing loss. Vestibular neuritis or labyrinthitis. This is an inner ear problem usually related to infection (usually viral)"}, {"url": "http://www.mayoclinic.org/diseases-conditions/dizziness/basics/causes/CON-20023004", "passage_text": "Other causes of dizziness. 1  Neurological conditions. 2  Some neurological disorders — such as Parkinson's disease and multiple sclerosis — can lead to progressive loss of balance. 3  Medications. 4  Dizziness can be a side effect of certain medications — such as anti-seizure drugs, antidepressants, sedatives and tranquilizers. 1 Anxiety disorders. 2  Certain anxiety disorders may cause lightheadedness or a woozy feeling often referred to as dizziness. 3  These include panic attacks and a fear of leaving home or being in large, open spaces (agoraphobia). 4  Low iron levels (anemia)."}, {"url": "http://www.mayoclinic.org/diseases-conditions/dizziness/basics/causes/CON-20023004", "passage_text": "Dizziness has many possible causes, including inner ear disturbance, motion sickness and medication effects. Sometimes it's caused by an underlying health condition, such as poor circulation, infection or injury. The way dizziness makes you feel and your triggers provide clues for possible causes. 1 Anxiety disorders. 2  Certain anxiety disorders may cause lightheadedness or a woozy feeling often referred to as dizziness. 3  These include panic attacks and a fear of leaving home or being in large, open spaces (agoraphobia). 4  Low iron levels (anemia)."}, {"url": "http://www.nhs.uk/Conditions/dizziness/Pages/Introduction.aspx", "passage_text": "Common causes of dizziness. The most common causes of dizziness are outlined below. 1  Labyrinthitis – an inner ear infection that affects your hearing and balance, and can lead to a severe form of dizziness called vertigo. 2  Migraine – dizziness may come on before or after the headache, or even without the headache. Less common causes of dizziness. Less common causes of dizziness include: 1  having a severe illness or condition that affects the whole body. 2  using recreational drugs or consuming excessive amounts of alcohol (either binge drinking or long-term alcohol misuse). 3  certain types of prescription medicine – such as antidepressants or blood pressure medication"}, {"url": "http://www.medicinenet.com/dizziness_dizzy/article.htm", "passage_text": "1 Some of the conditions that may cause lightheadedness in a patient include low blood pressure, high blood pressure, dehydration, medications, postural or orthostatic hypotension, diabetes, endocrine disorders, hyperventilation, heart conditions, and vasovagal syncope. 1 Vertigo is most often caused by a problem in the balance centers of the inner ear called the vestibular system and causes the sensation of the room spinning. 2  It may be associated with vomiting."}, {"url": "http://my.clevelandclinic.org/services/head-neck/diseases-conditions/hic-what-is-dizziness", "passage_text": "Dizziness is generally not serious. However, it may be the result from problems associated with the inner ear, brain, or heart. It can also be the result of medications. One of the most common causes of dizziness is inner ear disorders. These disorders include: General location of inner ear disorders. Semicircular canals: Benign positional vertigo."}, {"url": "http://www.healthline.com/symptom/dizziness", "passage_text": "Common causes of dizziness include inner-ear disorders, medications, and alcohol. Dizziness is often a result of vertigo. It can also be caused by a problem in the inner ear, where balance is regulated. The most common cause of vertigo and vertigo-related dizziness is benign paroxysmal positional vertigo (BPPV). Dizziness is not a disease but a symptom of other disorders. Vertigo and disequilibrium may cause a feeling of dizziness, but those two terms describe different symptoms. Vertigo is characterized by a feeling of spinning. Disequilibrium is a loss of balance or equilibrium. True dizziness is the feeling of lightheadedness or nearly fainting"}]