[{"url": "https://en.wikipedia.org/wiki/Arcus_senilis", "passage_text": "Arcus senilis (or arcus senilis corneae) is a white, grey, or blue opaque ring in the corneal margin (peripheral corneal opacity), or white ring in front of the periphery of the iris. It is present at birth, but then fades; however, it is quite commonly present in the elderly. It can also appear earlier in life as a result of hypercholesterolemia. Arcus senilis can be confused with the limbus sign, which reflects calcium rather than lipid deposits."}, {"url": "http://www.medscape.com/viewarticle/721778_11", "passage_text": "Arcus Senilis. Arcus senilis (corneal arcus) is a bilateral condition manifesting as a white ring in the periphery of the cornea. It is a lipid-rich corneal deposit that does not affect the patient's vision. It begins at the top and bottom of the cornea and spreads to form a complete ring. It is most commonly seen in elderly patients. "}, {"url": "https://www.healthtap.com/topics/arcus-senilis-treatment", "passage_text": "Arcus senilis: is a deposit of cholesterol that occurs in the outer part of the cornea. It appears as a gray arc or ring along the edge of the colored part. Arcus does not cause any problems and does not need to be treated. Get help from a doctor now ›. No: Arcus senilis is a gray, white arc or ring that forms around the cornea of the eye. It's very common in older adults. It doesnot cause problems with vision and does not need treatment. People with inherited, extremely elevated cholesterol levels may have a similar white arc around their cornea"}, {"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-cholesterol/expert-answers/arcus-senilis/FAQ-20058306", "passage_text": "Arcus senilis, also known as arcus corneae, is a gray or white arc visible above and below the outer part of the cornea — the clear, dome-like covering over the front of the eye. Eventually, the arc may become a complete ring around the cornea. Arcus senilis is common in older adults. It's caused by fat (lipid) deposits deep in the edge of the cornea. It isn't related to high cholesterol, however."}, {"url": "http://www.rightdiagnosis.com/medical/arcus_senilis.htm", "passage_text": "Arcus senilis (medical condition): A disease of the cornea which sometimes appears as white arcs on the... more ». See also: Arcus corneae : » Introduction: Arcus corneae. » Symptoms of Arcus corneae. Arcus senilis: an arc-shaped whitish deposit sometimes seen in the cornea. Arcus senilis: A corneal disease in which there is a deposition of phospholipid and cholesterol in the corneal stroma and anterior sclera. Source: Diseases Database"}, {"url": "http://medical-dictionary.thefreedictionary.com/arcus+senilis", "passage_text": "arcus adipo´sus arcus corneae. arcus cor´neae (arcus cornea´lis) a white or gray opaque ring in the corneal margin; it may be present at birth or appear in childhood (see arcus juvenilis), but the condition is particularly common in those over 50 years old (see arcus senilis). corneal arcus. A greyish-white ring (or part of a ring) opacity occurring in the periphery of the cornea, in middle and old age. It is due to a lipid infiltration of the corneal stroma. With age the condition progresses to form a complete ring. That ring is separated from the limbus by a zone of clear cornea."}, {"url": "https://www.healthtap.com/topics/arcus-senilis-treatment", "passage_text": "Normal eyes: Arcus senilis is a gray, white arc or ring that forms around the cornea of the eye. It's very common in older adults. It doesnot cause problems with vision and does not need treatment. ...Read more. Get help from a doctor now ›. No: Arcus senilis is a gray, white arc or ring that forms around the cornea of the eye. It's very common in older adults. It doesnot cause problems with vision and does not need treatment. People with inherited, extremely elevated cholesterol levels may have a similar white arc around their cornea"}, {"url": "http://www.thefreedictionary.com/arcus+senilis", "passage_text": "Noun. 1. arcus senilis-a whitish deposit in the shape of an arc that is sometimes seen in the cornea. arcus. cornea-the transparent dome-shaped anterior portion of the outer covering of the eye; it covers the iris and pupil and is continuous with the sclera. "}]