[{"url": "http://admissions.utexas.edu/tuition/cost-of-attendance", "passage_text": "Cost of Attendance. Cost of attendance is broadly defined as the average cost to attend a college or university for one academic year—the fall and spring semesters. It includes tuition and an estimate of average costs for books and supplies, room and board, transportation and personal expenses. Room & Board. The average cost per semester to live in the city of Austin while attending the university. Actual costs may vary by individual choices related to location and circumstances. The on-and off-campus costs assume a roommate."}, {"url": "http://admissions.utexas.edu/tuition/cost-of-attendance", "passage_text": "Tuition & Fees. The average cost of tuition and fees based on 12 hours per semester enrollment for undergraduate students and nine hours for graduate students (fall or spring), or nine hours of enrollment for undergraduate students and three hours for graduate students (summer). Room & Board. The average cost per semester to live in the city of Austin while attending the university. Actual costs may vary by individual choices related to location and circumstances. The on-and off-campus costs assume a roommate."}, {"url": "http://www.collegecalc.org/colleges/texas/the-university-of-texas-at-austin/", "passage_text": "Undergraduate Tuition. The University of Texas at Austin tuition is $9,830 per year for in-state residents. This is 53% more expensive than the national average public four year tuition of $6,429. The cost is $4,736 and 33% cheaper than the average Texas tuition of $14,566 for 4 year colleges. Annual Total Cost. The total list price for in-state Texas residents to go to UT Austin is $22,036 for the 2014/2015 academic year. Out-of-state students who don't possess Texas residence can expect a one year cost of $47,042."}, {"url": "http://www.collegefactual.com/colleges/the-university-of-texas-at-austin/paying-for-college/tuition-and-fees/", "passage_text": "The cost of tuition and fees is reduced dramatically for residents of Texas. Tuition for these students is set at $9,798 for the 2013 - 2014 year, a discount of 71.0%. Fees are $0, bringing the total yearly cost for these full-time undergrads to $9,798. Tuition for out-of-state students attending The University of Texas at Austin increased at an average annual rate of 4.0% over the past 5 years. Over that same period, fees grew by 0.0%. Based on this, we estimate the cost of tuition and fees for 2014 - 2015 will total $35,186"}, {"url": "http://admissions.utexas.edu/tuition/cost-of-attendance", "passage_text": "Definitions. The average cost of tuition and fees based on 12 hours per semester enrollment for undergraduate students and nine hours for graduate students (fall or spring), or nine hours of enrollment for undergraduate students and three hours for graduate students (summer). Room & Board. The average cost per semester to live in the city of Austin while attending the university. Actual costs may vary by individual choices related to location and circumstances. The on-and off-campus costs assume a roommate."}, {"url": "http://www.collegefactual.com/colleges/the-university-of-texas-at-austin/paying-for-college/tuition-and-fees/", "passage_text": "Tuition and Fees Discounted Based On Residency. Full-time undergraduate students that do not reside in Texas paid $33,842 in tuition and fees for the 2013 - 2014 school year prior to adjustments for financial need. Of this amount, $33,842 was the cost of tuition and $0 the cost of fees. Tuition for out-of-state students attending The University of Texas at Austin increased at an average annual rate of 4.0% over the past 5 years. Over that same period, fees grew by 0.0%. Based on this, we estimate the cost of tuition and fees for 2014 - 2015 will total $35,186"}, {"url": "http://www.pge.utexas.edu/future/undergraduate/tuition", "passage_text": "Tuition & Funding. The University of Texas at Austin offers an outstanding education at a reasonable cost, compared to other institutions of its caliber. Kiplinger’s named UT the 24th-best value public university in the country. For more information visit the  Be A Longhorn  site, which offers estimates of total undergraduate tuition cost. The Department of Petroleum and Geosystems Engineering awards scholarships each year to incoming high school students."}]