[{"url": "https://en.wikipedia.org/wiki/Flying_Without_Wings", "passage_text": "A karaoke version of Flying Without Wings was released on DVD in 2000 and debuted at number one. It includes easy to read lyrics, photographs & interactive menus, picture sleeve. It has a running time of 45 minutes. Flying Without Wings was covered by American Idol winner Ruben Studdard as his debut single in 2003. The single was released on June 10 and charted at number two on the Billboard Hot 100 on June 28, behind . This Is the Night  by Clay Aiken"}, {"url": "http://www.youtube.com/watch?v=yFH96VY3p3M", "passage_text": "Flying Without Wings is a song released by Irish boy band Westlife from their self-titled debut studio album (1999). The song became an instant hit in the United Kingdom and many parts of the world. The song became the group's third UK number-one single, spending 13 weeks on charts. Westlife were an Irish boy band, formed in July 1998 and disbanded in June 2012. Originally signed by Simon Cowell and managed by Louis Walsh, the group's final line-up consisted of Nicky Byrne, Kian Egan, Mark Feehily and Shane Filan. Brian McFadden was a member from 1998 until his departure in 2004."}, {"url": "http://www.songfacts.com/detail.php?id=7822", "passage_text": "This song was a huge hit for the Irish boy band Westlife. It was voted Song Of The Year 1999 in the ITV end of year phone music poll. In 2003 on the second season of American Idol, the winner Ruben Studdard sang this on the finale and turned it into a #2 hit in America. Then I came up with the first verse and chorus, he added, played it to their producer Steve Mac, and finished the song in about 45 minutes. That's quick for me. There have been occasions where I've spent 45 weeks on a single song.."}, {"url": "http://www.songfacts.com/detail.php?id=7822", "passage_text": "This was written by Steve Mac and Wayne Hector in 3 hours. This song says that the happiness you get from children, friendship and being with your lover is like flying without wings. In 2004 Westlife recorded a special live version of this song which had the honor of being the first ever official download #1 in the UK. Then I came up with the first verse and chorus, he added, played it to their producer Steve Mac, and finished the song in about 45 minutes. That's quick for me. There have been occasions where I've spent 45 weeks on a single song.."}, {"url": "http://www.kgbanswers.co.uk/who-originally-sang-the-westlife-song-flying-without-wings/3077385", "passage_text": "Find out more at BBC. “Flying Without Wings” was originally sung by Westlife, it was a huge hit and was voted Song Of The Year in 1999 in the ITV end-of-year phone music poll. The song was written in 3 hours by Steve Mac and Wayne Hector. American Idol winner Ruben Studdard also sang tthe song on the finale of the second season and turned it into a #2 hit in America. Just recently, Nicholas McDonald and Shane performed the hit Westlife song “Flying Without Wings” in Wembley Arena."}, {"url": "http://www.youaskme.co.uk/Arts-Humanities/who-sang-flying-without-wings-first_1339", "passage_text": "Westlife in 1999. The song was written by Wayne Hector and Steve Mac. In an interview with HitQuarters Hector said the basic idea for the song came to him while on a break from working on a hip hop session with Ezi Cut in Los Angeles:"}, {"url": "https://en.wikipedia.org/wiki/Flying_Without_Wings", "passage_text": "1 Flying Without Wings - Westlife with BoA official music video on YouTube.  2 Flying Without Wings - Westlife with Cristian Castro official music video on YouTube.  3 Flying Without Wings - Ruben Studdard official music video on YouTube. Flying Without Wings was covered by American Idol winner Ruben Studdard as his debut single in 2003. The single was released on June 10 and charted at number two on the Billboard Hot 100 on June 28, behind . This Is the Night  by Clay Aiken"}, {"url": "http://www.kgbanswers.co.uk/who-originally-sang-the-westlife-song-flying-without-wings/3077385", "passage_text": "Who originally sang the westlife song flying without wings. “Flying Without Wings” was originally sung by Westlife, it was a huge hit and was voted Song Of The Year in 1999 in the ITV end-of-year phone music poll. The song was written in 3 hours by Steve Mac and Wayne Hector. American Idol winner Ruben Studdard also sang tthe song on the finale of the second season and turned it into a #2 hit in America. Just recently, Nicholas McDonald and Shane performed the hit Westlife song “Flying Without Wings” in Wembley Arena."}]