[{"url": "https://www.beautyinprague.com/nose-reshaping-surgery/", "passage_text": "If you are considering rhinoplasty (Nose Job) or Nose Tip Surgery…. Rhinoplasty (Nose Job) or Nose Tip Surgery is cosmetic surgery to reshape the nose. It is one of the most common of all cosmetic plastic surgery procedures. After the nose surgery you are taken every 2–3 days for a free check up to the clinic. Minimum stay in Prague is 7 days after surgery, recommended 10–14 days. Our Prague rhinoplasty surgeons use dissolving stitches, which are placed inside of your nose and do not need to be removed."}, {"url": "http://www.drhiatt.com/procedures/rhinoplasty/", "passage_text": "Call Us (480) 844 -1410. Rhinoplasty, also known as “nose reshaping” or “nose surgery,” is a procedure designed to improve the appearance and function of the nose. This type of surgery reshapes the nose so that it is in better harmony with the rest of the face. "}, {"url": "http://www.cosmeticsurg.net/procedures/rhinoplasty/", "passage_text": "The Total Rhinoplasty procedure cost includes the surgeon's fee, OR fee, anesthesia fee, and all follow up office visits. Financing is available for either the entire amount or partial funding. Total costs are as follows: 1  Tip: $5000-$6400. 2  Full Rhinoplasty: $7600. "}, {"url": "https://www.beautyinprague.com/nose-reshaping-surgery/", "passage_text": "Nose Tip Surgery. 1  Nose tip surgery concentrates on the soft parts of your nose, and takes approximately 1 hour under general anaesthetic. 2  The plastic surgeon modifies the cartilages inside the tip of your nose and he uses dissolvable stitches on completion, thus avoiding the need for removal after healing. After the nose surgery you are taken every 2–3 days for a free check up to the clinic. Minimum stay in Prague is 7 days after surgery, recommended 10–14 days. Our Prague rhinoplasty surgeons use dissolving stitches, which are placed inside of your nose and do not need to be removed."}, {"url": "https://www.beautyinprague.com/nose-reshaping-surgery/", "passage_text": "Swelling after rhinoplasty (Nose job), Nose Tip Surgery. Bruises and the initial swelling will virtually disappear within 14 days of the rhinoplasty surgery. The nose may still swell from time to time for about 2 months. A final, completely stabilised result may be expected after 6–12 months. After the nose surgery you are taken every 2–3 days for a free check up to the clinic. Minimum stay in Prague is 7 days after surgery, recommended 10–14 days. Our Prague rhinoplasty surgeons use dissolving stitches, which are placed inside of your nose and do not need to be removed."}, {"url": "http://plasticsurgery.org/cosmetic-procedures/rhinoplasty.html?sub=Rhinoplasty+cost", "passage_text": "The average cost of rhinoplasty is $4,694, according to 2014 statistics from the American Society of Plastic Surgeons. Rhinoplasty surgery costs can vary widely. The average fee referenced above does not include anesthesia, operating room facilities or other related expenses. "}, {"url": "https://www.beautyinprague.com/nose-reshaping-surgery/", "passage_text": "1 Nose tip surgery concentrates on the soft parts of your nose, and takes approximately 1 hour under general anaesthetic. 2  The plastic surgeon modifies the cartilages inside the tip of your nose and he uses dissolvable stitches on completion, thus avoiding the need for removal after healing. After the nose surgery you are taken every 2–3 days for a free check up to the clinic. Minimum stay in Prague is 7 days after surgery, recommended 10–14 days. Our Prague rhinoplasty surgeons use dissolving stitches, which are placed inside of your nose and do not need to be removed."}, {"url": "http://www.webmd.com/beauty/nose-job/rhinoplasty", "passage_text": "Rhinoplasty. Rhinoplasty is surgery to reshape the nose. It can make the nose larger or smaller; change the angle of the nose in relation to the upper lip; alter the tip of the nose; or correct bumps, indentations, or other defects in the nose. Surgery Overview. Rhinoplasty is surgery to reshape the nose. It can make the nose larger or smaller; change the angle of the nose in relation to the upper lip; alter the tip of the nose; or correct bumps, indentations, or other defects in the nose."}, {"url": "http://www.enhancemyself.com/rhinoplasty/", "passage_text": "On average, the surgeon’s fee for rhinoplasty is around $3,500. This amount does not include the facility or anesthesia fees, or additional expenses that may be required for patients undergoing rhinoplasty. The anesthesia costs are usually between $600 and $1,000, and the facility fee between $700 and $1,100. The total cost of rhinoplasty usually averages between $5,000 and $10,000. There are other pricing factors to consider as well such as the extent of your procedure, where you live, and the plastic surgeon you choose. "}]