[{"url": "http://hypoglycemia35.weebly.com/endocrine-functions.html", "passage_text": "The pituitary gland secretes hormones that affect other glands and organs. The adrenal glands help the body response to stress and danger. The pancreas regulates blood sugar levels. The ovaries produce hormones involved in reproduction. The testes, in males, produce hormones involved in reproduction. *The pancreas is what makes and absorbs and controls the blood sugar level so that is what gland is effecting hypoglycemia. *The feedback control is what controls if your endocrine system is on or off. *The endocrine system is a collection of glands that control body-fluid balance, growth, and sexual development."}, {"url": "http://www.rightdiagnosis.com/h/hypoglycemia/basics.htm", "passage_text": "Hypoglycemia, also known as low blood sugar, is an abnormal condition in which the sugar (glucose) level in ... more 1  ». Hypoglycemia: Low blood sugar level. 2  Hypoglycemia: A syndrome of abnormally low BLOOD GLUCOSE level. 3  Clinical hypoglycemia has diverse etiologies. 1 Severe hypoglycemia eventually lead to glucose deprivation of the CENTRAL NERVOUS SYSTEM resulting in HUNGER; SWEATING; PARESTHESIA; impaired mental function; SEIZURES; COMA; and even DEATH. 2  Source-Diseases Database. 3  Hypoglycemia: abnormally low blood sugar usually resulting from excessive insulin or a poor diet."}, {"url": "https://www.sharecare.com/health/hypoglycemia-complications/how-hypoglycemia-affect-body", "passage_text": "Hypoglycemia refers to blood sugar levels that drop below the normal range. When blood sugar becomes too low, the body releases a hormone called epinephrine (adrenaline), which causes the body to release stored sugar into the blood. If you notice any of these signs or symptoms, check your blood sugar. If it is low, eat or drink a source of quick sugar -- like 5-6 pieces of hard candy, 3-4 glucose tablets, or 6 ounces of fruit juice or soft drink (not diet). Check your blood sugar again in 15 minutes."}, {"url": "http://www.mayoclinic.org/diseases-conditions/type-1-diabetes/basics/complications/CON-20019573", "passage_text": "Type 1 diabetes can affect major organs in your body, including heart, blood vessels, nerves, eyes and kidneys. Keeping your blood sugar level close to normal most of the time can dramatically reduce the risk of many complications. Long-term complications of type 1 diabetes develop gradually, over decades. "}, {"url": "http://www.medicalnewstoday.com/articles/166815.php", "passage_text": "Hypoglycemia can affect all the organs in your body, especially your brain. If the hypoglycemia symptoms are severe and the individual cannot treat himself/herself, somebody else will need to apply honey, treacle, jam or Glucogel to the inside of the cheeks and then gently massage the outside of the cheeks. 1 Children with these disorders are more likely to develop abnormally low blood sugar levels than adults. 2  Reactive hypoglycemia (postprandial hypoglycemia) - this is when the pancreas produces too much insulin after a meal. 3  Tumors-tumors in other parts of the body (not the pancreas) can cause hypoglycemia."}, {"url": "http://www.mayoclinic.org/diseases-conditions/hypoglycemia/basics/causes/CON-20021103", "passage_text": "1 Some critical illnesses. 2  Severe illnesses of the liver, such as severe hepatitis, can cause hypoglycemia. 3  Disorders of the kidney, which can keep your body from properly excreting medications, can affect glucose levels due to a buildup of those medications. Causes. Hypoglycemia occurs when your blood sugar (glucose) level falls too low. There are several reasons why this may happen, the most common being a side effect of drugs used for the treatment of diabetes."}, {"url": "https://en.wikipedia.org/wiki/Hypoglycemia", "passage_text": "Low blood sugar may occur in babies who are otherwise healthy who have not eaten for a few hours. The glucose level that defines hypoglycemia is variable. In people with diabetes levels below 3.9 mmol/L (70 mg/dL) is diagnostic. In adults without diabetes, symptoms related to low blood sugar, low blood sugar at the time of symptoms, and improvement when blood sugar is restored to normal confirm the diagnosis. "}, {"url": "http://www.medicalnewstoday.com/articles/166815.php", "passage_text": "A person with abnormally low levels of blood sugar (glucose) has hypoglycemia. Glucose is the body's main energy source. Hypoglycemia is not a disease in itself; it is a sign of a health problem. The majority of people know when their blood sugar levels have dropped, and have time to do something about it. 1 Children with these disorders are more likely to develop abnormally low blood sugar levels than adults. 2  Reactive hypoglycemia (postprandial hypoglycemia) - this is when the pancreas produces too much insulin after a meal. 3  Tumors-tumors in other parts of the body (not the pancreas) can cause"}, {"url": "http://www.answers.com/Q/Which_organ_can_persistent_hypoglycemia_affect", "passage_text": "The most affected organ from hypoglycemia is the brain, which requires a full glucose supply at all times. Interruption of that supply is similar to interruption of oxygen -- it causes brain insult and damage within 3-4 minutes. 1 Symptoms and Complications of Severe Hypoglycemia Hypoglycemia is a potentially dangerous condition that occurs when the amount of glucose, or blood sugar, in your body falls below normal levels."}, {"url": "http://umm.edu/health/medical/altmed/condition/hypoglycemia", "passage_text": "Introduction. Hypoglycemia is a condition in which there is an abnormally low level of glucose (sugar) in your blood. Normally your body keeps blood sugar levels within a narrow range through the coordinated work of several organs and glands and their hormones, primarily insulin and glucagon."}]