[{"url": "http://www.translatorscafe.com/cafe/EN/units-converter/mass/14-12/nanogram-miligram/", "passage_text": "1 ng = 10⁻⁹ g = 10⁻¹² kg. A milligram (mg) is a decimal fraction of the base unit of mass in the International System of Units (SI) kilogram, which is defined as being equal to the mass of the International Prototype Kilogram, which is almost exactly equal to the mass of one liter of water. 1 mg = 10⁻³ g = 10⁻⁶ kg."}, {"url": "http://www.ehow.com/how_8794120_convert-nanograms-milligrams.html", "passage_text": "A gram (g) is the basic unit of measurement of mass used in the metric system. Nanograms (ng) and milligrams (mg) are both units of grams. Nano means one-billionth. Therefore, a nanogram is a billionth of a gram. Milli means one-thousandth. Therefore a milligram is a thousandth of a gram. One milligram is equal to one million nanograms. T"}, {"url": "http://www.convertunits.com/from/nanogram/to/milligram", "passage_text": "We assume you are converting between nanogram and milligram. You can view more details on each measurement unit: nanogram or milligram. The SI base unit for mass is the kilogram. 1 kilogram is equal to 1.0E+12 nanogram, or 1000000"}, {"url": "http://www.convertunits.com/from/milligrams/to/nanogram", "passage_text": "The answer is 1.0E-6. We assume you are converting between milligram and nanogram. You can view more details on each measurement unit: milligrams or nanogram. The SI base unit for mass is the kilogram. 1 kilogram is equal to 1000000 milligrams, or 1.0E+12 nanogram. Note that rounding errors may occur, so always check the results."}, {"url": "http://www.translatorscafe.com/cafe/EN/units-converter/mass/14-12/nanogram-miligram/", "passage_text": "From: To: 1 nanogram [ng] = 0.000001 milligram [mg]. A nanogram (ng) is a decimal fraction of the base unit of mass in the International System of Units (SI) kilogram, which is defined as being equal to the mass of the International Prototype Kilogram, which is almost exactly equal to the mass of one liter of water."}, {"url": "http://metric-calculator.com/converter_milligram_to_nanogram.htm", "passage_text": "1 milligram (mg) = 1000000 nanogram (ng). Milligram (mg) is a unit of Weight used in Metric system. Nanogram (ng) is a unit of Weight used in Metric system. Milligrams also can be marked as Milligrammes (alternative British English spelling in UK)."}]