[{"url": "http://healthtips-lifestyle.blogspot.com/2012/02/norovirus-gastroenteritis-incubation.html", "passage_text": "The noroviruses starts to multiply within small intestine once an individual get the infection. The symptoms of the infection will occur usually after 24-48 hours after the infection. And the norovirus incubation period is between the transmission of the norovirus and the early time of the symptoms appear. In the other words, we can say that the incubation period of the infection is usually about 12-hours (less or more) after exposure. "}, {"url": "http://www.emedicinehealth.com/norovirus/page3_em.htm", "passage_text": "The symptoms and signs of norovirus infection usually occur within 12-48 hours of contact (incubation period) with the virus and often are first noticed within a cluster of people in a group (for example, military or school dorms, cruise ships, and nursing homes). "}, {"url": "http://www.medicinenet.com/norovirus_infection/page3.htm", "passage_text": "Norovirus may have a prolonged infection period that starts even before a patient gets sick. There is a short lag or incubation period (up to two days) between the time that people acquire the virus and the time they get symptoms. People may be contagious during this period. All people are contagious while they are having symptoms"}, {"url": "http://www.medicinenet.com/norovirus_infection/page3.htm", "passage_text": "Although the most contagious period is over when the patient's symptoms resolve, even some people who appear to have recovered completely after a norovirus infection may continue to shed the virus for weeks in their stool and may be a source of infection to others. There is a short lag or incubation period (up to two days) between the time that people acquire the virus and the time they get symptoms."}, {"url": "http://www.cdc.gov/norovirus/about/transmission.html", "passage_text": "View larger image. Norovirus is a highly contagious virus. Anyone can get infected with norovirus and get sick. Also, you can get norovirus illness many times in your life. One reason for this is that there are many different types of noroviruses. The virus can stay in your stool for 2 weeks or more after you feel better. You are most contagious. 1  when you are sick with norovirus illness, and. 2  during the first few days after you recover from norovirus illness."}, {"url": "http://www.mayoclinic.org/diseases-conditions/viral-gastroenteritis/expert-answers/stomach-flu/faq-20057899", "passage_text": "A number of viruses can cause gastroenteritis, including noroviruses and rotaviruses. The contagious period — the time during which a sick person can give the illness to others — is slightly different for each virus. 1  Norovirus. 2  With norovirus — the most common cause of viral gastroenteritis in adults and children — you're contagious from the moment you begin to feel ill. "}, {"url": "http://diarrhea.emedtv.com/rotavirus/rotavirus-incubation-period.html", "passage_text": "When a person becomes infected with rotavirus, the virus begins to multiply within the small intestine. After approximately two days, symptoms of a rotavirus infection can appear. This period between the rotavirus transmission and the start of symptoms is the rotavirus incubation period.. "}, {"url": "http://www.aquamarinechemicals.com/norovirus/norovirus-incubation/", "passage_text": "Norovirus Incubation period is 24-72 hours. This is the time between catching the virus and developing symptoms. Norovirus can have a very drawn out infection period starting even before someone gets sick. (This is called the Norovirus Incubation Period) There is a very short space of time (up to two days) between the time that people acquire the virus and the time they get symptoms."}, {"url": "http://diarrhea.emedtv.com/norovirus-gastroenteritis/norovirus-incubation-period.html", "passage_text": "A person is not usually contagious during the norovirus incubation period. People infected with norovirus are usually contagious from the moment they begin feeling ill to at least 3 days after recovery. Some people may be contagious for as long as 2 weeks after recovery. Norovirus Incubation Period: A Summary. When a person becomes infected with norovirus, the virus begins to multiply within the small intestine. After approximately 1 to 2 days, norovirus symptoms can appear. This period between the norovirus transmission and the start of norovirus symptoms is known as the norovirus incubation period."}]