[{"url": "https://en.wikipedia.org/wiki/Acetyl-CoA", "passage_text": "From Wikipedia, the free encyclopedia. Acetyl coenzyme A or acetyl-CoA is an important molecule in metabolism, used in many biochemical reactions. Its main function is to convey the carbon atoms within the acetyl group to the citric acid cycle (Krebs cycle) to be oxidized for energy production. Choline, in combination with acetyl-CoA, is catalyzed by the enzyme choline acetyltransferase to produce acetylcholine and a Coenzyme A byproduct."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Organic/acetylcoa.html", "passage_text": "Acetyl-CoA. Acetyl-CoA is an important biochemical molecule in cellular respiration. It is produced in the second step of aerobic respiration after glycolysis and carries the carbon atoms of the acetyl group to the TCA cycle to be oxidized for energy production. It is produced by decarboxylation of pyruvate in the matrix of the mitochondria."}, {"url": "https://en.wikipedia.org/wiki/Cellular_respiration", "passage_text": "Cellular respiration is the set of metabolic reactions and processes that take place in the cells of organisms to convert biochemical energy from nutrients into adenosine triphosphate (ATP), and then release waste products. Although technically, cellular respiration is a combustion reaction, it clearly does not resemble one when it occurs in a living cell due to slow release of energy from the series of reactions."}, {"url": "http://www.livestrong.com/article/493923-what-are-the-functions-of-coenzyme-a-in-cellular-respiration/", "passage_text": "Glycolysis is the first step in cellular respiration. It is the process by which cellular metabolism begins converting glucose, the main fuel used by the body obtained from starches and sugars, into usable energy. Glycolysis also produces some waste in the form of carbon dioxide, which is exhaled, and an acetyl group called pyruvic acid, which then joins with coenzyme A for the next step of cellular respiration. You Might Also Like."}, {"url": "http://www.livestrong.com/article/493923-what-are-the-functions-of-coenzyme-a-in-cellular-respiration/", "passage_text": "Kreb's Cycle. When oxygen is present, cellular respiration continues after glycolysis with a process called the Kreb's cycle. In the Kreb's cycle, Acetyl CoA combines with a four-carbon compound in the mitochondria. Glycolysis also produces some waste in the form of carbon dioxide, which is exhaled, and an acetyl group called pyruvic acid, which then joins with coenzyme A for the next step of cellular respiration. You Might Also Like."}, {"url": "http://users.rcn.com/jkimball.ma.ultranet/BiologyPages/C/CellularRespiration.html", "passage_text": "Cellular respiration is the process of oxidizing food molecules, like glucose, to carbon dioxide and water. C6H12O6 + 6O2 + 6H2O → 12H2O + 6 CO2. The energy released is trapped in the form of ATP for use by all the energy-consuming activities of the cell. 1  glycolysis, the breakdown of glucose to pyruvic acid. "}, {"url": "https://en.wikipedia.org/wiki/Cellular_respiration", "passage_text": "The reactions involved in respiration are catabolic reactions, which break large molecules into smaller ones, releasing energy in the process, as weak so-called high-energy bonds are replaced by stronger bonds in the products. Respiration is one of the key ways a cell gains useful energy to fuel cellular activity. Although technically, cellular respiration is a combustion reaction, it clearly does not resemble one when it occurs in a living cell due to slow release of energy from the series of reactions."}, {"url": "http://wps.aw.com/bc_campbell_concepts_7_oa/215/55154/14119482.cw/content/index.html", "passage_text": "This process produces some ATP and carbon dioxide in the mitochondrion. This process uses energy captured from electrons flowing to oxygen to produce most of the ATPs in cellular respiration. This process splits glucose in half and produces 2 ATPs for each glucose. This process uses energy captured from electrons flowing to oxygen to produce most of the ATPs in cellular respiration. This process converts pyruvic acid to acetyl CoA. This process uses energy captured from electrons flowing to oxygen to produce most of the ATPs in cellular respiration. This process splits glucose in half and produces 2 ATPs for each glucose. This process joins 2 pyruvic acid molecules into a molecule of glucose"}]