[{"url": "http://www.ncbi.nlm.nih.gov/pubmed/18717273", "passage_text": "The spleen is a lymphatic organ that plays a fundamental role in protecting the body from invading pathogens. Being an organ that is interposed in the blood stream, it also stands as the body's largest blood filter that furthermore brings contribution to detecting senescent, mechanically damaged and aberrant cells. "}, {"url": "https://en.wikipedia.org/wiki/Spleen", "passage_text": "The spleen plays important roles in regard to red blood cells (also referred to as erythrocytes) and the immune system. It removes old red blood cells and holds a reserve of blood, which can be valuable in case of hemorrhagic shock, and also recycles iron. 1 As a major lymphoid organ and a central player in the reticuloendothelial system, the spleen retains the ability to produce lymphocytes and, as such, remains an hematopoietic organ. 2  Storage of red blood cells, lymphocytes and other formed elements. 3  In horses, roughly 30% of the red blood cells are stored there."}, {"url": "http://www.webmd.com/digestive-disorders/picture-of-the-spleen", "passage_text": "The spleen plays multiple supporting roles in the body. It acts as a filter for blood as part of the immune system. Old red blood cells are recycled in the spleen, and platelets and white blood cells are stored there. The spleen also helps fight certain kinds of bacteria that cause pneumonia and meningitis. The spleen is an organ in the upper far left part of the abdomen, to the left of the stomach. The spleen varies in size and shape between people, but it’s commonly fist-shaped, purple, and about 4 inches long. Because the spleen is protected by the rib cage, you can’t easily feel it unless it’s abnormally enlarged."}, {"url": "http://www.news-medical.net/health/What-Does-the-Spleen-Do.aspx", "passage_text": "It is also an important organ in the immune system, producing the white blood cells that fight infection and synthesize antibodies. Although the spleen is important for many functions in the body, the spleen is not vital to survival and it is possible to live without a spleen. Without the spleen, other organs in the body (particularly the liver) adapt and increase their ability to fight infection and remove redundant red blood cells. Anatomy and function of the spleen. The spleen is located in the left upper quarter of the abdomen, beneath the ninth to the twelfth rib. In healthy adults, the organ measures around 10 to 12 centimetres in length and weighs around 150 to 200 grams."}, {"url": "http://www.buzzle.com/articles/spleen-function-in-immune-system.html", "passage_text": "The spleen in humans is a soft organ, and of the size of a fist. It is dark purple in appearance, and 12 cm length, 7 cm height and 4 cm thickness are the average statistics of this organ. The spleen can weigh from 100 to 205 g, depending on the age and health of an adult. For the rest of the life, the organ makes white blood cells to fight infection as a part of the lymphatic system. Factors Which May Interfere with Functions of the Spleen. Enlargement of the spleen is one of the most critical spleen problems."}, {"url": "https://en.wikipedia.org/wiki/Spleen", "passage_text": "The spleen synthesizes antibodies in its white pulp and removes antibody-coated bacteria and antibody-coated blood cells by way of blood and lymph node circulation. A study published in 2009 using mice found that the spleen contains, in its reserve, half of the body's monocytes within the red pulp. 1 As a major lymphoid organ and a central player in the reticuloendothelial system, the spleen retains the ability to produce lymphocytes and, as such, remains an hematopoietic organ. 2  Storage of red blood cells, lymphocytes and other formed elements. 3  In horses, roughly 30% of the red blood cells are stored there."}, {"url": "http://www.webmd.com/digestive-disorders/picture-of-the-spleen", "passage_text": "Front View of the Spleen. The spleen is an organ in the upper far left part of the abdomen, to the left of the stomach. The spleen varies in size and shape between people, but it’s commonly fist-shaped, purple, and about 4 inches long. Because the spleen is protected by the rib cage, you can’t easily feel it unless it’s abnormally enlarged."}, {"url": "http://biology.about.com/od/anatomy/ss/spleen.htm", "passage_text": "Located in the upper left region of the abdominal cavity, the spleen's primary function is to filter blood of damaged cells, cellular debris, and pathogens such as bacteria and viruses. Like the thymus, the spleen houses and aids in the maturation of immune system cells called lymphocytes. Lymphocytes are white blood cells that protect against foreign organisms that have managed to infect body cells. Lymphocytes also protect the body from itself by controlling cancerous cells. The spleen is a lymphatic organ that performs the valuable function of filtering blood. While it is an important organ, it can be removed when necessary without causing death. This is the case because other organs, such as the liver and bone marrow, can perform filtration functions in the body."}, {"url": "http://www.buzzle.com/articles/spleen-function-in-immune-system.html", "passage_text": "Know about how spleen works in the body from the article below. Advertisement. The immune system is the key unit which protects the body against diseases. A healthy immune system detects pathogens from viruses to parasitic worms, and knows the difference between foreign bodies and the body's own healthy tissue. For the rest of the life, the organ makes white blood cells to fight infection as a part of the lymphatic system. Factors Which May Interfere with Functions of the Spleen. Enlargement of the spleen is one of the most critical spleen problems."}]