[{"url": "http://www.payscale.com/research/IN/Job=Senior_Mechanical_Engineer/Salary", "passage_text": "(India). A Senior Mechanical Engineer earns an average salary of Rs 602,441 per year. Most people move on to other jobs if they have more than 20 years' experience in this field. Experience has a moderate effect on income for this job. The skills that increase pay for this job the most are ANSYS, Computer Aided Engineering (CAE), Engineering Design, and Product Development."}, {"url": "http://www.indeed.com/salary/q-Mechanical-Engineer-l-UNITED-STATES.html", "passage_text": "Average Mechanical Engineer salaries for job postings in United States are the same as average Mechanical Engineer salaries for job postings nationwide. "}, {"url": "http://www.payscale.com/research/IN/Job=Mechanical_Engineer/Salary", "passage_text": "Mechanical Engineer Salary. (India). The average pay for a Mechanical Engineer is Rs 359,154 per year. Most people with this job move on to other positions after 10 years in this career. Skills that are associated with high pay for this job are Engineering Design, C++, ANSYS, and SolidWorks. Experience strongly influences income for this job."}, {"url": "http://www1.salary.com/Mechanical-Engineer-II-salary.html", "passage_text": "For example the median expected annual pay for a typical Mechanical Engineer II in the United States is $76,172, so 50% of the people who perform the job of Mechanical Engineer II in the United States are expected to make less than $76,172. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. 3  Benefits. Our team of Certified Compensation Professionals has analyzed survey data collected from thousands of HR departments at companies of all sizes and industries to present this range of annual salaries for people with the job title Mechanical Engineer II in the United States."}, {"url": "http://money.usnews.com/careers/best-jobs/mechanical-engineer/salary", "passage_text": "Salary Outlook. According to the BLS, mechanical engineers earned a median salary of $82,100 in 2013. The best-paid earned about $123,340, while the lowest-paid earned less than $52,550. Industries that pay well include oil and gas extraction as well as information services. With an average salary of $85,930 in 2013, mechanical engineers are filling their coffers at a higher rate than a number of other technology jobs. Computer programmers, by comparison, make $80,930. The gap is wider for computer support specialists, who earn an average annual salary of $64,160"}, {"url": "http://www.naukrihub.com/salary-in-india/mechanical-engineering-salary-in-india.html", "passage_text": "Filed Under: Salary in India Tagged With: industries & cities in india. Check out the annual average salary of mechanical engineer, Mechanical Engineering Salary: Know how much a mechanical engineering Salary earn by experience. Mechanical Engineering is one of the broadest fields of engineering with its applications ranging from aircrafts and medical devices to robots and ships etc. With bright prospects in computer applications, mechanical engineers can look forward to impressive pay packages. Let us learn more:"}, {"url": "http://www.naukrihub.com/salary-in-india/mechanical-engineering-salary-in-india.html", "passage_text": "Mechanical Engineering Salary: Based on Experience. On an average a mechanical engineer can expect salaries of around INR 140,833 – INR811,408 with variations primarily based on experience, gender, costs of living etc. Mechanical Engineering is one of the broadest fields of engineering with its applications ranging from aircrafts and medical devices to robots and ships etc. With bright prospects in computer applications, mechanical engineers can look forward to impressive pay packages. Let us learn more:"}]