[{"url": "http://www.plasticsurgeryseattle.net/html/bellafill.php", "passage_text": "The cost of your Bellafill treatment depends on the amount of Bellafill used and is typically $1000 per 1cc syringe. Special multi-syringe promotions and package pricing may at times be available. You will discuss your goals with you provider and select the appropriate amount of Bellafill to use."}, {"url": "http://www.yourplasticsurgeryguide.com/injectables-and-fillers/artecoll.htm", "passage_text": "Bellafill was FDA approved in October 2006 for the treatment of nasolabial folds (smile lines) and has also been used off-label for lip augmentation, acne scars, and other wrinkles. It is the only permanent dermal filler approved in the U.S. Bellafill is a gel filler consisting of millions of synthetic microspheres (polymethylmethacrylate or PMMA) suspended in purified bovine (cow) collagen. Bellafill also contains the local anesthetic lidocaine to reduce discomfort during injection."}, {"url": "http://www.plasticsurgeryseattle.net/html/bellafill.php", "passage_text": "BELLAFILL COST. The cost of your Bellafill treatment depends on the amount of Bellafill used and is typically $1000 per 1cc syringe. Special multi-syringe promotions and package pricing may at times be available. You will discuss your goals with you provider and select the appropriate amount of Bellafill to use."}, {"url": "http://www.enhancemyself.com/artefill/", "passage_text": "On average, the cost for Bellafill injections are around $1,000 per syringe. More than one syringe may be needed depending on the goals of the procedure. While this cost is higher than many other dermal fillers the results last longer, reducing the need for repeat visits and leading to lower costs over time."}, {"url": "http://www.aestheticsurgerycenter.com/non-surgical/injectables-fillers/bellafill", "passage_text": "Bellafill® is a filler that is injected into the dermis for correction of moderate to severe facial wrinkles and folds. It is the first non-resorbable (permanent) filler approved by the FDA. Bellafill® is polymethylmethacrylate (PMMA) coupled with a purified bovine collagen gel carrier."}, {"url": "http://www.yourplasticsurgeryguide.com/injectables-and-fillers/artecoll.htm", "passage_text": "Bellafill treatment usually requires only 15-20 minutes, but two treatment sessions may be necessary to achieve full wrinkle correction. The treatments are typically performed three to six weeks apart. Before receiving Bellafill, you may first try a temporary filler to confirm your desired result."}, {"url": "http://www.beautologie.com/medspa/injectables-and-fillers/dermal-fillers/", "passage_text": "Bellafill ® Ballpark: $900-$1500 / syringe. 1  Facial Fillers such as Restylane ® , Perlane ® /Restylane ® Lyft, Juvederm ® , Belotero ® , and other fillers are usually 30-minute, in office injectable procedures that can take years off in terms of facial aging by restoring fullness that was once present."}]