[{"url": "http://home.hiwaay.net/~krcool/Astro/moon/moonring/", "passage_text": "Anatomy of a Moon Halo. The ring that appears around the moon arises from light passing through six-sided ice crystals high in the atmosphere. These ice crystals refract, or bend, light in the same manner that a camera lens bends light. Give it a try the next time you observe a moon halo. Rings Around The Sun-The same phenomena that causes lunar halos can also be observed around the sun. A few photos of solar halos using a Coolpix 995 digital camera. NOTICE: Never look at or photograph the sun directly."}, {"url": "http://www.dailymail.co.uk/sciencetech/article-2937745/Did-halo-surrounding-moon-night-Stunning-ring-light-caused-ice-crystals-atmosphere.html", "passage_text": "‘Ice halos are atmospheric phenomena that can occur around the sun or the moon, when tiny crystals of ice in the atmosphere refract and reflect light, creating a halo around the solar or lunar source,’ Ben Biggs, Editor for All About Space magazine, told MailOnline. The light refracts at angles no smaller than 22° in the ice crystals (illustrated) - sometimes leading the phenomenon to be called a 22° halo-which results in a ring around 44 times larger than the moon itself."}, {"url": "https://en.wikipedia.org/wiki/Planetary_ring", "passage_text": "A ring system is a disk or ring orbiting an astronomical object that is composed of solid material such as dust and moonlets, and is a common component of satellite systems around giant planets. A ring system around a planet is also known as a planetary ring system. "}, {"url": "http://www.universetoday.com/20402/ring-around-the-moon/", "passage_text": "Ring around the Moon from Costa Rica. Image credit: Bruce Thomson. The ring around the Moon is caused by the refraction of Moonlight (which is really sunlight) through ice crystals suspended in the upper atmosphere. These ice crystals always have a hexagonal shape, so they always refract light at the same angle. "}, {"url": "http://www.answers.com/Q/What_is_the_giant_ring_around_the_moon_called", "passage_text": "If you are referring to the ring of light sometimes seen around the Moon, then it is called a halo and is a result of moonlight reflecting and refracting in tiny ice crystals located in clouds or the upper atmosphere. There is no giant ring around the moon, but if there was one it would simply be called a 'ring'. A ring is made up of tiny shards of dust and rocks orbiting around a body. who ever typed the above is a dork because i just saw the ring around the moon and came in to look it up! Its called a Halo"}, {"url": "https://en.wikipedia.org/wiki/22%C2%B0_halo", "passage_text": "A 22 degree halo around the moon in Atherton, CA. A 22° halo is a halo, one type of optical phenomenon, forming a circle with a radius of approximately 22° around the Sun, or occasionally the Moon (also called a moon ring or winter halo). It forms as sunlight is refracted in millions of randomly oriented hexagonal ice crystals suspended in the atmosphere. Another phenomenon resulting in a ring around the Sun/Moon—and therefore sometimes confused with the 22° halo—is the corona. Unlike the 22° halo, however, it is produced by water droplets instead of ice crystals and it is much smaller and more colorful."}, {"url": "https://answers.yahoo.com/question/index?qid=20110119223444AAchM7K", "passage_text": "Relevance. Rating Newest Oldest. Best Answer: Haloes are caused by refraction through ice crystals in cirrostratus cloud. The most common is the 22° halo which is a ring around the sun or the moon. Sundogs or moondogs are bright spots which appear sometimes on the 22° halo either side of the sun or moon. There are many different halo phenomena caused by ice crystals with different shapes but most of them are only seen in polar regions"}, {"url": "http://home.hiwaay.net/~krcool/Astro/moon/moonring/", "passage_text": "A Ring Around The Moon. The ring around the Moon is caused by the refraction of Moonlight (which of course is reflected sunlight) from ice crystals in the upper atmosphere. The shape of the ice crystals results in a focusing of the light into a ring. Give it a try the next time you observe a moon halo. Rings Around The Sun-The same phenomena that causes lunar halos can also be observed around the sun. A few photos of solar halos using a Coolpix 995 digital camera. NOTICE: Never look at or photograph the sun directly."}]