[{"url": "http://www.livestrong.com/article/406559-what-does-walking-in-freezing-weather-do-to-your-lungs/", "passage_text": "It is said that freezing weather can chill you to the bone. Not only does your body feel uncomfortable during inclement weather, but your lungs are also affected when the temperatures freeze. The lungs function best in warm, humid weather. When you venture outside in freezing weather, you may find it difficult to breathe. Symptoms are worse if you have lung disease."}, {"url": "http://forums.mtbr.com/passion/so-what-temperature-do-your-lungs-freeze-73971.html", "passage_text": "Freezing is 32 degrees Fahrenheit. -40C is 40 degrees Celsius below freezing. Freezing is 0 degrees Celsius. And moose have long snouts in part to prewarm the air to their lungs."}, {"url": "http://runners-resource.com/can-cold-air-freeze-lungs/", "passage_text": "The good news is that our bodies are highly adapted to living in cold weather and there are many built-in protections that ensure that our lungs will not freeze from cold air. First, air is immediately heated up when it reaches your nose and mouth due to mucous."}, {"url": "http://forums.mtbr.com/passion/so-what-temperature-do-your-lungs-freeze-73971.html", "passage_text": "I'm curious... breathing in sub-zero temperatures kinda makes me cough... at what point does it become a real serious problem.... I read some book about dogsledding or something in high school and they were saying that if you got the dogs running to hard and they started to pant their lungs could freeze...."}, {"url": "http://www.runnersworld.com/ask-the-sports-doc/will-my-lungs-freeze-on-a-cold-run", "passage_text": "So, you do not need to worry about freezing your lungs when you shoot for a run on the coldest day of the year. You do have to worry about frost bite of your nose and cheeks when you are running in extreme cold, especially if it is windy. A balaclava or face mask that covers your skin will reduce the frostbite risk."}, {"url": "http://www.active.com/fitness/articles/is-running-in-the-cold-bad-for-your-lungs", "passage_text": "You'll freeze your lungs if you run in that frigid air, they say. You've maybe even thought it yourself: At what temperature will the cold air damage your lungs? Research shows that runners are not in danger of freezing their lungs, even in the coldest places on Earth such as the North and South Poles."}]