[{"url": "https://en.wikipedia.org/wiki/Complex_volcano", "passage_text": "Kelimutu, Flores, Indonesia. A complex volcano, also called a compound volcano, is a volcano with more than one feature. They form because of changes in their eruptive characteristics or the location of multiple vents in an area."}, {"url": "http://encyclopedia2.thefreedictionary.com/Complex+volcano", "passage_text": "compound volcano. (geology). A volcano consisting of a complex of two or more cones. A volcano with an associated volcanic dome."}, {"url": "http://www.answers.com/Q/What_is_a_complex_volcano", "passage_text": "A volcano is an opening in the crust of the Earth through which molten rock and gases from the interior of the Earth reach the surface. The definition of volcano can include t … he mountain like structures that may be created from the material ejected at the volcano."}, {"url": "http://volcano.oregonstate.edu/rhyolite-caldera-complexes", "passage_text": "Rhyolite caldera complexes are the most explosive of Earth's volcanoes but often don't even look like volcanoes. They are usually so explosive when they erupt that they end up collapsing in on themselves rather than building any tall structure (George Walker has termed such structures inverse volcanoes)."}, {"url": "http://worldlandforms.com/landforms/volcano/5-types-of-volcanoes/complex-volcanoes-or-compound-volcanoes/", "passage_text": "Features. Complex Volcanoes is one of the most fascinating features in the world. They are sometimes called compound volcanoes. This is because they have numerous features. These features depend on type on the methodology of the process of formation. Their towering peaks upsurge hundreds to thousands of meters."}, {"url": "http://www.volcanolive.com/complex.html", "passage_text": "Complex Volcano-John Seach. Complex volcanoes are mixed landforms. In most cases, they occur because of changes either in eruptive. habit or in location of the principal vent area. A stratovolcano may form a large explosion crater that later. becomes filled by a lava dome, or several new cones and craters may develop on a caldera's rim."}]