[{"url": "http://wanttoknowit.com/what-do-porcupines-eat/", "passage_text": "25 May, 2011 what do animals eat 4. The porcupine is a large, spiny rodent that can be found in the Americas, southern Asia, and Africa. They are well known for their coat of sharp spines or quills. They are the third largest rodent on the earth after the capybara and the beaver. Porcupines can be brown, black or, in unusual cases, white. In the winter when food is scarce the porcupine will also eat bark. Porcupines often climb trees to find food such as leaves and berries. Porcupines need natural slat in their diet and often get this from plants such as yellow water lilies and aquatic liverwort."}, {"url": "http://www.aquariumcreationsonline.net/Pufferfish_saltwaterfish.html", "passage_text": "Food and diet: The Porcupine Puffer needs a varied diet of meaty foods including; squid, krill, clams, and hard shelled shrimp to help wear down their ever growing teeth. Reef Compatability: It is not well-suited to the reef aquarium as it is likely to eat many types of sessile invertebrates. Food and diet: The Arothron Puffer needs a varied diet of meaty foods including; squid, krill, clams, and hard shelled shrimp to help wear down their ever growing teeth. Reef Compatability: It is not well-suited to the reef aquarium as it is likely to eat many types of sessile invertebrates."}, {"url": "http://www.fishlore.com/profile-porcupinepuffer.htm", "passage_text": "Smaller fishes and crustaceans may become Porcupine Puffer dinner. So that eliminates them as a choice for the reef tank setup. Porcupine Puffer Fish eat crustaceans in the wild and will accept most types of marine fish food including frozen, freeze dried, vitamin enriched flakes and live foods. Small pieces of fresh shrimp and clam can be chopped up and given. Give them a variety of foods but mostly meaty items for optimal health. Anything smaller could become puffer snacks. Not suitable for a reef tank setup. Fish Disease: Saltwater Fish Disease-Diagnose, Symptoms and Treatment. Diet / Foods: Porcupine Puffer Fish like to eat crustaceans so frozen meaty marine cubes work well as well as small pieces of fresh shrimp. Give them some of the herbivore frozen foods a few times per week and try to get them to eat vitamin enriched flake foods too"}, {"url": "http://wanttoknowit.com/what-do-porcupines-eat/", "passage_text": "The Diet of the Porcupine. The porcupine is a herbivore meaning that they only eat plant matter. It eats a variety of plants, leaves, twigs and herbs. It prefers green plants such as skunk cabbages and clover. In the winter when food is scarce the porcupine will also eat bark. Porcupines often climb trees to find food such as leaves and berries. Porcupines need natural slat in their diet and often get this from plants such as yellow water lilies and aquatic liverwort."}, {"url": "http://www.answers.com/Q/What_do_puffer_fish_eat", "passage_text": "Answer by Anmol111. Confidence votes 348. Puffer fish are a carnivore, and tend to be nocturnal hunters. They have to eat hard-shelled, meaty food in order to survive, including crabs, clams, snails, oysters, crayfish, cut up prawns and shrimp. They do not eat humans. "}, {"url": "http://www.liveaquaria.com/product/prod_display.cfm?pcatid=244", "passage_text": "The Porcupine Puffer is also known as the Porcupinefish or Porcupine Pufferfish. It has spiny appendages which cover most of its body, which may vary from light gray to mottled tans, sometimes with dark spots. Its teeth are actually a fused beak-like structure. A 180 gallon or larger, fish-only aquarium with a good protein skimmer is a suitable home. It may be aggressive at times, nipping the fins of tank mates and leaving a circular hole as its mark. It will eat invertebrates found in a reef aquarium."}, {"url": "http://animal-world.com/encyclo/marine/puffers/porcupine.php", "passage_text": "Foods: Puffers are primarily predatory fish in the wild, though they do graze on algae as well. Acceptable foods include shellfish, crustaceans and hard shelled foods such as snails. A large variety of all kinds of live and frozen meaty foods are best. It is best to feed small amounts several times a day. This one is doing what most Porcupine Puffer or Porcupinefish do very well, (besides eating) it is puffing up! The Porcupine Puffer or Porcupinefish will become accustomed to being fed and will eventually look to their owners for food and will take it from your hand."}, {"url": "http://thegoldfishtank.com/goldfish-food/what-do-goldfish-eat/", "passage_text": "Feeding your goldfish the right kind of food – and the right amount of food – is a key part of proper goldfish care. Eating the wrong type, or wrong amount, of food can be very bad for your fish. In this article, we look at the types of food goldfish eat. In the wild, goldfish eat crustaceans, plants, insects and will sometimes even eat smaller fish. While you obviously can’t match their natural diet exactly, you should try to feed your goldfish food that is similar to what they would eat in the wild."}]