[{"url": "https://en.wikipedia.org/wiki/Inorganic_compound", "passage_text": "Inorganic compounds can be defined as any compound that is not organic. Some simple compounds which contain carbon are usually considered inorganic. These include carbon monoxide, carbon dioxide, carbonates, cyanides, cyanates, carbides, and thiocyanates. Organic chemists traditionally refer to any molecule containing carbon as an organic compound and by default this means that inorganic chemistry deals with molecules lacking carbon. although many minerals are of biological origin."}, {"url": "http://www.softschools.com/examples/science/inorganic_compounds_examples/321/", "passage_text": "An inorganic compound is any compound that lacks a carbon atom, for lack of a more in-depth definition. Those compounds with a carbon atom are called organic compounds, due to their root base in an atom that is vital for life. Examples of Inorganic Compounds: 1. H 2 O-Water is a simple inorganic compound, even though it contains hydrogen, a key atom (along with carbon) in many organic compounds. The atoms in a molecule of water have formed very simple bonds due to this lack of carbon. 2"}, {"url": "http://www.softschools.com/examples/science/inorganic_compounds_examples/321/", "passage_text": "Inorganic compounds are often quite simple, as they do not form the complex molecular bonds that carbon makes possible. A common example of a simple inorganic compound would be sodium chloride, known more commonly as household salt. Examples of Inorganic Compounds: 1. H 2 O-Water is a simple inorganic compound, even though it contains hydrogen, a key atom (along with carbon) in many organic compounds. The atoms in a molecule of water have formed very simple bonds due to this lack of carbon. 2"}, {"url": "http://study.com/academy/lesson/what-are-inorganic-compounds-definition-characteristics-examples.html", "passage_text": "Simply put, an inorganic compound is the opposite of an organic compound. In order to better understand how inorganic compounds are defined, it helps to know what makes other compounds organic in the first place. An inorganic compound can be considered as a compound that does not contain a carbon to hydrogen bond (C-H). Therefore, one can define an inorganic compound as any compound with no C-H bonds. Moreover, inorganic compounds tend to be mineral, or geologically-based compounds that do not contain carbon to hydrogen bonds. Not all, but most inorganic compounds contain a metal. For example, while in the solid state, inorganic compounds are poor conductors of electricity. However, in the liquid phase, inorganic compounds are highly conductive. In this phase, inorganic compounds' electrons are able to move very freely, and this movement of electrons is noted as"}, {"url": "http://www.biology-online.org/dictionary/Inorganic_compound", "passage_text": "Inorganic compound. Definition. noun, plural: inorganic compounds. Any compound lacking carbon atoms, or when present is ionically bound to other atoms. Supplement. A very common example of inorganic compound is water. Some inorganic compounds containing carbon atoms are carbonates, simple oxides of carbon and cyanides, as well as the allotropes of carbon. Word origin: named after the early notion that inorganic compounds are not of biological origin. Compare: organic compound. "}, {"url": "http://www.answers.com/Q/What_is_an_inorganic_compound", "passage_text": "An inorganic molecule is a substance that does not contain carbon; they are not normally found in living things. Actually, there are plenty of inorganic compounds in living things. But yes, as the name implies, inorganic chemistry is that chemistry that is not organic chemistry-the chemistry of carbon. A compound that contains no carbon. Salt (Sodium Chloride, NaCl) is an inorganic compound. The classification of an organic compound is that it is a molecule that contains a carbon atom. Everything else can be … considered inorganic. Some molecules that contain carbon are also inorganic such as carbon dioxide or calcium carbonate."}, {"url": "https://en.wikipedia.org/wiki/Inorganic_compound", "passage_text": "An inorganic compound is a compound that is considered not  organic . Inorganic compounds are traditionally viewed as being synthesized by the agency of geological systems. In contrast, organic compounds are found in biological systems. The distinction between inorganic and organic compounds is not always clear. Organic chemists traditionally refer to any molecule containing carbon as an organic compound and by default this means that inorganic chemistry deals with molecules lacking carbon. although many minerals are of biological origin."}, {"url": "http://www.thefreedictionary.com/inorganic+compound", "passage_text": "1. inorganic compound-any compound that does not contain carbon. carbide-a binary compound of carbon with a more electropositive element. chemical compound, compound - (chemistry) a substance formed by chemical union of two or more elements or ingredients in definite proportion by weight. "}]