[{"url": "http://www.babycenter.com/404_when-can-i-hear-my-babys-heartbeat_10349811.bc", "passage_text": "The baby's heart starts to beat at around 6 weeks. You may be able to hear – and see – your baby's heart beat for the first time when you're about 8 weeks pregnant if you have an early ultrasound exam. 1 Hearing it for the first time can be very moving. 2  The heart rate of a healthy baby in the womb ranges from about 120 to 160 beats per minute. 3  A heartbeat that's much faster or slower than that may signal a heart problem."}, {"url": "http://www.webmd.com/baby/doppler", "passage_text": "Most women first hear their baby's heartbeat during a routine checkup that uses the fetal Doppler early in their pregnancy. Many ultrasound machines also allow the heartbeat to be heard even before it can be heard with a handheld Doppler. Most women now get an ultrasound prior to 12 weeks. Keep in mind that a baby's heartbeat is much faster than an adult's. If you're in your first trimester and you can't hear your baby's heartbeat, don't worry. Dopplers can't reliably detect a baby's heartbeat until 10 to 12 weeks. Your doctor may try again on your next visit."}, {"url": "http://www.modernmom.com/2c2bb342-051f-11e2-9d62-404062497d7e.html", "passage_text": "Detecting a Gestational Sac on Ultrasound. The gestational sac is seen earlier than a fetus can be detected on an ultrasound. A gestational sac can be seen as early as the fifth week of pregnancy or three weeks after conception. If no gestational sac is seen, it could mean that the expectant mother ovulated late. A fetus can be detected as early as the sixth week of pregnancy. Many ultrasound technicians prefer to wait until at least that point in the pregnancy to do an ultrasound and many prefer waiting until the eighth week of pregnancy when more of the development of the fetus can be seen."}, {"url": "http://www.babycenter.com/404_when-can-i-hear-my-babys-heartbeat_10349811.bc", "passage_text": "1 She'll cover it with ultrasound gel and move it around on your belly until she finds a spot where the heartbeat can be detected. 2  The Doppler sends and receives sound waves that bounce off your baby's heart. 3  In this way the fetal Doppler makes your baby's heartbeats loud enough for you to hear. 1 Hearing it for the first time can be very moving. 2  The heart rate of a healthy baby in the womb ranges from about 120 to 160 beats per minute. 3  A heartbeat that's much faster or slower than that may signal a heart problem."}, {"url": "http://americanpregnancy.org/pregnancy-complications/early-fetal-development/", "passage_text": "Generally from 6 ½ -7 weeks is the time when a heartbeat can be detected and viability can be assessed. A normal heartbeat at 6-7 weeks would be 90-110 beats per minute. The presence of an embryonic heartbeat is an assuring sign of the health of the pregnancy. Once a heartbeat is detected, the chance of the pregnancy continuing ranges from 70-90% dependent on what type of ultrasound is used. A strong fetal heartbeat should be detectable by ultrasound, with a heartbeat of 140-170 bpm by the 9th week. If a strong heartbeat is not detected at this point, another ultrasound scan may be done to verify the viability of the fetus."}, {"url": "http://www.advancedwomensimaging.com.au/first-trimester-dating-ultrasound", "passage_text": "1 Confirming the presence of your baby’s heartbeat. 2  You may have gone to your doctor with vaginal bleeding or you may be anxious because of problems in a previous pregnancy (such as miscarriage). 3  This ultrasound can routinely detect a heartbeat in your baby as early as 6-7 weeks. 1 You may have gone to your doctor with vaginal bleeding or you may be anxious because of problems in a previous pregnancy (such as miscarriage). 2  This ultrasound can routinely detect a heartbeat in your baby as early as 6-7 weeks. 3  Confirming the correct dates of your pregnancy."}, {"url": "https://en.wikipedia.org/wiki/Fetal_heartbeat_bill", "passage_text": "A fetal heartbeat bill is a form of proposed anti-abortion legislation based on the notion that a fetus is a person as soon as it has a heartbeat. Fetal heartbeats can be detected at about six to seven weeks into the pregnancy, but may be as late as twelve weeks when detected with a Doppler fetal monitor. "}, {"url": "http://www.babycenter.com/404_when-can-i-hear-my-babys-heartbeat_10349811.bc", "passage_text": "Your caregiver may be able to find it with the Doppler as early as 10 weeks, but it's more common to hear it at 12 weeks. How early the sound can be picked up depends on your baby's position in your uterus, your weight, and the accuracy of your due date. 1 Hearing it for the first time can be very moving. 2  The heart rate of a healthy baby in the womb ranges from about 120 to 160 beats per minute. 3  A heartbeat that's much faster or slower than that may signal a heart problem."}, {"url": "http://www.answers.com/Q/When_can_the_heartbeat_first_be_detected", "passage_text": "Sometimes it's possible to detect the heartbeat, with a Doppler instrument, almost this early, but usually the first such detection is later, around week 10, or at least by week 12. By week 21, the heart can be heard with a standard stethoscope. I was told that they can not detect a heart beat before 6 weeks old with a scan. therefore you must be at least 6 weeks pregnant before the scan will pick up the heart b … eat."}, {"url": "http://www.webmd.com/baby/doppler", "passage_text": "Hearing your baby's heartbeat for the first time can be deeply moving. Keep in mind that a baby's heartbeat is much faster than an adult's. If you're in your first trimester and you can't hear your baby's heartbeat, don't worry. Dopplers can't reliably detect a baby's heartbeat until 10 to 12 weeks. Your doctor may try again on your next visit."}]