[{"url": "http://medical-dictionary.thefreedictionary.com/Economic+investment", "passage_text": "investment (invest´ment) , n the material used to enclose or surround a pattern of a dental restoration for casting or molding or to maintain the relations of metal parts during soldering. investment. 1. any tissue, such as fascia, that envelops or covers other tissues or parts. 2. a material applied as a soft paste to a pattern that hardens to form a mold for casting."}, {"url": "http://lexicon.ft.com/Term?term=foreign-direct-investment", "passage_text": "Definition of foreign direct investment. Investment from one country into another (normally by companies rather than governments) that involves establishing operations or acquiring tangible assets, including stakes in other businesses. "}, {"url": "http://www.businessdictionary.com/definition/investment-spending.html", "passage_text": "Definition. Money spent on capital goods, or goods used in the production of capital, goods, or services. Investment spending may include purchases such as machinery, land, production inputs, or infrastructure. "}, {"url": "http://www.economicshelp.org/blog/4987/economics/foreign-direct-investment/", "passage_text": "Definition of Foreign Direct Investment (FDI). 1  FDI is the net transfer of funds to purchase and acquire physical capital, such as factories and machines, e.g. 2  In recent years, foreign direct investment has also widened to include purchase of assets and shares which give investors a management interest in a firm. 3  The World Bank define foreign ... Most foreign direct investment is taken by firms and multinational corporations, who hope to benefit from some of these advantages: 1  Take advantage of lower labour costs in other countries (e.g. India is one of biggest recipients of FDI, where labour costs are much lower than in OECD."}, {"url": "http://www.investopedia.com/terms/i/investment.asp", "passage_text": "DEFINITION of 'Investment'. An asset or item that is purchased with the hope that it will generate income or appreciate in the future. In an economic sense, an investment is the purchase of goods that are not consumed today but are used in the future to create wealth. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Economic+investment", "passage_text": "investment, hygroscopic. n a type specially designed for use with the hygroscopic investing techniques. investment, phosphate-bonded casting, n a type that is bonded by a phosphate and a metallic oxide that react to form a hard mass; generally used for high-fusing alloys. investment. 1. any tissue, such as fascia, that envelops or covers other tissues or parts. 2. a material applied as a soft paste to a pattern that hardens to form a mold for casting."}, {"url": "http://www.businessdictionary.com/definition/investment.html", "passage_text": "Definitions (2). 1. Money committed or property acquired for future income. 2.Two main classes of investment are (1) Fixed income investment such as bonds, fixed deposits, preference shares, and (2) Variable income investment such as business ownership (equities), or property ownership. "}, {"url": "http://www.economicshelp.org/blog/4987/economics/foreign-direct-investment/", "passage_text": "Tejvan Pettinger February 16, 2012 economics. Definition of Foreign Direct Investment (FDI). 1  FDI is the net transfer of funds to purchase and acquire physical capital, such as factories and machines, e.g. 2  Nissan a Japanese firm building a car factory in the UK. Most foreign direct investment is taken by firms and multinational corporations, who hope to benefit from some of these advantages: 1  Take advantage of lower labour costs in other countries (e.g. India is one of biggest recipients of FDI, where labour costs are much lower than in OECD."}]