[{"url": "http://whatis.techtarget.com/definition/time", "passage_text": "Time is an observed phenomenon, by means of which human beings sense and record changes in the environment and in the universe. A literal definition is elusive. Time has been called an illusion, a dimension, a smooth-flowing continuum, and an expression of separation among events that occur in the same physical location. Time is a practical convenience in modern lif"}, {"url": "http://whatis.techtarget.com/definition/time", "passage_text": "All of these time zones are referenced to the time at the longitude of Greenwich, England. A universal standard, coinciding almost exactly with the time at Greenwich, is known as Coordinated Universal Time (UTC). There are various other time standards. Time has been called an illusion, a dimension, a smooth-flowing continuum, and an expression of separation among events that occur in the same physical location. Time is a practical convenience in modern life"}, {"url": "http://www.macmillandictionary.com/dictionary/british/time_1", "passage_text": "90% of the time, speakers of English use just 7,500 words in speech and writing. These words appear in red, and are graded with stars. One-star words are frequent, two-star words are more frequent, and three-star words are the most frequent. Definition and synonyms of time from the online English dictionary from Macmillan Publishers Limited."}, {"url": "https://en.wikipedia.org/wiki/Time", "passage_text": "Events in the past can be ordered in a sequence (creating a chronology), and can be put into chronological groups (periodization). One of the most important systems of periodization is the geologic time scale, which is a system of periodizing the events that shaped the Earth and its life. Time travel is the concept of moving backwards or forwards to different points in time, in a manner analogous to moving through space, and different from the normal flow of time to an earthbound observer. In this view, all points in time (including future times) persist in some way."}, {"url": "https://en.wikipedia.org/wiki/Time", "passage_text": "Two contrasting viewpoints on time divide many prominent philosophers. One view is that time is part of the fundamental structure of the universe —a dimension independent of events, in which events occur in sequence. Sir Isaac Newton subscribed to this realist view, and hence it is sometimes referred to as Newtonian time. Time travel is the concept of moving backwards or forwards to different points in time, in a manner analogous to moving through space, and different from the normal flow of time to an earthbound observer. In this view, all points in time (including future times) persist in some way."}, {"url": "http://www.thefreedictionary.com/time", "passage_text": "b. (as modifier): time travel. temporal. 2. (General Physics) physics a quantity measuring duration, usually with reference to a periodic process such as the rotation of the earth or the vibration of electromagnetic radiation emitted from certain atoms. Time is usually an uncountable noun, so don't use 'a' with it. Don't say, for example, ' I haven't got a time to go shopping '. Say 'I haven't got time to go shopping'."}, {"url": "https://en.wikipedia.org/wiki/Time", "passage_text": "Time is a measure in which events can be ordered from the past through the present into the future, and also the measure of durations of events and the intervals between them. Time travel is the concept of moving backwards or forwards to different points in time, in a manner analogous to moving through space, and different from the normal flow of time to an earthbound observer. In this view, all points in time (including future times) persist in some way."}, {"url": "http://www.investopedia.com/terms/t/timeseries.asp", "passage_text": "DEFINITION of 'Time Series'. A sequence of numerical data points in successive order, usually occurring in uniform intervals. In plain English, a time series is simply a sequence of numbers collected at regular intervals over a period of time. Time series analysis can be useful to see how a given asset, security or economic variable changes over time or how it changes compared to other variables over the same time period."}, {"url": "http://www.investorwords.com/4981/time_order.html", "passage_text": "Definition. An order to execute a specified transaction at a specific time. If the order is not executed at that time, it is either cancelled or becomes a market order or a limited price order (depending on the specifications of that particular order). "}]