[{"url": "http://www.nolo.com/legal-encyclopedia/paid-vacation-what-are-rights-33485.html", "passage_text": "For example, they are legally allowed to reserve paid vacation only for full-time employees. And many do: The Bureau of Labor Statistics reports that, while 91% of full-time employees in private industry receive some paid vacation, only 37% of part-time employees do. Because no law requires employers to provide paid vacation, employers have free reign when it comes to determining how much vacation to offer and to which employees. Employers can provide only a few paid days off a year or a couple of months' worth."}, {"url": "http://www.usatoday.com/story/money/business/2013/06/08/countries-most-vacation-days/2400193/", "passage_text": "In addition, there are between nine to 13 paid holidays, in addition to the 24 paid vacation days. Unlike many other eurozone nations, Germany has fairly low unemployment, with just 5.5% of workers out of a job as of 2012. By law, every country in the European Union has at least four work weeks of paid vacation. Austria, which guarantees workers the most time off, has a legal minimum of 22 paid vacation days and 13 paid holidays each year. The average private sector U.S. worker receives 16 paid vacation days and holidays. One in four Americans does not have a single paid day off"}, {"url": "http://www.wikihow.com/Become-an-Airline-Pilot", "passage_text": "For the commercial certificate, you will need 250 hours total time, 100 hours PIC, 50 hours cross country, and 10 hours of dual instruction in a complex aircraft. 1  All pilots who are paid to transport passengers or cargo must get a commercial pilot’s license with an instrument rating issued by the FAA. 1 In recent years, airlines have made cuts to pilot pay, days off, hotel quality and location, uniform expenses, medical and dental plans, and vacation time. 2  Unless the regional carriers radically increase the starting pay ($45,000 or more), it may not be worth your time and money for training."}, {"url": "http://www.wikihow.com/Become-an-Airline-Pilot", "passage_text": "1 To work for a major airline, you will typically need 3,000 hours total flight time including at least 1,500 hours multi-engine, and at least 1000 hours as pilot in command (PIC) of turbine (jet) powered aircraft, preferably in scheduled airline flying and in type of aircraft. 1 In recent years, airlines have made cuts to pilot pay, days off, hotel quality and location, uniform expenses, medical and dental plans, and vacation time. 2  Unless the regional carriers radically increase the starting pay ($45,000 or more), it may not be worth your time and money for training."}, {"url": "http://forums.jetcareers.com/threads/how-much-vacation-time-do-pilots-get.52936/", "passage_text": "Depends on the individual airline's contract. For example, I got a whopping three days this year, but it's because I didn't work a full year last year. When you only work a partial year, your vacation time here is based on full months of service. Next year I'll get 5 days, the year after that I'll get 10. The guys that have been here a while get 3 weeks. That being said, there are ways to extend that WAAAAY past what you actually get awarded. I get 42 days per year. All pilots get that from day one. Similar to others it's pretty easy to add days off on both ends to make for longer stretches in a row. Best I've done is 35 in a row using 24 days of vacation."}, {"url": "http://lifehacker.com/5628777/how-many-vacation-days-do-you-get-every-year", "passage_text": "Total Votes: 18,890. Regardless of how many vacation days you get, it's also worth keeping in mind that you still need to, you know, use them—something Americans are particularly bad at doing. Photo by biker germany. "}, {"url": "http://work.chron.com/benefits-airplane-pilots-7084.html", "passage_text": "Commercial airline pilots made a mean annual salary of $76,050 in May 2011, more than the $45,230 earned across all occupations at the same time, according to the Bureau of Labor Statistics. Although certainly not a bad wage, this is perhaps not as high as some people might suspect a pilot earns. Because pilots are limited to about 1,000 flying hours per year, many people think it's a fairly relaxed job. But pilots actually work about 225 hours each month. This can include non-flight duties such as flight scheduling, record keeping and the arrangement of aircraft maintenance."}]