[{"url": "http://www.healthcare-salaries.com/allied-health-professionals/chiropractor-salary", "passage_text": "Chiropractor salary. Chiropractor’s salary in the United States according to the BLS salary reports is around $132,388 per annum. The annual salary for the upper 10 percent of chiropractors is around more than $228,140 per year, while the lower 10 percent of them earn less than $31,030 per year. Chiropractor salary in USA. An average starting hourly wage for a chiropractor in the United States ranges from between $16 – $45 per hour which gradually increases from $24.57 – $61.6 overtime. An average annual salary for a chiropractor ranges from between $30,612 – $101,100 per annum and a yearly bonus of around $19,987 will be included. The yearly profit sharing is around $31,943, while the commission ranges from between $1,500 – $18,000"}, {"url": "http://www.planetc1.com/chiropractic-articles/salary/chiropractor_salary_pg2.html", "passage_text": "Can a chiropractor make $1000.00 per week, $2000.00 per week, $5000.00 per week, $10,000.00 per week, $20,000 per week, or more? The answer is yes. We have to get away from the can and hopefully address some of the how and the why or else none of this will make much sense. "}, {"url": "http://careerswiki.com/how-much-do-chiropractors-make/", "passage_text": "If you’re wondering, how much do chiropractors make? We can take a look at the figures recorded as a basis. The average chiropractor’s salary is $66,720. This is the median wage calculated by looking at the amount that half the workers in an occupation earned less than, and half earned more than. A chiropractors starting salary is less than $31,440, this is the bracket where the lowest 10% fall. The highest earning 10% earns more than $143,760, displaying a wide bracket and reflecting the difference experience and skillset can make. "}, {"url": "http://www.insidejobs.com/articles/how-much-does-a-chiropractor-make", "passage_text": "The average income for a Chiropractor, according to the U.S. Bureau of Labor Statistics, ranges from $45,540 to $96,700. This is a range based on the number of patients, and Chiropractor salary does tend to grow as the number of patients increases and the business builds. "}, {"url": "http://www.ehow.com/info_7742918_much-chiropractor-make-year.html", "passage_text": "Earnings Potential. As of 2013, the average annual wage of chiropractors was $78,410, according to the Bureau of Labor Statistics. The median wage was $65,300 -- meaning that half of chiropractors earned more than this amount and half earned less. According to the BLS, chiropractors tend to earn less early in their careers but increase their earnings as they establish a client base. Top-Paying States. The top-paying state was Alaska, where chiropractors earned an average annual salary of $152,890. Ohio is the second best-paying state for chiropractors, with an annual average salary of $114,260, and New Jersey chiropractors made $101,090 per year. Anchorage, Alaska, had the best-paid chiropractors of any metropolitan area. They made $169,030 per year"}, {"url": "http://www.healthcare-salaries.com/allied-health-professionals/chiropractor-salary", "passage_text": "The median expected salary for a chiropractor in India is around 74,880 INR per month. The monthly expected salary for a well-experienced chiropractor in India ranges from between INR 50,000 to INR 60,000 per month, which averages to a total annual income of around INR 6,00,000 and INR 7,22,000. Chiropractor salary in USA. An average starting hourly wage for a chiropractor in the United States ranges from between $16 – $45 per hour which gradually increases from $24.57 – $61.6 overtime. An average annual salary for a chiropractor ranges from between $30,612 – $101,100 per annum and a yearly bonus of around $19,987 will be included. The yearly profit sharing is around $31,943, while the commission ranges from between $1,500 – $18"}, {"url": "http://www.wikiprofessional.org/Chiropractor_Salary", "passage_text": "Salary. In 2012, the median salary for chiropractors was $66,160, according to the Bureau of Labor Statistics. This means that half of chiropractors made more than this amount and half of those working in the profession made less than the median amount. 10 percent of chiropractors had a salary of less than $31,030; however, the top 10 percent made $142,950 or more. Experience and length of time in the profession are key factors in how much a chiropractor will earn"}, {"url": "http://www.answers.com/Q/How_much_money_does_a_chiropractor_earn", "passage_text": "25% of American chiropractors earned more than $95,870. 50% of American chiropractors earned less than $67,200. According to a 2008 peer-reviewed research study in Canada: The average gross annual income of chiropractors in the study sample was $144,254. The exact income a chiropractor makes depends on what type of practice they have, how many patients they see, and the location of there practice. Below are a few different sources that provide a general idea of the expected income of a chiropractor."}]