[{"url": "https://simple.wikipedia.org/wiki/History_of_Australia", "passage_text": "People have lived in Australia for about 40,000–60,000 years. The first people who arrived in what is now Australia were the Australian Aborigines and Torres Strait Islanders. Aborigines came by boat from the islands of what is now Indonesia. They lived in all parts of Australia. About 160 000 convicts were brought to Australia from 1788 until 1868. Free immigrants began arriving in the 1790s. For the first few years they did not have much food, and life was very hard. But soon they began to farm, and more people came."}, {"url": "http://www.fifthfleet.net/", "passage_text": "What is the Fifth Fleet? The Fifth Fleet is the name that I have given to the ships which, chartered by the International Refugee Organization (IRO), brought about 164,100 Displaced Persons from Germany to Australia after World War II, between 1947 and 1951. "}, {"url": "http://panique.com.au/trishansoz/aborigine/aborigin.html", "passage_text": "These first humans did not arrive in Australia by boat. At the time the first Aborigines came to Australia 50,000 years ago, humans were still in the Stone Age. They did not have the technology to build seagoing vessels of any kind. Being the first humans to arrive in Australia about 50,000 years ago; the Aborigines discovered Australia. They were the first human inhabitants of Australia. Aboriginal Australians were nomadic hunter-gathers. They roamed from place to place hunting animals and gathering fruits, nuts, yams and insects which they ate."}, {"url": "http://www.australianhistoryresearch.info/the-first-fleet/", "passage_text": "AUSTRALIA’S FIRST FLEET – 1788 by Cathy Dunn. Between 1788 and 1850 the English sent over 162,000 convicts to Australia in 806 ships. The first eleven of these ships are today known as the First Fleet and contained the convicts and marines that are now acknowledged as the Founders of Australia. This is their story. "}, {"url": "http://www.historyaustralia.org.au/ifhaa/ships/1stfleet.htm", "passage_text": "Supply The Fishburn The Borrowdale The Golden Grove. Between 1788 and 1850 the English sent over 162,000 convicts to Australia in 806 ships. The first eleven of these ships are today known as the First Fleet and contained the convicts and marines that are now acknowledged as the Founders of Australia. This is their story. Before 1788, Australia was populated by about 300,000 aborigines. "}, {"url": "https://en.wikipedia.org/wiki/First_Fleet", "passage_text": "The First Fleet is the name given to the 11 ships which left Great Britain on 13 May 1787 to found a penal colony that became the first European settlement in Australia. He was a Marine with the First Fleet on board the flagship Sirius (1786) . He shipped to Norfolk Island on the Golden Grove in September 1788, where he lived with Mary Rolt, a convict who arrived with the First Fleet on the Prince of Wales."}, {"url": "http://panique.com.au/trishansoz/people/peoplehi.html", "passage_text": "The Aboriginals Discovered Australia. The first human inhabitants of Australia were the Aborigines. They came here about 50,000 years ago. Nobody is quite sure exactly how they came to Australia. It is most likely that the aborigines arrived in Australia unintentionally. "}, {"url": "https://simple.wikipedia.org/wiki/History_of_Australia", "passage_text": "In 1788 the British First Fleet of 11 ships, carrying about 1500 people arrived at Sydney. Arthur Phillip led them as the first Governor of New South Wales. About 160 000 convicts were brought to Australia from 1788 until 1868. Free immigrants began arriving in the 1790s. For the first few years they did not have much food, and life was very hard. But soon they began to farm, and more people came."}, {"url": "https://simple.wikipedia.org/wiki/First_Fleet", "passage_text": "The ships sailing into Botany Bay. The First Fleet is the name given to the 11 ships which sailed from Great Britain on 13 May 1787, to start the first European colony in New South Wales. It was a convict settlement, the start of a plan to transport thousands of prisoners to Australia. "}, {"url": "http://www.noborders-group.com/about-us/History-of-Immigration-Australia", "passage_text": "Immigration Australia Timeline. Australia’s Immigration History. Since the arrival of the First Fleet on the shores of Botany Bay in 1788, close to 10 million settlers have come from all corners of the globe to call Australia home."}]