[{"url": "http://www.food.com/recipe/perfect-pork-tenderloin-63828", "passage_text": "1 Remove pork from oven, lightly cover with foil, and let rest 5-10 minutes to redistribute internal juices. 2  Roast should be done, very slightly pink in the center, and very moist. 3  After resting 10 minutes, the roast should reach a safe 145-150 degrees. 1 Weight will determine how long to cook the roast. 2  Preheat oven to 500 degrees. 3  Remove tenderloin from refrigerator. 4  Season meat as desired. 5  Place seasoned meat in an uncovered roasting pan on a shelf in the bottom 1/3 of your oven."}, {"url": "http://startcooking.com/how-to-cook-a-pork-roast", "passage_text": "Continue cooking about 50-80 minutes or until the meat registers 145 degrees on a meat thermometer. Some roasts are long and thin and others are short and fat, consequently the cooking times will vary depending on the shape of your roast. The meat thermometer is the best way to judge the right amount of cooking time. Cooking to this temp, then allowing the roast to rest for 15 minutes after removing from the oven, will take the roast to approximately 150 degrees, at which point you can serve it and it will be the juiciest, most tender pork you can get. Don’t mind it if it’s a bit pink in the middle – it’s ok."}, {"url": "http://www.thekitchn.com/how-to-make-roasted-pork-tenderloin-cooking-lessons-from-the-kitchn-211998", "passage_text": "Swirl to coat the bottom. Roast the pork for 10 minutes: Set the pork in the pan. (It's fine if your pork tenderloin is a little long for the pan; just bend it to fit as we did here.) Return the pan to the oven. Roast for 10 minutes. Flip the pork, reduce the heat, and roast another 10 to 15 minutes: Flip the pork to the other side. The pork is done when its internal temperature registers 140°F to 145°F in the thickest part of the meat (20 to 25 minutes total). Rest for 10 minutes before serving: Transfer the pork to a cutting board, tent with foil, and let it rest for 10 minutes before slicing."}, {"url": "http://dish.allrecipes.com/cooking-questions-pork/", "passage_text": "The rule of thumb for pork roasts is to cook them 25 minutes per pound of meat at 350 degrees F (175 degrees C). Use a thermometer to read the internal temperature of the roast. When the temperature reaches 140 degrees F (60 C), pull the roast out of the oven; it’ll continue to cook due to the residual heat and will reach 145 degrees F (63 C)."}, {"url": "http://www.food.com/recipe/perfect-pork-tenderloin-63828", "passage_text": "1 Preheat oven to 500 degrees. 2  Remove tenderloin from refrigerator. 3  Season meat as desired. 4  Place seasoned meat in an uncovered roasting pan on a shelf in the bottom 1/3 of your oven. 5  Bake EXACTLY 5 1/2 minutes PER POUND. 6  Adjust +/- according to your oven's accuracy and heat retention. 7  NOTE:. 1 Weight will determine how long to cook the roast. 2  Preheat oven to 500 degrees. 3  Remove tenderloin from refrigerator. 4  Season meat as desired. 5"}, {"url": "http://www.bettycrocker.com/how-to/tipslibrary/meat-poultry-fish/how-cook-pork-tenderloin", "passage_text": "Let the tenderloin cool before serving. Pan-roasting pork tenderloin Preheat your oven to 425ºF and coat an ovenproof skillet with oil. Sear the tenderloin over medium-high heat until it’s brown on all sides. Roast the tenderloin for 15 to 20 minutes until the internal temperature reads 145ºF. Cooking pork tenderloin Pork tenderloin is one of the easier meats to cook. You can grill it or roast it. Grilling pork tenderloin Always cook the tenderloin over indirect heat. Depending on its size, it usually takes 20 to 30 minutes over medium-high heat."}, {"url": "http://startcooking.com/how-to-cook-a-pork-roast", "passage_text": "WIth a roast, you generally want to cook to an internal temperature, not a time. But, when you lay it out butterflied, it’s thinner and more of the meat is exposed to heat, so if you were to cook it at 350 degrees at a 1/2 hour/lb. a 6 lb roast would end up ruinously overdone. Cooking to this temp, then allowing the roast to rest for 15 minutes after removing from the oven, will take the roast to approximately 150 degrees, at which point you can serve it and it will be the juiciest, most tender pork you can get. Don’t mind it if it’s a bit pink in the middle – it’s ok."}, {"url": "http://startcooking.com/how-to-cook-a-pork-roast", "passage_text": "Always position the pork roast in the pan so that fat side is on the top. Measure one tablespoon of olive oil in a small dish. Add 1 Tablespoon of dried spices to the oil. You can use rosemary, sage, thyme, or oregano; or a combination of these that equal 1 tablespoon. Cooking to this temp, then allowing the roast to rest for 15 minutes after removing from the oven, will take the roast to approximately 150 degrees, at which point you can serve it and it will be the juiciest, most tender pork you can get. Don’t mind it if it’s a bit pink in the middle – it’s ok."}, {"url": "http://www.thekitchn.com/how-to-cook-and-shred-a-pork-shoulder-for-pulled-pork-79485", "passage_text": "Cook for 2 to 4 hours, until fork tender: Let the pork cook undisturbed for 2 hours, then begin checking it every half hour. Total cooking time will be 2 to 4 hours, depending on the amount of pork and whether it's bone-in (which takes longer to cook). "}, {"url": "http://community.tasteofhome.com/community_forums/f/30/p/154106/155457.aspx", "passage_text": "Should take 30-45 minutes per pound, but, it all depends on the internal temperature of the pork roast, more than the amount of time. It used to be 165F but some people say that is too long or past rare; and 185F is dry and stringy. How to Make Traditional Pork Roast. 4. Place the roasting pan in the oven; cook for 10 minutes, then lower the heat to 300 degrees. 5. Cook for about 45 minutes, then start checking the roast's temperature with an instant-read thermometer. Remove the roast when the internal temperature, measured as deep into the roast as you can get, reads 165 degrees."}]