[{"url": "https://www.cesarsway.com/dog-care/food-and-treats/will-beg-for-food", "passage_text": "How to handle a dog begging for food. Dog begging for food is one of the most common discipline issues that dog owners face. An unfortunate side effect of loving our dogs so much is that we would like to give them everything that they want. 1 If you become concerned about how much your dog should be fed, talk to your veterinarian. 2  This can help ease your concerns and allow you to remain calm and assertive! 3  Use discipline consistently. 4  In any kind of training, consistency is the key to success."}, {"url": "http://pets.webmd.com/dogs/guide/begging-table-dogs", "passage_text": "Or, if your dog is crate trained, you can put her in her crate while you eat. (Please see our article on Weekend Crate Training to learn how to teach your dog to happily relax in a crate.) To keep her busy and quiet, try giving your dog a chew bone, her dinner or a KONG ® toy stuffed with something delicious. If you’d like your dog to stay in the same room with you but refrain from loitering right next to the table or drooling on your shoes, you can use a tether to keep her in her own space. Attach a short leash or tether (four-to six-feet long) to a heavy piece of furniture or an eye-hook in the baseboard."}, {"url": "http://www.petwave.com/Dogs/Behavior/Begging.aspx", "passage_text": "Stop Dog Begging Behavior. One way that people encourage begging habits in their dog is by teaching their dog to beg for a treat such as a doggy bone or a cookie. While this type of begging is fun for the dog and the owner, it can often spread to begging for human food if the owner is not careful."}, {"url": "http://www.k9magazine.com/stop-dog-begging/", "passage_text": "It learns to discriminate between treated and untreated morsels, and to avoid food in the owner's presence. Begging food from the dinner table is one of the easiest things to teach a dog, and also one of the hardest habits to break. Your pet's training to beg begins when he is a young, adorable puppy. "}, {"url": "http://dogs.about.com/od/dogbehaviorproblems/fl/How-to-Train-a-Dog-to-Stop-Begging.htm", "passage_text": "Train the Dog a Place Command. One way to stop dog begging is to teach your dog to go to his place on command. His place can be anything from the rug under the sink to his crate. Practice this command, and whenever you sit down to a meal, have your dog go to his place. "}, {"url": "http://www.wikihow.com/Stop-Your-Dog-from-Begging", "passage_text": "3. Give the dog a time-out.  If your dog will not voluntarily leave the table or continues to beg from its crate, you may need to give the dog time-outs in another room. 1  Immediately after the dog begs, place it in a room with no food or toys. Don't talk to the dog. Unless you are giving the dog a command, don’t give your dog attention by talking to it, or even mentioning its name. 1  No matter how frustrated you get, do not yell at a begging dog. 2  Attention of any kind, even such negative attention, can reinforce the begging behavior."}, {"url": "http://www.petwave.com/Dogs/Behavior/Begging.aspx", "passage_text": "If your dog does beg for food, do not give in. one time is all it takes for a dog to make the connection between begging and a food reward. Instead, ignore your dog when it engages in any type of begging habit or try to immediately redirect your dog’s attention to another type of behavior. One way that people encourage begging habits in their dog is by teaching their dog to beg for a treat such as a doggy bone or a cookie. While this type of begging is fun for the dog and the owner, it can often spread to begging for human food if the owner is not careful."}, {"url": "http://www.everydayhealth.com/pet-health/does-your-dog-beg-for-food.aspx", "passage_text": "Where should you start? Before you can teach your dog to stop begging for food, you have to start with more basic dog obedience training steps, such as “sit” and “lie down,” says Beth Mullen, the owner of Dog Latin Dog Training in the Washington, D.C. area. "}, {"url": "http://pets.webmd.com/dogs/guide/begging-table-dogs", "passage_text": "You can’t really blame your dog for begging at the table. But if you’d like to change her behavior, you can do so by using one or both of the following tactics: 1  Prevent begging by controlling your dog’s access to the table. If you’d like your dog to stay in the same room with you but refrain from loitering right next to the table or drooling on your shoes, you can use a tether to keep her in her own space. Attach a short leash or tether (four-to six-feet long) to a heavy piece of furniture or an eye-hook in the baseboard."}, {"url": "http://dogs.about.com/od/basiccommands/a/beg.htm", "passage_text": "1 Begin with your dog sitting. 2  Hold a treat in front of your dog's nose, and give him the command beg.. 3  Slowly move the treat up so your dog will have to stretch his nose up in the air to reach it. 4  As soon as your dog lifts his nose in the air, click your clicker or tell him good, and give him a treat. "}]