[{"url": "https://www.kombuchakamp.com/kombucha-carbonation-for-beginners", "passage_text": "Kombucha Bubbles: How to Increase Carbonation…for Beginners. One of the most common questions homebrewers have is how to get more carbonation (i.e. fun bubbles) in their Kombucha. Yes, bubbles are fun, and there is something inherently exciting about seeing a fizzy glass of iced Kombucha froth over the edge as you pour. Bubbles add flavor and texture, scientists say. It emphasizes the “living” energy of the drink, and because it’s natural, it feels and tastes different than CO2 that is added."}, {"url": "http://wakethewolves.com/what-is-kombucha-and-is-it-really-good-for-you/", "passage_text": "Kombucha is an “ancient fermented tea beverage” that has a natural effervescence (like bubbly carbonation) that is full of probiotics, antioxidants, B vitamins and so much more. (NOTE: To help you understand some of these terms, check out a quick vocab list at the end of this post.). "}, {"url": "http://www.homegrown.org/group/kombucha/forum/topics/kombucha-carbonation", "passage_text": "It was so nicely carbonated-bubbles, bubbles bubbles. I want that! My Kombucha has a great flavor, but little to no carbonation. It isn't truly flat, as it still has a little bite on the tongue from the acid/vinegar. I've even tried adding a little sugar when bottling... still no bubbles, not even after sitting for 7-10+ days."}, {"url": "http://kombuchahome.com/how-to-increase-kombucha-carbonation/", "passage_text": "6. One of the BEST ways to increase carbonation in your Kombucha is to use small bottles with a latch/sealed top. You can buy these specifically made for kombucha or homeage alcoholic beverages. Using these will almost certainly ensure you will have strong fizz in your kombucha after a second ferment. While most people focus on adding carbonation during secondary fermentation of kombucha you can also adjust the way you do the first fermentation to boost the overall bubbliness of your kombucha tea, whether you do a second ferment or not."}, {"url": "http://www.huffingtonpost.ca/2013/05/30/kombucha_n_3354612.html", "passage_text": "Kombucha is a fizzy, fermented beverage made from tea that is refreshing (especially as the weather heats up) but also great for you. The drink is essentially fermented tea: it's made from sweetened tea, usually black, that is fermented by a bacteria and yeast culture and ends up full of probiotics as a result. "}, {"url": "http://fermentationrecipes.com/making-your-kombucha-fizzy-with-ginger/1116", "passage_text": "If you are anything like me, you much prefer your kombucha to have some carbonation. I’ve struggled some with that over time but now, after probably 50 gallons of kombucha making experience, including various relatively scientific experiments, I’ve figured out a simple and dependable way to make a nice fizzy kombucha. The result will be a carbonated kombucha treat. Lactobacillis bacteria live naturally on Ginger as on many other vegetables and roots. It is this bacteria which feeds off the sugars in the bottled kombucha and adds carbonation as a by-product."}, {"url": "http://smallfarm.about.com/od/diy/a/How-To-Make-Fizzy-Kombucha.htm", "passage_text": "How to Secondary Ferment Kombucha. The basic idea with secondary fermentation is to draw off the kombucha liquid that has been brewing with your scoby. Instead of drinking it right away, pour it into a bottle with a swing-top cap or apply your own bottlecaps to clean beer bottles, as though you were brewing beer. Secondary fermentation is also a great time to add flavors to your kombucha. Fruit is an especially good choice, as is ginger. I love blueberries. This is a place where you will want to experiment to see what tastes good to you. With a few simple rules, the world of flavor will open to you."}, {"url": "http://www.kombuchabrooklyn.com/blog/carbonating-your-kombucha/", "passage_text": "As the primary fermentation process for kombucha is essentially open-air (there is a free exchange of gases taking place between the culture and the outside environment), your kombucha will not inherently retain carbonation. The CO2 produced by your SCOBY's yeast will for the most part be released to the environment. "}, {"url": "http://smallfarm.about.com/od/diy/a/How-To-Make-Fizzy-Kombucha.htm", "passage_text": "That's because you need to secondary ferment kombucha in a sealed bottle, or force carbonate it with bottled carbon dioxide, to make it sparkling. Secondary fermentation is also a great time to add flavors to your kombucha. Fruit is an especially good choice, as is ginger. I love blueberries. This is a place where you will want to experiment to see what tastes good to you. With a few simple rules, the world of flavor will open to you."}, {"url": "https://en.wikipedia.org/wiki/Kombucha", "passage_text": "Kombucha refers to any of a variety of fermented, lightly effervescent sweetened black or green tea drinks that are commonly used as functional beverages for their unsubstantiated health benefits. "}]