[{"url": "http://www.healthhype.com/bronchiectasis-symptoms-causes-and-differences-with-bronchitis.html", "passage_text": "Bronchiectasis, however, is permanent and therefore irreversible. Bronchitis is associated with severe inflammation while bronchiectasis is a result of structural destruction and superimposed inflammation. Due to the inflammation in both conditions, the signs symptoms are often similar."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/brn/", "passage_text": "Bronchiectasis (brong-ke-EK-ta-sis) is a condition in which damage to the airways causes them to widen and become flabby and scarred. The airways are tubes that carry air in and out of your lungs."}, {"url": "http://emedicine.medscape.com/article/296961-overview", "passage_text": "Practice Essentials. Bronchiectasis is an uncommon disease, most often secondary to an infectious process, that results in the abnormal and permanent distortion of one or more of the conducting bronchi or airways. In 1950, Reid characterized bronchiectasis as cylindrical, cystic, or varicose in nature."}, {"url": "http://emedicine.medscape.com/article/354167-overview", "passage_text": "Bronchiectasis is irreversible, abnormal dilatation of the bronchi.. Common etiologies for bronchiectasis are congenital abnormalities, recurrent infection, and airway obstruction."}, {"url": "http://patient.info/doctor/bronchiectasis-pro", "passage_text": "Bronchiectasis is a permanent dilatation and thickening of the airways characterised by chronic cough, excessive sputum production, bacterial colonisation, and recurrent acute infections. It may be widespread throughout the lungs (diffuse) or more localised (focal)."}, {"url": "http://www.healthhype.com/bronchiectasis-symptoms-causes-and-differences-with-bronchitis.html", "passage_text": "Bronchiectasis is an abnormal widening of the airways – bronchi and bronchioles – that is permanent. The irreversible dilatation is often a consequence of repeated and severe respiratory tract infections in people without congenital or hereditary conditions."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/brn/", "passage_text": "Bronchiectasis usually is the result of an infection or other condition that injures the walls of your airways or prevents the airways from clearing mucus. Mucus is a slimy substance that the airways produce to help remove inhaled dust, bacteria, and other small particles."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/23207538", "passage_text": "Bronchiectasis is classically defined as irreversible bronchial dilatation that represents the sequelae of chronic airway inflammation and is permanent, reflecting the presence of bronchiectasis. It is increasingly being recognized with the wider availability of high-resolution computed tomography."}]