[{"url": "https://en.wikipedia.org/wiki/Titanium", "passage_text": "The two most useful properties of the metal are corrosion resistance and the highest strength-to-density ratio of any metallic element. In its unalloyed condition, titanium is as strong as some steels, but less dense. Titanium is one of the few elements that burns in pure nitrogen gas, reacting at 800 °C (1,470 °F) to form titanium nitride, which causes embrittlement. Because of its high reactivity toward oxygen, nitrogen and some other gases, titanium filaments are applied in titanium sublimation pumps as scavengers for these gases."}, {"url": "http://www.radiochemistry.org/periodictable/elements/22.html", "passage_text": "Titanium oxide pigment accounts for the largest use of the element. Titanium paint is an excellent reflector of infrared, and is extensively used in solar observatories where heat causes poor seeing conditions. Titanium tetrachloride is used to iridize glass. "}, {"url": "http://periodic.lanl.gov/22.shtml", "passage_text": "Titanium oxide pigment accounts for the largest use of the element. Titanium paint is an excellent reflector of infrared, and is extensively used in solar observatories where heat causes poor viewing conditions. Titanium tetrachloride is used to iridize glass. "}, {"url": "http://www.mineralseducationcoalition.org/minerals/titanium", "passage_text": "Sources: Uses: Most titanium is used in its oxide form. TiO2 is a white pigment used in paint, varnishes and lacquers (49%), plastics (25%), paper (16%), and other products such as fabrics, printing inks, roofing granules, and special coated fabrics. Titanium is lighter than steel but still is very strong. "}, {"url": "https://en.wikipedia.org/wiki/Titanium", "passage_text": "Titanium is used in steel as an alloying element (ferro-titanium) to reduce grain size and as a deoxidizer, and in stainless steel to reduce carbon content. Titanium is often alloyed with aluminium (to refine grain size), vanadium, copper (to harden), iron, manganese, molybdenum, and with other metals. Titanium is one of the few elements that burns in pure nitrogen gas, reacting at 800 °C (1,470 °F) to form titanium nitride, which causes embrittlement. Because of its high reactivity toward oxygen, nitrogen and some other gases, titanium filaments are applied in titanium sublimation pumps as scavengers for these gases."}, {"url": "http://www.webelements.com/titanium/uses.html", "passage_text": "Titanium metal is used for alloys with with aluminium, molybdenum, manganese, iron, and other metals. These alloys of titanium are used principally in the aerospace industry, for both airframes and engines, where lightweight strength and ability to withstand extremes of temperature are important. Titanium is as strong as steel, but much lighter. It is twice as strong as aluminium. It is nearly as resistant to corrosion as platinum. Titanium is a component of joint replacement parts, including hip ball and sockets."}, {"url": "http://education.jlab.org/itselemental/ele022.html", "passage_text": "Titanium is a strong, light metal. It is as strong as steel and twice as strong as aluminum, but is 45% lighter than steel and only 60% heavier than aluminum. Titanium is not easily corroded by sea water and is used in propeller shafts, rigging and other parts of boats that are exposed to sea water. Titanium tetrachloride (TiCl 4), another titanium compound, has been used to make smoke screens. A final bit of titanium trivia -- titanium is the only element that will burn in an atmosphere of pure nitrogen."}, {"url": "https://en.wikipedia.org/wiki/Titanium", "passage_text": "Titanium is a chemical element with symbol Ti and atomic number 22. It is a lustrous transition metal with a silver color, low density and high strength. It is highly resistant to corrosion in sea water, aqua regia and chlorine. Titanium is one of the few elements that burns in pure nitrogen gas, reacting at 800 °C (1,470 °F) to form titanium nitride, which causes embrittlement. Because of its high reactivity toward oxygen, nitrogen and some other gases, titanium filaments are applied in titanium sublimation pumps as scavengers for these gases."}, {"url": "http://www.sciencekids.co.nz/sciencefacts/metals/titanium.html", "passage_text": "Many elements such as iron, aluminium, nickel and vanadium are alloyed with titanium to produce strong lightweight alloys. These titanium alloys are used in the manufacturing of naval ships, spacecraft, missiles and aircraft, with around two thirds of all titanium metal produced is used in aircraft engines and frames. The chemical element Titanium has the symbol Ti and atomic number 22. Pure titanium is a transition metal with a lustrous silver-white color. Titanium will always be found bonded with another element it does not naturally occur on its own in a pure form. British pastor William Gregor discovered titanium in 1791."}, {"url": "http://chemistry.about.com/od/elementfacts/a/titanium.htm", "passage_text": "Titanium burns in air and is the only element that burns in nitrogen. Titanium is dimorphic, with the hexagonal a form slowly changing to the cubic b form around 880°C. The metal combines with oxygen at red heat temperatures and with chlorine at 550°C. Titanium is as strong as steel, but it is 45% lighter. The metal is 60% heavier than aluminum, but it is twice as strong. Titanium metal is considered to be physiologically inert. Pure titanium dioxide is reasonably clear, with an extremely high index of refraction and an optical dispersion higher than that of diamond."}]