[{"url": "http://www.diffen.com/difference/Minerals_vs_Rocks", "passage_text": "Diffen › Science › Geology. A mineral is a naturally-occurring substance formed through geological processes that has a characteristic chemical composition, a highly ordered atomic structure and specific physical properties. A rock is a naturally occurring aggregate of minerals and/or mineraloids. Rocks do not have a definite chemical composition."}, {"url": "http://facweb.bhc.edu/academics/science/harwoodr/geol101/labs/minerals/", "passage_text": "Minerals are defined as naturally occurring, inorganic, solids with a definite chemical composition and a regular, internal crystalline structure. The keys to this definition are the chemical composition and the crystalline structure. Different chemical compositions result in different minerals. A good example is the mineral plagioclase."}, {"url": "http://www.earthlyrocks.com/info-minerals.htm", "passage_text": "A mineral is a naturally occurring substance formed through geological processes that has a characteristic chemical composition, an ordered atomic structure and specific physical properties. A rock, by comparison, is an aggregate of minerals and need not have a specific chemical composition."}, {"url": "http://www.earthlyrocks.com/info-minerals.htm", "passage_text": "Differences Between Minerals and Rocks A mineral is a naturally occurring, inorganic solid with a definite chemical composition and a specific crystalline structure. A rock is an aggregate of one or more minerals. Some rocks are predominantly composed of just one mineral."}, {"url": "http://www.visionlearning.com/en/library/Earth-Science/6/Defining-Minerals/119", "passage_text": "Hematite, halite, gypsum, lime, and bauxite are all minerals, naturally formed materials that have a specific chemical composition and crystal structure. Minerals are the building blocks of rocks, which can be composed of one or more minerals in varying amounts."}, {"url": "https://simple.wikipedia.org/wiki/Minerals", "passage_text": "Minerals are different from rocks. A mineral is a chemical compound with a given composition and a defined crystal structure. A rock is a mixture of one or several minerals, in varying proportions. A rock has only two of the characteristics minerals have–it is a solid and it forms naturally."}, {"url": "http://www.minerals.net/resource/Chemical_Properties.aspx", "passage_text": "Every mineral has a unique arrangement of elements within its inherent structure. This arrangement of atoms determines a mineral type. All minerals have a chemical formula, which is an analysis of the types and amounts of elements present in a mineral."}]