[{"url": "http://turtlesoft.com/Construction-Costs/Concrete/Footings_Per_Foot.htm", "passage_text": "Concrete construction unit cost for installation of concrete footings for a foundation or retaining wall. This cost covers the cost per foot of any size of footing. Use it in combination with the footing cost per yard. NOTE -- This is half of a two-part unit cost that covers any footing size. "}, {"url": "http://www.concretenetwork.com/concrete/poured_concrete_retaining_walls/cost.html", "passage_text": "Retaining Wall Cost. Poured retaining walls with elaborate curves require complex formwork and will drive up cost for a wall. The total cost to have a concrete retaining wall installed will be a combination of material and labor prices. For a basic wall you can expect to pay between $30 and $40 per square foot. If you add a decorative finish, curves, steps, lighting or other upgrades, the cost will rise. "}, {"url": "http://www.answers.com/Q/What_is_the_average_cost_of_concrete_footings_per_lineal_foot", "passage_text": "Making the world better, one answer at a time. The average cost of concrete is 20 dollars per linear foot. This price does not factor in the cost of framing the footing or labor. The final estimate will include all concrete needed for the project. According t … o www.doityourself.com a yard of concrete will cost about $75.00 so a cubic foot will cost you $75/27, which would be about $2.78 per cubic foot. 1 foot of concrete is a very small volume so you will probably be charged for a minimum quantity which will be more that the cost of 1 foot."}, {"url": "http://home.costhelper.com/house-foundation.html", "passage_text": "1 A slab foundation for an average 1,600- to 1,800-square-foot family home might cost about $7,000-$16,000 or more, while a slab foundation for a 3,000- to 4,500-square-foot home might cost $13,000-$40,000 or more. "}, {"url": "http://www.homewyse.com/services/cost_to_install_concrete_block_wall.html", "passage_text": "Our free calculator uses recent, trusted data to estimate costs for your Concrete Block Wall Installation project. For a basic 120 square feet project in zip code 47474, the benchmark cost to Install a Concrete Block Wall ranges between $8.59 - $11.70 per square foot* . To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased"}, {"url": "http://www.costowl.com/home-improvement/foundations-framing-install-cost.html", "passage_text": "1 Labor costs to pour and form concrete run somewhere around $3.50 to $7.00 per square foot. 2  One homeowner paid $11,000 for a crawl space for a 1,500 square foot home. 3  One customer in Texas received a quote for a 2,500 square foot foundation slab of about $20,000. 1 An average cost for a cubic yard of concrete is $75 to $125, depending on how much is needed and local prices. 2  Labor costs to pour and form concrete run somewhere around $3.50 to $7.00 per square foot. 3  One homeowner paid $11,000 for a crawl space for a 1,500 square foot home"}, {"url": "http://homebuildingsmart.com/house-building-cost-per-square-foot/", "passage_text": "While local prices and soil conditions make this cost variable, we can make a rough estimate. Trenching is approximately $2 per linear foot. Reinforced concrete continuous footings cost another $10 to $15 per linear foot. Add to this about $6 or $7 per line foot for a concrete block foundation wall. Supports in the center may be needed too, but to estimate figure $18 – $24 per linear foot of the parameter. For example if the foundation will be 24 x 30 foot, then you would multiple108 by $18 and then by $24. Slab – A concrete slab will cost about $4 per square foot. So if a the slab is 24 x 30 foot, then your slab would cost $2880. This price varies though in different areas, and with the cost of concrete. Crawl Space – The cost is based on the perimeter of the home."}, {"url": "http://www.costowl.com/home-improvement/foundations-framing-install-cost.html", "passage_text": "1 Concrete is typically measured by cubic yards (3’x3’x3’). 2  An average cost for a cubic yard of concrete is $75 to $125, depending on how much is needed and local prices. 3  Labor costs to pour and form concrete run somewhere around $3.50 to $7.00 per square foot. 1 An average cost for a cubic yard of concrete is $75 to $125, depending on how much is needed and local prices. 2  Labor costs to pour and form concrete run somewhere around $3.50 to $7.00 per square foot. 3  One homeowner paid $11,000 for a crawl space for a 1,500 square foot home"}]