[{"url": "https://help.instagram.com/365080703569355/", "passage_text": "To take a photo or upload one from your phone or tablet's photo library, first tap (iOS and Android) or (Windows Phone) at the bottom of the app. iOS and Android. To take a new photo: tap the blue circle. If you'd like to turn the camera to face you, tap."}, {"url": "http://blog.instagram.com/post/13978983262/comments", "passage_text": "1 You can add a hashtag to your photo even after you’ve uploaded it with a caption! 2  Just add a comment with your hashtag and it’ll be added to the tag pool. 3  Numbers in hashtags will work, but special characters such as % or $ will not. 4  Try to be as descriptive as possible."}, {"url": "https://help.instagram.com/365080703569355/", "passage_text": "When you take a photo using the Instagram in-app camera or upload a photo from your phone's library, you can straighten it with the Adjust tool: 1  Tap. 2  Swipe the slider left or right to straighten the photo. 3  Tap x to cancel or tap the checkmark to save your change."}, {"url": "http://www.wikihow.com/Post-Pictures-on-Instagram-from-Computer", "passage_text": "Share the photo to Instagram. Tap the Share button with the photo open. Select Instagram from the list of sharing options. You will be asked to open the Instagram app, and then you can edit and share the photo as you normally would."}, {"url": "https://www.androidpit.com/how-to-post-a-photo-on-instagram-from-a-pc", "passage_text": "Select the photo you want to post. Note: If you get an error message that your photo is not the right size it is because the photos posted on Instagram must be square, ie their height and width must both be 650 pixels. You can only upload images with a square format and 650 x 650 pixel resolution."}, {"url": "http://www.cnet.com/how-to/how-to-finally-edit-photo-video-captions-on-instagram/", "passage_text": "Workflow to edit a caption on Instagram. Screenshot by Jason Cipriani/CNET. Editing a caption after submission is incredibly easy and sure to save you some work. 1  After submitting a photo and discovering an embarrassing typo, tap on the three-dot action button just under the photo or video in your timeline. 2  Select Edit from the list of options. 3  Correct yourself and tap done when finished."}]