[{"url": "http://blog.equifax.com/credit/can-one-late-payment-affect-my-credit-score/", "passage_text": "The degree to which a late payment may affect your credit score can depend on multiple factors. When it comes to your FICO credit score, for example, a late payment will be evaluated based on how severe it is, how recent it is, and how frequently you’ve paid late. In addition to lowering your credit score, a late payment could also cost you in the form of late fees and higher interest rates. If you pay your credit card bill even one day late, for example, you could be charged a late fee."}, {"url": "https://www.creditkarma.com/article/late-payments-affect-credit-score", "passage_text": "1 It may end up on your credit report. 2  If your payment is more than 30 days late, the three major credit bureaus are usually notified, meaning the late payment will show up on your credit reports. 3  A late payment on your credit report could stay on your credit report for seven years. 4  It might decrease your credit score. The damaging effect of a late payment on your credit score can increase the longer the delinquency. If you've made a late payment recently, you could attempt to do the following: 1  Request removal of a late payment fee."}, {"url": "http://blog.equifax.com/credit/can-one-late-payment-affect-my-credit-score/", "passage_text": "If you have a payment that is more than 30 days late, your creditor may report it to the credit reporting agencies (CRAs). In this case, the late payment can show up on your credit report and be factored into your credit score. Late payments will be listed on your credit report depending on how late they are: 30 days late, 60 days late, 90 days late, 120 days late, 150 days late, or charged off. In addition to lowering your credit score, a late payment could also cost you in the form of late fees and higher interest rates. If you pay your credit card bill even one day late, for example, you could be charged a late fee."}, {"url": "https://www.creditkarma.com/article/late-payments-affect-credit-score", "passage_text": "1 A late payment on your credit report could stay on your credit report for seven years. 2  It might decrease your credit score. 3  Payment history information typically accounts for nearly 35% of your credit score, making it one of the single most important factors in calculating your score. The damaging effect of a late payment on your credit score can increase the longer the delinquency. If you've made a late payment recently, you could attempt to do the following: 1  Request removal of a late payment fee."}, {"url": "https://www.creditkarma.com/article/late-payments-affect-credit-score", "passage_text": "1 If your payment is more than 30 days late, the three major credit bureaus are usually notified, meaning the late payment will show up on your credit reports. 2  A late payment on your credit report could stay on your credit report for seven years. 3  It might decrease your credit score. The damaging effect of a late payment on your credit score can increase the longer the delinquency. If you've made a late payment recently, you could attempt to do the following: 1  Request removal of a late payment fee."}, {"url": "http://blog.readyforzero.com/one-late-mortgage-payment-hurt-credit-score/", "passage_text": "Unfortunately, the same is not true when it comes to mortgage payments and your credit score. When you make even one late mortgage payment, it can have a significant negative impact on your credit score, and the forgiveness comes much slower. As you can see, even if you have pretty good credit, your score can be taken down a few notches just by a single missed mortgage payment. If you are 30 days late on your payment, your 780 credit score can plummet to between 670 and 690. That’s a potential drop of more than 100 points. On top of that, it can take someone with good credit about three years to recover the excellent score"}, {"url": "https://www.creditkarma.com/article/late-payments-affect-credit-score", "passage_text": "1 Pay all accounts on time. 2  If a late payment caused your credit score to drop, the best thing you can do is to continue on-time payments on all of your accounts. 3  After a few months of consistent on-time payments, your credit score could slowly improve. The damaging effect of a late payment on your credit score can increase the longer the delinquency. If you've made a late payment recently, you could attempt to do the following: 1  Request removal of a late payment fee."}, {"url": "http://blog.readyforzero.com/one-late-car-payment-hurt-credit-score/", "passage_text": "One of the realities of your credit score is that the higher your credit score is, the bigger hit it will take if you are late on one payment. This is true of one late mortgage payment or one late credit card payment as well, when paying 30 days late can drop your score 100 points if you have a score of 780. The drop is less if you have a lower credit score. The same is true of a late car loan payment. If you have a higher score, you have more to lose."}, {"url": "http://blog.equifax.com/credit/can-one-late-payment-affect-my-credit-score/", "passage_text": "For example, all other things being equal, a payment that is 90 days late can have a more significant negative impact on your credit score than a payment that is 30 days late. In addition, the more recent the late payment, the more negative of an impact it could have. In addition to lowering your credit score, a late payment could also cost you in the form of late fees and higher interest rates. If you pay your credit card bill even one day late, for example, you could be charged a late fee."}]