[{"url": "http://www.livestrong.com/article/499266-what-is-wheat-dextrin/", "passage_text": "Wheat dextrin is also a good source of dietary fiber. Wheat dextrin is one of various dextrins used in the textile industry for printing cotton fabrics. It is also used as an adhesive for porous substances, in the paste on envelopes, labeling adhesives, postage stamps, gummed tape and a variety of other adhesive uses. Wheat field Photo Credit Design Pics/Design Pics/Getty Images. Wheat dextrin is a versatile product that is primarily used in the textile, adhesive and food industries, and as a dietary fiber to improve digestion. Wheat starch is chemically processed to make wheat dextrin. It is used globally and has many commercial uses, along with various health benefit"}, {"url": "http://www.globalhealingcenter.com/natural-health/8-benefits-dextrin/", "passage_text": "While several types of dextrin exist, each have a similar formula and action in the body. Dextrin is used in many glue products due to its adhesive qualities and safety. The indigestible form of dextrin is often used as a fiber supplement. This is what’s contained in my Detox Foot Pads. Fiber may also support satiation and healthy weight loss. Dextrin also has the ability to lower the glycemic load of a high-carbohydrate meal. Because it’s a water-soluble carbohydrate, it can act as a natural binding agent and that’s what we use it for in our"}, {"url": "http://www.livestrong.com/article/499266-what-is-wheat-dextrin/", "passage_text": "Dextrin is a hydrolyzed starch made from various starches such as potato, corn, tapioca, rice, arrowroot or wheat. Wheat starch is a byproduct from extracting gluten from wheat. The wheat starch is sprayed with acid while being agitated and then suspended in water by the acids or enzymes. Wheat field Photo Credit Design Pics/Design Pics/Getty Images. Wheat dextrin is a versatile product that is primarily used in the textile, adhesive and food industries, and as a dietary fiber to improve digestion. Wheat starch is chemically processed to make wheat dextrin. It is used globally and has many commercial uses, along with various health benefit"}, {"url": "http://www.skylighter.com/dextrin.htm", "passage_text": "Product Information. [C6H10O5] Light yellow powder. Dextrin is a water-soluble binder used in fireworks: for stars, comets, and granulating black powder. Also sometimes used as a glue. Solvent is water. Other fireworks binders are used as well. See alternatives on the left"}, {"url": "http://www.globalhealingcenter.com/natural-health/8-benefits-dextrin/", "passage_text": "Derived from dextrose (glucose), dextrin is a low-molecular-weight carbohydrate produced from the hydrolysis of starches. Hydrolysis, as the prefix suggests, involves water splitting into its basic molecular components and attaching to other molecules. Fiber may also support satiation and healthy weight loss. Dextrin also has the ability to lower the glycemic load of a high-carbohydrate meal. Because it’s a water-soluble carbohydrate, it can act as a natural binding agent and that’s what we use it for in our Detox Foot Pads."}, {"url": "http://www.globalhealingcenter.com/natural-health/8-benefits-dextrin/", "passage_text": "Dextrin is a natural fiber with a lot to offer. It can support your body’s ability to remove wastes. Fiber may also support satiation and healthy weight loss. Dextrin also has the ability to lower the glycemic load of a high-carbohydrate meal. Because it’s a water-soluble carbohydrate, it can act as a natural binding agent and that’s what we use it for in our Detox Foot Pads."}, {"url": "http://www.cargillfoods.com/lat/en/products/starches-dextrins/dextrins/index.jsp", "passage_text": "Dextrins are a group of low molecular weight carbohydrates produced by the hydrolysis of starch. They are widely used in industries due to their nontoxicity. To become dextrin, the starch is subjected to a hydrolysis process that divides the long molecular chains of starch. The resulting material is dextrin, a simple carbohydrate with low molecular weight, which has different properties, depending on its chemical composition. Dextrins are usually dried for easy handling and transportation. Since they are soluble in water, it is very easy to transform it again into a liquid solution"}, {"url": "https://en.wikipedia.org/wiki/Dextrin", "passage_text": "Dextrins are mixtures of polymers of D-glucose units linked by α-(1→4) or α-(1→6) glycosidic bonds. 1 (Beta) Limit dextrin is the remaining polymer produced by enzymatic hydrolysis of amylopectin with beta amylase, which cannot hydrolyse the alpha-1,6 bonds at branch points. ( 2 Alpha) Limit dextrin is a short chained branched amylopectin remnant, produced by hydrolysis of amylopectin with alpha amylase."}]