[{"url": "http://wikitravel.org/en/Pompeii", "passage_text": "Romans took control of Pompeii around 200 BC. On August 24, 79 AD, Vesuvius erupted, burying the nearby town of Pompeii in ash and pumice, killing around 3,000 people, the rest of the population of 20,000 people having already fled, and preserving the city in its state from that fateful day."}, {"url": "http://www.pompeii-food-and-drink.org/area.htm", "passage_text": "Pompeii Area Attractions. Modern Pompei (and the ancient city of Pompeii) are midway between Naples and Sorrento on the coast of the Gulf of Naples in the Campanian region of southern Italy. There are many wonderful sites nearby to Pompeii, both archaeological and cultural, as well as tourist attractions. For further information, visit ENIT, the Italian Government Tourism Board and the City of Pompei's official tourist information web site. Campanian Region. Tourist Areas near Pompeii. Sorrento. Sorrento. Incredible views of Vesuvius and the Bay of Naples are visible from Sorrento. It is a beautiful nearby city, directly on the Circumvesuviana line, and is a wonderful place to shop and to buy gelato and limoncello."}, {"url": "http://www.answers.com/Q/What_region_is_Pompeii_in", "passage_text": "Answer   Pompeii is a ruined Roman city near modern Naples in the Italian region of Campania, in the territory of the commune of Pompeii. It was destroyed, and completely … buried, during a catastrophic eruption of the volcano Mount Vesuvius on 24 August 79 AD.   The volcano buried Pompeii under many meters of ash, and it was lost for 1,600 years before its accidental rediscovery in 1748. Since then, its excavation has provided an extraordinarily detailed insight into the life of a city at the height of the Roman Empire."}, {"url": "http://www.visitpompeii.it/home.html", "passage_text": "It is part of a larger Vesuvius National Park and was declared a World Heritage Site by UNESCO in 1997. Historical notes about Pompeii. The city of Pompeii is a partially buried Roman town-city near modern Naples in the Italian region of Campania, in the territory of the comune of Pompei. Today it is some distance inland, but in ancient times it would have been nearer to the coast. Pompeii is about 8 km (5.0 mi) away from Mount Vesuvius. It covered a total of 163 acres and would have been in the region of Campania."}, {"url": "http://www.history.com/topics/ancient-history/pompeii", "passage_text": "Introduction. Mount Vesuvius, a volcano near the Bay of Naples in Italy, is hundreds of thousands of years old and has erupted more than 50 times. Its most famous eruption took place in the year 79 A.D., when the volcano buried the ancient Roman city of Pompeii under a thick carpet of volcanic ash. "}, {"url": "http://wikitravel.org/en/Pompeii", "passage_text": "Pompeii [1] is in Campania, Italy, not far from Naples. Its major attraction is the ruined ancient Roman city of the same name, which was engulfed by Mt. Vesuvius in AD 79. This is a UNESCO World Heritage Site. On August 24, 79 AD, Vesuvius erupted, burying the nearby town of Pompeii in ash and pumice, killing around 3,000 people, the rest of the population of 20,000 people having already fled, and preserving the city in its state from that fateful day."}, {"url": "http://www.ancient.eu/pompeii/", "passage_text": "Pompeii was a large Roman town in the Italian region of Campania which was completely buried in volcanic ash following the eruption of nearby Mt. Vesuvius in 79 CE. "}, {"url": "http://www.visitpompeii.it/home.html", "passage_text": "The city of Pompeii is a partially buried Roman town-city near modern Naples in the Italian region of Campania. Herculaneum wall. The town was founded by the Greeks, probably in the 6th century BC, and according to mythology by Hercules himself, who went on to become its patron deity. Today it is some distance inland, but in ancient times it would have been nearer to the coast. Pompeii is about 8 km (5.0 mi) away from Mount Vesuvius. It covered a total of 163 acres and would have been in the"}, {"url": "https://en.wikipedia.org/wiki/Pompeii", "passage_text": "Pompeii is about 8 km (5.0 mi) away from Mount Vesuvius. It covered a total of 64 to 67 hectares (170 acres) and was home to approximately 11,000 to 11,500 people on the basis of household counts. Pompeii, along with Herculaneum and many villas in the surrounding area, was mostly destroyed and buried under 4 to 6 m (13 to 20 ft) of ash and pumice in the eruption of Mount Vesuvius in 79 AD. Researchers believe that the town was founded in the seventh or sixth century BC by the Osci or Oscans."}]