[{"url": "http://www.bbc.co.uk/news/entertainment-arts-27463276", "passage_text": "Image caption The album cover of Xscape. The late pop legend Michael Jackson has topped the album charts, nearly five years since his death, with Xscape."}, {"url": "http://www.officialcharts.com/chart-news/michael-jackson-s-top-10-most-downloaded-songs-since-his-death__4256/", "passage_text": "Michael Jackson may have been gone for five years now, but his legacy lives on through his music. Since his death, his estate have released two posthumous albums; 2010’s Michael, which peaked at Number 4 on the Official Albums Chart, and Xscape, which earned the singer his tenth UK Number 1 album last month."}, {"url": "http://www.mtv.com/news/1666426/michael-jackson-anniversary/", "passage_text": "2: Number of posthumous albums that have been released since Michael’s death in June 2009. Last year’s Michael has sold just over 510,000 copies to date, while the This Is It collection has moved nearly 1 million copies to date in the U.S., according to Nielsen SoundScan."}, {"url": "https://en.wikipedia.org/wiki/Michael_Jackson%27s_This_Is_It_(album)", "passage_text": "In the announcement it was confirmed that This Is It would be released on October 26, 2009, one day before the film's theatrical release. This Is It is the sixth posthumous album to be released by Sony and Motown/Universal since Jackson's death in June 2009."}, {"url": "http://www.telegraph.co.uk/culture/music/michael-jackson/10923354/Michael-Jackson-five-years-on-from-his-death-how-does-his-reputation-stand.html", "passage_text": "In a strange coincidence, two anniversaries of Eighties pop superstars occur today. It is both five years since the death of Michael Jackson and 30 years since the release of Prince’s landmark album Purple Rain."}, {"url": "http://www.thewrap.com/michael-jackson-has-sold-more-albums-since-his-death-than-the-last-13-years-of-his-life/", "passage_text": "In the immediate aftermath of his death, Jackson’s album and digital sales skyrocketed, but that strong sales trend has continued for the past five years. In fact, the past five years have been some of the strongest in sales for Jackson since Nielsen SoundScan’s inception in 1991. According to the company’s data, Michael Jackson has sold 13.228 million albums since his death. In the five years prior to his death (2004-2008), he sold a combined total of 3.934 million, less than 30% of his sale"}, {"url": "http://www.thewrap.com/michael-jackson-has-sold-more-albums-since-his-death-than-the-last-13-years-of-his-life/", "passage_text": "King of Pop has sold 13.228 million albums since his death in 2009, compared to 13.152 million from 1996-2008. Michael Jackson passed away on June 25, 2009 and, as might have been expected, has had tremendous album sales since."}]