[{"url": "https://en.wikipedia.org/wiki/Plasmodium_falciparum_biology", "passage_text": "P. falciparum is transmitted to humans by the females of the Anopheles species of mosquito. There are about 460 species of Anopheles mosquito, but only 68 transmit malaria. Anopheles gambiae is one of the best malaria vectors since it is long-lived, prefers feeding on humans, and lives in areas near human habitation. "}, {"url": "http://www.who.int/ith/diseases/malaria/en/", "passage_text": "Cause. Malaria is caused by the protozoan parasite Plasmodium. Human malaria is caused by four different species of Plasmodium: P. falciparum, P. malariae, P. ovale and P. vivax. Humans occasionally become infected with Plasmodium species that normally infect animals, such as P. knowlesi"}, {"url": "https://microbewiki.kenyon.edu/index.php/Plasmodium_falciparum", "passage_text": "Plasmodium falciparum is a protozoan parasite that causes an infectious disease known as malaria. P. falciparum is the most severe strain of the malaria species correlated with almost every malarial death. [1] The other 3 species that cause malaria include: P. vivax, P. ovale, and P. malariae. [3] There are four common species of Malaria of which P. falciparum is the most severe. Plasmodium falciparum continues to increase in drug-resistant populations and insecticide-resistant mosquitoes leading to the prediction that the disease will only worsen over time."}, {"url": "http://bioweb.uwlax.edu/bio203/s2007/augustin_laur/", "passage_text": "The answer: Plasmodium falciparum. and the disease it causes, Malaria. Plasmodium falciparum is both the most deadly and most researched species of malaria (MVI fact sheet). Four forms of malaria Plasmodium exist: Plasmodium falciparum, vivax, ovale, and malariae. The majority of the research conducted is to find a vaccine or treatment for the disease"}, {"url": "http://www.parasitesinhumans.org/plasmodium-falciparum-malaria.html", "passage_text": "Plasmodium Falciparum-Malaria. Plasmodium falciparum is the Plasmodium species responsible for 85 % of the malaria cases. The three less common and less dangerous Plasmodium species are: P. ovale, P. malariae and P. vivax. Malaria is carried by Anopheles mosquitoes. Of the over 400 Anopheles species, only 30–40 can transmit malaria. The infection starts, when a female mosquito injects (in her saliva) sporozoites (one form of P. falciparum) into human skin while taking a blood meal."}, {"url": "https://en.wikipedia.org/wiki/Plasmodium_falciparum", "passage_text": "Plasmodium falciparum is a protozoan parasite, one of the species of Plasmodium that cause malaria in humans. It is transmitted by the female Anopheles mosquito. Of the six malarial parasites, P. falciparum causes the most fatal and medically severe form. Malaria is prevalent in tropical countries with an incidence of 300 million per year and a mortality of 1 to 2 million per year. Roughly 50% of all malarial infections are caused by P. falciparum."}, {"url": "http://www.sanger.ac.uk/resources/downloads/protozoa/plasmodium-falciparum.html", "passage_text": "Plasmodium falciparum is the deadliest of five human malaria species and responsible for the majority of malaria related deaths. There are around 300 million clinical cases occur each year resulting in at least one million deaths annually, predominantly in sub-saharan Africa. "}]