[{"url": "http://travel.usnews.com/rankings/travel-rewards/airline-rewards/southwest-rapid-rewards-points/", "passage_text": "By enrolling in the Southwest Rapid Rewards program, you'll earn points for every dollar spent on Southwest flights. These points can be used to cover the cost of air travel on Southwest Airlines."}, {"url": "http://www.milevalue.com/how-much-are-rapid-rewards-points-worth-the-value-of-southwest-airlines-points/", "passage_text": "Get 50,000 Bonus Southwest Points Enough for up to $835 in Free Southwest Flights. 1  Get 50,000 points for 2 ROUNDTRIP FLIGHTS after you spend $2,000 in the first 3 months of opening your account. 2  Government fees as low as $10 not included."}, {"url": "http://thepointsguy.com/2014/04/southwest-25-rapid-rewards-points-buy-gift-transfer-bonus-worth-it/", "passage_text": "You get the best value from your Rapid Rewards points on Wanna Get Away fare redemptions. Southwest recently devalued these from 60 points per $1 in airfare to 70 points per $1 in airfare – so you’re getting a value of 1.4 cents per point."}, {"url": "http://millionmilesecrets.com/2013/05/16/buy-southwest-points/", "passage_text": "A $100 ticket will cost you $100 in cash and you will earn 600 Southwest points (you earn 6 points per $1 towards a Wanna Get Away Fare). 600 Southwest points are worth $10 towards Wanna Get Away fares, so you’re effectively paying only $90. You Earn 600 Points With a $100 Wanna Get Away Ticket. On the other hand, you will need 6,000 Southwest points to buy a $100 Wanna Get Away ticket ($100 ticket price X 60 points per $1 ticket price)."}, {"url": "http://onemileatatime.boardingarea.com/2015/03/20/at-what-price-does-it-make-sense-to-purchase-rapid-rewards-points/", "passage_text": "Southwest Airlines is offering a 35% bonus on purchased Rapid Rewards points through April 22, 2015. Ordinarily the cost per purchased Rapid Rewards point is 2.75 cents, though through this promotion that cost is lowered to ~2.04 cents per Rapid Rewards point."}, {"url": "http://thepointsguy.com/2014/04/southwest-25-rapid-rewards-points-buy-gift-transfer-bonus-worth-it/", "passage_text": "Now through May 31, 2014, Southwest is offering a 25% bonus when you buy, gift or transfer Rapid Rewards points. Points can be purchased, gifted, or transferred in blocks of 500 with a minimum initial purchase or transfer of 2,000 points and a daily maximum of 60,000 points."}, {"url": "http://thepointsguy.com/2014/04/southwest-25-rapid-rewards-points-buy-gift-transfer-bonus-worth-it/", "passage_text": "Normally Southwest Rapid Rewards points cost 2.75 cents apiece to purchase for yourself or gift, but with this promo, they cost 2.0625. Transferring points usually costs 1 cent per point, but with this promo, it’s 0.75 cents."}, {"url": "http://millionmilesecrets.com/2013/05/16/buy-southwest-points/", "passage_text": "If you have a Southwest Companion Pass, you’re much better off paying $100 for a Southwest flight and earning 600 Southwest points worth $10, than to pay $150 to buy Southwest points and then redeem them for a Wanna Get Away fare."}]