[{"url": "http://www.dummies.com/how-to/content/miniature-dairy-goat-breeds.html", "passage_text": "The adorable Nigerian Dwarf. Pygmy: Pygmy goats aren't usually considered dairy goats, but they can be milked. Most of them are raised as pets or 4-H projects, but a small minority of breeders raise them for milk. The Pygmies raised for milk tend to look more like Nigerians in body shape."}, {"url": "http://www.dummies.com/how-to/content/miniature-dairy-goat-breeds.html", "passage_text": "If you want to raise goats to promote a more sustainable lifestyle, but you have limited space or don't want to be drowning in goat milk, the miniature dairy breeds might be good choices for you."}, {"url": "http://www.answers.com/Q/What_is_the_smallest_breed_of_goats", "passage_text": "Breeding goats depends on the breed of goat and where you live. Dairy goats (Saanen, Oberhasli, Alpine, etc) are able to be bred in the fall. They can take from late Aug … ust to probably December. Other goats, like meat goats can be bred year round, depending on how cool the climate is."}, {"url": "http://thefreerangelife.com/best-dairy-goat-breeds/", "passage_text": "Saanen. Saanens are the largest of the dairy breeds and are often considered the Holstein of the dairy goats. Saanens can produce a lot of milk-up to 3 gallons per day-with an average production closer to 1.5 gallons per day."}, {"url": "http://www.backyardchickens.com/t/154132/what-is-the-smallest-breed-of-goat/10", "passage_text": "Height wise they are about the same. Pygmies are a meat breed and more stocky, they come in a handful of different colors. Nigerians are a dairy breed, so more refined looking and come in all colors."}, {"url": "http://www.backyardchickens.com/t/154132/what-is-the-smallest-breed-of-goat", "passage_text": "pygmy or nigerian are the smallest.. there are now many folks that are breeding down the larger sized goats to still pack a big dairy punch in a small package and I know of many breeders doing mini-manchas (nigerian/lamancha) and mini nubians (nigerian/nubian).."}, {"url": "http://animals.mom.me/miniature-goat-pet-1565.html", "passage_text": "Nigerian Dwarf Goats. If you're looking for a small dairy breed, Nigerian dwarf goats may fit the bill. These goats aren't actually dwarfs; they are proportional to larger, standard goats. These small goats originated in Africa as dairy goats."}, {"url": "http://www.nerdygaga.com/6799/strange-and-weird-smallest-animal/", "passage_text": "The Nigerian Dwarf goat is the smallest size in dairy goat breed of West Africa. Nigerian dwarf goat are now becoming popular as domestic pets due to easy maintenance and easy to train. Most of Nigerian dwarf goats have blue eyes making them dominant with this traits and they are so gentle."}, {"url": "http://animals.mom.me/miniature-goat-pet-1565.html", "passage_text": "Goats make wonderful pets, but the full-sized breeds belong more on a farm than a backyard or place with limited space. Miniature goat breeds fit this niche nicely, taking up less room than the larger breeds. Most miniature goats are about the size of a medium to large dog."}]