[{"url": "http://medical-dictionary.thefreedictionary.com/Liver+function+tests", "passage_text": "Definition. Liver function tests, or LFTs, include tests for bilirubin, a breakdown product of hemoglobin, and ammonia, a protein byproduct that is normally converted into urea by the liver before being excreted by the kidneys. Liver function tests are used to determine if the liver has been damaged or its function impaired. Elevations of certain liver tests in relation to others aids in that determination."}, {"url": "http://www.mayoclinic.org/tests-procedures/liver-function-tests/basics/definition/PRC-20012602", "passage_text": "Liver function tests are blood tests used to help diagnose and monitor liver disease or damage. The tests measure the levels of certain enzymes and proteins in your blood. Some of these tests measure how well the liver is performing its normal functions of producing protein and clearing bilirubin, a blood waste product. Other liver function tests measure enzymes that liver cells release in response to damage or disease. Abnormal liver function test results don't always indicate liver disease. Your doctor will explain your results and what they mean. 1  Why it's done."}, {"url": "http://www.medicinenet.com/liver_blood_tests/article.htm", "passage_text": "Liver blood tests are some of the most commonly performed blood tests. These tests can be used to assess liver functions or liver injury. An initial step in detecting liver damage is a simple blood test to determine the level of certain liver enzymes (proteins) in the blood. Under normal circumstances, these enzymes mostly reside within the cells of the liver. If the liver is injured or damaged, the liver cells spill these enzymes into the blood, raising the AST and ALT enzyme blood levels and signaling liver disease. Other blood tests pertaining to the liver are measurements of some of the other enzymes found the liver."}, {"url": "http://www.mayoclinic.org/symptoms/elevated-liver-enzymes/basics/definition/SYM-20050830", "passage_text": "Definition. Elevated liver enzymes may indicate inflammation or damage to cells in the liver. Inflamed or injured liver cells leak higher than normal amounts of certain chemicals, including liver enzymes, into the bloodstream, which can result in elevated liver enzymes on blood tests. The specific elevated liver enzymes most commonly found are: 1  Alanine transaminase (ALT). 2  Aspartate transaminase (AST)"}, {"url": "http://www.webmd.com/digestive-disorders/tc/liver-function-panel-topic-overview", "passage_text": "A liver (hepatic) function panel is a blood test to check how well the liver is working. This test measures the blood levels of total protein, albumin, bilirubin, and liver enzymes. High or low levels may mean that liver damage or disease is present. The liver serves several important functions in the body, including changing nutrients into energy for the body and breaking down toxic substances. Your doctor may order a liver function panel if you have symptoms of liver disease."}, {"url": "https://labtestsonline.org/understanding/analytes/bilirubin/tab/test", "passage_text": "A bilirubin test is used to detect an increased level in the blood. It may be used to help determine the cause of jaundice and/or help diagnose conditions such as liver disease, hemolytic anemia, and blockage of the bile ducts. Tests for bilirubin may also be ordered when someone is suspected of having (or known to have) hemolytic anemia as a cause of anemia. In this case, it is often ordered along with other tests used to evaluate hemolysis, such as complete blood count, reticulocyte count, haptoglobin, and LDH."}, {"url": "http://www.webmd.com/a-to-z-guides/liver-function-test-lft", "passage_text": "Liver enzyme tests, formerly called liver function tests (LFTs), are a group of blood tests that detect inflammation and damage to the liver. They can also check how well the liver is working. "}, {"url": "https://en.wikipedia.org/wiki/Liver_function_tests", "passage_text": "Liver function tests (LFTs or LFs) are groups of blood tests that give information about the state of a patient's liver. These tests include prothrombin time (PT/INR), aPTT, albumin, bilirubin (direct and indirect), and others. Liver transaminases (AST or SGOT and ALT or SGPT) are useful biomarkers of liver injury in a patient with some degree of intact liver function."}]