[{"url": "http://www.icelandontheweb.com/articles-on-iceland/nature/volcanoes/hekla/", "passage_text": "Hekla is Iceland’s most famous volcano. An active volcano for centuries, the mountain Hekla is one of the most famous in the world. Hekla is a stratovolcano, located near the southern end of the eastern rift zone in Iceland. The whole mountain ridge of Hekla is about 40 km long. The fissure, Heklugja, heklugjá which splits the, ridge is about.5 5 km. long"}, {"url": "http://volcano.oregonstate.edu/what-are-different-types-basaltic-lava-flows-and-how-do-they-form", "passage_text": "Pahoehoe. Pahoehoe is the second most abundant type of lava flow. Pahoehoe lava is characterized by a smooth, billowy, or ropy surface. Pahoehoe flows tend to be relatively thin, from a few inches to a few feet thick. In map-view the flows tend to be narrow and elongate. "}, {"url": "http://volcano.oregonstate.edu/vwdocs/volc_images/europe_west_asia/eruption_history.html", "passage_text": "1158: This eruption is believed to be responsible for the formation of the Efrahvolshraun lava flow on the west side of Hekla. 1206: Small scale eruption where tephra was sent in a northeasterly direction. 1222: Another small eruption similar to the one in 1206. The southern Selsundshraun lava flow probably formed in this eruption. 1341: Medium size eruption that ejected tephra that was carried to the west and southwest of Hekla, poisoning a large number of livestock most likely by fluorine."}, {"url": "http://www.answers.com/Q/What_type_of_lava_forms_Hekla_in_Iceland", "passage_text": "A diverging is the type of plate boundary that the Hekla volcano  formed. Hekla last erupted in 2000. It is located in Iceland. "}, {"url": "http://www.homeopathy4health.ie/2l3hek-l2mod.htm", "passage_text": "Brought to you by:Dr. S Mohamed AsleemHekla lava(The volcanic expression). Hekla Lava, the remedy is seldom used in practise, Dr.Mohamed Aleem, an eminent physician, based at Chennai brings these remarkable expressions and applications. He is a well-known speaker and also presented many articles in leading journals. "}, {"url": "https://en.wikipedia.org/wiki/Hekla", "passage_text": "[ˈhɛʰkla]. ), or Hecla, is a stratovolcano in the south of Iceland with a height of 1,491 metres (4,892 ft). Hekla is one of Iceland's most active volcanoes; over 20 eruptions have occurred in and around the volcano since 874. During the Middle Ages, Europeans called the volcano the Gateway to Hell . Hekla is part of a volcanic ridge, 40 kilometres (25 mi) long"}, {"url": "http://www.decadevolcano.net/volcanoes/iceland/hekla.htm", "passage_text": "It is located west of Iceland's SE volcanic rift-zone. Hekla erupts a magma type that is unique for Iceland, intermediate between highly silicic and andesitic composition. From surface deformation studies after the 1980 eruption, it has been concluded that its magma chamber is located around 8 km below the summit. map of post-1970 lava flows from Hekla volcano. Information from the THE NORDIC VOLCANOLOGICAL INSTITUTE (NVI). Hekla with the fresh lava flows seen from the air (above), showing mild steaming and the still active lava flow from the base of the eruptive fissure on 4 March 2000 (below). More photos on this link. Eruptive fissure of Hekla and lava of 26 Feb 2000. Eruption cloud of 26 Feb 2000"}, {"url": "http://volcanolive.com/hekla.html", "passage_text": "Hekla Volcano is located in southern Iceland 110 km east of Reykjavik, and 55 km from the coast. Hekla is the most active volcano in Iceland, and one of the world's best known volcanoes. Hekla volcano, Iceland-John Seach. The structure of Hekla is considered intermediate between crater row of Laki-type, and stratovolcano of the Vesuvius-type. It is built on a 5 km long fissure. Repose periods at the volcano have lasted from 10 to 102 years. A 6.6-km-long fissure opened along the length of Hekla volcano from the SW to the NE, south of the summit area. A Subplinian eruption plume reached a height of 12 km in 32 minutes. This was accompanied by several small pyroclastic flows."}]