[{"url": "http://finance.zacks.com/pay-taxes-qualified-dividends-ira-7735.html", "passage_text": "If any of your withdrawal does count as taxable income, it's taxed at ordinary income tax rates, not the lower capital gains rates. This holds true even if the money you're taking out would have counted as qualified dividends -- and therefore been subject to the lower capital gains rates -- if not in the IRA. "}, {"url": "http://www.morningstar.com/glossary/ira.html", "passage_text": "Roth IRAs As with traditional IRAs, interest income, dividends, and capital gains accumulate tax-free. However, the main feature of Roth IRAs is that they are funded with aftertax dollars (contributions are not tax deductible). Traditional IRAs When you contribute to a traditional IRA, the IRS allows you to take an income tax deduction up to the amount of the contribution, subject to income limitations. In addition, dividends and capital gains earned inside a traditional IRA are not subject to tax until withdrawal."}, {"url": "http://www.schwab.com/public/schwab/investing/retirement_and_planning/understanding_iras/traditional_ira/withdrawal_rules", "passage_text": "Your deductible contributions and earnings (including dividends, interest, and capital gains) will be taxed as ordinary income. The U.S. government charges a 10% penalty on early withdrawals from a Traditional IRA, and a state tax penalty may also apply. You may be able to avoid a penalty if your withdrawal is for: "}, {"url": "http://www.investopedia.com/articles/personal-finance/060915/how-are-dividends-iras-taxed.asp", "passage_text": "Dividend-earning stocks and mutual funds can help your retirement portfolio grow more quickly, as long as you reinvest the dividends. But they can be a tax trap when you want to take the money out, especially if you invested your money in a traditional IRA. Roth IRA Withdrawals. As long as you withdraw money invested in a Roth IRA after the age of 59½ – and you owned that account for more than five years – you will pay zero taxes on the withdrawals, even if the withdrawals includ"}, {"url": "http://www.investopedia.com/articles/personal-finance/060915/how-are-dividends-iras-taxed.asp", "passage_text": "Most money withdrawn from a traditional IRA is taxed at at your current tax rate, which could be as high as 39.6%. Any capital gains on the earnings in your IRA account do not benefit from lower capital gains tax treatment; they are taxed at the same rate as regular income. Roth IRA Withdrawals. As long as you withdraw money invested in a Roth IRA after the age of 59½ – and you owned that account for more than five years – you will pay zero taxes on the withdrawals, even if the withdrawals include dividends."}, {"url": "http://finance.zacks.com/ira-stock-dividends-taxed-5614.html", "passage_text": "Withdrawals. It doesn't matter whether your earnings come from dividends, interest or capital gains -- when you withdraw money from a traditional IRA, it is taxed like regular income, at your regular income tax rate. As long as your IRA dividends stay in your account, they aren't taxed at all. That's the purpose of a traditional IRA: to let your earnings accumulate tax free until you withdraw them in retirement."}, {"url": "http://www.investopedia.com/articles/personal-finance/060915/how-are-dividends-iras-taxed.asp", "passage_text": "This means these earnings could be taxed at a lower rate (from 0% to 20% depending on your income level). For example, if you are in the 10% or 15% tax bracket, you would pay 0% taxes on dividends and long-term capital gains. Those in the 25% to 35% tax bracket would pay just 15% on dividends and capital gains. Roth IRA Withdrawals. As long as you withdraw money invested in a Roth IRA after the age of 59½ – and you owned that account for more than five years – you will pay zero taxes on the withdrawals, even if the withdrawals include dividends."}, {"url": "http://budgeting.thenest.com/reinvested-dividends-capital-gains-taxable-roth-ira-25293.html", "passage_text": "The IRS does not tax your investment earnings if you keep them in your Roth IRA. The Roth individual retirement account is a retirement plan with a huge tax benefit. As of 2012, you can invest up to $5,000 each year into this account. When you invest in a Roth IRA, you will not owe any tax on your reinvested dividends and capital gains. However, to get this tax savings, you need to keep your money in the account until you turn 59 1/2. Tax Savings. When you invest in a Roth IRA, you don't get a tax deduction for your contribution like you do with the the traditional IRA. Instead, the Roth IRA saves your tax benefit for retirement. When you take money out of your Roth IRA after you turn 59 1/2, the entire withdrawal is tax-free."}, {"url": "http://www.ehow.com/about_7524587_ira-dividends-taxable.html", "passage_text": "If you invest inside of a Traditional IRA, your taxes may be higher when you go to withdraw the money. If your dividend paying investments did exceptionally well, you'll be taxed on a large dollar amount. The effect of this is easy to see. If you're taxed 15 percent, for example, on $100, the amount is $15. If you are going to invest in dividend paying investments, consider investing in a Roth IRA. A Roth IRA eliminates taxes on withdrawals. This means that you get the benefit of tax-free dividends from your dividend-paying investments."}]