[{"url": "https://history.state.gov/milestones/1830-1860/gadsden-purchase", "passage_text": "The Gadsden Purchase, or Treaty, was an agreement between the United States and Mexico, finalized in 1854, in which the United States agreed to pay Mexico $10 million for a 29,670 square mile portion of Mexico that later became part of Arizona and New Mexico. President Pierce signed the treaty and Gadsden presented the new treaty to Santa Anna, who signed it on June 8, 1854. After Gadsden’s Purchase a new border dispute caused tension over the United States’ payment, and the treaty failed to resolve the issues surrounding financial claims and border attacks."}, {"url": "http://history1800s.about.com/od/1800sglossary/g/Gadsden-Purchase.htm", "passage_text": "The land to the north of the Gila River, in United States territory, was too mountainous. President Pierce instructed the American minister to Mexico, James Gadsden, to purchase as much territory in northern Mexico as possible. The Gadsden Purchase represented the last parcel of land acquired by the United States to complete the 48 mainland states. The transaction with Mexico was controversial and it intensified the simmering conflict over slavery and helped to inflame the regional differences that eventually led to the Civil War."}, {"url": "http://www.answers.com/Q/What_was_the_land_purchased_in_the_Gadsden_Purchase_used_for", "passage_text": "Franklin Pierce was the President when the Gadsden Purchase was made in 1853. The Gadson Purchase was an 1853 agreement to buy a strip of land in what is now the southern United States so that a railroad line could be built to the Gulf of California. James Gadsden was the U.S. Minister to Mexico and the man responsible for the deal. Enjoy candle and soap making and the pets (two dogs). The land in extreme southern New Mexico and Arizona south of the Gila River which was bought from Mexico was purchased by the United States in 1853 to ensure territorial rights for a southern railroad route to the Pacific Coast."}, {"url": "http://www.historytoday.com/richard-cavendish/gadsden-purchase", "passage_text": "In 1853 President Pierce sent Gadsden to Mexico to negotiate a redefinition of the border. The Mexican regime was urgently in need of money and for $10 million sold the required strip of territory south of the Gila River, in what is now southern New Mexico and Arizona. It was the Gadsden Purchase on December 30th, 1853, that settled the main boundaries of the USA. It was the Gadsden Purchase that settled the main boundaries of the United States of America (though Alaska was added in 1867)"}, {"url": "http://www.infoplease.com/encyclopedia/history/gadsden-purchase.html", "passage_text": "Gadsden Purchase (gădzˈdən) [ key ], strip of land purchased (1853) by the United States from Mexico. 1 Gadsden Purchase: meaning and definitions-Gadsden Purchase: Definition and Pronunciation. 2  New Mexico-Information on New Mexico — economy, government, culture, state map and flag, major cities, points of interest, famous residents, state motto, symbols, nicknames, and other trivia."}, {"url": "http://history1800s.about.com/od/1800sglossary/g/Gadsden-Purchase.htm", "passage_text": "The Gadsden Purchase was a strip of territory the United States purchased from Mexico following negotiations in 1853. The land was purchased because it was considered to be a good route for a railroad across the Southwest to California. The Gadsden Purchase represented the last parcel of land acquired by the United States to complete the 48 mainland states. The transaction with Mexico was controversial and it intensified the simmering conflict over slavery and helped to inflame the regional differences that eventually led to the Civil War."}, {"url": "http://history1800s.about.com/od/1800sglossary/g/Gadsden-Purchase.htm", "passage_text": "The treaty between the United States and Mexico was signed by James Gadsden on December 30, 1853, in Mexico City. And the treaty was ratified by the U.S. Senate in June 1854. The controversy over the Gadsden Purchase prevented the Pierce administration from adding any more territory to the United States. The Gadsden Purchase represented the last parcel of land acquired by the United States to complete the 48 mainland states. The transaction with Mexico was controversial and it intensified the simmering conflict over slavery and helped to inflame the regional differences that eventually led to the Civil War."}, {"url": "http://www.historytoday.com/richard-cavendish/gadsden-purchase", "passage_text": "Modern USA Political Franklin Pierce. It was the Gadsden Purchase on December 30th, 1853, that settled the main boundaries of the USA. It was the Gadsden Purchase that settled the main boundaries of the United States of America (though Alaska was added in 1867)"}, {"url": "http://www.answers.com/Q/What_was_the_land_purchased_in_the_Gadsden_Purchase_used_for", "passage_text": "What country did the US buy land from in the Gadsden Purchase?   Mexico The Gadsden Purchase is a region of present-day southern Arizona and southwestern New Mexico purchased by the U.S. from Mexico on December 30, 1853, the last of s … uch large territorial acquisitions in the mainland United States. Enjoy candle and soap making and the pets (two dogs). The land in extreme southern New Mexico and Arizona south of the Gila River which was bought from Mexico was purchased by the United States in 1853 to ensure territorial rights for a southern railroad route to the Pacific Coast."}]