[{"url": "https://www.stdtestexpress.com/hepatitis/", "passage_text": "Hepatitis information. Hepatitis is a broad term that means inflammation of the liver which can be caused by a variety of things such as alcohol abuse, drug abuse and certain viruses. This broader definition of hepatitis is different from viral hepatitis. Viral hepatitis is a condition caused by a variety of viruses that attack the liver. There are three types of viral hepatitis that cause the majority of hepatitis cases: A, B, and C. hepatitis A is typically contracted by eating or drinking contaminated food or water. It can cause acute symptoms, but hepatitis A typically does not lead to long-term complications."}, {"url": "http://www.sexualityandu.ca/stis-stds/types-of-stis-stds/viral-stis-stds", "passage_text": "The word hepatitis means “inflammation of the liver”. Hepatitis B is a sexually transmitted virus that can cause scarring of the liver, liver failure, and liver diseases such as cirrhosis and liver cancer. Worldwide, hepatitis B is very common. Genital Herpes is caused by the Herpes Simplex Virus (HSV) which is from the same family of viruses that cause cold sores. Cold sores are generally caused by a type of Herpes Simplex Virus called HSV-1, and genital herpes is usually caused by type HSV-2."}, {"url": "https://www.aids.gov/pdf/hiv-viral-hepatitisacc.pdf", "passage_text": "In the United States (US), the most common causes of viral hepatitis are hepatitis A virus (HAV), hepatitis B virus (HBV), and hepatitis C virus (HeV). You can get some forms of viral hepatitis the same way you get HIV-through unprotected sexual contact and injection drug use."}, {"url": "http://www.cdc.gov/std/tg2015/hepatitis.htm", "passage_text": "Hepatitis A. Hepatitis A, caused by infection with the hepatitis A virus (HAV), has an incubation period of approximately 28 days (range: 15–50 days) (819) 820). HAV infection is primarily transmitted by the fecal-oral route, by either person-to-person contact or through consumption of contaminated food or water (821) . Hepatitis B is caused by infection with the hepatitis B virus (HBV). The incubation period from time of exposure to onset of symptoms is 6 weeks to 6 months."}, {"url": "http://public.health.oregon.gov/DiseasesConditions/HIVSTDViralHepatitis/Pages/index.aspx", "passage_text": "Page Content. HIV, other sexually transmitted diseases (STDs) such as gonorrhea and chlamydia, and viral hepatitis are often transmitted in the same ways. "}, {"url": "http://www.webmd.com/hepatitis/hepatitis-and-sex-frequently-asked-questions", "passage_text": "Hepatitis C can be treated and even cured. And treatment is important -- hepatitis C, caused by a virus, can permanently damage your liver if you don't take medicine for it. Treatment for hepatitis C keeps changing quickly. Hepatitis B (HBV) is 50 to 100 times easier to transmit sexually than HIV (the virus that causes AIDS). HBV has been found in vaginal secretions, saliva, and semen. Oral sex and especially anal sex, whether it occurs in a heterosexual or homosexual context, are possible ways of transmitting the virus."}, {"url": "http://www.health.state.mn.us/divs/idepc/diseases/hepa/hepastd.html", "passage_text": "Complications. Hepatitis A: 1  Hepatitis A can spread to sex partners. 2  Hepatitis A causes no long-term liver damage and usually does not cause death. 3  There is no chronic carrier state. 4  Having had the disease produces lifelong immunity against re-infection. "}, {"url": "http://www.sexualityandu.ca/stis-stds/types-of-stis-stds/viral-stis-stds", "passage_text": "Those with a chronic hepatitis infection may develop serious liver damage over time. Chronic hepatitis B infected are at higher risk of liver failure and liver diseases such as cirrhosis and liver cancer. In some cases, complications of liver damage causes death. Genital Herpes is caused by the Herpes Simplex Virus (HSV) which is from the same family of viruses that cause cold sores. Cold sores are generally caused by a type of Herpes Simplex Virus called HSV-1, and genital herpes is usually caused by type HSV-2."}, {"url": "https://en.wikipedia.org/wiki/Sexually_transmitted_disease", "passage_text": "1 Viral hepatitis (Hepatitis B virus)—saliva, venereal fluids. ( 2 Note: Hepatitis A and Hepatitis E are transmitted via the fecal-oral route; Hepatitis C is rarely sexually transmittable, and the route of transmission of Hepatitis D (only if infected with B) is uncertain, but may include sexual transmission. 1 ("}, {"url": "https://www.stdtestexpress.com/hepatitis/", "passage_text": "Types of hepatitis. There are three types of viral hepatitis that cause the majority of hepatitis cases: A, B, and C. hepatitis A is typically contracted by eating or drinking contaminated food or water. It can cause acute symptoms, but hepatitis A typically does not lead to long-term complications."}]