[{"url": "http://www.brighthub.com/science/medical/articles/76799.aspx", "passage_text": "The blood test for albumin measures the level of albumin in the liquid portion of the blood, also known as the blood serum. Albumin is a soluble protein that is responsible for transporting certain molecules throughout the body, including hormones, vitamins, drugs and ions. The albumin blood test requires a blood sample drawn from a vein with a needle. Certain medications can increase the level of albumin in the blood, such as anabolic steroids, growth hormone, insulin and androgens."}, {"url": "http://www.scripps.org/articles/2859-albumin-blood-serum", "passage_text": "Definition. Albumin is a protein made by the liver. A serum albumin test measures the amount of this protein in the clear liquid portion of the blood. "}, {"url": "http://www.webmd.com/food-recipes/prealbumin-blood-test", "passage_text": "Test Overview. This test measures the amount of prealbumin in the blood. Prealbumin is a protein that is made in the liver and released in the blood. It helps carry certain hormones that regulate the way the body uses energy and other substances through the blood"}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=albumin_blood", "passage_text": "This test measures the amount of the protein albumin in your blood. Your liver makes albumin. Albumin carries substances such as hormones, drugs, and enzymes throughout your body. This test can help diagnose, evaluate, and watch kidney and liver conditions. When your kidneys begin to fail, albumin starts to leak into your urine. This causes a low albumin level in your blood."}, {"url": "https://labtestsonline.org/understanding/analytes/microalbumin/tab/sample", "passage_text": "Albumin is a major protein normally present in blood. The urine albumin test detects and measures the amount of albumin in the urine. The presence of a small amount of albumin in the urine may be an early indicator of kidney disease. A small amount of albumin in the urine is sometimes referred to as urine microalbumin or microalbuminuria. "}, {"url": "http://www.webmd.com/a-to-z-guides/total-serum-protein", "passage_text": "Guide. A total serum protein test measures the total amount of protein in the blood. It also measures the amounts of two major groups of proteins in the blood: albumin and globulin. 1  Albumin is made mainly in the liver. 2  It helps keep the blood from leaking out of blood vessels. 3  Albumin also helps carry some medicines and other substances through the blood and is important for tissue growth and healing."}, {"url": "http://www.brighthub.com/science/medical/articles/76799.aspx", "passage_text": "The albumin blood test measures the amount of albumin in the blood serum. It can be used to evaluate how well the liver and kidneys are functioning. Low levels can indicate liver damage, while high levels indicate dehydration. The albumin blood test requires a blood sample drawn from a vein with a needle. Certain medications can increase the level of albumin in the blood, such as anabolic steroids, growth hormone, insulin and androgens."}, {"url": "http://www.medicalhealthtests.com/askquestion/186/what-does-albumin-mean-in-a-test.html", "passage_text": "Tweet. Albumin is a protein manufactured by the liver. It helps balance the amount of blood flowing through the arteries and veins and moves the calcium, progesterone, bilirubin and medications through a person’s blood. It also stops fluid in the blood from leaking into the tissues. "}, {"url": "http://www.cigna.com/healthwellness/hw/medical-tests/prealbumin-blood-test-abo7852", "passage_text": "This test measures the amount of prealbumin in the blood. Prealbumin is a protein that is made in the liver and released in the blood. It helps carry certain hormones that regulate the way the body uses energy and other substances through the blood. "}]