[{"url": "http://www.baseball-almanac.com/recbooks/rb_guin.shtml", "passage_text": "Longest Home Run. The record for the longest estimated home run in a major-league game is 634 ft., by Mickey Mantle for the New York Yankees against the Detroit Tigers at Briggs Stadium in Detroit, Michigan, in September 1960."}, {"url": "http://www.baseball-almanac.com/recbooks/rb_guin.shtml", "passage_text": "Biggest Contract. The biggest baseball contract is an average of $15 million per year for seven years. It was signed by Kevin Brown of the LA Dodgers on December 12, 1998. On completion, Brown's contract will be worth a total of $105 million. Fastest Base Runner. The record for the fastest time for circling the bases is 13.3 seconds, set by Evar Swanson at Columbus, Ohio in 1932."}, {"url": "http://www.baseball-almanac.com/recbooks/rb_guin.shtml", "passage_text": "The record for attendance for a single game in the US is 92,706, for a game between the LA Dodgers and the Chicago White Sox on October 6, 1959. The record for the highest season's attendance ever in all major-league baseball games is 70,372,221 in 1998."}, {"url": "http://hypertextbook.com/facts/2004/EricaRosenthal.shtml", "passage_text": "The longest measured home run in a Major League Game is 193 meters (634 ft) by Mickey Mantle (USA), when playing for the New York Yankees against the Detroit Tigers at Briggs Stadium, Detroit, Michigan, USA, on September 10, 1960.. 193 m. Question and Answer. Historic Baseball."}, {"url": "http://hypertextbook.com/facts/2004/EricaRosenthal.shtml", "passage_text": "On April 17, 1953, Mickey Mantle is credited with what many consider to be the longest HR in baseball history. He is estimated to have hit a 656 foot home run at Washington's Griffith Stadium off Senator's pitcher Chuck Stobbs.. 172 m. Baseball, the national pastime of the United States, started in the early 1800s."}, {"url": "http://hypertextbook.com/facts/2004/EricaRosenthal.shtml", "passage_text": "Regardless of possible exaggerations there have been many great hitters in the world of baseball. Although we may never be able to know for sure what the farthest hit baseball was, we can assume a range from different sources and that's from about 150–200 m (500–650 feet)."}, {"url": "http://www.answers.com/Q/What_is_the_record_for_number_of_foul_balls_hit_during_one_at_bat", "passage_text": "Batter: Luke Appling (White Sox). Year: 1940. Foul ball records are not kept, but baseball author Bill James once wrote that Roy Thomas, who played in the National League from 1899 to 1911, fouled off 22 pitches in one at-bat. Hall of Famer Luke Appling reputedly hit 17 fouls while waiting for a pitch he liked."}]