[{"url": "https://en.wikipedia.org/wiki/Pathophysiology", "passage_text": "CSF/S glu = 0.4. Pathophysiology or physiopathology is a convergence of pathology with physiology. Pathology is the medical discipline that describes conditions typically observed during a disease state, whereas physiology is the biological discipline that describes processes or mechanisms operating within an organism. Pathology describes the abnormal or undesired condition, whereupon pathophysiology seeks to explain the physiological processes or mechanisms whereby such condition develops and progresses. Pathophysiology can also mean the functional changes associated with or resulting from disease or injury. Another definition is the functional changes that accompany a particular disease"}, {"url": "http://www.answers.com/Q/What_does_pathophysiology_means", "passage_text": "Thus, pathophysiology basically refers to the study of biological function during states of disease or dysfunction. For example, pathophysiology would explain kidney function when a person has diabetes. Most people study Human Physiology, and this is what it usually refers to in a college catalog. The term pathophysiology refers to the processes which occur when an illness develops. Therefore, in tonsillitis, the tonsils become overloaded with an infection of a viral … or bacterial nature. This causes inflammation of the area."}, {"url": "http://www.wisegeek.org/what-is-pathophysiology.htm", "passage_text": "Adorable animal families that will make you aww. Pathophysiology is the study of functional changes in the body that occur in response to disease or injury. For example, if someone ingests a toxin, that toxin might be associated with a variety of physical changes, such as inflammation in the stomach lining or necrosis of the extremities. "}, {"url": "http://www.answers.com/Q/What_does_pathophysiology_means", "passage_text": "1 Pathophysiology: Definition and Practice A pathophysiology definition states that it is a hybrid family of pathology and physiology. 2  The first refers to conditions that usually appear when there is disease, while th…. The term pathophysiology refers to the processes which occur when an illness develops. Therefore, in tonsillitis, the tonsils become overloaded with an infection of a viral … or bacterial nature. This causes inflammation of the area."}, {"url": "http://medical-dictionary.thefreedictionary.com/pathophysiology", "passage_text": "the study of the biologic and physical manifestations of disease as they correlate with the underlying abnormalities and physiologic disturbances. Pathophysiology does not deal directly with the treatment of disease. Rather, it explains the processes within the body that result in the signs and symptoms of a disease. "}, {"url": "http://www.answers.com/Q/What_is_pathophysiology", "passage_text": "Thus, pathophysiology basically refers to the study of biological function during states of disease or dysfunction. For example, pathophysiology would explain kidney function when a person has diabetes. Most people study Human Physiology, and this is what it usually refers to in a college catalog. Share to: 1  Pathophysiology: Definition and Practice A pathophysiology definition states that it is a hybrid family of pathology and physiology. 2  The first refers to conditions that usually appear when there is disease, while th…. 3  The Five Major Parts of the Brain At its most basic, the brain controls the body."}, {"url": "http://www.merriam-webster.com/dictionary/pathophysiology", "passage_text": "Medical Definition of PATHOPHYSIOLOGY. : the physiology of abnormal states; specifically: the functional changes that accompany a particular syndrome or disease. — patho·phys·i·o·log·i·cal \\-ē-ə-ˈlaej-ˈläj-i\\ kəl or·patho·phys·i·o·log \\-ic\\ ik. — adjective·patho·phys·i·ol·o \\-gist-ē-ˈael-ˈäl\\ ə. jəst noun : the physiology of abnormal states; specifically: the functional changes that accompany a particular syndrome or disease. — patho·phys·i·o·log·i·cal \\-ē-ə-ˈlaej-ˈläj-i\\ kəl or·patho·phys·i·o·log \\-ic\\ ik. adjective"}, {"url": "http://www.definitions.net/definition/pathophysiology", "passage_text": "Pathophysiology. Pathophysiology is a convergence of pathology with physiology. Pathology is the medical discipline that describes conditions typically observed during a disease state, whereas physiology is the biological discipline that describes processes or mechanisms operating within an organism. "}, {"url": "https://answers.yahoo.com/question/index?qid=20081203130833AAYfLXk", "passage_text": "Asker's rating. Report Abuse. Pathophysiology is the study of the disturbance of normal mechanical, physical, and biochemical functions, either caused by a disease, or resulting from a disease or abnormal syndrome, or condition that may not qualify to be called a disease. "}]