[{"url": "http://www.und.edu/org/ndwild/snake3.html", "passage_text": "Although hognose snakes are not poisonous to humans, they do have a venom that is released through hollow back teeth into their prey. These snakes will eat almost anything they can swallow, including toads, lizards, snakes, reptile eggs, small birds, and rodents."}, {"url": "http://www3.northern.edu/natsource/REPTILES/Hognos1.htm", "passage_text": "Description. The western hognose snake also known as the blow snake and the puff adder is, in spite of its nicknames, a harmless, non-poisonous creature. The size of the hognose can range from 12 to 48 inches (30.5 - 122 cm) long, with a girth of 2 to 4 inches (5 to 10 cm)."}, {"url": "http://www.animalspot.net/eastern-hognose-snake.html", "passage_text": "Eastern Hognose snake is a sleek, mildly or almost non-venomous and very interesting species of snakes. Their defensive nature is as interesting as their other traits of behavior. The species is perfectly safe and not endangered. It is widely found in many regions of the US."}, {"url": "http://acsnakes.co.uk/care/hognose.htm", "passage_text": "Heterodon nasicus Introduction Western Hognose Snakes are a mildly venomous, small colubrid species with an upturned snout which is used for digging. A species which is particularly active during the day (diurnal) and very energetic which makes them an extremely interesting and amusing captive to observe."}, {"url": "http://www3.northern.edu/natsource/REPTILES/Hognos1.htm", "passage_text": "Status: Common, Native Resident. The western hognose snake also known as the blow snake and the puff adder is, in spite of its nicknames, a harmless, non-poisonous creature. The size of the hognose can range from 12 to 48 inches (30.5 - 122 cm) long, with a girth of 2 to 4 inches (5 to 10 cm)."}, {"url": "http://www.timsreptiles.co.za/colubrids/hognose-snakes/are-western-hognose-snakes-venomous", "passage_text": "Verdict. In America where Western Hognose Snakes are native they are not considered venomous. Despite forums placing them as mildly venomous and some pet shops putting then in the venomous section of their websites, your newly purchased Western Hognose Snake is highly unlikely to cause a medical problem if it bites you."}, {"url": "http://www.northcountrypublicradio.org/news/story/11068/20140501/our-mildly-venomous-neighbor-the-hognose-snake", "passage_text": "May 01, 2014 — The Eastern hognose snake is better known by its nickname, puff adder, derived from its aggressive display when disturbed. Its bite is mildly venomous, capable of sedating small prey, such as toads. Martha Foley and Curt Stager discuss this common northeastern reptile."}]