[{"url": "http://learn.org/articles/What_is_the_Average_Cost_of_Tuition_Per_Credit_Hour_for_an_Online_University.html", "passage_text": "Several colleges and universities provide a discounted tuition rate for residents of the state in which the school is located. Hibbing Community College, for example, charged Minnesota residents $199.93 per credit hour for online courses and $239.33 for non-residents as of 2013-2014. Type of Program. An online university's average cost of tuition might depend on the type of program you are enrolled in. For instance, courses in the online business management program at Capitol College cost $398 per credit hour according to the school's website for the 2013-2014 academic year."}, {"url": "http://www.brighthub.com/education/college/articles/83976.aspx", "passage_text": "Students considering a private college education need to be prepared to dig much deeper into the pockets: the average annual cost for a four-year school is about $27,293 for fees and tuition. What is missing from this equation is an exact accounting for the amount of credit hours an ‘average’ student takes per year. 1 In-state tuition for a public four-year college: $7,605: 30 credit hours = $253.50/credit hour. 2  Out-of-state tuition for a public four-year college: $19,595: 30 = $653.16"}, {"url": "http://www.brighthub.com/education/college/articles/83976.aspx", "passage_text": "Following this caveat, the breakdown of the cost is as follows: 1  In-state tuition for a public four-year college: $7,605: 30 credit hours = $253.50/credit hour. 2  Out-of-state tuition for a public four-year college: $19,595: 30 = $653.16/credit hour. 1"}, {"url": "https://www.owens.edu/bursar/tuition.html", "passage_text": "Tuition & Fees. The tuition structure for Owens Community College has changed, effective for the Fall 2015 semester. Please note, the lowest cost per credit hour is when a student is enrolled for 14 or 15 hours in a given semester. This is effective for in-state, out-of-state, and international student enrollment"}, {"url": "http://www.brighthub.com/education/college/articles/83976.aspx", "passage_text": "Take for example the University of Nebraska at Lincoln; resident tuition (as of August, 2010) costs $198 per credit hour while out-of-state learners pay $588. Ivy League Harvard College, on the other hand, charges about $1,166 per credit hour. 1 In-state tuition for a public four-year college: $7,605: 30 credit hours = $253.50/credit hour. 2  Out-of-state tuition for a public four-year college: $19,595: 30 = $653.16"}, {"url": "http://www.lonestar.edu/tuition.htm", "passage_text": "1 In-district: Includes tuition at the rate of $42 per credit hour, a $9 per credit hour technology fee, a $2 per credit hour student activity fee, a $7 per credit hour general use fee, a registration fee of $12 and a facility use fee of $20. In-District Base Tuition & Fees ($60 per credit hour). *NOTE: Due to statutory requirement, tuition may not be less than $200 (minimum tuition). Includes an additional out-of-state tuition fee of $85 per credit hour. * Most courses repeated 3 or more times will be assessed an additional fee"}, {"url": "http://www.brighthub.com/education/college/articles/83976.aspx", "passage_text": "The College Board explains that the average public four-year college student should expect to pay $7,605 in tuition as well as fees for each year of attendance. If the student is not a resident of the state, another $11,990 constitutes the out-of-state tuition charge. 1 In-state tuition for a public four-year college: $7,605: 30 credit hours = $253.50/credit hour. 2  Out-of-state tuition for a public four-year college: $19,595: 30 = $653.16"}, {"url": "http://learn.org/articles/What_is_the_Average_Cost_of_Tuition_Per_Credit_Hour_for_an_Online_University.html", "passage_text": "Graduate and Undergraduate. The average cost of tuition per credit hour for online graduate courses is typically higher than that of online undergraduate courses. This cost is generally around $100 more per credit hour. Type of Program. An online university's average cost of tuition might depend on the type of program you are enrolled in. For instance, courses in the online business management program at Capitol College cost $398 per credit hour according to the school's website for the 2013-2014 academic year."}, {"url": "http://learn.org/articles/What_is_the_Average_Cost_of_Tuition_Per_Credit_Hour_for_an_Online_University.html", "passage_text": "Per-Credit Tuition for an Online University. The average cost per credit hour at Columbia College Online, Online University of Illinois-Springfield, Online University of Wisconsin and several other online universities is between $200 and $300. However, many factors can impact the cost of a complete online degree program. Type of Program. An online university's average cost of tuition might depend on the type of program you are enrolled in. For instance, courses in the online business management program at Capitol College cost $398 per credit hour according to the school's website for the 2013-2014 academic year."}]