[{"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-955-WILLOW%20BARK.aspx?activeIngredientId=955&activeIngredientName=WILLOW%20BARK", "passage_text": "Willow bark is also used for fever, the common cold, flu, and weight loss. Salicin, the active ingredient in willow bark, seems to have contributed to the death of the composer, Ludwig von Beethoven. WILLOW BARK Side Effects & Safety. Willow bark is POSSIBLY SAFE for most people when taken by mouth for a short time (up to 12 weeks). It may cause stomach upset and digestive system upset. It can also cause itching, rash, and allergic reactions, particularly in people allergic to aspirin."}, {"url": "http://www.healthline.com/health/willow-bark-natures-aspirin", "passage_text": "The white willow and black willow are two of the most common willows used for medicinal purposes. The main chemical that gives willow bark its therapeutic effects is salicin. Experts believe that when the body processes salicin, it turns it into salicylic acid, which is the chemical precursor to aspirin. In 1928, European chemists figured out how to extract salicin and turn it into salicylic acid. For over 2,000 years, willow bark has been used in Chinese medicine for its anti-inflammatory and pain relieving properties. When most people think of the willow tree, they think of Harry Potter or their favorite Disney film."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-955-WILLOW%20BARK.aspx?activeIngredientId=955&activeIngredientName=WILLOW%20BARK", "passage_text": "Salsalate (Disalcid) is called a salicylate. It's similar to aspirin. Willow bark also contains a salicylate similar to aspirin. Taking salsalate (Disalcid) along with willow bark might increase the effects and side effects of salsalate (Disalcid). WILLOW BARK Side Effects & Safety. Willow bark is POSSIBLY SAFE for most people when taken by mouth for a short time (up to 12 weeks). It may cause stomach upset and digestive system upset. It can also cause itching, rash, and allergic reactions, particularly in people allergic"}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-955-WILLOW%20BARK.aspx?activeIngredientId=955&activeIngredientName=WILLOW%20BARK", "passage_text": "Willow bark acts a lot like aspirin, so it is used for pain, including headache, muscle pain, menstrual cramps, rheumatoid arthritis (RA), osteoarthritis, gout, and a disease of the spine called ankylosing spondylitis. WILLOW BARK Side Effects & Safety. Willow bark is POSSIBLY SAFE for most people when taken by mouth for a short time (up to 12 weeks). It may cause stomach upset and digestive system upset. It can also cause itching, rash, and allergic reactions, particularly in people allergic to aspirin."}, {"url": "http://www.petcarenaturally.com/handouts/white-willow-bark.pdf", "passage_text": "White Willow Bark What is white willow bark? White willow bark (salix alba) is the source from which aspirin is extracted. It is often used as a natural substitute for aspirin in the treatment of musculoskeletal pain and inflammation, and in the prevention of blood clots."}, {"url": "http://wholehealthchicago.com/2009/05/19/white-willow-bark/", "passage_text": "Doctor Recommendations David Edelberg, M.D. It’s salicin, the active ingredient in the bark of the white willow tree (Salix alba), that provides the key pain-relieving ingredient here. In the body, this herb is slowly converted into salicylic acid, which leads it to behave like aspirin, its chemical cousin. Specifically, white willow bark may help to: Relieve acute and chronic pain, including headache, back and neck pain, muscle aches, and menstrual cramps. The effectiveness of white willow bark for easing these and other types of discomforts results from its power to lower prostaglandin levels."}, {"url": "http://wholehealthchicago.com/2009/05/19/white-willow-bark/", "passage_text": "The bark of the stately white willow tree (Salix alba) has been used in China for centuries as a medicine because of its ability to relieve pain and lower fever. Early settlers to America found Native Americans gathering bark from indigenous willow trees for similar purposes. Specifically, white willow bark may help to: Relieve acute and chronic pain, including headache, back and neck pain, muscle aches, and menstrual cramps. The effectiveness of white willow bark for easing these and other types of discomforts results from its power to lower prostaglandin levels."}, {"url": "https://en.wikipedia.org/wiki/White_Willow", "passage_text": "Salix alba (white willow) is a species of willow native to Europe and western and central Asia. The name derives from the white tone to the undersides of the leaves. 1 Salix alba 'Sericea' (silver willow) is a cultivar where the white hairs on the leaves are particularly dense, giving it more strongly silvery-white foliage. 2  This cultivar has gained the Royal Horticultural Society 's Award of Garden Merit."}, {"url": "http://wholehealthchicago.com/2009/05/19/white-willow-bark/", "passage_text": "Although white willow is the species of willow tree most commonly used for medicinal purposes, other salicin-rich species are employed as well, including crack willow (Salix fragilis), purple willow (Salix purpurea), and violet willow (Salix daphnoides). These all may be sold under the label of willow bark. Specifically, white willow bark may help to: Relieve acute and chronic pain, including headache, back and neck pain, muscle aches, and menstrual cramps. The effectiveness of white willow bark for easing these and other types of discomforts results from its power to lower prostaglandin levels."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-955-WILLOW%20BARK.aspx?activeIngredientId=955&activeIngredientName=WILLOW%20BARK", "passage_text": "WILLOW BARK Overview Information. Willow bark is the bark from several varieties of the willow tree, including white willow or European willow, black willow or pussy willow, crack willow, purple willow, and others. WILLOW BARK Side Effects & Safety. Willow bark is POSSIBLY SAFE for most people when taken by mouth for a short time (up to 12 weeks). It may cause stomach upset and digestive system upset. It can also cause itching, rash, and allergic reactions, particularly in people allergic to aspirin."}]