[{"url": "http://www.mamapedia.com/article/bugs-coming-up-from-the-drain", "passage_text": "answers from Chicago on. Very tiny bugs coming up the drain that hop a little are probably springtales...I goggled tiny little bugs that hop when I first encountered them and that's what came up."}, {"url": "https://merylspestcontrol.com/little-bugs-the-sink/", "passage_text": "Little bugs that come up through the sinks drain. Little bugs that come out of the sink. This is a common call we get at Meryl’s Termite and Pest Control. In the past, we covered filth flies and no-see-ums. Today we’re going to concentrate specifically on the sink itself which is their harborage area."}, {"url": "http://chronofhorse.com/forum/archive/index.php/t-254862.html", "passage_text": "Those are drain flies. (Sometimes called moth flies) They look like little brown fruit flies. They're not from your septic, they fly down your drains and breed in the damp mushy gunk that collects inside your pipes. The way to get rid of them is to use a foaming type drain cleaner on any drains you find them around."}, {"url": "http://www.wikihow.com/Get-Rid-of-Drain-Flies", "passage_text": "Drain flies live and breed in the organic matter trapped inside moist drains, so getting rid of these pests is usually as simple as removing the gunk inside your pipes. A thorough cleaning should do the trick, and before you know it the drain flies will be history."}, {"url": "http://www.ehow.com/info_8119587_little-out-sink-bathtub-drains.html", "passage_text": "Seeing bugs in your home can conjure up images of disease and filth, especially when you see a large number of them. The tiny black bugs that emerge from your bathtub and sink drains are commonly known as drain flies, although some call them drain moths, filter flies and sewer flies. Although drain flies generally do not transmit disease, you will want to remove them from your home permanently in case they do."}, {"url": "https://merylspestcontrol.com/little-bugs-the-sink/", "passage_text": "Getting a professional to clean the trap of the sink could help reduce the problem. Meryl’s Termite and Pest Control. Your integrated pest management professionals since 1991 serving Marion, Lake, Sumter and Citrus counties. Little bugs that come up through the sinks drain. 1  Tweet 0. 2  Share 0. + 3 1. 4  Reddit. 5  Pocket."}]