[{"url": "http://www.chemistryexplained.com/elements/L-P/Mercury.html", "passage_text": "Overview. Mercury is a transition metal. A transition metal is one of the elements found between Groups 2 (IIA) and 13 (IIIA) on the periodic table. The periodic table is a chart that shows how chemical elements are related to one another. Mercury has long been known as quicksilver, because it is a silver liquid."}, {"url": "http://www.livescience.com/39232-facts-about-mercury.html", "passage_text": "Named after the fastest-moving planet in the solar system, mercury has been known to humanity for ages. In fact, evidence of its use has been found in China, India and Egypt, and traces of mercury were found in 3,500-year-old Egyptian tombs. Mercury is a very toxic element."}, {"url": "http://education.jlab.org/itselemental/ele080.html", "passage_text": "History and Uses: Mercury was known to the ancient Chinese and Hindus and has been found in 3500 year old Egyptian tombs. Mercury is not usually found free in nature and is primarily obtained from the mineral cinnabar (HgS). Spain and Italy produce about half of the world's supply of Mercury."}, {"url": "http://www.whodiscoveredit.com/who-discovered-mercury.html", "passage_text": "The discovery of mercury as an element was in the 18th century. Incidentally, at about the same time, also 3000 years ago, the Sumerians discovered the planet Mercury. Like the Babylonians who discovered mercury and put in many records but not as an element, the Sumerians recorded the planet mercury quite a lot."}, {"url": "http://www.chemicool.com/elements/mercury.html", "passage_text": "Mercury or quicksilver has been known since ancient times. We do not know who discovered it. Mercury was known to the ancient Chinese, Egyptians and Hindus and has been found in Egyptian tombs dating back to about 1500 B.C. (1), (2), (3)."}, {"url": "http://www.answers.com/Q/How_was_the_element_mercury_discovered", "passage_text": "There is no specific person listed as the discoverer of Mercury. The element mercury has been known since ancient times and was discovered by ancient Chinese and Indians befo … re 2000 BC."}, {"url": "http://www.answers.com/Q/How_was_the_element_mercury_discovered", "passage_text": "The liquid element mercury was isolated by the ancient Chinese and the Egyptians, probably from the mineral cinnabar (mercuric sulfide). Mercury was also refined and used in Mesoamerica by the Maya, independently of the Chinese discovery."}, {"url": "http://www.answers.com/Q/Who_discovered_the_element_mercury", "passage_text": "There is no specific person listed as the discoverer of Mercury. The element mercury has been known since ancient times and was discovered by ancient Chinese and Indians before 2000 BC."}]