[{"url": "http://www.biblestudytools.com/dictionary/angel/", "passage_text": "_I. Definition and Scripture Terms._. The word angel is applied in Scripture to an order of supernatural or heavenly beings whose business it is to act as God's messengers to men, and as agents who carry out His will. The angels of the presence of God, who do not appear to correspond to our conception of guardian angels, are specially interested in God's little ones (Matthew 18:10). Finally, the existence of angels is implied in the Lord's Prayer in the petition, Thy will be done, as in heaven, so on earth (Matthew 6:10)."}, {"url": "https://en.wikipedia.org/wiki/Angel", "passage_text": "In the early stage, the Christian concept of an angel characterized the angel as a messenger of God. Later came identification of individual angelic messengers: Gabriel, Michael, Raphael, Uriel, and Lucifer. The angel is something different from God Himself, but is conceived as God's instrument. In post-Biblical Judaism, certain angels took on particular significance and developed unique personalities and roles."}, {"url": "http://www.merriam-webster.com/dictionary/angel", "passage_text": "Full Definition of ANGEL. 1. a: a spiritual being superior to humans in power and intelligence; especially: one in the lowest rank in the celestial hierarchy b plural: an order of angels — see celestial hierarchy. 2. : an attendant spirit or guardian. Definition of ANGEL for Kids. 1. : a spiritual being serving God especially as a messenger. 2. : a person who is very good, kind, or beautiful."}, {"url": "http://rcg.org/articles/agms.html", "passage_text": "Notice John 3:13: “And no man has ascended up to heaven, but He that came down from heaven, even the Son of man which is in heaven.” Angels are called God’s sons because He created them, not because they were begotten of God, as was Christ, “the firstborn among many brethren” (Rom. 8:29). To understand the origin of angels and God’s purpose for them, the place to start reading is where their first appearance is mentioned in God’s Word. The Bible is like a jigsaw puzzle; the pieces (“here a little, there a little”— Isaiah 28:10) fit together to form a complete picture."}, {"url": "https://carm.org/angels", "passage_text": "Angels are very active in the Bible and are used by God as messengers, warriors, and servants. The word, angel, comes from the Greek word, angelos, which means messenger.. Angels are spiritual beings without bodies of flesh and bones though they apparently have the ability to appear in human form (Gen. 19:1-22). 19:1-22). Angels had many functions. They praised God (Psalm 103:20), served as messengers to the world (Luke 1:11-20, 26-38, Luke 2:9-14), watched over God's people (Psalm 91:11-12), and were sometimes instruments of God's judgment (Matt. 13:49-50)."}, {"url": "http://www.biblestudytools.com/dictionary/angel/", "passage_text": "During his ministry, angels came and ministered to Jesus after he had resisted the devil's temptations (Matt 4:11). Again, when Jesus was submitting himself to God's will in the garden of Gethsemane (Luke 22:40-44), an angel came from heaven to strengthen him. The angels of the presence of God, who do not appear to correspond to our conception of guardian angels, are specially interested in God's little ones (Matthew 18:10). Finally, the existence of angels is implied in the Lord's Prayer in the petition, Thy will be done, as in heaven, so on earth (Matthew 6:10)."}, {"url": "http://www.merriam-webster.com/dictionary/god", "passage_text": "Full Definition of GOD. 1. capitalized: the supreme or ultimate reality: as a: the Being perfect in power, wisdom, and goodness who is worshipped as creator and ruler of the universe b Christian Science: the incorporeal divine Principle ruling over all as eternal Spirit: infinite Mind. 2. "}, {"url": "https://carm.org/dictionary-angel", "passage_text": "Angel means messenger. Angels are created (Psalm 148:2, 5; Col. 1:16)--non-human, spirit beings (Heb. 1:14). They are immortal (Luke 20:36), innumerable (Heb. 12:22), invisible (Num. 22:22-31), sexless (Matt. 22:30), and do the will of God (Psalm 103:20). These angels have a ministry to believers. They guide (Gen. Angels are created (Psalm 148:2, 5; Col. 1:16)--non-human, spirit beings (Heb. 1:14). They are immortal (Luke 20:36), innumerable (Heb. 12:22), invisible (Num. 22:22-31), sexless (Matt. 22:30), and do the will of God (Psalm 103:20). These angels have a ministry to believers"}]