[{"url": "http://www.arb.ca.gov/msprog/truckstop/pdfs/dpf_handbook.pdf", "passage_text": "• Your truck is retrofitted with a Diesel Particulate Filter (DPF). The emissions performance of this retrofit has been verified byARB through rigorous testing.• Keep in mind that a DPF is not a “fit and forget” device. "}, {"url": "http://fleetserv.com/service/dpf-maintenance/understanding-diesel-particulate-filter-maintenance/", "passage_text": "Diesel particulate filters (DPFs) are emission control devices designed to clean the exhaust emitted by vehicles’ diesel engines. FleetServ’s proprietary cleaning process thoroughly cleans DPFs, restoring them to nearly 90% or better of “new” condition. "}, {"url": "http://www.theaa.com/motoring_advice/fuels-and-environment/diesel-particulate-filters.html", "passage_text": "Diesel Particulate filters (DPF) or 'traps' do just that, they catch bits of soot in the exhaust. As with any filter they have to be emptied regularly to maintain performance. For a DPF this process is called 'regeneration' – the collected soot is burnt off at high temperature to leave only a tiny ash residue. "}, {"url": "http://fleetserv.com/service/dpf-maintenance/", "passage_text": "Done Right. It’s a fact that all Diesel Particulate Filters (DPFs) require regular maintenance. While others just blow air into the filter and then call it “clean,” FleetServ’s proprietary cleaning process actually removes nearly all of the ash, soot and contaminates that can drag your vehicles’ performance down. "}, {"url": "http://www.crosspoint.cummins.com/parts-services/dpf-cleaning.html", "passage_text": "The material that is removed from the DPF during cleaning is considered hazardous waste and therefore it must be handled and disposed of in a safe and controlled environment. Crosspoint’s larger branches have the machinery and processes in place to clean your filter and safely dispose of the ash. Home Parts and Service DPF Cleaning. When your heavy-duty engine hits 300,000 miles or 4,500 hours, it’s the recommended time to clean (d-ash) your Diesel Particulate Filter (DPF). This process is required to remove unburned lube oil or ash that has accumulated in the DPF"}, {"url": "http://www.crosspoint.cummins.com/parts-services/dpf-cleaning.html", "passage_text": "When DPF Cleaning is scheduled with other engine work, the filter removal, cleaning and re-installation can be completed in 6 hours. Our trained technicians will visually inspect your filter for any obvious defects or damage. We then test the filter for air flow on the trap tester. Home Parts and Service DPF Cleaning. When your heavy-duty engine hits 300,000 miles or 4,500 hours, it’s the recommended time to clean (d-ash) your Diesel Particulate Filter (DPF). This process is required to remove unburned lube oil or ash that has accumulated in the DPF"}, {"url": "http://www.telegraph.co.uk/motoring/10573720/DPF-removal-the-facts.html", "passage_text": "By Rob Marshall. 1:27PM GMT 21 Jan 2014. Comments. Removing your car's diesel particulate filter (DPF) might be tempting, because the damage caused by a clogged DPF can result in four-figure repair bills. Instead of having a new DPF fitted, it is possible to have it cleaned. A handful of companies offer a mail-order chemical cleaning service, which means your car will off the road for at least 48 hours, but which could potentially save you hundreds of pounds."}, {"url": "http://mechanicalee.blogspot.com/2013/04/dpf-regeneration-instructions.html", "passage_text": "Your car is fitted with a DPF (Diesel Particulate Filter) and you have heard a lot of stories about expensive repair bills, regenerations and additives... So you look on the internet for how you keep your DPF healthy and how 'DPF Regeneration' is performed!! Good news.... "}, {"url": "http://www.justanswer.com/chevy/16usf-clean-exhaust-filter-myself-without-bringing.html", "passage_text": "Your vehicle has a Diesel Particulate Filter (DPF) as part of the exhaust system to reduce vehicle emissions. The DPF requires a unique exhaust tailpipe with an exhaust cooler. The exhaust cooler mixes air with the exhaust at the tailpipe. This lowers the exhaust temperature before it leaves the tailpipe. "}]