[{"url": "http://www.goodreads.com/author/show/78763.Michael_Carroll", "passage_text": "Science Fiction, Fantasy. In 1987 Michael Carroll joined the Irish Science Fiction Association and was soon invited to become editor of their fiction magazine FTL. You'd better warn the rest of your low-life friends that there's a new hero in town. You and your kind wont be tolerated any longer.. Colin stood up and folded his arms. He wished there was a breeze that would make his cape fly a little."}, {"url": "https://www.wcl.american.edu/faculty/mcarroll/", "passage_text": "1 Michael W. Carroll, Presentation, Copyright and the Role of Machines in Cultural Production (Age of Digital Convergence Conference, Hong Kong University (host) & Vanderbilt University Law School, Hong Kong, P.R.C., June 13, 2009). 1 & Tech. 2  L. Rev. 421 (2007). 3  Michael W. Carroll, Creative Commons as Conversational Copyright, in Intellectual Property and Information Wealth, 445-461 (Peter Yu, ed., Praeger 2007)."}, {"url": "https://en.wikipedia.org/wiki/Michael_Carroll", "passage_text": "Michael Carroll may refer to: 1  Michael Carroll (lottery winner) (born 1983), English National Lottery winner. 2  Michael Carroll (space artist). 3  Michael B. Carroll, Pennsylvania politician. 4  Michael Patrick Carroll (born 1958), New Jersey Assemblyman. "}, {"url": "https://en.wikipedia.org/wiki/Michael_Carroll_(author)", "passage_text": "Michael Carroll (born 21 March 1966) is an Irish writer of novels and short stories for adults and children. He is best known for his series of superhero novels The New Heroes and his romantic fiction under the name Jaye Carroll. Biography [edit]. After leaving school at sixteen, he worked as a postman. He moved into computer programming in 1985 at the age of nineteen. In 1990 he met his future wife, Leonia Mooney, at the National Irish Science Fiction Convention, Octocon. He became a full-time writer in 1999"}, {"url": "http://www.michaelowencarroll.com/biog.htm", "passage_text": "He left school at the age of sixteen to work as a postman. During this time he taught himself computer programming and, at the age of nineteen, left the post office and joined a software company. He remained in the computer industry throughout the nineties, writing in his spare time. "}, {"url": "http://www.paperbackswap.com/Michael-Carroll/author/", "passage_text": "Search-List of Books by Michael Carroll. Michael Carroll (born 21 March 1966) is an Irish writer of novels and short stories for adults and children. He is best known for his series of superhero novels The New Heroes and his romantic fiction under the name Jaye Carroll. Bibliography more less. The New Heroes series (known in America as Quantum Prophecy) includes: This was an interactive cd rom application made to accompany the The Brentford Mercury for SproutLore. The short stories written for it by Michael Carroll were all based upon songs by his favourite pop group, Alphaville."}, {"url": "http://www.awakeatwork.net/content/meet-author-michael-carroll", "passage_text": "A Q&A with Michael Carroll. Mindfulness is our natural ability to remember that we are here, present fully in our life—alert, open and engaged. As importantly, mindfulness is also a meditative practice for training our mind to live in the present moment and appreciate our immediate experience. We are always trying to get from point A to point B as quickly and efficiently as possible. Unfortunately, too often when we arrive at point B, our health and well-being is often in tatters. Through mindfulness-awareness we discover that we don’t have to sacrifice sanity and balance in our pursuit of livelihood."}]