[{"url": "https://en.wikipedia.org/wiki/Pansexuality", "passage_text": "Because pansexual people are open to relationships with people who do not identify as strictly men or women, and pansexuality therefore rejects the gender binary, the notion of two genders and indeed of specific sexual orientations, it is often considered a more inclusive term than bisexual. Omni-comes from a Latin term meaning all. Pansexual is derived from the word pansexualism, dated back to 1917, which is the view that the sex instinct plays the primary part in all human activity, mental and physical."}, {"url": "http://www.differencebetween.net/science/nature/difference-between-bi-sexual-and-pan-sexual/", "passage_text": "Bi sexual vs Pan sexual. There is some overlap when defining bisexual and pansexual orientation; however, there are important differences between the two identities. Bisexual people are attracted sexually and romantically to both males and females, and are capable of engaging in sensual relationships with either sex. the difference between pansexuality and bisexuality is actually pretty simple: pan people id as pan and bi people id as bi. there’s a lot of overlap between these 2 sexual orientations, but they’re both totally valid."}, {"url": "https://en.wikipedia.org/wiki/Pansexuality", "passage_text": "Pansexuality, or omnisexuality, is sexual attraction, romantic love, or emotional attraction toward people of any sex or gender identity. Omni-comes from a Latin term meaning all. Pansexual is derived from the word pansexualism, dated back to 1917, which is the view that the sex instinct plays the primary part in all human activity, mental and physical."}, {"url": "https://en.wikipedia.org/wiki/Pansexuality", "passage_text": "A literal dictionary definition of bisexuality, due to the prefix bi- , is sexual or romantic attraction to two sexes (males and females), or to two genders (men and women). Pansexuality, however, composed with the prefix pan- , is the sexual attraction to a person of any sex or gender. Omni-comes from a Latin term meaning all. Pansexual is derived from the word pansexualism, dated back to 1917, which is the view that the sex instinct plays the primary part in all human activity, mental and physical."}, {"url": "https://en.wikipedia.org/wiki/Pansexuality", "passage_text": "The term pansexuality is sometimes used interchangeably with bisexuality, and, similarly, people who identify as bisexual may feel that gender, biological sex, and sexual orientation should not be a focal point in potential [romantic/sexual] relationships. Omni-comes from a Latin term meaning all. Pansexual is derived from the word pansexualism, dated back to 1917, which is the view that the sex instinct plays the primary part in all human activity, mental and physical."}, {"url": "http://heavy.com/entertainment/2015/08/what-is-a-pansexual-miley-cyrus-flags-colors-pansexuality-definition-omnisexuality-bi/", "passage_text": "2. Bisexuality is sexual or romantic attraction to “more than one gender or same and different genders” — while pansexuality is the attraction to a person of any sex or gender. Pansexuals can be attracted to cisgender people, transgender people, intersex people, androgynous people, and anyone else"}, {"url": "http://www.differencebetween.net/science/nature/difference-between-bi-sexual-and-pan-sexual/", "passage_text": "The latter distinction is what draws the line between pansexuality and bisexuality. People who self-identify as pansexual do so with purpose, to express that they are able to be attracted to various gender and sexual identities, whether they fall within the gender binary or not. the difference between pansexuality and bisexuality is actually pretty simple: pan people id as pan and bi people id as bi. there’s a lot of overlap between these 2 sexual orientations, but they’re both totally valid."}, {"url": "http://www.differencebetween.net/science/nature/difference-between-bi-sexual-and-pan-sexual/", "passage_text": "The pan-sexual flag is striped with the rose, blue, and gold, representing the female gender, male gender, and third-gender, respectively. The third-gender includes those who are intersex, genderqueer, transsexual, androgynous, and other who identify as being both genders. the difference between pansexuality and bisexuality is actually pretty simple: pan people id as pan and bi people id as bi. there’s a lot of overlap between these 2 sexual orientations, but they’re both totally valid."}, {"url": "http://www.stop-homophobia.com/pansexuality.htm", "passage_text": "Pansexual is a term that has been growing in recent years as a way for people to better identify their sexual identity. The word Pansexual is derived from the Greek prefix pan, meaning all. The term is reflective of those who feel they are sexually/emotionally/spiritually capable of falling in love with all genders. Definition: Pansexuals have the capability of attraction to others regardless of their gender identity or biological sex. Pansexual people are bisexual, in-fact; however, bisexuality does not place the same emphasis on sexual and gender identity awareness, but more simply indicates attraction to the two (generally accepted) biological sexes."}]