[{"url": "http://www.ehow.com/info_10023367_puk-code-lock.html", "passage_text": "Don't attempt to guess your PUK code. Multiple incorrect entries of the PUK code -- generally 10 -- will cause your SIM card to be permanently disabled. You'll then need to purchase a replacement SIM card. If your SIM card is blocked, you can still make emergency phone calls. If you want to avoid having to enter your PUK code in the future, you can disable the SIM card security lock in your phone's security settings. This will turn off the request for the PIN code when your phone is powered on."}, {"url": "https://answers.yahoo.com/question/index?qid=20080505023323AAJuFCf", "passage_text": "Report Abuse. PUK is a code to unlock your phone from intrudor.. You might have set a code to on your phone.. But you might click the wrong code after 3 trials. Then, u must insert the PUK code. The PUK code is at the sim card package when u bought the sim card. If u cant find it. "}, {"url": "http://www.ehow.com/info_10023367_puk-code-lock.html", "passage_text": "A PIN Unlocking Key is an eight-digit numeric code that's unique to each SIM card. The PUK code is used to enable a SIM card that has been blocked as a security precaution. SIM cards can be protected with the use of a four-to eight-digit PIN code. This code is set by the wireless provider or the user. If your SIM card is blocked, you can still make emergency phone calls. If you want to avoid having to enter your PUK code in the future, you can disable the SIM card security lock in your phone's security settings. This will turn off the request for the PIN code when your phone is powered on."}, {"url": "https://en.wikipedia.org/wiki/Personal_Unblocking_Code", "passage_text": "(July 2010). A personal unblocking code (PUC), also known as a PIN unlock key (PUK), is used in 3GPP mobile phones to reset a personal identification number (PIN) that has been lost or forgotten. Most mobile telephones offer the feature of PIN protection. "}, {"url": "http://unlockworldwide.com/2011/10/what-is-puk/", "passage_text": "The PUC code or PUK key is found on the SIM certificate, which you get when you first connect to a wireless network. Entering the PUK number will bring back the original unlocked status of your cellular phone. The PUK can also be obtained from the network service operator (ie. Is it showing a Locked SIM message? Does it ask for a PUK code? If it asking for a PUK key then you have probably messed with the security settings on your cell phone and the SIM card is now blocked. The PUK (or PUC) number is the PIN code needed to unfreeze the sim card."}, {"url": "http://unlockworldwide.com/2011/10/what-is-puk/", "passage_text": "Summary. If your mobile phone is SIM locked and asking for the PUC or PUK number follow our above instructions on how to find the PUK code. Use our list to find the wireless network that your SIM card is blocked on to contact them for the PUK number. Enter the code and don’t forget to set a new PIN. Is it showing a Locked SIM message? Does it ask for a PUK code? If it asking for a PUK key then you have probably messed with the security settings on your cell phone and the SIM card is now blocked. The PUK (or PUC) number is the PIN code needed to unfreeze the sim card."}, {"url": "http://www.optus.com.au/shop/support/answer/how-to-get-your-puk-code?requestType=NormalRequest&id=1341&typeId=5", "passage_text": "A PUK or 'Personal Unlocking Key' is a security feature on most mobile devices that protects your SIM card data. A PUK code is required when a SIM Card PIN code has been entered incorrectly. You can get your PUK code: 1  Over the Internet: via My Account. 2  Over the phone: via a Call."}, {"url": "http://www.geeksquad.co.uk/articles/Mobiles/2012/04/how_to_find_a_mobile_puk_code", "passage_text": "PUK stands for 'PIN Unlock Key'. It's a unique code that is linked to your specific SIM card and is usually 8 digits long. Some phones may ask for a PUC code instead. This stands for 'PIN Unlock Code' and is exactly the same thing as a PUK Code. WARNING! Do not try and guess your PUK code. If you enter it wrong 10 times, the SIM card will be permanently locked and you will need to get a new one from your network provider. There may be a charge for a new SIM card and you might be stuck without your phone for a couple of days while they send it out"}]