[{"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_pre_2011/chemicals/rocksmineralsrev3.shtml", "passage_text": "Silicon dioxide is very hard. It has a very high melting point (1,610 °C) and boiling point (2,230 °C), is insoluble in water, and does not conduct electricity. These properties result from the very strong covalent bonds that hold the silicon and oxygen atoms in the giant covalent structure."}, {"url": "http://chemguide.co.uk/atoms/structures/giantcov.html", "passage_text": "This page decribes the structures of giant covalent substances like diamond, graphite and silicon dioxide (silicon(IV) oxide), and relates those structures to the physical properties of the substances. The structure of silicon dioxide, SiO2 Silicon dioxide is also known as silicon(IV) oxide. The giant covalent structure of silicon dioxide There are three different crystal forms of silicon dioxide."}, {"url": "http://www.docbrown.info/page04/4_72bond4.htm", "passage_text": "1 The structures of giant covalent structure are usually based on non metal atoms like carbon, silicon and boron. 2  The atoms in a giant covalent lattice are held together by strong directional covalent bonds and every atoms is connected to at least 2, 3 or 4 atoms. 1 TYPICAL PROPERTIES of GIANT COVALENT STRUCTURES. 2  This type of giant covalent structure is thermally very stable and has a very high melting and boiling points because of the strong covalent bond network (3D or 2D in the case of graphite below)."}, {"url": "http://chemical-bonding.wikispaces.com/Giant+Covalent+Structures", "passage_text": "1 There are only five Giant Covalent Structures,namely:Diamond,Graphite,Silicon,Silicon dioxide,Silicon Carbide. 2  Giant covalent structures are held by strong covalent bonds as large amounts of energy is required to overcome the strong covalent bonds between atoms in the giant 3-D covalent structure. "}, {"url": "http://www.docbrown.info/page04/4_72bond4.htm", "passage_text": "The non metallic elements carbon and silicon form giant covalent structures. The structure of the three allotropes of carbon (diamond, graphite and fullerenes), silicon and silicon dioxide (silica). DIAGRAMS. 1  It is possible for many atoms to link up to form a giant covalent structure or lattice. 1 TYPICAL PROPERTIES of GIANT COVALENT STRUCTURES. 2  This type of giant covalent structure is thermally very stable and has a very high melting and boiling points because of the strong covalent bond network (3D or 2D in the case of graphite below)."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa_pre_2011/atomic/differentsubrev3.shtml", "passage_text": "Diamond is a form of carbon in which each carbon atom is joined to four other carbon atoms, forming a giant covalent structure. As a result, diamond is very hard and has a high melting point. It does not conduct electricity. Buckminsterfullerene is yet another allotrope of carbon. It is actually not a giant covalent structure, but a giant molecule in which the carbon atoms form pentagons and hexagons-in a similar way to a leather football. It is used in lubricants. Page: 1  1. 2  2."}, {"url": "https://en.wikipedia.org/wiki/Silicon_tetrachloride", "passage_text": "Silicon tetrachloride is the inorganic compound with the formula SiCl 4. It is a colourless volatile liquid that fumes in air. It is used to produce high purity silicon and silica for commercial applications. Silicon tetrachloride is prepared by the chlorination of various silicon compounds such as ferrosilicon, silicon carbide, or mixtures of silicon dioxide and carbon."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_ocr_pre_2011/chemicals/rocksmineralsrev3.shtml", "passage_text": "Much of the silicon and oxygen in the Earth’s crust is present as the compound silicon dioxide also known as silica. Silicon dioxide has a giant covalent structure. Part of this structure is shown in the diagram-oxygen atoms are shown as red, silicon atoms shown as brown: It has a very high melting point (1,610 °C) and boiling point (2,230 °C), is insoluble in water, and does not conduct electricity. These properties result from the very strong covalent bonds that hold the silicon and oxygen atoms in the"}, {"url": "http://chemguide.co.uk/atoms/structures/giantcov.html", "passage_text": "The structure of silicon dioxide, SiO2. Silicon dioxide is also known as silicon(IV) oxide. The giant covalent structure of silicon dioxide. There are three different crystal forms of silicon dioxide. The easiest one to remember and draw is based on the diamond structure. Crystalline silicon has the same structure as diamond. The structure of silicon dioxide, SiO2 Silicon dioxide is also known as silicon(IV) oxide. The giant covalent structure of silicon dioxide There are three different crystal forms of silicon dioxide."}]