[{"url": "http://www.thefreedictionary.com/kazoo", "passage_text": "Noun. 1. kazoo-a toy wind instrument that has a membrane that makes a sound when you hum into the mouthpiece. wind instrument, wind-a musical instrument in which the sound is produced by an enclosed column of air that is moved by the breath. Translations. kazoo. n, pl-zoos. 1. (Instruments) a cigar-shaped musical instrument of metal or plastic with a membranous diaphragm of thin paper that vibrates with a nasal sound when the player hums into it. [C20: probably imitative of the sound produced]. (kəˈzu)."}, {"url": "https://en.wikipedia.org/wiki/Kazoo", "passage_text": "The kazoo is used regularly on the radio show I'm Sorry I Haven't a Clue, and kazoos are given to all audience members on show tours. The video game Yoshi's New Island, released in 2014, has synthesized kazoos in several tracks of its soundtrack. In the Original Dixieland Jass Band 1921 recording of Crazy Blues, what the casual listener might mistake for a trombone solo is actually a kazoo solo by drummer Tony Sbarbaro or Red McKenzie (as also seen in their 1929 film short)."}, {"url": "http://www.wisegeek.com/what-is-a-kazoo.htm", "passage_text": "These 10 animal facts will amaze you. A kazoo is a musical instrument that creates a buzzing sound when the player hums into it. A kazoo is part of the mirliton family of percussion instruments. Mirlitons have a vibrating membrane that amplifies the humming sound and are derived from ancient African instruments. The first kazoo was manufactured in the 1800s. A kazoo can be considered an unconventional wind instrument since, unlike conventional wind instruments, it has no buttons or valves and is played differently as well. The kazoo depends solely on the player's voice to create the sound."}, {"url": "https://en.wikipedia.org/wiki/Kazoo", "passage_text": "A metal kazoo with a 1 Euro coin for comparison: 23.25 mm (0.92 inch). Examples of Kazoos. The kazoo is a musical instrument that adds a buzzing timbral quality to a player's voice when the player vocalizes into it. It is a type of mirliton, which is a membranophone, one of a class of instruments which modifies its player's voice by way of a vibrating membrane. In the Original Dixieland Jass Band 1921 recording of Crazy Blues, what the casual listener might mistake for a trombone solo is actually a kazoo solo by drummer Tony Sbarbaro or Red McKenzie (as also seen in their 1929 film short)."}, {"url": "http://www.merriam-webster.com/dictionary/kazoo", "passage_text": "Definition of KAZOO. : an instrument that imparts a buzzing quality to the human voice and that usually consists of a small metal or plastic tube with a side hole covered by a thin membrane. ADVERTISEMENT. imitative. First Known Use: 1884."}, {"url": "http://nationalkazooday.com/history.html", "passage_text": "Kazoo History. The kazoo was invented in the 1840's and first presented to the world at the Georgia State Fair in 1852 as the Down South Submarine. Legend tells us that the kazoo was invented by collaboration of Alabama Vest (American black) and Thaddeus Von Clegg (German-American clockmaker). "}, {"url": "http://www.madehow.com/Volume-4/Kazoo.html", "passage_text": "Kazoo. A kazoo is a type of instrument known as a mirliton, which uses a resonating membrane to amplify sound. It belongs in the percussion family of instruments and can be made in a number of ways. Derived from the ancient African mirliton, the kazoo was first manufactured during the 1800s. The kazoo relies on the voice of the musician to produce the sound. When a musician plays a kazoo, he hums into it and that causes the thin film to vibrate. This vibration changes with the sound of the voice giving it the buzzing quality, which is unique to the kazoo."}, {"url": "https://en.wikipedia.org/wiki/Katie_Kazoo", "passage_text": "Katie Kazoo is the title character in a series of books, Katie Kazoo, Switcheroo, written by author Nancy E. Krulik and published by the Penguin Group. Katie is often visited by the magic wind, which turns her into other people and animals. She often makes the situation worse for the person she has switcherooed into. "}]