[{"url": "http://www.ehow.com/info_10021656_financial-product.html", "passage_text": "Yield is the amount of cash the owners of a financial product receive or the rate of return on a financial asset. Risk is the possibility of loss that may prevent adequate return on a financial product. Liquidity is the ability of a financial product to be converted into cash. Yield and liquidity are inversely related while yield and risk are directly related."}, {"url": "http://www.ehow.com/info_10021656_financial-product.html", "passage_text": "A financial product, also called a financial instrument or financial security, refers to an asset that has some monetary value for its owner."}, {"url": "http://www.moneysense.gov.sg/Understanding-Financial-Products.aspx", "passage_text": "Some financial products provide convenience to our everyday lives, such as having a bank account to manage our money. Other products like insurance provide financial coverage against a range of events. Investment products may help us grow the money we have for purposes such as our retirement."}, {"url": "http://www.economywatch.com/investment/financial-products.html", "passage_text": "Financial products refer to instruments that help you save, invest, get insurance or get a mortgage. These are issued by various banks, financial institutions, stock brokerages, insurance providers, credit card agencies and government sponsored entities."}, {"url": "http://www.economywatch.com/investment/financial-products.html", "passage_text": "Types of financial products. 1  Shares: These represent ownership of a company. 2  While shares are initially issued by corporations to finance their business needs, they are subsequently bought and sold by individuals in the share market. 3  They are associated with high risk and high returns."}, {"url": "http://www.lapasserelle.com/online_courses/elementary_finance/financial_products/index.html", "passage_text": "Video. A financial product is a contract between two agents stipulating movements of cash now and in the future. We didn't represent an arrow from A to B, because actually there may be no movement of cash today."}]