[{"url": "https://www.healthtap.com/topics/how-to-walk-again-after-broken-ankle", "passage_text": "Have you seen the Dr: If you have a broken ankle, i hope that that was already evaluated by a foot/ankle specialist. Depending on the type of break (fracture) and how long the condition has been treated, will dictate if it is safe to walk. Fractures typically take 6-8 weeks to heal. Without knowing what kind of break you have, you need to have the doctor that diagnosed your condition re-evaluate it and advise."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/patientinstructions/000548.htm", "passage_text": "Without surgery, your ankle will be placed in a cast or splint for 4 to 8 weeks. 1  The length of time you must wear a cast or splint depends on the type of fracture you have. 2  Your cast or splint may be changed more than once, as your swelling goes down."}, {"url": "http://orthosurg.ucsf.edu/patient-care/divisions/sports-medicine/conditions/ankle-and-foot/ankle-fracture/", "passage_text": "What to expect from an ankle fracture…. Most ankle fractures take about 6-8 weeks to heal, although pain will subside after 2-3 weeks. A splint, cast, or walking boot is necessary until a doctor recommends it be discontinued, usually at approximately 6-8 weeks. Patients treated operatively can usually return to bearing weight on the joint at"}, {"url": "http://www.nhs.uk/conditions/broken-ankle/Pages/Introduction.aspx", "passage_text": "Introduction. A broken or fractured ankle is a relatively common injury, often caused by twisting the ankle, a fall, or a sporting accident. It may be treated with a cast or surgery and usually takes between six and 12 weeks to heal."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/patientinstructions/000548.htm", "passage_text": "To reduce pain and swelling: 1  Sit with your foot elevated higher than your knee at least 4 times a day. 2  Apply an ice pack 20 minutes of every hour you are awake for the first 2 days. 3  After 2 days, use the ice pack for 10 to 20 minutes, 3 times a day as needed."}, {"url": "http://www.nhs.uk/conditions/broken-ankle/Pages/Introduction.aspx", "passage_text": "It takes about six to 12 weeks for a broken ankle to heal, but it may take longer to regain full movement and return to all of your normal activities. Swelling can sometimes take a few years to improve. Ask friends or family to go shopping for you, as you won't be able to do this yourself."}, {"url": "http://www.nhs.uk/conditions/broken-ankle/Pages/Introduction.aspx", "passage_text": "Recovering. It takes about six to 12 weeks for a broken ankle to heal, but it may take longer to regain full movement and return to all of your normal activities. Swelling can sometimes take a few years to improve. Ask friends or family to go shopping for you, as you won't be able to do this yourself."}]