[{"url": "http://www.gnet.org/the-benefits-of-safflower-oil/", "passage_text": "Safflower oil has lots of vitamin e which is good for the immune system. You may not know you can rub safflower oil into the roots of the hair where it can improve its quality and give the hair a great looking sheen. It can also be used as a terrific moisturizer enabling the skin to gain a healthy glow. "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-96-SAFFLOWER.aspx?activeIngredientId=96&activeIngredientName=SAFFLOWER", "passage_text": "Safflower seed oil is used for preventing heart disease, including “hardening of the arteries ” (atherosclerosis) and stroke. It is also used to treat fever, tumors, coughs, breathing problems, clotting conditions, pain, heart disease, chest pain, and traumatic injuries. 1 A scaly skin condition (phrynoderma). 2  Early research suggests that taking safflower oil containing vitamin E and linoleic acid by mouth for more than 8 weeks can improve skin dryness and roughness in people with phrynoderma."}, {"url": "http://www.healthline.com/health/safflower-oil-healthy-cooking-oil", "passage_text": "Safflower oil has three qualities that make it a good ingredient for healthy eating: it’s an unsaturated fat, it has little taste, and it can be heated to higher temperatures than many other less healthy cooking oils (in its monounsaturated form). While research is still in its early stages, safflower oil shows a lot of potential when it comes to health benefits. Its healthy fatty acid content may be able to help with cholesterol."}, {"url": "http://www.buzzle.com/articles/safflower-oil-benefits.html", "passage_text": "Apart from being good for hair, safflower oil benefits the skin in more ways than one. Dry skin can be easily combated with this oil. This is because of the high content of linolenic acid in it. Because of its light and non greasy texture, the oil is easily absorbed by the skin, making it soft, smooth, and supple. The use of safflower oil is also recommended for treating acne, because the linolenic acid combined with sebum in the skin can help to unclog pores, and thus reduce acne and blackheads. Safflower oil also helps in getting rid of other skin problems like scars, wrinkles and extremely dry and flaky skin."}, {"url": "http://www.livestrong.com/article/101297-benefits-safflower-oil/", "passage_text": "Photo Credit bgfoto126/iStock/Getty Images. Olive oil may get all the press, but safflower oil is emerging as a health superstar in its own right. Made from the seeds of safflowers, which are similar to sunflowers, this oil contains healthy fats and may even help prevent cardiovascular disease. All oils are pure fat, however, which means they're high in calories. "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-96-SAFFLOWER.aspx?activeIngredientId=96&activeIngredientName=SAFFLOWER", "passage_text": "The linolenic and linoleic acids in safflower seed oil might help prevent “hardening of the arteries,” lower cholesterol, and reduce the risk of heart disease. Safflower contains chemicals that may thin the blood to prevent clots, widen blood vessels, lower blood pressure, and stimulate the heart. 1 A scaly skin condition (phrynoderma). 2  Early research suggests that taking safflower oil containing vitamin E and linoleic acid by mouth for more than 8 weeks can improve skin dryness and roughness in people with phrynoderma."}, {"url": "http://superhumancoach.com/negative-effects-of-safflower-oil/", "passage_text": "Safflower oil is a colorless, flavorless, and odorless edible oil extracted from the safflower plant. Safflower’s history dates back to the ancient times, with the crop cultivated for its use in fabric dyes. Today, safflower is mainly farmed for its seeds which is the source of this plant’s edible oil. So unless safflower oil is taken alongside edible oils like olive oil, which by the way are high in monounsaturated fats and therefore will not lower the HDL levels, then steering clear of safflower oil would then be prudent."}, {"url": "http://www.buzzle.com/articles/safflower-oil-benefits.html", "passage_text": "Safflower oil, as the name suggests, is a form of oil that is extracted from the seeds of the safflower plant. There are two types of safflower oil; one is rich in monounsaturated fats (MUFA) and the other is rich in polyunsaturated fats (PUFA). The use of safflower oil is also recommended for treating acne, because the linolenic acid combined with sebum in the skin can help to unclog pores, and thus reduce acne and blackheads. Safflower oil also helps in getting rid of other skin problems like scars, wrinkles and extremely dry and flaky skin."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-96-SAFFLOWER.aspx?activeIngredientId=96&activeIngredientName=SAFFLOWER", "passage_text": "Women sometimes use safflower oil for absent or painful menstrual periods; they use safflower flower to cause an abortion. In foods, safflower seed oil is used as a cooking oil. In manufacturing, safflower flower is used to color cosmetics and dye fabrics. 1 A scaly skin condition (phrynoderma). 2  Early research suggests that taking safflower oil containing vitamin E and linoleic acid by mouth for more than 8 weeks can improve skin dryness and roughness in people with phrynoderma."}, {"url": "http://www.healthline.com/health/safflower-oil-healthy-cooking-oil", "passage_text": "High-oleic safflower oil contains monounsaturated fats, while high-linoleic safflower oil contains polyunsaturated fats. Polyunsaturated safflower oil is good for unheated foods and monounsaturated safflower oil is good for high-heat cooking, making it a good substitute for olive oil when cooking. While research is still in its early stages, safflower oil shows a lot of potential when it comes to health benefits. Its healthy fatty acid content may be able to help with cholesterol."}]