[{"url": "http://www.doctor-salaries.com/physician-salary/occupational-therapist-salary/", "passage_text": "Occupational Therapist Salary. Occupational therapists employed in the United States generally report earning salaries in the range from $49,858 to $92,511 a year including bonuses, which can amount to up to $3,050 a year according to the salary information provided by Payscale. The hourly wage varies depending on work experience among other factors. Occupational therapists with 1 to 4 years of experience generally earn between $24.54 and $43.53 per hour, and those with 5 to 9 years of work experience are typically paid between $28.44 and $49.60 per hour."}, {"url": "http://work.chron.com/salaries-physical-therapy-vs-occupational-therapy-6627.html", "passage_text": "The highest pay showed in home health care services, with mean salaries of $41.13 per hour, or $85,540 per year. As with PTs, California offered the best employment for occupational therapists, though average salaries were lower at $40.74 per hour, or $84,750 per year. The state with the most jobs was California, where average salaries were $41.78 per hour, or $86.890 per year. However, the one with the best pay was Nevada, with mean wages of $47.03 per hour, or $97,810 per year. Related Reading: Adapted Physical Education vs. Occupational Therapy."}, {"url": "http://work.chron.com/average-salary-doctorate-occupational-therapist-25966.html", "passage_text": "Salary Ranges. In 2012, the average occupational therapist brought home $76,400 a year, according to the U.S. Bureau of Labor Statistics. But this figure accounts for all practitioners, regardless of degree. A survey by Advance Healthcare Network provides a better idea of what advanced degrees can do for earnings."}, {"url": "http://study.com/articles/Salary_and_Career_Info_for_a_Doctor_of_Physical_Therapy_Degree.html", "passage_text": "The U.S. Bureau of Labor Statistics (BLS) stated that as of May 2013, the median annual wage of physical therapists was $81,030, with the top ten percent taking home $113,340 or more. The BLS anticipates a 36% growth of employment in physical therapy from 2012-2022. All physical therapists must earn a doctoral degree in the field, which usually takes three years, and be licensed by the state in which they practice. Career opportunities for doctors of physical therapy are projected to rise faster than the national average for all occupations."}, {"url": "http://work.chron.com/average-salary-doctorate-occupational-therapist-25966.html", "passage_text": "In 2011, occupational therapists with a bachelor’s degree in the field averaged $73,271 a year, while those with entry-level master’s degrees earned nearly 10 percent less, at an average of $66,690. With doctoral degrees, salaries averaged at $84,872 annually. In 2012, the average occupational therapist brought home $76,400 a year, according to the U.S. Bureau of Labor Statistics. But this figure accounts for all practitioners, regardless of degree. A survey by Advance Healthcare Network provides a better idea of what advanced degrees can do for earnings."}, {"url": "http://www.doctor-salaries.com/physician-salary/occupational-therapist-salary/", "passage_text": "Senior occupational therapists earn a median annual salary of $81,537 according to Payscale and $79,736 according to Jobstat. Licensed and registered occupational therapists earn a median pay of $71,008 a year according to Jobstat’s data, with the highest annual income recorded being $96,299 and the lowest, $53,995. The hourly wage varies depending on work experience among other factors. Occupational therapists with 1 to 4 years of experience generally earn between $24.54 and $43.53 per hour, and those with 5 to 9 years of work experience are typically paid between $28.44 and $49.60 per hour."}, {"url": "http://www.payscale.com/research/US/Job=Physical_Therapist_(PT)/Salary", "passage_text": "Physical Therapist (PT) Salary. (United States). The average salary for a Physical Therapist (PT) is $66,560 per year. The highest paying skills associated with this job are Home Health/Home Care, Long Term Care, Home Care, and Geriatrics. Most people with this job move on to other positions after 20 years in this career. $53,812 - $84,559. "}, {"url": "http://work.chron.com/average-salary-doctorate-occupational-therapist-25966.html", "passage_text": "Though information is limited, as far as the salaries of doctorate-holders by state, the highest reported salaries as a whole were found in Alaska, at an average of $113,732 a year. Those working in California were a distant second, bringing home an average of $88,577. In 2012, the average occupational therapist brought home $76,400 a year, according to the U.S. Bureau of Labor Statistics. But this figure accounts for all practitioners, regardless of degree. A survey by Advance Healthcare Network provides a better idea of what advanced degrees can do for earnings."}, {"url": "http://work.chron.com/salaries-physical-therapy-vs-occupational-therapy-6627.html", "passage_text": "Physical Therapists. Physical therapists earned an average $38.38 per hour, or $79,830 per year, as of May 2011, according to the Bureau of Labor Statistics. However, salaries descended below $26.30 per hour, or $54,710 per year, and rose above $53.21 per hour, or $110,670 per year. The state with the most jobs was California, where average salaries were $41.78 per hour, or $86.890 per year. However, the one with the best pay was Nevada, with mean wages of $47.03 per hour, or $97,810 per year. Related Reading: Adapted Physical Education vs. Occupational Therapy."}, {"url": "http://www.doctor-salaries.com/physician-salary/occupational-therapist-salary/", "passage_text": "Average salary. The average salary for occupational therapists working in the United States is $68,346 a year according to Payscale’s salary data, $78,595 a year according to Salary.com, and $66,931 according to Jobstat. The hourly wage varies depending on work experience among other factors. Occupational therapists with 1 to 4 years of experience generally earn between $24.54 and $43.53 per hour, and those with 5 to 9 years of work experience are typically paid between $28.44 and $49.60 per hour."}]