[{"url": "http://ods.od.nih.gov/factsheets/Iron-HealthProfessional", "passage_text": "Iron is a mineral that is naturally present in many foods, added to some food products, and available as a dietary supplement. Iron is an essential component of hemoglobin, an erythrocyte protein that transfers oxygen from the lungs to the tissues [ 1 ]. As a component of myoglobin, a protein that provides oxygen to muscles, iron supports metabolism [ 2 ]. Food. The richest sources of heme iron in the diet include lean meat and seafood [ 11 ]. Dietary sources of nonheme iron include nuts, beans, vegetables, and fortified grain products. In the United States, about half of dietary iron comes from bread, cereal, and other grain products [ 2, 3, 5 ]."}, {"url": "http://livewell.jillianmichaels.com/iron-vitamins-good-for-5244.html", "passage_text": "Meeting Recommended Intake. Good food sources of iron include chicken, pork, ham, fish, beans, beef and liver. Iron supplements may help people whose diets lack a variety of iron-rich foods and for those who require more iron due to age and gender. Women between the ages of 19 and 50 need 18 milligrams daily, which increases to 27 milligrams during pregnancy. Women over 50 need a mere 8 mg daily of iron. Iron Function. Iron is necessary for forming the myoglobin in your muscle cells and the hemoglobin in your red blood cells. You need this hemoglobin for carrying oxygen to where it is needed in your body and removing carbon dioxide that isn't needed. Iron also plays a roll in the formation of cells and the regulation of cell growth"}, {"url": "https://en.wikipedia.org/wiki/Iron_supplement", "passage_text": "Iron supplements are used to treat iron deficiency and iron-deficiency anemia; parenteral irons can also be used to treat functional iron deficiency, where requirements for iron are greater than the body's ability to supply iron such as in inflammatory states. Iron supplements are dietary supplements containing iron that can be prescribed by a doctor for a medical reason, or purchased from a vitamin shop, drug store etc. They are primarily used to treat anemia or other iron deficiencies. There are three ways that it can be delivered: orally, intravenously or intramuscularly."}, {"url": "http://www.nhs.uk/Conditions/vitamins-minerals/Pages/Iron.aspx", "passage_text": "Iron. Iron is an essential mineral, with several important roles in the body. For example, it helps to make red blood cells, which carry oxygen around the body. A lack of iron can lead to iron deficiency anaemia. Good sources of iron include: 1  liver. 2  meat. 3  beans. 4  nuts. 5  dried fruit – such as dried apricots. "}, {"url": "http://www.berkeleywellness.com/supplements/minerals/article/good-and-bad-iron", "passage_text": "Many people worry about getting too little iron—for good reason. Iron, after all, is essential to life. Most iron in our bodies is incorporated in hemoglobin, which carries oxygen in the blood, and in myoglobin in muscle, but every living cell has and needs iron to function. Iron is also stored in the liver, spleen and bone marrow."}, {"url": "https://answers.yahoo.com/question/index?qid=20080203143212AAwdHvo", "passage_text": "Rating Newest Oldest. Best Answer: The best iron supplement on the market is Nutrilite's Tri-Iron Folic. This provides a blend of iron, folic acid and vitamin C; a perfect combination for what you're describing. If you're not familiar with Nutrilite, they are the #1 manufacturer of supplements in the world. "}, {"url": "http://www.naturemade.com/minerals/iron", "passage_text": "Dried beans, dried fruits, black-strap molasses, dark green leafy vegetables, prune juice, iron fortified cereals, and lima beans are also good sources of non heme iron. Combine non heme sources of iron with vitamin C for best absorption. Iron is a mineral and an essential part of hemoglobin, the protein substance which enables red blood cells to carry oxygen through the body. Iron is better absorbed when consumed with a vitamin C source."}]