[{"url": "http://home.trainingpeaks.com/blog/article/using-beet-juice-to-improve-performance", "passage_text": "While the first study used 500 mL, or about 2 cups, that is a lot of beet juice to drink. Anecdotes of digestive distress after drinking that quantity suggest there is an advantage in finding the lowest dose that works for you. "}, {"url": "http://articles.mercola.com/sites/articles/archive/2014/01/25/beets-health-benefits.aspx", "passage_text": "1. Lower Your Blood Pressure. Drinking beet juice may help to lower blood pressure in a matter of hours. One study found that drinking one glass of beet juice lowered systolic blood pressure by an average of 4-5 points. The benefit likely comes from the naturally occurring nitrates in beets, which are converted into nitric oxide in your body. "}, {"url": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/the-nutrition-of-beet-juice.html", "passage_text": "Health Benefits. Beet juice is a powerful cleanser of the blood. It contains nutrients that work to protect against heart disease, and certain types of cancer, particularly colon cancer. The pigment that is responsible for the purple-red color of beets is a cancer-fighting agent called betacyanin. Beet juice has long been used as a diuretic and some people use it in their weight loss regimen. It is sweet and may be used as a replacement for sugar. You can bake with it. It can also be found in many products, such as chocolate, as a sugar replacement. Both the beet and its leaves are powerful blood cleansers."}, {"url": "http://www.bbcgoodfood.com/howto/guide/ingredient-focus-beetroot", "passage_text": "Whether you roast it whole, blend into a classic soup or drink as juice like the Olympians do-beetroot is low in fat, full of vitamins and minerals and packed with powerful antioxidants-a health-food titan. Safety. For some people, eating beetroot may induce beeturia; a red or pink colour in the urine or stool. It is totally harmless! Beet greens and, to a lesser extent, the roots contain high levels of oxolate."}, {"url": "http://www.doctoroz.com/article/benefits-beet-juice", "passage_text": "Benefits of Beetroot Juice. Known for decades as a liver-protective food, beets may not be the newest kid on the superfood block, but mounting research is showing why you should take another good look at this root vegetable in juiced form. Many doctors have been quite surprised by how little was needed to see a benefit for people with high blood pressure. You can juice the beets on your own, which is freshest and cost efficient, or you can spend about $7 for a prepared bottle at the health food store."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/the-nutrition-of-beet-juice.html", "passage_text": "Beet juice is a naturally sweet juice with numerous health benefits. It is a highly potent juice and is rarely consumed by itself. Many people add other vegetables and fruits to it such as beet leaves, apples, carrots, and/or celery. Types of Beets. Beet juice has long been used as a diuretic and some people use it in their weight loss regimen. It is sweet and may be used as a replacement for sugar. You can bake with it. It can also be found in many products, such as chocolate, as a sugar replacement. Both the beet and its leaves are powerful blood cleansers."}, {"url": "http://www.doctoroz.com/article/benefits-beet-juice", "passage_text": "The dark carotenes of beet juice may give your urine and bowel movements a red color. This color change is harmless. Since beets are high in oxalates, people who tend to make oxalate kidney stones may want to avoid beet juice. Many doctors have been quite surprised by how little was needed to see a benefit for people with high blood pressure. You can juice the beets on your own, which is freshest and cost efficient, or you can spend about $7 for a prepared bottle at the health food store."}, {"url": "http://www.webmd.com/hypertension-high-blood-pressure/news/20121212/beetroot-juice-blood-pressure", "passage_text": "Beetroot Benefits. Previous studies have shown that beet juice, also known as beetroot juice, can lower blood pressure in a laboratory setting. But researchers say this is the first study to look at the effects of adding beet juice to a heathy person’s diet without making any other diet or lifestyle changes. The study shows that within hours of drinking it, beet juice lowered systolic blood pressure (the top number in a blood pressure reading) by an average of 4-5 points among a small group of healthy men."}, {"url": "http://vegetarian.lovetoknow.com/Beet_Juice_Side_Effects", "passage_text": "If you're drinking a lot of beet juice, your urine or stools may take on a peculiar pink or red color. This is called beeturia. It's a side effect of drinking lots of beet juice. Rest assured that it is harmless. However, it can scare you, especially if you don't know that it's caused by the betalain pigment secretions. Just be sure to check with your doctor before adding it as a regular part of your diet. Drinking beet juice is a common recommendation for people with cancer, people seeking a cleansing and alkaline diet, and for those who enjoy a raw, vegan diet."}, {"url": "http://www.webmd.boots.com/healthy-eating/guide/beetroot-benefits", "passage_text": "Beetroot for the brain and dementia. Drinking beetroot juice increases blood flow to the brain in older people, which may be able to fight the progression of dementia, a 2010 study suggested. Beetroot contains high concentrations of nitrates, which are converted into nitrites by bacteria in the mouth"}]