[{"url": "http://www.tbs-sct.gc.ca/pol/doc-eng.aspx?id=12316", "passage_text": "The purpose of this policy is to ensure that communications across the Government of Canada are well co-ordinated, effectively managed and responsive to the diverse information needs of the public. Institutions must provide their managers and employees at all levels with orientation in the Communications Policy of the Government of Canada. Incoming employees must be informed about the policy, and encouraged to familiarize themselves with it, upon appointment."}, {"url": "https://en.wikipedia.org/wiki/Government_Communications_Headquarters", "passage_text": "The Doughnut , the headquarters of the GCHQ. The Government Communications Headquarters (GCHQ) is a British intelligence and security organisation responsible for providing signals intelligence (SIGINT) and information assurance to the British government and armed forces. Based in . Currently there are two main components of the GCHQ, the Composite Signals Organisation (CSO), which is responsible for gathering information, and the CESG, which is responsible for securing the UK's own communications."}, {"url": "http://siteresources.worldbank.org/EXTGOVACC/Resources/GWCommGAProundtablerapporteursreport.pdf", "passage_text": " Need for 2-way communication between the government and citizens Two-way communication between the government and the public produces governance outcomes that are of higher quality and more sustainable (many governments do not have sufficient capacity for effective one-way communication). Therefore, government communication is more than just developing effective spokespeople, it also involves the provision of customer oriented services, and building capacity for citizens to provide government with feedback as regards these services."}, {"url": "http://transition.fcc.gov/omd/history/", "passage_text": "The FCC remains committed today to further fostering innovation in communications. Most people know that if they watch television the Federal Communications Commission (FCC) is part of their life due to its role in regulating interstate and international communications by radio, television, wire, satellite, and cable. "}, {"url": "https://www.dhs.gov/communications-sector", "passage_text": "Communications Sector. The Communications Sector is an integral component of the U.S. economy, underlying the operations of all businesses, public safety organizations, and government. "}, {"url": "http://siteresources.worldbank.org/EXTGOVACC/Resources/GWCommGAProundtablerapporteursreport.pdf", "passage_text": "Effective public communication efforts enable citizen participation. Therefore, government communication is more than just developing effective spokespeople, it also involves the provision of customer oriented services, and building capacity for citizens to provide government with feedback as regards these services."}, {"url": "http://www.thusong.gov.za/documents/artic_pres/dev_comm.htm", "passage_text": "By this we mean that government communication is driven by the needs of people, that it facilitates citizen participation in the creation and use of information, and that it opens the activities of government to public scrutiny thus promoting democracy and efficiency. One of the most significant and exciting developments in reconstituting government communication systems in South Africa, has been the commitment to a democratic, participatory and responsive public information programme where people are the most important ingredient."}, {"url": "https://www.gov.uk/government/organisations/civil-service-government-communication-service", "passage_text": "We support all professional communicators across government to gain the skills and knowledge they need to carry out their roles. "}, {"url": "http://www.tbs-sct.gc.ca/pol/doc-eng.aspx?id=12316", "passage_text": "1 The government's obligation to reach out and communicate with citizens is concomitant with the right of citizens to address and be heard by their government. 2  In a democracy, listening to the public, researching, evaluating and addressing the needs of citizens is critical to the work of government. Institutions must provide their managers and employees at all levels with orientation in the Communications Policy of the Government of Canada. Incoming employees must be informed about the policy, and encouraged to familiarize themselves with it, upon appointment."}, {"url": "http://www.gcis.gov.za/content/about-us", "passage_text": "The Government Communication and Information System (GCIS): 1  provides professional services. 2  sets and influences adherence to standards for an effective government communication system. 3  drives coherent government messaging. The Government Communication and Information System (GCIS) was officially launched in May 1998. It was established in terms of Section 7 (subsection 2 and 3) of the Public Service Act, 1994 [PDF] 211 kb as amended. Read more about: 1  Structure of the GCIS."}]