[{"url": "https://en.wikipedia.org/wiki/Miso_soup", "passage_text": "Miso soup (味噌汁, misoshiru) is a traditional Japanese soup consisting of a stock called  dashi  into which softened miso paste is mixed. Many ingredients are added depending on regional and seasonal recipes, and personal preference. "}, {"url": "http://www.wisegeek.org/what-is-miso-soup.htm", "passage_text": "For the Japanese, miso soup is a culinary staple. Miso is a paste made from a mixture of soybeans, a starch such as rice or barley, salt, a touch of water, and yeast. This mixture is placed into wooden barrels and aged for as long as three years. As early as the seventh century, Buddhist monks began creating this unique product, mixing it with stock to make a soup. Miso soup is typically a mixture of miso paste, carrots, onions, seaweed, and water or broth. One pint of water, one cubed carrot, one diced onion, and one sheet of seaweed are simmered for fifteen minutes. Next, the cook should remove the soup from the heat and stir in 2 tablespoons (34.38 g) of miso paste."}, {"url": "http://soya.be/what-is-miso.php", "passage_text": "Miso is a rich, salty condiment that characterizes the essence of Japanese cooking. Traditionally, the Japanese begin their day with a bowl of homemade miso soup. They also use miso to flavour a variety of foods in other meals throughout the day. "}, {"url": "http://www.thekitchn.com/whats-the-difference-white-yel-79637", "passage_text": "Yellow Miso: Yellow miso is usually made from soybeans that have been fermented with barley and sometimes a small percentage of rice. It can be yellow to light brown in color. This miso has a mild, earthy flavor and is better for general use in not only condiments, but soup, marinades, and glazes. Red Miso: This is also typically made from soybeans fermented with barley or other grains, though with a higher percentage of soybeans and/or a longer fermentation period. It can range in color from red to dark brown."}, {"url": "http://vegetarian.about.com/od/glossary/g/misoglossary.htm", "passage_text": "Take a little bite if you're curious, but miso is not meant to be eaten plain out of the container like hummus! While the most common use of miso is in Japanese-style miso soup recipes and other Japanese cuisine, miso also adds a unique burst of flavor to sauces and marinades, baked tofu, or vegetable dishes. I like to use miso to make Asian-style salad dressings, such as this miso and orange dressing recipe. Wondering what to do with miso, other than miso soup? I have a few friends who like to spread miso on their toast in the mornings. Personally, I think it's a bit salty for that and I much prefer a bit of vegan margarine and a shake of nutritional yeast on my toast but give it a try and see if you like it."}, {"url": "http://foodreference.about.com/od/Ethnic_Ingredients/a/What-Is-Miso.htm", "passage_text": "Miso soup is a simple broth prepared with miso, dashi (fish stock), and sometimes other ingredients such as tofu or seaweed. Miso soup is a mainstay in the diets of most Japanese. Miso is also used to flavor the broths of many other types of soup. Because of its paste-like texture, it dissolves easily into hot broths. Miso is often mixed into glazes, marinades and braising liquids for meat and vegetables to add saltiness and umami flavor. Although most miso is made from soybeans, miso can also be made from rice, barley, buckwheat, rye, millet, wheat, or other lesser-known grains. Each will impart a unique flavor, appearance, and nutritional content."}, {"url": "https://en.wikipedia.org/wiki/Miso", "passage_text": "High in protein and rich in vitamins and minerals, miso played an important nutritional role in feudal Japan. Miso is still widely used in Japan, both in traditional and modern cooking, and has been gaining worldwide interest. Miso is typically salty, but its flavor and aroma depend on various factors in the ingredients and fermentation process. Different varieties of miso have been described as salty, sweet, earthy, fruity, and savory. The traditional Chinese analogue of miso is known as doujiang (dòujiàng). 豆酱 "}, {"url": "http://foodbabe.com/2014/04/27/what-the-heck-is-miso-miso-soup-recipe/", "passage_text": "Miso paste is created from a mixture of soybeans, sea salt and rice koji and then fermented. The fermentation process creates enzyme-rich compounds that are effective in detoxifying and eliminating industrial pollution, radioactivity and artificial chemicals from the soil and food system from your body. "}, {"url": "http://foodreference.about.com/od/Ethnic_Ingredients/a/What-Is-Miso.htm", "passage_text": "Miso is a paste made from fermented soybeans or other grains like rice or barley. This salty, flavorful paste is used extensively in Asian cooking as a seasoning for sauces, soups, meat, and vegetables. Miso has been praised for centuries not only for its flavor but also its high nutritional value. Although most miso is made from soybeans, miso can also be made from rice, barley, buckwheat, rye, millet, wheat, or other lesser-known grains. Each will impart a unique flavor, appearance, and nutritional content."}]