[{"url": "http://www.celebritynetworth.com/richest-celebrities/singers/jung-ji-hoon-aka-rain-net-worth/", "passage_text": "Jung Ji Hoon net worth: $20 Million. Jung Ji Hoon net worth: Jung Ji Hoon is a South-Korean singer-songwriter who has a net worth of $20 million dollars. Born in Seoul, South Korea, Jung Ji Hoon, also known as Rain, was an introverted child who discovered that he could express himself through dance and performance."}, {"url": "http://www.cownetworth.com/lee-hyori-plastic-surgery-before-and-after/", "passage_text": "Breast Implant. Furthermore, it is alleged that Lee Hyori’s hot looks which have become hotter, are due to breasts implant job she got done. They have become fuller and have grown in volume, though the job has been done well by her surgeon, for they look very much natural. No comments. The popular South Korean glamour girl who won many hearts in her country with her debut album that went ahead to collect many awards, Lee Hyori, is just one among the countless South Koreans who have gone under the knife."}, {"url": "http://www.therichest.com/celebnetworth/celeb/singer/lee-hyori-net-worth/", "passage_text": "About Lee Hyori. Lee Hyori was born on 10th May 1979. She is a South Korean singer with an estimated net worth of over $18 Million. Lee has accumulated this wealth over the years by being a hip hop and a pop singer for various bands. She was born in the South Korean town of Cheongwon and started her career in music from an early age."}, {"url": "http://www.worldsrichpeople.com/korean-stars-net-worth.html", "passage_text": "SNSD Net Worth $7 Million. Rising to fame with their hit single Gee in 2009, South Korean girl group Girls’ Generation has become one of South Korea’s most popular K Pop groups. "}, {"url": "http://www.richestlifestyle.com/richest-french-celebrities/", "passage_text": "Top 20 Richest French Celebrities 2015. France has significant cultural influence in Europe and America. This days is easy to see French celebrities in Hollywood. The nation has produced many millionaire celebrities. According to Celebrity Net Worth’s estimates, here’s the top 20 richest French celebrities as of 2015. "}, {"url": "http://www.celebritynetworth.com/richest-celebrities/actors/lee-hyori-net-worth/", "passage_text": "Lee Hyori net worth: $18 Million. Lee Hyori net worth: Lee Hyori is a South Korean singer who has a net worth of $18 million dollars. Lee Hyori was born in Cheongwon, North Chungcheong Province, South Korea in May 1979. She started off in the South Korean pop girl group Fin.K.L. and was the leader of the group. Fin.K.L. is short for Fin Killing Liberty"}, {"url": "http://www.allkpop.com/article/2013/06/how-much-money-did-lee-soo-man-and-yang-hyun-suk-lose-from-recent-korean-stock-market-downturn", "passage_text": "tracyx3. I find it kind of funny that while SM is growing and YG is barreling ahead with Psy and their other artists, JYP is at a standstill. I haven't paid much attention to kpop in the past two years but it seems like nothing exciting is happening at JYP that isn't K-pop star. "}, {"url": "http://www.kpopstarz.com/articles/28483/20130522/suzy-cries-rest-10-million-endorsement-deals-lee-seung-gi.htm", "passage_text": "By Staff Writer | May 22, 2013 01:32 AM EDT. At the press conference for  Gu Family Book  on May 20, the cast of the now-airing drama were present to answer questions from reporters, now that the drama has aired half of its episodes. "}]