[{"url": "http://www.softschools.com/facts/periodic_table/silicon_facts/189/", "passage_text": "Silicon Facts. Silicon (Si) is the second most abundant element by weight on Earth, second only to oxygen. It has fourteen protons in the nucleus, giving it an atomic number of fourteen. Interesting Silicon Facts: Jacob Berzelius is typically credited with discovering silicon in 1824"}, {"url": "http://www.chemicool.com/elements/silicon.html", "passage_text": "1 Silicon is the second most abundant element in our planet’s crust. 2  Oxygen (47.3%) and silicon (27.7%) together make up 75% of the weight of Earth’s crust. 3  Most of the crust’s silicon exists as silicon dioxide; we are familiar with this as sand or quartz. "}, {"url": "http://www.rsc.org/periodic-table/element/14/silicon", "passage_text": "Silicon makes up 27.7% of the Earth’s crust by mass and is the second most abundant element (oxygen is the first). It does not occur uncombined in nature but occurs chiefly as the oxide (silica) and as silicates. What makes silicon, and other semiconductors, special is that it is possible to promote one of the electrons to an empty board-the conduction band-where they can move freely. It's a bit like the 3-dimensional chess played by the point-eared Dr Spock in Star Trek. Temperature is crucial."}, {"url": "http://www.rsc.org/periodic-table/element/14/silicon", "passage_text": "Silicon is also used to make silicones. These are silicon-oxygen polymers with methyl groups attached. Silicone oil is a lubricant and is added to some cosmetics and hair conditioners. Silicone rubber is used as a waterproof sealant in bathrooms and around windows, pipes and roofs. What makes silicon, and other semiconductors, special is that it is possible to promote one of the electrons to an empty board-the conduction band-where they can move freely. It's a bit like the 3-dimensional chess played by the point-eared Dr Spock in Star Trek. Temperature is crucial."}, {"url": "http://www.livescience.com/28893-silicon.html", "passage_text": "Silicon is the element to thank for the computer you're using to read these words. A crucial component in microelectronics and computer chips, this extremely common element is also responsible for warm, white beaches — silica, an oxide of silicon, is the most common component of sand. View full size image. Silicon is neither metal nor non-metal; it's a metalloid, an element that falls somewhere between the two. The category of metalloid is something of a gray area, with no firm definition of what fits the bill, but metalloids generally have properties of both metals and non-metals."}, {"url": "http://www.chemistryexplained.com/elements/P-T/Silicon.html", "passage_text": "The periodic table is a chart that shows how chemical elements are related to one another. Silicon is also part of the the carbon family. Other carbon family elements include carbon, germanium, tin, and lead. Silicon is a metalloid, one of only a very few elements that have characteristics of both metals and non-metals. Silicon is the second most abundant element in the Earth's crust, exceeded only by oxygen. Many rocks and minerals contain silicon. Silicon never occurs as a free element in nature. It always occurs as a compound with oxygen, magnesium, calcium, phosphorus, or other elements. The most common minerals are those that contain silicon dioxide in one form or another."}, {"url": "http://chemistry.about.com/od/elementfacts/a/silicon.htm", "passage_text": "Silica is used to make glass, which has many useful mechanical, electrical, optical, and thermal properties. Sources: Silicon makes up 25.7% of the earth's crust, by weight, making it the second most abundant element (exceeded by oxygen). Silicon is found in the sun and stars. Uses: Silicon is one of the most widely used elements. Silicon is important to plant and animal life. Diatoms extract silica from water to build their cell walls. Silica is found in plant ashes and in the human skeleton."}, {"url": "http://www.livescience.com/28893-silicon.html", "passage_text": "Silicon is the seventh-most abundant element in the universe and the second-most abundant element on the planet, after oxygen, according to the Royal Society of Chemistry. About 25 percent of the Earth's crust is silicon; weirder spots where this element appears include menstrual cups, breast implants and oven mitts. View full size image. Silicon is neither metal nor non-metal; it's a metalloid, an element that falls somewhere between the two. The category of metalloid is something of a gray area, with no firm definition of what fits the bill, but metalloids generally have properties of both metals and non-metals."}, {"url": "https://en.wikipedia.org/wiki/Silicone_rubber", "passage_text": "Silicone rubber is an elastomer (rubber-like material) composed of silicone —itself a polymer —containing silicon together with carbon, hydrogen, and oxygen. Silicone rubbers are widely used in industry, and there are multiple formulations. "}]