[{"url": "https://en.wikipedia.org/wiki/N1_%28rocket%29", "passage_text": "The N1 was a very large rocket, standing 105 meters (344 ft) tall with its L3 payload. The N1-L3 consisted of five stages in total: the first three (N1) for insertion into a low Earth parking orbit, and another two (L3) for translunar injection and lunar orbit insertion. The N1-L3 version was developed to compete with the United States Apollo-Saturn V to land a man on the Moon, using the same lunar orbit rendezvous method. The basic N1 launch vehicle had three stages, which was to carry the L3 lunar payload into low Earth orbit with two cosmonauts."}, {"url": "http://www.space.com/16758-apollo-11-first-moon-landing.html", "passage_text": "Apollo 11 astronaut Edwin Aldrin photographed this iconic photo, a view of his footprint in the lunar soil, as part of an experiment to study the nature of lunar dust and the effects of pressure on the surface during the historic first manned moon landing in July 1969. Credit: NASA View full size image. On July 20, Armstrong and Aldrin entered the lunar module, nicknamed the Eagle and separated from the Command Service Module — the Columbia — headed toward the lunar surface. Apollo 11 astronaut Buzz Aldrin poses with the American flag on the surface of the moon"}, {"url": "http://www.space.com/15519-neil-armstrong-man-moon.html", "passage_text": "Neil Armstrong sits in the lunar module after a historic moonwalk. Credit: NASA. View full size image. Neil A. Armstrong was a NASA astronaut and the first man on the moon or, more accurately, the first man to set foot on the moon. 1 Armstrong was the pilot of the Gemini 8 mission, launched March 16, 1966. 2  He performed the first successful docking of two vehicles in space (Gemini 8 docked with a previously launched Agena rocket). 3  After his time as an astronaut, Armstrong was Deputy Associate Administrator for Aeronautics at NASA Headquarters."}, {"url": "http://news.bbc.co.uk/cbbcnews/hi/newsid_8150000/newsid_8150200/8150248.stm", "passage_text": "The Moon is on average, about 240,000 miles from Earth, so it's a tricky journey. The first men on the Moon were part of the Apollo 11 mission. They blasted off aboard a Saturn V rocket, which propelled them out of Earth's gravity. Rocket sections. The section of the spacecraft carrying the astronauts separated from the rocket, and took them to the Moon. "}, {"url": "http://www.answers.com/Q/Which_rocket_was_used_to_launch_a_man_to_the_moon", "passage_text": "Apollo 11, the first mission to land on the moon in 1969 used the Saturn V rocket. "}, {"url": "https://en.wikipedia.org/wiki/Apollo_11", "passage_text": "Apollo 11 was the spaceflight that landed the first humans on the Moon, Americans Neil Armstrong and Buzz Aldrin, on July 20, 1969, at 20:18 UTC. Armstrong became the first to step onto the lunar surface six hours later on July 21 at 02:56 UTC. Neil Armstrong's certification: I certify that this World Scout Badge was carried to the surface of the Moon on man's first lunar landing, Apollo XI, July 20, 1969.. First Man on the Moon Commemorative Issue of 1969."}, {"url": "http://www.history.nasa.gov/ap11ann/FirstLunarLanding/ch-1.html", "passage_text": "Neil Armstrong, commander of Apollo 11, began the first-hand report to the world of the epic voyage of Eagle and Columbia to the Moon and back to Earth. The voyage began at 9:32 a.m. EDT, July 16, when a Saturn V rocket launched Apollo 11 into Earth orbit from Cape Kennedy. Aldrin soon joined Armstrong. Before a live television camera which they set up on the surface, they performed their assigned tasks. Man's first dramatic venture on the lunar surface ended at 1:54 p.m., July 21 when Armstrong and Aldrin lifted off from the Moon on a tower of flame."}, {"url": "http://www.answers.com/Q/What_was_the_first_rocket_to_land_on_the_moon", "passage_text": "Apollo 11 was the spaceflight which landed the first humans, Neil Armstrong and Edwin Buzz Aldrin, Jr, on Earth's Moon on July 20, 1969, at 20:17:39UTC. The United States mi … ssion is considered a major accomplishment in the history of space exploration. It was the first rocket (though not the first attempt) to impact the moon. The Soviets had launched in January 1959 but that probe missed the moon and is in solar orbit as was a US probe, Pioneer IV."}, {"url": "http://www.space.com/16758-apollo-11-first-moon-landing.html", "passage_text": "The historic launch of the Apollo 11 mission carried three astronauts toward the moon. Two of them would set foot on the lunar surface for the first time in human history as millions of people around the world followed their steps on television. On July 20, Armstrong and Aldrin entered the lunar module, nicknamed the Eagle and separated from the Command Service Module — the Columbia — headed toward the lunar surface. Apollo 11 astronaut Buzz Aldrin poses with the American flag on the surface of the moon in July 1969."}, {"url": "http://www.space.com/16758-apollo-11-first-moon-landing.html", "passage_text": "Apollo 11 launched from Kennedy Space Center in Florida at 9:32 a.m. EDT on July 16, 1969. While in flight, the crew made two televised broadcasts from the interior of the ship, and a third transmission as they drew closer to the moon, revealing the lunar surface and the intended approach path. On July 20, Armstrong and Aldrin entered the lunar module, nicknamed the Eagle and separated from the Command Service Module — the Columbia — headed toward the lunar surface. Apollo 11 astronaut Buzz Aldrin poses with the American flag on the surface of the moon in July 1969."}]