[{"url": "http://www.innerbody.com/image_nervov/nerv23-new.html", "passage_text": "The sciatic nerve forms from the merger of the fourth and fifth lumbar nerves with the first, second, and third sacral nerves.... Click to read more below. The sciatic nerve is the largest and longest spinal nerve in the human body. Extending from the lumbar and sacral plexuses in the lower back, the sciatic nerve runs through the buttocks and into the thighs. It delivers nerve signals to and from the muscles and skin of the thighs, lower legs and feet. "}, {"url": "http://www.spine-health.com/conditions/spine-anatomy/sciatic-nerve-anatomy", "passage_text": "It connects the spinal cord with the outside of the thigh, the hamstring muscles in the back of the thighs, and muscles in the lower leg and feet. As such, when the sciatic nerve is impaired, it can lead to muscle weakness and/or numbness or tingling in the leg, ankle, foot, and/or toes. In the lower thigh/above the back of the knee, the sciatic nerve divides into two nerves, the tibial and peroneal nerves, which innervate different parts of the lower leg: 1  Peroneal nerves. 2  Tibial nerves."}, {"url": "http://www.backpainrelief.net/sciatica/", "passage_text": "1 This occurs mostly around the lower spine where the sciatic nerve starts, creating pain along the hips and back of legs. 2  Spinal stenosis: As people age, the spinal vertebrae begin to wear out and thin down, causing it to shrink and thus constrict the space around the spinal nerves. "}, {"url": "http://www.spine-health.com/conditions/sciatica/what-you-need-know-about-sciatica", "passage_text": "Sciatica symptoms occur when the large sciatic nerve is irritated or compressed in the lumbar spine. The sciatic nerve is the largest single nerve in the body and is composed of individual nerve roots that start by branching out from the spine in the lower back and combine to form the sciatic nerve.. 1  The sciatic nerve starts in the lower back at lumbar segment 3 (L3). The specific sciatica symptoms-the leg pain, numbness, tingling, weakness, and possibly symptoms that radiate into the foot-largely depend on where the nerve is pinched. For example, a lumbar segment 5 (L5) nerve impingement can cause weakness in extension of the big toe and potentially in the ankle."}, {"url": "http://www.spine-health.com/conditions/spine-anatomy/sciatic-nerve-anatomy", "passage_text": "In the lower thigh/above the back of the knee, the sciatic nerve divides into two nerves, the tibial and peroneal nerves, which innervate different parts of the lower leg: 1  Peroneal nerves. 2  The peroneal nerves travel laterally (sideways) along the outer part of the knee and down into the upper foot. In the lower thigh/above the back of the knee, the sciatic nerve divides into two nerves, the tibial and peroneal nerves, which innervate different parts of the lower leg: 1  Peroneal nerves. 2  Tibial nerves."}, {"url": "http://www.spine-health.com/conditions/spine-anatomy/sciatic-nerve-anatomy", "passage_text": "The sciatic nerve is actually made up of five nerves. It is formed on the right and left hand side of the lower spine by the combination of the fourth and fifth lumbar nerves and the first three nerves in the sacral spine. 1  See also Spinal Anatomy and Back Pain. In the lower thigh/above the back of the knee, the sciatic nerve divides into two nerves, the tibial and peroneal nerves, which innervate different parts of the lower leg: 1  Peroneal nerves. 2  Tibial nerves."}, {"url": "https://en.wikipedia.org/wiki/Sciatic_nerve", "passage_text": "Pain caused by a compression or irritation of the sciatic nerve by a problem in the lower back is called sciatica. Common causes of sciatica include the following lower back and hip conditions: spinal disc herniation, degenerative disc disease, lumbar spinal stenosis, spondylolisthesis, and piriformis syndrome. The sciatic nerve (/saɪˈaetɪk/ ; saɪˈætɪk also called ischiadic, nerve ischiatic) nerve is a large nerve in humans and other. Animals it begins in the lower back and runs through the buttock and down the lower. limb"}, {"url": "http://www.webmd.com/back-pain/ss/slideshow-visual-guide-to-sciatica", "passage_text": "This is a large nerve that runs from the lower back down the back of each leg. When something injures or puts pressure on the sciatic nerve, it can cause pain in the lower back that spreads to the hip, buttocks, and leg. Up to 90% of people recover from sciatica without surgery."}, {"url": "https://en.wikipedia.org/wiki/Sciatic_nerve", "passage_text": "It is the longest and widest single nerve in the human body, going from the top of the leg to the foot on the posterior aspect. The sciatic nerve provides the connection to the nervous system for nearly the whole of the skin of the leg, the muscles of the back of the thigh, and those of the leg and foot. It is derived from spinal nerves L4 to S3. The sciatic nerve (/saɪˈaetɪk/ ; saɪˈætɪk also called ischiadic, nerve ischiatic) nerve is a large nerve in humans and other. Animals it begins in the lower back and runs through the buttock and down the lower. limb"}, {"url": "http://orthoinfo.aaos.org/topic.cfm?topic=a00351", "passage_text": "Sciatica. If you suddenly start feeling pain in your lower back or hip that radiates to the back of your thigh and into your leg, you may have a protruding (herniated) disk in your spinal column that is pressing on the nerve roots in the lumbar spine. This condition is known as sciatica. Symptoms. "}]