[{"url": "http://www.innovateus.net/science/what-are-disaccharides", "passage_text": "Image Credit: Main Image: Disaccharides, meaning “two sugars ”, are the carbohydrates formed when two monosaccharides are joined, basically when the 2 monosaccharide molecules undergo a condensation reaction which involves the elimination of a small molecule, such as water, from the functional groups only. Some of the common Disaccharides are as follows. 1  Sucrose (table sugar, cane sugar, beet sugar): It is a white, odorless crystalline powder with a sweet taste. 2  It is best known for its role in human nutrition. 3  Sucrose is made up of glucose (monosaccharide) and fructose (monosaccharide)."}, {"url": "http://www.ivyroses.com/HumanBiology/Nutrition/Types-of-Sugar.php", "passage_text": "The two main categories of sugars are monosaccharides and disaccharides. They are often described together with polysaccharides, and sometimes also oligosaccarides, due to the chemical relationship between these types of carbohydrates: 1  Categories of sugars 2  : Monosaccharides are simple (unit) sugars. "}, {"url": "http://academic.brooklyn.cuny.edu/biology/bio4fv/page/disaccharide.html", "passage_text": "1. disaccharides are macromolecules consisting of two monosaccharides connected by a glycosidic bond. 2. some common disaccharides are lactose (milk sugar), maltose and sucrose (common table sugar). disaccharide formed from two monosaccharides. "}, {"url": "http://chemistry.about.com/od/biochemistry/a/Name-3-Disaccharides.htm", "passage_text": "Disaccharides are sugars or carbohydrates made by linking two monosaccharides. This is a list of some disaccharides, including the monosaccharides they are made from and foods containing them. Sucrose, maltose, and lactose are the most familiar disaccharides, but there are others. 1  sucrose (saccharose). 2  glucose + fructose. 3  Sucrose is table sugar. 4  It is purified from sugar cane or sugar beets. 5  maltose. 6  glucose + glucose. 7  Maltose is a sugar found in some cereals and candies"}, {"url": "https://www.chem.wisc.edu/deptfiles/genchem/netorial/modules/biomolecules/modules/carbs/carb5.htm", "passage_text": "Monosaccharides such as glucose can be linked together in condensation reactions. For example, sucrose (table sugar) is formed from one molecule of glucose and one of fructose, as shown below. Molecules composed of two monosaccharides are called disaccharides. "}, {"url": "https://en.wikipedia.org/wiki/Disaccharide", "passage_text": "Like monosaccharides, disaccharides are soluble in water. Three common references are sucrose, lactose, and maltose. Disaccharide is one of the four chemical groupings of carbohydrates (monosaccharide, disaccharide, oligosaccharide, and polysaccharide). The most common types of disaccharides— sucrose, lactose, and maltose —have twelve carbon atoms, with the general formula C 12 H 22 O 11. Maltose, another notable disaccharide, is made up of two glucose molecules. The two monosaccharides are bonded via a dehydration reaction (also called a condensation reaction or dehydration synthesis) that leads to the loss of a molecule of water and formation of a glycosidic bond."}, {"url": "https://en.wikipedia.org/wiki/Disaccharide", "passage_text": "Disaccharides are formed when two monosaccharides are joined together and a molecule of water is removed, a process known as dehydration reaction. For example; milk sugar (lactose) is made from glucose and galactose whereas the sugar from sugar cane and sugar beets (sucrose) is made from glucose and fructose. Maltose, another notable disaccharide, is made up of two glucose molecules. The two monosaccharides are bonded via a dehydration reaction (also called a condensation reaction or dehydration synthesis) that leads to the loss of a molecule of water and formation of a glycosidic bond."}, {"url": "http://www.answers.com/Q/What_are_examples_of_disaccharides", "passage_text": "Disaccharides are compounds of two sugar groups, for example sucrose, which is a compound of fructose and glucose. Other examples of disaccharides include lactose and maltose. monosaccharides :   1. are single sugar unit.   2.like glucose, fructose,galactose.     disaccharides   1. are two monosaccharides, two monosaccharides f … orms disaccharides  after condensation (removing a molecule of water).   2. like sucrose, lactose, maltose."}]