[{"url": "http://pets.thenest.com/development-husky-dogs-5131.html", "passage_text": "Adulthood. Husky growth slows down between 6 months and a year, and your dog will likely be her adult height by her first birthday. Huskies continue to fill out until their second year, and some males take as long as 36 months to reach their full size. Between 8 and 20 weeks, huskies are primed to experience new sights, sounds and people. This critical period of socialization is the best opportunity to socialize your dog to other animals, people and unfamiliar settings. Your puppy may experience periods of increased fear at some points"}, {"url": "http://pshci.activeboard.com/t50346890/caretaking-siberian-husky-growth-stages/", "passage_text": "By the age of 12 weeks your husky should now exhibit all the traits of his or her personality and temperament. Below you will learn about all growth stages of your husky. New-born – 2 weeks of age. This is a very delicate time for your puppy as you probably guessed. At this time you will get a good idea of what your husky‘s personality is going to be like for the next ten to fifteen years! This is a great time to start looking into proper training, bonding, and playtime. After Twelve Weeks of Age. When your puppy is still a baby he will need lots of rest."}, {"url": "http://en.allexperts.com/q/Husky-Huskies-2538/growth-rate-Husky.htm", "passage_text": "Answer. Siberians are generally considered to have filled out and be an adult dog around 24 months, although there is some muscle development that can happen up to about 3 years. Genreally, however, you will see little height growth after 18-24 months. Siberian Huskies were bred to be strong, small, quick and agile dogs, and, if bred well, most males will only be between about 40-60 pounds. Your 48 lbs. dog sounds exactly in this range. As in humans, there can be vast differences in even related dogs with respect to growth, height and weight. "}, {"url": "http://pets.thenest.com/development-husky-dogs-5131.html", "passage_text": "Development of Husky Dogs. Huskies continue growing through their first year of life. Dogs go through distinct developmental periods just like people do. The early weeks of a dog's life are a time of rapid development, and huskies continue to grow and develop much longer than many other dog breeds. Between 8 and 20 weeks, huskies are primed to experience new sights, sounds and people. This critical period of socialization is the best opportunity to socialize your dog to other animals, people and unfamiliar settings. Your puppy may experience periods of increased fear at some point"}, {"url": "http://pets.thenest.com/life-expectancy-husky-5133.html", "passage_text": "Life Stages. Siberian huskies typically achieve their adult size at about 12 months of age. They are considered adult dogs between 1 and 7 years old. Once your husky reaches the age of 7, he is considered to be a senior dog. Life Expectancy. The average lifespan of a Siberian husky is about 12 years, similar to other medium-to-large dogs. Many huskies live up to 15 years, and a few live even longer. Female dogs tend to live slightly longer than male dogs in all breeds, including huskies"}, {"url": "http://www.itsahuskything.com/t1929-husky-growth-rates", "passage_text": "Husky Growth Rates? Do huskies grow extremely slow? Shiloh is 6 months old and only about 31 or 32 pounds and still so short! At what ages do they have growth spurt"}]