[{"url": "http://www.tutorialspoint.com/computer_fundamentals/computer_generations.htm", "passage_text": "Next Page. Generation in computer terminology is a change in technology a computer is/was being used. Initially, the generation term was used to distinguish between varying hardware technologies. But nowadays, generation includes both hardware and software, which together make up an entire computer system."}, {"url": "https://answers.yahoo.com/question/index?qid=20080110000522AApK65W", "passage_text": "For instance, each release of Windows is a 'new generation'. This is always true though: a new generation in technology will be the newest technology on the market. As for how many generations of computer technology have passed until now.. that is just impossible to say really."}, {"url": "http://www.webopedia.com/DidYouKnow/Hardware_Software/FiveGenerations.asp", "passage_text": "Learn about each of the five generations of computers and major technology developments that have led to the current devices that we use today. The history of computer development is often in reference to the different generations of computing devices. Each of the five generations of computers is characterized by a major technological development that fundamentally changed the way computers operate. Most developments resulted in increasingly smaller, cheaper and more powerful and efficient"}, {"url": "http://ecomputernotes.com/fundamental/introduction-to-computer/what-are-different-computer-generations-explain-in-brief", "passage_text": "Each generation of computer is characterized by a major technological development that fundamentally changed the way computers operate, resulting in increasingly smaller, cheaper, more powerful and more efficient and reliable devices."}, {"url": "http://www.tutorialspoint.com/computer_fundamentals/computer_generations.htm", "passage_text": "Generation in computer terminology is a change in technology a computer is/was being used. Initially, the generation term was used to distinguish between varying hardware technologies. But nowadays, generation includes both hardware and software, which together make up an entire computer system."}, {"url": "https://answers.yahoo.com/question/index?qid=20080110000522AApK65W", "passage_text": "Best Answer: In computer technology 'generations' can have varied meanings. Sometimes the definition can be specific to an individual piece of technology (Next generation graphics card) or speaking to the whole system."}]