[{"url": "https://uk.answers.yahoo.com/question/index?qid=20080706043457AAd1tke", "passage_text": "Depends what brand toast-though white is refined, and contains more calories than whole wheat/grain. Whether the butter is low fat or whatever, and how much sugar is in the jam. Less than 200 calories in general though. Best Answer: A slice of bread is 80 calories A pat of butter is 36 calories A tablespoon of jam is 50 calories All in all about 166 calories. Source(s): GP for more years than I care to remember. Dr Frank · 7 years ago."}, {"url": "http://www.livestrong.com/article/324069-how-many-calories-in-a-peanut-butter-jam-sandwich/", "passage_text": "The type of bread you use affects the calories in your sandwich. Most store-bought, whole-wheat bread has about 70 calories per slice, meaning that it contributes 140 calories to the sandwich. A slice of homemade whole-wheat bread has about 120 calories per slice, contributing 240 calories to your sandwich. White bread contributes about 70 calories per slice, as well. Some hearty breads with seeds and nuts may be higher in calories than just plain wheat or white bread. The exact number of calories in your peanut butter and jam sandwich probably varies from day to day. Unless you're measuring the exact amount of peanut butter and jam before spreading them onto the bread, there is no way to know exactly how many calories you're eating."}, {"url": "http://www.answers.com/Q/How_many_calories_in_a_slice_of_bread_and_butter", "passage_text": "1 pat of butter has 102 calories, mainly from fats. A slice of  wheat bread has 69 calories and a slice of white bread has 79  calories. This is a total of 240 calories for … two slices of wheat  bread with butter and 260 calories for two slices of white bread  with butter. The average slice of bread is 100 calories, although it can vary based on the brand and type of bread used. Butter is 100 calories per tablespoon, but usually only about 1/2 of that is placed on one slice of bread. So it would be about 150 calories or so."}, {"url": "http://www.answers.com/Q/How_many_calories_does_wheat_toast_with_jelly_have", "passage_text": "Assuming you used proper serving sizes... Peanut Butter - 190 (Grape) Jelly - 60 Wheat - 100 (per slice) That is about 450 calories (peanut butter, jelly, and 2 slices of whe … at bread). These numbers are averages, though, because different calories can exist based on brand, ingredients, and serving sizes. It depends on the amount of beans, the amount of toast, and whether you butter the toast. In a tin of Heinz Beans there are 328 calories and 2 slices of white bread toasted i … s about 120 calories so Beans on toast is about 448 calories. Hope this helped :)."}, {"url": "http://www.answers.com/Q/How_many_calories_in_a_slice_of_bread_and_butter", "passage_text": "Calories in Bread The amount of calories in a slice of bread will vary depending on the type of bread and how big the loaf is. One slice of one brand of white bread has 60 cal … ories, but since two slices are usually considered a serving, a serving would be 120 calories. The average slice of bread is 100 calories, although it can vary based on the brand and type of bread used. Butter is 100 calories per tablespoon, but usually only about 1/2 of that is placed on one slice of bread. So it would be about 150 calories or so."}, {"url": "http://www.livestrong.com/article/324069-how-many-calories-in-a-peanut-butter-jam-sandwich/", "passage_text": "The calories also vary depending on the type of bread, peanut butter and jam you select for your sandwich. A sandwich made with 2 slices of whole-wheat bread, 2 tablespoons of peanut butter and 1 tablespoon of jam comes to about 385 calories. The exact number of calories in your peanut butter and jam sandwich probably varies from day to day. Unless you're measuring the exact amount of peanut butter and jam before spreading them onto the bread, there is no way to know exactly how many calories you're eating."}, {"url": "http://www.livestrong.com/article/298426-the-calories-in-toast-with-peanut-butter/", "passage_text": "Calories in Toast. As long as you don't choose a higher-calorie bread, such as potato bread, most types of bread have about the same calories. One slice of toasted whole-wheat bread has 76 calories, while a slice of toasted white bread contains 79 calories. Whole-grain bread is the healthier choice because it has three times more fiber. Peanut butter spread over a slice of toast makes a healthy start to your day or a light lunch. The calories are low enough to work into your daily goals without ruining your diet. Plus peanut butter and whole-grain toast are packed with protein, fiber and nutrients."}]