[{"url": "http://www.evolution.berkeley.edu/evosite/evo101/IIID3Bottlenecks.shtml", "passage_text": "A founder effect occurs when a new colony is started by a few members of the original population. This small population size means that the colony may have: 1  reduced genetic variation from the original population. 2  a non-random sample of the genes in the original population. Bottlenecks and Founder Effects. Genetic drift can cause big losses of genetic variation for small populations. Population bottlenecks occur when a populations size is reduced for at least one generation."}, {"url": "https://en.wikipedia.org/wiki/Genetic_drift", "passage_text": "Genetic drift (or allelic drift) is the change in the frequency of a gene variant (allele) in a population due to random sampling of organisms. The alleles in the offspring are a sample of those in the parents, and chance has a role in determining whether a given individual survives and reproduces. When there are few copies of an allele, the effect of genetic drift is larger, and when there are many copies the effect is smaller."}, {"url": "http://www.pbs.org/wgbh/evolution/library/06/3/l_063_03.html", "passage_text": "The founder effect is an extreme example of  genetic drift .. Genes occurring at a certain frequency in the larger population will occur at a different frequency -- more or less often -- in a smaller subset of that population. "}, {"url": "http://wallace.genetics.uga.edu/groups/evol3000/wiki/fb221/Bottlenecks_and_Founder_Effects.html", "passage_text": "Founder Effect. The Founder Effect is defined as a type of bottleneck, a type of genetic drift describing the loss of the allelic variation that accompanies founding of a new population from a very small number of individuals (a small sample of a much larger source population). This article is a good article explaining how the founder effects affect genetic drift. An example of a bottleneck effect: Northern elephant seals have reduced genetic variation most likely due to being hunted. Hunting reduced their population size to as few as 20 individuals at the end if the 19th century."}, {"url": "http://www.biotecharticles.com/Genetics-Article/Effects-of-Genetic-Drift-Bottleneck-and-Founder-effect-726.html", "passage_text": "The most common effects the genetic bottlenecks and founder effects are discussed in the article.... Genetic drift is the process of changes of allele frequencies over generations in a random fashion. Genetic bottlenecks and founder effects are the most common effects of genetic drift. The rate of loss of alleles in a genetic drift is ½ N where N is the number of individuals in the initial population. The effect of genetic drift is inversely proportional to the size of the population. In small populations, most of the individuals tend to be homozygous for deleterious genes. The situation is similar to the effects of inbreeding."}, {"url": "https://en.wikipedia.org/wiki/Population_bottleneck", "passage_text": "Population bottleneck followed by recovery or extinction. A population bottleneck (or genetic bottleneck) is a sharp reduction in the size of a population due to environmental events (such as earthquakes, floods, fires, disease, or droughts) or human activities (such as genocide). In consequence of such population size reductions and the loss of genetic variation, the robustness of the population is reduced and its ability to survive selecting environmental changes, like climate change or a shift in available resources, is reduced."}, {"url": "http://programs.clarendoncollege.edu/programs/NatSci/Biology/Zoology/zoo%20online%20outlines/Lab%20population%20genetics%202%20-%20fall%2011.pdf", "passage_text": "Genetic drift becomes a factor for evolution in populations that are formed from a small sample of a larger population by either the bottleneck effect or the founder effect. Genetic drift is a change in the relative frequency of an allele due to random fluctuation in an isolated population. "}, {"url": "http://bivalves.teacherfriendlyguide.org/index.php?option=com_content&view=article&id=32&Itemid=125", "passage_text": "One common example of the results of genetic drift is the Founder EffectFounder Effect:Genetic drift observed in a population that was founded by a small non-representative sample of a larger population; also called the “bottleneck effect.” (or “bottleneck effect”). "}, {"url": "http://www.evolution.berkeley.edu/evosite/evo101/IIID3Bottlenecks.shtml", "passage_text": "An example of a bottleneck: Northern elephant seals have reduced genetic variation probably because of a population bottleneck humans inflicted on them in the 1890s. Hunting reduced their population size to as few as 20 individuals at the end of the 19th century. Bottlenecks and Founder Effects. Genetic drift can cause big losses of genetic variation for small populations. Population bottlenecks occur when a populations size is reduced for at least one generation."}]