[{"url": "http://www.stylecraze.com/articles/hormones-responsible-for-weight-gain-in-women/", "passage_text": "5. The hormone insulin is produced by beta cells in the pancreas. Insulin is responsible for the regulation of fat and carbohydrates in the body. Insulin allows the body to use glucose. Insulin is also a causal agent for PCOS that leads to infertility. High insulin level in the blood contributes to weight gain. Weight gain and hormone problems go hand in hand for women. These were the hormones responsible for weight gain. Be aware of the changes taking place in your body and head to the doctor if you doubt that your hormones are all over the place."}, {"url": "http://www.webmd.com/diet/ss/slideshow-weight-gain-shockers", "passage_text": "Cushing's Syndrome. Weight gain is a common symptom of Cushing's syndrome, a condition in which you are exposed to too much of the stress hormone cortisol, which in turn causes weight gain and other abnormalities. You can get Cushing's syndrome if you take steroids for asthma, arthritis, or lupus. If your thyroid (the butterfly-shaped gland in the front of your neck) is not making enough thyroid hormone, you're probably feeling tired, weak, and cold, and gaining weight. Without enough thyroid hormone, your metabolism slows, making weight gain more likely."}, {"url": "http://www.bodylogicmd.com/for-women/hormones-and-weight-gain/", "passage_text": "Stress is also a contributing factor to menopause weight gain. High stress puts your body into panic mode, preventing weight loss. Basically, your body begins to store food since stress hormones, namely high levels of cortisol, are telling your body that you will not be eating again for a long time. Progesterone's role in weight gain is more deceiving; low levels of the hormone do not actually cause you to gain weight, but instead cause water retention or bloating. This annoying side effect makes you feel heavier and makes your clothes fit tighter."}, {"url": "http://www.bodylogicmd.com/for-women/hormones-and-weight-gain/", "passage_text": "Levels of this hormone decrease during menopause causing the loss of muscle mass and hence result in lower metabolism. This also results in weight gain. Other Causes: Insulin resistance and stress are also responsible for a woman's difficulty or inability to experience weight loss during menopause. Progesterone's role in weight gain is more deceiving; low levels of the hormone do not actually cause you to gain weight, but instead cause water retention or bloating. This annoying side effect makes you feel heavier and makes your clothes fit tighter."}, {"url": "http://www.myvitawellness.com/4-hormones-responsible-for-weight-gain-in-females", "passage_text": "The primary hormones responsible for weight gain in females are: thyroid hormone, estrogen, progesterone, cortisol, testosterone, and insulin. Here are the reasons why each hormone plays a role in weight gain and what you can do about it. Thyroid Hormones. If a female has too much or too little estrogen or if the proper ratio of estrogen to progesterone is disturbed, then it’s likely that weight gain particularly around the mid-section, hips and thighs will result."}, {"url": "http://achikhasi.com/hormones-responsible-for-weight-gain-in-women/", "passage_text": "Some of the hormones responsible for weight gain in women are: 1. Thyroid Hormone: Deficiency of thyroid is found, especially among women. Hypothyroidism is responsible for weight gain in women. The common symptoms include fatigue, cold intolerance, weight gain, dry skin and constipation. Weight gain is the result of decreased metabolic rate of the body."}, {"url": "http://www.body-wise-perfect-size.com/female-hormones.html", "passage_text": "Are female hormones making you fat... Female hormones are responsible for hormonal weight gain during puberty, pregnancy and menopause. They affect ALL women regardless of race, culture, creed, body shape or size. Androgen. This is the hormone that we can point fingers at for that weight gain that makes you look for apple-shaped, you know that middle-aged spread-it's androgen that is responsible for sending new weight gained to wrap around your mid-section."}, {"url": "http://achikhasi.com/hormones-responsible-for-weight-gain-in-women/", "passage_text": "The hormone insulin is produced by beta cells in the pancreas. Insulin is responsible for the regulation of fat and carbohydrates in the body. Insulin allows the body to use glucose. Insulin is also a causal agent for PCOS that leads to infertility. High insulin level in the blood contributes to weight gain. 6. Deficiency of thyroid is found, especially among women. Hypothyroidism is responsible for weight gain in women. The common symptoms include fatigue, cold intolerance, weight gain, dry skin and constipation. Weight gain is the result of decreased metabolic rate of the body."}, {"url": "http://www.stylecraze.com/articles/hormones-responsible-for-weight-gain-in-women/", "passage_text": "1. Thyroid Hormone: Deficiency of thyroid is found, especially among women. Hypothyroidism is responsible for weight gain in women. The common symptoms include fatigue, cold intolerance, weight gain, dry skin and constipation. Weight gain is the result of decreased metabolic rate of the body. Weight gain and hormone problems go hand in hand for women. These were the hormones responsible for weight gain. Be aware of the changes taking place in your body and head to the doctor if you doubt that your hormones are all over the place."}]