[{"url": "http://articles.economictimes.indiatimes.com/2014-12-31/news/57558519_1_cash-subsidy-lpg-consumers-dbtl", "passage_text": "NEW DELHI: LPG consumers across the country will from tomorrow get cash subsidy directly into their bank accounts so that they buy the cooking fuel at market price. Domestic LPG users will get Rs 568 in the bank account the moment they join the Direct Benefit Transfer Scheme for LPG, which has now been renamed PAHAL. "}, {"url": "http://indianexpress.com/article/business/business-others/lpg-subsidy-fixed-at-rs-568-price-to-change-after-march/", "passage_text": "Prime Minister Narendra Modi ’s office has fixed the subsidy on domestic LPG at Rs 568 per cylinder — to be borne equally by the government and national oil companies (NOCs) — setting the stage for deregulating the pricing of domestic cooking gas. The PMO fixed the subsidy for domestic LPG at Rs 40 per kg to be shared between government and public sector upstream oil firms. The actual subsidy thus paid for consumers used to change in order to keep the price fixed at the level approved by the CCPA. 1  Comments."}, {"url": "http://www.myaadhaarcard.in/direct-cash-transfer/direct-benefit-transfer-dbt-lpg-subsidy-scheme-a-consumer-guide/", "passage_text": "In this scheme a LPG consumer has to link his Aadhaar number with his bank account and LPG Consumer number. When consumer book for the refill of LPG cylinder, LPG subsidy is transferred into the Aadhaar linked bank account of the customer. Consumer then has to purchase the LPG cylinder at market price from the distributor. At present, a LPG consumer gets LPG subsidy on 9 cylinders per year. Successful implementation of this scheme throughout the country is expected to save Rs.9000 crore subsidy amount annually."}, {"url": "http://www.bemoneyaware.com/blog/what-is-lpg-subsidy/", "passage_text": "What is LPG Subsidy. There are 14 crore LPG consumers in the country which comprises 60% of the population. LPG cylinder in India is subsidized. From Jan 1 2013 Government limited the number of subsidised cylinders to 9. Each consumer will have to buy LPG at market price and government will transfer the subsidy to his Aadhar linked bank account. If you want LPG subsidy then Aadhar is compulsor"}, {"url": "http://www.mapsofindia.com/my-india/society/what-is-pahal-and-how-is-it-going-to-benefit-lpg-users", "passage_text": "The world’s largest cash subsidy under the Direct Benefit Transfer Scheme was re-launched by the Union Government in November 2014 in 54 districts and is extended all over the country with effect from January 1, 2015. The scheme was launched for the consumers of Liquid Petroleum Gas (LPG). However, the new scheme has made available the LPG subsidy to all consumers. Under the modified scheme, the consumers who use LPG can now receive subsidy in his bank account under two options."}, {"url": "http://www.petroleum.nic.in/dbt/index.php", "passage_text": "1 Consumers will need a bank account to join the scheme and receive LPG subsidy. 2  Consumers will also get one time permanent advance in their bank account prior to buying the first market priced LPG cylinder. 3  Consumers will receive subsidy in their bank account as per their entitlement of subsidized cylinders. "}, {"url": "http://zeenews.india.com/tags/lpg-subsidy.html", "passage_text": "Taxability of LPG subsidy unclear; experts seek clarification. Taxability of LPG subsidy and other direct benefits paid directly into bank accounts of beneficiaries is unclear with tax experts divided on the issue and want an explicit clarification from the government. Anil Ambani gives up LPG subsidy, urges 1L employees to follow."}, {"url": "http://www.ndtv.com/topic/lpg-subsidy", "passage_text": "'Lpg Subsidy' - 110 News Result(s). Government Says DBT Scheme Saves Rs 14,672 Cr on LPG Subsidy/Year. Press Trust of India | Monday October 12, 2015. A total of Rs 14,672 crore is saved in LPG subsidy in a year as a result of direct benefit transfer, the government said on Monday. Amitabh Bachchan Gives Up LPG Subsidy. The government has capped the subsidy payout on kerosene at Rs 12 per litre and domestic cooking gas (LPG) at Rs 18 per kg, Oil Minister Dharmendra Pradhan"}]