[{"url": "http://www.answers.com/Q/On_what_continent_is_Papua_New_Guinea", "passage_text": "Much debate has been made over whether Oceania and Australia are continents, but the difference lies in the definition of continent as a single land mass. The western half of the island of New Guinea, which belongs to Indonesia, is considered to be part of the continent of Asia. No. Papua New Guinea was once a territory of Australia. It is now a country in its own right, having achieved full independence on 16 September 1975. In geological terms, the … continent of Australia and the island of New Guinea are considered one continent as they both sit on the Indo-Australian tectonic plate."}, {"url": "http://www.answers.com/Q/On_what_continent_is_Papua_New_Guinea", "passage_text": "Papua New Guinea occupies the eastern half of the large island of New Guinea positioned north of Australia. For this reason, it is considered to be part of the political region known as Oceania. Oceania is not a geographical continent. No. Papua New Guinea was once a territory of Australia. It is now a country in its own right, having achieved full independence on 16 September 1975. In geological terms, the … continent of Australia and the island of New Guinea are considered one continent as they both sit on the Indo-Australian tectonic plate."}, {"url": "http://www.answers.com/Q/What_continent_is_new_guinea_on", "passage_text": "Much debate has been made over whether Oceania and Australia are continents, but the difference lies in the definition of continent as a single land mass. The western half of the island of New Guinea, which belongs to Indonesia, is considered to be part of the continent of Asia. 32 people found this useful. 1  Europe on a Budget: 21 Free Walking Tours in Europe Walking tours can be a great way to get to know a new city. "}, {"url": "http://www.gomapper.com/travel/where-is/papua-new-guinea-located.html", "passage_text": "Papua New Guinea is a country with a small population which is located in the continent/region of Oceania. Countries near Papua New Guinea include Federated States of Micronesia, Solomon Islands, Palau and Australia. "}, {"url": "http://www.answers.com/Q/On_what_continent_is_Papua_New_Guinea", "passage_text": "The western half of the island, together with numerous nearby islands, constitute the country of P … apua New Guinea. It lies within the geographical region known as Oceania (which is not a continent), and is directly north of Australia's eastern half. No. Papua New Guinea was once a territory of Australia. It is now a country in its own right, having achieved full independence on 16 September 1975. In geological terms, the … continent of Australia and the island of New Guinea are considered one continent as they both sit on the Indo-Australian tectonic plate."}, {"url": "http://www.7continents5oceans.com/australia", "passage_text": "Australia. Australia is a continent in the Southern Hemisphere, which comprises the countries of Australia, Tasmania, Seram, New Guinea, Timor, and other neighbouring islands. It is the smallest among the seven continents of the world, and lies on a continental shelf. "}, {"url": "http://www.answers.com/Q/On_what_continent_is_Papua_New_Guinea", "passage_text": "Some would say that Papua New Guinea is on the continent of Australia, but this is not the case. The continent of Australia is quite different to the political region of Oceania. No. Papua New Guinea was once a territory of Australia. It is now a country in its own right, having achieved full independence on 16 September 1975. In geological terms, the … continent of Australia and the island of New Guinea are considered one continent as they both sit on the Indo-Australian tectonic plate."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20071102071628AAlvBZ3", "passage_text": "Best Answer: None. Papua New Guinea is not located on a continent at all, but on a large island. The island itself can be considered culturally part of either Asia or Oceania, but it is not geographically part of any continent. It is usually considered, geographically, part of the continent of Asia. The nation of Papua New Guinea has many political and economic ties to Australia and the others nations of Oceania so could be considered part of Oceania as well."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20071102071628AAlvBZ3", "passage_text": "Report Abuse. it is not on any continent. The country of Papua New Guinea is on the island of New Guinea, and the island is located to the north of Australia. It is usually considered, geographically, part of the continent of Asia. The nation of Papua New Guinea has many political and economic ties to Australia and the others nations of Oceania so could be considered part of Oceania as well."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20080630002303AAbMj1e", "passage_text": "Best Answer: Australia is one continent. Many times people refer to the area of papua new guinea and australia as Oceania. Papua new guinea is part of the south pacific. papua new guinea is the biggest island in the south pacific and 2nd biggest island in the world. Papua new guinea should not be referred to as being part of australia. Papua new guinea became an independent nation over 30 years ago. Hope this helps"}]