[{"url": "http://biography.yourdictionary.com/israel-zangwill", "passage_text": "Israel Zangwill Facts. The Jewish author and philosopher Israel Zangwill (1864-1926) was an influential leader of English Jewry and a Zionist activist. Israel Zangwill was born in London. His family, Russian Jews, lived in London's east side in the Jewish quarter of White-chapel. Further Reading on Israel Zangwill. The most complete study of Zangwill in English is Maurice Wohlgelernter, Israel Zangwill: A Study (1964). Other biographies are Harry Schneiderman's short and laudatory Israel Zangwill (1928) and Joseph Leftwich's largely anecdotal Israel Zangwill (1957)."}, {"url": "https://en.wikipedia.org/wiki/Israel_Zangwill", "passage_text": "Zangwill married Edith Ayrton, a gentile feminist and author who was the daughter of cousins William Edward Ayrton and Matilda Chaplin Ayrton. In 1908, Zangwill told a London court that he had been naive when he made his 1901 speech and had since realized what is the density of the Arab population, namely twice that of the United States."}, {"url": "http://spartacus-educational.com/Jzangwill.htm", "passage_text": "Israel Zangwill. Israel Zangwill was born in Whitechapel on 21st January, 1864. He was the second of the five children of Moses Zangwill, an itinerant pedlar, glazier, and rabbinical student, and his wife, Ellen Hannah Marks, a Polish Jewish immigrant. He attended the Jews' Free School in Spitalfields. After receiving his degree at the University of London he returned to his school as a teacher"}, {"url": "https://en.wikipedia.org/wiki/Israel_Zangwill", "passage_text": "His brother was novelist Louis Zangwill, and his son was the prominent British psychologist, Oliver Zangwill. Zangwill received his early schooling in Plymouth and Bristol. When he was nine years old Zangwill was enrolled in the Jews' Free School in Spitalfields in east London, a school for Jewish immigrant children. In 1908, Zangwill told a London court that he had been naive when he made his 1901 speech and had since realized what is the density of the Arab population, namely twice that of the United States."}, {"url": "http://www.jewishvirtuallibrary.org/jsource/biography/zangwill.html", "passage_text": "(1864-1926). Tweet. Israel Zangwill, Anglo-Jewish writer and political activist, was probably the best known Jew in the English-speaking world at the start of the twentieth century. Zangwill was born in London on January 21, 1864 to parents who had immigrated from Eastern Europe. For part of his childhood the family lived in Plymouth and Bristol, but they eventually settled in London’s East End where Zangwill attended and then taught in the Jews’ Free School. Zangwill graduated from the University of London in 1884 with honors in English, French, and Mental and Moral Science. Zangwill began his career as a journalist and humor writer, contributing to Jerome K. Jerome’s periodical The Idler as well as Jewish periodicals. His novel Children of the Ghetto, first published in 1892, made him a literary celebrity"}, {"url": "https://en.wikipedia.org/wiki/Israel_Zangwill", "passage_text": "Israel Zangwill (21 January 1864 – 1 August 1926) was a British author at the forefront of cultural Zionism during the 19th century, he was a close associate of Theodor Herzl. In 1908, Zangwill told a London court that he had been naive when he made his 1901 speech and had since realized what is the density of the Arab population, namely twice that of the United States."}, {"url": "https://en.wikipedia.org/wiki/The_Melting_Pot_(play)", "passage_text": "The Melting Pot is a play by Israel Zangwill, first staged in 1908. It depicts the life of a Russian-Jewish immigrant family, the Quixanos. David Quixano has survived a pogrom, which killed his mother and sister, and he wishes to forget this horrible event. The Melting Pot opened at the Comedy Theatre in New York on September 6, 1909, and ran for 136 performances. It was produced by Liebler & Co. and staged (directed) by Hugh Ford. Walker Whiteside played David and Chrystal Herne (daughter of James A. Herne) played Vera."}, {"url": "https://en.wikipedia.org/wiki/Israel_Zangwill", "passage_text": "Zangwill was born in London on 21 January 1864, in a family of Jewish immigrants from the Russian Empire. His father, Moses Zangwill, was from what is now Latvia, and his mother, Ellen Hannah Marks Zangwill, was from what is now Poland. In 1908, Zangwill told a London court that he had been naive when he made his 1901 speech and had since realized what is the density of the Arab population, namely twice that of the United States."}]