[{"url": "http://www.drillglass.com/hehiforbe.html", "passage_text": "1 Use diamond bits to drill your glass, not carbide bits. 2  Use diamond hole saws to drill holes 1/4 and larger or to drill holes in thick glass like glass block or wine bottles. 3  Use plenty of lubrication/coolant to keep your drill tip cool and the hole clean. 4  Use less pressure! 5  Let your drill bit drill at it's own pace. How to Drill a Hole in Glass... 1  Use diamond bits to drill your glass, not carbide bits. 2  Use diamond hole saws to drill holes 1/4 and larger or to drill holes in thick glass like glass block or wine bottles. 3  Use plenty of lubrication/coolant to keep your drill tip cool and the hole clean."}, {"url": "http://www.youtube.com/watch?v=NpEPVLOX4Gc", "passage_text": "https://www.facebook.com/DiyForKnuckl... Please Note: Drilling a hole in a ceramic wall tile or floor tile is a completely different experience to drilling a hole through a porcelain wall tile or floor tile. Porcelain tiles are extremely hard and require a special drill bit to drill through the tile. This video is dealing only with drilling a hole through a 'ceramic tile'. "}, {"url": "http://www.wikihow.com/Drill-Holes-Through-Glass", "passage_text": "1 One possibility is a carbide bit that is made for drilling glass and tile. 2  Carbide bits have a spade shaped point and are also made to withstand the friction of drilling in glass or tile. 3  You can find carbide bits at many home centers. 4  Just go to the area where they sell drill bits or ask a salesperson. Determine the type of glass you want to drill. You can drill holes in wine bottles, aquariums, mirrors, glass tiles-basically all kinds of glass. However, the one major rule is that you should never drill a hole in tempered or safety glass."}, {"url": "http://www.instructables.com/id/How-to-drill-a-clean-hole-through-tile-porcelain/", "passage_text": "How to drill a clean hole through tile-porcelain, clay, glass, hard tile. There will be times when you are tiling that you will need to cut a hole through the tile to allow for plumbing or electrical wires. This is a very effective method for drilling through any type of tile using a drill and a carbide tile bit. I, on the other hand, liked the video very much, and have tried for the longest time to drill through glass without success. If you are talking about drilling through glass table tops or something like that, you can really only drill holes using this method through glass that is not tempered. If you try to drill through tempered glass-it will crack and splinter in a giant mess. Not true."}, {"url": "http://homeguides.sfgate.com/drill-through-glass-tile-20330.html", "passage_text": "1. Mark back of the glass tile where you plan to drill a hole. Place the tile on a scrap piece of MDF board with the backside facing up. Align the drill bit with the reference mark and drill a small pilot hole. Flip the tile over. 2. Take a ball of plumber's putty and knead it into a 1/2-inch-diameter, 10-inch long roll. Join the ends of the putty to make a circle and place it around the area where you will be drilling. Press the circle of putty onto the tile to form a seal. This acts as a temporary dam to hold water while you ar"}, {"url": "http://www.drillglass.com/hehiforbe.html", "passage_text": "Use diamond bits to drill hard, brittle materials like glass, ceramics and tile. Drill small holes using a round ball shaped bit. Drill holes 1/4 and larger using a diamond core bit. First, pick the shank size that fits your tool, and then choose a rounded end bit or core bit that matches the size of the hole you need. How to Drill a Hole in Glass... 1  Use diamond bits to drill your glass, not carbide bits. 2  Use diamond hole saws to drill holes 1/4 and larger or to drill holes in thick glass like glass block or wine bottles. 3  Use plenty of lubrication/coolant to keep your drill tip cool and the hole clean."}, {"url": "http://www.ehow.com/how_4927879_drill-through-glass-tile.html", "passage_text": "Research the availability of the tile and glass drill bit that you need for your project. Tile and glass drill bits may only be available in 1/8-inch increments, so that will make it difficult to find a drill bit to work for a 3/16-inch hole as is needed for many plastic wall anchor applications. In this case, using a masonry bit may do the trick, but it may take a while to drill the hole. Mark the location of the hole on the tile with a permanent marker. Place the drill bit into the drill, plug the drill into a power supply and begin drilling the hole. Take your time drilling the hole so the tile does not break. Place a scrap block of wood under the tile for support. When the hole is complete, the tile is immediately ready to be installed into its intended position. How to Drill Through Glass Tile. Determine the size of the hole that needs to be made. If a hole is needed to accommodate a pipe, drill a hole at least 1/4-inch in diameter larger than the size of the pipe."}, {"url": "http://www.home-dzine.co.za/diy/diy-holeglass.htm", "passage_text": "For this feature I drilled holes into a tile using a glass & tile bit (top centre), small diamond-tipped hole saw (left) and large diamond-tipped hole saw (right). As you can see, the holes are not chipped and the tile is intact. "}]