[{"url": "http://www.schumacherhomes.com/states/indiana/", "passage_text": "Custom Home Building in Indiana. At Schumacher Homes, we build beautifully inspired custom homes with unlimited possibilities on the land that you love. If you don’t have property yet, we can even help you find the right land for you. Our team of experts is available to design and build your dream home typically within 75 miles of our Design Studios. Schumacher Homes has built over 12,000 homes since 1992 and is the leading Indiana custom home builder. We typically build within a 75 mile radius of our design center; including in the Indiana cities of Lawrenceburg, Decatur and Waterloo but be sure to call us because some locations build much farther out"}, {"url": "http://www.answers.com/Q/What_is_the_construction_cost_per_square_foot_in_Indiana", "passage_text": "The average cost per square foot to build a home in Indiana is  about $132 per square foot. This means a 2500 square foot home  would cost around $330,000 to build. Edit. On a cost/sqft basis this equates to most builders in the Austin Area charging $125-$150 in higher end areas and $110-$125 for areas with cheaper finish-outs."}, {"url": "http://www.homeadvisor.com/cost/architects-and-engineers/build-a-house/", "passage_text": "Custom home design companies may create custom home plans as well. Their costs typically range from $1.50 per square foot to more than $2.50 per square foot for the total project and home size. For smaller homes, this may be a budget-friendly option. However, for larger homes, this can be a substantial budget item"}, {"url": "http://home.costhelper.com/build-custom-home.html", "passage_text": "1 A great deal depends on location plus the complexity of the project and the quality of the materials chosen. 2  It's possible to custom-build an 800-square-foot dome house for $1 million or a 12,000-square-foot rural ranch house for $400,000. 3  However, the $400,000 custom-built house is the exception rather than the rule. 1 However, building a modest custom home in a low-cost area might drop costs as low as $100 a square foot, or $350,000 for 3,500 square feet."}, {"url": "http://www.madisoncustomhomesinc.com/faq.htm", "passage_text": "Cost per square foot depends on the size and style of home you want to build, as well as the materials and features you put into your house. As a general estimate, costs would start at about $85/sq. ft, but could exceed $200/ sq ft., depending on which of the three basic home styles you choose. "}, {"url": "http://www.answers.com/Q/What_is_the_average_cost_per_square_foot_to_build_a_home_in_Indiana", "passage_text": "The answer depends on the region you will build in and the quality and type of materials used. On average, the cost per square foot to build an average home is $125 per … square foot.   There are some builders, who build what is called formula homes. That is a home that is built on your property, built to specific designs in a small selection of choices and layouts, exclusive of options. The average cost per square foot to build a home in Holdrege,  Nebraska, is about $55. This means a 8000 square foot home would  cost about $440,000 to build. Edit."}, {"url": "http://www.answers.com/Q/What_is_the_average_cost_per_square_foot_to_build_a_home_in_Indiana", "passage_text": "Making the world better, one answer at a time. The average cost per square foot to build a home in Indiana is about $132 per square foot. This means a 2500 square foot home would cost around $330,000 to build. The average cost per square foot to build a home in Holdrege,  Nebraska, is about $55. This means a 8000 square foot home would  cost about $440,000 to build. Edit."}, {"url": "https://answers.yahoo.com/question/index?qid=20090406075847AAN2S78", "passage_text": "I want to build a new home later this year and my budget is $130,000 (for the land and the home) I did the math though, and if the land is $25,000 and the square footage of the floor plan I want is 1050, and if it cost $100 per square foot then it seems like I could afford it. Next. I'm trying to find out if this scenario is even realistic. I want to build a new home later this year and my budget is $130,000 (for the land and the home) I did the math though, and if the land is $25,000 and the square footage of the floor plan I want is 1050, and if it cost $100 per square foot then it seems..."}, {"url": "http://home.costhelper.com/build-custom-home.html", "passage_text": "1 It's possible to custom-build an 800-square-foot dome house for $1 million or a 12,000-square-foot rural ranch house for $400,000. 2  However, the $400,000 custom-built house is the exception rather than the rule. 1 However, building a modest custom home in a low-cost area might drop costs as low as $100 a square foot, or $350,000 for 3,500 square feet."}]