[{"url": "http://www.webmd.com/oral-health/guide/sore-throat-cold-strep-throat-tonsillitis", "passage_text": "The most common causes of sore throats are viruses. Viral sore throats are often accompanied by other cold symptoms that may include a runny nose, cough, red or watery eyes, and sneezing. Other causes of sore throat include smoking, pollution or irritants in the air, allergies, and dry air. "}, {"url": "http://www.healthline.com/health/pharyngitis", "passage_text": "Less commonly, pharyngitis is caused by a bacterial infection. Bacterial infections do require antibiotics. The most common bacterial infection of the throat is strep throat, which is caused by streptococcus A. Rare causes of bacterial pharyngitis include gonorrhea, chlamydia, and corynebacterium."}, {"url": "http://www.healthgrades.com/conditions/pharyngitis", "passage_text": "Pharyngitis is an inflammation of the throat (also known as the pharynx) often caused by a bacterial or viral infection. The main symptom is a sore throat; other symptoms may include fever, cough, congestion, body aches, and swollen lymph nodes in the neck. Theses symptoms can range from mild to severe. While many germs can cause pharyngitis, including bacteria (such as group A Streptococcus, which causes strep throat) and many types of viruses, pharyngitis can also result from allergies, voice strain, and gastric reflux, a condition in which stomach acids flow up into the throat."}, {"url": "http://www.nejm.org/doi/full/10.1056/NEJM200101183440308", "passage_text": "Clinical Manifestations. Group A streptococcus is by far the most common bacterial cause of acute pharyngitis, accounting for approximately 15 to 30 percent of cases in children and 5 to 10 percent of cases in adults. "}, {"url": "http://www.healthline.com/health/pharyngitis", "passage_text": "Viral Infection. Pharyngitis is most commonly caused by viral infections such as the common cold, influenza, or mononucleosis. Viral infections do not respond to antibiotics, and treatment is only necessary to help relieve symptoms. The most common bacterial infection of the throat is strep throat, which is caused by streptococcus A. Rare causes of bacterial pharyngitis include gonorrhea, chlamydia, and corynebacterium."}, {"url": "http://www.webmd.com/cold-and-flu/tc/sore-throat-topic-overview", "passage_text": "Fortunately, most sore throats are caused by a minor illness and go away without medical treatment. Several conditions can cause a sore throat. Sore throats may be caused by a viral illness, such as: 1  The common cold, the most common type of viral infection. 2  Infection of the voice box (laryngitis). 3  Mononucleosis (mono, the kissing disease), a viral infection that tends to cause a persistent sore throat. "}, {"url": "http://emedicine.medscape.com/article/225362-overview", "passage_text": "Worldwide, viral pharyngitis is one of the most common causes of absence from school or work. The National Ambulatory Medical Care Survey showed that upper respiratory tract infections, including acute pharyngitis, accounted for 200 annual visits to a physician per 1000 population between 1980-1996. Background. Viral pharyngitis can be caused by numerous viruses. Acute pharyngitis is an inflammatory syndrome of the pharynx and/or tonsils caused by several different groups of microorganisms. Pharyngitis can be part of a generalized upper respiratory tract infection or a specific infection localized in the pharynx"}, {"url": "http://www.healthline.com/health/pharyngitis", "passage_text": "Pharyngitis is inflammation of the pharynx—the back of the throat. This can cause a sore throat, as well as scratchiness in the throat and difficulty swallowing. According to the University of Maryland Medical Center, pharyngitis is one of the most common reasons for doctor visits (UMM, 2011). The most common bacterial infection of the throat is strep throat, which is caused by streptococcus A. Rare causes of bacterial pharyngitis include gonorrhea, chlamydia, and corynebacterium."}, {"url": "https://en.wikipedia.org/wiki/Pharyngitis", "passage_text": "Pharyngitis /faerɨnˈdʒaɪtɨs/ færɨnˈdʒaɪtɨs is the inflammation of the, pharynx a region in the back of the. Throat in most cases it is quite, painful and it is the most common cause of a sore. throat It is hard to differentiate a viral and a bacterial cause of a sore throat based on symptoms alone. Thus often a throat swab is done to rule out a bacterial cause. The modified Centor criteria may be used to determine the management of people with pharyngitis."}]