[{"url": "http://www.crystal-cure.com/unakite.html", "passage_text": "Unakite Gemstone meaning. Unakite, also called epidote, derives its name from the Greek epidosis, meaning growing together. It is a combination of red jasper and green epidote solidly bound together. From this we get the meaning that what comes together belongs together. "}, {"url": "http://www.shimmerlings.com/gemstones/unakite/", "passage_text": "Stone of Higher Spiritual Forces. Unakite…or Epidote with feldspar as it is also known, consists of a combination of deformed feldspar, green epidote and quartz solidly bound together, thus creating the beautiful pistachio and pink coloring. The splashes of soft peach against a fresh green colored background makes Unakite a much beloved and magical gemstone. The stone takes it’s name from the Greek word epidosis, meaning “growing together”, and it is these materials bound together that conveys the meaning that what comes together, belongs together."}, {"url": "http://www.shamanscrystal.co.uk/crystal/423/unakite", "passage_text": "Unakite Crystal Meaning Unakite is an understated crystal that often gets left out. It's actually a very good one. Firstly the colours resemble the heart chakra and the root chakra together. The pink in the crystal resonates to both the core of the earthy heart and the upper part of the root chakra. Unakite Physical Properties Unakite rock is a variety of granite with green epidote and patches of red orthoclase. It is composed of pink feldspar, green epidote and quartz (but lacks mica)."}, {"url": "http://www.astrolika.com/stones-crystals/unakite.html", "passage_text": "Properties of the healing stone-Unakite is a balancing stone that is made up of three minerals-green epidote, pink fieldspar and quartz. It helps to create a balance in all aspects of life, be it emotional, spiritual or mental. "}, {"url": "http://www.shimmerlings.com/gemstones/unakite/", "passage_text": "ˈyue-ˈyü-nə. ˌkīt stone Of Higher Spiritual. Forces…unakite Or epidote with feldspar as it is also, known consists of a combination of deformed, feldspar green epidote and quartz solidly bound, together thus creating the beautiful pistachio and pink. coloring The splashes of soft peach against a fresh green colored background makes Unakite a much beloved and magical gemstone. The stone takes it’s name from the Greek word epidosis, meaning “growing together”, and it is these materials bound together that conveys the meaning that what comes together, belongs together."}, {"url": "http://meanings.crystalsandjewelry.com/unakite", "passage_text": "Unakite. Learn about the crystal meanings of beautiful green and pink unakite. Unakite Tumbles Example. Alternate Names or Spellings: Unikite, Unakite Jasper. Unakite is a stone with gentle but powerful energy. It can assist one in finding one's animal guide. It is also a stone that is helpful for gardening. Unakite is also a good protection stone. Unakite brings unconditional love of humanity, connection and reunion. Unakite is considered to be very helpful for pregnancy and childbirth. It can help with healing of abandonment and separation issues."}, {"url": "http://www.healing-crystals-for-you.com/unakite.html", "passage_text": "Where Does It Come From ... The meaning of this stone's name relates to the location in the USA where it is mainly found, in the Unakas Mountains in North Carolina. Although most of the stone comes from the United States, it is also found in Switzerland and in Zimbabwe in South Africa. It is known as both Unakite Stone and Jasper, as is said to be a member of the family of Jaspers, which are stones made up of a mixture of different materials, including quartz."}, {"url": "http://www.healing-crystals-for-you.com/unakite.html", "passage_text": "Unakite Jasper is a stone that encourages visionary abilities by opening your psychic vision. It works through the third eye chakra and aids you to visualize the things you desire in your life. It has an excellent balancing action for your emotions, bringing your emotions into line with your spiritual aspects. It is known as both Unakite Stone and Jasper, as is said to be a member of the family of Jaspers, which are stones made up of a mixture of different materials, including quartz."}]