[{"url": "http://www.howmuchisit.org/garage-door-repair-cost/", "passage_text": "1 A One piece garage doors that needs repair on its balance, adjustment and alignment can cost from $65 to $90 per hour, while sectional doors repair is priced from $95 to $150 per hour. 2  Hardware changes can be the most expensive aspect of having your garage door repaired. If you have a garage door that is malfunctioning or not working at all, you may be in need of repair. While repair can be pricey, it will usually be less expensive than replacing the garage door altogether. With regular maintenance and quality parts, a garage door can last 20 or more years."}, {"url": "http://www.ontrackgaragedoorservice.com/blog/how-much-does-garage-door-repair-replacement-cost-2015-pictures.htm", "passage_text": "Garage door panel repair is one of the highest dollar fixed you can do for your garage door. The cost to repair the panel/section is directly associated to the repairman's hourly rate. Installation of new panels start at $240 for a 9' panel and $690 or more for a 16' panel. Depending on what wrong with the panel, average prices for repair are $130 for steel door repairs, $190 for wood, $170 for aluminum and $150 for fiberglass. More information on how to replace a garage door panel."}, {"url": "http://www.improvenet.com/r/costs-and-prices/garage-door-repair-cost-estimator", "passage_text": "Cost to Repair a Garage Door. The cost to repair a garage door depends largely on the problem and the type of door. Some problems, such as debris in the tracks, are fairly inexpensive fixes while broken panels or faulty cables can cost a lot more. Certain types of garage doors are also more expensive to fix"}, {"url": "http://www.howmuchisit.org/broken-garage-spring-repair/", "passage_text": "1 On average, to have your springs replaced on your garage door will vary in cost anywhere from $110 to as much as $200 per spring. 2  To get an exact quote, consider using free websites such as HomeAdvisor.com. 3  This website can match you up with countless contractors in your area. "}, {"url": "http://www.homeadvisor.com/cost/garages/repair-a-garage-door/", "passage_text": "1 Broken glass in the door: Glass is relatively inexpensive, so the major cost of this repair is the labor it takes to replace it. 2  Figure on about an hour of labor for a garage door professional at about $75, with a cost of $25 to $50 for the glass itself. 1 The cost of repairing the wood varies depending on the type. 2  However, average cost to repair a wood panel is $190 to $215. 3  Steel-For homes in a hurricane or typhoon prone location, steel is ideal. 4  If you live in a coastal area or high wind area, your local building codes may require a reinforced door."}, {"url": "http://answers.angieslist.com/How-garage-door-spring-replacement-cost-q47909.aspx", "passage_text": "Edit Answer (for another 0 minute). Rolling sectional overhead garage door spring replacement should cost somewhere between $195 to $300 for a quality set springs (50000 cycle rating). This price will very if the garage door repair company charges a service call fee (trip charge). Edit Answer (for another -2 minute). Rolling sectional overhead garage door spring replacement should cost somewhere between $195 to $300 for a quality set springs (50000 cycle rating). This price will very if the garage door repair company charges a service call fee (trip charge)."}, {"url": "http://www.homeadvisor.com/cost/garages/repair-a-garage-door/", "passage_text": "If your garage door falls more quickly than it once did, or bounces around when in use, it is likely due to broken chains or cables. This is a repair best done by a professional. The cables or chains are relatively inexpensive, but installation takes some time. Average costs may be $150 to $200. 1 The cost of repairing the wood varies depending on the type. 2  However, average cost to repair a wood panel is $190 to $215. 3  Steel-For homes in a hurricane or typhoon prone location, steel is ideal. 4  If you live in a coastal area or high wind area, your local building codes may require a reinforced door."}, {"url": "http://www.homeimprovementeducator.com/garage/garage-door-repair.html", "passage_text": "Prices for garage door repairs average $200 to $300 nationwide. But depending on what, specifically, went wrong with your door, actual repair costs can vary significantly. Below is a breakdown of common garage door repairs and how much they might cost. 1  Repair companies typically charge $85 to $95 per hour of labor. 2  Because most companies charge a minimum of one hour, expect to pay at least $85 for any repair. 3  Spring repair costs $150 to $300 per spring and takes 1-2 hours to complete. 1 Track and roller repair costs average $85 to $200, including labor. 2  Expect to pay a bit more if one of your tracks requires replacement. 3  Garage door cables cannot be repaired, making replacement your only option. 4  A new cable runs around $20 to $30; with labor expect to pay $110-$160."}]