[{"url": "http://www.meaning-of-names.com/search/", "passage_text": "Use the search tools above to find names and meanings. You can enter complete names or partial beginnings to search name variations. "}, {"url": "http://www.sheknows.com/baby-names/name/egon", "passage_text": "Irish Meaning: The name Egon is an Irish baby name. In Irish the meaning of the name Egon is: Fiery. Gaelic Meaning: The name Egon is a Gaelic baby name. In Gaelic the meaning of the name Egon is: Young fighter. Teutonic Meaning: The name Egon is a Teutonic baby name. In Teutonic the meaning of the name Egon is: Formidable."}, {"url": "http://www.babynamespedia.com/meaning/Egon/m", "passage_text": "The Bavarian-born Saint Egino or Egon (-1122) was an abbot in the abbey of Ulric and Afra. In addition, Egon is a variant of the name Aodh (Irish and Scottish) in the Irish language. The names Eegon and Egun are variants of Egon. Egon is not regularly used as a baby name for boys. It is not listed in the top 1000 names. Egon is used chiefly in the Irish, German, Hungarian, and Slavic languages, and it is derived from Celtic and Germanic origins. Germanic origin, German, Hungarian, and Slavic use: Egino (Germanic) is an original form of Egon."}, {"url": "http://www.ourbabynamer.com/meaning-of-Egon.html", "passage_text": "Egon is generally used as a boy's name. It consists of 4 letters and 2 syllables and is pronounced E-gon. In the U.S. in 2014, it ranked 9860 in baby name popularity for boys with 7 occurrences. Less than 5 girls were given the name. View the Egon Name Popularity Page to see how the popularity trend for Egon has changed since 1880, or to compare the popularity of Egon to other names. Just for fun, see the name Egon in Hieroglyphics, learn about ancient Egyptian Hieroglyphics and write a Hieroglyphic message. Learn about nautical flags and see your name or message written in nautical flags, on the Egon in Nautical Flags page."}, {"url": "http://www.thinkbabynames.com/meaning/1/Egon", "passage_text": "Egon is pronounced similarly to Eagan and Egann. Other suggested similar baby names are Eagen, Edon, Egor, Eion, Ekon, Elon, Eon, Eron, Eton and Eugen. Like Egon, these names are not frequently used. Egon is an unusual first name for men and an equally unusual surname for both adults and children. (2000 U.S. Census). Displayed below is the birth name popularity of Egon for boys."}, {"url": "http://www.thinkbabynames.com/meaning/1/Egon", "passage_text": "Egon /egon/ [2 sylls.] as a boys' name is of Old German origin, and the meaning of Egon is sword's edge . Originally a short form of Gemrmanic names containing the elements egin or egil. Prince Egon von Furstenburg. Affiliated boy name: Egan. Egon is an unusual first name for men and an equally unusual surname for both adults and children. (2000 U.S. Census). Displayed below is the birth name popularity of Egon for boys."}, {"url": "http://meaning-of-names.com/", "passage_text": "Even if you are here just to browse, we hope that you will enjoy a unique spin on a fascinating study field. We offer name meanings for over 45,000 different baby names, surnames, and city names from all over the world. We are in the process of building many tools and resources to help make your studies easier. We invite you to contribute name meanings, ratings, comments, participate in our forums, or contribute facts and information to our growing community. Here is a great resource if you are looking for-Baby Names. Name Meanings and History One of the things that all people and places have in common is (NAMES). Have you ever asked yourself, What does my name mean?."}, {"url": "http://www.babynamespedia.com/meaning/Egon/m", "passage_text": "[ 2 syll. e-gon, eg-on ] The baby boy name Egon is also used as a girl name. It is pronounced as IY GahN †. Egon is used chiefly in the Irish, German, Hungarian, and Slavic languages, and it is derived from Celtic and Germanic origins. Germanic origin, German, Hungarian, and Slavic use: Egino (Germanic) is an original form of Egon."}]