[{"url": "https://blogs.cfainstitute.org/investor/2015/06/30/an-easier-way-to-understand-hedge-fund-leverage/", "passage_text": "Absolute return goals are widely used in the hedge fund industry and are achieved through leverage and alpha relative to various market betas. As a result, it is possible to create a valuation-based “rule of thumb” computation for the implied leverage that hedge fund strategies need given market valuations."}, {"url": "http://www.sec.gov/investor/alerts/ib_hedgefunds.pdf", "passage_text": "Leverage is the use of borrowed money to make an investment. A hedge fund using leverage will typically invest both the investors’ capital and the borrowed money to make investments in an effort to increase the potential returns of the fund."}, {"url": "http://www.oakpointinvestments.com/articles/Leveraged%20Hedge%20Fund%20Portfolios%20Dunn%202006%20Euromoney.pdf", "passage_text": "the transparency to understand the underlying hedge fund positions in the portfolio, and without a risk decomposition of the underlying instruments traded, the amount of overlaid financing leverage on a hedge fund portfolio will be a very poor indicator of financial risk."}, {"url": "http://www.pionline.com/article/20140626/ONLINE/140629884/under-the-hood-of-hedge-fund-leverage", "passage_text": "One of the key differentiators between hedge funds and other investment vehicles is the use of leverage. Leverage can be your best friend one day, and your worst enemy the next. Everyone knows that leverage will accentuate both gains and losses."}, {"url": "http://www.pionline.com/article/20140626/ONLINE/140629884/under-the-hood-of-hedge-fund-leverage", "passage_text": "Explicit leverage is money or assets contractually borrowed for a fee. As a hedge fund investor, it is important to know whether your hedge funds are using these types of products and how much risk they add to your portfolio. One way to figure this out is by reviewing the often overlooked audited financial statements."}, {"url": "http://www.investopedia.com/university/hedge-fund/strategies.asp", "passage_text": "Equity Hedge The equity hedge strategy is commonly referred to as long/short equity and although it is perhaps one of the simplest strategies to understand, there are a variety of sub-strategies within the category."}, {"url": "http://www.barclayhedge.com/research/educational-articles/hedge-fund-strategy-definition/what-is-a-hedge-fund.html", "passage_text": "A hedge fund is an alternative investment vehicle available only to sophisticated investors, such as institutions and individuals with significant assets. Like mutual funds, hedge funds are pools of underlying securities."}, {"url": "http://www.barclayhedge.com/research/educational-articles/hedge-fund-strategy-definition/what-is-a-hedge-fund.html", "passage_text": "In fact, the name “hedge fund” is derived from the fact that hedge funds often seek to increase gains, and offset losses, by hedging their investments using a variety of sophisticated methods, including leverage."}]