[{"url": "http://www.justanswer.com/australian-law/5rsq3-holder-power-attorney-dies-happens.html", "passage_text": "If the holder of a power of attorney dies, what happens to that power of attorney, is it extinguished or can the beneficiaries of the deceased use the power of attorney in any way?"}, {"url": "http://www.answers.com/Q/What_happens_to_you_when_your_power_of_attorney_dies", "passage_text": "A power of attorney refers to a written instrument, executed by one person (the principal) that allows another person (the attorney in fact) to act on their behalf. If the principal dies the power of attorney is extinguished."}, {"url": "http://www.wisegeek.org/what-happens-to-power-of-attorney-after-death.htm", "passage_text": "Power of attorney ends after death. No matter what type it is — a durable power attorney, irrevocable power of attorney, or enduring power of attorney — the rights of the attorney, attorney-in-fact, or agent terminate."}, {"url": "http://info.legalzoom.com/still-power-attorney-someone-dies-24156.html", "passage_text": "Powers of attorney do not survive death. After death, the executor of the estate handles all financial and legal matters, according to the provisions of the will. An individual can designate power of attorney to his attorney, family member or friend and also name that same person as executor of the estate."}, {"url": "http://www.nolo.com/legal-encyclopedia/question-power-of-attorney-still-valid-28322.html", "passage_text": "In fact, it is that very clause that makes a power of attorney durable -- that is, effective even after the principal becomes incapacitated. However, all durable powers of attorney end when the principal dies."}, {"url": "http://info.legalzoom.com/still-power-attorney-someone-dies-24156.html", "passage_text": "A durable power of attorney lasts beyond the principal being incapacitated. It expires when the principal dies. A durable power of attorney enables the agent to act on the principal's behalf during his temporary or permanent incapacity. The durable power of attorney does not give the agent authority to make critical health care decisions, regarding life or death."}, {"url": "http://info.legalzoom.com/power-attorney-end-upon-death-20235.html", "passage_text": "If the agent dies, the principal must sign an additional power of attorney, giving authority to another agent to deal with his affairs. Section 111 of the Uniform Power of Attorney Act provides that the power of attorney ends when the agent dies, unless the document provides for either a co-agent or a successor agent."}, {"url": "http://info.legalzoom.com/power-attorney-end-upon-death-20235.html", "passage_text": "A power of attorney is a legal document that grants authority to another person to administer all or some of your affairs. The person who grants the power of attorney is known as the principal, and the person who takes over the authority is known as the agent."}]