[{"url": "http://www.wiseshe.com/2015/09/what-does-ylang-ylang-smell-like.html", "passage_text": "Ylang Ylang is one beautiful flower which has a million types of fragrances. Different people experience different smells from it. To obtain 1 kg of essential oil, about 60 kg of flowers need to get crashed. And thus the essential Oil made out of it is among the most divine fragrance oil with enriching qualities. "}, {"url": "http://toptropicals.com/html/toptropicals/articles/trees/cananga.htm", "passage_text": "Ylang-Ylang (Cananga odorata) is a large evergreen tropical tree of the Annonaceae family, which grows to 100 ft. in height. It has drooping branches and yellow, long-petaled flowers whose fragrance can be smelled from a distance of 30 ft. or more. "}, {"url": "http://perfumemaking.blogspot.com/2006/09/ylang-ylang.html", "passage_text": "Ylang Ylang has a sensual smell and is perfect to use in an aroma burner to create a romantic enviroment. Some find the scent of the oil a bit to sweet and heavy, you can mix it with some lemon oil to make the oil smell lighter. Ylang Ylang. The essential oil of Ylang Ylang was one of the first essential oils I buyed. The smell of Ylang Ylang oil is intense sweet, flowery, exotic and somewhat fruity. Ylang Ylang came originally from the Philippines but also growing now in Java, the Comores and other places"}, {"url": "http://howthingssmell.com/nature/ylang-ylang-smell-like/", "passage_text": "What it is: The Ylang Ylang, pronounced ‘EE-lang EE-lang’ is a tree (with an accompanying flower) that is native to the tropical rainforests of Asian countries. The essential oil extracted from the flower is used in perfumery. What it smells like: Ylang Ylang essential oil is beautifully fragrant, with a heavy, sweet, slightly fruity floral scent. It could be classified as a feminine scent, however is used on both women’s and men’s fragrances. Tips: Add a few drops to any of your grooming products but do not use too much as it is strong"}, {"url": "http://www.wisegeek.org/what-is-ylang-ylang.htm", "passage_text": "Top 10 facts about the world. Ylang ylang (pronounced EE-lang EE-lang) is a tropical tree native to Asia, or the flower of the tree and the essential oil produced from the flowers. The tree is the Cananga odorata, and the oil is extensively used in making perfumes and in aromatherapy. Ylang Ylang has many uses. It has the most wonderful scent! It is often used for stress-related disorders like depression, insomnia, and nervous tension. It also has skin care uses. It is used to treat acne and irritated skin. Many people still use it as a hair rinse, as well."}, {"url": "http://www.sustainablebabysteps.com/ylang-ylang-essential-oil.html", "passage_text": "Photo Source: Prenn. Ylang ylang essential oil (Cananga odorata) is one of my favorite oils. Although it's often only thought of as only a nice-smelling oil, the physical and emotional support ylang ylang can offer is much more than just a room deodorizer. On a strictly emotional and spiritual level, ylang ylang essential oil is truly the oil of the heart (the best in my opinion). It can help us connect to our own heart, process things from the heart, and heal emotional traumas."}, {"url": "http://health.howstuffworks.com/wellness/natural-medicine/aromatherapy/aromatherapy-ylangylang.htm", "passage_text": "Uses for ylang ylang: Of all the essential oils, ylang ylang is one of the best at relaxing the mind and the body. Simply sniffing it can slightly lower blood pressure, although taking a bath with the oil or using it in a massage oil greatly enhances the relaxation experience. ABOUT THE AUTHOR: Originating in the Philippines, ylang ylang means “flower of flowers” or “fragrance of all fragrances.” This fragrance is traditionally used in aromatherapy to sharpen the senses and to temper depression, fear, anger, and jealousy."}]