[{"url": "http://www.studyzone.org/testprep/math4/k/squaresl.cfm", "passage_text": "Area = is the number of square units that cover a figure. To find the area, count the number of square units in an object. Also know that Area = length x width (A = l x w). Each square is a 'square unit' Each object (A or B) has 5 square units. Object A has 3 vertical and 2 horizontal square units to equal a total of 5 sq.units. Object B has 4 sq. units and 2 half units which together equal 1 sq.unit to equal a total of 5 sq. units. "}, {"url": "https://en.wikipedia.org/wiki/Unit_square", "passage_text": "Not to be confused with Square (unit) . The unit square in the real plane. In mathematics, a unit square is a square whose sides have length 1. Often, the unit square refers specifically to the square in the Cartesian plane with corners at (0, 0), (1, 0), (0, 1), and (1, 1)."}, {"url": "https://answers.yahoo.com/question/index?qid=20080905143338AAQsknv", "passage_text": "Best Answer: Hi, Good Question! Square units are often times used in area problems where one side of let's say, a rectangle is cm and the other side is cm. When multiplying these together, we get cm-squared. However, there are times when it's not this explicit, like when you have to find the are of a circle A = pi r^2. If you really want to understand what square units are and why they are used their is a really good website (the second one in the sources). If you read the first part What is a square foot?. I think you will really understand it, I found it really interesting. Source(s): http://www.math.com/tables/geometry/area..."}, {"url": "http://www.answers.com/Q/What_is_the_definition_of_a_square_unit", "passage_text": "A square unit is a unit when squared equals a perfect square number. 5 is a square number, five times five is 25. Divid or square root 25 and you get 5. now technicaly every number is a square number but it is generally considered only whole numbers. "}, {"url": "http://www.answers.com/Q/What_is_the_definition_of_square_units", "passage_text": "A square unit is a unit when squared equals a perfect square number. 5 is a square number, five times five is 25. Divid or square root 25 and you get 5. now technicaly every n … umber is a square number but it is generally considered only whole numbers. The square root of a number is a number which, when multiplied by itself, yields that original number.   *Special note: Recall that two positive numbers when multiplied tog … ether equal a positive number, and two negative numbers when multiplied together equal a positive number."}, {"url": "https://answers.yahoo.com/question/index?qid=20080905143338AAQsknv", "passage_text": "· just now. Report Abuse. Square units are used in measuring area, the area of a figure tells you the amount of squares it would take to cover the figure completely. If you really want to understand what square units are and why they are used their is a really good website (the second one in the sources). If you read the first part What is a square foot?. I think you will really understand it, I found it really interesting. Source(s): http://www.math.com/tables/geometry/area..."}, {"url": "https://en.wikipedia.org/wiki/Square_(unit)", "passage_text": "The square is an Imperial unit of area that is used in the United States construction industry, and was historically used in Australia. One square is equal to 100 square feet. Examples where the unit is used are roofing shingles, metal roofing, vinyl siding, and fibercement siding products. Some home builders use squares as a unit in floor plans to customers. "}, {"url": "https://en.wikipedia.org/wiki/Unit_square", "passage_text": "In a Cartesian coordinate system with coordinates (x, y) the unit square is defined as the square consisting of the points where both x and y lie in a closed unit interval from 0 to 1 on their respective axes. That is, the unit square is the Cartesian product I × I, where I denotes the closed unit interval. Often, the unit square refers specifically to the square in the Cartesian plane with corners at (0, 0), (1, 0), (0, 1), and (1, 1)."}, {"url": "http://www.mathematicsdictionary.com/english/vmd/full/s/squareunit.htm", "passage_text": "The area of a square each of whose sides measures 1 unit. It is used to measure area. "}]