[{"url": "http://www.steinerdental.com/wisdom-teeth.php", "passage_text": "When a tooth is impacted, it may need to be removed. If it is not removed, you may develop gum tenderness, swelling, or even severe pain. Impacted wisdom teeth that are partially or fully erupted tend to be quite difficult to clean and are susceptible to tooth decay, recurring infections, and even gum disease. The removal of wisdom teeth has become so commonplace that it is almost a rite of passage for young adults. Wisdom teeth are a type of molar that is found in the very back of your mouth. There are four wisdom teeth: upper left, upper right, lower left, and lower right."}, {"url": "http://www.nhs.uk/Conditions/Wisdom-tooth-removal/Pages/Introduction.aspx", "passage_text": "How wisdom teeth are removed. Your dentist may remove your wisdom teeth or they may refer you to a specialist surgeon for hospital treatment. Before the procedure, you'll usually be given a local anaesthetic injection to numb the area around the tooth. The time it takes to remove the tooth will vary. Some procedures only take a few minutes, whereas others can take 20 minutes or longer. After your wisdom teeth have been removed, you may experience swelling and discomfort, both on the inside and outside of your mouth. This is usually worse for the first three days, but it can last for up to two weeks. Read more about how a wisdom tooth is removed and recovering from wisdom tooth removal"}, {"url": "http://www.webmd.com/oral-health/wisdom-tooth-extraction", "passage_text": "Guide. An oral and maxillofacial surgeon or your dentist can remove (extract) a wisdom tooth. The procedure often can be done in the dentist's or surgeon's office. You may have the surgery in the hospital, especially if you are having all your wisdom teeth pulled at one time or if you are at high risk for complications. To remove the wisdom tooth, your dentist will open up the gum tissue over the tooth and take out any bone that is covering the tooth. He or she will separate the tissue connecting the tooth to the bone and then remove the tooth. Sometimes the dentist will cut the tooth into smaller pieces to make it easier to remove."}, {"url": "http://www.steinerdental.com/wisdom-teeth.php", "passage_text": "If your dentist recommends removal of your wisdom teeth, it is best to have them removed sooner than later. As a general rule, wisdom teeth are removed in the late teens or early twenties because there is a greater chance that the teeth's roots have not fully formed and the bone surrounding the teeth is less dense. The removal of wisdom teeth has become so commonplace that it is almost a rite of passage for young adults. Wisdom teeth are a type of molar that is found in the very back of your mouth. There are four wisdom teeth: upper left, upper right, lower left, and lower right."}, {"url": "http://www.nhs.uk/Conditions/Wisdom-tooth-removal/Pages/Introduction.aspx", "passage_text": "If your dentist thinks you may need your wisdom teeth removed, they'll usually carry out an X-ray of your mouth. This gives them a clearer view of the position of your teeth. As with any teeth problems, it's important to see your dentist as soon as possible, rather than waiting for your regular dental check-up. The time it takes to remove the tooth will vary. Some procedures only take a few minutes, whereas others can take 20 minutes or longer. After your wisdom teeth have been removed, you may experience swelling and discomfort, both on the inside and outside of your mouth. This is usually worse for the first three days, but it can last for up to two weeks. Read more about how a wisdom tooth is removed and recovering from wisdom tooth removal"}, {"url": "https://answers.yahoo.com/question/index?qid=20100107135117AAeLxTw", "passage_text": "I never had a regular dentist removed my 4 wisdom teeth-they told me they couldn't. And my cousin was the dentist. I had to go to a Oral surgeon and be put under, but mine were impacted. He or she may have a new certification I am not aware of, but I am uncomfortable about it, unless they are not impacted. "}, {"url": "http://www.webmd.com/oral-health/wisdom-tooth-extraction", "passage_text": "1 More serious problems can develop from impacted teeth, such as infection, damage to other teeth and bone, or a cyst. 2  One or more of your wisdom teeth may come in at an awkward angle, with the top of the tooth facing forward, backward, or to either side. To remove the wisdom tooth, your dentist will open up the gum tissue over the tooth and take out any bone that is covering the tooth. He or she will separate the tissue connecting the tooth to the bone and then remove the tooth. Sometimes the dentist will cut the tooth into smaller pieces to make it easier to remove."}, {"url": "http://www.livescience.com/34755-impacted-wisdom-teeth-removal-oral-surgery.html", "passage_text": "Some impacted wisdom teeth don't require removal, but symptomatic cases usually need surgical extraction by a dentist or an oral surgeon in an outpatient setting. Local or general anesthesia may be used, depending on the severity of the condition. To diagnose impacted wisdom teeth, dentists look for swollen gums or signs of infection such as tenderness, redness and drainage, according to the National Institutes of Health (NIH). They also inquire about symptoms and regular oral cleaning habits."}]