[{"url": "http://www.bible.ca/archeology/bible-archeology-exodus-ammonites.htm", "passage_text": "1 The Ammonites were descendants of Lot through his daughter: Thus both the daughters of Lot were with child by their father. 2  The firstborn bore a son, and called his name Moab; he is the father of the Moabites to this day. "}, {"url": "http://www.ligonier.org/learn/devotionals/moabites-and-ammonites/", "passage_text": "The younger also bore a son and called his name Ben-ammi. He is the father of the Ammonites to this day” (Gen. 19:37–38). Moses concludes the account of Sodom and Gomorrah’s destruction in today’s passage, telling us that Lot fathered the Moabites and the Ammonites by his daughters (Gen. 19:37–38). 3:8–9). God also inspired Moses to explain how the Israelites were related to the other peoples living in the area. The Moabites who lived just east of the Dead Sea and the Ammonites who occupied the countryside north of Moab were both tribes related by blood to Abraham as they descend from his nephew"}, {"url": "http://gwydir.demon.co.uk/jo/fossils/ammonite.htm", "passage_text": "Ammonites. Ammonites were animals that lived in the sea. They are now extinct. Their name is derived from The Egyptian God Ammon. Ammon's sacred animal was a ram, and an ammonite looks like a ram's horn. Pliny the Elder called ammonites the Horns of Ammon."}, {"url": "https://en.wikipedia.org/wiki/Ammon", "passage_text": "Biblical narrative [edit]. The first mention of the Ammon in the Bible is in Genesis 19:37-38. It is stated there that they descended from Ben-Ammi, a son of Lot through incest with his younger daughter. Ben'bén, ammi ámmî  literally means son of . my people : ʻAmmūn; Greek: αμμονιοι) is a Semitic kingdom from the Bronze Age period occupying the east of the Jordan River, between the torrent valleys of Arnon and Jabbok, in present-day Jordan. The chief city of the country was Rabbah or Rabbath Ammon, site of the modern city of Amman, Jordan's capital."}, {"url": "http://www.catholic.org/encyclopedia/view.php?id=668", "passage_text": "The Ammonites were settled to the east of the Jordan, their territory originally comprising all from the Jordan to the wilderness, and from the River Jabbok south to the River Arnon (Judges 11:13-22) which later fell to the lot of Reuben and Gad. The Ammonites were a race very closely allied to the Hebrews. One use of their name itself in the Bible indicates the ancient Hebrew belief of this near relationship, for they are called Ben`bén ammi ámmî or son of, my people meaning that that race is regarded as Descended'from israel s. nearest relative"}, {"url": "http://www.gotquestions.org/Ammonites.html", "passage_text": "The older daughter had a son named Moab (from father), and the younger gave birth to Ben-Ammi (son of my people). The Ammonites, descendants of Ben-Ammi, were a nomadic people who lived in the territory of modern-day Jordan, and the name of the capital city, Amman, reflects the name of those ancient inhabitants. The Ammonites were a Semitic people, closely related to the Israelites. Despite that relationship, they were more often counted enemies than friends. Lot, Abraham's nephew, was the progenitor of the Ammonites. After Abraham and Lot separated (Genesis 13), Lot settled in the city of Sodom."}, {"url": "http://www.gotquestions.org/Ammonites.html", "passage_text": "Answer: Throughout the early history of Israel, we find references to the Ammonite people. Who were they, where did they come from, and what happened to them? The Ammonites were a Semitic people, closely related to the Israelites. Despite that relationship, they were more often counted enemies than friends. Lot, Abraham's nephew, was the progenitor of the Ammonites. After Abraham and Lot separated (Genesis 13), Lot settled in the city of Sodom."}, {"url": "http://animals.nationalgeographic.com/animals/prehistoric/ammonites/", "passage_text": "Ammonites first appeared about 240 million years ago, though they descended from straight-shelled cephalopods called bacrites that date back to the Devonian, about 415 million years ago. Ammonites were prolific breeders, lived in schools, and are among the most abundant fossils found today. "}, {"url": "http://www.gotquestions.org/Ammonites.html", "passage_text": "After the split of Israel and Judah, the Ammonites began to ally themselves with the enemies of Israel. Ammon regained some sovereignty in the seventh century B.C., until Nebuchadnezzar conquered them about a hundred years later. The Ammonites were a Semitic people, closely related to the Israelites. Despite that relationship, they were more often counted enemies than friends. Lot, Abraham's nephew, was the progenitor of the Ammonites. After Abraham and Lot separated (Genesis 13), Lot settled in the city of Sodom."}]