[{"url": "http://administration.yale.edu/mail-service/addressing/yales-mailing-address", "passage_text": "Yale Mail Service recommends that all mail and packages be sent via the US Postal Service to the box number, not the street address. Below is a list of the most commonly requested mailing addresses at Yale."}, {"url": "http://administration.yale.edu/mailservice", "passage_text": "Welcome to Yale Mail Service. We are dedicated to the timely and efficient delivery of interdepartmental correspondence and an uninterrupted flow of mail between the Yale community and the U.S. Postal Service. Yale Mail Service has been delivering mail to the Yale Community for almost a century."}, {"url": "http://administration.yale.edu/mail-service/addressing/yales-mailing-address", "passage_text": "Yale’s Mailing Address. There is no universal mailing address for Yale University. Yale’s central campus consists of many buildings and residential halls located through the City of New Haven. All U.S. mail (received from the US Postal Service by box number) is distributed by Yale Mail Service."}, {"url": "http://visitorcenter.yale.edu/", "passage_text": "Yale University Visitor Center. The Mead Visitor Center is the front door of the University and welcomes its visitors from around the world. It is located at 149 Elm Street New Haven, CT 06511, across the street from the New Haven Green. Drop by for information about Yale or to take a guided tour led by Yale College undergraduates."}, {"url": "http://admissions.yale.edu/contact-us", "passage_text": "Contact Us. We thank you for your interest in Yale, and we are happy to answer your questions. Before you contact us, please be sure to review the rest of our website."}, {"url": "http://map.yale.edu/map/", "passage_text": "Yale is located in New Haven, Connecticut (Google Maps), about two hours northeast of New York City and two and a half hours southwest of Boston. The Visitor Center is located at 149 Elm Street, across the street from the New Haven Green."}, {"url": "http://administration.yale.edu/mailservice", "passage_text": "Mail Service. We are dedicated to the timely and efficient delivery of interdepartmental correspondence and an uninterrupted flow of mail between the Yale community and the U.S. Postal Service."}]