[{"url": "http://mentalfloss.com/article/57501/27-responses-question-what-art", "passage_text": "– Arthur C. Danto (1924–2013), American philosopher of art, What Art Is (2013). 14. Ideas alone can be works of art….All ideas need not be made physical.…A work of art may be understood as a conductor from the artist’s mind to the viewer’s. 5. The craftsman knows what he wants to make before he makes it.…The making of a work of art…is a strange and risky business in which the maker never knows quite what he is making until he makes it. – R.G. Collingwood (1889–1943), English philosopher, The Principles of Art (1938). 6."}, {"url": "https://en.wikipedia.org/wiki/Art", "passage_text": "Many great traditions in art have a foundation in the art of one of the great ancient civilizations: Ancient Egypt, Mesopotamia, Persia, India, China, Ancient Greece, Rome, as well as Inca, Maya, and Olmec. Art has had a great number of different functions throughout its history, making its purpose difficult to abstract or quantify to any single concept. This does not imply that the purpose of Art is vague, but that it has had many unique, different reasons for being created."}, {"url": "https://simple.wikipedia.org/wiki/Aboriginal_art", "passage_text": "Aboriginal art is art made by indigenous Australian people. It includes work made in many different ways including painting on leaves, wood carving, rock carving, sculpting, ceremonial clothing and sand painting. Aboriginal art is closely linked to religious ceremonies or rituals. "}, {"url": "http://silviahartmann.com/art.php", "passage_text": "I would like to start there, and state my definition of art, which I believe to be a simple, workable definition that will make it possible to answer the question, what is art, quite easily and conclusively, and to help make it possible to distinguish real art from fake art, at least for the majority of the population. It is the energy mind that provides the ideas, visions, inspirations for true works of art; and a true artist is a person who makes an object that is reality aligned - meaning that it exists both in the Hard, as well as having an energetic reality to it."}, {"url": "https://en.wikipedia.org/wiki/How_Art_Made_the_World", "passage_text": "To find the answer, we need to go way back in time. — Nigel Spivey's opening narration. How Art Made The World is a 2005 five-part BBC One documentary series, with each episode looking at the influence of art on the current day situation of our society. We'll see how the struggles of early artists led to the triumphs of the world's great civilisations. Our journey will take us through a hundred thousand years of history."}, {"url": "https://en.wikipedia.org/wiki/Art", "passage_text": "Art is a diverse range of human activities and the products of those activities, usually involving imaginative or technical skill. In their most general form these activities include the production of works of art, the criticism of art, the study of the history of art, and the aesthetic dissemination of art. Art has had a great number of different functions throughout its history, making its purpose difficult to abstract or quantify to any single concept. This does not imply that the purpose of Art is vague, but that it has had many unique, different reasons for being created."}, {"url": "http://mentalfloss.com/article/57501/27-responses-question-what-art", "passage_text": "If one general statement can be made about the art of our times, it is that one by one the old criteria of what a work of art ought to be have been discarded in favor of a dynamic approach in which everything is possible. 5. The craftsman knows what he wants to make before he makes it.…The making of a work of art…is a strange and risky business in which the maker never knows quite what he is making until he makes it. – R.G. Collingwood (1889–1943), English philosopher, The Principles of Art (1938). 6."}, {"url": "http://www.getty.edu/education/teachers/classroom_resources/curricula/contemporary_art/background1.html", "passage_text": "Strictly speaking, the term  contemporary art refers to art made and produced by artists living today. Today's artists work in and respond to a global environment that is culturally diverse, technologically advancing, and multifaceted. Questions such as What is art? and What is the function of art? are relatively new. Creating art that defies viewers' expectations and artistic conventions is a distinctly modern concept. However, artists of all eras are products of their relative cultures and time periods."}, {"url": "http://mentalfloss.com/article/57501/27-responses-question-what-art", "passage_text": "27. If one general statement can be made about the art of our times, it is that one by one the old criteria of what a work of art ought to be have been discarded in favor of a dynamic approach in which everything is possible. – Peter Selz (1919-) German-born American art historian, Art in Our Times (1981). 5. The craftsman knows what he wants to make before he makes it.…The making of a work of art…is a strange and risky business in which the maker never knows quite what he is making until he makes it. – R.G. Collingwood (1889–1943), English philosopher, The Principles of Art (1938). 6."}, {"url": "http://www.getty.edu/education/teachers/classroom_resources/curricula/contemporary_art/background1.html", "passage_text": "Instead, viewers consider whether art is challenging or interesting.. Contemporary artists may question traditional ideas of how art is defined, what constitutes art, and how art is made, while creating a dialogue with—and in some cases rejecting—the styles and movements that came before them. Questions such as What is art? and What is the function of art? are relatively new. Creating art that defies viewers' expectations and artistic conventions is a distinctly modern concept. However, artists of all eras are products of their relative cultures and time periods."}]