[{"url": "http://www.georgiahealthnews.com/2014/05/hepatitis-c-high-cost-cure/", "passage_text": "The issue boils down to a tradeoff between efficacy and cost. One drug, Sovaldi, has a 90 percent cure rate for newly infected patients – much better than previously available treatments for hepatitis C. It also costs $84,000 for a 12-week treatment – basically $1,000 per day."}, {"url": "http://archinte.jamanetwork.com/article.aspx?articleid=649182", "passage_text": "Although not of the same magnitude, the hepatitis C estimate can be compared with the cost of the human immunodeficiency virus ($30 billion in 1992), epilepsy ($11.1 billion in 1995), chronic obstructive pulmonary disease ($23.9 billion in 1993), and cancer ($107 billion in 1994). We calculate that, on average, a hospital day for hepatitis C resulting in CLD costs 111.91% of the typical hospital day for all diseases and injuries. That is, hepatitis C resulting in CLD is roughly 12% more expensive than average. We multiply the 0.1191 by the percentage of total US medical costs attributed to hospitalizations and nursing home care (less program administration and dental care, 0.47"}, {"url": "https://www.washingtonpost.com/national/health-science/medicare-spent-45-billion-on-new-hepatitis-c-drugs-last-year-data-shows/2015/03/29/66952dde-d32a-11e4-a62f-ee745911a4ff_story.html", "passage_text": "The hepatitis C medication Sovaldi costs $84,000 for a 12-week course of treatment and accounted for more than $3 billion in Medicare spending. (Courtesy of Gilead Sciences/AP). Bills for a third drug, Olysio, often taken in conjunction with Sovaldi, reached $821 million. Medicare also spent $157 million on older hepatitis C drugs in 2014, bringing the total spending for the category to more than $4.7 billion."}, {"url": "http://thehill.com/blogs/congress-blog/healthcare/223754-hepatitis-c-the-cost-conundrum", "passage_text": "That increase is likely due to individuals, primarily baby boomers, infected with hepatitis C who developed severe liver disease. In the same eight-year period, medical costs for those hospitalizations grew nearly fourfold, from $900 million to an estimated $3.5 billion. We know that as many as 75% of adults infected with hepatitis C are baby boomers. We know the disease is potentially deadly, killing some 17,000 Americans a year. But the CDC researchers conclude that the trend toward worsening outcomes and higher costs for untreated hepatitis C can be reversed. Yes, reversed."}, {"url": "http://content.healthaffairs.org/content/33/10/1728.abstract", "passage_text": "Hospitalization rates for advanced liver disease also increased, particularly for hepatorenal syndrome (93 percent) and portal hypertension (62 percent). Hepatitis C was the principal diagnosis for 64,867 hospitalizations in 2010–11, resulting in a total charge of $3.5 billion. Abstract. Disease burden models have predicted worsening morbidity of liver disease caused by hepatitis C in the United States. The aim of this study was to determine the trend in hospitalizations caused by hepatitis C and advanced liver disease. We analyzed data for the period 2004–11 from the Nationwide Inpatient Sample, the largest nationwide all-payer hospital inpatient care database. Hospitalization rates for hepatitis C per 100,000 people increased significantly from 4.76 in 2004–05 to 13.81 in 2010–11—an increase of 190 percent"}, {"url": "http://archinte.jamanetwork.com/article.aspx?articleid=649182", "passage_text": "Results We estimate $5.46 billion as the cost of HCV in 1997. Costs are split as follows: 33% for direct and 67% for indirect costs. Hepatitis C virus that results in chronic liver disease contributes roughly 92% of the costs, and HCV that results in primary liver cancer contributes the remaining 8%. We calculate that, on average, a hospital day for hepatitis C resulting in CLD costs 111.91% of the typical hospital day for all diseases and injuries. That is, hepatitis C resulting in CLD is roughly 12% more expensive than average. We multiply the 0.1191 by the percentage of total US medical costs attributed to hospitalizations and nursing home care (less program administration and dental care, 0.47)"}, {"url": "http://www.medscape.com/viewarticle/814295", "passage_text": "Total costs were $664,083 for epoetin alfa, $29,007 for G-CSF, and $12,644 for transfusions. The total cost of treating hepatitis C was higher for the 65 patients who achieved sustained viral response than for the 82 who did not ($6.33 vs $5.24 million). The median cost per patient was $83,509"}]