[{"url": "http://www.answers.com/Q/What_is_the_best_temperature_to_cook_pork_roast_and_for_how_long", "passage_text": "160 degrees Fahrenheit. In a 350 degree oven you can achieve this at approx. 30 minutes per pound. Remove the roast when it reaches 155 degrees as it will carry-on cooking to an internal temperature of 160 degrees out of the oven. My dadyo (Likes to be kalled~ kool kat, but he was in the army so you'd think he'd know some kool names by now) tried this and it tasted REALLY good! The roast must be cold when you start this recipe. It will also cook more evenly if it is tied into a compact cylinder. Adjust the oven rack to center position and preheat to 475 degrees F. Take the meat directly from refrigerator and place on a cake rack set in a shallow roasting pan. Roast exactly 30 minutes."}, {"url": "http://www.porkbeinspired.com/wp-content/uploads/2014/06/2924.pdf", "passage_text": "The National Pork Board recommends cooking pork chops, roasts, and tenderloin to an internal temperature between 145° F. (medium rare) and 160° F. (medium), followed by a 3 minute rest. Since large cuts increase approximately 10° F. while resting, remove them from the heat at 150° F. followed by a 10 minute rest. "}, {"url": "http://culinaryarts.about.com/od/beefporkothermeats/r/Roast-Pork-Loin.htm", "passage_text": "Lacy Rane / Getty Images. To prepare this roast pork loin recipe, we first rub a boneless pork loin with a simple blend of garlic and seasonings, and then roast it to perfection. Note that the final target temperature for this pork loin roast is 140° to 145°F, which is medium. The interior will have a lovely rosy color. "}, {"url": "http://www.tonysmarket.com/common/recipes/StoreRecipe.asp?StoreID=5CB723477B4E43F88024DB82BE9E5BBF&RecipeID=2321", "passage_text": "Cooking to higher temperatures is not recommended. ---. Pork Roasts. For Pork loin and fresh ham roasts (a leg of pork that is not cured and smoked), remove from refrigerator and rest roast at cool room temperature; 30-60 minutes for small roasts and 60-90 minutes for larger roasts. Estimate roasting time, allowing 20 minutes per pound of roast"}, {"url": "http://www.answers.com/Q/What_is_the_best_temperature_to_cook_pork_roast_and_for_how_long", "passage_text": "You will first want to preheat your oven to 450 degrees. Cook the roast for 10 minutes then reduce the heat to 250 degrees. You in all will want to bake the roast for 90 … minutes in total including the 10 minutes of high temperature cooking. The roast must be cold when you start this recipe. It will also cook more evenly if it is tied into a compact cylinder. Adjust the oven rack to center position and preheat to 475 degrees F. Take the meat directly from refrigerator and place on a cake rack set in a shallow roasting pan. Roast exactly 30 minutes."}, {"url": "http://startcooking.com/how-to-cook-a-pork-roast", "passage_text": "Remove the roast from the oven and set on a cutting board. Cover the meat with tin foil and let it rest for about 15 minutes before slicing it. The temperature of the roast will continue to rise about another 5 degrees. Always position the pork roast in the pan so that fat side is on the top. Measure one tablespoon of olive oil in a small dish. Add 1 Tablespoon of dried spices to the oil. You can use rosemary, sage, thyme, or oregano; or a combination of these that equal 1 tablespoon."}, {"url": "http://startcooking.com/how-to-cook-a-pork-roast", "passage_text": "WIth a roast, you generally want to cook to an internal temperature, not a time. But, when you lay it out butterflied, it’s thinner and more of the meat is exposed to heat, so if you were to cook it at 350 degrees at a 1/2 hour/lb. a 6 lb roast would end up ruinously overdone. Always position the pork roast in the pan so that fat side is on the top. Measure one tablespoon of olive oil in a small dish. Add 1 Tablespoon of dried spices to the oil. You can use rosemary, sage, thyme, or oregano; or a combination of these that equal 1 tablespoon."}, {"url": "http://startcooking.com/how-to-cook-a-pork-roast", "passage_text": "Cooking a Loin Roast: There are many different ways to cook this roast. (Google lists over 1 million options!) According to the Joy of Cooking, cooking the roast for 10 minutes at 450 F. degrees and then reducing the temperature to 250 F. will ensure a tender, moist, flavorful roast. Always position the pork roast in the pan so that fat side is on the top. Measure one tablespoon of olive oil in a small dish. Add 1 Tablespoon of dried spices to the oil. You can use rosemary, sage, thyme, or oregano; or a combination of these that equal 1 tablespoon."}, {"url": "http://www.foodnetwork.com/recipes/paula-deen/barbecue-pork-roast-recipe.html#!", "passage_text": "Preheat oven to 325 degrees F. Remove roast from bag, place in a roasting pan, and discard marinade. Roast pork loin at 325 degrees F for 2 to 2 1/2 hours, or to an internal temperature registers 160 to 170 degrees F. on an instant-read thermometer. Serve with BBQ sauce. Recipe courtesy of Paula Deen."}, {"url": "http://startcooking.com/how-to-cook-a-pork-roast", "passage_text": "Cooking to this temp, then allowing the roast to rest for 15 minutes after removing from the oven, will take the roast to approximately 150 degrees, at which point you can serve it and it will be the juiciest, most tender pork you can get. Don’t mind it if it’s a bit pink in the middle – it’s ok. Always position the pork roast in the pan so that fat side is on the top. Measure one tablespoon of olive oil in a small dish. Add 1 Tablespoon of dried spices to the oil. You can use rosemary, sage, thyme, or oregano; or a combination of these that equal 1 tablespoon."}]