[{"url": "http://www.nutrition.gov/whats-food", "passage_text": "Learn what food group a food belongs in and find out how many calories and nutrients it contains. Also do a side-by-side comparison for two different foods. Nutritive Value of Foods, Home and Garden Bulletin No. 72 (HG-72) USDA. ARS. Nutrient Data Laboratory. Look up the amount of calories, fat, protein, vitamins, minerals and more contained in foods using the. 's on-line searchable database. This is an up-to-date and comprehensive source for nutrients amounts in food."}, {"url": "https://en.wikipedia.org/wiki/Foodstuffs", "passage_text": "The first Foodstuffs co-operative was formed in Auckland in 1922. On 6 July 1922, Foodstuffs founder J Heaton Barker called together members of the Auckland Master Grocers' Association to discuss plans for the formation of a co-operative buying group. The buying group expanded in 1925 with the introduction of Four Square branding on members' stores. The household name Four Square emerged in the 1920s out of the Foodstuffs grocery buying co-operative. Foodstuffs’ founder, Mr J Heaton Barker, became concerned at the activities of the grocery chain stores of the day that were making life very difficult for independent grocers in Auckland."}, {"url": "http://www.merriam-webster.com/dictionary/foodstuff", "passage_text": "Full Definition of FOODSTUFF. : a substance with food value; specifically: the raw material of food before or after processing. See foodstuff defined for English-language learners. See foodstuff defined for kids. Definition of FOODSTUFF for Kids. : a substance that is used as food."}, {"url": "http://www.thefreedictionary.com/food", "passage_text": "food. n. 1. Material, usually of plant or animal origin, that contains or consists of essential body nutrients, such as carbohydrates, fats, proteins, vitamins, or minerals, and is ingested and assimilated by an organism to produce energy, stimulate growth, and maintain life. 2."}, {"url": "https://en.wikipedia.org/wiki/Foodstuffs", "passage_text": "Foodstuffs, officially Foodstuffs (NZ) Ltd is a group of two New Zealand grocery and liquor retailers' cooperatives based in the North Island and the South Island which collectively control an estimated 52% of the New Zealand grocery market. The household name Four Square emerged in the 1920s out of the Foodstuffs grocery buying co-operative. Foodstuffs’ founder, Mr J Heaton Barker, became concerned at the activities of the grocery chain stores of the day that were making life very difficult for independent grocers in Auckland."}, {"url": "http://www.merriam-webster.com/dictionary/food", "passage_text": "Definition of FOOD for Kids. 1. : the material that people and animals eat: material containing carbohydrates, fats, proteins, and supplements (as minerals and vitamins) that is taken in by and used in the living body for growth and repair and as a source of energy for activities. 2. 1. : material consisting essentially of protein, carbohydrate, and fat used in the body of an organism to sustain growth, repair, and vital processes and to furnish energy; also: such material together with supplementary substances (as minerals, vitamins, and condiments). 2. : nutriment in solid form."}, {"url": "http://www.merriam-webster.com/dictionary/foodstuff", "passage_text": "foodstuff. noun food·stuff \\ˈfued-ˈfüd\\. : ˌstəf a substance that is used as. food noun·food \\stuff-ˈfued\\. ˈfüd ˌstəf Definition of FOODSTUFF for Kids. : a substance that is used as food."}, {"url": "https://en.wikipedia.org/wiki/Foodstuffs", "passage_text": "On 7 February 2013 Foodstuffs (Auckland) Ltd and Foodstuffs (Wellington) Co-operative Society Ltd announced that a merger was being planned to bring the two companies together under the name Foodstuffs North Island Ltd. The household name Four Square emerged in the 1920s out of the Foodstuffs grocery buying co-operative. Foodstuffs’ founder, Mr J Heaton Barker, became concerned at the activities of the grocery chain stores of the day that were making life very difficult for independent grocers in Auckland."}]