[{"url": "http://healthypets.mercola.com/sites/healthypets/archive/2013/11/04/antibody-titers.aspx", "passage_text": "Recently, California passed legislation to allow rabies vaccines at 12 weeks vs. 16 weeks, which caused a lot of controversy and will continue to do so. As to the question of how long rabies vaccines last, according to titer tests, antibodies can remain in an animal’s blood for seven to nine years, and perhaps longer. "}, {"url": "http://www.ccohs.ca/oshanswers/diseases/rabies.html", "passage_text": "In people, the incubation period (the time between initial contact with the virus and onset of the disease) generally ranges from two to eight weeks. In rare cases, it can vary from 10 days to 2 years. The incubation period is shorter in children and in people exposed to a large dose of the rabies virus. The dose of virus depends on the size, severity and location of an animal bite or scratch. In animals, the incubation period depends on the species of animal. "}, {"url": "http://www.health.state.mn.us/divs/idepc/diseases/rabies/risk/specimens.html", "passage_text": "1 Of these, 682 (2.54%) tested positive for rabies. 2  Skunks and bats form the two wildlife rabies reservoirs in Minnesota and were the animals most commonly found to be rabid. 3  Skunks had the highest number and the greatest proportion (288/595; 48%) of positive samples from 2003 to 2013. The only test for rabies in animals that may be used to guide human rabies risk analysis is the direct fluorescent antibody (DFA) test. There is no live animal test for rabies. The animal’s brain, specifically sections of the medulla, cerebellum, and hippocampus are required to perform the DFA test."}, {"url": "http://www.cdc.gov/rabies/diagnosis/animals-humans.html", "passage_text": "Diagnosis in animals. A diagnosis of rabies can be made after detection of rabies virus from any part of the affected brain, but in order to rule out rabies, the test must include tissue from at least two locations in the brain, preferably the brain stem and cerebellum. The test requires that the animal be euthanized. The test itself takes about 2 hours, but it takes time to remove the brain samples from an animal suspected of having rabies and to ship these samples to a state public health or veterinary diagnostic laboratory for diagnosis."}, {"url": "http://pets.webmd.com/cats/rabies-cats", "passage_text": "There is no accurate test to diagnose rabies in live animals. The direct fluorescent antibody test is the most accurate test for diagnosis, but it can only be performed after the death of the animal. The rabies virus can incubate in a cat’s body anywhere from just one week to more than a year before becoming active. When the virus does become active, symptoms appear quickly. Rabies is most often transmitted through a bite from an infected animal. Less frequently, it can be passed on when the saliva of an infected animal enters another animal’s body through mucous membranes or an open, fresh wound. The risk for contracting rabies runs highest if your cat is exposed to wild animals."}, {"url": "https://en.wikipedia.org/wiki/Rabies_testing", "passage_text": "Since the 1960s, the standard test for rabies has been Direct fluorescent antibody test (dFA test). Because rabies is present in nervous tissue (and not blood like many other viruses), it is best to test for rabies in brain tissue. "}, {"url": "http://www.cdc.gov/rabies/specific_groups/veterinarians/testing.html", "passage_text": "The direct fluorescent antibody test (dFA) is the test most frequently used to diagnose rabies. This test requires brain tissue from animals suspected of being rabid and can only be performed post-mortem. Rabies testing should be performed in accordance with the established national standardized protocol for rabies testing by a qualified laboratory that has been designated by the local or state health department."}, {"url": "http://www.kingcounty.gov/healthservices/health/communicable/diseases/bats.aspx", "passage_text": "Most bats, however, do not carry rabies, and most of the bats tested for rabies in Washington are not infected. Because rabies is a life threatening disease, medical advice must be sought promptly if a bat comes into contact with humans or animals. Rabies may also be carried by other mammals. "}, {"url": "http://pets.webmd.com/cats/rabies-cats", "passage_text": "Symptoms can be varied and can take months to develop. Classic signs of rabies in cats are changes in behavior (including aggression, restlessness and lethargy), increased vocalization, loss of appetite, weakness, disorientation, paralysis, seizures and even sudden death. Rabies is most often transmitted through a bite from an infected animal. Less frequently, it can be passed on when the saliva of an infected animal enters another animal’s body through mucous membranes or an open, fresh wound. The risk for contracting rabies runs highest if your cat is exposed to wild animals."}, {"url": "http://rabies.emedtv.com/rabies/rabies-testing.html", "passage_text": "Rabies testing in humans involves several tests. No single test is sufficient to diagnose rabies in humans. Rabies tests are performed on samples of saliva, serum (blood), spinal fluid, and skin biopsies of hair follicles at the nape of the neck. This test requires brain tissue from animals suspected of being rabid. The test can only be performed post-mortem (after the animal is dead). Rapid and accurate testing for rabies in humans and other animals is essential."}]