[{"url": "http://www.gyanunlimited.com/education/company-secretary-jobs-in-india-and-abroad-career-in-company-secretary/6439/", "passage_text": "Company Secretary Course Fees. The course fees for different stages of company secretary are nominal. The fee for the Company Secretary Foundation Course is Rs 3600. For the Intermediate Course or the Executive Programme, it is Rs 7, 000 for commerce graduate and Rs 75 00 for professional programme. ICSI Branches. ICSI is the only institute which is the only institute which offers this course and award and designation of company secretary. Admission for the course is open throughout the year and examinations are held in June and December. ICSI has 117 examination centres scattered across the country including Dubai centres."}, {"url": "https://nationalcareersservice.direct.gov.uk/advice/planning/jobprofiles/Pages/companysecretary.aspx", "passage_text": "Starting salaries are usually around £35,000 a year. With experience average salaries can rise to around £50,000 a year. Senior company secretaries can earn around £70,000 a year. Top salaries can be between £100,000 and £150,000 a year. Figures are intended as a guideline only"}, {"url": "http://www.payscale.com/research/IN/Job=Corporate_Secretary/Salary", "passage_text": "Corporate Secretary Salary. (India). The average salary for a Corporate Secretary is Rs 502,965 per year. A skill in Corporate Governance is associated with high pay for this job. Most people with this job move on to other positions after 20 years in this field. Rs 247,949 - Rs 1,411,360. "}, {"url": "http://plancareer.org/en/career/12/1159/company-secretary-career-option-and-requirements.html", "passage_text": "Company secretaries generally earn an amount that is proportional to their level of experience in the field. As a result, the starting salaries are generally modest, but there is a lot of room for increase in salary. In the UK, the average starting salary generally ranges between £29,000 and £33,000. Experienced company secretaries can earn anywhere up to £200,000 per annum if they work for larger public limited companies. In India, the monthly starting salary can be anywhere between Rs. While most company secretaries do not leave the office much, some are required to travel from the head office of the firm they work at to all divisions to see that no day to day operations are contradicting the law."}, {"url": "http://entrance-exam.net/salaries-after-company-secretary-course/", "passage_text": "It is easier to find jobs in major cities in India which includes Mumbai, Delhi, Chennai, Pune, Hyderabad, Gurgaon, Bangalore, Chandigarh, Kolkata and Ahmedabad. Salaries after Company Secretary in Government Organizations. There are number of government organizations that recruit efficient company secretaries. The remuneration for these professionals in government firms are higher compared to the private sectors. A fresher in this field can earn from Rs.20, 000 per month. This will vary from company to company. The remuneration for an experienced professional will increase accordingly. For a beginner the starting salary will be from Rs.15, 000 to Rs.18, 000 and for 2 to 3 years experienced professional it will range from Rs.18, 000 to Rs.3"}, {"url": "http://entrance-exam.net/salaries-after-company-secretary-course/", "passage_text": "A company secretary professional with 5 and more years experience can earn up to Rs.50, 000 per month. Remuneration after Company Secretary in Private Practice in India and Abroad. The company secretary professionals have wide career opportunities in abroad also. They can work within various organizations. This will vary from company to company. The remuneration for an experienced professional will increase accordingly. For a beginner the starting salary will be from Rs.15, 000 to Rs.18, 000 and for 2 to 3 years experienced professional it will range from Rs.18, 000 to Rs.3"}, {"url": "http://www.payscale.com/research/ZA/Job=Corporate_Secretary/Salary", "passage_text": "A Corporate Secretary earns an average salary of R446,217 per year. People in this job generally don't have more than 20 years' experience. The highest paying skills associated with this job are Corporate Governance and Legal Compliance. "}, {"url": "http://www.gyanunlimited.com/education/company-secretary-jobs-in-india-and-abroad-career-in-company-secretary/6439/", "passage_text": "Company Secretary Salary. Since the job of CS is demanding in the corporate world, so remuneration for the experienced and hard working person is the best in the market. The fresher when join as a junior secretarial officer may be given Rs 20-25 thousands per month. ICSI is the only institute which is the only institute which offers this course and award and designation of company secretary. Admission for the course is open throughout the year and examinations are held in June and December. ICSI has 117 examination centres scattered across the country including Dubai centres."}, {"url": "http://mbadiscussions.com/cs-course-duration-its-starting-salary-13226.html", "passage_text": "I have heard that ca is much time consuming and since i have to do mba from abroad I also want to know that what is the salary of a cs with b.com llb mba(finance). If mba is done from abroad and llb from distant learning course. The Company Secretary course is conducted by Institute of Company Secretary of India. "}, {"url": "http://www1.salary.com/Secretary-I-salary.html", "passage_text": "For example the median expected annual pay for a typical Secretary I in the United States is $35,532 so 50% of the people who perform the job of Secretary I in the United States are expected to make less than $35,532. "}]