[{"url": "http://www.catster.com/lifestyle/cat-behavior-five-facts-sleep", "passage_text": "1. Cats can sleep as much as 16 hours a day, and older cats spend even more time at rest — as much as 20 hours a day. That sleeping habit is a result of the cat’s evolution, nutritional habits, and physiology."}, {"url": "http://www.vetinfo.com/kitten-sleeping-too-much.html", "passage_text": "Regular Cat Sleeping Hours. Mature cats sleep on average up to 16 hours per day. Kittens sleep 16 to 18 hours per day. Newborn kittens sleep almost all the time. In time, kittens start sleeping less and less, until their sleeping hours are equivalent to 16 hours. The sleeping hours depend on the cat's age and lifestyle."}, {"url": "http://www.petmd.com/cat/behavior/evr_ct_why_do_cats_sleep_so_much", "passage_text": "ADVERTISEMENT. Cats sleep an average of fifteen hours a day, and some can sleep up to twenty hours in a twenty-four hour period. Which raises the question: Why do cats sleep so much?"}, {"url": "http://www.vetinfo.com/kitten-sleeping-too-much.html", "passage_text": "Kittens sleep 16 to 18 hours per day. Newborn kittens sleep almost all the time. In time, kittens start sleeping less and less, until their sleeping hours are equivalent to 16 hours. The sleeping hours depend on the cat's age and lifestyle."}, {"url": "https://sg.answers.yahoo.com/question/index?qid=20071004184319AAPqSbQ", "passage_text": "She'll probably sleep about 16-20 hours a day. Some of that time will be spent in deep sleep and some of it just dozing. In the wild, the big cats do the same thing. The few hours left of the day are for hunting, eating, socializing and bathing."}, {"url": "http://www.answers.com/Q/How_long_do_tabby_kittens_sleep_for", "passage_text": "Kittens can sleep anywhere between 16 and 20 hours a day, depending on the age of the kitten and how active it is."}, {"url": "http://www.catsofaustralia.com/care-new-kitten.htm", "passage_text": "Young kittens are like babies, they need to be fed several times a day. Kittens younger than 6 weeks ideally should still be with their mother. As a rule of thumb kittens aged between 6 weeks and 12 weeks need four or more meals a day. Their stomachs are very small and they can't eat a lot at a time."}]