[{"url": "http://www.steadyhealth.com/topics/persistent-tapping-or-clicking-inside-right-ear", "passage_text": "CaroleL. There is a condition called Tinitis (not sure on the spelling of it), Its a condition where you have noises in your ears. Usally people say a ringing, but i believe it could be any constant noise. Google it an see if you can relate to it."}, {"url": "http://www.healthgrades.com/symptoms/ear-sounds", "passage_text": "The sound of buzzing or ringing in your ears in the absence of audible noise can be annoying. The symptom caused by a medical condition called tinnitus. Ear sounds may mimic noises, such as buzzing, ringing, clicking, hissing, clanging or wheezing. They can be present in one or both ears, constant or intermittent."}, {"url": "http://www.fauquierent.net/earclicking.htm", "passage_text": "The tensor tympani attaches to the malleus ossicle (the hammer of the 3 middle ear bones) and the stapedius muscle attaches to the stapes ossicle (the stirrup). Just like any muscle in the body, these muscles can also twitch rapidly causing the clicking noise in the ear. Tensor tympani muscle spasms typically produce a clicking sound whereas stapedius muscle spasms produce more of a buzz/click sound. Every once in awhile, I see a patient who complains of an irregular clicking (or vibration-like) noise in one or both ears that occurs in bursts and may last anywhere from a few minutes every few days to as long as days or weeks at a time."}, {"url": "https://answers.yahoo.com/question/index?qid=20090321141310AASpkDd", "passage_text": "I have this really wierd clicking noise in my ear, i get it sometimes when i swallow or i can make the clicking noise. I do use listen to my music a lot with earphones and i clean my ears with those things which i heard ruins your hearing a bit, My hearing has gone a bit but i can still hear! I'm 16. If you can actuall feel the clicking and it is, in fact, in your ear, I would get to a doc. Typically ear damage causes some type of pain, but every case is different. The problems with ears is that damage can often be irreversable. In the future, limit you headphone usage and keep the volume lower. Hope this helps!"}, {"url": "http://www.entcarolina.com/education-noise-ears.php", "passage_text": "I sometimes hear ringing in my ears and noise in my ears. Not at all. Tinnitus is the name for these head noises, and they are very common. Nearly 36 million other Americans suffer from this discomfort. Tinnitus may come and go, or you may be aware of a continuous sound. It can vary in pitch from a low roar to a high squeal or whine and you may hear it in one or both ears. "}, {"url": "https://www.sharecare.com/health/tinnitus-ringing-in-ear/hear-clicking-sound-my-ears", "passage_text": "A Honor Society of Nursing (STTI) answered. A clicking sound in your ears could be objective tinnitus, a rare condition in which blood vessels or muscles near your ears make noises you can hear. The clicking sound can be caused by muscle spasms, which may come in spurts. "}, {"url": "http://www.healthgrades.com/symptoms/buzzing-in-ears", "passage_text": "The sound of buzzing or ringing in your ears in the absence of audible noise can be annoying. The symptom caused by a medical condition called tinnitus, which produces a sound that may resemble ringing, buzzing, clicking, hissing, clanging or wheezing. They can be present in one or both ears, constant or intermittent."}, {"url": "https://answers.yahoo.com/question/index?qid=20090321141310AASpkDd", "passage_text": "Best Answer: The clicking your hearing is probably not in the ear itself, but most likely the fluids in and around your jawbones. This may be relieved by yawning and stretching your jaw out. If it persists or causes discomfort you may want to check with your doc. If you can actuall feel the clicking and it is, in fact, in your ear, I would get to a doc. Typically ear damage causes some type of pain, but every case is different. The problems with ears is that damage can often be irreversable. In the future, limit you headphone usage and keep the volume lower. Hope this helps!"}, {"url": "http://www.medicinenet.com/tinnitus_ringing_in_the_ears/article.htm", "passage_text": "Tinnitus facts. 1  Tinnitus is abnormal ear noise. 2  Tinnitus can arise in any of the four sections of the ear: the outer ear, the middle ear, the inner ear, and the brain. 3  In addition to ringing in the ears, other symptoms associated with tinnitus include: 1 Tinnitus is abnormal ear noise. 2  Tinnitus can arise in any of the four sections of the ear: the outer ear, the middle ear, the inner ear, and the brain. 3  In addition to ringing in the ears, other symptoms associated with tinnitus include: 4  Stress due to fear of tinnitus. 5  Ear pain. 6  Anxiety. 7  Depression. 8  Difficulty sleeping."}]