[{"url": "https://en.wikipedia.org/wiki/Urethroplasty", "passage_text": "In surgery, urethroplasty is the repair of an injury or defect within the walls of the urethra. There are four commonly used types of urethroplasty performed; anastomotic, buccal mucosal onlay graft, scrotal or penile island flap (graft), and Johansen's urethroplasty. The choice of procedure is dependent on factors including: 1  physical condition of the patient"}, {"url": "https://en.wikipedia.org/wiki/Urethroplasty", "passage_text": "With an average operating room time of between three and eight hours, urethroplasty is not considered a minor operation. Patients who undergo a shorter duration procedure may have the convenience of returning home that same day (between 20% and 30% en total of urethroplasty patients). There are four commonly used types of urethroplasty performed; anastomotic, buccal mucosal onlay graft, scrotal or penile island flap (graft), and Johansen's urethroplasty."}, {"url": "http://medical-dictionary.thefreedictionary.com/urethroplasty", "passage_text": "sling urethroplasty. a surgical technique for increasing proximal urethral resistance in the management of urinary incontinence. Seromuscular flaps, dissected from the midtrigone area, are reflected around the bladder neck and proximal urethra and sutured together, creating a constricting band. Perineal uretroplastide suprapubik sistoskopi kullanimi / The use of ... by Horuz, Rahim; Goktas, Cemal; cetinel, Ali Cihangir; Akca, Oktay; Selimoglu, Ahmet; Albayrak' Selami / Turkish Journal of Urology."}, {"url": "https://en.wikipedia.org/wiki/Urethral_stricture", "passage_text": "Urethroplasty refers to any open reconstruction of the urethra. Success rates range from 85% to 95% and depend on a variety of clinical factors, such as stricture etiology, length, location, and caliber. Urethroplasty can be performed safely on men of all ages. In the bulbar urethra, the most common types of urethroplasty are anastomotic (with or without preservation of corpus spongiosum and bulbar arteries) and substitution with buccal mucosa graft, full-thickness skin graft, or split thickness skin graft."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/11371881", "passage_text": "In 46 (49%) of the patients urethroplasty was performed as primary repair, and in 47 (51%) after previously failed urethrotomy. The strictures were localized in the bulbous urethra without involvement of penile or membranous tracts. RESULTS: In our 93 patients primary urethroplasty had a final success rate of 85%, and after failed urethrotomy 87%. Previously failed urethrotomy did not influence the long-term outcome of urethroplasty. The long-term results of different urethroplasty techniques had a final success rate ranging from 77% to 96%. CONCLUSIONS: We conclude that failed urethrotomy does not condition the long-term result of surgical repair"}, {"url": "http://www.merriam-webster.com/medical/urethroplasty", "passage_text": "Medical Definition of URETHROPLASTY. : plastic surgery of the urethra. What made you want to look up urethroplasty? Please tell us where you read or heard it (including the quote, if possible). View Seen & Heard Highlights from Around the Site. "}, {"url": "http://www.urology.wustl.edu/en/Patient-Care/Urethral-Stricture-Disease/Urethral-Stricture-Evaluation", "passage_text": "An anterior urethral stricture is a scar of the urethral epithelium (the urethra’s outside layer of cells) and commonly extends into the underlying corpus spongiosum (a column of erectile tissue that surrounds the urethra). The scar (stricture) is composed of dense collagen and fibroblasts (proteins that form cell-producing connective tissue) and thus contracts in all directions, shortening urethral length and narrowing the diameter of the urethra. Strictures usually do not cause symptoms until the urethra tube is below a certain size."}, {"url": "http://healthcare.utah.edu/urology/reconstructive-male/urethral-strictures/uretheral-surgery-urethroplasty.php", "passage_text": "Urethroplasty is a surgery where the urethra is reconstructed to cure problems like urethral strictures. The types of surgeries are varied and depend upon the location, cause, and length of the stricture. When patients return to clinic the bladder is filled with x-ray contrast and the catheter is gently removed. While x-rays are being taken, the patient voids and the area of the surgery is evaluated. If the area of surgery is healed, then the catheter is left out and patients begin to void normally."}, {"url": "http://www.definitions.net/definition/urethroplasty", "passage_text": "Urethroplasty is a generalized term used to define a class of Surgery intended for the repair of an injury or defect within the walls of the urethra. "}]