[{"url": "http://www.livestrong.com/article/520996-vitamins-for-tmj/", "passage_text": "TMJ disorders are usually caused by a blow or an impact to your jaw, joint erosion and arthritis damage. However, muscle fatigue and muscle tension can cause TMJ disorders, especially if you habitually clench your jaw or grind your teeth. The TM joint is located on either side of your face just in front of your ears, where your skull and jawbone meet. Certain vitamin supplements can help reduce the symptoms associated with TMJ either by affecting your muscles directly, or by treating the underlying causes of TMJ disorders."}, {"url": "http://www.earthclinic.com/cures/jaw-bone-pain-alternative-remedies.html", "passage_text": "Beyond sharp and/or chronic jaw pain, sufferers may also experience symptoms such as jaw clicks (particularly when eating), muscle fatigue in the face, a locked jaw, ear pain, and headaches. Causes of jaw pain can include a facial injury, habitual clenching of the jaw, and grinding of the teeth. Oro-facial massage, stretching of the jaw muscles, and anti-inflammatory supplements such as omega-3 oils or green tea extracts may help reduce tension and inflammation in the jaw thereby reducing jaw pain."}, {"url": "http://www.medicinenet.com/jaw_pain/symptoms.htm", "passage_text": "Temporomandibular Joint Syndrome (TMJ) Temporomandibular joint (TMJ) syndrome is a disorder that causes symptoms like pain, clicking, and popping of the jaw. TMJ is...learn more ». In This Article. Temporomandibular Joint Syndrome (TMJ) Article. 1  Temporomandibular joint (TMJ) syndrome facts. Injury to or disorders of these structures can all result in pain in the jaw area. Jaw pain may occur on one side or on both sides, depending upon the cause. Also depending upon the exact cause, the pain may occur when chewing or may occur at rest."}, {"url": "http://www.medicinenet.com/jaw_pain/symptoms.htm", "passage_text": "The temporomandibular joints are complex structures containing muscles, tendons, and bones. Injury to or disorders of these structures can all result in pain in the jaw area. Jaw pain may occur on one side or on both sides, depending upon the cause. Also depending upon the exact cause, the pain may occur when chewing or may occur at rest."}, {"url": "http://www.livestrong.com/article/545139-vitamin-d-deficiency-jaw-pain/", "passage_text": "Vitamin D Deficiency & Jaw Pain. Jaw pain may be related to a vitamin D deficiency. Photo Credit Digital Vision/Digital Vision/Getty Images. Many people suffer from jaw pain caused by problems with the temporomandibular joint, also known as TMJ, a joint located near your ear that allows your lower jaw to function. While vitamin D supplementation may help symptoms of jaw pain, there's not enough clinical research to fully support its benefits. If you suffer from chronic jaw pain, see a dentist. A number of treatments can help your symptoms. Inform your doctor if you choose to use a vitamin D supplement"}, {"url": "http://www.medicinenet.com/jaw_pain/symptoms.htm", "passage_text": "Additionally, other medical conditions not related to the TMJ may cause perceived pain in the jaw area. One of the most characteristic of these is the pain associated with coronary artery disease (angina) or heart attack, which typically occurs in the chest but can radiate (spread) to the jaw area. Injury to or disorders of these structures can all result in pain in the jaw area. Jaw pain may occur on one side or on both sides, depending upon the cause. Also depending upon the exact cause, the pain may occur when chewing or may occur at rest."}, {"url": "http://www.medicinenet.com/jaw_pain/symptoms.htm", "passage_text": "Trigeminal neuralgia is a condition of the nervous system that causes extreme facial pain that sometimes involves the jaw area. Jaw pain can be associated with other symptoms, including. 1  a popping sensation, 2  tooth pain, 3  difficulty chewing, 4  tenderness and aching of other areas of the face or neck. Injury to or disorders of these structures can all result in pain in the jaw area. Jaw pain may occur on one side or on both sides, depending upon the cause. Also depending upon the exact cause, the pain may occur when chewing or may occur at rest."}, {"url": "http://www.webmd.com/oral-health/toothache", "passage_text": "The most common areas include the jaw joint (temporomandibular joint or TMJ), ear pain, and even occasional heart problems. Bacteria growing inside your mouth can contribute to gum disease and dental decay, both of which can cause pain. Oftentimes, gum disease will not result in any pain. Toothache occurs from inflammation of the central portion of the tooth called pulp. The pulp contains nerve endings that are very sensitive to pain. Inflammation to the pulp or pulpitis may be caused by dental cavities, trauma, and infection. Referred pain from the jaw may cause you to have symptoms of a toothache."}, {"url": "http://www.livestrong.com/article/545139-vitamin-d-deficiency-jaw-pain/", "passage_text": "While there's not much evidence that specifically links jaw pain with a vitamin D deficiency, research has shown that low levels of vitamin D can contribute to pain all over your body. Vitamin D supplementation may provide benefits for pain relief for people with a vitamin D deficiency. While vitamin D supplementation may help symptoms of jaw pain, there's not enough clinical research to fully support its benefits. If you suffer from chronic jaw pain, see a dentist. A number of treatments can help your symptoms. Inform your doctor if you choose to use a vitamin D supplement"}]