[{"url": "http://home.costhelper.com/swimming-pool.html", "passage_text": "1 Installing an aboveground pool can cost $1,500-$5,000; for in-ground estimated costs are $7,000-$16,000 for a vinyl-lined model, $15,000-$25,000 for a fiberglass shell and $17,000-$45,000 for concrete or gunite. 2  However, custom designs can run prices much higher. "}, {"url": "http://www.fixr.com/costs/build-swimming-pool", "passage_text": "1 The vinyl is the least expensive with a standard cost of roughly $18,000. 2  The fiberglass bump up the costs to $20,000 without installation. 3  There are also concrete and gunite pools that require around $20,000 to $50,000 to install. 1 Most pools begin with the liner, and they can be made from vinyl or fiberglass. 2  The vinyl is the least expensive with a standard cost of roughly $18,000. 3  The fiberglass bump up the costs to $20,000 without installation. 4  There are also concrete and gunite pools that require around $20,000 to $50,000 to install."}, {"url": "http://www.fixr.com/costs/build-swimming-pool", "passage_text": "For the purpose of this discussion, we will look at the costs associated with the installation of both kinds of modern swimming pools. According to P.K. Data the average cost of a 19' diameter above ground swimming pool is $6,243; while the average cost of a 32'x16' inground swimming pool is $21,919. 1 Most pools begin with the liner, and they can be made from vinyl or fiberglass. 2  The vinyl is the least expensive with a standard cost of roughly $18,000. 3  The fiberglass bump up the costs to $20,000 without installation. 4  There are also concrete and gunite pools that require around $20,000 to $50,000 to install."}, {"url": "http://homewyse.com/services/cost_to_install_pool_liner.html", "passage_text": "$2.06. Get an INSTANT estimate of the cost to Install a Pool Liner! Our free calculator uses recent, trusted data to estimate costs for your Pool Liner Installation project. For a basic 250 square feet project in zip code 47474, the benchmark cost to Install a Pool Liner ranges between $1.49 - $2.06 per square foot* . To estimate costs for your project: 1."}, {"url": "http://www.poolpricer.com/", "passage_text": "Understanding that this is a very rough figure, you can expect to pay $25,000-50,000 for an inground pool. Of course, that’s assuming a pool of average size, in an average city with the average cost of living, average extras, and average materials. Of course, you probably aren’t average. Here’s a list of things that determine the final cost of installing an inground pool. Size. The size of the pool is the biggest factor in determining how much it costs. For every square foot, expect to pay around $50. Depth. This is part of the pool’s size, but it’s worth calling attention to it separately."}, {"url": "http://www.improvenet.com/r/costs-and-prices/swimming-pool-installation-cost-prices", "passage_text": "Inground vs. Above Ground Pool Costs. The biggest determining factor in the cost of your swimming pool will be whether you choose an inground or above ground option. On average, the cost of installing a new swimming pool runs between $14,961 and $21,649. However, that is more accurate for pools installed in-ground. Choosing a pool installed at the ground level won't require excavation, which keeps costs much lower."}, {"url": "http://www.fixr.com/costs/inground-vinyl-liner-swimming-pool", "passage_text": "The cost of an average in-ground vinyl-liner swimming pool varies by location, shape, size, and decorative quality of the finish and surroundings. The typical 12' x 24' rectangular (288 sq.ft. of water surface area) vinyl-liner pool will cost around $58 per square foot. "}, {"url": "http://www.fixr.com/costs/build-swimming-pool", "passage_text": "1 The fiberglass bump up the costs to $20,000 without installation. 2  There are also concrete and gunite pools that require around $20,000 to $50,000 to install. 3  Most in-ground pools will also demand some sort of surrounding patio installation as well as a need for fencing (as required by law in many areas of the world). 1 Most pools begin with the liner, and they can be made from vinyl or fiberglass. 2  The vinyl is the least expensive with a standard cost of roughly $18,000. 3  The fiberglass bump up the costs to $20,000 without installation. 4  There are also concrete and gunite pools that require around $20,000 to $50,000 to install."}, {"url": "http://www.riverpoolsandspas.com/cost", "passage_text": "The installation costs of above ground pools usually run $1000-$3000, depending on the size and type of pool. Keep in mind that oval pools normally cost more to install than round pools, and the kits are also more expensive. Although its initial cost is normally $5,000-$10,000 less than a fiberglass or concrete pool, its long-term cost is often much more. With the average liner replacement costing around $4,000, one can easily make up the price difference within 10-15 years after the pool's installation."}]