[{"url": "http://www.wisegeek.com/what-is-a-psychomotor-test.htm", "passage_text": "Psychomotor tests are used to test candidates who want to train as laparoscopic surgeons. Children may be given a psychomotor test for diagnostic purposes if a developmental delay is suspected. Children must develop a number of psychomotor abilities before they can buckle or tie their own shoes. A range of basic skills are tested during a psychomotor test, from precision, dexterity, coordination and control to reaction times, stability, speed and coherence."}, {"url": "https://en.wikipedia.org/wiki/Psychomotor_learning", "passage_text": "In psychomotor learning research, attention is given to the learning of coordinated activity involving the arms, hands, fingers, and feet, while verbal processes are not emphasized. When learning psychomotor skills, individuals progress through the cognitive stages, the associative stage, and the autonomic stage. The cognitive stage is marked by awkward slow and choppy movements that the learner tries to control. The learner has to think about each movement before attempting it."}, {"url": "http://www.thefreedictionary.com/psychomotor+test", "passage_text": "test 1. n. 1. A procedure for critical evaluation; a means of determining the presence, quality, or truth of something; a trial: a test of one's eyesight; subjecting a hypothesis to a test; a test of an athlete's endurance. 2. And walloped me—and worse; She said I did not want a wife, I ought to have had a nurse. put through one’s paces To require another to display the full range of his abilities; to test another’s resources to the utmost. Paces here refers to the training steps or gaits of horses."}, {"url": "http://www.thefreedictionary.com/psychomotor+test", "passage_text": "5. test the water to make an exploratory or initial approach; sound out. n. 6. a method, practice, or examination designed to test a person or thing. 7. (Education) a series of questions or problems designed to test a specific skill or knowledge: an intelligence test. And walloped me—and worse; She said I did not want a wife, I ought to have had a nurse. put through one’s paces To require another to display the full range of his abilities; to test another’s resources to the utmost. Paces here refers to the training steps or gaits of horses."}, {"url": "http://www.thefreedictionary.com/psychomotor+test", "passage_text": "2. the trial of the quality of something: to put to the test. 3. a particular process or method for trying or assessing. 4. a set of problems, questions, etc., for evaluating abilities or performance. 5. a. a reaction used to identify or detect the presence of a chemical constituent. And walloped me—and worse; She said I did not want a wife, I ought to have had a nurse. put through one’s paces To require another to display the full range of his abilities; to test another’s resources to the utmost. Paces here refers to the training steps or gaits of horses."}, {"url": "http://www.wisegeek.com/what-are-psychomotor-abilities.htm", "passage_text": "Such abilities are based on applying a combination of more foundational psychomotor abilities, such as hand-eye coordination, multi-limb coordination, orientation, and control of movement speed. The cognitive, associative, and autonomic stages are the three main parts of the development of new psychomotor abilities. A baseball player, for instance, needs to develop his hand-eye coordination and reaction time more so than a normal person in order to consistently hit the ball. Psychomotor learning is the process by which individuals build the cognitive and physical connections necessary to gain such"}, {"url": "http://www.wisegeek.com/what-are-psychomotor-abilities.htm", "passage_text": "10 hilariously insightful foreign words. Psychomotor abilities are skills such as hand-eye coordination, balance, and reaction time that arise from a unity of cognitive and physical functions. A baseball player, for instance, needs to develop his hand-eye coordination and reaction time more so than a normal person in order to consistently hit the ball. Psychomotor learning is the process by which individuals build the cognitive and physical connections necessary to gain such abilities."}, {"url": "http://medical-dictionary.thefreedictionary.com/psychomotor", "passage_text": "pertaining to motor effects of cerebral or psychic activity. psychomotor test a test that assesses the subject's ability to perceive instructions and perform motor responses often including measurement of the speed of the reaction. "}, {"url": "https://en.wikipedia.org/wiki/Psychomotor_learning", "passage_text": "Psychomotor learning is the relationship between cognitive functions and physical movement. When learning psychomotor skills, individuals progress through the cognitive stages, the associative stage, and the autonomic stage. The cognitive stage is marked by awkward slow and choppy movements that the learner tries to control. The learner has to think about each movement before attempting it."}, {"url": "http://medical-dictionary.thefreedictionary.com/psychomotor+test", "passage_text": "psychomotor. pertaining to motor effects of cerebral or psychic activity. psychomotor test a test that assesses the subject's ability to perceive instructions and perform motor responses often including measurement of the speed of the reaction."}]