[{"url": "http://work.chron.com/nurse-practitioner-salary-va-hospital-2786.html", "passage_text": "In 2012, for example, the VA advertised for a nurse practitioner to manage the renal transplant program at a VA hospital in Birmingham, Alabama. The salary range for the position was listed as between $64,411.00 to $110,323 per year. At the same time, the VA advertised for a nurse practitioner to work in the bipolar and depression research program in California, with an annual salary of between $95,460 and $139,136."}, {"url": "http://work.chron.com/nurse-practitioner-salary-va-hospital-2786.html", "passage_text": "Salary Range. The salary for nurse practitioners in the VA varies, depending on the nurse practitioner’s experience, specialty certifications, and the duties he or she will perform, as well as the cost of living in the area of the country where you will be living."}, {"url": "http://swz.salary.com/salarywizard/layouthtmls/VA/swzl_compresult_state_VA_HC07000008.html", "passage_text": "Requires a master's degree in area of specialty, national board certification as a nurse practitioner in an area of specialty, 2-4 years of experience in the field or in a related area, and is licensed as a nurse practitioner. Familiar with a variety of the field's concepts, practices, and procedures."}, {"url": "http://www1.salary.com/TX/Arlington/Nurse-Practitioner-salary.html", "passage_text": "The salary for someone with the job title Nurse Practitioner in Arlington, TX varies depending on a number of factors."}, {"url": "http://money.usnews.com/careers/best-jobs/nurse-practitioner/salary", "passage_text": "Best Paying Cities for Nurse Practitioners. The highest paid in the nurse practitioner profession work in the metropolitan areas of Texarkana, Texas, Stockton, California, and San Jose, California."}, {"url": "http://work.chron.com/nurse-practitioner-salary-va-hospital-2786.html", "passage_text": "As an employee of the VA, nurse practitioners receive 26 days of vacation and personal leave annually, which can grow to 85 days annually, as of publication. You’ll also receive 10 paid holidays and 13 days of paid sick leave a year."}, {"url": "http://www1.salary.com/TX/Arlington/Nurse-Practitioner-salary.html", "passage_text": "Requires a master's degree in area of specialty, certification as a Certified Registered Nurse Practitioner (CRNP), and state authority for advanced practice. Familiar with a variety of the field's concepts, practices, and procedures."}, {"url": "http://money.usnews.com/careers/best-jobs/nurse-practitioner/salary", "passage_text": "The pay is good. In 2013, nurse practitioners made a median salary of $92,670. The highest-paid 10 percent earned $126,250 and the lowest-paid 10 percent earned $66,960. For the best salary potential, you should head to the metropolitan areas of Columbus, Indiana; Texarkana, Texas; or San Jose, California."}]