[{"url": "http://www.symptomfind.com/nutrition-supplements/what-food-to-avoid-if-you-acid-reflux/", "passage_text": "Foods To Avoid. If you have acid reflux disease, some of the foods you should avoid may seem obvious. For example, spicy foods are often linked to the symptoms of acid reflux disease. However, many of the foods which trigger acid reflux are not as obvious. 1  Acidic foods like tomatoes, citrus fruits and onions are among these seemingly innocuous foods. Fortunately, there are plenty of delicious foods that are safe for people with acid reflux to eat. Since acidic fruits and veggies, spicy foods and high-fat dishes are the main triggers for acid reflux, it's important to look for alternatives to these foods."}, {"url": "http://www.health.com/health/gallery/0,,20440834,00.html", "passage_text": "How to avoid heartburn. In Dropping Acid: The Reflux Diet Cookbook & Cure, authors Jamie Koufman, MD, Jordan Stern, MD, and French master chef Marc Bauer take a healthy eating approach to reducing acid reflux. The book’s staple foods offer plenty of variety and are geared toward reducing acid reflux. "}, {"url": "http://www.medicinenet.com/heartburn_pictures_slideshow/article.htm", "passage_text": "Heartburn Trigger: Fatty Foods. High-fat foods take longer to digest in the stomach and the longer foods remain in stomach, the higher the risk for heartburn symptoms to develop. The risk is much greater if you combine foods that are high in fat with a high volume of these fatty foods. Certain foods trigger heartburn and you need to identify the foods that trigger your heartburn. This slideshow may help you identify foods that may trigger heartburn and offers suggestions about how the risk for heartburn can be reduced."}, {"url": "http://www.webmd.boots.com/heartburn-gord/guide/heartburn-foods-to-avoid", "passage_text": "Avoid the foods and beverages above if you find they trigger heartburn-and eat smaller meals-and you may decrease the amount of reflux from your stomach into the oesophagus. Yet changing what you eat isn't the only way to avoid the horrors of heartburn; there are simple lifestyle changes you can make as well. Although heartburn can be triggered by different things for different people, certain food and drinks are more prone to allowing stomach acid to splash up into your oesophagus causing heartburn, including: 1  Meats. 2  Minced beef, marbled sirloin, chicken nugget-style and chicken wings."}, {"url": "http://www.webmd.com/heartburn-gerd/features/heartburn-foods-to-avoid", "passage_text": "Avoid the foods and beverages above -- and eat smaller meals -- and you may decrease the amount of reflux from your stomach into the esophagus. Yet changing what you eat isn't the only way to avoid the horrors of heartburn, there are simple lifestyle changes you can make as well. 1 | 2. Continue reading below... "}, {"url": "http://www.webmd.com/heartburn-gerd/ss/slideshow-heartburn-foods", "passage_text": "Heartburn Trigger: Acidic Foods. Acidic foods -- which include tomatoes and products that contain tomatoes (such as tomato sauce and salsa) and citrus fruits (such as oranges, grapefruits, and lemons) -- can trigger heartburn, especially if you eat them by themselves, on an empty stomach. The first thing to think about, in terms of curbing heartburn, isn't this or that specific food. It's the amount of food you eat at a time. When it comes to heartburn risk, the sheer volume of what you eat matters. And this is one case where bigger isn't better."}, {"url": "http://www.webmd.com/heartburn-gerd/ss/slideshow-heartburn-foods", "passage_text": "Heartburn Trigger: Fatty Foods. High-fat foods tend to stay in the stomach longer, and the longer they're there, the more likely discomfort can be, note Bonci and Elaine Magee, MPH, RD, author of Tell Me What to Eat If I Have Acid Reflux. The first thing to think about, in terms of curbing heartburn, isn't this or that specific food. It's the amount of food you eat at a time. When it comes to heartburn risk, the sheer volume of what you eat matters. And this is one case where bigger isn't better."}, {"url": "http://www.health.com/health/gallery/0,,20306843,00.html", "passage_text": "Avoid acid reflux. If you have gastroesophageal reflux disease (GERD), how you eat is almost as important as what you eat. That means slow it down, no late-night snacks, and don't hit the hay right after meals. But choosing food wisely is also key. Heartburn-Easing Foods That Fight GERD"}, {"url": "http://www.activebeat.com/diet-nutrition/15-heartburn-trigger-foods-control-acid-reflux/", "passage_text": "The type of food you eat and the quantity can exacerbate acid reflux, causing heartburn. If you suffer from heartburn, try eating smaller portions in 4-6 meals a day. Overloading your stomach can cause acid to leak into your esophagus. "}]