[{"url": "http://grammar.about.com/od/fh/g/hyperboleterm.htm", "passage_text": "Definition. Hyperbole is a figure of speech (a form of irony) in which exaggeration is used for emphasis or effect; an extravagant statement. Adjective: hyperbolic. Contrast with understatement"}, {"url": "https://en.wikipedia.org/wiki/Hyperbole", "passage_text": "Hyperbole (/haɪˈpɜrbəliː/ hy-PUR-bə-lee; Greek: ὑπερβολή, hyperbolē, exaggeration) is the use of exaggeration as a rhetorical device or figure of speech. In rhetoric, it is also sometimes known as auxesis (. growth). In poetry and oratory, it emphasizes, evokes strong feelings, and creates strong impressions. "}, {"url": "http://www.definitions.net/definition/hyperbole", "passage_text": "Hyperboles are exaggerations to create emphasis or effect. As a literary device, hyperbole is often used in poetry, and is frequently encountered in casual speech. An example of hyperbole is: The bag weighed a ton.. Hyperbole makes the point that the bag was very heavy, though it probably doesn't actually weigh a ton."}, {"url": "http://literaryterms.net/hyperbole/", "passage_text": "Examples of Hyperbole in Literature. We often use hyperbole in everyday speech, but we also use this figure of speech in prose and poetry. For example, in love poetry, the speaker uses hyperbole to emphasize intense passion and admiration for the beloved. Hyperbole (pronounced hahy-pur-buh-lee, not hyper-bowl) is an exaggeration which is obvious, extreme, and intentional. Hyperbole is used in order to stir up a strong emotion or response in the reader. It is important to note, though, that hyperbole should not be taken literally."}, {"url": "http://literarydevices.net/hyperbole/", "passage_text": "Hyperbole Definition. Hyperbole, derived from a Greek word meaning “over-casting” is a figure of speech, which involves an exaggeration of ideas for the sake of emphasis. It is a device that we employ in our day-to-day speech. For instance, when you meet a friend after a long time, you say, “Ages have passed since I last saw you”. It is important not to confuse hyperbole with simile and metaphor. It does make a comparison but unlike simile and metaphor, hyperbole has a humorous effect created by an overstatement. Let us see some examples from Classical English literature in which hyperbole was used successfully."}, {"url": "http://literary-devices.com/content/hyperbole", "passage_text": "Hyperbole. Definition: A hyperbole is a literary device wherein the author uses specific words and phrases that exaggerate and overemphasize the basic crux of the statement in order to produce a grander, more noticeable effect. The purpose of hyperbole is to create a larger-than-life effect and overly stress a specific point."}, {"url": "http://www.literarydevices.com/hyperbole/", "passage_text": "Definition of Hyperbole. Hyperbole is the use of obvious and deliberate exaggeration. Hyperbolic statements are often extravagant and not meant to be taken literally. These statements are used to create a strong impression and add emphasis"}, {"url": "http://www.shmoop.com/literature-glossary/hyperbole.html", "passage_text": "Hyperbole. Definition: Hyperbole is completely over-the-top exaggeration or overstatement—and one that's easily recognizable to readers. Like, I'm so hungry I could eat a horse or Ryan Gosling is so hot, I would jump into a giant pit of flaming snakes for him!. "}]