[{"url": "http://www.indeed.com/cmp/Wells-Fargo/salaries", "passage_text": "The average Wells Fargo salary ranges from approximately $15,000 per year for Data Entry Clerk to $320,000 per year for Business Development Officer."}, {"url": "http://www.huffingtonpost.com/2014/10/09/wells-fargo-email_n_5960072.html", "passage_text": "My estimate is that Wells Fargo has roughly around 300,000 employees. My proposal is take $3 billion dollars, just a small fraction of what Wells Fargo pulls in annually, and raise every employees annual salary by $10,000 dollars. This equates to an hourly raise about $4.71 per hour."}, {"url": "http://leechtishman.com/publications/countrywide-and-wells-fargo-accused-of-wage-and-hour-violations/", "passage_text": "Employers who willfully or repeatedly violate the minimum wage or overtime pay requirements are subject to a civil money penalty of up to $1,100 for each employee for each pay period in which a violation occurred. Wells Fargo is no stranger to claims of wage and hour non-compliance FLSA. In 2006,Wells Fargo agreed to pay $12.8 million to settle a lawsuit brought by its business systems consultants who alleged violations of the FLSA’s overtime rules."}, {"url": "http://www.answers.com/Q/How_much_does_wells_fargo_pay", "passage_text": "You start at $10 an hour with possible fifty cent increases every 3 months for completing training (paid training). You top out at $11.50 but you can receive increases on top … of that from your end of the year review with good performance in sales and service.  Ummm..."}, {"url": "http://www.huffingtonpost.com/2014/10/09/wells-fargo-email_n_5960072.html", "passage_text": "CEO John Stumpf makes 473 times more than the salary of a median employee, according to Bloomberg. That ratio of CEO-to-employee pay puts Wells Fargo at No. 33 among S&P 500 companies and third highest among financial institutions on the list. He earned $19.3 million in total compensation last year."}, {"url": "http://www.answers.com/Q/How_much_does_wells_fargo_pay", "passage_text": "In my area of New Jersey a teller at Wells Fargo Bank makes $13.00 an hour. That is roughly $13,520.00 a year for a part time teller doing 20 hours a week."}, {"url": "http://www.answers.com/Q/How_much_does_a_bank_teller_make_at_Wells_Fargo", "passage_text": "You start at $10 an hour with possible fifty cent increases every 3 months for completing training (paid training). You top out at $11.50 but you can receive increases on top of that from your end of the year review with good performance in sales and service. Ummm..."}]