[{"url": "http://www.duke-energy.com/ohio/savings/gas-usage-faq.asp", "passage_text": "One cubic foot of natural gas would fit in a cube, 12 inches square and 12 inches high. For more convenient billing, we measure and price gas in units of 100 cubic feet or CCF which is the unit of measure you will see on your natural gas bill. If a customer uses 5000 cubic feet of natural gas in a billing period, they would actually see their usage as 50 CCF on their bill. This corresponds with the rate tariff which will show the appropriate charge per CCF used."}, {"url": "http://www.eia.gov/pub/oil_gas/natural_gas/feature_articles/2010/ngtrendsresidcon/ngtrendsresidcon.pdf", "passage_text": "Per customer consumption fell in 16 out of the past 19 years. On a weather-adjusted basis, U.S. residential consumption over the 19-year period (1990-2009) fell from 95 thousand cubic feet (Mcf) per customer in 1990 to 74 Mcf in 2009, or 22 percent. This decline in average consumption per residential household more than offset the expanding number of customers, which increased from 50 million in 1990 to more than 65 million customers in 2008."}, {"url": "http://www.duke-energy.com/ohio/savings/gas-usage-faq.asp", "passage_text": "It is approximately the same amount of heat you would get from burning a wooden match. One cubic foot of natural gas has about 1,031 Btu. The amount of heat in one hundred cubic feet of natural gas (1 CCF) is about 103,000 Btu. Some natural gas suppliers will measure and bill the customer for each 100,000 Btu that is delivered and this is referred to as one therm of heat energy. If a customer uses 5000 cubic feet of natural gas in a billing period, they would actually see their usage as 50 CCF on their bill. This corresponds with the rate tariff which will show the appropriate charge per CCF used."}, {"url": "http://www.carbonindependent.org/sources_home_energy.html", "passage_text": "Most modern gas meters measure gas in cubic metres (m 3). The energy contained in gas is measured in kilowatt-hours (abbreviated to kWh) and for natural gas is 11.2 kWh per cubic metre. Older gas meters measure gas in hundreds of cubic feet - 100 cubic feet equal 2.83 cubic metres. So the energy contained in gas measured by an older gas meter is 31.7 kWh per 100 cubic feet. The CO. generated by burning natural gas is 0.185 kg / kWh [DEFRA, 18] ."}, {"url": "https://answers.yahoo.com/question/index?qid=20111222111145AAJXxn7", "passage_text": "All gas in the United States is measured in 1000 cubic feet, or mcf, A cube 10 ft x 10 ft x 10 ft filled with gas at 14.7 psi is pretty darn close to 1 mcf. 50 cubic feet of gas is not that much gas. I'm really surprised that they have limited you to that amount. I don't know what size house in which you are living, or where you live, but living on the Texas Gulf Coast (appx 30 miles north of Houston) we average 5200 cubic feet per month of natural gas usage."}, {"url": "http://www.energy.alberta.ca/NaturalGas/726.asp", "passage_text": "The average Albertan household uses about 120 GJs of natural gas a year. About 67 per cent of Canada s natural gas production is from Alberta. Alberta s total marketable natural gas production, including coalbed methane, was 3.72 trillion cubic feet in 2014. "}, {"url": "http://www.duke-energy.com/ohio/savings/gas-usage-faq.asp", "passage_text": "(Example; 40,000/1000 = 40 cubic feet.) Recall that your bill is based on units of one hundred cubic feet (CCF) so divide the cubic feet by 100 to determine how many CCF the appliance will use in one hour. (Example: 40/100 = .4) So the fireplace logs will use 40 cubic feet or .4CCF of gas per hour. If a customer uses 5000 cubic feet of natural gas in a billing period, they would actually see their usage as 50 CCF on their bill. This corresponds with the rate tariff which will show the appropriate charge per CCF used."}, {"url": "http://www.energy.gov.ab.ca/About_Us/1132.asp", "passage_text": "A typical well in Canada would produce 9,600 cubic metres of natural gas per day. A similar well in the U.S. would express its production as 338,800 cubic feet per day. The average home in Alberta uses about 120 gigajoules of natural gas per year. Examples of average energy consumption for standard household appliances include: 1  40 gigajoules a year to heat a 40-gallon hot water tank for a family of four. 2  4.3 gigajoules for a gas dryer processing 400 loads of laundry a year. 3  4.2 gigajoules a year for natural gas range used two hours"}]