[{"url": "http://www.babynamewizard.com/baby-name/girl/kaela", "passage_text": "Comments and insights on the name Kaela: | Edit. Share what you know! Personal experiences with the name Kaela: | Edit. My name is Kaela-Rae, and my parents spelled my name in this unique way so it would go well with Rae. I am always either asked how to spell my name, or getting it spelled with a y instead. I don't mind really, it just means that I have a creative, unique name! "}, {"url": "http://babynamescountry.com/meanings/Kaela.html", "passage_text": "Meaning: The Hebrew name Kaela means-beloved, sweetheart. A short form of Kalila, Kelila. Rating: Meaning: The Arabic name Kaela means-beloved, sweetheart. A short form of Kalila, Kelila. Rating:"}, {"url": "http://www.sheknows.com/baby-names/name/kaela", "passage_text": "The name Kaela is an Israeli baby name. In Israeli the meaning of the name Kaela is: The laurel crown. American Meaning: The name Kaela is an American baby name. In American the meaning of the name Kaela is: The laurel crown. SoulUrge Number: 7. Expression Number: 3. People with this name have a deep inner need for quiet, and a desire to understand and analyze the world they live in, and to learn the deeper truths."}, {"url": "http://www.babynamespedia.com/meaning/Kaela/f", "passage_text": "[ syll. kae-la, ka-ela ] The baby girl name Kaela is also used as a boy name, though the use for girls is far more popular. It is pronounced as K-LAH †. Kaela's language of origin is Hebrew and Arabic. It is predominantly used in English and Arabic. Kaela is a form of the English Kaila. Kaela is also an English form of the English and Hebrew Kayla. Kaela is also a shortening of the Arabic Khalilah. Kaela is an unusual baby girl name. Its usage peaked modestly in 1996 with 0.018% of baby girls being named Kaela"}, {"url": "http://www.thinkbabynames.com/meaning/0/Kaela", "passage_text": "Kaela is an uncommon given name for females. Kaela is also a unique surname for both adults and children. (2000 U.S. Census). Displayed below is the birth name popularity of Kaela for girls. Kaela was first listed in 1990 and reached its highest position of #648 in the U.S. in 1996, but is not found in the list at the moment."}, {"url": "http://www.meaning-of-names.com/israeli-names/kaela.asp", "passage_text": "Meaning of Kaela. Israeli name. In Israeli, the name Kaela means-beloved sweetheart.The name Kaela originated as an Israeli name. The name Kaela is most often used as a girl name or female name. Israeli Name Meaning-beloved sweetheart."}, {"url": "http://www.sheknows.com/baby-names/name/kayla", "passage_text": "The name Kayla is a Greek baby name. In Greek the meaning of the name Kayla is: Pure. American Meaning: The name Kayla is an American baby name. In American the meaning of the name Kayla is: Pure. English Meaning: The name Kayla is an English baby name. In English the meaning of the name Kayla is: Variants of Kay: keeper of the keys; pure. Famous bearer: Kayla is a character on daytime TV series 'Days of Our Lives."}, {"url": "http://www.thinkbabynames.com/meaning/0/Kaela", "passage_text": "Kaela /kae-la/ [2 sylls.] as a girls' name. Kaela's roots are Hebrew, Hawaiian, Irish and Gaelic, and Kaela means the laurel crown; style. Kaela is a version of Kaila (Hebrew, Hawaiian): see also Cayla and Kayla. Compare surname Kola. Kaela is also a unique surname for both adults and children. (2000 U.S. Census). Displayed below is the birth name popularity of Kaela for girls. Kaela was first listed in 1990 and reached its highest position of #648 in the U.S. in 1996, but is not found in the list at the moment."}, {"url": "http://www.babynology.com/meaning-kaela-f29.html", "passage_text": "The girl's name Kaela is of English origin and variation of Kay, keeper of the keys, pure. Kaela Name also appears in following Origin(s): Irish, Arabic, Jewish, Irish, Gaelic, Israeli, Hawaiian, English. Kaela also appears in following countries/origins/languages: Greek, American. "}]