[{"url": "http://www.health.harvard.edu/blog/artificial-sweeteners-sugar-free-but-at-what-cost-201207165030", "passage_text": "By offering the taste of sweetness without any calories, artificial sweeteners seem like they could be one answer to effective weight loss. The average 12-ounce can of sugar-sweetened soda delivers about 150 calories, almost all of them from sugar. The same amount of diet soda—zero calories. It has also approved one natural low-calorie sweetener, stevia. How the human body and brain respond to these sweeteners is very complex. One concern is that people who use artificial sweeteners may replace the lost calories through other sources, possibly offsetting weight loss or health benefits, says Dr. Ludwig."}, {"url": "https://en.wikipedia.org/wiki/Sugar_substitute", "passage_text": "A sugar substitute is a food additive that provides a sweet taste like that of sugar while containing significantly less food energy. Some sugar substitutes are natural and some are synthetic. Those that are not natural are, in general, called artificial sweeteners. An important class of sugar substitutes is known as high-intensity sweeteners. These are compounds with many times the sweetness of sucrose, common table sugar."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/artificial-sweeteners/art-20046936", "passage_text": "Artificial sweeteners are widely used in processed foods, including baked goods, soft drinks, powdered drink mixes, candy, puddings, canned foods, jams and jellies, dairy products, and scores of other foods and beverages. Artificial sweeteners are also popular for home use. Some can even be used in baking or cooking. Uses for artificial sweeteners. Artificial sweeteners are attractive alternatives to sugar because they add virtually no calories to your diet. In addition, you need only a fraction compared with the amount of sugar you would normally use for sweetness."}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/artificial-sweeteners/art-20046936", "passage_text": "Today artificial sweeteners and other sugar substitutes are found in a variety of food and beverages; they're marketed as sugar-free or diet, including soft drinks, chewing gum, jellies, baked goods, candy, fruit juice, and ice cream and yogurt. Uses for artificial sweeteners. Artificial sweeteners are attractive alternatives to sugar because they add virtually no calories to your diet. In addition, you need only a fraction compared with the amount of sugar you would normally use for sweetness."}, {"url": "http://familydoctor.org/familydoctor/en/prevention-wellness/food-nutrition/sugar-and-substitutes/sugar-substitutes-what-you-need-to-know.html", "passage_text": "You may also have heard them called “artificial sweeteners” or “non-caloric sweeteners.” They can be used as a tabletop sweetener (for example, to sweeten a glass of iced tea) or as an ingredient in processed foods and drinks. Most sugar substitutes are many times sweeter than sugar. "}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/artificial-sweeteners/art-20046936", "passage_text": "Understanding artificial sweeteners and other sugar substitutes. Sugar substitutes are loosely considered any sweetener that you use instead of regular table sugar (sucrose). Artificial sweeteners are just one type of sugar substitute. The chart lists some popular sugar substitutes and how they're commonly categorized. Uses for artificial sweeteners. Artificial sweeteners are attractive alternatives to sugar because they add virtually no calories to your diet. In addition, you need only a fraction compared with the amount of sugar you would normally use for sweetness."}, {"url": "http://www.webmd.com/diabetes/artificial-sweeteners-diabetes-patients", "passage_text": "Types of Artificial Sweeteners. Artificial low-calorie sweeteners include: 1  Saccharin (Sweet'N Low, Sugar Twin). 2  You can use it in both hot and cold foods. 3  Avoid this sweetener if you are pregnant or breastfeeding. 4  Aspartame (NutraSweet, Equal). 5  You can use it in both cold and warm foods. 6  It may lose some sweetness at high temperatures. Artificial low-calorie sweeteners include: 1  Saccharin (Sweet'N Low, Sugar Twin). 2  Aspartame (NutraSweet, Equal). 3  Acesulfame potassium or ace-K (Sweet One, Swiss Sweet, Sunett). 4  Sucralose (Splenda). 5  Advantame can be used in baked goods, soft drinks and other non-alcoholic beverages, chewing gum, candies, frostings, frozen desserts, gelatins and 6  ... Ne"}, {"url": "http://www.cancer.gov/about-cancer/causes-prevention/risk/diet/artificial-sweeteners-fact-sheet", "passage_text": "Artificial sweeteners, also called sugar substitutes, are substances that are used instead of sucrose (table sugar) to sweeten foods and beverages. Because artificial sweeteners are many times sweeter than table sugar, smaller amounts are needed to create the same level of sweetness. Artificial sweeteners are regulated by the U.S. Food and Drug Administration (FDA). The FDA, like the National Cancer Institute (NCI), is an agency of the Department of Health and Human Services. The FDA regulates food, drugs, medical devices, cosmetics, biologics, and radiation-emitting product"}, {"url": "http://www.diabetes.org/food-and-fitness/food/what-can-i-eat/understanding-carbohydrates/artificial-sweeteners/", "passage_text": "Curb Your Cravings. Foods and drinks that use artificial sweeteners are another option that may help curb your cravings for something sweet. Sometimes low-calorie sweeteners are also called artificial sweeteners, sugar substitutes or non-nutritive sweeteners. They can be used to sweeten food and drinks for less calories and carbohydrate when they replace sugar. "}]