[{"url": "http://www.moorhallvenue.co.uk/", "passage_text": "Moor Hall is steeped in history, a most perfect setting with beautiful gardens and a pretty woodland walk; a spectacular backdrop for any type of wedding. Licensed for the solemnization of marriages, with onsite accommodation coming soon, Moor Hall is the perfect location for your wedding from start to finish. We stumbled across Moor Hall on facebook last year and decided to go for a visit. From the very beginning we knew that Moor Hall was the venue for us and that Jodie and her family would help us have the best possible day and night."}, {"url": "http://www.moorhallvenue.co.uk/", "passage_text": "Moor Hall Wedding Venue Essex. We had our wedding reception at Moor Hall on the 12th September 2014 and we honestly had the best wedding experience we could have asked for. We stumbled across Moor Hall on facebook last year and decided to go for a visit. From the very beginning we knew that Moor Hall was the venue for us and that Jodie and her family would help us have the best possible day and night."}, {"url": "http://www.moor-hall.co.uk/", "passage_text": "MOOR HALL ARRIVING 2016. Moor Hall is situated in Aughton, West Lancashire in five acres of breathtaking gardens with views to the south over a beautiful lake, said to be the remains of a medieval moat. "}, {"url": "https://www.facebook.com/moorhallhotel", "passage_text": "Moor Hall Hotel & Spa added 56 new photos to the album: Wedding Fayre October 2015 — at Moor Hall Hotel & Spa. October 11 at 4:48am ·. Our Wedding Fayre is open until 3pm today, so there's still time to come along and meet our friendly exhibitors! +53. Moor Hall Hotel & Spa added 3 new photos. October 5 at 3:07am ·. There was a great atmosphere at yesterday's Jazz Sunday Lunch-a special thank you to The Funktional Jazz Trio for the wonderful entertainment!"}, {"url": "http://www.moorhallgolfclub.co.uk/", "passage_text": "Welcome to Moor Hall Golf Club. Widely acknowledged as a parkland gem, Moor Hall offers an ideal venue for individual visitors, societies and corporate golf days alike. The Club is set in the heart of Sutton Coldfield on the north eastern outskirts of Birmingham. This central position makes access from the motorway system very simple. "}, {"url": "http://www.booking.com/hotel/gb/moorhallhotel.html", "passage_text": "The Moor Hall Hotel & Spa has a quiet countryside location with easy access to the M6 and M6 Toll. The center of Birmingham is 10 miles away and the NEC (National Exhibition Centre) is 15 miles away. "}, {"url": "https://www.facebook.com/Moor-Hall-Venue-439988276047532/", "passage_text": "Moor Hall Venue added 12 new photos to the album: Moor Hall Venue. September 23 at 8:24am ·. For those of you that have visited Moor Hall previously, you will be very pleased to know that today we have had BRAND NEW signs installed thanks to Morgan Signs Ltd."}, {"url": "http://www.moorhallvenue.co.uk/", "passage_text": "Moor Hall. If you are looking for the perfect location to hold your fairy-tale wedding, then you need look no further than Moor Hall; an exclusive wedding venue nestled in the heart of Essex. We stumbled across Moor Hall on facebook last year and decided to go for a visit. From the very beginning we knew that Moor Hall was the venue for us and that Jodie and her family would help us have the best possible day and night."}, {"url": "http://billdargue.jimdo.com/placenames-gazetteer-a-to-y/places-m/moor-hall/", "passage_text": "The first written record of Old Moor Hall is in 1434 in the ownership of Roger Harewell. Believed to have been the birthplace of Bishop Vesey c1462, the house on Moor Hall Drive is a Grade II* Listed building in sandstone with surviving 14th-century roof timbers and lancet windows of c1520. It is in private ownership. More: first record 1327; Moor Hall 1434. Moor Hall takes its name from a medieval family. They may have taken their name their name from the settlement of Moor near a moor or 'marsh' locally. William de la More is documented in 1327. Ridge and furrow visible east of Moor Hall on the golf course is evidence of an organised medieval field system here"}]