[{"url": "http://www.uvi.edu/administration/about-uvi/us-virgin-islands.aspx", "passage_text": "The United States Virgin Islands (commonly called the U. S. Virgin Islands or USVI) are a group of islands in the Caribbean that are an insular territory of the United States of America (commonly called US). The U. S. Virgin Islands has all the beauty of the Caribbean with all of the conveniences of the US. The total land area of the territory is 133.73 square miles (346.4 km2). Most of the islands, including St. Thomas, are volcanic in origin and hilly. St. Croix, the largest of the U. S. Virgin Islands, lies to the south and has a flatter terrain."}, {"url": "https://en.wikipedia.org/wiki/Archipelago", "passage_text": "An archipelago (/ɑrkɨˈpɛləɡoʊ/ ark-i-PEL-ə-goh), sometimes called an island group or island chain, is a chain, cluster or collection of islands. The word archipelago is derived from the Greek ἄρχι- – arkhi- (chief) and πέλαγος – pelagos (pélagos) sea through The italian. arcipelago Archipelagos may be found isolated in bodies of water or neighboring a large land mass. For example, Scotland has more than 700 islands surrounding its mainland which constitute an archipelago."}, {"url": "https://en.wikipedia.org/wiki/Archipelago", "passage_text": "The largest archipelagic state in the world by area and population is Indonesia. The archipelago with the most islands is the Swedish East Coast Archipelago, which contains the Stockholm Archipelago, which, in turn, connects to the world's second largest archipelago, the Archipelago Sea in Finland. Archipelagos may be found isolated in bodies of water or neighboring a large land mass. For example, Scotland has more than 700 islands surrounding its mainland which constitute an archipelago."}, {"url": "http://www.thefreedictionary.com/Group+of+islands", "passage_text": "Noun. 1. archipelago-a group of many islands in a large body of water. island-a land mass (smaller than a continent) that is surrounded by water. ar·chi·pel·a·go. n. pl. ar·chi·pel·a·goes or ar·chi·pel·a·gos. 1. A large group of islands: the Philippine archipelago. 2. A sea, such as the Aegean, containing a large number of scattered islands."}, {"url": "http://www.ukcoastguide.co.uk/uk_islands.htm", "passage_text": "There are a great many islands off shore from the mainland of the United Kingdom-some estimates suggest that there are as many as 5000 islands in total but that number is difficult to verify. However there are certainly more than 1000, which is quite amazing in itself! Whatever the total number of islands there are certainly a great many of them-below are details of the main islands and groups of islands around the UK-from north to south. Shetland Islands-A group of around 90 islands, of which only 15 are inhabited, lying around 100 miles north of the Scottish north east coast."}, {"url": "http://www.answers.com/Q/What_is_a_group_of_island_called", "passage_text": "What is a group of island called? already exists. already exists as an alternate of this question. exists and is an alternate of. In your career, what projects or accomplishments were you the most proud of? What is a group of 4 or more Islands called? What is a grouping of coral islands called? What is a large group of islands called? What is a ... 1 Planning a Visit to Hawaii Hawaii is the perfect vacation destination. 2  No other place in the world has so many unique things to see and do. 3  The islands are home to some incredible natural wonders and c…. 4  Save Time with Gmail Email Lists Often the same email message needs to be sent out to multiple recipients."}, {"url": "http://www.answers.com/Q/What_is_a_group_of_island_called", "passage_text": "What is the group of islands in the Caribbean sea called? The group of islands in the Caribbean ocean are known as the  Greater Antilles, which consist of Jamaica, Cuba, and other island  territories. 1 Planning a Visit to Hawaii Hawaii is the perfect vacation destination. 2  No other place in the world has so many unique things to see and do. 3  The islands are home to some incredible natural wonders and c…. 4  Save Time with Gmail Email Lists Often the same email message needs to be sent out to multiple recipients."}, {"url": "http://www.mrdowling.com/710-islands.html", "passage_text": "The islands of the region are divided into three main groups—the Bahamas, the Greater Antilles, and the Lesser Antilles. The Bahamas is an archipelago, or a group of 700 islands north of the Caribbean Sea. People inhabit only about thirty of the Bahamian islands. South of the Bahamas are the largest islands of the Caribbean, called the Greater Antilles. The Greater Antilles include Cuba, Jamaica, Puerto Rico, and Hispanola. hispañola South of the Bahamas are the largest islands of the Caribbean, called the Greater Antilles. The Greater Antilles include Cuba, Jamaica, Puerto Rico, and Hispanola. Hispañola the largest islands of The Greater antilles have rugged mountains and, lush thick rain. forests"}, {"url": "https://en.wikipedia.org/wiki/Hawaiian_Islands", "passage_text": "Formerly the group was known to Europeans and Americans as the  Sandwich Islands , a name chosen by James Cook in honor of the then First Lord of the Admiralty John Montagu, 4th Earl of Sandwich. The contemporary name is derived from the name of the main island, Hawaii Island. The Hawaiian Islands have a total land area of 6,423.4 square miles (16,636.5 km 2). Except for Midway, which is an unincorporated territory of the United States, these islands and islets are administered as the state of Hawaii —the 50th state of the United States of America."}, {"url": "http://www.ukcoastguide.co.uk/uk_islands.htm", "passage_text": "There are more than 30 islands in total, many of which are uninhabited. Also known as the Western Isles-a term which may or may not include the Inner Hebrides. Inner Hebrides-Is a group of islands lying just off of the west coast of Scotland partially between the coast and the Outer Hebrides. Whatever the total number of islands there are certainly a great many of them-below are details of the main islands and groups of islands around the UK-from north to south. Shetland Islands-A group of around 90 islands, of which only 15 are inhabited, lying around 100 miles north of the Scottish north east coast."}]