[{"url": "http://www.uscourts.gov/educational-resources/educational-activities/history-brown-v-board-education-re-enactment", "passage_text": "Brown v. Board of Education (1954, 1955). The case that came to be known as Brown v. Board of Education was actually the name given to five separate cases that were heard by the U.S. Supreme Court concerning the issue of segregation in public schools. When the cases came before the Supreme Court in 1952, the Court consolidated all five cases under the name of Brown v. Board of Education. Marshall personally argued the case before the Court."}, {"url": "http://www.pbs.org/wnet/supremecourt/rights/landmark_brown.html", "passage_text": "Check local listings. Brown v. Board of Education (1954). Brown v. Board of Education (1954), now acknowledged as one of the greatest Supreme Court decisions of the 20th century, unanimously held that the racial segregation of children in public schools violated the Equal Protection Clause of the Fourteenth Amendment. Mother (Nettie Hunt) and daughter (Nickie) sit on steps of the Supreme Court building on May 18, 1954, the day following the Court's historic decision in Brown v. Board of Education. Nettie is holding a newspaper with the headline High Court Bans Segregation in Public Schools."}, {"url": "http://www.history.com/topics/black-history/brown-v-board-of-education-of-topeka", "passage_text": "A+E Networks. On May 17, 1954 the United States Supreme Court handed down its ruling in the landmark case of Brown v. Board of Education of Topeka, Kansas. This unanimous decision handed down by the Supreme Court on May 17, 1954, ended federal tolerance of racial segregation. In Plessy v. Ferguson (1896) the Court had ruled that “separate but equal” accommodations on railroad cars conformed to the Fourteenth Amendment’s guarantee of equal protection."}, {"url": "http://americanhistory.si.edu/brown/history/5-decision/justices.html", "passage_text": "The Justices: Coming to a Decision. The Supreme Court agreed to hear Brown v. Board of Education in June 1952. Deciding the case was difficult from the start. Differing social philosophies and temperaments divided the nine justices. Chief Justice Fred Vinson and several others doubted the constitutional authority of the Court to end school segregation. "}, {"url": "http://www.uscourts.gov/educational-resources/educational-activities/history-brown-v-board-education-re-enactment", "passage_text": "The plaintiffs then appealed to the U.S. Supreme Court. When the cases came before the Supreme Court in 1952, the Court consolidated all five cases under the name of Brown v. Board of Education. Marshall personally argued the case before the Court."}, {"url": "http://www.history.com/topics/black-history/brown-v-board-of-education-of-topeka", "passage_text": "Introduction. On May 17, 1954 the United States Supreme Court handed down its ruling in the landmark case of Brown v. Board of Education of Topeka, Kansas. This unanimous decision handed down by the Supreme Court on May 17, 1954, ended federal tolerance of racial segregation. In Plessy v. Ferguson (1896) the Court had ruled that “separate but equal” accommodations on railroad cars conformed to the Fourteenth Amendment’s guarantee of equal protection."}, {"url": "https://en.wikipedia.org/wiki/Brown_v._Board_of_Education", "passage_text": "Educational segregation in the US prior to Brown. Brown v. Board of Education of Topeka, 347 U.S. 483 (1954), was a landmark United States Supreme Court case in which the Court declared state laws establishing separate public schools for black and white students to be unconstitutional. The District Court ruled in favor of the Board of Education, citing the U.S. Supreme Court precedent set in Plessy v. Ferguson, 163 U.S. 537 (1896), which had upheld a state law requiring separate but equal segregated facilities for blacks and whites in railway cars."}, {"url": "https://en.wikipedia.org/wiki/Brown_v._Board_of_Education", "passage_text": "The case of Brown v. Board of Education as heard before the Supreme Court combined five cases: Brown itself, Briggs v. Elliott (filed in South Carolina), Davis v. County School Board of Prince Edward County (filed in Virginia), Gebhart v. Belton (filed in Delaware), and Bolling v. Sharpe (filed in Washington D.C.). The District Court ruled in favor of the Board of Education, citing the U.S. Supreme Court precedent set in Plessy v. Ferguson, 163 U.S. 537 (1896), which had upheld a state law requiring separate but equal segregated facilities for blacks and whites in railway cars."}, {"url": "http://www.ourdocuments.gov/doc.php?doc=87", "passage_text": "Despite two unanimous decisions and careful, if vague, wording, there was considerable resistance to the Supreme Court's ruling in Brown v. Board of Education. "}]