[{"url": "http://www.sbdcnet.org/small-business-research-reports/bike-shop-2012", "passage_text": "1 Startupbizhub.com estimates bicycle shop startup costs to be $20,000 to $90,000. 2  Startingabiz.com estimates the cost of opening a bike shop to be $70,000 to $100,000. 3  Entrepreneur.com estimates the start-up costs for Bicycle Shop to be: $2,000 – $10,000."}, {"url": "http://www.ukbusinessforums.co.uk/threads/cost-of-shop-fittings-and-fixtures.186836/", "passage_text": "Our second shop came in @ around 6k for materials and thats including building an Ice cream Hut in store, its about 800sqft. We got 90% of the materials from Stax trade centres which ment we could fit our second shop out to a higher standard than our 1st smaller shop for the same outlay."}, {"url": "http://www.xtremeshopfitting.com.au/costs-of-shop-fitting/", "passage_text": "There are a number of factors, which contribute to the cost of shop fitting. Obviously, the type of outfitting you need or want has one of the greatest effects on the cost of shop fitting. Other factors include the type of building and relative location. A suburban neighborhood ground floor shop, for example, may cost less than a second story shop in the same location. Other types of shops such as supermarkets can expect a basic shop fitting costs to run from $1300 to $1405, and that does not include such things as cold rooms and shop fittings. A regional department store could be looking at costs between $1450 and $1565 per sqm."}, {"url": "http://www.xtremeshopfitting.com.au/shopfitting-costs/", "passage_text": "Shopfitting costs fluctuate a great deal depending on the types of fittings and finishes you select. Shopfittings costs will vary greatly depending on the type of shop. Fittings such as flooring, ceilings, special lighting and custom designs all can increase the costs per square metre."}, {"url": "http://www.building.co.uk/specialist-costs-shopfitting/3043283.article", "passage_text": "Specialist costs: Shopfitting. In this specialist market overview, Russell O’Hare of Gardiner & Theobald’s Retail Group looks at the procurement, design challenges and costs for shopfitting works, and Bill Fraser of the Pel Group talks about trends in retail."}, {"url": "http://www.homeadvisor.com/cost/plumbing/", "passage_text": "The cost of a plumber ranges from $160 to $430 for a typical job with the average cost per hour ranging from $45 to $150. This can include jobs like repairing faucets, toilets, sinks or bathtubs. Some plumbers may also charge a flat rate depending on the job."}]