[{"url": "https://au.answers.yahoo.com/question/index?qid=20080629123514AAJb8T0", "passage_text": "I use Rescue Remedy on all minor cuts, bruises, bug bites, etc. that I get, and it heals them twice as fast. If you are talking about the calming drops, I have never used them personally, but I work in animal rescue and we use the Rescue Remedy for pets on the animals we bring in and it calms them down a LOT. So, at least on animals, it works really well. K.E. · 7 years ago"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20061016052725AAtTlnP", "passage_text": "· just now. Report Abuse. I've never tried the Rescue Remedy yet, but for the last three weeks I have been using a Bach Flower remedy specially made for me and I can only tell you that the benefits have been astounding. There have been times in my life where rescue remedy has saved me butt!! I used to by the biggest bottles in my final year at university, I've used it before job interviews and even before walking up the aisle to my wedding."}, {"url": "http://www.bachflower.com/faq-bach-flower-remedies-rescue/", "passage_text": "Rescue Remedy Cream, contains the same five Remedies as Rescue® Remedy with added Crab Apple. The cream is for external applications such as bruises, diaper rash, sprains, burns, stings, scratches and other skin conditions. "}, {"url": "http://www.dogforums.com/dog-health-questions/75321-does-rescue-remedy-work.html", "passage_text": "I have used Rescue Remedy in the past with my SA dog and it did work pretty well and actually better then the pills my vet gave me. It takes off some of the edge but it still doesn't fix the problem. It only allows you to work on the problem a little bit easier. I have been looking into rescue remedy as my dog has very sever separation anxiety and I'd like to try everything I can before resorting to the anxiety meds the vet says he needs."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20080629123514AAJb8T0", "passage_text": "Does Rescue Remedy work? Update: It's a natural spray that goes under your tongue that helps calm nerves, relax you, etc....well, that's what it is here in Australia anyway. If you are talking about the calming drops, I have never used them personally, but I work in animal rescue and we use the Rescue Remedy for pets on the animals we bring in and it calms them down a LOT."}, {"url": "http://anxietyforum.net/forum/showthread.php?11112-Rescue-Remedy-It-Works!", "passage_text": "Rescue Remedy-It Works! I just wanted to share with everyone about something that has helped me with my anxiety. It is called Bach's Rescue Remedy and you can get it in stores like GNC ect. I have been using it the past 6 months for situations where I would get anxious. It has helped with presentations ect. Last night I had a pretty bad panic attack and I managed to subdue it fairly quickly using the Rescue Remedy."}, {"url": "http://www.nosleeplessnights.com/rescue-remedy-review/", "passage_text": "And that’s it! In the FAQ section, this is the full explanation for how rescue remedy works its wonders. To find out more, I then turned to the wikipedia entry and several other websites with articles about the origins of Bach’s flower remedies and how they work. Rescue remedy is the most famous of many remedies sold under the brand of Bach Flower. They were developed by Edward Bach, an English homeopath, in the 1930s. According to their website, rescue remedy isn’t technically a remedy, but a blend of 5 different remedies."}, {"url": "http://www.mumsnet.com/Talk/feeling_depressed/416044-bach-s-rescue-remedy-for-a-stressed-out-mum-does", "passage_text": "Boots have them-I like Rescue Remedy as use it when I'm severely stressed/anxious-don't know whether it actually works but the taking of it seems therapeutic to me-I like that it says 'to comfort and reassure' on the bottle...I'd try it if I were you ! ScottishMummy Thu 01-Nov-07 13:06:19. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080131033309AAx0XZs", "passage_text": "· just now. Report Abuse. I feel it is best used for an acute situation and not for a chronic condition. You have highlighted some of the possble causes for you feeling the way you do, and rescue remedy will work with you as you make other changes to your life to resolve the conflict you feel. It is not a miracle life solver. "}]