[{"url": "https://www.goredforwomen.org/know-your-risk/factors-that-increase-your-risk-for-heart-disease/cholesterol-heart-disease/", "passage_text": "1 Less than 200 mg/dL: Desirable level that puts you at lower risk for heart disease. 2  200 to 239 mg/dL: Considered borderline high. 3  240 mg/dL and above: High blood cholesterol. 4  A person with this level has more than twice the risk of heart disease. Find out what your cholesterol levels are so you can lower them if you need to. Total cholesterol: 1  Less than 200 mg/dL: Desirable level that puts you at lower risk for heart disease. 2  200 to 239 mg/dL: Considered borderline high."}, {"url": "http://www.healthywomen.org/condition/cholesterol", "passage_text": "A desirable total cholesterol level for adults without heart disease is less than 200 mg/dL. An HDL cholesterol level of 60 mg/dL and above is considered protective against heart disease, while a level less than 50 mg/dL for women or 40 mg/dL for men is considered a major risk factor for heart disease. The body is able to meet all these needs by producing cholesterol in the liver. High blood cholesterol is a major women's health issue. According to the Centers for Disease Control and Prevention, one in every six adults—or 16.3 percent of the population—has high cholesterol, defined as 240 mg/dL or higher."}, {"url": "http://www.healthywomen.org/condition/cholesterol", "passage_text": "Cholesterol and Triglyceride Levels. Blood cholesterol is measured in milligrams per deciliter (mg/dL). A deciliter is one-tenth of a liter). NCEP defines a desirable total cholesterol level as less than 200 mg/dL, and levels for most women stay in the healthy or desirable range until middle-age. But between the ages of 45 and 55, women's average total cholesterol rises to almost 220 mg/dL. The body is able to meet all these needs by producing cholesterol in the liver. High blood cholesterol is a major women's health issue. According to the Centers for Disease Control and Prevention, one in every six adults—or 16.3 percent of the population—has high cholesterol, defined as 240 mg/dL or higher."}, {"url": "http://www.livestrong.com/article/388701-what-is-the-normal-cholesterol-level-for-women/", "passage_text": "Healthy Cholesterol Levels. The recommended HDL level is higher in women than men. Aim to keep your total cholesterol level less than 200 mg/dL and LDL cholesterol less than 100 mg/dL. The desired HDL level is greater than 50 mg/dL and levels greater than 60 mg/dL are considered protective against heart disease. It is important to be aware of your cholesterol levels because a high cholesterol level double your risk for developing cardiovascular disease. The recommended level of cholesterol differs slightly for men and women and knowing your numbers is the first step in keeping your cholesterol at a healthy level."}, {"url": "http://www.ehow.com/about_5090959_good-cholesterol-levels-women.html", "passage_text": "Healthy Levels of Cholesterol in Women. The following offers a breakdown of cholesterol levels in women. Overall, females should aim for a cholesterol less than 200 mg/dL. 200 mg/dL and less: Desirable. Women should aim to have a cholesterol level at 200 mg/dL or lower to decrease their chances of heart disease. Between 200 and 239 mg/dL: Borderline-High Risk. Women who have cholesterol levels between 200 and 239 mg/dL are at a higher risk to develop heart disease."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=lipid_panel_hdl_ratio", "passage_text": "High: At or above 240 mg/dL. If your total cholesterol is high, you have twice the risk for heart disease as a person with normal total cholesterol. Here is the adult range for HDL cholesterol: Normal: 35 to 65 mg/dL for men, 35 to 80 mg/dL for women. If your number is less than 25 mg/dL, your risk for coronary heart disease is doubled. If your number is between 60 and 74 mg/dL, your risk for coronary heart disease is below average"}, {"url": "http://www.livestrong.com/article/275091-normal-cholesterol-levels-by-age/", "passage_text": "Changes. Total cholesterol measurements in women become a major heart-disease risk factor after menopause because their average total cholesterol leaps from 194 mg/dL when they're 40 to 49 years old to 219 mg/dL when they're 50 to 59. Total cholesterol above 200 mg/dL is a risk factor, the NCEP reports. Men's average total cholesterol is 205 mg/dL when they're 40 to 49 and 208 mg/dL when they're 50 and above. Below age 40, men's average total cholesterol is 185 mg/dL but for women it is 183 mg/dL. "}]