[{"url": "http://www.eyehealthweb.com/broken-blood-vessel-in-eye/", "passage_text": "Treatment of a Broken Blood Vessel in the Eye. In most cases, treatment is not needed for a subconjunctival hemorrhage. If you are experiencing pain or discomfort, over-the-counter pain medications such as Tylenol may be recommended. Symptoms and Causes of a Broken Blood Vessel on the Front of the Eye. Besides the visible bleeding between the sclera (the white part of the eye) and conjunctiva, many people describe a scratchy or itchy feeling on the surface of the eye."}, {"url": "http://www.firmoo.com/answer/question/6365.html", "passage_text": "For example, coughing too hard or lifting something too heavy can cause broken blood vessel in eyes. And the time for heal the broken blood vessel depend on how bad your condition is. Usually, it will clear up in a week or a couple of weeks. If your eyes are hurt badly, it may also need three weeks or even more. In that case, broken blood vessel can not affect your eyesight. But if your broken blood vessel is caused by Embolism of retinal artery, venous embolism, phlebitis, diabetic retinopathy, nephritis, hematopathy and so on. It may takes a long to heal. So it is hard to give you an exact answer."}, {"url": "http://www.ehow.com/how_4947638_heal-popped-blood-vessel.html", "passage_text": "Wait. Popped blood vessels will heal on their own; the process just takes time. Generally, a popped blood vessel will fade within 2 to 3 weeks. There is no long-term damage from a popped blood vessel, so your skin should return to its normal condition. See a dermatologist. "}, {"url": "http://www.lookfordiagnosis.com/faq.php?term=Eye+Hemorrhage&lang=1", "passage_text": "If you've ever had a Subconjunctival Hemorrhage (Broken Blood Vessel in Eye), how long did it take for it to heal? I've read it can take anywhere from 7-14 days on average. I've had one for 12 days and although the blood spot looks a bit lighter red, I don't see much reduction in the size of the blood spot. A hemorrhage in the back of the eye-on the retina, is more serious an can be caused by a number of diseases (diabetes, high blood pressure, etc). (+ info). I know that this can take up to two weeks to fully disappear (according to the internet)."}, {"url": "http://www.eyehealthweb.com/broken-blood-vessel-in-eye/", "passage_text": "If you have a broken blood vessel on the front of your eye, you should contact your eye doctor and schedule an appointment. In most cases, a simple eye exam is enough for an eye doctor to properly diagnose a subconjunctival hemorrhage. Symptoms and Causes of a Broken Blood Vessel on the Front of the Eye. Besides the visible bleeding between the sclera (the white part of the eye) and conjunctiva, many people describe a scratchy or itchy feeling on the surface of the eye."}, {"url": "http://www.firmoo.com/answer/question/6365.html", "passage_text": "If your broken blood vessel in your eyes is caused by high pressure or spicy food you ate, it only takes a week to heal your broken blood vessel. You just need to apply cold cloth to cover your eyes for three days and apply warm cloth to cover your eyes for another three days as well. In that case, broken blood vessel can not affect your eyesight. But if your broken blood vessel is caused by Embolism of retinal artery, venous embolism, phlebitis, diabetic retinopathy, nephritis, hematopathy and so on. It may takes a long to heal. So it is hard to give you an exact answer."}, {"url": "http://www.eyehealthweb.com/broken-blood-vessel-in-eye/", "passage_text": "Also known as a subconjunctival hemorrhage, a broken blood vessel on the front of the eye is typically a harmless condition (although see below) that clears up within one to three weeks. Subconjunctival is the term used to describe the space located just beneath the conjunctiva (the clear surface of your eye). Symptoms and Causes of a Broken Blood Vessel on the Front of the Eye. Besides the visible bleeding between the sclera (the white part of the eye) and conjunctiva, many people describe a scratchy or itchy feeling on the surface of the eye."}, {"url": "https://answers.yahoo.com/question/index?qid=20080813105954AAiuoZA", "passage_text": "Report Abuse. A strain of some kind can cause a blood vessel to break in the eye-a sneeze, looking down, standing on your head, having a baby etc. If there are no more breaks, the red will turn yellow as a normal bruise progresses. It will probably take about three weeks to go completely. norcot · 7 years ago. Thumbs up. It will clear up in a week or a couple of weeks, depending on how bad it is. You can use some Visine and it will lessen the redness for a few hours, though it won't take it away completely. Source(s): Experience. angiea276"}, {"url": "https://answers.yahoo.com/question/index?qid=20070320200543AApgCNd", "passage_text": "Answers. Best Answer: I heard it takes a couple of weeks. Since it is in your eye it might take longer! Also, you could get an infection in your eye! Go see a doctor, she will probably give you some medicine or maybe an eye patch if you get an infection. Your capillaries are really small thin walled vessels that break easily. When that happens your body has to reabsorb the blood through your tissues and it eventually goes away. If it hurts try a cold pack."}]