[{"url": "http://medical-dictionary.thefreedictionary.com/gland", "passage_text": "There are two main groups of glands: (1) The endocrine glands which have no duct and whose secretion (a hormone) is absorbed directly into the blood. Examples: adrenal gland, pineal gland, pituitary gland, thyroid gland. (2) The exocrine glands whose secretion reaches the surface by means of ducts. thyroid gland. A large endocrine gland located in the center of the base of the neck. The gland is composed of two lobes, one on each side of the trachea, and an isthmus of tissue connecting the lower two thirds of each lobe. The isthmus is usually located at the level of the second to third tracheal rings."}, {"url": "https://en.wikipedia.org/wiki/Gland", "passage_text": "(February 2012). A gland is an organ in an animal's body that synthesizes a substance such as hormones for release into the bloodstream (endocrine gland) or into cavities inside the body or its outer surface (exocrine gland). Glands are classified according to their shape. 1  If the gland retains its shape as a tube throughout it is termed a tubular gland. 2  In the second main variety of gland the secretory portion is enlarged and the lumen variously increased in size. 3  These are termed alveolar or saccular glands."}, {"url": "http://www.merriam-webster.com/dictionary/gland", "passage_text": "Medical Definition of GLAND. 1. : a cell, group of cells, or organ of endothelial origin that selectively removes materials from the blood, concentrates or alters them, and secretes them for further use in the body or for elimination from the body. 2. Definition of GLAND for Kids. : a cluster of cells or an organ in the body that produces a substance (as saliva, sweat, or bile) to be used by the body or given off from it."}, {"url": "https://en.wikipedia.org/wiki/Pituitary_gland", "passage_text": "Hormones secreted from the pituitary gland help control: growth, blood pressure, certain functions of the sex organs, thyroid glands and metabolism as well as some aspects of pregnancy, childbirth, nursing, water/salt concentration and the kidneys, temperature regulation and pain relief. The posterior pituitary (or neurohypophysis) is a lobe of the gland that is functionally connected to the hypothalamus by the median eminence via a small tube called the pituitary stalk (also called the infundibular stalk or the infundibulum)."}, {"url": "https://en.wikipedia.org/wiki/Pituitary_gland", "passage_text": "In vertebrate anatomy, the pituitary gland, or hypophysis, is an endocrine gland about the size of a pea and weighing 0.5 grams (0.018 oz) in humans. It is a protrusion off the bottom of the hypothalamus at the base of the brain. The posterior pituitary (or neurohypophysis) is a lobe of the gland that is functionally connected to the hypothalamus by the median eminence via a small tube called the pituitary stalk (also called the infundibular stalk or the infundibulum)."}, {"url": "http://www.thefreedictionary.com/gland", "passage_text": "1. a. Any of various organs or cell groups, such as the adrenal glands and the salivary glands, that are of endothelial origin and secrete a substance that is used or excreted by the body. b. Any of various organs, such as lymph nodes, that resemble true glands but perform a nonsecretory function"}, {"url": "http://www.innerbody.com/image/endo01.html", "passage_text": "The pituitary gland, also known as the hypophysis, is connected to the hypothalamus of the brain by a tiny isthmus of nervous tissue called the infundibulum.... "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=5778", "passage_text": "Thyroid gland: A gland that makes and stores hormones that help regulate the heart rate, blood pressure, body temperature, and the rate at which food is converted into energy. Thyroid hormones are essential for the function of every cell in the body. "}, {"url": "http://www.innerbody.com/image/endoov.html", "passage_text": "The endocrine system includes all of the glands of the body and the hormones produced by those glands. The glands are controlled directly by stimulation from the nervous system as well as by chemical receptors in the blood and hormones produced by other glands. Hypothalamus. The hypothalamus is a part of the brain located superior and anterior to the brain stem and inferior to the thalamus. It serves many different functions in the nervous system, and is also responsible for the direct control of the endocrine system through the pituitary gland."}, {"url": "http://www.hormone.org/diseases-and-conditions/pituitary/overview", "passage_text": "The pituitary gland is a tiny organ, the size of a pea, found at the base of the brain. As the “master gland” of the body, it produces many hormones that travel throughout the body, directing certain processes or stimulating (causing) other glands to produce other hormones. "}]