[{"url": "http://www.payscale.com/research/US/Job=Freight_Forwarder/Salary", "passage_text": "(United States). A Freight Forwarder earns an average salary of $38,870 per year. Most people move on to other jobs if they have more than 20 years' experience in this career. Experience has a moderate effect on pay for this job. $29,397 - $68,456"}, {"url": "http://www.salarylist.com/jobs/Freight-Forwarding-Manager-Salary.htm", "passage_text": "Freight Forwarding Manager Salary. Freight Forwarding Manager average salary is $37,046, median salary is $40,000 with a salary range from $30,264 to $40,872. Freight Forwarding Manager salaries are collected from government agencies and companies. Each salary is associated with a real job position. Freight Forwarding Manager salary statistics is not exclusive and is for reference only."}, {"url": "http://www.indeed.com/salary/International-Freight-Forwarder.html", "passage_text": "Average International Freight Forwarder salaries for job postings nationwide are 33% lower than average salaries for all job postings nationwide. "}, {"url": "http://work.chron.com/salary-freight-forwarders-3270.html", "passage_text": "Connecticut paid freight forwarders the highest average wage, at $55,170 a year. Washington ranked second at an average annual wage of $50,490, followed by neighboring Oregon at an average annual wage of $49,530. Ranking fourth was Nebraska, where freight forwarders earned $49,040 a year on average. The District of Columbia rounded out the top five with an average annual salary of $48,890."}, {"url": "https://www.recruiter.com/salaries/freight-forwarders-salary/", "passage_text": "A Freight Forwarder usually receives an average wage between 24000 - 36000 depending on the level of experience. Freight Forwarders usually receive a compensation of Thirty Nine Thousand dollars every year. Freight Forwarders are paid the highest in Connecticut, where they earn job pay of just about $49590. People holding these jobs are paid most highly in Manufacturing, which has salary pay of $51900. The national wage distribution is shown below. To overlay local salaries for a Freight Forwarder, please select your state. "}, {"url": "http://www.truckingjobfinder.com/members/freight-forwarding-jobs.php", "passage_text": "According to the International Federation of Freight Forwarders Associations (FIATA), there are about 40,000 forwarding and logistics firms worldwide. These firms are also known as the Architects of Transport, and they employ 8 to 10 million people in 150 countries. Freight forwarding involves a lot more than shipping. Forwarders have to be continuously aware of the changing political climate in different countries. They have to keep up-to-speed on exchange rates and credit practices. They must be able to apply information technology to customer needs."}, {"url": "http://work.chron.com/salary-freight-forwarders-3270.html", "passage_text": "National Averages. The Bureau of Labor Statistics reports that the median hourly wage for cargo and freight agents was $37,150 a year as of May 2010. The lowest paid 10 percent of freight forwarders earned less than $22,110, while the highest-paid 10 percent earned more than $58,400. The average wages nationwide were $19.56 per hour or $40,680 annually as of May 2011. Ranking fourth was Nebraska, where freight forwarders earned $49,040 a year on average. The District of Columbia rounded out the top five with an average annual salary of $48,890."}]