[{"url": "http://www.wikinvest.com/stock/NCR_(NCR)/Now_Therefore_Good_Valuable_Consideration_Receipt_Sufficiency_Hereby", "passage_text": "Now, Therefore, for good and valuable consideration, the receipt and sufficiency of which is hereby acknowledged, the parties agree as follows: Agreement elsewhere: Skip the spreadsheet."}, {"url": "http://www.lawqa.com/qa/what-does-in-addition-to-other-valuable-consideration-receipt-and-sufficiency-of-which-consideration-hereby-acknowledged-mean", "passage_text": "What does “in addition to other valuable consideration, the receipt and sufficiency of which consideration is hereby acknowledged” mean? 7 Answers as of October 23, 2012."}, {"url": "http://forum.wordreference.com/threads/receipt-and-sufficiency-of-which-is-hereby-acknowledged.2582716/", "passage_text": "in consideration of the premises and for other good and valuable consideration, the receipt and sufficiency of which is hereby acknowledged, the Parties intending to be legally bound, hereby agree as follows."}, {"url": "http://www.lawqa.com/qa/what-does-in-addition-to-other-valuable-consideration-receipt-and-sufficiency-of-which-consideration-hereby-acknowledged-mean", "passage_text": "The language is a term of art indicating that a contract has valuable consideration, which is a requirement to form a valid contract. It means you were given something of value in exchange for signing the agreement. This advice is based on the limited facts that you have provided and other facts may change the advice."}, {"url": "http://www.wikinvest.com/stock/NCR_(NCR)/Now_Therefore_Good_Valuable_Consideration_Receipt_Sufficiency_Hereby", "passage_text": "NCR » Topics » Now, Therefore, for good and valuable consideration, the receipt and sufficiency of which is hereby acknowledged, the parties agree as follows: Agreement. This excerpt taken from the NCR 10-K filed Jun 4, 2008."}, {"url": "http://forum.wordreference.com/threads/receipt-and-sufficiency-of-which-is-hereby-acknowledged.2582716/", "passage_text": "Still, I can explain in English that the meaning of phrase receipt and sufficiency of which is hereby acknowledged is that: by writing this (hereby) the signatory is formally agreeing (acknowledging) that whatever has been paid or given (the consideration) has been received and is sufficient."}, {"url": "http://www.wikinvest.com/stock/NCR_(NCR)/Now_Therefore_Good_Valuable_Consideration_Receipt_Sufficiency_Hereby", "passage_text": "Now, Therefore, for good and valuable consideration,the receipt and sufficiency of which is hereby acknowledged, the parties agree as follows:"}, {"url": "http://dictionary.reverso.net/english-cobuild/the%20receipt%20and%20sufficiency%20of%20which%20is%20hereby%20acknowledged", "passage_text": "receipt (receipts plural) 1 n-count A receipt is a piece of paper that you get from someone as proof that they have received money or goods from you. In British English a receipt is a piece of paper that you get in a shop when you buy something, but in American English the more usual term for this is sales slip. I wrote her a receipt for the money."}]