[{"url": "http://medical-dictionary.thefreedictionary.com/prostatic+calculus", "passage_text": "Etymology: Gk, prostates, standing before; L, calculus, pebble. a solid calcification formed in the prostate. Typically small and multiple, prostatic calculi are often the product of chronic prostatitis and are usually composed of calcium carbonate and/or calcium phosphate. They are not clinically significant and do not require treatment."}, {"url": "http://www.rightdiagnosis.com/p/prostate_stones/intro.htm", "passage_text": "Symptoms of Prostate stones. Click to Check. 1  This condition usually does not cause symptoms in and of themselves but may be associated with the symptoms of BPH which men can get as they age and their BPH progresses."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3739099/", "passage_text": "Prostatic calculi are common and are associated with inflammation of the prostate. Recently, it has been suggested that this inflammation may be associated with prostate carcinogenesis."}, {"url": "http://doctor.ndtv.com/faq/ndtv/fid/13186/What_is_the_alternative_to_surgery_to_remove_prostatic_stones.html", "passage_text": "A. Prostatic stones are very common. When ultrasound exams of the prostate are done for other reasons, 75% of middle-aged men and nearly 100% of older men are found to have prostate stones. These may be seen in younger men too having chronic prostatitis."}, {"url": "http://jama.jamanetwork.com/article.aspx?articleid=299638", "passage_text": "Although true prostatic calculi. Prostatic calculi are classified as exogenous or endogenous, depending on the point of origin. Exogenous calculi come from urinary salts and may originate as ureteral or bladder stones and become lodged in the prostatic urethra. In a sense they are not true prostatic stones, but they have been classed as such. This type of stone has been seen after prostatectomy and may become quite large."}, {"url": "http://prostatitis.org/stones.html", "passage_text": "From: Elliott. Prostatic calculi or stones are thought by a number of people in the medical community to be responsible for a certain percentage of the cases of chronic prostatitis. As hard as it is to drive an infection from the prostate, it's harder still to get them out of the stones once they are dug in."}]