[{"url": "http://www.answers.com/Q/How_much_does_it_cost_to_drill_a_water_well_in_Central_Florida", "passage_text": "I am not a mathematician, but $9000 divided by the depth, 275 ft, equals approx $33 per foot, not $100. That includes the cost of the pump, pressure tank, piping to house, wiring to and from house, all labor, and well test/water test. So the per foot cost of drilling is probably closer to $20. A minimum acceptable flow rate for a family   of 4 would be about 3 gallon … s per minute into the well.     A good (good flow rate, we aren't taking about   the quality of the water here, just the volume) well   would produce 5 or more gallons per minute."}, {"url": "http://www.fsec.ucf.edu/en/consumer/solar_hot_water/pools/q_and_a/index.htm", "passage_text": "Average yearly cost for heating a residential pool in Florida is $1,450 using electrical resistance (electricity at $0.09/kWh), $500 using an electric heat pump and $580 using natural gas. Liquid propane would cost the same as electrical resistance. "}, {"url": "http://www.floridapumpservice.com/t/ShallowWellContract", "passage_text": "At an additional cost, we can locate the pump system over 25’ from the well (select Option 5). Our price does not include connecting the well and pump system to your irrigation system. The cost for this service is $7.00/ft for material and labor, with a minimum charge of $35.00 (select Option 8). If you have signed up for a 1 hp-20 GPM well and pump system and the well only produces 15 GPM, we will install a ¾ hp pump in lieu of the 1 HP pump and reduce your cost by $50. The same applies to ¾ hp-15 GPM to ½ hp-10 GPM. 9."}, {"url": "http://www.city-data.com/forum/florida/104181-well-septic.html", "passage_text": "times. Reputation: 10499. To be more specific, my new septic I just put in cost $4,000 for a 900 gallon tank and good size drainfield. The rolling hills here mean you must drill deeper for water, a well in this area will cost $3,000 - $5,000 depending on the depth, tank and pump size. "}, {"url": "http://home.costhelper.com/well-drilling.html", "passage_text": "1 (However, if the geological conditions are especially difficult or access is extremely limited, drilling can cost $30-$50 a foot or more.) For example, the sustainable Arizona homesteaders at ByExample.com report paying $6,750 to have well drilled 280' deep, or about $24 /foot. 1 Drilling the well hole, installing the casing (a tubular lining that prevents the well hole from collapsing) and adding a well cap (a tight-fitting, vermin-proof top seal) typically costs $15-$30 per foot, or $1,500-$3,000 for a 100' deep well, and $6,000-$12,000 for a 400' well."}, {"url": "http://www.bestplaces.net/cost_of_living/state/florida", "passage_text": "Our cost of living indices are based on a US average of 100. An amount below 100 means Florida, Florida is cheaper than the US average. A cost of living index above 100 means Florida, Florida is more expensive. Overall, Florida, Florida cost of living is 98.70. "}, {"url": "http://www.sortfix.com/septic-tank-installation/fl.php", "passage_text": "SortFix can help you save time and money on Florida septic tank installation. When you use SortFix to hire a septic tank installation contractor in Florida you know that you can expect to pay between $4,312 and $6,540. The average cost for septic tank installation in Florida is $4,466. When you hire a Florida septic tank installation contractor from SortFix you know that you'll be working with a fully licensed and insured, highly rated contractor. "}, {"url": "http://www.answers.com/Q/How_much_does_it_cost_to_drill_a_water_well_in_Central_Florida", "passage_text": "It depends how deep they have to drill for the water. ANS 2 -In Canada it currently costs about $48 per foot plus a 'set up ' charge of approximately $3,500. - In my area an … average well is anywhere between 100 and 200 feet deep, so that cost would be $8,300 to $13,000. A minimum acceptable flow rate for a family   of 4 would be about 3 gallon … s per minute into the well.     A good (good flow rate, we aren't taking about   the quality of the water here, just the volume) well   would produce 5 or more gallons per minute."}, {"url": "http://home.costhelper.com/well-drilling.html", "passage_text": "1 This brings the typical total for drilling a well and setting up a private water delivery system to $3,500-$20,000 or more, but an especially deep and difficult well with a complex water system can cost $20,000-$50,000 or more, depending on depth, water yield and system complexity. 1 Drilling the well hole, installing the casing (a tubular lining that prevents the well hole from collapsing) and adding a well cap (a tight-fitting, vermin-proof top seal) typically costs $15-$30 per foot, or $1,500-$3,000 for a 100' deep well, and $6,000-$12,000 for a 400' well."}]