[{"url": "http://famouswonders.com/tallest-mountains-in-the-world-top-10-list/", "passage_text": "Below are the ten highest of these fourteen mountains. Mount Everest. Standing at about 29,029 feet (8,848 meters), Everest boasts the top spot for the tallest mountain in the world. It is located on the border between Sagarmatha Zone, Nepal, and Tibet, China and is part of the Himalayan Mountain Range."}, {"url": "http://10mosttoday.com/10-highest-mountains-in-the-world/", "passage_text": "Mount Everest – highest mountain in the world. 2. K2, Baltoro Karakoram – The second highest mountain in the world and the only one outside the Himalayas in the top 10 highest mountains, with a peak of 8,611 meters (28,251 ft). Located on the border between Pakistan and China. K2 Mountain."}, {"url": "http://www.wonderslist.com/top-10-highest-mountains-in-the-world/", "passage_text": "Nanga Parbat is the world’s ninth tallest mountain and stands at about 26,660 feet (8,126 meters) in height. Although the name is Urdu for “Naked Mountain”, for first half of the twentieth century it was known as “Killer Mountain”. It was called this because it used to be an incredibly dangerous climb to the top."}, {"url": "http://geography.about.com/od/lists/a/highestpeaksus.htm", "passage_text": "List of the Top 20 Highest Mountain Peaks in the U.S. Mount McKinley (also known as Denali) covered in spring snow. Mount McKinley is the tallest mountain and highest peak in the United States and North America. Eastcott Momatiuk/Getty Images."}, {"url": "http://www.top10hq.com/top-10-highest-mountains-us/", "passage_text": "Top 10 Highest Mountains in the US. Just like all the highest mountains in the world are in the Himalayan mountains (the top 100 even), the top 10 highest peaks in the USA can all be found in Alaska. Number 12 would be the first mountain outside of Alaska: Mount Whitney in California, 14.505 feet high."}, {"url": "http://www.africaranking.com/top-10-highest-mountains-in-africa/", "passage_text": "Africa is the world’s second-largest continent. It is the largest of the three great southward projections from the largest landmass of the earth. East Africa’s Great Rift Valley is home to some of Africa’s highest mountains. Here are the top 10 highest mountains in Africa, ranked according their heights."}]