[{"url": "http://thebeerladyspeaks.com/?p=255", "passage_text": "Drambuie is one of several whiskey-based liqueurs. It’s a kissing cousin to other classics like Southern Comfort or Irish Mist, but each starts with a different type of whiskey. Or in this case, whisky, since Drambuie is based on Scotch. The Scotch is sweetened with heather honey and then flavored with herbs and spices. Those herbs and spices are a closely guarded secret, but over the years, Drambuie fans have made a hobby of trying to guess them. Common suggestions are saffron, anise, nutmeg, and cinnamon, but we’ll probably never know."}, {"url": "https://en.wikipedia.org/wiki/Drambuie", "passage_text": "Drambuie /draemˈbuːi/ dræmˈbuːi is a, sweet golden coloured40 % abv liqueur made from scotch, whisky, honey herbs and. Spices the brand had been owned by MacKinnon mackinnon family for a hundred years but was bought By William & Grant sons in. 2014 Only twelve cases were originally sold. In 1916, Drambuie became the first liqueur to be allowed in the cellars of the House of Lords, and Drambuie began to ship world-wide to stationed British soldiers. More recently work has been done to strengthen the reputation of the brand after a downturn in popularity and sales."}, {"url": "http://www.culinarylore.com/food-history:what-is-drambuie", "passage_text": "Drambuie is a Scottish liqueur. Developed in 1745, it is made with a fine aged Scottish malt whiskey to which a blend of heather honey and a secret collection of herbs and spices is added. It uses 1.5 ounces gin and Drambuie to one ounce Scotch, and 1 tsp of lemon juice, all of which are shaken in a mixer and strained into a glass, with ice added. Cherry and lemon twist is the usual garnish."}, {"url": "http://www.barnonedrinks.com/tips/dictionary/d/drambuie-liqueur-417.html", "passage_text": "DRAMBUIE Liqueur is a secret recipe of herbs, spices and heather honey, crafted with aged scotch whiskies. It was created in 1745 as the personal elixir for Scotland s rebel Prince Charles Edward Stuart (known as Bonnie Prince Charlie). DRAMBUIE: A Mystery Uncovered. 1  DRAMBUIE Liqueur is first created for Prince Charles Edward Stuart, grandson of the last Stuart King of Britain. 2  This secret elixir is crafted especially for him by his personal royal apothecary, upon his return from exile in Italy."}, {"url": "https://en.wikipedia.org/wiki/Drambuie", "passage_text": "Drambuie was first commercially produced in Union Street in Edinburgh in 1910. In c.1940, the company moved to bonded premises in Dublin Street Lane where the liquor was compounded (the process of flavouring and sweetening the whisky spirit). Only twelve cases were originally sold. In 1916, Drambuie became the first liqueur to be allowed in the cellars of the House of Lords, and Drambuie began to ship world-wide to stationed British soldiers. More recently work has been done to strengthen the reputation of the brand after a downturn in popularity and sales."}, {"url": "https://en.wikipedia.org/wiki/Drambuie", "passage_text": "Drambuie /draemˈbuːi/ dræmˈbuːi is a, sweet golden coloured40 % abv liqueur made from scotch, whisky, honey herbs and. spices Only twelve cases were originally sold. In 1916, Drambuie became the first liqueur to be allowed in the cellars of the House of Lords, and Drambuie began to ship world-wide to stationed British soldiers. More recently work has been done to strengthen the reputation of the brand after a downturn in popularity and sales."}, {"url": "http://cocktails.about.com/od/liqueurscordials/p/drambuie_liqueur.htm", "passage_text": "What is Drambuie?: Drambuie is a sweet, gold colored liqueur with a Scotch whisky base that is accented with the flavors of Scottish heather honey, herbs, and spices. The whisky is a blend of malts from the Speyside and Highland regions of Scotland. Beyond the 'original' bottling of Drambuie, two other expressions are now available. Both are preferred to be served neat or over ice. 1  Drambuie 15 - This expression uses a selection of 15 year old Speyside malts. 2  This is a drier liqueur with a velvet mouthfeel and warming, soft malt notes."}, {"url": "http://www.culinarylore.com/food-history:what-is-drambuie", "passage_text": "A Whiskey Zipper is a little Drambuie mixed with Canadian Club whiskey, maraschino liqueur, and lemon juice. 2 ounces of Canadian Club, 1/2 ounce maraschino liqueur, one tablespoon Drambuie, and one teaspoon lemon juice are mixed stirred with ice. It uses 1.5 ounces gin and Drambuie to one ounce Scotch, and 1 tsp of lemon juice, all of which are shaken in a mixer and strained into a glass, with ice added. Cherry and lemon twist is the usual garnish."}, {"url": "http://www.culinarylore.com/food-history:what-is-drambuie", "passage_text": "A version of this drink is made with Scotch, bitters, and sugar. The Drambuie version uses vermouth. Shake with ice, one ounce Scotch whiskey, one once Drambuie, 1/2 ounce dry vermouth. Strain into a martini or cocktail glass. It uses 1.5 ounces gin and Drambuie to one ounce Scotch, and 1 tsp of lemon juice, all of which are shaken in a mixer and strained into a glass, with ice added. Cherry and lemon twist is the usual garnish."}, {"url": "http://www.culinarylore.com/food-history:what-is-drambuie", "passage_text": "An Old Nick is made with Canadian Club whiskey, Drambuie, orange juice, lemon juice, and orange bitters. 1.5 ounces Canadian Club, 1/2 ounce Drambuie, 1/2 ounces each, orange and lemon juice, and 3 dashes or orange bitters are combined in a shaker half-filled with ice. It uses 1.5 ounces gin and Drambuie to one ounce Scotch, and 1 tsp of lemon juice, all of which are shaken in a mixer and strained into a glass, with ice added. Cherry and lemon twist is the usual garnish."}]