[{"url": "http://www.rebuildyourvision.com/blog/vision-conditions/glaucoma/best-eye-vitamins-for-glaucoma/", "passage_text": "Vitamins for Preventing and Treating Glaucoma. When trying to prevent or treat glaucoma, it is really important to get enough antioxidants. For example, you will want to make sure you are getting enough vitamin C, vitamin A, and zinc. All of these nutrients function as antioxidants. Generally speaking, a great source of antioxidants in general is green tea. in Glaucoma. Glaucoma is a serious eye condition that needs to be diagnosed by an eye care specialist. But even though the eye doctor can recommend several treatment options to help those suffering from glaucoma, you can also take steps on your own to treat (or better yet, prevent) glaucoma."}, {"url": "http://www.orthomolecular.org/library/jom/1995/articles/1995-v10n0304-p165.shtml", "passage_text": "5 In ophthalmology we need to give vitamin C supplements for any of the glaucoma surgeries and for that matter with all our surgeries. The lens in the eye is necessary for maintaining the normal level of ascorbic acid within the aqueous humor, vitreous body and the cornea. In this series of 30 patients there was no occasion in which the pressure was not lowered with vitamin C. All drugs for glaucoma are seriously toxic, and vitamin C has no toxicity yet known."}, {"url": "http://www.mayoclinic.org/diseases-conditions/glaucoma/expert-answers/eye-vitamins/FAQ-20057936", "passage_text": "I have glaucoma. Probably not. Several dietary supplements are marketed as eye vitamins. But little evidence supports using these products for preventing glaucoma or reversing vision loss due to glaucoma. Few clinical trials of eye vitamins or supplements for glaucoma have been conducted. One study showed that taking folic acid may reduce the risk of some types of glaucoma. Another showed that vitamin C may decrease the chance of getting glaucoma. More research is needed to understand the possible role of vitamins or supplements in preventing or treating"}, {"url": "http://www.newsmax.com/FastFeatures/glaucoma-natural-treatment-eyes/2011/03/17/id/371824/", "passage_text": "Glaucoma can be a debilitating condition patients can lose their eyesight if they do not keep the pressure in their eyes under control. Medicines for glaucoma have several side effects, so using natural supplements may be a good alternative. The top natural supplements for glaucoma are: Vitamin C. Vitamin C has been successfully used to treat internal eye pressure whith promising results within a week’s time. Vitamin C can also be ingested in the form of Sodium Ascorbate. Glaucoma can be a debilitating condition — patients can lose their eyesight if they do not keep the pressure in their eyes under control. Medicines for glaucoma have several side effects, so using natural supplements may be a good alternative. The top natural supplements for glaucoma are:"}, {"url": "http://www.glaucoma.org/treatment/update-on-alternative-glaucoma-medications.php", "passage_text": "In research studies, vitamins have had little or no effect as a glaucoma treatment. Use of alternative therapies is increasing. A simple definition: non-standard, unconventional therapy for treating glaucoma. In the US, use of alternative medicine has increased 10 to 15 percent in the past ten years. "}, {"url": "http://www.drwhitaker.com/natural-treatment-for-glaucoma/", "passage_text": "Natural Treatment for Glaucoma. Vitamin C supplementation is safer and far more effective than traditional drug treatment for glaucoma. At 1,500 mg daily, using this vitamin has led to almost-normal eye pressure levels. In an acute situation, Vitamin C can be given intravenously to affect a greater initial pressure reduction. "}, {"url": "http://www.rebuildyourvision.com/blog/vision-conditions/glaucoma/best-eye-vitamins-for-glaucoma/", "passage_text": "Other Options to Help Prevent Glaucoma. While glaucoma is a serious disease, you can use the vitamins described above to supplement your treatment, or to simply help prevent glaucoma. In addition to these vitamins, you should check out our 17 recommended vitamins, herbs, and minerals for healthy eyes. in Glaucoma. Glaucoma is a serious eye condition that needs to be diagnosed by an eye care specialist. But even though the eye doctor can recommend several treatment options to help those suffering from glaucoma, you can also take steps on your own to treat (or better yet, prevent) glaucoma."}, {"url": "http://www.bausch.com/your-eye-concerns/diseases-and-disorders/glaucoma", "passage_text": "Glaucoma. Glaucoma occurs when a build-up of fluid creates pressure in the eye, which then damages the optic nerve. The optic nerve is responsible for the transmission of information from your eyes to your brain, and damage associated with it can lead to severe vision loss, and in the worst case, blindness. "}, {"url": "http://vitamins.lovetoknow.com/Natural_Vitamins_for_Glaucoma", "passage_text": "Natural Vitamins for Glaucoma. Nutritional supplements and dietary changes can slow the progress of glaucoma, if you catch the disease in its early stages. If you plan to try taking natural vitamins for glaucoma, it is always best to do it in conjunction with a treatment plan set forth by your doctor. Glaucoma. Glaucoma is an eye disease that robs you of your sight. One of the risk factors of optic nerve damage is pressure in the eye. Glaucoma is a progressive disease that may be hereditary."}]