[{"url": "http://earthsky.org/brightest-stars/solitary-fomalhaut-guards-the-southern-sky", "passage_text": "Fomalhaut is sometimes called the Loneliest Star. Its planet Fomalhaut b was the first beyond our solar system to be visible to the human eye. The star Fomalhaut is an autumn star for the Northern Hemisphere (spring star for the Southern Hemisphere). From our northerly latitudes, it’s sometimes called the Loneliest Star. These astronomers argue that Fomalhaut b is indeed a planet, surrounded by dust in Fomalhaut’s observed dusty disks. Meanwhile, in the same year, the work of other astronomers suggested that the light of Fomalhaut b cannot be explained as due to direct or scattered radiation from a massive planet."}, {"url": "https://en.wikipedia.org/wiki/Fomalhaut_b", "passage_text": "Fomalhaut b is orbiting its host star at a wide separation, where forming massive planets is difficult. To explain its current location, Fomalhaut b could have been dynamically scattered by a more massive, unseen body located at smaller separations. The revival of the claim that Fomalhaut b is (possibly) a planet after it had been discounted led some to nickname the object a zombie planet, although this is a non-technical term that does not appear in any paper."}, {"url": "http://www.nasa.gov/mission_pages/hubble/science/rogue-fomalhaut.html", "passage_text": "Among several scenarios to explain Fomalhaut b's 2,000-year-long orbit is the hypothesis that an as yet undiscovered planet gravitationally ejected Fomalhaut b from a position closer to the star, and sent it flying in an orbit that extends beyond the dust belt. Kalas hypothesized that Fomalhaut b's extreme orbit is a major clue in explaining why the planet is unusually bright in visible light, but very dim in infrared light. It is possible the planet's optical brightness originates from a ring or shroud of dust around the planet, which reflects starlight."}, {"url": "http://www.space.com/19187-zombie-planet-shocking-orbit.html", "passage_text": "Among the several theories to explain Fomalhaut b's extreme orbit is the possibility that the exoplanet had an encounter with another planet, a yet-to-be discovered neighbor. The cosmic close encounter could have gravitationally ejected Fomalhaut b into its current orbit, scientists said. New observations of the planet Fomalhaut b by the Hubble Space Telescope revealed the oddball orbit, which has wild extremes between its closest and farthest points from the parent star and appears to cross through a vast minefield of dusty debris."}, {"url": "https://en.wikipedia.org/wiki/Fomalhaut_b", "passage_text": "Fomalhaut b is a confirmed, directly imaged extrasolar object and candidate planet orbiting the A-type main-sequence star Fomalhaut, approximately 25 light-years away in the constellation of Piscis Austrinus. The revival of the claim that Fomalhaut b is (possibly) a planet after it had been discounted led some to nickname the object a zombie planet, although this is a non-technical term that does not appear in any paper."}, {"url": "http://earthsky.org/brightest-stars/solitary-fomalhaut-guards-the-southern-sky", "passage_text": "Artists’ conception of what a planet orbiting Fomalhaut might have to endure as it plows through the dusty disk around this star. Image via NASA. Fomalhaut’s candidate planet. Fomalhaut, which is known to be surrounded by several debris disks, holds a special place in the search for planets beyond our solar system. In 2008, scientists announced a visible planet for Fomalhaut. It was the first extrasolar planet visible to the eye in photographic images. These astronomers argue that Fomalhaut b is indeed a planet, surrounded by dust in Fomalhaut’s observed dusty disks. Meanwhile, in the same year, the work of other astronomers suggested that the light of Fomalhaut b cannot be explained as due to direct or scattered radiation from a massive planet."}, {"url": "https://en.wikipedia.org/wiki/Fomalhaut", "passage_text": "Fomalhaut holds a special significance in extrasolar planet research, as it is the center of the first stellar system with an extrasolar planet candidate (Fomalhaut b) imaged at visible wavelengths. The image was published in Science in November 2008. Measurements of Fomalhaut's rotation indicate that the disk is located in the star's equatorial plane, as expected from theories of star and planet formation. On November 13, 2008, astronomers announced an object, which they assumed to be an extrasolar planet, orbiting just inside the outer debris ring."}, {"url": "http://www.space.com/19187-zombie-planet-shocking-orbit.html", "passage_text": "'Zombie planet' gets weirder. Fomalhaut b is a giant alien planet that is nearly three times the mass of Jupiter. It was the first alien planet ever directly imaged in visible light. The planet orbits the dust-shrouded star Fomalhaut and is located about 25 light-years away in the constellation Piscis Austrinus. New observations of the planet Fomalhaut b by the Hubble Space Telescope revealed the oddball orbit, which has wild extremes between its closest and farthest points from the parent star and appears to cross through a vast minefield of dusty debris."}, {"url": "http://solstation.com/stars/fomalhau.htm", "passage_text": "Habitable Zone The distance from Fomalhaut where an Earth-type planet would be comfortable with liquid water is centered around 4.1 AU -- between the Main Asteroid Belt and Jupiter in the Solar System. At that distance from the star, such a planet would have an orbital period of about 5.5 Earth years. "}, {"url": "https://en.wikipedia.org/wiki/Fomalhaut_b", "passage_text": "Assuming that Fomalhaut b's orbit is in the same plane as the debris disk located exterior to it, it orbits Fomalhaut at a distance of approximately 115 AU (1.72 × 10 10 km; 1.07 × 10 10 mi). This distance is about 18 AU (2.7 × 10 9 km; 1.7 × 10 9 mi) closer to the star than the inner edge of the debris disk. The revival of the claim that Fomalhaut b is (possibly) a planet after it had been discounted led some to nickname the object a zombie planet, although this is a non-technical term that does not appear in any paper."}]