[{"url": "http://www.uscourts.gov/services-forms/jury-service/juror-qualifications", "passage_text": "To be legally qualified for jury service, an individual must: 1  be a United States citizen; 2  be at least 18 years of age; 3  reside primarily in the judicial district for one year; 4  be adequately proficient in English to satisfactorily complete the juror qualification form; 5  have no disqualifying mental or physical condition; "}, {"url": "http://www.dailymail.co.uk/news/article-2397683/Age-limit-jury-service-raised-75-Change-law-reflect-longer-life-expectancy.html", "passage_text": "57. View. comments. The maximum age for jury service is to be raised to 75, ministers will announce today. Under existing rules, 69 is the age limit for a juror but the Government intends to change the law to include those aged 70 to 75. This will add two million to the list of potential jurors. "}, {"url": "http://www.kingcounty.gov/courts/SuperiorCourt/Juror/FAQ.aspx", "passage_text": "All jurors need to be at least 18 years of age. No citizen over 18 is excluded from consideration due to age. If your physician feels you are physically unable to perform the duties of a juror or are unable to travel to the courthouse, please ask her/him to submit a letter to the court supporting an exemption. "}, {"url": "http://www.experts123.com/q/what-is-the-age-limit-for-serving-jury-duty.html", "passage_text": "0. If you are over 70 years of age, you are not obligated to serve jury duty. You must show proof of your age in order to be permanently excused.Of course, if you are over 70and wish to serve, you may. Related Videos. 0. If you are seventy years of age or older you are not obligated to serve jury duty. You must show proof of your age in order to be permanently excused.Of course, if you are 70 or over and wish to serve you may."}, {"url": "http://www.judiciary.state.nj.us/juryreporting/juryfqa.pdf", "passage_text": "● You are 75 years of age or older. There is not an upper age limit to serve as a juror. You must be at least 18 years of age to serve. However, if you are 75 years of age or older, you may be excused from jury duty at your request. No medical excuse is required. However, if you are 75 years of age or older, you may be excused from jury duty at your request, in accordance with statutory grounds for excuse from juror service without requiring documentation of a medical condition or other grounds for excuse. ● Language-You are required to be able to read and understand English."}, {"url": "http://www.occourts.org/media/pdf/Jury-FAQs.pdf", "passage_text": "Q: How many days will I have to serve as a juror? A: Jury service in Orange County is for one day or one trial. If you are not selected to serve on a trial by the end of the first day and are not ordered by the Court to return for a second or subsequent day of jury selection, your service will be complete. A: Jury service may be postponed for approximately 4 to 6 months, through the eJuror online application at www.occourts.org/ejuror, no later than five days prior to your service date, or by calling the Office of the Jury Commissioner at 657-622-7000."}, {"url": "http://www.cand.uscourts.gov/juryfaq", "passage_text": "You may be excused from service on request if you: 1  Are 75 years of age or older; 2  Have reported to court for jury service in the past 12 months. 3  You must have been present in court for at least one day and must provide a certificate of attendance from the other court showing the date(s) you were present; If you are not selected as a juror when you report, your service will be over when jury selection is complete. If you are selected to serve on a trial, you must serve the length of the trial; when the trial is over, your service"}, {"url": "http://www.cand.uscourts.gov/juryfaq", "passage_text": "You may be excused from service on request if you: 1  Are 75 years of age or older; 2  Have reported to court for jury service in the past 12 months. 3  Are solely responsible for the care of a pre-school child or an aged or infirm person and you are not employed outside the home; 4  Reside more than 80 miles from the courthouse to which you are summoned; 5  Serv If you are not selected as a juror when you report, your service will be over when jury selection is complete. If you are selected to serve on a trial, you must serve the length of the trial; when the trial is over, your service"}]