[{"url": "http://www.foods-healing-power.com/types-of-beans-2.html", "passage_text": "Of all the different types of beans, kidney beans and cannellini beans, require proper cooking methods. If you buy dried kidney beans, it's important to cook them properly. This is because kidney beans contain a natural toxin (called lectin phytohaemagglutinin) that can cause stomach aches and vomiting. "}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/in-depth/legumes/art-20044278", "passage_text": "Beans and other legumes: Cooking tips. This guide describes common types of beans and legumes, tips for preparing them, and ways to add more legumes to your meals and snacks. Legumes — a class of vegetables that includes beans, peas and lentils — are among the most versatile and nutritious foods available. 1 In a stockpot, cover 1 pound dried beans with 10 cups water. 2  Cover and refrigerate for at least 4 hours or overnight. 3  Quick soak. 4  In a stockpot, bring 1 pound of dried beans and 10 cups of water to a boil."}, {"url": "http://www.motherearthnews.com/organic-gardening/vegetables/growing-dry-beans-and-peas-zm0z14amzsto.aspx", "passage_text": "Dry beans and peas are a healthy staple crop that can be stored long into winter. With a huge variety of colorful pods and seed shapes and colors, it’s almost impossible to grow every kind of bean and pea variety available. Pictured here is the ‘Good Mother Stallard’ dry bean. You could eat the dry seeds from any green bean or pea, but certain bean and pea varieties grown for their higher yields of flavorful, nutrient-dense seeds are a better use of garden space. When growing dry beans and peas in most climates, plant after your spring crops so they mature in dry fall weather."}, {"url": "http://www.foodsubs.com/Beans.html", "passage_text": "pinto bean Equivalents: 1 pound of dried beans = 2 cups dried beans = 6 cups of cooked beans Notes: The dried beans are beige with brown streaks, but they turn a uniform pinkish-brown when cooked. They're often used to make refried beans and chili. rattlesnake bean Equivalents: One cup dried beans = 2.5 cups cooked beans Notes: A pinto bean hybrid, the rattlesnake bean gets its name from the way its bean pods twist and snake around the vines and poles. These beans are great for making chili, refried beans, soups, or casseroles."}, {"url": "http://www.harvesttotable.com/2007/09/beans/", "passage_text": "Dry beans are beans left to mature and then dry on the vine. The seeds of dried beans are sometimes called soup beans. Dry beans are shelled and then usually soaked in water before cooking. Dry beans include the black or turtle bean, Great Northern, kidney, cannellini, navy, pinto, red, and white bean. A glossary of specific bean varieties and broader bean classifications: Vigna flower; flower of the Azuki bean. Azuki Bean or Adzuki Bean (Vigna angularis): small, somewhat square bean shelled at plump green stage or allowed to dry on the vine and shelled; small red bean dried. Slightly sweet tasting."}, {"url": "http://www.americanbean.org/bean-types/", "passage_text": "Beans | Types. Besides adding nutritional value to a meal, dry beans bring a variety of colors, textures and flavors to the table. Because there are so many bean varieties available – each with its own unique characteristics – beans are a versatile ingredient that can be used in virtually any type of cooking. The following chart gives a brief overview and cooking suggestions for some of the most popular bean varieties."}, {"url": "https://cedarcirclefarm.org/tips/entry/our-fresh-dried-beans1", "passage_text": "Heirlooms beans are so gorgeous! This is a mix of calypso, tiger’s eye, red kidney and VT cranberry. Red kidney beans. Pinto beans. Cannelini beans. Tiger’s eye beans. Hutterite soup bean. Learn some new varieties! At Cedar Circle Farm, we grow a number of different types of dry beans of many shapes and sizes. Especially in New England, bean cultivars are almost endless, some having no name and being grown only within a family or circle of close friends."}, {"url": "http://www.ers.usda.gov/topics/crops/vegetables-pulses/dry-beans.aspx", "passage_text": "Americans use dry edible beans in many ways and sometimes use different varieties in similar ways. All varieties are available dry in consumer or foodservice packages. Canned products include refried beans, soups, chilis, and baked beans. High-starch bean flour from dry beans is used in a variety of baked goods. California is the sixth-leading producer of dry beans, producing about 5 percent of the U.S. crop in 2006-08. California's climate is favorable for most types of dry beans, with a wide variety produced annually. However, four bean classes dominate (accounting for 86 percent of output)"}, {"url": "https://en.wikipedia.org/wiki/Bean", "passage_text": "Dry beans come from both Old World varieties of broad beans (fava beans) and New World varieties (kidney, black, cranberry, pinto, navy/haricot). Beans are a heliotropic plant, meaning that the leaves tilt throughout the day to face the sun. At night, they go into a folded sleep position. The term is now applied generally to many other related plants such as Old World soybeans, peas, chickpeas (garbanzo beans), vetches, and lupins. Bean is sometimes used as a synonym of pulse, an edible legume, though the term pulses is more correctly reserved for leguminous crops harvested for their dry grain."}]