[{"url": "http://www.wiltshire.ac.uk/learning/study_skills/basic_skills/singular_plural.asp", "passage_text": "Adding 's' to words that end in 'y'. To make the plural of words that end in ' y ', check if the letter before the ' y ' is a vowel or a consonant. If it is a vowel (if the word ends ay, ey, oy) then add ' s ': One day - 7 days, a toy-several toys, one monkey - 3 monkeys."}, {"url": "http://www.handsonteaching.co.uk/docs/H.O.T.%20Example%20Of%20Worksheets,%20Activities%20&%20Games%20Mutisensory%20Plural%20Worksheets%20Rules%203%20And%204.pdf", "passage_text": "“y” preceded by a consonant form their plural by changing “y” to “i” and adding “es”. ies Nouns ending in “y” preceded by a vowel form their plurals by add-ing “s”. s Spies Looking For Pennies 9 Word Spelling Sheet Spelling sheet for collection of 9 words of either plural “s” or plural “ies”."}, {"url": "http://data.grammarbook.com/blog/apostrophes/tips-on-apostrophes-with-names/", "passage_text": "Given how other English words ending in y form their plurals, you would think so. Examples: puppy / puppies army / armies supply / supplies. However, proper nouns are not pluralized the same way common nouns are. Rule: Do not change the spelling of a name to make it plural. Instead, just add s."}, {"url": "http://www.wikihow.com/Use-Plurals-and-Possessives-in-Writing", "passage_text": "1 Some words ending in -o preceded by a consonant can form their plurals using either -es or -s.. 2  The plural of tornado can be written either tornadoes or tornadoes, and the plural of volcano can be written either volcanoes or volcanoes."}, {"url": "http://www.oxforddictionaries.com/words/plurals-of-nouns", "passage_text": "Nouns ending in-y. If the noun ends with a consonant plus-y, make the plural by changing-y to-ies : If the noun ends with-ch, -s, -sh, -x, or-z, add-es to form the plural: There’s one exception to this rule."}, {"url": "http://www.edufind.com/english-grammar/plural-nouns/", "passage_text": "A singular noun ending in s, x, z, ch, sh makes the plural by adding-es. A singular noun ending in a consonant and then y makes the plural by dropping the y and adding-ies. There are some irregular noun plurals."}, {"url": "http://www.wiltshire.ac.uk/learning/study_skills/basic_skills/singular_plural.asp", "passage_text": "Words ending in 'y' with a consonant before it, change the 'y' to 'i' and add 'es'. Consonants = all the letters in the alphabet once the vowels are removed. Words ending in 'o' like potato, tomato, hero-add 'es' but other words like photo, piano, studio, dynamo-add 's'."}, {"url": "http://www.answers.com/Q/To_make_words_ending_in_y_plural", "passage_text": "Nouns ending in-y, preceded by a vowel are made plural by adding an-s. Examples: boys, toys, clays, trays Nouns ending in-y, preceded by a consonant are made plural by … dropping the-y and adding-ies. Examples: babies, ladies, parties, armies."}, {"url": "http://www.ehow.com/how_5744850_make-singular-word-plural.html", "passage_text": "For example, if a word ends in a consonant and a-y, you'll need to change the-y to an-i and add-es. Words that end in-f or-fe usually change the-f to a-v sound and end in-ves. Familiarize yourself with the spellings of the most common irregular plural nouns. Some, such as deer and sheep, don't change at all."}]