[{"url": "http://www.gurnnurn.com/", "passage_text": "Get up to date on both Common Good related issues in this week's paper. Plenty more in the Nainrshire this week including an obituary for Nigel Graham. Also extensive sports reporting including the details of 10-man Nairn County going down to a penalty at Turriff. Four trips to Aberdeenshire this year in the league so far and four defeats. County will be looking to the Scottish Cup tie against Wick this Saturday to restore some impetus to their season. Agreement reached to keep Nairn hydrotherapy pool. A formal agreement has been reached which guarantees the future of a privately run hydrotherapy pool in Nairn for the next three years.. More on the Press and Journal website."}, {"url": "https://en.wikipedia.org/wiki/Nairn", "passage_text": "Nairn is also the home of Scottish Under-21 champion Kelsey MacDonald – currently a top Scottish female amateur. The local football team is Nairn County F.C. , who play in the Highland Football League. It is an ancient fishing port and market town around 16 miles (26 km) east of Inverness. It was the county town of the wider county of Nairn also known as Nairnshire."}, {"url": "http://www.facebook.com/nairncountyfc", "passage_text": "GALLERY: A penalty kick from Artjoms Kuznecovs was all that prevented 10-man Nairn County from taking a point at Turriff United on Saturday. Kenny Macleod (Cutter Photography) captured all of the action. http://www.nairncountyfc.co.uk/youth.php. Nairn County Football Club-Official Website of the Highland League TeamTHERE were six different scorers as the under-15s recorded an impressive win away at Clachnacuddin ‘B’ on Sunday."}, {"url": "http://freepages.genealogy.rootsweb.ancestry.com/~hughwallis/IGIBatchNumbers/CountyNairn.htm", "passage_text": "Click on the batch number of interest and enter the surname you are searching for to be taken to the relevant search results at familysearch.org. Some towns are listed in the IGI under more than one county. Where batch numbers for a town with the same name have been found in a different county as well as this one, that county appears in the Other Counties column as a clickable link (or more than one if appropriate). Sometimes the same town will be listed with a different county even in the same batch. It should be remembered that much of the indexing performed by the LDS was done by people (who were all volunteers, I believe) who were not familiar with the local geography."}, {"url": "http://www.nairncricket.co.uk/", "passage_text": "1 ExplosiveGames down The Links are always action packed. 2  Nigel ThornberryNairn's very own Brian Nigel Stewart features weekly at The Links. 3  The PavillionNairn's Pavillion is used by the Cricket Club and the Nairn Highland Games Committee. 4  Team SpiritNairn has a very strong sense of Team Spirit throughout the squad. 1 The LinksThe cricket field is overlooked by the Nairn Bandstand, often the place for wedding photos. 2  PicturesqueThe Black Isle is visible across the Moray Firth, and looks stunning on a good day. 3  Social SpiritNairn's Squad is a friendly one where making a fool of yourself is accepted."}, {"url": "http://www.facebook.com/nairncountyfc", "passage_text": "ANNOUNCEMENT: Nairn County Football Club are saddened to learn of the passing of Centenary Book co-author, Bill Logan. http://www.nairncountyfc.co.uk/youth.php. Nairn County Football Club-Official Website of the Highland League TeamTHERE were six different scorers as the under-15s recorded an impressive win away at Clachnacuddin ‘B’ on Sunday."}, {"url": "http://www.facebook.com/nairncountyfc", "passage_text": "October 17, 2015 Turriff United 1 Nairn County 0 - Report A PENALTY kick from Artjoms Kuznecovs condemned 10-man Nairn County to a battling defeat after Michael Morrison had been sent off for a second bookable offence just before half time, writes Graeme Macleod. It was an unchanged County team that…. http://www.nairncountyfc.co.uk/youth.php. Nairn County Football Club-Official Website of the Highland League TeamTHERE were six different scorers as the under-15s recorded an impressive win away at Clachnacuddin ‘B’ on Sunday."}, {"url": "http://www.facebook.com/nairncountyfc", "passage_text": "TEAM LINES: Nairn County are unchanged for this afternoon's trip to Turriff United. Gregg Main returns from suspension and is among the subs with Andrew Skinner unavailable. Turriff United-Main, Davidson, Allan, MacKenzie, Bowden, Kuznecovs, McKenna, Young, Gray, A. MacAskill, McGowan. http://www.nairncountyfc.co.uk/youth.php. Nairn County Football Club-Official Website of the Highland League TeamTHERE were six different scorers as the under-15s recorded an impressive win away at Clachnacuddin ‘B’ on Sunday."}, {"url": "https://en.wikipedia.org/wiki/Nairn", "passage_text": "Nairn (/ˈnɛərn/ NAIRN; Gaelic: Inbhir Narann) is a town and former burgh in the Highland council area of Scotland. It is an ancient fishing port and market town around 16 miles (26 km) east of Inverness. It was the county town of the wider county of Nairn also known as Nairnshire."}]