[{"url": "http://www.oxforddictionaries.com/definition/english/oaf", "passage_text": "More. The word oaf goes back to Old Norse alfr ‘an elf ’. It originally meant ‘an elf's child, a changeling’, and from this came to be used for ‘an idiot child’, and then ‘fool’ or ‘halfwit’. "}, {"url": "http://www.urbandictionary.com/define.php?term=Oaf", "passage_text": "Oaf. (n.) Unintelligent, tall clumsy person with large hands and feet, and a small penis. Competes in sports while using simplified language such as 'Gareth throw discus'. Oafs have big skulls and limited intelligence. Slow witted and plodding in speech. "}, {"url": "http://tekslate.com/oaf/", "passage_text": "Oracle Application Framework (OA Framework or OAF) is a framework developed by Oracle Corporation for application development within the Oracle E-Business Suite (EBS). Oracle Application Framework (OAF) provides visual and declarative approaches to Java EE development. The OA framework is also available to customers for personalization’s, customizations and custom-application development. The OA Framework helps to create self Service pages in Oracle EBS. The OA Framework helps in controlling the flow of the application. OA Framework works on the basic Java EE principles."}, {"url": "http://www.solvusoft.com/en/file-extensions/file-extension-oaf/", "passage_text": "In the case that your OAF file doesn't open, it is highly likely that you do not have the correct software application installed on your PC to view or edit OAF file extensions. If your PC opens the OAF file, but it's the wrong application, you'll need to change your Windows registry file association settings. OAF File Opener. Download ». The fastest and easiest way to open your OAF file is to double-click it. This allows the intelligence of Windows to decide the correct software application to open your OAF file."}, {"url": "http://www.definitions.net/definition/oaf", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: oaf (Noun). An elf's child; a changeling left by fairies or goblins, hence, a deformed or foolish child. oaf (Noun). A person, especially a large male, who is clumsy or a simpleton; an idiot. Ouch! "}, {"url": "http://www.solvusoft.com/en/file-extensions/file-extension-oaf/", "passage_text": "In seconds, you will learn exactly what type of OAF file you have, the software program associated with your file, the publisher who created it, its security safety status, and a variety of other useful information. OAF File Opener. Download ». The fastest and easiest way to open your OAF file is to double-click it. This allows the intelligence of Windows to decide the correct software application to open your OAF file."}, {"url": "http://www.merriam-webster.com/dictionary/oaf", "passage_text": "Origin of OAF. alteration of auf, alfe goblin's child, probably from Middle English alven, elven elf, fairy, from Old English elfen nymphs; akin to Old English aelf ælf — elf more at. elf alteration of auf, alfe goblin's child, probably from Middle English alven, elven elf, fairy, from Old English elfen nymphs; akin to Old English aelf ælf — elf more at. Elf First Known: use. 1692"}, {"url": "http://www.merriam-webster.com/dictionary/oaf", "passage_text": "Origin of OAF. alteration of auf, alfe goblin's child, probably from Middle English alven, elven elf, fairy, from Old English elfen nymphs; akin to Old English aelf ælf — elf more at. Elf First Known: use. 1692"}, {"url": "https://en.wikipedia.org/wiki/Oracle_Application_Framework", "passage_text": "Oracle Application Framework (OAF) is an architecture for creating web based front end pages and J2EE type of applications within the Oracle EBS ERP platform. In order to develop and maintain OAF functionality, Oracle's JDeveloper tool is used. OAF is based on J2EE technology called BC4J (Business Components for Java). As per the MVC architecture, in OAF, the XML Page forms the View, the JAVA based controller class forms the controller and the Application Module along with View Objects (VO) and Schema Objects (EO) forms the Model. The framework is also available to customers for personalizations, customizations and custom-application development."}, {"url": "https://en.wikipedia.org/wiki/Oracle_Application_Framework", "passage_text": "This Framework helps to create Self Service pages in Oracle EBS. These pages are designed to be familiar to web-based users, and easy to deploy within a web browser (requiring no plugin or download, unlike Oracle Forms). The framework is also available to customers for personalizations, customizations and custom-application development."}]