[{"url": "http://www.allnursingschools.com/nursing-careers/article/neonatal-nursing/", "passage_text": "1 You must be certified in Neonatal Resuscitation and/or Neonatal Intensive Care Nursing. 2  You may also be required to complete a minimum number of years of clinical experience in a hospital setting. 3  To become a neonatal nurse practitioner (NNP), you will also need a Master of Science in Nursing (MSN) degree. Neonatal Nurse Specialist Education. Entry-level requirements vary by location. At a minimum, you need to meet these requirements: 1  A neonatal nurse must be a registered nurse (RN) with a four-year Bachelor of Science in Nursing Degree (BSN)."}, {"url": "https://answers.yahoo.com/question/index?qid=20100719210602AAUbErX", "passage_text": "The options are: Master of Science (MS) as an Adult Nurse Practitioner Master of Science (MS) as a Pediatric Nurse Practitioner Post master's Adult Nurse Practitioner Certificate Post master's Pediatric Nurse... show more I need help deciding the best masters degree to become a neonatal nurse practitioner. The options are: Master of Science (MS) as an Adult Nurse Practitioner. Master of Science (MS) as a Pediatric Nurse Practitioner. Post master's Adult Nurse Practitioner Certificate."}, {"url": "http://www.nursing-school-degrees.com/Nursing-Careers/nicu-nurse.html", "passage_text": "A NICU nurse (Neonatal Intensive Care Unit nurse) works in the neonatal intensive care unit with newborns in the first 28 days of life who are critically ill or born prematurely and need advanced medical attention. Many nursing schools offer advanced practice neonatal nursing (APNN) programs, which require two years of study and clinical work. Once you have finished your nursing degree and gained some work experience, you may want to consider voluntary certification in neonatal nursing."}, {"url": "http://www.allnursingschools.com/nursing-careers/article/neonatal-nursing/", "passage_text": "Minimum degree you'll need to practice: You must be a registered nurse with a Bachelor of Science in Nursing (BSN) . Certification: You must become certified by your State Board of Nursing or receive a national certification from an agency such as the National Certification Corporation. Neonatal Nurse Specialist Education. Entry-level requirements vary by location. At a minimum, you need to meet these requirements: 1  A neonatal nurse must be a registered nurse (RN) with a four-year Bachelor of Science in Nursing Degree (BSN)."}, {"url": "http://www.allnursingschools.com/nursing-careers/article/neonatal-nursing/", "passage_text": "1 To become a neonatal nurse practitioner (NNP), you will also need a Master of Science in Nursing (MSN) degree. 2  Many neonatal nursing schools offer this degree through a two-year Advanced Practice Neonatal Nursing (APNN) program. Neonatal Nurse Specialist Education. Entry-level requirements vary by location. At a minimum, you need to meet these requirements: 1  A neonatal nurse must be a registered nurse (RN) with a four-year Bachelor of Science in Nursing Degree (BSN)."}, {"url": "http://www.innerbody.com/careers-in-health/how-to-become-a-neonatal-nurse.html", "passage_text": "Neonatal nurses are the experts who care for newborns in a nursery setting; the neonatal period is considered to be the first 28 days of an infant’s life, but neonatal nurses may work with babies for much longer. After graduation, training is provided by the employer, both through classes and in the NICU through a mentorship or preceptor program. This formal training may take six weeks to three months, depending on a nurse’s prior experience and facility requirements."}, {"url": "http://www.allnursingschools.com/nursing-careers/article/neonatal-nursing/", "passage_text": "1 You may also be required to complete a minimum number of years of clinical experience in a hospital setting. 2  To become a neonatal nurse practitioner (NNP), you will also need a Master of Science in Nursing (MSN) degree. Neonatal Nurse Specialist Education. Entry-level requirements vary by location. At a minimum, you need to meet these requirements: 1  A neonatal nurse must be a registered nurse (RN) with a four-year Bachelor of Science in Nursing Degree (BSN)."}, {"url": "http://www.wikihow.com/Become-a-Neonatal-Nurse", "passage_text": "5. To become a neonatal nurse practitioner (NNP), you will also need a Master of Science in Nursing (MSN) degree. Many nursing schools offer this degree through a two-year Advanced Practice Neonatal Nursing (APNN) program. 1 A neonatal nurse must be a registered nurse (RN) with a four-year bachelor of science in nursing degree (BSN). 2  Try to maintain a grade point average above a 3.0 in college to set yourself up for desirable nursing programs."}]