[{"url": "http://raisingchildren.net.au/articles/leaving_children_home_alone.html", "passage_text": "There’s no one law in Australia that says at what age you can or can’t leave your child home alone. In Queensland if you leave a child under 12 years of age for an ‘unreasonable time’ without supervision you have committed a misdemeanour. However, the legislation also says that whether the time is unreasonable depends on all the relevant circumstances. "}, {"url": "http://leavingschoolinfo.com.au/info_ageforleaving.php", "passage_text": "Phone: (07) 3224 5536. Email: OfficeOfNonStateEducation@deta.qld.gov.au. South Australia. High school students in South Australia currently can leave school at 16 years of age, but will have to continue their education until they turn 17 years old. This means that young people in their 16th year through to 17 have to be either at school, at TAFE, in an apprenticeship or at work. So if a Year 10 student wants to leave school they can, but must ensure that they have a full time job/apprenticeship or traineeship or be completing further training outside of school until they turn 17 years old: To leave school to join the workforce."}, {"url": "http://www.lawstuff.org.au/qld_law/topics/school/when-can-i-leave-school", "passage_text": "Once you have completed Year 10 or turned 16 you can leave school, but you need to be in some form of full-time education, work or training: 1  for another two years; or. 2  until you have gained a certificate of achievement, senior statement, certificate III or certificate IV; or. 3  until you turn 17 years old. I’d like to know if I’m allowed to leave school before I’m 16 years old. A. Hi Sarah, the general rule in Queensland is that you have to be in school, or be home schooled until you are 16 years old or finish Year 10."}, {"url": "http://www.lawstuff.org.au/qld_law/topics/school/when-can-i-leave-school", "passage_text": "In Queensland, you have to go to school from when you turn 6 until you turn 16 or you finish Year 10, whichever comes first. I’d like to know if I’m allowed to leave school before I’m 16 years old. A. Hi Sarah, the general rule in Queensland is that you have to be in school, or be home schooled until you are 16 years old or finish Year 10."}, {"url": "http://www.lawstuff.org.au/qld_law/topics/school/when-can-i-leave-school", "passage_text": "Once you have completed Year 10 or have turned 16 you can leave school however you will still need to be involved in some form of further education or training: 1  for another two years; or. 2  until you have gained a certificate of achievement, senior statement, certificate III or certificate IV; or. I’d like to know if I’m allowed to leave school before I’m 16 years old. A. Hi Sarah, the general rule in Queensland is that you have to be in school, or be home schooled until you are 16 years old or finish Year 10."}, {"url": "http://leavingschoolinfo.com.au/info_ageforleaving.php", "passage_text": "Currently, Northern Territory students it is compulsory for all to complete Year 10, and or at the age of 17 years, whichever comes sooner. Those students who want to leave school after Year 10 are required in one or more eligible options for a total of 25 hours per week. So if a Year 10 student wants to leave school they can, but must ensure that they have a full time job/apprenticeship or traineeship or be completing further training outside of school until they turn 17 years old: To leave school to join the workforce."}, {"url": "https://www.qld.gov.au/education/schools/find/enrolment/pages/age.html", "passage_text": "See how to enrol for a general guide to enrolling your child, including the documents you will need to provide. A child is considered to be of compulsory school age from 6 years and 6 months until they turn 16, or they complete Year 10 (whichever comes first). Parents of compulsory-school-aged children must: 1  enrol them at a school. 2  ensure they attend school on every school day, unless the parent has a reasonable excuse. Schools. A child is considered to be of compulsory school age from 6 years and 6 months until they turn 16, or they complete Year 10 (whichever comes first). Parents of compulsory-school-aged children must: 1  enrol them at a school."}]