[{"url": "http://www.microbialearth.com/biochar/", "passage_text": "Biochar is a name for charcoal when it is used for particular purposes, especially as a soil amendment. Like all charcoal, biochar is created by pyrolysis of biomass. I want to introduce you to a new product that is changing the way many people understand soil ammendments. This material is being rapidly adopted by compost producers focused on the microbial aspects of compost. It is usually an ingredient in premium compost and it is called Biochar."}, {"url": "https://en.wikipedia.org/wiki/Activated_carbon", "passage_text": "Activated carbon, also called activated charcoal, activated coal, or carbo activatus, is a form of carbon processed to have small, low-volume pores that increase the surface area available for adsorption or chemical reactions. Activated is sometimes substituted with active. Activated carbon is usually derived from charcoal and, increasingly, high-porosity biochar."}, {"url": "http://www.abc.net.au/science/articles/2009/03/04/2507270.htm", "passage_text": "Due to its chemical structure biochar is very difficult for microbes in the soil to break down, preventing the carbon sequestered in the char to be released quickly back into the atmosphere. This is a clear distinction between biochar and other organic matter, or pools of carbon, in the soil. "}, {"url": "http://www.buyactivatedcharcoal.com/biochar", "passage_text": "Biochar and Gardening First, what is Biochar? How does it compare to just plain charcoal or activated charcoal? Biochar is the new techie eco name for plain charcoal made from renewable plant material (biomass)."}, {"url": "https://en.wikipedia.org/wiki/Biochar", "passage_text": "Biochar is charcoal used as a soil amendment. Like most charcoal, biochar is created by pyrolysis of biomass. Biochar is under investigation as an approach to carbon sequestration to produce negative carbon dioxide emissions. Biochar thus has the potential to help mitigate climate change, via carbon sequestration. Pre-Columbian Amazonians are believed to have used biochar to enhance soil productivity. They produced it by smoldering agricultural waste (i.e., covering burning biomass with soil) in pits or trenches. European settlers called it terra preta de Indio."}, {"url": "http://www.sciencedirect.com/science/article/pii/S138718110700385X", "passage_text": "Abstract. Biochar was used as a precursor of activated carbon using physical (steam) and chemical (potassium hydroxide) activation processes. The effects of operating conditions for each activation method on the BET surface area of the product and reaction yield were investigated using central composite design (CCD). "}, {"url": "http://e360.yale.edu/feature/as_uses_of_biochar_expand_climate_benefits_still_uncertain/2730/", "passage_text": "Biochar is a name for charcoal when it is used for particular purposes, especially as a soil amendment. Like all charcoal, biochar is created by pyrolysis of biomass. Biochar is under investigation as an approach to carbon sequestration to produce negative carbon dioxide emissions. "}, {"url": "http://www.biochar-international.org/biochar", "passage_text": "In addition to creating a soil enhancer, sustainable biochar practices can produce oil and gas byproducts that can be used as fuel, providing clean, renewable energy. When the biochar is buried in the ground as a soil enhancer, the system can become carbon negative.. Biochar and bioenergy co-production can help combat global climate change by displacing fossil fuel use and by sequestering carbon in stable soil carbon pools. It may also reduce emissions of nitrous oxide. "}, {"url": "http://www.microbialearth.com/biochar/", "passage_text": "Biochar. I want to introduce you to a new product that is changing the way many people understand soil ammendments. This material is being rapidly adopted by compost producers focused on the microbial aspects of compost. It is usually an ingredient in premium compost and it is called Biochar."}, {"url": "http://www.microbialearth.com/biochar/", "passage_text": "Biochar will turn into activated charcoal while in the soil, a process of time. For more information, you can see the FAQ section of the International Biochar Initiative. Biochar is being actively studied by research institutions around the world, as well as policy making bodies such as teh UN and EU. I want to introduce you to a new product that is changing the way many people understand soil ammendments. This material is being rapidly adopted by compost producers focused on the microbial aspects of compost. It is usually an ingredient in premium compost and it is called Biochar."}]