[{"url": "https://en.wikipedia.org/wiki/Pablo_Escobar", "passage_text": "Pablo Emilio Escobar Gaviria (December 1, 1949 – December 2, 1993) was a notorious Colombian drug lord who, at the height of his career, supplied about 80% of the cocaine smuggled into the US. 1 Escobar (2009) has been delayed because of producer Oliver Stone 's involvement with the George W. Bush biopic W. (2008). 2  The release date of Escobar remains unconfirmed. . 3  Regarding the film, Stone said: This is a great project about a fascinating man who took on the system."}, {"url": "https://en.wikipedia.org/wiki/Nas", "passage_text": "Nas is often named as one of the greatest hip hop artists. MTV ranked him at number 5 on their list of The Greatest MCs of All Time. In 2012, The Source ranked him No. 2 on their list of the Top 50 Lyricists of All Time. In 2013, Nas was ranked fourth on MTV's Hottest MCs in the Game list. In 1991, Nas performed on Main Source 's Live at the Barbeque. In mid-1992, Nas was approached by MC Serch of 3rd Bass, who became his manager and secured Nas a record deal with Columbia Records the same year."}, {"url": "http://www.complex.com/music/2014/12/escobar-vs-nasty-nas", "passage_text": "Escobar is cool, but he's not the godly side of Nas that makes him a living legend. Hate Me Now is a classic, but it ain't even close to as dope or important as One Love. Anyone who doesn't agree with that must like rap music for a different reason than I do. I'll leave it at that. There's a song on Nas' dad Olu Dara's album From Natchez to New York called Jungle Jay that I never hear anyone talk about. It features Nas flipping a straight-up street, almost Def Poetry Jam style that is ridiculously dope. And it was released during that late '90s Escobar era"}, {"url": "http://www.last.fm/music/Nas/+wiki", "passage_text": "Edit this wiki. Nasir bin Olu Dara Jones, more commonly known as Nas (formerly Nasty Nas and Escobar), born September 14, 1973 in Crown Heights, Brooklyn, New York, is a prominent American MC. The son of jazz musician Olu Dara, he was raised in the infamous Queensbridge housing projects in Queensbridge, New York. Nas was born in Brooklyn, New York, as the elder of Olu Dara and Fannie Ann Jones's two children; his brother Jabari (nicknamed Jungle because he was born in the Congo) is the younger of the two."}, {"url": "https://en.wikipedia.org/wiki/Pablo_Escobar", "passage_text": "Pablo Escobar was born in Rionegro, Colombia, the third of seven children to Abel de Jesus Jesús Dari, escobar a, farmer And Hermilda, gaviria an elementary school. Teacher as a teenager on the streets Of, medellin medellín he began his criminal career by allegedly stealing gravestones and sanding them down for resale. to smugglers 1 Escobar (2009) has been delayed because of producer Oliver Stone 's involvement with the George W. Bush biopic W. (2008). 2  The release date of Escobar remains unconfirmed. . 3  Regarding the film, Stone said: This is a great project about a fascinating man who took on the system."}, {"url": "https://en.wikipedia.org/wiki/Pablo_Escobar", "passage_text": "Pablo Escobar was born in Rionegro, Colombia, the third of seven children to Abel de Jesus Jesús Dari, escobar a, farmer And Hermilda, gaviria an elementary school. teacher 1 Escobar (2009) has been delayed because of producer Oliver Stone 's involvement with the George W. Bush biopic W. (2008). 2  The release date of Escobar remains unconfirmed. . 3  Regarding the film, Stone said: This is a great project about a fascinating man who took on the system."}, {"url": "http://www.imdb.com/name/nm0621576/", "passage_text": "Soundtrack | Actor | Composer. Nas, born Nasir bin Olu Dara Jones on September 14, 1973, is the son of Olu Dara, an unconventional jazz musician. At age nine he was a member of the Devastatin' Seven in the mid-1980s, the fruits of which can be heard on his 1994 debut, Illmatic, which was released on Columbia/SME later that yea"}, {"url": "http://www.imdb.com/name/nm0621576/bio", "passage_text": "Mini Bio (1). Nas, born Nasir bin Olu Dara Jones on September 14, 1973, is the son of Olu Dara, an unconventional jazz musician. At age nine he was a member of the Devastatin' Seven in the mid-1980s, the fruits of which can be heard on his 1994 debut, Illmatic, which was released on Columbia/SME later that year. "}]