[{"url": "http://www.ijs.org.au/Synagogue-services/default.aspx", "passage_text": "As the ritual of Temple worship came to an end, synagogues and synagogue services evolved, with an order of prayer established by the sages. Their idea was that the ritual of the Temple sacrifice would be replaced by formal worship. Such services need not take place in a synagogue; they merely require a quorum ('minyan') of at least ten men over 13 years of age (in Orthodoxy-ten men or women in Progressive Judaism) to gather for morning, afternoon and evening prayers."}, {"url": "http://www.jewishvirtuallibrary.org/jsource/Judaism/shul.html", "passage_text": "Tweet. The synagogue is the Jewish equivalent of a church, more or less. It is the center of the Jewish religious community: a place of prayer, study and education, social and charitable work, as well as a social center. "}, {"url": "http://judaism.about.com/od/judaismbasics/a/starofdavid.htm", "passage_text": "It doesn’t have any religious significance in Judaism but it is one of the symbols most commonly associated with the Jewish people. Many Jews wear jewelry with the Star of David as part of the design and the flag of Israel has a blue Star of David in the center. In many ways it has come to be a symbol of unity. "}, {"url": "http://www.ijs.org.au/Synagogue-services/default.aspx", "passage_text": "The idea of a public place for ritual and worship is as old as humanity, with the remains of ancient altars and temples found throughout the world. The modern synagogue combines in its physical structure and in its prayers and ceremonies, the memory of such places in the history of Judaism. Such services need not take place in a synagogue; they merely require a quorum ('minyan') of at least ten men over 13 years of age (in Orthodoxy-ten men or women in Progressive Judaism) to gather for morning, afternoon and evening prayers."}, {"url": "http://www.bbc.co.uk/religion/religions/judaism/worship/synagogue_1.shtml", "passage_text": "The synagogue is the Jewish place of worship, but is also used as a place to study, and often as a community centre as well. Orthodox Jews often use the Yiddish word shul (pronounced shool) to refer to their synagogue. In the USA, synagogues are often called temples. Traditional Jewish worship requires a minyan (a quorum of ten adult males) to take place. In an Orthodox synagogue the service will be conducted in ancient Hebrew, and the singing will be unaccompanied. Few British synagogues now have a choir, but they are more common in the USA."}, {"url": "http://www.jewfaq.org/shul.htm", "passage_text": "The synagogue is the Jewish equivalent of a church, more or less. It is the center of the Jewish religious community: a place of prayer, study and education, social and charitable work, as well as a social center. In fact, in rabbinical literature, the synagogue is sometimes referred to as the little Temple.. A synagogue is usually also a beit midrash, a house of study. Contrary to popular belief, Jewish education does not end at the age of bar mitzvah."}, {"url": "http://mfa.gov.il/MFA/ForeignPolicy/Issues/Pages/The-meaning-of-Israel-as-the-state-of-the-Jewish-people-20-Feb-2014.aspx", "passage_text": "Eretz Israel [the Land of Israel] was the birthplace of the Jewish people. Here their spiritual, religious and political identity was shaped. Here they first attained to statehood, created cultural values of national and universal significance and gave to the world the eternal Book of Books [the Bible].. The meaning of the Jewish state and its importance. Decades before the founding of the state in 1948, the international community recognized the Land of Israel as the homeland of the Jewish nation. Palestinian representatives for their part have refused to recognize Israel as the Jewish state."}, {"url": "http://www.ijs.org.au/Synagogue-services/default.aspx", "passage_text": "In the centre of the synagogue there is a raised platform called the 'bimah', with a reading desk, and this is the place from which the service is led, and the reading from the Torah takes place, with the reader facing the Ark. Such services need not take place in a synagogue; they merely require a quorum ('minyan') of at least ten men over 13 years of age (in Orthodoxy-ten men or women in Progressive Judaism) to gather for morning, afternoon and evening prayers."}, {"url": "https://en.wikipedia.org/wiki/Jewish_services", "passage_text": "1 Musaf (מוּסָף, additional) are recited by Orthodox and Conservative congregations on Shabbat, major Jewish holidays (including Chol HaMoed), and Rosh Chodesh. 2  A fifth prayer service, Ne'ila (נְעִילָה, closing), is recited only on Yom Kippur, the Day of Atonement. Readings from the Torah (five books of Moses) and the Nevi'im (Prophets) form part of the prayer services. To this framework various Jewish sages added, from time to time, various prayers, and, for festivals especially, numerous hymns."}]