[{"url": "http://www.nhs.uk/LiveWell/dentalhealth/Pages/Dentaltreatments.aspx", "passage_text": "More commonly known as false teeth, dentures are fitted in place of natural teeth. A full set is used to replace all your teeth. A part set is used to replace one or more missing teeth. Dentures are custom-made using impressions (mouldings) from your gums. They're usually made from metal or plastic. You can use implants to replace just a single tooth or several teeth. To fit an implant, titanium screws are drilled into the jaw bone to support a crown, bridge or denture. Replacement parts take time to prepare. This is to ensure that they fit your mouth and other teeth properly."}, {"url": "http://www.nytimes.com/2010/07/31/health/31patient.html", "passage_text": "If you need to replace most or all of your teeth, dentures are clearly the cheaper alternative, costing around $2,500 for a set (upper and lower jaws). But the implants won’t move around, nor interfere with your sense of taste, as a denture might. Continue reading the main story. For all their advantages, implants are expensive. Insurance coverage is usually minimal, and patients often are surprised by high out-of-pocket costs. An implant to replace a single tooth can cost $3,000 to $4,500, depending on where you live. Implants to replace a full or partial set of teeth can run from $20,000 to as much as $45,000"}, {"url": "http://health.costhelper.com/false-teeth.html", "passage_text": "1 Traditional or cantilever bridges (held in place by dental crowns on the anchor teeth) can cost $1,500-$6,000 for a three-unit bridge (two crowns with one false tooth); a four-unit bridge (two crowns, two false teeth) can cost $2,000-$12,000 or more. 1 It can cost $500-$1,500 or more per tooth for porcelain-fused-to-metal crowns; $600-$2,500 or more per tooth for gold or other metal alloys; and $800-$3,000 or more per tooth for all-porcelain."}, {"url": "http://www.webmd.com/oral-health/dental-health-dentures", "passage_text": "Complete dentures can be either conventional or immediate.. Made after the teeth have been removed and the gum tissue has begun to heal, a conventional denture is ready for placement in the mouth about eight to 12 weeks after the teeth have been removed. The cost is usually greater, but the implants and bridges more closely resemble the feel of real teeth. Dental implants are becoming the alternative to dentures but not everyone is a candidate for implants."}, {"url": "http://health.costhelper.com/false-teeth.html", "passage_text": "1 If only a few teeth are missing, removable partial dentures start at $300 -$500, average about $700 -$1,800, and can cost $2,000 -$4,000 for high-end materials like gold. 1 It can cost $500-$1,500 or more per tooth for porcelain-fused-to-metal crowns; $600-$2,500 or more per tooth for gold or other metal alloys; and $800-$3,000 or more per tooth for all-porcelain."}, {"url": "http://www.nhs.uk/conditions/dentures/Pages/Introduction.aspx", "passage_text": "Dentures are removable false teeth made of acrylic (plastic), nylon or metal. They fit snugly over the gums to replace missing teeth and eliminate potential problems caused by gaps. Complete dentures. A full denture will be fitted if all your upper or lower teeth need to be removed or you're having an old complete denture replaced. The denture will usually be fitted as soon as your teeth are removed, which means you won't be without teeth. The denture will fit snugly over your gums and jawbone."}, {"url": "http://health.costhelper.com/false-teeth.html", "passage_text": "1 A permanently fixed replacement for one or more teeth is known as a dental bridge. 2  A Maryland or resin-bonded bridge (with a false tooth and metal side wings that are bonded to the back of the adjacent/anchor teeth) can cost $1,000-$1,200 for one false tooth with two metal wings or $1,700-$3,500 with two false teeth. 1 It can cost $500-$1,500 or more per tooth for porcelain-fused-to-metal crowns; $600-$2,500 or more per tooth for gold or other metal alloys; and $800-$3,000 or more per tooth for all-porcelain."}, {"url": "http://health.costhelper.com/false-teeth.html", "passage_text": "1 A Maryland or resin-bonded bridge (with a false tooth and metal side wings that are bonded to the back of the adjacent/anchor teeth) can cost $1,000-$1,200 for one false tooth with two metal wings or $1,700-$3,500 with two false teeth. 1 It can cost $500-$1,500 or more per tooth for porcelain-fused-to-metal crowns; $600-$2,500 or more per tooth for gold or other metal alloys; and $800-$3,000 or more per tooth for all-porcelain."}]