[{"url": "http://www.e4hats.com/hat-cap/bucket-dressy-hat/dressy-fascinator.html", "passage_text": "Show: A fascinator is a small ornamental headpiece that fits on the head that is held in place by a headband or a small comb. The term fascinator wasn’t used until the 1990’s but the hat has been around for hundreds of years. Our collection of these decorative accessories include, animal print, lace, comb, flower veil, flower pattern lace, ribbon round as well as clip on styles."}, {"url": "http://visforvintage.net/2012/08/30/fascinator-history-of-a-hair-accessory/", "passage_text": "A fascinator hat is a small ornamental headpiece that fits on the head using an alice-band-type base or headband or even a small comb. It is always lightweight and usually features feathers, beads or flowers. A cross between a hair accessory and a cocktail hat, a fascinator with veil is also quite common. The fascinator as we know it today is adopted in the London (Luton-based) millinery trade during the late 1970s and 80s."}, {"url": "https://en.wikipedia.org/wiki/Fascinator", "passage_text": "Today, a fascinator may be worn instead of a hat on occasions where hats were traditionally worn—such as weddings—or as an evening accessory, when it may be called a cocktail hat. It is generally worn with fairly formal attire. A substantial fascinator is a fascinator of some size or bulk. Bigger than a barrette, modern fascinators are commonly made with feathers, flowers or beads. They need to be attached to the hair by a comb, headband or clip."}, {"url": "https://en.wikipedia.org/wiki/Fascinator", "passage_text": "The use of the term fascinator to describe a particular form of late 20th-and early 21st-century millinery emerged towards the end of the late 20th century, possibly as a term for 1990s designs inspired by the small 1960s cocktail hats designed to perch upon the highly coiffed hairstyles of the period. A substantial fascinator is a fascinator of some size or bulk. Bigger than a barrette, modern fascinators are commonly made with feathers, flowers or beads. They need to be attached to the hair by a comb, headband or clip."}, {"url": "http://www.wisegeek.com/what-is-a-fascinator.htm", "passage_text": "Any number of things can be included in a fascinator, which is typically attached to the head with a comb, pin, clip, or headband. Feathers and ribbons are common, along with silk flowers, but it is also possible to see ribbons, various fabrics, and beading, among other things. One of the advantages to a fascinator, as opposed to a hat, is that a fascinator can be cheaply, easily, and quickly created, although it is also possible to purchase a fascinator. Some crafters enjoy making custom fascinators to go with various outfits, and creating a fascinator can be a fun project."}, {"url": "http://everythingbutthedress.blogspot.com/2009/10/what-is-fascinator.html", "passage_text": "Now the word fascinator is used to describe a delicate headpiece typically made with feathers and flowers. Wikipedia defines it as a slightly to very frivolous head decoration.. Sometimes you will hear headpieces referred to as cocktail hats, a popular term for wedding guests in England, or a Chapeau. By original definition, a fascinator, originating in the 1750s, refers to a fine head covering, usually a scarf made of crochet or lace. Although the term fell into disuse almost entirely by the 1970s, it has come back into vogue."}, {"url": "http://www.wisegeek.com/what-is-a-fascinator.htm", "passage_text": "A fascinator is a headpiece which is designed to be attached to the hair in lieu of a hat. Traditionally, fascinators are worn by women only, and they are typically paired with formal wear, although one could wear a fascinator on less formal occasions. One of the advantages to a fascinator, as opposed to a hat, is that a fascinator can be cheaply, easily, and quickly created, although it is also possible to purchase a fascinator. Some crafters enjoy making custom fascinators to go with various outfits, and creating a fascinator can be a fun project."}, {"url": "http://visforvintage.net/2012/08/30/fascinator-history-of-a-hair-accessory/", "passage_text": "The only purpose of a fascinator is hair decoration. The fascinator always sits at an angle on the head as if perching on top of the well-groomed hair and complementing the look of the hair. A cross between a hair accessory and a cocktail hat, a fascinator with veil is also quite common. The fascinator as we know it today is adopted in the London (Luton-based) millinery trade during the late 1970s and 80s."}]