[{"url": "http://972mag.com/who-gets-to-vote-in-israels-democracy/58756/", "passage_text": "If we exclude Gaza, one in every 4.5 people living under Israeli rule doesn’t have the right to vote in the coming elections; that one person is (almost) always Palestinian. If Gaza is included, it’s one in three who is not represented."}, {"url": "http://www.gatestoneinstitute.org/6503/palestinian-flag-democracy", "passage_text": "The Palestinian Authority (PA) leadership and various pro-Palestinian groups have hailed the vote as a symbolic victory for the Palestinians. The Palestinian representative to the UN, Riyad Mansour, said that the vote regarding the flag would be another step towards solidifying Palestinian statehood."}, {"url": "http://www.gatestoneinstitute.org/6503/palestinian-flag-democracy", "passage_text": "The vote in favor of hoisting the flag is not going to bring democracy, freedom of expression and transparency to Palestinians. The Palestinians do not need symbolic victories such as the one concerning the Palestinian flag."}, {"url": "http://www.usatoday.com/story/news/world/2012/11/29/un-votes-palestine/1735849/", "passage_text": "Though the vote does not give the Palestinian Authority UN membership it may allow it to file suits against Israel in the International Criminal Court, and allow Israel to do the same against the Palestinian Authority."}, {"url": "http://972mag.com/who-gets-to-vote-in-israels-democracy/58756/", "passage_text": "7,659,000 people living in Israeli territory have voting rights, while 2,128,115 people have no voting rights. Altogether, one in every 4.5 people is denied political representation; this one person is almost always Palestinian."}, {"url": "http://972mag.com/who-gets-to-vote-in-israels-democracy/58756/", "passage_text": "Within the Green Line. 5,463,071 Israeli Jews (citizens): have voting rights. 1,361,800 Palestinians (citizens): have voting rights. 318,200 non-Arab Christians, those listed as having no religion, and other"}, {"url": "http://www.quora.com/Can-Palestinians-who-are-residents-in-Israel-vote-in-Israeli-elections", "passage_text": "In Israel/Palestine there are three types of Palestinians: Palestinian who remained in Israel after the 1948 war. These have israeli citizenship and can vote in both national and local elections."}, {"url": "http://www.usatoday.com/story/news/world/2012/11/29/un-votes-palestine/1735849/", "passage_text": "The USA and Israel have said that the vote will make the Palestinians less likely to compromise on difficult choices and make it harder for the two sides to create a lasting peace. Today's unfortunate and counterproductive resolution places further obstacles in the path peace, U.N. Ambassador Susan Rice said."}, {"url": "http://www.gatestoneinstitute.org/6503/palestinian-flag-democracy", "passage_text": "They do not care if the Palestinian Authority and Hamas in the West Bank and Gaza Strip respectively are functioning as repressive and corrupt regimes that have no respect for human rights or public freedoms. The vote was mainly directed against Israel."}, {"url": "http://www.aljazeera.com/indepth/opinion/2014/10/uk-vote-palestine-why-all-fuss-2014101282415844839.html", "passage_text": "That a symbolic vote to recognise Palestine has become so problematic speaks volumes on the conflict. | Politics, US & Canada, Israel, Sweden, United Kingdom. The UK does not need Israel's 'permission' to recognise a Palestinian state, writes Shabi [EPA]."}]