[{"url": "http://www.localhistories.org/phoenicians.html", "passage_text": "The Phoenicians were a people who lived in what is now Lebanon. They were a great trading people and they were at their peak between about 1200 BC and 800 BC. The Phoenicians lived on a strip of fertile land between the sea and the Lebanon mountains. The Phoenicians are also famous for their alphabet, which they invented about 1200 BC. This alphabet was passed onto the Greeks and is the basis of the alphabet we use today. The Phoenicians were also craftsmen. They made tools and weapons from bronze and they carved ivory plaques which were used to decorate furniture"}, {"url": "http://www.brighthubengineering.com/marine-history/72868-types-of-ancient-war-ships-biremes-and-triremes/", "passage_text": "Introduction. The bireme is a type of ancient ship which was supposedly invented by the Phoenicians and extensively used by the Romans. A bireme is also basically a Greek ship which has two sets of oars on each of its sides. In the name bireme, “bi” stands for two and “reme” stands for oars. "}, {"url": "https://en.wikipedia.org/wiki/Phoenicia", "passage_text": "The Phoenicians were among the greatest traders of their time and owed much of their prosperity to trade. At first, they traded mainly with the Greeks, trading wood, slaves, glass and powdered Tyrian purple. Tyrian purple was a violet-purple dye used by the Greek elite to color garments. Phoenicia is really a Classical Greek term used to refer to the region of the major Canaanite port towns, and does not correspond exactly to a cultural identity that would have been recognised by the Phoenicians themselves."}, {"url": "http://www.localhistories.org/phoenicians.html", "passage_text": "The Phoenicians are believed to have invented the bireme, a ship with two rows of oars and the trireme with three rows. A man played a flute to help the oarsmen row in time. Merchant ships were broader to carry cargo. A typical Phoenician merchant ship was 30 meters long and 7 meters wide and had a crew of about 20. The Phoenicians are also famous for their alphabet, which they invented about 1200 BC. This alphabet was passed onto the Greeks and is the basis of the alphabet we use today. The Phoenicians were also craftsmen. They made tools and weapons from bronze and they carved ivory plaques which were used to decorate furniture"}, {"url": "http://ngm.nationalgeographic.com/features/world/asia/lebanon/phoenicians-text/3", "passage_text": "The ships reveal that the Phoenicians used mortise-and-tenon joints, giving their boats more strength than earlier boats, which were basically made of planks sewn together. The team discovered a wooden anchor that had been filled with lead, apparently a novel invention of the Phoenicians. "}, {"url": "http://phoenicia.jimdo.com/the-phoenicans/", "passage_text": "The Phoenician People. The Phoenicians were a seafaring trading company who called themselves Canaanites, meaning merchant, which describes the Phoenicians very well. T he Canaanite civilization began to develop in the modern day land which is Lebanon, parts of Syria and Israel, circa 3000 B.C. The Phoenicians traded with the Greeks, and shared the alphabet with them. The original Phoenician alphabet had 22 letters, and was adopted by the Greeks, who added four letters, all 26 of which we use today."}, {"url": "http://www.oocities.org/capitolhill/parliament/2587/ships.html", "passage_text": "The best seafarers and ship builders of the ancient world were the Phoenicians. The famous Lebanese cedar tress covering the slopes of mountains of their native land was a perfect material for construction of strong seaworthy ships. Herodotus tells us that 'The Phoenician ships were the best sailers in the fleet, and the Sidonian the best among the Phoenicians. The contingent of each nation, whether to the fleet or to the land army, had at its head a native leader'."}, {"url": "http://www.oocities.org/capitolhill/parliament/2587/ships.html", "passage_text": "The bireme (a ship with two banks of oars), introduced by the Phoenicians in about 700 BC, became the leading warship of the 8th century BC. These vessels became very large, some reputedly having as many as 40 banks of oars, but smaller vessels were again common by the 1st cent. B.C. Herodotus tells us that 'The Phoenician ships were the best sailers in the fleet, and the Sidonian the best among the Phoenicians. The contingent of each nation, whether to the fleet or to the land army, had at its head a native leader'."}, {"url": "http://ageofex.marinersmuseum.org/index.php?type=navigationtool&id=7", "passage_text": "Phoenician Navigation. The Phoenicians were masters of sea travel covering great distances in their ships of trade and war. They were the first people to venture to the western Mediterranean and beyond the Straits of Gibraltar to the Atlantic coasts of Africa and Europe. The second type of navigation was deep-sea navigation. This was used when the Phoenicians were sailing over open water to destinations that were very far from the port of departure. While they would also keep land in sight, they were much farther out in open water."}]