[{"url": "http://www.hellobc.com/duncan.aspx", "passage_text": "Share. Close-up of a totem pole (Ricardo Ordonez photo). Close-up of a totem pole (Ricardo Ordonez photo). Duncan is the unofficial capital of the Cowichan Valley, a fertile crescent of rich farmland, lush vineyards, heritage river systems, and scenic backroads in the southeastern corner of Vancouver Island. Close to Duncan. The Cowichan as a whole stretches from the towns of Mill Bay and Cobble Hill in the south (a half-hour northeast of Victoria over the Malahat mountain range) to Ladysmith (20 minutes south of Nanaimo)."}, {"url": "http://britishcolumbia.com/plan-your-trip/regions-and-towns/vancouver-island-bc-islands/duncan/", "passage_text": "The City of Duncan was incorporated in 1912. Duncan’s cityscape is a fine example of an old tradition infused with contemporary relevance and life. Duncan is the commercial centre of the Cowichan Valley region, serving over 80,000 people."}, {"url": "http://duncan.ca/", "passage_text": "Welcome to Duncan, the heart of the Cowichan Region. Our lovely city can be found just off the Trans Canada Highway, about half-way between Victoria and Nanaimo on Vancouver Island. Our downtown features a number of heritage and vintage buildings, and a large array of small, exquisite shops and restaurants catering to all tastes."}, {"url": "http://www.youtube.com/watch?v=sKzgXXPhig8", "passage_text": "Please try again later. The 'Totem Tour' in Duncan, BC, Canada on Aug. 19, 2012. Located in the southeastern corner of Vancouver Island, Duncan is dubbed as the City of Totems.. The town is home to the world's widest in diameter totem pole-Cedar Man Holding Talking Stick. "}, {"url": "http://britishcolumbia.com/plan-your-trip/regions-and-towns/vancouver-island-bc-islands/duncan/", "passage_text": "Population: 5,032. Location: Duncan is located in the Cowichan Valley of southern Vancouver Island, 36 miles (60 km) north of Victoria. Totem Poles: There are nearly eighty totem poles in Duncan, both downtown and along a half-kilometre section of the Trans-Canada Highway. Duncan’s cityscape is a fine example of an old tradition infused with contemporary relevance and life. Duncan is the commercial centre of the Cowichan Valley region, serving over 80,000 people."}, {"url": "http://britishcolumbia.com/plan-your-trip/regions-and-towns/vancouver-island-bc-islands/duncan/", "passage_text": "Duncan is named after William Chalmers Duncan of Sarnia, Ontario. He arrived in Victoria in May 1862, and was one of the party of a hundred settlers that Governor Douglas took to Cowichan Bay in August that year. After joining several gold rushes, Duncan settled close to the present city of Duncan. Duncan’s cityscape is a fine example of an old tradition infused with contemporary relevance and life. Duncan is the commercial centre of the Cowichan Valley region, serving over 80,000 people."}, {"url": "https://en.wikipedia.org/wiki/Duncan,_British_Columbia", "passage_text": "Vancouver Island University (formerly Malaspina University-College) has a regional campus in Duncan that offers programs and courses in university transfer, access, trades and applied technology, health and human services, and career and academic preparation. The Coast Salish men and women of the Cowichan Tribes are makers of the world famous Cowichan Sweaters. Duncan is home to the BC Forest Discovery Centre. Before the Canada–United States softwood lumber dispute, Duncan and the whole Cowichan Valley were a thriving lumber centre in British Columbia."}, {"url": "https://en.wikipedia.org/wiki/Duncan,_British_Columbia", "passage_text": "Sign welcoming visitors to the town of Duncan, on Vancouver Island, British Columbia. Duncan (pop. 4,932) is a city on southern Vancouver Island in British Columbia, Canada. It is the smallest city by area (2.07 square kilometres, 0.8 square miles) in the nation. The Coast Salish men and women of the Cowichan Tribes are makers of the world famous Cowichan Sweaters. Duncan is home to the BC Forest Discovery Centre. Before the Canada–United States softwood lumber dispute, Duncan and the whole Cowichan Valley were a thriving lumber centre in British Columbia."}, {"url": "http://www.maps.worldweb.com/DuncanBCMap.html", "passage_text": "Using the Duncan, BC Map. This interactive hotels map, designed to help you plan your next trip to Duncan, BC, British Columbia can pinpoint hotels, attractions, stores, restaurants and more. Important Note: While we strive to place map markers at the correct longitude and lattitude, we cannot guarantee that marker positions are accurate. If you spot a Duncan, British Columbia map error, please let us know (include a specific Web address)."}]