[{"url": "http://attackofthefanboy.com/news/how-to-play-as-darth-vader-and-more-in-star-wars-battlefront/", "passage_text": "In a new blog post on the official Star Wars Battlefront website, DICE explains more about the playable Heroes and Villains in the game. To be one of the playable Heroes and Villains in Star Wars Battlefront, they will be “ unlocked through a powerup found on the map “."}, {"url": "http://attackofthefanboy.com/news/star-wars-battlefront-will-not-support-cross-platform-multiplayer/", "passage_text": "Console and PC gamers will be segregated for Star Wars Battlefront as cross platform multiplayer will not be supported. The EA Star Wars Twitter page made the following announcement on Star Wars Battlefront: “If you mean can they play together via cross-platform? Star Wars Battlefront….."}, {"url": "http://wccftech.com/star-wars-battlefront-support-cross-platform-multiplayer/", "passage_text": "DICE has recently noted that the environment in Star Wars Battlefront will make you feel like you’re actually inside the Star Wars universe and they strive to make players feel immersed in the diverse planets of the game."}, {"url": "http://www.xbox.com/en-US/games/star-wars-battlefront", "passage_text": "Imperial speeder bikes zipping by. Intense dogfights between squadrons of X-wings and TIE fighters filling the skies. Immerse yourself in the epic Star Wars ™ battles you’ve always dreamed of and create new heroic moments of your own in Star Wars ™ Battlefront™."}, {"url": "http://attackofthefanboy.com/news/star-wars-battlefront-will-not-support-cross-platform-multiplayer/", "passage_text": "Star Wars Battlefront will not support cross-platform functionality. ”. This answer was in response to a fan wondering if cross platform multiplayer was possible in Star Wars Battlefront. He wanted to know if PC players could play against PS4 gamers. It’s not too surprising that Star Wars Battlefront does not have any cross platform multiplayer."}, {"url": "http://steamcommunity.com/app/6060", "passage_text": "Global Achievements. With brand new space combat, playable Jedi characters, and over 16 all new battlefronts, Star Wars Battlefront II gives you more ways than ever before to play the classic Star Wars battles any way you want."}, {"url": "http://attackofthefanboy.com/news/how-to-play-as-darth-vader-and-more-in-star-wars-battlefront/", "passage_text": "DICE has now given more insight on to how players will earn the right to play as Darth Vader and more in Star Wars Battlefront. In Battlefront 2, you had to earn the right to play as famous Star Wars characters before you could be….."}, {"url": "http://store.steampowered.com/app/6060/", "passage_text": "We regret any disappointment as a result of the shutdown of the services supporting these online features. With brand new space combat, playable Jedi characters, and over 16 all new battlefronts, Star Wars Battlefront II gives you more ways than ever before to play the classic Star Wars battles any way you want. Now for the first time, Star Wars Battlefront II lets you…."}]