[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=175258", "passage_text": "Pradaxa is a new kind of blood thinner. It was approved by the U.S. Food and Drug Administration in 2010 to prevent strokes caused by atrial fibrillation, a heart rhythm problem that puts people at risk for blood clots that can travel to the brain."}, {"url": "http://www.rightinginjustice.com/news/2013/02/25/antidote-in-development-for-new-blood-thinners-xarelto-eliquis/", "passage_text": "Jennifer Walker-Journey February 25, 2013. Four drug companies have signed on to fund Protola Pharmaceuticals’ experimental antidote for reversing the effect of Factor Xa inhibitor drugs, blood thinners that block the activity of clotting Factor Xa and prevent blood clots from developing or getting worse."}, {"url": "https://www.drugnews.net/news/antidote-xarelto-blood-thinner-patients-emergency", "passage_text": "Coumadin, the trade name for warfarin, is a cumbersome drug with many dangerous side effect risks of its own. However, in situations of severe internal bleeding doctors can give an antidote injection to quickly stop it. So far, the same isn’t available for Xarelto, Pradaxa and Eliquis."}, {"url": "http://www.drugrecallattorneysblog.com/2015/01/antidote-discovered-for-blood.html", "passage_text": "Popular blood-thinning drug Xarelto is prescribed to patients to prevent blood clots and prevent strokes. Most patients do not know that Xarelto may also cause irreversible internal bleeding, often resulting in extended hospitalizations and death."}, {"url": "http://patientblog.clotconnect.org/2015/06/22/antidote-for-pradaxa-dabigatran-fda-approval-by-end-of-2015/", "passage_text": "Stephan Moll, MD writes: A drug in development (Idarucizumab) that reverses the blood thinner Pradaxa® (Dabigatran) is on a very promising path to get FDA approval in the next few months and be available for clinical use by the end of 2015."}, {"url": "http://www.pogo.org/blog/2015/10/fda-approves-necessary-antidote-for-pradaxa.html", "passage_text": "Five years ago, the FDA approved the blood thinner Pradaxa in the absence of an antidote that could thicken the blood and prevent patients from bleeding uncontrollably. Since then, the drug has been named as primary suspect in thousands of reports about patient deaths."}, {"url": "http://health.usnews.com/health-news/news/articles/2013/11/18/antidote-might-reverse-complication-from-blood-thinner-pradaxa", "passage_text": "It's easier for patients to take Pradaxa than the older, standard blood thinner warfarin. But unlike warfarin, there's no way to rapidly reverse its action. That can be a life-threatening problem in emergency situations."}]