[{"url": "http://mathmistakes.info/facts/AlgebraFacts/learn/fr/whyfr.html", "passage_text": "As with fractions, the first step is to find a common denominator. Since we don't know what the denominators (x+3) and (x-2) equal (as numbers-it depends on what x represents), we take the product (x+3)(x-2) as the common denominator. Algebra involves quantities called variables (that can represent values perhaps not yet known). One kind of formula in algebra that has one or more variables is called a rational expression. Adding and subtracting rational expressions is just like adding and subtraction fractions-you need to use"}, {"url": "http://www.gcflearnfree.org/fractions/", "passage_text": "With the simple and easy techniques of this basic math tutorial, you will gain a basic understanding of fractions, in addition to learning how to work with common denominators, reducing and improper fractions. 73 5 16 707. 1  1 Introduction to Fractions. "}, {"url": "http://www.cehd.umn.edu/ci/rationalnumberproject/89_1.html", "passage_text": "For example, when ordering fractions with like numerators, children learn that 1/3 is less than 1/2. With whole numbers, however, 3 is greater than 2. When comparing fractions of this type, children need to coordinate the inverse relationship between the size of the denominator and the size of the fraction. "}, {"url": "http://www.homeschoolmath.net/teaching/teaching-fractions.php", "passage_text": "3. Finding equivalent fractions. Multiply both the numerator and denominator by a same number. 4. Convert a mixed number to a fraction. Multiply the whole number part by the denominator and add the numerator to get the numerator. Use the common denominator as in the fractional part of the mixed number. 5. It's not the concept of a fraction that is difficult-it is the various operations: addition, subtraction, multiplication, division, comparing, simplifying, etc. of"}, {"url": "http://www.math.com/school/subject1/lessons/S1U4L3DP.html", "passage_text": "Please read our Privacy Policy. It's easy to add and subtract like fractions, or fractions with the same denominator. You just add or subtract the numerators and keep the same denominator. The tricky part comes when you add or subtract fractions that have different denominators. To do this, you need to know how to find the least common denominator. In an earlier lesson, you learned how to simplify, or reduce, a fraction by finding an equivalent, or equal, fraction where the numerator and denominator have no common factors. To do this, you divided the numerator and denominator by their greatest common factor."}, {"url": "http://mathmistakes.info/facts/AlgebraFacts/learn/fr/whyfr.html", "passage_text": "I think a much better reason for knowing fractions is that the techniques you learn for fractions are exactly the same ones you will need for parts of algebra. If you don't understand and master the ideas for fractions, then you will find learning algebra difficult. Algebra involves quantities called variables (that can represent values perhaps not yet known). One kind of formula in algebra that has one or more variables is called a rational expression. Adding and subtracting rational expressions is just like adding and subtraction fractions-you need to use a common denominator."}, {"url": "http://www.homeschoolmath.net/teaching/teaching-fractions.php", "passage_text": "As many teachers and parents know, learning the various fraction operations can be difficult for many children. It's not the concept of a fraction that is difficult-it is the various operations: addition, subtraction, multiplication, division, comparing, simplifying, etc. of fractions."}, {"url": "http://www.mathworksheetscenter.com/mathtips/fractionsareimportant.html", "passage_text": "Whatever the need for division, without the knowledge of fractions you won't be able to do it. When going to college later on, you will need good grades, and well to be honest, your grades during school years are dependant upon your ability to do fractions. You see, just like fractions is the foundation, in later life your house will need strong walls. Algebra is those walls that will keep up the roof"}, {"url": "http://www.mathgoodies.com/articles/teach_fractions.html", "passage_text": "How to Teach Fractions Tip #2 - Explain the numerator and the denominator until every student understands. Students will never understand how to add or subtract a fraction until they truly understand the concept of a fraction. Use fractions that every student understands. Always keep in mind that using the best methods of how to teach fractions involves moving very slowly, giving multiple examples involving fractions until every student is comfortable. Use familiar examples involving fractions such as 1/4, 1/3, and 3/4 to reinforce the concept of what a fraction is."}, {"url": "http://mathmistakes.info/facts/AlgebraFacts/learn/fr/whyfr.html", "passage_text": "One answer is that when you use a calculator you should understand what the calculator is doing. Or some time you may need to do a calculation with fractions and not have a calculator around (like on parts of standardized tests). Algebra involves quantities called variables (that can represent values perhaps not yet known). One kind of formula in algebra that has one or more variables is called a rational expression. Adding and subtracting rational expressions is just like adding and subtraction fractions-you need to use a common denominator."}]