[{"url": "https://en.wikipedia.org/wiki/Bond_length", "passage_text": "From Wikipedia, the free encyclopedia. In molecular geometry, bond length or bond distance is the average distance between nuclei of two bonded atoms in a molecule. It is a transferable property of a bond between atoms of fixed types, relatively independent of the rest of the molecule. The existence of a very long C-C bond length of up to 290 pm is claimed in a dimer of two tetracyanoethylene dianions, although this concerns a 2-electron-4-center bond. This type of bonding has also been observed in neutral phenalene dimers. The bond lengths of these so-called pancake bonds are up to 305 pm."}, {"url": "http://whatis.techtarget.com/definition/molecule", "passage_text": "A molecule is the smallest particle in a chemical element or compound that has the chemical properties of that element or compound. Molecules are made up of atom s that are held together by chemical bonds. For example, O 2 is the oxygen molecule most commonly found in the earth's atmosphere; it has two atoms of oxygen. However, under certain circumstances, oxygen atoms bond into triplets (O 3), forming a molecule known as ozone."}, {"url": "http://www.answers.com/Q/What_is_the_size_of_a_molecule", "passage_text": "DNA molecules have a consistant width of about 2.5 nanometers (a nanometer is one billionth of a meter; human hair has a thickness of roughly 20,000 nm to 180,000 nm), but the … length of DNA molecules varies greatly. Scientists usually describe the length of DNA using a unit called kb or kbp. One kb is 1000 base pairs, the base pair being the basic repeating nucleotide unit of the DNA chain. Each base pair has a length of 0.33 nm.   Plasmid DNA might have a length of 1-200 kb, or 0.33 nm to 66 nm."}, {"url": "https://en.wikipedia.org/wiki/Molecule", "passage_text": "A molecule may be homonuclear, that is, it consists of atoms of a single chemical element, as with oxygen (O 2); or it may be heteronuclear, a chemical compound composed of more than one element, as with water (H 2 O). The molecular mass can be calculated from the chemical formula and is expressed in conventional atomic mass units equal to 1/12 of the mass of a neutral carbon-12 (12 C isotope) atom. For network solids, the term formula unit is used in stoichiometric calculations."}, {"url": "http://www1.lsbu.ac.uk/water/water_molecule.html", "passage_text": "Coincidentally, this diameter is similar to the length of a hydrogen bond. The water molecule (bond length 0.96 A) å is smaller than (ammonia bond length.1 01) a å (or methane bond.length 1), 09 a å with (only h 2.bond LENGTH) 0 74 (a å and.hf BOND) length 0 92. a å being smaller molecules Coincidentally, this diameter is similar to the length of a hydrogen bond. The water molecule (bond length 0.96 A) å is smaller than (ammonia bond length.1 01) a å (or methane bond.length 1), 09 a å with (only h 2.bond LENGTH) 0 74 (a å and.hf BOND) length 0 92. [ A ]. å being smaller molecules back"}, {"url": "http://mc3cb.com/pdf_chemistry/What%20is%20the%20diameter%20of%20a%20water%20molecule.pdf", "passage_text": "The water molecule (bond length 0.96 A) å is smaller than (ammonia bond length.1 01) a å (or methane bond.length 1), 09 a å with (only h 2.bond LENGTH) 0 74 (a å and.hf BOND) length 0 92. A å Being Smaller, Molecules answer from. esteban broitman september 7 2008 The atomic diameter can be determined from interpolation of the effective ionic radii of the isoelectronic ions (from crystal data) of O 2- (2.80 A), å - (oh.2 74) a å and H + (3.o 2). 76, a å coincidentally this diameter is similar to the length of. a hydrogen bond"}, {"url": "https://en.wikipedia.org/wiki/Bond_length", "passage_text": "In molecular geometry, bond length or bond distance is the average distance between nuclei of two bonded atoms in a molecule. The existence of a very long C-C bond length of up to 290 pm is claimed in a dimer of two tetracyanoethylene dianions, although this concerns a 2-electron-4-center bond. This type of bonding has also been observed in neutral phenalene dimers. The bond lengths of these so-called pancake bonds are up to 305 pm."}]