[{"url": "http://www.asktheexterminator.com/ants/Ghost_Ants.shtml", "passage_text": "Ghost Ants. Summary: The ghost ant species can be found living in greenhouses and other buildings offering warm conditions where it nests in potted plants. The ghost ant builds colonies in wall voids or spaces between baseboards or cabinetry. It will feed upon many foods including sweets such as sugar, cakes and syrup"}, {"url": "http://www.doyourownpestcontrol.com/ghost.htm", "passage_text": "The Ghost Ant is similar to the Odorous House Ant, but the Odorous House Ant is totally brown or black in color. Workers are 1/16 inch/1.5 mm in length. The legs, pedicel, gaster, and antennae are pale, almost translucent, in color and the head and thorax are darker in color. How to Get Rid of Ghost Ants Unless you use a non-repellent spray, such as Taurus SC or FUSE Insecticide; baiting is the preferred ant control treatment. These non-repellent sprays are non-detectable by ants, so they do not avoid them as typical sprays. These sprays kill the ants by contact and by transfer."}, {"url": "http://reynoldspest.com/education/ghost-ants-in-your-kitchen", "passage_text": "Ghost ants require much moisture and can be the cause of making them indoor pests in drought seasons. It has been thought that a ghost ant picked its name up after being identified as having a transparent body except for its head. Determining a ghost ant from other species of ants is easy. Most likely your kitchen may have a nest of ghost ants nearby. As unpleasant as they are, luckily they do not spread pathogens that make humans sick. In fact these ants are extremely common in Florida homes. Notoriously known as ghost ants, you may encounter some residents referring to them as sugar ants."}, {"url": "http://reynoldspest.com/education/ghost-ants-in-your-kitchen", "passage_text": "Ghost ants are readily adaptable to different living conditions and the locations of their nest. They have been known to build nests in disposable places or places that become inhabitable within a few days. Most likely your kitchen may have a nest of ghost ants nearby. As unpleasant as they are, luckily they do not spread pathogens that make humans sick. In fact these ants are extremely common in Florida homes. Notoriously known as ghost ants, you may encounter some residents referring to them as sugar ants."}, {"url": "http://entnemdept.ufl.edu/creatures/urban/ants/ghost_ant.htm", "passage_text": "The ghost ant is associated with a complex of ant species known as tramp ants that is widely distributed in tropical and subtropical latitudes worldwide. In fact, Tapinoma melanocephalum was once referred to simply as the tramp ant.. In the United States, the ghost ant is well established in Florida and Hawaii, and its range is expanding. The ant reached Texas in 1994 or 1995, probably through Galveston on a shipment of plants from Florida (Chenault 1997)."}, {"url": "http://www.pestnet.com/ants/ghost-ants/", "passage_text": "Ghost Ant Habitat and Food Source. The Ghost ant is a tropical species, found in most tropical and subtropical latitudes in the U.S., Puerto Rico, the Caribbean Islands, but is found throughout the world. 1 If ants are seen inside, use a vacuum cleaner to get rid of them. 2  Exclusion: to prevent the entry of Ghost ants, install tight-fitting doors, door sweeps, windows, and screens. 3  Use caulking to secure cracks and leakages in doors and windows."}, {"url": "http://www.orkin.com/ants/ghost-ant/", "passage_text": "The ghost ant (Tapinoma melanocephalum) gets its name from its size and pale color of its legs and abdomen, which make it difficult to see. These ants have dark heads and thoraxes. The workers are about 1.3 to 1.5 mm long. Ghost ants are related to odorous house ants. The workers also gather insects to feed the colony. When they are indoors, ghost ants usually prefer sweets. Outdoors, ghost ants make their nest in the ground. They often nest beside stones, logs and firewood piles. They enter buildings on trails that they make along the ground"}, {"url": "http://www.pestnet.com/ants/ghost-ants/", "passage_text": "Colonies are moderate to large in size and may contain several Queen ants. Ghost ant colonies may contain bits of dead but moist grass and plant stems. Nests are typically found in cavities of decaying plant matter under loose bark, under rocks or other objects on the ground, and even in flowerpots. 1 If ants are seen inside, use a vacuum cleaner to get rid of them. 2  Exclusion: to prevent the entry of Ghost ants, install tight-fitting doors, door sweeps, windows, and screens. 3  Use caulking to secure cracks and leakages in doors and windows."}, {"url": "http://www.ehow.com/how_5610239_kill-ghost-ants.html", "passage_text": "Ghost ants are members of a tiny invasive species that derives its name from the milky white, almost translucent, color of the ant's legs and abdomens. The color makes them difficult to see. Baits are Better. Since ghost ants form several nests, the use of bait tends to be more effective in eradication than insecticide sprays which can kill the ant before it can return to its nest and poison the others. Ghost ants favor sweets so baits with a sugar or honey base work best."}]