[{"url": "https://en.wikipedia.org/wiki/Cracking_(chemistry)", "passage_text": "In petroleum geology and chemistry, cracking is the process whereby complex organic molecules such as kerogens or long chain hydrocarbons are broken down into simpler molecules such as light hydrocarbons, by the breaking of carbon-carbon bonds in the precursors. Fluid catalytic cracking produces a high yield of petrol and LPG, while hydrocracking is a major source of jet fuel, Diesel fuel, naphtha, and again yields LPG. Refinery using the Shukhov cracking process, Baku, Soviet Union, 1934."}, {"url": "https://en.wikipedia.org/wiki/Ethane", "passage_text": "Ethane (/ˈɛθeɪn/ or /ˈiːθeɪn/) is an organic chemical compound with chemical formula C 2 H 6. At standard temperature and pressure, ethane is a colorless, odorless gas. Ethane is isolated on an industrial scale from natural gas, and as a byproduct of petroleum refining. "}, {"url": "http://science.howstuffworks.com/crack1.htm", "passage_text": "Crack is made from cocaine -- a powdered drug that is derived from the leaves of the coca plant, which grows primarily in South America. Although cocaine didn't gain notoriety in the United States until the 1980s, it has been in use for centuries. The chemical formula of cocaine is C17H21NO4. See IPCS: Cocaine for a look at its chemical structure. Photo courtesy U.S. Drug Enforcement Administration Powder cocaine. ­Cocaine as a drug is taken in one of three ways: It is snorted, injected or smoked."}, {"url": "https://en.wikipedia.org/wiki/Cracking_(chemistry)", "passage_text": "The rate of cracking and the end products are strongly dependent on the temperature and presence of catalysts. Cracking is the breakdown of a large alkane into smaller, more useful alkanes and alkenes. Fluid catalytic cracking produces a high yield of petrol and LPG, while hydrocracking is a major source of jet fuel, Diesel fuel, naphtha, and again yields LPG. Refinery using the Shukhov cracking process, Baku, Soviet Union, 1934."}, {"url": "http://www.docbrown.info/page04/OilProducts06.htm", "passage_text": "Oil, useful products, environmental problems, introduction to organic chemistry. 6. Cracking a problem of supply and demand, other products. Cracking is a thermal decomposition process by which large alkane hydrocarbon molecules are broken down by passing them over a heated catalyst at high pressure. The products are smaller alkanes used for fuels (e.g. petrol or diesel) and alkenes which are used to make polymers plastics and other important compounds. These notes on cracking alkanes to make alkenes for plastics and other products from cracking like petrol and diesel fuels are designed to meet the highest standards of knowledge and understanding required for students/pupils doing GCSE chemistry, IGCSE chemistry, O Level chemistry and KS4 science courses."}, {"url": "http://www.chemicalforums.com/index.php?topic=26940.0", "passage_text": "But separately, I have read that cracking produces a variety of hydrocarbon (emphasis intended) products. So going back to your first equation. C 6 H 14 → C 3 H 6 + C 3 H 8. I'm not sure that C 3 H 6 + C 3 H 8 will be the only products-which is where you came in. "}, {"url": "https://en.wikipedia.org/wiki/Cracking_(chemistry)", "passage_text": "More loosely, outside the field of petroleum chemistry, the term cracking is used to describe any type of splitting of molecules under the influence of heat, catalysts and solvents, such as in processes of destructive distillation or pyrolysis. Fluid catalytic cracking produces a high yield of petrol and LPG, while hydrocracking is a major source of jet fuel, Diesel fuel, naphtha, and again yields LPG. Refinery using the Shukhov cracking process, Baku, Soviet Union, 1934."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/aqa_pre_2011/oils/polymersrev1.shtml", "passage_text": "This breaks chemical bonds in the molecules, and forms smaller hydrocarbon molecules. Cracking is an example of a thermal decomposition [thermal decomposition: A reaction in which substances are broken down by heat. ] reaction. Your web browser does not have JavaScript switched on at the moment. For information on how to enable JavaScript please go to the Webwise site. Crude oil often contains too many large hydrocarbon molecules and not enough small hydrocarbon molecules to meet demand-this is where cracking comes in. Cracking allows large hydrocarbon molecules to be broken down into smaller, more useful"}, {"url": "http://www.gcsescience.com/o33.htm", "passage_text": "Cracking an alkane produces a smaller alkane plus an alkene. If you add up the number of hydrogen atoms in the above reaction, you will see that there are 22 on each side. An alkene is produced because the original alkane does not have enough hydrogen atoms to produce two more alkanes. "}, {"url": "https://en.wikipedia.org/wiki/Cracking_(chemistry)", "passage_text": "A large number of chemical reactions take place during the cracking process, most of them based on free radicals. Computer simulations aimed at modeling what takes place during steam cracking have included hundreds or even thousands of reactions in their models. Fluid catalytic cracking produces a high yield of petrol and LPG, while hydrocracking is a major source of jet fuel, Diesel fuel, naphtha, and again yields LPG. Refinery using the Shukhov cracking process, Baku, Soviet Union, 1934."}]