[{"url": "http://www.webmd.com/drugs/2/drug-11574/dexedrine-oral/details", "passage_text": "Uses. Dextroamphetamine is used to treat attention deficit hyperactivity disorder (ADHD) as part of a total treatment plan, including psychological, social, and other treatments. It may help to increase the ability to pay attention, concentrate, stay focused, and stop fidgeting. Dextroamphetamine is used to treat attention deficit hyperactivity disorder (ADHD) as part of a total treatment plan, including psychological, social, and other treatment"}, {"url": "https://en.wikipedia.org/wiki/Dextroamphetamine", "passage_text": "Dextroamphetamine is used to treat attention deficit hyperactivity disorder (ADHD) and narcolepsy (a sleep disorder), and is sometimes prescribed off-label for its past medical indications, such as depression, obesity, and nasal congestion. Pharmaceutical dextroamphetamine sulfate is available as both a brand name and generic drug in a variety of dosage forms. Dextroamphetamine is sometimes prescribed as the inactive prodrug lisdexamfetamine dimesylate, which is converted into dextroamphetamine after absorption."}, {"url": "https://www.patientslikeme.com/treatments/show/11926-damphetamine-salt-combo-side-effects-and-efficacy?brand=t", "passage_text": "Generic Name: Amphetamine-Dextroamphetamine. D-amphetamine Salt Combo is a combination of dextroamphetamine and amphetamine, stimulants used for Attention-deficit/hyperactivity disorder (ADHD) and for narcolepsy. Amphetamine and dextroamphetamine can cause side effects that may impair your thinking or reactions. Be careful if you drive or do anything that requires you to be awake and alert. Do not take amphetamine and dextroamphetamine late in the day. A dose taken too late in the day can cause sleep problems (insomnia)."}, {"url": "http://amphetamines.com/types/dextroamphetamine/", "passage_text": "Dextroamphetamine is a central nervous system stimulant from the amphetamine family that “works by changing the amounts of certain natural substances in the brain” (NLM). The drug can legally be obtained by prescription only as it is a schedule II controlled substance. The dextroamphetamine salts constitute about 75% of the ADHD drug known as Adderall and is the active metabolite of the drug lisdexamfetamine also known by the brand name Vyvanse."}, {"url": "http://sleep.emedtv.com/dextroamphetamine/dextroamphetamine.html", "passage_text": "Dextroamphetamine is commonly prescribed to treat children and teenagers with attention deficit hyperactivity disorder. Dextroamphetamine sulfate (Dexedrine ®) is a prescription medication that is used for the treatment of attention deficit hyperactivity disorder (ADHD). It is also used to treat narcolepsy. The medication comes in two forms: tablets and extended-release capsules. Potential side effects include loss of appetite, restlessness, and dry mouth. Dextroamphetamine sulfate (Dexedrine ®) is a prescription medication that is used for the treatment of attention deficit hyperactivity disorder (ADHD). It is also used to treat narcolepsy."}, {"url": "http://amphetamines.com/types/dextroamphetamine/", "passage_text": "Dextroamphetamine is a psychostimulant drug that is approved by the Food and Drug Administration for the treatment of Attention deficit-hyperactivity disorder (ADHD) and narcolepsy. The drug is available as a generic drug called Dextroamphetamine or under various brand names such as Dexedrine or Dextrostat. The dextroamphetamine salts constitute about 75% of the ADHD drug known as Adderall and is the active metabolite of the drug lisdexamfetamine also known by the brand name Vyvanse."}, {"url": "http://www.everydayhealth.com/drugs/dextroamphetamine", "passage_text": "Dextroamphetamine is a drug of abuse and may be habit-forming. Keep track of the amount of medicine used from each new bottle. You should be aware if anyone is using your medicine improperly or without a prescription. Dextroamphetamine can pass into breast milk and may harm a nursing baby. Tell your doctor if you are breast-feeding a baby. Long-term use of dextroamphetamine can slow a child's growth. Tell your doctor if the child using this medication is not growing or gaining weight properly."}, {"url": "https://en.wikipedia.org/wiki/Dextroamphetamine", "passage_text": "Dextroamphetamine is the more active dextrorotatory, or right-handed, enantiomer of the amphetamine molecule. Pharmaceutical dextroamphetamine sulfate is available as both a brand name and generic drug in a variety of dosage forms. Dextroamphetamine is sometimes prescribed as the inactive prodrug lisdexamfetamine dimesylate, which is converted into dextroamphetamine after absorption."}]