[{"url": "https://answers.yahoo.com/question/index?qid=20140426212306AAv4T24", "passage_text": "If you are eligible to belong to a clan you must do the research to find out. A crest is merely a small component of a coat of arms. Coats of arms do not belong to families and definitely have nothing at all to do with surnames. The surname product business is a big scam. Report Abuse. You research your ancestry until oi find a clan member. You'd do well to see if maternal lines count; if not, you'd research just your gather, his father, his father ... Here is a picture of a coat of arms with the crest outlined."}, {"url": "https://answers.yahoo.com/question/index?qid=20140426212306AAv4T24", "passage_text": "How do I find out which Scottish clan I belong to? I know what the family crest looks like, but can't seem to find anywhere that allows me to search by crest. Report Abuse. You research your ancestry until oi find a clan member. You'd do well to see if maternal lines count; if not, you'd research just your gather, his father, his father ... Here is a picture of a coat of arms with the crest outlined."}, {"url": "http://www.celticstudio.com/celticstudio/database/clans/database.htm", "passage_text": "Select the first letter of your Clan or Family name, then scroll through the list to find your name. Click on your name and you will be shown the Clan connection with a colour picture of your crest. SOME GREAT NEW FEATURES. "}, {"url": "http://www.scotclans.com/scottish-clans/clans-a-z/", "passage_text": "We are constantly working on improving out Scottish Clans List. Please use our Clan search at the top of the page if you can’t see your name. Your name may not be a Clan name but could be part of a Clan. "}, {"url": "http://www.scotcrest.com/clanfinder.php", "passage_text": "Clan Finder. Use our Clan Finder tool to find out about your family roots. in Scotland, which tartan's are associated with your name. and what your clan is well known for. Then find products available in your family's crest and tartan. "}, {"url": "https://answers.yahoo.com/question/index?qid=20140426212306AAv4T24", "passage_text": "Now the Scots have clan badges. If you find out you can belong to a clan you can wear the crest portion of your chief's coat of arms enclosed in a belt. Report Abuse. You research your ancestry until oi find a clan member. You'd do well to see if maternal lines count; if not, you'd research just your gather, his father, his father ... Here is a picture of a coat of arms with the crest outlined."}]