[{"url": "https://answers.yahoo.com/question/index?qid=20070509215422AAk5l9t", "passage_text": "The dealership actually pays less than invoice for the cars. While I don't know who actully comes up with the invoice price, it is used as a bottom line for most dealerships. Most dealerships will not sell anything below invoice, and they will tell you it is they're cost. Submit. · just now. Report Abuse. Invoice is the supposied price the dealer purchased the car for and the MSRP is what the automaker said the dealer ship should sell it for. this is why they get tons of people in to the dealer ship when they have thier hunders of dollars over invoice sale."}, {"url": "http://www.carsdirect.com/car-pricing/cars-factory-invoice-prices-vs-dealer-invoice-prices", "passage_text": "Dealer Costs That Affect the MSRP. The invoice price is the total investment of the car dealership for the car, meaning the total amount of money they pay for the vehicle. Here are 5 things that are included in that price, which increase the manufacturer's suggested retail price, or MSRP. 1  The car itself. 2  This is a given, and should cost the most. The dealer invoice is the price the manufacturer bills the dealer for the vehicles they purchase, plus any options equipped. This is in essence the dealer's cost, and is not generally shared with the customer."}, {"url": "http://www.carsdirect.com/car-pricing/cars-factory-invoice-prices-vs-dealer-invoice-prices", "passage_text": "Factory Invoice. The factory invoice is the total cost to the dealer for a vehicle. This price is the sum of the base invoice or cost for the base model of the car, plus the cost of options, destination fees and manufacturer fees. The dealer invoice is the price the manufacturer bills the dealer for the vehicles they purchase, plus any options equipped. This is in essence the dealer's cost, and is not generally shared with the customer."}, {"url": "http://www.edmunds.com/car-buying/pricing-basics-for-new-car-buying.html", "passage_text": "Here's why the invoice price is only roughly what the dealer paid for the car. It's because of the holdback amount that most manufacturers assign to a car. The holdback is a percentage of the sticker price or invoice price. Manufacturers pay it to the dealer after he sells a car. This means that a dealer could sell a car at invoice price, tell the customer that's he not making one penny on the deal and still get a check from the manufacturer a month later for $500. It's basically the price that the dealer would like you to pay for the car. Invoice Price: This is roughly what the dealer paid the carmaker for the vehicle. The roughly aspect will be discussed later. True Market Value (TMV®) : This is the price at which you can probably buy the car, according to Edmunds.com."}, {"url": "http://ask.cars.com/2007/10/what-is-invoice.html", "passage_text": "Simply put, there’s a price that the dealership pays for a car, called invoice price, and then there’s the price that automakers want the car sold at, called the MSRP. And that means selling as close to the MSRP as possible, though you can usually score a price lower than the MSRP. Although we can say it as simply as possible, invoice and MSRP prices simply aren’t that simple. The Cars.com article “Getting the Best Deal: Purchase Price and Trade-Ins” explains why:"}, {"url": "http://www.autotrader.com/car-tips/buying-a-car-whats-an-msrp-228292", "passage_text": "Essentially, the invoice price is the amount of money that the dealership pays the manufacturer for a car. For example, a car with a $25,000 MSRP might have an invoice price of around $23,000, meaning that the dealer likely owns the car for $23,000. That means the dealer has a profit margin of around $2,000. Given that the invoice price is the dealership's cost on the car, you can't always find a dealer that's willing to sell the car for less than that. It is possible, though, because there are other ways that a dealership makes money from the sale of a given car"}, {"url": "http://ask.cars.com/2007/10/what-is-invoice.html", "passage_text": "“For most vehicle makes, the published invoice price is not the true dealer cost because of dealer holdback. Holdback is a portion of a car's sales price (typically 2 percent to 3 percent of either the invoice price or MSRP) that an automaker returns to a dealer, usually on a quarterly basis. It's a way of boosting the dealer's cash flow and helps the dealer keep his lights on.”. And that means selling as close to the MSRP as possible, though you can usually score a price lower than the MSRP. Although we can say it as simply as possible, invoice and MSRP prices simply aren’t that simple. The Cars.com article “Getting the Best Deal: Purchase Price and Trade-Ins” explains why:"}]