[{"url": "http://www.wiley.com/college/beran/0471214981/samplechapter/ex09.pdf", "passage_text": "To prepare a NaOH solution with an exact molar concentration, itmust be standardized with an acid that is a primary standard.In Part A of this experiment, dry potassium hydrogen phthalate, KHC 8 H 4 O 4, is usedas the primary acid standard for determining the molar concentration of a sodium hy-droxide solution. A. Standardization of a Sodium Hydroxide Solution Approximate molar concentration of diluted NaOH solution (Part A.3). Show calculations.Approximate mass of KHC 8 H 4 O 4 for the standardization of the NaOH solution (Part A.4). Show calculations."}, {"url": "http://www2.vernier.com/sample_labs/CHEM-A-06-COMP-standardizing_solution_NaOH.pdf", "passage_text": "3. Measure out the mass of NaOH needed to prepare 100 mL of a 0.10 M solution and add it to the flask of distilled water. Swirl the flask to dissolve the solid. CAUTION: Sodium hydroxide solution is caustic. The process of determining the unknown’s concentration is called standardization. Solutions of sodium hydroxide are virtually impossible to prepare to a precise molar concentration because the substance is hygroscopic."}, {"url": "http://www.slideshare.net/KaranveerSingh3/lab-report-on", "passage_text": "Chemistry Lab Report on standardization of acid and bases. 1  1. Purpose: To prepare standardize solution of sodium hydroxide and to determine the concentration of unknown sulfuric acid solution. 2  Data and Calculations: This experiment is divided into two parts (Part A and Part B). 1 PART A: Standardization of a Sodium Hydroxide solution NaOH Sample Code = O Trial 1 Mass of KHP transferred = 0.42 g Volume of Distilled water = 25 mL Volume of NaOH used = 22.50 mL Molar mass of KHP = 204.22 g/mol No. of moles of KHP = Mass of KHP used / Molar mass = 0.42 g / 204.22 g/mol = 0.0021 moles. 2  2."}, {"url": "http://www.ccchemistry.us/ch%20111%20experiment%2012a.pdf", "passage_text": "E. CALCULATIONS 1. Calculate the molar concentration of the sodium hydroxide solution using your data for eachtrial. Set up of calculation of M NaOH: (m olar mass of KHP = 204.23 g/mole) # g KHP 1 mole KHP 1 mole NaOH = M NaOH # L soln 204.23 g KHP 1 mole KHP volume of NaOH solution used in the titraion 2. "}, {"url": "http://faculty.scf.edu/GambinC/CHM%202046/CHM%202046%20Lab/standardization.doc", "passage_text": "Once the sodium hydroxide solution is standardized it can be used to determine the molarity of any acid solution. Consider the following example. A 50.00 mL solution of hydrochloric acid is titrated with a 0.100M solution of sodium hydroxide. The phenolphthalein end point was found at 37.50 mL of NaOH. A 25.00 mL sample of HBr is titrated with a 0.150 M standardized sodium hydroxide solution. The endpoint was reached when 18.80 mL of titrant had been added. Calculate the molar concentration of the HBr. A 20.00 mL sample of sulfuric acid (H2SO4) is titrated with a 0.100 "}, {"url": "http://www2.vernier.com/sample_labs/CHEM-A-06-COMP-standardizing_solution_NaOH.pdf", "passage_text": "It reacts with NaOH in a simple 1:1 stoichiometric ratio, thus making it an ideal substance to use to standardize a solution of NaOH. OBJECTIVES In this experiment, you will • Prepare an aqueous solution of sodium hydroxide to a target molar concentration. • Determine the concentration of your NaOH solution by titrating it with a solution of potassium hydrogen phthalate, abbreviated KHP, with an exact molar concentration. The process of determining the unknown’s concentration is called standardization. Solutions of sodium hydroxide are virtually impossible to prepare to a precise molar concentration because the substance is hygroscopic."}, {"url": "https://answers.yahoo.com/question/index?qid=20081122044515AAesaG1", "passage_text": "Rating Newest Oldest. Best Answer: I assume you mean determine the concentration of NaOH.. In chemistry we use strength (i.e. strong base vs weak base) to refer to a different property. Concentration is usually given by the molarity, or moles of solute (NaOH) per liter of solution. And has been mentioned already, the pH of the solution can tell you (indirectly) the concentration of the OH-ions and hence the concentration of NaOH. Or an acid/base titration can determine the concentration of the base. Lest you get into this issue again, let me urge the correct use of strength. Sodium hydroxide is a strong base. That was determined by Arrhenius about 125 years ago. "}, {"url": "http://faculty.ccbcmd.edu/~cyau/122%2007%20Acid-base%20titration%20JAN%202014.pdf", "passage_text": "Different types of titrations such as acid-base titrations and oxidation-reduction titrations have been utilized in chemical analyses. In this experiment an acid-base titration will be used to determine the molar concentration of a sodium hydroxide (NaOH) solution. Acid-base titrations are also called neutralization titrations because the acid reacts with the base to produce salt and water. "}, {"url": "http://tarpon.tamug.edu/chem117/7_acid_base_titration.pdf", "passage_text": "In this experiment, your goal is to determine the molar concentration of two acid solutions by conducting titrations with a base of known concentration. You will be testing hydrochloric acid (HCl), a strong acid solution, and acetic acid (CH 3 CO 2 H), a weak acid, solution. You will use a sodium hydroxide (NaOH), solution as your base of known concentration. The reaction equations are shown below in net ionic form."}]