[{"url": "http://www.naturalnews.com/028309_grapefruit_weight_loss.html", "passage_text": "Grapefruits not only contain high amounts of vitamin C, but they also contain large amounts of potassium, vitamin A, and Fiber. Grapefruit contains pectin which is a soluble fiber that has been shown to lower cholesterol and slow the buildup of plaque on the inside walls of blood vessels. Grapefruits are an excellent source of vitamin C. Vitamin C helps to support the immune system and can help reduce cold symptoms or the severity of the cold symptoms. Vitamin C may also reduce the severity of asthma, osteoarthritis and rheumatoid arthritis."}, {"url": "http://www.webmd.com/diet/a-z/grapefruit-diet", "passage_text": "The classic version of the diet involves: 1  Cutting back on sugar and carbs (including rice, potatoes, and pasta). 2  Avoiding certain foods, such as celery and white onion. 3  Eating more of foods that are high in protein, fat, and/or cholesterol (such as eggs, pork, and red meat). People were even trying it back in the 1930s. Its fans claim that grapefruit contains certain enzymes that, when eaten before other foods, help burn off fat. The diet, which has several variations, lasts 10-12 days and claims to help you lose as much as 10 pounds."}, {"url": "http://www.stylecraze.com/articles/amazing-benefits-of-grapefruits-for-skin-and-health/", "passage_text": "1 Grapefruits help to block the absorption of carbs in the body. 2  Drinking grapefruit juice will help you to burn the stored fat. 3  Eating one grapefruit a day will help you to regulate your body and correct weight problems. 4  Grape fruits are high in enzymes which help to cut down the fat. In addition to being rich in Vitamin C, grapefruits are also rich In Vitamin A, fiber, potassium and magnesium. Additionally it contains moderate levels of Vitamin B complex such as Folate, riboflavin, pyridoxine and thiamine in addition to some resourceful minerals such as iron, calcium, copper and phosphorus."}, {"url": "http://www.medicalnewstoday.com/articles/280882.php", "passage_text": "Blood pressure and heart health. The powerful nutrient combination of fiber, potassium, lycopene, vitamin C and choline in grapefruit all help to maintain a healthy heart. One study found that a diet supplemented with fresh red grapefruit positively influences blood lipid levels, especially triglycerides. "}, {"url": "http://healthyeating.sfgate.com/grapefruits-good-you-3573.html", "passage_text": "One cup of grapefruit sections contains 74 calories. Grapefruits are large citrus fruits that range from white to pink to red. They contain a healthy dose of fiber, are low in calories and contain 0 grams of fat. Grapefruits might also help reduce your risk of cardiovascular disease, according to a 2007 article published in the Nutrition Journal."}, {"url": "http://www.stylecraze.com/articles/amazing-benefits-of-grapefruits-for-skin-and-health/", "passage_text": "Grape fruit is rich in Vitamin A, carotene and lycopene. It is often revered as the “fruit of paradise” for its health promoting benefits as well as disease healing properties. Pink and red grapefruits are rich in beta carotene. It is also a storehouse of polychemicals such as flavonoids, terpens and limonoids. In addition to being rich in Vitamin C, grapefruits are also rich In Vitamin A, fiber, potassium and magnesium. Additionally it contains moderate levels of Vitamin B complex such as Folate, riboflavin, pyridoxine and thiamine in addition to some resourceful minerals such as iron, calcium, copper and phosphorus."}, {"url": "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=25", "passage_text": "Grapefruit is an excellent source of vitamin C, a vitamin that helps to support the immune system. Vitamin C-rich foods like grapefruit may help reduce cold symptoms or severity of cold symptoms; over 20 scientific studies have suggested that vitamin C is a cold-fighter. Tart and tangy with an underlying sweetness, grapefruit has a juiciness that rivals that of the ever popular orange and sparkles with many of the same health promoting benefits. Although available throughout the year, they are in season and at their best from winter through early spring."}, {"url": "http://www.nutrition-and-you.com/grapefruit.html", "passage_text": "Grapefruit nutrition facts. Refreshing and delicious grapefruit is rich in phytonutrients like lycopene, vitamin A, and beta-carotene. The fruit is well known as fruit from the paradise for its unique health-promoting as well as disease preventing properties especially among the health-conscious, fitness enthusiasts. Studies suggest that these compounds have antioxidant properties and are essential for vision. The total antioxidant strength measured in terms of oxygen radical absorbance capacity (ORAC) of grapefruit is 1548 µmol TE/100 g. Further, vitamin A is also required maintaining healthy mucus membranes and skin."}, {"url": "http://www.webmd.com/diet/a-z/grapefruit-diet", "passage_text": "1 Cutting back on sugar and carbs (including rice, potatoes, and pasta). 2  Avoiding certain foods, such as celery and white onion. 3  Eating more of foods that are high in protein, fat, and/or cholesterol (such as eggs, pork, and red meat). 4  Eating grapefruit or grapefruit juice before or with every meal. People were even trying it back in the 1930s. Its fans claim that grapefruit contains certain enzymes that, when eaten before other foods, help burn off fat. The diet, which has several variations, lasts 10-12 days and claims to help you lose as much as 10 pounds."}, {"url": "http://healthyeating.sfgate.com/benefits-ruby-red-grapefruit-5654.html", "passage_text": "Red grapefruit’s blend of antioxidant-rich vitamins and carotenoids -- including the lycopene that gives ruby red its distinctive color -- appears to give it the edge over white grapefruit in lowering blood lipid levels and in stimulating antioxidant activity in the bloodstream. "}]