[{"url": "http://www.rxlist.com/augmentin-drug/indications-dosage.htm", "passage_text": "INDICATIONS. To reduce the development of drug-resistant bacteria and maintain the effectiveness of AUGMENTIN (amoxicillin/clavulanate potassium) and other antibacterial drugs, AUGMENTIN should be used only to treat infections that are proven or strongly suspected to be caused by susceptible bacteria. Since both the 250 mg and 500 mg tablets of AUGMENTIN contain the same amount of clavulanic acid (125 mg, as the potassium salt), two 250 mg tablets of AUGMENTIN are not equivalent to one 500 mg tablet of AUGMENTIN."}, {"url": "http://www.rxwiki.com/augmentin", "passage_text": "Updated: Augmentin is a prescription medication used to treat symptoms of infection in the ears, nose, airways, skin, and urinary tract. Augmentin belongs to a group of drugs called beta-lactam antibiotics, which help fight infections due to bacteria. Augmentin is a prescription medication used to treat symptoms of infection in the ears, nose, airways, skin, and urinary tract. This medication may be prescribed for other uses. Ask your doctor or pharmacist for more information."}, {"url": "http://www.everydayhealth.com/drugs/augmentin", "passage_text": "Augmentin is the brand name of a combination antibiotic drug containing amoxicillin and clauvulanate. It's used to treat bacterial infections in your airways, such as a sinus infection or pneumonia. Amoxicillin is a penicillin antibiotic that kills bacteria by blocking production of a chemical the germs need to build their cell walls. Clavulanate is a chemical that helps antibiotics overcome some bacteria's antibiotic resistance. The Food and Drug Administration (FDA) approved Augmentin in 1984."}, {"url": "http://antibiotics.emedtv.com/augmentin/augmentin.html", "passage_text": "Augmentin ® (amoxicillin and clavulanate potassium) is a prescription antibiotic medication. It is used to treat a variety of infections. Augmentin ES -600 ® and Augmentin XR ® are similar but slightly different products. This article applies only to regular Augmentin products (not ES or XR). "}, {"url": "http://www.rxlist.com/augmentin-drug/indications-dosage.htm", "passage_text": "The 250-mg tablet of AUGMENTIN and the 250-mg chewable tablet should not be substituted for each other, as they are not interchangeable. The 250-mg tablet of AUGMENTIN and the 250-mg chewable tablet do not contain the same amount of clavulanic acid (as the potassium salt). The 250-mg tablet of AUGMENTIN contains 125 mg of clavulanic acid, whereas the 250-mg chewable tablet contains 62.5 mg of clavulanic acid. Since both the 250 mg and 500 mg tablets of AUGMENTIN contain the same amount of clavulanic acid (125 mg, as the potassium salt), two 250 mg tablets of AUGMENTIN are not equivalent to one 500 mg tablet of AUGMENTIN."}, {"url": "http://www.everydayhealth.com/drugs/amoxicillin", "passage_text": "A: Amoxicillin is an antibiotic in the penicillin group of drugs. It fights bacteria in your body. Amoxicillin is used to treat many types of infections caused by bacteria, such as ear infections, bladder infections, pneumonia, gonorrhea, and E. coli or salmonella infection. Amoxicillin is used to treat many different types of infections caused by bacteria, such as ear infections, bladder infections, pneumonia, gonorrhea, and E. coli or salmonella infection. The most common side effects reported with Amoxil use include nausea, vomiting, diarrhea, rashes, and antibiotic-associated colitis."}, {"url": "http://www.rxlist.com/augmentin-drug/indications-dosage.htm", "passage_text": "The usual adult dose is one 500-mg tablet of AUGMENTIN every 12 hours or one 250 mg tablet of AUGMENTIN every 8 hours. For more severe infections and infections of the respiratory tract, the dose should be one 875-mg tablet of AUGMENTIN every 12 hours or one 500-mg tablet of AUGMENTIN every 8 hours. Since both the 250 mg and 500 mg tablets of AUGMENTIN contain the same amount of clavulanic acid (125 mg, as the potassium salt), two 250 mg tablets of AUGMENTIN are not equivalent to one 500 mg tablet of AUGMENTIN."}, {"url": "http://www.rxwiki.com/augmentin", "passage_text": "The usual adult dose is one Augmentin tablet 500 mg/125 mg every 12 hours or one Augmentin tablet 250 mg/125 mg every 8 hours. 1  For more severe infections and infections of the respiratory tract, the dose should be one Augmentin tablet 875 mg/125 mg every 12 hours or one Augmentin tablet 500 mg/125 mg every 8 hours. Augmentin is a prescription medication used to treat symptoms of infection in the ears, nose, airways, skin, and urinary tract. This medication may be prescribed for other uses. Ask your doctor or pharmacist for more information."}, {"url": "http://antibiotics.emedtv.com/augmentin/augmentin-dosage.html", "passage_text": "The usual dose of Augmentin for adults and children weighing more than 88 pounds is one 500-mg tablet every 12 hours or one 250-mg tablet every 8 hours. Augmentin Doses for Adults and Larger Children. Children weighing 40 kg (88 pounds) or more are given the same dose as adults. The usual dosage is one 500-mg tablet of Augmentin"}, {"url": "http://antibiotics.emedtv.com/augmentin/augmentin-dosage.html", "passage_text": "For more severe infections, one 875-mg tablet every 12 hours or one 500-mg tablet every 8 hours may be recommended. It is important to note that two 250-mg Augmentin tablets are not equivalent to one 500-mg tablet (they contain the same amount of amoxicillin, but not the same amount of clavulanate potassium). Augmentin Doses for Adults and Larger Children. Children weighing 40 kg (88 pounds) or more are given the same dose as adults. The usual dosage is one 500-mg tablet of Augmentin every 12 hours or one 250-mg tablet every 8 hours."}]