[{"url": "http://www.babycenter.com.au/a1015615/macrosomia-big-baby", "passage_text": "Macrosomia (big baby). The average newborn weight is about 3.4 kilograms (kg) / 7 pounds (lb) 8 ounces (oz). Babies weighing more than 4.5kg/ 9lb 15oz at birth are considered much larger than average or macrosomic, which literally means of large body. It's very difficult to determine whether a baby is truly macrosomic while still in the uterus (womb) - only the post-birth weight confirms this."}, {"url": "http://hypertextbook.com/facts/2002/LeahOppenheim1.shtml", "passage_text": "The average weight for a baby at birth is approximately 3.4 kilograms. Newborns range in weight from 2.5 kilograms to 4 kilograms. This average weight is typical for a normal full-term Caucasian newborn. African American and Asian newborns have a slightly smaller weight at birth. A newborn's body weight is composed mostly of water. Water makes up approximately 80% of a newborn's weight. After the first week and up to six months after birth newborns also gain about 0.198 kg a week. A premature baby weighs less than 2.7 kg. Although the weight of babies vary, the average birth weight of 3.4 kg remains relatively constant"}, {"url": "http://www.newkidscenter.com/Baby-Weight-Gain-1.html", "passage_text": "Normal Baby Weight Gain for 0-12 Months Olds. Parents read a lot about the specifics and details of normal growth in this age group. A full term infant must have an average weight at birth of 3.3 kg or 7 lb 4 oz. Bottle-fed infants regain the required birth weight rather sooner than the ones fed by breast milk. In the initial 3 months, infants put on about 1 kg each month. From 3-6 months, weight gain reduces to 1/2 kg/month; from 6-9 months, it becomes 1/3, and for 9-12 months, it settles to 1/4 kg. In full term infants, the birth weight doubles in the 4 th month and triples when they reach 12 months of age"}, {"url": "http://www.babycenter.com.au/a1015615/macrosomia-big-baby", "passage_text": "Share. The average newborn weight is about 3.4 kilograms (kg) / 7 pounds (lb) 8 ounces (oz). Babies weighing more than 4.5kg/ 9lb 15oz at birth are considered much larger than average or macrosomic, which literally means of large body. It's very difficult to determine whether a baby is truly macrosomic while still in the uterus (womb) - only the post-birth weight confirms this."}, {"url": "http://www.emedicinehealth.com/physical_growth_in_newborns-health/article_em.htm", "passage_text": "The average birth weight for babies is around 7.5 lb (3.5 kg) , although between 5.5 lb (2.5 kg) and 10 lb (4.5 kg) is considered normal. In general: 1  Boys are usually a little heavier than girls. In the first month, the typical newborn gains about 0.7 oz (20 g) a day, or about 4 oz (110 g) to 8 oz (226.8 g) a week. The average length of full-term babies at birth is 20 in."}, {"url": "http://www.babycenter.com.au/a1015615/macrosomia-big-baby", "passage_text": "Home Pregnancy Health Pregnancy complications. The average newborn weight is about 3.4 kilograms (kg) / 7 pounds (lb) 8 ounces (oz). Babies weighing more than 4.5kg/ 9lb 15oz at birth are considered much larger than average or macrosomic, which literally means of large body. It's very difficult to determine whether a baby is truly macrosomic while still in the uterus (womb) - only the post-birth weight confirms this."}, {"url": "http://www.baby2see.com/baby_birth_weight.html", "passage_text": "Newborn Baby birth weight At full term, the avarage baby will be about 20 inches (51 cm) long and will weigh approximately 6 to 9 pounds (2700 to 4000 grams). - During a normal pregnancy your baby will grow and develop at about the same rate as any other pregnancy. Small for gestational age (SGA) babies are those whose birth weight lies below the 10th percentile for that gestational age. Low birth weight (LBW), is sometimes used to define a baby that weighs less than 5 lb 8 oz (2500 g) regardless of"}, {"url": "http://www.indiaparenting.com/pregnancy/121_2977/babys-birth-weight.html", "passage_text": "The average weight of a baby born full term (i.e. between 37 and 41 weeks) is 3.2 kg. An average Indian baby weighs approximately 2.8 kg. At full term, an average baby is 51 cm long and will weigh anywhere between 2.7 to 4 kg. Newborns gain about 30 g per day during the first month and grow about 1 to 1.5 inches in height during the same period. Newborns experience periods of rapid growth at 7 to 10 days and again at 3 and 6 weeks."}]