[{"url": "http://www.howmuchisit.org/pastor-for-a-wedding-cost/", "passage_text": "1 Pastors for a wedding can cost differently based on the state in which the wedding ceremony will be held. 2  On average, a pastor is going to cost anywhere from $100 to as much as $450. 3  WeddingPastor.com offers different plans at different price points. 1 Their prices range from $200 to $450. 2  If you are from the area of Sacramento, Sacramento-Wedding-Officiants.com offers the service of a pastor for anywhere from $230 to $250. 3  This is a one time payment made to the pastor and includes several things."}, {"url": "https://www.dailyworth.com/posts/1893-how-much-should-you-spend-on-a-wedding-gift", "passage_text": "Which still leaves the question: cash or gift? Nationwide, wedding guests seem split on the issue. According to American Express, 35 percent of guests will buy a gift off the registry and 32 percent will give cash. (The remainder will give a mix of gift cards and other items.) But if you ask the bride and groom what they’d prefer, 52 percent say they prefer cash. "}, {"url": "http://finance.yahoo.com/news/how-much-to-spend-on-a-wedding-gift--8-rules-to-live-by-200227304.html", "passage_text": "Couples spent an average $220 per guest at weddings in 2013, according to TheKnot.com, including $66 on food alone. But all of our experts agreed that basing the cost of your gift on how much you think the couple is spending on food and entertainment is an antiquated notion. How to Buy the Perfect Wedding Gift. Wedding etiquette tips on how much you should give from Jessica Silvester, Senior Editor of New York Magazine. 1  2  3:11 Now watching Up next How to Save Money on Dental Procedures A health savings expert shares research and negotiating tips to reduce your bill."}, {"url": "http://finance.yahoo.com/news/how-much-to-spend-on-a-wedding-gift--8-rules-to-live-by-200227304.html", "passage_text": "The majority of wedding guests who are friends of the bride and groom spent less than $100 for a gift, according to a 2010 survey by TheKnot.com. Relatives shelled out an average of $146 on wedding gifts and were twice as likely to spend more than $100 compared with friends of the couple. How to Buy the Perfect Wedding Gift. Wedding etiquette tips on how much you should give from Jessica Silvester, Senior Editor of New York Magazine. 1  2  3:11 Now watching Up next How to Save Money on Dental Procedures A health savings expert shares research and negotiating tips to reduce your bill."}, {"url": "http://www.theweddingenvelope.com/", "passage_text": "How it works is that we took into account the most important cost factors of a wedding and then factored in the average out-of-pocket costs to you, the guest, creating a unique monetary amount that you should give as your wedding gift to the newlyweds. Please remember this is but a suggested monetary gift. "}, {"url": "http://finance.yahoo.com/news/how-much-to-spend-on-a-wedding-gift--8-rules-to-live-by-200227304.html", "passage_text": "1 1  2:28 Now watching Up next How to Buy the Perfect Wedding Gift Wedding etiquette tips on how much you should give from Jessica Silvester, Senior Editor of New York Magazine. How to Buy the Perfect Wedding Gift. Wedding etiquette tips on how much you should give from Jessica Silvester, Senior Editor of New York Magazine. 1  2  3:11 Now watching Up next How to Save Money on Dental Procedures A health savings expert shares research and negotiating tips to reduce your bill."}, {"url": "http://www.howmuchisit.org/pastor-for-a-wedding-cost/", "passage_text": "1 On average, a pastor is going to cost anywhere from $100 to as much as $450. 2  WeddingPastor.com offers different plans at different price points. 3  They have 4 plan levels from officiating just the wedding ceremony only to holding private meetings, rehearsals, and ceremonies. 4  Their prices range from $200 to $450. 1 Their prices range from $200 to $450. 2  If you are from the area of Sacramento, Sacramento-Wedding-Officiants.com offers the service of a pastor for anywhere from $230 to $250. 3  This is a one time payment made to the pastor and includes several things."}, {"url": "http://www.cbsnews.com/news/wedding-gift-etiquette-what-to-give-and-how-much/", "passage_text": "If you're attending a relative or a friend's wedding, the wedding website suggests somewhere between $100 and $125. TheKnot.com also took the pulse of what real brides and grooms have spent on weddings in the past in its registry study. On average, friends spend $79 on the bride and groom's present, said Miles. Family members, meanwhile, spend an average of $146. Hill says, though, overall wedding guests should assess their budget and how well they know the bride and groom. As a guest, weddings can be a lot of fun, but they can also get a little pricey. From the engagement gift and the bridal shower to the bachelor or bachelorette party -- all the way to the wedding day, your bank account could get depleted pretty quickly."}, {"url": "http://finance.yahoo.com/news/how-much-to-spend-on-a-wedding-gift--8-rules-to-live-by-200227304.html", "passage_text": "Not only is the cost of a wedding soaring — couples spent an average of $30,000 in 2013, according to TheKnot.com, up from $28,000 the year before and the highest level since 2008 — but wedding guests are spending more than ever, as well. How to Buy the Perfect Wedding Gift. Wedding etiquette tips on how much you should give from Jessica Silvester, Senior Editor of New York Magazine. 1  2  3:11 Now watching Up next How to Save Money on Dental Procedures A health savings expert shares research and negotiating tips to reduce your bill."}]