[{"url": "http://encyclopedia2.thefreedictionary.com/Electrical+substation", "passage_text": "Electric power substation. An assembly of equipment in an electric power system through which electrical energy is passed for transmission, distribution, interconnection, transformation, conversion, or switching. See Electric power systems. An assembly of equipment in an electric power system through which electric energy is passed for transmission, transformation, distribution, or switching. Also known as"}, {"url": "http://www.tech.mtu.edu/~avsergue/EET3390/Lectures/CHAPTER6.pdf", "passage_text": "Distribution Substations CHAPTER 6. Electrical Substation An electrical substation is a subsidiary station of an electricity generation, transmission and distribution system where voltage is transformed from high to low or the reverse using transformers. For economy of construction the collector system operates around 35 kV, and the collector substation steps up voltage to a transmission voltage for the grid. The collector substation can also provide power factor correction if it is needed, metering and control of the wind farm."}, {"url": "https://www.osha.gov/SLTC/etools/electric_power/illustrated_glossary/substation.html", "passage_text": "Step-down transmission substations are located at switching points in an electrical grid. They connect different parts of a grid and are a source for subtransmission lines or distribution lines. The step-down substation can change the transmission voltage to a subtransmission voltage, usually 69 kV. The subtransmission voltage lines can then serve as a source to distribution substations. Sometimes, power is tapped from the subtransmission line for use in an industrial facility along the way."}, {"url": "https://en.wikipedia.org/wiki/Electrical_substation", "passage_text": "A substation may include transformers to change voltage levels between high transmission voltages and lower distribution voltages, or at the interconnection of two different transmission voltages. The word substation comes from the days before the distribution system became a grid. The input for a distribution substation is typically at least two transmission or sub transmission lines. Input voltage may be, for example, 115 kV, or whatever is common in the area. The output is a number of feeders."}, {"url": "https://en.wikipedia.org/wiki/Electrical_substation", "passage_text": "A substation is a part of an electrical generation, transmission, and distribution system. Substations transform voltage from high to low, or the reverse, or perform any of several other important functions. The input for a distribution substation is typically at least two transmission or sub transmission lines. Input voltage may be, for example, 115 kV, or whatever is common in the area. The output is a number of feeders."}, {"url": "http://www.merriam-webster.com/dictionary/substation", "passage_text": "substation. noun sub·sta·tion \\ˈsəb-ˌstā-shən\\. Tweet. : a place where the strength of electricity is changed as the electricity passes through on its way from the power plant to homes and businesses. Full Definition of SUBSTATION. : a subordinate or subsidiary station: as a: a branch post office b: a subsidiary station in which electric current is transformed c: a police station serving a particular area. See substation defined for English-language learners. See substation defined for kids."}, {"url": "https://www.osha.gov/SLTC/etools/electric_power/illustrated_glossary/substation.html", "passage_text": "A substation is a high-voltage electric system facility. It is used to switch generators, equipment, and circuits or lines in and out of a system. It also is used to change AC voltages from one level to another, and/or change alternating current to direct current or direct current to alternating current. The step-down substation can change the transmission voltage to a subtransmission voltage, usually 69 kV. The subtransmission voltage lines can then serve as a source to distribution substations. Sometimes, power is tapped from the subtransmission line for use in an industrial facility along the way."}, {"url": "https://en.wikipedia.org/wiki/Electrical_substation", "passage_text": "A switching substation is a substation without transformers and operating only at a single voltage level. Switching substations are sometimes used as collector and distribution stations. Sometimes they are used for switching the current to back-up lines or for parallelizing circuits in case of failure. The input for a distribution substation is typically at least two transmission or sub transmission lines. Input voltage may be, for example, 115 kV, or whatever is common in the area. The output is a number of feeders."}, {"url": "http://encyclopedia2.thefreedictionary.com/Electrical+substation", "passage_text": "(electricity). An assembly of equipment in an electric power system through which electric energy is passed for transmission, transformation, distribution, or switching. Also known as substation."}, {"url": "https://www.osha.gov/SLTC/etools/electric_power/illustrated_glossary/substation.html", "passage_text": "TOP. A step-up transmission substation receives electric power from a nearby generating facility and uses a large power transformer to increase the voltage for transmission to distant locations. A transmission bus is used to distribute electric power to one or more transmission lines. The step-down substation can change the transmission voltage to a subtransmission voltage, usually 69 kV. The subtransmission voltage lines can then serve as a source to distribution substations. Sometimes, power is tapped from the subtransmission line for use in an industrial facility along the way."}]