[{"url": "http://www.thekitchn.com/how-to-make-a-soft-boiled-egg-kitchn-cooking-lesson-138819", "passage_text": "Cook the eggs for 5 to 7 minutes: For 1 to 2 eggs, cook 5 minutes for a very runny yolk or up to 7 minutes for a barely-set yolk. For 3 or 4 eggs, add a few extra seconds to your timing. (For more than 4 eggs, cook in batches.) Remove the eggs with a slotted spoon. Run under cold tap water for 30 to 60 seconds."}, {"url": "http://www.taste.com.au/how+to/articles/2508/how+to+boil+eggs", "passage_text": "Simmer the eggs for 4 minutes for soft-boiled eggs. For semi-firm yolks and hard whites, simmer for 5 minutes. For hard-boiled eggs, simmer for 8 minutes. Use a slotted spoon to remove the egg from the water."}, {"url": "http://www.foodnetwork.com/how-to/photos/how-to-hard-boil-and-soft-cook-eggs.html", "passage_text": "For hard-boiled eggs, put the eggs in a pan and cover them with cold water. This way you'll have less of a chance of breaking them. Bring to a boil, put a lid on it and turn off the heat. Let it stand for 10 to 15 minutes."}, {"url": "http://www.food.com/recipe/perfect-soft-boiled-eggs-163724", "passage_text": "Cook. When I want a soft boiled egg I want the yolk soft and the white firm. The boiling time has a lot to do with your elevation. 5 minutes is perfect for an elevation of 1100 ft (330 meters) if you are nearer sea level decrease the boiling time if at a higher elevation increase the time."}, {"url": "http://www.marthastewart.com/318797/marthas-soft-boiled-eggs", "passage_text": "Directions. Place eggs in a saucepan large enough to accommodate them in a single layer. Fill the pan with cold water, covering eggs by an inch. Set over medium-high heat, and bring to a boil. Turn off heat, cover, and let stand 1 1/2 to 2 minutes. Remove eggs from water. Serve immediately in egg cups -- perfect for cracking and scooping the egg right from the shell."}, {"url": "http://www.bbc.co.uk/food/techniques/how_to_boil_eggs", "passage_text": "Cook for a further minute if you like your soft boiled eggs a little firmer. For a hard-boiled egg, start the egg in cold water and bring up to the boil. Once the water is gently boiling, set the timer for between 7-10 minutes depending on how well cooked you like your eggs. The longer you boil the egg, the firmer it will be."}]