[{"url": "https://www.quora.com/What-are-cultural-differences-between-Polynesia-Micronesia-and-Melanesia", "passage_text": "Melanesian people are Negroid and related to Australia aboriginals. They inhabit the Southern Pacific Islands near Australia, like New Guinea. Micronesian people are inhabitants of small groups of islands further north and now consisting of several nations, each with a different language. Some examples are Marshall Islands, Marianas Islands, Palau, Federated States of Micronesia. They are distinct genetically from Melanesians, most thought to originate from the Indonesian area. Polynesians and generally further east, are lighter skinned and again genetically distinct from the others, thought to originate from the original tribes of Taiwan and area. Hawaii and Tahiti are good examples."}, {"url": "http://www.essential-humanities.net/world-history/oceania/", "passage_text": "Oceania can be divided into four main culture areas: Australia, Melanesia, Micronesia, and Polynesia. Each culture area features distinct forms of subsistence, art (see Oceanian Art), religion, and so on. (Oceania is distinct from Southeast Asia in that the history and culture of Oceania are not strongly linked to the Asian mainland.) Oceania contains thousands of islands, scattered across thousands of miles of ocean."}, {"url": "http://www.southpacific.org/pacific/people.html", "passage_text": "Pacific Peoples. Tweet. The Sea of Islands that is the Pacific is divided into three great cultural areas: Polynesia and Melanesia lie mostly below the equator while Micronesia is above it. The name Polynesia comes from the Greek words poly (many) and nesos (islands)"}, {"url": "http://ri2naelah.blogspot.com/2010/10/micronesia-melanesia-and-polynesia.html", "passage_text": "is located in the middle and south Pasific. Its area is larger than Micronesia and Polynesia mergered. Polynesia consist of American Samoa, Cook Island, French Polynesia, Hawai, New Zealand, Niue, Pitcairn Island, Samoa, Tokelau, Tonga, Tuvalu, Wallis and Futuna archipelago. is generally defined as the islands within the Polynesian triangle."}, {"url": "https://en.wikipedia.org/wiki/Micronesia", "passage_text": "Micronesia is one of three major cultural areas in the Pacific Ocean, along with Polynesia and Melanesia. Micronesia is a region that includes approximately 2100 islands, with a total land area of 2,700 square kilometres (1,000 sq mi), the largest of which is Guam, which covers 582 square kilometres (225 sq mi). Aside from the Federated States of Micronesia, the Micronesia region encompasses four other sovereign, independent nations— Kiribati, Marshall Islands, Nauru, and Palau —as well as three U.S. territories — Guam, Northern Mariana Islands, and Wake Island."}, {"url": "http://cominganarchy.com/2007/06/25/oceanias-regions-micronesia-melanesia-and-polynesia/", "passage_text": "“*Micronesia*”:http://en.wikipedia.org/wiki/Micronesia includes the Federated States of Micronesia (FSM), Guam, the Northern Marianas, Palau, and the Marshall Islands. Most islands here are low coral atolls. “*Polynesia*”:http://en.wikipedia.org/wiki/Polynesia extends from Hawaii to Easter Island to New Zealand in a rough triangle. Geographically, this is an enormous and diverse area including all island types: continental islands, volcanic islands and"}, {"url": "https://answers.yahoo.com/question/index?qid=20070508172151AAvB1hq", "passage_text": "Melanesian people generally are dark-skinned and have afro/african type hair. Polynesia includes: Tonga, Samoa, Cook Islands, French Polynesia, Hawaii, and even New Zealand (the original people are Polynesian. If possible the people could be said to be part way between Melanesian and Polynesian. This is is no way a complete list of all the islands included as there are many small islands. Also, many Polynesian people live in Melanesia, and vice versa. There are many marriages as well between the people groups."}, {"url": "http://www.geocurrents.info/geopolitics/cultural-disparity-and-political-solidarity-in-the-melanesian-island-world", "passage_text": "The islands of the southwestern Pacific are conventionally divided into Melanesia, Micronesia, and Polynesia, based on the writings of the French explorer Jules Dumont d’Urville from the 1830s. "}]