[{"url": "https://en.wikipedia.org/wiki/Myofibril", "passage_text": "A myofibril (also known as a muscle fibril) is a basic rod-like unit of a muscle cell. Muscles are composed of tubular cells called myocytes, known as muscle fibers in striated muscle, and these cells in turn contain many chains of myofibrils. The filaments of myofibrils, myofilaments, consist of two types, thick and thin: 1  Thin filaments consist primarily of the protein actin, coiled with nebulin filaments. 2  Actin, when polymerized into filaments, forms the ladder along which the myosin filaments climb to generate motion"}, {"url": "http://anatomycorner.com/muscles/notes_muscles.html", "passage_text": "There are two types: MYOSIN-thick filaments ACTIN-thin filaments. Structure of a SARCOMERE (functional unit of a muscle). Actin and Myosin filaments are arranged in an overlapping pattern of light (I bands) and dark (A bands). In the middle of each I band is a line called a Z line. The section of a myofibril from one Z-line to the next Z-line is the SARCOMERE. "}, {"url": "http://medical-dictionary.thefreedictionary.com/sarcomere", "passage_text": "The segment of a myofibril between two adjacent Z lines, representing the functional unit of striated muscle. [sarco- + G. meros, part]. /sar·co·mere/ (sahr´ko-mēr) the contractile unit of a myofibril; sarcomeres are repeating units, delimited by the Z bands, along the length of the myofibril. [saer′sär]. Kōmir: Etymology, gk + sarx, meros. part the smallest functional unit of a. Myofibril sarcomeres occur as repeating units along the length of a, myofibril occupying the region Between z lines of the. myofibril"}, {"url": "http://www.answers.com/Q/What_is_one_of_the_functional_units_of_a_myofibril", "passage_text": "The smallest functional unit in a myofibril is a sarcomere. A sarcomere is composed of thin (actin) and thick (myosin) filaments. Actin slides past myosin when the muscle contracts. The myofibrils are cells in the muscle that provide energy to them and to atrophy is to shrink or become less, so myofibril atrophy is the shrinking or lessening or those cell … s within the muscle for any reason(such as lack of exercise or injury)."}, {"url": "http://www.answers.com/Q/What_is_one_of_the_functional_units_of_a_myofibril", "passage_text": "A myofibril is a bundle of contractile filaments (myofilaments),  1-2 μm in diameter, that are arranged in parallel groups in the  cytoplasm of striated muscle cells. . The myofibrils are cells in the muscle that provide energy to them and to atrophy is to shrink or become less, so myofibril atrophy is the shrinking or lessening or those cell … s within the muscle for any reason(such as lack of exercise or injury)."}, {"url": "http://www.ivyroses.com/Define/Myofibril", "passage_text": "Above: Diagram of the structure of a muscle fibre, indicating a single myofibril (top right). Above: Diagram of the structure of a muscle fibre, indicating a single myofibril (top right). Each myofibril consists of two types of protein filaments. They are thin filaments and thick filaments. Myofibril is the name given to cylindrical structures that extend along the complete length of each muscle cell. Recall that muscle cell = muscle fibre = muscle fiber (Am.Sp.)."}, {"url": "http://www.answers.com/Q/What_is_the_basic_functional_unit_of_a_myofibril", "passage_text": "It is sometimes called the building block of life.. Many cells may work together to form tissues, and two or mor … e different tissues that work together may form organs such as the heart or lungs and many organs working together may form organ systems such as the respiratory or digestive system. The cell is the basic unit of function and structure in animals, as  well as in other organisms. Some organisms have only a single cell,  while more complex organisms such a … s humans can have trillions of  cells."}, {"url": "https://en.wikipedia.org/wiki/Sarcomere", "passage_text": "A sarcomere (Greek sarx flesh, meros part) is the basic unit of striated muscle tissue. Skeletal muscles are composed of tubular muscle cells (myocytes called muscle fibers) which are formed in a process known as myogenesis. Muscle fibers are composed of tubular myofibrils. "}, {"url": "http://wps.aw.com/bc_campbell_concepts_7_oa/215/55163/14121913.cw/content/index.html", "passage_text": "muscle, muscle fibers, myofibrils, sarcomeres, thick and thin filaments. muscle, myofibrils, muscle fibers, sarcomeres, thick & thin filaments. muscle, sarcomeres, muscle fibers, myofibrils, thick and thin filaments. The ____________________ is/are the functional unit of muscle."}]