[{"url": "http://www.go-oregon.com/Tillamook-Bay/Attractions/", "passage_text": "Located on the beautiful and scenic North Oregon Coast, the Tillamook County Quilt Trail showcases the great heritage of historic barns and buildings in Tillamook County. This self-guided tour showcases each structure with a large painted wooden quilt block. Plus we strive to share the history of da... While traveling to Oregon be sure and stop by Corvallis in the very heart of the Willamette Valley, near great outdoor recreation and within 90 miles of Portland and the Oregon Coast."}, {"url": "http://www.go-oregon.com/Tillamook-Bay/tourism-attractions-sightseeing/", "passage_text": "In Depth. Sightseeing opportunities in Tillamook Bay are plentiful and diverse. Tourist attractions include museums and art galleries, amusement parks, National and State Parks, historical places, sporting events and festivals. If attractions aren't what you're looking for you can spend a day taking a scenic drive on one of the Tillamook Bay area's beautiful byways, back-ways, or historical routes exploring the diverse wildlife and scenery."}, {"url": "http://tillamookcoast.com/", "passage_text": "Tillamook Coast Life Blog. A black-tailed deer examines its world in the protected habitat of the U.S. Fish and Wildlife Service’s Nestucca Bay National Wildlife Refuge, one of the jewels of Oregon’s Tillamook Coast. Photo by Peter Pearsall, USFWS."}, {"url": "http://www.tripbuzz.com/things-to-do-with-kids/tillamook-or", "passage_text": "Things to Do with Kids in Tillamook, OR. TripBuzz found 30 things to do with kids in or near Tillamook, Oregon, including 9 fun activities for kids in nearby cities within 25 miles like Pacific City and Cannon Beach. 1 The city spans an area just under 2 square miles and maintains a strong Native American history. 2  The city is split by the five rivers of Tillamook, Trask, Wilson, Kilchis, and Miami, making for a vast and varied landscape. 3  Buzz Rank."}, {"url": "http://www.go-oregon.com/Tillamook-Bay/tourism-attractions-sightseeing/", "passage_text": "Tillamook Bay, Oregon Sightseeing. Sightseeing opportunities in Tillamook Bay are plentiful and diverse. Tourist attractions include museums and art galleries, amusement parks, National and State Parks, historical places, sporting events and festivals. If attractions aren't what you're looking for you can spend a day taking a scenic drive on one of the Tillamook Bay area's beautiful byways, back-ways, or historical routes exploring the diverse wildlife and scenery."}, {"url": "http://traveloregon.com/cities-regions/oregon-coast/tillamook/", "passage_text": "Tillamook. Show more info about Tillamook. Tillamook Located in the heart of Oregon Coast dairy country, Tillamook is home to the century-old Tillamook Cheese Factory — open daily for a self-guided tours and tastings (including their famous ice cream). Tillamook is located in Oregon Coast, home to 363 miles of secluded beaches, sand dunes, crashing waves, lighthouses and towering forests. Nearby cities are: Rockaway Beach, Manzanita, Pacific City, and Cannon Beach"}, {"url": "http://traveloregon.com/cities-regions/oregon-coast/tillamook/", "passage_text": "It’s also the gateway to the Three Cape Scenic Loop. Tillamook is located in Oregon Coast, home to 363 miles of secluded beaches, sand dunes, crashing waves, lighthouses and towering forests. Nearby cities are: Rockaway Beach, Manzanita, Pacific City, and Cannon Beach"}, {"url": "http://www.go-oregon.com/Tillamook-Bay/Attractions/", "passage_text": "Parks and tourist attractions to consider in the Tillamook Bay, Oregon area are listed below. Click on the name of any sightseeing attraction or park for more information. While traveling to Oregon be sure and stop by Corvallis in the very heart of the Willamette Valley, near great outdoor recreation and within 90 miles of Portland and the Oregon Coast."}, {"url": "http://www.tripbuzz.com/things-to-do-with-kids/tillamook-or", "passage_text": "1 The city of Tillamook, located in the self-named Tillamook County, Oregon, is home to a population just under 5,000. 2  The city spans an area just under 2 square miles and maintains a strong Native American history. 1 The city spans an area just under 2 square miles and maintains a strong Native American history. 2  The city is split by the five rivers of Tillamook, Trask, Wilson, Kilchis, and Miami, making for a vast and varied landscape. 3  Buzz Rank."}]