[{"url": "http://www.accountingedu.org/new-hampshire-accountant-salary.html", "passage_text": "According to the US Bureau of Labor Statistics, accountants in New Hampshire earned an average annual salary of $68,250 as of May 2014. Metropolitan areas such as Manchester or Portsmouth reported higher average salaries, $72,770 and $71,560 respectively. Accounting professionals in Portsmouth who were in the top 90th percentile of salary earners made $103,100 on average that year. The New Hampshire Bureau of Economic and Labor Information expects a growth rate of 13.1% in the number of accounting jobs in the state between 2012 and 2022, representing an average of 193 new openings each year."}, {"url": "http://www.topregisterednurse.com/salary/new-hampshire/", "passage_text": "Registered Nurse Salary in New Hampshire. The state of New Hampshire employed 12,180 registered nurses in the year 2013. A survey conducted by the Bureau of Labor Statistics reveals that the average annual and per hour RN salary in New Hampshire was $64,540 and $31.03, respectively, in May 2013. The Employment per thousand jobs was approximately 19.647"}, {"url": "http://www.alliedhealthworld.com/new-hampshire-midwife-salary.html", "passage_text": "Meanwhile, in the cities of Keene and Dover, the average annual salaries for certified nurse-midwives are $72,000 and $68,000 respectively. Certified midwives in New Hampshire make salaries that are comparable to those earned by certified nurse-midwives. In Manchester, the average annual salary for a certified nurse midwife is $78,000. For certified nurse-midwives working in the capital city of Concord, the average annual salary is $75,000."}, {"url": "http://www.alliedhealthworld.com/new-hampshire-midwife-salary.html", "passage_text": "New Hampshire Midwife Salary. Midwives’ salaries in New Hampshire vary based on a number of factors, including geographical location and experience level. The average salary for certified nurse-midwives in New Hampshire is $93,000 a year. In Manchester, the average annual salary for a certified nurse midwife is $78,000. For certified nurse-midwives working in the capital city of Concord, the average annual salary is $75,000."}, {"url": "http://www.bls.gov/oes/current/oes_NH.htm", "passage_text": "(2) Annual wages have been calculated by multiplying the hourly mean wage by a year-round, full-time hours figure of 2,080 hours; for those occupations where there is not an hourly mean wage published, the annual wage has been directly calculated from the reported survey data. (4) Wages for some occupations that do not generally work year-round, full time, are reported either as hourly wages or annual salaries depending on how they are typically paid. (5) This wage is equal to or greater than $90.00 per hour or $187,199 per year."}, {"url": "http://www.accountingedu.org/new-hampshire-accountant-salary.html", "passage_text": "The difference in salaries for accountants in New Hampshire is due mostly to location, experience and CPA licensure. North New Hampshire’s nonmetropolitan earnings report published by the US Department of Labor in 2014 shows an average annual salary of $53,600. The New Hampshire Bureau of Economic and Labor Information expects a growth rate of 13.1% in the number of accounting jobs in the state between 2012 and 2022, representing an average of 193 new openings each year."}, {"url": "http://www.indeed.com/salary/q-Teller-l-New-Hampshire.html", "passage_text": "average teller salaries for job postings in new hampshire are 1 % lower than average teller salaries for job postings nationwide "}, {"url": "http://www.alliedhealthworld.com/new-hampshire-midwife-salary.html", "passage_text": "In fact, certified midwives tend to make slightly more than certified nurse-midwives in certain regions of the state. The average salary for certified midwives in New Hampshire is $95,000 a year. In Manchester, the average annual salary for a certified midwife is $80,000. Certified midwives in Concord make an average annual salary of $76,000. The average annual salaries for certified midwives in Keene and Dover are $73,000 and $69,000 respectively. In Manchester, the average annual salary for a certified nurse midwife is $78,000. For certified nurse-midwives working in the capital city of Concord, the average annual salary is $75,000."}, {"url": "http://www.indeed.com/salary/q-Lna-l-New-Hampshire.html", "passage_text": "$28,000. Average Lna salaries for job postings in New Hampshire are 1% lower than average Lna salaries for job postings nationwide."}]