[{"url": "http://www.grandcaymansunrise.com/location.htm", "passage_text": "The Cayman Islands, a British Overseas Territory in the Caribbean, is part of the Cayman Ridge, which extends westward from Cuba. Situated 150 miles south of Cuba and 180 miles west of Jamaica in the central Caribbean, the largest of the three Cayman Islands is Grand Cayman – 22 miles long by 8 miles wide."}, {"url": "http://www.grandcaymanislands.com/villas_pappagallo/location.aspx", "passage_text": "Villas Pappagallo is a premier resort located in the Grand Cayman Islands West Bay area. Grand Cayman is the largest of the three Cayman Islands. Grand Cayman Island is particularly well known for spectacular diving snorkelling and deep sea fishing. Only a few miles from the condo, Seven Mile Beach is rated as one of the most beautiful beaches in the whole Caribbean. "}, {"url": "http://www.gov.ky/portal/page/portal/cighome/cayman/islands/locationgeography", "passage_text": "Cayman Brac lies about 89 miles northeast of Grand Cayman. It is about 12 miles long with an average width of 1.25 miles and has an area of about 15 square miles. Its terrain is the most spectacular of the three islands. Little Cayman lies five miles west of Cayman Brac and is approximately ten miles long with an average width of just over a mile. It has an area of about 11 square miles. The island is low-lying with a few areas on the north shore rising to 40 ft. above sea level. There are no rivers on any of the islands."}, {"url": "http://travel.usnews.com/Cayman_Islands/", "passage_text": "Grand Cayman. Located on the western end of the archipelago, Grand Cayman is the largest of the three Cayman Islands, and it's known for two activities: banking and scuba diving. Home to the islands' capital city, George Town, Grand Cayman is the commercial and cultural hub"}, {"url": "http://www.gov.ky/portal/page/portal/cighome/cayman/islands/locationgeography", "passage_text": "Grand Cayman, the largest of the three islands, has an area of about 76 square miles and is approximately 22 miles long with an average width of four miles. Its most striking feature is the shallow, reef-protected lagoon, the North Sound, which has an area of about 35 square miles. Little Cayman lies five miles west of Cayman Brac and is approximately ten miles long with an average width of just over a mile. It has an area of about 11 square miles. The island is low-lying with a few areas on the north shore rising to 40 ft. above sea level. There are no rivers on any of the islands."}, {"url": "https://en.wikipedia.org/wiki/Cayman_Islands", "passage_text": "The territory comprises the three islands of Grand Cayman, Cayman Brac and Little Cayman, located south of Cuba and northwest of Jamaica. The Cayman Islands are considered to be part of the geographic Western Caribbean Zone as well as the Greater Antilles. The first recorded permanent inhabitant of the Cayman Islands, Isaac Bodden, was born on Grand Cayman around 1661. He was the grandson of the original settler named Bodden who was probably one of Oliver Cromwell's soldiers at the taking of Jamaica in 1655."}, {"url": "https://en.wikipedia.org/wiki/Grand_Cayman", "passage_text": "Grand Cayman is the largest of the three Cayman Islands and the location of the territory's capital, George Town. In relation to the other two Cayman Islands, it is approximately 75 miles (121 km) southwest of Little Cayman and 90 miles (145 km) southwest of Cayman Brac. 1 East End-The East End district is located at the east side of Grand Cayman Island and consists mostly of the Village of East End, numerous natural attractions, restaurants, and accommodations. 2  Its population is currently listed at 1,371."}, {"url": "http://www.grandcaymansunrise.com/location.htm", "passage_text": "Her sisters, Cayman Brac and Little Cayman, are located northeast of Grand Cayman. Together all three islands are situated on the edge of the Cayman Trench, the deepest part of the Caribbean Sea at a depth of more than four miles. A passport is now required for entry. See more of our Tips and Facts. Situated 150 miles south of Cuba and 180 miles west of Jamaica in the central Caribbean, the largest of the three Cayman Islands is Grand Cayman – 22 miles long by 8 miles wide."}, {"url": "https://en.wikipedia.org/wiki/Cayman_Islands", "passage_text": "One of Grand Cayman 's main attractions is Seven Mile Beach, site of a number of the island's hotels and resorts. Named one of the Ultimate Beaches by Caribbean Travel and Life, Seven Mile Beach is on the western shore of Grand Cayman Island. The first recorded permanent inhabitant of the Cayman Islands, Isaac Bodden, was born on Grand Cayman around 1661. He was the grandson of the original settler named Bodden who was probably one of Oliver Cromwell's soldiers at the taking of Jamaica in 1655."}]