[{"url": "http://www.vanishingtattoo.com/tattoos_designs_symbols_yin_yang.htm", "passage_text": "Yin & Yang Tattoo Designs-the Yin-Yang symbol or Taijitu, with black representing yin and white representing yang. It is a symbol that reflects the inescapably intertwined duality of all things in nature, a common theme in Taoism. "}, {"url": "http://www.interiorshift.com/yin-and-yang/", "passage_text": "Yin and Yang are ancient Chinese philosophical terms, with the Yin Yang Theory being a fundamental part of Feng Shui. It is a Chinese theory on the perspective of continuous change and balance. The theory is that all things in the universe have an opposing force, and though they are opposing, they are very interconnected. These forces are represented in the yin yang symbol with black and white. The black symbolizing the Yin energy, while the white symbolizes the Yang energy. 1  Yin is the passive energy of silence, slow and relaxed movements, and deep darkness, and is the predominant energy of sleep, resting, relaxing and replenishing"}, {"url": "https://answers.yahoo.com/question/index?qid=20081004201253AATc5UX", "passage_text": "Report Abuse. This Simbol(Yin-Yang) represents the ancient Chinese understanding of how things work. The outer circle represents everything, while the black and white shapes within the circle represent the interaction of two energies, called yin (black) and yang (white), which cause everything to happen. The shape of the yin and yang sections of the symbol, actually gives you a sense of the continual movement of these two energies, yin to yang and yang to yin, causing everything to happen: just as things expand and contract, and temperature changes from hot to cold. Source(s): Kitty³ (cubed) · 7 years ago. Thumbs up."}, {"url": "http://taoism.about.com/od/visualsymbols/p/YinYang.htm", "passage_text": "The most well-known of Taoist visual symbols is the Yin-Yang symbol, also known as the Taiji symbol. The image consists of a circle divided into two teardrop-shaped halves-one white and the other black. Heads & Tails-Another Way of Looking at the Yin-Yang Symbol: The black and white halves of the Yin-Yang symbol are similar to the two sides of a coin. They are different, and distinct, yet one could not exist without the other. The circle itself-which contains these two halves-is like the metal (silver, gold or copper) of the coin"}, {"url": "https://en.wikipedia.org/wiki/Yin_and_yang", "passage_text": "Yin and yang. In Chinese philosophy, yin and yang (also, yin-yang or yin yang) describes how apparently opposite or contrary forces are actually complementary, interconnected, and interdependent in the natural world, and how they give rise to each other as they interrelate to one another. Comb., as yin-yang, the combination or fusion of the two cosmic forces; freq. attrib., esp. as yin-yang symbol, a circle divided by an S-shaped line into a dark and a light segment, representing respectively yin and yang, each containing a 'seed' of the other. yang (jaeŋ) Jæŋ Also. yang"}, {"url": "http://taoism.about.com/od/visualsymbols/p/YinYang.htm", "passage_text": "What's great about the Yin-Yang symbol is that the smaller circles nested within each half of the symbol serve as a constant reminder of the interdependent nature of the black/white opposites.. It reminds the Taoist practitioner that all of relative existence is in constant flux and change. Heads & Tails-Another Way of Looking at the Yin-Yang Symbol: The black and white halves of the Yin-Yang symbol are similar to the two sides of a coin. They are different, and distinct, yet one could not exist without the other. The circle itself-which contains these two halves-is like the metal (silver, gold or copper) of the coin"}, {"url": "http://feng-shui.lovetoknow.com/Ying_Yang_Meaning", "passage_text": "The yin yang meaning and symbol date back to ancient China and represent the belief that everything in the universe consists of two forces that are opposing but complementary. The symbol of the yin yang, also known as the Tai Chi or Taiqi symbol, consists of a circle equally divided into black and white sections by a reverse S-like shape. Within the black section is a small circle of white."}, {"url": "http://feng-shui.lovetoknow.com/Ying_Yang_Meaning", "passage_text": "The Yin Yang Symbol. The symbol of the yin yang, also known as the Tai Chi or Taiqi symbol, consists of a circle equally divided into black and white sections by a reverse S-like shape. Within the black section is a small circle of white. Within the white section is a small circle of black"}, {"url": "https://en.wikipedia.org/wiki/Yin_and_yang", "passage_text": "The yin yang (i.e. taijitu symbol) shows a balance between two opposites with a portion of the opposite element in each section. In Daoist metaphysics, distinctions between good and bad, along with other dichotomous moral judgments, are perceptual, not real; so, the duality of yin and yang is an indivisible whole. Comb., as yin-yang, the combination or fusion of the two cosmic forces; freq. attrib., esp. as yin-yang symbol, a circle divided by an S-shaped line into a dark and a light segment, representing respectively yin and yang, each containing a 'seed' of the other. yang (jaeŋ) Jæŋ Also. yang"}]