[{"url": "http://www.universetoday.com/14306/temperature-of-venus/", "passage_text": "In addition, the surface temperature on Venus does not vary like it does here on Earth. On our planet, temperatures vary wildly due to the time of year and even more so based on the location on our planet. The hottest temperature ever recorded on Earth was 70.7°C in the Lut Desert of Iran in 2005."}, {"url": "http://www.answers.com/Q/What_is_the_lowest_temperature_on_Venus%27s", "passage_text": "The coldest temperatures in Venus's atmosphere are above the cloud layer. Once you reach the surface, the planetary temperature is practically uniform in temperature, because … the thick atmosphere carries the heat to the poles and the night side."}, {"url": "http://astronomy.org/programs/planet-quiz-show/answers/8.html", "passage_text": "Venus has the hottest surface temperature (+864° F). Its very thick carbon dioxide atmosphere and sulfuric acid clouds act as a heat trap. This is called the greenhouse effect. Neptune, because of its distance from the sun, would possess the coldest atmospheric temperatures (-364° F)."}, {"url": "http://www.space.com/18526-venus-temperature.html", "passage_text": "The average temperature on Venus is 864 degrees Fahrenheit (462 degrees Celsius). Temperature changes slightly traveling through the atmosphere, growing cooler farther away from the surface. Lead would melt on the surface of the planet, where the temperature is around 872 F (467 C)."}, {"url": "http://gizmodo.com/5948506/weirdly-venus-is-both-hotter-and-colder-than-earth", "passage_text": "As it turns out, sweltering Venus-average temperature a balmy 464 °C-hides a cold layer in its atmosphere. At 125 kilometres above the planet's surface, the weather is -175 °C with a good chance of carbon dioxide ice."}, {"url": "http://www.answers.com/Q/What_is_the_lowest_temperature_on_Venus%27s", "passage_text": "Confidence votes 30.1K. Because of Venus's thick atmosphere the temperature doesn't really change much and because of this the temperature stays around 461oC. im doing i report on it and its day is 250 earth days so the nights are very long (120 days) and it can get as low as like -150 *C and as hot as 700 *C."}, {"url": "http://www.universetoday.com/14306/temperature-of-venus/", "passage_text": "However, for all the characteristics these two planets have in common, average temperature is not one of them. Whereas the Earth has an average surface temperature of 14 degrees Celsius, the average temperature of Venus is 460 degrees Celsius. That is roughly 410 degrees hotter than the hottest deserts on our planet."}]