[{"url": "https://en.wikipedia.org/wiki/Terminal_ileum", "passage_text": "The ileum is the short terminal part of the small intestine and forms the connection to the large intestine. It is suspended by the caudal part of the mesentery (mesoileum) and is attached, in addition, to the cecum by the ileocecal fold. The ileum follows the duodenum and jejunum and is separated from the cecum by the ileocecal valve (ICV). In humans, the ileum is about 2–4 m long, and the pH is usually between 7 and 8 (neutral or slightly alkaline)."}, {"url": "http://www.annalsgastro.gr/index.php/annalsgastro/article/view/1004/742", "passage_text": "Chronic inflammation in the terminal ileum (TI) suggests a cause for the patients symptoms, especially when the clinical suspicion is Crohns disease (CD). Clinic, laboratory, endoscopic, histopathological evaluation of patients is required for the diagnosis of CD. "}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2914216/", "passage_text": "Abstract. Ileitis, or inflammation of the ileum, is often caused by Crohn’s disease. However, ileitis may be caused by a wide variety of other diseases. These include infectious diseases, spondyloarthropathies, vasculitides, ischemia, neoplasms, medication-induced, eosinophilic enteritis, and others. Backwash ileitis (BWI) refers to inflammation in the distal few centimeters of terminal ileum in patients with ulcerative colitis [ 49 ]. Ileitis is caused by reflux of colonic contents, and when present, may raise the differential diagnosis of CD."}, {"url": "http://www.innerbody.com/image_dige03/dige10.html", "passage_text": "Anatomy. The terminal ileum is located on the right side of the abdominopelvic cavity in the umbilical and hypogastric regions. It is a tube about 1.25 to 1.5 inches (3 to 4 cm) long at the end of the ileum and terminates at the ileocecal sphincter.... Click to read more below. The terminal ileum is the distal end of the small intestine that intersects with the large intestine. It contains the ileocecal sphincter, a smooth muscle sphincter that controls the flow of chyme into the large intestine. "}, {"url": "http://library.med.utah.edu/WebPath/GIHTML/GI059.html", "passage_text": "This portion of terminal ileum demonstrates the gross findings with Crohn's disease. Though any portion of the gastrointestinal tract may be involved with Crohn's disease, the small intestine--and the terminal ileum in particular--is most likely to be involved. The middle portion of bowel seen here has a thickened wall and the mucosa has lost the regular folds."}, {"url": "http://www.healthline.com/health/crohns-disease/types", "passage_text": "The most common site for Crohn’s disease to occur is in the terminal ileum (distal small intestine),” explains Charles T. Richardson, M.D., a gastroenterologist with Baylor University Medical Center in Dallas, Texas. Crohn's is not limited to these areas, however. The area most frequently affected by Crohn's disease is the ileum, or the lower portion of the small intestine. The subtype of Crohn's that affects this area is called Ileocolitis. It can also affect the colon. Another type that affects the ileum is called Ileitis."}, {"url": "http://www.birminghambowelclinic.co.uk/treatments-ileocolic-resection/", "passage_text": "Ileocolic Resection. This is an operation to remove the terminal ileum, the last part of the small intestine and first part of the colon. It is usually performed for conditions such as Crohn’s disease which affects the terminal ileum and first part of the colon. In most cases the operation can be performed via a laparoscopic (keyhole) surgical technique."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=5741", "passage_text": "Terminal ileitis: Crohn's disease, a chronic inflammatory disease of the intestine involving only the end of the small intestine (the terminal ileum). Crohn's disease affects primarily the small and large intestines but which can occur anywhere in the digestive system between the mouth and the anus. "}, {"url": "https://en.wikipedia.org/wiki/Terminal_ileum", "passage_text": "The ileum /ˈɪliəm/ is the final section of the small intestine in most higher vertebrates, including mammals, reptiles, and birds. In fish, the divisions of the small intestine are not as clear and the terms posterior intestine or distal intestine may be used instead of ileum. The ileum follows the duodenum and jejunum and is separated from the cecum by the ileocecal valve (ICV). In humans, the ileum is about 2–4 m long, and the pH is usually between 7 and 8 (neutral or slightly alkaline)."}]