[{"url": "https://history.state.gov/milestones/1830-1860/indian-treaties", "passage_text": "Milestones: 1830–1860. The U.S. Government used treaties as one means to displace Indians from their tribal lands, a mechanism that was strengthened with the Removal Act of 1830. To achieve his purpose, Jackson encouraged Congress to adopt the Removal Act of 1830. The Act established a process whereby the President could grant land west of the Mississippi River to Indian tribes that agreed to give up their homelands."}, {"url": "http://www.answers.com/Q/How_did_the_issue_of_the_removal_power_result_in_the_impeachment_of_president_Andrew_Johnson", "passage_text": "The impeachment of President Andrew Johnson was the result of  political conflict and the rupture of ideologies in the aftermath  of the American Civil War. It arose from un … compromised beliefs and  a contest for power in a nation struggling with reunification. The House of Representatives impeached President Andrew Johnson on February 24, 1868 on eleven articles impeachment, the most important of which was several counts of violatin … g the Tenure of Office Act. Chief Justice Salmon P. Chase presided over the Senate trial that began on March 5, 1868."}, {"url": "https://history.state.gov/milestones/1830-1860/indian-treaties", "passage_text": "Indian Treaties and the Removal Act of 1830. The U.S. Government used treaties as one means to displace Indians from their tribal lands, a mechanism that was strengthened with the Removal Act of 1830. To achieve his purpose, Jackson encouraged Congress to adopt the Removal Act of 1830. The Act established a process whereby the President could grant land west of the Mississippi River to Indian tribes that agreed to give up their homelands."}, {"url": "http://www.answers.com/Q/How_did_the_issue_of_the_removal_power_result_in_the_impeachment_of_president_Andrew_Jonhson", "passage_text": "Impeachment is the equivalent of an indictment … and can be voted only by the US House of Representatives. If the House votes to impeach a president, then a trial is held in the Senate and 2/3 majority is required to conviction and and removal from office. Under Article II of Section 4 in the U.S. Constitution ...shall be removed from Office on Impeachment for, and Conviction of, Treason, Bribery, or other high Crimes and Misde … meanors.. The exact definition of what constitutes an impeachable offense is up to Congress to decide. The House decides what the charges are."}, {"url": "http://www.answers.com/Q/How_did_the_issue_of_the_removal_power_result_in_the_impeachment_of_president_Andrew_Jonhson", "passage_text": "The United States Constitution outlines who has the power to impeach the Vice President. … Article I, Section 2, of the United States Constitution states, The House of Representatives shall choose their Speaker and other Officers; and shall have the sole Power of Impeachment.. Article I, Section 3, of the United States Constitution states, The Senate shall have the sole Power to try all Impeachments. Under Article II of Section 4 in the U.S. Constitution ...shall be removed from Office on Impeachment for, and Conviction of, Treason, Bribery, or other high Crimes and Misde … meanors.. The exact definition of what constitutes an impeachable offense is up to Congress to decide. The House decides what the charges are."}, {"url": "http://www.answers.com/Q/How_did_the_issue_of_the_removal_power_result_in_the_impeachment_of_president_Andrew_Johnson", "passage_text": "Answer Yes, Andrew Johnson (NOT Lyndon Johnson) was the first of two US Presidents to be impeached in 1868 by the House of Representatives. He was acquitted by a single vote … in his Senate trial. Answer Yes, he was. But he was not taken out of office. The House of Representatives impeached President Andrew Johnson on February 24, 1868 on eleven articles impeachment, the most important of which was several counts of violatin … g the Tenure of Office Act. Chief Justice Salmon P. Chase presided over the Senate trial that began on March 5, 1868."}, {"url": "https://en.wikipedia.org/wiki/Executive_Order_9066", "passage_text": "Executive Order 9066 was a United States presidential executive order signed and issued during World War II by the United States President Franklin D. Roosevelt on February 19, 1942, authorizing the Secretary of War to prescribe certain areas as military zones. "}, {"url": "http://www.answers.com/Q/How_did_the_issue_of_the_removal_power_result_in_the_impeachment_of_president_Andrew_Johnson", "passage_text": "Andrew Johnson was impeached by the House of Representatives on February 24, 1868, but was acquitted by a single vote in the Senate. So yes, he was impeached (charged with wrongdoing), but only by the House of Representatives, not by the entire Congress. The House of Representatives impeached President Andrew Johnson on February 24, 1868 on eleven articles impeachment, the most important of which was several counts of violatin … g the Tenure of Office Act. Chief Justice Salmon P. Chase presided over the Senate trial that began on March 5, 1868."}, {"url": "http://www.answers.com/Q/How_did_the_issue_of_the_removal_power_result_in_the_impeachment_of_president_Andrew_Jonhson", "passage_text": "The House of Representatives has the sole power to bring Articles of Impeachment against a government official, including the President, then votes to determine whether the of … ficial should be tried for wrongdoing. If the House votes to impeach, the Senate holds a trial, then votes to determine the outcome. Under Article II of Section 4 in the U.S. Constitution ...shall be removed from Office on Impeachment for, and Conviction of, Treason, Bribery, or other high Crimes and Misde … meanors.. The exact definition of what constitutes an impeachable offense is up to Congress to decide. The House decides what the charges are."}]