[{"url": "http://www.7continentslist.com/asia/", "passage_text": "Largest Countries In Asia. The world’s largest continent – Asia – is spread over an area of 44,579,000 square kilometers which is divided into forty-eight sovereign states and seven others that are disputed. Each country varies in size and population. "}, {"url": "http://www.worldatlas.com/webimage/countrys/as.htm", "passage_text": "Asia Description. As the largest and most populous continent in the world with just over 3.8 billion people, Asia is composed of a wide variety of ethnic groups, cultures, environments, economics, historical ties, and governmental systems. Middle East: Countries considered part of the Middle East (or West Asia) are shown in a lighter shade of gray. Note that they are all still a part of the continent of Asia. Opinions vary as to what countries make up the modern definition of Asia and the Middle East."}, {"url": "http://www.ducksters.com/geography/asia.php", "passage_text": "The continent of Asia is the world's largest and most populous continent with over 4 billion people calling Asia home. Asia also contains the world's most populous country, China, and the world's largest country, Russia. Asia borders Africa and Europe to the west and the Pacific Ocean to the east. Asia is the only continent that shares borders with two other continents; Africa and Europe. It sometimes joins with a third continent, North America, in the winter by ice forming in the Bering Sea. Asia is home to two of the three largest economies in the world: China (2nd largest) and Japan (3rd largest)."}, {"url": "http://www.nationsonline.org/oneworld/asia.htm", "passage_text": "World Population. List of population figures of the most populated countries, and the most densely populated countries in the world. Other Continents: Africa The Americas Europe Oceania. Royal Palace, Phnom Penh, Cambodia. Hong Kong at night. Home Earth Continents Asia. Asia is the largest continent in the world in both, area and population, constituting nearly one-third of the landmass, lying entirely north of the equator except for some Southeast Asian islands."}, {"url": "http://www.answers.com/Q/Which_continent_is_China_located_on", "passage_text": "On what continent is China located and what are the names of the three countries on this continent?   China is located in Asia, but there are way, way, way more than three countries in Asia. China is in eastern Asia. (part of Eurasia) Russia is in both Europe and Asia. Canada and the US (except Hawaii) are in North America. 2 people found this useful."}, {"url": "http://www.chinatouristmaps.com/china-maps/china-in-world.html", "passage_text": "Location of China on the World Map. China is located in the east of the Asian continent, on the western shore of the Pacific Ocean, bordering the East China Sea, Korea Bay, Yellow Sea, and South China Sea. It covers an area of about 9.6 million square kilometers. "}, {"url": "https://en.wikipedia.org/wiki/South_China_(continent)", "passage_text": "South China continent, also known as South China Craton, South Chinese Craton, or Yangtze Craton, was an ancient continent (craton) that contained today's South and Southeast China (named after), Indochina, and parts of Southeast Asia (i.e. Borneo and adjacent islands). "}, {"url": "http://www.nationsencyclopedia.com/economies/Asia-and-the-Pacific/China.html", "passage_text": "LOCATION AND SIZE. China is situated in the eastern part of Asia, on the west coast of the Pacific Ocean, in the southeastern part of the Eurasian continent, bordering the East China Sea, Korea Bay, Yellow Sea, and South China Sea, between North Korea and Vietnam. "}]