[{"url": "https://en.wikipedia.org/wiki/Foodborne_illness", "passage_text": "Foodborne illness (also foodborne disease and colloquially referred to as food poisoning) is any illness resulting from the food spoilage of contaminated food, pathogenic bacteria, viruses, or parasites that contaminate food, as well as chemical or natural toxins such as poisonous mushrooms. Bacteria are a common cause of foodborne illness. In the United Kingdom during 2000, the individual bacteria involved were the following: Campylobacter jejuni 77.3%, Salmonella 20.9%, Escherichia coli O157:H7 1.4%, and all others less than 0.56%."}, {"url": "http://www.health.state.mn.us/divs/idepc/dtopics/foodborne/basics.html", "passage_text": "Causes and Symptoms of Foodborne Illness. Foodborne illness is caused by consuming contaminated foods or beverages. Many different disease-causing microbes or pathogens can contaminate foods, so there are many different types of foodborne illnesses. Most foodborne diseases are infections caused by a variety of bacteria, viruses, and parasites. Other diseases are poisonings caused by harmful toxins or chemicals that have contaminated food. 1 Other symptoms might include abdominal cramps, nausea, fever, joint/back aches, and fatigue. 2  What some people call the “stomach flu” may actually be a foodborne illness caused by a pathogen (i.e., virus, bacteria, or parasite) in contaminated food or drink."}, {"url": "http://www.medicinenet.com/food_poisoning/related-conditions/index.htm", "passage_text": "Medical conditions are often related to other diseases and conditions. Our doctors have compiled a list of ailments related to the topic of Food Poisoning. These conditions may be a cause or symptom of Food Poisoning or be a condition for which you may be at increased risk. Staph Infection (Staphylococcus Aureus) Staphylococcus or Staph is a group of bacteria that can cause a multitude of diseases. Staph infections can cause illness...learn more »."}, {"url": "http://www.cdc.gov/foodsafety/foodborne-germs.html", "passage_text": "1 Most of these diseases are infections, caused by a variety of bacteria, viruses, and parasites that can be foodborne. 2  Other diseases are poisonings, caused by harmful toxins or chemicals that have contaminated the food, for example, poisonous mushrooms. In addition, poisonous chemicals, or other harmful substances can cause foodborne diseases if they are present in food. 1  More than 250 different foodborne diseases have been described. 2 "}, {"url": "http://www.webmd.com/a-to-z-guides/features/food-related-illness", "passage_text": "1 Salmonella species. 2  This is the bacterium that can cause illness when you eat raw or undercooked eggs (even in chocolate chip cookie dough!). 3  Salmonella species are the No. 1 cause of food-related illness in the United States. 4  They are responsible for more deaths than any other food-borne pathogen. 1 Salmonella species are the No. 1 cause of food-related illness in the United States. 2  They are responsible for more deaths than any other food-borne pathogen. 3  Salmonella infection can lead to fever, abdominal cramps, and diarrhea within 12 hours to three days after eating the contaminated food."}, {"url": "https://en.wikipedia.org/wiki/Foodborne_illness", "passage_text": "Foodborne disease can also be caused by a large variety of toxins that affect the environment. Foodborne illness can also be caused by pesticides or medicines in food and naturally toxic substances such as poisonous mushrooms or reef fish. Bacteria are a common cause of foodborne illness. In the United Kingdom during 2000, the individual bacteria involved were the following: Campylobacter jejuni 77.3%, Salmonella 20.9%, Escherichia coli O157:H7 1.4%, and all others less than 0.56%."}, {"url": "http://www.webmd.com/a-to-z-guides/features/food-related-illness", "passage_text": "Three common types of food-related bacteria are: 1  Salmonella species. 2  This is the bacterium that can cause illness when you eat raw or undercooked eggs (even in chocolate chip cookie dough!). 3  Salmonella species are the No. 1 cause of food-related illness in the United States. 1 Salmonella species are the No. 1 cause of food-related illness in the United States. 2  They are responsible for more deaths than any other food-borne pathogen. 3  Salmonella infection can lead to fever, abdominal cramps, and diarrhea within 12 hours to three days after eating the contaminated food."}, {"url": "http://www.infoplease.com/ipa/A0762206.html", "passage_text": "Food-borne illness often shows itself as flu-like symptoms such as nausea, vomiting, diarrhea, or fever, so many people may not recognize the illness is caused by bacteria or other pathogens on food. Thousands of types of bacteria are naturally present in our environment. Not all bacteria cause disease in humans. Bacteria that cause disease are called “pathogens.” When certain pathogens enter the food supply, they can cause food-borne illness. Only a few types cause millions of cases of food-borne illness each year. Ironically, most cases of food-borne illness can be prevented"}]