[{"url": "http://www.answers.com/Q/What_are_some_modern_factions_examples", "passage_text": "Madison defines factions as a number of citizens (representing either the minority or majority of the whole) who are united by common passions and interests. Examples of facti … ons today are political parties and unions. Factions are divisions within a society with varying interests, that may be against the Common good of a society, or against the rights of other citizens. Examples may include Work unions, Large company lobbyists, AARP, or any extreme religious group."}, {"url": "https://answers.yahoo.com/question/index?qid=20090921104048AAOb0mq", "passage_text": "RE: Political Science: I need a few examples of Factions? Can anyone give me a handful of examples of what is considered a faction today? The few that I know is AARP for the elderly, and some religious brances can be factions. Factions are interest groups that try to influence political decisions, but what they influence isn&#39;t for the common good,... Source(s): political science examples factions: https://tr.im/jLlhK."}, {"url": "http://www.answers.com/Q/How_does_Madison_define_faction_What_are_some_examples_of_factions_today", "passage_text": "Split and merge into it. Answered by The Community. Making the world better, one answer at a time. Madison defines factions as a number of citizens (representing either the minority or majority of the whole) who are united by common passions and interests. Examples of factions today are political parties and unions. To break into factions is to divide, in this case, based on a system of beliefs that differs from the beliefs of others (who would be within their own faction based on their beliefs) A faction can be defined as a small group of opponents within a much larger group or a subset of a larger set. 1 person found this useful."}, {"url": "https://polsci101.wordpress.com/2009/11/19/factions-today/", "passage_text": "Factions Today. After reading and discussing the Federalist Papers, I couldn’t help but consider more about the concept of factions. In Federalist #10, Madison argues that a strong, well-constructed union will be able to control the violence of factions. A final argument made was that the influence of factions might incite awareness within its own state, but will not cross the borders of that state. Looking at two specific examples, I want to argue that Madison’s arguments no longer apply to factions today. One example I want to look at is the Abolition Movement"}, {"url": "https://en.wikipedia.org/wiki/Political_faction", "passage_text": "Occasionally, the term faction is still used more or less as a synonym for political party, but with opprobrious sense, conveying the imputation of selfish or mischievous ends or turbulent or unscrupulous methods, according to the Oxford English Dictionary. Members of factions band together as a way of achieving these goals and advancing their agenda and position within an organization. Factions are not limited to political parties; they can and frequently do form within any group that has some sort of political aim or purpose."}, {"url": "https://answers.yahoo.com/question/index?qid=20090921084043AAdL2Te", "passage_text": "This Site Might Help You. RE: what are examples of current factions in today&#39;s society? faction = group of people who feel strongly about one idea and bring a a negative impact on minorities/ the country as a whole (somewhat like a special interest group). Add your answer."}, {"url": "https://en.wikipedia.org/wiki/Political_faction", "passage_text": "A political faction is a group of individuals, such as a political party, a trade union, or other group with a common political purpose. A faction or political party may include fragmented sub-factions, “parties within a party, which may be referred to as power blocs, or voting blocs. Members of factions band together as a way of achieving these goals and advancing their agenda and position within an organization. Factions are not limited to political parties; they can and frequently do form within any group that has some sort of political aim or purpose."}, {"url": "https://polsci101.wordpress.com/2009/11/19/factions-today/", "passage_text": "A critical point to remember is that factions today are not what they were in 1787 when Hamilton wrote Federalist #10. Not all factions are seen as violent today; some of them include MADD, Christian Coalition, and the NAACP. A final argument made was that the influence of factions might incite awareness within its own state, but will not cross the borders of that state. Looking at two specific examples, I want to argue that Madison’s arguments no longer apply to factions today. One example I want to look at is the Abolition Movement"}, {"url": "https://polsci101.wordpress.com/2009/11/19/factions-today/", "passage_text": "A few examples of some larger factions today are the NRA, Sierra Club, AARP, NAACP, religious groups, unions, etc., and most of these all endorse a political party, which further shows how political factions are becoming less prevalent and more involved with political parties. A final argument made was that the influence of factions might incite awareness within its own state, but will not cross the borders of that state. Looking at two specific examples, I want to argue that Madison’s arguments no longer apply to factions today. One example I want to look at is the Abolition Movement"}]