[{"url": "http://christianity.about.com/od/newtestamentbooks/qt/gospeljohnintro.htm", "passage_text": "Gospel of John: The Gospel of John was written to prove that Jesus Christ is the Son of God. As an eyewitness to the love and power displayed in the miracles of Jesus, John gives us an up-close and personal look at Christ's identity."}, {"url": "http://www.theology.edu/biblesurvey/john.htm", "passage_text": "The Book of John I. Title The title of the book is taken from the name of the traditional author, the apostle John. II. Author and Setting A. Author and Date The most important witness in the early Church to the authorship of the gospel is Irenaeus, bishop of Lyons in the last quarter of the second century."}, {"url": "http://www.allaboutjesuschrist.org/book-of-john.htm", "passage_text": "The Book of John stands apart from the other three Gospels. Written nearly 30 years after Matthew, Mark and Luke, the purpose of John is dramatically evangelistic."}, {"url": "http://www.allaboutjesuschrist.org/book-of-john.htm", "passage_text": "The Book of John is addressed to all the people of the world and reveals the glorious truth of Jesus Christ. We'll let the scripture speak for itself. In the beginning was the Word, and the Word was with God, and the Word was God (John 1:1). The Word became flesh and made his dwelling among us."}, {"url": "http://www.johnbook.jesusanswers.com/", "passage_text": "History of the Book of John The Book of John is the fourth book of the Gospels and is distinctly different from the other three gospels. The content and style serves well as a supplement to the three synoptic gospels. (Matthew, Mark and, Luke)."}, {"url": "http://christianity.about.com/od/newtestamentbooks/qt/gospeljohnintro.htm", "passage_text": "The predominant theme in the book of John is the revelation of God to man through his living illustration—Jesus Christ, the Word made flesh. The opening verses beautifully describe Jesus as the Word. He is God revealed to man—the expression of God—so that we might see him and believe."}]