[{"url": "http://medical-dictionary.thefreedictionary.com/mons", "passage_text": "[mons]. Etymology: L, mountain. a mound or slight elevation. The fibroadipose tissue anterior to the vulva which overlies the symphysis pubis. It divides into the labia majora on either side of the pudendal cleft, which surrounds the labia minora, clitoris, vaginal opening, and other vulvar vestibular structures. The mons responds to oestrogen with the onset of puberty, forming a distinct mound at the time of puberty."}, {"url": "http://www.audioenglish.org/dictionary/mons.htm", "passage_text": "Synonyms: mons; mons pubis; mons veneris. Hypernyms (mons is a kind of...): adipose tissue; fat; fatty tissue (a kind of body tissue containing stored fat that serves as a source of energy; it also cushions and insulates vital organs). Holonyms (mons is a part of...): vulva (external parts of the female genitalia)."}, {"url": "http://www.innovateus.net/health/what-function-mons-pubis", "passage_text": "The mons pubis is also termed as mons, mons veneris, or pubic mound. It is the fat pad covering on the pubic bone which segments to create labia majora. The mons pubis segments into labia majora also known as larger lips on both the sides of furrow and is termed as cleft of venus which also encircles labia minor, vaginal opening and clitoris along with other parts of the vulval vestibule."}, {"url": "https://en.wikipedia.org/wiki/Mons_pubis", "passage_text": "The size of the mons pubis varies with the level of hormone and body fat, and it is more apparent in females. After puberty, it generally becomes covered with pubic hair and enlarged. The fatty tissue of the mons pubis is sensitive to estrogen, causing a distinct mound to form with the onset of puberty. Likewise, the mons pubis often becomes less prominent with the decrease in bodily estrogen experienced during menopause. The term mons pubis is derived from Latin for pubic mound, and mons Venus or mons veneris is derived from Latin for mound of Venus ."}, {"url": "http://www.definitions.net/definition/mons", "passage_text": "The pubic mound, or mons pubis.In human anatomy or in mammals in general, the mons pubis (Latin for pubic mound), also known as the mons veneris (Latin, mound of Venus) or simply the mons, is the adipose tissue lying above the pubic bone of adult females, anterior to the pubic symphysis. The Mons municipality includes the old communes of Cuesmes, Flenu, Flénu, Ghlin, Hyon, Nimy, Obourg, Baudour, Jemappes, Ciply, Harmignies, Harveng, Havre, Havré, Maisieres, Maisières-Mesvin, Nouvelles-Saint, Denis, Saint-Symphorien-Spiennes, Villers, Saint-Ghislain-Casteau, masnuy Saint-jean-And. ville sur haine"}, {"url": "http://www.audioenglish.org/dictionary/mons_veneris.htm", "passage_text": "Hypernyms (mons veneris is a kind of...): adipose tissue; fat; fatty tissue (a kind of body tissue containing stored fat that serves as a source of energy; it also cushions and insulates vital organs). Holonyms (mons veneris is a part of...): vulva (external parts of the female genitalia). "}, {"url": "http://www.thefreedictionary.com/mons+veneris", "passage_text": "1. mons veneris-a mound of fatty tissue covering the pubic area in women. mons, mons pubis. adipose tissue, fatty tissue, fat-a kind of body tissue containing stored fat that serves as a source of energy; it also cushions and insulates vital organs; fatty tissue protected them from the severe cold. mons ve·ne·ris. n. pl. montes veneris. The female mons pubis. [New Latin."}, {"url": "https://en.wikipedia.org/wiki/Mons_pubis", "passage_text": "In human anatomy, and in mammals in general, the mons pubis (also known simply as the mons, and known specifically in females as the mons Venus or mons veneris), is a rounded mass of fatty tissue found over the pubic symphysis of the pubic bones. In human females, the mons pubis forms the anterior portion of the vulva. Likewise, the mons pubis often becomes less prominent with the decrease in bodily estrogen experienced during menopause. The term mons pubis is derived from Latin for pubic mound, and mons Venus or mons veneris is derived from Latin for mound of Venus ."}, {"url": "http://www.thefreedictionary.com/mons", "passage_text": "1. mons-a mound of fatty tissue covering the pubic area in women. mons pubis, mons veneris. adipose tissue, fatty tissue, fat-a kind of body tissue containing stored fat that serves as a source of energy; it also cushions and insulates vital organs; fatty tissue protected them from the severe cold. Van Mons, in his treatise on pears and apples, shows how utterly he disbelieves that the several sorts, for instance a Ribston-pippin or Codlin-apple, could ever have proceeded from the seeds of the same tree."}]