[{"url": "http://www.microbiologyinfo.com/blood-agar-composition-preparation-uses-and-pictures/", "passage_text": "1 Dispense into sterile plates while liquid. 2  Blood Agar is a general purpose enriched medium often used to grow fastidious organisms. 3  To differentiate bacteria based on their hemolytic properties (β-hemolysis, α-hemolysis and γ-hemolysis (or non-hemolytic))."}, {"url": "http://www.scienceprofonline.com/microbiology/blood-agar-bacterial-growth-medium-BAP.html", "passage_text": "Media are used to grow bacterial colonies (millions of bacteria having arisen through the binary fission of a single progenitor). Article Summary: Blood Agar is a bacterial growth medium that can distinguish normal from pathogenic bacteria based on the effect of bacterial hemolytic exotoxins on red blood cells."}, {"url": "http://spot.pcc.edu/~jvolpe/b/bi234/lab/differentialMedia/bloodAgarPlates.htm", "passage_text": "Blood Agar Plates (BAP) (Atlas p. 49). Blood agar is actually a couple of related media, all of which are rich formulations containing peptones, yeast extracts, liver or heart extracts (depending on the medium), and blood. The blood is usually sheep's red blood cells (RBC), though horses and other species may be used."}, {"url": "http://spot.pcc.edu/~jvolpe/b/bi234/lab/differentialMedia/bloodAgarPlates.htm", "passage_text": "Blood agar plates are routinely used in the clinic to test for pathenogenic bacteria in throat swabs. These throat pathogens are often Gram positive cocci that may be hemolytic, producing exotoxins called hemolysins that destroy blood cells."}, {"url": "http://microbeonline.com/blood-agar-composition-preparation-uses-and-types-of-hemolysis/", "passage_text": "Blood agar is an enriched, bacterial growth medium. Fastidious organisms, such as streptococci, do not grow well on ordinary growth media. Blood agar is a type of growth medium (trypticase soya agar enriched with 5% Sheep blood) that encourages the growth of bacteria, such as streptococci, that otherwise wouldn’t..."}, {"url": "http://faculty.ccbcmd.edu/courses/bio141/labmanua/lab14/lab14.html", "passage_text": "The streptococci are usually isolated on Blood agar. Blood agar is one of the most commonly used media in a clinical lab. It consists of an enriched agar base (Tryptic Soy agar) to which 5% sheep red blood cells have been added. Blood agar is commonly used to isolate not only streptococci, but also staphylococci and many other pathogens."}, {"url": "http://vlab.amrita.edu/?sub=3&brch=73&sim=720&cnt=1", "passage_text": "Much of the study of microorganisms depends on its ability to grow in the laboratory, and this is possible only if suitable culture media are available for the growth of microorganism. A culture medium is defined as a solid or liquid preparation used for the growth, transport, and storage of microorganisms."}]