[{"url": "http://www.innerbody.com/image_musc01/musc71.html", "passage_text": "Cardiac muscle tissue is an extremely specialized form of muscle tissue that has evolved to pump blood throughout the body. In fact, cardiac muscle is only found in the heart and makes up the bulk of the heart’s mass."}, {"url": "http://www.wisegeek.org/what-is-the-cardiac-muscle.htm", "passage_text": "The cardiac muscle is the heart, responsible for pumping blood throughout the body. It is made up of cardiac muscle and is the only place in the body where such muscle is found. All the other muscles in the body are composed of either skeletal muscle or smooth muscle. The most muscular part of the heart is its middle layer, called the myocardium, which is mainly responsible for its contractions."}, {"url": "https://en.wikipedia.org/wiki/Cardiac_muscle", "passage_text": "Cardiac muscle (heart muscle) is involuntary striated muscle that is found in the walls and histological foundation of the heart, specifically the myocardium. Cardiac muscle is one of three major types of muscle, the others being skeletal and smooth muscle."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=2629", "passage_text": "Cardiac muscle: A type of muscle tissue that is found only in the heart and is distinguishable from the two other forms of muscle, smooth muscle (that moves internal organs, such as the bowels, and vessels, such as the artery walls) and skeletal muscle (that powers joints)."}, {"url": "http://www.wisegeekhealth.com/what-is-cardiac-muscle-tissue.htm", "passage_text": "Cardiac muscle tissue is a highly specialized type of muscle found only in the walls of the heart. This muscle type has a number of unique properties that allow it to regularly contract in order to force the heart to beat."}, {"url": "http://www.teachpe.com/anatomy/types_of_muscle.php", "passage_text": "Cardiac muscle (heart muscle). This type of muscle is found solely in the walls of the heart. It has similarities with skeletal muscles in that it is striated and with smooth muscles in that its contractions are not under conscious control. However this type of muscle is highly specialised."}, {"url": "http://www.newworldencyclopedia.org/entry/Cardiac_muscle", "passage_text": "Cardiac muscle. Cardiac muscle is a type of involuntary striated muscle found only in the walls of the heart. This is a specialized muscle that, while similar in some fundamental ways to smooth muscle and skeletal muscle, has a unique structure and with an ability not possessed by muscle tissue elsewhere in the body."}]