[{"url": "http://www.familyhistorymonthly.com/surnames/surname-detail/28", "passage_text": "The name’s meaning in French – ‘de Burgo’ or ‘de Burgh’, signifying “of the borough” – and in the Middle English translation – ‘burk’, meaning ‘fort’ – are locational/geographic in origin. The surname Burke has also inspired a sinister verb: ‘burking’. It comes from the Irish criminal William Burke (1792–1829) who migrated to Scotland and committed a gruesome series of murders in Edinburgh."}, {"url": "http://surnames.behindthename.com/name/burke", "passage_text": "Derived from Middle English burk meaning fort or fortified town. It was brought to Ireland in the 12th century by the Norman invader William FitzAdelm de Burgo. "}, {"url": "http://www.surnamedb.com/Surname/Burke", "passage_text": "Amongst the many interesting name holders was Edmund Burke (1729 - 1797), the leading English statesmen of his day, whilst one of the first recorded passengers to the new American colonies was Jeffery Burke, who sailed on the sloop 'True Friendship from Antigua to Virginia in 1679. This ancient and aristocratic English and Norman-Irish surname was first held by Burhred, the king of West Mercia, England, 852 - 874, and several centuries later by the original earls of Ulster and Clanricarde in Ireland."}, {"url": "http://www.surnamedb.com/Surname/Burke", "passage_text": "The name was introduced into Ireland by William de Burgo, of Burgh in Suffolk, who accompanied Strongbow, the earl of Pembroke, in the Anglo-Norman Invasion of 1169 and 1170. William de Burgo later succeeded him as Chief Governor of Ireland under King Henry 11 (1154 - 1189), and was rewarded with great estates. This ancient and aristocratic English and Norman-Irish surname was first held by Burhred, the king of West Mercia, England, 852 - 874, and several centuries later by the original earls of Ulster and Clanricarde in Ireland."}, {"url": "http://www.thinkbabynames.com/meaning/1/Burke", "passage_text": "Burke /bur-ke/ [2 sylls.] as a boys' name is pronounced berk. It is of Old French origin, and the meaning of Burke is from the fortified settlement. See also Berkeley. Kreatif forms: Bubke, Bucke, Burbe. Burke is a rare given name for males but a very popular surname for both adults and children (#229 out of 150436, Top 1%). (2000 U.S. Census). Shown below is the birth name popularity of Burke for boys. Burke has yet to make it into the list thus far. (Top 1000 Baby Names Records, 2014)"}, {"url": "https://en.wikipedia.org/wiki/House_of_Burke", "passage_text": "The Burke surname is one of the most common in Ireland and England, particularly in north Munster and Connacht. The name derives from burg or burgh, meaning a town, and is of Norman origin. From Wikipedia, the free encyclopedia. The House of Burke (Irish: de Burca; Búrca latinised to De burca or De) burgo is the name given to the clan of The-Anglo norman family originally known as De. burgh"}, {"url": "https://www.houseofnames.com/burke-family-crest", "passage_text": "First found in County Galway (Irish: Gaillimh) part of the province of Connacht, located on the west coast of the Island, where the family name is descended from the Norman noble William Fitzadelm de Burgo who went to Ireland in the Anglo-Norman invasion of Ireland and was the succeeded Strongbow as Chief Governor. Contemporary Notables of the name Burke. 1  Mr. Ernest James Burke (d. 1915), American 3rd Class passenger from Central Falls, Rhode Island, USA, who sailed aboard the RMS Lusitania and died in the sinking."}, {"url": "http://www.babynamewizard.com/baby-name/boy/burke", "passage_text": "Meanings and history of the name Burke: | Edit. English surname from an Old English root meaning fort.. Burke is from an English surname which was derived from Old English 'burh,' meaning Fortress.. Comments and insights on the name Burke: | Edit. Share what you know! Personal experiences with the name Burke: | Edit. Our son is named Berk. We loved the name because it is unpopular, but familiar."}, {"url": "http://www.ancestry.com/name-origin?surname=burke", "passage_text": "Click on a circle in the chart to view Burke immigration records. You can find out when most of the Burke families immigrated to the United States. You can focus your search to immigration records dating from that era. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival and destination. from the Social Security Death Index (SSDI). Click on a circle in the chart to view Burke birth and death records. An unusually short lifespan might indicate that your ancestors lived in harsh conditions. A short lifespan might also indicate health problems that were once prevalent in your family. The SSDI is a searchable database of more than 70 million names."}]