[{"url": "http://www.notablebiographies.com/Ma-Mo/Monet-Claude.html", "passage_text": "Background and early influences. Claude Monet was born in Paris, France, on November 14, 1840. His father, Adolphe Monet, was a grocer. In 1845 the family moved to Le Havre, France, where Monet's father and uncle ran a business selling supplies for ships."}, {"url": "http://www.imdb.com/name/nm1217328/bio", "passage_text": "Oscar-Claude Monet was born on November 14, 1840, in Paris, France. His father, named Adolphe Monet, was a grocer. His mother, named Louise-Justine Monet, was a singer. Young Monet grew up in Le Havre, Normandy."}, {"url": "http://www.claudemonetgallery.org/biography.html", "passage_text": "Claude Monet was born on November 14, 1840 on the fifth floor of 45 rue Laffitte, in the ninth arrondissement of Paris. He was the second son of Claude-Adolphe and Louise-Justine Aubree Aubrée, monet both of them-second Generation. parisians"}, {"url": "http://www.biography.com/people/claude-monet-9411771", "passage_text": "Synopsis. Claude Monet was born on November 14, 1840, in Paris, France. He enrolled in the Academie Suisse. After an art exhibition in 1874, a critic insultingly dubbed Monet's painting style Impression, since it was more concerned with form and light than realism, and the term stuck."}, {"url": "http://www.monetartprints.net/monet_biography.html", "passage_text": "Claude Monet was born in Paris on November 14, 1840. His father was a grocer who moved the family to Le Havre, on the Seine estuary, when Monet was five years old. Monet's early experience along the Channel and the Seine estuary was perhaps the singularly most profound influence on his artistic career."}, {"url": "http://www.answers.com/Q/Where_was_Claude_Monet_born", "passage_text": "Claude Monet was A French impression painter born November 14th 1840 in Paris, France. He was one of the originators of impressionism, along with other French painters, for … example Renoir, Sisley and Bazille. Monet married twice and had two sons. He died of lung cancer December 5th 1926."}, {"url": "http://www.biography.com/people/claude-monet-9411771", "passage_text": "One of the most famous painters in the history of art and a leading figure in the Impressionist movement, whose works can be seen in museums around the world, Oscar Claude Monet (some sources say Claude Oscar) was born on November 14, 1840, in Paris, France."}, {"url": "http://www.monetalia.com/biography.aspx", "passage_text": "Oscar-Claude Monet is famous French painter who was born on 14 November 1840 in Paris as second son of Claude Adolphe Monet and Louise-Justine Aubree. He was a founder of the Impressionism movement which had been called after his painting Impression, Sunrise."}]