[{"url": "http://www.dubai-online.com/essential/population/", "passage_text": "Current Population Statistics. According to the Dubai Statistics Center (part of the Government of Dubai) the current resident population of Dubai is 2,414,222 (figure last updated on Friday 9th October 2015) . Dubai is unusual in that the majority of its population is comprised of expatriates. Most are low income workers from the countries such as India, Pakistan, Bangladesh, the Philippines, Iran, Egypt, Nepal, and China."}, {"url": "https://en.wikipedia.org/wiki/Dubai", "passage_text": "Dubai has emerged as a global city and business hub of the Middle East. It is also a major transport hub for passengers and cargo. By the 1960s Dubai's economy was based on revenues from trade and, to a smaller extent, oil exploration concessions, but oil was not discovered until 1966. As of 2012, Dubai is the 22nd most expensive city in the world and the most expensive city in the Middle East. In 2014, Dubai's hotel rooms were rated as the second most expensive in the world, after Geneva."}, {"url": "http://worldpopulationreview.com/countries/united-arab-emirates-population/", "passage_text": "The largest group of non-UAE nationals are South Asia n (58%), followed by other Asia ns (17%) and Western expatriates (8.5%). There is an increasing presence of Europe ans, particularly in cities like Dubai. Dubai is the largest city with a population of 1.78 million. Interestingly, Dubai is often misperceived as a country or a city-state. Sometimes, all of the UAE is described simply as Dubai, which shows just how influential and well-known the city has become. United Arab Emirates Population 2014. The capital of the UAE is Abu Dhabi, which is one of the cultural and commercial centers along with Dubai. The United Arab Emirates have a very diverse population, of which only 13% are UAE nationals with the majority of the population expatriates"}, {"url": "http://www.thenational.ae/news/uae-news/dubai-population-rises-to-2-million", "passage_text": "DUBAI // Dubai's population reached more than 2 million last year-with men making up more than three quarters of that number. The data from Dubai Statistics Centre showed a figure of 1,536,380 men and 466,790 women, a total of 2,003,170. It showed that 76 per cent of the emirate's population are male. "}, {"url": "http://www.dec.org.ae/reports-publications/details.aspx?id=104", "passage_text": "Executive Summary. 1. According to the 2005 census, Dubai population accounted for 32 % of the UAE population of 4.104 million while Abu Dhabi and Sharjah accounted for 34% and 20% respectively. The other 4 emirates accounted for the rest of the population. 2. Expatriates in the UAE (all emirates) accounted for an average of approximately 80 % of its population, while they accounted for close to 90% of Dubai population and less than the average in the other six emirates."}, {"url": "http://www.condohotelsdubai.com/articles/15-facts-about-dubai.html", "passage_text": "Dubai’s population in 1975 was 183,200. Today it is about 1.67 million. The travel time from New York City to Dubai is 12 hours, 30 minutes. About 15% to 20% of the world’s cranes are currently operating in Dubai. Burj Al Arab, a seven-star hotel, (pictured right) is the tallest offshore structure in the world. "}, {"url": "http://www.mapsofworld.com/dubai/dubai-population.html", "passage_text": "The ratio of men and women in Dubai is 3:1. According to the survey carried out by the Statistical Center of Dubai, the. population of Dubai was 1,422,000 as of 2006, among which 1,073,000 were males and 349,000 were females. About 71% of Dubai population consists of foreigners and expatriates and 3% is categorized as western. Emigrates in Dubai mostly include Asians, mainly from India, Bangladesh, Pakistan and Filipino. "}, {"url": "https://en.wikipedia.org/wiki/Dubai", "passage_text": "Dubai (/duːˈbaɪ/ doo-BY; Arabic: دبي ‎ Dubayy, [dʊˈbɑj]) is the most populous city in the United Arab Emirates (UAE). It is located on the southeast coast of the Persian Gulf and is one of the seven emirates that make up the country. As of 2012, Dubai is the 22nd most expensive city in the world and the most expensive city in the Middle East. In 2014, Dubai's hotel rooms were rated as the second most expensive in the world, after Geneva."}, {"url": "https://en.wikipedia.org/wiki/Demographics_of_Dubai", "passage_text": "The population of Dubai is 2,109,274. Approximately 85% of the expatriate population (and 71% of the emirate's total population) was Asian (chiefly Indian, Pakistani, Filipino, Bangladeshi and Sri Lankan). About 25% of the population have Iranian origin. About 3% of the total population of Dubai was categorized as  Western . In addition, 16% of the population (or 288,000 people) lived in collective labour accommodation were not identified by ethnicity or nationality, but were thought to be primarily Asian."}]