[{"url": "http://people.howstuffworks.com/question721.htm", "passage_text": "The term caucus apparently comes from an Algonquin word meaning gathering of tribal chiefs, and the main crux of the caucus system today is indeed a series of meetings. To see how this works, let's look at the Iowa caucuses -- the first voting event of the presidential election year. "}, {"url": "http://www.factcheck.org/2008/04/caucus-vs-primary/", "passage_text": "Caucus meetings are arranged by either the state or political party to take place at a certain place and time. Caucuses are unique in that they allow participants to openly show support for candidates. Voting is often done by raising hands or breaking into groups according to the candidate participants support. FULL ANSWER. Caucuses were once the most common way of choosing presidential nominees. Today, Alaska, Colorado, Hawaii, Kansas, Maine, Minnesota, Nevada, North Dakota, Wyoming and Iowa are the only states to rely solely on the caucus, according to the Federal Election Commission."}, {"url": "http://www.factcheck.org/2008/04/caucus-vs-primary/", "passage_text": "A: In presidential campaigns, a caucus is a system of local gatherings where voters decide which candidate to support and select delegates for nominating conventions. A primary is a statewide voting process in which voters cast secret ballots for their preferred candidates. FULL ANSWER. Caucuses were once the most common way of choosing presidential nominees. Today, Alaska, Colorado, Hawaii, Kansas, Maine, Minnesota, Nevada, North Dakota, Wyoming and Iowa are the only states to rely solely on the caucus, according to the Federal Election Commission."}, {"url": "http://www.thefreedictionary.com/caucus", "passage_text": "1. a. a meeting of the members of a political party to select candidates or convention delegates, determine policy, etc. b. a faction within a legislative body that pursues its interests through the legislative process: the black caucus. 2. any group or meeting organized to further a special interest or cause. A meeting of the local members of a political party especially to select delegates to a convention or register preferences for candidates running for office. b. A closed meeting of party members within a legislative body to decide on questions of policy or leadership."}, {"url": "http://www.merriam-webster.com/dictionary/caucus", "passage_text": "Full Definition of CAUCUS. : a closed meeting of a group of persons belonging to the same political party or faction usually to select candidates or to decide on policy; also: a group of people united to promote an agreed-upon cause. See caucus defined for English-language learners. See caucus defined for kids. ADVERTISEMENT"}, {"url": "https://en.wikipedia.org/wiki/Caucus", "passage_text": "A caucus is a meeting of supporters or members of a specific political party or movement. The term originated in the United States, but has spread to Australia, Canada, New Zealand, South Africa, Brazil and Nepal. As the use of the term has been expanded, the exact definition has come to vary among political cultures. The term caucus is frequently used to discuss the procedures used by some states to select presidential nominees such as the Iowa caucuses, the first of the modern presidential election cycle, and the Texas caucuses."}, {"url": "http://www.huffingtonpost.com/2012/01/03/what-is-a-caucus-iowa-2012_n_1181069.html", "passage_text": "The results of the caucus voting, however, do not directly determine which candidate will win the support of Iowa's voters for the presidential nomination. In fact, the caucuses are just first step in the process. Each caucus selects delegates to send to each of the 99 county conventions, which are held in March. The 2012 Iowa caucus is the leadoff vote of the election season and starts the long march to Nov. 6; however, many don't know what the contest entails."}, {"url": "http://www.huffingtonpost.com/2012/01/03/what-is-a-caucus-iowa-2012_n_1181069.html", "passage_text": "The definition of the word caucus leaves a lot open to interpretation: A meeting of the members of a legislative body who are members of a particular political party, to select candidates or decide policy. The 2012 Iowa caucus is the leadoff vote of the election season and starts the long march to Nov. 6; however, many don't know what the contest entails."}, {"url": "https://en.wikipedia.org/wiki/Iowa_caucuses", "passage_text": "The Iowa caucuses are an electoral event in which residents of the U.S. state of Iowa meet in precinct caucuses in all of Iowa's 69 precincts and elect delegates to the corresponding county conventions. There are 99 counties in Iowa, and thus there are 99 conventions. The Iowa caucuses are noteworthy for the amount of media attention they receive during U.S. presidential election years. Since 1972, the Iowa caucuses have been the first major electoral event of the nominating process for President of the United States."}]