[{"url": "http://www.merriam-webster.com/dictionary/lancelet", "passage_text": "Definition of LANCELET. : any of a subphylum (Cephalochordata) of small translucent marine primitive chordate animals that are fishlike in appearance and usually live partially buried on the ocean floor —called also amphioxus. See lancelet defined for kids. ADVERTISEMENT. "}, {"url": "http://www.infoplease.com/encyclopedia/science/chordata-subphylum-cephalochordata.html", "passage_text": "Subphylum Cephalochordata. This class includes the several species of lancelets, or amphioxi, small, fishlike, filter-feeding animals found in shallow water. A lancelet has a long body, pointed at both ends, with a large notochord that extends almost from tip to tip and is present throughout life. 1 Chordata: Subphylum Cephalochordata-Subphylum Cephalochordata This class includes the several species of lancelets, or amphioxi, small, ... 2  lancelet-lancelet lancelet, name for small, fishlike lower chordate (see Chordata), also called amphioxus; .."}, {"url": "https://en.wikipedia.org/wiki/Lancelet", "passage_text": "Today, the term amphioxus is still used as a common name for the Amphioxiformes, along with lancelet, especially in the English language. A non-technical review of all aspects of lancelet biology is: Stokes, M. D. and Holland, N. D. 1998. Lancelets are typically 5 centimetres (2.0 in) long, or 7 centimetres (2.8 in) at the longest. They have a translucent, somewhat fish-like body, but without any paired fins or other limbs. A relatively poorly developed tail fin is present, so they are not especially good swimmers."}, {"url": "https://en.wikipedia.org/wiki/Lancelet", "passage_text": "The lancelets (from lancet) — also known as amphioxi (singular, amphioxus) — comprise some 32 species of fish-like marine chordates in the order Amphioxiformes, with a global distribution in shallow temperate (as far north as Scotland) and tropical seas, usually found half-buried in sand. Lancelets are typically 5 centimetres (2.0 in) long, or 7 centimetres (2.8 in) at the longest. They have a translucent, somewhat fish-like body, but without any paired fins or other limbs. A relatively poorly developed tail fin is present, so they are not especially good swimmers."}, {"url": "http://www.thefreedictionary.com/lancelet", "passage_text": "lancelet. n. 1. (Animals) any of several marine animals of the genus Branchiostoma (formerly Amphioxus), esp B. lanceolatus, that are closely related to the vertebrates: subphylum Cephalochordata (cephalochordates). Also called: amphioxus. [C19: referring to the slender shape]. "}, {"url": "http://encyclopedia2.thefreedictionary.com/lancelet", "passage_text": "Lancelet. Branchiostoma lanceolatum, or Amphioxus lan-ceolatus) , a chordate animal of subphylum Acrania (Cephalo-chordata). The body of the lancelet is transparent, up to 8 cm long, and pointed at both ends. The notochord extends into the anterior end of the body. The caudal fin is lancet-shaped."}, {"url": "http://www.infoplease.com/encyclopedia/science/lancelet.html", "passage_text": "lancelet. lancelet, name for small, fishlike lower chordate (see Chordata), also called amphioxus; it shows many affinities with the vertebrates. There are about 30 lancelet species, most belonging to the genus Brachiostoma (formerly Amphioxus). Lancelets are usually about 1 in. (2.5 cm) long, with transparent bodies tapered at both ends."}, {"url": "http://bio.rutgers.edu/~gb102/lab_3/402cm-cephalochord.html", "passage_text": "The quarter is shown to allow you to compare the size of these organisms with that of a familiar object. Subphylum Cephalochordata (Amphioxus or Lancet). Amphioxus (Branchiostoma lanceolata) is the most commonly studied member of the Cephalochordata. Like the other members of this subphylum, it is a small, fish-like animal found in shallow marine waters in many parts of the world. Examine the preserved specimen of amphioxus and observe its external structure."}, {"url": "http://eol.org/pages/1585/overview", "passage_text": "Comprehensive Description. The cephalochordates, or lancelets, comprise one of the three subphyla in the phylum Chordata (the other two being the vertebrates and tunicates). Lancelets are small fishlike animals that are generally less than 5 cm in length, although some reach 6 to 9 cm. "}]