[{"url": "http://www.dot.state.fl.us/equalopportunityoffice/dbecertification.shtm", "passage_text": "The DBE Certification Program is a Federal Program designed for business owners deemed socially and economically disadvantaged.. To achieve DBE status a business: 1  Must be an existing for-profit business that is currently operational; 2  Must meet the federal definition of a small business concern;"}, {"url": "http://www.dot.ca.gov/hq/bep/files/Disadvantaged_Business_Enterprise_DBE_Program_FAQs.pdf", "passage_text": "Once you are certified as a DBE in your home state, you can then apply for certification in California and a California certifying agency can request the onsite report from Arizona’s DBE agency. The certification process is complete under the provision of 49 CFR, Part 26.85, Interstate certification."}, {"url": "http://jatconsulting.net/dbewbefbe-certifications/", "passage_text": "JAT also is certified as a Disadvantaged Business Enterprise (DBE), a Women’s Business Enterprise (WBE) and/or a Female Business Enterprise (FBE) by numerous state and municipal agencies, listed below. To request a copy of a certificate or for more information, please contact us."}, {"url": "https://www.dot.ny.gov/main/business-center/civil-rights/general-info/dbe-certification", "passage_text": "DBE certification is a federal program. It is separate and distinct from the New York State M/WBE program. For more information on the state program go to: NY Business. The DBE program has economic criteria; the M/WBE criteria is the size standard."}, {"url": "http://www.dmbe.virginia.gov/dbecert.html", "passage_text": "Disadvantaged Business Enterprise (DBE). The D isadvantaged B usiness E nterprise certification program is a Federal program. The purpose is to increase the participation of certified DBEs in projects funded by the US Department of Transportation and other federal sectors."}, {"url": "https://connect.ncdot.gov/business/SmallBusiness/Pages/Become%20a%20Certified%20DBE%20Business.aspx", "passage_text": "To be eligible for DBE certification, you must meet the social and economic disadvantaged criteria of Federal Regulations 49 Part 26."}, {"url": "http://www.dot.ca.gov/hq/bep/files/Disadvantaged_Business_Enterprise_DBE_Program_FAQs.pdf", "passage_text": "Yes, however, your firm must first be DBE certified in your home state. You must complete the appropriate application in the state you reside. For example, if your firm is based in Arizona, you must proceed through Arizona’s DBE certification process before seeking work as a DBE in California."}]