[{"url": "http://fas.org/sgp/crs/misc/R41079.pdf", "passage_text": "Congressional Oversight: An Overview Congressional Research Service Summary A fundamental objective of congressional oversight is to hold executive officials accountable for the implementation of delegated authority. Congressional Oversight: An Overview Congressional Research Service 14 Impeachment and Removal The ultimate check on the executive (and judicial) branch is impeachment and removal from office, and it is vested exclusively in Congress."}, {"url": "http://www.let.rug.nl/usa/outlines/government-1991/the-legislative-branch-the-reach-of-congress/oversight-powers-of-congress.php", "passage_text": "Of the numerous techniques that Congress has adopted to influence the executive branch, one of the most effective is the oversight function. "}, {"url": "http://iipdigital.usembassy.gov/st/english/publication/2008/06/20080628185809eaifas0.3921457.html", "passage_text": "Oversight Powers of Congress. Dictionaries define oversight as watchful care, and this approach has proven to be one of the most effective techniques that Congress has adopted to influence the executive branch."}, {"url": "https://en.wikipedia.org/wiki/Congressional_oversight", "passage_text": "From Wikipedia, the free encyclopedia. Congressional oversight is oversight by the United States Congress over the Executive Branch, including the numerous U.S. federal agencies. Congressional oversight includes the review, monitoring, and supervision of federal agencies, programs, activities, and policy implementation. Congress exercises this power largely through its congressional committee system. Congress’s oversight authority derives from its “implied” powers in the Constitution, public laws, and House and Senate rules. It is an integral part of the American system of checks and balances"}, {"url": "https://en.wikipedia.org/wiki/Congressional_oversight", "passage_text": "Congressional oversight is oversight by the United States Congress over the Executive Branch, including the numerous U.S. federal agencies. Congress’s oversight authority derives from its “implied” powers in the Constitution, public laws, and House and Senate rules. It is an integral part of the American system of checks and balanc"}, {"url": "http://fas.org/sgp/crs/misc/R41079.pdf", "passage_text": "Congressional Oversight: An Overview Congressional Research Service 5 Worth raising is a related matter: What constitutes effective or quality oversight? The traditional method of exercising congressional oversight is through committee hearings and investigations into executive branch operations. Congressional Oversight: An Overview Congressional Research Service 14 Impeachment and Removal The ultimate check on the executive (and judicial) branch is impeachment and removal from office, and it is vested exclusively in Congress."}, {"url": "https://www.cia.gov/library/center-for-the-study-of-intelligence/csi-publications/csi-studies/studies/97unclass/wagenen.html", "passage_text": "Perhaps, in looking back at what Congressional oversight has and has not been, we will be better able to discern the future of oversight by the Congress. First, it is important to dispel the popular notion that Congressional oversight started with the establishment of the SSCI and the HPSCI. That notion is not accurate. Today, Congressional oversight is accepted and recognized as a fact of life. The top echelons of the IC are replete with former professional staffers of the intelligence committees, and the committees themselves continue to draw staff expertise from the Community."}, {"url": "http://www.definitions.net/definition/Congressional%20oversight", "passage_text": "Congressional oversight. Congressional oversight refers to oversight by the United States Congress on the Executive Branch, including the numerous U.S. federal agencies. Congressional oversight refers to the review, monitoring, and supervision of federal agencies, programs, activities, and policy implementation. Congress exercises this power largely through its congressional committee system. However, oversight, which dates to the earliest days of the Republic, also occurs in a wide variety of congressional activities and contexts."}, {"url": "http://legislativeoversight-kdierking.blogspot.com/", "passage_text": "Congressional oversight is important for more reasons than one. Oversight gives the public a view on important issues; this gives the American people the opportunity to have an opinion on what the executive branch is doing, and how they are going about it. Oversight is so important because the revision and supervision of the executive activities allow congress to find and address problem areas. Finding these problem areas then allow them to make the necessary improvements or changes to create an effective process."}]