[{"url": "http://u5d.net/Linguistics/8-types-of-languages.html", "passage_text": "Different types of languages: In topological classification of languages linguists use to divide them in about 5 main types. It must be added however that hardly any language or family is purely of one variant. The five types are designated: - Isolating languages (analytical or root languages)."}, {"url": "https://en.wikipedia.org/wiki/Language", "passage_text": "Language is the ability to acquire and use complex systems of communication, particularly the human ability to do so, and a language is any specific example of such a system. Africa is home to a large number of language families, the largest of which is the Niger-Congo language family, which includes such languages as Swahili, Shona, and Yoruba. Speakers of the Niger-Congo languages account for 6.9% of the world's population."}, {"url": "http://efxkits.com/blog/types-of-programming-languages-with-differences/", "passage_text": "To call these groups ” types of language ” is really a bit confusing. It’s easy to program in an object-oriented style in C language. In truth, most of the languages include ideas and features from various domains, which only helps to increase the usefulness of these types of languages. The procedural programming language is used to execute a sequence of statements which lead to a result. Typically, this type of programming language uses multiple variables, heavy loops and other elements, which separates them from functional programming"}, {"url": "http://www.articlesfactory.com/articles/writing/types-of-english-language-differences-and-variations.html", "passage_text": "The English language has two types: British English and American English. Other variations such as Oxford English, Standard English, or other variants are mere adaptations of the two types (especially for consistency or reference use, e.g., in media or publication). "}, {"url": "http://www.landofcode.com/programming-intro/computer-programming-languages.php", "passage_text": "Vary greatly in terms of power and complexity. 1  HTML. 2  Hyper Text Markup Language. 3  The core language of the world wide web that is used to define the structure and layout of web pages by using various tags and attributes. 4  Although a fundamental language of the web, HTML is static-content created with it does not change. There are limitations, and actually, different languages are used for different tasks. This tutorial focuses on: 1  Web languages. 2  Software languages. 3  The different generations of"}, {"url": "https://dssofgcsc.wordpress.com/for-professors/types-of-sign-language/", "passage_text": "While there are specific, classified types of Sign Language that make up the general base to signing systems, dialects are also created, oftentimes creating a version of the base sign system that is unique and prevailing amongst the deaf community of a local community. Types of Sign Language. There are many types of sign language. Just las vocal language comes in many different langauges and dialects, sign language too comes in different langauges, dialects, and even versions of dialects. First, the basics"}, {"url": "http://www.dailywritingtips.com/12-types-of-language/", "passage_text": "12 Types of Language. A variety of terms distinguish the kinds of languages and vocabularies that exist outside the mainstream of standard, formal language. Here are twelve words and phrases that denote specific ideas of language usage. 1. Argot. An argot is a language primarily developed to disguise conversation, originally because of a criminal enterprise, though the term is also used loosely to refer to informal jargon. 2. A simplified language arising from the efforts of people speaking different languages to communicate is a pidgin. These languages generally develop to facilitate trade between people without a common language. In time, pidgins often evolve into creoles. 11."}, {"url": "https://en.wikipedia.org/wiki/Language", "passage_text": "An example of such a language is Turkish, where for example, the word evlerinizden, or from your houses, consists of the morphemes, ev-ler-iniz-den with the meanings house-plural-your-from. The languages that rely on morphology to the greatest extent are traditionally called polysynthetic languages. Africa is home to a large number of language families, the largest of which is the Niger-Congo language family, which includes such languages as Swahili, Shona, and Yoruba. Speakers of the Niger-Congo languages account for 6.9% of the world's population."}]