[{"url": "http://healthyeating.sfgate.com/many-calories-carbs-should-women-day-3900.html", "passage_text": "Sedentary women between the ages of 19 and 30 should consume between 1,800 and 2,000 calories per day. Carbohydrates should account for 810 to 1,300 of your calories each day. As there are 4 calories in 1 gram of carbohydrates, this amounts to 202.5 to 325 grams of carbohydrates per day. If you are between the ages of 31 and 50, you should consume 1,800 calories per day and 202.5 to 292.5 grams of carbohydrates."}, {"url": "http://healthyeating.sfgate.com/many-calories-carbs-should-women-day-3900.html", "passage_text": "Women between the ages of 31 and 50 need slightly less, requiring 2,200 calories and 247.5 and 357.5 grams of carbohydrates each day. After the age of 50, active women should eat between 2,000 and 2,200 calories and 225 to"}, {"url": "http://www.livestrong.com/article/223225-how-many-grams-of-carbs-per-day-to-lose-weight/", "passage_text": "Therefore, if your weight-loss energy goal is 1,400 calories per day, multiply 1,400 by 0.45 and by 0.65 -- equaling 630 to 910 calories -- to determine how many of your total calories should be from carbohydrates. Then, divide each of these number by 4 calories, which is 157 to 228 grams of carbs per day."}, {"url": "http://healthyeating.sfgate.com/many-calories-carbs-should-women-day-3900.html", "passage_text": "As carbohydrates should account for 900 to 1,430 of these calories, you should eat 225 to 357.5 grams of carbs each day. If you are between the ages of 31 and 50, these values decrease to 2,000 calories and between 225 and 325 grams of carbs every day."}, {"url": "http://www.acaloriecounter.com/diet/how-many-carbs-per-day/", "passage_text": "1 First you figured out how many calories you need to eat per day for your specific goal (losing fat, building muscle, or maintaining your current weight). 2  From there you figured out where those calories should come from each day by calculating your ideal daily intake of protein, fat and just now, carbs."}, {"url": "http://healthyeating.sfgate.com/many-calories-carbs-should-women-day-3900.html", "passage_text": "The number of calories that a woman should consume each day varies with her age and level of physical activity. Regardless of these differences, the 2010 Dietary Guidelines for Americans recommends that carbohydrates account for 45 to 65 percent of your total calories."}, {"url": "http://www.acaloriecounter.com/diet/how-many-carbs-per-day/", "passage_text": "Well, those calories will all come from carbs. And, since 1 gram of carbs contains 4 calories, you’d just need to divide this left over amount of calories by 4 to figure out exactly how many grams of carbs you’d need to eat each day."}, {"url": "http://www.livestrong.com/article/223225-how-many-grams-of-carbs-per-day-to-lose-weight/", "passage_text": "For example, if you’re eating 1,200 calories a day, aim for 135 to 195 grams of carbs -- and if your weight-loss calorie requirement is 1,600 calories daily, shoot for 180, but no more than 260, grams of carbs per day."}]