[{"url": "http://www.enotes.com/homework-help/how-many-chromosomes-there-human-body-cell-289057", "passage_text": "Somatic cells (body cells) are haploid cells. They have 23 pairs of chromosomes. Reproductive cells (gametes) have half the normal number i.e. 23. This is because two gametes (one male and one female) have to fuse hence, restoring the original number of 23 pairs. The number of unique chromosomes, including sex chromosomes, is 23 in humans. This is the n, or haploid number. 2n, or the diploid number is 46, and refers to the actual number of chromosomes in a human cell, including the duplicates."}, {"url": "https://en.wikipedia.org/wiki/Human_chromosome", "passage_text": "These tables give the total number of chromosomes (including sex chromosomes) in a cell nucleus. For example, human cells are diploid and have 22 different types of autosome, each present as two copies, and two sex chromosomes. This gives 46 chromosomes in total. Sexually reproducing species have somatic cells (body cells), which are diploid [2n] having two sets of chromosomes (23 pairs in humans with one set of 23 chromosomes from each parent), one set from the mother and one from the father. Gametes, reproductive cells, are haploid [n]: They have one set of chromosomes."}, {"url": "http://www.answers.com/Q/How_many_chromosomes_does_a_nerve_cell_have", "passage_text": "All the cells in the human body, including the nerve cells, have 46 chromosomes (23 pairs) (except the sperms and egg cells, which have 23 chromosomes each). Humans have 46 chromosomes in their nerve cells, unless they have a  chromosomal disorder. With the exception of the reproductive cells,  which only carry half the chromosom … al DNA, all human cells have the  same amount of chromosomes."}, {"url": "http://onlinehumanbody.blogspot.com/2010/09/cell-nucleus.html", "passage_text": "Chromosomes and Genes. Chromosomes are the carriers of hereditary characteristics called genes. The human cell nucleus contains 46 chromosomes (diploidy) in the form of 23 chromosome pairs (23 male, 23 female chromosomes). Every cell with the exception of red blood cells has a nucleus. However, there are cells with two nuclei (some liver cells) or greater numbers of nuclei, e. g., osteoclasts in bony tissue (5−20 nuclei) or skeletal muscle cells (more than 1000 nuclei). Cells without nuclei can no longer divide."}, {"url": "http://www.answers.com/Q/How_many_chromosomes_does_a_nucleus_contain", "passage_text": "Confidence votes 2.8K. That depends on what organism the cell belongs to. A nucleus of a normal human cell contains 46 chromosomes, whereas this is a double chromosome set, i.e. we have 23 pairs of chromosomes that are used for the same functions. Two chromosomes that fulfill the same functions are called homologous. "}, {"url": "http://www.abpischools.org.uk/page/modules/genome/dna2.cfm?coSiteNavigation_allTopic=1", "passage_text": "Most cells in the human body have a nucleus containing 23 pairs of chromosomes. A small section of a chromosome that controls one particular character, e.g. eye colour, is called a gene and each chromosome carries hundreds of genes. Humans have 23 pairs of chromosomes. They are in the nucleus of every human cell. Human genome. The complete sequence of all 20,000-25,000 human genes. That is, which chromosomes they are in and whereabouts the gene appears on that chromosome's piece of DNA. DNA. Deoxyribonucleic acid."}, {"url": "https://en.wikipedia.org/wiki/Human_chromosome", "passage_text": "All act in the same way during cell division. Human cells have 23 pairs of chromosomes (22 pairs of autosomes and one pair of sex chromosomes), giving a total of 46 per cell. In addition to these, human cells have many hundreds of copies of the mitochondrial genome. Sexually reproducing species have somatic cells (body cells), which are diploid [2n] having two sets of chromosomes (23 pairs in humans with one set of 23 chromosomes from each parent), one set from the mother and one from the father. Gametes, reproductive cells, are haploid [n]: They have one set of chromosomes."}, {"url": "http://www.enotes.com/homework-help/how-many-chromosomes-there-human-body-cell-289057", "passage_text": "Therefore there is a total of 23 pairs of chromosome in a human body cell. However the human gametes formed by meiosis have haploid number of chromosomes i.e. they have only 23 chromosomes instead of 46; so that after fertilization the zygote has 23 pairs of chromosome(23 from the sperm and 23 from the ovum). The number of unique chromosomes, including sex chromosomes, is 23 in humans. This is the n, or haploid number. 2n, or the diploid number is 46, and refers to the actual number of chromosomes in a human cell, including the duplicates."}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/howmanychromosomes", "passage_text": "Females have two copies of the X chromosome, while males have one X and one Y chromosome. The 22 autosomes are numbered by size. The other two chromosomes, X and Y, are the sex chromosomes. This picture of the human chromosomes lined up in pairs is called a karyotype. In humans, each cell normally contains 23 pairs of chromosomes, for a total of 46. Twenty-two of these pairs, called autosomes, look the same in both males and females. The 23rd pair, the sex chromosomes, differ between males and females. "}]