[{"url": "http://www.simplyhired.com/salaries-k-registered-nurse-l-syracuse-ny-jobs.html", "passage_text": "Average registered nurse salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term registered nurse anywhere in the job listing. "}, {"url": "http://www1.salary.com/NY/New-York/Staff-Nurse-RN-salary.html", "passage_text": "The salary for someone with the job title Staff Nurse-RN in New York, NY varies depending on a number of factors. This chart describes the expected percentage of people who perform the job of Staff Nurse-RN in New York, NY that make less than that salary."}, {"url": "http://www.topregisterednurse.com/salary/new-york/", "passage_text": "Registered Nurse Salary in New York. A survey conducted by the US Bureau of Labor Statistics reveals that the mean wage of a registered nurse in New York was $75,470 and per hour salary was $36.29 in May 2013. New York employed 169,820 RNs in May 2013. Employment per 1000 jobs was 19.666. The figures in indeed.com reveal that the average RN salary in NY was. $80,000 as of Oct 2014. It was 21% greater than the average registered nurse salary for job postings throughout the nation"}, {"url": "http://www.payscale.com/research/US/Job=Registered_Nurse_(RN)/Salary/474556de/New-York-NY", "passage_text": "(United States). The average salary for a Registered Nurse (RN) in New York, New York is $69,072 per year. Most people with this job move on to other positions after 20 years in this field. The highest paying skills associated with this job are Critical Care, Oncology, and Telemetry. $48,003 - $88,775. "}, {"url": "http://www.simplyhired.com/salaries-k-registered-nurse-l-buffalo-ny-jobs.html", "passage_text": "The average salary for registered nurse jobs in Buffalo, NY is $12,000. Average registered nurse salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term registered nurse anywhere in the job listing. "}, {"url": "http://www.indeed.com/salary/q-New-Grad-Bsn-RN-l-New-York,-NY.html", "passage_text": "Average New Grad Bsn RN salaries for job postings in New York, NY are 36% higher than average New Grad Bsn RN salaries for job postings nationwide. "}, {"url": "http://www.graduatenursingedu.org/new-york/new-york-salary/", "passage_text": "In conducting their annual salary survey of 2011, Advance for NPs & PAs, a peer reviewed industry journal, showed that NPs in Syracuse and Buffalo earned an average of $86,711 and $85,227, respectively. Nurse Practitioners in New York City reported the highest salaries in the state, earning $117,775 on average. The American Academy of Nurse Practitioners reported in their 2011 National NP Compensation Survey that nurse practitioners in the Mideast region, including New York, earned an average base salary of $94,337 and enjoyed an average total income of $101,112."}, {"url": "http://www.indeed.com/salary/q-RN-l-New-York,-NY.html", "passage_text": "Average RN salaries for job postings in New York, NY are 36% higher than average RN salaries for job postings nationwide. "}]