[{"url": "http://www.indeed.com/salary/q-Teacher-l-Indiana.html", "passage_text": "Average Teacher salaries for job postings in Indiana are 4% lower than average Teacher salaries for job postings nationwide. "}, {"url": "http://www.teacherportal.com/salary/Indiana-teacher-salary", "passage_text": "Starting Teacher Salary Rank: 24th. Salary raise last year: -1.0 %. Salary raise over 10 years: 11.0 %. Indiana is 9th on our comfort scale with starting salaries of $34,696 and average salaries of $50,065. Although the average salaries in this corn producing state are over $9k less than that in Illinois ($59,113), the cost of living is affordable"}, {"url": "http://www.payscale.com/research/US/Job=Elementary_School_Teacher/Salary", "passage_text": "(United States). An Elementary School Teacher earns an average salary of $41,562 per year. Skills that are associated with high pay for this job are Oral / Verbal Communication, Bilingual, Reading, and Special Education. Experience has a moderate effect on income for this job. $29,682 - $64,807"}, {"url": "http://www.indeed.com/salary/q-Elementary-Teacher-l-Indiana.html", "passage_text": "Average Elementary Teacher salaries for job postings in Indiana are 4% lower than average Elementary Teacher salaries for job postings nationwide. "}, {"url": "http://www.teachersalaryinfo.com/average-teacher-salary-indiana.html", "passage_text": "The average teacher salary in Indiana was $46,640 in 2009. This was somewhat lower than the national 2009 average of $49,720. In 2008, teacher salaries in Indiana put the state at 25th in the nation. Looking at the teaching salaries in Indiana from 2007, it is clear that Indiana teacher salaries have been steadily behind most of the nation. The 2007 average teacher salary in 2007 was $46,600, which put the state at 23rd in the U.S. Overall, teaching salaries in Indiana have increased by 0.09 percent between 2007 and 2009, which can be seen on the Indiana teacher salary schedule below"}, {"url": "http://www1.salary.com/in/Teacher-Elementary-School-salary.html", "passage_text": "Indiana Teacher Elementary School Salaries. Within Indiana there is a lot of variation in Teacher Elementary School salaries. These variations depend on on a wide range of factors from population to general competitiveness in the market. Below is a map displaying a few key cities in Indiana and surrounding states, click on any one to find Teacher Elementary School Salaries for that area."}, {"url": "http://www1.salary.com/Teacher-Elementary-School-salary.html", "passage_text": "For example the median expected annual pay for a typical Teacher Elementary School in the United States is $54,255, so 50% of the people who perform the job of Teacher Elementary School in the United States are expected to make less than $54,255. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. The annual salary for someone with the job title Teacher Elementary School may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://www.teachersalaryinfo.com/average-teacher-salary-indiana.html", "passage_text": "Average Teacher Salary in Indiana. The average teacher salary in Indiana was $46,640 in 2009. This was somewhat lower than the national 2009 average of $49,720. This figure put Illinois teacher salaries at the rank of 30th in the nation overall. In 2008, teacher salaries in Indiana put the state at 25th in the nation. Looking at the teaching salaries in Indiana from 2007, it is clear that Indiana teacher salaries have been steadily behind most of the nation. The 2007 average teacher salary in 2007 was $46,600, which put the state at 23rd in the U.S. Overall, teaching salaries in Indiana have increased by 0.09 percent between 2007 and 2009, which can be seen on the Indiana teacher salary schedule below"}]