[{"url": "http://www.wsj.com/articles/SB125112279126253841", "passage_text": "November is more than two months away, but given that the SBA loan approval process can take as long as 120 days, applicants had better get cracking, says Dave Mulcahy, the director of the Small Business Development Center at Lamar University in Beaumont, Texas. "}, {"url": "https://businesslendermatch.com/loans/sba-loans/", "passage_text": "SBA Loan Repayment Terms. The repayment terms of SBA loans are dependent on which program you participate in. If you take out an SBA 7(a) loan in order to purchase real estate, you will probably be given as long as 25 years to repay the loan. On the other hand, all microloans must be repaid in six years or less."}, {"url": "http://sbaeasy.com/sba/faqlongtake.htm", "passage_text": "Applying for an SBA Loan can be an extremely frustrating and lengthy process if it is not done correctly and can be Disastrous if mistakes are made such as not filling out all of the paperwork required or submitting an incomplete SBA Loan Package. So it is usually best for an Applicant to prepare their own SBA Loan Application Package and be completely involved from beginning to end in the process. However the problem with that is in most cases the applicant has no experience in preparing an"}, {"url": "http://smallbusiness.chron.com/long-sba-loan-17359.html", "passage_text": "Applying for an SBA loan is a common course of action for an applicant who has been denied by a bank for a business loan. The Small Business Administration provides a guarantee for qualified business owners (both startups and existing companies). Another factor is how long it takes you to gather all of the paperwork proving your financial status. Beyond that, the amount of time it takes to finalize an SBA loan largely depends on the lender's timeline. Expect the process to take a minimum of 60 to 90 days. Applications for larger amounts may take longer for the lender to evaluate"}, {"url": "http://www.ehow.com/facts_5013239_how-long-does-sba-loan.html", "passage_text": "Types of Loans. Basic Loan Guaranty is the most popular SBA loan. You may use loan proceeds in any business-building manner. The key to getting your SBA loan approved fast is completing your business plan, and completing the loan application documents in a swift, but thorough manner. However, there is no set time frame deciding how fast you will receive a SBA microloan. A microloan is for not-fo-profit child care centers or small businesses. The maximum loan amount is $35,000, and it can't be used to buy property or to pay debt."}, {"url": "http://smallbusiness.chron.com/long-sba-loan-17359.html", "passage_text": "The exact time it will take to close an SBA loan varies by case. For instance, one factor is how long it will take you to complete your well-researched business plan or financials --- that could take several weeks or even months. Another factor is how long it takes you to gather all of the paperwork proving your financial status. Beyond that, the amount of time it takes to finalize an SBA loan largely depends on the lender's timeline. Expect the process to take a minimum of 60 to 90 days. Applications for larger amounts may take longer for the lender to evaluate"}, {"url": "http://www.ehow.com/facts_5013239_how-long-does-sba-loan.html", "passage_text": "The Small Business Administration offers financial assistance and business planning for small business owners. The SBA helps small businesses obtain financing through loans and grants. The SBA is a guarantor not an actual lender. Here are the factors that determine how long it takes to get an SBA loan. However, there is no set time frame deciding how fast you will receive a SBA microloan. A microloan is for not-fo-profit child care centers or small businesses. The maximum loan amount is $35,000, and it can't be used to buy property or to pay debt."}, {"url": "http://www.ehow.com/facts_5013239_how-long-does-sba-loan.html", "passage_text": "The length of time it will take you to get your SBA loan depends on how fast you return your completed application to the SBA. The amount of time it takes you to receive your loan is also dependent on the loan program you choose. However, there is no set time frame deciding how fast you will receive a SBA microloan. A microloan is for not-fo-profit child care centers or small businesses. The maximum loan amount is $35,000, and it can't be used to buy property or to pay debt."}]