[{"url": "http://www.thefreedictionary.com/freemartin", "passage_text": "freemartin. n. 1. (Veterinary Science) the female of a pair of twin calves of unlike sex that is imperfectly developed and sterile, probably due to the influence of the male hormones of its twin during development in the uterus. "}, {"url": "http://www.cattlenetwork.com/cattle-news/latest/What-is-a-Freemartin-118782429.html", "passage_text": "Freemartinism is recognized as one of the most severe forms of sexual abnormality among cattle. This condition causes infertility in the female cattle born twin to a male. When a heifer twin shares the uterus with a bull fetus, they also share the placental membranes connecting the fetuses with the dam."}, {"url": "http://medical-dictionary.thefreedictionary.com/freemartin", "passage_text": "a sterile female born co-twin with a male. Occurs most commonly in cattle, very rarely in sheep, and apparently not at all in the other species. Male hormones produced by the male calf share the common circulation and inhibit the normal development of genitalia of the female. The female is also an erythrocytic chimera and can be diagnosed as a freemartin by this means. It can also be diagnosed by cytogenetic techniques. "}, {"url": "http://www.youtube.com/watch?v=L-rqZWRZiFs", "passage_text": "Freemartinism occurs where a heifer calf is a twin to a bull calf. As the heifer and bulls calves develop in the uterus, testosterone from the bull calf can cross over to the female. When this occurs, the development of the female reproductive organs are impaired. Approx."}, {"url": "http://www1.agric.gov.ab.ca/$department/deptdocs.nsf/all/faq8285", "passage_text": "Freemartinism is one of the most severe forms of sexual abnormality among cattle. It causes infertility in the female calf born with a male twin. "}, {"url": "http://medical-dictionary.thefreedictionary.com/Free-martin", "passage_text": "a sterile female born co-twin with a male. Occurs most commonly in cattle, very rarely in sheep, and apparently not at all in the other species. Male hormones produced by the male calf share the common circulation and inhibit the normal development of genitalia of the female. The female is also an erythrocytic chimera and can be diagnosed as a freemartin by this means."}, {"url": "http://www.answers.com/Q/What_is_free_martin_in_cows", "passage_text": "Making the world better, one answer at a time. A free-martin is a sterile female bovine who is a twin to a male bovine, sterilized in the womb by the hormones from the male. This occurs over ninety percent of the time when a mixed set of bovine twins is born. The occurrence of twins in cattle is less than 1 percent. "}, {"url": "https://en.wikipedia.org/wiki/Freemartin", "passage_text": "A freemartin or free-martin (sometimes martin heifer) is an infertile female mammal with masculinized behavior and non-functioning ovaries. Genetically the animal is chimeric: Karyotyping of a sample of cells shows XX/XY chromosomes. The animal originates as a female (XX), but acquires the male (XY) component in utero by exchange of some cellular material from a male twin, via vascular connections between placentas. During fetal development cells are exchanged between the fused circulations of the bovine twins. Up to 95% of the freemartin's blood cells can be derived from those of her twin brother. Male-derived cells and their progeny can be easily visualized in the freemartin tissues, as only they contain the male Y chromosome."}, {"url": "http://www.thecattlesite.com/articles/975/what-is-a-freemartin/", "passage_text": "Freemartinism is recognized as one of the most severe forms of sexual abnormality among cattle. This condition causes infertility in the female cattle born twin to a male. When a heifer twin shares the uterus with a bull fetus, they also share the placental membranes connecting the fetuses with the dam. Estimates of the percentage of natural beef cattle births that produce twins vary. One estimate (Gilmore) puts the percentage at about .5% or 1 in every 200 births. Approximately one-half of the sets of twins should contain both a bull and a heifer calf."}]