[{"url": "http://www.apa.org/workforce/publications/09-salaries/index.aspx", "passage_text": "The overall 11-12-month median salary in 2009 for doctoral-level psychologists in these positions was $100,000, based on 207 valid responses. The standard deviation ($77,121) is large for this group, indicating substantial variation around the mean of $121,100. The overall mean salary reported for those in applied positions was $101,053 (SD=$65,215) and the median salary was $80,000. The 1st and 3rd quartiles were $64,250 and $112,000, respectively. Table 14b shows salary data for master's level respondents in applied psychology positions by years of work experience."}, {"url": "http://www.apa.org/workforce/publications/09-salaries/index.aspx", "passage_text": "The most prevalent employment for master's-level APA Salary Survey participants were in direct human services (N=132). The overall mean salary reported for master's-level direct human service positions was $52,322 (SD=$26,441) and the median salary was $45,000. The overall mean salary reported for those in applied positions was $101,053 (SD=$65,215) and the median salary was $80,000. The 1st and 3rd quartiles were $64,250 and $112,000, respectively. Table 14b shows salary data for master's level respondents in applied psychology positions by years of work experience."}, {"url": "http://www.careerprofiles.info/psychologist-salary-information.html", "passage_text": "According to the American Psychological Association (APA) the median annual salary for developmental psychologists employed at universities ranges between $70,000 and $90,000 a year. Developmental psychologists working in the private sector and as research administrators can earn over $110,000 a year. Psychologists in the army are entitled to special pay in addition to their base salary. Special pay typically ranges from $2,000 to $5,000 a year. Army psychologists receive allowances for health care, child care, housing and food which can equal over $3"}, {"url": "http://work.chron.com/salaries-beginner-psychologists-3268.html", "passage_text": "Psychologists employed in research settings earned slightly higher average salaries than those in academia. The APA reported that the mean initial annual salary for psychologists working at a research center at a university or institute was $67,364 for 2009 Ph.D. recipients. The lowest average salary was for researchers in the psychiatry departments at medical schools, where they earned a mean wage of $50,275. Clinical psychologists had initial salaries ranging from $48,846 at community mental-health clinics or centers to $73,563 in the criminal-justice center. If entering a group practice, the mean salary was $50,667."}, {"url": "http://www.apa.org/workforce/publications/09-salaries/index.aspx", "passage_text": "Among the 7 respondents with master's degrees in school psychology who provided direct human services, the mean salary was $60,057 (SD=$26,962) with a median salary of $57,000. This group had an average of 25 years of work experience, with 5 of the participants reporting more than 23 years of experience. The overall mean salary reported for those in applied positions was $101,053 (SD=$65,215) and the median salary was $80,000. The 1st and 3rd quartiles were $64,250 and $112,000, respectively. Table 14b shows salary data for master's level respondents in applied psychology positions by years of work experience."}, {"url": "http://www.payscale.com/research/US/Job=Psychologist/Salary", "passage_text": "A Psychologist earns an average salary of $69,562 per year. The skills that increase pay for this job the most are Neuropsychology, Forensic Psychology, and Clinical Research. Psychologists must have either a clinical or counseling doctorate in psychology, although some positions may accept a master’s degree. Many positions may require the degree to be from an American Psychological Association (APA)-accredited school."}, {"url": "http://www.apa.org/workforce/publications/09-salaries/index.aspx", "passage_text": "The 2009 Salaries in Psychology report represents the fifteenth volume in the series and over twenty-five years of effort by the American Psychological Association to gather salary data on psychological personnel. The survey was initiated in 1981, in response to increasing requests for current national salary data. The overall mean salary reported for those in applied positions was $101,053 (SD=$65,215) and the median salary was $80,000. The 1st and 3rd quartiles were $64,250 and $112,000, respectively. Table 14b shows salary data for master's level respondents in applied psychology positions by years of work experience."}, {"url": "http://www.careerprofiles.info/psychologist-salary-information.html", "passage_text": "The average starting salary for counseling psychologists is between $35,000 and $40,000 a year. With just three years of experience average salary figures increase to $40,000 year and with more than five years of experience counseling psychologists can earn anywhere between $45,000 and $55,000 a year. Psychologists in the army are entitled to special pay in addition to their base salary. Special pay typically ranges from $2,000 to $5,000 a year. Army psychologists receive allowances for health care, child care, housing and food which can equal over $3"}, {"url": "http://work.chron.com/salaries-beginner-psychologists-3268.html", "passage_text": "Depending on the department, the average salary ranged from $51,103 to $59,447. As an instructor or lecturer, psychologists began at an average salary of $42,212 annually; the initial average salary for educational administrators was $72,767. Clinical psychologists had initial salaries ranging from $48,846 at community mental-health clinics or centers to $73,563 in the criminal-justice center. If entering a group practice, the mean salary was $50,667."}]