[{"url": "http://horses.about.com/od/HorseMythsHistoryLegendsLore/tp/biggest-and-smallest-horses.htm", "passage_text": "The biggest horses in the world are draft breeds. These horses were bred to pull or carry large loads. Included in the draft breeds are the Shire, Percheron and Clydesdale. Before the use of trucks and tractors, draft horses pulled ploughs, wagons, street cars, barges and other farm implements and conveyances. • Smallest Type of Equine. The smallest horses in the world are ponies. There are several breeds specifically developed for their diminutive size. Ponies are hardy, and they tend to be longer lived than their larger brethren."}, {"url": "http://unicornerfarm.com/mini_horses/breed_info.htm", "passage_text": "The Miniature Horse breed is the product of nearly 400 years of selective breeding. Many trace back to the early 1700’s, when the small horses were used to pull ore carts in coalmines of England and Northern Europe. The miniatures were brought to the United States in the late 19th century for that same use. "}, {"url": "http://www.answers.com/Q/What_is_the_smallest_breed_of_pony_in_the_world", "passage_text": "Confidence votes 2. believe it or not, the smallest breed of equine in the world is NOT a shetland. it is a Falabella pony. it is the smallest and the rarest breed. it was originated in argentina. they are not strong enough to ride, considering their small size. they are so tiny that you can keep one in your backyard! some large dog collars would A dog collar would fit on one! check out some pics! The Chihuahua is the smallest breed of dog in the world, also it's the only natural toy breed. This, however, is only the smallest breed in general. In other words, on avera … ge, the Chihuahua is the smallest breed of dog, but some individual dogs may be exceptionally small."}, {"url": "http://horses.about.com/od/HorseMythsHistoryLegendsLore/tp/biggest-and-smallest-horses.htm", "passage_text": "The tiniest breeds include the Falabella and the Miniature Horse. Falabellas average 25 to 34 inches at the withers. However, there is no breed standard for height. Miniature Horses are divided into height divisions with the tallest being no more than 38 inches at the withers. Many Miniature Horses are distinctly pony-like, while others are more refined, like little horses. • Smallest Type of Equine. The smallest horses in the world are ponies. There are several breeds specifically developed for their diminutive size. Ponies are hardy, and they tend to be longer lived than their larger brethren."}, {"url": "http://horses.about.com/od/HorseMythsHistoryLegendsLore/tp/biggest-and-smallest-horses.htm", "passage_text": "The smallest equine individual is a Miniature Horse. Thumbelina is the current holder of the smallest equine in the world record. She was foaled in 2006 and is 17.5 inches (44.5 cm) at the withers. Thumbelina shows the features of dwarfism in animals. • Smallest Type of Equine. The smallest horses in the world are ponies. There are several breeds specifically developed for their diminutive size. Ponies are hardy, and they tend to be longer lived than their larger brethren."}, {"url": "https://en.wikipedia.org/wiki/Falabella", "passage_text": "The Falabella miniature horse is one of the smallest breeds of horse in the world, seldom taller than 8 hands (32 inches, 81 cm) in height at the withers. The Falabella, despite its size, is not considered a pony, but rather is a miniature horse. Black or red leopard-spotted Falabellas (resembling, but not the same as the Appaloosa horse breed) also exist, but are not common. Falabella foals are very small, standing around 30 to 56 cm (12 to 22 in) tall at birth, and maturing to their adult height by the age of three."}, {"url": "http://www.answers.com/Q/What_is_the_smallest_pony_breed", "passage_text": "believe it or not, the smallest breed of equine in the world is NOT a shetland. it is a Falabella pony. it is the smallest and the rarest breed. it was originated in argentina … . they are not strong enough to ride, considering their small size. they are so tiny that you can keep one in your backyard! some large dog collars would A dog collar would fit on one! check out some pics! The world's smallest pony in history is named Thumbelina. She is 17 inches tall and was awarded the Guinness Book of World Records as the World's smallest horse."}, {"url": "https://en.wikipedia.org/wiki/Miniature_horse", "passage_text": "While miniature horses are the size of a very small pony, many retain horse characteristics and are considered horses by their respective registries. They have various colors and coat patterns. The designation of miniature horse is determined by the height of the animal, which, depending on the particular breed registry involved, is usually less than 34–38 inches (86–97 cm) as measured at the last hairs of the mane, which are found at the withers."}, {"url": "https://en.wikipedia.org/wiki/Falabella", "passage_text": "Average breed heights for a fully-grown Falabella today are between 71 and 86 cm (28 and 34 in). The breed is proportioned similarly to horses, other than in size. They are similar to Thoroughbreds or Arabs in their conformation, with a sleek coat and a slim frame. Black or red leopard-spotted Falabellas (resembling, but not the same as the Appaloosa horse breed) also exist, but are not common. Falabella foals are very small, standing around 30 to 56 cm (12 to 22 in) tall at birth, and maturing to their adult height by the age of three."}]