[{"url": "http://www.medilexicon.com/medicaldictionary.php?t=7584", "passage_text": "ankle arthrodesis. Definitions: 1. fusion between the distal tibia and talus. The definition information for ankle arthrodesis is provided by Stedman's. You can search our medical dictionary here. Stedman's, part of Lippincott Williams & Wilkins, provides a comprehensive line of health-science publications for healthcare professionals and medical student"}, {"url": "http://www.medilexicon.com/medicaldictionary.php?t=7583", "passage_text": "arthrodesis. Definitions: 1. The stiffening of a joint by operative means. Synonyms: artificial ankylosis. The definition information for arthrodesis is provided by Stedman's. You can search our medical dictionary here. Stedman's, part of Lippincott Williams & Wilkins, provides a comprehensive line of health-science publications for healthcare professionals and medical students."}, {"url": "http://www.answers.com/Q/What_is_the_Medical_term_meaning_surgical_fixation_or_stiffening_of_a_joint", "passage_text": "Arthrodesis is a surgical procedure that stiffens a joint or joins spinal vertebrae. Arthrodesis means the fixation of a joint. The suffix-desis means surgical fixation of.. Joint fusion or arthrodesis is a method used for pain relief, regain stability and strength. The bones are aligned in the most functional position, but lose their natural motion."}, {"url": "http://www.merriam-webster.com/dictionary/arthrodesis", "passage_text": "Medical Definition of ARTHRODESIS. : the surgical immobilization of a joint so that the bones grow solidly together: artificial ankylosis. : the surgical immobilization of a joint so that the bones grow solidly together. ADVERTISEMENT."}, {"url": "http://www.spine-health.com/glossary/arthrodesis", "passage_text": "In surgery, arthrodesis, or fusion between two vertebrae, can be achieved by placing bone graft and/or bone graft substitute to bridge the vertebrae so that new bone grows into the spaces. Arthrodesis immobilizes the joints at the level of the fusion. "}, {"url": "http://www.merriam-webster.com/dictionary/arthrodesis", "passage_text": "Definition of ARTHRODESIS. : the surgical immobilization of a joint so that the bones grow solidly together. ADVERTISEMENT."}, {"url": "http://medical-dictionary.thefreedictionary.com/arthrodesis", "passage_text": "[arthro- + G. desis, a binding together]. /ar·thro·de·sis/ (-de´sis) the surgical fixation of a joint by a procedure designed to accomplish fusion of the joint surfaces by promoting the proliferation of bone cells; called also artificial ankylosis. Joints are denuded of cartilage, then shaped to conform to each other at the optimal angle; bone grafting is often used, as is some form of fixation, either internal (screws, rods, plates) or external (e.g., with a cast or external fixator)."}, {"url": "http://www.webmd.com/back-pain/spinal-fusion-arthrodesis", "passage_text": "Lumbar spinal fusion is surgery to join, or fuse, two or more vertebrae in the low back. Spinal fusion is major surgery, usually lasting several hours. There are different methods of spinal fusion. 1  Bone is taken from the pelvic bone or from a bone bank. "}]