[{"url": "http://www.definitions.net/definition/exasperating", "passage_text": "exasperating, infuriating, maddening, vexing (adj). extremely annoying or displeasing. his cavelier curtness of manner was exasperating; I've had an exasperating day; her infuriating indifference; the ceaseless tumult of the jukebox was maddening. "}, {"url": "http://www.freedictionary.org/?Query=Exasperating", "passage_text": "& vb. n. Exasperating.] 1. To irritate in a high degree; to provoke; to enrage; to excite or to inflame the anger of; as, to exasperate a person or his feelings. [1913 Webster] To exsasperate them against the king of France. --Addison. [1913 Webster] 2."}, {"url": "http://www.merriam-webster.com/dictionary/exasperate", "passage_text": "Synonym Discussion of EXASPERATE. irritate, exasperate, nettle, provoke, rile, peeve mean to excite a feeling of anger or annoyance. irritate implies an often gradual arousing of angry feelings that may range from mere impatience to rage. exasperate suggests galling annoyance and the arousing of extreme impatience. nettle suggests a sharp but passing annoyance or stinging. provoke implies an arousing of strong annoyance that may excite to action. rile implies inducing an angry or resentful agitation. peeve suggests arousing fretful often petty or querulous irritation"}, {"url": "http://www.merriam-webster.com/dictionary/exasperate", "passage_text": "Full Definition of EXASPERATE. transitive verb. 1. a: to excite the anger of: enrage b: to cause irritation or annoyance to. 2. obsolete: to make more grievous: aggravate. — ex·as·per·at·ed·ly adverb. — ex·as·per·at·ing·ly \\-ˌrā-tiŋ-lē\\ adverb. exasperate suggests galling annoyance and the arousing of extreme impatience. nettle suggests a sharp but passing annoyance or stinging. provoke implies an arousing of strong annoyance that may excite to action."}, {"url": "http://www.freedictionary.org/?Query=Exasperating", "passage_text": "[syn: exasperating, infuriating, maddening, vexing]2. making worse; [syn: aggravating, exacerbating, exasperating] The Collaborative International Dictionary of English v.0.48:Exasperate \\Ex*asper*ate\\, v. t. [imp. Exasperating.] 1. To irritate in a high degree; to provoke; to enrage; to excite or to inflame the anger of; as, to exasperate a person or his feelings. [1913 Webster] To exsasperate them against the king of France. --Addison. [1913 Webster] 2."}, {"url": "http://www.thefreedictionary.com/exasperating", "passage_text": "1. exasperating-extremely annoying or displeasing; his cavelier curtness of manner was exasperating; I've had an exasperating day; her infuriating indifference; the ceaseless tumult of the jukebox was maddening. infuriating, maddening, vexing. displeasing-causing displeasure or lacking pleasing qualities. ex·as·per·ate. tr.v. ex·as·per·at·ed, ex·as·per·at·ing, ex·as·per·ates. 1. To make very angry or impatient; annoy greatly. 2. To increase the gravity or intensity of: a scene ... that exasperates his rose fever and makes him sneeze (Samuel Beckett). [Latin. : , intensive pref."}, {"url": "http://www.thefreedictionary.com/exasperating", "passage_text": "exasperating. adjective irritating, provoking, annoying, infuriating, aggravating (informal), galling, maddening, vexing, irksome, enough to drive you up the wall (informal), enough to try the patience of a saint He is a very exasperating man to work with. Translations. ex·as·per·ate. tr.v. ex·as·per·at·ed, ex·as·per·at·ing, ex·as·per·ates. 1. To make very angry or impatient; annoy greatly. 2. To increase the gravity or intensity of: a scene ... that exasperates his rose fever and makes him sneeze (Samuel Beckett). [Latin. : , intensive pref."}, {"url": "http://www.macmillandictionary.com/dictionary/british/exasperating", "passage_text": "Blog. A must for anyone with an interest in the changing face of language. The Macmillan Dictionary blog explores English as it is spoken around the world today. Definition and synonyms of exasperating from the online English dictionary from Macmillan Publishers Limited. 90% of the time, speakers of English use just 7,500 words in speech and writing. These words appear in red, and are graded with stars. One-star words are frequent, two-star words are more frequent, and three-star words are the most frequent. Close."}]