[{"url": "http://www.thefreedictionary.com/volcano", "passage_text": "1. An opening in the Earth's crust from which lava, ash, and hot gases flow or are thrown out during an eruption. 2. A usually cone-shaped mountain formed by the materials that flowed or were thrown out from such an opening. See more at tectonic boundary. Noun. 1. volcano-a fissure in the earth's crust (or in the surface of some other planet) through which molten lava and gases erupt. vent. crack, scissure, cleft, crevice, fissure-a long narrow opening."}, {"url": "http://encyclopedia2.thefreedictionary.com/Volcano+(geological+landform)", "passage_text": "volcano. vents or fissures in the earth's crust through which gases, molten rock, or lava lava, molten rock that erupts on the earth's surface, either on land or under the ocean, by a volcano or through a fissure. It solidifies into igneous rock that is also called lava...... Click the link for more information"}, {"url": "http://www.landforms.eu/Lothian/volcanic%20neck.htm", "passage_text": "Volcanic neck. Definition: a hill resulting from differential weathering and erosion between the former feeder tube of a volcano and its surrounding rocks. A volcanic plug, also called a volcanic neck or lava neck, is a volcanic landform created when lava hardens within a vent on an active volcano. When forming, a plug can cause an extreme build-up of pressure if volatile-charged magma is trapped beneath it, and this can sometimes lead to an explosive eruption"}, {"url": "http://www.thefreedictionary.com/Volcano+(geological+landform)", "passage_text": "1. a. An opening in the earth's crust from which lava, ash, and hot gases flow or are ejected during an eruption. b. A similar opening on the surface of another celestial object. 2. A usually cone-shaped mountain formed from the materials issuing from such an opening. An opening in the Earth's crust from which lava, ash, and hot gases flow or are thrown out during an eruption. 2. A usually cone-shaped mountain formed by the materials that flowed or were thrown out from such an opening. See more at tectonic boundary."}, {"url": "http://www.thefreedictionary.com/Volcano+(geological+landform)", "passage_text": "Volcano (geological landform) - definition of Volcano (geological landform) by The Free Dictionary. An opening in the Earth's crust from which lava, ash, and hot gases flow or are thrown out during an eruption. 2. A usually cone-shaped mountain formed by the materials that flowed or were thrown out from such an opening. See more at tectonic boundary."}, {"url": "http://www.thefreedictionary.com/volcano", "passage_text": "An opening in the earth's crust from which lava, ash, and hot gases flow or are ejected during an eruption. b. A similar opening on the surface of another celestial object. 2. A usually cone-shaped mountain formed from the materials issuing from such an opening. Noun. 1. volcano-a fissure in the earth's crust (or in the surface of some other planet) through which molten lava and gases erupt. vent. crack, scissure, cleft, crevice, fissure-a long narrow opening."}, {"url": "http://worldlandforms.com/landforms/volcano/", "passage_text": "There are volcanoes all over the world. They are above sea level and below the oceans. What a volcano actually is a hole in the Earth’s crust that lava and other Earth debris come out of a lot of the. time or even hundreds of years apart. A lot of volcanoes are in a form of a mountain or a hill that have a crater from past eruptions. Many times, before an eruption, there is activity in the Earth’s surface that make the ground shake or even the crater in the volcano grow. Scientists are getting better at predicting eruptions. This can save many lives. "}, {"url": "http://www.tulane.edu/~sanelson/Natural_Disasters/volclandforms.htm", "passage_text": "Volcanic Landforms. Volcanic landforms are controlled by the geological processes that form them and act on them after they have formed. Thus, a given volcanic landform will be characteristic of the types of material it is made of, which in turn depends on the prior eruptive behavior of the volcano. "}, {"url": "http://www.thefreedictionary.com/Volcano+(geological+landform)", "passage_text": "1. An opening in the Earth's crust from which lava, ash, and hot gases flow or are thrown out during an eruption. 2. A usually cone-shaped mountain formed by the materials that flowed or were thrown out from such an opening. See more at tectonic boundary."}]