[{"url": "http://www.progressivehealth.com/vitiligo-ginkgo.htm", "passage_text": "Ginkgo For Vitiligo Vitiligo may be a non-communicable and cosmetic skin condition but it can cause self-loathing and depression fueled by social rejection. Therefore, the best time to treat this condition is as early as possible. Ginkgo biloba is one of the oldest species of trees known. Also known as the maidenhair tree, ginkgo is native to Asia especially China where it has been extensively cultivated for centuries mainly for its culinary and medicinal benefits."}, {"url": "http://www.stylecraze.com/articles/benefits-of-gingko-biloba-for-skin-hair-and-health/", "passage_text": "5. Ginkgo Biloba extracts are used in hair oils and hair packs to make the hair strong and long. It is also used in hair treatments to make the hair healthy and shiny. It is usually used in combination with coconut oil, Grapeseed oil or jojoba oil. Promotes Hair Growth: Ginkgo Biloba extracts are used in hair oils and hair packs to make the hair strong and long. It is also used in hair treatments to make the hair healthy and shiny."}, {"url": "http://www.paulaschoice.com/cosmetic-ingredient-dictionary/definition/ginkgo-biloba-leaf-extract", "passage_text": "[1,2,3]. Applied topically, ginkgo leaf is a good antioxidant because it is a rich source of flavonoids. This plant extract also has antibacterial and antifungal effects. Other research has shown that ginkgo leaf can help protect skin from redness and inflammation during exposure to UVA/UVB light in a lab setting. "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-333-GINKGO.aspx?activeIngredientId=333&activeIngredientName=GINKGO", "passage_text": "Ginkgo fruit and pulp can cause severe allergic skin reactions and irritation of mucous membranes. Ginkgo might cause an allergic reaction in people who are allergic to poison ivy, poison oak, poison sumac, mango rind, or cashew shell oil. "}, {"url": "http://www.webmd.com/mental-health/tc/ginkgo-biloba-topic-overview", "passage_text": "Ginkgo extract, from the leaves of the Ginkgo biloba tree, has been used for thousands of years in traditional Chinese medicine. It also is the most commonly used herbal medicine in Europe. Although the benefits of ginkgo are not entirely understood, it is known that ginkgo has properties that may help some conditions. Some people use ginkgo to help with: 1  Blood flow disorders (circulatory disorders), such as thrombophlebitis, Raynaud's phenomenon, and peripheral arterial disease. 2  Asthma and allergies. 3  Mental decline (dementia). 4  Memory and concentration problems, anxiety, stress, and mood problem"}, {"url": "http://www.annmariegianni.com/ingredient-showcase-ginkgo-biloba-the-new-anti-aging-herb/", "passage_text": "no comments. Ginkgo biloba is a popular herb, with a reputation for improving memory and blood flow. Lately, however, we’ve discovered that it also may have benefits in skin care products. You’ll find ginkgo in my Anti-Aging Facial Oil, Serum, and Eye Cream. Extracts from ginkgo leaves have also shown anti-inflammatory properties, which could help reduce the occurrence of acne and other skin concerns like rosacea and eczema. Taken orally, ginkgo was also shown in one study to enhance the skin’s ability to produce fibroblasts, which are responsible for collagen production."}, {"url": "https://en.wikipedia.org/wiki/Gingko_biloba", "passage_text": "Ginkgo biloba, known as ginkgo or gingko and also as the maidenhair tree, is the only living species in the division Ginkgophyta, all others being extinct. It is recognizably similar to fossils dating back 270 million years. Native to China, the tree is widely cultivated and was introduced early to human history. "}, {"url": "http://www.stylecraze.com/articles/benefits-of-gingko-biloba-for-skin-hair-and-health/", "passage_text": "Ginkgo Biloba, also known as Maidenhair, was the first among those plants whose medicinal value was discovered by the ancient Chinese. Later, its usage became popular in Europe, Germany and other parts of the world. Ginkgo Biloba herb extracts are used for their medicinal and cosmetic value. The herb is transformed into tablets, capsules and teas after which it is extensively used. These have become extremely popular in recent times because of the discovery of its various uses and advantages. Promotes Hair Growth: Ginkgo Biloba extracts are used in hair oils and hair packs to make the hair strong and long. It is also used in hair treatments to make the hair healthy and shiny. It is usually used in combination with coconut oil, Grapeseed oil or jojoba oil"}]