[{"url": "http://www.numbershelpline.co.uk/ee-customer-service-number/", "passage_text": "Queries regarding Roaming with EE. Using your phone abroad is easy with EE. Call the EE Customer Services contact number now on 0843 506 8881, to find out more about the charges and your allowance whilst roaming abroad. Also find out more about specific charges for ringing or SMS messaging whilst in a particular country. Call the EE helpline now to find out more on. EE and the use of a Parental lock. EE now offer a service, which provides peace of mind for parents with children using EE. Use of the Parental lock, ensures safety for the younger generation when having access to the Internet."}, {"url": "http://contactnumbers.guru/ee/", "passage_text": "The EE customer service helpline is available weekdays 8am-10pm and weekends 8am-8pm – ideal if you’re having trouble with your EE connectivity and want to complain, or need to contact someone about your contract for any other reason. Exiting customers. All EE customers are welcome to contact the central customer service team on 0843 504 7167 or 07953 966 250. Orange ‘Pay As You Go’ customers will get the most efficient response by calling their dedicated customer service team on 07973 100 450."}, {"url": "http://www.info-no.co.uk/EE.html", "passage_text": "Call costs £1.5 per minute with a £1.5 connection charge plus your phone company´s access charge. The contact details you require can be found free of charge on the EE website here We are an unofficial service and we have not connection with EE. "}, {"url": "http://www.fixithere.net/ee-broadband-customer-service/", "passage_text": "EE Customer Service Number 0844 381 22 200. If you do not want to contact EE over the telephone, you can take the help of EE internet based services. The EE website comprises of all information, and offers the ways to talk with an executive of the EE customer services team. This can be one of the best methods to get the assistance you need. The number – 0844 381 22200 is a direct contact to EE. ee broadband contact number, ee customer service, ee contact number, ee customer service contact number, ee customer service helpline, ee customer care number."}, {"url": "http://www.fixithere.net/ee-broadband-customer-service/", "passage_text": "Regarding using your EE phone abroad, you can call the EE customer service contact number on 0844 381 22200. Here you can easily enquire about the charges while roaming abroad. You can discuss about specific charges for SMS messaging or voice calls while roaming in a particular country. The number – 0844 381 22200 is a direct contact to EE. ee broadband contact number, ee customer service, ee contact number, ee customer service contact number, ee customer service helpline, ee customer care number."}, {"url": "http://www.contacttelephonenumbers.com/ee-contact-telephone-number/", "passage_text": "EE Customer Service Number 0844 381 6301. If you would rather not contact EE over the telephone, you can use their internet based services. On the EE website there is information regarding different ways to speak with a member of the EE customer services department, the internet based ones will be hyperlinked. Whether you work the stereotypical working week or you are busy at the weekends, you can call the EE customer services team on 0844 381 6301. The EE contact number is available to be called 24 hours a day, but please be aware that the customer advisors are not available 24 hours a day."}, {"url": "http://www.callcentrenumbers.co.uk/ee-contact-number/", "passage_text": "You can visit the EE website on www.ee.co.uk to contact them directly for any of the below; Upgrade Upgrade your handset to the latest handsets and 4G handsets available in the market. Iphone, Samsung, Galaxy Note, Sony Xperia, Nokia Lumia, Blackberry Q5. Using your phone abroad. Contact EE for advice on how to prepare your phone when travelling outside of the UK. Contact EE and the team to be advised on roaming charges abroad, using data, collecting email and accessing your voicemails. Discuss the additional roaming bolt-ons available to you and your tariff."}, {"url": "http://www.contacttelephonenumbers.com/ee-contact-telephone-number/", "passage_text": "Callers must be over the age of 18. To contact the EE customer services department call the EE telephone number that is listed on this website. 0844 381 6301 is a direct connection to EE. Whenever you need to call ee mobile, you can do so by calling the number listed here. Whether you work the stereotypical working week or you are busy at the weekends, you can call the EE customer services team on 0844 381 6301. The EE contact number is available to be called 24 hours a day, but please be aware that the customer advisors are not available 24 hours a day."}]