[{"url": "http://www.healthline.com/health/anal-fissure", "passage_text": "Overview. An anal fissure is a small cut or tear in the skin lining the anus. Childbirth, straining during bowel movements, or bouts of constipation or diarrhea can all tear the anal lining. Anal fissures are usually not a cause for concern and most heal without any medical treatment. "}, {"url": "https://en.wikipedia.org/wiki/Anal_fissure", "passage_text": "An anal fissure or rectal fissure is a break or tear in the skin of the anal canal. Anal fissures may be noticed by bright red anal bleeding on toilet paper, sometimes in the toilet. If acute they may cause pain after defecation but with chronic fissures pain intensity is often less. "}, {"url": "http://www.medicinenet.com/anal_fissure/article.htm", "passage_text": "An anal fissure is a cut or tear occurring in the anus (the opening through which stool passes out of the body) that extends upwards into the anal canal. Fissures are a common condition of the anus and anal canal and are responsible for 6% to 15% of the visits to a colon and rectal (colorectal) surgeon. They affect men and women equally and both the young and the old. Fissures usually cause pain during bowel movements that often is severe"}, {"url": "http://www.medicinenet.com/anal_fissure/page2.htm", "passage_text": "Anal fissures are caused by trauma to the anus and anal canal. The cause of the trauma usually is a bowel movement, and many people can remember the exact bowel movement during which their pain began. The fissure may be caused by a hard stool or repeated episodes of diarrhea. "}, {"url": "http://www.nhs.uk/Conditions/Anal-fissure/Pages/Introduction.aspx", "passage_text": "Introduction. An anal fissure is a tear or ulcer (open sore) that develops in the lining of the anal canal. The anal canal is the last part of your large intestine, located between your rectum (where stools are stored) and the opening in your bottom through which you pass stools. Anal fissures are most commonly caused by damage to the lining of the anus or anal canal. Most cases occur in people who have constipation, when a particularly hard or large stool tears the lining of the anal canal. Other possible causes of anal fissures include: 1  persistent diarrhoea"}, {"url": "http://www.medicinenet.com/anal_fissure/article.htm", "passage_text": "Anal fissures occur in the specialized tissue that lines the anus and anal canal, called anoderm. At a line just inside the anus (referred to as the anal verge or intersphincteric groove) the skin (dermis) of the inner buttocks changes to anoderm. Fissures are a common condition of the anus and anal canal and are responsible for 6% to 15% of the visits to a colon and rectal (colorectal) surgeon. They affect men and women equally and both the young and the old."}, {"url": "http://www.webmd.com/digestive-disorders/tc/anal-fissure-topic-overview", "passage_text": "Anal fissures don't lead to more serious problems. Most anal fissures heal with home treatment after a few days or weeks. These are called short-term (acute) anal fissures. If you have an anal fissure that hasn't healed after 8 to 12 weeks, it is considered a long-term (chronic) fissure. A chronic fissure may need medical treatment. Anal fissures are a common problem."}, {"url": "http://www.healthgrades.com/conditions/anal-fissure", "passage_text": "An anal fissure is a small tear or split in the lining of the anal canal. Anal fissures are common among infants, but they can occur at any age. Anal fissures are also common among women who have recently given birth and people who have inflammatory bowel disease. "}, {"url": "https://www.fascrs.org/patients/disease-condition/anal-fissure", "passage_text": "An anal fissure (fissure-in-ano) is a small, oval shaped tear in skin that lines the opening of the anus. Fissures typically cause severe pain and bleeding with bowel movements. Fissures are quite common in the general population, but are often confused with other causes of pain and bleeding, such as hemorrhoids. The typical symptoms of an anal fissure include severe pain during, and especially after, a bowel movement, lasting from several minutes to a few hours. Patients may also notice bright red blood from the anus that can be seen on the toilet paper or on the stool."}]