[{"url": "http://www.collinsdictionary.com/dictionary/english/cfc", "passage_text": "Translations for 'CFC'. 1  British English: CFC CFCs are gases that are used in things such as aerosols and refrigerators and can cause damage to the ozone layer. 2  NOUN...the continued drop in CFC emissions. 3  Brazilian Portuguese: CFC. 4  Chinese 5  : European Spanish: CFC. Translations for 'CFC'. 1  British English: CFC CFCs are gases that are used in things such as aerosols and refrigerators and can cause damage to the ozone layer. 2  Brazilian Portuguese: CFC. 3  Chinese 4  : European Spanish: CFC. 5  French: CFC. 6  German: FCKW. 7  Italian: CFC. 8  Japanese: フロン. 9  Korean: 염화불화탄소. 10  Portuguese: CFC. 11 "}, {"url": "https://en.wikipedia.org/wiki/Chlorofluorocarbon", "passage_text": "As in simpler alkanes, carbon in the CFCs and the HCFCs is tetrahedral. Because the fluorine and chlorine atoms differ greatly in size and effective charge from hydrogen and from each other, the methane-derived CFCs deviate from perfect tetrahedral symmetry. Once the partial pressure of the CFC (or SF 6) is derived, it is then compared to the atmospheric time histories for CFC-11, CFC-12, or SF 6 in which the pCFC directly corresponds to the year with the same measurement."}, {"url": "http://www.merriam-webster.com/dictionary/chlorofluorocarbon", "passage_text": ": any of several simple gaseous compounds that contain carbon, chlorine, fluorine, and sometimes hydrogen, that are used as refrigerants, cleaning solvents, and aerosol propellants and in the manufacture of plastic foams, and that are believed to be a major cause of stratospheric ozone depletion —abbreviation CFC. : a gas that was once commonly used in various products (such as aerosols) but that is believed to cause damage to the ozone layer in the Earth's atmosphere."}, {"url": "https://en.wikipedia.org/wiki/Chlorofluorocarbon", "passage_text": "A chlorofluorocarbon (CFC) is an organic compound that contains only carbon, chlorine, and fluorine, produced as a volatile derivative of methane, ethane, and propane. They are also commonly known by the DuPont brand name Freon. The most common representative is dichlorodifluoromethane (R-12 or Freon-12). Once the partial pressure of the CFC (or SF 6) is derived, it is then compared to the atmospheric time histories for CFC-11, CFC-12, or SF 6 in which the pCFC directly corresponds to the year with the same measurement."}, {"url": "http://www.thefreedictionary.com/chlorofluorocarbon", "passage_text": "chlorofluorocarbon. n. 1. (Chemistry) chem any of various gaseous compounds of carbon, hydrogen, chlorine, and fluorine, used as refrigerants, aerosol propellants, solvents, and in foam: some cause a breakdown of ozone in the earth's atmosphere. Abbreviation: CFC. HCFC, hydrochlorofluorocarbon-a fluorocarbon that is replacing chlorofluorocarbon as a refrigerant and propellant in aerosol cans; considered to be somewhat less destructive to the atmosphere. pollutant-waste matter that contaminates the water or air or soil."}, {"url": "http://www.thefreedictionary.com/Chlorofluorocarbons", "passage_text": "1. (CFCs) Compounds of chlorine and fluorine once much used as aerosol propellants and refrigerants, and in foam packaging; now known to deplete the ozone layer and act as greenhouse gases. 2. Compounds formed when some or all of the hydrogen atoms in a hydrocarbon have been replaced with chlorine and fluorine. "}, {"url": "http://www.audioenglish.org/dictionary/chlorofluorocarbon.htm", "passage_text": "The noun CHLOROFLUOROCARBON has 1 sense: 1. a fluorocarbon with chlorine; formerly used as a refrigerant and as a propellant in aerosol cans. Familiarity information: CHLOROFLUOROCARBON used as a noun is very rare. Hyponyms (each of the following is a kind of chlorofluorocarbon): HCFC; hydrochlorofluorocarbon (a fluorocarbon that is replacing chlorofluorocarbon as a refrigerant and propellant in aerosol cans; considered to be somewhat less destructive to the atmosphere)."}, {"url": "http://www.merriam-webster.com/dictionary/chlorofluorocarbon", "passage_text": "chlorofluorocarbon. noun chlo·ro·fluo·ro·car·bon \\ˌklȯr-ō-ˌflȯr-ō-ˈkaer-ˈkär, -bən-\\. ˌflu̇r. : tweet a gas that was once commonly used in various (products such as) aerosols but that is believed to cause damage to the ozone layer in The'earth s. atmosphere : a gas that was once commonly used in various products (such as aerosols) but that is believed to cause damage to the ozone layer in the Earth's atmosphere."}, {"url": "http://www.collinsdictionary.com/dictionary/english/cfc", "passage_text": "1 British English: CFC CFCs are gases that are used in things such as aerosols and refrigerators and can cause damage to the ozone layer. 2  NOUN...the continued drop in CFC emissions. Translations for 'CFC'. 1  British English: CFC CFCs are gases that are used in things such as aerosols and refrigerators and can cause damage to the ozone layer. 2  Brazilian Portuguese: CFC. 3  Chinese 4  : European Spanish: CFC. 5  French: CFC. 6  German: FCKW. 7  Italian: CFC. 8  Japanese: フロン. 9  Korean: 염화불화탄소. 10  Portuguese: CFC. 11 "}, {"url": "http://www.oxforddictionaries.com/definition/english/chlorofluorocarbon", "passage_text": "Any of a class of compounds of carbon, hydrogen, chlorine, and fluorine, typically gases used in refrigerants and aerosol propellants. They are harmful to the ozone layer in the earth’s atmosphere owing to the release of chlorine atoms on exposure to ultraviolet radiation. We use cookies to enhance your experience on our website. By continuing to use our website, you are agreeing to our use of cookies."}]