[{"url": "http://www.ewg.org/skindeep/ingredient/701120/CARMINE/", "passage_text": "read more. About CARMINE: Carmine is a red pigment/dye derived from insects native to South America and Mexico that live as parasites on cactus plants. Used as a colorant in food, cosmetics and textiles. Has been associated with severe allergic reactions. "}, {"url": "http://www.truenatural.com/glossary/entry/carmine/", "passage_text": "Carmine. What: Carmine (CI 75470) is an aluminum and calcium salt of carminic acid. It is one of the most ancient natural dyes, derived from the shells of the female insect Coccus Cacti. It is commonly used to achieve bright reds and pinks in lipsticks. "}, {"url": "http://www.sterlingminerals.com/is-carmine-used-in-your-mineral-makeup-or-lipstick/", "passage_text": "Carmine Is The Icky Ingredient. Carmine is not a colorant we choose to use to achieve our red or pink shades in our mineral makeup products or lipsticks and lip shine. Only iron oxides are used to achieve our lovely mineral makeup foundations, bronzer, blush and lip colors. The truth is, the origin of this shade comes from the Cochineal beetle which is crushed to create the vivid red color that we find in Popsicles, gelatin, fruit drinks, cosmetics, processed foods, lollipops, etc"}, {"url": "http://www.cosmeticsinfo.org/ingredient/carmine", "passage_text": "Carmine is a bright red pigment made from cochineal. In cosmetics and personal care products, Carmine is used in the formulation of a wide variety of product types, including make up and nail polish. Carmine is the aluminum lake of the coloring agent, cochineal, a natural pigment derived from the dried female insect Coccus cacti (cochineal). In addition to its use in cosmetics and personal care products. Carmine is used as a food coloring and may often be found in juice, yogurt and candy. Safety Information:"}, {"url": "http://www.youtube.com/watch?v=eQgZm_q7EgM", "passage_text": "Carmine, or cochineal is a beetle found in South America. The female has been used for thousands of years by the ancient Mayans to create a red dye. These beetles live as parasites on the prickly pear cactus in South America. Their coloring is used for food dyes and even makeup. Carmine is not known to be toxic. However, there are a few things you wan to keep in mind before purchasing a product that contains Carmine. 1. Carmine is an insect, so if you're vegan you definitely don't want to purchase any products containing carmine"}, {"url": "https://en.wikipedia.org/wiki/Carmine", "passage_text": "Carmine. Carmine. Carmine (/ˈkɑrmɪn/ or /ˈkɑrmaɪn/), also called crimson lake, cochineal, natural red 4, C.I. 75470, or E120, is a pigment of a bright-red color obtained from the aluminium salt of carminic acid; it is also a general term for a particularly deep-red color of the same name. Carmine is used as a food dye in many different products such as juices, ice cream, yogurt, and candy, and as a dye in cosmetic products such as eyeshadow and lipstick. Although principally a red dye, it is found in many foods that are shades of red, pink, and purple."}, {"url": "http://gentleworld.org/natural-colors-carmine-cochineal/", "passage_text": "The words Cochineal, Cochineal Extract, Carmine, Crimson Lake, Natural Red 4, C.I. 75470, E120, and even some ‘natural colorings’ refer to a dye called ‘carminic acid’, which is primarily used as a food coloring and in cosmetics. Carminic acid is a substance found in high concentration in cochineal insects."}, {"url": "http://www.cosmeticsinfo.org/ingredient/carmine", "passage_text": "Carmine imparts a red color to cosmetics and personal care products. Scientific Facts: Carmine is the aluminum lake of the coloring agent, cochineal, a natural pigment derived from the dried female insect Coccus cacti (cochineal). In addition to its use in cosmetics and personal care products. Carmine is used as a food coloring and may often be found in juice, yogurt and candy. Safety Information:"}, {"url": "https://en.wikipedia.org/wiki/Carmine", "passage_text": "Carmine is used in the manufacture of artificial flowers, paints, crimson ink, rouge, and other cosmetics, and is routinely added to food products such as yogurt, candy and certain brands of juice, the most notable ones being those of the ruby-red variety. Carmine is used as a food dye in many different products such as juices, ice cream, yogurt, and candy, and as a dye in cosmetic products such as eyeshadow and lipstick. Although principally a red dye, it is found in many foods that are shades of red, pink, and purple."}]