[{"url": "http://www.1800petmeds.com/education/life-expectancy-dog-cat-40.htm", "passage_text": "Pet Life Expectancy. We hope our pets will be a part of our lives for many, many years but the fact is that the average life expectancy is 10-12 years for dogs and 10-14 years for cats. Older pets have very specific needs and are particularly susceptible in later years to cancer, arthritis, and dental disease. "}, {"url": "http://www.vetinfo.com/indoor-outdoor-cat-life-expectancy.html", "passage_text": "Cats that spend time indoors only, will have a longer life. Indoor cats are less exposed to bacteria, diseases, traffic accidents or the danger of chewing on toxic plants. Indoor cats may live between 12 and 15 years of average. However, the record age of an indoors cat is 25. By the time the cat is 3 years old, his age is the equivalent of a 32 year old human. The following years will each count as 4 human years. So, a cat that lives to be 12 (which is the average cat life span), is like a 64"}, {"url": "https://en.wikipedia.org/wiki/Feral_cat", "passage_text": "These time spans compared favourably to the average lifespan of 7.1 years for pet cats reported in a 1984 study, and to the finding that only 42% of the pet cat population in the U.S. is more than 5 years old. Feral cats in managed colonies can live long lives. A number of cats in managed colonies in the U.K. died of old age. In the U.S., the last cat in a managed colony in Washington, D.C. died at age 17, and Zorro, the last cat of a colony at the Merrimack River in Newburyport, Massachusetts, died in 2009 at age 16."}, {"url": "http://www.vetinfo.com/average-cat-lifespan.html", "passage_text": "Cat lifespan varies from breed to breed; however, the average lifespan of a free-roaming cat is less than 3 years, whereas the lifespan of an indoor cat averages 15 to 18 years. Spayed and neutered cats live longer because they do not develop ovarian or testicular cancers. "}, {"url": "http://www.catster.com/lifestyle/how-long-do-cats-live-cat-health-facts", "passage_text": "Based on a survey of 10 reputable sites that discuss the average domestic cat, the numbers are more inconsistent, ranging from 10 to 20 years. The average domestic cat lifespan comes out to 15.1 years. Breed is certainly a factor. We could list out each breed, but then we’d be here forever. Here, we’re concerned, like Lord Chesterfield, with “the average cat.” On average, female cats live one to two years longer than male cats. On average, indoor cats live longer than outdoor cats. On average, wild, homeless, and feral cats live dramatically shorter lives than domestic cats."}, {"url": "http://www.second-chance.ws/petcare/ferals.pdf", "passage_text": "Thus, the average life span of a feral cat that survives beyond kittenhood is about two years for independent cats and five years for cats in a cat colony. In contrast, a cat that lives indoors under proper human care has a life expectancy of 15–22 years. Almost all cats that are left to survive outdoors will succumb to starvation, thirst, disease, parasites or predation. Another threat to the life of a feral cat is weather."}, {"url": "http://www.vetinfo.com/indoor-outdoor-cat-life-expectancy.html", "passage_text": "In addition, unexpected accidents may end an outdoor cat's life at any time. Stray and feral cats live significantly less. On average, a stray cat lives 5 years if he is in a community of cats and 2 to 3 years if he lives by himself. This is due to unbalanced nutrition and lack of veterinary treatment and vaccinations. In addition, feral cats may get killed while fighting other wild animals. By the time the cat is 3 years old, his age is the equivalent of a 32 year old human. The following years will each count as 4 human years. So, a cat that lives to be 12 (which is the average cat life span), is like a 64"}, {"url": "http://cats.about.com/cs/catmanagement101/f/lifespan_cats.htm", "passage_text": "A strong genetic background for longevity can't be discounted. Given proper care, nutrition, and regular veterinary visits, a cat kept indoors can live as long as 21 years or more. (The average age of cats is 12-15 years) This is, of course, barring any serious medical conditions or untimely accidents. "}, {"url": "http://www.forgottencats.org/feralcat.php", "passage_text": "Fact: Millions of feral cats are fed by kind people. Others find food for themselves. The average lifespan for a feral cat is estimated to be 10 years. Incidence of feline leukemia and FIV is no higher in feral cats than in owned cats. At Forgotten Cats, we see many outdoor cats. While a few of them lead hard lives, most of them are pleasantly plump and healthy! "}]