[{"url": "http://www.economywatch.com/fossil-fuels/theory.html", "passage_text": "According to the most common theory of fossil fuels, it is believed that these fuels were formed from the corpse of animals as well as plants that got buried under the earth's crust due to certain reasons. There are two different theories of fossil fuels that are known as Biogenic theory and Abiogenic theory. The fossil fuels are non-renewable sources of energy. These are actually hydrocarbons that remain inside the earth's crust. There are different types of fossil fuels like petroleum, methane, coal and so on. Some of these are made up of pure carbon and others are of low ratio of carbon and hydrogen."}, {"url": "http://environ.andrew.cmu.edu/m3/s3/all_ene_sys.htm", "passage_text": "Fossil fuels (coal, oil, gas) result from a transformation of plant and animal material over millions of years. The solar energy originally stored in the plant or animal is eventually converted into energy stored in carbon and hydrogen bonds of the fossil fuel. Electricity use for heating is on the rise; however, electricity is not a direct fuel source like the others in this figure. It is a form of energy. Different sources, such as coal and uranium, are used to generate electricity."}, {"url": "https://sg.answers.yahoo.com/question/index?qid=20071111025315AArX8cg", "passage_text": "Petroleum, natural gas, and coal are the main sources of energy for modern use. All of these fuels are classified as fossil fuels. The reason they are called fossil fuels is because they are all made from decayed plants and animals that have been preserved in the earth's crust by pressure, bacterial processes and heat. It takes millions of years for these organisms to chemically change into fossil fuels. It is generally accepted that they formed from the fossilized remains of dead plants and animals[1] by exposure to heat and pressure in the Earth's crust over hundreds of millions of years.[2] This is known as the biogenic theory and was first introduced by Mikhail Lomonosov in 1757."}, {"url": "https://en.wikipedia.org/wiki/Natural_gas", "passage_text": "Natural gas is a fossil fuel formed when layers of decomposing plant and animal matter are exposed to intense heat and pressure over thousands of years. The energy that the plants originally obtained from the sun is stored in the form of chemical bonds in natural gas. "}, {"url": "http://www.economywatch.com/fossil-fuels/theory.html", "passage_text": "According to the Biogenic theory that is put forward by a number of geologists, the formation of fossil fuels is caused by the heating and compression of the organic products for a long time. As per this theory, oil has been formed from the remains of the algae and zooplankton in the sea bed or lakes. The fossil fuels are non-renewable sources of energy. These are actually hydrocarbons that remain inside the earth's crust. There are different types of fossil fuels like petroleum, methane, coal and so on. Some of these are made up of pure carbon and others are of low ratio of carbon and hydrogen."}, {"url": "http://www.answers.com/Q/What_is_a_leading_theory_for_the_formation_of_fossil_fuels", "passage_text": "When the carbon in  the fuel is burnt with oxygen from the atmosphere, the energy that  was used in photosynthesis is released and carbon dioxide is  re-formed.    Coal, oil, and natural gas are fossil fuel. When they are used they  are gone forever. They are called non-renewable. Fossil fuel combustion results in the emission of carbon dioxide,  which is a heat trapping greenhouse gas.    Volcanic activity releases some hundred million tons o … f CO2 into  the atmosphere each year."}, {"url": "http://www.answers.com/Q/What_is_a_leading_theory_for_the_formation_of_fossil_fuels", "passage_text": "Fossil fuels are coal, oil and natural gas.    They are called fossil fuels because, like fossils, they were  formed a long time ago. Oil for example is a fossil fuel, … it was  formed millions of years ago as dead animals and plants died they  formed a layer of dead stuff. Fossil fuel combustion results in the emission of carbon dioxide,  which is a heat trapping greenhouse gas.    Volcanic activity releases some hundred million tons o … f CO2 into  the atmosphere each year."}, {"url": "http://www.answers.com/Q/What_is_a_leading_theory_for_the_formation_of_fossil_fuels", "passage_text": "A fossil fuel is any hydrocarbon that may be used as a source of  energy. Coal, oil and natural gas are the three basic fossil fuels,  formed 300 million years ago from orga … nic plant and animal life  subjected to great heat and pressure under the ground. Fossil fuel combustion results in the emission of carbon dioxide,  which is a heat trapping greenhouse gas.    Volcanic activity releases some hundred million tons o … f CO2 into  the atmosphere each year."}]