[{"url": "http://www.cdc.gov/arthritis/data_statistics/comorbidities.htm", "passage_text": "Conditions described as comorbidities are often chronic or long-term conditions. Other names to describe comorbid conditions are coexisting or co-occurring"}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2713155/", "passage_text": "Comorbidity is associated with worse health outcomes, more complex clinical management, and increased health care costs. There is no agreement, however, on the meaning of the term, and related constructs, such as multimorbidity, morbidity burden, and patient complexity, are not well conceptualized."}, {"url": "http://www.webmd.com/lung/copd/the-importance-of-comorbidities", "passage_text": "These other conditions are called comorbidities.. In recent years the link between COPD and these other conditions has attracted a great deal of attention. For some reason comorbid conditions seem to be more common in people with COPD than in patients with other medical problems."}, {"url": "http://www.cdc.gov/arthritis/data_statistics/comorbidities.htm", "passage_text": "The presence of comorbidities can also make disease management and treatment more complicated and more expensive. When arthritis is a comorbidity, particularly with diabetes 3 heart disease, 4 and obesity 5 it may impede efforts to be more physically active, which is an important part of disease management."}, {"url": "https://en.wikipedia.org/wiki/Comorbidity", "passage_text": "In medicine, comorbidity is the presence of one or more additional disorders (or diseases) co-occurring with a primary disease or disorder; or the effect of such additional disorders or diseases."}, {"url": "http://www.lungchicago.org/understanding-copd-comorbidities/", "passage_text": "Understanding COPD: Comorbidities. Comorbidities are two or more diseases existing at the same time in the body. They are common for people with COPD because organ systems work differently when they do not receive enough oxygen. When a resulting condition occurs, it can be considered comorbidity."}, {"url": "http://www.obesitycoverage.com/insurance-and-costs/pre-approval-process/comorbidities", "passage_text": "A comorbidity is a disease that is the result of, or strongly related to, a primary disease. As it applies to weight loss surgery, the disease is morbid obesity and the comorbidities are many. Morbid Obesity is a condition when you are severely overweight. Body Mass Index (BMI) is a calculation that uses your height and weight to create a standard measure of obesity."}]