[{"url": "http://medical-dictionary.thefreedictionary.com/normal+distribution", "passage_text": "gaussian distribution-Synonym(s): gaussian curve. graphical distribution of normal data, following a bell-shaped curve; the mean, median and mode all coincide at the central high point of the curve; 67% of data lie within ± 1 standard deviation (sd) of the spread of the sample data; 95% lie within ± 2 sds."}, {"url": "http://www.merriam-webster.com/dictionary/normal", "passage_text": "Synonym Discussion of NORMAL. regular, normal, typical, natural mean being of the sort or kind that is expected as usual, ordinary, or average. regular stresses conformity to a rule, standard, or pattern."}, {"url": "http://www.thefreedictionary.com/normal", "passage_text": "nor·mal. adj. 1. Conforming with, adhering to, or constituting a norm, standard, pattern, level, or type; typical: normal room temperature; one's normal weight; normal diplomatic relations. 2. Biology Functioning or occurring in a natural way; lacking observable abnormalities or deficiencies."}, {"url": "http://www.yourdictionary.com/normal", "passage_text": "adjective. 1  Conforming with, adhering to, or constituting a norm, standard, pattern, level, or type; typical: normal room temperature; one's normal weight; normal diplomatic relations. 2  Biology Functioning or occurring in a natural way; lacking observable abnormalities or deficiencies."}, {"url": "http://medical-dictionary.thefreedictionary.com/normal+distribution", "passage_text": "In a normal distribution, 68.2% of all scores cluster around the mean within approximately 1 standard deviation, 95.4% within approximately 2 standard deviations, and 99.7% within approximately 3 standard deviations."}, {"url": "http://www.thefreedictionary.com/normal", "passage_text": "1. Conforming with, adhering to, or constituting a norm, standard, pattern, level, or type; typical: normal room temperature; one's normal weight; normal diplomatic relations. 2. Biology Functioning or occurring in a natural way; lacking observable abnormalities or deficiencies."}, {"url": "http://medical-dictionary.thefreedictionary.com/normal+distribution", "passage_text": "The statistical distribution of members of a population around the population mean. In a gaussian distribution, 68.2% of values fall within ± 1 standard deviation (SD); 95.4% fall within ± 2 SD of the mean; and 99.7% fall within ± 3 SD of the mean. Synonym(s): bell-shaped curve, normal distribution. Johann K.F., German physicist, 1777-1855."}]