[{"url": "http://www.ncbi.nlm.nih.gov/books/NBK21650/", "passage_text": "E. coli Replication Origin. The E. coli replication origin oriC is an ≈240-bp DNA segment present at the start site for replication of E. coli chromosomal DNA. Plasmids or any other circular DNA containing oriC are capable of independent and controlled replication in E. coli cells. "}, {"url": "http://lifescience.biomedal.com/products/cloning-vector-and-strains/e-coli-strains/", "passage_text": "E. coli SM10 λpir strain. E. coli SM10 λpir strain contains the pir gene (lysogenized with λpir phage) and it is designed for cloning and propagation of plasmids with R6K origin of replication sequence (such as pUT mini-Tn5 vectors). E. coli DH5α λpir strain contains the pir gene (lysogenized lpir phage lysogen) and is designed for cloning and propagation of plasmids with R6K origin of replication sequence (like pUT"}, {"url": "http://www.bx.psu.edu/~ross/workmg/Replication2Ch6.htm", "passage_text": "The minimal fragment of E. coli DNA active in the above assay is referred to as oriC, for the origin of the E. coli chromosome. It is approximately 245 bp long, and contains 3 copies of a 13-mer repeat, 4 copies of a 9-mer repeat, and 11 GATC motifs (Fig. "}, {"url": "https://en.wikipedia.org/wiki/Origin_of_replication", "passage_text": "Many bacteria, including E. coli, contain plasmids that each contain an origin of replication. These are separate from the origins of replication that are used by the bacteria to copy their genome and often function very differently. The genome of E. coli consists of a single circular DNA molecule of approximately 4.6 x 10 6 nucleotide pairs. DNA replication typically begins at a single origin of replication. In E. coli, the origin of replication — oriC — consists of three A–T rich 13- mer repeats and four 9-mer repeats"}, {"url": "http://openwetware.org/wiki/Arking:JCAOligoTutorial8", "passage_text": "Origins of replication. Every plasmid has one essential feature: the origin of replication. To make a circular, double stranded DNA replicate in E. coli, the origin of replication is the only thing you need. If that’s all you have, you’d call the thing a “cryptic” plasmid—which just means it replicates in the cell but has no selectable marker."}, {"url": "https://en.wikipedia.org/wiki/Ori_(Genetics)", "passage_text": "(Redirected from Ori (Genetics)). Ori is the DNA sequence that signals for the origin of replication, sometimes referred to simply as origin. In E. coli, ori is some 250 nucleotides in length for the chromosomal origin (oriC). The plasmid ori sequences are similar to oriC. During conjugation, the rolling circle mode of replication starts at the oriT ('T' for transfer) sequence of the FAT plasmid. "}, {"url": "http://lifescience.biomedal.com/products/cloning-vector-and-strains/e-coli-strains/", "passage_text": "E. coli DH5α λpir strain. E. coli DH5α λpir strain contains the pir gene (lysogenized lpir phage lysogen) and is designed for cloning and propagation of plasmids with R6K origin of replication sequence (like pUTmini-Tn5 vectors)."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/370833", "passage_text": "Nucleotide sequence of the origin of replication of the Escherichia coli K-12 chromosome. Meijer M, Beck E, Hansen FG, Bergmans HE, Messer W, von Meyenburg K, Schaller H. The origin of replication, oriC, of the Escherichia coli chromosome was mapped within a DNA segment of 422 base pairs. The nucleotide sequence of this segment was determined. The nucleotide sequence of the replication origin is characterized by a high degree of repetitiveness due to both inverted and direct repeats. Sequence homologies were found between portions of the replication origins of E. coli and phages lambda and G4."}, {"url": "https://en.wikipedia.org/wiki/Origin_of_replication", "passage_text": "The origin of replication (also called the replication origin) is a particular sequence in a genome at which replication is initiated. This can either involve the replication of DNA in living organisms such as prokaryotes and eukaryotes, or that of DNA or RNA in viruses, such as double-stranded RNA viruses. The genome of E. coli consists of a single circular DNA molecule of approximately 4.6 x 10 6 nucleotide pairs. DNA replication typically begins at a single origin of replication. In E. coli, the origin of replication — oriC — consists of three A–T rich 13- mer repeats and four 9-mer repeat"}]