[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3534", "passage_text": "Galactose: A sugar found in milk. Galactose is a disaccharide that is made up of two sugars, galactose and glucose, that are bound together. "}, {"url": "https://en.wikipedia.org/wiki/Galactose", "passage_text": "Galactose (galacto- + -ose, milk sugar), sometimes abbreviated Gal, is a monosaccharide sugar that is less sweet than glucose and fructose. It is a C-4 epimer of glucose. Galactan is a polymer of the sugar galactose found in hemicellulose. Galactan can be converted to galactose by hydrolysis. Galactose is a monosaccharide. When combined with glucose (monosaccharide), through a condensation reaction, the result is the disaccharide lactose. The hydrolysis of lactose to glucose and galactose is catalyzed by the enzymes lactase and β-galactosidase. The latter is produced by the lac operon in Escherichia coli"}, {"url": "http://www.differencebetween.info/difference-between-glucose-and-galactose", "passage_text": "Galactose is a monosaccharide sugar that is less sweet compared to glucose. It is a C-4 epimer of glucose. Epimers are diastereomers that differ in configuration of only one stereogenic center. The galactose in the body is usually a result of a polymer galactin which converts into galactose through hydrolysis. It has four isomers and is a hexose monosaccharide. It differs from glucose due to the way the –OH is located in the fourth carbon. When combined with glucose, it forms disaccharide lactose."}, {"url": "http://www.tuscany-diet.net/carbohydrates/galactose/", "passage_text": "Fig. 1 – beta-D-Galactopyranose. Galactose, sometimes abbreviated Gal, is a monosaccharide and the C4 epimer of glucose, that is, they differ only for the position of the-OH group on C4 (axial in Gal, equatorial in glucose). It has a sweetness equal to 33% of sucrose. In hepatocytes, galactose enters the Leloir pathway. Freed from lactose, the monosaccharide is mostly present as beta-isomer, and the first step of its hepatic metabolism is the conversion to the alpha-isomer, in the reaction catalyzed by galactose mutarotase (also known as aldose 1-epimerase)."}, {"url": "http://www.tuscany-diet.net/carbohydrates/galactose/", "passage_text": "Fig. 1 – beta-D-Galactopyranose Galactose, sometimes abbreviated Gal, is a monosaccharide and the C4 epimer of glucose, that is, they differ only for the position of the-OH group on C4 (axial in Gal, equatorial in glucose). It has a sweetness equal to 33% of sucrose. In hepatocytes, galactose enters the Leloir pathway. Freed from lactose, the monosaccharide is mostly present as beta-isomer, and the first step of its hepatic metabolism is the conversion to the alpha-isomer, in the reaction catalyzed by galactose mutarotase (also known as aldose 1-epimerase)."}, {"url": "http://www.answers.com/Q/What_is_the_structure_of_galactose", "passage_text": "The structure of Galactose monosaccharide sugar is a normal chain of six carbon atoms. It is an isomer of Glucose and Fructose. Below is a structure of Galactose in open chain form: H-C=O. |. H-C-OH. |. OH-C-H. |. OH-C-H. H-C-OH. |. OH. To understand the pyranose ring form of Galactose, draw a hexagon, assume the joints as carbon atoms except one joint-that is an oxygen atom. Let the joints be A, B, C, D, E, F. To the joints A, C, D, E, F, assume them to be carbon atoms, and the joint B to be"}, {"url": "https://en.wikipedia.org/wiki/Lactose", "passage_text": "From Wikipedia, the free encyclopedia. Lactose is a disaccharide sugar derived from galactose and glucose that is found in milk. Lactose makes up around 2–8% of milk (by weight), although the amount varies among species and individuals, and milk with a reduced amount of lactose also exists. Lactose is a disaccharide derived from the condensation of galactose and glucose, which form a β-1→4 glycosidic linkage. Its systematic name is β-."}]