[{"url": "http://www.cyh.com/HealthTopics/HealthTopicDetails.aspx?p=114&np=303&id=1779", "passage_text": "Usually 1 - 3 days. 1  If conjunctivitis is due to a bacterial infection, it is contagious until the eyes are no longer red and there is no discharge (this may be after several days without treatment, or about 24 hours after starting effective treatment.). 1 If conjunctivitis is due to a bacterial infection, it is contagious until the eyes are no longer red and there is no discharge (this may be after several days without treatment, or about 24 hours after starting effective treatment.)."}, {"url": "http://kids.emedtv.com/pink-eye/how-long-is-pink-eye-contagious.html", "passage_text": "Pink eye is contagious for up to 14 days, in the case of viral conjunctivitis, and up to 24 hours after an antibiotic is started with bacterial conjunctivitis. Your healthcare provider will let you know which type of pink eye you or your child has and whether it is contagious. Once symptoms begin, a person with pink eye caused by a virus (viral conjunctivitis) or bacteria (bacterial conjunctivitis) is thought to be capable of spreading the infection."}, {"url": "http://www.eyehealthweb.com/pink-eye/", "passage_text": "Viral and bacterial conjunctivitis are the most common types of pink eye. The viral form is caused by the same virus as the common cold, and usually improves on its own over the course of seven to ten days. For the first ten days (or as long as there are symptoms), viral conjunctivitis is very contagious. "}, {"url": "http://www.allaboutvision.com/faq/pinkeye-duration.htm", "passage_text": "Pink eye also can be caused by bacterial conjunctivitis, which  even with treatment such as prescription antibiotic eye drops  can last up to a month or longer. However, with this type of pink eye, people should no longer be contagious 24 hours after antibiotic treatment begins. "}, {"url": "http://kids.emedtv.com/pink-eye/how-long-is-pink-eye-contagious.html", "passage_text": "People with this condition are contagious for up to 14 days, in the case of viral conjunctivitis, and up to 24 hours after an antibiotic is started with bacterial conjunctivitis. Both bacterial and viral conjunctivitis are highly contagious. Once symptoms begin, a person with pink eye caused by a virus (viral conjunctivitis) or bacteria (bacterial conjunctivitis) is thought to be capable of spreading the infection."}, {"url": "http://www.allaboutvision.com/faq/pinkeye-contagious.htm", "passage_text": "Topical antibiotic ointments or eye drops work to clear up infection in pink eye only if the source is bacterial. In this case, you need up to 24 hours for the eye drops or ointment to start working and for the infected person to no longer be contagious. If the source of the pink eye is viral, then the infection will need to run its course. In this case, you can relieve symptoms with lubricating eye drops to soothe irritation. Exposure to Contagious Pink Eye. Again, it's difficult to determine exactly how long pink eye is contagious, unless you know the source of the infection. For example, the rubeola virus causing measles and accompanying pink eye symptoms is extremely contagious, often for as long as two weeks or more.*."}, {"url": "http://www.mayoclinic.org/diseases-conditions/pink-eye/expert-answers/pink-eye/faq-20057932", "passage_text": "Pink eye (conjunctivitis) generally remains contagious as long as your child is experiencing tearing and matted eyes. Signs and symptoms of pink eye usually improve within three to seven days. When tearing and matted eyes are no longer present, it's appropriate for a child to return to school or child care. If the pink eye is caused by a bacterial infection, treatment with antibiotic drops or ointment for the eyes may be necessary. "}, {"url": "https://www.sharecare.com/health/bacterial-eye-infections/how-long-pinkeye-contagious", "passage_text": "A Dr. James Salz, MD, Ophthalmology, answered on behalf of American Academy of Ophthalmology's EyeSmart. If you have infectious conjunctivitis it is likely to be viral or bacterial. Viral conjunctivitis can continue to be infectious for up to 14 days after the earliest symptoms. Bacterial conjunctivitis is somewhat less contagious and is not likely to be infectious past 7 days especially if you are on antibiotic drops. "}, {"url": "http://emedicine.medscape.com/article/1191370-overview", "passage_text": "Viral conjunctivitis. Image courtesy of Wikimedia Commons. Viral conjunctivitis is highly contagious, usually for 10-12 days from onset as long as the eyes are red. Patients should avoid touching their eyes, shaking hands, and sharing towels, among other activities. "}]