[{"url": "http://www.partselect.com/Microwave+replace-fuse+repair.htm", "passage_text": "Replace the blown fuse. Pop it out of its holder and snap in a new one. You can squeeze the fuse clips together with your fingers in order to tighten their grip. Replace the unit's outer cabinet, plug it back in, and test to see if it is running properly. DO NOT run the microwave with nothing in it. NOTE: Fuses do not usually blow on their own. A fuse may blow because of problems with the interlock switches or with high voltage circuitry. "}, {"url": "http://home.howstuffworks.com/how-to-repair-an-oven7.htm", "passage_text": "If there is a grounding wire to the range, disconnect it. Make sure the power to the unit is off. If the range or oven is receiving power but doesn't work, the unit may have its own fuse or circuit breaker assembly. This assembly is usually located under the cooktop of the range."}, {"url": "http://www.partselect.com/Range-Stove-Oven+Fuse-Testing+repair.htm", "passage_text": "If the oven light, stovetop fluorescent light, clock or range outlet does not function correctly, often the problem can be a blown fuse or a tripped circuit breaker. 1 Refer to the owner's manual or to the wiring diagram for your electric range to locate the fuse you need to examine. 2  The type of fuse used in electric ranges is usually the plug-type. 3  This type has a threaded metal base (similar to a light bulb's base) and a flat top marked with an amperage rating."}, {"url": "https://answers.yahoo.com/question/index?qid=20080126104415AAOy84a", "passage_text": "The fact that both the oven and the clock are out suggests that one of the 30 amp fuses is blown. In newer models the clock and outlet(s) were on a 15 amp fuse. Some units have the fuses located on the top of the console and you flip up the chrome lid to access them. Check for voltage at the outlet with a voltmeter. You should have 220v across 2 of the wires and 110v with either of those and the neutral wire. Electric stoves use 220v but it is a 'split' service allowing 110 also for the clock."}, {"url": "http://www.searspartsdirect.com/repair-guide/wall-oven/how-to-replace-an-oven-thermal-fuse.html", "passage_text": "This oven repair guide explains how to replace an oven thermal fuse. The fuse trips to protect the oven from excessive heating. If the fuse blows, the oven won't heat. Some fuses can be reset by pressing a button; this guide explains how to replace one that can't be reset. Before you start, make sure you have the right manufacturer-approved replacement part. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080126104415AAOy84a", "passage_text": "Stove still works. Do ovens have fuses or something??? I baked a lasagna for an hour last night. no problems. this morning, the clock on the stove isn&#39;t working and the oven will not turn on? it&#39;s a cheap oven and stove. Tappan is the brand. Check for voltage at the outlet with a voltmeter. You should have 220v across 2 of the wires and 110v with either of those and the neutral wire. Electric stoves use 220v but it is a 'split' service allowing 110 also for the clock."}, {"url": "https://answers.yahoo.com/question/index?qid=20070813020613AAgHrei", "passage_text": "Report Abuse. Microwaves do have fuses and they can blow. Depending on the type of microwave you have, you might want to just replace it. A counter top model is not terribly expensive, but the wall mounted type (above your stove) can sost a bit more. "}, {"url": "http://home.howstuffworks.com/how-to-repair-an-oven7.htm", "passage_text": "Inside the oven, look to the back to spot the fuse assembly. If the unit has this additional fuse or breaker system, components such as the oven light, the range heating elements, the timer, and a self-cleaning feature may be separately fused. If these components or features fail to work, don't overlook the possibility that the fuses have blown. Make sure the power to the unit is off. If the range or oven is receiving power but doesn't work, the unit may have its own fuse or circuit breaker assembly. This assembly is usually located under the cooktop of the range."}, {"url": "http://www.myrepairhelp.com/qa-do-microwave-ovens-have-fuses-can-a-microwave-oven-be-repaired/", "passage_text": "2-12-12. JustAskin says: Microwaves do have fuses and they can blow. Depending on the type of microwave you have, you might want to just replace it. A counter top model is not terribly expensive, but the wall mounted type (above your stove) can sost a bit more."}]