[{"url": "http://geology.com/rocks/shale.shtml", "passage_text": "Shale is a fine-grained sedimentary rock that forms from the compaction of silt and clay-size mineral particles that we commonly call mud. This composition places shale in a category of sedimentary rocks known as mudstones. Shale is a rock composed mainly of clay-size mineral grains. These tiny grains are usually clay minerals such as illite, kaolinite and smectite. Shale usually contain other clay-size mineral particles such as quartz, chert and feldspar."}, {"url": "http://volcano.oregonstate.edu/book/export/html/1057", "passage_text": "Gneiss can be formed from a sedimentary rock such as sandstone or shale, or it can be formed from the metamorphism of the igneouse rock grantite. Gneiss can be used by man as paving and building stone. Non-Foliates are metamorphic rocks that have no cleavage at all. "}, {"url": "https://en.wikipedia.org/wiki/Metamorphic_rock", "passage_text": "Quartzite, a form of metamorphic rock, from the Museum of Geology at University of Tartu collection. Metamorphic rocks arise from the transformation of existing rock types, in a process called metamorphism, which means change in form."}, {"url": "https://en.wikipedia.org/wiki/Sedimentary_rock", "passage_text": "Sedimentary rocks are types of rock that are formed by the deposition of material at the Earth 's surface and within bodies of water. Sedimentation is the collective name for processes that cause mineral and/or organic particles (detritus) to settle and accumulate or minerals to precipitate from a solution. Particles that form a sedimentary rock by accumulating are called sediment. Before being deposited, sediment was formed by weathering and erosion in a source area, and then transported to the place of deposition by water, wind, ice, mass movement or glaciers which are called agents of denudation."}, {"url": "http://volcano.oregonstate.edu/metamorphic-rocks-lesson-14", "passage_text": "Gneiss can be formed from a sedimentary rock such as sandstone or shale, or it can be formed from the metamorphism of the igneouse rock grantite. Gneiss can be used by man as paving and building stone. Non-Foliates are metamorphic rocks that have no cleavage at all. Rocks are formed on Earth as igneous, sedimentary, or metamorphic rocks. Igneous rocks form when rocks are heated to the melting point which forms magma."}, {"url": "https://en.wikipedia.org/wiki/Shale", "passage_text": "For other uses, see Shale (disambiguation) . Shale is a fine-grained, clastic sedimentary rock composed of mud that is a mix of flakes of clay minerals and tiny fragments (silt-sized particles) of other minerals, especially quartz and calcite. The ratio of clay to other minerals is variable. "}, {"url": "http://www.dcnr.state.pa.us/topogeo/groundwater/rocktypes/index.htm", "passage_text": "Common clastic sedimentary rocks in Pennsylvania are conglomerate, sandstone, siltstone, claystone, and shale. Common nonclastic sedimentary rocks are limestone and dolomite. Igneous rocks are formed by the cooling of molten material, either lava (above ground) or magma (underground). Metamorphic rocks are those formed by altering igneous, sedimentary, or other metamorphic rocks by heat and/or pressure. The heat and pressure cause changes in the minerals present, as well as rearranging the minerals in the rocks."}, {"url": "http://www.answers.com/Q/What_rock_is_formed_when_shale_is_transformed_to_metamorphic_rock", "passage_text": "Confidence votes 68.1K. Rockhound. Slate is the metamorphic rock formed from shale. A pile of mud can turn into shale (a fine-grained sedimentary rock) with relatively low pressure, about 3 mi (5 km) down into the earth. With more pressure and some heat, shale can transform into slate. "}]