[{"url": "http://secure.medicalletter.org/TML-article-1469b", "passage_text": "The FDA has approved Arnuity Ellipta (GSK), a single-agent inhaler containing the corticosteroid fluticasone furoate, for once-daily maintenance treatment of asthma in patients ≥12 years old. "}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0010360/?report=details", "passage_text": "Uses of This Medicine. Fluticasone belongs to the family of medicines known as corticosteroids (cortisone-like medicines). It is used to help prevent the symptoms of asthma. When used regularly every day, inhaled fluticasone decreases the number and severity of asthma attacks. "}, {"url": "http://www.rxlist.com/arnuity-ellipta-side-effects-drug-center.htm", "passage_text": "Arnuity Ellipta (fluticasone furoate) Inhalation Powder is a corticosteroid used for the once-daily maintenance treatment of asthma as prophylactic therapy in patients aged 12 years and older. Common side effects include bronchitis, headache, cold symptoms, upper respiratory tract infection, sore throat, and sinusitis. "}, {"url": "http://www.medilexicon.com/drugs/arnuity_ellipta.php", "passage_text": "Arnuity Ellipta contains the active component fluticasone furoate, a synthetic trifluorinated corticosteroid with anti-inflammatory activity. Arnuity Ellipta is specifically indicated for the once-daily maintenance treatment of asthma as prophylactic therapy in patients aged 12 years and older. Arnuity Ellipta contains the active component fluticasone furoate, a synthetic trifluorinated corticosteroid with anti-inflammatory activity. The precise mechanism of corticosteroid action on asthma is not known."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMHT0000767/", "passage_text": "Fluticasone belongs to the family of medicines known as corticosteroids (cortisone-like medicines). It is used to help prevent the symptoms of asthma… Read more. Fluticasone topical is used to help relieve redness, itching, swelling, or other discomfort caused by skin conditions (eg, atopic dermatitis)."}, {"url": "http://www.everydayhealth.com/drugs/arnuity-ellipta", "passage_text": "Flovent Diskus or Arnuity Ellipta is a powder form of fluticasone that comes with a special inhaler device preloaded with blister packs containing measured doses of fluticasone. The device opens and loads a blister of fluticasone each time you use the inhaler. The disk device is not to be used with a spacer. Flovent brands of fluticasone inhalation are for use in adults and children who are at least 4 years old. The Arnuity Ellipta brand is for adults and children who are at least 12 years old. Fluticasone may also be used for purposes not listed in this medication guide. Fluticasone inhalation is not a rescue medicine."}, {"url": "http://www.rxwiki.com/fluticasone-furoate", "passage_text": "Fluticasone furoate is a prescription medication used to prevent symptoms of asthma. Fluticasone furoate can also treat the symptoms of allergic and non-allergic rhinitis. Fluticasone furoate is in a class of medications called corticosteroids. Back to Top. Fluticasone furoate is a prescription medication used to prevent symptoms of asthma, including difficulty breathing, chest tightness, wheezing, and coughing, in adults and children aged 12 years and older."}, {"url": "http://www.mayoclinic.org/drugs-supplements/fluticasone-inhalation-route/description/DRG-20067663", "passage_text": "Descriptions. Fluticasone belongs to the family of medicines known as corticosteroids (cortisone-like medicines). It is used to help prevent the symptoms of asthma. When used regularly every day, inhaled fluticasone decreases the number and severity of asthma attacks. "}, {"url": "http://us.gsk.com/en-us/media/press-releases/2014/gsk-receives-fda-approval-for-arnuity-ellipta-fluticasone-furoate-in-the-us-for-the-treatment-of-asthma/", "passage_text": "Issued: London, UK. GlaxoSmithKline plc today announced that the FDA has approved Arnuity™ Ellipta ® (fluticasone furoate inhalation powder), a once-daily inhaled corticosteroid (ICS) medicine for maintenance treatment of asthma as prophylactic therapy in patients aged 12 years and older. "}, {"url": "http://www.webmd.com/drugs/2/drug-167456/arnuity-ellipta-inhalation/details", "passage_text": "Uses. Fluticasone is used to control and prevent symptoms (such as wheezing and shortness of breath) caused by asthma. Controlling symptoms of asthma helps you maintain your normal activities and decreases time lost from work or school. Fluticasone belongs to a class of drugs known as corticosteroids. "}]