[{"url": "http://strangeoccurrencesparanormal.weebly.com/orbs-explained.html", "passage_text": "The reason for this is that the flash illuminates dust particles that are drifting very close to it. These reflect light back into the camera lens, but they are too close to be in focus. A lens sees an out-of-focus point of light as a 'circle of confusion', and the more out of focus it is, the larger the circle. And orb photos are more common with digital cameras than film. This is not because of the digital recording device, but the compact optical design of the cameras, the short focal length and small aperture of the lenses and the close proximity of lens and flash."}, {"url": "https://en.wikipedia.org/wiki/Orb_(optics)", "passage_text": "The term orb describes unexpected, typically circular artifacts that occur in flash photography — sometimes with trails indicating motion — especially common with modern compact and ultra-compact digital cameras. Orbs are also sometimes called backscatter, orb backscatter, or near-camera reflection. The orb artifact can result from retroreflection of light off solid particles, e.g., dust, pollen, or liquid particles, e.g., water droplets, especially rain) or other foreign material within the camera lens."}, {"url": "http://www.livescience.com/4263-ghost-photos-close-paranormal.html", "passage_text": "To those unaware of scientific and optical explanations, it is no wonder that orbs spook people (as Mumler's photos did 120 years ago). Most ghost investigators will admit that at least some orb photos are of ordinary phenomena. Still, they insist, there must be some orbs that defy rational explanation. "}, {"url": "http://strangeoccurrencesparanormal.weebly.com/orbs-explained.html", "passage_text": "Dust photographs as little bright circles of light on film or digital cameras, when illuminated by light sources close to the camera lens. This explains nearly every 'orb' photo you will ever see. 'Nearly' because we are open minded and regard each new instance of an orb as a separate case. And orb photos are more common with digital cameras than film. This is not because of the digital recording device, but the compact optical design of the cameras, the short focal length and small aperture of the lenses and the close proximity of lens and flash."}, {"url": "http://skeptoid.com/episodes/4029", "passage_text": "Orbs, formally called Spirit Orbs, are those semi-transparent white balls seen floating around in many photographs taken in ghostly locations. Orbs are among the class of paranormal phenomena that are visible only to cameras, and not to the naked eye. But you still haven't explained how orbs have been seen on photos that have been taken without a flash, and orbs that have been seen without a camera at all. If you haven't got an explanation that's ok."}, {"url": "http://www.theepochtimes.com/n3/560244-what-are-orbs-in-photos-spirits-dust/", "passage_text": "It is also not possible to explain many of them as being caused by dust particles in the air.”. An orb captured in a BBC documentary that was not caused by reflected light, according to University of Arizona researchers. The researchers could not provide a scientific explanation for the orb. It is unusual in that the orb appears to be in front of the horn, yet there is a distinct shadow cast on the orb by the horn. (Cindy Drukier/Epoch Times). Orbs are seen in New Zealand near the settlement of the Ngati Mamoe tribe, a tribe that no longer exists."}, {"url": "http://skeptics.stackexchange.com/questions/1246/what-is-the-scientific-explanation-of-orbs-in-photographs", "passage_text": "This is a typical extract form a blog post about Orbs, Reading an article about orbs, the mysterious lights sometimes appearing in photographs, I was reminded of how little we know of the world surrounding us. The reasons are somewhat like Bokeh only the result is likely caused, in the above case, by a small drop of water or a speck of dust on or near the camera; or possibly a chip in the lens. When the light hits it just right, it produces a strange optical anomaly. Bokeh. Dirty Lens. share | improve this answer"}, {"url": "http://skeptoid.com/episodes/4029", "passage_text": "Another hypothesis about orbs is that they are not the spirit at all, but rather energy being transferred to a spirit. Suppose that a spirit is hanging out near a power source, be that a person, a powerline, a warm fireplace, or something else. But you still haven't explained how orbs have been seen on photos that have been taken without a flash, and orbs that have been seen without a camera at all. If you haven't got an explanation that's ok."}, {"url": "http://strangeoccurrencesparanormal.weebly.com/orbs-explained.html", "passage_text": "ORBS: Most Are Not Paranormal. There are still many paranormal investigation websites that show photos of orbs as evidence of paranormal activity. Orbs can appear in videos (see note below) and still photographs, and some people still claim that they are an early stage of spirit manifestation. We generally disagree. And orb photos are more common with digital cameras than film. This is not because of the digital recording device, but the compact optical design of the cameras, the short focal length and small aperture of the lenses and the close proximity of lens and flash."}]