[{"url": "http://www.answers.com/Q/Does_the_iud_regulate_your_periods", "passage_text": "RN, FNP. No, the IUD does not regulate your period.. The Paragard IUD may make your period a bit heavier and crampier, but it's nonhormonal and does not alter the timing of your period. The Mirena IUD is hormonal. Irregular bleeding or spotting can happen in the first few months of use, after which women on Mirena don't usually have bleeding."}, {"url": "http://www.answers.com/Q/Does_the_iud_regulate_your_periods", "passage_text": "An IUD-IntraUterine Device is a birth control device (form of contraception) that a health care provider places in your uterus. The IUD can stay in place for 5 to 12 years d … epending on the type. The ParaGard IUD contains copper."}, {"url": "http://www.answers.com/Q/Does_the_iud_regulate_your_periods", "passage_text": "While the copper IUD does not normally stop periods, a woman may miss a period for a number of reasons. Pregnancy and stress are common ones. Consider a pregnancy test if you' … re having other symptoms."}, {"url": "http://www.mamapedia.com/article/iud-does-it-regulate-your-period", "passage_text": "I had horrible, frequent, heavy periods and I qualified for a procedure called an ablation. Do some research or talk to your dr. I had mine almost 3 years ago and haven't even had a period since. This is not meant to stop them, it is meant to regulate them...but I guess it stops periods in about 80% of women. However, I don't think you can do this if you are planning on having more children. Something to look into."}, {"url": "http://www.webmd.com/sex/birth-control/intrauterine-device-iud-for-birth-control", "passage_text": "1 The most commonly used IUD is the copper IUD (such as Paragard). 2  Copper wire is wound around the stem of the T-shaped IUD. 3  The copper IUD can stay in place for up to 10 years and is a highly effective form of contraception."}, {"url": "http://www.webmd.com/sex/birth-control/intrauterine-device-iud-for-birth-control", "passage_text": "1 Copper IUD. 2  The most commonly used IUD is the copper IUD (such as Paragard). 3  Copper wire is wound around the stem of the T-shaped IUD. 4  The copper IUD can stay in place for up to 10 years and is a highly effective form of contraception."}]