[{"url": "http://www.agronext.iastate.edu/corn/production/management/planting/soiltemp.html", "passage_text": "Wait to plant until the soil temperature is right. In general, corn should be planted when soil temperatures are near 50 F. Seed will absorb about 30 percent of its weight in water, and temperature does not affect water imbibition much. This is different than radicle (root) and coleoptile (shoot) growth; their growth is correlated with soil temperature."}, {"url": "http://www.ipm.iastate.edu/ipm/icm/2007/4-2/cornplant.html", "passage_text": "Wait to plant until the soil temperature is right. In general, corn should be planted when soil temperatures are near 50 °F. Seed will absorb about 30 percent of its weight in water, and temperature does not affect water imbibition much."}, {"url": "http://extension.psu.edu/plants/crops/news/2013/04/corn-planting-timing-soil-temperature-and-stands", "passage_text": "1 Measure soil temperature at corn planting depth (1.5 to 2 inches). 2  If the early morning temperature (the low) is above 50 degrees (F), then consider planting. 3  Check the forecast for assurances that the soil temperature of 50 degrees (F) or above is likely to hold for 3-5 days."}, {"url": "http://extension.psu.edu/plants/crops/news/2013/04/corn-planting-timing-soil-temperature-and-stands", "passage_text": "In general, corn should be planted when soil temperatures are near 50 °F. Seed will absorb about 30 percent of its weight in water, and temperature does not affect this process much. However, this is different than radicle (root) and coleoptile (shoot) growth; their growth is correlated with soil temperature."}, {"url": "http://homeguides.sfgate.com/temperature-should-ground-plant-corn-55128.html", "passage_text": "Ground Temperature. The best time to plant your corn seeds is when the soil temperature reaches an average of 50 degrees Fahrenheit. You can determine the average ground temperature in your garden using a soil thermometer -- available at most garden stores."}, {"url": "http://farmprogress.com/story-planting-corn-soil-temperature-50-degrees-magic-number-9-97171", "passage_text": "Related: When to plant corn in central Midwest. That's kind of a magic number, 50 degrees, for planting corn, observes Jim Fawcett, an Iowa State University Extension field agronomist in eastern Iowa. That's when corn will germinate, with a soil temperature of 50 degrees or higher. The reason for not planting before that is the seed actually will take up water with soil temperatures cooler than 50 degrees. The seed will swell, but it doesn't germinate."}, {"url": "http://homeguides.sfgate.com/temperature-should-ground-plant-corn-55128.html", "passage_text": "Corn seeds are most likely to germinate when they are planted at a depth of approximately 1 to 2 inches. Inserting your soil thermometer into the soil at the depth you plan to plant provides an accurate measurement of how warm the soil is at that depth."}]