[{"url": "http://www.thefreedictionary.com/sensory+nerve", "passage_text": "Noun. 1. sensory nerve-a nerve that passes impulses from receptors toward or to the central nervous system. afferent, afferent nerve. dorsal horn, dorsal root-one of the two roots of a spinal nerve that passes dorsally to the spinal cord and that consists of sensory fibers."}, {"url": "https://en.wikipedia.org/wiki/Sensory_neuron", "passage_text": "From Wikipedia, the free encyclopedia. Sensory neurons are nerve cells that transmit sensory information (sight, sound, feeling, etc.). They are activated by sensory input, and send projections to other elements of the nervous system, ultimately conveying sensory information to the brain or spinal cord."}, {"url": "http://www.hopkinsmedicine.org/neurology_neurosurgery/centers_clinics/peripheral_nerve/conditions/small_fiber_sensory_neuropathy.html", "passage_text": "Small Fiber Sensory Neuropathy. Small fiber sensory neuropathy (SFSN) is a disorder in which only the small sensory cutaneous nerves are affected. The majority of patients experience sensory disturbances that start in the feet and progress upwards. These patients have what is called a length-dependent SFSN. Symptoms. The symptoms of small fiber sensory neuropathy are primarily sensory in nature and include unusual sensations such as pins-and-needles, pricks, tingling and numbness. Some patients may experience burning pain or coldness and electric shock-like brief painful sensations."}, {"url": "http://www.innerbody.com/anatomy/nervous/leg-foot", "passage_text": "Nerves of the Leg and Foot. The nerves of the leg and foot serve to propel the body through the actions of the legs, feet, and toes while maintaining balance, both while the body is moving and when it is at rest."}, {"url": "http://www.hrsa.gov/hansensdisease/diagnosis/sensory.html", "passage_text": "Sensory Function. The sensory function of the hand provides feedback to the brain for object recognition and protection as the hand interacts with its environment. A sense of having contact with an object and the quality of contact is important to the effective use of the hand. "}, {"url": "http://www.rightdiagnosis.com/s/sensory_nerve_trauma/intro.htm", "passage_text": "Sensory nerve trauma: Introduction. Sensory nerve trauma: Injury or damage to a sensory nerve. Sensory nerves are nerves associated with delivering information from the body to the brain and spinal cord relating to the five senses-vision, hearing, touch, taste and smell. "}, {"url": "http://medical-dictionary.thefreedictionary.com/sensory+nerve", "passage_text": "produced by sensory organs and transmitted by afferent nerve fibers to the central nervous system. See also sense. sensory nerve. a peripheral nerve that conducts impulses from a sense organ to the spinal cord or brain; called also afferent nerve. See also nerve. sensory nerve a peripheral nerve that conducts impulses from a sense organ to the spinal cord or brain. See also neuron. somatic n's the sensory and motor nerves supplying skeletal muscle and somatic tissues."}, {"url": "http://medical-dictionary.thefreedictionary.com/sensory+nerve", "passage_text": "nerve. a macroscopic cordlike structure of the body, comprising a collection of nerve fibers that convey impulses between a part of the central nervous system and some other body region. See Appendix 2-6 and see color plates. Depending on their function, nerves are known as sensory, motor, or mixed. sensory nerve a peripheral nerve that conducts impulses from a sense organ to the spinal cord or brain. See also neuron. somatic n's the sensory and motor nerves supplying skeletal muscle and somatic tissues."}]