[{"url": "http://www.ask.com/science/two-main-types-glaciers-c171163fece42af", "passage_text": "Quick Answer. The two main types of glaciers are continental glaciers and alpine glaciers. Continental glaciers are also known as ice sheets because their form and flow are not significantly affected by underlying geographic formations. Alpine glaciers form on mountains and flow down mountain valleys. Know More."}, {"url": "http://www.onegeology.org/eXtra/kids/earthProcesses/glaciers.html", "passage_text": "Glacial movement. There are different types of glaciers: Alpine glaciers, which begin high up in the mountains in bowl-shaped hollows called cirques. Continental glaciers, which are continuous masses of ice that are much larger than alpine glaciers."}, {"url": "http://www.ux1.eiu.edu/~cfjps/1300/glaciers.html", "passage_text": "There are two primary types of glaciers: : Ice sheets are dome-shaped glaciers that flow away from a central region and are largely unaffected by underlying topography (e.g., Greenland and Antarctic ice sheets); : glaciers in mountains that flow down valleys. When two or glaciers meet and merge at the base of mountains, the new glacier is called a piedmont glacier. If the piedmont glacier flows to the sea, it's called a tidewater glacier."}, {"url": "http://www.ask.com/science/two-main-types-glaciers-c171163fece42af", "passage_text": "A: The two main types of glaciers are continental glaciers and alpine glaciers. Continental glaciers are also known as ice sheets because their form and flow are not significantly affected by underlying geographic formations. Alpine glaciers form on mountains and flow down mountain valleys. Know More."}, {"url": "http://www.preservearticles.com/2011110116409/what-are-the-different-types-of-glaciers.html", "passage_text": "JayeshE. Advertisements: On the basis of their stage of development, size, shape and the relationship between the supply and flow areas, three types of glaciers have been distinguished. These are as:-. 1. Mountain or Valley glacier; 2. Piedmont glacier; 3."}]