[{"url": "http://www.thefreedictionary.com/technocracy", "passage_text": "1. technocracy-a form of government in which scientists and technical experts are in control; technocracy was described as that society in which those who govern justify themselves by appeal to technical experts who justify themselves by appeal to scientific forms of knowledge."}, {"url": "http://technocracy.wikia.com/wiki/Technocracy_movement", "passage_text": "The term technocracy movement refers to a social movement that started in the United States of America in the early 20th century and promotes the application of science to society and a rational form of government that provides a sustainable high standard of living for all citizens."}, {"url": "http://www.audioenglish.org/dictionary/technocracy.htm", "passage_text": "The noun TECHNOCRACY has 1 sense: 1. a form of government in which scientists and technical experts are in control. Familiarity information: TECHNOCRACY used as a noun is very rare."}, {"url": "http://www.investopedia.com/terms/t/technocracy.asp", "passage_text": "DEFINITION of 'Technocracy'. A form of government where decision-makers are chosen for a governing office based on their technical expertise and background."}, {"url": "https://en.wikipedia.org/wiki/Technocracy", "passage_text": "Some uses of the word technocracy refer to a form of meritocracy, a system where the most qualified are in charge."}, {"url": "http://www.investopedia.com/terms/t/technocracy.asp", "passage_text": "A technocracy differs from a traditional democracy in that individuals elected to a leadership role are chosen through a process that emphasizes their relevant skills and proven performance, as opposed to whether or not they fit the majority interests of a population."}, {"url": "https://en.wikipedia.org/wiki/Technocracy", "passage_text": "St. Simon's vision of industrial society, a vision of pure technocracy, was a system of planning and rational order in which society would specify its needs and organize the factors of production to achieve them.. This article is about a meritocratic form of government."}, {"url": "https://en.wikipedia.org/wiki/Technocracy", "passage_text": "Technocracy is an organizational structure or system of governance where decision-makers are selected on the basis of technological knowledge. The concept of a technocracy remains mostly hypothetical."}]