[{"url": "http://www.collectivewizdom.com/PurpleMarksonArms-CausesandTop8NaturalRemedies.html", "passage_text": "You may be experiencing blood spots beneath the skin as the blood vessels leak or join together. These blood spots are called purpura or petechiae. Purpura look similar to bruises while petechiae are a bit different – tiny purple or red spots within the skin. Purpura may be caused by blood clotting disorders, certain medications, fragile blood vessels, inflammation, childbirth or scurvy.Your purple marks may also be age spots, also called liver spots. These flat purplish, gray or black spots usually appear on the places most exposed to the sun such as the arms and fac"}, {"url": "http://www.cigna.com/healthwellness/hw/medical-topics/bruises-and-blood-spots-under-the-skin-bruse", "passage_text": "Sudden unexplained bruising or blood spots under the skin or a sudden increase in the frequency of bruising may be caused by: 1  A medicine, such as aspirin or blood thinners (anticoagulants). 2  Infection that causes the buildup of toxin in the blood or tissues (sepsis). "}, {"url": "http://blooddisordes.blogspot.com/2011/05/blood-spots-under-skin.html", "passage_text": "Some Facts About Blood Spots Under the Skin. Blood spots under the skin can develop in any part of the body. Elderly people gets red blood spots under the skin in the areas like forearms, hands, legs and feet. Women often get on the thighs, arms and buttocks. Some people are prone to bruises and blood spots under the skin. Women get blood spots under the skin more easily than men"}, {"url": "http://www.healthline.com/health/purpura", "passage_text": "Purpura, also called blood spots or skin hemorrhages, refers to purple-colored spots that are most recognizable on the skin. The spots could also be located on organs or mucous membranes, including the inside of the mouth. Have a board certified dermatologist examine your skin problem ». "}, {"url": "http://www.livestrong.com/article/251483-what-causes-liver-spots-on-my-arms/", "passage_text": "Liver spots may appear on the hands or arms. Liver spots are flat, usually oval spots that are brown or black in color. They actually have nothing to do with the liver or liver disease; they are called liver spots because their color can resemble the yellowish-brown color of liver. "}, {"url": "http://www.emedicinehealth.com/bruises_and_blood_spots_under_the_skin-health/article_em.htm", "passage_text": "Sudden unexplained bruising or blood spots under the skin or a sudden increase in the frequency of bruising may be caused by: 1  A medicine, such as aspirin or blood thinners (anticoagulants). 2  Infection that causes the buildup of toxin in the blood or tissues (sepsis). "}, {"url": "http://www.rightdiagnosis.com/symptom/red-purple-spots-on-arms.htm", "passage_text": "Red-purple spots on arms (symptom description): For a medical symptom description of 'Red-purple spots on arms', the following symptom information may be relevant to the symptoms: Spots (type of symptom). "}, {"url": "https://answers.yahoo.com/question/index?qid=20070531073821AAWWjJ6", "passage_text": "Report Abuse. Some people get cherry angiomas, small, cherry-red spots. These are heredfitary and start to appear on the chest, back, and arms, usually in the 20's and beyond. It may be that you just started noticing them. Cherry angiomas are the most common vascular lesions to appear on human skin"}, {"url": "https://www.caring.com/slideshows/signs-you-could-have-leukemia", "passage_text": "1. Purplish patches or tiny red spots on the skin. Known as petechiae, these tiny red or purple spots often appear in clusters -- typically on the chest, back, face, or arms -- and are a side effect of the blood's failure to clot. They may be confused with a rash, although they're really broken blood vessels and capillaries resulting from low platelet count. And because early diagnosis is critical to successful treatment, it's important to know these ten common, easily missed signs: Known as petechiae, these tiny red or purple spots often appear in clusters -- typically on the chest, back, face, or arms -- and are a side effect of the blood's failure to clot."}]