[{"url": "http://legal-dictionary.thefreedictionary.com/Implied+Consent", "passage_text": "Consent that is inferred from signs, actions, or facts, or by inaction or silence. Implied consent differs from express consent, which is communicated by the spoken or written word. Implied consent is a broadly based legal concept. Whether it is as valid as express consent depends on the situation and the applicable law."}, {"url": "http://whatis.techtarget.com/definition/implied-consent", "passage_text": "In the context of commercial email and text messages, for example, implied consent may be assumed by the senders because the recipient purchased a product from the sender's website or volunteered with the sender's charitable organization recently. Implied consent is a fairly broadly-applied legal concept."}, {"url": "http://whatis.techtarget.com/definition/implied-consent", "passage_text": "Implied consent is an assumption of permission to do something that is inferred from an individual's actions rather than explicitly provided."}, {"url": "http://legal-dictionary.thefreedictionary.com/Implied+Consent", "passage_text": "Implied consent as the result of inaction is most commonly found in litigation procedures. For instance, a party to a lawsuit may have the legal right to object to a court hearing that is scheduled to occur before the party has obtained certain crucial documents."}, {"url": "http://www.legalinfo.com/content/dui-dwi/what-is-implied-consent.html", "passage_text": "What Is Implied Consent. Implied consent is a legal term that is defined as an agreement that is inferred from signs, actions, or facts. It can also be inferred by inaction or silence. The term is very broad and widely applicable when dealing with criminal law."}, {"url": "https://en.wikipedia.org/wiki/Implied_consent", "passage_text": "(April 2013). Implied consent is consent which is not expressly granted by a person, but rather implicitly granted by a person's actions and the facts and circumstances of a particular situation (or in some cases, by a person's silence or inaction)."}, {"url": "https://driversed.com/resources/terms/implied_consent_law.aspx", "passage_text": "Implied Consent Law. This law states that by driving a vehicle you have agreed to submit to chemical tests of your breath, blood, or urine to determine alcohol or drug content, if asked to do so by a law enforcement officer."}]