[{"url": "https://faculty.washington.edu/chudler/glia.html", "passage_text": "The brain is made up of more than just nerve cells (neurons). Although there are about 100 billion neurons in the brain, there may be about 10 to 50 times that many glial cells in the brain. 1 Neurons have TWO processes called axons and dendrites....glial cells have only ONE. 2  Neurons CAN generate action potentials...glial cells CANNOT. 3  However, glial cells do have a resting potential. 4  Neurons HAVE synapses that use neurotransmitters...glial cells do NOT have chemical synapses."}, {"url": "http://www.youtube.com/watch?v=509XqFH91gQ", "passage_text": "The brain is composed of many types of cells, but the functional unit is called the Neurons. All sensations, movements, thoughts, memories, and feelings are the result of signals that pass through neurons. The other cells in the brain are the glial cells, which have important roles in the functioning of the neuron. "}, {"url": "https://faculty.washington.edu/chudler/glia.html", "passage_text": "1 Neurons CAN generate action potentials...glial cells CANNOT. 2  However, glial cells do have a resting potential. 3  Neurons HAVE synapses that use neurotransmitters...glial cells do NOT have chemical synapses. 4  There are many MORE (10-50 times more) glial cells in the brain compared to the number of neurons. 1 Neurons have TWO processes called axons and dendrites....glial cells have only ONE. 2  Neurons CAN generate action potentials...glial cells CANNOT. 3  However, glial cells do have a resting potential. 4"}, {"url": "http://www.differencebetween.com/difference-between-neurons-and-vs-neuroglia/", "passage_text": "Neurons vs Neuroglia. The nervous system is made up of two major types of cells known as neurons and neuroglia. However, many have an understanding that there are only neurons in the nervous system, and the supporting cells are forgotten. Neuroglia are also important for the protection of neurones in the brain, and there are almost the same number of neuroglia cells as the number of neuron cells in the human brain."}, {"url": "http://www.training.seer.cancer.gov/brain/tumors/anatomy/neurons.html", "passage_text": "Dendrites and Axons. An axon is a long, hair-like extension of a nerve cell that carries a message to another nerve cell. Dendrites are thread-like extensions of the cytoplasm of a neuron that receive signals from other neurons. Typically, as in multipolar neurons, dendrites branch into treelike processes, but in unipolar and bipolar neurons, dendrites resemble axons."}, {"url": "http://thebrain.mcgill.ca/flash/d/d_01/d_01_cl/d_01_cl_ana/d_01_cl_ana.html", "passage_text": "The cell body of a neuron is very small (from a few hundredths to a few tenths of a millimetre in diameter). The axons of some neurons, such as those in the cortex that send signals to other nearby neurons, are scarcely any longer than a hair is thick. "}, {"url": "https://faculty.washington.edu/chudler/glia.html", "passage_text": "1 However, glial cells do have a resting potential. 2  Neurons HAVE synapses that use neurotransmitters...glial cells do NOT have chemical synapses. 3  There are many MORE (10-50 times more) glial cells in the brain compared to the number of neurons. 1 Neurons have TWO processes called axons and dendrites....glial cells have only ONE. 2  Neurons CAN generate action potentials...glial cells CANNOT. 3  However, glial cells do have a resting potential. 4"}, {"url": "https://en.wikipedia.org/wiki/Glial_cell", "passage_text": "Glial cells, sometimes called neuroglia or simply glia (Greek γλοία glue; pronounced in English as either /ˈɡliːə/ or /ˈɡlaɪə/), are non-neuronal cells that maintain homeostasis, form myelin, and provide support and protection for neurons in the central nervous system and peripheral nervous system. Satellite glial cells are small cells that surround neurons in sensory, sympathetic, and parasympathetic ganglia. These cells help regulate the external chemical environment. Like astrocytes, they are interconnected by gap junctions and respond to ATP by elevating intracellular concentration of calcium ions."}, {"url": "http://blogs.scientificamerican.com/brainwaves/know-your-neurons-what-is-the-ratio-of-glia-to-neurons-in-the-brain/", "passage_text": "Their study also suggests that the ratio of glia to neurons differs dramatically from one general brain region to the next. 60.84 billion cells in the cerebral cortex are glia, while only 16.34 billion cells are neurons, giving this large region a glia to neuron ratio of about 3.76 to 1. It's the inverse in the cerebellum, an evolutionarily ancient part of the brain that sits astride the brain stem. Several early studies found a glia to neuron ratio of about 1:1 in the cortex, for example, but one 1988 study found a glia to neuron ratio of 17 to 1 in the thalamus, a versatile pair of walnut-sized knobs near the middle of the brain."}, {"url": "http://www.differencebetween.com/difference-between-neurons-and-vs-neuroglia/", "passage_text": "These non-neuron cells of the nervous system are important to maintain the homeostasis as well as to form myelin. Neuroglia are also important for the protection of neurones in the brain, and there are almost the same number of neuroglia cells as the number of neuron cells in the human brain. The structure of this cell is like a spider or an octopus, but there is no axon as in neurons"}]