[{"url": "https://en.wikipedia.org/wiki/Karaka_(tree)", "passage_text": "Karaka is a leafy canopy tree with erect or spreading branches. It grows to heights up to 15 m and has a stout trunk up to 1 m in diameter. Most botanists consider it to be native only to the northern half of the North Island, having been planted elsewhere by Māori near former village sites, and subsequently spread by birds. The common name karaka comes from the Māori language, and is also the Māori term for the colour orange, from the colour of the fruit. In the Chatham Islands, it is called kōpī, its name in the Moriori language"}, {"url": "https://en.wikipedia.org/wiki/Karaka_(tree)", "passage_text": "In winter and spring (August to November), karaka produces stout, erect panicles of tiny flowers. Individual flowers are 4–5 mm in diameter and greenish-cream to off-white or pale yellow. The fruit is an ellipsoid to ovoid drupe 25–46 mm long, with pale yellow to orange flesh, containing a single seed. Most botanists consider it to be native only to the northern half of the North Island, having been planted elsewhere by Māori near former village sites, and subsequently spread by birds. The common name karaka comes from the Māori language, and is also the Māori term for the colour orange, from the colour of the fruit. In the Chatham Islands, it is called kōpī, its name in the Moriori language"}, {"url": "https://en.wikipedia.org/wiki/Karaka_(tree)", "passage_text": "Karaka or New Zealand laurel (Corynocarpus laevigatus) is an evergreen tree of the family Corynocarpaceae endemic to New Zealand. Most botanists consider it to be native only to the northern half of the North Island, having been planted elsewhere by Māori near former village sites, and subsequently spread by birds. The common name karaka comes from the Māori language, and is also the Māori term for the colour orange, from the colour of the fruit. In the Chatham Islands, it is called kōpī, its name in the Moriori language"}, {"url": "http://www.universeofsymbolism.com/tree-symbolism.html", "passage_text": "A widespread symbol of the tree is the tree of life, it's body rooted in earth with its crown dancing in the sky. A tree is symbolic of nurturing energies if it is a fruit bearing tree. More tree symbolism and symbolic meanings of the tree represent... a recovery from illness, ambition or wishes fulfilled, thing having to do with family, blessings of nature, good fortune, stability, shelter and security. Ancient Celtic tribes had meanings and uses for many trees, some of which are shared below. Spiritual meanings of trees ... There are countless mythical qualities symbolized by trees, one beautiful meaning and symbol is the Tree of Life which gives us an idea of the symbolic significance of trees."}, {"url": "http://maxa.maf.govt.nz/sff/about-projects/search/L06-068/karaka-article-from-indigena.pdf", "passage_text": "Flowers and fruit Karaka is a large, attractive tree, and relatively fast-growing for a native. Largely, but not exclusively coastal, it germinates readily from seed and seems largely disease and pest free. In fact it seems suspiciously pest and disease free. Indigena August 2007 page 19 Karaka – A traditional NZ nutcrop Karaka, Corynocarpus laevigatus, is a New Zealand native, famous for its bright orange berries and the nut inside which is edible when treated to remove toxins."}, {"url": "http://www.academia.edu/609237/The_endemic_tree_Corynocarpus_laevigatus_karaka_as_a_weedy_invader_in_forest_remnants_of_southern_North_Island_New_Zealand", "passage_text": "The endemic tree Corynocarpus laevigatus (karaka) as a weedy invader in forest remnants of southern North Island, New Zealand. 1  Uploaded byJessica Costall. "}, {"url": "http://nhc.net.nz/index/botanical-new-zealand/trees/karaka/karaka.htm", "passage_text": "Karaka. Distribution Karaka is a coastal tree of the North Island but can be found as far South as Westport and Banks Peninsula. It is often found in groves as the Maori planted it for the fruit and leaves. "}, {"url": "http://www.teara.govt.nz/en/photograph/13748/karaka-tree-in-berry", "passage_text": "Karaka tree in berry. Karaka (Corynocarpus laevigatus), a hardy tree with large glossy leaves and orange fruits, is found in coastal forests of the North Island and northern South Island, and on the Chatham Islands. Before people arrived in New Zealand, it probably only grew in the northern North Island. Next. Karaka (Corynocarpus laevigatus), a hardy tree with large glossy leaves and orange fruits, is found in coastal forests of the North Island and northern South Island, and on the Chatham Islands."}]