[{"url": "http://www.kiplinger.com/article/retirement/T046-C001-S003-how-to-fund-a-roth-ira-if-you-earn-too-much.html", "passage_text": "You can contribute to a Roth in 2013 only if your income is less than $127,000 if single or $188,000 if married filing jointly (the amount starts to phase out if you earn more than $112,000 if single or $178,000 if married filing jointly). You can contribute to a nondeductible IRA every year (up to $5,500 for 2013, or $6,500 if you’re age 50 or older) and immediately convert the money to a Roth."}, {"url": "http://www.goodfinancialcents.com/roth-ira-earnings-limit-make-too-much-for-a-roth-ira-nonsense/", "passage_text": "You can still make an indirect contribution to your Roth IRA regardless of how much money you earn, and whether it’s a direct or indirect contribution, what’s most important is getting that money into your Roth IRA where it can grow tax-free and where you can withdraw it tax-free in your retirement years. For example, let’s say you’re married, 40 years-old, and earn $300,000 per year. Under IRS rules, you’re prohibited from making a direct contribution to your Roth IRA since your $300,000 income exceeds the $183,000 income limit for married couples."}, {"url": "https://www.fidelity.com/retirement-ira/ira-rules-faq", "passage_text": "If you are married filing jointly, you can make a full contribution to a Roth IRA if your income is less than $181,000 ($181,000 - $191,000 for a partial contribution) in 2014 and $183,000 ($183,000 - $193,000 for a partial contribution) in 2015. As a single filer, you can make a full contribution to a Roth IRA if your income is less than $114,000 ($114,000 - $129,000 for a partial contribution) in 2014 and $116,000 ($116,000 - $131"}, {"url": "https://www.fidelity.com/retirement-ira/ira-rules-faq", "passage_text": "There are income limits for Roth IRAs. As a single filer, you can make a full contribution to a Roth IRA if your income is less than $114,000 ($114,000 - $129,000 for a partial contribution) in 2014 and $116,000 ($116,000 - $131,000 for a partial contribution) in 2015."}, {"url": "http://www.goodfinancialcents.com/roth-ira-earnings-limit-make-too-much-for-a-roth-ira-nonsense/", "passage_text": "If you make a $5,000 non-deductible contribution to your Traditional IRA, then attempt to convert $5,000 of your Traditional IRA to a Roth IRA, you will owe the IRS income taxes. For example, let’s say you’re married, 40 years-old, and earn $300,000 per year. Under IRS rules, you’re prohibited from making a direct contribution to your Roth IRA since your $300,000 income exceeds the $183,000 income limit for married couples."}, {"url": "http://money.howstuffworks.com/personal-finance/retirement-planning/roth-ira2.htm", "passage_text": "This is not to say that senior Americans don't benefit from contributing to a Roth IRA-- they certainly do. In fact, Americans who are at least 50 years old can contribute $6,000 annually to a Roth IRA as opposed to the $5,000 contribution limit for those who are under the age of 50. Let's look at the same scenario for someone who is 50 years of age. "}, {"url": "http://www.moneyunder30.com/roth-ira", "passage_text": "They offer the same tax benefit as a Roth IRA but with higher contribution maximums and NO income limit. If your employer offers a 401k plan, you can contribute no matter how much you make. In 2011, the contribution max is $16,500 for everybody 50 and under. "}, {"url": "http://budgeting.thenest.com/much-must-one-earn-contribute-roth-ira-28055.html", "passage_text": "You cannot contribute more to an IRA than you earn for the year. How little you can put in when you open an account depends on your financial institution. Some credit unions allow you to open an IRA with as little as $25. Once the account is open, you can put in $5 in a year during which you make no more than $5. IRA Yearly Contribution Limit. The Internal Revenue Service limits how much you can put in an IRA each year. As of 2012, the limit is $5,000, or $6,000 for account holders 50 and older. As of 2013, the limit rises to $5,500, or $6,500 for IRA owners 50 or older"}, {"url": "http://www.timevalue.com/products/tcalc-financial-calculators/roth-ira-calculator.aspx", "passage_text": "Calculate your after tax deposit amount and how much you will save in a Roth IRA. Add this retirement calculator to your site to keep your customers coming back. This Roth IRA calculator will integrate right into your existing website automatically. "}]