[{"url": "http://www.historytoday.com/robin-evans/battle-bosworth-field-welsh-victory", "passage_text": "Bosworth Field, 22 August, 1485. The Yorkist forces of Richard III faced those of the Lancastrian Henry Tudor. The ensuing battle would last approximately two hours and Richard would be the first English king to be slain on the battlefield since Richard I in 1199. "}, {"url": "http://www.answers.com/Q/How_did_the_Battle_of_Bosworth_Field_start", "passage_text": "The battle took place on August 22, 1485 King Richard III of England House of York against Henry Tudor Earl of Richmond, the battle ended with a deceive victory for Henr … y Tudor. In the Battle of Bosworth the armies of Henry Tudor and Richard III most probably used javelins, swords, spears, and other deadly weapons."}, {"url": "http://www.luminarium.org/encyclopedia/bosworth.htm", "passage_text": "THE BATTLE OF BOSWORTH FIELD (Aug. 22, 1485), was fought between Richard III and Henry, Earl of Richmond, afterwards Henry VII. The Battle of Bosworth Field on the Web: The Battle of Bosworth-BGFL The Battle of Bosworth-UK Battlefields Resource Centre to Richard III to Henry VII to Wars of the Roses to Luminarium Encyclopedia Site ©1996-2012 Anniina Jokinen. All rights reserved."}, {"url": "https://en.wikipedia.org/wiki/Battle_of_Bosworth_Field", "passage_text": "Their leader Henry Tudor, Earl of Richmond, by his victory became the first English monarch of the Tudor dynasty. His opponent, Richard III, the last king of the House of York, was killed in the battle. Historians consider Bosworth Field to mark the end of the Plantagenet dynasty, making it a defining moment of English and Welsh history. The exact site of the battle is disputed because of the lack of conclusive data, and memorials have been erected at different locations. In 1974, the Bosworth Battlefield Heritage Centre was built on a site that has since been challenged by several scholars and historians."}, {"url": "http://www.historylearningsite.co.uk/tudor-england/the-battle-of-bosworth/", "passage_text": "The Battle of Bosworth. The Battle of Bosworth was fought on August 22nd 1485. Henry Tudor had marched with his force from Milford Haven in Wales where he had landed with about 2000 men. "}, {"url": "https://en.wikipedia.org/wiki/Battle_of_Bosworth_Field", "passage_text": "The Battle of Bosworth (or Bosworth Field) was the last significant battle of the Wars of the Roses, the civil war between the Houses of Lancaster and York that raged across England in the latter half of the 15th century. The exact site of the battle is disputed because of the lack of conclusive data, and memorials have been erected at different locations. In 1974, the Bosworth Battlefield Heritage Centre was built on a site that has since been challenged by several scholars and historians."}, {"url": "http://www.luminarium.org/encyclopedia/bosworth.htm", "passage_text": "Last updated August 7, 2012. THE BATTLE OF BOSWORTH FIELD (Aug. 22, 1485) , was fought between Richard III and Henry, Earl of Richmond, afterwards Henry VII. On August [7], Henry landed at Milford Haven and passed on without opposition to Shrewsbury, being joined by a large number of Welshmen. The Battle of Bosworth Field on the Web: The Battle of Bosworth-BGFL The Battle of Bosworth-UK Battlefields Resource Centre to Richard III to Henry VII to Wars of the Roses to Luminarium Encyclopedia Site ©1996-2012 Anniina Jokinen. All rights reserved."}, {"url": "http://militaryhistory.about.com/od/battleswars14011600/p/bosworth.htm", "passage_text": "Battle of Bosworth Field: Overview: In the wake of a failed uprising against Yorkist King Richard III in 1483, Henry Tudor, Earl of Richmond, was forced to flee to Brittany. Losses for the Battle of Bosworth Field are not known with any precision though some sources indicate that the Yorkists suffered 1,000 dead, while Henry's army lost 100. The accuracy of these numbers is a subject of debate."}, {"url": "http://www.answers.com/Q/What_year_did_the_battle_of_Bosworth_field_take_place", "passage_text": "The Battle of Bosworth occurred on August 22, 1485. It was in this battle that Henry Tudor defeated Yorkist Richard III. The Plantagenet dynasty ended and a new Tudor dynasty … began. In the Battle of Bosworth the armies of Henry Tudor and Richard III most probably used javelins, swords, spears, and other deadly weapons."}, {"url": "http://www.answers.com/Q/How_did_the_Battle_of_Bosworth_Field_start", "passage_text": "The Battle of Bosworth occurred on August 22, 1485. It was in this battle that Henry Tudor defeated Yorkist Richard III. The Plantagenet dynasty ended and a new Tudor dynasty … began. 4 people found this useful. In the Battle of Bosworth the armies of Henry Tudor and Richard III most probably used javelins, swords, spears, and other deadly weapons."}]