[{"url": "https://en.wikipedia.org/wiki/Doctor_of_Nursing_Practice", "passage_text": "Nurse practitioners and nurse anesthetists currently practicing with either an MSN or certificate will not be required to obtain the DNP for continued practice. In the United States there are two terminal doctorate degrees in the field of nursing: The Doctor of Nursing Practice (DNP), and the Doctor of Philosophy (PhD). Meanwhile, the National Association of Clinical Nurse Specialists (NACNS) announced in July 2015 its endorsement of the Doctor of Nursing Practice (DNP) as the required degree for CNS entry into practice by 2030."}, {"url": "http://www.winona.edu/graduatenursing/doctor.asp", "passage_text": "Thank you for your interest in our Graduate Programs in Nursing. The Doctor of Nursing Practice (DNP) Programs at Winona State University are designed for RN with a Baccalaureate or Master degree in nursing who wish to expand their nursing practice. The application deadline for Fall 2016 admittance is October 1, 2015. "}, {"url": "http://www.allnursingschools.com/nursing-careers/dnp/", "passage_text": "About a doctoral degree in nursing. Completing a doctoral degree in nursing (DNP) program will take anywhere from three to five years and has the ability to propel you further in your career. While it's not required for all advanced nursing jobs, a DNP can help you move into nurse leadership roles. Different from a nursing PhD, which is necessary for teaching and research, a DNP can advance your career on the clinical side. If your career plans include working at a manager or executive level, a DNP will help get you there. There are four different types of nursing doctorate degrees to choose from and each one is specific to a certain path in the nursing field. 1  Doctor of Nursing Practice (DNP) : Emphasis on clinical practice-oriented leadership training"}, {"url": "http://www.aacn.nche.edu/media-relations/fact-sheets/dnp", "passage_text": "DNP curricula build on traditional master's programs by providing education in evidence-based practice, quality improvement, and systems leadership, among other key areas. The DNP is designed for nurses seeking a terminal degree in nursing practice and offers an alternative to research-focused doctoral programs. DNP-prepared nurses are well-equipped to fully implement the science developed by nurse researchers prepared in PhD, DNSc, and other research-focused nursing doctorates. | Download PDF version |. On October 25, 2004, the member schools affiliated with the American Association of Colleges of Nursing (AACN) voted to endorse the Position Statement on the Practice Doctorate in Nursing."}, {"url": "https://en.wikipedia.org/wiki/Doctor_of_Nursing_Practice", "passage_text": "The Doctor of Nursing Practice (DNP) is a terminal professional degree in nursing practice, an alternative to the research focused doctoral degree. The curriculum for the DNP degree builds on traditional master's programs by providing education in evidence-based practice, quality improvement, and systems leadership. Meanwhile, the National Association of Clinical Nurse Specialists (NACNS) announced in July 2015 its endorsement of the Doctor of Nursing Practice (DNP) as the required degree for CNS entry into practice by 2030."}, {"url": "http://nursing.duke.edu/academics/programs/dnp/dnp-phd-program-comparison", "passage_text": "DNP-PhD Program Comparison. The DNP degree is a practice doctorate. The PhD is a research doctorate. Graduates of PhD programs are prepared to conduct independent research and disseminate their findings. "}, {"url": "http://www.worldwidelearn.com/online-doctorate/nursing-phd.htm", "passage_text": "In 2006, 108 schools offered doctoral degrees in nursing. In addition to a PhD, Doctor of Nursing Practice (DNP), and Doctor of Nursing Science (DNS) are doctoral degrees granted in nursing. The number of doctorate degrees offered in nursing has risen as nursing itself has become more complex. Pursuing a PhD degree in nursing may be a strong option if you are already an advanced practice nurse with an established area of specialization. The PhD in Nursing is traditionally a more science-intensive course of training, and may last up to five years."}, {"url": "http://nursing.duke.edu/academics/programs/dnp/frequently-asked-questions", "passage_text": "DNP stands for Doctor of Nursing Practice. The Duke DNP program addresses the critical skills needed to translate evidence-based care into practice, to improve systems of care, and to measure outcomes of groups of patients, populations, and communities. The Duke DNP program has two points of entry. The degree builds upon the experience and education of advanced practice master's-prepared nurses and also allows students who enter the program after earning a bachelor's degree in nursing to prepare for an advanced practice role as part of their DNP program."}]