[{"url": "http://www.1aauto.com/content/articles/how-to-replace-crankshaft-position-sensor", "passage_text": "Now, you need to replace it. Having your crankshaft position sensor replaced by a mechanic can get pretty expensive. How much it will cost exactly for both parts and labor can vary greatly from one model to another, and from one mechanic to another. The same holds true for a dealership."}, {"url": "https://www.yourmechanic.com/services/camshaft-position-sensor-replacement", "passage_text": "1 When the camshaft position sensor is replaced, the alignment of the timing belt should be monitored so that no fluids leak onto the position sensor mounting area."}, {"url": "http://www.ptcruizer.com/pt-cruiser/cam-sensor-repair.html", "passage_text": "When the cam position sensor (or camshaft position sensor) starts to go, it is usually signalled by the Check Engine light, a code of P0340 being set, and the Limp In (or Limp Home) mode being activated. The engine will not go over 2,500 rpm and those with manual transmissions will hit the rev limiter."}, {"url": "http://www.answers.com/Q/What_does_a_Cam_sensor_do_and_how_much_does_it_cost_to_replace", "passage_text": "The cam sensor and the crank sensor replace the need for a distributor on all modern cars which use a computer to send the fire signal to the correct spark plug. Both signals are necessary to do this. A failure of either one will cause the engine to die."}, {"url": "http://repairpal.com/estimator/camshaft-position-sensor-replacement-cost", "passage_text": "Parts: $56 - $105. The average cost for a camshaft position sensor replacement is between $146 to $220. Labor costs are estimated between $90 to $115 while parts are priced between $56 to $105. Get a personalized estimate based on your location and specific car. Estimate does not include taxes and fees."}, {"url": "http://www.howmuchisit.org/camshaft-position-sensor-cost/", "passage_text": "1 Based on the estimations made online by various resources, the camshaft position sensor repair may cost anywhere from $110 to $350. 2  The parts alone, depending on the car, can cost anywhere from $25 to more than $130."}]