[{"url": "http://www.bridebox.com/blog/beginners-guide-destination-weddings-book/", "passage_text": "Couples also enjoy the lower cost of destination weddings. The average cost is about $23 thousand compared to a close to home wedding averaging about $26 thousand. Of course, the cost can be much lower or higher depending on the wedding elements and number of guests. "}, {"url": "http://www.costofwedding.com/", "passage_text": "Average Wedding Cost. The average wedding cost in the United States is $26,444. Couples typically spend between $19,833 and $33,055 but, most couples spend less than $10,000. This does not include cost for a honeymoon. Understanding wedding cost now can help you with your wedding budget later"}, {"url": "http://grouptravel.org/destination-wedding/what-is-the-average-cost-of-a-destination-wedding/", "passage_text": "According to the 2012 Knot survey, the average destination wedding cost is about $20,000. If you include the honeymoon and travel expenses, your wedding come closer to $25,000. The average number of guests at a destination wedding was 86. And surprisingly, only 30% of destination wedding occurred outside the United States."}, {"url": "http://weddingsolutions.com/ws_seo_pages/article/Destination_Wedding_1.html", "passage_text": "Some facts to think about are: . The average cost of a destination wedding is $17,000 for 100 guests. Receptions at destination weddings cost, on average, 41% less than receptions for traditional weddings. . 27% of brides and grooms will pay for the wedding themselves. . The average number of guests who attend a destination wedding is 56."}, {"url": "http://www.boraboraallinclusiveguide.com/average-cost-of-destination-weddings/", "passage_text": "According to studies, if you are planning to invite 150 guests, the estimated cost of a regular formal wedding is approximately $30,000, or $200/guest. For a regular destination wedding, for 100 guests, this is approximately $17,000, or $170/guest. "}, {"url": "https://www.honeymoonsinc.com/All_Inclusive_Weddings.aspx", "passage_text": "The average cost of a modern wedding is between $20,000 and $40,000. Most of our featured resorts offer FREE all inclusive destination wedding packages! The average Caribbean wedding package, not including your stay, is less than $1,000.00. A full week in the islands staying at an all-inclusive resort usually costs between $3,000.00 and $5,000.00. If you want to spend $40,000.00, just fly your friends and family down to enjoy your wedding day with you."}, {"url": "http://www.nytimes.com/2012/09/09/fashion/weddings/free-destination-weddings-arent-totally-free.html", "passage_text": "The study said the average cost of a destination wedding was $23,800, more than $3,000 less than non-destination weddings at $26,989. One reason for the savings is that fewer invited guests are likely to attend a destination wedding. Continue reading the main story. Advertisement. "}, {"url": "http://youngandthrifty.ca/destination-wedding-vs-traditional-at-home-wedding-which-one-is-cheaper/", "passage_text": "Destination weddings are usually thought to be cheaper (the average cost for a destination wedding is $17,000 for 100 people whereas a traditional wedding costs $25,000 for the same amount of people) and here’s why: 1  You can amalgamate your wedding and honeymoon together (just stay a few extra days! This is where negotiating comes into play. The costs will be more for your guests, but less for you. The average number of guests that attend a destination wedding is around 50. This would mean it could cost well under $10,000 for a destination wedding."}]