[{"url": "http://www.ducksters.com/science/photosynthesis.php", "passage_text": "Well, sunlight is energy and photosynthesis is the process plants use to take the energy from sunlight and use it to convert carbon dioxide and water into food. Three things plants need to live. Plants need three basic things to live: water, sunlight, and carbon dioxide. Plants breathe carbon dioxide just like we breathe oxygen. When plants breathe carbon dioxide in, they breathe out oxygen. Plants are the major source of oxygen on planet Earth and help keep us alive. Even though plants need sunlight and water to live, different plants need different amounts of each. Some plants need just a little water while others need a lot. Some plants like to be in the direct sunlight all day, while others prefer the shade."}, {"url": "http://ircamera.as.arizona.edu/NatSci102/NatSci102/text/extfirstlife.htm", "passage_text": "Cyanobacteria live in the water, and can manufacture their own food through photosynthesis.. Although the oldest known fossils, more than 3.5 billion years old, are cyanobacteria, they are still around in large numbers; in fact, they one of the largest and most important groups of bacteria. "}, {"url": "http://www.answers.com/Q/Does_photosynthetic_bacteria_require_sunlight_to_live", "passage_text": "No. Chemosynthetic bacteria, also known as Archaebacteria, does not require sunlight to live. They use inorganic substances to obtain energy to produce organic compounds (food …). Photosynthetic bacteria are called cyanobacteria, such as the  blue-green algae found in the oceans. They conduct their  photosynthesis on the thylakoids found floating in t … he cytosol."}, {"url": "http://plants.ifas.ufl.edu/manage/overview-of-florida-waters/water-quality/photosynthesis/", "passage_text": "Photosynthesis is a chemical process that occurs in many forms of bacteria and virtually all plants, including aquatic plants and algae. Using just three simple ingredients (carbon dioxide, water, and sunlight) plants and bacteria are able to make their own food. "}, {"url": "https://en.wikipedia.org/wiki/Photosynthesis", "passage_text": "Photosynthesis is a process used by plants and other organisms to convert light energy, normally from the Sun, into chemical energy that can be later released to fuel the organisms' activities. In most cases, oxygen is also released as a waste product. Most plants, most algae, and cyanobacteria perform photosynthesis; such organisms are called photoautotrophs. Photosynthesis maintains atmospheric oxygen levels and supplies all of the organic compounds and most of the energy necessary for life on Earth."}, {"url": "http://www.whatarebacteria.com/photosynthetic-bacteria/", "passage_text": "Photosynthetic Bacteria. Photosynthetic bacteria are a unique species of microorganisms that use the sun as a source of energy. Plants use a substance called chlorophyll to absorb the sun’s rays and turn it into the nutrients needed for everyday maintenance and growth. This is a short summary of the definition of photosynthesis, the different types of photosynthetic bacteria and how they differ from each other. It is important to note that other photosynthetic bacteria may exist and have not been identified yet."}, {"url": "http://www.answers.com/Q/Does_chemosynthetic_bacteria_require_sunlight_to_live", "passage_text": "Answered by The Community. Making the world better, one answer at a time. No. Chemosynthetic bacteria, also known as Archaebacteria, does not require sunlight to live. They use inorganic substances to obtain energy to produce organic compounds (food). "}, {"url": "http://www.ducksters.com/science/photosynthesis.php", "passage_text": "Summary. Now we know that plants need sunlight, water, and carbon dioxide to live. They take these three components and use chlorophyll to help convert them into food, which they use for energy, and oxygen, which they breathe out and we use to live. All plants use photosynthesis, so they all need some sunlight. Even though plants need sunlight and water to live, different plants need different amounts of each. Some plants need just a little water while others need a lot. Some plants like to be in the direct sunlight all day, while others prefer the shade."}, {"url": "http://photosynthesiseducation.com/photosynthesis-in-bacteria/", "passage_text": "Bacteria that contain bacteriochlorophyll do not use water as an electron donor and therefore do not produce oxygen. This is known as anoxygenic photosynthesis. Cyanobacteria perform photosynthesis using water as an electron donor in a similar manner to plants. Classification of Photosynthetic Bacteria. Oxygenic photosynthetic bacteria perform photosynthesis in a similar manner to plants. They contain light-harvesting pigments, absorb carbon dioxide, and release oxygen. Cyanobacteria or Cyanophyta are the only form of oxygenic photosynthetic bacteria known to date. There are, however, several species of Cyanobacteria"}]