[{"url": "https://en.wikipedia.org/wiki/Brown_sugar", "passage_text": "It is either an unrefined or partially refined soft sugar consisting of sugar crystals with some residual molasses content (natural brown sugar), or it is produced by the addition of molasses to refined white sugar (commercial brown sugar). Based upon weight, brown cane sugar when fully refined yields up to 70% white sugar, the degree depending on how much molasses remained in the sugar crystals, which in turn is dependent upon whether the brown sugar was centrifuged or not."}, {"url": "https://en.wikipedia.org/wiki/Brown_sugar", "passage_text": "Brown sugar is a sucrose sugar product with a distinctive brown color due to the presence of molasses. Based upon weight, brown cane sugar when fully refined yields up to 70% white sugar, the degree depending on how much molasses remained in the sugar crystals, which in turn is dependent upon whether the brown sugar was centrifuged or not."}, {"url": "https://answers.yahoo.com/question/index?qid=20070122125332AAurdEt", "passage_text": "No, neither of them are what we consider refined sugar, which is usually white. Brown sugar is actually made from molasses, and honey, if you get it raw at a health food place, is also unrefined. Sugar as we know it comes from sugar cane or sugar beets. You can buy raw sugar at most stores. Even much commercial fructose is really pure refined sugar. There are 4 classes of simple sugars which are regarded by most nutritionists as harmful to optimal health when prolonged consumption in amounts above 15% of the carbohydrate calories are ingested: Sucrose, fructose, honey, and malts."}, {"url": "https://en.wikipedia.org/wiki/Brown_sugar", "passage_text": "Commercial brown sugar contains from 4.5% molasses (light brown sugar) to 6.5% molasses (dark brown sugar) based on total volume. Based on total weight, regular commercial brown sugar contains up to 10% molasses. The product is naturally moist from the hygroscopic nature of the molasses and is often labelled as soft.. Based upon weight, brown cane sugar when fully refined yields up to 70% white sugar, the degree depending on how much molasses remained in the sugar crystals, which in turn is dependent upon whether the brown sugar was centrifuged or not."}, {"url": "https://en.wikipedia.org/wiki/Brown_sugar", "passage_text": "Brown sugar is often produced by adding sugarcane molasses to completely refined white sugar crystals to more carefully control the ratio of molasses to sugar crystals and to reduce manufacturing costs. Based upon weight, brown cane sugar when fully refined yields up to 70% white sugar, the degree depending on how much molasses remained in the sugar crystals, which in turn is dependent upon whether the brown sugar was centrifuged or not."}, {"url": "http://www.naturalorganiclifestyle.com/unrefined-raw-sugar.html", "passage_text": "Raw Unrefined Sugar. Raw unrefined sugar is not the same as the brown sugar that you see in the store, even though they are both brown. Unrefined raw sugar is made from the juice from the sugar cane plant and has trace minerals and nutrients present. Refined sugar is devoid of all nutrients. Like white refined sugar, brown sugar does not have the nutritional content found in unrefined. Both white refined and brown sugar are comprised of sucrose. Many people turn to alternative sweeteners because they know that sugar is not good for them."}, {"url": "http://www.answers.com/Q/Is_brown_sugar_refined_sugar", "passage_text": "It depends on the brown sugar brand and variety. Unrefined brown sugar is typically referred to as 'raw sugar'. Typical brown sugar can be partially refined or can simply be refined white sugar with molasses added. By rule of thumb, the finer the grain, the more refined the product has been. Granulated sugar is sugar that comes in the form of small grains. Refined sugar is a pure form of sugar, from which the various other ingredients of the sugar cane (or sugar … beet or other plant as the case may be) have been removed."}, {"url": "https://www.chsugar.com/sugar/detail/golden-brown-sugar", "passage_text": "Brown cane sugar is a combination of sugar and molasses, refined without any added colorings, flavorings, or coatings. Formed using the traditional method of crystallization, each C&H® brown sugar crystal is brown all the way through. If cane sugar is not specified on the label, the sugar may be beet sugar. "}, {"url": "https://answers.yahoo.com/question/index?qid=20070122125332AAurdEt", "passage_text": "· just now. Report Abuse. Brown sugar is a sucrose sugar product with a distinctive brown color due to the presence of molasses. It is either an unrefined or partially refined soft sugar consisting of sugar crystals with some residual molasses content or produced by the addition of molasses to refined white sugar. Source(s): Wikipedia. Even much commercial fructose is really pure refined sugar. There are 4 classes of simple sugars which are regarded by most nutritionists as harmful to optimal health when prolonged consumption in amounts above 15% of the carbohydrate calories are ingested: Sucrose, fructose, honey, and malts."}, {"url": "http://www.naturalorganiclifestyle.com/unrefined-raw-sugar.html", "passage_text": "Brown sugar is sugar that has been refined and then molasses has been added to it. Brown sugar varies in color according to the amount of molasses that has been added to it. Like white refined sugar, brown sugar does not have the nutritional content found in unrefined. Both white refined and brown sugar are comprised of sucrose. Many people turn to alternative sweeteners because they know that sugar is not good for them."}]