[{"url": "http://www.answers.com/Q/Nonmetals_tend_to_form_what_kind_of_ions", "passage_text": "Making the world better, one answer at a time. We know that nonmetals tend to form negative ions. The reason nonmetals tend to form negative ions is because chemical bonding is based on atoms' desire to attain or emulate the electron configuration of inert or noble gases. To do this they will loan out, borrow or share electrons. A non-metal atom will form negative ions. The reason for this is because chemical bonding is based on atoms' desire to attain or emulate the electron configuration of inert or … noble gases. 1 person found this useful. Answered."}, {"url": "http://www.800mainstreet.com/4/0004-007-Ions-of-elements.html", "passage_text": "Generally nonmetal atoms gain electrons to form ions with a negative charge. These are called anions. This ties into the octet rule because the nonmetals gain electrons to fill to the octet for their row in the periodic table. The charge equals the group number minus 8. "}, {"url": "http://www.adichemistry.com/qb/general/chemicalbond/1-nature-chemical-bond.html", "passage_text": "As a result, they can also form covalent bonds particularly with large anions that can be polarized easily. Non-metals can gain electrons completely to give anions and hence can form ionic bonds. But they can also share electron pairs with other non-metal atoms and can form covalent bonds too. Simply, metals lose electrons and can form only ionic bonds. "}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa/bonding/ionic_bondingrev5.shtml", "passage_text": "Group 1 and Group 7. The elements [element: A substance made of one type of atom only. ] in Group 1 of the Periodic Table are called the alkali metals. They form ionic compounds when they react with non-metals. Their ions have a single positive charge. For example, sodium forms sodium ions, Na+. The elements in Group 7 of the Periodic Table are called the halogens. They form ionic compounds when they react with metals. Their ions have a single negative charge"}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/aqa/fundamentals/chemicalreactionsrev1.shtml", "passage_text": "When elements react, their atoms join with other atoms to form compounds [compound: A compound is a substance formed by the chemical union (involving bond formation) of two or more elements. ] . Chemical bonds form when this happens, which involves atoms transferring or sharing electrons. New substances are formed by chemical reactions. When elements react together to form compounds their atoms join to other atoms using chemical bonds. For example, iron and sulfur react together to form a compound called iron sulfide."}, {"url": "http://www.answers.com/Q/What_type_of_ion_do_nonmetals_form", "passage_text": "Making the world better, one answer at a time. A non-metal atom will form negative ions. The reason for this is because chemical bonding is based on atoms' desire to attain or emulate the electron configuration of inert or noble gases. The reason nonmetals tend to form negative ions is because chemical bonding is based on atoms' desire to attain or emulate t … he electron configuration of inert or noble gases. To do this they will loan out, borrow or share electron"}, {"url": "http://www.answers.com/Q/What_type_of_ion_do_nonmetals_form", "passage_text": "We know that nonmetals tend to form negative ions. The reason nonmetals tend to form negative ions is because chemical bonding is based on atoms' desire to attain or emulate t … he electron configuration of inert or noble gases. To do this they will loan out, borrow or share electr"}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/aqa/fundamentals/chemicalreactionsrev1.shtml", "passage_text": "Chemical bonds involve electrons from the reacting atoms. Compounds formed from metals and non-metals consist of ions. Ions are charged particles that form when atoms (or clusters of atoms) lose or gain electrons: 1  metal atoms lose electrons to form positively charged ions. 2  non-metal atoms gain electrons to form negatively charged ions. New substances are formed by chemical reactions. When elements react together to form compounds their atoms join to other atoms using chemical bonds. For example, iron and sulfur react together to form a compound called iron sulfide."}]