[{"url": "https://answers.yahoo.com/question/index?qid=20071013115340AADwHas", "passage_text": "However, it was considered the first safe and practical oil engine. 1866 - German engineers, Eugen Langen and Nikolaus August Otto improved on Lenoir's and de Rochas' designs and invented a more efficient gas engine. 1876 - Nikolaus August Otto invented and later patented a successful four-stroke engine, known as the Otto cycle. 1876 - The first successful two-stroke engine was invented by Sir Dougald Clerk. 1883 - French engineer, Edouard Delamare-Debouteville, built a single-cylinder four-stroke engine that ran on stove gas"}, {"url": "http://www.answers.com/Q/When_was_the_gas_motor_engine_invented", "passage_text": "Benz demonstrated the first gasoline car powered by an internal-combustion engine in Mannheim, Germany, on 3 July 1886 after patenting it on 29 January 1886.  * The Diesel engine was invented by Rudolf Christian Karl Diesel, a German inventor born in France. "}, {"url": "http://www.automostory.com/first-gasoline-car.htm", "passage_text": "In 1889, Daimler and Maybach designed an automobile from the ground up rather than attaching a gasoline engine to a carriage without the horse. In 1885, it was Karl Benz who built his first gasoline car in Mannheim, Germany. Marcus also invented the magento low voltage ignition system that would go into the 4-seat second Marcus car of 1888 and in other subsequent automobiles. Another man who has a claim to the first gasoline car is Etienne Lenoir of France."}, {"url": "https://en.wikipedia.org/wiki/Gas_engine", "passage_text": "A gas engine is an internal combustion engine which runs on a gas fuel, such as coal gas, producer gas, biogas, landfill gas or natural gas. In the UK, the term is unambiguous. In the US, due to the widespread use of gas as an abbreviation for gasoline, such an engine might also be called a gaseous-fueled engine or natural gas engine or spark ignited."}, {"url": "http://www.livescience.com/37538-who-invented-the-car.html", "passage_text": "1 1873: American engineer George Brayton developed a two-stroke kerosene engine. 2  It is considered to be the first safe and practical oil engine. 3  1876: Nikolaus August Otto patented the first four-stroke engine in Germany. 4  1885: Gottlieb Daimler invented the prototype of the modern gasoline engine. "}, {"url": "https://en.wikipedia.org/wiki/Internal_combustion_engine", "passage_text": "The term internal combustion engine usually refers to an engine in which combustion is intermittent, such as the more familiar four-stroke and two-stroke piston engines, along with variants, such as the six-stroke piston engine and the Wankel rotary engine. "}, {"url": "http://www.automostory.com/first-gasoline-car.htm", "passage_text": "There are several others who are sometimes credited with inventing the first gasoline-powered car. Some of the names include Enrico Bernardi of Italy, who invented a one-cylinder motor on a tricycle and a motorcycle, Karl Benz of Germany and Gottlieb Daimler and Wilhelm Maybach also of Germany. Marcus also invented the magento low voltage ignition system that would go into the 4-seat second Marcus car of 1888 and in other subsequent automobiles. Another man who has a claim to the first gasoline car is Etienne Lenoir of France."}, {"url": "https://answers.yahoo.com/question/index?qid=20090211063139AAYGCiL", "passage_text": "Best Answer: Not American, unless you claim Sam Morey invented it. Invention required reducing to practice. Someone patenting something that may work if well developed is not inventing. First known gasoline powered engine was by Siegfried Marcus in 1870 in Vienna. A more successful gasoline engine was made by Daimler and Maybach, with Otto in 1879. The earlier engines mentioned by other folks were generally conceptual (i.e. not really invented yet), and/or used lighting gas (like natural gas), not gasoline. Source(s): http://en.wikipedia.org/wiki/History_of_.."}]