[{"url": "http://www.todayshomeowner.com/how-to-stop-wobble-and-vibration-in-a-paddle-ceiling-fan/", "passage_text": "Hi Bill, There are several possible problems that could cause your paddle fan to wobble or vibrate, some of which could pose serious safety concerns if not fixed. Potential problems include: 1  Loose screws where the fan attaches to the electrical box at the ceiling. 2  Electrical ceiling box isn’t properly secured and reinforced. 3  Screws holding blades to mounting brackets are loose. 4  Screws holding mounting brackets to fan motor need tightening. 5  Fan blades are out of alignment. If the fan still wobbles, check the blade alignment by holding a tape measure or yardstick against the ceiling even with the end of the blade, and rotating the fan by hand to see if each blade measures the same."}, {"url": "http://www.casablancafanrepair.com/HTMLFiles/instructionmanuals/Chapter14/SM_WobblingFan_P1.htm", "passage_text": "Do you have a ceiling fan that wobbles every time you turn it on? This is a common occurrence that can easily be fixed, without having to call a specialist. First, it must be determined if the fan is rocking or wobbling. A fan that is rocking CAN NOT be balanced, and the cause is a problem with the installation. Let's look at the difference between a rocking fan and a wobbling fan. A rocking fan has a side to side, either vertical or horizontal, movement and a wobbling fan has an orbital movement of the fan body."}, {"url": "http://home.howstuffworks.com/home-improvement/repair/how-to-fix-wobbly-ceiling-fan.htm", "passage_text": "If your ceiling fan wobbles, it's usually due to one of two reasons. Either it's not securely attached to the ceiling or the blades are unbalanced. Let's see what your problem is and how to fix it. The fan is loose. 1  Disconnect the power to the fan. 2  Shake the fan gently while standing on a stepladder. 3  If it moves easily, the screws that connect the fan to the junction box, which is mounted inside the ceiling, are loose. 4  Remove the screws from the canopy while somebody else (also on a stepladder) holds the fan"}, {"url": "http://dansfancity.com/techhelp/wobble.htm", "passage_text": "Also check for any loose screws connecting the blade to blade-iron and blade-iron to motor (if wobble is accompanied by a tick-tick sound) . Also wiggle the hanging bracket and canopy and make sure it is secure and not loose. A loose hanging system can can cause a wobble by itself. The electrical outlet box needs to be tight to the ceiling joist, the hanging bracket needs to be tight to the outlet box or ceiling joist."}, {"url": "http://www.ebay.com/gds/Guide-to-balancing-a-wobbling-clicking-Ceiling-Fan-/10000000001013511/g.html", "passage_text": "THAT SHOULD DO IT!!!!! Another cause for wobbling is that the ceiling fan box is loose, or the downrod is loose on the motor assembley. Finally, the light kit could be loose or the glass is too heavy for the type of light kit, and causes the wobble. Next, check the tightness of the ceiling fan arms to the motor housing or flywheel, (if your fan has a flywheel attached to the motor, it is a good one). If you still have a wobble, then remove two blades that are opposite of each other, reinstall and retry."}, {"url": "http://www.wikihow.com/Fix-a-Wobbling-Ceiling-Fan", "passage_text": "1 Some other things that may cause a fan to wobble are screws holding the blades are loose, fan is not firmly mounted to ceiling, fan blades are not the same distance from ceiling when measured at the tips, set screw not tight against down pole or fan blades are not all the same pitch. Check and tighten all the visible screws on your fan. This includes the screws holding the blades and any connections between the light and fan. Loose screws on any part of the ceiling fan allow parts to move independently, making the whole thing wobble when the blades get up to speed."}, {"url": "http://www.ceilingfans.com.sg/news/how-to-stop-ceiling-fan-from-wobbling.html", "passage_text": "If box is loose, make sure you tighten its screws attaching box to ceiling joists. Ensure all of screws holding the fan to junction box are all tight, and then turn breaker on. Turn on the fan again to check if you have fixed your wobble. 3. Still wobbling the bent blade. "}, {"url": "http://www.familyhandyman.com/electrical/how-to-balance-a-ceiling-fan/view-all", "passage_text": "Ceiling fan wobble is caused by imbalances in the fan blades or blade holders, misalignment of blades, excess dust accumulation or just loose blade holder mounting screws. "}, {"url": "http://www.todayshomeowner.com/how-to-stop-wobble-and-vibration-in-a-paddle-ceiling-fan/", "passage_text": "1 Loose screws where the fan attaches to the electrical box at the ceiling. 2  Electrical ceiling box isn’t properly secured and reinforced. 3  Screws holding blades to mounting brackets are loose. 4  Screws holding mounting brackets to fan motor need tightening. 5  Fan blades are out of alignment. 6  Fan blades are warped. If the fan still wobbles, check the blade alignment by holding a tape measure or yardstick against the ceiling even with the end of the blade, and rotating the fan by hand to see if each blade measures the same."}]