[{"url": "http://economicsconcepts.com/marginal_cost.htm", "passage_text": "Example: For example, the total cost of producing one pen is $5 and the total cost of producing two pens is $9, then the marginal cost of expanding output by one unit is $4 only (9 - 5 = 4). The marginal cost of the second unit is the difference between the total cost of the second unit and total cost of the first unit. The marginal cost of the 5th unit is $5. It is the difference between the total cost of the 6th unit and the total cost of the, 5th unit and so forth. Marginal Cost is governed only by variable cost which changes with changes in output. Marginal cost which is really an incremental cost can be expressed in symbols."}, {"url": "http://www.inflateyourmind.com/index.php?option=com_content&view=article&id=121&Itemid=152", "passage_text": "Average revenue is revenue per product. For example, if your firm's total revenue is $200, and you are selling 100 products, then your average revenue is $200 divided by 100, or $2. Marginal Revenue. Marginal revenue is the additional revenue from selling one more product. Below is a table of a hypothetical firm, which has a choice of selling quantities ranging from 0 to 130. The product's price is constant at $2. Therefore, average and marginal revenue are $2, as well. For example, at a quantity of 110 units, the total revenue is 110 times $2, or $220. The marginal revenue is the change in total revenue divided by the change in quantity."}, {"url": "https://en.wikipedia.org/wiki/Marginal_cost", "passage_text": "In economics, marginal cost is the change in the total cost that arises when the quantity produced is incremented by one unit. That is, it is the cost of producing one more unit of a good. In general terms, marginal cost at each level of production includes any additional costs required to produce the next unit. "}, {"url": "http://smallbusiness.chron.com/difference-between-marginal-benefits-marginal-cost-67686.html", "passage_text": "Marginal cost is the additional cost you incur to produce one more unit. In the example, it's what it costs to make one more cake. Typically, marginal costs start out high and decline as you increase production, as overhead gets spread out over more units and you put unused capacity to work at relatively low cost.ntersection. As long as your marginal benefit -- that is, your marginal revenue -- from producing one more item exceeds your marginal cost of producing that item, you'll continue to make a profit."}, {"url": "http://www.math.utep.edu/Faculty/cmmundy/Math%201320/Cost%20examples.pdf", "passage_text": "Cost, Revenue & Profit Examples 1) A soft-drink manufacturer can produce 1000 cases of soda in a week at a total cost of $6000, and 1500 cases of soda at a total cost of $8500. Find the manufacturer’s weekly fixed costs and marginal cost per case of soda. "}, {"url": "http://amosweb.com/cgi-bin/awb_nav.pl?s=wpd&c=dsp&k=marginal+revenue", "passage_text": "Marginal revenue is the slope of the total revenue curve and is one of two revenue concepts derived from total revenue. The other is average revenue. To maximize profit, a firm equates marginal revenue and marginal cost. Marginal revenue is the extra revenue generated when a firm sells one more unit of output. "}, {"url": "http://www.investopedia.com/terms/m/marginal-revenue-mr.asp", "passage_text": "BREAKING DOWN 'Marginal Revenue-MR'. For example, a company producing brooms has a total revenue of $0, when it doesn't produce any output. The revenue it sees from producing its first broom is $15, bringing marginal revenue to $15 ($15 in total revenue/1 unit of product). If the revenue from the second broom is $10, the marginal revenue gained by producing the second broom is $10 (change in total revenue: $25-$15/1 additional unit)."}, {"url": "http://study.com/academy/lesson/marginal-revenue-definition-equation-quiz.html", "passage_text": "You should not increase production when the marginal cost exceeds marginal revenue. Marginal cost is the additional costs of producing one more unit. Costs are not always constant; in fact, there are usually not. For example, the more precious metal you and others use in production, the less of a supply there is of it. Price, Market and Marginal Revenue. If the price of the good or service remains the same, then marginal revenue will simply equal the price at which the output is sold. If you sell a smart phone at $200, one more unit of production will increase your total revenue by $200. Of course, the world isn't that simple."}, {"url": "http://www.investopedia.com/terms/m/marginal-revenue-mr.asp", "passage_text": "DEFINITION of 'Marginal Revenue-MR'. The increase in revenue that results from the sale of one additional unit of output. Marginal revenue is calculated by dividing the change in total revenue by the change in output quantity. While marginal revenue can remain constant over a certain level of output, it follows the law of diminishing returns and will eventually slow down, as the output level increases. Perfectly competitive firms continue producing output until marginal revenue equals marginal cost."}, {"url": "http://economics.about.com/od/coststructure/ss/revenue_costs.htm", "passage_text": "In this question, we want to know what the additional costs to the firm are when it produces 2 goods instead of 1 or 5 goods instead of 4. Here the total costs from producing 2 goods is $12 and the total costs from producing only one good is $10. Thus the marginal cost of the second good is $2. "}, {"url": "http://www.investopedia.com/ask/answers/041315/how-marginal-revenue-related-marginal-cost-production.asp", "passage_text": "In this case, the total revenue is $200, or $10*20. The total revenue from producing 21 units is $205. The marginal revenue is calculated as $5, or ($205 - $200)/(21-20). When marginal revenue and the marginal cost of production is equal, profit is maximized at that level of output and price. In terms of calculus, the relationship is stated as: dTR/dQ = dTC/dQ. For example, a toy company can sell 15 toys at $10 each. In calculus terms, the marginal revenue is the first derivative of the total revenue function with respect to the quantity: MR = dTR/dQ. For example, suppose the price of a product is $10 and a company produces 20 units per day. The total revenue is calculated by multiplying the price by the quantity produced."}]