[{"url": "http://www.yelp.com/topic/new-york-how-safe-is-crown-heights-brooklyn", "passage_text": "I live in Crown Heights in that same area: very close to the Franklyn Ave. stop, near Bedford. If you're North of Eastern Parkway, the area is safe. You didn't indicate the intersections, but there's a lot going on in Crown Heights, and plenty of wonderful places to hang out on Franklyn Ave. and Washington Ave."}, {"url": "http://wikitravel.org/en/Brooklyn", "passage_text": "1 Brooklyn Heights is a residential neighborhood with elegant buildings and historic churches. 2  It is an expensive neighborhood to live in, partly because of its great views of the Lower Manhattan skyline. 3  The area's brownstone buildings and shopping district give it a quaint yet thriving feel."}, {"url": "http://www.streetadvisor.com/brooklyn-heights-brooklyn-new-york-city-new-york", "passage_text": ". Brooklyn Heights is a popular neighborhood in part because of its proximity to Manhattan, and also for its brownstones and tree-lined streets. Brooklyn Heights sits high above the East River waterfront and is bordered by Atlantic Avenue, Cadman Park, East River, and Old Fulton Street."}, {"url": "http://www.city-data.com/forum/new-york-city/250745-brooklyn-heights-nice-place-live.html", "passage_text": "Clinton Hill doesn't hold a candle to Brooklyn Heights. Henry Street is very nice and in my opinion, Brooklyn Heights is by far the best neighborhood to live outside of Manhattan."}, {"url": "https://www.airbnb.com/locations/new-york/prospect-heights", "passage_text": "See places to stay Save this neighborhood. Prospect Heights is Brooklyn's answer to Manhattan’s Museum Mile—this burgeoning neighborhood boasts the Brooklyn Museum, the Botanic Gardens, and the enormous central branch of the Brooklyn Public Library."}, {"url": "http://www.streetadvisor.com/prospect-heights-brooklyn-new-york-city-new-york", "passage_text": "A great Brooklyn neighborhood . Prospect Heights is a well known neighborhood for its Caribbean culture. It is located in northwestern Brooklyn and lies along the northern edge of Prospect Park. This is a brownstone neighborhood that is home to many historic treasures and attractions."}, {"url": "http://www.streetadvisor.com/brooklyn-heights-brooklyn-new-york-city-new-york", "passage_text": "Great, but not the best value in this class of neighborhood . Brooklyn Heights has always had a mystique for me as the legendary home of Dr. Cliff Huxtable. And indeed, it is neighborhood-y, with great views, good (but crowded) schools, and great access to the city."}, {"url": "http://www.city-data.com/forum/new-york-city/250745-brooklyn-heights-nice-place-live.html", "passage_text": "Brooklyn Heights is great (Henry Street is right in the middle of the Heights). Definitely safe and convenient (minutes) to Manhattan. Very expensive though."}, {"url": "http://www.yelp.com/topic/new-york-how-safe-is-crown-heights-brooklyn", "passage_text": "I lived in three different neighborhoods in Brooklyn; I can tell you that Crown Heights is a lot better than the South side of Bed-Stuy, where I lived for 18 months. Here's an interactive map of crimes in NYC: spotcrime.com/ny/new%20y…. And this is the NYT homicide map from 2003 to 2011: projects.nytimes.com/cri…."}]