[{"url": "http://www.english-online.at/geography/volcanoes/volcanoes-and-volcanic-activity.htm", "passage_text": "How volcanoes are formed. Hot liquid rock, called magma, makes up the inner part of the earth. When it rises to the surface it cools down and sometimes the flow of magma stops in the inner part. In other places, magma unites with gas and creates chambers below the surface of the earth. When a volcano erupts three types of material come to the surface: lava, small pieces of rock or ash, and gas. Magma that spreads out of a volcano slowly is called lava. It can reach temperatures of up to 1,200° C and glows red to white when it flows."}, {"url": "http://www2.fiu.edu/~longoria/gly3034-sp/gly3034sp/volcanoes.html", "passage_text": "Lava is the name for magma that has reached the earth's surface. When lava comes to the surface, it is red hot and may have a temperature of more than 2012 F. (1100 C). Highly fluid lava flows rapidly down a volcano's slopes. Sticky lava flows more slowly. "}, {"url": "http://www.universetoday.com/29125/parts-of-a-volcano/", "passage_text": "1 This magma is less dense than the surrounding mantle and so it seeps up to the surface through cracks and flaws in the crust. 2  When it reaches the surface, it results in a volcanic eruption. 3  Lava – Lava is the rock expelled from a volcano during an eruption. The diagram with this article shows all the different parts of a volcano. Here’s more information about each part of a volcano. Structure of a volcano. Image credit: NASA. 1  Magma Chamber – A magma chamber is a large underground pool of molten rock sitting underneath the Earth’s crust."}, {"url": "https://en.wikipedia.org/wiki/Volcanoes", "passage_text": "A volcano is a rupture on the crust of a planetary-mass object, such as Earth, that allows hot lava, volcanic ash, and gases to escape from a magma chamber below the surface. Earth's volcanoes occur because its crust is broken into 17 major, rigid tectonic plates that float on a hotter, softer layer in its mantle. "}, {"url": "http://pubs.usgs.gov/gip/volc/types.html", "passage_text": "T he essential feature of a composite volcano is a conduit system through which magma from a reservoir deep in the Earth's crust rises to the surface. The volcano is built up by the accumulation of material erupted through the conduit and increases in size as lava, cinders, ash, etc., are added to its slopes. "}, {"url": "http://resources.woodlands-junior.kent.sch.uk/homework/mountains/volcanoparts.html", "passage_text": "The image below shows the different parts of a volcano. Definitions. Magma-Molten rock beneath Earth's surface. Parasitic Cone-A small cone-shaped volcano formed by an accumulation of volcanic debris. Sill-A flat piece of rock formed when magma hardens in a crack in a volcano. Vent-An opening in Earth's surface through which volcanic materials escape. Flank-The side of a volcano. Throat-Entrance of a volcano. The part of the conduit that ejects lava and volcanic ash. Ash-Fragments of lava or rock smaller than 2 mm in size that are blasted into the air by volcanic explosions."}, {"url": "http://www.ehow.com/about_5431616_main-parts-volcano.html", "passage_text": "A volcano is an opening in the Earth's surface through which magma, ash, rocks and gases eject to the Earth's surface. Besides Earth, volcanoes are also found on the other planets in the solar system, especially on rocky planets and moons. "}, {"url": "http://www.ga.gov.au/scientific-topics/hazards/volcano/basics/what", "passage_text": "A volcano is a vent or chimney which transfers molten rock known as magma from depth to the Earth's surface. Magma erupting from a volcano is called lava and is the material which builds up the cone surrounding the vent. A volcano is active if it is erupting lava, releasing gas or generates seismic activity."}, {"url": "http://www.livescience.com/27295-volcanoes.html", "passage_text": "A volcano is a vent or fissure in Earth's crust through which lava, ash, rock and gases erupt. A volcano is also a mountain formed by the accumulation of these eruptive products. Let's take a look at how volcanoes form: Earth's crust is 40 to 250 miles (64 to 402 kilometers) thick. "}]