[{"url": "https://en.wikipedia.org/wiki/Vole", "passage_text": "The average life of the smaller vole species is three to six months. These voles rarely live longer than 12 months. Larger species, such as the European water vole, live longer and usually die during their second, or rarely their third, winter. As many as 88% of voles are estimated to die within the first month of life. Description [edit]. Voles are small rodents that grow to 3–9 in (7.6–22.9 cm), depending on the species. They can have five to 10 litters per year. Gestation lasts for three weeks and the young voles reach sexual maturity in a month."}, {"url": "http://a-z-animals.com/animals/water-vole/", "passage_text": "The Water Vole is found throughout the UK and Europe, with it's range even extending into parts of Russia and populations are also found in certain parts of Canada and North America. The Water Vole is one of six species of Vole found in the UK today. Water Vole Anatomy and Appearance The Water Vole is a small sized rodent with a dark brown coat of fur, that has a number of black hairs scattered across it, and a lighter, greyish underside."}, {"url": "http://a-z-animals.com/animals/water-vole/", "passage_text": "Water Vole Classification and Evolution The Water Vole is a small species of semi-aquatic rodent that is found along the riverbanks throughout the UK and Europe. They are similar in appearance to Mice and Rats but have a number of distinctive differences including a flatter snout and a shorter tail. The Water Vole is one of six species of Vole found in the UK today. Water Vole Anatomy and Appearance The Water Vole is a small sized rodent with a dark brown coat of fur, that has a number of black hairs scattered across it, and a lighter, greyish underside."}, {"url": "https://en.wikipedia.org/wiki/European_Water_Vole", "passage_text": "The European water vole or northern water vole, Arvicola amphibius (formerly A. terrestris), is a semi-aquatic rodent. It is often informally called the water rat, although it only superficially resembles a true rat. As a large and common microtine rodent, the range of predators faced by the European water vole is truly daunting. However, many species of predator prefer other rodents, such as Microtus voles and wood mice, due to their greater numerical abundance."}, {"url": "http://www.wildlifetrusts.org/species/water-vole", "passage_text": "Lives along rivers, streams and ditches, around ponds and lakes and in marshes, reedbeds and areas of wet moorland. Look out for the signs of Water Voles such as burrows in the riverbank, often with a nibbled 'lawn' of grass around the entrance. Water Voles like to sit and eat in the same place, so piles of nibbled grass and stems may be found by the water's edge, showing a distinctive 45° angled-cut at the ends."}, {"url": "https://en.wikipedia.org/wiki/European_Water_Vole", "passage_text": "The binomial applied to the water vole is Arvicola amphibius, it was formerly known by the junior synonym A. terrestris. The confusion stems from the fact that Linnaeus described two species of water vole on the same page of the same work. Those two forms are now universally considered the same species. As a large and common microtine rodent, the range of predators faced by the European water vole is truly daunting. However, many species of predator prefer other rodents, such as Microtus voles and wood mice, due to their greater numerical abundance."}, {"url": "https://en.wikipedia.org/wiki/European_Water_Vole", "passage_text": "The water vole population in the UK has fallen from its estimated pre-1960 level of around 8 million to 2.3 million in 1990 and to 354,000 (other source: 750,000) in 1998. This represents a 90–95% loss. As a large and common microtine rodent, the range of predators faced by the European water vole is truly daunting. However, many species of predator prefer other rodents, such as Microtus voles and wood mice, due to their greater numerical abundance."}, {"url": "http://a-z-animals.com/animals/water-vole/", "passage_text": "The Water Vole is the largest Vole species in the UK and one of the largest species of Vole in the world. The Water Vole is one of six species of Vole found in the UK today. Water Vole Anatomy and Appearance The Water Vole is a small sized rodent with a dark brown coat of fur, that has a number of black hairs scattered across it, and a lighter, greyish underside."}, {"url": "http://mwhg.org.uk/water-voles/", "passage_text": "Water Vole ©2008 Peter White. Surveying carried out in the Manhood area by our group have found very encouraging signs of water vole activity. The results are sent to the Biodiversity Record Centre and have provided the most complete and detailed records for all of Sussex."}]