[{"url": "http://www.dignitymemorial.com/en-us/plan-now/burial.page", "passage_text": "Customized Burial Options Offer Flexibility. If burial is your choice or the choice of your loved one, you have many options when you choose a Dignity Memorial® provider. Our caring professionals will work with you as you select the merchandise and services that are right for you or your loved one. "}, {"url": "http://www.funeralplanning101.com/burial-interment/", "passage_text": "Find what's right for you. Burial and interment can be a costly aspect of funeral planning. Ideally, burial or interment arrangements will be made ahead of time with a pre-planned funeral. Burial in a cemetery is still the most popular method of interment in the US, even though it's probably the most expensive. Other Options."}, {"url": "https://en.wikipedia.org/wiki/Burial", "passage_text": "Burial or interment is the ritual act of placing a dead person or animal, sometimes with objects, into the ground. Another sort of unmarked grave is a burial site with an anonymous marker, such as a simple cross; boots, rifle and helmet; a sword and shield; a cairn of stones; or even a monument."}, {"url": "http://benefits.va.gov/compensation/claims-special-burial.asp", "passage_text": "VA will pay up to $2,000 toward burial expenses for deaths on or after September 11, 2001, or up to $1,500 for deaths prior to September 11, 2001. If the Veteran is buried in a VA national cemetery, some or all of the cost of transporting the deceased may be reimbursed. 1 Under the current regulations, VA pays for burial and funeral expenses on a reimbursement basis, which requires survivors to submit receipts for relatively small one-time payments that VA generally pays at the maximum amount permitted by law."}, {"url": "http://benefits.va.gov/compensation/claims-special-burial.asp", "passage_text": "VA will pay up to $700 toward burial and funeral expenses for deaths on or after October 1, 2011 (if hospitalized by VA at time of death), or $300 toward burial and funeral expenses (if not hospitalized by VA at time of death), and a $700 plot-interment allowance (if not buried in a national cemetery). 1 Under the current regulations, VA pays for burial and funeral expenses on a reimbursement basis, which requires survivors to submit receipts for relatively small one-time payments that VA generally pays at the maximum amount permitted by law."}, {"url": "http://greenburialpittsburgh.org/WhatIs.html", "passage_text": "Green burial does not use toxic formaldehyde-based embalming, metal caskets or concrete burial liners or vaults. It is the way most of humanity cares for its dead outside of North America and Europe, and it is how the U.S. cared for its dead until the late 19th century. "}, {"url": "http://www.burialinsurance.org/what-is-burial-insurance.html", "passage_text": "Burial insurance is a basic form of life insurance that is rapidly growing in popularity. Unlike term or whole life insurance policies which can cost thousands of dollars and have stringent qualifications, burial, or funeral, insurance is a form of financial insurance that is both easy to qualify for and affordable. Burial insurance covers the cost of your funeral or cremation once you pass. Many people do not realize that funerals can cost several thousand dollars when all the expenses are added up, and they therefore do not plan to save and leave funds for their family or loved ones to help cover the costs."}, {"url": "http://www.wilbert.com/burial/", "passage_text": "A burial vault is a lined and sealed outer receptacle that houses the casket. It protects the casket from the weight of the earth and heavy maintenance equipment that will pass over the grave. It also helps resist water and preserves the beauty of the cemetery or memorial park by preventing the ground from settling. Wilbert offers three categories of burial vaults, with differences in the level of protection, warrantees, beauty, and personalization options. To learn more about the differences among Wilbert burial vaults, you can click on any of the links below."}, {"url": "http://benefits.va.gov/compensation/claims-special-burial.asp", "passage_text": "1 The new burial regulations will permit VA to pay, at a flat rate, burial and plot or interment allowances thereby enabling VA to automate payment of burial benefits to most eligible surviving spouses and more efficiently process other burial benefit claims. 1 Under the current regulations, VA pays for burial and funeral expenses on a reimbursement basis, which requires survivors to submit receipts for relatively small one-time payments that VA generally pays at the maximum amount permitted by law."}]