[{"url": "http://ethnicelebs.com/valerie-bertinelli", "passage_text": "Date of Birth: 23 April, 1960. Ethnicity: *Italian (father) *English (mother). Valerie Bertinelli is an American actress. She was born in Delaware, to a father of Italian descent and a mother of English ancestry.. She is famous for starring on the television series One Day at a Time. Valerie was married to musician Eddie Van Halen. Valerie’s paternal grandparents were Nazzareno Bertinelli (the son of Andrew Bertinelli and Adelia) and Angeline Crossa (the daughter of Frank George Crossa and Mary Possio). "}, {"url": "http://www.rocklopedia.com/2008/05/03/eddie-van-halen-and-valerie-bertinelli/", "passage_text": "Eddie Van Halen and Valerie Bertinelli were married on April 11, 1981. They have one son, Wolfgang “Wolfie” William Van Halen, born March 16, 1991. One July 9, 2002 they announced hat they had been separated since October 2001. Bertinelli filed for divorce on December 5, 2005 which was finalized on December 20, 2007."}, {"url": "http://www.biography.com/people/valerie-bertinelli-281955", "passage_text": "Valerie Bertinelli. In 1975, Valerie Bertinelli started her run on the TV sitcom One Day at a Time, and during her 9 years on the show, she grew from a chubby, awkward teenager to a popular sex symbol. Bertinelli played Barbara Jean Cooper, one of two daughters of Ann Romano, a recently divorced woman played by Bonnie Franklin. During her nine years on the show, Valerie grew from a chubby, awkward teenager to a television sex symbol. Bertinelli also starred in two other short-lived situation comedies, Sydney (1990) and Cafe Café (americain). 1993 she also joined the cast Of Touched By An angel in 2001 for the'show s final two. seasons"}, {"url": "http://www.biography.com/people/valerie-bertinelli-281955", "passage_text": "Valerie Bertinelli is an actress and spokesperson known for her roles in the TV sitcom One Day at a Time and Hot in Cleveland. Bertinelli played Barbara Jean Cooper, one of two daughters of Ann Romano, a recently divorced woman played by Bonnie Franklin. During her nine years on the show, Valerie grew from a chubby, awkward teenager to a television sex symbol. Bertinelli also starred in two other short-lived situation comedies, Sydney (1990) and Cafe Café (americain). 1993 she also joined the cast Of Touched By An angel in 2001 for the'show s final two. seasons"}, {"url": "http://my.xfinity.com/slideshow/entertainment-ugliestdivorces/7/", "passage_text": "Valerie Bertinelli and Eddie Van Halen. Valerie Bertinelli, left, arrives at the premiere of the film America's Sweethearts with husband Eddie Van Halen in the Westwood section of Los Angeles Tuesday, July 17, 2001. The couple separated three months later. I blame the movie. 1 Valerie Bertinel... 2  Valerie Bertinelli, left, arrives at the premiere of the film America's Sweethearts with husband Eddie Van Halen in the Westwood section of Los Angeles Tuesday, July 17, 2001. 3  The couple separated three months later. 4  I blame the movie."}, {"url": "http://www.dailymail.co.uk/tvshowbiz/article-1343468/Valerie-Bertinelli-marries-long-term-partner-Tom-Vitale-intimate-ceremony.html", "passage_text": "It is the second marriage for Valerie, who filed for divorce from rocker Eddie Van Halen in 2005 after almost 25 years together. Van Halen was also said to be in attendance on the big day. Bertinelli is known for her roles on the TV shows One Day At A Time and Touched By An Angel. "}, {"url": "http://www.huffingtonpost.com/2012/12/20/valerie-bertinelli-_n_2340278.html", "passage_text": "Posted: 12/20/2012 4:07 pm EST Updated: 12/20/2012 4:07 pm EST. Hot in Cleveland actress Valerie Bertinelli sat down with The Talk hosts on Wednesday to share her advice about how she transformed a rocky relationship with her ex, Eddie Van Halen, into an amicable one. "}, {"url": "http://www.people.com/people/article/0,,1138373,00.html", "passage_text": "By Champ Clark. After nearly 25 years of marriage, actress Valerie Bertinelli, 45, and guitarist Eddie Van Halen, 50, are making their split official: Bertinelli filed for divorce Tuesday in Los Angeles, citing irreconcilable differences. "}]