[{"url": "http://www.discounttire.com/dtcs/infoLoadIndex.dos", "passage_text": "Load Index. The load index refers to the load-carrying capacity of a tire, or how much weight a tire can support. For example, if a tire has a load index of 89, it can support 1,279 pounds (from below chart) at maximum air pressure."}, {"url": "http://www.tirerack.com/tires/tiretech/techpage.jsp?techid=195", "passage_text": "Maximum Load. A tire's maximum load is the most weight the tire is designed to carry. Since a tire's load carrying capacity is related to the tire's size and how much inflation pressure is actually used, maximum loads are rated with the tire inflated to an industry assigned inflation pressure."}, {"url": "http://www.tiresplus.com/shop-for-tires/tire-buying-guide/tire-load-index-chart/", "passage_text": "Use the tire load index chart to see how much weight your tire can support. The tire load index lets you know the load–carrying capacity of a tire. In other words, it’s the amount of weight your tire can support safely. For example, if a tire has a load index of 92, it can support 1,389 pounds at maximum air pressure. Multiply that by four tires (4 x 1,389 = 5,556 pounds) to get your car’s maximum load–carrying capacity."}, {"url": "http://www.tirebuyer.com/education/understanding-speed-ratings-load-indexes-and-service-descriptions", "passage_text": "If you know the tire load rating for your vehicle, you can use our handy load index chart to check out the load carrying capacity of your tires. When you shop for tires and give us your vehicle’s make/model/style information, we show you only the tires that have the proper load rating for that vehicle."}, {"url": "http://www.tiresplus.com/shop-for-tires/tire-buying-guide/tire-load-index-chart/", "passage_text": "The tire load index lets you know the load–carrying capacity of a tire. In other words, it’s the amount of weight your tire can support safely. For example, if a tire has a load index of 92, it can support 1,389 pounds at maximum air pressure. Multiply that by four tires (4 x 1,389 = 5,556 pounds) to get your car’s maximum load–carrying capacity."}]