[{"url": "http://www.answers.com/Q/What_is_a_bacteriophage", "passage_text": "Share to: A lysogenic phage is a 'temperate' bacteriophage (such as lambda phage) that integrates its genome inside that of the host without immediately transcribing and making new viru … s particles. "}, {"url": "https://en.wikipedia.org/wiki/Phage_therapy", "passage_text": "Phage therapy or viral phage therapy is the therapeutic use of bacteriophages to treat pathogenic bacterial infections. Phage therapy has many potential applications in human medicine as well as dentistry, veterinary science, and agriculture. "}, {"url": "http://sciencelearn.org.nz/Contexts/Enviro-imprints/Sci-Media/Video/What-is-a-bacteriophage", "passage_text": "Transcript. DR BRENT GILPIN. A bacteriophage, or a phage, is a virus that infects bacteria, so these don't infect human cells –they are very specialised and only infect bacteria. So every bacteria is being attacked by various viruses which are using those as the host that they replicate in. ESR scientist Dr Brent Gilpin explains that a bacteriophage, or phage, is a virus that infects bacteria. He describes how a phage can be easily detected in the lab by plating bacteria on an agar plate. When clear spots appear on a ‘lawn’ of bacteria, it shows that the phage has infected and killed areas of bacteria"}, {"url": "http://www.wisegeek.com/what-is-bacteriophage.htm", "passage_text": "A bacteriophage is a virus which infects bacteria. These viruses typically cause their hosts to die as a result of infection, which makes bacteriophages of great interest to the medical community and to scientists who cultivate bacteria. "}, {"url": "http://biology.about.com/od/virology/ss/Bacteriophage.htm", "passage_text": "Used with permission. A bacteriophage is a virus that infects bacteria. Bacteriophages, first discovered around 1915, have played a unique role in viral biology. They are perhaps the best understood viruses, yet at the same time, their structure can be extraordinarily complex. In the lysogenic cycle, the phage's DNA recombines with the bacterial chromosome. Once it has inserted itself, it is known as a prophage. A host cell that carries a prophage has the potential to lyse, thus it is called a lysogenic cell. The image above illustrates both the lytic and lysogenic cycles of a bacteriophage."}, {"url": "http://medical-dictionary.thefreedictionary.com/bacteriophage", "passage_text": "bacteriophage. or simply phage; a virus that infects bacteria often killing them by lysis; many varieties exist, and usually each attacks only one kind of bacteria. Some bacteriophages are widely used as cloning vectors and for determining DNA sequence."}, {"url": "https://answers.yahoo.com/question/index?qid=20080107063854AA3d1dO", "passage_text": "Best Answer: bacteriophage is any one of a number of viruses that infect bacteria. The term is commonly used in its shortened form, phage.Typically, bacteriophages consist of an outer protein hull enclosing genetic material. The genetic material can be ssRNA (single stranded RNA), dsRNA, ssDNA, or dsDNA between 5 and 500 kilo base pairs long with either circular or linear arrangement."}, {"url": "http://www.phagetherapycenter.com/pii/PatientServlet?command=static_phagetherapy", "passage_text": "Bacteriophages or phage are viruses that invade bacterial cells and, in the case of lytic phages, disrupt bacterial metabolism and cause the bacterium to lyse [destruct]. Phage Therapy is the therapeutic use of lytic bacteriophages to treat pathogenic bacterial infections. Bacterial Host Specificity. "}]