[{"url": "http://www.ohbabynames.com/meaning/name/jedidiah/2297", "passage_text": "Jedidiah is a Biblical name that comes from the Hebrew meaning “beloved of Yahweh”. It was basically a term of endearment bestowed upon Solomon by the prophet Nathan as explained in 2 Samuel 12:24-25. "}, {"url": "http://www.sheknows.com/baby-names/name/jedidiah", "passage_text": "The name Jedidiah is an Arabic baby name. In Arabic the meaning of the name Jedidiah is: The hand. American Meaning: The name Jedidiah is an American baby name. In American the meaning of the name Jedidiah is: The hand. Biblical Meaning: The name Jedidiah is a Biblical baby name. In Biblical the meaning of the name Jedidiah is: Beloved of the Lord. Hebrew Meaning: The name Jedidiah is a Hebrew baby name. In Hebrew the meaning of the name Jedidiah is: Beloved of the Lord. Friend of the Lord. Beloved of Jehovah. In the bible the blessing name Jedidiah was given King Solomon in infancy. "}, {"url": "http://www.thinkbabynames.com/meaning/1/Jedediah", "passage_text": "Jedediah /jede-di-ah/ [4 sylls.] as a name for boys. Jedediah's root is Hebrew, and the meaning of Jedediah is beloved of the Lord. Jedediah is an alternate spelling of Jed (Hebrew): short variant of Jedidiah. Compare last name Jeremiah. Kreatif forms: Jadediah, Jefdediah, Jerdediah. "}, {"url": "http://www.thinkbabynames.com/meaning/1/Jedidiah", "passage_text": "Jedidiah /je-didi-ah/ [4 sylls.] as a boys' name is pronounced jed-ah-DYE-ah. It is of Hebrew origin, and the meaning of Jedidiah is beloved of the Lord. Biblical: a blessing name given in infancy to King Solomon, David's second son by Bathsheba. Kreatif forms: Jadidiah, Jemdidiah, Joedidiah. Charted below is the baby name popularity of Jedidiah for boys. Jedidiah entered the list in 1980-1989 and reached its highest position of #782 in the U.S. in the year 2014. (Top 1000 Baby Names Records, 2014)."}, {"url": "https://en.wikipedia.org/wiki/Jedediah", "passage_text": "The name Jedediah or Jedidiah comes from the Hebrew: ידידיה ‎ (Yedidyah, lit. Friend/beloved of Yah ). "}, {"url": "http://www.abarim-publications.com/Meaning/Jedidiah.html", "passage_text": "Since the Hebrew word for hand is יד (yad), the name Jedidiah resembles a meaning of Hand (in) Hand (with) The Lord. The author of Deuteronomy makes a playful reference both to the name Jedidiah and the similarity between the verb to love and hand-hand (or else, Nathan seems to refer to Deuteronomy). The name Jedidiah in the Bible. The name Jedidiah is mentioned only once in the Bible, and that is curious because it is the name which the prophet Nathan gave to Solomon (2 Samuel 12:25). Solomon's father, king David, had stolen Uriah's wife Bathsheba, got her pregnant, and subsequently had Uriah killed."}, {"url": "http://www.babynamespedia.com/meaning/Jedidiah/m", "passage_text": "[ 4 syll. je-di-diah, jed-idi-ah ] The baby boy name Jedidiah is sometimes used as a girl name. Its pronunciation is JHehD-ih-D AY-ah (English) †. Jedidiah is used predominantly in the English language and it is derived from Hebrew origins. The name is of the meaning beloved of Yahweh. A biblical name, its meaning is derived from the element ' yahweh ' name of God. Jedidyah (Hebrew) is an old form of Jedidiah. The name was borne as an alternate name by King Solomon in the Bible. It was adopted by English Puritans in the 17th century. "}, {"url": "http://www.thinkbabynames.com/meaning/1/Jedidiah", "passage_text": "Jedidiah is an unusual given name for males. Jedidiah is also an uncommon surname for all people. (2000 U.S. Census). Charted below is the baby name popularity of Jedidiah for boys. Jedidiah entered the list in 1980-1989 and reached its highest position of #782 in the U.S. in the year 2014. (Top 1000 Baby Names Records, 2014)."}, {"url": "http://nameberry.com/babyname/Jedidiah", "passage_text": "Hello, Guest. Jedidiah, an Old Testament name with a touch of Gunsmoke-era western panache, is right in line to be revived along with the other biblical 'iah' names; it's currently in the Top 800, climbing signficantly during 2014. Jedidiah was the name given by the prophet Nathan to King Solomon in the Old Testament. "}]