[{"url": "http://www.ew.com/article/1992/05/01/cosby-show-comes-end", "passage_text": "Bill Cosby says he has no problem leaving The Cosby Show after eight years as founder, creator, shaper, promoter, protector, defender, and check-depositing beneficiary of the biggest sitcom hit on American television in the past 20 years. He’s ready to go, he announces to anyone who asks, and so is the rest of the cast."}, {"url": "http://www.dailymail.co.uk/tvshowbiz/article-2101100/Whitney-Houston-turned-lead-role-The-Cosby-Show.html", "passage_text": "According to director Jay Sandrich, the Grammy and Emmy-Award winning artist was given the role of Sondra Huxtable on The Cosby Show. Revealed: Whitney Houston turned down a role on The Cosby Show before going on to become an international music superstar."}, {"url": "http://www.thewrap.com/judd-apatow-rips-bill-cosby-on-twitter-guys-who-rape-a-lot-arent-cool/", "passage_text": "Apatow, who recently called out the media for its coverage of the Sony hack, is well known for voicing his opinions on social media. But user “mikeandrewb” wanted to know why the director is “obsessed” with talking about Cosby in particular. “I guess it’s because guys who rape a lot aren’t cool,” Apatow responded."}, {"url": "http://variety.com/2014/tv/news/bill-cosby-tom-werner-marcy-carsey-call-rape-allegations-beyond-comprehension-1201361531/", "passage_text": "The producers behind “The Cosby Show” have weighed in on the controversy over the rape allegations levied by multiple women against Bill Cosby. “The Bill we know was a brilliant and wonderful collaborator on a show that changed the landscape of television."}, {"url": "http://www.imdb.com/name/nm0654369/", "passage_text": "View Resume | Official Photos ». Geoffrey Owens was born on March 18, 1961 in Brooklyn, New York, USA. He is an actor and director, known for The Cosby Show (1984), The Paper (1994) and Play the Game (2009)."}, {"url": "https://en.wikipedia.org/wiki/The_Cosby_Show", "passage_text": "The Cosby Show is an American television sitcom starring Bill Cosby, which aired for eight seasons on NBC from September 20, 1984 until April 30, 1992. The show focuses on the Huxtable family, an upper middle-class African-American family living in Brooklyn, New York."}, {"url": "http://thecosbyshoww.wikia.com/wiki/The_Cosby_Show", "passage_text": "The Cosby Show is an American television situation comedy starring Bill Cosby, which aired for eight seasons on NBC-TV from September 20, 1984 until April 30, 1992. The show focuses on the Huxtable family, an affluent African-American family living in Brooklyn, New York."}]