[{"url": "http://www.wickerwoman.com/articles/wicker-furniture-care", "passage_text": "To add life to the seats of your wicker furniture, use padded chair seat cushions. This hint is especially good for both a woven reed wicker and paper fibre seats, but also for any cane seat over 14 inches in diameter. Weather damaged rattan reed wicker. Never subject your antique wicker furniture to the harsh weather elements of sun, rain, snow or wind."}, {"url": "http://www.wikihow.com/Care-for-Wicker", "passage_text": "1. Vacuum wicker furniture routinely with the soft brush attachment on your vacuum cleaner to remove surface debris. Sweep with the grain of the wicker and not crosswise to avoid scratching the wicker reeds."}, {"url": "http://www.wickerwoman.com/articles/wicker-furniture-care", "passage_text": "Copyright © 2003 Cathryn Peters. To remove surface dust, regularly vacuum wicker furniture using the soft bristle brush attachment. To get stubborn dirt, fuzz, or animal hair out of the crevices use a new, dry paintbrush to brush it out, or use an ice-pick, awl or tweezers to pull out the material."}, {"url": "http://www.answers.com/Q/How_do_you_treat_wicker_furniture_for_outdoor_use", "passage_text": "A marine base paint or oil would be the best, but it will not protect any type of wicker for prolonged periods. Leaving wicker furniture out in the elements year round is not good regardless as to what you use to protect it."}, {"url": "http://www.improvementscatalog.com/RoomForImprovements/outdoor-furniture-care/", "passage_text": "For more stubborn cases, use a mild soap mixed with water and a soft brush or sponge to scrub your resin wicker furniture clean. You can also use a general-purpose spray cleaner on your resin wicker furniture, but be sure to wipe it off quickly and rinse with water to prevent damage to the finish. (Test your cleaning spray in a small inconspicuous area first.) After cleaning your resin wicker furniture, dry it with a cotton cloth."}, {"url": "https://www.patioproductions.com/blog/patio-furniture/how-to-clean-and-care-for-resin-wicker-furniture/", "passage_text": "Now, on to the resin wicker furniture itself. First, you will want to soak the furniture in water (don’t worry, it’s waterproof!). I recommend using a garden hose for this, as it is fast and effective. If you do not have a garden hose, a bucket of warm water will suffice."}, {"url": "http://www.wickerwoman.com/articles/wicker-furniture-care", "passage_text": "Too low humidity level causes the wicker to dry out and become brittle, but too high humidity subjects the wicker to mold and mildew. Consider using a dehumidifier if your furniture is subjected to high humidity conditions or at least move the wicker piece to an area with good air circulation."}, {"url": "http://www.wikihow.com/Care-for-Wicker", "passage_text": "2. Wipe the wicker furniture with a soft cloth dipped in a mixture of detergent and water. Rinse it well. A primary concern in how to care for wicker is to not get it too wet, so apply water sparingly on furniture pieces intended for inside use."}]