[{"url": "http://www.hairremoval.org/laser-hair-removal-how-long-does-each-session-take/", "passage_text": "Though laser hair removal can take anywhere from a few minutes up to one hour, today’s laser hair removal sessions are faster and more efficient than ever, and you might even be surprised at how fast they are. in Hair Removal 101,Laser hair removal. Traditionally, a laser hair removal session could take anywhere from 20 minutes up to a few hours depending on the area treated. Nowadays, a laser hair removal session rarely takes as long as one hour, and this is because more efficient laser machines are availabl"}, {"url": "http://beauty.about.com/od/hairremoval/a/laserhair.htm", "passage_text": "Depends. Laser hair removal isn't cheap (about $200-$500 a session depending on where you live and the areas being treated. Again, it takes about 6 sessions to get rid of 70% of hair permanently. Touch-ups are always an option at about $100-$150 a session. "}, {"url": "http://www.howlongdoes.com/beauty/how-long-does-laser-hair-removal-last/", "passage_text": "Treatments last anywhere from 15 minutes to one hour, as the time depends on the area being treated and the thickness of the hair. Your doctor or technician will usually have the laser penetrate the skin for a few minutes in an area about the size of a quarter and check if you have a negative reaction before continuing. A vital piece of information is how long does laser hair removal last. Although, this can be different for everyone, the short answer is forever. The treatment itself, however, is actually quite short and is one of the most commonly performed beauty treatments other than Botox."}, {"url": "http://health.howstuffworks.com/wellness/spa-health/laser-hair-removal-last.htm", "passage_text": "While permanent laser hair removal is a misnomer, after six to eight treatments, you can expect a marked reduction in hair. Any regrowth can be managed with touch-up treatments every six to 12 months. Each laser hair removal treatment typically costs $500 to $1,000, and feels like the snap of a hot rubber band on your skin. You may also smell a tinge of burnt hair."}, {"url": "http://lotuslaserspa.com/laser-hair-removal/", "passage_text": "The length of a laser hair removal treatment may last anywhere from a few minutes to an hour or more, depending on the size of the area being treated. It is important to know that the hairs in active growth phase (Anagen) respond the best to the laser. "}, {"url": "http://www.advanceddermatologylasercenter.com/hairremoval_faq.aspx", "passage_text": "You should shave the area 1-to-3 days prior to the laser hair removal treatment, depending upon how active your hair follicles are in the area-to-be-treated. We can provide you with the best treatment if there is a very slight stubble of growth that is just barely visible on close inspection. "}, {"url": "http://beauty.about.com/od/laserhairremoval/a/laserfacts.htm", "passage_text": "Laser hair removal is not cheap. Depending on what body part you treat, it can run from $200 to $2,000 a session, not including tax and tip. Laser Hair Removal Facts: How to Prepare. Once it's determined what type of laser or pulsed light machine will be used, you'll likely be told to either shave the day of your treatment or three days before."}, {"url": "http://laserlightskin.com/laser-hair-removal/laser-hair-removal-frequently-asked-questions/", "passage_text": "The cost of laser hair removal varies depending on the size, complexity and other factors of the area treated. Our prices for a single area range from as little as $50 to as much as $600. Laser Hair Removal Frequently Asked Questions (FAQs). Lasers remove hair for good, giving you a long-lasting, even permanent result. In only a few treatments (most laser companies recommend six to eight to get clearance) we can clear your skin of the unwanted hair that has bothered you for so long."}, {"url": "http://beauty.about.com/od/laserhairremoval/a/laserfacts.htm", "passage_text": "While it would take years to perform electrolysis on the back or legs, a typical laser hair removal session on both legs usually takes under two hours. Lasers are great for treating the back, shoulders, arm and chest. For upper lip and chin, lasers work but only on dark hair. Laser Hair Removal Facts: How to Prepare. Once it's determined what type of laser or pulsed light machine will be used, you'll likely be told to either shave the day of your treatment or three days before."}]