[{"url": "http://academic.brooklyn.cuny.edu/english/melani/cs6/genres.html", "passage_text": "&nbsp Genre is a French term derived from the Latin genus, generis, meaning type, sort, or kind.. It designates the literary form or type into which works are classified according to what they have in common, either in their formal structures or in their treatment of subject matter, or both. "}, {"url": "https://en.wikipedia.org/wiki/Play_%28theatre%29", "passage_text": "A play is a form of literature written by a playwright, usually consisting of dialogue between characters, intended for theatrical performance rather than just reading. Comedies were one of the two original play types of Ancient Greece, along with tragedies. An example of a comedy would be William Shakespeare 's play  A Midsummer Night's Dream , or for a more modern example the skits from  Saturday Night Live ."}, {"url": "http://thescriptlab.com/screenplay/genre/drama", "passage_text": "Drama film is a genre that relies on the emotional and relational development of realistic characters. While Drama film relies heavily on this kind of development, dramatic themes play a large role in the plot as well. Often, these dramatic themes are taken from intense, real life issues. Dramedy. Dramedy film is a genre that has a dramatic tone yet important elements of comedy. In Dramedy film, the amount of drama and comedy are almost equally balanced. This balance provides comedic relief for the audience, while still addressing serious issues."}, {"url": "http://www.shmoop.com/fences-august-wilson/genre.html", "passage_text": "Drama, Family Drama, Coming of Age, Tragedy. The fact that this is a play makes it by definition a drama, a piece of literature meant to be spoken by actors in front of a live audience. This particular drama focuses on the trials and tribulations of the Maxson family, making it a family drama. "}, {"url": "http://www.merriam-webster.com/dictionary/genre", "passage_text": "1 This book is a classic of the mystery genre. 2  genre. 3  In genre fiction there is an implied contract between writer and reader that justice of a kind will be exacted; “good” may not always triumph over “evil,” but the distinction between the two must be honored. Full Definition of GENRE. 1. : a category of artistic, musical, or literary composition characterized by a particular style, form, or content."}, {"url": "http://www.shmoop.com/crucible/genre.html", "passage_text": "Drama. The Crucible is a four-act dramatic play, produced on Broadway and later made into a film. It uses pure dialogue to convey the tension, resolution, and themes, with a few directions for action. It was intended to be performed rather than read. "}, {"url": "http://thescriptlab.com/screenplay/genre/drama", "passage_text": "Historical. Historical is a sub-genre of Drama film that examines a specific time in history or group of people. Many Historical films aim to portray true events and people. However, most Historical films are only loosely based on these events and people. Dramedy. Dramedy film is a genre that has a dramatic tone yet important elements of comedy. In Dramedy film, the amount of drama and comedy are almost equally balanced. This balance provides comedic relief for the audience, while still addressing serious issues."}, {"url": "https://en.wikipedia.org/wiki/Play_%28theatre%29", "passage_text": "A satire play takes a comic look at current events people while at the same time attempting to make a political or social statement, for example pointing out corruption. Comedies were one of the two original play types of Ancient Greece, along with tragedies. An example of a comedy would be William Shakespeare 's play  A Midsummer Night's Dream , or for a more modern example the skits from  Saturday Night Live ."}, {"url": "http://literarydevices.net/genre/", "passage_text": "Genre Definition. Genre means the type of art, literature or music characterized by a specific form, content and style. For example, literature has four main genres; poetry, drama, fiction and non-fiction. All of these genres have particular features and functions that distinguish them from one another. Drama is a form of text that is performed in front of an audience. It is also called a play. Its written text contains dialogues, and stage directions. This genre has further categories such as comedy, tragedy, tragicomedy etc."}, {"url": "http://www.merriam-webster.com/dictionary/genre", "passage_text": "Examples of GENRE. 1  This book is a classic of the mystery genre. 2  genre. 3  In genre fiction there is an implied contract between writer and reader that justice of a kind will be exacted; “good” may not always triumph over “evil,” but the distinction between the two must be honored. Full Definition of GENRE. 1. : a category of artistic, musical, or literary composition characterized by a particular style, form, or content."}]