[{"url": "http://www.answers.com/Q/What_is_Foie_Gras", "passage_text": "Foie gras means, in English, literally, fatty (foie) liver (gras), and describes the liver of a goose or duck intensively fed (and legally, in France and some other countries, … force-fed) with corn in order to produce an enlarged liver with a particularly delicate flavor and texture. "}, {"url": "http://www.stopforcefeeding.com/content/what-foie-gras", "passage_text": "On the left: a foie gras liver.On the right: a normal liver. (Photo courtesy PETA.Permission to use freely). Foie gras-French for fatty liver - is the diseased and enlarged liver of a duck or goose, produced through force feeding. The Animal Protection & Rescue League has investigated all three US foie gras farms and several in France and found rampant cruelty to be the norm."}, {"url": "http://www.dartagnan.com/foie-gras-101-preparations-and-uses.html", "passage_text": "oie Gras is the fattened liver of a duck (or goose), and is considered a great delicacy around the world. Made famous in France, foie gras is a traditional food known to mankind since at least Ancient Egypt. Foie gras is a versatile ingredient, with many ways to prepare and enjoy it. "}, {"url": "https://en.wikipedia.org/wiki/Foie_gras_controversy", "passage_text": "The production of foie gras (the liver of a duck or a goose that has been specially fattened) involves the controversial force-feeding of birds with more food than they would eat in the wild, and more than they would voluntarily eat domestically. Gavage feeding. Anti-foie gras at the Hotel Hôtel, Meurice. Paris the production of foie (gras the liver of a duck or a goose that has been specially) fattened involves the controversial-force feeding of birds with more food than they would eat in the, wild and more than they would voluntarily eat. domestically"}, {"url": "http://www.qwhatis.com/what-is-foie-gras/", "passage_text": "Foie gras is an exotic food that is made from goose or duck liver which has been made fat through a method of over feeding the said bird. Foie gras is a French term and as such, many people think that the entire concept of force feeding the duck started in France. But force feeding has been in existence for many centuries."}, {"url": "https://en.wikipedia.org/wiki/Foie_gras", "passage_text": "Foie gras (/ˌfwɑːˈɡrɑː/ , French for fat liver) is a luxury food product made of the liver of a duck or goose that has been specially fattened. By French law, foie gras is defined as the liver of a duck or goose fattened by force-feeding corn with a feeding tube, a process also known as gavage. In Spain and other countries outside of France it is occasionally produced using natural feeding. Ducks are typically slaughtered at 100 days and geese at 112 days. Foie gras is a popular and well-known delicacy in French cuisine. Its flavor is described as rich, buttery, and delicate, unlike that of an ordinary duck or goose liver. Foie gras is sold whole, or is prepared into mousse, parfait, or pate, pâté and may also be served as an accompaniment to another food, item such as. steak"}, {"url": "http://culinaryarts.about.com/od/glossary/g/Foie-Gras.htm", "passage_text": "Steven Morris Photography / Getty Images. Foie gras (pronounced fwah-grah) is the liver of a duck or goose that has been enlarged through a special feeding technique and then served in pates, pâtés (terrines see: Also) forcemeat or as a hot entree or main. ingredient Foie Gras Controversy: The technique used to fatten the goose or duck livers, known as gavage, is controversial because it is essentially a form of force-feeding, which is seen as a type of animal cruelty that goes beyond merely raising the animals to be slaughtered for food."}, {"url": "http://foiegras-factsandtruth.com/foie-gras/what-is-foie-gras", "passage_text": "Foie gras is a delicacy with a unique, refined taste. Foie gras is the liver of a goose or duck specially fattened through a feeding process for a specific period of time. Fattening: the English translation of Gavage, which comes from the French word ‘gave’, originating in the ancient region of Picardie. More duck foie gras is eaten than goose foie gras. It’s more rustic with a stronger taste. Its bold taste appeals to many gourmets and it now accounts for over 90% of French foie gras production. Goose foie gras is delicate and sweet on the palate. Some gourmets find it more subtle than duck"}]