[{"url": "http://www.answers.com/Q/What_is_metamorphic_rock_used_for", "passage_text": "Following are examples of three metamorphic rocks and a list of their uses. Marble is a metamorphic rock that is used to make floor tiles, counter tops and it is carved into statues and was used extensively in the building of the Roman Colosseum and other historic buildings."}, {"url": "http://www.csun.edu/~khurst/ES300/Fritche/300metrx.html", "passage_text": "II. Goals of this module 1  -. To learn the processes that form metamorphic rocks. 2  To learn the definitions of and proper spelling for scientific terms that are used commonly in newspapers, magazines, and books, and on television and radio programs to discuss"}, {"url": "http://www.goldorecrusher.com/mining-and-construction/uses-of-sedimentary-rocks-in-everyday-life/", "passage_text": "Each double-sided card features a photo of a rock in the set, pictures of the way it is used in everyday life, and fun, kid-friendly facts. Identify various rocks and minerals and correlate them to their real-life uses with this hands-on rock and card set. Sedimentary Rock Collection. Igneous"}, {"url": "http://www.answers.com/Q/What_are_the_uses_of_metamorphic_rocks_in_daily_life", "passage_text": "Talc-a metamorphic mineral is used as a lubricant. Serpentine is used for carving. Corundum, another metamorphic mineral, is used for abrasives. Kyanite and its polymorphs-for ceramics. Graphite-pencils. Many economic deposits of gold, copper, tungsten and iron occur in metamorphic rocks."}, {"url": "http://doris-duke.agilityhoster.com/willamet33/45.html", "passage_text": "Properties and finally polymers and their uses and properties and relates them to everyday items and mineral, the rock cycle; formations of igneous, sedimentary and metamorphic rocks. Biology, life science & health-amphibians classifying sedimentary, igneous, and metamorphic rocks flash cards-basic sight words-everyday."}, {"url": "http://www.answers.com/Q/What_are_the_uses_of_metamorphic_rocks_in_daily_life", "passage_text": "Slate is another metamorphic rock that is used in buildings for floor and roofing tiles, and it was once used for blackboards. Quartzite is used as a source of silica; other forms of metamorphic rocks are useful as building components, monuments, counter tops, and facings. + 186 others found this useful."}, {"url": "http://www.answers.com/Q/What_are_the_uses_of_metamorphic_rocks_in_daily_life", "passage_text": "Marble is a metamorphic rock that is used to make floor tiles, counter tops and it is carved int … o statues and was used extensively in the building of the Roman Colosseum and other historic buildings."}, {"url": "http://www.csun.edu/~khurst/ES300/Fritche/300metrx.html", "passage_text": "1 To learn the processes that form metamorphic rocks. 2  To learn the definitions of and proper spelling for scientific terms that are used commonly in newspapers, magazines, and books, and on television and radio programs to discuss metamorphic rocks. 3  To learn how to identify the most common"}]