[{"url": "https://en.wikipedia.org/wiki/Diastasis_recti", "passage_text": "Diastasis recti (also known as abdominal separation) is commonly defined as a gap of roughly 2.7 cm or greater between the two sides of the rectus abdominis muscle. This condition has no associated morbidity or mortality. 1 Diastasis recti is more common in premature and black newborns. 2  In pregnant or postpartum women, the condition is caused by the stretching of the rectus abdominis by the growing uterus."}, {"url": "https://en.wikipedia.org/wiki/Rectus_abdominis_muscle", "passage_text": "The rectus abdominis muscle, also known as the  abdominals or abs , is a paired muscle running vertically on each side of the anterior wall of the human abdomen, as well as that of some other mammals. There are two parallel muscles, separated by a midline band of connective tissue called the linea alba. The rectus abdominis muscle is contained in the rectus sheath, which consists of the aponeuroses of the lateral abdominal muscles."}, {"url": "http://www.webmd.com/baby/guide/abdominal-separation-diastasis-recti", "passage_text": "Diastasis means separation. Recti refers to your ab muscles called the rectus abdominis.. When the ab muscles move aside like this, the uterus, bowels, and other organs have only a thin band of connective tissue in front to hold them in place. Without the needed muscle support, a vaginal delivery could be more difficult"}, {"url": "http://thecenterforwomensfitness.com/2010/what-is-diastasis-recti/", "passage_text": "Diastasis Recti is a separation of the rectus abdominus muscle. It is actually a stretching of the fascial attachments surrounding the rectus sheath as the muscles part or split. It is noticeable as a bulge in the midline of the abdominals when the trunk is flexed during pregnancy. During the post partum period this area presents as a gap in the rectus sheath."}, {"url": "http://www.webmd.com/baby/guide/abdominal-separation-diastasis-recti", "passage_text": "“ Diastasis recti ” means your belly sticks out because the space between your left and right belly muscles has widened. You might call it a “pooch.”. It's very common among pregnant women. About two-thirds of pregnant women have it. Recti refers to your ab muscles called the rectus abdominis.. When the ab muscles move aside like this, the uterus, bowels, and other organs have only a thin band of connective tissue in front to hold them in place."}, {"url": "http://www.theptdc.com/2013/10/the-personal-trainers-guide-to-diastasis-recti/", "passage_text": "Diastasis Recti (DR) isn’t something many people are talking about in the fitness industry, but it screams for your attention because as a trainer you could be making it much worse. DR is the resulting separation of the rectus abdominis muscles bellies, as the line alba becomes stretched and lax. The most common cause of diastasis recti is pregnancy, although it can be seen in men and children too."}, {"url": "https://www.diastasisrehab.com/what-is-diastasis-recti.php", "passage_text": "Definition. Diastasis Recti, a condition often ignored by the medical community, is a problem that screams for more attention, and that is why Everybelly® should be checked for a diastasis recti. Everybelly® means all women (baby or no baby), men and children. Many people have a diastasis recti and just don’t know it! A diastasis recti is a separation of your outer most abdominal muscles. The job of these muscles (called rectus abdominis), is to support your back and your organs. The cause of a diastasis is from continuous stretching of, and intra-abdominal force and pressure on, this connective tissue that joins your outer most abdominal muscles. Right smack in the middle of this connective tissue is your belly button which is a weak spot."}, {"url": "https://en.wikipedia.org/wiki/Diastasis_recti", "passage_text": "Diastasis of this muscle occurs principally in two populations: newborns and pregnant women. It is also known to occur in men. 1  In the newborn, the rectus abdominis is not fully developed and may not be sealed together at midline. 2  Diastasis recti is more common in premature and black newborns. 1 Diastasis recti is more common in premature and black newborns. 2  In pregnant or postpartum women, the condition is caused by the stretching of the rectus abdominis by the growing uterus."}]