[{"url": "https://www.rushmypassport.com/government_fees.html", "passage_text": "The US Department of State will only accept checks or money orders written out properly. Please make sure that your check or money order follows these guidelines to avoid suspensions of your application: 1  DO NOT use temporary or starter checks. 2  Must be a check or money order. 1 Check must be written out exactly like this: US Department of State. 2  Amount must be written out in full - $170 should be One Hundred Seventy and 00/100. 3  Write applicant's full name and date of birth on the check or money order. 4  All personal checks must show a printed address."}, {"url": "http://legal-dictionary.thefreedictionary.com/Check", "passage_text": "CHECK, contracts. A written order or request, addressed to a bank or persons carrying on the banking business, and drawn upon them by a party having money in their hands, requesting them to pay on presentment to a person therein named or to bearer, a named sum of money. 2. A cashier's check is one that the bank draws on itself and is signed by an authorized bank official. The bank lends its credit to the purchaser of the check in order to facilitate its immediate use in commercial transactions."}, {"url": "https://www.vanderbiltcu.org/documents/StopPaymentRequestForm.pdf", "passage_text": "The RDFI may require that written confirmation of a verbal stop payment order be made within 14 days of a verbal stop payment order, provided that the RDFI notifies the Receiver of this requirement and provides an address to which the written confirmation should be sent at the time the verbal order is provided. The RDFI is obligated to comply with a verbal stop payment order only for a period of fourteen calendar days unless the order is confirmed in writing within that 14 -day period. A written stop payment order is effective for six months unless it is renewed in writing."}, {"url": "https://en.wikipedia.org/wiki/Cheque", "passage_text": "A cheque (or check in American English) is a document that orders a bank to pay a specific amount of money from a person's account to the person in whose name the cheque has been issued. A payee that accepts a cheque will typically deposit it in an account at the payee's bank, and have the bank process the cheque. In some cases, the payee will take the cheque to a branch of the drawee bank, and cash the cheque there."}, {"url": "http://legal-dictionary.thefreedictionary.com/Check", "passage_text": "Check. A written order instructing a bank to pay upon its presentation to the person designated in it, or to the person possessing it, a certain sum of money from the account of the person who draws it. A check must contain the phrase pay to the order of.. A check differs from a draft in that a check is always drawn on a bank, while a draft is an order for payment drawn on anyone, including a bank, a person, or a trading account with a company. A cashier's check is one that the bank draws on itself and is signed by an authorized bank official. The bank lends its credit to the purchaser of the check in order to facilitate its immediate use in commercial transactions."}, {"url": "http://www.audioenglish.org/dictionary/order_of_payment.htm", "passage_text": "The noun ORDER OF PAYMENT has 1 sense: 1. a document ordering the payment of money; drawn by one person or bank on another. Familiarity information: ORDER OF PAYMENT used as a noun is very rare. Dictionary entry details. "}, {"url": "https://www.rushmypassport.com/government_fees.html", "passage_text": "1 Must be a check or money order. 2  Check must be written out exactly like this: US Department of State. 3  Amount must be written out in full - $170 should be One Hundred Seventy and 00/100. 4  Write applicant's full name and date of birth on the check or money order. 5  All personal checks must show a printed address. 1 Check must be written out exactly like this: US Department of State. 2  Amount must be written out in full - $170 should be One Hundred Seventy and 00/100. 3  Write applicant's full name and date of birth on the check or money order. 4"}, {"url": "https://en.wikipedia.org/wiki/Payment_order", "passage_text": "Payment order is an international banking term that refers to a directive to a bank or other financial institution from a bank account holder instructing the bank to make a payment or series of payments to a third party. It can be defined as, Instructions to transfer funds sent via paper and/or electronic means. "}, {"url": "http://cwtfhc.org/stipulations/", "passage_text": "A stipulation (stip) is a written agreement between the two parties in a Housing Court case. Once signed by the judge, it has the power of a court order or judgment. If you choose to negotiate a settlement with the landlord, that agreement will be written up and called a stipulation of settlement."}]