[{"url": "https://en.wikipedia.org/wiki/Metropolis_(comics)", "passage_text": "In the 2016 film Batman v Superman: Dawn of Justice, director Zach Snyder confirmed that Metropolis and Gotham City will be portrayed as geographically situated right next to each other, on the opposite sides of a bay, similar to Oakland and San Francisco. The distance between the two cities has varied greatly over the years, ranging from being hundreds of miles apart to Gotham and Metropolis being twin cities on opposite sides of Delaware Bay, with Gotham City in the location of Cape May Point, New Jersey and Metropolis in the location of Lewes, Delaware."}, {"url": "http://scifi.stackexchange.com/questions/5704/where-is-gotham-city-located", "passage_text": "Gruenwald suggested that Gotham City is located somewhere in the state of New Jersey while Metropolis is located in close vicinity to Washington, D.C. There are several other comics which place Gotham City in New Jersey, with references to proxity to the Jersey Shore and Hudson County. Gotham is known to be architecturally modeled after New York City, but with exaggerated elements of the styles and derives its name from a sobriquet for that real world city, first popularized by the author Washington Irving in his satirical work Salmagundi (1807)."}, {"url": "https://en.wikipedia.org/wiki/Metropolis_(comics)", "passage_text": "The skyline and most of the notable landmarks in Metropolis are based on real-life landmarks in New York City. Metropolis is nicknamed The Big Apricot, just as New York City is nicknamed  The Big Apple .. Frank Miller has said that Metropolis is New York in the daytime; Gotham City is New York at night.. The distance between the two cities has varied greatly over the years, ranging from being hundreds of miles apart to Gotham and Metropolis being twin cities on opposite sides of Delaware Bay, with Gotham City in the location of Cape May Point, New Jersey and Metropolis in the location of Lewes, Delaware."}, {"url": "http://scifi.stackexchange.com/questions/5704/where-is-gotham-city-located", "passage_text": "Gruenwald suggested that Gotham City is located somewhere in the state of New Jersey while Metropolis is located in close vicinity to Washington, D.C. From the Batman Wiki. Before Detective Comics #48, Batman's adventures were said to happen in New York City. Gotham is known to be architecturally modeled after New York City, but with exaggerated elements of the styles and derives its name from a sobriquet for that real world city, first popularized by the author Washington Irving in his satirical work Salmagundi (1807)."}, {"url": "http://scifi.stackexchange.com/questions/5704/where-is-gotham-city-located", "passage_text": "One map showing Gotham City in relation to Metropolis, the home of Superman, published in New Adventures of Superboy #22 (October 1981), placed Gotham City and Metropolis on opposite sides of a large bay. In Swamp Thing vol. Gotham is known to be architecturally modeled after New York City, but with exaggerated elements of the styles and derives its name from a sobriquet for that real world city, first popularized by the author Washington Irving in his satirical work Salmagundi (1807)."}, {"url": "https://en.wikipedia.org/wiki/Gotham_City", "passage_text": "The distance between Gotham and Metropolis has varied greatly over the years, with depictions of the two ranging from being hundreds of miles apart to Gotham and Metropolis being shown as twin cities on opposite sides of Delaware Bay, with Gotham City in New Jersey and Metropolis in Delaware. 1 The Gotham Gazette is one of the major newspapers in Gotham City. 2  In the Silver Age comics, the editor-in-chief of Metropolis newspaper The Daily Planet, Perry White, had once worked for the Gazette early in his career."}, {"url": "https://en.wikipedia.org/wiki/Metropolis_(comics)", "passage_text": "Metropolis is a fictional American city appearing in American comic books published by DC Comics, and is the home of Superman. Portrayed as a prosperous and massive city, Metropolis first appeared by name in Action Comics #16 (September 1939). The distance between the two cities has varied greatly over the years, ranging from being hundreds of miles apart to Gotham and Metropolis being twin cities on opposite sides of Delaware Bay, with Gotham City in the location of Cape May Point, New Jersey and Metropolis in the location of Lewes, Delaware."}, {"url": "https://en.wikipedia.org/wiki/Metropolis_(comics)", "passage_text": "Metropolis is frequently depicted as being within driving distance of Gotham City, home of Batman. This happens, for example, in the three-issue 1990 mini-series of World's Finest Comics by Dave Gibbons, Steve Rude, and Karl Kesel. The distance between the two cities has varied greatly over the years, ranging from being hundreds of miles apart to Gotham and Metropolis being twin cities on opposite sides of Delaware Bay, with Gotham City in the location of Cape May Point, New Jersey and Metropolis in the location of Lewes, Delaware."}]