[{"url": "http://www.thefreedictionary.com/drey", "passage_text": "drey. n. 1. (Biology) a squirrel's nest. [C17: of unknown origin]. - A squirrel's nest of twigs in a tree. "}, {"url": "http://animals.mom.me/squirrel-drey-1812.html", "passage_text": "Construction. To construct a drey, squirrels roughly weave together twigs to form a platform, then compact leaves atop it to form a base. Around the base will be more woven twigs, forming a rough spherical shape for the outer shell. They use more moss, twigs, leaves and found items such as paper to fill in the gaps. Squirrels are small-to medium-sized rodents that are found on every continent, with the exception of Australia. With more than 200 species, squirrels occupy a variety of habitats, but most live in trees and build nests inside tree cavities -- called dens -- or in the crotch of tree limbs, referred to as dreys."}, {"url": "https://en.wikipedia.org/wiki/Drey", "passage_text": "(After leaving the drey, a young squirrel is termed a “juvenile” for its first year of life.) The June broods are sometimes born in dreys, but January broods are usually born and raised in tree cavities, which are much safer. Squirrels may also nest in attics or exterior walls of buildings, where a drey may be regarded as a fire hazard, as some squirrels have a habit of gnawing on electrical cables. At other times, squirrels may inhabit a permanent tree den in the hollow of a trunk or large branch."}, {"url": "http://www.fruitjar.org/Drey.htm", "passage_text": "The Drey jars were Schram s secondary line, and they came in a variety of styles and embossing. They are most famous for the Drey boss, a glass projection on the neck used to anchor the wire bail on a lightning-style jar. But not all Dreys have this boss. Dreys can be found with a full-wire bail closure, a patented circular dimpled boss, and both shoulder seal and bead seal mason closures. One that he never was able to completely answer involves the Drey jars. The history behind this line of jars is fairly well known. Leo Drey, who pronounced his last name dry, was the president of the Schram Manufacturing Company from 1908 until his death in 1920."}, {"url": "https://en.wikipedia.org/wiki/Drey", "passage_text": "A drey — or dray — is a nest of a tree squirrel or a flying squirrel. Dreys are usually built of twigs, dry leaves, and grass, and typically assembled in the forks of a tall tree. They are sometimes referred to as “drey nests” to distinguish them from squirrel “cavity nests” (also termed “dens”). Squirrels may also nest in attics or exterior walls of buildings, where a drey may be regarded as a fire hazard, as some squirrels have a habit of gnawing on electrical cables. At other times, squirrels may inhabit a permanent tree den in the hollow of a trunk or large branch."}, {"url": "http://statewidesewing.ecrater.com/p/10238318/2-rare-vintage-drey-perfect-mason", "passage_text": "Drey jars have the words Perfect and Mason off kilter (as many do have) are only worth a dollar or two, but the Drey jars that have the words Perfect and Mason centered perfectly (like this one does) have a much higher value. These glass jars are both in excellent condition. "}, {"url": "http://www.oxforddictionaries.com/definition/english/drey", "passage_text": "noun (plural dreys). The nest of a squirrel, typically in the form of a mass of twigs in a tree. Example sentences. 1  The Siberian flying squirrel is a nocturnal arboreal rodent, which nests in tree cavities, twig dreys, and nest-boxes. 2  At another site it was decided to remove a grey squirrel from its winter drey. 1 At another site it was decided to remove a grey squirrel from its winter drey. 2  They rear their young in stick nests or ‘dreys’, are less active in winter, and do not hibernate or bury nuts as winter store."}, {"url": "http://www.laggan.com/the-drey.asp", "passage_text": "The Drey. The Drey is the 2006 Scottish Category 8 winner of the Federation of Master Builders Awards. Spey Building and Joinery Ltd, won the coveted title of 'Heavenly Builders' of the year for their work on this project and to see it is to understand why. The Drey is accessible for and welcomes wheelchair users. Laggan Wolftrax is less than a mile away. With nearly 18 km of track ranging from the 3.2 km. Blue grade Fun Park to the extremely difficult Black grade trail containing the 2 Ton Drop and the Back, Sack and Crack Attack it offers something for every ability."}, {"url": "https://en.wikipedia.org/wiki/Drey", "passage_text": "A favoured site for a drey is a tree crotch about 30 to 45 feet (9.1 to 13.7 m) above ground level. Squirrels may also nest in attics or exterior walls of buildings, where a drey may be regarded as a fire hazard, as some squirrels have a habit of gnawing on electrical cables. At other times, squirrels may inhabit a permanent tree den in the hollow of a trunk or large branch."}]