[{"url": "https://en.wikipedia.org/wiki/Marrubium_vulgare", "passage_text": "Marrubium vulgare (white horehound or common horehound) is a flowering plant in the family Lamiaceae, native to Europe, northern Africa, and southwestern and central Asia. Horehound has been mentioned in conjunction with medicinal use dating at least back to the 1st century BC, where it appeared as a remedy for respiratory ailments in the treatise De Medicina by Roman encyclopaedist Aulus Cornelius Celsus."}, {"url": "http://www.health-care-tips.org/herbal-medicines/horehound.htm", "passage_text": "An infusion of horehound can be used as a wash, or a preparation of horehound salve & is useful to disinfect wounds. White Horehound is an expectorant ,sedative, and antispasmodic. It is used in many cases of nausea, vomiting (including nausea and vomiting in pregnancy and travel sickness) and nervous indigestion. "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-886-WHITE%20HOREHOUND.aspx?activeIngredientId=886&activeIngredientName=WHITE%20HOREHOUND", "passage_text": "WHITE HOREHOUND Overview Information. White horehound is a plant. The parts that grow above the ground are used to make medicine. White horehound is used for digestion problems including loss of appetite, indigestion, bloating, gas, diarrhea, constipation, and liver and gallbladder complaints. In manufacturing, the extracts of white horehound are used as flavoring in foods and beverages, and as expectorants in cough syrups and lozenges. Expectorants are ingredients that make it easier to cough up phlegm."}, {"url": "http://www.gardeningknowhow.com/edible/herbs/horehound/growing-horehound.htm", "passage_text": "Horehound plants have an interesting history of medicinal uses. The leaves can be dried and used to make tea and the leaves can be stored for up to a year in a jar. The oil can be expressed and used in perfumes and potpourri. The strong flavor is used in cough drops, candy and liqueurs. "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-886-WHITE%20HOREHOUND.aspx?activeIngredientId=886&activeIngredientName=WHITE%20HOREHOUND", "passage_text": "White horehound is sometimes applied to the skin for skin damage, ulcers, and wounds. In manufacturing, the extracts of white horehound are used as flavoring in foods and beverages, and as expectorants in cough syrups and lozenges. Expectorants are ingredients that make it easier to cough up phlegm."}, {"url": "http://www.herbs2000.com/herbs/herbs_horehound.htm", "passage_text": "One common way in which the horehound is used, is in the form of an herbal syrup or candy-this is a way to disguise the otherwise very bitter flavor of the herb. However, for those who prefer it, it can be taken as an herbal tea as well. Uses. The remedy made from the horehound plant is extremely effective in the treatment of problems such as wheezing, and chronic bronchitis, it is also used in alleviating bronchiectasis-which is induced by a damaged air passage inside the lung."}, {"url": "http://www.herbco.com/c-336-horehound.aspx", "passage_text": "Horehound, sometimes called white horehound, is a member of the mint family that thrives in pastures and other wayside places all over Europe, Asia and parts of Africa, although it is now naturalized in North America and elsewhere. "}, {"url": "http://www.naturalremedies.org/horehound/", "passage_text": "Horehound Herb. A common and desirable benefit of the horehound herb is its effectiveness as an expectorant to aid the discharge of congestive materials from the lungs. This is but one of the many ways that horehound has been used to support good health throughout history. The entire plant can be used medicinally. Horehound is available fresh, dried, powdered, in capsules, as an extract, or as a pressed juice. When harvesting horehound, cut the plant when the buds of the flower appear. Immediately chop the horehound and then seal it in jars as soon as it has dried."}, {"url": "http://www.ehow.com/about_5042766_horehound-candy.html", "passage_text": "Horehound is a European herb or wildflower that is in the mint family of herbs. It grows abundantly in California and has also spread throughout the United States. Horehound candy is an old-fashioned hard candy that is made by mixing a horehound herb infusion with other ingredients. Horehound candy is sugar coated and has a bittersweet taste. The candies are lozenge-sized and are typically placed in the mouth and sucked on to extract the taste. Horehound candies have traditionally been used as an appetite stimulant, to soothe dry, scratchy and sore throats and to relieve intestinal gas."}, {"url": "http://www.vitaminstuff.com/herbs-horehound.html", "passage_text": "Horehound Horehound (Marrubium vulgare [Latin]), also called white horehound and marrubium, has been used to treat cold and flu symptoms for thousands of years. It helps loosen phlegm and quiets coughs. In Europe, horehound is also used to treat indigestion and discomfort caused by gas and bloating. "}]