[{"url": "http://courses.washington.edu/conj/membrane/bilayer.htm", "passage_text": "The nonpolar regions of the molecules, which are referred to as hydrophobic, face the interior of the bilayer, where they are shielded from water. On the other hand, the polar regions of the molecules, termed hydrophilic, face outward where they interact with the water inside and outside of the cell."}, {"url": "http://www.answers.com/Q/Is_phospholipid_polar_or_non-polar", "passage_text": "The phospholipid bilayer in cell membranes is both polar and nonpolar. The heads, which face the outside and inside of the cell, are polar. Thus they form hydrogen bonds with the water outside of the cell and the cytoplasm inside the cell. They are called hydrophilic, which means they love water."}, {"url": "http://biology.about.com/od/molecularbiology/ss/phospholipids.htm", "passage_text": "The phosphate group and polar head region of the molecule is hydrophillic (attracted to water), while the fatty acid tail is hydrophobic (repelled by water). When placed in water, phospholipids will orient themselves into a bilayer in which the non-polar tail region faces the inner area of the bilayer."}, {"url": "http://www.answers.com/Q/Is_phospholipid_polar_or_non-polar", "passage_text": "Confidence votes 15. The phospholipid bilayer in cell membranes is both polar and nonpolar. The heads, which face the outside and inside of the cell, are polar. Thus they form hydrogen bonds with the water outside of the cell and the cytoplasm inside the cell. They are called hydrophilic, which means they love water."}, {"url": "http://courses.washington.edu/conj/membrane/bilayer.htm", "passage_text": "Polar/Nonpolar Regions. In a biological membrane, the phospholipids are organized into a bilayer, which serves as the framework in which the other components of the membrane are embedded. The figure to the left shows the arrangement of the phospholipids in a cross section of a membrane."}, {"url": "http://www.answers.com/Q/Which_part_of_a_phospholipid_is_nonpolar", "passage_text": "The phospholipid head is hydrophilic because it is polar. The fatty acid tails are hydrophobic. This region is not polar. The phosphol … ipids form a lipid bilayer (two layers of phospholipids) forming the cell wall. The heads face the cytoplasm, and the water outside."}]