[{"url": "http://www.ehow.com/how_5070373_dull-shiny-black-shoe.html", "passage_text": "Apply a coating of cream shoe polish with leather moisturizer to the shoe. Though this may restore some of the shoe's shine, it is an important step. The nail polish remover can break down oils in the leather, making the shoes vulnerable to cracks."}, {"url": "http://www.stepbystep.com/how-to-dull-a-shiny-black-shoe-40276/", "passage_text": "1 Wipe with a dry cloth After getting new shoes you should wipe their surface using a soft and dry piece of cloth to remove the coating of shiny material like wax. 2  If you keep changing the layer of the cloth after every wipe, you should be able to dull your shoe after a few wipes."}, {"url": "http://www.ehow.com/how_5070373_dull-shiny-black-shoe.html", "passage_text": "Test the nail polish remover on an inconspicuous spot on the shoe to make sure it doesn't discolor the leather. Rub the rag gently on a small spot, then wait a few minutes. Apply the nail polish remover to the shoe in a gentle, circular motion, lifting up only the shiny wax on the shoe's surface."}, {"url": "http://www.ehow.com/how_5070373_dull-shiny-black-shoe.html", "passage_text": "Instructions. Wipe the surface of the shoe clean with a soft, dry rag, removing any dirt and dust from the finish. Apply a light coating of nail polish remover to another rag. The rag shouldn't be soaked---it should be just barely wet."}, {"url": "http://www.artofmanliness.com/2008/07/29/how-to-get-the-best-shoe-shine/", "passage_text": "Step 2: Clean the dust and dirt off your boots with a horsehair shine brush or damp rag. If you must get your boots a little wet to clean them off, allow them time to dry before applying the polish. Step 3: Cover the entire shoe with a generous amount of polish, using your shoe polish brush."}, {"url": "http://www.howtodothings.com/fashion-personal-care/how-to-dull-a-shiny-black-shoe", "passage_text": "Clean and dust your shoe. Before applying nail polish remover to dull the shoe, get one of the clean cloth rags that you have with you and wipe the shoe clean. Any dirt, grime, and dust should be removed before applying the dulling solution. Test the effect."}, {"url": "http://www.ehow.com/how_5070373_dull-shiny-black-shoe.html", "passage_text": "New black shoes often come with a gloss on them that can be a bit too shiny, depending on personal tastes. This gloss is usually due to a high concentration of wax and other polishing substances that are built up on the surface of the leather. If these substances are removed, the shine will be dulled considerably."}, {"url": "http://www.stepbystep.com/how-to-dull-a-shiny-black-shoe-40276/", "passage_text": "Wipe with a dry cloth. 1  Use nail polish remover You can also try using a little nail polish remover and wet the cloth slightly. 2  Now rub the cloth over the shoe once again to remove the polish. 3  In the start just rub the shoe once and wait for a few minutes to see the effects of the nail polish remover."}, {"url": "http://www.howtodothings.com/fashion-personal-care/how-to-dull-a-shiny-black-shoe", "passage_text": "If it does not discolor or damage the leather, then you can proceed to dull your shoe using larger amounts of the nail polish remover. Apply the nail polish remover. Pour some of the nail polish remover on one of your clean rags. Make sure not to soak the rag with it. A damp rag is more than enough."}]