[{"url": "http://www.kidneychat.com/kidney-anatomy.html", "passage_text": "These are referred to as the microscopic anatomy. The internal structure of the kidney is divided into two main areas... a light outer area called the renal cortex, and a darker inner area called the renal medulla. Within the medulla there are eight (8) or more cone-shaped sections known as renal pyramids. Kidney anatomy encompasses all the tissue-components that collectively form the structure of the kidney. Most humans are born with two kidneys, although one kidney is capable of performing the normal functions of both kidneys. Some people are born with one kidney."}, {"url": "https://en.wikipedia.org/wiki/Renal_cortex", "passage_text": "The renal cortex is the outer portion of the kidney between the renal capsule and the renal medulla. In the adult, it forms a continuous smooth outer zone with a number of projections (cortical columns) that extend down between the pyramids. "}, {"url": "http://www.mybiologyweb.com/FTP/Chap27_Urinary_07.pdf", "passage_text": "Anatomy of the Kidney Nephrons • The functional units of the kidney are called nephrons. • The nephrons begin in the kidney’s cortexand end with their convergence into collecting ducts. • A nephron consists of two major regions, – (1) a group of capillaries called the glomerulus and – (2) a renal tubule. Kidney Anatomy of the KidneyLab Activity 2 - Dissection External Anatomy • Curvatures – The kidney has two major curvatures, a large lateral curvatureand a small medial curvature. The smaller medial curvature has an indented area (notch) called the hilus."}, {"url": "http://www.ivyroses.com/HumanBody/Urinary/Urinary_System_Kidney_Diagram.php", "passage_text": "The ureter is the structure through which urine is conveyed from the kidney to the urinary bladder. To learn more about the structure of the kidney, see our simple (labelled) diagram of a kidney nephron. This is the area of the kidney through which the ureter leaves the kidney and the other structures including blood vessels (illustrated), lymphatic vessels, and nerves enter/leave the kidney. Renal capsule:"}, {"url": "http://www.mybiologyweb.com/FTP/Chap27_Urinary_07.pdf", "passage_text": "2 Figure 27.2Illustration of the kidney (in frontal section) showing general structures. Kidney Anatomy of the KidneyLab Activity 2 - Dissection External Anatomy • Curvatures – The kidney has two major curvatures, a large lateral curvatureand a small medial curvature. The smaller medial curvature has an indented area (notch) called the hilus."}, {"url": "http://www.kidneychat.com/kidney-anatomy.html", "passage_text": "The major calices then converge into a funnel-like cavity called the renal pelvis. The renal pelvis, which is attached to the indented side of the kidney anatomy (hilum), extends into the ureter. The ureter is a long narrow duct (tube) that conveys urine from the kidneys to the urinary bladder. Kidney anatomy encompasses all the tissue-components that collectively form the structure of the kidney. Most humans are born with two kidneys, although one kidney is capable of performing the normal functions of both kidneys. Some people are born with one kidney."}, {"url": "http://www.unc.edu/courses/2008fall/envr/430/001/JAS_Renaltox.ppt", "passage_text": "The functional unit of the kidney is the nephron. The major functions of the kidney are to maintain extracellular fluids, to eliminate wastes resulting from normal metabolism, and to excrete xenobiotics and their metabolites. Mammalian kidneys have 10,000-1,000,000 nephrons per kidney. "}, {"url": "http://www.ivyroses.com/HumanBody/Urinary/Urinary_System_Kidney_Diagram.php", "passage_text": "Renal hilus: The renal hilus is an indentation near to the centre of the concave area of the kidney. This is the area of the kidney through which the ureter leaves the kidney and the other structures including blood vessels (illustrated), lymphatic vessels, and nerves enter/leave the kidney. Renal capsule:"}, {"url": "http://philschatz.com/anatomy-book/contents/m46431.html", "passage_text": "Nephrons: The Functional Unit. Nephrons take a simple filtrate of the blood and modify it into urine. Many changes take place in the different parts of the nephron before urine is created for disposal. The term forming urine will be used hereafter to describe the filtrate as it is modified into true urine. The functional unit of the kidney, the nephron, consists of the renal corpuscle, PCT, loop of Henle, and DCT. Cortical nephrons have short loops of Henle, whereas juxtamedullary nephrons have long loops of Henle extending into the medulla. About 15 percent of nephrons are juxtamedullary."}]