[{"url": "http://pets.thenest.com/long-puppys-eyes-open-4713.html", "passage_text": "Newborn puppies are born with their ears and their eyes sealed shut. Puppies lack two senses at birth: sight and hearing. It takes a minimum of 10 days to two weeks for their final two senses to develop. Although lacking their sight and hearing might seem odd to human beings, puppies develop in a way that is advantageous to their species."}, {"url": "http://dogcare.dailypuppy.com/puppies-gain-sight-hearing-4241.html", "passage_text": "Opening of the Ear Canals. Puppies' ear canals open up roughly five to eight days after they are born. Although their ears begin opening at this point, their hearing is still in the process of development -- nowhere near fruition yet. Closed Eyes and Ears. If you look quickly at a newborn puppy, his eyes and ears both provide helpful clues on the state of his vision and hearing, respectively. After all, both of these organs are still completely closed off to the world. It takes the eyes and the ear canals numerous days to open up in tiny puppies."}, {"url": "http://www.puplistings.com/dog-articles/when-do-puppies-open-their-eyes.html", "passage_text": "A puppy's ears will begin to open soon after their eyes, and both their vision and hearing will continue to improve. When puppies open their eyes and ears, the next step is usually beginning to walk. Until this point, most puppies crawl around and don't stand on their four feet – much like human babies. After those first couple of weeks however, the puppies will start walking and will quickly advance to trotting and running. The answer is somewhere between seven days to two weeks after birth. It varies a bit, based on breed and on the puppies themselves. A similar question is often, When does their hearing start to develop?. When puppies open their eyes, this is just the first step in the beginning of other senses, including hearing."}, {"url": "http://www.all-about-goldens.com/newborn-puppies-open-eyes.html", "passage_text": "This is because they aren't quite able to focus yet. Another stage of puppy growth development is when puppies get their hearing. Puppies are born deaf and can not hear a thing. Newborn puppies ears will open between 10 to 14 days of age. You will notice when they do get their hearing, as they will startle when you speak to them while they are still adjusting to the new sounds around them. Go from Newborn Puppies Open Eyes to Puppy Growth and Development. "}, {"url": "http://dogcare.dailypuppy.com/puppies-gain-sight-hearing-4241.html", "passage_text": "Full Sight and Hearing. Although puppies' eyes and ears open relatively early on, it takes both organs several weeks to come to their full potential. The furry guys generally gain total eyesight and hearing once they're in the range of 26 to 56 days in age. Closed Eyes and Ears. If you look quickly at a newborn puppy, his eyes and ears both provide helpful clues on the state of his vision and hearing, respectively. After all, both of these organs are still completely closed off to the world. It takes the eyes and the ear canals numerous days to open up in tiny puppies."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_a_puppy_open_their_ears", "passage_text": "A puppies ear canals are sealed. It takes them about ten days after being born for their ears to finish development. After this, the canals will open on their own. The puppies … hearing will be very acute as soon as this happens."}, {"url": "https://answers.yahoo.com/question/index?qid=20080331193136AAtODHD", "passage_text": "Pups will open their eyes in 10 to 14 days. Their ears follow a few day after that. It is common for pup to open 1 eye at a time and still have the other closed. so dont worry ok! Usually around 2 1/2 to 3 weeks old they are able to get moving and by 4 weeks old they are really moving around very well! It usually takes ten days to two weeks for puppies to open their eyes, and they can usually start standing on their own by about three weeks, although they are pretty unsteady the first day or two that they stand up."}, {"url": "http://www.puplistings.com/dog-articles/when-do-puppies-open-their-eyes.html", "passage_text": "The question is, when do puppies open their eyes and start this process. The answer is somewhere between seven days to two weeks after birth. It varies a bit, based on breed and on the puppies themselves. A similar question is often, When does their hearing start to develop?. When puppies open their eyes, this is just the first step in the beginning of other senses, including hearing."}]