[{"url": "http://www.sheknows.com/baby-names/name/freya", "passage_text": "The name Freya is a Norse baby name. In Norse the meaning of the name Freya is: Noblewoman. Scandinavian Meaning: The name Freya is a Scandinavian baby name. In Scandinavian the meaning of the name Freya is: Lady. Derived from the name of Freyja, the Norse goddess of love and fertility and mythological wife of Odin. "}, {"url": "https://en.wikipedia.org/wiki/Freyja", "passage_text": "Stemming from Old Norse Freyja, modern forms of the name include Freya, Freija, Frejya, Freyia, Froeja, Fröja, Froeya, Frøya, Froejya, Frøjya freia Freja. Frua and freiya freyja rules over her Heavenly afterlife field folkvangr fólkvangr and there receives half of those, that die in battle whereas the other half Go 'to the, God. odin s hall valhalla Stemming from Old Norse Freyja, modern forms of the name include Freya, Freija, Frejya, Freyia, Froeja, Fröja, Froeya, Frøya, Froejya, Frøjya freia Freja. f"}, {"url": "http://www.babynamewizard.com/baby-name/girl/freya", "passage_text": "Origin of the name Freya: Feminine form of Frey (lord, he who is foremost), Freya has the definition lady, mistress, noblewoman.. In Norse mythology, Freya was the goddess of fertility. A daughter of Njord and a sister of Frey, Freya was the most beautiful of the goddesses. "}, {"url": "http://www.babynamespedia.com/meaning/Freja", "passage_text": "[ 2 syll. fre-ja, fr-eja ] The baby girl name Freja is pronounced FR AY-aa (Danish, German), or FR EY-aa (Norwegian, Swedish) †. Freja's language of origin is Old Norse, and it is used mainly in the German and Scandinavian languages. Freja is a variant spelling of the German and Scandinavian Freia and a form of the English, German, and Scandinavian Freya. Freja is not regularly used as a baby name for girls. "}, {"url": "http://nameberry.com/babyname/Freja", "passage_text": "Hello, Guest Login or Register. Hello, Guest. One of the most popular names in Denmark, Freja--or Freyja--was a major deity of Norse paganism--beautiful, blonde and blue-eyed, she was the goddess of love, beauty and fertility. Also spelled FREYA. "}, {"url": "http://www.thinkbabynames.com/meaning/0/Freya", "passage_text": "Freya /freya/ [2 sylls.] as a girls' name is pronounced frey-yah, FRAY-ah. It is of Scottish and Old Norse origin, and the meaning of Freya is lady. Scandinavian mythology: Freya was the goddess of love and fertility, and her name is probably derived from an Old German word frouwa (German Frau) meaning lady, mistress. Friday was named for her. Explorer and author Freya Stark. Kreatif forms: Fefreya, Freyafe, Freyala"}, {"url": "http://www.behindthename.com/name/freya", "passage_text": "Meaning & History. From Old Norse Freyja meaning lady. This is the name of the goddess of love, beauty, war and death in Norse mythology. She claimed half of the heroes who were slain in battle and brought them to her realm in Asgard. This is not the usual spelling in any of the Scandinavian languages (in Sweden and Denmark it is Freja and in Norway it is Froeja) frøja but it is the common spelling of the'goddess s name In. English in the 2000s it became popular In. britain"}, {"url": "https://en.wikipedia.org/wiki/Freya_(given_name)", "passage_text": "Look up Freya in Wiktionary, the free dictionary. Freya is an Old Norse feminine given name derived from the name of the Old Norse goddess Freyja. Freya was the 25th most popular name for baby girls born in England and Wales and was the 32nd most popular name for baby girls born in Scotland in 2007. Freya was the 220th most popular name for girls born in Germany in 2007"}]