[{"url": "http://www.calculator.net/btu-calculator.html", "passage_text": "Reference. The British Thermal Unit, or BTU, is an energy unit. It is approximately the energy needed to heat one pound of water for 1 Fahrenheit. 1 BTU = 1,055 joules. 1BTU/hour = 0.293 watt. Examples 1  : One very well-insulated 1,000-square-foot home in Boston needs around 24,000 BTUs to heat in winter. Please note that this calculator can only gauge a rough estimate. You should also consider factors like efficiency decrease of the heater or air conditioner with time, the shape/type of your home or room, insulation conditions, and other factors. 1 watt is approximately 3.41214 BTU/h."}, {"url": "http://www.wikihow.com/Calculate-BTU-Per-Square-Foot", "passage_text": "Determine the necessary heating or cooling capacity. The capacity of furnaces and air conditioners is given in BTUs per hour. You need to establish the correct number of BTUs per square foot for your house needed to either heat or cool it. The British Thermal Unit (BTU) is the basic measure of heat energy in the Imperial system. One BTU is defined as the amount of heat necessary to raise 1 pound (0.454 kg) of water 1 degree Fahrenheit (0.55 degrees Celsius)."}, {"url": "http://cadetheat.com/blog/right-wattage-heater/", "passage_text": "If you’re ready to buy, you need to figure out which heater is right for your room, what is the right voltage and how much heat you need. This post will help you determine how many watts you need to effectively heat your room. The process is also outlined in our product selection guide. In general we recommend that you use between 6 and 10 watts per square foot you are trying to heat. 1 Insulation/type of windows – better insulation and energy-efficient windows will retain more heat. ( 2 A good rule of thumb is to figure out if your home was built before or after 1980. 3  Homes after 1980, in general, have these energy-efficient features."}, {"url": "http://www.radiantec.com/pdf/Radiant_Heat_Design_and_Construction.pdf", "passage_text": "A good way to heat a “great room” with high heat requirements. (Up to 35 BTU per hour per square ft) ON TOP OF THE SUBFLOOR – Ply-wood is ripped into strips and placed on top of the floor leaving a groove wide enough for an aluminum heat emission fin and the tubing. "}, {"url": "http://homeguides.sfgate.com/figure-size-baseboard-heater-29790.html", "passage_text": "2. Determine the total wattage needed for the room. Older homes with less insulation will use about 10 watts to heat each square foot. Newer homes with greater insulation values will only use about 6 watts per square feet. It will take approximately 600 watts to heat a 100 square foot room in a newer home. Older homes will need as much as 1,000 watts for the same room. 3. Calculate how large the baseboard heater will be. Baseboard heaters use about 250 watts of power for every foot of length. In a 100-square foot room that is part of an older home, the baseboard heater will be approximately 5 feet long. In a newer home, it will be about 3 feet long."}, {"url": "https://www.quora.com/How-much-energy-does-it-take-to-raise-the-temperature-of-an-average-room-by-10-degrees", "passage_text": "So about how much energy does it take to raise the temperature of an average room by 10 degrees? Assuming you had a 1000 watt space heater, how long would it take?I'm wondering how to calculate the heat absorbed by the walls. Assuming the height of the room is about 10 ft tall, the total volume of the room is 10 x 300 = 3000 cu.ft. Amount of energy needed to raise temperature is given by the formula: specific heat capacity of substance x mass of substance x temperature difference."}, {"url": "http://www.tempco.com/Engineering/heat_requirement_calculations.htm", "passage_text": "= Watts Heat of Vaporization (Latent Heat): The amount of heat required to change one pound of a given substance from liquid to vapor state without change in temperature is termed the heat of vaporization. It requires 965 Btu to change one pound of water at 212 F to one pound of steam at 212 F. 6. The ratio of the amount of heat required to increase the temperature of one pound of any substance by one degree to the amount necessary to increase one pound of water is known as the specific heat of that substance. Operating heat requirements will include one or more of the following four (4) calculations."}, {"url": "http://homeguides.sfgate.com/figure-size-baseboard-heater-29790.html", "passage_text": "Calculate how large the baseboard heater will be. Baseboard heaters use about 250 watts of power for every foot of length. In a 100-square foot room that is part of an older home, the baseboard heater will be approximately 5 feet long. 3. Calculate how large the baseboard heater will be. Baseboard heaters use about 250 watts of power for every foot of length. In a 100-square foot room that is part of an older home, the baseboard heater will be approximately 5 feet long. In a newer home, it will be about 3 feet long."}, {"url": "https://www.quora.com/How-much-energy-does-it-take-to-raise-the-temperature-of-an-average-room-by-10-degrees", "passage_text": "How much energy does it take to raise the temperature of an average room by 10 degrees? Assume the room is about 300 square feet and is in a well insulated building. Assume the temperature of the room is to be raised from 60 degrees F to 70 degrees F, or whatever makes the calculations easy. Assume the ceiling height is average, and that there are minimal losses (maybe some heat escapes via windows or under the doorway). Assuming the height of the room is about 10 ft tall, the total volume of the room is 10 x 300 = 3000 cu.ft. Amount of energy needed to raise temperature is given by the formula: specific heat capacity of substance x mass of substance x temperature difference."}]