[{"url": "https://support.apple.com/en-us/HT201586", "passage_text": "1 Click your document where you want the character to appear. 2  From the Edit menu, choose Emoji & Symbols (or choose Special Characters in some versions of OS X). 3  Search for the character you want using the search field, or click the view button to browse different categories of characters you can use. Repeat a character. Some keys repeat when you hold them down, depending on where you type them. Hold down the Space bar or symbol keys (like hyphen or equals) to make these characters repeat in most apps."}, {"url": "https://support.apple.com/en-us/HT201608", "passage_text": "If you still have the box or receipt for your MacBook, you can find the marketing model number or configuration details. Match your model number or configuration with one from the table below to find your MacBook model. Table notes: 1  For the model number, the xx characters are variables and will change by country. Otherwise, see MacBook: How to find the serial number to learn where to find the serial number on the surface of your computer. Type the serial number into the Check Your Service and Support Coverage page."}, {"url": "http://www.macworld.com/article/1142609/ressurect_numberpad.html", "passage_text": "Resurrecting the MacBook's number pad. By Christopher Breen, Macworld. I recently upgraded from an old 15-inch MacBook Pro to a new unibody MacBook Pro. I love my new laptop but miss being able to press the Fn key and use the J, K, L, U, I, O, 7, 8, 9 keys for a number pad as I could with my old laptop."}, {"url": "http://superuser.com/questions/138420/typing-numbers-on-a-macbook-pro-with-azerty-keyboard-with-caps-lock-possible", "passage_text": "I have a Belgian AZERTY keyboard on my MacBook Pro. Sadly, it appears to be impossible to use Caps Lock to type numbers — I still need to hold Shift for every number I want to type. "}, {"url": "https://support.apple.com/en-us/HT201608", "passage_text": "On most computers with Mac OS X, you can find the serial number in the About This Mac window. Otherwise, see MacBook: How to find the serial number to learn where to find the serial number on the surface of your computer. Type the serial number into the Check Your Service and Support Coverage page. The resulting screen will show your model"}, {"url": "http://www.wikihow.com/Type-Symbols-Using-the-ALT-Key", "passage_text": "2. Learn how to key in Alt codes on a laptop. Press the Num Lock key. (If it's blue or grey, hold down the Fn key before pressing it.) The Number Lock activated the gray or blue keys on your keyboard; they should be arranged in a square. Hold down the ALT key, hit the & then the # and then use these numbers. Ad. The ALT key can help you access alt codes, or characters that aren't readily available on a normal keyboard. These codes can be used to write in foreign languages, mathematical equations, or to add fun symbols to your messages. Below ☟ is how to do it on a PC or a Mac, then a list of symbols such as π, º, ♫ and ♥ . Ad."}, {"url": "https://support.apple.com/en-us/HT201586", "passage_text": "To choose one of the characters displayed, type the number that appears under the character, or click the character you want to use. If you decide you don't want to type an accented character after holding a key, type another character, or press the escape (Esc) key. Repeat a character. Some keys repeat when you hold them down, depending on where you type them. Hold down the Space bar or symbol keys (like hyphen or equals) to make these characters repeat in most apps."}, {"url": "http://smallbusiness.chron.com/write-letters-macbook-pro-52187.html", "passage_text": "With Microsoft Word on your MacBook Pro, you can create letters with the full range of formatting options you need to present a polished, professional image. Connect your MacBook Pro to a USB printer or use a networked or Wi-Fi connection to print your correspondence. Step 1. Launch Microsoft Word. Click on the Layout tab in the Office ribbon to display setup options. Change the size to match your letterhead size, if necessary."}, {"url": "http://www.macworld.com/article/1142609/ressurect_numberpad.html", "passage_text": "Reader Timothy Barrett has a new MacBook Pro and old habits. He writes: I recently upgraded from an old 15-inch MacBook Pro to a new unibody MacBook Pro. I love my new laptop but miss being able to press the Fn key and use the J, K, L, U, I, O, 7, 8, 9 keys for a number pad as I could with my old laptop. By Christopher Breen, Macworld."}, {"url": "https://support.apple.com/en-us/HT201586", "passage_text": "Emoji and other symbols. You can use the Character Viewer to insert smileys, dingbats, and other symbols when you’re typing. 1  Click your document where you want the character to appear. 2  From the Edit menu, choose Emoji & Symbols (or choose Special Characters in some versions of OS X). Repeat a character. Some keys repeat when you hold them down, depending on where you type them. Hold down the Space bar or symbol keys (like hyphen or equals) to make these characters repeat in most apps."}]