[{"url": "https://en.wikipedia.org/wiki/Pulse-width_modulation", "passage_text": "Pulse-width modulation (PWM), or pulse-duration modulation (PDM), is a modulation technique used to encode a message into a pulsing signal. SPWM (Sine–triangle pulse width modulation) signals are used in micro-inverter design (used in solar or wind power applications). These switching signals are fed to the FETs that are used in the device. The device's efficiency depends on the harmonic content of the PWM signal."}, {"url": "https://learn.sparkfun.com/tutorials/pulse-width-modulation", "passage_text": "To PWM, or not to PWM, That is the Question. Pulse width modulation (PWM) is a fancy term for describing a type of digital signal. Pulse width modulation is used in a variety of applications including sophisticated control circuitry. A common way we use them here at SparkFun is to control dimming of RGB LEDs or to control the direction of a servo motor. You can also use pulse width modulation to control the angle of a servo motor attached to something mechanical like a robot arm. Servos have a shaft that turns to specific position based on its control line."}, {"url": "http://www.embedded.com/electronics-blogs/beginner-s-corner/4023833/Introduction-to-Pulse-Width-Modulation", "passage_text": "Introduction to Pulse Width Modulation. A look at a powerful technique for controlling analog circuits with a microprocessor's digital outputs. Pulse width modulation (PWM) is a powerful technique for controlling analog circuits with a microprocessor's digital outputs. "}, {"url": "http://swagatam.expertscolumn.com/article/what-pulse-width-modulation-pwm-explained-simple-words", "passage_text": "New electronic hobbyists are often confused with the term Pulse Width Modulation or PWM. The word looks a bit complicated, but I can assure you that understanding is definitely not that difficult. "}, {"url": "http://www.fuelsaver-mpg.com/what-is-a-pwm", "passage_text": "Modulator loosely translates into changer. With a PWM you can change the pulse width. There are a couple of reasons for doing this, and we're only going to touch on them in this article. But as the duty cycle goes up, and the voltage is on for a higher percentage of the time, current will flow for longer times. "}, {"url": "https://en.wikipedia.org/wiki/Pulse-width_modulation", "passage_text": "Pulse-width modulation uses a rectangular pulse wave whose pulse width is modulated resulting in the variation of the average value of the waveform. If we consider a pulse waveform, with period, low value, a high value and a duty cycle D (see figure 1), the average value of the waveform is given by: SPWM (Sine–triangle pulse width modulation) signals are used in micro-inverter design (used in solar or wind power applications). These switching signals are fed to the FETs that are used in the device. The device's efficiency depends on the harmonic content of the PWM signal."}, {"url": "https://www.arduino.cc/en/Tutorial/PWM", "passage_text": "PWM. Pulse Width Modulation, or PWM, is a technique for getting analog results with digital means. Digital control is used to create a square wave, a signal switched between on and off. The duration of on time is called the pulse width. To get varying analog values, you change, or modulate, that pulse width. If you repeat this on-off pattern fast enough with an LED for example, the result is as if the signal is a steady voltage between 0 and 5v controlling the brightness of the LED. In the graphic below, the green lines represent a regular time period"}, {"url": "http://randysrepairshop.net/pulse-width-modulation.html", "passage_text": "A circuit that has used pulse-width modulation for a long time is in the voltage regulators for AC generators, (alternators). Most notably, the internal regulator in the early 1970s - 1986 GM SI generator switches at 400 cycles per second. To understand why pulse-width modulation is useful in cars, we have to know what came before it that has been replaced. The goal of these circuits is to vary how much something is turned on. Dome lights are turned on or off with a switch. Fuel injectors are turned on and off with a switching circuit in a computer"}]