[{"url": "https://www.welfare.ie/en/Pages/273_Child-Benefit.aspx", "passage_text": "Children aged 16 and 17. If you want to keep your Child Benefit for a disabled child or a child in full-time education or a child on a full-time Youthreach course aged under 18, you will need to fill in the right form (see 'How to apply' below) one month before your child's 16th birthday. If your child is 16 or 17 years of age and in full-time education you will get Child Benefit until June. You will not get another payment until your child returns to full-time education in September."}, {"url": "https://www.moneyadviceservice.org.uk/en/articles/claiming-child-benefit", "passage_text": "You need to fill out a form and send it to the Child Benefit Office along with your child’s original birth certificate (which you’ll get back). If you don’t have the certificate you can send in the form anyway and send in the certificate as soon as you have it. Get the Child Benefit claim form from the GOV.UK website. 1 If you or your partner earns over £50,000 a year, you will have to pay back some of your Child Benefit in the form of extra Income Tax. 2  If you or your partner earns over £60,000 you will have to repay all"}, {"url": "https://www.gov.uk/child-benefit/how-to-claim", "passage_text": "When to claim. It can take up to 12 weeks to process a new Child Benefit claim (or longer if you’re new to the UK). Claim Child Benefit as soon as your child is born or comes to live with you. Child Benefit can be backdated for up to 3 months-make your claim as soon as possible. If you don’t have the birth or adoption certificate, you should still send in your claim form-send the certificate later on when you’ve got it. "}, {"url": "https://www.welfare.ie/en/Pages/273_Child-Benefit.aspx", "passage_text": "1 If you are claiming Child Benefit for another child, your new baby is added to your Child Benefit claim and payment begins automatically from the month after the birth. 2  A letter confirming payment will be sent to you by the Department. If your child is 16 or 17 years of age and in full-time education you will get Child Benefit until June. You will not get another payment until your child returns to full-time education in September."}, {"url": "https://www.welfare.ie/en/Pages/273_Child-Benefit.aspx", "passage_text": "1 If you are not claiming Child Benefit for another child a new claim is created by the Department and a partially completed claim form is sent to you for your signature and payment details. 2  This form also includes information on how to claim for your new baby online. If your child is 16 or 17 years of age and in full-time education you will get Child Benefit until June. You will not get another payment until your child returns to full-time education in September."}, {"url": "http://www.wikihow.com/Add-a-Baby-to-Health-Insurance", "passage_text": "3. Discuss the health insurance options for your expanding family. If you have an existing health insurance plan, you can add your baby to your existing plan or you can decide to change your health insurance plan to a family plan. Get in touch with your health insurance company as soon as possible. Most health insurance companies require that your newborn be added to an existing policy within 30 days of birth. Under the Affordable Care Act in the United States, you are required to sign your baby up for health insurance."}, {"url": "https://www.welfare.ie/en/Pages/273_Child-Benefit.aspx", "passage_text": "Child under 16 years of age. If your baby is born in Ireland and you are not claiming for any other children, the Child Benefit section will send you an application form. This form also includes information on how to claim for your new baby online. If your child is 16 or 17 years of age and in full-time education you will get Child Benefit until June. You will not get another payment until your child returns to full-time education in September."}, {"url": "https://www.gov.uk/report-changes-child-benefit", "passage_text": "Tell the Child Benefit Office straight away if your child: 1  starts paid work for 24 hours a week or more. 2  will live away from you for either 8 weeks in a row or more than 56 days in a 16-week period. 3  will go abroad permanently or for more than 12 weeks. 4  moves to or from Northern Ireland. The Child Benefit tax charge. Changes in circumstances may mean you may have to pay the Child Benefit tax charge. The charge affects you if your income (or your partner’s) is £50,000 or more. You must still report changes even if you’ve stopped getting Child Benefit because of"}, {"url": "http://www.bankrate.com/finance/insurance/adding-a-new-baby-to-your-health-insurance.aspx", "passage_text": "Adding a child to an exchange plan. You can get up to 60 days to add a new baby to a plan purchased through a health exchange, but Touschner recommends you don't wait and that you promptly obtain a new plan that fits your family's changed circumstances. You may assume that your insurer will automatically add your baby to your health insurance policy, but it's really up to you to make contact with them. Otherwise, your baby could lose out on insurance benefits, and you may face a penalty under Obamacare."}]