[{"url": "http://umm.edu/health/medical/altmed/condition/atherosclerosis", "passage_text": "Peripheral Artery Disease. Peripheral artery disease affects the arteries that supply the arms and legs with oxygen-rich blood. Symptoms may include: 1  Pain, aching, cramps, numbness, or sense of fatigue in the leg muscles (intermittent claudication). Fat, cholesterol, calcium, and other substances form plaque, which builds up in arteries. Hard plaque narrows the passage that blood flows through. That causes arteries to become stiff and inflexible (atherosclerosis is also known as hardening of the arteries)."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001224/", "passage_text": "Atherosclerosis is a disease in which plaque builds up inside your arteries. Arteries are blood vessels that carry oxygen-rich blood to your heart and other parts of your body. Atherosclerosis can affect any artery in the body, including arteries in the heart, brain, arms, legs, pelvis, and kidneys. As a result, different diseases may develop based on which arteries are affected."}, {"url": "http://www.webmd.com/heart-disease/features/atherosclerosis-your-arteries-age-by-age?page=2", "passage_text": "Atherosclerosis in Your 40s and 50s. In men after age 50, the rate of atherosclerosis development accelerates markedly. In women, this increased risk is delayed until age 60. By this time, even if you don't have any evidence of atherosclerosis, your lifetime chances of developing its complications are greater than 50%. Atherosclerosis in Your 20s and 30s. Atherosclerosis is the last thing on most young adults' minds. But early forms of atherosclerosis are frequently present in our 20s and 30s. Almost no one suffers complications from atherosclerosis at this age."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmedhealth/PMH0001224/", "passage_text": "Atherosclerosis of the arteries of the legs can become symptomatic as people age. People affected may experience discomfort and cramping pain in the legs that is triggered by exercise and relieved with rest, termed intermittent claudication. Atherosclerosis can affect any artery in the body, including arteries in the heart, brain, arms, legs, pelvis, and kidneys. As a result, different diseases may develop based on which arteries are affected."}, {"url": "http://www.heart.org/HEARTORG/Conditions/Cholesterol/WhyCholesterolMatters/Atherosclerosis_UCM_305564_Article.jsp", "passage_text": "Atherosclerosis, or hardening of the arteries, is a condition in which plaque builds up inside the arteries. Plaque is made of cholesterol, fatty substances, cellular waste products, calcium and fibrin (a clotting material in the blood). Atherosclerosis is a type of arteriosclerosis. Some of the diseases that may develop as a result of atherosclerosis include coronary heart disease, angina (chest pain), carotid artery disease, peripheral artery disease (PAD) and chronic kidney disease. Two things that can happen where plaque occurs are: 1  A piece of the plaque may break off."}, {"url": "http://umm.edu/health/medical/altmed/condition/atherosclerosis", "passage_text": "Introduction. Atherosclerosis is a slow disease in which your arteries become clogged and hardened. It is the underlying cause of most cases of heart attack, stroke, and vascular dementia, and is found in 80 to 90% of Americans over the age of 30. Fat, cholesterol, calcium, and other substances form plaque, which builds up in arteries. Hard plaque narrows the passage that blood flows through. That causes arteries to become stiff and inflexible (atherosclerosis is also known as hardening of the arteries)."}, {"url": "http://umm.edu/health/medical/altmed/condition/atherosclerosis", "passage_text": "The effects of atherosclerosis differ depending upon which arteries in the body narrow and become clogged with plaque. If the arteries that bring oxygen-rich blood to your heart are affected, you may have coronary artery disease, chest pain, or a heart attack. Fat, cholesterol, calcium, and other substances form plaque, which builds up in arteries. Hard plaque narrows the passage that blood flows through. That causes arteries to become stiff and inflexible (atherosclerosis is also known as hardening of the arteries)."}, {"url": "http://www.nhlbi.nih.gov/health/health-topics/topics/atherosclerosis/atrisk", "passage_text": "1 Family history of early heart disease. 2  Your risk for atherosclerosis increases if your father or a brother was diagnosed with heart disease before 55 years of age, or if your mother or a sister was diagnosed with heart disease before 65 years of age. 1 As you get older, your risk for atherosclerosis increases. 2  Genetic or lifestyle factors cause plaque to build up in your arteries as you age. 3  By the time you're middle-aged or older, enough plaque has built up to cause signs or symptoms. 4  In men, the risk increases after age 45. 5  In women, the risk increases after age 55."}, {"url": "http://www.healthguideinfo.com/coronary-artery-disease/p75745/", "passage_text": "Heart Arteries. When atherosclerosis occurs in the arteries of the heart, the most common symptom that can occur is chest pain, or angina. This pain is centered in the chest, and feels like a crushing or squeezing pain. People with angina typically have episodes of pain after exercise which goes away upon resting. This process of arterial stiffening is called arteriosclerosis. Atherosclerosis is a type of arteriosclerosis in which fatty deposits called plaques build up in the arteries. The buildup of plaques can restrict blood flow through the arteries, causing disease in various parts of the body, including the heart and brain."}]