[{"url": "http://www.rockwallvotes.com/", "passage_text": "Rockwall County Elections Department. The mission of the Rockwall County Elections Department is to establish and increase public confidence in the electoral process by conducting voter registration and elections with the highest level of professional election standards, integrity, and accuracy. "}, {"url": "http://www.rockwallcountytexas.com/", "passage_text": "In December, 2012, the Texas Supreme Court requires that e-filing be used for civil matters. The beginning date mandated for Rockwall County is July 1, 2015. Rockwall County will hold a public meeting on Tuesday, October 27th from 6:30-7:30 to gather public input for a County-wide Hazard Mitigation Plan at the Rockwall County Historic Courthouse."}, {"url": "http://www.zip-codes.com/county/TX-ROCKWALL.asp", "passage_text": "1 The ROCKWALL County TX ZIP Code Map shows all 5 digit zip code boundaries for ROCKWALL County TX. 1 Get all Area Codes and NXX data for North America. 2  TX ZIP Code Map. 3  The TX ZIP Code Map shows all 5 digit zip code boundaries for TX using clean, practical map colors and styles. 4  ROCKWALL County, TX ZIP Code Map. 5 "}, {"url": "https://en.wikipedia.org/wiki/Rockwall,_Texas", "passage_text": "The city is home to the Higher Education Center at Rockwall, which is part of the community college district, Collin College. The campus is the District's first campus outside of Collin County itself. Texas A&M University-Commerce holds classes at the Center. About 3.2% of families and 3.9% of the population were below the poverty line, including 4.6% of those under age 18 and 3.0% of those age 65 or over. Though Rockwall County is the smallest county in Texas, it is also one of the top five fastest growing counties in the United States. As of the 2006 census by the North Texas Central Council of Governments, the city had a population of 29,500"}, {"url": "http://www.rockwallcad.com/", "passage_text": "Within this site you will find general information about the District and the ad valorem property tax system in Texas, as well as information regarding specific properties within the district. Rockwall Appraisal District is responsible for appraising all real and business personal property within Rockwall County. The district appraises property according to the Texas Property Tax Code and the Uniform Standards of Professional Appraisal Practices (USPAP). "}, {"url": "https://en.wikipedia.org/wiki/Rockwall,_Texas", "passage_text": "Rockwall is a city in Rockwall County, Texas, United States, and a suburb of Dallas and part of the Dallas/Fort Worth Metroplex. It is the county seat of Rockwall County, which is the third wealthiest county in the state of Texas. The population was 37,490 at the 2010 census. About 3.2% of families and 3.9% of the population were below the poverty line, including 4.6% of those under age 18 and 3.0% of those age 65 or over. Though Rockwall County is the smallest county in Texas, it is also one of the top five fastest growing counties in the United States. As of the 2006 census by the North Texas Central Council of Governments, the city had a population of 29,500"}, {"url": "http://www.zip-codes.com/county/TX-ROCKWALL.asp", "passage_text": "1 The TX ZIP Code Map shows all 5 digit zip code boundaries for TX using clean, practical map colors and styles. 2  ROCKWALL County, TX ZIP Code Map. 3  The ROCKWALL County TX ZIP Code Map shows all 5 digit zip code boundaries for ROCKWALL County TX. 1 Get all Area Codes and NXX data for North America. 2  TX ZIP Code Map. 3  The TX ZIP Code Map shows all 5 digit zip code boundaries for TX using clean, practical map colors and styles. 4  ROCKWALL County, TX ZIP Code Map. 5"}, {"url": "https://en.wikipedia.org/wiki/Rockwall_County,_Texas", "passage_text": "Rockwall County is the a county located in the U.S. state of Texas. At 129 square miles, Rockwall County has the smallest area of any county in Texas. As of the 2014 census, its population was 87,809. Its county seat is Rockwall. The county and city are named for a wall-like subterranean rock formation that runs throughout the county. Rockwall County is part of the Dallas-Fort Worth-Arlington, TX Metropolitan Statistical Area. It was one of the top twenty-five fastest growing counties in the U.S. in 2010. Rockwall County is currently listed as the 6th wealthiest Texas county in Texas locations by per capita income. Its cities include Rockwall, Royse City, Fate, McClendon-Chisolm, Mobile City, and a part of Rowlett"}]