[{"url": "http://graduatedegrees.online.njit.edu/mscs-resources/mscs-articles/current-trends-in-data-mining/", "passage_text": "What is most important about data mining is the quality and amount of the data, regardless of the format. With the amount of data being collected and stored today, data mining has taken on much greater significance for public and private organizations of all types."}, {"url": "http://graduatedegrees.online.njit.edu/mscs-resources/mscs-articles/current-trends-in-data-mining/", "passage_text": "Current Trends in Data Mining. Data mining is based on complex algorithms that allow for the segmentation of data to identify patterns and trends, detect anomalies, and predict the probability of various situational outcomes. The raw data being mined may come in both digital and analog formats depending on the data sources."}, {"url": "http://www.tutorialspoint.com/data_mining/dm_applications_trends.htm", "passage_text": "Data mining concepts are still evolving and here are the latest trends that we get to see in this field 1  −. Application Exploration. 2  Scalable and interactive data mining methods. 3  Integration of data mining with database systems, data warehouse systems and web database systems."}, {"url": "http://graduatedegrees.online.njit.edu/mscs-resources/mscs-articles/current-trends-in-data-mining/", "passage_text": "For example: 1  Law enforcement agencies can use data mining to look for crime patterns. 2  Retailers can predict buyer behavior and shopping trends, as well as analyze marketing results and customer loyalty patterns. 3  Financial firms can identify loan repayment patterns and any outlying activities that might point to fraud. 4  Medical researchers can 5  ... Te"}, {"url": "http://www.slideshare.net/IJMER/es2646574663", "passage_text": "future trends in the field of data mining, with a focus on those which are thought to have the most promise and applicability. to future data mining applications. Keywords: Current and Future of Data Mining, Data Mining, Data Mining Trends, Data mining A"}, {"url": "http://www.tutorialspoint.com/data_mining/dm_applications_trends.htm", "passage_text": "Data mining in retail industry helps in identifying customer buying patterns and trends that lead to improved quality of customer service and good customer retention and satisfaction. Here is the list of examples of data mining in the retail industry −."}, {"url": "http://www.researchmanuscripts.com/isociety2012/15.pdf", "passage_text": "The early day’s data mining trends are as under. 2.1 Data Trends In initial days, data mining algorithms work best for numerical data collected from a single data base, and various data mining techniques have evolved for flat files, traditional and relational databases where the data is stored in tabular representation."}]