[{"url": "http://www.webmd.com/balance/news/20050927/whos-number-1-in-self-esteem", "passage_text": "Some cultural differences appeared, especially in the self-competence and self-liking aspects of self-esteem. People in the most individualistic nations (including the U.S.) tended to rate themselves higher for self-competence than for self-liking. The opposite was true for those in countries that are more oriented to communities, not individuals. Self-esteem may not get as much attention in some countries."}, {"url": "http://www.webmd.com/balance/news/20050927/whos-number-1-in-self-esteem", "passage_text": "Your global neighbors might be able to give you some pointers. A new international self-esteem survey puts Serbia at the top, Japan at the bottom, and the U.S. in sixth place. The researchers included David Schmitt, PhD."}, {"url": "http://abcnews.go.com/Health/Healthday/story?id=6238757&page=1", "passage_text": "When we look at the responses of the students in the '70s, they are certainly confident that they are going to perform well, but their responses are more modest, a little more realistic than teens in 2006, Twenge said."}, {"url": "http://us.reachout.com/facts/factsheet/self-esteem", "passage_text": "Your self-esteem is the way you look at or perceive yourself. If you have healthy self-esteem, it means that you like yourself and you believe that you are just as cool as everyone else. If you have low self-esteem, it means that you believe that you’re inferior to others. People who have low self-esteem tend to focus on what they believe are their shortcomings, and sometimes blow those flaws out of proportion. They might ignore their strengths and achievements."}, {"url": "http://highlysensitive.org/263/elaine-aron-on-our-emotional-challenges/", "passage_text": "It’s natural. No wonder raising yourself in the self-esteem ranking is not the answer. To get out of ranking, switch to linking, my next blog entry.”. Another of her books is “The Undervalued Self: Restore Your Love/Power Balance, Transform the Inner Voice That Holds You Back, and Find Your True Self-Worth.”."}, {"url": "http://us.reachout.com/facts/factsheet/self-esteem", "passage_text": "Your self-esteem can affect how you feel, how you relate to other people, how you deal with challenges and how relaxed and safe you feel in your daily life. Here are a few examples: The way you feel. In order to be happy you need to like yourself."}]