[{"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/in-depth/blood-sugar/ART-20046628", "passage_text": "1 Type 2 diabetes. 2  If you take insulin to manage type 2 diabetes, your doctor may recommend blood sugar testing two or more times a day, depending on the type and amount of insulin you need. 3  Testing is usually recommended before meals, and sometimes before bedtime."}, {"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/in-depth/blood-sugar/ART-20046628", "passage_text": "When to test your blood sugar. Your doctor will advise you on how often you should check your blood sugar level. In general, the frequency of testing depends on the type of diabetes you have and your treatment plan. 1  Type 1 diabetes. 2  Your doctor may recommend blood sugar testing four to eight times a day if you have t"}, {"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/in-depth/blood-sugar/ART-20046628", "passage_text": "1 Type 1 diabetes. 2  Your doctor may recommend blood sugar testing four to eight times a day if you have type 1 diabetes. 3  You may need to test before meals and snacks, before and after exercise, before bed, and occasionally during the night."}, {"url": "http://www.mayoclinic.org/diseases-conditions/diabetes/in-depth/blood-sugar/ART-20046628?pg=2", "passage_text": "How to test your blood sugar. Blood sugar testing requires the use of a small electronic device called a glucose meter. The meter reads the amount of sugar in a small sample of blood, usually from your fingertip, that you place on a disposable test strip."}, {"url": "http://familydoctor.org/familydoctor/en/diseases-conditions/diabetes/treatment/monitoring-your-blood-sugar-level.html", "passage_text": "One of these tests is called an A1C test, which reflects your blood sugar (or blood glucose) control over the past 2-3 months. Testing your A1C level every 3 months is the best way for you and your doctor to understand how well your blood sugar levels are controlled. Your A1C goal will be determined by your doctor, but it is generally less than 7%. The other test is called SMBG, or self-monitoring of blood glucose."}, {"url": "http://www.healthguideinfo.com/living-with-diabetes/p96164/", "passage_text": "When is the best time to take your blood glucose levels? This is a question that a lot of diabetics, both non-insulin dependent and insulin dependent, ponder about. In general, if you're testing your blood sugar levels every day, make sure you test at the same time."}, {"url": "http://familydoctor.org/familydoctor/en/diseases-conditions/diabetes/treatment/monitoring-your-blood-sugar-level.html", "passage_text": "Recommendations for the best time of day to test your blood sugar depend on your medicine, mealtimes and blood sugar control. On the chart, your doctor will check the times when you should test your blood sugar. Your doctor may also suggest different goals, depending on your situation."}]