[{"url": "http://www.manufacturingterms.com/Heijunka.html", "passage_text": "Production leveling, also known as production smoothing or – by its Japanese original term – heijunka (平準化),is a technique for reducing the mura waste and vital to the development of production efficiency in the Toyota Production System and Lean Manufacturing."}, {"url": "http://www.villanovau.com/resources/six-sigma/heijunka/", "passage_text": "Heijunka (hi-JUNE-kuh) is a Japanese word for leveling. It is part of the lean methodology of process improvement that helps organizations match unpredictable customer demand patterns and eliminate manufacturing waste by leveling the type and quantity of production output over a fixed period of time."}, {"url": "http://www.wisegeek.com/what-is-heijunka.htm", "passage_text": "Heijunka is a Japanese word that refers to processes that help level or smooth out production. This system is a process that allows scheduling of the manufacturing process to concentrate on smaller, more manageable amounts in order to ensure that all the products from the line are the same."}, {"url": "http://www.businessdictionary.com/definition/heijunka.html", "passage_text": "Show more usage examples... In an effort to become more efficient, the company implemented heijunka into their manufacturing process, with very small production batches moving through the line in a coordinated and even fashion."}, {"url": "http://www.shmula.com/about-peter-abilla/what-is-heijunka/", "passage_text": "Most businesses are cyclical – whether the business is B-to-B or C-to-C. In other words, there will be spikes – or more accurate – there will be feasts and famine in terms of demand. Heijunka is the Japanese term in Lean Manufacturing which mean “Production Leveling” or “Production Smoothing”. Indeed, Heijunka is a foundation in the Toyota House for a reason."}, {"url": "http://help.sap.com/saphelp_me61/helpdata/EN/45/6345892fb61debe10000000a155369/content.htm", "passage_text": "Use. You can use kanban in the heijunka process to control and monitor the production of materials. Production smoothing is supported and even production over a certain period ensured through the ongoing production of small quantities on the basis of the kanbans. Kanban processing is a means of lot-size creation."}, {"url": "http://www.shmula.com/about-peter-abilla/what-is-heijunka/", "passage_text": "The Toyota Production System (Lean Manufacturing) uses Heijunka to solve fluctuations brought about by customer demand by assembling a mix of models within each batch, which ensures that there is an inventory of product proportional the variability in demand."}]