[{"url": "http://www.places.co.za/html/garden_route.html", "passage_text": "Where ever you are, you've most probably heard about the Garden Route in the Western Cape ... and rightly so, for this is one of the most magnificent, awe-inspiring stretches of land in South Africa, if not the world. Eco-Destination & Holiday Mecca. The Garden Route is renowned for vast stretches of beach, enclosed by mountains, lakes, valleys, nature reserves and the sea-an eco-destination par excellence catering for the nature lover. And it is a holidaymaker's mecca."}, {"url": "https://en.wikipedia.org/wiki/Garden_Route", "passage_text": "Map showing the Garden Route's location. The Garden Route (Afrikaans: Tuinroete) is a stretch of the south-eastern coast of South Africa which extends from Mossel Bay in the Western Cape to the Storms River in the Eastern Cape. "}, {"url": "http://www.dailymail.co.uk/travel/article-2312249/Six-things--South-Africas-beautiful-Garden-Route.html", "passage_text": "3...Whale watch. The Garden Route's coast is one of the best and easiest places in the world to see whales and dolphins from land. Robberg Beach is a top location to see exhilarating acrobatics from southern right whales. Look out for 60 tons of raw power doing headstands within splashing distance of the shore. You could drive the Garden Route in a day, but I wouldn't. Stop in a place such as Mossel Bay, with the world's mildest year-round climate after Hawaii. Or Plettenberg Bay, for its glorious, golden beaches. Or Knysna, voted South Africa's best small town, for its art galleries, coffee shops and restaurants."}, {"url": "http://www.dirtyboots.co.za/adventures/region/garden-route-adventures/", "passage_text": "Garden Route. The aptly named Garden Route is a stretch of coast from Mossel Bay to the mouth of Storms River, sandwiched between the Outeniqua and Tsitsikamma Mountains and the Indian Ocean. "}, {"url": "http://www.sa-venues.com/garden_route.htm", "passage_text": "The Garden Route stretches on the southern coast from Heidelberg to the Tsitsikamma Forest and Storms River. It s a nook of the country that offers inspiration to writers and artists whose presence gives the Garden Route a trendy flavour. Between Heidelberg and Storms River, the Garden Route runs parallel to a coastline featuring lakes, mountains, tall indigenous forests, amber-coloured rivers and golden beaches."}, {"url": "http://www.go2africa.com/location/6312/where-to-go", "passage_text": "The Garden Route is one of the world’s most spectacular drives, a 200km stretch of road that winds past forested mountains, sprawling wetlands and white-sand beaches with picturesque towns spaced no more than a 45-minute drive apart. "}, {"url": "http://www.sa-venues.com/things-to-do/gardenroute/", "passage_text": "The beautiful and dramatic Garden Route, that stretches from around Mossel Bay to the Storms River Mouth, is an area dense with forests, beaches, lakes, rivers, kloofs and hardwood trees and is regarded as one of the most beautiful regions in the country. Browse through 425 Things To Do in the Garden Route ranging from Outdoor Adventure Activities to Shopping, Eating Out, ..."}, {"url": "http://wikitravel.org/en/Garden_Route", "passage_text": "Garden Route. The Garden Route in the Western Cape is one of South Africa 's main tourist attractions and is generally thought to stretch from Mossel Bay to St Francis along the Indian ocean and also includes parts of the inland. "}, {"url": "http://www.southafrica.net/za/en/articles/entry/article-southafrica.net-the-garden-route", "passage_text": "There's a large Rastafarian community outside Knysna at a place called Judah Square. The main arterial highway through The Garden Route in South Africa, a highlight on most visitors' itineraries, is the N2 stretch running from Heidelberg in the Southern Cape to Storms River Village on the Eastern Cape border. "}, {"url": "http://www.sa-venues.com/garden_route.htm", "passage_text": "The Garden Route enjoys a Mediterranean climate with warm summers and mild winters. The Garden Route is one of the richest rainfall regions in South Africa. The rain, brought by the humid sea-winds from the Indian Ocean, falls at the weather side of the mountain slopes. Between Heidelberg and Storms River, the Garden Route runs parallel to a coastline featuring lakes, mountains, tall indigenous forests, amber-coloured rivers and golden beaches."}]