[{"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-307-RESVERATROL.aspx?activeIngredientId=307&activeIngredientName=RESVERATROL", "passage_text": "Resveratrol is LIKELY SAFE when used in the amounts found in foods, and when taken by mouth in doses up to 250 mg daily for up to 3 months. Higher doses of up to 900 mg have been taken for up to 2 days. Resveratrol has also been applied to the skin safely for up to 30 days. Pregnancy and breast-feeding: Resveratrol is LIKELY SAFE when used in amounts found in some foods. However, during pregnancy and breast-feeding, the source of resveratrol is important"}, {"url": "http://www.mayoclinic.org/diseases-conditions/heart-disease/in-depth/red-wine/ART-20048281", "passage_text": "In addition, to get the same dose of resveratrol used in the mice studies, a person would have to drink more than 1,000 liters of red wine every day. Research in pigs has shown that resveratrol may improve heart function and increase the body's ability to use insulin. Red wine and something in red wine called resveratrol might be heart healthy. Find out the facts, and hype, regarding red wine and its impact on your heart. Heart-Healthy Living Subscribe to our Heart-Healthy Living e-newsletter to stay up to date on heart-health topics."}, {"url": "https://en.wikipedia.org/wiki/Resveratrol", "passage_text": "Resveratrol (3,5,4'-trihydroxy-trans-stilbene) is a stilbenoid, a type of natural phenol, and a phytoalexin produced naturally by several plants in response to injury or when the plant is under attack by pathogens such as bacteria or fungi. In grapes, resveratrol is found primarily in the skin, and, in muscadine grapes, also in the seeds. The amount found in grape skins also varies with the grape cultivar, its geographic origin, and exposure to fungal infection."}, {"url": "http://www.news-medical.net/health/What-is-Resveratrol.aspx", "passage_text": "By Liji Thomas, MD. Resveratrol is a phytoalexin, which means it is a protective antibiotic produced in plants under stress, whether due to fungal attack, drought, ultraviolet irradiation, or inflammation. This molecule helps the plants to fight back and maintain health. "}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-307-RESVERATROL.aspx?activeIngredientId=307&activeIngredientName=RESVERATROL", "passage_text": "1 Some research suggests that taking 5 mg of resveratrol twice daily for 4 weeks does not affect insulin levels in people with diabetes. 2  However, other evidence shows that taking a specific product that contains resveratrol (Biofort) daily for 3 months reduces blood sugar, blood pressure and fat levels in the blood. Higher doses of up to 900 mg have been taken for up to 2 days. Resveratrol has also been applied to the skin safely for up to 30 days. Pregnancy and breast-feeding: Resveratrol is LIKELY SAFE when used in amounts found in some foods."}, {"url": "http://www.health.harvard.edu/blog/resveratrol-the-hype-continues-201202034189", "passage_text": "Resveratrol basics. Resveratrol is a compound that various plants make to fight off bacteria, fungi, and other microbial attackers, or to withstand drought or lack of nutrients. It has been found in red and purple grapes, blueberries, cranberries, mulberries, lingonberries, peanuts, and pistachios. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/heart-disease/in-depth/red-wine/art-20048281?pg=2", "passage_text": "Resveratrol in grapes, supplements and other foods. The resveratrol in red wine comes from the skin of grapes used to make wine. Because red wine is fermented with grape skins longer than is white wine, red wine contains more resveratrol. Simply eating grapes, or drinking grape juice, has been suggested as one way to get resveratrol without drinking alcohol. Other foods that contain some resveratrol include peanuts, blueberries and cranberries. It's not yet known how beneficial eating grapes or other foods might be compared with drinking red wine when it comes to promoting heart health. The amount of resveratrol in food and red wine can vary widely."}, {"url": "https://en.wikipedia.org/wiki/Resveratrol", "passage_text": "Food sources of resveratrol include the skin of grapes, blueberries, raspberries, and mulberries. As of 2014, there is limited evidence of health effects in humans. In grapes, resveratrol is found primarily in the skin, and, in muscadine grapes, also in the seeds. The amount found in grape skins also varies with the grape cultivar, its geographic origin, and exposure to fungal infection."}, {"url": "http://www.webmd.com/heart-disease/resveratrol-supplements", "passage_text": "Resveratrol is found in the skin of red grapes, but other sources include peanuts and berries. Because resveratrol is thought to have so many health benefits, it's not surprising that a number of manufacturers have tried to capitalize by selling resveratrol supplements. Resveratrol is a member of a group of plant compounds called polyphenols. These compounds are thought to have antioxidant properties, protecting the body against the kind of damage linked to increased risk for conditions such as cancer and heart disease."}]