[{"url": "https://www.facebook.com/help/community/question/?id=1389367191285269", "passage_text": "1 How do I set up a second email account with the same email a... 2  Can I use the same email address for more than one facebook... 3  Someone is usiing my email address for their facebook account. 4  How can I access other account with same email address as th... 5  How can my husband and I have an account on the same email a... almost 2 weeks ago, I tried to create a new facebook account and succeded. It didn't give me an error that I have already had an account with this mail address. now I can not reach my older facebook account with my mail address and password on PC."}, {"url": "http://www.livemans.com/how-to-create-multiple-facebook-account-from-same-email/", "passage_text": "Tech. Facebook doesn’t allow you to create multiple accounts with the same e-mail id. If you try to create a new Facebook account with same email address you will get an error message “there is an existing account associated with this email id.”. But if you are using gmail id then it is possible to use same gmail id for multiple Facebook accounts. (dot) in email address where as yahoo and hotmail doesn’t. Means the whole fund is if you want to create multiple Facebook account first you need to grab and Gmail id. Suppose you have an Gmail id xyz@gmail.com, What you have to do for create another account from same Email id, You have to add."}, {"url": "http://www.livemans.com/how-to-create-multiple-facebook-account-from-same-email/", "passage_text": "It’s very easy to Sign-up on Facebook with same email id for multiple accounts. Because gmail ignore. (dot) in email address where as yahoo and hotmail doesn’t. Means the whole fund is if you want to create multiple Facebook account first you need to grab and Gmail id. Suppose you have an Gmail id xyz@gmail.com, What you have to do for create another account from same Email id, You have to add."}, {"url": "http://www.ehow.com/video_12238606_create-one-facebook-same-email-address.html", "passage_text": "Video Transcript. Hi, my name is Kerianne Mellott from MarketingMakesMeSmile.com. I'm a Marketing Coach and a Social Media Expert. If you have the need to create an additional Facebook page using the same email address, you absolutely can. But, it's important to note the difference between a Facebook page and a Facebook profile. Creating more than one Facebook page may be necessary if you run a business or need personal and Fan accounts. Create more than one Facebook page with help from the founder of a marketing company that specializes in delivering social media strategies in this free video clip."}, {"url": "http://smallbusiness.chron.com/can-two-facebook-accounts-one-email-address-26646.html", "passage_text": "Chron.com Local Directory. Although it isn't possible to create two separate Facebook accounts from one email address, it is possible to use Facebook as two or more separate entities from the same Facebook account. "}, {"url": "http://technott.com/2010/05/how-to-create-multiple-facebook-accounts-using-same-e-mail-address/", "passage_text": "The confirmation mail for second account will too be sent to [email protected] Similarly, try for [email protected] or [email protected] In this way you can create a large no. of Facebook accounts with same Gmail address. Personally, I think its easier to just create multiple free email accounts and create FB accounts with those individually. FB doesn’t seem to worry about multiple accounts unless there’s spamming involved. They have no way to prove its the same person or several people using the same computer."}, {"url": "https://answers.yahoo.com/question/index?qid=20090714211428AA64Ivg", "passage_text": "I made two face book accounts a while ago (one with my email address and one with my moms). But now my mom wants a face book. So I deleted the account under her email, and I went to create one for her under the same email and when I clicked the sign up button (after filling out the info) it said THERE IS AN... "}, {"url": "http://technott.com/2010/05/how-to-create-multiple-facebook-accounts-using-same-e-mail-address/", "passage_text": "If you try to create a new Facebook account with same e-mail id, you will get an error “ There is an existing account associated with this email address.” However if you are using Gmail, you can tweak to create two or more Facebook accounts with same e-mail. Here’s how it works: Personally, I think its easier to just create multiple free email accounts and create FB accounts with those individually. FB doesn’t seem to worry about multiple accounts unless there’s spamming involved. They have no way to prove its the same person or several people using the same computer."}, {"url": "https://www.facebook.com/help/community/question/?id=1389367191285269", "passage_text": "successfuly created second facebook account with same email address!!!! My Account. Your Info. almost 2 weeks ago, I tried to create a new facebook account and succeded. It didn't give me an error that I have already had an account with this mail address. now I can not reach my older facebook account with my mail address and password on PC."}, {"url": "https://www.facebook.com/help/community/question/?id=1389367191285269", "passage_text": "1 Someone is usiing my email address for their facebook account. 2  How can I access other account with same email address as th... 3  How can my husband and I have an account on the same email a... almost 2 weeks ago, I tried to create a new facebook account and succeded. It didn't give me an error that I have already had an account with this mail address. now I can not reach my older facebook account with my mail address and password on PC."}]