[{"url": "http://www.inc.com/laura-montini/infographic/how-us-small-businesses-get-started.html", "passage_text": "Advertisement. The majority of entrepreneurs set out to create a company with $10,000 or less. That's according to a recent Intuit survey of 500 small businesses across the country. The survey results also revealed that three quarters of those business owners relied on their own savings to get started."}, {"url": "http://www.financialsamurai.com/how-much-do-i-have-to-make-as-an-entrepreneur-or-contractor-to-replace-my-day-job-income/", "passage_text": "If you make $120,000 as an entrepreneur, it’s not bad, but it’s really only equivalent to about $75,000 a year as an employee. My recommendation is to moonlight for as long as possible until you know with great certainty that your entrepreneurial income can cover all your basic expenses for six months in a row. There are two components to the chart: 1) How much your day job salary is really worth after adding up all the benefits, 2) How much an employee doesn’t have to pay because s/he is not an entrepreneur. Chart Review: * True Value Of Your Day Job: I’ve used very typical benefits given to a $100,000 a year employee."}, {"url": "http://www.financialsamurai.com/how-much-do-i-have-to-make-as-an-entrepreneur-or-contractor-to-replace-my-day-job-income/", "passage_text": "For example, I can see how $250,000 in entrepreneurship income is equivalent to about $156,250 in day job income based on experience. There are plenty of $156,250 a year jobs one could get if they no longer want to be a $250,000 a year entrepreneur e.g. consultant, banker, lawyer, engineer. It’s harder to grasp that one needs to make $250,000 a year as an entrepreneur to replace their $156,250 a year job. If you look at higher income figures, it gets more daunting e.g. $400,000 in entrepreneurship income to replace a $250,000 a year day job. There are two components to the chart: 1) How much your day job salary is really worth after adding up all the benefits, 2) How much an employee doesn’t have to pay because s/he is not an entrepreneur. Chart Review: * True Value Of Your Day Job: I’ve used very typical benefits given to a $100,000 a year employee."}, {"url": "http://www.onlinebusinessdegree.org/answers/business-salary/", "passage_text": "Salaries normally start in the $60,000 range annually. 1  Financial managers can earn up to $90,970 annually, with an average potential for growth in 2-3 years of work. 2  Operations managers are in the upper tier of business management and can expect to make $94,992 in a competitive field. Some opportunities include: 1  Retail assistant managers or key persons can expect to make an average weekly salary of about $228 to $320. 2  There is an expected job growth in the retail sales industry of about 11% through the year 2018 according to the Bureau of Labor Statistics."}, {"url": "http://www.onlinebusinessdegree.org/answers/business-salary/", "passage_text": "1 Financial managers can earn up to $90,970 annually, with an average potential for growth in 2-3 years of work. 2  Operations managers are in the upper tier of business management and can expect to make $94,992 in a competitive field. Some opportunities include: 1  Retail assistant managers or key persons can expect to make an average weekly salary of about $228 to $320. 2  There is an expected job growth in the retail sales industry of about 11% through the year 2018 according to the Bureau of Labor Statistics."}, {"url": "http://www.answers.com/Q/How_much_money_does_an_entrepreneur_earn", "passage_text": "About 435,000 a year. Unless you own your own company you will get paid around in the 900,000k to millions. Some types of builders make up to 200+ dollars a day. by owning … your own business you will get around £900,000 a year. 27 people found this useful. Some entrepreneurs end up being some of the wealthiest people in the world. Take Bill Gates for instance. Yet on the other end, some are flat broke and end up in debt their entire lives. It's all about hard work, good decisions, and yes, even luck."}, {"url": "http://work.chron.com/much-entrepreneurs-make-30652.html", "passage_text": "Entrepreneurship is risky business, in part because you never know how much you’ll make. Even if your business pays you a salary, it still must earn enough to pay that salary or you’ll end up infusing personal funds or accruing personal debt to cover your own paycheck. An entrepreneur's earning potential depends in part on experience: the longer you stick with your business, the more chance you will have to build it to the point where it provides you with a sustainable income."}, {"url": "http://www.answers.com/Q/How_much_money_can_an_entrepreneur_make_a_year", "passage_text": "South Dakota had the lowest teacher salary at $34,039. 50,000 a year for first 5 years then ranges up to 65,000 How much money a teacher can make depends on their experience,  where they teach, and the state in which they teach. The average  salary is between $33,000 to $50,000. It all depends on where you live, actually. If you are a meteorologist in a small town, your salary would be nea … rs the 15,000's. I want to be a meteorologist when I grow up."}, {"url": "http://www.huffingtonpost.com/colleen-debaise/how-much-do-female-business_b_4159332.html", "passage_text": "Recent data suggest yes, it does. The Fall 2013 Small Business Monitor, a report from American Express OPEN, found that the average female entrepreneur's salary this year is $63,000, up from $60,000 a year. The report looks at a national sample of 1,038 U.S. small-business owners, male and female."}]