[{"url": "http://www.nature.com/gimo/contents/pt1/full/gimo13.html", "passage_text": "1 Esophageal peristalsis results from sequential contraction of circular muscle, which serves to push the ingested food bolus toward the stomach. 2  Esophageal longitudinal muscle may also play a role in peristalsis. The main function of the esophagus is to propel swallowed food or fluid into the stomach. This occurs through sequential or peristaltic contraction of circular muscle in the esophageal body, in concert with appropriately timed relaxation of the upper and lower esophageal sphincters."}, {"url": "http://www.answers.com/Q/What_push_food_down_into_the_stomach", "passage_text": "Your esophagus moves it so even when you eat upside down it will still go to your stomach. The series of muscle relaxations (infront of the bolus) and contractions (behind the … bolus) that moved food down the esophagus is called peristalsis. 1 person found this useful. "}, {"url": "https://answers.yahoo.com/question/index?qid=20090324194048AAtNUb3", "passage_text": "In the esophagus, two types of peristalsis occur: * First, there is a primary peristaltic wave; once the bolus enters the esophagus during swallowing. The primary peristaltic wave forces the bolus down the esophagus and into the stomach in a wave lasting about 8-9 seconds. In much of the gastrointestinal tract, smooth muscles contract in sequence to produce a peristaltic wave which forces a ball of food (called a bolus while in the esophagus and gastrointestinal tract and chyme in the stomach) along the gastrointestinal tract."}, {"url": "http://www.innerbody.com/image_dige01/dige03-new2.html", "passage_text": "The esophagus is about 9-10 inches (25 centimeters) long and less than an inch (2 centimeters) in diameter when relaxed. It is located just posterior to the trachea in the neck and thoracic regions of the body and passes through the esophageal hiatus of the diaphragm on its way to the stomach.... At the inferior end of the esophagus, the lower esophageal sphincter opens for the purpose of permitting food to pass from the esophagus into the stomach. Stomach acid and chyme (partially digested food) is normally prevented from entering the esophagus, thanks to the lower esophageal sphincter."}, {"url": "https://answers.yahoo.com/question/index?qid=20090324194048AAtNUb3", "passage_text": "Report Abuse. A) peristalsis the esophagus uses muscle contractions to push and move the food down the esophagus into the stomach if you have ever eaten something hard or swallowed something too large, and you feel the pain and pushing in your chest and throat, that is the esophagus muscles preforming peristalsis. In much of the gastrointestinal tract, smooth muscles contract in sequence to produce a peristaltic wave which forces a ball of food (called a bolus while in the esophagus and gastrointestinal tract and chyme in the stomach) along the gastrointestinal tract."}, {"url": "http://www.mandyparker.com/Digestive%20System%20And%20Poo.htm", "passage_text": "The esophagus (say: ih-sah-fuh-gus) is like a stretchy pipe that's about 10 inches (25 centimeters) long. It moves food from the back of your throat to your stomach. But also at the back of your throat is your windpipe, which allows air to come in and out of your body. to break down the food into a liquidy mixture. to slowly empty that liquidy mixture into the small intestine. The stomach is like a mixer, churning and mashing together all the small balls of food that came down the esophagus into smaller and smaller pieces."}, {"url": "http://www.theherbprof.com/InfoEsophagus.htm", "passage_text": "Hopefully that food had viable enzymes to mix with the enzymes supplied by the mouth. Pre-digestion in the Stomach After swallowing the food, it moves down the esophagus, which is 18 to 24 inches long. The esophagus moves through the warm core of the body and is responsible for warming the food to close to body temperature, which is ideally 98.6. In fact, the stomach will enlarge beyond the size of the meal until it is fully inflated. While the stomach is inflating to its full size which takes somewhere between 40 to 60 minutes, pre-digestion takes place. Pre-digestion, is the food sitting in the stomach being digested by the enzymes that came with it."}, {"url": "http://www.innerbody.com/image_dige01/dige03-new2.html", "passage_text": "The esophagus is a long, thin, and muscular tube that connects the pharynx (throat) to the stomach. It forms an important piece of the gastrointestinal tract and functions as the conduit for food and liquids that have been swallowed into the pharynx to reach the stomach. At the inferior end of the esophagus, the lower esophageal sphincter opens for the purpose of permitting food to pass from the esophagus into the stomach. Stomach acid and chyme (partially digested food) is normally prevented from entering the esophagus, thanks to the lower esophageal sphincter."}, {"url": "https://en.wikipedia.org/wiki/Peristalsis", "passage_text": "1 The primary peristaltic wave forces the bolus down the esophagus and into the stomach in a wave lasting about 8–9 seconds. 2  The wave travels down to the stomach even if the bolus of food descends at a greater rate than the wave itself, and continues even if for some reason the bolus gets stuck further up the esophagus. After food is chewed into a bolus, it is swallowed and moved through the esophagus. Smooth muscles contract behind the bolus to prevent it from being squeezed back into the mouth."}, {"url": "http://www.innerbody.com/image_dige01/dige03-new2.html", "passage_text": "The esophagus is involved in the processes of swallowing and peristalsis to move substances from the mouth to the stomach. The swallowing food begins in the mouth and continues with the contraction of skeletal muscles in the pharynx and esophagus. At the inferior end of the esophagus, the lower esophageal sphincter opens for the purpose of permitting food to pass from the esophagus into the stomach. Stomach acid and chyme (partially digested food) is normally prevented from entering the esophagus, thanks to the lower esophageal sphincter."}]