[{"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3813", "passage_text": "Human papillomavirus: HPV. A family of over 100 viruses including those which cause warts and are transmitted by contact. Some types of human papillomavirus are associated with tumors of the genital tract including, notably, cancer of the cervix. Of the more than 100 types of human papillomaviruses, over 30 types can be passed from one person to another through sexual contact. Most genital human papillomavirus infections come and go over the course of a few years. However, sometimes human papillomavirus infection may persist for many years, with or without causing cellular abnormalities. The majority of human papillomaviruses produce warts on the hands, fingers, and even the face."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3813", "passage_text": "Infection with human papillomavirus is also a risk factor for penile cancer (cancer of the penis). Some types of human papillomaviruses are referred to as low-risk viruses because they rarely cause cancer. Human papillomaviruses that are more likely to lead to the development of cancer are referred to as high-risk.. Most genital human papillomavirus infections come and go over the course of a few years. However, sometimes human papillomavirus infection may persist for many years, with or without causing cellular abnormalities. The majority of human papillomaviruses produce warts on the hands, fingers, and even the face."}, {"url": "http://medical-dictionary.thefreedictionary.com/Human+papilloma+virus+(HPV)", "passage_text": "human papillomavirus (HPV), a virus that is the cause of common warts of the hands and feet, as well as lesions of the mucous membranes of the oral, anal, and genital cavities. More than 50 types of HPV have been identified, some of which are associated with cancerous and precancerous conditions. DNA virus of the genus Papillomavirus; certain types cause cutaneous and genital warts in humans, including verruca vulgaris and condyloma acuminatum; other types are associated with severe cervical intraepithelial neoplasia and anogenital and laryngeal carcinomas."}, {"url": "http://www.merriam-webster.com/dictionary/human%20papillomavirus", "passage_text": ": any of numerous papillomaviruses (as of the genera Alphapapillomavirus, Betapapillomavirus, and Gammapapillomavirus) that cause various human papillomas (as genital warts and plantar warts) and include some associated with the production of human cancer —abbreviation HPV. "}, {"url": "http://medical-dictionary.thefreedictionary.com/human+papillomavirus", "passage_text": "papillomavirus. any member of a genus of viruses that cause papillomas in humans and various other animals. human papillomavirus any of numerous species that cause warts, particularly plantar and venereal warts, on the skin and mucous membranes in humans, transmitted by either direct or indirect contact. They have also been associated with cervical cancer. human papillomavirus (HPV), a virus that is the cause of common warts of the hands and feet, as well as lesions of the mucous membranes of the oral, anal, and genital cavities. More than 50 types of HPV have been identified, some of which are associated with cancerous and precancerous conditions"}, {"url": "https://en.wikipedia.org/wiki/Human_papillomavirus", "passage_text": "Human papillomavirus (HPV) is a DNA virus from the papillomavirus family that is capable of infecting humans. Like all papillomaviruses, HPVs establish productive infections only in keratinocytes of the skin or mucous membranes. Gardasil also protects against HPV types 6 and 11, which cause 90% of genital warts. Gardasil is a recombinant quadrivalent vaccine, whereas Cervarix is bivalent, and is prepared from virus-like particles (VLP) of the L1 capsid protein."}, {"url": "http://www.cdc.gov/hpv/parents/whatishpv.html", "passage_text": "HPV is short for human papillomavirus. HPV is a group of more than 150 related viruses. Each HPV virus in this large group is given a number which is called its HPV type. HPV is named for the warts (papillomas) some HPV types can cause. Some other HPV types can lead to cancer, especially cervical cancer. There are more than 40 HPV types that can infect the genital areas of males and females."}, {"url": "http://www.mayoclinic.org/tests-procedures/hpv-test/basics/definition/PRC-20015066", "passage_text": "Definition. The human papillomavirus (HPV) test detects the presence of human papillomavirus, a virus that can lead to the development of genital warts, abnormal cervical cells or cervical cancer. Your doctor might recommend the HPV test if:"}, {"url": "https://en.wikipedia.org/wiki/Human_papillomavirus", "passage_text": "HPV types 6 and 11 are the etiological cause genital warts. Persistent infection with high-risk HPV types—different from the ones that cause skin warts—may progress to precancerous lesions and invasive cancer. High-risk HPV infection is a cause of nearly all cases of cervical cancer. Gardasil also protects against HPV types 6 and 11, which cause 90% of genital warts. Gardasil is a recombinant quadrivalent vaccine, whereas Cervarix is bivalent, and is prepared from virus-like particles (VLP) of the L1 capsid protein."}]