[{"url": "https://en.wikipedia.org/wiki/Energy", "passage_text": "The portion of the energy which is transferred by conservative forces over a distance is measured as the work the source system does on the receiving system. The portion of the energy which does not do work doing during the transfer is called heat. Energy can be transferred between systems in a variety of ways. Examples include the transmission of electromagnetic energy via photons, physical collisions which transfer kinetic energy, and the conductive transfer of thermal energy. Energy is also transferred from potential energy () to kinetic energy () and then back to potential energy constantly. This is referred to as conservation of energy. In this closed system, energy cannot be created or destroyed; therefore, the initial energy and the final energy will be equal to each other."}, {"url": "http://www.ftexploring.com/energy/heatflow.htm", "passage_text": "Energy also flows out of your body into the surrounding air, into the surrounding objects, and even into outer space, most notably if you are outside on a clear night. This type of energy transfer from one place to another place is driven by differences in temperature and is called heat flow. Energy, in the process we call heat or heat flow, is constantly flowing into and out of all objects, including living objects. Heat flow moves energy from a higher temperature to a lower temperature. The bigger the difference in temperature between two objects, the faster heat flows between them."}, {"url": "https://en.wikipedia.org/wiki/Energy", "passage_text": "In physics, energy is a property of objects which can be transferred to other objects or converted into different forms, but cannot be created or destroyed. Energy is also transferred from potential energy () to kinetic energy () and then back to potential energy constantly. This is referred to as conservation of energy. In this closed system, energy cannot be created or destroyed; therefore, the initial energy and the final energy will be equal to each other."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20090403004740AA62iAq", "passage_text": "Heat is also known as Energy. Heat can be transferred between objects by radiation, conduction and convection. Temperature is used as a measure of the internal energy or enthalpy, that is the level of elementary motion giving rise to heat transfer. Heat can only be transferred between objects, or areas within an object, with different temperatures (as given by the zeroth law of thermodynamics)."}, {"url": "https://en.wikipedia.org/wiki/Thermal_equilibrium", "passage_text": "If the connection between the systems allows transfer of energy as heat but does not allow transfer of matter or transfer of energy as work, the two systems may reach thermal equilibrium without reaching thermodynamic equilibrium. Thermal equilibrium of a body in itself refers to the body when it is isolated. The background is that no heat enters or leaves it, and that it is allowed unlimited time to settle under its own intrinsic characteristics."}, {"url": "https://en.wikipedia.org/wiki/Thermal_equilibrium", "passage_text": "Thermal equilibrium is a relation between two bodies or closed systems, in which transfers are allowed only of energy and take place through a partition permeable to heat, and in which the transfers have proceeded till the states of the bodies cease to change. Thermal equilibrium of a body in itself refers to the body when it is isolated. The background is that no heat enters or leaves it, and that it is allowed unlimited time to settle under its own intrinsic characteristics."}, {"url": "https://en.wikipedia.org/wiki/Temperature", "passage_text": "When an energy transfer to or from a body is only as heat, state of the body changes. Depending on the surroundings and the walls separating them from the body, various changes are possible in the body. They include chemical reactions, increase of pressure, increase of temperature, and phase change. "}, {"url": "http://www.chem1.com/acad/webtext/pre/pre-3.html", "passage_text": "When two bodies are placed in thermal contact and energy flows from the warmer body to the cooler one,we call the process heat. A transfer of energy to or from a system by any means other than heat is called work. "}, {"url": "https://en.wikipedia.org/wiki/Heat", "passage_text": "In physics, heat is energy in a transfer between a system and its surroundings, other than as work or with the transfer of matter. In thermodynamics, finer detail of the process is unknowable. When there is a suitable physical pathway, heat flows from a hotter to a colder body. In statistical mechanics, for a closed system (no transfer of matter), heat is the energy transfer associated with a disordered, microscopic action on the system, associated with jumps in occupation numbers of the energy levels of the system, without change in the values of the energy levels themselves."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20090403004740AA62iAq", "passage_text": "Therefore, to change the energy of a system, energy must be transferred to or from the system. Heat and work are the only two mechanisms by which energy can be transferred to or from a control mass. Heat is the transfer of energy caused by the temperature difference. Temperature is used as a measure of the internal energy or enthalpy, that is the level of elementary motion giving rise to heat transfer. Heat can only be transferred between objects, or areas within an object, with different temperatures (as given by the zeroth law of thermodynamics)."}]