[{"url": "http://learn.org/articles/What_Does_an_Instrumentation_Technician_Do.html", "passage_text": "Instrumentation technicians monitor atmospheric and environmental changes in industrial areas and buildings. They use a variety of instruments and devices to record and report these changes. According to PayScale.com, the majority of instrumentation and controls technicians earned between $43,894 and $88,630 a year, as of January 2014."}, {"url": "http://learn.org/articles/What_Does_a_Medical_Instrument_Technician_Do.html", "passage_text": "While it is possible to train in the use of more than one type of medical instrument, all medical instrument technicians do not necessarily know how to operate and maintain a wide variety of instruments. Most job openings will require that you possess knowledge of a specific type of medical instrument. Job Duties. In general, as a medical instrument technician, you'll clean, maintain, and test medical instruments. You may also operate equipment while under the direction of a physician and perform a test or procedure. Your job will likely require frequent patient contact and you'll need to have excellent communication skills"}, {"url": "http://www.myoilandgascareer.com/role/instrument-technician", "passage_text": "Instrument Technicians carry out planned or unplanned maintenance and repair activities on a wide range of electronic equipment and process control and safety systems. Instrument Technician. Add to Favourites. Instrument Technicians carry out planned or unplanned maintenance and repair activities on a wide range of electronic equipment and process control and safety systems. Click here to view a case study of a"}, {"url": "http://www.insidejobs.com/careers/medical-instrument-technician", "passage_text": "A Medical Instrument Technician cleans, operates, maintains and tests the various pieces of medical equipment used in a hospital or clinic. In fact because there is so many different types of equipment, most Medical Instrument Technicians specialize in one specific area. Different areas of expertise come with different roles and work environments."}, {"url": "http://www.wisegeek.com/what-does-a-surgical-instrument-technician-do.htm", "passage_text": "The surgical instrument technician sterilizes and prepares instruments for use in surgeries. Surgical instrument techs are often responsible for sterilization and preparation of instruments and other areas of an operating room. A surgical instrument technician may be considered part of the surgical team. The required education for surgical instrument technicians in most facilities is a minimum of a two-year degree in an allied health program specializing in surgical or biomedical procedures."}, {"url": "https://en.wikipedia.org/wiki/Guitar_technician", "passage_text": "A guitar technician (or 'guitar tech') is a member of a music ensemble's road crew who maintains and sets up the musical equipment for one or more guitarists during a concert tour. Guitar techs learn their craft either on the job, by working in a range of music, sound engineering, and instrument repair jobs; by completing a guitar repair program at a college or lutherie school; or from a combination of these two routes."}, {"url": "http://learn.org/articles/What_Does_an_Instrumentation_Technician_Do.html", "passage_text": "Job Duties. As an instrumentation technician, you will test, calibrate, install, repair, and inspect monitoring devices. According to California's Employment Development Department, you'll also perform general maintenance on the equipment and design new measuring and recording equipment (www.edd.ca.gov). According to PayScale.com, the majority of instrumentation and controls technicians earned between $43,894 and $88,630 a year, as of January 2014."}, {"url": "http://learn.org/articles/What_Does_a_Medical_Instrument_Technician_Do.html", "passage_text": "Medical instrument technicians operate diagnostic, therapeutic, and surgical equipment. Read on to learn more about what you could do as a medical instrument technician. Schools offering Allied Health degrees can also be found in these popular choices. Job Duties. In general, as a medical instrument technician, you'll clean, maintain, and test medical instruments. You may also operate equipment while under the direction of a physician and perform a test or procedure. Your job will likely require frequent patient contact and you'll need to have excellent communication skill"}]