[{"url": "http://www.xe.com/currency/inr-indian-rupee", "passage_text": "INR-Indian Rupee. India, Rupee. The Indian Rupee is the currency of India. Our currency rankings show that the most popular India Rupee exchange rate is the INR to USD rate. The currency code for Rupees is INR, and the currency symbol is ₹. Below, you'll find Indian Rupee rates and a currency converter. The central bank in India is called the Reserve Bank of India. The INR is a managed float, allowing the market to determine the exchange rate. As such, intervention is used only to maintain low volatility in exchange rates. Early Coinage of India."}, {"url": "https://in.answers.yahoo.com/question/index?qid=1006010503322", "passage_text": "The Rupee (₨ or Rs.) is the common name for the currencies used in India, Pakistan, Sri Lanka, Nepal, Mauritius, and the Seychelles; in Indonesia the unit of currency is known as the rupiah and in the Maldives the rufiyah. The most commonly used symbol for the Rupee is Rs or ₨. The ISO 4217 code for the India Rupee is INR. In most parts of India, the Rupee is known as the Rupee, Rupaye, Rubai, or one of other terms derived from the Sanskrit rupya, meaning silver."}, {"url": "https://en.wikipedia.org/wiki/Indian_rupee", "passage_text": "The amount (and the word rupee) is, accordingly, written on the front of Indian banknotes in English and Hindi, whilst on the back the name is listed, in English alphabetical order, in 15 other Indian languages. The word rupee was derived from the Sanskrit word रूप्यकम् (rūpyakam). The modern Indian rupee has a direct lineage from the rupiya, the silver coin, issued by Sher Shah Suri (1540—1545), continued by the Mughal rulers."}, {"url": "https://en.wikipedia.org/wiki/Indian_rupee", "passage_text": "The modern rupee is subdivided into 100 paise (singular paisa), though as of 2011 only 50 paise coins are legal tender. Banknotes in circulation come in denominations of ₹ 1, ₹ 2, ₹ 5, ₹ 10, ₹ 20, ₹ 50, ₹ 100, ₹ 500 and ₹ 1000. The word rupee was derived from the Sanskrit word रूप्यकम् (rūpyakam). The modern Indian rupee has a direct lineage from the rupiya, the silver coin, issued by Sher Shah Suri (1540—1545), continued by the Mughal rulers."}, {"url": "https://simple.wikipedia.org/wiki/Indian_rupee", "passage_text": "The Indian rupee (Hindi: रुपया) (sign: ; code: INR) is the official currency of the Republic of India. The currency is issued and controlled by the Reserve Bank of India. The Indian rupee symbol () is an amalgam of both the Devanagari consonant  र  (Ra) and the Latin letter R without the vertical bar. The design was presented to the public by the government of India on 15 July 2010. The current abbreviation INR started in July 2010"}, {"url": "https://en.wikipedia.org/wiki/Rupee", "passage_text": "The issuance of the Indian currency is controlled by the Reserve Bank of India, whereas in Pakistan it is controlled by State Bank of Pakistan. The most commonly used symbol for the rupee is Rs. India adopted a new symbol (₹) for Indian rupees on 15 July 2010. In most parts of India, the rupee is known as rupaya, rupaye, or one of several other terms derived from the Sanskrit rupya, meaning silver. However, in the Bengali and Assamese languages, spoken in Assam, Tripura, and West Bengal, the rupee is known as a taka, and is written as such on Indian banknotes."}, {"url": "https://in.answers.yahoo.com/question/index?qid=1006010503322", "passage_text": "The Indian Rupee (Hindi: रूपया) is the official currency of India. The issuance of the currency is controlled by the Reserve Bank of India. The most commonly used symbol for the Rupee is Rs or ₨. The ISO 4217 code for the India Rupee is INR. In most parts of India, the Rupee is known as the Rupee, Rupaye, Rubai, or one of other terms derived from the Sanskrit rupya, meaning silver."}, {"url": "http://coinmill.com/INR_calculator.html", "passage_text": "Enter the amount to be converted in the box to the left of the currency and press the convert button. To show Indian Rupees and just one other currency click on any other currency. The Indian Rupee is the currency in India (IN, IND). The symbol for INR can be written Rs, IRs, and ₨. The Indian Rupee is divided into 100 paise. The exchange rate for the Indian Rupee was last updated on October 5, 2015 from The International Monetary Fund. The INR conversion factor has 6 significant digits. Large amounts of Rupees are expressed in lakh rupees or crore rupees. "}]