[{"url": "http://olivelifestyle.com/what-is-zaatar/", "passage_text": "Zaatar is a spice and herb blend from the middle east. You can find in all the houses around the middle east. Even here in Canada, every middle eastern person i know has a bag in their kitchen! It’s that important! Zaatar has an amazing and unique flavor that is aromatic, and tangy at the same time. In arabic, Zaatar means thyme; it is actually a blend of dried thyme, sesame seeds and sumac. And it is this combination that gives Zaatar its unique flavor."}, {"url": "http://www.freshbitesdaily.com/homemade-zaatar/", "passage_text": "The ingredient turned out to be sumac in a spice mix called zaatar. Zaatar is a mix of herbs along with a bit of salt and sesame seed. The mix can get tossed into olive oil and brushed on flat bread; you can also dip warm bread into olive oil and then into zaatar. The possibilities are endless for this great spice mix"}, {"url": "http://www.terra-rossa.com/extra-virgin-olive-oil/olive_oil_extra_virgin_zaatar.asp", "passage_text": "Eating Zaatar on bread helps you digest the heaviness of the bread and can prevent many digestive and allergic reactions related to bread. Herbalists say that Zaatar is a used to treat gastrointestinal disorders because it is a fantastic anti-fungal, anti-biotic, anti-septic, and anti-microbial agent. In addition to importing the Jordanian exquisite range of Zait (Arabic for extra virgin olive oil), Terra Rossa also offers you a unique mix called Zaatar. Thyme is 'Zaatar' in Arabic. Thyme is most popularly used as one of the main ingredients in the spice mix named after it-Zaatar."}, {"url": "http://olivelifestyle.com/what-is-zaatar/", "passage_text": "One of the most common ways to eat Zaatar is to have a ” Man’ouche” , a flat bread dough with zaatar and olive oil. Here’s how to do it the easy way! Use a pizza dough for the flat bread. Mix 2-3 tablespoons of Zaatar with olive oil till you get a rather liquid paste. Pour over the dough and cook in oven till crispy. It’s that important! Zaatar has an amazing and unique flavor that is aromatic, and tangy at the same time. In arabic, Zaatar means thyme; it is actually a blend of dried thyme, sesame seeds and sumac."}, {"url": "http://ic.steadyhealth.com/health-benefits-of-zaatar", "passage_text": "Origins and the use of zaatar / thyme. When talking about certain seeds that have beneficial effect on human health, the use of zaatar seeds is highly recommend. They are made from the sumac berries and sesame seed and consumed mostly for breakfast with yogurt, cheese, olive oil or flat bread. The other name for this seeds is thyme, which is more popular to us, while the name zaatar is used in the Middle Eastern areas, in countries like Jordan, Turkey, Syria, and Palestine. The use of these seeds includes breakfast with pita bread or making a salad with olive oil, vegetables, meat and vinegar. "}, {"url": "http://www.popsugar.com/food/What-Zaatar-7890113", "passage_text": "Follow us on Pinterest. Za'atar (pronounced zah-tar) is a Middle Eastern spice mix of thyme, sumac, toasted sesame seed, and sometimes wild oregano. Arabic for the word thyme, after the seasoning's predominant ingredient, za'atar has been used in Arabic countries since medieval times. Za'atar can also refer to an herb with notes of savory, thyme, and oregano; however, this herb is rarely exported. Source. Read More Za'atar Zaatar Spice Blends Middle Eastern Thyme Spices Definition. POPSUGAR, the #1 independent media and technology company for women."}, {"url": "http://www.popsugar.com/food/What-Zaatar-7890113", "passage_text": "this stuff is the crak cocaine of the spice world...it works with everything! My favourite is a scoop of hummus, some olive oil in the middle and sprinkle with za'atar...heat some pitta (or any) bread, and dip away mmmm middle-eastern staple! Za'atar can also refer to an herb with notes of savory, thyme, and oregano; however, this herb is rarely exported. Source. Read More Za'atar Zaatar Spice Blends Middle Eastern Thyme Spices Definition. POPSUGAR, the #1 independent media and technology company for women."}, {"url": "http://www.healthybenefitsof.com/p/zaatar.html", "passage_text": "Za'atar (Arabic, also romanized zaatar, za'tar, zatar, zatr, zattr, zahatar, zaktar or satar) is a generic name for a family of related Middle Eastern herbs from the genera Origanum (Oregano), Calamintha (Basil thyme), Thymus vulgaris (Thyme) and Satureja (Savory). "}, {"url": "http://www.terra-rossa.com/extra-virgin-olive-oil/olive_oil_extra_virgin_zaatar.asp", "passage_text": "Zaatar is traditionally eaten as part of a healthy breakfast and is ideal as an aperitif or hors d'oeuvre. A small piece of bread is first dipped into the olive oil and then into the thyme. Zaatar can also be used for cooking and is sprinkled over chicken, vegetables, salads and fish. In addition to importing the Jordanian exquisite range of Zait (Arabic for extra virgin olive oil), Terra Rossa also offers you a unique mix called Zaatar. Thyme is 'Zaatar' in Arabic. Thyme is most popularly used as one of the main ingredients in the spice mix named after it-Zaatar."}, {"url": "http://www.medicaldaily.com/zaatar-health-benefits-middle-eastern-spice-blend-fights-microbes-may-boost-brain-246726", "passage_text": "The Middle Eastern spice mix za’atar, which typically contains some combination of thyme, oregano, sumac, and sesame seeds, adds savory flavor to breads and other foods. © N. Saum, n.saum@yahoo.com.mx. "}]