[{"url": "https://en.wikipedia.org/wiki/Yam_(vegetable)", "passage_text": "Yams are monocots, related to lilies and grasses. Native to Africa and Asia, yam tubers vary in size from that of a small potato to over 60 kg (130 lb). There are over 600 varieties of yams and 95 percent of these crops are grown in Africa. Yam tubers can grow up to 1.5 meters (4.9 feet) in length and weigh up to 70 kilograms (154 lb) and 3 to 6 inches high. The vegetable has a rough skin which is difficult to peel, but which softens after heating."}, {"url": "https://en.wikipedia.org/wiki/Yam_(vegetable)", "passage_text": "There are many cultivars of yam. Although some varieties of sweet potato (Ipomoea batatas) are also called yam in parts of the United States and Canada, sweet potato is not part of the family Dioscoreaceae but belongs in the unrelated morning glory family Convolvulaceae. Yam tubers can grow up to 1.5 meters (4.9 feet) in length and weigh up to 70 kilograms (154 lb) and 3 to 6 inches high. The vegetable has a rough skin which is difficult to peel, but which softens after heating."}, {"url": "http://healthyeating.sfgate.com/measuring-starch-content-vegetables-1057.html", "passage_text": "Potatoes, Sweet Potatoes and Yams. Potatoes are considered a starchy vegetable or tuber because of their higher starch and carbohydrate content. The measured starch content of an average medium white baked potato is 25 grams. Similarly, each cup of yams provides 31 grams of starches. Starch is a type of carbohydrate made from long chains of glucose attached to one another. Grains and their flours as well as legumes and tubers have a very high starch content, while most vegetables have very little."}, {"url": "http://pubs.sciepub.com/jpbpc/2/1/1/", "passage_text": "Cush-cush yam (Dioscorea trifida), is a sub-utilized tropical crop, rich in starch, which grown in tropical areas. The exploitation of its starch has great potential. "}, {"url": "https://en.wikipedia.org/wiki/Starches", "passage_text": "Pure starch is a white, tasteless and odorless powder that is insoluble in cold water or alcohol. It consists of two types of molecules: the linear and helical amylose and the branched amylopectin. Depending on the plant, starch generally contains 20 to 25% amylose and 75 to 80% amylopectin by weight. Glycogen, the glucose store of animals, is a more branched version of amylopectin."}, {"url": "http://www.starch.dk/isi/starch/yam.asp", "passage_text": "Yams are the source of the chemical diosgenin, a precursor of progesterone, cortisone, and other medically important steroids. The collection of plants for the production of diosgenin is licensed in several parts of the world. The true yam is about 20 percent starch and as a food is very similar to a potato. True yams (Dioscorea spp., Dioscoreaceae) are the third most important tropical root crop after cassava (Manihot esculenta, Euphorbiaceae) and sweet potato (Ipomoea batatas, Convolvulaceae). The water yam is a species from south-eastern Asia that is commonly cultivated. The Chinese yam, or Chinese potato, also known as cinnamon vine, is cultivated as an ornamental climbing vine but is also an important food plant; its thick tubers reach a length of about 1 m (3 ft)."}, {"url": "http://www.fitday.com/fitness-articles/nutrition/healthy-eating/the-nutrition-of-yams.html", "passage_text": "The Nutrition of Yams. A yam is a vegetable which is similar to the sweet potato. Yams come from Africa, South America and the Mediterranean. Yams tend to be sweeter than the sweet potato and they provide various nutritional components. Yams are considered a super food because of their dense nutrients. "}, {"url": "http://healthyeating.sfgate.com/measuring-starch-content-vegetables-1057.html", "passage_text": "Potatoes are one of the vegetables with the highest starch content. Starch is a type of carbohydrate made from long chains of glucose attached to one another. Grains and their flours as well as legumes and tubers have a very high starch content, while most vegetables have very little."}, {"url": "https://answers.yahoo.com/question/index?qid=20090306154816AASc7nC", "passage_text": "Best Answer: From the articles below, it shows that Sweet potato's starch is generally made up of between 80 to 90% carbohydrates of the dry weight of sweet potato roots and Potatoes grown for starch manufacture may contain as much as 22% starch dry matter. About 75 per cent of the dry weight is carbohydrate. The sweet potato yields an important starch, which is used as a food starch in noodles etc. and technically for sizing textiles and papers, for the manufacture of adhesives and in laundries. The process of extracting and refining the starch is similar to the potato starch process. The pink and yellow varieties are rich in carotene, the precursor of vitamin A. Sweet potato starch granules vary from 4 to 40 microns with 19 micron in average. The amylose content is 19% - 25%"}]