[{"url": "https://answers.yahoo.com/question/index?qid=20090321180019AAR6NxS", "passage_text": "· just now. Report Abuse. Vascular plants includes ferns, horsetails, club mosses, and whisk ferns all of which produce spores but do not produce seeds. The vascular plants that produce seeds includes the gymnosperms and angiosperms. Gymnosperms includes cycads, ephedra, pines, spruce, firs, and other conifers. "}, {"url": "https://en.wikipedia.org/wiki/Vascular_plant", "passage_text": "Vascular plants (from Latin vasculum: duct), also known as tracheophytes (from the equivalent Greek term trachea) and also higher plants, form a large group of plants that are defined as those land plants that have lignified tissues (the xylem) for conducting water and minerals throughout the plant. Vascular plants are distinguished by two primary characteristics: 1  Vascular plants have vascular tissues which distribute resources through"}, {"url": "http://www.answers.com/Q/Do_all_plants_have_vascular_tissue_and_produce_seed", "passage_text": "Vascular Tissue Most seed plants live on land. Recall from Chapter 4 that land plants face many challenges, including standing upright and supplying all their cells with food … and water. Like ferns, seed plants meet these two challenges with vascular tissue. The thick walls of the cells in the vascular tissue help support the plants. In addition, food, water, and nutrients are transported throughout the plants in vascular tissue. There are two types of vascular tissue. Phloem (floh um) is the vascular tissue through which food moves. When food is made in the leaves, it enters the phloem and travels to other parts of the plant. "}, {"url": "http://faculty.fmcc.suny.edu/freeman/webpages/generalbio1/lab/PLANTSlab1of3.pdf", "passage_text": " Nonvascular plants which lack vascular tissue.  Seedless vascular plants which have vascular tissue but do not make seeds. Instead, they make spores that are carried by wind to a new habitat.  Seed plants which have vascular tissue and produce seeds. During this lab we will investigate the microanatomy of nonvascular and vascular plants (including both seedless and seed plants). In the following 2 labs, you will investigate the macro-anatomy of these organisms in the field"}, {"url": "https://answers.yahoo.com/question/index?qid=20080221232351AA2WPlx", "passage_text": "Mosses and liverworts have no vascular tissue which can be compared with vascular tissue of the plants mentioned above. So these are called 'Non-Vascular plants.' Algae and Fungi have no vascular tissue at all. Important note: Upright mosses like spaghnum. Funeria and polytrichum DO show conducting strands at the center of their 'stem' but those are NOT true vascular tissue!!!"}, {"url": "https://en.wikipedia.org/wiki/Vascular_plant", "passage_text": "1 Vascular plants have vascular tissues which distribute resources through the plant. 2  This feature allows vascular plants to evolve to a larger size than non-vascular plants, which lack these specialized conducting tissues and are therefore restricted to relatively small sizes. Vascular plants are distinguished by two primary characteristics: 1 "}, {"url": "http://faculty.college-prep.org/~bernie/sciproject/project/Kingdoms/Plantae3/non-vascular.htm", "passage_text": "General Information. Non-vascular plants are the simplest of all land dwelling plants. Their closest ancestor is the green algae, and like the green algae, they lack an internal means for transporting water. Also, non-vascular plants do not produce seeds or flowers. In terms of physical appearance, non-vascular plants typically only reach a height of one or two centimeters due to their lack of the woody tissue necessary for support on land. In addition, they are almost always found in damp, shady places."}, {"url": "https://answers.yahoo.com/question/index?qid=20080221232351AA2WPlx", "passage_text": "Best Answer: Size is not a criteria. Very small plants like Lemna and Wolffia have vascular tissue as they are flowering plants & a very large Kelp or seaweed has no vascular tissue as it is an alga. All flowering and seed bearing, fruit bearing plants,angiosperms have vascular tissue. All gymnosperms / conifers have vascular tissue. All ferns and relatives like lycopods and horse tails have vascular tissue, (All are collectively called Pteridophytes). So these are called 'Non-Vascular plants.' Algae and Fungi have no vascular tissue at all. Important note: Upright mosses like spaghnum. Funeria and polytrichum DO show conducting strands at the center of their 'stem' but those are NOT true vascular tissue!!!"}, {"url": "https://quizlet.com/20024783/plants-flash-cards/", "passage_text": "What type of leaves do gymnosperms have. needle-like or scalelike leaves.   . plants with cones, woody plants that produce seeds, but their seeds are not enclosed in fruits, vascular plants with no flowers or fruit; produce seeds in cones.   . Gymnosperms"}, {"url": "https://en.wikipedia.org/wiki/Vascular_plant", "passage_text": "Vascular plants include the clubmosses, horsetails, ferns, gymnosperms (including conifers) and angiosperms (flowering plants). Scientific names for the group include Tracheophyta and Tracheobionta. Vascular plants are distinguished by two primary characteristics: 1  Vascular plants have vascular tissues which distribute resources through the plant."}]