[{"url": "http://www.answers.com/Q/What_is_the_average_precipitation_in_the_Temperate_Deciduous_Forest", "passage_text": "1 Deciduous Forests Deciduous forests are those where broad-leaved trees grow. 2  The average temperature is 50 degrees and the average rainfall is 30 to 60 inches per year. 3  These forests are locat…. 4  Defining the Various Forms of Precipitation The water cycle produces many different kinds of precipitation. "}, {"url": "http://www.blueplanetbiomes.org/deciduous_forest.htm", "passage_text": "The average rainfall is 30-60 inches (75-150 cm) per year. You can find all four seasons: winter (cold and frosty), summer (hot and humid), fall (cool and breezy), and spring (warm and breezy). There is about a 6 month growing season. 2000 bibliography: Deciduous Forest. Plants Animals Climate Northeast Asian Deciduous Forest Deciduous forests can be found in the eastern half of North America, and the middle of Europe. There are many deciduous forests in Asia. Some of the major areas that they are in are southwest Russia, Japan, and eastern China."}, {"url": "http://www.mbgnet.net/sets/temp/whats.htm", "passage_text": "In the winter, precipitation (rainfall) is in the form of sleet, snow, and hail. The average rainfall is 30 to 60 inches per year. The average temperature of the forest is about 50 degrees Fahrenheit. "}, {"url": "http://www.answers.com/Q/What_is_the_average_rainfall_for_deciduous_forests", "passage_text": "1 The average temperature is 50 degrees and the average rainfall is 30 to 60 inches per year. 2  These forests are locat…. 3  Food Chain of the Eastern Deciduous Forest Animals The eastern deciduous forest of North America is found near the eastern part of the United States, and trails off in Southern Ontario, Canada. 1 However, major ho…. 2  Deciduous Forests Deciduous forests are those where broad-leaved trees grow. 3 "}, {"url": "http://www.answers.com/Q/What_is_the_average_rainfall_for_deciduous_forests", "passage_text": "1 Deciduous Forests Deciduous forests are those where broad-leaved trees grow. 2  The average temperature is 50 degrees and the average rainfall is 30 to 60 inches per year. 3  These forests are locat…. 1 However, major ho…. 2  Deciduous Forests Deciduous forests are those where broad-leaved trees grow. 3"}, {"url": "http://earthobservatory.nasa.gov/Experiments/Biome/biotemperate.php", "passage_text": "The temperature varies widely from season to season with cold winters and hot, wet summers. The average yearly temperature is about 10°C. The areas in which deciduous forests are located get about 750 to 1,500 mm of precipitation spread fairly evenly throughout the year. During the fall, trees change color and then lose their leaves. This is in preparation for the winter season."}, {"url": "http://www.answers.com/Q/What_is_the_average_rainfall_for_deciduous_forests", "passage_text": "1 It is hot and sunny with little rainfall. 2  However, major ho…. 3  Deciduous Forests Deciduous forests are those where broad-leaved trees grow. 4  The average temperature is 50 degrees and the average rainfall is 30 to 60 inches per year. 1 However, major ho…. 2  Deciduous Forests Deciduous forests are those where broad-leaved trees grow. 3"}, {"url": "http://kids.nceas.ucsb.edu/biomes/temperateforest.html", "passage_text": "If the Earth were not tilted on an axis, temperatures around the globe would always be the same. Temperate deciduous forests also have quite a wet environment. Following rainforests, temperate deciduous forests are the second-rainiest biome. The average yearly precipitation is 30 - 60 inches (75 - 150 cm). This precipitation falls throughout the year, but in the winter it falls as snow. The average temperature in temperate deciduous forests is 50°F (10°C). "}, {"url": "http://www.blueplanetbiomes.org/deciduous_forest.htm", "passage_text": "South America has two big areas of deciduous forests in southern Chile and Middle East coast of Paraguay. There are deciduous forests located in New Zealand, and southeastern Australia also. The average annual temperature in a deciduous forest is 50° F. The average rainfall is 30 to 60 inches a year. In deciduous forests there are five different zones. The first zone is the Tree Stratum zone. Plants Animals Climate Northeast Asian Deciduous Forest Deciduous forests can be found in the eastern half of North America, and the middle of Europe. There are many deciduous forests in Asia. Some of the major areas that they are in are southwest Russia, Japan, and eastern China."}, {"url": "http://ths.sps.lane.edu/biomes/deciduous3/deciduous3.html", "passage_text": "Location Deciduous biomes are located primarily in the eastern half of the United States, Canada, Europe, parts of Russia, China, and Japan. Climate The average temperature of the forest is about 50 degrees F. The average amount of rainfall in the forest is 30 to 60 inches a year. As the seasons change, so do the colors of the leaves of the deciduous. During the winter months water is generally not available to keep the leaves of some plants alive. "}]