[{"url": "https://sg.answers.yahoo.com/question/index?qid=20071001190220AAgIxGj", "passage_text": "I would say about $150 there are 2 bearing and a seal plus the time to clean all of the old grease out of the hub pack the bearings with new grease ... and put it back together ... the part cost me about 40 -50 $ and it only take about an hour.. Best Answer: I actually looked this up for you. You can go to a shop and get a menu price bearing repack for $69.99. The bearings without mark up, run $24.99 each including the races. That $69.99 maintenance repack will be thrown in to combination labor now. The labor is $69.99 ($29.99 during a maintenance brake job). Since you have a 4x4, that adds 2.0 hours labor"}, {"url": "https://answers.yahoo.com/question/index?qid=20111227114221AAOu4cm", "passage_text": "It would be helpful to know where you live. Front wheel bearings for your car in Northern KY cost $40 to $60 per bearing. Expect 4 to 6 hours to replace them both. Most shops around here charge $80 to $90 per hour for labor. So $500 would be a middle of the road estimate for Kentucky. Report Abuse. For the front of your 2005 Honda Civic, you will need two of the bearings located at http://mibearings.com/timken-products-c-... That will cost you just over $100. For labor, you are looking at 2-4 hours at $50-80/hr."}, {"url": "http://www.justanswer.com/car/0qy57-cost-replace-front-wheel.html", "passage_text": "How much should it cost to replace front wheel bearings on a 2005 Chevy Impala, parts and labor. "}, {"url": "http://repairpal.com/estimator/front-wheel-bearing-replacement-cost", "passage_text": "Labor: $194 - $246. Parts: $132 - $214. The average cost for a wheel bearing replacement-front is between $326 to $460. Labor costs are estimated between $194 to $246 while parts are priced between $132 to $214. Get a personalized estimate based on your location and specific car. Estimate does not include taxes and fees. "}, {"url": "http://www.justanswer.com/toyota/7jhg1-cost-fix-wheel-bearings-one-wheel.html", "passage_text": "How much should it cost to fix the wheel bearings on one wheel of a Toyota Camry Hybrid year 2009 - ballpark.. Submitted: 2 years ago via CarComplaints.com. The front bearing is 76 dollars. The hub is 142 dollars. The snap ring and axle nut would run around 25 dollars. The labor to replace the front bearing on average is 3 hours of labor. The actual dollar amount varies. a typical dealership hourly labor charge will be 100-120 dollars."}, {"url": "https://answers.yahoo.com/question/index?qid=20110222162732AAAEbFH", "passage_text": "Answers. Best Answer: Per MSN Autos An occasional problem on this vehicle is failure of either front Wheel Bearing and Hub Assembly. The cost to replace the Wheel Bearing and Hub Assembly on a 2 Wheel Drive (2WD) vehicle with independent suspension is $203.00 for parts and $59.00 for labor. The cost to replace the Wheel Bearing and Hub Assembly on a All Wheel Drive (AWD) vehicle with independent suspension is $284.00 for parts and $65.00 for labor. The cost to replace the Wheel Bearing and Hub Assembly on a vehicle without independent suspension is $293.00 for parts and $65.00 for labor. All prices are estimates based on $65.00 per flat rate hour and do not include diagnostic time or any applicable sales tax. Source(s): Google (got to love the facts)."}, {"url": "https://sg.answers.yahoo.com/question/index?qid=20071001190220AAgIxGj", "passage_text": "Some shops have a menu price on 4x4 serviceable wheel bearing repacks. You will spend about $100.00 in parts after they are marked up, shop supplies etc, and then roughly you can count on 2 hours labor at the shop's hourly rate. I would tend to agree this will run about $300.00. Best Answer: I actually looked this up for you. You can go to a shop and get a menu price bearing repack for $69.99. The bearings without mark up, run $24.99 each including the races. That $69.99 maintenance repack will be thrown in to combination labor now. The labor is $69.99 ($29.99 during a maintenance brake job). Since you have a 4x4, that adds 2.0 hours labor"}, {"url": "http://www.wheelbearingreplacement.net/Wheel-Bearing-Replacement-Cost.html", "passage_text": "The cost of wheel bearings vary based upon the type of vehicle. Prices also vary based on whether you are replacing a front or rear bearing. For a Toyota Corolla, a front wheel bearing costs approximately $47.99, while a rear wheel bearing is a staggering $325.99. Bearings for a Dodge Ram pickup are around $18.99 for rear bearings and $259.99 for front bearings."}]