[{"url": "http://www.answers.com/Q/What_is_the_plural_of_bacillus", "passage_text": "No, the word  its is a singular pronoun, the possessive form of it.   The plural form of the possessive pronoun its is theirs.   The plural form of the possessive … adjective its is their. Most likely intended as a variation of Bacillus stearothermophilus which is a Bacillus that can survive very high temperatures. However in the question, since b in the word ba … cillus is in a lower case, it may refer to any rod shaped bacteria and thermophilus implies heat tolerance."}, {"url": "http://www.jlindquist.net/generalmicro/102usage.html", "passage_text": "To refer to members of a given genus in the. sense, using Bacillus, Micrococcus and Mycobacterium as examples, one cannot change the genus name directly to a plural form. Bacilli, Micrococci and Mycobacteria would be improper. SINGULAR PLURAL medium media bacterium bacteria flagellum flagella bacillus bacilli coccus cocci genus genera species species inoculum inocula phenomenon phenomena criterion criteria. A strain may or may not be a typical representative of the species to which it may be assigned."}, {"url": "http://www.phonicsontheweb.com/plurals.php", "passage_text": "Phonics on the Web Plural Nouns. A noun is a type of word which refers to a person, place, or thing. Nouns can be conjugated in either singular or plural form. A singular noun refers to just one person, place, or thing (for example, a bat or a ship). A plural noun refers to multiple people, places, or things (for example, bats or ships). The majority of English count nouns are regular and predictable in the spelling of the plural form 1."}, {"url": "http://faculty.baruch.cuny.edu/gdalgish/eslgrammar/overall/plurals/plurals.htm", "passage_text": "Clicking on the menu choice Explanation results in the appearance of a small white box that explains the plural formation process for the particular singular/plural word selected. In the case of bacillus/bacilli, the explanation is that some singular nouns from Latin ending in us form the plural by changing the us to i. Clicking on the menu choice Definition results in the same white box, this time with the dictionary definition of the (Irregular or Double Plural) noun that has been selected. Once the student clicks on OK, the computer program gets to work and analyzes the noun jibberbob. First it checks to see if this is one of the Irregular or Double Plural nouns it knows; since these are irregular, the computer of course has a list and can make a match with the Irregular or Double Plural plural form."}, {"url": "https://en.wikipedia.org/wiki/Bacillus_(shape)", "passage_text": "Bacteria display a large diversity of cell morphologies and arrangements. A bacillus (plural bacilli) is a rod-shaped bacterium. Bacilli are found in many different taxonomic groups of bacteria. However, the name Bacillus, capitalized and italicized, refers to a specific genus of bacteria. The name Bacilli, capitalized but not italicized, can also refer to a less specific taxonomic group of bacteria that includes two orders, one of which contains the genus Bacillus."}, {"url": "http://www.merriam-webster.com/dictionary/bacillus", "passage_text": "Full Definition of BACILLUS. 1. : any of a genus (Bacillus) of rod-shaped gram-positive usually aerobic bacteria producing endospores and including many saprophytes and some parasites (as B. anthracis of anthrax); broadly: a straight rod-shaped bacterium. 2. : bacterium; especially: a disease-producing bacterium. Medical Definition of BACILLUS. 1. a capitalized: a genus of rod-shaped gram-positive endospore-producing usually aerobic bacteria of the family Bacillaceae that include many saprophytes and some parasites (as B. anthracis of anthrax) b: any bacterium of the genus Bacillus"}]