[{"url": "http://umm.edu/health/medical/altmed/condition/gout", "passage_text": "Gout is a type of arthritis that occurs when too much uric acid builds up in the body, causing crystals to form in joints, and joints to become inflamed and painful. The acid accumulates in tissues in the form of needle-like crystals that cause pain. Uric acid is formed when the body digests purines, compounds found in some foods and beverages, including dried beans, liver, wine, and beer."}, {"url": "http://www.niams.nih.gov/Health_Info/Gout/default.asp", "passage_text": "1 In this stage, a person has elevated levels of uric acid in the blood (hyperuricemia), but no other symptoms. 2  Treatment is usually not required. 3  Acute gout or acute gouty arthritis. 4  In this stage, hyperuricemia has caused the deposit of uric acid crystals in joint spaces. In fact, most people with hyperuricemia do not develop the disease. To confirm a diagnosis of gout, a doctor may insert a needle into an inflamed joint and draw a sample of synovial fluid, the substance that lubricates a joint. The joint fluid is placed on a slide and examined under a microscope for uric acid crystals."}, {"url": "http://www.medifastmedia.com/shared/docs/gout_guide.pdf", "passage_text": "Gout most commonly affects the joints of the big toe, but can occur elsewhere in the body, including the joints and surrounding areas of the foot, ankle, or knee. Gout is caused by an accumulation of uric acid crystals in the joints. Crystals can form when abnormally high levels of uric acid (hyperuricemia) are present in the body over an extended period of time.Mild hyperuricemia usually does no harm, and most people with hyperuricemia never develop gout. "}, {"url": "http://www.medscape.org/viewarticle/703290", "passage_text": "High levels of triglycerides and uric acid have each been reported to be independently associated with an elevated risk for coronary heart disease. However, it is less well established whether high levels or triglycerides or uric acid, per se, represent independent cardiovascular risk factors. Rather, both hypertriglyceridemia and hyperuricemia serve as biomarkers for increased coronary heart disease risk. Thus, although there is no direct relationship between hypertriglyceridemia and high uric acid levels, they are linked by a common denominator: a diet enriched in fructose."}, {"url": "http://www.nemechekconsultativemedicine.com/?p=1362", "passage_text": "For centuries, gout has been associated with obesity and overindulgence in alcohol. As I have discussed before, obesity is linked to development of insulin resistance which also causes elevated triglycerides, high blood pressure, diabetes, stroke, chronic kidney disease and heart attacks and elevated uric acid levels. "}, {"url": "http://www.niams.nih.gov/Health_Info/Gout/default.asp", "passage_text": "Gout is a painful condition that occurs when the bodily waste product uric acid is deposited as needle-like crystals in the joints and/or soft tissues. In the joints, these uric acid crystals cause inflammatory arthritis, which in turn leads to intermittent swelling, redness, heat, pain, and stiffness in the joints. In fact, most people with hyperuricemia do not develop the disease. To confirm a diagnosis of gout, a doctor may insert a needle into an inflamed joint and draw a sample of synovial fluid, the substance that lubricates a joint. The joint fluid is placed on a slide and examined under a microscope for uric acid crystals."}, {"url": "http://www.medscape.org/viewarticle/703290", "passage_text": "High uric acid levels raise the likelihood of a person having elevated triglyceride levels, visceral obesity (increased waist circumference), insulin resistance, hypertension, and low high-density lipoprotein cholesterol levels, all of which represent features of the metabolic syndrome. Thus, although there is no direct relationship between hypertriglyceridemia and high uric acid levels, they are linked by a common denominator: a diet enriched in fructose."}, {"url": "http://www.rheumatology.org/I-Am-A/Patient-Caregiver/Diseases-Conditions/Gout", "passage_text": "Over time, increased uric acid levels in the blood may lead to deposits of urate crystals in and around the joints. These crystals can attract white blood cells, leading to severe, painful gout attacks and chronic arthritis. Uric acid also can deposit in the urinary tract, causing kidney stones. 1 Patients may need medications to lower their elevated blood uric acid levels that predispose to gout. 2  The goal is a uric acid level less than 6 milligrams per deciliter (mg/dL). 3  There are two types of medicine for gout. 4  For control of acute attacks of joint pain, there are NSAIDs, colchicine and corticosteroids."}, {"url": "http://www.livestrong.com/article/490117-what-is-the-relation-between-high-levels-of-cholesterol-uric-acid/", "passage_text": "Hyperuricemia, an abnormally high level of uric acid in your body, can cause a type of kidney stone and exacerbate gout if excess uric acid forms painful crystals in joints. Researchers found that the association between high blood pressure and high uric acid in the blood was more evident in people with the highest HDL -- or good -- cholesterol levels. This led them to conclude that HDL cholesterol might modify uric acid in the blood, but more research is needed."}, {"url": "http://chemocare.com/chemotherapy/side-effects/hypertriglyceridemia-high-triglycerides.aspx", "passage_text": "1 Gemfibrozil-This medication will decrease cholesterol levels in your blood, and decrease the production of triglycerides from your liver. 2  Nicotinic acid-Also called niacin, this will decrease blood cholesterol and triglyceride levels in high doses. Any extra calories in your diet can be changed into triglycerides. These triglycerides may also be changed into cholesterol. The food that you consume in your diet is either used or stored. When you eat, the fat in your food is digested, and triglycerides are released into your bloodstream."}]