[{"url": "http://www.yr.no/place/India/Rajasthan/Jodhpur/statistics.html", "passage_text": "Max temperature: Average max daily (24h) temperature per month. Minimum temperature: Average minimum daily (24h) temperature per month. Average temperature: Average daily (24h) temperature per month. The temperature normals are measured in the period 1961–1990. The graph shows average amount of days (24h) with precipitation during a month. When precipitation has surpassed 1mm per day (24h) it is defined as a day with precipitation. The mean period is"}, {"url": "http://www.jodhpurindia.net/weather.html", "passage_text": "The weather of Jodhpur is quite hot. Here we tell you about weather and climatic conditions of Jodhpur in Rajasthan, India. Jodhpur: Jodhpur Weather. Jodhpur Climate is of an extreme type, with the variations in temperature range being very high. Weather in Jodhpur, Rajasthan is dry and hot, a typical desert weather. The average annual rainfall is approximately 32 cm. "}, {"url": "http://www.weather2travel.com/climate-guides/india/jodhpur.php", "passage_text": "The Jodhpur, India climate guide is perfect for planning your holiday. Monthly weather averages give the best indication of what the weather is usually like for every month of the year including figures for temperature, rainfall and sunshine. Travel deals & exclusive discounts on holidays, flights, hotels & more... We promise not to share your details. We help you find the best travel deals for your holiday in the sun by sharing tips on when and where to go, before providing you with top discounts."}, {"url": "http://www.mustseeindia.com/Jodhpur-weather", "passage_text": "Note: These are average maximum and average minimum temperature for Jodhpur. The highest temperature in Jodhpur for the month is usually higher than the average maximum temperature. Similarly, the lowest temperature in Jodhpur for the month is usually lower than the average minimum temperature. Best Season / Best time to visit Jodhpur. 1  Winter (October to February) is pleasant with mild cool atmosphere. 2  Temperature levels during winters range within 10°C to 24°C."}, {"url": "http://www.myweather2.com/City-Town/India/Jodhpur/climate-profile.aspx", "passage_text": "The terrain: upland plain (Deccan Plateau) in south, flat to rolling plain along the Ganges, deserts in west, Himalayas in north. For New Delhi in January the daily average maximum temperatures is 21°C with the average minimum 8°C, while in June the average maximum is 38°C with a minimum of 28°C. The wettest month for New Delhi is January with an average of 0.0mm of precipitation falling while the driest month is January with 0.0mm falling. The average monthly amount of precipitation has been recorded at around 9 mm, that's 0 inches. Throughout the month you can expect to see rain or drizzle falling on 1 days of the month. The average daily wind speed in October has been around 2 km/h, that’s the equivalent to about 1 mph, or 1 knots."}, {"url": "http://www.suncityjodhpur.com/climate-of-jodhpur-weather/", "passage_text": "Generally the climate of Jodhpur is hot, dry and sunny. The average temperature is around 33° C to 20° C. Minimum Temperature is 22° C (in Summer) and 10° C (in Winter). Maximum Temperature is 41° C (in Summer) and 36° C (in Winter). 1 SUMMER: Summer enters the city from March to June. 2  The summers of Jodhpur are harsh, sizzling and exhausting. 3  In summer season, the average maximum temperature is around 41° C and the average minimum temperature is around 26° C. 4  RAIN: There is rainy season from late July to September."}, {"url": "http://www.myweather2.com/City-Town/India/Jodhpur/climate-profile.aspx", "passage_text": "At night the average minimum temperature drops down to around 21°C, that's 69°F. In recent times the highest recorded temperature in October has been 42°C that's 107°F, with the lowest recorded temperature 13°C, about 55°F. The average monthly amount of precipitation has been recorded at around 9 mm, that's 0 inches. Throughout the month you can expect to see rain or drizzle falling on 1 days of the month. The average daily wind speed in October has been around 2 km/h, that’s the equivalent to about 1 mph, or 1 knots."}, {"url": "http://www.suncityjodhpur.com/climate-of-jodhpur-weather/", "passage_text": "1 The summers of Jodhpur are harsh, sizzling and exhausting. 2  In summer season, the average maximum temperature is around 41° C and the average minimum temperature is around 26° C. 3  RAIN: There is rainy season from late July to September. 1 SUMMER: Summer enters the city from March to June. 2  The summers of Jodhpur are harsh, sizzling and exhausting. 3  In summer season, the average maximum temperature is around 41° C and the average minimum temperature is around 26° C. 4  RAIN: There is rainy season from late July to September."}]