[{"url": "http://study.com/articles/Afterschool_Program_Director_Job_Description_Duties_and_Salary.html", "passage_text": "The U.S. Bureau of Labor Statistics (BLS) does not specifically list salary data for afterschool program directors. However, as of 2013, the median annual wage for educational administrators in preschools and child care centers/programs was $44,890. While afterschool program directors are not specifically listed, the BLS did report that the more general category of preschool and childcare center directors is expected to see a of 17% growth between 2012 and 2022."}, {"url": "http://www.payscale.com/research/US/Job=Education_Program_Director/Salary", "passage_text": "An Education Program Director earns an average salary of $56,033 per year. Experience has a moderate effect on pay for this job. "}, {"url": "http://www.indeed.com/q-After-School-Program-Director-jobs.html", "passage_text": "1 View all Children, Inc jobs in Covington, KY-Covington jobs. 2  Salary Search: After School Program Director salaries in Covington, KY. The Site Director is responsible for the direct supervision and safety of school age children in the after-school program...."}, {"url": "http://www.indeed.com/salary/q-After-School-Program-Director-l-New-York,-NY.html", "passage_text": "$66,000. Average After School Program Director salaries for job postings in New York, NY are 36% higher than average After School Program Director salaries for job postings nationwide."}, {"url": "http://www1.salary.com/Program-Director-salary.html", "passage_text": "For example the median expected annual pay for a typical Program Director (Non-Profit) in the United States is $97,437, so 50% of the people who perform the job of Program Director (Non-Profit) in the United States are expected to make less than $97,437. Source: HR Reported data as of October 2015. 1  Salary. 2  Salary + Bonus. This chart describes the expected percentage of people who perform the job of Program Director (Non-Profit) that make less than that salary. For example 50% of the people who perform the job of Program Director (Non-Profit) are expected to make less than the median"}, {"url": "http://www.salarylist.com/jobs/After-School-Program-Director-Salary.htm", "passage_text": "After School Program Director Salary. After School Program Director average salary is $50,238, median salary is $48,420 with a salary range from $42,168 to $61,942. After School Program Director salaries are collected from government agencies and companies. Each salary is associated with a real job position. After School Program Director salary statistics is not exclusive and is for reference only. They are presented as is and updated regularly."}, {"url": "http://www.jobs-salary.com/after-school-program-director-salary.htm", "passage_text": "A total of 3 real after school program director salary data listed. "}, {"url": "http://study.com/articles/Afterschool_Program_Director_Job_Description_Duties_and_Salary.html", "passage_text": "Job Description. An afterschool program director manages programs outside of school hours for children. The program may be sponsored by the school district, a church, or a nonprofit organization, but program directors generally work closely with day schools to provide an enriching and educationally sound experience. While afterschool program directors are not specifically listed, the BLS did report that the more general category of preschool and childcare center directors is expected to see a of 17% growth between 2012 and 2022."}, {"url": "http://www1.salary.com/Program-Director-salary.html", "passage_text": "The annual salary for someone with the job title Program Director (Non-Profit) may vary depending on a number of factors including industry, company size, location, years of experience and level of education. This chart describes the expected percentage of people who perform the job of Program Director (Non-Profit) that make less than that salary. For example 50% of the people who perform the job of Program Director (Non-Profit) are expected to make less than the median. Source: HR Reported data as of October 2015."}, {"url": "http://www.simplyhired.com/salaries-k-after-school-program-manager-jobs.html", "passage_text": "Average after school program manager salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term after school program manager anywhere in the job listing. The after school program manager salary comparisons feature allows job seekers to get the information required to make important career decisions and negotiate salary ranges."}]