[{"url": "https://answers.yahoo.com/question/index?qid=20090204063717AAiQL1j", "passage_text": "show more I have 2 new baby chinchillas which were born from an All white male, and a gray female. One of the babies is kind of a chocolate and white color and one is a mix between gray and white. I am hoping someone can help me identify what kind of mixture they are, and also help me price them to sell. Please let me know,..."}, {"url": "http://chinchillaexpert.com/care-articles/mating/baby-chinchilla-care/", "passage_text": "Gestation ranges between 106-118 days with the average being 111 days. Chinchillas are born fully furred and with eyes open. Delivery can last from a few minutes to a few hours. Wait 10-14 days after birth to dust the female and kits; any sooner can cause infection."}, {"url": "http://www.answers.com/Q/How_are_chinchillas_born", "passage_text": "Okay, well, the best place to get a chinchilla is from a breeder. Because if you get one from a pet store, they have to give their time to lots of other animals aswell as the … chinchillas, whereas from a breeder they dedicate most of their time towards the chinchillas. And they tend to last much longer"}, {"url": "http://chinchillacare.org/breeding-babies/", "passage_text": "Pregnancy & Babies. Chinchillas have a long pregnancy and the gestation period is around 110 days. Birth usually occurs in the morning and the babies, known as kits, are born a few minutes apart. The kits are born with their eyes open, covered in fur, and weigh around 2 ounces."}, {"url": "http://www.youtube.com/watch?v=EC7ZXHrHhvE", "passage_text": "The birth of a chinchilla is an extremely rare moment, and luckily I was able to capture it on video. This is our chinchilla, Mochi, giving birth to her second baby! Chinchillas are precocial, meaning that their babies are born with hair, eyes open, ears open, and are mobile. They will already be walking about and trying to nurse. A healthy kit normally weighs between 35 and 60 grams at birth."}, {"url": "http://chinchillachronicles.com/chinchilla_kits_babies.html", "passage_text": "Catching a Chinchilla. Chinchilla babies are known as 'kits'. A healthy chinchilla kit is born fully able with its eyes open, body covered in fur and all 20 teeth present. A newborn healthy chinchilla baby/kit weighs between 35-60 grams and reaches its full size within 18 - 24 months (although some kits will continue to develop until they are 3 - 4 years old)."}]