[{"url": "http://neuroscience.uth.tmc.edu/s3/chapter04.html", "passage_text": "Both of these structures—the basal ganglia and the cerebellum—are now known to have other functions in addition to modulating motor control. Because the most obvious clinical signs of damage to these areas are a wide variety of motor impairments, they are still generally considered to be motor structures."}, {"url": "http://www.definitions.net/definition/basal%20ganglia", "passage_text": "Basal ganglia. The basal ganglia are a group of nuclei of varied origin in the brains of vertebrates that act as a cohesive functional unit. They are situated at the base of the forebrain and are strongly connected with the cerebral cortex, thalamus and other brain areas."}, {"url": "http://neuroscience.uth.tmc.edu/s3/chapter04.html", "passage_text": "The basal ganglia comprise a distributed set of brain structures in the telencephalon, diencephalon, and mesencephalon (Figure 4.1 and Table 1). The forebrain structures include the caudate nucleus, the putamen, the nucleus accumbens (or ventral striatum) and the globus pallidus."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/001069.htm", "passage_text": "Symptoms. Damage to the basal ganglia cells may cause problems with one's ability to control speech, movement, and posture. This combination of symptoms is called parkinsonism. A person with basal ganglia dysfunction may have difficulty starting, stopping, or sustaining movement."}, {"url": "https://simple.wikipedia.org/wiki/Basal_ganglia", "passage_text": "The basal ganglia (or basal nuclei) are three areas under the cerebral cortex. They are part of the cerebrum (forebrain), and connected to the midbrain and the thalamus. They are vital to movement, and damage here results in damaged ability to move."}, {"url": "http://sifaka.cs.uiuc.edu/~yuelu2/opinionintegration/health/Basal_ganglia_dysfunction.html", "passage_text": "Basal ganglia dysfunction is a problem with the basal ganglia, the deep brain structures that help start and control movement. I understand that the basal ganglia is located deep in the brain and that it is not a place that is safe to venture into."}, {"url": "http://www.youtube.com/watch?v=Bjxus2-W7rY", "passage_text": "cerebral cortex, thalamus and other brain areas. The basal ganglia are. associated with a variety of functions, including voluntary motor control, procedural learning relating to routine behaviors or habits such as bruxism, eye movements, and cognitive, emotional functions."}, {"url": "https://www.nlm.nih.gov/medlineplus/ency/article/001069.htm", "passage_text": "Damage to the basal ganglia cells may cause problems with one's ability to control speech, movement, and posture. This combination of symptoms is called parkinsonism."}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=10030", "passage_text": "Basal ganglia: A region of the base of the brain that consists of three clusters of neurons (caudate nucleus, putamen, and globus pallidus) that are responsible for involuntary movements such as tremors, athetosis, and chorea."}]