[{"url": "http://www.medicineinanswers.com/is-kidney-disease-hereditary/", "passage_text": "The diseases of kidneys are divided into hereditary and acquired types. The hereditary diseases are genetically transmitted in the families, whereas the acquired diseases occur during life due to various environmental factors. These patients present with a family history of similar disease. Some of the common hereditary disorders are discussed below. 1. Cystic kidney diseases – these are characterized by formation of fluid filled cavities in the kidneys. When these cavities enlarge, they compress the adjacent normal kidney, resulting in loss of function and structure."}, {"url": "http://www.medicineinanswers.com/is-kidney-disease-hereditary/", "passage_text": "There are a variety of kidney diseases, ranging from relatively common to rare disorders. 1  Autosomal recessive polycystic kidney disease – this disease is encountered in infants and is associated with short life expectancy. 2  It is very uncommon. 3  Multiple small cysts are present throughout both kidneys. Some of the common hereditary disorders are discussed below. 1. Cystic kidney diseases – these are characterized by formation of fluid filled cavities in the kidneys. When these cavities enlarge, they compress the adjacent normal kidney, resulting in loss of function and structure."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/23334384", "passage_text": "Adenine phosphoribosyltransferase (APRT) deficiency, cystinuria, Dent disease, familial hypomagnesemia with hypercalciuria and nephrocalcinosis (FHHNC), and primary hyperoxaluria (PH) are rare but important causes of severe kidney stone disease and/or chronic kidney disease in children. "}, {"url": "http://ghr.nlm.nih.gov/condition/polycystic-kidney-disease", "passage_text": "Polycystic kidney disease also can be inherited in an autosomal recessive pattern. People with this form of the condition have two altered copies of the PKHD1 gene in each cell. The parents of a child with an autosomal recessive disorder are not affected but are carriers of one copy of the altered gene. Cysts may also develop in other organs, particularly the liver. Frequent complications of polycystic kidney disease include dangerously high blood pressure (hypertension), pain in the back or sides, blood in the urine (hematuria), recurrent urinary tract infections, kidney stones, and heart valve abnormalities."}, {"url": "http://www.mayoclinic.org/diseases-conditions/polycystic-kidney-disease/basics/causes/CON-20028831", "passage_text": "Abnormal genes cause polycystic kidney disease, and the genetic defects mean the disease runs in families. Rarely, a genetic mutation can be the cause of polycystic kidney disease. There are two types of polycystic kidney disease, caused by different genetic flaws: Autosomal dominant polycystic kidney disease (ADPKD). Signs and symptoms of ADPKD often develop between the ages of 30 and 40. In the past, this type was called adult polycystic kidney disease, but children can develop the disorder"}, {"url": "http://ghr.nlm.nih.gov/condition/polycystic-kidney-disease", "passage_text": "Polycystic kidney disease is a disorder that affects the kidneys and other organs. Clusters of fluid-filled sacs, called cysts, develop in the kidneys and interfere with their ability to filter waste products from the blood. The growth of cysts causes the kidneys to become enlarged and can lead to kidney failure. Cysts may also develop in other organs, particularly the liver. Frequent complications of polycystic kidney disease include dangerously high blood pressure (hypertension), pain in the back or sides, blood in the urine (hematuria), recurrent urinary tract infections, kidney stones, and heart valve abnormalities."}, {"url": "http://www.northshore.org/personalized-medicine/medical-genetics/hereditary-conditions/other-conditions/", "passage_text": "Kidney Disorders and Conditions. While most renal disorders are not hereditary, some kidney conditions have known inherited genetic components. Common hereditary kidney disorders include: 1  Autosomal Dominant Polycystic Kidney Disease, a generally late-onset condition that leads to progressive cyst development."}, {"url": "http://www.nationalkidneycenter.org/chronic-kidney-disease/causes/", "passage_text": "Inherited and Congenital Kidney Diseases. Some kidney diseases result from hereditary factors. Polycystic Kidney Disease (PKD), for example, is a genetic disorder in which many cysts grow in the kidneys. PKD cysts can slowly replace much of the mass of the kidneys, reducing kidney function and leading to kidney failure. "}, {"url": "http://www.wakehealth.edu/Nephrology/Inherited-Kidney-Disease.htm", "passage_text": "By Anthony Bleyer, MD. There are many different inherited kidney diseases. Often patients and doctors do not know the cause of an inherited kidney disease in their family. This webpage is intended to help patients identify the cause of kidney disease in their family. There are three things that are important to know about an inherited kidney disease: "}]