[{"url": "http://www.questdiagnostics.com/testcenter/TestDetail.action?ntc=402", "passage_text": "Clinical Significance. DHEA-S is the sulfated form of DHEA and is the major androgen produced by the adrenal glands. This test is used in the differential diagnosis of hirsute or virilized female patients and for the diagnosis of isolated premature adrenarche and adrenal tumors. About 10% of hirsute women with Polycystic Ovarian Syndrome (PCOS) have elevated DHEA-S but normal levels of other androgens. "}, {"url": "https://en.wikipedia.org/wiki/Immunoassay", "passage_text": "In immunology the particular macromolecule bound by an antibody is referred to as an antigen and the area on an antigen to which the antibody binds is called an epitope. In some cases an immunoassay may use an antigen to detect for the presence of antibodies, which recognize that antigen, in a solution. In other words, in some immunoassays, the analyte may be an antibody rather than an antigen. Such assays are called homogenous immunoassays or less frequently non-separation immunoassays. The use of a calibrator is often employed in immunoassays. Calibrators are solutions that are known to contain the analyte in question, and the concentration of that analyte is generally known."}, {"url": "http://www.gundersenhealth.org/gastroenterology/services-procedures/fecal-immunoassay-test", "passage_text": "FIT is a non-invasive colorectal cancer screening test that checks for blood in the stool. It is used to detect gastrointestinal bleeding associated with disorders such as colon cancer, polyps and colitis. If you decline a colonoscopy (the most effective method of screening for colon cancer), FIT is a reliable alternative that should be performed once a year."}, {"url": "https://clu-in.org/characterization/technologies/immunoassay.cfm", "passage_text": "Immunoassay is the oldest, most well-known, and widely used of these three field analytical technologies. Although, in general, clinical chemistry has used immunoassay for many years, the approach began to be used in the environmental field in the early 1990s, when test kits became commercially available. The amount of the enzyme conjugate that remains in the test tube is measured through the use of a colorimetric reaction. An enzyme substrate and a chromogen are added to the test tube to cause the formation of the color. That action also is a timed step, after which a solution is added to stop the formation of color."}, {"url": "https://en.wikipedia.org/wiki/Immunoassay", "passage_text": "An immunoassay is a biochemical test that measures the presence or concentration of a macromolecule in a solution through the use of an antibody or immunoglobulin. The macromolecule detected by the immunoassay is often referred to as an  analyte  and is in many cases a protein. Such assays are called homogenous immunoassays or less frequently non-separation immunoassays. The use of a calibrator is often employed in immunoassays. Calibrators are solutions that are known to contain the analyte in question, and the concentration of that analyte is generally known."}, {"url": "http://www.gundersenhealth.org/gastroenterology/services-procedures/fecal-immunoassay-test", "passage_text": "You will be asked to collect a single stool sample in the doctor's office or from the privacy of your home. If taken at home, the test kit has easy-to-follow instructions and a pre-addressed, postage-paid return mailer. The sample is sent to Gundersen Health System's Laboratory for analysis. It is used to detect gastrointestinal bleeding associated with disorders such as colon cancer, polyps and colitis. If you decline a colonoscopy (the most effective method of screening for colon cancer), FIT is a reliable alternative that should be performed once a year."}, {"url": "https://labtestsonline.org/understanding/analytes/fecal-occult-blood/tab/glance", "passage_text": "For the guiac-based FOBT (gFOBT), you will be instructed to avoid certain medications and follow certain dietary restrictions for several days before collecting the stool samples. For the fecal immunochemical test (FIT), there are no dietary or drug restrictions. "}, {"url": "http://www.surgeryencyclopedia.com/Fi-La/Immunoassay-Tests.html", "passage_text": "Definition. Immunoassays are chemical tests used to detect or quantify a specific substance, the analyte, in a blood or body fluid sample, using an immunological reaction. Immunoassays are highly sensitive and specific. High sensitivity is achieved by using an indicator system (e.g., enzyme label) that results in amplification of the measured product. Immunoassays may be qualitative (positive or negative) or quantitative (amount measured). An example of a qualitative assay is an immunoassay test for pregnancy. Pregnancy tests detect the presence of human chorionic gonadotropin (hCG) in urine or serum. Highly purified antibodies can detect pregnancy within two days of fertilization"}]