[{"url": "http://healthyliving.azcentral.com/muscles-side-plank-elbow-work-4709.html", "passage_text": "Secondary Muscles. The side plank also works several other muscles that provide additional stability as you hold the position. These muscles include the gluteus maximus, the quadriceps on the front of your thighs and the hamstrings on the back of your thighs."}, {"url": "http://healthyliving.azcentral.com/planking-work-out-2444.html", "passage_text": "Primary Muscles. The primary muscles the plank works are the erector spinae, the rectus abdomimus and the transverse abdominus. The erector spinae is a large muscle that runs up the length of the back. It surrounds your spine and allows you to straighten your back and rotate side to side. The plank is one of the simplest and most effective abdominal exercises. In its most basic form, you brace yourself at the top of a pushup while contracting your core muscles. You can do multiple variations of the plank to create more challenge and target different parts of the core."}, {"url": "http://www.answers.com/Q/What_muscle_does_the_plank_work", "passage_text": "Making the world better, one answer at a time. The traditional plank works out not only your abdominal area, but also your thighs and butt. :) A side plank does all that and works on the muscles in the arm supporting the plank."}, {"url": "http://www.yourworkoutbook.com/what-muscles-does-the-plank-work/", "passage_text": "If you’re interested in using your own body weight to get fit and functional, but don’t know exactly what muscles does the plank work, this article gives you a refreshing look at one of the best forms of exercise out there! From the Adductor Hallusic of the big toes to the traps, planks almost have no limits. In essence planking is the act of suspending the body above ground somehow and using the muscles (along with leverage) to fight against gravity. SEE ALSO: The Plank Exercise – What You Need to Know."}, {"url": "http://healthyliving.azcentral.com/muscles-side-plank-elbow-work-4709.html", "passage_text": "If you are not quite able to perform a side plank on the elbow with good form, you can modify the exercise to strengthen many of the same muscles. Instead of extending your legs, bend your knees so your forearm and the side of one knee support your body weight. The side plank also works several other muscles that provide additional stability as you hold the position. These muscles include the gluteus maximus, the quadriceps on the front of your thighs and the hamstrings on the back of your thighs."}, {"url": "http://healthyliving.azcentral.com/muscles-side-plank-elbow-work-4709.html", "passage_text": "An intermediate-level Pilates exercise, the side plank on the elbow requires you to support your body weight on your forearm and the side of one foot. Considerable core strength is needed to keep your hips from sinking toward the floor. The side plank also works several other muscles that provide additional stability as you hold the position. These muscles include the gluteus maximus, the quadriceps on the front of your thighs and the hamstrings on the back of your thighs."}, {"url": "http://www.shape.com/fitness/workouts/abs-workout-secret-formula-flat-stomach", "passage_text": "The plank is one of the best exercises for a flat, toned stomach because it works all the muscles in your core, including the rectus abdominus (the six-pack muscles you can see), transverse abdominus, internal and external obliques, hips, and back. "}, {"url": "http://www.livestrong.com/article/500440-what-does-the-plank-exercise-benefit/", "passage_text": "Plank exercises might provide mental benefits that improve your mood. Plank exercises stretch muscles that commonly stiffen throughout the day and contribute to stress. Sitting at your desk might tighten muscles along the back of your thighs when your legs remain bent for several hours. Plank exercises have aesthetic benefits that can enhance your appearance by improving posture. Planks activate core muscles, including the transverse abdominis and iliopsoas, which stabilize your spine and hips. Plank exercises help prevent or reverse postural deficiencies, including lordosis and posterior pelvic tilt."}, {"url": "http://www.livestrong.com/article/500440-what-does-the-plank-exercise-benefit/", "passage_text": "Planks also strengthen inner core muscles that support your joints. The rectus abdominis and transverse abdominis that form your outer and inner abdominal muscles, respectively, are primary supporters during plank exercises. The abdominal obliques also stabilize the plank position isometrically. Plank exercises have aesthetic benefits that can enhance your appearance by improving posture. Planks activate core muscles, including the transverse abdominis and iliopsoas, which stabilize your spine and hips. Plank exercises help prevent or reverse postural deficiencies, including lordosis and posterior pelvic tilt."}, {"url": "http://healthyliving.azcentral.com/muscles-side-plank-elbow-work-4709.html", "passage_text": "The side plank primarily works muscles in your core. It strengthens abdominal and back muscles, particularly the transversus abdominis, rectus abdominis, obliques and quadratus lumborum. It also targets the gluteus medius and gluteus minimus in the hips, as well as the adductor muscles located in the inner thigh. The side plank also works several other muscles that provide additional stability as you hold the position. These muscles include the gluteus maximus, the quadriceps on the front of your thighs and the hamstrings on the back of your thighs."}]