[{"url": "http://www.justjared.com/2014/12/28/mark-wahlberg-flashes-butt-to-wife-rhea-durham-in-the-ocean/", "passage_text": "Tweet. Mark Wahlberg goes shirtless while walking hand-in-hand with his bikini-clad wife Rhea Durham on the beach on Sunday afternoon (December 28) in Saint James, Barbados."}, {"url": "http://heavy.com/entertainment/2015/07/rhea-durham-mark-wahlbergs-wife-kids-married-to-photos-age-who-children/", "passage_text": "Share Tweet Share Email Follow. Rhea Durham, 37, is a former fashion model, but many know her as the beautiful wife of Mark Wahlberg. Durham has walked the runways at the Victoria's Secret fashion shows and has been on the covers of French Vogue, Marie Claire, and British and American ELLE Magazine."}, {"url": "http://www.eonline.com/news/610501/nip-slip-mark-wahlberg-s-wife-rhea-durham-flashes-boobs-and-butt-during-pda-filled-swim-in-barbados", "passage_text": "While on a family vacation in Barbados this week, Mark Wahlberg 's wife, Rhea Durham, accidentally flashed her bare breast while adjusting her bikini top during a day at the beach."}, {"url": "http://heavy.com/entertainment/2015/07/rhea-durham-mark-wahlbergs-wife-kids-married-to-photos-age-who-children/", "passage_text": "Rhea Durham, 37, is a former fashion model, but many know her as the beautiful wife of Mark Wahlberg."}, {"url": "http://www.imdb.com/name/nm1081113/news", "passage_text": "Mark Wahlberg and wife Rhea Durham on the Oscars' Red Carpet Mark Wahlberg and wife Rhea Durham at the Academy Awards Mark Wahlberg and wife Rhea Durham in a red-and-golden outfit are pictured above on the 2011 Academy Awards' Red Carpet, just outside the Kodak Theatre in Hollywood."}, {"url": "http://www.altfg.com/film/mark-wahlberg-wife/", "passage_text": "Mark Wahlberg and wife Rhea Durham at the Academy Awards. Mark Wahlberg and wife Rhea Durham in a red-and-golden outfit are pictured above on the 2011 Academy Awards' Red Carpet, just outside the Kodak Theatre in Hollywood. The Oscar ceremony was held on Sunday, Feb. 27."}, {"url": "http://www.usmagazine.com/celebrity-body/news/mark-wahlberg-wife-rhea-durham-pack-on-the-pda-in-mexico-photos-2015183", "passage_text": "Marky Mark! Mark Wahlberg channeled his past Calvin Klein days and stripped down to just his briefs while on vacation with his wife Rhea Durham in Cabo San Lucas, Mexico, on Tuesday, March 17. PHOTOS: Hot winter bikini bodies."}]