[{"url": "http://www.simplyhired.com/salaries-k-registered-nurse-l-naples-fl-jobs.html", "passage_text": "Average Registered Nurse Salaries. The average salary for registered nurse jobs in Naples, FL is $46,000. Average registered nurse salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term registered nurse anywhere in the job listing. "}, {"url": "http://www.salarylist.com/city/Naples-FL-Salary.htm", "passage_text": "Naples, FL Salary. Naples, FL average salary is $54,920, median salary is $46,592 with a salary range from $18,408 to $624,000. Naples, FL salaries are collected from government agencies and companies. Each salary is associated with a real job position. Naples, FL salary statistics is not exclusive and is for reference only."}, {"url": "http://www.bestplaces.net/economy/city/florida/naples", "passage_text": "The unemployment rate in Naples, Florida, is 4.90%, with job growth of 5.62%. Future job growth over the next ten years is predicted to be 46.30%. Naples, Florida Taxes. Naples, Florida,sales tax rate is 6.00%. Income tax is 0.00%. The income per capita is $83,798, which includes all adults and children. The median household income is $77,525"}, {"url": "http://www.deptofnumbers.com/income/florida/naples/", "passage_text": "The current median household income for Naples is $54,406. Nominal median household income peaked in 2008 at $61,165 and is now $6,759 (11.05%) lower. From a post peak low of $50,564 in 2011, nominal median household income for Naples has now grown by $3,842 (7.60%). The current median family income for Naples is $63,980. Real median family income peaked in 2008 at $79,408 and is now $15,428 (19.43%) lower. From a post peak low of $62,625 in 2011, real median family income for Naples has now grown by $1,355 (2.16%)."}, {"url": "http://www.deptofnumbers.com/income/florida/naples/", "passage_text": "The current median household income for Naples is $54,406. Real median household income peaked in 2008 at $66,175 and is now $11,769 (17.78%) lower. From a post peak low of $52,370 in 2011, real median household income for Naples has now grown by $2,036 (3.89%). The current median family income for Naples is $63,980. Real median family income peaked in 2008 at $79,408 and is now $15,428 (19.43%) lower. From a post peak low of $62,625 in 2011, real median family income for Naples has now grown by $1,355 (2.16%)."}, {"url": "http://www.deptofnumbers.com/income/florida/naples/", "passage_text": "Naples median household income is $8,370 higher than the median Florida household income and $2,156 greater than the US median household income. 2014 metro income data (including Naples median household income) will be released in September of 2015. The current median family income for Naples is $63,980. Real median family income peaked in 2008 at $79,408 and is now $15,428 (19.43%) lower. From a post peak low of $62,625 in 2011, real median family income for Naples has now grown by $1,355 (2.16%)."}, {"url": "http://www.deptofnumbers.com/income/florida/naples/", "passage_text": "Naples Family Income. The ACS 1-year data shows the median family income for Naples was $63,980 in 2013. Compared to the median Florida family income, Naples median family income is $8,206 higher. As with the median household income data, 2014 family income data for Naples will be released in September of 2015. The current median family income for Naples is $63,980. Real median family income peaked in 2008 at $79,408 and is now $15,428 (19.43%) lower. From a post peak low of $62,625 in 2011, real median family income for Naples has now grown by $1,355 (2.16%)."}, {"url": "http://www.point2homes.com/US/Neighborhood/FL/Naples-Demographics.html", "passage_text": "Disclaimer. Naples is an area in Naples, Collier County, Southwest, Florida with a population of 60,717. There are 28,535 male residents living in Naples and 32,184 female residents. The total number of households is 32,302 with 1.84 people per household on average. Total household expenditures in Naples are above the national average. "}, {"url": "http://www.usa.com/naples-fl-income-and-careers.htm", "passage_text": "As of 2008-2012, the per capita income of Naples is $83,798, which is much higher than the state average of $26,451 and is much higher than the national average of $28,051. Naples median household income is $77,525, which has grown by 18.10% since 2000. The median household income growth rate is lower than the state average rate of 21.87% and is lower than the national average rate of 26.32%."}]