[{"url": "http://www.ehow.com/about_5166858_much-electricity-average-home-use.html", "passage_text": "Typical Home Electricity Usage. The EIA reports that in 2007, the average American home used 936 kilowatt-hours of electricity each month. East North Central and East South Central states consumed the largest amounts of electricity at well above 250,000 kilowatt-hours a month. Rising costs of electricity by local utility agencies might also help to lower consumption levels. For example, in 1995, the average retail price of electricity per kilowatt-hour to an American home was 8.4 cents. As of March 2009, the average cost was 11.58 cents for each home"}, {"url": "http://www.eia.gov/tools/faqs/faq.cfm?id=97&t=3", "passage_text": "How much electricity does an American home use? In 2013, the average annual electricity consumption for a U.S. residential utility customer was 10,908 kilowatthours (kWh), an average of 909 kWh per month. Louisiana had the highest annual consumption at 15,270 kWh, and Hawaii had the lowest at 6,176 kWh. "}, {"url": "http://www.answers.com/Q/How_much_electricity_does_an_average_2-story_3-bedroom_house_use_per_day_per_month_or_per_year", "passage_text": "Answer by Noah Modie. Confidence votes 192. As an electrical engineer for a power company I see on average a house that is 1600-2000 square feet and having electric appliances except for the furnace use an average of 1500Kwatt-hours per month making 50 Kwatt-hours per day and a total of 18,000 Kwatt-hours per year. "}, {"url": "http://insideenergy.org/2014/05/22/using-energy-how-much-electricity-do-you-use-each-month/", "passage_text": "But there’s another value listed: how much energy you actually used. If you are a perfectly average American living in a perfectly average household, your monthly electricity bill will read 903 kilowatt hours (kWh), which costs $107, per household. But most of us don’t live in perfectly average households. Costs vary state-by-state, too. Hawaiians pay the most for electricity ($203 a month) and New Mexicans pay the least ($75 a month). As for our Inside Energy focus states: 1  Colorado homes use 706 kWh and spend $81 per month."}, {"url": "http://insideenergy.org/2014/05/22/using-energy-how-much-electricity-do-you-use-each-month/", "passage_text": "(The state that comes closest to matching the average monthly electricity usage is Ohio). Depending on whether a state is hot or cold, urban or rural, an average household can use as little as 531 kWh a month (Maine) or as much as 1,245 kWh (Louisiana). Costs vary state-by-state, too. Hawaiians pay the most for electricity ($203 a month) and New Mexicans pay the least ($75 a month). As for our Inside Energy focus states: 1  Colorado homes use 706 kWh and spend $81 per month."}, {"url": "http://www.green-energy-efficient-homes.com/average-electricity-consumption.html", "passage_text": "The average electricity consumption of a US family of four is in the neighborhood of 50 kWh per day, or 1,500 kWh per month. Similar figures apply for Canada. Assuming an average electricity cost of $0.12 per kWh, that translates into about $6 per day for electricity, or $180 per month. "}, {"url": "http://www.myfrugalmiser.com/2012/04/how-much-electricity-does-average-home.html", "passage_text": "In 2010, the average annual electricity consumption for a U.S. residential utility customer was 11,496 kWh, an average of 958 kilowatthours (kWh) per month. Tennessee had the highest annual consumption at 16,716 kWh and Maine the lowest at 6,252 kWh. Back in January I posted about my average utility bills. In 2011 I spent an average of $47 per month for electricity. This is the equivalent of about 275 kWh per month. For most of last year we were a family of two although the last couple of months there were three of us"}, {"url": "http://shrinkthatfootprint.com/average-household-electricity-consumption", "passage_text": "In the US typical household power consumption is about 11,700 kWh each year, in France it is 6,400 kWh, in the UK it is 4,600 kWh and in China around 1,300 kWh. The global average electricity consumption for households with electricity was roughly 3,500 kWh in 2010. Perhaps the most surprising thing in this chart is that the global average is as high as 3,500 kWh/year, given that the figures for India and China are so low. Two things explain this, household size and electrification rates. In China about 99% of people have electricity and average household size is around 3."}]