[{"url": "http://www.blueplanetbiomes.org/rnfrst_climate_page.htm", "passage_text": "In an average year in a tropical rain forest, the climate is very humid because of all the rainfall, which amounts to about 250 cm per year. The rain forest has lots of rain because it is very hot and wet. This climate is found near the equator. The f stands for sufficient precipitation for all months. The latitude range for rainforest climate is 15° to 25° North and South of the equator. The annual precipitation of a rain forest is greater than 150 cm. In only a month the rain forest receives 4 inches of rain. The rain forest is different from a lot of other climates"}, {"url": "http://earthobservatory.nasa.gov/Experiments/Biome/biorainforest.php", "passage_text": "There are two types of rainforests, tropical and temperate. Tropical rainforests are found closer to the equator where it is warm. Temperate rainforests are found near the cooler coastal areas further north or south of the equator. The tropical rainforest is a hot, moist biome where it rains all year long. It is known for its dense canopies of vegetation that form three different layers."}, {"url": "http://www.cotf.edu/ete/modules/msese/earthsysflr/rforest.html", "passage_text": "Tropical Rainforest The tropical rainforest is a hot, moist biome found near Earth's equator. The world's largest tropical rainforests are in South America, Africa, and Southeast Asia. Tropical rainforests receive from 60 to 160 inches of precipitation that is fairly evenly distributed throughout the year. "}, {"url": "http://ths.sps.lane.edu/biomes/rain3/rain3.html", "passage_text": "Tropical Rainforest Vegetation. Location and Climate of the Tropical Rainforest. Tropical rainforests cover about 6% of the Earth's total land surface. They are mainly located around the belt at the equator. The climate of the rainforest is warm most of the year and has a lot of rain through most of the year. The climate is perfect for animals and plant growth"}, {"url": "http://www.blueplanetbiomes.org/rainforest.htm", "passage_text": "**** Rainforests by Michael G. 2001 In an average year the climate in a tropical rain forest is very humid because of all the rainfall. A tropical rainforest gets about 150 cm of rain per year. It gets lots of rain because it is very hot and wet in rain forests. The hotter the air, the more water vapor it can hold. The water cycle repeats often along the equator. The main plants in this biome are trees. This is important because in the rain forest, some rain never gets past the trees and to the smaller plants and ground below. Trees in this climate reach a height of more than 164 feet."}, {"url": "http://www.blueplanetbiomes.org/rainforest.htm", "passage_text": "Southeast Asian Rainforests. The tropical rain forest is a forest of tall trees in a region of year-round warmth. An average of 50 to 260 inches (125 to 660 cm.) of rain falls yearly. Rain forests belong to the tropical wet climate group. The water cycle repeats often along the equator. The main plants in this biome are trees. This is important because in the rain forest, some rain never gets past the trees and to the smaller plants and ground below. Trees in this climate reach a height of more than 164 feet."}, {"url": "https://php.radford.edu/~swoodwar/biomes/?page_id=100", "passage_text": "Tropical Rainforest. Introduction: The tropical rainforest is earth’s most complex biome in terms of both structure and species diversity. It occurs under optimal growing conditions: abundant precipitation and year round warmth. There is no annual rhythm to the forest; rather each species has evolved its own flowering and fruiting seasons"}, {"url": "http://kids.nceas.ucsb.edu/biomes/rainforest.html", "passage_text": "LOCATION: There are two types of rainforest biomes: temperate and tropical rainforests. Temperate rainforests are found along coasts in temperate regions. The largest temperate rainforests are on the Pacific coast in North America, stretching from Alaska to Oregon. Other temperate rainforests are found along the coast of Chile, the United Kingdom, Norway, Japan, New Zealand, and S. Australia. "}]