[{"url": "https://en.wikipedia.org/wiki/Ethanol_fermentation", "passage_text": "Ethanol fermentation, also called alcoholic fermentation, is a biological process which converts sugars such as glucose, fructose, and sucrose into cellular energy, producing ethanol and carbon dioxide as a side-effect. Ethanol fermentation has many uses, including the production of alcoholic beverages, the production of ethanol fuel, and bread baking."}, {"url": "https://en.wikipedia.org/wiki/Cellular_respiration", "passage_text": "Without oxygen, pyruvate (pyruvic acid) is not metabolized by cellular respiration but undergoes a process of fermentation. The pyruvate is not transported into the mitochondrion, but remains in the cytoplasm, where it is converted to waste products that may be removed from the cell. The overall reaction occurs in a series of biochemical steps, most of which are redox reactions themselves. Although technically, cellular respiration is a combustion reaction, it clearly does not resemble one when it occurs in a living cell due to slow release of energy from the series of reactions."}, {"url": "https://en.wikipedia.org/wiki/Ethanol_fermentation", "passage_text": "In ethanol fermentation, one glucose molecule breaks down into two pyruvates (1). The energy from this exothermic reaction is used to bind inorganic phosphates to ADP and convert NAD+ to NADH. The two pyruvates are then broken down into two acetaldehydes and give off two CO2 as a waste product (2). Ethanol fermentation has many uses, including the production of alcoholic beverages, the production of ethanol fuel, and bread baking."}, {"url": "http://www.uzinggo.com/comparing-cellular-respiration-fermentation/cellular-energy-respiration/biology", "passage_text": "~ Fermentation and cellular respiration differ in that fermentation does not require oxygen while cellular respiration does. Fermentation and cellular respiration are also different because water molecules are not produced during fermentation but are produced during cellular respiration. All fermentation reactions occur in the cell's cytoplasm but during cellular respiration, only glycolysis occurs in the cytoplasm. ~ Fermentation and cellular respiration are alike in that they both begin with a series of reactions known as glycolysis, which breaks glucose molecules into smaller pyruvate molecules. They are also similar in that during both processes, ATP is produced for the cell to use."}, {"url": "https://en.wikipedia.org/wiki/Cellular_respiration", "passage_text": "The reactions involved in respiration are catabolic reactions, which break large molecules into smaller ones, releasing energy in the process, as weak so-called high-energy bonds are replaced by stronger bonds in the products. Respiration is one of the key ways a cell gains useful energy to fuel cellular activity. The overall reaction occurs in a series of biochemical steps, most of which are redox reactions themselves. Although technically, cellular respiration is a combustion reaction, it clearly does not resemble one when it occurs in a living cell due to slow release of energy from the series of reactions."}, {"url": "https://en.wikipedia.org/wiki/Ethanol_fermentation", "passage_text": "Because yeasts perform this conversion in the absence of oxygen, alcoholic fermentation is considered an anaerobic process. Ethanol fermentation has many uses, including the production of alcoholic beverages, the production of ethanol fuel, and bread baking."}, {"url": "https://en.wikipedia.org/wiki/Cellular_respiration", "passage_text": "Cellular respiration is the set of metabolic reactions and processes that take place in the cells of organisms to convert biochemical energy from nutrients into adenosine triphosphate (ATP), and then release waste products. The overall reaction occurs in a series of biochemical steps, most of which are redox reactions themselves. Although technically, cellular respiration is a combustion reaction, it clearly does not resemble one when it occurs in a living cell due to slow release of energy from the series of reactions."}, {"url": "http://classrooms.tacoma.k12.wa.us/wilson/dgunns/documents/download/cellular_respiration_and_fermentation.ppt?id=145381", "passage_text": "Respiration and Fermentation Process of converting glucose to a useable form of energy Respiration uses Oxygen and is very efficient Fermentation does not need Oxygen but is very inefficient ATP Adenosine Tri-phosphate A compound that “powers” the cell All cell parts need ATP to work properly Without ATP, the cell dies. "}, {"url": "http://www.differencebetween.net/science/nature/difference-between-cellular-respiration-and-fermentation/", "passage_text": "Cellular Respiration vs Fermentation. Respiration is a vital way for the cells of plants and animals to obtain and utilize energy. Without this energy, cells in the bodies of plants and animals would fail to function and will eventually break down and die. 5. ATP production in cellular respiration is slower than in fermentation. 6. The energy produced in fermentation can be used when energy production in cellular respiration slows down due to insufficient oxygen supply. 7."}]