[{"url": "http://www.loc.gov/law/help/citizenship/fourteenth_amendment_citizenship.php", "passage_text": "Citizenship is defined in the first clause of the first section of the Fourteenth Amendment as: All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and the State wherein they reside. The amendment's language was drafted by the Joint Committee on Reconstruction. In 1898 the Supreme Court in United States v. Wong Kim Ark, 169 U.S. 649, ruled that a child born in the United States to non-citizen parents was a United States citizen under the Fourteenth Amendment."}, {"url": "http://www.14thamendment.us/amendment/14th_amendment.html", "passage_text": "The fourteenth amendment to the Constitution of the United States was proposed to the legislatures of the several States by the Thirty-ninth Congress, on June 13, 1866. It was declared, in a certificate of the Secretary of State dated July 28, 1868 to have been ratified by the legislatures of 28 of the 37 States. No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws. Section 2."}, {"url": "http://www.archives.gov/exhibits/charters/constitution_amendments_11-27.html", "passage_text": "Note: Article I, section 2, of the Constitution was modified by section 2 of the 14th amendment. Section 1. All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. Note: Amendment 14, section 2, of the Constitution was modified by section 1 of the 26th amendment. Section 1. The right of citizens of the United States, who are eighteen years of age or older, to vote shall not be denied or abridged by the United States or by any State on account of age."}, {"url": "http://www.usconstitution.net/consttop_citi.html", "passage_text": "The 14th Amendment defines citizenship this way: All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside.. But even this does not get specific enough. "}, {"url": "http://constitutioncenter.org/interactive-constitution/amendments/amendment-xiv", "passage_text": "All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the State wherein they reside. Thus, under current law, there are two key limits on Congress’s power under Section Five of the Fourteenth Amendment, both of which are controversial. First, Section Five does not empower Congress to regulate private conduct, but only the actions of state and local governments."}, {"url": "https://en.wikipedia.org/wiki/Fourteenth_Amendment_to_the_United_States_Constitution", "passage_text": "The Fourteenth Amendment (Amendment XIV) to the United States Constitution was adopted on July 9, 1868, as one of the Reconstruction Amendments. The amendment addresses citizenship rights and equal protection of the laws, and was proposed in response to issues related to former slaves following the American Civil War. The court does not wish to hear argument on the question whether the provision in the Fourteenth Amendment to the Constitution, which forbids a State to deny to any person within its jurisdiction the equal protection of the laws, applies to these corporations."}, {"url": "http://birthers.org/USC/14.html", "passage_text": "The Fourteenth amendment states in Section 1, Section 1 - “All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the state wherein they reside. The second deals with prohibiting the states from passing laws denying the protection of citizenship from any citizen, “natural born” or naturalized. "}, {"url": "https://www.law.cornell.edu/constitution/amendmentxiv", "passage_text": "No state shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any state deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws. But neither the United States nor any state shall assume or pay any debt or obligation incurred in aid of insurrection or rebellion against the United States, or any claim for the loss or emancipation of any slave; but all such debts, obligations and claims shall be held illegal and void."}, {"url": "https://www.law.cornell.edu/constitution/amendmentxiv", "passage_text": "See more ... All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and of the state wherein they reside. But neither the United States nor any state shall assume or pay any debt or obligation incurred in aid of insurrection or rebellion against the United States, or any claim for the loss or emancipation of any slave; but all such debts, obligations and claims shall be held illegal and void."}, {"url": "http://www.14thamendment.us/birthright_citizenship/original_intent.html", "passage_text": "The 14th Amendment to the U.S. Constitution reads in part: All persons born or naturalized in the United States, and subject to the jurisdiction thereof, are citizens of the United States and the State wherein they reside.. To qualify children for birthright citizenship, based on the 14th Amendment, parents must owe direct and immediate allegiance to the U.S. and be completely subject to its jurisdiction. In other words, they must be United States citizens."}]