[{"url": "http://www.goodfoodworld.com/2013/08/quinoa-the-passion-and-the-politics/", "passage_text": "While quinoa is native to all countries in the Andean region, from Columbia to northern Argentina and southern Chile, quinoa produced for world markets comes primarily from Peru and Bolivia. "}, {"url": "http://www.discover-peru.org/native-crops-of-peru-quinoa/", "passage_text": "Quinoa field. . In theory quinoa is not a grain but it is used as a grain for its cooking attributes, it cooks like rice but requires a shorter cooking time. It is a species of goosefoot (Chenopodium) related to beets and spinach but grown primarily for its seeds. Quinoa is a crop that originated in the South American Andes of Peru and Bolivia and was domesticated by pre-Columbian civilizations more than 6,000 years ago. For the Inca civilization quinoa was a staple food, second in importance after the potato."}, {"url": "https://en.wikipedia.org/wiki/Quinoa", "passage_text": "Quinoa (/ˈkiːnoʊ.ə/ , from Quechua kinwa or kinuwa) is a species of the goosefoot genus (Chenopodium quinoa), a grain crop grown primarily for its edible seeds. It is a pseudocereal, similar in some respects to buckwheat, rather than a true cereal, as it is not a member of the true grass family. It is high in protein, and is tolerant of dry soil. The Food and Agricultural Organisation of the United Nations (FAO), declared 2013 to be the International Year of Quinoa."}, {"url": "http://www.care2.com/causes/global-demand-for-quinoa.html", "passage_text": "Quinoa has been called a ‘superfood’ for its near-perfect balance of proteins and all eight amino acids. It is not a grain, but a chenopod, related to beets and spinach. It is native to the Andes in Latin America where, for centuries, it has been a dietary staple of Bolivians. "}, {"url": "http://www.aihd.ku.edu/foods/quinoa.html", "passage_text": "By Jeremy Trombley. Quinoa (pronounced KEEN-wa or KEEN-o-ah) is a grain crop which is native to the Andean region of South America and has been cultivated for around five thousand years (Quinoa). Since it is not a grass, it is classified as a pseudo-cereal, but is used much like traditional cereal crops such as wheat and rice (Johnson). Nutritional Value. Quinoa is a remarkably nutritious food surpassing even rice in its nutrient value (Johnson). It contains approximately 4 to 8 grams of protein per 100 grams, with the full complement of essential amino acids, unlike corn, rice and wheat which must be supplemented with other foods"}, {"url": "https://en.wiktionary.org/wiki/quinoa", "passage_text": "Chenopodium quinoa Will, (quinoa) is native to the Andes, and the seeds are a staple grain in parts of South America. The newly formed Canadian Quinoa Association anticipated growing about 400 ha of quinoa annually (Anonymous 1992e). 1 A goosefoot, Chenopodium quinoa, native to the Andes and cultivated for its edible seeds. 2  1997, Derek B. Munro, Ernest Small, Vegetables of Canada, page 142,"}, {"url": "http://www.youtube.com/watch?v=6L218_jZspY", "passage_text": "Enjoy learning the native pronunciation of Quinoa. Quinoa is a new word used outside of its native orgins ~ South America. It is a Quechua (Inca) word and is a staple food for those from the Andean mountain region. 1  Howto & Style. 2  Standard YouTube License. "}, {"url": "http://www.discover-peru.org/native-crops-of-peru-quinoa/", "passage_text": "Native crops of Peru – Quinoa. Quinoa is a crop that originated in the South American Andes of Peru and Bolivia and was domesticated by pre-Columbian civilizations more than 6,000 years ago. For the Inca civilization quinoa was a staple food, second in importance after the potato."}, {"url": "http://www.newindianexpress.com/lifestyle/health/article542627.ece", "passage_text": "Quinoa is stocked with life-sustaining nutrients and the protein from quinoa contains all the eight essential amino acids. An ancient plant native to the Andes mountains in South America, quinoa has been around for over 5,000 years and is known to have been the staple food of the Incas. (Photo: Sheela Rani Chunkath). I am writing this article from Ithaca, where the famous Cornell University of USA is located. "}]