[{"url": "http://www.merriam-webster.com/dictionary/metaphor", "passage_text": ": a figure of speech in which a word or phrase literally denoting one kind of object or idea is used in place of another to suggest a likeness or analogy between them (as in drowning in money); broadly: figurative language — compare simile. 2. : an object, activity, or idea treated as a metaphor: symbol 2."}, {"url": "http://www.wisegeek.com/what-is-the-function-of-metaphor-in-literature.htm", "passage_text": "The function of metaphor in literature is twofold. The first, and more practical, function is to allow the reader greater understanding of the concept, object, or character being described. This is done by comparing it to an item that may be more familiar to the reader."}, {"url": "http://www.literarydevices.com/metaphor/", "passage_text": "Definition of Metaphor. A metaphor is a rhetorical figure of speech that compares two subjects without the use of “like” or “as.” Metaphor is often confused with simile, which compares two subjects by connecting them with “like” or “as” (for example: “She’s fit as a fiddle”)."}, {"url": "http://literarydevices.net/metaphor/", "passage_text": "Metaphor Definition. Metaphor is a figure of speech which makes an implicit, implied or hidden comparison between two things or objects that are poles apart from each other but have some characteristics common between them."}, {"url": "http://literarydevices.net/metaphor/", "passage_text": "Furthermore, a metaphor develops a comparison which is different from a simile i.e. we do not use “like” or “as” to develop a comparison in a metaphor. It actually makes an implicit or hidden comparison and not an explicit one."}, {"url": "http://www.lotsofessays.com/viewpaper/1683055.html", "passage_text": "Metaphors and Their Function. It is a commonplace of elementary-school studies that a metaphor is a figure of speech, an implied analogy in which one thing is imaginatively compared to or identified with another, dissimilar thing (Morner and Rausch 131)."}]