[{"url": "http://umm.edu/health/medical/ency/articles/autosomal-dominant", "passage_text": "Definition. Autosomal dominant is one of several ways that a trait or disorder can be passed down (inherited) through families. In an autosomal dominant disease, if you inherit the abnormal gene from only one parent, you can get the disease. Often, one of the parents may also have the disease. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=3105", "passage_text": "Dominant: A genetic trait is considered dominant if it is expressed in a person who has only one copy of that gene. (In genetic terms, a dominant trait is one that is phenotypically expressed in heterozygotes). A dominant trait is opposed to a recessive trait which is expressed only when two copies of the gene are present. (In genetic terms, a recessive trait is one that is phenotypically expressed only in homozygotes). Examples of dominant disorders include: 1  Achondroplasia (a common form of dwarfism with short arms and legs),"}, {"url": "http://hihg.med.miami.edu/thromboticstorm/genetics-overview/single-gene-disorders", "passage_text": "Single Gene Disorders. When a certain gene is known to cause a disease, we refer to it as a single gene disorder or a Mendelian disorder. For example, you may have heard of cystic fibrosis, sickle cell disease, Fragile X syndrome, muscular dystrophy, or Huntington disease. These are all examples of single gene disorders. There are some instances in which a person has the gene that causes the disorder and does not show symptoms of the disorder, but can still pass the gene to his or her children. A person who carriers a gene for an autosomal dominant disorder has a 50% chance of passing the gene to each child."}, {"url": "http://www.scienceclarified.com/Ga-He/Genetic-Disorders.html", "passage_text": "Genetic disorders can be classified according to the way in which they develop. If the disorder is transmitted by genes inherited from only one parent, it is said to be an autosomal dominant disorder. The term autosome applies to any of the 22 chromosomes that are identical in human males and females. Genetic disorders are conditions that have some origin in an individual's genetic make-up. Many of these disorders are inherited and are governed by the same genetic rules that determine dimples and red hair."}, {"url": "http://ghr.nlm.nih.gov/handbook/inheritance/inheritancepatterns", "passage_text": "One mutated copy of the gene in each cell is sufficient for a person to be affected by an autosomal dominant disorder. Each affected person usually has one affected parent (illustration). Autosomal dominant disorders tend to occur in every generation of an affected family. "}, {"url": "https://answers.yahoo.com/question/index?qid=20120205163827AAukVfo", "passage_text": "Best Answer: An example of a Recessive Disorder would be cystic fibrosis, and colorblindness. As for a Dominant Disorder, it would be polydactyly, muscular dystrophy, and huntingtons disease. If you were to read a punnet square, the recessive disorder would represented by two lowercase letters. "}, {"url": "http://ghr.nlm.nih.gov/glossary%3dautosomaldominant", "passage_text": "Autosomal dominance is a pattern of inheritance characteristic of some genetic diseases. Autosomal means that the gene in question is located on one of the numbered, or non-sex, chromosomes. Dominant means that a single copy of the disease-associated mutation is enough to cause the disease. This is in contrast to a recessive disorder, where two copies of the mutation are needed to cause the disease. Huntington's disease is a common example of an autosomal dominant genetic disorder. "}, {"url": "https://en.wikipedia.org/wiki/Genetic_disorder", "passage_text": "A genetic disorder is a genetic problem caused by one or more abnormalities in the genome, especially a condition that is present from birth (congenital). Most genetic disorders are quite rare and affect one person in every several thousands or millions. Only one mutated copy of the gene will be necessary for a person to be affected by an autosomal dominant disorder. Each affected person usually has one affected parent. The chance a child will inherit the mutated gene is 50%."}, {"url": "http://www.scienceclarified.com/Ga-He/Genetic-Disorders.html", "passage_text": "Dominant genetic disorders. If one parent has an autosomal dominant disorder, then offspring have a 50 percent chance of inheriting that disease. Approximately 2,000 autosomal dominant disorders (ADDs) have been identified. These disorders have effects that range from inconvenience to death. Genetic disorders are conditions that have some origin in an individual's genetic make-up. Many of these disorders are inherited and are governed by the same genetic rules that determine dimples and red hair."}]