[{"url": "http://www.worldatlas.com/webimage/countrys/asia/bh.htm", "passage_text": "Print this map. Located just off the eastern coastline of Saudi Arabia in the Persian Gulf, Bahrain is a small archipelago of 33 islands, with the largest island being Bahrain Island. Modern causeways connect the four main islands, and all are connected to Saudi Arabia by the 16-mile-long King Fahd Causeway. "}, {"url": "http://www.clickbahrain.com/bahrain-facts-information", "passage_text": "BAHRAIN GENERAL INFORMATION. Introduction Bahrain's small size and central location among Persian Gulf countries require it to play a delicate balancing act in foreign affairs among its larger neighbors. "}, {"url": "http://www.nationsencyclopedia.com/economies/Asia-and-the-Pacific/Bahrain.html", "passage_text": "LOCATION AND SIZE. Bahrain is the smallest country and the only island-state in the Persian Gulf and the wider Middle East. It covers an area of 620 square kilometers (385 square miles), about 3.5 times the size of Washington, D.C. Bahrain consists of 33 islands, of which only 3 are inhabited. The capital, Manama, is on the main island of Bahrain, which contains most of the population and is linked to Saudi Arabia by a causeway. A southern portion of the main island is a restricted zone where the U.S. Middle East Operations Force is based"}, {"url": "https://en.wikipedia.org/wiki/Bahraini_dinar", "passage_text": "The dinar (Arabic: دينار Dīnār Baḥrainī ‎) (sign : .د.ب or BD; code: BHD) is the currency of Bahrain. It is divided into 1000 fils (فلس). The name dinar derives from the Roman denarius. The dinar was introduced in 1965, replacing the Gulf rupee at a rate of 10 rupees = 1 dinar. The Bahraini dinar is abbreviated .د.ب (Arabic) or BD (Latin)"}, {"url": "http://us.exchangecurrency.biz/currencies/bhd", "passage_text": "Bahrain dinar. The dinar is the currency of Bahrain. It is divided into 1000 fils. The name dinar derives from the Roman denarius. The dinar was introduced in 1965, replacing the Gulf rupee at a rate of 10 rupees = 1 dinar. The Bahraini dinar is abbreviated BD). In 1965, The Bahrain Currency Board introduced notes in denominations of 100 fils, ¼, ½, 1, 5 and 10 dinar. In 1973, the Bahrain Monetary Agency took over production of paper money, issuing notes for ½, 1, 5, 10 and 20 dinar."}, {"url": "http://www.nationsonline.org/oneworld/bahrain.htm", "passage_text": "Home Earth Continents Asia Bahrain. A virtual travel guide to Bahrain an island nation in the Middle East, the archipelago consists of the main island Al Bahrayn and some small islands and islets. The island state is situated in the Arabian Gulf, east of Saudi Arabia. With an area of 741 sq km Bahrain is slightly bigger than Singapore (699 sq km), or 3.5 times the size of Washington, DC. Read on to get an overview of Bahrain's art, culture, people, environment, geography, history, economy and government."}, {"url": "https://en.wikipedia.org/wiki/Bahrain", "passage_text": "Saudi Arabia lies to the west and is connected to Bahrain by the King Fahd Causeway while Iran lies 200 km (124 mi) to the north across the Persian Gulf. The peninsula of Qatar is to the southeast across the Gulf of Bahrain. The population in 2010 stood at 1,234,571, including 666,172 non-nationals. Bahrain is the site of the ancient land of the Dilmun civilisation. Bahrain was one of the earliest areas to convert to Islam in 628 AD. Following a period of Arab rule, Bahrain was occupied by the Portuguese in 1521, who in turn were expelled in 1602 by Shah Abbas I of the Safavid dynasty under the Persian Empire."}, {"url": "http://www.infoplease.com/country/bahrain.html", "passage_text": "Geography. Bahrain, which means “two seas,” is an archipelago in the Persian Gulf off the coast of Saudi Arabia. The islands for the most part are level expanses of sand and rock. A causeway connects Bahrain to Saudi Arabia. Constitutional monarchy. "}]