[{"url": "https://en.wikipedia.org/wiki/Fillmore_East", "passage_text": "It was open from March 8, 1968 to June 27, 1971 and featured some of the biggest acts in rock music at the time. The Fillmore East was a companion to Graham's Fillmore Auditorium, and its successor, the Fillmore West, in San Francisco, Graham's home base."}, {"url": "https://en.wikipedia.org/wiki/At_Fillmore_East", "passage_text": "At Fillmore East was released in July 1971 by Capricorn Records as a double album, but reduced to the cost of a single LP. Atlantic and Atco initially rejected the idea of issuing a double album, with Jerry Wexler feeling it ridiculous to preserve all these jams.."}, {"url": "https://en.wikipedia.org/wiki/At_Fillmore_East", "passage_text": "At Fillmore East is the first live album by American rock band the Allman Brothers Band, and their third release overall."}, {"url": "http://www.fillmore-east.com/", "passage_text": "This site is dedicated to the memory and excitement that was the Fillmore East Auditorium in New York City. Though only in existence for a short three years, the Fillmore almost single-handedly started the careers of what would become some of the biggest bands in the world."}, {"url": "http://www.allmusic.com/album/at-fillmore-east-mw0000649823", "passage_text": "Share this page. Whereas most great live rock albums are about energy, At Fillmore East is like a great live jazz session, where the pleasure comes from the musicians' interaction and playing."}, {"url": "https://www.nytimes.com/store/fillmore-east-1971-nsap65p.html", "passage_text": "Details. The Fillmore East lights up its marquee for the last time, June 1971. The framed concert hall was open for only three years, but it launched the careers of many top rock musicians. Photo by Bob Glass / The New York Times Photo Archives."}, {"url": "https://en.wikipedia.org/wiki/At_Fillmore_East", "passage_text": "At Fillmore East showcases the band's eclectic mixture of blues, Rock, country, and jazz.  Fusion is a term that came later, but if you wanted to look at a fusion album, it would be Fillmore East. Here was a rock 'n' roll band playing blues in the jazz vernacular. And they tore the place up, said Dowd."}]