[{"url": "http://lfsva.org/foster-care-faqs/", "passage_text": "Many foster parents grow close to the children in their care. It can be difficult when they leave. Foster parents can and do adopt children that come into their lives through the foster care system when it is not possible for the child to return home or be placed with a relative. "}, {"url": "http://www.childtrends.org/wp-content/uploads/2013/04/Foster-Care-Payment-Rate-Report.pdf", "passage_text": "The rates are guidelines for private agencies’ payments to foster parents, though some may actually pay different rates. Florida $14.10 ‐ $16.93 not available Medical: $16.57 Emergency: Family Shelter: $13.74 ‐ $14.86 (1) Rates are guidelines, not absolute limits or requirements. West Virginia $19.73 not available (See Notes) Specialized Foster Family (private agency): At least $19.73 Special Family Care (private agency): At least $19.73 (1) DHHR foster homes receive $600/mo, and this is also what the private agencies must pay the specialized homes at a minimum."}, {"url": "http://facesofvirginia.org/index.php/foster-families-v15-200091/359-10-financial-considerations-foster-parents-in-virginia-should-know", "passage_text": "1. Foster parents receive a payment to cover some of the costs associated with caring for children from the foster care system. If the child is IV-e eligible, then the payment is comprised of state and federal funds. If the child is not IV-e eligible, then the payment is comprised of state and local funds."}, {"url": "http://www.childtrends.org/wp-content/uploads/2013/04/Foster-Care-Payment-Rate-Report.pdf", "passage_text": "This is a 1 year stipend, and will end June 30, 2013. DHHS Agency Supported Foster Care (1) DHHS pays “tiered” rate to contractor based on the FC Pay points for an individual child (see table) (2) July 1, 2012, per statute, foster parents received an increase in reimbursement of $3.10 per day, per child. West Virginia $19.73 not available (See Notes) Specialized Foster Family (private agency): At least $19.73 Special Family Care (private agency): At least $19.73 (1) DHHR foster homes receive $600/mo, and this is also what the private agencies must pay the specialized homes at a minimum."}, {"url": "http://bostonparentspaper.com/article/wanted-foster-parents.html", "passage_text": "Foster parents do not pay. Foster care subsidies are available for children in state custody. Although there are exceptions, intensive foster care parents receive daily stipends of $50, and regular foster parents receive about $20-$25 daily. Quarterly clothing funds (from $185 - $282), medical and dental insurance coverage, and financial help for birthdays and holidays are also provided. ﻿Federal and state statistics put the number of Massachusetts children in foster care at 9,650 compared with about 400,000 children nationwide. Local kids in need of foster care, up to age 22, are in the custody of the state Department of Children and Families (DCF) and Department of Youth Services."}, {"url": "http://www.childtrends.org/wp-content/uploads/2013/04/Foster-Care-Payment-Rate-Report.pdf", "passage_text": "Minimum is the max allowable for level 2 foster care, with ceiling of $2,500/month. (Exceptions with Director’s approval) Treatment/Therapeutic Foster Care: $19.50 ‐ $20.70 Emergency Foster Home: $11.03 ‐ $12.23 Treatment/therapeutic foster care does not include behavioral health costs. West Virginia $19.73 not available (See Notes) Specialized Foster Family (private agency): At least $19.73 Special Family Care (private agency): At least $19.73 (1) DHHR foster homes receive $600/mo, and this is also what the private agencies must pay the specialized homes at a minimum."}, {"url": "http://www.simplyhired.com/salaries-k-therapeutic-foster-care-jobs.html", "passage_text": "Average Therapeutic Foster Care Salaries. The average salary for therapeutic foster care jobs is $31,000. Average therapeutic foster care salaries can vary greatly due to company, location, industry, experience and benefits. This salary was calculated using the average salary for all jobs with the term therapeutic foster care anywhere in the job listing. "}, {"url": "http://www.childtrends.org/wp-content/uploads/2013/04/Foster-Care-Payment-Rate-Report.pdf", "passage_text": "A tiered system determines the amount of special board payment that is allowed for any type of foster home. Maine $16.50 46% Level B: $26.25 Level C – TFC: $39.38 Level D – TFC: $52.50 Level E – TFC: $65.62 Medical – TFC: $60.00 (1) Rates do not include daily clothing allowance. West Virginia $19.73 not available (See Notes) Specialized Foster Family (private agency): At least $19.73 Special Family Care (private agency): At least $19.73 (1) DHHR foster homes receive $600/mo, and this is also what the private agencies must pay the specialized homes at a minimum."}, {"url": "https://answers.yahoo.com/question/index?qid=20080202231031AA7iwF2", "passage_text": "Don't know, but I do know that they receive a greater reimbursement than a regular foster parent. A foster parent provides food, shelter, and clothing. They are also reimbursed for things like gas, electricity, etc. This amount is just rounded up, it's not like a regular reimbursement where you have to provide receipts, etc. In my state, it's about $800 - $900 a month, depending on the child's needs. "}]