[{"url": "http://geography.about.com/od/historyofgeography/a/ageexploration.htm", "passage_text": "Though the Age of Exploration officially ended in the 17th century, it is important to note however that the exploration did not cease entirely at this time. Eastern Australia was not discovered until 1770 and the Arctic and Antarctic areas were not heavily explored until the 19th century. Many nations were looking for goods such as silver and gold but one of the biggest reasons for exploration was the desire to find a new route for the spice and silk trades. When the Ottoman Empire took control of Constantinople in 1453, it blocked European access to the area, severely limiting trade."}, {"url": "http://loc.gov/rr/hispanic/portam/role.html", "passage_text": "Portugal, the western-most European country, was one of the primary players in the European Age of Discovery and Exploration. Under the leadership of Prince Henry the Navigator, Portugal took the principal role during most of the fifteenth century in searching for a route to Asia by sailing south around Africa. In the last decade of the fifteenth century, Christopher Columbus set out on a westerly course across the Atlantic Ocean searching for an alternative route to the Indies but inadvertently discovered a new continent. Although neither Portuguese-born nor sponsored, Columbus was Portuguese trained."}, {"url": "http://www.sheppardsoftware.com/Europeweb/factfile/Unique-facts-Europe7.htm", "passage_text": "The so-called Age of Exploration was a period from the early 15th century and continuing into the early 17th century, during which European ships were traveled around the world to search for new trading routes and partners to feed burgeoning capitalism in Europe. The Age of Exploration was rooted in new technologies and ideas growing out of the Renaissance, these included advances in cartography, navigation, and shipbuilding."}, {"url": "https://en.wikipedia.org/wiki/Age_of_Discovery", "passage_text": "The Age of Discovery is an informal and loosely defined European historical period from the 15th century to the 18th century, marking the time in which extensive overseas exploration emerged as a powerful factor in European culture. It was the period in which global exploration started with the Portuguese discovery of the Atlantic archipelago of the Azores, the western coast of Africa, and discovery of the ocean route to the East in 1498, and the trans-Atlantic Ocean discovery of the Americas on behalf of the Crown of Castile (Spain) in 1492."}, {"url": "http://www.mysocialstudiesclass.com/AGEOFEXPLORATION.pdf", "passage_text": "THE AGE OF EXPLORATION 1492-1650 BACKGROUND MOTIVATION Economic and political motives. Long before the sixteenth century the Crusades had introduced European people to the goods and luxuries of the East. Some goods, such as spices, became necessities, but they were becoming increasingly costly. "}, {"url": "http://www.ducksters.com/history/renaissance/age_of_exploration_and_discovery.php", "passage_text": "The Age of Exploration (also called the Age of Discovery) began in the 1400s and continued through the 1600s. It was a period of time when the European nations began exploring the world. They discovered new routes to India, much of the Far East, and the Americas. The Age of Exploration took place at the same time as the Renaissance. The Age of Exploration was one of the most important times in the history of world geography. A significant portion of the unknown world was mapped during this short period. Also, many advances were made in navigation and mapping which helped future explorers and travelers."}, {"url": "http://www.softschools.com/timelines/age_of_exploration_timeline/348/", "passage_text": "His voyage opens the Americas to later European explorers. May 4, 1493 The Line of Demarcation divides the world between Spain and Portugal. Spain and Portugal press rival claims to the lands Columbus explores, and in 1493 Pope Alexander VI steps in to keep the peace. He sets a Line of Demarcation, which divides the non-European world into two zones."}, {"url": "http://www.u-s-history.com/pages/h1031.html", "passage_text": "Despite the common belief that Christopher Columbus was the first European discover of the New World, it is far more likely that Leif (or Leiv) Erikson (or Eriksson or Ericson) sailed west from Greenland around the year 1000 and landed somewhere in present-day Canada, probably the coast of Labrador. Off-site search results for European Exploration and Settlement in the New World... Age of Exploration in the Americas-Exploring the New World. ... began the Age of Exploration, England, France and Spain dominated"}, {"url": "http://www.sheppardsoftware.com/Europeweb/factfile/Unique-facts-Europe7.htm", "passage_text": "In the process, Europeans encountered peoples and mapped lands previously unknown to them. Among the most famous explorers of the period were Christopher Columbus, Vasco da Gama, Pedro Álvares álvares, Cabral John, Cabot Juan ponce De, leon León And. ferdinand magellan The Age of Exploration was rooted in new technologies and ideas growing out of the Renaissance, these included advances in cartography, navigation, and shipbuilding."}]