[{"url": "http://www.answers.com/Q/Where_did_the_first_Battle_of_Bull_Run_take_place", "passage_text": "It took place on the same ground as the First Battle of Bull Run. The battles took place around the city of Manassas, which is in Prince William County, Virginia. These battl … es are also known as the First and Second Manassas."}, {"url": "http://totallyhistory.com/first-battle-of-bull-run/", "passage_text": "The first big land battle of the American Civil War took place near Manassas in Prince William County in Virginia on July 21, 1861. This episode is called the First Battle of Bull Run and is also known as First Manassas, the latter being the name the Confederates used."}, {"url": "http://www.history.com/topics/american-civil-war/first-battle-of-bull-run", "passage_text": "Introduction. On July 21, 1861, Union and Confederate armies clashed near Manassas Junction, Virginia, in the first major land battle of the American Civil War."}, {"url": "http://kms.kapalama.ksbe.edu/projects/2002/civilwar/battle02/historian.html", "passage_text": "On a bright Sunday morning on July 21, 1861, the first real major battle in the Civil War occurred between the North, and South. This famous battle was known as the First Bull Run which took place in Manassas, Virginia."}, {"url": "http://www.answers.com/Q/What_state_did_the_battle_bull_run_take_place_in", "passage_text": "It took place on the same ground as the First Battle of Bull Run. The battles took place around the city of Manassas, which is in Prince William County, Virginia. These battl … es are also known as the First and Second Manassas."}, {"url": "https://answers.yahoo.com/question/index?qid=1006051812544", "passage_text": "Best Answer: The First Battle of Bull Run, also known as the First Battle of Manassas, took place on July 21, 1861, and was the first major land battle of the American Civil War. Green Union Army troops under Brigadier General Irvin McDowell advanced against the Confederate Army under Brig."}, {"url": "http://www.answers.com/Q/Where_did_the_first_Battle_of_Bull_Run_take_place", "passage_text": "The First Battle of Bull Run (Manassas) took place on July 21st 1861. The Second Battle of Bull Run took place on August 29th-30th 1862. Both were Confederate victories."}]