[{"url": "http://www.whereig.com/cambodia/", "passage_text": "The given Cambodia location map shows that Cambodia is located in the southeast part of Asia. Cambodia map also depicts that it shares its international boundaries with Thailand in the west and northwest, Laos in the northeast, and Vietnam in the east."}, {"url": "https://en.wikipedia.org/wiki/Cambodia", "passage_text": "Cambodia (/kaemˈboʊdiə/ ; Kæmˈboʊdiə: khmer , កម្ពុជា, [kampuchea]), kɑmˈpuˈciə officially known as The kingdom Of (Cambodia: khmer , ព្រះរាជាណាចក្រកម្ពុជា Preăh Reacheanachak) réachéanachâk kampŭchea kâmpŭchéa and once Known As, the khmer empire is a country located in the southern Portion Of the Indochina Peninsula. in southeast asia "}, {"url": "http://www.mapsofworld.com/cambodia/", "passage_text": "Geography : Cambodia is located in the tropics of Southeast Asia, on the southern Indochina Peninsula, with coastline along the Gulf of Thailand in the southwest. The terrain of Cambodia features forested lowlands and mountains including the Dangrek Mountain range, the Kravanh Mountains, and the Damrei Mountains. Cambodia is bordered by Thailand to the northwest, Laos to the northeast, Vietnam to the east, and the Gulf of Thailand to the southwest. Print. History of Cambodia. One of the prominent early cultures of Cambodia were the Khmer people, with the Funan Kingdom around the first century."}, {"url": "http://www.nationsencyclopedia.com/economies/Asia-and-the-Pacific/Cambodia.html", "passage_text": "LOCATION AND SIZE. Cambodia is one of the ten nations of Southeast Asia and part of mainland Southeast Asia. It is bordered on the north by Laos and Thailand, on the west by Thailand, and on the east by Vietnam. Its geographic area is 181,040 square kilometers (69,900 square miles), making it slightly smaller than the state of Oklahoma."}, {"url": "http://www.gomapper.com/travel/where-is/cambodia-located.html", "passage_text": "Cambodia is a country with a small population which is located in the continent/region of Asia. Countries near Cambodia include Vietnam, Thailand, Laos and Malaysia. "}, {"url": "http://geology.com/world/cambodia-satellite-image.shtml", "passage_text": "Cambodia is located in southeastern Asia. Cambodia is bordered by the Gulf of Thailand to the southwest, Vietnam to the east, Laos to the north, and Thailand to the northwest. Laos, Thailand, Vietnam. "}, {"url": "http://wanttoknowit.com/where-is-cambodia-located/", "passage_text": "Cambodia is located on the Asian continent, specifically in the southern portion of the Indochina Peninsula in South-East Asia. It shares borders with Thailand (to the northwest), Laos (northeast), Vietnam (east) and the southwestern portion of the country is bordered by the Gulf of Thailand. "}, {"url": "http://www.mapsofworld.com/cambodia/", "passage_text": "Officially known as the Kingdom of Cambodia, the country is located in the southern portion of Indochina Peninsula in Southeast Asia. Cambodia is bordered by Thailand to the northwest, Laos to the northeast, Vietnam to the east, and the Gulf of Thailand to the southwest. Print. History of Cambodia. One of the prominent early cultures of Cambodia were the Khmer people, with the Funan Kingdom around the first century."}, {"url": "http://www.worldatlas.com/webimage/countrys/asia/kh.htm", "passage_text": "Cambodia Description. Located in the southern portion of the Indochina Peninsula in southeast Asia, the Kingdom of Cambodia can trace its history back to Neolithic times, when it was first inhabited around 2000 BC."}, {"url": "http://cambodiangecko.com/map-of-cambodia/", "passage_text": "Search for: Cambodia is located in the Indochina peninsula and is bordered by Thailand to the West, Thailand and Laos to the North, Vietnam to the East, and the Gulf of Thailand to the South. "}]