[{"url": "http://electronics.howstuffworks.com/speaker6.htm", "passage_text": "Making Sound: Magnets. When the electrical current flowing through the voice coil changes direction, the coil's polar orientation reverses. This changes the magnetic forces between the voice coil and the permanent magnet, moving the coil and attached diaphragm back and forth. In this way, the alternating current constantly reverses the magnetic forces between the voice coil and the permanent magnet. This pushes the coil back and forth rapidly, like a piston. When the coil moves, it pushes and pulls on the speaker cone."}, {"url": "http://electronics.howstuffworks.com/speaker6.htm", "passage_text": "The electromagnet is positioned in a constant magnetic field created by a permanent magnet. These two magnets -- the electromagnet and the permanent magnet -- interact with each other as any two magnets do. In this way, the alternating current constantly reverses the magnetic forces between the voice coil and the permanent magnet. This pushes the coil back and forth rapidly, like a piston. When the coil moves, it pushes and pulls on the speaker cone."}, {"url": "http://electronics.howstuffworks.com/speaker6.htm", "passage_text": "When the electromagnet's polar orientation switches, so does the direction of repulsion and attraction. In this way, the alternating current constantly reverses the magnetic forces between the voice coil and the permanent magnet. This pushes the coil back and forth rapidly, like a piston. When the coil moves, it pushes and pulls on the speaker cone."}, {"url": "http://micro.magnet.fsu.edu/electromag/java/speaker/", "passage_text": "How A Speaker Works Most loud speakers consist of a circular permanent magnet surrounding a freely moving coil, which is attached to a cone shaped diaphragm. In the speaker below, the circular magnet is partially cut away so that our visitors can see how it operates. "}, {"url": "http://www.physics.org/article-questions.asp?id=54", "passage_text": "Inside a speaker, an electromagnet is placed in front of a permanent magnet. The permanent magnet is fixed firmly into position whereas the electromagnet is mobile. As pulses of electricity pass through the coil of the electromagnet, the direction of its magnetic field is rapidly changed. 1. Cone. 2. Electromagnet (coil). 3. Permanent magnet. The frequency of the vibrations governs the pitch of the sound produced, and their amplitude affects the volume – turn your stereo up high enough and you might even be able to see the diaphragm covering the cone move."}, {"url": "http://www.answers.com/Q/How_do_speakers_use_magnets_to_produce_sound", "passage_text": "When electricity flows through a wire coil called thevoice coil, the round magnet repels or attracts the voice coil. The voice coil is attached to a cone of paper or fabric, and this cone vibrates the air when it moves. This vibration of air is the sound that you hear from the speaker.. In speakers magnet is fixed and the conductor (in the form of a coil is fixed to the back of the diaphragm) is allowed to move freely. As the coil is fixed to the diaphragm the movements of the coil is reciprocated by the movements of the diaphragm."}, {"url": "http://www.answers.com/Q/How_do_speakers_use_magnets_to_produce_sound", "passage_text": "Making the world better, one answer at a time. The magnets in speakers work to absorb the sounds running through the coils. Think of it as a big dust collector and the dust in the sound coming through. In speakers magnet is fixed and the conductor (in the form of a coil is fixed to the back of the diaphragm) is allowed to move freely. As the coil is fixed to the diaphragm the movements of the coil is reciprocated by the movements of the diaphragm."}, {"url": "http://www.answers.com/Q/How_do_speakers_use_magnets_to_produce_sound", "passage_text": "There is usually a large circular magnet in speakers. When an electricial current is put through the speaker cone at a certain frequency it makes the magnetic fields around th … e magnet change. The cone is connected to the diaphragm of the speaker which vibrates, pushing the air, creating sound waves. In speakers magnet is fixed and the conductor (in the form of a coil is fixed to the back of the diaphragm) is allowed to move freely. As the coil is fixed to the diaphragm the movements of the coil is reciprocated by the movements of the diaphragm."}, {"url": "https://answers.yahoo.com/question/index?qid=20070618201019AAYg2AR", "passage_text": "Best Answer: The magnet is part of the 'motor' of the sub. The coil inside the magnet has alternating current running through it. The coil acts as an electromagnet and pulls itself up or pushes itself down moving the cone of the speaker. So the speaker cone will have something to be attracted to or push against, producing vibration which is then heard by your ears as sound. To a point anyway, the bigger the magnet the better the sound. There is a coil of wire at the smallest part of the speaker that acts as an electromagnet. Without the other magnet, there would be no movement of the speaker cone, therefore no sound. oklatom · 8 years ago"}]