[{"url": "http://www.livestrong.com/article/225391-what-does-a-balanced-diet-consist-of/", "passage_text": "As much as half of those grains, however, should be whole grains. Whole grains are an important part of a balanced diet because they supply complex carbohydrates, which burn off slowly throughout the day, whereas simple starches -- such as white rice -- burn off quickly and provide just a short-term energy boost. The Go-to Grains. Whole grains are an important part of a balanced diet because they supply complex carbohydrates. Photo Credit Comstock Images/Stockbyte/Getty Images. The U.S. Department of Agriculture recommends consuming 6 ounces of grains each day – based on a 2,000-calorie diet."}, {"url": "http://diet.lovetoknow.com/wiki/What_Does_a_Healthy_Diet_Consist_Of", "passage_text": "Things to Avoid. Part of a healthy diet is knowing what foods detract from your health. Some foods to avoid or eat in moderation include: 1  Highly processed foods. 2  Foods containing trans-fats. 3  Full-fat dairy. 4  Processed meats such as hot dogs. 5  Sugar. 6  Foods containing simple carbohydrates like white flour. 7  Fast food. 8  Foods containing a lot of sodium. "}, {"url": "http://www.livestrong.com/article/225391-what-does-a-balanced-diet-consist-of/", "passage_text": "When combined with regular exercise, eating a balanced diet is an important part of maintaining a healthy lifestyle. The key to a nutritious diet is to make sure that your body has the right combination of proteins, carbohydrates, dairy products, fruits and vegetables -- and yes, even some healthy fats. Whole grains are an important part of a balanced diet because they supply complex carbohydrates. The Go-to Grains. Whole grains are an important part of a balanced diet because they supply complex carbohydrates. Photo Credit Comstock Images/Stockbyte/Getty Images. The U.S. Department of Agriculture recommends consuming 6 ounces of grains each day – based on a 2,000-calorie diet."}, {"url": "http://www.ehow.com/facts_5476179_balanced-diet-consist.html", "passage_text": "A balanced diet is essential for a healthy lifestyle. To achieve a balanced diet, you must eat from each of the food groups contained in the USDA food pyramid. Each of the recommendations below is based on adults consuming a 2,000 calorie per day diet. "}, {"url": "http://www.nutritionist-resource.org.uk/articles/balanced-diet.html", "passage_text": "Balanced diet. A balanced diet is not a crash diet, it is a way of eating all of the right nutrients that your body needs in order to be healthy. Everyone’s bodies are different and often individuals require a different amount and type of nutrients. "}, {"url": "http://www.pcdfoundation.org/en/staying-healthy-with-pcd/eat-a-healthy-balanced-diet", "passage_text": "The key to a healthy balanced diet is not to ban or omit any foods or food groups but to balance what you eat by consuming a variety of foods in the right proportions. At a high level, the basic elements of a healthy diet include the right amount of protein, fat, carbohydrates, vitamins, minerals and water. "}, {"url": "http://www.nytimes.com/health/guides/nutrition/balanced-diet/overview.html", "passage_text": "A balanced diet means getting the right types and amounts of foods and drinks to supply nutrition and energy for maintaining body cells, tissues, and organs, and for supporting normal growth and development. See All » News & Features. "}, {"url": "http://www.nhs.uk/Livewell/Goodfood/Pages/Healthyeating.aspx", "passage_text": "The eatwell plate shows that to have a healthy, balanced diet, people should try to eat: 1  plenty of fruit and vegetables. 2  plenty of starchy foods, such as bread, rice, potatoes and pasta. 3  some meat, fish, eggs, beans and other non-dairy sources of protein. 4  some milk and dairy foods. The starchy foods are bread, rice, pasta, cereal, potatoes, peas, corn, fruit, fruit juice, milk, yogurt, cookies, candy, soda, and other sweets. If love non veg you include meat, fish, eggs and beans in your diet."}, {"url": "http://www.eatingwell.com/nutrition_health/weight_loss_diet_plans/what_does_a_1500_calorie_day_look_like", "passage_text": "Most people will lose weight on a daily diet of 1,500 calories, which is the total calorie count for all the food pictured above. If you want to be even more precise about cutting calories, this simple calculation will give you a daily calorie goal that can help you lose a healthy 1 to 2 pounds per week. "}, {"url": "http://www.nhs.uk/Livewell/Goodfood/Pages/Healthyeating.aspx", "passage_text": "A diet based on starchy foods such as potatoes, bread, rice and pasta; with plenty of fruit and vegetables; some protein-rich foods such as meat, fish and lentils; some milk and dairy foods; and not too much fat, salt or sugar, will give you all the nutrients you need. The starchy foods are bread, rice, pasta, cereal, potatoes, peas, corn, fruit, fruit juice, milk, yogurt, cookies, candy, soda, and other sweets. If love non veg you include meat, fish, eggs and beans in your diet."}]