[{"url": "http://www.olympicholidays.com/cyprus/cyprus-all-resorts/paphos/avlida-hotel/", "passage_text": "Description. The Avlida Hotel is a large hotel complex set on the Tombs of the Kings Road, very near to the famous burial site of the ancient kings. The nearest beach is approximately a ten minute walk away and the popular beach at Coral Bay is only a 15 minute drive away. Leisure Activities. 1  Large outdoor swimming pool with waterfalls and Jacuzzi. 2  Indoor pool. 3  Sun terrace. 4  The Avlida heath club with gym, sauna, Jacuzzi, steam bath and massage room. 5  Free use of the gym. 6  Watersports (available on beach). 7  Diving facilities. 8  Free use of tennis court (daytime). 9  Table tennis. 10  Games area."}, {"url": "http://www.booking.com/hotel/cy/avlidahotel.en-gb.html", "passage_text": "The popular site of Tombs of the Kings is a few yards away. All of the air-conditioned rooms at Avlida have a flat-screen, satellite TV and an en suite bathroom. Hotel Avlida has a range of on-site leisure facilities including billiards, tennis court, darts and table tennis. Some of the many activities available nearby include diving. Sauna and steam bath are provided, while massage treatments are available upon charge. Panayiotis, Cyprus. Avlida Hotel is situated in the centre of Paphos and only 250 yards from the beach. It features indoor and outdoor pools, a gym, sauna and hot tub."}, {"url": "http://www.avlidahotel.com/", "passage_text": "The Avlida Hotel in Pafos Cyprus is a four star hotel where you will have a very pleasant holiday. This spacious 200 room hotel has been completely renovated in 2013 and enlarged in 2003. It combines excellent service, comfort, hospitality and luxury providing the perfect setting for an enjoyable holiday. "}, {"url": "http://www.booking.com/hotel/cy/avlidahotel.en-gb.html", "passage_text": "The staff was great and always leaning to help! Panayiotis, Cyprus. Avlida Hotel is situated in the centre of Paphos and only 250 yards from the beach. It features indoor and outdoor pools, a gym, sauna and hot tub."}, {"url": "http://www.olympicholidays.com/cyprus/cyprus-all-resorts/paphos/avlida-hotel/", "passage_text": "Twin rooms all have televisions, telephones, air conditioning, hairdryer, radio, mini bar (on request), private bathroom with bath/shower and private balcony with either an inland, side sea or sea view. WiFi are available in rooms at an additional charge. Cleaning of the rooms occur daily as do towel changes. Leisure Activities. 1  Large outdoor swimming pool with waterfalls and Jacuzzi. 2  Indoor pool. 3  Sun terrace. 4  The Avlida heath club with gym, sauna, Jacuzzi, steam bath and massage room. 5  Free use of the gym. 6  Watersports (available on beach). 7  Diving facilities. 8  Free use of tennis court (daytime). 9  Table tennis. 10  Games area."}, {"url": "http://www.booking.com/hotel/cy/avlidahotel.html", "passage_text": "Avlida Hotel is situated in the center of Paphos and is only 850 feet from Faros Beach. Panayiotis, Cyprus. Avlida Hotel is situated in the center of Paphos and is only 850 feet from Faros Beach. It features indoor and outdoor swimming pools, a gym, sauna and jacuzzi."}, {"url": "http://www.booking.com/hotel/cy/avlidahotel.html", "passage_text": "The staff was great and always leaning to help! Panayiotis, Cyprus. Avlida Hotel is situated in the center of Paphos and is only 850 feet from Faros Beach. It features indoor and outdoor swimming pools, a gym, sauna and jacuzzi. All of the air-conditioned rooms at Avlida have satellite TV and a private bathroom. Hotel Avlida has a range of on-site recreational facilities including pool tables, tennis courts, darts and ping-pong. Some of the many activities available nearby include diving."}]