[{"url": "http://www.wikihow.com/Become-a-Paramedic", "passage_text": "Most community colleges offer EMT-Basic classes. They cost $500-$900 and last from 3 to 6 months, or a semester. In some communities, you may have to ride along as a third person for a few months before you will be put into a class. Sometimes you pay for the class and are reimbursed."}, {"url": "http://education.costhelper.com/paramedic-training-certification.html", "passage_text": "1 EMT training costs between $100-$1,000, depending on the length of program and the institution. 2  Recertification and continuing education is required for paramedics in most states. 3  Recertification exams administered by the NREMT cost $110."}, {"url": "http://education.costhelper.com/paramedic-training-certification.html", "passage_text": "1 Technical schools may include books as part of their fees, but at community colleges and universities offering paramedic training, book costs are the same as any other college course of study, and can cost $750-$1,300 per year, depending on the program."}, {"url": "http://www.paramedictrainingspot.com/paramedic-training-school-cost-how-much-is-tuition/", "passage_text": "Training to become a paramedic can be pricey outside of America, too. At a school like Conestoga College in Ontario (Canada), students are expected to pay $2,744.00 for two semesters in year one, and then $2,644.00 for two semesters in year two."}, {"url": "http://www.paramedictrainingspot.com/paramedic-training-school-cost-how-much-is-tuition/", "passage_text": "In general, you can expect your paramedic tuition to cost anywhere between $1,000 to $10,000. Know that this is just an estimate, with some programs exceeding $10,000 in cost for education and training. Take, for example, UCLA’s Paramedic Program. The cost of tuition at UCLA’s Paramedic Program is $9,500. But that cost doesn’t include expenses for things like textbooks, certificates, and uniforms. Factoring in those expenses, students can expect to pay approximately $11,300 to attend UCLA’s Paramedic Program, a program that will last roughly 8-9 months."}, {"url": "http://education.costhelper.com/paramedic-training-certification.html", "passage_text": "1 Paramedic training programs take one to two years to complete. 2  Tuition costs vary from $3,000 to $13,000 or more, depending on the institution. 3  Tuition costs vary significantly among community colleges. 4  At Borough of Manhattan Community College in New York City, tuition costs for a two-year program total $6,300."}]