[{"url": "http://www.webmd.com/a-to-z-guides/basic-metabolic-panel-topic-overview", "passage_text": "If you take any medicines, such as diuretics for high blood pressure, your doctor may order a basic metabolic panel to see if the medicines are affecting your kidneys or your electrolytes. Your doctor also may order this panel as part of a regular health examination or to help diagnose a medical condition. This panel measures the blood levels of blood urea nitrogen (BUN), calcium, carbon dioxide, chloride, creatinine, glucose, potassium, and sodium. 1  Blood Urea Nitrogen (BUN). 2  Calcium."}, {"url": "https://en.wikipedia.org/wiki/Basic_metabolic_panel", "passage_text": "From Wikipedia, the free encyclopedia. A basic metabolic panel (BMP) (also urea and electrolytes or U&E, or urea, electrolytes, creatinine, or UEC or EUC in some countries) is a set of seven or eight blood chemical tests and is one of the most common lab tests ordered by health care providers. A basic metabolic panel including calcium is sometimes colloquially referred to as a CHEM-8. Calcium, as a light alkali metal, is also an electrolyte, but abnormalities are more commonly associated with malnutrition, osteoporosis, or malignancy, especially of the thyroid."}, {"url": "http://www.healthline.com/health/basic-metabolic-panel", "passage_text": "Whether you’re going to see your doctor for a routine checkup or are admitted to the hospital, your doctor needs information about how your body is functioning. A basic metabolic panel is a combination of tests that helps your doctor assess important functions in your body. A small amount of your blood is needed to perform this panel of tests. The blood sample is obtained through “venipuncture.” A needle is inserted into a vein in your arm or hand. Blood is drawn through the needle into a tube and analyzed in a laboratory."}, {"url": "http://www.webmd.com/a-to-z-guides/basic-metabolic-panel-topic-overview", "passage_text": "Topic Overview. A basic metabolic panel is a blood test that measures your sugar (glucose) level, electrolyte and fluid balance, and kidney function. Glucose is a type of sugar your body uses for energy. Electrolytes keep your body's fluids in balance. Your doctor also may order this panel as part of a regular health examination or to help diagnose a medical condition. This panel measures the blood levels of blood urea nitrogen (BUN), calcium, carbon dioxide, chloride, creatinine, glucose, potassium, and sodium. 1  Blood Urea Nitrogen (BUN). 2  Calcium."}, {"url": "https://labtestsonline.org/understanding/analytes/bmp/tab/test", "passage_text": "The basic metabolic panel (BMP) is used to check the status of a person's kidneys and their electrolyte and acid/base balance, as well as their blood glucose level. It can also be used to monitor hospitalized patients and people with certain known conditions, such as hypertension and hypokalemia. The panel is also often ordered in the hospital emergency room setting because its components give health practitioners important information about the current status of a person's kidneys, electrolyte and acid/base balance, and blood glucose and calcium levels."}, {"url": "http://www.healthline.com/health/basic-metabolic-panel", "passage_text": "The basic metabolic panel can give your doctor a good idea if you have any serious problems with: 1  blood filtration. 2  acid/base balance of your blood. 3  blood sugar levels. 4  electrolyte levels. A small amount of your blood is needed to perform this panel of tests. The blood sample is obtained through “venipuncture.” A needle is inserted into a vein in your arm or hand. Blood is drawn through the needle into a tube and analyzed in a laboratory."}, {"url": "https://en.wikipedia.org/wiki/Basic_metabolic_panel", "passage_text": "The basic metabolic panel is a simpler version of the Comprehensive metabolic panel (CMP), which includes tests for liver function. A basic metabolic panel including calcium is sometimes colloquially referred to as a CHEM-8. Calcium, as a light alkali metal, is also an electrolyte, but abnormalities are more commonly associated with malnutrition, osteoporosis, or malignancy, especially of the thyroid."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=167&ContentID=basic_metabolic_panel_blood", "passage_text": "A basic metabolic panel test measures the levels of eight important things in your blood: Calcium. Calcium plays a role in keeping your cells working the way they should. It also helps blood clot normally. Carbon dioxide. This can be a measure of how well your kidneys and lungs are working. Chloride. Glucose, or blood sugar, is a key source of energy for your body, but too much or too little can be a problem. Potassium. This mineral plays a leading role in cell health. Sodium. This mineral plays a key role in making sure cells, tissues, and blood have enough water to work well."}, {"url": "http://www.anylabtestnow.com/tests/cmp/", "passage_text": "The Comprehensive Metabolic Panel (CMP) includes 14 essential tests that are typically requested by your doctor as part of a routine check‐up or annual physical. Most customers who are interested in the CMP decide to upgrade to the Basic Check‐Up Panel, a Comprehensive Male Panel or the Comprehensive Female Panel. All of these Value Panels include the Comprehensive Metabolic Panel as well as other important tests."}]