[{"url": "https://en.wikipedia.org/wiki/Strategic_information_system", "passage_text": "Strategic information systems (SIS) are information systems that are developed in response to corporate business initiative. They are intended to give competitive advantage to the organization. Strategic system, thus, attempt to match Information Services resources to strategic business opportunities where the computer systems will have an impact on the products and the business operations. Planning for strategic systems is not defined by calendar cycles or routine reporting."}, {"url": "https://en.wikipedia.org/wiki/Information_Systems", "passage_text": "Information system is an academic study of systems with a specific reference to information and the complementary networks of hardware and software that people and organizations use to collect, filter, process, create and also distribute data. An information system is the technology an organization uses and also the way in which the organizations interact with the technology and the way in which the technology works with the organization’s business processes."}, {"url": "https://en.wikipedia.org/wiki/Information_Systems", "passage_text": "An information system is the information and communication technology (ICT) that an organization uses, and also the way in which people interact with this technology in support of business processes. An information system is the technology an organization uses and also the way in which the organizations interact with the technology and the way in which the technology works with the organization’s"}, {"url": "http://www.slideshare.net/Alistercrowe/information-system-strategy", "passage_text": "1 In particular: 2  Business strategy. 3  Information systems strategy. 4  Information technology strategy. 5  the process of strategic planning for information systems. 6  To understand. 7  The need for an IS strategy. 8  Types of strategies that exist within an organisation, and how they interact with each other. 1 Business information strategy. 2  This defines how information and knowledge will be used to support the business objectives. 3  IS functionality strategy. 4  Defines the requirements of the business from the systems."}, {"url": "http://www.informationr.net/ir/1-1/paper3.html", "passage_text": "The function of a IS strategy itself is best described by Wilson (1989) states that: An information systems strategy brings together the business aims of the company, an understanding of the information needed to support those aims, and the implementation of computer systems to provide that information. Information strategies, for the purpose of this research being seen as a sub-set of an Information systems strategy. This research holds interest on two levels, first the topic of research, and secondly the methodological approach which will be tested."}, {"url": "http://smallbusiness.chron.com/operational-system-vs-strategic-information-15592.html", "passage_text": "Strategic Information. Computers are used in both strategic and operational information systems. Burke/Triolo Productions/Brand X Pictures/Getty Images. An information system is a system comprised of technology --- primarily computers --- data and operations managers in management processes. Two types of information systems are operational and strategic. These systems often are used in the same business, but they have some distinguishing characteristics and function"}, {"url": "http://www.informationr.net/ir/1-1/paper3.html", "passage_text": "The research focuses on the Information Systems Strategy (ISS) Formation in UK Higher Education Institutions (HEI's) with specific reference to information strategies. Information strategies, for the purpose of this research being seen as a sub-set of an Information systems strategy. This research holds interest on two levels, first the topic of research, and secondly the methodological approach which will be tested."}, {"url": "http://www.projectmanagement.com/content/processes/7278.cfm", "passage_text": "The fundamental objective of Information Strategy Planning (ISP) is to develop a plan for implementing business systems to support business needs. The objectives of the Information Strategy Planning stage are to: - Establish an information strategy based on an evaluation of the business strategy. - Establish a development plan of user-oriented systems to meet business information needs and priorities. - Define an information architecture for the future development of compatible data-sharing systems. - Establish a technical strategy for the best use of new information technolo"}, {"url": "http://www.businessdictionary.com/definition/strategic-information-systems.html", "passage_text": "Definition. Introduced in 1982 by Dr. Charles Wiseman and primarily used within the field of information systems, strategic information systems are created in response to business initiatives to provide a competitive advantage. "}, {"url": "https://en.wikipedia.org/wiki/Strategic_information_system", "passage_text": "A SIS is a computer system that implements business strategies; They are those systems where information services resources are applied to strategic business opportunities in such a way that the computer systems have an impact on the organization’s products and business operations. Strategic system, thus, attempt to match Information Services resources to strategic business opportunities where the computer systems will have an impact on the products and the business operations. Planning for strategic systems is not defined by calendar cycles or routine reporting."}]