[{"url": "http://www.lung.org/lung-health-and-diseases/how-lungs-work/", "passage_text": "Once in the lungs, oxygen is moved into the bloodstream and carried through your body. At each cell in your body, oxygen is exchanged for a waste gas called carbon dioxide. Your bloodstream then carries this waste gas back to the lungs where it is removed from the blood stream and then exhaled. Your lungs and respiratory system automatically perform this vital process, called gas exchange."}, {"url": "http://www.daviddarling.info/encyclopedia/R/respiratory_system.html", "passage_text": "The respiratory system is a group of organs responsible for carrying oxygen from the air to the bloodstream and expelling the waste product carbon dioxide. The main parts of this system are the airways, the lungs and linked blood vessels, and the muscles that enable breathing. "}, {"url": "http://www.innerbody.com/anatomy/respiratory", "passage_text": "The respiratory system provides oxygen to the body’s cells while removing carbon dioxide, a waste product that can be lethal if allowed to accumulate. There are 3 major parts of the respiratory system: the airway, the lungs, and the muscles of respiration. The airway, which includes the nose, mouth, pharynx, larynx, trachea, bronchi, and bronchioles, carries air between the lungs and the body’s exterior."}, {"url": "http://www.webmd.com/lung/how-we-breathe", "passage_text": "The bronchioles end in tiny balloon-like air sacs called alveoli. Your body has over 300 million alveoli. The alveoli are surrounded by a mesh of tiny blood vessels called capillaries. Here, oxygen from the inhaled air passes through the alveoli walls and into the blood. After absorbing oxygen, the blood leaves the lungs and is carried to your heart. Your heart then pumps it through your body to provide oxygen to the cells of your tissues and organs. Clearing the Air. The respiratory system has built-in methods to prevent harmful substances in the air from entering the lungs. Hairs in your nose help filter out large particles. Microscopic hairs, called cilia, are found along your air passages and move in a sweeping motion to keep the air passages clean."}, {"url": "https://en.wikibooks.org/wiki/Human_Physiology/The_respiratory_system", "passage_text": "Gas exchange. Homeostasis is maintained by the respiratory system in two ways: gas exchange and regulation of blood pH. Gas exchange is performed by the lungs by eliminating carbon dioxide, a waste product given off by cellular respiration. During inhalation or exhalation air is pulled towards or away from the lungs, by several cavities, tubes, and openings. The organs of the respiratory system make sure that oxygen enters our bodies and carbon dioxide leaves our bodies. The respiratory tract is the path of air from the nose to the lungs. It is divided into two sections: Upper Respiratory Tract and the Lower Respiratory Tract. Included in the upper respiratory tract are the Nostrils, Nasal Cavities, Pharynx, Epiglottis, and the Larynx. The lower respiratory tract consists of the Trachea, Bronchi, Bronchioles, and the Lungs. As air moves along the respiratory tract it is warmed, moistened and filtered"}, {"url": "http://hyperphysics.phy-astr.gsu.edu/Hbase/biology/respir.html", "passage_text": "By respiratory system we usually mean the passages that transport incoming air to the lungs and to the microscopic air sacs called alveoli where gases are exchanged. The term respiration refers to the whole chain of processes from the inhalation of air to the use of oxygen in the cells. Index. Reference. "}, {"url": "https://en.wikipedia.org/wiki/Respiratory_system", "passage_text": "In humans and other mammals, the anatomical features of the respiratory system include trachea, bronchi, bronchioles, lungs, and diaphragm. Molecules of oxygen and carbon dioxide are passively exchanged, by diffusion, between the gaseous external environment and the blood. The passage of air into the lungs to supply the body with oxygen is known as inhalation, and the passage of air out of the lungs to expel carbon dioxide is known as exhalation; this process is collectively called breathing or ventilation."}, {"url": "http://www.livescience.com/22616-respiratory-system.html", "passage_text": "The human respiratory system is a series of organs responsible for taking in oxygen and expelling carbon dioxide. The primary organs of the respiratory system are lungs, which carry out this exchange of gases as we breathe. Red blood cells collect the oxygen from the lungs and carry it to the parts of the body where it is needed, according to the American Lung Association."}, {"url": "https://en.wikipedia.org/wiki/Respiratory_system", "passage_text": "See also: Respiratory tract. The respiratory system (called also respiratory apparatus, ventilatory system) is a biological system consisting of specific organs and structures used for the process of respiration in an organism. The passage of air into the lungs to supply the body with oxygen is known as inhalation, and the passage of air out of the lungs to expel carbon dioxide is known as exhalation; this process is collectively called breathing or ventilation."}]