[{"url": "http://prescription-drug.addictionblog.org/how-long-does-wellbutrin-stay-in-your-system/", "passage_text": "Wellbutrin has a very long half-life, about 33 to 37 hours. So, it will be eliminated from your husbands system within a few days. I hope by then the symptoms will also subside. I would recommend you to seek second opinion from another doctor and ask for medical help if symptoms don’t start to lessen. It’s possible that Wellbutrin could remain in the body for weeks after your last dose is taken. This, of course, is different for different individuals and depends on your health state, how long were you taking Wellbutrin, level of hydration, metabolism, etc."}, {"url": "https://answers.yahoo.com/question/index?qid=20091230151257AAXjPtL", "passage_text": "with this in mind it takes about 5-6 half lifes for a drug to be considered out of your body. so figure 3-5 days is about how long it should take to get the parent compound out of your system... i am not to sure about the metabolites which might also be significant in the drugs therapeutic profile. Next. I was on 150 mg of Wellbutrin XL (the generic form, actually) for about 25 days. The last pill I took was 34 hours ago. Before that, the last pill I took was 2 days before that."}, {"url": "https://answers.yahoo.com/question/index?qid=20091230151257AAXjPtL", "passage_text": "show more I was on 150 mg of Wellbutrin XL (the generic form, actually) for about 25 days. The last pill I took was 34 hours ago. Before that, the last pill I took was 2 days before that. I am in the wine business, and I need to taste different types of wines on a regular basis. Next. I was on 150 mg of Wellbutrin XL (the generic form, actually) for about 25 days. The last pill I took was 34 hours ago. Before that, the last pill I took was 2 days before that."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_bupropion_to_get_in_system", "passage_text": "Norfloxacin is a antibiotic for a bacterial infection. The time it takes to get into your system depends on how bad the infections is. If it was detected early the antibiotic … will be in your system within 3 days. If detected in a later stage it will take at least 5 to 7 days. Drinking plenty of water helps flush the infection out during your treatment if antibiotic. 2 people found this useful."}, {"url": "http://www.answers.com/Q/How_long_does_Wellbutrin_stay_in_your_system_after_you_stop_taking_it", "passage_text": "Wellbutrin is metabolized to active metabolitrs. The half life of the parent drug is 21 hours and that of the active metabolites range from 20 hours to 37 hours depending on the metabolite. This means that it can take from 5 to 8 days for the drug to be eliminated from the body. it takes roughly 3 weeks, same as prozac.     Most antidepressant medication can take 2-8 weeks to reach their full potential theraputic effect. Speak to you … r doctor or pharmacist for more details."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_bupropion_to_get_in_system", "passage_text": "Up to 72 hours, but it could take a few more days in addition to the first three depending on how muich you have smoked. The Chemicals in spice are unlike THC which (can) stay … in your system for up to a month or longer. They should only take a few days to be flushed out of your system. But regardless..... If it was detected early the antibiotic … will be in your system within 3 days. If detected in a later stage it will take at least 5 to 7 days. Drinking plenty of water helps flush the infection out during your treatment if antibiotic. 2 people found this useful."}, {"url": "http://prescription-drug.addictionblog.org/how-long-does-wellbutrin-stay-in-your-system/", "passage_text": "Wellbutrin has a long half-life (about about 33 to 37 hours) and also has a slow rate of absorption. It’s possible that Wellbutrin could remain in the body for weeks after your last dose is taken. This, of course, is different for different individuals and depends on your health state, how long were you taking Wellbutrin, level of hydration, metabolism, etc."}, {"url": "http://www.answers.com/Q/How_long_does_Wellbutrin_stay_in_your_system_after_you_stop_taking_it", "passage_text": "It stays in your system for 3 months.   I heard it should be cleared out of your system in a week.   It's possible to get pregnant the day after stopping the pill. I  know a girl that was changing pill brands and didn't take the pill  for one day in between pill packs. She had a baby in March. it takes roughly 3 weeks, same as prozac.     Most antidepressant medication can take 2-8 weeks to reach their full potential theraputic effect. Speak to you … r doctor or pharmacist for more details."}, {"url": "http://www.answers.com/Q/How_long_does_Wellbutrin_stay_in_your_system_after_you_stop_taking_it", "passage_text": "The half life is 3-9 hours-so 6-18 total for it to get out of your system. How ever if you have been on it for a while, it can be stored in your fat, but should leave your sys … tem in about 3 days. it takes roughly 3 weeks, same as prozac.     Most antidepressant medication can take 2-8 weeks to reach their full potential theraputic effect. Speak to you … r doctor or pharmacist for more details."}]