[{"url": "http://concretecoatingsinc.com/urethane_sealer.html", "passage_text": "Urethane sealers provide quick dry times and a gloss finish. Water and a solvent-based urethanes are available for any project, big or small. Urethane sealers are designed for interior, exterior, commercial and residential use."}, {"url": "http://www.concretenetwork.com/fix-concrete-sealing/compatibility-water-solvent-based-sealers.html", "passage_text": "Answer: In general, putting a solvent-based sealer on top of a water-based sealer is a bad idea. The solvents can eat or soften the existing water-based sealer, destroying both coatings. Think of it along the lines of oil and water; they do not mix. There is nothing wrong with water-based sealers."}, {"url": "http://www.directcolors.com/product/500-solvent-based-polyurethane-mini-kit/", "passage_text": "Surfaces sealed with 500 Solvent-Based Polyurethane Sealer should cure for 12 hours at approximately 75F before use. Allow for additional drying time if high humidity is a factor. 500 Solvent based Sealer can also be applied with HVLP Gravity Feed Spray Gun for finer finish."}, {"url": "http://www.directcolors.com/product/500-solvent-based-polyurethane-mini-kit/", "passage_text": "500 Solvent based Polyurethane Sealer for Concrete Countertops is a high gloss, two-component urethane resin that provides a clear, long-lasting finish. Polyurethane coatings are highly durable, easy-to-apply and suitable for both indoor and outdoor use."}, {"url": "http://www.concretenetwork.com/products-sealer/polyurethane.html", "passage_text": "Polyurethanes sealers are nearly twice as thick as an acrylic sealer and form a high-build protective film on the concrete surface that provides excellent resistance to abrasion and chemicals. They are available in water-and solvent-based versions and a range of sheen levels."}, {"url": "http://homeguides.sfgate.com/polyurethane-varnish-98832.html", "passage_text": "Polyurethane is a synthetic resin and type of varnish used in the finishing of floors, cabinets and other woodwork. It is a desirable choice of varnish because it is transparent, water-, fungus-and mildew-resistant, and resists abrasions."}, {"url": "http://homeguides.sfgate.com/polyurethane-varnish-98832.html", "passage_text": "There are water-and solvent-based -- also called oil-based -- polyurethane varnishes. Water-based polyurethanes are more environmentally friendly and safer to use than solvent-based, but they are not as resistant to wear and tear as solvent-based products."}, {"url": "http://www.lagler.com.au/architects/solvent-based-coatings.htm", "passage_text": "Exclusive to Lagler is this unique range of solvent-based polyurethane. The HANDLEYS range is extremely economical in price, yet has a unique quality edge. HANDLEYS have a range including fast sealer,, 44, 45 and 60% solids gloss, Lo-Sheen and Satin, in 20L containers."}]