[{"url": "http://military.wikia.com/wiki/Joshua_Chamberlain", "passage_text": "Joshua Lawrence Chamberlain (September 8, 1828 – February 24, 1914), born as Lawrence Joshua Chamberlain, was an American college professor from the State of Maine, who volunteered during the American Civil War to join the Union Army. Early life Edit. Chamberlain was born Lawrence Joshua Chamberlain in Brewer, Maine, the son of Sarah Dupree (nee Née) brastow And Joshua. Chamberlain he was the eldest of five. children"}, {"url": "http://www.goodreads.com/author/show/149660.Joshua_Lawrence_Chamberlain", "passage_text": "Biographies & Memoirs, History. Chamberlain was a college professor at Bowdoin College before the U.S. Civil War. When the faculty refused him permission for a leave of absense so that he could enlist he took a sabbatical and enlisted anyway. "}, {"url": "http://dailysun.bowdoin.edu/2015/04/bowdoins-patrick-rael-on-joshua-chamberlain-and-appomattox/", "passage_text": "On April 9, 1865, the bloodiest conflict ever fought in the western hemisphere ended, and a Bowdoin man was at the center of the action. Joshua Lawrence Chamberlain, the studious Brewer native who became a college professor, emerged as one of the finest civilian-soldiers of the Civil War."}, {"url": "https://en.wikipedia.org/wiki/Joshua_Chamberlain", "passage_text": "Joshua Lawrence Chamberlain (September 8, 1828 – February 24, 1914), born as Lawrence Joshua Chamberlain, was an American college professor from the State of Maine, who volunteered during the American Civil War to join the Union Army. Chamberlain was born Lawrence Joshua Chamberlain in Brewer, Maine, the son of Sarah Dupee (nee Née) brastow And Joshua. Chamberlain he was the oldest of five. children"}, {"url": "http://learn.bowdoin.edu/joshua-lawrence-chamberlain/documents/1859-10-14.html", "passage_text": "to Nehemiah Cleaveland, Bowdoin College, October 14, 1859. Chamberlain found himself as a Professor at Bowdoin College from 1856 until he left to fight in the Civil War in the spring of 1862. Chamberlain was a Professor of Rhetoric. The study of public speaking and debate. Joshua Lawrence Chamberlan: The Bowdoin College Site. Chamberlain found himself as a Professor at Bowdoin College from 1856 until he left to fight in the Civil War in the spring of 1862."}, {"url": "http://military.wikia.com/wiki/Joshua_Chamberlain", "passage_text": "Early life Edit. Chamberlain was born Lawrence Joshua Chamberlain in Brewer, Maine, the son of Sarah Dupree (nee Née) brastow And Joshua. Chamberlain he was the eldest of five. Children it is also said that he was his'mother s favorite while his father was tough on. him Early life Edit. Chamberlain was born Lawrence Joshua Chamberlain in Brewer, Maine, the son of Sarah Dupree (nee Née) brastow And Joshua. Chamberlain he was the eldest of five. children"}, {"url": "http://www.americancivilwarstory.com/joshua-chamberlain.html", "passage_text": "Joshua Chamberlain. At the outbreak of the American Civil War, Joshua Chamberlain (right) was eager to serve his country, but his employer was not so eager to see him go... Chamberlain was a professor at Bowdoin College and was extremely well educated. He was fluent in nine languages. When he expressed his desire to serve, the administration at Bowdoin prevented him from doing so. During his time in the Union Army, Joshua Chamberlain would go from inexperienced officer to Major General. He would become a hero for his bravery in battle, and for returning to lead his men after reportedly dying. He would even earn the appreciation of his enemies. All in all, he was a true American Civil War hero."}, {"url": "http://thelatinlibrary.com/chron/civilwarnotes/chamberlain.html", "passage_text": "Joshua Lawrence Chamberlain (1828-1914). Joshua Lawrence Chamberlain (September 8, 1828 - February 24, 1914) was a college professor and a highly-respected officer in the United States Army during the American Civil War, reaching the rank of major general. He was also a Medal of Honor winner, and served as a Republican Governor of Maine for four terms. He also served on the faculty and as president of Bowdoin College. Early life. Joshua Lawrence Chamberlain was born in Brewer, Maine."}]