[{"url": "http://answers.webmd.com/answers/1009122/what-conditions-does-abreva-treat", "passage_text": "Docosanol is used to treat cold sores/fever blisters (herpes labialis). It can speed up healing of the sores and decrease symptoms (such as tingling, pain, burning, itching). It works by blocking the virus that causes the cold sores (herpes simplex) from entering the healthy skin cells and growing in number."}, {"url": "http://www.webmd.com/drugs/2/drug-20512/abreva-topical/details", "passage_text": "Uses. Docosanol is used to treat  cold sores / fever blisters  (herpes labialis). It can speed up healing of the sores and decrease symptoms (such as tingling, pain, burning, itching). It works by blocking the virus that causes the cold sores (herpes simplex) from entering the healthy skin cells and growing in number."}, {"url": "http://www.everydayhealth.com/drugs/abreva", "passage_text": "1 Review. 1 Review. Abreva is the brand name of the drug docosanol, which is used to treat cold sore infections caused by the herpes simplex virus. This over-the-counter (OTC) medicine is available as a topical cream. It doesn't cure herpes, but it can speed up healing of sores and decrease symptoms."}, {"url": "http://www.webmd.com/drugs/2/drug-20512/abreva-topical/details", "passage_text": "Docosanol is used to treat  cold sores / fever blisters  (herpes labialis). It can speed up healing of the sores and decrease symptoms (such as tingling, pain, burning, itching). It works by blocking the virus that causes the cold sores (herpes simplex) from entering the healthy skin cells and growing in number."}, {"url": "http://www.medilexicon.com/drugs/abreva.php", "passage_text": "General Information. ABREVA is a docosanol 10% cream for the topical treatment of recurrent oral-facial herpes simplex episodes (cold sores or fever blisters)."}, {"url": "http://www.everydayhealth.com/drugs/abreva", "passage_text": "Abreva is the brand name of the drug docosanol, which is used to treat cold sore infections caused by the herpes simplex virus. This over-the-counter (OTC) medicine is available as a topical cream. It doesn't cure herpes, but it can speed up healing of sores and decrease symptoms."}]