[{"url": "http://www.medicalnewstoday.com/articles/150999.php", "passage_text": "Health is a state of complete physical, mental and social well-being and not merely the absence of disease or infirmity.. The Definition has not been amended since 1948. During the Ottawa Charter for Health Promotion in 1986, the WHO said that health is: a resource for everyday life, not the objective of living."}, {"url": "http://www.medicalnewstoday.com/articles/153998.php", "passage_text": "Knowledge center. Healthy eating means consuming the right quantities of foods from all food groups in order to lead a healthy life. Diet is often referred to as some dietary regimen for losing weight. However, diet simply means what food we eat in the course of a 24-hour, one week, or one month, etc. period."}, {"url": "http://www.medicalnewstoday.com/articles/153998.php", "passage_text": "The crucial part of healthy eating is a balanced diet. A balanced diet-or a good diet-means consuming from all the different good groups in the right quantities. Nutritionists say there are five main food groups-whole grains, fruit and vegetables, protein, diary, and fat & sugar."}, {"url": "http://definitionofwellness.com/what-is-wellness/", "passage_text": "Wellness / good health has traditionally been viewed as freedom from disease; thus, if you were not sick, you were considered healthy."}, {"url": "http://www.who.int/topics/nutrition/en/", "passage_text": "Nutrition is the intake of food, considered in relation to the body’s dietary needs. Good nutrition – an adequate, well balanced diet combined with regular physical activity – is a cornerstone of good health."}, {"url": "http://www.medicalnewstoday.com/articles/150999.php", "passage_text": "Health is a state of complete physical, mental and social well-being and not merely the absence of disease or infirmity.. a resource for everyday life, not the objective of living. Health is a positive concept emphasizing social and personal resources, as well as physical capacities.."}, {"url": "http://www.medicalnewstoday.com/articles/150999.php", "passage_text": "The Lancet questions WHO's definition of health. An article in The Lancet states that health is not a state of complete physical, mental, and social well-being . Neither is it merely the absence of disease or infirmity ."}, {"url": "http://definitionofwellness.com/what-is-wellness/", "passage_text": "Wellness, as a state of health, is closely associated with your lifestyle. Each person has a responsibility to provide for such health essentials as good nutrition, proper weight control, exercise, and controlling of risk factors such as smoking, alcohol and drug abuse. These things all play a role in wellness."}]