[{"url": "http://nihseniorhealth.gov/parkinsonsdisease/whatcausesparkinsonsdisease/01.html", "passage_text": "A Shortage of Dopamine. Parkinson's disease occurs when nerve cells, or neurons, in an area of the brain that controls movement become impaired and/or die. Normally, these neurons produce an important brain chemical known as dopamine, but when the neurons die or become impaired, they produce less dopamine. People with Parkinson's also have loss of the nerve endings that produce the neurotransmitter norepinephrine. Norepinephrine, which is closely related to dopamine, is the main chemical messenger of the sympathetic nervous system."}, {"url": "http://www.nytimes.com/health/guides/disease/parkinsons-disease/print.html", "passage_text": "Background. Parkinson's disease (PD) is a slowly progressive neurological disorder that affects movement, muscle control, and balance. Parkinson’s disease is part of a group of conditions called motor system disorders, which are associated with the loss of dopamine-producing brain cells. These dopamine-associated motor disorders are referred to as parkinsonism."}, {"url": "http://www.ayurvedayogashram.com/parkinson-disease.asp", "passage_text": "Parkinson's disease (PD) may be a slowly progressive upset that affects movement, muscle control, and balance. shaking palsy is an element of a gaggle of conditions referred to as motor system disorders, that are related to the loss of dopamine-producing brain cells. 1 Parkinson's disease develops as cells are destroyed in certain components of the brain stem, particularly the crescent cell mass referred to as the nucleus niger. 2  The lack of a chemical traveller, referred to as monoamine neurotransmitter, in the brain is claimed to be the main cause for the Parkinson's disease."}, {"url": "http://pennstatehershey.adam.com/content.aspx?productId=10&pid=10&gid=000051", "passage_text": "Introduction. Parkinson disease (PD) is a slowly progressive neurological disorder that affects movement, muscle control, and balance. Parkinson disease is part of a group of conditions called motor system disorders, which are associated with the loss of dopamine-producing brain cells. Parkinson disease is a neurological disorder that affects movement, muscle control, and balance. Parkinson disease most commonly affects people 55 to 75 years old, but it can also develop in younger people."}, {"url": "http://www.ayurvedayogashram.com/parkinson-disease.asp", "passage_text": "Parkinson's Disease. Parkinson's disease may be a slowly progressive disorder that affects movement, muscle control, and balance. a part of the disease method develops as cells are destroyed in certain components of the brain stem, particularly the crescent cell mass referred to as the nucleus niger. 1 Parkinson's disease develops as cells are destroyed in certain components of the brain stem, particularly the crescent cell mass referred to as the nucleus niger. 2  The lack of a chemical traveller, referred to as monoamine neurotransmitter, in the brain is claimed to be the main cause for the Parkinson's disease."}, {"url": "http://www.mayfieldclinic.com/PE-PD.htm", "passage_text": "Parkinson’s Disease (PD) is a chronic, progressive disorder that affects nerve cells deep in the brain responsible for planning and controlling body movement. Dopamine is a chemical used in body movement. When the dopamine-producing nerve cells die, symptoms such as tremor, slowness, stiffness, and balance problems begin to occur. The cause of Parkinson's is largely unknown, and the disease cannot be cured at this time. Treatments focus on reducing symptoms to enable a more active lifestyle."}, {"url": "http://umm.edu/health/medical/reports/articles/parkinsons-disease", "passage_text": "Introduction. Parkinson's disease (PD) is a slowly progressive neurological disorder that affects movement, muscle control, and balance. Parkinson’s disease is part of a group of conditions called motor system disorders, which are associated with the loss of dopamine-producing brain cells. Parkinson's disease is a slowly progressive disorder that affects movement, muscle control, and balance. Part of the disease process develops as cells are destroyed in certain parts of the brain stem, particularly the crescent-shaped cell mass known as the substantia nigra."}, {"url": "http://nihseniorhealth.gov/parkinsonsdisease/whatcausesparkinsonsdisease/01.html", "passage_text": "Dopamine is a chemical messenger, or neurotransmitter. Dopamine is responsible for transmitting signals between the substantia nigra and multiple brain regions. The connection between the substantia nigra and the corpus striatum is critical to produce smooth, purposeful movement. People with Parkinson's also have loss of the nerve endings that produce the neurotransmitter norepinephrine. Norepinephrine, which is closely related to dopamine, is the main chemical messenger of the sympathetic nervous system."}, {"url": "http://www.ninds.nih.gov/disorders/parkinsons_disease/detail_parkinsons_disease.htm", "passage_text": "Parkinson's disease (PD) is a degenerative disorder of the central nervous system that belongs to a group of conditions called movement disorders. It is both chronic, meaning it persists over a long period of time, and progressive, meaning its symptoms grow worse over time. "}, {"url": "http://www.nytimes.com/health/guides/disease/parkinsons-disease/print.html", "passage_text": "Parkinson's disease is a slowly progressive disorder that affects movement, muscle control, and balance. Part of the disease process develops as cells are destroyed in certain parts of the brain stem, particularly the crescent-shaped cell mass known as the substantia nigra. Parkinson’s disease is part of a group of conditions called motor system disorders, which are associated with the loss of dopamine-producing brain cells. These dopamine-associated motor disorders are referred to as parkinsonism."}]