[{"url": "http://finance.zacks.com/can-individual-make-ira-simple-ira-contributions-1902.html", "passage_text": "SIMPLE IRA. You can participate in a SIMPLE IRA if you work for a business that employs no more than 100 workers that earn more than $5,000 per year. You and your employer can make contributions to the account, but unlike other retirement plans, your employer's contributions are not subject to vesting schedules"}, {"url": "http://money.usnews.com/money/blogs/on-retirement/2013/06/10/4-retirement-plan-options-for-small-businesses", "passage_text": "Contributions count against your 401(k) contributions. If you're running a side business and contribute elsewhere to an employer's 401(k) program, this isn't the best option for you. Contributions to a SIMPLE IRA count against the $17,500 limit for your 401(k), seriously limiting your overall retirement savings options. Big penalties may apply. Higher limits. A SIMPLE IRA offers higher contribution limits than a traditional or Roth IRA. In 2013, employees can contribute up to $12,000 to their account, plus a $2,500 catch-up contribution for employees older than 50."}, {"url": "http://www.dol.gov/ebsa/Publications/simple.html", "passage_text": "Employees can make salary reduction contributions in any amount to a SIMPLE IRA plan up to the legal limits. The maximum amount that an employee can contribute is $12,000 in 2014 and $12,500 in 2015. Participants in a SIMPLE IRA Plan. Employees who elect to contribute or to whose accounts you deposit contributions are participants. Your obligation is to provide information to your financial institution on those employees who can participate as described in your plan document."}, {"url": "http://money.usnews.com/money/blogs/on-retirement/2013/06/10/4-retirement-plan-options-for-small-businesses", "passage_text": "Contributions don't affect other accounts. Contributions that you make to an employee's SEP IRA don't affect his or her ability to contribute to another IRA account. Employees who also work for another business where they have a separate retirement account can still have a SEP IRA with your company. Higher limits. A SIMPLE IRA offers higher contribution limits than a traditional or Roth IRA. In 2013, employees can contribute up to $12,000 to their account, plus a $2,500 catch-up contribution for employees older than 50."}, {"url": "https://www.irs.gov/publications/p560/ch03.html", "passage_text": "Catch-up contributions. A SIMPLE IRA plan can permit participants who are age 50 or over at the end of the calendar year to also make catch-up contributions. The catch-up contribution limit for SIMPLE IRA plans is $2,500 for 2014 and $3,000 for 2015. You can deduct SIMPLE IRA contributions in the tax year within which the calendar year for which contributions were made ends. You can deduct contributions for a particular tax year if they are made for that tax year and are made by the due date (including extensions) of your federal income tax return for that year."}, {"url": "http://www.rothira.com/blog/take-advantage-of-retirement-accounts-for-a-side-business", "passage_text": "The Simple—or Savings Incentive Match Plan for Employees—can be used for a sole practitioner or for a small business with fewer than 100 employees. The maximum contribution is $12,000 per person ($14,500 if you’re 50 or older) but it cannot be used if you’re covered under another retirement plan (other than a Roth IRA). Just as with IRA’s, contributions are determined by modified adjusted gross income (AGI). But unlike IRA’s, if you exceed these limits, you cannot make a Roth IRA contribution at all. For 2014, for single taxpayers, eligibility begins to phase out at an AGI of $114,000, and is gone completely at $129,000."}, {"url": "http://www.dol.gov/ebsa/Publications/simple.html", "passage_text": "Example 2: Austin works for the Skidmore Tire Company, a small business with 75 employees. Skidmore has decided to establish a SIMPLE IRA plan for its employees and will make a 2 percent nonelective contribution for each of them. Participants in a SIMPLE IRA Plan. Employees who elect to contribute or to whose accounts you deposit contributions are participants. Your obligation is to provide information to your financial institution on those employees who can participate as described in your plan document."}, {"url": "http://www.rothira.com/blog/take-advantage-of-retirement-accounts-for-a-side-business", "passage_text": "The contribution must come from business income, but if you earn that much you could set aside $52,000 in a SEP IRA and an additional $5,500 in a Roth IRA for a total of $57,500 per year set aside for retirement. Just as with IRA’s, contributions are determined by modified adjusted gross income (AGI). But unlike IRA’s, if you exceed these limits, you cannot make a Roth IRA contribution at all. For 2014, for single taxpayers, eligibility begins to phase out at an AGI of $114,000, and is gone completely at $129,000."}]