[{"url": "http://www.efile.com/tax-deduction/mileage-rates/", "passage_text": "The standard tax deductible mileage rates were adjusted by the IRS for the second half of 2011 (from July 1 to December 31) . These mileage rates are: 1  55.5 cents per mile driven for business purposes. 2  23.5 cents per mile driven for medical or moving purposes."}, {"url": "http://www.efile.com/tax-deduction/mileage-rates/", "passage_text": "The tax deductible standard mileage rates for the use of a car, van, pickup, or panel truck in 2010 are: 1  50 cents per mile for business miles driven. 2  16.5 cents per mile driven for medical or moving purposes. 3  14 cents per mile driven in service of charitable organizations."}, {"url": "http://www.efile.com/tax-deduction/mileage-rates/", "passage_text": "The standard deductible IRS mileage rates for the use of a car, van, pickup, or panel truck during the first half of 2011 (from January 1 to June 30) are: 1  51 cents per mile driven for business purposes. 2  19 cents per mile driven for medical or moving purposes."}, {"url": "https://www.mileiq.com/blog/mileage-deduction/", "passage_text": "With the standard mileage rate, you take a mileage deduction of a specified number of cents for every business mile you drive. The IRS sets the standard mileage rate each year. The 2015 Mileage Rate is 57.5 cents per mile. To figure out your mileage deduction, simply multiply your business miles by the standard mileage rate for the specific year. Example: Ed, a salesperson, drove his car 20,000 miles for business during 2014."}, {"url": "http://www.efile.com/tax-deduction/mileage-rates/", "passage_text": "The optional standard tax deductible IRS mileage rates for the use of your car, van, pickup truck, or panel truck during 2013 are: 1  56.5 cents per mile driven for business purposes. 2  24 cents per mile driven for medical or moving purposes. 3  14 cents per mile driven in service of charitable organizations."}, {"url": "https://www.mileiq.com/blog/mileage-deduction/", "passage_text": "To determine his mileage deduction, he simply multiplies his business miles by the applicable standard mileage rate (56 cents per mile in 2014). This gives him a total mileage deduction for the year of $11,200 (56 cents × 20,000 = $11,200)."}, {"url": "http://budgeting.thenest.com/can-deduct-mileage-doctors-pharmacies-tax-deductions-26754.html", "passage_text": "The IRS sets a mileage rate for medical deductions that can change from year to year and during the year. For 2011, the rate was 19 cents a mile for trips between Jan. 1 and June 30, and 23.5 cents per mile from trips made between July 1 and Dec. 31."}]