[{"url": "http://www.infoplease.com/country/el-salvador.html", "passage_text": "El Salvador, with the other countries of Central America, declared its independence from Spain on Sept. 15, 1821, and was part of a federation of Central American states until that union dissolved in 1838. In 1525, Pedro de Alvarado, a lieutenant of Cortes'cortés, s Conquered El. Salvador El, salvador with the other countries Of Central, america declared its independence From spain On. sept, 15, 1821 and was part of a federation Of Central american states until that union dissolved in. 1838"}, {"url": "http://travel.nationalgeographic.com/travel/countries/el-salvador-guide/", "passage_text": "El Salvador. El Salvador's highest peak, the Santa Ana (Ilamatepec) Volcano, erupted in 2005. Photograph by Galen Rowell/CORBIS. The smallest and most densely populated nation in Central America sits at the edge of the Pacific Ocean between Guatemala and Honduras. • Beautiful beaches and a sizzling nightlife top the list of attractions, but serious surfers have begun descending in ever larger numbers."}, {"url": "https://en.wikipedia.org/wiki/El_Salvador", "passage_text": "El Salvador's capital and largest city is San Salvador. As of 2013, El Salvador had a population of approximately 6.29 million, making it the most densely populated country in the region. Its population consists largely of Mestizos of European and Indigenous American descent. As the smallest country in continental America, El Salvador is affectionately called Pulgarcito de America (the  Tom Thumb of the Americas). The highest point in El Salvador is Cerro El Pital, at 2,730 metres (8,957 ft), on the border with Honduras."}, {"url": "https://en.wikipedia.org/wiki/El_Salvador", "passage_text": "[el salβaˈðor] , Pipil: Kūskatan), officially the Republic of El Salvador (Spanish: Republica república De El, salvador Literally republic Of The), savior is the smallest and the most densely populated country In Central. america As the smallest country in continental America, El Salvador is affectionately called Pulgarcito de America (the  Tom Thumb of the Americas). The highest point in El Salvador is Cerro El Pital, at 2,730 metres (8,957 ft), on the border with Honduras."}, {"url": "http://www.encyclopedia.com/topic/El_Salvador.aspx", "passage_text": "El Salvador (ĕl saelvaeŧħōr´) , sälväŧħōr Officially republic Of El, salvador (republic 2005. est. 6,705,000), 8,260 8260 sq (21,393 21393 sq), Km Central. America the country is bounded on the south by The Pacific, ocean on the west By, guatemala and on the north and east By. Honduras the capital and largest city Is San. salvador El Salvador is divided into 14 departments (departamentos), including Ahuachapan, Cabanas, Chalatenango, Cuscatlan, La Libertad, La Paz, La Union, Morazan, San Miguel, San Salvador, Santa Ana, San Vicente, Sonsonate, and Usulutan."}, {"url": "http://wikitravel.org/en/El_Salvador", "passage_text": "El Salvador is a country in Central America and, geographically, is part of continental North America. It is bordered on the southwest by the Pacific Ocean, and lies between Guatemala and Honduras. [1] Land entrances are not charged for El Salvador as the visas for Guatemala, Nicaragua and Honduras include El Salvador in the CA-4 visa. Passports of certain countries might need to obtain a visa before entering El Salvador such as Malaysia."}, {"url": "http://www.encyclopedia.com/topic/El_Salvador.aspx", "passage_text": "The republic of El Salvador is the smallest country in Central America, with a total area of 21,041 square kilometers (8,124.59 mi.). It is bounded on the northwest by Guatemala, on the north and east by Honduras, and on the south by the Pacific Ocean. El Salvador is divided into 14 departments (departamentos), including Ahuachapan, Cabanas, Chalatenango, Cuscatlan, La Libertad, La Paz, La Union, Morazan, San Miguel, San Salvador, Santa Ana, San Vicente, Sonsonate, and Usulutan."}, {"url": "https://en.wikipedia.org/wiki/San_Salvador", "passage_text": "The San Salvador Metro Area is the core nucleus of El Salvador and is one of the largest urban centers in the Central America isthmus. San Salvador (English: Holy Savior) is the capital city of El Salvador, and the capital of the San Salvador department."}, {"url": "http://www.infoplease.com/country/el-salvador.html", "passage_text": "Geography. Situated on the Pacific coast of Central America, El Salvador has Guatemala to the west and Honduras to the north and east. It is the smallest of the Central American countries, with an area equal to that of Massachusetts, and it is the only one without an Atlantic coastline. In 1525, Pedro de Alvarado, a lieutenant of Cortes'cortés, s Conquered El. Salvador El, salvador with the other countries Of Central, america declared its independence From spain On. sept, 15, 1821 and was part of a federation Of Central american states until that union dissolved in. 1838"}]