[{"url": "http://www.exinfm.com/board/accounts_receivable_ratios.htm", "passage_text": "Number of Days in Receivables = 365 Days in the Year / Turnover Ratio. Using the same information from the previous example gives us 46 days on average to collect our accounts receivable for the year. Two other ratios that can be used are Receivables to Sales and Receivables to Assets. These ratios are calculated as follows: Accounts Receivable Turnover = Credit Sales / Average Receivable Balance. Example: Annual credit sales were $ 400,000, beginning balance for accounts receivable was $ 55,000 and the yearend balance was $ 45,000. The turnover rate is 8, calculated as follows: Average receivable balance is $ 50,000 ($ 55,000 + $ 45,000) / 2. The turnover ratio is $ 400,000 / $ 50,000"}, {"url": "http://www.investopedia.com/terms/a/average_collection_period.asp", "passage_text": "BREAKING DOWN 'Average Collection Period'. For example, suppose that a widget making company, XYZ Corp, has total credit sales of $100,000 during a year (assume 365 days) and has an average amount of accounts receivables is $50,000. Its average collection period is 182.5 days. "}, {"url": "http://www.chegg.com/homework-help/questions-and-answers/inmoo-company-s-average-age-accounts-receivable-45-days-average-age-accounts-payable-40-da-q3628676", "passage_text": "Question. Inmoo Company's average age of accounts receivable is 45 days, the average age of accounts payable is 40 days, and the average age of inventory is 69 days. Assuming a 365-day year, what is the length of its cash conversion cycle? "}, {"url": "https://answers.yahoo.com/question/index?qid=20070206071533AACxpkq", "passage_text": "The formula for this is Net Credit Sales divided by Average Accounts Receivable. To calculate Average Accounts Receivable, all you have to do is find the average of the beginning and ending A/R balances. Now, all you have to do is take the number of days in the year or month, and divide it by the A/R Turnover Ratio. That's it! Let me give you an examp"}, {"url": "http://www.danielsoper.com/fincalc/calc.aspx?id=7", "passage_text": "This calculator will compute a company's average accounts receivable balance over a specific time period, given the accounts receivable balance at the beginning of the time period and the accounts receivable balance at the end of the time period. A company needs to know its average accounts receivable balance in order to determine its accounts receivable turnover rate. Accounts receivable (time 1): The balance of accounts receivable at the beginning of the time period of interest."}, {"url": "http://financial-dictionary.thefreedictionary.com/Average+age+of+accounts+receivable", "passage_text": "The weighted-average age of all the firm's outstanding invoices. The total amount of time a company's accounts receivable have been uncollected divided by the number of outstanding invoices. For example, suppose a company has three outstanding invoices, one for 30 days, one for 40 days, and one for 90 days. Their average age is accounted as follows: Average age of accounts receivable = (30 + 40 + 90) / 3 = 53.33 days. 1  Facebook."}, {"url": "http://financial-dictionary.thefreedictionary.com/Average+age+of+accounts+receivable", "passage_text": "Average Age of Accounts Receivable. The total amount of time a company's accounts receivable have been uncollected divided by the number of outstanding invoices. For example, suppose a company has three outstanding invoices, one for 30 days, one for 40 days, and one for 90 days. Their average age is accounted as follows: Average age of accounts receivable = (30 + 40 + 90) / 3 = 53.33 days. 1  Facebook."}, {"url": "http://accountingexplained.com/financial/ratios/receivables-turnover", "passage_text": "Example 1: Net credit sales of Company A during the year ended June 30, 2010 were $644,790. Its accounts receivable at July 1, 2009 and June 30, 2010 were $43,300 and $51,730 respectively. Calculate the receivables turnover ratio. Average Accounts Receivable = ($43,300 + $51,730) ÷ 2 = $47,515. Receivables Turnover Ratio = $644,790 ÷ $47,515 ≈ 13.57. Example 2: Total sales of Company B during the year ended December 31, 2010 were $984,000. Customers returned goods invoiced at $31,400 during the year. Average accounts receivable during the period were $23,880. Calculate accounts receivable turnover ratio."}, {"url": "http://www.accountingtools.com/accounts-receivable-analysis", "passage_text": "This report divides the age of the accounts receivable into various buckets, which you can sometimes alter within the accounting software to match your billing terms. The most common time buckets are from 0-30 days old, 31-60 days old, 61-90 days old, and older than 90 days. Annual sales/365 Days. For example, if there are usually $500,000 of accounts receivable outstanding at any time, and annual sales are $3.65 million, then the accounts receivable collection period is calculated as: $500,000 Accounts receivable / ($3,650,000 Annual sales / 365 Days) = 50 Days collection period."}]