[{"url": "http://www.fao.org/docrep/w8079e/w8079e0h.htm", "passage_text": "Most common cereal starches contain 20-30% amylose. Waxy starches (maize, rice, sorghum, barley) have no amylose and contain essentially 100% amylopectin. The first example of a waxy wheat starch has recently been reported from Japan. High-amylose starches (maize, barley) having 50-70% amylose are available. Waxy and high-amylose starches differ from normal starches in some properties that make them of use in certain food products."}, {"url": "http://www.cargillfoods.com/lat/en/products/starches-dextrins/index.jsp", "passage_text": "The starches most used in food industry are extracted from cereals (corn, wheat and rice) or roots and tubers (cassava and potato). In addition to the nutritional value, starches are used to change the properties of many other foods. They are used as gelling and thickening agents, and also in adherence, retention of humidity, stabilization and texturization, among other applications."}, {"url": "http://www.fao.org/docrep/t0395e/T0395E03.htm", "passage_text": "Starch. The major chemical component of the maize kernel is starch, which provides up to 72 to 73 percent of the kernel weight. Other carbohydrates are simple sugars present as glucose, sucrose and fructose in amounts that vary from 1 to 3 percent of the kernel."}, {"url": "http://www.chem.mtu.edu/%7Efmorriso/cm4650/PropertiesOfCornStarch2007.pdf", "passage_text": "Sandhu, Singh, and Kaur (2004) studied the eﬀectof corn types on the physicochemical, thermal, morpholog-ical and rheological properties of corn starches. Texturalproperties of starch gels are very important criteria, usedto evaluate the performance of starch in a food system."}, {"url": "http://www.fao.org/docrep/t0395e/T0395E03.htm", "passage_text": "The composition of maize starch is genetically controlled. In common maize, with either the dent or flint type of endosperm, amylose makes up 25 to 30 percent of the starch and amylopectin makes up 70 to 75 percent. Waxy maize contains a starch that is 100 percent amylopectin."}, {"url": "http://www.fao.org/docrep/w8079e/w8079e0h.htm", "passage_text": "The amount of glucose contained in these starch hydrolysates depends on the method used in their preparation, e.g. acid conversion, acid-enzyme conversion, or enzyme conversion (34). Small amounts of glucose are also found in maltodextrins and corn syrup solids, commonly used as ingredients in food products."}, {"url": "http://www.roquette-animalnutrition.com/pea-starch-animal-nutrition-milk-substitute-calves-aquafeed/", "passage_text": "Depending on whether they are obtained from maize, wheat, potato or pea, native starches present different characteristics according to the size and structures of the starch granules, and depending on their amylose and amylopectin composition."}]