[{"url": "http://www.allnatural.net/herbpages/licorice.shtml", "passage_text": "Current Status Licorice is considered expectorant, diuretic, antiinflammatory, and soothing to irritated mucous membranes; it is used in the treatment of inflamed lungs, as well as for gastric and duodenal ulcers. Its cough-suppressant activity resembles that of codeine."}, {"url": "http://umm.edu/health/medical/altmed/herb/licorice", "passage_text": "If you are taking any medication, ask your doctor before taking licorice. 1  ACE inhibitors and diuretics -- If you are taking angiotensin converting enzyme (ACE) inhibitors or diuretics for high blood pressure, you should not use licorice products."}, {"url": "http://umm.edu/health/medical/altmed/herb-interaction/possible-interactions-with-licorice", "passage_text": "If you are currently being treated with any of the following medications, you should not use licorice without first talking to your health care provider: 1  Ace-inhibitors and diuretics -- If you are taking angiotensin-converting enzyme (ACE) inhibitors or diuretics to regulate blood pressure, do not use licorice products."}, {"url": "http://umm.edu/health/medical/altmed/herb/licorice", "passage_text": "1 ACE inhibitors and diuretics -- If you are taking angiotensin converting enzyme (ACE) inhibitors or diuretics for high blood pressure, you should not use licorice products. 2  Licorice could cause these medications to not work as well or could make side effects worse, including a build up of potassium in the body."}, {"url": "http://blogs.webmd.com/breaking-news/2011/10/black-licorice-dangerous-candy.html", "passage_text": "The NIH warns people taking Coumadin (warfarin) never to eat black licorice, as licorice makes the drug less effective. And the NIH says licorice also may interfere with digoxin, estrogens, furosemide, blood pressure drugs, steroid drugs, and diuretics (water pills)."}, {"url": "http://umm.edu/health/medical/altmed/herb/licorice", "passage_text": "Licorice (Glycyrrhiza glabra) has been used in food and as medicine for thousands of years. Also known as sweet root, licorice root contains a compound that is about 50 times sweeter than sugar."}, {"url": "http://www.lifescript.com/health/a-z/drugs_a-z/druginteractions/l/loop_diuretics.aspx", "passage_text": "Licorice, too, affects potassium, and the combination of licorice and loop diuretics might cause unexpectedly rapid potassium loss. 8 However, the special form of licorice known as DGL (deglycyrrhizinated licorice) should not affect potassium levels."}, {"url": "http://umm.edu/health/medical/altmed/herb-interaction/possible-interactions-with-licorice", "passage_text": "1 Ace-inhibitors and diuretics -- If you are taking angiotensin-converting enzyme (ACE) inhibitors or diuretics to regulate blood pressure, do not use licorice products. 2  Licorice could interfere with the effectiveness of these medications or could worsen possible side effects."}, {"url": "http://www.allnatural.net/herbpages/licorice.shtml", "passage_text": "Source European licorice is the root of a member of the pea family native to Eurasia. Twenty species of Glycyrrhiza are found in Eurasia, North and South America, and Australia. At least six Chinese species are used as Chinese licorice (gan-cao or sweet herb), primarily G. uralensis."}, {"url": "http://www.webmd.com/vitamins-supplements/ingredientmono-881-LICORICE.aspx?activeIngredientId=881&activeIngredientName=LICORICE", "passage_text": "Licorice is a plant. You are probably most familiar with it as a flavoring in foods, beverages, and tobacco. The root is used to make medicine. Licorice is used for various digestive system complaints including stomach ulcers, heartburn, colic, and ongoing inflammation of the lining of the stomach (chronic gastritis)."}]