[{"url": "http://www.accountingtools.com/weighted-average-method", "passage_text": "When using the weighted average method, divide the cost of goods available for sale by the number of units available for sale, which yields the weighted-average cost per unit. In this calculation, the cost of goods available for sale is the sum of beginning inventory and net purchases. Weighted Average Method Overview. The weighted average method is used to assign the average cost of production to a product. Weighted average costing is commonly used in situations where: 1  Inventory items are so intermingled that it is impossible to assign a specific cost to an individual unit."}, {"url": "http://study.com/academy/lesson/calculating-weighted-average-method-formula-example.html", "passage_text": "To calculate a weighted average with percentages, each category value must first be multiplied by its percentage. Then all of these new values must be added together. In this example, we must multiply the student's average on all tests (83) by the % that the tests are worth toward the final grade (40%). However, this only works when all the items are weighted equally. For example, to calculate your average monthly electricity bill for a year, it would make sense to add up the billed amounts for the previous twelve months and divide by twelve since each bill cycle is roughly the same period of time (one month)."}, {"url": "http://accountingexplained.com/misc/corporate-finance/wacc", "passage_text": "In the formula for WACC, r(E) is the cost of equity i.e. the required rate of return on common stock of the company. It is the minimum rate of return which a company must earn to keep its common stock price from falling. Weighted Average Cost of Capital. Weighted average cost of capital (WACC) is the average of the minimum after-tax required rate of return which a company must earn for all of its security holders (i.e. common stock-holders, preferred stock-holders and debt-holders)."}, {"url": "http://www.onlinemathlearning.com/weighted-average-problems.html", "passage_text": "Another type of average problem involves the weighted average-which is the average of two or more terms that do not all have the same number of members. To find the weighted term, multiply each term by its weighting factor, which is the number of times each term occurs. The formula for weighted average is: Example: Step 1: To get the sum of weighted terms, multiply each average by the number of students that had that average and then sum them up. 80 × 10 + 60 × 15 = 800 + 900 = 1700. Step 2: Total number of terms = Total number of students = 25. Step 3: Using the formula."}, {"url": "http://www.wikihow.com/Calculate-Weighted-Average", "passage_text": "1. Multiply each number by its weight. 1  You can choose to write this at the end of the chart or to do it on 1 line, in a formula. 2  For example, if you are trying to figure out the weighted average of certain grades, you might write 0.9(0.25) to indicate a 90 percent grade times 25 percent of the total grade. A weighted average is a more accurate measurement of scores or investments that are of relative importance to each other. This is often the case with investment portfolios, grade scoring and other statistics. You can find out how to calculate weighted averages"}, {"url": "http://mathinsight.org/averages_weighted_averages_refresher", "passage_text": "For example, the weighted average of a list of numbers $x_1,\\ldots,x_n$ with corresponding weights $w_1,\\ldots,w_n$ is $${w_1\\cdot x_1+w_2\\cdot x_2+\\ldots+w_n\\cdot x_n\\over w_1+w_2+\\ldots+w_n}$$ Note that if the weights are all just $1$, then the weighted average is just a plain average. "}, {"url": "http://www.financeformulas.net/Weighted_Average.html", "passage_text": "The weighted average formula is used to calculate the average value of a particular set of numbers with different levels of relevance. The relevance of each number is called its weight. The weights should be represented as a percentage of the total relevancy. Say that 1 only happens 10% of the time while 2 and 3 each happen 45% of the time. The percentages in this example would be the weights. The weighted average would be 2.35. The weighted average formula is a general mathematical formula, but the following information will focus on how it applies to finance."}, {"url": "http://www.financeformulas.net/Weighted_Average.html", "passage_text": "This formula adds all of the numbers and divides by the amount of numbers. An example would be the average of 1,2, and 3 would be the sum of 1 + 2 + 3 divided by 3, which would return 2. However, the weighted average formula looks at how relevant each number is. Say that 1 only happens 10% of the time while 2 and 3 each happen 45% of the time. The percentages in this example would be the weights. The weighted average would be 2.35. The weighted average formula is a general mathematical formula, but the following information will focus on how it applies to finance."}]