[{"url": "https://en.wikipedia.org/wiki/Human_tongue", "passage_text": "The tongue is a muscular structure that forms part of the floor of the oral cavity. The left and right sides of the tongue are separated by the lingual septum. The human tongue is divided into anterior and posterior parts. The tongue's upper surface is also covered in numerous lingual papillae. It is sensitive and kept moist by saliva, and is richly supplied with nerves and blood vessels. In humans a secondary function of the tongue is phonetic articulation."}, {"url": "https://en.wikipedia.org/wiki/Human_tongue", "passage_text": "The tongue is a muscular hydrostat on the floor of the mouth of most vertebrates that manipulates food for mastication. It is the primary organ of taste (gustation), as much of its upper surface is covered in taste buds. The tongue's upper surface is also covered in numerous lingual papillae. It is sensitive and kept moist by saliva, and is richly supplied with nerves and blood vessels. In humans a secondary function of the tongue is phonetic articulation."}, {"url": "http://www.brainyquote.com/words/to/tongue230922.html", "passage_text": "1 Any small sole. 2  That which is considered as resembing an animal's tongue, in position or form. 3  A projection, or slender appendage or fixture; as, the tongue of a buckle, or of a balance. 4  A projection on the side, as of a board, which fits into a groove. 1 To speak; to utter. 2  To chide; to scold. 3  To modulate or modify with the tongue, as notes, in playing the flute and some other wind instruments. 4  To join means of a tongue and grove; as, to tongue boards together."}, {"url": "http://www.yourdictionary.com/appendage", "passage_text": "noun. The definition of an appendage, in relation to the body of a human or animal, is any part protruding from the torso or trunk. An example of an appendage is an arm or leg. An appendage is defined as an extra part that is attached to something. An example of an appendage is a leaf added to a dining table for extensio"}, {"url": "https://en.wiktionary.org/wiki/tongue", "passage_text": "1 In a shoe, the flap of material that goes between the laces and the foot, so called because it resembles a tongue in the mouth. 2  Any large or long physical protrusion on an automotive or machine part or any other part that fits into a long groove on another part. 3  A projection, or slender appendage or fixture. "}, {"url": "http://www.brainyquote.com/words/to/tongue230922.html", "passage_text": "1 A projection, or slender appendage or fixture; as, the tongue of a buckle, or of a balance. 2  A projection on the side, as of a board, which fits into a groove. 3  A point, or long, narrow strip of land, projecting from the mainland into a sea or a lake. 1 To speak; to utter. 2  To chide; to scold. 3  To modulate or modify with the tongue, as notes, in playing the flute and some other wind instruments. 4  To join means of a tongue and grove; as, to tongue boards together."}, {"url": "http://www.brainyquote.com/words/to/tongue230922.html", "passage_text": "1 That which is considered as resembing an animal's tongue, in position or form. 2  A projection, or slender appendage or fixture; as, the tongue of a buckle, or of a balance. 3  A projection on the side, as of a board, which fits into a groove. 1 To speak; to utter. 2  To chide; to scold. 3  To modulate or modify with the tongue, as notes, in playing the flute and some other wind instruments. 4  To join means of a tongue and grove; as, to tongue boards together."}, {"url": "http://www.brainyquote.com/words/to/tongue230922.html", "passage_text": "1 To chide; to scold. 2  To modulate or modify with the tongue, as notes, in playing the flute and some other wind instruments. 3  To join means of a tongue and grove; as, to tongue boards together. 4  To talk; to prate. 5  To use the tongue in forming the notes, as in playing the flute and some other wind instruments. 1 To speak; to utter. 2  To chide; to scold. 3  To modulate or modify with the tongue, as notes, in playing the flute and some other wind instruments. 4  To join means of a tongue and grove; as, to tongue boards together."}]