[{"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3675254/", "passage_text": "Background. Observation of a normal cavum septi pellucidi (CSP) is an important landmark in the second and third trimester prenatal ultrasound evaluation of the fetal brain, and its visualisation provides reassurance of normal central forebrain development."}, {"url": "http://radiopaedia.org/articles/dysgenesis-of-the-corpus-callosum", "passage_text": "The rostrum is the last part to be formed. In primary agenesis parts of the corpus callosum which form before the insult will be present whereas later parts will be absent."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3675254/", "passage_text": "• Cavum septi pellucidi (CSP) is an important landmark in the prenatal ultrasound evaluation of the fetal brain, and is a marker for normal central forebrain development. • Non-visualisation of the CSP is most commonly associated with other neuroanatomical abnormalities."}, {"url": "http://link.springer.com/article/10.1007%2FBF00219662", "passage_text": "Summary. The posterior horn of the lateral ventricle in the monkey brain varies in size in different individuals. In this part of the ventricle, the ependymal cells bear cilia, microvilli, microblebs and supraependymal, axon-like cell processes. Only slight differences are seen in the different parts of the posterior horn: The roof has densely packed cilia and microvilli."}, {"url": "http://link.springer.com/article/10.1007%2FBF00219662", "passage_text": "The medial wall shows no regional differences. Though larger areas are free of supraependymal cell processes, all ependymal structures (cilia, microvilli, microblebs) are present. In the posterior horn of only two animals were these larger spherical protrusions present which could be the result of a secretory process."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3675254/", "passage_text": "Common pitfalls in the sonographic evaluation of CSP include columns of the fornix that mimic CSP, and prominent cavum vergae that can simulate non-visualisation of the CSP. When non-visualisation of the CSP is suspected, magnetic resonance imaging (MRI) of the fetal brain can confirm and evaluate associated anomalies."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3675254/", "passage_text": "Non-visualisation of the CSP is a prenatal sonographic finding, which in most cases is associated with neuroanatomical anomalies that include agenesis of the corpus callosum, schizencephaly, septo-optic dysplasia, holoprosencephaly, chronic hydrocephalus and acquired fetal brain injury."}]