[{"url": "http://www.livestrong.com/article/3441-need-bruised-heel/", "passage_text": "To determine if the pain you feel when you walk is a bruised heel, take the painful foot in your hands and press gently on the middle of your heel with the pads of your thumbs. Increase the pressure steadily until you feel the pain. "}, {"url": "http://healingfeet.com/foot-pain/bone-bruise-recovery-time", "passage_text": "The recovery time for a bone bruise seen on MRI is typically two to three months. The best things you can do during this time is to take it easy, continue to use a wrap or brace, ice every 20 minutes as necessary, and elevate each night. The term “bone bruise” is actually a bit of a misnomer, since it’s actually a fracture in the innermost layer of the bone. The external layer of bone is very organized, solid and strong. Injuries to the outer bone may be called “occult” or “stress” fractures."}, {"url": "http://www.sportsinjuryclinic.net/sport-injuries/foot-heel-pain/bruised-heel-1", "passage_text": "A bruised heel, also known as 'policeman's heel' is a painful contusion or bruising to the tissues under the heel. A bruised heel is usually caused by overuse such as repetitive bounding, long-distance running or by impact-e.g landing heavily on the heel. Bruised heel recovery time. If you catch heel pain early and rest sufficiently, the recovery period should be relatively quick, with symptoms subsiding within a few days. If the first onset of pain is ignored and the fat pad gets damaged beyond easy repair then this is a very difficult injury to treat."}, {"url": "https://answers.yahoo.com/question/index?qid=20060925233433AAtxrY4", "passage_text": "Asker's rating. Report Abuse. Small bruises usually go away in a couple of days but big ones can take up to a couple of weeks. It all depends on how hard the impact was on the area of your body, and if the bruise is on a large muscular area or on bone. Sunseeker · 9 years ago. "}, {"url": "http://www.wisegeekhealth.com/how-do-i-treat-a-bruised-heel.htm", "passage_text": "A bone fracture, for example, may cause pain in the heel, and while some fractures can also be treated with the RICE treatment, more severe fractures will require more intensive treatments. Ad. Some people cannot stay off their feet long enough to allow the bruised heel to heal on its own, so orthotics may be necessary. Orthotics are devices that help restrict movement, support or cushion the affected area, and otherwise encourage healing by taking some of the stress off the heel. Athletes are susceptible to bruised heel injuries. Keeping feet elevated may help encourage blood flow to an injured heel, which will promote faster healing. Obtaining new, supportive footwear may help treat a bruised heel. An ice pack, which can help with"}, {"url": "http://www.buzzle.com/articles/bruised-heel-bone-symptoms.html", "passage_text": "With proper care, the bruised heel bone symptoms will subside gradually. Complete bruised heel recovery is usually achieved within 1-1½ months. Some patients may recover in just 4 weeks, while some may take as long as 3 months to recover. In case of persisting heel pain, one should consult an orthopedist. The health specialist may administer injections to soothe pain. In most of the cases, the associated symptoms of a bruise on the heel of a foot are soreness and inflammation. The person may not be able to move the foot. Being overweight and wearing ill-fitting footwear can contribute to bruised bone symptoms. In general, bruising of the heel bone is not a serious case."}, {"url": "http://www.sportsinjuryclinic.net/sport-injuries/foot-heel-pain/bruised-heel-1", "passage_text": "The heel bone-known medically as the calcaneus bone-is protected by a pad of fatty tissue. Repeated pounding of the heel can cause the surrounding fat pad to flatten and be displaced up the side of the heel leaving a thinner protective layer which may result in bruising of the bone and pain. Bruised heel recovery time. If you catch heel pain early and rest sufficiently, the recovery period should be relatively quick, with symptoms subsiding within a few days. If the first onset of pain is ignored and the fat pad gets damaged beyond easy repair then this is a very difficult injury to treat."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070716111156AAmO1KU", "passage_text": "I am 15 and about 2 years ago i fell out of a loft and have had back pain ever since, i had an MRI scan and today i got the results; the lower part of my spine is bruised. The consultant said that they don't know how long it will take to heal and its a very very rare case. It really depends on the bone and the extent of the bruising. I have recently had bruising to my first metatarsal and after 2 weeks of going non weight baring it healed. To be honest it seems rather odd that your spine is still bruised after 2 years."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_for_a_bruise_to_heel", "passage_text": "The time an injury takes to heal depends on how severe the injury is. However, it will usually take anywhere from a couple of days to several weeks. Keep cool compresses on … the area to reduce swelling as well as taking Ibuprofen. Also, use warm compresses to help with pain. A bruised lung, diaphragm, or pleura may take two to four weeks to heal, if there is no subsequent re-injury. Breathing difficulties may persist, however, for up to six months … in some injuries."}]