[{"url": "http://www.itweb.co.za/index.php?option=com_content&view=article&id=143408", "passage_text": "MTN call centre workers want an 8% salary increase. Around 3 000 CWU members downed tools outside MTN's Johannesburg head office last Wednesday after a call centre staff dispute over bonuses turned into a broader quarrel with the company about salary increases and weekend work. CWU members initially demanded a 10% salary increase, as well as a 16% bonus pay-out."}, {"url": "http://www.mountainview.gov/depts/comdev/economicdev/city_minimum_wage.asp", "passage_text": "Beginning July 1, 2015, employers who are subject to the Mountain View Business License Tax OR who maintain a facility in Mountain View must pay to each employee who performs at least two (2) hours of work per week in Mountain View, minimum wages not less than $ 10.30 per hour. 1 Starting July 1, 2015, the minimum wage in Mountain View is $10.30/hour. 2  Minimum wage rate will be adjusted annually on January 1. 3  Covered employees include anyone who performs 2 hours or more of work per week in Mountain View."}, {"url": "http://www.smartvoter.org/2006/11/07/ca/scl/meas/C/", "passage_text": "Mountain View voters approved a $250 per month salary in 1968 and increased it to $500 in 1984 when Mountain View's population was 62,800; the City had 418 employees and a total budget of $44.9 million. Today, our population is 71,995; the City employs 585 people with a budget of $193.4 million. Current council pay is $500 a month with the Mayor getting an additional 25%. There is no simple answer to the question of how much is enough. If you inflate the 1984 figure of $500 by the change in inflation, you get a value of $974 as an equal value pay in 2005."}, {"url": "http://www.mountainview.gov/depts/comdev/economicdev/city_minimum_wage.asp", "passage_text": "Give feedback on increasing Minimum Wage to $15 by 2018 here. Due to no increase in the Consumer Price Index, there will be no increase to the Mountain View minimum wage on January 1, 2016. The local minimum wage rate will remain $10.30 per hour. Read the FAQ on how minimum wage is adjusted annually. 1 Starting July 1, 2015, the minimum wage in Mountain View is $10.30/hour. 2  Minimum wage rate will be adjusted annually on January 1. 3  Covered employees include anyone who performs 2 hours or more of work per week in Mountain View."}, {"url": "http://www.itweb.co.za/index.php?option=com_content&view=article&id=143408", "passage_text": "Last week, MTN said it had reviewed some issues with a view to reaching an amicable and speedy solution to the impasse. This includes reviewing the current bonus model, which makes provision for an additional guaranteed 4% annual salary at the end of 2015 and a guaranteed 8.33% in March 2016 and every year thereafter. MTN has also reinstated canteen subsidies, which have been increased in response to employee feedback. Around 3 000 CWU members downed tools outside MTN's Johannesburg head office last Wednesday after a call centre staff dispute over bonuses turned into a broader quarrel with the company about salary increases and weekend work. CWU members initially demanded a 10% salary increase, as well as a 16% bonus pay-out."}, {"url": "http://businesstech.co.za/news/general/60647/biggest-salaries-in-sa-tech/", "passage_text": "The current top tech and telecoms earner – MTN Group CEO Safiso Dabengwa – took home a whopping R48 million for the company’s full year ended December 2013. Dabengwa’s massive pay jump was credited to share gains of R19.2 million, along with a higher bonus and relatively small increase in base salary. Dabengwa’s base salary was R8.9 million – up from R8.4 million in 2012. MTN South Africa lead Zunaid Bulbulia, who took up the position in June 2013, was paid a total R7.6 million off a base salary of R2.05 million for the year."}, {"url": "http://www.smartvoter.org/2006/11/07/ca/scl/meas/C/", "passage_text": "In November, Mountain View voters will decide whether to increase the salary for the City Council from $500 to $1500 per month. We encourage you to VOTE YES! - Increase the council salary to $1500 per month. Current council pay is $500 a month with the Mayor getting an additional 25%. There is no simple answer to the question of how much is enough. If you inflate the 1984 figure of $500 by the change in inflation, you get a value of $974 as an equal value pay in 2005."}, {"url": "http://peninsulapress.com/2014/10/21/mountain-view-minimum-wage-increase/", "passage_text": "Mountain View boosts its minimum wage to $10.30, with $15 goal by 2018. With a 6-1 vote in a special session, the Mountain View City Council approved an ordinance to increase the city minimum wage to $10.30 with annual adjustment to inflation, starting July 1, 2015. This new minimum wage is higher than the current California minimum wage, which is $9 per hour. The majority of the crowd asked the city council to raise minimum wage to $15 per hour. The city council voted to increase the minimum wage to $10.30 per hour, later that night. (Yuqing Pan/Peninsula Press). Mountain View adopted a minimum wage of $10.30 per hour on Oct. 9, with a goal to reach $15 by 2018."}]