[{"url": "http://www.ourdocuments.gov/doc.php?doc=40", "passage_text": "The 13th amendment, which formally abolished slavery in the United States, passed the Senate on April 8, 1864, and the House on January 31, 1865. On February 1, 1865, President Abraham Lincoln approved the Joint Resolution of Congress submitting the proposed amendment to the state legislatures. Lincoln recognized that the Emancipation Proclamation would have to be followed by a constitutional amendment in order to guarantee the abolishment of slavery. The 13th amendment was passed at the end of the Civil War before the Southern states had been restored to the Union and should have easily passed the Congress. Although the Senate passed it in April 1864, the House did not. At that point, Lincoln took an active role to ensure passage through congres"}, {"url": "https://en.wikipedia.org/wiki/Reconstruction_Amendments", "passage_text": "(Lincoln): A few more stitches Andy and the good old Union will be mended. The Reconstruction Amendments are the Thirteenth, Fourteenth, and Fifteenth amendments to the United States Constitution, adopted between 1865 and 1870, the five years immediately following the Civil War. The amendments were important in implementing the Reconstruction of the American South after the war. "}, {"url": "https://en.wikipedia.org/wiki/Thirteenth_Amendment_to_the_United_States_Constitution", "passage_text": "The Thirteenth Amendment (Amendment XIII) to the United States Constitution abolished slavery and involuntary servitude, except as punishment for a crime. In Congress, it was passed by the Senate on April 8, 1864, and by the House on January 31, 1865. Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction. Section 2. Congress shall have power to enforce this article by appropriate legislation."}, {"url": "http://www.history.com/topics/black-history/thirteenth-amendment", "passage_text": "Introduction. The 13th Amendment to the U.S. Constitution officially abolished slavery in America, and was ratified on December 6, 1865, after the conclusion of the American Civil War. On January 31, 1865, the amendment passed in the U.S. House of Representatives by a vote of 119 to 56, seven votes above the necessary two-thirds majority. Several Democrats abstained, but the 13th Amendment was sent to the states for ratification, which came on December 6, 1865."}, {"url": "http://www.history.com/topics/black-history/thirteenth-amendment", "passage_text": "A+E Networks. The 13th Amendment to the U.S. Constitution officially abolished slavery in America, and was ratified on December 6, 1865, after the conclusion of the American Civil War. On January 31, 1865, the amendment passed in the U.S. House of Representatives by a vote of 119 to 56, seven votes above the necessary two-thirds majority. Several Democrats abstained, but the 13th Amendment was sent to the states for ratification, which came on December 6, 1865."}, {"url": "http://www.greatamericanhistory.net/amendment.htm", "passage_text": "by Gordon Leidner of Great American History. The 13th Amendment to the United States Constitution, passed by the Senate on April 8, 1864, by the House on January 31, 1865, and ratified on December 6, 1865, abolished slavery as a legal institution. The Thirteenth Amendment, in direct terminology, put an end to this. The amendment states: Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction."}, {"url": "http://www.history.com/this-day-in-history/13th-amendment-ratified", "passage_text": "On this day in 1865, the 13th Amendment to the U.S. Constitution, officially ending the institution of slavery, is ratified. “Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction.” With these words, the single greatest change wrought by the Civil War was officially noted in theConstitution."}, {"url": "http://www.answers.com/Q/Did_the_thirteenth_amendment_end_the_civil_war", "passage_text": "Freed slaves, and abolished slavery The thirteenth amendment to the U.S. Constitution abolished slavery and all other forms of involuntary servitude, excluding involuntary lab … or as punishment for a crime. Section 1. The answer is the Thirteenth, Fourteenth and Fifteenth Amendments were all passed after the war. The Thirteenth Amendment abolished all forms of involuntary servitude. The Fo … urteenth Amendment established equal forms of citizenship and protection for all."}, {"url": "http://www.greatamericanhistory.net/amendment.htm", "passage_text": "The history behind this amendments adoption is an interesting one. Prior to the Civil War, in February 1861, Congress had passed a Thirteenth Amendment for an entirely different purpose--to guarantee the legality and perpetuity of slavery in the slave states, rather than to end it. The Thirteenth Amendment, in direct terminology, put an end to this. The amendment states: Neither slavery nor involuntary servitude, except as a punishment for crime whereof the party shall have been duly convicted, shall exist within the United States, or any place subject to their jurisdiction."}]