[{"url": "http://www.brighthub.com/science/medical/articles/75279.aspx", "passage_text": "Blood contains different clotting factors which are essential for hemostasis. Hemostasis is the process of clot formation, tissue repair and clot dissolution. Clot formation is important in cases of injuries in order to control bleeding and prevent loss of blood. "}, {"url": "http://www.heart.org/HEARTORG/Conditions/More/What-Is-Excessive-Blood-Clotting-Hypercoagulation_UCM_448768_Article.jsp", "passage_text": "Some Possible Effects of Blood Clots Include: Also in this section: When you get a cut or wound, your body forms blood clots, a thickened mass of blood tissue, to help stop the bleeding. Proteins in your blood called fibrins work with small blood cell fragments called platelets, to form the clot."}, {"url": "http://www.hematology.org/Patients/Clots/", "passage_text": "Blood Clots. Blood clotting, or coagulation, is an important process that prevents excessive bleeding when a blood vessel is injured. Platelets (a type of blood cell) and proteins in your plasma (the liquid part of blood) work together to stop the bleeding by forming a clot over the injury. "}, {"url": "http://www.webmd.com/a-to-z-guides/partial-thromboplastin-time", "passage_text": "1 Another test, the activated partial thromboplastin time (APTT) test, may be used to find out if the right dose of heparin is being used. 2  Low levels of blood clotting factors. 3  A change in the activity of any of the clotting factors. 4  The absence of any of the clotting factors. Why It Is Done. Partial thromboplastin time (PTT) is done to: 1  Find a cause of abnormal bleeding or bruising. 2  Check for low levels of blood clotting factors. 3  The lack of some clotting factors can cause bleeding disorders such as hemophilia. 4  Check for conditions that cause clotting problems."}, {"url": "https://www.sharecare.com/health/blood-clot-thrombus/what-does-mean-ptinr-high", "passage_text": "If your PT/INR test result is too high, it means that your blood is clotting too slowly, and you are at risk of bleeding. Your dose of warfarin is too high. On the other hand, if your PT/INR test result is too low, your dose of warfarin may not be enough to protect your blood from clotting. In that case, your warfarin dose would be increased. Your doctor will increase or decrease the dose according to your PT/INR test result"}, {"url": "http://www.webmd.com/a-to-z-guides/partial-thromboplastin-time", "passage_text": "1 Blood-thinning medicine, such as heparin. 2  Another test, the activated partial thromboplastin time (APTT) test, may be used to find out if the right dose of heparin is being used. 3  Low levels of blood clotting factors. 4  A change in the activity of any of the clotting factors. 5  The absence of any of the clotting factors. Why It Is Done. Partial thromboplastin time (PTT) is done to: 1  Find a cause of abnormal bleeding or bruising. 2  Check for low levels of blood clotting factors. 3  The lack of some clotting factors can cause bleeding disorders such as hemophilia. 4  Check for conditions that cause clotting problems."}, {"url": "https://labtestsonline.org/understanding/analytes/coagulation-factors/tab/test", "passage_text": "It is used by health care providers to determine if the level of a factor is low or absent (below the detectable limit), associated with reduced clot formation and bleeding, or too high, sometimes associated with too much clot formation and thrombosis. Low activity of one or more coagulation factors usually means impaired clotting ability. Each coagulation factor must be present in sufficient quantity in order for normal clotting to occur, but the level required is different for each factor."}, {"url": "http://www.healthgrades.com/symptoms/high-platelets", "passage_text": "In many cases, high platelets may not produce specific symptoms. In other cases, the elevation in platelet levels leads to the development of unwanted and unnecessary blood clotting throughout the body, which can produce a number of symptoms. The presence of high platelets is rarely associated with a medical emergency. High platelets is a condition in which the blood contains more platelets than normal. Platelets are small blood cell fragments that assist in blood clotting. In a healthy person, there are usually 150,000 to 450,000 platelets per microliter of blood. A high platelet count can be identified through routine blood tests"}]