[{"url": "https://en.wikipedia.org/wiki/Prohibition_in_the_United_States", "passage_text": "Prohibition was mandated under the Eighteenth Amendment to the United States Constitution. Enabling legislation, known as the Volstead Act, set down the rules for enforcing the ban and defined the types of alcoholic beverages that were prohibited. (This act, which had been intended to save grain for the war effort, was passed after the armistice ending World War I was signed on November 11, 1918.) The Wartime Prohibition Act took effect June 30, 1919, with July 1, 1919, becoming known as the Thirsty-First."}, {"url": "http://www.history.com/topics/prohibition", "passage_text": "Ratified on January 29, 1919, the 18th Amendment went into effect a year later, by which time no fewer than 33 states had already enacted their own prohibition legislation. In October 1919, Congress passed the National Prohibition Act, which provided guidelines for the federal enforcement of Prohibition. FDR’s victory meant the end for Prohibition, and in February 1933 Congress adopted a resolution proposing a 21st Amendment to the Constitution that would repeal the 18th. The amendment was submitted to the states, and in December 1933 Utah provided the 36th and final necessary vote for ratification."}, {"url": "http://www.history.com/this-day-in-history/congress-enforces-prohibition", "passage_text": "Publisher. A+E Networks. Congress passes the Volstead Act over President Woodrow Wilson’s veto. The Volstead Act provided for the enforcement of the 18th Amendment to the U.S. Constitution, also known as the Prohibition Amendment. The movement for the prohibition of alcohol began in the early 19th century, when Americans concerned about the adverse effects of drinking began forming temperance societies."}, {"url": "http://www.rustycans.com/HISTORY/prohibition.html", "passage_text": "The 18th Amendment and the Volstead Act. The Anti-Saloon league, through its allies in Congress, introduced the Prohibition Amendment in 1917. It was submitted to the House of Representatives on April 4, 1917. The Senate received the resolution on July 30, 1917 and passed it August 1 by a vote of 65 to 20."}, {"url": "http://www.digitalhistory.uh.edu/disp_textbook.cfm?smtID=2&psid=3383", "passage_text": "In December 1917, Congress passed the 18th Amendment. A month later, President Woodrow Wilson instituted partial prohibition to conserve grain for the war effort. Beer was limited to 2.75 percent alcohol content, and production was held to 70 percent of the previous year's production. In September, the president issued a ban on the wartime production of beer"}, {"url": "http://www.answers.com/Q/Who_was_the_US_President_during_prohibition", "passage_text": "1 The Prohibition of Alcohol: Bootleggers The prohibition of alcohol in the United States was a result of the passage of the 18th Amendment to the Constitution. 1 A Brief History on the Prohibition of Alcohol In 1920, the National Prohibition Act was implemented in the United States. 2  This act banned the manufacture, sale and transportation of alcohol within the country."}, {"url": "http://www.answers.com/Q/Who_was_the_US_President_during_prohibition", "passage_text": "1 The Effects of Prohibition on American Society From 1920 to 1933, the United States prohibited the sale and manufacture of alcohol by means of the 18th amendment to the Constitution. 2  The ban on alcohol was very difficult …. 1 A Brief History on the Prohibition of Alcohol In 1920, the National Prohibition Act was implemented in the United States. 2  This act banned the manufacture, sale and transportation of alcohol within the country."}, {"url": "https://en.wikipedia.org/wiki/Prohibition_in_the_United_States", "passage_text": "Prohibition in the United States was a nationwide constitutional ban on the sale, production, importation, and transportation of alcoholic beverages that remained in place from 1920 to 1933. (This act, which had been intended to save grain for the war effort, was passed after the armistice ending World War I was signed on November 11, 1918.) The Wartime Prohibition Act took effect June 30, 1919, with July 1, 1919, becoming known as the Thirsty-First."}, {"url": "http://www.woodrowwilsonhouse.org/constitutional-amendments", "passage_text": "Constitutional Amendments. During Wilson’s eight years as president, Congress passed two constitutional amendments: prohibition (18th); and women’s suffrage (19th). Wilson vetoed the Volstead Act (the 18th amendment), believing it to be unenforceable, but the law, designed to enforce Prohibition, was passed over his veto. "}, {"url": "http://www.answers.com/Q/Who_was_the_US_President_during_prohibition", "passage_text": "The National Prohibition Act of 1919 (commonly called the Volstead Act) was en … abling legislation enacted to provide for the implementation of the Eighteenth Amendment to the U.S. Constitution, which established National Prohibition of alcoholic beverages. 1 A Brief History on the Prohibition of Alcohol In 1920, the National Prohibition Act was implemented in the United States. 2  This act banned the manufacture, sale and transportation of alcohol within the country."}]