[{"url": "https://en.wikipedia.org/wiki/Digestive_enzyme", "passage_text": "1 It is produced by the stomach cells called chief cells in its inactive form pepsinogen, which is a zymogen. 2  Pepsinogen is then activated by the stomach acid into its active form, pepsin. 3  Pepsin breaks down the protein in the food into smaller particles, such as peptide fragments and amino acids. 1 Gastric Lipase: Gastric lipase is an acidic lipase secreted by the gastric chief cells in the fundic mucosa in the stomach. 2  It has a pH optimum of 3-6. 3  Gastric lipase, together with lingual lipase, comprise the two acidic lipases."}, {"url": "https://en.wikipedia.org/wiki/Digestive_enzyme", "passage_text": "Digestive enzymes are diverse and are found in the saliva secreted by the salivary glands, in the stomach secreted by cells lining the stomach, in the pancreatic juice secreted by pancreatic exocrine cells, and in the intestinal (small and large) secretions, or as part of the lining of the gastrointestinal tract. 1 Gastric Lipase: Gastric lipase is an acidic lipase secreted by the gastric chief cells in the fundic mucosa in the stomach. 2  It has a pH optimum of 3-6. 3  Gastric lipase, together with lingual lipase, comprise the two acidic lipases."}, {"url": "https://en.wikipedia.org/wiki/Secretin", "passage_text": "In addition, secretin stimulates pepsinogen secretion from chief cells, which can help break down proteins in food digestion. It stimulates release of glucagon, pancreatic polypeptide and somatostatin. Secretin is produced in the S cells of the duodenum, which are located in the intestinal glands. In humans, the secretin peptide is encoded by the SCT gene."}, {"url": "http://www.innerbody.com/image/endo03.html", "passage_text": "The pancreas is a glandular organ in the upper abdomen, but really it serves as two glands in one: a digestive exocrine gland and a hormone-producing endocrine gland. Functioning as an exocrine gland, the pancreas excretes enzymes to break down the proteins, lipids, carbohydrates, and nucleic acids in food. Functioning as an endocrine gland, the pancreas secretes the hormones insulin and glucagon to control blood sugar levels throughout the day. "}, {"url": "https://quizlet.com/4848232/digestive-system-17-flash-cards/", "passage_text": "As more food enters the small intestine, secretion of gastric juice from stomach wall is reflexly inhibited (somatostatin). (Presence of fats & proteins in the upper small intestine causes the release of Cholecystokinin from the intestinal wall, which decreases gastric mobility. secretin. A hormone secreted by the small intestine (duodenum) in response to low pH (e.g., from stomach acid). It promotes the release of bicarbonate from the pancreas to act as a buffer."}, {"url": "https://en.wikipedia.org/wiki/Digestive_enzyme", "passage_text": "There are four types of cells in the stomach: 1  Parietal cells: Produce hydrochloric acid and intrinsic factor. 2  Gastric chief cells: Produce pepsinogen. 3  Chief cells are mainly found in the body of stomach, which is the middle or superior anatomic portion of the stomach. 1 Gastric Lipase: Gastric lipase is an acidic lipase secreted by the gastric chief cells in the fundic mucosa in the stomach. 2  It has a pH optimum of 3-6. 3  Gastric lipase, together with lingual lipase, comprise the two acidic lipases."}, {"url": "http://www.yourhormones.info/hormones/cholecystokinin.aspx", "passage_text": "Cholecystokinin is a gut hormone released after a meal, which helps digestion and reduces appetite. Alternative names for cholecystokinin Cholecystokinin used to be known as pancreozymin due to its actions on the pancreas but now it is commonly abbreviated to CCK; CCK-PZ."}, {"url": "https://en.wikipedia.org/wiki/Cholecystokinin", "passage_text": "CCK mediates digestion in the small intestine by inhibiting gastric emptying and decreasing gastric acid secretion. It stimulates the acinar cells of the pancreas to release digestive enzymes and stimulates the secretion of a juice rich in pancreatic digestive enzymes, hence the old name pancreozymin. CCK identified at bottom right. Cholecystokinin (CCK or CCK-PZ; from Greek chole, bile; cysto, sac; kinin, move; hence, move the bile-sac (gallbladder)) is a peptide hormone of the gastrointestinal system responsible for stimulating the digestion of fat and protein."}, {"url": "http://www2.estrellamountain.edu/faculty/farabee/biobk/BioBookDIGEST.html", "passage_text": "The upper part, the duodenum, is the most active in digestion. Secretions from the liver and pancreas are used for digestion in the duodenum. Epithelial cells of the duodenum secrete a watery mucus. The pancreas secretes digestive enzymes and stomach acid-neutralizing bicarbonate. The liver produces bile, which is stored in the gall bladder before entering the bile duct into the duodenum. Digestion of carbohydrates, proteins, and fats continues in the small intestine. "}, {"url": "http://www.innerbody.com/image/dige02.html", "passage_text": "1 In the duodenum, the bulk of digestion is completed thanks to the preparation of chyme by the stomach and the addition of secretions from the gallbladder and pancreas. 2  Bile from the gallbladder acts as an emulsifier to break large masses of fats into smaller masses. 1 Mucous cells produce mucus and bicarbonate ion that cover the surface of the stomach lining, protecting the underlying cells from the damaging effects of hydrochloric acid and digestive enzymes. 2  Parietal cells produce hydrochloric acid to digest foods and kill pathogens that enter the body through the mouth."}]