[{"url": "http://geology.com/rocks/granite.shtml", "passage_text": "In the commercial stone industry a granite is a rock with visible grains that is harder than a marble. Under this definition gabbro, basalt, pegmatite, schist, gneiss, syenite, monzonite, anorthosite, grannodiorite, diabase, diorite and many other rocks will be called granite. It forms from the slow crystallization of magma below Earth’s surface. Granite is composed mainly of quartz and feldspar with minor amounts of mica, amphiboles and other minerals. This mineral composition usually gives granite a red, pink, gray or white color with dark mineral grains visible throughout the rock."}, {"url": "https://en.wikipedia.org/wiki/Gastrolith", "passage_text": "A gastrolith, also called a stomach stone or gizzard stones, is a rock held inside a gastrointestinal tract. Gastroliths in some species are retained in the muscular gizzard and used to grind food in animals lacking suitable grinding teeth. Domestic fowl require access to grit. Stones swallowed by ostriches can exceed a length of 10 centimetres (3.9 in). Amphibians such as the Axolotl are also known to deliberately ingest rocks that are presumed to be gastroliths. Apparent microgastroliths have also been found in frog tadpoles."}, {"url": "http://rocktumbler.com/polished-stones/", "passage_text": "Yellow Jasper is an opaque yellow to yellow-brown-beige chalcedony that can be polished to a very high luster. These stones, produced from material mined in South Africa, show some dark brown to cream color zones that produce a scenic pattern. Shop for Yellow Jasper. The grossularite garnet used to make tumbled stones, beads and carvings is an opaque, massive garnet that often has an attractive green color. Much of it is found in South Africa where it has been inappropriately called Transvaal Jade (it is not jade and has no mineral relationship with jade)."}, {"url": "https://en.wikipedia.org/wiki/Rock_polishing", "passage_text": "Rock polishing is a lapidary process whereby rough stone is polished and smoothed by hand or using simple machines to produce attractive stones. The most common means is tumble polishing, but there is also vibratory finishing. At the end of the process the stones have a slight luster when dry. The final two steps are the polish and in some cases the burnishing. In the polishing step, rock polish is added in place of grit as well as the plastic tumbling pellets. After further tumbling the rocks should now have a shiny look when dry. If this is not the case and the rocks appear to have a film on them, a burnishing may be necessary"}, {"url": "http://rocktumbler.com/polished-stones/", "passage_text": "Obsidian is a natural volcanic glass that can be polished to a very high luster. Some stones of obsidian contain white crystals of the mineral cristobalite. When polished these stones produce a gemstone known as snowflake obsidian. The grossularite garnet used to make tumbled stones, beads and carvings is an opaque, massive garnet that often has an attractive green color. Much of it is found in South Africa where it has been inappropriately called Transvaal Jade (it is not jade and has no mineral relationship with jade)."}, {"url": "http://rocktumbler.com/polished-stones/", "passage_text": "Granite is an intrusive igneous rock that is composed of quartz and feldspar with minor amounts of micas, amphiboles and other minerals. It can be pink, white or gray in color. Although the minerals in granite have various hardnesses, it can easily be tumbled into attractive stones. The grossularite garnet used to make tumbled stones, beads and carvings is an opaque, massive garnet that often has an attractive green color. Much of it is found in South Africa where it has been inappropriately called Transvaal Jade (it is not jade and has no mineral relationship with jade)."}, {"url": "http://saltthesandbox.org/rocks/names.htm", "passage_text": "POLISHED ROCKS: Go here to learn the names of rocks commonly sold as polished pebbles in rock shops, museum stores, and over the Internet. Select one of the links above and you will find photos and descriptions that will help you identify common rocks found in cities and suburbs in the Midwestern United States. "}, {"url": "https://en.wikipedia.org/wiki/Rock_polishing", "passage_text": "To effectively polish rocks in a tumbler the rocks must all be of the same approximate hardness. Rocks are placed into a tumbling barrel with varying degrees of abrasive grit and or water. Depending on the hardness of the rocks each step in the tumbling process can take place over a number of days. At the end of the process the stones have a slight luster when dry. The final two steps are the polish and in some cases the burnishing. In the polishing step, rock polish is added in place of grit as well as the plastic tumbling pellets. After further tumbling the rocks should now have a shiny look when dry. If this is not the case and the rocks appear to have a film on them, a burnishing may be necessary"}, {"url": "http://rocktumbler.com/polished-stones/", "passage_text": "Dumortierite is a bright blue, dark blue or greenish-blue mineral that is occasionally found in metamorphic rocks. It can be polished to a high luster and is one of just a few blue minerals that are hard enough to be used as a gemstone. The stones shown here were produced from material mined in Mozambique (Africa). The grossularite garnet used to make tumbled stones, beads and carvings is an opaque, massive garnet that often has an attractive green color. Much of it is found in South Africa where it has been inappropriately called Transvaal Jade (it is not jade and has no mineral relationship with jade)."}]