[{"url": "http://www.ideafinder.com/history/inventors/westinghouse.htm", "passage_text": "The first air brake invented by George Westinghouse in 1869 revolutionized the railroad industry, making braking a safer venture and thus permitting trains to travel at higher speeds."}, {"url": "http://www.biography.com/people/george-westinghouse-9528497", "passage_text": "Synopsis. George Westinghouse was born October 6, 1846 in Central Bridge, New York. After serving in the Union Army and Navy, Westinghouse patented several devices, particularly for railroads. He would eventually start the Westinghouse Electric & Manufacturing Company to improve AC power generators."}, {"url": "http://www.pbs.org/wgbh/theymadeamerica/whomade/westinghouse_hi.html", "passage_text": "George Westinghouse was instrumental in increasing the safety of the American railroad system and encouraging the growth of the transportation industry. He was born in Central Bridge, New York, in 1846. With access to his father's machinery shop, Westinghouse developed a fascination with steam engines."}, {"url": "http://www.ideafinder.com/history/inventors/westinghouse.htm", "passage_text": "George Westinghouse Virtual Museum In the field of electricity he was not an inventor of fundamentals. He invented many useful details, but his great work was in stimulating, combining, and directing the work of other men."}, {"url": "https://www.asme.org/engineering-topics/articles/energy/george-westinghouse", "passage_text": "George Westinghouse. Westinghouse: Most think it's the name of a company. But the name, with George attached ought to loom as large as that of Edison or any other inventor. He made his start with railway equipment, most notably the air brake."}, {"url": "http://www.famousinventors.org/george-westinghouse", "passage_text": "George Westinghouse invented “Railway Air Brake”. George Westinghouse was an American inventor, industrialist and engineer who was a pioneer in the field of railway transport and electricity. He was born in New York in 1846. Young George was a talented mechanic and helped his father in manufacturing agricultural machinery."}]