[{"url": "http://www.livestrong.com/article/140464-how-many-calories-are-one-tablespoon-sugar/", "passage_text": "Sweet Talk. One teaspoon of sugar contains 16 calories, and 1 tablespoon (which equals 3 teaspoons) contains 48 calories, with all the calories coming from carbohydrates. There are many ways to lessen added sugar in your diet."}, {"url": "http://www.benefits-of-honey.com/calorie-in-honey.html", "passage_text": "One tablespoon of honey has 64 calories, and one tablespoon of sugar has 46 calories. (Or has 22 calories in one teaspoon of honey versus 16 calories in one teaspoon of table sugar.) While the amount of calorie in honey is more, we actually use less of it since it is sweeter than"}, {"url": "http://www.livestrong.com/article/140464-how-many-calories-are-one-tablespoon-sugar/", "passage_text": "Sugar should be consumed in moderation, with the American Heart Association recommending no more than 6 teaspoons for women and 9 teaspoons for men each day. One teaspoon of sugar contains 16 calories, and 1 tablespoon (which equals 3 teaspoons) contains 48 calories, with all the calories coming from carbohydrates. There are many ways to lessen added sugar in your diet."}, {"url": "http://www.answers.com/Q/How_many_calories_in_one_tablespoon_of_brown_sugar", "passage_text": "One teaspoon of granulated sugar contains 15 calories.   There are 3 teaspoons in a tablespoon, so there are 45 calories in a tablespoon of sugar."}, {"url": "http://www.answers.com/Q/How_many_calories_in_one_tablespoon_sugar", "passage_text": "Confidence votes 4. One teaspoon of granulated sugar contains 15 calories. There are 3 teaspoons in a tablespoon, so there are 45 calories in a tablespoon of sugar."}, {"url": "http://www.livestrong.com/article/306026-the-calories-in-one-tablespoon-of-brown-sugar/", "passage_text": "A 1-tbsp. serving of brown sugar contains 52 calories, according to the U.S. Department of Agriculture National Nutrient Database. Based on the USDA-recommended diet of 2,000 calories per day, this accounts for 2.6 percent of the calories you should consume in a day."}, {"url": "http://healthyeating.sfgate.com/many-calories-one-tablespoon-sugar-2094.html", "passage_text": "One tablespoon of sugar is equivalent to 3 teaspoons. Approximately 350 calories of the average American’s daily intake come from added sugars, an amount that’s more than double and triple the recommended daily limit for most men and women, respectively, according to the American Heart Association."}]