[{"url": "http://www.allaboutvision.com/eye-exam/expect.htm", "passage_text": "A comprehensive eye exam can take an hour or more, depending on the doctor and the number and complexity of tests required to fully evaluate your vision and the health of your eyes. A screening test that checks your color vision often is performed early in a comprehensive eye exam to rule out color blindness. In addition to detecting hereditary color vision deficiencies, color blind tests also can alert your eye doctor to possible eye health problems that may affect your color vision."}, {"url": "http://www.allaboutvision.com/eye-exam/expect.htm", "passage_text": "It's important to understand that a comprehensive eye exam typically does not include a contact lens fitting, and therefore you will not be given a contact lens prescription at the end of a routine eye exam. A screening test that checks your color vision often is performed early in a comprehensive eye exam to rule out color blindness. In addition to detecting hereditary color vision deficiencies, color blind tests also can alert your eye doctor to possible eye health problems that may affect your color vision."}, {"url": "http://www.allaboutvision.com/eye-exam/preparing.htm", "passage_text": "The cost of an eye exam can vary significantly, based on where you get your exam and other factors, including: 1  Whether the exam is performed by an optometrist or an ophthalmologist. 2  The tests that are included in the exam. 3  Whether the exam includes a contact lens fitting or other contact lens-related services. Also, eye exams for contact lenses nearly always cost more than routine eye exams to update your eyeglasses prescription. When comparing how much an eye exam costs, be sure you are comparing apples to apples.. A comprehensive eye exam should include at least the following:"}, {"url": "http://www.metroicare.com/frequently-asked-questions-about-eye-exams/", "passage_text": "A comprehensive eye exam will usually last up to an hour. During this time your optometrist will painlessly check and evaluate every component of your vision. The first test is typically that of visual acuity, which is a measurement of how well you see. "}, {"url": "http://health.costhelper.com/eye-exam.html", "passage_text": "1 For some, the vision plan covers the full cost of a regular annual eye exam. 2  Other plans charge a copay of $5 to $35. 3  Some clinics have a separate charge for retraction, a test that determines the patient's prescription. 4  This varies by clinic, ranging from $15 to $40 at the Main Line Eye Specialists. 1 The cost varies depending upon the clinic and region of the country. 2  Lakewood Family Eye Care clinic, in Lakewood Ranch, Fla., charges $109 for an eye exam for those without insurance. 3  Discount clinics, such as those at WalMart, can charge as little as $50 for an eye exam."}, {"url": "http://www.allaboutvision.com/eye-exam/preparing.htm", "passage_text": "Adults. To maintain a lifetime of healthy vision, the AOA recommends a comprehensive eye exam every two years for adults ages 18 to 60, and annual exams for seniors age 61 and older. At risk adults should have more frequent exams. Also, eye exams for contact lenses nearly always cost more than routine eye exams to update your eyeglasses prescription. When comparing how much an eye exam costs, be sure you are comparing apples to apples.. A comprehensive eye exam should include at least the following:"}, {"url": "https://www.vsp.com/contact-lens-exam.html", "passage_text": "Comprehensive Eye Exam. A comprehensive eye exam is an important part of caring for your overall health whether you need vision correction or not. By looking into your eyes, your doctor can check for signs of serious health conditions like hypertension and diabetes. "}, {"url": "http://www.doctorsvisioncenter.com/information-center/faqs/how-much-does-an-eye-exam-cost/", "passage_text": "A comprehensive eye examination will cost between $75 – $180 dollars, depending on the complexity of the problem. As with any medical examination, the total cost will relate to the time spent and the nature of the presenting problem(s). "}, {"url": "https://nei.nih.gov/healthyeyes/eyeexam", "passage_text": "Key elements of a comprehensive dilated eye examination include dilation, tonometry, visual field test and a visual acuity test. Dilation is an important part of a comprehensive eye exam because it enables your eye care professional to view the inside of the eye. In a person with glaucoma, the dilated exam may show changes in the shape and color of the optic nerve fibers. The exam may also show excessive cupping of the optic disc, the place where the optic nerve fibers exit the eye and enter the brain. Tonometry is a test that helps detect glaucoma."}, {"url": "http://www.allaboutvision.com/eye-exam/preparing.htm", "passage_text": "Generally, eye exam costs can range from less than $50 (usually at a retail store or optical chain) to $100 or more (usually at a medical clinic or private eye doctor's office). Also, eye exams for contact lenses nearly always cost more than routine eye exams to update your eyeglasses prescription. When comparing how much an eye exam costs, be sure you are comparing apples to apples.. A comprehensive eye exam should include at least the following:"}]