[{"url": "https://en.wikipedia.org/wiki/DNA", "passage_text": "Deoxyribonucleic acid (/diˌɒksiˌraɪbɵ.njuːˌkleɪ.ɨk ˈaesɪd/ ; ˈæSɪD) dna is a molecule that carries most of the genetic instructions used in the, development functioning and reproduction of all known living organisms and many. viruses The backbone of the DNA strand is made from alternating phosphate and sugar residues. The sugar in DNA is 2-deoxyribose, which is a pentose (five-carbon) sugar. The sugars are joined together by phosphate groups that form phosphodiester bonds between the third and fifth carbon atoms of adjacent sugar rings. These asymmetric bonds mean a strand of DNA has a direction."}, {"url": "https://askabiologist.asu.edu/dna-shape-and-structure", "passage_text": "A closer look at the chemical structure of DNA includes the four nitrogenous bases Adenine (A), Thymine (T), Guanine (G), and Cytosine (C). DNA also includes sugars and phosphate groups that make the phosphate-deoxyribose backbone. If you think of the structure of DNA as a twisted ladder, the rungs of the ladder are made from the nitrogenous bases. These bases pair up to make each step of the ladder. They also only pair up in a specific way. "}, {"url": "http://lurgio.wikispaces.com/file/view/dna_structure_ws.pdf", "passage_text": "Phosphate Sugar Nitrogen Base Nucleotide Base pair Hydrogen bond A nucleotide is made of three parts. These three parts are: 1. _____________________ 2. _____________________ 3. ___________________ Write out the full name for DNA. "}, {"url": "http://science.howstuffworks.com/life/cellular-microscopic/dna1.htm", "passage_text": "DNA Structure. ­DNA is o­ne of the nucleic acids, information-containing molecules in the cell (ribonucleic acid, or RNA, is the other nucleic acid). DNA is found in the nucleus of every human cell. (See the sidebar at the bottom of the page for more about RNA and different types of cells). The base pairs in DNA are adenine with thymine and cytosine with guanine. DNA has a spiral staircase-like structure. The steps are formed by the nitrogen bases of the nucleotides where adenine pairs with thymine and cytosine with guanine. Photo courtesy U.S. National Library of Medicine."}, {"url": "http://www.chemguide.co.uk/organicprops/aminoacids/dna1.html", "passage_text": "Exploring a DNA chain The sugars in the backbone The backbone of DNA is based on a repeated pattern of a sugar group and a phosphate group. The full name of DNA, deoxyribonucleic acid, gives you the name of the sugar present-deoxyribose. Deoxyribose is a modified form of another sugar called ribose. This page, looking at the structure of DNA, is the first in a sequence of pages leading on to how DNA replicates (makes copies of) itself, and then to how information stored in DNA is used to make protein molecules."}, {"url": "http://www.answers.com/Q/What_are_the_3_parts_of_DNA_nucleotide", "passage_text": "The DNA nucleotide consists of three parts: a phosphate group, a  5-carbon sugar, and a nitrogenous base. The portion of the  nucleotide that contains a negative charge is t … he phosphate group. A nucleotide is the building block (or monomer) of a nucleic acid chian The three parts of a nucleotide are: A base-A, T, G or C in terms of DNA and U insted of T in RNAA su … gar-deoxyribose in DNA and ribose in RNAA phosphate group. 7 people found this useful. Answered."}, {"url": "http://www.answers.com/Q/What_are_the_3_parts_of_DNA_nucleotide", "passage_text": "The three components that create a DNA nucleotide are a phosphate group, a nitrogenous base [this will be either Adenine, Guanine, Cytosine, or Thymine], and a Sugar [deoxyrib … ose, which is how we get the D in DNA]. A nucleotide is the building block (or monomer) of a nucleic acid chian The three parts of a nucleotide are: A base-A, T, G or C in terms of DNA and U insted of T in RNAA su … gar-deoxyribose in DNA and ribose in RNAA phosphate group. 7 people found this useful. Answered."}, {"url": "http://science.howstuffworks.com/life/cellular-microscopic/dna1.htm", "passage_text": "Each nucleotide consists of a sugar (deoxyribose) bound on one side to a phosphate group and bound on the other side to a nitrogenous base. There are two classes of nitrogen bases called purines (double-ringed structures) and pyrimidines (single-ringed structures). The four bases in DNA's alphabet are: The base pairs in DNA are adenine with thymine and cytosine with guanine. DNA has a spiral staircase-like structure. The steps are formed by the nitrogen bases of the nucleotides where adenine pairs with thymine and cytosine with guanine. Photo courtesy U.S. National Library of Medicine."}, {"url": "https://en.wikipedia.org/wiki/DNA", "passage_text": "The two DNA strands are known as polynucleotides since they are composed of simpler units called nucleotides. Each nucleotide is composed of a nitrogen-containing nucleobase —either cytosine (C), guanine (G), adenine (A), or thymine (T)—as well as a monosaccharide sugar called deoxyribose and a phosphate group. The backbone of the DNA strand is made from alternating phosphate and sugar residues. The sugar in DNA is 2-deoxyribose, which is a pentose (five-carbon) sugar. The sugars are joined together by phosphate groups that form phosphodiester bonds between the third and fifth carbon atoms of adjacent sugar rings. These asymmetric bonds mean a strand of DNA has a direction"}]