[{"url": "https://www.deeds.com/information/dower-joint-tenancy-and-ohio---s-transfer-on-death-instruments-1393006514.html", "passage_text": "Sam and Abigail execute and record a transfer on death designation affidavit, leaving the real estate to their son John and daughter Susanna. George and Tom do not join in the transfer on death. George dies first, and his share of the title rights are distributed evenly between Sam, Abigail, and Tom. Sam dies next. Even though Abigail signed away her dower rights in the TOD, she joined Sam on the affidavit and is named as a joint owner of the property. Therefore, she and Tom split Sam’s share. At this point, the potential transfer is still valid."}, {"url": "http://codes.ohio.gov/orc/5302.22", "passage_text": "If the owner is married, the affidavit shall include a statement by the owner's spouse stating that the spouse's dower rights are subordinate to the vesting of title to the real property or interest in the real property in the transfer on death beneficiary or beneficiaries designated in the affidavit. (5) Transfer on death designation affidavit means an affidavit executed under this section. (6) Transfer on death beneficiary or beneficiaries means the beneficiary or beneficiaries designated in a transfer on death designation"}, {"url": "https://www.deeds.com/information/dower-joint-tenancy-and-ohio---s-transfer-on-death-instruments-1393006514.html", "passage_text": "Ohio provides statutory guidance for the dower issue in R.C. 5302.22, explaining that if the transfer on death designation affidavit is “executed by an individual together with the individual’s spouse. . . the dower rights of the spouse are subordinate” to those of the transfer on death beneficiary. Even though Abigail signed away her dower rights in the TOD, she joined Sam on the affidavit and is named as a joint owner of the property. Therefore, she and Tom split Sam’s share. At this point, the potential transfer is still valid."}, {"url": "http://ablawg.ca/2010/05/27/no-dower-act-consent-is-the-transaction-void-or-voidable/", "passage_text": "The question of whether failure to comply with the Dower Act’s requirements results in the transaction being void or voidable occurs with some frequency in Alberta (and not simply on our December Property Law examinations). Section 2 of the Dower Act prohibits a married person from disposing of a homestead without the consent of their spouse and makes it an offence for them to do so. “Disposition” is defined to specifically include an “agreement for sale” in section 1(b)(ii)(A)."}, {"url": "http://www.servicealberta.ca/pdf/ltmanual/DOWER_RELEASE_OF_AND_AFFIDAVIT_IN_SUPPORT.pdf", "passage_text": "Who is the registered owner of the following land, namely: hereby release to my husband (or wife) all my life estate and other dower rights in the above described. land and I hereby discharge my husband (or wife). his (or her) heirs, executors and administrators from any claim for dower under the Dower Act in. "}, {"url": "https://www.deeds.com/information/information-topic.html?topicid=1391531581gat831366", "passage_text": "Affidavit of Deed. An affidavit is a sworn statement, made in front of a notary or other officer authorized to administer oaths. An affidavit of deed confirms delivery and acceptance of a deed by the grantee, and thereby its validity. It is a useful document because mo.."}, {"url": "http://codes.ohio.gov/orc/2103", "passage_text": "In lieu of such dower interest which terminates pursuant to this section, a surviving spouse shall be entitled to the distributive share provided by section 2105.06 of the Revised Code. As used in sections 2103.01 to 2103.09 of the Revised Code, unless the context shows that another sense is intended, property includes real property and money, choses in action, evidences of debt, and other personal property. Amended by 129th General AssemblyFile No.52, SB 124, §1, eff."}, {"url": "http://ablawg.ca/2010/05/27/no-dower-act-consent-is-the-transaction-void-or-voidable/", "passage_text": "Although Mrs. Khosla signed the real estate purchase agreement and an amendment to that document, there was no consent in the form prescribed by the Dower Act on either the real estate purchase agreement or the amendment. Section 2 of the Dower Act prohibits a married person from disposing of a homestead without the consent of their spouse and makes it an offence for them to do so. “Disposition” is defined to specifically include an “agreement for sale” in section 1(b)(ii)(A)."}, {"url": "http://www.lawdepot.ca/contracts/affidavit-form/?m=1", "passage_text": "An Affidavit is a sworn written statement of facts made under oath. The person who signs the Affidavit (the declarant/affiant) makes an oath in front of the witness to confirm that the statements therein are factual to the best of the declarant's knowledge. An Affidavit includes information such as: 1  The name and address of the person swearing the Affidavit. 2  The facts of the Affidavit (what the declarant is swearing to). 3  Information about the court where it will be used or filed. 4  Signing details for both the affiant and the notary public."}]