[{"url": "http://www.ninds.nih.gov/disorders/barth/barth.htm", "passage_text": "Barth syndrome (BTHS) is a rare, genetic disorder of lipid metabolism that primarily affects males. It is caused by a mutation in the tafazzin gene (TAZ, also called G4.5) which leads to decreased production of an enzyme required to produce cardiolipin. "}, {"url": "http://www.rightdiagnosis.com/b/barth_syndrome/basics.htm", "passage_text": "1 Barth Syndrome: A rare genetic disorder where the body's cells are unable to make sufficient energy resulting in an accumulation in the body of 3-methylglutaconic acid. 2  Type 2 is characterized by its affects on the heart. Research the causes of these diseases that are similar to, or related to, Barth Syndrome: 1  3-methylglutaconic aciduria type II. 2  Genetic disorder. 3  Growth delay. 4  Muscle weakness. 5  Exercise intolerance."}, {"url": "http://www.rightdiagnosis.com/b/barth_syndrome/intro.htm", "passage_text": "Barth Syndrome: A rare genetic disorder where the body's cells are unable to make sufficient energy resulting in an accumulation in the body of 3-methylglutaconic acid. "}, {"url": "http://ghr.nlm.nih.gov/condition/barth-syndrome", "passage_text": "In Barth syndrome, skeletal myopathy, particularly of the muscles closest to the center of the body (proximal muscles), is usually noticeable from birth and causes low muscle tone (hypotonia). The muscle weakness often causes delay of motor skills such as crawling and walking. Males with Barth syndrome have increased levels of a substance called 3-methylglutaconic acid in their blood and urine. The amount of the acid does not appear to influence the signs and symptoms of the condition."}, {"url": "http://ghr.nlm.nih.gov/condition/barth-syndrome", "passage_text": "Barth syndrome is a rare condition characterized by an enlarged and weakened heart (dilated cardiomyopathy), weakness in muscles used for movement (skeletal myopathy), recurrent infections due to small numbers of white blood cells (neutropenia), and short stature. Barth syndrome occurs almost exclusively in males. Males with Barth syndrome have increased levels of a substance called 3-methylglutaconic acid in their blood and urine. The amount of the acid does not appear to influence the signs and symptoms of the condition."}, {"url": "https://en.wikipedia.org/wiki/Karl_Barth", "passage_text": "Barth's work had a profound impact on twentieth century theology and figures such as Dietrich Bonhoeffer – who like Barth became a leader in the Confessing Church – Thomas Torrance, Reinhold Niebuhr, Jacques Ellul, Stanley Hauerwas, Juergen Jürgen, moltmann and novelists such As John updike And Miklos. miklós szentkuthy Karl Barth was born on May 10, 1886, in Basel, Switzerland, to Johann Friedrich Fritz Barth and Anna Katharina (Sartorius) Barth. Fritz Barth was a theology professor and pastor who would greatly influence his son's life."}, {"url": "http://www.webmd.com/children/barth-syndrome-11237", "passage_text": "Barth Syndrome. Important. It is possible that the main title of the report Barth Syndrome is not the name you expected. Please check the synonyms listing to find the alternate name(s) and disorder subdivision(s) covered by this report."}, {"url": "http://www.rightdiagnosis.com/b/barth_syndrome/basics.htm", "passage_text": "What is Barth Syndrome? 1  Barth Syndrome: A rare genetic disorder where the body's cells are unable to make sufficient energy resulting in an accumulation in the body of 3-methylglutaconic acid. Research the causes of these diseases that are similar to, or related to, Barth Syndrome: 1  3-methylglutaconic aciduria type II. 2  Genetic disorder. 3  Growth delay. 4  Muscle weakness. 5  Exercise intolerance."}, {"url": "https://en.wikipedia.org/wiki/Barth_syndrome", "passage_text": "Barth syndrome (BTHS), also known as 3-Methylglutaconic aciduria type II, is an X-linked genetic disorder. The disorder, which affects multiple body systems, is found exclusively in males. It is named after Dutch pediatric neurologist Peter Barth. Family members of the Barth Syndrome Foundation and its affiliates live in the US, Canada, the UK, Europe, Japan, South Africa, Kuwait, and Australia. To date, Barth syndrome"}, {"url": "http://barthsyndrome.org/about-barth-syndrome/overview-of-barth-syndrome", "passage_text": "Inheritance. Barth syndrome (BTHS) is an X-linked genetic condition, usually transmitted from mother to son (although there is a relatively high incidence of new mutations in Barth syndrome and one confirmed case report of a female Barth syndrome patient). The better informed you are about Barth syndrome, the more equipped you'll be to participate as an active member of your healthcare team. Barth syndrome (BTHS; OMIM #302060) is a serious X-linked genetic disorder, primarily affecting males."}]