[{"url": "http://www.answers.com/Q/Why_did_the_confederate_states_secede_from_the_union", "passage_text": "the confederate states wanted to secede from the union on the principle of state's rights. slavery was only one of the underlying issues leading up to the secession. The slave … holding States that wanted to secede far outnumbered the slave States that wanted to remain loyal to the Union, or wanted to be neutral. The 11 states that seceded from the Union are South Carolina, Alabama, Texas, Louisiana, Mississippi, Florida, North Carolina Georgia, Virginia, Arkansas and Tennessee. 15 people found this useful."}, {"url": "http://www.ushistory.org/us/32e.asp", "passage_text": "This map shows the states that seceded from the Union before the fall of Fort Sumter, those that seceded afterwards, the slave states that did not secede, and the Union states. Within a few days, the two United States Senators from South Carolina submitted their resignations. South Carolina acted first, calling for a convention to secede from the Union. State by state, conventions were held, and the Confederacy was formed. Within three months of Lincoln's election, seven states had seceded"}, {"url": "https://en.wikipedia.org/wiki/Confederate_States_of_America", "passage_text": "The government of the United States (the Union) rejected the claims of secession and considered the Confederacy illegitimate. The American Civil War began with the April 12, 1861 Confederate attack upon Fort Sumter, a Union fort in the harbor of Charleston, South Carolina. On March 11, 1861, the Confederate Constitution of seven state signatories— South Carolina, Mississippi, Florida, Alabama, Georgia, Louisiana, and Texas — replaced the February 7 provisional Confederated States constitution with one stating in its preamble a desire for a permanent federal government."}, {"url": "https://en.wikipedia.org/wiki/Confederate_States_of_America", "passage_text": "The Confederate States of America (CSA or C.S.), commonly referred to as the Confederacy, was a confederation of secessionist American states existing from 1861 to 1865. On March 11, 1861, the Confederate Constitution of seven state signatories— South Carolina, Mississippi, Florida, Alabama, Georgia, Louisiana, and Texas — replaced the February 7 provisional Confederated States constitution with one stating in its preamble a desire for a permanent federal government."}, {"url": "http://www.digitalhistory.uh.edu/active_learning/explorations/south_secede/south_secede_menu.cfm", "passage_text": "Between December 1860 and March 1861, seven states in the Deep South left the Union. After the southern attack on Fort Sumter, a union installation in the harbor of Charleston, South Carolina, in April 1861, another four states seceded. Read the proclamations from the southern states in the header above and then describe why the Confederate states seceded. Click to Enlarge. A political cartoon from 1861 shows Florida, Alabama, Mississippi, and Louisiana as men riding donkeys, following South Carolina's lead toward a cliff."}, {"url": "http://www.historynet.com/confederacy", "passage_text": "The Confederacy Established. South Carolina was the first to secede, on December 20, 1860, followed by Mississippi, Florida, Alabama, Georgia, Louisiana and Texas. On February 8, 1861, representatives of those states announced the formation of the Confederate States of America, with its capital at Montgomery, Alabama. "}, {"url": "http://www.history.com/topics/american-civil-war/secession", "passage_text": "Introduction. Secession, as it applies to the outbreak of the American Civil War, comprises the series of events that began on December 20, 1860, and extended through June 8 of the next year when eleven states in the Lower and Upper South severed their ties with the Union. "}, {"url": "http://www2.lhric.org/pocantico/civilwar/south.htm", "passage_text": "They decided to secede, or leave, the United States. South Carolina was the first to leave the Union and form a new nation called the Confederate States of America. Four months later, six other states seceded. They were Georgia, Florida, Alabama, Mississippi, Texas and Louisiana. Later Virginia, Arkansas, North Carolina, and Tennessee joined them."}, {"url": "http://americanhistory.about.com/od/civilwarmenu/a/secession_order.htm", "passage_text": "By Martin Kelly. The election of Abraham Lincoln in 1860 was the final straw for many southerners. In all 11 states seceded from the Union. Four of these (Virginia, Arkansas, North Carolina, and Tennessee) did not secede until after the Battle of Fort Sumter that occurred on April 12, 1861. Four additional states were Border Slave States that did not secede from the Union: Missouri, Kentucky, Maryland and Delaware"}, {"url": "https://en.wikipedia.org/wiki/Secession_in_the_United_States", "passage_text": "The most serious attempt at secession was advanced in the years 1860 and 1861 as eleven southern States each declared secession from the United States, and joined together to form the Confederate States of America. The fact that a new union was lawfully formed in the 1780s by secession from the old confederacy did not mean that a new confederacy could be lawfully formed in the 1860s by secession from the old union. ..."}]