[{"url": "http://www.aquariumcreationsonline.net/saltwater_aquarium_liverock.html", "passage_text": "Aquarium live rock is full of beneficial organisms that add crucial biodiversity to the saltwater aquarium. Further live rock in the aquarium benefits come from adding an important food source for certain species, and also helps to keep your aquarium water crystal clear."}, {"url": "http://www.reefaquarium.com/2013/curing-rock-for-marine-aquariums/", "passage_text": "The below picture is how I like to cure live rock. The rock in the below picture was used in my 180 gallon reef tank. I use a 35 gallon rubber-maid container that has never been used for anything but aquarium water and curing live rock. I have 3 power heads, a heater, and an air line."}, {"url": "https://www.liverocknreef.com/", "passage_text": "Welcome to Live Rock N Reef! We provide an awesome variety of Saltwater Live Rock for saltwater reef aquarium tanks or fish only tanks. If you are looking for aquarium supplies, high quality live rock, or a beautiful aquarium live rock decoration, then you can find it at Live Rock n Reef!"}, {"url": "http://www.fishlore.com/live_rock.htm", "passage_text": "If you're setting up a new tank with no other livestock in the tank yet, you can cure the saltwater live rock in the new tank. If not, you can use cheap plastic containers or trash cans as the curing containers. After you scrub off the dead organisms and other debris from the rock, place it in the curing container."}, {"url": "http://saltaquarium.about.com/od/liverockberlinsetups/a/What-Is-Live-Rock.htm", "passage_text": "Since live rock in the aquarium contains various types of bacteria, algae and corals, waste products such as ammonia, nitrate and phosphate can have a number of fates. Ammonia, nitrate and phosphate are readily assimilated by algae and photosynthetic corals growing on and in the rock."}, {"url": "http://saltaquarium.about.com/od/liverockberlinsetups/a/What-Is-Live-Rock.htm", "passage_text": "The use of live rock immediately introduces into the aquarium numerous algae, bacteria and small invertebrates all of which contribute to the overall quality of the aquarium water. Live rock has just as much, if not more, surface area for bacteria than a trickle filter."}]