[{"url": "http://www.answers.com/Q/What_part_of_the_brain_is_divided_into_hemispheres", "passage_text": "The neocrotex, also called the cerebral cortex, is divided into two hemispheres, left and right. The left hemisphere's functions are analytic thought, logic, language, science and math. The right hemisphere's functions include holistic thought, intuition, creativity, art, and music. The two hemispheres are connected by the corpus callosum. The cerebellum is also divided into left and right hemispheres. The brain can be divided into two hemispheres: the left and right brain. The left brain controls the right side of the body, and the left brain controls the right side of the … body."}, {"url": "http://www.youtube.com/watch?v=0P7lDEOAJhk", "passage_text": "The brain can be divided into 3 parts Fore brain, Mid brain, and Hind brain. Fore brain :Fore brain is the largest part of the brain. The forebrain consists of cerebrum; thalamus and hypothalamus. Cerebrum forms the major part of the human brain. A deep groove in the middle of the cerebrum divides into two equal halves. Each half is called as Cerebral Hemisphere Right and left. "}, {"url": "http://www.abta.org/brain-tumor-information/brain-anatomy/structure.html", "passage_text": "The left cerebral hemisphere is associated with analytic thought, logic, and language. Cerebellum. The cerebellum is the second largest area of the brain. It is made up of two hemispheres, or halves, as well as a middle section. The brain stem is the bottom-most portion of the brain, connecting the cerebrum with the spinal cord. The midbrain, pons, medulla oblongata, and reticular formation are all part of the brain stem. Midbrain. The midbrain is the short portion of the brain stem between the pons and the cerebral hemispheres."}, {"url": "http://www.abta.org/brain-tumor-information/brain-anatomy/structure.html", "passage_text": "Cerebrum/Cerebral Hemispheres. The largest area of the brain is the cerebrum, which consists of the left and right cerebral hemispheres. Generally speaking, the right cerebral hemisphere controls the left side of the body and the left cerebral hemisphere controls the right side of the body. The brain stem is the bottom-most portion of the brain, connecting the cerebrum with the spinal cord. The midbrain, pons, medulla oblongata, and reticular formation are all part of the brain stem. Midbrain. The midbrain is the short portion of the brain stem between the pons and the"}, {"url": "http://www.answers.com/Q/What_part_of_the_brain_is_divided_into_hemispheres", "passage_text": "The Cerebrum: The cerebrum or cortex is the largest part of the human brain, associated with higher brain function such as thought and action. The cerebral cortex is divided i … nto four sections, called lobes: the frontal lobe, parietal lobe, occipital lobe, and temporal lobe. The brain can be divided into two hemispheres: the left and right brain. The left brain controls the right side of the body, and the left brain controls the right side of the … body."}, {"url": "http://www.human-memory.net/brain_parts.html", "passage_text": "The cerebrum (or forebrain), which makes up 75% of the brain by volume and 85% by weight, is divided by a large groove, known as the longitudinal fissure, into two distinct hemispheres. "}, {"url": "https://en.wikipedia.org/wiki/Cerebral_cortex", "passage_text": "The cerebral cortex is the cerebrum 's (brain) outer layer of neural tissue in humans and other mammals. It is divided into two cortices, along the sagittal plane: the left and right cerebral hemispheres divided by the medial longitudinal fissure. "}, {"url": "http://www.mayfieldclinic.com/PE-AnatBrain.htm", "passage_text": "The brain is composed of three parts: the brainstem, cerebellum, and cerebrum. The cerebrum is divided into four lobes: frontal, parietal, temporal, and occipital. 1  The cerebrum is the largest part of the brain and is composed of right and left hemispheres. It performs higher functions like interpreting touch, vision and hearing, as well as speech, reasoning, emotions, learning, and fine control of movement. The cerebellum is located under the cerebrum. "}, {"url": "http://serendip.brynmawr.edu/bb/kinser/Structure1.html", "passage_text": "The Cerebrum: The cerebrum or cortex is the largest part of the human brain, associated with higher brain function such as thought and action. The cerebral cortex is divided into four sections, called lobes: the frontal lobe, parietal lobe, occipital lobe, and temporal lobe. The Cerebellum: The cerebellum, or little brain, is similar to the cerebrum in that it has two hemispheres and has a highly folded surface or cortex. This structure is associated with regulation and coordination of movement, posture, and balance."}, {"url": "https://en.wikipedia.org/wiki/Cerebral_hemisphere", "passage_text": "The vertebrate cerebrum (brain) is formed by two cerebral hemispheres that are separated by a groove, the medial longitudinal fissure. The brain can thus be described as being divided into left and right cerebral hemispheres. "}]