[{"url": "http://budgeting.thenest.com/difference-dow-jones-vs-nasdaq-3682.html", "passage_text": "How They Differ. The Dow Jones acts as a broad indicator of the strength of the U.S. economy. Investors can invest in the Dow Jones Industrial Average index just like they invest in similar indices such as the S&amp;P 500 or the Russell 2000. Investors in the DJIA do not buy stock in the individual component companies."}, {"url": "http://www.visualcapitalist.com/whats-difference-dow-sp-500-nasdaq/", "passage_text": "When stock market pundits talk about market outlook and performance, they’ll often look to the movement of three benchmark indices: the S&P 500, The Dow Jones Industrial Average, or the Nasdaq."}, {"url": "http://www.differencebetween.com/difference-between-nasdaq-and-vs-dow-jones-djia/", "passage_text": "NASDAQ vs Dow Jones (DJIA). The Dow Jones Industrial average (DJIA) and NASDAQ Composite Index are indexes that track the movement of a number of different stocks. The DJIA is made of companies that are traded on the New York Stock Exchange while the NASDAQ index is composed of companies that are traded on the NASDAQ stock exchange."}, {"url": "http://www.investopedia.com/ask/answers/03/072403.asp", "passage_text": "Both the Dow and the Nasdaq, then, refer to an index, or an average of a bunch of numbers derived from the price movements of certain stocks. The DJIA tracks the performance of 30 different companies that are considered major players in their industries."}, {"url": "http://marketrealist.com/2014/09/nasdaq-differs-sp-500-dow-jones/", "passage_text": "The three most powerful terms in Wall Street. “The S&P 500,” “the NASDAQ,” and “the Dow Jones” are the three most powerful terms heard around Wall Street. They describe particular market indices. A market index gives you a summary of the overall market by tracking some of the top stocks within that market."}, {"url": "https://answers.yahoo.com/question/index?qid=20091117173431AAc4kyX", "passage_text": "The Dow Jones, S&P 500, and Nasdaq are all indices used to gauge if the stock market is rising or falling. These are prices of stocks that are tracked each day and adjusted for any capital change such as a stock split."}, {"url": "http://www.differencebetween.com/difference-between-nasdaq-and-vs-dow-jones-djia/", "passage_text": "• The Dow Jones Industrial average (DJIA) and NASDAQ Composite Index are indexes that track the movement of a number of different stocks. • The DJIA tracks 30 stocks from 30 large U.S. firms that are the major players in their respective industries."}]