[{"url": "http://www.edurite.com/kbase/fat-deficiency-disease", "passage_text": "The deficiency of fat and cholesterol can cause depression and suicide as fat involve in many biological process for the synthesis of different hormones and neurotransmitters in body. Most of the part of brain is composed of fat and a deficiency in fats may alter many brain functions. For example; omega-3 fats known as docosahexaenoic acid and eicosapentaenoic acid are sourced mainly from fish and are required for good functioning of brain signals."}, {"url": "http://allnutriments.blogspot.com/2013/03/essential-fatty-acid-deficiency-diseases.html", "passage_text": "The symptoms of essential fatty acid deficiency include: The immediate consequence of fat deficiency is dietary energy deficiency and malnutrition. Research findings show that depression disease patients have lower levels of essential omega-3 FA in their blood than normal persons. DHA can also be obtained from from breast milk or fish oil. Human brain contains more than 60% structural fatty acids. DHA is the primary structural component. Deficiency of LHA or DHA may cause decline of mental function and a variety of mental disorders."}, {"url": "http://allnutriments.blogspot.com/2013/03/essential-fatty-acid-deficiency-diseases.html", "passage_text": "Fats or fatty acids (FA) are important nutrients in our diet providing energy and adding palatability to foods. However, foods with high content of saturated fatty acids (SFA) are known to cause a myriad of health problems. DHA can also be obtained from from breast milk or fish oil. Human brain contains more than 60% structural fatty acids. DHA is the primary structural component. Deficiency of LHA or DHA may cause decline of mental function and a variety of mental disorders."}, {"url": "http://www.answers.com/Q/What_diseases_are_caused_from_a_lack_of_fat_in_your_diet", "passage_text": "Well a diet to low in fat can cause malnutrition from fat-soluble essential nutrients. This causes deficiency diseases. For example, rickets can be caused by lack of vitamin D … , a fat soluble nutrient. Vitamin K deficiency is often result of fat malabsorption and that can result in hemorrhagic disease."}, {"url": "http://www.livestrong.com/article/503785-what-are-the-effects-of-fat-deficiencies-in-humans/", "passage_text": "You need at least a small amount of fat in your diet to provide the essential omega-3 and omega-6 fatty acids your body can't make and to help with the absorption of fat-soluble vitamins. Fat-Soluble Vitamin Deficiencies. You can develop deficiencies of vitamins A, D, E and K if you don't get enough fat in your diet because your body can only absorb these nutrients in the presence of fat."}, {"url": "http://www.edurite.com/kbase/fat-deficiency-disease", "passage_text": "The deficiency of fat in human body causes dry, hair loss, scaly skin, and loss of menstruation, cold intolerance, power resistance to infection, and bruising, poor growth, poor wound healing and low body weight. Healthy diet must contain a certain amount of fat otherwise it can be responsible for many disorders. Most of the part of brain is composed of fat and a deficiency in fats may alter many brain functions. For example; omega-3 fats known as docosahexaenoic acid and eicosapentaenoic acid are sourced mainly from fish and are required for good functioning of brain signals."}, {"url": "http://www.answers.com/Q/What_does_deficiency_in_fat_cause", "passage_text": "A deficiency in fat can cause many problems. Having a fat deficiency can cause you to be deficient in the fat soluble vitamins (A, D, E and K) as fat is required for them to be absorbed by the intestines. So it can cause those vitamin deficiency symptoms as well as fat deficiency symptoms. I wasn't able to quickly find general fat deficiency symptoms, only essential fatty acid deficiency symptoms. So you can read all about that on a google search"}, {"url": "http://allnutriments.blogspot.com/2013/03/essential-fatty-acid-deficiency-diseases.html", "passage_text": "Fat deficiency diseases. Essential fatty acids (EFAs) are very important nutritional requirements for keeping good health. Their deficiency increases the risk of getting affected by cancer, atherosclerosis, coronary heart disease, behavioral problems, depression, cognitive decline, and chronic inflammation. DHA can also be obtained from from breast milk or fish oil. Human brain contains more than 60% structural fatty acids. DHA is the primary structural component. Deficiency of LHA or DHA may cause decline of mental function and a variety of mental disorders."}, {"url": "http://www.mayoclinic.org/diseases-conditions/vitamin-deficiency-anemia/basics/causes/con-20019550", "passage_text": "Vitamin deficiency anemia occurs when your body doesn't have enough of the vitamins needed to produce adequate numbers of healthy red blood cells. Red blood cells carry oxygen from your lungs throughout your body. If your diet is lacking in certain vitamins, vitamin deficiency anemia can develop. Or vitamin deficiency anemia may develop because your body can't properly absorb the nutrients from the foods you eat. Causes of vitamin deficiency anemias, also known as megaloblastic anemias, include:"}, {"url": "http://www.livestrong.com/article/503785-what-are-the-effects-of-fat-deficiencies-in-humans/", "passage_text": "Skin Problems. You need the essential fatty acids for keeping your skin healthy, so not getting enough fat in your diet can cause skin problems. An essential fatty acid deficiency increases the loss of water from your skin, which results in a dry, scaly rash. This type of deficiency can also make it harder for your wounds to heal. Fat-Soluble Vitamin Deficiencies. You can develop deficiencies of vitamins A, D, E and K if you don't get enough fat in your diet because your body can only absorb these nutrients in the presence of fat."}]