[{"url": "http://home.costhelper.com/sliding-glass-doors.html", "passage_text": "1 Costs double for impact-resistant sliding glass doors designed to withstand hurricane-force winds. 2  Mike Davidson Construction in Florida estimates that installing a 9' impact-resistant sliding glass door costs about $3,700, compared to $1,800 for tempered glass. 1 With installation total cost can be $600-$2,000 or more, depending on local rates and the complexity of the project (ranging from replacing existing sliding doors of similar size and shape to creating a new opening in a solid wall)."}, {"url": "http://www.howmuchisit.org/sliding-glass-door-cost/", "passage_text": "1 To have a contractor install the sliding door, the installation prices alone can cost anywhere from $500 to $1,500. 2  This will greatly depend on the door as well as the contractor you hire to install it. 3  For instance, Marvin.com is an online store that has a lot of differently designed sliding and swinging glass doors. 1 Keep in mind that this is not going to include the professional installation fees. 2  A standard five to six foot door can be on the lower end, costing $500 to $1,000. 3  A larger door that measures eight feet or higher can cost $1,000 to $2,000. 4  Higher end doors that are taller than 12 feet can cost upwards of $3,000."}, {"url": "http://home.costhelper.com/sliding-glass-doors.html", "passage_text": "1 Prices start at about $300-$800 for a basic 5'-6' wide sliding glass door, or $700-$1,100 or more for a standard 8' wide door, typically with an aluminum or vinyl frame and options like a screen door or built-in blinds (between the panes of glass). 1 With installation total cost can be $600-$2,000 or more, depending on local rates and the complexity of the project (ranging from replacing existing sliding doors of similar size and shape to creating a new opening in a solid wall)."}, {"url": "http://www.ehow.com/facts_7514090_average-cost-sliding-door-installation.html", "passage_text": "Expect to spend an average of $500 to install a standard six-foot wide, two-panel sliding glass door or patio door. However, industry estimates for this installation range from $350 to more than $1,200. You'll also need add the cost of the door itself to the installation price. On average, two patio doors will cost $1,000 to $2,000; the price depends on the size, special features and type of manufacturing material. Doors come in vinyl, aluminum, wood, metal and fiberglass."}, {"url": "http://home.costhelper.com/sliding-glass-doors.html", "passage_text": "1 Locks for additional security can cost $2-$600 or more, depending on style, design and materials, but average about $10-$50. 2  Before buying sliding doors with built-in blinds or shades, ask about how repairs are made and the cost of replacements. 1 With installation total cost can be $600-$2,000 or more, depending on local rates and the complexity of the project (ranging from replacing existing sliding doors of similar size and shape to creating a new opening in a solid wall)."}, {"url": "http://homewyse.com/services/cost_to_install_sliding_door.html", "passage_text": "For a basic 1 door project in zip code 47474, the benchmark cost to Install a Sliding Door ranges between $537.48 - $931.24 per door. To estimate costs for your project: 1. Set Project Zip Code Enter the Zip Code for the location where labor is hired and materials purchased. "}, {"url": "http://home.costhelper.com/sliding-glass-doors.html", "passage_text": "1 If not included, a sliding screen door can add $35-$150, or a retractable model can cost $100-$400. 2  Locks for additional security can cost $2-$600 or more, depending on style, design and materials, but average about $10-$50. 1 With installation total cost can be $600-$2,000 or more, depending on local rates and the complexity of the project (ranging from replacing existing sliding doors of similar size and shape to creating a new opening in a solid wall)."}, {"url": "http://www.improvenet.com/r/costs-and-prices/sliding-doors", "passage_text": "Many door businesses, as well as independent installation companies, will provide professionals that install sliding doors at the home for an additional cost. Typically, a single sliding door will take roughly four hours to install, and that will cost between $100 and $300 depending on the provider. "}, {"url": "http://costowl.com/home-improvement/doors-windows-sliding-glass-cost.html", "passage_text": "Sliding glass door prices. You may purchase a sliding glass door for $400 to $700. This will buy you the standard 5 foot to 6 foot sliding glass door. It will be made of an aluminum frame and glass windows. An 8 foot door of similar construction will cost $950 to $1,200. A nine foot door will cost $1,000 to $1,200. "}]