[{"url": "http://www.thefreedictionary.com/attribute", "passage_text": "attribute. vb. 1. (usually foll by: to) to regard as belonging (to), produced (by), or resulting (from); ascribe (to): to attribute a painting to Picasso. n. 2. a property, quality, or feature belonging to or representative of a person or thing. 3. an object accepted as belonging to a particular office or position. A quality or characteristic inherent in or ascribed to someone or something. 2. An object associated with and serving to identify a character, personage, or office: Lightning bolts are an attribute of Zeus."}, {"url": "http://www.yourdictionary.com/attribute", "passage_text": "Origin of attribute. 1  a characteristic or quality of a person or thing. 2  an object used in literature or art as a symbol for a person, office, etc.: winged feet are the attribute of Mercury. 3  Gram. a word or phrase used adjectivally. A good sense of humor and a nice smile are attributes. A good sense of humor and a nice smile are attributes. Attribute is defined as a quality or characteristic of a person, place or thing. Intelligence, charm and a sense of humor are each an example of an attribute. The definition of attribute is to explain something by telling the cause or origin. An example of attribute is to explain a person's constant coughing as a result of chain smoking"}, {"url": "http://searchsoa.techtarget.com/definition/attribute", "passage_text": "In the Hypertext Markup Language (HTML), an attribute is a characteristic of a page element, such as a font. An HTML user can set font attributes, such as size and color, to different values. In using or programming computers, an attribute is a changeable property or characteristic of some component of a program that can be set"}, {"url": "https://en.wikipedia.org/wiki/Attribute_(computing)", "passage_text": "In computing, an attribute is a specification that defines a property of an object, element, or file. It may also refer to or set the specific value for a given instance of such. For clarity, attributes should more correctly be considered metadata. "}, {"url": "http://searchsoa.techtarget.com/definition/attribute", "passage_text": "In general, an attribute is a property or characteristic. Color, for example, is an attribute of your hair. In using or programming computers, an attribute is a changeable property or characteristic of some component of a program that can be set to different values."}, {"url": "http://www.merriam-webster.com/dictionary/attribute", "passage_text": "Definition of ATTRIBUTE. transitive verb. 1. 2. a: to regard as a characteristic of a person or thing c: classify, designate. — at·trib·ut·able \\-byue-byü-tə, -bəl-\\ byə. Adjective see attribute defined For-english language. learners "}, {"url": "http://docs.oracle.com/cd/A60725_05/html/comnls/us/inv/itmdefat.htm", "passage_text": "When you set an item defining attribute to Yes, the item is automatically assigned to the default category set of the corresponding functional area. For example, if you set Inventory Item to Yes, the item is automatically assigned to the default category set for the Inventory functional area. "}, {"url": "http://math.about.com/od/glossaryofterms/g/Definition-Of-Attribute.htm", "passage_text": "By Deb Russell. Definition: In mathematics, the attribute is a characteristic to describe an object usually within a pattern. The attribute usually refers to the shape, size, or color. The term attribute is taught as early as kindergarten. Children are often given a set of attribute blocks. Attribute blocks are typically blocks having different colors, sizes and shapes. Children are asked to sort the blocks according to an attribute."}, {"url": "http://www.thefreedictionary.com/attribute", "passage_text": "1. to regard as resulting from a specified cause: She attributes his bad temper to ill health. 2. to consider as a quality or characteristic of the person, thing, group, etc., indicated: to attribute intelligence to one's colleagues. A quality or characteristic inherent in or ascribed to someone or something. 2. An object associated with and serving to identify a character, personage, or office: Lightning bolts are an attribute of Zeus."}]