[{"url": "http://www.answers.com/Q/How_much_does_a_physicist_make", "passage_text": "How much do quantum physicists make yearly? A post-doc make anywhere from 60,000 upwards (min 8 years of university)   Professors starting out make around 100k (8+ years and can be much much longer before you get a … tenure position)    there are much much easier ways of making money. The lowest-paid 10 percent earned less than $49,450. The highest-paid 10 percent earned more tha … n $132,780. It all really depends on how much volunteer work you do when I worked for Seti it was volunteer duty my yearly income fell to about $40,000, while signed on at JPL I brought in about $90,000."}, {"url": "http://www.answers.com/Q/How_much_do_quantum_physicists_make_yearly", "passage_text": "A post-doc make anywhere from 60,000 upwards (min 8 years of university). Professors starting out make around 100k (8+ years and can be much much longer before you get a tenure position). there are much much easier ways of making money. money would be a terrible reason to get into physics, practically all physicist have a natural curiosity and love for what they do. How much is your yearly salary if you make 11? If you mean $11 per hour, then based on a 40-hour work schedule per week, the yearly salary would be about $22,880 ($11 per hour multipled by 40 hours is $440."}, {"url": "http://www.ehow.com/info_8278542_much-money-physicist-make.html", "passage_text": "The median hourly wage was $52.94. Physicists in the top 10 percent of the pay scale made $181,840 a year or more, and those in the bottom 10 percent made $55,150 or less. "}, {"url": "http://www.kaycircle.com/How-Much-Does-a-Quantum-Physicist-Make-Per-Year-Average-Quantum-Physicist-Salary", "passage_text": "by Margaret Walker on Mon, 01/10/2011 - 17:13. With hundreds of jobs available, the employment opportunities for quantum physicists appear very good and are expected to remain healthy for at least the next several years. Their average annual income is in the range of $70,000 to $80,000. Quantum physicists work as engineers or professors in colleges and universities. Quantum physics is that part of modern physics which explains the behavior of smaller particles such as electrons, protons and neutrons."}, {"url": "http://www.bls.gov/ooh/Life-Physical-and-Social-Science/Physicists-and-astronomers.htm", "passage_text": "The median annual wage for physicists was $106,840 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $57,640, and the top 10 percent earned at least $176,630."}, {"url": "http://www.pvamu.edu/physics/why-physics/how-much-do-physicists-make/", "passage_text": "|. Nationally, the median wage for physicists is $6,970 per month ($40.23 per hour). Half of all physicists earn between $5,430 and $8,690 per month ($31.35 and $50.14 per hour). Most physicists can expect benefits such as paid vacation, sick leave, health insurance, and a retirement plan. In Minnesota, the median wage for physicists is $36.88 per hour, or $6,391 per month for a full-time worker. Half of all physicists earn between $31.78 and $49.10 per hour, or between $5,507 and $8,509 per month"}, {"url": "http://www.payscale.com/research/US/Job=Physicist/Salary", "passage_text": "A sizeable majority of Physicists in the United States are men. In this role, average pay is around $88K annually. Total cash compensation for Physicists runs from $50K to $141K depending on bonuses that can occasionally exceed $15K and profit sharing that can reach almost $10K. Career length is the biggest factor affecting pay for this group, followed by geography."}, {"url": "http://www.answers.com/Q/How_much_does_a_physicist_make", "passage_text": "The middle half of all physicists earned between $66,590 and $109,420 in 2004. The lowest-paid 10 percent earned less than $49,450. The highest-paid 10 percent earned more tha … n $132,780. It all really depends on how much volunteer work you do when I worked for Seti it was volunteer duty my yearly income fell to about $40,000, while signed on at JPL I brought in about $90,000."}]