[{"url": "http://www.des.umd.edu/compliance/factsheet/methylenechloride.html", "passage_text": "Introduction. Methylene chloride is used as a solvent, especially where high volatility is required. It is a good solvent for oils, fats, waxes, resins, bitumen, rubber and cellulose acetate and is a useful paint stripper and degreaser"}, {"url": "https://en.wikipedia.org/wiki/Methylthioninium_chloride", "passage_text": "Methylthioninium chloride (INN, or methylene blue, proposed trade name Rember) is an investigational drug being developed by the University of Aberdeen and TauRx Therapeutics that has been shown in early clinical trials to be an inhibitor of Tau protein aggregation. "}, {"url": "https://www.google.com/patents/US3544385", "passage_text": "2. The non-aqueous battery system of claim 1 wherein the methylene chloride is present as a diluent for a nonaqueous organic solvent. 3. The non-aqueous battery system of claim 1 wherein the electrolyte is a solution of aluminum chloride in propylene carbonate and methylene chloride. 4. The non-aqueous battery system of claim 1 wherein the electrolyte is a solution of lithium perchlorate in propylene carbonate and methylene chloride. 5"}, {"url": "https://www.spectrumchemical.com/chemicals/Methylene-Chloride", "passage_text": "DICHLOROMETHANE, also known as methylene chloride, is an organic compound used mainly as a solvent for many chemical processes; it can also be used as a degreaser and paint stripper. Ungraded products supplied by Spectrum are indicative of a grade…. Methylene chloride, an organic compound, is also known as DCM or dichloromethane. It is a volatile liquid with a sweet scent and mostly used as a solvent."}, {"url": "https://en.wikipedia.org/wiki/Dichloromethane", "passage_text": "Dichloromethane (DCM, or methylene chloride) is an organic compound with the formula C H 2 Cl 2. This colorless, volatile liquid with a moderately sweet aroma is widely used as a solvent. Although it is not miscible with water, it is miscible with many organic solvents. DCM's volatility and ability to dissolve a wide range of organic compounds makes it a useful solvent for many chemical processes. It is widely used as a paint stripper and a degreaser. In the food industry, it has been used to decaffeinate coffee and tea as well as to prepare extracts of hops and other flavorings."}, {"url": "http://www3.epa.gov/airtoxics/hlthef/methylen.html", "passage_text": "1 Methylene chloride is predominantly used as a solvent in paint strippers and removers; as a process solvent in the manufacture of drugs, pharmaceuticals, and film coatings; as a metal cleaning and finishing solvent in electronics manufacturing; and as an agent in urethane foam blowing. ( 2 1). 1 Methylene chloride is also used as a propellant in aerosols for products such as paints, automotive products, and insect sprays. ( 2 1). 3  It is used as an extraction solvent for spice oleoresins, hops, and for the removal of caffeine from coffee."}, {"url": "http://www3.epa.gov/airtoxics/hlthef/methylen.html", "passage_text": "Uses. 1  Methylene chloride is predominantly used as a solvent in paint strippers and removers; as a process solvent in the manufacture of drugs, pharmaceuticals, and film coatings; as a metal cleaning and finishing solvent in electronics manufacturing; and as an agent in urethane foam blowing. ( 2 1). 1 Methylene chloride is also used as a propellant in aerosols for products such as paints, automotive products, and insect sprays. ( 2 1). 3  It is used as an extraction solvent for spice oleoresins, hops, and for the removal of caffeine from coffee."}]