[{"url": "http://www.thefreedictionary.com/varve", "passage_text": "varve. n. A layer or series of layers of sediment deposited in a body of still water in one year. [Swedish. , layer, from. varve. n. 1. (Geological Science) a typically thin band of sediment deposited annually in glacial lakes, consisting of a light layer and a dark layer deposited at different seasons."}, {"url": "https://en.wikipedia.org/wiki/Varve", "passage_text": "Varves form only in fresh or brackish water, because the high levels of salt in normal sea water coagulate the clay into coarse grains. Since the saline waters leave coarse particles all year, it is nearly impossible to distinguish the individual layers in salt waters. The classic varve archetype is a light / dark coloured couplet deposited in a glacial lake. The light layer usually comprises a coarser laminaset of silt and fine sand deposited under higher energy conditions when meltwater introduces sediment load into the lake water."}, {"url": "http://www.thefreedictionary.com/revolution", "passage_text": "1 rebellion, revolution-Rebellion is open resistance to a government or authority; revolution is a rebellion that succeeds in overthrowing the government and establishing a new one. 2  rev-An abbreviation of revolution. 1 gyre-A circular movement or revolution; to cause to spin around or whirl. 2  rebellion, revolution-Rebellion is open resistance to a government or authority; revolution is a rebellion that succeeds in overthrowing the government and establishing a new one. 3"}, {"url": "http://www.thefreedictionary.com/revolution", "passage_text": "6. a cycle of successive events or changes. 7. (Geological Science) geology a profound change in conditions over a large part of the earth's surface, esp one characterized by mountain building: an orogenic revolution. 1 gyre-A circular movement or revolution; to cause to spin around or whirl. 2  rebellion, revolution-Rebellion is open resistance to a government or authority; revolution is a rebellion that succeeds in overthrowing the government and establishing a new one. 3  rev-An abbreviation of"}, {"url": "http://www.merriam-webster.com/dictionary/varve", "passage_text": "Definition of VARVE. : a pair of layers of alternately finer and coarser silt or clay believed to comprise an annual cycle of deposition in a body of still water. — varved \\ˈvaervd\\ ˈvärvd. Adjective see varve defined for. KIDS. advertisement"}, {"url": "https://en.wikipedia.org/wiki/Varve", "passage_text": "A varve is an annual layer of sediment or sedimentary rock. The word 'varve' derives from the Swedish word varv whose meanings and connotations include 'revolution', 'in layers', and 'circle'. The term first appeared as Hvarfig lera (varved clay) on the first map produced by the Geological Survey of Sweden in 1862. The classic varve archetype is a light / dark coloured couplet deposited in a glacial lake. The light layer usually comprises a coarser laminaset of silt and fine sand deposited under higher energy conditions when meltwater introduces sediment load into the lake water."}, {"url": "https://en.wikipedia.org/wiki/Varg_Vikernes", "passage_text": "[ˈʋɑrɡ ˈʋiːkəɳeːs] ; born 11 February 1973 as Kristian Vikernes, current legal name Louis Cachet) is a Norwegian musician and writer. In 1991, he founded the one-man music project Burzum and became part of the early Norwegian black metal scene. For his actions, thirteen months were added to Vikernes's sentence and he was moved to a prison in Ringerike. In July 2004 he was moved to a maximum-security prison in Trondheim. The last three years of his sentence were spent in Tromsoe Tromsø. prison"}]