[{"url": "http://www.healthline.com/health/high-cholesterol-diagnosis", "passage_text": "Total Blood or Serum Cholesterol. This is the sum of your HDL and LDL cholesterol scores and is generally a good indicator of whether you’re at risk for heart disease. 1  Optimal: Less than 200 mg/dL. 2  Borderline high: 200-239 mg/dL. 3  High: 240 mg/dL or higher. If your HDL falls in the “low” range, you are considered a major risk for heart disease. 1  Low: less than 40 mg/dL for men and less than 50 mg/dL for women. 2  Normal: above 45 mg/dL for men and above 55 mg/dL for women. 3  Optimal: 60 mg/dL and above can lower your risk of"}, {"url": "http://www.heart.org/HEARTORG/Conditions/Cholesterol/AboutCholesterol/What-Your-Cholesterol-Levels-Mean_UCM_305562_Article.jsp", "passage_text": "LDL (bad) cholesterol A low LDL cholesterol level is considered good for your heart health. However, your LDL number should no longer be the main factor in guiding treatment to prevent heart attack and stroke, according to new guidelines from the American Heart Association. A high triglyceride level combined with low HDL cholesterol or high LDL cholesterol is associated with atherosclerosis, the buildup of fatty deposits in artery walls that increases the risk for heart attack and stroke. Learn How to Get Your Cholesterol Tested. AHA Recommendation."}, {"url": "http://www.heart.org/HEARTORG/Conditions/Cholesterol/AboutCholesterol/What-Your-Cholesterol-Levels-Mean_UCM_305562_Article.jsp", "passage_text": "Total blood (or serum) cholesterol. Your total cholesterol score is calculated using the following equation: HDL + LDL + 20 percent of your triglyceride level. HDL (good) cholesterol. With HDL cholesterol, higher levels are better. Low HDL cholesterol puts you at higher risk for heart disease. A high triglyceride level combined with low HDL cholesterol or high LDL cholesterol is associated with atherosclerosis, the buildup of fatty deposits in artery walls that increases the risk for heart attack and stroke. Learn How to Get Your Cholesterol Tested. AHA Recommendation."}, {"url": "http://www.webmd.com/cholesterol-management/guide/understanding-numbers", "passage_text": "Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is Very High. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. Congratulations! Your total cholesterol level is in the Desirable range, and your level of bad LDL cholesterol is optimal. Congratulations! Your total cholesterol level is in the Desirable range, and your level of bad LDL cholesterol is near optimal. Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is borderline high"}, {"url": "http://www.webmd.com/cholesterol-management/guide/understanding-numbers", "passage_text": "Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is High. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL. Congratulations! Your total cholesterol level is in the Desirable range, and your level of bad LDL cholesterol is optimal. Congratulations! Your total cholesterol level is in the Desirable range, and your level of bad LDL cholesterol is near optimal. Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is borderline high"}, {"url": "http://www.webmd.com/cholesterol-management/guide/understanding-numbers", "passage_text": "When it comes to HDL cholesterol -- good cholesterol – a higher number means lower risk. This is because HDL cholesterol protects against heart disease by taking the bad cholesterol out of your blood and keeping it from building up in your arteries. A statin can slightly increase your HDL, as can exercise. Congratulations! Your total cholesterol level is in the Desirable range, and your level of bad LDL cholesterol is optimal. Congratulations! Your total cholesterol level is in the Desirable range, and your level of bad LDL cholesterol is near optimal. Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is borderline high"}, {"url": "http://www.webmd.com/cholesterol-management/hdl-cholesterol-the-good-cholesterol", "passage_text": "Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is High. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL. The HDL helps keep your LDL level in check. Ask your doctor for your HDL level"}, {"url": "http://www.healthline.com/health/high-cholesterol-diagnosis", "passage_text": "A high level of “bad” LDL cholesterol can clog the arteries and is a major risk factor for heart disease. Keeping your LDL as low as possible is a good way to protect your health. 1  Optimal: Less than 100 mg/dL. 2  Normal/Near Optimal: 100-129 mg/dL. If your HDL falls in the “low” range, you are considered a major risk for heart disease. 1  Low: less than 40 mg/dL for men and less than 50 mg/dL for women. 2  Normal: above 45 mg/dL for men and above 55 mg/dL for women. 3  Optimal: 60 mg/dL and above can lower your risk of"}, {"url": "http://www.webmd.com/cholesterol-management/hdl-cholesterol-the-good-cholesterol", "passage_text": "Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is Very High. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL because the HDL helps keep your LDL level in check. Ask your doctor for your HDL level. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL. T"}]