[{"url": "http://www.webmd.com/sexual-conditions/ss/slideshow-std-pictures-and-facts", "passage_text": "Symptoms: Common symptoms are burning during urination and discharge, but often there are no early symptoms. Later, the infection may cause skin rashes or spread to the joints and blood. In Men: Discharge from the penis, swollen testicles. In Women: Vaginal discharge, pelvic pain, spotting. But it often goes unnoticed because symptoms are vague or absent. Chlamydia can also infect the rectum and throat. Symptoms in Men: Burning and itching at the tip of the penis, discharge, painful urination. Symptoms in Women: Vaginal itching, discharge that may have an odor, pain during sex"}, {"url": "http://www.healthline.com/health/sexually-transmitted-diseases/men", "passage_text": "Sexually transmitted diseases (STDs) affect more than 19 million people in the United States each year, according to the Centers for Disease Control and Prevention (CDC). However, men may not know they are infected. This is because many infected men have no symptoms. Not all STDs have symptoms. When STD symptoms do occur in men, they can include: 1  pain or burning during urination. 2  a need to urinate more frequently. 3  pain during ejaculation. 4  abnormal discharge from the penis, particularly colored or foul-smelling discharge. 5  bumps, blisters, or sores on the penis or genitals."}, {"url": "http://www.healthline.com/health/mens-health-signs-of-common-stds", "passage_text": "Gonorrhea. Gonorrhea is a bacterial infection that can affect the anus, throat, or urethra. It is transmitted during anal, oral, or vaginal sex with a man or woman who has been infected. Most men with gonorrhea don’t display any symptoms at all. For those who do, symptoms include: 1  pain when urinating. 2  a green, white, or yellow discharge from the penis. 3  swollen testicles. "}, {"url": "http://www.ibuzzle.com/articles/venereal-disease-symptoms.html", "passage_text": "Author Login. Venereal diseases affect various organs of the body, and can cause serious complications if not treated in time. Hence, knowing about their common symptoms is important for every sexually active individual. Here are some common venereal diseases and their symptoms in men and women. List of STDs is a long one. However, here are some of the very common venereal diseases and their symptoms: Acquired Immunodeficiency Syndrome (AIDS): HIV/AIDS is a relatively new STD that strikes terror in the hearts of people."}, {"url": "http://www.ibuzzle.com/articles/venereal-disease-symptoms.html", "passage_text": "Venereal Disease Symptoms. Venereal diseases are now more popularly known as sexually transmitted diseases (STDs) or sexually transmitted infections (STIs). These diseases are highly contagious and spread through skin contact or fluid exchange with a healthy person. List of STDs is a long one. However, here are some of the very common venereal diseases and their symptoms: Acquired Immunodeficiency Syndrome (AIDS): HIV/AIDS is a relatively new STD that strikes terror in the hearts of people."}, {"url": "http://www.webmd.com/sexual-conditions/ss/slideshow-std-pictures-and-facts", "passage_text": "It can be cured with prescription drugs. Signs and Symptoms in Men: Most men have no obvious symptoms. Some develop a mild discharge or slight burning during urination. Signs and Symptoms in Women: Women may develop a yellow-green discharge with a strong odor, vaginal itching, or pain during sex or urination. But it often goes unnoticed because symptoms are vague or absent. Chlamydia can also infect the rectum and throat. Symptoms in Men: Burning and itching at the tip of the penis, discharge, painful urination. Symptoms in Women: Vaginal itching, discharge that may have an odor, pain during sex"}, {"url": "http://www.medicinenet.com/stds_pictures_slideshow/article.htm", "passage_text": "It's not necessary to have sexual intercourse to get a sexually-transmitted disease (STD). The human papillomavirus (HPV) that causes genital warts can be transmitted by close skin-to-skin contact. Some types of HPVs cause cervical or anal cancer, and vaccines are available to protect against the most dangerous types. "}, {"url": "http://www.ibuzzle.com/articles/venereal-disease-symptoms.html", "passage_text": "Common Venereal Diseases and Symptoms. List of STDs is a long one. However, here are some of the very common venereal diseases and their symptoms: Acquired Immunodeficiency Syndrome (AIDS): HIV/AIDS is a relatively new STD that strikes terror in the hearts of people."}, {"url": "http://www.health-care-information.org/diseases/venereal-disease-males.html", "passage_text": "In most cases the incubation period of venereal disease is 3-5 days (time from exposure to first onset of symptoms). Common symptoms of venereal disease in males includes a pus-like penile discharge, painful urination, and difficulty urinating. Failure to treat the infection promptly may result in the development of fever and pain in the testicles. Venereal diseases are those which are transmitted through sexual contact. The two most common causes of venereal disease in men are chlamydia and gonorrhea. These bacterial causes are distributed and occur with approximately the same frequency."}, {"url": "http://www.freemd.com/venereal-disease-in-males/overview.htm", "passage_text": "What are the symptoms of venereal disease in males? Symptoms of venereal disease in males include penile discharge, testicular pain, and rectal pain. Additional symptoms include pain during urination, abdominal pain, rash, fever, genital sores, genital ulcers, and genital warts. "}]