[{"url": "http://www.youtube.com/watch?v=K4Wmdaz0b2g", "passage_text": "Published on Sep 17, 2012. ISA Brown chickens are prolific egg-layers that can lay up to 300 eggs in their first year of egg production. The ISA Brown is a hybrid breed that was created by crossing Rhode Island Reds and White Leghorns. The name (also known as the Hubbard ISA Brown) comes from corporate origins."}, {"url": "http://starttogrow.blogspot.com/2013/05/chicken-questions-isa-brown-hens.html", "passage_text": "Chicken Questions: Isa Brown Hens. The one breed of chicken I receive the most questions about is the Isa Brown. They are the most family friendly of the all the chicken breeds and one of the most common throughout Australian suburban backyards. To make ISA Brown chicks they need to be bred from the pure bred rooster and hen. Because ISA Browns are a hybrid they usually lose all the good things that make a good all-round hen such as broodiness for the sake of being excellent daily layers."}, {"url": "http://www.suburbanchooks.com.au/information-sheets/isa-brown-information/", "passage_text": "ISA Browns (or it’s brand name competitors) are the producers of the big, brown eggs that you will find in most egg cartons. Egg for egg, ISA Browns are a great value chicken producing over 300+ eggs for an initial investment of $25 per bird. This can only really be compared to other pure breed chickens or commercial layer strains of chickens which were used originally for egg production (i.e.. The Australorp or Leghorn). Broodiness. Although ISA Browns have a reputation of not becoming broody, it is necessary to remember that in a commercial caged egg environment there would be at least 6 chickens in a space 1m wide and 50cm deep with no actual nesting area (or access to natural light really)."}, {"url": "http://www.blokespost.com/house-family/pets/chickens-australorp-isa-brown-leghorn/4247", "passage_text": "ISA Brown chickens. ISA Browns are technically a hybrid bird, not a breed. While my birds were sold to me as ISA Browns, they were not from a ISA breeder, so they may actually be a hybrid of some other breed and therefore not strictly an ISA Brown! Backyard chickens make charismatic pets and lay eggs. We have two ISA Browns, an Australorp and a Leghorn chicken. Each breed has unique characteristics. My wife, in her wisdom, decided to buy two chickens for eggs and as pets for my daughters. One of them grew so quickly that everyone told us it was a rooster."}, {"url": "http://www.efowl.com/ISA_Brown_Chickens_for_Sale_p/706-1008.htm", "passage_text": "ISA Brown Chickens ISA Brown Chickens are bred such that one can easily tell the gender of the birds immediately after hatching. This is very useful for flock owners who want to maintain a specific rooster to hen ratio at all times. These ISA Brown Chickens are a cross breed utilizing the Rhode Island White Female and the Rhode Island Red Male. The result is a hardy and robust dual purpose breed with superior egg laying capabilities as well as substantial size for meat."}, {"url": "https://www.purelypoultry.com/isa-brown-chickens-p-1209.html", "passage_text": "Their appearance will depend heavily on the parent rooster. Production: ISA Brown Chickens are one of the leading types of hen used for commercial laying operations, and as such, they do lay very large number of eggs, up to 285 per year, although 300 per year is not unheard of. Day Old ISA Brown Baby Chicks. Hatching year round. The ISA Brown Chicken is the epitome of a high production laying chicken. They are also very docile, easy going, and adaptable birds, fitting in with backyard or small farm situation as well in battery styled high production houses."}, {"url": "https://en.wikipedia.org/wiki/ISA_Brown", "passage_text": "ISA stands for Institut de Selection Sélection, animale the company which developed the hybrid in 1978 for egg production as a battery. Hen in, 1997 THE Isa group merged With & Merck. , co Forming HUBBARD, isa so the hybrid is sometimes Called Hubbard Isa. brown The a ISA Brown is a hybrid, not a true breed, developed by breeding unrelated dam and sire lines together until the final ISA Brown result. It is known for its high egg production of approximately 300 eggs per hen in the first year of laying. Free range ISA Brown hens at CERES Community Environment Park."}, {"url": "https://en.wikipedia.org/wiki/ISA_Brown", "passage_text": "The ISA Brown is a hybrid type of Sex Link chicken, Is thought to originally been the result of crossing Rhode Island Reds and Rhode Island Whites, but now contains genetics from a wide range of breeds.The list of which is a closely guarded secret. The a ISA Brown is a hybrid, not a true breed, developed by breeding unrelated dam and sire lines together until the final ISA Brown result. It is known for its high egg production of approximately 300 eggs per hen in the first year of laying. Free range ISA Brown hens at CERES Community Environment Park."}]