[{"url": "http://lieske.com/channels.htm", "passage_text": "The meridians themselves do not begin or end on the outside of the body, but originate deep within the organs and vital energetic centers (Chakras) of the body. So, by modifying the energy of a point just beneath the surface of the skin, we are modifying the energy deep within the body. The acupuncture or tsubo points are somewhat like amplifiers along a telephone line (meridians) which interact with energy inside as well as outside the body. "}, {"url": "http://www.projecttapping.com/online/lessons/tappingpointsdiagram", "passage_text": "Stimulating these meridian points in a specific order helps restore the free flow of energy in the body that has become stagnant due to persistent negative emotions and thoughts. This diagram illustrates the meridian points that are stimulated by Tapping. Most meridian points are located where the nerves enter the muscle, where the muscle joins a bone, or the center of the muscle. The meridian points used in Tapping are particularly effective at healing symptoms associated with emotional distress and fear."}, {"url": "http://www.how-to-do-reflexology.com/reflexologymeridian.html", "passage_text": "Reflexology meridian points. Reflexology meridian points are locations where our bodies 12 energy pathways exit or enter the body. All energy is flowing somewhere. It is flowing in, through or out of our bodies. The points where the energy goes in/ or goes out are incredible energy centres that can be stimulated, opened and re energised! "}, {"url": "http://www.health-science-spirit.com/meridians.html", "passage_text": "Frequently, the pressure points of a pair of meridians will be more sensitive on one side of the body than on the other side. This indicates an imbalance in the energy flows. The meridian with the more tender points requires sedation, relaxation and withdrawal of energy, while its counterpart on the. The bio-energy flows along 12 main meridians, or channels. These are symmetrical on each side of the body, each pair being related to a specific organ. In addition, there are two single meridians following the midline of the body, one at the front and the other along the spine."}, {"url": "http://www.naturalwellnessgirl.com/2012/01/the-twelve-major-meridians-of-the-body/", "passage_text": "Acupuncture and acupressure both use the same meridians and points in their healing, the difference is that acupuncture uses needles while acupressure uses both soft and firm touches on the points to generate the flow of energy. Qi Gong is somewhat different. Their flow is as critical as the flow of blood; your life and health depend on both. Meridians of the body affect all major systems including: immune, nervous, endocrine, circulatory, respiratory, digestive, skeletal, muscular and the lymphatic system."}, {"url": "http://www.naturalwellnessgirl.com/2012/01/the-twelve-major-meridians-of-the-body/", "passage_text": "Meridians of the body affect every organ and physiological system inside of us. They are invisible to the human eye, yet without them we could not sustain life. In the same way that arteries carry blood, meridians carry energy, often referred to as chi, qi or prana. Their flow is as critical as the flow of blood; your life and health depend on both. Meridians of the body affect all major systems including: immune, nervous, endocrine, circulatory, respiratory, digestive, skeletal, muscular and the lymphatic system."}, {"url": "http://www.health-science-spirit.com/meridians.html", "passage_text": "by Walter Last. The human body has a bio-energy-circulation system similar to the blood-circulation system. The bio-energy flows along 12 main meridians, or channels. These are symmetrical on each side of the body, each pair being related to a specific organ. In addition, there are two single meridians following the midline of the body, one at the front and the other along the spine."}, {"url": "http://www.naturalwellnessgirl.com/2012/01/the-twelve-major-meridians-of-the-body/", "passage_text": "• Gallbladder meridian. These major meridians of the body are responsible for nourishing their corresponding organ and the other organs around them, fueling and feeding them with energy. Each meridian plays a specific and integral role in their organs health. Their flow is as critical as the flow of blood; your life and health depend on both. Meridians of the body affect all major systems including: immune, nervous, endocrine, circulatory, respiratory, digestive, skeletal, muscular and the lymphatic system."}, {"url": "http://www.natural-health-zone.com/body-meridians.html", "passage_text": "They are energy channels 'transporting' life energy (Chi/Qi) throughout the body. If there are blockages, leading to lack of energy supply to certain areas of the body, or a surplus of energy in other areas... The Body Meridians can be used for Treatment of a condition or/and Diagnosis. Energy blockages can be the result of stress, an injury or trauma, or bad living habits (diet, habits/addictions, lack of exercise) and can be traced to the root of all health (physical/mental/spiritual) problems. Our energy flow affects how we feel, how we think, and the over all condition of our health situation. When the body's life-force energy becomes blocked, various imbalances will result."}]