[{"url": "http://www.city-data.com/city/Devine-Texas.html", "passage_text": "Texas: 16.5%. According to our research of Texas and other state lists there were 26 registered sex offenders living in Devine, Texas as of October 05, 2015. The ratio of number of residents in Devine to the number of sex offenders is 171 to 1."}, {"url": "https://tshaonline.org/handbook/online/articles/hgd05", "passage_text": "It was named for Judge Thomas Jefferson Devine of San Antonio, an eminent Texas jurist and attorney for the railroad. Devine had a population of 504 when it was incorporated in 1904. It operates under the aldermanic form of government."}, {"url": "http://www.topix.com/city/devine-tx", "passage_text": "Local news for Devine, TX continually updated from thousands of sources on the web."}, {"url": "https://www.coldwellbanker.com/real_estate/home_search/Texas/Devine", "passage_text": "Half the population of Devine commutes 25 minutes or less to work, with 29% of residents holding white collar jobs and 71% residents holding blue collar jobs. The median age of homes in Devine, TX is 28 years, with 63% of those homes owned, 26% rented, and 10% not occupied. In the previous year, 43 Devine properties were sold. The median sale price of a home in Devine in the previous year was $127,475."}, {"url": "https://www.coldwellbanker.com/real_estate/home_search/Texas/Devine", "passage_text": "Devine, Texas is located in Medina County. Devine is a suburban community with a population of 4,424. The median household income is $35,025. In Devine, 42% of residents are married, and families with children reside in 37% of the households."}, {"url": "http://www.devinechamber.com/", "passage_text": "To become a member of the Devine Chamber of Commerce, simply download a Devine Chamber of Commerce Membership Application, fill it out and bring it in. Or you can mail it to Greater Devine Chamber of Commerce, P.O. Box 443, Devine, TX. 78016."}, {"url": "http://www.city-data.com/city/Devine-Texas.html", "passage_text": "Latest news from Devine, TX collected exclusively by city-data.com from local newspapers, TV, and radio stations. Ancestries: German (9.8%), English (8.6%), United States (8.4%), Irish (2.7%), French (2.7%), Italian (1.6%)."}, {"url": "http://www.city-data.com/city/Devine-Texas.html", "passage_text": "Devine-area historical tornado activity is below Texas state average. It is 32% smaller than the overall U.S. average. On 4/15/1973, a category F4 (max. wind speeds 207-260 mph) tornado 22.9 miles away from the Devine city center killed 5 people and injured 12 people."}]