[{"url": "http://www.medilexicon.com/drugs/gilenya.php", "passage_text": "General Information. Gilenya is a sphingosine 1-phosphate receptor modulator. The exact mechanism is unknown, but Gilenya is thought to work by reducing the immune system's attack on the central nervous system by retaining certain white blood cells (lymphocytes) in the lymph nodes. Gilenya is specifically indicated for the treatment of patients with relapsing forms of multiple sclerosis to reduce the frequency of clinical exacerbations and to delay the accumulation of physical disability. Gilenya is supplied as a capsule designed for oral administration."}, {"url": "http://www.everydayhealth.com/drugs/gilenya", "passage_text": "2 Reviews. 2 Reviews. Gilenya is the brand name of the drug fingolimod, which is used to treat symptoms of relapsing forms of multiple sclerosis (MS) . MS is a neurological condition where the immune system attacks the protective covering of nerves. Relapsing MS occurs when symptoms show up from time to time. Gilenya is in a class of drugs known as sphingosine I-phosphate receptor modulators, which work by keeping immune cells in the lymph nodes, so they can't reach and damage the brain or spinal cord."}, {"url": "http://www.webmd.com/drugs/2/drug-154676/gilenya-oral/details", "passage_text": "Uses. This medication is used to treat a certain type of multiple sclerosis (relapsing multiple sclerosis-MS). It is not a cure for MS but it is thought to help by preventing immune system cells (lymphocytes) from attacking the nerves in your brain and spinal cord. It helps decrease the number of episodes of worsening and may prevent or delay disability."}, {"url": "http://www.medilexicon.com/drugs/gilenya.php", "passage_text": "Mechanism of Action. Gilenya is a sphingosine 1-phosphate receptor modulator and binds with high affinity to sphingosine 1-phosphate receptors 1, 3, 4, and 5. Fingolimod-phosphate blocks the capacity of lymphocytes to egress from lymph nodes, reducing the number of lymphocytes in peripheral blood. Gilenya is specifically indicated for the treatment of patients with relapsing forms of multiple sclerosis to reduce the frequency of clinical exacerbations and to delay the accumulation of physical disability. Gilenya is supplied as a capsule designed for oral administration."}, {"url": "http://www.nationalmssociety.org/Treating-MS/Medications/Gilenya", "passage_text": "Gilenya® is a new class of medication called a sphingosine 1-phosphate receptor modulator, which is thought to act by retaining certain white blood cells (lymphocytes) in the lymph nodes, thereby preventing those cells from crossing the blood-brain barrier into the central nervous system (CNS). Gilenya was approved by the U.S. Food and Drug Administration (FDA) in 2010 for adults with relapsing forms of MS to reduce the frequency of clinical relapses and to delay the accumulation of physical disability."}, {"url": "http://www.gilenya.com/index.jsp", "passage_text": "SURE, SIGN ME UP! GILENYA has a pregnancy registry—click here to learn more. * GILENYA can result in a slow heart rate when first taken. You will be observed by a health care professional for at least 6 hours after you take your first dose. You may need to repeat this monitoring if you miss a dose. In 2014, most eligible patients paid a $0 co-pay. Call 1-800-GILENYA for details. "}, {"url": "http://www.webmd.com/multiple-sclerosis/news/20120420/new-warnings-for-ms-drug-gilenya-after-fda-review", "passage_text": "April 20, 2012 -- Novartis, the maker of the drug Gilenya (fingolimod), a once-daily oral capsule taken for multiple sclerosis, has added stronger warnings to labels and prescription information about the drug's possible heart risks, according to a company statement. "}, {"url": "https://en.wikipedia.org/wiki/Fingolimod", "passage_text": "It has reduced the rate of relapses in relapsing-remitting multiple sclerosis by approximately one-half over a two-year period. Fingolimod is a sphingosine-1-phosphate receptor modulator, which sequesters lymphocytes in lymph nodes, preventing them from contributing to an autoimmune reaction. Fingolimod is used in the treatment of the relapsing form of multiple sclerosis. Its effect in those with primary progressive MS is not clear. May also be used in chronic inflammatory demyelinating polyneuropathy"}]