[{"url": "http://work.chron.com/general-practitioner-do-3406.html", "passage_text": "A general practitioner is a family doctor or physician. He provides diagnosis and care for patients in routine cases and usually refers people to specialists when they need specific types of treatment. Ongoing Care. For patients dealing with chronic or ongoing health issues, the general practitioner helps to manage ongoing care. Some patients need regular check-ups so the doctor can monitor their conditions for improvement or decline. Others need reassessment on regular medications."}, {"url": "http://medical-dictionary.thefreedictionary.com/Holistic+Medicine", "passage_text": "A practitioner with a holistic approach treats the symptoms of illness as well as looking for the underlying cause of the illness. Holistic medicine also attempts to prevent illness by placing a greater emphasis on optimizing health. The body's systems are seen as interdependent parts of the person's whole being. There are no limits to the range of diseases and disorders that can be treated in a holistic way, as the principle of holistic healing is to balance the body, mind, spirit, and emotions so that the person's whole being functions smoothly."}, {"url": "http://www.webmd.com/balance/guide/what-is-holistic-medicine", "passage_text": "In this article. Font Size. A. A. A. Holistic medicine is a form of healing that considers the whole person -- body, mind, spirit, and emotions -- in the quest for optimal health and wellness. Holistic medicine is also based on the belief that unconditional love and support is the most powerful healer and a person is ultimately responsible for his or her own health and well-being. Other principles of holistic medicine include the following:"}, {"url": "http://www.aihw.gov.au/medical-practitioner-related-definitions/", "passage_text": "1 Specialist-in-training and from 2006. 2  Other: a clinical job function in medicine which is not one of the above. 3  Non-clinician: A medical practitioner who is not a clinician. In the AIHW Medical Labour Force Survey, primary care practitioners are defined as medical practitioners who reported that they were employed at the time of the survey, they spent most of their time working as clinicians in the week before the survey, and their main area of clinical practice was primary or general care."}, {"url": "http://www.aihw.gov.au/medical-practitioner-related-definitions/", "passage_text": "A medical practitioner who reported that he or she worked mainly, or only, in his or her state of registration, in medicine, in the week before the survey for pay, commission, payment in kind or profit. In this report, data on employed medical practitioners include those who are: In the AIHW Medical Labour Force Survey, primary care practitioners are defined as medical practitioners who reported that they were employed at the time of the survey, they spent most of their time working as clinicians in the week before the survey, and their main area of clinical practice was primary or general care."}, {"url": "http://www.aihw.gov.au/medical-practitioner-related-definitions/", "passage_text": "1 Specialist. 2  Specialist-in-training and from 2006. 3  Other: a clinical job function in medicine which is not one of the above. 4  Non-clinician: A medical practitioner who is not a clinician. In the AIHW Medical Labour Force Survey, primary care practitioners are defined as medical practitioners who reported that they were employed at the time of the survey, they spent most of their time working as clinicians in the week before the survey, and their main area of clinical practice was primary or general care."}, {"url": "http://medical-dictionary.thefreedictionary.com/Holistic+Medicine", "passage_text": "Definition. Holistic medicine is a term used to describe therapies that attempt to treat the patient as a whole person. That is, instead of treating an illness, as in orthodox allopathy, holistic medicine looks at an individual's overall physical, mental, spiritual, and emotional wellbeing before recommending treatment. There are no limits to the range of diseases and disorders that can be treated in a holistic way, as the principle of holistic healing is to balance the body, mind, spirit, and emotions so that the person's whole being functions smoothly."}, {"url": "http://www.audioenglish.org/dictionary/practitioner.htm", "passage_text": "Meaning: Someone who practices a learned profession. Classified under: Nouns denoting people. Synonyms: practician; practitioner. Hypernyms (practitioner is a kind of...): professional; professional person (a person engaged in one of the learned professions). "}, {"url": "http://www.aihw.gov.au/medical-practitioner-related-definitions/", "passage_text": "A medical practitioner mainly employed in a salaried position in a hospital who does not have a recognised specialist qualification and who is not in training to gain a recognised specialist qualification. In the AIHW Medical Labour Force Survey, primary care practitioners are defined as medical practitioners who reported that they were employed at the time of the survey, they spent most of their time working as clinicians in the week before the survey, and their main area of clinical practice was primary or general care."}, {"url": "http://www.thefreedictionary.com/medical+practitioner", "passage_text": "We hear sometimes of an action for damages against the unqualified medical practitioner, who has deformed a broken limb in pretending to heal it. The Life and Adventures of Nicholas Nickleby by Dickens, Charles View in context. "}]