[{"url": "http://www.nhs.uk/Livewell/puberty/Pages/Startingperiods.aspx", "passage_text": "Typically, you'll start your periods about two years after your breasts start growing and about a year after getting a white vaginal discharge. The average girl will get her first period around 12 years old, but it varies from person to person. "}, {"url": "http://www.mumsnet.com/pre-teens/starting-periods", "passage_text": "Signs that periods are about to start. 1  Budding breasts are a sign your daughter's first period is one to two years away. 2  A whitish or yellowy discharge is a sign that a period isn't far off. 3  Some girls report tummy aches in the months leading up to their first period and you may notice a semi pre-menstrual pattern. Starting periods. Most girls in Britain start their periods between 12 and 13 years of age. But it's been getting younger over recent decades and on our Talk boards, many Mumsnetters are worrying about their daughters' symptoms from as early as seven or eight"}, {"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/menstruation.html", "passage_text": "It also prepares your body for pregnancy each month. A cycle is counted from the first day of 1 period to the first day of the next period. The average menstrual cycle is 28 days long. Cycles can range anywhere from 21 to 35 days in adults and from 21 to 45 days in young teens. The rise and fall of levels of hormones during the month control the menstrual cycle. But, anywhere from 2 to 7 days is normal. For the first few years after menstruation begins, longer cycles are common. A woman's cycle tends to shorten and become more regular with age. Most of the time, periods will be in the range of 21 to 35 days apart."}, {"url": "http://www.everydayhealth.com/pms/a-teens-guide-to-her-first-period.aspx", "passage_text": "The typical menstrual cycle is 28 days long, but periods are often irregular during the first few years of menstruation. During this time, girls may skip menstrual cycles, or the cycles may occur multiple times in one month, or less frequently than expected. Even though these fluctuations are common during the first few years of menstruation, talk with your daughter's doctor if her periods do not seem regular. As for the emotional side of periods, your daughter may be excited about the arrival of her period; after all, it is a rite of passage into adulthood."}, {"url": "http://www.answers.com/Q/What_is_the_average_age_for_a_girl_to_get_her_period", "passage_text": "the average age for a girls period 2 start is 11-16 but you can start your period at any time in your life but if you haven't started it by the time you are 18 go and see a do … ctor. The average age is 12, but this does not mean that all girls start at the same age. A girl can start her period anytime between the ages of eight and 15. Usually, the first period starts about two years after breasts first start to grow"}, {"url": "http://www.womenshealth.gov/publications/our-publications/fact-sheet/menstruation.html", "passage_text": "In the United States, the average age for a girl to get her first period is 12. This does not mean that all girls start at the same age. A girl can start her period anytime between the ages of 8 and 15. Most of the time, the first period starts about 2 years after breasts first start to develop. If a girl has not had her first period by age 15, or if it has been more than 2 to 3 years since breast growth started, she should see a doctor. But, anywhere from 2 to 7 days is normal. For the first few years after menstruation begins, longer cycles are common. A woman's cycle tends to shorten and become more regular with age. Most of the time, periods will be in the range of 21 to 35 days apart."}, {"url": "http://teens.webmd.com/girls-puberty-10/girls-first-period", "passage_text": "When that happens, you’ll know that her first period may not be far off: The development of breast buds usually precedes a girls’ first period by about two years, while pubic and underarm hair usually begins to appear about six months before the onset of menstruation. Your body will change in lots of ways as you get ready to be a grown-up woman.”. 2. As your daughter gets older, get into specifics. You can talk with her more about what that menstruation means -- such as what her first period will be like and being able to get pregnant if she has sex."}, {"url": "https://www.humana.com/learning-center/health-and-wellbeing/healthy-living/menstruation", "passage_text": "The average menstrual cycle lasts 28 days. This is the time from the first day of one period to the first day of the next period. Cycles in young teens can range from 21 to 45 days. But they're usually longer for the first few years. Teach your daughter how to track her periods on a calendar. In time, she might be able to predict when her periods will start. In the United States, the average age for a girl to get her first period is 12. But that doesn't mean all girls start at the same age. A girl can start her period anytime between the ages of 8 and 15. This is another reason the conversations need to start earlier than you may think."}, {"url": "http://www.answers.com/Q/What_is_the_average_age_for_a_girl_to_get_her_period", "passage_text": "Confidence votes 357. The average age is 12, but this does not mean that all girls start at the same age. A girl can start her period anytime between the ages of eight and 15. Usually, the first period starts about two years after breasts first start to grow"}]