[{"url": "http://www.ducksters.com/science/composition_of_the_earth.php", "passage_text": "The Earth's inner core is made up of iron and nickel, just like the outer core, however, the inner core is different. The inner core is so deep within the earth that it's under immense pressure. So much pressure that, even though it is so hot, it is solid. Outer Core. The Earth's outer core is made up of iron and nickel and is very hot (4400 to 5000+ degrees C). This is so hot that the iron and nickel metals are liquid! The outer core is very important to earth as it creates something called a magnetic field."}, {"url": "http://www.space.com/17777-what-is-earth-made-of.html", "passage_text": "The thickest parts are under the continents and the thinnest parts are under the oceans. Crust. Earth's crust is made up of several elements: oxygen, 47 percent; silicon, 27 percent; aluminum, 8 percent; iron, 5 percent; calcium, 4 percent; magnesium, potassium and sodium, 2 percent. Core. At the center of the Earth is the core, which has two parts. The solid, inner core of iron has a radius of about 760 miles (about 1,220 km). It is surrounded by a liquid, outer core composed of a nickel-iron alloy. It is about 1,355 miles (2,180 km) thick."}, {"url": "http://coolcosmos.ipac.caltech.edu/ask/58-What-is-Earth-made-of", "passage_text": "Deep inside Earth, near its center, lies Earth's core which is mostly made up of nickel and iron. Above the core is Earth's mantle, which is made up of rock containing silicon, iron, magnesium, aluminum, oxygen and other minerals. The rocky surface layer of Earth, called the crust, is made up of mostly oxygen, silicon, aluminum, iron, calcium, sodium, potassium and magnesium."}, {"url": "http://www.scienceterrific.com/atmosphere_composition.php", "passage_text": "There are many things in the atmosphere, but basically it is made up of two different elements which are gases. Measured by volume (not weight) completely dry air contains approximately 78% nitrogen and 21% oxygen with about 1% of everything else. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080109174415AAeWfT8", "passage_text": "Best Answer: The earth is made up of 70% water. So it means we only have 30% land. Earth is also made up of different kind of gases like nitrogen, oxygen. But because of so many carlessness of human beings we are having a global warming. Instead of snowing on winter it had started to be sunny these days. Report Abuse. By mass, the solid mass of the Earth is made up of: - iron 32.1% - oxygen 30.1% - silicon 15.1% - magnesium 13.9% - sulfur 2.9% - nickel 1.8% - calcium 1.5 - aluminum 1.4 - traces of all other elements The actual material of the Earth is mostly rock (which is made up of these elements)."}, {"url": "http://classroom.synonym.com/four-elements-make-up-almost-90-earth-2592.html", "passage_text": "Of the 92 naturally occurring elements, the Earth's geosphere -- the solid part of the Earth made up of the core, the mantle and the crust -- is primarily composed of only four. These four are iron, oxygen, silicon and magnesium. These elements make up more than 90 percent of the Earth's mass. Oxygen, the second most abundant element on Earth, is found mainly in the crust. Although oxygen is most often thought of as an atmospheric gas, it is also one of the primary components of the silicate minerals that make up the vast majority of the Earth's crust."}, {"url": "https://simple.wikipedia.org/wiki/Earth", "passage_text": "The center of the earth (the Earth's core) is mostly iron (88.8%), nickel (5.8%), sulfur (4.5%), and less than 1% other things. The Earth's crust is largely oxygen (47 %). Oxygen is normally a gas but it can join with other chemicals to make compounds like water and rocks. 99.22 % of rocks have oxygen in them. Earth is the third planet from the Sun and it is the only planet known to have life on it. The Earth formed around 4.5 billion years ago. It is one of four rocky planets on the inside of the Solar System."}]