[{"url": "http://homeguides.sfgate.com/ficus-identification-94361.html", "passage_text": "Ficus, also known as “fig,” is a group of more than 800 tropical and semitropical trees, shrubs and vines. Figs generally thrive in U.S. Department of Agriculture (USDA) plant hardiness zones 8 through 12, depending on the species. The shape and size of fig plants can help you identify those plants. Weeping fig, for example, is a shade tree that grows up to 60 feet tall and has a dense, rounded crown that spreads up to 100 feet wide."}, {"url": "http://www.gardenguides.com/128233-ficus-tree-identification.html", "passage_text": "Overview. Although ficus trees, also known as figs, are small, tough trees, many are discarded because a ficus can appear to fall apart soon after it comes to a new environment, according to FicusTree.com. New ficus caretakers often don't realize that leaf loss is common with ficus trees. It's usually caused by excessive or inadequate watering, pests or environmental changes. According to Plant Care.com, a ficus tree can typically shed about 20 percent of its leaves when adjusting to a new environment. The tree's fruit, which is pear-shaped, is actually a fleshy hollow receptacle, known technically as a synconium. Ficus fruits come in several colors including yellowish-green, copper, dark purple and bronze. Seeds vary in size, from small to large and can include anywhere from 30 to 1,600 for each fruit."}, {"url": "http://motherhood.modernmom.com/diseases-ficus-elastica-13692.html", "passage_text": "Diseases of Ficus Elastica. Ficus elastica, more commonly known as the rubber tree, is a tropical-looking plant that thrives outdoors only in very warm climates, including U.S. Department of Agriculture plant hardiness zones 10 and 11. Gardeners living in cooler areas frequently enjoy growing rubber trees as houseplants, however. "}, {"url": "http://www.gardenguides.com/101093-identify-ficus.html", "passage_text": "Overview. Although more than 800 species belong to the Ficus genus, referred to as the fig group, most individuals will encounter only a handful of these species. Some Ficus species are trees, some are vines and others are shrubs. Ficus trees are popular houseplants prized for their attractive foliage. Step 6. Look for a Ficus tree with small reddish-orange flowers and glossy, dark-green leaves to identify the Moreton Bay fig (F. macrophylla). The leaves often have a leathery texture and the tree sprouts aerial roots in higher humidity."}, {"url": "http://www.gardenguides.com/128233-ficus-tree-identification.html", "passage_text": "Size. The ficus tree is only about 3 to 9 feet tall. It has many spreading branches and a trunk that is rarely more than 7 inches wide. The tree's root system, which is shallow and spreading, can sometimes cover 50 feet of ground, although in porous soils some roots can be as deep as 20 feet. The tree's fruit, which is pear-shaped, is actually a fleshy hollow receptacle, known technically as a synconium. Ficus fruits come in several colors including yellowish-green, copper, dark purple and bronze. Seeds vary in size, from small to large and can include anywhere from 30 to 1,600 for each fruit."}, {"url": "http://www.gardenguides.com/128233-ficus-tree-identification.html", "passage_text": "Types. Ficus Monique is an erect plant with bright, shiny leaves that are crispy and hard at maturity. Unlike most ficus trees, this species does not drop leaves. Besides standard trees, ficus moniques comes in other shapes, such as bushy or topiary forms. The tree's fruit, which is pear-shaped, is actually a fleshy hollow receptacle, known technically as a synconium. Ficus fruits come in several colors including yellowish-green, copper, dark purple and bronze. Seeds vary in size, from small to large and can include anywhere from 30 to 1,600 for each fruit."}, {"url": "https://en.wikipedia.org/wiki/Ficus", "passage_text": "Ficus (/ˈfaɪkəs/ or /ˈfiːkəs/) is a genus of about 850 species of woody trees, shrubs, vines, epiphytes and hemiepiphytes in the family Moraceae. Among the more famous species are the sacred fig tree (Pipal, bodhi, bo, or po, Ficus religiosa) and the banyan fig (Ficus benghalensis). The oldest living plant of known planting date is a Ficus religiosa tree known as the Sri Maha Bodhi planted in the temple at Anuradhapura, Sri Lanka by King Tissa in 288 BCE."}, {"url": "http://homeguides.sfgate.com/diseases-ficus-leaves-76218.html", "passage_text": "Wet foliage bolsters the cercospora fungus, so water ficus plants at their bases rather than by spraying water overhead. Another leaf spot disease of ficus, bacterial leaf spot, primarily infects weeping fig trees (Ficus benjamina). Weeping fig trees grow up to 60 feet tall and are hardy in USDA zones 10 and 11. The disease causes angular yellow leaf spots, which eventually become brown. Infected leaves fall off as the disease progresses. "}]