[{"url": "http://mexicanfood.about.com/od/flavorsofmexico/a/Mexicanflavors.htm", "passage_text": "It is commonly used in conjunction with garlic. Spices. Other common flavors are oregano, cumin and chili powder. Mexican oregano gives their dishes a rich earthy flavor. There are other types of oregano such as Mediterranean. You are probably familiar with this version used in Italian cuisine. Let's start with the most common flavors you may find in Mexican food. First there is garlic. It comes fresh, in a jar or in powdered form and is used in many recipes. Salsa, taco seasoning and Spanish rice are just a few recipes that use garlic. Next is onion which usually comes fresh or powdered."}, {"url": "http://mexicanfood.about.com/od/introtomexicanfood/a/Ingredients.htm", "passage_text": "Native Ingredients. Meat was scarce before the Spaniards arrived, so the Mexican natives used corn and beans as their main nutritional staple. Chiles and heavy spices were used to give their dishes flavor. Mexico's seaside communities relied on the plentiful array of seafood as a source of meat for their dishes. Another widely used ingredient are beans, such as black beans and pinto beans. They are used to make dishes such as refried beans, bean salads, soups and more. Fats. You won't find butter in traditional Mexican cuisine."}, {"url": "http://mexicanfood.about.com/od/introtomexicanfood/a/Ingredients.htm", "passage_text": "Tomatoes are not usually used to make a sauce. Most of the red sauces you find in Mexico are made from chiles. Cooked or canned tomatoes are also used as flavors for rice, salads and soups. Unusual Ingredients. Sometimes unusual ingredients are used to layer flavors. Another widely used ingredient are beans, such as black beans and pinto beans. They are used to make dishes such as refried beans, bean salads, soups and more. Fats. You won't find butter in traditional Mexican cuisine."}, {"url": "https://en.wikipedia.org/wiki/Mole_(sauce)", "passage_text": "Three states in Mexico claim to be the origin of mole: Puebla, Oaxaca, and Tlaxcala. The states with the best known moles are Puebla and Oaxaca, but other regions in Mexico also make various types of mole sauces. Moles come in various flavors and ingredients, with chili peppers as the common factor. "}, {"url": "http://casablancamexican.com/essential-ingredients-in-traditional-mexican-food/", "passage_text": "There are staple Mexican ingredients that tend to always make the list, such as cilantro, cumin, chili powder and black pepper. It’s also a great truth to note that not all ingredients used to make traditional Mexican food are spicy in nature. There are plenty of sweets to enjoy in Mexican cuisine! Essential Ingredients for Mexican Cooking Checklist Stock your pantry with a few basic ingredients to create an authentic Mexican meal. Avocadoes: This rich, buttery fruit is a true Mexican staple. Avocado adds a Mexican flair to almost any dish, including such basics as sandwiches and salads."}, {"url": "http://www.mexgrocer.com/catagories-ingredients.html", "passage_text": "Ingredients are essential for real authentic Mexican cooking. You can achieve a flavorful meal with substitutes, but in order to really enjoy Mexican food as it is intended you need to get authentic ingredients. Seasoning and flavoring is essential, and MexGrocer.com brings you a succulent variety of seasonings, powders, cooking mixes, mayonnaise and extracts. Make foods like meat, fish, chicken, tacos, and sandwiches tastier, as well as give flavor to fruits and desserts with tangy spicy powders and sweet vanilla extracts."}, {"url": "http://mexicanfood.about.com/od/introtomexicanfood/a/Ingredients.htm", "passage_text": "Chiles. One of the first things that may come to mind when you think of Mexican food are chiles. There are many types of chiles used such as the spicy jalapeno, the flavorful ancho and the fiery serrano. Chiles flavor anything from soups and sauces to salsas and mole. Another widely used ingredient are beans, such as black beans and pinto beans. They are used to make dishes such as refried beans, bean salads, soups and more. Fats. You won't find butter in traditional Mexican cuisine."}, {"url": "http://casablancamexican.com/most-commonly-used-mexican-spices/", "passage_text": "Mexican Spices: Garlic. Garlic is one of the most common Mexican spices. Garlic can be found in fresh, jarred, or powder form. It is often incorporated into salsa and taco seasoning. A Mexican spice that is commonly used in conjunction with garlic is onion powder. Mexican Spices: Oregano. Oregano is another commonly used Mexican spice. There are many different types of oregano, such as Mexican oregano and Mediterranean oregano. Adding oregano to your Mexican dishes will create a fresh, earthy taste."}, {"url": "http://casablancamexican.com/essential-ingredients-in-traditional-mexican-food/", "passage_text": "Perhaps the ingredients used in traditional Mexican food dishes are what make this style of cooking so loved, by so many. The common ingredients used in traditional Mexican food recipes are often influenced by regional differences – some Mexican seafood dishes are more popular along the coast, for instance. Traditional Mexican food has certainly made its mark on the United States. Essential Ingredients for Mexican Cooking Checklist Stock your pantry with a few basic ingredients to create an authentic Mexican meal. Avocadoes: This rich, buttery fruit is a true Mexican staple. Avocado adds a Mexican flair to almost any dish, including such basics as sandwiches and salads."}, {"url": "http://www.wisegeek.org/what-are-the-main-ingredients-in-mexican-food.htm", "passage_text": "Menudo, a stew of tripe and hominy, is also an authentic dish. Cheese is also used in Mexican cooking, but usually not the processed cheese food often used in the U.S. Manchego, for instance, is a very popular cheese in Mexico. A variety of sweets, often flavored with honey or cocoa, are also included in Mexican cuisine. Garlic is often used in Mexican foods. A plate of enchiladas topped with salsa verde and a side of Mexican rice contain many of the typical ingredients found in Mexican dishes. Mexican food is a mix of the Spanish cuisine brought by the conquistadors and native dishes of the Mayans and Aztecs."}]