[{"url": "https://www.opiates.com/opioids-opiates/", "passage_text": "Opiates are narcotic analgesics that directly depresses the central nervous system. Opiates are derived from the opium poppy, but can also be manufactured in laboratories. Collectively these naturally and produced substances are called opioids. To learn more about the Waismann Method of rapid detox, please choose an opioid from the list below. 1  Actiq. 2  Detox. 3  Addiction. 4  Detox Center."}, {"url": "http://www.narcotics.com/opioids/", "passage_text": "Opioid drugs belong to the opiates class of drugs. Opiates are derived from the opium plant, grown in various regions, some of which include Afghanistan, Thailand, Mexico, Northern India, Hungary, Turkey, Laos, Burma and Colombia. Opioids are synthetic formulations of the original plant material."}, {"url": "http://opium.com/derivatives/opiate-vs-opioid-whats-difference/", "passage_text": "This property originates from the plant alkaloids. Opiate drug types include heroin, opium, morphine and codeine. Both opiates and opioids are in some way derived from opium. While similar to opiates, opioids are actually synthetic drugs that produce opiate-like effects, according to a Yale University report. So when comparing opiate vs. opioid, both substances produce pain-killing effects. "}, {"url": "https://en.wikipedia.org/wiki/Opiates", "passage_text": "There are several semi-synthetic opioids derived from the opiate morphine. Heroin (diacetylmorphine) is a morphine prodrug, meaning that it is metabolized by the body into morphine after administration. One of the major metabolites of heroin, 6-monoacetylmorphine (6-MAM), is also a morphine prodrug. "}, {"url": "http://detoxanswers.com/questions/420/opiate-vs-opioid-what-is-the-difference-between-opiate-and-opioid", "passage_text": "6. An opiate is a substance derived from the poppy plant (which contains opium). Opiates are sometimes called natural since the active ingredient molecules are made by nature, not manufactured by chemical synthesis. Common opiates include morphine and codeine, both made directly from poppy plants. An opioid is a substance (molecule) that is synthetic or partly synthetic, meaning the active ingredients (molecules) are manufactured via chemical synthesis."}, {"url": "http://www.news-medical.net/health/What-are-Opioids.aspx", "passage_text": "By Dr Ananya Mandal, MD. Opioids have similar properties to the opium from which they are derived. One of the main functions of opioids is to produce sedation and pain relief and they have been used for pain relief over thousands of years. "}, {"url": "https://www.opiates.com/opioids/", "passage_text": "Opioids are potent analgesic drugs that are often prescribed to relieve acute pain, pain from serious illnesses such as cancer and chronic pain. Some are used to suppress chronic cough and diarrhea. Opioids include naturally occurring opiates derived from the opium poppy plant such as morphine and codeine, synthetic opiates such as fentanyl and semi-synthetic opiates including oxycodone and hydrocodone. Opioids are thought to block pain signals in the brain by attaching to certain opioid receptors. "}, {"url": "http://detoxanswers.com/questions/420/opiate-vs-opioid-what-is-the-difference-between-opiate-and-opioid", "passage_text": "An opiate is a substance derived from the poppy plant (which contains opium). Opiates are sometimes called natural since the active ingredient molecules are made by nature, not manufactured by chemical synthesis. Common opiates include morphine and codeine, both made directly from poppy plants. An opioid is a substance (molecule) that is synthetic or partly synthetic, meaning the active ingredients (molecules) are manufactured via"}, {"url": "https://en.wikipedia.org/wiki/Opioid", "passage_text": "Opioids are substances that act on the nervous system in a similar way to opiates such as morphine and codeine. In a medical context the term usually indicates medications that are artificially made rather than extracted from opium. Opioid like compounds found in natural opium latex are classified as opiates, not opioids. In 2013 between 28 and 38 million people used opioids recreationally (0.6% to 0.8% of the global population between the ages of 15 and 65)."}, {"url": "http://www.testcountry.com/wiki/opioids-abuse-signs-symptoms-testing.html", "passage_text": "Opiates refer to the drugs that are derived from the opium poppy plant while opioids refer to the drugs that are created to mimic the effect of opium. Opioids are synthetic opiates. Although they resemble the same effect to humans, they are chemically different. "}]