[{"url": "http://www2.hawaii.edu/%7Enahl/students/677.interface.street.html", "passage_text": "ScienceDirect covers a broad range of subject fields from Agricultural Science to Social Sciences to Engineering and Technology, and most sciences in between. The database offers both published and in press articles in full-text format. In addition, links to another one million full-text articles by providing references and links to other publishers' platforms. The database is available only through subscription, and there are various tiers of services, depending on the price and type of subscription."}, {"url": "http://www.sciencedirect.com/science/book/9781483184043", "passage_text": "Database: Principles Programming Performance provides an introduction to the fundamental principles of database systems. This book focuses on database programming and the relationships between principles, programming, and performance. Organized into 10 chapters, this book begins with an overview of database design principles and presents a comprehensive introduction to the concepts used by a DBA."}, {"url": "https://www.elsevier.com/solutions/sciencedirect/who-uses", "passage_text": "Who uses ScienceDirect. Discovery is at the heart of science: whether it’s discovering new publications to further a research direction or reaching a new outcome to advance science, you depend on having the right resources. ScienceDirect is a smart solution that empowers you to be more impactful in your work. Improve your research output and make a greater impact in your field. With ScienceDirect, you can quickly assess the relevancy of content, extract key insights, and share, connect and collaborate with your peers so that you can carry out more accurate, impactful research."}, {"url": "http://www2.hawaii.edu/%7Enahl/students/677.interface.street.html", "passage_text": "Science Direct is a database of scientific journal article citations and full-text documents produced by Reed-Elsevier Publishers. In addition, links to another one million full-text articles by providing references and links to other publishers' platforms. The database is available only through subscription, and there are various tiers of services, depending on the price and type of subscription."}, {"url": "http://libguides.southernct.edu/sciencedirect/", "passage_text": "ScienceDirect is the search interface for journals and books from Elsevier, one of the world's premier publishers in science, technology, and medicine. We have many current journals in ScienceDirect (back to 1995), a few back files (up to 1995), and a few books. An advanced search, with more search options is available from the Search button. In the All Sources tab, you can search within journals, books, and databases, whether or not we have full text access. The default search will search all journals and books in the database (see the check boxes under the search boxes)."}, {"url": "https://en.wikipedia.org/wiki/Wikipedia:Elsevier_ScienceDirect", "passage_text": "ScienceDirect is their full-text database with almost a quarter of the world's peer-reviewed scientific content. The database includes over 2,500 journals, 900 serials and 26,000 book titles. Journals include, among others, The Lancet, Cell, Current Biology, Biomaterials, Biological Psychiatry, Social Science & Medicine, Current Biology, Cognition, and Behavioural Brain Research. Wikipedia editors may apply for one of these ScienceDirect access collections according to their area of specialty; their account will be valid for a period of one year."}, {"url": "http://www.library.unt.edu/help/tutorials/discovery-park/sciencedirect-tutorial", "passage_text": "Using ScienceDirect. 1  ScienceDirect is primarily used to obtain full text online articles. 2  Since ScienceDirect’s search capabilities include access to Medline, an extensive database focused on the life and medical sciences, it is also useful to use to find articles. A step-by-step tutorial/help guide for using ScienceDirect with special focus on its search alert capabilities"}, {"url": "http://www.sciencedirect.com/", "passage_text": "ScienceDirect is phasing out support for older versions of Internet Explorer on Jan 12, 2016. For the best product experience, we recommend you upgrade to a newer version of IE or use a different browser: Firefox or Chrome. For additional information please see the ScienceDirect Blog page. Articles published in our Open Access journals are made permanently free for everyone to access immediately upon publication. 1  View the Open Access journal directory."}, {"url": "https://en.wikipedia.org/wiki/ScienceDirect", "passage_text": "ScienceDirect is a website operated by the Anglo-Dutch publisher Elsevier. It was launched in March 1997. It is a platform for access to nearly 2,500 academic journals and over 26,000 e-books. "}, {"url": "http://www2.hawaii.edu/%7Enahl/students/677.interface.street.html", "passage_text": "Science Direct claims to be the world's largest full-text database, offering more than 1500 scientific, technical & medical peer-reviewed journals, over 59 million abstracts, two million full-text scientific journal articles, and an ever-expanding suite of bibliographic databases. In addition, links to another one million full-text articles by providing references and links to other publishers' platforms. The database is available only through subscription, and there are various tiers of services, depending on the price and type of subscription."}]