[{"url": "https://www.diabeticlive.com/insulin/syringes/what-you-should-know-about-bd-syringes/", "passage_text": "The syringes are made to use with different sizes of needles. They can be used with the BD Ultra-Fine, BD Ultra-Fine II and BD Micro-Fine needles. The units that are used for the syringes are 1cc (100 unit), ½ cc (50 unit) and 3/10 (30 unit) types. If you use a larger gauge number, that means the needle will be thinner."}, {"url": "http://www.diabeticconnect.com/diabetes-discussions/general/4727-expiration-date-on-syringes", "passage_text": "I have not seen a date on insulin syringe…have a box of 100 in my hands right now, no date…regards packrat2. When I went to my class on how to give myself the shot, the nurse gave me expired syringes."}, {"url": "http://www.upmc.com/patients-visitors/education/diabetes/Pages/insulin-how-to-give-a-shot.aspx", "passage_text": "1 Do not use a drug that is past the expiration date. 2  Look at the insulin. 3  Short or rapid-acting insulin (Regular, Humalog, NovoLog, Apidra) and Lantus or Levemir should appear clear. 4  Do not use it if the drug appears to have pieces in it or is discolored."}, {"url": "http://www.upmc.com/patients-visitors/education/diabetes/Pages/insulin-how-to-give-a-shot.aspx", "passage_text": "1 Check the expiration date on the vial. 2  Do not use a drug that is past the expiration date. 3  Look at the insulin. 4  Short or rapid-acting insulin (Regular, Humalog, NovoLog, Apidra) and Lantus or Levemir should appear clear. 5  Do not use it if the drug appears to have pieces in it or is discolored."}, {"url": "http://www.diabeticconnect.com/diabetes-discussions/general/4727-expiration-date-on-syringes", "passage_text": "expiration date on syringes. By msann Latest Reply 2010-01-17 09:19:32 -0600. Started 2009-12-06 21:59:15 -0600 2 Likes. hey guys, never thought about the expiration on my syringes i dont see one, how long should we use them, will have to ask my pharmist."}, {"url": "https://www.diabeticlive.com/insulin/syringes/what-you-should-know-about-bd-syringes/", "passage_text": "The syringes do not expire and do not have an expiration date. BD Insulin Syringes should only be used for just that—insulin. When purchasing the BD syringes, they will already be sterilized, so you don’t have to concern yourself about germs or infections."}, {"url": "https://www.bd.com/hypodermic/", "passage_text": "BD Medical-Medical Surgical Systems is a global leader for hypodermic needles and syringes. BD has been a pioneer and leader in developing high-quality, easy-to-use injection devices designed to protect healthcare workers from needlestick injuries and exposure to bloodborne pathogens."}, {"url": "https://www.diabeticlive.com/insulin/syringes/what-you-should-know-about-bd-syringes/", "passage_text": "With the BD SafetyGlide, you can use one hand to slide the arm of the syringe; however, with the BD Safety-Lok, you need two hands to slide it. The BD SafetyGlide syringe is used in three different sizes (1 ml, ½ ml and 3/10 ml). The syringes are packages in a count of 100 per box."}]