[{"url": "http://exploration-production-services.de/en/o-onshore.html", "passage_text": "Onshore refers to the mainland. In exploration and production, “onshore” refers to the development of oil fields, gas deposits and geothermal energy on land. In the wind energy sector, “ onshore wind farms ” generate energy with windmills installed on land."}, {"url": "https://au.answers.yahoo.com/question/index?qid=20080606002747AAr01K1", "passage_text": "Report Abuse. Offshore/onshore is generally a term used in Oil and Gas Industry. Offshore is an oil rig stationed in the middle of the sea (like those you see at the North Sea in Europe). Onshore means on land or land base like in Texas."}, {"url": "http://www.merriam-webster.com/dictionary/onshore", "passage_text": "Full Definition of ONSHORE. 1. 2. a: situated on or near the shore as distinguished from being in deep or open water b: situated on land. 3. — on·shore \\ˈȯn-ˈ, ˈaen-ˈän\\ ˈ. Adverb see onshore defined For-english language. Learners see onshore defined for. kids"}, {"url": "http://www.merriam-webster.com/dictionary/onshore", "passage_text": "Full Definition of ONSHORE. 1. 2. a: situated on or near the shore as distinguished from being in deep or open water b: situated on land. 3. — on·shore \\ˈȯn-ˈ, ˈaen-ˈän\\ ˈ. Adverb see onshore defined For-english language. learners"}, {"url": "http://searchcio.techtarget.com/definition/onshore-outsourcing", "passage_text": "Oracle BPM. Onshore outsourcing (also called domestic outsourcing) is the obtaining of services from someone outside a company but within the same country. Also see offshore outsourcing, the obtaining of services from people or companies outside the country."}, {"url": "http://www.differencebetween.com/difference-between-onshore-and-vs-offshore/", "passage_text": "Onshore vs Offshore. The words onshore and offshore have traditionally been used in the context of oil exploration and drilling. Of late however, the terms have become associated with many other businesses that seem to have confused many regarding the differences between these two words."}]