[{"url": "http://www.metrolyrics.com/the-moon-song-lyrics-karen-o.html", "passage_text": "The Moon Song was written by Jonze, Spike / Orzolek, Karen Lee. The Moon Song was written by Jonze, Spike / Orzolek, Karen Lee. The Moon Song written by Karen O. and Spike Jonze."}, {"url": "http://www.lyricfind.com/", "passage_text": "Digital Music Marketing Manager ». LyricFind, the world's leader in B2B lyric licensing, is looking for a dynamic Marketing Manager to take on the task of leading our marketing efforts and increasing our profile."}, {"url": "http://www.metrolyrics.com/the-moon-song-lyrics-karen-o.html", "passage_text": "Submit Corrections Cancel. I'm lying on the moon. My dear, I'll be there soon. It's a quiet and starry place. Time's we're swallowed up. In space we're here a million miles away. There's things I wish I knew. There's no thing I'd keep from you. It's a dark and shiny place. But with you my dear."}, {"url": "https://en.wikipedia.org/wiki/By_the_Light_of_the_Silvery_Moon_(song)", "passage_text": "By The Light of the Silvery Moon or By the Light of the Silv'ry Moon is a popular song. The music was written by Gus Edwards, and the lyrics by Edward Madden. The song was published in 1909 and first performed on stage by Lillian Lorraine. It was one of a series of moon-related Tin Pan Alley songs of the era."}, {"url": "http://www.songfacts.com/", "passage_text": "1 We send out the Songfacts Newsletter once a month. 2  It contains a big list of the new songs that were added, information on recent interviews, and updates on what's happening in the fishbowl. 3  If you'd like to receive the Songfacts Newsletter, please enter the email you'd like it sent to below:"}, {"url": "http://www.songfacts.com/", "passage_text": "Get the Newsletter. 1  We send out the Songfacts Newsletter once a month. 2  It contains a big list of the new songs that were added, information on recent interviews, and updates on what's happening in the fishbowl. 3  If you'd like to receive the Songfacts Newsletter, please enter the email you'd like it sent to below:"}]