[{"url": "http://www.mayoclinic.org/drugs-supplements/metformin-oral-route/description/DRG-20067074", "passage_text": "Descriptions. Metformin is used to treat high blood sugar levels that are caused by a type of diabetes mellitus or sugar diabetes called type 2 diabetes. With this type of diabetes, insulin produced by the pancreas is not able to get sugar into the cells of the body where it can work properly. Metformin does not help patients does not help patients who have insulin-dependent or type 1 diabetes because they cannot produce insulin from their pancreas gland. Their blood glucose is best controlled by insulin injections."}, {"url": "http://www.joslin.org/info/glucophage.html", "passage_text": "Glucophage (metformin) is one of six types of diabetes pills currently available to treat type 2 diabetes. It helps keep your blood glucose within your target range. Remember, the cornerstone of diabetes control remains unchanged; it is important to follow a meal plan and get plenty of physical activity. 1 Hypoglycemia may occur when Glucophage is taken in combination with insulin or other diabetes pills such as repaglinide (Prandin®), nateglinide (Starlix®) or sulfonylureas. 2  Glucophage has been found to lower blood fat levels and possibly contribute to minor weight loss."}, {"url": "http://www.everydayhealth.com/drugs/metformin", "passage_text": "A: Metformin is an oral diabetes medication that helps control blood glucose (sugar) levels. It is used to treat type 2 diabetes, either alone or in combination with insulin or other medications. Common side effects include headache, weakness, mild nausea, vomiting, diarrhea, gas, and stomach pain. A: Metformin (glucophage) is a medication used to lower blood sugar in type 2 diabetes. The most common side effects with metformin are diarrhea, nausea/vomiting and gas. Other side effects with metformin include indigestion and abdominal discomfort."}, {"url": "http://www.everydayhealth.com/drugs/metformin", "passage_text": "A: Glucophage (metformin) is used to treat type 2 diabetes. Glucophage (metformin) helps control blood sugar in a number of ways. These include helping the body respond better to the insulin it makes naturally, decreasing the amount of sugar the liver makes, and decreasing the amount of sugar the intestines absorb. A: Metformin (glucophage) is a medication used to lower blood sugar in type 2 diabetes. The most common side effects with metformin are diarrhea, nausea/vomiting and gas. Other side effects with metformin include indigestion and abdominal discomfort."}, {"url": "http://www.everydayhealth.com/drugs/metformin", "passage_text": "A: Metformin (Glucophage) is a medication used for the treatment of diabetes or high blood sugar. It works by decreasing the production of glucose by the liver. The main side effects of metformin (Glucophage) are gastrointestinal in nature and include diarrhea, nausea, vomiting and flatulence. A: Metformin (glucophage) is a medication used to lower blood sugar in type 2 diabetes. The most common side effects with metformin are diarrhea, nausea/vomiting and gas. Other side effects with metformin include indigestion and abdominal discomfort."}, {"url": "https://en.wikipedia.org/wiki/Glucophage", "passage_text": "Metformin, marketed under the tradename Glucophage among others, is an antidiabetic medication which is taken by mouth. It is the first-line drug of choice for the treatment of type 2 diabetes, in particular, in overweight and obese people and those with normal kidney function. "}, {"url": "http://www.diabetes.co.uk/diabetes-medication/glucophage.html", "passage_text": "Glucophage is usually prescribed as a treatment for people with type 2 diabetes who are overweight or obese. When diet and exercise fail to adequately control blood glucose levels, Glucophage is prescribed. Sometimes, this medicine is used in conjunction with other anti-diabetic medication. "}, {"url": "http://www.rxlist.com/glucophage-drug/medication-guide.htm", "passage_text": "GLUCOPHAGE and GLUCOPHAGE XR are used to treat type 2 diabetes. This is also known as non-insulin-dependent diabetes mellitus. People with type 2 diabetes are not able to make enough insulin or respond normally to the insulin their bodies make. When this happens, sugar (glucose) builds up in the blood. GLUCOPHAGE and GLUCOPHAGE XR do not cause your body to make more insulin. Because of this, when taken alone, they rarely cause hypoglycemia (low blood sugar), and usually do not cause weight gain. However, when they are taken with a sulfonylurea or with insulin, hypoglycemia is more likely to occur, as is"}, {"url": "http://www.everydayhealth.com/drugs/metformin", "passage_text": "A: Metformin (Glucophage) helps control blood sugar levels in patients with type 2 diabetes. It works to decrease glucose (sugar) production by the liver, decrease absorption of glucose from the food a person eats, and improve insulin sensitivity. A: Metformin (glucophage) is a medication used to lower blood sugar in type 2 diabetes. The most common side effects with metformin are diarrhea, nausea/vomiting and gas. Other side effects with metformin include indigestion and abdominal discomfort."}]