[{"url": "http://www.sciencedirect.com/science/article/pii/S2090074012001004", "passage_text": "The aim of the work was to report the efficacy of fat graft myringoplasty for small tympanic membrane perforations due to: trauma, infection, post tympanostomy tube extraction and post myringoplasty residual perforations. Although fat graft myringoplasty is a simple, safe and cost-effective procedure, it has been underused despite its numerous advantages. 7 However, it cannot be always an alternative procedure to the classic surgical myringoplasty in every tympanic membrane perforation."}, {"url": "https://en.wikipedia.org/wiki/Tympanoplasty", "passage_text": "Tympanoplasty is the surgical operation performed for the reconstruction of the eardrum (tympanic membrane) and/or the small bones of the middle ear (ossicles). Contents. 1 Type 1 involves repair of the tympanic membrane alone, when the middle ear is normal. 2  A type 1 tympanoplasty is synonymous to myringoplasty. 3  Type 2 involves repair of the tympanic membrane and middle ear in spite of slight defects in the middle ear ossicles."}, {"url": "http://medical-dictionary.thefreedictionary.com/myringoplasty", "passage_text": "Etymology: L, myringa + Gk, plassein, to mold. surgical repair of perforations of the eardrum with a tissue graft, performed to correct hearing loss. The openings in the eardrum are enlarged, and the grafting material is sutured over them. Topical antibiotics are applied, then a packing of absorbable gelatin sponge to hold the graft in position. After surgery an antihistamine with an ephedrine derivative is given. The nurse keeps the outer ear clean and dry"}, {"url": "http://medical-dictionary.thefreedictionary.com/tympanoplasty", "passage_text": "tympanoplasty. plastic reconstruction of the bones of the middle ear, with establishment of ossicular continuity from the tympanic membrane to the oval window. This surgical procedure is performed when chronic infection or tumor has led to destruction of the ossicles, of the pars petrosa of the temporal bone, or both. any of several operative procedures on the eardrum or ossicles of the middle ear designed to restore or improve hearing in patients with conductive hearing loss. These operations may be used to repair a perforated eardrum, for otosclerosis, or for dislocation or necrosis of one of the small bones of the middle ear."}, {"url": "http://www.merriam-webster.com/medical/myringoplasty", "passage_text": "Medical Definition of MYRINGOPLASTY. : a plastic operation for the repair of perforations in the tympanic membrane. What made you want to look up myringoplasty? "}, {"url": "http://www.derbyhospitals.nhs.uk/easysiteweb/getresource.axd?assetid=2990&type=0&servicetype=1", "passage_text": "Myringoplasty/ Tympanoplasty What is a myringoplasty and why do I need this operation? Myringoplasty is performed to repair a perforation (hole) of the eardrum. The operation is usually performed because the ear has been discharging and/or has been painful. Sometimes the operation is recommended for patients in order that they may go swimming without the risk of infection. The operation is not performed primarily to improve hearing. What are the benefits of having a myringoplasty? The benefits of having a myringoplasty are that the hole in your ear drum will be repaired which should cure/reduce the amount of discharge and pain you may be experiencing from your ear. There may be an improvement in the hearing although this cannot be guaranteed"}, {"url": "http://www.chicagoear.com/Ear%20Surgery/tympanoplasty.html", "passage_text": "Myringoplasty. Myringoplasty means surgery confined to the tympanic membrane itself. The middle ear bones (ossicles) are not touched and the tympanic membrane is not lifted from its position in the ear canal. Myringoplasty is most often performed in the office for small eardrum perforations."}, {"url": "http://www.sciencedirect.com/science/article/pii/S2090074012001004", "passage_text": "Abstract. A prospective clinical study for reporting the efficacy of fat grafting for small tympanic membrane perforations due to: trauma, infection, post-tympanostomy tube extraction and post myringoplasty residual perforations. Although fat graft myringoplasty is a simple, safe and cost-effective procedure, it has been underused despite its numerous advantages. 7 However, it cannot be always an alternative procedure to the classic surgical myringoplasty in every tympanic membrane perforation."}, {"url": "http://www.surgeryencyclopedia.com/St-Wr/Tympanoplasty.html", "passage_text": "Tympanoplasty, also called eardrum repair, refers to surgery performed to reconstruct a perforated tympanic membrane (eardrum) or the small bones of the middle ear. Eardrum perforation may result from chronic infection or, less commonly, from trauma to the eardrum. The purpose of tympanoplasty is to repair the perforated eardrum, and sometimes the middle ear bones (ossicles) that consist of the incus, malleus, and stapes. Tympanic membrane grafting may be required. If needed, grafts are usually taken from a vein or fascia (muscle sheath) tissue on the lobe of the ear."}]