[{"url": "http://www.merriam-webster.com/dictionary/gabardine", "passage_text": "Full Definition of GABARDINE. 1. : gaberdine 1. 2. a: a firm hard-finish durable fabric (as of wool or rayon) twilled with diagonal ribs on the right side b: a garment of gabardine. See gabardine defined for English-language learners. See gabardine defined for kids. ADVERTISEMENT. : a smooth, stiff type of cloth that is often used for suits."}, {"url": "https://en.wikipedia.org/wiki/Gabardine", "passage_text": "Gabardine was invented in 1879 by Thomas Burberry, founder of the Burberry fashion house in Basingstoke, and patented in 1888. Burberry clothing of gabardine was worn by polar explorers, including Roald Amundsen, the first man to reach the South Pole, in 1911, and Ernest Shackleton, who led a 1914 expedition to cross Antarctica."}, {"url": "https://en.wikipedia.org/wiki/Gabardine", "passage_text": "The fibre used to make the fabric is traditionally worsted wool, but may also be cotton, texturized polyester, or a blend. Gabardine is woven as a warp-faced steep or regular twill, with a prominent diagonal rib on the face and smooth surface on the back. Gabardine always has many more warp than weft yarns. Cotton gabardine is many times used by bespoke tailors to make pocket linings for business suits, where the pocket's contents would quickly wear holes in the usual flimsy pocket lining material. Burberry clothing of gabardine was worn by polar explorers, including Roald Amundsen, the first man to reach the South Pole, in 1911, and Ernest Shackleton, who led a 1914 expedition to cross Antarctica."}, {"url": "http://www.askandyaboutclothes.com/forum/showthread.php?70973-Gabardine-vs-non-gabardine-wool-trousers", "passage_text": "Hidden Content. Gabardine is a tight wool (or cotton once in a while) twill weave that's best for Spring and Fall. It's usually woven in 10-12 ounce weights that are warm in the summer and not warm enough in winter. Will's thoughts on dressing with style. Originally Posted by silverporsche Is there anyway to get rid of the shine on a pair of wool gabardine trousers? The trousers are a part of a dark blue Ralph Laruen suit, the jacket and other sections are fine? Someone once told me that rubbing that area with a (clean!) toothbrush will brush out the shine."}, {"url": "http://www.askandyaboutclothes.com/forum/showthread.php?70973-Gabardine-vs-non-gabardine-wool-trousers", "passage_text": "gabardine is a tough hard wearing cloth cousin to whipcord and cavalry twill. the matting and compressing of the yarns causes shine. the yarns are so tightly woven together that they will shine long long before they will show signs of wear. those areas are usually elbows, seats, and areas of pressure and abrasion. Originally Posted by silverporsche Is there anyway to get rid of the shine on a pair of wool gabardine trousers? The trousers are a part of a dark blue Ralph Laruen suit, the jacket and other sections are fine? Someone once told me that rubbing that area with a (clean!) toothbrush will brush out the shine."}, {"url": "https://en.wikipedia.org/wiki/Gabardine", "passage_text": "Clothing made from gabardine is generally labeled as being suitable for dry cleaning only, as is typical for wool textiles. Gabardine may also refer to the twill-weave used for gabardine fabric, or to a raincoat made of this fabric. Burberry clothing of gabardine was worn by polar explorers, including Roald Amundsen, the first man to reach the South Pole, in 1911, and Ernest Shackleton, who led a 1914 expedition to cross Antarctica."}, {"url": "https://en.wikipedia.org/wiki/Gaberdine", "passage_text": "A man wearing a gaberdine. A gaberdine or gabardine is a long, loose gown or cloak with wide sleeves, worn by men in the later Middle Ages and into the 16th century. In later centuries gaberdine was used colloquially for any protective overgarment, including labourers' smock-frocks and children's pinafores. It is this sense that led Thomas Burberry to apply the name gabardine to the waterproofed twill fabric he developed in 1879."}, {"url": "http://www.wisegeek.com/what-is-gabardine.htm", "passage_text": "These 10 facts about space will blow your mind. Gabardine has long been a fabric choice that comes to mind when the order of the day is durability and style. Here is some historical background on the creation of gabardine, how it is manufactured, and some of the common uses for the fabric. Thomas Burberry created gabardine during the latter part of the 19th century. Post 3. @widget2010, The idea of a gabardine dress, to me, seems like such a timeless and pretty piece. Like you, though, I will need to really save some money before I can buy one that I really like, unless I happen on one in a thrift store, which is always possible too."}, {"url": "http://www.nca-i.com/gabardine.html", "passage_text": "Gabardine is a twill weave that is characterized by raised diagonal ridges on the face of the goods. Gabardine can be made of any fiber including cotton, acetate, rayon, wool and silk. Gabardine fabrics are used in uniforms, casual wear as well as in business attire and dress wear. Depending on the fiber content, gabardine will have a smooth hard surface or a soft dull surface. CORRECTION PROCEDURE ON GABARDINE. To attempt the correction of gabardine shine, (1) spray it with a fine water mist and allow the fabric to dry. Then re-clean it, (2) spray with 5% acetic acid and allow it to dry. Then re-clean it again."}]