[{"url": "http://umm.edu/health/medical/reports/articles/parkinsons-disease", "passage_text": "Introduction. Parkinson's disease (PD) is a slowly progressive neurological disorder that affects movement, muscle control, and balance. Parkinson’s disease is part of a group of conditions called motor system disorders, which are associated with the loss of dopamine-producing brain cells. Parkinson's disease can seriously impair the quality of life in any age group. In addition to motor symptoms (motion difficulties, tremors) Parkinson’s can cause various non-motor problems that have physical and emotional impacts on patients and their families."}, {"url": "http://www.webmd.com/parkinsons-disease/ss/slideshow-parkinsons-overview", "passage_text": "While Parkinson's can be a frightening diagnosis, life expectancy is about the same as for people without the disease. For some people, symptoms evolve slowly over 20 years. Early treatment can provide years that are virtually symptom-free. About 5% to 10% of cases occur before age 50. Distinctive signs of the disease include tremors, stiffness, slowed body movements, and poor balance. Parkinson's was originally called a shaking palsy, but not everyone with Parkinson's has a tremor."}, {"url": "http://www.mayfieldclinic.com/PE-PD.htm", "passage_text": "Parkinson’s Disease (PD) is a chronic, progressive disorder that affects nerve cells deep in the brain responsible for planning and controlling body movement. Dopamine is a chemical used in body movement. "}, {"url": "http://umm.edu/health/medical/reports/articles/parkinsons-disease", "passage_text": "Parkinson's disease is a slowly progressive disorder that affects movement, muscle control, and balance. Part of the disease process develops as cells are destroyed in certain parts of the brain stem, particularly the crescent-shaped cell mass known as the substantia nigra. Parkinson's disease can seriously impair the quality of life in any age group. In addition to motor symptoms (motion difficulties, tremors) Parkinson’s can cause various non-motor problems that have physical and emotional impacts on patients and their families."}, {"url": "http://www.webmd.com/parkinsons-disease/ss/slideshow-parkinsons-overview", "passage_text": "Parkinson's disease is a brain disorder that causes a gradual loss of muscle control. The symptoms of Parkinson's tend to be mild at first and can sometimes be overlooked. Distinctive signs of the disease include tremors, stiffness, slowed body movements, and poor balance. Parkinson's was originally called a shaking palsy, but not everyone with Parkinson's has a tremor."}, {"url": "http://www.rightdiagnosis.com/p/parkinsons_disease/misdiag.htm", "passage_text": "A diagnosis of Parkinson's disease may be delayed or missed because it early symptoms are often vague, start slowly and generally progress gradually. Many people with early symptoms of Parkinson's disease assume their symptoms to be a normal part of aging. Symptoms of Parkinson's disease can also mimic symptoms of other diseases, disorders or conditions, such as depression, essential tremor, Huntington's disease and progressive supranuclear palsy .... The disease Fragile X disorder can show only mild symptoms in the early years, and Parkinsons-like symptoms around age 50. See misdiagnosis of Parkinson's disease. Brain pressure condition often misdiagnosed as dementia: A condition that results from an excessive pressure of CSF within the brain is often misdiagnosed."}, {"url": "http://abcnews.go.com/Health/video/nph-mimic-alzheimers-parkinsons-diseases-18193643", "passage_text": "{id:18193643,title:NPH Can Mimic Alzheimer's, Parkinson's Diseases,duration:3:00,description:One of the classic symptoms is a \\magnetic gait,\\ that makes it difficult to walk.,url:/Health/video/nph-mimic-alzheimers-parkinsons-diseases-18193643,section:Health,mediaType:Default}. "}, {"url": "http://www.oom2.com/t16225-mold-can-cause-symptoms-that-mimic-parkinson-s", "passage_text": "Mold can cause symptoms that mimic Parkinson's. Rutgers fungus expert Joan Bennett had always been a skeptic of sick building syndrome – the notion the air in a building can be so toxic it makes people sick. Then the home she owned in New Orleans was flooded by Hurricane Katrina in 2005. "}]