[{"url": "http://familydoctor.org/familydoctor/en/prevention-wellness/food-nutrition/sugar-and-substitutes/sugar-substitutes-what-you-need-to-know/aspartame-what-you-need-to-know.html", "passage_text": "Aspartame can be found in thousands of processed foods and drinks. Products that contain aspartame include yogurt, frozen desserts, pudding, dry dessert mixes, chewing gum, and soft drinks. It is also used as a tabletop sweetener (for example, to sweeten a glass of iced tea). It is a combination of 2 amino acids: aspartic acid and phenylalanine. It is about 200 times sweeter than sugar. Aspartame provides sweetness and enhances the flavor of food without adding as many calories as sugar. Unlike sugar, it does not contribute to tooth decay. It also does not raise blood sugar levels."}, {"url": "http://www.cancer.org/cancer/cancercauses/othercarcinogens/athome/aspartame", "passage_text": "Aspartame has been used in the United States since the early 1980s. It is now found in thousands of different food products. Aspartame is commonly used as a tabletop sweetener, as a sweetener in prepared foods and beverages, and in recipes that do not require too much heating (since heat breaks down aspartame). Most studies in people have not found that aspartame use is linked to an increased risk of cancer. One early study suggested that an increased rate of brain tumors in the US during the 1980s might have been related to aspartame use."}, {"url": "http://www.greenfacts.org/en/aspartame/", "passage_text": "Context-Aspartame is a non caloric sweetener used in many diet soft drinks and food preparations. A number of national and international organizations have assessed its safety and an Acceptable Daily Intake value was established. However, some allegations of side effects have launched a debate. "}, {"url": "https://en.wikipedia.org/wiki/Aspartame", "passage_text": "Aspartame (APM; /ˈaespərteɪm/ ˈæspərteɪm /or/) əˈspɑrteɪm is an, artificial-non saccharide sweetener used as a sugar substitute in some foods and. Beverages in The European, union it is codified As. e951 In the European Union, it is codified as E951. Aspartame is a methyl ester of the aspartic acid / phenylalanine dipeptide. It was first sold under the brand name NutraSweet. It was first synthesized in 1965, and the patent expired in 1992."}, {"url": "http://familydoctor.org/familydoctor/en/prevention-wellness/food-nutrition/sugar-and-substitutes/sugar-substitutes-what-you-need-to-know/aspartame-what-you-need-to-know.html", "passage_text": "Aspartame (two brand names: Equal and Nutrasweet) is a low-calorie sugar substitute. It is a combination of 2 amino acids: aspartic acid and phenylalanine. It is about 200 times sweeter than sugar. Aspartame provides sweetness and enhances the flavor of food without adding as many calories as sugar. Unlike sugar, it does not contribute to tooth decay. It also does not raise blood sugar levels."}, {"url": "https://en.wikipedia.org/wiki/Aspartame", "passage_text": "Aspartame (APM; /ˈaespərteɪm/ ˈæspərteɪm /or/) əˈspɑrteɪm is an, artificial-non saccharide sweetener used as a sugar substitute in some foods and. beverages In the European Union, it is codified as E951. Aspartame is a methyl ester of the aspartic acid / phenylalanine dipeptide. It was first sold under the brand name NutraSweet. It was first synthesized in 1965, and the patent expired in 1992."}, {"url": "http://articles.mercola.com/sites/articles/archive/2011/11/06/aspartame-most-dangerous-substance-added-to-food.aspx", "passage_text": "Aspartame is the technical name for the brand names NutraSweet, Equal, Spoonful, and Equal-Measure. It was discovered by accident in 1965 when James Schlatter, a chemist of G.D. Searle Company, was testing an anti-ulcer drug. Aspartame was approved for dry goods in 1981 and for carbonated beverages in 1983. Diabetes. Aspartame is made up of three chemicals: aspartic acid, phenylalanine, and methanol. The book Prescription for Nutritional Healing, by James and Phyllis Balch lists aspartame under the category of chemical poison.. As you shall see, that is exactly what it is."}, {"url": "https://en.wikipedia.org/wiki/Aspartame", "passage_text": "Aspartame (APM; /ˈaespərteɪm/ ˈæspərteɪm /or/) əˈspɑrteɪm is an, artificial-non saccharide sweetener used as a sugar substitute in some foods and. Beverages in The European, union it is codified As. E951 aspartame is a methyl ester of the aspartic / acid phenylalanine. dipeptide In the European Union, it is codified as E951. Aspartame is a methyl ester of the aspartic acid / phenylalanine dipeptide. It was first sold under the brand name NutraSweet. It was first synthesized in 1965, and the patent expired in 1992."}, {"url": "http://www.cancer.org/cancer/cancercauses/othercarcinogens/athome/aspartame", "passage_text": "Aspartame is one of the most common artificial sweeteners in use today. It is sold under the brand names NutraSweet ® and Equal ® . Aspartame is made by joining together the amino acids aspartic acid and phenylalanine. Amino acids are the building blocks of proteins and are found naturally in many foods. Most studies in people have not found that aspartame use is linked to an increased risk of cancer. One early study suggested that an increased rate of brain tumors in the US during the 1980s might have been related to aspartame use."}]