[{"url": "http://www.mobilehomesell.com/what-is-the-cost-of-moving-a-manufactured-home/", "passage_text": "Monetary Costs. The money you spend on moving your mobile homes depends on the distance of the move. Short distant moves can cost between $1,000–$5,000, while longer trips can cost as much as $15,000 or more. You can determine your cost using this good rule-of-thumb: Estimate about $5–$10 per mile for your move."}, {"url": "http://home.costhelper.com/mobile-home-transport.html", "passage_text": "1 Full-service mobile home moves of about 60 miles that include disconnect, reconnect and transport will cost about $3,000-$5,000 for a single-wide unit, $4,000-$10,000 for a double-wide and $10,000-$14,000 or more for a triple-wide, depending on size and location."}, {"url": "http://www.moving.com/tips/moving-mobile-home-expect-pay/", "passage_text": "For a single-wide move, handling the entire move—from transporting the home within 50 miles to acquiring the permits to hooking up the utilities—will run the customer somewhere around $8,000. For a double-wide home, the price usually falls between $10,000 and $13,000."}, {"url": "http://home.howstuffworks.com/real-estate/moving-tips/house-moving2.htm", "passage_text": "The cost of moving a house starts at about $12 to $16 per square foot but can quickly rise if the home is heavier, bigger or has farther to go [sources: McLinden, Burstein ]. One house builder estimates that moving a large home more than just a few miles can run about $150,000 to $200,000 [source: Fetters ]."}, {"url": "http://thehousingforum.com/how-much-does-it-cost-to-move-a-house/", "passage_text": "The cost for moving any size house can range between $12 and $16 per square foot, so obviously a smaller house with not a long distance to travel will be cheaper to move. The roads traveled during the move can add to the cost of the move."}, {"url": "http://www.movers.com/moving-guides/cost-of-moving-mobile-home.html", "passage_text": "This portion of the move can cost anywhere from $1,500 to $4,500 on average, depending on which services you obtain. In total, moving your mobile home will cost you anywhere in the range of $6,000 to $20,000, based on the size of the home you're moving and how many miles you need to move it. Before the move."}, {"url": "http://azdot.gov/mvd/faq/commercial-driver-license/permits", "passage_text": "If the transporter does not have Arizona transporter plates for the home, a 30-day general-use registration must be purchased to make this move. The cost of this permit is $15. Contact Commercial Permits, located at 1225 N. 25th Ave., Phoenix, AZ 85009."}]