[{"url": "http://www.simple-car-answers.com/Gasoline-Smell-in-Car.html", "passage_text": "4. Faulty canister. 5. Missing gas cap. It really doesn't matter what is causing the gasoline smell in your car, you just need to have it fixed as soon as you start smelling fuel. If the fuel leak is near the engine or exhaust, it could result in a fire and a potential total loss of your vehicle. Gas Cap Causing Gasoline Smell in Car. I know it may seem obvious, but a loose or missing gas cap can cause a fuel smell in your vehicle. You could even have a faulty gas cap that is leaking fumes. A faulty gas cap can also cause the check engine light to illuminate with a DTC on newer cars."}, {"url": "https://answers.yahoo.com/question/index?qid=20110101164950AAsVrW9", "passage_text": "Best Answer: the fuel regulator could be the source of the fuel smell when you start the car. When the regulator goes bad, it leaks extra fuel into the engine. At start up you may notice the smell, but after the car is running it burns the excess fuel, thus you don't notice it any more. I would have the fuel regulator checked and replaced if it is bad. In time it can cause a much bigger headache."}, {"url": "http://www.ehow.com/facts_5750843_could-car-smells-like-gasoline_.html", "passage_text": "Save. If you climb into your car and notice the smell of gasoline, you might start to worry. There are several reasons why your car might smell like gas. While some aren’t serious, there are a few potentially dangerous ones. If you aren’t sure why you smell gas, have your car checked by a professional mechanic. If there’s a serious problem, the mechanic can diagnose the problem. Trying to fix the problem yourself at home can make it worse."}, {"url": "http://www.yotatech.com/f116/why-do-i-smell-gas-when-i-start-up-my-truck-203822/", "passage_text": "That leads to the fuel pressure vsv. If you smell the fuel back by the tank, could be a leak in the back rubber section of the return line (the middle of the line is steel), or it could be a leak due to rusting in the steel high pressure line where it comes out of the tank (the fuel pump bracket). Posts: 49. when the fuel pump outlet line rusted out on my truck I smelled gas for a while but couldn't find any leaks. Then one night I got home and could see gas dripping down the gas tank skid plate. I reached up to the fuel line and it pretty much fell of in my hand. Wouldn't hurt to check that"}, {"url": "http://www.simple-car-answers.com/Gasoline-Smell-in-Car.html", "passage_text": "Gasoline Smell in Car from a Fuel Tank Leak. I would have to say that a fuel tank leak is probably the most common fuel leak of all. There are many reasons for a fuel tank to leak, anything from a rotted tank to a punctured tank. Gas Cap Causing Gasoline Smell in Car. I know it may seem obvious, but a loose or missing gas cap can cause a fuel smell in your vehicle. You could even have a faulty gas cap that is leaking fumes. A faulty gas cap can also cause the check engine light to illuminate with a DTC on newer cars."}, {"url": "http://www.carsdirect.com/car-maintenance/car-smell-gas---what-is-means-and-how-to-fix-it", "passage_text": "If you notice your car has a gas smell, you should get rid of the smell immediately. This is not a normal smell for your vehicle and is normally a sign that there is a problem. It is not enough to spray an air freshener; you need to fix the cause of the smell. The first place to look for a leak in a modern car is the fuel tank vent hose or the fuel injection line. Older cars, pre-1980’s, have a carburetor float bowl. When you shut off a pre-1980 car there is normally some boiled fuel that will create a smell of gas."}, {"url": "https://www.quora.com/Why-does-the-outside-of-my-car-smell-heavily-of-gas-right-after-I-fill-the-tank-up", "passage_text": "Immediately after I fill the gas tank up, my car reeks of gasoline for about a day or two. I can't even park it in my garage because the entire garage smells like fuel if I do. Someone told me it's just because it's an older car (2002). But it concerns me. If either is true, it has nothing to do with the age of the car. I have a 1968 truck that doesn't smell like gas when you fill it up, and I know several people with vehicles older than 2000 who also don't have that issue."}]