[{"url": "http://www.popwarner.com/contact/Frequently_Asked_Questions.htm", "passage_text": "To sign up for Pop Warner football, cheerleading or dance, you must first locate your local program. (Find Your Program) . You can then contact that program to inquire about when and where sign ups are being offered for the upcoming season. How much does it cost to play: "}, {"url": "http://fitness.costhelper.com/gymnastics.html", "passage_text": "1 Recreational classes for children cost about $15-$20 or more per class. 2  Classes typically meet once or twice a week. 3  Preschool-age classes cost slightly less than classes for school-age students. 4  The Little Gym offers classes for kids from 3 months to 12 years for an average of $14-$21 per class depending on location. Discounts: 1  Leotards cost $25-$50. 2  Gymnasts might need other training equipment. 3  If a gymnast is part of a team, there might be traveling costs. 4  Balance beams range from $80 for a low-to-the-ground balance beam, to up to $400 for a competition-size 16-foot balance beam."}, {"url": "http://fitness.costhelper.com/gymnastics.html", "passage_text": "1 Those costs are dependent on the distance traveled to competitions. 2  Entry fees for USA Gymnastics-sanctioned competitions are typically $30-$100. 3  Balance beams range from $80 for a low-to-the-ground balance beam, to up to $400 for a competition-size 16-foot balance beam. Discounts: 1  Leotards cost $25-$50. 2  Gymnasts might need other training equipment. 3  If a gymnast is part of a team, there might be traveling costs. 4  Balance beams range from $80 for a low-to-the-ground balance beam, to up to $400 for a competition-size 16-foot balance beam."}, {"url": "https://en.wikipedia.org/wiki/Van_Cliburn", "passage_text": "It was his recognition in Moscow that propelled Cliburn to international prominence. The first International Tchaikovsky Competition in 1958 was an event designed to demonstrate Soviet cultural superiority during the Cold War, on the heels of that country's technological victory with the Sputnik launch in October 1957. Van Cliburn Way in the Fort Worth Cultural District. Cliburn's 1958 piano performance in Moscow when he won the prestigious Tchaikovsky International Piano Competition has been added to the National Recording Registry in the Library of Congress on March 21, 2013 for long-term preservation."}, {"url": "https://en.wikipedia.org/wiki/Van_Cliburn", "passage_text": "In 1958, during a dinner hosted by the National Guild of Piano Teachers, President and Founder Dr. Irl Allison announced a cash prize of $10,000 to be used for a piano competition named in Van Cliburn’s honor. Van Cliburn Way in the Fort Worth Cultural District. Cliburn's 1958 piano performance in Moscow when he won the prestigious Tchaikovsky International Piano Competition has been added to the National Recording Registry in the Library of Congress on March 21, 2013 for long-term preservation."}, {"url": "http://dance.about.com/od/youngdancers/f/Ballet_Cost.htm", "passage_text": "As far as commitment for ballet as a hobby is concerned, expect to pay somewhere around $60 to $150 per month for tuition, depending on the number of classes your daughter decides to take each week. In addition to tuition, there is the cost of dance clothes, shoes and accessories. "}, {"url": "http://www.cnbc.com/2015/06/16/why-college-costs-are-so-high-and-rising.html", "passage_text": "It's not just the tuition costs at elite universities like Harvard that are outpacing the government's Consumer Price Index. The average cost of tuition and fees a t a private, non-profit, four-year university this school year was $31,231 —up sharply from $1,832 in 1971-1972 (in current dollars) . At public, four-year schools, tuition and fees cost about $9,139 this year. In 1971, for example, Harvard's $2,600 tuition amounted to about 13 weeks' worth of the median household's annual income of $10,285. Today, the median household needs to work for almost a year to pay the full sticker price."}, {"url": "http://www.danceexpo.org/competition", "passage_text": "There is an entrance fee for each competition. Group numbers generally cost about $40-50 per student per competition. Duo/trio dances usually cost about $50-60 per student to enter, and solos are around $90-100. Besides competition fees, each student will be required to purchase specified dance jewelry. The jewelry is inexpensive (usually less than $20 for a choker necklace, and somewhere around $10 for rhinestone earrings)"}, {"url": "http://fitness.costhelper.com/gymnastics.html", "passage_text": "1 Classes for competitive gymnasts typically cost $150-$300 per month, depending on the number of hours gymnasts spend training, according to a survey by USA Gymnastics. 2  An average Level 3 gymnast practices four hours per week for $160 per month. Discounts: 1  Leotards cost $25-$50. 2  Gymnasts might need other training equipment. 3  If a gymnast is part of a team, there might be traveling costs. 4  Balance beams range from $80 for a low-to-the-ground balance beam, to up to $400 for a competition-size 16-foot balance beam."}]