[{"url": "http://doctorbeam.com/liposuction-glastonbury/", "passage_text": "Liposuction in Glastonbury, CT. Dr. Beam offers liposuction for patients in Glastonbury, Hartford, New Britain and surrounding areas of Connecticut. Individuals who have been struggling with localized pockets of fat that won’t respond to diet and exercise often find liposuction to be the perfect solution. Contact Dr. Beam today to schedule your consultation! 1  Connecticut Plastic Surgery. 2  Liposuction Connecticut. 3  Liposuction Glastonbury. 4  Liposuction New Britain. 5  Liposuction West Haven. 6  Liposuction Bristol. 7  Liposuction Hartford."}, {"url": "http://www.smartbeautyguide.com/planning-toolkit/cost", "passage_text": "Average Cost. Fees for cosmetic plastic surgery generally are paid prior to surgery. Oftentimes the consultation fee is deducted from the procedure. Costs vary widely and depend on the complexity of the operation, where the surgery takes place and which anesthetic is administered."}, {"url": "http://www.laserlipoguide.com/laserlipocost.html", "passage_text": "The cost of the anesthesia typically ranges from $500 to $1,000, depending on the type of procedure performed. The cost of the facility usually ranges from $500 to $1,000. Many surgeons have their own laser liposuction clinics. This also greatly affects the cost of the surgery. However, the average laser lipo cost ranges from approximately $1,500 to $15,000. Note: The costs listed above are for general information; prospective patients are advised to check with their local cosmetic surgeon for specific fees and to clarify any doubts and questions that they may have."}, {"url": "http://www.plasticsurgery.org/cosmetic-procedures/liposuction.html?sub=Liposuction+cost", "passage_text": "When choosing a board-certified plastic surgeon in your area for liposuction, remember that the surgeon’s experience and your comfort with him or her are just as important as the final cost of the surgery. Liposuction cost can vary widely. The average fee referenced above does not include anesthesia, operating room facilities or other related expenses. A surgeon’s fee will be based on his or her experience, the type of procedure used, and the geographic office location."}, {"url": "http://www.plasticsurgery.org/cosmetic-procedures/tummy-tuck.html?sub=How+much+does+a+tummy+tuck+cost", "passage_text": "Find Your Surgeon. Find Your Surgeon. The average cost of a tummy tuck is $5,493, according to 2014 statistics from the American Society of Plastic Surgeons. Tummy tuck surgery cost can vary widely. The average fee referenced above does not include anesthesia, operating room facilities or other related expenses"}, {"url": "http://doctorbeam.com/tummy-tuck-glastonbury/", "passage_text": "Tummy Tuck in Glastonbury, CT. Dr. Beam offers tummy tuck surgery for patients in Glastonbury, New Britain, Hartford and surrounding areas of Connecticut. The tummy tuck is designed to sculpt your midsection giving you a flatter, slimmer waistline. Harold Beam M.D. offers plastic and cosmetic surgery to patients in Glastonbury, New Britain, Hartford and surrounding areas of Connecticut. Contact Dr. Beam today to schedule your consultation! 1  Connecticut Plastic Surgery. 2  Tummy Tuck Connecticut. 3  Tummy Tuck Glastonbury. 4  Tummy Tuck New Britain. 5  Tummy Tuck West Haven."}, {"url": "http://www.smartlipo.com/costs.html", "passage_text": "High range: $7,500. Most patients end up paying between $1,500 and $7,500 for each area of their body treated with SmartLipo. Abdominal liposuction could cost as much as $7,500 while smaller areas of the body such as the arms could be as low as $1,500. Talk with your doctor about the costs involved to get an estimate of the procedure for the specific area you’re hoping to have treated. "}, {"url": "http://www.plasticsurgery.org/cosmetic-procedures/liposuction.html?sub=Liposuction+cost", "passage_text": "The average cost of liposuction is $2,971, according to 2014 statistics from the American Society of Plastic Surgeons. Liposuction cost can vary widely. The average fee referenced above does not include anesthesia, operating room facilities or other related expenses. A surgeon’s fee will be based on his or her experience, the type of procedure used, and the geographic office location."}]