[{"url": "http://astro.unl.edu/naap/motion1/cec_units.html", "passage_text": "The celestial equator is the line coplanar with the earth's equator (and 90° to the axis of rotation). The north celestial pole is directly above the earth's north pole and likewise for the south celestial pole. The Celestial Equatorial Coordinate System is based on the concept of the celestial sphere. The celestial sphere is an imaginary sphere of infinite radius surrounding the earth. Locations of objects in the sky are given by projecting their location onto this infinite sphere."}, {"url": "http://pvs.kcc.hawaii.edu/ike/hookele/celestial_sphere.html", "passage_text": "The Celestial Equator is an imaginary line around the middle of the Celestial Sphere, equidistant from the NCP and SCP and on the same plane as the earth's equator. It intersects the Circle of the Horizon at East and due West. A star 15°s above the Western horizon on the Celestial Equator will take one hour to reach the Western horizon and set. At the vernal point, the sun is near the constellation of Pisces on the Celestial Sphere. Stars in this constellation have a RA near 0. Omega Piscium, for example, has an RA of 23h 59m, almost at 0."}, {"url": "http://www.astronomynotes.com/nakedeye/s4.htm", "passage_text": "Celestial objects on the celestial equator are up 12 hours and those south of the celestial equator are above the horizon for less than 12 hours because you see less than half of their total 24-hour path around you. The opposite is true if you are in the southern hemisphere. Because the Earth's equator is 90° away from the north pole, the celestial equator as seen in Los Angeles will arc up to 90 - 34 = 56 degrees above the southern horizon at the point it crosses the meridian."}, {"url": "https://en.wikipedia.org/wiki/Celestial_equator", "passage_text": "The celestial equator is defined to be infinitely distant (since it is on the celestial sphere); thus the observer always sees the ends of the semicircle disappear over the horizon exactly due east and due west, regardless of the observer's position on Earth. (At the poles, though, the celestial equator would be parallel to the horizon.) At all latitudes the celestial equator appears perfectly straight because the observer is only finitely far from the plane of the celestial equator but infinitely far from the celestial equator itself."}, {"url": "https://en.wikipedia.org/wiki/Celestial_equator", "passage_text": "The celestial equator is inclined by 23.4° to the ecliptic plane. The image shows the relations between Earth's axial tilt (or obliquity), rotation axis and plane of orbit. The celestial equator is a great circle on the imaginary celestial sphere, in the same plane as the Earth 's equator. In other words, it is a projection of the terrestrial equator out into space. As a result of the Earth's axial tilt, the celestial equator is inclined by 23.4° with respect to the ecliptic plane. (At the poles, though, the celestial equator would be parallel to the horizon.) At all latitudes the celestial equator appears perfectly straight because the observer is only finitely far from the plane of the celestial equator but infinitely far from the celestial equator itself."}, {"url": "http://www.thefreedictionary.com/celestial+equator", "passage_text": "1. celestial equator-the great circle on the celestial sphere midway between the celestial poles. equinoctial, equinoctial circle, equinoctial line. great circle-a circular line on the surface of a sphere formed by intersecting it with a plane passing through the center. celestial equator. n. 1. (Astronomy) the great circle lying on the celestial sphere the plane of which is perpendicular to the line joining the north and south celestial poles. Also called: equinoctial or equinoctial circle."}, {"url": "http://www.thefreedictionary.com/Equator+(astronomy)", "passage_text": "Noun. 1. celestial equator-the great circle on the celestial sphere midway between the celestial poles. equinoctial, equinoctial circle, equinoctial line. great circle-a circular line on the surface of a sphere formed by intersecting it with a plane passing through the center. 1. (Astronomy) the great circle lying on the celestial sphere the plane of which is perpendicular to the line joining the north and south"}, {"url": "http://www.thefreedictionary.com/Equator+(astronomy)", "passage_text": "celestial equator. n. 1. (Astronomy) the great circle lying on the celestial sphere the plane of which is perpendicular to the line joining the north and south celestial poles. Also called: equinoctial or equinoctial circle"}]