[{"url": "http://www.iwillteachyoutoberich.com/blog/considering-a-career-in-consulting-avoid-these-5-stupid-mistakes/", "passage_text": "David already noted the travel, but I think it’s worth repeating; at an Accenture, Deloitte or Bain, the consulting workforce is expected to be on the road 4-5 days a week, heading to the same spot for several weeks/months at a time. I went into consulting as a college graduate, and from my understanding, pay depends on a few things: the school you went to, your home location, your degree, and the type of consulting you went into (IT, Business, etc.)."}, {"url": "http://www.worthitconsulting.com/", "passage_text": "Worth It! Consulting is an executive search firm with special expertise in Retail, Manufacturing, Textile, Auto Components, Pharma, Logistics & Supply chain, Media and Fashion. Since 2008, We are trusted advisors to CXOs and senior leaders of companies small and large, public and private, family owned, domestic and international."}, {"url": "http://blog.consulting101book.com/is-consulting-worth-it/", "passage_text": "And it dawned on me that this is the business dilemma that my clients face whenever my firm proposes for our consulting services. They wonder if the large fee that we hide at the end of our proposal will provide them with a benefit that exceeds the cost. They also wonder if they could just do it themselves. Core competency. Let’s say your client is an insurance company and needs a web site developed. Web development is well outside of their core competency. If your firm’s specialty is web development, you may be able to convince them that you can do it better and faster than them."}, {"url": "http://www.worthitconsulting.com/", "passage_text": "Worth It!﻿ Consulting﻿ is committed to building world-class management teams for our clients. We view every engagement as an opportunity to add significant value to the organizations and individuals we serve.Our service offerings include Leadership Acquisition and Talent Acquisition. Consulting is an executive search firm with special expertise in Retail, Manufacturing, Textile, Auto Components, Pharma, Logistics & Supply chain, Media and Fashion. Since 2008, We are trusted advisors to CXOs and senior leaders of companies small and large, public and private, family owned, domestic and international."}, {"url": "http://www.investopedia.com/articles/financialcareers/08/management-consulting.asp", "passage_text": "Read on to learn more about management consulting, what the job entails and how consulting might not be the shortcut to the executive suite that many assume it is. (For an overview of careers available in the world of business, see Finding Your Place In The Financial Industry .). Thoughts on Career Paths Aspiring or current consultants should assess their long-term professional goals. Management consulting allows you to hone skills in improving a company's strategy and operations in a variety of settings."}, {"url": "http://www.informationweek.com/strategic-cio/consulting-fees-how-much-are-you-worth/d/d-id/1112988", "passage_text": "Setting an hourly rate is part art and part skill. Set it too high and you risk pricing yourself out of an opportunity; set it too low and you risk miscalculating your worth and losing out on a lot of money. Your goal is to land in the Goldilocks Zone.. It's common to forfeit a sound business strategy in favor of the highest rate. I've been guilty of this, too. "}, {"url": "http://careers-in-business.com/consulting/mcyou.htm", "passage_text": "Given the scope and size of this career opportunity, it is well-worth asking where you might fit into the industry. And, of course, whether you want to fit in. Let's start by asking what skills are in demand among consulting organizations. After all is said and done, consulting is a service profession and most firms screen carefully for commitment to others and ability to excel in meeting client needs. As a consultant you will always be working to help others. Your ability to serve clients will determine your success and the prospects of your employer."}, {"url": "http://careers-in-business.com/consulting/mcyou.htm", "passage_text": "Hence the frenzy to hire the best and the brightest of America's business schools. This intellectual focus of consulting is clearly important in deciding whether you would do well in the field. A good consultant has to be a great thinker with a passion for ideas. You need to be the type that does well in school and likes it. You need to enjoy problem-diagnosis, problem-framing and problem-solving. After all is said and done, consulting is a service profession and most firms screen carefully for commitment to others and ability to excel in meeting client needs. As a consultant you will always be working to help others. Your ability to serve clients will determine your success and the prospects of your employer."}, {"url": "http://www.worthitconsulting.com/", "passage_text": "﻿Talent Acquisition﻿. Worth It! ﻿Consulting﻿ assists organizations with their middle and junior management talent acquisition needs. Our industry insights, resources and access to a global network of talent provide your organization with the people you need-wherever you need them and whenever you need them. Consulting is an executive search firm with special expertise in Retail, Manufacturing, Textile, Auto Components, Pharma, Logistics & Supply chain, Media and Fashion. Since 2008, We are trusted advisors to CXOs and senior leaders of companies small and large, public and private, family owned, domestic and international."}, {"url": "http://careers-in-business.com/consulting/mcyou.htm", "passage_text": "More MBA students are going for consulting than virtually any other field. It's hip again to think, strategize and work closely with clients. Demand is still strong for purveyors of intellectual capital and opportunities for undergrads and MBAs to get on the fast track in consulting remain very real. After all is said and done, consulting is a service profession and most firms screen carefully for commitment to others and ability to excel in meeting client needs. As a consultant you will always be working to help others. Your ability to serve clients will determine your success and the prospects of your employer."}]