[{"url": "http://www.stadiumhotelnetwork.com/pepsi-center/", "passage_text": "View Hotel. 818 17th Street, Denver, CO. 0.6 miles away from Pepsi Center. The Four Seasons Hotel Denver is a downtown landmark located only steps from the Denver Performing Arts complex and The Colorado centre."}, {"url": "http://docomomo-us.org/register/fiche/pepsicola_corporation_world_headquarters", "passage_text": "Located on the southwest corner of Park Avenue and 59th Street, the Pepsi-Cola Building was distinguished from its neighbors, a 20-story neo-Renaissance apartment to the south and the Nassau Hotel (originally the Hotel Roland, F. W. Fisher, 1897) to the west. General Description: Located on a 100’ X 125’ lot on the southwest corner of Park Avenue and 59th Street, the silver aluminum and glass facade façade of The-Pepsi Cola building seems to be a symmetric rectangular-10 story office, building which is separated from its. neighbor"}, {"url": "https://en.wikipedia.org/wiki/PepsiCo", "passage_text": "PepsiCo Inc. is an American multinational food, snack and beverage corporation headquartered in Purchase, New York, United States, with interests in the manufacturing, marketing, and distribution of grain-based snack foods, beverages, and other products. PepsiCo Americas Foods consists of the company's food and snack operations in North and South America. This operating division is further segmented into Frito-Lay North America, Quaker Foods & Snacks, Sabritas, Gamesa, and Latin America Foods."}, {"url": "http://www.stadiumhotelnetwork.com/pepsi-center/", "passage_text": "Hotels Near Pepsi Center. Welcome to the Stadium Hotel Network! The Pepsi Center is located in Denver, CO and is home to the Denver Nuggets & Avalanche. 0.6 miles away from Pepsi Center. The Four Seasons Hotel Denver is a downtown landmark located only steps from the Denver Performing Arts complex and The Colorado centre."}, {"url": "https://en.wikipedia.org/wiki/PepsiCo", "passage_text": "The PepsiCo headquarters are located in the neighborhood of Purchase, New York, in the town of Harrison, New York. It was one of the last architectural works by Edward Durell Stone. It consists of seven three-story buildings. Each building is connected to its neighbor through a corner. PepsiCo Americas Foods consists of the company's food and snack operations in North and South America. This operating division is further segmented into Frito-Lay North America, Quaker Foods & Snacks, Sabritas, Gamesa, and Latin America Foods."}, {"url": "https://en.wikipedia.org/wiki/Pepsi_Center", "passage_text": "The Pepsi Center is an American multi-purpose arena located in Denver, Colorado. In 2004, Denver, Colorado was selected as one of five cities in the U.S. to host the Dew Action Sports Tour, a new extreme sports franchise that began in 2005. Titled the Right Guard Open, the inaugural event was held at Pepsi Center from July 6–10."}, {"url": "http://www.pepsistore.com/", "passage_text": "The Birthplace of Pepsi is owned and operated by the Minges Bottling Group located in Ayden, North Carolina, and first opened the doors to the Birthplace of Pepsi Store on the 100th Anniversary of Pepsi-Cola in 1998. "}, {"url": "http://www.pepsicenter.com/fan-guide/guest-info/contact-us/", "passage_text": "Denver, CO 80204. Main line: 303.405.1100. Pepsi Center is located in Denver's Central Platte Valley. There are two main entrances: 7th Street and Auraria Parkway, and Speer Boulevard and Chopper Circle. Directions: From I-25 North take the Speer Boulevard South exit, 212 A. At the second stop light, turn right onto Chopper Circle."}, {"url": "https://www.pepsibottlingventures.com/locations/", "passage_text": "Locations. Pepsi Bottling Ventures has 21 locations in North Carolina, South Carolina, Maryland, and Delaware. Each location is marked on the map. Click a marker to see the address and telephone number for a location."}, {"url": "http://www.stadiumhotelnetwork.com/pepsi-center/", "passage_text": "Springhill Suites By Marriott Denver Downtown. 0.2 miles away from Pepsi Center. The Aloft Denver is a boutique style hotel located in downtown Denver, just steps away from some of the city’s top restaurants, shopping, and sporting venues. 0.6 miles away from Pepsi Center. The Four Seasons Hotel Denver is a downtown landmark located only steps from the Denver Performing Arts complex and The Colorado centre."}]