[{"url": "http://europeanhistory.about.com/od/stonehenge/p/prstonehenge.htm", "passage_text": "Stonehenge is a prehistoric arrangement of massive standing stones on Salisbury Plain in Britain. There are two main types of stone, the Sarsen and Bluestones, which form an outer and inner ring; the latter have also been placed in a central horse-shoe arrangement."}, {"url": "http://www.knowth.com/stonehenge.htm", "passage_text": "Prehistoric Stonehenge on the Salisbury Plain in England is probably the best known and most studied megalithic structure anywhere in the world, yet its original purpose is still unclear."}, {"url": "http://www.wisegeek.com/what-is-a-post-and-lintel.htm", "passage_text": "Construction using posts and lintels is one of the oldest known techniques. Post and lintel construction is used extensively in contemporary buildings, from single family homes to high rise structures. This construction technique was used at Stonehenge, estimated to have been constructed in 2,800 BC."}, {"url": "https://quizlet.com/14813999/art-112-flash-cards/", "passage_text": "Corbel vault. an arched structure that spans an interior space. a stone ceiling built up in regular courses (layers) of dressed stone in overlapping and ever-decreasing rings carefully calculated to meet at the peak in a single capstone (topmost stone that joins the sides and completes a structure)."}, {"url": "http://www.crystalinks.com/stonehenge.html", "passage_text": "Stonehenge is a prehistoric monument located in the English county of Wiltshire, about 3.2 kilometres (2.0 mi) west of Amesbury and 13 kilometres (8.1 mi) north of Salisbury."}, {"url": "http://www.knowth.com/stonehenge.htm", "passage_text": "The timber posts may have supported timber lintels in a wooden henge structure. About 500 years later (2500 BC) two concentric stone circles were erected using about 60 blocks of bluestone, the stones weighing up to 4 ton were transported from Carn Menyn in the Prescelly Mountains over a 100 miles away."}, {"url": "http://www.ehow.com/about_5066026_advantages-post-lintel-construction.html", "passage_text": "Features. Post and lintel construction is recognized by its simple vertical and horizontal design, in which a pair of vertical supports are set in the ground or a foundation, and a horizontal structure is balanced on top of them."}, {"url": "http://encyclopedia2.thefreedictionary.com/Stonehenge", "passage_text": "The Heelstone is a great upright stone in the Avenue, northeast of the circle. A number of other ancient features are found in the surrounding landscape, including barrows and the Cursus, an long, elongated oval ditch that predates Stonehenge."}]