[{"url": "http://www.investorwords.com/4240/retirement.html", "passage_text": "Definitions (2). 1. The period of a person's life during which he/she is no longer working, or the commencement of that period. The standard age for retirement in the United States is considered 65, although many individuals choose to retire earlier or later due to personal or financial reasons."}, {"url": "http://www.investopedia.com/terms/r/retirement-planning.asp", "passage_text": "DEFINITION of 'Retirement Planning'. The process of determining retirement income goals and the actions and decisions necessary to achieve those goals. Retirement planning includes identifying sources of income, estimating expenses, implementing a savings program and managing assets. Future cash flows are estimated to determine if the retirement income goal will be achieved."}, {"url": "http://www.investorwords.com/6644/retirement_plan.html", "passage_text": "Definition. A savings and investment plan that provides income during retirement. It is often created by companies or the government for employees. A defined benefit plan and a defined contribution plan are both types of retirement plans. "}, {"url": "http://www.merriam-webster.com/dictionary/retirement", "passage_text": "Full Definition of RETIREMENT. 1. a: an act of retiring: the state of being retired b: withdrawal from one's position or occupation or from active working life. 2. : a place of seclusion or privacy. See retirement defined for English-language learners. See retirement defined for kids. ADVERTISEMENT. Examples of RETIREMENT. 1  She decided to take an early retirement. 2  Many fans were surprised by the champion's retirement. 3  The staff is smaller because of several retirements. 4  I'm looking forward to retirement. 5  He is ready for retirement."}, {"url": "http://www.yourdictionary.com/retirement", "passage_text": "Retirement is defined as seclusion or privacy, or withdrawal from work due to age. 1  An example of retirement is going into a back bedroom and taking a nap. 2  An example of retirement is a 65 year old person deciding to permanently leave his job. "}, {"url": "http://www.huffingtonpost.com/arianna-huffington/its-time-to-retire-our-definition-of-retirement_b_5774878.html", "passage_text": "The time has come to retire the old definition of retirement. A thriving retirement is, of course, greatly aided by financial security, but to truly thrive means much more than just having met your number on a 401(k) statement. It means realizing that retirement can be a time of expansion, engagement and adventure. On the upside, we're also living longer, with the remaining life expectancy of a 65-year-old American male having risen from 14.7 years in 1980 to 18.7 years in 2012. So it's no wonder that, on the downside, retirement is the top financial worry of most Americans, according to a recent Gallup poll."}, {"url": "http://www.definitions.net/definition/Retirement", "passage_text": "Wiktionary (0.00 / 0 votes) Rate this definition: retirement (Noun). An act of retiring, or the state of being retired; withdrawal; seclusion; as, the retirement of an officer; the portion of one's life after retiring from one's career. Princeton's WordNet (0.00 / 0 votes) Rate this definition: retirement (noun). the state of being retired from one's business or occupation. retirement (noun). withdrawal from your position or occupation. retirement, retreat (noun). withdrawal for prayer and study and meditation."}, {"url": "http://www.investopedia.com/terms/r/retirement.asp", "passage_text": "When a person chooses to leave the workforce. The concept of full retirement – being able to permanently leave the workforce in old age – is relatively new, and for the most part only culturally-widespread in first-world countries. "}]