[{"url": "http://www.rense.com/1.mpicons/acidalka.htm", "passage_text": "Generally, alkaline forming foods include: most fruits, green vegetables, peas, beans, lentils, spices, herbs and seasonings, and seeds and nuts. Generally, acid forming foods include: meat, fish, poultry, eggs, grains, and legumes. Shifting Your pH Toward Alkaline... This chart is for those trying to adjust their body pH. The pH scale is from 0 to 14, with numbers below 7 acidic (low on oxygen) and numbers above 7 alkaline. An acidic body is a sickness magnet"}, {"url": "http://www.livestrong.com/article/23346-high-acidic-foods-list/", "passage_text": "Corn, lentils, winter squash and olives are all vegetables that are high in acid. For example, corn has a pH of 5.2, while lentils and olives have pH levels of 6.3 and 6, respectively. They still have fiber and other nutrients, but they are not good choices if you are trying to lower the levels of acid in your body. Processed grains and baked goods that are made with them are high in acidity. Examples of these include white bread, white rice, pasta, biscuits, bagels, doughnuts, pastries and crackers. These are also low in fiber and nutrients. White bread has a pH of 5, while white rice has a pH of 6."}, {"url": "http://goaskalice.columbia.edu/answered-questions/which-foods-are-acidic", "passage_text": "The more acidic vegetables include: 1  escarole. 2  pimentos. 3  tomatoes. 4  any vegetables processed with vinegar, such as canned artichokes, canned beets, pickles, and sauerkraut. Alice! Dear Reader, Contrary to popular belief, eating acidic foods will not cause one's stomach, blood, or entire body to become more acidic. In fact, during the process of digestion, the stomach secretes hydrochloric acid (HCl), a super-duper acidic substance that causes its contents to become acidic."}, {"url": "http://www.livestrong.com/article/23346-high-acidic-foods-list/", "passage_text": "The acidity of foods, or other substances, are measured by their pH value -- their place on a 14-point pH scale. Acidic substances have a low pH -- the lower the pH, the more acidic -- while neutral and basic substances have higher pH levels of 7 or above. The body has a pH balance that determines the amount of acid and alkalinity present in your system. Processed grains and baked goods that are made with them are high in acidity. Examples of these include white bread, white rice, pasta, biscuits, bagels, doughnuts, pastries and crackers. These are also low in fiber and nutrients. White bread has a pH of 5, while white rice has a pH of 6."}, {"url": "http://www.healthline.com/health/acid-foods-to-avoid", "passage_text": "A diet that consists of too many acid-producing foods, such as protein, can cause acidity in your urine, which can cause a type of kidney stone called uric acid stones to form. It’s been speculated that overacidity can cause bone and muscle deterioration. Some foods and substances that you should try to limit, rather than completely avoid, include the following: 1  nuts (cashew, peanut, walnuts). 2  seeds (pumpkin, sunflower). 3  most legumes. 4  fruits (blueberry, cranberry, plum). 5  corn oil. 6  sweeteners (sugars, molasses, maple syrup, processed honey, aspartame). 7  salt"}, {"url": "http://greenopedia.com/alkaline-acid-food-chart/", "passage_text": "As a result, different charts can report slightly different pH levels of the same foods. Download this printable Alkaline-Acid Food Chart to post on your fridge. Jump To Featured Products. How the body reacts to certain foods is what determines what foods are alkaline-forming and what foods are acid-forming. For example lemons are acidic in nature, but have an alkalizing effect on the body once they are digested. Similarly, milk is alkaline outside the body, but acidic upon digestion. "}, {"url": "http://www.angelfire.com/az/sthurston/acid_alkaline_foods_list.html", "passage_text": "To restore health, the diet should consist of 80% alkaline forming foods and 20% acid forming foods. Generally, alkaline forming foods include: most fruits, green vegetables, peas, beans, lentils, spices, herbs and seasonings, and seeds and nuts. Generally, acid forming foods include: meat, fish, poultry, eggs, grains, and legumes. Foods are classified as acid-forming or alkalizing depending on the effect they have on the body. An acid-forming food contributes hydrogen ions to the body, making it more acidic. An alkalizing food removes hydrogen ions from the body, making it more alkaline."}, {"url": "http://www.acidalkalinediet.com/Alkaline-Foods-Chart.htm", "passage_text": "1 This chart is based on the resulting pH ash of foods after digestion. 2  This is the reading you should go by when alkalizing foods for your body. 3  You should aim for a 70/30 ratio between high alkaline vs acid foods. 4  There is no need to be extreme with your diet and remove all acid foods. 1 The color of the text under each food represents the pH rating. 2  This chart is based on the resulting pH ash of foods after digestion. 3  This is the reading you should go by when alkalizing foods for your body. 4"}, {"url": "http://www.rense.com/1.mpicons/acidalka.htm", "passage_text": "To maintain health, the diet should consist of 60% alkaline forming foods and 40% acid forming foods. To restore health, the diet should consist of 80% alkaline forming foods and 20% acid forming foods. Generally, acid forming foods include: meat, fish, poultry, eggs, grains, and legumes. Shifting Your pH Toward Alkaline... This chart is for those trying to adjust their body pH. The pH scale is from 0 to 14, with numbers below 7 acidic (low on oxygen) and numbers above 7 alkaline."}]