[{"url": "http://www.welchs.com/about-us/our-story/the-concord-grape", "passage_text": "Have you ever tried a Concord grape? Well, if you've ever had a glass of Welch's 100% Grape Juice, you have. These sweet, tangy, bold purple grapes need a special climate to grow – specifically, chilly areas near large bodies of water like the Great Lakes. Just like wine, Welch's 100% Grape Juice gets its taste from where the grapes are grown. It's because of the Concord grape that Welch's 100% Grape Juice is so delicious and unique. The Concord grape was first cultivated in 1849 by Ephraim Wales Bull in Concord, Massachusetts. "}, {"url": "http://www.welchs.com/products/100-juices", "passage_text": "100% Juices. Welch's is proud to bring you our 100% juices — 2 servings of fruit in every glass, no added sugar and a taste the whole family will love. 100% Grape Juice."}, {"url": "https://en.wikipedia.org/wiki/Concord_%28grape%29", "passage_text": "Concord grapes are often used to make grape jelly and are only occasionally available as table grapes, especially in New England. They are the usual grapes used in the jelly for the traditional peanut butter and jelly sandwich, and Concord grape jelly is a staple product in U.S. supermarkets. The Concord grape is particularly prone to the physiological disorder Black leaf. In the United States 417,800 tons were produced in 2011. The major growing areas are the Finger Lakes District of New York, Lake Erie, Lake Ontario, Southwestern Michigan, and the Yakima Valley in Washington."}, {"url": "http://www.fatsecret.com/calories-nutrition/food/grape-juice/sodium", "passage_text": "The favorite choice for the term Grape Juice is 1 cup of Grape Juice which has about 8 mg of sodium. The amount of salt (sodium) for a variety of types and serving sizes of Grape Juice is shown below. View other nutritional values (such as Calories, Carbs or Fats) using the filter below: Calories | Total Carbs | Total Fats | Protein | Sodium | Cholesterol | Vitamins. "}, {"url": "http://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/expert-answers/food-and-nutrition/faq-20058529", "passage_text": "Keep in mind that it's also beneficial to eat whole grapes — not just grape juice. Some research suggests that whole grapes deliver the same amount of antioxidants that are in grape juice and wine but have the added benefit of providing dietary fiber. With. Katherine Zeratsky, R.D., L.D. 1  Functional foods. 2  Healthy heart for life: Avoiding heart disease."}, {"url": "http://www.agmrc.org/media/cms/grapejuiceprocessing_130F2BC1BDC8B.pdf", "passage_text": "This contrasts with -0.4 percent for grape juice, -0.13 percent for apple juice, and -6.0 percent for pineapple. Citrus was by far the fruit juice of choice in the U.S., accounting for almost 70 percent of the total fruit juice consumed on a per capita basis in 2001/02. The remaining 9 percent is distributed among the rest of the fruit juices, with grapes and pineapple accounting for 3.9 percent and 3.7 percent respectively and cranberry accounting for 2 percent. The year-to-year change in per capita consumption of total fruit juice consumed has been most unstable for grape juice."}, {"url": "https://en.wikipedia.org/wiki/Concord_%28grape%29", "passage_text": "The skin of a Concord grape is typically dark blue or purple, and often is covered with a lighter-coloured bloom that can be rubbed off. It is a slip-skin variety, meaning that the skin is easily separated from the fruit. Concord grapes have large seeds and are highly aromatic. The Concord grape is particularly prone to the physiological disorder Black leaf. In the United States 417,800 tons were produced in 2011. The major growing areas are the Finger Lakes District of New York, Lake Erie, Lake Ontario, Southwestern Michigan, and the Yakima Valley in Washington."}, {"url": "https://en.wikipedia.org/wiki/Concord_%28grape%29", "passage_text": "Concord grapes. The Concord grape is a cultivar derived from the grape species Vitis labrusca (also called fox grape) that are used as table grapes, wine grapes and juice grapes. They are often used to make grape jelly, grape juice, grape pies, grape-flavored soft drinks, and candy. The Concord grape is particularly prone to the physiological disorder Black leaf. In the United States 417,800 tons were produced in 2011. The major growing areas are the Finger Lakes District of New York, Lake Erie, Lake Ontario, Southwestern Michigan, and the Yakima Valley in Washington."}, {"url": "https://en.wikipedia.org/wiki/Grape", "passage_text": "In North America, the most common grape juice is purple and made from Concord grapes, while white grape juice is commonly made from Niagara grapes, both of which are varieties of native American grapes, a different species from European wine grapes. A grape is a fruiting berry of the deciduous woody vines of the botanical genus Vitis. Grapes can be eaten raw or they can be used for making wine, jam, juice, jelly, grape seed extract, raisins, vinegar, and grape seed oil. Grapes are a non-climacteric type of fruit, generally occurring in clusters."}]