[{"url": "https://en.wikipedia.org/wiki/Petrarch%27s_and_Shakespeare%27s_Sonnets", "passage_text": "The Italian or Petrarchan sonnet consists of two parts; an octave and a sestet. The octave can be broken down into two quatrains; likewise, the sestet is made up of two tercets. The octave presents an idea to be contrasted by the ending sestet. The particular quatrains and tercets are divided by change in rhyme."}, {"url": "http://www.poetrymagnumopus.com/index.php?/topic/1047-petrarchan-or-italian-sonnet/", "passage_text": "The Sonnet / Italian Poetry. The Petrarchan Sonnet, also called the Italian Sonnet is one of the two dominant sonnet forms, the other being the English or Shakespearean sonnet. Both have weathered the corruption of time. The Petrarchan Sonnet came on the heels of the first sonnet form, the Sicilian Sonnet which is rarely seen in today's literature. 1 a single quatorzain made up of an octave followed by a sestet. 2  composed with the octave presenting an idea, problem or question, followed by a sestet finding the solution or resolution. 3  metered, iambic pentameter."}, {"url": "http://www.sonnets.org/basicforms.htm", "passage_text": "The Italian (or Petrarchan) Sonnet: The basic meter of all sonnets in English is iambic pentameter (basic information on iambic pentameter),although there have been a few tetrameter and even hexametersonnets, as well. The Italian sonnet is divided into two sections by two differentgroups of rhyming sounds."}, {"url": "https://en.wikipedia.org/wiki/Petrarchan_sonnet", "passage_text": "The Petrarchan sonnet was not developed by Petrarch himself, but rather by a string of Renaissance poets. Because of the structure of Italian, the rhyme scheme of the Petrarchan sonnet is more easily fulfilled in that language than in English. Form [edit]. The rhyme scheme for the octave is typically a b b a a b b a. The sestet is more flexible. Petrarch typically used c d e c d e or c d c d c d for the sestet."}, {"url": "http://users.scc.spokane.edu/JRoth/Courses/Literature%20131/poetry%20chest%20files/Sonnets%20Made%20Easy.htm", "passage_text": "Since there are two major types of sonnets the Petrarchan (or Italian) and Shakespearean (or English or Elizabethan) there are two major rhyme schemes. Though rhyme scheme variations exist (particularly in the last six lines (the sestet), the Petrarchan (or Italian) sonnet rhyme scheme usually is. A. B. Structure: In general, a sonnet is a fourteen-line poem where each line is written in a particular musical rhythm called iambic pentameter. In addition, these fourteen lines have to conform to a specific rhyme scheme."}, {"url": "https://en.wikipedia.org/wiki/Petrarchan_sonnet", "passage_text": "The sonnet is split in two groups: the octave (of 8 lines) and the sestet (of 6 lines), for a total of 14 lines. The octave (the first 8 lines) typically introduces the theme or problem using a rhyme scheme of abba abba. Form [edit]. The rhyme scheme for the octave is typically a b b a a b b a. The sestet is more flexible. Petrarch typically used c d e c d e or c d c d c d for the sestet."}, {"url": "http://www.nrcs.k12.oh.us/Downloads/Sonnet%20Notes.ppt", "passage_text": "Rhyme Scheme: The pattern of end rhyme in a poem; charter by assigning a letter to each line. Two Most Common Forms of a Sonnet Petrarchan (Italian) sonnet: 14 lines long, made up of two parts-n eight line section (octave) followed by a six-line section (sestet). The octave usually raises an issue, asks a question or poses a problem. The sestet “solves” it or responds to it. "}, {"url": "http://www.shakespeare-online.com/sonnets/sonnetstyle.html", "passage_text": "The couplet has the rhyme scheme gg. This sonnet structure is commonly called the English sonnet or the Shakespearean sonnet, to distinguish it from the Italian Petrarchan sonnet form which has two parts: a rhyming octave (abbaabba) and a rhyming sestet (cdcdcd). Only three of Shakespeare's 154 sonnets do not conform to this structure: Sonnet 99, which has 15 lines; Sonnet 126, which has 12 lines; and Sonnet 145, which is written in iambic tetrameter. _____. How to cite this article: Mabillard, Amanda. Shakespearean Sonnet Basics: Iambic Pentameter and the English Sonnet Style."}, {"url": "http://www.poetrymagnumopus.com/index.php?/topic/1047-petrarchan-or-italian-sonnet/", "passage_text": "1 A Crown of Sonnets is a series of 7 Petrarchan Sonnets linked by repetition of the last line of each sonnet as the first line of the next sonnet and the last line of the seventh and last sonnet is the first line of the first sonnet. 2  A Wreath of Sonnets, like the Crown of Sonnets, is a series of Petrarchan Sonnets. 1 a single quatorzain made up of an octave followed by a sestet. 2  composed with the octave presenting an idea, problem or question, followed by a sestet finding the solution or resolution. 3  metered, iambic pentameter."}]