[{"url": "http://www.webmd.com/cholesterol-management/features/9-surprising-foods-that-may-raise-your-cholesterol", "passage_text": "Your total cholesterol level is in the Desirable range, but your level of bad LDL cholesterol is High. This may mean that your level of high-density lipoprotein (HDL), or good cholesterol, is too low. It is best to have a high level of good HDL and a low level of bad LDL. Your total cholesterol level is High. Your level of bad LDL cholesterol is Borderline High. Working to bring down your total cholesterol decreases your LDL cholesterol level. You can do this by exercising more and eating less food with saturated fats."}, {"url": "http://www.webmd.com/cholesterol-management/features/9-surprising-foods-that-may-raise-your-cholesterol", "passage_text": "Your total cholesterol level is Borderline High. Your level of bad LDL cholesterol is Borderline High, too. Working to bring down your total cholesterol decreases your LDL cholesterol level. You can do this by exercising more and eating less food with saturated fats. Your total cholesterol level is High. Your level of bad LDL cholesterol is Borderline High"}, {"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-cholesterol/in-depth/cholesterol/ART-20045192?pg=2", "passage_text": "Trans fats raise LDL cholesterol, and lower high-density lipoprotein (HDL), the good cholesterol. Food labels report the content of trans fats, but, unfortunately, only in foods that contain at least one gram per serving. "}, {"url": "http://www.menshealth.com/health/best-and-worst-foods-your-cholesterol", "passage_text": "Certain foods have been shown to decrease heart disease risk by lowering LDL (bad) cholesterol levels and raising HDL (good) cholesterol. "}, {"url": "http://www.webmd.com/cholesterol-management/features/9-surprising-foods-that-may-raise-your-cholesterol", "passage_text": "Your total cholesterol level is Borderline High. But your level of bad LDL cholesterol is Very High. Working to bring down your total cholesterol decreases your LDL cholesterol level. You can do this by exercising more and eating less food with saturated fats. Your total cholesterol level is High. Your level of bad LDL cholesterol is Borderline"}, {"url": "http://www.wikihow.com/Raise-Good-Cholesterol-and-Lower-Bad-Cholesterol", "passage_text": "Eat certain foods to lower LDL. Consume oats, whole grains and high-fiber foods. Brazil nuts, almonds and walnuts may help lower LDL. Since many of these can be snacks, it is easy for you to supplement your diet with heart-happy foods. 1  Omega-3 fatty acids found in fatty fish, flax seed, flax seed oil and fish oil supplements can help lower LDL and raise HDL. 1 Avoid trans fats, which lower HDL and raise LDL. 2  Foods that may contain trans fats include shortening and some margarine, cake and biscuit mixes, ramen noodles, deep-fried fast food, frozen foods, doughnuts, baked goods, candy, crackers, chips, breakfast cereal, energy bars and dips, gravy mixes and toppings."}, {"url": "http://www.webmd.com/cholesterol-management/features/9-surprising-foods-that-may-raise-your-cholesterol", "passage_text": "Your total cholesterol level is Borderline High. Your level of bad LDL cholesterol is High. Working to bring down your total cholesterol decreases your LDL cholesterol level. You can do this by exercising more and eating less food with saturated fats. Your total cholesterol level is High. Your level of bad LDL cholesterol is Borderline"}, {"url": "http://www.msn.com/en-us/health/superfoods/10-foods-to-lower-bad-cholesterol/ss-BB4vrxx", "passage_text": "While weight loss, exercise, and diet can help raise HDL (“good”) cholesterol levels and lower LDL (“bad”) cholesterol, there are also specific compounds in foods that can work to protect your heart by promoting healthy cholesterol levels. "}, {"url": "http://www.homehealthtesting.com/blog/2010/04/10-of-the-worst-foods-for-your-cholesterol-levels/", "passage_text": "Rich in trans-fats, these increase LDL or bad cholesterol and reduce HDL or good cholesterol. 10. Eggs. Eggs are actually good for your health but not if you have high cholesterol. Avoid egg yolk and eat only the white of an egg if you have been diagnosed with high cholesterol levels. "}, {"url": "http://www.mayoclinic.org/diseases-conditions/high-blood-cholesterol/in-depth/cholesterol/ART-20045192", "passage_text": "Oatmeal, oat bran and high-fiber foods. Oatmeal contains soluble fiber, which reduces your low-density lipoprotein (LDL), the bad cholesterol. Soluble fiber is also found in such foods as kidney beans, apples, pears, barley and prunes. Soluble fiber can reduce the absorption of cholesterol into your bloodstream. Five to 10 grams or more of soluble fiber a day decreases your total and LDL cholesterol."}]