[{"url": "http://www.ascopost.com/issues/august-15,-2014/selected-patients-with-lung-cancer-and-poor-performance-status-may-benefit-from-standard-therapy.aspx", "passage_text": "Among patients with small cell lung cancer (SCLC), those with poor performance status “seem to have a worse response to chemotherapy,” the authors noted, and the role of concurrent chemoradiation is unclear. Available evidence shows, however, that some patients benefit from standard therapy. “When comorbidities or poor [performance status] exclude surgical interventions for early-stage lung cancer, radiation therapy is the standard alternative” for the management of patients with non–small cell lung cancer (NSCLC)."}, {"url": "https://en.wikipedia.org/wiki/Performance_status", "passage_text": "Scoring systems [edit]. There are various scoring systems. The most generally used are the Karnofsky score and the Zubrod score, the latter being used in publications by the WHO. For children, the Lansky score is used. "}, {"url": "http://hemonc.org/Performance_status", "passage_text": "1 Buccheri G, Ferrigno D, Tamburini M. Karnofsky and ECOG performance status scoring in lung cancer: a prospective, longitudinal study of 536 patients from a single institution. 2  Eur J Cancer. 1 ECOG Performance Status (contains ECOG performance scale) Eastern Cooperative Oncology Group, Robert Comis M.D., Group Chair. 2  Schag CC, Heinrich RL, Ganz PA. 3  Karnofsky performance status revisited: reliability, validity, and guidelines. 4  J Clin Oncol."}, {"url": "http://ecog-acrin.org/resources/ecog-performance-status", "passage_text": "It describes a patient’s level of functioning in terms of their ability to care for themself, daily activity, and physical ability (walking, working, etc.). Researchers worldwide take the ECOG Performance Status into consideration when planning trials to study a new treatment method. This numbering scale is one way to define the population of patients to be studied in the trial, so that it can be uniformly reproduced among physicians who enroll patients. It is also a way for physicians to track changes in a patient’s level of functioning as a result of treatment during the trial. The scale was developed by the Eastern Cooperative Oncology Group (ECOG), now part of the ECOG-ACRIN Cancer Research Group, and published in 1982."}, {"url": "http://cancergrace.org/cancer-101/2015/07/29/faq-perfstatus/", "passage_text": "Along with a patient’s age, sex, and past and current medical issues, performance status (PS) is one of the most important factors that is categorized for patients. The reason. is so important is that it is predictive of how a patient will do with and without treatment for cancer. In fact, it is more predictive of prognosis and ability to tolerate the rigors of potentially challenging anti-cancer therapy than other intuitively relevant factors like a patient’s chronologic age."}, {"url": "http://ecog-acrin.org/resources/ecog-performance-status", "passage_text": "Comparing the ECOG Performance Status to the Karnofsky Performance Status. The ECOG Performance Status and the Karnofsky Performance Status are two widely used methods to assess the functional status of a patient. It is also a way for physicians to track changes in a patient’s level of functioning as a result of treatment during the trial. The scale was developed by the Eastern Cooperative Oncology Group (ECOG), now part of the ECOG-ACRIN Cancer Research Group, and published in 1982."}, {"url": "http://meteor.aihw.gov.au/content/index.phtml/itemId/412327", "passage_text": "Performance status at diagnosis is an important prognostic indicator and is used to determine appropriate treatment, assess how the disease is progressing, and for the statistical analyses of outcome adjusted by performance status. The Eastern Cooperative Oncology Group (ECOG) performance score was developed to consistently assess the impact of a person's disease on their daily living abilities. Record the ECOG performance status score recorded at diagnosis and before the implementation of treatment."}, {"url": "http://www.ncbi.nlm.nih.gov/pubmed/8471434/", "passage_text": "The ECOG Scale of Performance Status (PS) is widely used to quantify the functional status of cancer patients, and is an important factor determining prognosis in a number of malignant conditions. The PS describes the status of symptoms and functions with respect to ambulatory status and need for care. PS 0 means normal activity, PS 1 means some symptoms, but still near fully ambulatory, PS 2 means less than 50%, and PS 3 means more than 50% of daytime in bed, while PS 4 means completely bedridden."}, {"url": "http://training.seer.cancer.gov/followup/procedures/dataset/ecog.html", "passage_text": "ECOG Performance Status. These scales and criteria are used by doctors and researchers to assess how a patient's disease is progressing, assess how the disease affects the daily living abilities of the patient, and determine appropriate treatment and prognosis. "}, {"url": "http://www.ackc.org/kidney-cancer-information/ecog-status/", "passage_text": "ECOG Status. These scales and criteria are used by doctors and researchers to assess how a patient’s disease is progressing, assess how the disease affects the daily living abilities of the patient, and determine appropriate treatment and prognosis. "}]