[{"url": "http://blog.captaincookcruisesfiji.com/languages-speak-fiji/", "passage_text": "The official languages. Fiji’s 1997 Constitution established Fijian as one of the official languages of the country. Fijian is an Austronesian language, a grouping that includes thousands of other languages spanning the globe. The language is of the Malayo-Polynesian family, not too different from Hawaiian and Maori."}, {"url": "http://www.answers.com/Q/What_language_do_they_speak_in_fiji", "passage_text": "The Republic of the Fiji Islands citizens speak British English. Fijian and Fiji-Hindi is the second language. Other major language that is taught in elementary/primary schools and high schools are Urdu and French. Urdu and French is never considered to be a benefit to the people of Fiji."}, {"url": "https://en.wikipedia.org/wiki/Languages_of_Fiji", "passage_text": "Fiji has three official languages under the 1997 constitution (and not revoked by the 2013 Constitution): English, Fijian and Hindi. Fijian is spoken either as a first or second language by indigenous Fijians who make up around 54% of the population."}, {"url": "http://www.answers.com/Q/What_language_does_Fiji_speak_in", "passage_text": "The Republic of the Fiji Islands citizens speak British English. Fijian and Fiji-Hindi is the second language. Other major language that is taught in elementary/primary school … s and high schools are Urdu and French. Urdu and French is never considered to be a benefit to the people of Fiji."}, {"url": "http://www.answers.com/Q/What_language_does_Fiji_speak_in", "passage_text": "The official languages in Fiji are Fijian and English. A dialect of Hindustani is also widely spoken among Indo-Fijians.  _________________________________________   T … he official and everyday language of Fiji is English. Fijian and Fiji-Hindi are second languages in the island nation."}, {"url": "http://www.go-fiji.com/language.html", "passage_text": "Fiji Language. The Fijian language spoken in Fiji is a type of Austronesian langauge and is part of the Malayo-Polynesian family. The Austronesian languages are normally found among islands in continental and Southeast Asia along with islands in the Pacific."}, {"url": "http://www.answers.com/Q/What_language_do_they_speak_in_fiji", "passage_text": "The official languages in Fiji are Fijian and English. A dialect of Hindustani is also widely spoken among Indo-Fijians.  _________________________________________   T … he official and everyday language of Fiji is English. Fijian and Fiji-Hindi are second languages in the island nation."}]