[{"url": "http://www.ppdictionary.com/viruses/hpv.htm", "passage_text": "Most infections are harmless, but about 30 types may lead to cancer. Genital HPV is the most common sexually transmitted infection, with more than 40 known types that can infect both males and females in their genital areas, anus, mouth and throat, by causing genital warts or cancers. "}, {"url": "http://www.webmd.com/sexual-conditions/hpv-genital-warts/hpv-virus-information-about-human-papillomavirus", "passage_text": "High-risk HPV strains include HPV 16 and 18, which cause about 70% of cervical cancers. Other high-risk HPV viruses include 31, 35, 39, 45, 51, 52, 58, and a few others. Low-risk HPV strains, such as HPV 6 and 11, cause about 90% of genital warts, which rarely develop into cancer. Genital warts can look like bumps or growths. Sometimes they are shaped like cauliflower. The warts can show up weeks or months after exposure to an infected sexual partner"}, {"url": "http://www.answers.com/mobile/Q/What_type_of_pathogen_causes_hpv", "passage_text": "Genital warts result from some lower risk types of HPV, but other high-risk HPV types cause cancer. High-risk HPVs cause nearly all cervical cancers and most types of anal cancer. HPVs have lower attribution rates to vaginal, vulvar, penile and oropharyngeal cancers. "}, {"url": "http://www.austincc.edu/microbio/2704w/hpv1.htm", "passage_text": "HPV is a virus that very commonly causes genital warts (low-risk HPV). HPV is the leading risk factor associated with cancer of the uterus and cervix (high-risk HPV), although most people with genital warts caused by HPV never develop cancer of the uterus or cervix (5). "}, {"url": "https://en.wikipedia.org/wiki/Human_papillomavirus", "passage_text": "HPV types that tend to cause genital warts are not those that cause cervical cancer. Since an individual can be infected with multiple types of HPV, the presence of warts does not rule out the possibility of high-risk types of the virus also being present. High-risk HPV types 16 and 18 are together responsible for over 65% of cervical cancer cases. Type 16 causes 41 to 54% of cervical cancers, and accounts for an even greater majority of HPV-induced vaginal/vulvar cancers, penile cancers, anal cancers and head and neck cancers."}, {"url": "https://answers.yahoo.com/question/index?qid=20100221112359AARa16I", "passage_text": "A pathogen is any agent (bacteria, virus, etc.) that causes disease. HPV (Human Papillomavirus) is a pathogen which is broken into nearly two hundred varieties. So, HPV is the pathogen that causes genital warts, but more specifically, most genital-anal warts are caused by HPV types six and eleven. Wikipedia has a good article on this subject. http://en.wikipedia.org/wiki/Hpv#Genital... Bryan · 6 years ago."}, {"url": "https://en.wikipedia.org/wiki/Human_papillomavirus", "passage_text": "Gardasil also protects against HPV types 6 and 11, which cause 90% of genital warts. Gardasil is a recombinant quadrivalent vaccine, whereas Cervarix is bivalent, and is prepared from virus-like particles (VLP) of the L1 capsid protein. High-risk HPV types 16 and 18 are together responsible for over 65% of cervical cancer cases. Type 16 causes 41 to 54% of cervical cancers, and accounts for an even greater majority of HPV-induced vaginal/vulvar cancers, penile cancers, anal cancers and head and neck cancers."}, {"url": "http://www.cdc.gov/vaccines/pubs/pinkbook/hpv.html", "passage_text": "Infection with low-risk, or nononcogenic types, such as types 6 and 11, can cause benign or low-grade cervical cell abnormalities, genital warts and laryngeal papillomas. High-risk, or oncogenic, HPV types act as carcinogens in the development of cervical cancer and other anogenital cancers. "}, {"url": "http://www.cancer.gov/about-cancer/causes-prevention/risk/infectious-agents/hpv-vaccine-fact-sheet", "passage_text": "1 For example, HPV types 6 and 11 cause 90 percent of all genital warts. 2  HPV types 6 and 11 also cause recurrent respiratory papillomatosis, a disease in which benign tumors grow in the air passages leading from the nose and mouth into the lungs. 3  High-risk HPVs, which can cause cancer. "}, {"url": "http://www.medicalnewstoday.com/articles/155236.php", "passage_text": "Photo credit: Wikimedia Commons. Genital warts, like other non-STD warts, are caused by various types of the human papilloma virus (HPV) that infect the top layers of the skin. There are over 100 different types of HPV that may cause warts, but only a small number of strains can cause genital warts. Those that do cause genital warts, unlike other wart-causing HPVs, are highly contagious and are passed on through sexual contact with a person who is infected. "}]