[{"url": "https://ca.answers.yahoo.com/question/index?qid=20140401183937AAF12h3", "passage_text": "Mix lemon with water and use it as a spider repellent spray. You can also use lemon-flavored hand wash, liquid soap, floor cleaner, etc., to avoid the entry of spider in home. Dry the lemon peels in sun, and grind them to make a powder. Now spray this powder at the required areas to make your home spider-free."}, {"url": "http://homeguides.sfgate.com/kind-bugs-lavender-essential-oil-repel-83930.html", "passage_text": "Lavender (Lavandula angustifolia) is a handy plant to have around both for you and your garden. Its essential oil can be used to repel many problem insects -- such as mosquitoes, fleas and moths -- from humans, animals and even other plants. Lavender can act as a protector for other plants that lack natural abilities to ward off unwanted insects."}, {"url": "http://www.ehow.com/how_6172839_use-lavendar-natural-spider-repellent.html", "passage_text": "Save. Lavender is a natural spider repellent that is nontoxic to humans and plants. You can use it on yourself and your pets to prevent spider and tick bites, as well as around the house and in your garden to repel spiders."}, {"url": "http://www.ehow.co.uk/info_8377359_lavender-dust-mites.html", "passage_text": "Obtained by steam distillation of the lavender flowers, lavender essential oil is effective in repelling dust mites, fleas, mosquitoes, ticks, bedbugs and spiders. Lavender does not kill insects. The aromatic scent of lavender is offensive, causing insects to flee the area."}, {"url": "http://herbalhealthcare-daw.blogspot.com/2013/04/fleas-ticks-and-mites-repellants.html", "passage_text": "Oil of rosemary does not just repel ticks; it also deters flies, aphids and mites. While oil of rosemary is a tick repellent, it is not the most effective one available. Rose geranium and palmarosa essential oils repel ticks better."}, {"url": "http://www.ehow.com/how_6172839_use-lavendar-natural-spider-repellent.html", "passage_text": "Instructions. Make a personal spider repellent to repel spiders and ticks. To make the personal repellent, mix 1 tsp. of essential lavender oil with 8 oz. of your favorite sunscreen, face lotion, body lotion or aloe vera gel. Shake the mixture well to combine the ingredients. Slather it on your skin as often as desired."}]