[{"url": "http://www.answers.com/Q/What_was_whale_vomit_used_for", "passage_text": "Whale vomit (technically called Ambergris) was once used as an ingredient in perfumes because of the earthy fragrance it aquires with age. It is rarely used in modern day perf … umes and has been replaced by synthetic ingredients that produce the same scent."}, {"url": "http://www.whalefacts.org/whale-vomit-ambergris/", "passage_text": "Whale Vomit (Ambergris). Whale vomit also known as Ambergris is a dead gray, solid, wax like material that is created in the intestines and digestive system of sperm whales."}, {"url": "https://en.wikipedia.org/wiki/Ambergris", "passage_text": "Ambergris occurs as a bile duct secretion of the intestines of the sperm whale and can be found floating upon the sea, or lying on the coast. It is also sometimes found in the abdomens of whales."}, {"url": "http://www.mirror.co.uk/news/uk-news/whale-vomit-10-things-you-1566526", "passage_text": "1. Ambergris is a solid, waxy, flammable substance of a dull grey or blackish colour produced in the intestines of sperm whales. 2. It's produced by the whale to protect its gut from the very sharp beaks of squid that it feeds on deep down in the ocean. 3."}, {"url": "http://www.answers.com/Q/What_was_whale_vomit_used_for", "passage_text": "Making the world better, one answer at a time. Whale vomit is called Ambergris, and it is/was used in the perfume industry. It is highly valuable if it has been floating around for a few years, getting washed and polished by the sea and baked by the sun, losing its pungent smell and developing a sweet aroma."}, {"url": "http://www.mirror.co.uk/news/uk-news/whale-vomit-10-things-you-1566526", "passage_text": "Manchester Evening News. Lucky: Ken and boxer dog Madge. A dog walker is in the money after spotting a smelly yellow rock on a beach and discovering it was whale vomit worth up to £100,000. Ken Wilman said his boxer dog Madge found the 6lb lump in Morecambe, Lancashire."}, {"url": "http://news.sky.com/story/1045585/whale-vomit-worth-100000-found-on-dog-walk", "passage_text": "Whale vomit is also known as ambergris and is used to make perfume. It is formed in the digestive system of sperm whales and has a very strong and unpleasant aroma. The find could leave Ken more than £100,000 better off."}, {"url": "http://animals.howstuffworks.com/mammals/ambergris.htm", "passage_text": "No one knew what it was, and whale vomit -- or what some say is really more like a whale gallstone -- was suggested as a possibility. But identifying it as whale vomit, or ambergris, is a daunting task. If it does turn out to be ambergris, the gift could be worth up to $20,000."}]