[{"url": "http://www.food.com/recipe/boneless-leg-of-lamb-22650", "passage_text": "1 Place leg of lamb on a rack in a roasting pan. 2  Preheat oven to 325 degrees and bake leg of lamb uncovered for 30 minutes per pound or until internal temperature reaches 120 to 130 degrees at the thickest point."}, {"url": "http://www.foodnetwork.com/recipes/alton-brown/crown-roast-of-lamb-recipe.html", "passage_text": "Place on the middle rack of the oven and cook for 30 to 35 minutes, until the meat reaches an internal temperature of 130 degrees F. This is approximately 8 to 12 minutes per pound. Remove from the oven, transfer the roast to a rack, cover with aluminum foil and let the meat rest for 20 minutes."}, {"url": "http://www.simplyrecipes.com/recipes/roast_leg_of_lamb/", "passage_text": "4 Roast at 425°F for 20 minutes. Then reduce the heat to 300°F and roast an additional 40 minutes (for a 6 pound boneless roast) to an hour (for a 6 pound bone-in roast). If you are cooking a roast bone-in, the bone will act as an insulator and will require a longer cooking time than a boneless roast."}, {"url": "http://recipes.howstuffworks.com/tools-and-techniques/how-to-roast-meat2.htm", "passage_text": "The following tips for roasting leg of lamb are based on a 4-pound leg of lamb, well-trimmed, boned, rolled, and tied. For a bone-in leg of lamb, add 5 minutes per pound to roasting time. 1  Preheat oven to 400 ° F. Combine ingredients for seasoning rub, as desired. 2  Rub mixture over surface of lamb. 3  At this point lamb may be covered and refrigerated up to 24 hours before roasting."}, {"url": "http://www.marthastewart.com/316446/roast-leg-of-lamb-with-garlic-and-herbs", "passage_text": "Season meat with salt and pepper. Roast lamb, basting every 20 to 30 minutes, first with the reserved marinade, and then with juices that accumulate in the pan. The lamb will need to cook for about 20 minutes per pound (2 hours for a 6-pound leg of lamb; 2 hours and 40 minutes for 8 pounds)."}, {"url": "http://www.answers.com/Q/How_long_do_you_roast_a_lamb", "passage_text": "Put an onion or two in the pan and 2 sprigs of fresh rosemary. Place the roasting pan in the oven set at 350F(190C) for 15-20 minutes per pound (you don't want to cook lamb well done, but more medium to medium rare) a 6 pound leg should take about 1 1/2 to 2 hours. Remove the cover(or foil) for the last 15 minutes of roasting time."}]