[{"url": "http://www.helpforibs.com/books/1stibs/prescriptions1.asp", "passage_text": "Narcotic Analgesics for IBS are opioid drugs and can be highly effective painkillers. One of their chief side effects, constipation, is actually of benefit to some Irritable Bowel Syndrome sufferers. Typically, most patients are initially prescribed an anti-spasmodic drug upon diagnosis, though you may have received a low-dose antidepressant or anti-diarrheal instead, or even one of the newest (and thus potentially riskiest) Irritable Bowel Syndrome drugs, Zelnorm or Lotronex."}, {"url": "https://www.linzess.com/", "passage_text": "LINZESS ® (linaclotide) is a prescription medication used in adults to treat irritable bowel syndrome with constipation (IBS‑C) and chronic idiopathic constipation (CIC). Idiopathic means the cause of the constipation is unknown. It is not known if LINZESS is safe and effective in children. "}, {"url": "http://www.mayoclinic.org/medical-professionals/clinical-updates/digestive-diseases/better-agents-needed-irritable-bowel-syndrome-diarrhea", "passage_text": "Current and future treatments for IBS-D. Irritable bowel syndrome (IBS) is a multifactorial disorder marked by recurrent abdominal pain or discomfort and altered bowel function. It affects between 10 and 20 percent of people in the developed world, about one-third of whom have IBS associated with diarrhea (IBS-D). "}, {"url": "http://www.webmd.com/ibs/guide/irritable-bowel-syndrome-ibs-medications", "passage_text": "Medicine may be used along with lifestyle changes to manage symptoms of irritable bowel syndrome (IBS). It may be prescribed to treat moderate to severe pain, diarrhea, or constipation that does not respond to home treatment. Medicine can help relieve your symptoms enough to prevent them from interfering with your daily activities. Check with your doctor before you use any of these medicines every day for constipation. Medicines for constipation include: 1  Osmotic laxatives (such as Milk of Magnesia and nonabsorbable sugars such as lactulose). 2  Polyethylene glycol (such as MiraLax)."}, {"url": "http://www.everydayhealth.com/ibs/ibs-prescription-medications.aspx", "passage_text": "The Effects of Other Conditions on IBS. Irritable bowel syndrome (IBS) is not something that goes away with treatment. But this does not mean that those with IBS are destined to suffer unaided. As one option, a variety of prescribed medications can lessen the miseries of IBS symptoms. That said, it’s important to keep in mind that not every remedy for IBS symptoms is right for every IBS patient. IBS is a complex disorder that produces different symptoms from person to person."}, {"url": "http://www.helpforibs.com/footer/medications.asp", "passage_text": "Amitiza is a prescription medication for the treatment of Irritable Bowel Syndrome constipation in women 18 years of age and older. Amitiza was approved by the FDA for IBS constipation in 2008. Medications for IBS are simply meant to relieve your Irritable Bowel Syndrome symptoms. If the first IBS medication you try doesn't help much (or at all), don't be discouraged &#150 there are other options available."}, {"url": "http://www.goodrx.com/irritable-bowel-syndrome/drugs", "passage_text": "ALOSETRON is used to treat irritable bowel syndrome (IBS) in women. It is reserved for those women who have severe diarrhea as the main symptom and who have not had success with other treatments. This medicine has not been shown to work in men with IBS. LUBIPROSTONE is a laxative. It is used to treat chronic constipation and constipation caused by opioids (certain prescription pain medicines). It is also used to treat adult women with irritable bowel syndrome who have constipation."}, {"url": "http://www.helpforibs.com/footer/medications.asp", "passage_text": "IBS Medications. Most IBS patients are initially prescribed an anti-spasmodic drug upon diagnosis, though you may have received a low-dose antidepressant, anti-diarrheal, laxative, or even one of the newest (and thus potentially riskiest) Irritable Bowel Syndrome drugs, Zelnorm, Lotronex, Amitiza, or Linzess. Medications for IBS are simply meant to relieve your Irritable Bowel Syndrome symptoms. If the first IBS medication you try doesn't help much (or at all), don't be discouraged &#150 there are other options available."}, {"url": "http://www.goodrx.com/irritable-bowel-syndrome/drugs", "passage_text": "See Prices. Symax SL (hyoscyamine) is an anticholinergic used to treat irritable bowel syndrome (IBS) and peptic ulcers. It controls muscle spasms, which can ease symptoms of IBS and allow for faster healing of ulcers. Symax SL is a sublingual tablet, also available as Hyomax SL and generic hyoscyamine. LUBIPROSTONE is a laxative. It is used to treat chronic constipation and constipation caused by opioids (certain prescription pain medicines). It is also used to treat adult women with irritable bowel syndrome who have constipation."}]