[{"url": "http://www.houzz.com/ideabooks/222609/list/11-Area-Rug-Rules-and-How-to-Break-Them/", "passage_text": "Rule 5: 18 inches of bare floor around the rug. The next rule has been a standard for ages, and this approach states that there should be approximately 18 inches of bare floor between the rug edge and the perimeter walls of the room, bringing in traditional proportion. For an area rug to look balanced under a bed, it should be large enough to extend beyond the sides of the bed at least 18 inches for a king or queen bed and at least 12 inches for a full or twin bed."}, {"url": "http://www.houzz.com/ideabooks/534512/list/How-to-Choose-a-Rug-for-Your-Dining-Room/", "passage_text": "Design, Ltd. Leave breathing room between rug and wall. A large rug should leave at least 8 inches between it and the wall. A good rule of thumb in a dining room is to keep 18 inches of flooring uncovered around the perimeter of the room to showcase your rug and make your room feel larger. It should be long and wide enough on all sides to allow for chairs to slide in and out, and you have to watch out for other pieces of furniture you place in the room. For a standard dining table (42 x 64) that seats 4-6, a rug that measures 8' x 10' is usually a good place to begin."}, {"url": "http://www.houzz.com/ideabooks/222609/list/11-Area-Rug-Rules-and-How-to-Break-Them/", "passage_text": "Rule 8: Extend the rug 24 inches around a table. It is much easier to maneuver dining chairs if there is at least 24 inches of rug extending from the edge of the table on all sides. This rule allows the back legs of the chairs to be on the rug, even when being used. For an area rug to look balanced under a bed, it should be large enough to extend beyond the sides of the bed at least 18 inches for a king or queen bed and at least 12 inches for a full or twin bed."}, {"url": "http://rugsandcarpets.about.com/od/Area-Rugs/a/How-To-Select-A-Rug-Size.htm", "passage_text": "Bedroom. For areas of the home that have no furniture, such as hallways and foyers, rug size can be determined based on how much floor to leave exposed around the edges of the room. For large areas, a bit more of the floor can show; usually anywhere from twelve inches up to twenty-four inches. A rug that is too small for the space can cause the room to feel uninviting. A rug that is too large for the room can, paradoxically, make the room feel smaller. The right-sized area rug will bring warmth and balance to the room, creating the perfect finishing touch."}, {"url": "http://rugsandcarpets.about.com/od/Area-Rugs/a/How-To-Select-A-Rug-Size.htm", "passage_text": "The size of an area rug can dramatically alter the room's overall effect. A rug that is too small for the space can cause the room to feel uninviting. A rug that is too large for the room can, paradoxically, make the room feel smaller. The right-sized area rug will bring warmth and balance to the room, creating the perfect finishing touch."}, {"url": "http://homeguides.sfgate.com/much-room-allow-around-dining-room-table-84680.html", "passage_text": "For a seating area around a dining table to feel comfortable and not cramped, 36 inches between the table edge and walls or obstructions is necessary to provide room for guests to enter and exit their chairs. In a cramped setting or fixed-seat environment such as a booth-style seat, 24 inches is sufficient. "}, {"url": "http://www.houzz.com/ideabooks/534512/list/How-to-Choose-a-Rug-for-Your-Dining-Room/", "passage_text": "Choose a rug shape that accentuates the shape of the table. If you have a round table, a round rug will look great. Remember to add 24-30 inches all around to your table's diameter so the chairs have room to slide in and out. It should be long and wide enough on all sides to allow for chairs to slide in and out, and you have to watch out for other pieces of furniture you place in the room. For a standard dining table (42 x 64) that seats 4-6, a rug that measures 8' x 10' is usually a good place to begin."}, {"url": "http://rugsandcarpets.about.com/od/Area-Rugs/a/How-To-Select-A-Rug-Size.htm", "passage_text": "Dining Room. For areas of the home that have no furniture, such as hallways and foyers, rug size can be determined based on how much floor to leave exposed around the edges of the room. For large areas, a bit more of the floor can show; usually anywhere from twelve inches up to twenty-four inches. A rug that is too small for the space can cause the room to feel uninviting. A rug that is too large for the room can, paradoxically, make the room feel smaller. The right-sized area rug will bring warmth and balance to the room, creating the perfect finishing touch."}, {"url": "http://www.houzz.com/ideabooks/534512/list/How-to-Choose-a-Rug-for-Your-Dining-Room/", "passage_text": "Make sure your rug size includes some chair room. Measure the top of the table and add 24-30 inches to each side so you have room to easily pull out and push in a chair while sitting in it. It should be long and wide enough on all sides to allow for chairs to slide in and out, and you have to watch out for other pieces of furniture you place in the room. For a standard dining table (42 x 64) that seats 4-6, a rug that measures 8' x 10' is usually a good place to begin."}, {"url": "http://homeguides.sfgate.com/type-rug-good-under-dining-table-95103.html", "passage_text": "Framing Your Table. Think of a dining room rug as a frame that prevents the table and chairs from looking like more than just a collection of legs. A wide area of rug -- at least 24 inches -- should extend all the way around the dining table when all your guests are seated with the chairs tucked in. As perhaps the largest accessory or accent in the space -- and one that must endure heavy activity -- the rug under the dining table is almost as much a focus for diners as the table and chairs. Consider every aspect of the rug you choose so you can create the dining room you desire."}]