[{"url": "http://carneades.pomona.edu/2010-PoP/0929-nts.shtml", "passage_text": "Moral subjectivism has the following disadvantages. First, if it’s true, then ethical beliefs are not what it seems to be. They seem to reflect objective reality just as much as any other beliefs do. But if moral subjectivism is correct, this is just an illusion."}, {"url": "http://www.iep.utm.edu/moral-re/", "passage_text": "Normative relativism is the view that it is wrong to judge or interfere with the moral beliefs and practices of cultures that operate with a different moral framework to one’s own, that what goes on in a society should only be judged by the norms of that society."}, {"url": "http://www.webpages.uidaho.edu/ngier/103/eoes.html", "passage_text": "Note: Despite the argument above many Hindus, Buddhists, and Christians still believe in ethical objectivism or ethical absolutism. They believe that God has created eternal, unchanging laws and not even God can change, since, as some theologians claim, those laws are part of God's nature."}, {"url": "http://carneades.pomona.edu/2010-PoP/0929-nts.shtml", "passage_text": "But if moral subjectivism is true, that’s the wrong standard for being justified in holding an ethical belief. If you think it just has to be the right standard, then you don’t believe that moral subjectivism is true. Maybe you’re right. But in insisting on the point, you aren’t playing along with the exercise of asking whether the truth of moral subjectivism would lead to indifference."}, {"url": "http://www.ucs.mun.ca/~alatus/phil1200/RelativismObjectivism.html", "passage_text": "1. Moral Relativism: The view that what is morally right or wrong depends on what someone thinks. (To which the claim that opinions vary substantially about right and wrong is usually added.) We can think of this position as coming in two flavours:"}, {"url": "http://www83.homepage.villanova.edu/richard.jacobs/MPA%208300/theories/subjectivism.html", "passage_text": "While this may be what people actually do, as Rachels notes, the logic underlying this interpretation is flawed. For example, it certainly is in one s self-interest to brush one s teeth daily; but, it is not a selfish act to brush one s teeth daily."}, {"url": "http://carneades.pomona.edu/2010-PoP/0929-nts.shtml", "passage_text": "Science enjoys the prestige that it does because what it counts as knowledge has to pass very difficult tests. Most importantly, it has to be possible for anyone else to run the same experiments and get the same results. If moral subjectivism were true, the justification of ethical beliefs would be much less demanding."}, {"url": "http://www83.homepage.villanova.edu/richard.jacobs/MPA%208300/theories/subjectivism.html", "passage_text": "That is to say, the ethical statements humans assert are arbitrary because they do not express immutable truths grasped by the refined power of the intellect. Instead, ethical statements express the feelings, beliefs, preferences, and attitudes of the person(s) or group(s) making those statements."}]