[{"url": "http://www.ourbabynamer.com/meaning-of-Joelle.html", "passage_text": "It ranked 4936 in popular baby names for boys with 19 occurrences. View the Joelle Name Popularity Page to see how the popularity trend for Joelle has changed since 1880, or to compare the popularity of Joelle to other names."}, {"url": "http://www.ourbabynamer.com/meaning-of-Joelle.html", "passage_text": "Joelle is a Spanish form of the name Joel. The name Joel is an Anglicized form of the Hebrew name Yoel (יוֹאֵל). It is derived from the Hebrew elements yo an abbreviated form for the Name of the Lord and el an abbreviated form of elohim meaning G-d. View the Joelle Name Popularity Page to see how the popularity trend for Joelle has changed since 1880, or to compare the popularity of Joelle to other names."}, {"url": "http://www.babycenter.com/baby-names-joelle-2325.htm", "passage_text": "Hi my name is Joelle, I was named after my neighbor. She is from France. So the name Joelle is actually a french name, an sorry ladies it has no real meaning. She told me female name is spelled joelle, and the male name is spelled joell. Not too many people actually know this. I'm 41 and I'm glad to have a unique name lol. I hope this helps"}, {"url": "http://www.sheknows.com/baby-names/name/joelle", "passage_text": "Hebrew Meaning: The name Joelle is a Hebrew baby name. In Hebrew the meaning of the name Joelle is: Jehovah is God. American Meaning: The name Joelle is an American baby name. In American the meaning of the name Joelle is: Jehovah is God. French Meaning: The name Joelle is a French baby name. In French the meaning of the name Joelle is: Jehovah is God. Feminine of Joel."}, {"url": "http://www.thinkbabynames.com/meaning/0/Joelle", "passage_text": "Joelle is a very prominent first name for women (#1326 out of 4276, Top 31%) but an unusual last name for both adults and children. (2000 U.S. Census). Charted below is the birth name popularity of Joelle for girls. Joelle ▼ is alike in pronunciation to Jaelle, Jewelle and Joyelle. Other suggested similar baby names are Jocelle, Jolee, Jolie ▼ , Joolie, Joselle, Jozelle, Noelle ▲ and Zoelle. These names tend to be less commonly used than Joelle."}, {"url": "http://www.thinkbabynames.com/meaning/0/Joelle", "passage_text": "Joelle /joel-le/ [1 syll.] as a girls' name is pronounced joh-EL. It is of French origin, and the meaning of Joelle is Jehovah is God . Feminine of Joel. It can also be taken as a combination of Jo and the feminine suffix-elle. Actresses Joely Fisher, Joely Richardson. Joelle ▼ is alike in pronunciation to Jaelle, Jewelle and Joyelle. Other suggested similar baby names are Jocelle, Jolee, Jolie ▼ , Joolie, Joselle, Jozelle, Noelle ▲ and Zoelle. These names tend to be less commonly used than Joelle."}, {"url": "http://www.meaning-of-names.com/hebrew-names/joelle.asp", "passage_text": "Meaning of Joelle. Hebrew name. In Hebrew, the name Joelle means-Jehovah is God.. Other origins for the name Joelle include-Hebrew, French, French.The name Joelle is most often used as a girl name or female name. Hebrew Name Meaning-Jehovah is God. "}, {"url": "http://www.babynamespedia.com/meaning/Joelle/f", "passage_text": "[ syll. joe -(l) le, jo-e- lle ] The baby girl name Joelle is also used as a boy name, though it is far more popular for girls. Joelle is of Hebrew origin. It is used mainly in English, French, and German. The meaning of Joelle is 'Yahweh is God'. It is a biblical name derived from yahweh 'name of God ' ; el which means 'God, powerful '. The generic name has been used in the Old Testament of the Bible. See also the related form, the name Marie Joelle. Joelle is unusual as a baby girl name. Its usage peaked modestly in 1966 with 0.023% of baby girls being named Joelle. It was #468 in rank then. The baby name has markedly dropped in popularity since then, and is used only on an infrequent scale now"}]