[{"url": "http://www.jewishvirtuallibrary.org/jsource/vjw/canada.html", "passage_text": "By 1901, Jewish communities had sprung up all over Canada. Montreal still maintained the largest number of Jews, with 6,975, followed by Toronto with 3,103. Winnipeg had 1,164 Jews, Vancouver had 224, and Nova Scotia, 152. From 1901 to 1911, 52,484 Jewish immigrants came to Canada, settling from coast to coast."}, {"url": "http://www.whitepinepictures.com/seeds/i/1/history2.html", "passage_text": "From 1850 to 1900 Jewish immigrants came mostly from Europe(8). During this period approximately 15,000 Jewish immigrants arrived in Canada. The Shumiatcher family, when they came to Canada in 1909, were part of a wave of 120,000 Jews that came from Eastern Europe between 1900 and 1920. Those who came between 1920 and 1940 numbered 60,000 and from WWII to the 1980's, 135,000."}, {"url": "http://www.loc.gov/exhibits/haventohome/haven-century.html", "passage_text": "It is the first of three editions of this tiny prayer book published between 1840 and 1860--a period when Jews from German lands immigrated to this country in the tens-of-thousands. Between 1840 and 1860 the Jewish population of this country ballooned from 15,000 to 150,000."}, {"url": "http://thecanadianencyclopedia.ca/en/article/jewish-canadians/", "passage_text": "Jewish Canadians. Unlike most immigrants to Canada, Jews did not come from a place where they were the majority cultural group. Jews were internationally dispersed at the time of the ancient Roman Empire and after unsuccessful revolts against it lost their sovereignty in their ancient homeland."}, {"url": "http://www.israel-flowers-center.com/articles/JewsAmerica.asp", "passage_text": "Main Jewish immigration history America north-east. The Jewish immigration history America started in 1860. In this year 200,000 German Jews immigrated to USA. From 1882 to 1914, 2 million Jews immigrated from eastern Europe to USA. The Jewish immigration in the years 1882-1914 changed the Jews history."}]