[{"url": "http://www.wisegeek.com/what-is-kugelhopf.htm", "passage_text": "Traditional kugelhopf is made in a round pan with a hole in the center, most often what we’d term a bundt pan, though there are heavy pans specifically made for kugelhopf. Unlike the average bundt cake, which is often a variation of a pound cake recipe, this dessert needs time to rise due to its yeast. You won't believe these 10 facts about people. Kugelhopf, which may also be spelled Kugelhupf, gugelhupf or kugelhoph, is a classic cake said to have originated in Austria or in the Alsace region of France. Legend has it that Marie Antoinette, who was born in Vienna, Austria, brought the cake recipe to France upon her marriage to Louis XVI"}, {"url": "https://en.wikipedia.org/wiki/Gugelhupf", "passage_text": "A Gugelhupf, Guglhupf or Gugelhopf is a southern German, Austrian, Swiss and Alsatian term for a marble cake or Bundt cake. Gugel- is supposedly a variation of the Middle High German word gugel (hood), while -hupf is a variation of Hefe (yeast). Gugelhupf is a big cake and has a distinctive ring shape or the shape of a torus. It is usually eaten with coffee, at coffee breaks. Gugelhupf consists of a soft yeast dough which contains raisins, almonds and Kirschwasser cherry brandy. Some also contain candied fruits and nuts."}, {"url": "http://leitesculinaria.com/2997/recipes-kugelhopf.html", "passage_text": "Directions. 1  Make the cake. 2  1. Bring a little water to a boil in a small saucepan and toss in the raisins. 3  Turn off the heat and let steep for 2 minutes, then drain the raisins and pat them dry. 4  2. 5  Put the yeast and milk in the bowl of a stand mixer and, using a wooden spoon, stir until the yeast is dissolved. 1. Bring a little water to a boil in a small saucepan and toss in the raisins. 2  Turn off the heat and let steep for 2 minutes, then drain the raisins and pat them dry. 3  2. 4"}, {"url": "http://leitesculinaria.com/2997/recipes-kugelhopf.html", "passage_text": "1 Make the cake. 2  1. Bring a little water to a boil in a small saucepan and toss in the raisins. 3  Turn off the heat and let steep for 2 minutes, then drain the raisins and pat them dry. 4  2. 5  Put the yeast and milk in the bowl of a stand mixer and, using a wooden spoon, stir until the yeast is dissolved. 1. Bring a little water to a boil in a small saucepan and toss in the raisins. 2  Turn off the heat and let steep for 2 minutes, then drain the raisins and pat them dry. 3  2. 4"}, {"url": "http://www.epicurious.com/recipes/food/views/kugelhopf-106380", "passage_text": "1 Bake kugelhopf in middle of oven 15 minutes, then loosely cover mold with foil and continue to bake until golden and a tester inserted in center comes out clean, 20 to 25 minutes more. 2  Cool in pan 2 minutes, then invert cake onto a rack to cool completely, about 1 hour. 3  Dust with confectioners sugar. 1 Preheat oven to 400°F. 2  Remove towel from kugelhopf and gently peel off plastic wrap. 3 "}, {"url": "http://www.abreadaday.com/kugelhopf/", "passage_text": "Though I’ve always seen it called “kugelhopf”, this Germanic bread is also known as “gugelhopf”, “kougelhupf”, “guglhupf”, or any combination of the aforementioned prefixes or suffixes. To-may-to, to-mah-to, it’s all the same bread no matter the label. Well, almost. "}, {"url": "http://newyork.seriouseats.com/2013/09/sugar-rush-breads-bakery-kugelhopf.html", "passage_text": "It turns out to have an interesting and controversial history. Though small, Breads Bakery's Kugelhopf ($3.50) is a dense affair and packs a lot of cake into a single pastry. True to tradition, raisins and sugar are used sparingly. A small amount of orange and lemon zest add some additional flavor complexity. "}, {"url": "http://leitesculinaria.com/2997/recipes-kugelhopf.html", "passage_text": "1 8. 2  Remove the paper and bake the kugelhopf for 10 minutes. 3  Cover the pan loosely with a foil tent and bake for another 15 to 20 minutes, or until the kugelhopf is golden brown and has risen to the top — or, more likely, over the top — of the pan. 4  Meanwhile, line a baking sheet with foil and place a rack over it. 1. Bring a little water to a boil in a small saucepan and toss in the raisins. 2  Turn off the heat and let steep for 2 minutes, then drain the raisins and pat them dry. 3  2. 4  Put the yeast and milk in the bowl of a stand mixer and, using a wooden spoon, stir until the yeast is dissolved."}]