[{"url": "http://www.kevinmd.com/blog/2010/12/cost-keeping-terminally-ill-alive.html", "passage_text": "And it has been estimated that 20 to 30 percent of these medical expenses may have had no meaningful impact. Most of the bills are paid for by the federal government with few or no questions asked. This statistic is from a 60 Minutes story on “ The Cost of Dying ” and is one reason our healthcare system is in trouble."}, {"url": "http://prijom.com/posts/how-much-does-it-cost-to-keep-someone-on-life-support.php", "passage_text": "Steve Kroft it costs up to $10,000 a day to maintain someone in the intensive care unit. How do so many people end up in the hospital? How Much does Life Support Cost: It can cost anywhere from $24000 to $110000 per year and more to keep someone on like support. This does not include any other complications that may arise. The price of life: Nearly every patient in the MICU depends on at least one machine to keep him or her alive. As one might expect, a failed organ system requiring life support The average cost per patient was more than $300,000 for the year of car."}, {"url": "http://prijom.com/posts/how-much-does-it-cost-to-keep-someone-on-life-support.php", "passage_text": "Here is an essay I wrote on life support can someone: Keeping a dying person on life support does not prove to be an ethical move. the costs are carefully observed, it can be as much as $100,000 per day to keep."}, {"url": "http://www.kaycircle.com/What-Is-The-Average-Cost-Of-Life-Support-Per-Day-Year-Average-Life-Support-Price", "passage_text": "The term life support refers to various equipment and medications that are used to keep a patient alive during a critical health condition. In many cases, life support is required when the cardiovascular system, gastrointestinal system, respiratory system or renal system of a patient fails to function. The cost of life support varies based on the machines and other accessories that are being used for the service. On an average, keeping a patient on life support can cost $2000 to $3000 per day."}, {"url": "http://www.justanswer.com/health/01y5j-costs-keeping-someone-life-support.html", "passage_text": "If the person is in ICU and on a ventilator the cost can be over $10,000 per day. Less if ventilated elsewhere but still costly. Up to. http://www.ccmjournal.com/pt/re/ccm/abstract.00003246-200506000-."}]