[{"url": "http://www.bluntishambaptist.org/General/church-leaders-and-responsibilities", "passage_text": "Baptists believe that, under God, the government of the local church is best done by church members meeting together in a spirit of prayer and friendship to discuss and agree on what God wants them to do. In a Baptist Church every member is encouraged to be involved and use their gifts. Michelle has recently been appointed as the new Church Administrator. Her main duties are to provide administrative support to the Leadership Team. She is also responsible for agendas and minutes of church meetings, communication among church groups, chapelyard administration and the hire of the church premises."}, {"url": "http://www.huffingtonpost.com/pastor-gilford-t-monrose/role-of-the-church_b_1896969.html", "passage_text": "Regardless of this double standard, the church keeps people grounded, flushing out the burden of life by providing a bedrock of faith and answers to humanity's deepest needs. The role of the modern church in the life of the 21st-century believer is critical because it fills a void only the church can. If a car needs fixing, it is brought to the mechanic shop. If someone is sick, the health center or hospital is the best place to seek medical attention. In return, the challenge to prepare a Christian for leadership will take proper training and a willingness to accept a role in church in order to face the many challenges ahead in the community. We must start to look deep within ourselves and arise to serve the needs of all people in the name of Christ."}, {"url": "http://work.chron.com/duties-responsibilities-pastors-12586.html", "passage_text": "Pastors and ministers have an almost limitless number of duties in their roles as leaders of church congregations. Specific duties vary by denomination and church, but several biblically-mandated responsibilities are common across most Christian churches and impact the level of a pastor's success. Being knowledgeable of the Bible and in prayerful communication with God are both duties and responsibilities for pastors. Daily Bible study and strong theological understanding are vital to the ability of a pastor to lead and teach."}, {"url": "http://www.desiringgod.org/articles/what-is-the-role-of-an-elder", "passage_text": "The New Testament only refers to the office of pastor one time (Ephesians 4:11). It is a functional description of the role of elder stressing the care and feeding of the church as God’s flock, just as “bishop/overseer” is a functional description of the role of elder stressing the governing or oversight of the church."}, {"url": "http://blogs.christianpost.com/better-than-i-deserve/what-is-the-role-of-the-church-22913/", "passage_text": "Strictly speaking, the church is the Body of Christ, doing the work that the Head of the Church, Jesus, directs her to do for the purpose of glorifying God and part of that purpose is seeking those who are lost. By being called the Body of Christ, the church is to be the hands, mouth, and feet of Christ on earth. The Church is…. The word church is from the Greek word “ekklesia” which means “an assembly” or literally the “called-out ones” so the church are those believers who God called and saved through repentance and faith in Christ."}, {"url": "http://www.huffingtonpost.com/pastor-gilford-t-monrose/role-of-the-church_b_1896969.html", "passage_text": "Making a difference in people's everyday lives will benefit the believer as well as the community. When the church is rooted deeply in its community, and its membership is operating as public servants, the church will impact the lives of the people and the believers will fulfill the Messiah's mission on earth. In return, the challenge to prepare a Christian for leadership will take proper training and a willingness to accept a role in church in order to face the many challenges ahead in the community. We must start to look deep within ourselves and arise to serve the needs of all people in the name of Christ."}, {"url": "http://www.gotquestions.org/duties-elder-church.html", "passage_text": "What are the responsibilities of deacons in the church? What does the Bible say about the form of church government (polity)? Return to: Questions about the Church Return to: GotQuestions.org Home What are the duties of an elder in the church? From this verse you can also see the difference between the duties of elder and deacon. Simply put, the elders should be peacemakers, prayer warriors, teachers, leaders by example, and decision makers. They are the preaching and teaching leaders of the church."}, {"url": "http://www.gty.org/resources/distinctives/dd08/the-role-of-women", "passage_text": "A GRACE COMMUNITY CHURCH DISTINCTIVE Although womenhave traditionally fulfilled supportive roles in serving the church and gained their greatest joy and sense of accomplishment from being wives and mothers, the feminist movement has successfully influenced many women to abandon these divinely ordained roles. Their home and their children are to be their priority, in contrast to the world’s emphasis today on careers and fulltime jobs for women outside the home. The Church From the very beginning, women fulfilled a vital role in the Christian church (Acts 1:12–14; 9:36–42; 16:13–15; 17:1–4, 10–12; 18:1–2, 18, 24–28; Rom."}, {"url": "http://www.covenantbpci.com/2010/12/the-role-of-men-in-the-church/", "passage_text": "The Role of Men in the Church. By Pastor (Dr) Jack Sin | Published: December 17, 2010. Throughout biblical times and the history of the church, men have been used by God to play an important part in God’s sovereign eternal plan for His people. Many times throughout the history of His people, God has been pictured as seeking men to fulfil the roles He has designed for them: "}]