[{"url": "http://www.rightdiagnosis.com/g/gastroparesis/intro.htm", "passage_text": "Gastroparesis is a disorder in which the stomach takes too long to empty its contents. Gastroparesis is most often a complication of type 1 diabetes. At least 20 percent of people with type 1 diabetes develop gastroparesis. It also occurs in people with type 2 diabetes, although less often. Gastroparesis: Gastroparesis is a disorder in which the stomach takes too long to empty its contents. Gastroparesis is most often a complication of type 1 diabetes. ... more about Gastroparesis. Gastroparesis: Slow stomach emptying from stomach nerve damage."}, {"url": "https://www.sharecare.com/health/digestive-diseases/what-is-gastroparesis", "passage_text": "Gastroparesis is a stomach disorder in which the stomach doesn't empty properly, even when there is no blockage to the exit of the stomach. Gastroparesis is a complication of diabetes. It happens when the nerves that regulate how the gut moves food forward in the digestive process are damaged from being exposed to high blood sugar for many years. Consequently, the stomach does not empty out the way it normally would."}, {"url": "http://www.medicinenet.com/gastroparesis/article.htm", "passage_text": "1 Gastroparesis is a disease of the muscles of the stomach or the nerves controlling the muscles that causes the muscles to stop working. 2  Gastroparesis results in inadequate grinding of food by the stomach, and poor emptying of food from the stomach into the intestine. Gastroparesis results in poor grinding of food in the stomach into small particles and slow emptying of food from the stomach into the small"}, {"url": "http://www.webmd.com/digestive-disorders/digestive-disorders-gastroparesis", "passage_text": "Often, the cause of gastroparesis is unknown. However, the causes of gastroparesis can include: 1  Uncontrolled diabetes. 2  Gastric surgery with injury to the vagus nerve. 3  Medications such as narcotics and some antidepressants. 4  Parkinson's disease. 5  Multiple sclerosis. There are many symptoms of gastroparesis, including: 1  Heartburn or GERD. 2  Nausea. 3  Vomiting undigested food. 4  Feeling full quickly when eating. 5  Abdominal bloating. 6  Poor appetite and weight loss. 7  Poor blood sugar control."}, {"url": "http://www.webmd.boots.com/digestive-disorders/gastroparesis", "passage_text": "Gastroparesis is a long-term condition in which the stomach cannot empty itself of food normally. Gastroparesis is caused by damage to the vagus nerve, which regulates the digestive system. "}, {"url": "http://www.medicinenet.com/gastroparesis/page2.htm", "passage_text": "Gastroparesis also can result from damage to the vagus nerve, the nerve that controls the stomach's muscles, that occurs during surgery on the esophagus and stomach. Scleroderma is an example of a disease in which gastroparesis is due to damage to the stomach's muscles. Other symptoms of gastroparesis include bloating with or without abdominal distension, early satiety (feeling full quickly when eating), and in severe cases, weight loss due to a reduced intake of food because of the symptoms. Abdominal pain also is present frequently though the cause of the pain is unclear."}, {"url": "http://www.mayoclinic.org/diseases-conditions/gastroparesis/basics/definition/CON-20023971", "passage_text": "Gastroparesis is a condition in which the spontaneous movement of the muscles (motility) in your stomach does not function normally. "}, {"url": "http://www.medicinenet.com/gastroparesis/article.htm", "passage_text": "Gastroparesis means weakness of the muscles of the stomach. Gastroparesis results in poor grinding of food in the stomach into small particles and slow emptying of food from the stomach into the small intestine."}, {"url": "https://www.sharecare.com/health/digestive-diseases/what-is-gastroparesis", "passage_text": "Gastroparesis is a disorder in which the stomach cannot contract and empty its contents into the intestines in the absence of any intestinal blockage. Gastroparesis is a complication of diabetes. It happens when the nerves that regulate how the gut moves food forward in the digestive process are damaged from being exposed to high blood sugar for many years. Consequently, the stomach does not empty out the way it normally would."}, {"url": "http://www.healthline.com/health/gastroparesis", "passage_text": "Gastroparesis is a disorder that occurs when the stomach takes too long to empty the food inside. This disorder, also known as delayed gastric emptying, is a result of weak or abnormal muscles in the stomach. Right now there’s no cure for gastroparesis, but treatment can help you manage your symptoms. If your gastroparesis is caused by a condition like diabetes, the first step is to improve control of that underlying condition. After that, your doctor may recommend medication, diet changes, and even surgery in some cases."}]