[{"url": "http://www.insuranceforums.info/how-much-customs-officers-make-t33413.html", "passage_text": "This is an easy 10 points! CBSA = Canada Border Services Agency. The salary range for a CBSA officer trainee (FB-02) is currently between $55,133 and $61,570. The salary range for a CBSA officer (FB-03) is currently between $59,518 and $66,564. As an employee of the public service, CBSA officers can take part in the following plans: "}, {"url": "http://www.answers.com/Q/How_much_money_does_a_customs_officer_earn", "passage_text": "Answer   Depends on the size of the Department.   Some officers that work for Boise PD earn close to 100,000 per year with their overtime. I think their base pay … is 60 to 70k per year.   Idaho state police, a seasoned officer makes 50 per year.   Some of the smaller agencies only make around 30 per year.   If you are hired with an agency in a town of at least 30,000 people you can probably count on 40 to 50 thousand a year after you have been working for a couple years."}, {"url": "http://www.answers.com/Q/How_much_money_does_a_customs_officer_earn", "passage_text": "Officers begin anywhere from 30,000 to 45,000 a year upon hire date. After 3 years on the job, officers can make a minimum of $70,000 a year. If you add night diff, midnight diff, Sunday pay, holiday pay, and overtime which under COPRA (Customs Officer Pay Reform Act) is double time. Officers can expect to make anywhere from $95,000 to $105,000 a year. Idaho state police, a seasoned officer makes 50 per year.   Some of the smaller agencies only make around 30 per year.   If you are hired with an agency in a town of at least 30,000 people you can probably count on 40 to 50 thousand a year after you have been working for a couple years."}, {"url": "http://www.ehow.com/info_8649121_much-do-customs-officers-make.html", "passage_text": "Base salary for a GS-5 officer starts at $31,315 annually, while the base salary for someone hired at GS-7 is $38,790, according to a fact sheet, GS-1895-5/7 Customs and Border Protection Officer, published by the Customs and Border Protection office of Homeland Security. Moving Up the Salary Ladder. Once a customs officer is on the job, he is eligible to move up in steps to a higher salary as well as to a higher grade after successfully completing one year of satisfactory work at a level. The base salary for a GS-9 officer starts at $47,448 and $57,408 for GS-11, the fact sheet says. The highest level a customs officer can go is GS-12, which carries a starting salary of $68,809. The agency says employees do not need to re-apply as customs officers to move to the next higher grade"}, {"url": "http://www1.salary.com/CA/Ontario/Customs-Officer-salary.html", "passage_text": "For example the median expected annual pay for a typical Customs Officer in the United States is $38,256 so 50% of the people who perform the job of Customs Officer in the United States are expected to make less than $38,256. Source: HR Reported data as of October 2015. 1  Salary. "}, {"url": "http://www.answers.com/Q/How_much_do_canada_customs_officers_make", "passage_text": "Generally Officers begin anywhere from 30,000 to 45,000 a year upon hire date. After 3 years on the job, officers can make a minimum of $70,000 a year. If you add night diff … , midnight diff, Sunday pay, holiday pay, and overtime which under COPRA (Customs Officer Pay Reform Act) is double time. Officers can expect to make anywhere from $95,000 to $105,000 a year. 29 people found this useful. "}, {"url": "http://cbsa-asfc.gc.ca/job-emploi/bso-asf/hiring-embauche-eng.html", "passage_text": "Upon successful completion of the developmental program, officer trainees will be appointed to a BSO position (FB-03). The salary range for a CBSA officer trainee (FB-02) is currently between $58,078 and $64,859 (under review). The salary range for a BSO (FB-03) is currently between $62,697 and $70,120 (under review). As an employee of the public service, BSOs can take part in the following plans: 1  Public Service Health Care Plan. When you apply to the CBSA officer trainee (developmental) selection process, you need to be aware that you are volunteering for, and committing to, service anywhere in Canada that the CBSA needs you, including rural and remote areas."}, {"url": "https://answers.yahoo.com/question/index?qid=20070908115936AAfVLWn", "passage_text": "Well, the $35,000 per year is a bit off. It is close to what a probationary, rookie agent with no prior law enforcement experience will earn. As a journeyman agent a BPA can earn between $65 - 80,000 per year. There are numerous factor to consider when determining what a border patrol agent will earn. "}]