[{"url": "http://www.visionaware.org/section.aspx?FolderID=6&SectionID=116&DocumentID=5981", "passage_text": "1 Ophthalmologists are trained to provide the full spectrum of eye care, from prescribing glasses and contact lenses to complex and delicate eye surgery. 2  Ophthalmologists treat eye diseases, prescribe medications, and perform all types of surgery to improve, or prevent the worsening of, eye and vision-related conditions. 1 Many ophthalmologists are also involved in scientific research into the causes of, and cures for, eye diseases and vision problems. 2  In addition to four years of medical school and one year of internship, all ophthalmologists spend a minimum of three years of residency (hospital-based training) in ophthalmology."}, {"url": "http://www.ehow.com/about_5367917_ophthalmologist-do.html", "passage_text": "Found This Helpful. An ophthalmologist is a doctor who is specially trained in the medical and surgical health care of eyes. She focuses on the overall heath of the visual system, as well as preventive care of the eyes. "}, {"url": "https://en.wikipedia.org/wiki/Ophthalmology", "passage_text": "Ophthalmology (/ˌɒfθɑːlˈmɑːlədʒi/ or /ˌɒpθɑːlˈmɒlədʒi/) is the branch of medicine that deals with the anatomy, physiology and diseases of the eye. An ophthalmologist is a specialist in medical and surgical eye problems. Since ophthalmologists perform operations on eyes, they are both surgical and medical specialists. "}, {"url": "http://www.visionaware.org/section.aspx?FolderID=6&SectionID=116&DocumentID=5981", "passage_text": "1 Ophthalmologists treat eye diseases, prescribe medications, and perform all types of surgery to improve, or prevent the worsening of, eye and vision-related conditions. 2  Many ophthalmologists are also involved in scientific research into the causes of, and cures for, eye diseases and vision problems. 1 Many ophthalmologists are also involved in scientific research into the causes of, and cures for, eye diseases and vision problems. 2  In addition to four years of medical school and one year of internship, all ophthalmologists spend a minimum of three years of residency (hospital-based training) in ophthalmology."}, {"url": "http://www.allaboutvision.com/eye-doctor/choose.htm", "passage_text": "An ophthalmologist is a medical doctor (MD) or an osteopathic doctor (DO) who specializes in eye and vision care. Ophthalmologists are trained to perform eye exams, diagnose and treat disease, prescribe medications and perform eye surgery. They also write prescriptions for eyeglasses and contact lenses. An optician is not an eye doctor, but opticians are an important part of your eye care team. Opticians use prescriptions written by an optometrist or an ophthalmologist to fit and sell eyeglasses, contact lenses and other eyewear."}, {"url": "http://www.djo.harvard.edu/site.php?url=/patients/pi/439", "passage_text": "It is important to understand what each of the three Os is qualified to do. Ophthalmologists. An ophthalmologist is a physician (doctor of medicine, MD, or doctor of osteopathy, DO) who specializes in the medical and surgical care of the eyes and visual system and in the prevention of eye disease and injury. An ophthalmologist is a medically trained specialist who can deliver total eye care: primary, secondary and tertiary (i.e., vision services, contact lenses, eye examinations, medical eye care and surgical eye care), diagnose general diseases of the body and treat ocular manifestations of systemic diseases."}, {"url": "http://www.visionaware.org/section.aspx?FolderID=6&SectionID=116&DocumentID=5981", "passage_text": "1 An ophthalmologist is a medical or osteopathic physician who specializes in the medical and surgical care of the eyes and the prevention of eye disease. 2  An ophthalmologist diagnoses and treats refractive, medical, and surgical problems related to eye diseases and disorders. 1 Many ophthalmologists are also involved in scientific research into the causes of, and cures for, eye diseases and vision problems. 2  In addition to four years of medical school and one year of internship, all ophthalmologists spend a minimum of three years of residency (hospital-based training) in ophthalmology."}, {"url": "http://www.wisegeek.org/what-is-an-ophthalmologist.htm", "passage_text": "Optometrists deal with prescribing glasses or contact lenses for vision problems, but cannot perform surgery. Sometimes, an ophthalmologist may have a particular specialty, such as diseases of the cornea, retina, and vitreous diseases; glaucoma; eye problems in children; or plastic surgery. An ophthalmologist, also known as an eye doctor, is a medical professional who deals exclusively with parts of the body related to the visual passageways — the eyes, parts of the brain, and the areas around the eye, such as the eyelids. This doctor will inspect the eye for disease, and may perform surgery in some cases."}, {"url": "http://www.aao.org/about/what-is-ophthalmology", "passage_text": "An Eye M.D. is an ophthalmologist, a medical or osteopathic doctor who specializes in eye and vision care. Eye M.D.s are specially trained to provide the full spectrum of eye care, from prescribing glasses and contact lenses to complex and delicate eye surgery. "}]