[{"url": "http://www.mapsofworld.com/world-ocean-map.htm", "passage_text": "The five major oceans on Earth are the Pacific Ocean, the Atlantic Ocean, the Indian Ocean, the Arctic Ocean, and the Southern Ocean. The Pacific Ocean, the Earth's largest ocean, flows to the west of the Americas and along the eastern edge of Asia."}, {"url": "http://www.answers.com/Q/What_three_oceans_are_around_Canada", "passage_text": "Confidence votes 122. The Pacific Ocean is on the west coast of Canada, the Arctic Ocean is at the top of the country and the Atlantic Ocean is on the east coast of Canada. Maine, New Hampshire and New York all have Atlantic shoreline and share a border with Canada. But only New York (Long Island) borders the Atlantic proper, because Maine and … New Hampshire border the Gulf of Maine, an arm of the ocean south of New Brunswick and Nova Scotia. + 8 others found this useful. Ezekiel Kyoore."}, {"url": "http://www.answers.com/Q/Which_ocean_is_closest_to_canada", "passage_text": "Canada is bordered by three oceans: the pacific, the atlantic, and the Arctic. 1 The majority of the planet is covered in the waters that make up the ocean. 2  Countless creatures swim through the depths of these wa…. 3  Discover More Information About Mailing to Canada Sending letters and parcels from the United States to Canada is not difficult."}, {"url": "http://www.api-ipy.gc.ca/_docs/ctho_e.pdf", "passage_text": "Canada’s Three Oceans The three oceans that surround Canada are interconnected by the flow of water masses. This ocean ‘continuum’ offers an opportunity to understand the impact of climate change on Arctic ice cover, ocean properties and marine life in an integrated way.anada’s Three Oceans, led by Fisheries and Oceans Canada researchers, will take a snapshot of ocean conditions in 2007 and 2008. This snapshot will allow observers to gauge the consequences of global climate change, and to provide essential information to policy-makers and the Canadian Public."}, {"url": "http://www.worldatlas.com/webimage/countrys/polar/arctic.htm", "passage_text": "Arctic Map. The Arctic is a region of the planet, north of the Arctic Circle, and includes the Arctic Ocean, Greenland, Baffin Island, other smaller northern islands, and the far northern parts of Europe, Russia (Siberia), Alaska and Canada. "}, {"url": "http://www.answers.com/Q/Which_ocean_is_closest_to_canada", "passage_text": "The closest ocean to Indiana is the Atlantic Ocean. As the crow  flies, it is 483 miles from Indianapolis, Indianapolis to the  Atlantic Ocean. 1 The majority of the planet is covered in the waters that make up the ocean. 2  Countless creatures swim through the depths of these wa…. 3  Discover More Information About Mailing to Canada Sending letters and parcels from the United States to Canada is not difficult."}, {"url": "https://answers.yahoo.com/question/index?qid=20120416211115AAi9s5M", "passage_text": "Ottawa is in central Canada in Ontario. A long way from any ocean. You can get the feeling of an ocean minus the salt by going to one of the great lakes. Otherwise you have a long way to go to find an ocean and Canada's oceans are too cold for lounging on the beach.here is a tide at Quebec, but, it is small. Still, you definitely don't have an ocean feel there. The closest open ocean would be near Portland, Maine. I have no idea what the beaches are like there, but, I can tall you, beaches in that area of the USA are VERY expensive to be near."}, {"url": "https://answers.yahoo.com/question/index?qid=20120416211115AAi9s5M", "passage_text": "The closest salt water would be about where Quebec City is. It is a mix of salt and fresh, and depends somewhat on the tide. There is a tide at Quebec, but, it is small. Still, you definitely don't have an ocean feel there. The closest open ocean would be near Portland, Maine.I have no idea what the beaches are like there, but, I can tall you, beaches in that area of the USA are VERY expensive to be near."}, {"url": "https://en.wikipedia.org/wiki/List_of_islands_in_the_Atlantic_Ocean", "passage_text": "(May 2010). This is a list of islands in the Atlantic Ocean. Note that the IHO definition of the ocean excludes the seas, gulfs, bays, etc., bordering the ocean itself. Thus, for instance, not all of the islands of the United Kingdom are actually in or bordering on the Atlantic."}, {"url": "http://www.answers.com/Q/Which_ocean_is_closest_to_canada", "passage_text": "Asia is the closest country to the pacific ocean that I know of. 3 people found this useful. Edit. Share to: 1  An Overview of the Ocean The ocean is a vast and fascinating place. 2  The majority of the planet is covered in the waters that make up the ocean. The majority of the planet is covered in the waters that make up the ocean. 2  Countless creatures swim through the depths of these wa…. 3  Discover More Information About Mailing to Canada Sending letters and parcels from the United States to Canada is not difficult."}]