[{"url": "https://en.wikipedia.org/wiki/Executive_officer", "passage_text": "An executive officer (often abbreviated XO) is generally a person responsible for running an organization, although the exact nature of the role varies depending on the organization. Contents. The US Air Force uses the term executive officer for officers assigned as personal staff officers to general officers. Their role is similar to aides-de-camp in the US Army, Marine Corps and Air Force and flag aides and flag lieutenants in the US Navy and Coast Guard."}, {"url": "https://en.wikipedia.org/wiki/Executive_officer", "passage_text": "In many insurance policies, executive officer means, in the case of a corporation, any chairman, chief executive officer, chief financial officer, chief operating officer, president, or general counsel. In the case of a sole proprietorship, an executive officer is the sole proprietor. The US Air Force uses the term executive officer for officers assigned as personal staff officers to general officers. Their role is similar to aides-de-camp in the US Army, Marine Corps and Air Force and flag aides and flag lieutenants in the US Navy and Coast Guard."}, {"url": "https://en.wikipedia.org/wiki/Chief_executive_officer", "passage_text": "A chief executive officer (CEO in American English) or managing director (MD in British English) describes the position of the most senior corporate officer, executive, or administrator in charge of managing a non-profit or for-profit organization. Responsibilities [edit]. The responsibilities of an organization's CEO are set by the organization's board of directors or other authority, depending on the organization's legal structure. They can be far-reaching or quite limited and are typically enshrined in a formal delegation of authority."}, {"url": "https://en.wikipedia.org/wiki/Executive_officer", "passage_text": "There are executive officer slots in each company, battalion, and brigade, though generally not at higher levels of command until the army level of command. The XO is typically the second-in-command, and serves as the day-to-day manager of the command staff. The US Air Force uses the term executive officer for officers assigned as personal staff officers to general officers. Their role is similar to aides-de-camp in the US Army, Marine Corps and Air Force and flag aides and flag lieutenants in the US Navy and Coast Guard."}, {"url": "http://searchcio.techtarget.com/definition/CEO", "passage_text": "CEO (Chief Executive Officer) is a top-ranking corporate position, responsible for overseeing operations. Often the company's president, the CEO reports to the chairman of the board and board members. "}, {"url": "http://www.merriam-webster.com/dictionary/executive%20officer", "passage_text": "Definition of EXECUTIVE OFFICER. : the officer second in command of a military or naval organization or vessel. ADVERTISEMENT."}, {"url": "http://www.businessdictionary.com/definition/chief-executive-officer-CEO.html", "passage_text": "chief executive officer (CEO). Top executive responsible for a firm's overall operations and performance. He or she is the leader of the firm, serves as the main link between the board of directors (the board) and the firm's various parts or levels, and is held solely responsible for the firm's success or failure. The chief executive officer was insecure and that is why we all thought he wanted that title because it covered up the truth. 11 people found this helpful. He was promoted to Chief Executive Officer after being employed with the company for several years and after many years of schooling."}, {"url": "http://www.merriam-webster.com/dictionary/chief%20executive%20officer", "passage_text": "First Known Use of CHIEF EXECUTIVE OFFICER. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. Note that some information is displayed differently in the Unabridged."}, {"url": "https://en.wikipedia.org/wiki/Executive_officer", "passage_text": "In the case of a limited liability company, an executive officer is any member, manager, or officer. In the airline industry, the executive officer, more commonly known as the first officer, is the second in command of the aircraft. The US Air Force uses the term executive officer for officers assigned as personal staff officers to general officers. Their role is similar to aides-de-camp in the US Army, Marine Corps and Air Force and flag aides and flag lieutenants in the US Navy and Coast Guard."}]