[{"url": "http://www.definitions.net/definition/eupnea", "passage_text": "In the human respiratory system, eupnea or eupnoea is normal, good, unlabored ventilation, sometimes known as quiet breathing or resting heart rate. In eupnea, expiration employs only the elastic recoil of the lungs. "}, {"url": "http://www.wisegeek.com/what-is-eupnea.htm", "passage_text": "Eupnea is the formal medical term used to describe normal respiration. The roots of the word literally mean “good breathing.” If a patient has eupnea, it means that the respiration is not a cause for concern. Patients who have difficulty breathing are assessed to determine why so that appropriate treatments can be offered. No obstructions are present to limit the flow of air or make the breathing noisy and the patient doesn't experience tightness, pain, or other symptoms in the chest that might make breathing difficult. Eupnea is also steady, with a regular respiratory rate."}, {"url": "http://www.sciencedirect.com/science/article/pii/S1569904803001927", "passage_text": "Therefore, eupnea can qualify the breathing patterns most adapted to normal environmental constraints, which are the most commonly observed in vivo. It is distinct from other respiratory patterns that are induced by sudden changes in the environment, such as polypnea that may follow moderate hypoxia or hyperthermia. Respiratory neuronal networks in vertebrates appear to be able to generate a variety of rhythmic patterns in vivo, leading to the biological diversity of eupneic patterns as well as to life-threatening dyspneic patterns."}, {"url": "http://www.audioenglish.org/dictionary/eupnea.htm", "passage_text": "Hypernyms (eupnea is a kind of...): breathing; external respiration; respiration; ventilation (the bodily process of inhalation and exhalation; the process of taking in oxygen from inhaled air and releasing carbon dioxide by exhalation). "}, {"url": "http://www.wisegeek.com/what-is-eupnea.htm", "passage_text": "Eupnea is also known as quiet respiration. Individuals who are morbidly obese may experience breathing difficulties. While people breathe harder during exercise, experienced runners may barely breathe hard during a jog. Patients who are breathing normally should be getting enough oxygen to supply the needs of the body. No obstructions are present to limit the flow of air or make the breathing noisy and the patient doesn't experience tightness, pain, or other symptoms in the chest that might make breathing difficult. Eupnea is also steady, with a regular respiratory rate."}, {"url": "http://www.thefreedictionary.com/eupnea", "passage_text": "Noun. 1. eupnea-normal relaxed breathing. eupnoea. breathing, external respiration, respiration, ventilation-the bodily process of inhalation and exhalation; the process of taking in oxygen from inhaled air and releasing carbon dioxide by exhalation. 1  Facebook."}, {"url": "http://www.thefreedictionary.com/eupnoea", "passage_text": "Noun. 1. eupnoea-normal relaxed breathing. eupnea. breathing, external respiration, respiration, ventilation-the bodily process of inhalation and exhalation; the process of taking in oxygen from inhaled air and releasing carbon dioxide by exhalation. 1  Facebook. eupnoea. n. 1. (Physiology) physiol normal relaxed breathing. Compare dyspnoea."}, {"url": "https://en.wikipedia.org/wiki/Eupnea", "passage_text": "In the human respiratory system, eupnea or eupnoea (Greek eupnoia; from eu, well + pnoia, breath) is normal, good, unlabored ventilation, sometimes known as quiet breathing or resting respiratory rate. In eupnea, expiration employs only the elastic recoil of the lungs. During eupnea, neural output to respiratory muscles is highly regular, with rhythmic bursts of activity during inspiration only to the diaphragm and external intercostal muscles."}, {"url": "http://www.sciencedirect.com/science/article/pii/S1569904803001927", "passage_text": "Defining eupnea as the collection of respiratory strategies preventing potential dyspneas and allowing survival is important to understand the adaptive, phylogenetic and ontogenetic basis for such a diversity of normal breathing patterns. Respiratory neuronal networks in vertebrates appear to be able to generate a variety of rhythmic patterns in vivo, leading to the biological diversity of eupneic patterns as well as to life-threatening dyspneic patterns."}]