[{"url": "http://www.bbb.org/denver/business-reviews/buildings-pre-cut-prefab-and-modular-dealers/sunward-consolidated-group-in-denver-co-26533", "passage_text": "Factors that raised Sunward Consolidated Group's rating include:Length of time business has been operating.Complaint volume filed with BBB for business of this size.Response to 1 complaint(s) filed against business.Resolution of complaint(s) filed against business. Factors that raised Sunward Consolidated Group's rating include: 1  Length of time business has been operating. 2  Complaint volume filed with BBB for business of this size. 3  Response to 1 complaint(s) filed against business."}, {"url": "https://start.cortera.com/company/research/k3m7jus5q/sunward-corp/", "passage_text": "COMPANY OVERVIEW. SUNWARD CORP is in the Fabricated Structural Metal industry in DENVER, CO. This company currently has approximately 100 to 250 employees and annual sales of $10,000,000 to $24,999,999. The information contained in this company profile is compiled from third party sources, including but not limited to public records, user submissions, and other commercially available data sources. These sources may not be accurate, complete, or up-to-date."}, {"url": "https://en.wikipedia.org/wiki/Sunward_Cohousing", "passage_text": "Sunward redirects here. For the company manufacturing model rockets, a trebuchet, a catapult, and hobby products, see Sunward Aerospace Group Limited. Sunward Cohousing is an intentional community located in Ann Arbor, Michigan, USA. Sunward's founders were pioneers in bringing the cohousing model to Michigan. Sunward is situated on 20 acres (eight hectares) of land with 10-acre (40,000 m 2) mature oak and hickory woods contains paths, a nature study area, hidden hammocks, and rolling hills, and it forms a large, common backyard to the north of the tightly clustered homes."}, {"url": "http://www.hktdc.com/services-suppliers/Sunward-Intelligent-Equipment-Co-Ltd/en/1X07XS1N/", "passage_text": "- China (Hunan). Sunward Intelligent Equipment Co., Ltd. is a modern international listed company engaged in construction machinery. Since the foundation in 1999, SUNWARD has developed rapidly by advanced technology and modern management. The average growth rate of main income has exceeded 70% in the previous 8 years"}, {"url": "http://www.bbb.org/denver/business-reviews/buildings-pre-cut-prefab-and-modular-dealers/sunward-consolidated-group-in-denver-co-26533", "passage_text": "BBB AccreditationA BBB Accredited Business since 03/01/1993BBB has determined that Sunward Consolidated Group meets BBB accreditation standards, which include a commitment to make a good faith effort to resolve any consumer complaints. BBB Accredited Businesses pay a fee for accreditation review/monitoring and for support of BBB services to the public. Factors that raised Sunward Consolidated Group's rating include: 1  Length of time business has been operating. 2  Complaint volume filed with BBB for business of this size. 3  Response to 1 complaint(s) filed against business."}, {"url": "https://en.wikipedia.org/wiki/Sunward_Cohousing", "passage_text": "Sunward's legal structure states that homes are privately owned inside, up to the paint on the interior walls, while the community owns the rest of the structure and everything outside the home. Sunward is situated on 20 acres (eight hectares) of land with 10-acre (40,000 m 2) mature oak and hickory woods contains paths, a nature study area, hidden hammocks, and rolling hills, and it forms a large, common backyard to the north of the tightly clustered homes."}, {"url": "http://hn-sunward.en.alibaba.com/company_profile.html", "passage_text": "Sunward Intelligent Equipment Co., Ltd. is a modern international listed company engaged in construction machinery. SUNWARD was awarded as one of the most competitive high-tech enterprises in China, one of the top 50 enterprises in M&S stock market from 2003 to 2007 in China and one of the 100 enterprises having the biggest developing potential in 2006 and 2007 in Forbes Magazine."}]