[{"url": "http://www.nimh.nih.gov/news/science-news/2010/most-children-with-rapidly-shifting-moods-dont-have-bipolar-disorder.shtml", "passage_text": "Of the children with rapid mood swings and high energy, another 12 percent (75 children) had a form of bipolar disorder that includes much shorter manic episodes. Compared to children without rapid mood swings and high energy, those with these symptoms: 1  Reported more symptoms of depression, anxiety, manic symptoms, and symptoms of ADHD. 2  Had lower functioning at home, school, or with peers. Some researchers suggest that this is how mania—an important component of bipolar disorder—appears in children. How mania and bipolar disorder are defined in children is important because rapid mood swings and high energy are common among youth."}, {"url": "https://healthychildren.org/English/health-issues/conditions/adhd/Pages/Mood-Disorders-ADHD.aspx", "passage_text": "A child with bipolar disorder and ADHD is prone to explosive outbursts, extreme mood swings (high, low, or mixed mood), and severe behavioral problems. Such a child is often highly impulsive and aggressive, with prolonged outbursts typically “coming out of nowhere” or in response to trivial frustrations. Many children with bipolar disorder have a family history of bipolar disorder, mood disorder, ADHD, and/or substance abuse. Children with ADHD and bipolar disorder are at higher risk than those with ADHD alone for substance abuse and other serious problems during adolescence."}, {"url": "http://www.hincksdellcrest.org/ABC/Parent-Resource/The-Child-with-Unusal-Behaviours/Mood-Swings.aspx", "passage_text": "Mood swings and sudden behaviour changes often occur along with other conditions. With children, these are likely to be problems of attention, impulsive behaviour and high activity level. Children with developmental disorders may also frequently display sudden mood changes, which are related to their disability. Mood swings can first occur as early as 5 or 6 years of age, but they are rare in this age group. However, by adolescence, the likelihood of the more severe form of mood swings is much greater and similar to that of adults; as many as 1.6% of all adolescents may have severe mood swings."}, {"url": "http://www.hincksdellcrest.org/ABC/Parent-Resource/The-Child-with-Unusal-Behaviours/Mood-Swings.aspx", "passage_text": "Mood swings occur most frequently during two stages of your child’s life. The first stage is the time when toddlers test out their boundaries and are beginning to develop a sense of independence. The next time is most likely to be just before puberty when hormonal changes are often associated with mood changes. Mood swings can first occur as early as 5 or 6 years of age, but they are rare in this age group. However, by adolescence, the likelihood of the more severe form of mood swings is much greater and similar to that of adults; as many as 1.6% of all adolescents may have severe mood swings."}, {"url": "http://www.healthline.com/health/fetal-alcohol-syndrome", "passage_text": "They can be behavioral, physical, related to learning, or all of the above. Fetal alcohol syndrome (FAS) is a severe form of the condition. People with FAS may have problems with their vision, hearing, memory, attention span, and abilities to learn and communicate. Talk to your doctor if you think your child might have FAS. Let your doctor know if you drank while you were pregnant. A physical exam of the baby may show a heart murmur or other heart problems. As the baby matures, there may be other signs that help confirm the diagnosis, these include: 1  slow rate of growth."}, {"url": "http://www.healthgrades.com/symptoms/mood-swings", "passage_text": "Search Now. Find a Great Therapist Near You. Mood swings can occur as a symptom of psychiatric disorders, such as bipolar disorder or borderline personality disorder, or they may result from a medical condition that directly affects the central nervous system, such as dementia, brain tumors, meningitis, and stroke. "}, {"url": "http://www.webmd.com/baby/fetal-alcohol-syndrome", "passage_text": "Fetal alcohol spectrum disorders are a group of birth defects that can happen when a pregnant woman drinks alcohol. Fetal alcohol syndrome (FAS) is the most severe type of the disorder. FAS and other spectrum disorders affect children differently. Symptoms can range from mild to severe. They can include: 1  Problems with the heart, kidney, and/or bones. 2  Learning disabilities and low IQ. 3  Trouble with memory, coordination, and attention. "}, {"url": "http://www.nimh.nih.gov/news/science-news/2010/most-children-with-rapidly-shifting-moods-dont-have-bipolar-disorder.shtml", "passage_text": "In choosing proper treatment, it is important to know whether children with rapid mood swings and high energy have an early or mild form of bipolar disorder, or instead have a different mental disorder. Some researchers suggest that this is how mania—an important component of bipolar disorder—appears in children. How mania and bipolar disorder are defined in children is important because rapid mood swings and high energy are common among youth."}, {"url": "https://healthychildren.org/English/health-issues/conditions/adhd/Pages/Mood-Disorders-ADHD.aspx", "passage_text": "The mood disorders most likely to be experienced by children with ADHD include dysthymic disorder, major depressive disorder (MDD), and bipolar disorder. Dysthymic disorder can be characterized as a chronic low-grade depression, persistent irritability, and a state of demoralization, often with low self-esteem. Many children with bipolar disorder have a family history of bipolar disorder, mood disorder, ADHD, and/or substance abuse. Children with ADHD and bipolar disorder are at higher risk than those with ADHD alone for substance abuse and other serious problems during adolescence."}]