[{"url": "https://answers.yahoo.com/question/index?qid=20061122122848AAnOFVq", "passage_text": "1 3 lb. beef top round roast 1 1/2 tablespoons olive oil 1 teaspoon Kosher salt 1/2 teaspoon black pepper 1. Heat oven to 425 degrees F. Place beef in a jelly-roll pan. Rub with oil, salt and pepper. Insert a meat thermometer. Roast 30 to 35 minutes for medium-rare doneness. Serve it with Bearnaise Béarnaise. sauce 1 3. lb beef top round roast 1/1 2 tablespoons olive oil 1 Teaspoon kosher salt/1 2 teaspoon black pepper. 1 heat oven to 425 Degrees. F place beef in a-jelly roll. Pan rub with, oil salt and. Pepper insert a meat. Thermometer roast 30 to 35 minutes for-medium rare. doneness"}, {"url": "http://www.cooks.com/recipe/gi8xe4pb/crock-pot-london-broil.html", "passage_text": "1 london broil. 1 pkg. ranch salad dressing mix. 1 pkg. Italian salad dressing mix. 1 pkg. brown gravy mix. 1-1/2 cups water. Mix all the dry ingredients with the 1-1/2 cups water. Place roast in crock-pot. Pour the mixture over roast and cook on low overnight. Once you do this recipe-you will never prepare any other way. The gravy it makes-is to die for. This is definitely a male favorite and will fast become a family favorite"}, {"url": "http://www.gonnawantseconds.com/2014/01/easy-pot-roast/", "passage_text": "2. Pour 1/2 cup soup mixture into the bottom of a large crock pot. Add roast in the crock pot. Pour the rest of the soup mixture over roast and cover. Cook on low for approximate 5-8 hours or until fork tender. (a small London Broil roast will obviously cook faster than a thick Chuck Roast-that's why there's such a spread in the time. I cooked a small 2 1/2 pound London Broil in 5 hours). 3. Pour 1/2 cup soup mixture into the bottom of a large roasting pan. Place roast in pan. Pour the rest of the soup mixture over roast and cover. Bake for approximate 4-5"}, {"url": "http://allrecipes.com/recipe/82983/best-london-broil-ever/", "passage_text": "1 Place the roast in a roasting pan, pour stewed tomatoes over it, and season with garlic salt. 2  Roast for 2 1/2 to 3 hours, until fork tender. 3  Let stand for about 10 minutes at room temperature before carving and serving. 1 Preheat the oven to 350 degrees F (175 degrees C). 2  Place the roast in a roasting pan, pour stewed tomatoes over it, and season with garlic salt. 3  Roast for 2 1/2 to 3 hours, until fork tender. 4"}, {"url": "http://flouronmyface.com/crock-pot-london-broil/", "passage_text": "Add 1 tablespoon of butter to a skillet on high. Place the london broil in and brown the first side. Flip it over to brown the other side. Place the London Broil into the bottom of a (affiliate link) 6 quart crock pot and lay the sliced onion and garlic cloves on top of the roast. Salt and pepper the top of the meat and onion slices. Next add the baby red potatoes, baby carrots, bay leaves, salt and pepper. Pour the beef broth in around the london broil."}, {"url": "https://styleandtaste.wordpress.com/2011/04/05/melt-in-your-mouth-london-broil/", "passage_text": "1 large onion (diced). Preheat your oven to 425 degrees. 1  In a large zip-lock bag mix Italian Dressing, Balsamic vinegar, garlic, and mustard. 2  Add your London Broil to the bag. 3  After at least 2 hours remove the London Broil from the bag and with a paper towel dry off excess marinate from the meat. "}, {"url": "http://www.wikihow.com/Cook-London-Broil-in-the-Oven", "passage_text": "How to Cook London Broil in the Oven. Four Parts: Marinating Broiling Baking Mixed Method. While many grocers package and sell cuts of steak labeled “London broil,” the term actually refers to a type of cooking method in which a tough cut of beef is marinated and cooked in a manner that prevents it from drying out. "}, {"url": "http://www.livestrong.com/article/448509-the-best-ways-to-cook-a-london-broil-roast-so-that-it-is-tender/", "passage_text": "Crock Pot London Broil. Preparing a London broil in your slow cooker is a good way to ensure even cooking and tender meat. Combine marinated meat with sliced garlic, bay leaves, water, soy or Worcestershire sauce and sliced onion in your slow cooker. Cover and cook on low overnight, or for 8 to 10 hours. Baked London Broil. You can bake London broil in one of two ways: in foil or on the broiler rack. To bake in foil, remove the meat from the marinade and tightly seal it in heavy aluminum foil. Make a small hole in the foil to vent the steam."}]