[{"url": "http://dui.drivinglaws.org/resources/how-much-does-a-first-offense-dui-cost.htm", "passage_text": "1 If required, you'll pay an installation fee ($100) and monthly rental fee of approximately $50 to $100 per month. 2  Average time for first offense is 3 months though many states require longer periods. 3  Figure this cost between $0 and $325. 4  Increased Insurance costs. 1 Using a lawyer to navigate the system will probably help but (assuming you don't go to trial) will cost approximately $2,000. 2  Of course, there's no expense if you go pro se. 3  Cost: $0 (no lawyer) to $2,000. ( 4 Going to trial will likely cost at least $5,000."}, {"url": "http://well.wvu.edu/articles/the_high_cost_of_drinking_and_driving", "passage_text": "Of course, a single DUI won’t cost you anywhere near that much. But getting caught driving under the influence can be an expensive. Costs vary state by state, but you could spend about $4,000-$5,000 on fines, impound fees, a DUI treatment program, insurance increases and other things—and that’s before you hire a lawyer. Legal Consequences."}, {"url": "http://dui.drivinglaws.org/resources/how-much-does-a-first-offense-dui-cost.htm", "passage_text": "Conclusion: We estimate that the average cost for a non-injury, non-property damage DUI is between $5,000 and $12,000. Keep in mind that our numbers are on the conservative side. 1 Using a lawyer to navigate the system will probably help but (assuming you don't go to trial) will cost approximately $2,000. 2  Of course, there's no expense if you go pro se. 3  Cost: $0 (no lawyer) to $2,000. ( 4 Going to trial will likely cost at least $5,000."}, {"url": "http://www.drunkdrivinglawyers.com/resources/dui-dwi/dui-resources/the-average-cost-of-dui-in-california", "passage_text": "The average cost of a first time DUI in any jurisdiction or state typically averages around $10,000, and in state of California, according to the California Drivers Handbook warnings, these costs will likely be more. 1 The costs of legal fees can range from $300 for an immediate guilty plea up to $25,000 for a comprehensive criminal defense strategy. 2  Alternative Sentence Completion: In most cases, a first time offender will serve an alternative sentence in lieu of incarceration."}, {"url": "http://dui.drivinglaws.org/resources/how-much-does-a-first-offense-dui-cost.htm", "passage_text": "1 Increased Insurance costs. 2  After a DUI, you'll be categorized by your insurance company as a high-risk driver. 3  Most insurance companies will raise rates at least $1,000 - $1500 or more annually. 4  This high-risk requirement typically continues for three years, after which the rates drop back down. 1 Using a lawyer to navigate the system will probably help but (assuming you don't go to trial) will cost approximately $2,000. 2  Of course, there's no expense if you go pro se. 3  Cost: $0 (no lawyer) to $2,000. ( 4 Going to trial will likely cost at least $5,000."}, {"url": "http://www.onedui.com/dui-costs/", "passage_text": "Getting a DUI is expensive, not just with posting bail and paying legal fees, but also in other areas like maintaining insurance or even taking time off your job to fulfill your sentence. While the national average cost of DUI is around $10,000, it can often be much higher or lower depending on where you live. Use the map below to select your state and see the average costs associated with a DUI near you. Steps to Take After Getting a DUI. If you just got a DUI, you may be asking yourself what's next."}, {"url": "http://personalfinance.costhelper.com/dui-attorney.html", "passage_text": "1 If convicted of DUI/DWI charges, fines and other penalties can run $300-$1,2000 or more; auto insurance rates can go up as much as 450 percent; and having your car towed and stored can cost $75-$250 or more. 2  You might also be required to attend DUI/DWI school at a cost of $100-$400. 1 A DUI/DWI attorney may charge a flat fee or an hourly rate of $100-$300 or more. 2  Some accept credit cards, and can be hired over the telephone. 3  A lawyer charging on an hourly basis deducts the hourly rate from the retainer as the work is done."}, {"url": "http://www.dmv.org/articles/real-cost-of-dui-in-california/", "passage_text": "The True Cost of a DUI. Added together all of these DUI-related costs mean you should be ready to pay an estimated $45,435 for a DUI. Keep in mind that this is an estimated minimum for a first-time offense. There is a very good chance you could end up paying more and the number will just keep increasing after each violation. Committing a DUI in California could cost you over $45,000. Most of us are well aware of the dangers of drinking and driving. The exponentially increased risk of hurting yourself and others in an accident should be more than enough to deter everyone from driving under the influence (DUI)."}, {"url": "http://www.yourlegalguide.com/dui-cost/", "passage_text": "DUI costs vary by state, but a first offense, without any injury, property damage or other complications, will likely range between $5,000 and $25,000. If you were involved in an accident or are a repeat offender, these figures can increase considerably. Predictably, costs will increase for more serious offenses  for example, DUI/Manslaughter (a 2nd degree felony) in Florida carries a $10,000 fine 2. In some cases, participation in drug and alcohol programs may be accepted by the court in lieu of paying fines."}, {"url": "http://www.drunkdrivinglawyers.com/resources/dui-dwi/dui-resources/the-average-cost-of-dui-in-california", "passage_text": "Costs of a First Time DUI Offense in California. 1  Bail or Bond: In rare cases, a driver may be released on his or her own recognizance, but in practice, the costs of bailing out of jail immediately following an arrest can run anywhere from $150 to over $2,000 dollars. 1 The costs of legal fees can range from $300 for an immediate guilty plea up to $25,000 for a comprehensive criminal defense strategy. 2  Alternative Sentence Completion: In most cases, a first time offender will serve an alternative sentence in lieu of incarceration."}]