[{"url": "http://www.arthritis-health.com/types/general/crepitus-knee", "passage_text": "1 Unlike a mechanical popping where this popping sensation is painless and intermittent, the crepitus caused by arthritis is oftentimes painful. 2  These symptoms are usually associated with other knee symptoms suggestive of arthritis, such as pain while walking, occasional swelling of the knee, stiffness, and so on."}, {"url": "http://www.wisegeekhealth.com/what-is-crepitus.htm", "passage_text": "Crepitus is a clinical sign which can be associated with numerous medical conditions. It consists of a crackling or cracking sound, which is sometimes audible without a stethoscope. In some cases, the sound is accompanied by pain for the patient, while in others, it may be painless."}, {"url": "http://www.healthgrades.com/symptoms/crepitus", "passage_text": "Crepitus is a crackling or popping sound that occurs as a result of tissues rubbing together abnormally."}, {"url": "http://www.healthgrades.com/symptoms/crepitus", "passage_text": "The sound results from an abnormal interaction between air, fluid or bone. A common example of crepitus is when rough surfaces in a joint rub together and result in a popping and crackling sound or an irregular feeling in your joint."}, {"url": "https://en.wikipedia.org/wiki/Crepitus", "passage_text": "Crepitus /ˈkrɛpɪtəs/ (also termed crepitation) is a medical term to describe the grating, crackling or popping sounds and sensations experienced under the skin and joints or a crackling sensation due to the presence of air in the subcutaneous tissue."}, {"url": "http://www.arthritis-health.com/types/general/what-crepitus", "passage_text": "Crepitus (pronounced krep-it-us) is the medical term used to describe a grinding, crackling or grating sensation and/or sound in the body. It is most commonly used to describe joint cracking, such as knee joint cracking or grinding."}, {"url": "http://www.healthgrades.com/symptoms/crepitus", "passage_text": "Crepitus is often the result of arthritis or a previous joint injury. However, a crackling or popping sound and irregular feeling in your joint may also result from the presence of air in the tissues, which may be due to a wound or certain types of bacterial infections."}, {"url": "http://www.healthgrades.com/symptoms/crepitus--causes", "passage_text": "The most common cause of crepitus is rough cartilage and bone rubbing together in a joint, and the most common cause of this type of crepitus is arthritis or joint injury. Another common cause of crepitus is when air gets inside soft tissues, which can cause a crackling or popping sound when pressed."}]