[{"url": "http://www.yourdictionary.com/persistent-data", "passage_text": "persistent data-Computer Definition. Data that exists from session to session. Persistent data are stored in a database on disk or tape. Contrast with transient data. See persistent name. Computer Desktop Encyclopedia THIS DEFINITION IS FOR PERSONAL USE ONLY All other reproduction is strictly prohibited without permission from the publisher."}, {"url": "http://www8.hp.com/us/en/hp-news/press-release.html?id=1695191", "passage_text": "New HP Atalla solutions help safeguard sensitive data in cloud, on-premises and mobile environments against information theft. LAS VEGAS — HP today announced new encryption capabilities as well as information protection and control solutions that help safeguard data throughout its entire life cycle. "}, {"url": "http://www.javaworld.com/article/2076943/core-java/object-persistence-and-java.html", "passage_text": "Persistence and type. An object-oriented language aficionado would say persistence and type are orthogonal properties of an object; that is, persistent and transient objects of the same type can be identical because one property should not influence the other. Comments. Object durability, or persistence, is the term you often hear used in conjunction with the issue of storing objects in databases. Persistence is expected to operate with transactional integrity, and as such it is subject to strict conditions."}, {"url": "http://www.thefreedictionary.com/persistent+data", "passage_text": "persistence. n. 1. the quality of persisting; tenacity. 2. the act of persisting; continued effort or existence. 3. the continuance of an effect after the cause of it has stopped: persistence of vision. persistence-the act of persisting or persevering; continuing or repeating behavior; his perseveration continued to the point where it was no longer appropriate. perseverance, perseveration."}, {"url": "http://www.javaworld.com/article/2074091/java-web-development/persist-data-with-java-data-objects--part-1.html", "passage_text": "Albert Einstein. The need to persist data created at runtime is as old as computing. And the need to store object-oriented data cropped up when object-oriented programming became pervasive. Currently, most modern, nontrivial applications use an object-oriented paradigm to model application domains. "}, {"url": "http://www.thefreedictionary.com/nonpersistent", "passage_text": "non·per·sis·tent. adj. Having a short life or existence under natural conditions: a nonpersistent pesticide; a nonpersistent infection. (ˌnɒnpəˈsɪstənt). "}, {"url": "http://help.sap.com/saphelp_erp60_sp/helpdata/en/f5/a3682ebc6911d4b2e80050dadfb92b/content.htm", "passage_text": "Select language: Concepts Used in Persistence Transient and persistent data In principle, ABAP programs work with local program data, which resides in the program’s internal session. For example, the Persistence Service ensures that the object is unique within a program (by checking its key attributes), but not for a connection to the database. Transient and persistent data."}, {"url": "http://encyclopedia2.thefreedictionary.com/persistent+data", "passage_text": "persistent data. Data that exists from session to session. Persistent data are stored in a database on disk or tape. Contrast with transient data. See persistent name. 1  Facebook"}, {"url": "https://en.wikipedia.org/wiki/Persistent_data", "passage_text": "From Wikipedia, the free encyclopedia. Persistent Data denotes information that is infrequently accessed and not likely to be modified. The opposite of this is dynamic data (also known as transactional data) where information is asynchronously changed as further updates to the information become available"}]