[{"url": "http://infohouse.p2ric.org/ref/32/31321.pdf", "passage_text": "Boiler Chemicals 101 The primary function of a boiler is to transfer heat from hot gases generated by the combustion of fuel into water until it becomes hot or turns to steam. The steam or hot water can then be used in building or facility processes."}, {"url": "http://www2.claritywatertech.com/blog/bid/356993/Condensate-Water-Treatment-Because-Steam-Boiler-Pipes-Are-Corroding", "passage_text": "Neutralizing amines control corrosion in condensate applications by diminishing the effects of carbon dioxide and other acid forming compounds. Neutralizing amines are used in boiler water treatment to control condensate return line corrosion."}, {"url": "http://momar.com/blog/12/The_Basics_of_Neutralizing_Amines_in_Steam_Line_Treatment", "passage_text": "The four most common neutralizing amines (or amine blends) are ammonia, cyclohexylamine, diethylaminoethanol, and morpholine. Neutralizing amines are fed to maintain a pH of 8.2 to 8.6; however, in difficult to control systems a wider pH value of 7.6 to 8.6 may have to be used."}, {"url": "http://momar.com/blog/12/The_Basics_of_Neutralizing_Amines_in_Steam_Line_Treatment", "passage_text": "Neutralizing amines are a common steam line treatment that can be fed in a water treatment solution along with other treatment chemicals or it can be fed direct to the steam header. The Basics of Neutralizing Amines in Steam Line Treatment."}, {"url": "http://www.waterworld.com/articles/iww/print/volume-11/issue-1/feature-editorial/experiences-using-neutralizing-amines-to-control-ph-minimize-fac-in-a-combined-cycle-power-plant.html", "passage_text": "There are several different neutralizing amine components typically used in the treatment of boiler feedwater and/or condensate. Neutralizing amines each have different chemical properties, and it is important to understand the differences so that the correct components can be applied."}, {"url": "http://www.accepta.com/water-treatment-chemicals-wastewater-effluent-treatment-products/boiler-water-treatment-chemicals/condensate-line-protection-boiler-water-treatment-chemicals/340-mixed-neutralising-amine-boiler-water-treatment-2589", "passage_text": "Accepta 2589 is a high performance mixed neutralising amine scientifically formulated for the treatment of steam boilers and other boiler systems. Accepta 2589 comprises a solution of volatile amine used to neutralise the acidic carbon dioxide content of steam condensate. Accepta 2589 contains a blend of cyclohexylamine and morpholine. The total amine content is 24%. Accepta 2589 extends the life of condensate pipework by retarding the rate of 'grooving' by acidic condensate. Accepta 2589 has FDA approval for use where steam comes into contact with food."}, {"url": "http://momar.com/blog/12/The_Basics_of_Neutralizing_Amines_in_Steam_Line_Treatment", "passage_text": "Neutralizing amines are a common steam line treatment that can be fed in a water treatment solution along with other treatment chemicals or it can be fed direct to the steam header. When feeding the amine to the feed water system, it should be fed downstream of the deaerating equipment."}, {"url": "http://www.powermag.com/organics-in-the-boiler-and-steam-good-or-bad/", "passage_text": "Neutralizing amines. Neutralizing amines have been used extensively by operators of utility and industrial boilers for many years. The first application of amines to feedwater treatment was in the late 1940s. In the 1980s, they were in common use in many boilers."}]