[{"url": "https://en.wikipedia.org/wiki/List_of_current_Canadian_senators", "passage_text": "This is a list of current members of the Senate of Canada (French: Le Senat sénat Du), canada the upper house of The Canadian. Parliament unlike The members Of parliament in The house Of, commons the 105 senators are appointed by The Governor general on the advice of the prime. minister"}, {"url": "http://www.answers.com/Q/How_many_senators_are_there_in_the_Canadian_senate", "passage_text": "There are 100 US Senators. Every state gets 2 senators and there are 50 states. It is important to note that the President of the Senate, the person who presides over the sess … ions of the senate, is the Vice President of the US. He is not himself a senator, but in case of tie votes, he may cast the tie-breaking vote."}, {"url": "http://www.thecanadaguide.com/the-senate", "passage_text": "Canada’s Senate consists of 105 politicians, known as senators, who have been appointed by various Canadian prime ministers. They used to serve for life, but in 1965, this was reformed to merely make their terms last until their 75th birthday (though the last life-term senator did not retire until 1999)."}, {"url": "http://www.answers.com/Q/How_many_senators_are_in_Canada's_Senate", "passage_text": "The Senate of Canada has 105 seats *, and presently there are no vacancies. (* Note that there is a constitutional provision for Her Majesty the Queen of Canada to authorise--on the recommendation of the Governor General of Canada as advised by the prime minister--the summons of an extra four or eight senators."}, {"url": "http://sen.parl.gc.ca/portal/canada-senators-e.htm", "passage_text": "Canada's senators. Canada’s 105 senators come from all walks of life, and from every province and territory. They reflect our rich mix of geographical, religious, ethnic and linguistic communities, gender and age, interests and political perspectives, expertise and experience. Senators are usually affiliated with a political party."}, {"url": "http://canadaonline.about.com/cs/parliament/a/rolesenators.htm", "passage_text": "There are usually 105 Senators in the Senate of Canada, the upper chamber of Canada's Parliament. Canadian Senators are appointed by the Governor General of Canada on the advice of the Canadian Prime Minister. Canadian Senators must be at least 30 years old and retire by the age of 75."}, {"url": "http://www.2020site.org/white-house/How-Many-Senators-are-There-in-Congress.html", "passage_text": "The answer to the question, how many Senators are there in Congress is simple to remember. Each state is eligible to have two Senators no matter what the population is. This is to ensure equal representation in the Upper Body of Congress, which is what the Senate is referred to occasionally."}, {"url": "http://canadaonline.about.com/od/senate/fl/Canadian-Senators-Salaries.htm", "passage_text": "There are normally 105 senators in the Senate of Canada, the upper house of the Parliament of Canada. Canadian senators are not elected. They are appointed by the Governor General of Canada on the advice of the Prime Minister"}]