[{"url": "http://www.webmd.com/women/tc/menstrual-cramps-topic-overview", "passage_text": "Most women have painful menstrual cramps (dysmenorrhea) from time to time. Menstrual cramps are one of the most common reasons for women to seek medical attention. The pain from menstrual cramps can range from mild to severe and can involve the lower belly, back, or thighs. "}, {"url": "https://en.wikipedia.org/wiki/Dysmenorrhea", "passage_text": "Dysmenorrhea occurs less often in those who exercise regularly and those who have children early in life. Treatment may include the use of a heating pad. Medications that may help include NSAIDs such as ibuprofen, hormonal birth control, and the IUD with progestogen. Taking vitamin B or magnesium may help. It usually begins around the time that menstruation begins. Symptoms typically last less than three days. The pain is usually in the pelvis or lower abdomen. Other symptoms may include back pain, diarrhea, or nausea. In young women painful periods often occur without an underlying problem."}, {"url": "http://www.glowm.com/section_view/heading/Dysmenorrhea/item/9", "passage_text": "Primary dysmenorrhea also occurs more frequently in unmarried women than in married women (61% vs. 51%), decreases with age, and does not appear to be related to the type of occupation or physical condition of the woman. Usually appearing within 6–12 months after the menarche, primary dysmenorrhea occurs almost invariably in ovulatory cycles. About 88% of adolescents with dysmenorrhea experience their first painful menstruation within the first 2 years after menarche."}, {"url": "https://en.wikipedia.org/wiki/Dysmenorrhea", "passage_text": "Dysmenorrhea, also known as dysmenorrhoea, painful periods, or menstrual cramps, is pain during menstruation. It usually begins around the time that menstruation begins. Symptoms typically last less than three days. The pain is usually in the pelvis or lower abdomen. Other symptoms may include back pain, diarrhea, or nausea. In young women painful periods often occur without an underlying problem."}, {"url": "http://www.medicinenet.com/menstrual_cramps/page2.htm", "passage_text": "Menstrual cramps typically do not begin until ovulatory menstrual cycles (when an egg is released from the ovaries) occur, and actual menstrual bleeding usually begins before the onset of ovulation. Therefore, an adolescent girl may not experience dysmenorrhea until months to years following the onset of menstruation. There are two types of dysmenorrhea, primary and secondary. In primary dysmenorrhea, there is no underlying gynecologic problem causing the pain. This type of cramping may begin within six months to a year following menarche (the beginning of menstruation), the time when a girl starts having menstrual periods."}, {"url": "http://www.mckinley.illinois.edu/Handouts/menstrual_cramps.html", "passage_text": "Secondary dysmenorrhea is defined as menstrual pain due to pelvic pathology. Secondary dysmenorrhea usually occurs after a woman has had normal menstrual periods for some time. It differs from primary dysmenorrhea in that the pain is caused by an abnormality or disease of the uterus, Fallopian tubes or ovaries. The pain may be similar to menstrual cramps, but often lasts longer than the menses, and may also occur at other times of the month."}, {"url": "http://www.webmd.com/women/menstrual-cramps", "passage_text": "In this article. Dysmenorrhea is the medical term for the painful cramps that may occur immediately before or during the menstrual period. There are two types of dysmenorrhea: primary dysmenorrhea and secondary dysmenorrhea. Primary dysmenorrhea is another name for common menstrual cramps. Cramps usually begin one to two years after a woman starts getting her period. Pain usually is felt in the lower abdomen or back."}, {"url": "http://www.mckinley.illinois.edu/Handouts/menstrual_cramps.html", "passage_text": "Dysmenorrhea means painful menstruation and is classified as primary (from the onset of menstruation) or secondary (due to some physical cause and usually of later onset). The uterus is a muscle. Like all muscles, it contracts and relaxes. Most uterine contractions are never noticed, but strong ones are painful. It differs from primary dysmenorrhea in that the pain is caused by an abnormality or disease of the uterus, Fallopian tubes or ovaries. The pain may be similar to menstrual cramps, but often lasts longer than the menses, and may also occur at other times of the month."}, {"url": "https://www.sharecare.com/health/painful-periods/does-dysmenorrhea-affect-fertility", "passage_text": "A Honor Society of Nursing (STTI) answered. Dysmenorrhea refers to intense pain and cramping during menstruation. While dysmenorrhea does not affect fertility, it may be symptomatic of a fertility issue. Most women with dysmenorrhea have primary dysmenorrhea, which is caused by natural pelvic pain during menstruation. This type of dysmenorrhea is not associated with fertility. "}]