[{"url": "http://www.aiplasticsurgery.com/face-lift-surgery/", "passage_text": "A: The results after a face lift last for many years, often up to 10 years or more. However, the procedure does not stop the clock. The influences of aging and gravity will continue as time passes."}, {"url": "http://www.smartbeautyguide.com/procedures/head-face/facelift", "passage_text": "1 Mini-facelift, or ‘S-Lift,’ refers to a facelift with a small amount of skin undermining with limited SMAS (muscle/fascia) mobilization. 2  With this technique, recovery is fast and results can last up to five years."}, {"url": "http://www.ienhance.com/procedures/face-lift", "passage_text": "The results of a facelift are different for each person. The people who look best after a facelift are those who looked the best before the procedure. Some people have one facelift in a lifetime, while others have a second surgery 7 to 15 years later."}, {"url": "http://www.dailymail.co.uk/news/article-2241642/How-facelift-look-years-Leading-surgeon-answers-question-woman-asks.html", "passage_text": "Facelifts cannot be guaranteed to last more than five years, according to one of Britain’s most eminent plastic surgeons. His verdict is the result of more than a decade of groundbreaking research based on photographs taken of 50 women before and after their operations."}, {"url": "http://healthland.time.com/2012/02/21/how-much-younger-does-a-face-lift-make-you-look/", "passage_text": "People who had a face-lift and neck lift looked an average of 5.7 years younger post-surgery. Adding in eyelid work shaved off nearly two additional years, and adding a forehead lift on top of that took off about another year. People who had all four procedures were said to look 8.4 years younger in their after picture."}, {"url": "http://www.webmd.com/beauty/facelift/face-lift-rhytidectomy", "passage_text": "Your face will be bandaged after the surgery. The dressings are usually removed 1 to 2 days later. If a drainage tube has been placed (usually behind the ear), it will also be removed 1 to 2 days after the surgery. Your doctor will remove your stitches in 5 to 10 days."}, {"url": "http://www.dailymail.co.uk/news/article-2241642/How-facelift-look-years-Leading-surgeon-answers-question-woman-asks.html", "passage_text": "After producing a detailed set of measurements of sections of the face and neck, the results were analysed for any movement that occurred from before the facelift compared to six days after surgery, four weeks after and between four and five years after the operation."}, {"url": "http://www.webmd.com/beauty/facelift/face-lift-rhytidectomy", "passage_text": "Most people can return to their normal activities 2 to 3 weeks after a face-lift. At first your face will feel stiff and will probably look and feel strange to you. This is normal, but it is important to be prepared for it. Numbness of the skin may last for months after the surgery."}, {"url": "http://www.medic8.com/cosmetic-surgery/rhytidectomy/last-surgery.html", "passage_text": "The effects of this surgery last for up to ten years. These effects last for a long time but cannot halt the ageing process. So, you may require further surgery after ten years or so."}]