[{"url": "http://startcooking.com/how-to-cook-a-leg-of-lamb", "passage_text": "Set the bag in a dish and let the lamb marinate in the refrigerator for several hours or overnight-up to 24 hours. Step 6. Roasting the Boneless Leg of Lamb. Remove the lamb from the refrigerator at least 1 hour before cooking it."}, {"url": "http://www.foodnetwork.com/recipes/emeril-lagasse/rosemary-and-garlic-roast-leg-of-lamb-recipe.html", "passage_text": "Directions. Preheat the oven to 400 degrees F. Using your hands, rub the lamb all over with the lemon juice. Pat the garlic and rosemary evenly all over the surface of the meat. Season the meat with the salt and pepper and place the lamb in a roasting pan. Place the lamb in the oven and roast for 30 minutes."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_cook_a_leg_of_lamb_and_at_what_temperature_should_it_be_cooked", "passage_text": "How long it takes to cook a leg of lamb depends on how you well you  like the meat cooked. If you like it rare, it takes about 15  minutes per pound, if you like it medium i … t takes about 25 minutes  per pound, and 30 minutes for well done."}, {"url": "http://www.wikihow.com/Cook-Roast-Lamb", "passage_text": "1. Roast the lamb for 30 minutes. Place the roasting pan in the oven and roast at a high temperature for half an hour. This will create a delicious crust around the leg of lamb."}, {"url": "http://startcooking.com/how-to-cook-a-leg-of-lamb", "passage_text": "For beginner cooks, the smaller boneless roast is easier to carve. Besides, it just fit into my 15-inch long roasting pan, and my larger roasting pan is not as photogenic! The steps involved in making this boneless leg of lamb are: 1  Make a “spice-rub” with garlic, thyme, rosemary, oregano and black pepper."}, {"url": "http://www.answers.com/Q/How_long_does_it_take_to_cook_a_leg_of_lamb_and_at_what_temperature_should_it_be_cooked", "passage_text": "The general rule for lamb is, for every kilogram of weight, cook for an hour at 190 - 200 degrees Celsius, depending on the efficiency of your oven, or 180 degrees for a fan-forced oven. Thus, a 2kg leg of lamb will take two hours."}, {"url": "http://startcooking.com/how-to-cook-a-leg-of-lamb", "passage_text": "As always, there are many different recipes for cooking a leg of lamb. Elise cooks her leg of lamb with the bone in by starting at 425 degrees for 20 minutes then turns the oven down to 300°F and continues to roast the meat for about 10-12 minutes per pound for medium rare lamb."}]