[{"url": "http://health.costhelper.com/eeg.html", "passage_text": "1 If a standard EEG does not provide sufficient information, an extended EEG might be required at a typical cost of $1,000-$3,000 or more."}, {"url": "http://www.slhn.org/Conditions-Services/Neurosciences/Services/EEG-Studies", "passage_text": "An ambulatory EEG is an extended recording of the electrical activity of the brain for active ambulatory patients. Your doctor will decide the length of time the recording device will be in place (24 hours, 48 hours or 72 hours). The test is used to check for seizure activity or other brain problems."}, {"url": "http://www.mydr.com.au/tests-investigations/electroencephalogram-eeg", "passage_text": "The test itself will take about 30-60 minutes. Placing the electrodes usually takes 20 minutes, but can take up to an hour, so the entire procedure may take about one to 2 hours. If you have an ambulatory EEG, brain activity is recorded for 24 hours or more."}, {"url": "http://www.mayoclinic.org/tests-procedures/eeg/basics/definition/PRC-20014093", "passage_text": "An electroencephalogram (EEG) is a test that detects electrical activity in your brain using small, flat metal discs (electrodes) attached to your scalp. Your brain cells communicate via electrical impulses and are active all the time, even when you're asleep."}, {"url": "http://health.costhelper.com/eeg.html", "passage_text": "1 For patients not covered by health insurance, an EEG typically costs $200-$700 or more for a standard EEG -- or up to $3,000 or more if extended monitoring is required. 2  For example, Garden City Hospital in Michigan charges $749 for an EEG, but offers the test for $199 through a special program for uninsured patients."}, {"url": "http://health.costhelper.com/eeg.html", "passage_text": "1 For example, Garden City Hospital in Michigan charges $749 for an EEG, but offers the test for $199 through a special program for uninsured patients. 2  St. Peter's Hospital in Montana charges almost $500 for an awake-and-asleep EEG, about $630 for an awake-and-drowsy EEG and almost $1,300 for a 24-hour EEG."}, {"url": "http://health.costhelper.com/emg-test-cost.html", "passage_text": "1 For patients without insurance, the test typically costs between $150 and $500 per extremity, depending on the health care provider. 2  For example, at a Kaiser Permanente hospital an EMG of one extremity costs $247, while at On Site NCV-EMG Testing, in Tampa, FL, an EMG costs $350 per extremity."}, {"url": "http://www.nervecare.com/tests-and-services-2/eeg/", "passage_text": "1 An EEG is a painless test that measures electrical activity of the brain. 2  An EEG takes approximately one hour. 3  A technician will place small metal electrodes on the scalp with white adhesive paste. 4  You will be lying in a dark and quiet room while recording."}, {"url": "http://health.costhelper.com/eeg.html", "passage_text": "1 And Saint Elizabeth Regional Medical Center in Nebraska, not including doctor fee, charges about $650 for an awake-and-drowsy EEG, about $700 for an awake-and-asleep EEG, about $1,100 for extended EEG monitoring of over an hour, and about $3,000 for EEG monitoring and video recording for 24 hours."}]