[{"url": "http://heart-disease.emedtv.com/open-heart-surgery/open-heart-surgery-recovery.html", "passage_text": "Immediate recovery from open heart surgery begins with the patient being taken to the intensive care unit (ICU) for close monitoring. (Technically speaking, an open heart surgery is any procedure where the chest is opened, which certainly includes procedures beyond a heart bypass (a valve replacement, for example). You will eventually be encouraged to sit up in a chair, as well as eat and drink. If your open heart surgery and immediate recovery goes well, most of the tubes and special equipment will be removed within the first 24 to 48 hours. This is approximately how long your stay in the ICU will be."}, {"url": "http://www.webmd.com/heart-disease/guide/heart-disease-recovering-after-heart-surgery", "passage_text": "Activity After Heart Surgery. After heart surgery, the doctor will tell your loved one when he or she is able to return to daily activities. However, for the first 6-8 weeks, the following guidelines are generally recommended for patients recovering from heart surgery: 1  Gradually increase activity. 2  Household chores can be done, but standing in one place longer than 15 minutes is not recommended. 3  Don't lift objects that weigh more than 10 pounds."}, {"url": "http://www.sts.org/sites/default/files/documents/pdf/whattoexpect.pdf", "passage_text": "heart what to expect after surgery each individual patient responds to surgery different-ly. You are unique! And recovery from each specific surgical procedure, whether a coronary artery bypass for clogged arteries or a valve repair/replacement for a narrow or leaky valve, is somewhat different as well. "}, {"url": "http://www.heart.org/HEARTORG/Conditions/More/HeartValveProblemsandDisease/Heart-Valve-Surgery-Recovery-and-Follow-Up_UCM_450700_Article.jsp", "passage_text": "What to expect after heart valve surgery. The normal recovery time after a heart valve surgery is usually four to eight weeks, and may be shorter after minimally invasive surgeries. Immediately after surgery. Follow-up care. You will most likely be checked within four to six weeks following surgery for a postoperative visit. After that, it is critical to get regular check-ups by a heart specialist. Clarify with your healthcare provide what symptoms would warrant a phone call or an additional recheck"}, {"url": "http://www.webmd.com/heart-disease/guide/heart-disease-recovering-after-heart-surgery", "passage_text": "A. A. The first phase of heart surgery recovery can last from six to eight weeks. Upon discharge from the hospital or health care facility, the patient -- and often the caregiver -- will be given a set of instructions on post-surgery care. However, for the first 6-8 weeks, the following guidelines are generally recommended for patients recovering from heart surgery: 1  Gradually increase activity. 2  Household chores can be done, but standing in one place longer than 15 minutes is not recommended. 3  Don't lift objects that weigh more than 10 pounds."}]