[{"url": "http://mentalfloss.com/article/59644/how-blood-type-determined", "passage_text": "Anti-A serum, you have type A blood. Anti-B serum, you have type B blood. Both anti-A and anti-B serums, you have type AB blood. If your blood cells do not stick together when anti-A and anti-B are added, you have type O blood. In back testing, known A and B cells are added to samples. If the blood clumps together only when B cells are added, the donor has"}, {"url": "https://answers.yahoo.com/question/index?qid=20061102071243AA6mQWG", "passage_text": "The positive and negative are if you have the Rh antigen or not. For example, a person with blood type A-cannot get blood that is positive. However, a person who is positive for the Rh antigen can get blood from positive or negative blood donors. Rh is not passed down from parents. With your parents having AB and O, you can only have type A or type B blood because O is recessive. You could have type O if your mother was AO or BO, but she isn't. Since you have type A, your blood is AO (A from your mother and O from your father... but A is dominant)."}, {"url": "http://www.wisegeekhealth.com/what-determines-what-blood-type-a-person-has.htm", "passage_text": "Once you've determined the parental blood types you can see the possibilities for the children. (You can also work it backward if you know the child's blood type and one of the parent's to discover the other parent's blood type.) A parent with O type and a parent with A type blood can have O or A children. A person's blood type is determined largely by genetics, and it does not change through his or her lifetime. A simple blood typing test can be performed literally anywhere by anyone through the use of specially-treated testing cards. One of the main factors that determines blood type is family genetics"}, {"url": "http://www.wikihow.com/Determine-Positive-and-Negative-Blood-Types", "passage_text": "Find out your parents' blood type. Sometimes it's possible to determine whether you have a positive or negative blood type simply by finding out your parents blood type. However, this only works if both of your biological parents have the same Rhesus factor. Ask your doctor for a blood typing test. If your parents have different blood types, or their blood type is unknown, you can ask your doctor to perform a simple blood typing test to find out whether your blood is positive or negative."}, {"url": "https://answers.yahoo.com/question/index?qid=20061102071243AA6mQWG", "passage_text": "Best Answer: Your genotype determines your blood type before your born. There are three alleles or versions of the blood type gene: A, B, and O. Since everybody has two copies of these genes, there are six possible combinations; AA, BB, OO, AB, AO, and BO. Rh is not passed down from parents. With your parents having AB and O, you can only have type A or type B blood because O is recessive. You could have type O if your mother was AO or BO, but she isn't. Since you have type A, your blood is AO (A from your mother and O from your father... but A is dominant)."}, {"url": "https://en.wikipedia.org/wiki/Blood_type", "passage_text": "Blood type (or blood group) is determined, in part, by the ABO blood group antigens present on red blood cells. A blood type (also called a blood group) is a classification of blood based on the presence or absence of inherited antigenic substances on the surface of red blood cells (RBCs). "}, {"url": "http://www.wakingtimes.com/2013/04/28/your-blood-type-determines-your-personality/", "passage_text": "Your blood group type can reveal your personality; Bright and dark aspects of your personality. Let’s have a look that what blood types possess which kind of qualities for any person and which blood type is compatible to another. "}, {"url": "https://answers.yahoo.com/question/index?qid=20061102071243AA6mQWG", "passage_text": "In addition to the proteins (agglutinogens) existing on your red blood cells, other genes make proteins called agglutinins (a-GLOO-tin-ins) that circulate in your blood plasma. Agglutinins are responsible for ensuring that only the blood cells of your blood type exist in your body. Rh is not passed down from parents. With your parents having AB and O, you can only have type A or type B blood because O is recessive. You could have type O if your mother was AO or BO, but she isn't. Since you have type A, your blood is AO (A from your mother and O from your father... but A is dominant)."}, {"url": "http://www.wikihow.com/Determine-Your-Blood-Type", "passage_text": "3. Donate blood. This is an easy way to determine your blood type and help other people, all at once! Find a local donation center or wait until your school, church or community center hosts a blood drive. When you go in, ask the staff if they can tell you your blood type when you're done."}]