[{"url": "http://stilwellsolar.com/solar_pool_heating.html", "passage_text": "Your Investment. Solar pool heating is currently the most cost-effective use of solar energy. Most systems can be installed for $2500.00 to $4000.00 and will often pay for themselves in as little as 2 years compared to other heat sources."}, {"url": "http://home.costhelper.com/solar-panels.html", "passage_text": "1 Solar-powered home water heaters cost $1,000-$3,500 (including installation) but have extremely low monthly operating costs and can be used in any climate, according to the US Department of Energy. 2  The cost for a solar heating system can vary widely."}, {"url": "http://solarexpert.com/solar-education/solar-faqs/solar-pool/", "passage_text": "If you are currently using a gas or electric pool heater, the savings from solar pool heating system will pay for itself in 2-3 years of installation. For example, the average system costs about $5,500 and it typically costs about $2,000 a year to heat a pool with gas."}, {"url": "http://solarexpert.com/solar-education/solar-faqs/solar-pool/", "passage_text": "A solar pool heater can range in cost from about $3,500 to $8,000 with the average system costing around $5,500."}, {"url": "http://solarexpert.com/solar-education/solar-faqs/solar-pool/", "passage_text": "A solar pool heater can be installed for $3,500 to $8,000. Since the sun is free, it will cost you nothing to heat your pool from April through November. Plus, there are no regular maintenance fees. After five years, you probably won’t spend any additional money than what you originally did for installation."}, {"url": "http://www.howmuchisit.org/pool-solar-panels-cost/", "passage_text": "1 SolarCraft.com states that installing solar panels in a residential pool can cost from $2,500 to $7,000, depending on location and pool size, placement of solar panels, preferred temperature, season of installation, and pool equipment type."}, {"url": "http://solarcraft.com/solar-pool-heating-faqs/", "passage_text": "Solar pool heating system prices for a residential pool can range anywhere from $2500 to $7000. The location and size of the pool, location of the solar panels, desired temperature and season, and type of pool equipment determine system size and costs."}, {"url": "http://www.howmuchisit.org/pool-solar-panels-cost/", "passage_text": "1 SolarExpert.com estimates the cost of a solar panel installation system at around $3,500 to $6,500. 2  An estimate of the number of solar panels needed can be calculated through the solar pool calculator provided by Flasolar.com."}]