[{"url": "http://www.cdc.gov/tb/publications/factseries/prevention_eng.htm", "passage_text": "When TB germs are active (multiplying in your body), this is called TB disease. These germs usually attack the lungs. They can also attack other parts of the body, such as, the kidneys, brain, or spine. TB disease will make you sick. People with TB disease can spread the germs to people they spend time with every day."}, {"url": "http://www.fairview.org/healthlibrary/Article/82443", "passage_text": "Tuberculosis (TB) is a disease caused by a bacteria (germ). It is spread from person to person through the air. TB may scar the lungs and other parts of the body, such as the kidneys, bones, or the brain. TB can even be fatal. There are two forms of TB: Latent TB infection and TB disease. If you have TB disease: Symptoms include a lasting cough, fatigue, coughing up blood, chest pain, sweating at night, fever, loss of appetite, and weight loss. You CAN spread active TB to others. Your family, friends, and people you work with closely should be tested. Take all medication until it’s gone."}, {"url": "http://www.webmd.com/lung/tc/tuberculosis-tb-topic-overview", "passage_text": "1 Latent TB means that you have the TB bacteria in your body, but your body's defenses (immune system) are keeping it from turning into active TB. 2  This means that you don't have any symptoms of TB right now and can't spread the disease to others. 3  If you have latent TB, it can become active TB. Tuberculosis is either latent or active. 1  Latent TB means that you have the TB bacteria in your body, but your body's defenses (immune system) are keeping it from turning into active TB. 2  Active TB means that the TB bacteria are growing and causing symptoms."}, {"url": "http://www.tbfacts.org/tb-prevention/", "passage_text": "A face mask worn by someone with infectious TB can help to prevent the spread of M. tuberculosis from the patient to other people. The face mask can capture large wet particles near the mouth and nose of the patient, preventing the bacteria from being released into the environment. TB Treatment as TB prevention. TB drug treatment for the prevention of TB, also known as chemoprophylaxis, can reduce the risk of a first episode of active TB occurring in people either exposed to infection, or with latent TB. It can also reduce the risk of a recurrent TB episode"}, {"url": "http://www.cdc.gov/tb/publications/factseries/prevention_eng.htm", "passage_text": "TB is spread through the air from one person to another. TB germs are passed through the air when someone who is sick with TB disease of the lungs or throat coughs, speaks, laughs, sings, or sneezes. Anyone near the sick person with TB disease can breathe TB germs into their lungs. These germs usually attack the lungs. They can also attack other parts of the body, such as, the kidneys, brain, or spine. TB disease will make you sick. People with TB disease can spread the germs to people they spend time with every day."}, {"url": "http://www.info.gov.hk/tb_chest/contents/c1212.htm", "passage_text": "1 Early diagnosis and treatment: TB should be treated early in order to prevent deterioration of the disease and spread of the infection. 2  Patients with active pulmonary tuberculosis can attend any government chest clinic for treatment. "}, {"url": "http://www.niaid.nih.gov/topics/tuberculosis/understanding/pages/prevention.aspx", "passage_text": "Tuberculosis (TB) Prevention. TB is an airborne disease and transmission essentially can be prevented through adequate ventilation and limited contact with patients. Many people who are infected with Mycobacterium tuberculosis (Mtb) do not get sick or spread the bacteria to others—this is known as latent TB. In the United States and many other countries, healthcare providers try to identify people infected with Mtb as early as possible, before they advance from latent to active TB."}, {"url": "http://www.healthunit.org/infectious/tb/tb_spread.htm", "passage_text": "People with latent TB do not have symptoms and are not infectious. A person with active TB disease is infectious, and may have some or all of the following symptoms: 1  a cough that will not go away. 2  feeling tired. 3  weight loss. 4  loss of appetite. 5  fever. 6  coughing up blood. 7  night sweats. "}, {"url": "http://www.fairview.org/healthlibrary/Article/82443", "passage_text": "TB disease is also called active TB. If you have TB disease: Symptoms include a lasting cough, fatigue, coughing up blood, chest pain, sweating at night, fever, loss of appetite, and weight loss. You CAN spread active TB to others. Your family, friends, and people you work with closely should be tested. Take all medication until it’s gone."}]