[{"url": "https://en.wikipedia.org/wiki/DNA_methylation", "passage_text": "DNA methylation can stably alter the expression of genes in cells as cells divide and differentiate from embryonic stem cells into specific tissues. The resulting change is normally permanent and unidirectional, preventing a cell from reverting to a stem cell or converting into a different cell type. DNA methylation at the 5 position of cytosine has the specific effect of reducing gene expression and has been found in every vertebrate examined."}, {"url": "http://www.nature.com/scitable/topicpage/The-Role-of-Methylation-in-Gene-Expression-1070", "passage_text": "There are many ways that gene expression is controlled in eukaryotes, but methylation of DNA (not to be confused with histone methylation) is a common epigenetic signaling tool that cells use to lock genes in the off position. , 2002), H3-K9 methylation (methylation of a specific lysine residue in the histone H3) is required in order for DNA methylation to take place. However, exceptions have been observed in which the relationship is reversed."}, {"url": "http://livingto150.com/aging-and-longevity-methylation/", "passage_text": "Methylation is a process which occurs in every one of our cells. It involves a chemical methyl group (CH3) being passed around a series of molecules in a cycle. Methylation enables the body to: 1  Detoxify toxins within the cell. 2  Repair damaged DNA. 3  Create new cells. "}, {"url": "https://en.wikipedia.org/wiki/Methylation", "passage_text": "In biological systems, methylation is catalyzed by enzymes; such methylation can be involved in modification of heavy metals, regulation of gene expression, regulation of protein function, and RNA processing. Methylation of heavy metals can also occur outside of biological systems. DNA methylation in vertebrates typically occurs at CpG sites (cytosine-phosphate-guanine sites, that is, where a cytosine is directly followed by a guanine in the DNA sequence). This methylation results in the conversion of the cytosine to 5-methylcytosine."}, {"url": "https://en.wikipedia.org/wiki/DNA_methylation", "passage_text": "DNA methylation is a process by which methyl groups are added to DNA. Methylation modifies the function of the DNA, typically acting to suppress gene transcription. DNA methylation at the 5 position of cytosine has the specific effect of reducing gene expression and has been found in every vertebrate examined."}, {"url": "http://www.rightdiagnosis.com/medical/methylation.htm", "passage_text": "Methylation: replacing an atom, usually a hydrogen atom, with a methyl group. Source: CRISP. Methylation: Addition of methyl groups. In histo-chemistry methylation is used to esterify carboxyl groups and remove sulfate groups by treating tissue sections with hot methanol in the presence of hydrochloric acid. (From Stedman, 25th ed). "}, {"url": "http://drlwilson.com/Articles/METHYLATION.htm", "passage_text": "April 2015, The Center For Development. Methylation is one of the body s most important and most common chemical processes. It is the addition of a methyl group, or CH3, to many chemical compounds to change their solubility, or for other reasons that are explained below. Methylation is a key step in the formation of our enzymes and proteins. This process is called genetic transcription. It involves first making a copy of a section of DNA, which is a strand of RNA. This is the blueprint, as it were, for our proteins."}, {"url": "https://en.wikipedia.org/wiki/Methylation", "passage_text": "In the chemical sciences, methylation denotes the addition of a methyl group to a substrate or the substitution of an atom or group by a methyl group. Methylation is a form of alkylation with a methyl group, rather than a larger carbon chain, replacing a hydrogen atom. DNA methylation in vertebrates typically occurs at CpG sites (cytosine-phosphate-guanine sites, that is, where a cytosine is directly followed by a guanine in the DNA sequence). This methylation results in the conversion of the cytosine to 5-methylcytosine."}, {"url": "http://chriskresser.com/methylation-what-is-it-and-why-should-you-care/", "passage_text": "A little more about the basics of methylation that’s important to understand is one of the most crucial functions of methylation is that it regulates gene expression, and by that I mean methylation controls the turning on and turning off, which is otherwise known as activating and silencing, genes, gene expression. Methylation, in particular, though, seems to affect certain systems more than others. One of the main systems is the brain and the production of neurotransmitters. With methylation defects, you see autism spectrum disorders, ADHD, all kinds of cognitive and behavioral issues, depression, anxiety, etc."}]