[{"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/magnetic/elemot.html", "passage_text": "Electric Motors. Electric motors involve rotating coils of wire which are driven by the magnetic force exerted by a magnetic field on an electric current. They transform electrical energy into mechanical energy. "}, {"url": "http://wonderfulengineering.com/what-is-an-electric-motor/", "passage_text": "Simply put, an electric motor can be defined as a machine that converts electrical energy into mechanical energy. The first electric motors date back to 1740s when Scottish monk Andrew Gordon created electrostatic devices. As mentioned, the electric motor relies on electromagnetism. Upon placement of a coil carrying current (rectangular coil) in a magnetic field, a torque is generated that acts on the coil and forces it to rotate continuously."}, {"url": "http://study.com/academy/lesson/electric-motor-definition-examples.html", "passage_text": "Lesson Summary. An electric motor is a device that turns electrical energy into motion, usually rotation. It changes electrical energy into mechanical or kinetic (movement) energy. This works using electromagnetism. A loop of wire containing a current is passed through an electromagnet's magnetic field. An electric motor contains a coil of wire (sometimes called a solenoid), that creates a magnetic field when electricity flows through it. This is collectively known as an electromagnet. Then, a current is sent through a loop of wire positioned inside this"}, {"url": "http://www.thefreedictionary.com/electric+motor", "passage_text": "Noun. 1. electric motor-a motor that converts electricity to mechanical work. armature-coil in which voltage is induced by motion through a magnetic field. brush-conducts current between rotating and stationary parts of a generator or motor. electric drill-a rotating power drill powered by an electric motor. field magnet-a magnet that provides a magnetic field in a dynamo or electric motor. motor-machine that converts other forms of energy into mechanical energy and so imparts motion."}, {"url": "https://en.wikipedia.org/wiki/Electric_motor", "passage_text": "An electric motor is an electrical machine that converts electrical energy into mechanical energy. The reverse of this would be the conversion of mechanical energy into electrical energy and is done by an electric generator. An induction motor resembles a rotating transformer, because the stator (stationary part) is essentially the primary side of the transformer and the rotor (rotating part) is the secondary side. Polyphase induction motors are widely used in industry."}, {"url": "http://www.scienceclarified.com/El-Ex/Electric-Motor.html", "passage_text": "An electric motor is a device used to convert electrical energy to mechanical energy. Electric motors are extremely important in modern-day life. "}]