[{"url": "http://www.criminaldefenselawyer.com/crime-penalties/federal/felony-assault-battery.htm", "passage_text": "Felony assault or battery (also referred to in some states as aggravated assault or battery) involves circumstances that make the crime more serious, as when the victim is threatened with or experiences significant violence amounting to substantially more than a minor slap across the face or a punch in the jaw."}, {"url": "http://www.criminaldefenselawyer.com/resources/misdemeanor-battery-indiana.htm", "passage_text": "Battery can be charged as a misdemeanor or a felony. Both misdemeanors and felonies have different levels, which depend upon several factors, including the seriousness of the victims’ injury and (in some cases) whether Indiana law gives the victim special protection. This article deals solely with misdemeanor battery."}, {"url": "http://www.leg.state.fl.us/statutes/index.cfm?App_mode=Display_Statute&URL=0700-0799/0784/Sections/0784.03.html", "passage_text": "(2) A person who has one prior conviction for battery, aggravated battery, or felony battery and who commits any second or subsequent battery commits a felony of the third degree, punishable as provided in s. 775.082, s. 775.083, or s. 775.084."}, {"url": "http://criminal.laws.com/battery", "passage_text": "At the common law level, battery is regarded as a misdemeanor. In these instances, the prosecutor must prove three distinct elements beyond a reasonable doubt to successfully convict the alleged perpetrator. As stated earlier, battery may take on two separate forms: misdemeanor battery and felony battery."}, {"url": "https://www.richardhornsby.com/crimes/battery/felony-battery.html", "passage_text": "The primary distinction between misdemeanor battery, felony battery, and aggravated battery is in the amount of harm that is inflicted. While no injury is necessary for a misdemeanor battery to be committed; a significant injury must occur before Felony Battery can be charged."}, {"url": "http://www.leg.state.fl.us/statutes/index.cfm?App_mode=Display_Statute&URL=0700-0799/0784/Sections/0784.03.html", "passage_text": "775.083.(2) A person who has one prior conviction for battery, aggravated battery, or felony battery and who commits any second or subsequent battery commits a felony of the third degree, punishable as provided in s. 775.082, s. 775.083, or s. 775.084."}, {"url": "https://www.richardhornsby.com/crimes/battery/felony-battery.html", "passage_text": "The crime of Felony Battery in Florida is classified as a Third Degree Felony and assigned a Level 6 offense severity ranking under Florida's Criminal Punishment Code. If convicted of Felony Battery, a judge can impose any combination of the following penalties: 1  Up to five (5) Years in prison."}, {"url": "http://www.husseinandwebber.com/crimes/violent-crimes/simple-battery/", "passage_text": "Under Florida law, Simple Battery (Misdemeanor Battery) is a first degree misdemeanor, with penalties of up to one year in jail or 12 months probation, and a $1,000 fine. Battery is a highly defendable charge, and an attorney is critical to avoiding the harsh consequences of a conviction."}]