[{"url": "https://msdn.microsoft.com/en-us/library/windows/desktop/aa369712(v=vs.85).aspx", "passage_text": "Note The Network Access Protection platform is not available starting with Windows 10. Network Access Protection (NAP) is a set of operating system components that provide a platform for protected access to private networks. "}, {"url": "https://technet.microsoft.com/en-us/library/cc753550(v=ws.10).aspx", "passage_text": "NAP enforcement for VPN. NAP enforcement for VPN is deployed with a VPN enforcement server component and a VPN enforcement client component. Using NAP enforcement for VPN, VPN servers can enforce health policy when client computers attempt to connect to the network using a remote access VPN connection. "}, {"url": "http://www.windowsnetworking.com/articles-tutorials/windows-server-2008/Introduction-Network-Access-Protection-Part1.html", "passage_text": "Conclusion. In this article, I have introduced you to Longhorn Server’s Network Access Protection feature. In Part 2 of this series, I will begin walking you through the actual configuration process. "}, {"url": "http://maximumpcguides.com/windows-7/what-is-the-network-access-protection-agent-napagent-service/", "passage_text": "Network Access Protection Agent (napagent) service details. 1  Service name: napagent. 2  Description: The Network Access Protection (NAP) agent service collects and manages health information for client computers on a network. 3  Path to executable: C:\\windows\\System32\\svchost.exe-k NetworkService. 4  Startup type: Manual. "}, {"url": "https://technet.microsoft.com/en-us/network/bb545879.aspx", "passage_text": "Network Policy and Access Services (NPAS) helps you safeguard the health and security of your network. The NPAS server role includes Network Policy Server (NPS), Health Registration Authority (HRA), and Host Credential Authorization Protocol (HCAP). "}, {"url": "http://searchnetworking.techtarget.com/definition/network-access-protection-NAP", "passage_text": "SecurActive Performance Vision. Microsoft Network Access Protection (NAP) is a policy-based management feature of Windows Server 2008 that allows a network administrator to control access to network resources. Download this Pocket Guide to Network Management and Monitoring. "}, {"url": "https://en.wikipedia.org/wiki/Network_Access_Protection", "passage_text": "Network Access Protection (NAP) is a Microsoft technology for controlling network access of a computer, based on its health. With NAP, system administrators of an organization can define policies for system health requirements. "}, {"url": "http://www.mcafee.com/us/products/network-security/index.aspx", "passage_text": "Expanded network security: Detect and block advanced targeted attacks. McAfee Advanced Threat Defense detects today’s stealthy attacks, converting information into action and, ultimately, protection. See how detection and blocking performance stack up. Network Security Products. Our network security solutions include network intrusion prevention, advanced sandboxing detection, and a next-generation firewall, all designed from the ground up to work together and protect your network from the next generation of network-based attacks."}, {"url": "http://www.eightforums.com/network-sharing/29305-network-access-protection.html", "passage_text": "England, Northamptonshire Posts: 536 Windows 8.1 Pro 64-bit; Windows Server 2012 R2 Standard. Network Access Protection (NAP) is used in domain networks in large enterprises as a security measure so that only machines that reach certain hardware or software requirements are allowed access to the network. "}]