[{"url": "https://msdn.microsoft.com/en-us/library/gg839855.aspx", "passage_text": "Overview of the CIL Processes. The basic steps for running X++ source code as CIL are described in the following table. Step. Description. Write, save, and compile your X++ class. The X++ source code for your class is automatically compiled into p-code when you save the source in the AOT. Compile the p-code into CIL. X++ is compiled into p-code."}, {"url": "https://en.wikipedia.org/wiki/Common_Intermediate_Language", "passage_text": "1 Source code is converted to CIL i.e. Common Intermediate Language, which is the CLI's equivalent to assembly language for a CPU. 2  CIL is then assembled into a form of so-called bytecode and a CLI assembly is created. Its bytecode is translated into native code or — most commonly — executed by a virtual machine. CIL was originally known as Microsoft Intermediate Language (MSIL) during the beta releases of the .NET languages."}, {"url": "http://www.codeguru.com/csharp/.net/net_general/il/article.php/c4635/MSIL-Tutorial.htm", "passage_text": "Microsoft Intermediate Language (MSIL) is a language used as the output of a number of compilers (C#, VB, .NET, and so forth). The ILDasm (Intermediate Language Disassembler) program that ships with the .NET Framework SDK (FrameworkSDK\\Bin\\ildasm.exe) allows the user to see MSIL code in human-readable format. "}, {"url": "http://www.dotnetspark.com/qa/294-what-is-msil-cil--what-is-jit.aspx", "passage_text": "(IL)Intermediate Language is also known as MSIL (Microsoft Intermediate Language) or CIL (Common Intermediate Language). All .NET source code is compiled to IL. presence of metadata in the file along with the MSIL enables your code to describe itself, which means that there is no need for type libraries or Interface Definition Language (IDL)."}, {"url": "https://en.wikipedia.org/wiki/Common_Intermediate_Language", "passage_text": "Common Intermediate Language (CIL, pronounced either sil or kil) (formerly called Microsoft Intermediate Language or MSIL) is the lowest-level human-readable programming language defined by the Common Language Infrastructure (CLI) specification and is used by the .NET Framework and Mono. Its bytecode is translated into native code or — most commonly — executed by a virtual machine. CIL was originally known as Microsoft Intermediate Language (MSIL) during the beta releases of the .NET languages."}, {"url": "http://ax2012anant.blogspot.co.uk/2014/05/how-to-generate-cilcommon-intermediate.html", "passage_text": "CIL (Common Intermediate Language) , formerly known as MSIL (Microsoft Intermediate Language) or sometimes simply IL is a low-level language used by .NET Framework. The runtime (CLR) doesn’t work directly with high-level languages like C#, it works with CIL and compilers of high-level languages simply generate CIL. "}, {"url": "https://en.wikipedia.org/wiki/Common_Intermediate_Language", "passage_text": "CIL is an object-oriented assembly language, and is entirely stack-based. Its bytecode is translated into native code or — most commonly — executed by a virtual machine. CIL was originally known as Microsoft Intermediate Language (MSIL) during the beta releases of the .NET languages."}, {"url": "http://www.urbandictionary.com/define.php?term=CIL", "passage_text": "Top Definition. CIL. Common Intermediate Language (formerly known as MSIL, or Microsoft Intermediate Language) is a low-level assembly-type programming language using the .NET-platform. It is the language into which high-level .NET-languages such as C#, Visual Basic.NET, J# and F# are compiled"}, {"url": "https://en.wikipedia.org/wiki/Common_Intermediate_Language", "passage_text": "Due to standardization of C# and the Common Language Infrastructure, the bytecode is now officially known as CIL. In an independent usage, CIL also refers to the C Intermediate Language, a simplified transformation of C used for further analysis. Its bytecode is translated into native code or — most commonly — executed by a virtual machine. CIL was originally known as Microsoft Intermediate Language (MSIL) during the beta releases of the .NET languages."}]