[{"url": "https://en.wikipedia.org/wiki/Underemployment", "passage_text": "Underemployment refers to an employment situation that is insufficient in some important way for the worker, relative to a standard. Examples include holding a part-time job despite desiring full-time work, and overqualification, where the employee has education, experience, or skills beyond the requirements of the job. 1  Overqualification  or overeducation, or the employment of workers with high education, skill levels, or experience in jobs that do not require such abilities. 2  For example, a trained medical doctor who works as a taxi driver would experience this type of underemployment."}, {"url": "http://useconomy.about.com/od/Employment/p/Underemployment.htm", "passage_text": "The most obvious cause of a large rise in underemployment is a recession and the resultant cyclical unemployment. When there are more workers than there are jobs, and employees have been laid off by the thousands, they will take any job they can get to pay the bills. Another cause of underemployment is technological change."}, {"url": "http://useconomy.about.com/od/Employment/p/Underemployment.htm", "passage_text": "Underemployment is when workers' jobs are less than their skills, education or availability to work. There are two types of underemployment, according to the international Organization for Economic Cooperation and Development (OECD): visible and invisible. When there are more workers than there are jobs, and employees have been laid off by the thousands, they will take any job they can get to pay the bills. Another cause of underemployment is technological change."}, {"url": "https://en.wikipedia.org/wiki/Underemployment", "passage_text": "Underemployment is a significant cause of poverty: although the worker may be able to find part-time work, the part-time pay is not sufficient for basic needs. 1  Overqualification  or overeducation, or the employment of workers with high education, skill levels, or experience in jobs that do not require such abilities. 2  For example, a trained medical doctor who works as a taxi driver would experience this type of underemployment."}, {"url": "https://en.wikipedia.org/wiki/Underemployment", "passage_text": "A related kind of underemployment refers to involuntary part-time workers. These are workers who could (and would like to) be working for the standard work-week (typically full-time employment means 40 hours per week in the United States) who can only find part-time work. 1  Overqualification  or overeducation, or the employment of workers with high education, skill levels, or experience in jobs that do not require such abilities. 2  For example, a trained medical doctor who works as a taxi driver would experience this type of underemployment."}, {"url": "http://eric.ed.gov/?id=ED107862", "passage_text": "Chapter 3 details a comprehensive definition of underemployment--a definition which focuses on the degree of skill utilization in work rather than on unemployment. Chapter 4 seeks to identify and discuss some probable causes of underemployment as defined in the previous chapter. Chapter 5 examines alternative means of estimating the level and character of underemployment as defined in the study."}, {"url": "http://useconomy.about.com/od/Employment/p/Underemployment.htm", "passage_text": "In invisible underemployment, workers are in full-time jobs, but their skills are not being thoroughly used. This type of underemployment is nearly impossible to measure without extensive surveying and a comparative analysis of skills vs job requirements. When there are more workers than there are jobs, and employees have been laid off by the thousands, they will take any job they can get to pay the bills. Another cause of underemployment is technological change."}, {"url": "http://study.com/academy/lesson/what-is-underemployment-definition-types-causes-effects.html", "passage_text": "It is often difficult to get an accurate measurement of underemployment since some underemployed workers are visible workers whose underemployment status is easily identifiable. For instance, those in the part-time worker category may be considered visible. Underemployment is a social problem that affects job growth, poverty levels, business growth, career growth, and the emotional health of underemployed workers. Underemployment is a vicious cycle in which each effect is linked to the next. For instance, underemployed workers generally have less disposable income. Therefore, workers have a tendency to spend less, which impacts business growth, poverty levels, and ultimately the emotional health of underemployed workers"}, {"url": "http://study.com/academy/lesson/what-is-underemployment-definition-types-causes-effects.html", "passage_text": "In this case, the something is employment. While that's a simplistic definition of underemployment, it is nevertheless accurate. Underemployment may be defined as a situation in which workers are employed below their education or skill level, or their availability. Underemployment is a social problem that affects job growth, poverty levels, business growth, career growth, and the emotional health of underemployed workers. Underemployment is a vicious cycle in which each effect is linked to the next. For instance, underemployed workers generally have less disposable income. Therefore, workers have a tendency to spend less, which impacts business growth, poverty levels, and ultimately the emotional health of underemployed workers"}]