[{"url": "http://toxtown.nlm.nih.gov/text_version/chemicals.php?id=31", "passage_text": "Organic compounds are chemicals that contain carbon and are found in all living things. Volatile organic compounds, sometimes referred to as VOCs, are organic compounds that easily become vapors or gases. Along with carbon, they contain elements such as hydrogen, oxygen, fluorine, chlorine, bromine, sulfur or nitrogen. Indoors, products that contain volatile organic compounds release emissions when you use them, and to a smaller degree, when they are stored. You can be exposed to volatile organic compounds at home if you use cleaning, painting, or hobby supplies that contain them."}, {"url": "http://www.wildmintshop.com/learn/volatile-organic-compounds.asp", "passage_text": "Air Fresheners. Volatile Organic Compounds (VOCs) are a large group of carbon-based chemicals that are easily emitted (or separated) as gases from certain solids or liquids. "}, {"url": "https://en.wikipedia.org/wiki/Volatile_organic_compound", "passage_text": "VOCs (or specific subsets of the VOCs) are legally defined in the various laws and codes under which they are regulated. Other definitions may be found from government agencies investigating or advising about VOCs. The United States Environmental Protection Agency (EPA) regulates VOCs in the air, water, and land. Anthropogenic VOCs are regulated by law, especially indoors, where concentrations are the highest. Harmful VOCs typically are not acutely toxic, but have compounding long-term health effects. Because the concentrations are usually low and the symptoms slow to develop, research into VOCs and their effects is difficult."}, {"url": "https://www.health.ny.gov/environmental/indoors/voc.htm", "passage_text": "VOCs are chemicals that easily enter the air as gases from some solids or liquids. They are ingredients in many commonly used products and are in the air of just about every indoor setting. The table below shows some examples of products that contain VOCs. People spend most of their time indoors-at home, school and work. This makes the quality of the indoor air you breathe important. This fact sheet focuses on certain kinds of chemicals called volatile organic compounds or VOCs that are found in many products that we commonly use. It is designed to help you think about what VOCs may be present in your indoor air and steps you can take to reduce them"}, {"url": "http://www.health.state.mn.us/divs/eh/indoorair/voc/", "passage_text": "While most people can smell high levels of some VOCs, other VOCs have no odor. Odor does not indicate the level of risk from inhalation of this group of chemicals. There are thousands of different VOCs produced and used in our daily lives. Most products containing VOCs will off-gas within a short period of time, although some will continue to give off VOCs for a longer period of time. Some steps you can take to reduce your exposure to VOCs in the home are: 1. Source control: Remove or reduce the number of products in your home that give off VOCs. Only purchase amounts of chemicals that you know you will use and carefully follow directions on product label"}, {"url": "https://en.wikipedia.org/wiki/Volatile_organic_compound", "passage_text": "VOCs are numerous, varied, and ubiquitous. They include both human-made and naturally occurring chemical compounds. Most scents or odours are of VOCs. VOCs play an important role in communication between plants, and messages from plants to animals. Some VOCs are dangerous to human health or cause harm to the environment. Anthropogenic VOCs are regulated by law, especially indoors, where concentrations are the highest. Harmful VOCs typically are not acutely toxic, but have compounding long-term health effects. Because the concentrations are usually low and the symptoms slow to develop, research into VOCs and their effects is difficult."}, {"url": "http://healthvermont.gov/enviro/indoor_air/voc.aspx", "passage_text": "“Volatile organic compound” or VOC is the name given to a substance that contains carbon and that evaporates (becomes a vapor) or “off-gases” at room temperature. Some examples of VOCs include benzene, methylene chloride, hexane, toluene, trichloroethane, styrene, heptane, and perchloroethylene. "}, {"url": "http://toxtown.nlm.nih.gov/text_version/chemicals.php?id=31", "passage_text": "Examples of volatile organic compounds are gasoline, benzene, formaldehyde, solvents such as toluene and xylene, styrene, and perchloroethylene (or tetrachloroethylene), the main solvent used in dry cleaning. Indoors, products that contain volatile organic compounds release emissions when you use them, and to a smaller degree, when they are stored. You can be exposed to volatile organic compounds at home if you use cleaning, painting, or hobby supplies that contain them."}]