[{"url": "https://answers.yahoo.com/question/index?qid=20080511183938AA7F9IO", "passage_text": "In naval science, the Black Sea is thought to have received its name because of its hydrogen sulfide layer that begins about 200 meters below the surface, and supports a unique microbial population which produces black sediments probably due to Anaerobic Methane oxidation. Found all of the above on Wikipedia. "}, {"url": "https://en.wikipedia.org/wiki/Black_Sea", "passage_text": "The Black Sea is a sea between Southeastern Europe and Western Asia. It is bounded by Europe, Anatolia and the Caucasus, and drains through the Mediterranean into the Atlantic Ocean, via the Aegean Sea and various straits. The Black Sea has a positive water balance; that is, a net outflow of water 300 km 3 (72 cu mi) per year through the Bosphorus and the Dardanelles into the Aegean Sea."}, {"url": "http://www.answers.com/Q/Why_is_the_Black_Sea_named_the_Black_Sea", "passage_text": "The Black Sea got its name from the Ottoman Turks. 'Kara (Black)' denotes 'North' in Medieval Turkish, as in Kara Denizi-Kara Sea north of Siberian Yakut Turks, similar to Black Sea. It was called the Black sea because it was a Sea of Death. Sailors of long ago, if caught in a storm, usually died because of the absence of islands at which to harbour, and the ferocity of the storms that hit. 3. The intense fogs which develop over the Black sea absorb the light, making the water appear black. 4."}, {"url": "https://answers.yahoo.com/question/index?qid=20120310191548AA6sO8R", "passage_text": "Rating Newest Oldest. Best Answer: The Black Sea is one of four seas named in English after common color terms — the others being the Red Sea, the White Sea and the Yellow Sea. There are actually several possibilities as to why the Black Sea earned its name. 1. The Black Sea was given that name because the lack of oxygen in the water prevents the development of microorganisms, making it appear black. 2."}, {"url": "http://blog.dictionary.com/yellow-sea/", "passage_text": "The Black Sea got its name from the Ottoman Turks. ‘Kara (Black)’ denotes ‘North’ in Medieval Turkish, as in Kara Denizi-Kara Sea north of Siberian Yakut Turks, similar to Black Sea. 6. It may be because of ancient colors of cardinal directions. Black is North, red is South, and yellow is East. The Black Sea is the sea resort coast of my country: Bulgaria. The Black Sea is inter-continental sea, located between the coasts of Bulgaria, Romania, Turkey and Ukraine."}, {"url": "http://profwaqarhussain.blogspot.com/2015/04/why-black-sea-is-called-black-sea.html", "passage_text": "The Black Sea is a turban shaped sea lying on the head of Turkey. It is lying between South Eastern Europe and Asia with area of 436400km2 and have maximum depth of 2212m.It is surrounded by six different countries Turkey, Romania, Ukraine, Russia and Georgia. There are many hypotheses about the name of the Black Sea. The black sea is a strongly stratified body of water because its upper layer is less saline than deep water layer. The upper layer is dilute (less saline) due to fresh water in flow of the river mainly Danube and other rivers."}, {"url": "http://www.sheppardsoftware.com/Europeweb/factfile/Unique-facts-Europe37.htm", "passage_text": "The Black Sea. The Black Sea (known as the Euxine Sea, in antiquity; Latin: Pontus Euxinus) is an inland sea between southeastern Europe and Asia Minor. It is connected to the Mediterranean Sea by the Bosporus and the Sea of Marmara, and to the Sea of Azov by the Strait of Kerch. "}, {"url": "https://answers.yahoo.com/question/index?qid=20120310191548AA6sO8R", "passage_text": "At a certain depth its waters become toxic and poisonous. 5. The Black Sea got its name from the Ottoman Turks. 'Kara (Black)' denotes 'North' in Medieval Turkish, as in Kara Denizi-Kara Sea north of Siberian Yakut Turks, similar to Black Sea. 6. There are actually several possibilities as to why the Black Sea earned its name. 1. The Black Sea was given that name because the lack of oxygen in the water prevents the development of microorganisms, making it appear black. 2."}, {"url": "http://www.answers.com/Q/Why_is_the_Black_Sea_named_the_Black_Sea", "passage_text": "1. The Black Sea was given that name because the lack of oxygen in the water prevents the development of microorganisms, making it appear black. 2. It was called the Black sea because it was a Sea of Death. Sailors of long ago, if caught in a storm, usually died because of the absence of islands at which to harbour, and the ferocity of the storms that hit. 3. The intense fogs which develop over the Black sea absorb the light, making the water appear black. 4."}]