[{"url": "http://homeguides.sfgate.com/colors-fuchsia-plants-62706.html", "passage_text": "Fuchsia (Fuchsia spp.) is grown as an ornamental feature in home landscapes and patio gardens. These plants are annuals in much of the country, but non-hardy varieties can overwinter in U.S. Department of Agriculture plant hardiness zones 10 through 11, while hardy varieties can survive down to USDA zone 7. These plants prefer the bright, indirect light often found on shaded porches, and because of their draping leaves and drooping blossoms, fuchsia plants are a common choice in hanging baskets. Fuchsia blossoms range in color from purple, magenta and pink to red and white. Blossoms consist of four or more sepals on the outer portion of the bloom, one or more corollas (petals), a style and stamens"}, {"url": "http://www.colorcombos.com/fuchsia-color-schemes.html", "passage_text": "The Combo Library provides a convenient way to search fuchsia color schemes. If you are looking for colour schemes with particular color codes, simply enter those html colors into the search box. For example, entering #FFFFFF will narrow down the list to only combinations containing the color white. The Combo Library contains pages of fuchsia color combinations (a.k.a, color schemes and color palettes) for you to choose from. Each color scheme contains the html color codes you will need when coding your website template. The hex codes can be found underneath each of the color swatches."}, {"url": "http://homeguides.sfgate.com/colors-fuchsia-plants-62706.html", "passage_text": "Blossom Colors. Fuchsia blossoms range in color from purple, magenta and pink to red and white. Blossoms consist of four or more sepals on the outer portion of the bloom, one or more corollas (petals), a style and stamens. These plants prefer the bright, indirect light often found on shaded porches, and because of their draping leaves and drooping blossoms, fuchsia plants are a common choice in hanging baskets. Fuchsia blossoms range in color from purple, magenta and pink to red and white."}, {"url": "https://en.wikipedia.org/wiki/Fuchsia_(color)", "passage_text": "In the RGB color model, used to create colors on computers and television screens, and in web colors, fuchsia and magenta are exactly the same color, made by mixing blue and red light at full and equal intensity. In color printing and design, there are more variations between magenta and fuchsia. Fuchsia is usually more purplish color, whereas magenta is more reddish. Fuchsia flowers themselves contain a wide variety of purples. The first recorded use of fuchsia as a color name in English was in 1892."}, {"url": "https://en.wikipedia.org/wiki/Fuchsia_(color)", "passage_text": "Fuchsia (/ˈfjuːʃə/ , FEW-shə) is a vivid purplish red color, named after the flower of the fuchsia plant, which took its name from the 16th century German botanist Leonhart Fuchs. Fuchsia is usually more purplish color, whereas magenta is more reddish. Fuchsia flowers themselves contain a wide variety of purples. The first recorded use of fuchsia as a color name in English was in 1892."}, {"url": "http://desktoppub.about.com/od/choosingcolors/f/What-Color-Is-Fuchsia.htm", "passage_text": "Designers familiar with four-color process printing or desktop printer users who frequently have to refill ink cartridges, will recognize fuchsia as the M in CMYK or the pinkish ink cartridge that is sometimes referred to as the red ink — magenta, a pinkish-red color. The CSS color keyword for #FF00FF is fuchsia. #FF00FF is also one of the browser safe color. The keywords hotpink and darkmagenta are for #FF69B4 and #8B008B respectively. 1  Fuchsia / Magenta is a mixed warm/cool color. 2  Although fuchsia, like pink, is often consider a feminine color, it's not soft or genteel. 3  It's a playful color that can be sophisticated when paired with cool, dark colors"}, {"url": "https://en.wikipedia.org/wiki/Fuchsia_(color)", "passage_text": "The color fuchsia was first introduced as the color of a new aniline dye called fuchsine, patented in 1859 by the French chemist Francois-Emmanuel Verguin. Fuchsia is usually more purplish color, whereas magenta is more reddish. Fuchsia flowers themselves contain a wide variety of purples. The first recorded use of fuchsia as a color name in English was in 1892."}]