[{"url": "http://www.bbc.co.uk/languages/guide/languages.shtml", "passage_text": "The world's most widely spoken languages by number of native speakers and as a second language, according to figures from UNESCO (The United Nations’ Educational, Scientific and Cultural Organization), are: Mandarin Chinese, English, Spanish, Hindi, Arabic, Bengali, Russian, Portuguese, Japanese, German and French."}, {"url": "http://listverse.com/2008/06/26/top-10-most-spoken-languages-in-the-world/", "passage_text": "Number of speakers: 129 million. Often called the most romantic language in the world, French is spoken in tons of countries, including Belgium, Canada, Rwanda, Cameroon, and Haiti. Oh, and France too."}, {"url": "http://www.thecountriesof.com/top-10-most-spoken-languages-in-the-world/", "passage_text": "French is considered the most romantic language in the world. French is spoken in the tons of nations including Canada, Belgium, Cameroon, France, Rwanda and Haiti.French is spoken by more than 1 29 million people."}, {"url": "http://dailynewsdig.com/top-ten-spoken-languages-world-2014/", "passage_text": "Any French person will be quick to tell you that their language is one of the most romantic languages in the world but is also spoken in many other countries such as Belgium, Canada, Rwanda, Cameroon, and Haiti."}, {"url": "http://www.worldblaze.in/top-10-most-spoken-languages-in-the-world/", "passage_text": "One of the most commonly spoken languages in the world in 2015 is French, which has an estimated 160 million speakers. Besides being the official language of France, it is commonly spoken in many other countries around the globe, such as Canada, Belgium, Cameroon, Haiti and Rwanda."}, {"url": "http://www.listsworld.com/top-10-languages-most-spoken-worldwide/", "passage_text": "The third most spoken language of the world is English. The countries in which this language is mostly spoken are Australia, Canada, Ireland, New Zealand, United States, United Kingdom and South Africa. More than 360 million speakers speak English as their native language."}, {"url": "http://listverse.com/2008/06/26/top-10-most-spoken-languages-in-the-world/", "passage_text": "Often called the most romantic language in the world, French is spoken in tons of countries, including Belgium, Canada, Rwanda, Cameroon, and Haiti. Oh, and France too."}, {"url": "http://www.worldblaze.in/top-10-most-spoken-languages-in-the-world/", "passage_text": "Next among the most spoken languages in the world is English, which is spoken in almost every country around the world and has nearly 890 million speakers. USA, Australia, New Zealand, UK, Canada, South Africa and Hong Kong are some of the countries where this language is immensely popular."}, {"url": "http://www.listsworld.com/top-10-languages-most-spoken-worldwide/", "passage_text": "The first ranker language in the whole world is Mandarin. This language is mostly spoken in china, Taiwan, Malaysia and Singapore. Mandarin has more than 1000 million native speakers. This large no. of speakers made this language as the most spoken language in the world."}]