[{"url": "https://en.wikipedia.org/wiki/Redpath_Sugar", "passage_text": "Redpath Sugar is a Canadian sugar refining company now owned by American Sugar Refining. The Redpath Museum of natural history in Montreal was built in 1882 as a gift from Peter Redpath. Commissioned to mark the 25th anniversary of Sir John William Dawson 's appointment as Principal of McGill University, the building was designed in Victorian Gothic style by A.C. Hutchison and A. D. Steele."}, {"url": "http://www.marinedelivers.com/redpath-sugar-ltd", "passage_text": "Keith Fowler, Raw Sugar Logistics Manager, says: “The opening of the Seaway allowed Redpath to transport raw sugar more efficiently from its origin to the refinery in Toronto by utilizing larger, more cost-effective vessels. Redpath Sugar’s white and red package is a familiar sight on Ontario supermarket shelves. Their sugar is used to not only to sweeten coffee and tea but is a staple ingredient in many Canadian household food brands and baked goods."}, {"url": "http://www.theglobeandmail.com/news/toronto/redpath-sugar-is-staying-put-condos-be-damned/article598354/", "passage_text": "The 186-metre-long vessel arrived at Redpath Sugar on Friday afternoon at 1 p.m. laden with 19,000 metric tonnes of Brazilian raw sugar that took it from the South Atlantic Ocean to the St. Lawrence River before mooring at Toronto's harbour. Captain Viktor Shyyan hadn't slept in the past three days. Today the Redpath logo still reflects its founder's actual signature and is the country's oldest food trademark. Sugar from its Toronto refinery is trucked to food-processing firms across Southern Ontario and its packaged sugar is sold throughout Canada."}, {"url": "http://www.marinedelivers.com/redpath-sugar-ltd", "passage_text": "Redpath imports raw sugar extracted from sugar cane grown by farmers in tropical countries such as Brazil, Costa Rica, Nicaragua, Guatemala and El Salvador. It is transported through the Seaway to Lake Ontario and then made into different sugar products at Redpath’s refinery on the Toronto waterfront. Redpath Sugar’s white and red package is a familiar sight on Ontario supermarket shelves. Their sugar is used to not only to sweeten coffee and tea but is a staple ingredient in many Canadian household food brands and baked goods."}, {"url": "http://torontolife.com/food/redpath-refines-shipload-raw-sugar/", "passage_text": "“It's enough to keep us in sugar for about 10 days,” says Redpath president Jonathan Bamberger. The Tundra travelled from Brazil and was the first ocean vessel to come into Toronto's port this season. The raw sugar shed is the length of two football fields on Redpath's 10-and-a-half acre site and can fit 16,000 tonnes of unrefined cane sugar. Excavators break up and smooth the sugar to every corner of the shed. http://torontolife.com/wp-content/uploads/2015/04/toronto-redpath-sugar-01-150x150.jpg."}, {"url": "http://redpathsugar.com/faqs/", "passage_text": "At Redpath Sugar we are constantly striving to reduce our environmental footprint. We are very proud that Redpath Sugar Ltd. has been awarded the Canadian Industry Program for Energy Conservation (CIPEC) Leadership Award for 2009. "}, {"url": "http://www.theglobeandmail.com/news/toronto/redpath-sugar-is-staying-put-condos-be-damned/article598354/", "passage_text": "In the early part of the season-March to May-Redpath gets its raw sugar from Guatemala, Nicaragua, El Salvador, Costa Rica and Colombia. After that, the source shifts to Brazil, the world's largest raw-sugar exporter. Today the Redpath logo still reflects its founder's actual signature and is the country's oldest food trademark. Sugar from its Toronto refinery is trucked to food-processing firms across Southern Ontario and its packaged sugar is sold throughout Canada."}, {"url": "https://en.wikipedia.org/wiki/Redpath_Sugar", "passage_text": "History [edit]. Redpath Sugar was established as the Canada Sugar Refining Company in 1854 in Montreal, Quebec by Scots-Quebecer entrepreneur, John Redpath (1796-1869). The Redpath Museum of natural history in Montreal was built in 1882 as a gift from Peter Redpath. Commissioned to mark the 25th anniversary of Sir John William Dawson 's appointment as Principal of McGill University, the building was designed in Victorian Gothic style by A.C. Hutchison and A. D. Steele."}, {"url": "https://en.wikipedia.org/wiki/Redpath_Sugar", "passage_text": "In 1959, Redpath Industries Ltd. was acquired by the British company Tate & Lyle plc. The Redpath Sugar Refinery was built on the Toronto waterfront in the late 1950s, at the time of the completion of the Saint Lawrence Seaway, and is still in operation. The Redpath Museum of natural history in Montreal was built in 1882 as a gift from Peter Redpath. Commissioned to mark the 25th anniversary of Sir John William Dawson 's appointment as Principal of McGill University, the building was designed in Victorian Gothic style by A.C. Hutchison and A. D. Steele."}]