[{"url": "http://www.malaria.org/wheredoesitoccur.html", "passage_text": "Asia: Malaria is widespread in numerous countries in Asia and Oceania, including India, Pakistan, Bangladesh, Thailand, Vietnam, Laos, Myanmar, Cambodia, Indonesia, Papua New Guinea. Malaria also occurs in portions of Iran and the Middle East. Plasmodium falciparum is common, as is Plasmodium vivax."}, {"url": "http://www.malaria.org/wheredoesitoccur.html", "passage_text": "Plasmodium malariae also occurs in this area. South America: Malaria occurs at altitudes below 1000 m in portions of countries in South America, including Brazil, Peru, Colombia, Bolivia, Ecuador, Venezuela, Guyana, Suriname, French Guiana."}, {"url": "http://www.cdc.gov/malaria/about/faqs.html", "passage_text": "Plasmodium falciparum is the type of malaria that most often causes severe and life-threatening malaria; this parasite is very common in many countries in Africa south of the Sahara desert. People who are heavily exposed to the bites of mosquitoes infected with P. falciparum are most at risk of dying from malaria."}, {"url": "http://patient.info/health/malaria-prevention", "passage_text": "They are provided with up-to-date information about the best antimalarial medication for each country. Malaria is a serious infection. It is common in tropical countries such as parts of Africa, Asia and South America. Malaria is a disease caused by a parasite called Plasmodium that lives in mosquitoes."}, {"url": "http://www.cdc.gov/malaria/about/distribution.html", "passage_text": "In many malaria-endemic countries, malaria transmission does not occur in all parts of the country. Even within tropical and subtropical areas, transmission will not occur."}, {"url": "http://www.infoplease.com/ipa/A0903696.html", "passage_text": "Malaria: Malaria is a mosquito-borne disease that affects more than 500 million people annually, causing between 1 and 3 million deaths. It is most common in tropical and subtropical climates and is found in 90 countries—but 90% of all cases are found in Sub-Saharan Africa."}, {"url": "http://www.earth.columbia.edu/articles/view/43", "passage_text": "For example, in Africa, a child dies from malaria every 30 seconds. Because malaria causes so much illness and death, the disease is a great drain on many national economies. Since many countries with malaria are already among the poorer nations, the disease maintains a vicious cycle of disease and poverty."}]