[{"url": "http://www.investopedia.com/terms/n/national_stock_exchange.asp", "passage_text": "The National Stock Exchange is India's largest financial market. Established in 1992, the NSE has developed into a sophisticated, electronic market, which ranks third in the world for transacted volume. The NSE conducts transactions in the wholesale debt, equity and derivative markets. Next Up. "}, {"url": "https://in.answers.yahoo.com/question/index?qid=20071227000130AA57jeK", "passage_text": "NSE is the National Stock Exchange of India. It was setup on the recommendations of the Pheerwani Committee on establishing of New Stock Exchanges. It aims to reach International standards of trading and transparency. It provides a nation-wide securities trading facility as well as futures trading in India. These are the major stock exchanges in the country. There are other stock exchanges like the Calcutta Stock Exchange etc. but they are not as popular as the BSE and the NSE.Most of the stock trading in the country is done though the BSE & the NSE. Besides Sensex and the Nifty there are many other indexes."}, {"url": "https://en.wikipedia.org/wiki/National_Stock_Exchange_of_India", "passage_text": "The National Stock Exchange of India Limited (NSE) is the leading stock exchange of India, located in Mumbai. The exchange was incorporated in 1992 as a tax-paying company and was recognized as a stock exchange in 1993 under the Securities Contracts (Regulation) Act, 1956, when P. V. Narasimha Rao was the Prime Minister of India and Manmohan Singh was the Finance Minister."}, {"url": "http://www.nseindia.com/global/content/about_us/about_us.htm", "passage_text": "About NSE. The National Stock Exchange (NSE) is India's leading stock exchange covering various cities and towns across the country. NSE was set up by leading institutions to provide a modern, fully automated screen-based trading system with national reach. The Exchange has brought about unparalleled transparency, speed & efficiency, safety and market integrity. It has set up facilities that serve as a model for the securities industry in terms of systems, practices and procedures."}, {"url": "http://www.nse.org/", "passage_text": "NSE is a study away experience that fits into university initiatives for globalization, diversity and engagement. NSE participants have found their exchanges culturally enriching, academically rewarding, and one of the most significant experiences of their undergraduate education. "}, {"url": "http://www.sharetipsinfo.com/bse-vs-nse.html", "passage_text": "About BSE. BSE or Bombay Stock Exchange is the oldest stock exchange in Asia that was established in 1875. What’s more, it is also the biggest stock exchange in the world. BSE is located at Dalal Street, Mumbai. Bombay Stock Exchange and National Stock Exchange are both major stock exchange in India. But there is a difference between NSE and BSE. Investors put their money in the stock market in order to reap huge benefits from their investment. Difference between NSE and BSE, Exchanges of Indian stock market. Stock market is something which you cannot predict what is going to happen in the market tomorrow without proper analyzes of market."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_BSE_and_NSE", "passage_text": "Just like the Sensex represents the top stocks of the BSE, the Nifty represents the top stocks of the NSE. Just in case you are confused, the BSE, is the Bombay Stock Exchange and the NSE is the National Stock Exchange. The BSE is situated at Bombay and the NSE is situated at Delhi. These are the major stock exchanges in the country. SENSEX-SENSITIVITY INDEX: NIFTY-NATIONAL FIFTY An abbreviation of the Bombay Exchange Sensitive Index (Sensex) - the benchmark index of the Bombay Stock Exchange (BSE). It is composed of 30 of the largest and most actively-traded stocks on the BSE."}, {"url": "https://in.answers.yahoo.com/question/index?qid=20071227000130AA57jeK", "passage_text": "In October 2007, the equity market capitalization of the companies listed on the NSE was US$ 1.46 trillion, making it the second largest stock exchange in South Asia, behind the Bombay Stock Exchange, and the eleventh largest in the world. These are the major stock exchanges in the country. There are other stock exchanges like the Calcutta Stock Exchange etc. but they are not as popular as the BSE and the NSE.Most of the stock trading in the country is done though the BSE & the NSE. Besides Sensex and the Nifty there are many other indexes."}, {"url": "https://en.wikipedia.org/wiki/National_Stock_Exchange_of_India", "passage_text": "NSE has a market capitalization of more than US$ 1.65 trillion, making it the world’s 12th-largest stock exchange as of 23 January 2015. NSE's flagship index, the CNX Nifty ,the 50 stock index, is used extensively by investors in India and around the world as a barometer of the Indian capital markets. The exchange was incorporated in 1992 as a tax-paying company and was recognized as a stock exchange in 1993 under the Securities Contracts (Regulation) Act, 1956, when P. V. Narasimha Rao was the Prime Minister of India and Manmohan Singh was the Finance Minister."}]