[{"url": "http://inventors.about.com/library/inventors/blsteamengine.htm", "passage_text": "In Newcomen's engine the intensity of pressure was not limited by the pressure of the steam, unlike what Thomas Savery had patented in 1698. In 1712, Thomas Newcomen together with John Calley built their first engine on top of a water filled mine shaft and used it to pump water out of the mine. Watt's engine soon became the dominant design for all modern steam engines and helped bring about the Industrial Revolution. A unit of power called the Watt was named after James Watt. the Watt symbol is W, and it is equal to 1/746 of a horsepower, or one Volt times one Amp."}, {"url": "http://www.brighthubengineering.com/manufacturing-technology/71480-the-invention-of-the-steam-engine/", "passage_text": "Another possible answer to the question, 'Who invented the first steam engine and in what year ?' is Thomas Savery in 1698. That's the year in which Savery (1650 - 1715), an English military engineer, patented a device to remove water from coal mines using steam. Thomas Newcomen (1663 - 1729) is a third candidate for recognition as 'the one who invented the steam engine .' He built the first atmospheric steam engine as an improvement over Savery's device for removing water from coal mines. Newcomen's steam engine is shown in the illustration at the left."}, {"url": "http://www.brighthubengineering.com/manufacturing-technology/71480-the-invention-of-the-steam-engine/", "passage_text": "Thomas Newcomen and a Steam Engine to Remove Water from Mines. Thomas Newcomen (1663 - 1729) is a third candidate for recognition as 'the one who invented the steam engine .' He built the first atmospheric steam engine as an improvement over Savery's device for removing water from coal mines. Newcomen's steam engine is shown in the illustration at the left."}, {"url": "https://en.wikipedia.org/wiki/Steam_engine", "passage_text": "In 1781 James Watt patented a steam engine that produced continuous rotary motion. Watt's ten-horsepower engines enabled a wide range of manufacturing machinery to be powered. The engines could be sited anywhere that water and coal or wood fuel could be obtained. James Watt, in 1781, patented steam engine that produced continued rotary motion and the power about 10 hp. It was the first type of steam engine to make use of steam at a pressure just above atmospheric to drive the piston helped by a partial vacuum."}, {"url": "https://en.wikipedia.org/wiki/Steam_engine", "passage_text": "Using boiling water to produce mechanical motion goes back over 2000 years, but early devices were not practical. The Spanish inventor Jeronimo jerónimo De ayanz Y beaumont patented in 1606 the first steam. Engine in 1698 Thomas savery patented a steam pump that used steam in direct contact with the water being. pumped James Watt, in 1781, patented steam engine that produced continued rotary motion and the power about 10 hp. It was the first type of steam engine to make use of steam at a pressure just above atmospheric to drive the piston helped by a partial vacuum."}, {"url": "http://www.answers.com/Q/What_year_was_the_steam_engine_invented", "passage_text": "1698, English military engineer, Thomas Savery (1650-17150 The idea of using boiling water to produce mechanical motion has a long history, going back about 2000 years. (see t … he related link below). However, the first practical steam-powered 'engine' was a water pump, developed in 1698 by Thomas Savery. The Greek inventor Hero invented a steam turbine, the aeliopile, sometime around 40 or 50 AD. Thomas Newcomen (1664-1729) was the English inventor (1712) of a practical pist … on steam engine, initially used to pump water from mines."}, {"url": "http://inventors.about.com/library/inventors/blsteamengine.htm", "passage_text": "Illustration of Thomas Newcomen's Engine circa 1712 Thomas Newcomen was an English blacksmith, who invented the atmospheric steam engine, an improvement over Thomas Slavery's previous design. The Newcomen steam engine used the force of atmospheric pressure to do the work. Watt's engine soon became the dominant design for all modern steam engines and helped bring about the Industrial Revolution. A unit of power called the Watt was named after James Watt. the Watt symbol is W, and it is equal to 1/746 of a horsepower, or one Volt times one Amp."}, {"url": "http://americanhistory.about.com/od/industrialrev/p/steamengine.htm", "passage_text": "By Martin Kelly. Background of the Steam Engine: While Thomas Savery patented the first crude steam engine in 1698. Thomas Newcomen improved on this design. However, it wasn't until Scotsman James Watt improved on the steam engine in the second half of the 18th century that it became a truly viable piece of machinery that helped start the Industrial Revolution. "}, {"url": "http://www.brighthubengineering.com/manufacturing-technology/71480-the-invention-of-the-steam-engine/", "passage_text": "There is no simple answer to the question, 'Who invented the first steam engine and in what year?' There are several people who invented aspects of the steam engine and contributed to development of the steam engine approximately as we know it today over a period of at least 1700 years. Thomas Newcomen (1663 - 1729) is a third candidate for recognition as 'the one who invented the steam engine .' He built the first atmospheric steam engine as an improvement over Savery's device for removing water from coal mines. Newcomen's steam engine is shown in the illustration at the left."}, {"url": "http://www.answers.com/Q/What_year_was_the_steam_engine_invented", "passage_text": "The first practical steam engine was Thomas newcomens machine The idea of using boiling water to produce mechanical motion has a long history, going back about 2000 years. (… see the related link below). However, the first practical steam-powered 'engine' was a water pump, developed in 1698 by Thomas Savery. The Greek inventor Hero invented a steam turbine, the aeliopile, sometime around 40 or 50 AD. Thomas Newcomen (1664-1729) was the English inventor (1712) of a practical pist … on steam engine, initially used to pump water from mines."}]