[{"url": "http://petteethcleaning.net/cat-teeth-cleaning-cost", "passage_text": "Anesthesia is Often Not Included. Usually, the cat teeth cleaning cost does not include anesthesia. You pet will need to be under general anesthesia in order for the veterinarian to perform the procedure. The general anesthesia will add about $75-$100 to the cost of the teeth cleaning. Also, your cat will need an antibiotic for about 10 days following the cleaning, which costs an additional $25-$40. The cleaning cost does not include tooth removal, which may be necessary if some of your cat’s teeth are too damaged to try to save."}, {"url": "http://pets.costhelper.com/cat-teeth-cleaning.html", "passage_text": "1 Antibiotics typically cost between $30 and $50. 2  If the veterinarian suspects the cat has an infection of some kind -- usually due to an abscessed tooth from neglected teeth and gums -- he or she may prescribe antibiotics to be taken about a week before and a week after the cleaning. Discounts: 1 "}, {"url": "http://health.costhelper.com/teeth-cleaning.html", "passage_text": "1 The total cost for an appointment with these additional services can be $100-$300 or more, depending on local rates and the number and type of X-rays. 2  For example, CostHelper readers report paying $114-$320 for a complete teeth cleaning appointment, with an average cost of $198. 1 Frequently a teeth cleaning appointment will also include dental X-rays and an exam by the dentist. 2 "}, {"url": "http://pets.costhelper.com/cat-teeth-cleaning.html", "passage_text": "1 These retail for about $4 for a set of two. 2  The average price of a veterinary teeth cleaning is $400, with a range from $55 to $830. 3  The price depends on whether blood work is done, whether teeth are pulled and whether the cat is anesthetized. 4  The price also depends on the location and availability of veterinarians. Discounts: 1  Antibiotics typically cost between $30 and $50. 2  If the veterinarian suspects the cat has an infection of some kind -- usually due to an abscessed tooth from neglected teeth and gums -- he or she may prescribe antibiotics to be taken about a week before and a week after the cleaning."}, {"url": "http://pets.costhelper.com/cat-teeth-cleaning.html", "passage_text": "1 The average price of a veterinary teeth cleaning is $400, with a range from $55 to $830. 2  The price depends on whether blood work is done, whether teeth are pulled and whether the cat is anesthetized. Discounts: 1  Antibiotics typically cost between $30 and $50. 2  If the veterinarian suspects the cat has an infection of some kind -- usually due to an abscessed tooth from neglected teeth and gums -- he or she may prescribe antibiotics to be taken about a week before and a week after the cleaning."}, {"url": "http://petteethcleaning.net/cat-teeth-cleaning-cost", "passage_text": "The cost of cat teeth cleaning can be very expensive because the procedure includes much more than just a simple cleaning. The typical cost of cleaning cats teeth is about $250-$300, depending on the area in which you live. When asking your veterinarian how much does cat teeth cleaning cost, be sure to ask who will be doing the procedure. Also, your cat will need an antibiotic for about 10 days following the cleaning, which costs an additional $25-$40. The cleaning cost does not include tooth removal, which may be necessary if some of your cat’s teeth are too damaged to try to save."}, {"url": "http://pets.costhelper.com/dog-teeth-cleaning.html", "passage_text": "1 The average claims amount submitted for dog teeth cleaning by Veterinary Pet Insurance policyholders is $292. 2  Daily brushing with dog toothpaste, which veterinarians recommend in addition to regular cleanings, costs about $30 to $60 or per year, depending on the size of the dog. 1 Dental diets cost about $30 for a 30-pound bag, or about $250 per year to feed a moderately active medium-sized dog. 2  Treats can cost about $50 to $100 or more per year, depending on the type and frequency of use."}, {"url": "http://health.costhelper.com/teeth-cleaning.html", "passage_text": "1 A standard teeth cleaning by a dental hygienist can cost $75-$200, depending on the dentist's office and local rates. 2  CostHelper readers report paying $80-$175, or an average cost of $127 for just a routine cleaning. 3  Frequently a teeth cleaning appointment will also include dental X-rays and an exam by the dentist. 1 Frequently a teeth cleaning appointment will also include dental X-rays and an exam by the dentist. 2  The total cost for an appointment with these additional services can be $100-$300 or more, depending on local rates and the number and type of X-rays."}, {"url": "http://www.vetinfo.com/professional-cat-teeth-cleaning-cost.html", "passage_text": "The Cost of Professional Cat Teeth Cleaning. The cost of a professional cat teeth cleaning may vary depending on each dental clinic in part. On average, the costs may be around $300. This price contains the anesthesia, which is about $150. The costs of ultrasonic cleaning may be higher. Prices may also vary depending on geographical location. The average cost of a dental consult for a cat is about $50. Even if the costs of professional dental cleaning may sound steep, you should know that this is important and may prevent other health problems that may cost much more to treat."}]