[{"url": "http://noisey.vice.com/blog/lil-durk-dej-loaf-what-you-do-to-me-remix", "passage_text": "Jan 5 2015 Like · Comment · Share Tags: Lil Durk, DeJ Loaf, What You Do To Me, Chicago, Detroit, Chicago Rap, Detroit Rap, hip-hop, rap."}, {"url": "http://theboombox.com/lil-durk-what-you-do-to-me-remix-dej-loaf/", "passage_text": "While there is still no confirmation as to whether or not the Chi-town drill rapper has taken the Midwest MC up on her ‘Try Me’ offer, the catchy jam is sure to make cuddle season playlists. Listen to Lil Durk’s ‘What You Do to Me’ Remix Feat. Dej Loaf."}, {"url": "http://noisey.vice.com/blog/lil-durk-dej-loaf-what-you-do-to-me-remix", "passage_text": "0. Lil Durk is one of Chicago's most innovative rappers, but the hottest song he made in 2014 may have actually been his take on Try Me, the hit from Detroit's DeJ Loaf."}, {"url": "http://theboombox.com/lil-durk-what-you-do-to-me-remix-dej-loaf/", "passage_text": "By Dominique Zonyee January 7, 2015 10:21 AM. Share on Facebook Share on Twitter. If fans didn’t believe rumors that Dej Loaf and Lil Durk are an item, then after listening to their new collaboration, ‘What You Do to Me’ remix, they may just have the confirmation they need. Durk and Dej show off their softer sides, detailing how they make one another feel on the intimate, sing-songy duet."}, {"url": "http://www.rap-up.com/2015/01/05/new-music-lil-durk-dej-loaf-what-you-do-to-me-remix/", "passage_text": "“DeJ Loaf, baby, I want you … We can be like Kim and Kanye except you can be my fiancee,” fiancée Sings, durk DeJ dej promises “to [change] his.”. life"}, {"url": "http://www.rap-up.com/2015/01/05/new-music-lil-durk-dej-loaf-what-you-do-to-me-remix/", "passage_text": "“DeJ Loaf, baby, I want you … We can be like Kim and Kanye except you can be my fiancee,” fiancée Sings, durk DeJ dej promises “to [change] his.”. Life following The october release of her Mixtape Sell, DeJ dej is in the studio working on Her Columbia records. “Debut’i m going to put out good. music"}, {"url": "http://www.rap-up.com/2015/01/05/new-music-lil-durk-dej-loaf-what-you-do-to-me-remix/", "passage_text": "DeJ Loaf joins Lil Durk on a remix to “What You Do to Me,” which originally appeared on Durk’s July mixtape Signed to the Streets 2. The Chicago rapper and “Try Me” hitmaker, who have been flirting on social media, show off their chemistry as they go back and forth on the Auto-Tuned track."}, {"url": "http://www.xxlmag.com/rap-music/new-music/2015/01/lil-durk-dej-loaf-remix-what-you-do-to-me/", "passage_text": "Is the official remix to “What You Do To Me” the de facto public announcement of a relationship between Dej Loaf and Lil Durk?"}]