[{"url": "http://www.pcmag.com/article2/0,2817,2488270,00.asp", "passage_text": "Zendesk is arguably one of the most popular help desk solutions available today. Used by a large number of companies both big and small, Zendesk is a solid application. But, while the version of this cloud service that we tested can be had for only $1 per user per month, you can bet most of Zendesk's customers aren't running at this Starter tier price. Competent But Probably Expensive Zendesk is a capable help desk solution. It has most of the features that a small, medium, or even large organization will need, as long as tickets and the way they get raised are what your organization primarily needs."}, {"url": "https://www.getapp.com/customer-service-support-software/a/zendesk/", "passage_text": "Zendesk is the proven cloud-based customer service software solution that is the fastest way to enable great customer service in companies of all sizes and industries. Zendesk is so easy to use, it is loved by support teams and their customers worldwide. Zendesk is a great SaaS helpdesk, quick to deploy, easy to maintain and easy to use. Verified Reviewer 29th of September 14:51 VMUG Leader (Information Technology and Services company, 1-10 employees)"}, {"url": "http://www.itqlick.com/zendesk", "passage_text": "Zendesk is the tool for any company, big or small, that has to deal with a certain number of customers on daily basis and needs an evolving platform to facilitate this process. The software can be used in retail services, media services, government agencies, software companies, finance and even education. The company Zendesk inc. was founded by Morten Primdahl, Alexander Aghassipour and Mikkel Svane. By 2008 it had received $500,000 in funding. In 2009 a second series of funding came in the amount of $6 million allowing the company to move to San Francisco and establishing its headquarters."}, {"url": "http://www.itqlick.com/zendesk", "passage_text": "Zendesk is an SaaS Suite developed to be a platform for customer service support, help desk ticketing and issue tracking. It is the creation of a company of the same name founded in 2007. The company Zendesk inc. was founded by Morten Primdahl, Alexander Aghassipour and Mikkel Svane. By 2008 it had received $500,000 in funding. In 2009 a second series of funding came in the amount of $6 million allowing the company to move to San Francisco and establishing its headquarters."}, {"url": "https://www.zendesk.com/about/", "passage_text": "In the beginning. Zendesk was started in a Copenhagen loft by three friends who used an old kitchen door as a desk. They wanted to bring a bit of zen to the chaotic world of customer support. And they wanted to do it with software that was nice to look at and easy to use. Zendesk moved its San Francisco headquarters to the Tenderloin in 2011, a famous and deeply historic neighborhood in the heart of the city that was unfortunately neglected for decades."}, {"url": "https://www.zendesk.com/about/", "passage_text": "Zendesk is a customer service platform. It’s designed for companies that want to create customer relationships that are more meaningful, personal, and productive. We start by helping companies provide great support and then mature with self-service and proactive engagement. Zendesk moved its San Francisco headquarters to the Tenderloin in 2011, a famous and deeply historic neighborhood in the heart of the city that was unfortunately neglected for decades."}, {"url": "http://www.itqlick.com/zendesk", "passage_text": "The reason why you may want to use Zendesk is because you may be looking for a faster and better way to interact with your customers. You may also want your company to be able to interact with your customers using any communication channel, be it through social media, chat or email. The company Zendesk inc. was founded by Morten Primdahl, Alexander Aghassipour and Mikkel Svane. By 2008 it had received $500,000 in funding. In 2009 a second series of funding came in the amount of $6 million allowing the company to move to San Francisco and establishing its headquarters."}, {"url": "https://en.wikipedia.org/wiki/Zendesk", "passage_text": "Zendesk, Inc. is a software development company based in San Francisco, California. The company provides a cloud-based customer service platform, also called Zendesk, that includes ticketing, self-service options, and customer support features. Founded in 2007, the company now employs 1,000 people and serves 60,000 paid customers in 150 countries and territories. In 2012, Zendesk raised $60 million in a combination of $45 million in equity and a $15 million credit facility, bringing the total investment to $86 million. Zendesk became a public company in May 2014 traded on the New York Stock Exchange."}, {"url": "https://www.getapp.com/customer-service-support-software/a/zendesk/", "passage_text": "Zendesk is suitable for any company that wants to improve its customer services no matter the size or industry sector. Zendesk is a great SaaS helpdesk, quick to deploy, easy to maintain and easy to use. Verified Reviewer 29th of September 14:51 VMUG Leader (Information Technology and Services company, 1-10 employees)"}]