[{"url": "https://powerstudy.wordpress.com/2011/10/26/idi-amin/", "passage_text": "Idi Amin Dada was a military leader turned president of Uganda, who was in power from 1971 to 1979. Amin was a very charismatic but ruthless leader. His style of ruling was brutal, and ran the country economically poorly."}, {"url": "http://africanhistory.about.com/od/biography/a/bio_amin_2.htm", "passage_text": "On 16 August 2003 Idi Amin Dada, the 'Butcher of Uganda', died in Jeddah, Saudi Arabia. The cause of death was reported to be 'multiple organ failure'. Although the Ugandan government announced that his body could be buried in Uganda, he was quickly buried in"}, {"url": "http://www.britannica.com/biography/Idi-Amin", "passage_text": "Idi Amin, in full Idi Amin Dada Oumee (born 1924/25, Koboko, Uganda—died August 16, 2003, Jiddah, Saudi Arabia), military officer and president (1971–79) of Uganda whose regime was noted for the sheer scale of its brutality."}, {"url": "http://www.biography.com/people/idi-amin-9183487#!", "passage_text": "Synopsis. Idi Amin was a Ugandan president born circa 1925 in Kokobo, West Nile Province, Uganda. He rose within the military from the 1940s through 1970. Amin overthrew the current leader in 1971 and declared himself president, and he remained in power from 1971-1979."}, {"url": "http://africanhistory.about.com/od/biography/a/bio_amin.htm", "passage_text": "Idi Amin Dada, who became known as the 'Butcher of Uganda' for his brutal, despotic rule whilst president of Uganda in the 1970s, is possibly the most notorious of all Africa's post-independence dictators. Amin seized power in a military coup in 1971 and ruled over Uganda for 8 years."}, {"url": "http://www.biography.com/people/idi-amin-9183487#!", "passage_text": "Death. On August 16, 2003, Idi Amin died in Jeddah, Saudi Arabia. The cause of death was reported to be multiple organ failure. Although the Ugandan government announced that his body could be buried in Uganda, he was quickly buried in"}, {"url": "http://hosbeg.com/idi-amin-died/", "passage_text": "Idi Amin was a former Ugandan dictator who died on 16 August 2003 at the King Faisal Specialist Hospital in Jeddah, Saudi Arabia. Amin’s cause of death was multiple kidney failure. Despite all of his atrocities, Amin was not killed by anyone but rather died at the age of 78 from natural causes."}, {"url": "http://www.answers.com/Q/How_did_Idi_Amin_die", "passage_text": "Died August 2003. Idi Amin Dada, who became known as the … 'Butcher of Uganda' for his brutal, despotic rule whilst president of Uganda in the 1970s, is possibly the most notorious of all Africa's post-independence dictators. Amin seized power in a military coup in 1971 and ruled over Uganda for 8 years."}, {"url": "http://www.theguardian.com/news/2003/aug/18/guardianobituaries", "passage_text": "Idi Amin, who has died at an age thought to be 78, was one of the most brutal military dictators to wield power in post-independence Africa. While chief of staff of the Ugandan army, under Dr Milton Obote's civilian government, he seized power in 1971."}]