[{"url": "http://www.stylecraze.com/articles/benefits-of-prune-juice-for-skin-hair-and-health/", "passage_text": "Prune Juice Benefits for Skin: Prune juice is healthy for the overall well being of a person. It is also very good for the skin as it is a natural fibre-packed fruit juice with the goodness of vitamins & minerals and is free from any harmful ingredients. Here are a few reasons how prune juice is good for your skin:"}, {"url": "http://healthyeating.sfgate.com/small-glass-prune-juice-good-you-2469.html", "passage_text": "Prune juice is made from pulverized prunes steeped in water. Prunes, also known as dried plums, are pulverized and dissolved in hot water to make prune juice. The prune itself is an excellent source of easy-to-digest carbohydrates, soluble fiber, potassium, iron and antioxidant compounds."}, {"url": "http://www.wisegeek.org/what-are-the-health-benefits-of-prune-juice.htm", "passage_text": "Prune juice is beneficial to every area of the body because it contains antioxidants that fight cell-damaging free-radicals. It is good for the heart, potentially reducing LDL cholesterol, lowering blood pressure and contributing to an even, regular heartbeat."}, {"url": "http://www.sunsweet.com/products/prune-juice/", "passage_text": "Sunsweet ® Amaz!n™ Prune Juice. Each delicious serving of Sunsweet Amaz!n Prune Juice is a natural source of fiber and provides 5 essential vitamins and minerals to help balance and maintain good digestive health to help you feel your best. Available in 32oz, 48oz & 64oz bottles and 6-pack of 5.5oz cans."}, {"url": "http://www.webmd.com/diet/ss/slideshow-juice-wars", "passage_text": "Drinking your veggies is convenient and good for you. The lycopene in tomato juice may help lower the risk of prostate cancer. Beet juice may help curb blood pressure. Pulpy vegetable juice has some fiber (but not as much as raw vegetables); and fiber cuts hunger."}, {"url": "http://healthyeating.sfgate.com/small-glass-prune-juice-good-you-2469.html", "passage_text": "This amount of prune juice also supplies about 10 percent of the daily value for fiber, over 20 percent of the daily value for potassium, nearly 17 percent of the daily value for iron and roughly 17 percent and 11 percent of the daily values for vitamins C and K, respectively."}]