[{"url": "http://www.martindalesnutrition.com/wp-content/uploads/2014/08/INCI_Dict2014.pdf", "passage_text": "6 INCI DICTIONARY OF NATURAL INGREDIENTS Ingredients are listed by their INCI names, followed by their com-mon names. To find an ingredient by its common name, please refer to the Index of Common Names on pg 47.ABIES SIBIRICA — Fir Oil, Siberian Pine Needle Oil. 10 Ingredients listed by their INCI names, followed by common names ASCORBYL PALMATE, ASCORBYL PALMITATE — An oil-soluble form of vitamin C. (See also Ascorbic acid.)ASTER TRIPOLIUM — Sea Aster. Soothing agent clinically proven to reduce redness and sensitivity on the skin when used twice daily for 28 days."}, {"url": "http://www.fda.gov/Cosmetics/Labeling/IngredientNames/ucm2005218.htm", "passage_text": "If a cosmetic product is marketed on a retail basis to consumers—such as in stores, online, or “person to person”--the ingredients must be listed by their common or usual names, generally in descending order of predominance. FDA requires this information under the Fair Packaging and Labeling Act (FPLA). Identifying ingredients on cosmetic labels can be a challenge. Here is information on requirements for ingredient nomenclature, labeling cosmetic products for the international market, and links to more resources."}, {"url": "http://www.cirs-reach.com/Cosmetic_Inventory/International_Nomenclature_of_Cosmetic_Ingredients_INCI.html", "passage_text": "Application of INCI Name. Companies can apply for an INCI name here. There is a $200.00 charge per trade name. It takes 3-6 months from the date an INCI application is submitted to be assigned an INCI name. It shall be noted that the listing of an ingredient in INCI does mean the ingredient has been assessed. Assessment is carried out by Cosmetic Ingredient Review (CIR) independently. "}, {"url": "http://www.personalcarecouncil.org/sites/default/files/INCIFAQs.pdf", "passage_text": "A: No. INCI names do not imply that an ingredient has been approved for use, or that an ingredient is. safe. INCI names provide the systematic name for the identification of a cosmetic ingredient. Q: What is the INCI number? A: The INCI number refers to the monograph ID number that is associated with the INCI name. The monograph ID number is a place holder in the data base and is not intended to be included with the INCI name for product labeling. This number is not the same as a CAS number"}, {"url": "http://www.fda.gov/Cosmetics/Labeling/IngredientNames/ucm075032.htm", "passage_text": "The INCI Name, FD&C Yellow No. 6, is the name assigned to batches of this colorant that have been certified by the U.S. FDA. The INCI Name for this colorant that has not been certified by the U.S. FDA is Sunset Yellow. ... On May 24, 1995, CTFA revised its proposal regarding labeling names for plant extracts. To achieve an orderly conversion to the new labeling name, CTFA proposes that a transition period be established to educate the public to the new"}, {"url": "http://www.lotioncrafter.com/lotioncrafter-premium-ingredients-inci.html", "passage_text": "In the United States, while up for review by the FDA, it is still permissible to use the 2nd Edition CTFA Ingredient Dictionary INCI names for many ingredients, as technically speaking, it is the only one that's ever been approved by the FDA. "}, {"url": "http://www.fda.gov/Cosmetics/Labeling/IngredientNames/ucm075032.htm", "passage_text": "These names, which are now designated as International Nomenclature Cosmetic Ingredient (INCI) names, will be used by EU members to identify ingredients in the EU Inventory of cosmetic ingredients and are expected to be the basis for ingredient labeling on products that will be required in the EU in 1997. On May 24, 1995, CTFA revised its proposal regarding labeling names for plant extracts. To achieve an orderly conversion to the new labeling name, CTFA proposes that a transition period be established to educate the public to the new"}, {"url": "http://www.personalcarecouncil.org/sites/default/files/INCIFAQs.pdf", "passage_text": "Q: If my product has an INCI name, does that mean it has been approved? A: No. INCI names do not imply that an ingredient has been approved for use, or that an ingredient is safe. INCI names provide the systematic name for the identification of a cosmetic ingredient. For further information, see Regulatory Information. Q: What is the INCI number? A: The INCI number refers to the monograph ID number that is associated with the INCI name. The monograph ID number is a place holder in the data base and is not intended to be included with the INCI name for product labeling. This number is not the same as a CAS number"}, {"url": "https://en.wikipedia.org/wiki/International_Nomenclature_of_Cosmetic_Ingredients", "passage_text": "From Wikipedia, the free encyclopedia. The International Nomenclature of Cosmetic Ingredients, abbreviated INCI, is a system of names for waxes, oils, pigments, chemicals, and other ingredients of soaps, cosmetics, and the like, based on scientific names and other Latin and English words. The cosmetic regulation laws are enforceable for important consumer safety. For example, the ingredients are listed on the ingredient declaration for the purchaser to reduce the risk of an allergic reaction to an ingredient the user has had an allergy to before."}]