[{"url": "http://sameerbloggs.blogspot.com/2009/02/what-is-multi-city-cheque.html", "passage_text": "What is a Multi City Cheque. Multi City Cheque or MCC is a facility wherein the customer can issue cheques drawn at the base branch and payable at any branch at remote centre. These cheques will be treated as local cheques at the remote branch. There will be no collection charges and the credit will be given on the same day, as applicable to local cheques. Even if the cheque is dropped at any other bank other than the base bank, there will not be any collection charges. For example, if you are paid a Multi city cheque by an account holder at a SBI branch in Delhi and you drop the same at any bank in Mumbai where you hold an account, then there will not be any collection charges. Collection charge in SBI."}, {"url": "http://www.lawyerment.com/library/kb/Banking_and_Finance/Banking/Current_Account/1378.htm", "passage_text": "Local and outstation cheques however, need to go through the clearing process and the time required for your cheque to be cleared would depend on the location of the branches. Generally, local cheques would be cleared within 2-3 working days. The clearing period for outstation cheques may take 3-8 working days. However, you are advised to check with your bank as to the actual date the funds will be available. Related Current Account Issues. When you deposit a cheque into your account, your bank which is the collecting bank will send it to specific clearing centres to be sorted and dispatched to the drawee bank for payment."}, {"url": "http://definitions.uslegal.com/l/local-check/", "passage_text": "Local Check Law & Legal Definition. A local check is a check payable by, at, or through a bank in the same check processing region. It is the location of the branch of the depository bank. The depository bank is the bank into which the check is deposited. An example is a credit union share draft payable through a commercial bank. Usually the check routing symbol on the check states whether the check is paid through a local bank"}, {"url": "https://en.wikipedia.org/wiki/Cheque", "passage_text": "Technically, a cheque is a negotiable instrument instructing a financial institution to pay a specific amount of a specific currency from a specified transactional account held in the drawer's name with that institution. Both the drawer and payee may be natural persons or legal entities. A payee that accepts a cheque will typically deposit it in an account at the payee's bank, and have the bank process the cheque. In some cases, the payee will take the cheque to a branch of the drawee bank, and cash the cheque there."}, {"url": "http://readanddigest.com/what-are-the-different-types-of-cheques/", "passage_text": "A crossed cheque or an account payee cheque: It is written in the same as that of bearer cheque but issuer specifically specifies it as account payee on the left hand top corner or simply crosses it twice with two parallel lines on the right hand top corner. This type of issuing a cheque is also called bearer type cheque also known as open cheque or uncrossed cheque. The cheque is negotiable from the date of issue to three months. The issued cheque turns stale after the completion of three months. It has to be revalidated before presenting to the bank."}, {"url": "https://en.wikipedia.org/wiki/Cheque", "passage_text": "A cheque (or check in American English) is a document that orders a bank to pay a specific amount of money from a person's account to the person in whose name the cheque has been issued. A payee that accepts a cheque will typically deposit it in an account at the payee's bank, and have the bank process the cheque. In some cases, the payee will take the cheque to a branch of the drawee bank, and cash the cheque there."}, {"url": "http://readanddigest.com/what-are-the-different-types-of-cheques/", "passage_text": "Local Cheque: A local cheque is a type of cheque which is valid in the given city and a given branch in which the issuer has an account and to which it is connected. The producer of the cheque in whose name it is issued can directly go to the designated bank and receive the money in the physical form. This type of issuing a cheque is also called bearer type cheque also known as open cheque or uncrossed cheque. The cheque is negotiable from the date of issue to three months. The issued cheque turns stale after the completion of three months. It has to be revalidated before presenting to the bank."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_local_check_and_on_us_check", "passage_text": "If this is in reference to background checks, then a local check would be a check with the local police and a US national check would be a check with national sources (e.g. FBI, etc.). "}, {"url": "http://articles.economictimes.indiatimes.com/2009-06-03/news/28482888_1_outstation-cheques-cheque-clearing-local-cheques", "passage_text": "MUMBAI: Banks will now clear local cheques deposited with them on the same day or, at most, early next day. A spate of consumer complaints and consumer court directions have forced the central bank to roll back deregulation of cheque clearances by banks. "}]