[{"url": "http://www.aviationmaintenance.edu/blog/aircraft-mechanic/much-aircraft-mechanic-make/", "passage_text": "According to the Bureau of Labor Statistics – Occupational and Employment Wages Webpage, Aircraft Mechanics median wage was $55,210.00 in May 2012. The top 10% of Aircraft Mechanics earned more than $76,660.00 and the bottom 10% earned less than $35,190.00. For more information about a career in the aircraft mechanic field, or to speak with an admissions representative and apply for aviation career training, contact the Aviation Institute of Maintenance today by visiting our Aircraft Mechanic School Programs Webpage."}, {"url": "http://www.ehow.com/about_7586945_much-would-make-airplane-mechanic.html", "passage_text": "An aircraft mechanic typically earns an hourly wage ranging from $15 as an entry-level mechanic to $36 an hour as a senior mechanic for a major airline. Mechanics that work on jet airliners for a major airline and mechanics who have attended an aviation maintenance school earn higher starting wages. Typical advancement includes maintenance management or aircraft inspector. Airplane inspectors earn up to $70,000 per year and maintenance managers earn up to $85,000 per year."}, {"url": "http://www.answers.com/Q/How_much_money_does_an_aircraft_mechanic_earn", "passage_text": "Marine Mechanics generally start out making under $15.00 per hour, depending on experience, training, and location. With experience and certification, a mechanic can e … xpect to make $17-30 per hour at a dealership, depending on location. Areas with a high cost of living will obviously pay higher. "}, {"url": "http://www.aviationmaintenance.edu/blog/aircraft-mechanic/much-aircraft-mechanic-make/", "passage_text": "How much does a aircraft mechanic make? In order to answer this question, we have to look at a few contributing aspects. Education level, experience, industry, type of work you perform, specialization and geographic location all play a role in what you can expect to make as a Aircraft Mechanic. For more information about a career in the aircraft mechanic field, or to speak with an admissions representative and apply for aviation career training, contact the Aviation Institute of Maintenance today by visiting our Aircraft Mechanic School Programs Webpage."}, {"url": "http://www.ellejet.com/blog/2013/04/25/how-much-does-a-private-jet-aircraft-mechanic-make/", "passage_text": "SENIORITY. The average salary that jet aircraft mechanics make in the United States is between $65,000 and $85,000 per year; however private jet mechanics tend to be at the higher end of this range and can even well over $100,000 per year. This job generally requires a high school diploma or equivalent, and most aircraft mechanics complete an apprenticeship and/or specialized formal training. New jet aircraft mechanics usually make around $12-16 per hour, however this quickly increases with experience up to $18-20 per hour plus a per diem. Fully trained aircraft mechanic with years of experience receive an average of $25 per hour. SENIORITY"}, {"url": "http://study.com/how_much_does_a_mechanic_make.html", "passage_text": "Aircraft mechanics earned a median wage of $26.91 hourly, or $55,980 annually, as reported by the BLS in May 2013. Aircraft mechanics working for semiconductor and other electronic component manufacturing companies earned the highest among all aircraft mechanics, with an average yearly salary of $89,460. The BLS noted that industrial machinery mechanics received a median annual wage of $47,910 as of 2013, or $23.03 per hour. The BLS cited that, as of May 2013, bus and truck mechanics and diesel engine specialists received a median annual salary of $42,730, or $20.54 per hour. The middle half of bus and truck mechanics earned between $16.34 and $25.78 hourly."}, {"url": "http://work.chron.com/much-money-aircraft-mechanics-make-3782.html", "passage_text": "The Bureau of Labor Statistics says that aircraft mechanics working in scheduled air transportation made $57,070 a year on average, workers providing support activities for air transportation earned $48,400, and workers employed in nonscheduled air transportation earned $55,150. Top States. Data provide by the Bureau of Labor Statistics shows that Texas was the largest employer of aircraft mechanics in May 2011, with an average $52,420 yearly salary. Workers in Tennessee ranked first in terms of annual income, making $66,470 on average, followed by Connecticut at $63,420 and Alaska at $62,500."}, {"url": "https://www.recruiter.com/salaries/aircraft-mechanics-and-service-technicians-salary/", "passage_text": "An Aircraft Mechanic or Service Technician can get an average wage on a scale from 40000 to 60000 based on level of experience. Aircraft Mechanics and Service Technicians can get a compensation of Fifty Two Thousand Nine Hundred dollars per year. Aircraft Mechanics and Service Technicians have the most lucrative average salary level in Tennessee, where they get an average salary rate of near $69980."}, {"url": "http://work.chron.com/much-money-aircraft-mechanics-make-3782.html", "passage_text": "The Bureau of Labor Statistics reports that aircraft mechanics earned an average annual income of $54,500 in May 2011. Workers in the occupation made $26.20 an hour on average. The top tenth of workers in terms of annual income made more than $74,210 and the bottom tenth earned less than $34,630. Top States. Data provide by the Bureau of Labor Statistics shows that Texas was the largest employer of aircraft mechanics in May 2011, with an average $52,420 yearly salary. Workers in Tennessee ranked first in terms of annual income, making $66,470 on average, followed by Connecticut at $63,420 and Alaska at $62,500."}]