[{"url": "http://www.youtube.com/watch?v=0rKrPC32xbY", "passage_text": "http://www.recovering-deleted-files.net. If you need to recover your deleted photos then look no further. Follow along with this tutorial and you will be able to perform a photo recovery in minutes. The process is so simple even a computer newbie can figure it out. But don't wait until it's too late and you lose your data forever."}, {"url": "http://www.pcadvisor.co.uk/how-to/windows/how-to-recover-deleted-files-and-photos-3281195/", "passage_text": "Here's how to recover deleted files in Windows after you've emptied your PC's Recycle bin. We've all done it - 'cleaned up' your PC's desktop, emptied the Recycle bin, sunk your heart to the bottom of your boots. ﻿. Share. Here's how to recover deleted files in Windows after you've emptied your PC's Recycle bin. We've all done it - 'cleaned up' your PC's desktop, emptied the Recycle bin, sunk your heart to the bottom of your boots. Or maybe you've hit Windows/shift/Delete, which bypasses the"}, {"url": "http://www.easeus.com/datarecoverywizard/recover-lost-photo-images.htm", "passage_text": "Next  button to start your picture recovery job. Step 2. Select the disk where you lost your data and click  Scan  button, the software will quickly scan the selected disk to find all your lost pictures. If you lost your partition, select  Lost Disk Drives  and  Scan  to continue the recovery process. Step 3."}, {"url": "http://www.cnet.com/how-to/how-to-recover-deleted-photos-from-a-memory-card/", "passage_text": "Step 6: For Recuva, select all the images you want to restore, and click the Recover button. Choose a place you want to restore the files to. You will want to choose somewhere you can access easily, like the desktop or your pictures folder. It's best not to save them back to the memory card. You will need a card reader, a computer, the memory card in question and nerves of steel. Step 1: Don't do anything to your memory card once you realise photos have been deleted. This means, don't take any more photos on the card and remove it from the camera immediately. Step 2: Select a recovery suite."}, {"url": "http://www.wikihow.com/Recover-Deleted-Pictures", "passage_text": "If you can't recover deleted pictures on your computer through the Recycle Bin, you can try restoring previously saved versions of the files. To restore deleted pictures on a memory card, however, you'll need to download a photo recovery program. Get started with Step 1 below. 4. Move the deleted picture files or folder containing them to a new location on your computer, by clicking and dragging them to that location in the access menu on the left side of the Computer window. Ideal locations for the new save might be a new folder, the desktop or an external hard drive."}, {"url": "http://www.recoverpictures.net/computer.html", "passage_text": "Figure 2: Recover Deleted Photos. Step C: Later software will show the list of available drives to recover deleted pictures as illustrated in Figure 3. Select the drive from which you want to recover pictures and click on Next to proceed further. Figure 3: Logical Drives."}, {"url": "http://www.online-tech-tips.com/computer-tips/how-to-recover-deleted-corrupted-or-formatted-pictures-for-free/", "passage_text": "You can click on the files at the top and it will show you a preview of the image, if it’s possible to recover. Now to recover the photos, go ahead and use the SHIFT key to select all the photos in the top box and then click on the Recover button, which is the small little orange trash icon. "}, {"url": "http://www.easeus.com/resource/retrieve-deleted-photos-from-formatted-hard-drive.htm", "passage_text": "Here are the steps to retrieve deleted photos from formatted hard drive as I performed. Step 1. Launch EaseUS Data Recovery Wizard. Select  Graphics  and click . Next  button to start your picture recovery job. Step 2. Select the disk where you lost your data and click  Scan  button, the software will quickly scan the selected disk to find all your lost pictures. If you lost your partition, select  Lost Disk Drives  and  Scan  to continue the recovery process. Step 3. "}, {"url": "http://www.wikihow.com/Recover-Deleted-Pictures", "passage_text": "Access a USB port to connect your camera to your computer and recover deleted pictures on your memory card. Some computers have card readers, allowing you to insert the memory card directly into the computer for this process. 4. Move the deleted picture files or folder containing them to a new location on your computer, by clicking and dragging them to that location in the access menu on the left side of the Computer window. Ideal locations for the new save might be a new folder, the desktop or an external hard drive."}, {"url": "http://www.recoverpictures.net/computer.html", "passage_text": "If you have deleted precious picture files like this, then just make use of Recover Pictures software which also helps you to retrieve accidentally deleted RAW images from DSLR and also supports recovery of other picture formats like JPG, PNG, JPEG, SR2, ARW, NEF and many more with utmost ease. Step C: Later software will show the list of available drives to recover deleted pictures as illustrated in Figure 3. Select the drive from which you want to recover pictures and click on Next to proceed further. Figure 3: Logical Drives."}]