[{"url": "http://www.cancer.net/navigating-cancer-care/diagnosing-cancer/tests-and-procedures/colonoscopy", "passage_text": "After the procedure. You will stay at the facility where you have the colonoscopy for up to two hours after the procedure while the effects of the sedative wear off. A friend or family member may then drive you home. You can expect to resume your normal activities the day after your colonoscopy. "}, {"url": "http://www.howlongdoes.com/health/how-long-does-a-colonoscopy-take/", "passage_text": "How long does a colonoscopy take depends largely on the type of procedure the doctor will perform. With camera on top a flexible tube is inserted to capture rectum and colon from inside is the procedure of test. Its abilities extend to trim off tissues and polyps samples. How long does a colonoscopy take is usually around 30 minutes, but the span may extend if polyp is discovered and removed. Before the start of operation the patient is provided with painkilling drug (Normally via vein) to make the patient comfortable and drowsy in-between the operation"}, {"url": "http://www.surgeryencyclopedia.com/Ce-Fi/Colonoscopy.html", "passage_text": "The procedure may take anywhere from 30 minutes to two hours depending on how easy it is to advance the scope through the colon. Colonoscopy can be a long and uncomfortable procedure, and the bowel-cleansing preparation may be tiring and can produce diarrhea and cramping. "}, {"url": "http://www.howlongdoes.com/health/how-long-does-a-colonoscopy-take/", "passage_text": "How long does a colonoscopy take may vary if tumor, gigantic polyp or something other irregular is witnessed! A bio can be examined for that purpose. A tiny bit of tissue is extracted outside with the help of colonoscope. With camera on top a flexible tube is inserted to capture rectum and colon from inside is the procedure of test. Its abilities extend to trim off tissues and polyps samples. How long does a colonoscopy take is usually around 30 minutes, but the span may extend if polyp is discovered and removed. Before the start of operation the patient is provided with painkilling drug (Normally via vein) to make the patient comfortable and drowsy in-between the operation"}, {"url": "http://www.webmd.com/colorectal-cancer/guide/colonoscopy-what-you-need-know", "passage_text": "The procedure is performed by a doctor experienced in colonoscopy and lasts approximately 30 to 60 minutes. Medications will be put into your vein to make you feel relaxed and drowsy. You will be asked to lie on your left side on the examining table. You will need to try to hold the enema solution for at least five minutes before releasing it. Make sure you arrange for a driver to bring you home after the colonoscopy. Because you receive sedating medication during the procedure, it is unsafe for you to drive or operate machinery for eight hours after the procedure."}, {"url": "http://www.medicinenet.com/colonoscopy/article.htm", "passage_text": "Colonoscopy is a procedure that enables an examiner (usually a gastroenterologist) to evaluate the inside of the colon (large intestine or large bowel). The colonoscope is a four foot long, flexible tube about the thickness of a finger with a camera and a source of light at its tip. "}, {"url": "http://www.mayoclinic.org/tests-procedures/colonoscopy/basics/results/PRC-20013624", "passage_text": "Depending on the size and number of polyps, you may need to follow a more rigorous screening schedule in the future. If your doctor finds one or two polyps less than 0.4 inch (1 centimeter) in diameter, a repeat colonoscopy in five to 10 years may be adequate, depending on your other risk factors for colon cancer. A colonoscopy is considered negative if the doctor doesn't find any abnormalities in the colon. If you're at average risk of colon cancer — you have no colon cancer risk factors other than age — your doctor may recommend waiting 10 years and then repeating the exam if your colon preparation was adequate."}, {"url": "http://www.webmd.com/colorectal-cancer/guide/colonoscopy-what-you-need-know", "passage_text": "During a colonoscopy, the doctor uses a colonoscope, a long, flexible, tubular instrument about 1/2 inch in diameter that transmits an image of the lining of the colon so the doctor can examine it for any abnormalities. The colonoscope is inserted through the rectum and advanced to the other end of the large intestine. You will need to try to hold the enema solution for at least five minutes before releasing it. Make sure you arrange for a driver to bring you home after the colonoscopy. Because you receive sedating medication during the procedure, it is unsafe for you to drive or operate machinery for eight hours after the procedure."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20070620085353AATV6kF", "passage_text": "I do not believe that a colonoscopy is an operation! Had one done about 4 years back and it did not take long but you are in recovery for a while because they put you under to do the scope. MyKidsMom · 8 years ago. Thumbs up. "}]