[{"url": "http://www.blueplanetbiomes.org/deciduous_forest.htm", "passage_text": "Northeast Asian Deciduous Forest. Deciduous forests can be found in the eastern half of North America, and the middle of Europe. There are many deciduous forests in Asia. Some of the major areas that they are in are southwest Russia, Japan, and eastern China."}, {"url": "http://biomessecond08.wikispaces.com/Temprate+Deciduous+Forest+Facts", "passage_text": "The tree lichen lives on trees in the temperate deciduous forest. The paramecium is found in oxygenated aquatic environments, feeding near vegatative matter. Paramecium's scientific name is Parameciidae parameciidae, along with lichen's name; Flavoparmelia rutidota."}, {"url": "http://www.blueplanetbiomes.org/deciduous_plant_page.htm", "passage_text": "The American Beech tree grows in the southern and eastern parts of the United States. It grows in deciduous forests all over Maine and northern Massachusetts. It grows best in deep, rich, moist, well-drained soils. The American beech is a tall and wide tree."}, {"url": "http://biomessecond10.wikispaces.com/Temperate+Deciduous+Forest+Facts", "passage_text": "Lyme Disease Bacteria, or scientifically named Borrelia burgdorferi, is located in the temperate deciduous forests of the United States of America, and Switzerland. It is found in animals such as deer. It spreads when you get bit by something that has it. Lyme Disease Bacteria is shaped like spirrila."}, {"url": "http://www.blueplanetbiomes.org/deciduous_forest.htm", "passage_text": "Plants Animals Climate Northeast Asian Deciduous Forest Deciduous forests can be found in the eastern half of North America, and the middle of Europe. There are many deciduous forests in Asia. Some of the major areas that they are in are southwest Russia, Japan, and eastern China."}, {"url": "http://biomessecond08.wikispaces.com/Temprate+Deciduous+Forest+Facts", "passage_text": "Bacillus subtilis is another monera found in the temperate deciduous forest. Here are some photos of these monera. Kingdom Fungi FUNGI: Any of numerous eukaryotic organisms (organisms with a nucleus and mitochondria) of the kingdom Fungi, which lack chlorophyll and vascular tissue."}, {"url": "http://biomesfirst11.wikispaces.com/Temperate+Deciduous+Forest+Organisms", "passage_text": "Genus-Tuckneraria. species-sikkimensis. Tuckneraria sikkimensis live in the Asian temperate deciduous forests. They are lichenized fungi (there are many other types of lichenized fungi as well, this is one of them) however have no common name."}, {"url": "http://biomessecond10.wikispaces.com/Temperate+Deciduous+Forest+Facts", "passage_text": "Staghorn algae or Compsogon sp, is located in the eastern North American temperate deciduous forest. You can find it in fresh water marshes, near small bodies of water and on the shore of bodies of water. Bird's Nest Fungi is part of Kingdom Fungi and the Phylum is an Ascomycota."}]