[{"url": "https://en.wikipedia.org/wiki/Osteopathy", "passage_text": "For the American Medical practice of osteopathic physicians in the United States, see Osteopathic medicine in the United States. For diseases of the bone, see bone disease and osteology. Osteopathy is a type of alternative medicine that emphasizes the physical manipulation of the body's muscle tissue and bones. Its name derives from Ancient Greek bone (ὀστέον) and disease of (-πάθεια), The term osteopathy was coined by Andrew Taylor Still, MD, DO. Still was a physician and surgeon, Kansas state and territorial legislator, a free state leader, and one of the founders of Baker University, who lived near Baldwin City, Kansas at the time of the American Civil War."}, {"url": "http://www.dremmy.com/faq/", "passage_text": "Cranial Osteopathy was discovered and developed by William G. Sutherland D.O., a student of Dr. A.T. Still. He first palpated subtle movements in the cranium, which he found extended through rhythmic fluid movements in all areas of the body through the “primary respiratory mechanism”. "}, {"url": "http://www.drweil.com/drw/u/ART03223/Cranial-Osteopathy-Craniosacral-Therapy.html", "passage_text": "Cranial osteopathy (also called cranial therapy or craniosacral therapy) is one variety of osteopathic manipulative therapies. The Osteopathic Cranial Academy, an international membership organization, provides training in cranial osteopathy to qualified health care practitioners including doctors of osteopathy (DOs), medical doctors and dentists, and international physicians with post-graduate training in osteopathy."}, {"url": "http://www.nhs.uk/Conditions/Osteopathy/Pages/Introduction.aspx", "passage_text": "Osteopathy is a way of detecting, treating and preventing health problems by moving, stretching and massaging a person's muscles and joints. Osteopathy is based on the principle that the wellbeing of an individual depends on their bones, muscles, ligaments and connective tissue functioning smoothly together. In the UK, osteopathy is a complementary or alternative medicine (CAM) , and is different from conventional western medicine. Although osteopaths may use some conventional medical techniques, the use of osteopathy isn't always based on scientific evidence."}, {"url": "https://en.wikipedia.org/wiki/Osteopathy", "passage_text": "Osteopathic manipulative treatment (OMT in the U.S. or simply osteopathic treatment elsewhere) is the therapeutic application of manually guided forces by a practitioner, intended to improve physiologic function and/or support homeostasis that has been altered by somatic dysfunction. The term osteopathy was coined by Andrew Taylor Still, MD, DO. Still was a physician and surgeon, Kansas state and territorial legislator, a free state leader, and one of the founders of Baker University, who lived near Baldwin City, Kansas at the time of the American Civil War."}, {"url": "http://www.drweil.com/drw/u/ART03223/Cranial-Osteopathy-Craniosacral-Therapy.html", "passage_text": "Practitioners of cranial osteopathy use their hands to gently free up restrictions in the movement of cranial bones and associated soft tissues and to stimulate the flow of the cerebrospinal fluid, which bathes all the surfaces of the brain and the spinal cord. The Osteopathic Cranial Academy, an international membership organization, provides training in cranial osteopathy to qualified health care practitioners including doctors of osteopathy (DOs), medical doctors and dentists, and international physicians with post-graduate training in osteopathy."}, {"url": "http://www.drweil.com/drw/u/ART03223/Cranial-Osteopathy-Craniosacral-Therapy.html", "passage_text": "About five percent of physicians in the United States are doctors of osteopathy (DOs), and fewer than 10 percent of them rely on manipulation as a main method of treatment. However, some medical doctors and dentists have had training in cranial osteopathy. The Osteopathic Cranial Academy, an international membership organization, provides training in cranial osteopathy to qualified health care practitioners including doctors of osteopathy (DOs), medical doctors and dentists, and international physicians with post-graduate training in osteopathy."}, {"url": "http://www.osteohome.com/page16/page30/page30.html", "passage_text": "OCF was developed as an extension to the osteopathic approach. The cranial concept, first put forth by W. G. Sutherland, DO and originally alluded to by A.T. Still, MD, involves the application of Dr. Still's principles of Osteopathy to the head (cranium) and to the tailbone (sacrum). It is based on The Five Components of the Primary Respiratory Mechanism. The cranial osteopath is not preferential to the cranium or the sacrum. Instead he or she includes these areas in an overall evaluation and treatment plan, considering the whole body as one dynamic, integrated unit of function. Today, scientists and many MDs, with the benefit of high tech diagnostic equipment, not only concur that cranial motion exists but that it is central to the function of the body. There are many forms of treatment and therapy that claim to do the same thing as cranial osteopathy, but none can approach it."}, {"url": "http://www.quackwatch.com/04ConsumerEducation/QA/osteo.html", "passage_text": "These numbers strongly suggest that the percentage of osteopathic physicians doing chelation therapy is about four or five times as high as the percentage of medical doctors doing it. Curiously, Ronald A. Esper, DO, of Erie, Pennsylvania, who was AOA's president in 1998, is an ACAM member and does chelation therapy. There are 20 accredited colleges of osteopathic medicine and about 44,000 osteopathic practitioners in the United States [3]. Admission to osteopathic school requires three years of preprofessional college work, but almost all of those enrolled have a baccalaureate or higher degree."}]