[{"url": "http://www.ehow.com/about_7582671_average-salary-pro-soccer-coach.html", "passage_text": "The average salary of head coaches in MLS was only around $250,000 in 2007, according to ESPN Soccernet. A few well-known coaches like Bruce Arena and Ruud Gullit pulled in between $600,000 and $1.2 million per season, but most of the league's coaches earned far less. Other Professional Leagues."}, {"url": "http://www.usatoday.com/story/sports/ncaaf/2012/11/19/college-football-coaches-contracts-analysis-pay-increase/1715435/", "passage_text": "College football coaches continue to see salary explosion. The average annual salary for college football head coaches at major colleges is $1.64 million, up nearly 12% over last season — and more than 70% since 2006."}, {"url": "http://www.usatoday.com/story/sports/ncaaf/2012/11/19/college-football-coaches-contracts-analysis-pay-increase/1715435/", "passage_text": "The average annual salary for head coaches at major colleges (not including four schools that moved up to the Football Bowl Subdivision this season) is $1.64 million, up nearly 12% over last season — and more than 70% since 2006, when USA TODAY Sports began tracking coaches' compensation."}, {"url": "http://www.kaycircle.com/What-is-the-Average-FIFA-Coach-Salary-How-much-does-a-Professional-FIFA-Soccer-Coach-make-per-year", "passage_text": "Have you ever wondered how much a professional soccer coach earns? In fact, the average salary among FIFA soccer coaches is $300,000 per year. While lower ranking soccer coaches earn about $86,000, the top figures in the sport can break $5 million."}, {"url": "http://profootballtalk.nbcsports.com/2013/05/22/eight-nfl-coaches-earn-salaries-topping-6-million/", "passage_text": "Eight NFL coaches earn salaries topping $6 million. Posted by Michael David Smith on May 22, 2013, 7:03 PM EDT. AP. One-fourth of the NFL’s head coaches have salaries of more than $6 million, and coaches in professional football earn incomes that far exceed their counterparts in other pro sports. That’s the word from Forbes, which is out with its latest ranking of the highest-paid coaches in North American professional sports."}, {"url": "http://www.celebritynetworth.com/articles/entertainment-articles/highest-paid-college-football-coaches/", "passage_text": "The ten highest paid college football coaches make more money than 70% of their NFL counterparts. There are only two NFL coaches who make more money than the #1 highest paid college football coach, and that same coach is paid more than bottom four NFL coach's salaries COMBINED."}]