[{"url": "http://info.legalzoom.com/difference-between-individual-dba-24007.html", "passage_text": "An individual may operate an unincorporated business as a sole proprietor either under her own name or an assumed trade name, which is called a DBA or doing business as name. "}, {"url": "https://www.legalzoom.com/knowledge/dba/topic/dba-defined", "passage_text": "Definition of a DBA. Sometimes it makes sense for a company to do business under a different name. To do this, the company has to file what's know as a DBA— an abbreviation for  doing business as.  A DBA is also known as a  fictitious business name ,  trade name , or  assumed name .. O nce your DBA registration is complete, the company can use the secondary name to open bank accounts, write checks, and enter contracts. If you don't file a DBA and just start doing business under a different name you could face penalties and fines, not to mention the possability of lawsuits."}, {"url": "http://www.ehow.com/facts_5968407_dba-subsidiary_.html", "passage_text": "Shares & Saves. Save. A DBA is often a subsidiary of a larger corporation. A DBA, or doing business as, is an assumed name used by a business. A DBA may also be a single entity doing business under a trade new name without changing its articles of incorporation. 1  How to Start a Parent Company. A DBA may be filed by a business or sole proprietor looking to do business under a trade name rather than its incorporated business name or personal name. A DBA may also be used for a subsidiary of a larger company."}, {"url": "http://smallbusiness.chron.com/dbas-versus-subsidiaries-76917.html", "passage_text": "Subsidiaries Are Separate. A subsidiary is a separate company, legally distinct from the parent company but nevertheless controlled by it. Instead of setting up your sit-down restaurant as a DBA, you could create an entirely new company called Elizabeth's Elegant Eats, of which Betty's Burgers is the sole owner. However, a subsidiary offers multiple advantages. You can share ownership of a subsidiary with other companies or individuals, something that's not possible with a DBA, and it is easier to sell or to spin off into a totally independent company. A subsidiary also provides legal protection for the par"}, {"url": "http://www.invention-protection.com/ip/publications/docs/Legal_Name_Trade_Name_Trademark.html", "passage_text": "A trade name can also be referred to as a Fictitious Name or a Doing Business As (DBA). Examples of trade names are the use of the name Kodak by the company whose legal name is Eastman Kodak Company or McDonald s by the company whose legal name is McDonald's Corporation. "}, {"url": "https://en.wikipedia.org/wiki/Doing_business_as", "passage_text": "For trade names of other products and services, see brand name. A trade name, trading name, or business name is a pseudonym used by companies to perform their business under a name that differs from the registered, legal name of the business. "}, {"url": "http://smallbusiness.chron.com/dbas-versus-subsidiaries-76917.html", "passage_text": "DBA Is Just a Name. When your company establishes a DBA, you're not creating a separate company. You're creating a name -- legally referred to as a fictitious name -- under which your company will do business. For example, say you own a fast-food restaurant company called Betty's Burgers. However, a subsidiary offers multiple advantages. You can share ownership of a subsidiary with other companies or individuals, something that's not possible with a DBA, and it is easier to sell or to spin off into a totally independent company. A subsidiary also provides legal protection for the par"}, {"url": "http://info.legalzoom.com/can-llc-file-dba-still-business-under-llc-name-4511.html", "passage_text": "An LLC, or limited liability company, is a legal entity that has its own rights and obligations separate from its owners; conversely, a DBA is not a legal entity, and whoever uses a DBA assumes all of the obligations of the business. "}]