[{"url": "http://www.huffingtonpost.com/2015/03/31/what-can-you-bring-on-plane_n_6886064.html", "passage_text": "Don't bring liquids above 3.4 ounces in your carry-on, leave the fireworks at home, and definitely don't pack your brass knuckles. While there is a long lists of things you shouldn't pack in your luggage, there is also a long list of weird things you actually can bring."}, {"url": "http://www.huffingtonpost.com/2015/03/31/what-can-you-bring-on-plane_n_6886064.html", "passage_text": "You can bring a parachute in your carry-on or checked luggage. Just make sure the rig is separated from other parts of your luggage, and arrive half an hour early in case the TSA wants to ask you some questions. Yep, you can bring your pie or cake through security, though it might require a little additional screening."}, {"url": "http://mentalfloss.com/article/29229/11-things-you-can-take-plane", "passage_text": "11. You can carry needles and syringes on a plane, but you have to have clearly labeled, prescribed medicine to accompany them. For 11-11-11, we'll be posting twenty-four '11 lists' throughout the day. Check back 11 minutes after every hour for the latest installment, or see them all here."}, {"url": "http://www.huffingtonpost.com/2015/03/31/what-can-you-bring-on-plane_n_6886064.html", "passage_text": "Though this might be surprising for non-hunters, bringing antlers on a plane is allowed on almost all American airline carriers. Most usually charge a small fee (anywhere from $20 to $200) and ask that the antlers be cleaned and properly wrapped to the best of your ability."}, {"url": "http://trip.ustia.org/security/articles/1226/what-can-i-carry-on-a-plane/", "passage_text": "Liquids, Gels & Lotions. The Transportation Security Administration has a 3 -1-1 rule you can use to help you remember what you can bring in your carry-on luggage onboard an aircraft. 3 – Liquids, gels, and lotions must be in a container that is 3.4 ounces (100ml) or less (by volume)."}, {"url": "https://www.gov.uk/hand-luggage-restrictions/overview", "passage_text": "Overview. There are restrictions on what items you can take in your hand luggage and hold luggage when boarding a plane in the UK. Airport security staff won’t let anything through that they consider dangerous-even if it’s normally allowed in hand luggage."}, {"url": "http://www.huffingtonpost.com/2015/03/31/what-can-you-bring-on-plane_n_6886064.html", "passage_text": "As long you don't bring circular thread cutters or any cutter with a blade through security, the TSA says you can bring knitting needles on the plane. If you do happen to have thread cutters or needles with blades, just make sure those go in your checked luggage."}, {"url": "https://www.gov.uk/hand-luggage-restrictions/overview", "passage_text": "1. There are restrictions on what items you can take in your hand luggage and hold luggage when boarding a plane in the UK. Airport security staff won’t let anything through that they consider dangerous-even if it’s normally allowed in hand luggage."}, {"url": "http://www.bizjournals.com/sanfrancisco/blog/2011/08/yes-you-can-bring-antlers-on-the.html", "passage_text": "Yes, you can bring antlers on the plane, but it will cost you. Aug 31, 2011, 11:22am PDT Updated Mar 20, 2013, 7:17am PDT."}]