[{"url": "http://www.maine.gov/dps/fmo/sprinklers/issues/gym_sports_arena.html", "passage_text": "It is important in winning a job bid and obtaining a sprinkler permit, to know the required water density. This water density demand depends upon the hazard classification for the area of coverage. The hazard classification depends upon the use of that area as well as the type & volume of fuel loading. This is fully outlined in sections 5.1 to 5.6 of the 2007 NFPA 13 Fire Sprinkler Standard."}, {"url": "http://www.iklimnet.com/hotelfires/fire_sprinkler_hazard.html", "passage_text": "Hazard classification hierarchy. The requirements contained in NFPA 13 are keyed to the hazard classification. Section 2-1 in the 1999 edition of NFPA 13 indicates there are three basic hazard classifications used in the design of sprinkler systems. These three hazard classifications are as follows: • Light Hazard."}, {"url": "http://www.grundfos.com/service-support/encyclopedia-search/fire-hazard-classification.html", "passage_text": "Fire hazard classification. The hazard class (LH, OH, HH) to which sprinkler system is to be designed, will determine the characteristics of the fire sprinkler installation in regards of specification of water supply, number of fire pumps, number of sprinklers etc."}, {"url": "http://www.iklimnet.com/hotelfires/hotelhazard.html", "passage_text": "NFPA 13 Hazard classification. Hazard classification hierarchy. The requirements contained in NFPA 13 are keyed to the hazard classification. Section 2-1 in the 1999 edition of NFPA 13 indicates there are three basic hazard classifications used in the design of sprinkler systems. These three hazard classifications are as follows:"}, {"url": "http://www.grundfos.com/service-support/encyclopedia-search/fire-hazard-classification.html", "passage_text": "The hazard class to which the sprinkler system is to be designed, shall be determined before starting the design work. The classifications Light hazard (LH) Ordinary Hazard (OH) and High Hazard (HH) depends on the occupancy. Buildings can contain one or more of the following hazard classes:"}]