[{"url": "http://www.mass.gov/elders/docs/assisted-consumer-guide.pdf", "passage_text": "The cost of Assisted Living varies greatly. The base monthly fee for an ALR in Massachusetts is typically between $3,000 and $5,000, but can be higher depending upon the level of care needed. "}, {"url": "http://www.assistedlivingfacilities.org/resources/assisted-living-costs/", "passage_text": "Assisted Living Costs by State. The Genworth 2015 Cost of Care Survey is the most comprehensive study of its kind. Genworth Financial surveyed approximatey 15% of assisted living communities. The monthly cost is for a one-bedroom unit in an assisted living facility. "}, {"url": "http://www.seniorhomes.com/p/assisted-living-cost/", "passage_text": "Just as the cost of real estate varies by geographic area, assisted living costs also vary nationwide. In the 2015 Cost of Care Survey conducted by Genworth Financial, assisted living showed an increase of 2.86% compared to the 2014 costs and the national median monthly rate is $3,600. Ranging from $1,000 to $5,000, this fee is non-refundable and covers administrative expenses and the cost of apartment renovations between residents. Other assisted living costs may include fees for private transportation, off-site activities, guest meals and use of a guest apartment within the community."}, {"url": "http://www.assistedlivingfacilities.org/directory/ma/", "passage_text": "Cost of Massachusetts Assisted Living Facilities. According to the 2015 Genworth Financial cost of care survey, the average cost of assisted living in Massachusetts is $5,300 per month. The monthly base rate for Massachusetts assisted living is typically higher when compared to neighboring states. Massachusetts is also more expensive compared to the national average. "}, {"url": "http://www.caregiverlist.com/ShowAnswer.aspx?QuestionId=7", "passage_text": "@Marlene--first read the article. The ave. price of assisted living is around $3000, not $6000. Even for the $6000 in a SKILLED Nursing, you seem to be ignoring the cost of meds, keeping nurses and other caregivers on staff 24-hr/day, and the high acuity of some of the residents. "}, {"url": "http://assistedlivingtoday.com/p/assisted-living/", "passage_text": "Again, costs vary by state, but the average monthly cost for an assisted living center in most states is between $1000 and $3000 per month. Monthly costs in Alaska, Hawaii, Vermont, Washington D.C. and Wyoming are higher than average, sometimes up to $5000 per month. "}, {"url": "http://www.assistedliving.com/massachusetts/", "passage_text": "Cost of Assisted Living in Massachusetts. According to the 2012 A Place for Mom Senior Living Costs Survey, the median monthly cost to live in an assisted living one bedroom apartment in Massachusetts is $4,472. Best Cities for Successful Aging 2012. Boston Massachusetts: Ranked #1 for ages 80+."}, {"url": "http://www.nolo.com/legal-encyclopedia/when-medicaid-pays-assisted-living-home-health-care-massachusetts.html", "passage_text": "Most Massachusetts residents living in assisted living facilities pay their own costs. However, if you have little income and few assets, you may qualify for programs that help pay for some of the costs of assisted living facilities. "}, {"url": "http://www.aplaceformom.com/senior-care-resources/articles/assisted-living-costs", "passage_text": "On the other side of the coin, costs may be higher than average in densely populated areas due to the high costs of real estate and staff salaries. The U.S. states with the most expensive median monthly assisted living costs are: 1  Alaska - $6,000. 2  New Jersey - $5,994. 3  Delaware - $5,533. 4  Connecticut - $5,000. 5  Massachusetts - $4,950"}, {"url": "http://www.howmuchisit.org/senior-assisted-living-cost/", "passage_text": "1 For example, the average assisted senior home in Alabama costs $2,800 while a home in California can cost more than $6,000 on average. 2  According to the American Association of Homes and Services, the average daily cost for a private room in a nursing home was $213 per day. 1 The facilities that the senior assisted living offers can affect the price, and this is the reason why the cost can range anywhere from $70 to $350 per day, while monthly rates can range from $2,100 to $10,000."}]