[{"url": "http://www.cdc.gov/niosh/ershdb/EmergencyResponseCard_29750030.html", "passage_text": "1 APPEARANCE: Hydrogen fluoride is a colorless fuming liquid below 67°F (19.4°C), or a colorless gas. 2  When hydrogen fluoride is combined with water it is known as hydrofluoric acid, a colorless liquid, which in low concentrations is visually indistinguishable from water."}, {"url": "http://www.resistoflex.com/hydrogen.htm", "passage_text": "Anhydrous Hydrogen Fluoride (HF). Depending upon the pressure and temperature where it is being handled, anhydrous fluoride (100% hydrofluoric acid) can be either a colorless, fuming liquid or a colorless gas. Glass and glass-lined piping will deteriorate rapidly if they are used since moist HF attacks all silicates."}, {"url": "http://www.merriam-webster.com/dictionary/anhydrous%20hydrofluoric%20acid", "passage_text": "First Known Use of ANHYDROUS HYDROFLUORIC ACID. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. Note that some information is displayed differently in the Unabridged."}, {"url": "http://www.resistoflex.com/hydrogen.htm", "passage_text": "English Chinese Espanol Español fran Ais Italiano Japanese Korean portugu. S Anhydrous Hydrogen (FLUORIDE). Hf depending upon the pressure and temperature where it is being, handled anhydrous (fluoride100 % hydrofluoric) acid can be either a, colorless fuming liquid or a colorless. gas"}, {"url": "http://www.aristatek.com/Newsletter/MAR10/MAR10ts.pdf", "passage_text": "Physical Properties Table 1 presents physical properties of fluorine, anhydrous hydrogen fluoride, 70% hydrofluoric acid, and 49% hydrofluoric acid. In this table, 70% hydrofluoric acid means a solution of 70% anhydrous hydrogen fluoride and 30% water by weight."}, {"url": "http://www.aristatek.com/Newsletter/MAR10/MAR10ts.pdf", "passage_text": "Production Hydrofluoric acid (chemical formula HF) is a solution of anhydrous hydrogen fluoride in water (typically 25%, 38 or 40%, 49%, 70%, or 79%) and is the form usually shipped by railcar or in smaller tanks, and is the form usually stored at a plant site."}, {"url": "http://essentialchemicalindustry.org/chemicals/hydrogen-fluoride.html", "passage_text": "Hydrogen fluoride is a gas at room temperature. Its solution in water is known as hydrofluoric acid. Anhydrous hydrogen fluoride is the starting material for the production of most fluorine compounds."}]