[{"url": "http://www.passport-renewal.org/passport-renewal-cost.html", "passage_text": "Adult passport renewal for adults ages 16 and over is $110 if you are applying for the passport book alone. If you are applying for the passport card, along with the book, you will need to send in a fee of $140 along with your completed DS-82 form. When applying for the passport card alone, if you already have an active passport book, the cost for this renewal is $40. The application cost is the same. passport; whether, it is a renewal or first time application, you must take the minor to the closest US Embassy, Passport Agency or Acceptance Facility and complete the application process in person."}, {"url": "http://www.ehow.com/facts_5467655_much-u_s_-passport-renewal-fee_.html", "passage_text": "Costs for Adults. Adult passport book and card combined renewals cost $140 as of the time of publication. The passport book only costs $110 for adults, and the card only costs $30. Adults renewing a passport do not have to pay an execution fee, although this is paid at the time of first application. As of the time of publication, minors wishing to renew a passport book and card must pay $95, a minor passport book alone costs $80 and a minor passport card only is $15. In addition, all minors must pay a $25 execution fee designed to cover costs of a passpor"}, {"url": "https://www.gov.uk/passport-fees", "passage_text": "Passport fees. A standard adult first passport or renewal costs £72.50, or £82.25 if you use the Post Office’s Passport Check and Send service. Child passports cost £46, or £55.75 using Check and Send. You can’t get a refund if you cancel your application or you’re not entitled to a passport."}, {"url": "http://www.us-passport-service-guide.com/passport-fees.html", "passage_text": "Routine & Expedited Passport Fees. The passport application fee and the execution fee (new passport only) are the only mandatory fees. There are several optional fees such as the ones for expedited service, overnight delivery and a file search. All the fees are listed below. "}, {"url": "http://www.ehow.com/facts_5467655_much-u_s_-passport-renewal-fee_.html", "passage_text": "Costs for Minors. Passport holders younger than 16 are able to renew at a lower rate than adults. As of the time of publication, minors wishing to renew a passport book and card must pay $95, a minor passport book alone costs $80 and a minor passport card only is $15. In addition, all minors must pay a $25 execution fee designed to cover costs of a passport application."}, {"url": "http://www.ukpassportinusa.com/uk-passport-fees-in-the-usa/", "passage_text": "The cheapest UK passport fees in the US are when you are applying for a child’s passport. The cost of a child’s UK passport in the USA is cheaper than that of an adult because children’s passports are only valid for a period of five years, compared to ten years for an adult’s passport."}, {"url": "http://www.answers.com/Q/How_much_does_it_cost_to_renew_a_U.S._passport", "passage_text": "This will depend. Usually for an adult passport Renewal in standard processing, for passport card its $30, passport book is $110 and for both is $140. Additional fees apply de … pending on what type of application like if you are to apply at a regional agency or by mail for example. Graham Howarth. The costs for passport renewal varies from a passport card to a passport book Passport book and Card - $ 140 Passport Book - $110 Passport Card - $30."}, {"url": "http://www.passport-renewal.org/passport-renewal-cost.html", "passage_text": "The passport renewal process is a simple enough task and requires the completion of a passport renewal form if you are doing it in person and the completion of the DS-82 form if you are doing it through the US postal system. The application cost is the same. passport; whether, it is a renewal or first time application, you must take the minor to the closest US Embassy, Passport Agency or Acceptance Facility and complete the application process in person."}, {"url": "https://www.passports.gov.au/web/Queries/Fees.aspx", "passage_text": "Passport fees are payable when you lodge your application. The fees apply under the provisions of the Australian Passports (Application Fees) Act 2005 and the Australian Passports Determination 2005. They are subject to CPI adjustments on 1 January each year. No GST is payable on passport fees. "}]