[{"url": "https://en.wikipedia.org/wiki/Michigan_Territory", "passage_text": "The area that became Michigan had been British territory, and was ceded to the United States in 1783, although the native peoples of the area had not ceded control to either the British or Americans for most of the territory by 1783. The majority of it was gained by cession, coerced or otherwise. The region that became Michigan was initially unorganized territory, and remained under British control until 1796; that did not stop Governor Arthur St. Clair from establishing a structure of government for the area, if only on paper."}, {"url": "https://en.wikipedia.org/wiki/Michigan_Territory", "passage_text": "The Territory of Michigan was an organized incorporated territory of the United States that existed from June 30, 1805, until January 26, 1837, when the final extent of the territory was admitted to the Union as the State of Michigan. Detroit was the territorial capital. The region that became Michigan was initially unorganized territory, and remained under British control until 1796; that did not stop Governor Arthur St. Clair from establishing a structure of government for the area, if only on paper."}, {"url": "http://www.americaslibrary.gov/jb/reform/jb_reform_arkansas_1.html", "passage_text": "Arkansas became the 25th state of the United States on June 15, 1836. Native Americans, known as bluff dwellers, first lived in Arkansas. They had a thriving culture along the Mississippi and Arkansas rivers as far back as 500 A.D. In the 16th and 17th centuries, both the Spanish and the French explored the region. "}, {"url": "https://en.wikipedia.org/wiki/Illinois_Territory", "passage_text": "Between 1818 and 1833, after Illinois became a state and the unincorporated land from their territories, plus a handful of other townships, were made part of Michigan Territory. In 1818, the southern half of the territory was admitted to the United States as the State of Illinois. The Illinois Territory originally included lands that became the states of Illinois, Wisconsin, the eastern portion of Minnesota, and the western portion of the upper peninsula of Michigan. As Illinois was preparing to become a state, the remaining area of the territory was attached to the"}, {"url": "https://en.wikipedia.org/wiki/Michigan", "passage_text": "The name Michigan is the French form of the Ojibwa word mishigamaa, meaning large water or large lake. Michigan is the tenth most populous of the 50 United States, with the 11th most extensive total area (the largest state by total area east of the Mississippi River). Its capital is Lansing, and the largest city is Detroit. Michigan is the only state to consist of two peninsulas. As a result, it is one of the leading U.S. states for recreational boating. Michigan also has 64,980 inland lakes and ponds. A person in the state is never more than six miles (9.7 km) from a natural water source or more than 85 miles (137 km) from a Great Lakes shoreline."}, {"url": "http://wanttoknowit.com/when-did-wisconsin-become-a-state/", "passage_text": "In 1787 Wisconsin was made part of the newly formed Northwest Territory. Later in 1800, as Ohio prepared to become a state, Wisconsin became a part of Indiana Territory. In 1809 it became part of the newly formed Illinois Territory and in 1818 was included in Michigan Territory. In 1836 Wisconsin Territory was formed. When did Wisconsin Become a State. 09 Sep, 2012 when did 0. Wisconsin is a state located in the Great Lakes and Midwest regions of the United States. It is located to the east of Minnesota, northeast of Iowa and southwest of Michigan. Lake Michigan is to the east of the state and Lake Superior is to the north."}, {"url": "http://www.answers.com/Q/What_order_did_the_states_become_states", "passage_text": "In Uncategorized. The order with which all 50 states became a part of the United States of American begins with Delaware on December 7, 1787. The last state to become part of the US was Hawaii … on August 21, 1959. Answer"}, {"url": "http://www.thingstodo.com/states/MI/history.htm", "passage_text": "Detroit and Fort Mackinac however, did not surrender until 1796. In 1787, Michigan became part of the Northwest Territory. In 1805, the Lower Peninsula and the eastern part of the Upper Peninsula became the Territory of Michigan. Britain recaptured Detroit and Fort Mackinac during the War of 1812, and then returned it at the end of the war two years later."}]