[{"url": "https://www.nlm.nih.gov/medlineplus/ency/article/001982.htm", "passage_text": "Normal body temperature varies by person, age, activity, and time of day. The average normal body temperature is generally accepted as 98.6°F (37°C). Some studies have shown that the normal body temperature can have a wide range, from 97°F (36.1°C) to 99°F (37.2°C). A temperature over 100.4°F (38°C) usually means you have a fever caused by an infection or illness."}, {"url": "http://www.rch.org.au/kidsinfo/fact_sheets/Fever_in_children/", "passage_text": "1 A normal temperature range for a child is usually up to 38°C. 2  Fever is usually a sign of infection in the body. 3  Fever is often caused by a virus and sometimes by bacteria."}, {"url": "http://www.webmd.com/first-aid/body-temperature", "passage_text": "Most people think of a normal body temperature as an oral temperature of 98.6°F (37°C) . This is an average of normal body temperatures. Your temperature may actually be 1°F (0.6°C) or more above or below"}, {"url": "http://www.modernmom.com/2c2371d2-051f-11e2-9d62-404062497d7e.html", "passage_text": "A baby’s temperature is no different. According to the American Academy of Pediatrics, normal body temperature for a health baby ranges between 97 degrees and 100.4 degrees Fahrenheit (36 degrees to 38 degrees Celsius). A rectal temperature reading above this range indicates a fever."}, {"url": "http://www.webmd.com/first-aid/body-temperature", "passage_text": "The body is very good at keeping its temperature within a narrow, safe range in spite of large variations in temperatures outside the body. When you are too hot, the blood vessels in your skin expand (dilate) to carry the excess heat to your skin's surface."}, {"url": "http://www.urmc.rochester.edu/encyclopedia/content.aspx?ContentTypeID=85&ContentID=P00866", "passage_text": "Normal body temperature can range from 97.8 degrees F (or Fahrenheit, equivalent to 36.5 degrees C, or Celsius) to 99 degrees F (37.2 degrees C) for a healthy adult. A person's body temperature can be taken in any of the following ways: Orally."}]