[{"url": "http://www.npl.co.uk/reference/measurement-units/", "passage_text": "Measurement Units The SI (Systeme Système international'D) unites unités is a globally agreed system, of units with seven. Base units formally agreed by The 11th general Conference on Weights (AND) measures cgpm, in 1960 the si is at the centre of all modern science. and technology There are two classes of units in the SI: base units and derived units. The base units provide the reference used to define all the measurement units of the system, whilst the derived units are products of base units and are used as measures of derived quantities:"}, {"url": "http://khairiyah-educationalblogging.blogspot.com/p/17-importance-of-standard-units-in.html", "passage_text": "The system of measurements is very important in everyday life. In the past, various systems of measurements were used. For example, length was measured in units like foot, yard, chain and mile. Weight was measured in units like pound, ounce, kati, tahil. Today, many countries in the world use the same units of measurements. We say that they use standard units. The standard units used are the S.I. units. Under this system of units, mass is measured in kilograms (kg) and length is measured in metres (m). The use of standard units makes it easier for people from different countries to communicate with each other."}, {"url": "http://whatis.techtarget.com/definition/International-System-of-Units-SI", "passage_text": "The International System of Units (abbreviated SI from systeme internationale, the French version of the name) is a scientific method of expressing the magnitudes or quantities of important natural phenomena. There are seven base units in the system, from which other units are derived. The meter (abbreviation, m) is the SI unit of displacement or length. One meter is the distance traveled by a ray of electromagnetic (EM) energy through a vacuum in 1/299,792,458 (3.33564095 x 10 -9) second."}, {"url": "http://physics.nist.gov/cuu/Units/prefixes.html", "passage_text": "y. It is important to note that the kilogram is the only SI unit with a prefix as part of its name and symbol. Because multiple prefixes may not be used, in the case of the kilogram the prefix names of Table 5 are used with the unit name gram and the prefix symbols are used with the unit symbol g.. "}, {"url": "http://whatis.techtarget.com/definition/International-System-of-Units-SI", "passage_text": "The kilogram (abbreviation, kg) is the SI unit of mass. It is defined as the mass of a particular international prototype made of platinum-iridium and kept at the International Bureau of Weights and Measures. It was originally defined as the mass of one liter (10 -3 cubic meter) of pure water. The meter (abbreviation, m) is the SI unit of displacement or length. One meter is the distance traveled by a ray of electromagnetic (EM) energy through a vacuum in 1/299,792,458 (3.33564095 x 10 -9) second."}, {"url": "http://www.answers.com/Q/Importance_of_SI_units", "passage_text": "SI units are important because it is a universal means of communicating different types of measurements. SI (systeme international) units are used as a standard frame of reference to avoid confusion arising from the use of non-standard units of measurement. SI units are agreed up … on by everybody. Differences in standards used by individual countries can have disastrous consequences."}, {"url": "http://www.gnbsgy.org/index.php/standards-corner/38-understanding-the-metric-system-using-the-units-of-mass", "passage_text": "Importance of the Metric System. The Metric System is a measurement system which uses Standard International (SI) Units. It is simple to learn and easy to use because of its decimal nature. Almost all of the countries in the world use the metric system although many products are still manufactured in common sizes for public use. The metric base unit for measuring mass is the Kilogram. When the Kilogram is divided by 1000 the result is 1 gram and when the Kilogram is multiplied by 1000 the result is 1 metric tonne. (Note the difference in spelling for tonne). The units of Mass (Weight)."}, {"url": "http://whatis.techtarget.com/definition/International-System-of-Units-SI", "passage_text": "SI base units: The meter (abbreviation, m) is the SI unit of displacement or length. One meter is the distance traveled by a ray of electromagnetic (EM) energy through a vacuum in 1/299,792,458 (3.33564095 x 10 -9) second."}, {"url": "http://www.answers.com/Q/Importance_of_SI_units", "passage_text": "The term SI stands for Systeme Internationale, which is French for international system; the SI units are also known as the metric system, which was originally introduced by t … he French, at the time of the French revolution. SI (systeme international) units are used as a standard frame of reference to avoid confusion arising from the use of non-standard units of measurement. SI units are agreed up … on by everybody. Differences in standards used by individual countries can have disastrous consequences."}, {"url": "https://javianleu.wordpress.com/2012/02/22/the-importance-of-the-international-system-of-units/", "passage_text": "The International System of units is very important because it helps the whole world understand the measurements in only one set of units and not to transform every single one of them to the one you use to see its worth against the thing you’re comparing. "}]