[{"url": "http://www.allaboutvision.com/lenses/polycarb.htm", "passage_text": "When eye safety is a concern, polycarbonate or Trivex lenses usually are the best choice for your eyeglasses, sunglasses and sports eyewear. Both polycarbonate and Trivex lenses are thinner and lighter than regular plastic lenses."}, {"url": "http://www.visivite.com/solar-shield.html", "passage_text": "Customer Reviews. The amber color of these impact-resistant polycarbonate lenses block short-wavelength blue light and 100% of ultraviolet (UV) light, thus providing additional protection against cataract formation and the development of macular degeneration, while increasing contrast on both sunny and bright hazy days."}, {"url": "http://www.allaboutvision.com/lenses/polycarb.htm", "passage_text": "Like polycarbonate lenses, lenses made of Trivex are thin, lightweight and much more impact-resistant than regular plastic or glass lenses. Trivex lenses, however, are composed of a urethane-based monomer and are made from a cast molding process similar to how regular plastic lenses are made."}, {"url": "http://blog.safetyglassesusa.com/benefits-of-copper-orange-amberyellow-brownbronze-lens-tints/", "passage_text": "While copper lenses block blue light better than the other lenses mentioned, they may be too dark for many to wear inside. Yellow/amber, orange and brown/bronze lenses still block enough blue light without the dimming effect to still produce some of the same benefits mentioned above."}, {"url": "https://www.specsavers.co.uk/ask-the-optician/do-polycarbonate-lenses-block-blue-light/", "passage_text": "Do they block so called “computer blue light or should I invest in clip-on lenses that do block this portion of the light spectrum? Written answer: Although polycarbonate lenses will absorb almost all UV light without the addition of a coating, it will not absorb blue light, so you will need a tint or clip-on lens. The best colour for blue absorption is a yellow or amber tint but brown will also be nearly as effective. Book an appointment."}]