[{"url": "http://www.answers.com/Q/What_does_Chupacabra_mean", "passage_text": "Confidence votes 102. Chupacabra is the Spanish word for goatsucker because it is a creature that sucks the blood out of animals. It means that it sucks (chupa) the blood from goats (cabras). Other small animal deaths have been attributed to the chupacabras. Although there is no scientific support for its existence, the belief in the chupacabra is strong in some areas, due to its extensive folklore. In Spanish El Chupacabra means Goat Sucker.. It allegedly sucked the blood out of goats, leaving only skin and bones, and a 3-pronged puncture wound. The reports also came from a suburb in Chile where a growling creature jumped through a child's window and killed him, and tried to carry away the body."}, {"url": "https://en.wikipedia.org/wiki/Chupacabra", "passage_text": "The chupacabra or chupacabras (. [tʃupaˈkaβɾas] , literally goat-sucker) is a legendary cryptid rumored to inhabit parts of the Americas, with the first sightings reported in Puerto Rico. The name comes from the animal's reported habit of attacking and drinking the blood of livestock, especially goats. Physical descriptions of the creature vary. The most common description of the chupacabra is that of a reptile-like creature, said to have leathery or scaly greenish-gray skin and sharp spines or quills running down its back. It is said to be approximately 3 to 4 feet (1 to 1.2 m) high, and stands and hops in a fashion similar to that of a kangaroo."}, {"url": "https://en.wikipedia.org/wiki/Chupacabra", "passage_text": "Chupacabras can be literally translated as goat-sucker, from chupar (to suck) and cabra (goat). It is known as both chupacabras and chupacabra throughout the Americas, with the former being the original word, and the latter a regularization of it. The name in Spanish can be preceded by a singular masculine article (el chupacabras), or the plural masculine article (los chupacabras). The most common description of the chupacabra is that of a reptile-like creature, said to have leathery or scaly greenish-gray skin and sharp spines or quills running down its back. It is said to be approximately 3 to 4 feet (1 to 1.2 m) high, and stands and hops in a fashion similar to that of a kangaroo."}, {"url": "http://www.urbandictionary.com/define.php?term=chupacabra", "passage_text": "Friend-You are a god. 3. chupacabra. also called the goat sucker (Spanish=Chupar means to suck or to draw fluid;Cabra means goat), el chupacabra was first sighted in Puerto Rico, draining the bodily fluid and some vital organs out of its victim's body. A creature also known as a 'Goat Sucker' simply because it drains the blood and body fluids out of goats, leaving them dry and lifeless. Some people believe it came from another planet. Some say it looks much like a kangaroo. I think I saw a chupacabra in that car park."}, {"url": "http://www.answers.com/Q/What_does_chupacabra_mean_in_Spanish", "passage_text": "Chupacabra is the Spanish word for goatsucker because it is a creature that sucks the blood out of animals. It means that it sucks (chupa) the blood from goats (cabras …). Other small animal deaths have been attributed to the chupacabras. Many believers in the legends ascribe mystical or supernatural attributes to the chupacabra. El Chupacabra is a cryptid that originated in Mexico. In Spanish El Chupacabra means Goat Sucker.. It allegedly sucked the blood out of goats, leaving only skin and bones, and a 3-pronged puncture wound."}, {"url": "http://wonderopolis.org/wonder/what-is-el-chupacabra/", "passage_text": "El Chupacabra, of course! El Chupacabra got its name from the Spanish words chupar (“to suck”) and cabra (“goat”). This mythical monster supposedly inhabits parts of Puerto Rico, Mexico and the United States. Believers in El Chupacabra believe the monster acts like a vampire, drinking the blood of livestock, especially goats."}]