[{"url": "http://www.immunize.org/askexperts/experts_men.asp", "passage_text": "Quadrivalent meningococcal conjugate vaccine (MCV4) is the preferred product for people age 55 years and younger and some people older than 55 years. MCV4-D (Menactra, sanofi) is licensed for persons age 9 months through 55 years and MCV4-CRM (Menveo, Novartis) is licensed for persons age 2 months through 55 years. It is the first quadrivalent meningococcal conjugate vaccine approved for children younger than age 9 months. For children beginning the vaccination series at age 2 months the schedule is 4 doses at age 2, 4, 6, and 1215 months."}, {"url": "http://www.cdc.gov/vaccines/vpd-vac/mening/who-vaccinate.htm", "passage_text": "Teens age 16 through 18 years can get the booster dose at any time. The minimum interval between doses is 8 weeks. However, teens who receive their first dose of quadrivalent meningococcal conjugate vaccine at or after age 16 do not need a booster dose. Physicians can still use serogroup B meningococcal vaccines for people 10 through 25 years old consistent with the labeled indication. ACIP is currently considering use of serogroup B meningococcal vaccines in preteens, teens, and young adults. A decision on recommendations is expected soon."}, {"url": "http://www.phac-aspc.gc.ca/publicat/ccdr-rmtc/09vol35/acs-dcc-4/index-eng.php", "passage_text": "Revaccination using a conjugate vaccine (such as Menactra™) after earlier administration of polysaccharide vaccine should be considered: 1  1 to 2 years later if the polysaccharide vaccine was received at 13 to 23 months of age; 2  2 to 3 years later if the polysaccharide vaccine was received at 2 to 5 years of age; and. "}, {"url": "http://www.ct.gov/dph/cwp/view.asp?a=3136&q=388352", "passage_text": "Up to about half of people who get meningococcal vaccines have mild side effects, such as redness or pain where the shot was given. These symptoms usually last for one or two days and are more common after MCV than after MPSV. A meningococcal conjugate vaccine or MCV (Menactra by sanofi pasteur) was licensed in 2005. It also protects against the A, C, Y and W-135 subtypes. MCV is expected to give better, longer-lasting protection than the polysaccharide vaccine."}, {"url": "http://www.buzzle.com/articles/meningitis-vaccine-how-long-does-it-last.html", "passage_text": "The other vaccine is known as meningococcal conjugate vaccine (MCV4). This vaccine is recommended for children between the age group of 11 to 18 years and at 0 risk group of 2 to 55 years by the Center for Disease Control and Prevention (CDC). The meningitis vaccine, Haemophilus influenzae type B (Hib) is administered to children under 5 years of age. There are usually 3 to 4 doses given at 2 months, 4 months, 6 months, and 12 months of age."}, {"url": "http://www.immunize.org/catg.d/p4210.pdf", "passage_text": "The incubation period of meningococcal disease is 3 to 4 days, with a range of 2 to 10 days. Meningococcal bacteria can make a person extremely ill by infecting the blood (septicemia) or by infecting the fluid of the spinal cord and around the brain (meningitis). Meningitis can be caused by different serogroups of the meningococcal bacterium, by other bacteria such as Streptococcus and Haemophilus, as well as by viruses and fungi. Being vaccinated against Neisseria meningitidis or having had the disease will not protect you against meningitis from other bacteria or viruses."}, {"url": "http://www.cdc.gov/vaccines/vpd-vac/mening/who-vaccinate.htm", "passage_text": "When quadrivalent meningococcal conjugate vaccine was first recommended for preteens and teens in 2005, the expectation was that protection would last for 10 years; however, currently available data suggest protection declines in most teens within 5 years. Physicians can still use serogroup B meningococcal vaccines for people 10 through 25 years old consistent with the labeled indication. ACIP is currently considering use of serogroup B meningococcal vaccines in preteens, teens, and young adults. A decision on recommendations is expected soon."}, {"url": "http://www.cdc.gov/vaccines/vpd-vac/mening/who-vaccinate.htm", "passage_text": "Serogroup B meningococcal vaccine is also available for preteens and teens, but it is only recommended for certain people at increased risk of meningococcal disease. Physicians can still use serogroup B meningococcal vaccines for people 10 through 25 years old consistent with the labeled indication. ACIP is currently considering use of serogroup B meningococcal vaccines in preteens, teens, and young adults. A decision on recommendations is expected soon."}, {"url": "http://www.menactra.com/", "passage_text": "Menactra vaccine is given to people 9 months through 55 years of age to help prevent meningococcal disease (including meningitis) caused by certain strains of meningococcal bacteria. Menactra vaccine is not indicated for the prevention of meningitis caused by meningococcal strains not contained in the vaccine. "}, {"url": "http://www.buzzle.com/articles/meningitis-vaccine-how-long-does-it-last.html", "passage_text": "There are two types of vaccines available, viral meningitis and bacterial meningitis. The meningitis vaccine, Haemophilus influenzae type B (Hib) is administered to children under 5 years of age. There are usually 3 to 4 doses given at 2 months, 4 months, 6 months, and 12 months of age. This vaccine is known to provide immunity against meningitis infection for at least 15 years. There are two types of vaccines against Neisseria meningitidis, the bacteria that causes meningococc"}]