[{"url": "http://englishplus.com/grammar/00000047.htm", "passage_text": "Names of superspecies, species, and subspecies always appear with the name of the genus (or at least the genus abbreviated) so that the full specific name begins with a capital letter. The full specific name, genus plus species (and superspecies and subspecies, if used), is italicized or underlined. Examples: Birds are in the class Aves, subphylum Vertebrata, and phylum Chordata. The American Robin is in the family Turdidae, superfamily Muscicapidae, suborder Oscines, and order Passeriformes."}, {"url": "http://wwwnc.cdc.gov/eid/pages/scientific-nomenclature.htm", "passage_text": "Italics Use with Virus Names. A virus is not a species; a virus belongs to a species. Italicize species, genus, and family of a virus when used in a taxonomic sense. Note however, that it is fine to not mention taxonomy of a virus, especially one like dengue or polio that is well known. Do not italicize a virus name when used generically"}, {"url": "https://en.wikipedia.org/wiki/Genus", "passage_text": "E.G., Felis catus and F. silvestris are two species within the genus Felis. Felis is a genus within the family Felidae. The composition of a genus is determined by a taxonomist. The standards for genus classification are not strictly codified, so different authorities often produce different classifications for genera."}, {"url": "http://www.answers.com/Q/Which_do_you_capitalize_genus_or_species", "passage_text": "There are two of them. The genus is the first part, always capitalized, and the species is the second part of the word. When typed it needs to be italicized and when written i … t is underlined. 1. Streptococcal pharyngitis 2. "}, {"url": "https://en.wikipedia.org/wiki/Genus", "passage_text": "In the hierarchy of biological classification, genus comes above species and below family. In binomial nomenclature, the genus name forms the first part of the binomial species name for each species within the genus. Felis is a genus within the family Felidae. The composition of a genus is determined by a taxonomist. The standards for genus classification are not strictly codified, so different authorities often produce different classifications for genera."}, {"url": "http://wwwnc.cdc.gov/eid/pages/scientific-nomenclature.htm", "passage_text": "Binary genus-species combinations are always used in the singular. Genus used alone (capitalized and italicized) is usually used in the singular, but it may be used in the plural (not italicized) if it refers to all species within that genus. Italicize species, genus, and family of a virus when used in a taxonomic sense. Note however, that it is fine to not mention taxonomy of a virus, especially one like dengue or polio that is well known."}, {"url": "http://ic.ucsc.edu/~ggilbert/envs122/ConventionsScienceWriting.html", "passage_text": "Scientific names come in two parts (thus, binomial), the first part the genus (plural, genera), the second part the species (plural, species). The genus names is always capitalized, and the species name is never capitalized (even if it is a proper noun!). The genus and species names are always italicized or underlined. Recent changes in the nomenclatural code also requires family names to be italicized, but this practice is not universally adopted (they should always be capitalized, however). Following the species name, one sometimes finds additional words. "}, {"url": "http://www.ext.colostate.edu/mg/gardennotes/122.html", "passage_text": "The genus name is always capitalized, but the specific epithet name is not. The singular and plural spelling of species is the same. In writing, the abbreviation “sp.” following the genus indicates a single unidentified species and “spp.” indicates multiple species. Genus and Species. The taxonomic divisions beyond the family level are the genus and specific epithet names, together called the species. Plants are named using a binomial system. The genus name comes first and is analogous to a person’s last name (like Smith)."}, {"url": "http://blog.vancouvereditor.com/2011/03/science-writing-and-editing-scientific.html", "passage_text": "Common names derived from taxon names, for instance “felines” for members of the family Felidae, are not capitalized. A common name that is derived from a genus name, such as gorilla, is not capitalized either (see Chicago 8.126). Below the level of species there are subspecies and varieties. Science writing and editing: How to write scientific names. The Latin scientific name of a species, be it plant, animal, bacterium, fungus, etc., is a two-part name consisting of the genus name first (by the way: one genus, two genera) and the species name second. For example, the domestic cat is known as Felis catus."}, {"url": "http://wwwnc.cdc.gov/eid/pages/scientific-nomenclature.htm", "passage_text": "Italicize family, genus, species, and variety or subspecies. Begin family and genus with a capital letter. Kingdom, phylum, class, order, and suborder begin with a capital letter but are not italicized. If a generic plural for an organism exists (see Dorland’s), it is neither capitalized nor italicized. Italicize species, genus, and family of a virus when used in a taxonomic sense. Note however, that it is fine to not mention taxonomy of a virus, especially one like dengue or polio that is well known."}]