[{"url": "https://simple.wikipedia.org/wiki/Surface_tension", "passage_text": "Surface tension is an effect where the surface of a liquid is strong. The surface can hold up a weight, and the surface of a water droplet holds the droplet together, in a ball shape. Some small things can float on a surface because of surface tension, even though they normally couldn't float. Surface tension has the dimension of force per unit length, or of energy per unit area. The two are equivalent—but when referring to energy per unit of area, people use the term surface energy —which is a more general term in the sense that it applies also to solids and not just liquids."}, {"url": "http://www.physicsclassroom.com/class/newtlaws/Lesson-2/Types-of-Forces", "passage_text": "Tension Force Ftens. Return to Top. The tension force is the force that is transmitted through a string, rope, cable or wire when it is pulled tight by forces acting from opposite ends. The tension force is directed along the length of the wire and pulls equally on the objects on the opposite ends of the wire. "}, {"url": "http://water.usgs.gov/edu/surface-tension.html", "passage_text": "Surface tension The property of the surface of a liquid that allows it to resist an external force, due to the cohesive nature of its molecules. The cohesive forces between liquid molecules are responsible for the phenomenon known as surface tension. Surface Tension and Droplets: Surface tension is responsible for the shape of liquid droplets. Although easily deformed, droplets of water tend to be pulled into a spherical shape by the cohesive forces of the surface layer."}, {"url": "http://www.answers.com/Q/What_is_tension", "passage_text": "in physics tension is a force.the pull at both ends of a stretched spring,string or rope is called tension. Tension and compression takes place when an object has a force on  another object. The tension is when the force is causing a pulling  effect on part of the object. The comp … ression is when the force is  causing a contracting effect on part of the object. Answered."}, {"url": "http://www.yourdictionary.com/tension", "passage_text": "Use tension in a sentence. LINK / CITE ADD TO WORD LIST. noun. Tension is physical or mental strain, the force created by pulling something tight or a strain in a relationship. 1  An example of tension is the feeling of working to meet an established deadline. 2  An example of tension is pulling the two ends of a rubber band further and further apart from each other. "}, {"url": "http://www.answers.com/Q/What_is_tension", "passage_text": "Tension forces are two forces acting on one object, moving in opposite directions (away from one another) to stretch the object. Compression forces are two forces acting on on … e object, moving in opposite directions (towards one another) to compress or deform the object. Tension and compression takes place when an object has a force on  another object. The tension is when the force is causing a pulling  effect on part of the object. The comp … ression is when the force is  causing a contracting effect on part of the object. Answered."}, {"url": "https://en.wikipedia.org/wiki/Tension", "passage_text": "1 Tension (physics) , a force related to the stretching of an object (the opposite of compression). 2  Tension (geology) , a stress which stretches rocks in two opposite directions. 3  Voltage or electric tension. "}, {"url": "https://en.wikipedia.org/wiki/Tension_(physics)", "passage_text": "Each end of a string or rod under tension will pull on the object it is attached to, to restore the string/rod to its relaxed length. Tension is the opposite of compression. In physics, although tension is not a force, it does have the units of force and can be measured in newtons (or sometimes pounds-force). The system has a constant velocity and is therefore in equilibrium because the tension in the string (which is pulling up on the object) is equal to the force of gravity, mg, which is pulling down on the object."}, {"url": "https://en.wikipedia.org/wiki/Tension_(physics)", "passage_text": "In physics, tension describes the pulling force exerted by each end of a string, cable, chain, or similar one-dimensional continuous object, or by each end of a rod, truss member, or similar three dimensional object. The system has a constant velocity and is therefore in equilibrium because the tension in the string (which is pulling up on the object) is equal to the force of gravity, mg, which is pulling down on the object."}]