[{"url": "https://en.wikipedia.org/wiki/Frankincense", "passage_text": "Frankincense, also called olibanum, is an aromatic resin used in incense and perfumes, obtained from trees of the genus Boswellia in the family Burseraceae, particularly Boswellia sacra (syn: B. carteri, B. bhaw-dajiana), B. frereana, B. serrata (B. thurifera, Indian frankincense), and B. papyrifera. "}, {"url": "https://en.wikipedia.org/wiki/Commiphora_wightii", "passage_text": "Commiphora wightii, with common names Indian bdellium-tree, gugal, guggul, gugul, or Mukul myrrh tree, is a flowering plant in the family Burseraceae. The guggul plant may be found from northern Africa to central Asia, but is most common in northern India. But has become so scarce because of its overuse in its two habitats in India where it is found — Gujarat and Rajasthan that the World Conservation Union (IUCN) has enlisted it in its Red Data List of endangered species."}, {"url": "http://en.mr-ginseng.com/ashwagandha/", "passage_text": "Ashwagandha: Origins. Ashwagandha (Withania somnifera) originated in India and is used very often in ayurvedic medecine (an Indian system of medicine that is one of the oldest in the world). It has been used for more than 3,000 years, and has survived through the centuries due to its numerous virtue"}, {"url": "http://www.4to40.com/ayurveda/index.asp?p=Guggul&k=Guggul_Dhoop", "passage_text": "Guggul Dhoop. Guggul can be purchased in a loosely packed form called Dhoop, an incense from India, which is then burned over hot coals. This produces a fragrant dense smoke. The burning coals which produces the smoke is carried around in different rooms and held in all the corners of the room for a few seconds. Commiphora wightii (Guggal, Guggul or Mukul myrrh tree) is a flowering plant in the family Burseraceae. The guggul plant may be found from northern Africa to central Asia, but is most common in northern India. It prefers arid and semi-arid climates and is tolerant of poor soil."}, {"url": "https://en.wikipedia.org/wiki/Aarti", "passage_text": "Aarti Plate. Aarti also spelled arati, arathi, aarthi (from the Sanskrit word aratrika with the same meaning) is a Hindu religious ritual of worship, a part of puja, in which light from wicks soaked in ghee (purified butter) or camphor is offered to one or more deities. "}, {"url": "http://www.4to40.com/ayurveda/index.asp?p=Guggul&k=Guggul_Dhoop", "passage_text": "Introduction. Commiphora wightii (Guggal, Guggul or Mukul myrrh tree) is a flowering plant in the family Burseraceae. The guggul plant may be found from northern Africa to central Asia, but is most common in northern India. It prefers arid and semi-arid climates and is tolerant of poor soil."}, {"url": "http://www.4to40.com/ayurveda/index.asp?p=Guggul&k=Guggul_Dhoop", "passage_text": "In Indian languages, it is known by various names like guggul in Hindi, gukkulu and maishakshi in Tamil, guggulu in Sanskrit and Indian bdellium in English. It is a shrub or small tree, reaching a maximum height of 4 m, with thin papery bark. The branches are thorny. Commiphora wightii (Guggal, Guggul or Mukul myrrh tree) is a flowering plant in the family Burseraceae. The guggul plant may be found from northern Africa to central Asia, but is most common in northern India. It prefers arid and semi-arid climates and is tolerant of poor soil."}, {"url": "http://en.mr-ginseng.com/ashwagandha/", "passage_text": "Ashwagandha (Withania somnifera) is one of the most powerful medicinal plants, and has been used for more than 3,000 years by one of the most oldest medicinal systems in the world: ayurvedic medicine. Its history means that the effects of the plant are very well known. Ashwagandha (Withania somnifera) originated in India and is used very often in ayurvedic medecine (an Indian system of medicine that is one of the oldest in the world). It has been used for more than 3,000 years, and has survived through the centuries due to its numerous virtues"}, {"url": "http://www.prophet666.com/2011/01/dhoop-aarti-english-marathi.html", "passage_text": "Dhoop Aarti-English-Marathi. Dhoop called Incense in English is an integral part and parcel of the daily worship in the Hindu religion. The practice of lighting Dhoop before a deity goes back to the Vedic period. This practice involves reciting an Aarti while offering Dhoop in a traditional Pooja tray or a Spoon like utensil. Burning of Dhoop, which is made from natural ingredients like roots, wood and various types of flowers, purifies the entire atmosphere. The Spiritual significance is that it purifies the mind."}]