[{"url": "https://answers.yahoo.com/question/index?qid=20111110193635AAobjao", "passage_text": "1 You can only upload photos smaller than 5 MB. 2  You can only upload videos smaller than 600MB. 3  You can only upload a photo (png, jpg, jpeg) or a video (3gp, 3gpp, mp4, mov, avi, mpg, mpeg, rm). 4  You can only upload a photo or a video. 1 Please upload a file larger than 100x100 pixels. 2  We are experiencing some problems, please try again. 3  You can only upload files of type PNG, JPG, or JPEG. 4  You can only upload files of type 3GP, 3GPP, MP4, MOV, AVI, MPG, MPEG, or RM. 5 "}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/chemical/ph.html", "passage_text": "The pH of a solution is a measure of the molar concentration of hydrogen ions in the solution and as such is a measure of the acidity or basicity of the solution. The letters pH stand for power of hydrogen and the numerical value is defined as the negative base 10 logarithm of the molar concentration of hydrogen ions. pH = -log. The measurement of the pH of a sample can be done by measuring the cell potential of that sample in reference to a standard hydrogen electrode, as in the accepted procedure for measuring standard electrode potentials."}, {"url": "http://www.chem1.com/acad/webtext/elchem/ec3.html", "passage_text": "Ecell = VM – Vsolution. which is just the potential (relative to that of the SHE) of the half-cell whose reaction is. M 2+ + 2 e– → M (s). Measurement of a standard reduction potential. The M 2+ /M half-cell is on the left, and the standard hydrogen cell is on the right. The two half-cells are joined through the salt bridge in the middle."}, {"url": "http://www.answers.com/Q/What_unit_of_measurement_is_used_to_indicate_friction", "passage_text": "Friction is a force. I'll get back to that. Weight, which is usually measured in pounds or ounces or grams (depending on where you live or what you're measuring), has a … n official (SI) unit of newtons. An object's weight depends on the gravity affecting that object."}, {"url": "http://www.answers.com/Q/Which_unit_of_measure_is_used_to_indicate_Ecell", "passage_text": "Many different units of measurement are used for measuring area.  Some of them include the square metre, the square centimetre, the  square kilometre, and the hectare. Some … others include the square  inch, the square foot, the square mile, and the acre. In SI, acceleration is measured in meters / second2, or meters / second / second. In other units, units of the same dimension have to be used, i.e., [length] / [time] / [time] … . For example, in the imperial units, feet per square second is quite common. 1 person found this useful. GB."}, {"url": "http://2012books.lardbucket.org/books/principles-of-general-chemistry-v1.0/s23-04-electrochemical-cells-and-ther.html", "passage_text": "For example, under standard conditions, the reaction of Co(s) with Ni (aq) to form Ni(s) and Co (aq) occurs spontaneously, but if we reduce the concentration of Ni by a factor of 100, so that [Ni ] is 0.01 M, then the reverse reaction occurs spontaneously instead. "}, {"url": "http://www.answers.com/Q/Which_unit_of_measure_is_used_to_indicate_Ecell", "passage_text": "What unit of measurement is used for acceleration? In SI, acceleration is measured in meters / second2, or meters / second / second. In other units, units of the same dimension have to be used, i.e., [length] / [time] / [time] … . For example, in the imperial units, feet per square second is quite common. 1 person found this useful. GB."}, {"url": "https://answers.yahoo.com/question/index?qid=20111110193635AAobjao", "passage_text": "1 We are experiencing some problems, please try again. 2  You can only upload files of type PNG, JPG, or JPEG. 3  You can only upload files of type 3GP, 3GPP, MP4, MOV, AVI, MPG, MPEG, or RM. 4  You can only upload photos smaller than 5 MB. 1 Please upload a file larger than 100x100 pixels. 2  We are experiencing some problems, please try again. 3  You can only upload files of type PNG, JPG, or JPEG. 4  You can only upload files of type 3GP, 3GPP, MP4, MOV, AVI, MPG, MPEG, or RM. 5"}, {"url": "https://en.wikipedia.org/wiki/Standard_electrode_potential", "passage_text": "Since the oxidation potential of a half-reaction is the negative of the reduction potential in a redox reaction, it is sufficient to calculate either one of the potentials. Therefore, standard electrode potential is commonly written as standard reduction potential. Although the overall potential of a cell can be measured, there is no simple way to accurately measure the electrode/electrolyte potentials in isolation."}]