[{"url": "http://www.newegg.com/Desktop-Memory/SubCategory/ID-147", "passage_text": "System memory is where a computer holds the programs and data that are currently in use. The definition of the word memory has become somewhat blurred over the years because there are different types of memory that a computer uses. "}, {"url": "http://www.typesof.com/types-of-computer-memory/", "passage_text": "Hard Disk Drive. The hard disk drives are among the most common types of computer memory. They can store the data and information long term as this is where you store your music, games, documents, and the like. Hard drives work much like records. They are spinning platters that have arms with head to touch the different parts of it. These are the types of computer memory that are permanent and portable. These types of computer memory works like records and hard drives. However, instead of the head and arm, a laser light writes and reads the information on the CDs and DVDs to interpret it and display them in the monitor."}, {"url": "http://www.tutorialspoint.com/computer_fundamentals/computer_memory.htm", "passage_text": "A memory is just like a human brain. It is used to store data and instructions. Computer memory is the storage space in computer where data is to be processed and instructions required for processing are stored. The memory is divided into large number of small parts called cells"}, {"url": "http://www.answers.com/Q/What_type_of_memory_is_used_in_laptop_computers", "passage_text": "Laptops and use the same type of memory as the corresponding desktops of the period (DDR2, DDR. SDRAM, etc...). They use a different form factor, which is narrower and s … horter. This form factor is known as SO-DIMM. "}, {"url": "http://www.computerhope.com/issues/ch000910.htm", "passage_text": "What type of memory does the computer use? Some examples of the different memory types include DDR-SDRAM, DDR2-SDRAM, DIMM, DRAM, EDO, FPM, SDRAM, LIMM, RDRAM (RAMBUS), RIMM, SIMM, and SODIMM. Today's computers usually use a variant of DIMM/SDRAM memory. Amount of Pins."}, {"url": "http://computermemoryupgrade.net/types-of-computer-memory-common-uses.html", "passage_text": "Different RAM Types and its uses. Intro. The type of RAM doesn't matter nearly as much as how much of it you've got, but using plain old SDRAM memory today will slow you down. There are main types of RAM: SDRAM, DDR and Rambus DRAM. SDRAM (Synchronous DRAM) Almost all systems used to ship with 3.3 volt, 168-pin SDRAM DIMM"}, {"url": "http://engineersedge.com/computer_technology/computer_memory_types.htm", "passage_text": "There are many types of computer memory modules available. In this day and age, computers (laptops, PCs, etc.) generally do not use a single type of memory; rather, a combination of memory chips and modules are normally found in today's computers, depending on requirements and applications. DRAM (Dynamic Random Access Memory) The most common type of computer memory. DRAMs hold data for a relatively brief period of time and need to be refreshed at regular intervals. DRAMs are measured by access time (in nanoseconds, or ns) and storage capacity (in megabytes, or MB)."}]