[{"url": "http://www.graduatenursingedu.org/texas/texas-salary/", "passage_text": "Texas Nurse Practitioner Salary. According to the Advance for NPs & PAs 2011 National Salary Survey, the average salary for nurse practitioners in Texas was $107,526. NPs in Houston reported an average salary of $88,224, while those working in the Dallas-Ft. Worth area reported one of the highest average salaries in the nation, at $134,534 per year."}, {"url": "http://www.graduatenursingedu.org/texas/texas-salary/", "passage_text": "According to the Advance for NPs & PAs 2011 National Salary Survey, the average salary for nurse practitioners in Texas was $107,526. NPs in Houston reported an average salary of $88,224, while those working in the Dallas-Ft. Worth area reported one of the highest average salaries in the nation, at $134,534 per year."}, {"url": "http://www.teachersalaryinfo.com/average-teacher-salary-texas.html", "passage_text": "Average Teacher Salary in Texas. In 2009, the average annual salary of Texas teachers was $49,900, which slightly above the 2009 national average. Texas was ranked the 28th state in national rankings for average teacher salaries, and it continues to slowly make its way up the list year after year. In fact, teaching salaries in Texas have continued to increase every year by at least $2000."}, {"url": "http://www.accountingedu.org/texas-accountant-salary.html", "passage_text": "According to salary information provided by the Bureau of Labor Statistics, accountants in Texas earned an average of $75,210 in 2014. Tax preparers in the top 10th percentile in Corpus Christi made $66,380. Accountants who were in the top 10 percent salary bracket earned $131,770 in the Houston area."}, {"url": "http://www.accountingedu.org/texas-accountant-salary.html", "passage_text": "The factors that greatly affect salaries for accountants in Texas are location, experience and CPA licensure. The lowest average wage reported by the BLS was for the Gulf Coast Texas nonmetropolitan area at $60,500 a year. Houston makes up the top of the range at $83,190 annually. The table below contains employment and salary information for accountants in 2014 drawn from the Bureau of Labor Statistics."}]