[{"url": "http://eol.org/pages/308480/details", "passage_text": "The tufted deer is a small deer, but still larger than most muntjac species. It stands at 50–70 centimetres (20–28 in) at the shoulder, and the weight varies greatly from 17 to 50 kilograms (37 to 110 lb). The tufted deer is a fairly dainty deer, named after the tuft of long, blackish-brown hair growing from the forehead (2) (3). The antlers of male tufted deer are diminutive spikes, rarely protruding beyond the distinctive tuft of hair (3)."}, {"url": "http://amazingadaptations.weebly.com/tufted-deer.html", "passage_text": "The Tufted deer’s adaptation is vampire like fangs. It has fangs because they are used for fighting in mating season Historically the species is known to live in high damp forests in china, northern India and Burma, next to water and tree lines. "}, {"url": "http://www.wild-facts.com/2013/tufted-deer/", "passage_text": "1 The Tufted Deer has a vampire-esque look due to the incredibly large canines, which stick out of their mouth like fangs. 2  This deer species gets their common name from the small, brown or black tuft of hair on their forehead (I am sure all of the balding deer are envious). The two main animals they need to be cautious of are Leopards and of course, humans. When threatened, the Tufted Deer will act much like the White-Tailed Deer as they too use their tail to confuse potential predators."}, {"url": "http://www.wild-facts.com/2013/tufted-deer/", "passage_text": "Even though the Tufted Deer has tusks that would make a Wooly Mammoth envious (okay, maybe that is a bit of an exaggeration) they still need to worry about predators. The two main animals they need to be cautious of are Leopards and of course, humans. When threatened, the Tufted Deer will act much like the White-Tailed Deer as they too use their tail to confuse potential predators."}, {"url": "https://en.wikipedia.org/wiki/Tufted_deer", "passage_text": "The tufted deer is similar to a muntjac in appearance, but the longer necks and legs give it a slightly leaner appearance. The coat is coarse with short and stiff hairs, being almost black in the winter and chocolate brown in the summer. The lips, tip of the ears, and the underside of the tails are white. Perhaps the most striking feature of this deer are the fang-like canines in the males of the species. These can grow up to 2.6 cm (1.0 in) long, or longer in rare cases. The tufted deer is a small deer, but still larger than most muntjac species. It stands at 50–70 centimetres (20–28 in) at the shoulder, and the weight varies greatly from 17 to 50 kilograms (37 to 110 lb). The tail is short at around 10 cm (3.9 in)"}, {"url": "https://en.wikipedia.org/wiki/Tufted_deer", "passage_text": "The tufted deer (Elaphodus cephalophus) is a small species of deer characterized by a prominent tuft of black hair on its forehead and fang-like canines for the males. Perhaps the most striking feature of this deer are the fang-like canines in the males of the species. These can grow up to 2.6 cm (1.0 in) long, or longer in rare cases. The tufted deer is a small deer, but still larger than most muntjac species. It stands at 50–70 centimetres (20–28 in) at the shoulder, and the weight varies greatly from 17 to 50 kilograms (37 to 110 lb). The tail is short at around 10 cm (3.9 in)"}, {"url": "http://www.livescience.com/48585-fanged-deer-sighting-afghanistan.html", "passage_text": "View full size image. An endangered deer with vampirelike fangs was spotted for the first time in nearly 60 years, in a remote forest in northeastern Afghanistan. The fanged creature is known as the Kashmir musk deer, and it's native to the Himalayas of northern India, Pakistan's Kashmir region and northern Afghanistan. "}, {"url": "http://www.wild-facts.com/2013/tufted-deer/", "passage_text": "According to Encyclopedia of Life, “both male and female tufted deer have large, stout upper canines (3), with those of the male forming tusks up to 2.5 centimetres long (4).”. Here is the source: http://eol.org/pages/308480/details. The two main animals they need to be cautious of are Leopards and of course, humans. When threatened, the Tufted Deer will act much like the White-Tailed Deer as they too use their tail to confuse potential predators."}, {"url": "https://answers.yahoo.com/question/index?qid=20110418110229AAmROXx", "passage_text": "Best Answer: Male Musk Deer have enlarged upper canines for fighting other males and to attract females. The longer, stronger fangs they have makes them more intimidating to competing males and therefore more attractive to females as the offspring of that male are likely to be healthier (survival of the fittest. They're considered to be quite primitive deer because they haven't evolved antlers like modern species of deer from the Cervidae Family. There are many extinct species of deer such as micromeryx from the genus of moschid that didn't have antlers either and have much more prominent fangs."}]