[{"url": "https://in.answers.yahoo.com/question/index?qid=20080130225053AAOA0FX", "passage_text": "Best Answer: Peonies symbolize wealth and power, and the lotus symbolizes purity (and is also a revered Buddhist plant). Chrysanthemums were also extremely well-loved because of their autumn bloom (when most plants wither and die) and symbolize the perfect Confusician scholar. "}, {"url": "http://www.whats-your-sign.com/Chinese-flowers.html", "passage_text": "Peony: Esteemed as one of the most exquisite flowers, the peony is a symbol for nobility and value. The peony became popular in the imperial palaces during the Sui and Tang dynasties, and earned the title of the king of flowers.. A symbol of spring, it is also used as a metaphor for female beauty and reproduction. Pictured in full bloom, the peony symbolizes peace. I hope you enjoy browsing through these perspectives Chinese flowers. If this article interested you, be sure to check out more articles on flower meanings and Chinese symbol meanings listed at the end of this page."}, {"url": "http://www.fragrantica.com/news/Peony-Good-Fortune-Compassion-Nobility-2306.html", "passage_text": "And, you might also like to read what my friend in Taiwan says about Peony. Peony is known as 牡丹 (mǔdān) in Chinese and is an important symbol in Chinese culture, we say 'Peony is the king of flowers.'. Regarded as a symbolic flower, peony symbolizes friendship, good luck and feminine beauty in China. It always represents elegance and poise. Peony was known to China for over 2000 years when it was first used for its medicinal value."}, {"url": "http://www.answers.com/Q/What_do_the_wind_chimes_symbolize_in_The_Jade_Peony", "passage_text": "Wind chimes symbolize much in The Jade Peony, but I think they mostly symbolize the culture and how the modern Chinese-Canadian family's culture is being lost, but the Grandmama is educating the boy (Sek-Lung) on how to build a wind chime (but also teaching him about culture). "}, {"url": "http://www.auntyflo.com/flower-dictionary/peony", "passage_text": "In China, peonies symbolize nobility. The Chinese people give high regards to the peony flowers for a long time now. The most popular time however was during the Sui and Tang dynasty. It was planted at the imperial palace during those times as they are considered to be of high value. "}, {"url": "http://www.char4u.com/content/symbolic-meanings-flowers-in-china/", "passage_text": "China is a culture of flowers. Its traditional art and customs are infused with symbols and habits that pertain to flowers. Even the name of Chinese people, hua ren, when spoken in a different tone could mean “flower people”. Most ancient paintings depict flowers of some kind, most often the plum blossom and tree peony. "}, {"url": "https://en.wikipedia.org/wiki/Peony", "passage_text": "The peony is a flowering plant in the genus Paeonia, the only genus in the family Paeoniaceae. They are native to Asia, Southern Europe and Western North America. Boundaries between species are not clear and estimates of the number of species range from 25 to 40. "}, {"url": "http://www.gardenguides.com/89808-meaning-peony.html", "passage_text": "Other Symbolism. Together with the plum blossom, the peony is a national floral symbol of the country of China. The Chinese name for peony means beautiful and in Chinese culture the flowers represent riches, prosperity and honor. In Western culture, the peony serves as the symbol for the 12th wedding anniversary, and in the language of flowers, represents good fortune and a happy marriage. "}, {"url": "http://www.whats-your-sign.com/Chinese-flowers.html", "passage_text": "Symbolic Chinese Flowers Asian Flower Meanings. Chinese flower symbols represent the natural nectar that brings growth, fulfillment and new, prosperous beginnings into our lives. In Feng Shui, many flowers are utilized for good fortune and success. Pictured in full bloom, the peony symbolizes peace. I hope you enjoy browsing through these perspectives Chinese flowers. If this article interested you, be sure to check out more articles on flower meanings and Chinese symbol meanings listed at the end of this page."}, {"url": "http://www.artofsilk.com/blogs/news/9650429-peonies-in-chinese-art-and-culture", "passage_text": "Flowers are a common theme in general in Chinese traditional paintings, but the peony is an especially popular one. In Chinese art, the peony is a symbol of wealth, power and class; therefore it is an often-seen theme in traditional painting, silk embroidery, national clothes and decorations. Peonies may be small, but they are a unique flower of China, with a history that dates back thousands of years. Loved for its beauty, the peony is the national flower of China."}]