[{"url": "https://en.wikipedia.org/wiki/Albinism", "passage_text": "In humans, there are two principal types of albinism: oculocutaneous, affecting the eyes, skin and hair, and ocular affecting the eyes only. People with Albinism need to take care not to sun-burn and should have regular healthy skin checks by a dermatologist. For the most part, treatment of the eye conditions consists of visual rehabilitation. Surgery is possible on the extra-ocular muscles to decrease strabismus."}, {"url": "https://answers.yahoo.com/question/index?qid=20091006083843AApk88Y", "passage_text": "· just now. Report Abuse. A primary cause of skin cancer is damage to DNA by ultraviolet radiation. In normal skin, the pigment or melanin present serves as a natural sunscreen, absorbing much of the UV radiation and preventing it from damaging the DNA of skin cells. In albinos, they lack the ability to make melanin. As such, their DNA is much more susceptible to UV damage and skin cancer. The best prevention is to stay out of the sun. Use of clothing and/or sunscreens can also effectively limit sun exposure. Source(s): Ph.D."}, {"url": "https://answers.yahoo.com/question/index?qid=20091006083843AApk88Y", "passage_text": "Albinos lack skin and eye pigments, including melanin. Melanin absorbs energy from the sun, which protects skin cells from damage to DNA that the energy would cause if the melanin is not there. Without melanin, skin cells are damaged more easily leading to cancer. In albinos, they lack the ability to make melanin. As such, their DNA is much more susceptible to UV damage and skin cancer. The best prevention is to stay out of the sun. Use of clothing and/or sunscreens can also effectively limit sun exposure. Source(s): Ph.D."}, {"url": "http://medical-dictionary.thefreedictionary.com/Albino+people", "passage_text": "There are 10 types of the most common form of the condition, known as oculocutaneous albinism, which affects the eyes, hair, and skin. In its most severe form, hair and skin remain pure white throughout life. People with a less severe form are born with white hair and skin, which turn slightly darker as they age. albinism. a hereditary disorder, usually transmitted as an autosomal recessive trait, in which there is partial or total absence of pigment in the skin, hair, and eyes (oculocutaneous albinism) or in the eyes alone (ocular albinism), caused by defective or absent function of the enzyme tyrosinase."}, {"url": "http://www.nhs.uk/conditions/albinism/Pages/introduction.aspx", "passage_text": "Introduction. Albinism affects the production of melanin, the pigment that colours skin, hair and eyes. People with albinism have a reduced amount of melanin or no melanin at all, which can cause characteristic signs and symptoms often obvious from birth. Depending on the amount of melanin the person has, they may have very pale hair, skin and eyes, although some people with albinism can have brown or ginger hair and skin that can tan. People with albinism also usually have a number of eye conditions, such as:"}, {"url": "http://www.answers.com/Q/Why_do_albinos_commonly_contract_skin_cancer", "passage_text": "1 Understanding Skin Cancers Affecting Women Carcinoma in simple terms is the most common form of cancer affecting humans. 2  The cancer affects any type of tissue in the body, including skin cells and tissues. It is often mistaken for a sore that does not heal. This form of skin cancer is the least deadly and with proper treatment can be completely eliminated with not so much as a single scar   * Squamous cell carcinoma is commonly a red, scaling, thickened patch on sun-exposed skin."}, {"url": "http://www.answers.com/Q/Why_do_albinos_commonly_contract_skin_cancer", "passage_text": "1 The cancer comes in several different 2  …. The Most Prominent Risk Factors for Skin Cancer Skin cancer is a serious illness affecting the largest organ in your body. 3  Types of skin cancer include basal cell carcinoma, squamous cell carcinoma and melanoma. It is often mistaken for a sore that does not heal. This form of skin cancer is the least deadly and with proper treatment can be completely eliminated with not so much as a single scar   * Squamous cell carcinoma is commonly a red, scaling, thickened patch on sun-exposed skin."}, {"url": "http://medical-dictionary.thefreedictionary.com/Albino+people", "passage_text": "albinism. [al′biniz′əm]. a rare inherited disorder characterized by a lack of melanin in the skin. Total albinos have pale skin that does not tan, white hair, pink eyes, nystagmus, astigmatism, and photophobia. Albinos are prone to severe sunburn, actinic dermatitis, and skin cancer. albinism. a hereditary disorder, usually transmitted as an autosomal recessive trait, in which there is partial or total absence of pigment in the skin, hair, and eyes (oculocutaneous albinism) or in the eyes alone (ocular albinism), caused by defective or absent function of the enzyme tyrosinase."}, {"url": "https://en.wikipedia.org/wiki/Albinism", "passage_text": "Albinism is associated with a number of vision defects, such as photophobia, nystagmus and amblyopia. Lack of skin pigmentation makes for more susceptibility to sunburn and skin cancers. People with Albinism need to take care not to sun-burn and should have regular healthy skin checks by a dermatologist. For the most part, treatment of the eye conditions consists of visual rehabilitation. Surgery is possible on the extra-ocular muscles to decrease strabismus."}, {"url": "http://www.cancerresearchuk.org/about-cancer/type/skin-cancer/about/skin-cancer-risks-and-causes", "passage_text": "Most skin cancers are caused by exposure to the sun. There are 2 main types of non melanoma skin cancer, basal cell carcinoma (BCC) and squamous cell carcinoma (SCC). A history of sunburn increases the risk of BCC. Risk is especially high if you had several episodes of sunburn in childhood. "}]