[{"url": "http://thefishingadvice.com/what-is-abalone/", "passage_text": "What is Abalone. An abalone is a rock clinging, single-shelled creature that inhabits shoreline waters (especially where there are concentrations of rocks and kelp) all along the Northern California Coast. It has a large, fleshy foot and sensory projections on its underside. More from Wikipedia. The basic technique is to comb an area looking for abalone attacked to rocks. Often it is best to feel under water in crevices and cracks that other rock pickers have missed. Free divers operate in the water. The wise ones in pairs take turns diving down to rocky bottoms in 5-30 feet of water."}, {"url": "http://www.wisegeek.org/what-is-abalone.htm", "passage_text": "An abalone is a univalve, meaning that it has one shell, rather than two symmetrical shells, like with clams and oysters. The shell is a slightly flatted whorl, resembling an ear, with a slightly elevated apex at the center of the spiral. Someone told me to get a natural abalone shell (unpolished), put something inside the shell and it would make a cream that would minimize the scarring and decolor them. Well, I did it, the shell made the cream and it worked wonders. Problem is, I can't remember what it was I put in the shell to have it make a cream."}, {"url": "http://www.sea-ex.com/fishphotos/AbaloneBlk.htm", "passage_text": "Belonging to the family of molluscs, abalone are large marine snails or gastropods with a hard ear-shaped shell and a muscular foot which inhabit Australia's rocky shorelines, from shallow water up to depths of forty or sometimes 50 metres. Abalone is an edible mollusc. Endemic to Australia. It is considered a delicacy. "}, {"url": "http://www.thefreedictionary.com/abalone", "passage_text": "abalone. n. 1. (Animals) any of various edible marine gastropod molluscs of the genus Haliotis, having an ear-shaped shell that is perforated with a row of respiratory holes. The shells are used for ornament or decoration. "}, {"url": "http://www.wikihow.com/Dive-for-Abalone", "passage_text": "Know what an abalone looks like(or is). An abalone is a huge snail that lives on the rocks in the shallows of the ocean. Most abalone have hard shells and are approximately 7 to 9 inches (17.8 to 22.9 cm) wide. Most rarely grow to over 11 inches (27.9 cm) in its life. Diving for abalone is one of a kind experience enjoyed by many on the north coast of California. The use of a scuba tank or any other underwater breathing apparatus is not used; all the fun lies when you must get them by diving while holding your breath."}, {"url": "http://www.merriam-webster.com/dictionary/abalone", "passage_text": "Full Definition of ABALONE. : any of a genus (Haliotis) of edible rock-clinging gastropod mollusks that have a flattened shell slightly spiral in form, lined with mother-of-pearl, and with a row of apertures along its outer edge. See abalone defined for English-language learners. See abalone defined for kids. ADVERTISEMENT"}, {"url": "http://www.wisegeek.org/what-is-abalone.htm", "passage_text": "These 10 facts about space will blow your mind. The abalone is a gastropod found in most of the oceans in the world and prized as a culinary treat among the Japanese and residents of the West Coast of the United States, among others. Someone told me to get a natural abalone shell (unpolished), put something inside the shell and it would make a cream that would minimize the scarring and decolor them. Well, I did it, the shell made the cream and it worked wonders. Problem is, I can't remember what it was I put in the shell to have it make a cream."}, {"url": "http://www.answers.com/Q/What_is_abalone", "passage_text": "Abalone is a type of shellfish, a gastropod mollusc. It is eaten and considered a delicacy in many parts of the world. In New Zealand it is known by the Maori word 'Paua'. The inside of a paua shell is brilliantly coloured with iridescent blues, greens and pinks. Abalones eat clam chowder. supplement. In New Zealand, the Paua, our local abalone with a green-blue shell, feed on algae and slimes on the rocks. They live mainly near the ti … dal zone, for that is where the algae get enough sunlight to do their thing."}, {"url": "https://en.wikipedia.org/wiki/Abalone", "passage_text": "The shell of abalones is convex, rounded to oval shape, and may be highly arched or very flattened. The shell of the majority of species is ear-shaped, presenting a small, flat spire and two to three whorls. Abalone are mostly taken in depths from a few inches up to 10 m (33 ft); less common are freedivers who can work deeper than 10 m (33 ft). Abalone are normally found on rocks near food sources such as kelp. An abalone iron is used to pry the abalone from the rock before it can fully clamp down."}]