[{"url": "http://www.healthline.com/health/cold-flu/contagious", "passage_text": "The flu is contagious a day before and five days to a week after its onset. Young children, people over 65, those with compromised immune systems, and people with a terminal illness are at risk of death from the flu. Pregnant women are also at greater risk. The flu can also cause premature birth. "}, {"url": "http://answers.webmd.com/answers/2000021/how-long-is-someone-with-the-flu-contagious", "passage_text": "A. THe CDC says 'Most healthy adults may be able to infect others beginning 1 day before symptoms develop and up to 5 to 7 days after becoming sick. Children may pass the virus for longer than 7 days.'. Remember that some people who get the flu may not have symptoms and can spread the virus too. 18 Followers. A. You may be able to pass on the flu to someone else before you know you are sick, as well as while you are sick. Most healthy adults may be able to infect others beginning 1 day before symptoms develop and up to 5 to 7 days after becoming sick."}, {"url": "http://abcnews.go.com/Health/ColdandFluQuestions/story?id=5678572", "passage_text": "Answer: The tricky thing about flu viruses and viruses in general -- you yourself can actually be contagious a whole day prior to developing symptoms. And you can be contagious up to five days once you've developed symptoms. "}, {"url": "http://www.livestrong.com/article/16107-long-flu-virus-contagious/", "passage_text": "Flu Contagious Period. Flu starts being contagious about 24 hours before you have symptoms. You're most contagious when you first get sick and for the following 2 to 3 days. The severity of your symptoms correlates to how many new viruses are being produced, so you're less contagious as you start to feel better. Most people stop being infectious approximately 5 to 7 days after getting sick, but you can remain contagious for as long as 10 days."}, {"url": "http://www.mayoclinic.org/diseases-conditions/viral-gastroenteritis/expert-answers/stomach-flu/faq-20057899", "passage_text": "1 Rotavirus. 2  Symptoms of rotavirus — the leading cause of viral gastroenteritis in infants and young children — usually appear one to three days after exposure. 3  But you're contagious even before you develop symptoms, and up to two weeks after you've recovered. 1 Some people may be contagious for up to two weeks after recovery. 2  Rotavirus. 3"}, {"url": "http://health.howstuffworks.com/diseases-conditions/cold-flu/contagious.htm", "passage_text": "For the flu, the contagious period then lasts five to seven days into the illness. For children, the contagious period for the flu can last up to two weeks after they start feeling sick, even if they start feeling better before that. The contagious period for a cold lasts about three to four days into the illness. As a general rule, people with a cold are most contagious about three days after their initial exposure to the virus. For more information on colds, influenza and related topics, check out the links on the next page."}, {"url": "http://www.mayoclinic.org/diseases-conditions/viral-gastroenteritis/expert-answers/stomach-flu/faq-20057899", "passage_text": "You can be contagious from a few days up to two weeks or more, depending on which virus is causing your stomach flu (gastroenteritis). A number of viruses can cause gastroenteritis, including noroviruses and rotaviruses. 1 Some people may be contagious for up to two weeks after recovery. 2  Rotavirus. 3  Symptoms of rotavirus — the leading cause of viral gastroenteritis in infants and young children — usually appear one to three days after exposure."}, {"url": "http://www.cdc.gov/flu/about/disease/spread.htm", "passage_text": "The Flu Is Contagious. Most healthy adults may be able to infect other people beginning 1 day before symptoms develop and up to 5 to 7 days after becoming sick. Children may pass the virus for longer than 7 days. Symptoms start 1 to 4 days after the virus enters the body. That means that you may be able to pass on the flu to someone else before you know you are sick, as well as while you are sick. Some people can be infected with the flu virus but have no symptoms. People with flu can spread it to others up to about 6 feet away. Most experts think that flu viruses are spread mainly by droplets made when people with flu cough, sneeze or talk. These droplets can land in the mouths or noses of people who are nearby or possibly be inhaled into the lungs."}, {"url": "http://www.cdc.gov/flu/about/qa/disease.htm", "passage_text": "Children may pass the virus for longer than 7 days. Symptoms start 1 to 4 days after the virus enters the body. Information about how long a person is contagious is available at How Flu Spreads. Fever, chills, fatigue, body aches, sore throat, and headache are common symptoms of flu. Not everyone with flu will have a fever. The flu can cause mild to severe illness, and at times can lead to death. The flu is different from a cold. The flu usually comes on suddenly."}]