[{"url": "http://themodcabin.com/growing-a-beard/", "passage_text": "You can use Beard Oil to help reduce the itching. Make sure you use a beard oil containing Jojoba, Coconut and Argan oils like The Mod Cabin’s Stirner Beard Oil. Jojoba and Argan strengthen and moisturize your beard and promote beard growth. Coconut oil moisturizes the skin under your beard and helps prevent itching."}, {"url": "http://www.growabeardnow.com/facial-hair-growth/", "passage_text": "Actually, women grow facial hair too. Like men, women have facial hair, but the strands are very light and are barely noticed. When a boy reaches puberty, his hair starts to grow thick and dark. The adolescent stage brings a lot of physical changes in men, including facial hair growth."}, {"url": "http://www.boldsky.com/beauty/men-fashion/2014/faster-beard-growth-tips.html", "passage_text": "A diet high in protein, with less stress and more sleep can help you grow a faster beard. Protein gives your body the right nutrients to grow more hair, and sleep is the necessary time to put it all into place. Drinking the recommended eight glasses of water a day will help keep the growth thick and healthy."}, {"url": "http://www.growabeardnow.com/facial-hair-growth/", "passage_text": "1 This natural oil for facial hair growth is a mixture of vitamins and minerals designed to stimulate hair growth including facial hair. 2  It smells amazing, which is why it is often used as a purfume or cologne. 3  Before applying the oil, wash face to clear impurities."}, {"url": "http://www.malestandard.com/how-to-make-your-beard-grow-faster/", "passage_text": "Growing a beard can be one of life’s secret joys; even a token accomplishment. Not all men find it easy to grow plums of facial hair, but there are a few things you can do to help. While the rate and thickness of growth you produce will be dependent on your age and genetics, one thing all men lack is patience."}, {"url": "http://themodcabin.com/beard-oil-for-fast-beard-growth/", "passage_text": "Although nothing can change the rate at which your hair grows, beard oils containing unrefined jojoba and pure argan oil help create the conditions for healthy growth, which means less breakage so your beard will appear thicker and longer faster."}, {"url": "http://www.growabeardnow.com/facial-hair-growth/", "passage_text": "1 Firdaus oil. 2  This natural oil for facial hair growth is a mixture of vitamins and minerals designed to stimulate hair growth including facial hair. 3  It smells amazing, which is why it is often used as a purfume or cologne. 4  Before applying the oil, wash face to clear impurities."}, {"url": "http://themodcabin.com/beard-oil-for-fast-beard-growth/", "passage_text": "Beard oils containing unrefined jojoba and pure argan oil promote beard growth by naturally moisturizing the skin underneath your beard. This removes unwanted dead skin cells and other impediments to fast facial hair growth."}, {"url": "http://www.growabeardnow.com/facial-hair-growth/", "passage_text": "Why Do Men Grow Facial Hair. — “A man doesn’t grow a beard, the beard grows a man”. Among the typical secondary sex characteristics in males is facial hair growth. Beards can start appearing as early as fourteen years of age, or it can take a man until his early twenties, or even later."}]