[{"url": "https://en.wikipedia.org/wiki/Polyolefin", "passage_text": "A polyolefin is any of a class of polymers produced from a simple olefin (also called an alkene with the general formula C n H 2n) as a monomer. For example, polyethylene is the polyolefin produced by polymerizing the olefin ethylene. Polypropylene is another common polyolefin which is made from the olefin propylene. Polyolefin properties range from liquidlike to rigid solids, and are primarily determined by their molecular weight and degree of crystallinity. Polyolefin degrees of crystallinity range from 0% (liquidlike) to 60% or higher (rigid plastics)."}, {"url": "https://en.wikipedia.org/wiki/Polyolefin", "passage_text": "Polyolefin elastomer POE is used as a main ingredient in the molded flexible foam technology such as in the fabrication of self skinned footwear (for example, Crocs shoes), seat cushions, arm rests, spa pillows, etc. Hydrogenated polyalphaolefin (PAO) is used as a radar coolant. Polyolefin properties range from liquidlike to rigid solids, and are primarily determined by their molecular weight and degree of crystallinity. Polyolefin degrees of crystallinity range from 0% (liquidlike) to 60% or higher (rigid plastics)."}, {"url": "http://www.wisegeek.org/what-is-polyolefin.htm", "passage_text": "These 10 animal facts will amaze you. Polyolefin is the largest class of organic thermoplastic polymers. They are non-polar, odorless, nonporous materials that are often used in consumer goods, structural plastics, food packaging and industrial products. As a result, they are also called commodity thermoplastics.. The name means oil-like, and refers to the oily or waxy texture of this class of plastic resins. This class of polymers is more commonly referred to as polyalkene, although polyolefin is still a common term in organic chemistry and the petrochemical industry."}, {"url": "http://www.cirfs.org/ManmadeFibres/Fibrerange/Polyolefins.aspx", "passage_text": "There are two polyolefin polymers used to make synthetic fibres, polypropylene and polyethylene, with polypropylene being by far the most important. Properties and End-Uses. Both polyolefin fibres have a density less than 1.0 and therefore, at a given decitex, are thicker than other man-made fibres and give more cover. They do not absorb moisture, which is an advantage in many end-uses, but without modification, they cannot be dyed."}, {"url": "https://en.wikipedia.org/wiki/Olefin_fiber", "passage_text": "Olefin fiber is a synthetic fiber made from a polyolefin, such as polypropylene or polyethylene. It is used in wallpaper, carpeting, ropes, and vehicle interiors. Olefin's advantages are its strength, colourfastness and comfort, its resistance to staining, mildew, abrasion, sunlight and its good bulk and cover. "}, {"url": "http://www.castercity.com/polyolefinw.htm", "passage_text": "Polyolefin Caster Wheels are injection molded from a blend of thermoplastic polymers forming a one piece solid sanitary design. These Polyolefin wheels, as with Nylon wheels, are especially suited for wet and corrosive applications. They are very resistant to most commonly encountered liquids. These Extra Heavy Polyolefin wheels are comparable to Nylon wheels in load capacity. They are also especially suited for wet and corrosive applications. Extra Heavy Duty Polyolefin wheels are standard with Non-Stainless Precision Sealed Ball Bearings (PS) and Stainless Precision Sealed Ball Bearings (SPS)."}, {"url": "http://www.tech-faq.com/polyolefin.html", "passage_text": "One of the largest classes of organic thermoplastic polymers is polyolefin. Polyolefin is an odorless, non-polar, and non-porous material that is used in structural plastics, consumer goods, industrial products, and food packaging. Polyolefin means “oil like” and is commonly referred to as a thermoplastic or polyalkene since polyolefin has a waxy texture. It retains its nonporous and odorless properties when cooled or heated, making it popular in the food packaging industry. Shrink wrap is also used to wrap consumer electronics and compact discs since it keeps the electronics relatively free of dust, static, and moisture."}, {"url": "http://www.tech-faq.com/polyolefin.html", "passage_text": "Polyolefin Use in Shrink Wrap. Plastic shrink wrap is the lay term for polyolefin. Shrink wrap is designed to expand when heated to lower relative temperatures than other thermoplastics. It retains its nonporous and odorless properties when cooled or heated, making it popular in the food packaging industry. Shrink wrap is also used to wrap consumer electronics and compact discs since it keeps the electronics relatively free of dust, static, and moisture."}, {"url": "http://www.wisegeek.org/what-is-polyolefin.htm", "passage_text": "Polyolefin may refer to plastic shrink wrap. Polyethylene, a type of polyolefin, is often used in plastic grocery bags. Polybutene, a type of polyolefin, is often used in lipsticks. Polyolefin materials are widely used to make plastic bottles for milk, soda and other beverages. The name means oil-like, and refers to the oily or waxy texture of this class of plastic resins. This class of polymers is more commonly referred to as polyalkene, although polyolefin is still a common term in organic chemistry and the petrochemical industry."}, {"url": "http://www.wisegeek.org/what-is-polyolefin.htm", "passage_text": "Polyolefin is also used in packaging of higher-end consumer goods like CDs or electronics as it keeps the goods safe from moisture, dust, and static. At the molecular level, these substances are created by the polymerization of a simple olefin. The name means oil-like, and refers to the oily or waxy texture of this class of plastic resins. This class of polymers is more commonly referred to as polyalkene, although polyolefin is still a common term in organic chemistry and the petrochemical industry."}]