[{"url": "http://guidetooilpainting.com/gesso.html", "passage_text": "Gesso Comes First. Gesso is painted onto the canvas to seal and prime it before the oil paint is applied. The linseed oil in oil paint will deteriorate an unprimed canvas. Gesso is the preferred sealer for the porous canvas. It is an isolating layer between the canvas and the paint. "}, {"url": "http://willkempartschool.com/how-to-prime-a-canvas-with-gesso-for-an-acrylic-painting/", "passage_text": "Gesso is the same as a primer, as in ‘pre-primed canvas’. It is made from a combination of paint pigment, chalk and binder. Traditional Oil ‘ glue gesso ’ was made with an animal glue binder, usually rabbit-skin glue, chalk, and white pigment, usually Titanium white. Modern acrylic gesso is a combination of calcium carbonate (chalk) with an acrylic polymer medium (binder), a pigment (titanium white) and other chemicals that ensure flexibility, and ensure long archival life."}, {"url": "http://thefeatherartist.com/what-is-gesso/", "passage_text": "A bit of background on the stuff: Gesso (jeh-so) is actually the Greek word for “ground chalk.” (gypsum). Acrylic gesso is a mixture of different materials (latex/calcium carbonate/pigment/etc) usually sold in a premixed form and is used to prime/prep surfaces for acrylic and oil painting. (However, please keep in mind that it is NOT a sealant. "}, {"url": "https://en.wikipedia.org/wiki/Gesso", "passage_text": "Traditional gesso [edit].  Gesso , also known glue gesso or Italian gesso is a traditional mix of an animal glue binder (usually rabbit-skin glue), chalk, and white pigment, used to coat rigid surfaces such as wooden painting panels as an absorbent primer coat substrate for painting. Gesso (. [ˈdʒɛsso] ;  chalk , from the Latin: gypsum, from Greek: γύψος) is a white paint mixture consisting of a binder mixed with chalk, gypsum, pigment, or any combination of these."}, {"url": "http://www.art-is-fun.com/what-is-gesso", "passage_text": "Gesso is an important art supply to get your canvas ready for painting. You can buy gesso readymade from any art supply shop. Gesso is very similar to white acrylic paint, only thinner. It dries hard, making the surface more stiff. Gesso prepares (or primes) the surface for painting, making the surface slightly textured and ready to accept acrylic paint. Without gesso, the paint would soak into the weave of the canvas. The word gesso is a noun, but many artists also use it as a verb. For example: You need to gesso your canvas before you paint.. The beauty of gesso is that you can apply it to nearly any surface, and then you can paint on that surface with acrylic paint"}, {"url": "http://www.liquitex.com/gesso/", "passage_text": "Liquitex Gesso is a premium acrylic gesso used to prepare painting surfaces for acrylic and oil paint. 1  Non-yellowing. 2  Flexible and non-cracking. 3  Provides the perfect tooth and adhesion to a wide variety of surfaces such as canvas, paper and wood. 4  Excellent base coat primer for many applications for example murals. Sheen: Matte. Relative Opacity: Opaque. "}, {"url": "http://www.artistsjournals.com/instruction/gesso.htm", "passage_text": "Artists put it on canvas, wood, or other surfaces before creating a painting with oil paint or acrylics. Gesso makes the surface a little stiffer. It prevents paint from soaking into the support (canvas, paper, wood, etc.), and it gives the surface a little more texture (called tooth), so the paint sticks better. what it is and how to use it. Gesso is a useful option for art journaling. It's also used for painting and mixed media art. I use gesso often. However, many (perhaps most) artists never use gesso in their journals."}, {"url": "https://answers.yahoo.com/question/index?qid=20070622194823AAWeNKs", "passage_text": "Gesso is made from ground marble dust. Some acrylic painters besides using it for canvas surface prep will mix it with their acrylic paints. It has a sort of chalky effect and makes the painting a bit out of focus. If you have a canvas that has gesso on it, you will see it labeled either portrait or regular canvas. Gesso is a thick white pigment designed to cover untreated and unprimed canvas. The gesso has two purposes. The first is to cover the unprimed canvas so that the paint you apply does not bleed through the canvas. The second purpose is to 'smooth out' the painting surface so that your canvas will have a smooth painting area to work on. Untreated canvas is rough and very porou"}]