[{"url": "http://www.wikihow.com/Build-a-Metal-Melting-Furnace-for-Casting", "passage_text": "Melting aluminum, brass, or other mid-temperature melting point metals requires over 1000 degree temperatures. To build a simple home made furnace for casting metals you need to meet some simple design requirements and use appropriate materials. "}, {"url": "http://www.wikihow.com/Melt-Brass", "passage_text": "Three Parts: Setting up a furnace Following safe practices Melting the brass. Brass has a relatively low melting point compared to iron, steel, or gold, but it still requires a special furnace. Many beginning metalworking hobbyists start out with aluminum, which is easier to melt, but brass is often the next step. Most brass will melt at temperatures as low as 1,650ºF (900ºC), but a higher maximum temperature will give you a margin of error, and make the brass easier to pour. 1  Select a furnace large enough to hold the crucible and brass you intend to melt. 2  Consider the fuel you will be using."}, {"url": "http://www.engineeringtoolbox.com/melting-temperature-metals-d_860.html", "passage_text": "Melting temperature of some common metals and alloys. Melting point is the temperature at which a substance changes from solid to liquid state. Melting points for some metals and alloys are indicated below. "}, {"url": "https://en.wikipedia.org/wiki/Melting_point", "passage_text": "Not to be confused with protein melting temperature, Tm, the temperature at which 50% unfolding occurs. The melting point (or, rarely, liquefaction point) of a solid is the temperature at which it changes state from solid to liquid at atmospheric pressure. At the melting point the solid and liquid phase exist in equilibrium. The melting point of a substance depends on pressure and is usually specified at standard pressure. When considered as the temperature of the reverse change from liquid to solid, it is referred to as the freezing point or crystallization point. Many laboratory techniques exist for the determination of melting points. A Kofler bench is a metal strip with a temperature gradient (range from room temperature to 300 °C). Any substance can be placed on a section of the strip revealing its thermal behaviour at the temperature at that point."}, {"url": "https://en.wikipedia.org/wiki/Brass", "passage_text": "Brass is a metal alloy made of copper and zinc; the proportions of zinc and copper can be varied to create a range of brasses with varying properties. It is a substitutional alloy: atoms of the two constituents may replace each other within the same crystal structure. To enhance the machinability of brass, lead is often added in concentrations of around 2%. Since lead has a lower melting point than the other constituents of the brass, it tends to migrate towards the grain boundaries in the form of globules as it cools from casting."}, {"url": "http://www.answers.com/Q/What_is_the_melting_point_of_brass", "passage_text": "Not all brass is made the same way. The melting point of red brass  is 1,832 degrees Fahrenheit. The melting point of yellow brass is  1,660-1,710 degrees Fahrenheit, and th … e melting point of admiralty  brass is 1,650-1,720 degrees Fahrenheit. Answered. In Temperature. Brass consists of copper and zinc ordinary yellow brass, 67% - 33% respectively, MP= 940C, 1213K, 1724F ordinary red brass, 90% - 10% resp., MP= 1050C, 1323K, 1922F othe … r forms are in between."}, {"url": "https://en.wikipedia.org/wiki/Brass", "passage_text": "Brass has higher malleability than bronze or zinc. The relatively low melting point of brass (900 to 940 °C, 1652 to 1724 °F, depending on composition) and its flow characteristics make it a relatively easy material to cast. To enhance the machinability of brass, lead is often added in concentrations of around 2%. Since lead has a lower melting point than the other constituents of the brass, it tends to migrate towards the grain boundaries in the form of globules as it cools from casting."}, {"url": "http://metals.about.com/od/properties/a/Metal-Profile-Brass.htm", "passage_text": "Due to its low melting point, brass can also be cast relatively easily. However, for casting applications, a high zinc content is usually preferred. Brasses with a lower zinc content can be easily cold worked, welded and brazed. "}, {"url": "http://www.ehow.com/how_4494411_melt-brass.html", "passage_text": "Ilya Stcherbakov/iStock/Getty Images. 1,688 degrees Fahrenheit is an extremely hot temperature; however, in metallurgy it is considered a low melting point. Compared to iron's melting point -- 2,786 degrees Fahrenheit -- the average melting point of brass at 1,688 makes it a low-melting alloy. Load the crucible with the brass that you would like to melt down. Use a crucible that is made from a clay-graphite mix, as metal crucibles may melt during the process. Lower the crucible into the furnace with a pair of tongs."}]