[{"url": "http://smallbusiness.findlaw.com/employment-law-and-human-resources/pros-and-cons-of-written-employee-contracts.html", "passage_text": "As an employer, you should be aware of the various factors to consider when thinking about employee contracts. To sum it up, an employment contract is a document that both you and your employee sign that dictates the terms of your professional relationship. There is no requirement that you have to enter into a written employee contract with every employee that you have. However, there are other terms that you can include in an employment contract, such as: 1  The term of employment (A period of months or years, until the completion of a project, or indefinitely), 2  Terms relating to the responsibilities of the employee,"}, {"url": "https://en.wikipedia.org/wiki/Employment_contract", "passage_text": "(October 2012). An employment contract or contract of employment is a kind of contract used in labour law to attribute rights and responsibilities between parties to a bargain. The contract is between an employee and an employer.. It has arisen out of the old master-servant law, used before the 20th century. But generally, the contract of employment denotes a relationship of economic dependence and social subordination."}, {"url": "http://www.nolo.com/legal-encyclopedia/written-employment-contracts-pros-cons-30193.html", "passage_text": "A written employment contract is a document that you and your employee sign setting forth the terms of your relationship. You don't have to enter into a written contract with every employee you hire. In fact, written employment contracts are generally the exception, rather than the rule. Disadvantages. An employment contract is not a one-way street. The contract binds both you and the employee, so it limits your flexibility. This may pose a problem if you later decide that you don't like the contract terms or the needs of your business change."}, {"url": "http://work.chron.com/constitutes-valid-employment-agreement-2098.html", "passage_text": "A legally binding employment agreement between an employer and employee outlines the terms or conditions of employment. Definition. An employment contract can be verbal, written or both to be valid. The agreement can be either explicit or implied. With an implied contract there may be no formal agreement in writing that an employee signs, but an employer’s promises can be binding all the same."}, {"url": "http://www.lawdepot.com/contracts/employment-contract/?loc=US", "passage_text": "An employment contract is a legally binding document that sets out the expectations, rights, and obligations that will govern the relationship between an employee and employer. "}, {"url": "http://www.cipd.co.uk/hr-resources/factsheets/contracts-of-employment.aspx", "passage_text": "A contract of employment is an agreement between an employer and employee which is legally binding. The term is defined by the Employment Rights Act 1996 as a contract of service or apprenticeship. Employment contracts consist of a mixture of express and implied terms. "}, {"url": "http://formswift.com/employment-contract", "passage_text": "An employment contract is a legal document that establishes the rights and responsibilities of two parties – the employer and the employee. It is general drawn up at the time of hire and serves as a binding set of guidelines for the duration of the employment. Sometimes, an employer may ask an employee to sign an “at-will” agreement; however, as the tenets of “at-will” employment are fairly basic, this agreement is usually simply a clause of a signed offer letter or employee handbook, rather than a separate contract."}, {"url": "http://www.acas.org.uk/index.aspx?articleid=1577", "passage_text": "1 A contract of employment is an agreement between an employer and employee and is the basis of the employment relationship. 2  Most employment contracts do not need to be in writing to be legally valid, but it is better if they are. 3  A contract 'starts' as soon as an offer of employment is accepted. "}, {"url": "http://formswift.com/employment-contract", "passage_text": "An employment contract is used in the workplace as an agreement between an employee and an employer. The contract can cover several different aspects of a job, such as wages, holidays, sick time, and benefits. An employment contract helps to protect the rights of the employee while also detailing what the employer is obligated to provide. Sometimes, an employer may ask an employee to sign an “at-will” agreement; however, as the tenets of “at-will” employment are fairly basic, this agreement is usually simply a clause of a signed offer letter or employee handbook, rather than a separate contract."}]