[{"url": "http://www.timeanddate.com/time/change/australia/hobart", "passage_text": "Apr 5, 2015 - Daylight Saving Time Ended. When local daylight time was about to reach. Sunday, April 5, 2015, 3:00:00 AM clocks were turned backward 1 hour to. Sunday, April 5, 2015, 2:00:00 AM local standard time instead. Sunrise and sunset was about 1 hour earlier on Apr 5, 2015 than the day before. There was more light in the morning. Also called Fall Back and winter time."}, {"url": "http://www.dpac.tas.gov.au/divisions/policy/daylightsaving", "passage_text": "Western Australia, Queensland and the Northern Territory do not observe daylight saving. For the daylight saving periods from 2013-14 to 2017-18, the start and finish dates for Tasmania, New South Wales, Victoria, the ACT and South Australia are as follows: Period. Start Date (2 am on the first Sunday in October)*. Finish Date (2 am on the first Sunday in April)*"}, {"url": "http://www.dpac.tas.gov.au/divisions/policy/daylightsaving", "passage_text": "The clocks go back. Daylight saving in Tasmania commences at 2 am on the first Sunday in October each year, and people should put their clocks forward by one hour at this time. It concludes at 2 am on the first Sunday in April the following year, at which time people should put their clocks back by one hour. For the daylight saving periods from 2013-14 to 2017-18, the start and finish dates for Tasmania, New South Wales, Victoria, the ACT and South Australia are as follows:"}, {"url": "http://www.timetemperature.com/australia/australia_daylight_saving_time.shtml", "passage_text": "At the end of Daylight Saving Time turn your clocks back one hour. Australia daylight saving time begins on the first Sunday in October at 2 AM Eastern Standard Time and ends on the first Sunday in April at 2 AM Eastern Standard Time (3 AM Daylight Saving Time). Daylight Saving Time is not used in the Northern Territory, Queensland and Western Australia. Western Australia used Daylight Saving Time is in a trial period which began on 3 December, 2006, however, in May 2009 a referendum was held in Western Australia and voters rejected the continued use of daylight saving time."}, {"url": "http://www.nsw.gov.au/about-nsw/daylight-saving", "passage_text": "Daylight saving begins in NSW on Sunday, 4 October 2015 when clocks go forward one hour at 2:00am. For future summers, daylight saving in NSW begins at 2:00 am, Eastern Standard Time, on the first Sunday in October and ends at 3:00am Eastern Daylight Saving Time on the first Sunday in April. Key Contacts. 1  For 24 hour recorded message call: (02) 8688 7966. 2  For all other related queries call: (02) 8688 7586"}, {"url": "http://www.abc.net.au/news/2014-10-05/clocks-wound-forward-as-daylight-saving-begins/5790986", "passage_text": "Map: ACT. Clocks in eastern and southern Australia have been wound forward one hour for daylight saving. People living in New South Wales, Victoria, South Australia, Tasmania and the Australian Capital Territory lost an hour of sleep when clocks were advanced at 2:00am. Daylight Saving Time will end on April 5, 2015, at 3:00am (DST), when clocks are wound back an hour. Queensland, Western Australia and the Northern Territory do not observe daylight saving. Take a look at our table to see how daylight saving affects time differences across the country"}, {"url": "http://www.timeanddate.com/time/change/australia/hobart", "passage_text": "Sunday, October 4, 2015, 2:00:00 AM clocks were turned forward 1 hour to. Sunday, October 4, 2015, 3:00:00 AM local daylight time instead. Sunrise and sunset was about 1 hour later on Oct 4, 2015 than the day before. There was more light in the evening. Also called Spring Forward, summer time, and Daylight Savings Time. Sunday, April 5, 2015, 3:00:00 AM clocks were turned backward 1 hour to. Sunday, April 5, 2015, 2:00:00 AM local standard time instead. Sunrise and sunset was about 1 hour earlier on Apr 5, 2015 than the day before. There was more light in the morning. Also called Fall Back and winter time."}, {"url": "http://www.australia.gov.au/about-australia/facts-and-figures/time-zones-and-daylight-saving", "passage_text": "Daylight saving is not observed in Queensland, the Northern Territory or Western Australia. Daylight Saving Time begins at 2am on the first Sunday in October, when clocks are put forward one hour. It ends at 2am (which is 3am Daylight Saving Time) on the first Sunday in April, when clocks are put back one hour."}, {"url": "http://www.australia.gov.au/about-australia/facts-and-figures/time-zones-and-daylight-saving", "passage_text": "Daylight saving. Daylight Saving Time (DST) is the practice of advancing clocks one hour during the warmer months of the year. In Australia, Daylight saving is observed in New South Wales, Victoria, South Australia, Tasmania, and the Australian Capital Territory. Daylight Saving Time begins at 2am on the first Sunday in October, when clocks are put forward one hour. It ends at 2am (which is 3am Daylight Saving Time) on the first Sunday in April, when clocks are put back one hour."}]