[{"url": "http://classroom.synonym.com/social-political-economic-effects-reconstruction-era-6164.html", "passage_text": "Reconstruction was the period following the Civil War in which the national government attempted to reintegrate the Southern states that had formed the Confederacy back into the United States. From 1865, when the war ended, until 1877, the national government worked to establish order in the South. Incensed over the Black Codes, Congress began its own Reconstruction in 1866. The Fourteenth Amendment, ratified on July 9, 1868, was an essential part of this period. This Amendment made anyone born in the United States a citizen of the nation and his state."}, {"url": "http://www.loc.gov/teachers/classroommaterials/lessons/reconstruction/studentindex.html", "passage_text": "Section 1. When Reconstruction ended in 1877, African Americans in the South faced many of the problems they had faced since Emancipation. Some of these problems were getting worse, and new problems were gaining importance. In your group: 1  Brainstorm a list of new and intensifying problems African Americans in the South faced after Reconstruction. 2  Use what you know about conditions during Reconstruction and racial attitudes in the region to develop ideas. 3  Record your ideas on a piece of paper"}, {"url": "http://www.answers.com/Q/What_where_some_economic_problems_facing_the_south_during_reconstruction", "passage_text": "Actually, the fact that slaves were freed due to the ratification of the 13 Amendment, caused many southern whites to discourage the reconstruction that the North had pl … anned. Some of these problems included land distribution, military location in the south, and the prevention of black intimidation. "}, {"url": "http://www.answers.com/Q/What_economic_problem_did_the_south_face_during_reconstruction", "passage_text": "Actually, the fact that slaves were freed due to the ratification of the 13 Amendment, caused many southern whites to discourage the reconstruction that the North had pl … anned. Some of these problems included land distribution, military location in the south, and the prevention of black intimidation. "}, {"url": "http://www.digitalhistory.uh.edu/exhibits/reconstruction/introduction.html", "passage_text": "Reconstruction, one of the most turbulent and controversial eras in American history, began during the Civil War and ended in 1877. It witnessed America's first experiment in interracial democracy. "}, {"url": "http://www.socialstudieshelp.com/Lesson_37_Notes.htm", "passage_text": "The end of the Civil War and the Reconstruction of the South attempted to address some of the social concerns of the freed slaves but in reality could do very little to make blacks economically and politically equal to whites. In fact, there was never any intention of making blacks equal. 1. Freedmen's Bureau-created as a part of the Reconstruction Act, it was a Federal agency designed to provide food, clothes and shelter for freed slaves and whites in need."}, {"url": "https://answers.yahoo.com/question/index?qid=20120402114818AAclhij", "passage_text": "Best Answer: The years following the Civil War between 1865-1877 are known as reconstruction. The reason historians use the term Reconstruction is because this was the period when the federal government restored the seceded states to the Union. This proved to be a difficult and contentious process."}, {"url": "https://answers.yahoo.com/question/index?qid=20120402114818AAclhij", "passage_text": "4.Passage of Reconstruction Acts that made restoration to the Union more difficult. State Readmitted Seven states were readmitted to the Union in 1868. When Congress prepared the 15th Amendment in 1868, it required the rest of the states to ratify this amendment to be readmitted. All states were eventually readmitted by 1870. Learn more about Reconstruction, Carpetbaggers, and Scalawags. The reason historians use the term Reconstruction is because this was the period when the federal government restored the seceded states to the Union. This proved to be a difficult and contentious process."}, {"url": "https://answers.yahoo.com/question/index?qid=20110526122213AAFir4G", "passage_text": "Best Answer: 1) The destruction of property during the war. The Civil War mainly took place in the Confederacy and the vast majority of battle damage was in the South. 6) The lack of industry and railroads. And, this is not a repeat of the first point, but even without the Civil War, the South would have had economic issues relating to manufacturing capability. Before the Civil War, the North had 90 percent of the nation's manufacturing capacity, and almost all of its heavy industry."}, {"url": "http://classroom.synonym.com/social-political-economic-effects-reconstruction-era-6164.html", "passage_text": "The first, referred to as Presidential Reconstruction, began with the ending of the Civil War. As the commanders-in-chief of the military, President Abraham Lincoln, and then his predecessor, President Andrew Johnson, initiated the return of the Southern states back into full union with the country. Incensed over the Black Codes, Congress began its own Reconstruction in 1866. The Fourteenth Amendment, ratified on July 9, 1868, was an essential part of this period. This Amendment made anyone born in the United States a citizen of the nation and his state."}]