[{"url": "http://www.mineralogy4kids.org/rock-cycle/intrusive-igneous-rocks", "passage_text": "Intrusive Igneous Rocks. Intrusive, or plutonic, igneous rocks form when magma cools slowly below the Earth's surface. Most intrusive rocks have large, well-formed crystals. Examples include granite, gabbro, diorite and dunite. Mineral Photos courtesy of R.Weller/Cochise College. "}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_intrusive_and_extrusive_igneous_rock", "passage_text": "Examples: granite, gabbro, diorite, peridotite. Extrusive rocks are formed from magma at or above the surface of the planet, and generally display smaller mineral crystals, or no crystals at all, because of the rapid cooling environment in which they form. Intrusive igneous rocks is formed from magma that cools, solidifies, crystallizes, and hardens slowly within the earth's crust, and this makes its crystals large."}, {"url": "http://geomaps.wr.usgs.gov/parks/rxmin/rock.html", "passage_text": "Extrusive igneous rock. Extrusive, or volcanic, igneous rock is produced when magma ex its and cools outside of, or very near the Earth's surface. These are the rocks that form at erupting volcanoes and oozing fissures."}, {"url": "http://hyperphysics.phy-astr.gsu.edu/hbase/Geophys/intrus.html", "passage_text": "Intrusive Rocks. Igneous rocks which form by the crystallization of magma at a depth within the Earth are called intrusive rocks. Intrusive rocks are characterized by large crystal sizes, i.e., their visual appearance shows individual crystals interlocked together to form the rock mas"}, {"url": "http://geology.com/rocks/igneous-rocks.shtml", "passage_text": "Igneous rocks are formed from the solidification of molten rock material. There are two basic types. Intrusive igneous rocks crystallize below Earth's surface and the slow cooling that occurs there allows large crystals to form. Examples of intrusive igneous rocks are diorite, gabbro, granite, pegmatite, and peridotite. Extrusive igneous rocks erupt onto the surface where they cool quickly to form small crystals. Some cool so quickly that they form an amorphous glass."}, {"url": "https://en.wikipedia.org/wiki/Igneous_rock", "passage_text": "Igneous rock is formed through the cooling and solidification of magma or lava. Igneous rock may form with or without crystallization, either below the surface as intrusive (plutonic) rocks or on the surface as extrusive (volcanic) rocks. This magma can be derived from partial melts of pre-existing rocks in either a planet's mantle or crust. Intrusive igneous rocks are formed from magma that cools and solidifies within the crust of a planet, surrounded by pre-existing rock (called country rock); the magma cools slowly and, as a result, these rocks are coarse grained. The mineral grains in such rocks can generally be identified with the naked eye."}, {"url": "http://www.archaeology.ncdcr.gov/ncarch/GeoArcheo/IgneousA.htm", "passage_text": "An Extrusive igneous rock cools very fast on the surface and is created by lava. Since the cooling process is very fast extrusive igneous rocks have very small crystals (fine grained). On the other hand an Intrusive igneous rock cools very slowly beneath the surface and is created by magma. Since the cooling process is very slow intrusive igneous rocks have very large crystals (coarse grained). In some instances there is also a third type of igneous rock. Technically it is an extrusive rock, but it resembles glass. This glass type of igneous rock forms when magma/lava is instantly cooled."}, {"url": "http://www.answers.com/Q/What_is_the_difference_between_intrusive_and_extrusive_igneous_rock", "passage_text": "Granite is a good example of an intrusive igneous rock. Extrusive rocks cool above the earth's surface and crystallize very quickly, as a result are finer grained. Extrusive rocks are released from the earth in the form of volcanic eruptions, which occur both on the continents and on the ocean floor. Intrusive igneous rocks is formed from magma that cools, solidifies, crystallizes, and hardens slowly within the earth's crust, and this makes its crystals large."}]