[{"url": "http://www.news-medical.net/health/What-is-Staphylococcus-Aureus.aspx", "passage_text": "Staphylococcus aureus is a type of bacteria. It stains Gram positive and is non-moving small round shaped or non-motile cocci. It is found in grape-like (staphylo-) clusters. This is why it is called Staphylococcus. Of the variety of manifestations S. aureus may cause: 1  Minor skin infections, such as pimples, impetigo etc. 2  It may cause boils (furuncles), cellulitis folliculitis, carbuncles. 3  It is the cause of scalded skin syndrome and abscesses."}, {"url": "http://www.healthhype.com/staphylococcus-aureus.html", "passage_text": "Staphylococcus aureus (Gk. staphyle = bunch of grapes; Lat. coccus = spherical bacterium, aureus = golden) or golden staph (pronounced ‘staff’) is the most common species of staphylococcus bacteria causing infections in human. "}, {"url": "https://answers.yahoo.com/question/index?qid=20071023183000AAXrpR8", "passage_text": "This Site Might Help You. RE: Does Staphylococcus aureus have a capsule? When I observed under a microscope I thought I saw capsules but according to a friend&#39;s research, there isn&#39;t any capsules for Staphylococcus aureus."}, {"url": "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC321462/", "passage_text": "Serotype 5 and 8 capsular polysaccharides predominate among clinical isolates of Staphylococcus aureus. The results of experiments in animal models of infection have revealed that staphylococcal capsules are important in the pathogenesis of S. aureus infections. The capsule enhances staphylococcal virulence by impeding phagocytosis, resulting in bacterial persistence in the bloodstream of infected hosts. Opsonization of S. aureus is critical for uptake and killing of the bacterium by professional phagocytic cells. Complement and antibody are the principal serum opsonins and have been shown to play an important role in opsonophagocytic killing of the staphylococcus (69, 87, 116, 117)."}, {"url": "https://en.wikipedia.org/wiki/Staphylococcus_aureus", "passage_text": "S. aureus can cause a range of illnesses, from minor skin infections, such as pimples, impetigo, boils, cellulitis, folliculitis, carbuncles, scalded skin syndrome, and abscesses, to life-threatening diseases such as pneumonia, meningitis, osteomyelitis, endocarditis, toxic shock syndrome, bacteremia, and sepsis. S. aureus is the most common species of Staphylococcus to cause Staph infections and is a successful pathogen due to a combination of nasal carriage and bacterial immunoevasive strategies."}, {"url": "http://schools-wikipedia.org/wp/s/Staphylococcus_aureus.htm", "passage_text": "Staphylococcus aureus is a bacterium that is a member of the Firmicutes, and is frequently found in the human respiratory tract and on the skin. Although S. aureus is not always pathogenic, it is a common cause of skin infections (e.g. boils), respiratory disease (e.g. sinusitis), and food poisoning. S. aureus is the most common species of staphylococcus to cause Staph infections and is a successful pathogen due to a combination of nasal carriage and bacterial immuno-evasive strategies."}, {"url": "http://iai.asm.org/content/73/12/7932.full", "passage_text": "Effect of capsule production on S. aureus virulence in the murine mastitis model. The ordinate represents the log number of CFU of Reynolds (CP −), Reynolds (CP5), and Reynolds (CP8) recovered from the mammary glands at different times after intramammary inoculation with 10 5 (A), 5 × 10 5 (B), or 10 6 (C) CFU/gland. Staphylococcus aureus capsular polysaccharides (CP) have been shown to enhance staphylococcal virulence in numerous animal models of infection. Although serotype 5 CP (CP5) and CP8 predominate among S. aureus isolates from humans, most staphylococcal isolates from bovines with mastitis in Argentina are capsule negative."}, {"url": "https://en.wikipedia.org/wiki/Staphylococcus_aureus", "passage_text": "S. aureus is responsible for many infections, but it may also occur as a commensal. The presence of S. aureus does not always indicate infection. It can survive from hours to weeks, or even months, on dry environmental surfaces, depending on strain. S. aureus is the most common species of Staphylococcus to cause Staph infections and is a successful pathogen due to a combination of nasal carriage and bacterial immunoevasive strategies."}, {"url": "https://en.wikipedia.org/wiki/Staphylococcus_aureus", "passage_text": "Although S. aureus is not always pathogenic, it is a common cause of skin infections such as abscesses, respiratory infections such as sinusitis, and food poisoning. Pathogenic strains often promote infections by producing potent protein toxins, and expressing cell-surface proteins that bind and inactivate antibodies. S. aureus is the most common species of Staphylococcus to cause Staph infections and is a successful pathogen due to a combination of nasal carriage and bacterial immunoevasive strategies."}]