[{"url": "https://www.medicare.gov/part-d/costs/penalty/part-d-late-enrollment-penalty.html", "passage_text": "The late enrollment penalty is an amount added to your Medicare Part D monthly premium. You may owe a late enrollment penalty if you go without Part D or creditable prescription drug coverage for any continuous period of 63 days or more after your Initial Enrollment Period is over. Since the monthly penalty is always rounded to the nearest $0.10, she paid $10.30 each month in addition to her plan’s monthly premium in 2015. Here's the math: .31 (31% penalty) × $33.13 (2015 base beneficiary premium) = $10.27."}, {"url": "https://www.medicaremadeclear.com/about/medicare-eligibility/medicare-penalty", "passage_text": "In most cases, you have to pay the penalty every month for as long as you have Part B. If you’re under 65 and disabled, any Part B penalty ends once you turn 65. The penalty for late enrollment in a Part D plan is 1% of the average Part D premium for each month you delay enrollment. You pay the penalty for as long as you’re enrolled in a Medicare Part D plan. You would pay the penalty for twice the number of years you delay enrollment. If you wait two years, for example, you would pay the additional 10% for four years (2 x 2 years). The penalty applies no matter how long you delay Part A"}, {"url": "https://www.medicare.gov/your-medicare-costs/part-b-costs/penalty/part-b-late-enrollment-penalty.html", "passage_text": "You waited to sign up for Part B until the General Enrollment Period in March 2012. Your Part B premium penalty is 20%. (While you waited a total of 30 months to sign up, this included only 2 full 12-month periods.) You’ll have to pay this penalty for as long as you have Part B. If you have limited income and resources, your state may help you pay for Part A, and/or Part B. You may also qualify for Extra Help to pay for your Medicare prescription drug coverage. Example. Your Initial Enrollment Period ended September 30, 2009."}, {"url": "https://www.medicare.gov/part-d/costs/penalty/part-d-late-enrollment-penalty.html", "passage_text": "Medicare calculates the penalty by multiplying 1% of the national base beneficiary premium ($33.13 in 2015, $34.10 in 2016) times the number of full, uncovered months you didn't have Part D or creditable coverage. The monthly premium is rounded to the nearest $.10 and added to your monthly Part D premium. Since the monthly penalty is always rounded to the nearest $0.10, she paid $10.30 each month in addition to her plan’s monthly premium in 2015. Here's the math: .31 (31% penalty) × $33.13 (2015 base beneficiary premium) = $10.27."}, {"url": "http://www.medicaresolutions.com/medicare/late-enrollment-penalty.aspx", "passage_text": "How Much is the Late Enrollment Penalty for Part B? For every 12-month period you don't enroll in Part B when you're eligible, you'll pay an extra 10% of your monthly premium. If you didn't enroll for two years, for example, you'd pay a penalty of 20% per month. Worst of all, you'll continue to pay that penalty for as long as you have Medicare. You can use Medicare.gov's Part B Late Enrollment Penalty Calculator to get an idea of what you might have to pay."}, {"url": "https://www.medicare.gov/part-d/costs/penalty/part-d-late-enrollment-penalty.html", "passage_text": "$10.30 = Mrs. Martinez's monthly late enrollment penalty for 2015. In 2016, Medicare recalculated Mrs. Martinez’s penalty using the 2016 base beneficiary premium ($34.10). So, Mrs. Martinez’s new monthly penalty in 2016 is 31% of $34.10 or $10.57 each month. Since the monthly penalty is always rounded to the nearest $0.10, she’ll pay $10.60 each month in addition to her plan’s monthly premium. Since the monthly penalty is always rounded to the nearest $0.10, she paid $10.30 each month in addition to her plan’s monthly premium in 2015. Here's the math: .31 (31% penalty) × $33.13 (2015 base beneficiary premium) = $10.27."}, {"url": "https://www.medicare.gov/your-medicare-costs/part-b-costs/penalty/part-b-late-enrollment-penalty.html", "passage_text": "In most cases, if you don't sign up for Part B when you're first eligible, you'll have to pay a late enrollment penalty for as long as you have Part B. Your monthly premium for Part B may go up 10% for each full 12-month period that you could have had Part B, but didn't sign up for it. If you have limited income and resources, your state may help you pay for Part A, and/or Part B. You may also qualify for Extra Help to pay for your Medicare prescription drug coverage. Example. Your Initial Enrollment Period ended September 30, 2009."}, {"url": "https://www.mymedicarematters.org/enrollment/penalties-and-risks/", "passage_text": "If you sign up late for Medicare Part B, you will have to pay a late penalty premium every month for the rest of your life, along with your Part B premium. Your monthly Part B premium will go up 10% for each full 12-month period that you could have had Medicare Part B but did not take it. You will pay this higher premium as long as you have Medicare Part B. You may not have to pay the penalty if you qualify for a Special Enrollment Period (SEP)."}, {"url": "https://www.mymedicarematters.org/enrollment/penalties-and-risks/", "passage_text": "The fee is calculated as 1% of the average monthly prescription drug premium (1% of $33.13 in 2015, or 33 cents) times the number of months you were late, rounded to the nearest 10 cents. This penalty is permanent – you would have to pay it for as long as you have Medicare Prescription Drug Coverage. Your monthly Part B premium will go up 10% for each full 12-month period that you could have had Medicare Part B but did not take it. You will pay this higher premium as long as you have Medicare Part B. You may not have to pay the penalty if you qualify for a Special Enrollment Period (SEP)."}]