[{"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Skin_Care_Concerns/hic_abnormal_pigmentation", "passage_text": "Vitiligo is pigment loss due to the body’s immune system attacking pigment cells (melanocytes). Other associated immune system diseases include diabetes, pernicious anemia, thyroid disease, and Addison’s disease. Vitiligo causes smooth, white skin patches, usually around the mouth and eyes, or on the back of the hands. Albinism. Albinism, an inherited disorder, is caused by the absence of the pigment melanin and results in no pigmentation in skin, hair, or eyes. Albinos have an abnormal gene, which restricts melanin production."}, {"url": "http://my.clevelandclinic.org/health/diseases_conditions/hic_Skin_Care_Concerns/hic_abnormal_pigmentation", "passage_text": "Birthmarks and other pigmentation disorders affect many people. Some of the most common problems are listed below. If you think you have one of these skin pigmentation abnormalities, make sure to visit a physician or dermatologist to receive an official diagnosis. Albinism. Albinism, an inherited disorder, is caused by the absence of the pigment melanin and results in no pigmentation in skin, hair, or eyes. Albinos have an abnormal gene, which restricts melanin production."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/hyperpigmentation-hypopigmentation", "passage_text": "Hyperpigmentation in skin is caused by an increase in melanin, the substance in the body that is responsible for color (pigment). Certain conditions, such as pregnancy or Addison's disease (decreased function of the adrenal gland), may cause a greater production of melanin and hyperpigmentation. 1 This results in a complete lack of pigmentation in skin, hair, or eyes. 2  Albinos have an abnormal gene that restricts the body from producing melanin. 3  There is no cure for albinism. 4  People with albinism should use a sunscreen at all times because they are much more likely to get sun damage and skin cancer."}, {"url": "http://www.hopkinsmedicine.org/healthlibrary/conditions/dermatology/skin_pigment_disorders_85%2cP00304/", "passage_text": "Pigment disorder. Characteristics. Treatment. Albinism. This rare, inherited disorder is characterized by a total or partial lack of melanin in the skin, compared to the pigmentation of siblings and parents. Albinos (people with albinism) have white hair, pale skin, and pink eyes. Chemical peels and laser can also be used. Pigment loss after skin damage. Sometimes, following an ulcer, blister, burn, or infection, the skin does not replace some of the pigment in that area. No treatment is necessary. Cosmetics can usually cover the blemish. Vitiligo. Smooth, white patches in the skin, vitiligo is caused by the loss of pigment-producing cells in the skin (melanocytes). The white patches are very sensitive to the sun. There is no cure for vitiligo"}, {"url": "http://www.webmd.com/skin-problems-and-treatments/hyperpigmentation-hypopigmentation", "passage_text": "Hypopigmentation in skin is the result of a reduction in melanin production. Examples of hypopigmentation include: 1  Vitiligo: Vitiligo causes smooth, white patches on the skin. 2  In some people, these patches can appear all over the body. 3  It is an autoimmune disorder in which the pigment-producing cells are damaged. 1 This results in a complete lack of pigmentation in skin, hair, or eyes. 2  Albinos have an abnormal gene that restricts the body from producing melanin. 3  There is no cure for albinism. 4  People with albinism should use a sunscreen at all times because they are much more likely to get sun damage and skin cancer."}, {"url": "https://en.wikipedia.org/wiki/Melanocyte", "passage_text": "Through a process called melanogenesis, these cells produce melanin, which is a pigment found in the skin, eyes, and hair. This melanogenesis leads to a long-lasting pigmentation, which is in contrast to the pigmentation that originates from oxidation of already-existing melanin. There are both basal and activated levels of melanogenesis; in general, lighter-skinned people have low basal levels of melanogenesis."}, {"url": "http://www.webmd.com/skin-problems-and-treatments/hyperpigmentation-hypopigmentation", "passage_text": "Pigmentation is the coloring of a person's skin. When a person is healthy, his or her skin will appear normal in color. In the case of illness or injury, the person's skin may change color, becoming darker (hyperpigmentation) or lighter (hypopigmentation). 1 This results in a complete lack of pigmentation in skin, hair, or eyes. 2  Albinos have an abnormal gene that restricts the body from producing melanin. 3  There is no cure for albinism. 4  People with albinism should use a sunscreen at all times because they are much more likely to get sun damage and skin cancer."}, {"url": "https://en.wikipedia.org/wiki/Melanocyte", "passage_text": "Melanocytes /mɛˈlaenɵsaɪt/ mɛˈlænɵsaɪt are-melanin producing cells located in the bottom (layer the stratum) basale of the'skin s, epidermis the middle layer of the (eye the), uvea the inner, ear, meninges, bones and. Heart melanin is the pigment primarily responsible for skin. color This melanogenesis leads to a long-lasting pigmentation, which is in contrast to the pigmentation that originates from oxidation of already-existing melanin. There are both basal and activated levels of melanogenesis; in general, lighter-skinned people have low basal levels of melanogenesis."}]