[{"url": "http://www.umass.edu/microbio/chime/dna/codons.htm", "passage_text": "The anticodons of tRNA adapt each three-base mRNA codon to the corresponding amino acid, following the genetic code : 2. Explanation of the Codons Animation. 1  Most images show 17 base pairs. 2  For the Codons animation, the left-most two base pairs are hidden, leaving exactly five 3-base codons (15 base pairs). "}, {"url": "http://academic.brooklyn.cuny.edu/biology/bio4fv/page/antico.htm", "passage_text": "During translation, the bases of the anticodon form complementary base pairs witht the bases of the codon by forming the appropriate hydrogen bonds. In this diagram you see a tRNA that has the anticodon UUU which is complementary to the codon AAA. The codon AAA specifies the amino acid phenylalanine. You also see the tRNA with the anticodon CCC which is complementary to the codon GGG. The codon GGG specifies the amino acid glycine. The anticodon region of a transfer RNA is a sequence of three bases that are complementary to a codon in the messenger RNA."}, {"url": "http://www.answers.com/Q/What_anti-codon_would_complement_the_codon_agu", "passage_text": "A codon is the triplet sequence in the messenger RNA (mRNA) transcript which specifies a corresponding amino acid (or a start or stop command). An anticodon is the corre … sponding triplet sequence on the transfer RNA (tRNA) which brings in the specifieds amino acid to the ribosome during translation. A codon specifies a certain amino acid that makes up the protein. A codon is a sequence of three DNA or RNA nucleotides that corresponds with a specific amino acid or stop sig … nal during protein synthesis.    Codon is a genetic code. The genetic code is initial nucleotide  from which translation starts"}, {"url": "http://www.pbs.org/wgbh/aso/tryit/dna/indextpro.html", "passage_text": "The mRNA bases are grouped into sets of three, called codons. Each codon has a complementary set of bases, called an anticodon. Anticodons are a part of transfer RNA (tRNA) molecules. Attached to each tRNA molecule is an amino acid -- in this case, the amino acid is methionine (met). You've matched the first codon in this mRNA molecule, AUG, with its complement, UAC. Description: Ribosome moves to the right. In this case, though, you need to find the complement of each codon. Drag the appropriate tRNA from the bottom of the screen to the leftmost codon of the mRNA. What Happened Window: A ribosome has attached itself to the mRNA.Ribosomes are the cell's structures for building proteins."}, {"url": "http://creationwiki.org/Codon", "passage_text": "Three nucleotide bases code for one amino acid in the genetic code. ATG and AUG denote sequences of DNA and RNA that are the start codon or initiation codon encoding the amino acid methionine (Met) in eukaryotes and a modified methionine (fMet) in prokaryotes. Because AUG is the start codon, methionine is therefore the first amino acid of many proteins. tRNA anticodon complements the mRNA codon. An anticodon is one that possesses a complementary or antisense sequence to a codon. Similar to the complementarity between the 2 strands of the DNA molecular, an anticodon is possessed by the transfer RNA."}, {"url": "https://en.wikipedia.org/wiki/Codon", "passage_text": "A series of codons in part of a messenger RNA (mRNA) molecule. Each codon consists of three nucleotides, usually corresponding to a single amino acid. The nucleotides are abbreviated with the letters A, U, G and C. This is mRNA, which uses U (uracil). DNA uses T (thymine) instead. This mRNA molecule will instruct a ribosome to synthesize a protein according to this code. The code defines how sequences of these nucleotide triplets, called codons, specify which amino acid will be added next during protein synthesis. With some exceptions, a three-nucleotide codon in a nucleic acid sequence specifies"}, {"url": "https://en.wikipedia.org/wiki/DNA_codon_table", "passage_text": "The genetic code is traditionally represented as an RNA codon table because, when proteins are made in a cell by ribosomes, it is mRNA that directs protein synthesis. The mRNA sequence is determined by the sequence of genomic DNA. "}, {"url": "http://www.answers.com/Q/What_anti-codon_would_complement_the_codon_agu", "passage_text": "A three-nucleotide sequence in mRNA that specifies a particular amino acid or polypeptide termination signal; basic unit of the genetic code. In translation, an mRNA codon is … recognized by its complementary tRNA anti-codon. A codon specifies a certain amino acid that makes up the protein. A codon is a sequence of three DNA or RNA nucleotides that corresponds with a specific amino acid or stop sig … nal during protein synthesis.    Codon is a genetic code. The genetic code is initial nucleotide  from which translation starts"}]