[{"url": "https://en.wikipedia.org/wiki/Thoracic_diaphragm", "passage_text": "The diaphragm separates the thoracic cavity containing the heart and lungs, from the abdominal cavity and performs an important function in respiration: as the diaphragm contracts, the volume of the thoracic cavity increases and air is drawn into the lungs. "}, {"url": "https://en.wikipedia.org/wiki/Diaphragmatic_breathing", "passage_text": "(October 2015). Animation of diaphragmatic breathing with the diaphragm shown in green. Diaphragmatic breathing, abdominal breathing, belly breathing or deep breathing is breathing that is done by contracting the diaphragm, a muscle located horizontally between the chest cavity and stomach cavity. Air enters the lungs and the belly expands during this type of breathing. "}, {"url": "http://www.answers.com/Q/How_does_the_diaphragm_function_in_breathing", "passage_text": "During inhalation the diaphragm muscle contracts and this causes it to (effectively) move downwards, its previously upwardly curving shape becomes a flatter one, and this decreases the pressure in the thorax region (the region in which the lungs reside) because there is more air space. When the volume of the lungs increases, the pressure within the lungs decreases and so air flows in. When the diaphragm relaxes it resumes its dome shaped and compresses the lungs increasing the pressure inside them and so air flows out. That's the extended version. The function of the diaphragm is to help you breathe."}, {"url": "http://www.buzzle.com/articles/diaphragm-function.html", "passage_text": "If you're wondering as to what is the main function of the diaphragm, then it is to help in breathing. When a person inhales, the diaphragm contracts and thus, enlarges the space available in the thoracic cavity. The external intercostal muscles also help bring about this enlargement of the thoracic cavity. The diaphragm is a dome-shaped musculo-fibrous septum that separates the thoracic cavity from the rest of the abdominal cavity. Hence, its convex upper surface forms the floor of the thoracic cavity and the concave lower surface forms the roof"}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=2983", "passage_text": "Diaphragm (muscle): The muscle that separates the chest (thoracic) cavity from the abdomen. The diaphragm is the main muscle of respiration. Contraction of the diaphragm muscle expands the lungs during inspiration when one is breathing air in. We rely heavily on the diaphragm for our respiratory function so that when the diaphragm is impaired, it can compromise our breathing."}, {"url": "http://www.innerbody.com/image_chest1/musc82.html", "passage_text": "The diaphragm in the respiratory system is the dome-shaped sheet of muscle that separates the chest from the abdomen. It is also referred to the thoracic diaphragm because it’s located in the thoracic cavity, or chest. It is attached to the spine, ribs and sternum and is the main muscle of respiration, playing a very important role in the breathing process. The lungs are enclosed in a kind of cage in which the ribs form the sides and the diaphragm, an upwardly arching sheet of muscle,... Click to read more below."}, {"url": "http://beltina.org/health-dictionary/diaphragm-breathing-function-definition.html", "passage_text": "What is Diaphragm Function and Definition. Diaphragm-the thin, flat MUSCLE that forms the floor of the thoracic cavity (chest) , establishing a physical barrier between the thoracic cavity and the abdominal cavity. Small openings in the diaphragm allow structures such as the AORTA, inferior VENA CAVA, and ESOPHAGUS to pass through. Contraction of the diaphragm tightens this dome, pulling it downward to expand the thoracic cavity. The diaphragm has two equal halves, each called a hemidiaphragm, and is the primary muscle of BREATHING."}, {"url": "http://www.innerbody.com/image/musc06.html", "passage_text": "Diaphragm. The diaphragm is the dome-shaped sheet of muscle and tendon that serves as the main muscle of respiration and plays a vital role in the breathing process. Click to read more below. The diaphragm is the dome-shaped sheet of muscle and tendon that serves as the main muscle of respiration and plays a vital role in the breathing process."}]