[{"url": "https://en.wikipedia.org/wiki/Ants", "passage_text": "Larger colonies consist mostly of sterile, wingless females forming castes of workers, soldiers, or other specialised groups. Nearly all ant colonies also have some fertile males called drones and one or more fertile females called  queens . The colonies are described as superorganisms because the ants appear to operate as a unified entity, collectively working together to support the colony. Some arthropod species spend part of their lives within ant nests, either preying on ants, their larvae, and eggs, consuming the food stores of the ants, or avoiding predators. These inquilines may bear a close resemblance to ants."}, {"url": "http://www.answers.com/Q/What_do_you_call_for_group_of_ants", "passage_text": "A group of ants is called a colony, or an army of ants. A group of ants is called a colony or an army. Ants have been  living on earth for more than 100 million years."}, {"url": "http://www.answers.com/Q/What_is_a_group_of_ants_called", "passage_text": "A group of ants is called a colony, or an army of ants. The word ant is derived of a long line of words used throughout history to describe an ant. Ant comes from the Middle English word ante which derives from the Old En … glish word aemette, æmette which is derived from The Old High german word, āmeiza which is derived from The West germanic word. amaitjo"}, {"url": "http://fireant.tamu.edu/manage/faq/", "passage_text": "Red imported fire ants are an exotic invasive species and in many areas of Texas they have displaced other species of fire ants native to the state. Solenopsis geminata, the tropical fire ant, is the most common native fire ant species encountered. To the unaided eye, they are almost identical to red imported fire ants. "}, {"url": "https://en.wikipedia.org/wiki/Fire_ant", "passage_text": "Fire ant is the common name for several species of ants in the genus Solenopsis. They are however only a minority in the genus, which includes over 200 species of Solenopsis worldwide. Solenopsis are stinging ants and most of their common names reflect this, for example, ginger ants and tropical fire ants. Many species also are called red ants because of their light brown colour, though species of ants in many other genera are similarly named for similar reasons. Fire ants often attack small animals and can kill them. Unlike many other ants, which bite and then spray acid on the wound, fire ants bite only to get a grip and then sting (from the abdomen) and inject a toxic alkaloid venom called Solenopsin, a compound from the class of piperidines."}, {"url": "http://www.eaglepestservices.com/what-is-a-group-of-ants-called.html", "passage_text": "A group of ants is called a colony, or sometimes an army. Ants are a social insect, and live in large groups that have one 'queen' ant, and many 'worker' ants that are responsible for foraging for food, as well as caring for the queen and her offspring. If you have ants in your home or place of business, you can save money on our pest control services with our coupon. “Bye Bye Ants :)) love this company. I switched from another company and I am so happy that I did :) they are very knowledgeable and the employees are so friendly!!!! ”."}, {"url": "http://www.eaglepestservices.com/what-is-a-group-of-ants-called.html", "passage_text": "What Is A Group Of Ants Called? One question that is commonly asked by people that have ant infestations in their home or place of business is what is a group of ants called?. If you have ants in your home or place of business, you can save money on our pest control services with our coupon. “Bye Bye Ants :)) love this company. I switched from another company and I am so happy that I did :) they are very knowledgeable and the employees are so friendly!!!! ”."}, {"url": "https://en.wikipedia.org/wiki/Ants", "passage_text": "Ants are eusocial insects of the family Formicidae /fɔrˈmɪsɨdiː/ and, along with the related wasps and bees, belong to the order Hymenoptera. Ants evolved from wasp-like ancestors in the mid-Cretaceous period between 110 and 130 million years ago and diversified after the rise of flowering plants. Some arthropod species spend part of their lives within ant nests, either preying on ants, their larvae, and eggs, consuming the food stores of the ants, or avoiding predators. These inquilines may bear a close resemblance to ants."}]