[{"url": "http://www.drinksmixer.com/desc228.html", "passage_text": "Sambuca. Sambuca is an anise-flavored liqueur, produced by the infusion of witch elder bush and licorice, sweetened with sugar and enhanced with a secret combination of herbs and spices. White Sambuca is the traditional and generally the more popular variety, having a mellower licorice taste and lighter body than that of black sambuca. view recipes with sambuca. black sambuca. blue sambuca. gold sambuca. green sambuca. red sambuca."}, {"url": "https://answers.yahoo.com/question/index?qid=20071026182857AAWR4m6", "passage_text": "Sambuca is an anise-flavored liqueur, produced by the infusion of witch elder bush and licorice, sweetened with sugar and enhanced with a secret combination of herbs. Report Abuse. No, Sambuca is Sambuca, it is a distilled spirit, of either grain or fruit, and has added to it sugar and essence of aniseed. Being that vodka is, generally, a clear, unaged spirit that can come flavored, they are similar. However, Sambuca is among a number of anise flavored spirits like Raki, Ouzo, and Pasti"}, {"url": "http://www.liqueur-drink-recipes.org.uk/sambuca/index.htm", "passage_text": "Facts and Information about the Sambuca Liqueur The alcoholic drink Sambuca is an anise-flavored liqueur, produced by the infusion of white petals of the elderberry flower, sweetened with sugar and enhanced with a secret combination of herbs and spices with a distinctive licorice taste. A flaming Sambuca is made by lighting the white drink in a shot glass and allowing it to burn with a small blue flame. The flame is then extinguished by placing the palm of the hand over the top of the glass."}, {"url": "https://en.wikipedia.org/wiki/Sambuca", "passage_text": "Ingredients [edit]. Sambuca is flavoured with essential oils obtained from anise, star anise, liquorice and other spices. It also contains elderflowers. The oils are added to pure alcohol, a concentrated solution of sugar, and other flavouring. It may also be served on the rocks or with water, resulting in the ouzo effect from the anethole in the anise. Sambuca is considered to go particularly well with coffee. Like other anise liqueurs, it may be drunk after coffee as a ammazzacaffe ammazzacaffè or added directly to coffee in place of. sugar"}, {"url": "http://www.wisegeek.org/what-is-sambuca.htm", "passage_text": "The primary flavoring in sambuca is the essential oils of star anise, which give the drink its distinct licorice flavor. Sugar is typically added to sweeten the drink slightly, and other flavorings such as elderberry can also be added. Sambuca is often served in a shot glass with roasted coffee beans. Diners in Italian cafes consume sambuca to cleanse their mouths after they drink coffee."}, {"url": "http://www.liqueur-drink-recipes.org.uk/sambuca/index.htm", "passage_text": "Sambuca is an Italian liqueur which is also flavored with anise and the elderberry. The Sambuca liqueur in these drink recipes can be substituted with Pernod, Ouzo or Anisette. A flaming Sambuca is made by lighting the white drink in a shot glass and allowing it to burn with a small blue flame. The flame is then extinguished by placing the palm of the hand over the top of the glass."}, {"url": "http://www.liqueur-drink-recipes.org.uk/sambuca/index.htm", "passage_text": "White Sambuca White sambuca has a more aniseed taste than the black variety and is usually not as thick and syrupy. A flaming Sambuca is made by lighting the white drink in a shot glass and allowing it to burn with a small blue flame. The flame is then extinguished by placing the palm of the hand over the top of the glass."}, {"url": "http://www.liqueur-drink-recipes.org.uk/sambuca/index.htm", "passage_text": "Facts and Information about the Sambuca LiqueurThe alcoholic drink Sambuca is an anise-flavored liqueur, produced by the infusion of white petals of the elderberry flower, sweetened with sugar and enhanced with a secret combination of herbs and spices with a distinctive licorice taste. A flaming Sambuca is made by lighting the white drink in a shot glass and allowing it to burn with a small blue flame. The flame is then extinguished by placing the palm of the hand over the top of the glass."}, {"url": "https://en.wikipedia.org/wiki/Sambuca", "passage_text": "Sambuca may be served neat. It may also be served on the rocks or with water, resulting in the ouzo effect from the anethole in the anise. Sambuca is considered to go particularly well with coffee. Like other anise liqueurs, it may be drunk after coffee as a ammazzacaffe ammazzacaffè or added directly to coffee in place of. Sugar the most iconic serving of sambuca is a shot with seven coffee, beans representing The seven hills Of. rome It may also be served on the rocks or with water, resulting in the ouzo effect from the anethole in the anise. Sambuca is considered to go particularly well with coffee. Like other anise liqueurs, it may be drunk after coffee as a ammazzacaffe ammazzacaffè or added directly to coffee in place of. sugar"}]