[{"url": "https://en.wikipedia.org/wiki/Etosha_National_Park", "passage_text": "Etosha National Park is a national park in northwestern Namibia. The park was proclaimed a game reserve on March 22, 1907 in Ordinance 88 by the Governor of German South West Africa, Dr. Friedrich von Lindequist. Etosha National Park spans an area of 22,270 square kilometres (8,600 sq mi) and gets its name from the large Etosha pan which is almost entirely within the park. The Etosha pan (4,760 square kilometres (1,840 sq mi)) covers 23% of the area of the total area of the Etosha National Park."}, {"url": "http://www.namibia-travel.net/namibia/flora.html", "passage_text": "Due to the climatic differences within the country, Namibia has a broad variety of plant species from desert and semi-desert vegetation to evergreen subtropical plants. About 70% of Namibia is savannah. In Central Namibia, thornbush-savannah is dominant with extensive grasslands and acacia bush. In the relatively humid Caprivi the dominant vegetation form is the woodland savannah, interspersed with single baobabs, wild figs and makalani palms.Not much grass grows in the arid south of Namibia. Trees are also scarce."}, {"url": "http://www.tourism.na/namibia-vegetation.php", "passage_text": "Generally speaking, Namibia is divided into desert, succulent Karoo, Nama Karoo and Savannah biomes – natural regions where given forms of plant life are dominant. With annual plants, largely grasses, as the dominant form of plant life, the major part of the Namib constitutes the desert biome. About 60% of Namibia consists of Savannah and the balance is divided between types of desert and woodland. Savannah dominates the highlands and desert, the Namib. Both Savannah and woodland are found in the Kalahari"}, {"url": "http://www.worldwildlife.org/ecoregions/at1316", "passage_text": "According to Geiss’ vegetation map of Namibia (1971), the ecoregion contains three vegetation types: mopane savanna, semi-desert and savanna transition, and dwarf shrub savanna. The mopane savanna lies to the north of the ecoregion and is characterized by Colophospermum mopane. The Namibian Savanna Woodland ecoregion is also a center of high faunal endemism and species richness. The ecoregion has a significantly larger number of Namibian endemic invertebrates, amphibians, reptiles, mammals and birds than adjacent ecoregions (Simmons et al. 1998)."}, {"url": "http://www.worldwildlife.org/ecoregions/at1316", "passage_text": "Africa: Namibia. The Namibian Savanna Woodland ecoregion covers the Great Escarpment that delimits the interior of southern Africa from the Kaokoveld and Namib Deserts. This broken and deeply dissected escarpment is an area of high endemism for plants, invertebrates, amphibians, reptiles, mammals and birds. The Namibian Savanna Woodland ecoregion is also a center of high faunal endemism and species richness. The ecoregion has a significantly larger number of Namibian endemic invertebrates, amphibians, reptiles, mammals and birds than adjacent ecoregions (Simmons et al. 1998)."}, {"url": "http://www.gardenguides.com/101245-shrubs-savannas.html", "passage_text": "Shrub Savanna. An example of a shrub savanna is found in Namibia, which is covered in thornbush, and several places in the United States including the Rio Grande Plains and the Balcones escarpment in Texas. Comments. Submit. Savannas are grasslands covered with perennial plants including grasses and shrubs and are identified by the amount of tree cover they have. An area is designated a savanna if less than half of it is covered by trees."}, {"url": "http://www.tourism.na/namibia-vegetation.php", "passage_text": "Namibia Vegetation. About 60% of Namibia consists of Savannah and the balance is divided between types of desert and woodland. Savannah dominates the highlands and desert, the Namib. Both Savannah and woodland are found in the Kalahari"}, {"url": "http://www.fao.org/ag/agp/agpc/doc/counprof/namibia.htm", "passage_text": "1. INTRODUCTION. Namibia (formerly South West Africa) is situated in the south west of the continent of Africa, bordered by the Atlantic Ocean on the west, Angola and Zambia to the north, Botswana to the east and the Republic of South Africa to the south (Fig. 1). The total land area is 824 269 sq km."}]