[{"url": "http://www.wdc.com/wdproducts/library/other/2579-701185.pdf", "passage_text": "In perpendicular magnetic recording (PMR), the magnetization of each data bit is aligned vertically to the spinning disk, providing the ability to store more data on a given disk than is possible with conventional longitudinal recording. PMR thus provides a platform for future expansion of hard drive densities. "}, {"url": "http://www.webopedia.com/DidYouKnow/Computer_Science/perpendicular_hard_drive_technology.asp", "passage_text": "Longitudinal Recording. As indicated by the name, longitudinal recording is a method of recording data to a hard disk drive (HDD) in such a way that the data bits are aligned horizontally in relation to the drive's spinning platter, which is parallel to the surface of the disk. The mechanism that reads and writes data on a hard disk. longitudinal recording Longitudinal recording aligns data bits horizontally in relation to the drive's spinning platter, parallel to the surface of the disk. perpendicular recording. Perpendicular recording aligns data bits vertically. perpendicular to the disk."}, {"url": "http://www.webopedia.com/TERM/L/Longitudinal_recording.html", "passage_text": "A method of recording data to a hard disk drive (HDD). Used over the last 50 years, Longitudinal recording aligns data bits horizontally in relation to the drive's spinning platter, parallel to the surface of the disk. Contrast with Perpendicular recording. "}, {"url": "http://www.fgarciasanchez.es/thesisfelipe/node5.html", "passage_text": "The difference between longitudinal and perpendicular recording is the orientation of the anisotropy of media grains. Fig. 1.2 shows schematically the difference between both recording solutions. In the case of longitudinal recording the grains magnetization is lying in the plane of the magnetic medium. When the medium is magnetized by the recording head, the average magnetization is pointing in the down-track direction (see Fig 1.2). Magnetic recording is one of the most important examples of working nanotechnology. Here we will mostly be concerned with the hard disk magnetic storage. The magnetic information in the hard disk is stored in ``bits'' which are patterns of magnetization in a magnetizable material to store data."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0304885304010819", "passage_text": "This space is air in the longitudinal case. And, the main pole of the single-pole head corresponds to the gap of the ring head that is unity permeability. Thus, the highly permeable material in longitudinal mode is changed into the space of unity permeability. Perpendicular magnetic recording was introduced by the discovery of the Co–Cr perpendicular anisotropy film and the single-pole head [1] based on the circular magnetization mode [2] ."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0304885304010819", "passage_text": "Besides, the structure of two magnetic heads, the ring head for longitudinal recording and the (auxiliary-pole driven) single-pole head [1] for perpendicular recording, shows a spatial symmetry. Fig. 1 schematically indicates this relationship. Perpendicular magnetic recording was introduced by the discovery of the Co–Cr perpendicular anisotropy film and the single-pole head [1] based on the circular magnetization mode [2] ."}, {"url": "http://www.webopedia.com/DidYouKnow/Computer_Science/perpendicular_hard_drive_technology.asp", "passage_text": "Essentially, you are recording on a magnetic material, where bits (a collection of magnetized particles) are laid out end-to-end. Longitudinal recording is the actual method of how the bits are recorded on disk platters. The direction of this magnetic charge is horizontal to the media, meaning the north and south poles of the magnetized particles are lined parallel to the surface of the disk. The mechanism that reads and writes data on a hard disk. longitudinal recording Longitudinal recording aligns data bits horizontally in relation to the drive's spinning platter, parallel to the surface of the disk. perpendicular recording. Perpendicular recording aligns data bits vertically. perpendicular to the disk."}, {"url": "http://www.sciencedirect.com/science/article/pii/S0304885304010819", "passage_text": "Complementarity law between contrasting characteristics of longitudinal and perpendicular recording is described. The complementarity includes orthogonal field distributions of single-pole head and ring head due to the spatial configuration of pole structure. Significant dependence of recording resolution upon media parameters (δ, H c, B r) in longitudinal recording is indicated. Perpendicular magnetic recording was introduced by the discovery of the Co–Cr perpendicular anisotropy film and the single-pole head [1] based on the circular magnetization mode [2] ."}, {"url": "http://pediaa.com/difference-between-transverse-and-longitudinal-waves/", "passage_text": "The main difference between transverse and longitudinal waves is that in transverse waves, oscillations occur perpendicular to the direction of propagation of the wave, whereas in longitudinal waves, oscillations occur parallel to the direction of propagation of the wave. In longitudinal waves, oscillations occur parallel to the direction of propagation of the wave. The most common example for these types of waves is sound waves, which consist of oscillating air molecules."}]