[{"url": "http://www.bankrate.com/finance/taxes/irs-can-help-you-look-after-the-kids-1.aspx", "passage_text": "The dependent care credit is not refundable, meaning it can only take your tax bill to zero. Any excess credit is not usable. For example, if you claim a $1,050 maximum credit for the care of one child and owe $750, the IRS will use your credit to wipe out your tax bill, but you won't get the extra $300 as a refund. You can claim only up to $3,000 for the care of one person and $6,000 for two or more. Then this amount is further reduced based on your overall income (more on this later). There is some good news, however."}, {"url": "http://www.justanswer.com/tax/03q3n-maximum-amount-claim-daycare.html", "passage_text": "This credit is available for household and child-care expenses incurred to enable you (and your spouse) to be gainfully employed. The credit will range from 20% to 35% of qualifying expenses incurred up to a maximum of $3,000 for one child and $6,000 for two or more children. For child care credit purposes you are limited to claiming the credit on up to $3,000 of qualifying expenses per child up to a maximum of two children. Accordingly, the most child care expense you can consider for tax credit purposes is $6,000"}, {"url": "http://www.justanswer.com/tax/03q3n-maximum-amount-claim-daycare.html", "passage_text": "Share this conversation. Expert: Christopher Phelps replied 9 years ago. For child care credit purposes you are limited to claiming the credit on up to $3,000 of qualifying expenses per child up to a maximum of two children. Accordingly, the most child care expense you can consider for tax credit purposes is $6,000"}, {"url": "https://www.irs.gov/taxtopics/tc602.html", "passage_text": "If you qualify for the credit, complete Form 2441 (PDF), Child and Dependent Care Expenses, and Form 1040 (PDF) or Form 1040A (PDF). If you received dependent care benefits from your employer (amount is shown on your Form W-2 (PDF)), you must complete Part III of Form 2441. You must reduce the remaining qualifying expenses by the amount of any dependent care benefits provided by your employer that you exclude from gross income. In general, you can exclude up to $5,000 for dependent care benefits received from your employer."}, {"url": "http://turbotax.intuit.ca/tax-resources/dependant-tax-expenses/claiming-child-care-expenses.jsp", "passage_text": "How Much to Claim. Canadian taxpayers can claim up to $7,000 per child for children under the age of 7 years at the end of the year, and $4,000 per child for children aged 7 to 16 years. For disabled, dependent children of any age who qualify for the disability tax credit, the amount to claim for that child is $10,000. You can claim $4,000 for a disabled child over the age of 16 who does not qualify for the disability tax credit but was still dependent on you and required care. For a boarding school or overnight camp, you may only claim up to $175 per week for a child under the age of 7 years, $250 per week for an eligible disabled child, or $100 per week for a child aged 7 to 16 years, as of 2013."}, {"url": "http://www.getsmarteraboutmoney.ca/en/managing-your-money/planning/understanding-tax/Pages/Parents-and-tax.aspx", "passage_text": "Children’s fitness amount. You can claim this tax credit if your children are registered in ongoing physical activities or classes. On October 9, 2014, a proposal was announced to increase the maximum amount per child from $500 to $1,000 for the 2014 and subsequent tax years. In 2014 you can claim 15% of the fees you pay as a non-refundable tax credit of up to $150. For the 2014 tax year, you can still claim a non-refundable tax credit in the amount of $2,255 for each of your children who are under 18 years old at the end of the year. If 2 or more families share a home, each eligible parent can claim the credit with respect to their own children."}, {"url": "http://finance.zacks.com/maximum-dependent-care-deduction-3491.html", "passage_text": "Maximum Credit. As of 2012, the maximum credit for dependent care expenses was $2,100 a year. However, the maximum was available only to taxpayers who had paid for care for more than one dependent, had at least $6,000 in dependent care expenses during the year, and had an adjusted gross income of $15,000 or less. A look at how the credit is calculated explains where this $2,100 figure comes from."}, {"url": "http://finance.zacks.com/maximum-dependent-care-deduction-3491.html", "passage_text": "You don't necessarily get a tax credit for the full amount of your dependent care expenses. If you're paying for the care of one dependent, you can apply a maximum of $3,000 worth of your expenses toward the credit. If you're paying for care for two or more people, you can apply up to $6,000 worth of expenses toward the credit. However, the maximum was available only to taxpayers who had paid for care for more than one dependent, had at least $6,000 in dependent care expenses during the year, and had an adjusted gross income of $15,000 or less. A look at how the credit is calculated explains where this $2,100 figure comes from."}, {"url": "https://www.irs.gov/taxtopics/tc602.html", "passage_text": "Topic 602 - Child and Dependent Care Credit. You may be able to claim the child and dependent care credit if you paid expenses for the care of a qualifying individual to enable you and your spouse filing a joint return to work or actively look for work. You may not take this credit if your filing status is married filing separately. You must reduce the remaining qualifying expenses by the amount of any dependent care benefits provided by your employer that you exclude from gross income. In general, you can exclude up to $5,000 for dependent care benefits received from your employer."}]