[{"url": "http://www.mayoclinic.org/diseases-conditions/osteoarthritis/expert-answers/arthritis/faq-20058457", "passage_text": "My doctor says I have degenerative changes in my spine. Yes. The phrase degenerative changes in the spine refers to osteoarthritis of the spine. Osteoarthritis is the most common form of arthritis. Doctors may also refer to it as degenerative arthritis or degenerative joint disease. Osteoarthritis in the spine most commonly occurs in the neck and lower back. With age, the soft disks that act as cushions between the spine's vertebrae dry out and shrink. "}, {"url": "https://northamericanspine.com/conditions/degenerative-disc-disease/", "passage_text": "Degenerative Disc Disease (DDD) is the gradual degeneration of the discs that reside between the vertebrae in the spine. The procedure, using a laser and other tools, is then designed to shrink the bulges and seal the cracks of the degenerative disc. "}, {"url": "http://www.spine-health.com/conditions/degenerative-disc-disease/what-degenerative-disc-disease", "passage_text": "Simply put, degenerative disc disease describes the symptoms of pain and possibly radiating weakness or numbness stemming from a degenerated disc in the spine. Degenerative disc disease is one of the most common causes of low back pain and neck pain, and also one of the most misunderstood. 1  See The Degenerative Cascade of a Degenerating Disc."}, {"url": "http://www.spine-health.com/conditions/degenerative-disc-disease/what-degenerative-disc-disease", "passage_text": "Lumbar degenerative disc disease refers to the symptoms of lower back pain and/or radiating pain, numbness or weakness in the legs stemming from a degenerated spinal disc. Cervical Degenerative Disc Disease Video. Neck pain and stiffness may be the result of cervical degenerative disc disease. Degenerative disc disease is one of the most common causes of low back pain and neck pain, and also one of the most misunderstood. 1  See The Degenerative Cascade of a Degenerating Disc."}, {"url": "http://www.medicalnewstoday.com/articles/266630.php", "passage_text": "Degenerative disc disease is a disease of aging, an age related disease. Over the years and decades, the repeated daily stresses on the spine and occasional minor, unnoticed injuries, as well as major ones, begin to take their toll. For most people the gradual degeneration of the discs is not a problem. However, in some cases it eventually causes severe, chronic and debilitating discogenic pain. Back specialists refer to pain caused by a damaged intervertebral disc as discogenic pain. As the human body ages, the intervertebral discs degenerate (break down), which leads to degenerative disc disease in some individuals. The changes that occur, due to aging, include: 1  Loss of fluid-the intervertebral discs of a healthy young adult consist mainly of fluid, up to 90%."}, {"url": "https://www.laserspineinstitute.com/back_problems/degenerative_disc_disease/", "passage_text": "Degenerative disc disease (DDD) is characterized by the ongoing deterioration of the intervertebral discs of the spine. These cushioning discs are composed of a gelatinous core (called the nucleus pulposus) and exterior cartilage shell (called the annulus fibrosus). Thoracic spinal deterioration refers to degenerative disc disease that affects the middle of the back between the shoulders and the small of the back. Degeneration in this section of the spine is relatively uncommon."}]