[{"url": "http://www.tourismhuahin.com/weather-climate-huahin.php", "passage_text": "Hua Hin weather. Like any tropical country, Thailand is ruled by seasons, although they can vary quite markedly from the north to the south. Hua Hin is fortunate, in as much as it is fairly centrally located and on a narrow peninsula that extends down to Malaysia."}, {"url": "http://www.huahinexpat.com/huahin-weather.htm", "passage_text": "Thailand is well known for its seasonal weather changes – the “Rainy” season, the “Hot” season, and the “Cool” season, but different regions are influenced to different extents. Hua Hin Hot season March-June Days and nights are hot, some high humidity with an average temperature of 29 degrees celcius."}, {"url": "http://www.hua-hin.com/weather", "passage_text": "The climate Hua Hin in generally tropical with three distinct seasons, cool from November to February, hot from March to June, and rainy from July to October. Due its special microclimate induced by geographic factors, Hua Hin is drier and sunnier than surrounding destinations in Thailand."}, {"url": "http://www.manoravillage.com/38-Weather-Hua-Hin-Thailand", "passage_text": "Most days offer clear blue skies and sometimes billowing white clouds. Hua Hin was chosen as the Royal resort due to the excellent weather and climate. Rainy Season in Hua Hin Thailand: The southwest monsoon comes from the Indian Ocean with rain-laden clouds, from about June to October. Not every day it rains so there is still plenty of sunshine, the humidity makes it feel hot and sticky, temperatures average 24 to 32 degrees Celsius."}, {"url": "http://www.accorhotels.com/gb/city/hotels-hua-hin-v7422.shtml", "passage_text": "All our hotels in Hua Hin. Hua Hin. Located 281 kilometres south of Bangkok, Hua Hin is the oldest and most popular beach resort town of Thailand. Hua Hin became popular as a rainy season retreat in the 1920's with the construction of the railway line from Bangkok."}, {"url": "http://www.thailand-huahin.com/thailand-huahin-weather-climate.htm", "passage_text": "Thailand is well known for its seasonal weather changes – the “Rainy” season, the “Hot” season, and the “Cool” season, but different regions are influenced to different extents. Hua Hin Hot season March-June Days and nights are hot, some high humidity with an average temperature of 29 degrees celcius."}]