[{"url": "http://blogs.bu.edu/guidedhistory/moderneurope/madeleine-atkinson/", "passage_text": "The Renaissance was an era of cultural rebirth and achievement that occurred in Italy during the fourteenth, fifteenth, and sixteenth centuries. The period can be best described as the rise of humanism, which was an intellectual movement that emphasized secular ideas found in literature from Ancient Greece and Rome. Among these ancient ideas was a newfound faith in the individual. "}, {"url": "http://roebuckclasses.com/ideas/humanist.htm", "passage_text": "In fact, late medieval and early modern humanism is just the opposite. Renaissance humanism was a response to the standard educational program that focused on logic and linguistics and the other great late medieval Christian philosophy, Scholasticism. First, there really was no such thing as a humanist movement. The term humanism was coined in 1808 by a German educator, F. J. Niethammer, to describe a program of study distinct from science and engineering. In the Early Modern period, humanism was not a philosophy but a new educational curriculum."}, {"url": "https://en.wikipedia.org/wiki/Renaissance_humanism", "passage_text": "Renaissance humanism was a response to the utilitarian approach and what came to be depicted as the narrow pedantry associated with medieval scholasticism. Two noteworthy trends in Renaissance humanism were Renaissance Neo-Platonism and Hermeticism, which through the works of figures like Nicholas of Kues, Giordano Bruno, Cornelius Agrippa, Campanella and Pico della Mirandola sometimes came close to constituting a new religion itself."}, {"url": "http://www.ocs.cnyric.org/webpages/dorourke/files/the%20renaissance%20and%20humanism.pdf", "passage_text": "THE RENAISSANCE AND HUMANISM  The Period from the 1300s to the 1500s was a time of great creativity and change in Europe. This period is called the Renaissance which means “rebirth”.  It was a golden age in the arts, literature, and science.  The Renaissance began in Italy in the mid-1300s and then spread northward. "}, {"url": "https://en.wikipedia.org/wiki/Renaissance_humanism", "passage_text": "The terms for this movement Renaissance (rinascimento rebirth) and humanist (whence modern humanism; also Renaissance humanism to distinguish it from later developments grouped as humanism) are contemporary to that period. Two noteworthy trends in Renaissance humanism were Renaissance Neo-Platonism and Hermeticism, which through the works of figures like Nicholas of Kues, Giordano Bruno, Cornelius Agrippa, Campanella and Pico della Mirandola sometimes came close to constituting a new religion itself."}, {"url": "https://en.wikipedia.org/wiki/Renaissance_humanism", "passage_text": "Humanism is the study of classical antiquity, at first in Italy and then spreading across Western Europe in the 14th, 15th, and 16th centuries. Two noteworthy trends in Renaissance humanism were Renaissance Neo-Platonism and Hermeticism, which through the works of figures like Nicholas of Kues, Giordano Bruno, Cornelius Agrippa, Campanella and Pico della Mirandola sometimes came close to constituting a new religion itself."}, {"url": "http://historyguide.org/intellect/humanism.html", "passage_text": "Renaissance Humanism Humanism is the term generally applied to the predominant social philosophy and intellectual and literary currents of the period from 1400 to 1650."}, {"url": "http://www.loc.gov/exhibits/vatican/humanism.html", "passage_text": "The great intellectual movement of Renaissance Italy was humanism. The humanists believed that the Greek and Latin classics contained both all the lessons one needed to lead a moral and effective life and the best models for a powerful Latin style. "}, {"url": "https://en.wikipedia.org/wiki/Humanism", "passage_text": "Renaissance humanism was an intellectual movement in Europe of the later Middle Ages and the Early Modern period. The 19th-century German historian Georg Voigt (1827–91) identified Petrarch as the first Renaissance humanist. The meaning of the term humanism has fluctuated, according to the successive intellectual movements which have identified with it. Generally, however, humanism refers to a perspective that affirms some notion of human freedom and progress."}, {"url": "https://en.wikipedia.org/wiki/Humanism", "passage_text": "Yet it was from the Renaissance that modern Secular Humanism grew, with the development of an important split between reason and religion. This occurred as the church's complacent authority was exposed in two vital areas. The meaning of the term humanism has fluctuated, according to the successive intellectual movements which have identified with it. Generally, however, humanism refers to a perspective that affirms some notion of human freedom and progress."}]