[{"url": "http://www.answers.com/Q/What_is_the_average_temperature_in_the_desert", "passage_text": "The average temperatures of the cold desert in winter ranges from -2 to 4° C, whilst in the summer it ranges from 21 to 26° C. Taking Antarctica (the most extreme cold desert) as an example, its lowestt temperature was −89.2 °C and its highest temperature was14.6°C. In the case of hot deserts the temperature range from highs of 43.5 to 49° C to minimum temperatures down to -18° C. The hottest ever recorded was 57.8° C. Cold deserts like the Antarctic have temperature ranges from an average of -70 Co during the winter months and -35 Co in the warmer months. The lowest temperature was -89.6 Co was recorded on 21st July, 1983, at Vostok Station"}, {"url": "http://gobiproject.weebly.com/climate.html", "passage_text": "Climate of the Gobi. Monthly average of the temperature: The yearly average temperature is 2.8 degrees, even though the temperature fluctuates greatly between the summer and winter months; the summer can be as hot as 40 degrees Celsius, and the winters can be as cold as -40 degrees Celsius. Precipitation and Temperature Chart of the Gobi Desert: Precipitation and Temperature Chart of Sidney, B.C.: The yearly average of precipitation is less than 100mm; some places in the Gobi only receive rainfall once every 3 years."}, {"url": "http://www.answers.com/Q/What_is_the_average_temperature_in_the_desert", "passage_text": "The average temperature of the hot desert ranges from 20 to 25° C, but its extreme maximum temperature ranges from 43.5 to 49° C. As an example the Sahara desert's night temperatures during the winter months can drop to -5 ºC and some ares can even experience frost. In the case of hot deserts the temperature range from highs of 43.5 to 49° C to minimum temperatures down to -18° C. The hottest ever recorded was 57.8° C. Cold deserts like the Antarctic have temperature ranges from an average of -70 Co during the winter months and -35 Co in the warmer months. The lowest temperature was -89.6 Co was recorded on 21st July, 1983, at Vostok Station"}, {"url": "http://desertbiomes.weebly.com/climate-in-the-desert.html", "passage_text": "This desert's average temperature ranges from 64 to 77 degrees Fahrenheit. The extreme temperature is 110.3 to 120 degrees Fahrenheit. The sand's average temperature is 64 degrees Fahrenheit. The winter brings a little rainfall, but the summers are hot and dry. The average rainfall is about one inch of rain. The soil is rocky and shallow. The Semiarid Desert The semiarid desert's average temperature in the summer is 110.3 to 80.6 degrees Fahrenheit. In the coastal desert the summer temperatures range from 55 to 72.7 degrees Fahrenheit. In the winter the thermometer will not go above 41 degrees. The average rainfall of this particular type of desert is 8-13 centimeters."}, {"url": "http://celosangeles.ucanr.edu/Agriculture/High_Desert_Climate/", "passage_text": "Summers in the desert are generally hot and dry. The average highest temperature is in the upper 90s Fahrenheit, and temperatures of more than 100 are common. The average lowest temperature, on the other hand, sits in the middle 60s Fahrenheit. In some years, the temperature drops to the 40s. Winters are fairly cold in the desert. The average highest temperature is in the upper 50s Fahrenheit. The average lowest temperature is near 30 degrees Fahrenheit (though it can drop down to about 5 or 10 degrees). Elevations range from 2,310 to 3,110 feet. Much of the rain comes in winter"}, {"url": "http://biology.about.com/od/landbiomes/a/aa041406a.htm", "passage_text": "Climate. Deserts are determined by low amounts of rainfall, not temperature. They typically receive less than 30 cm of rain per year. The driest deserts often receive less than 2 cm of rain per year. Temperatures in the desert are extreme. Because of the lack of moisture in the air, heat quickly dissipates as the sun sets. In hot deserts, the temperatures can range from above 100 degrees Fahrenheit in the day to below 32 degrees Fahrenheit at night. Cold deserts generally receive more rainfall than do hot deserts. In cold deserts, temperatures in winter range between 32-39 degrees Fahrenheit with occasional snowfall."}, {"url": "http://deserttawanbanyatpiyaphod.weebly.com/climate.html", "passage_text": "Hot Deserts Hot deserts temperature can raise up to 50 degrees Celsius but the average temperature of 30 degrees Celsius to 40 degrees Celsius. But with extremes the average temperature of extremes is 44 degrees Celsius to 50 degrees Celsius. But the extremes of the cold deserts are a lot more different like the North Pole and the South Pole. The average temperatures of the extreme cold deserts can reach to -80 degrees Celsius in the middle of the winter. But in the summer the temperature can rise to 15 degrees Celsius in the middle of summer."}, {"url": "http://deserttawanbanyatpiyaphod.weebly.com/climate.html", "passage_text": "But the average annual amount of precipitation is 250 mm to 500mm. But the annual precipitation is different in other hot deserts. Cold Deserts Cold Deserts average temperatures are -2 degrees Celsius to 26 degrees Celsius. But the extremes of the cold deserts are a lot more different like the North Pole and the South Pole. The average temperatures of the extreme cold deserts can reach to -80 degrees Celsius in the middle of the winter. But in the summer the temperature can rise to 15 degrees Celsius in the middle of summer."}]