[{"url": "http://www.davemanuel.com/net-worth/al-gore/", "passage_text": "This filing revealed that Al Gore had a fairly modest net worth, with his largest asset being listed as a home in Arlington, VA that was worth between $250,001 - $500,000. Things changed drastically for former Vice President Gore when he left public office, as his net worth has dramatically increased since that time. Much was made of Mitt Romney's net worth during the 2012 Presidential election, but Al Gore may be worth more than even Mitt Romney, thanks to a very fruitful last 13 years. "}, {"url": "http://richestcelebrities.org/richest-politicians/al-gore-net-worth/", "passage_text": "Therefore, his participation into politics is a significant source of Al Gore net worth. Speaking more about his organizations, Al Gore is called a CEO of Alliance of Climate Protection. Moreover, he also belongs to the “Apple, Inc.” Board of Directors. Al Gore net worth: It’s been said that Al Gore net worth has an approximation of 100 million dollars. He’s politician, representative, writer, presenter and statesman."}, {"url": "http://www.celebritynetworth.com/richest-politicians/democrats/al-gore-net-worth/", "passage_text": "$300 Million. Al Gore net worth: Al Gore is a former senator, Vice President, environmental activist and entrepreneur who has a net worth of $300 million. Al Gore has achieved a lot in his years in the public eye, both in the public and private sectors"}, {"url": "http://thenetworth.net/al-gore-net-worth/", "passage_text": "About Al Gore. It has been stated that Al Gore net worth has an estimate of 100 million dollars. He is politician, spokesperson, writer, presenter and statesman. All these involvements and engagements bring millions of dollars to the overall amount of Al Gore net worth."}, {"url": "http://richestcelebrities.org/richest-politicians/al-gore-net-worth/", "passage_text": "Each one of these involvements and betrothals bring vast amounts to the total sum of Al Gore net worth. In the election for the President of the United States in 2000, he was the nominee in the Democratic Party to get the place. Now, Al Gore is called an activist concerned with environment as well as an writer. Al Gore net worth: It’s been said that Al Gore net worth has an approximation of 100 million dollars. He’s politician, representative, writer, presenter and statesman."}, {"url": "http://www.worldsrichpeople.com/al-gore-net-worth.html", "passage_text": "Al Gore Net Worth Is $250 Million. Al Gore, born on March 31, 1948, in Washington, D.C attended Harvard and earned a degree in government with high honors. This was after writing a thesis called the impact of television on the conduct of the presidency. "}, {"url": "http://richbutbroke.com/126/Al-Gore-Net-Worth", "passage_text": "Bottom Line: By controlling his lifestyle and spending less than he makes, Al earns $6,375,000 per year after lifestyle, taxes and other expenses. Jump To Al Gore's Stats. Former Vice President Al Gore s net worth has increased tenfold since leaving office of the U.S. Vice Presidency. His net worth is now $125,736,400. His bankability has come from a variety of sources, but his speaking engagements remain a lucrative source of his present income"}, {"url": "http://www.therichest.com/celebnetworth/politician/democrat/al-gore-net-worth/", "passage_text": "Earnings & Financial Data. The below financial data is gathered and compiled by TheRichest analysts team to give you a better understanding of Al Gore's net worth by breaking down the most relevant financial events such as yearly salaries, contracts, earn outs, endorsements, stock ownership and much more. Choose Year. "}, {"url": "http://beforeitsnews.com/environment/2015/02/what-is-al-gores-net-worth-2521760.html", "passage_text": "* * * * *. Al Gore currently has a net worth of an estimated: $173,333,081. Al Gore’s net worth decreased by $356,295 on 2/25/2015. Information: When Al Gore ran for President in 2000, he filed a public financial disclosure report that revealed that his net worth was somewhere between $700,000 and $1.9 million. Read More …. Source: http://www.climatechangedispatch.com/what-is-al-gores-net-worth.html. CCD Editor’s note: With all the recent clatter about dirty oil money turning scientists into global warming skeptics, I came across this recent article about Al Gore’s net worth. "}]