[{"url": "http://www.medinfo.co.uk/conditions/sprainedankle.html", "passage_text": "An injury of the ankle where the bone is not damaged but the soft tissues are (mainly a ligament on the side of the ankle) is called a sprained ankle. This most commonly occurs when you go over on your ankle."}, {"url": "http://www.emedicinehealth.com/ankle_sprain-health/article_em.htm", "passage_text": "An ankle sprain can range from mild to severe, depending on how badly the ligament is damaged and how many ligaments are injured. With a mild sprain, the ankle may be tender, swollen, and stiff. But it usually feels stable, and you can walk with little pain."}, {"url": "http://www.wakehealth.edu/Health-Central/Common-Athletic-Injuries-Sprains-Shin-Splints-Stress-Fractures/", "passage_text": "A first-degree sprain involves minor stretching of one of the ankle ligaments. Symptoms include some bruising, swelling and pain, but patients are usually able to walk without much discomfort. A second-degree sprain is the result of stretching and tearing of two"}, {"url": "http://physiobench.com/articles/3/Sprained-swollen-and-turned-ankle", "passage_text": "Causes of swollen ankles and sprains. An ankle sprain is an injury in which ligaments are stretched or torn. Ankle sprains are classified as grade 1 – 3 depending on the severity of the sprain: 1  Grade 1 – Some stretching and tearing of the ligament, causes mild swelling, bruising and pain."}, {"url": "http://www.acfaom.org/information-for-patients/common-conditions/ankle-sprains", "passage_text": "An ankle sprain is an injury (a stressing, pulling or tearing) of the ligaments supporting the ankle. Most ankle sprains affect the outside of the ankle, where three small ligaments act together to support the joint. The foot will turn inward at the ankle, in what is called an inversion sprain."}, {"url": "http://www.webmd.com/a-to-z-guides/ankle-sprain-overview", "passage_text": "An ankle sprain can range from mild to severe, depending on how badly the ligament is damaged and how many ligaments are injured. With a mild sprain, the ankle may be tender, swollen, and stiff. But it usually feels stable, and you can walk with little pain."}, {"url": "http://www.medinfo.co.uk/conditions/sprainedankle.html", "passage_text": "Sprained ankle. An injury of the ankle where the bone is not damaged but the soft tissues are (mainly a ligament on the side of the ankle) is called a sprained ankle. This most commonly occurs when you go over on your ankle. Your ankle becomes swollen and painful, and is difficult to walk on."}, {"url": "https://answers.yahoo.com/question/index?qid=20080608091932AAztGaA", "passage_text": "Putting weight on your ankle or trying to move it is painful. Severe sprain (grade 3). A ligament tears completely, resulting in severe pain, swelling, tenderness and bruising. You find it painful and difficult to move your ankle or put any weight on it."}, {"url": "http://www.webmd.com/a-to-z-guides/ankle-sprain-overview", "passage_text": "In more severe sprains, you may hear and/or feel something tear, along with a pop or snap. You will probably have extreme pain at first and will not be able to walk or even put weight on your foot. Usually, the more pain and swelling you have, the more severe your ankle sprain is and the longer it will take to heal."}]