[{"url": "http://www.sparknotes.com/lit/holes/characters.html", "passage_text": "Character Analysis. Stanley Yelnats-The novel's protagonist, Stanley is an overweight kid with a lot of bad luck. He is convicted of a crime he did not commit and is sent to the Camp Green Lake juvenile detention center. Non-violent and generally kind, Stanley has a difficult time in school and at the camp."}, {"url": "http://www.enotes.com/topics/holes/characters", "passage_text": "The Warden (Ms. Walker)—the terrifying woman who runs Camp Green Lake. Stanley Yelnats (Caveman)— Holes’s main character; a fat, innocent, good-hearted boy."}, {"url": "http://www.thebestnotes.com/booknotes/Holes/Holes02.html", "passage_text": "Major Characters. Stanley Yelnats He is the fifteen-year-old main character, the protagonist of the novel. His family has a history of bad luck, and accordingly, Stanley is wrongfully convicted of stealing, and is sent to the detention center, Camp Green Lake."}, {"url": "http://www.amazon.com/Small-Steps-Readers-Circle-Sachar/dp/0385733151", "passage_text": "Reader's Workshop Paragraph-Michael Brailovsky. Small Steps by Louis Sachar, author of Holes is a book about a boy named Armpit. Armpit was one of the campers from Camp Green Lake, the camp in which Stanley Yelnats, from Holes went for stealing a pair of shoes."}, {"url": "http://www.amazon.com/Small-Steps-Holes-Book-2-ebook/dp/B000FCKPPI", "passage_text": "This book, the follow-up to Sachar's blockbuster Holes, is a major departure from the first novel. It's not exactly a sequel, but rather a new story about two of the minor characters from the earlier book."}, {"url": "http://www.amazon.com/Small-Steps-Holes-Book-2-ebook/dp/B000FCKPPI", "passage_text": "Reader's Workshop Paragraph-Michael Brailovsky. Small Steps by Louis Sachar, author of Holes is a book about a boy named Armpit. Armpit was one of the campers from Camp Green Lake, the camp in which Stanley Yelnats, from Holes went for stealing a pair of shoes."}, {"url": "http://www.amazon.com/Small-Steps-Readers-Circle-Sachar/dp/0385733151", "passage_text": "Format: Hardcover. This book, the follow-up to Sachar's blockbuster Holes, is a major departure from the first novel. It's not exactly a sequel, but rather a new story about two of the minor characters from the earlier book."}]