[{"url": "http://geography.about.com/od/physicalgeography/a/tradewinds.htm", "passage_text": "The doldrums, usually located between 5° north and 5° south of the equator, are also known as the Intertropical Convergence Zone or ITCZ for short. The trade winds converge in the region of the ITCZ, producing convectional storms that produce some of the world's heaviest precipitation regions. The ITCZ moves north and south of the equator depending on the season and solar energy received."}, {"url": "http://oceanmotion.org/html/background/equatorial-currents.htm", "passage_text": "The trade winds of the two hemispheres converge in a narrow east-west zone located near the equator known as the Intertropical Convergence Zone (ITCZ). The ITCZ is an important component of the planetary-scale atmospheric circulation that is particularly well defined over the tropical ocean."}, {"url": "http://geography.about.com/od/climate/a/itcz.htm", "passage_text": "By Matt Rosenberg. Near the equator, from about 5° north and 5° south, the northeast trade winds and southeast trade winds converge in a low pressure zone known as the Intertropical Convergence Zone or ITCZ. Solar heating in the region forces air to rise through convection which results in a plethora of precipitation."}, {"url": "http://www.infoplease.com/encyclopedia/weather/trade-winds.html", "passage_text": "The air converging at the doldrums rises high over the earth, recirculates poleward, and sinks back toward the earth's surface in the region of the horse latitudes, thus completing a cycle. The air does not move directly north or south because it is deflected by the rotation of the earth. See wind; Coriolis effect."}, {"url": "http://geography.about.com/od/physicalgeography/a/tradewinds.htm", "passage_text": "Trade Winds. Blowing from the subtropical highs or horse latitudes toward the low pressure of the ITCZ are the trade winds. Named from their ability to quickly propel trading ships across the ocean, the trade winds between about 30° latitude and the equator are steady and blow about 11 to 13 miles per hour."}, {"url": "http://swapsushias.blogspot.com/2014/01/all-you-wanted-to-know-of-intertropical.html", "passage_text": "1 Near the equator, from about 5° north and 5° south, the northeast trade winds and southeast trade winds converge in a low pressure zone known as the Intertropical Convergence Zone or ITCZ."}]