[{"url": "http://www.thinkbabynames.com/meaning/0/Alana", "passage_text": "Alana /ala-na/ [3 sylls.] as a girls' name is pronounced ah-LAH-nah. It is of Old German and Hawaiian origin, and the meaning of Alana is precious; awakening. A rather modern Latinate feminine form of Alan. Also possibly from the Gaelic ailin meaning little rock or possibly derived from Elaine or Helen. Award-winning pop vocalist Alanis Morissette; actress Lana Turner."}, {"url": "http://www.behindthename.com/name/alan", "passage_text": "Meaning & History. The meaning of this name is not known for certain. It was used in Brittany at least as early as the 6th century, and it possibly means either little rock or handsome in Breton. "}, {"url": "http://www.meaning-of-names.com/celtic-names/alan.asp", "passage_text": "Meaning of Alan. Celtic name. In Celtic, the name Alan means-Harmony, stone, or noble. Also fair, handsome. Originally a saints name, it was reintroduced to Britain during the Norman Conquest, remained popular throughout the Middle Ages, and was revived in the 19th century. See also Allen.. Other origins for the name Alan include-Celtic, Irish, English.The name Alan is most often used as a boy name or male name. Celtic Name Meaning-Harmony, stone, or noble. Also fair, handsome"}, {"url": "https://en.wikipedia.org/wiki/Alan_(given_name)", "passage_text": "Etymology and early history [edit]. Alan is a masculine given name in the English language. The name, or forms of the name, were brought to England by people from Brittany, in the 11th century; later the name spread north into Scotland and west into Ireland. "}, {"url": "https://themeaningofthename.com/alan/", "passage_text": "Usage: Alan, of Scottish Gaelic origin, is a very popular first name. It is more often used as a boy (male) name. People having the name Alan are in general originating from Belgium, Czech Republic, Denmark, Estonia, France, Ireland, Malta, Russia, Switzerland, United Kingdom, United States of America. "}, {"url": "http://www.thinkbabynames.com/meaning/1/Alan", "passage_text": "Alan /alan/ [2 sylls.] as a boys' name is pronounced AL-an. It is of Old German origin, and the meaning of Alan is precious. From Adal. Also possibly derived from the Gaelic ailin meaning little rock. Introduced into England by Breton followers of William the Conqueror, such as Alan, Earl of Brittany, who was rewarded for his services with vast estates in the newly conquered kingdom."}, {"url": "http://www.sheknows.com/baby-names/name/alan", "passage_text": "English Meaning: The name Alan is an English baby name. In English the meaning of the name Alan is: Fair; handsome. Famous Bearer: U.S. actor Alan Alda. American Meaning: The name Alan is an American baby name. In American the meaning of the name Alan is: Fair; handsome. Famous Bearer: U.S. actor Alan Alda. Celtic Meaning: The name Alan is a Celtic baby name. In Celtic the meaning of the name Alan is: Harmony, stone, or noble. Also fair, handsome. Originally a saint's name, it was reintroduced to Britain during the Norman Conquest, remained popular throughout the Middle Ages, and was revived in the 19th century. See also Allen."}, {"url": "http://www.babynamewizard.com/baby-name/boy/alan", "passage_text": "Origin of the name Alan: A Celtic name of uncertain etymology. Alan was brought to England by the Normans during the Conquest. The name was borne by Alan, earl of Brittany, a follower of William the Conqueror. From A World of Baby Names by Teresa Norman. Comments and insights on the name Alan: | Edit. One likely reason that Alan (not a traditional Spanish name) is still popular in the Spanish Southwest while not in the rest of the country, is because older relatives with limited English can easily pronounce it in Spanish."}, {"url": "http://www.sheknows.com/baby-names/name/alana", "passage_text": "Gaelic Meaning: The name Alana is a Gaelic baby name. In Gaelic the meaning of the name Alana is: This name of uncertain origin may be a feminine form of Man, or derived from the Irish Gaelic word for 'child'. Hawaiian Meaning: The name Alana is a Hawaiian baby name. In Hawaiian the meaning of the name Alana is: Feminine of Alan awakening."}]