[{"url": "http://www.smithsonianmag.com/history/untold-story-vengeful-japanese-attack-doolittle-raid-180955001/", "passage_text": "Major General Doolittle's fliers in China after the Doolittle Raid on Tokyo of April 18, 1942. (Corbis). The region’s devastation made it difficult to tally who got sick and why, particularly since the Japanese had looted and burned hospitals and clinics. Vandenberg had heard the news broadcasts of the Tokyo raid in the mission compound in the town of Linchwan, home to about 50,000 people, as well as to the largest Catholic church in southern China, with a capacity to serve as many as a thousand."}, {"url": "http://www.answers.com/Q/What_did_Doolittle's_raid_on_Tokyo_accomplish", "passage_text": "Doolittle's Raid took place in 1942 - a direct strike on Tokyo, the Japanese capital. It had a two-fold purpose: To show the Japanese they were not out of our reach by bomber, … and to boost morale back home (it was one of the first blows against Japan after Pearl Harbor). The only thing that came out of Doolittle's raid on Japan was a  sense by the United States that Japan could be attacked on its own  soil. The raid did little to defeat or c … ripple the Japanese army,  air force or navy. 1 person found this useful."}, {"url": "http://www.weegy.com/?ConversationId=B44761DC", "passage_text": "Original conversation. User: What did Doolittle's raid on Tokyo accomplish? 1.It wiped out key industrial factories and sites. 2.Nothing; it was a total and complete failure. 3.It provided a psychological boost for the U.S. 4.It destroyed Japan's political infrastructure.Weegy: 3.It provided a psychological boost for the U.S. Expert ... "}, {"url": "https://en.wikipedia.org/wiki/Doolittle_Raid", "passage_text": "The Doolittle Raid, also known as the Tokyo Raid, on 18 April 1942, was an air raid by the United States on the Japanese capital Tokyo and other places on Honshu island during World War II, the first air raid to strike the Japanese Home Islands. Compared with the future devastating Boeing B-29 Superfortress attacks against Japan, the Doolittle raid did little material damage, and all of it was easily repaired. Eight primary and five secondary targets were struck. In Tokyo, the targets included an oil tank farm, a steel mill, and several power plants."}, {"url": "http://www.2worldwar2.com/doolittle-raid.htm", "passage_text": "The Doolittle raid's results. The raid on Tokyo was a great success. The material damage was small, but the effect on morale, both in the US and in Japan, was significant and important. Flight over the ocean was normal. Near Tokyo, flying at very low altitude, the Doolittle raid bombers met several formations of training aircraft, but no fighters, and no anti-aircraft fire. Their surprise was perfect. It was noon, and Doolittle climbed to 1200ft and dropped his first bomb over the center of Tokyo."}, {"url": "http://www.answers.com/Q/What_did_Doolittle's_raid_on_Tokyo_accomplish", "passage_text": "Yes, Doolittle's bombing raid over Tokyo raised hopes for an  American victory in the Pacific. The bombing raid occurred on April  18, 1942. The only thing that came out of Doolittle's raid on Japan was a  sense by the United States that Japan could be attacked on its own  soil. The raid did little to defeat or c … ripple the Japanese army,  air force or navy. 1 person found this useful."}, {"url": "http://www.doolittleraider.com/80_brave_men.htm", "passage_text": "80 Brave MenThe Doolittle Tokyo Raiders Roster Crew of 1st Aircraft-Plane # 40-2344 - Crew from 34th Squadron - (Bail Out) Lieutenant Colonel Doolittle's bomber was the first over Japan and the first to drop its bomb load. The four incendiaries fell at 12:30 p.m. (Tokyo time) to incinerate a large factory. "}, {"url": "http://www.smithsonianmag.com/history/untold-story-vengeful-japanese-attack-doolittle-raid-180955001/", "passage_text": "smithsonian.com. At midday on April 18, 1942, 16 U.S. Army bombers, under the command of daredevil pilot Lt. Col. Jimmy Doolittle, thundered into the skies over Tokyo and other key Japanese industrial cities in a surprise raid designed to avenge the attack on Pearl Harbor. Vandenberg had heard the news broadcasts of the Tokyo raid in the mission compound in the town of Linchwan, home to about 50,000 people, as well as to the largest Catholic church in southern China, with a capacity to serve as many as a thousand."}, {"url": "https://en.wikipedia.org/wiki/Doolittle_Raid", "passage_text": "The raid was planned and led by Lieutenant Colonel James Jimmy Doolittle, U.S. Army Air Forces. Sixteen U.S. Army Air Forces B-25B Mitchell medium bombers were launched without fighter escort from the U.S. Navy 's aircraft carrier USS Hornet deep in the Western Pacific Ocean, each with a crew of five men. Compared with the future devastating Boeing B-29 Superfortress attacks against Japan, the Doolittle raid did little material damage, and all of it was easily repaired. Eight primary and five secondary targets were struck. In Tokyo, the targets included an oil tank farm, a steel mill, and several power plants."}]