[{"url": "http://www1.salary.com/Bookkeeper-salary.html", "passage_text": "For example the median expected annual pay for a typical Bookkeeper in the United States is $38,210 so 50% of the people who perform the job of Bookkeeper in the United States are expected to make less than $38,210. Source: HR Reported data as of October 2015. Median $38,210. The annual salary for someone with the job title Bookkeeper may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}, {"url": "http://www.ehow.com/info_8199052_average-hourly-rate-bookkeeper.html", "passage_text": "Another key task for the bookkeeper is to provide financial reports for business managers or owners. The average hourly wage for bookkeepers is $16.71, according to 2009 data from the Bureau of Labor Statistics. This wage translates to an annual salary of $34,750 for those working full-time. Higher average wages can be earned by working for school systems, government agencies, company management and specialized industries; bookkeepers working for some of these employers earn well over $20 an hour. Those working in the District of Columbia earn the highest incomes on average, with an hourly rate of $22.65."}, {"url": "http://www.ehow.com/info_8199052_average-hourly-rate-bookkeeper.html", "passage_text": "Hourly Wages. The average hourly wage for bookkeepers is $16.71, according to 2009 data from the Bureau of Labor Statistics. This wage translates to an annual salary of $34,750 for those working full-time. Higher average wages can be earned by working for school systems, government agencies, company management and specialized industries; bookkeepers working for some of these employers earn well over $20 an hour. Those working in the District of Columbia earn the highest incomes on average, with an hourly rate of $22.65."}, {"url": "http://work.chron.com/hourly-wage-bookkeeping-1398.html", "passage_text": "Hourly Wages. According to the U.S. Department of Labor, Bureau of Labor Statistics, the median pay for bookkeepers is $16.36 per hour, or $34,030 per year, as of 2010. O*Net OnLine's more recent estimates are slightly higher hourly at $16.70 as of 2011. The Bureau of Labor Statistics reports that the lowest hourly wage for bookkeepers as of 2010 is approximately $10.22 per hour, with the highest earners drawing hourly wages of $24.75 per hour."}, {"url": "http://smallbusiness.costhelper.com/bookkeepers.html", "passage_text": "1 Hourly rates for an outside bookkeeping service run $20-$50 an hour, depending on complexity and location. 2  Usually you can hire a trained, experienced bookkeeper on a contract basis for $30-$40 an hour, but there can be a minimum monthly charge of $100-$150 for small businesses that don't require a lot of work hours. 1 A typical salary for an in-house bookkeeper in the United States runs $30,400-$39,898 according to Salary.com. 2  The average annual pay for a bookkeeping account executive is $68,294, or $57,600 for a payroll manager, according to BookkeeperList.com."}, {"url": "http://www.bookkeeping-essentials.com/bookkeeping-service.html", "passage_text": "Bookkeeping service fee charged by the hour. Some bookkeepers charge out their bookkeeping service at a basic hourly fee with a set minimum charge. The average rate for general bookkeeping services right now is $50 or less (2015 intuit survey) ... down from $56/hour (2011 Intuit survey) ... up from $35/hour (2009 Intuit survey). The rates may be down because more bookkeepers responded to the survey (vs accountants) than in past years. 1 If a bookkeeper charges well below the average bookkeeping rate 2  ... say less than $20/hour 3  ... I'd recommend you make arrangements for them to take a bookkeeping test to gauge their skills ... because your business could be at risk if poor bookkeeping practices are followed."}, {"url": "http://www1.salary.com/Bookkeeper-hourly-wages.html", "passage_text": "For example the median expected hourly pay for a typical Bookkeeper in the United States is $18 an hour, so 50% of the people who perform the job of Bookkeeper in the United States are expected to make less than $18 an hour. Source: HR Reported data as of October 2015. Median $18. The hourly wages for someone with the job title Bookkeeper may vary depending on a number of factors including industry, company size, location, years of experience and level of education."}]