[{"url": "https://uk.answers.yahoo.com/question/index?qid=20130311163010AAfS4ze", "passage_text": "N.B. An Air Hostess can EARN MUCH MORE when she is in the Horizontal Position (approx. £1,000+ hour upwards) than she can IF she was in the Vertical Position (approx. £30,000 per annum / per year) ! So it pays much more for an Air Hostess to be FLAT ON HER BACK than it does for her to be STANDING UPRIGHT !"}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20080226093702AAB0A0d", "passage_text": "The first year especially a flight attendant will not make a lot of money. As the flight attendant has more seniority, then they receive more money as well. If you like flying to different cities and serving people then an air hostess may be the job for you."}, {"url": "http://www.answers.com/Q/How_much_do_air_hostesses_earn_a_year", "passage_text": "The starting salary is around 59,000 dollars a year to begin with.  An air hostess also gets lots of free travel and the ability to set  their own schedule."}, {"url": "http://www.heathrowcareers.co.uk/air-hostess-salary/", "passage_text": "Introduction. An air hostess salary starts at around £12,000 – £14,000 annually for a starters position, but after you gain a few years of experience this will steadily rise to around £16,000 – £20,000 per annum."}, {"url": "http://www.snagajob.com/job-descriptions/host-and-hostess/", "passage_text": "How much do hosts and hostesses make? Since hosts and hostesses usually don't get any tips, they get paid more per hour than waiters or waitresses do. On average, hosts and hostesses make $8.42 an hour, but depending on the type of restaurant where you work, you could make upwards of $12 an hour."}, {"url": "https://answers.yahoo.com/question/index?qid=20090310140111AAncd2Q", "passage_text": "Best Answer: Your salary depends on a few things. First would be the airline you are flying for as bigger airlines start at a higher pay per flight segment. Second would be your seniority. If you've been flying for 30 years, you could be making upwards of $100K a year!"}]