[{"url": "http://www.worldanimalfoundation.net/f/Panther.pdf", "passage_text": "PANTHER FACT SHEET STATUS: Endangered DESCRIPTION: One of 30 cougar subspecies, the Florida panther is tawny brown on the back and pale gray underneath, with white flecks on the head, neck and shoulder. SIZE: Males, up to 130 pounds; females, 70 pounds. HABITAT: Cypress swamps, pine and hardwood hammock forests."}, {"url": "http://www.floridapanthernet.org/index.php/handbook/history/hunting_methods/", "passage_text": "Panthers, like most cats, are solitary hunters. They are most active at the same time their prey is likely to be about: dawn and dusk. Biologists refer to animals that are most active at these times as crepuscular."}, {"url": "http://blackpantheranimal.com/black-panther-hunting.php", "passage_text": "Black panthers distinguish themselves by an unmatched ability and intelligence displayed in their hunting skills. They are successful hunters and easily adapt to diverse environments and various circumstances. Most black panthers hunt at night. They are masters of concealment and use every available rock, bush, or depression to hide themselves and get as close as possible to their prey. As they wait, they are silent and cautious."}, {"url": "http://www.tigerfriends.com/panthers.html", "passage_text": "Pictures of our Panthers. Many people believe that there is one animal that is called a black panther. Really, the term black panther is refering to a melanistic (black) member of the Panthera family, or big cats. This means it could be a leopard, jaguar, lion or tiger. There were commonly black tigers until the turn of the 20th century."}, {"url": "http://www.tigerfriends.com/panthers.html", "passage_text": "Their are no big black cats that live in North America, we have no wild black panthers. The dark color of the panthers is advantageous for them to hide in the dark forest or jungle and to hunt at night. Commonly, leopards and jaguars are a golden yellow with black spots."}, {"url": "http://www.worldanimalfoundation.net/f/Panther.pdf", "passage_text": "Close examination of one of these black cats will show that the typical markings are still there, and are simply hidden by the surplus of the black pigment melanin. Cats with melanism can coexist with litter mates that do not have this condition. In cats that hunt mainly at night, the condition is not detrimental."}]