[{"url": "http://www.mlrpc.com/articles/what-is-a-disregarded-entity-and-how-is-it-taxed", "passage_text": "Transactions between a foreign branch or disregarded entity and its owner are generally disregarded for U.S. tax purposes, although a payment from the foreign branch or DE to its owner may be treated as a branch remittance requiring recognition of currency gain or loss. However, U.S. transfer pricing principles could be relevant to determining whether non-arm's-length transfer pricing has occurred in transactions between a foreign branch or disregarded entity and its U.S. owner that has resulted in a noncompulsory payment of foreign tax that may not be eligible for a U.S. tax credit."}, {"url": "http://bvcocpas.com/2014/01/what-is-a-disregarded-entity-and-how-is-it-taxed/", "passage_text": "A foreign disregarded entity is treated as a foreign branch of a U.S. corporation for U.S. tax purposes. The IRS defines a foreign disregarded entity (DE) as an “entity that is not created or organized in the United States and that is disregarded as an entity separate from its owner for U.S. income tax purposes.”. According to the CCA, a primary concern of a non-arm’s-length price between a U.S. taxpayer and its foreign branch or disregarded entity is that it may report too much income in the foreign country, resulting in the overpayment of foreign income tax."}, {"url": "http://bticpa.com/what-is-a-disregarded-entity-and-how-is-it-taxed/", "passage_text": "Transactions between a foreign branch or disregarded entity and its owner are generally disregarded for U.S. tax purposes, although a payment from the foreign branch or DE to its owner may be treated as a branch remittance requiring recognition of currency gain or loss. Its DE or unincorporated branch; and. An affiliated U.S. corporation’s foreign branch or disregarded entity. All of the income of a foreign branch is included in the taxable income of its owner regardless of whether any of the income is actually distributed to the owner."}, {"url": "http://www.mlrpc.com/articles/what-is-a-disregarded-entity-and-how-is-it-taxed", "passage_text": "A foreign disregarded entity is treated as a foreign branch of a U.S. corporation for U.S. tax purposes. The IRS defines a foreign disregarded entity (DE) as an entity that is not created or organized in the United States and that is disregarded as an entity separate from its owner for U.S. income tax purposes.. However, U.S. transfer pricing principles could be relevant to determining whether non-arm's-length transfer pricing has occurred in transactions between a foreign branch or disregarded entity and its U.S. owner that has resulted in a noncompulsory payment of foreign tax that may not be eligible for a U.S. tax credit."}, {"url": "https://en.wikipedia.org/wiki/Entity_classification_election", "passage_text": "If an entity is not classified as a corporation, it is treated as a partnership for U.S. tax purposes if it has more than one owner, or is a disregarded entity if it has a single owner (i.e. is treated as part of the single owner). For United States income tax purposes, a business entity may elect to be treated either as a corporation or as other than a corporation. This entity classification election is made by filing Internal Revenue Service Form 8832. Absent filing the form, a default classification applies."}, {"url": "http://bticpa.com/what-is-a-disregarded-entity-and-how-is-it-taxed/", "passage_text": "A foreign disregarded entity is treated as a foreign branch of a U.S. corporation for U.S. tax purposes. The IRS defines a foreign disregarded entity (DE) as an “entity that is not created or organized in the United States and that is disregarded as an entity separate from its owner for U.S. income tax purposes.”. Its DE or unincorporated branch; and. An affiliated U.S. corporation’s foreign branch or disregarded entity. All of the income of a foreign branch is included in the taxable income of its owner regardless of whether any of the income is actually distributed to the owner."}, {"url": "http://biztaxlaw.about.com/od/glossaryd/g/disregardentity.htm", "passage_text": "Definition: A disregarded entity is a business entity that is separate from its owner but which elects to be disregarded as separate from the business owner for federal tax purposes. If this sounds like a double negative, it is."}, {"url": "http://bvcocpas.com/2014/01/what-is-a-disregarded-entity-and-how-is-it-taxed/", "passage_text": "Transactions between a foreign branch or disregarded entity and its owner are generally disregarded for U.S. tax purposes, although a payment from the foreign branch or DE to its owner may be treated as a branch remittance requiring recognition of currency gain or loss. According to the CCA, a primary concern of a non-arm’s-length price between a U.S. taxpayer and its foreign branch or disregarded entity is that it may report too much income in the foreign country, resulting in the overpayment of foreign income tax."}, {"url": "http://www.greenbacktaxservices.com/blog/us-expat-tax-foreign-disregarded-entities/", "passage_text": "If a foreign entity (such as an entity comparable to an LLC) is not a partnership and does not elect to be treated as a corporation for US tax purposes, then it is treated by the US as a foreign disregarded entity, and its owner has to file Form 8858 with his or her personal income tax return every year. In other words, they are disregarded as an entity separate from their owners for US tax purposes. A foreign business entity that is comparable to a US LLC can be treated as a disregarded entity under US tax rules."}]