[{"url": "http://ghr.nlm.nih.gov/handbook/basics/chromosome", "passage_text": "DNA and histone proteins are packaged into structures called chromosomes. In the nucleus of each cell, the DNA molecule is packaged into thread-like structures called chromosomes. Each chromosome is made up of DNA tightly coiled many times around proteins called histones that support its structure. Chromosomes are not visible in the cell’s nucleus—not even under a microscope—when the cell is not dividing."}, {"url": "http://sciencenetlinks.com/student-teacher-sheets/cells-your-body/", "passage_text": "All living things, large or small, plant or animal, are made up of cells. Most living things are made up of one cell and they are called unicellular organisms. Many other living things are made up of a large number of cells that form a larger plant or animal. These living things are known as multicellular organisms. Water makes up about two thirds of the weight of cells. All the parts of your body are made up of cells. There is no such thing as a typical cell. Your body has many different kinds of cells. Though they might look different under a microscope, most cells have chemical and structural features in common."}, {"url": "http://study.com/academy/lesson/cell-membrane-functions-role-structure.html", "passage_text": "A cell is the basic unit of life, and all organisms are made up of one or many cells. One of the things that all cells have in common is a cell membrane. It is a barrier that separates a cell from its surrounding environment. This outer boundary of the cell is also called the plasma membrane. This ensures that the cells will be able to get rid of wastes and take up important nutrients and gases. The plasma membrane is a fluid mosaic. This means that it is flexible and made up of many different types of molecules. Phospholipids form the basic structure of a cell membrane, called the lipid bilayer."}, {"url": "http://study.com/academy/lesson/cell-membrane-functions-role-structure.html", "passage_text": "Phospholipids make up the basic structure of a cell membrane. A single phospholipid molecule has two different ends: a head and a tail. The head end contains a phosphate group and is hydrophilic. This means that it likes or is attracted to water molecules. This ensures that the cells will be able to get rid of wastes and take up important nutrients and gases. The plasma membrane is a fluid mosaic. This means that it is flexible and made up of many different types of molecules. Phospholipids form the basic structure of a cell membrane, called the lipid bilayer."}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/cell", "passage_text": "Cytoskeleton. The cytoskeleton is a network of long fibers that make up the cell’s structural framework. The cytoskeleton has several critical functions, including determining cell shape, participating in cell division, and allowing cells to move."}, {"url": "http://people.eku.edu/ritchisong/301notes1.htm", "passage_text": "Voyage inside the cell. Two types of cells that make up all living things on earth: prokaryotic and eukaryotic. Prokaryotic cells (check this video) , like bacteria, have no 'nucleus', while eukaryotic cells, like those of the human body, do. So, a human cell is enclosed by a cell, or plasma, membrane. "}, {"url": "https://en.wikipedia.org/wiki/Cell_(biology)", "passage_text": "The cell (from Latin cella, meaning small room) is the basic structural, functional, and biological unit of all known living organisms. Cells are the smallest unit of life that can replicate independently, and are often called the building blocks of life. The study of cells is called cell biology. Cells consist of cytoplasm enclosed within a membrane, which contains many biomolecules such as proteins and nucleic acids."}, {"url": "http://www.answers.com/Q/Structures_that_make_up_a_cell_are_called", "passage_text": "The main component of the cell membrane is phospholipids. These are  molecules with a polar (hydrophilic, water-loving) head composed of  a phosphate (and usually a choline) … and a non-polar (hydrophobic,  water-hating) tail composed of fatty acids. "}, {"url": "https://askabiologist.asu.edu/content/cell-parts", "passage_text": "1 Chromosome: a long, thread-like molecule made of the chemical called DNA (deoxyribonucleic acid) that is held together with special proteins and is visible (with strong microscopes) during cell division... 2  more. 3  Molecule: a chemical structure that has two or more atoms held together by a chemical bond. The lipids that are present in the plasma membrane are called phospholipids.. These lipid layers are made up of a number of fatty acid building blocks. The fatty acid that makes up this membrane has two different parts to it-a small water loving head-hydrophilic head."}, {"url": "http://www.nature.com/scitable/topicpage/what-is-a-cell-14023083", "passage_text": "That's because all cells are surrounded by a structure called the cell membrane — which, much like the walls of a house, serves as a clear boundary between the cell's internal and external environments. The cell membrane is sometimes also referred to as the plasma membrane. If the DNA within a cell is not separated from the cytoplasm, then that cell is a prokaryote. All known prokaryotes, such as bacteria and archaea, are single cells. In contrast, if the DNA is partitioned off in its own membrane-bound room called the nucleus, then that cell is a eukaryote."}]