[{"url": "https://en.wikipedia.org/wiki/Tandoor", "passage_text": "Tandoori chicken is a roasted chicken delicacy that originated in Punjab region of India and Pakistan. The chicken is marinated in yogurt marinade seasoned with garam masala, garlic, ginger, cumin, cayenne pepper, and other spices depending on the recipe. In hot versions of the dish, cayenne, red chili powder, or other spices give the typical red color; in milder versions, food coloring is used."}, {"url": "https://en.wikipedia.org/wiki/Tandoor", "passage_text": "The heat for a tandoor was traditionally generated by a charcoal or wood fire, burning within the tandoor itself, thus exposing the food to live-fire, radiant heat cooking, and hot-air, convection cooking, and smoking by the fat and food juices that drip on to the charcoal. The chicken is marinated in yogurt marinade seasoned with garam masala, garlic, ginger, cumin, cayenne pepper, and other spices depending on the recipe. In hot versions of the dish, cayenne, red chili powder, or other spices give the typical red color; in milder versions, food coloring is used."}, {"url": "https://en.wikipedia.org/wiki/Tandoor", "passage_text": "The tandoor design is something of a transitional form between a makeshift earth oven and the horizontal-plan masonry oven. The chicken is marinated in yogurt marinade seasoned with garam masala, garlic, ginger, cumin, cayenne pepper, and other spices depending on the recipe. In hot versions of the dish, cayenne, red chili powder, or other spices give the typical red color; in milder versions, food coloring is used."}, {"url": "http://tandoors.com/", "passage_text": "The one instrument no restaurant can do without. If you've ever wondered why tandoori food is so juicy & flavorful, here is your answer: the tandoori oven. Dishes like Naan, Chicken Tikka, Tandoori Chicken, Tandoori Lamb, Prawns, Sheekh Kabab, and many vegetarian dishes cannot be made without a tandoor. "}, {"url": "https://en.wikipedia.org/wiki/Tandoor", "passage_text": "The term tandoor /tɑːnˈdʊər/ refers to a variety of ovens, the most commonly known is a cylindrical clay or metal oven used in cooking and baking. The tandoor is used for cooking in Southern, Central and Western Asia, as well as in the Caucasus. The chicken is marinated in yogurt marinade seasoned with garam masala, garlic, ginger, cumin, cayenne pepper, and other spices depending on the recipe. In hot versions of the dish, cayenne, red chili powder, or other spices give the typical red color; in milder versions, food coloring is used."}, {"url": "http://www.wisegeek.com/what-is-a-tandoori-oven.htm", "passage_text": "I think the tandoori oven is the first oven that people ever used because it is very simple and is made from clay or stone which our ancestors always had access too. I have seen real clay tandoori ovens in the Middle East during a trip I took there. It looks like a big piece of clay that was carved very deep. It is akin to a traditional pizza oven used in Italian restaurants or an open pit barbecue in American grills. A tandoori oven is designed to provide very high, dry heat. Fuel for the fire is provided by charcoal lining the bottom of the structure."}, {"url": "http://www.thekitchn.com/all-about-tandoor-ovens-what-t-90121", "passage_text": "Pin it. These kinds of ovens are used throughout the Middle East, India, Pakistan, and even parts of Central Asia and China. They can be large, permanent structures ensconced in a kitchen or outdoor area, or they can be smaller, portable ovens that can be carried from place to place. One of the biggest advantages of these ovens is that once they are heated, they will maintain a consistent high temperature for hours with very little additional fuel. This is a big plus in parts of the world where fuel is scarce."}, {"url": "http://masala-art.com/2012/04/25/what-is-tandoori-cooking/", "passage_text": "While a tandoor can be used to prepare breads but is also commonly used for preparing marinated meats or vegetables over an intense charcoal fire. A tandoor is a clay oven, it fact it is basically almost like a very large clay pit, large enough to hold a small fire created by slow burning wood charcoal. In addition to the colors provided by the spices, tandoori marinades are also flavored traditionally with ginger, garlic, coriander powder, cayenne pepper, and garam masala. Garam masala is a combination of roasted and ground cardamom, cumin, cinnamon, cloves, nutmeg and black pepper."}, {"url": "http://www.tandoors.com/tandoors.php", "passage_text": "The one instrument no restaurant can do without. The tandoor provides a flavor like no other. If you've ever wondered why tandoori cooking is so rich and flavorful, here is your answer: the tandoori oven. Dishes like Naan, Chicken Tikka, Tandoori Chicken, Tandoori Lamb, Prawns, Sheekh Kabab, and many vegetarian dishes cannot be made without a tandoor. "}, {"url": "https://en.wikipedia.org/wiki/Tandoori_chicken", "passage_text": "Tandoori chicken is a dish originating in the Indian subcontinent. It is widely popular in South Asia, Malaysia, Singapore, Indonesia, the Middle East and the Western world. It consists of roasted chicken prepared with yogurt and spices. The name comes from the type of cylindrical clay oven, a tandoor, in which the dish is traditionally prepared. Tandoori chicken was popularized in post-independent India by the Moti Mahal, Daryaganj, Delhi, owned by Kundan Lal Jaggi, Kundan Lal Gujral and Thakur Das Mago, when it was served to the first Prime Minister of India, Jawaharlal Nehru."}]