[{"url": "http://www.texasoncology.com/types-of-cancer/leukemia/adult-acute-lymphoblastic-leukemia/adult-acute-lymphoblastic-leukemia-remission-induction/", "passage_text": "Therapy is divided into two phases, remission induction and post-remission therapy. Remission induction chemotherapy is administered to produce a complete remission (complete disappearance of detectable leukemia) in the bone marrow and other sites. When they are found to be effective, they are then evaluated in remission induction regimens. This is more relevant for adults than children, since over 95% of children achieve a complete remission with existing treatment regimens."}, {"url": "http://www.cancer.gov/publications/dictionaries/cancer-terms?CdrID=45736", "passage_text": "listen (in-DUK-shun THAYR-uh-pee). The first treatment given for a disease. It is often part of a standard set of treatments, such as surgery followed by chemotherapy and radiation. When used by itself, induction therapy is the one accepted as the best treatment. If it doesn’t cure the disease or it causes severe side effects, other treatment may be added or used instead. "}, {"url": "http://www.cancer.ca/en/cancer-information/cancer-type/multiple-myeloma/treatment/induction-therapy/?region=on", "passage_text": "Induction therapy for multiple myeloma. Induction therapy is the first phase of treatment for multiple myeloma. The goal of induction therapy for multiple myeloma is to reduce the number of plasma cells in the bone marrow and the proteins that the plasma cells produce. Induction therapy is usually given for 3–4 weeks. Induction therapy is given to people with active (symptomatic) multiple myeloma. Induction therapy is the first phase of treatment before higher-dose chemotherapy is given. Induction therapy may consist of one or a combination of the following types of drugs:"}, {"url": "http://www.wisegeekhealth.com/what-is-induction-therapy.htm", "passage_text": "Top 10 unbelievable historical concurrencies. Induction therapy is the first stage in cancer treatment. The term “induction therapy” is also sometimes used to refer to the treatment of other conditions, depending on the setting. Also known as primary or first line therapy, this therapy is offered with the goal of reducing the number of cancer cells and making the cancer vulnerable to additional treatment. Idarubicin is a chemical that is often used in dealing with cancer in induction therapy. This drug gets at the very core of cancerous DNA growths and prevents the protein signals from transmitting and multiplying the leukemic growths."}, {"url": "http://www.wisegeekhealth.com/what-is-induction-therapy.htm", "passage_text": "Induction therapy is the initial phase of cancer treatment when drugs are given to reduce the number of cancer cells. Cancer patients undergoing induction therapy may experience a number of side effects, such as fatigue, nausea and loss of appetite. Idarubicin is a chemical that is often used in dealing with cancer in induction therapy. This drug gets at the very core of cancerous DNA growths and prevents the protein signals from transmitting and multiplying the leukemic growths."}, {"url": "http://www.cancerresearchuk.org/about-cancer/type/all/treatment/which-treatment-for-acute-lymphoblastic-leukaemia", "passage_text": "Doctors divide treatment for ALL into different phases. The first phase is called remission induction. You have treatment with chemotherapy and usually steroids. The aim is to destroy the leukaemia cells and get you into remission. In remission, there are no leukaemia cells in your blood or bone marrow. "}, {"url": "http://www.medicinenet.com/script/main/art.asp?articlekey=20179", "passage_text": "Induction therapy: The first in a series of therapeutic measures taken to treat a disease, typically a cancer. "}, {"url": "https://en.wikipedia.org/wiki/Short_Course_Immune_Induction_Therapy", "passage_text": "Short Course Immune Induction Therapy or SCIIT, is a therapeutic strategy employing rapid, specific, short term-modulation of the immune system using a therapeutic agent to induce T-cell non-responsiveness, also known as operational tolerance. "}, {"url": "http://medical-dictionary.thefreedictionary.com/induction+chemotherapy", "passage_text": "induction chemotherapy, chemotherapy as the initial treatment for cancer, especially as part of combined modality therapy. The use of chemotherapy as a primary treatment for patients presenting with advanced cancer for which there is no alternative treatment."}, {"url": "http://www.lymphomainfo.net/articles/lymphoma-treatment/induction-therapy", "passage_text": "Induction therapy is a term used to describe the first major treatment or therapy administered to a cancer patient. It does not by definition refer to any specific type of therapy in and of itself; rather, it merely refers to the initial therapeutic effort. Naturally, the hope for all patients and their doctors is that induction therapy succeed, and perhaps cure the patient of his or her cancer (this result is more common in early stage cancers, and more common in lymphoid cancers such as lymphomas and leukemias)."}]