[{"url": "https://www.hillandponton.com/va-disability-ratings-for-heart-disease/", "passage_text": "In an earlier post, I discussed establishing VA service connected compensation for Ischemic Heart Disease for those veterans exposed to Agent Orange. In this post, I will focus on VA service connected compensation ratings for heart disabilities."}, {"url": "http://www.publichealth.va.gov/exposures/agentorange/conditions/ischemicheartdisease.asp", "passage_text": "As a result, VA recognized ischemic heart disease as associated with exposure to Agent Orange or other herbicides during military service. VA's final regulation recognizing this association took effect on October 30, 2010. View more research on health effects of Agent Orange."}, {"url": "http://nationalvietnamveteransfoundation.org/agentorange.htm", "passage_text": "The average rating for ischemic heart diseases is expected to be 60 percent. In calculating VA costs from this change, VA assumes that 80 percent of the eligible population will apply for benefits and 100 percent of those who do will be approved."}, {"url": "https://www.hillandponton.com/va-disability-ratings-for-heart-disease/", "passage_text": "As a threshold matter, if you are taking any type of continuous medication to treat your ischemic heart disease, the VA should provide at least the minimum rating of 10% for your heart disability."}, {"url": "http://www.publichealth.va.gov/exposures/agentorange/conditions/ischemicheartdisease.asp", "passage_text": "VA benefits for ischemic heart disease. Veterans with ischemic heart disease who were exposed to herbicides during service may be eligible for disability compensation and health care. Veterans who served in Vietnam, the Korean demilitarized zone or another area where Agent Orange was sprayed may be eligible for a free Agent Orange registry health exam."}, {"url": "http://lawyers-veterans-benefits.com/ischemic-heart-disease-va/", "passage_text": "The VA is now granting veterans benefits claims for ischemic heart disease to Vietnam War veterans and Korean War veterans exposed to Agent Orange. To learn more about your potential VA disability claim for ischemic heart disease read below or call an experienced VA disability attorney for free! (888) 959-9908."}, {"url": "http://www.nolo.com/legal-encyclopedia/getting-veterans-disability-compensation-heart-cardiovascular-problems.html", "passage_text": "Enter Your Zip Code to Connect with a Lawyer Serving Your Area. Veterans can be awarded service-connected disability compensation for various heart conditions. The VA evaluates cardiovascular conditions using the VA Schedule for Rating Disabilities, diagnostic codes 7000 through 7123."}, {"url": "http://lawyers-veterans-benefits.com/ischemic-heart-disease-va/", "passage_text": "VA disability compensates veterans with ischemic heart disease who were exposed to Agent Orange in the Vietnam War or Korean War. Agent Orange caused dozens of life-threatening impairments the VA now grants disbility for. Agent Orange is a major factor in many VA disability claims for ischemic heart disease."}]