[{"url": "http://www.the-lawn-advisor.com/Average-Cost-for-Lawn-Service.html", "passage_text": "The average cost for lawn service will depend on what exactly you sign up for. A typical estimate will include prices for a weekly lawn cut, weeding beds, a spring cleanup, trimming hedges, a fall cleanup, and a chemical program. These items may be priced individually or lumped together as a monthly maintenance price. "}, {"url": "http://www.trugreen.com/products-and-services/trucomplete/", "passage_text": "Special price of $29.95 is for first application only, for new residential EasyPay or PrePay customers only, and applies to lawns up to 5,000 square feet. For lawns more than 5,000 square feet or for the regular lawn application price for a lawn of any size, please call for estimate. Valid at participating TruGreen locations."}, {"url": "http://www.costowl.com/home-improvement/landscaping-lawncare.html", "passage_text": "1 A reasonable price for lawn care is $25-$35 per week, or $100-$140 per month. 2  By the hour, this works out to $20-$25 per hour, or $40-$50 for half acre lawns. 3  Most landscapers will include basic lawn maintenance such as lawn mowing and edging. 1 By the hour, this works out to $20-$25 per hour, or $40-$50 for half acre lawns. 2  Most landscapers will include basic lawn maintenance such as lawn mowing and edging. 3  Larger lawns cost more. 4  The local cost of gasoline will affect the price"}, {"url": "http://www.trugreen.com/products-and-services/trucomplete/", "passage_text": "To get pricing for your lawn, simply select a plan and enter your address. *$29.95 First Application: Requires purchase of annual plan. Special price of $29.95 is for first application only, for new residential PrePay customers only, and applies to lawns up to 5,000 square feet. For lawns more than 5,000 square feet or for the regular lawn application price for a lawn of any size, please call for estimate. Valid at participating TruGreen locations."}, {"url": "http://www.healthylawns.net/trugreen-cost-pricing/", "passage_text": "TruGreen Cost Factors. There are a variety of situations and scenarios that factor in to the cost of your lawn control. For instance, a large lawn might cost a bit extra, while a smaller one would generally be a bit cheaper in comparison. Some lawn care packages include special services that can affect their cost"}, {"url": "http://www.landscapingideasonline.com/lawns/cost-of-lawn-care", "passage_text": "If you are looking for the very barest of basic services, the average cost of lawn care services in Small Town, USA should run somewhere in the neighborhood of $30 per week, which puts you anywhere from between $120-150 per month. While there is no set in stone average cost of lawn care services in the U. S. $30 a week is a good starting point to consider and you can get a better idea by shopping around locally for your specific area."}, {"url": "http://www.costowl.com/home-improvement/landscaping-lawncare.html", "passage_text": "Author: Brian Eckert. 1  A reasonable price for lawn care is $25-$35 per week, or $100-$140 per month. 2  By the hour, this works out to $20-$25 per hour, or $40-$50 for half acre lawns. 1 By the hour, this works out to $20-$25 per hour, or $40-$50 for half acre lawns. 2  Most landscapers will include basic lawn maintenance such as lawn mowing and edging. 3  Larger lawns cost more. 4  The local cost of gasoline will affect the price"}, {"url": "http://www.costowl.com/home-improvement/landscaping-lawncare.html", "passage_text": "Lawn Care Prices. 1  A reasonable price for lawn care is $25-$35 per week, or $100-$140 per month. 2  By the hour, this works out to $20-$25 per hour, or $40-$50 for half acre lawns. 3  Most landscapers will include basic lawn maintenance such as lawn mowing and edging. 4  Larger lawns cost more. 1 By the hour, this works out to $20-$25 per hour, or $40-$50 for half acre lawns. 2  Most landscapers will include basic lawn maintenance such as lawn mowing and edging. 3  Larger lawns cost more. 4  The local cost of gasoline will affect the pric"}, {"url": "http://www.healthylawns.net/trugreen-cost-pricing/", "passage_text": "TruGreen does offer several set lawn care packages with estimated price ranges. The cheapest is the TruMaintenance Lawn Plan, which covers all your basic lawn care needs. It starts at an affordable $375 per year and includes everything you need to get started on your new and beautiful lawn. There are a variety of situations and scenarios that factor in to the cost of your lawn control. For instance, a large lawn might cost a bit extra, while a smaller one would generally be a bit cheaper in comparison."}]