[{"url": "http://www.ibtimes.com/ten-most-active-volcanoes-world-551875", "passage_text": "Africa’s most active volcano, Mount Nyiragongo is located in Virunga National Park in the Democratic Republic of Congo. The main crater is 2km wide and, since 1882, it has erupted at least 34 times. REUTERS. Most experts agree that Kilauea is Earth’s most active volcano. It is the most recent of a series of volcanoes that created the Hawaiian archipelago of islands and has been in a state of almost constant eruption since 1983. The volcano only rises 4,090 feet (1,247 meters) above sea level, but it’s still growing"}, {"url": "http://www.ibtimes.com/ten-most-active-volcanoes-world-551875", "passage_text": "There are approximately 1,500 active volcanoes in the world today and 75 percent of them are located in the Pacific Ring of Fire. On average, 50-70 volcanoes erupt every year. Click Start to view the ten most active volcanoes on Earth. REUTERS. Most experts agree that Kilauea is Earth’s most active volcano. It is the most recent of a series of volcanoes that created the Hawaiian archipelago of islands and has been in a state of almost constant eruption since 1983. The volcano only rises 4,090 feet (1,247 meters) above sea level, but it’s still growing"}, {"url": "http://www.answers.com/Q/Where_are_most_of_the_active_volcanoes_on_earth_located", "passage_text": "Most of the active volcanoes on the continents are located along areas of plate collision and subduction, most notably the so-called 'Ring of Fire', an area of earthquakes and volcanism around the perimeter of the Pacific Ocean. The most active volcanoes are found on the so-called ring of fire in Pacific Ocean. Indonesia has several volcanoes inclu … ding Krakatoa. Hawaii's Kilauea produces the most lava of all active volcanoes in the world. North America has Mt. St. Helens and Mt. Rainier in Washington, USA. Mexico has several including Paricutin parícutin And nevado De. Toluca europe Has. Mt. Etna, generally volcanoes are located near tectonic plates that are converging or. diverging"}, {"url": "http://www.geology.sdsu.edu/how_volcanoes_work/Volcano_tectonic.html", "passage_text": "As demonstrated in the world map below, most of the ~550 active volcanoes on earth are located along the margins of adjacent plates. World map showing plate boundaries (blue lines), the distribution of recent earthquakes (yellow dots) and active volcanoes (red triangles). Courtesy of NASA. "}, {"url": "http://earthsky.org/earth/what-is-the-ring-of-fire", "passage_text": "The Ring of Fire is one of the most geologically active areas on Earth, and is a site for frequent earthquakes and powerful volcanic eruptions. Many volcanoes on Earth are located around the Pacific Ring of Fire. Image Credit: U.S. Geological Survey. There are more than 450 active and dormant volcanoes located within the Ring of Fire."}, {"url": "http://www.cotf.edu/ete/modules/volcanoes/vlocation.html", "passage_text": "Many of the world's active volcanoes are located around the edges of the Pacific Ocean: the West Coast of the Americas; the East Coast of Siberia, Japan, the Philippines, and Indonesia; and in island chains from New Guinea to New Zealand--the so-called Ring of Fire (diagram to left). "}, {"url": "http://www.answers.com/Q/Where_are_most_of_earths_active_volcanoes_located", "passage_text": "Volcanoes are located throughout most of the world. The most active volcanoes are found on the so-called ring of fire in Pacific Ocean. Indonesia has several volcanoes including Krakatoa. Hawaii's Kilauea produces the most lava of all active volcanoes in the world. North America has Mt. St. Helens and Mt. Rainier in Washington, USA. Mexico has several including Paricutin parícutin And nevado De. Toluca europe Has. Mt. Etna, generally volcanoes are located near tectonic plates that are converging or. diverging Hawaii's Kilauea produces the most lava of all active volcanoes in the world. North America has Mt. St. Helens and Mt. Rainier in Washington, USA. Mexico has several including Paricutin parícutin And nevado De. toluca"}, {"url": "http://10mosttoday.com/10-most-active-volcanoes-in-the-world/", "passage_text": "4. Mount Merapi, Indonesia – “Fire Mountain” is an active volcano located on the border between Central Java and Indonesia. It is the most active volcano in Indonesia and has erupted regularly since 1548. T housands of people live on the flanks of the volcano. 10 Most Active Volcanoes In The World: Mount Merapi. 5. "}]