[{"url": "http://www.foodsubs.com/MeatPorkLeg.html", "passage_text": "pork leg = ham The meat from this part of the pig is usually made into hams, but fresh leg meat is lean and makes a terrific roast. Cuts: fresh pork leg = fresh ham = fresh leg of pork Notes: This makes a great roast for a large crowd. It's usually cured as ham, so you might have to special-order it to get it fresh. The bottom half is called the shank portion = shank roast = leg roast, while the upper is called a top leg roast = inside roast = butt portion = pork leg butt = fresh ham butt = pork leg roast sirloin portion."}, {"url": "https://en.wikipedia.org/wiki/Boston_butt", "passage_text": "Pork shoulder with bone and rind. Boston butt or pork butt is the American name for a cut of pork that comes from the upper part of the shoulder from the front leg and may contain the blade bone. Boston butt is the most common cut used for pulled pork, a staple of barbecue in the southern United States. In the United Kingdom, Boston butt is known as pork shoulder on the bone, since regular pork shoulder normally has the bone removed and then rolled and tied back into a joint."}, {"url": "http://modernfarmer.com/2014/03/pork-101/", "passage_text": "PORK SHOULDER, or PORK BUTT. Starting from the front of the pig: Pork shoulder (also called pork butt or “Boston butt”) is generally sold as a 5 to 10 pound boneless roast at the grocery store. (Pork shoulder chops are sold with bones, but those are less common.). Pork is one of the most commonly consumed meats in the world and we're always down for a good pork dinner. But there are many cuts to choose from, some better known than others, even just at your neighborhood grocery store."}, {"url": "http://www.foodsubs.com/MeatPorkLeg.html", "passage_text": "A steak cut from the leg is called a fresh pork leg steak. Substitutes: pork center loin roast OR pork sirloin roast OR Boston butt. fresh pork leg steak = leg of pork steak = pork leg cutlet = fresh ham steak Notes: This is a steak cut from the middle of a fresh pork leg. It's economical, but a bit tough, so you might want to marinate it before grilling or broiling it. The bottom half is called the shank portion = shank roast = leg roast, while the upper is called a top leg roast = inside roast = butt portion = pork leg butt = fresh ham butt = pork leg roast sirloin portion."}, {"url": "http://www.recipetips.com/kitchen-tips/t--158/cuts-of-pork.asp", "passage_text": "Primal Cut-Leg/Ham. The leg is a primal cut that is located at the rear of the pig and is made up of the rump and hind leg. The meat from the leg is lean and flavorful but is not as tender as the meat from the loin. Generally the cuts from the leg are more economical than those of the loin. "}, {"url": "http://amazingribs.com/recipes/porknography/pork_cuts.html", "passage_text": "Shoulder. The pork shoulder is a complex weave of muscles, connective tissues, sinew, and fat and it runs from the spine down to the elbow of the front leg including the shoulder blade, forward to the neck, and back to the ribs and may include the first two or three small rib bones. If they did, they would be called soyboys. Rib roast (a.k.a. bone-in pork loin rib roast, a.k.a. bone-in loin rib roast, a.k.a. center cut rib roast, a.k.a. prime rib of pork). This is the whole pork loin muscle, up to 2' long and 6 thick, with the baby back ribs attached."}, {"url": "http://www.edinformatics.com/culinaryarts/food_encyclopedia/cuts_of_meat.htm", "passage_text": "1 Legs/Hams-Although any cut of pork can be cured, technically speaking only the back leg is entitled to be called a ham. 2  Legs and shoulders, when used fresh, are usually cut bone-in for roasting, or leg steaks can be cut from the bone. "}, {"url": "http://www.porkbeinspired.com/cuts/fresh-hamfresh-leg/", "passage_text": "Fresh Pork Leg Basics. Fresh pork leg, also known as fresh ham, is the uncured hind leg of the hog. Like cured ham, fresh leg of pork/fresh ham is available either bone-in or boneless and may be purchased whole or halved. "}]