[{"url": "http://www.biology-online.org/dictionary/Coelom", "passage_text": "Definition. noun, plural: coeloms. (1) A fluid-filled body cavity formed from the splitting of lateral plate mesoderm during embryonic development. (2) A body cavity. Supplement. Animals may be grouped based on the coelom 1  : coelomates. 2  pseudocoelomates. 3  acoelomates. "}, {"url": "http://www.merriam-webster.com/dictionary/coelom", "passage_text": "Definition of COELOM. : the usually epithelium-lined space between the body wall and the digestive tract of metazoans above the lower worms. — coe·lo·mate \\ˈsē-lə-ˌmāt\\ adjective or noun. — coe·lo·mic \\si-ˈlae-ˈlä, -mik-\\ ˈlō. Adjective see coelom defined for. KIDS. advertisement Definition of COELOM. : the usually epithelium-lined space between the body wall and the digestive tract of metazoans above the lower worms. — coe·lo·mate \\ˈsē-lə-ˌmāt\\ adjective or noun. — coe·lo·mic \\si-ˈlae-ˈlä, -mik-\\ ˈlō. adjective"}, {"url": "http://www.merriam-webster.com/dictionary/coelom", "passage_text": "Medical Definition of COELOM. : the usually epithelium-lined body cavity of metazoans above the lower worms that forms a large space when well developed between the digestive tract and the body wall. — coe·lo·mate \\ˈsē-lə-ˌmāt\\ adjective or noun. Definition of COELOM. : the usually epithelium-lined space between the body wall and the digestive tract of metazoans above the lower worms. — coe·lo·mate \\ˈsē-lə-ˌmāt\\ adjective or noun. — coe·lo·mic \\si-ˈlae-ˈlä, -mik-\\ ˈlō. adjective"}, {"url": "http://www.merriam-webster.com/dictionary/coelomoduct", "passage_text": "Definition of COELOMODUCT. : an excretory and genital duct that is typical of certain invertebrates (as annelid worms) and has a wide and usually ciliated lumen opening into the coelom by a broad funnel and terminating externally by a small pore in the body wall. ADVERTISEMENT. Origin of COELOMODUCT. coelom + -o- + duct. This word doesn't usually appear in our free dictionary, but the definition from our premium Unabridged Dictionary is offered here on a limited basis. Note that some information is displayed differently in the Unabridged."}, {"url": "http://www.memidex.com/coelom", "passage_text": "Coelom | SEE | coeloms | coelomata | LOH. a fluid-filled cavity between the intestines and the body wall of some higher metazoans. It's lined with a mesodermal epithelium. The coelom is formed within the mesoderm of the embryo. In mammals, the coelom then develops into the peritoneal, pleural,... coelom | body cavity | celom | coelomic. The cavity within the body of all animals higher than the coelenterates and certain primitive worms, formed by the splitting of the embryonic mesoderm ..."}, {"url": "http://www.encyclopedia.com/doc/1O8-coelomicfluid.html", "passage_text": "© A Dictionary of Zoology 1999, originally published by Oxford University Press 1999. coelomic fluid The fluid within the coelom; in some animal groups it functions as a hydrostatic skeleton and it may also serve as a circulatory medium. Cite this article. Pick a style below, and copy the text for your bibliography. MLA"}, {"url": "http://medical-dictionary.thefreedictionary.com/coelomic", "passage_text": "coelom. body cavity, especially the cavity in the mammalian embryo between the somatopleure and splanchnopleure, which is both intra-and extraembryonic; it develops into the pleural, peritoneal, and pericardial cavities. adj., adj coelom´ic. "}, {"url": "http://www.yourdictionary.com/coelom", "passage_text": "Sentence Examples. » more... 1  Its cavity also is at first independent of the coelom though later invaded by the latter. 2  The body wall of the Chaetopoda consists of a dermo-muscular tube which is separated from the gut by the coelom and its peritoneal walls, except in most leeches. "}]