[{"url": "http://www.postalcodedb.com/AlphabeticSearch.aspx?country=Bahrain&city=Manama", "passage_text": "Postal Code for Manama, Bahrain. This page contains all the postal codes we have for Manama, Bahrain. In many cases a single city has more than one postal code, so we will list all our records for this city. To view the full details, select the postal code you want and proceed to the detailed page. Our records often include geographical coordinates of Manama and it's corresponding postal code. In the result box below, you can find the postal code of Manama and it's location on the map if we have the location information available. Every postal code is also located in a region or a district, in case we know the district or region of the city it will too be listed in the results"}, {"url": "http://www.answers.com/Q/What_is_the_postal_code_for_Manama", "passage_text": "In the UK a post code is the same as a USA Zip Code.   If you are posting a letter to the UK the post code will help it get to the correct place (each street or area will have a post code allocated). "}, {"url": "http://www.about-bahrain.com/general/post-code-zip-code-for-bahrain", "passage_text": "if it is for shipment purposes then all you need is the correct city name such as Manama. However the postal codes / zip code below will also work as they might fall in bahrain (sources via yahoo). Bahrain Zip Codes: 9999, 999 and 199 to 1299 (1 to 12 number in these define each sub divisions created within Bahrain). "}, {"url": "https://answers.yahoo.com/question/index?qid=20070627215243AA0WTMB", "passage_text": "Zip/ Postal code of Bahrain. In many newslatters it is asked to fill street number Zip Postal code numbers. can somebody help me please. There is no zip/postal code for Bahrain. You'll just have to keep this blank when you're filling out a form or say that it's N/A. I know how frustrating this can be when you're filling out an electronic form which does not proceed until a number is given."}, {"url": "https://www.countrycode.org/bahrain", "passage_text": "CountryCode.org is your complete guide to make a call from anywhere in the world, to anywhere in the world. This page details Bahrain phone code. The Bahrain country code 973 will allow you to call Bahrain from another country. Bahrain telephone code 973 is dialed after the IDD. Bahrain international dialing 973 is followed by an area code. The Bahrain area code table below shows the various city codes for Bahrain. Bahrain country codes are followed by these area codes. With the complete Bahrain dialing code, you can make your international call."}, {"url": "http://www.answers.com/Q/Zip_code_of_Bahrain", "passage_text": "A zip code is a five or nine digit numerical code that is assigned  to a specific region of the United States. It is used to quickly  sort mail to send it to its destination … .    It is similar to a post code in the UK. You write it in the address  of where you are sending the item.    The postal codes used in the Philippines are also called Zip Codes,  but they are a completely separate system. Many other countries  have postal codes, but it is incorrect to call them zip codes.. Another answer, which is probably the one that has to do with zip codes: Dictionaries say that  … zip in zip code is from the initial letters of zone improvement plan.. Zip was also already a word meaning to cause to go fast.. So zip code means a zone improvement plan that causes mail"}, {"url": "http://www.about-bahrain.com/tag/bahrain-zip-code", "passage_text": "Post code | zip code for Bahrain. if it is for shipment purposes then all you need is the correct city name such as Manama. However the postal codes / zip code below will also work as they might fall in bahrain (sources via yahoo). Bahrain Zip Codes: 9999, 999 and 199 to 1299 (1 to 12 number in these define each sub divisions created within Bahrain)"}, {"url": "https://answers.yahoo.com/question/index?qid=20070627215243AA0WTMB", "passage_text": "Rating Newest Oldest. Best Answer: There is no postal zip code in Bahrain. You just indicate the P.O.Box number and the area. For example: ABC Company P.O.Box: 2990 Manama, Bahrain If there is no P.O.box number, you have to indicate the flat or house number, street name or number and block and also the area. For example: House # 1223 Road # 1313 Block # 198 Aali, Bahrain As for phone codes, Bahrain code is +973. There is no zip/postal code for Bahrain. You'll just have to keep this blank when you're filling out a form or say that it's N/A. I know how frustrating this can be when you're filling out an electronic form which does not proceed until a number is given."}]