[{"url": "http://www.dogingtonpost.com/be-prepared-for-possible-canine-paralysis/", "passage_text": "There are many possible causes of canine paralysis, and one of them is ticks. Some ticks can carry Lyme disease and become a probable cause of paralysis on your dog. It transfers through the bite of the tick onto your dog, and the virus or toxin is spread through the bloodstream, entering the organs of your dog. Simply put, do not take simple infections for granted, because they might trigger paralysis in your dog. Another cause of paralysis is spinal disk problems in long-backed dogs like Dachshunds. This can cause paralysis of the hind legs, particularly in older dogs. We had one named Tiny who developed apparently some slipped disk problems at about age 17"}, {"url": "http://www.vetinfo.com/causes-sudden-dog-paralysis.html", "passage_text": "Complications from a Tick Bite. The leading cause of dog paralysis is tick bites. Some ticks inject a neurotoxin into your dog's system as they bite, and dogs may react to this in different ways. In rare cases, or if your dog has a severe tick infestation with lots of bites, he may experience a sudden paralysis. "}, {"url": "https://answers.yahoo.com/question/index?qid=20080907131308AA57vw6", "passage_text": "Dachshunds especially have a very fragile spines. The giant breeds sometimes have spinal problems. Some types of bull dogs do too. Some causes of paralysis: Herniated disk-The spine built like a line of soda cans (spinal bones) separated by jelly donuts (cartilage disks). The jelly donuts can burst and cause catastrophic failure of the spine. ~VERY common for Doxies. It can happen if they sleep funny. Infection. "}, {"url": "http://www.answers.com/Q/What_could_cause_a_dog_to_become_paralyzed_in_the_back_legs", "passage_text": "Paralysis of the legs can be caused by several problems-a blood clot in the end of the aorta, a broken back, broken hip bones, etc. To find the cause you will need to take your dog to a veterinarian for an examination, probably with blood work and X-rays. The rash may be secondary to the paralysis, particularly if the rash is on the legs or belly. "}, {"url": "https://en.wikipedia.org/wiki/Paralysis", "passage_text": "Paralysis is loss of muscle function for one or more muscles. Paralysis can be accompanied by a loss of feeling (sensory loss) in the affected area if there is sensory damage as well as motor. About 1 in 50 people have been diagnosed with some form of paralysis, transient or permanent. Paralysis is most often caused by damage in the nervous system, especially the spinal cord. Other major causes are stroke, trauma with nerve injury, poliomyelitis, cerebral palsy, peripheral neuropathy, Parkinson's disease, ALS, botulism, spina bifida, multiple sclerosis, and Guillain-Barre barré. syndrome"}, {"url": "http://www.dogingtonpost.com/be-prepared-for-possible-canine-paralysis/", "passage_text": "Another probable cause of dog paralysis is the development of a tumor in the spine of your dog. And as we all know, tumors are usually malignant, and they can cause life-threatening effects to your dog as it does on humans. Simply put, do not take simple infections for granted, because they might trigger paralysis in your dog. Another cause of paralysis is spinal disk problems in long-backed dogs like Dachshunds. This can cause paralysis of the hind legs, particularly in older dogs. We had one named Tiny who developed apparently some slipped disk problems at about age 17"}, {"url": "http://www.petmd.com/dog/conditions/neurological/c_dg_paralysis", "passage_text": "In some cases, the dog will not be able to move its legs at all, a condition of total paralysis, and in other cases, there may still be some communication between the brain and spine and the dog will only appear to be weak, or will have difficulty moving its legs, a condition called paresis – partial paralysis. There are also cases where a dog may be paralyzed in all four legs (tetraplegia), and in others, the dog may be able to control the movement in some of its legs but not all. This is determined by the location in the brain, spine, nerves, or muscles that the trauma has occurred. Some breeds are more prone than other"}, {"url": "http://www.whole-dog-journal.com/issues/16_7/features/five-things-dog-paralyzed_20785-1.html", "passage_text": "Here are five things to do if your dog suddenly seems paralyzed. 1. Check him immediately for ticks, and remove any you find! The sooner you remove the tick, the better the dog’s prognosis. The earliest sign of this condition is often a change in the dog’s ability to bark, caused by laryngeal paralysis. "}]