[{"url": "http://www.bbc.co.uk/climate/impact/gulf_stream.shtml", "passage_text": "The Gulf Stream is one of the strongest ocean currents in the world. It is driven by surface wind patterns and differences in water density. Surface water in the north Atlantic is cooled by winds from the Arctic. It becomes more salty and more dense and sinks to the ocean floor."}, {"url": "http://www.livescience.com/26273-gulf-stream.html", "passage_text": "The Gulf Stream is a powerful current in the Atlantic Ocean. It starts in the Gulf of Mexico and flows into the Atlantic at the tip of Florida, accelerating along the eastern coastlines of the United States and Newfoundland."}, {"url": "http://www.weatheronline.co.uk/reports/wxfacts/North-Atlantic-Drift-Gulf-Stream.htm", "passage_text": "The Gulf Stream is the most important ocean-current system in the northern hemisphere, which stretches from Florida to north-western Europe. It incorporates several currents: the Florida current, the Gulf Stream itself, and an eastern extension, the North Atlantic Drift."}, {"url": "https://en.wikipedia.org/wiki/Gulf_stream", "passage_text": "The Gulf Stream proper is a western-intensified current, driven largely by wind stress. The North Atlantic Drift, in contrast, is largely thermohaline circulation –driven. In 1958 the oceanographer Henry Stommel noted that very little water from the Gulf of Mexico is actually in the Stream."}, {"url": "http://geography.about.com/od/physicalgeography/a/gulfstream.htm", "passage_text": "The Gulf Stream is a strong, fast moving, warm ocean current that originates in the Gulf of Mexico and flows into the Atlantic Ocean. It makes up a portion of the North Atlantic Subtropical Gyre. The majority of the Gulf Stream is classified as a western boundary current."}, {"url": "http://www.encyclopedia.com/topic/Gulf_Stream.aspx", "passage_text": "Gulf Stream. The Gulf Stream is a well-known, fast, intense, and warm ocean current in the North Atlantic Ocean. Its path goes from the Gulf of Mexico and the Caribbean Sea, along the eastern coast of the United States, heading to the northeast Atlantic Ocean, to the British Isles, and the Norway coasts."}, {"url": "https://en.wikipedia.org/wiki/Gulf_stream", "passage_text": "The Gulf Stream, together with its northern extension towards Europe, the North Atlantic Drift, is a powerful, warm, and swift Atlantic ocean current that originates at the tip of Florida, and follows the eastern coastlines of the United States and Newfoundland before crossing the Atlantic Ocean."}, {"url": "http://www.earthlyissues.com/gulfstream.htm", "passage_text": "The Gulf Stream is one of the strong ocean currents that carries warm water from the sunny tropics to higher latitudes. The current stretches from the Gulf of Mexico up the East Coast of the United States, departs from North America south of the Chesapeake Bay, and heads across the Atlantic to the British Isles."}]