[{"url": "http://www.experienceproject.com/question-answer/Can-You-Get-Arthritis-In-Your-Chest-I-Wake--Up-Every-Morning-And-My-Chest-Is-Stiff-And-It-Pops/1373252", "passage_text": "Poor posture and sleep position can be major factors. Best Answer. Yes, osteoarthritis can cause pain in the chest cavity. Arthritis is a disease that's all about inflammation in the body so I can imagine it can occur just about anywhere. I'd recommend seeing another doctor for a second opinion though, it might be that and it might be something else. "}, {"url": "http://www.webmd.com/arthritis/psoriatic-arthritis/psoriatic-arthritis-symptoms", "passage_text": "Although rare, chest pain and shortness of breath can be symptoms of psoriatic arthritis. These might happen when the chest wall and the cartilage that links your ribs to your breastbone get inflamed. Even more rarely, your lungs or your aorta (the large blood vessel that leaves your heart) could be affected. "}, {"url": "http://www.emedicinehealth.com/costochondritis/article_em.htm", "passage_text": "Costochondritis is inflammation of the junctions where the upper ribs join the cartilage that holds them to the breastbone (sternum). Costochondritis causes localized chest wall pain and tenderness that can be reproduced by pushing on the involved cartilage in the front of the rib cage. "}, {"url": "http://www.webmd.com/rheumatoid-arthritis/features/10-serious-rheumatoid-arthritis-symptoms", "passage_text": "Never ignore these 10 symptoms: 1. Shortness of breath. RA can affect your blood vessels and heart, so you’re more likely to have a heart attack. Lung infections are also common, so shortness of breath or chest pain could signal a lung or heart problem. Reviewed by David Zelman, MD. If you have rheumatoid arthritis, you’re familiar with painful, swollen joints. There are other symptoms to watch for, though. RA can affect any part of your body, from your eyes to your heart to your toes. Also, newer drugs called biologics often have serious side effects"}, {"url": "https://www.jointhealthmagazine.com/chest-arthritis-in-women.html", "passage_text": "If you experience this type of chest pain just recently and if you haven’t been diagnosed with chest arthritis, this symptom may also be a condition called Costochondritis. Costochondritis shows very similar symptoms as chest arthritis. This condition usually disappears after some weeks or a few months. Therapies for Chest Arthritis: 1  Minocycline – Used when the patient is suffering from really severe arthritis. 2  The seriousness of the condition may become such that the patient’s breathing is severely affected and can be life threatening."}, {"url": "http://www.justanswer.com/medical/3r3i2-hello-arthritis-chest.html", "passage_text": "Thank you for clarifying, Yes, you can get arthritis in the chest. For example, you can get arthritis of the sternomanubrial joint. The arthritis that develops in the chest commonly involves the sternum. Symptoms would be pain in the center of the chest/front of the chest. Tenderness over the breast plate. Costochondritis (a much more common condition) also causes pain in the anterior chest along with tenderness when you push on the area to the sides of the breast bone."}, {"url": "http://www.healthboards.com/boards/arthritis/444036-daughter-arthritis-chest-area.html", "passage_text": "I have rheumatoid arthritis and it has effected my breastbone too. It hurts to breath is because as your lungs expands it puts pressure on your breastbone area. You can also get arthritis in the bones by your collar bone. I started mine when I was 30. What I found the worse was lying down on one of my sides. "}, {"url": "http://www.arthritisresearchuk.org/arthritis-information/conditions/neck-pain/symptoms.aspx", "passage_text": "Pain and stiffness. Pain and stiffness are the most common symptoms of neck problems. You may feel pain in the middle or on either side of you neck, but it may also stretch to your shoulder and shoulder blade or to your upper chest. If you have tension headaches, the pain often travels to the back of your head, and sometimes behind your eye or even into your ear."}, {"url": "http://www.arthritis-treatment-and-relief.com/arthritis-chest-and-shoulder-pain.html", "passage_text": "•Pulmonary embolism – a blood clot in the lung. •Pericarditis – inflammation of the sack that surrounds the heart typically causes chest wall pain that may be confused for arthritis. • Myocarditis, inflammation of the heart wall; can also cause chest pain that may be mistaken for chest wall pain. "}]