[{"url": "http://minerals.usgs.gov/minerals/pubs/commodity/selenium/", "passage_text": "Tellurium is a relatively rare element, in the same chemical family as oxygen, sulfur, selenium, and polonium: oxygen and sulfur are nonmetals, polonium is a metal, and selenium and tellurium are semiconductors (i.e., their electrical properties are between those of a metal and an insulator). Tellurium production is mainly a byproduct of copper processing. The 1960's brought growth in thermoelectric applications for tellurium, as well as its use in free-machining steel, which became the dominant use. The use of high-purity tellurium in cadmium telluride solar cells is very promising."}, {"url": "https://en.wikipedia.org/wiki/Tellurium", "passage_text": "Tellurium is a chemical element with symbol Te and atomic number 52. A brittle, mildly toxic, rare, silver-white metalloid. Tellurium is chemically related to selenium and sulfur. It is occasionally found in native form, as elemental crystals. Tellurium is far more common in the universe as a whole than it is on Earth. Naturally occurring tellurium has eight isotopes. Five of those isotopes, 122 Te, 123 Te, 124 Te, 125 Te and 126 Te, are stable. The other three, 120 Te, 128 Te and 130 Te, have been observed to be radioactive."}, {"url": "http://minerals.usgs.gov/minerals/pubs/commodity/selenium/", "passage_text": "Nevertheless, tellurium, as well as selenium, is often referred to as a metal when in elemental form. Tellurium production is mainly a byproduct of copper processing. The 1960's brought growth in thermoelectric applications for tellurium, as well as its use in free-machining steel, which became the dominant use. The use of high-purity tellurium in cadmium telluride solar cells is very promising."}, {"url": "https://en.wikipedia.org/wiki/Tellurium", "passage_text": "In humans, tellurium is partly metabolized into dimethyl telluride, (CH 3) 2 Te, a gas with a garlic-like odor which is exhaled in the breath of victims of tellurium toxicity or exposure. Naturally occurring tellurium has eight isotopes. Five of those isotopes, 122 Te, 123 Te, 124 Te, 125 Te and 126 Te, are stable. The other three, 120 Te, 128 Te and 130 Te, have been observed to be radioactive."}, {"url": "http://minerals.usgs.gov/minerals/pubs/commodity/selenium/mcs-2014-tellu.pdf", "passage_text": "Net import reliance 2 as a percentage of apparent consumption W W W W W. Import Sources (2009–12): Canada, 43%, China, 23%; Philippines, 12%; Belgium, 4%; and other, 18%. Tariff: Item Number Normal Trade Relations 12–31–13 Tellurium 2804.50.0020 Free. Government Stockpile: None. Although Canada remained the leading source of U.S. imports of tellurium, having displaced China in 2010, imports. from Belgium rose substantially during the first 8 months of 2013 compared with those in the same period of 2012, and accounted for 37% of imports."}, {"url": "https://en.wikipedia.org/wiki/Tellurium", "passage_text": "The principal source of tellurium is from anode sludges produced during the electrolytic refining of blister copper. It is a component of dusts from blast furnace refining of lead. Treatment of 1000 tons of copper ore typically yields one kilogram (2.2 pounds) of tellurium. Naturally occurring tellurium has eight isotopes. Five of those isotopes, 122 Te, 123 Te, 124 Te, 125 Te and 126 Te, are stable. The other three, 120 Te, 128 Te and 130 Te, have been observed to be radioactive."}, {"url": "http://www.webelements.com/tellurium/uses.html", "passage_text": "Tellurium: uses. The following uses for tellurium are gathered from a number of sources as well as from anecdotal comments. I'd be delighted to receive corrections as well as additional referenced uses (please use the feedback mechanism to add uses). 1  semiconductors. 2  alloying with cast iron, copper and stainless steel"}, {"url": "http://metals.about.com/od/properties/a/Metal-Profile-Tellurium.htm", "passage_text": "Production: Anode sludge, collected during electrolytic copper refining, are the principal source of tellurium, which is only produced as a by-product of copper and base metals. Other sources can include flue dusts and gases produced during lead, bismuth, gold, nickel and platinum smelting. "}]