[{"url": "http://www.allbankingsolutions.com/Banking-Tutor/Basel-iii-Accord-Basel-3-Norms.shtml", "passage_text": "Contributed by: Rajesh Goyal, allbankingsolutions@gmail.com What is Basel iii or What is Basel 3 Accord or Meaning and Definition of Basel III Accord:- Ads by Google Basel III or Basel 3 released in December, 2010 is the third in the series of Basel Accords. What are the objectives / aims of the Basel III measures? Basel 3 measures aim to: → improve the banking sector's ability to absorb shocks arising from financial and economic stress, whatever the source → improve risk management and governance → strengthen banks' transparency and disclosures."}, {"url": "http://www.allbankingsolutions.com/Banking-Tutor/Basel-iii-Accord-Basel-3-Norms.shtml", "passage_text": "In a nut shell we can say that Basel iii is the global regulatory standard (agreed upon by the members of the Basel Committee on Banking Supervision) on bank capital adequacy, stress testing and market liquidity risk. What are the objectives / aims of the Basel III measures? Basel 3 measures aim to: → improve the banking sector's ability to absorb shocks arising from financial and economic stress, whatever the source → improve risk management and governance → strengthen banks' transparency and disclosures."}, {"url": "http://www.eba.europa.eu/regulation-and-policy/implementing-basel-iii-europe", "passage_text": "Basel III is a comprehensive set of reform measures in banking prudential regulation developed by the Basel Committee on Banking Supervision, to strengthen the regulation, supervision and risk management of the banking sector. The overarching goal of the so-called Basel III agreement and its implementing act in Europe, the so-called CRD IV package, is to strengthen the resilience of the EU banking sector so it would be better placed to absorb economic shocks while ensuring that banks continue to finance economic activity and growth."}, {"url": "http://www.bis.org/bcbs/basel3.htm", "passage_text": "Basel III is a comprehensive set of reform measures, developed by the Basel Committee on Banking Supervision, to strengthen the regulation, supervision and risk management of the banking sector. These measures aim to: Basel III is part of the Committee's continuous effort to enhance the banking regulatory framework. It builds on the International Convergence of Capital Measurement and Capital Standards document (Basel II)."}, {"url": "http://www.basel-iii.worldfinance.com/", "passage_text": "Basel III is a set of precautionary measures imposed on banks and are made to protect the economy from financial crises similar to that of recent years. Principally they aim to ensure banks accept a level of responsibility for the financial economy they operate within and to act as a safeguard against further collapse. All these factors combined to trigger what has become known as the Great Recession, the most severe economic crisis in 80 years. Thus Basel III, one of the biggest responses to crisis, is specifically designed to make sure that the banking sector supports and underpins the world’s economies rather than threatens them."}, {"url": "https://en.wikipedia.org/wiki/Basel_III", "passage_text": "Basel III (or the Third Basel Accord) is a global, voluntary regulatory framework on bank capital adequacy, stress testing and market liquidity risk. Basel III introduced a minimum leverage ratio. This is a non-risk-based leverage ratio and is calculated by dividing Tier 1 capital by the bank's average total consolidated assets (sum of the exposures of all assets and non-balance sheet items)."}, {"url": "http://www.basel-iii.worldfinance.com/", "passage_text": "Essentially, Basel III and related measures by national and supranational regulators will force the banks to maintain a much bigger capital base – in effect, a foundation stone of solid assets designed to withstand sudden market disruption. All these factors combined to trigger what has become known as the Great Recession, the most severe economic crisis in 80 years. Thus Basel III, one of the biggest responses to crisis, is specifically designed to make sure that the banking sector supports and underpins the world’s economies rather than threatens them."}, {"url": "http://www.investopedia.com/terms/b/basell-iii.asp", "passage_text": "Basel III is part of the continuous effort made by the Basel Committee on Banking Supervision to enhance the banking regulatory framework. A comprehensive set of reform measures designed to improve the regulation, supervision and risk management within the banking sector. The Basel Committee on Banking Supervision published the first version of Basel III in late 2009, giving banks approximately three years to satisfy all requirements. Largely in response to the credit crisis, banks are required to maintain proper leverage ratios and meet certain capital requirements"}, {"url": "http://www.allbankingsolutions.com/Banking-Tutor/Basel-iii-Accord-Basel-3-Norms.shtml", "passage_text": "What is Basel iii or What is Basel 3 Accord or Meaning and Definition of Basel III Accord:-. Ads by Google. Basel III or Basel 3 released in December, 2010 is the third in the series of Basel Accords. These accords deal with risk management aspects for the banking sector. What are the objectives / aims of the Basel III measures? Basel 3 measures aim to: → improve the banking sector's ability to absorb shocks arising from financial and economic stress, whatever the source → improve risk management and governance → strengthen banks' transparency and disclosures."}]