[{"url": "http://www.answers.com/Q/What_is_the_mythological_origin_of_the_name_Uranus", "passage_text": "Confidence votes 8.0K. Uranus is the Latinized version of the Greek god of the sky, Ouranos. In Roman/Greek mythology, as Saturn was the father of Jupiter, the next planet after Saturn should be named after the father of Saturn, which was Ouranos. William Herschel was going to name the planet Georgium Sidu (George's Star). But Johann Elert Bode decided to name it Uranus the Latinized version of the greek god of the sky … Ouranus. He argued for it to be named after the father of Saturn. Finally it was switched from Georgium Sidus to Uranus."}, {"url": "https://en.wikipedia.org/wiki/Uranus", "passage_text": "Uranus is named after the ancient Greek deity of the sky Uranus (Ancient Greek: οὐρανός), the father of Cronus (Saturn) and grandfather of Zeus (Jupiter), which in Latin became Ūranus. It is the only planet whose name is derived from a figure from Greek mythology. The adjective of Uranus is Uranian. Uranus is the only planet whose name is derived from a figure from Greek mythology, from the Latinized version of the Greek god of the sky, Ouranos. Like the other giant planets, Uranus has a ring system, a magnetosphere, and numerous moons"}, {"url": "http://www.universetoday.com/18958/name-of-uranus/", "passage_text": "How did Uranus get its name? Uranus is named after the ancient Greek god of the sky, who was the father of Kronos (Saturn in Roman mythology). Most of the other planets got their names thousands of years ago, but Uranus was discovered just a few hundred years ago – William Herschel found it on March 13, 1781. Mosaic of Uranus. Mosaic of Uranus. As he lived in England, Herschel originally wanted to name Uranus after his patron, King George III. He wanted to call it Georgium Sidus (George’s Star), or the Georgian Planet."}, {"url": "http://www.behindthename.com/name/uranus", "passage_text": "Meaning & History. From Greek ουρανος (Ouranos) , the name of the husband of Gaia and the father of the Titans in Greek mythology. His name is derived from ουρανος (ouranos) meaning the heavens. This is also the name of the seventh planet in the solar system. Related Names"}, {"url": "http://www.answers.com/Q/What_is_the_origin_of_the_name_Uranus", "passage_text": "Uranus is the ancient Greek deity of the Heavens, the earliest supreme god.     William Herschel was going to name the planet Georgium Sidu (George's Star). But Johann Elert Bode decided to name it Uranus the Latinized version of the greek god of the sky Ouranus. He argued for it to be named after the father of Saturn. Finally it was switched from Georgium Sidus to Uranus. "}, {"url": "http://www.space.com/45-uranus-seventh-planet-in-earths-solar-system-was-first-discovered-planet.html", "passage_text": "Uranus is the seventh planet from the sun and the first to be discovered by scientists. Although Uranus is visible to the naked eye, it was long mistaken as a star because of the planet’s dimness and slow orbit. The planet is also notable for its dramatic tilt, which causes its axis to point nearly directly at the sun.ne star seemed different, and within a year Uranus was shown to follow a planetary orbit. Uranuswas named after the Greek sky deity Ouranos, the earliest of the lords of the heavens. It is the only planet to be named after a Greek god rather than a Roman one."}, {"url": "https://en.wikipedia.org/wiki/Uranus_(mythology)", "passage_text": "His equivalent in Roman mythology was Caelus. In Ancient Greek literature, Uranus or Father Sky was the son and husband of Gaia, Mother Earth. According to Hesiod 's Theogony, Uranus was conceived by Gaia alone, but other sources cite Aether as his father."}]