[{"url": "https://en.wikipedia.org/wiki/War_Powers_Resolution", "passage_text": "War Powers Resolution. From Wikipedia, the free encyclopedia. The War Powers Resolution (also known as the War Powers Resolution of 1973) (50 U.S.C. 1541–1548) is a federal law intended to check the president 's power to commit the United States to an armed conflict without the consent of the U.S. Congress. It has been alleged that the War Powers Resolution has been violated in the past – for example, by President Bill Clinton in 1999, during the bombing campaign in Kosovo."}, {"url": "http://www.polleverywhere.com/polls/2937131-the-war-powers-resolution-may-be-considered-unconstitutional-becaus", "passage_text": "1 its use of the legislative veto may be considered a violation of the doctrine of separation of powers. 2  it violates the president’s power to declare war. 3  it violates the president’s power as commander in chief. 4  it was struck down by the Supreme Court. Poll responses are kept private. 1  its use of the legislative veto may be considered a violation of the doctrine of separation of powers. 2  it violates the president’s power to declare war. 3  it violates the president’s power as commander in chief. 4  it was struck down by the Supreme Court."}, {"url": "https://en.wikipedia.org/wiki/War_Powers_Resolution", "passage_text": "The War Powers Resolution requires the President to notify Congress within 48 hours of committing armed forces to military action and forbids armed forces from remaining for more than 60 days, with a further 30 day withdrawal period, without an authorization of the use of military force or a declaration of war. It has been alleged that the War Powers Resolution has been violated in the past – for example, by President Bill Clinton in 1999, during the bombing campaign in Kosovo."}, {"url": "http://digitalcommons.law.yale.edu/fss_papers/2225/", "passage_text": "The Constitutionality of the War Powers Resolution, 70 Virginia Law Review 101 (1984). Anyone wishing to argue that the War Powers Resolution of 1973 is unconstitutional must be prepared to explain the purpose of article I, section 8, clause 11, of the Constitution. That provision expressly grants to Congress the power To declare War.. Abstract. Anyone wishing to argue that the War Powers Resolution of 1973 is unconstitutional must be prepared to explain the purpose of article I, section 8, clause 11, of the Constitution."}, {"url": "http://fas.org/man/crs/RL32267.html", "passage_text": "On May 30, 1997, President Clinton notified Congress consistent with the War Powers Resolution, that on May 29 and May 30, 1997, U.S. military personnel were deployed to Freetown, Sierra Leone to prepare for and undertake the evacuation of certain U.S. Government employees and private U.S. citizens. On May 24, 1995, President Clinton reported consistent with the War Powers Resolution that U.S. combat-equipped fighter aircraft and other aircraft continued to contribute to NATO's enforcement of the no-fly zone in airspace over Bosnia-Herzegovina."}, {"url": "http://www.fed-soc.org/publications/detail/the-war-powers-resolution-an-unnecessary-unconstitutional-source-of-friendly-fire-in-the-war-against-international-terrorism", "passage_text": "The Reality of the War Powers Resolution. When the War Powers Resolution came before Congress, more than nine years had passed since Congress enacted a statute authorizing the President to use military force in Indochina and there had been five congressional elections. This is all the more important in the light of the current war against international terrorism, as the War Powers Resolution has played a fundamental role in encouraging the killing of hundreds of American troops in the past and endangers the safety of both military and civilians alike in the current struggle."}, {"url": "http://www.loc.gov/law/help/war-powers.php", "passage_text": "Congress, as part of a compromise with the President, passed Public Law 98-119 in October 1983 authorizing U.S. troops to remain in Lebanon for 18 months. This resolution was signed by the President, and was the first time a President had signed legislation invoking the War Powers Resolution. The President noted that he considered the War Powers Resolution constitutionally defective. The court ruled in favor of the President, holding that the Members lacked legal standing to bring the suit; this decision was affirmed by the U.S. Court of Appeals for the District of Columbia."}, {"url": "http://www.loc.gov/law/help/war-powers.php", "passage_text": "During this time the President made a number of reports to Congress consistent with the War Powers Resolution regarding the use of U.S. forces, but never cited Section 4(a)(1), and thus did not trigger the 60 day time limit. The President noted that he considered the War Powers Resolution constitutionally defective. The court ruled in favor of the President, holding that the Members lacked legal standing to bring the suit; this decision was affirmed by the U.S. Court of Appeals for the District of Columbia."}]