[{"url": "http://www.busyhandscleaners.co.uk/Prices.aspx", "passage_text": "Our End of Tenancy Cleaning can be charged at hourly rate to suit individual needs. Please contact us for a quote. There is a minimum requirement of 6 hour per session for this service. Deep clean rate and cost of materials applies. £11.50 - per hour fortnightly. Total prices are inclusive of insurance, VAT and agency fees. Click for more offers. There is a minimum requirement of 2.5 hours per session at the rate of £10.50 per hour weekly (£10.45 when booked online) or 3 hours per session fortnightly at the rate of £11.50 per hour."}, {"url": "https://syk-cleaning.com/end-of-tenancy-cleaning-prices", "passage_text": "One of the Best End of Tenancy Cleaning Prices in London! Our cleaning service is guaranteed to be thorough and high-quality, especially since our operatives use only top-quality equipments and cleaning materials to ensure customer satisfaction and safety. We offer end of tenancy cleaning for landlords and tenants, deep oven cleaning, which will make your oven look brand new and carpet cleaning so your home stays fresh and clean at all times."}, {"url": "http://www.end-of-tenancy-cleaning-london.co.uk/cleaning-prices/", "passage_text": "Prices are listed below-To get a Quote or to make a Booking-Call us 24/7 on: 020 3404 5418. The nature of end of tenancy cleaning means that, it's better to speak with you so we can give you a proper quote for your particular property and end of tenancy cleaning requirements. Prices vary depending on the size of the property, specific additional areas to be cleaned and special cleaning techniques that may be required. All services from End of Tenancy Cleaning London are fully guaranteed and cover the highest industry standards for end of tenancy cleaning."}, {"url": "http://www.cleansimply.co.uk/index.php/end-of-tenancy-cleaning", "passage_text": "Our End of Tenancy cleaning prices are fixed based on property size. The cleaning service is also not limited in time. Which means that we wont charge you extra if we need to spend a little bit more time at your property. We will help you get your deposit back. The end of tenancy cleaning is a thorough cleaning of all rooms, electric appliances, furniture and fittings in"}, {"url": "http://www.cleansimply.co.uk/index.php/end-of-tenancy-cleaning", "passage_text": "We at Citi Clean are well aware of the requirements for inventory checks and our extensive end of tenancy cleaning checklist reflects the cleanliness standards required by major London letting agents. We have carried out thousands of end of tenancy cleaning jobs in London for more than 7 years. We will help you get your deposit back. The end of tenancy cleaning is a thorough cleaning of all rooms, electric appliances, furniture and fittings in your property. Your entire property will be professionally cleaned to the highest standard"}, {"url": "http://www.twinkleclean.co/what-is-the-cost-or-price-of-end-of-tenancy-cleaning/", "passage_text": "Watch our video to see why we offer the best value for money for end of tenancy cleaning: Thank your for reading this post on tenancy cleaning cost. If you found it useful please share it with your friends. Additional cleaning services, such as carpet cleaning (view our guide on what to pay for carpet cleaning in London), will increase the price. Always check your tenancy agreement as this often stipulates whether or not you need to clean the carpets before you move out."}, {"url": "http://www.twinkleclean.co/what-is-the-cost-or-price-of-end-of-tenancy-cleaning/", "passage_text": "The average cost for a 2 bed flat in London can vary from £120 to £240. The price you pay depends on a number of factors but the main one is the size of the property. Lots of cleaning companies use the size of the property, namely the number of bedrooms, to build out a price matrix. Additional cleaning services, such as carpet cleaning (view our guide on what to pay for carpet cleaning in London), will increase the price. Always check your tenancy agreement as this often stipulates whether or not you need to clean the carpets before you move out."}, {"url": "http://www.thecleanforce.co.uk/prices/moving.php", "passage_text": "P.O.A. * These prices are only as a guide for you to get an idea of the cost. For a better idea of the price please fill out our unique online quote form and get booked in at the same time. Read about our end of tenancy cleaning service. "}, {"url": "http://www.busyhandscleaners.co.uk/Prices.aspx", "passage_text": "There is a minimum requirement of 2.5 hours per session at the rate of £10.00 per hour weekly or 3 hours per session fortnightly at the rate of £11.00 per hour. Monthly cleaning require a minimum of 3 hours per session at the price of £12.00 per hour. £11.50 - per hour fortnightly. Total prices are inclusive of insurance, VAT and agency fees. Click for more offers. There is a minimum requirement of 2.5 hours per session at the rate of £10.50 per hour weekly (£10.45 when booked online) or 3 hours per session fortnightly at the rate of £11.5"}, {"url": "http://www.greencleansolution.co.uk/prices/rental-cleaning-prices.php", "passage_text": "P.O.A. These prices are as a guide for you to get an idea of the cost. They are open to negotiation and could easily be less due to other circumstances. For a better idea of the price please get in touch on 01483 905113 or use our instant online quote form. Read about our end of tenancy cleaning service. We are able to serve most of the towns in Surrey, such as Guildford, Woking, Godalming and Farnham, as well as towns in Hampshire, such as Aldershot and Farnborough. 01483 905113. We carry out many end of tenancy cleans every day as we as are proudly trusted by many local letting agents so we are the safe choice if you're looking for a company that will ensure you will get all your deposit back at the end of your tenancy."}]