[{"url": "http://www.scripps.edu/baran/images/grpmtgpdf/Junshi_Oct_06.pdf", "passage_text": "Isoquinoline Alkaloids 1 Jun Shi NMeOMeOOMe Papv erin OMeNMeHOOHO Morphine ONAcMeNOOOROMeO curicyleatjehine MeNOOOHOMe neocaryachine NMeOHOOMeOMeMe Clcryptaustoline NMeOR 1 R 2 R 3 O labrandine NMeMeOHNHOMeHOROMe roebramine NONHOOOHHOOHOO chaetoindicin A Chaetoindicin BGuo-Lin Zhang et al. Org. Isoquinoline Alkaloids 7 Jun Shi Total synthesis of isoquinoline alkaloids natural product MeOMeOCHOBrHOB(OH) 2 Pd(OAc) 2, PPh 3, Na 2 CO 3 MeOMeOCHOOH 1. BnBr2. CH 3 NO 2, NH 4 Ac MeOMeOBnNO 2 MeOMeOOHNHAc 1. LiAlH 4 2."}, {"url": "http://www.scripps.edu/baran/images/grpmtgpdf/Junshi_Oct_06.pdf", "passage_text": "Isoquinoline Alkaloids 9 Jun Shi Total synthesis of isoquinoline alkaloids natural product OONCO 2 Me Allyl bromide OONOONOONHOOAcAcO 1. LiAlH 4 2. (COCl) 2, DMSO, TEA Grignard3. Ac 2 O, TEA, DMAPHCl, Grubbs' reagent 1 K 2 CO 3 ErythrocarineMichiko Miyazaki and coworkers, Org. Isoquinoline Alkaloids 7 Jun Shi Total synthesis of isoquinoline alkaloids natural product MeOMeOCHOBrHOB(OH) 2 Pd(OAc) 2, PPh 3, Na 2 CO 3 MeOMeOCHOOH 1. BnBr2. CH 3 NO 2, NH 4 Ac MeOMeOBnNO 2 MeOMeOOHNHAc"}, {"url": "http://emedicine.medscape.com/article/816548-overview", "passage_text": "Quinolizidine and isoquinoline are a widely distributed, heterogeneous group of alkaloids with members of each group having known toxicity to humans and domestic animals. Plants containing quinolizidine alkaloids with known toxicity include the following: Baptisia species (false indigo). Interestingly, some domesticated species tolerate ingestion of isoquinoline and other alkaloids, and humans can ingest toxic alkaloids from the milk of a poisoned animal and then manifest symptoms. Isolated American and European case reports exist of toxicity following ingestion of improperly washed lupini beans."}, {"url": "http://www.life.illinois.edu/ib/425/lecture32.html", "passage_text": "Alkaloids that possess an isoquinoline skeleton are among the most common of all alkaloids. These are derived from a 3,4-dihydroxytyramine (dopamine) precursor that undergoes a Schiff base addition with aldehydes of different origin. At least 4000 compounds of this structural type are known. These alkaloids are mostly found in the Cactaceae, but in some other families as well. About 130 isoquinoline alkaloids are known. They are derived from a 3,4-dihydroxytyramine (dopamine) precursor and have an isoquinoline skeleton. The skeleton is based on a 3,4-dihydroxytyramine (dopamine) precursor and carbonyl compounds such as glyoxylic acid, pyruvic acid, and an aldehyde derived from leucine"}, {"url": "http://emedicine.medscape.com/article/816548-overview", "passage_text": "Quinolizidine and isoquinoline are alkaloids, which are alkali-like compounds that form salts with acids and contain nitrogen, generally in heterocyclic and/or ring structures. Found in a wide variety of plants, animals, and fungi, many alkaloids have medicinal and toxic properties. Interestingly, some domesticated species tolerate ingestion of isoquinoline and other alkaloids, and humans can ingest toxic alkaloids from the milk of a poisoned animal and then manifest symptoms. Isolated American and European case reports exist of toxicity following ingestion of improperly washed lupini beans."}, {"url": "http://www.life.illinois.edu/ib/425/lecture32.html", "passage_text": "In contrast to benzylisoquinoline alkaloids (see below), the biosynthesis of isoquinoline alkaloids usually involves the interaction of an amine and a keto acid, rather than interaction of an amine and an aldehyde. Ring closure to form compounds such as anhalamine involves methionine. These alkaloids are mostly found in the Cactaceae, but in some other families as well. About 130 isoquinoline alkaloids are known. They are derived from a 3,4-dihydroxytyramine (dopamine) precursor and have an isoquinoline skeleton. The skeleton is based on a 3,4-dihydroxytyramine (dopamine) precursor and carbonyl compounds such as glyoxylic acid, pyruvic acid, and an aldehyde derived from leuc"}, {"url": "https://en.wikipedia.org/wiki/Isoquinoline", "passage_text": "Isoquinoline is a heterocyclic aromatic organic compound. It is a structural isomer of quinoline. Isoquinoline and quinoline are benzopyridines, which are composed of a benzene ring fused to a pyridine ring. In a broader sense, the term isoquinoline is used to make reference to isoquinoline derivatives. 1-Benzylisoquinoline is the structural backbone in naturally occurring alkaloids including papaverine. Isoquinoline can then be isolated from the mixture by fractional crystallization of the acid sulfate. Although isoquinoline derivatives can be synthesized by several methods, relatively few direct methods deliver the unsubstituted isoquinoline."}, {"url": "http://www.scripps.edu/baran/images/grpmtgpdf/Junshi_Oct_06.pdf", "passage_text": "Isoquinoline Alkaloids 8 Jun Shi Total synthesis of isoquinoline alkaloids natural product OOTBSO CO 2 MeCHONSEtMeOMeOCO 2 MeTBSOONSEtMeOMeOCO 2 MeHOO ONSEtMeOMeOCO 2 MeBrO ONMeOMeOBrMeO 2 C SEtOHNMeOMeOMeOC SEtOHNMeOMeOMeOCOHNMeOMeOMeOCSHNMeOMeOMeOCH Jamtine1.+H, MeOH2. TBSCl, DMAP3. Isoquinoline Alkaloids 7 Jun Shi Total synthesis of isoquinoline alkaloids natural product MeOMeOCHOBrHOB(OH) 2 Pd(OAc) 2, PPh 3, Na 2 CO 3 MeOMeOCHOOH 1. BnBr2. CH 3 NO 2, NH 4 Ac MeOMeOBnNO 2 MeOMeOOHNHAc 1. LiAlH 4 2."}, {"url": "http://www.sciencedirect.com/science/book/9780080106595", "passage_text": "The Isoquinoline Alkaloids: A Course in Organic Chemistry is a description of the chemical structures of alkaloids. The book discusses the processes for degradation of isoquinoline alkaloids to recognizable compounds such as oxidation and exhaustive methylation. The associated processes in removing the nitrogen atom are also explained. The structures of morphine, codeine, and thebain, which are all alkaloids of opium, are also analyzed. Another example of a principal alkaloid found in a plant is emetine found in the root of the ipecac."}]