[{"url": "http://www.bielinski.com/BuildOnYourLot/default.aspx", "passage_text": "More than 55 Years of Building Exceptional Homes. Brothers Harry and Frank Bielinski started Bielinski Homes in 1960 by building exceptional homes on customer lots throughout the nine-county area of Southeastern Wisconsin – from as far south as Kenosha, north to Washington and west to Jefferson counties. Since then, Bielinski Homes has built more than 10,000 homes. With everything in one location, making decisions is convenient and easy! Finally, your home will be backed by comprehensive new home and product warranties. Beyond the expected, Harry and Frank Bielinski put their name on the door more than 55 years ago."}, {"url": "http://city.milwaukee.gov/HomeBuildingSites", "passage_text": "Home Building Sites. The City of Milwaukee has hundreds of opportunities for new home building. Our affordable lot prices can put a newly constructed home within your reach. Building a house in one of Milwaukee’s urban neighborhoods puts you close to downtown, jobs, shopping, schools, entertainment and parks. Milwaukee’s extensive transit system can allow your family to live with just one car and roll the savings into that dream home"}, {"url": "http://www.answers.com/Q/Cost_per_square_foot_to_build_a_new_home_in_Madison_Wisconsin", "passage_text": "Answered by The Community. Making the world better, one answer at a time. The cost per square foot to build a new home in Madison, Wisconsin, runs about $110. This means that a 2500 square foot home would cost about $275,000 to build. The average cost per square foot to build a home in Indiana is  about $132 per square foot. This means a 2500 square foot home  would cost around $330,000 to build."}, {"url": "http://www.jamescraigbuilders.com/CustomHomesLearningCenter/Pricing", "passage_text": "We don’t mark-up site work costs and all the allowances you receive are offered at builder cost. As a general guideline, homes based off of our models range from $125 to $160 per square foot. Custom home square footage prices vary based on the desired design options and level of finish. In fact, our homes cost a little more than some builders and we wouldn’t have it any other way. Our customers appreciate not worrying about drafty windows, squeaky floors or rotting exterior trim. We account for typical home problems and build our homes in such a way to eliminate them… right from the start."}, {"url": "http://www.jamescraigbuilders.com/CustomHomesLearningCenter/Pricing", "passage_text": "Getting Milwaukee Custom Home Building Right from the Start. There shouldn’t be any surprises when it comes to building your new custom Milwaukee area home. We always provide a complete list of our building specifications and a detailed breakout of costs. In fact, our homes cost a little more than some builders and we wouldn’t have it any other way. Our customers appreciate not worrying about drafty windows, squeaky floors or rotting exterior trim. We account for typical home problems and build our homes in such a way to eliminate them… right from the start."}, {"url": "http://www.jamescraigbuilders.com/CustomHomesLearningCenter/Pricing", "passage_text": "Our Milwaukee home builders take pride in building homes the right way. We don’t cut corners to save a few dollars. In fact, our homes cost a little more than some builders and we wouldn’t have it any other way. Our customers appreciate not worrying about drafty windows, squeaky floors or rotting exterior trim. We account for typical home problems and build our homes in such a way to eliminate them… right from the start."}, {"url": "http://www.answers.com/Q/Cost_per_square_foot_to_build_a_new_home_in_Madison_Wisconsin", "passage_text": "The average cost per square foot to build a home in Gloucester,  Virginia is about $55. This can go much higher with high-end  materials and can be quite a bit less if you d … o some of the work  yourself. The average cost per square foot to build a home in Indiana is  about $132 per square foot. This means a 2500 square foot home  would cost around $330,000 to build."}, {"url": "http://www.answers.com/Q/Cost_per_square_foot_to_build_a_new_home_in_Madison_Wisconsin", "passage_text": "The average cost per square foot for building a house in Wisconsin  is about $110. This means a 1000 square foot house would cost about  $110,000 to build. The average cost per square foot to build a home in Indiana is  about $132 per square foot. This means a 2500 square foot home  would cost around $330,000 to build."}]