[{"url": "http://www.groompower.com/grooms-speech/", "passage_text": "Writing your speech. The groom’s speech is in many ways the easiest of the three main speeches. Many grooms get away with a list of thank yous and a few comments about how beautiful their wife looks and how happy they are. That’s not too bad, but aim higher if you can. 1 Thank the bridesmaids, comment on how great they’re looking, and then propose a toast to them. 2  Toasting the bridesmaids is an expected part of the groom’s speech, so don’t forget. 3  Thank your best man, say what a great guy he is, and hand over to the best man. 4  This is another place where you can get an easy laugh."}, {"url": "http://www.hitched.co.uk/wedding-speeches/example_groom_speeches_5/", "passage_text": "If you would like to help others with their wedding speech, please send us your Groom speech and we will add it to our examples.Good Luck! The Groom’s wedding speech is made on behalf of himself and his Bride and uses the opportunity to personally thank the people involved in the wedding preparations. In his speech, he will toast the Bridesmaids and thank them for a job well done and will thank his groom’s party for their support throughout. The Groom’s speech should also include a special thank you to his parents and maybe even include some special memories with them. Another entertaining and sentimental part of the Groom’s speech is when he shares his first encounter with his wife and how his life has changed because of it!"}, {"url": "https://www.theknot.com/content/a-wedding-toasting-guide-for-the-bride-groom", "passage_text": "Your moment can come after the traditional speeches from the best man and bride's father (often other people, including the groom's father or maid of honor, will also speak) before or during the meal. But many wedding consultants, including Jean Picard of California, urge couples to speak just before the cake-cutting. "}, {"url": "http://www.wednet.com/wedding-planning/nailing-the-grooms-speech/", "passage_text": "A groom’s wedding speech also has some business to take care of. Your job as a guest of honor is to thank your guests and your hosts. If there are family members or friends that you and your bride want to specially honor, your speech is a good place to do it. "}, {"url": "http://www.mag.weddingcentral.com.au/weddings/speeches/bestman.htm", "passage_text": "Wedding Speeches-Guidelines-examples: Father-Groom-Bride-Best man-Quotes & Jokes. The best man's speech is the last of the three traditional Wedding speeches at a wedding. He usually begins by recounting how he first met the groom and their relationship, followed by some insights about the groom and bride. The best man is traditionally the official spokes man for the bridal party. In his speech, the best man will thank the the bride and groom on behalf of the bridal party, the bridesmaids and groomsmen. 1  The 'best man' can talk about the groom's life, experiences, and qualities. 2  Some tasteful jokes and anecdotes about the groom are usually welcom"}, {"url": "http://www.groompower.com/grooms-speech/", "passage_text": "It’s traditional for speeches to be given at the wedding reception. The father of the bride should give his speech first, followed by the groom’s speech, and finally the best man’s speech. The father of the bride, by tradition, is the one who pays for the wedding. 1 Thank the bridesmaids, comment on how great they’re looking, and then propose a toast to them. 2  Toasting the bridesmaids is an expected part of the groom’s speech, so don’t forget. 3  Thank your best man, say what a great guy he is, and hand over to the best man. 4  This is another place where you can get an easy laugh."}, {"url": "http://www.topweddingsites.com/wedding-blog/guides-wedding-tools/ready-set-deliverthe-best-wedding-speech-or-toast-ever", "passage_text": "It doesn’t matter whether you’re performing the bridesmaid speech, best man speech, father of the bride speech or the groom wedding speech. Giving a wedding speech or a wedding toast can be nerve racking. It doesn’t have to be if you follow some basic rules and do some preparation work. See example groom speeches here. The Groom’s wedding speech is a big deal. Everybody wants to know what the groom has to say. In his speech, a groom will toast the Bridesmaids and thank them for a job well done and will thank his groom’s party for their support throughout."}, {"url": "http://greatweddingspeech.org/mother-of-the-groom-speech-ideas-that-will-help-you-deliver-a-fantastic-toast/", "passage_text": "Mother of the groom speech ideas that will help you deliver a fantastic toast. In addition to helping your son plan his wedding, the task of writing a wedding speech can be very stressful, so let us help you out with these mother of the groom speech examples ! "}]