[{"url": "https://answers.yahoo.com/question/index?qid=20080514064054AAVMiJz", "passage_text": "Pasta is the Italian word for paste.. All pasta is made from a dough of grain flour mixed with water. There are many different shapes and sizes of pasta. While most are made from wheat, other grains can also be used on their own (for people who are gluten intolerant) or combined with wheat. Italian pasta is traditionally cooked al dente (Italian: to the tooth, meaning not too soft). Abroad, dry pasta is frequently made from other types of flour (such as farina), but this yields a softer product, which cannot be cooked al dente."}, {"url": "http://leitesculinaria.com/40229/recipes-homemade-pasta-dough.html", "passage_text": "Nothing beats homemade pasta—not even store-bought “fresh.” This is homemade pasta made the traditional way—by hand. A mixture of 50% Italian “00” flour and 50% Farina di Semola (pale yellow, finely ground, hard durum wheat flour for making pasta and some bread) works particularly well. 1 9. 2  Throw the pasta into a large saucepan of boiling, salted water. 3  You will need about 4 quarts water and 3 tablespoons of salt for every 13 to 18 ounces of fresh or dried pasta. 4  It is the large volume of water that will prevent the pasta from sticking together."}, {"url": "https://en.wikipedia.org/wiki/Pasta", "passage_text": "Typically, pasta is a noodle made from an unleavened dough of a durum wheat flour mixed with water or egg and formed into sheets or various shapes, then cooked and served in any number of dishes. It can be made with flour from other cereals or grains, and eggs may be used instead of water. Pasta is generally a simple dish, but comes in large varieties because it is a versatile food item. Some pasta dishes are served as a first course in Italy because the portion sizes are small and simple. Pasta is also prepared in light lunches, such as salads or large portion sizes for dinner."}, {"url": "http://www.delallo.com/video/how-pasta-is-made", "passage_text": "DeLallo pasta is made in Italy using semolina flour, a granular flour milled from durum wheat. In this video, we learn how that wheat is chosen for pasta-making, and we visit the pastificio where finely calibrated machinery grinds the wheat from whole kernels to semolina flour. "}, {"url": "https://en.wikipedia.org/wiki/Pasta", "passage_text": "Furthermore, fresh pasta is usually made with a mixture of eggs and all-purpose flour or “00” low-gluten flour. Since it contains eggs, it is more tender compared to dried pasta and only takes about half the time to cook. Delicate sauces are preferred for fresh pasta in order to let the pasta take front stage. Pasta is generally a simple dish, but comes in large varieties because it is a versatile food item. Some pasta dishes are served as a first course in Italy because the portion sizes are small and simple. Pasta is also prepared in light lunches, such as salads or large portion sizes for dinner."}, {"url": "https://answers.yahoo.com/question/index?qid=20080514064054AAVMiJz", "passage_text": "Best Answer: Basic Pasta: INGREDIENTS * 1 egg, beaten * 1/2 teaspoon salt * 1 cup all-purpose flour * 2 tablespoons water http://allrecipes.com/Recipe/Basic-Pasta... A simple recipe for fresh pasta calls for two large eggs and about 1-1/4 cups of all-purpose flour with a pinch of salt. Italian pasta is traditionally cooked al dente (Italian: to the tooth, meaning not too soft). Abroad, dry pasta is frequently made from other types of flour (such as farina), but this yields a softer product, which cannot be cooked al dente."}, {"url": "http://www.food-info.net/uk/qa/qa-fp145.htm", "passage_text": "Pasta is normally made of flour, eggs, salt and water. Most pasta is made with semolina or durum, a type of wheat flour, but other grains, such as corn, rice, quinoa, spelt, and kamut can also be used. "}, {"url": "http://www.answers.com/Q/How_is_Pasta_made", "passage_text": "The yellow pasta is made of durum wheat flour and water, sometimes it is made by flour, eggs and a little salt (aka Fresh egg Pasta)   The red pasta is made in the same way … as other pasta but it is flavoured with tomatoes.   The green pasta is made in the same way as other pasta but it is flavoured with spinach. Semolina wheat flour is traditional because its high gluten content makes a sturdier pasta. The dough needs to be on … the dry side, using just enough liquid -- usually eggs and/or water -- to make it moist and pliable."}, {"url": "http://www.madehow.com/Volume-2/Pasta.html", "passage_text": "Pasta is made from a mixture of water and semolina flour. Semolina is a coarse-ground flour from the heart, or endosperm, of durum wheat, an amber-colored high protein hard wheat that is grown specifically for the manufacture of pasta. To make vermicelli and capellini, the pasta dough is pushed through holes between 0.8-0.5 mm in diameter. The cutting machine then cuts the pasta into lengths of 10 inches (250 mm) and twists it into curls."}, {"url": "http://www.mitsidesgroup.com/lang/en/about-pasta-flour/about-pasta/how-pasta-is-made/", "passage_text": "Pasta is one of the simplest and purest foods around, as it is made of just two ingredients, semolina and water, without the addition of any hidden artificial preservatives or colorings. Selection of Raw Material. The first decisive step in making good pasta is the selection of the appropriate raw material. All quality pasta is made from Durum wheat semolina. Durum wheat is considered to be the most noble of all hard wheat and the richest in nutritional value. Durum wheat is what gives pasta its rich taste, pleasant aroma and bright, amber-yellow color"}]