[{"url": "http://www.mademan.com/mm/how-heal-gum-faster-after-tooth-extraction.html", "passage_text": "To heal your gums faster after a tooth extraction, you will need: 1  An ice pack. 2  Salt. 3  Gauze. 4  Warm water. 5  Soft, cool foods. 6  Form a blood clot. 7  In order for your gums to heal at all, let alone faster, after a tooth extraction, you will need to get the bleeding under control by helping your body to form a blood clot. 1 This should be done about every two hours after you're done brushing your teeth to help the gums heal faster and recover from the tooth extraction. 2  Eat soft foods. 3  After having a tooth removed, you can help your gums to heal faster by only eating soft, cool foods for the first twenty-four hours after your surgery."}, {"url": "http://www.optiderma.com/articles/how-long-cut-heal/", "passage_text": "Problems with the blood circulation system can affect wound healing because the tissues do not get the required supply of oxygen and nutrients. Wound healing is complex, and there can be many causes why it does not happen properly. In spite of all you can do, a cut-even minor-can take a long time to heal. If this is the case, there may be some more severe underlying problem that can lead to dangerous complications. Always consult your doctor for non-healing cuts. "}, {"url": "http://www.experienceproject.com/question-answer/How-Do-You-Heal-A-Cut-In-You-Gums/971225", "passage_text": "Mostly what people do is gurgle salt with warm water together for the solution. That is true. But there is another way and may help you. If your gum is cut, you should eat a lot of Vitamin C. It's very helpful. I once had my gum cut. And it helped. And it healed in a few days or a week. So hope your gum heals soon and hope this was helpful."}, {"url": "http://www.mademan.com/mm/how-heal-gum-faster-after-tooth-extraction.html", "passage_text": "1 Soft, cool foods. 2  Form a blood clot. 3  In order for your gums to heal at all, let alone faster, after a tooth extraction, you will need to get the bleeding under control by helping your body to form a blood clot. 4  To do this you will need to bite down with a piece of gauze placed where you had the tooth extracted. 1 This should be done about every two hours after you're done brushing your teeth to help the gums heal faster and recover from the tooth extraction. 2  Eat soft foods. 3  After having a tooth removed, you can help your gums to heal faster by only eating soft, cool foods for the first twenty-four hours after your surgery."}, {"url": "http://www.mademan.com/mm/how-heal-gum-faster-after-tooth-extraction.html", "passage_text": "1 Form a blood clot. 2  In order for your gums to heal at all, let alone faster, after a tooth extraction, you will need to get the bleeding under control by helping your body to form a blood clot. 3  To do this you will need to bite down with a piece of gauze placed where you had the tooth extracted. 1 This should be done about every two hours after you're done brushing your teeth to help the gums heal faster and recover from the tooth extraction. 2  Eat soft foods. 3  After having a tooth removed, you can help your gums to heal faster by only eating soft, cool foods for the first twenty-four hours after your surgery."}, {"url": "https://answers.yahoo.com/question/index?qid=1006052910148", "passage_text": "What's important in evaluating healing time (and thoroughness of healing) is that wounds heal across the gap. They don't heal length-wise. A 1-inch wound whose edges are separated by a 2mm gap will heal no faster than a 5-inch wound separated by a 2mm gap. Thus, if your gums are cut but the wound edges are approximated fairly well, you can expect them to heal rapidly. Generally by 2 weeks time you won't even know that a cut was made there. If it is a surgically created clean cut then it will heal very fast and nicely. It it is a tear it will take some time to heal and will leave a scar. Generally speaking oral mucosa heals very fast, rinsing with warm saline aids healing. m_a_fouda · 9 years ago. Thumbs up."}, {"url": "http://www.mademan.com/mm/how-heal-gum-faster-after-tooth-extraction.html", "passage_text": "To heal your gums faster after a tooth extraction, you will need: 1  An ice pack. 2  Salt. 3  Gauze. 4  Warm water. 5  Soft, cool foods. 6  Form a blood clot. 7  Rinse your mouth with warm salt water. 8  Eat soft foods. 9  Get plenty of rest for at least a week after the surgery. 1 This should be done about every two hours after you're done brushing your teeth to help the gums heal faster and recover from the tooth extraction. 2  Eat soft foods. 3  After having a tooth removed, you can help your gums to heal faster by only eating soft, cool foods for the first twenty-four hours after your surgery."}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20060813065932AAeUeJw", "passage_text": "Report Abuse. The initial healing period typically takes from one to two weeks, gum tissue takes about 3-4 weeks to heal and complete healing of the bone can take about 6-8 months depending on your care of this area. Some discomfort, bleeding and swelling should be expected in the next 24 hours as your mouth heals. "}, {"url": "http://www.utahmountainbiking.com/firstaid/mouthcut.htm", "passage_text": "Concerns: A small cut in the tongue heals well without stitches. If the laceration is under 1/2 inch long and doesn't gape when you move your tongue around, it can usually be ignored. Big or deep tongue cuts will open up and move around as you use your tongue -- filling up with taco chips. "}, {"url": "https://uk.answers.yahoo.com/question/index?qid=20120322160142AA0xEt1", "passage_text": "Next. I've had a cut on my gum at the back of the lower set of teeth and at first it was a scratch which caused tooth ache then it got a bit better, I went to the dentist for a check up & he said it was a scratch & it was fine but since then it has got worse, my gum has swelled up and it's really painful & is... "}]