[{"url": "https://www.fidelity.com/retirement-ira/ira-rules-faq", "passage_text": "If you are married filing jointly, you can make a full contribution to a Roth IRA if your income is less than $181,000 ($181,000 - $191,000 for a partial contribution) in 2014 and $183,000 ($183,000 - $193,000 for a partial contribution) in 2015. As a single filer, you can make a full contribution to a Roth IRA if your income is less than $114,000 ($114,000 - $129,000 for a partial contribution) in 2014 and $116,000 ($116,000 - $131"}, {"url": "http://www.rothira.com/what-is-a-Roth-IRA", "passage_text": "For details, see more on Roth IRA conversions). For 2015, you can contribute the maximum $5,500 to a Roth IRA ($6,500 if you are age 50 or older by the end of the year) if you are single or the single head of a household and your modified adjusted gross income (MAGI) is less than $164,000. 1 Saving during retirement: You can make contributions to a Roth if you continue to work in retirement as long as you stay within the income limits. 2  Traditional IRAs do not allow contributions after age 70 ½."}, {"url": "http://www.kiplinger.com/article/retirement/T046-C001-S003-who-can-contribute-to-a-roth-ira.html", "passage_text": "You can contribute up to $5,500 to a Roth IRA for 2013 or 2014, or $6,500 if you’re 50 or older. The amount you can contribute starts to phase out if your modified adjusted gross income for 2013 was more than $112,000 if you’re single or $178,000 if married filing jointly. And if you’re married and your joint income falls within the Roth IRA limits, your spouse can contribute to a Roth IRA, too -- even if he or she isn’t working -- as long as one of you has earned income from a job."}, {"url": "http://finance.zacks.com/can-ira-after-retirement-3639.html", "passage_text": "If you reached retirement age at 66 but kept on working, you could add another $20,000 to your tax-deferred IRA by the time you reach 70 1/2 years. With a Roth IRA, you can contribute $5,000 per year of after-tax earnings from work to your account for as long as you live. "}, {"url": "https://www.fidelity.com/retirement-ira/ira-rules-faq", "passage_text": "There are income limits for Roth IRAs. As a single filer, you can make a full contribution to a Roth IRA if your income is less than $114,000 ($114,000 - $129,000 for a partial contribution) in 2014 and $116,000 ($116,000 - $131,000 for a partial contribution) in 2015."}, {"url": "http://www.investopedia.com/ask/answers/061815/how-much-can-i-contribute-my-roth-401k.asp", "passage_text": "By Investopedia AAA |. A: The maximum amount that a person can contribute to his Roth 401(k) for the calendar year 2015 is $18,000, or $24,000 for those over age 50. These are the same maximum contribution amounts permitted for a traditional 401(k). A Roth 401(k) is essentially the same as a traditional 401(k) plan except that it only accepts contributions on an after-tax basis."}, {"url": "http://www.rothira.com/what-is-a-Roth-IRA", "passage_text": "You may make a partial contribution to a Roth IRA if you are single and your income is between $116,000 and $131,000 or if you are married filing jointly and your income is between $183,000 and $193,000. You can’t contribute to a Roth IRA if your income is above those levels. 1 Saving during retirement: You can make contributions to a Roth if you continue to work in retirement as long as you stay within the income limits. 2  Traditional IRAs do not allow contributions after age 70 ½."}, {"url": "http://www.kiplinger.com/article/retirement/T046-C001-S001-making-roth-ira-contributions-in-retirement.html", "passage_text": "You can contribute up to $5,000 to your own Roth IRA (up to $6,000 if you’re 50 or older during the year) and up to $5,000 for your wife (or $6,000 if she’s 50 or older), as long as you earned at least as much for the year as the combined contributions. Making Roth IRA Contributions in Retirement. Without earned income, you can't contribute to a Roth IRA – but a working spouse still can. By Kimberly LankfordSee my bio, plus links to all my recent stories. , January 20, 2012."}, {"url": "http://www.schwab.com/public/schwab/investing/retirement_and_planning/understanding_iras/faqs", "passage_text": "A Roth IRA is an individual retirement account to which you contribute after-tax dollars. Contributions and earnings can grow tax-free, and you can withdraw them tax-free after age 59½. Depending on your situation, a Roth IRA can be more flexible than a 401(k) or Traditional IRA. "}, {"url": "http://www.ehow.com/info_8085240_can-roth-ira-after-retire.html", "passage_text": "Clarifications. Although you can contribute to a Roth IRA during your retirement years, you cannot contribute unlimited amounts of money. The IRS enforces contribution limits for traditional and Roth IRAs regardless of age. In 2010, for example, you could contribute $6,000 if you are older than 50. "}]