[{"url": "http://psychologia.co/the-power-of-eye-contact/", "passage_text": "Eye contact is a powerful stimulator of love and affection. When you look someone directly in the eyes, their body produces chemical called phenylethylamine that may make the person feel in love. If you want to make someone fall in love with you, one of the first thing you should do is to look into their eyes. Don’t be disappointed if your sweetheart doesn’t meet your gaze – that could be very well because they are overwhelmed by you!"}, {"url": "http://changingminds.org/techniques/body/parts_body_language/eyes_body_language.htm", "passage_text": "When looking at a person normally, the gaze is usually at eye level or above (see eye contact, below). The gaze can also be a defocused looking at the general person. If after locking gaze a person of the opposite sex keeps looking at the eyes, then it may be love. If the eyes slide down over the body, then it is more likely to be lust. Exactly where the eyes go is important. Looking at a person's mouth can indicate that you would like to kiss them."}, {"url": "https://en.wikipedia.org/wiki/Staring", "passage_text": "Staring is a prolonged gaze or fixed look. In staring, one object or person is the continual focus of visual interest, for an amount of time. Staring can be interpreted as being either hostile, or the result of intense concentration or affection. To some extent, the meaning of a person’s staring behaviour depends upon the attributions made by the observer. Staring often occurs accidentally, when someone appears to be staring into space they may well be lost in thought, or stupefied, or simply unable to see."}, {"url": "http://www.huffingtonpost.com/2015/02/20/stare-four-minutes-couples-soulpancake_n_6718716.html", "passage_text": "“In 55 years of marriage, we’ve never really looked into each other’s eyes like that,” said one woman to her husband at the end of the four minutes. “When I look at you really closely, I realize how much I need you and what you mean to me, because that’s the truth,” her husband later says to her. "}, {"url": "https://answers.yahoo.com/question/index?qid=20100630051512AAx01tH", "passage_text": "What does it mean if someone stares at you in the eyes? but then is the first to look away im taking maybe 6 seconds maybe more held eye contact sat about 3 foot away. Best Answer: When i make eye contact with a guy sometimes its flirty sign. Or maybe he just has gorgeous eyes. I realized that i won't look at your eyes when I speak to a person. I kinda look at there whole face. If I look at your eyes then look away, I'm super shy because I like you. If I look at someone in the eyes they mean a lot to me at the moment. & I'm not afraid to be who i am around them"}, {"url": "http://psychologia.co/the-power-of-eye-contact/", "passage_text": "In some cases you will find yourself able to look into anyone’s eyes, except the person you really like. Shyness often gets in the way of the intense eye contact — we rarely look in someone’s eyes if at all; it feels uncomfortable (check out this download if you want to boost your dating confidence). If you want to make someone fall in love with you, one of the first thing you should do is to look into their eyes. Don’t be disappointed if your sweetheart doesn’t meet your gaze – that could be very well because they are overwhelmed by you!"}, {"url": "http://www.ign.com/boards/threads/whats-up-with-people-who-stare-deep-into-your-eyes-when-you-you-are-having-a-casual-conversation.454375644/", "passage_text": "Advertisement. Like deep deep. Like they are trying to crack you. Like they way a girl would stare into your eyes if she wanted the D. I work with this guy who does this. He's a close talker so he stands a little too close to you and then stares deep into your eyes like he's trying to preform jedi mind tricks"}, {"url": "https://answers.yahoo.com/question/index?qid=20080320143607AAWcUeb", "passage_text": "Report Abuse. How can they stare deep into your eyes if you are not looking at them. How can they turn away when you see them looking at you. Wouldn't you already have to be looking at them for them to look deep into your eyes. I'm confused."}]