[{"url": "http://www.ehow.com/facts_7502305_long-employers-keep-personnel-files.html", "passage_text": "One Year. There are some personnel records that need to be kept for at least one year after the employee leaves the company. These include all employment action records, such as promotions, transfers and terminations, and any pre-employment tests, complaint records and legal actions."}, {"url": "http://smallbusiness.chron.com/long-business-keep-employee-records-4869.html", "passage_text": "Learn how long you should keep personnel records for your business. Hospital Files image by PinkSony from Fotolia.com. When you own and run a business with employees, you have to establish and maintain employee records and personnel files."}, {"url": "http://smallbusiness.chron.com/long-business-keep-employee-records-4869.html", "passage_text": "In the case of employment records, the IRS guidelines say to keep the records for a minimum of four years after you pay the tax or the tax is due, whichever of the two dates is later. Small business expert Rieva Lesonsky suggests you keep employment records for a minimum of two years and for up to seven years."}, {"url": "http://smallbusiness.chron.com/long-business-keep-employee-records-4869.html", "passage_text": "Employee Contracts. If you have employment contracts with your employees, then you should maintain these contracts for at least 10 years. According to Financial Web, you should “err on the side of caution” and maintain employee records for a longer period than you think you may need, in case a legal issue arises."}, {"url": "http://www.eeoc.gov/employers/recordkeeping.cfm", "passage_text": "Recordkeeping Requirements. EEOC Regulations require that employers keep all personnel or employment records for one year. If an employee is involuntarily terminated, his/her personnel records must be retained for one year from the date of termination. Under ADEA recordkeeping requirements, employers must also keep all payroll records for three ..."}]