[{"url": "http://www.thefreedictionary.com/ponderosa", "passage_text": "Noun. 1. ponderosa-common and widely distributed tall timber pine of western North America having dark green needles in bunches of 2 to 5 and thick bark with dark brown plates when mature. bull pine, Pinus ponderosa, ponderosa pine, western yellow pine. yellow pine-any of various pines having yellow wood. 1  Facebook. "}, {"url": "https://en.wikipedia.org/wiki/Ponderosa_Ranch", "passage_text": "The Ponderosa Ranch was a theme park based on the popular 1960s television western Bonanza which housed the affluent land, timber and livestock-rich Cartwright family. The amusement park operated in Incline Village, Nevada, near Lake Tahoe, from 1967 until 2004. Copies of the Ponderosa Map, autographed by three of the Cartwrights, became souvenirs at the ranch for decades afterward, along with tin cups bearing their likenesses. Episodes that were filmed entirely or in part at the ranch bear a title plate at the end of the credits."}, {"url": "http://www.audioenglish.org/dictionary/ponderosa.htm", "passage_text": "• PONDEROSA (noun). The noun PONDEROSA has 1 sense: 1. common and widely distributed tall timber pine of western North America having dark green needles in bunches of 2 to 5 and thick bark with dark brown plates when mature. Familiarity information: PONDEROSA used as a noun is very rare. Dictionary entry details."}, {"url": "http://ponderosascenery.homestead.com/", "passage_text": "Welcome to Bonanza: Scenery Of The Ponderosa! Dedicated to the legendary and most-beloved TV Western series of all time. Today, the series is seen in 30 countries, in 12 languages, and over 280 million viewers worldwide in reruns since 1973. "}, {"url": "https://www.for.gov.bc.ca/hfd/library/documents/treebook/ponderosapine.htm", "passage_text": "Where to find ponderosa or yellow pine It is the characteristic tree of the southern Interior. Habitat Ponderosa pine occurs on a variety of soils, from extremely dry to well-drained, relatively deep, moist soils. It grows in pure, open, park-like groups at lower elevations."}, {"url": "https://en.wikipedia.org/wiki/Pinus_ponderosa", "passage_text": "The National Register of Big Trees lists a ponderosa pine that is 235 ft (72 m) tall and 324 in (820 cm) in circumference. In January 2011, a Pacific ponderosa pine in the Rogue River–Siskiyou National Forest in Oregon was measured with a laser to be 268.35 ft (81.79 m) high. Sources differ on the scent of P. ponderosa, but it is more or less of turpentine, reflecting the dominance of terpenes (alpha-and beta-pinenes, and delta-3-carene)."}, {"url": "http://www.na.fs.fed.us/pubs/silvics_manual/Volume_1/pinus/ponderosa.htm", "passage_text": "Ponderosa pine (Pinus ponderosa), also called western yellow pine, is one of the most widely distributed pines in western North America. A major source of timber, ponderosa pine forests are also important as wildlife habitat, for recreational use, and for esthetic values. Pacific ponderosa pine (var. ponderosa) ranges from latitude 52° N. in the Fraser River drainage of southern British Columbia, south through the mountains of Washington, Oregon, and California, to latitude 33° N. near San Diego."}, {"url": "https://en.wikipedia.org/wiki/Pinus_ponderosa", "passage_text": "P. ponderosa is a large coniferous pine (evergreen) tree. The bark helps to distinguish it from other species. Mature to over-mature individuals have yellow to orange-red bark in broad to very broad plates with black crevices. Younger trees have blackish-brown bark, referred to as blackjacks by early loggers. Sources differ on the scent of P. ponderosa, but it is more or less of turpentine, reflecting the dominance of terpenes (alpha-and beta-pinenes, and delta-3-carene)."}, {"url": "http://ponderosasteakhouses.com/menu/", "passage_text": "At Ponderosa, creating special moments together is what we offer. We do it by welcoming you into a comfortable dining experience that brings more food and flavor choices together. "}]