[{"url": "http://www.vikingrivercruises.com/cruise-destinations/europe/rivers/main/about.html", "passage_text": "The Main is about 330 miles long, 240 miles of which are navigable by cruise, between Bamberg and Mainz. It flows in a westerly direction through the German states of Bavaria, Baden-Wuerttemberg württemberg And. Hesse the river runs through cities such As, Frankfurt, Offenbach wertheim And. wuerzburg würzburg"}, {"url": "http://www.cruisecritic.com/articles.cfm?ID=1788", "passage_text": "Choosing a Main River Cruise Itinerary. Most itineraries combine some time on the Main with cruising other rivers, notably the Rhine and Moselle. Main, Moselle and Rhine: Good for river cruising newbies, these cruises traverse Luxembourg to Trier on the Rhine, then go on the Moselle to Bernkastel-Kues and Cochem."}, {"url": "http://www.rivercruise.com/main_river.cfm", "passage_text": "Germany's peaceful Main River winds through the heart of the country, passing forests and vineyards as well as cosmopolitan cities and medieval towns. The river is a tributary of the Rhine and also connects with the Danube via the Main-Danube Canal. Many Main itineraries also sail the Rhine and Danube, some traveling from the North Sea all the way to the Black Sea."}, {"url": "http://www.cruisecritic.com/articles.cfm?ID=1788", "passage_text": "(For more info, read Rhine River Cruise Basics and Moselle River Cruise Basics .). Main only: These six-night sailings go between Frankfurt and Nuremberg. Stops include Heidelberg, Wertheim, Wurzburg and Bamberg, with an overnight in Nuremberg so passengers have time to explore."}, {"url": "http://www.avalonwaterways.com/River-Cruises/Main-River/", "passage_text": "This splendid Central Europe river cruise introduces you to the magnificent Main, Rhine, and Moselle Rivers, as well as to the fascinating Main Danube Canal. Your vacation begins with two overnights, guided sightseeing, and a visit of the Hradcany Castle grounds in the “Golden City” of Prague."}, {"url": "http://traveltips.usatoday.com/main-rivers-russia-107257.html", "passage_text": "Russia is the largest country on Earth, and its land mass is split between Europe and Asia, with the Ural River roughly dividing the territories. The country features a number of important rivers that drain into several bodies of water, including the Arctic Ocean, Baltic Sea, Black Sea, Caspian Sea and Pacific Ocean."}, {"url": "http://www.vikingrivercruises.com/cruise-destinations/europe/rivers/main/about.html", "passage_text": "The Main River (pronounced like “mine” in English) originates in Upper Franconia where the White and Red Main rivers unite near Kulmbach. Major tributaries of the river are the Regnitz, the Fraenkische Fränkische, saale The tauber and The. nidda"}, {"url": "http://www.avalonwaterways.com/River-Cruises/Main-River/", "passage_text": "See the highlights of Central Europe along the Danube, Main and Rhine River on this enchanting cruise between Budapest and Amsterdam. Certified Local Guides conduct guided sightseeing or guided walks in each city to show off the highlights."}]