[{"url": "http://www.nature.com/scitable/topicpage/chromosomes-14121320", "passage_text": "Chromosomes are made up of a DNA-protein complex called chromatin that is organized into subunits called nucleosomes. The way in which eukaryotes compact and arrange their chromatin not only allows a large amount of DNA to fit in a small space, but it also helps regulate gene expression. eBooks. "}, {"url": "http://www.answers.com/Q/What_is_a_chromosome_made_of", "passage_text": "1 person found this useful. Edit. Share to: 1  A Lesson in Genetics: The X Chromosome and Its Function In your cells, the material that makes up your genetic material is known as a chromosome. 2  Chromosomes are organized DNA structures found in the cell nucleus. No. Chromosomes are made up of DNA and each chromosome contains thousands of genes. 1 person found this useful. Edit. Share to: The question and answer are locked and cannot be edited."}, {"url": "https://answers.yahoo.com/question/index?qid=20080103132218AA0U9x4", "passage_text": "Best Answer: chromosomes are tiny x looking structures in a cell that package chromatids which are joineed by Histones. Inside this Chromatids are the genetic sequences know as deoxyribonucleic acid (DNA). All of this is located in the nucleus of the cell. Chromosomes are made up of tightly wound bands of DNA, which is made up of Four nucleotide bases, adenine, guanine, cytosine, and thymine, with sugar and phospate bonds. Ace Combat Player · 8 years ago. Thumbs up. 1."}, {"url": "https://en.wikipedia.org/wiki/Chromosome", "passage_text": "Compaction of the duplicated chromosomes during cell division (mitosis or meiosis) results either in a four-arm structure (pictured to the right) if the centromere is located in the middle of the chromosome or a two-arm structure if the centromere is located near one of the ends. Human cells have 23 pairs of chromosomes (22 pairs of autosomes and one pair of sex chromosomes), giving a total of 46 per cell. In addition to these, human cells have many hundreds of copies of the mitochondrial genome."}, {"url": "http://www.bbc.co.uk/schools/gcsebitesize/science/add_aqa_pre_2011/celldivision/celldivision1.shtml", "passage_text": "Chromosomes are made from DNA. Genes are short sections of DNA. Genetically identical cells are produced by a type of cell division called mitosis. In sexual reproduction, a male gamete fuses with a female gamete to produce a new cell. This is called fertilisation. "}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/chromosome", "passage_text": "DNA and histone proteins are packaged into structures called chromosomes. In the nucleus of each cell, the DNA molecule is packaged into thread-like structures called chromosomes. Each chromosome is made up of DNA tightly coiled many times around proteins called histones that support its structure. Chromosomes are not visible in the cell’s nucleus—not even under a microscope—when the cell is not dividing. "}, {"url": "http://ghr.nlm.nih.gov/handbook/basics/gene", "passage_text": "Genes are made up of DNA. Each chromosome contains many genes. A gene is the basic physical and functional unit of heredity. Genes, which are made up of DNA, act as instructions to make molecules called proteins. In humans, genes vary in size from a few hundred DNA bases to more than 2 million bases."}, {"url": "http://www.answers.com/Q/What_is_a_chromosome_made_of", "passage_text": "Confidence votes 1.9K. Chromosomes are made of a single strand of DNA. There are also some proteins that are bound to this DNA in order to manage it and keep it coiled, these are also sometimes referred to as part of the chromosome. No. Chromosomes are made up of DNA and each chromosome contains thousands of genes. 1 person found this useful. Edit. Share to: The question and answer are locked and cannot be edited."}, {"url": "https://answers.yahoo.com/question/index?qid=20111103002851AA7DT7v", "passage_text": "Rating Newest Oldest. Best Answer: Effectively, and most importantly, chromosomes are made of DNA. Chromosomes are how your DNA is packaged. It's wrapped around proteins called histones, and then the strong of histones is coiled around and around, and then THAT is coiled even further. "}]