[{"url": "https://www.pctechguide.com/computer-memory", "passage_text": "Computer Memory. The system memory is the place where the computer holds current programs and data that are in use. There are various levels of computer memory, including ROM, RAM, cache, page and graphics, each with specific objectives for system operation. If ROM is damaged, the computer system simply cannot function. RAM, or Random Access Memory, is “volatile.” This means that it only holds data while power is present. RAM changes constantly as the system operates, providing the storage for all data required by the operating system and software."}, {"url": "http://whatis.techtarget.com/definition/memory-management", "passage_text": "Part of the Storage management glossary: Memory management is the process of controlling and coordinating computer memory, assigning portions called blocks to various running programs to optimize overall system performance. Memory management resides in hardware, in the OS (operating system), and in programs and applications. In hardware, memory management involves components that physically store data, such as RAM (random access memory) chips, memory caches, and flash-based SSDs (solid-state drives)."}, {"url": "http://www.uni.edu/walsh/applebymc.html", "passage_text": "Human memory is composed of three interconnected memory stores. Information from our senses is initially stored in sensory memory (SM) in the same manner that it processed by our senses (e.g., as images or sounds). Information in LTM is stored predominantly in terms of its meaning (i.e., semantically), and this memory store is often compared to a library whose contents are organized in a number of different meaningful ways (e.g., by subject matter, by authors' names, in alphabetical order, etc.)."}, {"url": "https://en.wikipedia.org/wiki/Memory", "passage_text": "In psychology, memory is the process in which information is encoded, stored, and retrieved. Encoding allows information from the outside world to be sensed in the form of chemical and physical stimuli. In the first stage the information must be changed so that it may be put into the encoding process. Storage is the second memory stage or process."}, {"url": "http://www.webopedia.com/TERM/M/memory.html", "passage_text": "Internal storage areas in the computer. The term memory identifies data storage that comes in the form of chips, and the word storage is used for memory that exists on tapes or disks. Moreover, the term memory is usually used as a shorthand for physical memory, which refers to the actual chips capable of holding data. "}, {"url": "http://pcguide.com/ref/ram/index-c.html", "passage_text": "The system memory is the place where the computer holds current programs and data that are in use. The term memory is somewhat ambiguous; it can refer to many different parts of the PC because there are so many different kinds of memory that a PC uses. Memory plays a significant role in the following important aspects of your computer system: 1  Performance: The amount and type of system memory you have is an important contributing factor to overall performance."}, {"url": "http://www.computerhope.com/jargon/r/ram.htm", "passage_text": "Alternatively referred to as main memory, primary memory, or system memory, Random Access Memory (RAM) is a hardware device that allows information to be stored and retrieved on a computer. RAM is usually associated with DRAM, which is a type of memory module. Because information is accessed randomly instead of sequentially like it is on a CD or hard drive, the computer can access the data much faster."}, {"url": "http://pcguide.com/ref/ram/index-c.html", "passage_text": "1 Performance: The amount and type of system memory you have is an important contributing factor to overall performance. 2  In many ways, it is more important than the processor, because insufficient memory can cause a processor to work at 50% or even more below its performance potential. Memory plays a significant role in the following important aspects of your computer system: 1 "}]