[{"url": "https://en.wikipedia.org/wiki/Anthropometrics", "passage_text": "Anthropometry involves the systematic measurement of the physical properties of the human body, primarily dimensional descriptors of body size and shape. Anthropometric measurements also have uses in epidemiology and medical anthropology, for example in helping to determine the relationship between various body measurements (height, weight, percentage body fat, etc.) and medical outcomes."}, {"url": "https://en.wikipedia.org/wiki/Anthropometrics", "passage_text": "Today, ergonomics professionals apply an understanding of human factors to the design of equipment, systems and working methods in order to improve comfort, health, safety, and productivity. Anthropometric measurements also have uses in epidemiology and medical anthropology, for example in helping to determine the relationship between various body measurements (height, weight, percentage body fat, etc.) and medical outcomes."}, {"url": "http://www.merriam-webster.com/dictionary/anthropometry", "passage_text": "Medical Definition of ANTHROPOMETRY. : the study of human body measurements especially on a comparative basis. — an·thro·po·met·ric \\-pə-ˈme-trik\\ adjective. ADVERTISEMENT. "}, {"url": "https://en.wikipedia.org/wiki/Anthropometrics", "passage_text": "Size of the human stomach varies significantly in adults, with one study showing areas ranging from 520 cm 3 (32 cu in) to 1,536 cm 3 (93.7 cu in) and weights ranging from 77 grams (2.7 oz) to 453 grams (16.0 oz). Anthropometric measurements also have uses in epidemiology and medical anthropology, for example in helping to determine the relationship between various body measurements (height, weight, percentage body fat, etc.) and medical outcomes."}, {"url": "https://en.wikipedia.org/wiki/Anthropometrics", "passage_text": "Today, anthropometry plays an important role in industrial design, clothing design, ergonomics and architecture where statistical data about the distribution of body dimensions in the population are used to optimize products. Anthropometric measurements also have uses in epidemiology and medical anthropology, for example in helping to determine the relationship between various body measurements (height, weight, percentage body fat, etc.) and medical outcomes."}, {"url": "http://yunus.hacettepe.edu.tr/~deniz/lisans/kin/kinant.pdf", "passage_text": "Definition of Anthropometry Anthropometry is the science which deals with the measurement of the size, weight, and proportions of the human body (Dorland's Medical Dictionary). This lecture will concentrate on non-invasive techniques of determining these parameters. Return to Lecture Outline. "}, {"url": "http://ergonomics.about.com/od/glossary/g/anthropometry.htm", "passage_text": "Definition: Anthropometry is the measure of wo/man (anthro=man, pometry=measure). The study of anthropometry is the study of human body measurements to assist in understanding human physical variations and aid in anthropological classification. "}, {"url": "http://www.thefreedictionary.com/Anthropometrics", "passage_text": "Noun. 1. anthropometry-measurement and study of the human body and its parts and capacities. measurement, measuring, mensuration, measure-the act or process of assigning numbers to phenomena according to a rule; the measurements were carefully done; his mental measurings proved remarkably accurate. anthropometry. the study concerned with the measurements of the proportions, size, and weight of the human body. — anthropometrist, n. — anthropometric, anthropometrical, adj."}, {"url": "http://www.ergonomics4schools.com/lzone/anthropometry.htm", "passage_text": "Anthropometry Step-by-Step. Decide who you are designing for. Anthropometry tables give measurements of different body parts for men and women, and split into different nationalities, and age groups, from babies to the elderly. So first of all you need to know exactly who you are designing for. Decide which body measurements are relevant You need to know which parts of the body are relevant to your design. For example, if you were designing a mobile phone, you would need to consider the width and length of the hand, the size of the fingers, as well as grip diameter."}, {"url": "http://www.ergonomics4schools.com/lzone/anthropometry.htm", "passage_text": "Decide who you are designing for Anthropometry tables give measurements of different body parts for men and women, and split into different nationalities, and age groups, from babies to the elderly. So first of all you need to know exactly who you are designing for. Decide which body measurements are relevant You need to know which parts of the body are relevant to your design. For example, if you were designing a mobile phone, you would need to consider the width and length of the hand, the size of the fingers, as well as grip diameter."}]