[{"url": "http://www.buzzle.com/articles/bacterial-meningitis-incubation-period.html", "passage_text": "Bacterial Meningitis Incubation Period. Bacterial meningitis is a life-threatening disease that comes on quickly. Having knowledge about its causes, symptoms, incubation period and treatment methods will be helpful to you. Advertisement. The human brain and the spinal cord are covered with protective membranes known as meninges. Bacterial meningitis can be caused due to a large number of bacteria like Neisseria meningitidis, Haemophilus influenzae or Streptococcus pneumoniae. Having a weak immune system puts you on a high risk of contracting meningitis. Infants and children are at a higher risk of suffering from this condition than adults."}, {"url": "http://www.medicinenet.com/is_meningitis_contagious/article.htm", "passage_text": "What is the incubation period for meningitis? The incubation period for bacterial meningitis, the most serious types of meningitis, is about three to five days after initial contact with the microbe. However, in some individuals, bacterial meningitis symptoms can occur as rapidly as 24 hours. For viral meningitis, the incubation period can range widely from only a few days to a few weeks. Patients who get meningitis usually have symptoms of headache, fever, and a stiff neck"}, {"url": "http://www.cdc.gov/meningitis/bacterial.html", "passage_text": "The germs that cause bacterial meningitis can be contagious. Some bacteria can spread through the exchange (e.g., by kissing) of respiratory and throat secretions (e.g., saliva or mucus). Fortunately, most of the bacteria that cause meningitis are not as contagious as viruses that cause the common cold or the flu. Also, the bacteria are not spread by casual contact or by simply breathing the air where a person with meningitis has been. Bacterial meningitis is usually severe. While most people with meningitis recover, it can cause serious complications, such as brain damage, hearing loss, or learning disabilities. There are several pathogens (types of germs) that can cause bacterial meningitis."}, {"url": "http://www.who.int/mediacentre/factsheets/fs141/en/", "passage_text": "Meningococcal meningitis is a bacterial form of meningitis, a serious infection of the meninges that affects the brain membrane. It can cause severe brain damage and is fatal in 50% of cases if untreated. Key facts. 1  Meningococcal meningitis is a bacterial form of meningitis, a serious infection of the thin lining that surrounds the brain and spinal cord. 2  The extended meningitis belt of sub-Saharan Africa, stretching from Senegal in the west to Ethiopia in the east (26 countries), has the highest rates of the disease."}, {"url": "http://www.wisegeek.com/what-is-the-meningitis-incubation-period.htm", "passage_text": "The meningitis incubation period depends on the causative organism behind the meningitis, but usually ranges between two and 14 days. During the incubation period, the patient is typically not contagious. The classic trio of symptoms indicative of meningitis are headache, stiff neck, and a high fever. The incubation period for meningitis can vary between 2 to 14 days. Children under the age of five face a high risk of contracting meningitis-related infections. The spinal cord is normally enclosed within membranes called meninges, which protect and cushion long nerves."}, {"url": "http://www.who.int/mediacentre/factsheets/fs141/en/", "passage_text": "1 Meningococcal meningitis is a bacterial form of meningitis, a serious infection of the thin lining that surrounds the brain and spinal cord. 2  The extended meningitis belt of sub-Saharan Africa, stretching from Senegal in the west to Ethiopia in the east (26 countries), has the highest rates of the disease. Key facts. 1 "}, {"url": "http://www.wisegeek.com/what-is-the-meningitis-incubation-period.htm", "passage_text": "ZipLine. Post 2. @alisha-- The incubation period for viral and bacterial meningitis is similar. It's usually about ten days for both but it can range anywhere from two days to two weeks depending on the cause of the meningitis and the individual. There is also fungal meningitis, but fungal meningitis is different. The incubation period for meningitis can vary between 2 to 14 days. Children under the age of five face a high risk of contracting meningitis-related infections. The spinal cord is normally enclosed within membranes called meninges, which protect and cushion long nerves."}, {"url": "http://www.ehagroup.com/resources/pathogens/meningitis/", "passage_text": "The incubation period depends on the causative agent. For example the incubation period of meningococcal meningitis is 2-10 days while the incubation for hemophilus meningitis is much shorter ranging from 2-4 days. However the range of incubation for most organisms causing meningitis is 2 days to 2 weeks. Meningitis is infection and inflamation of the meninges (the membranes that cover the brain and the spinal cord). Meningitis can be caused by bacteria, viruses, fungi and parasites."}]