[{"url": "http://www.homeadvisor.com/cost/heating-and-cooling/repair-a-fireplace-or-woodstove/", "passage_text": "Find out how much your project will cost. Provide a few details about your project and receive competitive quotes from local pros. The average national cost of woodstove and fireplace repair is $432, with most homeowners spending between $167 and $739. This data is based on actual project costs as reported by HomeAdvisor members. Many people are choosing to heat their homes with wood, due to the increase in cost of natural gas and oil. "}, {"url": "http://www.howmuchisit.org/chimney-repair-cost/", "passage_text": "1 The cost of chimney repair will really depend on the type of repair required. 2  For instance, a cracked chimney usually costs around $1,000 to repair since it will have to be rebuilt. 3  The issue becomes worse if the cracks are left untreated. 1 Users on the forum, Gardenweb.com, claimed that they had prices that ranged anywhere from $500 to more than $3,000 to fix their chimney. 2  Common repairs included tuckpointing, inserting a new liner, and replacing the cap. 3  Atekmasonry.com states that the average chimney repair is going to be between $300 to $1,000."}, {"url": "http://askthechimneysweep.com/2010/07/chimney-liner-installation-cost/", "passage_text": "Chimney liner cost can be surprising. There are a variety of factors that play into how much a chimney reline with installation costs, including your area of the country, but on average the cost to have your chimney professionally relined runs anywhere from $2,500 to $5,000."}, {"url": "http://www.improvenet.com/r/costs-and-prices/fireplace-repairs", "passage_text": "The Average Fireplace Repair Cost. The average cost of a fireplace is $934. The final project cost will depend on the extent of the damage to the fireplace and chimney as well as whether or not there was a fire that spread into the adjacent walls. "}, {"url": "http://www.wndu.com/news/specialreports/headlines/Angies_List_Chimney_cleaning_131349043.html", "passage_text": "Angie's List 4 Checkpoints for Chimney Service: 1. Get multiple estimates: As with hiring any contractor, it's best to receive multiple quotes before proceeding with work. The average chimney cleaning and inspection cost around $150 - the price for a video inspection and sweep will be closer to $200. Be wary of upfront prices that seem to be good to be true, and don't let contractors pressure you into snap decisions. "}, {"url": "http://www.ehow.com/facts_7215741_costs-repair-chimney.html", "passage_text": "Average Price. Replacing or rebuilding your entire chimney can cost up to $1,000 or more, according to Chimney Repair. MGI Home Inspection puts the cost of aligning a chimney at up to $3,000. The installation of chimney flashing costs $150 to $350, and rebuilds are charged on a linear foot basis"}, {"url": "http://turnbullmasonry.com/how-much-should-your-chimney-repair-cost-each-year/", "passage_text": "Average Cost For Chimney Fireplace Repairs. To repair a fireplace, the average homeowner spends between $446 and $676, the average low is $100 and the maximum high is around $800 (See stats). These numbers largely fluctuate depending on where one lives and the weather in that area. "}, {"url": "http://www.howmuchisit.org/chimney-repair-cost/", "passage_text": "1 Atekmasonry.com states that the average chimney repair is going to be between $300 to $1,000. 2  Common repair jobs can include rebuilding and replacing bricks or stones, replacing a cap, replacing a liner, replacing mortar, and/or reflashing. 1 Users on the forum, Gardenweb.com, claimed that they had prices that ranged anywhere from $500 to more than $3,000 to fix their chimney. 2  Common repairs included tuckpointing, inserting a new liner, and replacing the cap. 3 "}, {"url": "http://www.howmuchisit.org/chimney-crown-repair-cost/", "passage_text": "1 The cost to repair a chimney crown will depend on the size of the chimney and how easy it is to access the chimney. 2  Depending on the severity of the job, the average cost of chimney crown repair will range anywhere from $400 to as much as $2,200. 1 Since there are different types of crown repairs, the costs are going to vary widely. 2  For example, schenectadychimneysweep.org charges $500 to $2,000 based on the size of the chimney and how easy the chimney can be accessed. 3  According to DIYReviews.net, they claim that the average job can range $500 to $2,000 as well."}]