[{"url": "http://www.nutrition-and-you.com/cassava.html", "passage_text": "Cassava nutrition facts. Cassava (yuca or manioc) is a nutty flavored, starch-tuber in the spurge family (Euphorbiaceae) of plants. It thought to have originated from the South-American forests. Its sweet, chewy underground tuber is one of the popular edible root-vegetables. Young tender cassava (yuca) leaves are a good source of dietary proteins and vitamin K. Vitamin-K has a potential role in bone mass building by promoting osteotrophic activity in the bones."}, {"url": "http://www.fao.org/wairdocs/x5425e/x5425e05.htm", "passage_text": "The cassava root is not as nutritious as taro yam, sweet potato, bananas or breadfruit, but it does have some nutritional value. It contains a lot of carbohydrate which can provide the body with energy. It is a good source of Vitamin C, potassium and dietary fibre. The body needs energy for warmth, work and play. Cassava-A popular plant. The cassava plant (also called manioc, manioke, tavioka, mendoka, tapioca) was brought to the Pacific during the last century. The plant was probably spread to the Pacific from Mexico by the Spanish and from Brazil by the Portuguese. Its roots have become a staple food on some islands."}, {"url": "https://en.wikipedia.org/wiki/Cassava", "passage_text": "Though it is sometimes called yuca in Spanish, it differs from the yucca, an unrelated fruit-bearing shrub in the family Asparagaceae. Cassava, when dried to a powdery (or pearly) extract, is called tapioca; its fermented, flaky version is named garri. Cassava root is a poor source of protein. Despite the very low quantity, the quality of cassava root protein is fairly good in terms of essential amino acids. Methionine, cysteine and cystine are, however, limiting amino acids in cassava root."}, {"url": "http://cassavabiz.org/postharvest/1_posthvst_01.htm", "passage_text": "Nutritionally, cassava contains potassium, iron, calcium, vitamin A, folic acid, sodium, vitamin C, vitamin B-6, and protein. Cassava is applicable in many types of products such as food, confectionery, sweeteners, glues, plywood, textiles, paper, biodegradable products, monosodium glutamate, and drugs. It is mostly consumed in the form of gari, fufu, tapioca, starch, kpokpogari, and lafun. In the northern part of the country it is eaten raw as a snack. Cassava flour is majorly used in bakery products and cassava starch can be used as a general thickening agent."}, {"url": "https://en.wikipedia.org/wiki/Cassava", "passage_text": "Cassava is the third largest source of food carbohydrates in the tropics, after rice and maize. Cassava is a major staple food in the developing world, providing a basic diet for over half a billion people. It is one of the most drought-tolerant crops, capable of growing on marginal soils. Cassava root is a poor source of protein. Despite the very low quantity, the quality of cassava root protein is fairly good in terms of essential amino acids. Methionine, cysteine and cystine are, however, limiting amino acids in cassava root."}, {"url": "http://healthyeating.sfgate.com/nutrients-cassava-1342.html", "passage_text": "Cassava is a starchy root vegetable with a variety of uses. Cassava, or Manihot esculenta, is also known as manioc. This tropical root vegetable is native to Brazil and Paraguay but now also grows in other nations in South America and Africa, where it is a significant source of calories. Starches, such as those in cassava, are types of complex carbohydrates. They are the most common source of carbohydrates in the typical American diet, according to the U.S Department of Health and Human Services. A serving of cassava contains 3.7 grams of dietary fiber, or 15 percent of the daily value. Dietary fiber lowers your cholesterol levels and helps regulate your blood sugar, according to the U.S Department of Health and Human Services. Dietary fiber comes from the parts of plant foods that your body cannot digest"}, {"url": "http://healthyeating.sfgate.com/nutrients-cassava-1342.html", "passage_text": "You can cook cassava by boiling, baking or frying it. The serving size of cassava is 1 cup, which weighs 206 grams, or 7 ounces. One serving contains 330 calories, 3 grams of protein and only 0.5 grams of fat. Starches, such as those in cassava, are types of complex carbohydrates. They are the most common source of carbohydrates in the typical American diet, according to the U.S Department of Health and Human Services. A serving of cassava contains 3.7 grams of dietary fiber, or 15 percent of the daily value. Dietary fiber lowers your cholesterol levels and helps regulate your blood sugar, according to the U.S Department of Health and Human Services. Dietary fiber comes from the parts of plant foods that your body cannot diges"}, {"url": "https://en.wikipedia.org/wiki/Cassava", "passage_text": "The cassava root is long and tapered, with a firm, homogeneous flesh encased in a detachable rind, about 1 mm thick, rough and brown on the outside. Commercial varieties can be 5 to 10 cm (2.0 to 3.9 in) in diameter at the top, and around 15 to 30 cm (5.9 to 11.8 in) long. Cassava root is a poor source of protein. Despite the very low quantity, the quality of cassava root protein is fairly good in terms of essential amino acids. Methionine, cysteine and cystine are, however, limiting amino acids in cassava root."}, {"url": "http://healthyeating.sfgate.com/cassava-benefits-5008.html", "passage_text": "Cassava, also known as manioc or yucca, is a starchy rhizome that is mostly cultivated in the hot climates of Africa, Asia and South America. Cassava shouldn’t be eaten raw. This is because it contains toxic amounts of cyanogenic glycosides, which can be reduced to innocuous levels by cooking it. "}]