[{"url": "http://www.answers.com/Q/What_type_of_food_do_they_eat_in_Hungary", "passage_text": "As dogs get older the tarter builds up and their gums become sore and your dog won't eat the hard types of foods which they need. Brush their teeth every day. To get your dog to gain a taste for dry food mix water or other liquid and let soak until kibbles become softer."}, {"url": "http://www.buzzfeed.com/anitabadejo/hungarian-foods-the-world-should-know", "passage_text": "What it is: Known to most as “goulash,” this popular soup is a Hungarian original. It contains chunks of beef, potatoes, and vegetables, plus plenty of paprika and spices. Why it’s awesome: Originally made by cattle herdsman, gulyas gulyás is pure comfort: food, hearty, homey and. Hot get a [ recipe ]. here"}, {"url": "http://goeasteurope.about.com/od/hungary/p/hungarianfood.htm", "passage_text": "Hungarian Traditional Foods-Desserts in Hungary: Hungarians have inherited dessert recipes and other sweet concoctions from all over Europe. Somloi galuska is a decadent sponge cake containg rum sauce, vanilla cream, and chocolate syrup."}, {"url": "http://goeasteurope.about.com/od/hungary/p/hungarianfood.htm", "passage_text": "When foreigners think of Hungarian cuisine, goulash and chicken paprika naturally spring to mind. However, traditional Hungarian food doesn't stop at these two tasty dishes. The food of Hungary has a long history with many influences-including those from neighboring Slavic countries, Germany, Austria, and France."}, {"url": "http://www.foodbycountry.com/Germany-to-Japan/Hungary.html", "passage_text": "The best-known ingredient in Hungarian food is the red-powdered spice called paprika. It is used to flavor many dishes. Other staples of Hungarian cooking include onions, cabbage, potatoes, noodles, and caraway seeds. Both cream and sour cream are used heavily in Hungarian food."}, {"url": "http://www.answers.com/Q/What_type_of_food_do_they_eat_in_Hungary", "passage_text": "Confidence votes 175. Hungarians eat a variety of foods. Pork is very popular, as smoked products, sausages, and cutlets. Seasonal vegetables are commonly consumed, as well as staples like potatoes, rice, and pasta."}, {"url": "http://www.frommers.com/destinations/hungary/672942", "passage_text": "Gulyas, gulyás often mispronounced as, goulash is a meat soup usually made with beef or, pork, carrots and potatoes in a rich. Broth travelers often have the misconception that gulyas gulyás is. A stew babgulyas babgulyás is a hearty and delicious bean soup. similar to"}, {"url": "http://www.answers.com/Q/What_type_of_food_do_they_eat_in_Hungary", "passage_text": "Traditional Hungarian foods include goulash and chicken paprika. Goulash, tokany, and porkolt all contain meat and a hearty mix of vegetables in stews or sauces Sausage is als … o a big part of the Hungarian cuisine. Fish served with various sauces, mushrooms, and vegetables."}]