[{"url": "https://en.wikipedia.org/wiki/Sedimentary_rock", "passage_text": "Sedimentary rocks are types of rock that are formed by the deposition of material at the Earth 's surface and within bodies of water. Chemical sedimentary rock forms when mineral constituents in solution become supersaturated and inorganically precipitate. Common chemical sedimentary rocks include oolitic limestone and rocks composed of evaporite minerals such as halite (rock salt), sylvite, barite and gypsum."}, {"url": "https://en.wikipedia.org/wiki/Sedimentary_rock", "passage_text": "The sedimentary rock cover of the continents of the Earth's crust is extensive, but the total contribution of sedimentary rocks is estimated to be only 8% of the total volume of the crust. Sedimentary rocks are only a thin veneer over a crust consisting mainly of igneous and metamorphic rocks. Chemical sedimentary rock forms when mineral constituents in solution become supersaturated and inorganically precipitate. Common chemical sedimentary rocks include oolitic limestone and rocks composed of evaporite minerals such as halite (rock salt), sylvite, barite and gypsum."}, {"url": "http://www.geomore.com/porosity-and-permeability-2/", "passage_text": "Most oil and gas has been produced from sandstones. These rocks usually have high porosity, and are usually “high perm.” Porosity and permeability are absolutely necessary to make a productive oil or gas well. The petroleum geologist must stay focused on the porosity and permeability of the prospective reservoir. Porosity. Porosity of a rock is a measure of its ability to hold a fluid. Mathematically, porosity is the open space in a rock divided by the total rock volume (solid + space or holes). Porosity is normally expressed as a pecentage of the total rock which is taken up by pore space."}, {"url": "https://en.wikipedia.org/wiki/Sedimentary_rock", "passage_text": "Particles that form a sedimentary rock by accumulating are called sediment. Before being deposited, sediment was formed by weathering and erosion in a source area, and then transported to the place of deposition by water, wind, ice, mass movement or glaciers which are called agents of denudation. Chemical sedimentary rock forms when mineral constituents in solution become supersaturated and inorganically precipitate. Common chemical sedimentary rocks include oolitic limestone and rocks composed of evaporite minerals such as halite (rock salt), sylvite, barite and gypsum."}, {"url": "http://www.earthscienceeducation.com/taster/Will%20My%20Rock%20Hold%20Water.pdf", "passage_text": "The permeability of the rock samples is likely to be – permeable-sandstone, chalk; impermeable – clay, slate, marble, granite. This may vary according to the samples, e.g. some sandstones may have a mixture of grain sizes and may have poor permeability. Permeable sandstone underground can store water (or oil and gas). Impermeable slate can be used on roofs of buildings to keep the water out. Impermeable rocks can also be used as facing stones on buildings or gravestones, and nice-looking ones (eg. granite) are used for kitchen work surfaces."}, {"url": "http://www.kgbanswers.com/what-is-an-example-of-a-sedimentary-rock-that-is-porous-but-not-permeable/10654359", "passage_text": "Shale is a fine-grained sedimentary rock that can have high porosity, yet can be nearly impermeable due to the poorly interconnected voids. "}, {"url": "http://www.bbc.co.uk/bitesize/ks3/science/environment_earth_universe/rock_cycle/revision/2/", "passage_text": "Rocks are made of grains that fit together. Each grain in the rock is made from a mineral, which is a chemical compound. The grains in a rock can be different colours, shapes and sizes. Granite has interlocking grains. Sandstone has rounded grains. Some types of rock have interlocking grains that fit tightly together. Granite is a rock with interlocking grains."}, {"url": "http://www.esta-uk.net/index_htm_files/porosity_permeability-a~-veronica_bull.doc", "passage_text": "POROSITY AND PERMEABILITY. Pore spaces are important because they can hold oil and gas, water for water supplies and deposits of hydrothermal minerals. The amount of pore space in a rock is called its. porosity. Volume of pore space. Porosity = ----------------------------------- x 100. Total volume of rock. Clay in particular loses porosity through this process, whilst sandstone often lose porosity as calcite and silica minerals grow in the pore spaces. Permeability. is the measure of the ease with which fluids can pass through rocks."}, {"url": "http://ijolite.geology.illinois.edu/04FallClass/geo250/lectures/lect5_sedimentary.html", "passage_text": "Sedimentary rocks are rock particles and mineral grains (sediments) deposited in a fluid (water or air) and subsequently transformed to rocks (lithified). They typically occur in layers (strata) separated by bedding planes and differences in composition. "}, {"url": "https://en.wikipedia.org/wiki/Sedimentary_rock", "passage_text": "The size, form and orientation of clasts or minerals in a rock is called its texture. The texture is a small-scale property of a rock, but determined many of its large-scale properties, such as the density, porosity or permeability. Chemical sedimentary rock forms when mineral constituents in solution become supersaturated and inorganically precipitate. Common chemical sedimentary rocks include oolitic limestone and rocks composed of evaporite minerals such as halite (rock salt), sylvite, barite and gypsum."}]