[{"url": "http://www.wikihow.com/Become-an-Airline-Pilot", "passage_text": "An instrument rating requires 50 hours of cross country Pilot-in-Command (PIC) and 40 hours of actual or simulated instrument conditions. For the commercial certificate, you will need 250 hours total time, 100 hours PIC, 50 hours cross country, and 10 hours of dual instruction in a complex aircraft."}, {"url": "http://www.touch-n-goes.com/commercial/commercialpilotpricing.html", "passage_text": "• One of the major determining factors in the cost of your commercial pilot license is how you go about obtaining the 50 hours of required PIC cross-country time. For more information, refer to how to plan for your 50 hours of"}, {"url": "http://www.ehow.com/about_7469394_much-cost-become-pilot_.html", "passage_text": "For an aspiring pilot to spend 40 hours flying would cost $2,760 for the smaller plane or $4,360 for the larger one. However, while some pilots become proficient in as few as 40 hours, student pilots normally average closer to 70 hours of flight time before they are good enough to pass a pilot's licensing test."}, {"url": "http://jetcareers.com/becoming-an-airline-pilot.html", "passage_text": "Written by Shem Malmquist Being an airline pilot can be one of the world's best jobs. First year salaries range from $25,000 to over $50,000 per year. Pilots who have worked for a company for 10 years could have annual earnings close to $300,000. It is possible for a pilot to have even higher earnings during the course of a career. A pilot might only work 8 days in a month."}, {"url": "http://autorotate.com/portal/PHPAInfo/BecomingAHelicopterPilot.aspx", "passage_text": "You can expect to spend somewhere in the range of $200/hour for flight time with an instructor, and $150-$175 solo time. Ground time is usually in the range of $30 - $40/hour. If you do the math, you will find that it will cost about $10,000 to $15,000 to get your Private Pilot’s License."}, {"url": "http://www.ehow.com/about_7469394_much-cost-become-pilot_.html", "passage_text": "Grand Total. While some flight schools will advertise that you can get a pilot's license for around $5,000, the reality is that the cost generally works out to be more. A commercial pilot's license -- bigger plane, more than twice the flight time -- generally costs $40,000 to $50,000."}]