[{"url": "http://allrecipes.com/recipe/23724/pan-fried-green-beans/", "passage_text": "Ready In. 1  In a stainless steel pot over medium-high heat, combine green beans, garlic powder, onion powder, salt and pepper. 2  Cook, covered, until the beans begin to sweat. 3  Remove lid and stir occasionally until beans are tender."}, {"url": "http://www.justapinch.com/recipes/side/vegetable/easy-canned-green-beans.html", "passage_text": "Drain juice off green beans. Rinse beans well with cold water. 2. Place beans in sauce pan and add just enough cold tap water to barely cover beans. 3. Add remaining ingredients and bring to a boil for 1 minute. 4. Reduce heat and simmer for 15 - 20 minutes. Stir once or twice while cooking."}, {"url": "http://www.foodnetwork.com/recipes/patrick-and-gina-neely/fried-green-beans-recipe.html", "passage_text": "Preheat oil to 375 degrees F. Whisk the beer, flour, salt and pepper until smooth. Dip green beans into batter to coat, letting excess drip off. Fry in the peanut oil in batches, until they are golden and crisp. Remove from oil with a spider strainer to a paper towel lined sheet tray. Sprinkle with salt and pepper."}, {"url": "http://allrecipes.com/recipe/23724/pan-fried-green-beans/", "passage_text": "1 In a stainless steel pot over medium-high heat, combine green beans, garlic powder, onion powder, salt and pepper. 2  Cook, covered, until the beans begin to sweat. 3  Remove lid and stir occasionally until beans are tender."}, {"url": "http://www.justapinch.com/recipes/side/vegetable/peggis-fried-green-beans.html", "passage_text": "And...we use bacon in everything! You can use fresh, or canned green beans for this recipe & you will notice the difference over just green beans. The main picture is from fresh green beans (no mushrooms that day)& the other one is from canned"}, {"url": "http://www.justapinch.com/recipes/side/vegetable/peggis-fried-green-beans.html", "passage_text": "We fry everything! And...we use bacon in everything! You can use fresh, or canned green beans for this recipe & you will notice the difference over just green beans. The main picture is from fresh green beans (no mushrooms that day)& the other one is from canned green beans. They taste equally as good."}, {"url": "http://www.foodnetwork.com/recipes/food-network-kitchens/deep-fried-green-beans-recipe.html#!", "passage_text": "Toss 1 pound leftover cooked or raw green beans with 1 teaspoon salt, 1/4 teaspoon cayenne pepper and 1 cup buttermilk; soak for 15 minutes. Season 1 cup cornmeal with salt and cayenne. Dredge the green beans in the cornmeal, then deep-fry in 2 inches of 375 vegetable oil until golden brown, 2 to 3 minutes."}, {"url": "http://www.dummies.com/how-to/content/how-to-can-fresh-green-beans.html", "passage_text": "When you can green, string, Italian, or wax beans, select beans that are tender and small. Remove the ends and strings from the beans. Can them whole or cut them into 1- to 2-inch pieces."}]