[{"url": "https://en.wikipedia.org/wiki/A_Wrinkle_in_Time", "passage_text": "A Wrinkle in Time is a science fantasy novel by American writer Madeleine L'Engle, first published in 1963. The story revolves around a young girl whose father, a government scientist, has gone missing after working on a mysterious project called a tesseract. "}, {"url": "https://en.wikipedia.org/wiki/Wrinkle", "passage_text": "Causes for aging wrinkles [edit]. Development of facial wrinkles is a kind of fibrosis of the skin. Misrepair-accumulation aging theory suggests that wrinkles develop from incorrect repairs of injured elastic fibers and collagen fibers."}, {"url": "http://wrinklecream.net/Juvederm.htm", "passage_text": "Site features. Juvederm is considered to be an injectable wrinkle filler used by dermatologists and cosmetic surgeons to lessen deep skin folds and reduce lines and wrinkles. Making Wrinkle Cream Simple. Juvederm is considered to be an injectable wrinkle filler used by dermatologists and cosmetic surgeons to lessen deep skin folds and reduce lines and wrinkles."}, {"url": "http://www.whatisthebestwrinklecream.com/", "passage_text": "Just like choosing a wrinkle cream for women, men should follow a set of guidelines in purchasing a skin product. Do not be fooled by the very manly packaging or endorsements of certain skin products. It is not considered as a fool proof way of knowing which product works or not. It is advisable to choose a product that has sunscreen because the sun is the most common reason why there is premature skin aging. One wrinkle cream for men is the Korres Natural Products Ruscus & Chestnut Men’s Cream SPF 15."}, {"url": "http://www.whatisthebestwrinklecream.com/", "passage_text": "T he appearance of wrinkles and fine lines has propelled a lot of people to seek refuge in anti aging products. With the wide variety of wrinkle creams available nowadays, it is highly likely that you will find a product that will improve the overall appearance of your skin. It is advisable to choose a product that has sunscreen because the sun is the most common reason why there is premature skin aging. One wrinkle cream for men is the Korres Natural Products Ruscus & Chestnut Men’s Cream SPF 15."}, {"url": "http://www.whatisthebestwrinklecream.com/", "passage_text": "One of the wrinkle creams that many rave about is the Olay Regenerist Regenerating Serum. It has been hailed as the best wrinkle cream in the market according to Consumer Search and Consumer Reports. It is advisable to choose a product that has sunscreen because the sun is the most common reason why there is premature skin aging. One wrinkle cream for men is the Korres Natural Products Ruscus & Chestnut Men’s Cream SPF 15."}, {"url": "https://en.wikipedia.org/wiki/Wrinkle", "passage_text": "An elderly Nepali woman with facial wrinkles. A wrinkle, also known as a rhytide, is a fold, ridge or crease in the skin. Skin wrinkles typically appear as a result of aging processes such as glycation, habitual sleeping positions, loss of body mass, or temporarily, as the result of prolonged immersion in water. Development of facial wrinkles is a kind of fibrosis of the skin. Misrepair-accumulation aging theory suggests that wrinkles develop from incorrect repairs of injured elastic fibers and collagen fibers."}, {"url": "http://wrinklecreamguide.net/", "passage_text": "We know how difficult it can be to find a wrinkle cream that really works. And that’s why we’ve reviewed and rated the best wrinkle creams in the following categories: Through this review process, we’ve found the best wrinkle creams available. Prototype #37-C is the most powerful and advanced wrinkle cream on the market. While most wrinkle creams contain an average of 2-5% peptide concentration, Prototype #37-C has an unheard of 99% concentration of 6 different powerful, wrinkle-fighting peptides."}]