[{"url": "http://financial-dictionary.thefreedictionary.com/netting", "passage_text": "Netting is a process the National Securities Clearing Corporation (NSCC) uses to streamline securities transactions. To net, the NSCC compares all the buy and sell orders for each individual security and matches purchases by clients of one brokerage firm with corresponding sales by other clients of the firm. "}, {"url": "http://www.investopedia.com/terms/n/netting.asp", "passage_text": "BREAKING DOWN 'Netting'. Netting is a general concept that has a number of more specific uses. In a case in which a company is filing for bankruptcy, parties that do business with the defaulting company will offset any money owed to the defaulting company with any money owed by the defaulting company. Consolidating the value of two or more transactions, payments or positions in order to create a single value. Netting entails offsetting the value of multiple positions, and can be used to determine which party is owed remuneration in a multiparty agreement. Next Up."}, {"url": "http://www.knotsindeed.com/", "passage_text": "Netting is a fabric made by tying knots. The fabric has many holes. It is created by tying knots over plastic, wood, or metal gauges called mesh sticks. Netting is the perfect craft for the busy person who likes to work with their hands. It’s quick to make and very portable. You can make it in a variety of settings: while you wait for the doctor or mechanic, while you travel, or wherever you happen to be. It’s different, unique."}, {"url": "http://www.thefreedictionary.com/netting", "passage_text": "Now leaning on the netting of the forecastle, now on the taffrail, I devoured with eagerness the soft foam which whitened the sea as far as the eye could reach; and how often have I shared the emotion of the majority of the crew, when some capricious whale raised its black back above the waves. "}, {"url": "http://www.businessdictionary.com/definition/netting.html", "passage_text": "Definition. Settlement of mutual obligations between two parties (called bilateral netting) or with a third party acting as a clearing house (called multilateral netting) where the net difference (not the gross amounts) is carried forward. The arrangement was deemed satisfactory by both parties after the netting occurred where an intermediary determined the issues of contention. 2 people found this helpful. The netting agreement could not have come at a better time and I was so glad that things were going to be settled and remain that way for a long time."}, {"url": "http://www.investopedia.com/terms/n/netting.asp", "passage_text": "DEFINITION of 'Netting'. Consolidating the value of two or more transactions, payments or positions in order to create a single value. Netting entails offsetting the value of multiple positions, and can be used to determine which party is owed remuneration in a multiparty agreement. Next Up."}, {"url": "http://www.euronetting.com/overview/docs/What%20is%20Netting.pdf", "passage_text": "2 Copyright 2005, EuroNetting Inc. To settle the net, the netting operator then pays or receives each Participant’s net position to or from the Participant, and uses the resulting long or short currency balances to offset the FX trades. A netting system collates batches of cashflows between a defined set of entities, or Netting Participants, and offsets them against each other such that just a single cashflow to or from each Participant takes place to settle the net result of all cashflows."}, {"url": "http://www.accountingtools.com/dictionary-intercompany-nettin", "passage_text": "Definition: Intercompany netting is the offsetting of accounts receivable and accounts payable between two business entities owned by the same parent, so that payment is only made for the net difference between their receivables and payables. "}, {"url": "https://en.wikipedia.org/wiki/Netting", "passage_text": "This page is about the finance term. For the fabric called netting see Net (textile). In general, netting means to allow a positive and a negative value to set-off and partially or entirely cancel each other out. In the context of credit risk, there are at least three specific types of netting:"}]