[{"url": "http://www.dmv.org/insurance/types-of-commercial-vehicles-to-insure.php", "passage_text": "People often associate vehicles such as freight trucks or delivery trucks with commercial vehicles. What you may not realize is that any vehicle being used for business purposes can technically be considered a commercial vehicle that must be insured by a commercial car insurance policy. Commonly insured commercial trucks and vehicles include the following: 1  Passenger car or van. 2  Passenger bus. 3  Minivan. To car insurance companies, the risk of covering any vehicle used for commercial and business purposes is higher than the risk of covering cars used for personal purposes."}, {"url": "https://en.wikipedia.org/wiki/Commercial_vehicle", "passage_text": "A vehicle may be considered a commercial vehicle if it: 1  Belongs to a company or corporation. 2  Is used for business, but is in an individual's name, such as a sole proprietor. 3  Is a leased vehicle and in the name of the financial institution that owns it. 1 Is a leased vehicle and in the name of the financial institution that owns it. 2  Exceeds a certain weight or class and therefore, is classified as commercial even though it may not be commercially used or commercially owned. 3  A weight rating of 26,001 pounds or more is always consider commercial."}, {"url": "http://www.answers.com/Q/What_is_a_commercial_vehicle", "passage_text": "In New Zealand, a light commercial vehicle refers to a utility vehicle, van, or any other light (under 4500kg) vechicle that is not specifically … designed for private passenger usage. SUV's are considered as passenger vehicles. It is assigned by the manufacturer. You can find the GVWR on the VIN plate on the door or door frame of most power vehicles, and on the VIN plate on most trailers. If you add the GVWR from the Truck and trailer and it is more than 10,000 pounds, it's a commercial vehicle."}, {"url": "http://dmv.ca.gov/portal/dmv/detail/online/fee_calc/vehdef", "passage_text": "Vehicle Code Section 465. A commercial vehicle is a vehicle which is used or maintained for the transportation of persons for hire, compensation, or profit or designed, used, or maintained primarily for the transportation of property (for example, trucks and pickups). Vehicle Code Section 260. "}, {"url": "http://www.dmv.ca.gov/portal/dmv/?1dmy&urile=wcm:path:/dmv_content_en/dmv/pubs/reg_hdbk/ch13/ch13_1", "passage_text": "13.000 Commercial Vehicle Definition. A commercial vehicle is a type of vehicle: 1  Used or maintained for the transportation of persons for hire, compensation, or profit (for example, a taxi or limousine). 2  Designed, used, or maintained primarily for the transportation of property. "}, {"url": "https://en.wikipedia.org/wiki/Commercial_vehicle", "passage_text": "In the United States a vehicle is designated “commercial” when it is titled or registered to a company. This is a broad definition, as commercial vehicles may be fleet vehicles, company cars, or other vehicles used for business. 1 Is a leased vehicle and in the name of the financial institution that owns it. 2  Exceeds a certain weight or class and therefore, is classified as commercial even though it may not be commercially used or commercially owned. 3  A weight rating of 26,001 pounds or more is always consider commercial."}, {"url": "https://en.wikipedia.org/wiki/Commercial_vehicle", "passage_text": "The European Union defines commercial motor vehicle as any motorised road vehicle, that by its type of construction and equipment is designed for, and capable of transporting, whether for payment or not: (1) more than nine persons, including the driver; (2) goods and standard fuel tanks. 1 Is a leased vehicle and in the name of the financial institution that owns it. 2  Exceeds a certain weight or class and therefore, is classified as commercial even though it may not be commercially used or commercially owned. 3  A weight rating of 26,001 pounds or more is always consider commercial."}, {"url": "https://en.wikipedia.org/wiki/Commercial_vehicle", "passage_text": "A commercial vehicle is any type of motor vehicle used for transporting goods or paid passengers. 1 Is a leased vehicle and in the name of the financial institution that owns it. 2  Exceeds a certain weight or class and therefore, is classified as commercial even though it may not be commercially used or commercially owned. 3  A weight rating of 26,001 pounds or more is always consider commercial."}, {"url": "http://www.answers.com/Q/What_is_a_commercial_vehicle", "passage_text": "In General:A commercial vehicle is a type of motor vehicle that may be used for transporting goods or passengers. Some examples include: 1) Common motor vechicles: trucks; vans; semi-trucks. 2) Passenger transports: buses; taxicabs; coaches. It is assigned by the manufacturer. You can find the GVWR on the VIN plate on the door or door frame of most power vehicles, and on the VIN plate on most trailers. If you add the GVWR from the Truck and trailer and it is more than 10,000 pounds, it's a commercial vehicle."}, {"url": "http://www.dmv.org/insurance/types-of-commercial-vehicles-to-insure.php", "passage_text": "A commercial vehicle is defined as a vehicle used for business or commercial purposes. If you own a business that uses a vehicle or number of vehicles for commercial purposes, you need to insure those vehicles with a commercial auto insurance policy. To car insurance companies, the risk of covering any vehicle used for commercial and business purposes is higher than the risk of covering cars used for person"}]