[{"url": "http://www.jobshadow.com/interview-with-an-ergonomic-consultant/", "passage_text": "I will refer anyone interested in this field to check out a few websites in regards to salaries. They really vary according to company. From my research it looks like the salary range is $41,000 to $104,000. What education, schooling, or skills are needed to become an ergonomic consultant? A professional ergonomic consultant is at the minimum certified with at least a bachelor’s degree but more typically master’s degree with emphasis in human factors. in Health Care, Indoor Jobs, Jobs that are fee for service, Jobs you may not have heard of, Self Employed, Working with other professions. 4. Steve Gray talks about his career as an ergonomic consultant. You can find him and his company at www.ergohealthy.com and on his Twitter feed in the sidebar of this interview."}, {"url": "http://www.floridatechonline.com/resources/psychology/ergonomics-specialist-salary-and-career-profile/", "passage_text": "Ergonomics specialists also provide ergonomic assessments to employers by observing, analyzing and documenting workers’ movements and actions, and then presenting their recommendations. They may also train the client’s workers on proper procedures and body positioning to prevent injuries. Some specialists forecast events such as decision-making or behavior by observing groups or individuals and applying modeling or quantitative analysis to data. Collaboration with engineers, designers and clients is often part of an ergonomics specialist’s job. These professionals typically work a 40-hour week and travel to client work sites to perform their job"}, {"url": "http://www.floridatechonline.com/resources/psychology/ergonomics-specialist-salary-and-career-profile/", "passage_text": "Job Duties for Ergonomics Specialists. Whether they are employed by private firms or public hospitals, ergonomics specialists perform a variety of tasks in their everyday work. They consult with clients on ways to control workplace hazards and create a safe and productive environment. Some specialists forecast events such as decision-making or behavior by observing groups or individuals and applying modeling or quantitative analysis to data. Collaboration with engineers, designers and clients is often part of an ergonomics specialist’s job. These professionals typically work a 40-hour week and travel to client work sites to perform their jobs"}, {"url": "http://ca.indeed.com/Ergonomic-Specialist-jobs-in-Ontario", "passage_text": "GE Power & Water 36 reviews-Toronto, ON. Assist with ALARA, ergonomic, industrial hygiene projects and other safety initiatives at the plant. As a key member of the GE-Hitachi's Environment Health &... GE Careers - 16 days ago-save job-more... Manufacturing Engineering Specialist*. Senior Process Manufacturing Engineering Specialist. Thorough knowledge of Health & Safety Act, Ergonomics, Time Studies,..."}, {"url": "http://www.indeed.com/q-Ergonomics-Specialist-jobs.html", "passage_text": "Follow all established ESD, safety, ergonomic and security policies. The primary role of this position is to solder surface mount and through-hole components... "}, {"url": "http://www.floridatechonline.com/resources/psychology/ergonomics-specialist-salary-and-career-profile/", "passage_text": "National salary data on CareerBuilder.com indicated that ergonomics specialist incomes ranged between $55,073 and $108,283 as of August 2010, with an average salary of $77,654. Some specialists forecast events such as decision-making or behavior by observing groups or individuals and applying modeling or quantitative analysis to data. Collaboration with engineers, designers and clients is often part of an ergonomics specialist’s job. These professionals typically work a 40-hour week and travel to client work sites to perform their jobs"}]