[{"url": "https://en.wikipedia.org/wiki/Typhoid_fever", "passage_text": "Typhoid fever, also known simply as typhoid, is a symptomatic bacterial infection due to Salmonella typhi. Symptoms may vary from mild to severe and usually begin six to thirty days after exposure. Typhoid is spread by eating or drinking food or water contaminated with the feces of an infected person. Risk factors include poor sanitation and poor hygiene. Those who travel to the developing world are also at risk. Humans are the only animal infected."}, {"url": "http://www.medicalnewstoday.com/articles/156859.php", "passage_text": "Typhoid fever ultimately is caused by the Salmonella typhi bacteria, and it is most commonly transmitted through the fecal-oral route. That is, patients with typhoid can contaminate the water supply with their stool, where the bacteria flourish. Typhoid fever and paratyphoid fever are clinically indistinguishable diseases, collectively called enteric fever. It easily spreads through contaminated food and water supplies and close contact with others who are infected. The illness is characterized by very high fever, sweating, gastroenteritis, and diarrhea."}, {"url": "http://www.nhs.uk/Conditions/Typhoid-fever/Pages/Introduction.aspx", "passage_text": "Typhoid fever is a bacterial infection that can spread throughout the body, affecting many organs. Without prompt treatment, it can cause serious complications and can be fatal. It's caused by a bacterium called Salmonella typhi, which is related to the bacteria that cause salmonella food poisoning. Typhoid fever is highly contagious. An infected person can pass the bacteria out of their body in their stools (faeces) or, less commonly, in their urine."}, {"url": "http://www.medicalnewstoday.com/articles/156859.php", "passage_text": "Typhoid fever is an infectious disease caused by the bacteria Salmonella typhi. It is also known as enteric fever, or commonly just typhoid. Typhoid fever and paratyphoid fever are clinically indistinguishable diseases, collectively called enteric fever. It easily spreads through contaminated food and water supplies and close contact with others who are infected. The illness is characterized by very high fever, sweating, gastroenteritis, and diarrhea."}, {"url": "http://www.medicinenet.com/typhoid_fever/article.htm", "passage_text": "Typhoid fever is an acute illness associated with fever that is most often caused by the Salmonella typhi bacteria. It can also be caused by Salmonella paratyphi, a related bacterium that usually leads to a less severe illness. 1 Typhoid fever is contracted by the ingestion of contaminated food or water. 2  Diagnosis of typhoid fever is made when the Salmonella bacteria is detected with a stool culture. 3  Typhoid fever is treated with antibiotics. 4  Typhoid fever symptoms are poor appetite, headaches, generalized aches and pains, fever, and lethargy."}, {"url": "http://www.news-medical.net/health/What-is-Typhoid.aspx", "passage_text": "By Dr Ananya Mandal, MD. Typhoid fever is an infection caused by a strain of bacteria called Salmonella typhii, which is related to the bacteria that causes salmonella food poisoning. The infection can affect the whole body and damage multiple organs. Unless treated, this infection can have life threatening consequences. "}, {"url": "http://www.webmd.com/a-to-z-guides/typhoid-fever", "passage_text": "Typhoid fever is contracted by drinking or eating the bacteria in contaminated food or water. People with acute illness can contaminate the surrounding water supply through stool, which contains a high concentration of the bacteria. Contamination of the water supply can, in turn, taint the food supply. It can also be caused by Salmonella paratyphi, a related bacterium that usually causes a less severe illness. The bacteria are deposited in water or food by a human carrier and are then spread to other people in the area."}, {"url": "http://www.webmd.com/a-to-z-guides/typhoid-fever", "passage_text": "Typhoid fever is an acute illness associated with fever caused by the Salmonella typhi bacteria. It can also be caused by Salmonella paratyphi, a related bacterium that usually causes a less severe illness. The bacteria are deposited in water or food by a human carrier and are then spread to other people in the area."}, {"url": "http://www.mayoclinic.org/diseases-conditions/typhoid-fever/basics/definition/CON-20028553", "passage_text": "Definition. Typhoid fever is caused by Salmonella typhi bacteria. Typhoid fever is rare in industrialized countries. However, it remains a serious health threat in the developing world, especially for children. Typhoid fever spreads through contaminated food and water or through close contact with someone who's infected."}, {"url": "http://www.cdc.gov/vaccines/hcp/vis/vis-statements/typhoid.html", "passage_text": "Typhoid (typhoid fever) is a serious disease. It is caused by bacteria called Salmonella Typhi. Typhoid causes a high fever, fatigue, weakness, stomach pains, headache, loss of appetite, and sometimes a rash. If it is not treated, it can kill up to 30% of people who get it. Some people who get typhoid become carriers, who can spread the disease to others"}]