[{"url": "http://www.ancestry.com/name-origin?surname=-broussard", "passage_text": "You can use census records and voter lists to see where families with the-broussard surname lived over the years. While the questions in census records vary from place to place, and year to year, you can generally find information like name of household members, ages, birthplaces, residences, occupations, etc."}, {"url": "http://genealogy.familyeducation.com/surname-origin/broussard", "passage_text": "Last name origins & meanings: 1  Southern French: variant of Brossard. 2  The Broussard families of LA trace their ancestry to two Acadian brothers, Joseph and Alexandre, also called Beausoleil, who arrived in New Orleans in 1765."}, {"url": "http://www.archives.com/genealogy/family-history-broussard.html", "passage_text": "Broussard Genealogy & History. Broussard is a French name, derived from the French brosser meaning to scrub, and was originally a nickname meaning brush, perhaps an occupational name. Broussard family history dates back to very early times in Languedoc in southern France, historically called the county of Toulouse."}, {"url": "http://www.archives.com/genealogy/family-history-broussard.html", "passage_text": "Variations on this name are very numerous, complicating Broussard genealogy, including Brossard, Broussaie, Brousse, Brousser, Brousset, Broussette, Broussey, Brussai, Brussay, Brusse, Brusser, de Brousset, and many more. In America, the first settler was Sceviot Broussard, who emigrated to New York in 1668."}, {"url": "http://www.ancestry.com/name-origin?surname=broussard", "passage_text": "Click on a place to view Broussard immigration records. The information for this chart came from the U.S. Immigration Collection at Ancestry. You can find out where the majority of the Broussard families were living before they immigrated to the U.S and learn where to focus your search for foreign records. Immigration records can tell you an ancestor's name, ship name, port of departure, port of arrival, and destination. from the New York Passenger Lists."}, {"url": "http://www.searchforancestors.com/surnames/origin/b/broussard.php", "passage_text": "Trace your Broussard family in the vast resources of the Mormon LDS genealogy online databases which includes the Ancestral File, transcribed census records, extracted church records from around the world, family trees, and the International Genealogical Index."}]