[{"url": "http://www.medsci.org/v08p0547.htm", "passage_text": "The most severe complication of third molar surgery is mandibular fracture. Iatrogenic mandibular fracture associated with the removal of teeth, which can occur during the procedure or at a later time, is rare; reported incidences range from 0.0034% to 0.0075% (6, 7)."}, {"url": "http://www.medsci.org/v08p0547.htm", "passage_text": "The extraction of impacted mandibular third molars is a common dental procedure. The reasons for extracting these teeth include acute or chronic pericoronitis, the presence of cysts or a tumor, periodontal problems, the pres­ence of a carious lesion, and preparation for orthodontic treatment or orthognathic surgery (1)."}, {"url": "http://emedicine.medscape.com/article/82774-overview", "passage_text": "Equipment. Tooth extraction is performed either in a dental office by a dentist or in an oral surgery suite by an oral and maxillofacial surgeon. In either case, the suite is equipped with dental chair and a good source of operating light."}, {"url": "http://www.osachicago.com/oral-surgery-procedures/wisdom-teeth.html", "passage_text": "A full complement of teeth is 8 incisors, 4 canines, 8 premolars and 12 molars divided equally between the upper and lower jaws and totaling 32 teeth. Three molars occupy the back of your left and right sides, the last one of which is termed the third molar or wisdom tooth. This is usually the last tooth to erupt."}, {"url": "http://emedicine.medscape.com/article/82774-overview", "passage_text": "Tooth extraction is linked to dentists who perform oral surgery. Teeth that are embedded in bone (eg, impacted or wisdom teeth) must be removed by an oral and maxillofacial surgeon who is trained for 4-6 years after obtaining a dental or medical degree."}, {"url": "https://www.sylvainchamberland.com/en/dentition-en/wisdom-teeth/", "passage_text": "Here is a typical example of a case (age at surgery = 17 years 8 months) where the third molar was extracted a minimum of 6 months prior to the orthognathic surgery. Bicortical screws are used for the fixation of bone segments. Note the proximity of the screws compared with the extraction site (white dotted line)."}, {"url": "http://emedicine.medscape.com/article/82774-overview", "passage_text": "Like any other minor surgical procedure, tooth extraction requires careful medical evaluation of the patient. Patients with diabetes, hypertension, renal disease, thyroid disease, adrenal disease, or other organ disease must be treated and their disease controlled before tooth extraction."}, {"url": "http://www.jawpain.com/oral-surgery-austin-tx/wisdom-teeth-extractions.html", "passage_text": "However, the average mouth is made to hold only 28 teeth. It can be extremely painful when 32 teeth try to fit in a mouth that only holds 28 teeth. These four other teeth are your Third Molars, also knows as wisdom teeth."}]