[{"url": "http://www.mybudget360.com/how-much-does-the-average-american-make-breaking-down-the-us-household-income-numbers/", "passage_text": "The latest Census data has the median household income in the US at $50,500. But as the chart above highlights one out of four US households are living with less than $25,000 per year in household income. "}, {"url": "https://www.irs.gov/individuals/international-taxpayers/expatriation-tax", "passage_text": "1 Your average annual net income tax for the 5 years ending before the date of expatriation or termination of residency is more than a specified amount that is adjusted for inflation ($147,000 for 2011, $151,000 for 2012, $155,000 for 2013 and $157,000 for 2014). "}, {"url": "https://en.wikipedia.org/wiki/Household_income_in_the_United_States", "passage_text": "1 In 2013, real median household income was 8.0 percent lower than in 2007, the year before the latest recession. 2  Real median household income averaged $50,781 from 1964-2013, ranging from a low of $43,558 in 1967 to a high of $56,895 in 1999. Household income is measured in various ways. One key measure is the real median level, meaning half of households have income above that level and half below, adjusted for inflation. According to the Federal Reserve, this measure was $51,939 in 2013, below the 1999 peak of around $57,000."}, {"url": "https://en.wikipedia.org/wiki/Household_income_in_the_United_States", "passage_text": "Overall, the mean household income in the United States, according to the US Census Bureau 2014 Annual Social and Economic Supplement, was $72,641, or $20,702 (39.86%) higher than the median household income ($51,939). Household income is measured in various ways. One key measure is the real median level, meaning half of households have income above that level and half below, adjusted for inflation. According to the Federal Reserve, this measure was $51,939 in 2013, below the 1999 peak of around $57,000."}, {"url": "http://www.fool.com/investing/general/2015/01/18/how-does-your-income-stack-up-against-the-average.aspx", "passage_text": "By the numbers. According to the Bureau of Labor Statistics, the average American worker got paid $24.57 per hour in December, or $850.12 per week. That was up from $24.17 per hour and $829.03 per week a year ago. However, average income can be misleading given that wages differ significantly from industry to industry. "}, {"url": "http://www.answers.com/Q/What_is_the_average_income_of_US_citizens", "passage_text": "The average income of Canadian citizens is about $58,000 per year.  This is according to statistics released in February 2014 assessing  the income per capita.E. ê The current richest famil … y in Cuba is the Castro family. Forbes magazine estimates their net worth over $4,000,000,000.00 (US Dollars) (Four Billion) The exchange rate is approximately 27.5 pesos to a dollar. The average wage in Cuba is approximately 180.00 pesos or approximately $6.50 per month."}, {"url": "http://www.dailymail.co.uk/news/article-2488169/American-dream-alive-US-ranks-highest-average-annual-income.html", "passage_text": "Land of opportunity: In the U.S., the average household net-adjusted disposable income is $38,001 a year, more than the OECD average of $23,047. It found life satisfaction scores dropped by more than 20 per cent in Greece over the five years to 2012, while Spain saw a fall of 12 per cent and Italy a drop of 10 per cent. In the U.S., people earn $54,450 a year on average, much more than the OECD average of $34,466 and the highest rate across the OECD. But there is a substantial gap between the richest and poorest, with the top 20 per cent of the population earning eight times as much as the bottom 2"}, {"url": "https://answers.yahoo.com/question/index?qid=20060728082454AAaRoCG", "passage_text": "Sorry, something has gone wrong. Best Answer: Average wage for resident of Johnson County, Kansas (where you, Mr. Jayhawk, are likely to reside when you graduate) is $20/hour or roughly $40,000 per year. More recently, the White House reports that the average hourly earnings of nonsupervisory workers was $15.54 in March 2004. The White House also gets its information from the Bureau of Labor Statistics, which states that in that same month, the average wage for workers in the private sector was around $520 a week."}, {"url": "https://answers.yahoo.com/question/index?qid=20060728082454AAaRoCG", "passage_text": "Narrowing our search to salary, we found that the Bureau of Labor Statistics reports the average annual wages in the U.S. as $36,764 for 2002. More recently, the White House reports that the average hourly earnings of nonsupervisory workers was $15.54 in March 2004. The White House also gets its information from the Bureau of Labor Statistics, which states that in that same month, the average wage for workers in the private sector was around $520 a week."}, {"url": "http://www.answers.com/Q/What_is_the_average_income_of_US_citizens", "passage_text": "The highest wage in Cuba is 600.00 pesos per month for a medical doctor who is also a specialist. The current richest famil … y in Cuba is the Castro family. Forbes magazine estimates their net worth over $4,000,000,000.00 (US Dollars) (Four Billion) The exchange rate is approximately 27.5 pesos to a dollar. The average wage in Cuba is approximately 180.00 pesos or approximately $6.50 per month."}]